[
{"review": "\nIt is incomprehensible to me that I watched the same movie that the\nmajority of reviewers of this movie on IMDb seemed to. Perhaps I was\nunknowingly sucked into a blackhole, wormhole, or plot hole that most\nof the other reviewers of this movie managed to avoid. All I know is\nthat my hard-earned money was sucked into this monstrosity along with\nme and for that I am truly regretful. Like a few other commenters, I\nhad absolutely no feelings or connection with any of the characters,\neven hoping at times that they would all fail in their meaningless\nendeavors. A ridiculous premise with outlandish and unscientific bases,\nvery little of this movie makes any sense at all. It amazes me that\nNolan was able to draw the acting talent to this waste of time, as\ntheir considerable skills are completely wasted on this drivel.<br><br>I should note that on several occasions, I actually couldn't help but\nlaugh out loud at the absurdity, and that fact was truly telling for\nme.<br><br>Mr. Nolan, et al - you owe me two hours and forty-nine minutes of my\nlife back!\n"},
{"review": "\nMy honest rating would be 6 for that movie but I rated it 1 to balance\nthe \"emotional\" ratings. Cast and the part with Matt Damon were good.\nThe rest was a bad combination of Gravity, 2001: A Space Odyssey, a bit\nMr. Nobody in the wrap of a lot of useless drama... If you have a\nthinking mind which does not surrender to the dirty drama games of the\ncommercial script writers then your brain cells will hurt like a b...\nafter seeing that much nonsense. Unfortunately, that is the destiny of\nalmost all movies playing with the time concept except the Back to the\nFuture trilogy. What concerns me more than the quality of the movie\nitself is the number of blown-up ratings threatening the credibility of\nIMDb, which I always trust. Who are you people? Some fake rating\ngenerator AI? Thousands of people voting for 1$ per day? Last words:\nDon't go! They don't deserve your money because they did not put enough\neffort to create a meaningful story and I would accept any meaning in\nits own logic.\n"},
{"review": "\nthis movie was awful, I was deceived by the fake rating. it was full of\npseudoscience, so superficial and boring. every single minutes could be\nchallenged by a science professional. being a PhD student in science, I\nenvy SciFi script writers and directors that they can pop up any\nbullshit and be praised by non-professional audience. such a ridiculous\nrobot, underground NASA that launches billion dollar projects in famine\na condition, the huge tide on that planet without considering the depth\nof water, entering the black-hole unprotected, LOVE being the 5th\ndimension, contacting through black-hole by pushing the books! Oh my!\ncan anybody be more superficial about science? my advice to anybody who\nhas a critical mind: don't waist your time.\n"},
{"review": "\n(((WOW)))...!!!<br><br>It's almost impossible to put in words, but we have to try and give\neveryone what he truly deserve.<br><br>In my modest opinion, Interstellar is the best Sci-Fi in human history.\nBelieve it or not. It's the simple and the complicated, It's the usual\nand the different, It's the mind and the heart, It's an emotional and\npsychological journey through the unknown which has its own stunning\nvisuals. It's an original story and thought-provoking masterpiece.<br><br>Every single time with him, you just got crazy about his ideas,\nastonished by his mind games and inspired when he talks to the heart.<br><br>Back then, he was an ambitious young director. And with his\ncapabilities made his own way straight through the world. Now, he is an\nicon and a legend of directing. He is Christopher Nolan...<br><br>Really guys, what's wrong with this guy ?!! what's going on inside his\nhead ?!!<br><br>It's our job to honor the honorable. Please, Just keep the rating UP,\nwhy ? Because Chris. and Interstellar deserve it.\n"},
{"review": "\nIf you saw \"sunshine\" and thought \"wow, good thing they had scientist\nadvisers, this stuff is so plausible\", you will like \"interstellar\".<br><br>If you saw \"armaggeddon\" and thought \"what an awesome movie, i just\nwished they would have dragged the scene where he says goodbye to his\ndaughter out even more\", you will like \"interstellar\".<br><br>If you saw \"inception\" and thought \"this movie would be so much better\nin SPACE!\", you will like \"interstellar\".<br><br>And if you liked \"2001\" or any other intelligent/geeky sci-fi movie,\nyou will hate \"interstellar\".<br><br>Like some of Nolan's earlier works, it's long for the sake of length\nonly. Its plot is up there with \"armaggeddon\" in pure stupidity and\nforced US-cowboy-patriot-macho-ism, its special effects are\nunderwhelming, its plot twists are obvious, its setting makes no sense,\nits characters are flat and forgettable, and its constant citations of\n\"2001\" just serve to make you remember how much better Kubrick did all\nof this with a tiny fraction of the money almost 50 years back.<br><br>Disappointing.\n"},
{"review": "\nI never write reviews about movies but having seen the ratings on this \r\nsite, I have to say something to stop people from being misled about \r\nthis so called blockbuster.\r\n\r\nThe movie is total rubbish and made no sense, the acting is dreadful \r\nand watching it after an hour, made me wish everyone died so I could \r\nend my pain.\r\n\r\n3 hours of my life that I will never get back. Do not waste your time \r\nwatching this movie, and if you do, just remember I warned you first.\r\n\r\nStay clear\n"},
{"review": "\nInterstellar: One of the worse films I've seen in a long time, 170mins\nof self indulgent rubbish. Slow and tedious does not even begin to\ndescribe this $160 million piece of nonsense. The Horrible Church organ\nHans Zimmerman music score often drowns out the dialogue so badly that\nthe sound mix must have been done by Helen Keller!. Terrible \"special\"\neffects that look like they come from a movie made in the 70's. A\nShameless rip-off from 2001, Gravity, Dark Star, Contact to mention\njust a few. Awful, wide-eyed hammy performances from all concerned. A\nterrible nonsensical script with enormous plot holes and hilariously\nbad \"science\". Christopher Nolan should never be allowed to make\nanother film again! I Deeply regret those 170 minutes that this\nmonstrosity has taken out of my life, unfortunately there's no wormhole\nthat can take me back before I made the unfortunate decision to see\nthis film.\n"},
{"review": "\nI do not know what kind of PR team the production team has hired to\npromote this film, but obviously they are doing great job as it has\nalready higher score than Inception... Seriously guys??? This film has\n5/10 stars at best, and even that for just potential. Rest of it is\nlost because the film has absolutely no logic to it.<br><br>Stupid, illogical and at times really boring and long. Even though I am\nno scientist, it was so stupid on so many levels with even the most\nbasic of facts that I have no comments to this....<br><br>Set your expectations low- no way in hell does this film deserve any of\nthat praise posted here....\n"},
{"review": "\nI can't fathom how half the reviews on this website are a perfect 10\nstars. I don't see even a fraction of the general public understanding\nand enjoying all three hours of this movie. These votes were obviously\nbought. Sound and visuals - Pretty Decent. The Plot, Characters,\nThemes, and \"Science\" were all lacking. Logic was lacking. I can\nusually live with a couple suspensions of belief in a movie, but there\ntended to be something new irking me every half hour and the movie\nnever resolved itself. At least follow your own rules, Interstellar.\nHoles - lots of them glaring big and bright and I couldn't even\nsummarize all of them to fit in this review. If you haven't seen it,\nrent it in three months and fall asleep watching it. Your time is\nbetter spent sleeping.\n"},
{"review": "\nYesterday I watched the movie \"Interstellar\". A poorly scripted and\npoorly directed movie with an over-simplified pseudo-science and\nspoon-fed philosophical implications, basically a typically overrated\nHollywood movie which takes no shame in copying from 2001: A Space\nOdyssey from Kubrick with none of its beauty, simplicity and none of\nits art. It shows that in 1968 they were able to make a masterpiece and\nin 2014 they can't even copy it decently. The fact that on IMDb it has\nan higher rating than the Kubrick masterpiece makes me lose all faith\nin the progress of humanity and in our current generation. I will watch\n2001: A space odyssey again to forget about it and restore faith in\nhuman kind again.\n"},
{"review": "\nThis film is an anti-intellectual zenith. It is offensive at least for\nsomeone who has a rudimentary knowledge of astrophysics and the theory\nof relativity. I have never seen such s-f movie full of nonsense. At\nleast in the last 20 years. Every single law of physics is broken or\nadjusted to Hollywood pulp. Ethical problems concerning time travel\nwere already discussed 60 years ago. Medea/Gaia hypothesis is an old\nfairy tale. Pseudo- philosophical use of feelings with respect to the\nmulti-dimensional time-space is simply ridiculous. Situations that\noccur in the vicinity of the event horizon: I can only say: serious\ncase of ignorance. And standard use moral treatise about human nature\nbased on common sense is too obvious. Someone who makes movies based on\ncomic books shouldn't be allowed to make a s-f movie. Really bad\nchoice!! I am disappointed. Very disappointed. 1 point is for the\nrobots. Best regards.\n"},
{"review": "\nAll of the fanboys and girls must have also been in love with \"The\nEmperor Has No Clothes\" too. <br><br>This story is thin, the characters are under developed, the emotional\nand logical shortcuts are ridiculous, Matt Damon is horribly cast and\nhas become a caricature of himself, the set pieces are not inspiring,\nthe music cues try to be bombastic enough to create emotion that simply\ndoesn't exist and the science is a mess. <br><br>When a self-important filmmaker reaches a level of success where no one\nwill tell them \"no\" anymore, this is what comes of it. The scientific\nequation that sums up this film is as follows: Nolan + Interstellar =\nLucas/Spielberg + Crystal Skull. <br><br>A completely unremarkable and forgettable film. The Emperor truly has\nno clothes.\n"},
{"review": "\nThis is weird... I love Science Fiction and I love astrophysics, but\ndisliked everything about this movie. The start was extremely slow and\nit was hard to stay awake. The second half of the movie was somewhat\nbetter but felt like a very cheap rip-off of Space 2001. The movie just\ndidn't do it for me at all and the acting was average. I'm totally\nflabbergasted that the average rating stands at 9 out of 10. Maybe\naudiences have lost the notion of quality, story-line, plot, acting,\nand uniqueness - as this movie doesn't have any of it. Ah well, I guess\nI'll just have to wait for the next SF movie and hope it will be\nsomewhat better, because I am deeply disappointed by Interstellar as I\nexpected so much more from a movie with an estimated budget of $165\nmillion.\n"},
{"review": "\nI waited with great anticipation for this movie and was sorely and\ntruly disappointed. I don't understand where the 10 reviews came from?\nWhat planet were they on! Perhaps they were from viewers from the other\nside of the worm hole or black hole! I have been a sci fi fan for many\nyears but this movie took a leave from all logical or good sci fi\nexplanations. Plot was ambiguous. Storyline convoluted. Technology was\nnot linear. One sees a 20th century Saturn V lifting the crew up to a\n22nd century space craft. Sleep pods with crew jumping into them like\nthey are going for a nap! Exploratory craft that operate like a Star\nWar's movie. Landing on a water world with some silly time dilation\ntheme that doesn't affect craft in orbit? Can't these people survey the\nworld from orbit? Black holes, 5 dimensions with metaphysical\nconnection! Shameless referrals to 2001. It was embarrassing. On and on\nfor way too long. Han Zimmer's music score was good with a few good\nspecial effects. But that was it.\n"},
{"review": "\nThis movie is not a 1 in reality, it's more a 5-6, but i need to make\nthat stupid average rating go down.<br><br>I couldn't understand why this movie has a 9.0 in IMDb. But now reading\nthe comments here I finally get it, it's good advertisement, the best\nadvertisement that I have seen in many years.<br><br>This movie will drive you crazy if you know something about\nastrophysics (or normal physic) and you have seen enough movies in your\nlife. Because there are way too many clichés and too many\npseudo-physics, not fake physics like the Disney's films,\npseudo-physics like 'ancient aliens' from \"History\" Channel.<br><br>PS: Sorry for my English.\n"},
{"review": "\nThe most pointless pack of poo ever made. <br><br>If you enjoy science fiction do not watch this dog under any\ncircumstances.<br><br>It was like a very long boring sappy, idiotic episode of the twilight\nzone.<br><br>Gravity and time transmitted across dimensions, and lest we forget also\nlove, FFS what kind of moron wrote this drivel.<br><br>I guess that cosmically transmitted love is the reason there is no\nmilitary in the future, even though resources are beyond scarce.<br><br>And hmmmm what seems more difficult, using NASA's technology to\ntransform a barely habitable planet circling a black hole, (with no sun\nFFS) or to transform, what was that other planet? Oh that's right\nEarth. <br><br>I see no need to detail the rest of the stupidity of the \"physics\" in\nthis movie. They should have simply made McMconaughey a wizard, it\nwould have made more sense.<br><br>But I must mention the magical space ship that can achieve escape\nvelocity from a planet with 130% of Earth's gravity, ummm why didn't\nthey use that rather than a massive 3 stage rocket to escape Earth?\n"},
{"review": "\nThe Plot:<br><br>In the near future, Earth has been devastated by drought and famine,\ncausing a scarcity in food and extreme changes in climate. <br><br>When humanity is facing extinction, a mysterious rip in the space-time\ncontinuum is discovered, giving mankind the opportunity to widen its\nlifespan. <br><br>A group of explorers must travel beyond our solar system in search of a\nplanet that can sustain life. <br><br>The crew of the Endurance are required to think bigger and go further\nthan any human in history as they embark on an interstellar voyage into\nthe unknown. <br><br>Coop, the pilot of the Endurance, must decide between seeing his\nchildren again and the future of the human race.<br><br>NASA's version of Sophie's Choice.<br><br>It's a horrible movie and I am shocked anyone likes it. Firstly, it\ndoesn't get moving until nearly an hour into this crapola. By then most\nus us have checked out and have no interest.<br><br>The plot is idiotic and not even marginally based in the realm of\nscientific possibility.<br><br>I genuinely hated this movie.\n"},
{"review": "\n(Spoiler Alert!)<br><br>I can't believe that there are so many glowing reviews of this movie.\nOn the plus side: brilliant CG, FX, cinematography. On the negative\nside: the awful acting, the terrible plot, the script, the hokey comic\nbook physics explained for the lowest common denominator in the\naudience.<br><br>I really liked McConaughey in Dallas Buyer's Club - by far the best\nthing he's done to date. But in this movie? Just another fly-by-the-\nseat-of-the-pants astronaut, risking everything and everyone, but it\nall works out in the end. Of course.<br><br>Way too much time at the start of the movie setting up the ending,\nwhich came as no surprise whatsoever, thanks to the 'ghost'. And then\nwe discover that 'love conquers all'. Including science. Of course.<br><br>Probably most of the reason I rated this so low is because with a name\nlike 'Interstellar' I was expecting way too much depth on the\nintricacies of theoretical interstellar travel, the time relativity\nconcept, et al. Sigh.<br><br>And the smart-ass, wisecracking robot was the last straw.<br><br>Just. So. Bad.\n"},
{"review": "\nMy girlfriend and I decided to watch this movie at home as we missed it\nwhen it was doing the rounds in our local cinema. How glad we were, for\nat least it meant we were able to sip on our wine and chat in between -\nwhich we would have not been able to do had we watched in the cinema.\nAnd we did a LOT of chatting, mostly about the direness of the film\nitself. I can't believe so many reviewers thought this film to be\namazing (but then we're all entitled to our opinions - and we all know\nhow opinions differ to the extremes at times). However, I honestly\ncouldn't connect with ANY of the characters in this film - particularly\nthe leads. I really have no words...just found the whole film totally\nridiculous - and don't even get me started on Hans Zimmer's background\nmusic!!! We needed subtitles for some scenes as the music was so\noverpowering we couldn't hear a word that was being said. I was even so\nbored at one point that I started to imitate Matthew McConaughey's\nirritating 'whistle' as he speaks. Enough said methinks.\n"},
{"review": "\nThere is no way on earth that these positive reviews are real. This\nwas, hands down, the worst movie experience of my life. It made Shark\nBoy and Lava Girl seem like a masterpiece. (Both of these movies were\nseen at the urging of the same son---albeit almost a decade apart). I\ncannot believe I ruined date night with my wife over this 3 hour\nhell-fest. I alternated between scratching my head, holding back\nlaughing, wanting to yell out jokes about Lincoln commercials and not\nbeing able to hold back laughing. Based on the looks from everyone else\nas they were leaving the theater, we all shared the same sentiments. Go\nahead, blow $10 on this miserable, ridiculous, implausible pile of\npoopy that would make M Night Shamalyan scream out \"you have got to be\nfriggin' kidding me\" at the movies attempts at plot twists.\n"},
{"review": "\nWhat a huge pile of steaming poop! I could not believe that the movie\ncritics gave this horrible movie a 9.2 rating.<br><br>The movie is slow as hell. The characters are so badly developed that\nyou never care for them. Good actors play characters that appear in the\nmovie juts to be disposed off soon after.<br><br>The special effects are pretty weak. You see the spaceship vibrating\nall the time but the faces of the actors are not reflecting the shaking\nor the gravitational pulls. But, of course, they make lots of ugly\nfaces. You should see the movie Stealth to learn a thing or two about\nthis kind of special effects.<br><br>The robot is the most ridiculous thing in the movie.<br><br>The plot is just so far fetched that I caught myself smiling at times.<br><br>Who let the writer into the cutting room?! 3 Hours! Are you serious?!\nOnly an unabashed Christopher Nolan fanboy would have the courage to\nclaim to have found any redeeming quality on this \"practical joke\".<br><br>$200,000,000.00 US Dollars. What a waist!\n"},
{"review": "\nIt's a shame that people are rating this movie so high. I registered\njust to put some sense into IMDb. I actually don't believe in the\nratings of this site anymore. Possible explanation for a high rating is\nthat people are paid to rate the movie or most people think they are\ngeniuses if they tell their friends that they love a sci-fi\nmind-blowing movie even though that movie actually doesn't make sense.\nI love Nolan but he dropped the ball on this one. This has potential\nbut he created a mess out of it. A lot of scientific inconsistencies,\nuseless characters, messy plots. One of the most overrated films ever.\nLet's bring back some credibility in this site\n"},
{"review": "\nWatched 2001 space od. instead. <br><br>How can this film get a higher score on IMDb than a classic proper sci\nfilm and not some family drama stretched out and a bit of futuristic\nspice?<br><br>I can only think this gets such a high rating due to viewers not seeing\nold films and being won over by modern day bandwagons to jump on.<br><br>Also the lead character is so wooden. He acts like a 2 by 4. And he\nmumbles his stiffly delivered bits. This would not matter in a proper\nsci-fi film but here in this melodrama masquerade it does matter.<br><br>Or really it doesn't matter. This is over rated tripe.\n"},
{"review": "\nAM I THE ONLY ONE ON PLANET EARTH WHO THINKS THAT THIS FILM IS ABSOLUTE\nTOSH? Perhaps I'm being unkind because I could only handle an hour\nbefore walking out. I thought the acting in particular was very poor.\nThe storyline is twaddle - a farmer with flight experience finds NASA\nin an unspecified location with a rocket that is going to save Earth -\na typecast Michael Caine (thank goodness it wasn't Morgan Freeman)\nopens the boardroom door and there is the rocket!. It seemed to me that\nused actual rocket launch footage? The time element is misused and the\nspecial effects are not that great. I thought Elysium knocked socks off\nthis film. I did semi enjoy the water sequence but it was at the point\nwhere they get back to the mother ship that I walked ................\nvery quickly out of the cinema. Ps I love Matthew McConaughey in true\ndetective and I can't believe I was looking at the same actor\n"},
{"review": "\nI really don't see how everyone is giving such great reviews of this\nmovie!!!! It's one giant plot hole from which no stars can escape.<br><br>Say what you like about Nolan's film making style, but this movie\nshould have never been made. <br><br>Throughout the overly long self indulgent piece of crap I said many\ntimes that this movie had better end REALLY well... <br><br>Of course it's just one notch above the worst ending I can think of for\nit.<br><br>I think they killed all the consultants off before they started filming\ntoo. <br><br>Just SAVE YOURSELVES!!! RUN, Don't WATCH IT!\n"},
{"review": "\n8.8? I'm just not feeling it.<br><br>Total \"snoregasm\", I swear. It's VERY slow to start, then disappointing\nonce it does get going. I'm one of those that has to finish nearly\nevery movie and book I start, no matter how bad. It took me 3 days to\nfinish watching because I could only stand about 40 boring ass minutes\nat a time. Quasi-science muddled with current theory and overstretched\nartistic license, and let's face it; McConaughey as \"humanities last\nhope\"? Yeah, we'd be screwed. He's not altogether that bad, but in\nreality the coolest thing about him is his Air-stream. The\nimprobability levels in the \"science\" and the story make it difficult\nto get into it.\n"},
{"review": "\nI think I watched the same film as all the others on here that disliked\nit. I enjoyed the cinematography and the effects but there is really\nnothing else about this film I can say I liked.<br><br>I think Matthew McConaughey is a great character actor but in this film\nhe just didn't fit, for me. His voice, stance, mannerisms all seem out\nof place. Like he just didn't care and wanted the paycheck. Not that\nall the blame for the bad film can be put on his shoulders. The rest of\nthe cast, all but a small few of them, just weren't entertaining.<br><br>From the maker of Inception I expected more. What I got was nearly 3\nhrs of not a very good film.<br><br>3/10 for the visuals. That's all I got. Disappointed.\n"},
{"review": "\nI was excited for this movie. I liked pretty much all of Nolan's\nprevious movies and I love sci-fi. Judging from the reviews, I was\nexpecting something similar to the quality and entertainment of\nInception. What I got was probably one of the most boring movies I've\nseen on cinema.<br><br>The movie is unnecessary long, the dialogs are predictable and make you\nlaugh, and the subject of the movie (which btw is not interstellar\ntraveling) has been done several time before (awfully usually). We get\nit. Family is important, love is valuable. This is not a sci-fi movie,\nthis is his is a family movie about a father's love for his children.<br><br>I will not go into details to avoid spoilers, but there were about 10\nminutes after the first slow hour that got me excited for the rest of\nthe movie, but it was only a break and we were back to boredom and more\ncrying by McConaughey. I found the acting pretty bad, which I guess is\na result of the awful script, since I liked McConaughey's acting on\nDallas Buyers Club (and partially on true detective).\n"},
{"review": "\nThis awkward movie felt like Sci Fi produced by a technical, corporate\nentity. The idea was fairly cute. Much depended on the mourning by the\ndaughter, but the actress didn't make me care about her. The\nprotagonist didn't make me care about him either, for that matter. I\nthought the female astronaut was quite engaging but the movie was the\nmost interesting, her choices, angst and suffering were the only\ninteresting thing about the movie. The Black Hole stuff was horrible,\nbut even the black hole in this movie is not volume enough for the plot\nholes and miraculous coincidences that drive the story. He was only\nable to communicate via a malfunctioning watch, What the...? Nothing in\nthis movie made sense. Every major scene was blatantly impossible.\nWorst of all, there was no warmth, no compassion, no style, no love.\n"},
{"review": "\nFrom fictional nonsense to lacking in explanation as to main events\ntaking place in the show - I would not recommend this movie. <br><br>Without modern day astrophysics and scientific knowledge it was tough\nnot to continuously mention how silly a movie this is, especially when\nit gets to the climax. <br><br>If I were interested in fiction and or religious ideology and not\nhaving understanding of why events unfolded the way they did in this\nmovie, I may not have scolded my TV set as much. :)<br><br>Move a wormhole near Saturn? How would that work in reality? What were\nthey thinking to add such silliness into the plot?<br><br>My family was not impressed by the riddles.\n"},
{"review": "\nAs a plot I thought this movie had a lot of potential. <br><br>I was disappointed however. After 25 minutes I just found it boring.\nThe acting is terrible and you can hardly hear what Matthew McConaughy\nis saying. He just seems to be mumbling all the time. Also there is\nvery little or no humour, most of the characters seem to argue with\neach other and the only interesting line was something to do with one\nhour being equal to 7 earth years, \"so let's make every bit of it\ncount.\" I ejected the DVD before half an hour was up....but maybe I'll\nreturn to it at some point. I am just glad I never went to see it at\nthe cinema.\n"},
{"review": "\nInterstellar was supposed to be a cardinal point for mankind at this\nstage (2014) as far as technological science go and the perspective\npossibility or not of a new habitat in space.<br><br>It let me so down! Instead of a true vision for the future Interstellar\nworks out an ordinary Hollywood blockbuster that vegetates on emotional\nblackmail in a father daughter relationship. Sorry Christopher Nolan\nbut this is not what I payed for! Why should man go into space if all\nhe cares about is miserable inter human nonsense? <br><br>The unprofessionalism of the astronauts is limitless. Austronauts don't\ngo into space without a strict course. So not in Interstellar, in this\nmovie the astronauts choose randomly with course to take. This is\nsupposed to be science? Don't make laugh! What a drivel!\n"},
{"review": "\nI like movies. I watch them a lot. I personally know 2 of the actors in\nthis film, and also some people connected to the scoring. After all the\nhype I was geared up to watch it. I fell asleep once within the first\nhour and drifted in and out of consciousness throughout the film. It's\ntoo long, waaay to much dialogue - a completely bombastic storyline and\nMatthew just irritated me.<br><br>I could give a much more well rounded review and get all academic - but\nits not worth it. I really can't sum up the words to say how much of a\ndull experience this was. There are some crazy visuals once they\neventually get into space - but the dialogue and the actual audio mix\nis really lame.<br><br>Watch it if you really have nothing else to do - or perhaps if you're a\ndrug user it might work better under the influence. Since I don't take\ndrugs - that's just a wild guess - it might - actually - make it even\nworse. <br><br>One thing for sure - I wouldn't watch it again. Not for all the tea in\nChina.\n"},
{"review": "\nLike quite a few others I'm giving this one star to balance out\ncountless 10 star reviews.<br><br>My wife and I watched this because of the high average review on this\nsite. I won't bother describing why the movie was so bad. Others have\ndone a great job. It was like watching a three hour train-wreck, or a\nregular train wreck shown in super slow motion over several hours.<br><br>Unfortunately I can't just leave it at that, because I have to write at\nleast 10 lines. So I will expand enough to say that the \"science\" was\nnon-existent, special effects were poor, the pacing slow.<br><br>Perhaps the most ridiculous thing was that the astronauts had to leave\nearth with a 20th century three-stage rocket, but later they landed on\nother planets and took off again with Star Wars type landing craft.\nThat's just one example of insane stupidity, and it just got worse and\nworse from there.\n"},
{"review": "\nI may drop a few spoilers here, so be warned. I find it very hard to\nunderstand why so many people thought this movie was so good. Yes,\nthere was a good cast. Yes, the special effects were good (in this day\nand age that is expected.) But the story? Teaching that space travel to\nthe Moon was a hoax? What's that about? The farmer just happens to be a\ntrained astronaut? His daughter just happens to be a mathematical\ngenius? The lies that are told, and this intelligent astronaut is so\ngullible? The denigration of education, as if that is any positive way\nto save mankind? The striving by the government to have more farmers,\nwhen it has been obvious since the industrial revolution that larger\nmechanized farms utilizing fewer farmers are more productive. The\nbelief that new colonies can be created by bringing embryos to life?\nWho thought this up? The same people who strive for an uneducated\npopulace? And amid all this, somehow commuter space travel is\ndeveloped? Too much Bull for me to swallow! Really folks?????\n"},
{"review": "\n1. Far far too long. Nearly 3 hours? <br><br>2. 50% of McConnaughey's dialogue totally incomprehensible. He hardly\nmoves his lips so what he says comes out as a hoarse whisper. Didn't\nhave that problem listening to Michael Caine, Anne Hathaway or Matt\nDamon.<br><br>3. Characters doing random things that had no logic. Why did Matt Damon\nsuddenly attack Cooper?<br><br>4. That annoying thing where actors suddenly start explaining the plot.\n\"We're approaching a wormhole. So, tell me all about wormholes\". \"Ok,\nthis is how it goes....\"<br><br>5. Mostly, the film was just boring. Lots of films last around the 3\nhour mark and you need to have something to keep the audience's\ninterest going. My interest lapsed around the halfway mark.\n"},
{"review": "\nThe good: The creative design of their robot +1<br><br>the visuals of the water-planet<br><br>maybe the ice-planet as well<br><br>+1<br><br>Things that made this film bad:<br><br>All the scenes that did not add anything to the story, including the\nvery slow start.<br><br>The sabotaging behavior of Matt Damon, was just added to make drama.\nFrom the moment Matt attacked Matthew, I knew the movie was bad.<br><br>That the crew members would believe Matt's description of the planet is\nunlikely. The planet was visibly frozen<br><br>It will always be pointless to reach the center of a black hole, since\nit would mean certain death. They tried to describe it as a necessary\nsacrifice, but the thinking behind was just nonsense.<br><br>I have no Idea what they tried to illustrate as happening in the black\nhole. There are no books to be found in a black hole. Timetravel\nbackwards in time is impossible.<br><br>The excessive use soundtrack music and unnecessary loud music. <br><br>The plot overall was far from something that could have happened in\nreality.\n"},
{"review": "\nI must echo the sentiments of many of the other negative reviewers. The\nmovie moved into emotional elements of the characters without\ndeveloping the characters. I felt nothing for the characters, and I\nREALLY wanted to. There were a few moments when I was interested enough\nto see how the makers were going to present some of the physics based\nelements, but nobody/nothing got spaghetta-fied (Neil DeGrasse Tyson's\ndescription/term).<br><br>It is really a love story disguised as a sci-fi fantasy. And not even a\nvery good love story. I was so bored, I fell asleep for about 15\nminutes. I felt like just getting up and leaving so many times but I\nthought maybe if I stayed it would get better. It didn't. I really\nhoped that the actors starring in the movie could make it better. They\ntried but it didn't help. Can I get my money back? How many millions of\npeople could they have fed for the money they wasted making this movie?\nThey could make it up to me if they donated the money they made from\nthis movie to feed the poor in this country.\n"},
{"review": "\nThe movie had a few moments that were well acted I suppose and as you\nwatched you felt a potential as possibly emerging at any moment. Seemed\nto be some mumbling going on that became annoying. Didn't seem to be\nany interactions between characters that was particularly compelling or\nestablished a bond with the viewer. The concepts of space were like\nsmoke and mirrors even if you gave them a tremendous amount of slack\nconsidering it's only a movie. I was going to attempt to watch it again\nto see if there was something missed in making the connect on this\nmovie but after reading so many other reviews exclaiming such\ndisappointment, I decided to forgo the extra headache!\n"},
{"review": "\nThe most amazing thing about this movie is its pioneering spirit. They\nlook at night sky and see a map of foreign worlds that need to be\nvisited. The movie presents lot of mysteries of the world in visually\nfascinating way. Those robots there are amazing as well, complete\nopposite of Marvin from Hitchhiker's Guide to the Galaxy. I love them.\nThe emotional layer is as great as it gets. You may very well find\nyourself crying possibly more than once. Finally the imagination was\nmind blowing rolling around the edges of the things you are yet willing\nto accept as possible. It all feels very real like you are right there\ntravelling across the Universe encountering strangest parts of physics.\n"},
{"review": "\nIs it my fault Matthew MacHaunecatechity has one of those faces that\nmakes you think he's got haemorhoids, and mumbles half his lines? So do\nI, but I don't purport to be a space hero.<br><br>Grizzled, cantankerous old farm boy is apparently the only person\nsuitable to pilot a spaceship through a wormhole in order to save\nmankind, but the twist is that he doesn't know it's a suicide mission.\nIn the end, he makes it back anyway through extended, overwrought,\nMatrix-style jiggerypokery.<br><br>2001, Event Horizon, Gravity, Contact, any space film you can think of\nhas been recycled and regurgitated to bring Interstellar to your\nscreen. What Interstellar lacks is any ideas of its own. Watch once and\nforget.\n"},
{"review": "\nNolan is shooting, photographically, some of the best shots in his\ncareer. It looks beautiful, not only the sequences in space but also\nthe scenes back on Earth. In terms of sound and vision, it is gorgeous\nto look in. However once one goes deeper, things begin to slide.\nPerformance is lacklustre, characters do not seem fully developed nor\ndid I have time to invest interest in them. The narrative is\nexposition-heavy and will most likely lose you in regards to interest\nand logic after the forty minute mark. This is a deeply unsatisfying\nfilm, boring, nonsensical, and wannabe-pretentious (despite Nolan's\nfan-base being some of the more lowbrow members of the fan community.)\n"},
{"review": "\nI was expecting another movie, I expected a science fiction movie, a\nphilosophical movie. I am very disappointed. This movie is boring.\nMeaningless. Excellent special effects, good actors, McConaughey\ntalented, every little expression every little gesture. Scientific\ntheories all true, inserted in a context so should be simplified. They\nare too difficult, the dialogs all chaotic. This film does not make\nsense. And the worst science fiction movies that I've seen. Getting\nstarted is as annoying as the main character behaves with one of the\ntwo children, treats him like an old rag, while her daughter her\nfavorite is the queen. for 2 hours of film his obsession with his\nfamily; no excuse for the daughter she existed only to get to the end\nwhere his daughter, does not care about his father. The cube that\nlooked like the Borg cube, sent from the future in a time without time\n....... The other astronauts launched into space as a sling from a\nblack hole .... This movie does not make sense I repeat: The worst\nscience fiction movies ever seen.<br><br>Sorry for my bad English\n"},
{"review": "\nA very long film , that can be done in a less time; full of none-sense,\nthat is full of total science fiction ,and unreal theories; i didn't\neven feel the emotions that people are talking about everywhere because\nit's artificial emotions; finally the movie hasn't given anything new,\npointless .<br><br>People please !! stop being a fan-boys to a certain director,plus if a\nmovie seems complicated ,doesn't mean it awesome . A movie like this\nshould be simple , and close enough to rationality , the more it's made\nsimple, the more creative the maker is, it is totally none-sense making\nit complicated, what is worse;it's the Unreal theories that this movies\nshows made it like this, and please people do not tell me i haven't\nfocused on the main point of this movie , i tired my best, and i found\nit POINTLESS .\n"},
{"review": "\nI judge a movie by how long it takes me to realize I need the bathroom,\nhow long the movie can hold my interest and how convincing the events\nunfolding are. Well, I watched this movie all the way through with no\nbathroom breaks. My interest was grabbed from the start and held all\nthe way through. Being old enough, and lucky enough to have watched the\npremiere of 2001 A Space Odyssey - and viewed it several times since -\nof course I made comparisons, and there were a few, but this movie\ntells an excellent stand alone story that is both riveting and\nbelievable. I'm not going to give away any secrets but anyone who\nwatches the last five minutes or so without a lump in their throat and\na tear in their eye, well you're a critic, you're not enjoying the\nmovie because you're too busy looking for bloopers and faults. Were\nthere bloopers and faults? The darn movie was so riveting if there were\nany I didn't notice them!\n"},
{"review": "\nI can say many things of this movie, but let me just resume one part:<br><br>An astronaut enters a blackhole in a spaceship from the XXI century, a\nblackhole, that as all blackholes, has so much gravity that it sucks\neven light into it compresing it. This spaceship doesn't compress\nbecause it must be made of some strange material harder than a\nblackholes gravity force (a force that far away makes 1 hour relative\nto 7 years in distance). The astronaut doesn't die, aldo he gets out of\nhis amazingly strong spaceship, but instead, arrives to his\nmultidimensional daughters bethroom. Yes. Apparently because of love\nand a multydimensional trip. Then he proceds to sends her \"cuantum\ndata\", this hight tech robot -that also enters the black hole- gives\nhim, via morse code to her watch so she can save humanity.<br><br>OK.\n"},
{"review": "\nTo be completely honest, this is easily the most boring movie I've\nprobably ever watched. The first part of the movie is a complete utter\nbore. Things actually picked up a bit midway through when they reached\nto their destination but even so it then falls back as flat as it all\nstarted.<br><br>Though the plot of the movie is quite an interesting one, it does take\nin my opinion a little bit too much time to get put into place which\nmakes it really annoying at first. The lack of action of any sort, I\nmean even the most innocuous ones really brings the spectator to sleep\nall throughout.<br><br>It's actually hard to keep focus during the whole thing without doing\nsomething on a side actually with the long sequences of boring dialog.\nThese, between the different characters are rather toneless,\nemotionless and they all speak like as if they were in some sort of\ndocumentary. It's actually quite unfortunate because the story in\nitself is quite interesting but the way it is played is just completely\nboring.\n"},
{"review": "\nThis is perhaps the worst space movie I've ever seen. Confusing,\nuseless dialogue, over-long, slow, boring. The director tried to copy\n2001 A Space Odyssey with no luck. Better watch this film or read a\ngood book. The plot is easily understood by scientists like Carl Sagan\nor Stephen Hawkins but not for Joe Average, black holes, gravity effect\netc. It shows interesting subjects but they could have been better\nwritten, making the movie much more attractive and interesting. What a\nwaste of good acting and nice production design. One of the worst\naspects of the movie is that actor McConaughey doesn't vocalize clearly\nand it is very difficult to understand his words. He must study with\nHenry Higgins (My Fair lady) so he can learn some phonetics!! But he is\na very good actor, wasted on this film.\n"},
{"review": "\nTHE worst and longest movie i have ever seen !<br><br>- acting : it might be the worst performance of all these great actors,<br><br>- sound : a terrible midi synthesizer not even acceptable for a sitcom,<br><br>- image : bad Photoshop of static images of Saturn, <br><br>- scenario : could have been a very interesting to play with relativity\ntheory but a complete failure, <br><br>- moral : if we destroy the earth, let's find a new planet with an\nAmerican flag !<br><br>very very bad recycling of the some good elements of 2001 space odyssey<br><br>I could write pages of bad elements of this movie, but you got the\npoint : don't loose your time !\n"},
{"review": "\nI found this movie to be overly long, full of itself, endlessly\noppressive, virtually humorless, and overall not worth your time.\nThat's my summary, but, in order to add IMDb's required 10 lines: On\nthe plus side, it was well made, so it does draw you in. But the long\nscenes in space juxtaposed with the ugly scenes on earth were just too\nmuch for me to watch. I eventually sat with my eyes closed so as not to\ncontinue to be bombarded by those scenes (I didn't want to leave as I\nhad gone with others), and, eventually covered my ears for the same\nreason. The scenes may be beautifully shot, but they are, in the end,\nvery slow and boring. This film should have been half the length and\nhave added twice as much lightness.\n"},
{"review": "\nI knew nothing about Interstellar other than the basic premise, and the\nname of a film's director is of little interest to me i.e. I know who\nthe good directors are, but their name on the credits doesn't set my\nexpectations at any level.<br><br>I just want a good plot, good acting, and something to take away and\nthink about when the credits roll.<br><br>I got none of that with this sorry excuse for a sci-fi film.<br><br>From corn fields to a worm hole? with nothing much in between? Really?\nAnyway, I thought CASE and TARS were straight out of Minecraft... and\nso was the whole premise of Interstellar. A nothing sort of movie that\nleaves the viewer with nothing of substance.<br><br>Motorcycle, meet shark! Actually, just take the shark from the tank and\nslap Christopher Nolan across the face with it.<br><br>The 9 and 10 star reviews here truly mystify me...\n"},
{"review": "\nDo not believe the reviews... This does not come close to an all time\ngreat movie. I really question someone that gives this movie a good\nreview it's completely too long and filled with holes, in noway does it\ncome close to connecting any dots. The only reason I went to see this\nmovie is because of the 9.1 rating at the time but my first instinct\nwas correct this movie is not worth watching ever.... Maybe if they\nshaved 1 hour off but as is... Stay away <br><br>After watching this movie I felt compelled to open an IMDb account and\nreview my first movie ever because of these reviews that are complete\nnonsense.\n"},
{"review": "\nI rely on IMDb when it comes to decide what to watch and what not to\nwatch. Rating of 9.2 looks so attractive that I didn't even bother to\ncheck the trailer. I went to watch the movie with very high\nexpectations but was very disappointed. As I was watching it I was\nthinking maybe know it will start to make sense but it didn't even by\nthe last scene. It was a total bollywood drama where hero doesn't die\nno matter where he is. The most funny part was when he press the eject\nbutton in space. It does has some big star cast but the base story line\ncrumbles beyond imagination. It was like monkeys had written the script\nas they has shown in south park. Awful movie, total waste of time and\nmoney. Please go if you hate yourself or your life which is one and the\nsame thing.\n"},
{"review": "\nThere's no black hole like the script of this film, which seems written\nby someone without experience who gets into a maze of nonsense and\nfixes it all with \"love\". Gosh. It gets me on the nerves because I love\nstories about space exploration and new worlds and this movie didn't\nprovide me but too few glimpses of that. And they were mostly rehashes\nof things from the 2001 saga and Contact. CGI were OK, but when they\nhad the chance to imagine alien worlds they provide uninspired, boring\nsettings. It all seems like a poorly written derivative story by\nsomeone who is too young and inexperienced to understand that a\nnarrative must have some logic in order to work.<br><br>If they wanted to tell a love story, well, it isn't good either.<br><br>And no, I can't do what some \"science\" blogs say and recommend the\nmovie despite not liking it with the hope that young people will get\nmore interested in science. BECAUSE THEY WILL NOT. I didn't get\ninterested in martial arts when I saw Mortal Kombat as a teenager. This\nkind of movie only promotes incoherence and irrationality.\n"},
{"review": "\nThe movie did not need to be almost three hours long...this was a great\nexample of why it is a bad choice to let a director have the last say\nover edits, cuts, and length of a film. So many scenes could have been\ncut.<br><br>The only interesting part of the film was when the characters finally\nmade it to different planets. However, all the science leading up to\nthe adventure of going to different galaxies seemed to be a lot of\nmumbo-jumbo...lots of theories and big words to confuse the audience so\nthat we think it could be possible.<br><br>The last thirty minutes almost was incomprehensible...the explanations\nof what happened in the earlier part of the film didn't make\nsense...but because it was explained with a serious voice talking and\nserious music behind it, people who don't understand quantum physics\n(which are most of us) will think it does.<br><br>Plese Hollywood, reign in Christopher Nolen a bit.\n"},
{"review": "\nDon't waste your money, too long ,wanders too much , c script with B\nactor. I felt like I aged 50 years watching this garbage. Now I know\nwhy Matthew is doing Lincoln commercials. He screwed up so many movies\nand this is what is left. His only other worse movie was Dumb, oops I\nmean MUD . What is this guy thinking, whoever wrote this script must\nhave been higher than Robert Plant in the 70's. I cant believe Matt\nDamon jumped in, probably for beer money. Matt Datmon was the only one\nworth watching. Wait until someone hands you the DVD for your library,\notherwise don't spend a dime on this junk. Michael Caine was in it for\nthe beer money as well.\n"},
{"review": "\nThe good reviews of Interstellar on IMDb are proof to me that movie\nstudios pay people to post positive reviews of movies. The current IMDb\nrating is 9.1......no way in hell is that an accurate rating.<br><br>This movie is awful...period. <br><br>How could any professional actor read the script for this movie and not\nbe able to tell that it will be a terrible movie?<br><br>I really would like to say something positive about the film since it\nhas many of my favorite actors in it. The actor list reads like a\n\"who's who\" of movie stars. But I cannot think of one single positive\nthing to say about it.<br><br>Trust me, don't waste 3-hours of your life on this film. You will\nregret it, just like I do.\n"},
{"review": "\nThis has got to be the stupidest, most absurd, ridiculous movie I have\never seen in my life. There are so many ludicrous, illogical leaps in\nthis movie that it would take days to mention them all, days. Nothing\nmade sense from a logical standpoint in the entire film. Not one thing.\nAbsolutely nothing in the script worked. Every aspect of it was so\nludicrous that I was rolling my eyes, throwing up my hands or even\nlaughing out loud throughout the whole thing. Masterpiece my ass. And\nthe comparisons to 2001, give me a break. If you think this film is\nthought provoking you have an IQ of less than zero. A total waste of\nthe 70mm film it was shot on.\n"},
{"review": "\nDespite good acting and wonderful special effects I'm still wondering\nwhy the characters need to find another planet to live on when they\nalready have the magnificent Planet Earth? <br><br>When young LAUSD (Los Angeles Unified School District) students see\nthis movie they actually think that if and when Planet Earth is\ndestroyed that a space ship will be waiting to load all 9 billion\nearthlings, fly them through a wormhole and land them all safely on a\nnew habitable planet. Some students even laugh at the thought of taking\ncare of their home Planet Earth because it is disposable. <br><br>This is the sad message that this predictable, fast bucks movie\npresents to the next generation that will be the future caretakers of\nour one and ONLY Planet Earth.\n"},
{"review": "\nThe effects in the movie are good and the idea is good but OMG what a\ndragged out waste of nearly 3 hours. I implore you don't waste your\ntime on this drivel. It only gets 3/10 for the effects. The stars in\nthis movie should be ashamed of themselves for making a movie just for\nthe cash. Horrible just Horrible. The movie has a poor start and you\nhave to work out what is going on for yourself. Once you understand the\npremise of what they are trying to achieve then it does make some\nsense. They head off on a tangent that is hard to follow and there are\nmany disjointed segways in the movie. the best way to watch this movie\nis on a system that you can rewind so that you can go back and try and\nfigure out what is going on. Oh and it's one of those movies that\npeople mumble in and the sounds effects are way louder than the\ntalking, so you will be reaching for the remote allot.\n"},
{"review": "\nWhat the heck? I was really enjoying this movie, and then about half\nway through I though I was watching the wrong movie. It went from\nnormal NASA space movie to the space version of inception. Also\nMatthew's character uses the word \"Merph\" every single chance he gets.\nNo wonder that girl didn't like her name, she was sick of her dad\nsaying it 50 times a day! The movie had a overall unique idea that was\njust poorly executed and was just ended up being confusing. It had\ngreat cinematography, great acting, a beautiful soundtrack, and the\nplot was good until about the middle of the movie. I expected to like\nit more than I did.\n"},
{"review": "\ni was expecting to see an exciting sci-fi film which will keep you\nwatching till the end due to its high rating, but it was a\ndisappointment. <br><br>it has several problems in no particular order.<br><br>1. the robot's design is too simple and ugly. it was basically a square\nwith a computer screen in it. if people can send spaceship beyond the\nmoon, shouldn't the robots have more functions? this ugly robot doesn't\neven have two hands. it can't really do anything other than talking. <br><br>2. the robot's voice sounds just like matt damon. i thought that they\nwant to save money, so they just used the same actor. it made the film\nsounded cheap.<br><br>3. cooper the character didn't do anything scientific, all of sudden,\nhe was flying a spaceship into the deep space? that didn't make sense.<br><br>4. lack of asians. in 2016, black people are protesting lack of\n\"diversity\" in Oscar, this film didn't have any Asian faces in it.\nthere are more Asian scientists than blacks . this film failed to hire\nAsian actors.\n"},
{"review": "\nHo hum! The planet is dying. No more astronauts needed, farmers needed\nnow, 'cause the crops are failing... What the heck will the farmers do\nin a dust bowl? It happened once and they went to L.A. So the astronaut\nturned farmer finds a secret NASA base next to his corn field. Turns\nout his daughter will grow up to be another Einstein. So, said\nastronaut-farmer goes out in outer space to save Mankind and fights\nwith another astronaut on another world, and blah, blah, blah. Oh! And\nthere's this black hole, really the star of the film, no pun intended,\nnot to mention the many down to Earth holes in the plot. Very\ndisappointing. On the plus side, the photography is nice. If you don't\nknow anything about space, or about science, do go see it. It might\nblow your mind. If it gets people to care a bit more for the future,\nthat's worth a passing grade in my opinion.\n"},
{"review": "\nThere are a lot of people raving about this film but I think Nolan was\nout of his comfort zone here, it's mostly tedious and adolescent. It\njust goes to show that once you've made it big you will garner fans\nthat think everything you do is big. I'm also pretty sure they called\nthe hole both a worm hole and a black hole, later preferring \"black\"\nwhich is inaccurate for the anomaly they encountered; a black hole\nabsorbs things and is impassable while a worm hole is a bend in the\ntime continuum and is survivable. And wth was that ending? They\ncouldn't figure out a better way to dispense this information to the\naudience? I want to like this film and find reasons that I'm evaluating\nit unfairly, maybe I'm just not getting what Nolan was trying to\nimpart. There are a few wow moments and some interesting ideas that\nmake us go \"oooh\", but overall it felt like it just lacked personality\nand pop.\n"},
{"review": "\nI'm not a sci fi fan and having watched this to be honest I don't think\nI will ever be.Wasn't impressed at all. Mathew Mc thingy could not act\nto save his life and Michael Caine seems totally out of place. Very too\nlong and not enough to hold attention. All that about the moon\nlandings?? what was that all about??<br><br>Wasn't sure if it was supposed to be a story of family life or about\nsome bloke going off in a space ship for a bit and doing not much.<br><br>There was so much going on I lost interest. If there was such a thing\nas time travel then the 1st thing I would do is get the money back for\nmy ticket and stay at home...or maybe I could go further back in time\nand teach Matthew Mcthingy how to act.<br><br>Not good....not good at all.\n"},
{"review": "\nMatthew mumbles his way through this movie. It would have been bearable\nwithout him in it. If you can cope with mumbling unbearable dialogue\nfrom the main character then go for it. I watched the entire movie, but\nlost the will to live after 10 mins. The movie was nowhere as clever as\nsome of the reviews I've read would make you believe. This of course is\nmy personal opinion, I like to be entertained, I don't like having to\nput my ear next to my sound bar, just to try to make out what Cooper is\nsaying. Matthew kills the role of Cooper..<br><br>If you're after fast paced movie action then look away. If you're after\nsome long drawn-out movie that goes nowhere then this is for you..\nEnjoy.\n"},
{"review": "\nThis movie is hard for me to do a review on, since the hype also caught\nme and I enjoyed the movie and the ideas/theories behind it when I\nwatched it... But here a couple of weeks later, it seems overrated and\nto be frank a bit pious to me. There is just something about the movie\nthat seems off to me, the acting, the ideas, the message... Hard for me\nto put my finger on, perhaps it feels (to me) just like another movie\nwith this \"New World Energy Message\" plot that Hollywood and people\nlike Echardt Tolle is making a lot of money on.<br><br>To boil it down, it's not a bad movie - just don't start analyzing it\n:-)\n"},
{"review": "\nI did read many reviews here before seen the film and from them and the\naverage stars I thought it was going to be really good, but it was not. <br><br>Though the story of the film is quite good and acting too, and plus I\nlike those kind of movies, it just was kinda boring most of the time\nfor me. I couldn't even watch it as a whole but I had to pause it\nbecause I was bored and then continued only because I do not like to do\nanything in half.<br><br>Surely, it is better than Gravity in my opinion which is totally\ntotally boring, since they are kinda similar. <br><br>I was hesitant between 5 and 6, but 5 is more accurate for me. It is\nneither good neither bad - just boring.\n"},
{"review": "\nIt's not really a good Sci-fi, you take away the wormhole and replace\nthe setting with WW2 Japan, where a father has to go on a suicide\nmission and there you have it. Melodramatic and not really reflective\nof humanity as a whole, or our place in the Universe. The film\ncontemplates nothing significant and manages to tell nothing. Basically\na cheap tearjerker for USA audience, cashing in on dwindling\npatriotism.<br><br>Protip: if you want good Sci-Fi films try either Sunshine or Pandorum.\nThey are infinitely more entertaining and closer to reality without\nmaking paradoxes left and right. Or heck even Solaris if you're really\nthat into melodrama. <br><br>I'm really disappointed in Nolan, after confused and often\nmind-twisting films like Inception and The Prestige, Nolan seems to be\ntransforming into another side of Michael Bay where all Those millions\nare more important than integrity.\n"},
{"review": "\nI understand Mr. Nolan purposely made the dialogue in Interstellar\nindistinct to achieve some artistic goal. Unfortunately, I, being\nalmost completely deaf, could not understand enough dialogue to even\nguess what was going on. I can usually get by without close captioning,\nbut in this case, it was impossible. If I had known this going in, I\nwould have opted for a theater with close captioning . . . whoops, this\nwasn't digital. Sarcasm aside, I guess Mr. Nolan did not think about\nhow his decisions impacted the hearing impaired. I did not vote because\nit would not be fair to judge the book solely by its cover. I need to\nsee the movie again with closed captioning before I can vote. I hope I\ndidn't spoil this for anyone. Mr Nolan sure spoiled it for me.\n"},
{"review": "\nIt was awful, absolutely pointless. Without any drama that we can\nexpect from this kind of directors, Nolan tried to make you excited by\nvisual effect and music but these tricks! also doesn't work. We can\nclearly see everything comes from market: last year Gravity made and\nworked and Matthew McConaughey comes to media because of one successful\nseries and film and today these two come together for more profit, or\nto just save the humanity :)) It's very funny and this film received\nhigh points because it can't even entertain you. I think generally\nsaving the world idea like this film is bullshit and wasting the time\nbut i diet think that it can be successful jet in box office like this.\nDon't waste your time and don't engage in fake world.\n"},
{"review": "\nThis is my first review, and I am compelled to write it t counter all\nthe 10 star ratings.<br><br>This is possibly the worst movie ever made.<br><br>I fell asleep several times, and would have left had I not been sitting\nin the middle of the row of seats.<br><br>I wanted to ask for my money back at the end of the film.<br><br>It's just boring and nonsensical.<br><br>Why is every actor in the movie crying all the time?<br><br>Why does MM mumble/whisper all his lines?<br><br>I felt no emotional connection to any of the characters, and didn't\ncare if they lived or died.<br><br>I heard this was an amazing movie and was looking forward to seeing it,\nbut the only thing amazing about it is how much money and talent was\nturned into such a big steaming pile of dog excrement.\n"},
{"review": "\nYet another hugely costly below average movie. Just three things I can\nremember about it. Self indulgent rubbish. Time may slow down\napproaching the speed of light. It definitely slows down watching this\ngrandios turkey. There must be more original, exciting stories out\nthere that could be made for a fraction of the cost. Can someone please\nmake the book \"Deathworld\" by Harry Harrison into one please. Read it\nand you'll see. Perfect vehicle for \"Arnie\" and Cooper. Sad that the\nmovie industry has more money to work with than the actual scientists\nworking these problems out? From this movie they deduced more\ninformation though so that is the only redeeming thing I can think of\nto come from this rubbish.\n"},
{"review": "\nI'm disappointed. Nolan failed to break out of his mold and make a\ntruly challenging movie. This is one heck of a summer pop corn movie,\nI'll give it that. But it's not much more than that, and it has perhaps\nthe worst sound design I've heard in 20 years. Nolan himself says in\ninterviews that this is what he wanted -- really loud with dialog\nthat's hard to hear. To make it \"more immersive\" apparently. But if I\nwant immersive, I can go ride my pick of rides at an amusement park.\nWhat I want when I go to the theater is for the director to tell a\nstory. And his crappy sound design gets in the way of his telling of\nhis story. And the story is yet another variation on his favorite theme\nof recursion. Meh. Getting old Chris. Old. And by the end of the movie,\nso were the endless references to 2001. Sheesh.<br><br>A good amusement park ride, yes it is. But it's still considerably\nbelow the bar set by Gravity last year.\n"},
{"review": "\nJust simply long - confusing pseudoscience with too many conceptual\nclichés Most people walked out in silence with a few grumbles ---<br><br>I love Nolan's body of work - but hated this...<br><br>And do not sit next to anyone that doesn't get Sci-Fi or this will be\ntwo hours of listening to them ask \"What does this mean?\" \"What's a\nquantum?\"<br><br>So disappointed with Zimmer - a duo tone church organ -<br><br>Good performances by all - but just ruined by a forced story and tons\nof plot holes - science gaffs and just bewildering \"Whys\" Nolan needs\nto get back to superheroes\n"},
{"review": "\nInterstellar is a movie that never gets off the ground. Based on a\nscript that wanders from end to end attempts to comprehend its plot and\nthemes are very difficult for the viewer. Heavily weighted with Academy\nAward winners including Matthew McConaughey, Anne Hathaway, Michael\nCaine and Ellen Burstyn they are never able to surmount this poorly\nwritten script. From the beginning it was obvious many elements of\nInterstellar were lifted from other films. These included 2001 a Space\nOdyssey and Enemy Mine. Promising not to giveaway details Muppets in\nSpace was more enjoyable. Interstellar starts in a backwater town and\nends on a planet 2nd rate planet. With a running time of 2 hours and 49\nminutes schedule yourself at least one break. Why? Because you will be\nstaring at your watch constantly hoping the film would tear. I rated\nhis movie 5 out of 10 which I believe was generous. Mark Davis MD\n"},
{"review": "\nI finally watched this movie and the secret is out ... Nolan has\ncreated a dud. I have realized that the combined IQ of all Nolanites is\nsub-zero. Add to that the fact that this movie is receiving 9.1 rating.\n9.1 realllly ? What is there in this f**king movie ? I think Nolan has\nduped us all with this colossal mess. He must have run out of ideas or\nsomething ....<br><br>The other reviews suggest that the imagery in this movie is top notch.\nWell, it ain't that good. trust me . I have seen it all before in\nsci-fi movies. The 3 hrs of this piece of sh*t is something I am never\ngoing to get back.<br><br>Stay away from this one folks ... nolan must have slept through while\ndirecting this crap.\n"},
{"review": "\nI would have given this the 1 it deserves but since it's not based on\nan actual event I cut them some slack.<br><br>I'm so glad that Einstein figured out the principals of relativity.\nMost of the people I meet still think the world revolves around them. <br><br>Then Einstein played the \"what if\" game with Physics. What if you could\ntravel near the speed of light and take a trip, blah, blah, blah. You\ncan't. They can't. <br><br>Here's where the 8.8 rating comes from. People want to believe almost\nanything that is impossible. This movie is garbage.<br><br>I'm not humorless. Time travel is garbage too but I enjoyed the BACK TO\nTHE FUTURE trilogy. It was funny and kinda clever. Not this rag. Save\nyour money and remember: your life clock is ticking and there's no way\nyou're going to recover an of it that you spend, in this case 3 hours.\n"},
{"review": "\nDon't waste your time (not intended as a pun!). This is one of the most\ndisappointing films I have ever seen, I love Sci-fi and was really\nlooking forward to seeing this following the great reception it\nreceived, the people who liked this movie must have been watching a\ndifferent version to the one that I watched. It is overlong at nearly 3\nhours, where not a lot happens, the acting is wooden and hopeless from\neveryone except the young girl; Matthew McConaughty as the main\ncharacter is totally miscast and 'MUMBLES' throughout his entire\nperformance (I have perfect hearing, but was having to strain to hear\nwhat he was saying), Michael Caine and John Lithgow are wasted talents\nin this film, and are not given much to do. But what was most annoying\nwas the never ending oozing over- sentimentality about family\n'relationships' that would even have Steven Spielburg blushing! If you\ngo to see this expecting a film about man's push to the stars...forget\nit. Also the 'revelation' how the girl works out the answer is so\nridiculous that it actually made me laugh.\n"},
{"review": "\nI really like Nolan and like all of its films until I saw Interstellar.\nThe movie has its moments but in between those moments there is lot of\ntime waste. This is one movie that I really wanted to see but in\nbetween the movie I was thinking when is this going to get over. I\nthink Nolan could not decide between making a sci-fi movie and an\nemotional movie. He has given an average movie and because its a Nolan\nmovie I have given it a 1star. I know it doesn't really deserve 1star\nbut then I am angry with IMDb. There is no way it should be rated 9. I\nthink, lately IMDb has become a hub where marketing people raise the\nrating through any means available. Disappointed in Nolan and IMDb too\n!!!\n"},
{"review": "\nI love sci-fi thrillers and all. I hated this one. There is something\nfundamentally wrong with this movie. The story reads as an excuse. An\nexcuse to keep you in a room and play some space flight scenes. The\nfilm tried so much that ended up failing in everything. I think the\nproblem is the blend of emotional crap with band-aid surrealistic\nphysics that makes no sense just so that emotion could be the focus of\nthis crap movie. I would really like to convey my opinion but this\nmovie only left 2 brain cells properly working. It is that bad. I\nsincerely hope I make it. I have been drooling ever since I left the\ncinema.\n"},
{"review": "\nWas almost not going to give this movie a pass, having a feeling that\nit was going to be a bloated mess.<br><br>And oh my what a bloated, drawn out, rudderless and boring bloated mess\nit was!<br><br>I have never felt like walking out of the cinema while watching a movie\nbut at the half way point of this film i was tempted, it was that bad.<br><br>The story was a meandering affair not really going anywhere from start\nto finish with nonsensical and cliché dross thrown in for good measure.<br><br>It didn't feel like a sci-fi, more like a soppy drama with a few sci-fi\nelements thrown in and the special FX where nothing special, a few OK\nscenes but for the most part it was bland bland bland.<br><br>I thought it was going to be an innovative, trippy Kubrikesque like\nfilm with a lot of bizarre and amazing visuals and strange and unique\nvistas and scenes, aliens, strange technologies, Otherwordly Gods!<br><br>Instead it boiled down to a silly soap opera with bickering astronauts\nand crying family members. Avoid.\n"},
{"review": "\nSpecial effects are the real winner in this movie, not the plot, not\nthe acting. Most of the story makes little sense and the characters are\nannoying, except for the ever charming Michael Caine. The plausibility\nfactor was as poor as some 1950's sci-fi and less fun. Back to the\nFuture was and is more interesting. I would have to say it was not a\nboring movie, but too much talking and teen angst out of adult\nscientists. Ann Hathaway has no place playing anyone with a PhD. The\n\"Dust Bowl\" effect was not terribly convincing, they could have made it\nseem a lot grimmer. There were too many \"that wouldn't happen\" moments\nfor me, I couldn't suspend reality because they would keep mixing facts\nin and then do stuff that was pointless and unrealistic. The noise of\nthe background was so loud often I couldn't understand the dialog, low\nbass organ music and rocket engine noise so loud my chair vibrated. The\ncharacters were doing things that didn't add to the story and just\nseemed immature, you almost couldn't root for the human race to\nsurvive.\n"},
{"review": "\nFirst, I did NOT see this in IMAX.<br><br>If the director's goal was to make us (me, at least) feel ignorant\nbecause all the mumbo-jumbo is over our heads, he succeeded. Visually,\nit's pretty good, but not nearly as good as last year's \"Gravity\" and\ntries to duplicate the emotions of that movie, unsuccessfully.<br><br>The movie is way too long and overwrought. The acting is good, but the\nstoryline is so convoluted that you don't really care about most of the\ncharacters.<br><br>And of course (SPOILER!), the Black guy has to die.<br><br>This might be worth seeing in an IMAX theater, if your ticket is\ndiscounted--otherwise wait for Netflix.\n"},
{"review": "\nwhere to start??? Mumbling lead actors, emotionally not engaging for\nthe audience, wasted use of a good cast, weak script, clichéd\nsoundtrack, far too long, and don't start me on those silly robots! A\nwaste of both time and money spent on this movie - I kept thinking how\nbetter spent the money could have been. Like watching a train wreck in\nprogress. If I was alone at the screening I would have thought about\nwalking-out, however, I saw the film with a couple of friends at the\ntime. We had a coffee afterward and talked for at least an hour about\nwhat we thought was wrong with the movies. One of the group actually\ndid not mind the robots! Some people at the screening I attended\nactually walked out.<br><br>I would only give it one star since it did not contain any gratuitous\nviolence or overt sexism.\n"},
{"review": "\nIt's not a bad movie, but it's ordinary at best. Dialogue is very\nclumsy at times. It's too long, and way too much time is spent on\nexplaining phenomenons that don't need to be explained. It could have\nbeen such an elegant and thought provoking movie, but instead it's dead\nset on explaining absolutely everything. It ruins the mystery, and the\nopportunity for me to use my own imagination. Unfortunately the time\nspent making sure that everyone in the audience understands the movie\nEXACTLY the way the director wants you to, is spent, at the expense of\na good storyline and the development of believable characters and\nmeaningful relationships. A funny idea, and a powerful soundtrack, just\ndoesn't cut it for me. I was very underwhelmed and disappointed, but go\nsee for yourself.\n"},
{"review": "\n9.1 at IMDb? Seriously?? 4 of my 5 stars are for the visual effects. 1\nstar is for McConaugh and Hathaway. The Nolan brothers, however, get\nzilch for their bullshit cosmology mixed with banal sentimentality and\nquasi-philosophy. It is a mystery to me, why some filmmakers love to\nmix so much \"science\" into their movies, when most of it is so\nhorrendously unrealistic, misleading, incomprehensible and incorrect.\nKubrick avoided most of the science talk, and created an artistic\nexpression of the space-and-time mystery. That's why \"2001\" will remain\na masterpiece and why \"Interstellar\" will be soon forgotten. And the\nmovie is also painfully slow, 168 mins, most of which are spent on\ncloseups of McConaugh and Hathaway, with or without space helmet as\nwell as worn and rusty space equipment, as if that would make it look\nmore real...\n"},
{"review": "\nI loved most of Nolan's films. Memento, The Dark Knight are among the\nbest movies I've watched. Sadly I can't say the same about\nInsterstellar. I can't understand what happened with Nolan on this\nmovie. The plot is a complete mess, filled with arbitrary nonsense they\ndare call science. It spends time explaining what a wormhole is and\nthen it throws in some metaphysical bs about the fifth dimension which\ndoes not make any sense. This is not a sci-fi film it is a fantasy\nmovie. The visuals are the only redeeming quality this movie has. But\nhowever great they are, they cannot save this mess of a movie. Weak,\nforced acting with dull dialogue makes this one of the weakest movies\nI've seen this year.\n"},
{"review": "\nInteresting set up introduces us to a disintegrating near-future world.\nThere's an intriguing reference to re-writing history, along the lines\nof Capricorn 1, where planetary exploration is faked in a film studio.\nMcConaughey is the astronaut turned farmer who takes a circuitous, and\nsomewhat unlikely, route back to being a rocket man. Interstellar tries\nto get the science right but quantum physics doesn't make for the best\ndialogue. Neither are helped by dropping the spoken track way down in\nthe sound mix. McConaughey's tendency to speak through gritted teeth\ndoesn't help either. Although it looks great and is often very\nimaginative, the film takes too much time exploring dead ends and\ndetours. At times, it felt a bit like a very long trailer for a very\nepic series. And it really does seem very long, without ever settling\non a unified theme. The time anomaly aspects were good, but too much\ntime was spent getting there.\n"},
{"review": "\nthe movie has its good points but I'd have spent a line or two to\ninvolve the rest of the world in this global matter. I kept having the\nfeeling that saving the whole world was only up to NASA and USA, while\nthe rest of the world was sitting in the dust waiting for good old\nAmerica to save them. Then, if the Earth is trying to get rid of humans\nbecause of their improvident behavior, what about to stop growing\nmono-crops and using pesticides and herbicides? If corn is the only\ncereal left on Earth, eat something else, like wild grass, fruit,\nroots... but no, everything but don't ask me to drop out of the\nAmerican way! I rather leave my family behind and face the unknown but\ndon't ask me to give up on my porch-drinking and intensive farming.\n"},
{"review": "\nThis review is negative. Sorry, but as much as I like sci-fi I could\nnot like this movie except for a little. The back and forth scenes\nbetween the farm and space and the concept of the black hole is\nconfusing to me and my wife (who is not a fan of sci-fi but watched it\nwith me anyway). The biggest negative is the loudness of the music\nwhich over-rode the actors voices so that neither my wife or I could\nhardly understand what the actors were saying. Matthew McConaughey\nseems to speak in a whisper anyway. We did like the actors who played\nin the movie but again the loudness of the music detracted immensely\nfrom the enjoyment of seeing it.\n"},
{"review": "\nI'm on a Redbox binge because I'm limited to only 30gb of internet a\nmonth. Therefore, I save gigs by watching films through Redbox\u0085 though\nafter this horrid experience I might just buy another 30gb plan\u0085 but I\ndigress. <br><br>That's how I happened on this supposedly high rated film. Tired of the\nmediocre crap that you normally get out of Redbox, I cross referenced\nIMDb in hopes of a better choice. Disappointment is an understatement. <br><br>Somewhere around an hour, I realized the film would be nearly THREE\nHOURS LONG! So much unnecessary garbage\u0085 effects, dialogue, etc.\nChristopher Nolan WHO CARES?<br><br>I'm just thankful the trite, clichéd and extremely boring film is over.\nThankful that I had it on DVD and could fast-forward through the\nepically duller parts\u0085 <br><br>save yourself the time wasted from your life, since I've already done\nit for you, forget about this film and move on to something better. I\nsure wish I had been warned.\n"},
{"review": "\nWe can't hear the dialogue Whenever they speak I barely can hear what\nthey are saying they have spent too much too make it a great movie and\nI love almost all Nolan's movies but this one I was trying to enjoy....\ngreat graphics and story line but the sound............. this is\nprobably submitted by hundreds before me but I just want to add my\nvoice to them I read this \"\"\"Audiences have complained about drowned\nout dialogue and muffled conversations, with an overbearing soundtrack\nthat obscures major plot points. But what they do not appear to have\nrealized is that they were experiencing the 'impressionistic way' sound\nwas mixed in the movie\"\"\" I still don't I wanted to hear them speak\nsorry\n"},
{"review": "\nInterstellar as a movie wasn't bad at all. My only problem with the\nmovie was how the story conveyed the perspective of the gloominess and\nthe extended boring and silent moments that made it less interesting.<br><br>Another problem was the ending, it was totally unexplainable and lame.\nSo \"why\" do such a great movie, then ruin it with such unnecessary\nstrange anonymous ending with Anne Hathaway living alone in a seemingly\ndepressed way, while Matthew Mcconaughey is living in another spiral\nworld and all of a sudden: The End?! Unless there's a sequel, thats\nunacceptable. <br><br>I know that some may enjoy the visuals and the idea of the after world,\nbut thats simply letting the viewer feel in some way empty and kind of\nregret watching a movie that may be overrated \"a bit\" due to the scenes\nI have mentioned before.\n"},
{"review": "\nSlow, boring but mostly just a really, really poor film. It loses the\nstoryline about 2/3 of the way through and then just gets sillier &amp;\nsillier. What a complete waste of time. Completely agree with the\nreviewer who also gave it a score of 1 who referred to 'Mud'.\nMcConaughey is completely incoherent for at least half of the film.\nVery sad waste of some respected actors. Sorry about the double review\nbut really nothing more to add. Slow, boring but mostly just a really,\nreally poor film. It loses the storyline about 2/3 of the way through\nand then just gets sillier &amp; sillier. What a complete waste of time.\nCompletely agree with the reviewer who also gave it a score of 1 who\nreferred to 'Mud'. McConaughey is completely incoherent for at least\nhalf of the film. Very sad waste of some respected actors.\n"},
{"review": "\nIt starts out somewhat OK, and as a scifi movie, I can accept the idea\nwith the wormhole, and exploring worlds in a distant galaxy. But the\nmovie just degrades from there. When he manipulates time by entering a\n\"gentle\" black hole, the movie reaches a ridiculous low point.<br><br>I don't claim to know details about space flight or ships, but watching\nthe movie was frustrating as there are so many details that just feel\nwrong, and I was left with way too many \"but why!?\"s. It's just not\nbelievable, even in a scifi setting, in my opinion.<br><br>The only reason I watched it to the end, was to see if the makers\nactually managed to finish it off with some dignity - which I feel the\nfailed to do.<br><br>The music and effects do sometimes drown out the dialogues (for\ndramatic or emotional effects, I think), so it would be helpful to have\nsubtitles available.\n"},
{"review": "\nOnce again Christopher Nolan try's to make his dreams come alive on\nscreen again but I'm sorry it was best left in your head and should\nhave stayed a dream. I can only imagine this film was written after a\ngood nights sleep you climb out of bed have a quick think about the\nbizarre dream you had write it on a notepad and then turn it into a\nfilm. I loved the first two batmans but this film is worse than the\ndark knight rises , inception, man of steel all made by Nolan . to sum\nup the film it's nearly 3 hours long and overwritten i love sci fi but\nI'm afraid someone was trying to be too smart and make you think about\nthe plot in detail but fails badly . Poor film big budget once again\n"},
{"review": "\nI haven't sat through such a load of tosh in a long time. The film's\ncentral thesis is that mankind has screwed up the planet and it can\nonly be saved by American science and technology. Nothing unusual then\nfor a Hollywood epic. At least God and religion weren't thrown into its\nspecious mix, although love is, in the shape of the central\nfather-daughter relationship. Of course the father is an all-American\nhero whose daughter grows up to be a brilliant scientist. However, he\nhas to leave her behind, so that later, with her help, he can save\nmankind. It's the Right-Stuff meets Contact meets Buck Rogers?\nMeanwhile, the rest of us are left starving, and choking on our own\npollution. Other critics have pointed out the holes in the film's plot\nbut to my mind it's worst sin is its total lack of humour. Oh, I\nforgot, it had talking robots who could occasionally be sarcastic. Now\nthere's an original idea! I split my sides laughing. Poor old Carl\nSagan would be turning in his grave, if he had lived long enough to see\nthis humourless piece of nonsense.\n"},
{"review": "\nSO this movie wasn't that bad but it isn't as good as people make it\nout to be for sure. For one the movie is very slow at the start. And\nMatthew McConaughey's character is no good guy he kinda only cares\nabout himself for about 95% of the movie. There are some good moments\nbut the end just gets weird!! It goes 100% unrealistic with and then\nmakes tries to McConaughey people try to defend the film by saying it\nis all realistic but for one I find it hard to believe that the planet\nis dying but we still have oil and gas for our cars. And even if it\nthere is some real theory behind parts of the movie the last 30 mins\nruin any credibility that had been setup. so all in all it's OK but\nnothing great and don't listen to the sheep!!\n"},
{"review": "\nNot sure if you can make sense of the film from this, but here goes:<br><br>In a future world people can only eat Sweetcorn and begin to look like\nthe Simpsons. A farmer flies into space, realises he can fix things be\nsending messages through gravity and space-time back to his daughter,\nand everything is cool again. A Mr Man tries to screw it all up, but he\ngets his.<br><br>I'm not convinced that this film should be so highly rated. - It's too\nlong - Matthew McMumbly hardly speaks clearly - The story is hard to\nfollow - The maths makes no sense - The boil-in-the-bag cryogenic\ncapsules look bad - The sudden jump from being in a 'singularity' to a\nhospital bed is bogus - They work out his age by counting the rings in\nhis leg, like a tree, so he's 124 - The set piece speeches about love\nare silly - It's too Hollywood<br><br>Rent Sunshine instead, or Moon which is even better.\n"},
{"review": "\nSave yourself from this abomination of cinema. This movie not only\nexpects you to suspend disbelief, but to put on hold every brain cell\nfunction for its entirety. Somehow they have blended the slow southern\nhick style with a ridiculous space story and spread it painfully over\nthe course of nearly 3 hours. I did not make through even half for fear\nof becoming violently depressed. The plot treats you like a moron. If\nevery hour in that wormhole is 7 years back on earth then this movie\nfelt like an eternity in hell. Matthew should stick to comedy. There is\nmountain of further problems with the acting and pace, but I've already\nwasted enough time watching this cinematic cyanide pill.\n"}
]