[
{"review": "\nDespite an initial action scene full of CGI that you can also\nexperience in the trailer, this movie hasn't got too much to offer.<br><br>The main problem is the bad script and dialogs and the pretentious\nstyle which tries to keep the tradition of older Bond films\nincorporating some not-so-witty and cliché humor and ludicrous action\nsequences with nothing new to offer. Planes, helicopters, cars...Well\nwe've seen it all before and in much better executions.<br><br>Also Blofeld (or should I say BLOWfeld), despite the fact he is the\nKing of all previous villains, seems quite harmless.<br><br>Casino Royale (2006) is far more entertaining (I've watched it again\nrecently) and engaging. Spectre is \"Meh!\" in almost every department\nincluding (unfortunately) the ladies.<br><br>Thomas Newman who serves as the composer of the film, is proved to be a\nbad decision too. At the beginning he tries to revive the good-old 007\ntheme in almost every scene and the outcome is sub-par to say the\nleast. Later he replaces the music with the same note again and again\n(da-da-da-da-da-da-da). David Arnold did a great job in C.R. and should\nhave been the composer in this too (although I doubt that he could save\nthis movie).<br><br>And what's the deal with this lame song? Unsuitable for a Bond movie or\nany movie out there. Same goes for the same-o same-o intro sequence.\nThe combination of these 2 makes it look like it was made by Liberace.<br><br>Overall: The whole movie is pale like the Pale King it mentions.\n"},
{"review": "\nThis is the worst Bond movie ever, filled with emotionless characters\nthat I couldn't care less about. The pace of this film after a\npredictably exciting start is slow and boring. Unlike his fellow\nactors, Ben Whishaw as Q manages to portray the only believable human\nin this whole fake production. Why couldn't JB have been given a touch\nof Q's wit, humour or vulnerability? No wonder Daniel Craig wants out\nof this franchise - it's beneath his talent. Such a cacophony of\ntotally forgettable dialogue, people and silly stunts is hard to\nimagine in a single movie and yet here it is. During one of the\n'action' fights when James was being hammered by the evil assassin I\nnoticed the person next to me had fallen asleep and was snoring. That\nperson was an exceedingly eloquent critic.\n"},
{"review": "\nWonder what the refund policy is at Premier Theaters. Of course they\nare not responsible for this fiasco. It just went on and on and\non......plot meandering went nowhere...actors mumbling...no suspense,\njust one predictable scene after another. Some of the scenes looked\nlike they were shot on my grandpa 8mm Kodak movie camera. And to boot,\nthe \"reality\" of the fight scenes would meet a standard of a 5 year\nold. We all know this is not a documentary, but when Bond / Craig get\npummeled by the bad guy on the train and his tie stays in place and he\nsuffers not a scratch or a black eye where is the realism...The\nIslander aircraft flying with its wings clipped outboard of the\nengines?????.Come on Broccoli team - is this the best you can do? Sean\nConnery is rolling his eyes and chuckling at the new low in Bond\nmovies. Wasted evening, could have snoozed on a couch instead of a\nmovie theater. Now, let us face it..10 lines of comments on this almost\ntwo and a half hours of boredom is a task that even Sam Mendez could\nnot master.\n"},
{"review": "\nReviewers notes humbly submitted: <br><br>1. This reviewer not only watched all the Sean Connery movies in\ntheatres but read all the novels too. Does that date me? <br><br>2. The Biography Channel Special on Ian Fleming portrayed him as an\nageing indolent frat boy who wrote his novels using a typewriter on the\nbeach using the two finger method while cavorting. Hard to believe such\ninnocent beginnings led to a franchise that just will not die.<br><br>3. Speaking of franchises, Hollywood is running out. Which is why\nStallone was able to raise the cash to turn his C-rated Expendables\nseries into an A level franchise. And why Fast and Furious -- which\nstarted out as a drama script not a special effects gimmick -- is the\nnew Mission Impossible. So, against this backdrop, if you are going to\ndo Bond, you do it big. At least that is what the producers thought. At\n2 and half hours, however, the audience starts to wonder if .. maybe\n... less is more? <br><br>4. Craig is good. Probably the best Bond since Sean. If only the\nwriters and producers could support him the way he deserves.<br><br>5. The first reboot with Craig was the best, remains the best. The\nsecond was horrid. The bizarre entry which took place in his childhood\nhome in the English countryside -- the one where a classic car was\ngratuitously machine-gunned for no obvious reason -- almost killed the\nfranchise completely. This entry -- essentially a mishmash of Dr. No\nand the old Mannix TV show with a dollop of modern political\ncorrectness thrown in -- is OK, but will never make it to brilliant.<br><br>6. Times change, years pass. The gold standard for this sort of movie\nis the Damon/Bourne series, even more ironic because (so far) that\nfranchise remains in limbo. The first reboot here was a close\ncompetitor. So far, no other instalment in this series has even come\nclose.\n"},
{"review": "\nSkyfall was superb so this had a lot to live up to and it doesn't.<br><br>There are so many loopholes; Q was afraid of heights so how can he go\nin ski lift, London is very busy day and night so how can a helicopter\ncrash into a bridge next to the houses of parliament when it is\ndeserted, how does a car drive up a snow covered steep mountain side\nwithout skidding, why do the walls of railway carriages brake up like\npieces of flimsy cardboard during a fight ? Etc.<br><br>Then there is the quite gratuitous violence ( i.e. gouging a man's eyes\nout.) Plus the ridiculous shoot outs where Bond fells 50 other gunmen\nwho all seem to be very poor shots.<br><br>Which brings me to the plot - what plot ? This was so convoluted that\nit seems to have been made up as they went along. I had enough after\nthe first hour but wanted to see how it ended - poorly.<br><br>This film compares very poorly to either Hit-man or Bourne; Sam Mendies\nseems now to be the director to avoid.<br><br>I am sure this film will make a fortune but as the saying goes \"If\nmillion people like a stupid thing - it is still a stupid thing.\"\n"},
{"review": "\nThis is one of the worst Bond films. There was some good cinematography\nand an all star cast, but just God awful plot and story telling. I\ndon't recommend seeing it.<br><br>I like all of Craig's Bond films, except this one. Actually, Craig is\nmy favorite Bond actor. In the previous Craig films, they did a good\njob of using ancillary characters like M, Q and Moneypenny to augment\nhis character so that that his missions seemed logically paced and not\nsolely center on his prowess alone. They deviated from the traditional\nBond by allowing him to have Blonde hair, who had a an experience worn\nface and body that did break down from wear and tear, who was detail\noriented and mission driven. <br><br>While this film still tried to keep to it's current trend, it reverted\nback to just stupid unrealistic scenes, like Bond shooting SMG's with\none hand from 200 yards out and saying clever one liners like \"You're\nbluffing,\" I lost track of how many helicopters were used in this film.\nHow many times was bond apprehended and somehow able to break his\n'bonds' from his captors and escape the villain's carefully planned\nexotic methods of execution? And it was 2.5 hours long; plus the\nediting made no sense of how they got from point A to point B. They\ncould've at least had the villains die in extreme and weird ways, but\nno, a total let down even on that point. <br><br>This is a first time I've written a review and encouraged the audience\nmembers not to see this film. It reminds me the Die Another Day film\nwith Pierce Bronson which was terrible, but they squeezed it in because\nhe only had one film left on his contract. Forgivable, Yes, but I hope\nthe producers have something better for the next Bond film seeing as\nthey are pacing these releases 2.5 years apart, which a tight deadline.\n"},
{"review": "\nThis is the first James Bond film I have seen with Craig in it. I liked\nsome of the old classics, but did not think that Bond brand should\ncontinue forever. I saw this one because I read somewhere that there\nwas some spectacular scenes from a \"Day of the dead\"parade in Mexico in\nit. And I was not disappointed, just these scenes alone were worth the\nprice of admission for me. I have to admit that I hate to watch\nviolence, so I spent quite some time in the movie not watching. But I\nalso laughed on several occasions, some of the Bond brand is so retro\nand it took me back a few decades. I enjoyed the trip around the world\nand was entertained, but for the fight scenes. Obviously they cannot\ncome up with new ideas to improve the Aston Martin, so this time the\ncar was mainly good for a long and sometimes spectacular chase.\nSpectacular were also the helicopter stunts. I like Craig, but in my\nmind Sean Connery will always be 007.\n"},
{"review": "\nI was finding it incredibly hard to stay awake through this movie. Even\nthe action scenes were quite lacklustre. I think it had nothing to do\nwith the big budget special effects but more to do with the emotionless\nperformance of Daniel Craig's James Bond. Whenever anything exciting\nhappened he acted like he didn't even care. He may do this every day\nbut I can't believe it would ever get old or boring. In between the\naction scenes there were intense periods of nothingness. It's not\nsurprising really as there was no real plot. I just cannot watch a\nmindless film about fighting, explosions and getting laid when there's\nno passion.<br><br>Speaking of passion the \"bond girls\" were a big disappointment and had\nno connection with Bond. It was not believable and super awkward. I\nknow when I've just faced a life or death situation that's exactly the\npoint when I can't resist hooking up with some random. It's such an old\nconcept and it might be time for the Bond series to be put to bed.\n"},
{"review": "\nThis is truly truly awful... now at the outset I have to say Im a HUGE\nBOND FAN... I cannot believe how dull this movie was... both Daniel\nCraig and Sam Mendes both must have 007 Fatigue as they both 'phone\nthis in' I know when writing reviews you have to be careful not to add\nspoilers.. but guess what, there aren't any.. as nothing happens for\n2.5 hours... just lots of overly long scenes of people talking or\nwalking down hallways or driving in the desert... God only knows what\nthey spent the $250 million on.. maybe a really good catering truck...\nId like to go into depth of how dull this is, but Im too sleepy... .\nWhere do I line up to get those 2.5 hours of my life back... the only\nthing I can say is that this movie makes Quantum of Solace look REALLY\ngood....\n"},
{"review": "\nThe whole of Spectre looks tired. From its ageing star Daniel Craig,\nwho famously remarked that he would rather slash his wrists than make\nanother Bond movie to the script, direction and stunts.<br><br>It appears that Craig's apathy has infected everyone who worked on the\nproduction, that no one made an effort, that they were all just glad to\nbe finished regardless of the quality of the final product.<br><br>Is it a sign of laziness that the film cast Lea Seydoux from Mission\nImpossible Ghost Protocol? possibly.<br><br>Does SPECTRE contain the most tedious uninvolving car chase ever\nfilmed? undoubtedly.<br><br>Towards the end of the movie, where Bond dispatches enemy guards who\nstand around waiting to be killed, it is almost impossible to suppress\na groan of horror that the Bond franchise has sunk to such depths.<br><br>Daniel Craihg says that he would rather slash his wrists than star in\nanother Bond movie? I'd rather slash my wrists than watch one.\n"},
{"review": "\nI didn't have high expectations of this film because since Mr Pathetic\nWimpy Craig has been playing the part I have totally lost interest. I\nhave seen more masculine girls scouts.<br><br>But seeing as this is the last Bond film he has stated he will be in I\nthought he may have made one last effort at reprising the more\nmasculine elements of Fleming's character.<br><br>Nope - within the first fifteen or twenty minutes I thought I had died\nand was desperate for defibrillation as the screen in front of me\nslowly blurred into a mush of nothingness. And that sums up the whole\nfilm.<br><br>They obviously spent some cash on the production - mostly on special\neffects, which are (surprisingly) obvious from the outset. The street\nscenes are so unrealistic and resemble something from a 2000 computer\ngame that it was difficult to find any semblance of realism with which\nto latch on to, and become engrossed in, the story line. It was like\nwatching a more modern poorly executed rehash of the funeral scene from\nLive and Let Die.<br><br>The storyline was slow, the action obviously false, and the monotone\npathetic ramblings of Craig made the film exceedingly unwatchable and a\ntotal waste of time for me.<br><br>I would rather have watched Chitty Chitty Bang Bang - at least that is\nwell produced with an excellent interpretation of the original.<br><br>IF the Bond franchise is to continue the Producers really need to get\ntheir heads out of their backsides.\n"},
{"review": "\nI'm one of those who never writes a review on IMDb. Too many people,\ntoo many opinions. However I am so disappointed with \"Spectre\" that I\nfeel compelled to write something. I'll keep it simple: Casino Royale\nwas THE BEST Bond film in the entire canon. Period. Craig, with his\ntremendous physicality, and almost sociopathic detachment:\nbrutal,clever, doggedly following all the leads, was frigging awesome.\nJust watch the first scene, shot in black and white, tilted frame,\nbeautifully paced, and a great script, to see what Bond could be. I\nwalked out of Spectre, so disappointed, but not surprised. The MONEY\nwent after the obvious, seeking to maintain the myth of Bond rather\ndeepen the reinvention of him as they had begun in CR. Damn, it was so\nclose.\n"},
{"review": "\nSPECTRE (2015) ***1/2 Daniel Craig, Christoph Waltz, Lea Seydoux, Ralph\nFiennes, Monica Bellucci, Ben Whishaw, Naomie Harris, Dave Bautista,\nAndrew Scott, Jasper Christensen, Alessandro Cremona, Stephanie Sigman\n(cameo: Judi Densch) Craig continues to prosper as James Bond (in\npossibly his swan song turn as 007 if rumor has it) and does so with a\nbang: out to avenge the recently departed M as well as confront the\nnefarious leader of the titular conspiracy group hellbent on sabotaging\ninternational security at any cost. Waltz is slimily evil as the\nnotorious Blofeld and a continuing supporting crew for Bond including\naces-up-his-sleeve Fiennes as the new M, spunky and sexy Harris as\nMoneypenny and crafty Whishaw as Q. Bautista's near mute turn as a\nbrute echoing Robert Shaw's blond Russian thug of \"From Russia With\nLove\" and Richard Kiel's Jaws from Roger Moore's pair of flicks is\nindeed formidable and chilling. While there is little believable\nchemistry between Craig and new Bond gal Seydoux there is the\nlittle-used but always welcome sultry Bellucci to spice things up.\nDirector Sam Mendes returns to the franchise pulling out all the stops\nincluding a one-take non-cut opening salvo pre-credit trek thru Mexico\nCity's Day of the Dead ceremony with Bond tracking an assassin that\ninvolves a crumbling hotel and one helluva vertigo inducing chopper\nsequence. Fast, fun and fierce and by all means make sure to see it in\na big-screen/IMAX venue just to invision an 80 foot high Bellucci :D\n"},
{"review": "\nSexy Octopus! The opening credits made me laugh so hard. The beginning\nwas so slow. I fell asleep for almost the entire first half, leaned\nover to ask my friend what I missed and he said: \"nothing, you didn't\nmiss anything\". The dialogue was flat, monotone...begging to put you to\nsleep. I couldn't stop staring at Daniel Craig's giant head, it's looks\nlike it grew to twice it's size since Skyfall. And he kept mistreating\nall his buddies, trashes Ms. Swann's summer get-away suit and stole Q's\ncar and then sunk it into a channel. A**hole. <br><br>And No shirtless scene! Ugh. Although I was sensing some chemistry\nbetween Bond &amp; Quartermaster...totally thought they were going to\nmake-out at the end. But nope, not even that. Overall, this movie's\ndry---if you want to be entertained, you're going to have to make fun\nof it or use your imagination or not watch it at all. Skyfall was\npretty great though.\n"},
{"review": "\nI went into this movie blank.I had never seen any trailer, or read any\nof the reviews about it. But I was bored throughout the entire movie.I\nfelt i was watching one of those 60-70's bond with the dated lines and\nthe tiresome old clichés.And they are endless. As someone else in her\nput it,you feel like you're watching Austin powers instead.\n************warning\nspoilers************spoilers*****************spoilers I mean you\nunderstand from the very beginning that his new boss is working for the\nenemy. And when the bad guys always find him wherever he goes,you\nsort'a know right away it's the tracker MI6 put in his body,that helps\nthe bad guys. I felt I was watching a kid movie,with a plot written by\na dilatant. Go watch true lies instead,much better movie,with better\naction. After watching this I get why Craig is tired of bond,cause this\nscript is really bad\n"},
{"review": "\nI saw Skyfall before, and I liked it very much, but I don't really like\nJames Bond movie series at all. This movie \"Spectre\" was so terrible,\nthat I could not even watch it until the end. Very poor script,\npredictable story. Producers of this movie should keep it in a shelf\nfor eternity. By the way, it is time to find a new 007 actor. Someone,\nwho is a real English man. I just wasted my time to decide to watch\nthis movie. Win an Oscar? Joke. Rating 6,9 is way more, than it\ndeserves. What a stupid thing, that IMDb reviews must have 10 lines of\ntexts. Okay IMDb, i write another line here to accept my review. Not\nenough. Than here is a new line with bunch if words. Stupid movie,\nwaste of time, Christoph Waltz was brilliant in Django, but he played\nhere just a moron.\n"},
{"review": "\nYou can get all the amazing actors you want (and there are a ton in\nthis movie...), when the script is utter garbage, it simply doesn't\nwork. Are we supposed to believe that Bond can destroy a helicopter\nwith one bullet from 200 m away ? That a villain will leave a net and a\nboat for Bond and his girl to escape when he's trying to kill them ?\nThat said girl falls in love with him after one night ? That we still\nbelieve in the \"mouse showing the secret room\" trick ? That a top notch\nsecret facility in the middle of nowhere can be destroyed with, again,\none bullet making everything explode ? There's no tension, no drama, no\nthrill, it's just long, boring, badly made. It's a self parody, like\nthe last Terminator. How Sam Mendes agreed to direct this after reading\nthe script I have no idea. This is one of the worst Bond films ever.\n"},
{"review": "\n*SPOILERS As a huge fan of the 007 franchise i am starting to wonder\nhow on earth could they mess this up!? The ingredients that make a\ngreat James Bond film have been thrown out the window. Below are 7 main\nreasons why this movie failed as a James Bond film.<br><br>1) The James Bond theme written and sung by \"Sam Smith\". - Despite it\nwinning several awards, this song just did not do it for me. Although i\nstill think Sam Smith has an incredible voice. I flinched when i heard\nhim sing \"How do i live, how do i breathe.\" This is James Bond we are\ntalking about!!!<br><br>2) James Bond falls in love, again. This time the characters had\nabsolutely no chemistry to one another.<br><br>3) The car chase scene was nothing more than shots of the Aston Martin\ndriving through the beautiful lights of Rome. <br><br>4) After the opening credits the movie just fell completely flat. <br><br>5) Daniel Craig looked as though he was half asleep playing Bond; and\nthat he was only doing this for his large paycheck. (he even stated in\nan interview that he needed a break from playing 007)<br><br>6) With such a special cast they completely underused Monica Bellucci\nand Christoph Waltz. <br><br>7) Sam Mendes is an amazing director who has won an Oscar from\ndirecting \"American Beauty.\" But clearly he does not know how to direct\nan action film. (That's right, i also think that the action in Skyfall\nsucked) - my conclusion, get Martin Campbell back who directed two of\nthe most entertaining Bond Films \"Casino Royale\" and \"GoldenEye\".<br><br>Conclusion: Get a new actor to play James Bond who has the fire and\nenthusiasm to take the role into another level. Bring Martin Campbell\nback or another Director who understands the 007 formula.\n"},
{"review": "\ni love james bond,I've seen all the films, and i can say this is the\nworst one, dull , meandering script, at times i had no idea what the\nplot was. lots of confusiion ,SPOILER ALERT: like aeroplanes appearing\nfrom no where,daniel craig didn't appear to act at all, just the same\nbemused face all the way through, im surprised he doesn't want to do\nany more.there are good stunts, car chases, fights, but lots of\nboredem, and often i was lost, the side story of oo dept being scrapped\nwas just annoying, often extra would disappear completely, i wouldn't\nrecommend this film to anybody. if james bond ahdnt been in it, id\nthinkit was a b movie made for TV\n"},
{"review": "\nWhat I resented most about this movie was a complete lack of\noriginality, a plot line that all-so conveniently connects everything\ntogether from the last Craig movies, making this one sound like it's\nclever when it's just easy to say. It's a total fake, an unoriginal, a\nfraud. Don't get me wrong, it's beautiful to look at, but it's empty.\nAbsolutely empty. Where it tries to be clever, it comes up empty.\nBasically, they slapped the name Bond on it, said that everything was\nsomehow conveniently connected to one another (how brilliant! sigh :/ )\nand dress it up with beautiful cinematography. One of the worst films\nI've ever seen. Predictable and whenever they tried to make something\nsignificant, it ended up being oh so silly.\n"},
{"review": "\nBond movies have lost the essence of it all since Daniel Craig stepped\nin. I don't blame him for the poor script and direction though. It used\nto be one helluva ride to watch a bond movie but now they have become\nsuch a drag that i cant even believe that i'm watching a bond movie.\nWish they could get a veteran director to direct the new one at least\nto retain the flavor of James bond. saddened that i've wasted 2 hours\non this pathetic piece of direction. It took off on a good note but\nthen the direction just kept me thinking when is gonna end for good\nwith the sad screenplay. Even the cast wasn't used to its full\npotential. could have been a amazing cracker of a movie but turned out\nto be a spectacular dud in the end.\n"},
{"review": "\nI am a big fan of the James Bond franchise and was very excited to see\nthis film.<br><br>I was very disappointed. Not only did they mess with the opening\ncredits (I did love the octopus imagery)but the premise for the story\nwas diabolical.<br><br>BOO HOO........ so his nemesis, Oberhauser, hates him and has set out\nto destroy James' life all because James spent 2 years living with\nOberhauser and his father, when James' parents died.... and because\nOberhauser's father treated James like a son. What the heck.......\nthat's the reason.... wrote wrote this rubbish.<br><br>The next James Bond film had better have a better plot.\n"},
{"review": "\n\"This review might contain spoilers\"<br><br>Great movie and so think a lot of my co-citizens as the cinema was fool\nbooked this week-end! This is the perfect Bond-lover movie, as it is\nfull of references to former movies (e.g. the train battle as a recall\nof \"Live &amp; Let Die, if a remember well), the appearance of the Rolls-\nRoyce,Blofeld's cat, the collapsing constructions in Mexico and\nLondon,and so on,and so on . The movie is thus made in an intelligent\nmatter; I mean the perfect postmodern story-telling: you know you've\nseen all this before but you still enjoy it, because it reminds you of\nother Bond-pleasures, presented in a new way that give you the\ninsurance you've seen them and remember them well, but also entice you\nto watch them again. I only found the Austria plane-car chase a little\nover the top, but for the rest, this is definitely the best Bond ever\nI've seen. Congratulations to the makers and, enjoy the movie!\n"},
{"review": "\nAn excellent follow up to Skyfall. This is the polish, where Skyfall's\nblemishes of missing elements were fully covered. SPECTRE emitted the\n\"Bond\" feel, where Skyfall seemed to lack in some areas. Watching\nSPECTRE throughout, there was no doubt at any moment that there was any\nbreak in the \"gentleman spy\" character. In terms of other characters,\nMadeleine Swann was a great portrayal of a strong Bond girl, where she\nis an easy contender as a life partner for 007. Christoph Waltz played\na very menacing villain, and given some time in British custody, his\ncharacter would make for a great return with an even greater vengeance.\nDave Bautista as Mr. Hinx was an incredible henchman; while not\ncompeting with the iconic characters of Oddjob and Jaws, he stands on\nthe pedestal alongside the close second place candidate, Xenia Onatopp.\nMonica Bellucci delivered as an enigmatic and passionate widow, and\neven in a short amount of screen time. Andrew Scott played as a fine\nweasel of a character, as the head of the CNS.<br><br>Overall, the action was satisfying, and I was never bored at any given\ntime. Granted I am a very big Bond fan, I still find it more\nentertaining than some of the old films of the 60s, where some parts of\nthose films were dragged out in unnecessary ways. I loved this film.\nSaw it two days back-to-back, and enjoyed it both times. There was an\naura of elegance, high society and danger that ate through my\nBond-loving heart throughout (Can't help but imagine how Pierce Brosnan\nor Sean Connery would do with this script).<br><br>This film, however, makes me hold a VERY high expectation for Bond 25,\neven more so than I did following Skyfall. However the fate of Bond\nfalls in the next two or so years, the story nonetheless ought to be\ngood, casting flawless, and cinematography near perfect. Whether or not\nDaniel Craig returns, or let alone Sony continues to have the rights of\ndistribution, 007 should have enough leeway to do what he does best.\n"},
{"review": "\nThe allure is definitely still there, and the movies continue to be\nfantastic entertainment. Isn't that what a movie is supposed to be? The\nreality is that Bond movies have been bringing people to the theaters\nfor many decades now and probably will continue to do so. I don't put\nmuch credence in negative reviews or the suggestions that they should\nhave done this or that, or this director is poor because and so on. The\nmovie is very exciting, the locales are new and fantastic with neat tie\nins to the other Daniel Craig movies in the series. If you like Bond\nmovies, go see this, you will have great fun and that is what matters.\nI will get up tomorrow morning to go to my job at 3:00 in the morning,\nand hope that it isn't raining \"ha!\", and do my work, that is real\nlife, this is a movie, and it was fantastic! Go, have a great time, if\nyou can't or don't then you shouldn't have went in the first place, and\nabove all, decide for yourself what you think, I suggest if you're\ngoing to complain, do it just before you leave for work, it might help\nyou put things in perspective!!! Great movie, anxiously awaiting the\nnext one!\n"},
{"review": "\nSpectre may be receiving mixed reviews within the community, but I\nbelieve that this is simply credited to the fact that Spectre differs\nfrom the other Craig Bond films like Casino Royale and Skyfall. This\nlatest installment, in my own opinion, tips the hat to the old\nBond-style of action that we loved in most of the earlier films.\nGranted it is not as brash as say Goldfinger, with character names such\nas Pussy Galore. But it doesn't exactly fit into the box of Daniel\nCraig's films either. This movie tells a story. It isn't just nice\nsuits, and cars with beautiful woman surrounded by flying bullets in\nfront of the canvas of a massive explosion (even if this film does\nboast the record for the largest stunt explosion in movie history). No,\nthis movie gives us some nice character development. With a nod to the\nmany years of Bond that has preceded Craig. It was a nice feeling to\nthink that as a Bond fan across the the entire Franchise, that I was\nprivy to some knowledge and little Easter eggs that maybe some of the\nnewly converted fans (those that have joined the agency only since\nCraig assumed the 00-status) may not have caught on too. The only\ndownside I could see anyone pointing out with this film is maybe the\nlength of the film. This film could be reviewed as a rather long one,\nespecially to those who might lose interest trying to involve\nthemselves in a story that started back in the days of Connery. But if\nyou are a fan of the entire franchise spanning across all 24 films,\nmaybe even some of Flemming's original novel, then Spectre is a must\nsee.\n"},
{"review": "\nFinally we get to have some fun in the Daniel Craig era. Skyfall was\ngood but underwhelming. This brings back the punches of classic Bond\nand has outstanding performances from Craig, Seydoux, and Waltz. Not to\nmention Harris (who is becoming crucial and wonderful in her character\ndevelopment), Fiennes, Winshaw, and Kinnear. Also Bellucci and Bautista\nserve their roles very well. Waltz was the funnest to watch and I\nalways pegged him for this role of Bond villain since I first saw\nInglorious Basterds and boy, he did not disappoint. He eats up his\nscenes and eschews the sadistic egomaniac with charm, style, and class.\nThe scenery and shooting were breathtaking especially the shots in the\nAustrian Alps and the Train sequence was a great nod to the ghosts of\nBonds past (From Russia with Love and The Spy Who Loved Me). Let's hope\nfor many more.\n"},
{"review": "\nIf there was anything we learnt from 'Skyfall' it's that Sam Mendes can\nmake a damn good Bond film, veering away from the over-the-top,\nexplosive nature of the franchise, and focusing more on Bond's personal\nlife and his vulnerability. Well what can be said? He did it again.<br><br>'Spectre' will definitely appeal more to those who were fans of the\nearly films in the franchise, most notably 'You Only Live Twice' whose\ninspiration brings back one of the finest villains to ever face Bond.\nMendes has since seemed to take a new direction on Craig's series of\nfilms and led away from the gritty, thriller aspect that 'Casino\nRoyale' and 'Skyfall' had and instead propelled the film as an action\nspectacle, full of beautifully orchestrated stunts, stunning\ncinematography and non-stop explosive action. The locations are\nstunning, the score is exhilarating and the cinematography from Hoyte\nVan Hoytema is dazzling.<br><br>Christoph Waltz and Dave Bautista, whoever the casting director was on\nthis film, you deserve a huge pat on the back, this film stars two of\nthe most perfect actors to plays villains ever. The much-loved Austrian\nWaltz whose Colonel Hans Landa has earned him recognition as a\nfantastic and plausible villain, and ex-wrestler Bautista proving that\nhe is one person not to screw with.<br><br>'Spectre' manages to reflect back upon its predecessors in the\nfranchise with references to prior villains, allies and lovers, further\ndrawing upon a story that was in need of a conclusion, a conclusion all\nfans just couldn't wait for. But... will 'Spectre' be the conclusion we\nexpected? Or will there be more to follow from Daniel Craig and 007?<br><br>Obviously you don't have to take my word for it, I'm just a mega- Bond\nfan, but allow me to shed some light upon it if you are having a hard\ntime deciding whether to see it or not? I went and saw this in IMAX - I\nwas blown away. This is the ultimate British action film and one of the\nfinest instalments!\n"},
{"review": "\nSpectre follows James Bond after the events of Skyfall as he hunts down\nyet another villain. Meanwhile the 00 agent program is being\nthreatened. <br><br>As expected, Daniel Craig is a great James Bond. Léa Seydoux, who plays\nthe latest Bond lady, does a great job as well. <br><br>The action was also solid. While it wasn't horribly realistic, it was\nfun. And that's what action should be. <br><br>However, the movie does have it's flaws. Christoph Waltz as the main\nvillain sounds great, right? Everyone remembers him in Inglourious\nBasterds right? He was great. Not so much in this movie. He really only\nhad a handful of scenes, but he just played Christoph Waltz in those\nscenes, he wasn't really the villain. He didn't pull off a great\nperformance, he was just fine. Furthermore, him as a villain was kind\nof anti-climatic. He just popped in once in a while, but didn't really\ndo anything. <br><br>All the other Daniel Craig Bond movies have taken an original twist on\nthe secret agent genre, but this one really didn't. It was classic\nBond, and while that isn't a bad thing it isn't a good thing either. It\nnever strayed too far from the formula, so it kind of stands out from\nthe rest of the series as less exceptional. Going back to the villain,\nhe was just another classic Bond villain. Maybe Waltz just didn't have\nenough to work with, I don't know. <br><br>On top of that, Bond and his love interest didn't have a lot of\nrelationship development or chemistry, yet they still fell in love. It\nwas treated like this big deal, but I just didn't buying it. <br><br>Overall Spectre was, despite all the negativity I expressed, still\ngood. I had a good time, everything was in place for the most part,\nsome stuff just didn't work as well as it could have. Yes, it was a\ndisappointment, but that doesn't make it bad. In the end I'd recommend\nthis movie to fans of the Daniel Craig Bond movies. Although you might\nas well watch it anyway if you've seen the others.\n"},
{"review": "\nThe scenic backdrops and audio sound scape quality were stunning. Not\nmuch about the film was worth watching. I learned more about the story\nby reading the summary on IMDb than I did watching the film because I\ncould hardly stay awake. The film is an hour too long, the story is\nconfusing and disconnected from the characters. They try to make some\nkind of global NSA that grows out of control and it's just really\nlousy. The acting wasn't bad, but you can only do so much with this\nridiculous script. The action scenes were lame for the most part.\nOutlandishly unbelievable and something your 13 year old son would most\nlikely be shouting, \"Yeah right Dad, did you see that? That's\nimpossible.\"\n"},
{"review": "\nDialogues are no where near the standard of a Bond movie. Dave\nBautista, I truly don't understand the need of his role in the whole\nmovie. A Psycho who has a .50 cal Double Barrel Pistol is unable to\nhandle a girl. WOW. The ending... It's ruthlessly, awfully, childishly\nproduced. The way the 'Literal King of Villains' is taken down is an\ninsult to Christopher Waltz acting carrier, and to the Bond movies\nvillains too... (I can cry while thinking about it). Waltz has been\nunder utilized. The person who can be the king of villains in acting\nhas just been given like 12 minute part. Where the hell Sam Mendes's\nthinking coming from... certainly not from his head. And I think, we\nshould start expecting the same level of production from Barbara, as\nthere are no more original bond novels left. All they can do more is to\nworsen it only. Casino Royale was the last original true in bond spirit\nmovie... Rest, Bond may RIP...<br><br>P.S. My heart is broken for what Sam did to Waltz carrier in this\nmovie...\n"},
{"review": "\nIt is truly shocking at how incredibly boring and dreadful the 007\ninstallment was. The \"edge of your seat\" feeling that one is supposed\nto have from a 007 movie was totally absent all throughout this one.<br><br>Daniel Craig is back again as James Bond. It seems like this one is the\nlast of the series that he is in. Besides that, the story to this one\nwas so quite slow. The movie lacked any of the innovative 007 James\nBond tactics that have been displayed in previous movies. The fighting\nsequences lacked any type of creative choreography. After almost half\nway through the movie, there was finally an action scene, but it was\nextremely far-fetched.<br><br>This was such a disappointment for a 007 James Bond movie. It really\ndid not live up to what it is supposed to be.\n"},
{"review": "\nI have been a fan of the Bond series since it started and own every\nfilm including \"Never Say Never Again\". All the villains, all the\nBonds, all the gadgets, all the humor, all the fabulous titles and\nmusic by world class musicians, all the fabulous scenery, including the\ngorgeous women ...All gone.<br><br>This film IS the worst James Bond 007 ever. Despite attempts to reprise\nthe types of spectacular scenes from past films, this movie has No\nscript, No plot, No humor, poor cinematography, bad music, a hideous\ntitle song by an amateur who should NEVER have been let near a\nmicrophone. What was Barbara Broccoli thinking? She, Sam Mendes and\ntheir minions have used their \"license to kill\" on the franchise. The\nentire movie is a one big dirge ending in a funeral for all after fifty\nyears of success. <br><br>I do not believe the tag line at the end of the credits that \"Bond will\nreturn\". Good Bye Bond.\n"},
{"review": "\nI have just watched the new Bond offering - please please will someone\nput this franchise out of its misery as it is well past its sell by\ndate. Everyone knows that when you see a Bond film much is formulaic\nbut in this case it is just plain old tired. The plot is pedestrian,\nthe acting (such as it is) is dire and the directing - well Mendes\nneeds to run a mile away from the next one and stick to what he's good\nat. Daniel Craig has done some good work in his career but I'm sure\nthis has to be his worst and I trust he won't be doing the next one.\nThe whole film is such a crushing bore I would rather watch paint dry\nthan even think about watching it again. Please don't waste two and a\nhalf hours of your life and steer clear of this turkey.\n"},
{"review": "\n007 is back, hunting for the head of sinister criminal organisation\nSPECTRE, which plans to use an international intelligence network to\nfurther its nefarious activities.<br><br>Spectre opens in fine form with a thrilling pre-credits action sequence\nthat sees James Bond (Daniel Craig) narrowly escaping death when a\nbuilding collapses around his ears before leaping on board a helicopter\nto do battle with a baddie above the crowded streets of Mexico City;\nthen Sam Smith begins his godawful caterwauling, and the film never\nrecovers.<br><br>This latest instalment in the long running British spy series is\nanother overly sombre adventure that once again lacks the excitement\nand thrills that I remember from the Bond films of my childhood. People\nlove to scoff at the Roger Moore movies, but at least they were hugely\nenjoyable slabs of blockbuster entertainment, full of exotic locations\nand colourful characters; in contrast, Sam Mendes' movies are drab and\nlargely boring. I don't blame Craig\u0097he actually makes for a great\nBond\u0097it's the overall tone, overly elaborate plots, and the\nfilm-makers' absolute refusal to have any fun that are to blame.\n"},
{"review": "\nI loved other Craig Bond movies (and still do - for me they are the\nbest this franchise has to offer) but this one was completely\nunnecessary, except probably for the people involved in production,\ntrying to earn some salary. It is a usual sequence of scenes: Bond does\nsomething \"spectacular\", then gets beaten (and some more), then has\ndisputes with his boss, then meets a girl, then meets the villain, gets\nbeaten again, solves disputes with the boss and wins the day and the\ngirl. This time, however, without humor, without convincing motivation\nand practically without \"gadgets\" (no sponsors, huh?). Aston Martin\ndoes not count. Also, no interesting conversations, Ms. Belucci is seen\nonly few seconds and the \"Bond girl\" is \"girl next door\" type. Despite\ngood casting, despite experienced director. Bond theme is easily\nforgettable (yup, Adele's Skyfall was a masterpiece) as well as this\nmovie altogether. I do not recommend it but you will watch it anyway.\nIf no other reason, out of habit. So be it. I'm glad Mr. Craig leaves\nBond. This is going nowhere.\n"},
{"review": "\nFirstly, \"Skyfall\" is, without question, the most obscenely overrated\n\"Bond\" film in all of Bond history. At best, it was a mediocre Dark\nKnight ripoff with a laughably silly villain and a climax that has to\nbe seen to know just how ridiculous it (and the entire film) is.<br><br>If Skyfall was a 6 out of 10, then Spectre, *vastly* superior in every\nway a film could be superior, and arguably Craig's *best* film as Bond\n(thankfully, his last), is at least an 8 out of ten. Better action,\nbetter villain, better plot, better Bond girls, better Q (not quite so\nannoying this time around), better...everything! Forget the critical\nhive0mind, forget Skyfall, and watch this film with an open mind. If\nyou're a longtime Bond fan (and I don't mean \"Bond\"), you will enjoy\nthis one!\n"},
{"review": "\nI've been a great fan of the JB series and I was expecting(somewhat\nlike) a type of Skyfall as it was a film by Sam Mendes and as is this\nfilm too. Skyfall was a brilliant movie which is more like a\npsychological thriller action movie testing JB's mental status which\nwas superb. But for this one, it was just too lengthy where some of the\nscenes were not required. I was expecting some punchy stunts with the\nAston Martin DB5 but it was just like a circus stunt which was a waste\nof time. Similarly some of the scenes in the location where SPECTRE I\nwas expecting something different but that was too wasted. Monica\nBelluci's character was totally wasted (She could have been used in a\nbetter way). On the whole this movie is just worth watching just one\ntime. Sam Mendes could have done a better job and I didn't expect this\ntype from the director. The plot was fine but the way it was taken is\nnot good.\n"},
{"review": "\nThis movie somehow managed to get some rating I see.However, it will\nbore you to death. This gentleman 'Bond' wields his genital more than\nhe does his IQ. I hated the plot, which was basically empty with filler\ncraps. I really do not find any significance in this movie. I hate this\nplot and movie. <br><br>It surprizes me that so many people actually 'like' to watch crappy\nlovemaking scene and gun fights. The success of espionage genre depends\nonintelligent plot packed with brain works not penis works or gunworks.\nBetter watch 'In the heart of the sea' . That's a brilliantmovie which\nreveals the ultimate struggle of human life.\n"},
{"review": "\nI will keep this spoiler free. So no details from the movie.<br><br>This movie was so boring, terrible, repetitive and overall bad, that\nseeing how it has 6.9 rating on IMDb makes this site's review page very\nuntrustworthy. If you are not in one of the two categories named in the\ntitle, I can honestly bet you will not give this movie more than a\n4/10. There is absolutely no thought put into this movie. The\nscientific methods they have used to bring the former impressiveness of\nBond authenticity is cr**. Excuse my language but this movie does not\ndeserve to even be considered a Bond movie. It is a shame for the Bond\nfranchise to let the character exist in this anomaly. Mediocre actors\nthat make a very bad script look disastrous. I would rate it cr**/10\nbut sadly I cannot.\n"},
{"review": "\nA lot of people think that 'Spectre' is the worst Bond movie ever. I\nwould agree, but I don't technically consider it a Bond movie. The\nspirit is gone, and so is the humor. Spectre is poorly acted, painfully\nscripted, ponderous, dark, useless and ridiculous. It cost $240 Million\nto make: what a waste. I won't go into the plot as many did before me.\nThe Bond franchise is dying, killed by an excess of CGI, helicopters\nand explosions and Superman stunts. There isn't any subtlety, just a\nlot of noise, screaming, no plot to speak of, good actors are wasted\nand appear bored if not embarrassed. Daniel Craig looks so much like\nVladimir Putin is distracting, and his female co-star has no idea what\n'acting' means. Ian Fleming must be turning in his grave.\n"},
{"review": "\nI'm surprised this movie is getting fairly good ratings..<br><br>it was a very boring movie..<br><br>when casino royale released, it was a much needed reboot , back to\nbasics with less of Pierce Brosnan style of hi fi gadgety gimmicks and\nmore of a storyline, mind games etc..I loved it..<br><br>and then it never took off from there..<br><br>'Quantam of Solace' was a forgettable fare..<br><br>skyfall had great music and cinematography and it was entertaining but\nit never looked like a bond movie and was silly at times..<br><br>and then, we r here with his bore,james bore spectre.<br><br>I endedup disliking Daniel Craig after this movie.boy there was no life\nin his face.it put me to sleep..it came across as if he had no interest\nwhatsoever to act in this movie.<br><br>Christopher Waltz had stupid role and was completely under utilized..<br><br>Monica Belluci had a 2min role.. Lea Seydoux was just OK..<br><br>except for casino royale,in all these other Craig-Bond movies the\nentire concept of bond girl has diminished and has become more and more\nirrelevant with they having no role to play..<br><br>such a disappointment on all fronts..<br><br>an urgent reboot required...\n"},
{"review": "\nFor all the hype and budget, not to mention the years it took to make\nthis, my expectations were high. I was mainly disappointed.<br><br>\"Was it interesting?\" The social commentary was far from subtle. The\nacting was pretty good, but should have been for most of the names. It\nbuilt up for an exciting third act that fizzles out.<br><br>1.5 out of 3.<br><br>\"Was it memorable?\" The action was good, when it was there. It was\nweird that most of the movie was as serious as possible, but was laced\nwith goofy bits in some action scenes. The Bond girl was almost\nentirely unnecessary to the plot, and the romance came out of nowhere.<br><br>1 out of 3.<br><br>\"Was it entertaining?\" It was so dull for near half of the film. There\nwere expected clichés all over. The last 20 minutes were mostly action\nand yet I couldn't really care what happen by that point.<br><br>0.5 out of 3.<br><br>Starting with 1 (because), 1 + 1.5 + 1 + 0.5 = 4 The whole thing seemed\nlike a waste of money. Over built and far too serious for a plot that's\nbeen done dozens of times in TV alone.\n"},
{"review": "\nDespite a huge budget, Spectre is an absolutely awful film with little\nto recommend it. The film isn't even memorable for any exciting action\nscenes, set pieces or stuntwork. <br><br>At least in the past, Bond delivered a thrill or two. Unfortunately the\nDaniel Craig efforts can't even manage that. <br><br>The movie is plain boring, not just because of the lacklustre action,\nbut also because of the dreadful,uninteresting pedestrian script, the\nslowdown pacing and some very bland performances.<br><br>The title song - which amazingly won an Oscar - is diabolical. <br><br>If this is the best that the film makers can churn out then the best\nthing would be for them to stop making them. They have had a good\nrun,.but it.is time for it to end.\n"},
{"review": "\nThough we've been through years and years of James Bond movies and they\nall have the same basic recipe \u0096 impossible action, exceptional\nphotography, superb stunts, beautiful women and a solid cast \u0096 this\nSPECTRE for this viewer beats them all. Sam Mendes directs a committee\nscript (8 writers including Ian Flemming original characters)), uses a\nfine cast, allows us some of the beautiful views of many countries and\nthe result is a completely satisfying experience \u0096 for Bond lovers.<br><br>The story line (much like all the others) is as follows: A cryptic\nmessage from the past sends James Bond Daniel Craig) on a rogue mission\nto Mexico City and eventually Rome, where he meets Lucia (Monica\nBelluci), the beautiful and forbidden widow of an infamous criminal.\nBond infiltrates a secret meeting and uncovers the existence of the\nsinister organization known as SPECTRE. Meanwhile back in London, Max\nDenbigh , the new head of the Centre of National Security, questions\nBond's actions and challenges the relevance of MI6 led by M (Ralph\nFiennes). Bond covertly enlists Moneypenny (Naomie Harris) and Q (Ben\nWhishaw) to help him seek out Madeleine Swann (Lea Seydoux), the\ndaughter of his old nemesis Mr. White (Jesper Christensen) who may hold\nthe clue to untangling the web of SPECTRE. As the daughter of the\nassassin, she understands Bond in a way most others cannot. As Bond\nventures towards the heart of SPECTRE, and its head Blofeld (Christoph\nWaltz) he learns a chilling connection between himself and the enemy he\nseeks.'<br><br>Splendid locations, terrific opening graphics, fine musical score by\nThomas Newman, and magnificent cinematography by Hoyte Van Hoytema all\nadd to this echt James Bond mood. Grady Harp, February 16\n"},
{"review": "\nSpectre is one of the best Bond films yet.. It's up there with Skyfall\nand Goldfinger. The movie featured a little more romance than the\nusual. The cinematography and the music score for this film really made\nthe scenes grip the viewer. It was an interesting take to have Bond's\nadopted brother be the villain. It made the plot a lot darker and the\nfact that he described himself as the \"author of all your pain\",\nimplied that this man was a way bigger threat, because he most likely\nhad been sabotaging things for years. The last scene with the booby\ntraps and the girl in danger was a little cliché, but it was nice to\nsee how much thought went into it. Whether it was CGI or makeup, the\nantagonist looked spooky with the missing eye. With the combination of\nall the camera surveillance and the immense knowledge the enemy group\nhad on James Bond, this is one of the few films that really makes the\naudience fear for him. It's a nonstop ride from start to finish with a\nlittle humor, and just enough back story to make the people care. WELL\nDONE.\n"},
{"review": "\nWOW! What is all the complaining about? Please let me know what Bond,\nor any action movie is totally realistic? The complaints about this\nmovie are absurd, as all Bond movies have had easy escapes, unrealistic\nrelationships. And, except for Skyfall, Goldfinger, have there been\nBond movies that are not predictable? This Bond movie ties the other\nthree Daniel Craig movies well, brings back key villains and opens the\ndoor for a more evolved James Bond. Spectre has good action scenes,\nsome basic psychology, and keeps the theme of a \"troubled/conflicted\"\nBond. Enjoy this for what it is, an excellent conclusion to a four part\nstory.\n"},
{"review": "\nI loved this movie! The generic is breathtaking, her song, special\neffects in cascade, the octopus! The shooting locations are magical:\nMexico's Festival of the Dead, the Tangier, Austria (Alps) in Rome and\nespecially in London. The weak link: Monica Bellucci is too mature for\na femme fatal, she is 51 years old. James Bond seems younger that her.\nLeah and Monneypenny are fairly ordinary, but it works. I appreciated\nthe chic evening silk dress. TThe clue of the mouse which goes into the\nhole - that's too cliché! The beautiful white cat that I have seen in\nan old movie 007 what does it means ? And how to explain the quick\nraise of this Blofeld guy, at the head of the most powerful global\nnetwork that exists? Where did he find the money to acquire this new\ntechnology? I like C (Moriarty from Sherlock), Q and M (Ralph\nFiennes-class!). And Bond's super car! A small top: Casino Royale-1,\n2-nd place Skyfall and SPECTRE, the 3rd.\n"},
{"review": "\nThe title SPECTRE brought back the bond series back to its origin,\nJames Bond. <br><br>With SPECTRE, our eyes could finally fixed again on this convergence of\nmasculinity. The film deliberately unwind the clocks back to somewhat\ndays in 70s or even 60s with character's clothing, environment, cars\nand setup. This was the golden era of James bond and his movie when\naudience focused more on the plot. <br><br>You could tell the producers had taken an enormous amount of strength\nin order to discard what they have been using to entertain their\naudience in the last 10 years, no weird gadget, no multi- purpose cars,\nno gorgeous babe and large amount of street chasing scenes. They were\ntwisting the plot and making great use of sound effect in order to\nintensify the whole movie aura in this film. I could told you they were\nvery successful in turning the film from a action blaster into an\nintense agent film where danger lures everywhere.<br><br>I had a good time enjoying the old time scene from this movie. And last\nbut not least, Léa Seydoux appearance was astounding and elegant in the\nmovie.\n"},
{"review": "\nJames Bond(Daniel Craig) infiltrates a criminal organization known as\nSpectre, but soon discovers he might have a bigger connection to it\nthen he thinks.<br><br>Daniel Craig once again knocks it out of the park has James Bond, but\nin this one he is a little more loose, then he was in the last ones.\nCharacters M, Q, and Money Penny are giving more to do this time, then\njust being side characters. But Christoph Waltz really is who grabs you\nhas the main bad guy, when he's on camera, you'll feel the chills going\ndown your spine, he just has a menacing presence. David Bautista is\nalso good in his role, has the main henchman. Action scenes are\nalright, nothing too spectacular. Bond girls are alright, just kind of\nthere.<br><br>There are moments that it does pay homage to other bond films, but it\nstands on it own.\n"},
{"review": "\nIf there is one thing that is constantly suggested in reviews for this\nmovie it is that \"SPECTRE does not live up to Skyfall.\" I for one could\nnot disagree more with that statement. In reality, Skyfall would have\nbeen a fairly average Bond movie had it not been for the brilliance of\nJavier Bardem and Judi Dench's performances.<br><br>SPECTRE is a bold movie that pushes the envelope in more ways than one.\nFirstly, to reinvent the character of Blofeld in such a hazardous\nmanner (his personal connection to bond) is very daring and could have\neasily delved into the realm of absurdity, but SPECTRE manages to\nmaintain a deep level of realism whilst the connection between the two\nunfolds. The plot of the movie is relevant and grand and does\ninvestigate the questions of today that are being thrust into the light\nby people like Edward Snowden.<br><br>Relative to Skyfall, SPECTRE is a completely different kind of movie,\nsure it's still a Bond movie and there are certain things that one\nexpects to get from a Bond movie and they are delivered in ways that\nwill be classic in years to come.<br><br>Bond's discovery of the organisation is handled very well and the\nglimpses of Waltz in the first act present images to Bond fans that are\nreminiscent of Pleasance shifting the bodyguard out of his line of\nsight or the metal door opening in the dark room to throw the shadow of\nDr. No across the floor. A truly memorable scene.<br><br>Bond's struggle with Mr. Hinx on the train is OF COURSE a throwback to\nthe famous fight with Red Grant in FRWL, but modernised and fresh. The\nlack of any sound over that scene besides the grunts and the groans of\ncombat are fantastic and allow the audience to be present with them\nduring this life and death battle.<br><br>In many ways I think the movie is misunderstood and it always going to\nbe because of it's greatest flaw.... it came straight after the massive\nsuccess that was Skyfall.\n"},
{"review": "\nSpectre is a truly classic fantasy adventure. While their are some\nflaws with the story and pacing I came out of the theater wishing I was\nJames Bond which is what any good Bond movie should make you feel. <br><br>The action was top notch and had some great set pieces. The practical\neffects are refreshing to see in a big budget production these days.\nThe cast was fantastic and despite some saying that Chistoph Waltz was\nunderwhelming as the villain I thought he did a great job with what he\nwas given. <br><br>Daniel Craig is the best bond in ages. He can only be compared to Sean\nConnery and is the closest thing we will ever get to matching the best\nBond of all time. He feels comfortable in the role now and moves\nthrough each scene with swagger.<br><br>The gadgets are finally back and so is the escapist nonsense of the\noriginals. I loved Casino Royale and Skyfall but both are dark and\nserious movies with heavy themes. It's nice to get away from that\nsometimes and just go along for a fun ride. <br><br>My biggest problem with the movie is the lack of development in the\nlove story with Madeline Swan. Their just simply isn't enough shown to\nmake me feel like Bond truly cares more about her than the other women\nhe has encountered. <br><br>Overall I loved Spectre and plan on seeing it multiple times in\ntheaters. I give it 10 stars not because it is the best movie out their\nwith a deep meaning and reinvents the genre, but because it isn't and\ndoesn't. It is my idea of the perfect fun movie to watch and escape\nreality.\n"},
{"review": "\nThis is my first review so please bare with me.<br><br>I recently saw Spectre and was blown away. There seems an awful lot of\nnay sayers who are announcing how Sam Mendez has ruined Craigs run as\nBond. I feel this is quite the opposite. <br><br>First off, it seems people have forgotten where this franchise started\nwith comments of \"Austin Powers-like\" Whatever that means. Bond was the\ntemplate and progenitor of the super-spy genre and now, with Spectre\ncomes full circle without being cheesy. <br><br>Amazing action scenes, brutal fights and an exciting car chase. Not to\nmention an intriguing story that reintroduces the evil organisation of\nSpectre to modern audiences excellently. From the very start there is a\nslow build of dread and a definitely feel that something sinister is\nlurking behind the scenes in the shadows. <br><br>And on occasion, you actually feel like Bond is in trouble and over his\nhead. Of course. we all know he's going to be OK but Mendez manages to\ninject that momentary feeling of doubt for Bonds safety on a couple of\noccasions.<br><br>Stunning performances all round. Well rounded Bond \"Girls\" and yes. a\nthrowback to the earlier Bonds but that's not a bad thing.<br><br>If you've wanted a Bond film that successfully merges Craigs gritty\nCasino Royale with all the old school touches look no further.<br><br>So go take a look and decide for yourself. Because as Mr Bond says-<br><br>\"Well, It's all a matter of perspective\"\n"},
{"review": "\nI really don't understand what the critics were smoking, in my opinion\nSkyfall was a good Bond film but very overrated and basically The Dark\nKnight with James Bond.<br><br>Spectre in my opinion is far superior and finishes the overall arc of\nDaniel Craig's James Bond, depending on if he wants to make another or\nnot.<br><br>The music was great (apart from the Sam Smith theme), Acting, Action\nand story. <br><br>See it in IMAX, it's worth it even for the Mexico City opening scene\nalone!\n"},
{"review": "\nWhen I heard the reviews for this movie! I went not knowing what to\nexpect! What I got, Left me Amazed and confused! Amazed at how Amazing\nof a job they did with the movie and confused at why people were giving\nit such bad reviews! The movie starts off with a bang and ends\nperfectly with an even bigger bang. I don't normally write reviews but\nI HAD to for this one! My reasons why, I want people to know how Good\nthis movie actually is. I want the movie to earn the money it deserves.\nI want Daniel Craig, Sam Mendes and Everyone who put so much work into\nit to know that they did an AMAZING JOB and to continue doing an\nAmazing job onward!<br><br>It wraps up all 4 movies perfectly. Any questions You may have had, I\nbelieve were answered! <br><br>I say this without a shadow of a doubt! My Favourite Bond Film!\n"},
{"review": "\nSpectre is an amazing film.Daniel Craig once more is a fantastic 007 in\nhis fourth appearance.Sam Mendes has directed a thrilling film and\ndeserves a huge amount of credit because his target was to better\nSkyfall and he has succeeded without doubt.Dr Madeleine Swann is a\nmagnificent Bond girl as she is highly intelligent and very\nattractive.Dave Bautista is an extremely physical henchman and the\ntrain fight is brutal,bringing back memories of the train fight in From\nRussia With Love(1963).Franz Oberhauser who is portrayed by Christoph\nWaltz is unbelievable in the film and is no doubt my favorite Bond\nvillain.It's very clever how Sam Mendes has tied together the previous\nthree films in to the film.Also the films ties together memories from\nthe earlier films which is brilliant.The beginning of the film is\nextremely entertaining and is also throughout.The countries that are\nused in the film are very exotic and fantastic.M,Q,Tanner &amp; Moneypenny\nalso deserve credit for their appearances.The theme song makes sense\nonce you've seen the film.The beginning of the film in Mexico is very\nentertaining.The ending is also fantastic.I can't wait for the 25th\nBond to come out in the future.In my opinion this is the best Bond film\nin history.I hope Daniel Craig will once more portray 007 and that Sam\nMendes will direct it.A truly excellent film - 10/10.\n"},
{"review": "\nExcellent pacing, Great car chases, Great action sequences, Good drama,\nNot too much cheese, Brilliant nods to Bonds of old, Ties the Daniel\nCraig era up nicely.<br><br>Did not feel like a 2.5hr film either.<br><br>I would recommend any Bond fan see this film or any Bourne fan for that\nmatter.<br><br>The Bond girls in this film are also a lot better and more fleshed out\nthan in previous Bonds.<br><br>I just cannot fault Spectre!<br><br>GO SEE!\n"},
{"review": "\nI have never liked Daniel Craig as James Bond. For me he just lacks any\nsophistication and humour and doesn't look comfortable doing anything.<br><br>I have never rated him and actually think he took Bond in the wrong\ndirection. This isn't his fault I just think that the Bond producers\nwanted to copy the success of the Bourne films and ditched the near\nperfect Bond in Peirce Brosnan for the rugged looking Mr Craig.<br><br>Now that being said this is one of the better Daniel Craig Bond movies.\nIt is full of action from beginning to end with an excellent cast,\nespecially Christoph Waltz, but I think it's success is that it\nreturned more to Bond being Bond and not a Bourne clone.\n"},
{"review": "\nIn \"Spectre\" Craig ends after his previous work as \"Bond\", absorbing\nand fun. If \"Skyfall\" was sober and serious, \"Spectre\" is the opposite\nbrother: fun, entertaining, absurd and glorious in its purposes. More\ntraditional with the classic Bond scheme and Daniel Craig giving a new\ndimension in character: one that can continue playing as only he knows,\nbut also giving it an air of relaxation, accommodation in the role and\nadventure. He looks mature and adult, changed after all these years,\nand their missions. They are no longer so dirty and rough as at the\nbeginning, but elegant and tidy.<br><br>The story does not have the groundbreaking surprise \"Royale\" or\ndepression dirty \"Solace\", nor the depth of \"Skyfall\". But it has the\nenjoyment that there was in all of them. Bond has the experienced and\ngallant who was not in those. It has the classic James Bond was not\nthere.<br><br>The pace is very good, the action never exceeds the sequence of Mexico\nDF but still stellar, music accompanies very well and even the\ndiscourse on (perhaps the deepest part of it) hovers monitoring the\nfilm. \"Spectre\" is the most dynamic and fun Craig as Bond film.\n"},
{"review": "\nWell,the latest Bond film is not good,not bad,just in the middle of\nthem both.Lets start with the pros.<br><br>The theme song is quite nice and starts the movie on a pleasant\nnote.The opening scene is really,really entertaining,especially the\nhelicopter fight scene.The Aston Martin DB10 is awesome as ever,and it\nwas great to see 007 drive it around.The car chase with Dave Bautista\nwas fun to watch.The parachute thing inside the car seemed\nimplausible,but this is Bond we're talking about.The introduction of\nMadeline felt good and would like to see her again I future\nfilms.Christoph Waltz is an incredibly talented actor,and hoping to see\nhim be more significant a character in coming films.<br><br>On the downside,the lack of story and overlong runtime seemed\nunnecessary.They should have given more character development to\nMadeline.The talented Dave Bautista is wasted as Mr.Hinx,Spectre's\nmurderous assassin.Blofeld is one of the best villains ever,but\nunfortunately,he fails to make an impact.The revelation of C being a\ntraitor isn't exactly a twist which shocked me.Also,who the hell parked\na boat in the MI6? <br><br>But this movie is enough to carry our beloved spy franchise\nforward.They passed this time,but they gotta do more.\n"},
{"review": "\nIf the Star Trek movies were good on the even numbers (the older\nmovies), then the Bond movies are following a similar pattern but on\nthe odd numbers. Casino Royale was passable, Quantum of Solace made no\nsense and Skyfall was okay.<br><br>This brings me on to Spectre. It had a lot of promise but failed to\ndeliver on so many levels. We had a film based around one of the best\nknown criminal organisations in the form of Spectre and one of Bond's\nmost iconic villains in the form of Blofeld. Here is my first problem;\nI felt Waltz was a good choice to play Blofeld but he is seriously\nunderused. Dave Bautista actually gets more screen time, or at least it\nfeels like he does.<br><br>What I feel really let down by is the premise that the previous three\nfilms are somehow tied together but in order for that to happen the\naudience needs to be able to look back and go 'Oh, yes'. Instead we\nhave a standalone film with very little, if anything, that made me\nthink back to the earlier films. For me this was a lazy film, albeit\nwith some nice action sequences but if I want a brainless action film I\nwill go back and watch an old JCVD or Steven Segal movie.<br><br>In fairness this film is better than Quantum of Solace but it spends a\nlot of time building up the plot and very little time resolving a lot\nof issues.\n"},
{"review": "\nAt last one normal \"James Bond \" movie!!! It was about time to watch a\nfilm that it has all of these specific details that we've been used to\nin the past(Sean Connery's &amp; Roger Moore's films).Spectre is a film\nthat has the suspense,the plot,the action,the music and the style of an\noriginal Bond movie.I loved it and when i watched it, i had the same\nfeeling as i was watching the films from the golden era of the James\nBond movies,something that was missing for the last years.Spectre was\nthe best by far among Daniel Craig's 'Bond' movies.I wish that every\n007 movie from now on would be like this one, which was a return to the\ncorrect direction!!!I enjoyed it a lot!\n"},
{"review": "\nYou have no idea how much I tried to like this movie. Yes, I've heard\nthe talks and the rumors regarding how bad it is. I thought that maybe\nit just wasn't given a chance or something. Or it was being compared to\nSkyfall unfairly. The opening oner was really well put together. The\nmusic was tight and tense, building up into a really exciting chase and\naction sequence. And then it started making no sense at all.<br><br>The action is dull. The villains are pathetic and not the least bit\nterrifying. The Bond Girl...I really can't believe that this Bond girl\nis the one that ends up with Bond. Its almost an insult to Eva\nLongaria's character in Casino Royale, a well developed and actually\nbelievable female lead. This is not a slight at Lea Seydoux, I think\nshe did fine, but at the writing of the film itself.<br><br>Cristoph Waltz was not scary at all. In comparison to, say, Silva from\nSkyfall, he seems like a small child. You can't just say, \"Hey,\nremember the bad guys who messed with you in the past two films? I did\nthat all along!\" and expect me to all of a sudden be terrified. Silva\nfelt terrifying, exposing secret agent files, causing havoc even when\njailed, he's just borderline insane. Blofeld...what did he do in this\nfilm anyway?<br><br>I find it really difficult to find any redeeming qualities to this\nfilm. Other than the opening sequence, I dunno, Dave Bautista was kinda\ncool. And that's about it. Disappointing flick.\n"},
{"review": "\ni usually don't write reviews, but my hand is itching to comment some\nworst movie that i've just watched. just can't get a grip how come\nJames Bond movie become this terrible? 1. action scene when i first saw\nthe helicopter scene in Mexico, i said okay its a little exaggerating\nbut still makes a little sense, but it all went horrible when Bond\ntries to stop 4-5 cars with an airplane, okay i get to the point where\nbond breaks trough a wooden barn or something and the plane does not\nexplode, and then at perfect timing the plane hit one car that make\nanother car from behind crashing it. the scene is too coincide that i\nthought that bond was a god or something (this is worst than some\nIndian action movies). the most shocking fact is that the villain\nplayed by Dave Bautista breaks trough front car window because of the\ncrash... a Range Rover Evoque or something does not have an air\nbag????? and so on i could go on more than 1000 words. 2. casting i'm a\nbig fan of Monica Belucci in Malena,but seriously in 2016... she should\nbe a bond girl 5-10 years ago, i get cringed looking at her wrinkle\nwhen Bond kiss her. i'm not a big fan of WWE,but when Dwayne plays some\nmovie... okay it went pretty good. but Bautista??? no, hell no worst\nmuscle villain. other bond girl by Lea Seydoux is actually quite okay,\nbut is there no other blond beauty that have not play in a spy movie\nbefore (rogue nation)??? her face in a bond movie makes me confused\nwhether i'm watching James Bond or Mission Impossible. and the boss\nvillain (forgot the name), looks like an impotent nerd guy that is too<br><br>polite.how come fear comes from a character like this?? 3. sex scene\nthat is too short and not hot at all, is this even a Bond movie?? 4.\nplot hole, obscene logic, lack of character and relationship\ndevelopment. i think that's about it that i can rant to peace my mind\n"},
{"review": "\nAbout me: I'm 44 old male, so I watched a lot of movies in my lifetime.<br><br>Story-Line: This is a classic Bond. There's an evil organization\ninfecting its way into power of the entire world through maniacal means\nthat is quite literally obsessed with Mr. Bond, who only has his wit\nand some gizmo's to bring them down. <br><br>About the Movie/Verdict: \"Spectre\" isn't a bad film. It just isn't\nreally a great one. Movie is worth seeing as a big budget Bond epic\nthat ticks all the right boxes without hitting all the right notes. It\nreportedly cost $300-350 million and it's apparent in every frame\npacked with extras, expensive equipment, and grand locations from\nMexico to Britain to Italy to Austria to Morocco and to the African\ndesert. If \"Skyfall\" was the pinnacle of Craig's run as Bond, \"Spectre\"\nsignals a slight downturn and a need for the series to break new ground\nand redefine who James Bond is for the next generation. Unlike the\nMission Impossible franchise, the Bond franchise has sacrificed\nvitality for action.<br><br>Rating: 6\n"},
{"review": "\nI'm a huge Bond fan, and I admit that Daniel Craig is one of my\nfavourite Bond actors. He brings a gritty realism to the character that\nworks so much better than the campy depictions. Unfortunately, this was\nquite possibly the slowest and most boring installment of the\nfranchise. That might be a bit of an exaggeration, but it definitely is\nthe worst of Craig's Bond films.<br><br>Like others have said, it opens with a pretty exciting sequence, but\nfrom there the pace slows right down. My son even said during one scene\n\"wow, this scene is boring\". And he was right. I understand that not\nevery scene is going to be action packed, but every scene should at\nleast further the story. <br><br>I'm not saying it's not worth watching...it IS a Bond film, after all,\njust don't expect to be putting it on the top of any lists.\n"},
{"review": "\nOmg.... This was bad. Like my brain is sore bad. I feel like Bond in\nhis torture scene . This was so incredibly awful. Words can barely\ndescribe how much money, time and brain cells were wasted in both\nmaking and watching this movie. It was like the reject script from the\nearly mission impossible films, combined with randomized gratuitous\nviolence, and poor casting. Even a talented cast couldn't save the\nstilted poor dialogue and lack of logic by all main characters, good\nand bad alike.<br><br>I watched this because despite hearing bad reviews, I thought how bad\ncould it possibly be. Imagine the worst film and then 10 x worse than\nthat. One of my favorite female actresses was in here and they\nbasically reduced her to a prop. She had a \" love scene\" with Bond that\nseemed more like stylized rape. <br><br>This was all kinds of bad... Like long boring bad with no coherency.\nSave your time and money. Watch ghost protocol instead .\n"},
{"review": "\nYes we have a new winner, or should I say loser. This is the worst Bond\nfilm so far. Let me say from the start that I enjoy Bond films. They\nare stylish and over the top and because of this have often set the bar\nfor other action franchises. This film was none of those things. Bond\nfilms are known for spectacular opening sequences but this one was\ndull, dull, dull. Unfortunately the film went downhill from there. <br><br>I enjoyed Skyfall and have seen it several times but even then I found\nmyself counting plot holes. In this film don't bother counting them.\nThey will run into the hundreds. Just how many more times can Bond get\nout of impossible situations in increasingly ridiculous ways. Andrew\nScott played his Moriarty character all over again with no difference\nat all from Sherlock. All the characters were two dimensional and\ntotally predictable. The only reason I gave this 2 stars instead of one\nwere a couple of lines of vaguely amusing dialogue and Blofeld's\ntorture device near the end. We all know that there will be more films\nto come with Blofeld as the villain, presumably with eye patch. Please\nput more effort into them than this. As far as this film is concerned\nwe all know what C stands for.\n"},
{"review": "\nAfter the slew of serious movies, this is the tongue-in-cheek fantasy-\nlike homage to the 60's Bond films that we wanted. There's lots of\nbeautiful locales, a Day of the Dead parade, Bautista playing a\nbeautiful henchman, Waltz playing the villain, Aston Martin chases and\nthe most gags out of all the Craig films thus far. There's lots of\nwelcome nostalgic throwbacks like a train fight, an evil lair and\nskiing scenes.<br><br>The plot relies on the standard Bond formula, the backstory of the\nvillain is underwhelming and the climax is a little weak, but the first\ntwo acts of the film were great and as a whole, this is a very\nentertaining action film.\n"},
{"review": "\nI haven't been the biggest fan of the Daniel Craig James Bond films,\nbut \"Spectre\", while flawed, is my favorite of his four on the whole.\nIt's the first one that pits Bond against a villain of his own stature\nand a henchman of superior strength, the first one that makes him look\nvulnerable or like he's in any danger. It's also more jam-packed with\naction and less heavy on the psychodrama than the overrated \"Skyfall\";\npsychoanalysis is still there, but done in a more discreet way (like in\nthe scene where Bond is \"interrogating\" a mouse). There are flaws: an\natrocious title song, an underdeveloped love story, some illogical\nmoments. But there are also some great scenes, like Bond landing on a\ncouch, the train fight, or the final three minutes which really do\nbring Craig's Bond full-circle and send you out of the theater with a\nbig grin on your face. The cast is terrific (Craig is rather blasè in\nthis one, but also more relaxed than usual), and I wouldn't mind seeing\nsome key players of this film return in Bond 25. All in all, an\nentertaining Bond epic. *** out of 4.\n"},
{"review": "\nMinor spoilers ahead, but no need to check the spoiler alert box since\nthey all all too trivial.<br><br>\"Casino Royale\" was (apart from Nolan's \"Batman Returns\"), the biggest\nfranchise reboot of the past decades: A brand new Bond: blond, fit,\nmisanthropic yet likable, arrogant yet faulty and of course in... love.<br><br>\"Quantum of Solace\" was somehow inferior but yet contained nearly the\nsame elements. <br><br>\"Skyfall\" did raise the bar significantly: we were also introduced to\nan aging wounded Bond doing a one-to-one fight against the devil\nhimself. Great modern action scenes and a exceptional old-school\nending.<br><br>Now the 4th Daniel Craig film did not live to (my) expectations.\n\"Spectre\" contained all the right ingredients mentioned above, but\nblended in a convoluted and uninteresting story. <br><br>So you will see exotic places, great action sequences, fight scenes,\ncar chases and explosions, but without any real drama in them.<br><br>More sadly you'll see a Bond from \"the past\", a Bond flying planes and\nhelicopters, fighting and winning against hordes of villains! Yes we\nliked the rough no-plan approach Daniel Craig introduced, but the\nproducers clearly enhanced it to near recklessness.<br><br>If you are an 80s Bond aficionado, you'll like this film. And it made\ntons of money already.<br><br>But the route the producers chose towards the traditional Bond way is\nIMHO not the right one.<br><br>Enjoyable *7/10, but forgettable.\n"},
{"review": "\nFirstly, I am a big Bond fan. Have loved the series re-boot and rate\nDaniel Craig.<br><br>Unfortunately Spectre has managed to become a mish mash of all the\nprevious bond films in one 2.5 hour boring offering.<br><br>Every scene was nothing I hadn't seen before.<br><br>Dave Bautista and Christoph Waltz were seriously under used and the\nplot and pacing was like watching paint dry.<br><br>Casino Royale set a very high expectancy and has seen diminishing\nreturns.<br><br>Lets get back to basics.\n"},
{"review": "\nSpectre is more traditional and lighter Bond story than previous\nSkyfall was. Darkness of Skyfall has replaced with more classic Bond\nstorytelling. There are a lot of exoticness, Bond girls, dry English\nhumor and luxury, like it should be in Bond stories. Story is lighter\nthan it was in Skyfall. Is that a good or bad thing? I leave conclusion\nto viewer. Personally I like more these airy spectacles. Spectacle\nstart scene is massive, but Sam Smith's \"Writings on the Wall\" is a\nlittle letdown.<br><br>Villain of story. Spectre's leader (Cristoph Waltz) manages his role,\nbut hardly stay in history as most vicious bad guy in Bond movies. Mr.\nHinx (David Bautista) is like a copy of iron tooth (Richard Kiel), but\neven his role won't match for his paragon. Daniel Graig as a Bond is\nconvincing as usually.<br><br>Spectre has a lot of references to earlier Bond movies. There are white\ncat, ejection seats and spectacle chase scenes which will certainly\nsatisfy older audience. On the other hand some of these scenes are too\nlong and numb. Big picture is anyway very good entertainment. Spectre\nis obscenely entertainment and functional Bond adventure even it is not\nas satisfy as few previous Bond movies.\n"},
{"review": "\nI like action movies. I like movies with a good story as well but with\nSpectre it is as if they tried to hard to tell a good story and in the\nend there was not much of a story after all.<br><br>Spectre was like seeing a spectacular chocolate cake but after the\nfirst byte it tasted rather ordinary.<br><br>Instead of telling a good story the complication of it all ruined the\nstory. I found it tedious to follow this rather complicated story they\nwere telling and yet it was so simple. In the end I actually asked my\nfellow watchers more about the story because perhaps I was not paying a\nlot of attention to the movie.<br><br>Spectre is a cool action flick with all the bells and whistles you'd\nexpect from a good, high budget action flick. Perhaps the story could\nhave had more substance.\n"},
{"review": "\nThis is not a bond film , Bond films have always been different to\nother action films. This was the same as taken, transporter and many\nothers. I normally never bother to write a review. <br><br>But in this case my blood was boiling after this ordinary film. Having\nbeen a fan since the early days and was very disappointed. Where were\nthe gadgets where was Bond!!!!! At the start of the film it drags on\nand on the excitement was missing. The charterer C was totally out of\nplace. Sam Mendes is totally out of his depth and has damaged the Bond\nbrand. We all know this is not a documentary, but when Bond / Craig get\npummeled by the bad guy on the train and his tie stays in place and he\nsuffers not a scratch or a black eye where is the realism...The\nIslander aircraft flying with its wings clipped outboard of the\nengines????? Sorry got bored here same ass when watching the film my\nmind wandered off at times to what I was going to eat later.\n"},
{"review": "\nSuper slow and long movie. Completely dis-constructed. I would not\nadvise anyone to watch this movie. It is really a lost of time and\nenergy. Furthermore, it leaves you with a bad taste, if you are a fan\nof the James Bond franchise. This movie is the worst James Bond movie I\nhave ever seen. I hope the next James Bond movie will see this\nproducer's teams and all people who worked on this movie fired. They\ndisgrace the movie franchise. I wish the next movie will be closer to\nthe Sean Connery's era where the mix of Womanizing, Actions, and\nsuspense was just blended in a near perfect way. Not at all what you\ncan expect from the last James Bond movie. Since they chose to change\nto Daniel Craig, it seems that the Studio lost itself and created poor\nactions movies, with an even more degrading quality from one movie to\nanother. Definitely not worth your money or your time.\n"},
{"review": "\nPlot meanders, except when it really just sits still and glosses over\nfacts needed to understand the story. Unless you've seen previous Bond\nmovies, you won't get the references.<br><br>There are possibly worse Bond movies than this one, anything with\nLazenby comes to mind. Yet, with all the special effects, all the plot\ntwists (which honestly, if you're above a 3rd grade reading level,\nthere aren't any), with all the villains that could exist, this is the\nworst Bond ever. Above and beyond horrible and bad, this is the worst.\nDo reviewers just give it a good review simply because it IS a Bond\nmovie and just never see it? Neat gadgets and spectacular vistas do NOT\nmake a good movie. If that were the case, then Ishtar would be rated\n#1. <br><br>Not going to do spoilers, not going to tell you more than this, just\nthat honestly, it's just freaking bad. Just bad. This should have been\nmade with at least a plot or in any way a point. <br><br>Just bad.\n"},
{"review": "\nI suppose that if I have to point out one single good element in the\nwhole film that would be Ms Bellucci. <br><br>Other than that, the inability of the film to grasp the viewers\nattention, the lack of spice and emotion and the absence of a good\nsoundtrack, has made me regret viewing this motion picture. <br><br>The plot was not consistent, very slow, not enough action not enough\ngadgets not enough cars and no love scenes. <br><br>Perhaps, a little research would have helped the makers of this\nproduction understand better the legacy of Bond.<br><br>Shame.\n"},
{"review": "\nSkyfall took us back to the mystery of James bond's childhood. Spectre\ncarries that theme but goes on further. The Very idea that Spectre\nitself has been involved in Bond's life since Child hood and they were\nbehind every tragedy Bond has faced. Intriguing idea and the movie\naddresses it in A white knuckle ride from start to end. The Movie takes\noff with a Explosive Action packed run as bond investigates a name the\nLate M gave him. however as things go out of hand quickly and there is\na lot of death and property damage M has no choice but to ground 007. M\nit seems is under fire as the Minstery is forcing MI 6 to merge with MI\n5 And the plan is to replace the 00 section with drones and world wide\ninformation in which no one is safe from the invasion of privacy. Bond\nignores M's Orders and goes after any and all leads that take him to\nSPECTRE. After that the film becomes a white knuckle of a ride as Bond\nuncovers Spectre and Blofeld. And discovers that blofeld is behind the\nplot to get rid of the 00 section and M. Does Bond succeed of course.\nHe does but Bond is beaten into the ground at the end of the film. He's\ntired and he's worn out but he is ready to carry on. A surprise here is\nBatista as Hinx a Henchman paying Tribute to all the unstoppable\nmonster henchmen That have gone on before from Oddjob to Jaws. the\nsilent Hinx is a death dealing machine. And he is perfect to watch.\nThis film is a worthy follow up to Skyfall.<br><br>James Bond will return.\n"},
{"review": "\nSince as far back as the late 1970's there have only been a handful of\nstrong entries for Bond. The series was lost in the 80's with too\nlittle bite coming from the tail end of Moore's output, and too much of\nit for most people's taste from Dalton's \"Licence to kill\". Then, like\nBond himself, the series then was gone without a trace until a\nhighlight in \"Goldeneye\" awoke and it was good to have the killer back\nonce again; but it didn't last. The following entries are largely\nforgettable and nothing more than throwaway entertainment. \"Casino\nRoyale\" was yet another new clean slate and things looked promising\nonce again, that was until \"Solace of shaky cam\" got rushed out and\nhopefully for the last time pulled the spy toward being nothing more\nthan a Bourne wannabe. Now though things are looking promising, and all\nI can say is it's about time. Sam Mendes has driven the series back on\nform with two of the better entries in decades. This like the great\n\"Skyfall\" has what's needed to make a good Bond film. It has the\naction, the style, the fun, the locations, the women, the bad guys,\nwith sheer bags of quality to back everything up. This doesn't top\n\"Skyfall\" which would have been hugely difficult, but it gives Bond\nsomething he hasn't had for far too long: A strong back to back big\nhitter.\n"},
{"review": "\nAs a die hard fan of James Bond, I found this film to be simply nothing\nmore than a classic. For any original James Bond fan, you will simply\nenjoy how the producers and Sam Mendes re-emerged the roots of James\nBond. The roots of Spectre, Blofield and just the pure elements of\nJames Bond that we all miss even from the gun barrel introduction. This\nfilm deserves higher ratings in my view. I don't want to spoil the film\n, but I am finally glad the writers brought back the roots of James\nBond. A true fan nothing more nothing less. I don't know what else to\nexpect from a James bond film and Spectre does just what I originally\nexpected in a James Bond film. It opens a whole new extension to have\nmany more films to come. The cast does a superb in their roles and many\nsalutes to Christopher Waltz in his enemy role.\n"},
{"review": "\nA cryptic message from Bond's past sends him on a trail to uncover a\nsinister organization. While M battles political forces to keep the\nsecret service alive, Bond peels back the layers of deceit to reveal\nthe terrible truth behind SPECTRE. The 4th James Bond film starring\nDaniel Craig as the famous spy James Bond received mixed reviews from\nboth fans and critics what is my opinion about it? Well i loved it\nthere was a lot of great action especially the opening and that train\nfight sequence or the car chase on the streets of Rome and the cast did\na pretty good job unfortunately the film tho suffers from a very poorly\nwritten villain played by the great Christoph Waltz who although got\ninside the mind of 007 he just didn't managed to get inside our hearts\nlike Javier Bardem did in Skyfall there's also some cool references in\nthe previous 3 films and in the old ones as well. Spectre unfortunately\nalso has one of the worst opening title songs ever for a James Bond\nmovie performed by Sam Smith but besides those flaws the movie is not\nthat bad for example if you loved Quantum of Solace you will love this\none too but Casino Royale and Skyfall remain on the top of my list tho.\n"},
{"review": "\nI was lead to believe that Monica was going to be his love interest. I\nwas disappointed that not only was this not the case. And why so few\nscenes? She was pictured in all of the promotions, but barely had three\nscenes. <br><br>This was very deceptive marketing. I would not have paid good money to\nsee an old man make out with a twenty something girl. I really have\nnothing against Daniel's age or him being Bond. I just thought this was\ngoing to be a different movie than it was.<br><br>Here is an idea for the sequel, have him go to the US to check on\nMonica. Last we saw he gave her the number for an American embassy\nfriend. Then have him expose the corrupt government/corporate American\nnetworks. Like a Bond version of Shooter or Jack Reacher. Bond fighting\nAmerican corruption would be a good comeback.\n"},
{"review": "\n*Spoiler/plot- Specter 2015. In James Bond continuing secret work with\nthe British government, he mixes in some personal vendetta attention\nfor the violent death of his lover 'Vestper' from previous case files.\nHe follows those many international leads to finally confront his old\norganized enemy leader and that mob's henchmen.<br><br>*Special Stars- Daniel Craig, Christoph Waltz, Lea, Seydoux,Ralph\nFiennes, Monica Bellucci, Naomie Harris.<br><br>*Theme- World spy organizations need to of set their actions to keep\nsociety safe. <br><br>*Trivia/location/goofs- Shot worldwide. Has become the top box office\nearning Bond film. Daniel Craig has said he is looking to leave the\nbond films. <br><br>*Emotion- A wonderful epic spy film with it's lush foreign locations,\nexpensive scenes and large cast of interesting characters. Craig's\nintensity and knee-jerk animal violence is reminiscent of Connery. The\nopening Mexico City 'Day of the Dead' scenes were especially\nappropriate for the Bond films and their subject matter. All of the\nactors and roles work together extremely well to take the audience on\nan interesting journey of discovery and intrigue. <br><br>*Based On- The continuing James Bond film franchise canon.\n"},
{"review": "\nWhy do I call this the best Bond film ever? Because it narrates a clear\nand conclusive path to the long overdue end to this excellent series.\nTake the opportunity. This film explains the entire series and shows\nBond accepting a change in life path. There is no need for continuance\nafter this wonderful film.<br><br>The Three Acts:<br><br>The initial tableaux: The film starts in Mexico City in a grand public\nDay of the Dead celebration. Bond seems to be enjoying himself, but\nsoon is in direct pursuit of an enemy. When he returns to London, M\nlets him know that his actions were not appreciated, that he will be\nunder observation, and that the double oh section is in danger of being\nshut down.<br><br>Delineation of conflicts: C (head of the new organization Centre of\nNational Security) wants to shut down the double oh section; M wants to\nkeep it open. Bond wants to honor the postmortem wishes of the previous\nM. SPECTRE wants strong control of almost all information flow in the\nworld, so as to have more power and to make more money. C wants that\nflow to be available to UK intelligence to replace older methodology,\nlike MI6. Q, M, Tanner, Moneypenny, and Bond would like to preserve\neach other as well as some traditional British approaches to\ncivilization and intelligence. C and SPECTRE are clearly opposed, and\nseem to have the upper hand during most of the film. Bond's foster\nbrother wants to make Bond fully aware of how much he hates him.<br><br>Resolution: Bond has an opportunity to be his better self; does he take\nit?\n"},
{"review": "\nIt must have been easy for all the actors involved to learn their\nlines, there weren't that many, it was all action and very little\ndialogue.<br><br>James Bond was a product of the fifties, stories written by a man who\nhad lived the spy life in the forties so knew what he was talking\nabout. The Connery years were without doubt the best as they were set\nint the time of the novels, I've read them, in the sixties, all by the\nway. The character of this a the most recent films is not a of that\nperiod so the only connection to James Bond is his name, M and Q\notherwise it could be any spy movie.<br><br>Now they are talking about having a black Bond or even worst a female,\nWhaaaaat? Bond is a naval commander of the 40's/50's and would have\nbeen neither. This just PC gone mad.<br><br>Don't get me wrong, the film is very entertaining, fab special effects\nbut little story or good dialogue. Some good performances, especially\nRalph Finnes and Rory Kinnear, the females being instantly forgettable,\nespecially the now PC Miss Moneypenny. Daniel Craig is Daniel Craig,\nneither good or bad, just average.<br><br>So if they want to make a fab Bond movie go back and read the Flemming\nnovels and set it in the 50's or 60's when there was a cold war. Write\na good story, and there have been some books, eg, Colonel Sun by the\nwonderful Kingsley Amis would be perfect. And get someone with the sex\nappeal and humour of Connery.\n"},
{"review": "\nI love the Bond movies and I realize that it must be difficult to\nsupercede the previous films, but this may be the worst Bond film yet.\nPerhaps it is because they feel pressured to \"out do\" the previous film\nand they can't come up with good ideas. But I think the writing is very\nbad on this one. Daniel Craig is brilliant as Bond but here I think the\nwriting has him stepping out of character in a few places, making Bond\nappear stupid and incompetent. Even the special effects were a bit\nlame. This must have been a low budget production. There is no real\nclosure or viewer satisfaction provided. The producers, and especially\nthe writers, should be ashamed of what they have done to the legacy of\nJames Bond!\n"},
{"review": "\nWhat I liked from a couple of last Bond movies was they were off the\nregular 007 style, like not overly rely on spy's special gadgets. This\nchange has been since the day one of Daniel Craig as a famous British\nspy, James Bond. Anyway, he's the most fittest (muscular) Bond I've\never seen and he's celebrating 10 year anniversary with this film\nrelease. But the question is whether he to do another film or done with\nthe franchise. The doubt after the confusing end of this film.<br><br>The end was quite clear on the story perspective, so I kind of felt it\nwas a farewell for Craig. But, later I came to know that the official\nsource says Bond25 will be his fifth and so on till he opts out\nhimself. 'Spectre' was a very simple Bond movie I have ever seen, but I\ncan say the production quality was so good that you can't resist the\nenjoyment. The actors, they were also good, but not as I anticipated.\nMaybe many scenes were very ordinary for a Bond movie, that's\ncomparable with the nowadays action movies, otherwise it was not as bad\nas critics expressing their disappointment.<br><br>You can't believe what I was disappointed, you know when they say what\nthe C stands for - is that the best word they come up with against the\nM for Moron? Anyway, James Bond movies have always had ups and downs,\nthe last film 'Skyfall' was a mega hit and now this has not stood up to\nthat standard. But very entertaining with all the actions and\nunexpected turns in the narration. As a spy movie, it was okay, but as\na Bond movie is what might upset you, so its upto you how you look at\nit. But to be honest, I enjoyed it.<br><br>7/10\n"},
{"review": "\nI really didn't want to have to write this review on Spectre (2015)\nbecause I am a massive Bond fan and strictly talking about Daniel Craig\nin comparison to his other films, I relished his other efforts in\nCasino Royale (2006) and Skyfall (2008). But here I am. I remain after\nits finishing, unconvinced. And with a certain bitter taste too. <br><br>I am uncertain as to what I just watched because to me it seemed to be\nan weak, overly emotional and no where near hard hitting enough theme\nsong, a sudden and seemingly intense relationship which no one was\nconvinced by (she ain't no Vespa) a somewhat jaded Craig, a highly\nridiculous plot and far too much of the old car chase, helicopter\nchase, explosion and action scenes on overdrive to make it reasonable.\nWhen you strip Bond of some of his basic foundations, cars, gadgets,\none liners and women...I don't know that you are left with Bond\nanymore. Shoving extra action and more story line in doesn't fill that\nvoid. Challenging whether his job and section are still relevant in\ncontemporary society does little but highlight that real life is going\non alongside this overblown attempt. Such a shame, Craig is an awesome\nactor, Sam Mendes is a talented director. How did it all go wrong. Me\nthinks it tried to tie up all the loose ends neatly, but naturally that\nwill bring about criticism- it seems an easy way out! A new James Bond\nfilm should not be a reminder of how great the previous ones were in\ncomparison it should be unique it its own way but familiar enough for\nus all to smile when the burst of trumpets come in.\n"},
{"review": "\nI watched this movie on DVD today &amp; i'm going to tell this: This movie\nISN'T bad at all! Geddit?<br><br>And yes, this IS the 1st Bond movie i've seen in my life, &amp; it was such\na good movie. Buying the DVD for Php 550 is worth my money since i\ndidn't see the movie during it's theatrical run.<br><br>The action, plot, opening scene &amp; Bond's adventure are also good.<br><br>If this is Craig's last time to play James Bond 007, i will miss him.\n:,(<br><br>This movie is a blast, i think all Bond fans should watch this, even\nwith ur family &amp; friends.<br><br>Rating: 10/10<br><br>P.S.: If you hate Sam Smith's Bond song i respect your opinion. :)\n"},
{"review": "\nCasino Royale was definitely the Bond film that made Bond interesting\nagain. Great plot, some awesome action scenes, and actors who chew up\nthe scenery, and a back to the basics Bond. Unfortunately, Quantum of\nSolace went south, but I thought that there was room for recovery.\nUnfortunately, did not see Skyfall, but got an idea of what happened.<br><br>That leads us to Spectre. I will cut to the chase: this is reminiscent\nof the loony Roger Moore Bond films, but with more crazy action scenes,\nand a plot akin to Moonraker. While there are some great performances\nfrom the supporting cast like Ralph Fiennes, Naomi Harris, Ben Whishaw,\nand even Andrew Scott, the main cast is half-baked at best. Daniel\nCraig looks tired of playing Bond, while Lea Seydoux is more eye candy,\nand doesn't add any substance to the film. Waltz as Blofeld basically\nis a different version of Hans Landa from \"Inglorious Basterds\".\nPlotwise, it basically is Bond infiltrating Spectre. The relationship\nbetween Bond and Blofeld starts out interestingly enough, but instead\nof fleshing it out, it is left to languish. Coupled with continued\nappearances from the mean looking David Bautista (who is a mix of Odd\nJob and Jaws), this Bond film basically languishes into obscurity.\nBeautiful scenery, and lots of action, but very silly at points. You\ncan check it out if you want to waste some time, but I will leave my\ngood memories with Casino Royale.\n"},
{"review": "\nMaybe I am getting crankier by the minute but I've got to say that I am\ndisappointed with this latest Bond film. But first I have to own up and\nstate that I am not a fan of James Bond films, I do however enjoy the\ncurrent 'series' with Daniel Craig as the incarnation of Ian Fleming's\n007. Out of the four films, I'd rank Casino Royale as my favourite\nfollowed by Skyfall, then Quantum of Solace and finally Spectre which I\nfound to be ultimately rather silly.<br><br>The first act of Spectre was admittedly stunning. The first 5 or so\nminutes was a single, continuous tracking shot - absolutely spot on.\nBut the truth is that this is really all that I can vividly remember\nabout this film. A lot happens but the script was so clumsily cobbled\ntogether and so left what could have been a brilliant story line as a\npointless set of great action scenes interspersed with lame and\npainfully slow moments. In short the pace wasn't right which gave me\nthe feeling that this 'series' may have run out of steam.<br><br>Also from a point of aesthetics, Daniel Craig really hasn't aged that\nwell. There was a particularly awkward shot of Bond from behind and you\nknow, he has a pudgy bum. You read correctly. James Bond with a pudgy\nbum.<br><br>Silly film but with great action scenes, Not impressed overall.\n"},
{"review": "\nAn especially disappointing Bond. Daniel Craig is now batting 500, but\nI suppose you can't blame him.<br><br>Casino Royale and Skyfall were excellent. <br><br>Quantum of Solace and this outing, far from it.<br><br>There were some classic moments, I grant you, but all were tied\ntogether with the laziest, most improbable script to date. How could\nthe makers not realize this?<br><br>Maybe this on-again, off-again pattern will produce a better fifth Bond\nif Craig agrees, or they let him.<br><br>Then again, maybe he's run his course as 007 ...\n"},
{"review": "\nJames Bond is one of my favourite movie franchises and I adored Skyfall\nit's one of my favourites of the series and I was excited out of my\nmind for this movie and it was my most anticipated movie of 2015 this\nfilm literally had every thing going for it but learned nothing from\nthe major success of Skyfall. Like I said this is not a bad movie for\none the opening sequence before the credits is amazing possibly the\nbest of the series. Daniel Craig continues to shine as bond and\nperfectly portrays the character as Ian Fleming wrote him and gave a\ngreat performance in this movie as did the whole cast. I think few can\nargue that this movie is extremely well made and shot amazingly. When\nChristoph Waltz was cast in this movie I was pumped out of my mind to\nsee him as the villain and looked absolutely terrifying from the\ntrailers and he was a fantastic villain in this movie but he is barely\nin it and that is frankly a stupid choice not to have him in the movie\nthat much. The movie is also far to long and should have been cut by\nabout 40 minutes. The MI6 subplot in Spectre is dull and boring which\nis a shame as they set up all the supporting characters where set up so\nwell in Skyfall so it seemed like they could have a part of the movie\nto themselves. The action set pieces in Spectre are overlong and don't\nthrill enough and drag on Marjory. Spectre has a lot going for it but\ndidn't live up to expectations and didn't build on the events of\nSkyfall and seemed to regress back to the Rogor Moore movies in some\nways. 6.7/10 B-\n"},
{"review": "\nJames Bond. The apple of her majesty's service's eye. Tried to find a\nman because somebody told him to. The villain invited bond in his very\nsecret palace with his girlfriend (without any reason). After bathing\nand feeding them, the villain tried to kill bond by the most ridiculous\nway possible (you guessed it by inserting a probe in bond's head also\nwithout any reason). Bond being bond destroyed the whole place and get\nout of there with the girl. After 5 minutes the girl left bond and said\nhe is a GOOD MAN! But alas! The villain is not dead (big shock!), gave\nbond 3 minutes to find the girl or save himself (or the building will\nblow). Bond found the girl (always), shot the helicopter (with villain\ninside) while in a speed boat with a pistol. After killing almost 10\npeople throughout the movie, bond being bond (the good man), spared the\nlife of the villain. If the production was trying to make the most\nPredictable bond movie in last 15 years, they are a big hit. They hit\nthe perfect spot. JAMES BOND 007( licensed to kill or not kill, we\ndon't know)\n"},
{"review": "\nI started to see the movie and i couldn't finish it in the same day.It\nwas BORING,very predictable and filled with nothing.You could easily\ntell from the first 10 minutes what would happen,the way how Bond gets\naway is too unreal and awful.It's one of the worst movies i have seen\nin a long time,and for sure it's the the most boring one.The whole plot\nwas dull,written badly and with problems.It's like the 007 movies keep\nrepeating in a loop,you have always the same events,a new woman,a\npredictable plot and very unentertaining action scenes.With a rating of\n6,9 i was expecting something better from this movie,but i was deeply\ndisappointed.\n"},
{"review": "\nThe worst Bond movie I have ever seen! - and there have been some\ndoozies! Although I am probably slightly biased because I just never\nliked Daniel Craig in this role. I've seen him in other roles and\nthought he was a pretty good actor but he is just not James Bond - in\nany way, shape or form. To make matters worse the plot is mercilessly\ncontrived and clichéd - even the masterful Ralph Fiennes couldn't pull\nthis one from the doldrums. It did not only lack any classical 'Bond'\nflavour that could at least draw an audience in through nostalgia but\nit also had nothing new to offer - wooden characters and weak\nrelationships - simply too long and stiflingly boring. Aside from a\nheroic attempt from Christoph Waltz who inhabits his character with his\nusual flair and finesse, I cannot find any redeeming quality in this\nmovie. Mr Waltz is the only reason I gave this a rating of '2' instead\nof a well deserved '1'.Two and a half hours of my life that I will\nnever get back!\n"},
{"review": "\nEveryone in this film is bored, as though they just want to get it over\nwith. Maybe what they need is a fresh cast and a fresh production team,\nas well as a change in style.<br><br>Indeed, this film is all style and virtually no substance. The\ncharacters are two-dimensional and irrelevant. We just don't care about\nthem. The film is largely a succession of two types of scenes: the ones\nin which nothing happens, while Bond and others just pose for the\ncamera, as if in some expensive fashion commercial; and the ones filled\nwith action where nothing is ever at stake because the protagonists are\nclearly in no danger. The whole thing comes across as going through the\nmotions.<br><br>Bond is very dull, he has no charisma or sense of humour, and his\nrelationships are also empty and dull. And as for the villain, he is\nabsolutely ridiculous, and not one bit menacing.<br><br>One final observation: the song for the introduction is the worst ever\nin this marathon franchise. Absolute rubbish.<br><br>I am glad Craig will not be making any more of these films and I warmly\nrecommend the producers to try something new for a change. Try to make\nus care, try to make us like the protagonists, and insert more\nsubstance and less posing for the cameras.\n"},
{"review": "\nThe plot is incongruous. The writers seem to have spent a lot of time\nscraping the the bottom of the plot barrel. The un-engaging action\nscenes are just not believable. The continuity crew was fast asleep.\nThe sleepy title song had some androgynous voice howling in castratto.\nThe villain is pathetic. The older woman scene made no sense. The CG\nlooks fake. Spectre seems like a collection of scenes from prior Bond\nmovies which were done better. Spectre could have been a wonderful\ntravelogue if the trash in between the landscape shots was removed. The\nmovie tries to appeal to the lowest possible denominator of\nintelligence and succeeds. Roger Moore should have been brought back to\ndeliver this type of late 70's kitsch. This bomb is a total waste of\ntime and money. A truly forgettable movie.\n"},
{"review": "\nBefore you read my review you have to know I have never been a big\nJames Bond fan. But I do occasionally watch them. When it was with Sean\nConnery or Roger Moore I had more fun watching them honestly. Daniel\nCraig doesn't do it to me as OO7. In Spectre he constantly bugs me,\nlike the whole story bugs me as well. What bugs me the most about James\nBond is that he never has a scratch or anything. I occasionally box\nevery now and then and the amount of bruises and black eyes I had are\nnumerous. And I don't fight monster gorillas like James does. Well\nagain in this movie he has a building collapsing on him twice, he's\nbeen in a terrible plane crash, has countless fights and hits against\nwell trained fighters, he has been tortured etc... and guess what? Not\none single scratch, not one drop of blood. Now if he had super powers\nlike any comic hero I could live with that fact but he's not. He's a\nhuman, like you and me, and that annoys me so much. And after a brutal\nfight we of course have to watch him make out with the local bimbo from\nwhom he could be the father, the bimbo that first hated him so much\netc... It's all so cliché that it makes me want to barf. The story\nitself isn't good either, it's always the same crap. I really don't get\nwhy people are thrilled about movies like that. And it's so long, so\nmuch wasted time.\n"},
{"review": "\nComing off the high that was Skyfall, a lot of people were expecting a\nlot out of this movie. And did it deliver?<br><br>....not really, no. In fact, I'd venture to say that it's probably only\na bit better than Solace and definitely not up to calibre with\nSkyfall's success. The most serious flaw (a flaw that many movies have\ntbh) is in it's villain. I admit the introduction leading up to him was\ninteresting but then it just...stagnates. He spends so much time\ntalking about what he's done but never actually does anything. Not to\nmention the fail that was Andrew Scott. Not as an actor because the way\nhe looks Bond up and down...ahhh that was a beautiful Moriarty look\nthere, but his entire part could have been erased and it probably would\nhave been a better movie. Let's not even talk about the uselessness\nthat was Bautista's character. There was no need for the dramatics of\nhis introduction. In fact, there was so much that could have been cut\nout and that time used instead to introduce more by way of character\ndepth to the main villain.<br><br>It's so sad when so many great actors get together to make what could\nhave been a great movie but had a shoddy script to work with.<br><br>The gold in this film lies not with anything Bond does with his Bond\ngirls or M getting down into the trenches or even Andrew Scott's subtle\ninterest in all the men in this movie, but in the Bond/Q relationship.\nShipping aside, their chemistry is absolutely wonderful and I wish\ndesperately that they had focused more on that than with their sad\nexcuse for a romance. Each scene with them together was filled with\nsnark and just...so much perfection.<br><br>Watch this movie if just want to watch a Bond movie, no matter how bad\nit is. It's at least better than Solace?\n"},
{"review": "\nSo I haven't ever watched a Daniel Craig james Bond movie before. When\nI walked into see this, I was like probably a half hour late.Every time\nhes ever on television, like TNT or SY FY, its not the same, and the\nmood is so boring that Ide rather be asleep anyway. So I get into the\ntheatre, and like some people were saying, dumb. Daniel Craig got with\nsome chick in a hotel room that was certain that she was going to get\nkilled and even with him there, it would only be temporary like she\nsaid: maybe shede stay alive a day or two more....and though I lost\ntrack of that storyline....somehow he ends up in a place where he tells\nthe doorman hes Mickey Mouse and bad stuff happens there...kind of like\na government Parliament meeting or something. But then some gapped\ntooth woman dressed up like a geisha becomes the next woman involved in\nthis storyline, and James has to teach her and give her a gun. that\nabout sums up the fun...and though its not a two, I'll go with most\nother reviewres opinion and rate it a seven\n"},
{"review": "\nI never was a fan of old Bond movies. I am a fan of Daniel Craig's\nfranchise because is nothing like the old cartoonish style movies. I\nhave enjoyed all this new Bond universe and I had high spectation to\nthis new tittle, but is all disappointing.<br><br>Movie doesn't feel at all like the other titles of the saga, It feels\nboring, cheap and it has a tendency to be cartoonish like the classics,\nwhich is why I don't like them.<br><br>Maybe some fans of the old style would feel it like an improvement, but\nfor people like me is backwards.<br><br>I would keep thinking about this saga as a trilogy, and left this\nfourth chapter out of continuity.\n"},
{"review": "\nConsidering this movie's budget, you would have expected a lot more, I\nmean a lot, lot more. It felt lacking in soul. I hope this really is\nDaniel Craig's last outing as bond. We really need a reboot with a new\nactor. I never once felt emotionally attached to any of the characters.\nThe villain, didn't feel evil, the huge henchman was just annoying, and\nbond should have double tapped him in the head when he was lying\nunconscious on his car after the crash. But, no let him live to come\nback again. The opening scene was good, but the CGI explosion ruined\nthat as well. Once again Bond is going rogue, Mission Impossible\nanyone? Once again, all our lives are being monitored and watched.\nInformation is power (huge yawn). I didn't watch this movie in one\nsitting, I needed a 2 day break to get through it, and even 20 minutes\nbefore the end, got up had a cup of tea and a cigarette. I think that\nsums up this movie, very, very forgettable and will never watch it\nagain.\n"}
]