[
{"review": "\nATTENTION: THIS IS NOT A REVIEW OF THE MOVIE. THIS IS A REVIEW OF THE\nREVIEWS.<br><br>As I usually do before I watch new movies, I came to IMDb to read some\nreviews. First, I read the 5 top \"Love it\" and then the 5 top \"hate\nit\". The comments were so diametrically different that I decided to\ninvestigate who was posting these comments.<br><br>Surprisingly, the top \"love it\" reviewers were all new IMDb members.\nWhat's more, none of them have any other review. Even more strange, all\nthe reviews seemed manufactured with hype-type sentences. Here are some\nexamples extracted from these reviews:<br><br>- \"it's damned entertaining, and visually appealing. I recommend it in\n3D if you can watch it that way\" - \"Everything I could have wanted, and\nmore.\" - \"Oh my gosh, did my excitement grow\" - \"It blew me away.\" - \"I\ndecided to go see the movie, ready for it to suck. I was astonished to\nfind myself laughing throughout the movie\" - \"This movie is AMAZING!\"<br><br>By contracts, the top 5 haters, all of them, have been long-standing\nmembers with at the very least a dozen reviewed titles. In fact, take a\nlook at my own profile and you will find that I have been reviewing\nmovies here for years.<br><br>I am not saying that the positive reviews are fake. I am not accusing\nanyone. But if I were you I would do due diligence before trusting a\nsuspicious review.<br><br>I am NOT going to see this movie.\n"},
{"review": "\nI went into this movie with an open mind hoping that it would not be as\nbad as the trailers and TV spots suggest. It is. I really wanted this\nmovie to surprise me, to make me laugh to make me care for the\ncharacters and have some investment in the story, but it failed to\nachieve any of that. What I saw was a two hour mess of a movie. An\nunfunny, poorly written, poorly edited, contrived cash-in on a beloved\nclassic which has some of the poorest dialogue and worst performances\nI've seen in a while. The computer generated effects were like\nsomething out of a live action Disney picture. The music, in particular\nthe theme tune was uninspiring and added no impact or energy to the\nmovie. I honestly can't think of any redeeming qualities that this film\nhas. After waiting so long for a new Ghostbusters film this comes as a\nmajor disappointment. Some things are just best left alone.\n"},
{"review": "\nI've never seen the original Ghostbusters films, so I went into\nwatching this with quite an open mind. It ended up being incredibly\ndisappointing though, the CGI was terrible and reminded me of the early\n2000s live action Scooby Doo films, the girls, who I'd imagine are\nfunny in their own right, seemed to have absolutely zero chemistry\nbetween them and oddly enough Chris Hemsworth's character Kevin ended\nup being the most funny aspect of the film. <br><br>That's just my personal opinion however. My boyfriend who I went to see\nthe film with whispered to me 'this is awful,' half way through and he\nrevealed to me that he had felt ashamed while watching the film. I went\nbecause he guaranteed me it was going to be enjoyable and I think it\ndidn't take long until he realised that the movie was a disappointment.\n"},
{"review": "\nSome people are saying that this is the wort movie of all time. It is\nnot. It is merely a really bad movie with no redeeming qualities, and\nit insults your intelligence.<br><br>And, most of the YouTube videos made slamming it are 100s of times\nfunnier than this movie.<br><br>Seriously, the movie is just not funny. In fact Batman and Robin\n(George Clooney and whoever played Robin) had more humor in it than\nthis movie does, and that movie was worse than this one--that is how\nnot funny this movie is. <br><br>Save your money. Read a cereal box. It will cost less and be funnier.\n"},
{"review": "\nHonestly, I didn't care about the gender swap that much so long as the\nfilm would be a good watch. But it wasn't. it was a terrible, unfunny\nwaste of my time and every other poor soul who had the painful\nmisfortune of having to sit and bear witness to this god awful, inane,\ninept and pathetic excuse for entertainment. Not a single moment did\nthis wretched movie give me the tiniest iota of anything that would\nresemble pleasure. Not a single joke made me laugh, not for any second\ncould this film make me muster up a single emotion other than pure\nanger and disgust, I didn't care about any of the main characters and\nwas so detached from them that if all 4 characters died horribly in the\nfilm I would have less of an emotion than I do when I flush my\nexcrement down the toilet. Further-more just to give you an idea of how\ncomprehensively bored i was, I found myself looking at my watch at a\npoint in the film hoping it would be nearing it's end only to find that\nthe film was only 30 minutes into it's running time. I abhor, despise,\nloathe and resent this movie and plea to anyone reading this to avoid\nthis movie like the plague that it is. In fact I retract that statement\nas frankly comparing this film to the plague would be an insult to the\nplague as it has far more reason to exist than this film does.\n"},
{"review": "\nThis movie was simply dreadful. I don't understand how it got funded\nbut the studio is paying for their casting mistakes with a\nmulti-million dollar loss. I wouldn't expect an allstar cast in a\nremake, but damn these B-listers had no chance to make this the success\nthe prior version was. Definitely skip this or grab the torrent of it\nif you want to torture yourself :-)_____This movie was simply dreadful.\nI don't understand how it got funded but the studio is paying for their\ncasting mistakes with a multi-million dollar loss. I wouldn't expect an\nallstar cast in a remake, but damn these B-listers had no chance to\nmake this the success the prior version was. Definitely skip this or\ngrab the torrent of it if you want to torture yourself :-)\n"},
{"review": "\nGo back and watch the original Ghostbusters. It's great - but it's a\nbit of a mess. The humour is patchy, the story all over the place. Rick\nMoranis is annoying in every scene he appears in. Worst of all, the\npacing is way off.<br><br>Of course, there's Bill Murray. Lots of Bill Murray. Really - he's the\nonly funny thing about the original.<br><br>This new take on Ghostbusters suffers from some of the same problems,\nbut you can't fault the performances of any of the leads. And the\nlaughs? They're there from the start and throughout. There are genuine\nlaugh out loud moments. There are also some really kick-ass action\nscenes too which are, honestly, much better than the original. Of\ncourse they are - they have 2016 special effects.<br><br>And it's respectful of its source too. If anything, the movie pays\nhomage a little too much to the original.<br><br>If you are evolved enough to not feel threatened or emasculated by the\nidea of a female Ghostbusters, you'll probably have a lot of fun\nwatching this movie. Which is the whole point...\n"},
{"review": "\nI went into the movie prepared to not like it because I had heard some\nbad reviews (these reviews didn't actually have anything to say about\nthe movie but that it was bad). I've got to say that I smiled\nthroughout the entire movie and I don't think there was a person in the\ntheater who wasn't thoroughly enjoying themselves. I saw the movie with\n4 other people and we all loved it so much. It's the only movie within\nmy memory that I've wanted to see in theaters more than once.<br><br>I really appreciated that the female characters were strong and smart\nand even though they'd had disagreements they weren't petty about them.\nThey acted like real people. And they were funny without being really\noffensive, which some people find hard for some reason? <br><br>I think this movie has good role models for young girls and boys; there\nare 3 women scientists and a history nerd who aren't \"sexed up\" for the\nmale gaze. They are belittled and ridiculed for their beliefs but they\novercome that to do the right thing, not to prove themselves to anyone.\nAnd they're really cool while doing it, too.<br><br>The special effects feels real but not too real in a good way. I guess\nto say that they're not painful to watch (as an animation student I get\nvery upset over bad effects) but there is a cheesiness to them that is\nendearing. <br><br>I think this movie is something that anyone can enjoy as long as they\ndon't mind women being treated like human beings instead of sexy prizes\n(which is a joke that they play off of using a Hot Dumb Male character,\nbut in the end he's treated like a person and is no one's \"prize\").\n"},
{"review": "\nIf you (like me) consider Bill Murray humor more cynical than funny\nthen stop reading and go to see this very well done re-make that really\nimproves a lot on the original. <br><br>If you are not still convinced; let me tell you why. The original\nGHOSTBUSTERS was about 3 misfit nerds, an African American guy and a\ngirl (the love interest). Only the girl and one of guys has a lot to do\nin the movie; the rest of characters were heavily underwritten\n(specially the black guy).<br><br>In this remake; there are three nerds (women), an African American\n(woman) and a love interest (guy, cute but not smart at all). But this\ntime, screen time is shared, everybody has a few fun time (even the\nstupid guy) and the African American girl is lots more better written\nthan the blonde one.<br><br>This is obvious a McCarthy and Wiig movie; however Paul Feig (the\ndirector) let the others two shine and the chemistry between the four\nwomen works even better than the original.<br><br>In terms of jokes; there is lot of slapstick; some women/men sexual\njokes and even sum digital FX jokes that make the kids laugh. All that\nis far more than you can tell about the original that if you see it\nagain now; you will find it kind of boring and not that entertaining\nthan this one (I just did before seen this one).<br><br>Forget the classic; contrary to even my expectations; this one came out\nquite right\n"},
{"review": "\nI saw this movie the day it came out, and I, my boyfriend, and all\nhundred or so people in the movie theater laughed our asses off for the\nwhole movie, credit bonuses and all. Kate McKinnon is a treasure, and\nthe entire cast was phenomenal. There wasn't a single dud joke in the\nentire film. This movie is a wickedly good time, and I fully intend to\nsee it again in theaters. <br><br>To the men (and it is almost entirely men) who have been complaining\nabout this movie for one reason or another for months before its\nrelease, I'd just like to say: the franchise isn't ruined. Women can be\ncomedy action stars, and be them insanely well. Don't believe me? WATCH\nTHE DAMN MOVIE. And seriously, if you think one movie with an\nall-female primary cast is a death knell for the genre, you should know\nthat for us women, this is the most refreshing change of scenery we've\nhad in decades, with 85% of top-grossing movies featuring male\nprotagonists. So go ahead: buy an absurdly large pickup truck. Carry\nboulders up a mountain. Drink 30 beers at once, whatever it takes to\npiece back together your fragile masculinity, because guess what? This\nis a thing now. Women make up 51% of the world's population and 52% of\nthe movie-going audience. We contributed a full 50% of the total box\noffice revenue in 2014. And we like stuff other than rom-coms (no\ndisrespect to rom-coms).<br><br>Deal with it.\n"},
{"review": "\nI never found the original 1984 Ghostbusters all that funny --\nespecially Bill Murray's quirky shtick. I went to the sequel out of\ncuriosity to see what happens when the roles are swapped. Would the\nwhole thing just be a gimmick?<br><br>I was delighted to find nonstop laughter from a far more energetic and\nfast-paced sequel from the original --propelled by a clever script and\ngreat comedy acting. It's hard to go wrong when you have the wacky\nantics of Melissa McCarthy in the mix. And, SNL's Kate McKinnon plays a\nwonderfully amusing geeky and slightly maniacal scientist that just\nkeep you giggling. Also, nice to see the Thor hulk, Chris Emsworth,\nplay a Monty Python-like silly character in his role as office\nsecretary. The flirtatious play between him and the ladies is lots of\nfun.<br><br>I was also glad to seen the film pay homage to the storyline and style\nof the first film. However, having the predictably gratuitous cameos by\nsome of the original cast didn't add to the laugh momentum at all. <br><br>Despite the negative reviews I certainly would not consider anything in\nthe film tokenism or sexist. Are people so thin-skinned about what they\nperceive these days as \"politically correct?\" This film would not have\nbeen nearly as engaging with an all-male cast. It would have been just\nanother boring sequel that would have invited endless comparisons to\nthe original actors.<br><br>About halfway through the film the tight-paced hilarity throttles back\nfor the predictable huge battle with an army of ghosts. These\ninevitable climatic special effects orgasms get tiring. <br><br>This is by far one of the most entertaining and funniest films I've\nseen in a very long time. I'm delighted that they seem to have left the\ndoor open for a sequel.\n"},
{"review": "\nThe chemistry between this four really funny women is the coolest thing\nthe movie has to offer, just like the original did with its cast. The\nladies play to their comedic strengths with characters that sort of\nreflect their personalities and there are several laugh out loud\nmoments. The plot was okay, not worse but also not better when compared\nto the original. The exaggerated visual effects that are very\ncharacteristic to the franchise were well placed, just like the\nappearances of original cast members. It's not the best movie of the\nyear, but then again neither were the originals when they were\nreleased. Even though some people say they don't see the point of this\nmovie being remade, specially with women, I really hope the trend of\nremaking the classics with a female cast continues because little girls\ndeserve to have characters they can look up to that is a reflection of\nthemselves, just like little boys have been for so long. And for the\nlove of god stop whining and trying to find reasons not to like it.\nJust embrace the awesomeness that are funny women.\n"},
{"review": "\nTo keep things short and sweet: the movie was entertaining, funny, and\na good way to spend a night out. It's not the worst thing to hit\ntheaters in years, despite what the reviewers on here seem to think.\nAnd of course it's not the best thing, either. But was the first\nGhostbusters some sort of cinematic masterpiece that no comedy film\nwill ever live up to? No. It was an entertaining comedy film- nothing\nmore, nothing less. Just like this one. If the sequel didn't ruin\nthings for you, the remake won't either. I promise. I know people are\nupset that the movie has been recast and redone for 2016, and I feel a\nlot of that has to do with the fact that it's an all woman recast\n(because let's be real). But all the original (living) cast members\nshowed up to make cameos, which I'm sure they wouldn't have bothered\nwith if they didn't think the movie would be good. So please, go see\nthe movie for yourself before making any snap decisions about how awful\nyou think it is. I promise, it's nowhere near as awful as the online\nreviews make it look!!\n"},
{"review": "\nGB84 and GB89 were my first favorite movies, and I could quote them\nextensively before I turned 10 years old. I am in the prime demographic\nto feel \"betrayed\" by a reboot, but I adored this movie. Paul Feig and\nKatie Dippold have written for two of the shows closest to my heart\n(Freaks &amp; Geeks, Parks &amp; Recreation), so it makes sense that they would\nace this seemingly impossible challenge: Make a film that both honors\nand respects the original, but is also fun and original in its own\nright. The homages - cameos, quotes, similar scenes - are an absolute\njoy for their nostalgia AND imaginative reinvention; this is a film\nthat only a die-hard fan could make. Like its source, it expertly\nblends silly, scary, and the genuine triumph of four friends bringing\nout the best in each other to save the best city on earth. The leads\nare terrific, they have their own wonderfully weird humor and rhythm,\nwith only superficial similarities to the characters who came before.\nThis film clearly exists not to replace the original, but to celebrate\nit and bring something new to the universe. Well-freakin-done, you\nguys! I have the 80's cartoon action figures, the film figures that\n(finally) came out in the 2000's, and I will proudly display Abby,\nErin, Jillian, and Patty beside them!\n"},
{"review": "\nThis film doesn't take itself too seriously or follow the original in\nany serious way, but is instead a beautifully funny homage to the\noriginal that is done SO well. I really can't see how anyone coming out\nof this movie could have anything bad to say about it.<br><br>OK if I think about mainstream taste versus alternative taste perhaps\nthis film was just too happy and tongue in cheek for the general\npopulous. It's not even a remake, it's more of an addition to the\nseries and it's so humorous. The effects are awesome and colourful like\njoy in a can and the changes are crazy. The only other reasons I can\nsee for not liking this movie is an expectation of seeing the original\nredone in the exact same way with new effects.<br><br>That or some people can't stand to see the jarring difference of women\nactually playing great roles for a change. Which while I'm on it, I do\nenjoy the recent bouts of chick comedies so maybe that explains why I\ngot the humour. I love it. Balls to the wall crazy.<br><br>I will admit there were a couple moments that missed the beat for me\nfor a moment, basically when things had to get serious for a moment and\nI didn't want to stop laughing or when they had to stick to a moment\nfrom the original film and not play it for laughs. But those moments\nwere rare and very soon put back on track.<br><br>One other thought is that I don't like most remakes of late, so if you\ndo like remakes maybe this is the wrong kind of remake for you. Rather\nthan making everything darker and more serious as most become, it does\nthe complete opposite. Don't see it as a remake or reboot, but a lot of\nfun. Also yes the villain is a bit scooby doo but I can let that go.\n"},
{"review": "\nAfter hearing nothing but that the movie had bad reviews, I decided to\nlook up these reviews I was hearing so much about. I surprised to note\nthat almost every bad review included something about gender (which\nreally shouldn't be a factor in movie-going experience). So, I decided\nto go see the movie, ready for it to suck. I was astonished to find\nmyself laughing throughout the movie! Not only were each of the leads\nwell thought out and well rounded, they were all genuinely delightful.\nThis may not be the best comedy of all time, but it is certainly the\nbest movie I've seen in recent years. I highly suggest going to see\nthis movie. Not only to prove our society has moved past the 1940s, but\nalso because it is truly hilarious and action packed.<br><br>Admittedly, two or three jokes are woman specific, but it is much\nfriendlier to both genders than the original Ghostbusters movies. The\nmale characters in the movie are also well rounded and genuinely funny\nas well. Seriously, go see this movie. You'll be gasping in fright\nmoments before you are rolling out of your seat in laughter. It was\nhonestly excellent.\n"},
{"review": "\nNot all the jokes land, but I laughed out loud and the end CGI is\nfantastic. There's some terrific call backs to the original including\ncameos. I saw it in a crowded theater and people were cheering and\nlaughing, especially during the climax. So, open your mind and heart\nand go see it if you are so inclined, and take a kid who is interested\nin STEM, too. Kate McKinnon is the standout as the group's \"M\" who\ninvents their equipment and handles the ridiculous science babble with\nease. Leslie Jones takes a character that could have been a stereotype\nand makes her a funny type with layers. Liam Hemsworth has a lot to do\nas the dim-bulb receptionist, and he handles physical comedy really,\nreally well along side four women who have made their careers doing so.\nSome of the humor is deeply, deeply weird - including an extended\nhomage to Patrick Swayze's career - and I appreciate a movie this big\nwilling to go that strange.\n"},
{"review": "\nI'm not a fan of awkward comedies. I HATE most romcoms because of\nstupid miscommunication being the only thing that seems to launch the\nstory forward. There's an awkward factor in Ghostbusters, but it works\nso well as to be enjoyable. The special effects are solid too, and\ncrisp even in faster paced 3D shots. There's a teasing of some 4th wall\nbreaking that is just so well timed and you can see the synergy and\nchemistry between the cast. <br><br>I'm terrified of crowds, and often avoid a trip to the movie theater\nunless I just feel like I need to go. I'm glad I braved the crowds, and\nI plan to do so again - this movie was AMAZING and a part of me is sad\nto see it getting panned by a lot of folks.<br><br>It doesn't replace the original, and it's not less just because of some\ngender-bending, but it's damned entertaining, and visually appealing. I\nrecommend it in 3D if you can watch it that way, but I'm going to see\nit a second time in 2D so I'll either update this review or reply to it\nafterward.\n"},
{"review": "\nYou can enjoy bad movies (Manos, Plan 9). You can enjoy good movies\n(too many to mention).<br><br>But one thing a movie cannot ever be is boring. That never works for\nanyone.<br><br>This movie is a major bore. Nothing interesting happens (that you\nhaven't seen before, with way funnier actors). It's a Ghostbusters\nrehash, with far worse acting. That's it.<br><br>The leads have NO chemistry whatsoever. The original Ghostbuster actors\nwere a team inside and outside the set, and it showed. These actors\nhave nothing going for them.<br><br>Dialog is boring, acting is boring, everything, everything is boring.\nIt's just a waste of time.<br><br>It could have been bad, and it would have been a better movie than\nthis.<br><br>Don't even download it from somewhere. It's honestly not worth's\nanybody's time.\n"},
{"review": "\nThe DVD went on sale today in the UK, and I picked it up because I\nwasn't able to see it at the cinema. Myself, husband and 21 yr old son\nwatched it after dinner...<br><br>I should probably say that we have the two original films, which have\nbeen watched over and over again.<br><br>I wasn't sure about the film to start with - perhaps it was the\nbrashness of Abigail and weirdness of Jillian, slightly unusual types\nover here - but we always make a point of watching films to the end\n(even the atrocious Independence Day: Resurgence...) And as the action\nprogressed we all found ourselves thoroughly enjoying it.<br><br>No, it's not a great film, but then, neither were the originals. It\nfollowed the format of the first original enough to feel familiar, with\nenough differences to make us chuckle. We loved that the women were\nwonderfully ORDINARY (as in not skinny model types but women all women\ncan relate to: makes a hell of a change!), and it was great to see\nHemsworth in such a funny role! (Such a change from Thor...) We loved\nthe homages to the original characters too - it's a pity Rick Moranis\ndidn't want a cameo, as I'd have loved to see him in it.<br><br>Overall, just great fun. A terrific way to end a horribly wet, stormy\nMonday, and we will enjoy watching it again to pick up on all the\nlittle details we missed first time around.<br><br>We really, REALLY hope there's a sequel or two.\n"},
{"review": "\nI decided to see this film -- especially after seeing the plethora of\nridiculous misogynistic comments about it online from the hordes of\nlosers and trolls.<br><br>I certainly *wasn't* disappointed. It was a good movie with cool\nspecial effects and great humor. By the end, I personally considered it\na comedy film.<br><br>My favorite actress was Leslie Jones. A great comedienne throughout.\nHer best line was in the scene with all the frozen dancing policemen\nstanding in the square, when she said, \"Why y'all doin' 'nat?\"<br><br>Anyway, if you're an angry misogynist, then you can just stick to your\nbeloved little feel-good videos on YouTube and waste your boring life\naway. If you're not one of those, then you should watch this\nGhostbusters reboot, and will probably enjoy it.\n"},
{"review": "\nMovie was great, and in no way deserved the low rating it has. <br><br>Having read some of the other comments here, and seeing claims of\n\"reverse sexism\" and the like, I've come to the sad realization that\nseveral of the people rating this low (about 50% of the bad reviews I\nread) did so for prejudicial reasons.<br><br>To the 50% of low raters that did so for prejudicial reasons,\nespecially those who made claims of \"reverse sexism,\" I wish you would\nhave some shame and some respect. Though you may feel powerless against\nwhat you believe is an unfair PC culture, your bias does have a\nprofound impact on those around you. Small things like this add up, and\ncontinue to hurt your female counterparts.<br><br>Please don't be that guy. Readers, please stand up for the women in\nyour life. Please argue against those who make claims of \"reverse\nsexism\". And, because life isn't all spent online, consider donating to\na women's right's group to make a real impact on the real women around\nyou.\n"},
{"review": "\nI don't understand the negative reviews. Granted that comedy is\nsubjective, but.<br><br>Yeah, it is kind of silly. It is not Shakespeare. But as light-hearted\nentertainment, I thought it was definitely among the best I've seen.<br><br>...some idiot is \"reviewing reviews\", and claims that positive reviews\nare by people with new accounts here. I have been posting and rating\nmovies at IMDb for nearly 18 years. And I say, if you liked the\noriginal 1984 Ghostbusters, you will probably like this. You might even\nprefer it to the original.<br><br>All four of the lead ladies are pretty excellent, but McKinnon's\nwackiness is the best, IMO.\n"},
{"review": "\nMaybe I'm just a young adult who knows nothing about anything, But I\nreally enjoyed the new ghostbusters. I did actually see the old\nghostbusters one or two times but I always thought it was kind of lame.\nI think the main character had a bad attitude and it wasn't very funny.\nIt's a cult movie but not my cup of tea. ¨<br><br>I had super low expectations on the new ghostbusters but I watch it\nanyways and I thought it was funny, with an okey story and good acting.\nAt least for an American comedy. I don't think American comedy have\nhigh value but If I had to choose I definitely think this is one of the\ngood ones. Please give me a legit reason to why this is worse because I\nsimply don't see it.\n"},
{"review": "\nI have never written a review before but I really felt this film\ndeserved it after all the bad press I read about it. Its nearly 5\nmonths since the film came out and I deliberately steered clear of\nwatching because of the bad reviews it got. The all female leads were\nvery good. Great jokes and references to the original film with the\nactors themselves popping up. The acting was very good from everyone\nand I loved how Chris Hemsworth was the dumb blonde. All in all a great\nfilm to relax and unwind to. I really enjoyed it and would watch it\nagain. It had some great laugh out loud moments as well. I would\nrecommend watching it if ya fancy a good comedy with four great\ncomedians. I love Kate Mckinnon and she does a really great job in her\nfirst movie (i think it is anyway). If you like any of Melissa Mccarthy\nfilms then you will enjoy this film.\n"},
{"review": "\nIn addition to laughing, the film has plenty of visual beauty Making it\nmore visible in visual effects. with pleasure It was a repeat film to\nbe watched. With Kate McKinnon's Sweetheart A Funny Movie That\nDecorates.<br><br>Parapsychologists Peter Venkman, Raymond Stantz, and Egon Spengler are\ncalled to the New York Public Library to investigate recent paranormal\nactivity. They encounter the ghost of a librarian, who haunted a\nlibrarian named Alice but are frightened away when she shape shifts\ninto a horrifying monster. After losing their jobs at Columbia\nUniversity, the trio establish a paranormal investigation and\nelimination service known as \"Ghostbusters\". They develop high-tech\nequipment capable of capturing ghosts and open their business in a\ndisused, run-down firehouse. Egon warns them never to cross the energy\nstreams of their proton pack weapons, as this could cause a\ncatastrophic explosion. They capture their first ghost, Slimer, at a\nhotel and deposit it in a specially built containment unit in the\nfirehouse basement. As paranormal activity increases in New York City,\nthey hire a fourth member, Winston Zeddemore, to cope with demand.\n"},
{"review": "\nThese chicks killed it! I loved this movie I have watched it 6 times\nnow and I will keep watching it and yes I am a straight dude. I know\nsome people are like Leslie was playing too stereotypical of a black\nperson but I didn't think so, and I thought she was great and a scene\nstealer. She played a smart, brave character who goes all in. I\nbelieved these chicks were smart too and also, that blond she made me\nlaugh so hard I am not kidding my 40 came out my nose! (no but really)\nI kind of like the reds and greens they used too to decorate the sets\nand stuff, it just had a bright and warm kind of style I liked a lot. I\nthought the whole thing was good and now I am going to watch Freaks and\nGeeks because I think I will like that too. I might even start watching\nSNL just to get more of Kate because she is hilarious not to mention\nLeslie is the best.\n"},
{"review": "\nDon't believe the other reviews users are doing! I watched this movie\nwith the rest of my family and enjoyed it a lot! It had great special\neffects, action, and comedy.<br><br>Chris Hemsworth,Jillian Holtzmann, Kristen Wiig, Leslie Jones, and\nMelissa McCarthy sold the movie with their comedy! The script was\nbrilliant and creative. I never find myself thinking about what I would\ndo when after the finish the movie. This movie always wanted me to keep\nwatching 'til the credits were over, to see that rare clip at the end\nof some credits!<br><br>People are hating on this movie for Feminism and that the movie is\nmaking it seem like women are better than men when the movie isn't\ntrying to. The movie is just for entertainment and shouldn't be taken\nas a serious action film. It is supposed to be fun and awesome and it\nis! I don't see why the need to give this movie such terrible reviews.\nIt deserves better!\n"},
{"review": "\nMerriment prevails for those who were fans of the original and new\nfans. Melissa and her crew are fantastic. The cameos are superb. This\nis a fun movie I will watch when I want to laugh. Pays just enough\nhomage to the original--yet has its own theme and stands alone. Great\nJob! By all Leslie Jones expresses a perfect balance of smart, funny,\nand streetwise. Kristen Wiig plays against type like a genius. I know\nthis is not the funniest film ever made, however in my opinion it is\nclose. When a film makes me, belly laugh I am in love for life! There\nis a treat hiding around every corner. Not one cast member is out of\ntheir element. Bravo! Thank you for creating a fun, delightful, and\ncharismatic film that will be watched in my home time and time again.\nEveryone can use a good laugh right now!\n"},
{"review": "\nSo I will admit. I did not give this movie a shot when I saw that they\nwere making it. I am old school Ghostbusters. I had to buy a new copy\ndue to over use I watched them so much. So I was not a fan of the\ngender bender wanna be.<br><br>Then a coworker of mine bashed it something horrible. Calling it\nagainst men and such. So of course I check it out...and finally watch\nthe preview. Surprised! I laughed quite a bit. So OK. I'll rent it. My\nhopes are up now. <br><br>My viewing experience was worth every star. I was engaged and laughing.\nI am very happy I got over myself. I didn't listen to the nay Sayers\nand the people who quite honestly take themselves too seriously.\nNo...this is not Ghostbusters 3...probably why they didn't give it that\ntitle. This is its own movie. Very funny and awesome. The ghosts were\nvisually intriguing. The humor was on point. I found myself really\nenjoying myself. Even my fiancé was laughing. <br><br>Definitely give this film a shot. Don't listen to the haters. Remember,\nlet this film stand on its own feet and not the shoulders of the\nprevious two.\n"},
{"review": "\nMy kids liked it including my 9 year old who is scared of everything. I\nwas a little sad it was a remake in place of a continuation of the\noriginals. Has some good laughs and mostly clean for younger kids. I\nlike that the original cast took part in the movie. Slimer and his lady\nfriend was well done. I think they picked a pretty good cast on this\none it was cool to have a girl remake for my daughter who loved it.\nKids will appreciate this movie probably not all adults. Special\neffects were pretty cool and my kids loved that they did the state puff\nman in this movie like in the originals. I think if you go into this\nmovie with an open mind you will find it is cute and pretty funny over\nall.\n"},
{"review": "\nI am having a hard time figuring out why people are so negative about\nthis movie. I read reviews calling it the worst reboot of all time. Why\nare people such dicks? I loved this movie, I have watched it several\ntimes, I love when they are killing ghosts at the end, so awesome. I\nlove the song after the movie is over, love the jokes, the cameos, and\nthe 4 main actresses. People act like this is that Teenage Mutant Ninja\nTurtles movie, man that was terrible. Even the last James Bond film put\nme to sleep. This held my attention and I always love watching it.\nMaybe people should try that one awful Amy Schumer movie, I couldn't\nget through 5 minutes of that without wanting to tear my eyes out. <br><br>Look, I don't go to Chinatown, I don't drive wackos, and I ain't afraid\nof no ghosts.\n"},
{"review": "\nloved it! the cast was great, melissa &amp; kristen were funny as always.\neven though i'm not too familiar w leslie and kate, i certainly wish i\nwas after seeing this. <br><br>it was really, really refreshing to see women portrayed on screen as\ncharacters who were relatable, and who were free to be their own\ncharacters instead of having men define them, which is unfortunately a\nsnag in most mainstream films. <br><br>a criticism i've seen is that its portrayal of men is 'offensive'\nwhich, in my onion, is completely false. most of the men are portrayed\nas somewhat unfavorable, but what critics of this film don't understand\nis that women are almost always portrayed offensively in films. our\nculture is just too numbed by misogyny for it to be seen as anything\nbut normal. hopefully ghostbusters will help with changing the way\nwomen are portrayed on screen.<br><br>also, the shot of holtzmann licking her gun is more meaningful and\niconic that anything men have contributed to cinema ever. ¯\\_(ツ)_/¯\n"},
{"review": "\nI really enjoyed this. The cast was incredible. The four leads are\ngreat. (Kate McKinnon is one of the funniest people on earth.) But\nevery supporting cast member was also great. It reminded me of the\noriginal Muppet movies, where around every corner was a quality cameo.\nIt was full of great nods to the original and did a great job of being\nit's own thing. It's a great film for the whole family. It was fun and\nthat's what a movie like this should be.<br><br>Side Note: In reading some of the other reviews, there's clearly a\ntroll brigade on the loose. The idea that movie is \"anti man\" is\nridiculous. The tiny-minded worms that are pushing that agenda are a\nsad excuse for men. Anyone that is threatened by other people's\nsuccesses, should probably spend a little more time figuring out why\ntheir life isn't going the way they had hoped and less time trying to\npin that failure on others.\n"},
{"review": "\nThis is such a funny, spooky, action-packed, well-acted movie. Except\nfor one scene I enjoyed every little bit of it. It pays homage to the\noriginal but doesn't rely on it. Though the cameos are adorable.<br><br>Besides ghost, the main theme to me is feeling under-appreciated and\ndiscouraged when the world can't or won't acknowledge your talents and\nskills and knowledge. Which is something most of people can relate to.<br><br>And it is also about friendship. The four women are very different but\nthey just fit. And then there is Kevin. The acting is on spot. Every\nsecond.<br><br>I liked all the references. There is a lot of amusing lines and several\ngenuinely funny jokes. Without the need to tear anyone down.<br><br>I also liked the villain. Unappriciated man healing his ego by\ndestroying the world. I enjoyed myself immensely. And I really hope\nthere is a second one.\n"},
{"review": "\nI was checking on the cast on Google, and saw the low rating this movie\nhas on IMDb. I ~loved~ this movie so I came to rate it--and the first\nthing I see is a review of the other reviews, pointing out the people\nloving the movie had never reviewed here before.<br><br>So I made an account. Yes, I've never reviewed here before. I'm not\nmuch for reviewing movies. But I feel this movie has gotten a bad rap,\nand it makes me angry.<br><br>I'm not an analyze-the-movie kind of girl. I want to enjoy movies. I\nenjoyed this one A TON. The first Ghostbusters was the first movie my\nbrother bought when he bought our family our first VCR. I feel this\nmovie does a fantastic and fun job of rebooting a beloved franchise.<br><br>This movie made me laugh, and gasp and jump. At times I was stomping my\nfeet on the theater floor (quietly!) I was enjoying it so much.<br><br>Great characters, fun dialogue, awesome fights, and Chris Hemsworth as\nthe ditziest of blonds...what more could you want?<br><br>And Holtzmann. Omg, Holtzmann...\n"},
{"review": "\nDon't listen to the trolls. This was a great re-make of the original\nclassic.<br><br>The leading ladies did a great job and introduced their own\npersonalities to the parts.<br><br>The story includes some interesting backstory of the character's\nhistory and how they met. The added details make the characters more\ninteresting. <br><br>Kate did a fantastic job with the \"mad scientist\" role. <br><br>The cameos by some familiar faces was an added bonus. But it would've\nbeen nice for Slimer to have a bigger role. Hopefully they will do that\nin a sequel. <br><br>Overall the movie was funny and entertaining. Would definitely\nrecommend it.\n"},
{"review": "\nThis was awesome! Much better than the previous ones! It definitely<br><br>paid tribute to the originals...better, girls instead of guys,<br><br>everything that made the original famous, only brought to us through<br><br>cooler special effects! This movie is like taking something old that\nyou really like and care about and renew it so it looks prettier and<br><br>lasts longer...without destroying those elements that make it special<br><br>and that you respect so much! I loved 'Ghostbusters' as a kid and\nthat's<br><br>why I wanted to see the new one and it totally did not disappoint me!<br><br>The movie lasts almost two hours, but with good use. Everyone from <br><br>the originals have appearances...I'm a fan of Bill Murray's so I was<br><br>happy to see him there too. The movie was dedicated to Harold <br><br>Ramis. All in all, to be watched, good time guaranteed!\n"},
{"review": "\nFirst I need to say that I watched the EXTENDED Blu-ray cut of the\nfilm. I can imagine the theatre version being worse off for leaving out\nstuff, but can't offer a direct comparison. I'll just say that the\nextended cut was very good and did not feel sluggish at any point.<br><br>Honestly, there's no way to objectively call this a bad movie. It is\nfunny, well paced and shot, and has excellent tone. My 26-year old self\nfound it a very pleasant surprise; a good time, funny and well acted.\nAnd yes, of course I know the original movies, too.<br><br>Aside from the people who clearly have a problem with women being cast\nas actual regular human beings in lead roles, it is my firm belief that\nmost of the haters of this movie are Gen-X'ers simply unable to get off\ntheir collective high horse. If you try to, for whatever reason,\ncompare this piece to the original movies, then something's already\ngone wrong with you. There is absolutely no reason to do so. It is not\na remake. It is a reboot in its own right, in the year 2016, and does\nvery well for itself. There are a lot of respectful nods towards the\nearlier movies, all of which I found fitting and in good taste.<br><br>If you are of the opinion that the original movies are the holy grail\nof comedy filmmaking, and are unable to check your attitude and\npreconceptions at the door when watching this movie, then just don't\nbother. All you'll be doing is looking for reasons not to like this\nflick, end up miserable and then pollute the opinion pool for those of\nus who can see a movie for what it is.\n"},
{"review": "\nMelissa McCarthy, Ben Harris, Charles Dance, Ed Begley Junior, Erin\nGilbert, John Milhiser, Karan Soni, Kate McKinnon, Kate McKinnon, Steve\nHiggins Were absolutely GREAT. Chris Hemsworth, ehh, He is trying to\nappear funny. Like he has never laughed in his life before or hasn't\nmade anyone. In the whole movie he acts like a child who has lost his\nchildhood. He may be a great actor but in GhostBusters nahh. If meeting\nhim in real life i bet he would be a big jerk. The Movie overall Is\ngreat, it has the vintage parts the old movie had, Higgins is VERY\nfunny and is great in his role in the movie.I recommend you all see the\nmovie and please see that Chris Hemsworth thing i am talking about.\n"},
{"review": "\nDespite all the nonsense hate Ghostbusters has received it's actually a\nfunny and entertaining film that honours its predecessor while\nmaintaining it's own direction. <br><br>I grew up in the 80s, I loved Ghostbusters (and to a lesser extent\nGhostbusters 2). I watched The Real Ghostbusters cartoon and owned\nGhostbusters books and clothing. I think Ghostbusters 2016 is a great\naddition to the Ghostbusters universe.<br><br>I think if it hadn't received so much hate prior and during release its\nIMDb rating would be sitting between a 7 and 8 (complete conjecture,\nyes).<br><br>Watch it!\n"},
{"review": "\nI was skeptical when I first heard about this film. The original\nGhostbusters is one of my favorite films and I even had the pleasure of\nworking with Ernie Hudson on a film a few years ago. Still, the videos\nI saw of this film prior to it's release made me curious enough to go\nsee it. I particularly liked that Kate McKinnon's character (Holtzman)\nslightly resembled the cartoon-version of Egon Spangler.<br><br>The laughs are there though the comedy might not be everyone's cup of\ntea. I thought all four of the leading ladies were wonderfully cast and\ndid great at being four separate personalities that make one great\nteam. I was never a Melissa McCarthy fan but I thought her performance\nwas just wonderful and fun to watch.<br><br>I also enjoyed every single nod they made to the original film. I liked\nthat the film was about four weird/geeky women who were absolutely not\nsexualized characters. That's a breath of fresh air! If people want to\nthrow the term \"sexist\" around than this film isn't anymore sexist\ntowards men then the original was towards women.<br><br>I feel like I gained another Ghostbusters movie! I don't feel like\npeople should take it seriously. You weren't supposed to take the\noriginal seriously either! It's a movie that you can sit down, eat some\npopcorn to, and just have fun watching!\n"},
{"review": "\nFrom the start the movie had an easy transition into the characters.\nThey didn't have a full background on them, but you wouldn't feel lost\nconnecting to them. Each character had their specific way and\nattraction. <br><br>I was quite surprised how much the movie achieved in such a short time.\nThe initial beginning didn't feel too long or short, the detective work\nand mystery didn't feel boring, as well as time with characters as well\nas connection with them didn't feel too much or too little.<br><br>Their catastrophe and battle with the villain was perfect amount,\nespecially for comedy. All in all the movie was great.<br><br>The downsides to this movie: In my opinion, I think this movie followed\nsimilar publicity as the reintroduction of Star Wars. In case of both\nmovies, their inherit very popular titles from previous generation.\nThis already sets a mood and expectation for the audience. <br><br>Unlike the new Star Wars (total copy and paste from my view),\nGhostbusters went a different way from their original series. The\noriginal was intended a cross between a family movie and horror movie\n(which was very inventive). Ghostbusters is mainly targeted, or\nsupposed to target people aged between 15-35 (I imagine this is why\ntheir sales expectations did not match up). <br><br>All summed up, the movie is really good, but don't expect it to be\nGhostbusters reborn, this is something very different. I think if we\nget a sequel, then we can expect something similar to the original\nseries as plot, characters, and mood will all align.\n"},
{"review": "\nMisogynists hate women. Misogynists can not only be men, but also many\nwomen hate themselves and do not want women to succeed in the world\naway from family and traditional feminine expected roles. <br><br>Here is a group of women, spoilers to come, who are mostly well\neducated and interested in their profession and ideas of ridding the\ntown of the green ghostly apparitions. They are not interested in\nmeeting Mr. Right and settling down to a life of childbearing and\ntoilet cleaning.<br><br>Or are they? One wants to build a love story with the\nanti-stereotypical male receptionist who doesn't know his posterior\nfrom a ? Oh well, you get it. <br><br>So, the new Ghostbusters are women. The mayor chides them because he\nwants to do the job himself, but doesn't know how. Later, he is so\nthankful that these women went ahead and got rid of all the green\nslimers that he has them moved into the firehouse of their dreams.<br><br>Good to see Murray and Ayckroyd.<br><br>Ladies/girls should not be used in this film. They are women. You may\nhave heard of Wonder Girl. Did you ever hear of Wonder Lady? Ask Wonder\nWoman. She is tough, and wears special bracelets that pack a lethal\npunch. <br><br>10/10.\n"},
{"review": "\nI went in expecting this movie to be bad (thanks to all the negative\nreviews), I was afraid it was going to use a brand of humour that is\ntoo slapstick/ silly and that the script would really try to milk the\n'crazy idea' of the female leads cast. <br><br>However, being a fan of the originals I had to give it a go, and it's\ngreat! It has all the clever yet accessible wit of the original movies,\nbut has it's own modern style (and plenty of Easter eggs for\nGhostbuster fans to enjoy). <br><br>Despite all the controversy over the cast I thought they did an amazing\njob, the characters were well written and actors all portrayed their\nparts perfectly. The CG animation was great, as you would expect from\nany movie in 2016, and the plot was well developed - It had clear\nparallels to the original movie, but was different enough that you\ndidn't know what to expect and, unlike the original, it explained why\nthe ghosts appear more and more frequently throughout the movie. <br><br>If you loved the original Ghostbusters, or just funny Sci-Fi movies in\ngeneral, I highly recommend this movie.\n"},
{"review": "\nI laughed harder than I have in a long time watching this film. This\nmovie was fun, funny and wonderful. All the actors were amazing. Yes,\nthere were some flat jokes and some clichéd jokes but other than that?\nIt was great. I honestly cannot believe all the hate this movie has\ngotten over the fact that it's a group of women as the main actresses.\nI guess I don't understand the chest pounding over something as simple\nas a movie that takes NOTHING away from the original. And let's talk\nabout that for a moment, shall we? We've got Bill Murray, Dan Aykroyd &amp;\nErnie Hudson as characters in the movie. A movie which, original cast\nmember, Mr. Aykroyd co-wrote. So you HAVE the originals boosting and\nsupporting this film. So the haters need to pack it up and go home. The\nmovie had some of the best comedic timing I've seen in a long time.\nEveryone's character had a different flavor and brought something\ndifferent to the screen but allowed the characters to mesh with each\nother. I loved the designs of the movie and the design of the ghosts\nwas one of my favorite things. If you enjoy comedy, strong characters,\nand a fun movie? Check this out. Don't be swayed by people with nothing\nbetter to do with their lives than to tear a 2 hour film down because\nthey think their childhood is under attack.\n"},
{"review": "\nNot being a fan of movies like 'Bridesmaids' and the slapstick humor, I\ndidn't at all expect to like this movie. Then came all the negative\nreviews and sounds from social media about the reboot. Finally decided\nto watch this with my boyfriend and we both really liked it. The cast\nis really funny and apart from some snickering through out the movie,\nwe really laughed out loud a couple of times. <br><br>The movie came together really well for the nearly 2 hours that it\nlasts. The action, CGI, jokes and acting form a perfect action/comedy\nblockbuster, nothing more, nothing less. It's not meant to be 'new' or\n'iconic' like the original turned out to be, so if you do see this\nmovie, just enjoy it for what it is. In this case comparison is\ndefinitely the thief of joy.\n"},
{"review": "\nWhen I first saw the trailer of the movie I had a lot of mixed feelings\nabout it. Then there was a big online scandal with an extensive use of\nwords: feminism, sexism, misogyny and what not. So I was frustrated\nabout the movie before I even watched it. You know what I think about\nit after I watched it? Critics are not to be trusted!<br><br>Don't get me wrong here. If you are a die-hard fan of original\nGhostbusters and you are craving to see a remake, you kind of get\nconcerned when you realize that Ghostbusters are not even men anymore.\nBut then if you think about it, if the original movie was a 2016\nremake, it would get the same public response. So why is it not\nconcerning for people how women were portrayed in the original movie,\nbut so concerned about how 1 male character is portrayed in a new one? <br><br>This is not a \"metacritic score\". This is a METAHYPOCRISY score!<br><br>So let's just take all this sexist hypocrisy out of the way and look at\nthe movie with a new look.<br><br>Movie was great. I was super excited to hear the familiar soundtrack,\nfamiliar nerdy character to it. It was a real Ghostbusters movie all\nthe way. The cameos of original actors were a nice dessert. Let's face\nthe fact, it does not matter, if Chris Hemsworth character was \"not so\nclever\", you will love to see him having fun through the process all\nthe way. It's a positive movie in a character of original Ghostbusters,\nand as soon as you will be able to take away all this scandalous\nnonsense out of your head, you will see that.\n"},
{"review": "\nI went into this movie expecting some sort of mess. Reviews were not\nfantastic and the internet led me to believe that this was a rip-off of\nthe \"classic\" original, and was therefore trash. It absolutely is not.\nInstead, this tribute to the original does exactly the same thing as\nthe original: acts as a platform for some of the funniest actors in the\nworld.<br><br>Instead, this is a fabulous new take on the original story, created by\nand endorsed by the people who made and/or starred in the original.\nThis film is fun, entertaining, and funny. Just like the original, this\nfilm allows each of the cast members to make use of their full range of\ncomedic talents. <br><br>Just like the original, this film uses the best and brightest\ntechnology of the day to make mind-blowing ghosts appear on screen.\nBrilliantly. <br><br>I hope they make a sequel, then another sequel, then another sequel\nafter that.\n"},
{"review": "\nI don't know why people hate this movie, it has the original energy,\ngreat casts, story and great fun from the first movie. Hey Bill Murray\nwas in this movie and the other original casts! I find it sad that damn\ntrolls ruined my chances of watching a sequel from the 2016 movie! So\nf--k u you critics who wrote so many damning reviews! This is suppose\nto be a movie where you put your damn everyday mind to rest and just\nenjoy the absurdity that movies has to offer to you. I personally\nenjoyed this movie more than (yes) the new star wars movie and am now\nsad because of all these negative critics, never ever am going to see a\nsequel!!!!! So for all you damn i----ts who are hanging on to their\nchildhood obsession ( never growing up or upgrading), I say thank you\nfor f---ing up a really fantastic upgrade to a franchise that I will\nnever be able to see. So for all the dumb critics who gave this movie a\n1 star, grow up and see how life has progressed, and get your own\napartment, mama's getting sick of washing your laundry!\n"},
{"review": "\nI've been a member of this site for many years but this is the first\ntime I've written a review. I guess I didn't feel the need before, but\nI do this time to counter all of the negative reviews on here. I don't\nknow what that's about - I thought it was a great movie. I was a fan of\nthe original when it first came out, and this one held up very well\nnext to it. The plot development was continuous, the acting was fine,\nthe humor was there, the action was there. The cameos of the original\nplayers popped up at unexpected times. Dan Akroyd as executive producer\n- what's not to like? It paralleled the original in some ways, and\ndiverged from it in others. Nothing wrong with that at all. Now I want\nthe blu-ray set of all three movies (or is there going to be a fourth\nnext year?). <br><br>I don't get the fem-bashing of the 4 leads. They certainly hold their\nown in this movie. But I guess some people just have to do that, for\ntheir own reasons. In rating it, I had to think if I gave it a 9 or\nanything less, what would cause me to give it a downvote? I couldn't\nthink of anything. So 10 it is. I'll be watching this over and over\nonce I get the blu-ray. My only complaint is the woman next to me\ntaking a phone call in the middle of the movie - yes, I told here what\nto do with that. That turns me off to theaters so much.\n"},
{"review": "\nI'd heard some bad reviews of Ghostbusters 3 and having just re-watched\nthe first two, was prepared to be disappointed. What I wasn't prepared\nfor was how brilliant and slick this version was! It was a wonderful\ntribute to the original, but so so so much better in terms of story,\ncharacter building, special effects, jokes, music - everything. I had\nvery good memories of the original but having watched them close\ntogether, it's impressive to see how far cinema has come in 30 years.\nAnd Boo-hoo to all the men out there who didn't like seeing women in\nthe leading roles and to had to find out how it feels to be the butt of\na joke for a change - turns out you also get dumb male secretaries and\nsleazy female bosses too! Who knew? First film for a very long time\nwhere I've wanted to watch it again straight away after it finished.\n"},
{"review": "\nAfter reading some of the other reviews, I hesitated to add mine to the\nlist because it seems to swim in opposition to the current flow of\nNay-sayers.<br><br>OK\u0085I admit I was skeptical when I heard the announcement there was\ngoing to be a female version of \"Ghostbusters.\" I didn't like a couple\nof the actresses cast, and, having seen the original eight times, I\nthought nothing could top it\u0085so I went into this movie prepared to hate\nit...<br><br>...well, I was wrong\u0085 DON'T CROSS THE STREAMS\u0085in this movie, it's DON'T\nCROSS THE LEYLINES.<br><br>Dedicated to the late Harold Ramis, who appears outside Erin's office\nin the form of a sculptured bust, this movie is as good as the\noriginal, no doubt. There are plenty of verbal and visual references to\nthe original movie that many who haven't seen that one may not\nrecognize but those in the know will.<br><br>Setting up business above a Chinese restaurant this time, the female\nequivalent of the original ghostbusters again save New York City\u0097this\ntime Manhattan\u0097from spectral Armageddon with plenty of laughs and\nspecial effects. They are all excellent in their roles, with Chris\nHemsworth especially good as the hulky and hunky secretary.<br><br>As a certain old commercial once said, \"Try it...you might like it...\"\nin spite of what the negative critiques say.\n"},
{"review": "\nDid this movie re-invent the wheel? No. But neither are 90% of the\nother movies coming out this year.<br><br>Ghostbusters managed to pay homage to the original movie while creating\nsomething fresh and exciting. Kristin Wiig, Leslie Jones, Kate\nMcKinnon, and Melissa McCarthy do an absolutely fantastic job picking\nup the mantle of Ghostbusters. The entire cast of characters are well\ndeveloped beings, and I mean, Zach Woods anyone? How can you rail\nagainst a movie with Zach Woods opening it like that?<br><br>I'm thrilled that I was able to see this movie in theatres, and I'll be\nbuying it when it comes out. At least give it the benefit of the doubt\nbefore outright dismissing it.\n"},
{"review": "\nI loved the original movies. They were so funny and quirky! When I saw\nthe cast for the new version of Ghostbusters I had BIG expectations,\nbecause these are some funny people, and I was not disappointed! The\nmovie has the same feel as the original ones, but with an updated story\nand with lots of cameos! And it's so funny, I laughed out loud a lot!\nThe characters are amazing, especially Holtzmann. Holtzmann is my new\nhero! And also, the secretary character brought some good comic relief.\nNot like the \"we need to have something funny here\" comic relief, but\nit really adds to the story and plot.<br><br>The CGI is not what most people are used to now a days, but it's good.\nIt has stayed true to the original visuals, which i love! It's so\nretro, just with much better CGI.<br><br>To sum up: If you loved the original movies, you're going to love this\none too! I really hope they make a sequel! And also, what's up with all\nthese men crying wolf? And when I say wolf, I mean feminism. Don't like\nthe way men are portrayed in this movie? Don't like an all female cast?\nWelcome to our world, and when I say our I mean the world of women.\nIt's about time that girls get some awesome female characters to look\nup too! You know, the smart, strong, weird, nerdy, quirky, funny,\nfearless, kind, selfless type that we need more of! So don't say the\nmovie was crap just because you can't handle all those awesome women,\nand men for that matter. The movie is just full of awesome characters\nregardless of gender.\n"},
{"review": "\nA new team of Ghostbusters is here to stay! A movie that can entertain\naudiences from different ages, for those who love comedy, action and\nghosts! The cast is simply awesome! Wiig and McCarthy shines as always\ndelivering two charismatic and engaging characters, McKinnon is the new\nstar and Jones as Patty is the cherry on top of this team of adorable\nweirdos.<br><br>Hey, you all girls who once dreamed to be a Ghostbuster now you have(or\nI must say Us?) have a new team to love and celebrate. If you want to\nhave fun watch this movie, and guess what, you can watch with the whole\nfamily! Waiting for a sequel, no a trilogy!\n"},
{"review": "\nI liked it! It is not a deep complex comedy. It's more juvenile humour\nand if you don't like that then you Should absolutely stay Clear! The\ntempo of the film was fine (not great) but i liked the characters and\nthe acting was good (but Kristen wiig seriously makes me cringe\nsometimes...) And overall it was very entertaining! I laughed so much I\ncried at some points in it. It has a lot of similarities to the old\nghostbuster film (some ghosts are the same and whatnot) but they have\nmade enough changes that it doesn't feel like I'm just watching the\nsame film but with different actors. I saw a review saying that the\nfilm only relied on cameos but the cameos was very minor and was more\nof the stan lee kind so I do not see that as a problem. <br><br>I think if you go in to watch this film with low expectations, it will\nblow your mind.\n"},
{"review": "\nThis movie does not deserve the hate it is getting. It has four\nhilarious women at the center who make great role models for the\nyounger audience whilst also making for an exceptionally fun\nexperience. It was so refreshing to watch a film that didn't have any\nunnecessary romantic subplots involving the female characters (albeit\nthe occasional flirting between Erin and Kevin). Don't hate on the film\nbefore you have seen it because you don't like the cast. Yes it is\ndifferent from the original, it's thirty-two years on. If you liked\nPaul Feig's other movies 'Bridesmaids' and 'The Heat', you'll love\n'Ghostbusters'. Hoping for a sequel!\n"},
{"review": "\nThis movie is an absolute riot. The cast chemistry, the writing, the\nspecial effects, everything. Entertaining for adults but still\nappropriate for children. Kate Mckinnon's performance stands out but\nall four women are wonderful. The advertising for this film did not do\nit justice, in any respect (damnit, Sony.) I was completely blown away\nand have a new respect for Paul Feig. Despite the hoards of whining\ntrolls trying to rain on its parade, we got a movie that balances the\ntone of the original with the comedy of a new decade, all without\nalienating a new audience. I'm looking forward to a new era of female\nled action. I for one, am pumped for the sequel. 10/10.\n"},
{"review": "\nI simply cannot understand why anyone who remembers and loves the\noriginal Ghostbusters, wouldn't love this parody makeover movie.<br><br>The new Ghostbusters is an incredible fireworks of humour and action\ncoupled with purely orgasmic allusions to the original. There's humour\nin every scene and in every dialogue, but it's better if you remember\nthe sequence of events in the original movie - it makes it so much\nfunnier. The new Ghostbusters contains absolutely fantastic cameos - I\nwon't spoil it for you, but if you really love the original\nGhostbusters, you will love it too. <br><br>I also enjoyed how they turned around the story of the Ghostbusters\nlogo origins, the firefighters station, etc. <br><br>I'm not sure whether this movie can be considered a remake or a parody,\nbecause it's a perfect mix of the both. <br><br>H-I-L-A-R-I-O-U-S! Watch it, you won't regret it. I rarely write movie\nreviews, but this one is really worth it.\n"},
{"review": "\nI went to see this with my sister and we spent the entire time\nlaughing. It was perfectly cheesy and funny, and it kept my attention\nthe entire time which is rare for me. Every character reminded me of\npeople in my life, especially Holtzman who reminded me of one of my\nbest friends. As a fan of the original Ghostbusters, I have to say that\nthis movie surpassed my expectations while keeping with the heart of\nthe original. In addition,here are some really cool references to the\noriginal in the movie which I enjoyed a lot. My sister and I both\nreally enjoyed the movie, and my little brother can't wait to see it\nwhen it comes on DVD.\n"},
{"review": "\nI finally got round to seeing this last night. And I have to admit, it\nwas really good. The story seemed to go at its own pace, which I kinda\nliked, it also managed to fit in developing the characters and all the\nghost busting stuff too. Which, when it comes to a movie. It works\nincredibly well. The special effects are really good. The ghosts look a\nlot more realistic, and all the scenes with the ghosts are incredibly\nthrilling and really keep you on end with the excitement of it all. I\nthought Kevin was an incredibly funny character, because he's just that\nbumbling idiot that kinda helps the ghostbusters, and the villain was a\ngreat character too. I loved his plans, and it really gets you\nthinking, how could these plans work? But they seem to work for him.\nAnd those end credits, they were so random, but incredibly funny. So\noverall. Go see this movie. You will not regret seeing it. It is just\nlike a lot of the audience were saying. You don't want to miss out.\n"},
{"review": "\nI laughed out loud, as did the rest of the audience, more times than I\ncan count. It was funny throughout and touching at parts. It paid\nhomage to the original tastefully with cameos and walk-ons. The four\nleading ladies were phenomenal and had some great growth through the\nplot. It was great to see a reboot with a female cast full of funny\nbadass women. Ignore the haters and mras and see this flick.<br><br>A lot of the negative reviews here are clearly from naysayers who don't\nsee the irony in their own comments. Yes this movie had a predominantly\nfemale cast. That isn't sexist. How would it possibly be sexist to cast\nfour women if you maintain it wasn't for four men to be cast. Get real.\n"},
{"review": "\nThis was the best damn movie I've seen in a long while. I didn't watch\nthe original Ghostbusters movies, mostly because I'm tired of seeing\nmostly white men blow up cool stuff, and I admit I just watched this\none because I didn't have to pay for the ticket. <br><br>So let's start with the things I didn't like: 1. The antagonist was so\nflat and boring. Sorry, not buying this. 2. You know, I appreciated\nKevin and his endearingly dumb escapades. And the revengeful part of me\nenjoyed seeing the roles reversed. But for future notice, I want my eye\ncandy to be three-dimensional, not a reversed sexist trope. 3. I loved\nPatty but she was a stereotype. <br><br>Apart from that? It was absolute gold. Funny and entertaining and\nbadass. There was no romantic subplot, which was a relief, no sexist\njokes, and guessing from my partner's comments (who's seen the original\nmovies) there were enough cameos and references to the first two movies\nto please the first generation fans.<br><br>I'd definitely watch a sequel.\n"},
{"review": "\nThis movie is everything that a Ghostbusters reboot should be. It is\nfunny and action packed. If you are looking for a great and funny\nfamily movie go and see this. If you are a feminist, you will love this\nmovie. It has a wonderful and hilarious all female cast that will keep\nyou laughing until the end. For you ladies out there, Chris Hemsworth\nplays a funny character in the movie. There are also cameos from some\nof the original cast like Bill Murray and Dan Akkroyd. Also, some of\nthe ghosts from the original movie like Slimer and Puff the Marshmallow\nMan. They even use the same guns and the old logo. This is a wonderful\nmovie because it hits the nostalgia that you want but also adds new\nthings in. Overall, if you were a fan of the original movie, this\nreboot will not disappoint you.\n"},
{"review": "\nI'm a fan of the original (so, yes - I'm one of those) but as much as I\nloved the original, I have to admit that it's inferior to this reboot\nin so many ways. I've seen the reboot in theatres twice now (once in 3D\nand once not), and I can honestly say that it's an amazing film, and an\nimportant one - not just for kids (both boys and girls) but for women\nlike me who grew up just wishing she could create amazing toys and\ntools to hunt ghosts with like Ray and Egon (I had the biggest crush on\nhim) in a wicked (and functional) jumpsuit (distinctly different from\nthe usual catsuit female heroines get stuck wearing). Middle-aged guys\nwho watched the original as children and adolescents - you already got\nyour film - don't begrudge us ours. The story is strong, the actors\nhave palpable, organic chemistry, the characters are relatable, and the\nmovie looks great overall. It's a fun film (like all of Feig's films),\nand I'm already looking forward to watching it a third time.\n"},
{"review": "\nI haven't seen the original movie, but according to my father, who is a\nfan of the original movies, loved this new film. Also he liked the\ncameos (who I didn't really understand because I haven't seen the\noriginal).<br><br>I'm not a movie fan so I usually go to the movies once and that's it...\nso I think this is the first time I've seen the same movie in the\ntheatre five times already. This may not be so special to movie fans...\nbut it is for me!!<br><br>I just loved this movie so much. I like animations and computer\ngraphics, so I liked how the ghosts were made of that... sure, some\npeople might think they look cheap, but hey, it's a comedy, not\nParanormal Activity.<br><br>Everyone in the theatre was laughing out loud, and I was glad I went to\nsee it on the busy time of the day so I can enjoy laughing out loud\nwith others.<br><br>I try not to spoil so much... but I just want to say that the\ncharacters are awesome. Friendship is a big part of this film. Please,\njust give it a try once, and if you don't like it that's OK... but I\njust loved it, and if there's anyone who's planning not to watch it,\nPLEASE WATCH IT!!! It's a great film.\n"},
{"review": "\nIf you're looking for Casablanca, then keep looking. If you want to\nlaugh and you're looking for a fun movie with talented comedians, this\nis it!<br><br>I honestly never write reviews, outside of what was required for my\nprestigious film degree, however I felt I had to because the backlash\nthis film has received makes me question whether others are actually\nseeing the same movie I saw. I'm old enough to have grown up with the\noriginal, and while I love that film, it is also not without its flaws\n(think about the constant day/night shift while the Ghostbusters are\nheading to battle Zuul - this is just basic filmmaking! Is it day? Is\nit night? It's maddening.). There are very few perfect films in the\nworld, and the original Ghostbusters is not one of them. So why are\npeople putting it on this untouchable pedestal?<br><br>Ghostbusters (2016) is a well executed comedy starring four incredibly\ntalented comedians and a very funny Hemsworth (he's in a category all\nhis own). There's literally nothing to hate about this film unless you\nhate good, funny things. The story is entertaining, the FX are great,\nand the chemistry is hilarious.<br><br>And if I saw this as a kid (as I did with the original) then I would\ntotally want to be just like Holtzmann! A smart, funny, quirky,\nambitious scientist who doesn't care what anybody thinks. <br><br>Hoping for a sequel!\n"},
{"review": "\nFull disclosure: I rated movie about a 7.5/10. <br><br>But if there are going to be all these bizarrely negative votes, I am\ngoing to bump up my rating to counter some of them!<br><br>All of the women were funny. Melissa McCarthy was cute and held the\naudience. There were some flat bits, and the film lacked a solid B-\nstory line: there were no love interests, no sick mothers, no weird\nhousemates, no jobs outside of ghostbusting - nada. It made the movie a\nlittle predictable.<br><br>However, the special effects were great and there were some fun\nmoments. If you have a kid aged 12-16, they would love Ghostbusters.\nFor the adults, Leslie Jones was fab, really sassy and funny, and Kate\nand Kristen both had time to shine.<br><br>Also, holy heck, Chris Hemsworth. I loved the way he and Paul Feig sent\nup that old 80s trope of the secretary so silly she can't even work the\nphones. It seemed to be in every second movie when I was a young kid.\nIt was so on point and quite intelligent. NOT MISANDRY. NOT AN ATTEMPT\nTO PUT DOWN MEN, just good fun with a bit of a deeper message.<br><br>The best scenes: when the Ghostbusters are testing the equipment in the\nalley; some of the banter between them all; the demon ghost at the\nweird day concert; and the credits. More Hemsworth. That was worth half\nthe ticket price alone.\n"},
{"review": "\nI'm surprised by all the negative reviews about this film, especially\nthe ones stating it's a feminist, man-hating mess. Must be from some\nmisogynist pigs who are threatened by the idea of female leads. That\nwould be like saying the original film is a woman-hating-sexist attack\nagainst actresses everywhere. Not true. A completely ridiculous notion.\nThis film is hilarious. From start to finish. And so much fun. I am\nobsessed with the original film and this one did not disappoint. You\nare not watching a movie that was simply remade as the same film with\nfemale actors. It took the original idea and created a new hilarious\nplot. Also keep in mind the original Ghostbusters fully support this\nmovie. This is something Ramis would've been proud of. If you are not\nable to sit back and enjoy the hilarity in this movie, you are bitter\nand sad and need to lighten up.\n"},
{"review": "\nScrew the naysayers and critical idiots..this movie was freaking\nhilarious. Get a grip, get a life, get outside your idiot old, outdated\nor hipster bullshit self....laugh a little and have some fun. This\nmovie wasn't meant to replicate, duplicate or placate. Thanks Paul Feig\nand company for the good time... I really needed an escape this\nweekend. And now, I have t add ten bullshit lines in order to get my\ntiny voice heard here on fing IMDb....is this the man behind the\ncurtain? Does a silly and fun review of a silly and fun movie warrant\nten lines of fing copy? Wow...what a society we have here today. What\nwill they post about \"the secret life of pets\" ? 10 stupid lines of\ndrivel to be written...or face the threat of the almighty IMDb?\nOh.....well....here are my damn 10 lines of copy....get over yourself\nand go see the fing movie \"ghostbusters\"!!!!\n"},
{"review": "\nPlease don't listen to the fanboy hate about this movie. The only thing\nthat it will do is keep you from seeing such a wonderful, funny movie.\nThe new Ghostbusters was everything and more of what I expected and\ncome to love of the Ghostbusters. <br><br>First off, it was hilarious like to the point I had to stop myself from\nlaughing and it wasn't easy. I laughed so much that my eye's started to\nblur from the tearing up. There were so many gut busting moments that I\ncouldn't help but crack up. Leslie for me stole the show with her bold\npersonality. I kept wanting to see more scenes were her in it. Kate was\nalso hilarious. All four of the ladies were strong in their own ways\nand they worked very well together. There was a lot of chemistry.<br><br>The graphics and ghosts were amazing. I definitely recommend seeing it\nin IMAX 3D if you can. I really felt fully submerged into the\nGhostbuster world. There were times that I was actually scared by the\nghosts and jumped out of my seat. I don't ever remember getting scared\nin the first two. There were a lot of fun references to the first two\nand really did a great job of honoring the legacy. I loved all the\ncameos by the original cast. Sigourney Weaver was my favorite by far!\nDan Aykroyd was pretty funny as well.<br><br>I loved this version so much that I'm going back to the theater to see\nit again this week. Like I left the theater wanting more. Also stay\nuntil the end of the credits, trust me on that one. I really hope they\nmake more as I love a world where all four leads are four intelligent,\nstrong, bad-ass women!!! It will open the doors for so many girls and\nwomen alike, who might not have normally been brought in. Who am I\ngoing to call? Kristen, Melissa, Kate and Leslie!!! That's for sure!!! <br><br>I give it five ghosts out of five!!! I really hope that it does well\nenough to make more with these four fantastic ladies!!!\n"},
{"review": "\nAs someone who loved the 80s version as a kid, I was of course\nskeptical of the reboot. I was happy to be wrong. <br><br>I loved this movie, I saw it at a drive in, which compounded the\nfeelings of nostalgia mixed with something new and fresh. The gender\nrole reversal was brilliant, the jokes were funny for the most part,\nwith Holtzmann stealing the show. <br><br>The dumb guy was also a brilliant touch, we don't usually see that, and\nit was so refreshing to see the trope turned on its head. <br><br>So, sorry man-babies, sorry that a movie hurt you in your nostalgia\nfeels, but we are going to get movies aimed towards us and you don't\nhave to like it, but you are going to have to learn to deal with it.\n"},
{"review": "\nI read seventeen pages of reviews of this movie with whiny babies\nweeping over their cheeto-stained faces about how man-hating it is. If\nyou're a rational person, there's so much to enjoy about this movie if\nyou allow yourself to have fun and go into it without being determined\nto hate it beforehand. I found this movie much better than the first\noriginal Ghostbusters, it had much more action, cooler gadgets, and the\ncharacters had distinct personalities rather than all being the\ngreasy-looking shmos from the original. (still not sure why they made\nbill murray look like he hadn't had a shower in weeks, but i digress)\nThe visuals are bright and colorful, a welcome change from the\nmonochrome baddies of most action / paranormal movies. the gadgets are\ncool, there's enough weirdness to make you laugh. The theater i was in\nwere laughing at all the jokes in the movie. Yeah there's camp, but the\nmovie is well-aware of it's goofy elements and makes the most of them.\nThe movie works well as a fun time for most age ranges, i'm 25 but i\ncould see how a lot of kids would really enjoy this along with their\nparents and older siblings (in a good way, similar to the level of\nhumor in the originals which was a little goofy too) Kate Mckinnon was\ndefinitely the highlight of the film and what made it really stand out\nfor me, with Kristen Wiig, Leslie Jones and Melissa McCarthy each\nbringing their usual brand of humor to their characters. If you're a\nnormal human being, there's plenty to like about this Ghostbusters.\n"},
{"review": "\nThe movie was a great homage to the original, and was a funny,\nwell-paced experience. In the theater, there was not one person who\nwasn't enjoying the movie. From the old Ghostbusters to the newer\ngeneration, this is a well written and very fitting cast for this film.\nThe leading rolls did a fantastic job, and the special effects and\nanimators did a phenomenal performance. This movie was written for and\nwelcomes a new generation of \"Ghostbusters\". The supporting cast were\nalso great, and their was not a single moment of 'down time'. Each\nscene flowed well from the next. The musical soundtrack is very fitting\nand adds to the movie instead of takes away like in most films.<br><br>A lot of the hate and bad reviews come from older men who believe this\nfilm was geared specifically toward them, but it is not. The movie was\ngeared for everyone, and is well liked as a whole. I cannot wait to see\nif they continue the new Ghostbuster franchise. I'm looking forward to\nit.\n"},
{"review": "\nI saw this movie today because I watched the trailer and thought it\nlooked so cool. I really didn't understand why people were hating on\nit, I didn't notice anything looking too bad. I honestly think this\nmovie is getting so much hate due to the overzealous fanboys of the\noriginal. Like, hate to break it to y'all but franchises get remade and\nrebooted all the time and no matter how much whining you all do in\nYouTube comments it won't stop people from enjoying a funny movie. <br><br>This movie doesn't try to recreate the original frame-by-frame, instead\nit gives a new modern twist to the franchise while still paying homage\nto the original Ghostbusters. The cast was super funny and all had good\nchemistry. Chris Hemsworth's character was such a clueless little puppy\ndog--which apparently makes some people mad for portraying a man as\nstupid and clueless as if they haven't been doing that to women for\nyears.The final fight scenes throughout New York were totally awesome\nand showed women as friends kicking ghost ass. Totally a fun and\nenjoyable movie and I hope all the stupid hate won't stop you from\nwatching it.\n"},
{"review": "\nThis movie was hilarious from the get go. From the very first scene, we\nwere laughing out loud in the theater. I was surprised because usually\nwhen a movie has this many former SNL cast members they tend to be\npainful to watch, but I think the actresses did a great job creating\nand inhabiting their characters. There were cameos from former\nGhostbusters cast members, but they weren't overdone. The 'science' of\nthe story line is fake, and was fake in the first movie-- I don't know\nwhy anyone would expect to walk into a movie ABOUT GHOSTS and not think\nthere will be some suspension of disbelief required, but whatever. It\nwas so much fun watching these women building crazy machines and\nkicking ass. I loved it and can't wait to see it again.\n"},
{"review": "\nVery funny, loved the homages to the original movie. Also Holtzmann.\nAnd Abby. And Patty. And Erin. And the interactions between them were\npretty cool. Erin and Abby had the broken friendship between them, but\nthey got through that and Erin even saved Abby's life. The special\neffects during that was really cool. Kind of a muffled, not quite on\nthis plane sound and neat lighting. I was so relieved to see them pass\nfrom the green part of the vortex to the red. And Holtzmann! She is\nflirty, brilliant and funny! She's definitely one of the movie's\nhighlights. All of her scenes were fantastic. All of them. Patty\ninjects a sense of, well, sense into the group. Considering Erin jumped\ninto a swirling portal of death the group is really, really going to\nneed that. She's also kind of relatable, a grounding point in the\nscience crazy that the others take for granted. Also, I like how the\ngroup is protective of Kevin, dumdum that he is. He tries! And he\nfails, epically, but he tries!\n"},
{"review": "\nMake no mistakes, this is Ghostbusters, funny, cool tech and ghosts.\nPaul Feig's respect for the franchise really shows in this movie. A lot\nof people were expecting Ghostbusters 1 (the first reboot), It is not,\nthere is no Venkman, Egon, Kong or Tracey in this movie. It stands on\nit's own. The girls have chemistry on the screen, the jokes are on\nspot. Chris Hemsworth is funny also. <br><br>There is a clever tie in at the end, although not explained that well.\nBringing in Venkman's tape from another dimension, discovering Zul. <br><br>I found this movie to be as funny as the original. Go see it and judge\nfor yourself though.\n"},
{"review": "\nThis movie is a great reboot and update of the Ghostbusters I remember\nas a child. All of the four main ladies are hilarious. I was literally\nlaughing out loud through most of the movie. They had some great cameos\nfrom the original cast as well. It had some very funny homages to the\noriginal but was really a completely new story. I especially thought\nKate McKinnon, Kristen Wiig, Melissa McCarthy and Leslie Jones were\nfantastic. I will definitely be going to see this again and will buy it\nwhen it comes out because this one is going to become a classic! If you\nhave a funny bone in your body, do yourself a favor and go see this\nmovie. You won't be disappointed! Oh and there was some guy named Chris\nHemsworth who was equally funny and my wife was very happy to look at\nhim on screen!\n"},
{"review": "\nStarting from the trailers, I was ready for this movie. Anytime the\ntrailer came on I cracked up laughing. But then the premiere happened,\nand the reviews??? I couldn't connect the movie to the reviews, My\nthoughts were just.. How? So like with everything else I decided to see\nfor myself (which I urge you to do!) So we went as a group, my mom, my\ncousin and her three friends, and from the jump we were hooked. I\nlaughed so hard during that movie, honestly there was never a dull\nmoment. Honestly that's all I can say without spoilers, so go and see\nit! Four women ghostbusters?? And Kevin!!! I don't see how you could go\nwrong? Go out and form your own opinion!! Don't take my word, or the\nwords of the neigh Sayers!!!!!!\n"},
{"review": "\nThis is definitely a movie that needs to be watched before you rate it.\nUsing the trailers as a guideline for your review is not how you should\njudge this movie. I've seen it twice, for basically free. <br><br>This movie, despite negative reviews, is actually really appealing. The\nonly major issue was the plot, as it was kind of choppy, but the comedy\nand the characters made up for it. I think it was more geared towards\nthe teenagers rather than adults, judging by the comedy and the way the\nmovie played out. <br><br>As for somebody who grew up watching the original Ghostbusters (and\nwhose parents are die-hard fans of the series), my whole family enjoyed\nit. I'd definitely suggest watching it in 3D if available, though. It\nfelt like the 3D gave more effect and more immersion than the standard\nversion. <br><br>Most people have issues with the Ghostbusters team being female.\nPersonally, I don't see what gender of character should have to do with\nany review writing at all. A review is meant to be posted or written\nafter seeing the movie, and focused more on the movies aspects, plot\nline, and graphics, and the personality OF the characters, rather than\nwhat gender the characters are.\n"},
{"review": "\nThis reboot is wonderful fun - Melissa McCarthy and Kristin Wiig are\nbrilliant as physicists turned Ghostbusters and Leslie Jones and Kate\nMcKinnon bring spirit and energy to a fun and funny film. Chris\nHemsworth has probably been waiting in eager anticipation to play a\nrole like this and he's made the most of it here. Stay tuned for more\nof his hilarious vamping through the credits. So fun to see cameos of\nthe original cast - clearly giving their blessing to this clever reboot\nof a classic. Though I noticed what I thought were two editing errors\n(McKinnon's reaction shots in an alleyway and one other place, seem\namiss for the action and were likely poor editing choices), I am still\ngiving this film a 10. First because I love the new casting and second,\nbecause so many people have bashed the film BECAUSE women were cast in\nthe leads. And bashing a film for that is just silly.\n"},
{"review": "\nLet me be clear that the original Ghostbusters is my favorite movie of\nall time. And so when I was angry about the remake (and I was angry\nabout the remake), it has nothing to do with gender, but with the fact\nthat it would be a hard reboot, and not in the continuity of the\noriginal films. I was an idiot to worry about a film I had not seen\nyet. It was fantastic.<br><br>I spent a good chunk of the movie trying to figure out which new\nGhostbuster was supposed to be which old one. Was Kristin Wiig the\nEgon? Or was Kate McKinnon the Egon? And as it turns out, they aren't\nthe old Ghostbusters. They have created four new, compelling, and\nunique characters, and I applaud them for it.<br><br>Was the story similar to the original? Yes. It was supposed to be. It\nsays in the credits \"Based on the movie Ghostbusters, by Harold Ramis.\"\nAnd the tributes to the original were everywhere. And yet, it was\ndifferent enough to surprise me and not feel on the one hand like a\nrip-off, or on the other hand like a random movie with the logo slapped\non it for marketing reasons. This was a Ghostbusters film, and it was a\nnew Ghostbusters film, and if you liked the original I can't imagine\nyou not liking this one. The sense of fun and humor is there the whole\ntime.<br><br>Best of all, as we walked out of the movie my wife turned to me\ngrinning and said \"Wow, I really liked it. Like, I can't remember the\nlast time I liked a movie this much!\" And my daughter, who was also\nwith us, couldn't stop talking about it the whole way home. This movie\nwill create a new generation of fans, and it will please the old ones,\nif they can just get over themselves enough to allow themselves to\nenjoy it. Because seriously, this was one of my favorite movies of the\npast decade. The Ghostbusters are back, baby!\n"},
{"review": "\nWent into the movie with no expectations, and I found it funny and an\nenjoyable summer blockbuster. Some of the one liners were hilarious:\nPatty saying, \"That ghost is gonna be the third scariest thing on that\n(subway) train.\" The uncle thinking his car being \"on the other side\"\nmeans it's in NJ. Music score was meh. I haven't seen the original in\nabout 20 years, so can't compare it to the original, but I think a lot\nof the negative reviewers need to get their panties out of a bunch. I\ndidn't hear anyone complaining when the new star wars came out and was\nalmost the same plot as the original. How many times they gonna do\nbatman? I feel like a lot of the reviewers either went in expecting\nhigh brow humor and got mad at the family guy level, or are angry\nmanboys in a twist that the ghostbusters are all female. Don't see them\ncomplaining that the original were all men. While I feel they should\nhave toned down some of the man ridicule in the movie, it doesn't\ndeserve the vendetta going against it that started before it was even\nout. These are probably the same ugly misogynists who caused gamer-gate\nand dump hate on female video game players. I hope their moms slap them\nupside their heads, cause they clearly need it.\n"},
{"review": "\nSo I was super excited to see this movie and after reading all the bad\nreviews on this movie it made second guess going to see the movie, but\nI decided to take my kids to see this movie since one of my daughters\nis a super fan of the Ghostbusters and I am glad I did. This movie was\nsurprisingly entertaining and I would definitely pay to see it again. I\ndon't understand how this movie got a one star from most of the\nreviewers on here and I think it is ridiculous, this movie did not\ndeserve a one star. I definitely believe that this movie had a great\nstory to it and I hope that all of these bad reviews do not hurt on the\nmaking of a new Ghostbusters 2.\n"},
{"review": "\nI don't know why so many hate this movie. I thought it was amazing. I\nhave been waiting for a 3rd Ghostbusters for over 20 years. I did\nwonder how the writers were going to pull off women as Ghostbusters,\nbut I went in with an open mind and I must say, they definitely pulled\nit off. The 4 leading cast were a great combination and they countered\neach others personality well. It was extremely funny and I enjoyed\nevery minute of the movie. The lead in was great and it just got better\nfrom there. Having Chris Hemsworth in it was a good combination. The\neffects were spectacular and I loved the story line. I will go back and\nsee this again, probably in 3D this time. Recommendation- Stay until\nthe very end of the credits and don't listen to what all these close\nminded people have said. These people made up their minds before they\neven saw the movie. Have an open mind and enjoy yourself and you will\nsee the movie for how it really is. Great!\n"},
{"review": "\nI'm a child of the late 80s/early 90s. My knowledge of ghostbusters was\nseeing it replayed on cable, the cartoon, and Ecto-Cooler juice boxes.\nI'm not a die-hard fan but I've always loved the movie.<br><br>That being said, I went into this movie with an open mind. I've heard\nnothing but \"It's hilarious\" and \"It's the perfect nod to the movies\"\nfrom friends - and I was not disappointed. <br><br>The chemistry between the four leads - and Chris Hemsworth - is\nfantastic. Their comedic styles are all different but it WORKS. We were\nloudly laughing with the whole theater to the point that our stomachs\nhurt. And on the flip side, the research and conviction towards the\nparanormal and science was what you hope for with the franchise. <br><br>We laughed, gasped and clapped for every cameo. It doesn't try to be\nthe originals - it doesn't need to. New universe - new story. But the\nnods to the originals - and NY - were perfect.<br><br>I will be seeing this multiple times. Thank you to the cast and crew\nfor doing right by this franchise. I can't wait to see a sequel.\n"},
{"review": "\nThis is the most refreshingly original, yet\nlovingly-referential-to-its-predecessor reboot of a cult classic that\nI've ever seen. It has enough verve and fresh humor to stand on its own\nmerit, yet just enough original-cast cameos and satisfyingly clever\nnods to the 1984 version to ensure that it's on point.<br><br>If the almost complete lack of male gaze in this film is what's gotten\nalmost every previous reviewer's panties in a twist, then I'm laughing\nall the way to the end of this write-up. They've all proved just how\nsuccessfully this film has achieved its aims. When your four female\nprotagonists are, in no particular order, a queer neuroatypical\nscientist-slash-engineer, a confidently nerdy local-history buff of\ncolor, and a pair of academics who, in addition to having faced bullies\ntogether in their teenage years, also continue to face workplace\nbullying for both gender and research-interest reasons, the bottom line\nis that it's stellar representation. When you add to this the fact that\ntheir character development and interactions with each other are not\nonly cleverly and sensitively written, but also downright hilarious, I\nabsolutely fail to see how this film could be counted as a failure.<br><br>There's been a real dearth of truly fun, worthwhile, and socially\nrelevant summer blockbusters in recent years. This remake is a breath\nof fresh air and (as the majority of the user reviews on this page\namply demonstrate) a rollicking, status-quo-challenging kick in the\npants for those who indisputably need it.\n"},
{"review": "\nWow I've never seen so much hatred about a movie. A movie about\ncatching ghosts. Don't believe the other reviewers.<br><br>I do have to say that I'm a huge Paul Feig fan. I love his humor. And\nbefore people are going to batch the fact that Melissa McCarthy will be\nthe same character in every movie. In this movie she's not (I won't\nspoiler but I can say there will be no jokes about her weight, since in\nother movies she's played in, they like to joke about). It's a funny\nmovie with great visuals. A movie with a lot of links to the old\nGhostbusters.<br><br>If you want to see a funny movie, this one is. Don't read the negative\nreviews (I don't want to make mine to long, since I don't want to give\nspoilers). And don't base your opinion of the movie because of the low\nscore (today July 18th it's a 5,1). People have been scoring the movie\na 1 before it actually came out.\n"},
{"review": "\nThis movie is funny as hell, and the four main actors really made this\nfilm their own with hilarious quirky characters. Yes it is like the\noriginal, that's the nature of a re-make. But the characters are not\nclones of the originals, if you are expecting a line for line re-make\nthat's not this. Of course there is a similar story line (again:\nremake!) Brilliant cameos from the original GB stars, including a sweet\nnod to Harold Ramis near the beginning. (Stay for the credits to see\none more!) The special effects are well done, and it's scary but not\ntoo scary for the older kids. The one thing I would have liked to see\nis for Leslie Jones' character to also be a scientist. Of course many\nof the (male) reviewers hated the tables being turned, with Chris\nHemsworth playing a gorgeous but grievously dumb secretary. Down with\nHollywood misogyny! Go see it.\n"},
{"review": "\nA hysterical, well plotted movie that pays tribute to the originals. It\nveers enough away from the 80s to hold its own. An awesome female cast\ndepicting smart, funny women. Some say this movie is \"man hating\" but\nall it does is reverse gender roles. How many movies out there are full\nof men with one woman (who happens to be a secretary?) Girl power and a\ndelight, and who couldn't love Chris's character!!!! Honestly any fan\nof the original who keeps an open mind (and open to the concept of a\nfemale cast) will love this movie. I say it's a total hit, and any girl\ncould agree. Whatever, trump. The ladies from Satetday Night live are\nfantastic, and Mcarthy and Wiig do it again. The characters are well\nrounded and impossible not to love. The plot is fast and full of humor.\nAs a girl who grew up watching Ghostbusters, I've fallen in love all\nover again!!!\n"},
{"review": "\nLoved it! A great reboot of a franchise and most decidedly NOT a\nremake. The original spirit (ha, spirit) of the 80s films was there\nalong with several tasteful nods/cameos. I laughed a LOT. The\nperformances were nuanced and each character had their own meter and\ntiming. The four leads are not rehashes of the four originals. For\nexample, the engineer's similarities to Egon began and ended at her\nglasses. She is not \"the Egon character.\" There are no direct\nsubstitutes for Venkmann, Ray, or Winston, either. Some folks have made\nsome racist assumptions that because Patty is black, she is the\n\"Winston.\" True, she started the film as the non-scientist, but she is\nalso well-read, believes in the mission of the team, and has a near\nencyclopedic knowledge of New York--a far cry from the original Winston\nwho would believe in anything if there was a paycheck in it for him.<br><br>This isn't ruining anyone's childhood anymore than 15 different Batman\nre-starts have. Forget what you've heard--mostly from people who are\ngiving it a bad review based on what they think it is and without\nhaving seen it, i.e. a giant chunk of the IMDb negative reviews--and\ngive it a chance on its own merits. This is a movie that stands on its\nown.\n"},
{"review": "\nIthought the movie was excellent. It was funny, engaging and I was\ngenuinely interested in the movie. I had seen the original and thought\nthat was hilarious so I was a bit apprehensive about this one living up\nto it. But I was pleasantly surprised. The chemistry between the four\nwas wonderful and was overall a great movie.<br><br>So looking at the score it has on IMDb has me scratching my head. Why\nis it so low on here? Why do all the professional reviewers agree with\nme about how good the movie is but these reviews don't? <br><br>I read through the reviews here and it's funny how all the low ratings\nare from men. Do you guys have that much of an issue with women playing\na role that was originally male? The sad thing is I know for certain if\nthis was a remake with all males, it wouldn't have been rated so low.\n"},
{"review": "\nI just saw this movies today and I absolutely LOVED it! I'm a fan of\nthe originals and this one honestly had the same vibe. The characters\nwere likable and smart. It was honestly so refreshing to see female\nleads that had some serious brain power. Holtzmann is an instant\nfavorite! I've seen a lot of guys on here whining about how the movie\n\"hates on men\". No, it doesn't. The men making these statements are the\nsame ones who came on here to rate it before the movie even came out.\nAll this film did, was reverse the roles. The women were the leads and\nthe powerful ones while 2 men (TWO, out of the whole film) were given\nroles that are 99.999% of the time given to women. If you want a movie\nwith a good story that makes you feel nostalgic all over, YOU NEED TO\nSEE THIS! 3/4 of the Original Ghostbusters say it's amazing, and I\ncompletely agree. :)\n"},
{"review": "\nWhat's to say? At this point the movie is so mired in controversy that\nany opinion on it seems like a political statement more than a movie\nreview. But here we go anyway - I didn't like it. It feels less like a\nmovie with an idea (in this case a recycled one) and more like one of\nthe many subpar comedies we have today where a few comedians who are\nfriends in real life get together and give us two hours of smug\nback-patting. It offers nothing memorable of its own, just a few\nreworked things from the original movie, which was a classic with many\niconic images and scenes. The only thing anyone will remember about\nthis is the controversy surrounding it. I don't care much for Melissa\nMcCarthy or Leslie Jones but I do like Kristen Wiig and I'm trying very\nhard to like Kate McKinnon (perhaps too hard). None of these women are\nimpressive here. Chris Hemsworth's character is used too much. It's an\nobvious joke that doesn't get funnier the more you tell it. Ultimately\nthe problem with this movie isn't that \"women aren't funny,\" so much as\ncomedy writers today are very lazy and uninspired.\n"},
{"review": "\nI was pleasantly surprised with this Ghostbusters version. I've seen\nthe original a few times and I always wondered what the hype was due to\nit being boring and drab. This modern new version was a wonderful\nsurprise and so much better! I never would have thought this to be the\ncase due to the low reviews it received. I think that movie reviewers\nare putting the old Ghostbusters on a pedestal where it doesn't belong.\nIt really wasn't that good. The only good thing about the old one was\nthe theme song and the all-star cast. This new one also has an all-star\ncast, and quite frankly, it is a refreshing movie of it's time. It's\nabout time we see a group of women together as protagonists doing\nsomething important without the sole purpose to look sexy. I can't\nthink of any other movie that fits that qualification, sadly. As a\nwoman, this movie warmed my soul. The characters are engaging and very\nsilly. I laughed numerous times throughout.\n"},
{"review": "\nOh my goodness.... Loved it!!! I saw the 1980's version in theaters\nwhen it came out and tons of times at home... one of my favorite\nmovies... but I have to say this.. the other reviews are blooming\nnuts!!! I loved this one.. the acting was fantastic.. loved the girls..\nthey were great.. my hubby and my two sons loved it too... great\nenjoyment without sex and such ... funny and very well done!!!! I\ncannot say how much I loved it.. those 4 ladies are ripping\nfantastic!!! Geez.. they make me want to join them... they are my kind\nof gals!!!! If you like a fun and thrilling movie.. to escape from the\nnegativity of today... please join these lovely and fun ladies.. and\nKevin!!!! hehehee After submitting my review... I noticed that they are\nway more positive reviews versus negative.... then I noticed a review\non reviews stating that the positive ones are fake... I personally\nthink it's a shame... I am actually in process of watching in for the\nthird time in the last 3 days... Hubby... loves it and so do my sons as\nwell as myself... I really think that the negative reviews of a few\nhave really hurt what is essentially a really cool movie... and I have\nwatched movies of all types, by the hundreds from 1920's silent films\nto the terrible movies of the 70's.. up til today.. the only ones I\nwill not watch are the sex/gratuitous violence ones... my husband and\nmyself are movie buffs and love them for the story and quality.\n"},
{"review": "\nThere has been so much unneeded hate around this movie. People are\nraging out and yelling about how bad it is and how dare they take away\nmy Ghostbusters cause they love it soo stupidly much. But with so much\nhate comes a lot of curiosity as well. I had to see the film and see\nhow good or bad it really was. <br><br>And after seeing it. It is well..neither. It has some good stuff in it.\nLike for instance I really liked Leslie Jones as Patty and Kristen Wiig\nas well. But then there was Melissa McCarthy whose character I really\ndid not like and was really two dimensional and boring as well. I think\nthe choice to make this a straight comedy was a really bad decision. A\nlot of the jokes fall flat on there face and they hurt really badly. <br><br>Paul Feig has made some good movies before but this isn't really one of\nthem. The man struggles to find good direction in a muddle of air and\nit just sadly doesn't live up to what could of been a really decent\nfilm.\n"},
{"review": "\nI could not even get through this movie. I gave up just after 30 mins.\nSony have ruined a perfectly good franchise. They need to stop\nproducing films and just stick to making decent TVs which is something\nthey can't do anymore either but that's a whole different thing. In the\npast anything with a bad review I have watched and enjoyed but this was\nappalling. The humour was not even close to what the older movies had,\nthere was a connection with the actors in the original movie but I did\nnot even find anything like that in this. I wish I could say something\npositive about the movie but there is nothing. The only thing I would\nsay that there was a lot of bad press surrounding this movie and the\nactors were getting abuse which was all wrong but even if there was no\nbad press this still would have failed.\n"},
{"review": "\nPersonally I prefer to go into things with an open mind, but there were\nso many people being critical of this movie it was difficult.\nNevertheless, I did watch it with a tarnished image and a lack of\nenthusiasm because of that. Ironically, I felt the same way at the end\nof the movie!<br><br>It is boring, full of stupidity, lacks any humor, is badly directed and\nactually left me feeling as if I had been uninformed by the critics\naround me. It really is worst than they had told me.<br><br>The original was funny, entertaining and at least worthy of a couple of\nviewings. This isn't worthy of even the most insignificant hype and\nthat is why it is being pushed on us from every direction. When\nsomething this bad makes it to the big screen, has all of the marketing\nthat it had/has and probably lined a bunch of pockets, you have to ask\nyourself; why?<br><br>I hate using the old cliché about never getting that time back, but\nthis one goes further than that, I felt absolutely depressed, let down\nand thoroughly misled at the end of this movie.<br><br>And by the way; what is it with the original movie cast appearing in\nthe remakes? The ONLY movie I have ever seen where it was well done,\npretty cool to see and actually added something to the movie, was Lost\nIn Space. For Pete's sake if you are going to do it, do it subtly and\ndo it well, don't add a token piece that, if anything, actually only\nmade it all seem less entertaining.<br><br>Synopsis: if you want entertainment - try slapping yourself across the\nface in front of a mirror. It will produce a sensation that will be a\norder of magnitude more enjoyable than this drivel. Pity, because I\nlike every single actor/actress in this movie. What a shame...\n"},
{"review": "\nWhat do you do when you handed down the script directed by someone who\ngets easily butthurt over constructive criticism? You get Ghostbusters\n2016. I hate to call this movie \"Ghostbusters\" because this is nothing\nlike the original Ghostbusters, not even in the slightest. And yet, the\nstupid, misandrist anti-video game, pro-BLM, uneducated, retarded\nSocial Justice Warriors are making phony \"positive\" reviews because of\nthe \"all- female cast\" . Well, get this, I don't give a crap if the\ncast is black, white, male, female, old, young, Hispanic, Asian,\nhomosexual, bisexual, asexual, Native American, or anything else! When\nthe movie blows, it blows. The cast is unfunny, especially since the\nmovie casted the unfunny black supremacist Leslie Jones, it's insulting\nto men, the jokes are stupid, and the \"positive\" reviews are so bogus\nthey're not even funny. This is the kind of movie only mentally\nchallenged, misandrist, child abusing, serial killing feminists living\nalone watching Anita Saarkesian and Lacy Green everyday would enjoy.\nAvoid this at all costs.\n"},
{"review": "\nI don't understand the bad reviews, it's one of the best comedies I\nhave seen in years. I laughed so hard during this movie!<br><br>The over the top characters portrayed by Kate McKinnon, Leslie Jones\nand Chris Hemsworth added some great energy and humor to the movie.\nThere were some nice action scenes, CGI was okay and lastly...finally a\ncomedy movie that stars women without romantic adventures! *sigh of\nrelieve*<br><br>I definitely recommend ignoring the (bad) reviews and watch the movie\nyourself. Some probably hate it, but I loved it and a lot of others did\ntoo. (I hope there will be a sequel) <br><br>In the worst case: you've probably seen worse comedies *cough* any\nScary Movie sequel *cough*<br><br>Warning: do not take this movie seriously. It's a comedy, not a\ndocumentary.\n"}
]