[
{"review": "\nThere's no other way to say it; Creed is a knockout. <br><br>From start to finish, this film exhilarates and crackles with brilliant\non screen performances and masterfully directed fight sequences. It\nwholeheartedly captures what was so brilliant about the first film: the\ncharacters. Yes, I'll return to theaters to see the fights, but it's\nthe characters, particularly Rocky and Adonis that truly captivated me\nfrom start to finish. <br><br>I can't say enough great things about writer/director Ryan Coogler. The\nway he masterfully captures the modern spirit of Philadelphia and the\nvisceral tension of standing toe-to-toe with a man who wants to see you\nhit the ground is second to none. What stood out the most, however, was\nhis writing of Rocky Balboa. The subtle nuances that we love about the\nItalian Stallion are effortlessly worked into the script and flow like\nwater from Sly's crooked mouth. Speaking of, the script would be for\nnaught if it weren't for the beautiful performances by Michael B.\nJordan and Sylvester Stallone. I'm not ashamed to say I was brought to\ntears at various parts of this film. <br><br>I'm just so happy to say that this film wasn't a disappointment. This\nfilm exceeded my wildest hopes of a 7th Rocky installment and had me\nfeeling amped up for hours after the credits rolled. I can't wait to\nsee more from the talent involved in this film, and I proudly endorse\nand recommend Creed to Rocky fans and film fans alike.\n"},
{"review": "\nMilking the franchise for everything it's got, Sylvester Stallone\nreturns as Rocky Balboa in the 7th installment in the series. This\ntime, he's smart enough to know he's too old to get into the ring, so\nhe gets some new blood with a familiar name.<br><br>Micheal B. Jordan plays Adonis(perfect name), a man who was in his\nmother's womb while his father, the legendary Apollo Creed got his ass\nhanded to him in the 4th Rocky. With the same passion to fight as his\nfather, he seeks out Apollo's old rival and best friend the Italian\nStallion to teach him the skills to reclaim his legacy and become a new\nlegend.<br><br>Like a good boxing movie should, Creed has heart. I'm such of fan of\nMicheal B. Jordan. He's got the charm and talent to become a movie star\nand Creed proves he's leading man material.<br><br>And much respect to Sly, who as an aged Rocky, is in the same spot as\nonce franchise regulars, Micky and Paulie. It's humbling for a movie\nstar to take a step back and let Jordan drive the vehicle in front of\nthe camera, and Ryan Coogler sit in the director's chair and pen the\nflick, but obviously Sly cares about this cow and sought out the very\nbest to make it the very best. Stallone also gave a performance of a\nlifetime worthy of an Oscar nod for supporting actor. He is Rocky, and\nwatching him on the screen with Jordan was incredible cinema.<br><br>And the action in this movie was amazing. Some of the greatest battles\nin cinematic boxing are happening in Creed. We are so close to the\naction you can feel every hit. Also have to comment on Jordan's boxing\nskills. Creed, does an excellent job with showing a boxer going from\nhaving raw talent, to becoming a champion.<br><br>Definitely a worth wild boxing movie to see, and I think the best Rocky\nfilm since number two.\n"},
{"review": "\nFirst off let me say that I have been a life long Rocky fan. With that\nbeing said I went into this film very cautious as almost the entire\ncast and crew were brand new. The trailers looked good, but today a\ngood trailer is not necessarily an indicator of a good film. Sylvester\nStallone killed it as a much older and more breakable Rocky. Michael B.\nJordan's performance was as good if not better than Sly's. I think that\nfrom this day forward anytime I see Jordan, I will think of him as\nCreed and not whatever character he is playing. The story was\nengrossing and well thought out. The film pays a great amount of\nrespect to the Rocky films while at the same time carving out it's own\nplace in boxing film history. Honestly I have no idea how accessible\nthis film would be to someone who's never seen a Rocky film, but I\nthink the way the story flows it wouldn't be too much of an issue.\nAgain, highly recommended.\n"},
{"review": "\nWhy is this movie getting such good reviews? There is nothing here. The\nplot is just like all the rest of the Rocky movies, they even bring\nback the poor chickens. Lots of jump rope too. Oh, sorry not exactly\nlike the other Rocky movies, nobody died in this one, but he did visit\nthe cemetery. <br><br>Some stupid love interest that never went anywhere. An opponent that\ndidn't even look like a boxer. Not enough boxing, probably because\nStallone thought he could act well enough to carry the movie.<br><br>Creed: Please Rocky, come back and train me. Critic: Please Rocky, just\ngo away.\n"},
{"review": "\nCreed is the 7th installment in the Rocky franchise but this time\nfocuses on Adonis Creed, Apollo Creed's son. He wants to follow in his\nfather's footsteps and is trained by Rocky Balboa himself. More than\nboxing, this movie really goes into the relationship between Creed and\nRocky and how they both support each other when they most need it.\nMichael B. Jordan is fantastic as Creed. He is so energetic in the\nboxing scenes and he is even better when his character is being\ndeveloped. Now we come to Sylvester Stallone as Rocky. In his signature\nrole, he absolutely knocks it out of the park in what may have been his\nbest performance in his career as an actor. He honestly deserves an\nOscar for this part. He brought tears to my eyes on multiple occasions\nand still has the same charm from the old Rocky movies. <br><br>Creed perfectly mixes elements from past Rocky movies, especially the\nfirst, with modern culture. The amazing Rocky score is complemented by\nmodern styles. Creed's story is told just like Rocky's and it is so\nbeautiful to watch. The cinematography is also visually pleasing.\nCoogler captured the look of Philadelphia extremely well. The boxing\nscenes are excellent. There is a fight that is done completely in one\ntake and I have no idea how they did it. It was amazing. This movie is\na drama that tugs at your heart a lot, but at times it still manages to\nbe quite funny as well. <br><br>I love Creed as a film. Its characters are so well realized and acted,\nthe cinematography is gorgeous, and the boxing is glorious. Creed is\ndefinitely one of the best films of 2015. Creed gets an A.\n"},
{"review": "\nThe 7th (and hopefully last) movie of the Rocky franchise seems to be\nconsidered the best after the original by the critics but don't believe\nthe hype cause it's merely disappointing. The movie on the surface\ntries to go to a different direction exploiting all underground\nstereotypes. The hero is a young black that listens to hip hop. Rocky\nhas retired and manages his wife's Italian restaurant. The biker gangs\nof Philadelphia support them. The young fellow is in war with his last\nname, Creed, and what that represents. The easily foreseen screenplay\nincludes amped-up training sequences and climates to a title fight with\nan absurd number of punches landed in every round. Stallone's character\nsuffers from (spoiler alert) cancer and there you have a golden globe\nfor him as well an Oscar nomination (wtf?) for best performance in a\nsupporting role. Stallone getting an Oscar sounds like the academy is\ntrolling us. The movie is extremely overrated (8.0 in IMDb, 94% in\nrotten tomatoes) but even for a Rocky fan (as I am) it's extremely\npredictable and completely lacks emotion.<br><br>Grade: C- (D if you are not a Rocky fan)\n"},
{"review": "\nFirst of all, I like to start out that the acting was pretty good,\nespecially Sylvester Stallone, who is of course: \"Rocky\". The big\nproblem with this movie is that it was written and directed by some one\nother than Sylvester Stallone. In all the Rocky movies Stallone was the\nwriter, and besides the first Rocky and The fifth Rocky, Stallone was\nalso the director. What my point is, is that this random dude, that\nboth Wrote and directed this movie, made the movie \"Creed\", with his\nown style and junk that has never been in any of the 'Rocky\" movies,\nand the story was very poorly written, as well as the whole flow to it.\nI really hated the sensuality in it, as well as the reasons why Adonis\nCreed became a full time boxer. The movie \"Rocky\" had so much more\ninnocents and class and just the story all in all , just made so much\nmore sense. Most importantly I felt no \"Motivation\" to \"Creed\" as a\npose to \"Rocky\", because the story of \"Rocky\" just felt so real and\ninnocent and full of purpose, which is complete opposite in the movie\n\"Creed\". In the movie \"Rocky\" you felt the motivation. Overall, to\nbasically summarize everything, this movie had no class nor respect,\nfor the previews movies, and the writing was so lame and so empty.\nPretty much \"Creed\" was made for only one purpose... Money, cause the\nmost of the stuff in this movie was a complete fail. The Creator of\nthis movie knew that people would come to watch it,because of how great\nthe \"Rocky\" series were, but like i said before, this movie was a\ncomplete bust, with only one intention, to put Rocky's name in this\nterrible film just to make money.\n"},
{"review": "\nwhat a shame this could have been such a good film not bad acting by\nStallone but its the story line that lets this film down how it has got\na 8/10 is beyond belief only has 4 fights and is the world champion no\nbig build up the one guy who knocks him out does not reappear to fight\nhim so no revenge the make up on the eye of the last fight was terrible\nthe original make up was bad but i thought 2016 but no not even a\nlittle bit believable its was not bad acting that spoiled the film just\na bad story line the fact that Stallone has cancer should have been a\nbigger storyline in ie just living long enough to see him win or his\ndeaf girlfriend signing him to get up after being knocked down but none\nof this they could have had the ghost of apollo shadow boxing with him\nin the ring anything but this such a waste of a film that could have\nbeen so much better\n"},
{"review": "\nAlthough young Michael B. Jordan has the title role in Creed the film\nreally belongs to Sylvester Stallone. Sly joins an exclusive club of\nplayers like Bing Crosby, Paul Newman, and Al Pacino who got two Oscar\nnominations for playing the same role. In the case of Sly and Newman\nboth aged naturally into the parts of Rocky Balboa and Eddie Felson.\nIt's hard to believe that it has been 39 years since Stallone debuted\nRocky Balboa. It's also 39 years between the nominations that Stallone\ngot for Best Actor for Rocky and Best Supporting Actor for Creed.<br><br>But between that there have been several Rocky films over the years as\nSly has developed more facets to the fighting Mr. Balboa of\nPhiladelphia than I'm sure he even thought of when he debuted Rocky. It\nall really comes together with Creed.<br><br>But as for the story it seems that back when Apollo Creed was killed in\nthat fight with that Russian steroid machine Dolph Lundgren in Rocky IV\nhe had a dalliance that resulted in a post mortem birth of an\nillegitimate son who grew up to be Michael B. Jordan, character name of\nAdonis Johnson. Apollo's widow Phyllis Rashad took him out of foster\ncare as his natural mother had died and raised him.<br><br>Jordan has an interesting dichotomy to deal with. He's his father's son\nand wants to make it in the fight game, but on his own as Adonis\nJohnson. He seeks his father's old friend and rival Rocky Balboa as a\nmentor and Rocky trains him for a title shot at the light heavyweight\nchampionship. <br><br>Rocky Balboa is not the most articulate movie hero ever developed, but\nhe sure imparts a lot of wisdom to Jordan. Those scenes with Jordan are\nwhat got Sly Stallone that second Oscar nomination. Also Rocky has some\npersonal crises of his own to deal with. These guys are of incalculable\nhelp to each other.<br><br>I really loved this film and how Stallone developed Rocky to this\npoint. Like fine wine, Rocky gets better with age.\n"},
{"review": "\nAfter looking at the ratings, I was curious to know, why this movie was\nnot nominated at the Golden Globes, Was it because of the tough\ncompetition? The answer is No. This movie is definitely not a top 250\nmaterial. Secondly, the movie is full of clichés, from starting to End.\nYou watch, each and every element, unfold, just like all Sports movies.\nKnowing what will happen Next. The movie lacked an angle, playing on an\nangle about being Creed's Blood is not that catchy. The movie had some\nreally sloppy contrived moments, specially When Creed finds the\nhospital brochure in Rocky's jacket and finds out that Rocky has\nCancer. Now, why would Creed check Rocky's jacket. The whole scene\nlooks contrived The moment when Creed runs and Bikers move around him\nand Rocky looks at him from the top and everyone is cheering for their\nfavorite boy Creed, that is too old school and not something you expect\nfrom a great movie. The movie worked well in bits and pieces. The point\nwith Rocky was that his opponents had a character, They did try to\nbuild Creed's opponent's story, but it was not well executed. Too many\nscenes featuring Creed and Bianca.. But Creed had its moments, Yes,\nRocky looked like a pro,the way he dealt with situations, the way he\nwas analyzing the moves of the opponent, he makes you feel that this is\nthe same Rocky, I had cheered for in the past.\n"},
{"review": "\nWhen we saw the review rating for this movie, which was very high, on\nOn Demand, we thought we were in for a treat. It was incredibly boring\nand a waste of time. We sat through most of it hoping and thinking it\nwould get better. It didn't and we lost all hope. Very little character\ndevelopment so that you didn't care about any of them. Sylvester\nStallone seemed to have difficulty staying in character and he\nsometimes looked like Rock Hudson in a creepy way. Didn't believe the\nlove relationship between Creed Jr and his neighbor; no chemistry there\nat all. Lastly, even though it is indicated that this review may\ncontain spoilers, which is described as \"A spoiler is usually defined\nas a remark or piece of information which reveals important plot\nelements (for example the ending or a major plot twist), thus\n'spoiling' a surprise and robbing the viewer of the suspense and\nenjoyment of the film.\", I doubt there is anything that could spoil\nthis movie....it is that bad.\n"},
{"review": "\nThis is not actually a movie rather than a Jordan shoes and\nchemotherapy 2 hour commercial.<br><br>I turned off the film the moment I saw Rocky training Jordan while\ndoing chemotherapy. Who writes this crap anyways. Who's idea was it to\ngive Rocky cancer ? Maybe in the next film Rocky dies, goes to Hell and\ntrains Apollo Creed to fight the Devil. What a load of crap.<br><br>Everybody at one point made fun of the Rocky saga because one day we\nwould see Rocky dying of old age but still fighting in the ring.\nStallone actually made a Rocky film out of this joke. This is really\nweird.<br><br>What's next ? Adrian The Rocky Chronicles ?<br><br>The Rocky saga has been milked to it's last breath with this one.<br><br>Appolo's abandoned kid with social behavior problems, a deaf girlfriend\nwho is a singer, Rocky has cancer, Adrian, Paulie, Mickey, Appolo,\nAppolo's wife are all dead. Everybody is dead but yet Sly filmed\nanother Rocky movie and had a director who has never directed a film\nbefore.<br><br>Give me a break man, it is a failed attempt to do a sports drama movie\nall the way to the grave. Stallone did an excellent drama job with the\nfirst movies and no one was dead or dying.<br><br>I have only one message to Mr.Stallone. Let the Rocky saga be, man.\nJust let it go. You don't need the money and we don't need a Rocky\nmovie inspired by a school joke from 1985.\n"},
{"review": "\nCreed (2015)<br><br>I went into this expecting too much, for sure, but if you do the same,\nyou'll still be happy to see a solid boxing movie. The clichés are\nhuge, of course, on purpose, including lots of mentions (and movie\nclips) of the earlier Rocky movies. <br><br>In that sense, this is a movie for people who loved the original (and\nto some extent the earlier sequels). It's a feelgood followup without a\ncompletely predictable ending. As the son of Apollo Creed (remember\nhim?) turns to boxing instead of a lucrative business career (really?)\nwe have an echo of that first Italian Stallion rising up from nowhere\nto challenge the best of his times.<br><br>With no disrespect to the leading actor, Michael B. Jordan, the\ncharacter lacks the quirky depth and pathos of the original slightly\ndumb-seeming but ultra sweet role that Stallone created (he wrote it)\nin \"Rocky.\" And so Jordan, the ex-banker, has none of the rising from\nthe depths of poverty and loneliness that the original Rocky had. They\ntry to give him some backstory with lots of fighting as a kid, but it's\njust story, not emotional depth.<br><br>And so the rest of the movie follows suit. We like the guy (Adonis\nCreed) and want him to win. But we like even more Stallone himself, who\nends up being once again the start of the movie\u0097and with a large role.\nHe's officially a supporting actor, but he's in it top to bottom and\nwith real depth to his character.<br><br>Some of what keeps this being a good solid but unexceptional boxing\nstory is the writing (Ryan Coogler) and the directing (Ryan Coogler).\nThe plot and the technicals of directing are all straight from the\nbook\u0097predictable, but professional. The fight scenes themselves are\namong the best of the movie\u0097 emotionally and physically convincing. And\nwatch Stallone all along, who is pretty terrific. <br><br>Yeah, you might want all these clichés, but heads up\u0097they aren't enough\nfor a truly great movie, which this is sometimes promoted to be.\n"},
{"review": "\n... but Stallone isn't.<br><br>There are a number of serious reasons to catch this film if you can: <br><br>* it's a solid production. Nice writing, acting, direction. Starts slow\nand builds. Not every great film has to start with a car chase (FF) or\na building imploding (Bond).<br><br>* it's a feel good film, and they don't make those any more. The script\nmakes clear, this is as much about capital-L LIFE as boxing. Not a\nboxing movie. But it is not \"not\" a boxing movie --- see? <br><br>* props to writer/director Coogler. A labor of love and it shows.<br><br>* a great opportunity to spend time with a legend, and here I mean\nStallone not Rocky. This guy literally does not know the meaning of the\nword \"quit.\" When everyone in town turned down the Rocky I script, he\nfound backers anyway. When some of the Rockies turned out to be bombs,\nhe just kept going. When everyone figured he was down for the count, he\nstarted a B-movie franchise called the Expendables. And when he woke up\none morning and realized that all the other franchises had imploded, he\nturned his B-movie franchise into an A-movie franchise, and no one even\nnoticed.<br><br>A holiday treat that may surprise everyone and stand the test of time.\nLike Stallone himself.\n"},
{"review": "\nAs a 50+ man I've got that heavy feeling in my chest when looking at\npast, it's nice, warm, precious and definitively gone moments, and past\nloved ones.<br><br>Although life is good with adult mans knowledge and experience, the\npast and letting go seems sometimes more tempting than fighting and\ngoing forward with fading health in a changing world, which you don't\nfully understand.<br><br>It felt good to see Rocky going through something alike. I've\ngrown old with Rockys and Rambos, and it's great that these sagas are\ndealing with the same principle questions that every one of us does.<br><br>Thanks!\n"},
{"review": "\nLook stop me if you heard this before but Once upon a time a poor\ndowntrodden lad from the wrong side of the tracks finds a purpose in\nlife and rescues himself from a dead end life and finds wealth and\nhappiness from the fruits of his efforts Sounds like every story ever\nwritten doesn't it and the only stand out is that it's yet another\nmovie in the ROCKY franchise . To be fair the Italian stallion isn't\nreally the focus of the story and the story revolves around the son of\nthe late Apollo Creed , a son has it happens he didn't know he had and\na son no one else in the universe knew he had apart from the producers\nof this movie . Did someone say contrived ? How about another word\nbeginning with C - cynical ? Yes that's the word we're looking for .\nCynical <br><br>But this isn't a film for cynics and it helps if you don't view this\nfilm through cynical eyes because like the original ROCKY from 40 years\nago . It certainly tries to be feel good and might just succeed on that\naccount if you're in the mood . Director Ryan Coogler does cast well\nwith up and comer Michael B Jordan in the title role with real life\nboxers such as Ward and Bellew as pugilists and it's probably the only\nfilm you'll see where the climax takes place at Goodison Park in\nLiverpool . No doubt the people who enjoyed the previous films in the\nROCKY series will enjoy this one but you've seen it all before many\ntimes even down to having the bad guys speak with British accents\n"},
{"review": "\nOh my god, this is probably in my top 3 best movies of all time,\nprobably first in boxing movies and probably first in sport movies.\nGod, this is the best movie. The lighting, the casting, the links to\nthe old rocky films, the music/soundtrack. Its all beautiful.<br><br>I watched this film because the trailer looked so good, and I fell in\nlove with Michael B. Jordan in 2K17 as Justice Young. So why not, I\nalways wanted to watch it so I decided to finally get it.<br><br>The romance, the breaking, this movie made me sad and excited and happy\nand actually confused (I thought it would end differently) at the\nending part, but you'll see what happens if you watch.<br><br>If you love Michael B. Jordan, watch this If you love action films,\nwatch this If you love boxing or MMA, watch this If you love good\nfilms, watch this If you love drama, watch this If you hate films,\nwatch this, to learn to love them.\n"},
{"review": "\nWith the history of the Rocky films and the underdog coming through and\nwinning, i hoped this would continue with the tradition of Rocky. This\nfilm has some interesting acting and choice of actors. The deaf girl in\nthe story makes me question the point of using her, i am just making up\nlines as i have to fill 10 of them to be able to submit this review so\ni can get to the point i want to make. Well the start of the film was\ngood and has some interesting references to the past. The film starts\ngetting intense after a scene in which a turtle in a tank is focused\non..... After this it becomes very intense and the plot goes different\nplaces, the ending was a fitting climax to the films history but should\nhave a alternative ending. Possibly even 3..... It does matter about\nthe film just the person that i was watching it with....\n"},
{"review": "\nI purposely did not read the reviews and kept my expectations very low\nsince this was the 7th installment right?! LOL After the first 2 the\nmagic was just not there. Wow! Didn't realize the emotional wallop that\nwas coming. Made me realize how emotionally attached one gets while\ngrowing up with \"Rocky Balboa\". Congrats to Ryan Coogler for the\nwonderful meld of the old Rocky with the new. Michael Jordan showed the\nmajor Hollywood chops to carry the main role with creative finesse and\ntalent. Coogler more than adequately captured the feel of big city\nPhilly just as in the first two movies. Sly more than ever deserved his\nOscar nomination and win, has had to be his best role since the Rambo\nseries. Such a surprise to see the depth in his face in his words and\nhis non words! Silence was truly golden between those two. Just loved\nhow they portrayed the tightening bond between Creed and Rocky and how\nthey ultimately ended up needing each other. Nothing felt corny,\nclichéd or false. Had the big 'ole lump forming last half of the movie,\nonly to finally have the \"pipe burst\" at the last scene. Job well done.\nHighly recommended.\n"},
{"review": "\nAdonis Johnson is the son of Apollo Creed, former heavyweight champion\nof the world and the man Rocky Balboa lost to in his first title fight.\nApollo Creed died before Johnson was born, so he never knew his father.\nJohnson is also a fighter and is 15-0, though in unofficial fights in\nMexico. Working in an office he decides to fight full time. He leaves\nLos Angeles and moves to Philadelphia, hoping to get Rocky Balboa as\nhis trainer. Eventually they team up, and slowly Johnson's career\nstarts to take shape. Meanwhile, the light heavyweight champion of the\nworld, Englishman Ricky Conlan, is looking for someone to fight...<br><br>Very good, and surprisingly so. I figured this movie was made to milk\nthe Rocky brand just one more time. The Rocky sequels were mostly\npretty empty, all-about-the-money, affairs and I expected the same from\nthis. <br><br>So I was pleasantly surprised when this was hardly an empty, style-\nover substance movie. The characters have depth, the background is set\nout very well and the plot development is good. Moreover, the\ncharacters are engaging and the story is interesting. <br><br>Another factor in its favour is the linking to the Rocky and Apollo\nCreed stories, and the passing of the torch to the new generation. It's\nsimilar to what Star Wars has done - reboot the entire series with the\nnext generation of characters, while having links to the original\ncharacters.<br><br>On that note, like Star Wars, the plot does take a familiar, recycled\nform, but it doesn't feel stale or overly unoriginal.<br><br>Solid performance by Michael B Jordan in the lead role. Good support\nfrom Sylvester Stallone and Tessa Thompson. Stallone got a Best\nSupporting Actor Oscar nomination for his efforts.\n"},
{"review": "\nI wasn't expecting this to even be good, never mind as good as it is.\nRocky is one of my favourite films, and this is pretty much what Rocky\nwould have been if it had been made today, but probably better than\nwhat Rocky made today would have been if I am honest.<br><br>It is not quite as good as the original, nothing ever will be, but\ndamn. Jordan can act, Stallone is getting as close to acting as he can.\nYou can sympathise with the characters and their motives. The film is\njust about long enough. The fight is as great as silly but watchable as\nany of the rocky fights. The fighters look more authentic than they did\nin the originals (which is because some of them really are boxers). Its\njust great.<br><br>I am glad I finally watched this.<br><br>The only problem really is that there are some things which in this age\nof social justice you cant really tell if it is just random, or if it\nis trying to be \"meaningful\". For example Creed's walk to the ring for\nthe main fight of the film sees him basically walking through a sea of\n100k jeering white people, the only non whites in the arena seeming to\nbe Creed's friends and ring crew.<br><br>But it is entirely possible that this is simply reading into something\nthat isn't there. And there may well have been \"social justice\" type\nsubthemes in the original films that I just don't get because of the\nage and geographical differences.\n"},
{"review": "\nFor a film about boxing CREED manages to stay toward the top of the\nlist. The story seems simple at first - The former World Heavyweight\nChampion Rocky Balboa serves as a trainer and mentor to Adonis Johnson,\nthe son of his late friend and former rival Apollo Creed \u0096 but in\naddition to playing on the old Stallone ROCKY movies it introduces some\nsolid ideas about genetic inheritance, goals, family, and fulfillment.\nDirected and written (with Aaron Covington and Sylvester Stallone) by\nRyan Coogler, the film manages to capture the language and atmosphere\nof the boxing set and while keeping the film grounded in reality and\nhonest emotions.<br><br>Adonis Johnson (Michael B. Johnson) lost his mother when he was young\nand would get into constant trouble and end up in foster care or\njuvenile detention. One day a woman (Phylicia Rashad) goes to see him\nand tells him that her late husband is his father - boxing great,\nApollo Creed. She would take him in and educate him but he feels the\nneed to be a boxer like his father. So he moves to Philadelphia and\napproaches Rocky Balboa (Sylvester Stallone) and asks Rocky to train\nhim. Rocky tries to talk him out of it but it's something he needs to\ndo. Eventually Rocky offers to train him and when he beats a great\nboxer and his connection to Apollo is revealed, he is offered a chance\nto fight a world champion and all he needs to do is take the name\nCreed. The resolution of the film is very tender and to share those\nfacts would be spoilers.<br><br>The cast is uniformly fine \u0096 both Johnson and Stallone offer first-rate\nperformances, as do Tessa Thompson, Phylicia Rashad, Ritchie Coaster,\namong others. This is a film that is more than just about boxing and\nthat is what makes is worth seeing.\n"},
{"review": "\nCreed win the night, Champ win the Title First of all, I like to start\nout that the acting was pretty good, especially ‪#‎Sylvester_Stallone‬\nwho is of course \"Rocky\" Indeed Creed is the 7th installment in the\nRocky franchise but this time focuses on Adonis Creed, Apollo Creed's\nson He wants to follow in his father's footsteps and is trained by\nRocky Balboa himself. More than boxing, this movie really goes into the\nrelationship between Creed and Rocky and how they both support each\nother when they most need it. ‪#‎Michael_B‬._Jordan is fantastic as\nCreed #Sylvester_Stallone as Rocky, I haven't words for him I got\nemotional on multiple occasions and still has the same charm from the\nold Rocky movies.. Good Job Team..\n"},
{"review": "\nAnother movie with Sylvester Stallone means another movie in my DVD and\nblue ray collection! And this movie continues one of the best movies I\nliked the most, Rocky! Rocky starts to train the son of Apollo Creed. A\nyoung kid with the spirit of his late daddy and the hunger what Rocky\nhad. A great movie! A movie of this time. But also a movie which shows\nthat Sylvester Stallone aka Rocky Balboa is getting older! Now in true\nlife this fighter has passed all qualifications for a well deserved\nrest in a retirement home. How ever Sly does go on! But in Creed Rocky\nis treated for cancer and keeps on fighting! Great movie, great acting,\njust loved to watch this one!\n"},
{"review": "\nIt shows realities about young people of nowadays. Take care of our\nsenior citizens, develop as human beings without forgiving our dreams. <br><br>In my point of view, this part of the story is shown briefly. Day per\nday about those challenges are intense. They are stronger than any\nfinal fight. The final fight represents freedom from this high\npressure.<br><br>It is understandable that day per day is brief because it's a story. If\nit isn't that way, it would be a report or documentary. The magic\nbegins from here. Know what is hell and get the heart on fire to take\nit. \"Take and keep moving forward\".<br><br>There are other sequels of Rocky which should nominate Sly for an\naward. However, appreciate to Academy Awards.<br><br>Perhaps, this spin-off deserves the same mention of an original story.\nSometimes results depends on working and not in their origins.\n"},
{"review": "\nTo me this is the second best Rocky movie out there. I mean I know It's\nreally more of an Adonnis movie, but you get my drift. To start, the\ncasting of Michael B Jordan as the son of Apollo Is perfectly done, I\nhonestly couldn't picture anyone else taking the mantle. Stallone\ncarries on from Balboa being brilliant on screen, even earning an Oscar\nnod, also hold up. I have to say I think the whole premise of Rocky\nbeing completely and utterly vulnerable for the first time due to\ncancer in this movie is the perfect way to take the character. Here is\na man who has long reigned as a somewhat king of the world type figure,\nat the end of his time, but before he goes he passes the torch to a new\nchampion. Amazing, just amazing. Mind you ... my only gripe with this\nmovie is that unlike in the previous Rocky movies, I saw next to no\nimportance of the antagonist in this movie. But other than that Creed\nis a brilliant way at breathing new life into the Rocky franchise.\n"},
{"review": "\nTo be honest, as a huge Rocky fan, I feared I was going to hate this\nfilm. With Rocky no longer the central character and certainly no\nlonger fighting I thought the film would be a buddy movie full of\nclichés from previous Rocky films. Fortunately those fears were\nunfounded and whilst the film could be said to follow the same Rocky\nformula, it could easily stand on its own if you knew nothing of the\nprevious movies. Stallone is great and Michael B Jordan is proving\nhimself an excellent actor. With talk of Creed 2 and even Creed 3 in\nthe pipeline it shows that most people thoroughly enjoyed the movie. It\nalso has a kicking soundtrack. Be sure to check it out.\n"},
{"review": "\nThis movie is not titled Creed - it's YouTube. That's it. A guy\nwatching YouTube. Unbelievable. It is as full of clichè, as I have ever\nseen in a quite some time. <br><br>Where's the seriousness ? Doing another movie on the Rocky Series, a\nstory that is worthless, and of course, poor acting, empty dialogue,\nclichè and zero effort. I can't believe the hype this gets, of course\nthe younger generation totally buys it, but for the press, the movie\ncolumns to have the lack of integrity to praise a movie built on\nlaziness and cllichés, is an embarrassment. Good thing this website\nshares a section for the people's appreciation. And guess what ? The\nStallone clan who by the way, employs Mel Gibson (finally banned from\nHollywood), has the nerves to call out the Academy jury urging,\nordering for an Academy award is this a joke ? Great sense and posture\nof modesty, do I have to remind Richard Burton never won any award ?\nShould we even dare compare both filmographies ? Don't think so.<br><br>The moment Stallone said \"what are you like a cousin or something\" and\nthe answer \"he's my faaaaaaaaaaaaaather\" - I said this is going to be\nhard to digest. <br><br>A stupid empty \"love story\", just because they had to insert it and boy\nthey did reach. All it was, was promotion for YouTube. The fights were\nterrible. That is NOT boxing. Gosh, all you have to do is copy a fight\nand that can't be hard there are ton on YouTube, a site that the\nwriters certainly know very well.<br><br>There has to be a sense of discipline, we need to stop approving clichè\nand poor scripts.\n"},
{"review": "\nAt times it really captures the feel of an 80s movie.<br><br>The central plot is striped down to the bare minimum. There's a strong\ncharacter arc - a redemption story. A looming bad guy in the\nbackground. And visually it's a nice film to watch, with some\nmasterfully shot boxing scenes.<br><br>But where it tries to be Rocky, it's not Rocky ... Rocky was the\nclassic every-man story. A struggling, maybe a bit slow, man trying to\nmake his way in the world... Creed is about an LA rich kid with a chip\non his shoulder. And where it could have been a boxing film, it focuses\nfar too much on the love interest - which is neither relatable or\nconvincing... Ultimately what you're left with is a love story without\nany romance, and a boxing story without a struggle.\n"},
{"review": "\nThe movie isn't that bad, but its basically just a remake of the\nprevious Rocky movies, particularly Rocky 1. Its better than the awful\nrocky 5, but you are better off watching the original Rocky 1 another\ntime instead of seeing this one. The story is the same, but the\noriginal Rocky has a lot more charm. <br><br>Stallone can play Rocky in his sleep, and Jordan does a decent job as\nthe new \"Rocky\". However the chemistry between the lead characters\nisn't that great. I found it hard to believe their quickly formed\nfriendship. The other characters don't get much screen time and are\nmostly unnecessary for the story. The relationship between Creed and\nhis love interest Bianca is even more unbelievable than the friendship\nwith Rocky. <br><br>In this movie Rocky is a tired old man that has no will to live\nanymore. Considering his greatest quality was never giving up its not\nexactly \"in character\" for Rocky. It just feels like they had to make\nRocky more pathetic as a part of rebooting the franchise with Creed as\nthe main character as they finally realized Stallone is too old to\nfight. I think i'd prefer it if they just made a standalone boxing\nmovie without trying to reboot Rocky without Rocky(Stallone).\n"},
{"review": "\nI decided to go see this movie because it got such high ratings. I\nwasn't far into the movie when I realized I'd probably wasted my time\nand money. I began to feel like walking out, which I haven't done in a\nlong time, but I stayed just to see how much worse it could get.\nEverything seemed to play out just about as I expected, with a cliché\nhere, and a bit of formula there. I saw nothing original or memorable\nabout the movie, except for how painful it was to sit through the whole\nthing. I won't even risk saying anything that even resembles a spoiler,\nexcept to say to go ahead and use a bit of intuition after watching for\n10-15 minutes to guess how it'll play out. If you're a thinking\nperson's movie viewer you'll probably be mostly correct, bored out of\nyour mind, and you'll also wonder why this movie got such high praise.\nI'm tempted to think it's a conspiracy... are there that many dullards\nout there?\n"},
{"review": "\nThis is just the thing that is rotten with the so called \"American way\nof Life\". You could forgive the very first Rocky-film, because,\nalthough it was about competition, it was also about a Young man with\nabysmal prospects in Life grabbing the one chance he had for a better\nLife. That film did not necessarily glorify competition. You could even\nsay that it was critical of a society, who gives a man no other option\nto better himself than to send Another man to kingdom come.<br><br>After so many Rocky-films now past, there is now so such excuse. It's\nall about knocking out the other guy even if the score in the end may\nread differently.<br><br>Jesus Words \"Love each other\" has nothing to do with the American\nsociety, which I prefer to call \"the swingy\", since it produces swines\nand not human beings.\n"},
{"review": "\nMovie sucked!!! Makes me appreciate old school fight movies instead of\nthis crap! Michael b.Jordan acting was mediocre at best. Sylvester\nStallone could of gone a better angle bringing his son to follow the\nlegacy,script was poor, and the scenes were poor, Story line was beyond\ncheesy, and predictable To me this movie tarnished the rocky legacy\nalong with rocky 6, Stallone retired already, or at least try something\ndifferent perhaps love story, I'm kidding, last few movies with\nStallone have been a let down, Bottom line, I wouldn't recommend this\nmovie, director seemed very amateur Pop corn and movie rates this 5/10\nPeople need to know how to give better reviews because the 8 they gave\nthis movie is ridiculous.\n"},
{"review": "\nI have now watched this movie for a fourth time and honestly it gets\nbetter every time. This spin off of the Rocky films does just as much\njustice as the originals do. This movie is not to similar to the first\nRocky movie as some may think making it an even better movie. It has\nthe coming up story, the training, and the fight but it all has a\ndifferent fell because of the characters. Michael B. Jordyn and\nSylvester Stallone do a great job of bringing in new emotions and great\nacting into another boxing movie. What these two do so well is blend\ntogether as well as building their character individually. There is a\ntime in the last fight that Stallone looks as intent as he did inside\nthe ring as he does outside of the ring. It feels different when he is\non the outside of the ring until this moment. As for Michael it he\nreally makes you feel as though he is truly Apollo's son even though it\nis just a movie. The best thing that I noticed is how they have a new\nscore for this character and not the old theme. It helps move with the\ncentral idea of this film which is this is Donnie's movie. I really\nloved this movie and for Rocky fans I really recommend this.\n"},
{"review": "\nIt's not the first time Rocky leaves the gloves aside himself but does\ntrain somebody else. But it's the first time the movie is called\nsomething different than \"Rocky\". And did it make a difference? It did\nfor Awards season that's for sure. I think we can all agree that a\n\"Rocky Part ...\" would not have gotten as much attention or nominations\nas it did being called \"Creed\".<br><br>So good move there, Sly, and good thinking too. Also good movie he\ncrafted and made possible. It may tick all the right boxes and therefor\nseem a bit by the numbers, but why change something when it works. And\nwhile not all things are as funny as Sly may have thought (i-Cloud and\nso forth, aiming more for the \"older\" crowd), it works overall and has\na certain quality to it. And the actors are really good in it\n"},
{"review": "\nThis is the best I've seen Michael B. Jordan. He gave this role the\ntype of fight that's necessary to stand your ground and hold your own,\ninside a ring. He wasn't amazing, but he did a great job, far better\nthan I thought he would... He showed growth, and that is a step in the\nright direction. He didn't win the fight... But, he won the night.<br><br>Sylvester Stallone was very natural and comfortable in his role as\nRocky... He was rock solid. His performance was mature and\nconvincing... Realistic and artistic at the same time, and though Rocky\nmay have been Donnie's mentor, it also felt as if Sylvester was\nMichael's mentor too, and you could almost feel it oozing past the\nfourth wall.<br><br>Ryan Coogler is young, true, but, he shows promise in this film. The\ndirection and story though at times it would creep along, Creed, still\nremained strong, on it's legs. It's not a complex screenplay.\nFriendship, Love, Loyalty, Rite of Passage, and the execution,\nheartfelt. Tessa Thompson won me over too effortlessly... She was just\ntoo gorgeous, and her performance was just as attractive. She owned the\ncamera and was in charge of her character.<br><br>Jordan, Stallone, Coogler and Thompson were a compelling force, in a\njourney of discovery and definition, with inspirational elements that\nhit home... However, I feel this couldn't have been accomplished as\nwell as it was, had it not been for Ludovin. The score is a pool of\nbeautiful rhythmic, melodic and harmonic waves, that you can't help but\nwant to be immersed in.<br><br>Creed is a story we already know, but, as with any other story of this\nnature, if it fails at being motivational and just, awe- inspiring, it\nultimately loses whatever purpose it was intending to achieve. Creed,\ndid not fail in doing this.<br><br>7.9/10.\n"},
{"review": "\nA lot of hype and buzz around this film, with it mentioned around the\nOscars to the extent that one could almost forget that it is just a\nRocky sequel. This is more or less what it is though, albeit that the\nfilm does it well. The formula is played out as you expect as we have a\njourney which is both physical and emotional, with plenty of montage\nmoments, and of course the traditional big fight at the end. In doing\nthis the film is nicely judged to play on the emotions not only for the\nfilm but also for the previous ones. The writing is unsurprising\nthroughout, but it benefits from a good cast \u0096 in particular a very\nfine lead from Jordan, who is likable and engaging.<br><br>Those wringing their hands over him not being nominated for best actor\nperhaps are mistaking charisma for acting \u0096 he has both but it is not a\nbrilliant performance, although he has some in his past and probably\nmany ahead of him. Stallone plays the nostalgia and sentiment well,\nadding to the charisma, while Thompson is sparky and fun albeit in a\nhugely familiar role for this type of film. Mostly the film rides the\nclichés well, making the film work thanks to the stars involved. The\nwriting limits it, with scenes mostly spelt out for the viewer, but it\nhangs together well. The boxing action is mostly good, with the single\ntracking shot bout being the most engaging. The finale is solid but is\na little lacking in thrills, even if it does do the job well enough for\nthe level which the film is mostly pitched.\n"},
{"review": "\nCreed is the seventh movie in this franchise, which started way back in\nnineteen seventy six and has seen ups ( Rocky 1, 2 and Rocky Balboa),\njust enjoyable ( Rocky 3 and 4 ) and downfalls (Rocky 5). And Creed is\nin my opinion the best since the first and is my personal favorite. In\nshort Creed is awesome and I was amazed that Stallone really this time\nacted, for real in constant wit what we have seen from him in resent\nyears, for instance the Expentables series.<br><br>So this film follows Adonis Creed, who as the name reveal is Apollo\nCreed's son and he wants to become a boxer like his late father, but\nhere is the nice part : He wants to be famous by his own and not by his\nsurname!! So he asks Mr Balboa of training and advises. One bonus fact\nis that is depicted as a fun of the Rocky lore, like we are, which\nshows that the writers wanted him be rel eatable and not be a puss over\nlike with Jurassic World. Now the secondary characters like Creed's\nmother are human in their reactions ,but have their time to make a joke\nwhich after you see the flick, you will remember it.<br><br>The training and fighting scenes were expertly choreographed and\nMicheal B. Jordan looked the part . But the person who stole the show\nin the flick was Rocky himself ,who now is more a father-mentor figure\nthat the lead and this fitted him ,because lets be real ,Stallone you\ncan not be a lead in a sport-action flick in your late sixties! <br><br>If this is the end of the Rocky saga or the beginning of the Creed, is\nas yet ( June 2016) unknown. In any case is a strong intro to the story\nline of this franchise.\n"},
{"review": "\nI did like the previous entry of this series (\"Rocky Balboa\"), though I\ndid think that Sylvester Stallone had taken the series as far as it\ncould go. But in this entry, thanks in part to new director and co-\nwriter Ryan Coogler, we get some freshness and a new angle to look at.\nAnd the end results are pretty well done. Yes, there are some\npredictable elements in the movie that you'll be able to guess will\nhappen a scene or two before they unfold. But as familiar as some parts\nof the movie may be, the movie at all times remains competently written\nand directed; each moments does play out in a convincing manner that\nyou'll believe could happen in real life. The acting is solid by all\nthe participants, particularly Michael B. Jordan and Stallone. The only\nreal problem I had with the movie is that it does play out a little too\nlong and stretched out - some slight tightening would have helped\nthings. But even with that nitpick, the movie is still well worth\nseeing.\n"},
{"review": "\nAdonis 'Donnie' Johnson (Michael B. Jordan) is the illegitimate son of\nboxing champ Apollo Creed. He was born after his father's death in the\nring and spent his childhood in juvenile detention until rescued by\nMary Anne Creed (Phylicia Rashad). He fights in Mexico and quits his\noffice job in favor of boxing. Mary opposes it and he's prevented from\ntraining. He seeks out Rocky Balboa (Sylvester Stallone) in Philly to\ntrain him. He falls for downstairs neighbor Bianca (Tessa Thompson).\nChamp 'Pretty' Ricky Conlan injures his opponent during a media event\nand takes on the newcomer for the money.<br><br>This is going back to the original. Adonis is the new Rocky. He's got\nthe inner fire. He's got the sweet romance. I am glad that Rocky\nfinally puts up his gloves for good. This gets back to its roots with a\nwell-written story and compelling characters. There is a big fight\nmidway in the movie that is one continuous shot. It reminds the\naudience of how new the original was with its fighting sequences. The\nsequence is a master work and beautiful to behold. This is a good\nrejuvenation and a new jolt to an old franchise.\n"},
{"review": "\nCreed honor and the first movie Rocky , higher than 2,3,4,5 and 6 , the\nplot is very interesting , recalling to the Rocky 5, where the Rocky\nturns coach, only this time the film is well done , other than Rocky 5\nwhich is the worst of the franchise, and one of the worst movies of all\ntime , Michael B. Jordan interpret Adonis Creed son of the legendary\nApollo Creed , his performance is good , even though I do not like much\nof the personality of the period, I found it very jumpy , the film is\nvery reminiscent of the first is the second film in many scenes , I\nfound cool the assembly of the film, showing details of each fighter,\nthe soundtrack is as good as the original, and the participation of\nRocky in the movie it is the best thing , Sylvester Stallone makes his\nbest performance in his career, much deserved Oscar , unfortunately did\nnot win, the more won the Golden Globe , Creed is the best movie of the\nfranchise after the first Rocky. Note 7.8\n"},
{"review": "\nOne of the best movies of 2015. One of the best Rocky movies. One heck\nof a movie that will keep you watching until the credits are over. This\nmovie is more of a showcase of what a great director and excellent\nactors can do. This movie is all about Michael B. Jordan. Jordan pretty\nmuch crossed over into starhood thanks to this masterful film. There a\nmoments where you can see Jordan becoming the Creed from the first few\nRocky movies. A lot of people complain about this movie being a ripoff\nor remake of the first Rocky movie and to those people I say, close but\nno cigar. This is very much its own movie. Only the ending of the final\nfight and Creed's character getting the major title fight mirror the\noriginal movie in some ways. This is very much its own animal and a\nmovie that stays with you. Sylvester Stallone is great in this movie\nbut a little overrated. I didn't think he deserved to win any awards\nfor his performance. He was great in the role but he's no Mickey, how\ncan he be? The real star of the movie is the director, Ryan Coogler. He\nhas an eye and uses it well. I'm more than happy that he will be\ndirector Black Panther. Hollywood needs to stop getting this stupid\ndirectors who know the right people and they need to get directors with\nreal talent like the director of this masterpiece. Over and out.\n"},
{"review": "\nThe most damning evidence that Hollywood dismisses films predominantly\nfeaturing minorities is not that \"Creed\" was mostly overlooked at the\n2015 Academy Awards but that it was one of the only examples of\nminority films made that year that people could dig up to make their\npoint. If \"Creed\" is the best they could do, then there really is a\nproblem in Hollywood, but the problem isn't that the Academy doesn't\nnominate black artists -- it's that there aren't enough good movies\nmade by black artists to nominate.<br><br>\"Creed\" is one of the most pedestrian, obvious, and dull movies I've\nseen in a long time. Not a single thing about it deserved to be\nnominated for an Oscar, though ironically Sylvester Stallone, who was\nnominated and drew the ire of Oscars So White protesters for the\nAcademy's gall in giving the film's sole nomination to the only white\nperson in it, is the best thing about it. The film is so by the numbers\nthat I only half-way paid attention to it starting at the half-way\npoint and still called the maudlin ending from a mile away. You don't\nspend 2 hours shoving a \"will he or won't he live up to the legacy of\nhis father\" story down our throats unless you intend for the film to\nanswer that question with a resounding \"yes\" in its last moments.<br><br>To be fair, I was never really that into the Rocky movies, so maybe I\njust wasn't the target audience. But I do remember the first \"Rocky\"\nenough to know that its underdog story, while still pushing all the\nrequisite emotional buttons, felt genuinely inspiring, while \"Creed\"\nfeels like warmed over sentiment sprinkled with a dusting of nostalgia\nfor the Rocky series.<br><br>Needless to say, not exactly a knockout.<br><br>Grade: C-\n"},
{"review": "\nTo make a film in the dramatic spirit of the first 2 \"Rocky\" movies\n(before the character drifted into superhero territory) but to make it\nstill a contemporary film is a neat trick and the work pulls it off\nnicely. Since the late 1970's boxing has drifted out of the main stream\nand again become a niche sport (without Google-ing whose the current\ntop contender for the heavyweight crown? Or for that matter whose the\ncurrent heavyweight champion?). The film reflects the new reality with\nMichael B. Jordan's Adonis Creed working the Mexican boxing circuit and\nholding down a job before leaving to find roots beyond those provided\nby his father's true wife. While Jordan looks little like Carl Weathers\nand his dower serious mien tracks not at all with Weathers' portrayal\nof the elder creed as a charismatic showman who dances with the late\nJames Brown, he physical command of the sport makes for a solid if not\ncompelling leading man outing. Award shows have already given kudos to\nStallone for committing to a now humbled, hampered Rock Balboa. The\nsomewhat tacked on final scene of him leaning on Jordan's character to\nmake it to the top of the Philadelphia Museum of Art steps to see the\nstatue of himself that institution longs to rid itself of makes for one\nof the most compelling in the film. The film itself does well with\nexploring themes of fatherhood, defiance vs. resignation and identity\nbut less well with actual plot which follows the Rocky formula like an\n8 year old following a Martha Stewart recipe. In short, an entertaining\nfilm in it's own right and a nice addition to the series.\n"},
{"review": "\nThere were doubts about this movie, but it turned out to be a sure hit.\nIt was a great way to continue the Rocky story, but also start a new\nphase that could carry on for years to come. It is ironic that this\nstory of Creed began where Rocky began in the original.<br><br>It was different to see Rocky coach rather than fight. But in a way he\nwas still fighting. But it was not physically it was instead for self\nand legacy.<br><br>Creed was a troubled child growing up. He was always getting himself\ninto fights with everyone he came across. He was his father's son. The\nfight was in him, and he just needed the proper guidance to learn how\nto control it. So as Rocky was helping Creed train to fight, Creed was\nhelping Rocky keep his name alive. The majority of the movie was\nrevolved around the character development of Creed. But it was well\nneeded if this story is going to continue with sequels.<br><br>Although Creed was robbed of his fight, he sure did show everyone what\nhe was made of. Everyone thought that he was a fake Creed and they\nthought that he could not live up to the level of gratitude that his\nfather Apollo Creed had reached in the ring.<br><br>It was good to see this movie end where Rocky began his journey. It was\nan excellent way to pass the torch on and keep the legacy going.\n"},
{"review": "\nAn amazing story turns the life of a young man from from nowhere to an\nadventure thanks to the help of an old friend of his father and blood\nof boxing running through his veins.<br><br>Nicolas Stern the executive producer and one of the many producers this\nmovie had. All the producers did a great job with this movie which was\nreleased on January 19,2015 in Liverpool and November 25, 2015 in the\nU.S. In this story a young man named Adonis has been getting in fights\nall his life, but he actually gets a chance to make it worth something\nwhen he finds himself a mentor that will help him become great.<br><br>The setting of this story is mainly around boxing gyms and Adonis being\naround his mentor. This is effective because Adonis grows and connects\nwith both practicing and becoming better and his mentor and because of\nthat Adonis is able to have someone he can trust both training him and\non his corner of the ring.<br><br>The creators of this movie wanted to show us that no matter how many\nchallenges this young boxer came across and no matter how many times he\ngot hit in the ring; he never gave up. He always kept pushing, kept\ngetting up, and kept punching back. All that is what really matters\nwhen Adonis faces his greatest challenge.<br><br>This is one of the best movies I have seen and it will be one of the\nmost memorable. This is a movie that I would absolutely recommend\neveryone to watch.<br><br>9/10\n"},
{"review": "\nCreed. Is the first Stallone Rocky movie to not be written or directed\nby Stallone. Creed carries the spirit of Stallone's Rocky. and the\nVision of Creed's writers and its director. And Creed has a powerful\nvision. Adonis Johnson is the son of Apollo Creed. Apollo had a affair\nthat resulted in Adonis. Adonis has never met his father . Having been\nborn after the events in Rocky 4. and after his mother dies Adonis is\nthe victim of the system. until Apollo's wife tracks him down. And\nbrings him in. She raises him to be a Creed. And Adonis like his father\nhas the burning desire to be a fighter. He seeks out the man that beat\nhis father for the Heavyweight Championship all those years ago. Rocky\nBalboa is older.maybe wiser. His friends and family are all gone. but\nwhen Adonis shows up on Rocky's doorstep asking for Rocky to train him.\nIt's the first steps of a journey that'll take them to life death and\nredemption and love. Rocky and Adonis form a family. Adonis calls Rocky\nUncle. because after all is said and done. Rocky and Adonis have no one\nelse but each other. And their love for one another is going to see\nthem thru some harsh challenges.<br><br>A powerful story given life by incredible acting. Creed isn't another\nRocky movie. It stands on its own and needs to be its own franchise.\n"},
{"review": "\nThis movie was such an emotional revival!! I loved all the other\nRockys. Silvester Stallone is such a big, great actor, despite the\npassage of years. Michael Jordan has a spectacular performance through\nout the movie. I like the Rocky- Adonis duo, such a great relationship,\nfamily like. The movie was emotional , it brought me to tears at times.\nIt had a lot of passages from previous Rockys, which was kinda nice.\nAlso the Appollo scenes are there too. The fights were perfect length,\nnot to much blood, not too intense. The ending was pretty perfect and\nalso the pace of the movie was good. I loved that it lasted 2 hours and\nkept me on the edge of my seat all along. It's worth seeing !\n"},
{"review": "\nRyan Coogler's Creed feels more like a reboot, as good as can be, of\noriginal Rocky than like the next part in the Rocky series. Creed\nbuilds on Rocky movies' blueprint, adding emotional depth and family\ndrama to the mix. Creed is more of a family drama than a sports drama.\nEmotional layers are slowly and expertly unraveled and emotional\ngravity reaches its zenith when Adonis Creed confides to Rocky, in the\nlast fight, that he wants to prove to the world that he is not a\nmistake. Still Creed doesn't fail to pack a punch in its realistic,\nintense and close-up shot boxing and training sequences, during which I\nfelt my adrenaline rush frequently. Character's depth and acting is\nuniformly excellent, except for Bianka's, whose role though necessary\nfelt forced. Adonis Creed's and Rocky Balboa's relationship is as\ncentral to the plot as is Creed's journey to make his own legacy. Creed\nhas enough flesh to make its own legacy, while it has enough references\nto pay homage to the Rocky series. I strongly recommend Creed to drama,\nsports or otherwise, lovers. To others, watch it if you have nothing\nelse to catch on.\n"},
{"review": "\nRocky Balboa is back and this time as old as the hills and the owner of\na restaurant in Philadelphia. Rocky's opponent Creed is long gone but\nhis illegitimate child Adonis Creed lives. He decides to become a boxer\nlike his father and looks up Rocky in Philadelphia and asks him to\nbecome his personal trainer. Creed is the first time Rocky is back on\nthe big screen since 2006 and makes it the seventh film in the series.<br><br>Boxing movies is often very much the same when it comes to the story\nand I personally think it needs something else besides the boxing to\nreally raise these films above normal. Like a dramatic problem behind\nthe sport. Creed succeeds in doing this. We really feel for the son of\nCreed and understand why he does what he does, because the main focus\nis the drama behind the sport. In the end it doesn't really matter\nwhether he wins or not because the personal revenge is more important\nthan the sport itself. The decision not to let Rocky box but become a\ntrainer, is good and should perhaps have been made in the last film 10\nyears ago. Sylvester Stallone has probably not portrayed Rocky this\ngood since the first film in 1976.<br><br>Judging from the length of Creed, it certainly follows today's trend in\nlength with its 2 hours and 13 minutes that actually makes it the\nlongest Rocky film to date. Despite its length, the story goes on and\nis fairly exciting all the way through. It is a classic setup that\nstill works, mostly because they polished and remade Stallone's Rocky\ninto an aging mentor. I think that is the main reason why this film\nworks so well. It is a personal revenge for the film series and also\nfor Stallone who actually won a Golden Globe and received an Oscar\nnomination for his role.<br><br>David Lindahl - www.filmografen.se\n"},
{"review": "\nIt's a drama movie about the legacy of Apollo Creed, directed by Ryan\nCoogler, with an incredible cast with Sylvester Stallone, Michael\nB.Jordan and Tessa Thompson, and this movie was released in October\n2015, in the USA.<br><br>What about the plot ? It's a story about the son of Apollo Creed, the\nfamous boxer who died during a box fighting. Then when his son grew up,\nhis son decided to meet Rocky Balboa, an old friend of his father, a\nfamous boxer too, to teach him how to fight and then he could honor his\nlate father.<br><br>Michael B. Jordan is very talented at his way to acting as Adonis\nJohnson, the plot was based on a difficult childhood, and a sinuous\nlove story, we really enjoyed the score of his movie too, who was all\naround US RAP, and also the story becomes very gripping with the acting\nof Michael B. Jordan and the unforgettable Sylvester Stallone.<br><br>For the audience, this movie was totally unexpected, and they qualified\nthis movie by a \"must-see\".<br><br>In my opinion, i really enjoyed the end, because it means that you must\nnever give up in your life !<br><br>That movie is like a life lesson for the youth and we totally recommend\nyou to watch this amazing movie.\n"},
{"review": "\nAdonis is the son of a ex-boxer and he wants to take the same path as\nhis father so he trains to become the new champion. For this he seeks\nhelp to Rocky Balboa, his father rival in the past. His trainer soon\nhas health problems because of his age and this may be an issue in his\npreparation. Also another distraction appears when he begins a relation\nwith her neighbor, Bianca. Adonis won't let anyone or anything in his\nway and wants to make his late father proud of him. He is ready for the\nbiggest night and match in his life when he is face to face with the\ncurrent champ Ricky Conlan. But will he manage to defeat him?<br><br>Usually I do not like box or movies about this sport, but this truly\nwas a pleasure to watch because in two hours you see only 30 minutes of\nbox and doesn't have too much violence in it. The actors did a very\ngood job and wasn't an easy one. What I learned from this one was that\nin boxing, if you want to win you do not have to throw punch after\npunch but you also need a strategy, and a film in witch I found out\nabout something interesting is a delight for me.<br><br>It has been a while since I rate 7 a movie but this one deserves it for\nthe emotions you feel along with the actors. Great job!\n"},
{"review": "\nI wasn't going to watch this with high hopes after rocky balboa but\nthought \"hey man it is rocky, give it a chance\", It's good and what I\nexpected. Well maybe I expected a little more, but on the whole a\ndecent film, if rocky made him do the exact training ( minus the meat)\nthat he done and made it up the steps at 5 in the morning without the\nyoung team on a bus it would've worked better. <br><br>This has the between 5 and 7 mark written all over it. <br><br>All you people that rate a film 1 out of 10 obviously aren't into\nwatching movies!. <br><br>Lowest I could physically rate a movie right now would be 3.\n"},
{"review": "\nRocky was the first film I ever watched on VHS as a child. I remember\nmy brother bringing home the huge video recorder and us all sat round\nthe TV waiting for the film to start. Pure movie magic. 40 years on the\nmagic is recreated but with a new direction for the franchise to the\nhead in.<br><br>A young boxer named Adonis Johnson comes knocking on Rocky's door. It\nsoon becomes apparent that the young man is actually the son of Apollo\nCreed. Rocky's rival turned best friend. Played by Michael B Jordan he\nsoon forms a bond with the old champion and Rocky agrees to train the\nyoung prospect. The storyline may sound familiar if you've seen the\nabysmal Rocky V.<br><br>Unlike that particular film this movie has real heart and under the\nguidance of young director Ryan Coogler all cast members bring out\nsuperb performances. Stallone in particular is superb. The scene in the\nlocker room really does bring a lump to your throat. Over the years he\nhas almost become the character and plays him with such conviction.\nSylvester Stallone missed out on an Oscar for his performance for the\nfirst Rocky and recently was robbed for reprising his most famous role.\nHis performance in this film is really that good. This time playing an\nolder more fragile version of the famous character. Lets not forget\nthat this is a Rocky film just reinvented for the new generation. So it\nhas all the key Rocky moments you want and expect. It may not be as\ngood as the original film but it is a superb entry into the expanding\nuniverse of the Rocky franchise.\n"},
{"review": "\nI'd give this a 5.5 if I could but am feeling generous. I expected big\nthings from the movie, and was very disappointed. After the first 30\nminutes I was wondering when the plot was going to go somewhere or if I\nshould just give up on the film. I stuck it out but it didn't get much\nbetter.<br><br>Stallone and Jordan do a good acting job, but it's not enough to save a\ndragged out, pretty predictable story. The love interest doesn't come\nacross strong - she is no Adrian.<br><br>The build-up to the final fight is just typical boxing movie - see some\ndrills, but nothing unique in the training scenes - just some rehashes\nof Rocky drills and no catchy events.<br><br>After writing this review, I should probably rate it even lower!\n"},
{"review": "\nCreed is the seventh instalment in the Rocky franchise but this time\nfocuses on Adonis Creed, Apollo Creed's son. Adonis Creed is\nspectacularly played by the perfectly cast Michael B. Jordan in what\nmay be his best role and performance to date. The movie once again\nfeatures Sylvester Stallone as Rocky Balboa - Stallone's performance is\nsurprisingly effective; he embodies the character perfectly after Rocky\nBalboa in 2006, ten years ago. His acting in this movie is far better\nthan you might expect from him at this stage, but you will be\npleasantly surprised - he won Best Supporting Acting at the Golden\nGlobes for a reason. Tessa Thompson plays Bianca, Adonis' love\ninterest, who gives a deceptively complex character that adds something\ngreat to the movie. <br><br>What the movie gives for the first half is familiar fare for these\nmovies - displaying the well earned nostalgia that these movies have\nearned - but at the same time director Ryan Coogler manages to revivify\nthe series, and through his strong and clearly talented directing makes\nthe movie stand alone as a genuinely strong dramatic piece. For long\ntime fans of the series, this movie will be particularly emotionally\npotent, but even to new time fans this is will still be a strong movie.\nCinematographer Maryse Alberti does a great job shooting the movie and\nin his own right adds something excellent to the movie (an almost five\nminute boxing scene which is all shot in one take is particularly\nmesmerising).<br><br>In conclusion, Creed is an excellent movie - the best since the 1976\noriginal, which can, in a large part, be put down to Ryan Coogler's\nfantastic directing. The characters are very strong, in particular\nMichael B. Jordan's, and the acting also great. It does justice to the\nprevious movies while at the same time trying something new and\neffective.\n"},
{"review": "\n1.5 min in and I'm already distracted by the direction (1 min are the\nproduction logos, BTW)<br><br>Alarm is sound, kids go the wall, sit on the ground and raise their\nhand - only to hear the officer say: \"on the ground, show your hands\".\nIt's so obvious that this take was done so many times, that the kids\nalready know what to do so they do it automatically. The guy playing\nthe officer just says his lines, without even noticing that it's not\nrelevant anymore. After that, the officer just stands without doing\nanything - because he didn't receive any other lines or instructions\nfrom the director.<br><br>Continuing the shot, the camera goes to the next room. It's supposed to\nbe a fight in progress (that's why the alarm was sound), but the actors\nare just waiting for the camera guy to enter the room and only then\nstart the fight.<br><br>My god, what a sloppy direction. And it's only the FIRST shot of the\nmovie!<br><br>This movie just goes on and on. It's way too long, too predictable, too\n\"by the book\". You really need to be a Rocky fan to enjoy watching the\nsame movie you've seen so many times before. You'll forget this movie\n10 minutes after watching it.<br><br>Stallone and the lead actor are OK in their role.\n"},
{"review": "\nWhat a let down. Contains nothing that made the first two or even the\nfirst four so great. Zero motivational factor,zero inspiration. Score\nis almost non existent. Fighting is just boring.Obviously they were\naiming for a serious drama,a movie that can stand on its own but in the\nend we just got a very boring film that you wont even think about\nre-watching.The only positive thing were some of the locations the\nmovie was shot at. Stallone was praised as doing a great job,he did\nOK,nohing spectacular about it.Its now one day since i have seen the\nmovie and i have forgotten most of it,its that bad.A very depressing\nexperience.\n"},
{"review": "\nWell... I really don't get why this movie thrilled everybody. It seems\nto me that everyone starts digest whatever American product is served. <br><br>Anyway, if all is needed in order to get a prize (though being an actor\nincapable of acting) is to pretend having white hair and cancer, then I\nsee why Stalone took the awards!!! <br><br>This movie disclosed something else: growing old and becoming a veteran\ncan give you awards regardless the quality of the movies you have made.<br><br>What's more, Stalone seems to confuse real world with the artificial -\nmovie reality, he probably even thinks that Rocky really exists! When I\nsaw the statue of him in the city, that was the impression I got. <br><br>If you want something superficial and light, then that's your movie.\n"},
{"review": "\nHonestly, I was looking for the 7th film in the 'Rocky' series, so this\nspin off was totally unexpected. But it is the right thing since the\nRocky Balboa is getting old. Besides, in this reboot era, keeping\nfranchise alive and leaping into the next generation was a very smart\nmove. By doing this, they're keeping the original series fans with them\nto back it. I hope this will only get going like the Bond movies, since\nthe young star, Jordan has another 30+ year potential to continue the\n'Rocky' legacy by delivering some hits in his belt.<br><br>I don't know how they have done it, just kept everything so simple yet\ndelivered a successful movie. The director of 'Fruitvale Station' and\nits actor Jordan's second successive run. I wish the combo return for\nthe third time for another grand scale flick. Of course Stallone's\npresence made a big difference, but the way his character was\nportrayed, I feel the next film will get more emotional, especially\nbetween Rocky and Adonis like Rocky and Micky. And I'm also hoping for\na bit better romantic tale on the side.<br><br>I grew up watching 'Rocky' movies, so I wanted badly it to be at least\na decent, but it is a fantastic flick and I definitely suggest for\nthose people like me. The youngsters as well can taste the new\nbeginning in the Rocky legacy. CREED is the new ROCKY. The blueprint\nfor the screenplay was exactly same as the original movies, even the\nmusic was very comparable yet everything was updated to the current\ntimeline. Now I'm looking for a follow-up in the next 3 years.<br><br>8/10\n"},
{"review": "\nAs a huge Rocky fan, this latest installment just missed the mark for\nme a bit. The fact that this was the first entry in the Rocky franchise\nnot penned by Stallone was apparent. Part of what made the first couple\nRocky movies for me (namely the first 2) was the dialogue written and\nperformed by the characters. Sure, they got pretty campy in the later\nentries and ended up nearly being a parody of itself by the end in\nRocky 5, but there's no denying the dialogue. This film was grittier\nand much better than the 4 and 5, but paled greatly to the first two.\nTo this day when watching 1 or 2, after seeing them for the umpteenth\ntime, I still find myself rooting for the Rock and feeling inspired. I\njust didn't get that vibe with Creed. All-in-all, it's much better than\n3,4 and of course 5, but it's no where no 1 or 2. If you don't compare\nit to the original franchise and judge it as a stand-alone boxing movie\n- it's average at best. Southpaw and Cinderella Man beat Creed by a\nunanimous decision.\n"},
{"review": "\nI don't want to say it's a good movie or a bad movie, it's not that\naction packed. It wasn't boring. They made Philly look plane and no\ncolor and with buildings looking trashed and with trees looking like\nthey went threw winter. I just hated that. The plot is OK though. Also\nI hated why they had to make Rocky die so early, I loved the rocky\nfranchise and I know it has to end, but can they make his death a bit\nmore reasonable. Like what were they thinking, making Rocky die because\nof cancer, that he doesn't want to cure.<br><br>I want to refuse this is the last movie, but I want it to end because\nevery time I see Rocky, he looks like he went threw hell. i'm just not\nhappy of Philly and the people who walk in it, if they make a another\nmovie make sure the background has more color and the people look more\nbetter then the Hood. I'm just happy about the end product.\n"},
{"review": "\nRocky is a landmark film. A great. The series slowly declined, trading\ngritty characters and dialogue for hollow blockbuster shenanigans. The\nfilms in the series gradually got worse, culminating in V which was\nbasically pants. Rocky Balboa saw a return to form in my opinion. Once\nagain putting character and setting for spectacle. I was hoping that\nCreed would do the same. To follow the rejuvenation that took place\nwith Balboa.<br><br>Sadly not. In my opinion this sits midway between the two. It dips into\nthe world of believable characterisation and plot but ultimately keeps\nthe Hollywood schmaltz in spades. I deliberately read nothing about\nthis film before seeing it but could have predicted it anyway. As it\nrolled out on screen everything was predictable and a tad bland. And\nthe main protagonist, Creed, had none of the natural charm and charisma\nof Rocky. There are occasional sparks of chemistry between Balboa and\nCreed but nothing to write home about, and nothing to keep you\ninterested for the duration of the film. Toward the end I wasn't\nparticularly rooting for or against Creed. I just wanted the\nproceedings to draw to a close.\n"},
{"review": "\nRocky is an ageless underdog story told in simple yet approachable way,\nthe best thing about it is it's also true story about Stallone. Creed\ntaps into the legacy of the franchise while also presenting new blood,\na sort of passing of the torch by Sylvester Stallone. This is drama in\nits purest form and with the inclusion of spine tingling nostalgia,\nthere's no way audience wouldn't get emotionally pumped when the young\nCreed trades blow while familiar soundtrack roars in the background.<br><br>This is the story of the son of Apollo Creed, Adonis (Michael B.\nJordan) who is trained by Rocky (Sylvester Stallone). It's one the best\nmentor-student relationships on silver screen, which feels amazingly\ngenuine and perhaps the best acting Stallone has given in a while. It\nwill resonate to audience, old and young, infectiously inspiring in\nevery sense.<br><br>Fighting is the most elementary form of drama, you have the protagonist\nand antagonist as they square off with their fists. Nothing can be\nsimpler, yet the presentation of Creed takes advantage of the depth of\nRocky's franchise then adds a crafty visual to display the struggle of\nthe characters, both in ring and real life.<br><br>Cinematography is pleasantly brilliant, there are moments when the\nfights are done so viscerally gorgeous or in one prolonged shot that\nit's nearly impossible not to be invested in them. The view of Philly,\nso familiar with fans is shown with care, it is a homage to the\nenduring tale as well as an authentic effort to pass it to new\ngeneration.<br><br>It's been a long time, perhaps since Hugo, that a movie is delivered\nwith such love. Creed is a presentation of utmost care for the\nnamesake, respect for its sport origin and visual of brutal elegance.\n"},
{"review": "\nIf you expect this to be as good as any of Rocky you will be\ndisappointed.A day before watching it,i have seen Southpaw-it actually\nmade me cry in some scenes. Creed? Nada, it didn't moved me at all, i\nhave tried to blame it on my mood, but i couldn't lie to myself . Drama\n, action, motivation, have no power in this movie , flat film with flat\nacting performances. Nothing really happens,not sure why the positive\nfeedback from so many users - i like Stallone myself,but in my opinion,\nJudge Dredd is better than this and it has only 5.4 Overall,an\noverrated movie,maybe just because Stallone is old enough -skip it if\nyou want to remember Stallone as a decent actor.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"Creed\" (2015) is everything a one could hope from \"Rocky\" movie and\nmore, much more. It tells a story of a new face as well as continuation\nof our below boxer from Philadelphia. <br><br>Acting was very good by all involved - leads Michael B. Jordan and\nSylvester Stallone are above good - they are great in this picture,\nwith Sylvester Stallone absolutely deserving Golden Glob nomination -\nit's going to be hard to get Oscar node, but lets hope on this one,\nthis is by far the best Sylvester Stallone's performance since \"Cop\nLand\" and very first \"Rocky\" movie. But he is just a supporting\ncharacter in this movie. The new star is Adonis \"Creed\" Johnson. Hope\nto see future movies with him. <br><br>Overall, \"Creed\" is a great movie. It has great acting, amazing\ndirection (one boxing scene is done in one-shot take - never seen that\nbefore). Directing is actually on the same level as acting - Ryan\nCoogler does a magnificent job in every scene - it looks and feels\nreal, not just another sequel or spin-off, it is a real life on the\nscreen. Boxing scenes are all (and there aren't many of them in the\nmovie) great - last one (and you know there will be the last one \"good\nguy\" vs. \"bad one\") is not predictable (which actually is a bit, but\nthat is not a complain to \"Creed\"), very plausible and realistic. Can't\nrecommend this movie higher - \"Creed\" is simply a winner.\n"},
{"review": "\nThis was so boring and sad in a fantastically disappointing mixture.\nWhat used to be original is now totally shallow and centres, for some\nreason, around an equally boring love story. I mean.. really? Why do\nthey have to have boring love stories in a fighter movie? Stallone is\nboring and completely uninteresting. Adonis and his girlfriend are\nboring. Even the few fighting scenes there are - are boring. The focus\nof this film is totally wrong - a fighting movie that focuses on a love\nstory instead of training and fighting.<br><br>Hence this movie has absolutely no value whatsoever. The only good\nthing about it is that it was not called \"Rocky\" because that would\nhave thwarted that good name.\n"},
{"review": "\nDo not expect another Rocky movie. \"Creed\" was not the 7th in a\nseries!!! This movie was today's answer to a new inspiration. It\npersonified the spirit of what \"Rocky\" represented. The heart and soul\nof a fighter!!! This time I saw a different actor in Stallone. He\nbrought the character a whole new tone. He actually deserves an\naward!!! He has proved himself to be on the list as a nominee!!! I\ncould not believe this was Sly! He has my vote. Jordan was also\noutstanding. His performance was flawless! Jordan will not disappoint\nyou in any way. \"Creed\" was an inspirational moving story. Academy take\nnotice!\n"},
{"review": "\nWatched Creed an amazing Performance by Michael B.Jordan(Chronicle) as\nAdonis Creed. Slyvester Stallone(Invincible) as Rocky Balboa a Boxy\nChampion turned Trainer , Tessa Thompson(Frozen River) as\nBianca,Phylicia Harris(Julia and Julie) as Mary Anne Creed, Wood\nHarris() as Tony Little , Graham McTavish as Tommy Holiday ,Andre Ward\nas Danny ''Stuntman\" Wheeler . The film is very touching drama between\nteacher and Student also its also very heartfelt also there was a few\nmoments when I choked up a bit, it was also funny,sad,happy and\nheartwarming amazing also an amazing performance from Michael B.Jordan\n&amp; Sly.the Costume Design By Antoinette Messam(Orphan) &amp; Emma Potter(127\nHours) , Score By Ludwig Göransson (We're The Millers) and Direction By\nRyan Coogler(Fruitvale Station) A Great Passing Of The Torch 10/10\n"},
{"review": "\nCreed is that movie, taking the franchise full circle with this\nbrilliant instalment. As a lifelong fan of the Rocky franchise I had of\ncourse been anticipating this movie, but what I hadn't counted on was\nthat it would be such a good movie. I mean I knew I'd enjoy it but even\nthe non Rocky fans I saw this with thought it was great. Creed captures\nwhat was so brilliant about that first film; the downtrodden\ncharacters, the love story, the city of Philadelphia and oh yeah a\nfight for a championship that is really all about character not about a\nbelt.<br><br>Sylvester Stallone is heartbreaking and exceptional in this, easily\ngiving one of his career best performances and his chemistry with\nMichael B. Jordan is pretty special too. These two worked so well\ntogether. The story was engrossing and well thought out, funny at\ntimes, sad, exhilarating and brought me to tears more than once. It\nalso pays respect to the Rocky series as a whole while taking it into a\nnew generation with the wonderful Michael B. Jordan.<br><br>During the final fight when that original theme music started up the\naudience started cheering and applauding. I can't remember the last\nmovie I went to when the audience was so involved. 11/30/15\n"},
{"review": "\nPeople want creeds to live by, stories on right living, how to strive\nand what for. Boxing movies are some of the simplest (romance films are\nanother kind); they teach dogged effort, perseverance, pulling yourself\nback up again. But it is almost always at the expense of softer\nrealizations about the intangible things that make life tough;\nuncertainty, ego, pride, desire, these are left untouched. <br><br>So it is here. Same old. The hero finds himself down and out, strives\nto pick himself up, does, goes up on the ring where he beats impossible\nodds. But what for? Has the boy got even an inkling about why he bashes\nhimself to be worthy to a name, an image he clings to? We are roused up\nfrom our seats, if we are, but will go back home to lives that are\nnever as clear cut as this. You don't have to listen to me, watch this\nand see what's left of it in you the next day. It's what happens when\ncertainties are superficial, they don't grow roots in life we know.\n"},
{"review": "\nSo before you read any further, the movie itself, storyline, acting,\ncasting choices, are all solid. This is by no means a bad movie but\nwhat truly handicaps it is that it follows almost the same plot line as\nthe original Rocky with very little deviation from that story. These\nmovies are so overdone I have a hard time seeing who they appeal to\noutside of die-hard Rocky fans (or kids who have never seen the\noriginal).<br><br>I was really hoping they would change up the ending and maybe have him\nknock the guy out instead of having another split decision in the\nopponent's favour. I guess we wait and see if they make another where\nthey have Conlon get out of prison, book a rematch with Creed, and then\nhave Creed beat him in that fight.<br><br>All in all, a 6/10, losing about a point mainly for lack of\noriginality.\n"},
{"review": "\nI was surprised at parts, but disappointed at others.<br><br>\"Was it interesting?\" Mostly. The acting was the best part. The\ncinematography was great as well. The romance was much more believable\nthan what I would expect. 2 out of 3.<br><br>\"Was it memorable?\" Not much. I liked how they incorporated the past\nmovies, but this movie didn't really add much compared to them. 1 out\nof 3.<br><br>\"Was it entertaining?\" Not really. The fights were good, modernized but\nstill fitting for a \"Rocky\" movie. The main problem with the movie is\nthe story. The main title character has little drama, with a lot of\nattention on Rocky. There is not much sacrificed or on the line. 1 out\nof 3.<br><br>Starting with 1 (because), 1+2+1+1=5 A disappointing and weak\nmodernization and revitalization of a dying or even dead franchise.\nPerhaps I was expecting too much.\n"},
{"review": "\nI'm usually very generous when speaking of movies, and am ready to\nwatch any movie. The problem with Creed was, it relied too heavily on\nthe Rocky's story. The movie is almost proportionately split between\nthe two characters and does not go two minutes without mentioning the\nold history. There was no character build in this movie like there was\nwith Rocky. If you want a independent movie which resembles this one,\nwatch The Fighter with Mark Wahlberg. It is literally the same movie\nwhich has a family legacy, a woman involved, and is centered around\nboxing. I just don't see this movie having any success without people\nloving Balboa(Stallone) or Creed(Weathers).\n"},
{"review": "\nGoing into Creed, I was expecting Rocky, and that's not what audiences\nshould expect. It's not Rocky. Sylvester Stallone isn't our hero\nanymore. It's Michael B. Jordan, or should I say, Adonis Creed. While I\nwas watching this, I was reminded of the first Rocky and all the\nobstacles Sylvester Stallone's character had to overcome, and it's a\ntestament to that universal motto of 'going in one more round'. <br><br>Creed is a good movie, but it's no Rocky. Adonis isn't a street kid.\nBoxing isn't his only option. There's no Adrian, no Paulie, or any eye\nof the tiger. However, there is a Mick in Rocky. Glimpses of the old\nRocky Balboa. His heart, his knowledge, but most importantly, his\nwisdom. <br><br>Don't go into Creed expecting to see Rocky, because you won't. This is\na new vehicle. Its story has flaws, and that's understandable, but\nthere was something else that bothered me about this movie. It needed\nmore heart. Maybe a training montage, or an inspirational quote, or\neven a visit to father would've sufficed. Instead, I saw a lot flash\nand excess. And that's fine, I guess I just expected more of a\n'champion' picture.\n"},
{"review": "\nThis had such good critics reviews that I thought it might be worth the\nextra shot for a movie which lingers on the same theme and same idea\nbut maybe did the job nicely with modern technology.<br><br>All expectations laid waste when I saw this movie. A comparison to\nRocky was obvious. Since it was catching on the same theme, it was\nexpected to at least show that much prowess, neatness and even tensile\nstrength in story. What it turned out was a fluff which had interesting\ndirection. The first quarter of the movie was giving it good direction.\nIt had some new-ness of what you might expect from a movie in 2015, but\nkept the same base elements which made Rocky a hit back then.<br><br>But then it seemed to lost it. Whether to focus on training or to focus\non the mind games about being a boxer with some history - the story\nsort of stayed in this dilemma and never took off to a direction. The\nfight also was not very interesting as compared to its paternal genre. <br><br>All in all, I do not think this is good enough to be in the same\n'Creed' as a 'Rocky' before! Hence the 3/10\n"},
{"review": "\nThis film is depressing. Rocky now as a coach battling cancer just does\nnot work. This is not a Rocky film. The last Rocky film Rocky Balboa\nwas truly the end of the series. This film about Creed's son is just\nnot Rocky. Frankly the original Apollo Creed was never meant to be a\nseries long main figure. His story was never the interesting one. So I\nam very disappointed. the media hype is way overblown and helping in\nthe early ratings. But ultimately it is depressing to see the series\ntake this turn. <br><br>Even the story from the last Rocky which was Rocky Balboa might have\nbeen more interesting to have followed up on. Stallone did not write\nthis and that shows. Ultimately, is Creed as captivating as a character\nas rocky. Not at all. if anything, this should be considered a new\nseries called Creed. Disappointing.\n"},
{"review": "\nLet me start off by saying I have not seen any of the previous Rocky\nfilms before this so I am judging this as a film on it own merits as\nevery film should be judged in this way. That being said Creed is one\nexceptional film. I mean it really is. This film wins on all accounts.\nRyan Coogler was the right person to make this film a reality with\nexceptional acting and a emotionally compelling story to go along with\nit. <br><br>This film wins on all fronts. Micheal B Jordan is a excellent new\nedition to this world and gives this story so much heart in his overall\nperformance making a big comeback after the failure of Fantastic Four\nproving that he is a phenomenal actor overall and is rightfully\ndeserving of a Oscar win at some point in his career. <br><br>Sylvester Stallone also makes a strong return to the franchise making\nthe story all the much more memorable. I really loved him in this role\nas he took it with all the force he had and he undoubtedly won for me,\nand is deserving of so much love for what he managed to do in this role\nas well. <br><br>Overall this is a powerful film and is a welcome home for all Rocky\nfans, and is just a good legitimate movie as well.\n"},
{"review": "\nWhy do we need to see a reasonably made rehash of the same successful\nformula, shot with a different camera at a different time which does\nnot take the saga into newer territories nor ever takes risks with the\nmaterial? This is a ho-hum plod through another reboot where the\ncharacter's motivations are all muddled, the romance is all tacked on\nand unnecessary and the plot is mm thick, it never delves deeper into\nits suggested material, doesn't explore any angles or takes any\nchances. The only redeeming thing about this movie is the mildly\ninteresting interaction between Stallone and Creed.<br><br>A good example is Tom Hardy's Warrior, which explores so much emotions\nand gives an emotional wallop, all of which is missing from this latest\nretake from Ryan Coogler.<br><br>This movie is a bore.\n"},
{"review": "\nI did not like this film and I love the Rocky films. It was a boring\nretread of material we've seen done better in previous Rocky films.<br><br>I didn't understand the lead character's motivation for boxing, the\ndialogue felt forced and incongruous and the film was baggy and overly\nlong. The love interest felt tacked on, unnecessary and implausible.<br><br>Good things about it were the improved quality of the boxing over the\noriginal Rocky films, the cinematography was good and it's a very\nwell-made film. Sly put in a solid performance with what he was given.<br><br>Tony Bellow/Ricky Conlan was by far the best thing in it, but he didn't\nhave nearly enough screen time (after 5 seconds near the beginning he\ndoesn't show up until almost an hour later for a minute-long scene) so\nit didn't really feel like a rivalry or adversity for our protagonist\nto overcome. In fact, I was rooting for Ricky throughout the finale.\nAlso, the first round of boxing in the finale was great, but from the\nsecond round on it was a punch-for-punch remake of the original Rocky.<br><br>After 90 minutes, I was thoroughly bored and waiting for the film to\nend. I'm baffled by the acclaim this movie is receiving.\n"},
{"review": "\nI can't believe Creed has so much praise, did I watch the same film?\nFirstly, I thought Ryan Coogler did an excellent job with Fruitvale\nStation and that's the reason I wanted to see Creed, not because I'm a\nfan of Rocky, which I'm not. I did expect this to be enjoyable though\nand I expected it to be easy to follow without having seen the\noriginals but the film didn't suck me in at all and instead I was\nquestioning everything because I wasn't engaged. Why does Rocky, a\nfamous ex-boxer, live in a terrible house? It's never explained why a\nformer champion boxer has decided to live a meagre lifestyle and what\nhappened to all his wealth (if this was shown in Rocky III then it\nwould perhaps have been nice to allude to it here). I also didn't\nunderstand why Adonis, whose mother is incredibly wealthy, chooses to\ndrive a van around and quits a good job to go and fight. Yes, he loves\nfighting, but why does he love fighting? We don't get a real feel for\nany of the characters before suddenly Adonis is moving in with Rocky\nwho inexplicably is perfectly happy to have him and his girlfriend\nsleeping on his couch when they both have their own apartments.\nNormally I would be fine connecting the dots and just going with it but\nit was so boring I couldn't help but notice the sheer amount of\nstupidity in the script that we're supposed to believe for no reason.\nThe fight sequences are quite well done, the film is well photographed\nand the actors do a fine job but the script is awful in my opinion;\nflat characters, trite dialogue and inexplicable plot developments\nwould be fine in an otherwise entertaining comedy or horror film but\nnot in a drama like this. I walked out just under two thirds of the way\nthrough.\n"},
{"review": "\nI'd rather not spend 120 minutes watching a film that is seriously\nstep-by-step a copy of so many others before it. There's absolutely\nnothing interesting about it with any of the characters aside from\nRocky, and that's because we already have that connection with him (I\nonly watched the original before seeing this, and thought that was\nmostly an entertaining, engaging, heartfelt film). Nothing in the story\nis original, nothing in any of the supporting characters is original or\ninteresting (I can't tell you how much I hate the \"let's make the\nopponent boxer a real jerk\" cliché). Nothing in any of the shots is\ninteresting or original, nothing in the story is surprising. It's\nexactly the kind of film audiences will continue to eat up until the\nend of time and there will be thousands more like it. No, it's not\noffensive or bad, but I don't think that's enough. It's exactly the\nkind of boxing/sports film I always think of in my head when I say I'm\nnot huge on boxing/sports films because they don't add anything new.\nMichael B. Jordan, god bless him, but he just can't elevate such an\ninherently uninteresting character. There's nothing there to do.\nSylvester Stallone is by far the best thing about it, he has such a\nnice warmth and presence . I would not begrudge a nomination at all,\nbut it isn't an amazing performance by any means.\n"},
{"review": "\nThis is far from being a 8.7. Is just because it is Rocky movie that\npeople have to overrated it. This a love story. It got sold to men\nbecause Sylvester Stallone was in it. The original Rocky is a better\nmovie then this. And that is an awful movie. Rocky II is a better\nmovie. And that is an awful movie. Rocky III is a better movie. And\nthis is an awful movie. Rocky IV is the best Rocky movie. This one is a\ngood movie. But not this one. Rocky V is also a good movie. It is a lot\nbetter then this. Rocky Balboa is a better movie. And that is an awful\nmovie. Do not see this movie. The story line is slow and awful. To\nlesson to the hype this is the worst Rocky movie.\n"},
{"review": "\nSPOILER ALERTS<br><br>Many have already said it but I feel it needs saying again there is\nliterally nothing original about this film, it's basically a remake of\nRocky with an African American lead, with a little bit of the rest of\nthe franchise thrown in too. It's the same all the way down to him\nlosing on points to the champ who has never been the distance before.<br><br>The acting in my opinion is pretty weak across the board, is it really\nworthy of an Oscar nomination to look pouty through most of the film\nand have no on screen chemistry with the love interest? <br><br>The only interesting plot line for me was the way Rocky had given up on\neverything, although this does not follow on from Rocky Balboa where he\nhas patched up with his son, and it is not really obvious why Rocky\ndecides to befriend and train the young Creed, although the two\ntogether do provide some the films best moments.<br><br>All in all a load of over-hyped rubbish that left me feeling nothing at\nall. Please do not make a sequel and especially don't rip off Rocky 2\nto do it!!!\n"},
{"review": "\nNot really worth the time.Not even comparable to the worst of the rocky\nfranchise.I really hopes for something better.Of course,not something\nas good as the last Rocky film but at least a decent one. Got really\nbored from the start and that didn't change at all.Unoriginal plot. Not\neven a big fan of the Rocky franchise,as myself,would appreciate this\nmovie.It might make you angry though,that Stallone chose to film\nthis.The plot is weak and the protagonist not that good at his role.The\ntraining scenes are bad,not even close to comparison to the older\nmovies.The fight scene was even worse,really boring!!Even the\nsoundtrack was as bad as the rest of the film. At least i didn't pay to\nsee it,that would be an even bigger waste!!\n"},
{"review": "\nThere are movies like \"Rush\" or maybe \"Moneyball\" - one of those\nwell-made movies about antiheroic but somehow very likable sportsmen\nthat usually don't get a serious critical acclaim and don't get much\nout of Globes or Guilds or Oscars, but are widely recognized and\npraised by broad audiences. \"Creed\" is also one of those movies.<br><br>Without spoiling anything, I'll just shortly say that this movie really\nresembles Rocky in it's honesty, charm and brutality with which it\ndepicts the struggles the main characters are having. Beware, if you're\nexpecting this movie to be just \"Rocky 839127...\", just a movie where\nthe guy is challenged, he trains, fights and wins, you'll get muuuch\nmore than you'll come for. The pain all the \"Creed\" characters are\ngoing through are realistic, they're everyday struggles people that you\nand I know are facing. They're not in battle with half of the USSR,\nthey're in the battle with their pride, heritage, health, legacy and\nage. You'll also get to see one of the best supporting actor\nperformances of the year and arguably the best Stallone performance\nsince Rocky (if not ever).<br><br>If you're not into serious dramas like \"Spotlight\", \"Room\" or \"Steve\nJobs\" but still like to watch a well made movie, go watch \"Creed\".\nHonestly, it might not be on the level of \"Martian\", but it's the hell\nway above some awful stuff people pay to watch these days (like \"Hunger\nGames\", \"Maze Runner\" or, god forbid, the newest attempt of\n\"Terminator\").<br><br>Movie Rating: 8.1<br><br>My \"Best Movies of 2015\" list: http://www.imdb.com/list/ls031061874/<br><br>My \"Best Movies Ever Made\" list: http://www.imdb.com/list/ls072746304/\n"},
{"review": "\nI still have a gamut of emotions watching Rocky 1,2,3 and 4 but this\none left me wondering why it was so highly rated. I was not moved\nemotionally at all. The dialogue felt awkward and misplaced at times\nand forced at others. The first four movies were so well done that it\nseems like those things really happened. It is forever printed on my\nmemory. I still sing songs from those Rocky movies all these years\nlater. I am already forgetting much of this movie and I saw it last\nweek. I can't even remember a single song from it. It really is that\nbad. I never thought it would be possible to make a \"Rocky\" movie worse\nthan Rocky 5 but this one was worse. <br><br>There were a few things that could have made it much better. Perhaps\nthe relationship with young Creed's mom could have been played out more\nand the relationship she had with his father capitalized on. Perhaps\nsome flashbacks of Apollo, Rocky, Adrian and Paulie could have been\nused. <br><br>This, as others are saying, seems to be an attempt to remake the\noriginal Rocky movie with different characters and more of an African\nAmerican slant. Without giving anything away, they try to imitate the\nscene where Rocky runs through Philly with a big crowd running behind\nhim in support and it turns out extremely cheesy to say the least. <br><br>As a huge rocky fan I was hoping for a great movie. It was not a\nterrible movie but a huge let down and nothing compared to the first\nfour Rocky movies.\n"},
{"review": "\nI was disappointed when Stallone didn't win the Oscar this year, but\nafter finally seeing Creed, the reason was clear. There just were not\nenough scenes with Rocky where he could really act. The story was\nthere, but there was too much time spent on Creed's girlfriend. Really,\nwho really cares about her story. They tried to recreate similar\ninterest like with Adrian/Rocky but it falls flat. She's a singer, but\nthat brings up the whole music of the film. Music falls flat - you\nwon't hear more than one note from any of the Rocky films. the new\nmusic just sucked.<br><br>There is a twist, makes you think of Burgess Meredith, but in the end I\nreally wished the story had concentrated more on Rocky, and on the\nRocky/Creed relationship. It's too bad, because this was probably\nStallone's only last shot at an Oscar. <br><br>The ending is predictable, but you will smile. This should be in for\nRocky, but heh, you never know. Enjoy.\n"},
{"review": "\n*contains spoilers* I'd rank it lower but somehow, I found myself\ntrudging through this nightmare of a Rocky movie through sheer force of\nwill. This movie, is terrible. It is not written really well at all -\nthe introduction of a character as \"Apollo Creed's son\" who is driven\ntowards boxing but initially gets smacked around (because he's knocked\nout by one of the champions in the Delphi Gymnasium, the same gymnasium\nwhere Apollo had trained) and so he's gone to Rocky Balboa to get\ntraining. In itself, the story is supposed to be bearable (We had it\nalready in Rocky V, the 1990 Rocky movie with the upstart who is beaten\nby Rocky in the climax), but dear, merciful, Lord... this movie runs\nlike War-Room.<br><br>Rocky, was never War-Room. This movie, treats its audience like they've\nnever seen Rocky at all, and are completely dumb as Trump voting Yanks.\nThis movie, is the reality TV equivalent of a slap in the face of Rocky\nfans. Especially when there's ACTUAL HBO SPORTS ADS IN THE GOD DAMN\nMOVIE.<br><br>EVEN the fight, is mediocre at best. The training montage is\ndisappointing, horrendously so. And the worst part, they're trying to\nmake a character for \"Creed\", as a lame excuse to continue the \"Rocky\"\ntradition and story, but are in essence insulting Apollo Creed.<br><br>(sigh) bottom line, if you consider yourself a really true die hard\nRocky fan, then watch it. But if you're sane, Watch \"Angel\" by Tahir\nShah instead. That song is better... way better than this... yeah.\nPathetic Creed, full of acting trappings which makes him a shallow\nconstruct, and the worst part is that everyone dumbs down for this\npathetic Creed character. A shitty protagonist, and a very dumb and\ndisappointing story.<br><br>You have been warned.\n"},
{"review": "\nIf you love rocky, then you probably rated this with more than eight\nout of ten. I didn't but I still gave it a seven. It was an intense\nmovie. I did not buy the fact that this guy was doing amazing in a\ncompany and he just gave it all up to become a boxer cause it was in\nhis gut to do so... I just don't think it's realistic! <br><br>But he did, and then he went into the strange boxing world of Philly,\nback to his roots, to find himself. And then he finds a girl that just\nlike Adrian had some kind of serious health problem. Why? Was that\nreally necessary? Boxing wise the movie had everything the average fan\nwould like to see. I don't know how close to the reality it was but for\nme it was close enough. <br><br>Liked the occasional joke here and there and I have to say that Stalone\nwas born for this part. For all his parts in Rocky and Creed. Nothing\nmore. But for those roles he was the best there could ever be. The\nlymphoma twist was OK but again it was not explored as much as it could\nhave been so it remained fairly superficial apart from some powerful\nscenes in the house where he is being carried to the toilet to vomit. <br><br>The fight in the end was as expected as the end in a Disney story, but\nstill it was intense. A bit far fetched again, but this is the\ntrademark of the series so I was fine. Could have been a lot better\nthan it was, but it was pretty decent still. Not a chance for an Oscar\nSylvester, sorry, no matter how heart breaking it is to see you come\nback with this movie, 35 or something years after the first.\n"},
{"review": "\nWith 'Creed', you have the emergence of a new 'Rocky' franchise, with a\nnew look and a fresh face. The film is based on Apollo Creed's\nillegitimate love child who re-surfaces in Philadelphia, searching for\nhis late father's nemesis; Rocky Balboa. Michael B Jordan is brilliant\nand the light of this movie as he portrays 'Adonis Johnson', the son of\na boxing legend who wants to cement his own legacy. Of course Sylvester\nStallone is back as Rocky Balboa but at times seemed abit bored\nreprising his old role once again. Michael Jordan takes the show for\nme, he is full of fire as well as being emotional bringing the\ncharacteristics of his charismatic father into the ring as well as the\ntoughness of his famous trainer. The story itself is predictable and\nfollows the original Rocky almost blow by blow but this film doesn't\nintend to bring anything new but instead felt like it was paying\ntribute to one of the greatest movie franchises in cinema history. No\ndoubt as with the recent 'Terminator' re-boot and the new 'Star Wars'\nepisode, this is the beginning of something new but the creators of the\n'Creed' legacy need to be mindful that something new is required to\nkeep any follow up movies interesting and worth watching otherwise the\n'Rocky' angle will also wear thin and even the hardcore fans will\nswitch off. @zulfmanauthor\n"},
{"review": "\nSylvester Stallone, Michael B. Jordan, Tessa Thompson, Tony Bellew and\nPhylicia Rashad star in this 2015 drama sequel. This is also a spin-off\nwhere we meet young boxer, Adonis Johnson (Jordan) who wants to become\na respected fighter. He tries getting out of his father, Apollo Creed's\n(Carl Weathers) shadow and soon, he seeks help from retired fighter &amp;\nApollo's friend, Rocky Balboa (Stallone) to help train him. Rocky\ndecides to take him under his wing and helps him not only to become a\ngreat fighter, but gain self-confidence. Thompson plays singer, Bianca\nwho Adonis finds romance with, Bellew plays boxing champ, Ricky Conlan\nwho Adonis agrees to fight and Rashad (The Cosby Show) plays Apollo's\nwife, Mary Anne. This is a good film, Stallone is great as usual and\nJordan also gives an exceptional performance. I recommend this.\n"},
{"review": "\nGrowing up in the seventies and eighties, yes, you know that I have\nseen the classic Rocky (1976), the start of the career of Stallone.\nFrom there on the Rocky franchise was started but once we entered\nnumber 5 it was downhill with the franchise and also a bit of downhill\nwith Stallone's career. But Stallone was friendly guy and everybody had\nbig thumbs up for him.<br><br>So it was time to bring him back as Rocky but being too old so the\nscript was about the Creed, the boxer Rocky faced in part 1.<br><br>What an excellent flick this is, this is in fact a bit of the same of\nRocky but it all works out fine and Stallone gives the best and it\nshows. Clocking in over 90 minute it never bored me for one minute.\nSadly Stallone missed the Oscar for his role, should have won it. <br><br>A perfect entry in the Rocky franchise.<br><br>Gore 0/5 Nudity 0/5 Effects 4/5 Story 3,5/5 Comedy 0/5\n"},
{"review": "\nUnexpected and almost as pleasing as Star Wars: Rocky was also back in\n2015!<br><br>It was good to go back into this universe: setting up a new generation\nis done smartly: using Creed as a main character allowed for a richer\nplayground, a richer set of elements to toy with and a way to build\nrelationships in a deeper manner that would have been the case with\nusing \"simply\" Rocky's son. <br><br>Michael B Jordan is good, still some progress to do (some scenes are a\nlittle cliché due to his acting perhaps?) but Stallone is a real nice\nsurprise. He's quiet, wise and yet inspirational and true to the modest\nroots of the character. <br><br>A familiar plot actually works. You go along the training and fight\nscenes with a similar smile on your face as you did in the 80s watching\nRocky fight Appolo, Mister T etc. <br><br>Good stuff.\n"},
{"review": "\nAdonis \"Donnie\" Johnson (Jordan) the son of the late Apollo Creed, a\nformer Heavyweight Champion of the World, asks Rocky Balboa (Stallone)\nto train him. Rocky reluctantly agrees. Later Adonis changes his name\nto Creed to fight Pretty Rickey Conlan (Tony Bellew) the British Light\nHeavyweight Champion of the World. Let the games begin. <br><br>The Academy got it wrong. Sylvester Stallone should have been nominated\nfor the Best Actor Award, not a Supporting Actor Award. He may not have\nbeaten out Leo, but should have been in the same arena as Leo. You want\na Best Supporting Actor? Look to Michael B. Jordan as Adonis \"Donnie\"\nCreed, who was excellent throughout. <br><br>Everything in this film is terrific, nothing dragged, was overdone or\nwas drawn out. All the Rocky movies are terrific and so is this one.\nMany of us also enjoyed this for a small trip down Memory Lane and were\nnot disappointed. <br><br>All the final fight scenes in all the Rocky movies were spot on, brutal\nand some believe they were quite real and not a thing of movie magic.\n(Pretty sure they were all movie magic) All the supporting cast and\ntechnicians involved should be very proud of this movie. <br><br>Notables: Liev Schreiber: Narrator for a while in the beginning;\nPhylicia Rashad as Mary Anne Creed, : the stepmother of Aldonis; Tessa\nThompson as Bianca, the love interest of Adonis; Sports Announcers:\nTony Kornheiser, Michael Wilbon, and Hannah Storm as themselves.<br><br>All in all a terrific movie, thoroughly entertaining and one of the\nbest boxing movies ever. (9/10)<br><br>Violence: Yes. Sex: No. Nudity: No. Language: One F-bomb and that\nwasn't all that clear.\n"},
{"review": "\nEach year you'll see a lot of movies about sports topics but few of\nthese films will shock you and this film was a clear example of this\nkind of movie Sylvester.... After a long time he was able to show that\nthe power of a good actor is also, perhaps, but not of Al Pacino a\nGolden Globe the right to pass judgment Stallone had a good view abut\nmovie good start and the first figure shows us that from boyhood to\nfight and there is a violence in his blood .Then Several years\nprogressed and amateur tournaments in Mexico's violent amateur boxer\nhas become in America that does not mean he lost his job and is also\ndue to the stepmother of wealth But there is interest in boxing in his\nblood makes her way to a new world. Movie clichés of the genre's most\nmovies are Videos can be selected from weaknesses that are competing\nfor creed considered fighting noted that no physical resemblance to the\nboxer did not\n"},
{"review": "\n\"Adonis Johnson\" (Michael B. Jordon) is a young man who harbors a\nsecret that has tormented him his entire life. This anger and\nbitterness has led him into one violent episode after another and\nbecause of that he has turned to boxing to vent his rage. Finally,\nafter winning his 15th consecutive fight in Tijuana he decides to focus\nall of his effort into the sport and tries to gain membership at a\nlocal Los Angeles gym. Unfortunately, the word is out on him and he is\nrefused admission. So left with few other opportunities he decides to\ntravel to Philadelphia to ask a favor of the man his father knew only\ntoo well\u0097Rocky Balboa. Now rather than reveal any more of this movie I\nwill just say that it definitely had its exciting moments and deserves\na place in the \"Rocky\" legacy. On the other hand, it also had some\nflaws as well. For example, it follows almost the exact same format as\nthe first \"Rocky\" movie from start to finish. Likewise, there were a\ncouple of scenes which were simply too obvious to be believed. But\nhaving said all of that, this movie was still entertaining in its own\nright and for that reason I have rated it accordingly. Slightly above\naverage.\n"},
{"review": "\nI'll start off honestly: 'Rocky' was never my favorite franchise. But I\nthink that's okay, as it's probably not most people's. Despite its\nimportance in pop culture, good acting, good dialogue, and general\ngoodness\u0085well, they were rare, especially as the movies went on. But I\nguess in the end, the technical quality of such a film never matters.\nAs long as it's enjoyable. The first trailer for 'Creed' gave me\nchills, just like the one for 'The Force Awakens', and in many\nrespects, this film can be both compared and contrasted well with the\nlatter. What 'Creed' did differently: it relied less on the nostalgia\nfactor than TFA. I think that this helped the film stand out on its own\nand it was overall a great move. That said, I felt that there were a\nfew things missing. The Rocky theme disappeared completely. I would\nhave thought that since Apollo told Rocky, \"Eye of the tiger,\" that\nperhaps Rocky should have said the same thing to Adonis. Perhaps that's\njust me. That said, Michael B. Jordan and Sylvester Stallone blew me\naway, and it's not often that either one of them have done that. I\nwasn't sure how I liked the Rocky-with-cancer subplot. It hit me sort\nof like Han's end in that, well\u0085I hated it at first. But in contrast to\n'Star Wars 7', it turned out to not be such a terrible move, and it\nbrought out more from Stallone as an actor and helped the film affect\nthe audience greater. I believe that 'Creed' has done justice to the\nlegacy of the 'Rocky' films overall, but all the same I would remain\nwary of sequels. The ending to this film confirms that it is just as\nmuch a reboot as a sequel, the same as 'The Force Awakens' was. If they\ncontinue to carbon copy or kill off Rocky or anything rash like that,\nthey'll be going down paths not easily completed.\n"},
{"review": "\nCreed<br><br>The reason why retired boxers don't do color commentary is because\ntheir concussed brains see 4 fighters instead of 2.<br><br>Surprisingly, the archaic pugilist in this drama has contracted a\nnon-boxing ailment.<br><br>Determined to make a name for himself in the ring, Adonis (Michael B.\nJordan), the son of Apollo Creed, seeks out his father's old rival and\nfriend, Rocky Balboa (Sylvester Stallone), to train him.<br><br>When the media gets wind of Adonis legacy, he quickly lands a landmark\nbout. <br><br>But his shot at the light heavyweight championship is endangered when\nhis mentor is diagnosed with cancer.<br><br>A refreshing addition to the Rocky anthology, Creed is as much homage\nto the original as it is an update of the mythos.<br><br>With knockout performances, kinetic direction, and rapid-fire editing\nall aiding in its inspirational yet unconventional sports movie\ntrajectory.<br><br>Conversely, retired ringside cutman can always get seasonal stitch-work\nwith the NHL. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nIf you gave this movie a good review fix it. The whole movie was flat,\none little chuckle out of the whole thing - the chicken comment. The\nlast fighter looked as flat as the entire movie. Love the Rocky series\nup to 4. I was not a fan of baby creed. He had an attitude, grew up\nrich and talked trash. Save your life avoid this movie.<br><br>If you gave this movie a good review fix it. The whole movie was flat,\none little chuckle out of the whole thing - the chicken comment. The\nlast fighter looked as flat as the entire movie. Love the Rocky series\nup to 4. I was not a fan of baby creed. He had an attitude, grew up\nrich and talked trash. Save your life avoid this movie.\n"},
{"review": "\nThis movie is the best way to start something new. We can feel the\npower of the old Rocky films. Creed is a great ending of the old movies\nbut also a really good start of a new era. The only one negative point\nof the movie is, that Apollo is too big legend and Rocky seams a little\nbit just a local hero however we all know that the Italian stallion was\nthe best ever. (Maybe this is a spoiler, maybe not.) Good point of the\nmovie: 1) Stallone gives maybe the best performance of his career. 2)\nMichael B. Jordan is really authentic sportsman. Bad point of the\nmovie: 1) Too big hype about Apollo 2) Rocky is not as respected as he\nshould be. 3) the love story, Bianca freaks out because of the name\nCreed\n"},
{"review": "\ni think that this film is over-rated and sly didn't deserve the golden\nglobe instead we were all sympathized with Rocky's character and we\nignored that the director didn't create a space of liberty to show off\nhis skills as the shots were too quick and there is no clear master\nscene that you can feel he excelled in this movie. I think the director\ncared about the technique of the match it was great but he ignored the\nperformance of almost all the actors even the character creed\nhimself.on the other hand we can make excuse for Michael B. Jordan\ncause he was forced to be in a comparison with sly the huge Rocky but\nlike what i told before that the problem was the director that he cared\nabout every thing except the performance.Its good to revive the\nmasterpieces we inspired before but it put the crew under a great\npressure to be on the same level or higher.Sly became more cleverness\nto switch his type of movies like Expendables and all action movies he\ndid before to make this type and in my opinion that was the only reason\nto get the golden globe.\n"},
{"review": "\nWhen this was first announced I wasn't interested one bit as I couldn't\nimagine how this could compare to the Rocky franchise. And even after\nthe release I was reluctant to watch.. But after watching it I'm so\nglad I did! What a superb job they've done creating a new film but\nretaining balboa's legacy! A modern rocky balboa with all the trademark\nmoments we rocky fans love to see! Only downside to me was Tony\nBellow.. Just wasn't convincing (maybe it would have helped if he was\nin better shape?). But overall a must watch for any Rocky fan.. Will\ndefinitely be pre-ordering the bluray and look forward to seeing Creed\n2!!\n"},
{"review": "\nI'm not a fan of the whole franchise, but Rocky Balboa (2006) hit the\nright spot and this sixth statement knock me down to watch the previous\nmovies with other eyes.<br><br>Stallone is at his best in the movie, and deserved the nomination for\nthe Golden Globe. In this film I was able to see the same Rocky that I\nloved from nine years ago, but now in a fight outside of the ring,\nwhere the character shows his real value, and with a backup of the new\ngeneration, gritty, messed up, young Adonis Creed, brought to life by\nthe amazing performance of Michael B. Jordan.<br><br>The directing is pretty awesome. A couple masters through the fights, a\ngreat work in the montage of the training and the fights, and shots\nthat capture the intimacy between Unc and Donnie. A very nice work that\nmade the movie different of other sports flicks. It wasn't about the\nfighter, the legacy, the cancer, the final fight itself. It was\nsubjective in a point that few movies can get.<br><br>Other thing that really hooked me into it was the make-up. You were\nable to see a bruise appear just after the punch and the way that they\nescalated. That f*cked up eye in the final fight was like, \"Sh*t, I\nalmost threw up my dinner!\". But not only that! The make up on Stallone\nduring the fight with cancer was pretty amazing either. He isn't a\nyoung boy anymore, but the make up made him look a couple years older\nand really sick and so.<br><br>The story is very good, with a good tone and in no moment appellative\nin the cancer point. After all it isn't a movie about Rocky, is about\nAdonis, and they kept in the right way. They didn't made a movie about\nRocky the trainer, trying to bring back the hero of the 70's and 80's.\nHe was part of the movie about a new star! And that worked fine!<br><br>It is a great movie, check it out as soon as possible!\n"},
{"review": "\nYou do not watch Rocky if you do not love it and if you love rocky then\nwatch this one. After a long time a movie pumped the heart and won the\nMind. Good Job everyone. The Movies picks up the pace with protagonist\nreaching the motives. The Script is tight and nice. Jordan kept the\ntempo up and honored the legacy with his swag and sincerity. Sylvester\nvoice still brings the life to the show with his subtle variation of\nmood when he talks about his life while looking at Jordan . Overall\nmovie is good with the director bringing in new perspective and actors\ndoing the job .Please watch the movie and relive the moments of \"Flying\nHigher\"\n"}
]