[
{"review": "\nAfter watching the trailer i was really hyped about the movie because\nof its theme and potential to be a really good movie. But on the other\nside i knew how bad the most potential good movies in the past ended\nup. I was scared that they screw it up and give us another Oblivion or\nIlisium with much cgi-effects and bad story and no real story and/or\ncharacters. <br><br>So i took my girlfriend and went in the movie with mixed feelings. But\nthen, right from the beginning, i knew this movie would be fantastic.\nThe first minutes really hooked me and i found myself in a funny,\nfilled with perfect action and intelligent movie. You had the feeling\nlike you were directly in it and you really feel with Tom Cruise from\nthe beginning to the end. I don't like Tom Cruise in general but this\nrole just fits him. Nobody who sees this movie could deny this. From\nminute to minute i was more and more in this fantastic story and wanted\nto last forever. But eventually the movie ended and i was really\nsatisfied with everything. <br><br>Two main characters who played perfectly, a fascinating story well told\nand really fast and good looking action made it for me the best movie i\nwatched in a while (and i watch pretty much movies). Even though i\ndon't like to recommend movies because of different tastes I really\nwant to do this with this movie. The story is well told and there are\nno boring repeatings. Even my girlfriend who normally don't like movies\nwith much action liked it a lot and added Emily Blunt to one of her\nfavorite actresses of all time.<br><br>Oh well, 10/10\n"},
{"review": "\n1. Story-line is perfect. Its a brand new story. No copycat <br><br>2. Almost No Detail miss <br><br>3. Best expression from main character Cage (Tom). He can make us\nunderstand by silence <br><br>4. Good science put in it and its logical <br><br>5. nice visual effect and sound effect, good action <br><br>6. U just can't simply predict whats up next. Believe me, U can't <br><br>7. Repeat-Repeat But no bored cause he innovate his(Tom) movement every\ntime he dead <br><br>8. Nice chemistry between Cage(Tom) and Emily(Rita) <br><br>9. No stupid Sex and unnecessary romance. Only One nice short kiss at\nthe right time<br><br>10. Nice ending<br><br>OK 10 stars\n"},
{"review": "\nOne of the most ingenious film concepts ever created, a cross between\n'Saving Private Ryan' and 'Groundhog Day', 'Edge of Tomorrow' is a\ngripping and clever blockbuster sci-fi thrill-ride accompanied with\ntaut, fast-paced action and compelling direction. Tom Cruise and Emily\nBlunt form a perfect chemistry that takes them from the training\nground, to the battlefield through to the action-bound finale in Paris.\nThe premise of the time-loop has been used many times before, but this\ntime round there are enough exciting visuals and dynamic storytelling\nskills employed to make this one thrilling (and unexpectedly comedic)\nflick that is unpredictable and expertly designed. A model of cinematic\ncraftsmanship.\n"},
{"review": "\nWith thrilling action sequences, clever sense of humor and surprisingly\nintellectual storyline, \"Edge of Tomorrow\" shows a real deal of summer\nblockbuster movie and proves itself beyond expectation especially after\nunconvincing trailers. Perhaps the theme and alien character looks\nfamiliar with some popular sci-fi movies but it's still combined\nperfectly as an entertainment. Doug Liman as director smartly exploited\n're-setting the day' aspect without making it complicated and escaping\nit from being dull with some quality combat moments also inserting\nlovable drama that is commanded by memorable chemistry from Tom Cruise\nand Emilly Blunt have carried whole scenes in it. Overall \"Edge of\nTomorrow\" feels more satisfying than it might have been in any ways and\nshows how the non-sequel-reboot blockbuster movie should be done. It's\ndefinitely much fun than I have ever imagined and pleasurable to\nre-watch it over and over again.\n"},
{"review": "\nAnother sci-fi movie starring Tom Cruise didn't interest me much. The\ntrailer also didn't give me a clear idea of what this movie was about\nwhich made it even surprisingly good to experience it! The thing about\nmovies like these is that there's a lot of potential to repeat the same\nthings over and over and leave the viewer uninterested. However, every\ntime there was something new so it didn't feel repetitive. There were\nalso elements of humor that were refreshing. The editing should be\nadmired.<br><br>Without giving too much away, I'll say that Tom Cruise (Major Cage) is\nan absolute novice in warfare, who is involuntarily picked for an\nassault on aliens who have taken over Europe. To combat these aliens,\nthe joint forces around the world have developed a armor suit laced\nwith heavy weaponry. He is baffled as to why he was picked when he\nknows nothing about warfare. That part wasn't satisfactorily answered.\nThe first day after combat, he begins to develop symptoms of living the\nsame day over and over again. Baffled, he tries to explain the\nsituation to others who disregard his views. In Rita, he finds someone\nwho can understand his situation.<br><br>There on, it's a thrilling ride of finding out what's causing these\nrepetitions and finding a means to put an end to it. The movie is fast\npaced so no mulling over. Little details of changes in the scenery, how\nCage modifies his behavior both to convince others and to find an\nanswer, and how events unfold are put forth excellently. I'm sure\nenthusiasts can find plot holes aplenty but I found this movie\nthoroughly entertaining. If you're in the mood for watching fast-paced\naction sci-fi, then I definitely recommend this movie!\n"},
{"review": "\nThere are multiple plot strands from other films gathered into a union.\nI won't give you any hint but you'll get it when you see it. Nowadays,\nmovies are short on originality. But, in this case, you won't give a\nthing about it. <br><br>Premise: An inexperience military officer was sent to war to fight an\nalien race invading the earth. In the middle of the battlefield, he got\ninto an accident which causes him to go into time- loop that repeats\neach moment when he dies.<br><br>The basis of the plot looks familiar... That could be a big problem. On\nthe contrary, it succeeded to provide a big summer blockbuster\nsatisfaction. The pacing is perfect, the acting is perfect. Oh, and did\ni mention the effects? It was ragin'!<br><br>See this movie with low expectations (2D or 3D doesn't matter)...\n"},
{"review": "\nI saw the trailer of this, but was expecting another campy\n\"Independence Day\" trying to be too funny, \"War of the Worlds\" that\ntried to be too serious or \"District 9\" that was FX for FX sake. I\nprobably would have not gone, but my date said her daughter saw it and\nloved it.<br><br>Wow, was I surprised! The characters make the movie. Cruise's\nless-than-perfect, frustrated but determined \"Cage\" quickly got me\nrooting for him. Emily Blunt's serious \"Rita\" was a great mirror image\nprotagonist.<br><br>The special effects were so clean and well integrated that they didn't\noverpower the story or become center stage. Instead, they added to\nbringing in me into making the unreal premise more real.<br><br>In the end, this is probably the coolest sci-fi love story I have ever\nseen. It is nice to see that Hollywood can still produce something\nother than the formulaic trash that usually keeps me away from the\ntheaters. Warner Brothers, thanks for putting $178 million on the table\nto make this!\n"},
{"review": "\nSuperb! I rarely get to go to a movie with my older son after his\nsiblings came along. We did manage to go to this movie in the cinemas.\nNot only were we glad we chose this movie to watch, but two years\nlater, we still recall the impact this movie had on both of us. <br><br>This science fiction story is deeply satisfying. The movie treats the\nviewers as intelligent people. It is not in the same league of a\nplethora of science fiction movies that hit the cinemas every year. For\nexample this year we have Independence Day 2, a high budget sequel to a\nhigh budget b-movie from a long time ago. It is profoundly forgettable.\nThat is in stark contrast to Edge of Tomorrow, which has stayed with me\nfor so long and today motivated me to come here on IMDb to write a\nreview after two years!<br><br>This movie is a must watch. Thanks for reading.\n"},
{"review": "\nIt is deferentially the best Si-Fi, Action, Drama and even comedy movie\nof the year ... amazing story, connected plot, unexpected satisfying\nending. <br><br>The storyline is so thrilling .. every scene is intriguing in its own\nway ,, even if they give the same story in the scene, its repeat will\nhave this small tick that makes it different.<br><br>Tom cruise did a hell of job, his face expressions on the movie just\nmemorizing, makes you be in the movie itself. and those comedic, ironic\nbits on the movie made it more attracting. <br><br>If you watched it once you will definitely watch it again and again ,,\nthen again some scenes !! ;) the screenplay writers are geniuses they\nmade hell of twists all along the movie and bravo for Doug Liman for a\nfabulous directing. not being nominated for two academy awards minimum\nfor best actor and directing or writing was just totally unfair !! well\nsince we're here i'm off to watching the movie once again ;)\n"},
{"review": "\nI've been waiting for HBO to broadcast this film for quite some time\nand I had high expectations based on the positive reviews this film has\ngarnered. Unfortunately, I was a bit disappointed, and I'll tell you\nwhy without spoiling anything.<br><br>Now I won't go on and mention the lack of characterization or emotional\ndepth. That's not why some stories are told--especially science fiction\nstories--which are usually always plot driven. Still, after the first\ntwenty minutes, which happened to be contain the most engrossing\nmoments in the film, I found myself wondering if this story would wind\nup as some mindless circus film and it wound up being the case.<br><br>The villains were very shallow things, with no motives whatsoever. And\nif science fiction is supposed to be plot driven, then, this film's\nplot could have had more depth. As a matter of fact, this wasn't even a\nscience fiction movie at all, but rather an action movie. And so if the\nvillain is shallow and without motives, chances are, that the hero will\nbe shallow as well. A hero is defined by the degree of the antagonist's\nvillainy after all. And the hero, Major Cage (played brilliantly by Tom\nCruise) was just a soldier in a war, with a gift. His plight was\nsimple. Save the world from evil robotic aliens.<br><br>The action was fun. I bet this looked great in the theaters. I just\nhoped for something more. Something more politically driven,\nconspiratorial, or philosophical. In the end, it's a fairly unique\nstory, with some clever directing and cool action scenes--but that's\nit. I admire the script and the slow dramatic buildup that the time\nloop creates. Each new day that Major Cage experiences led to new\ndiscoveries and new ways for him to defeat his enemy. I may watch this\nagain simply for Tom Cruise's excellent performance--and of course--the\nimpressive fireworks.\n"},
{"review": "\nI have already watched it 4 times, and I really want to write a review\nfor the film because this is a real Summer Blockbuster Movie which\nshould not be missed (as we want Hollywood to make such kind of movie)\nThis movie has very good script and does not have a single dull moment,\nno unnecessary character development and enough background on\ncharacters to know them. Not to mention awesome Sci-fi action. The\nchemistry between Emily(Rita) and Tom(Cage) is simply great. And after\nlong time I got to see a strong Female character, we have seen many\nstrong female character in movie which eventually gets dominated at\nend(by main star) but it does not happen's over here. I have given it\n(10/10) for its refreshing script and acting.\n"},
{"review": "\nAfter watching this movie, i remembered last year's Now You See Me,\nwhich was an unexpected and entertaining movie.<br><br>This is very well paced and executed film. Tom Cruise seriously fits\nthe character. I know the main character in the Japanese novel is a\nyoung man, but man i'm glad they cast Tom Cruise in this. I'm not a fan\nof Tom but to me he always give 120% in every film. If Hollywood wanted\nit to follow the original material, they would cast some pretty face\nteenagers that would have the same personality as the rest typical\nteenagers characters (Stupid, ignorant, selfish, arrogant for no\nreason). Thank God they didn't do that.<br><br>The story is excellent and it is nowhere similar to Groundhog Day\nexcept for the day loops. it is action packed and there are plenty of\nfunny moments. You may expect the looping days would be boring after a\nwhile, but you'd be wrong.<br><br>I cannot comment on the CGI, because i think there is too much good CGI\nin every movies nowadays that i am not impressed anymore. But it does\nnot mean the CGI int he movie is bad or anything. On the contrary it\nfelt pretty real to me.<br><br>My recommendation : GO SEE THIS MOVIE. You will not regret it.<br><br>P/S : The only bad experience when i was watching this movie in cinema\nwas the guy beside me who constantly open his brightly lit phone and\neven answered a call. another is a group of stupid teenagers behind me\nwho keep commenting loudly on every scene, thinking they were funny. SO\nPLEASE DO NOT USE YOUR PHONE OR TALK LOUDLY IN THE CINEMA DURING A\nMOVIE SCREENING. Thank you.\n"},
{"review": "\nSo Tom Cruise has been back again with the latest sci-fi, Edge of\nTomorrow. After his great performance in Oblivion, he made it again in\nthis comedy-filled tasty Twinkie. Not to say this film is all\ncomedy,and there was too much action to categorize it as nice drama\nmovie. What I was going to say is, this movie has all the movie needs\nto be enjoyable.<br><br>Private Cage is brought down to warfare against aliens, without reading\n\"Exoskeleton Suit for Dummies\" first. But oh my, he had this curse that\nPhil had in Punxsutawney that he had to die and respawn, and over and\nover and (over) again that he granted from an alien he killed.<br><br>I don't know, but apparently, the screenwriter was inspired by\n\"Groundhog Day\", which is a good thing. The pace really done well by\ndescribing Cage deals with time-loop. There are many possibilities of a\nman's mind could think to take advantage of a powerful curse, and I\nthink they explore this well, just like Groundhog Day.<br><br>Good thing comes from the characters. They are lovable and some of them\nhave great quotes. Emily Blunt really nailed the character of a\nhard-soldier that shared same fate with Cage in the past. She really\nbalanced Tom Cruise's performance.<br><br>But enough exaggerating, shall I? There are minus-es too. Always. The\nfirst one is the lack of pre-invasion imaging of Earth(I am not really\nsure for this one, because I missed first five minutes of the movie).\nDamn, they should have made the detail about the mimic's purpose and\nmaybe, a little twist in the credits that could open a gate for sequels\n(duh!). The second, well, I think there is no second minus.<br><br>Even it is not perfect, I believe they have exceeded the edge of making\na sci-fi well-balanced, either from the storyline and action. Really\nworth to watch in cinema. And btw, forget Godzilla, the storyline\nsucks.(no h8 kaiju fans)\n"},
{"review": "\nTake the 1993 classic Bill Murray flick and make the short furry guy\nthe star minus the comedy and include lots of guns and you have Edge of\nTomorrow. Interesting in theory except it completely throws the entire\nconcept of linear time out the window with the 2nd or 3rd revival. If\nthe actions of a single person do not change the outcome of everyone\naround them then this movie makes perfect sense. Why altering ones\nchoices does not result in a completely different outcome is completely\nagainst the theory it is based on (but it is still entertaining to\nwatch which is why it got a 6 instead of much lower). If looking for\nsomething intellectually stimulating this is not the answer. Want stuff\nthat blows up and is loosely based off of sci-fi folk-lore this is the\nmovie for you!!!\n"},
{"review": "\nEdge of Tomorrow is a science fiction film starring Tom Cruise and\nEmily Blunt. It had a very clever plot and well-paced action scenes.\nWhat intrigued me about it was that it is based on a Japanese graphic\nnovel (or manga) called \"All You Need Is Kill\".<br><br>The story is about an army officer named William Cage (Tom Cruise) who\ngets caught up in fighting a war against an elite alien race along side\nSpecial Forces soldier Rita Vrataski (Emily Blunt). Shortly after dying\nthe first time he is dropped into combat, he discovers that he is stuck\nin a time loop which repeats the same scenario over and over. Realising\nthey can use this to their advantage, Cage and Vrataski hone their\nbattle skills each time the loop occurs and hatch a plan to kill the\naliens and win the war.<br><br>This concept was very cleverly executed. It was like Aliens meets\nStarship Troopers meets Groundhog Day. When the movie wanted to be\nfunny with jokes about deja vu, it was hilarious. Even Tom Cruise, whom\nI normally despise, was very good in this movie, not taking himself too\nseriously and Emily Blunt was enjoyable as well.<br><br>I rate it 8/10.\n"},
{"review": "\n6-8-2014. Just saw the possibly best Summer movie to date. Feeling very\ngood - no downer as in Spidey, or time twisting headache as the X-men.\n(Or weirdness from another remake of childhood great Godzilla)<br><br>Solid Summer hit. So much blowing up and the humour is spot on perfect\nfor scenes. <br><br>The longer, better written, reviews are so correct about style, pace,\nand other movie stuff. The plot and acting was seamless for detail\ndriven people - as you know by now many scenes are repeated so that\npeople near you will mouth/say them as they are spoken.<br><br>The length of the movie time (bad pun here) went by quickly; no\ndragging as sometimes happens.<br><br>No nudity, no drugs/booze. Too old to care about swearing, but there\nhas to be some it's a war movie too.<br><br>The manga of this movie is available too so you can read it later. :)<br><br>I enjoyed this movie and rated it an 8.\n"},
{"review": "\nTook 3 viewings before this review because I wanted to get it right.<br><br>On its face this seems to be Groundhog Day with a sci fi twist but in\nfact it is much more.<br><br>It is nuanced, and I give the stars credit for making those nuances\nwork.<br><br>The way Cruise's character changes and matures during the film is\nsomething you don't see too often.<br><br>The riffs on time travel set against the \"trope\" of being sent to a\nbattle with no preparation is also rare -- you literally would have to\ngo to Groundhog Day to to even come close.<br><br>The big difference of course is that Murray in GD never really knew\nwhat he wanted to do -- except wake up.<br><br>Here there is a \"mission\" and that gives this actioner a real shot of\nadrenalin. The viewer is hooked like a trout.<br><br>Three viewings so far and I expect to revisit it again.<br><br>Blount's possibly best role, she doesn't have a lot of dialog but her\nface is like a watermark on the various scenes, making them\nunforgettable.<br><br>As a sci-fi actioner, it's a \"9.\" As possibly the most existentialist\nlove story ever filmed it is a 10 - in the course of the entire film,\nhe propositions her and gets turned down, he tries to chat her up in a\ncar and gets turned down, and then she kisses him just before she dies.\nAll the elements of BOY MEETS GIRL are there. They are just really\nreally really compressed.\n"},
{"review": "\nTo me this film was surprisingly enough, actually funnier than Cruises\nlast comedy, Knight &amp; Day. I didn't care much for that film at all, but\nEdge Of Tomorrow is a very welcome addition to the sci-fi genre. I\nenjoyed it so much, I felt like I didn't care if the end was going to\ncome anytime soon. They could have made this film longer in my view,\nand it would have been just as good or maybe even better.<br><br>I can honestly say that Edge of Tomorrow ranks up there with the very\nbest sci-fi films since the turn of the century. I did see it in 3D,\nand I felt the 3D didn't really add anything great to the film, but\nthat really seems to be the case with all the newer 3D films. The only\nfilm I've ever seen in which the 3D actually did add something extra\nspecial to the film, was Avatar. Personally I think the 3D fad can\nmostly be chalked up as another Hollywood gimmick that really does\nnothing at all, except add extra cost to tickets, and extra in their\npockets of course. This film itself however is not a gimmick, it's\nsolid action sci-fi that even does have some real thought provoking\nmoments. The writing here is good, far better than most Hollywood\naction films. There is even a nod to Mr.Kubrick in the film. Do\nyourself a favor and check this out.<br><br>8.5/10\n"},
{"review": "\nI saw the trailers, herd the minimal hype and let it sit lonely on my\nwatch list waiting for a non-occasion to actually get around to\nwatching this. Then I was listening to Cracked.com and heard it noted\nas one of the more underrated and mis-marketed films of 2015.<br><br>Now having just sat down to watch it I have to say I'm thoroughly\nimpressed. I was glued for the whole film. Quick to move into the\naction and establish the ground rules. I was also pleasantly surprised\nby the sense of humour present throughout. I'm not one for writing\ngive-aways. Just know that Tom Cruse and Emily Blunt are great in their\nrespective roles, killer in the action and form an easy chemistry. The\nsupports offer enough entertainment without distracting from the main\ncharacters. Best of all the special effects are added in smoothly\nwithout dominating the film and give the \"enemy\" life.<br><br>I highly recommend you grabbing some pop-corn and sitting down for this\none.\n"},
{"review": "\nThe real judge (i think) if a film is any good (or not) is having\nwatched it, will you at a later date choose to watch it again. <br><br>The answer is yes to watching Edge of Tomorrow again, I think I've\nwatched it about 4 times now and it's still entertaining. A good Sunday\nmatinée watch. <br><br>The acting is good (as you'd expect from Blunt &amp; Cruise) <br><br>CGI and visually all works well. <br><br>Its a good script, good plot, logical and you do get a satisfying\nending. Above all the film is a bit different from the norm. (what ever\nthe 'norm' is)<br><br>If you like action, science fiction world apocalypse alien invasions -\nthis is for you. <br><br>8/10 recommended.\n"},
{"review": "\nIn the beginning of the film \"Edge of Tomorrow\" I really thought that\nit would be an ordinary \"krush-kill-and-destroy\" action and even wanted\nto switch the player off. Surprisingly, the film turned out to be one\nof the greatest films I have ever seen in this life !!! I am really\namazed ! <br><br>The film can be labeled not only with a \"Science Fiction\", \"Adventure\"\nand \"Action\" genres, but also can be called as \"Romance\". Moreover, for\nme, the film is very unique in many aspects. It is a mixture of vivid\nemotions of different kind. <br><br>1. The film's non-stop story makes you empathize the main heroes every\nsecond of the action. <br><br>2. Every new episode makes the situation more and more weird. <br><br>3. The great feature of this film is the problem of choice, knowing\nthat you have an ability to change the world. <br><br>Not making it a spoiler I can say only one fact: the key moment of the\nfilm is the episode when Rita says a strange thing and Cage realizes\nits meaning. <br><br>I can not describe all my feelings after this film, because I want you\nto experience all them by your own soul. The only thing that matters\nnow is:<br><br>- Find me when you wake up. - What ? - Come find me when you wake up! <br><br>The film shocks more than \"The Matrix\" and \"Groundhog Day\" together ! <br><br>The film is a new way to see a parallel Universe and stay alive.\n"},
{"review": "\nThis movie is far underrated and didn't reach the box office success\nthat it should have. I believe this was one of 2014's better movies.\nThe story line is decent and original (with the possible exception that\nthey stole a bit from Groundhog's Day), there is an element of mystery\nto it, solid character development, great action sequences, the CGI is\nwell done, and it all ends up being very engaging. It's goes from fun\nto gritty and you can really feel it. Tom Cruise and Emily Blunt really\nconnect and do a good job acting, nothing stellar but far from awful.\nThe only issue with this movie that I can find is that it gets a little\nslow towards the middle but then picks up again at the end. This movie\nis a solid sci-fi action experience and will leave you wanting to come\nback to it.\n"},
{"review": "\nAs the story of EDGE OF TOMORROW unfolded before me, I couldn't help\nbut notice the similarities to two minor classics of 1990s cinema:\nGROUNDHOG DAY, in which Bill Murray is forced to re-live the same day\nover and over again, and STARSHIP TROOPERS, in which humans battled\naliens to the death. It's fair to say that the writers behind this one\nmined both films for inspiration and came up with a watchable, if\nlight, concoction.<br><br>The problem with EDGE OF TOMORROW really is its familiarity, but saying\nthat, it still works as a worthwhile Hollywood blockbuster. The action\nscenes are intensive and impressive, bringing to mind the hectic and\nwar-torn countryside of WW1, with which there are many similarities.\nDoug Liman, who handled THE BOURNE IDENTITY all those years ago, still\nhas a handle on delivering well-paced and exciting action, so that's\nsomething.<br><br>I'm not the biggest Tom Cruise fan around, but you can see why he liked\nthis role: he gets a chance to play a kook, a dummy, for a change. I\nstill think Emily Blunt keeps getting miscast in action-orientated\nroles, but she's acceptable here, and the supporting cast includes\nwelcome turns from Bill Paxton, Brendan Gleeson, and the like. The\nsci-fi storyline is filled with twists and turns and it doesn't make\nmuch sense if you think about it too deeply, and the CGI isn't all\nthat, but nonetheless EDGE OF TOMORROW is one of those films where you\nswitch your brain off and just sit back and enjoy.\n"},
{"review": "\nA tremendously exciting and funny, action packed, science fiction romp,\nfeaturing possibly Tom Cruise's finest performance in years.<br><br>Cruise plays Major Bill Cage, an ex advertising executive, who finds\nhimself ordered to join an invasion of continental Europe which as been\nover-run by aliens. A confirmed coward, Cage finds himself disgraced\nand demoted, and forced into combat. There something happens to him,\nresulting in his living the same day over and over, repeatedly being\nsent into combat. He meets Rita Vrataski (Emily Blunt), and together\nthey search for a way to beat the alien invaders.<br><br>Scenes repeat as Cage relives each day. Watching Cruise play against\ntype is part of the fun, but the film finds plenty of humour in the\nsituation, and we witness Cage learning to face danger despite his\nfear. His journey from an abject coward to a hero is plotted\nbeautifully, and Cruise gives a wonderful performance never losing\nsight of the levity that adds much to the films appeal. He is ably\nsupported by Emily Blunt as Vrataski, who matches his eventual grit and\nheroics. Bill Paxton features in the role of Master Sergeant Farell, in\nsome of the funniest scenes.<br><br>Doug Liman creates a visual treat. The invasion scenes are hugely\ndramatic and expertly constructed, creating a sense of reality, chaos\nand danger into which the leads are thrown. The action is breathtaking\nand the special effects entirely convincing. The film moves at\nbreakneck pace towards it's exciting conclusion, and not a moment is\nwasted. Liman packs so much into less than two hours that many other\nfilms can't match with much more run time.<br><br>The best thing Tom Cruise has done for some time and very highly\nrecommended. You'll be left breathless and stirred, just as you should\nbe by a great action movie.\n"},
{"review": "\n\"Edge of Tomorrow\" is easily sold as Tom Cruise's sci-fi \"Groundhog\nDay\", which feels kinda cynical, but there's also some \"Aliens\" and\n\"Starship Troopers\" thrown in. But in the end, that doesn't really\nmatter, because this movie hits it out of the park. It blazes as an\naction movie, and the sci-fi hook is a nice touch. Cruise can laugh at\nhimself getting killed every few minutes, which adds to the guy's\nlikability. And he's great in the action role. Same for Blunt, who's\njust one gorgeous militaristic badass. And there's just enough\nemotional substance to make for a happy ending to this thing. It's\nexhilarating, funny, sometimes even heartfelt. It's a well-done movie,\nall around.<br><br>8/10\n"},
{"review": "\nAfter 5 years of war against an alien race called Mimics, the Allies\nfinally win a victory and Sgt. Vrataski is hailed a hero after she\nsingle-handedly kills hundreds of Mimics. Thinking he's been brought in\nto use Vrataski's story to boost war efforts, Maj. William Cage (who\nhas no combat experience) meets with Gen. Brigham, but is told he'll be\nproviding coverage for the media at ground zero instead. After refusing\n&amp; trying to escape, Cage is sent into combat where he's killed within\nminutes but not before taking out an Alpha Mimic. Cage suddenly awakens\nthe day before his battle, and before long, realises he's caught in a\nmysterious time-loop. In time, he learns his only way out is to work\nwith Vrataski, and with each re-run they learn what needs to be done to\ndefeat the Mimics.<br><br>This is another classic Cruise Sci-Fi movie and no matter what you\nthink of him, he has a knack lately for starring in really enjoyable,\nexciting films. Edge of Tomorrow, while not perfect (what movie is?),\nis an excellent, edge of your seat Sci-Fi/Action film that definitely\ndelivers on all fronts...action, suspense, and a touch of comedy.<br><br>This film is huge and it's not hard to see where a lot of the estimated\n$178m budget went as the visual &amp; special effects, along with the\nmassive battle scenes, are absolutely fantastic. The story is pretty\ncomplex and you need to pay close attention to what is happening\nbecause if you don't you'll become lost pretty easily.<br><br>There is a very obvious Groundhog Day element to part of the story with\nscenes even containing some pretty good moments of humour, especially\nparts involving the members of J-Squad, and just when you feel that the\nstory it's starting to get TOO repetitive, it changes direction to keep\nyour interest.<br><br>The cast also do a fantastic job, especially Cruise and Blunt, who work\non-screen well together. Edge of Tomorrow is top-notch and is a movie\nthat is definitely worth watching.\n"},
{"review": "\nThere is the general stereotype that the script is the base for most of\nthe successful movies that has created an impact on world box- office\nbut there are some movies that has changed such perspective and showed\nthat screenplay could play the prominent role in making that movie a\nwinner.<br><br>After watching the 2014 sci-fi ''Edge of Tomorrow'' the only think that\nutter so naturally from our mouth is the silence, yes no doubt that\nmakes speechless, it's very unique and advanced stuff that has been\ntried in film making till now, though this theme seems to be tried in\n2011 ''Source Code'' this movie has very much new things to present to\nits viewers, to review such a well made movie could be said with very\ncomplicated appreciations like \u0096 ''the most softly presented hard\nmovie'' the screenplay is the soul of this flick, such a well planned\nscreenplay and the presentation shows the brilliance worked behind such\nneatly made movie, Aliens invasions are very usual concept used in\nHollywood but this movie with its very much unique way of presentation\ntakes it to the next level in cinema making.<br><br>Bourne director Doug Liman with such a tremendous work will surely move\nto the top list, Tom Cruise as Major William Cage has done a great\nwork, his on-screen presentation and some of those typical Cruise's\nstyle makes his followers to like his performance, Emily Blunt is also\nappreciable for her energetic portrayal as Special Force Warrior who\nfight against invaded invincible aliens, it's the entire team that\nreceives a huge applaud for making such a brilliant work.\n"},
{"review": "\nI put off seeing \"Edge of Tomorrow\" for a long time, the main reason\nbeing that I am not exactly a fan of Tom Cruise. But after hearing one\ngood report after another about the movie for a long time, I finally\nbroke down and rented the Blu-ray. And I'm very glad that I did. This\nis one big budget sci-fi movie that's very well done for the most part.\nThe basic plot isn't completely original - you'll see some small\ntouches of \"Groundhog Day\" here and there - but it is handled with\nintelligence. The character played by Tom Cruise (who I must admit is\ngood in this role) may be a coward (at first), but he's not stupid - he\nsoon catches on to what's happening and does what you'd probably do in\nthe same position. You'll probably guess what happens at the end before\nit actually happens, but all the same you won't feel your intelligence\nis insulted. As a bonus, the action sequences are also well handled,\nbeing very exciting while having the feeling things may not go\naccording to anyone's plan. If I have a complaint about the movie, it's\nthat some of the special effects - mainly the depiction of the aliens -\ndon't quite convince, coming across as obvious CGI creations. But I'd\nrather have this movie than one that's ultra slick-looking but stupidly\nscripted.\n"},
{"review": "\nThis is a welcome return to big budget form for Doug Liman after\nstumbling with the mess that was Jumper. This high concept screenplay\nis explored to its fullest potential and perhaps its greatest\nachievement is its sense of humor throughout. It's basically light\ngallows humor, watching Cruise die over and over again.<br><br>The film is very well made and it's a welcome change of pace to see a\nvfx film shot on 35mm giving some grain and texture to the effects. In\nan era of filmmaking where most effects sequences are pre- visualized\nto an almost sterilizing degree, the action filmed feels remarkably\nspontaneous - thanks to Liman's chaotic, figure it out on set style of\nfilmmaking, that has been aptly named 'Limania.'<br><br>As Cruise gets caught in this time loop where he repeats the same day\nover and over, the script fleshes this scenario out where it never\nfeels repetitive or predictable. A concept like this is prime for\nwriting itself into a corner and forcing a last act to resolve\neverything, but Edge of Tomorrow avoids such last act problems. A minor\ngripe with the script would be that no one recognizes Cage as an\nofficer, yet he is a prominent media figure that got millions of\nrecruits to join the fight. That aside, Edge of Tomorrow is a hell of a\nlot of fun.\n"},
{"review": "\nFirst off, I have not been a fan of Tom Cruise for a while (though\nthere were a few I liked). I did however enjoy this movie. It was sort\nof a mix of ID4 meets Groundhog day. It was actually enjoyable, even at\nthe beginning when Cruise is playing his douche self. That said the\npace of the movie really begins to pick up at about the 20-25 minute\nmark. It was interesting to watch the character develop (as if he\nreally had a choice), the skills he needed to fight the summers alien\nenemy. There was a surprising amount of humor in the movie &amp; it is easy\nto see where they could have made subtle changes to the script &amp; just\nmade it a lot darker, but they wisely remembered that it is supposed to\nbe a fun summer alien movie &amp; people don't really care for depression\nwith their sci-fi. All in all an enjoyable movie, &amp; one of the few\nCruise movies I would watch again.\n"},
{"review": "\nI was going to pass on \"Edge of Tomorrow\" but elected to see it based\non the high review average and my general love for sci-fi. Although I\nhave loved several of Tom Cruise's movies over the years I'd stop short\nof saying I'm a fan; I certainly didn't see this movie because he had\ntop billing.<br><br>Bottom-line this movie doesn't suck but don't expect it to blow you out\nof your seat either. Basically \"Groundhog Day\" mashed-up with \"Aliens\"\nand \"Starship Troopers\". See it in 2D definitely and maybe matinée.\nDefinitely a one-shot for me. I found myself checking my email a couple\nof times (except when Emily Blunt was on the screen that is!) Billed as\na sci-fi love story - it was a weird one. Strange chemistry between\nCruise and Blunt -- almost like he's trying too hard and she's doing\nher best but we know her heart's not really into it. I don't know how\nto describe it...weird vibe.<br><br>Was great to see Bill Paxton as a cocky grunt again!\n"},
{"review": "\nThere's a scene in Edge of Tomorrow where people in a pub are talking\nabout the possible motivations of the antagonist alien species might\nbe, Tom Cruise responds to this by saying \"what difference does it\nmake?\". This is obviously meant to be interepreted as a matter of\nfactly statement about the business of fighting for your survival but I\ncan't help but feel it's also a line put in there by the screenwriters\naddressed to the audience in which they're trying to tell you not to\nworry about the nitty gritty of plot details in a movie featuring time\ntravel as its premise.<br><br>And of course, getting past the fact that time travel as a plot device\ndoesn't hold up to any form of reasoned scrutiny it has to be said that\nwhat Edge of Tomorrow manages to do with this conceit is really\nenjoyable to behold. Bar a couple really tired clichés, the basic\nelements of plot progression and character interaction come together\nreally nicely here. Pretty much my only major complaints about this\nfilm are the generic and utterly uninteresting enemies, a retread of\nthe tired old mothership ending that grants our heroes an automatic\nvictory upon its destruction, sorely lacking audio production and a\nmiscast Brendan Gleeson who's completely out of place as a stern faced\ngeneral (I have never seen him pull off a stern face).<br><br>It's fantastic too that practical effects are used to such a great\ndegree and when CGI appears it rarely stands out.\n"},
{"review": "\nI happened to really enjoy this film. It delivers action, adventure,\ncomedy, and was definitely worth my time. Lately, I haven't seen too\nmany good Tom Cruise movies since Collateral (although Oblivion was\npretty good) but this movie was a definite step up for his career. It\nis definitely a movie you have to see in the theaters because of its\ngreat action scenes and good acting on Cruise's and Emily Blunt's part.\nAlthough, in my opinion, you get a great movie-going experience in the\nregular version rather than in 3-D. Again, I really really enjoyed this\nfilm and am still laughing about it days later. I would certainly\nrecommend it and urge you to see it if you are in the mood to laugh,\ngasp with excitement, and have a general great time. In fact, the only\nproblem with the movie was that there were some coincidental scenes\npresenting themselves when watching the movie. Besides this not-so\nworth mentioning flaw, this film is flawless.\n"},
{"review": "\nI wasn't sure what to expect but I'm glad I watched this film. <br><br>The only reason I'm giving it an 8 (would've given it a .5 if I could)\nis there were some minor plot holes but overall it's a great movie.<br><br>I'm pleased to see Emily Blunt in a lead action role and she kicked\nbutt.<br><br>Tom Cruise is Tom Cruise, no more no less.<br><br>Visually impressive, packs the right amount of action, humorous, great\npremise and well executed.<br><br>Happy to watch it again when it comes out on DVD.<br><br>Might consider watching it on 3D as well as some of the reviews give it\na thumbs up.\n"},
{"review": "\nThe special effects are good, the aliens are...well, wonderfully alien,\nbut the story relies on time travel and the repetition gets monotonous\nand you pretty much can guess how it is all going to end.<br><br>If these aliens are so smart they can shift time, what are they doing\ninvading planets like Earth. The convoluted logic as to why Tom has to\nkeep repeating the day is so shaky it ruins the plot. <br><br>I figure I am not adding a spoiler since the movie was renamed to add\n\"Live, Die, Repeat\" to the tile Edge of Tomorrow, just in case you\ndidn't quite get it.<br><br>Always looking for good sci-fi movies. Unfortunately this is not one of\nthem.\n"},
{"review": "\nWith both Tom Cruise and Emily Blunt I was fairly certain I would like\nthe movie, but I actually loved it. The story keeps you guessing what\nis going to happen next - but I won't get into the details and ruin any\nof the many surprises. <br><br>Cruise and Blunt play their unusual characters very well, but we also\nhave a great supporting cast including Brendan Gleeson and Bill Paxton\nand many lesser-known actors all delivering their lines well. <br><br>We saw the 3-D version because of the convenience of the start time,\nalthough I have never been a fan of 3-D. I'm fairly confident that the\n2-D version would be just as entertaining because it's such a cool\nstory. But the 3-D was enjoyable and helped the movie a bit - I think\nbecause it was not really an in-your-face 3-D despite this movie having\na lot of action scenes.<br><br>Yes, it is a futuristic doomsday scenario (are you getting tired of\nthem?), but this one is different and I found a lot of laugh-out-loud\nhumor in it. <br><br>I highly recommend it!\n"},
{"review": "\nJust watched an early screening last night, I was quite satisfied while\nmy girlfriend wasn't so impressed. <br><br>Here are the things in a nut shell<br><br>1. Actions are top notch, nothing look a bit CGI generated (even aliens\nlook fine), long shots are very convincing in 3D with good layer\ndistances, but some of the close actions look a little bit too fast and\nhard to comprehend.<br><br>2. The whole LIVE! DIE! REPEAT! thing is well established with unlikely\nhumor, it really draw me into the shoes of Cage (not Nic Cage, it's\nCruise's character), sometimes it is just too interesting to look at\nand you almost forget the big threat they are facing. Liman did a great\njob here to maintain audiences' interest without being \"repetitive\". <br><br>3. Emotional development is somehow weak comparing to the action and\nplot. We know there is an alien invasion coming but we just \"know\" it,\nwe don't \"feel\" it. Probably because we don't really know what Cage\n(Again, not Nic, nice try) cares about, we don't see him care about\nanything, except wining the war (maybe at some point we feel that he\nloves Rita, but it was not very well developed, things happened a\nlittle bit rush in emotional development). <br><br>As a male audience, I wasn't stunned but still completely satisfied,\nmaybe I just care about the plot and action more than the emotion (Just\nlike Liman's first Bourne, emotional development was lacking while the\nplot and action are stunning). But as a female audience, my girlfriend\nmay fell a little hard to feel for the characters, to care enough for\nthe plot and action.\n"},
{"review": "\nI saw the trailer for this in the theater and wanted to check it out\nbut my 11 year old regular movie companion passed, he was probably\nright at least for him. Cruise is an army officer with no taste for\ncombat who gets railroaded into active duty against, well, one really\ntough bunch of alien invaders. Just by chance he happens to come into\ncontact with a strange alien substance in his first battle and finds,\nafter being exterminated, that he wakes up one day earlier being\nrousted (again) for duty. When this happens several times he is a much\nmore capable fighter and begins to enlist the aid of Blunt, the \"Angel\nof Verdun\" who had the same thing happen to her some time before.\nCruise continues his trial by error, getting further along against the\naliens each day with the help of Blunt.<br><br>There is a grim humor to this, along with some pretty scary scenes.\nWhether you like Cruise or not there are certain movies just made for\nhim, see War of the Worlds, and this one is right in his wheelhouse.\nBlunt is equally fine as the no-nonsense warrior. I thought the script\nwas very intelligent and very involving and I highly recommend this\nmovie.\n"},
{"review": "\nEdge of tomorrow it's the perfect Sci-Fi / Action movie. The story is\ndamned cool and hook you after five minutes, the cast is great, the\nnarration is perfect, the visual effects are awesome and they are at\nthe service of the story, isn't just a lot of visual effects without a\nsense as Transformer. I can find some similarities with a lot of others\nsci-fi or war movie , the marine style is very similar to the space\nmarine of Aliens 2 , the beach landing is similar in some part to Save\nprivate Ryan..and so on ..But..they are different , you can find some\nsimilarities sure but Liman wad very able to create a proper style a\nproper word where everything seems credible. Both Tom Cruise and Emily\nBlunt are great as main character, but in the cast you can find also\nBill Paxton and Brendan Gleeson who are very able to distinguish their\ncharacters. I don't want to spoiler the story but I have to say that is\none of the best science fiction movie of the last years a must watch if\nyou like the genre.\n"},
{"review": "\nThis movie is so bizarrely ridiculous, it actually gets entertaining...<br><br>The first five minutes of action reminds you of Star Ship Troopers,\nwith fast moving bugs killing everyone in sight...In fact, all the\naction scenes resemble that slug of a movie...but the underlying plot\nis every bit Groundhog Day, with Tom Cruise reliving the same horrible\nday of carnage over and over, with slight differences each time,\nbecause the \"Alpha bug\" infected him with it's own blood when Cruise\nkilled it the first time...<br><br>You can never say this is a great movie, but once you get over the\nunbelievable parts that infest the first 45 minutes or so, it actually\nstarts grabbing your attention...ending up being rather entertaining.<br><br>I did give it a 6, even tho' it is a watch once movie...\n"},
{"review": "\nI saw EDGE OF TOMORROW!! That's right, I got to see Tom Cruise's new\nepic sci-fi summer flick and let me just tell you right now, it doesn't\ndisappoint! The movie stars Tom Cruise as an Army Major who gets roped\ninto participating in a live battle against an alien force as a PR\nstunt. Things quickly go south when his squad is ambushed and through a\nseries of uncommon events, Cruise's character finds himself with the\npower to restart the day whenever he's killed. It's like mixing the\nmovies Saving Private Ryan, Starship Troopers and Aliens with Groundhog\nDay which is pretty much like playing the game Halo on Legendary mode.\nEverything about this movie is a treat! The special effects are jaw\ndropping, the story is engrossing and the cast, headed by Cruise and\nEmily Blunt, puts forth a solid effort with especially entertaining\nwork done by Bill \"Game over, man\" Paxton and Brendan Gleeson. This\nmovie is bound to be the action movie event of the summer and it earns\nevery bit of it's high praise. If you have the chance to see it in IMAX\ntake it into consideration, if not, at least see it in a theater\nbecause it's bigger than big and more action packed than anything I've\nseen in years. Edge of Tomorrow machine guns it's way into a perfect\n5...out of 5.\n"},
{"review": "\nThere are so many sci-fi movies nowadays, all trying to make a\ndifference in a really chaotic genre. Well, the difference from now on\nhas a name and it's called ''Edge of Tomorrow''. The innovative script\nis combining hardcore sci-fi with groundhog's day plot. After\nconsidering as a deserter, Cage (Tom Cruise), is poured in the ongoing\nbattle with aliens. The battle against aliens goes wrong, but after his\ndeath, he notices that he's living the same day again and again.\nGroundhog day. The script is brilliantly clever and this makes Doug's\nLiman job an easy task. The director is constructing the film like a\nvideo game. Every time you lose, you have a new try to achieve game's\npurpose. The whole movie is reminding a video game with its spectacular\nmeaning. You can follow the hero searching every possible aspect,\nchanging the smallest detail, just to reach his goal and win this\nbattle. Additionally, the sci-fi element is magnificent. Aliens are\nmimics which look like fast android transformers. On the other hand,\nhumans have super robotic suits in order to fight these expeditious and\npowerful creatures. What else do you want? I repeat, in the whole\nmovie, you feel like you're watching a video game, processing stage by\nstage. Only a few movies have done something similar successfully.\nAlso, the plot is so intriguing that retains the suspense until the\nlast minute. Not only the director is doing a great job, but the cast\nis similarly pretty qualitative. Tom Cruise never gets old giving one\nmore absolute action performance. But the biggest surprise is called\nEmily Blunt, who is delightful in each appearance and we expect\nglorious things from her in the future. So if you love sci-fi and\nespecially if you enjoy video games you should definitely watch Edge of\nTomorrow, but the fact is that this movie is far more interesting than\nanyone would believe, thus it's a must-watch.\n"},
{"review": "\nA soldier fighting aliens gets to relive the same day over and over\nagain, the day restarting every time he dies. Like him or hate him Tom\nCruise knows how to make a great movie and if you do hate him this is\nyour chance to see him dying 33 times in multiple locations and ways.\nEmily Blunt is fantastic and it's so great to see Bill Paxton in\nsomething but also the effects and the soundtrack are amazing and\nalthough half of the film is live, die and repeat it's day changes\nsince our characters get to know more and more about their future and\nus as an audience we learn more about those creatures. As for the\nending i get this whole Alice Through The Looking Glass kind of vibe\nwhen you think that the hero dies for good he manages to save the world\non his own way or they just hint a sequel as always? Anyways the movie\nis just awesome and those suits are badass. On your feet Maggot!!!\n"},
{"review": "\nFirst heard about this movie from YouTube as one of the underrated\nfilms of 2014. I'm a fan of Tom Cruise and Emily Blunt. This is a great\nmovie. The only thing i wanted to see more was the romance from tom\ncruise and Emily Blunt.The acting in the movie is great tom cruise at\nhis best playing the hero of the movie. Emily Blunt playing a straight\nbad ass is different but in a good way. This is a original movie\nbecause i have not seen anything like it before.It would be interesting\nif they made a prequel to this movie about Emily Blunts character and\nbefore she met Tom Cruise. I'll definitively have to check out another\nmovie with these two stars together.\n"},
{"review": "\nOne thing first: how did Rita know that if you get blood into your\nveins you will loose the power, I mean shouldn't she have died and not\nwoken up again to realise that? How did she know? Other than this the\nmovie was great. <br><br>Real-life lessons:poor in this regard. The only think that I could pick\nup is that practice makes you great whatever that is. Everything can be\nmastered when practised and once you get used to the idea. Cage, a\nhysterical coward scared of war, becomes the best soldier because he\ntrains everyday and goes through the experience a lot of times. <br><br>Plausibility: I liked that they implied that Rita had become the angel\nof that previous battle because she had the power to reset the day. She\nwas great because she got to the same thing over and over again so a\nlot of practice. A kind of cheating method, she wasn't this born great\nwarrior. She became this warrior because she could rest time and do the\nsame things hundreds of times. This gives it great points to\nplausibility. <br><br>Character development: Cage develops slightly but i think it could have\ngone further and the same with Rita. We don't know Rita's motives for\nvolunteering and we know very little about her.<br><br>Acting/ Casting: both leads are great. I was pleasantly surprised by\nEmily Blunt. <br><br>Storytelling: Brilliantly done. It makes the movie very interesting. I\nloved how some scenes were happening for the fist time and some had\nhappened a hundred times before maybe but you just never knew which was\nwhich. Twists and surprises in the storyline were also done great.\nHumour mainly in Cage's character at the beginning was amusing and done\nto the right extent. <br><br>Overall, great movie.\n"},
{"review": "\nOverall: This movie has stunning visuals, impeccable acting and is\nhighly recommended.<br><br>Good: Once more, the visuals are stunning are well put together. The\npremise is great despite the whole 'Relive the Day' concept has been\ndone once or twice before. Lack of music develops an uneasy and a more\ntenser atmosphere which bodes well for the movie.<br><br>Bad: Personally, I just couldn't get behind Tom Cruise's character and\njust plain didn't like him. Not to say his acting was poor, it wasn't;\nI just don't think he was well written. Most of the supporting cast\nfelt useless and unimportant except perhaps one or two and the top\nmilitary professionals are morons. Numerous plot holes and\ninconsistencies here and there with some sloppy editing that should go\nunnoticed unless paying very close attention. Could have opted for a\nmore deadly and threatening looking alien race. They aren't that\ninteresting or creative other than their general design which is quite\ncool. The ending is just not satisfying for me and feels packed\ntogether to make it all happy and fun.<br><br>Best Part: The 'Day' were Tom Cruise just doesn't care and just wants\nto finish his mission.<br><br>8/10\n"},
{"review": "\nEver since Groundhog day, time-loops have had a consistent presence in\nmovies. Edge of Tomorrow gives the premise a sci-fi twist, as an\nunwilling soldier finds himself battling through the same day over and\nover.<br><br>This is first time-loop movie I've ever seen that offered an\nexplanation beyond magic or wishes, and while I'm not entirely\nconvinced it all makes sense, it all seems to make sense while you're\nwatching, which is the important thing.<br><br>You won't have much time to think about the story anyway, because this\nmovie never stops moving. It handles its premise very well, giving us\nthe highlights of what would be a grueling, years-long experience for\nthe protagonist.<br><br>Action scenes are fun, the acting is solid, and the movie manages to\nsqueeze tiny moments of human contact in between moments of alien\ndestruction. The movie never lags, and even though it's all about\nreliving a day, it's good at not repeating its own ideas.<br><br>The movie does get a little unfocused towards the end (but only a\nlittle) and the ending isn't especially convincing, but the overall\nexperience is terrific.\n"},
{"review": "\nIt is very easy to think that this movie depicts a video game and Tom\nCruise its character, but as I put it, it's not the case.<br><br>Tom starts off from a safe point in time and space, heads off towards\nan unsafe battle, and every time he advances a length more to his last\ncruise. It is akin to the way one starts off in a video game, and\nadvances every next game play to a better length.<br><br>Moreover, when the going gets tough and he is mature enough to\nunderstand the moves, he discovers a companion, Rita, who guides him in\nachieving the goal, killing Omega.<br><br>But the truth is vividly fascinating. The reason Tom is looping is\nbecause of the power he received through an alpha in his last battle,\nwhere he kills an alpha and is wounded severe enough in the process\nthat the alpha's blood gets into his body, giving him the same power\nalphas possess - looping in time.<br><br>Best of luck getting heart broken with the fact.\n"},
{"review": "\nGood Acting From Cage(Tom).. and Rita(Emily).. Great visual and sound\neffects,Loved The Soundtracks .. It's Just Unpredictable and Breath\nTaking.. Never Got Bored Of Over and Over Repeating.. aliens Doesn't\nHave The Ordinary Boring Look .. The loops were done in an interesting\nway, and even a bit of humour was put into it.. No stupid Sex and\nunnecessary romance .. Great Filming Locations Nice Battle suits The\ncostumes and make-up departments did a great job Nice Happy ending An\nexcellent treat to watch, a movie with a beautiful theme and story.\nBeautifully made with excellent directions. Hats off I personally do\nrecommend you to go and see it. It won't be a waste of your time and\nmoney.\n"},
{"review": "\nI wasn't expecting much and was really pleasantly surprised: this was\noverall great fun. I particularly enjoyed the relationships between the\ncharacters, the way they worked together and evolved on screen.<br><br>I enjoyed that Rita's actions were driven by necessity, duty and\nreason, and that it's Cruise's character who lets his feelings get in\nthe way of their mission, not hers. It is a nice shift in the usual\nemotional-women dynamic and is also fully justified by the plot, since\nhe gets to know her better every new day while she never gets to know\nhim more than 24h.<br><br>I also really, really much enjoyed that romance is almost absent in the\nscenario - it is unclear if Cruise's character has feelings for Blunt's\nas a person he loves or simply as a person he got to care for because\nthey went through so much sh*t together. The final kiss (sorry for the\nspoiler) annoyed me a bit, but seems like it was just a\nspur-of-the-moment/i'll die in 2 minutes thing.<br><br>(Just realized how much I'm annoyed by the fact that almost every\nmovie-relationship between two characters of opposite gender around the\nsame age always leads to a romance - no place for friendship,\ncamaraderie...So this was a really nice and welcome change in the\ntrope.)<br><br>So yes, if you love unromantic action movies with a bit of comedy, a\nbit of tragedy, good acting, great character writing and a original\nscenario - go see it! You'll probably love it.\n"},
{"review": "\n'Edge of Tomorrow' is the best Sci-Fi/Action flick one could hope for:)\nIt cleverly combines drama, action and surprisingly humor with the\nfantastic directing of Doug Liman (Bourne Identity).<br><br>Tom Cruise has without a doubt proved himself to be a shining\naction-star of this generation. Schwarzenegger, Stallone and even Bruce\nWillis, only wishes they had a film like this on their resumes.<br><br>'Starship Troopers' with a 'Groundhog Day' twist, sounds silly right?\nWell you'd be wrong when it comes to 'Edge of Tomorrow'. The savage\nalien 'Mimics' have attacked earth, and only a military Major (Cruise)\nwho has been unwillingly thrust into an alien war, must put an end to\nthe bloody conflict when he mysteriously obtains the ability to reset\nthe day whenever he is killed in battle.<br><br>Coming to the aid of Cage (Tom Cruise), is Sgt. Rita Vrataski (Emily\nBlunt), better known in the war as the 'Angel of Verdun'. Blunt does a\nfine job of being the 'Full Metal B*tch' next to Cruise, having her\ncharacter fleshed out more and more as the film progresses. Both her\nand Cruise make a decent pair although I personally thought someone\nmuch more attractive should have been cast in Blunt's role.<br><br>The trailers did a great job of concealing the Mimics/aliens, cause\nthey are savage and scary as hell when they are seen in the final film.\nHat's off to the effects team cause the visuals and designs of the\naliens are simply fantastic. The Mech-Suites look bulking and odd when\nthe actors wear them at first but once again, doubts are removed, cause\nthey are f#%king badass once in combat.<br><br>It's hard to find a flaw in this movie other than the fact it had to\nend. I wish the final scene went on longer so we could get a decent\nconversation between the two leads in the aftermath of it all. <br><br>Once again, when it comes to watching this movie; LIVE...DIE... &amp;\nREPEAT!!!\n"},
{"review": "\nI really wasn't expecting much from this one. After Cruise's awful\n'Oblivion', this looked like another generic action flick with no\nheart, no brain and no fun. Fortunately, Edge of Tomorrow is a smart,\noften humorous and very tense film. The visuals are stunning, and it\ncontains the best utilisation of 3D I've seen in a long while. Cruise\nis excellent (which grinds on me somewhat, as I really don't like the\nguy - but his talent is undeniable), and Blunt is effective and agile\nin her first action blockbuster. The comparisons to Groundhog Day are\nvalid, and it might actually help to watch that first. This is that,\nbut with monsters. A surprising treat.\n"},
{"review": "\nI was on the edge of my seat through out this whole movie. I heard it\nwas good, but man was I blown away. I'm glad I saw this and my only\nregret is that it wasn't in a movie theater. I'll definitely be picking\nthis one up on blu-ray and adding it to my memorable sci-fi movie\ncollection (that I just decided to start thanks to this movie).<br><br>The action, story (which I know isn't original), acting, and atmosphere\ncreated by the movie were spot on all through-out in my opinion. Very\nfew times do I dislike a movie, but also very few times am I left as\nsatisfied as I was by the end of this one. They type of satisfied where\nI know I just HAVE to buy the movie for myself.<br><br>If you haven't watched it do yourself a favor and check it out!\n"},
{"review": "\nOf all the movies I've seen (and there have been a lot of them), this\nmovie made me think the most.<br><br>In the end; Cruise's character having regained what he'd lost and\n\"repeating\" (1-time deal?) after the \"Queen Bee\" of aliens dies, or\ndoes he now have the everlasting ability (short of a transfusion or\nbeing put on life-support)?<br><br>When he introduces himself to Rita one last time; or has he met her for\nthe last time a million times? Perhaps they've lived long lives, and\nwhen he's old and standing at her grave or on his death-bed decides he\nwants to go back (\"repeat\") and meet her for the first time for the\nmillionth &amp; One time?<br><br>If we could \"repeat\" our lives (reset) from any moment in our past,\nwould we? Would I? Would you?<br><br>There was a 2-part of 'Doctor Who in which The Doctor's trying to break\nout of an unimaginable prison. Every time he tries, he dies and is\nreborn right back in that prison reliving trying to break out. The days\nturn to years turn to millenniums (4.5-billion years) until he finally\nmanages to find a way.<br><br>Emily Blunt was SO HOT in this movie (Edge of Tomorrow / 'Live, Die,\nRepeat) and Tom Cruise being one of my favorite actors (although he's a\npretty-boy and gets all the chicks so I have to hate him), if ever\nthere were a movie worthy of a sequel it's got to be this one, though I\ndon't think that will happen.<br><br>William Cage (Tom Cruise), Rita 'Rose' Vrataski (Emily Blunt) Who Are\nThey? Who do they become and where do they go from here, when the story\nends &amp; the future is a blank-slate, when or after they meet for the 1st\ntime for the Millionth &amp; One time?<br><br>\"Repeat\" . . .\n"},
{"review": "\nI am surprised that I have never even heard of this movie until now. I\nwould have liked to watch it in theatre but it was enjoyable on the\nbasement TV none the less. Because I had never heard of it and had no\nidea what it was about, I think I enjoyed it more as the ground hog day\nstuff caught me by surprise. I don't like giving spoilers and so I will\nnot go in to detail about the movie. But I will say that it is a pretty\ncreative concept and although very similar to ground hog day and deja\nvu... it is unique in its own way and not your average Sci if war\nmovie.<br><br>Watch, enjoy, repeat.\n"},
{"review": "\nI'm not a huge fan of Tom Cruise, so I went into this on the\nrecommendation of a friend and with no great expectation of enjoying\nit. I was pleasantly surprised how good it was. Not only is the action\nfirst rate, the plot is good too. Tom Cruise entirely sells the film,\ngoing from narcissistic coward to genuine hero. The guy can act and\nhe's not afraid to make a fool of himself when it's required. I had\nminor gripes, mainly with the accuracy of the British army guys\nportrayed. If you have to have fat people in movies, to fill some kind\nof quota, don't make them generals, please. I have still not recovered\nfrom Forest Whitaker cast as a British squaddie in The Crying Game.\nSeriously? Just no.\n"},
{"review": "\nIts my honest review about this movie. If u have not watch this movie ,\ni want u to stop reading this review watch the the movie first. I\nenjoyed it very much and i have watched it more than 3 times. Now,lets\ntalk about the movie. Everything of the movie is perfect\nstory,screenplay,direction,actor's acting etc . I don't want to write\nabout the movie story. I want you all who are reading this to watch the\nmovie. I promise you will not get bored. Just trust me and watch this\nmovie. I have recommended this movie to many people and the all like or\ni say they love it.i must say tom cruise doing great job in his every\nmovie .Edge of tomorrow Live die Repeat\n"},
{"review": "\nOh boy, I haven't seen a recent great movie in a while. Older classic\nmovies are timeless, but over the past recent years movies well\numm..suck. This one is a pleasant solid movie, bringing it back to\ngreat older movies. <br><br>Although, the plot is simple \"live, die, repeat,\" I appreciate how this\nmovie was directed with twists and surprises in the most unpredictable\nway. Today movies are too busy being centered on sex, nudity and\nviolence rather than the plot, concept and purpose of a movie, they\ndon't make them like this anymore. <br><br>I'm not going into every scene or the characters because I want you to\nwatch the movie yourself. The climax up until the ending of this movie\nis G-R-E-A-T! It keeps you in suspense.<br><br>Also I've never been a die-hard Tom Cruise fan either especially his\nbehavior in the last decade.\n"},
{"review": "\nI have been using IMDb for many years, but this is my first time\nwriting a review. I'll go straight to the point, as I'm not very good\nwith descriptive writing. The plot is absolutely terrific. I tend to\nget fidgety when watching movies, and start losing focus if I find it\nsomewhat mundane, but this was not the case. I was engrossed from start\nto finish. <br><br>I read some other user reviews and there was a particular one that\ncaught my eye, which I wish to paraphrase now. It has been an\nexceedingly long time since I have seen a movie with an unpredictable\nstoryline. and yet the twists don't seem forced, the transitions\neffortless. <br><br>Cruise always seems to be at the top of his game, and I do believe we\ncan't argue on the fact that probably no one would have been able to\nfit the role of Cage as well as he did. Also, this might sound cliché\nbut one of the huge + points for a reason to watch this again, would be\nthe intense and real chemistry between Rita and Cage. Emily did a great\njob as Rita, showcasing her versatility.Subtle facial expressions\ncombined with raw emotion brought out the vulnerable side of Rita as\nshe gradually opens up to cage.<br><br>I understand that judgement is purely subjective,and our opinions may\ndiffer,but I hope that this simple review of mine would allow someone\nout there to let go of his preconceived notions, and give this movie a\nshot( on blu ray of course)<br><br>As for me, I am now inspired to write more reviews on IMDb.\n"},
{"review": "\nEdge of tomorrow is no doubt one of the Tom cruise best films in his\ncareer.. Even though he is 53 he is still able to deliver a good acting\nand a good alien movie....<br><br>When I watched its trailer I was attracted towards it not very much but\na little bit. But after watching this I must say that it should be\nfranchise....<br><br>Both Tom Cruise and Emily Blunt were good pairs and good to watch in\nfilm the concept is never seen before concept and I liked it very much.\nI was Impressed by work of its Director \"Doug Liman\" before in The\nBourne identity and he kept it good in this film also.<br><br>I loved it and I will suggest others to watch this too.\n"},
{"review": "\nThis was a great movie. I didn't know the premises before I watched it\nand it totally caught me off guard. I really had no idea what was going\non at first (we all didn't) then it just kept throwing more and more\ntwists in, it kept you on my toes the whole time. <br><br>I wanted to write this review to mainly express my sheer fright at how\nutterly terrifying these aliens are. They don't resemble a human what\nso ever, they don't even represent an animal. The way the movie doesn't\nreally focus on the details of the aliens adds to this fright. I\ncouldn't think of a more terrifying enemy. They are hard to hit, move\nmaster than you can react, have out of this world strength, can go\nunderwater, can rip the metal doors off your vehicle, can travel\nthrough the dirt like the worms in Tremors, and has about 6-8 arms.\nThis was a tremendous enemy, no human could beat it one on one without\nmetal suits, very powerful firearms, and reflexes like a fly. Actually,\nthe only people who could beat them most of the time could see the\nfuture so yeah, I don't think humans would stand a chance.\n"},
{"review": "\nEdge of Tomorrow. A film that a lot Of people, including myself, passed\noff initially as another Tom cruise money getter, this film has a lot\nof heart and is really cleaver. It really is the action movie version\nof Groundhog Day. And although a lot of the major plot points, whether\nit be him being confused at first, or later him knowing too much which\ngets him into trouble, do mirror Groundhog Day, edge of tomorrow brings\na freshness and own individual look. It's a great action movie, which\nsurprisingly does not feel repetitive even though he's lived the day\nmany times, and overall, Tom cruise is the star that we all deep down\nlove. 8.8 for edge of tomorrow. If you enjoyed this review, be sure to\ncheck out my YouTube channel Quinn C (the one with the James Bond\nemblem). I review films old and new, as well as take in depth looks at\nthe James Bond series. If you like film at all, in particular James\nBond, please be sure to check me out on Quinn C (with the James Blnd\nemblem) on YouTube. Thanks\n"},
{"review": "\nI'm not a fan of Tom Cruise. I don't like his \"I'm the hero who saves\nthe world\" attitude. He's a famous movie star and he knows it and seems\nto bring that knowledge to every part he plays. So, it was with some\nreluctance that I settled in for Edge of Tomorrow. And was pleasantly\nsurprised.<br><br>It was a delight to see Cruise as a scared, even cowardice major in the\nUS army who is in public relations because he can't stand the sight of\nblood, \"not so much as a paper cut\" as he himself says. He is then\nforced into combat as a private and the scenes that follow are\npriceless and show how fine an actor Cruise really is. He was funny\ntoo, I laughed out loud at many a scene during that first day of\ncombat. Of course, as the day repeats itself, Cruise learns more and\nmore and in the end he does save the world. But by then he had made me\nfall in love with him so much that it didn't matter. Plus we where with\nhim every step of the way, and that makes all the difference.<br><br>There are some great supporting roles as well. Emily Blunt is\nwonderful. So is Bill Paxton. The other, minor roles, are all great as\nwell.<br><br>9 stars\n"},
{"review": "\nGroundhog Day meets Starship Troopers...with a hint of Philip K Dick\nthrown in.<br><br>A soldier fighting aliens gets to relive the same day over and over\nagain, the day restarting every time he dies. Intrigue commences. <br><br>A fairly clever sci fi/action drama, which is rare nowadays. Plot is\nvery complex but is for the most part reasonably watertight. There are\na few minor gaps and implausibilities, but it mostly works. Plus the\nwriters and director know when to quit with the clever stuff, and don't\njust start throwing clever twists and additional layers of complexity\nin just for the sake of showing off.<br><br>Good special effects.<br><br>Solid performances by Tom Cruise and Emily Blunt. While Cruise clearly\nis the main star, Blunt doesn't take a back seat and is as vital to the\nmovie as Cruise. <br><br>Decent supporting cast too.\n"},
{"review": "\nWhy does Hollywood have such a fascination with 'time reversal' movies?\nThis film is yet another one in the genre, where the lead character\nlives the same day over and over again. It may be possible if we\nconsider the 'many world's' theory, but again, the film at no time\nsuggests this. It incorporates elements of other films you may have\nseen, like 'groundhog day' or 'predestination' etc, but for a loop to\nbe created that makes a mockery of time continuum, then the 'other\nworld's' theory must be included as part of the dialog. Its the only\nway someone watching can make sense of it. <br><br>This is a visually spectacular movie, where the use of CGI is never\nunderused. Cruise portrays a believable character, where, on his\njourney of self discovery and stoic bravery, he leads the viewer into a\nworld of alien invasion and terror. Blunt too is excellent, playing the\nhardened, war weary veteran, with charisma and balls. There are comedy\nmoments and lighthearted homages to other films like it, but overall\nthis is a tense action thriller that leaves a lasting memory.<br><br>There are too many paradoxes created in this film for it to work in the\nquantum physics world, but its enjoyable.<br><br>8 out of 10\n"},
{"review": "\nThis has taken place of my all time favorite movie of Braveheart. What\npeople don't understand is no other movie shows the desperation of a\ncompletely humble human being when he is subject to no other choice\nthan survival. Same goes in breaveheart movie where Mel Gibson give in\nthe the progression of events that leave no choice but to fight. The\ndifference is he had a family to protect and he had few choices left\nbut in this movie when aliens are wiping out all humans there was no\nchoice left but to fight. This movie gives you courage and adrenalin\nrush you need to survive day today road rages and other events and\nsuppress fear of getting harmed. If you think about fear as a feeling\nbrought in by hormones you can control it. You can face the fact that\nyou can look at your chopped arm and embrace the fact that you are\nready to die without fear. Do not show your fear to anyone in any\nmoment take a punch and live happily with the fact that you have a scar\nbecause you fear no one\n"},
{"review": "\nI chose not to see this film in the theater, since going out to the\nmovies has become one of those endeavors that has become much more\nexpensive (comparably) for a family - I save my immediate viewing for\nmostly indie &amp; documentary films, along with a few favorite\nactresses/actors. However, since the reviews were so good and I love\nsci fi, I chose to buy this when it went on sale.<br><br>I'm really glad I did. Emily Blunt stands with Sigourney Weaver,\nMichelle Rodriguez and Linda Hamilton as sci fi women who are smart\n*and* kick ass. Tom Cruise hasn't been this good in a film in years -\nwhether it's the chemistry with Blunt, the directing, or the script -\nthis movie is well worth watching.\n"},
{"review": "\nThis is my first review in this site IMDb, and i apology in advance for\nsome mistake.<br><br>I think that this movie \"Edge of Tomorrow\" (2014) have interesting\nrepeat story. It is expensive and different version of other movies\ntheme is time loop: \"Source Code\" (2011) star Jake Gyllenhaal, \"12:01\"\n(1993) star Jonathan Silverman, \"Groundhog Day\" (1993) star Bill\nMurray.<br><br>Tom Cruise and Emily Blunt are stars in this marvelous action. But they\ncan't save the budget: $178 000 000 and after all the earned money are\nonly $100 189 501<br><br>But I hope someday someone to make similar movie, because i like this\ntheme time loop and for me this movie is in my favorite home box :)\n"},
{"review": "\nI initially couldn't help but feel that this movie was another Tom\nCruise ego project but then thankfully it started to get interesting. I\nwill admit that the concept is a bit of a stretch and the whole\ngroundhog day theme never really appealed to me but they did it in a\nway that didn't make you feel like you were watching the same thing\nover and over again.<br><br>If I had to change one thing it would be to simplify the story. There\nare too many competing ideas and the movie goes past in a blur of\ninformation. At one point I found myself questioning what this movie\nwas really about and the point of it. There is no real backstory as to\nwhy or how the aliens invaded which makes it a bit confusing. Aside\nfrom that though it's a good action flick.\n"},
{"review": "\nEdge of Tomorrow (2014): Dir: Doug Liman / Cast: Tom Cruise, Emily\nBlunt, Bill Paxton, Brendan Gleesan, Noah Taylor: Scientific version of\nGroundhog Day that dabbles on the issue of fate. Set in the future,\naliens have waged war and Tom Cruise plays Major William Cage who\nrefuses to be placed on the battle ground. This has him knocked out and\nforced into the middle of mayhem. He initially dies in battle yet he\nawakens repeatedly in the same place and repeats the same day until he\ngets it right. The goal is to destroy the alpha male but they always\nanticipate their arrival. Cage seeks out a freedom fighter, played by\nEmily Blunt and together they repeatedly try to figure out how to win\nthis war. Humor occurs when she trains him and he constantly gets\ninjured thus resulting in her shooting him and setting him starting all\nover again. Other roles include Bill Paxton as a gruff no nonsense\nSergeant, and Brendan Gleeson as a cynical General who initially forces\nthis position on Cage. Noah Taylor steals moments as a former\ngovernment scientist whom Blunt has recruited to help figure out the\nkey to destroy this alien race. Once Cage comes into play they progress\nforward but not without difficulty. Directed by Doug Liman who\npreviously made Go and the overrated The Bourne Identity. The\nscreenplay is inventive despite constant repetition. Cruise and Blunt\nhave great chemistry and the special effects are explosive with aliens\nthat seem unstoppable. Groundhog Day was more theme oriented while\nLiman's film goes for pure entertainment action that should place\nviewers at the edge of their seat. Score: 8 / 10\n"},
{"review": "\nAn alien race has invaded the Earth starting in Europe. After 5 years\nof relentless defeats where the Mimics seem to anticipate every move,\nthe United Defense Force finally has a victory with the invention of a\nnew jacket technology. Rita Vrataski (Emily Blunt) is hailed as an\nexample of the new success. William Cage (Tom Cruise) is a military\nmedia officer. General Brigham (Brendan Gleeson) is sending him on the\nfirst wave to cover the expected victory. He is arrested and forced to\nfight under Master Sergeant Farell (Bill Paxton). He manages to kill a\nlarge Mimic. He is sprayed with its blood and dies. He wakes up the\nprevious morning as a prisoner about to go into battle.<br><br>The action is fantastic. The idea is terrific. Tom Cruise starts as his\narrogant stock character and transition into his superhero stock\ncharacter. Emily Blunt continues to excel in a character reminiscent of\nher character in Looper. Everything comes together. This is funny and\nexciting. Doug Liman puts it all together into a great thrilling ride.\n"},
{"review": "\nEdge of Tomorrow is one of the most brilliant, original sci-fi films to\ngrace the big screen in recent years. Of course, it carries an infinite\nload of action sequences, but this is also a character story that\ninfuses sci-fi themes like time travel in a way. The film is\nessentially a louder, sci-fi version of Groundhog Day. The film is not\nonly fun, but it is also brainy which is hard to see in a sci-fi film\nnowadays. The film should have been seen by more people, because it's\njust that good. <br><br>Doug Liman's film is about a global war that is ongoing between the\nhumans and these aliens. Major William Cage is sent into battle despite\nhaving no combat training. As the battle is just beginning, he dies.\nBut he wakes up with day starting all over again thanks to making\ncontact with one of the alien's blood. Along with the help of one of\nthe world's best soldiers, Rita, Cage must relive the day over and over\nagain until he can defeat the aliens. <br><br>The film has great acting. Tom Cruise is getting older, but he still\ncan hold an action film on his own. There are no death-defying stunts\nhere, but I feel that Cruise once again does a really good job. He is\nequally matched by the gorgeous Emily Blunt. I don't associate her with\naction movies, but this movie may have changed my mind. I also liked\nBill Paxton as one of the army leaders. He is just quite funny. <br><br>Overall, Edge of Tomorrow is an excellent film that has such a well-\nfounded, original premise. The action is heavy, but that doesn't stop\nthe film from adding such good moments of characterization. As for\npopcorn summer blockbusters, it does not get any better than this. A\nsci-fi film that will actually make the audience think. A very good\nfilm with great visuals, good acting, and heavy on the action. <br><br>My Grade: A+\n"},
{"review": "\nVery interesting movie, but I see some Avatar style ripoffs, like the\nhelicopter designs, the base scenery, and the mechanism they wear for\ncombat. Just sayin, it looks like they bit Avatar's style a little bit,\nbut the movie is badass. I do like Tom Cruise of course, we all do, he\nportrays his character very well as always. It is an exceptionally well\nconcept to me, looping in time during a war. It makes for a riveting\nwatching experience because of the time looping, you're engaged and\nzoned in to the movie as soon as that starts, there are however some\ninexplicable things about the movie, like how did they force him into\ncombat after only being tased? Did I miss something? He gets tased then\nall the sudden he's been transported to the war in France. I tripped on\nthat a little, and Bill Paxtons character was whack, LAME acting with a\nstereotypical southern accent. It is a badass movie nonetheless. Check\nit out for sure!!! You'll like it!\n"},
{"review": "\nThis has to be one of Tom Cruise's recent toppers, and that alone says\na lot. The entire time, there is never a dull moment or lack of\nsuspense, yet we witness the key characters grow and develop a\nrelationship in training and the battlefield. There is a touch of\nsci-fi fantasy coupled with war and a bit of romance necessary for the\nviewer empathy, yet just enough and not over the top. There are a few\nsurprises, and certainly the viewer is never sure whether our main\ncharacter will make it but rooting for him each time. Arguably we can\ntell when the final battle takes everything he can give it and there's\nnot another reset to save him. There's equally a subtext of humor that\nallows us to see imperfections that are more likely for an amateur\nrecruit, particularly in the beginning.<br><br>There is a paradox at the end with the time reset. If our hero's blood\nbeen transfused with the alien enemy's, which ultimately causes the\nreset, wouldn't that logically have irradiated him when he destroyed\nthe alien?\n"},
{"review": "\nEdge of Tomorrow is a terrible title. <br><br>But it is an awesome movie. <br><br>I'm one of those jaded moviegoers who has seen everything in nearly 40\nyears. I even read the original Sakurazaka novella and was expecting a\nhorror show. I don't even like Tom Cruise, but darn it, I honest to\ngoodness enjoyed the heck out of this movie. <br><br>Is it flawed? Of course it is! The opening premise is shaky. I just\ncan't side with Hollywood replacing Japanese characters with bankable\nnames like Cruise and Cage should be Keiji and played by a Japanese\nactor. But I'm going to let this stuff pass. Emily Blunt was tough as\nnails - and that's been a hard sell for Hollywood. Tough women - Linda\nHamilton tough - haven't been handled well by the studios and that's\nnot saying the women aren't out there. Blunt pulls off the famous red\nwarrior with ease. I'll even say it - Cruise does a good job, however,\nI still cringe when proper story and characters are buried in favor of\nthe same old faces.<br><br>And then there's that ending ripped right from Pacific Rim. We know\nit's coming. Even when i finished the novella, I knew it would never\nfly in Hollywood. That and it's quite a bit more complicated. Or maybe\nLiman filmed it all but the test audiences hated it. There's no\ntelling. But I still enjoyed the ride.<br><br>Basically: Slaughterhouse Five + Groundhog Day + Pacific Rim + Elysium\n= Edge of Tomorrow. The movie is - literally - about ten movies you\nhave already seen 1000 times. And it is awesome.\n"},
{"review": "\nLike other people, I like this movie. It take again the idea of\nextraterrestrial versus humanity, a common topic inclusive on video\ngames. This is the third movie were Tom Cruise confront\nextraterrestrial. The cast is very good. I like the scenes about London\nand Paris. It remember Day \"D\". The sound effects are incredible. The\nstory is good, and you can't imagine the role performance by Tom\nCruise. I liked photography a lot. Some of the quotes are good. It's a\ngood sci fi film, and it is a good start for summer. Some scenes are\ninclusive funny. One thing is true in this movie: Since start to end\nyou are going to be attending all action on screen.\n"},
{"review": "\nThe movie starts off with a great pace and continues with it till the\nend.I enjoyed the movie throughout. It is truly,as many of them have\nsaid \"The best original sci-fi flick after Inception\". Tom Cruise is\nback in the game. The presence of humor in this film is surprising and\nis great.The action is fast paced,exhilarating,slickly\nexecuted.Performances by Tom Cruise,Emily Blunt are great.Presence of\nBill Paxton makes the movie more enjoyable.Coming to 3D,I found it very\nengaging.It was jaw-dropping awesome.Surely the 3D makes you move your\nhead here and there because many things fly off the screen suddenly. In\nless than 2 hours we go through a hell of a ride which sure cannot be\nmissed.I strongly recommend this movie to everyone.\n"},
{"review": "\nThis was a totally pointless exercise and a terrible waste of the\ntalents of Emily Blunt.<br><br>We've seen too many of these existential nightmare type scenarios and\nthis wasn't even an interesting or amusing variation on the theme. If\nall you care about are glitzy special effects and a bad light show with\nno story to offer then this is the movie for you.<br><br>The idea that someone thought that it was a good idea to charge people\nmoney to see this piece of garbage highlights how desperate Hollyweird\nis for new ideas. This isn't one of them.<br><br>I am not a Tom Cruise fan and came to this film because of my interest\nin Emily Blunt and Brendan Gleeson. I am heartily sorry that I wasted\nmy time watching this piece of junk. I should have known better. Cruise\nhas been a disappointment since Top Gun. Why should I have been silly\nenough to expect anything else.\n"},
{"review": "\nThis move isn't good it is amazing and i enjoyed every second of\nwatching it and according to me it's the movie of the decade. I laughed\nmy ass of several times when he died and just re spawned again it was\nso freaking Hilarius and a bit unexpected, especially when he gets hit\nby a truck. I love how it has mixed excitement, violence and comedy. I\nknow that it doesn't say comedy but it really should I mean sometimes\nit was just clear humor. I think you should make a second one or\nanother movie that is as genius as this one is. Love that you have put\nso much effort in the movie and every1 that is involved in the making\nof this move should feel proud of themselves.I have one thing left to\nsay and that is ''Great job''.\n"},
{"review": "\nDirector Doug Liman's \"Edge of Tomorrow\" is \"Groundhog Day\" on steroids\nwith some mean looking aliens. The movie stars Tom Cruise as Lt.\nColonel Cage, who is sent into battle against mimic aliens who have\ndestroyed much of the world. Cage is not really programmed for battle,\nprobably because he was caged too much in military offices instead of\nthe battlefield. Cage is scared out of wits, but then something\nmiraculous happens; he dies in battle, and then relives the same day\nrepeatedly. Why that happens? Let me not spoil if for you, but let's\nsay that he became a blood brother of the Omega alien mimic fraternity;\nthey have that? The stunning Emily Blunt co-stars as Rita, a fierce\nwarrior who was pivotal in destroying many of these mimic aliens in a\npast war. Cage groundhogs into Rita's world and the two team to destroy\nthe Omega mimic plan to destroy mankind. The first two acts of \"Edge of\nTomorrow\" kept me on the edge of my seat with its inventiveness in a\nfuturistic action movie. However, the third act of \"mimic aliens vs.\nhuman soldiers\" action unfortunately mimicked many other formulaic\nbattle-oriented action flicks. I did like Cruise and Blunt in their\nperformances; and to be blunt with you it was refreshing to see Cruise\nas a coward character and not cruising with the same old \"machoman\nsaving the world\" typecast character he has played many times before,\nwhile Blunt cruised with another bravado performance. So let me finish\nthis review before it ends on the edge of tomorrow. But if you got\nnothing going on tomorrow, it's not a bad idea to live &amp; relive the\n\"Edge of Tomorrow\". **** Good\n"},
{"review": "\nThis movie combine everything a good action\\sci-fi movie need. From\ngreat computer generated to great sound effect to awesome shooting and\nacting. All this with good humour and a lot of sense. Yes this movie\nmake a lot of sense and work great. I found only one minor mistake at\nthe first view and it should be not a problem for most people I guess.\nI think that if a movie require a lot of work and experience, this kind\nrequire even more. And it is very surprising to see how well they made\nit work and entertain from the beginnings to the end. We can see, in my\nopinion, how advanced and experienced are the movie team(Those who make\nthe movie) and actor of this great product.\n"},
{"review": "\nSaw this three times, at the movies. Love time travel movies, and sci\nfi, which is why I went to see this one despite Tom Cruise. I have\nnever been much of a fan of TC, not sure why. Does he try too hard? Is\nhe too American, whatever that means? Like Taylor Swift? Anyway,\nwhatever, Mr Cruise Is PERFECTLY cast in this movie. I mean he is\nREALLY an Unlikeable Character at the beginning of this movie, almost\nwithout trying. Then he dies, over and over, and over, and at the end,\nyou REALLY Don't Want Him To Die. <br><br>Really bad baddies, really good goodies, grit, determination, courage,\nloyalty, fear, frustration, bravery and nobility. Being prepared to die\nfor what you believe in...Yup. I''ll be seeing it again real soon.\n"},
{"review": "\nLet me first say that if you're looking for another review talking\nabout how this is a militarized version of Groundhog Day, I refer you\nto half the other reviews written. If instead you're interested to hear\nan honest take on another Tom Cruise shoot-em-up I thought I could\nnever love, continue reading.<br><br>This movie is the right mix of action and thought provoking plot\ntwists. Getting the chance to follow Tom Cruise and Emily Blunt as they\nnavigate their way through an unchanging scenario where mistakes lead\nto death and death simply means \"try again\" is incredibly rewarding. I\nwas skeptical that the film might come off as repetitive but Cruise's\nchanging reaction to the same situations coupled with the slight\nchanges in scenery and outcome keep the film feeling new and engaging\nthe whole way through.<br><br>Would recommend\n"},
{"review": "\nGround Hog Day meets Aliens meets Oblivion....takes great elements from\neach and adds others to make a great movie. I love all 3 movies, and\nthis one absolutely does not disappoint. It reminds me of a video game\nin which you die and come back with memories of what led up to the last\nencounter before you died and you learn from it. One might think it\nwould appeal only to video gamer-aged mentalities....maybe it might,\nbut I loved this movie. This movie is clean and well produced. Special\neffects are great. Nothing is too far over the top. Well-balanced.\nCharacters are as well developed as necessary without drowning...the\naction and plot are fast-paced. This movie does not pander.\n"},
{"review": "\nI usually think sci-fi movies have too many plot holes, and this one\nhas some, but for the most part it makes sense. Of course, they are\nusing the plot of groundhog day set in an alien invasion. One big plot\nhole is why didn't Rita leave herself notes so she wouldn't have to\nrepeatedly meet Cage over and over. And the whole part where she and\nthe scientist dude figured out some aliens are Alpha protecting an\nentity called Omega, was very far fetching. But anyway it was cool to\nsee how Cage improved day to day to get further on the battlefield.\nConsidering we are talking about invading aliens, why did others, like\nthe general, find it so hard to believe Cage and Rita about time\ntravel.<br><br>Anyway, it ended how it should with Cage waking up again except this\ntime, things are different.<br><br>FINAL VERDICT: Pretty good sci-fi with cool special effects. Definitely\none of Cruise's better films in the past 10 years.\n"},
{"review": "\nBest Sci-Fi of the year. Great Performances. One to not miss. ...\nRecommend to any one that likes Sci-Fi movies.<br><br>Edge of Tomorrow kick ass from start to finish. What a roller-coaster\nride! This will be hard to top in the upcoming summer season. There is\nnothing wrong with this film. It's got everything.<br><br>Overall I would highly recommend this film to anyone who likes Sci-Fi,\naction, or anyone who wants to watch a good film that you will have fun\nwith. It's highly enjoyable, well done, and easily accessible. It's\nexactly what a big budget Hollywood movie should be.<br><br>I highly recommend it!\n"},
{"review": "\nThis century, evidently thanks to advanced digital technology, has seen\ndozens of futuristic movies where the world is to be saved from alien\ninvasion. Most of them have both the plain plot and ending, and all\naction in focused on visual effects. The latter plays also an important\nrole in Edge of Tomorrow, but, fortunately, a new angle - in the form\non recurrent time loop - and twisted humor make this movie an\nentertainment distinct from other of the kind, perhaps as the\nscreenplay is adapted from a Japanese light novel. The very ending has\na pleasant \"dodge\" as well.<br><br>Anyway, you have to concentrate and ponder, as things get intertwined,\nrepeated scenes are combined with new elements, and the chemistry\nbetween Tom Cruise as Major William Cage and Emily Blunt as Sergeant\nRita Vrataski is good as well; besides, Bill Paxton as Master Sergeant\nFarell and Brendan Gleeson as General Brigham provide small, yet\nmemorable performances. As for the effects, the enemy's look is\ndifferent, and the likeness of the equipment/technology used by the\n\"good guys\" with the ones used in related movies is not annoying as\nthey are not means for torpid destruction. The creators have taken all\nwith ease, sometimes it seems that they laugh even at themselves.\n"},
{"review": "\nLittle Spoiler<br><br>Very good and efficient movie. I loved the first part. The discover of\npower, the use of them, the ability to improve himself. Tom cruise,\ngood actor here, play the role of a video game character where you\ncould save just before attacking a big boss. I recommend it a lot. It\nis the only film I know which mix the temporal loop and war. I still\ndon't know how very good villains (which look like Matrix creatures)\nare able not to strengthen the protection of the most important thing\nthey have ! (like Death Star in Star Wars). Just for this It put 9/10.\nBut It is close to a 10.<br><br>Don't hesitate !\n"},
{"review": "\nThis is the Best movie I have seen in years, and I watch a lot of\nmovies. Groundhog day and Independence day have a baby and you get\nthis.. Plus adding Tom Cruise and Bill Paxton to the mix is the icing\non the cake. The beginning of the movie is a tad confusing, but you\ncatch on very quickly. Within about 10 minutes you are hooked on this\nmovie and know you have a gem on your hands. Its rare when you don't\nwant a movie to end, but this was the case with this movie. I hope they\nmake a sequel , it deserves it. Bill Paxton is hilarious and reminds me\nof his character Chet on weird science, and Tom Cruise is a great actor\njust like in all his other movies. So if you watch this make sure you\nsit down, and don't plan on getting up for anything.\n"},
{"review": "\nI was fully prepared to be frustrated with wasted time during the\nrepeats in this movie given the premise. I have to admit, though, it\nwas handled well. <br><br>Tom Cruise was cast perfectly at the beginning of the movie as the\nsoft, bureaucratic military officer and his growth into a hardened\nsoldier was realistic and well-acted. <br><br>With apologies to Keira Knightley, Emily Blunt may be the most\nbeautiful woman in Hollywood sans makeup. She was rarely portrayed as\nvulnerable in the movie, and that was a nice refresher from the\nstandard woman-in-power's perceived weakness.<br><br>Bill Paxton brings the score down in this movie, as he remains one of\nthe worst actors in show biz in my opinion.\n"},
{"review": "\n*** EDITED UPON SECOND WATCHING OF THE MOVIE***<br><br>Brilliant! Unique! Suspenseful! Fun! <br><br>All this and more. This movie is a must see action packed jewel in the\nfilm-making of this century.<br><br>CASTING did a perfect job as well! Tom , Emily, Bill were all perfect\nfor their roles. <br><br>This is in a way a perfect movie. Fun, enjoyable, gripping, with a bit\nof romance. The only thing not perfect is 8 or so minutes towards the\nend of the movie, but after that it finishes great! <br><br>In the end, this is one of my top movies of all time. <br><br>Real rating: 9.7<br><br>MY RATING SYSTEM:<br><br>9.4 - 10 = rating 10 ***** 8.9 - 9.3 = rating 9 ***** 8.3 - 8.8 =\nrating 8 ***** 7.7 - 8.2 = rating 7<br><br>7.0 - 7.6 = 6 6.0 - 6.9 = 5 5.0 - 5.9 = 4 4.0 - 4.9 = 3 3.0 - 3.9 = 2\n1.0 - 2.9 = 1\n"},
{"review": "\nI'v got to like Tom Cruise in sci-fi movies lately which I wouldn't\nhave said ten years ago' the thing about this movie is the humour for\nme' every time he dies I just found it so funny for some reason. The\nmovie is based on an alien invasion on earth and cruise plays major\nCage who is trying to sell the war to the public and is thrown into the\nlions den by his commanding officer (played by brendan gleeson' who\ntakes an instant dislike to cage) where he comes across a platoon of\nsoldiers and their commanding officer (bill Paxton) where he quickly\nfinds out that the war is basically a slaughter and he has to relive\nthe nightmare time after time against an enemy that knows their every\nmove, step in' Rita Vrstaski (Emily blunt) who is the poster girl\nspecial forces hero, and gives cage some startling news that he's\ntotally unprepared for. this is one of the best sci-fi movies Iv'e seen\nfor a long time carried of by Cruise and blunt very well' the ending is\na bit predictable but there's enough going on in the rest of the movie\nto keep us all entertained for a couple of hours.\n"},
{"review": "\nI'm not especially a fan of Tom Cruise and even less a fan of science\nfiction. But this film rocks. I do not want to spoil it for everyone\nbut it is seriously entertaining and original. This movie; despite the\nfact that it is made of multiple concepts already seen separately in\nother movies, is something completely new that hopefully no one will\ntry to imitate without talent. It could actually open a new gender,\nbetween video game and movie. A movie to be seen by everyone. Actors\nare great, special effects are awesome, and the plot is really\noriginal. I do not usually recommend movie on IMDb but this one does\nmerit it. Tom cruise, Emily Blunt and the entire cast at their best.\nI'm missing some words to end the tenth line of comment but to\nconclude: this movie is a safe bet for your friends and family! <br><br>PS: (and for once, just a single kiss for the love story part!!!! my\ndream as a kid!)\n"},
{"review": "\nThe actors in this film shows you why when you get the perfect gimmick\nbetween great actors and great screen writers with an awesome director\nyou get an awesome cool movie. <br><br>i watched this film expecting nothing, just a modern warfare big alien\nwar, but as they say, never judge a book by its cover. Doug Liman ( the\ndirector) does a perfect job and the screen writers were just\nbrilliant.<br><br>Its hard to describe without putting any spoilers, i advise you to\nwatch this movie, now or whenever, this is going into the history\nbooks, one of the best. a must watch guys!\n"},
{"review": "\nI really do respect Tom Cruise a lot as an actor because of the amount\nof hardwork he puts into his films,but, had not enjoyed any of his\nprevious ventures post MI4. To add to that I'm not a fan of Sci-Fi\ncinema. Despite that, I braved to watch this movie, as I had heard rave\nreviews about it, and boy, it was a treat!!<br><br>Europe is attacked by an ET species and their only hope is an officer\nwith absolutely no prior experience in combat,who is stuck in a time\nloop,after accidentally killing one of the aliens and having it's blood\ntransfused. Even though,dying repeatedly and going back in time to go\nthrough the same routine,like in Groundhog Day, seemed to be\npredictable and I expected to get bored. But, every time , Cruise\npresented his character in a different fashion and was able to emote\nalmost all the feelings a human possibly can with ease. His comic\ntiming was right on the money. <br><br>Director Doug Liman did a great job behind the camera. The story was\ninnovative and almost all the loose ends were tied by the time the film\nended.The special effects and BG score were good. Of the cast, Emily\nBlunt was brilliant; so was Bill Paxton. But, the film belonged to Tom\nCruise, who was absolutely perfect. It was easily his best performance\nin the last decade or so. Sheer delight.\n"},
{"review": "\nA Clever, fast-paced action movie with a welcome streak of dark humor.\nThat would be my summary of this movie.<br><br>At first glance, one just can't help it to be skeptical. Another action\nmovie with Tom Cruise. We had some over the last years, and they were\nmediocre at best. The theme of the movie could have well been wasted\nlike we have seen many times before. Fortunately, it was not. <br><br>The trailer promised us a Sci-Fi spectacle, and the movie delivered\njust that. Beautifully orchestrated battles packed with a clever theme\nrounded with an edgy steak of dark humor that brightens the movie,\nbalancing it nicely.<br><br>A must see movie. Enough said.\n"},
{"review": "\n\"Edge of Tomorrow\" successfully manages to portray a complex, sci-fi\nstoryline that respects the intellect of the viewer while also\nproviding jam-packed action. It is inevitable that any time-traveling\nstoryline has plot holes, so don't waste your time figuring out the\nlittle details and just understand the main back-bone of the plot. <br><br>Tom Cruise aka \"Officer Bill Cage\" gains the power to continuously re-\nlive the final day of a worldwide invasion against an alien organism.\nHe must attempt to change the course of the war alongside Emily Blunt\naka Rita \"The Full Metal Bitch\" Vrataski, who previously held the power\nof resetting the day.<br><br>Story lines this complex are always destined for failure without solid\nacting...just look at The Matrix. Cruise's drama, humor, and character\ndevelopment keeps the viewer on the edge alongside an excellent dynamic\nwith Emily Blunt. On a side note I appreciated that Blunt used her real\naccent in this film, brings out the seduction in her character...unlike\nher horrendous American accent from \"Looper\". <br><br>To all sci-fans, please be sure watch this movie before it leaves\ntheaters to see Tom Cruise at his absolute best.\n"},
{"review": "\n\"Edge of Tomorrow\" is first and foremost an action film. I saw the film\nin IMAX 3-D. It really does present a spectacle. The special effects\nare second to none.<br><br>Like the film \"Groundhog Day\", there are significant humorous elements.\nThese manage to keep the tone fairly light despite the ominous theme of\nthe story.<br><br>Tom Cruise and Emily Blunt portray likable characters. This makes it\npossible to invest one's feelings in what happens to them.<br><br>The most critical part of the film is the story, which keeps you\nguessing. At one point, I thought it's was going to be really difficult\nfor the writer(s) to resolve the dilemma of the protagonist without it\nseeming cheesy, but it was resolved without losing any of the film's\nintegrity. That's good writing.<br><br>The supporting cast does a great job of adding to the experience. Since\nthe story has some repetitious aspects, it is important that they be\nconvincing.<br><br>I would recommend this film to any sci-fi fans.\n"},
{"review": "\nEdge of Tomorrow is a fantastic spectacle! While it's been a banner\nyear for great action movies such as Captain America and Days of Future\nPast, this has to be the surprise hit of the summer to date. From start\nto finish, not only does this live up to the trailers, it surpasses\nthem. I really liked this well paced, engaging sci-fi film. <br><br>It's one of those movies where you feel you've seen it before, but just\nnot quite in this way and that's what makes feel fresh and new. Part\nThe Matrix Revolutions, District 9 and a few time travel movies I can't\nquite put my finger on, yet the sum of the parts feels like something\ncompletely unique and wholly entertaining. I think the last time I felt\na movie was such a great mishmash of different movies was Inception.<br><br>This is also vintage Tom Cruise. He commands the screen with his wit,\ncharm and emotion; for me this is his best movie since Mission\nImpossible: Ghost Protocol. If you thought Cruise couldn't carry a\nblockbuster anymore, Exhibit A. Admittedly, what makes this movie work\nwell however is Emily Blunt; she is excellent! Together they had\nsurprisingly great chemistry and are the backbone of the movie. They\nprovided a few genuine, moving moments (always appreciated in an action\nmovie) that elevate the film. <br><br>There's plenty of action, the special effects are solid and there's\nmore than enough humour to balance it all out. Essentially, this movie\nhas all the elements of a great summer blockbuster and is right up\nthere with Days of Future Past as the best of the year to date. Don't\nmiss this!<br><br>Enjoyed my review? Keep in touch! <br><br>Blog: www.themoviesnob.ca <br><br>Twitter: @the_movie_snob\n"},
{"review": "\nI just went to see it.<br><br>Didn't want to know too much about it going in, I saw some trailers but\nthey didn't really spoil anything. I was a little afraid it would\nresemble Source Code, but I never got that idea experiencing Edge of\nTomorrow.<br><br>I would have given this movie an 8, but I gave it a 9 because I want to\nencourage the makers for bringing more original sci-fi movies to the\ntheaters.<br><br>Edge of Tomorrow is a real bliss, not knowing what's gonna happen next.\nA great ride. Everything was right, the FX, the acting, the chemistry\nand the absence of a forced romance. I hope this movie will make enough\nbucks to convince the studios to do more original Sci-Fi movies.<br><br>Go see it if you want to see something different, something that is not\na sequel or a franchise. Respect for Tom Cruise for taking these risks\n(like Oblivion).\n"},
{"review": "\nNo capes. No rubber suits. No endless and pointless montages of\ncitywide destruction. No teaser at the end for the inevitable sequel.\nJust a fantastic story, adapted into an excellent screenplay,\nwonderfully acted and well directed. The Edge of Tomorrow was, in my\nopinion, the best film of the year so far. Tom Cruise is pretty much\nthe only Big Movie Star who is doing what big movie stars are supposed\nto do - finding great stories and using their charisma and talent and\nfan base to get those stories told. And he is great in this, likable,\nfunny, physical and convincing. In short, everything a big movie star\nshould be. I won't go into the story, as I feel it's best discovered as\nyou go along - but I absolutely recommend that people should see this\nfilm, and support original and clever film making.\n"},
{"review": "\nDoug Liman, the man behind the Bourne series is just back with an\nawesome product.The movie's success is clean screenplay, crisp editing,\nbest CG and terrific background score.<br><br>Many time-loop/travel movies are there ,but what makes it different is\nthe treatment of the story, well supported by classic editing and\nterrific screenplay.<br><br>Kudos to Tom Cruise and Emily Blunt. The way they carried the movie is\nawesome.<br><br>The movie is one of the best of its kind.A time-loop movie with no\nloophole.Watch it on big screen. Highly Entertaining.<br><br>Highly Recommended.\n"},
{"review": "\nI just saw this movie, and I was surprised in a good way. I was\nexpecting this to be another okay alien movie, but as I was watching, I\nrealized that this movie was more about the plot and the story, rather\nthan just action and scary scenes. I liked the humor in the movie. One\nof my favorite scenes, was when Cage was doing the push ups and then he\nrolled under the car and got smashed. I found that scene very funny.\nThe battle scenes in this movie were absolutely spectacular. I enjoyed\nwatching all of the humans fight the really cool looking aliens in the\nreally cool suits. Rita was pretty cool with her sword. She took down\nthose aliens like it was the easiest thing in the world. Cage was\npretty funny when he couldn't figure out how to take of the safety.\nThere are only two things that I didn't like about Edge of Tomorrow was\nhow many times that Cage starts the day over in this film. I think they\nwent a little overboard on that one. The movie was the same thing until\nhe gets to the farmhouse. I thought that they could have done a little\nmore with the ending. I won't spoil it. I let you guys think about\nyourselves. There was something else that the director could have done.\nThanks for reading, and think about what you thought should have been\nthe ending.\n"}
]