[
{"review": "\nLet me start by saying that \"American Sniper\" has portrayed the true\nface of Americas great brainwashing weapon called \"Hollywood\".<br><br>As in the movie \"Inglourious Basterds\" where Dr Goebbels, Reich\nMinister of Propaganda in Nazi Germany from 1933 to 1945, has been\ngiven a right to direct a movie for Fuhrer himself, a national pride\nperformance which depicts a war hero, German Sniper killing 300\n\"enemies\" in three days. Now switch the roles with Clint Eastwood as a\ndirector, Fuhrer as a Americas high elite of nowadays, and Nazi Sniper\nas an American Sniper Chris Kyle.<br><br>A big irony this movie is, and as such it shows how much effort will\nAmerican Movie Industry give in order to brainwash its own people.<br><br>Pathetic.\n"},
{"review": "\nit was extremely 'even'. nothing seemed overplayed. well balanced\nstorytelling. as someone else wrote, best war movie i've seen in\nyears...and while we're at it, best clint movie in a few outings, as\nwell... i agree that the ending is a bit sudden. but there was no\nreason to drag it out, either... i don't feel it lingered on any one\ndynamic of what would be expected from a film like this...not TOO much\nviolence or proselytizing/flag waving or lingering on casualty\nhorrors... it doesn't, on the other hand, turn away from any of the\nugliness, either... i thought bradley cooper did a great job in the\nrole. the changes he gradually instilled into the character were subtle\nbut present. it's as well done a war movie as i'll ever need.\n"},
{"review": "\nI can't remember a movie in the last decade, that was as riveting and\ncaptivating as \"American Sniper.\" I kept seeing the trailer on TV and\nwhen I finally went to see it, I was already jacked-up...and it\ndelivered.<br><br>A+ Script A+ Director A+ Lead Actor A+ Supporting Actors A+\nCinematographer<br><br>I don't give a flying crap about anybody's politics when it comes to\nmaking movies. If they're great films, they're great films period. I've\nbeen in the film Industry for 33 years and I was deeply impressed with\nEastwood's take on a story of constant moral dilemma, vs Patriotic\nduty.<br><br>Here's a guy that was motivated to defend our world and country against\nPsychotic Terrorists killing innocent people all over the world...while\nliving on the edge of fatherhood. The inner conflict and balance of\ncreating such a powerful reality, was right on the money.<br><br>Eastwood, Cooper and the screenwriter made a great team...which\neventually became a great film.\n"},
{"review": "\nThe movies is about Chris Kyle's home life and military career with the\nUS Navy as a SEAL sniper. The movie has some intense moments,\ncontaining violent and disturbing scenes. The movie doesn't portray\nChris as a Rambo figure but rather a man that deals with the problems\nall soldiers have to face both overseas and at home. Clint Eastwood who\nis in his mid-eighties, shows us he still has it, directing an amazing\nfilm. The movie tells Kyle's story the way he told it in the first\nbook. Overall, American Sniper is a great movie that has all the\ncomponents, that make a movie great. For anyone who is a war film\nenthusiast, this is a movie for you. To those who call Chris Kyle a\nmurderer and baby killer, I believe you fail to understand what\nsoldiers sacrifice to protect our liberties and keep us free.\n"},
{"review": "\nGood work on Bradley Cooper's part as well, putting on the weight and\ngetting into character to play Chris Kyle, a sniper for the navy seals\nwho did four tours in Iraq protecting his fellow troops by being a\nlegendary shot. the Movie explores Kyle having to deal with a rival\nsniper who was keeping him from doing the job of protecting his troops\nand having to deal with coming home to his wife and kids feeling that\nhis mission was incomplete. <br><br>Old man Eastwood mixed action, drama and humor in a way only a\nlegendary filmmaker could put together. The man still has the ability\nto tell a compelling story.<br><br>Bradley Cooper showed a range that is more Oscar worthy than what he\ndid in Silver Linings Playbook. <br><br>It was nothing but enjoyable from beginning to end. Worth watching.\n"},
{"review": "\nAmerican sniper is probably one of the best war films I've seen since\nSaving Private Ryan. Now I would probably won't consider this a war\nfilm because it mostly focuses on one character. One of the most recent\nwar films that I really enjoyed last year was Lone Survivor. Now I\nthought that movie was really good but it was just handle very overly\ndramatic. I think this is probably one of the best performances Bradley\nCooper has given in his career. I also think this is Clint Eastwood's\nbest movie he has directed since Gran Torino. The action scenes were\nhandled very well and it felt real. One problem I had with the film\nwere the supporting characters. Now the acting for them were good but\nit's just you never get to know most of them their just there for the\nmain character. The story is mostly just learning about one character.\nThere really isn't that much to say about this film but if your a fan\nof war films then I would highly recommend checking this film out.\n"},
{"review": "\nI honestly believe every American should see this film. If after\nviewing you aren't filled with a sober reverence and feelings of\ngratitude then shame on you. This is the quintessential film\nsurrounding the war on terror from the point of view of those that\nserved and even their families. I've read a review by a former Navy\nSeal (Brent Gleeson) that says it best\u0085 \"The way the film was directed\ncoupled with outstanding performances by Bradley Cooper, Sienna Miller\nand the rest of the cast made for a heart wrenching and deeply accurate\nportrayal of the external and internal battles our service men and\nwomen face. Not to mention the even greater sacrifices made by the\nfamilies and loved ones back home.\" <br><br>I would rate it shear perfection had they spent more time with his\nrecovery and angst driven road back once he was stateside. This is\neasily one of my top five films of the year.\n"},
{"review": "\nAmerican Sniper is an intricate piece of modern history told through\nthe eyes of someone that lived it. Clint Eastwood successfully portrays\nthe life of the most decorated sniper in American history while also\ndelineating the mental strain caused by war. While highlighting Chris\nKyle's success as a dominant force in the navy seals, Eastwood also\ndelves into the more sensitive and intimate parts of Chris Kyle's life,\nsuch as his marriage, his children and most significantly the mental\nanxiety which is derived from war. The cinematography and sound effects\nare simply superb and add great depth to the film, especially the war\nscenes. Bradley Cooper adds a gleaming presence to this film and one\nwould consider it to be the defining role of his career. Cooper's\ndedication to the role along with excellent screen writing has cemented\nthis movie as one of the greats.\n"},
{"review": "\nI had high hopes for this movie and was not disappointed, Bradley\nCooper delivers what I think is his best performance thus far. It kicks\nyou in the face and takes you along for the ride. I also commend the\nattention to detail in every aspect of this film, you could almost\ntaste the Iraqi dust in your mouth. The story follows an American\nsoldier from his home in Texas to the battlefields in Iraq, true\ncamaraderie that I haven't seen in a long time. The portrayal of\n\"p.t.s.d.\" and how it affects our soldiers was heartfelt and real. If\nyou haven't seen a good war movie since \"Saving Pvt. Private Ryan\",\nthis one's for you. Congrats Mr. Eastwood, I smell a room full of\nstatues for this one.\n"},
{"review": "\nBradley Cooper is outstanding as Navy Seal Chris Kyle. Sienna Miller\ngives a strong performance of the wife left behind. The Clint Eastwood\ndirecting and the work of the editor are excellent.<br><br>After a strong set up there is a flashback to the life growing up\nfollowed by the usual harsh training regime scenes. Before too long and\nwe are back to the the nerve testing life of a sniper.<br><br>If you thought Clint Eastwood music scores were meager previously with\nthree notes, here there are no notes. Some of the most effective scenes\nare those when Cooper is on the phone with his wife at home.<br><br>It's a tough movie about a guy doing a tough job. Most of the time he\nis providing cover for soldiers on the ground. Kyle was a legend and\nhero to those ground units. Family life was difficult for the tightly\nwound Seal.<br><br>It's a powerful movie that plays well on the big screen with big sound.\nSee it in a theater.\n"},
{"review": "\nThis movie was very good at depicting how soldiers feel and I don't\nthink it could have been better at explaining it because it was so well\nat showing it. Bradley Cooper did an amazing job acting in this film\nand the graphics were considerably good knowing it couldn't have\npossibly been filmed in real time war setting. I especially liked how\nthey referred to veterans and disabled vets trying to deal with being\nback from tour. Being a veteran myself I know what it's like to want to\nfight for our country and it was a great job showing that in the\nsoldiers that were in the film. It was sad to see the soldiers die but\nthere wouldn't be truth to the film if it didn't show soldiers die and\nkids and women trying to kill our soldiers. There might have been too\nmuch truth but that's what made the film so beautifully executed to\nshow the truth to that particular soldiers story. Great job on this\nmovie!\n"},
{"review": "\nJust watched this then looked at all the hate.. amazing. I watched a\nmovie with a bit of understanding behind it. I could follow what they\nwanted to convey, I could feel this poor mans journey and it was sad as\nI'm sure it was for his enemies.<br><br>American yes... But it was a movie... Expressing a point of view. To me\nit did it very well and showed a stuffed up topic. I'm sure he did not\nwant to be there just as much as the people he shot did not want him to\nbe there, such is life.<br><br>To me as an Aussie I got something from this... <br><br>This was a MOVIE...Score it as a MOVIE.\n"},
{"review": "\nGreat movie, very intense, very real...Only bad reviews you will see\nargue politics...Blame politicians for politics....soldiers are\nsoldiers...everyone else is just jealous other great and noble actions<br><br>He was a great man, his death is a loss to humanity.<br><br>Very intense, show multiple fascists of a soldier. Hard work,\nsacrifice, PTSD, regret, patriotism, and a soldier just being a\nsoldier.<br><br>MUST SEE! Regardless of your political views and opinions on the war,\npeople should remember politicians make war, soldiers just bleed for\nit.\n"},
{"review": "\nThis is a contribution to counter the negative reviews posted. Many\nshow the lack of class and respect the public can reveal in time of\nanother's loss. (Also, review for duplicates?) At the end of the movie,\nI sat amongst an audience who loudly clapped in support of the movie\nand the hero it represented and heard shouts of things like \"God bless\nhim.\" I am sure this was a common event throughout many American\ntheaters understanding, admiring and agreeing with the value of\nservice, loyalty, bravery and selflessness. The character build was\nlikable. The music was thoughtful. Based on interviews with family\nmembers believing the acting-Great acting! Great direction by Clint\nEastwood! Overall, likable, entertaining movie.\n"},
{"review": "\nI really enjoyed the film was great film. I was glad to see last year\nthat they were going to being making a movie and didn't exactly know\nwhat I'd think of it but it was great very heart warming and just shows\nwhat kind of ordeals are troops face over there. Its sad to see these\npeople comparing it to a Nazi film it pisses me off there's no\ncomparison first of that was a Nazi the Nazis were horrible people this\nIs an American solider who's fighting terrorist. Nazis murdered Jews\nkilled Americans and are Allies Chris Kyle was killing terrorist so\nanyone who states otherwise is a fool and doesn't deserve to live in\nthis country are troops are what keep us safe and put their lives on\nthe line just to have cowards bad mouth them on here. If you've got\nsuch a problem with are troops leave go to some Muslim country see how\nsafe you are there.\n"},
{"review": "\nAs a movie, outstanding! As for Mr. Kyle, he is an American Hero. His\ncountry sent him to do a job, and he did it. Anyone questioning the\nintegrity of this American, can go question the Bush Administration and\nany other administration that continues war. I believe in Peace. Our\ntroops went because they abide by authority. It is sad to see any human\ndie; Thank you politicians. Thank you Mr. Kyle for helping so many\npeople in such a short time here on earth. Peace is with you... The\ndirector and actors amazing. I want to know more about the sand-storm\nseen. And who filmed the funeral procession footage? It made me cry. I\nhighly recommend the movie. I have a feeling Mr. Kyle would want the\nMarine who killed him to not be prosecuted, but get help for his PTSD.\n"},
{"review": "\nAmerican Sniper is one of those films that takes you on a journey\nthrough the eyes of a true hero. First off, Bradly Cooper played an\namazing role, definitely the best of his career. He bulked up in muscle\nand just let the role consume him. The overall story was interesting\nand had a good pace. The directing and cinematography were really done\nwell, the movie looked great and it really drew you in from the\nbeginning. The one thing that I did not like about it was that it\ndidn't tear me apart emotionally like I wanted it to. In the trailers,\nit looked like this movie was gonna make me cry, but it wasn't as sad\nas it originally shown in the previews. Other than that, very well made\nmovie.\n"},
{"review": "\nThis is one of the best movies I've ever seen. This is Clint Eastwood's\nbest, and most powerful film that he has directed. My second favourite\nperformance by Bradley Cooper (next to Guardians of the galaxy) <br><br>A great screenplay by Jason Hall, adapted from the amazing biography of\nChris Kyle. This is a Great film that can compare to other Great War\nfilms such as Apocalypse now, Patton, The dirty dozen, etc. The film is\nvery realistic, and it keeps you on the edge of your seat the entire\ntime. A Great film, worthy of every Oscar it's nominated for, plus even\nmore. If Chris Kyle were still with us today, I'm sure that he would be\nproud.\n"},
{"review": "\nFor a while we've had movies from Clint that were very well done, but a\nlittle weepy. Make a Million Dollars and Get Brain Damage, Baby was\none. Get Off My Lawn, and Take My Gran Torino With You was another.\nWell, with this one, Clint is back in form. It's refreshing as water in\nthe desert, to see a movie with the quality so rare in Hollywood these\ndays: moral conviction.<br><br>This film speaks the truth at several levels, but the one thing that\nwill stay with me forever, is that this is the first major motion\npicture I have ever seen to show someone, the hero no less, doing heavy\ndeadlifts. For that alone, Clint will have my undying gratitude and\nrespect. And using a trap bar at that. The man obviously knows\nsomething about strength. Bradley Cooper has great technique, as well,\nin acting and deadlifting. Much respect. Should have been bigger,\nthough, Bradley. If the bar ain't bending, you're just pretending.<br><br>What baby? There was a baby in the movie?\n"},
{"review": "\nI was a little worried about what I would see in Clint Eastwood's\nAmerican Sniper. But, after watching the movie last night I came away\nwith a complete sense of pride and sadness. Pride that an American\nSniper, an American Hero is portrayed so well. And, sad that he was\nkilled doing what he loved. (Helping soldiers) Also, sad for his wife\nand family that they lost their father and role model. This movie is\nclearly a fantastic one that should have dominated the Oscars. But, a\nleft-wing leaning group like Hollywood would never elevate a movie that\nportrays American excellence. This is a must see for folks looking for\na excellent dramatic flick. Clint Eastwood has another masterpiece and\nBradley Cooper is the man.\n"},
{"review": "\nThis film was a bit different than I expected. Originally I thought it\nwas going to be about all the action during wartime but I was surprised\nthat it was just as much about the family at home. I liked how they\ntried to show the struggle Kyle had with shooting insurgents and his\nhome life.<br><br>The action in this film was top-notch and realistic which I really\nlove. I prefer these kinds of movies to the explosion and bullet packed\nmovies that Hollywood normally produces.<br><br>Bradley Cooper did an amazing job portraying Kyle and was very\nbelievable.\n"},
{"review": "\nLike The Hurt Locker, American Sniper provides insight into how war\nimpacts the psyche of soldiers. Although Navy SEAL Chris Kyle is\ncelebrated among fellow soldiers, director Clint Eastwood lends as much\ntime portraying the strain the war had on Kyle's personal life,\nspecifically his wife. Bradley Cooper (who trained for three months to\ngain 40 pounds of muscle) plays the conflicted Kyle, who forces himself\nto develop a hatred of the enemy, referring to Iraqis as \"savages,\" so\nhe can justify killing them. The action scenes provide an adrenaline\nrush, but it's the intentional moments of silence \u0097 such as when Kyle,\nwith finger on the trigger, is deciding whether to kill a child who is\nholding what appears to be a bomb \u0097 that make American Sniper an\noutstanding movie.\n"},
{"review": "\nOut of all the people who say this movie is mediocre and they bring\npolitics into this great movie I ignore them. Simply because I'm not\ngoing to let there facts about this movie destroy my feeling towards\nthe overall movie. I enjoyed this movie quite a bit I'm not going to\ngive away an spoilers about this film. But I loved all the fighting\nthat was involved and the movie always kept you on your toes at all\ntimes. You never could relax and just assume everything was going to be\nokay during this film. It was a action packed thriller that in my\nopinion so far was the best movie I've seen all year despite what\npeople and critics have said about it so far. Overall this was a very\ngood well developed movie.\n"},
{"review": "\nThis movie directed by Clint Eastwood restored my faith that Hollywood\ncan produce decent movies still every once in a while. American Sniper\nshows the story of U.S Navy Seal Chris Kyle and his life before during\nand after his 4 tours that he served. This movie shows the difficulties\nnot only for the active duty soldier but for his entire family and his\nstruggle with PTSD. Bradley Cooper did and exceptional job of\ndisplaying Chris Kyle and everything that the American Hero Stood for.\nChris Kyle is an American hero and if you haven't seen this movie you\nhave to. The entire cast does a terrific job in this film and shows the\nrespect that \"The Legend\" deserves.\n"},
{"review": "\nI read Chris Kyle's book \"American Sniper.\" This movie was amazingly\ntrue to the book.<br><br>Clint Eastwood proves what a great director he is.<br><br>He created a poignant, amazing and suspenseful movie.<br><br>Bradley Cooper proves what a gifted actor he as he transformed himself\ninto Chris Kyle - he became Chris Kyle.<br><br>Not only in physical appearance (as he bulked up, grew a beard and\nspoke with a Southern accent), but he captured this American Hero's\nvery essence - his love for his family, brothers-in-arms, and his\ncountry, his expertise as one of the best US military snipers in US\nhistory and a Navy Seal.<br><br>Sienna Miller was wonderful too as Taya Kyle.<br><br>Go see it! You won't be disappointed.\n"},
{"review": "\nI am so thankful for this movie. It gives me hope that Americans will\nhave a better understanding of the inner battle we Vets have about\nhaving had to face difficult decisions during war. Bradley did a great\njob in portraying Chris via his voice, body language and facial\nexpressions. I am a fan of Clint Eastwood and I thank him for having\nthe fortitude to produce this amazing movie and helping to bring to\nlight that when one has to pull the trigger on a weapon to take down\nthe enemy, it is not something we take pleasure in. Maybe now,\nAmericans will understand a little more about how we Veterans feel in\nour daily lives in living the memories of war time events and trying to\ndeal with the people we come in contact with on a daily basis. As an\nauthor and Vietnam Veteran, I thank all those who took part in the\nproduction of this movie. Hooyah! Bruce Goldwell, author\n"},
{"review": "\nI don't understand the recent 1/10 reviews.<br><br>This was an excellent view of how Chris Kyle protected his brothers in\narms against terrorists.<br><br>He's and most of his story is the truth, otherwise his college's would\nbe on top of it if it wasn't.<br><br>Now you see the war in Iraq wasn't a walk in the park, and keep in mind\nthat politicians make the call for war, not the soldiers who go fight\nfor their country.<br><br>I got sucked in the movie from the beginning and it held my attention\nuntil the very end.<br><br>Clint Eastwood has don it again, what a brilliant mind.\n"},
{"review": "\nI expected your usual \"War\" movie, but this one blew me out of the\nwater. The story line kept you into the movie waiting to see what was\ngoing to happen next. The mixed blend of what he had to offer for his\ncountry, his fellow soldiers along with his wife and children was\nextremely good. The movie offered love, romance, adventure and action\nall rolled into one. Upon leaving the theater, there was a man standing\nthere saluting the screen with tears in his eyes. There was no doubt\nthat he too has seen what our brave young soldiers have seen and have\nbeen through. Perhaps he was in Iraq and perhaps it brought back\nmemories? As for me personally, I truly liked the movie and found it to\nbe something that I will remember for a long while.\n"},
{"review": "\nI walked in to this Dark theater not knowing anything about Chris Kyle\nAmerican Hero's , Sniper's .. I just knew Bradley Cooper was Gracing\nacross the Silver Screen for 2 hours of my Afternoon .. As the Lights\ncame up I'd Seen what Perhaps go's on After our Men &amp; Women fight to\nsave our Country's Freedom .. My Nephews in the Army My Brother was a\npilot on Air force # 1 for 15 years Nixon - Ford - Carter Father Korean\nwar but never brings it up .. So Clint Eastwood takes us away as he\nalways does as a Directer .. Bradley in all his passion becomes the\nbreaking Soul of a proud man after he finises 4 tours of Iran. Can\nAnybody please explain to me What is an American Hero .. and who sets\nthe rules\n"},
{"review": "\nThe only kind of people who dislike \"American Sniper\" are Leftist scum\nor Islamo-fascist sympathizers. I urge one and all in the decent human\nbeing world to go see it. What they will find is both an exciting war\nmovie combined with a very human story of a life well-lived; a true\nAmerican hero in every sense of the word. Chris Kyle embodied all that\nis best about America: courage, honor, commitment to duty, love of\nfamily. It is little wonder that this film is smashing box office\nrecords not only here but around the world. The tone is just about\nperfect, throughout the movie. This is due to Clint Eastwood's\nexcellent directing. It is quite refreshing that a real American hero -\nnot one of Hollywood's phony PC cutouts - and his time serving his\ncountry and struggles and triumphs at home are the subject of an epic\nsuch as this one. The only \"controversy\" is a contrived one by the\nliberal media and the scumbag American Left. Again, I cannot recommend\nthis movie enough.\n"},
{"review": "\nChris Kyle's character has correlated well with Clint Eastwood's savvy.\nThe story alone grabbed attention, and this lively movie puts the\n\"Legend\" into humbling perspective. An unsuspecting Texan has saved the\nday, which is the truth, this time. Illustrations of childhood moments,\nromance, familial responsibilities, and sacrifice have intertwined\ngenuinely into a patriotic biography. Using slow motion during fight\nscenes and sniper shots would have been a Hollywood treatment of this\nbiography. Non-fiction does limit the powers of film makers, yet\nopportunities there for modernized movie action without losing realism\nhave been missed. This action packed movie's dialog, surprisingly\nthough, carries the attitude and personality and earns empathy here.\n"},
{"review": "\nThis was an amazing movie and the book was as well. As for others\nsaying that it was not true is a load of BS.<br><br>Chris kyle was sued for slander but not because the story he told was\nuntrue. Kyle was sued for saying in his book that he punched out a\ncelebrity, and later in an interviews came out and said he was talking\nabout Jesse Ventura. So Jesse Ventura sued Kyle and before the case was\nclosed Kyle was murdered and then Ventura kept pressing charges against\nChris Kyles widow and got 1.8 million dollars. Just because there was a\ncase for slander doesn't mean it had anything to do with the movie. The\nuntruths were resolved before the movie was made.<br><br>On another note the movie was very emotional and suspenseful. It makes\nyou realize how lucky we are to have our fellow Americans put there\nlives on the line everyday to protect us from terrorists.\n"},
{"review": "\nThis film is an excellent adaptation of Chris Kyle's memoir about his\nexperience as a United States Navy SEAL sniper. There are some\ndeviations from the book as well as a number of controversies\nsurrounding this adaptation, but it does not detract from the quality\nof the film nor enjoyment of it. I highly recommend this movie. <br><br>It is important to keep in mind not to mix up this film with the\nmorality or justification of our military presence in Iraq and the\nMiddle East. This is a story of an individual's experience and should\nnot be confounded with issues bigger than what the film is attempting\nto address. Many reviewers are confused with this simple fact and\ndismiss the film over understandable ignorance. <br><br>The film will, hopefully, make you think about the sacrifice our\nservicemen make every day to keep us safe and reinforce the rights we\ntake for granted.\n"},
{"review": "\nI feel so bad for Chris Kyle, regardless what he did he quit doing it\ntill that psycho shot him dead. It must be kinda frustrating that\nyou'll survive all those years in Middle East but then you'll get shot\nby your own people. I know this is partially propaganda and I'm against\nAmerican endless war tours around the globe, but still. Think yourself\nin his shoes. It must be really hard to come back from there and try to\nlive normal life. But that could've avoided by not starting the wars in\nthe first place. What comes to 9/11, it was put in action by either\nyour own people or Israelis, you can stop putting it in every war movie\nyou'll do.\n"},
{"review": "\nYou're instantly sucked it though you may be thrown back when it goes\ninto the first flashback as your left on a cliffhanger which is only\nshown towards the end. It shows immense patriotism that majority of\nAmerican's have but at a point leaves you questioning war due to\nactions like killing a child to save comrades and residents being stuck\nin-between and risked by US Forces and Militants thus the audience is\nforced to have a wider understanding in the complexity of war.\nEspecially as both sides are essentially fighting for the same reason;\n'what right'in their eye... When Kyle is able to shoot his target to\nsave his comrades and 'an eye for an eye' the audience ends up rooting\nfor Kyle to kill another being... at the very moment I realised I was\nrooting for another mans death and this was the time the audience is\nmost empathetic with Kyle. When he returns home each time you see the\nchange and growth in dehumanisation. The end foreshadowed Kyles death\nwell.. It's truly sad to know its all true events.\n"},
{"review": "\nThis movie is a must see. Bradley Cooper's performance was definitely\nworth the Oscar - he delivers such intensity in his performance that\nmanages to transport you and fascinate you at the same time. This\nintensity is one of the key factors this movie is successful. On top of\nthis he is literally transformed - to the point it's hard to think\nyou're watching the same actor you're familiar with. A truly unique\nperformance. American Sniper is a war movie at its best: it is gut\nwrenching, hard to watch at some points an beautiful in its mise en\nscène and reconstruction of war torn landscapes and sets of conflict.\nEastwood is a proved strong director and this another great movie - a\nhigh point in my opinion.\n"},
{"review": "\nI don't understand all the negativity about this movie. It's a Clint\nEastwood movie. That means that something happens and that something\nhurts. Inside you. Eastwood is not exactly the kind of filmmaker who\ndelivers flat drama. A certain fact - the war this time - is presented\nas an excuse to present an interesting, layered character, crossing\nborders to transform. Well, that happens. And it hurts... We stay with\nthis guy, this sniper. We stay with him till we feel suffocated to the\npoint of wanting to leave the cinema. The camera is on him, without no\nmercy. Through his eyes we see the concept of 'defending your country'\ngo down the drain, But without moralizing one single moment and without\nbeing disrespectful to those who believe in this concept and who go\nthere to do that job.<br><br>We just see a man, being destroyed, and that's it.<br><br>A pro-war-movie.... ?? Come on..\n"},
{"review": "\nAmerican Sniper tells the true story of SEAL Chris Kyle. Clint Eastwood\nreally does a great job of truthfully telling and displaying the\nhorrors of war and how it truly does affect the soldiers after they\ncome back home from war. Bradley Cooper was amazing as the lead role,\nChris Kyle. Sienna Miller was also very spot on with her performance as\nChris's wife back home. The visuals and the war violence were very\nreal, and really showed you how the were in Iraq really was for the\nsoldiers, and how truly disturbing it was, not only for the soldiers,\nbut also for their families. I was very entertained and satisfied with\nthis film. It should've won Best Picture in my opinion, but maybe I\nshould see Birdman before I say that. This film really left me\nspeechless and I was truly moved and touched by not only the actors\nperformances, but also how they portrayed the war in Iraq!\n"},
{"review": "\nThis Movie was fantastic! I loved every part of it. I felt like I was\ntruly watching Chris Kyle's Story. It was sad and intense and\neverything in between. Now I understand that they had to add in the end\nand couldn't fully complete the movie because of what terrible thing\nhappened in real life but just judging the movie thats why I only gave\nit a 9. I also only gave it a 9 because I have heard that it drifted\nfrom the real story a bit and wasn't 100% true but that doesn't really\nmatter as much because it was still and awesome movie and was close\nenough not to disrespect anyone. Bradley Cooper was absolutely amazing\nin this movie and really pulled on your heart strings in some of those\nscenes. All of the other actors were also great in this movie. The\nthing I really loved about this movie is how detailed it was and how it\ntotally made you feel every emotion. Overall this movie is an absolute\nMUST SEE movie!\n"},
{"review": "\nMost of the people thinks that during the Gulf War, American soldiers\nattacked the villages, raped the girls, and killed the people like\nchicken just for joy (8 years x 365 day x 600 people a day , in total\n1,5 million Iraqi civilian death).. This kind of thinking is very\ncommon.. And that is why these kind of Hollywood movies generally are\nnot welcome.. <br><br>The film is mostly about Felluca and Sadr City. These are the places at\nwhere ISIL has taken the roots.<br><br>Yes Oil is a vital source for America. But the film is not about that.\nThe film is about the SOLDIERS facing the sh*t in Iraq..<br><br>I found visual and sound effects successful..\n"},
{"review": "\nKnowing the life of Chris Kyle cannot prepare you for the emotional\nroller-coaster you will go on while watching the movie. From his\nbeginnings, his life during his service and life after you will not be\nable to avoid the inevitable smack of reality of the closing credits.\nThe crowd reaction to the ending was the same as my\nexperience...absolute silence!! Whether it is out of respect or out of\nsheer emotional exhaustion, the silence of everyone as they leave is\ndeafening. It is a shame that there are those who would negatively\nattack the film as well as Chris Kyle, but it is ironic that those same\npeople are the ones who generally feel its OK to murder unborn babies,\nvilify the military and its personnel and cry about what is wrong with\nAmerica. Chris Kyle is what is right about America....if you leave\nwithout feeling that, then you are not an American\n"},
{"review": "\nI noticed a lot of the reviews say this is a war propaganda film...\nthat it depicts Iraqis as bad people... that only mindless republicans\nwill enjoy it. Well... i suppose if your a mindless democrat you may\nsay that. A democrat that has no idea what REALLY went on. And Chris\nKyle did not go around shooting \"innocent\" people. If i saw someone\nwalking towards one of our convoys with a bomb strapped to them, I'd\nshoot their ass too. The Iraq war wasn't about oil or WMDs. It was\nabout genocide and the thousands of innocent people that were murdered\nby Saddam Hussein. Not to mention it was a safe haven for terrorists.\nThe majority of Iraqis killed deserved to die. The world is better off\nwithout them.<br><br>This movie was very genuine in regards to the Iraq war. It wasn't\nfilmed in Iraq but the scenes made it feel almost like I was back over\nthere. Yes it was trumped up a bit for Hollywood, but over all it was\nvery well made.<br><br>Sorry you didn't like the movie... maybe you should go watch Boyhood or\nFifty Shades of Grey instead.\n"},
{"review": "\nOne of the most powerful, true to life productions ever to hit the\nscreen. It is now often that a true American hero can be portrayed\naccurately and with this emotion. Bradley Cooper far surpassed any\nother roles he has performed. The interaction with his Navy Seal and\nMarine brothers was both moving and accurate. This movie was a\nmasterpiece and proves that Clint Eastwood is a modern day genius of\nmoving making!<br><br>Siena Miller does an amazing job of portraying the effect on Chris\nKyle's family and show the lengths a true hero will go to for his\ncountry. Cooper's portrayal of this hero, along with all the flaws and\ndamage war does to his persona is amazing!\n"},
{"review": "\nI thought that this film was as good as it could have been.... If you\nlove America and all that she stands for, this film was right on the\nmoney.... If you hate America and all of it's citizen's , especially\nthose that serve at the pleasure of the President ( The Military ) then\nthis movie is not for you !!!! After reading the book and following\nChris Kyle's life after the Seals, I found this a very real and\ncompelling story, based on the real life exploits and struggles of a\nreal war hero.... Chris Kyle had a lot of the same problems that Audie\nMurphy struggled with, when he returned home as a war hero.... I thank\nall our Military for the thankless job they do.... And disregard all\nthe anti-American rubbish that's listed above and below !\n"},
{"review": "\nThe \"war\" this movie is about, was the one Chris fought between being a\nsoldier, a father, a dad and a reluctant hero. I did not know this\nman's story prior to this film, and I am fully aware that what little I\nknow I only know through this film, but my God. This man fought through\nPTSD and came out on the other side, he won the war that he fought with\nhimself. Only to be murdered by a cowardly traitor on his home soil. I\nwant to thank Chris and every other man and woman who take up arms and\nprotect ME. Thank you for doing what I was scared to do. Thank you for\nprotecting me and this country. Shame on any one who calls this\npropaganda.\n"},
{"review": "\nGoodness must overrule absolute evil Though there's nothing worse than\nwar.<br><br>Sometimes we have no alternative option Except to kill or be killed as\nbefore.<br><br>The best of plans can go amiss With uncertainties till the first shots\nare fired.<br><br>As generals plot their path toward victory It's up to the wounded, the\nfallen and tired.<br><br>It's not how strong or athletic you are That decides who is blessed to\nreturn.<br><br>Those who survive are a product of luck And our prayers and support\nthey've earned.<br><br>War seems to peel the veneer off society Exposing our villain within.<br><br>A crazy obsession to rule over others By death, destruction and sin.<br><br>The mayhem of conflict is an ongoing scourge Robbing man from intended\nglory.<br><br>The hinge of history swings in all directions As the madness of war\ntells its story.<br><br>Tom's 800 Poems Are Free To Share! By God's Poet Tom Zart Most\nPublished Poet On The Web! Google = Tom Zart YouTube or Tom Zart Google\nTHANK YOU FOR WHO YOU ARE IN YOUR HEART = tom!\n"},
{"review": "\nThis is one of the better movies I've seen. If you like war movies,\nthis one is a great one. <br><br>Bradley Cooper's performance was great. He states in his interviews\nthat he spent quit a bit of time learning Chris Kyle's habits and the\ntechniques taught during SEAL training. I thought the bulk he put on to\nplay the character was video enhanced. Apparently not. Bradley put in\nthe effort in the gym to bulk up. Kudos.<br><br>Hats off to the military men and women who laid their lives for the\nrest of us. We appreciate you more than words can say. <br><br>God bless.\n"},
{"review": "\nAmerican Sniper is an absolute masterpiece. It was an amazing story\nabout SEAL sniper Chris Kyle and his 160 confirmed kills and his\nstruggle to leave behind the war, and to balance his family. <br><br>Bradley Cooper gave an absolutely Oscar worthy performance and Clint\nEastwood showed again his true directing talents. The film is action\npacked, all while balancing a solid story and acting. Even our friendly\nneighborhood left wingers who don't support this war have to support\nChris' service for this country, and respect how Eastwood and Cooper\nbrought the characters and the story to life. It is a movie that truly\nhits the heart and makes you thankful for all you have. <br><br>It's one of of the best war movies out there, it shows the struggle\nsoldiers have with PTSD and it shows us why we're free, and the price\npaid for that freedom, all through the eyes of the legend Chris Kyle.\n"},
{"review": "\nAmerican Sniper is based on an autobiography by Chris Kyle, written\nwith Scott McEwen and Jim DeFelice. It's the story of the life and\ntimes of Kyle, who had four tours in Iraq, totaling circa 1,000 days,\nresulting in more than 160 kills credited to him as a sniper. The film\nis about his experiences and the costs - emotional and psychological -\nthey had on him. It's about how punishing the American Dream can be.\nThe idea to make the film with these themes was brought to Eastwood by\nan actor to whom this was a personal project about which he was\npassionate. This deliberate humanizing of the soldier at the center of\nthe story into a tenderhearted family man is what sets American Sniper\napart from other recent war flicks like Lone Survivor and The Hurt\nLocker. Consequently, we really care whether this patriot will\nultimately return home safe and sound. Directing= 10/10 Acting= 10/10\nCinematography: 10/10 Writing: 9/10 Sound:10/10 Editing: 10/10\n.......................................... Best Movie of Year.... well\ndone great Eastwood\n"},
{"review": "\nI usually don't write reviews about films but was moved to in this case\nafter reading some of the negative reviews posted by those who have\nobviously never been in combat and so have no idea what being a Warrior\nis. The action scenes were very realistic and the way that the director\nportrayed Chris Kyle's selfless commitment to his Warrior Brothers was\nmoving. If you are a Military man you will love this movie and will be\nreminded of those relationships that you shared with your battle\nbuddies in a most profound way. I also found the coming home scenes to\nbe very accurate as often readjustment to life in the materialistic\nculture of the western world is hard to do after what combat operations\nput you through. This is a movie for those happy few, that Band of\nBrothers, enjoy.\n"},
{"review": "\nAn intense, powerful portrayal of Chris Kyle (Bradley Cooper), the most\nlethal sniper in U.S. history, and his tours in Iraq as he struggles to\nkeep his relationship afloat with his wife (Sienna Miller) back home!\nCooper's performance is totally precise. The gradations he and Eastwood\nhave chosen to show - of Kyle's character, personality and disease -\nare perfectly graded ... and if that isn't exactly the man Chris Kyle\nwas, it's an indelible movie character. The film is not, by any fair\nmeasure, a battle hymn or a call to arms. As with The Hurt Locker the\nfilm's intent is to engender respect for those doing the fighting, not\nto justify the reasons for the fighting. American Sniper is\npro-warrior, not pro-war. Here I want to say thanks to Chris! thanks\nfor American sniper com\n"},
{"review": "\nAs an ex Army wife of Texan , I empathized with the guys wife- always\nalone, popping out kids and raising them by yourself. It's a pretty\nstandard way of life. We never really experienced our husbands work\nlife. This movie review was based on truthfulness, acting ability,\ndirection , and the fact that after all these years ... I can cry and\nfeel the loss all over again. You politically minded anti- war\nreviewers need to realize that this was a truthful story told very\nwell. It's not marginalized or made extra brutal for entertainment\nvalue. To review a movie based on your anti military, anti war\npolitical beliefs tells me you perhaps shouldn't have seen it ( paying\ninto the system) or that you probably didn't see the movie at all. .\n"},
{"review": "\n\"American Sniper\" sure hits with surefire accuracy in many cinematic\ncategories. Clint Eastwood's picture depicts the story of real life\nNAVY Seals Sniper Chris Kyle; Eastwood does deliver the good, the bad,\nand the ugly about patriotic duty and gritty warfare in the movie. Kyle\nwas called the \"legend\", as Eastwood himself is and Clint has directed\nanother solid offering in the twilight of his career. Now, \"American\nSniper\" is not a a perfect movie; Jason Hall's academy award nominated\nscreenplay was a bit overrated and it did have its sporadic misses with\none too many formulaic lines in a war picture. Bradley Cooper was\nmesmerizing as Kyle and is worthy of his Best Actor Oscar nomination.\nSienna Miller showed yet again this year that it's \"Miller\" time with\nher impressive work as Kyle's wife Taya; Sienna fit the right \"taya\"\nfor her role. So your tour of duty in the next few days is to target on\nto \"American Sniper\". **** Good\n"},
{"review": "\nI'm a movie addict who has been much disappointed with many attempts at\nmany a war movie which includes the much herralded hurt locker.<br><br>There is a selection of over a 100 reviews, so no need for me to detail\nthe specifics of the movie, if your reviewing review then i'm sure it's\njust to confirm the admiration offered by others apart from yourself.<br><br>Bradley Coopers performance was scintillating, the direction offered by\nClint Eastwood was masterful, indeed the whole cast were fantastic.<br><br>I've always been a fan of Clint and Bradley, true American beauty is\nserved ... far less protentious than other candidates for the Oscars\n.... i must admit the imitation game was a knockout.<br><br>Happy viewing fellow fans.\n"},
{"review": "\nClint Eastwood delivers yet another astoundingly boring film. Slow,\nshallow, mundane treatment of a propaganda piece, there's really\nnothing to recommend this movie.\nBang,bang,bang...kill,kill,kill...'America has nothing to answer\nfor'...really, this is just a myopic piece of Hollywood standard,\ngang-ho war fodder film stock. Total rubbish and mind numbingly\nstultifying to boot. Don't waste your time or your life. Pretty much\ncontinuing on his legacy of delivering really crap films. And possibly\neven more boring than 'The thin red line', where they had to cart\ncorpses out of the cinema. Awful. Actually there's no words to describe\nhow bad this garbage is.\n"},
{"review": "\nI am no Leftie, no Hippie, no Anti-American. I love America and I love\nwar movies. No hidden agenda, this is simply a very bad movie that left\nme wonder if the authors think that we are slightly thick, so they had\nto keep things REALLY simple. The whole movie is Bradley Cooper (I was\na fan until now) shooting at baddies from a roof. Why? Whom is he\nexactly shooting at (more specifically than just 'at savages' please)?\nThis is going back to the era of bad Western movies, where the Indians\nwere portrayed as the bad guys and the Cowboys were the good guys, just\nlike a kids' play-pretend. I hate to tell you, the world is way more\nsophisticated than that. Don't we all agree by now that soldiers on\neither side of the war are incredibly similar, risking their lives to\nfollow an ideology, right or wrong may that be? America should be\noffended to be portrayed in such a simplistic way\n"},
{"review": "\nWorst. Movie. Ever.<br><br>Best joke the movie told is that the super hardcore trained, specially\nequipped top shot of the US military is still less capable than the\nevil, blood thirsty, cliché terrorist with his centuries old rifle. Fun\nfact terrorist hits 3 guys, super great sniper only 1 despite having an\nadvantage in technology, training and what not. What an incredible bad\ntestimony to the US military, to honor such a failure and child\nslaughtering maniac as a \"hero\".<br><br>Also the movie appears to be one of those super long commercials to\nlure young folks into serving in the army, fighting wars no one knows\nwhy, obediently serving the cash money brothers from wall street.<br><br>Oh yeah i forgot: Allah Hu Akhbar! Stay salty NA!\n"},
{"review": "\nI have never done a film review before but after seeing American Sniper\nI thought i would share my views on what a brilliant film <br><br>American Sniper is a very good movie highly recommended a must see\nBradley Cooper is outstanding as Navy Seal Chris Kyle <br><br>I also agree with the way Eastwood decided to end the film. Without\nspoilers I don't think there's any other way you could have served the\nfilm and it's real life characters better. American Sniper is a\ndifficult film to watch, but it's one of the better ones this year.<br><br>+Cooper's multidimensional performance <br><br>+Story structure <br><br>+Eastwood's directing <br><br>+Doesn't hold back with the top notch editing<br><br>10/10\n"},
{"review": "\nThis movie is about PTSD and the effects war, and is an amazingly put\ntogether story. You may not like the story and what it tells about a\nman's feelings toward a group of people who are trying to kill his\nfellow countrymen. But in war your military brothers are your family\nand wouldn't you protect your family? Clint Eastwood and Bradley Cooper\nhave hit a home run with this film, and Bradley Cooper will be hard\npressed to ever be better. Watch the movie for what it is and not for\nwhat it isn't. This isn't American propaganda in fiction, it actually\nhas happened. I'm sure for the sake of the movie some aspects have been\nmissed or even added but that has to be done in all films.\n"},
{"review": "\nJust watched the film (please do not call it a movie, so demeaning)\nand, wondering what other people thought, I followed up by reading the\nreviews (which, I admit, I do not usually bother to do). Wow, if the\nlength of the individual reviews is anything to go by (have you noticed\nhow long winded they all are) it has caused a lot of pseudo-reviewers\nto come out of the closet, each with their own axe to grind, but few,\nif any, ready to comment on the film simply as something to appreciate\n(with a message or not, who cares?). The reactions it has provoked cry\nout as to the excellence of the work. As usual, the quality of\nEastwood's work is undeniable. The film is riveting and sensitive as\nare all of Eastwood's \"war\" films. Watch it, appreciate it, and stop\ntrying to analyse / criticise the life out of it. Just lay back and\nenjoy a really good film.\n"},
{"review": "\nAn insight to the life of the extraordinary American Sniper Chris Kyle,\nNorth America's most lethal sniper throughout the U.S. military\nhistory. You follow Chris Kyle pursuing his dream of being a Texas\ncowboy but ends up becoming a Navy Seal sniper fighting against Saddam\nHussein's army in the Middle East. Struggling with very depressive\nissues every time he returns home to America from the war in Iraq to\nlive a normal family life, he starts helping ex-soldiers with their\nPTSD. While doing that Chris and his friend Chad Littlefield get killed\nby ex-soldier Eddie Ray on a shooting field. <br><br>Bradley Cooper, a two-time Oscar nominee for his work in \"Silver\nLinings Playbook\" and \"American Hustle,\" Cooper heads the cast with yet\nanother very good performance, which also includes Sienna Miller (HBO's\n\"The Girl\") as Chris Kyle's wife Taya Kyle, Navid Negahban, Jake\nMcDorman, Keir O'Donnell, and Luke Grimes. By Director Clint Eastwood.\n"},
{"review": "\nI think what made American sniper stood out for me was the excellent\nperformance of Bradley cooper who plays the late navy seal chris kyle\nwho had the most recorded kills in history as a sniper with 160. I\nthink what truly amazed me about the film was how it showed the\ntraumatic effects of soldiers suffering from ptsd and having the\ndifficulties of civilian life and the brutality of war. However the\nfilm foes show that the soldiers are human beings which I felt was very\nimportant. I hope it wins the best picture and best actor since it is a\nfilm worth seeing. I will admit that there were certain parts that were\nhard to watch but I will say it is one of Clint Eastwood finest works.\n"},
{"review": "\nEvery now and then a movie comes out that is just fantastic and\nAmerican Sniper is one of them. Its the only movie I would give 10 out\nof 10 The acting is great. Action is brilliant. Story was outstanding.<br><br>A great true story that is the best movie of the year. Loved it.<br><br>The thing that attracted me was the way it pulled me into the story,\nwhen we left the cinema everyone was silent in deep thought. I have not\nwitnessed that before, Clint Eastwood did a great job of making a\nclassic film that will go on for years. Its no wonder it is a box\noffice success, the movie was great.<br><br>The ending could not have been made any better, the impact it had on\nthe audience was pretty dramatic.<br><br>You have got to see it.\n"},
{"review": "\nSuch a beautiful film! Bradley Cooper was on a completely different\nlevel with this role. You could see every conflict he was faced with\nthrough his eyes and his breath. He embodied the character so well that\nyou completely separate him from who he is playing. Im always\nastonished by the lengths an actor will go to portray their characters\ntruthfully. The story itself was laid out extremely well and the final\nscene was chilling. I've seen almost every movie nominated this year\nand in my opinion, American Sniper deserves everything it is nominated\nfor. Hopefully everyone sees that and it gets the reception it\ndeserves! Everyone needs to see it!\n"},
{"review": "\nhis movie is about PTSD and the effects war, and is an amazingly put\ntogether story. You may not like the story and what it tells about a\nman's feelings toward a group of people who are trying to kill his\nfellow countrymen. But in war your military brothers are your family\nand wouldn't you protect your family? Clint Eastwood and Bradley Cooper\nhave hit a home run with this film, and Bradley Cooper will be hard\npressed to ever be better. Watch the movie for what it is and not for\nwhat it isn't. This isn't American propaganda in fiction, it actually\nhas happened. I'm sure for the sake of the movie some aspects have been\nmissed or even added but that has to be done in all films.\n"},
{"review": "\nAmerican Sniper is not pro-war nor anti-war. It's just war movie.<br><br>It's not a flag-waving patriotic movie, but it does feature characters\nwho display patriotism.<br><br>It does not re-litigate the Iraq War or the handling of the Iraq War.\nBut the effects and the doubts are there on the peripheral. <br><br>Now that we have that out of the way, lets talk about the movie. It has\na perfect blend of war scenes, humor, and romance. It is not a 'guys\nmovie' anymore than \"Frozen\" is a kids movie.<br><br>It is an intense, suspenseful movie that does not overwhelm you with\nbusy war scenes. It is intense movie in the same vein of The Hurt\nLocker. <br><br>This story defines our time. Not just the 'snipping', but the effects\nof war on families and our veterans. Just go see it and see it in IMAX.\n"},
{"review": "\nAfter 9/ 11 Man decides to help America fight terrorism and joins the\nnavy seals as a sniper. He goes on four tours of Iraq during the war\nbut when he returns to normal civilian life he struggles. Another film\nthat won Oscars but that means little to me, the main and essential\nquestion that I always ask is \" Is this film i'm watching entertaining\nand does it involve me and keep me watching\"? The answer to both of\nthose questions is \"No\". Film for the most part is boring and it has\nlittle emotion, Bradley Cooper is miscast. Another very average movie\ndirected by Clint Eastwood whose films get less interesting as he gets\nolder. No more than a average film.\n"},
{"review": "\nSo we just saw this movie at the Dollar Theater. I wasn't pro on seeing\nit but I went anyway. I'm very glad I did. It was very worth it. It's\nright up there with Saving Private Ryan and Sergeant York. It doesn't\nglorify war or glamorize it. But it is honorable, patriotic and a bit\nof a tear jerker. Bradley Cooper is a great actor but I was impressed\nby Sienna Miller. I have been always been against us going to Iraq but\nI feel I understand better the reasons men go. Now it's a movie and\nsemi-autobiographical, Clint Eastwood takes a few indiscretions. So for\nsome people that's a reason not to see it. However the story was told\nvery well, it had some very tense moments and it's an important fresh\npart of our history that needs to be told.\n"},
{"review": "\nI just watched this movie with my wife and did not really know what to\nexpect and from the trailer and the write-up of the movie I thought it\nwould be dull and self absorbed..... But I was very wrong. This movie\nhas plenty of action but also plenty of thought provoking moments that\nreally show what these people go through on returning from war to\nnormal life. How they have to adjust to being 'Normal' when they have\nseen the horrors of war. I did not realise this was based on a true\nstory and maybe that could have been mentioned at the start but\nnonetheless Clint Eastwood has made a superb movie which does not make\nwar look glamorous but shows the real toll war has on people but does\nso while still being entertaining to watch\n"},
{"review": "\nWhen I stepped into the cinema to watch this movie, I never expected\nsomething this elegant and cinematic..Maybe because usually the titles\nthat have the word 'Sniper' don't deliver such aspects other than some\nraw action and gunfire.. I haven't read the autobiography of Chris Kyle\nbut I think the director has succeeded in presenting the gist of the\nbook with a very graceful touch of cinematography. As usual Bradley\nCooper's performance is solid. He manages to keep the suspension and\nall the intensity revolving around, yet again proving that he's one of\nthe highly versatile actors in the business. If you haven't watched\nthis yet, I highly encourage you to go an watch this..\n"},
{"review": "\nI read the book, and thought the movie left much out. Regrettably, we\nwould have had a 8 hour movie if the whole book was filmed. What\nworked: American Sniper followed the book accurately. The emotional\nspectrum acted by Bradly Cooper followed, was preformed perfectly. The\nranges of guilt for not helping more soldiers, and the stress of combat\nweaves perfectly with Eastwood's direction for the movie's experience.\nThe savagery of war, and the stress of completing the combat missions\nresonates with the viewer as the story unfolds. What happens after the\nmission is over was a perfect ending for the movie. Service,\ncommitment, bravery, humility, were displayed as the characteristics of\nChris Kyle were done in a fitting well measured character development.\nWhat did not work: Some scenes which would tell more of the American\nSniper book were shorted, omitted, condensed, in the American Sniper\nmovie. Maybe for time and or continuity reasons. Still a good movie. I\ngive American Sniper 8 kills out of 10.\n"},
{"review": "\nI saw it and I liked it but didn't love it. Every time the wife comes\non, crying and whining, the movie comes to a grinding halt. Kyle, as\nportrayed here, was not an interesting guy. He was a patriot and a good\nsoldier but not a drama queen. His buddies weren't very interesting, so\nwhile it was sad when some died, it was not very emotionally disturbing\nto this viewer. <br><br>But this is the most important movie since DEER HUNTER, which is why it\nis the duty of all normal people to see it. Why? Because the liberal\nmedia and big mouths have decided that this movie represents everything\nwrong with this country. This movie is the un-Obama, the un-Michael\nMoore, the un-MSNBC. The liberals want the country to run and see SELAM\nbecause, well, it's black. And this movie is very white and very\npatriotic. So it is our job to see this movie and NOT see SELMA. As a\ngreat American once said: SEND THEM A MESSAGE.\n"},
{"review": "\nAmerican Sniper will split the audience in two (or maybe more) groups.\nPacifist will see it totally different than people who were in a war or\nat least aren't totally against it. A biography of a young man, a\nsniper...he has to kill mothers and children...he becomes a father by\nhimself and can't kill a kid that easy anymore...he wasn't able to\nprotect all his fellow soldiers...he has to fight against a guilty\nconscience...against post-traumatic stress disorder. The film is often\nlike the mission of a sniper. It happens nothing for a long time and\nyou just wait for something...for some action. And then, all of a\nsudden you get more action than you can handle. Coincidence? If yes\nit's a weakness of the movie, because there are really boring\nparts...but if that's no coincidence, if they wanted to make a film\nabout a sniper which is like the mission of a sniper...well, they did\nand it's brilliant.\n"},
{"review": "\nAfter reading all the negative reviews I didn't expect much of this\nfilm but I actually really enjoyed it. Firstly I liked the way the film\nkept switching back from war to his home life,gave u a real sense of\nwhat he was going through and thought there was a good balance between\nthe both. What does sadden me is the reviews people are putting saying\nhow the film glorifies the war and what they do,which I feel is totally\nwrong and disagree. I think the film just tries to show someone doing\nwhat he feels right and convincing himself for his country but he\ndoesn't enjoy it or brag about it like some people have said. Just a\nfilm trying to show the brutal truth through someone's eyes (war isn't\npretty but is happening and no hiding from that) and how he copes with\nit while having an effect on his family life. I think the cinematic\nvisuals and action along with grit and emotion is definitely worth\nwatching.\n"},
{"review": "\nClint Eastwood adapts the autobiography of Chris Kyle, a Navy SEAL who\nhad the most confirmed kills in the Iraq War. The film pretty much\ntakes the same tack as The Hurt Locker in examining how war effects a\nman. There's obviously a lot more combat here than in Hurt Locker, and\nit's very much a war action movie. I didn't find it exploitative,\nthough. Unlike the recent turd Fury, the combat sequences are intense,\nnot \"fun.\" The violence is wince-inducing, and you're just hoping to\nget through it. The film does question, just a little, the purpose of\nthe war, but the protagonist never does. He never did. He was a\nsoldier, and this was his job, to protect his men, and he was good at\nit. The film hinges on the performance of Bradley Cooper, and he is\nvery good. Sienna Miller has the unfortunate role of the wife who\nworries and begs him to come back (all this material was done far\nbetter in The Hurt Locker).\n"},
{"review": "\nI was unsure as to what to expect from this movie. Part of me was\nworried I would encounter a \"'murica\" flick with guts flying all over\nthe place. This movie, however, was brutal in such a tasteful way. It\nis a powerful story and so well told. It was about the man; not a\ncommentary on a war, and not propaganda for a country. It is such a\ngood \"war movie\" for this very reason. Furthermore, the cast could not\nhave been better picked. <br><br>If you want to know if you should see this movie, I will only say this;\nat the end of the movie, the whole packed theatre left in absolute\nsilence.\n"},
{"review": "\nAmerican Sniper portrays the patriotism felt by millions of decent\nAmericans fighting a hidden enemy that even today organizes to attack\nus on our homeland. Preemptively eradicating this evil radical\nextremism found in so many different states must accelerate if we are\nto prevail. This movie exemplifies the ongoing struggle with evil that\nour soldiers endure every day which is hidden from most Americans\nreality. They are sacrificing their lives to fight for the very rights\nthat allow the morons to post negative comments on this forum. Chris\nKyle was a hero's hero and this movie does an excellent job of putting\nthe viewer into his shoes. Clint Eastwood's directing, the screenplay,\nthe acting was all top notch. In real life Chris killed more than 255\nof the radicals and set an example of what is required to exterminate\nthe evil whose only goal to kill the rest of us. Thank you Clint,\nBradley, Chris, and our troops for their sacrifices to keep us safe.\nThis should be required viewing for US citizens.\n"},
{"review": "\nVets, at the end be proud and stand up and salute! Others stand up and\ncross your heart! Guess this tells what this movie is made up of! <br><br>Eastwood's FINEST MOVIE EVER !<br><br>The stupid rating system says I have to write more lines for this to\npost, so I'll say it again. All you need to know is at the end don't\nfight it, just do what you want to do and STAND UP AND SALUTE or cross\nyour heart! Maybe it would be nice if our Commander in Chief would\ndisplay such a tribute !<br><br>Unlike Joline's \"Unbroken', this movie is detailed and accurate, I will\ngo see it again.\n"},
{"review": "\nBradley Cooper stars as Chris Kyle, the most prolific sniper in\nAmerican military history. It begins with the thirty year old Kyle as a\ncowboy type who is searching for meaning in his life when he becomes a\nnavy seal. After rigorous training he is sent to Iraq and becomes a\nlegendary sniper. The war scenes look very similar to Stanley Kubrick's\noften used ones in Full Metal Jacket. The camera tracks from behind the\nsoldiers as they move forward. The action is fast paced and well done\nby director Clint Eastwood. The melodramatic family moments are fairly\ntypical, with the suffering wife holding the home front while hubby\nkeeps the world safe for democracy. I found Sierra Miller annoying as\nKyle's spouse, but Cooper was cast right in the lead role. Although a\nbit too long at two hours and fifteen minutes, it is still one of the\nbetter films of 2014.\n"},
{"review": "\nI have watched this movie over five times already and have found myself\nin awe, happiness, relief, thankfulness, and in tears by the end of\nthis amazing movie. Every American should see this movie to see a\nlittle of what our soldiers have to go through. By all means, this\nmovie does not serve our troops justice because I can't even imagine.\nThey are the bravest men God has put on his beautiful Earth so protect\nus from evil. This movie makes you realize how important our soldiers\nare. My thoughts and prayers are with Chris Kyle's friends and family.\nBy far, one of my favorite movies. Chris Kyle's story was finally told\nafter the fact he was gone. This movie shows that Chris Kyle was more\nthan just a Navy Seal with a rifle, he was on mission to protect his\nbrothers that were there with him. Chris Kyle saves many, many people\nincluding soldiers despite the danger he was in and having to leave his\nfamily at home. He is a true hero.\n"},
{"review": "\nAmerican Sniper did a great job portraying an Chris Kyle as the\nAmerican hero he is. It showed how he did what he had to do while\nfighting in the war but also did whatever he could do to help others\nafter he came back home and helped himself. The fighting scenes in this\nfilm may not be exactly what had happened but it is very intense and\nappeals to the people who have never experienced it. It is very real to\nthese people and helps you realize what Chris Kyle went through. After\nall he goes through in the war it destroys the person he was but does\nnot kill him. him or end up killing him. After his war experiences hurt\nhim, he helps himself and gets back to who he used to be. After all the\nfighting he is killed why fighting others.\n"},
{"review": "\nI thought this movie was powerful. It portrayed the military man he\nwas, how he had to adapt to civilian life again, the struggles of war.\nFor him to then be killed by a man he was trying to help, who was also\ndealing with post war mental health. It shows the strains and stresses\nof what war is really like. I believe this movie to be excellent and\nmoving. Sad ending for such a great Soldier. Reading some of the\nreviews, surprise me. I wonder how these guys would cope 1. Just with\nwar in general. 2. Being a sniper which you have to battle with your\nmind playing tricks, being 100% alert the whole time, whilst laying in\nyour urine and poo. My hat is off to the man and it's so sad he died.\nRip American sniper.\n"},
{"review": "\nHow can people be so brainwashed by this movie? Just another cliché'\npro-American war propaganda film, end of story! This film is Nothing\nnew, doesn't bring anything to the table...The plot is obvious, every\nscene is Predictable, we've all seen this script a million\ntimes...beaten and sold to the Highest bidder, pushed by the Hollywood\nwar machine. The main character is \"always\" a lone wolf, just killing\neveryone in sight, totally unstoppable! He has a southern accent, and\njust the right amount of Scruff on his beard! How original, Not! I\ncouldn't even Finish this movie, what a joke! I almost Never give bad\nreviews on here, but this was just crap, talk about beating the dead\nhorse!\n"},
{"review": "\nA different movie than I thought. Less a movie about the joys of war\nand more about the psychology effect of war on people. I can tell that\nmany people who wrote about this move did not actually see the movie.\nThose that talk about it being propaganda have never seen or did not\nstay to watch it. This movie did not say war is good was nothing good.\nOnly the attitude that a man went to war to protect Americans and with\nthis ideal, he went on to be great. It took a longer time for him to be\naffected by the evils of war, but in the end, the evils of war,\neventually caught up with him and he had to quit, even if he didn't\nwant to quit. I don't understand the hate I hear about it, except that\nsome are predisposed to a certain opinion and can't look at this film\nobjectively.\n"},
{"review": "\nEver since I read the book I had high expectations for the film. That\nbeing said, the film went above and beyond what I was expecting. I was\ncompletely blown away. Bradley Cooper truly delivered on his finest\nrole ever (in my opinion at least), and Clint Eastwood's directing was\noutstanding. The film made it seem like I was on the battlefield with\nChief Chris Kyle (even though I'm not in the service) and looked death\nin the eye like he did. But it also reminds me of those who do\nserve/have served, and my appreciation for what they do to protect our\ncountry has gone up so many levels. In closing, American Sniper is a\nmust-watch film, and I guarantee that you will not be disappointed. To\nall those who serve/have served our country: thank you for your\nservice, and God bless America!!\n"},
{"review": "\nI consider myself an independent though I usually vote Demoratic. With\nthat in mind, I viewed this movie with an open mind concerning the\ncharacter of Chris Kyle and his motivations for fighting in the Middle\nEast as well as how he coped with his post-war life and home life\nconcerning his wife and his children. Bradley Cooper and Sienna Miller\ndo fine in their roles as first single people getting to know each\nother before they get married and he then goes to a far away country\nprotecting people in a foreign land from committing terrors against\nother peoples. Clint Eastwood compellingly depicts the hardships\ninvolved in doing the job and making it back not only in one piece but\nalso with some lasting issues in trying to get back to a normal life\nafter all that calamity. So on that note, I recommend American Sniper.\n"},
{"review": "\n.....when Jane Fonda praises a Clint Eastwood war movie.<br><br>I mean you expect people like Mikey Moore to trash this genre, but when\nJane Fonda says nice things about what is considered to be a movie with\na right-leaning theme, you have to know it's probably worth seeing.\nPerhaps there's hope for Jane after all these years. It's telling that\nthe most vocal detractors (Moore, et al) are also those least likely to\nhave ever worn a uniform (well, a REAL uniform, not the moth-eaten\nball-cap, Joe Sixpack uniform that Moore like to wear). Fonda compares\nthe film to \"Coming Home\", which I was not crazy about, but I grant\nthat it was a good film.\n"},
{"review": "\nBradley Cooper delivers an Oscar nomination-worthy performance as\nMilitary-hero-sniper husband. We see his challenges and excruciating\ndecisions both at home, and on the battlefield. Director Clint Eastwood\ncaptures the person Chris Kyle, from premilitary to civilian life.<br><br>This could easily have been a 4 hour movie, but Eastwood navigates\nquickly and gently through the scenes. <br><br>My amateur critic friend has never before uttered \"This was a great\nmovie!\" in my presence before. <br><br>I felt like I was there, as it happened. <br><br>Do not miss this movie! Guaranteed to win at least 1 of 2 Oscars for\nSound Editing/Mixing.<br><br>Saw it 15JAN15 with a friend.\n"},
{"review": "\n*Spoiler/plot- American Sniper 2014. A US Navy seal operative goes to\nfight in Middle East and becomes proficient as a sniper to protect\nfront line troops all the while trying to be a good husband and father\nat home.<br><br>*Special Stars- Bradley Cooper, Kyle Gallner, Ben Reed, Elise\nRobertson, Troy Vincent, *Theme- War teamwork will accomplish the\nmission.<br><br>*Trivia/location/goofs- Won an Oscar.<br><br>*Emotion- The plot is very well written and preformed to get the\naudience to connect to all the complexities of service personnel acting\nfor America in the Middle East.<br><br>*Based On- Famous best seller book and True experiences of US\nservicemen in the Middle East conflict.\n"},
{"review": "\nAmerican Sniper is hardly a film to be shown only Oscar for best film ,\neven more so is m good movie , to start with the good cast , especially\nBradley Cooper makes a good performance , Clint Eastwood is the\ndirector of the film plus he's been better, the film is very Patriota,\nsaid Chris Kyle killed many innocents , I did not give because I know\nthe story of Kyle , the soundtrack is good , the script is average ,\nhas many script errors, the photography is good , the action scenes are\nwell done , most do not expect a battle level Saving Private Ryan , in\nterms of excitement , because not much excites the action scenes , and\nthe last moments are a bit scuffed, American Sniper is a good movie ,\nplus has many script errors , and is very Patriota. Note 7.5\n"},
{"review": "\nWar doesn't come lightly, it takes lives, destroys homes, and brings\nnations to its knees. Chris was a cowboy turned seal, after examining\nthe movie you can see that this plays a big part in him having drive to\nbe able to make it through the war. As the movie goes on there is a\ntime when Chris is sitting at home staring at a blank T.V. Some\ndramatic music is playing building tension. Yet the key point is we\nstart to hear screams, and gunshots, they start to get louder and\nlouder until his wife comes and interrupts his thoughts. This displays\nChris's PTSD (Post-Traumatic Stress Disorder) very well, and is one of\nhis encounters with it.\n"},
{"review": "\nLet's face it, this is should not have been a Best Picture nominee. But\nis the movie complete garbage? Absolutely not. Bradley Cooper has an\nincredible performance as Chris Kyle as well as Sienna Miller. Clint\nEastwood's direction also makes you feel like you're dead smack in the\nmiddle of this war. The problem with the film lies in the\nscriptwriting. It's flimsy and didn't really know what it was doing.\nThe directing was unable to match with the screen writing. Eastwood's\nrealistic directing and the unrealistic dialogue clash into this weird\nmesh of a film. However, it is definitely worth seeing for the sake of\nCooper, Miller, and Eastwood.\n"},
{"review": "\nThis is a great movie. The complaints that it stereotypes Muslims and\npresents them as one dimensional are in themselves stereotypes. The\nWest is at war with Islam but such is the political correctness within\nthe West that the West cannot even define Islam as the enemy. This\nmovie captures perfectly the lacuna between the values of Islam and the\nWest: there is no compromise or overlap in values. Islam makes this\nplain time after time. Chris Kyle is one small cog in this battle and\nhe personifies what it will take to defeat Islam. The sacrifices he\nmakes in respect of his personal life do have a element of cliché about\nthem but this lack is more than compensated for by the verisimilitude\nof the battle scenes. Further poignancy to the movie is that Kyle's\nmurderer was at the very least sympathetic to Islam even though there\nis no evidence that he had converted.\n"},
{"review": "\ni really enjoyed this movie it was without a doubt Bradly best films\nand performance of a lifetime more like lone survivor but this one with\nfamily as extra hold, i really enjoyed it i had doubt first that it\nwill be boring but man oh man! one of my best movies of this year.\nalthough i wish there was like more drama or extreme to submit the\nlines and the role of his own although his brother we didn't know what\nhappen to him since that plane scene pf was gone. and i missed seeing\nhis old buds and loved how he react with his kids and especially wife\nat last minutes of the movie and struggling to bring back the old him\nback we should see that like come on Cooper in drama with his feelings\nfans gotta see that. but nonetheless i really enjoyed it hope there's\nmore of such amazing war movies like this one and Lone\nSurvivor.Thnks!!!\n"},
{"review": "\nBased on a true story, this is a strong drama taking place in the Iraq\nwar. This is a story of a Texas Native American Sniper Chris Kyle. You\nwill see the true sacrifices made by both Chris Kyle and his family\nduring his four tours in the Iraq war. <br><br>You will be immediately immersed into the harshest of decisions our\nmilitary has to make in the day to day operations of a tour. This movie\ninvokes your sense of patriotism and leaves you wanting to do more for\nour Men and Women in the U.S.Military. You will gain a strong\nappreciation for not only for our Men and Women that have served; but,\nalso for the families that have endured as well.\n"},
{"review": "\nAs a veteran myself i think there is probably no other man in history\nwill ever be more decorated in war as a sniper than Chris Kyle. this\nmovie is not only motivating but it's also an i opener for what his\nlife was like and what you see through the eyes of the scope. If you\nhave read the book you know exactly what i'm talking about. I think the\nsad part is that all some people will see is a movie that they feel is\nmade solely to make money and tell a story of a true warrior who\nsurvived multiple engagements and then was unfortinatley killed in a\nterrible shooting at a gun range. this movie portrays the life of an\nAmerican hero and someone who loved his family i truly commend clint\neastwood for taking this movie into realm and making it an instant war\nclassic and helping chris kyles legacy live on in our memory\n"},
{"review": "\nFinally watched American Sniper. Now I understand the backlash against\nthis film. While it's very competently filmed and acted, it completely\nwhitewashes the main character, who was, essentially, a mass murderer.\nThere is no nuance in the script or portrayal of Chris Kyle, apparently\na man without any gray areas. And it overlooks the obvious irony, that\nhe was, in turn, killed by another gun toting mass murderer. Then\nthere's the issue of whether bringing a psychotic to a gun range for\n\"rehab\" is such a good idea. Clearly not. And it ignores the fact, as\nmost of the media has, that someone else was killed that day besides\nKyle.<br><br>In all, the film will make you root for the \"good guys\" without raising\nany questions about whether they are all that good. It completely\nmisses a great opportunity to delve deep into the issues of soldiering,\nmental health, gun culture and PTSD. I expect more from a great\nfilmmaker like Eastwood.\n"},
{"review": "\na real person. The movie is about Chris Kyle, a guy whom was a navy\nseal and had the highest total of sniper kills in the middle east. It\nfollows him through a few tours and what his life was like when he came\nhome. He was married and had a couple of kids, but was more concerned\nabout America. When he finally gets out, it shows how his mind was\nstill messed up from what he had experienced but was trying to get\nbetter when he died.<br><br>The best part of the movie was the war scenes that were shot very well.\nYou get a feeling of what it would be like to be a sniper sitting on\ntop of a building. Soon, that's not enough for Chris and he wants to be\ninvolved in the more dangerous door to door. Also toward the end there\nis an exciting shooting scene where Chris completes the main objective\nbut the group's position is compromised and they must get out with a\nhuge sand storm moving in.<br><br>FINAL VERDICT: Definitely one of the better films in the past several\nyears. Check it out.\n"},
{"review": "\nYes it is. But we're talking about Clint Eastwood here. And while he\ndid talk to a chair (something I actually thought was funny as an\n\"act\", not so much what he was saying), he's still a good director\nwho's able to juggle things around. And make them feel right - or as\nright as it is possible.<br><br>Many have and will call Snipers cowards. People who are not going into\nactual fight that is going on, but wait and have to kill a lot of\npeople from long distance. But we do get a glimpse into what might be\ngoing on in the head of one of those men. Bradley Cooper is once again\nmesmerizing in his portrayal. And while I was not aware of all real\nlife incidents that happened, that might have elevated the whole story\nfor me.\n"},
{"review": "\nAmerican Sniper is a must-see for those who are craving for the\npowerful war movies. Clint Eastwood's six academy nominated film is\nworth watching overall. Bradley Cooper's portrayal as America's most\nlethal sniper is undoubtedly his best performance yet. His dedication\nof changing his physique and getting the vocal similar to Chris Kyle is\nsimply impressive. He totally deserves this year's Oscar nomination.\nThe story telling is quite compelling, yet it occasionally fills with\nunnecessary political propaganda in the life story of the \"Legend\". All\ntechnologies in making of this film will make everything seemed so\nrealistic which will make you feel with the Iraq war experiences as if\nit is happening just right in front of you. Overall, \"American Sniper\"\nis definitely not a feel good movie as it has some tragic events which\nare currently happening in this world. Combining with the brilliant\nsound effects of intense shootings and realistic cinematic shots will\nmake you to be on the edge of your seat during the entire running time.\n"}
]