[
{"review": "\n\nI've seen way too many thrillers. You name it: \"Identity\", \"Seven\", \"The\nUsual Suspects\", etc., etc., etc. I remember my friend being so obsessed\nwith \"Silence of the Lambs\", that it drove me crazy. And I hated the movie\nnaturally and refused to see it. But everyone told me that I have to see\nthis, so I let my guard down. And had an open mind, and I'm glad I did. My\nfriend was right, this is a great movie. It is so well acted, I couldn't\neven describe. I loved \"Silence of the Lambs\" and would recommend it to\nanyone. It's creepy and exciting. Trust me, you'll love\nit.<br><br>10/10\n"},
{"review": "\n\nBrilliant Best Picture of 1991 that never gets old.  \"The Silence of the\nLambs\" deals with a young FBI cadet (Oscar-winner Jodie Foster) who is sent\nto interview a captured madman (Oscar-winner Anthony Hopkins in one of the\ngreatest performances ever on the screen) to find out about a serial killer\n(Ted Levine) who is stripping the skin from his female victims after they\ndie.  The FBI has had no luck with the case and agent Scott Glenn tries to\nthrow a curve-ball to Hopkins by sending Foster.  Hopkins is a former doctor\nof Levine and holds the clues to capturing the unknown criminal.  Needless\nto say the film takes many twists and turns, creating a suspenseful thriller\nthat has no equal.  At the heart of \"The Silence of the Lambs\" are the\nconfrontations between Hopkins and Foster.  They play a complicated chess\nmatch of words which results in some of the greatest footage ever captured\nfor the cinema.  Hopkins dominates in spite of the fact he has approximately\n17 minutes of time in the film.  This is a film that will wrap itself around\nyou and you will likely never be able to shake some of the key elements you\nhave seen in this amazing masterpiece.  5 stars out of 5. \n\n"},
{"review": "\nThe Silence of the Lambs runs two hours.Anthony Hopkins appears for\nlittle more than sixteen minutes, yet during those minutes he hasn't\nbored you for a second, not even after the tenth or eleventh viewing.\nSuch is the power of his performance, it's absolutely impossible to\nforget him.His character, Dr.Hannibal\"The Cannibal\" Lecter, is a brutal\nkiller with revolting methods and habits, but he's also very\nintelligent, charismatic and with good taste(you can interpret that as\nyou like).A clichè by now, but who cares? He still is one of the key\nelements in this wonderful thriller, which sees Jodie Foster's Clarice\nStarling asking for Lecter's help to catch another killer.The result is\na dangerous yet fascinating relationship between the young,\nunexperienced FBI-agent and the convicted,but basically omnipotent,\npsychiatrist.He's a step ahead of everyone all the time, and makes sure\neveryone notices, with his witty, unforgettable one-liners.If there had\nto be only one reason to worship this movie, then it would have to be\nthe chemistry between the two leading actors.Never before has a\nnon-sexual man/woman connection been more thrilling.Never before has a\nfilm's ending been more unsettling and brilliant and left us asking for\nmore.<br><br>Best watched with a nice Chianti...<br><br>P.S. dear film-buffs, have the lambs stopped screaming?\n"},
{"review": "\nI'll never forget my first viewing of this movie at the theater and\nwill always look back fondly on it for one reason: helping me quit\nsmoking cigarettes.<br><br>I read the book first, was fascinated by it, and couldn't wait for the\nfilm to come out. That was the day I picked to quit smoking and I knew\nthis movie would take my mind off that matter. I was expecting an\nintense movie and I got it. Little did I realize how well-received this\nfilm would be and how it propelled Anthony Hopkins to super-stardom.<br><br>Although entertaining, this is not always a fun movie to watch,\nespecially with the scenes with Ted Levine who plays the killer,\n\"Buffalo Bill.\" \"Bill\" and his kidnapped young woman are sick and\nprofane people, respectively, and their scenes are very unpleasant.\nThis movie is not for the squeamish with those and other scenes\ninvolving the infamous Dr. Hannibal Lecter (Hopkins). There also is\nsome extreme crudeness in the jail/dungeon where Lecter and other\ninmates are held.<br><br>Jodie Foster is excellent as the FBI agent \"Clarice Starling\" and Scott\nGlenn is low-key and effective as \"Jack Crawford.\" A major part of the\nfilm is psychological more than violent as Lecter constantly taunts\n\"Clarice,\" while she tries her best to manipulate him to help with a\ncase. The by-play between the two is a game in itself.<br><br>Hopkins, however, is the actor people remember best from this movie.\nHis portrayal of the refined-yet-cannibalistic serial killer-doctor is\none viewers will never forget. I've enjoyed watching him in the\nsequels, too. The looks on his face, his fascinating vocabulary with\nintelligent sarcasm and frankness, never ceases to entertain.<br><br>\"Silence Of The Lambs\" has turned into a modern-day \"classic.\" If by\nsome odd chance you have never seen this movie, be warned it is a dark,\ndifficult story to watch at times....but it will get your mind off\nother things.\n"},
{"review": "\n\nThis is definitely a film that proves you don't need tons of blood and gore\nto have a good suspense film.  Anthony Hopkins performance as the deranged\ngenius Lecter earned him a well deserved Academy Award and the same was true\nof Jodie Foster's performance as Clarice Starling.  This film should go down\nin history as one of the greatest suspense films in the history of\ncinema.\n"},
{"review": "\n\nThe Silence of the Lambs, having accomplished the rare feat of winning all\nfive of the major Academy Award categories, is a remarkable achievement in\nfilmmaking.  Gruesome, pulpish material was transformed by dedicated\nparticipants on all levels of production, and a film that would have failed\nin the hands of many others wound up becoming a modern masterpiece.  Taut\ndirection and a superb screenplay might be the best arguments for the film's\npower, but the flashiest are certainly delivered in the bravura performances\nof Hopkins and Foster.  Their interplay -- and remember, they only share a\nhandful of scenes together -- is nothing short of riveting. \n\n"},
{"review": "\n\nWith Silence of the Lambs comes some much needed recognition for the horror\ngenre.  It is a first-rate production all around.  It boasts a witty and\nsuspenseful script based on the Thomas Harris novel, full of great lines. \nIt has marvelous direction from Demme.  Demme creates suspense very well\nthroughout and uses some great directorial shots such as the twin frames of\nClarice ringing a doorbell and the FBI men breaking into a home.  The two\nlead actors won oscars for their performances...each deserved.  Foster is\nvery good in her role, but it is Anthony Hopkins that literally lights up\nthe screen with his complex portrayal of a complex serial killer.  Hopkins\ndoes the seemingly impossible. He frightens you with his outrageousness and\nyet illicts some pity/compassion(albeit not a lot) for his situation.  He\nsays his lines with reservedness when needed and brashness when needed.  The\nrest of the cast is also quite good with Anthony Heald a standout as a\nunethical, petty doctor in charge of Hopkins.  Of course the story of the\nother killer is very very chilling as well.  A quality film in all\naspects!\n"},
{"review": "\nThere is little doubt that the most memorable aspect of The Silence of\nthe Lambs is Anthony Hopkins' incomparable performance as Lecter.\nTaking over for Brian Cox, who was effective, but not especially\nmemorable, as the good doctor in 1986's Manhunter, Hopkins instantly\nmakes the role his own, capturing and conveying the charismatic essence\nof pure evil. To his dying day, no matter how many roles he plays in\nthe interim, Hopkins will forever be known for this part. (It is a\ncredit to Hopkins' ability as an actor that this part did not result in\nstereotyping. His post-Silence career has been greatly varied, with\nroles as widely diverse as a stodgy butler in Merchant-Ivory's The\nRemains of the Day and an action hero in The Edge.) I can throw out any\nnumber of superlatives, but none of them do justice to this chilling\nperformance, which I labeled as the best acting work of the '90s. Want\nto feel the icy fingers of terror stroke your heart? Watch this mixture\nof brilliant eloquence and inhuman cruelty. As portrayed by Hopkins,\nHannibal is both a suave, cultured gentleman and an unspeakable fiend.\nHe is gracious and monstrous at the same time. (Hopkins also provided\none of the most quotable lines in recent film history with \"I ate his\nliver with some fava beans and a nice Chianti\", which was followed by\nan inimitable slithering slurp.)\n"},
{"review": "\nSilence of the Lambs is a quintessence of a profound character study\nand a rare and vivid demonstration of an actor's subtle brilliance and\nhis improvisation in manifestation of a nebulous entity (Lecter),\nalmost single-handedly immortalizing it and in the process elevating\nhimself to a position of unqualified envy and ubiquitous acclaim. In\nfact, one is likely to suffer, either from inarticulacy or verbosity\nwhile describing Anthony Hopkins portrayal of sadistically\nsophisticated Dr. Hannibal Lecter. Lecter's trademark, his wide open\nglacial eyes, devoid of any emotion, not only makes him deviously\nequanimous, but also egregiously peculiar. The fast, slurping-type\nsound invented by Hopkins that Lecter does, is as fascinating as it is\nchilling and Lecter's infamous \"Good evening, Clarice\", is as\nenthralling as it is vicious. Anthony Hopkins's performance is the\nshortest ever and the most memorable to win an Oscar in the leading\ncategory. <br><br>Hopkins as Lecter, is incontrovertibly and incredibly at the top of his\ngame and it is his brilliance that gets the best out of the other\nactors, especially Jodie Foster. In fact, it won't be a hyperbole, that\nAnthony Hopkins's portrayal of cannibalistic Hannibal Lecter in Silence\nof the Lambs and more so in its sequel, Hannibal (which is my favorite\nof the series, as the story completely revolves around Lecter, giving\nhim more exposure), is one of the best, the world of cinema has ever\nseen or offered. In spite of having some of the most gruesomely\ndisturbing and viciously graphic sequences, Silence of the Lambs, is\none of the most decorated and enthralling movies of all time. A must\nwatch for avid fans and eclectic viewers.<br><br>http://www.apotpourriofvestiges.com/\n"},
{"review": "\n\nTHE SILENCE OF THE LAMBS (1991) **** Jodie Foster, Anthony Hopkins, Scott\nGlenn, Ted Levine, Anthony Heald, Brooke Smith, Diane Baker (Cameos: Roger\nCorman, producer Kenneth Utt, singer Chris Isaak)   Terrifying masterpiece\nof modern-day horror and the first film since 1975's \"One Flew Over The\nCuckoo's Nest\" to win all 5 major Oscars (Picture, Director: Jonathan Demme,\nActress Foster, Actor Hopkins, and Screenplay Adaptation by Ted Tally of the\nbest-seller by Thomas Harris): novice FBI agent Clarice Starling (a stalwart\nFoster) begins her career in a manhunt for a serial killer known as \"Buffalo\nBill\", a transsexual wanna-be whose grisly crimes leads to her only source\nof his trail: imprisoned psychiatrist Hannibal \"The Cannibal\" Lecter\n(Hopkins in one chilling and modulated perf) whose mindgames with the rookie\nagent has her on her toes and running out of time.  Exciting, suspenseful\nand supremely scary with some truly eye-widening moments of the unexpected. \nBest line: Lecter at film's end: \"I'm having an old friend for\ndinner.\"\n"},
{"review": "\nOnce upon a crime, Hannibal Lecter was a manipulative psycho-killer\ncompensating for his incarceration by messing with people's minds. Then\nHannibal happened and he suddenly turned into a dandy anti-hero...\nWatching The Silence Of The Lambs again really puts things into\nperspective. Jonathan Demme's astute adaptation of Thomas Harris' last\ngood book entwines the horror and detective genres to enduringly\nshocking effect, while Anthony Hopkins' Lecter and Jodie Foster's\nStarling fizz up an unsettling chemistry that was utterly lacking in\nthe sequel.<br><br>I haven't seen a movie this perfectly wrapped in a while. I recently\nre-watched it and it blew me away and it only gets better the more you\nsee it.<br><br>The performances from everyone are great. Foster sold every scene she\nwas in. But, of course, Hopkins stole every scene he was in and was a\npowerful anti hero who was scary even when concealed because you know\nhis mind is working at every second. Always planning and he's rarely\nwrong. His escape was an amazing scene. Levine gives a suitably scary\nperformance but just doesn't stand up to the greatness of Foster and\nHopkins.<br><br>All the characters main characters are deep people are deep people with\nclear motivations. The police officers are the complete contradiction\nto this who abuse their power to do what they believe is right, and end\nup being wrong. It's clever.<br><br>Everything is wrapped together really well, the performances were great\nand it's full of memorable scenes.<br><br>I'm giving The Silence of the Lambs a 10/10.\n"},
{"review": "\nAgent Clarice Starling is a training FBI agent, hope to work in\nbehavioral sciences with Jack Crawford. Crawford though sends Starling\non an assignment, to psychologically exam the insanely intelligent\ncriminal Hannibal Lecter. Crawford had another agenda, to see if\nStarling can press information out of Lecter to help with the current\ncase of Buffalo Bill. Bill has already killed five girls, skinning off\nsections of their bodies. Lecter is intrigue by Starling and helps her\nwith the investigation; they start to form a strange friendship.<br><br>The Silence of the Lambs is one of the best psychological thrillers.\nThomas Harris's best selling book is faithfully transfered to the\nscreen. It's one dark twisted disturbing ride. The mood is heighten by\nDemme's great direction, with such detail in all the sets and\nlocations. Demme has used reflective surfaces wonderfully, during one\nof Starling's and Lecter's talks it used to great extent. One of the\nfinal sequences of Clarice walking through the basement of Bill's house\nis one of the most suspense full scenes i have ever seen.<br><br>All the performances are knock outs. Jodie Foster as always brings the\ngoods and makes Starling the most interesting to watch. At times she\nmakes Starling so fragile, then a second later she's strong as steel.\nAnthony Hopkins is so disturbing as Lecter. From the first second you\nsee Lecter standing in his cell; just waiting for Starling to show, you\ncan see Hopkins was perfect casting. You cant keep your eyes off\nLecter, he's so disturbing and can make your skin crawl every time he\nspeaks. Ted Levine makes the perfect serial killer, you can see from\nLevine's performance what a torn and damaged soul the killer is; you\nfeel somewhat sympathetic for him.<br><br>The Silence of the Lambs is a must see, one of the best thrillers\nyou'll ever see.\n"},
{"review": "\nOne of the best movies of the 90's and one of the few thrillers that\ncan match up with Alfred Hitckok's movies.Certainly the perfect choice\nfor the character of Hannibal Lekter, Sir Anthony Hopkins who manages\nto make the \"cannibal\" a kind of hero. The film won 5 academy awards\nbut in my opinion it worths for more. I would like to stay more in the\nperformance of Anthony Hopkins that is really majestic and gives the\nfilm more quality.Hopkins gets to the skin of his role and makes you to\nfeel that he is a real psycho killer.Also the direction is perfect by\nDemme and makes the viewers to be absorbed by the fight of the FBI\nagent Clarice Starling and Dr. Hannibal Lecter.Jodie Foster fairly wins\nthe Academy Award for Best Actress in Leading Role.\n"},
{"review": "\nIt is really difficult for me to understand what it is about this film\nthat everyone loves. I have seen many thrillers and I can honestly say\nthat this one is not even in my Top 20. Although I think Hopkins did a\nterrific job in Lecter's shoes, his 30 minutes on screen just were not\nenough. This was supposed to be a horror film but I think it barely\nmanaged to create the suspense atmosphere and it certainly did not\nscare me or made me feel uncomfortable at all. Perhaps I expected more\nsince I have been hearing all the fuzz about this movie since I was a\nlittle kid. So I watched this film several times and I am still not\nenjoying it that much.\n"},
{"review": "\nI have been fascinated by this movie from the first time I saw it! To\nme, I felt connected to agent starling, I don't know if everyone gets\nthe relationship between Clarice, and the most profound impact that\nliving with her relatives during the slaughter season of the \"lambs\",\nhad on her as a person. I think anyone that has ever experienced any\nkind of abandonment, helplessness, and just feeling terror in\ngeneral,as she did, when she tried to save that one lamb; and couldn't,\nwell, it just makes you cry, because you see the helplessness of her\npast, meeting her once again in her present!As she fought to help the\nvictim, she had to overcome the victim within herself, as well.I loved\nJodie Foster in this movie, and I can't pass up an opportunity to watch\nit again and again!I love her dialect, her acting, and; the way that\nshe pulled the movie together!\n"},
{"review": "\nTHE SILENCE OF THE LAMBS is, quite simply, a breathtaking movie. It's\nthe granddaddy of all serial killer flicks, a film that even the\nalmost-as-good SE7EN can only aspire to, a movie that gets into the\nmind and soul of a serial killer like few others. It inspired a huge\nsub-genre of similar movies that came out during the 1990s and 2000s,\nand it's up there with Hitchcock's PSYCHO as one of the most gripping\nlooks at the subject matter of all time.<br><br>Where to begin? There's a pitch-perfect Jodie Foster, gradually leading\nus into the depths of the storyline as the naive FBI agent, and the\noft-overlooked Ted Levine who excels as the supremely skin-crawling\nBuffalo Bill. Of course, the film is dominated by Anthony Hopkins,\ngiving the best and most memorable performance of his career in just 16\nminutes of screen time. Hopkins chills you to the bone in this, and\nJonathan Demme's direction is a perfect match for his talents.<br><br>The storyline is engaging, ably mixing the criminal investigation\nstrands with scenes involving the killers themselves. There are gory\nand monstrous set-pieces which make your flesh crawl while watching,\nyet it's all rather restrained and intellectual, a surprise given the\nsubject matter. Most importantly, it's never less than gripping and\ncompletely frightening. A true masterpiece of a movie.\n"},
{"review": "\nAfter watching it, i was simply stunned. It is seriously magnificent,\nthis film has so many awesome qualities to it. It is deep, thrilling,\nfull of suspense, has super interesting characters, especially,\nHannibal Lecter.<br><br>Could very well be the best crime/thriller movie ever made, there\nreally are no movies, you could compare it to, it is unique and elegant\nin a different way. Dr. Lecter(Anthony Hopkins) truly is an\nunforgettable character and his conversations with inspector\nClarice(Jodie Foster) were the best thing in this movie for sure. There\nis a reason Anthony Hopkins and Jodie Foster, both(!!!) won an Oscar\nfor this film, not to mention The Silence of the Lambs has 5 Oscars to\nits name altogether, surely the best movie of 1991.<br><br>Doesn't matter what kind of movies you are into, you will thoroughly\nenjoy The Silence of the Lambs, it just has too many outstanding\nqualities, that it should be impossible to dislike this and even if\nthere are any flaws, you will not notice them, since they get\novershadowed by the super interesting and suspense storyline.\n"},
{"review": "\nThe acting is of a very high level. Foster put down a good role as\nClarice Starling and the supporting cast was very good (think of\nBuffalo Bill, for example). The star of the show is Anthony Hopkins.\nThe role he put down here is really nothing less than genius. The dude\nis perfectly cast and is both friendly and polite, and very creepy and\nsmart about it. I think it's an incredibly and fascinating character.\nHannibal is for me one of the best psychopaths I've ever seen in a\nmovie.<br><br>Overall I highly recommend this movie if you love thrillers and\ndetectives because this is definitely one of the best in its category\nfor me. And i think this movie is also in my top 10 films!!\n"},
{"review": "\n\"The Silence of the Lambs\" will have to go down in history as one of\nthe most ingenious movies of all time. After a string of bizarre\nmurders, FBI agent-in-training Clarice Starling (Jodie Foster) is hired\nto interview psychopath Hannibal \"The Cannibal\" Lecter (Anthony\nHopkins) to find the perpetrator. In the process, we get to learn some\nvery interesting things about both Starling and Lecter. The main thing\nis that, despite how vile Lecter is, we can't help but admire him. And\nI don't mean just because he's helping Clarice; something about the\nguy, you just gotta love him.<br><br>In case you're squeamish, I should remind you that this movie contains\nsome very ugly scenes. But don't worry, director Jonathan Demme knows\nhow to handle them. This masterful combination of acting, directing and\nwriting helped \"The Silence of the Lambs\" win the top five Academy\nAwards, putting it in a league with only \"It Happened One Night\" and\n\"One Flew Over the Cuckoo's Nest\". Watching the movie, you will agree\nthat the movie deserved these awards. In fact, you just might want to\nhave an old friend (over) for dinner.\n"},
{"review": "\nSilence of the Lambs was the birthplace of Anthony Hopkins's Hannibal\nLecter, one of the finest monsters ever screened. Although this is the\nmiddle film in the trilogy, it was made first and remains the finest in\nthe set.<br><br>Clarice Starling (Jodie Foster) is a highly intelligent, very\nvulnerable young FBI trainee. With a serial killer named Buffalo Bill\nincreasing his body count. Clarice is sent by Jack Crawford (Scott\nGlen) to attempt to gain any information that she can from Dr. Hannibal\nLecter (A brilliant, yet Insane Psyciatrist known as Hannibal the\nCannibal) Starling has to gain Lecter's trust, by engaging in very\ndangerous mind games with the Doctor, and the last person you want in\nyour head is Hannibal Lecter, but without his help, Buffalo Bill's\nvictims will stand no chance.<br><br>Foster and Hopkins have a very strong on screen chemistry, and both\nportray their characters brilliantly, making them realistic and\nbelievable. The Scenery matches the mood of the movie, very dark and\ngloomy for much of the time, and the pockets of suspense interlaced\nwith some imaginative psychological horror make Silence of the Lambs a\nmovie that sets the standard, and the standard is high.<br><br>10/10\n"},
{"review": "\nA serial killer nicknamed \"Buffalo Bill\" (Ted Levine) gains even more\nnotoriety after kidnapping a woman by the name of \"Catherine Martin\"\n(Brooke Smith) who happens to be the daughter of United States Senator\n\"Ruth Martin\" (Diane Baker). Although he hasn't cooperated since his\narrest and conviction for several grisly murders, a former psychiatrist\nnamed \"Dr. Hannibal Lector\" (Anthony Hopkins) is persuaded to do so by\na young FBI agent-in-training named \"Clarice Starling\" (Jodie Foster).\nBut with time on his side any assistance he gives will come at a very\nhigh price. Now rather than reveal any more I will just say that this\nwas a fascinating movie from start to finish with Academy Award winning\nperformances rendered by both Anthony Hopkins and Jodie Foster. It also\nwon the Academy Award for \"Best Picture\" as well. In any case, I highly\nrecommend this film for those who might enjoy a movie of this type and\nI have rated it accordingly.\n"},
{"review": "\nGreat, tense thriller.<br><br>An FBI agent-in-training, Clarice Starling (played by Jodie Foster) is\ngiven an assignment to interview infamous serial killer, Dr Hannibal\nLecter (Anthony Hopkins). He has been imprisoned in a mental\nhospital/prison for the last eight years. The reason to seek out Dr\nLecter is that another serial killer, \"Buffalo Bill\" has killed and\nskinned five woman and the FBI feels Dr Lecter might have some insights\ninto who he is. Then Buffalo Bill kidnaps a Senator's daughter and\nfinding him becomes even more urgent. <br><br>Great psychological drama. Plot is fine, though one or two developments\nfelt a bit contrived. As much a character-driven drama as a plot-\ndriven one, as we have a battle of wits between Lecter, Starling, a\npsychiatrist and Buffalo Bill and individual personalities play a part\nin the outcome. <br><br>as the movie progresses the tension is ratcheted up well by director\nJonathan Demme. The last few scenes are incredibly tense and\nclaustrophobic.<br><br>Great work by Anthony Hopkins as Lecter. Well deserved his Best Actor\nOscar. Jodie Foster is solid as Starling and also got an Oscar for her\nefforts. Decent supporting cast too.\n"},
{"review": "\nSeveral months ago, I watched The Silence of The Lambs after hearing of\nits notorious reputation as being one of the best films ever made.\nAfter viewing this movie, I went on to view all other films in the\nfranchise (except Hannibal Rising) and also read every book in the\nfranchise (all of which were also fairly good). After thinking about\nhow much I loved TSOTL, I've felt compelled to write this review.<br><br>Anthony Hopkins delivers an extraordinary performance as Hannibal\nLecter, as does Jodie Foster as Agent Starling and as does every single\nother actor/actress. It starts off by hastily introducing us to the\ncircumstances in which the film takes place and then slowly builds to\nwhat can be described as multiple climaxes that occur over the course\nof the film. A genius plot; a young FBI trainee hunting down a serial\nkiller on the loose with the assistance of a super-intelligent\nincarcerated cannibalistic psychopath. No faults whatsoever. A\nbrilliant film definitely deserving of its place in the first 30 spots\nof IMDb's top 250.\n"},
{"review": "\nI have seen lots and lots of films, but none were ever so well written\nlike Silence of the Lambs. The characters are amazing and there is a\nlot of shown development with them, especially with Hannibal Lecter,\nwho has to be one of cinemas greatest Villains. The film tells a\ngruesome story that you want to leave your memory immediately after\nyou've watched it. <br><br>The Silence of the Lambs is more a thriller than a horror. There are\nfew intense/scary/suspenseful scenes, but besides that it's just a\nstory of a creepy mystery. Beware an awesome plot twist awaits you.<br><br>I'll would like to keep on writing, but I'm having an old friend for\ndinner\u0085\n"},
{"review": "\nTrainee Clarice Starling (Jodie Foster) is recruited right out of\nQuantico by Jack Crawford (Scott Glenn) of the Bureau's Behavioral\nScience Services. He's investigating serial killer Buffalo Bill who\nskins his female victims. He's interviewing imprisoned killers but Dr.\nHannibal Lecter (Anthony Hopkins) refuses to cooperate. Starling is\nsent to talk to Lecter.<br><br>Director Jonathan Demme takes the serial killer genre onto another\nlevel. It is brilliantly intense and brutal. It's a solid entry but\nthen there is Hopkins' Lecter. It is an iconic villain for all times.\nFrom the moment he first appears, he steals the movie. It's rare that\nsomebody can produce a character that is so original and so memorable.\nHe is so impressive that he actually overshadows the penis-tucked\nhuman-skinning lotion-basket transvestite serial killer. Foster is also\npretty solid. She brings a competence to the role that is needed for\nthe outrageous villains to shine.\n"},
{"review": "\nThe film \"The Silence of the Lambs\" has changed a lot, above all, our\nstandards. The audience drastically changed their view of the concept\nof a good thriller. Balanced center of gravity was found on the\ngraphical violence but also the intellectual and psychological rally,\nwhere there was essentially what we are already showing what is\nsketchy, with the potential to happen. With each repeated viewing, we\nrecognize the key elements behind the facade fascinating serial killer\nin order to discover a whole range of people of different walks of\nlife, crossed in a single unattractive existence. Almost twenty-two\nyears since first screening, \"The Silence of the Lambs\" remains the\ndefinition of thriller of our time. Too bad Jonathan Demme did not\ndirect not nearly as good as this that today is undoubtedly a classic.\n"},
{"review": "\nSilence of the Lambs is an awesome movie. It is perfectly written and\nthe actors who played buffalo bill (Ted Levine) and Hannibal Lecter\n(Anthony Hopkins) were extremely good choices. Buffalo Bill is the\nperfect mix of Ed Gein, Ted Bundy, Gary Heidnik, Edmund Kemper, etc.\nEven though it is mainly a serious movie, it does have some funny parts\nto it which gives a genuine but interesting outlook to what all of\nthese serial killers actually did. Although it is over 20 years old, it\ndoesn't have the typical 'campy' humor/feel that most 90 movies had (I\nlove campy movies though so that wouldn't have been much of a problem,\npersonally). Its the perfect mix of creepy and wonderful. I would\nrecommend it fully.\n"},
{"review": "\nThis is definitely a film that proves you don't need tons of blood and\ngore to have a good suspense/thriller film.I was never a fan of this\nkind of movie genre but this movie caught my attention from start to\nfinish. I couldn't look away or sleep well at night. This is a movie\nbased off a few real life killers which makes things even scarier if\nyou ask me. Anthony Hopkins performance as the deranged genius Hannibal\nLecter earned him a well deserved Academy Award and the same was true\nof Jodie Foster's performance as Clarice Starling. This film should go\ndown in history as one of the greatest suspense films in the history of\ncinema.\n"},
{"review": "\nThe Silence of the Lambs (1991): Dir: Jonathan Demme / Cast: Jodie\nFoster, Anthony Hopkins, Scott Glenn, Ted Levine, Diane Baker:\nPsychological thriller where the film's core regards interrogation of\nevil without physical contact. Female victims are found skinned by\nBuffalo Bill and Hannibal Lector is believed to be able to identify him\nbut every agent who has approached his realm of confinement has been\nled astray. The Senator's daughter is kidnapped so a female F.B.I.\ntrainee is issued in hopes that Lector will give in to a female. We\nlearn about her through Lector's ability to trespass the mind. Shocking\nthriller directed by Jonathan Demme who also made Melvin and Howard.\nAnthony Hopkins brilliantly demonstrates Lector's sly methods of\npenetrating the mind. He delights in toying with victims, which is why\nhis brutal escape occurred. Jodie Foster is excellent as the young\ntrainee haunted by her father's death. She is intelligent and brave\nparticularly when dealing with Bill in the shocking climax. Ted Levine\nis monstrous as Buffalo Bill whose one breaking point arrives when the\nSenator's daughter gets hold of his dog. Scott Glenn is standard as the\nagent in charge of the case but instrumental at a wrong address. Diane\nBaker plays a Senator whose daughter is kidnapped by Buffalo Bill.\nPenetrating thriller will shock your nerves and silence your senses.\nScore: 9 ½ / 10\n"},
{"review": "\nThe Silence of the Lambs is a fantastic movie with a very well\ndeveloped storyline and an outstanding cast. It is a pure thriller and\nlikely one of the best ever made, it doesn't just rely on being creepy,\nbut also on strong performances which I don't think thrillers do often\nenough. Jodie Foster and Anthony Hopkins's performances are absolutely\noutstanding, Foster is a very likable and believable police officer,\nand Anthony Hopkins completely becomes his character, Hannibal Lecter\ndidn't seem like an easy role to do, but he did it so naturally, with\nno hesitation. This film won five Academy Awards and is only the third\nfilm to win the Big Five, which it completely deserved, it isn't a\nmovie that you would expect to win Best Picture, but I am very happy it\ndid. Dramatic, terrifying at times and without a doubt, film gold, I\nwould recommend Silence of the Lambs to anyone looking for a good\nthriller or drama. <br><br>A young FBI agent must meet with a psychopathic serial killer in order\nto catch one who is still on the loose. <br><br>Best Performance: Anthony Hopkins\n"},
{"review": "\nArguably the best movie of all time. I understand that the Silence of\nthe Lambs gets a little discredited for being gory and at times\nhorrifying. I have never felt a rush more powerful and exhilarating\nthan when I watched this movie. I've seen it enough where I can now\nquote it line by line, but the very first time I saw the movie in its\nentirety, I was stunned. I was blown away. I continue to get that\nfeeling even now when I watch for the 25th time or so. As a whole, it\nis such a though provoking movie. Think of the plot of Se7en, the\nDeparted, Pulp Fiction, Inception - they all make you think and really\nunderstand the movie. To me, Silence of the Lambs does that better than\nany other film in history. Not to mention how great Jodie Foster as FBI\ntrainee Clarisse Starling and Anthony Hopkins as Dr. Hannibal\nLector/Hannibal the Cannibal. When you watch this movie, don't take it\nfor its goryness and horror. You have to take it for its deep meaning.\nThe moth, the biggest symbol of the movie, as Dr. Lector says\n\"represents change\". As Clarisse hunts down on serial killer Buffalo\nBill (Ted Levine - excellent job as well), Dr. Lector is enlisted to\nhelp her while his genius lies alone in prison. One for the ages. No\ndoubt about it. MUST WATCH&gt;\n"},
{"review": "\nThomas Harris's book has been reinvented for cinema. And its fantastic!<br><br>The film has everything a good thriller should have. A solid script,\nnerve racking tension, a relatable protagonist and fearfully clever\nantagonist. Anthony Hopkins (Hannibal) does A tremendous job at\nportraying his psychotic, menacing role, he truly is the star of the\nshow. Its even better than the film and needs to be seen by everyone!<br><br>This was just a brief revue about some of my basic impressions of the\nfilm, however i really do hope you have enjoyed this masterpiece as\nmuch as I have.<br><br>LOL LINES ARE FUN meowmeowmeowmeowmeow\n"},
{"review": "\nA tight-wound thriller, and sequel to Thomas Harris' 1981 novel Red\nDragon (though the movie Red Dragon came almost a decade later on this\nmovie's shoulders), this is quite simply one of the best novel to movie\nadaptations till date. It can be easily compared with great adaptations\nlike To Kill a Mocking Bird, One Flew Over Cuckoo's Nest, Lord of the\nRings Trilogy among others. <br><br>Coming to the characters, 'Hannibal' played so dexterously and\nchillingly by Anthony Hopkins still gives me the creeps, with good all\nround performances by others. Jodie Foster as an FBI trainee plays her\nrole to perfection in finding a serial killer with Hannibal's help.\n'Buffalo Bill' played by Ted Levine has also done great job in his\nportrayal as a psychopath killer whom the FBI is searching for.<br><br>The plot is simple yet the viewer simply can not escape the tension\nthroughout the movie. There are enough twists and turns to keep the\nviewer glued to the movie. You wait for Hannibal to come on screen in\nthe same way you wait for dinosaurs to come in the Jurassic Park. The\ndirection is impeccable and editing is spot on. The suspense is\nbrilliantly maintained and the sound track adds to the atmosphere.<br><br>No wonders this movie won all the major academy awards for the year\nincluding best actor to Anthony Hopkins.<br><br>If you have not watched this movie and even if you are not a fan of\nhorror or suspense movies, you are certainly missing one of the best\ncreations in the history of cinema. Go watch it!!\n"},
{"review": "\nit is an extraordinary thriller.i saw it quite a long time back and at\nonce loved it . since then i have revisited it almost around fifty\ntimes. what makes it even so good are the performances .everyone from\nJodie foster to Anthony Hopkins to Scott Glenn were too good .it is one\nof my fave thrillers , in fact i fell in love with thrillers after\nwatching the film. i was intrigued by the story the first time i watch\nit ,but it's been so many times i have revisited it and always found\nsomething new about the film . it's my fave thriller from 90's and one\nof my all time favorite thriller . the experience of watching the film\nwas enchanting and honestly even the performances by Jodie foster and\nAnthony Hopkins are reason enough to make it one's favorite . it's\nmesmerizing, enchanting , awesome. a masterpiece.\n"},
{"review": "\nBecause of The Silence of the Lambs comes some much needed\nidentification for the horror category. It is a first-rate production\nall around. It boasts a witty and dramatic script based on the Thomas\nHarris novel, full of great lines. It has marvelous direction from\nDemme. Demme creates suspense very well throughout and uses some great\ndirectorial shots such as the twin frames of Clarice ringing a doorbell\nand the FBI men breaking into a home. The two lead actors won Oscars\nfor their performances...each deserved. Foster is very good in her\nrole, but it is Anthony Hopkins that literally lights up the screen\nwith his complex portrayal of a complex serial killer. Hopkins does the\nseemingly impossible. He frightens you with his outrageousness and yet\nforbidden some pity/compassion(albeit not a lot) for his situation. He\nsays his lines with reservedness when needed and brashness when needed.\nThe rest of the cast is also quite good with Anthony Heald a standout\nas a unethical, petty doctor in charge of Hopkins. Of course the story\nof the other killer is very very chilling as well. A quality film in\nall aspects!\n"},
{"review": "\nOne of only a handful of films that successfully adapt a novel to the\nscreen. The movie manages to perfectly capture the thrilling atmosphere\nof the novel, and for that reason alone, is a strong film in its own\nright.<br><br>Anthony Hopkins as Hannibal Lecter is chilling right from his first\nshot. And despite having less than 30 minutes of screen time, his\ninfluence is felt throughout the entire film.<br><br>Jodie Foster is right at the same level. Not until the end did I notice\nher seamless transition from a submissive to dominant character. Her\nperformance shone through and carried the film.<br><br>The direction is spot on; tight and tense. There is a remarkable\nbuildup of suspense, particularly at one point towards the end that\nmade my heart race.<br><br>Perhaps the most amazing accomplishment is that every technical aspect\nmanaged to not stick out in an overt way. Instead, they all blended\nperfectly to create the right mood, which is what film is all about. I\ncannot recommend this film enough. You get well-crafted writing,\noutstanding performances, thrilling direction, and an all-together\nfeeling of terror.\n"},
{"review": "\nAnthony Hopkins is just wild in his Academy Award winning performance.\nI find it amazing that I was getting chills up my spine just from\nwatching him play Lecter. This is the best of his Lecter performances,\nas the other movies, Hannibal and Red Dragon lack storyline and he\nneeded a strong character like Jodie Foster who is incredible. Clarice\nis a vulnerable character that pulls off a believable FBI trainee. You\nbelieve she has the strength to do the job but are constantly concerned\nfor her safety. Jodie Foster is as always and incredible actor. The\nscenes with Foster and Hopkins are undeniably the strength of this\nmovie. Hopkins picks away at Foster's inner demons, forcing her to open\nup her troubling past. In exchange, he reveals more and more\ninformation on the identity of a notorious serial killer. Foster's\ndesperation does nothing to budge Hopkins from his request, and her\nvulnerability is more and more present as their scenes progress. They\nare both remarkable in this movie. A classic thriller of a movie that\nnever lets up on the suspense.\n"},
{"review": "\nAnthony Hopkins creates a character who is intelligent, calm,\ncalculating, charming and.....he enjoys eating people. (a slight\npersonalty flaw !!). This is a completely compelling man...who loves\nthe \"high arts\", is articulate ...is a Doctor...but beef ,pork ,\nchicken and lamb ..just don't \"do it\" for him. Dr Lecter needs that\npure unmistakable taste of homo sapien. The Lecter persona has become\nas big as any movie \"legendary character\".(we must remember--of\ncourse--he IS a monster !!) The movie does have a few flaws here and\nthere , but Silence of the Lambs is a really great psycho thriller.\nMade in 1991, it remains a landmark motion picture. Hopkins was born to\nplay Lecter....One feels almost hypnotized when those bright eyes are\nsparkling (or if he appears hungry).\n"},
{"review": "\nWhat separates this movie from other horror movies is, nowadays horror\nmovies have lots of gore and blood. But this one had scary dialog, and\nreal suspense. <br><br>Hannibal Lecter really got me! I mean he was described as a psychopath\nand he looked calm, then he showed us his true colors!<br><br>\"Buffalo Bill\" was crafty and crazy! The only thing he shows affection\nfor is his poodle \"Precious\" <br><br>Clarice Starling proved that she has what it takes to be a professional\nwhen she used her skills to track down the sadistic \"Buffalo Bill\".<br><br>For these reasons and more this movie will remain a suspenseful\nmasterpiece.\n"},
{"review": "\nThe Silence Of The Lambs is one of those movies that you don't ever\nwant to be finished. The story/plot is intriguing, involving,\ninteresting and makes you stay in the edge of your seat. The crazy\ncharacters are very believable and I was very afraid when Clarice was\ngoing to meet him for the first time.<br><br>Anthony Hopkins did a great job at portraying a nuts psychiatrist and\nsociopath. He did so well that I find it hard to imagine him as a\nnormal person outside the movie.<br><br>Ted Levine was as good as Hopkins at portraying another crazy man.\nAlso, he was very brave to play a \"transsexual\" man back in 1991 when\nnobody knew what it was about.<br><br>The creepy feelings we get throughout this movie are worth a watch in a\nrainy dawn, I surely recommend this to thriller lovers.\n"},
{"review": "\nI had read this book by Thomas Harris and thought it would make a great\nmovie but was concerned when I heard that Jonathan Demme was making it.\nHow wrong I was though and I was overwhelmingly surprised. It was the\nfirst film about a serial killer where it did not rely on strong\nelements of violence and gore but simply left it to the imagination.\nObviously Hopkins and Foster get all the plaudits and rightly so but\nthis is one of the only films that has so many superb minor characters\nsuch as Barney, Ardelia Mapp and Bill himself. I urge those who like\nthis movie to watch the making of documentary as it is truly\nfascinating. A roller-coaster ride of emotions and tension which I\nenjoy every time I watch it.\n"},
{"review": "\nThe financial success of the movie speaks for itself, with twists and\nturns giving deeper insight into one or more of the main characters.\nTwo truly evil, intelligent, and depraved characters are revealed along\nwith the difficulty catching and keeping them locked down in safe\nconditions. The richness of each character and displaying the\ncombination of skill and luck leading to identification and capture of\n\"Buffalo Bill\" is extraordinary.<br><br>Anthony Hopkins displays the highest level of acting skill, Ted Levine\nadds reality as Buffalo Bill, and Jodie Foster does a great job of\nleading the viewer through her character's life back and forth between\nthe FBI Academy's controlled environment and out in the unpredictable\nreal world dealing with psychopaths. The realistic performances by all\nof the supporting actors combines to keep the viewer glued to the\nscreen.\n"},
{"review": "\nFunny how I hadn't seen 'Silence Of The Lambs' ever since it was just\nfinishing it's theatrical run back in 1991. Hopkins, Foster and Demme\nhave gone on to do other things of course, but I recently caught this\nagain on DVD again, and man, this still has a lot of ability to scare\nyou out of your wits. Anthony Hopkins is just wild in his Academy Award\nwinning performance. I find it amazing that I was getting chills up my\nspine just from watching him play Lecter. This is the best of his\nLecter performances, as the other movies (that would be Hannibal and\nRed Dragon (though they were okay) lack the dramatical oomph so\nprevalent in this one. One wonders how on earth Hopkins could do this\nthen do something like a light comedy like Spotswood (which is exactly\nwhat he did). If you haven't seen this in a while, do yourself a favor.<br><br>Watch it again.\n"},
{"review": "\nThis movie is excellent. It is one of my favorites. My future career is\ngoing to be working as a C.S.I., and Criminalist and Parole Board\nmember. This movie has a lot things in it that are related to these\nthings.<br><br>The actors and actresses did a great job in this film, as did the\nfilmmakers and other crew members. I hate those two physcopath Dr.\nHannibal Lecter and Jame Gumb, a.k.a. Buffalo Bill who skins his\nvictims. These victims are young women who are a size 14. He also is a\nresemblance of Ted Bundy. That is he spots a woman ans puts his arm in\na cast pretending he's injured and needs help. When they help him he\nattacks. Great Movie!\n"},
{"review": "\nTo me, this is the epitome of movie making: A film that can make you\nfeel sorry for the characters, make you smirk at their quips, make you\ngasp in horror or revulsion, and hold you in its awe all in two hours.<br><br>There is a reason this film was given Best Picture (a departure for the\nAcademy); there is a reason Hannibal Lecter was given the honors for\ngreatest cinematic villain; there is a reason that among many, the film\nis considered to be better than the book its based on. It will do me no\ngood to tell you these reasons, just see the film.<br><br>Don't bother with the other two Hannibal films, although Red Dragon is\nmostly worth seeing.\n"},
{"review": "\nThis film is the Grandaddy of all suspense and thriller films of all\ntime!<br><br>This film has its moments but i really enjoyed it, and how buffalo bill\nskins his victims and wear them like decoration and ponce around like a\nwomen.That scene was sick but it was great.<br><br>Dr Lector's entrance to the film is really creepy, as Clarice\nprogresses down the prison hallway the camera exposes him standing in\nthe middle of the room silently as if he'd been waiting for an\neternity. When Dr.lector is caged and the 2 police officers bring him\nsome dinner and he escapes and when found by the police the 1 guard is\nopened up like he's on show, exposing all the major organs. <br><br>\"I can smell your c*nts\", that was a icky scene where he cums on her\nface, nice, but not for jodie foster i'd reckon.<br><br>This is a classic film with the most famous cannibal in cinema history.\nEnjoy!\n"},
{"review": "\nThough my dedication to this film sometimes freaks people out (I've\nbeen known to quote it at somewhat inopportune moments), I don't think\nit's anything to be ashamed of. This film is a brilliant,\ntightly-plotted masterpiece, a tour de force of masterful acting,\nabsorbing dialogue, and tempo and pacing that is at once highly tense\nand soothingly mesmerizing. The give-and-take between Starling and\nLector has an almost heartbeat-like rhythm, quiet and subtle yet\nextraordinarily powerful. I don't think it's inappropriate to say that\nthis film doesn't hit any truly false notes. The main reason that my\nfriends often won't watch this film is simply because it scares them\ntoo much -- which, I believe, is one of the film's greatest triumphs.\n"},
{"review": "\nThis is the best horror movie ever made for several reasons. While the\nstory is terrifying and grizzly, Demme never lets it become schlocky or\nsensational. He plays is straight, so to speak, never letting the plot\nbecome secondary. Perhaps a more... ambitious, director would have\nadded more creepy atmosphere (like David Fincher does with \"Se7en\"),\nbut Demme smartly keeps it real, which makes it all the more\nterrifying. Nothing that happens in this movie couldn't happen in real\nlife (and it does happen). This approach also harnesses the lead\nperformers. He never lets Foster get too melodramatic, and never lets\nHopkins become a flat Halloween mask. As frightening as the film is,\nthere is a moral core throughout that neither hides completely nor\nbrow-beats you. I have a bunch of videos and DVD's, but when almost any\nfriend comes over and looks them over, they always want to watch\n\"Silence of the Lambs.\" It's uncanny.\n"},
{"review": "\nClassic Psycho Drama which attacks the senses and plays mind games with\nwhomever watches it ! Anthony Hopkins(Hannibal Lechter) gives a Tour De\nForce performance as the ultimate misguided Psychiatrist from Hell,\nwhose ambitions vary from moment to psychotic moment. Lechter known for\nhis exceptional perception,is visited by Clarice Starling (Jodi\nFoster)a new recruit for the F.B.I., that needs to get Hannibal's\ninsight. Even though Hannibal is incarcerated for most of the movie,\nyou feel that he is in total control. Hannibal gives Clarice clues thru\nthe movie, to solve the \"Buffalo Bill\" case, and to help her advance\nher career and deal with her psychological problems. In effect he\nbecomes her psychiatrist behind bars, interesting. Watch for their\nthird meeting, where Hannibal's head seems to be floating on the\nreflective glass, really creepy ! Everyone in the movie , from her\nboss, Scott Glenn(Jack Crawford) to Jame Gumb(Buffalo Bill), is either\nseeking advancement or control of their own reality, amazing !!!<br><br>As Clarice gets closer to solving the case, Hannibal escapes, and then\nthings really get out of control !!!<br><br>Terrific ending in the home of \"Buffalo Bill\" will leave you on the\nedge of your seat !!! Great Directing by Jonathan Demme and OUTSTANDING\nEditing by Craig McCay, take you into the world of Starling and\nLechter, but will not let you totally escape from their presence, not a\nsafe movie !!! <br><br>There are a few flaws, as to how Lechter gets the pen, or how he knows\nwhere to phone Clarice, but they are minor.<br><br>Ted Levine should have gotten Academy Award for Best Supporting Actor,\nthis role could have typecast his career.<br><br>This movie should be viewed by Adults ONLY !!! I highly recommend\n\"Silence of the Lambs\", Winner of the TOP 5 Academy Awards, only 3rd\nmovie in history to do so !!!\n"},
{"review": "\n\nWhen I first saw this film, I was about 14, lying in my bed, watching\nit in German on TV late at night, with the lights on, and almost\nfalling asleep (probably actually dozing for a couple of minutes now\nand then). When I was waking up once, noticing Hannibal Lecter on my\ntelevision screen, looking at me with his alive, clear eyes and\nspeaking to me about screaming lambs, that was surely one of the most\nexciting moments in my movie-interested life. So it is definitely a\ngood idea to see this at night, with one's concentration wandering\naway.<br><br>Now I saw it again (at daylight!), and many other things struck me. The\ncharacter of Catherine Martin is actually really cool. The snobbish\ndaughter of a famous politician reacts to the terrible things that are\ndone to her in an unusually offensive way - it looks as if she was\nnever giving up.<br><br>And then did you notice how utterly serious this film is? There is not\na single funny scene in it. And this is really great! Which other\nfeature film today manages to be taken seriously by everybody and never\nbeing unintentionally funny although it does not have a single moment\nof irony? The humorous take-outs attached to the DVD version seem\nreally weird and out of place when you are in the mood this\nunbelievable film creates.\n\n"},
{"review": "\n\nWhen i first saw this movie i was about 13 years old,didn't catch it\nwell<br><br>then i saw it a couple of years later and it did an overwhelming\nimpression.I actually see it once in a while to remember,it urged me to\nsee the \"Hannibal\" to but the first one was a lot better.I would\nrecommend to everyone to see it,not to like it but just see it and make\nyour own opinion about this movie.There are a lot of movies that really\nsuck i would say this is not one of them.I liked Jodie Foster's\ncharacter, it's a bit simple but straight and MR. Hopkins did a great\njob in the movie as Dr. Lecter to.But it is only my opinion tho.Make\nYOUR opinion- SEE Dr. Hannibal Lecter IN ACTION :)\n\n"},
{"review": "\n\nThis is one of the all time great police thrillers. Anthony Hopkins\nportrayal of Hannibal Lecter is absolutely flawless and engrossing.\nIt's fast paced and relentless from the moment it begins. This movie is\nalso a first for having a female lead role. We get to see how Clarice\nStarling reacts in a \"mans\" world, which indeed the FBI and law\nenforcement in general were at the time of this films release. <br><br>My Recommendation<br><br>(*) - Must see in theater / Must own<br><br>( ) - Rental<br><br>( ) - Borrow it from the poor sap who paid for it<br><br>( ) - I wouldn't use this to prop up a wobbly chair\n\n"},
{"review": "\n\nWhen I first saw the trailer to this in the theaters, I was instantly\ninterested in it, so I read the book before it's release.  Although movies\nseldom live up to the respective novels in which their based, this one\nequals it, but in different ways.  I have to hand it to Ted Tally for his\nscript adaptation; his script keeps the core of the story while stripping\naway the more complex and unnecessary aspects of the novel and still makes\nit suspenseful and interesting.  The acting is magnificent, Foster plays\nClarice with what looks like such ease, and yet keeps the character complex,\nsmart, strong, and comfortably flawed, and aware of those flaws.  Hopkins is\nequally brilliant as Lecter: he is everything Clarice is but more charming\nand unaware he possesses any flaws at all.  One of the things I love about\nthe film is it's simplicity.  The sets and clothes look normal, unimportant,\neveryday, cheap.  Nothing's flashy or overly ornate looking.  It still holds\nup very well after 13 years.  Won Oscars for Best Actor, Actress, Adapted\nScreenplay, Director, and Picture.  Highly recommended.\n"},
{"review": "\n\nLector Quotes: \"People may say were in love.\"  Call it what you want, this\nfilm is a scary, crazy, sacred love story.  Clarice (Jodie Foster) has a\ndark past, much like Hannibal Lector (Anthony Hopkins) who has a hunger to\neat the flesh of human beings. There's a scene when Lector finnaly helps\nClarice to let go of her past, and as she's about to walk away he touches\nher finger. That touch has all of his emotions, love, anger, and the rest is\nall of the above. But that is what I mean by sacred, its weired but\nsacred.<br><br>THE PLOT<br><br>A vicious psycopath is murdering women throughout the midwest. Believing it\ntakes one to know one, the F.B.I. sends agent Clarice Starling (Foster) to\ninterview a prisoner who may provide clues to the killer's actions. That\nprisoner is Hannibal Lector (Hopkins), a brilliant, demented cannibal who\nagrees to help Starling only if she'll feed his morbid curiosity with\ndetails of her own complicated life. But as their relationship develops,\nStarling is forced to confront not only her own hidden demons, but also an\nevil so powerful that she may not have the strength to stop\nit.<br><br>Anthony Hopkins and Jodie Foster deliver sensational performances, and\nportray complicated and enigmatic characters. The only film that I\nremembered scaring me like this was \"Psycho\", and thats what we have to\ncompare this film to. \"Psycho\", \"The Exorcist\" and even the modern\nthrillers, like \"The Sixth Sense\" and \"Signs.\"<br><br>I love this film, I give it ****(out of 4 stars). \n"},
{"review": "\n\nThis is one fantastic movie. Anthony Hopkins plays the brilliant, all\nknowing, Dr. Hannibal Lecter who 'helps' in his one unique style(which\nbecomes clearer each time you see the movie), rookie FBI agent Clarice\nStarling track down 'Buffalo Bill', serial killer. Lecter, the genius that\nhe is, perceives Starlings inner demons and want to know more about her in\nexchange for information about the serial killer. His line: \"Quid pro quo,\nClarice. Quid pro quo. You tell me things, I tell you things\" is my (and\nmy\nwife's) favorite. Lecter engineers events and makes a daring escape which\nis\ngripping to watch. Hopkins portrayal of Lecter has been voted by AFI as\nthe\nthe number 1 villain of all time and deserves it all time. The film\ndeservedly won Oscars for best film, best director(Jonathan Demme) , best\nactor, best actress and best screenplay. The only other film to have won\nall\nfive top Oscars was 'It happened one night' (1934).\n"},
{"review": "\n\nImmeasurably superior to its disappointing sequel \"Hannibal,\" \"Silence of\nthe Lambs\" must surely rank as one of the absolute greatest thrillers of all\ntime. <br><br>Given the nature of the movie, there is surprisingly little graphic violence\ncontained in it. The story focuses instead on the complex psychological\nrelationship between FBI trainee Clarice Starling (Jodie Foster) and the\nimprisoned cannibalistic serial killer and ex-psychiatrist Dr. Hannibal\nLecter (Anthony Hopkins.) Both Foster and Hopkins are brilliant. Foster has\nthe larger role, and carries it off well, but Hopkins steals the movie with\na frighteningly realistic portrayal of a frightening serial killer. Lecter,\napproached by the FBI because they believe he might be of assistance in\nhelping identify a current serial killer known as \"Buffalo Bill,\" sees in\nthe FBI's interest an opportunity to escape imprisonment, and plays a series\nof mind games with Starling (and anyone else who wants to speak to him about\nthe case.)<br><br>Director Jonathon Demme effectively weaves two stories (the hunt for the\nserial killer, and the Starling-Lecter relationship) together into a taut\nthriller that will have you on the edge of your seat. And, in the end, has\nthere ever been a better, funnier and more thoroughly chilling line in any\nmovie than Lecter's closing comment to Clarice: \"I have to go now. I'm\nhaving an old friend for dinner.\"<br><br>I can't identify a single weakness in this movie. 10/10.\n"},
{"review": "\n\nFirst of all I have to say that \"The Silence of the Lambs\" is the film which\ninspired all the serial-killer films of the 90's (good ones like \"Se7en\" and\nsilly ones like \"Kiss the Girls\"). But \"The Silence of the Lambs\" has many\nthings the other thrillers don't have.<br><br>In this film we can see two of the best performances ever. Anthony Hopkins\nis just perfect as Hannibal Lecter, and so is Jodie Foster as Clarice\nStarling. The dialogues between these two characters are brilliant, and so\nis the whole screenplay.<br><br>The film has a great story which explores deeply the main characters. It is\nnot just a serial-killer story, but above all a deep dramatic\nthriller.<br><br>\"The Silence of the Lambs\" impressed me so much that I've watched it many\ntimes.<br><br>So if you hadn't watched it, take your time and see it.<br><br>Surely one of the best films ever made.<br><br>Rating: 10/10<br><br>I heard that Ridley Scott is about to direct the sequel of \"The Silence of\nthe Lambs\", with Sarah Michelle Gellar as Clarice Starling. Well... I truly\nlove Sarah and she's one of the greatest actresses of her generation. But we\nsee Clarice Starling as Jodie Foster and, you know, many people will compare\nSarah's acting with Jodie's.\n"},
{"review": "\nOne of the best films i have ever watched in my life ! I loved Jodie\nFoster as the young FBI cadet Clarice Starling and found Anthony\nHopkins to be the perfect match for the mysterious, intelligent and\nfrightening character of Hannibal ''The Cannibal'' Lecter. Their\nchemistry is undeniable. I continuously found myself captivated by the\nnever ending chase between Hannibal and Clarice. Through the horror one\nfinds the beauty that has always been of an interest and in my opinion\nwill continue to be, to us poor souls. Yet I wouldn't suggest this\nmovie for someone who although likes a bit of romance, is scared to\ndeath and tries to avoid horror films like the plague, as it contains\nquite scary parts. Hannibal Lecter is a very peculiar character which\nrequires equally brilliant watchers so as to fully appreciate his\nriveting and compelling beauty, motives and way of thinking.Quid pro\nquo fans.\n"},
{"review": "\nVery well directed with a heavy and ominous tone that shadows the\nentire movie. The sound and editing all function in creating and\nmaintaining the film's eerie atmosphere. Reviewing this film, how could\none not mention Anthony Hopkins chilling and creepy performance as Dr.\nHannibal Lecter. He portrays, without a doubt, one of the best\npsychotic characters in cinema history. He's so good that at one point,\nyou may start to, dare I say, root for him? The chemistry between\nHopkins and Jodie Foster's character is brilliant and the dialogue\nbetween them is masterfully crafted. Once you let Hannibal into your\nmind, you can never get him out. After watching The Silence of the\nLambs, I don't think I can ever forget it. Are you up for the\nchallenge?\n"},
{"review": "\nThis is not just the best horror or thriller or crime movie ever made,\nit is simply put the single best movie ever made in the opinion of this\nmovie lover.<br><br>The performances are amazing! Jodie Foster and Anthony Hopkins both\ndeserved to win the Academy Awards for Best Actor and Best Actress,\nthey were brilliant in their roles from the beginning of the movie\nright to the very end.<br><br>I recommend this movie for anyone (except for younger people, it is\ndefinitely not exactly an appropriate movie to show the kids - too much\ngore).<br><br>Love this movie!\n"},
{"review": "\nJonathan Demme's The Silence of the Lambs is one of cinema's greatest\npolitical thrillers of all time. The movie stars Jodie Foster as FBI\ntrainee Clarice Starling who tries to learn information about another\nserial killer from former psychiatrist Dr. Hannibal \"The Cannibal\"\nLecter (played perfectly by the great Anthony Hopkins.). Director\nJonathan Demme totally knew how he would execute this movie and he did\nit perfectly. Also the movie not only has great performances throughout\nbut it also has a great score from the magnificent Howard Shore.Also\nthe movie stays true to it's storyline. Based on a novel by Thomas\nHarris the movie ended up winning 5 Academy Awards because of it's\nHichcockian thriller style that was used for the film but in a\ndifferent way, and also for the Oscar level effort the great cast and\ncrew put forth. The Silence of the Lambs is an adrenaline shock to the\nsenses that will make your heart beat rapidly.\n"},
{"review": "\n\"The Silence of the Lambs\" is a movie in which a young FBI agent\nClarice Starling (Jodie Foster) tries to get some information from Dr.\nHannibal Lecter (Anthony Hopkins) who is a psychopath and used to be a\nrespected psychiatrist, for a psychopathic serial killer who skins his\nvictims. To get these information Clarice Starling has to gain the\nrespect and the trust of Dr.Hannibal Lecter.<br><br>When I saw this movie I thought that Anthony Hopkins is really not OK\nin his minds for real and that's because of his perfect interpretation.\nI also think that Jodie Foster made an also perfect interpretation.\nΤhese were seen and in the Academy Awards where Anthony Hopkins and\nJodie Foster won the Oscars for Best Actor in a Leading Role and for\nBest Actress in a Leading Role respectively. Jonathan Demme's work in\nthe direction of this film did not go unnoticed and he also won the\nOscar for Best Director.<br><br>\"The Silence of the Lambs\" is a movie that you have to see it, it's a\nreally good Thriller and Crime movie with many good scenes and an\nexceptional screenplay.\n"},
{"review": "\nthis film will always be known as one of the greats in the\nhorror/thriller genre for its dramatic posture when presenting such a\nrisky film. Anthony Hopkins performance was magnificent every word and\nevery turn he made. Jodie foster's character brought a real sense of\nbelief with her acting and also brought a real sense of fear towards\nthe films story. this movie was pure movie genius capturing pure\ntechnique towards the story and the acting. Jodie and Anthony should be\npraised for their wonderful performances as these two characters and\nalso by the way that they express the characters emotions towards the\nfilms story.<br><br>10/10\n"},
{"review": "\nI think Anthony Hopkins is one of the best actors ever, no one could\nhave played Hannibal the way he does, really not. The way he looks at\nher and talks to her, it's amazing. I also love Jodie Foster, she's not\nsome kind of barbie girl and I like that. She has a personality. It's\none of the best movies ever. It's honestly legendary. It's the best\npart of the trilogy, really. The others are kind of wanna bes, of\ncourse, Hannibal is amazing but it's not the same.<br><br>I love all of the actors and actresses. I had a blast watching it, it's\nso exciting, it scared me but in a good way. The first time you watch\nit, you never know what is going to happen, that is really awesome.\n"},
{"review": "\nOver 20 years after I first saw this film I have now decided to put\n'pen to paper' so to speak and praise what I think is one of the most\ngripping murder movies made, with a host of actors from Jodie Foster,\nScott Glenn,Anthony Heald, Ted Levine - who was a relative newcomer\nthen - and of course Anthony Hopkins firmly at the top of their game.\nEveryone knows the story by now of how Clarice Starling(Foster) has not\nyet passed-out of the FBIs famous academy at Quantico when and where\nshe is under the close supervision of one of its chiefs Jack\nCrawford(Glenn)and they are on the hunt for a serial-killer 'Buffalo\nBill'. They or perhaps SHE seeks the assistance of Dr.Hannibal Lekter,\na brilliant but disturbed criminal killer himself and she has intimate\ntalks with him in his cell to garner information she hopes will help\nfind 'Bill' before he kills more innocent young women in his most\nderanged and brutal way mutilating them. The only criticism I saw\nthroughout the film was the plausibility of the situation Foster finds\nherself in towards the very end and whether that would be possible? I\ndon't know - I 'm NOT in the FBI and having read the 'Trivia' I think\nthis has been explained. Other than that, a brilliant film that just\nkeeps delivering and when I saw it recently on Spanish TV for about the\n5th time it was just as good as when I first saw it and there are very\nfew films that you can say THAT about!\n"},
{"review": "\nI was about 12 the first time I saw this movie. I was at home with my\nolder sister and it creeped me out. I remember she had to explain some\nof the scenes to me as I was only 12 and maybe a little young to watch\nit (but our parents always let us watch movies that as an adult looking\nback now, am shocked they did). Love the \"feel\" of this movie - dark,\ndingy and cold. Anthony Hopkins is amazing. Very chilling, but you\ncan't help but like him. Watching this as an adult still gives me the\ncreeps. Its a way better alternative at this time of year than a horror\nmovie. The sequels are OK-only worth watching because of Hopkins. But\nthis is a classic.\n"},
{"review": "\nIt is one great film. No question about it.The Silence Of Lambs is rare\nAmerican thriller film that blends elements of the crime and horror\ngenre that is based on the novel of the same name by Thomas Harris, his\nsecond to feature Dr. Hannibal Lecter, a brilliant psychiatrist and\ncannibalistic serial killer after The Red Dragon. The movie stars Jodie\nFoster, Anthony Hopkins, Ted Levine and Scott Glenn. It was directed by\nJonathan Demme,who won an Academy Award for this film.<br><br>The story of the film centers on Clarice Starling,played by Foster in\nan Oscar winning performance.She is a young FBI trainee that seeks the\nadvice of the imprisoned Dr. Lecter,played by Hopkins in his Oscar\nwinning performance as well just like Foster, to help apprehend another\nserial killer, known only as \"Buffalo Bill\".<br><br>The movie was smart especially in the intellectual tug-of-war between\nSterling and Lecter.The Award winning performances truly made it\ncredible and suspenseful.At the same time,the story was full of horror\nthat will thrill the viewer to the edge of their seats. <br><br>What makes Silence rise above the other movies of the same genre was\nits smart story as well as the movie's ability to put the viewer into\nthe psychological inner workings of the minds of both Sterling and\nLecter during their meetings.This is what makes is one of the best\nfilms ever made not only in the year but also during its decade of its\nrelease as well.\n"},
{"review": "\nIn simple language the movie is truly remarkable. The direction of the\nmovie is simply awesome and I loved the screenplay as well. The\nconversations between Starling and Hannibal Lekter are shot so well and\ndialogs are written so fine that even though the character of Hannibal\ndon't appear much but still its the one that you'll never forget. Even\nthe character of Buffalo Bill is very much creepy but Lekter wins for\nme. Anthony Hopkins as Hannibal has delivered a stunning performance.\nJodie Foster has also done a good job. The psycho-thriller theme is\nwell established throughout the movie. Its creepy in a sense. The movie\nis nearly perfect in every aspect. Even the background score settles\nwell enhancing the environment. Its one of the movie you won't forget.\nThough the character was introduced first in manhunter, its now that it\nmarks its true nature. I would really recommend it to all.\n"},
{"review": "\nIt's hard to believe this film is twenty years old, having seen it when\nit first came out and not again till now. The movie lived up to it's\nopening hype as a masterful thriller bordering on horror. Anthony\nHopkins' portrayal of serial killer Hannibal Lecter defines the story,\nbut when all is said and done, his character doesn't appear in the\npicture very much at all. However when he does, one's attention is\nriveted to the screen, attempting to outguess director Jonathan Demme's\nnext move in a deadly cat and mouse game between Lecter and his\nadversary, be it FBI Agent Clarice Starling (Jodie Foster), or hapless\nsecurity guards caught unaware by a scheming mad man.<br><br>The larger plot involves the chase after a serial killer known as\nBuffalo Bill, named after a penchant for skinning his female victims\nafter he murders them. To say that the picture has it's grisly moments\nwould be an understatement. There are more than one scene that require\ncaution for the faint hearted, visualizing grim aspects of brutality\nthat don't leave much to the imagination. Buffalo Bill himself (Ted\nLevine) is an inspired piece of work, a monster that could have stood\nalone as a title character if not part of this larger story.<br><br>Without giving it away entirely, I have to say that the hunt for\nBuffalo Bill gives rise to a clever gimmick that will catch you off\nguard for a moment, only to redirect itself very quickly to it's\nsuspenseful conclusion. This one's recommended for fans of\npsychological thrillers who'll try to guess the ending only to be set\nup for one more neat twist at the finale. Anyone for a glass of\nChianti?\n"},
{"review": "\nJonathan Demme's 'The Silence Of The Lambs' is an amazing film in all\nrespects. Undoubtedly, 1991's finest film. Based on the novel by the\nsame name by Thomas Harris, here is a film that stands out it's feet\nwith flourish. <br><br>'The Silence Of The Lambs' is a gripping tale, there is hardly a moment\nwhen you feel bored. I don't wanna say anything about the brilliant\ntwists and turns it takes, cause for those who haven't seen this\nmasterstroke, will give-away it's excitement. It's a great film,\nDemme's direction is Exemplary. Ted Tally's screenplay is magical, just\nstunning. Tak Fujimoto's camera-work is superb. <br><br>In the acting department, Hopkins stands out as Dr. Hannibal Lecter.\nThis is his finest work to date, in fact, it's amongst the best\nperformances by an Actor ever! Jodie Foster is outstanding, as\nexpected. Playing Clarice Starling with remarkable ease. Ted Levine\ncauses terror and hatred as \"Buffalo Bill'. Others are perfect in their\nparts. <br><br>'The Silence Of The Lambs' is amongst the best movies ever made! It's\nastounding history with the Academy Awards is a legend itself... do I\nneed to say anything else? Watch this right now!\n"},
{"review": "\nLooking back at the 90's,some of the best films I saw in that era were\nvery dark and sinister films that tapped into our fear factor and while\ncompelling us also terrified us.Silence Of The Lambs and Se7en were\nboth mainstream pictures that held aloft a very bleak vision but\nmanaged to garner massive public appeal as well as critical\nacclaim.Lambs will be best remembered for the scintillating performance\nprovided by Anthony Hopkins but there really is a lot more to it than\nthat.The film is alive with evil,it is a sinister and deeply disturbing\nfilm that gets under the skin, quite literally, and keeps the tension\nwound tight until the final act.Jodie Foster is brilliant as Clarice\nStarling displaying vulnerability and balls in equal measure, the\nfollow up film should have never been made without her.Director\nJonathan Demme didn't go on to make a film anywhere near as compelling\nas this,sure the film is driven by Hopkins' performance but Demme also\ngets the best out of Ted Levine and Foster as well managing to maintain\nthe tension to tremendous effect throughout.In summary Silence Of The\nLambs is a brilliant book to film adaptation that encapsulates\neverything that was great about the book and builds upon it. 10/10\n"},
{"review": "\nI love this movie. The writing is as close to the book except for one\nplace but the film did not butcher the book. The characters were\nbrilliant, I read the book and it's prequel and Foster is Clarice and\nHopkins is Lecter. Hopkins just emanated evil but in such a classy\nrespectable way.<br><br>I wouldn't suggest this movie to someone without a stomach. some of the\nscenes are fairly gruesome and it has one scene with Dr Chilton where\nhe shows Clarice a picture explaining how Lecter injured someone. Heck\nthat even made me shiver.<br><br>It deserved its Oscars and it will have a lasting shiver effect on\npopular culture for all time.\n"},
{"review": "\nThis movie was amazing. The dialogue was witty, clever and sometimes\nchilling. The directing was beautiful and the acting was absolutely\nsuperb. Jodie Foster was great as the the FBI agent Clarice Starling\nwho is on the trail of a serial killer. Foster was good but the star is\nof course the magnificent Anthony Hopkins who steels the show with his\nrolling eyes and taunting voice. Both actors deserved the Oscars\nawarded to them. So did the director Jonathon Demme. The story was\ngreat, the only clique was with the ending that has always bugged me.\nThe movie is an intelligent chilling thriller and there was this great\nbuild up to something that didn't meet the audience's expectations.\nBesides that everything about this movie was perfect. Highly\nrecommended.\n"},
{"review": "\n\"The Silence of the Lambs\" follows young FBI agent Clarice Starling as\nshe attempts to track a serial killer nicknamed \"Buffalo Bill\". During\nher investigation, she solicits assistance from a psychotic yet\nintelligent cannibal named Hannibal Lecter.<br><br>Jodie Foster provides a strong performance as the neophyte agent\nClarice Starling, who is eager to prove herself yet haunted by her\npast. Anothony Hopkins gives a nuanced, refined and haunting\nperformance as the unforgettable cannibal Hannibal Lecter. Anthony\nHeald proves the perfect person to play an imperious minor official as\nDr. Frederick Chilton. Scott Glenn is also notable as Starling's\nsuperior in the FBI.<br><br>The crime story developed is excellent and remains interesting through\nits various turns as it chronicles the investigative process of agent\nStarling. One of the keys to this film's success is the well-written\ndialogue between Starling and Lecter, which is like a game of chess\nbecause of Leceter's manipulative tactics. The film is also effective\nas a thriller, as it builds up a lot of tension throughout its\nduration.\n"},
{"review": "\nSilence of the Lambs is a horror/thriller film most notable for its\ncharacter of Hannibal Lector a cannibalistic psychopath played by\nAnthony Hopkins. Jodie Foster is one of my favorite actresses and she\nseems a little too vulnerable here to be an FBI agent. Anthony Hopkins,\nsurely one of the world's greatest actors, is suitably creepy as\npsychopathic Dr. Lector, however, I prefer his performance in Magic;\nhis role is much larger in that movie and he does more acting. Jonathan\nDemme, also one of my favorite directors, does a good job but, once\nagain, I prefer his Married to the Mob (1988) or Harold and Melvin\n(1980) over this film. Howard Shore's musical score is terrific. As far\nas violence goes, Silence of the Lambs might have been shocking when it\nwas release but, by today's standards, it is tame. There are no\nlingering closeups of violence. The CSI TV series shows much more\ngraphic images. I see why this film won Academy Awards, mainly because\nthe competition was not that stiff. Although it's a good film, it does\nnot deserve the high status that is has been accorded. But it is still\nwell worth seeing because of the tension it manages to build and for\nthe terrific performances of Hopkins and Foster.\n"},
{"review": "\nI had never seen Silence of the Lambs and decided to pick up the book\nby Thomas Harris recently. I was thrilled by the book and I read the\nentire thing in about a week. I then hungered to see the award winning\nmovie that I'd heard so much about. I wasn't disappointed at all. The\ncinematography is awesome, Foster and Hopkins turn in A+++ performances\nand the story contains the book's intricacies while moving at a pace\nfast enough to satisfy. The only detail left out of the movie that was\nin the book was that of Crawford's wife's death and ongoing sickness. I\nthink this really made Crawford seem rather one dimensional in Silence\nof the Lambs and takes a lot away from his character in the book. My\ngirlfriend had only seen the movie and she described him as a bit of a\nsleaze which shocked me because he is such a genuine and honestly good\nman in the book that is simply in the middle of a massive internal\nconflict. However, this does not really detract from the movie at all,\nI simply felt that Crawford was an underdone character but understand\nthe need to simplify him. I suggest reading the book before seeing the\nmovie. Bon appetite.\n"},
{"review": "\nI never really got off on this film until first saw it whilst on\nholiday in a hotel in New York. I didn't get off on it at first but\nthen my parents bought it on DVD. I saw it again and I just couldn't\ntake my mind off it! <br><br>Hopkins is delicious as Hannibal Lector with his amazing acting and\nbrilliantly menacing speeches. You can't help that there is a monster\njust waiting to appear from Hopkins. I just couldn't help laughing with\namazement. However, one of the biggest breakthroughs of the movie is\nprobably Ted Levine as Jame Gumb (Buffalo Bill), playing the main\npsychotic serial killer. He has a way of playing the part that you is\nso mad that it is excellent.<br><br>Despite this, I don't really understand or believe the stories of\npeople fainting in the cinema at the film's release in 1991. It is a\nhorror, yes, but not a film worth having a nervous breakdown. Even so,\nit is and excellent piece of acting and film making, a great way to\nstart the 90's; 10/10!\n"},
{"review": "\nIn my opinion, THE SILENCE OF THE LAMBS has excellent performances by\nAnthony (Hopkins) and Jodie (Foster). I thought that Clarice (Jodie\nFoster) looked very pretty in all the dressy clothing she wore,\nespecially the dressy outfits she wore when she visited Dr. Lecter\n(Anthony Hopkins) in jail. This film didn't scare me at all. Well,\nmaybe just a little. Dr. Lecter scared me a little when he attacked the\ntwo cops in his cell. There was only one thing that really grossed me\nout, and that was the killer (Ted Levine) shoving an insect down each\nvictim's throat and then skinning them. That was really disgusting in\nmy opinion. Also, when I noticed that Buffalo Bill had a pierced\nnipple, I got really uncomfortable, but I still enjoyed the movie. To\nwrap this up, I'd like to say, \"Parents, if you have young children, do\nnot let them see THE SILENCE OF THE LAMBS. They will have nightmares.\"\n"},
{"review": "\n\"The Silence of the Lambs\" is a modern day classic for a number of\nreasons. It features Dr. Hannibal Lector, bringing Anthony Hopkins a\nwell deserved Oscar, a pshycotic cannibal behind bars with a brilliant\nmind. Clarice Starling, a definitive female hero that feeds Lector\nmemories of her chilling childhood, who makes it cool for women to kick\nbutt. And Jack Crawford the FBI Behavioral Sciences Director who\nencourages Clarice as she investigates the serial murderer Buffalo\nBill.<br><br>Usually when one who doesn't truly appreciate the beauty of a film,\nsees \"The Silence of the Lambs\" as a crime movie with a nude dance\nscene, a man eating another man's face, Miggs, the Death Heads Moth,\nand a the hockey mask of Hannibal Lector. But I truly appreciate the\nchemistry between Jodie Foster and Anthony Hopkins in this film. The\nperformances of these two brings what could be mistaken for a budding\nrelationship. <br><br>In their final scene before Dr. Lector's break out, the chemistry is\nclearly evident there. The close up shots of their faces would be\nslightly annoying in another movie, but these shots show the anguish\nand anxiety of Clarice Starling and the cunning and brilliance of Dr.\nLector. As Dr. Lector questions Clarice of the lambs, her mental\nanguish is forced and she must relive memories of the murder of her\nfather, the town marshal, which could help fuel her search of Buffalo\nBill. As Lector educates Clarice on coveting, his face transforms into\na slightly evil glare that shows the brilliance and evil coinciding in\nDr. Lector's mind. This scene is my absolute favorite because of the\npast of Starling is revealed. In this scene we see the true evil of Dr.\nLector begin to form and show in the movie.<br><br>The chemistry is brilliant and perfect. The only other on screen\nchemistry that could even compare to this would be that of Frankie Dunn\nand Maggie Fitzgerald, portrayed by Clint Eastwood and Hilary Swank, in\n\"Million Dollar Baby.\"\n"},
{"review": "\nSilence of the Lambs is the best thriller ever made, and one of the\nbest films. Anthoney Hopkins gives what may be the best performance\never by a leading man. Jodie Foster is not quite as perfect as Hopkins,\nbut is still Oscar worthy, in her best performance. Jonathan Demme is\none of the best directors alive, and this is his best film, the\ndirection is near perfect. The screenplay is wonderful, the dialogue\nbest. An amazing film in almost all perspectives, something extremely\nrare for a film of the 90's.<br><br>If you enjoyed Silence of the Lambs you might also like In the Line of\nFire.\n"},
{"review": "\nEvery once in a while, a film is released which revives its dead genre.\nIn the early '90s, for the horror/thriller genre, The Silence of the\nLambs was that film. After a tribe of awful horror flicks (e.g. 1988's\nChild's Play) with recycled story lines like serial killers hunting\ndumb teens, The Silence of the Lambs took the serial killer movie to a\nnew level.<br><br>The Silence of the Lambs swept the 1991 Academy Awards, becoming only\nthe third film in history - after 1934's It Happened One Night and\n1975's One Flew Over the Cuckoo's Nest - to win all five major\ncategories (Best Picture, Director, Actor, Actress and Screenplay), and\nthe first horror movie to win Best Picture. This is a tremendous\nachievement when it was released more than 12 months before,\nconsidering the Academy's notoriously short attention span. Each award\nwas well deserved, with Best Director Jonathan Demme both marvellously\npulling off the most gripping scenes and never losing sight of the\nhuman element of the picture, Best Actor Anthony Hopkins and Best\nActress Jodie Foster both delivering unforgettable performances as the\ndangerously intelligent cannibal serial killer Dr. Hannibal Lecter and\nthe less-than-perfect but strong willed rookie FBI Agent Clarice\nStarling, and Ted Tally's Best Adapted Screenplay both delivering\nsnappy, quotable dialogue (\"Oh, and Senator, one more thing: LOVE your\nsuit!\") and perfectly tapping into the mind of a serial killer.<br><br>This is the horror film that they all want to be, but almost all of\nthem won't. I've only ever seen one other that is in quite the same\nleague as this, and that is The Sixth Sense (M. Night Shyamalan must\nhave watched TSOTL about 12 times while making that film). This\ngroundbreaking masterpiece of horror is the standard by which all other\nhorror movies are measured, and it is indeed the film that for which\nHopkins, Foster and Demme will all be remembered. <br><br>10/10.\n"},
{"review": "\nI found this film extremely scary and haunting, even though the actual\nviolence wasn't overpowering by today's standards. In some ways, the\nsuspense and the build-up to scenes is quite \"old school\" and proves\nthat this approach still works. There are has been a lot of analysis\nwhy this film is so powerful. One talks about how Hannibal Lecter only\nappears for a very brief time in the movie, yet others talk about him\nand build him up, how some of the set pieces refer to our deep\npsychological fears...in the end, it works well, and I would highly\nrecommend it. I have read critics who say that the killer Clarice is\npursuing is too stereotypical, or simplistic. I would beg to differ: I\nfind that that character too is quite scary, though doesn't have the\nthree-dimensional nature of Hannibal Lecter. And what of Clarice? she\nis brave, and even though it was made in the 90s, I think this film is\nstill one of the first I saw with a woman as lead detective. Full marks\nto the script, and the book of course, because Clarice is quite\nfallible, not perfect, and this makes the story more real and\nunsettling. We're fighting in her corner, as it were, but we're not\nsure if she will win, unlike other male-dominated movies. And one\npersonal quirk: watch out for Tom Petty's song, \"American Girl\", I\nfound the usage interesting, fun and ironic, and the song has stuck in\nmy head post the movie.\n"},
{"review": "\nI first saw \"Silence of The Lambs\" soon after it was released, as a\nschoolboy. It was one of the first \"mature\" films I saw and to this day\nthe movie is kind of a benchmark against which I measure films. The\ncreepy feeling it leave you without trying any of the cheap tricks\n(sudden loud noises, shots of copious amounts of blood ) that other\nthrillers do. I saw it years later in 2005 and still loved it.<br><br>The movie's strong point is Jodie Foster and Anthiny Hopkins' acting\nskills ,again the benchmark against which I measure acting. The two\nmake a great team and that was missing in the sequel \"Hannibal\".<br><br>This is a movie of many skins its a thriller, a detective movie, a\nhorror movie an entertainer and it deals with the nature of the human\npsyche too. Not an easy feat to be so many things at once but the\ndirector and cast pull it off.<br><br>Certainly one of the best movies ever made.\n"},
{"review": "\nThis film is shown almost on a daily basis on TV and I never had the\nchance to finally see the ending of this picture. Jodie Foster,(Clarice\nStarling),\"Sommersby\",'93, was an FBI Agent who had great insight into\na killer's mind and also had some very dark secrets about Lambs which\nseemed to drive her crazy. Clarice had a difficult assignment from the\nFBI to look into the brain of Anthony Hopkins,(Dr. Hannibal\nLecter),\"The Human Stain\",'03, who was a mental patient and had some\nvery valuable information the FBI needed in order to capture a horrible\nkiller. The acting by Jodie Foster and Anthony Hopkins were outstanding\nin making this a 'Thrill-A- Diller' of a film story.\n"},
{"review": "\nThe Silence of the Lambs is one of the most frightening yet intense and\nintelligent films from the early nineties. The casting of Sir Anthony\nHopkins as the evil Dr. Hannibal Lector was a perfect choice and he won\nan Academy Award for his 16 minutes of airtime. Jodie Foster deserved\nher second Academy Award for Best Leading Actress in this film. Jodie's\nClarice Starling is perhaps one of the best female heroine roles of all\ntime. I enjoyed watching this film again on AMC with tidbits of\ninformation on the bottom of the screen about the film-making. I would\nhave like to have seen more Diane Baker on screen. I would have like to\nhave known more about Dr. Lector's past too. The film always packs a\npunch when you least expect it at the end of the film. Besides great\nacting, directing, and writing, there is something unforgettable about\nthis film. You walk away wondering about why this happens and about the\nmonsters inside of them.\n"},
{"review": "\n\nSilence of the Lambs is a film that will always be memorable because of 2\nthings (in my mind)- 1, Hopkins brilliantly mixed type of Socrates meets\nDawn of the Dead zombie charicature and 2, an argument will go on like who\nwas the better Darren on Bewitched, Jodie Foster playing Clarice Starling\n(and version of herself in 10 years Julianne Moore).  I feel that Jodie\nFoster is very good here as a FBI agent who has to get in the mind of Dr.\nLecter (Faba beans and all) to find a killer.  Story latter patterned out in\nThe Cell, which while that was better, this film is a tad better than the\nsequel by having you sqeam in your seat while getting memorable catch\nphrases and (dare I say) laughs.  A little note (and not too\nuncoincidentally)- Dead Director George A. Romero appears briefly as a\nMemphis agent.  A\n"},
{"review": "\nI have seen some great movies, old or new. The Silence of the Lambs is\nan amazing one, while not my personal favourite of the year of 1991 it\nwas a well deserved Best Picture win in my opinion.<br><br>Jonathan Demme's direction is superb, the film is shot in a ceaselessly\natmospheric manner and Demme never lets the suspense drop. The story\nfrom start to finish is enthralling, and the script is tense and\nthought-provoking.<br><br>The Silence of the Lambs is wonderfully acted as well. Jodie Foster is\nthe one who holds the film together and her performance here is one of\nher most excellent, and I mustn't forget Ted Levine who is very\nchillingly effective as Buffolo Bill. Anthony Hopkins however steals\nthe film, it is his perhaps most iconic character and he proves that\nalthough he is in only a portion of the film his performance lives long\nin the memory.<br><br>All in all, amazing. 10/10 Bethany Cox\n"},
{"review": "\n'The Silence of The Lambs' is a great example of how powerful a film\ncan be when the director, writer, actors, cinematographers and the rest\nof the crew put their best into something. No one associated with the\nmovie thought that it would win so many awards. The intention was to\nbring Thomas Harris's excellent chiller on screen. Ted Tally's\nscreenplay is terrific as it forms a structured outline and sets a\ngloomy tone. Moreover the dialogues are scintillating. Demme's\nstupendous direction is what makes this meticulously crafted thriller\none of a kind. The suspense is well built and the Demme carefully peels\nthe layer relying on subtle cues and conspicuous symbolism. For\nexample, the prison really manages to create that claustrophobic feel.<br><br>'The Silence of The Lambs' is one of the very few thrillers where\neverything works. The cinematography deserves special mention. The\nfastidious closeups, long shots and the actors talking to the camera\nare formidable. The score contributes to the chilling glum atmosphere<br><br>The acting by the main cast is splendiferous. In spite of his small\nscreen time, Anthony Hopkins has a very dominating presence and it is\nno unknown fact that his Hannibal Lecter remains one of the most\nmemorable characters on screen. Jodie Foster is sublime. In a way, her\nClarice Starling created the new movie prototype of a female FBI, a\ntrend that was followed by many actresses (notably Gillian Andersen in\n'X-Files'). I loved her spontaneous and natural reactions to Hannibal\nLecter's remarks in the prison scenes. The eerie sequences between\nFoster and Hopkins are among the highlights and the conversations in\nthose scenes are morbidly amusing. Ted Levine is frightening. Scott\nGlenn and Anthony Heald are competent.<br><br>'The Silence of The Lambs' is one of the most finely crafted films of\nits genre. It's definitely stood the test of time and it's one that\ndoesn't get dull with repeated viewing. It's a classic.\n"},
{"review": "\nBefore I saw this movie Star Wars was my favorite film. I don't know if\nmy tastes suddenly matured or what but when I walked out of the theater\nafter seeing this movie for the first time I knew that Luke Skywalker\nand the gang had been trumped.<br><br>Anthony Hopkins was superb as Hannibal Lecter. I have never seen anyone\nin all the years I have been watching movies seen an actor portray\nintelligent insanity any better. I couldn't keep my eyes off the\nscreen. Many times when I go to movies I sometimes think of other\nthings that are related to the movie or not. In this film that did not\nhappen and it was due mostly to the performance of Hopkins. I was\nthrilled that the film won the Academy Award for that year. I thought\nthe rest of the cast was great to. Jodie Foster is good in anything\nthat she chooses to take on and the casting was perfect for Buffalo\nBill. Ted Levine really fit that freaky hick part so well.<br><br>I thought the pacing of the movie was great to along with the\ncinematography which added to the suspense a great deal. Awesome\ndirection and execution throughout the whole movie. I would consider\nthis movie to be a must see for everyone interested in the thriller or\npsychological genres.\n"},
{"review": "\n\"Silence of the lambs\" is one of the masterpieces of the last decade.\nAnd does it have its reasons. First of all, it's entirely dependant on\nthe terror that gnaws all the way to the mind of the viewer. The\ndecline of the Human Being is magnificently chiseled with one liners\nthat amusingly depict the killers and psychopaths state of mind and\napproach us carefully into a nature that is deformed, evil and sick of\nthe Man's putrefaction.<br><br>The main spectacle is drawn between Jodie Foster and Anthony Hopkins.\nBoth entirely relevant to the movie, they produce a bright contrast and\nwith their performances they nail the feelings right and expose one of\nthe best duels on movie history. This duel, although, is not\nconventional. Clarice Starling (Foster) will use Hannibal Lecter's\n(Hopkins) profound knowledge of the criminal mind to capture the\ninfamous Buffalo Bill. But Hopkins will play a game in which their\npersonalities will engage in a retroactive combination, in a \"quid pro\nquo\" mind spar: she will have to expose her most profound, hidden\nsecrets to Lecter, so he can also dispatch on his pleasure of analyzing\nthe suffering of others. Both of them reveal all of their character's\nwhole personality with their eyes: Foster is in constant pressure,\nscared but facing the natural Hades with courage and Hopkins shows\nhuman emptiness in his eyes, windows to what is a world full of\ndepravations.<br><br>Ted Levine is truly scary. You get the impression that he is the true\nBuffalo Bill, twisted and perverse. He shows absolutely no human,\nrecognizable aspect. He is a terrible villain.<br><br>The movie will straightly envelop you in an obscure labyrinth where the\nhuman mind is retorted and rotten, with a depressing score and settings\nthat are grey, murky and never joyful. One has to see it to get a close\napproach on the dark side of the mind it or at least, to make their\nspirit shake and tremble.\n"},
{"review": "\nIt seems as though there is a serial killer out there who's grabbed the\ndaughter of a United States Senator and this guy has zoomed right to\nthe top of FBI's Most wanted. This man's modus operandi is to keep the\nvictims alive for a while before killing them so they're racing against\ntime to find him. Desperate situations call for desperate measures.<br><br>The desperate measure is, you want to catch a serial killer, bring in\none as a consultant. That's why FBI trainee Jodie Foster goes to visit\nAnthony Hopkins in prison. Hopkins is not just a killer who eats his\nvictims, he's a brilliant psychologist himself with insights maybe no\none else has.<br><br>Of course his price are some cheap insights into Jodie Foster's soul,\nthrills he probably got when he was in practice.<br><br>The Silence of the Lambs in less capable hands could have just been\nanother cheap slasher flick. Instead the leads who walked off with the\nAcademy Awards for Best Actor and Best Actress give riveting\nperformances of a sick twisted psycho and a woman who became the\nbiggest feminist icon since Sigourney Weaver by confronting some demons\nof her own. It's the best work that Anthony Hopkins and Jodie Foster\nhave ever done and let's not forget the Oscars won by Director Jonathan\nDemme and the Picture itself for being the Best in 1991.<br><br>A couple of players who made their marks on television later on also\nscore well here. Anthony Heald who was Buffy the Vampire Slayer's\nhandler plays the psychiatrist in the institute where Hopkins is\nincarcerated and who Hopkins makes a fool of and says at the end he's\nfar from done with. Also Ted Levine who is Captain Stottlemeyer on Monk\nplays the serial killer the FBI is trying to catch. Also look for a\ngood performance by Brooke Smith as Levine's potential victim.<br><br>The Silence of the Lambs with its taut direction and riveting\nperformances has an appeal far beyond the horror genre. See it and\nyou'll know what I mean.\n"},
{"review": "\nSPOILERS<br><br>The Silence of the Lambs is the best movie ever created. It is based on\nthe book Silence of the Lambs and is about a FBI trainee seeking help\nfrom a cannibal to try to catch a man who skins his victims. This is a\nhorror film that won the top 5 Oscars. The acting of Anthony Hopkins,\nJodie Foster, and Ted Levine is superb. Howard Shore's music is great,\nand the cage scene and killing of the 2 officers is one of the best\ndeaths I've ever seen on film. Starling does get Buffalo Bill in a\nterrifying night-vision scene. Overall , this is my favorite film of\nall time and is a must-see for horror fans.<br><br>10/10!\n"},
{"review": "\nI think there is not much to say, all who like thrillers know this one.\nThis is just so brilliant movie, Brilliant Thriller, more of the mind\nthan action. With spot on cast for this kind of movie, especially the\nchemistry between Anthony Hopkins and Jodie Foster is great. And Jodie\nFoster was perfect choise in her role,as she is known to be very\nclever/genius and gifted, and was known this in her childhood.<br><br>Very good example how good movie can be made around few things, if\npeople doing it are the right one. Last line is of course for great\nDirector who made this all possible.<br><br>I hope there would be more like this, but todays lines in Hollywood is\nnot giving much a chance for that , its a shame.\n"},
{"review": "\nWhat can I say about \"The Silence of the Lambs?\" Besides the fact that\nit's one of the greatest mystery films, great actors, and a great\nstoryline . . . . go and see it if you haven't.<br><br>Clarise Starling and Hannibal Lector make a great pair in the movie.\nAlthough some parts aren't for kids (as in Buffalo Bill and some\nblood), it's a good movie to see if you're home by yourself if you want\nto watch a mystery combined with adventure. Not many police films are\ngood to see, but this one wouldn't make you waste $10 or something like\nthat. Recommended to anyone who likes police/mystery films, Jodie\nFoster, and Anthony Hopkins.\n"},
{"review": "\nThe young FBI agent Clarice went to visit the in-jail horrible killer\nHannibal in order to solve the series-killer-case. Clarice was afraid\nof him. She also had the psychological problem that haunted her from\nthe childhood. Although Hannibal treated her with consideration, what\nhe had done was so cruel that nobody could imagine. The strange\nchemistry reaction happened between them since their first meeting.<br><br>Hannibal's action embodied the complexity of humanity. He was gentle to\nClarice. However he was so brutal to the other people. You cannot\nbelieve that was done by the same person. Sometimes we do know little\nabout ourselves.<br><br>It was rare to see that a movie won the best actor and actress (the\nacademy award) at the same time. It just proved that it was Anthony\nHopkins and Jodie Foster made the movie so outstanding. No one can deny\ntheir wonderful performance. The following Hannibal and Red dragon had\nlost the original idea and could not achieve the astonishing effect\nthat TSOTL brought us.<br><br>A thriller classic. 9/10\n"},
{"review": "\nIf you want a movie to watch in the dark, look no further than The\nSilence of the Lambs. Jonathan Demme's tense thriller combines\nexcellent actors and a wonderfully adapted screenplay to make, what\nseems to be one of the best, if not the best, thrillers of all time.<br><br>The film follows three main stories, those being that of rookie FBI\nagent, Clarice Starling, the psychopath murderer Buffalo Bill and\nimprisoned psychiatrist Dr. Hannibal Lecter, imprisoned for murder and\ncannibalism. Clarice is sent to Dr. Lecter to attempt to gain\ninformation on Buffalo Bill, because he was a former patient of\nHannibal, however all Hannibal is interested in is getting inside\nClarice's head. As the film goes on Clarice becomes more deeply\ninvolved in the case, right up to the dramatic and excellent climax, as\nwell as Hannibal becoming more deeply involved in Clarice's mind.\nMeanwhile Buffalo Bill continues his murderous spree, killing and\nskinning women.<br><br>This movie is like no other. It combines tenses scenes with a cast like\nno other. Anthony Hopkins was born to be Hannibal, and why Michelle\nPfeiffer was originally suggested for the role of Clarice over Jodie\nFoster is bizarre, but because Jodie Foster got the role, it doesn't\nreally matter. When it comes to violence this film is very intense.\nThere are some graphically violent scenes, however the worst violence\nin the film is the mental violence. Hannibal's ability to destroy\nsomeone mentally, is incredibly disturbing, and the films motives are\npretty full on. However this contributes to the films overall feel of\nhorror, which is why The Silence of the Lambs is one of the most\nmentally frightening films of all time.<br><br>Stars: 10/10\n"},
{"review": "\nReasons this is so good:<br><br>It has some of the best characters ever created embedded in a storyline\nthat is so famously crisp, and clever that to watch it even after 100\nprevious viewings is still an absolute delight. <br><br>It is a film of sheer talent, Jodie Foster and Anthony Hopkins play\neach others nemesis yet hide this in a tight net of trust and curiosity\nover each others character. and I think the unbelievable potency of\nHannibal 'the cannibal' Lecter is so strong that to actually merge him\ninto reality is totally feasible. <br><br>Jonathan Demme also pulls off such fantastic direction, that is\nshockingly vivid and imaginative, and the atmosphere created with eerie\nscores in the background and repulsive locations (such as Buffalo\nBill's house) is brilliance to a high degree. If you only ever watch\none film a year I suggest you watch this.\n"},
{"review": "\nThe Silence of The Lambs explores the life and mind of Clarice\nStarling, a female FBI agent who has a lot of issues to deal with.\nSomehow by fate, she ends up meeting Hannibal Lector, and they strike\nup a very unusual relationship. The most interesting parts in the movie\ndeal with the 2 of them just talking.<br><br>The highlight of the movie is obviously Anthony Hopkins' performance.\nHe's delightfully creepy as Hannibal. The whole suspense of the\ncharacter is thinking he's about to do something violent, since\nthroughout the movie you only hear stories about the terrible things\nhe's done. When he finally does do something, it really pays off\nbecause it's one of the scariest and most memorable parts in the movie.<br><br>The Silence Of The Lambs appeals to many people. That's because it can\nbe viewed from so many angles, and that's why it's become a part of our\npop-culture. I'm not going to write any longer, because I'm having an\nold friend for dinner.<br><br>My rating: 10/10\n"},
{"review": "\n\nThis film scared the crap out of me the first time I saw it, and\nconsidering\nhow many horror/suspense films I had seen by that point, that's no small\nmatter. At the same time I was giving my nervous system a workout, I was\nsitting there in awe of how well written the film was, how excellently\ndefined and sketched all the characters were, how intellectually\nchallenging\nthe piece was, and how unbelievably good Jodie Foster and Anthony Hopkins\nperformances were- thank God they both won Oscars. Frankly, I was\ndisappointed to learn that there would be a sequel, as I think this film,\nand its story, stand so well on their own and need no elaboration. As\nexcellent and terrifying as JAWS, only with people... which is somehow\neven\nscarier, once you really start to think about. I worry the sequels will\nrun\nthe way of JAWS 2, 3D, and THE REVENGE.  \n"},
{"review": "\nClarice Starling (Jodie Foster) an FBI cadet is hired to try to\ninterview Dr. Hannibal Lecter (Anthony Hopkins). He's a cannibal and\nVERY dangerous. Also there's a psychopath named Buffalo Bill kidnapping\ngirls and skinning them alive. Lecter hints that he knows who Bill is\nand Clarice tries to find out...but Lecter is playing serious mind\ngames with her. <br><br>I caught this back in 1991. I liked it but I thought Foster was just OK\nand I found the story pretty confusing with glaring lapses in logic.\nSeeing it now some 17 years later I still feel the same way. The film\nis somewhat slow and I wasn't that scared or upset by it. Also Foster\n(who's Southern accent comes and goes at an alarming rate) is just OK.\nI'm really surprised that she won the Oscar for this. PLOT SPOILER\nAHEAD!!!! There was also a lot of gay groups who complained that\nBuffalo Bill was a transsexual. As a gay guy I wasn't offended but\nother people were just horrified. END SPOILER!!! <br><br>Still the movie isn't a total washout. Hopkins is just superb as\nLecter. He's downright terrifying at times. He's only on screen about a\ntotal of 30 minutes but you always feel his presence. Also his breakout\n(while completely illogical) is one of the scariest sequences I've ever\nseen. The whole movie is well-directed especially during the final\nsequence. Also it's the first horror film since 1932 to win an acting\nAcademy Award. Heck, it won quite a few! Best Picture, Best Supporting\nActor (Hopkins), Best Actress (Foster), Best Director and Best Adapted\nScreenplay. So, it's a very good thriller worth catching...but Academy\nAward material? I think it was a little overpraised.<br><br>For horror fans there's an extra kick of seeing Roger Corman in a small\nrole!<br><br>\"...I'm having an old friend for dinner.\"\n"},
{"review": "\nA taut thriller, 'Silence of the Lambs' is one of the most gripping\ncinematic experiences out there. With the help of a devilishly good\nperformance from Hopkins, a kinetic pace, and a potent script, 'Lambs'\nhas easily crafted its place in cinematic history, as well as tapped\ninto crime thriller gold.<br><br>each and every scene takes its own time time to seeded into us it\nplants the fear of a hannibal as he describes buffalo bill and his\nmurders and his love for skin his pattern his way of talk as he slowly\nfeeds on you this breathtaking psychological thriller and terrific\ncharacter study will always be remembered for its iconic depiction of\none of the most fascinating monsters ever created, Dr. Lecter, having\ndeserved every award that it won, although Ted Levine should have also\nbeen remembered for his fantastic performance.\n"},
{"review": "\nA serial killer, dubbed Buffalo Bill, has been murdering and skinning\nyoung women and the FBI are getting nowhere. Jack Crawford, the agent\nleading the investigation, decides to try something different; he sends\ntrainee agent Clarice Starling to talk to incarcerated serial killer\nHannibal 'The Cannibal' Lector hoping that he might provide some\ninsight; it won't be easy though; Lector likes to play mind games with\npeople and he is soon trying to get young Clarice to reveal some\npersonal secrets. Soon another body is discovered then Buffalo Bill\nkidnaps another victim; this time the daughter of a US Senator; with\nthe clock ticking before he kills her the FBI offer Lector a deal;\nunfortunately the doctor in charge of the facility housing Lector tells\nhim the deal isn't real\u0085 he then arranges another deal and Lector is\ntransferred to Tennessee. Here Clarice sees him one last time and,\nafter revealing details of a childhood trauma, is put on the trail of\nBill and into a potentially deadly situation.<br><br>This is an impressive thriller that is still effective after a quarter\nof a century and numerous spoofs of some of its most famous scenes.\nWhile the story is ostensibly about the hunt for Buffalo Bill it is as\nmuch about the growing relationship between Clarice and Lector as he\ngets her to open up about herself; something she has been warned about\ndoing but does to gain his trust. Jodie Foster and Anthony Hopkins are\nboth impressive in these roles. The rest of the cast, most notably\nScott Glenn as Crawford and Anthony Heald as Dr Chilton are pretty good\ntoo. While there aren't a lot of violent scenes those that there are\nare particularly brutal. As the story approaches its conclusion the\ntension rises until the conclusion that remains very tense even after\nseveral viewings of the film. Overall I'd certainly recommend this to\nthose wanting a solid thriller; just be warned it isn't for the\nfaint-hearted.\n"}
]