[
{"review": "\n2014 has proved to be a successful year so far for Marvel with 'Captain\nAmerica: The Winter Soldier' and the most recent 'X-Men: Days of Future\nPast'. Bryan Singer returns for the most recent X-Men after being\nabsent for the past four films, and what a return he has made. 'Days of\nFuture Past' is truly an impressive and spectacular instalment in both\nthe 'X- Men' franchise and the entire Marvel Cinematic Universe,\ncombining the casts from both the original trilogy and the prequel\nallowing the audience to view the 'X-Men' in the past, present and\nfuture. The action scenes are intense and spectacularly choreographed\nwith some fantastic heroes and foes fighting both against and alongside\neach other. As a personal opinion, 'Days of Future Past' is the best\nfilm to have graced the Marvel film franchise and one of the greatest\nsuperhero films of all-time. A visually stunning and exhilarating flick\nthat combines the best elements of the series to create a fantastic and\nentertaining film.\n"},
{"review": "\nOMG!!! This movie cannot be simply described in words. If you loved X\nmen first class then this movie is a treat for you. This is a movie\neven non-x men fans will enjoy. Go see this movie guys. Your mind will\nbe blown. I've already seen this movie and looking forward to see it\nagain. <br><br>Hugh Jackman does the best wolverine ever. He became the wolverine i\nwanted to see on screen for ages. The interesting chemistry between\nJames McAvoy and Michael Fassbender is more enjoyable than ever. But\njennifer lawrence and Evan Peters at Quicksilver steal the movie.\nQuicksilver may not look so cool but he is the coolest guy in the whole\nmovie. <br><br>Believe me, this movie is worth your bucks. Moreover there are a bunch\nof new x men characters introduced in the movie which make it more\nenjoyable.Bryan Singer has done complete justice to this movie. And\nthere is one scene just halfway through the movie which is worth\nwatching fifty times. I am thoroughly excited to see the next entry\nentry in series which is being called Apocalypse.<br><br>The only shortcoming in the movie is the runtime which feels a little\nless being only 130 mins. Rest of the movie is a jigsaw which fits\ntogether in a wondrous puzzle.<br><br>So you must go to see this movie. Every element is in a balanced form.\nEven the soundtrack is fitting. <br><br>Happy watching !!!!\n"},
{"review": "\nDays of Future Past continues the work of X2 as genre-defining. I have\nto classify it as a work of art/comic book pulp fiction. The\ncharacters, effects, and story are outstanding. Everything in this\nmovie is exceedingly better in the sequel then even the first two films\nand First Class. Like X2, the acting is superb and the dialogue is\nrich. Every character feels believable. No cartoonish villains, every\nside of the issue is presented by people who believe they are the ones\nwho are in the right and the underlying message of tolerance and\nbigotry only add to the depth of this film. What's better then its\npredecessor X3 in every way. It restores the sense of epic adventure\nand grand-scale storytelling that's been absent from far too many of\nmost alleged blockbusters.<br><br>This film is far more sophisticated and has a better story than any\nX-Men movie to date. Here, the characters previously introduced but\nunder used are utilized in a comprehensive and cohesive manner, and the\nnewly introduced characters are blended in seamlessly with the story.\nThe music is very good as is the special effects. The budget clearly\nhit the screen fully and there are truly some amazing sequences to\nbehold. The cast-selection is still perfect.<br><br>Overall, this is one of the best genre films of all-time.\n"},
{"review": "\nRight now, I'm still trying really hard to find out one bad thing from\nthe X-Men movie I've just seen: <br><br>The characters maybe ? No: every single character is perfectly\nrepresented,interpreted (in particularly with a stunning James McAvoy\nand an impressive Michael Fassbender) and useful to the story. Maybe\nthe plot then ? No: you'll get easily into it, because it is very well\nwritten for the screen, meaning you will be transported as Bryan Singer\nseems to know perfectly how to put in place a very cinematic puzzle.\nEmotions ? You will get some, as long as you loved the original X-Men\ncharacters. The soundtrack ? It is spotless and superbly fitting.\nVisual Effects ? Always there when we want them to be, and not when it\nis unnecessary. Action scenes ? You'll be amazed, thrilled and\ncaptivated when you will realize that every single scene has a purpose,\nwhether it has some action or simple emotions and character's\ndevelopment.<br><br>All these qualities put together are forming a very classical but\nexcellent &amp; accomplished movie, completed by a skilled sense of\ncinematic continuity that we didn't have since Singer left the\nfranchise (at least until X-Men First Class). In other words, you\nshould not be afraid to see this movie, because if you don't want to be\ndisappointed, I can tell : you won't be. <br><br>But is the future of this X-Men movie truly set ? This is something\nyou'll have to figure out by yourselves, and this until the very end of\nthe credits...\n"},
{"review": "\nsimply said it was well directed and well acted with good pacing,great\ncgi effects and epic soundtrack. what more can you expect from a\nsuperhero movie? X-Men might be my favorite superhero movie (except\nwolverine spin off), and DOFP might be the best of them. It's an all\nstar movie with a good director (everything not related to\nprofessionalism is irrelevant), in paper it's guaranteed to be at least\na decent movie,and boy, they didn't disappoint me at all, really\nsurpassed my expectation.<br><br>I am absorbed, nothing else matter except the scenes in front of me.It\nalready had my attention since the overview of the future narrated by\nprofessor X. The story has a good pacing,not to slow but not to fast. I\ndidn't notice any plot holes, and there's nothing in the script that\nannoyed me. Bryan Singer could handle the dramatic and epic scenes very\nwell. the dramatic scenes makes me teared up a little,the epic scenes\nput me on the edge of my seat. And he sew the humor seamlessly, it was\nappropriate and subtle,just what I like.<br><br>They said that DOFP lack of any definitive villains, but any movie\ndoesn't need definitive villains to be good. X-Men movies is always\nabout fighting the enemy inside every humans and mutants, it's always\nabout self struggle, defeating the darkness inside of you.<br><br>4/5 (cause nothing's perfect)\n"},
{"review": "\nI went into this movie with high expectations so that may be the reason\nwhy I wasn't at all impressed with this film. The action was bland,\nshort and just seemed like everything we've already seen before. The\ntruly only great part of this movie was the scene with quicksilver and\nthat was a really short piece of the movie. Once that scene was over\nthe rest of the movie became this huge bore. I go to a movie like this\nwith the usual expectation of seeing something \"new\".. well I was let\ndown.<br><br>The majority of the movie was completely boring. There were only a few\nscenes of very mediocre action and it just seemed like they did not put\na lot of effort into this movie.\n"},
{"review": "\nFor those who would have watched all previous x-men movies, this movie\nwill make it all go waste(except x-men first class). Actually the whole\nmovie is based on humans capturing mystique in 1973, some years after\nthe time in x-men first class, and using her DNA to make powerful\nsentinels to eliminate mutant race. Now here maybe some questions that\nyou might think after watching the movie: 1. If Mystique was captured\nin 1973, how did she make an appearance in x-men 1,2,3? 2. How can\nMagneto control the sentinels(robots) and really large objects (A\nFootball stadium) in 1973? 3. If the future is changed, then wolverine\nwould never get his adamantium claws as Mystique takes her in the end\nof movie. So was there any sense watching x-men origins wolverine? 4.\nFinally, if no-one dies, than is there any sense of watching x-men\n1,2,3 where many characters(Silver Fox, Scott, Jean, Stryker, etc) gets\nkilled? Answer to all these questions is: The directors think the\npublic is stupid and they will earn no matter what crappy story based\nx-men story they make.\n"},
{"review": "\nOrdinary people do not matter. In many ways this film apes the way that\npeople who belong to minorities have more rights than everyone else and\nthink they can do whatever the hell they like.<br><br>In this film the mutants have nearly been wiped out by robot Sentinels\nbuilt by humans and programmed only to kill people with the mutant X\ngene. Yet is makes it clear in the dystopian future the movie starts in\nthat these Sentinels also kill ordinary people, which makes no sense\nwhatsoever.<br><br>Like a lot a time-travel movies, it has daft plot holes and doesn't\ncare about consistency. Towards the film's climax, serial murderer\nMagneto manages to get the anti-mutant robots to obey him by using his\npowers to put steel inside them. Okay, that would allow his powers to\nwork on these things, but he wouldn't be able to give them orders,\nthat's just dumb, but he does when it suits the meandering plot.<br><br>Over long, overly serious and ultimately disappointing. The effects are\ngood, but they're the usual high end computer Paint Box fare that are\nblatantly not actually there.<br><br>If you're easily impressed and don't care about logic or any\ncharacterization or depth, you may still enjoy this.\n"},
{"review": "\nThey should stop calling these movies X-men. It should just be called\nWolverine. I hate what they have done to x-men. Bishop is in the movie\nfor maybe 5 min and the story is about going back in time. If your the\ntype of person that has no knowledge of the X-men universe and just\nwant to have a good time watching a movie you may have enjoyed it, but\nyou were robbed. You were robbed of what the X-men really are and that\nis complex characters with richer struggles and woe. They have failed\nto illustrate all the love triangles and created ones that simply don't\nexist. I just don't know what to say anymore. I see this movie has a\ngood rating. I don't think i can trust the rating system here any\nlonger.\n"},
{"review": "\nEasily the best X Men film yet with a storyline that requires you to\nthink whilst marvelling at the amazing special effects and action\nscenes taking place before your eyes. James McAvoy puts in a superb\nperformance as an embittered Professor X and there are great\nperformances from Hugh Jackman and Michael Fassbender in their\nrespective roles as Wolverine and Magneto but the person everyone is\ngoing to be talking about is a new mutant to the series called\nQuicksilver played superbly with the right amount of arrogance and\nlikability by Evan Peters. His huge action scene where he is required\nto rescue an imprisoned Magneto from a heavily guarded Pentagon is an\nabsolute delight and already a contender of most amazing action scene\nof the year and I cant see anything beating it. Trust me - you will\nwant to watch this scene again and again as there is so much to marvel\nat. Pity that Quicksilver is absent after this as the film does sorely\nmiss the character. Hoping to see more of him in the future. The film\ndoes have a great climax though featuring a highly inventive use of a\nfootball stadium and a post credits scene with a hint of what to expect\nin the next movie. All in all a great movie that is going to delight\nand entertain young and old alike.\n"},
{"review": "\nI've waited a long time for this one. X-Men: First Class was truly\nfirst class in my opinion, from the perspective of a\ncomic-book-turned-movie. I thought there is no way for Days of Future\nPast to disappoint me, but sadly, I was wrong.<br><br>Don't get me wrong or think I am to negative - the movie is visually\ngreat (especially the \"villains\") and the actors do their job more than\nwell. The story is also very interesting and gripping. However, when I\nwatch a Marvel movie, I expect action, thrills and adventure. I do like\ndrama - but not here and definitely not that much. A bit of drama would\nbe OK, but the levels of melodrama we get from certain characters (I\ndon't want to spoil anything so I'll skip the name, but you'll know it\nwhen you see it) are simply not fitting for this kind of movie.<br><br>After some great starting sequences, my wife and I started wondering\nwhy is the movie losing pace and when will the \"real X-Men movie\"\nstart. We rolled our eyes more than once during some scenes, although\nwe are both huge franchise fans.<br><br>I give it a six because I like X-Men and it's visually great and the\nstory is okay. But that is as high as it gets for me. Despite that, I\nwould recommend watching it because I see some very good reviews here\nso I hope not all of you find it as disappointing as I did.\n"},
{"review": "\nAwful in pretty much every sense.<br><br>Do not waste your money on this pathetic excuse of an X-men film.<br><br>The very clever and interesting X-men franchise has now sold out and\nturned into the mindless summer blockbuster in the Transformers style.<br><br>Over the top everything, far too much exposition for the retards in the\naudience, boring story, paper-thin villains, I could go on...<br><br>I found myself checking my watch a few times during this over-long\nstinking turd.<br><br>My partner who is an avid X-men film fan ever since X1, turned to me as\nwe were walking out and said \"well, that was crap\"...I had to agree.\n"},
{"review": "\nAn entertaining movie, though it got fairly silly and plot-hole- ridden\ntowards the end.<br><br>Started very well, with a time travel piece that explained some of the\npast history of the characters. Also had a fair amount of intrigue,\nespecially due to the changing of history angle.<br><br>The movie managed to maintain focus and keep the plot tight, until\nabout halfway through. Then, slowly but surely, the cracks began to\nappear. People behave in random ways, things happen that make no sense,\nand it all seems that these are just plot devices to prolong the movie.<br><br>The final confrontation makes very little sense at all, and neither do\nthe effects of it.<br><br>However, great CGI, obviously, and solid performances all round.\n"},
{"review": "\nBrian Singer, Director of the first 2 Critical and Fan Praised X-Men\nFilms, return to the Director's chair for \"X-Men: Days of Future Past\"\nbrought High Expectations. My Verdict \u0096 Singer and Company Delivered!!!<br><br>The movie does start out a bit slow in the first few minutes, but\nquickly picks up steam as Hugh Jackman's \"Wolverine\" is sent back to\n1973, to try avoid the creations of the Evil Robot \"Sentinels\" which\nbasically appear set to wipe out Mutants and Humans alike in the\npresent day. The X-Men First Class Cast Members \u0096 James McVoy (Xavier),\nMichael Fassbender (Magneto), Jennifer Lawrence (Mystique), and\nNicholas Hoult (Beast), reprise their roles for the 1973 setting, 11\nyears after the story of \"First Class\". The acting from the entire cast\nis pretty much wonderful, including newcomer Evan Peter's Quicksilver,\na subject of on-line worry leading up to the film, is great!!! And\nspecial mention should also be given to Mark Camacho, who scenes as\nPresident Richard Nixon are well done! The 70's jokes and references\nare a treat, and the Special Effects are Great!<br><br>Simply Put \u0096 A Lot of Fun \u0096 X-Men fans should be very pleased \u0096 3 ½\nStars out of 4!\n"},
{"review": "\nFollowing CAPTAIN America: THE WINTER SOLDIER, Marvel continues with\nthe Political Thriller template, and in X-MEN: DAYS OF FUTURE PAST,\nnone other than Richard Nixon is in cahoots with a greedy entrepreneur\nwho plans to exterminate mutants by using robotic war machines\u0085 That's\nPresident Richard Milhouse Nixon, the current Commander-in-Chief as\nit's 1973 since Wolverine was sent back to the past so that Mystique,\nalso known as Raven, doesn't get captured by authorities which would\nresult in\u0085 well let's just say there's no more X-MEN if he doesn't set\nthings straight...<br><br>And of course Logan's not alone, providing the last entry, FIRST CLASS,\nto coincide with the original lineup \u0096 although FUTURE PAST is more of\nthat movie's sequel with Hugh Jackman serving as special guest star.\nMeanwhile the likes of veteran members Patrick Stewart, Ian McKellen\nand Halley Berry are wasted on a subplot dealing with some kind of\npurgatory dimension resembling the THOR universe.<br><br>The best scenes are also the funniest, mostly having to do with\nWolverine's '70s culture shock and slacker mutant Peter aka Quicksilver\nand his penchant for not only speeding past everyone else, but\nperceiving them in the same wry, sarcastic manner Wolverine did in the\noriginal film, also directed by Bryan Singer which, to give due credit,\nstarted the Marvel monopoly in the first place. And those were indeed\nthe great old days...<br><br>For now, in the midst of an otherwise promising time travel espionage,\none excruciatingly overlong sequence involving Xavier in his virtual\nreality brain-machine, trying to coax Raven from assassinating a\nmutant-hating businessman (the only real villain on board), deletes\npotential as the characters waste so much verbal energy explaining\nand/or pontificating past and future events, nothing very suspenseful\noccurs in the meantime.\n"},
{"review": "\nI went with medium expectations, and this film blew me away!!! the\naction scenes were thrilling and exciting, the spectacle epic and\nexhilarating and the acting top notch!!! The complex plot of the film\nworked, because X-Men fans will geek out. This film is an absolute\nblast, a popcorn blockbuster for the ages. It is explosive, emotional ,\nawesome. Although it can get a little slow at times, and the film isn't\nas dark as it's said to be. The stakes are very high and the film is\nquite suspenseful and shocking at times. But in the end this film is an\nepic 3D special effects extravaganza with brains and emotion seriously\nthis film is mind blowing.\n"},
{"review": "\nHaving the last two movies in the franchise (X-Men: First Class and The\nWolverine) being my two favourites of the X-Men series I was hoping\nthat this would follow suit and maybe surpass them, despite the\noverload of old and new characters all in one movie. The plot is simple\nenough, go back in time to save the future; it's not groundbreaking nor\nis it adding anything new to the table as a time-travel movie but it\ndoes make for a great back and forth of characters, action sequences\nand pacing. Some scenes you may find carry on for a bit too long as if\nthe film was stalling for something but the reward is to see some of\nthe best action an X-Men film has to offer, with new additions to the\ncast such as Bishop, Warpath, Blink and Sunspot you really feel these\nare the scenes we have been waiting for, mutants working as a team to\nfight evil. One problem I felt before the film was how Quicksilver\nlooked, really didn't like the pale skin, the silver leather jacket BUT\nthe scenes he was in were probably the most memorable and even\nlaugh-out-loud funny and set some worries aside on his character.\nOverall I think this movie could have failed at being good very easily\nand so many times for so many reasons but it didn't at all, besides a\nfew minor things in the story which seem a bit too easy to go for and\ndidn't challenge itself more this is the X-Men film you have wanted to\nsee for a long time and fans will not be disappointed with this one.\n"},
{"review": "\nShowcasing the biggest assembly of Marvel's mutants ever, 'Days of\nFuture Past' claws its way on top of the X-Men franchise.<br><br>Sensing the brink of extinction, Magneto (Ian McKellen) and Professor X\n(Patrick Stewart) unite together in an attempt to save their species\nfrom the Sentinels. Wolverine (Hugh Jackman) travels back in time to\nstop Raven (Jennifer Lawrence), now called Mystique, from killing\nanti-mutant scientist Dr. Trask (Peter Dinklage). Logan has to convince\nboth the younger Magneto and Charles to stop Mystique before she gets\ncaptured and studied, which in turn would give way to the creation of\nSentinels.<br><br>While, there is so much incoherence in how the time travel aspect of\nthe plot is presented, this must still be Bryan Singer's best X-Men\nfilm. The greatest strength of this movie lays on how it pays so much\nmore attention to its story and script than the visual spectacle it can\nsurely serve. Surprisingly, the movie vaunts some funny and light\nmoments particularly those with Quicksilver (Evan Peter). Quicksilver\nhas enjoyed highlight in this film as his section is streaked with\nlaugh-rendering wit and humor. Jennifer's role is arguably one of the\ncentral if not the most vital in the movie. Hugh Jackman's take remains\nthe same, but somehow feels fresh. Michael Fassbender's Magneto and\nJames McAvoy's Professor X are satisfying than their old counterparts,\nwhich, by the way, is not surprising, as the rest of the cast are\nactually just story pawns.<br><br>'Days of Future Past' is a bold take to raise the X-Men franchise into\nanother level. It toying with history is ambitious, suspenseful and\nconfusing, but it nonetheless manages to escalate itself to a higher\nground. A surging epic and a gripping tale that seems not to loosen its\nhold on the audiences, 'Days of A Future Past' must be X-Men's biggest\ninstallment to date.\n"},
{"review": "\nIn the near future, mutants and ordinary humans alike are under attack\nand losing the battle. So our heroes from former installments try to\nprevent this war by sending Wolverine (Hugh Jackman) back to the past\nso he can fix the mess a certain blue lady (Jennifer Lawrence) is\ncreating. In the year 1973, Wolverine meets young and depressed Charles\nXavier (James McAvoy) and Erik Lehnsherr (Michael Fassbender) again.\nWill he succeed in uniting the two mutant geniuses and change\neverything?<br><br>That said, \"X-Men: Days of Future Past\" is a thrilling experience. The\nchemistry between James McAvoy and Michael Fassbender is amazing, as\nare their performances. Again. Nicholas Hoult does a fantastic job as\nHank. Hugh Jackman is Wolverine, meaning he IS THE Wolverine. \"Game of\nThrones\" star Peter Dinklage does a great job as Dr. Trask. And yes, I\nlove Jennifer Lawrence as Raven. Plus, we see Ellen Page and Omar Sy,\nand Patrick Stewart and Ian McKellen are great as ever. <br><br>I like the performances and the acting in general. There are quite some\nemotional scenes. Needless to say that James McAvoy pulls them off so\nwell it almost hurts.<br><br>\"X-Men: Days of Future Past\" promises fun as well. Action sequences are\nspiced with nice effects and flavored with some humor. Evan Peters who\nplays Quicksilver is amazing in his role and gives you something to\nwatch in amazing 3D.<br><br>Last but not least, the cinematography is fantastic. Yes, I have seen\neven better results, but scenes, cuts, and effects fit the movie. 3D\nlooks and feels great.<br><br>Overall, I rate it as one of the best X-Men movies so far. Although I\nam aware of some logical gaps (considering the original X-Men movie\ntime line), I accept \"X-Men: Days of Future Past\" as a more or less\nalternate canon time line. By doing so, it is easy to enjoy these two\nhours full of mutants, their powers, and their fears.\n"},
{"review": "\nIn the future Sentinels are hunting and killing mutants, in an attempt\nto save mutantkind Wolverine is sent back to the past to change the\nfuture.<br><br>Movies that take on time travel take a huge risk, it generally makes\nfor a flawed film. After seeing several good reviews about X-men: Days\nof Future Past I hoped it would be good. Nope.<br><br>First off the explanation for time traveling is just a cheap mutant\nability to keep fans from questioning it. They also use the same excuse\nto exclude the butterfly effect from occurring.<br><br>Secondly the current timeline that is supposed fix all connection\nproblems from the original trilogy to X-men: First Class is so horribly\nflawed I truly don't understand how fans can stick up for this\nnonsense.<br><br>The action scenes were mediocre, nothing amazing. The acting,\nuninteresting. They have great talent like Peter Dinklage and Evan\nPeters and make them look like they're B-list forgettable actors. Its\nreally sad.<br><br>This movie is so horribly overrated by fanboys that it currently\nresides on the IMDb's top 250 list. Its rated higher then classic films\nlike the original Planet of the Apes and Arsenic and Old Lace.<br><br>This is dumb filmmaking for audiences who want to watch loads of\nspecial effects and lame but good looking actors. Wanna watch a new\naction film with good characters and emotions? Try Dawn of the Planet\nof the Apes. A film with logic.\n"},
{"review": "\nX-Men? Huh? Piece of.... no no no, it's cool this time. Oh man this is\nquite surprising. I never thought this will impress me so i went to the\npremiere with low expectation, but it's nice to see that it turned out\ngood. I liked The Wolverine a lot and that's the only reason i wanted\nto see even i didn't expect well. <br><br>Main thing i still think of - Quicksilver!!!! I didn't even know who\nthe guy was but wow! Just cool!. <br><br>Acting - We got bunch of greatness! what do we expect? <br><br>Superior - Michael and Hugh... hands down to those awesomeness. <br><br>Music - Perfect timing. Emotional <br><br>70's time - Unbelievable way of presentation, great art work. <br><br>Negatives - Too fast somewhere and too slow at the middle. Some over\nuse of actions, we can feel the pressure a little at the Iceman scenes.\n(cool though) <br><br>Oh well, good movie. Don't know what to say more. Worth Money.\n"},
{"review": "\nLike the last Wolverine movie, DOFP goes off the rails somewhere in the\nsecond act. It's imperceptible at first, but then slowly and\ninexorably, the movie craters.<br><br>Why did this movie need to be made? To bring back the original cast,\nwhich was uniformly terrible aside from Jackman, Stewart and McKellan?\nThey were doing great with \"First Class\"; I would have been happy to\nforget the terrible original trilogy. <br><br>If you look up the word \"shoehorn\" in the dictionary, you'll see an\nX-Men: DOFP poster next to the definition. Thanks for screwing up X-Men\ntwice, Bryan Singer!\n"},
{"review": "\n\"I was afraid. I remember.\" Bryan Singer's X-Men were the first surging\nepics to convince the world of Marvel's cinematic potential. After a\nwell-played trilogy and a good origins tale, the production decides to\nmarket an avengers 3x ultimatum. So how does this play out? I'll be\nhonest, I was slightly worried with so many characters in a\nshorter-than-Deathly-Hallows-Part- 1 time frame, that this would miss\nthe mark. Uh uh. Days of Future Past is nothing to think or analyze\nabout. Come on. This is a damn blockbuster. Sit back and enjoy, and\nfeast on your popcorn like a mad man. Especially in a couple of summers\nhere where it seems no big-timer is coming out. I haven't had that\nfeeling for a while. Going golfing, or holidaying at the cabin with\nfamily. Tanning at the beach, picking up steaks and grilling them with\na cola nearby. Walkin' around talking about movie ideas from the\ninspiration of the day, and about blockbusters coming out soon. Whilst\nthe big-time blockbuster in July is yet to release. We haven't had that\nsince The Dark Knight Rises. Get excited about this. It's really what\nyou've imagined &amp; waited for 8-10 years ago. I know I did. And to me,\nthis isn't marketed or as anxiously built-up as it should. I will not\ngive anything way. All I will say is it's a true summer blockbuster to\nlook forward to and to me, it sets the bar and the tone for 2014's\nseason.\n"},
{"review": "\nIn first class you got amazing acting all around, great story telling,\nnew and fresh faces with cool powers even though there was a cameo.\nSinger just wanted to control the xmen universe again because of how\ngood first class actually was. After watching it he probably swore and\nthought he had to do something quick before he gets forgotten for his\nbad xmen movies. Why first class is rated lower than this movie is\nbeyond me. <br><br>First thing on his list was to bring back his old cast. Second, was to\nkill off most of the new cast from first class. Third, add some bad\nstoryline that involves one of the main characters from his other xmen\nmovies because of the popularity of this certain character and the\nactor combined.<br><br>Honestly I don't wanna write more about this movie. I just never wrote\na review before. I was suppose to write a review for that new mad max\nmovie because I felt like I needed to but this xmen movie got in the\nway and put me on a detour. It just appeared and I just instantly\nthought about how bad it was.<br><br>I never want to see this ever again. I'd rather watch First class 3\nmore times before I watch Days of future past again.\n"},
{"review": "\nX-Men: Days of Future Past is the X-Men movie that we have all been\nwaiting for. The last movie that could give this film a run for its\nmoney was 2003's X2. 2011's First Class was a step in the right\ndirection, but this film is very masterful and engaging. I loved the\nidea of combining old cast with new cast and the results are\nimpressive. The story is written well and there are several emotional\nmoments. The action is also very good and some of the set pieces are\njust grand. The visuals compliment the action and they come out in\nfull-force during the scenes of Quicksilver. <br><br>Bryan Singer returns to the helm to direct this film. The main theme is\nchanging history so that the future will be different from which the\npast set it out to be. Wolverine is sent back to the 1970's to stop a\nprogram in which mutants are being targeted by these sentinels which\nare created to take out and destroy mutants. <br><br>This movie has one of the greatest ensembles in recent film history.\nThe old cast is here, the new cast is here, and they combine forces to\nput on a show. Hugh Jackman is ever awesome as Wolverine. Patrick\nStewart/James McAvoy and Ian McKellan/Michael Fassbender are all great\nin their respective roles as Professor X and Magneto. Jennifer Lawrence\nhas some great scenes as Mystique. Peter Dinklage made a great addition\nto the cast as the main villain and someone to keep an eye on is Evan\nPeters as Quicksilver.<br><br>Overall, X-Men: Days of Future Past is the X-Men sequel we have all\nbeen waiting for. By combining old and new, we have ourselves one of\nthe greatest comic books film ever made. Not only is there impressive\naction, the storyline comprises of raw human emotion and\ncharacterization. By far, this is the greatest X-Men movie made to date\nand I am eager to see how this universe is expanded in the future. <br><br>My Grade: A+\n"},
{"review": "\nI think the X-Men movies had a good run and now it seems it should just\nend. It was choppy, it was dark. And unless you really follow the X-Men\nin both the movies and comic books, this movie will leave you confused.\nI watched the movies and I was still confused. When it comes to time\ntravel, it just opens a tall bottle of questions. Of course Magneto is\nback as the bad guy. That adds to my angst. Did the X-Men have no other\nvillains? Just like the Batman franchise, always the Joker. Just like\nthe Spiderman franchise, always the Green Goblin. So why wasn't I\nsurprised. Nothing in this movie stood out to me. No one character\ngrabbed my attention. Though it was refreshing to see Kitty Pryde /\nShadowcat finally getting air time and not all Halle \"lookit me lookit\nme\" Berry. So again, Redbox saved the day. Only $1.27 to rent it. Not\n$12 at the theater and definitely not $20 for DVD or $30 for Blu Ray. I\ngave the movie a generous 5 in case it was me and I missed or\nmisunderstood vital info in the other X-Men / Wolverine movies that\nlead to this movie.\n"},
{"review": "\nI am a big X-Men fan but what a disappointment. I grew up on the\ncomics, the cartoon and loved most of the films. X-Men Days of Future\nPast tries too hard to pack in the emotional layer. I appreciate the\n15,000 jobs it created and hundreds of thousands of hours of work...but\nthe script is so weak. I never roll my eyes but this was unreal. When\ncharacters were killed I felt no connection due to the weak acting.\nJennifer Lawrence didn't seem to be in the right place while filming.\nThe story was so convoluted and the visuals became the only reason to\ncontinue on. $200,000,000 and this is what they create. They need to\nget some new talent injected into this franchise. When I heard people\nat the end gasp, \"oh my God\" about Jean being alive...what did they\nexpect? All the X-Men would be alive due to stopping the assassination\nwhich thus stops the Sentinels from being created. After seeing Rogue,\nStorm, Beast...why not Jean? Couldn't they have tried harder? 15,000\npeople involved with that much money focused could have really made a\ndent in cancer research rather than another clichéd film.\n"},
{"review": "\nEverything is OK, just one thing: If i am Logan, i will murder Trask,\nmake it look like an accident, then destroy all documents about\nsentinels, mission done, no one know about Sentinel project. Or other\nway easier: Xavier will control President's brain, then order Trask\ncancel his Sentinels project mission done easily. I don't understand\nwhy people make this mission too complicated.<br><br>The first time i vote this movie 7, but i admit Jane Goldman (story\nwriter) í creative: He revive all characters who dead in previous X-Men\nmovies by this story. He reset all storys of X-Men trilogy, Wolverine -\nRising Sun. May be he can rewrite X-Men movies after year 1973 replace\nfor those above. Because history was reset.\n"},
{"review": "\nMkey, this movie is called X-Men, but as usual is somehow centered on\nWolverine. Don't get me wrong, I actually like this character, but\nWolverine already has a movie of his own, leave X-Men to another, will\nya ? Anyways X-Men: Days of Future Past is full packed with action and\nspecial effects and all the catchy stuff. If this is all you seek, than\ngo for it.<br><br>The plot is kinda thin, making no sense here and there, or being\ninconsistent. Because I don't think anybody cared much about it, I\nwon't bother going into details, this way also avoiding spoilers and\ntherefore ruining the good time of others. Maybe it's just me.\n"},
{"review": "\nX-Men: Days ... is a dazzlingly convoluted popcorn movie extravaganza\nthat brings back memories of the surprising summertime joy of\ndiscovering Jaws. Bryan Singer's return to the series results in his\nbest film since The Usual Suspects and one of the best comic\nbook-inspired films this side of The Dark Knight. Using intricate CGI\nand arresting visuals, time-honored sci-fi plot twists swirling around\ntime travel, and a sense of humor, Singer has crafted a perfect\ncinematic treat. The acting of the entire cast is perfect. However,\nEvan Peters in his all too short appearance as Quicksilver, steals the\nmovie. Let's hope he resurfaces in days of future future. Lot's of fun!\n"},
{"review": "\nX-Men:Days Of Future Past : ''The way title of movie was introduced,I\nhonestly felt that the movie is gonna be up to the great\nexpectations....Bryan Singer directed it very good,accurate display of\nmutant powers as according to comics,brilliant actors in star cast with\nbrilliance of acting is a lot satisfactory...,action scenes,musical\nscore,cinematography all were good,the superior of all was directing\nand strong script...the star studded cast with brilliant acting(every\nlead actor) and mesmerizing voices(Patrick and Ian)added extra\nperfection.....all the time I was watching this movie,all the previous\nmovies were running in my mind to understand the situations..overall\nthis movie is thrilling,cool,inspiring,awesome!!!'' P.S:-Everyone will\nLOVE it..very pleasing and triumphing movie....in the end it will leave\nmany questions in your mind though (If you are a fan of the series then\nyou will love it in the end if you combine all the parts and make a\nsynopsis of them all by remembering all the characters,honestly you\nwill LOVE it)<br><br>*I loved and lived it as I'm a great fan of X-Men comics and animated\nseries cause I saw it as,I grew(from being kid)by thinking and knowing\nabout all the characters...\n"},
{"review": "\nI can understand fans wanting it to stay loyal to the comic book but\nthere u got the luxury of spreading it out over more episodes and the\nplots will work better with the cliffhangers used in comic books so\nthat you buy the next one.<br><br>Also these where written years ago and mostly for kids who now watch\nmovies they can relate to like 'Hunger games' and 'Divergent' which I\ndid not like because they make everything either black or white with no\nreal nuances.<br><br>A lot of characters where week in this film and the constant struggle\nbetween Xavier and Magneto became to much of a drag in this movie.<br><br>The way they explained the time travel principal was close to\nridiculous and it all seemed like a sort of doubling up the first x-men\nmovie.<br><br>Also the fact that it dismisses a lot of the other movies marvel made\nmakes you really wonder if anyone at marvel is actually paying\nattention to all these franchises.<br><br>And hey...if they do not care than why should I?<br><br>I stopped before with other franchises like\"twilight\" and\"The\nHobbit\"because they where way to predictable and after watching part 2\nof both of these I could have written the final installment myself and\nx-men D.O.F.P. is not much better.<br><br>I am hoping for more of the avengers type movies and the second captain\nAmerica cause I think there more character driven than this sad\nimitation of other marvel movies who are all better than this.<br><br>At the end of the third installment of the original X-men movie I\nfeared that at some point it would create an overkill and Ironman 3\nconfirmed that and now so does this one.<br><br>So....marvel make less and make it better so it stays interesting for\neverybody and worthwhile to care for and keep watching everything you\nmarvel us with.<br><br>Stay Marvelous!\n"},
{"review": "\nI've never really cared much for X-Men in any format, but I did like\n2011's 'First Class'. Unfortunately, despite a few clever bits, I found\n'Days of Future past' to be a rather flat re-hash of the tired X-Men\nformula; Humans are afraid of mutants. Xavier and Magneto argue over\nhow to deal with this. Blah, blah, blah. It's been five movies of this\nsame sort of thing now. It's beyond played out.<br><br>For the uninitiated this is likely to be a rather confusing slog. There\nare a lot of characters and story elements here that have little to no\nset up, and much of it goes back several films. And even for those who\nhave been along for the ride there's not much pay off here. You can see\nevery twist and turn coming from a mile away.<br><br>'Days of Future Past' is a well made, well acted, but ultimately\nmediocre film.\n"},
{"review": "\nwww.tgchan.pl <br><br>I never liked movies with multiple super heroes, it feels like there is\ntoo much for me... or maybe I am too egoistic? :) Well let's see what\nthis film got to offer! 5 minutes - and it already looks like it is one\nof these movies where you can't even blink because you will lose tons\nof action! Not that it is a bad thing but I love to eat different\nthings while I am watching and it won't let me do it! I don't believe I\nhave to mention that the special effects are top notch, right? &gt;:D <br><br>20 minutes - I am already deep in love with the movie!!! Amazing cast!\nAmazing story zomfg can't wait to see more! <br><br>45minute - O M F G I am crushed how amazing this movie is!!! and it's\nfunny too!!! Like really funny! and to think... I am saying all this\nnot being an X-men fan at all :)<br><br>Somewhere in a middle it feels like the movie slows down a little but\nit is coming back to its original pace after a while.<br><br>Annnnnnnnnnnnd it is over. I have finished watching it... yep it steps\ndown a little from the point I have mentioned above. The first half was\njust simply one of the best things I have seen in a long time, the\nsecond part is not bad but you can feel a significant difference. The\nwhole movie is still an amazing thing to watch. Actually it made me\nwant to re-watch some of the older X-men movies.<br><br>Now it is a little tricky to rate it... as the first part of the movie\nwas 11/10 and the second something like 7.5/10... but my final score\nis...<br><br>(oh snap! just as I was writing this, the end credits were rolling down\nand guess what!? There is a short scene at the end of the them !~!!\nmake sure you don't miss it!)<br><br>tgchan's rating: 8.5/10\n"},
{"review": "\nWas supposed to write this in goofs but maybe interested viewers can\nfind this a major critique as well and some geek out there can help me\nout. Good movie and production overall. Just one thing: How in the\nworld is Prof X is still alive? Reboot you say? In that case,\nreminiscing Jean Grey's demise IN this movie by Wolverine himself then\nalso pertains to the Prof's death in that installment! So how do these\ntwo fit together?? Medium-core audiences are supposed to just gloss\nover this? As mentioned, still a great watch- the story is good, a few\ngoofs with references to items non-existent in the 70's, worth watching\nalready if you're just gonna replay scenes with Raven in it- Jennifer\nLawrence is super, super hot. Best character for pimply fans of xmen\nand material for a fantasy porn raven- a sexual partner that can change\nto anyone, or ANY PART of her that you desire... whoops, just veered\noff. I'll cut here.\n"},
{"review": "\nThis movie is amazing, finally X men has returned with new exciting\nstunts, and breath-taking scenes, I am not usually the kind of guy who\nlikes every movie out there, so i could be quite critical of every\ndetail about the movie, this one is a major hit, especially with the\niron controller's younger version. i don't like the old one, and the\nyoung actor is more convincing and fun to watch , and the focusing on\nthe mutant who transfers herself to anybody else is a nice and\nnecessary touch, i deeply enjoyed this movie and i hope you do too.<br><br>i have watched every xmen movie and i really like their superpowers,\nand this movie is intense and holds a true and moving story into it,\nwhich is important as well.\n"},
{"review": "\nX-Men - Days of the Future Past excels in every aspect. It has a clever\nstory (which is a hard thing to do in a time-travel movie), superb\naction and suspense. Basicaly it is a mixture between the Terminator\nand Matrix, our heroes try to manipulate the past in order to achieve\nsome better future for the almost-extinct mutants and the oppressed\nmankind. And the future is grim indeed, and visually fascinating. The\nmutants have been hunted down because Homo Sapiens in its fight for\nsurvival in the evolutionary process managed to create super-robots\nwhich are able to confront superpowers. The battle scenes between the\nSentinels (robots programmed to hunt down mutants) and the remaining\nX-Men are stunning. X-Men are facing a lost cause and that way we have\nsome real suspense on the screen. In every battle before, ordinary\nhumans have been only a cannon fodder, but with the sentinels all bets\nare off. As for the time travel story, our remaining heroes sent\nWolwerines conscience in his young body to try to prevent the creation\nof super robots and perhaps to save a soul of the shape-shifting mutant\nRaven/Mystique. The story background in the seventies is very cool and\nof course it is a good thing that we have some different languages in\nthe movie. I always found irritating that in the most movies we don't\nhear foreign languages, but have bad English with a foreign accent.\nNacis are best example for that. This time everything fits together and\nas a result we have excellent movie. And it is always a pleasure to see\nPatrick Stewart and Ian McKellen share a screen, this time as allies.\nGo and see it, you will not regret it.\n"},
{"review": "\n(73%) I have a very strong feeling that this is the best X-men movie so\nfar. It has all that made \"First class\" a fine rebooting chapter, only\nwith a greater array of characters, a swifter pace, with more comedy\nand more action to enjoy. The plot, despite the vast amount that\nhappens, is pretty simple and well assembled, and everything throughout\nfeels like the makers actually cared about making a good movie and not\njust a milk cow for the big studio's coffers. This is a very enjoyable,\nwell put together, big hitter that's well worth a trek to the cinema,\nand will likely mark a high point in this year's superhero movie line\nup.\n"},
{"review": "\nThis is a welcome back for Bryan Singer and it shows. the plot of the\nfilm is the mutants in the future are being hunted by the government\nand must send one mutant which is wolverine to prevent all this from\never happening This is my favorite x-men movie in the franchise so far\nwhy? Because, It Has A great premise, Good action scenes, very well\ndirected, well shot, well acted, and yeah that's pretty much it. i\nwon't give away to much of it because, i really want people to check\nthis out. I recommend to not X-men fans and X-men fans. also, the only\nnitpick that i can point my Baby finger at is some of new characters\nneed a little more development but, that's a nitpick still check this\nmovie out.\n"},
{"review": "\nThe first 3 X-MEN films are worth seeing. 2000-2006 was a golden period\nfor superhero films.<br><br>Pathetic! The 2009 X-MEN Origins: Wolverine sucks like hell. The game\nadaptation is more worthy than that crap of a film.<br><br>2011's X-MEN: First Class is also horrible. Even the handsome Michael\nFassbender couldn't save the crappy film.<br><br>2013's Wolverine, gosh! Poor storyline! Absolutely worse than a piece\nof metal crap! The metal Wolfie goes to Japan, sloppy, shaggy, and\nbrokenhearted after the love loss, and gets hooked up with a Japanese\nchick on the rebound.<br><br>So, after the torment of X-MEN Origins. First Class, and Wolverine, the\n3 pieces of crap, I have extremely low expectations on Days of Future\nPast.<br><br>It turned out to be rather amazing! So nice to see Jean Grey again. and\nso many old friends and familiar faces! So nice to have a good\nstoryline that is intriguing! Thanks to Bryan Singer's return! The\nfranchise might be redeemed because of this film! The Petagon slow-mo\nbullet-time scene is absolutely incredible! More Jean Grey in the\nfuture, please! More kick-ass Dark Phoenix!\n"},
{"review": "\nI saw the movie and it took me a mouth to figure out what to say about\nthis movie I wanted to see it the moment I saw the promo which came out\nback in December any way the story is about sentals destroying the\nfuture of mankind and wolverine goes back in time to stop an\nassignation on the creator of the sentals and ending with one of the\nmutants trying to take over the world and they have to undo the damage\ndone by last stand and all the damage from both is undone and the movie\nonly happened to wolverine and every thing is the same as before for\neveryone else and magneto never happened and is still in the same\nprison I like it because it shows the old cast with the new cast from\nfirst class\n"},
{"review": "\nX-men Days of Future Past redefines the genre of smart superhero movie.\nThe movie delves into the psychological depth of the characters that we\nhave admired for decades. It is not just about a war between humans and\nmutants in this movie. It is more about correcting one's path and\nbelieving that by changing your decisions, one can have a better life\nto live.<br><br>All the characters face a dilemma of what they must do and what they\nshould do. While Wolverine has a choice whether he should go in past to\nfix things, young Charles Xavier has a choice to make between pain or\npower. Mystique faces a choice between exacting revenge on those who\nhurt or forgive while Magneto faces a choice between following his path\nor following Charles's wishes. <br><br>Bolivar Trask clearly thinks of his own dwarfism as a bad form of\nmutancy and he wishes the world to be rid of the phenomenon. Smart\nchoice to pick Peter Dinkalge for the role who clearly nails it. His\nown sentinel program is determined by his desire for \"true peace\" but\nit sounds hollow in the face of the destruction that the sentinel\ncauses 50 years later.<br><br>This is definitely a smart movie and not just a popcorn flick. Evan\nPeters is too good as Magneto's illegitimate son Pietro Maximoff. The\ndirection by Bryan Singer is top notch. Clever shifting of scenes in\nthe final segment between past and the future. The momentum and the\npace of both the stories is well maintained.<br><br>I go for a 10 rating for this Marvel venture. Keep it coming.<br><br>P.S.- Don't miss out on the Post Credit scene.\n"},
{"review": "\nThis is what the comic book film genre was supposed to be. Fast-paced,\nintense, character-driven - all of that, but with HEART. What a work of\nart, Marvel. Please don't take us for granted like you did in the early\n2000's. Keep it true. Keep it fun. That's all you have to do. And you\ndid it here. THANK YOU. And how can you not love the easter eggs\neverywhere in these films. Wonderful hat-tips to the comics.<br><br>But that cast....this series set the bar wonderfully high for\nsubsequent Marvel movies. Michael Fassbender &amp; James McAvoy might be\nthe greatest actors in a Marvel film. Good GOD. Perfect ambassadors for\nthe X-Men series for years to come. <br><br>And uh......can we see Deadpool done right? :) Beggars &amp; choosers, I\nknow! PEACE!\n"},
{"review": "\nThe X-Men franchise has set itself apart, among the gluttonous crop of\nsuperhero movies in recent years. After seven films, the characters are\nvery familiar to us, and the latest installment is arguably the best\nyet, with its predecessor as the only other contender for that title.\nThis is vastly better than the two stand-alone Wolverine films.<br><br>This movie wastes no time, putting us right in the action from the\nopening credits. The storyline is complex and frankly doesn't make an\nenormous amount of sense, but with a modest disbelief suspension makes\nfor an entertaining couple of hours. It's also a decent science-fiction\nfilm in its own right.<br><br>The all-star cast does a satisfactory job. (I'm not really convinced by\nJennifer Lawrence, sorry.) It's satisfying to have so many characters,\nwhich was a hallmark of the comic book series. We could easily be\nexperiencing this story in the pages of a Marvel mag.<br><br>The film stumbles a bit when it begins to fall into the blockbuster\ntrap of trying to pack in too many spectacular scenes. On the other\nhand, the musical score is far less obnoxious than we've been hearing\nin other recent Hollywood movies.<br><br>I was surprised to learn this was directed by the same person who\nhelmed \"Superman Returns\". I thought that film was a disaster. So he\nseems to have evolved in his artistic skill.<br><br>These new X-Men movies demonstrate how to convincingly make prequels,\nin contrast to some other blockbuster franchises. One wonders why they\ngave the coveted Star Wars sequel to JJ Abrams when there are clearly\nbetter directors in the business.\n"},
{"review": "\nI only just about made it to the end of this film. In some respects I'm\nglad I waited it out as I always enjoy seeing Magneto rise up and wreak\nhavoc in any format.<br><br>It was a close run thing however - I came very close to cutting my\nlosses as we all had to endure the tiresome emotional crisis of the\nyoung Professor X. This film suffers from the blight of a tedious\nextended middle section where not an awful lot interesting actually\nhappens - and there are prolonged periods of uninspiring dialogue. I\nfound my mind wandering in the cinema as the director laboriously set\nup the clunky plot climax. It was all a bit tiresome.<br><br>One always needs to leave one's brain at the door in this type of film\nand that's OK, it's what we all expect, but I was expecting this film\nto outdo the other incarnations of the X-Men given the things I had\nread, and the glowing recommendations I got from colleagues.<br><br>Sadly it's all a bit pedestrian, and when you find yourself fidgeting\nand looking at your watch in the middle of an X-Men film you know that\nsomething has gone wrong somewhere. There are excellent performances\nhere and there. Fassbender continues to ooze screen charisma and he\ncaptures the ruthless single mindedness of Magneto wonderfully well.\nJackman continues to make Wolverine his own, but aside from that\nthere's not really much memorable here.<br><br>This is the first X-Men I have gone to see in the cinema and I think it\nwill be my last.\n"},
{"review": "\nI thought this was going to be the most action packed X-Men movie so\nfar. With LOTS of special effects and superpowers...I was wrong.\nHowever this has the most emotionally moving story in the X-Men movie\nfranchise so far. It delves into humanity, subconscious, emotions, hope\nand destiny. There is actually quite a bit of memorable moments in this\nmovie, mainly because of the depth and development. The plot is a bit\ncomplex for me to thoroughly explain, but it's about Wolverine going\nback to the 1973 in order the save the mutants in the future. From\nsentinels that can copy and adapt other mutants powers that are used\nagainst them. Which they got the advancement from Mystique's DNA.\nHowever shouldn't it be Rogue's power? It would have been cool to see\nthe mutants actually have a chance against the sentinels. Anyways\nWolverine is once again the main main main character who goes back in\ntime to guide the younger Professor Xavier. Kind of like how Xavier\nguided Wolverine. The movie is called X-Men but the story mostly\nfocuses in on Wolverine, Xavier, Magneto and Mystique. You do see the\nother mutants use their powers, but it doesn't play the main key parts\ninto this movie. My main complaint with Wolverine in this, is the fact\nthat he doesn't have his Adamantium claws so you won't really see him\ntearing crap up. This movie let's say is a refreshing start to a new\nbeginning...Maybe. My favorite part in this movie is the Quicksilver\nscene in the kitchen. If people actually decide to make a Flash movie,\nmaybe the budget won't be in the TV show. So when it comes to the Flash\nmovie, I hope it can up the coolness from that scene. Overall this is\nmy favorite X-Men movie so far even surpassing the second installment.\nIt really is worth checking out.<br><br>8.5/10\n"},
{"review": "\nAt first, the idea to unite the old and new face of X-Men team is\nbrilliant but could be risky too. Thankfully Bryan Singer knows what\nhe's doing and seems comfortable with the material it has, \"X-Men: Days\nof Future Past\" never get confused or lost with bunch of mutant\ncharacter and always focus to the main topic. All top form casts are\nplaced where it should be and given almost same portion on each\nsignificant character while the plot itself is nicely structured and\nthe future-past time are neatly set. The mixed of action-drama-comedy\nare put in a right place and never reduce fun factor this movie offers.\nA hilarious escape scene, thoughtful yet compelling time twisted\nstoryline guided with charismatic performance by James McAvoy and\nMichael Fassbender, all ended with stunning action climax, it's a first\nclass entertainment which the fans and non fans of X-men franchise are\nexpecting. Overall \"X-Men: Days of Future Past\" is an elegant,\nemotional, entertaining action-packed that is worth to see at any\nseason. And once again Bryan Singer proves himself as an X-Men\nspecialty. He succeeded to bring nostalgia from the original X-Men\ncasts and give more chances for younger member to shine by continuing\nthe respected-solid foundation that Matthew Vaughn had created. It is\nthe X-Men series that audiences have missed since \"X2\" and got\npotential to be the most remarkable superhero movie this year.\n"},
{"review": "\nX-men, days of future past takes us into the future, when humans have\ncreated robots that they can adapt to mutant powers and destroy them.\nThere for Professor X and Magnito send Wolverine back in time, to worn\ntheir young selves and help them prevent the creation of the robots. To\nbe honest, I was a little bit scared by the very bad Wolverine sequel,\nthat I didn't expect the the new x-men would be any good. However, the\nmovie is great. The back and forth in time doesn't confuse the\naudience, fortunately, and the story doesn't get boring or gets you\ntired because of the too many action scenes. There are of course some\nquestions that the film leaves unsolved in the end, but I guess we will\nhave to wait for x-men Apocalypse to find out. An other thing that I\ndidn't like, was the scenes that where shoot by a \"vintige\" camera as\nto show the time of the action, but they where too many, so less of\nthem would have been better. Good performances, well most of them at\nleast and nice costumes, very 70's. So, 7 out of 10, because it is\nenjoyable and interesting.\n"},
{"review": "\nI was somewhat unsure of what to expect when I went to watch this\nnewest installment of the X-Men franchise. While the X-Men franchise\nhas produced some remarkable films (like the original X-men) many have\nleft me leaving the theater with a rather large dose of disappointment.\nAfter researching X-Men: Days of Future Past I couldn't help but feel a\ncertain amount of optimism.<br><br>This movie absolutely delivered! Right from the very beginning the\nviewer is launched into a world of dread and hopelessness. All of\nmutant kind has been driven to the point of extinction. With their\noptions dwindling the X-Men decide to send on of their members to 1973\nin order to try and undo the present.<br><br>Everything in the film is well done. The visuals are fantastic. The\ngraphics are state of the art. The storyline is brilliant. There was\nnever a point during the movie where I felt I knew what was going to\nhappen next. I was very happy to see Patrick Stewart and Ian McKellen\nreprise their roles as Charles Xavier and Magneto. They have truly\nbrought their characters to life in a very real way.<br><br>If you are looking for film that has it all then this is a must see.\nFrom start to finish you will quite literally be left on the edge of\nyour seat. In my opinion this film sets a very high standard of what a\ncomic book movie should be.\n"},
{"review": "\nI couldn't have said it better myself, or anyone else. This X-Men\ninstalment is THE X-Men film that the fans have been anticipating since\nthe beginning. I can even go ahead and say that this is the one that\nwill even convert non-fans into fans, it's that good.<br><br>Days of Future Past reinvents what the series can do in such a fresh\nway, without rebooting it completely may I remind you. Most of all it\nis a time travel film, and there are some issues with the continuity\nbut all can be forgiven after sitting through this film completely. It\nmends all the mistakes of the past X-Men films (in terms of quality)\nand feels closer to the comics than the first three movies.<br><br>I have to admit that I keep comparing too many superhero movies to The\nDark Knight in terms of the story and the characterisation, but I only\ncompare Days of Future Past to it in the \"reinventing the franchise\"\nway and also telling a bigger story that is darker and meaner. It gets\nso much right: The Sentinels, Wolverine, and the mixing of the all-star\ncast of X-Men 1-3 (including Patrick Stewart and Ian McKellen) and even\nthe cast from X-Men: First Class (featuring James McAvoy and Michael\nFassbender).<br><br>The story, the direction, the editing, the music and particularly\nQuicksilver's soon-to-be classic scene, all adds up to one thrilling\nride that doesn't deserve to be missed by any X-Men fan out there. I\ncouldn't recommend this movie enough. It's like Avengers but with a\nwhole world of weird and wonderful mutants.<br><br>A well deserved 9/10 is what this movie gets.\n"},
{"review": "\nThe plot is as complicated as the title itself, but it's done so\nmasterfully that there's no scope for complaints.<br><br>The acting is superb, and the chemistry between the cast members is\nnoteworthy. It grips you instantly from the get-go with an elaborately\norchestrated action sequence, and keeps you on the hook till the very\nend.<br><br>Even when there's not much going on-screen, the emotional intensity\nfeels very real and palatable. <br><br>The introduction of Quicksilver couldn't be any better. He steals every\nscene that he's in, and makes vital contributions whenever he's needed.\nHugh Jackman once again kills it as Wolverine. Only this time he shows\nhis depth of the character in a more vulnerable and experienced way.<br><br>There is a couple of surprises throughout the film, and the inclusion\nof humor every now and then- makes the movie worth every penny!<br><br>The conflict of ideologies between the Professor and Magneto is\nimpartially depicted. And the dark past of a few major characters is\ncarefully handled.<br><br>Overall, a solid A+. And a must-see film of 2014.\n"},
{"review": "\nThe sequel/prequel element makes for a complex storyline and there are\nsome 'borrowed' themes from the TERMINATOR and ROBOCOP franchises, but\nthis doesn't interfere with the viewer's enjoyment of DAYS OF FUTURE\nPAST. The pace is terrific and the action scenes showcase CGI at its\nvery best. I watched the 2D version, having come to feel that 3D\ndoesn't actually add much to a good movie (or a bad one).<br><br>Obviously you don't come to a film like this looking for great acting,\nbut all the cast play their roles seriously without any pantomime send-\nups. Middle age must be about to catch up with Hugh Jackman, but he's\nstill a hunk. We mostly see the younger versions of Erik and Charles\n(Michael Fassbender and James McAvoy), but Patrick Stewart and Ian\nMcKellen pop up from time to time to add a bit of gravitas. Mark\nCamacho does a great job of recreating Richard M. Nixon, that most\ndevious of presidents. There's a welcome surprise appearance at the\nend, and the suggestion that messing with time really does have\nconsequences.<br><br>DAYS OF FUTURE PAST really raises the bar on sequels and remakes. It\nmay be the best X-MEN yet. It's certainly the best, so far, of this\nsummer's blockbusters.\n"},
{"review": "\n\"The ultimate X-Men ensemble fights a war for the survival of the\nspecies across two time periods.\"<br><br>That right there was enough to give me a wet dream! Hyped as the X-Men\nmovie that most fans have been waiting for (especially since X2: X-Men\nUnited back in 2003 was such a massive leap forward), as a big fan of\nthe original comic series, it lived up to that hype in a BIG way!<br><br>What so many other super-hero movies fail to do, is to embrace both\nintimate melodrama and tongue-in-cheekiness to make a spectacular mix\nof intensity and fun, balanced with just the right amount of\ninteresting characters. Another challenge that this movie masters well,\nis finding a character that the viewer will cheer for... it most\ndefinitely doesn't fall short. (Except for Sentinals. Sentinals are\ndicks.) Heck, even Tyrion Lannister, and Katniss Everdeen are in this\nmovie! Generally, the faster I finish my popcorn the more exciting the\nfilm is, and I did stuff my face very quickly.<br><br>'Days Of Future Past' also continues the X-Men tradition of being\npolitically and sociologically conscious and relevant, bearing a number\nof allegorical references that fit squarely with many issues faced in\nmodern society.(Cue philosophical discussions here). The special\neffects are mighty, the humor is sharp and in abundance and the\ndialogue is alive &amp; breathing. Even though the film is sometimes\nerratic, the paradoxes of time-travel are exhilarating and extremely\nfun to watch, despite the complexities. All-in-all it's a mind blowing\nblockbuster that knocks you out!\n"},
{"review": "\nIf you plan on watching a X-Men movie you expect some cool and\nlatest-technology special effects, some great combat scenes in which\nmutants with crazy powers use whatever ability they're feeling like and\nof course some cold-blooded drama that sometimes is based on some real\nissues society faces (more often the movies ask \"How society treats\nminorities\"). X-Men \"Days of Future Past\" has it all .... and so much\nmore! Almost every line spoken is excellent and deeply important and\nthe team of actresses and actors is absolutely stunning. I can't\nremember the last time I've seen a movie in which every actor/actress\ndoes their absolute best to achieve entertainment on such heights. If\nI'd want to find a fault in this movie it'd just be how the ending is\nso big of a plot-twist (which can be foreseen right from the start)\nthat it greatly influences every single X-Men movie you have seen so\nfar. If you like X-Men, you'll love \"Days of Future Past\".\n"},
{"review": "\nI liked everything about the movie from the beginning till the end.\nAlthough there were some plot holes, but considering how awesome the\nmovie was it could be compromised.<br><br>Being a fan of X-men I went for the movie on the same day it was\nreleased, I had it in my mind that the movie would be lame as The\nWolverine. But to my surprise it wasn't and in fact it was just the\nopposite.<br><br>Bit of humor here and there made the movie even more awesome. I might\ngo watch it again.<br><br>So guys, If you really enjoyed watching this movie and if you think\nyour time and money was worth it, then give it 10 stars, lets not have\nthis movie go underrated.\n"},
{"review": "\nX Men was one of the first movies about comics during last decade.<br><br>The cartoon show on TV was amazing, but we need see it at movies. The\nmix between stories about X Men was marvelous. <br><br>The contrast color between future and present is other character in\nthis movie.<br><br>All actors are BIG. Filled with action, but a very good story, and\nmixing mutant activities with human history. The photography is very\ngood, the music too. <br><br>The participation of Peter Dinklage is the spice in this movie. You\nneed to see it. And the final scene pots credits is....<br><br>When the movie comes to end, you want to see more, and more, and more\n"},
{"review": "\nFirst let me elaborate my relationship with the whole xmen franchise<br><br>As a child I loved the cartoons and series, I later liked the first\nmovie a lot , but everything else after that( even the much appreciated\nfirst class) for me felt like ' meh' at it best, not bad or something\nbut in a category of movies i would completely have forgotten next week\nafter.<br><br>Voilà that being said my expectations for this were pretty low. If it\nwould had some decent spectacle it would be already fine for me. But\nwow this movie truly amazed me in a very very positive way.<br><br>Story wise, directing, characters, acting,spectacle,music,sound its all\nform an incredible level, and to me this is hands down the best xmen\nmovie to date i saw!<br><br>Very well done mr singer,cast and crew perhaps i become after all a fan\nof xmen movies :)\n"},
{"review": "\nIn the future, the mutants and the humans that help them are\nslaughtered by powerful robots named Sentinels. Professor Xavier\n(Patrick Stewart), Wolverine (Hugh Jackman), Magneto (Ian McKellen),\nStorm (Halle Berry), Kitty Pryde (Ellen Page) and her friends meet at a\nmonastery in China and Xavier explains that the invincible Sentinels\nwere created using the DNA of Mystique (Jennifer Lawrence) that was\ncaptured in 1973 when she tried to assassinate their creator Dr.\nBolivar Trask (Peter Dinklage). Xavier tells that their only chance is\nreturn to 1973 using Pryde's ability to join Charles Xavier (James\nMcAvoy) and Erik Lehnsherr (Michael Fassbender)to convince Mystique to\ngive up of her intention. However, only Wolverine can withstand the\ndamages of the time travel. Will he succeed in stopping Mystique and\nthe Sentinel Program and save the mutants and their human friends from\nannihilation? <br><br>The screenplay of \"X-Men: Days of Future Past\" is confused in the\nbeginning of the story but soon there is the explanation of what is\nhappening. The special effects are top-notch and the excellent cast\ncompletes this great adventure of the X-Men. My vote is eight.<br><br>Title (Brazil): \"X-Men: Dias de um Futuro Esquecido\" (\"X-Men: Days of\nthe Forgotten Future\")\n"},
{"review": "\nIf you like X1 and X2, you might like this, but if you are a big fan of\nX-Men First Class, like I am - you should be warned that this is a\ndifferent animal. I was quite disappointed in this one.<br><br>The point is: One of Matthew Vaughn's biggest strengths is pacing. Say\nwhat you will about him; his movies have a great flow. The same thing,\nhowever, seems to be a weakness with Singer. Compared to First Class,\nthis movie was SOOO SLOW. It was badly paced, and it was also\nheavy-handed, repetitive and sentimental. Not emotional, I like\nemotional - it was sentimental. Singer is too fond of these characters,\nespecially the old X-men (everything to bring them back!) plus the\nCharles-Raven-Erik conflict. God, that conflict got tiring! I loved\nXavier as the brilliant, funny, warm teacher in First Class. Now he was\nsuddenly ALL ABOUT Raven/Mystique. Ugh! Kill your darlings, Singer!\nYou've lost your critical sense! <br><br>Quicksilver was one of the few good things about this movie, but he was\ngone too fast.<br><br>This movie had some good action scenes and glimpses of humour. And\nnostalgia, I guess, if you're a big X-men fan. First Class, however,\nhad better pacing, script, score, was much more fun and also more\npoignant.\n"},
{"review": "\nX-men Days of Future Past is the best X-men Movie of the main series\nand second if you count Deadpool. It is based in the comic of the same\nname and for those in the loop here is the basic story. After\ndevastating War against the Sentinels ,robots programmed to hunt\nmutants, the team of the X-men sends Wolverine back in time in order to\nstop the cause of the fight from ever happening and by that preventing\nthe War from occurring.<br><br>The future itself is terrifying and comparing it with the mid\nseventies,where Logan has gone, makes you wander how an action decades\nbefore a tragedy can make or prevent the event. In the seventies also\nwe meet the main cast of the characters of the First Class and thanks\nto Wolverine they are completed in the persons we all know and love.\nPersonally after seen the flick for a third time I think that this is a\nMustique film because her characters' actions show if we humans can\nbecome better or not and I really liked the portrait of Lawrence ,she\nis the end all Mustique ,from point of view. Pity that after the newest\nfilm she will leave the role, but she at least gave us a career define\nrole.<br><br>Although the director has made some changes of the original comic the\nbasic is there and Singer adds something more : Hope. Apart from time\ntravel, the fear created by racism , amazing action and see both the\nprevious cast and the new in the big screen, this X-men movie has based\non hope for the future ,hope for no matter how bad it gets we can still\nfind a solution and as Patrick Stuart himself said in the movie: \"If\nsomeone lose his path does not mean that he will stay lost\" .<br><br>In the end I love this flick and is my favorite comic book movie of\n2014 ,even more than the Winter Soldier and Guardians of the Galaxy!\nWith Bryan Singer on the director chair I feel safe that Apocalype will\nbe good and the main cast are as solid choices as they get ,so Mutant\nand Proud comic and in general geek comrades :) !!!\n"},
{"review": "\nI have never been a full X-Men fan, I have enjoyed each one of them,\nwith the exception of Wolverine Origin (which was garbage). First Class\nwas a great reboot of the franchise, but I never thought the sequel to\nthat would as as great as it was.<br><br>Right off the bat, you are thrown into a fantastic story-line that\ndraws you in. Seeing the old cast along side the new, was\nspine-tingling. The futuristic themes of this film work very well, and\nthe film is edited perfectly to merge and blend the past and future.\nThere is next to no complaints I have about this film, while this isn't\nthe realistic superhero movie you would see in the Dark Knight trilogy,\nthis film most definitely matches it in terms of emotional impact and\nentertainment,<br><br>The acting has never been so good in an X-Men film like here, every\nsingle actor in this film gives a top-notch performance, with James\nMcAvoy being the stand-out. Jennifer Lawrence is also fantastic here,\nand it was good seeing her as the character blue Mystique rather than\nJennifer we see in the first one. It is difficult to say who the main\nvillain of this film is, as there is many to choose from, but Magneto\ndoes a great job.<br><br>Quicksilver is in this movie, and despite his limited screen-time, he\ngives the best scene in the film. The action is also very good as well,\nwith no shaky cam, and no serious fast cuts. <br><br>This is the best X-Men film so far, and a perfect superhero movie.<br><br>9.6/10\n"},
{"review": "\nWhen the news that Matthew Vaughn, the excellent director of X-\nMen:First Class, would not be directing a sequel everybody was surely\nsad. But when Bryan Singer came on and made a return then it all seemed\nto be worth it. To tell the truth, Days of Future Past is the best\nmovie in the franchise yet. Nothing has beaten it as Tim Millers\nDeadpool really did not get close to this and X- Men:Apocalypse is\nclearly not over this here. Bryan Singer does it great and cool,\nplaying with his awesome characters and rooting them to do stuff they\ndo all very well. The sense of the first main X-Men prequel is still\nher and every character is as he or she should be. The only bad thing\nhere is that we have seemingly lost the sense of the first 2 x-men\nmovies, but its a long awaited reunion that proves that the x-men are\nback in movie business with great hands.\n"},
{"review": "\nX Men Days of Future Past is awesome. It is a thrill ride with lots\nemotion and intensity and shows the new generation of the X men some\nnames return like Micheal Fassbender and James Mcavory who are\nexcellent in this movie. The acting is fantastic and the movie is very\ninteresting and I don't know how fateful it is to the comics and\npersonally don't care but there was a prefect direction for the film.\nThe movie is more of a sequel to first class which I found cool but\nwipes the plate with all the other movies probably because they weren't\nbad but they wanted to bring Scott and Jean back.<br><br>The plot is that the mutant race is on the verge of extinction and they\nsend Wolverine back in time for some 70's fun am i right. Then\nWolverine and ends up finding Charles and asking for help to stop the\nfirst sentinel from being created.<br><br>The movie is fantastic and easily the best out of the X men movies.\n"},
{"review": "\nAs a massive fan of the X-Men films, I love this movie and hate it at\nthe same time. While the special effects, character development and\nfantastic attachment to the other films that explains so much about\ncharacters such as Magneto and Professor Xavier, were all fantastic...\nI found myself pulling my hair out at the fact that this entire movie\nsimply undoes what the other SIX films set out. So, essentially, you\nonly need to watch this ONE film to know what has happened so far -\nnone of the rest of it counts. Quicksilver was a highlight for me, but\nI wish that reviewers would stop attempting to compare the Days of\nFuture Past version to the Age of Ultron version. It is safe to say\nthat these two are COMPLETELY different interpretations of the\ncharacter, both wonderful in their own vastly different ways.\n"},
{"review": "\nHaving only watched one of the previous X-Men films, I wasn't really\nexpecting much. But after watching this, it rekindled the little kid in\nme that used to watch the animated X-Men shows on television. It was\ngreat to see all kinds of mutants (and actors/actresses) with different\npowers, even though I didn't know their background. Cool stuff. The\nvisuals and effects were really well done. It seemed like a more mature\nfilm than I had imagined based on the previous films.<br><br>The acting too was on point, everyone played their parts and got into\ntheir characters really well. At one point I even consciously\nacknowledged this when McAvoy as Xavier was concentrating really hard\nand you could see the vein on his forehead bulge out. The character\ndevelopments was also well explored and it showed on screen. The\ncharacter of Quicksilver was a really good addition. He added a comedic\neffect and the slow motion scenes were great and accurately\ncomplimented the character.<br><br>However there are quite a few things I have a problem with, mainly with\nthe plot. It seemed a bit too easy for Wolverine to convince the\nyounger Xavier and Magneto to believe him, when he didn't really do\nmuch himself. And why are Xavier and Magneto the only ones ageing?\nThere's a strong difference between the characters from the past and\npresent..hmm now that I think about it, it's probably because the rest\nof the mutants weren't in the present (with the exception of Wolverine\nwho's immortal). OK like I said, I didn't watch the other films. I'm\nwanting to now though.<br><br>Anyway, it was a really cool film, with cool characters and a kind of\ncool plot. It's just that it kind of made everything seem...redundant.\nIf you've watched it, you'll get what I mean.<br><br>Read more movie reviews at: championangels.wordpress.com\n"},
{"review": "\nI expected a lot after reading the reviews and watching the trailers\nand all but from the minute the movie started I knew that I had been\ntricked. <br><br>First of all the beginning of this movie wasn't as great as the\nbeginning of first class. Due to this weak start my expectations for\nthe rest of the movie lowered. A film like this needs a good beginning,\nwhich I thought the dark knight movies gave us. Days of future past\ngives us a very messy start and one might find it hard to concentrate\nor to watch the beginning because there was too much happening\neverywhere all together. There's something happening here then\nsomething else happens there and then we completely forget what just\nhappened before that.<br><br>The acting was OK, but the directing was bad. Mostly because it's not\npossible to see most parts because it's really really dark. I do\nunderstand that they've done that on purpose as to show the darkness\nthat there living in but seriously couldn't they make it just a little\nbit less darker. Also the slow motion, I loved the slow motion in the\nbeginning half of the film. That part was breathtaking and it was one\nof my favorite parts of the entire movie ( of course I mean the\npentagon part). But as you go more and more into the movie you can\nrealize that almost half of the movie is in slow motion, some of it\nunnecessary.<br><br>The story was OK. It wasn't thought through well. Firstly it didn't\nmake much sense. The story at the beginning half made it look like the\nstory could have a really good prestige like, shocking ending but ended\nweirdly and not making sense at all. I have no idea how they are going\nto make a sequel for this with that ending. If they do make a sequel ,\nI don't think it will have a lot to do with this. Also some parts of\nthe movie were slow making it a bit boring. <br><br>I really preferred first class in all ways ( this didn't even have any\nhumor at all.) anyways it was watchable but not what you might expect\nit to be.\n"},
{"review": "\nI'm not a fan of superhero comic books, but I'm not against the idea of\nsuperhero movies. Its just that few of them escape the clichés of the\nhundreds of other actions films out there. The Dark Knight was pretty\ngood half a decade ago (tarnished by edgy teenage misanthropes, but\nthat's not TDK's fault), but since then Marvel and DC either didn't\ninterest me or disappointed. I was mildly interested in seeing this due\nto its high Rotten Tomatoes score, so I chose this for a movie outing\nwith a friend.<br><br>It was actually a perfectly solid action flick. I wouldn't say it sets\na new bar, but it avoided clichés by focusing on character. In fact,\naction and character development were evenly matched.<br><br>The conflict between Professor X and Magneto is done surprisingly well.\nYou wouldn't think a superhero movie would do a good job at showing the\nclashing sides of moderate vs extremist activism, yet both sides are\nportrayed realistically. Magneto is villainous, of course, but he's not\nevil for the sake of evil. Professor X believes that humans can be\ntaught to accept Mutants, yet all their crimes make Magneto convinced\nonly one race should reign on Earth. And its not easy to debunk him.\nMystique was also well done, not subservient to either side.<br><br>There was too much gristle in terms of the number of superheros.\nProfessor X, Magneto, and Mystique are the only vital characters to the\nplot. Wolverine, Beast, and Kitty Pride serve important roles, but\ndon't have a character arc. Perhaps twice as many characters make\ncameos, but ultimately are forgettable unless you read the comics. The\naction never wowed me, personally. Some of parts against the Sentinels\nwere cool, but predictable.<br><br>Regardless, the characters were strong enough to hold the movie for me.\nA 7/10 may not seem like much, but its above average. I think it\ndeserves its large box office toll, and I'm curious if the sequel can\nmaintain this quality.\n"},
{"review": "\nAfter watching the 6 previous X-men movies, 5 of which where centered\naround wolverine, I did not have too high expectations for this one.\nAnd 10 minutes in when it becomes apparent that this one will also have\nwolverine as the main character, my eyes rolled back in my head.<br><br>However, this time they really nailed it. The plot is as tight as you\ncan get with a time traveling plot in an action movie. Yes, the opening\nis a total ripoff of Terminator 2, yes it's predictable, yes it's too\nlong, yes there are too many characters. <br><br>However... The pacing is good, the plot is exiting (despite being\npredictable), the action is really great. The effects are great and not\ncheap looking. There is plenty of nerdgasem moments and it was great to\nsee the old crew back together.<br><br>To summarize, it's not Citizen Kane or Donnie Brasco, and to be honest\nit's probably not even Dark Knight, but I think this is about as good\nof an X-Men movie as you are going to get. I enjoyed this much more\nthan Dark Knight Rises and probably more than Avengers too. I really\nliked it. Go see it.<br><br>Ps. I did not watch it in 3D, because I am an adult.\n"},
{"review": "\nThe best movie in the X-men movie franchise by a distance. Keeps you\ncompletely engrossed from the start till the very end (Pity me I missed\nout on the post credits scene). Dark future, not-so-perfect past with a\nray of hope, a shining light in between the two zones. What a concept!<br><br>Superb direction by Bryan Singer who returns to the franchise and\nstarts delivering from the 1st frame itself. Hugh Jackman as\nWolverine/Logan is a treat to watch any day. He is completely owned\nthis character and as always been cheesy here and there, which is\nactually fun to watch. Jennifer Lawrence excels as Mystique/Raven. This\ngirl knows how to play a part in a movie and not get overshadowed by\nbigger stars. The most exciting part of the movie was actually watching\nthe younger Professor Charles Xavier and Magneto/Erik played by James\nMcavoy and Michael Fassbender respectively who are strikingly different\nin character from their present selves. Not to miss the breath-taking\nstunts by supporting mutants like Beast, Quicksilver, Blink and\nShadowcat.<br><br>Action sequences are amazing, and will leave you in awe (i was\nliterally screaming WOW). The script has been improved and flaws\nremoved from the previous editions. Everything is near perfect. Marvel\nstudios deliver another marvelous flick. Not to be missed as a movie on\na whole, and not a scene to be missed. In short, this part does what\nother parts couldn't. And yeah, don't forget the post credits scene.\nPoor me!\n"},
{"review": "\nThe movie is absolutely incredible! All the performances are amazing,\nespecially James McAvoy's, Michael Fasbander's, and Jennifer\nLawrence's. If you haven't seen any of the other X-Men movies, then I\nhighly recommend checking them out before watching this one because you\nwill appreciate Days of Future Past so much more. Not only is the movie\nthe best in the X-Men saga, but it is also funny, suspenseful,\ngripping, and action-packed. I absolutely love the storyline in this\nfilm as well. <br><br>One of my favorite scenes of this movie was Quicksilver's. Is there\nanyone who does not like the guy?! Because he is amazing! I just wish\nthey could use the same actor for The Avengers Age of Ultron. <br><br>Mystique, my favorite mutant, has a huge role and so that's amazing. <br><br>In the final scene when Mystique is deciding whether to kill Trask or\nnot, and the camera is switching between past and future: best part in\nmy opinion. I loved how the movie plays slow music for the scene, it\nmeans so much in such little of a tune. I loved X-Men and I have\nalready seen it twice! I don't plan at stopping at that either... 10/10\nStars! :)\n"},
{"review": "\nIt's difficult to talk about all the good things in this movie.\nMagnificent actors ,a story so great that no matter how difficult it\nwas for Bryan Singer to deliver , in the end the satisfaction was\nthere. No pointless action was also a plus for my review . I always\nwanted to see the depth of the story , the emotions of the characters ,\nand this movie's got it all . Also bear in mind that this movie was\nalso a try to fix the problems that the latest x-movies had created.\nYet that is also done in the end . Another thing is that Hugh Jackman\nnot only once again proves how he can perfectly perform the same role\nin a different mode ,since wolverine is more like a mentor in this one\n, but also how he can still be in 100% body shape for years in success.\nPatrick Stewart and Ian Mckellen bring their experience in and a\ncombination with Fassbender's and Mcavoy's great performances is a\nboost . Now i can't wait for the next one .\n"},
{"review": "\nFirst of all, I kind of think i noticed a small small error, when quick\nsilver saved the others/had fun in the pentagon, he first put his\nearphone on and the walkman was running. Still, even if he had a IPod,\nthe sound of the music would still be like aaaa because the Ipod\ndoesn't run as quick as him.<br><br>of course, it could be the music in his own head, and the earphone\nwhich had to be put on and down is just a symbol, still;););)<br><br>Otherwise, I loved loved loved this movie!!!<br><br>I wish i have seen more of rogue, but then I probably would hate kitty\npryde again for stealing rogues man(only because i loved xm 1+2 so\nmuch)<br><br>the sentinels were really bad ass, poor everyone<br><br>the end is great, yet i cannot imagine jean and scott in the next\nmovies, they did age a lot... even though they look GREAT, still, the\ntime does leave marks, sad:(<br><br>i am sooooo happy there will be a third prequel, i hope quicksilver\nwill return and his sister shall join the party too!!!!!\n"},
{"review": "\nI have waited months for X-Men: Days of Future Past to be released and\nfinally got the chance to see it yesterday. I had high expectations\ngoing into the film due to all of the marketing, trailers and build up\nand it's fair to say the film exceeded my expectations. The film\ndelivers on all levels from the acting, visual effects, storyline and\naction. All of the cast give impressive performances, but James McAvoy,\nMichael Fassbender and Jennifer Lawrence stood out to me the most. One\nof my favourite scenes in the film is the prison break scene where we\nget to see Quicksilver in action. Not only do we see Quicksilver in\naction we get to see things from his perspective when he's moving at\nsuperhuman speed. I liked how the film slipped in a little reference to\nthe father and son relationship between him and Magneto.<br><br>A lot of new characters make their big screen debut such as Bishop,\nWarpath, Sunspot and Blink. Although most of the new characters have\nlittle screen time they make a big impression and we get to see them go\ntoe-to-toe with the Sentinels. It was great to see characters like\nBlink and Bishop in action and how they use their abilities to battle\nthe Sentinels. Another highlight of the film for me was seeing Iceman\n(Bobby Drake) in full ice form performing the famous ice slide. The\noverall tone of the film is a lot darker than previous X-Men films, but\nthere's a lot more at stake in this film. There's still humour in the\nfilm and a few one liners that will give you a laugh. In my opinion\nX-Men: Days of Future Past is one of the best films of the franchise\nand it's a good job Bryan Singer returned to direct the franchise he\nstarted on the big screen. Bryan Singer also rectifies a lot of the\nevents which took place in X-Men: The Last Stand giving the impression\nthat the film never happened. The future looks bright for the X-Men\nfranchise and I can't wait for X-Men: Apocalypse to be released.\n"},
{"review": "\nRegardless and what you think of any X-men you seen in the past (The\nso-so trilogy or the Wolverine origin movies) this movie will show you\nsomething that all fans of the series have been waiting for....<br><br>A serious and heartfelt plot line.....<br><br>I have heard that a lot of people are turned off by the idea of the new\nand old and did not think that it would work but i assure you director\nBryan Singer made it so.<br><br>I encourage all to see this movie even if your not a fan of x-men. Its\na great action movie with a fantastic story that will keep you gripped\nto the end of the movie.\n"},
{"review": "\nIn X-Men: Days of Future Past, Director Bryan Singer presents to the\ncinematic world not just another superhero movie, but a tour de force\nof a movie going experience. He achieves this by integrating\nexceptional storytelling and in-depth character development with the\nperfect balance of faithfulness to both the franchise and comic book.\nIt is realized through world class support from the entire cast and\ncrew. Notable performances are given by Patrick Stewart, Ian McKellen,\nJames McAvoy, Michael Fassbender and Jennifer Lawrence. As a newcomer\nto the franchise, Peter Dinklage as Dr. Boliver Trask does a great job\ngiving fans a villain they will have no choice but to love hating.\nSpecial mention goes out to Hugh Jackman. In Days of Future Past he\ntruly delivers the essence of Wolverine, portraying with equal aplomb\nhis every flaw and strength. <br><br>If you are unfamiliar with the franchise, an afternoon spent viewing\nX-Men (2000), X2 (2003) and X-Men: First Class (2011) just prior to\nattending a show should serve to enhance your enjoyment of the movie;\nhands down the best of them all. If you are even a casual fan you will\nnot be disappointed. I will leave it to the die-hards and the\ncurmudgeons to quibble over flaws; yes, of course there are some\n(though not many, to be sure). Days of Future Past is a must see. It\nwill remain a timeless classic not only in the genre of superhero\nmovies, but of film as a whole.\n"},
{"review": "\nBryan Singer is back at the helm and he nails it with Days of Future\nPast, hands down this is going to be one of the best movies of the\nsummer.<br><br>I was a little scared how the story was going to pan out because of the\nposter that shows Jenifer Lawrence just as huge as Hugh Jackman,\nfearing that the story would reflect her status as an Oscar winning\nstar, but unlike most of the other X-Men movies this movie is not even\nthe Wolverine show. Every major character got more of a chance to shine\nin this flick.<br><br>And of course the best part of the film is the mutants. We got to see\nsome old ones like Shadowcat, played by Ellen Page, who uses her powers\ndifferently in this film, and new ones like Quicksilver who proves\nsuper fast heroes are awesome. It was great to see them use their\npowers, but will admit Singer still has a long way to go with special\neffects.<br><br>Peter Dinklage brings the drama to the cast. His outing as Bolivar\nTrask the major bad guy was perfect, and it's good to see him do stuff\noutside of Game of Thrones. <br><br>The movie does not fully pay attention to the continuity of all the\nfilms, but what's good about time travel is that it sets everything in\nplace. Now we are fully completing with the Marvel cinematic universe\nover at Disney. Can't wait to see X-Men: Apocalypse now. <br><br>You got to see this one.\n"},
{"review": "\nA phenomenal addition to the X-Men movie collection. It was nice to see\nso many of the characters we grew up seeing in the comics make\nappearances in this movie, even if they were briefly shown. It's nice\nto see Beast in the picture now as well. <br><br>I give the casting director two thumbs up on his casting of Evan Peters\nas Quicksilver. He played the part perfectly and I really don't think\nanyone else could have done as well as he did. <br><br>Though the story was twisted a bit from the original comic book\nstoryline, I think the sequence of events that took place and how it\nall connects was just outstanding. A very well written script and very\nwell designed scenes. As always, the graphics were superb.<br><br>10 stars to Days of Future Past and I cannot wait to see the next one.\nThe teaser after the credits is worth waiting for. It's going to be\nreally good.\n"},
{"review": "\nAfter seeing this movie I tried to compare it to others I had seen, as\nI often do. I usually find most of the ones I watch to finish somewhere\nbelow the traditional greats: X2, The Dark Knight, Spider-Man 2,\nAvengers, Superman...until now. I'll have to see it a few more times\nbefore the novelty wears off but that may have been the best superhero\nfilm I have ever seen. And I stress the word \"film\" because that's the\nonly way I can describe a movie with so many emotional beats, such\nstrong subtext, so many layers, so much complexity and so many gut\nwrenching moments.<br><br>From watching Mystique review autopsy files, to painfully watching the\nX-Men graphically die in a lynch mob of Sentinels can not be describes\nin comparison to other superhero movies. They felt less like scenes\nfrom another cape-inspired summer blockbuster and more like scenes from\nSchlinder's List.<br><br>The movie also does an excellent job of being an allegory for racism;\nthe trump card X-Men holds over all other heroes. It means something.\nUnlike Batman who is a rich playboy, or Iron Man who is a rich playboy\nor Spider-Man who is a broke supposedly hard luck case who none the\nless bags tons of pretty ladies, or Cap who is a universally loved war\nhero, the X-Men are outcasts. As the movie so perfectly depicts,\nthey're lives are not perfect. These characters don't fall into normal\ncaricatures of \"good\" and \"bad\". Everyone is a mix, everyone is broken.<br><br>There's no pretty girl for them to impress, most of them are not\nsurrounded by wealth and all of them are normal faces who blend into\nthe crowd but are not part of the crowd. The movie makes you feel truly\nsorry for that.<br><br>There is no superhero formula in this movie. The good guys don't\nnecessarily \"win\", the bad guys don't even \"lose\". Even with a future\naverted, the future still is not set. And it leaves you with the\nfeeling that maybe this never ends, and there is more to come. Much\nmore.\n"},
{"review": "\nThis movie is freaking spectacular. The best x-men movie of all time\nand also one of the best if not the best superhero movie of all time.\nSeriously this movie is amazing. The performances are all very\ncompelling especially from standouts such as James McAvoy, Michael\nFassbender, Hugh Jackman, Jennifer Lawrance and pretty much the whole\ncast. The movie is smartly written and very emotionally satisfying. The\ndialogue is smart, funny, compelling, emotional and gets you invested\nwith all the characters. X-Men Days Of Future Past one of the most\nvisually stunning, epic blockbusters ever to grace our screen. Let's\nhope Apocalypse can live up to the expectations it now must met.\n"},
{"review": "\nDefinitely the best comic book adaptation with avengers right behind\nit. From the beginning it makes you feel like the world has actually\nbeen destroyed and the 3D is definitely worth the money. The concept of\nthe sentinels copying mutant powers made them so much more interesting\nand gave some really good effects and fight scenes. The new mutants\nthat were introduced e.g Sunspot, Bishop, Blink and Warpath weren't in\nthe film a lot but they'll obviously be introduced in the next film\nwhich is obviously Apocalypse. The film also erased everything done in\nx-men last stand which was awful and you could really tell that Bryan\nSinger was back giving us the best film in the trilogy. He brought the\nold cast and the new cast together really well and I'm not sure whether\nthis was Stewart or Mckellen's last film but I wouldn't be too bothered\nif it was because James Mcavoy and Michael Fassbender do it so well. <br><br>Overall the film had EVERYTHING I wanted from it, even small things\nlike quicksilver hinting his relation to Magneto and loads of other\nthings that only fans of the comics would understand. The after credit\nscene gave us a little insight to the next film and it was exactly what\nI was expecting. Can't wait to see the next.\n"},
{"review": "\nI love Marvel studio super hero films... All of them. I gave Avengers a\n10/10, mainly because it's an incredibly well put together entertaining\nfilm that successfully collaborated multiple heroes into a film.<br><br>With that said, I am one of thousands of Marvel fans who wants to see\nall marvel character rights go back to Marvel Studios...<br><br>But... the X-men films... Which are made by Fox... I have a reservation\nwith. Fox has done a respectable job and I don't mind them handling\nX-Men... First class reinforce that belief of mine...<br><br>But with Days of Future Past... I'm a believer that Fox should keep\nX-Men (until they mess up anyways). <br><br>This film reminded me of the epic sentinels vs Xmen cartoon episodes I\nwatched growing up, it was surreal watching the first 20-30 minutes. It\nwas magnificent!!!<br><br>The film never faltered IMO, it was simply a job well done... The\ncharacters introduced were memorable, the villains felt invincible and\nyou really feared them and for the Xmen. <br><br>If you like action films you need to see this, if you like hero films\nthis is the best hero film since Avengers. Yes, even better than Winter\nSoldier which was fantastic. It's a can't miss film.<br><br>It's a classic and I was shocked how well Fox were able to do it.\nActing, pacing, story, characters etc... It's all here and done well.<br><br>9.5/10 - Extremely highly recommended.\n"},
{"review": "\nI just got back from seeing this and I'm awestruck! I heard in an\ninterview with Bryan Singer, the director of this film, the original\nfilm that started it all, 2000's X-Men &amp; the sequel X2: X-Men United,\nthat in this film, he was trying to tie everything that had happened\nafter the first two movies and fix the problems. In that I say he did a\nspot on job and bravo! If you are a fan of these films, I guarantee\nthis will be your favorite of the franchise! It is so good! The action\nis wonderful, the story is intriguing to follow and the film looks\ngreat and sounds awesome. I'm one of those film fans that noticed that\nthe first three films in the franchise, start out in the same way in\nthat after the 20th Century Fox logo comes on and then fades to black,\nthe 'X' in Fox stays a bit longer before eventually fading too. I was\nhoping since Singer was back with the franchise, that this little treat\nto the fans would return too, and it does! I was so pumped when I saw\nthis, not to mention the use of Ottman's X2 theme towards the end of\nthe 20th Century Fox logo as well. Oh and I loved, LOVED, Quicksilver's\nscene! Practically sole the show! :)\n"},
{"review": "\nDAYS OF FUTURE PAST is the best x men movie, or say at par with X:2 &amp;\nFirst class. Thanks to Bryan Singer, who again does a brilliant job in\nstuffing the entire x men universe. There are a few minor flaws and as\nexpected some under utilized characters. Especially Halle Berry's\nSTORM. But it didn't bothered much since there is truckload of\nmasterclass actors and actresses. Peter Dinklage having blast, Sir Ian\nMcKellen &amp; Patrick Stewart sharing screen together again, James McCoy &amp;\nMichael Fassbander's rock solid chemistry, Superb Jennifer Lawrence in\ndynamic action, SCENE STEALING EVAN PETER's Quicksilver (I wished for\nmore of him), and Hugh Jackman's cut short action but acting avatar\nwhich was great and suitable. There are more actors who does a fabulous\njob but the mentioned guys were the most enjoyable of the entire lot.\nThis is the darkest x men movie, even more than the last year's\nWOLVERINE and it has a solid emotional core attached to it. The time\ntravel plot and the differences between the mutants is executed\nflawlessly. Visual effects are top-notch but 3D doesn't adds much\ndepth. Background score is fine. On the whole, FUTURE PAST is Great,\nmemorable and a lot enjoyable! Must - watch. 4.5/5<br><br>Note:- \"Their is one after credits scene\".\n"},
{"review": "\ni've read the comics and watched the animated cartoon on days of future\npast episodes, still have them and you know what ? this movie outdone\nthem!! problem is it's a mixed contents , wolverine i/o bishop or kathy\n, and not literally going back into time and there is NO MASTER MOLD as\nthe super villain, not sure how he going to fit in later because the\n2nd planned movie is with Apocalypse as the main villain. hope bryan\nsinger reads this, the future is not yet set if Master MOLD still out\nthere. Anyway this is the Bryan singer movie ever, i personally think\nhe sucks at making x men , but with this one - he can be the james\ncameron / ridley scott, Nolan, of superheroes movie\n"},
{"review": "\nNot going to give spoilers, but let's just say this: I haven't watched\na movie in theaters like this since TDK trilogy where you were actually\nhoping the movie wouldn't end and that the story would continue.<br><br>This movie from beginning to end is top notch in story telling, action,\nand in keeping to the source material. As a huge fan of the time travel\nsaga from the X-Men cartoons, this movie was just amazing. You get all\nthe characters of that time which include Bishop and his friends.<br><br>On the other side, you get the past and present characters of the\nX-Men. You get cameos here and there. Mystique and Wolverine were\nawesome.<br><br>For those that want jokes, this movie has them. However, this movie is\na lot darker than the Avengers, Captain America, and Thor movies. I\nwould put the \"dark\" level in between TDK and Ironman 1.<br><br>Overall, see this MOVIE NOW! Also stay for the ending. You haven't got\ngoosebumps yet until you see what I saw!!! 10 out of 10! A rare perfect\nmovie. Blows away the other X-Men movies and is the best Marvel movie\nmade yet!\n"},
{"review": "\nThought I'm sorely tempted to credit Nolan for the thinking person's\nblockbuster, I cannot deny that Singer has been there before, and done\nthat before (for some, he's done better before, in the mainstream\nrealm). Fear not, he betters the best mainstream X-Men movie he's done\nwith this one. <br><br>I, for one, love 'First Class', and what Vaughn brought to it. When\nthey announced that has-been Singer was returning to helm, I was\nworried. Well, was I wrong. Sure, it might have perhaps been better\nwith Vaughn in the director's chair (who knows?), but this is one\nintelligent piece of mainstream cinema that I, for one, will wanna\nwatch once again (the darkness that pervades converted 3D cinema is\nvery much in your face for this outing, and I'd like another viewing,\nnot just for that reason).<br><br>Perhaps one of the best outings for Jackman's mutant ever, this one\nsets up the next one in this universe very cleverly, and yes, far too\nconveniently as well, but I'm not gonna be the one to complain.\nBringing some cool first-time visual aesthetics to the starved sci-fi\nactioner genre, this one plays like the trend-setting first Matrix\nmovie for the never-too-creatively-bereft superhero cinema, which did\nneed a shot in the arm post the latest Spidey outing, that was shorn of\nthe intellectual edge<br><br>With nods to various characters, old and new, and various Easter eggs\nsprinkled, laying the foundation for upcoming alternate universe tales,\nthis is sheer joy, with my only concern being the way movie studio\nfranchises will now ape the rebooting of each franchise with the same\nset of characters and actors, and are liable to have eggs on their face\nmore often than not, since this is lightning in a bottle.<br><br>The 3D (converted) is pretty good, but it will depend on the projection\nsystem in the cinema you choose. All in all, a pretty good time at the\nmovies after 'The winter soldier'. Enjoy!\n"},
{"review": "\nWolverine gallops through time and space to deflect an ugly outcome for\nall of humanity, pausing frequently to give old cast members the time\nto wink directly into the camera and strut off set. I'm somewhat\nashamed to admit I thought it was a rather large mess. The story had a\nlot of potential, especially in the unusual settings of both timelines,\nbut it somewhat predictably gets tangled in the tripwires often\nassociated with a time travel flick and spends far too much time\ndelivering fan service when it should've been examining character\nmotivations and further world-building. Trask and his sentinels barely\nplay a supporting role in the proceedings, patsies at best, and I'm\nstill struggling to comprehend Magneto's decision-making in the third\nact. It retains all of the unease-inspiring puns and goofball moments\nthat I'd hoped the series could shed, making it feel dated and slightly\npandering... a significant backtrack from the progress made in First\nClass. Even the built-in fireworks of the two heavyweight casts meeting\nface-to-face doesn't really work as well as it should. Seeing the new\nguys (McAvoy and Fassbender) alongside the old guard (Stewart and\nMcKellen) didn't result in a torch-passing or spotlight the nuanced\nefforts that had so delighted me in the previous picture, it just made\nme yearn to see more of the senior guard. I mean, it's not all bad -\nthe effects work is wonderful, it's a lot of fun spotting all the\nlittle love notes scattered about for hardcore fans, and the action\nroars along for a two-hour candyland cruise - but I had trouble\nshutting off my brain when earlier chapters hadn't been nearly so\ndemanding in that department.\n"},
{"review": "\nThis movie was a huge disappointment for me because it felt like a\nfiller movie (A movie that is not needed/created just for monetary\npurposes/contributes nothing to the story of the preceding movies) The\nmovie had great visuals and seeing all the mutants together in the same\nfilm was amazing, but that is not why I see movies nor do I encourage\nanyone to do so.<br><br>I enjoyed The Wolverine movie, but did not enjoy this. Sitting through\nthis movie felt like a chore. Several parts were not needed and it felt\nlike it was dragged on way too long. I think the part where Magneto was\nmoving the stadium was dragged on far too long. Parts like these make\nme believe that if Wolverine was really time traveling during a battle\nthat he would easily be captured or killed considering how long he was\ntaking. I understand he was not time traveling in another part of the\nuniverse like in the movie Interstellar so the time should correlate\nwith the present time.<br><br>The other parts of the movie I did not like were how the movie\npresented the mutants as arrogant a-holes that have superpowers. They\nwere so arrogant that they didn't even have sympathy for a fellow\nmutant. I understand that this was before the Xavier's School for\nGifted Youngsters, but still is this the only two things the mutants\nhave in common with each other?\n"},
{"review": "\nAnd when I say cheating I'm not only talking about moments where things\nare not logical anymore (logical in the realm of what we get served\nthat is, not logical as in the \"real\" world), but also story-wise. If\nyou watch it through, you'll know what I mean. On the other hand it's\nnice to put a lid on some things ... or quite a couple of things. Or\nclosing a circle ... or whatever you want to call it.<br><br>So whatever your take on that is (head shaking or nod of approval),\nwill decide how you'll receive this movie. Technically there is nothing\nto criticize and the story (if not depicted and torn apart for logical\nerrors), is more than entertaining enough to hold you to the edge of\nyour seat. If you've seen the other movies, you'll love how this comes\ntogether, even if your favorite character might not get as much screen\ntime as you thought/hoped he/she would get. Great moments and superhero\nmovies have arrived a long time ago. And they'll continue, one way or\nthe other. Rejoice or be afraid ;o)\n"},
{"review": "\nx men days of future past was an really good film as it really focuses\non the story line along with its action and its about Logan going back\nin time to stop raven from killing a scientist and he makes a machine\nto kill mutants and the government didn't accept the machines because\nthe government didn't thing the mutants would be a threat to mankind\nbut since the scientist was assassinated by raven a mutant the\ngovernment took a decision to build these machine (robots) to save\nmankind from mutants <br><br>so in the future Logan is send back in time because he is the only one\nwho will survive when going back in time and he is ordered to stop\nraven so this entire madness will not begin<br><br>if you have not seen this movie i recommend it\n"},
{"review": "\nLike the other X-Men Movies, this one is as well a must see movie for\naction fans and/or especially for kinda like superhero movies.<br><br>For People, who don't know X-Men at all, it's about humanity being\nreformed by nature in form of mutations that reveal paranormal\nabilities like telekinesis, invulnerability, invisibility, body\ntransformation, laser shooting eyes, and many more. There are so many\ninteresting abilities.<br><br>For People, who know the X-Men series, there is to say, in this movie,\na travel back in time shall save a future, controlled by the \"normal\"\nhuman beings and some machines, created to kill mutants.<br><br>Wolverine is sent back, to prevent some big mistakes, made by Eric and\nsome other evil mutants.<br><br>I think it was a really good continuation to the chapters before.<br><br>I hope it will be continued.<br><br>Best wishes, Tibor\n"},
{"review": "\nSince the first X-Men movie began over 14 years ago, the entire X-Men\nfranchise has exploded into a huge success. The original X-Men (2000)\nmovie with the original cast of Patrick Stewart, Ian McKellen, Hugh\nJackman, Halle Berry, etc. was great because it was one of the first\nMarvel movies to be shot in real life and the special effects were\namazing. It was pretty much the start of a new era of superhero films..\nFast forward a decade after the first movie, you've now got a new\nseries starring James McAvoy and Michael Fassbender as the two main\ncharacters.<br><br>What fascinated me about this movie was the fact that Bryan Singer\nreturned and was able to mesh up the old with the new in such an\ninteresting way that makes the movie work. It's very rare nowadays to\nkeep actors on for sequels...but to keep the original cast from 14\nyears ago to play the older counterparts of the main characters from\nFirst-Class was a marvel in itself. Now you've got the best of both\nworlds, and it does not disappoint!<br><br>I thought that this movie was amazing. As many reviewers have said, it\ntouches on a lot of themes, some of which include discrimination,\nadaptation, hope, and preservation. Most importantly, it focuses on the\nidea of change and how one person can make a difference in the world.\nBut also how teamwork and the forces around you can drive you to do the\nthings you end up doing.<br><br>Overall, the storyline was good, the themes stood out very clearly, and\nto top it all off, the entire movie was action-packed and highly\nentertaining. I'd recommend watching it if you haven't, as it's a movie\nsuitable for everyone, even if you're not a superhero junkie!\n"},
{"review": "\nThe X-men films have been hit or miss but X-men Days of Future's Past\nhits it out of the park. Nearly everything works in this film from the\nsuperb direction to the complexity of the characters. One aspect that\nworks in the films favor is that there are plenty of mutants and they\nare all utilized well. One in particular steals the show and one scene\nencapsulates this proclamation. The usual suspects return of course\nboth young and old and that's what really works in this film. Now\nseeing them back to back the younger versions truly resemble the older\ncounterparts in terms of personality. It was great to see James Mcavoy\nand Michael Fassbender reprise their roles as Magneto and Charles\nXavier. Their rapport is truly astounding , I just wish there were more\nscenes with them. Too much attention was focused on Wolverine. Another\nissue with the film is the Trask character. He is just too dull to\ncarry a movie. However the action is first rate and the film is a\ncomplete X-men movie. Overall this film is great, while being slightly\nbelow \"First Class\" it still belongs on the mantle along with the other\nsuperb Marvel Films.\n"},
{"review": "\nSurprisingly good! If you've seen many of the recent crop of super-hero\nsci-fi schlock that's been released then you'll understand why this is\na surprise.<br><br>The premise is that Wolverine is sent back in time to prevent the\nhorrible Terminator style future all the mutants are experiencing.\nThere is plenty of eye candy CGI and explosions and all the usual\nsuspects make cameos. In that way it's similar to other offerings but\nthis one, unlike those, has an engaging story. True there is probably\nnothing earth shatteringly new here but the deft handling keeps it from\never feeling like a paint by numbers tent-pole.<br><br>Wolverine doesn't do much Wolverine, he's mainly used as a POV\ncharacter for us to bridge the past and the future. Peter Dinklage\nplays the gov't villain and while I always love seeing him on screen\nhis character seems underutilized. Hugh Jackman carries the movie in\nterms of character and acting chops though the cast in general was very\nwell chosen, there are just so many of them we only get a little bit of\ntime with each. Young Xavier and Magneto reprise their roles from the\nprevious movie and Mystique looks better than ever and we actually get\na bit of character development from her. Giamatti has a great scene\nchewing couple scenes that are far too short, I can only hope he and\nDinklage will be used more in future movies. It would be awesome to see\na spectacle genre movie that also let some of these great actors loose.<br><br>The world building holds together very well, not as many obvious\nanachronisms. I didn't feel the effort to hold suspension of disbelief\nlike I have in other recent genre flicks. Special mention for the\nscenes with Quicksilver showing off his powers, those were particularly\neffective.<br><br>If they can keep this quality up for the future offerings then I will\nbe going for sure. Highly recommended for fans of the genre.\n"},
{"review": "\nReviewing X-Men days of future past, I feel the odd one out. Maybe\nbecause it was meant for the die hard fans and I am no great follower\nof the series, so I don't see what's the hoo-ha about. The latest\ninstalment in the series of X-Men is way too over rated, and this is\nfrom the point of view of a cinema enthusiast and not a comic book\nlover. There were great moments obviously, and they have been quoted\nagain and again, like the Quicksilver scenes, the CGIs, the bleak\natmosphere in the starting, but these don't make for a great movie in\nits entirety. I might agree with the fact that it's amongst the best in\nthe franchise, but again this franchise hasn't seen much creativity\neither. IMDb rating 8.6, at the time of my writing, is way too\noverblown. It doesn't belong to the league it's being put into.<br><br>Having raised my concerns I return to the movie. To start with, a great\ncast, some solid performances, a decent plot and pulsating sequences.\nBut, unfortunately a lot of it is just for nothing. Put in too many\ngood things and the mash comes out with no flavour. Wolverine, had no\nimpact whatsoever on the movie, neither did beast or loads of other\nmutants. Ellen page, she was probably there to watch the movie from\ninside the movie. Raven suddenly gets all the attention, maybe because\nJennifer Lawrence is now such a big phenomenon, but that is justified,\nso pass. Peter is a good inclusion, he fits in perfectly and delivers\nthe kind of performance you expect from him.<br><br>Also, 70's of X-Men is more like the 2020's of other Sci-fi movies. The\nthreat to the mutants as well as to the entire humanity wasn't\nthreatening enough. I mean, they took the easy way out I suppose. Not\nread the comics so won't take the liberty to comment on it further.<br><br>I have deliberately avoided the good stuff, because it's been repeated\nquite a few times and I'd simply be reiterating. I'd go with 7/10, and\nhope people start rating it based on the content and not on the hype.\n"},
{"review": "\nOne of the best movies i've seen really! I like it better when all\nmutants are together and this movie had good story, Logan of course as\none of the strongest characters and we got to see some characters that\nactually died. A good sense of humor made it quite interesting, good\nacting and good actors made it a great quality movie. This different\ntime- lines thing worked out great all the while you could connect\ncharacters from the past with the ones seen in previous movies.\nQuicksilver was really amusing, especially when they broke into\nPentagon. I'm always happy to see any Marvel comic adaptation movie and\nthis one blown my mind, thank you X-men!\n"},
{"review": "\nThis film is absolutely amazing. Bryan Singer has done a fantastic job\nand this is in my opinion his best ever film. The cast in this are\nfantastic High Jackman, Michael Fassbender, Jenifer Lawrence, James\nMcavoy, Patrick Stewart, Ian Mckellen, just to name a few but Evan\nPeters really steals the show as he has the best scene of the film and\nyou just want to see more of him and hopefully we do I apocalypse. This\nis so far the best film of the year and in my opinion is the best\nMarvel film so hopefully the rights won't be going back to marvel. This\nis also my second favourite superhero movie only behind the dark knight\nand I think this could be up there with film of the year. 10 out of 10\n"},
{"review": "\nX-Men Days of Future Past is an epic, and emotional adventure filmed\nwith drama and with memorable performances all around, and from so many\ncharacters too. When hearing about the scope of the plot I was a little\nhesitant, because the introduction of mutant after mutant didn't work\nso well in cases such as X-Men 3: The Last Stand and X-Men Origins:\nWolverine which were jam-packed with action but little to no character\ndevelopment or weight behind it, it felt rushed and artificial.<br><br>But the returning director of X-Men and X2, Bryan Singer doesn't overdo\nit at all. The characters all have a role to play with the leads going\nto Wolverine (Jackman) and Xavier (McAvoy). This is not an action movie\nby any means. But when there is action it's really heavy just like the\ndrama - everything in this movie is heavy and epic. The end of the\nworld, both mutant and humankind is what's at stake here and the future\nis a horrible, horrible nightmare that could very well become reality\nif a grief-stricken, young Professor Xavier cannot find hope and pull\nhimself together in time.<br><br>Xavier having to find himself, with the help of his older-self\n(Stewart) as seen in the trailers was a touch of brilliance. An epic\nscene which sent chills up my body. This is why we go to the movies for\nthis kind of roller-coaster experience. <br><br>10/10\n"},
{"review": "\nOkay, so when I saw Captain America Winter Soldier I was like,\"this is\ngonna be the movie of the summer\" and when I saw Days of future past I\nfelt like I have never been so wrong before. This movie simply redeems\nthe X men franchise after the god-awful Xmen 3 and xmen origins\nwolverine. In fact Bryan Singer is back with a Bang with a capital B.\nThis movie takes the franchise to a whole new level. The visuals are\nstunning , the plot is fantastic and so is the acting. James McAvoy was\nawesome in this movie along with Peter Dinklage .I just wish Peter\nDinklage had more screen time. This movie was really worth the money\nand that doesn't happen often. One last thing- Quicksilver. Quicksilver\nis the coolest in the movie, especially in the scene where he rescues\nmagneto and stops all those bullets. For me that was one of the best\nscenes in the history of cinema.Movies like this prove that super hero\nmovies can take the limelight and up till now, this is the movie of the\nsummer.\n"},
{"review": "\nI have been a fan of the X-Men trilogy. Especially the ones directed by\nBryan Singer. And then, I heard that they were going to make an\ninstallment that unites the X-Men and their younger selves. That caught\nmy attention. I loved the cast of X-Men: First Class especially James\nMcAvoy, who brought an outstanding performance. The other cast members\ndid an excellent job portraying their characters. At the premiere of X-\nMen Days of Future Past, I was so excited.<br><br>The movie was spectacular, thrilling, and funny at some points. Bryan\nSinger did an outstanding job. The visual effects and slow motion\nsequences were extremely amazing. The performances of all the\nactors/actresses were outstanding, as well. Jennifer Lawrence, Hugh\nJackman, James Mcavoy, Patrick Stewart, Michael Fassbender were\nabsolutely amazing portraying their characters. Evan Peters was the\nperfect actor for Quicksilver. The story was amazing and very unique. <br><br>All in all, the movie had the perfect combination of visual effects,\naction, drama and some laughs.\n"},
{"review": "\nYou may underestimate this entry even if you overestimate it.\nEmotionally, the story, actors and scenes take you to a place you never\nthought it could go. Whether fan-boy or average movie goer the new\nX-men with Bryan Singer back at the helm keeps you guessing with all\nyour favorite mutants once again like you've never seen them. Hugh\nJackman, who seems to be the face of the X-men delivers as always with\nhis dry sense of humor. Jennifer Lawrence is more a focus in this one\nwhich makes sense. However James MaCavoy steals the show as the one and\nonly Professor Charles Xavier with a great performance you'll never see\ncoming. Not to exclude the rest of the cast, this rivals The Dark\nKnight franchise with a thriller like mentality that you won't wanna\nmiss on the big screen.\n"},
{"review": "\nI had been looking forward to this movie for a long time. The previews\nmade it look so epic and it turned out just so so. I personally think\nFirst Class was superior. I know a lot of people are bashing Brian\nSinger just to bash him but the man ruined Night Crawler and I really\ndon't think he should have been a part of the film and I would have\npreferred it if they had just pretended like the earlier Xmen films\nnever happened and completely started over. They could've still used\nPatrick Stewart and the other actors but just abandoned the story\nlines, which I guess they kind of did.<br><br>They didn't do a very good job of connecting things. There are far to\nmany inconsistencies to list. I think what aggravates me most is how\ndid they fail to tie in the post credits scene to The Wolverine with\nit? I can understand having trouble with movies released almost a\ndecade before they knew they would need to tie things together, but not\nwith a movie as recent as Wolverine. They seriously made James Mangold\ndrop Wolverine receiving his mask and gloves so they could include a\nscene that doesn't even make sense.<br><br>I wanted to see Wolverine take out one of the Sentinels but they made\nit impossible.<br><br>I like Jennifer Lawrence but she shouldn't have been the focus.<br><br>Magneto gaining complete control of the Sentinels was just stupid. At\nmost the railroad tracks he inserted would have simply given him\ncontrol of their movement.<br><br>How is Xmen Apocalypse going to take place in the 1980's if DOFP ended\nin the future? <br><br>I better see Rogue fly in the next one. Hopefully with True Blood being\ndone Anna Paquin will get more screen time.\n"}
]