[
{"review": "\n\nTo all the miserable people who have done everything from complain about the\ndialogue, the budget, the this and the that....who wants to hear it?  IF you\nmissed the point of this beyond-beautiful movie, that's your loss.  The rest\nof us who deeply love this movie do not care what you think.  I am a\nthirthysomething guy who has seen thousands of movies in my life, and this\none stands in its own entity, in my book.  It was not supposed to be a\ndocumentary, or a completely factual account of what happened that night.\nIt is the most amazing love story ever attempted.  I know that it is the\ncynical 90's and the millennium has everyone in a tizzy, but come on.\nSomeone on this comments board complained that it made too much money! How\nlame is that?  It made bundles of money in every civilized country on the\nplanet, and is the top grossing film in the planet.  I will gladly side with\nthe majority this time around.\nOkay, cynics, time to crawl back under your rock, I am\ndone.\n"},
{"review": "\n\nFirstly and foremostly, I am a guy, which (in most cases) means I did not go\n see Titanic to see DiCaprio...although I think he can be a great actor. \n Reading through earlier comments, i grew a bit weary of hearing about lame\n script and shallow characters.  I went to see a ship sink...the plot and\n the characters were, at least to me, a kind of icing on the Cake.  I\n actually think a lot of the characters were done well; that is, by the time\n they die in freezing water, you actually felt a tinge of sadness for them. \n But , by the time Titanic was over, I was sufficiently moved to make me\n tell people that it was a great movie.  Kate Winslet was good, Kathy Bates\n was perfect, Leo was ok (I'll give you people that - I've seen him shine\n like I know he can ... Basketball Diaries, Romeo &amp; Juliet).  But ultimately,\n the Titanic sinks...and it was absolutely stunning.  Bravo to Cameron.  He\n didn't just show us a large ship sinking, he showed us the back half of it\n crashing down on a hundred freezing, drowning people; he showed us a third\n class mother attempting to sing her children to sleep because she knew they\n were all doomed (broke my heart - i cried the most right there at that\n point), he showed people who worked extremely hard to get OUT of the bowels\n of the ship only to be sucked back in when a random window shattered and\n the water carried them on back in...detail.  I like detail in a movie. \n Very impressive job.\n"},
{"review": "\nThis movie re-wrote film history in every way.  No one cares \nwhat anyone thinks about this movie, because it transcends criticism.  Every\n flaw in the movie is easily overcome by the many amazing things the movie\n has going for it.  It is an extremely beautiful movie, and I doubt many of\n us will see anything like it again. I've seen it more times than I care to\n count, and I still become transfixed every time, with a feeling which is\n hard to describe.  One for the ages.  \n"},
{"review": "\n<br><br>I saw this movie opening day and it took my breath away. James Cameron's\nfictional story of Jack and Rose entwined with real life occurances was\nhaunting and absolutely beautiful. He is an amazing director and writer that\nthis movie would not have worked without him.<br><br>Kate Winslet was stunning as Rose and this movie belonged to her as you\ncouldn't imagine anyone else playing this role.<br><br>Leonardo DiCaprio was really good as Jack and  he should have had an  an\nOscar nomination for this role and the ever brilliant Billy Zane didn't\ndisappoint in his role as Rose's fiance Cal. His portrayl of Cal was so evil\nthat despite being an awful person, you couldn't help but feel sorry for\nhim, especially when despite all his doings he loved Rose so much.<br><br>James Horner's music was just as haunting and he always lifts the movie he\nworks on to the ultimate level.<br><br>Kathy Bates was equally impressive in a small role and provided quite a few\nof the laughs of the film. <br><br>Everything from the special effects, to the sets to the costumes were pure\nmagic.<br><br>This would have to be one of the most wonderful films of the 20th Century\nand one that will never be forgotten.\n"},
{"review": "\nJames Cameron's 'Titanic' shares a similar motto to Marmite, \"you\neither love it or hate it\", I for one love this film, yes I know it's\ngot a drawn out romance story, but there's just something about the\n3-hour fill of the film that makes its such a spectacularly emotional\nand beautiful movie. I saw this a lot when I was growing up, this was\none of the films of my childhood, it is truly a powerfully resonant and\nvisually stunning movie of epic proportions. Personally I favour the\nBritish original 'A Night to Remember', but this is a pretty close\ncontender. Winner of 11 Oscars, James Cameron's romantic-disaster epic\nis a triumph of cinema that boasts perfect chemistry between Kate and\nLeo as the lovers bound for tragedy. Many people disregard this film\nnowadays solely because it's become the most popular film ever made\nalongside Cameron's other epic 'Avatar', and whilst 'Titanic' is\ndefinitely not one of my favourite films, it's just so powerfully\namazing and no doubt at all it has once brought a tear to everyone's\neyes. The main aspect I love in this film is James Horner's haunting\nscore that was a key ingredient in the film's success, it is simply\nperfect, too bad Celine Dion had to close this on her awful pop\nversion. Nonetheless, 'Titanic' is a modern classic and a beautifully\nspectacular film that will live on.\n"},
{"review": "\nIt's a crying freaking shame that this outstanding movie's rating has\nbeen dragged down by small people who hate it because it was\nsuccessful. You should be ashamed of yourselves. <br><br>When I first saw it I thought it was the perfect movie, and it's still\none of my favorites 8 years later. It's got sexual tension, action,\nsocial commentary, and the acting doesn't suck. It's even got Bill\nPaxton, one of my top 10 criteria for a great movie. What's so horrible\nabout it that it deserves an aggregate 6.9? The only reason I can think\nof is this perverse habit people have of hating anything that makes so\nmuch money or is otherwise successful that it makes them doubt their\nown worth. That's just sad, and you shouldn't take it out on an\ninnocent blockbuster.\n"},
{"review": "\nThirteen years after Titanic launched and all it takes is the first few\nbars of that haunting music to transport me back to my first time\nwatching the movie in the theater. It was beyond comprehension - the\nentire spectacle and production. I bought the books, read the history\nbooks and found myself immersed in all things Titanic.<br><br>I didn't hurt that my great, great aunt was on the ship and survived.\nIt makes it a little personal for me. In fact, I happen to own one of\nthe only objects in existence that came off of the ship into a lifeboat\nand did not go into the water.<br><br>Love the movie - it still is #1 in my book.\n"},
{"review": "\nI've just had the evidence that confirmed my suspicions. A bunch of\nkids, 14 to 22 put on the DVD of \"Titanic\" on a fantastic state of the\nart mega screen home entertainment type deal. Only two of them had\nactually seen it before. But they all had seen the moment of Kate, Leo\nand Celine Dion so many times that most of them felt they had seen the\nwhole movie. Shortly after the epic started, they started to get\nrestless, some of them left asking the others -- \"call us when the\niceberg appears\" Over an hour and a half into the movie, only the two\ngirls who had seen the movie before, were still there. They started\nshouting: iceberg, iceberg. A stampede followed, they all came back to\nsee the sinking of the Titanic. They sat open mouthed, emitting Ohs and\nfar outs. So, just like I thought when the movie first burst into the\nscene. What is this? One and a half hours waiting for the bloody thing\nto sink but what about the rest of the of it. Dr. Zivagho, for\ninstance, had a similar running time, but think how much takes place in\nthat film within the same period of time. In \"Titanic\" Leo teaches Kate\nhow to spit. Look at the faces and hands of the, supposedly, creme de\nla creme in the first class dining room of the ship. Look at the\nhistorical details, if you can find them. The storyline is so thin that\nthey have to introduce guns and shootings in a ship that is about to\nsink. The real sinking here is of film standards. All the efforts are\nfocus on special effects and opening week ends. The film went on to\nbecome the highest grossing movie of all time so, what do I know?\n"},
{"review": "\nGood Lord. This movie right here, it's a masterpiece. I am not\nexaggerating when I say this. Tonight was the first time I watched\nthis. I watched some parts of it earlier, but I thought it would\nprobably be boring, and that I had better things to do. Tonight I\nwatched the whole thing with my grandmother. I was completely wrong on\nthat. This was the best movie that I've ever seen, and probably ever\nwill see in my entire life. Me and my grandmother were both in tears by\nthe end of it. There were two scenes which made me cry: the part where\nthe orchestra played \"Nearer, My God, to Thee\" and the end when all\nthose perished on the Titanic applaud at the kiss of Rose and Jack.\nThis movie was absolutely amazing and I would watch it over and over\nagain.\n"},
{"review": "\nIt really physically hurts me when i don't see it in top 250 in IMDb's\nlist.I am from India where the general perception of Hollywood movies\nare that they are more action oriented big budget entertaining films.We\nconsider our films to be more emotional and poignant.<br><br>However this movie is the most heart touching story i have ever seen on\nscreen.I could see people's faces with tears rolling down after\ndeparting from the cinema hall.I could hear my father saying \" Never\nknew that these people could make such heart warming movies\".Maybe i am\ngoing a bit too far.But this is my way of paying tribute to the\ngreatest movie ever made.\n"},
{"review": "\nTitanic is one of my all time favourite films. I'm a 24 year old guy\nwho has probably not cried in front of anyone since I was a kid, but\nthis movie plays on my emotions more than almost any other. <br><br>We all know the ship will sink (does that even qualify as a spoiler?)\nbut the build-up to this event - the smugness and over- confidence,\nassurances of it being \"unsinkable\" - tease the audience, almost to the\npoint where you're like 'is it really going to sink?'<br><br>I thought the performances of everyone were magnificent: I cared about\nthe characters and their lives on and beyond the ship. Taking the time\nto introduce everyone and weave their stories together was masterful,\neven beyond the main characters, like Fabrizio and Murdoch the First\nOfficer and countless more. It was heartbreaking towards the end when\nyou see the panic gradually set in, and it slowly descends into total\nchaos. You remember Jack telling Rose all the places he's going to take\nher to and you imagine their love- filled lives together. The Irish\nmother telling her children the fairytale, resigned to their fate. The\nviolinists trying to maintain a spirit of composure amidst the carnage.\nAnd the music! Wow. I cried for all of this. And especially right at\nthe end when you see the photos of Rose's life, knowing she's fulfilled\nher promise and survived, living a full life, probably never having met\nanyone she loved as much as Jack all those years ago.<br><br>Visually pleasing in every way, dramatic, musically astounding, great\nacting and above all a fantastic story make this an undeniably iconic,\nenduring film. A romantic-drama unlike any other. It deserves higher\nthan 7.7.\n"},
{"review": "\nEven though some of the actual events did not occur in reality as\nportrayed in the film, I feel as if the film portrayed the events to\nthe best of their ability. I thought that the film did a good job of\ndisplaying the hardships and diversity between social classes. The\ncharacter's interactions and emotions about the situations and\nconflicts they were faced with were also depicted well. Leonardo\nDiCaprio (one of my favorite actors) and Kate Winslet play amazing\nroles as Jack and Rose, and they do it justice! The connection and\nrelationship between the two is a story in itself within the film as\nwell as the ship's tragedy.<br><br>As a young girl I watched this movie many many times with my\ngrandmother. After watching it so much I became obsessed with learning\nabout the Titanic. To this day I still enjoy doing research about the\nactual ship, the people aboard, the engineers who built the ship, the\naccident, the aftermath, and what is still being found in the bottom of\nthe Atlantic. Eve since I was young I have loved The Titanic. I hope\nyou do too!!\n"},
{"review": "\n\nI believe that Titanic is the most over-rated movie of all time. Its plot\nis\nun-original (boy meets girl, falls in love, than heartbreak), its script is\nun-original and its acting is mediocre. The only reason its #1 in money is:\nThe titanics fame, and teeny bopper girls that watch it over 30 times in\nthe\ntheatre during its release. If everyone only watched it once, it would\nprobably be in 15th or 20th place. Atleast there can't be a\nsequal!\n"},
{"review": "\n\"In every age mankind attempts to fabricate great works at once\nmagnificent and impossible\" - Titanic the musical Like the Titanic\nitself, this movie is a masterpiece that stands the age of time. It\ngives me the shivers every time I watch it. I love this film not for\nthe love story but for the depiction of every passenger on board. You\nsee the hopefulness in every one when boarding, not knowing what awaits\nahead. And you see the tragic horrors unfold as the Titanic sunk.\nCameron portrayed the human condition when everyone fights to survive\nand the social differences very well.<br><br>Considering this is a 1997 film, it's still better than a lot of new\nfilms today, both story-wise and special effects wise.\n"},
{"review": "\nTitanic was massive, and so is the movie. Watched it again, after a\nlong time, still as pure as in 1997.Love, emotions, sacrifices,\ndialogue, screenplay, acting...and, slowly movie will takeover you.You\ncan watch this after a decade too, it will feel as fresh as before.\nKate and Leo is wonderful as Rose and Jack.Movie depict the downfall of\nhuge titanic and evergreen love story of Jack and Rose and James you\nnailed it.And wait a love story cant be completed without a song.\nCeline Dion did a true justice for this movie.Really a\nmasterpiece.Whether you like watching love stories or not, do watch\nthis.I bet you wont get disappointed.Its a must watch before you die.\n"},
{"review": "\nI saw this movie in the theatre's back in 1997 and remembered it as a\nbrilliant movie. The cinematic experience was one of the best of my\nlife even though the story is tragic and very sad. I recently watched\nthis film with my 13 year old daughter. The magic is still there. This\nis still one of the best movies of all time and perhaps the greatest\nlove story of all time. The new blue ray release is fantastic and James\nHorner's score is still timeless. Great job James Cameron...for\nproducing a once in a lifetime film. Leonardo Dicaprio and Kate Winslet\nwere fantastic in this film and both deserved best actor/actress\nawards.<br><br>Don't be afraid to bring this one back out people... its still a\nbeautiful epic that will stand the test of time.\n"},
{"review": "\nTitanic is my all-time favorite film. This film breathed life back into\nthe Hollywood epic. Sadly, many people don't see it as an epic. They\nsee it as a romantic chick flick that only focuses on the love story.\nBut contrary to popular belief, the film focuses just as much on the\nship as it does on the love story. It blends fact and fiction so well\nin a way that you rarely ever see on film. Movies like this are very\neasy to make, but there's very hard to make well and almost impossible\nto make great. It is also probably the most emotional moving film I've\never seen. It's the only movie that made me genuinely cry. It also has\none of the important life morals: only life is priceless and making\neach day count. Although, I do have to admit that the dialogue is\npredictable and at times stilted. But that doesn't stop it from being a\nmasterpiece. Because there is nothing in the film that I would improve,\nI'm giving it a 10/10 RATING.\n"},
{"review": "\nJames Cameron creates a head spinning tale of romance and despair with\nthe characters of Jack and Rose and the tragedy of the Titanic sinking.\nThis movie is still captivating people everywhere over 15 years after\nits original release. <br><br>If one is searching for a solely historical account of the Titanic\nsinking, then this is not the movie for them. While tying in key\nhistorical elements, Cameron has stated that Titanic was not meant to\nbe a historical account but a love story. He does a wonderful job of\ncombining the tragedy of the sinking and the story of forbidden lovers,\nbut some historical events are not included. For example, many\nreviewers ask why Cameron did not include the Californinan shutting of\nits radio for the night. This scene was in fact filmed but then cut due\nto Cameron feeling that \"If Titanic is powerful as a metaphor, as a\nmicrocosm for the end of the world in a sense, then that world must be\nself contained.\" <br><br>However, if you are looking for a beautiful, heart wrenching love story\nwith a historical setting, this is the movie for you. You can't help\nbut to be swept up in the elegance of the period. The costumes and sets\nare lavish for the upper class and realistically drab for those of the\nlower class. The dialogue is excellent, seamlessly creating a beautiful\nstory line. The special effects used along with gorgeous camera work\nproduce shots upon shots of heart stopping images. Winslet and DiCaprio\nhave undeniable chemistry and are extremely convincing in their roles\nof wealthy and poor, respectively.<br><br>Overall, this film is a must see classic for people of all ages. I have\nseen it several times yet I always find something new to be in awe of. <br><br>10/10\n"},
{"review": "\nThis is going to be a short review for Titanic.<br><br>Plot: The plot of the film is really amazing. If you want a three-hour\nlong love story, this is the movie for you. Another movie worth\nwatching is \"A Walk to Remember\", starring Mandy Moore and it is a\nmovie that I have seen and it is spectacular. The entire 196-minute\npicture centers around two lovers: one rich girl named Rose DeWitt\nBukater and poor artist Jack Dawson (portrayed nicely by Kate Winslet\nand Leonardo DiCaprio) as members of different social classes who fall\nin love aboard the ship during it's ill-fated maiden voyage.<br><br>Characters and Story: James Cameron wrote a story that shines out, but\nthe dialogue is very clichéd and cheesy in a few areas. The characters\nare all well portrayed and I give to the two main actors, also credit\nto Billy Zane, who plays Cal, he is the character you want to hate.\nKathy Bates, Bernard Hill, Frances Fisher, Johnathan Hyde, Danny Nucci,\nDavid Warner, Bill Paxton and the late Gloria Stuart, who plays older\nRose in this film and she should have deserved an Oscar.<br><br>Visuals: This is where the movie shines. James Cameron wanted to make a\nmovie about the Titanic and it shows, with it's $200 million dollar\nbudget and he made this movie historically accurate as possible. The\nship's sinking scene is one of the coolest thing they could do with CGI\nand practical effects and it is awesome.<br><br>Sound / Music: The music is awesome and fantastic. James Horner\ncomposed a musical score and he is fantastic. The film's theme song,\n\"My Heart Will Go On\", performed by Celine Dion and I love it and a lot\nof people has did covers of this song and I listen to this version and\nit was fantastic.<br><br>Enjoyment: TITANIC is a good classic, epic romantic disaster film that\nI have no problem watching once in a while. The film won 11 Oscars\nincluding Best Director, Best Picture and Best Original Song. It made\n$2 billion dollars worldwide and it is just fantastic. 10/10.\n"},
{"review": "\n\nYou know those films where you just leave your brain at the lobby and come\nback for it when the movie is finished, realizing you didn't have a good\ntime without it? Like Armageddon?<br><br>Well, this is one of those 'brain-free' experiences. However, this is\nreally\nenjoyable brain candy. OK, so the script could have been better written by\na\nwriter from Sunset Beach, but you have to commend this film for it's good\npoints: Kate Winslet's performance, the historical detail, the sheer\nenjoyability of it all.<br><br>True, the script seems to be the source of all the problems: DiCaprio is a\nfine actor, but unfortunately his character hasn't been written well enough\nfor him to give a performance with any true depth. This also makes the love\nstory seem a little weak, and in the end, unmoving.<br><br>Nevertheless, this is one of the most enjoyable mainstream movies of last\nyear, and definetly worth $7.50 of your money, or if you're British, £4.<br><br>8/10 \n"},
{"review": "\n\nI went to see the film not knowing what to expect. I'm not a fan of romantic\nfilms but everyone had been recommending the film so I went and I have to\nsay it is amazing. An emotional mix of watching while knowing. As Jack and\nRose get increasingly closer you know the fate that awaits and it starts you\nthinking of ways they could have avoided it. It's one of those films that\nremains close to your heart forever.<br><br>Excellent acting from the whole cast, especially DiCaprio and Winslet. Some\nscenes which come to mind include the dining room scene, Rose communicates\nto Jack on a level that the other actors don't even sense, a sentence which\nis echoed on page 95 of \"James Camerons Titanic\" It is a film that will have\nyou hooked and on the edge of your seats. The length helps you to really get\nto know the charecters and connect with them and I hate to admit it but this\nfilm has turned me into an addict.<br><br>I had never heard of James Cameron as much as I do now and I'd just like to\nsay GOOD JOB!!\n"},
{"review": "\n\nCan I just say that Kate Winslet is magnificent in her portrayal of Rose.\nThe emotions she shows in her facial expressions and pitch and tone of voice\nare something to behold. Billy Zane as the dastardly Cal is also quite\nsuperb. Well done to all concerned on the movie, and I wait with eager\nanticipation for the Directors Cut on Video. \n"},
{"review": "\n\nIT WAS REALLY A GOOD MOVIE.IT SHOWS THE PANIC OF THE PEOPLE\nIN TITANIC WHO ARE ABOUT TO DIE AND HOW CRUEL THEY BECAME!\nTHE LOVE STORY PART TAKES AWAY OUR SADNESS TILL JACK'S\nDEATH!\nYOU MUSTN'T MISS THIS MOVIE!IT IS REALLY WONDERFUL!!!\n"},
{"review": "\nThe work done off screen was completely worth it. I suggest you check\nthe trivia of the movie to understand that this movie deserves all the\nOscars it got and more. It is a timeless movie, with strong acting.\nI've heard people complain bout the acting of the main actors, but\nwithout strong acting the movie would have never succeeded as much as\nit did. Leonardo DiCaprio was born for the role of Jack Dawson, he\nmakes the audience fall in love with him rapidly, and not just because\nof his looks. Kate Winslet represents well the role of a young girl in\nneed of freedom. Everything about the movie was outstanding. The\nsetting is a very similar replica too the actual RMS Titanic. It is\nvery realistic since several characters did in fact exist. The special\neffect are great, seeing in 3D must be quite the experience. The music,\nMy Heart Will Go On, also one of my favorite songs. I don't believe\nthere is anything bad to say other than \"Why did Jack have to die?\ncouldn't they write a happy ending? why make people sad when you have\nthe power to make them cry of joy instead? I love you Jack! Rose don't\nlet go of Jack!\" Once you overcome the extreme feeling of sadness and\nanger because Jack was too nice and died, you realize that the movie is\namazing. PERFECT in every sense of the word.\n"},
{"review": "\n\nAs an epic, it doesn't change, even a little, my perception of life. As a\nlove story, I've seen better. However, I have to say - technically - and\nas\nentertainment - Titanic is great. The special effects, the replica of the\nship, and all other technical details are a feast for the eyes. And it\ncertainly entertains, as it never lapses to boredom and although it's over\n3\nhours long, it doesn't really register.<br><br>Anyway, I'd say it is quite worth the watch. Just don't expect it to\nchange\nyour life.\n"},
{"review": "\nYou can watch this movie in 1997, you can watch it again in 2004 or\n2009 or you can watch it in 2015 or 2020, and this movie will get you\nEVERY TIME. Titanic has made itself FOREVER a timeless classic! I just\nsaw it today (2015) and I was crying my eyeballs out JUST like the\nfirst time I saw it back in 1998. This is a movie that is SO touching,\nSO precise in the making of the boat, the acting and the storyline is\nBRILLIANT! And the preciseness of the ship makes it even more\noutstanding! <br><br>Kate Winslet and Leonardo Dicaprio definitely created a timeless\nclassic that can be watched time and time again and will never get old.\nThis movie will always continue to be a beautiful, painful &amp; tragic\nmovie. 10/10 stars for this masterpiece!\n"},
{"review": "\nGreetings from Lithuania.<br><br>I'm a Titanic buff. Read lots of material, watched countless\ndocumentaries about the tragedy. I'm a movie buff as well - and it gets\nme every time i watch this unforgettable piece of work. <br><br>This is a storytelling it's at is best. Visuals are outstanding even at\nthis time, after 16 years - Titanic is aging wonderfully. The actor,\nall of them, did a very strong job, and i loved the two leads. I can\nnot understand why is there so much negative buzz about this film. They\nsay it's to chezee. You can throw a rock in me if you haven't saw more\nchezee stuff years after (Twilight and all the dancing shxx \"movies\"\ncomes in to a mind first). Well i guess lots of people will always hate\nwhat is popular and at the same time really good - and that's a rare\ncombination. Movies like this aren't made every day to say the least,\nand it's shame that so many people trashes them. Well, you can always\njust ignore them. <br><br>Titanic is outstanding motion picture in every possible way, and it got\nwhat it deserved - 11 Oscars, 1,6 milliard at the box office and hardly\nnforgettable journey - it's hardly gets better than this.\n"},
{"review": "\nC+ The best grossing film of all time, until recently that is, but is\nit really the best film ever? Even worthy of getting all that money?\nUpon initial viewing, many probably thought so, but I'm not one of\nthose. It does have its strong suits, and James Cameron has rarely, if\never, failed me. This film stands out as quite different in tone\ncontrast to say \"Aliens', \"T2', or even \"Avatar\". Note the first two,\nf*CK Avatar, use low-key lighting, while this film is just so bright\nall the time. The performances are grade A in this film. Leonardo\nDiCaprio and Kate Winslet are great throughout , and the end sequence\nwas of course astonishing and a leap forward in visual effects.<br><br>My biggest problem with this movie? It over does a love story to the\npoint it hits two hours or so, and then we get an hour more or less of\nepic disaster with tragedy and believable chaos. But the first two\nhours just seem to drag on, quite unnecessarily at that. Along with\nthat, the score was dismal at best. Naturally the only scene to defy\nthis was the \"last song\" instant as it sank. One of the main things\nthat draws me to a film it its score, or sometimes a lack there of.\nSappy romantic themes and an unfitting climax music as thousands drown.\nIt just was distracting and honestly didn't belong there. Overall,\n\"Titanic\" is worth seeing and all, but far from being the best movie\never, or even close for that matter. This a movie where I definitely\nrent the DVD, practically fall sleep an hour or so in, then wake up and\nsay \"what the? Still not yet?\", and then just use chapter selection to\nget to see the climax.\n"},
{"review": "\n\nWhy did James Cameron go to so much trouble making a film that presented the\nphysical and visual dimensions of Titanic and \ntake the human dimensions on a fantasy-romp of titanic-sized contrivances? \nThere are enough historical documents and memoirs\nabout REAL people on that ship who had REAL lives and some\nwere\nactually very compelling.  So why did Cameron opt to give\nthese\nREAL people bit parts and invent two shallow characters? <br><br>Good acting and high production values go a long way to cover up a poor\nscript, and Titanic is proof of that with the Oscar frenzy that surrounded\nit (However, it was the first film in a long time that did not earn a\nscreenplay nomination and won best picture).  Leonardo DiCaprio and Kate\nWinslet both did excellent jobs acting as did Gloria Stuart and Kathy Bates.\n They all deserved an Oscar in light of what they had to work with on the\npage.  How conventional, shallow and contrived does this sound?  Rose is in\nwhat is for all intents and purposes an arranged marriage, but she is really\na free spirit ready to fly away from her upper-class roots.  If it wasn't\nfor her darn mother.  Now to make this issue even more clear, her fiance is\ncontrolling and abusive.  The decision is clear.  She has to fall for Jack,\na fellow free spirit who shows her real love.  Alas, Jack must be\nsymbolically sacrificed so she can avoid being drowned in her life and truly\nfind freedom in the new land.  Not only are the mechanics of the script\nclear, but the story is old and tired.  Titanic works because it plays on\nstereotypical conventions and latent emotions; it does not earn its\nemotional climax on its own merit.  This subject has the opportunity to be\nso much more genuine and powerful if only someone had taken the time to look\nbeyond fictional romance and into true life tragedy.  \n\n"},
{"review": "\n\nTitanic rocks, combining elements of dark brooding drama with all the T&amp;A of\na typical late night cinemax show.  With the president held hostage and\nlocked in a frigidaire 200 feet under the ocean, Scotland Yard calls in the\nhelp of their #1 hit man to save the world.  He is TITANIC, a cyborg soldier\ngenetically altered so that his face looks kinda like a bull when he gets\nmiffed.  When the enemy organization known as D.U.M.B. (Democratic\nUnderground Mob Brigade) finds out, they threaten to destroy the world with\nthe help of their evil underlings, GWAR.  With the plot laid out, the action\nexplodes as our hero fights his way across the world to save the helpless\npresident (played by Lloyd Bridges) and maybe kill a few bad guys on the\nway.  Check this film out.  (Also starring Jake Lloyd, Jake Roberts, James\nSnuka, H.H.Hogan, Tori Spelling, Tom Selleck, Burgess Meredith (as SATAN),\nand Pee Wee Herman (as GOD).\n"},
{"review": "\n\nTitanic is a fairly good movie, but I personally think the historical part\nof the movie seemed to be more touching and overall better then the love\nstory between Jack and Rose. Their relationship seemed to have all of the\naspects that every Hollywood romantic-fantasy has: the two young lovers are\nbreaking the social code to be seeing each other, they're both young enough\nto pass as teenagers..(which, in this film, I think they are) , there is a\nsteamy scene, and it has a touch of tragedy. Well, it's all very predictable\nbut James Cameron did a wonderful job with the story of the ship Titanic. I\nfound that part more touching and realistic than the love story. You really\ncan see the passenger's terror and panic during the sinking sequence. Its\nall very saddening to watch because, as you watch it, you know that it\nactually happened many years ago. The amount of detail put into it was\nincredible, from the \"woman and children first, first class first\" to the\nmusicians staying aboard to play, the fireworks... all very nice to watch.\n\n"},
{"review": "\n\nWatched it on the screen a few years back and could not sleep that night.\nI\ncouldn't stop thinking about the poor people who drowned.<br><br>The plot was not as interesting to me until the Titanic started to sink\nthen\nthe mood started to pick up.  i'm sorry that the characters were too\none-dimensional to make me feel sorry for them when they drowned,  Kept\nwishing i knew more about them before they pulled the plug on the\neverything. . .<br><br>I watched the documentary on cable channel then spurred me on to borrow\nthe\nvideo.  The documentary made me cry more than the movie, amazingly.\nWatching it on video, I could watch the sinking bit 100 times, its the\nbest!\nI just fast forward the whole middle section of the movie and watch the\nstart and ending.  I can truly imagine myself sinking with the thousand\nplus\ndesperate people, the special effects are truly convincing and fabulous!\nI\ncheered for the single lifeboat which went back and wonder what were the\nreal stories of the 6 people whom they rescued?<br><br>I'm very interested in discovering the stories of all the survivors and\nwhat\nreally happened to the people who were on the Titanic because of this\nmovie's attempts to recreate that fatal night.  Thank you!\n"},
{"review": "\n\nI will never understand the common man, and therefore will never understand\nthe mass hysteria over this movie.  I did not care about any of the\npassengers James Cameron took the time to introduce us to.  In fact, we know\nnone of the true heart-breaking tales of the R.M.S. Titanic - only the\nfanciful romantic tale of a spoiled brat and the only American in steerage.\nIt is frightening to me that America embraced this movie without ever\nlearning one bit of true history about the disaster of the Titanic.  5 will\nget you 10 that most of America believes there was such a jewel as the Heart\nof the Ocean.  We already know many fools clamored around the graves of\nanyone known as Jack Dawson.  Most offensive, however, are Mr. Cameron's\ncomments at the Oscars without any regard for the 1523 lives actually lost\non the R.M.S. Titanic.  Life is not a movie, and love does not conquer\nall.\n"},
{"review": "\nBest version since the old \"A Night to Remember\" (1953). With all those\nreviews, I only need to \"touch\" on the synopsis of the film. 101\nyear-old \"Rose\", long thought to have died in the disaster, reappears\nas the wreck is examined and it's contents rescued yet again. The\n\"explorer-scavenger\" is fascinated both with the story and romance of\nit all, but especially the recovery of the romantic 58 Caret\nheart-shaped diamond necklace known as \"The Heart of the Sea\" which is\nworth more than the Hope Diamond. Did such a gem exist, or is it the\nproduct of the screenwriter's vivid imagination? It is a well-told tale\nand the time passes so fast that it doesn't seem like a 3 hour movie at\nall. Superb cinematography combined with seamlessly beautiful special\neffects and the best shipwreck ever filmed. Models and the CGI are most\nconvincing. The Oscar-winning musical score and audio are amazing. The\nships motors and interior looks entirely authentic. Kathy Bates has a\nwonderful \"minor\" role as the \"Unsinkable\" Molly Brown, and, as MGM\nused to say, \"a cast of \"more stars than there are in Heaven\". Billy\nZane plays the deliciously mean and arrogant fiancée of 17-year-old\n\"Rose\",who is being forced to have pre-nupual sex, and marry a man she\ndoes not love, for his money. She hates it and is almost driven to\nsuicide. One nude scene of a beautiful woman-child will offend only a\nminority of the viewing audience. (Rated PG-13. Also a few choice swear\nwords.) Best ending ever (warning-huge spoiler) as \"Rose\" slips the\nhuge blue diamond into the sea. The original DVD is letterboxed and not\n\"anamorphic\". Buy a later version, which is remastered for 16x9 TV. It\nis remastered to 1.78 format. I like to stop it around chapter 18 for\nan \"intermission\". <br><br>I also highly recommend seeing \"Titanic-The Artifact Exhibit\" as a\nroadshow or Las Vegas attraction.\n"},
{"review": "\nBefore Titanic, I wasn't really a Cameron-fan. I liked his movies but I\nnever thought of him as a genius (It was only later that I saw his\nbrilliant remake of the French comedy La Totale! \u0096 True Lies, that is \u0096\nwhich might have made me appreciate his talents more.) To tell the\ntruth, I wasn't really interested in another adaptation of the tragedy\nof the Titanic, either. The movie was over-hyped and overpriced, so I\nthought I'd give it a pass, but I finally gave in to peer pressure. I\nleft the theatre raving about the movie myself.<br><br>It has remained one of my all-time favourites to this day. Titanic is a\ntrue masterpiece that combines a great real-life story with an equally\nheartbreaking imaginary one and has such visual grandeur and emotional\ndepth that very few movies have managed to bring to the screen. It\ndeserved every single Oscar it was given (save for the score, which is,\nfrankly, a shameless and unimaginative rip-off of Enya's music) and it\nshould have been awarded more. It is a shame that Kate Winslet's,\nLeonardo DiCaprio's and Gloria Stuart's stunning performances were\nshunned.<br><br>It is very sad that since then it has become fashionable to dismiss the\nmovie as a 'corny, boring melodrama', because it is anything but.\nTitanic is an impeccably written and directed, wonderfully acted and\n(from a technical point of view) superbly realised, timeless\nmasterpiece. And it has one of the most beautiful lines ever written\nfor the screen. 'A woman's heart is a deep ocean of secrets'.\n"},
{"review": "\nI can't explain how much I like the movie. The work done by James\nCameron is amazing and his best!. Leonardo and Kate have done their\nbest to really make this film a realistic and romantic movie. The way\nall characters blend in is like they are the most excellent chosen\ncharacters for the movie, and they really are!. The directing and\nediting are also at their best. James Cameron has mixed reality and his\nfiction story and made the finest romantic movie. It is so much amazing\nthat every human in this world cries at the end. And we can't forget\nsongs. The song of this movie is best romantic movie and saddest song\nof the world. Simply a masterpiece by Celine Dion. Everything of this\nmovie, the directing, songs, acting, editing, are masterpieces in movie\nindustry and every one believe that. No one can deny it.\n"},
{"review": "\nTitanic may be a spoiled little drama. But it's the most astounding,\nwonderful romantic movie I've ever known.1st half is a bit boring. And\nyou may feel this movie is crappy at times. Also, the love story\nbetween the lead couple isn't mentioned fully.But, from the I'm flying\nscene, the story gains momentum. The 2nd half is spectacular and by the\nend, it leaves the viewers crying. The most emotional movie ever,\nTitanic gives you an experience which no other romantic tragedy could.\nIt is the most magical, poetic and picturesque piece of romantic movie\nwork. Hats off to you Cameron, for creating an unforgettable drama of\nemotions, trust, love, ambitiousness, endurance, survival and of all,\ngrief when lose the one you loved. I love you Titanic. I'll never let\ngo of you Titanic. Never let go.\n"},
{"review": "\nI know it's been over 10 years since this movie but I recently watched\nthis on blu-ray and just felt like reviewing \"Titanic.\" I am not really\na big James Cameron fan, I only like three of his works. But, \"Titanic\"\nis his masterpiece. He takes the tragedy of the ship and puts a love\nstory spin on it. I like this aspect of it, especially when you know\nwhat the outcome of Titanic is. The viewer gets the happy feeling of\nJack and Rose falling in love and the entire time you are wondering how\nthings are going to turn out for these two. The way this movie is shot\nis nothing short of perfect. The destruction of the ship, the chaos\nthat ensued and how the people felt both on and off the ship. It makes\nthe viewer feel like they are there and can feel how the passengers\nfelt. \"Titanic\" invokes every human emotion and that is really rare in\nmovies today. James Cameron was able to do the impossible with this\nproject and carried away 11 Oscars. Simply extraordinary. \"Titanic\" has\nbeen loved and enjoyed for nearly 15 years and will continue to be\nloved and enjoyed for many more.\n"},
{"review": "\n\nThe story of the love between two people from entirely different worlds.\nWhy\nis this movie called \"Titanic\"? This is a love story, and the plot has\njust\nabout nothing to do with the ship itself, Titanic is just the set. The\nplot\nis not that bad, but there's nothing special about it, the same story has\nbeen seen a million times. Some of the actor/actress performances are very\ngood, and director James Cameron does an exceptional job. But good acting\nand direction do not make a great movie without a great script. Why this\nmovie was such a grand hit, I can't tell. Maybe it's the effects, maybe\nthe\nacting, maybe even the music, who knows. Titanic is a pretty good movie,\nand\nwatching it is not a waste of time, but the fact remains, that the movie\nis\na thirteen-a-dozen-type of love story.\n"},
{"review": "\n\nWhile the effects and acting were good I couldn't help but be disappointed\nby the cliched story.  Poor boy meets rich girl and everyone, from the\nboyfriend and his henchman (over-the-top villainy if ever I've seen it) to\nthe snobbish mother, is desperate to stop them.  Come on - the ship is\nsinking and there's time for a chase scene complete with\nshooting!\nWe've seen this story a hundred times, only the set (a good one at that)\nwas different.\n\n"},
{"review": "\nWhat a wonderful film. James Cameron done a brilliant job bring this\nhistorical event to life. Everything was perfect, the timing of the\nfilm, the effects , the cast can't fault Cameron. You couldn't of asked\nfor any better actors/ actress to fill the main two roles Leo and Kate\nhave some much chemistry on film and you can feel the love and\nheartbreak between them outstanding acting. The fact this film is based\non true even gives you that extra edge that you wanna see the film\nmakes you feel the pain that actually happened. The number of awards\nsays it all for this film. One of only two films along with Avatar to\ngross over 2billion incredible. If anyone has not watched this film\nthey are missing out it is purely just a cult film. People off all ages\nlove this film, male or female too. The thrills, love, heartbreak,\nexcitement will draw you in to the most amazing love and historical\nfilm to ever hit the big screen. MUST WATCH FILM!!\n"},
{"review": "\nI enjoyed this movie!! it was very well directed and the cast were fun\nto watch!I enjoyed this movie!! it was very well directed and the cast\nwere fun to watch!I enjoyed this movie!! it was very well directed and\nthe cast were fun to watch!I enjoyed this movie!! it was very well\ndirected and the cast were fun to watch!I enjoyed this movie!! it was\nvery well directed and the cast were fun to watch!I enjoyed this\nmovie!! it was very well directed and the cast were fun to watch!I\nenjoyed this movie!! it was very well directed and the cast were fun to\nwatch!I enjoyed this movie!! it was very well directed and the cast\nwere fun to watch!I enjoyed this movie!! it was very well directed and\nthe cast were fun to watch!I enjoyed this movie!! it was very well\ndirected and the cast were fun to watch!\n"},
{"review": "\n\n Sorry to pour cold water (if you'll forgive the fun) on this Oscar winning\ntribute to the programmers art, but this film is too long, too wooden and\ncaptures the atmosphere of Edwardian England to the same degree as Dick Van\nDyke mimics our accent. I have no doubt that the special effects are very\nclever and took people an awful lot of hours and megabytes...but where do\nthey take us? A computer generated ship with generated seagulls looks\nexactly that. The sets are spectacular yet manage to scream out that they\nare expensive sets rather than that they are the inside of a living working\nship. And don't get me started on the levels of my indifference towards the\ntalentless Mr.DiCaprio who bestrides the film in the same way as most\nchildren do when stumbling into a grown-ups party. Watch A Night To Remember\nif you want to feel the real emotion of the Titanic's sinking and watch this\nif you want to spend three hours seeing Mr.Cameron trying to show us how\nclever he is...and failing.\n"},
{"review": "\nTitanic is exceptional. This is what a real film is all about. The love\nstory topped the icing on the cake for me, It's increasingly sad and\nall the while you still know what's the come. It's a real treat to be\nable to watch, the theme of the film is self explanatory; however there\nis so much to it. Regardless whether the love story is true or not, it\ndoesn't matter because without this it would not be as emotionally\ngalvanising as it is. It's astounding. It's obvious that Jack dies at\nthe end and Rose is very upset. It's a brilliant film, def a classic!\nHighly recommended to anyone looking for something to weep at for days!\nEnjoy.\n"},
{"review": "\n\nI'll tell you what bugs me about this film.<br><br>DiCaprio's pals were Irish.\nThe dancing was Irish.\nThe music was Irish or had an Irish feel.<br><br>I just got the nagging feeling that the DiCaprio character was supposed to\nbe Irish too (but they chose a popular 'pretty' face for the male lead just\nin case). This nagged at me all through the film. It nagged me again when we\nwatched the video....<br><br>Anyway... enough of this. Here is the spoiler....<br><br>It sinks.<br><br>\n"},
{"review": "\nIf you are an intellectual, overly-critical person, don't watch this\nmovie. It's not a documentary; it's a romantic drama. So what is it's\nnot historically accurate? That's not what you should be focusing on.\nThis is the story of two lovers and the challenge they face to survive.<br><br>Kate Winslet gives the performance of her career (tied with The\nReader)as Rose DeWitt Bukater, the young woman trapped in the\nsuperficial world of the upper class and engaged to a man she loathes.\nKate IS Rose; this role was practically written for her.<br><br>Leonardo DiCaprio became a star for his role as the dashing Jack\nDawson, a poor artist who falls for the beautiful Rose. It is he who\nsaves her from her misery and opens up the world for her.<br><br>The chemistry between Kate and Leo is almost tangible. As the audience,\nwe become captivated by their love affair. We wanted them to be\ntogether. They're the ultimate movie couple! So if you can't appreciate\nthis movie the first time, watch it again. And again.\n"},
{"review": "\nApart from Titanic being one of the best movie ever produced it is also\nthe second highest grossing movie of all time as well. A movie does not\nmake $1.8 billion dollars world wide with out being incredible\nbrilliant.<br><br>Titanic is more than just a movie about a ship that sinks its a classic\nromance love story about a rich girl and a poor boy. An unspoken love\nthat could never truly be. The rich girl who is trapped in her high\nclass elegant lifestyle forced to marry a wealthy man who she does not\nlove. Then by happenstance she runs into Jack Dawson and their love\ndevelops from there.<br><br>The acting is magnificent. The movie was very well written and no\nexpense was spared in bring Titanic back to life. Everything looks as\nelegant as it would have on the real Titanic. Parts of the story may be\na bit cliché yet the movie is still very enjoyable.\n"},
{"review": "\nThis film is about a love triangle that happens on the Titanic. The\nTitanic, the ship of dreams, is also known as \"The Unsinkable\". Rose\nleaves her rich fiancé Caledon Hockley for this poor artist, Jack.\nHowever, the Titanic collides with an Iceberg and sinks on April 15th,\n1912 at 2:20 in the morning. Surprisingly, Jack dies and Rose survives.\nEighty-four years later, Rose tells the story about her life on Titanic\nto her grand daughter and friends and explains the first sight of\nJack-how she fell in love and how they fought for survival.<br><br>The theme of the movie is that love is worth more than material things.\nCameron uses real actors that some people believe is based on a true\nstory. Written in 1912, the dialogue is appropriate for the time\nperiod. Located in the Atlantic Ocean, this movie was actually based on\nsome real occurrences. The film's soundtrack made the movie more\nenjoyable, especially the song by Celine Dion \"My Heart Will Go On\".\n"},
{"review": "\n\nWatching 'Titanic' was like having 2 people wrestle with a remote channel\nchanger. Just when the movie becomes (historically) interesting, the other\nperson grabs the remote and switches it to a pedestrian daytime soap opera.\nDid Kate have to be on hand at every step that led to the sinking? (her and\nLeo are on the side of the deck where the ice hits, of course, JUST missing\nthem; OH! let's put her next to the Captain when he learns Titanic's fate\nand lack of life boats). The tragedy was story enough and James Cameron did\na brilliant business decision to shove a pre-teen love opera to the\nforeground so girls could flock to the theater over and over to see Leo\nalive again and again and again...! Give the channel changer back so we can\nplease continue with the story of the ship. Yes, I heard some crying when\nLeo sank into the abyss...But no sniveling when the little boy (who Leo\ntries to rescue before the boy is grabbed away from his panicky father) is\nswept away by the flooded corridor. So much for crying\npriorities!!<br><br>I'm a big Cameron fan! Titanic has left him permanently wealthy. And he's\ntapped into a genre the same way Lucas tapped with Star Wars in attracting a\nselect category of people that were willing to see this over and over\n(Titanic's billion dollar revenue was the result of many repeat viewings\nworldwide combining history with poster boy imagery).<br><br>Special effects were brilliant! But I'll take the 1958 black and white \"A\nNight To Remember\" movie instead.<br><br>Today's lesson: If you're going to use an ax to free someone shackled with\nchains, don't aim, close your eyes tight, THEN swing hard so you won't see\nthe spraying blood. This is life and death...better leave it to\nluck!<br><br>7 out of 10\n"},
{"review": "\n\nTitanic does not deserve all the praise and awards it has received. The\nlove-story is simple, the characters cliched and the screenplay has many\noversights.<br><br>However, it is impossible to deny the power of the film once the iceberg\nhits. The detail in the reactions of different characters to their\nimpending\ndeaths, how fate conspires against those who worked hardest to stay alive\nand the emotional impact of the thousands of deaths almost make up for a\nstupid opening hour and a half.<br><br>The last shot of the film, a camera moving through the titanic and into the\ndining room, where all the ship's dead victims have gathered, is\namazing.\n"},
{"review": "\n\nWhy does this movie suck so bad?  More importantly, why did it win an oscar\nfor among other things, best picture?  There are so many holes in the\nfilm's\nplot, the villian is similar to one in a Rocky and Bullwinkle cartoon (I\nwas\nwondering why they didn't give him a mustache which he could rub between\nhis\nfingers), the long sweeping shots of the ship look horrible, the script is\nlame and filled with cliched action movie lines and all of the scenes\ntaking\nplace in the present day are worthless and have no place.<br><br>First, if Rose is telling this story from her perspective how is it\nthat\nshe knows what her fiance is always planning?  How does she know what the\ncrew of the ship is talking about before and after the iceberg hit?  How is\nit that she knows how exactly Jack got on the ship or what he talked about\nwith his friends onboard?  You get the idea?  Now many movies have this\nproblem, but not a best picture winner.\nSecond, the villian who's name escapes me.  He was so cliched.  So evil\nit was funny.  He's like Travolta in his new horrible film.<br><br>Third, the fly over shots of the ship look like garbage.  They are so\nobviously fake, all the people appear as black, lifeless silohoettes\nwalking\nthe ship.\nFourth, the script.  How did these horrible lines that Jack utters get\nin there?  When danger is afoot, no matter how great all he can utter is\nhis\nbest Keanu Reeves impersonation.\nFifth, what is the purpose of showing us the salvage crew?  Who gives\nwhat these idiots are thinking or doing.  It further complicates things.\nWhy would these people believe an elder Rose just because she says she is\nthe one in the picture.  Anyone could call up and say that.  If they cut\nthese parts of you have a much shorter film.<br><br>I HATE THIS MOVIE.<br><br>L.A. CONFIDENTIAL WILL ALWAYS BE 1997 TRUE BEST PICTURE\n"},
{"review": "\n\nNot often you see a film where the leading man is prettier than the\nleading\nwoman. The best performance in it is from Gloria Stuart as the old woman.\nDavid Warner does a very good impression of Leo G. Carroll. Kathy Bates is\nimpressive and so is the ship. I found Dame Kate and Leonardo thoroughly\nuninteresting.\n"},
{"review": "\n\nSure, Titanic was a good movie, the first time you see it, but you really\nshould see it a second time and your opinion of the film will definetly\nchange. The first time you see the movie you see the underlying love-story\nand think: ooh, how romantic. The second time (and I am not the only one\nto\nthink this) it is just annoying and you just sit there watching the movie\nthinking, When is this d**n ship going to sink??? And even this is not as\nimpressive when you see it several times. The acting in this film is not\nbad, but definetly not great either. Was I glad DiCaprio did not win an\noscar for that film, I mean who does he think he is, Anthony Hopkins or\nDenzel Washington? He does 1 half-good movie and won't do a film for less\nthan $20 million. And then everyone is suprised that there are hardly any\nfilms with him in it. But enough about, in my eyes, the worst character of\nthe film. Kate Winslet's performance on the other hand was wonderful. I\nalso\ntink that the director is very talented to put a film of such a magnitude\ntogether.\nThere is one lesson to be learned about this movie: there are too many\nlove-stories as it is, filmmakers shouldn't try to add a crummy romance in\nto every single movie!!!\nOut of a possible 100% I give this film a mere 71%.\n"},
{"review": "\nOK, i don't know what everyone else was thinking while voting, but i'd\nsure like to voice my opinion...loudly.<br><br>1. i'm very disappointed with the limited recognition this beautiful\nmovie has on IMDb. i would expect more from movie lovers.<br><br>2. it's very hard to find a movie that all ages can enjoy with comedy,\ntragedy, truth and love. which Titanic clearly delivers.<br><br>3. acting was outstanding, not to mention the unforgettable music and\neffects.<br><br>Titanic, in my opinion, is a milestone in leo's and kate's careers.\nMany of the scenes in the movie stay with you after you've watched it.\nNot just the tragedy or romance, but the vast gap presented amongst the\n'rich' and 'poor', who are treated in proportion with their money. I\nabsolutely love this movie.\n"},
{"review": "\n\nIt's the love of your life &amp; you're going to just let him freeze to death\nwhile you lay sprawled on the door?<br><br>Incredible.\nCouldn't believe that part.\nUnbelievable.\n"},
{"review": "\n\nSpecial effects not withstanding, I found the film a little hard to like.\nThe scenes on the research vessel wern't too bad, but the roles of Kate\nWinslet and Leo Decaprio were a little far fetched. Any well educated first\nclass women would have found a better way to cope with the boredom of her\nlife than live with a steerage class passenger. In those times, you'd have\nbeen a fool to give up your high status. The attraction between Rose and\nJack is too '90s like. \nIn addition, not enough effort is spent on the real passengers. Its as\nthough they're mearly part of the background. And they're treated as such\ntoo. Not enough effort went into making them believable.<br><br>What really gets me is Leo's line after he overhears the conversation\nbetween the officers discussing the iceberg damage: \"This is bad.\" Well\nduh!\nIt might have helped if Cameron had watched A Night To Remember. He could\nhave taken some clues from that film, which truely follows what happened. In\nfact, Cameron could have made a modern, special effects packed adaptation of\nthe original movie. Then, Titanic could have scored even better without the\nphony love story that it concentrates on. \nWhile Titanic is a fine piece of work, like the real ship, there was still\nroom for much improvement. \n"},
{"review": "\n\nThis movie had it's themes backwards: the part about the Titanic itself was\nincredibly well done, and very suspenseful.  However, the love story was\nmore predictable than the story of the ship.  It was the stock love story,\nwhich has been beaten to death over the years.  Leonardo Di Caprio gave an\nun-convincing performance which destroyed the movie even\nfurther.\n"},
{"review": "\n\nBest film ever, most certainly not. Best film of 1997, again not in with a\nchance. I have to report that while watching \"Titanic\" I found myself being\ntotally bored by the stereotypical charecters, i.e Snobbish English,\nBattleaxe American. Cameron has also reeled out loads of cliches and made\nthem 10 times more boring. There is also an undertone of class struggle\nwhich is direly executed. As for \"Titanic\" being called a love story, that\ncould never be said as there was no chemistry between the two leads and to\nme no feelings of love came across (James try watching other Oscar nominee\nAs Good As It Gets for a decent love story). As for the tragedy that was\nTitanic in the film I did not feel as though the tragedy was fully put\nacross and I left actually feeling numb from this glamourised dross. How\nthis truly terrible film managed to get the Best Film Oscar is beyond me (As\nGood As It Gets a much better and beautiful film) and how Cameron got the\nBest Director award is unbelievable although is unsurprising when people\nlike Martin Scorsese do not get an Oscar for films such as Raging Bull, \nGoodfellas and Mean Streets.   \n"},
{"review": "\n\nThe ship looks great...breaking up looks great...sinking looks\ngreat...<br><br>They left out mega-important things like the \"Californian\", a ship which\nsupposedly was only a few 100 yards away but had cut the wireless\nlink...<br><br>And why was it necessary to include this rubbish storyline regarding Jack\nand Rose (ice-fishing in a lake that DIDN'T EVEN EXIST UNTIL\n1920)...<br><br>Therefore it gets 6 out of 6 for it's detailing of the ship and 0 out of 4\nfor the storyline that was invented.\n\n"},
{"review": "\n\nThe movie portrays First Officer William Murdoch in a way that is totally\ncontrary to the truth but instead suits a particular propagandist position.\nThis is both immoral and grossly hurtful to Murdoch's descendants. No wonder\nthe Chinese government recommended the movie to their people. It amazes me\nhow modern American filmakers seem to delight in tearing down the society\nand values they have grown up in. The film is an insult to all those\npassengers and crew who showed such tremendous courage in the face of a\nhorrific death. In reality it was NOT two 90's style teenagers who were the\nheroes of the Titanic.\n"},
{"review": "\nThe movie is a total perfection.When it appeared back in 1997 and i\nwatched for the first time it leaved an influence on me what no other\nmovie had. Maybe The Lord Of The Rings ,maybe not :), that movie is\nanother greatness of the film-making.<br><br>Coming back too Titanic with the record $1,835,300,000 Worldwide Box\nOffice that is still no.1 after 11 years is amazingly great.<br><br>I cannot understand the users of IMDb because this movie is not in the\ntop 250 movies . That is shame ,this movie it is at least in the top 5\ngreatest movies ever not too mention in the top 250 .A movie at least\n8-9 out of 10 ,IMDB USERS!!! Wake Up and see the movie again because\nyou seen something else. I cannot find another top with movies\nsomewhere else where Titanic is not included.<br><br>The movies prior theme beside the ship's history is the greatest human\nfeeling :love what is universal and timeless.The picture presents us\nthe meaning of true love. Our main characters Jack the poor artist and\nRose the rich girl from the first class made us all cry even if we\nwilling too recognize or not.<br><br>Inn all lines the movie makes us think if we can go further after\nloosing the the most precious person in our life.We'll we can go on\nbecause life must goo on but it will remain in our hearts forever. <br><br>With no doubt this is the best movie directed by James Cameron, among\nhis other great achievements. James Horner's soundtrack is simply\nbeautiful and completely matches with the movie ,there is no surprise\nthat his soundtrack album has been sold with 30 million copy's<br><br>The movie is the greatest achievement in cinema ,it is the top of the\npyramid...\n"},
{"review": "\nOne of The Best Movies At All The Times there are great scents at this\nmovie and really this is more than a movie.<br><br>it has an excellent score and song.they are so deep.<br><br>also titanic has won 11 Oscars in 1998 Leo and Kate played very good at\nthis movie.<br><br>also Kate Winslet is very beautiful actress.<br><br>the start and end of this film was very good.<br><br>the scent of jack's death was so deep.<br><br>in my idea 14 Oscars nominations and 11 wining was worthy for titanic.<br><br>absolutely it was the best movie of James Cameroons.\n"},
{"review": "\nThis movie is *pitiful.* It is *abominable*. In terms of dung heaps, it\nis second only to \"Superman Returns.\" That's not a very honorable\nposition.<br><br>Why do I hate \"Titanic,\" you may be wondering? Here's a list. 1)\nLeonardo di Caprio's performance as the lovable but down-on-his-luck\nguy could have been played better and more realistically by Paris\nHilton. 2) Kate Winslet's fake American accent is the least of the woes\nleft by her whiny, I'm-a-poor-widdle-rich-girl turn. 3) James Cameron\nshould automatically be disqualified as the director of any real\nhistorical tragedy, because he makes us care more about the prettiness\nof the ship than the victims. 4) Where James Horner's music fails to\nnauseate (he was really off his game here), you always have the classic\nfallback: Celine Dion's mess of a theme song.<br><br>Those are the top four reasons-- I could write a 52-page essay on why\nthis movie is so horrid, but IMDb doesn't provide reviewers with that\nkind of space, so I'll condense it a wee bit.<br><br>If you want to watch a disaster, this film is perfect... and I'm\nreferring to the debacle of the film, not the Titanic incident.\n"},
{"review": "\n\nEvery ploy that can be used in the movie IS used and intelligent and\ndiscerning moviegoers, expecting a good movie (considering how much Cameron\nwas given to make this thing, we had every reason to expect that it would be\nGOOD), are consigned to the fiery pits of hell for three hours.  Whenever\nBilly Zane came onto the screen, I felt like I was expected to bristle, hiss\nand boo.  Likewise whenever Kate and Leo appeared, I was supposed to sigh,\nsniff back a tear and reach for the hand of the person closest to me, even\nif I didn't know them.  Their tragedy became OUR tragedy.  Puh-leeze!  This\nmovie had all the subtlety of being slapped in the face with a frozen\nturkey.  The poor boy-rich girl plot and verbal fireworks were done much\nbetter with Han Solo and Princess Leia.  At least those two did something\nheroic, like saving the galaxy!  The same can't be said for Leo and Kate who\nconfined their action to the back seat of a car.<br><br>I've tried to watch it again and I can't.  I wanted to give it another\nchance and it just didn't work.  James Cameron just can't direct anything\nbut sci-fi and even then he doesn't hit the mark all the time.  The ending\nof The Abyss is anticlimactic and improbable, much like the entirety of\nTitanic.\n"},
{"review": "\nThis movie was the most disappointing case of over-hype ever! Could a\nplot be any flimsier? Could characters be ANY more cardboard? Could you\nimagine a more pathetic excuse for \"chemistry?\" <br><br>Imagine every cliché EVER CONCEIVED, combine them with a big ship\nsinking on a zillion dollar special effects budget, throw in\npseudo-diva Celine Dion's lame tune and you've got \"Titanic.\"<br><br>God, I wanted Leonardo to die! He's the overdone tragic poor boy\n\"artist\" (this gives him an excuse for the drawn-out (no pun intended!)\ngratuitous nude portrait scene of Kate Winslet later - really. That's\nthe only reason he's an \"artist\").)<br><br>All the rich people are bad! (Except her, of course. She's supposed to\nbe redeemed from her wealth by her \"love??\" for him.) But there's zero\nchemistry - nudity and (God, how tacky!) fogged-up windows.<br><br>Consequently, all the poor people are good!<br><br>Thank you, Titanic, for simplifying the goodness or badness of any\ngiven individual simply by their financial statuses!<br><br>I wanted everyone to die. It's the only way to justify the lost hours\nof my life that went into viewing this pathetic work of pseudo-art?\nLifetimey \"based on true incidents\" crap.<br><br>Really, don't bother. It's not a timeless classic; it's dumbed-down\nfaux romance in the midst of tragedy drivel. Spend money on the script,\nnot the special effects, for God's sake! This is worse than a Lifetime\nmovie of the week. I've seen after-school specials with more depth.\nInfomercials, even!\n"},
{"review": "\nThere is a lot of obvious hype associated with this film. Let's just\nface it, though, the main reasons why anyone would watch it would be\nfor Leo and Cate, who are not necessarily the best actors in this film.\nI'm not saying they're not good actors, I'm saying they stunk in this\nfilm. The special effects were decent (and I will say the film makers\ndid a good job making the ship eye-pleasing), but IT even has several\nmajor flaws. For instance, right before the ship goes under, you can\nsee an unfinished blue-screen image behind your main characters.<br><br>Don't get me wrong, I LOVE the story of the REAL Titanic, but I find\nthis movie an insult to that story. Editing was atrocious--there's no\nreason for any film to be over 2 1/2 hours (with the exception of MAYBE\na biographical movie), and the writing and screenplay was horribly\nstilted.<br><br>I will say that the music was perhaps better than I could have\npredicted (and not just the \"My Heart Will Go On\" song either). There\nis one scene that stands out to me when the ship is sinking and\npounding bass music is heard. That could very well be the highlight of\nthe film. As for the mood throughout, it was extremely dull. I was more\nrelieved than sad when Jack died, which I know cannot be what the\ndirector intended.<br><br>In a nut shell, I find it horrible that they turned the beautiful story\nof the Titanic into an over-hyped chick flick.\n"},
{"review": "\nTitanic is an American epic,romantic and drama film. It's was written\nand produced by James Cameron in 1997 about a boat in 1912 to be more\nprecise,Titanic was a British boat that sank in the Atlantic Ocean in\nthe early morning of 15 April 1912 after hitting with an iceberg during\nthe travel from Southampton to New-York City. This boat caused the\ndeath of more than 1506 people.The film is a global success and\nreceived 11 awards and elected Best film.The film tells the story of\ntwo passengers in love on the Titanic. Their love story began when Rose\nwanted to commit suicide but Jack, a poor vagrant dissuaded to do this.\nThey lived love story but it became a nightmare because of tragic\nadventures. People don't understand why Rose left down Jack . They\nthink Rose should have let Jack get on board the raft,they think she is\nselfish. But even if the film end is tragic ,it is better because it is\nmore emotional.The true story is a sad story, no after possible so the\nlogic want Titanic to be the first and last film with the same\nname.Thus end is horrible but another screenplay will be greatly less\nbreathtaking.We love like that,this incredible and timeless\nfilm,Titanic that pushed all of us to cry.\n"},
{"review": "\n(WARNING: may contain some SPOILERS)<br><br>I'm a child and I absolutely love this movie. At my school I am\ncriticized for loving Leonardo DiCaprio and Kate Winslet in this love\nstory. In the past year we lost an amazing man and terrific film\ncomposer. I had been a fan of his since 2009, the first time I had seen\nthis movie. James Horner was an amazing man who could make your heart\nache from the very first note played to HIS final coda. <br><br>The love between Leo and Kate's characters is heart breaking and\ntragic. I had been an avid lover of titanic and decided that I should\nwatch the movie and I instantly fell in love with the whole story. <br><br>I may not be in love with the movie now as I was then but I still enjoy\nwatching it even though it gets harder each time in the months that\npassed since James Horners death in June 2015.<br><br>I know people criticize Céline for the song but in my honest opinion I\nthink the collaboration between her Horner and Will Jennings was the\nbest collaboration ever. The song, which has been one of my favorites\nfor a long time, really hit the tragic love story on the mark. The idea\nthat two people can meet in the oddest of circumstances and make love\nhappen is really extraordinary.<br><br>Jim Cameron really hit the mark with this movie. Sure, there may be\nsome historical inaccuracies, but you shouldn't hate on the man for\nbeing fascinated with something that the world has been fascinated with\nsince her sinking in 1912. Many movies had been made on the ship and\nhit more of the actual historical accuracies but this one really takes\nthe cake.\n"},
{"review": "\nFrankly I don't care what cynical people say about Titanic whether they\nsay it's overrated or it's too long or it didn't deserve to be one of\nthe highest grossing movies of all time or it didn't deserve to win 11\nOscars. I mean I'm a guy and I'm not ashamed to say Titanic moved me to\ntears and is one of my favourite movies. There is a reason why it won\nBest Picture at the Oscars as well as many other rewards. <br><br>It takes the tragic story of Titanic and mixes with a classic love\nstory as well as adventure and some horror and turns it into a film\nthat is so beautiful to look at. Leonardo DiCaprio as Jack Dawson and\nKate Winslet as Rose DeWitt Bukater make such a wonderful and beautiful\ncouple and act their parts perfectly. The movie is also brilliantly\ndirected by one of my favourite directors, James Cameron and this is up\nthere with his other masterpieces like Avatar, Terminator 2 and Aliens.\nNot to mention the music matches well with the movie thanks to the work\nof James Horner's score especially with the love scenes. <br><br>But even a movie as sad and tragic has a happy ending. Like I know\npeople didn't like how it ending or thought it was confusing but I mean\nit actually that old Rose died in her sleep and she's with everyone who\ndied on the Titanic, including Jack of course. So in conclusion, if\nyou've never seen Titanic and you like movies, prepare to have a new\nfavourite movie.\n"},
{"review": "\nThe greatest film in the history of mankind, the most engaging love\nstory ever made, this film has mesmerised me like no other on the face\nof earth. After watching once in childhood I watched this on again at\nthe very start of 2011, and have ever since watched it a thousand\ntimes. I am such a huge fan of this film that I have even dedicated a\npoem to it, consisting of 53 verses (a shame I have never shared it\nonline fearing plagiarism, a fear quite justified given the number of\nfans it has online). I also watched it at a cinema when it was released\nin 3D, on the 14th of April 2012, either hours or a day short of the\ntragedy's 100th anniversary!<br><br>Each time I watch this film I tend to stay quiet a few hours afterwards\nand usually have that heaviness in my voice; it just affects my like no\nother film can. Just to avoid looking like an emotional fool, I usually\nstart a conversation with anyone who happens to be sitting next to me\nso that I don't end up being in tears at the scene when Jack dies.<br><br>The great thing about the love story was the joy that you so felt for\nthem. So many hurdles stood in their way, there were so many things to\nfear from, yet they bore every hardship simply looking into each\nother's eyes. It is one great display of what the power of love is and\nwhat love can make us do. They way they rescue each other from one\nsituation to the other, and the way the whole story builds up, and that\nonce in a lifetime tragic ending scene, it is masterly work by James\nCameron.<br><br>Besides that, the whole depiction of the way the ship sinks, the horror\nin the end, the way the people die by either 'slipping' from it or in\nthe freezing cold, the panic shown at the time it hits the iceberg, all\nof it is pure brilliance!<br><br>Lastly, it should not at all be criticized for not being historically\naccurate, as for that you better watch a documentary film. They had to\nput up a build-up to the disaster that it was.\n"},
{"review": "\nThe movie of Titanic came out in 1997. And then was an Oscar award\nwinning. The director is James Cameron. And the actors is Leonardo\nDiCaprio as Jack and Kate Winslet as Rose. This movie is love story.\nThe Titanic was a ship that sank in 1992. It reorganize show film. When\nplay \"My heart will go on\" song that will impress the movie, and then\nthe love feeling. 3 hours long time, and then my watching is very\nromantic every plots, what is follow next plot. For example, Rose was\nflying in ships beside, that audiences were touched my heart by this\nshot. And then the scenery of breaking dawn is beautiful and wonderful.\nEvery girl want instead of Rose that is romantic plot. Second, the\npassengers confused around the ship after the Titan crashed iceberg,\nunless musicians played on \"Wedding Dance\" so quiet. The shot was\nsatirized by this gimmick point.Discussing technology, the titanic used\nmodel ship, which have shoot really effect. The passengers fall down\nand slide on the floor after the titanic was sinking in the ocean. The\ntechnology is very amazing in 1997, that isn't easy play on video. So,\nthe video is a big making that appreciate the director designing, and\nthen the plot had a nervous environment.The movie is my favorite. Jack\nand Rose is excellent, and then bring me have a romantic feeling. It\nwas complete the end from embark to accident, let's me watching Titanic\nevent. I feeling that your life must have once watching \"Titanic\", you\nwill understand what the movie is successful.Finally, no matter how\nwatching again, the movie couldn't boring.\n"},
{"review": "\nDEFINITELY ONE OF GREATEST MOVIES OF ALL TIME! THIS IS ONE OF MY MOST\nFAVOURITE MOVIES OF ALL TIME! Titanic is complete! We can find love\n(that's the main theme), action (the sinking ship), a little story of\nfriendship (Jack and his buddy), religious moments, beautiful scenery,\nand many values.<br><br>This is a multi-layered movie of which people can see from different\nviews. I'd like to say that this one of most Oscar winning movies is\nfull of values through which people can learn more about life. It won't\nbe boring to watch it over and over again, and even when we watch for\nthe 10th times, we still can get something new from the movie, either\nnew moral message we just notice that moment or a scene we've possibly\nforgotten.<br><br>Through this one of highest grossed movies of all time, I get Leo as my\nmost favourite actor.<br><br>I've watched it 12 times and still plan to watch it again, sooner or\nlater. Thank God for this movie...\n"},
{"review": "\nSimply Beautiful, full of emotions and love,James Cameron created a\nmasterpiece by taking the concept of titanic and showing us the death\nof titanic in his own way and by taking the right characters into\nplace,the chemistry between the Kate Winslet and Leonardo Dicaprio is\nawesome, James Horner background music simply \"waoo\" and topped the\ncharts at that time. Graphics was so good and the computerized\ntechnology used by him to create Titanic is nearly perfect, he brings\ntitanic again into its life.It never gets old by time, you can watch it\nagain and again.Now i can really say that after building such a nice\nmovie James can say that \"He is the King of the world\".\n"},
{"review": "\nThis is truly one of my favorite movies of all time. With a amazing\ncast of wonderful actors, great dialogue, and an unforgettable plot.\nThis movie ties with The Abyss as the greatest James Cameron movie. I\nmean don't get me wrong Avatar is a great movie with a good plot and\nunbelievably spectacular special effects and CGI, but unlike Titanic, I\ncan't watch it over and over again like Titanic or The Abyss.<br><br>This is a movie of epic proportions, and knowing quite a bit about the\nreal Titanic, quite historically accurate. Leonardo DiCaprio and Kate\nWinslet have great chemistry and are perfect for their roles. The rest\nof the cast including Kathy Bates, Billy Zane, Jonathan Hyde and Victor\nGarber make it almost perfect. This is and amazing film about one of\nthe most tragic accidents in history that has made it's mark in film\nhistory and should be viewed by everyone. 10/10\n"},
{"review": "\nI watched this movie tonight in the Blu-ray 3-D version! I thought it\nwas a wonderful movie! I have seen the original version at the theater\nand have watched it several times on TV. I think it is one of the most\nheart wrenching movies I have ever seen. I loved the music, the actors,\nand the story-line. The 3-D version is the BEST in my opinion.<br><br>I ordered the 3-D version from AMAZON several weeks ago and waited\nimpatiently for it in the mail. When it arrived today I could hardly\nwait to watch it on my 3-D TV!<br><br>I thought Kate Winslet, Leonard DiCaprio and others did an amazing job.<br><br>I looked at the era this was set in and thought about my own Dad who\nwould have been in his mid-20's at that time and how a catastrophe like\nthe sinking of a ship like the Titanic might have affected the people\nof that era.<br><br>Great movie!\n"},
{"review": "\n\nThis unconvincing love-story wrapped around a human disaster made a fairly\naverage Hollywood Blockbuster.  The characters were 1 dimensional\nstereotypes and utterly unrealistic, perhaps best summarised by the moment\nin which Billy Zane crumbles beneath the weight of traditional Hollywood\nnarrative conventions and pulls a gun on the young lovers.  Did people\nreally believe that?  The action is average, the acting okay, the drama\ntedious, the special effects a dime a dozen these days, and the ending\nPREDICTABLE.  Steven Spielberg would have done it so much better.  Come\non,\nface up to the HYPE!\n"},
{"review": "\n\nI was just wandering the city one day, seeing the city lights, so I went\nto\nsee it. Titanic. The big movie, that everybody went and talked about.<br><br>I'll go straight to the point and won't go as to say anything about the\nplot. We've all gotten that in by force I think.\nWhat I find good about this movie are the small things. Not where\neverything\nis focused upon: Decaprio and Kate obviously.\nThe movie has much personality, so love it or hate it; you'll find\nsomething\nabout Titanic that feels personal. I won't let out what I think was my\nfavorite part of the movie.<br><br>Titanic is, yes, a good movie. I would be blind if I didn't see the beauty\nof this movie. But, maybe Titanic is too much larger then life. When\nwatching it, you fail to remember reality. It all seems all too Hollywood,\nwith Decaprio's face on the dollar bill with Titanic in the background.<br><br>Titanic tells us about every living thing on the ship (or so it seems)\neven\nthe rats get a little spotlight in. But the whole thing seems still to\nevolve just two characters. So, it seems to me that the movie gets too\nshallow: Sinking a ship just to get a good love story? Ah well, maybe I'm\ntoo picky? Titanic is good though. Guess where my favorite part of the\nmovie\nis? You'll never guess it. I'll give you a clue. Somewhere along the\nsinking\nscene. :)\nEnjoy the movie.<br><br>\n"},
{"review": "\nBeing of a rather sensitive nature, I steered clear of \"Titanic\",\nmostly because I did not want to witness the deaths of the 1500+ people\nwho perished in the icy Atlantic waters in 1912. Thus I only recently\nsaw the film on video, months after all the hype, the awards, and\nsubsequent hoopla had played itself out. \"Titanic\" is certainly a lush,\nbeautifully photographed and well-mounted film, although it is almost a\nbit too \"slick\" for my tastes. I thought Leo and Kate were blandly\nlikable, but I was not very much interested in their characters or\ntheir performances. The supporting cast, however, was top-notch, in\nparticular Frances Fisher's remarkably restrained performance as Rose's\nmother. Ms. Fisher did more acting with a 3-second, tight-lipped glance\nof disapproval then Leo did with 3 hours worth of stilted dialogue. And\nBilly Zane managed to twist his classically handsome features into an\noily, and sometimes frightening, visage of callow shallowness. The\nwonderful Kathy Bates always lends a touch of class to whatever role\nshe undertakes, and as Molly Brown she doesn't disappoint. I would have\nbeen much more interested in the plot if the story had been told from\nMolly's perspective rather than Rose's. But the real point of the film\nis the tragedy itself, which is depicted with harrowing, overwhelming\nclarity during the sinking sequence. On this level, I think the film is\nfully realized; however, the fictitious story line is seriously flawed,\nand I have a difficult time believing Leo as a romantic leading man. In\n\"Titanic\" he's more like the arrogant kid who should be taken to the\nwoodshed and spanked.\n"},
{"review": "\n\nA fictional romantic story rapping itself up in a true\ntragedy.<br><br>Cameron goes to all the work on the detail of the set and overlooks the\ntime\nperiod. People in Steerage did not have the run of the ship.  They were\nconfined to the aft (back) part of the ship.  They were not allowed in the\nmiddle or at the bow of the ship.  Which completely destroys DiCaprio's\nlittle \"I'm king of the world\".<br><br>The movie should be commended on set design, but not for details of facts.\nIf one is going to do a period piece, then one should research the\nperiod.<br><br>The true story of the Titanic would have been a better movie.  It could\nhave\nbeen a moving about humanity's arrogance and how nature put humanity in\nits\nplace.  It would have also shown how this tragedy should have never\nhappened.  They should have had\nenough lifeboats and had a round the clock radio operator.\n"},
{"review": "\n\nTitanic, for many of us, maybe one of the great films ever made, I\nbeg\nto differ. Seeing this movie for the first time did not really gave me the\nintense and impact as it did on millions and millions of us. To be honest,\nI\nfind this movie boring and really a waste of more than 3 hours.<br><br>The story is so much predictable. You can even guess what would\nhappen,\nand even what's the ending. Performances, I must admit, are quite\nimpressing. Billy Zane and Kathy Bates delivers a stand-out performances.\nLeonardo and Kate, also did well on this film, but truly neither of them\ndeserves an Oscar. James Cameron, as far directing is concern, really\ndeserves his Oscar. Effects on this film are also great, especially when\nthe\nship is sinking, but most of the time I find it lame.\nTo sum up, this film has its own highlights, but truly I don't\nconsider\nthis as one of the greatest films. \n"},
{"review": "\n\nThe one thing that the Titanic contributed to our culture is the fact that\nthe film managed to get a lot of giggly teenage girls to sit for three\nhours.  No small feat.  But after hearing so many people triumphantly\ndeclare that they sat through the Titanic twice, four times, ten times,\nect., I began to get upset.  There are a heck of a lot of better three\nhour\nmovies they could have seen.  The truth is, Titanic is loaded with cliches\nand has problems with historical accuracy. And did that old woman REALLY\ndeserve a Best Actress nomination?  Still, to its credit, the love story\nwas\nfairly well done, but if it wasn't set on the Titanic it wouldn't have\nbeen\nworth filming.  \n"},
{"review": "\n\nO.K., don't get misled by the one-line summary, I thought \"Titanic\" was a\ndescent movie, but in no way was it the best film of the year, not even\nclose. Let's face it, if DiCaprio isn't in the cast, this movie doesn't\nbreak\nthe records. The performances were all half-way decent at best (I could\nhave played Jack, it was that difficult of a part). But the special\neffects\nwere nice. The plot was textbook romance and there was nothing surprising,\neven when Jack died. All in all, this movie was ok. I give it a 6 out of\n10.\nIf you want to see a real Cameron movie see \"True Lies\". That's a movie\nthat\nhas got it all. Fun, action, comedy, and a surprise here and there.\nFinally\nthe main reason this movie could have been better is if the screenplay was\nbetter. \"Good Will Hunting\" won for best screenplay in '97 and they\ndeserved\nit a lot more. A good movie, but ladies, lets just leave it at\nthat.\n"},
{"review": "\n\n\"Titanic\" has all the elements of a smashing movie.  Unusually high level of\ndetail (comparable to \"Star Wars\"), a respectful tribute to Titanic's\nresearchers, and plenty of money.  The cast is skilled, the soundtrack\nbeautiful, and the cinematography masterful.  Now all we need is a plot.\nAfter all, because history betrays the ending, the ship's fate alone will\nnot draw audiences.  Something needs to turn the beautiful documentary into\na gripping movie.  A love story does the job nicely; it was a good idea.\nBut then, Cameron takes over.<br><br>Good Lord, what a nauseating soap opera.  The farm-boy hero, spunky maiden\nand evil villain trio, all but used up in \"Star Wars\", is disgustingly\nuncreative.  Some of the lines (\"And he saved me, in every way a woman could\nbe saved\") are so cheesy even the masterful thespians DiCaprio, Winslet and\nStuart can't save their characters from being reduced to cardboard cutouts.\nWhat was Cameron thinking??  Anyone sharp enough to appreciate the detail\nwould vomit from the recycled storyline, and anyone naïve (or stupid) enough\nto fall for the fairy-tale romance wouldn't acknowledge the historical\nfaithfulness.<br><br>In any case, everybody ought to see this movie at least once; it's not bad\nfor a brainless love story and beautifully crafted.  But if you're an\neducated movie connoisseur, bring a barf bag. \n"},
{"review": "\n\nIn my quest to write up to 50 reviews here at IMDB, it's time for the James\nCameron flick.<br><br>Well, it was definitely NOT the best film ever made. I think I liked it a\nlot when I first saw it in 97 (note: I only saw it ONCE at the theater), but\nnow it's coming on HBO, like, every few hours. And when you catch the same\nparts playing over and over again you can tell how much you wish Cameron\nwould've taken a few more writing classes when he was younger.<br><br>The very best thing about Titanic was just that: The ship. The ship was the\nmovie, and watching it sink was the real masterpiece of filming. Most of\nDiCaprio and Winslet's scenes together got tedious and was underwritten on\nsome parts. It seemed like they were 90's people sent back in time to learn\nthe ways of the early 1900's and failed to do so, which was exactly the\ncase.<br><br>I think Cameron is a great filmmaker, and am glad the movie was a success so\nthat he cam bring us other movies. But, he I had wished he learned to be a\nbetter director and find out to make great movies without a colossal budget.\nBut even if Titanic only costed 70-100 and came out the same I still\nwouldn't have liked it any more or less. Overall, it was a nice movie but\ncould've been A LOT better. \n"},
{"review": "\n\ni did enjoy this movie, but with all the build-up that surrounded it i\nexpected the mother of all blockbusters.  it wasn't.  it is an enjoyable\nview but not earth shattering like i was expected to believe. \nbob\n"},
{"review": "\nThere are a ton of problems in \"Titanic\" \u0096 the cartoon villains, the\nstilted dialog, much of it obviously re-recorded in post production.\nSome weak supporting performances, the betrayal of a number of\nhistorical facts, and taking what was already one of the most dramatic\nnights of the 20th century and needlessly pumping it up with chases,\ngunfire, theft, scheming, etc. <br><br>Yet a lot works. As much as I didn't want to give in, Kate Winslet and\nLeonardo DiCaprio make a great, old fashioned, star crossed romantic\ncouple. Many of the effects and stunts are amazing (although at other\ntimes you realize some wide shots are basically giant video-game like\ncartoons). And it made me cry -- while I felt like a fool for being\nswept up in it's shameless melodrama. <br><br>I can't argue that \"Titanic\" is art, or deep, or a great film, but I\ncan say it's a terrifically effective entertainment that everyone\nshould see at least once.\n"},
{"review": "\nWhen they announced this for a film being released. I thought, oh crap!\nAny average Titanic film, would be very seriously overrated and very\ncheesy. But when this film came out, I watched it and I loved it! It\nwas so good, that it was worth going to watch it again! This film is\ndefinitely worth watching!! The romance scenes are filmed and acted out\nvery well, because when Rose and Jack kiss, it really brings out the\nemotion. It will express what your feeling, and will make you want to\ncry! When they're escaping from the flooding of the ship because the\nTitanic is sinking, words which Leonardo DiCaprio &amp; Kate Winslet said\nin that scene which really isn't necessary. Like the fact that they\nkept on using the word sh*t! The word is well overused in the entire\nfilm, and that is what lets me down. It could have been even better!\nBut the script writing lacked like it was rushed! <br><br>The CGI is really effective in the studio, actually making it look like\nthat it is sinking. Especially for a 90s film! Some scenes were just\nnot necessary, like the scenes which the old gran was telling the\nstory. Why can't it all be set back in 1912?<br><br>Overall it is a fantastic film, and definitely worth seeing!<br><br>My score is a 9.3/10\n"},
{"review": "\nRarely does a story so well known by viewers surprise them so\nwonderfully. Everyone knows about the Titanic and the travesty that\ntranspired, but people often forget about the lives of those involved\nand the experiences they endured. The story of the Titanic, the\ninfamous ship, and two starstruck lovers, who were merely forgotten,\ndisplays vast beauty in an otherwise unfortunate event. <br><br>From the characters to scenery, this movie captivates the audience with\nits enthralling imagery and emotional acting. Stars Leonardo DiCaprio\nand Kate Winslet perform incredibly in their respective roles, and\ndemonstrate that going against the status quo is not necessarily bad.\nThroughout the film, viewers are taken on a journey. One that begins\nwith Rose happily accepting Jack into her life, and then Jack\ntirelessly trying to stay in it. To say Titanic is a romance is an\nunderstatement. It possesses action, adventure, drama and all the like,\nand is far from your generic love movie. <br><br>I was gladly surprised by how much I loved this film even after seeing\nits numerous awards and superb reviews. Titanic is a movie that will\ncertainly not disappoint, and it is definitely one for the ages that I\nrecommend for anyone and everyone to see.\n"},
{"review": "\n'Titanic' is my favourite film for many reasons. 1. It has Leo DiCaprio\n(hottie!)in it ;-D 2. It is one of the most romantic love stories ever\nmade 3. It is the one of the only films that has ever made me laugh and\ncry. 4. It touches your heart more than you'd ever want to admit. <br><br>A lot of people dismiss this film, saying it's got rubbish acting,\nuninspired directing, overlong, whatever. I can guarantee that none of\nthese things are true. Titanic truly is a masterpiece, a landmark in\nthe history of film. I first saw this film last year. I'd heard about\nhow good it was, but thought it might be a little disappointing. But\nhonestly it was breathtaking. I won't say anymore, just go watch it.\nWatch. It. It is one of the best movies you will ever see. Maybe even\nthe best. And be sure to watch it on it's re-release in 3-D in April\n2012.\n"},
{"review": "\nOne of the well-known ships that became an disaster at sea was the\nTitanic. It sank in 1912 on its voyage out to sea. Disaster struck when\nthe ship hits an iceberg and cause it to sink. The passengers of the\nTitanic were trying to survive. Many of them died. Some of them were in\nlifeboats. Now, James Cameron brings back the mighty ship. In his film\nTitanic, a man named Jack Dawson, played by Leonardo DiCaprio. He goes\non the Titanic after winning an poker game. Also on board an beautiful\npassenger, played by Kate Winslet and her fiancé, played by Billy Zane.\nDiCaprio and Winslet fall for each other in love as the Titanic\nventures out to sea. Then, the iceberg hits the Titanic and that is\nwhen chaos begins. Passengers are frightened as the ship slowly starts\nto sink. The ship's sinking isn't about the passengers screaming and\npanicking, but it gives an realistic dramatization of the ship. Real\ndocumentary footage of the real Titanic appear on the opening credits.\nWinslet's character Rose, now old, is played by Gloria Stuart, who\nremembered what happen that night. The movie's visionary of the Titanic\nsinking is wonderful made with the special effects. As for Winslet and\nDiCaprio, they have great performances as Rose and Jack. The film\nitself is a tragedy of what happened. Titanic is one of the best films\nof 1997. An great, true Hollywood Epic. ★★★★ 4 stars.\n"},
{"review": "\nThis film never sinks. From the opening few shots to the final moments\nof the film, everything about it is simply wonderful. It's majestic,\ncharming, sweet, thrilling, suspenseful and most of all heart\nwrenching. The pacing of the film is perfect and the special effects\ntowards the end of the film are also top notch. The story is about two\nyoung lovers Jack and Rose. It really is a beautiful love story as we\nsee them overcoming the odds in order to be together. But don't be put\noff by the love story element, as there's plenty of action and\nexcitement come the second half of the film and the film never sinks\nfor one moment. Like I said, the pacing is perfect and I must say this\nis probably the greatest story telling ever put to celluloid - James\nCamerons a genius. <br><br>All the actors/actresses are great, but for me it's Leonardo DiCaprio's\nmovie as his character Jack, demonstrates his self worth at every turn\nand goes to extraordinary lengths in order for him and Rose to be\ntogether and ultimately stay together i.e survive the catastrophe that\nmay fore-go their destinies. <br><br>To conclude, phenomenal.\n"},
{"review": "\nI have seen the movie so many times that i remember the dialouges now.\nAnd every-time i see i feel like there is something new to it. It is\nthe most amazing, wonderful movie i have ever seen. James Cameroon\ncould not have got better actors than Leonardo and Kate Winslet to this\nmovie. I have fallen in love with Jack since the first time i saw this\nmovie. Never really occurred i could write a review about it, but today\nwhen i am watching it again and had my laptop just next to me thought\nof opening my heart. The music, gosh i have never loved background\nscore of any movie as much i love Titanic's. The band that plays when\nship is sinking, the song my heart will go on- well nothing needs to be\nsaid about that. I have been fantasizing this kind of love and romance\never since i saw this movie. It is one grand movie ever made, you\ncannot not like even a single part of this one. I really want Titanic\nto have a sequel in which Jack would come alive somehow with some logic\nor something. This movie took my heart away, its astoundingly beautiful\nand mesmerizing. Jack Dawson is my love and Titanic will remain my\nfavorite movie ever.\n"},
{"review": "\nI absolutely adore this movie and i have done for years. It was only\nwhen I looked it up on the internet that I realized many people don't\nlike it, which was news to me as everyone Iv spoken to about it loved\nit. It seems people on internet forums etc. think that by slating\nTitanic they will look ''cool'' and look like their ''in the know''\nabout films. Ha, please don't make me laugh. Slating Titanic and\ncalling it 'the worst film ever' (which Iv seen many people call it)\njust makes you look absolutely clueless. This is a brilliant film and I\nwould highly recommend it. Watch it for yourself and don't let ''movie\nbuffs'' comments sway your own opinion.\n"},
{"review": "\nI am breathless and out of words for THIS film. No, its not the best\nfilm I've seen, but it certainly comes close to being. James Cameron is\na true genius and he's the person to thank.<br><br>Titanic is a wholesome tragedy adapted from the historic event when\nmore 1000 people lost their lives. This film is pure art and will never\nbe forgotten. It is filled with extravaganza effects, worthy\nperformances, and a simply adorable soundtrack.<br><br>Leonardo DiCaprio gives one of his best performances in his career. He\nis simply perfect as Jack; simple, yet humanized. Kate Winslet is even\nbetter, playing Rose with Gratitude, courage, and efficiency. This is\nalso, simply her best performance in her career.<br><br>Effects are simply breathtaking. James Cameron provides with stuff that\nyou would have never seen in the 90s. As for his direction, also\nbenefits because of his stretchy camera angles and glorious sights.\nThis is seriously Cameron at his BEST and there's nothing more\nwonderful than that.<br><br>Small things like soundtracks don't usually matter in films, but this\nfilm has the best I have heard in my life! Racy, touching, and\nemotional; there isn't anything like it.<br><br>Overall, I have no words for Titanic. Almost everything is near-perfect\nin this timeless classic. It is also an unforgettable cinematic\nexperience; as well as a benchmark in history for visual effects. James\nCameron has got the big job done and has succeeded thoroughly.<br><br>'Go see it now, because you certainly won't be disappointed one bit\nwith this film'\n"},
{"review": "\nLeonardo DiCaprio and Kate Winslet are young lovers on the doomed\n\"Titanic\" in this 1997 film directed, written, and edited by James\nCameron. The film also stars Billy Zane, Gloria Stuart, Kathy Bates,\nFrancis Fisher, and Victor Garber.<br><br>Rather than go into the story, I'll just say that this film is a true\nmasterpiece, meticulously researched, designed, costumed, and acted,\nand gives one the feeling of the desperation, fear, sorrow, and\nfinality that the people on the ship must have felt. The entire time I\nwatched it, I kept thinking of the people on the planes and in the\nWorld Trade Center on 9/11.<br><br>There have been several films about the Titanic but none so lovingly\nrecreated and so powerful emotionally. Kate Winslet is exquisite as\nRose, the upper class young woman engaged to a brute (Zane), who falls\nin love with third class passenger Jack Dawson (DiCaprio). DiCaprio is\nterrific - exuberant, passionate, and adventurous.<br><br>If you don't know a lot about the Titanic, this movie will pique your\ninterest. When you read more about it, you'll be impressed by Cameron's\ncommitment to bring this piece of history to life.\n"},
{"review": "\nI was only 5 years old when this movie came out so I never saw it until\nyears later. I think I was 9 at the time and I liked it but it didn't\ncompletely register until I hit about 14, go figure! You still can't\ndeny how perfectly gorgeous Leo looked in the movie. It's impossible to\ntake your eyes off him. I know guys have to feel the same way even if\nthey never admit it.<br><br>I think I've watched this movie, start to finish at the very least 50\ntimes. It's one of those few movies that feels different every time you\nwatch it and never gets old. It's like the Gone With The Wind of modern\nday from what my grandma tells me. All in all, it shows that love\nconquers all. But the ending, UGH. I about died the first time I saw it\nand was left feeling depressed for weeks.\n"},
{"review": "\nThis is honestly the best romance movie I've ever seen. The effects of\nthe movie were amazing. Yes I did cry to this movie and I have seen\nmany depressing movies including Angela's Ashes (if you have not seen\nit then I recommend you do not see it b/c you will literally cry to\ndeath) and this has been the only movie I've cried to. And I don't care\nif you say its too depressing to watch. I watched it a second time and\nI cried just as much as I did as the first time. And you know what, it\nwas great. If you have a girlfriend/wife, and if neither or one of you\nhasn't seen it, go see it together. She will cry (maybe) but you will\nget laid. How do I know this; experience. James Cameron, your movies\nare the best. Do not stop making movies. I really want to see what you\nwill surprise everyone with next.\n"},
{"review": "\nThis movie is the greatest of its genre. I might almost dare say it is\nmy favourite film. The casting is just spot on, the love story puts you\nthrough every emotion imaginable and the way the ending is portrayed is\npure brilliance.<br><br>I did not cry in this movie, I'm a 17 year old guy. However i did come\nout feeling like i was mourning a loved one. This is the single most\npowerful movie I have ever been lucky enough to see, with nearly the\nwhole of the first half making me smile with happiness and the second\nmaking me feel nothing but despair.<br><br>This film is revolutionary, and an absolute must see.\n"},
{"review": "\n\nI personally found the movie to be extremely well\ndone from a technical perspective, meaning: \neffects, sound, camera work, etc.  However, I felt\nthat the acting was forced--the accents being some\nof the worst I've heard since Costner tried his \nhand at Robin Hood--and the script was atrocious--more\nresembling the banter of modern high school students \nthan what I would expect out of an early 20th \ncentury debutante and orphaned pauper.  Cameron may \nbe an exceptional director, but he's no writer.  <br><br>Of course there are many that would disagree, \nbut I think that most of this movie's more staunch \ndefenders have simply allowed themselves to be lulled \ninto complacency by the stunning visuals and the \n\"feel-good\" love story.  I admit that the movie\ndoes evoke a warm and fuzzy feeling if you allow \nyourself some suspension of disbelief, but for\nthe pickier among us (we like to think of \nourselves as having a more \"discerning\" or \"refined\" \nsense of taste) it simply fell short of being a \n\"great\" movie.  <br><br>I personally found the circumstances of the \"love \nstory\" between Jack and Rose to be exceptionally \ncontrived.  How did Jack manage to get himself from \nbeing a poor orphan in the Midwest, to a starving \nartist in Europe?  How convenient for him that \nRose was a being forced into an unwanted marriage \nto \"save her family\" thus providing him a \nperfect opportunity into her pants...err..heart...  \nThe bottom line is that this particular love story \nwould have been fine in a less pretentious movie, \nbut this was a 200 million dollar reenactment of \na horrible tragedy brought about by hubris, \"God\nhimself couldn't sink this ship,\" and exacerbated \nby classism.  Not exactly the proper venue for an \nexposition on teenage rebelliousness and hormones...\n\n"},
{"review": "\n\nToo bad about the cheesy special effects- at least the storyline and\nacting\nwere good. I firmly believe this film winning best film is the most unjust\noccurrence at the academy awards, along with CITIZEN KANE not winning best\npicture, and Marlon Brando for best actor in A STREETCAR NAMED DESIRE. The\nscreenplay and the acting are the most important aspects of any film, and\nsince Titanic was deficient in both areas it should not have received the\nhonour of best film. Granted, the special effects are wonderous and should\nbe honoured, but as a whole the film was not a masterpiece, it did not\ninspire, and they took far too long to die. There were far better films in\n1997, due to their superior screenplay and acting talent, but they were\nsnubbed because of this. It really makes one question the credibility of\nthe\nacademy. \n"},
{"review": "\n\n  I admit I enjoyed this film.  The grandeur of it all was impressive.  The\nfact that James Cameron let this film get to a 200 million dollar budget is\nalso very impressive.  However, once the grandeur is taken away there really\nisn't much left.  The plot is a simple romance.  And since the story is so\npredictable, it puts some heavy pressure on a three hour\nfilm.<br><br>  The direction is superb.  My distaste for this film doesn't extend to\nJames Cameron's technical direction.  His technical direction is on par with\nSpielberg's.  However, his human/emotional part of that mix doesn't rate\nvery well.  The acting also is not consistent.  I didn't find DiCaprio's\nperformance bad, but his character seemed to be very easy to play and wasn't\nthat complicated.  Winslet, who's performance in Heavenly Creatures stunned\nme, is mainly okay here.  The best performances belonged to Gloria Stuart\nand Kathy Bates.<br><br>  The score also rates with the best, and the soundtrack is one I highly\nrecommend.<br><br>  In the end, I think this film is more comparable to \"Cleopatra\" than to\n\"Gone With Wind\".  The budget and the problems making the film end up being\nmore interesting and more entertaining than the film itself.<br><br>  Did this film deserve best picture? No.  But it's nomination was also like\n\"Cleopatra's\" nomination.  The big budget and the absolute vastness of the\nfilm was enough.  \n"},
{"review": "\n\nI liked \"Titanic\". Its a good old fashioned adventure/romance/epic with a\nstrong storyline and definable characters. Sure the tacked on romance is as\nstock as the characters, but that is still better than the alternative\nserved up by most modern movies: ie--no plot and no characterization at\nall.\nThe thing that bothers me about this version of the Titanic sinking is that\nwriter/director Cameron takes full credit for the screenplay, when so much\nof it was directly lifted from a 1958 film about the event, \"A Night to\nRemember\" (also a book, and a previous film).\nAnd I'm not talking about the fact the Titanic sunk, or any of the other\nfactual details of the story--obviously those will be the same. I'm talking\nabout virtually identical scenes, events, and dialogue that could not be\ngathered from public record.\nScenes such as the ship's builder standing alone in the tilted ballroom,\nlooking at the painting on the wall as the ship goes down. Or the rich ship\ncorporation a**hole being told that yes, his ship is going to sink, no\nmatter what he says. Or identical scenes of the steerage rabble breaking\nthrough the gates. These scenes, and many others, are mounted and shot in\nso\nsimilar a fashion to the previous film, with such similar dialog, that I\nbelieve they cross the border into plagerism.\nRent the 1958 version of \"A Night to Remember\", watch it, and tell me I'm\nwrong.\n\n"},
{"review": "\n\nSo much has been said about Titanic that it's hard to come up with\nanything\nnew. Some people claim it's the greatest thing ever directed, others say\none is too high of a rating. I fit in the middle. This movie had beautiful\nsetting and scenery, some gorgeous shots of the ocean and the sunset.\nThree\nthumbs up to those who shot those scenes. And this movie DID have a plot,\nit\ndidn't need to be three hours long, but non the less it was present.\nTitanic\nwas a tragedy and this movie was not a celebration of it, it tried to put\na\nstory to it which it did. Although the characters were fictional, perhaps\nstories of the sort did happen (certainly not as dramatic though).<br><br>Characters could of been a little more developed because with the\nexception\nof Sally Brown they were all black and white. I personally really liked\nthe\nreactions of different people to what was happening on the ship. Nobility\nof\nthe captain, mother's prayers, musicians attitude etc. Cameron very well\nportrayed those people.<br><br>Something was missing from the plot however, it in a way lacked emotions.\nAs\nI watching this movie, I realized that what was happening on that ship was\nawful, but I didn't get a sense of reality from it. I didn't feel the\nhorror\nto the bones and I certainly didn't feel the pain of those people who were\ndrowning. I mean, I knew it was there, I just didn't experience everything\nthey did emotionally, and a good movie should make a person do\nthat.<br><br>I don't think this movie deserved an Oscar but it still deserved attention\nas a good movie with imperfections. After all, very few movies are\nflawless.\n\n"},
{"review": "\n\nPeople talked a lot about this movie, before, after and during the time of\nproduction. One thing I was sure about when the pieces fall in it's place\nthat this movie is made to be a cash machine and not a masterpiece.\nEveryone\nknows the story, the old well known one. Nothing wrong with old known\nstories but the combination with other common regular boring side stories\nmake the whole thing unbearable. At last I went to see it, at the\nUniversity\nPhilm Club theater. It started bad and it became worst, more than three\nhour\nof suffering, and I don't talk about the suffer of passenger of Titanic, I\nam talking about my own and the other people with me sitting there\nwatching\nthis nonsense. The last hour almost killed me, I put my head between my\nlegs\nand raised my head to see what's going on every other minute. I didn't\nmiss\nanything, the story went on very slow, slow, slow ... It's looked like the\nproducer and the other guys there realized that the have spent a lot of\nmoney so they made the movie an hour longer.\nAnyway I was lucky to see it in a theater with a break in the middle of\nthe\nmovie, and I am happy that I didn't pay to see it.\n\n"},
{"review": "\n\nToo bad the saccharine plots, banal dialogue and music,and patently phony\nseascapes diminished the special effects,which were well done.The crude\nbehavior and talk of the salvage team in the Titanic graveyard were\nparticularly offensive.\n"},
{"review": "\n\nOver a billion dollars in box office, 11 Oscars, countless words or praise -\nand so many people want to rip this movie up. Well I would be happy never to\nmeet you if you dislike this movie that much, cause there's something wrong\nwith you.  If you cannot appreciate the beauty and craftmanship that went\ninto this, not only are you nuts, but you are pretty ungrateful too.  This\nmovie stands above all the rest.  \n"}
]