[
{"review": "\nOn what grounds does this movie have 6,9 rating on IMDb? This insults\nthe intelligence. Shailene Woodley has no character and acts like she\nis first time in front of the camera. Action is meaningless. This is\nwhat happens when you run out of ideas. 45 minutes before the end I\nwanted to quit, but...I did not do it. Why? Because I had hoped it will\nimprove, and then... nothing. This is the most honest opinion about\nthis movie that I was able to give you. Now, I'm asking you, do you\nhave 119 minutes of your life to waste? Oh what, you do not believe me?\nNo problem! Just remember what I told you and come back after you watch\nthis piece of abomination. As regards of Kate Winslet, first I have to\nsay that I'm fan of her earlier works, but this is something else. This\nshe did not need. A huge step backwards in her career. As someone\n(Author: siderite from Romania) already said: \"Bad enough to make one\ndoubt IMDb ratings forever\".\n"},
{"review": "\nThere's nothing more annoying than a movie that sets itself in a\ndystopia and then has a bunch of pretty people running around doing\nunbelievable things. Maybe if I was a third grader I would appreciate\nthis fantasy but as an adult it was torture to watch.<br><br>This movie would need some serious surgery to actually pass as\nsomething I could make all the way through. I didn't make it all the\nway through by the way. The casting, direction and writing would all\nhave to be redone. Basically, throw it all out and start over.\nOtherwise, this could possibly work as a Yahoo TV movie.<br><br>File this one in the folder of movies that think the audience is dumb\nand will just be wow'd by ridiculous action and young heroes. So\nannoying and such a waste of my time.\n"},
{"review": "\nOh dear god why'd I go see this movie?! If I wanted Hunger Games:\nCatching Fire, I should've went to see Hunger Games: Catching Fire.\nWait! No, I take that back. If I wanted Hunger Games, I should've\nwatched Battle Royale 2.<br><br>Cause if I'm honest, this movie is a copycat of a copycat. Oh how I\nmiss the good old days! The good old days where if you went to see a\nmovie set in a dystopian future where a corrupt government put its\ncitizenry in peril on a whim, it was rated R because it contained great\nspecial effects, gritty foul language laced dialogue, and contained\nadult themes. But this! Okay! I understand the concept of movie studios\ndumbing this type of film down so tweens can partake in something that\nmakes them feel like they are cool, or makes them feel like their\nrebelling.<br><br>Even though they aren't really, they're just soaking up things that\nhave been rehashed from what was cool 25+ years ago. Please! Tween\nsociety, realize that when everyone is a rebel, the only true rebellion\nis against rebellion itself!\n"},
{"review": "\nA 4 is probably generous. I'm getting sick of the Elysium genre and\nthis is the same thing with the exception of some vivid dreams. The\nelites have sequestered themselves on the same planet this time. The\nplot is the elites can and do openly mind control everyone and\nsegregate the population the way they think it should be separated, but\nsome special people can't be mind controlled and have to be dealt with,\nby violence of course. Suffice it to say it gets weird. I mean weird.\nGoofy. Nonsensical. Unbelievable. All accurate descriptions of this out\nof control mess. I didn't see the first one, and now probably won't\nbecause I already want this 2 hours back.\n"},
{"review": "\nFirst of all: i usually don't like to write review, since this movie\nreally awful. I felt i need to do this, so you didn't do the same\nmistake that i do. Don't waste your time.<br><br>Second, i don't understand the story. What kind of world it is. What\nfaction is? So i just spend my precious 2 hours to watching something\nthat i don't understand nor the movie try to explain that<br><br>Third: story very very bad. At the ending, your friends successfully\ninfiltrate the enemy headquarter without even noticed by your enemy. If\nit's one or two friends, that's okay. But this is the whole battalion.\nWUTTTTTTT??????!!!!!!\n"},
{"review": "\nI'm a fan of sci-fi and fantasy. Its what I read and what I love to\nwatch. This movie franchise took a great premise, swallowed it whole\nand then charged movie goers to look at the digested remains for 2\npainful hours. Yeah, I'm comparing this film to fecal matter. It's\nharsh but fitting. This movie is so terrible that it inspired me to\nwrite my first review on IMDb. Which is saying something, being that I\nalso saw After Earth and this is my 1st review.<br><br>The dialogue hurt my ears, Woodley and James acted as if acting as\nactors who had no idea what acting was, the action sequences were weak\nat best, and then they wrap it all up with a predictable safe ending.<br><br>Basically, if your IQ contains 3 digits, run from this movie. Simply\nHorrendous.\n"},
{"review": "\nUsually I don't write reviews. But this movie is so bad that I couldn't\nhelp but writing this. This is the worst movie I've watched in 2015. <br><br>First of all, I've to mention the graphics of this movie.The graphics\nwere visually stunning. But I don't consider graphics as a scale to\njudge movies. The story was terrible, full of clichés. Anyone could\nguess what will happen 5 minutes later in this movie. The acting was\nawful. Specially I hated the main character. She tried to deliver some\ngood performances but I don't think she was perfect for her role. The\nside characters were not so great either. <br><br>If you consider yourself a person with brain, please don't watch\nInsurgent. Save your precious 119 minutes and thank me later .\n"},
{"review": "\nAll look the same these films. Seen one you can possibly avoid seeing\nothers otherwise you risk sleep- There is action, a plot rather\nsuperficial, then the actors and director seem made to mold. the first\nof Its kind recently was the hunger games. I still believe That young\npeople can have fun, Although I personally would love to see movies\nwith blackberries introspection of the characters. We Should inspire us\nin the West to some good movies East: China, India, Korea and Japan. if\nyou rely only on the effect special, something is lost in filmmaking.\nAn example are the x men, that have become all the same, which have not\nwanted to deepen characters intriguing benefit of those that offered\nmore security at the box office.\n"},
{"review": "\nSo this movie is a sequel to the Divergent, pretty likable movie.<br><br>The movie kinda starts where the last one left us, but the story turns\nvery boring quickly.<br><br>When it comes to some action, it's just plain horrible. So many\nclichés, but even worse. For example, a group of trained professionals\nshoots at people running towards the train. Shooters are basically\nhidden in the woods and shooting the runners, they don't hit anyone,\nbut the runners shoot back (with no aim basically) and manage to shoot\nsome. Facepalm #1.<br><br>Later there is another scene where these \"runners\" are attacked by\narmed professionals. They appear in groups and descend on the roof of a\nbuilding by some ropes, as they are shooting at these runners. They\ncan't hit a single person out of three, although they are running away\nfrom them in a straight line. When they reach the roof, they keep\nshooting but miss every time.<br><br>At this point I started laughing at the stupidity of it and left the\ncinema. Yes, it is THAT bad.\n"},
{"review": "\nThe movie is very bad. fell asleep several times. I liked the first\none; not one of the best ever, but it was fine to watch. This didn't\ncapture my attention one bit. Didn't like the visual effects too, nor\nthe atmosphere of the movie. The story is boring and some of the scenes\nare ludicrous. I didn't see it till the end, hence I don't know if the\nfinal suggest another sequel. Hope not. I don't know what's happening,\nbut generally the sci-fi movies are getting worse. The plot, storyline,\nor whatever are close to nonsense or, at least, vague and superficial,\nand the action is all over the screen. I used to like watching\n\"superman\" or \"spiderman\", now: avengers, thor, ant-man, transformers\nare full of crap. Explosions over explosions, shitload of fights that\nmakes me look somewhere else than the screen. Expecting \"tomorrowland\"\nnow. Hope I don't get frustrated again.\n"},
{"review": "\nThe IMDb rating of this terrible movie is still 6/7. How is this\npossible? It looks to me that some PR-agencies undermining the\ncredibility of IMDb. I cannot take the IMDb rating serious any longer.\nThis is a bad way to promote movies and IMDb should not be part of\nthis.<br><br>The plot is rather stupid. It reminded me of some cheap Indian gangster\nmovies where a beautiful lady is kidnapped by some wild looking\nculprits and when it looks that the desperate lady will be raped and\nmurdered, suddenly a hero jumps out behind a bush that weren't even\nthere a minute before. I love well written sf-movies. This b-movie\nisn't one of it. One of the worst movies this year. I regret the time I\nwasted watching it. The IMDb rating for this movie should be 4/6\n!!!!!!!!!!\n"},
{"review": "\nI rather like watching sci-fi movies. This is the genre I prefer\nwatching. I watched the first one and it was really bad. Since I like\nwatching sci-fi movies I decided that I should give this movie series a\nsecond chance. Boy was I disappointed. The second one was just as bad\nas the first.<br><br>Really boring, predictable, bad acting, weak plot, etc. are all the tit\nbits you will find in this movie ... guaranteed to irritate when\nwatching through it all. To say it was really, really bad is an\nunderstatement. It was so bad that I felt inspired to write this really\nbad review about it. A true shame. I'm sure it could have been much\nbetter.\n"},
{"review": "\nVisually the film was compelling, but it lacked the storyline so needed\nfrom the book. I felt a little disappointed watching it, thinking about\nwhat they could've done. Separating my mind from the book I would say\nstand alone the movie was exactly that, a great movie. My suggestion\nis, if you've read the books then separate your mind from what you've\nread except for basic skeleton of the storyline in the book itself. The\nskeleton is their. They just gave it a slightly altered body build that\nchanges what readers and fans may have been expecting. In all I give it\na 6/10 for my own disappointment in the storyline. I leave out any true\nspoilers in order to let you make your own decision about the movie. <br><br>Good luck, and have fun.<br><br>To everyone who helped make the movie. I appreciate your hard work and\nefforts in bringing to life a fan favorite dystopia sci-fi novel\nseries, and even though I was disappointed I will still go see the rest\nof the series in theatres. I started it, now I have to finish it.<br><br>Felix felicis,<br><br>BKL\n"},
{"review": "\nI just watched this movie, even though I've thought that I'll end up\nthrowing a remote at TV because of what critics kept complaining about,\nbut I was not surprised by the fact that this movie was quite\nenjoyable. So, frankly.. I would rather now throw remote at those bunch\nof haters here, than TV itself. Didn't expected that this movie will\nhave some outstanding action scenes, because anyone with a little brain\nwho watched this, should know that this movie is not supposed to bring\nyou full action experience. But it had quite good and interesting\nstory, was emotional and characters portrayed by actors such as Kate\nWinslet, Jai Courtney and Shailene Woodley herself felt just amazing. I\nwould recommend anyone who watched first movie and LIKED it, to give\nthis one a chance too. If you didn't liked first one, and if this movie\nis not your type, then don't even try watching it and having some high\nexpectations. Simple as that.\n"},
{"review": "\nThis movie was almost better then divergent. I guess 1 guy wrote a bad\nreview and everyone else just followed the train.<br><br>I never written a review until now, because it has to be done.<br><br>Everything with this movie was great, i was entertained throughout the\nfull movie. And at the end (without spoiling anything), The movie got\nme extra excited for the follow up allegiant.<br><br>The acting was great, and the animations were wonderful. This movie was\nnot a waste at all. You should really see this movie if you liked\ndivergent. So stop hating and appreciate the good movies out there.<br><br>8/10 because there are better movies out there, right. But this movie\nis not bad at all. Definitely watch it if you want to know what happens\nafter divergent.<br><br>I would recommend this to my friends and family.\n"},
{"review": "\nHow can you honestly take a movie seriously, when the makeup is always\nflawless. The lead actress who cuts her hair with pruning shears and\nthen ends up with a $500 haircut with highlights and lowlights? Her\nmakeup always perfect after every battle. I mean, she really is going\nto have full makeup, eyeliner, eye shadow, blush etc. Is a war zone?<br><br>I mean I understand that they want the main actress to be beautiful but\nhow can you even remotely take a film seriously like this? At least in\nthe hunger games, they didn't have to have Jennifer Lawrence in obvious\nfull make up during the fight scenes, yet she still looked beautiful. <br><br>I won't even get into how boring the movie was because what I just\nstated were very obvious poor decision mistakes. A typical \"teen\" show\nin my opinion. Sad.\n"},
{"review": "\nInsurgent is a fantastic follow up to Divergent, however I would\nrecommend watching one after the other as I left a good while between\nthe two and found myself racing to catch up with what was happening at\nthe start of the second one when I watched it at the cinemas (this time\nI watched 1 and 2 seamlessly and it made more sense).<br><br>Not as much simulations in this sequel which to me was a let down as I\nloved those scenes. But when she did do the sims for the box thing I\nfound that awesome.<br><br>Everyone was awesome in their roles, once again Kate and Shailene\nshone. But I also loved Octavia as she really showed what a true Amity\nleader would be like. <br><br>I also loved when they went into Candor and Tris and Four were on\ntrial. I particularly loved seeing Candor as I imagine I would have\nchosen that particular faction if I was in that world.<br><br>Props to Robert Schwentke for a perfect sequel that (like its\npredecessor) has me craving more. Can not wait for the 3rd film. 9/10,\nonly because I would have liked more simulations.\n"},
{"review": "\n\"Insurgent\" continues shortly after the events of the first movie,\nhaving Jeanine finding a box that can only be opened by a Divergent and\nsearching for all the Divergents (Which was previously shown in the\ntrailers.) and also discovering that not all Divergents are equal as\nsome Divergents are better than the others and obviously, the latter\nwas Tris.<br><br>Honestly, I was surprised that I liked this better than the first since\nI knew that I had lower my expectations for it because I knew that the\nfirst one was horrible and also because I had no faith for the new\ndirector \"Robert Schwentke\" who's known for R.I.P.D which was\nabsolutely awful. This movie had good moments, but the movie was mostly\na bore. The cinematography was okay, acting was good but wasn't enough\nto feel attached to the characters. (I didn't feel like connecting with\nthe protagonist.) <br><br>VERDICT: I'm not saying that I didn't like the movie, but it really\ncould've been better. I didn't like it that MUCH because everything was\ntoo surreal. Everything was too coincidental.\n"},
{"review": "\nI will start by saying that i'm a absolute fan of the books, Insurgent\nbeing my favorite, so I was very excited about the movie, which I\nwouldn't say is bad but definitely not what I was expecting. The\nspecial effects, the action, the cast, everything is amazing but I\nmissed more of the story line of the book. Half the things of the book\nnever happened on the movie and the ones that did were almost\ncompletely change, it even has a complete different ending. We all know\nthat movies are never going to be exactly like the book and you can\nunderstand some stuff has to be left out in order to fit it into two\nhours, but that doesn't mean change everything. I keep wondering how\nthey're going to adapt Allegiant for it to make sense with this\nending.. It's not a bad movie at all, I actually enjoy it and my\nfriends who haven't read it found it to be great, but as a fan of the\nbook I couldn't stop comparing and was kind of disappointed because I\nexpected to be more truth to it...\n"},
{"review": "\nIt's one of the worst movies I've seen in a long time. I watched as it\nhad a score of almost 7 but it deserves maximum 3. I watched the first\nmovie and it was OK, it made sense. This one doesn't, and If you read\nthe bad reviews they're right and you should trust them (ignore those\nthat say it's great, the chemistry between the characters is\nincredible, they are not true). After 2 hours you get to the end which\nmakes no sense (one of the most useless experiments, what was the goal?\nonce that we had the perfect divergent what was going to change? if\nthere was something that the society was doing to create one fine, but\nhere there was nothing! it was like a mutation, you get some one who's\n\"mutant enough@ (i.e. 100% divergent) who can open the box and get the\nmessage written 200 years before which should still be valid for the\npresent.\n"},
{"review": "\nIf you did not watch it yet then do not !!<br><br>If you do, all what you're going to watch is love with a boyfriend.\nSomething that could never be more boring. No action, no fights and\nnothing interesting at all.<br><br>At least the first movie of this movie series was a little bit\nacceptable but, this one? I wish I could ask the creator: YOU REALLY\nTHINK THIS COULD BE INTERISTING? IS THIS ONLY ABOUT LOVE?<br><br>I swear that this movie explained to me how silly could a movie be in\nthe cinema nowadays! No action .. just love !!! I'm really sad for\nthose lost 2 hours\n"},
{"review": "\nWatching this movie left me with one thought, i should file a lawsuit\nto get some pain compensation, or even for the wasted lifetime i spent\non this. Srsly nothing actually happens in this part of the \"trilogy\",\nyou could contain the whole plot in one sentence. Even Twilight is more\nthrilling and interesting than this. No wonder the first part of the\nthird movie was received so bad, that they hardly have any budget for\npart 2... THIS MOVIE IS BAD PLEASE Don't WATCH IT NO I AM NOT TRYING TO\nREACH THE 10 LINE MINIMUM, writey writey review review y u make me do\ndis IMDb i want to stop thinking about this awful experience, please\naccept this contribution, it is for the greater good\n"},
{"review": "\nI watched the first movie for an hour or so.My baby sister dragged me\nto watch this movie with her. That's the only reason i watched this\nexcuse for a movie.If you like superficial plots,cheeky teen wannabe\nromantic scenes,bad acting,bad direction,predictable ending,predictable\naction,then this movie is for you. If you think you have a good taste\nin movies,don't waste your time on this. There was one scene where a\ngroup of Dauntless ambushed soldiers and everyone but only one of the\nsoldiers getting ambushed is captured and the camera doesn't even turn\nto show what happened to the others. Halfway through the movie,i had\nalready predicted what the ending would be.Probably should have guessed\nit sooner. My advice: don't watch it.\n"},
{"review": "\nJust another poor movie. The acting is pretty bad, from those actors\nyou sort of recognise, but you don't remember the name (except for Kate\nWinslet who must have needed a new handbag!) It is set in an\napocalyptic world, no doubt trying to cash in on the Hunger Games\nmovies. The lead is a poor mans Jennifer Laurence, and I never really\nbelieved any emotion she was attempting to portray. The storyline is\npretty weak, you can see what is coming at most points. There is the\nstandard guy pretending to be bad, and then comes good. They survive\nthe most ridiculous of events, including the Hollywood last second\nsaves. I assume the movies are getting cheaper to make, so they just\nchurn out what they can, hoping to make some sort of money.\n"},
{"review": "\nI only made this account just to be able to write this review. I\nseriously hope Triss dies at the beginning of the next film, cause that\ngirl can't act her way out of a paper bag, her stunt double on the\nother hand, good job, maybe she can fill in if she's that important to\nthe story.<br><br>P.S. For Gods sake, your credits go for a full 10 min, just who the\nhell do you think you are?<br><br>Now unfortunately IMDb won't let me submit this review because it's too\nshort so feel free to ignore this part of may useless rambling as it's\njust here to fill some space.\n"},
{"review": "\nThere was basically no chemistry between Tris and Tobias(Four) with\nTris seemingly indifferent to him. Her acting was one dimensional, flat\nand not convincing. Action sequences seemed disjointed happening\nquickly without much buildup and ending just as quickly. It left me\nwondering to often \"what was that scene all about\". The first movie of\nthe series Divergent was much better and satisfying then this. I would\ndefinitely recommend reading the book instead. The movie Insurgent will\nmake you understand the old truism about sequels. I thought the acting\nby Tobias, Peter and others was fine but the movie limited their\nperformance to much. I definitely believe they needed a more\nemotionally charged starring actress to play Tris.\n"},
{"review": "\nThere box in the book i don't why it was even in there I just added\nmore confusion. Next her hair cut was awful ( I know fault in our\nstars) she could've kept the wig from the beginning of the movie. Next\nthey barely include side characters ( Christina, hector, etc ) don't\nexpect anything from the book. Jeanine doesn't get killed by Evelyn but\nby tori. What is sad is that Peter and Eric were my actors. Then all\nstart randomly running towards the fence after as if they are all gonna\nget out ( which doesn't happen ). Then the Jeanines army randomly go in\namity in the beginning. With barely any Marcus. Evelyn standing ON THE\nSIDE STALKING FOUR . it is a good movie if u haven't read the book. But\nif u reach the book you are screwed.\n"},
{"review": "\nI read the books and loved them. I became a huge fan. I know that\nmovies don't follow the books very well, but I enjoyed Divergent and\ncould not wait for Insurgent. This movie really disappointed me. I had\nhigh hopes for it. The reason was that I loved the book and knew they\nwould change the story, but they changed it so dramatically it hardly\nhad anything in common with the book, and the story/plot they used to\nreplace the books story/plot was incomparable- I loved the book far\nbetter. I guess what I'm getting to here is IF you read the book and\nyou're a huge fan of the book, this movie will disappoint. <br><br>Along with that- the acting was great- but the plot in my opinion was\nvery predictable and poorly written.\n"},
{"review": "\nApparently there's a sex scene in Insurgent. It shows a little flesh,\nit's nicely shot and it's over very quickly. <br><br>For me that sums up Insurgent and the whole series really. It's nicely\nshot but it only ever offers glimpses into character and motive. And\nwhen the characters do talk you only get snippets of what's going on.\nIn the end it leaves you wanting more. <br><br>The main character Tris is neither a leader nor someone struggling to\ncome to terms with being divergent. She gives no great rallying\nspeeches, she offers no great one liners of inspiration and hope, she\nmainly stares and runs. I'd love to know what's going on in her mind! <br><br>Once again, I'm left wanting more.\n"},
{"review": "\nFirst of all how come this Peter got from bad guy to their friend and\nhe still screw them over , and when he got tris to the room with the\nmachine Tris still didn't want to kill him , really , let the guy who\nscrewed you 24/7 go <br><br>Second - 20 people cant shoot a single target , really , are they all\nblind ? , 20 5 year old would hit the target Tris , Four or Celeb <br><br>Third - why did this Celeb run from bullets of Jeanine so he can go to\nthem without force , or did he just know that bullets don't go straight\nto the target or maybe false bullets , who knows <br><br>Fourth - So Jeanine can control their mind and all she does is make\nsuicides , she can easily make them to bring Tris to her , its so\nsimple <br><br>This is my opinion but if you listen to me you will not waste 2 hours\nwatching a movie that insults your intelligence\n"},
{"review": "\nI did not particularly warm to the first film , but gave it the benefit\nof the doubt. My 18 year old daughter emphasized that these type of\nmovies are simply not tailored to the taste of middle-aged gents, and\nsure she was right. The entire movie - save for some impressive CGI -\nfeels like brewing a cup of coffee by hand having the filter fold and\nhaving a watered down cup of something as result. Plenty of action, but\nno suspense. There is simply no feeling the dystopian world itself\nexists outside the studio's interior and the heroine is just another\nbig-eyed babe with made-belief toughness. These type of movies need\nrougher edges, real bad-ass opponents (Kate Winslet, give me a break) ,\na better pacing and less running around within studio's. Fortunately my\n18 year old did appreciate the layered intensiveness of Minority\nReport, though still switch-tasking between movie and tablet. Insurgent\njust made me yawn..\n"},
{"review": "\nFighting scenes are fine. But no matter how many guns are shooting, the\nmain characters just never really got shot.<br><br>Way too many bugs. For example, a smart person like Jeanine didn't\nexpect Tris would go find the rest of Dauntless, and they couldn't\nlocate these 175 people. And no one saw Peter entering the control\nroom...<br><br>Everyone's behavior is predictable. Christina, Peter, Caleb...\nBasically you can tell what they'll do next.<br><br>Finally, what's wrong with all these novels and movies? Evelyn is the\nDivergent version of Coin from Hunger Games, and the high walls reminds\nme of the Maze Runner. Not sure which one comes the first, but\nwhatever.\n"},
{"review": "\nWhile Divergent wasn't as bad as I thought it was going to be,\nInsurgent was worse than I thought it was going to be.<br><br>Like my feeling in the first film, it still would have been a better\nmovie without the whole teen romance part of it, given the two leads\nhave absolutely no chemistry, but in this case, it wasn't just that\nthat made the movie horrible.<br><br>I can't stand Tris (Shailene Woodley), she's just a spoilt, selfish,\npain in the ass and just spent most of the movie storming off.<br><br>The only highlights of this film were Maggie Q, Ashley Judd, Daniel Dae\nKim and Kate Winslet but even they weren't enough to save this from\nbeing a crap film.<br><br>Won't be watching this again and now after seeing this film, probably\nwon't be watching the last two.\n"},
{"review": "\nShailene Woodley deserves better in this listless sequel to Divergent,\na dystopian future where the population is split into factions\ndepending on one's character.<br><br>Woodley plays Tris, a Divergent who does not fit into any of these\noverly-broad categories, is hunted by Kate Winslet's Jeanine following\nthe events of the first film. The settings are more varied as we visit\nthe settings of the other factions, from the rural life of Amity to the\nfuturistic lair of Erudite. However, the direction verges from muddled\nto ludicrous as characters' actions become increasingly baffling as the\nfilm progresses. In particular, there is one elongated scene set in a\ntrain carriage that stands-out in it's silliness; it involves a lot of\nfists and little sense.<br><br>Insurgent picks up somewhat towards the end, leaving enough intrigue\nfor the the follow-up. And though dissolving skyscrapers in the\nsimulations look brilliant, they are not enough to save this film.\n"},
{"review": "\nThis is no where near as bad as some are making out and I wonder if\nmany have even seen it? It is quite a good film with some good action\nand a decent storyline.<br><br>Shailene Woodley and Theo James act well together although there isn't\nmuch chemistry.<br><br>I actually enjoyed this more than Divergent and the ending is just what\nyou want to happen and leaves things open for the third.<br><br>The action scenes are realistic enough and there is plenty going on not\nto lose interest.<br><br>Maybe those who didn't like this movie prefer films with more gore and\nviolence, who knows?\n"},
{"review": "\nSo after Allegiant is coming, I decided to review about this film.<br><br>Insurgent takes place 3 days after Divergent when the dauntless\ntraitors attacked abnegation, tris' home faction and now, that villain\nis searching for divergents to open a box that she thinks will end all\ndivergents. I thought this film was beautifully structured. Like, the\nvisual effects are remarkable and so dazzling, the actors, especially\nKate winslet and shailene woodley are incredibly outstanding! Jeanine's\npolitical words are just admiring, she knows the dangers of the threats\nbut then again, she'a a villain so I have to hate her. The visual\neffects are just the best here, especially during the simulation where\nthe building is ripped etc. So, great film but needs to work on the\npacing and the running time is short, preferred it to be exactly the\nsame length of Divergent or more than.\n"},
{"review": "\nIn this movie, there wasn't a lot of action or new interesting things\nunlike the first movie.<br><br>The movie begins with Tris, Caleb, and Four living in refuge and being\nhunted by the Dauntless. They get snuffed out and meet up with four's\nmom and her gang of rebels. Jeanie is continuing her hunt for\ndivergents. She needs a special one to open this secret box. She uses\nmind control to make the rebels commit suicide. Tris turns herself in\nafter one dies. She's put through the test. Along the way her brother\nshows up. I didn't understand why he was on Jeanie's side now. Four and\nthe rebels break her out of the test but eventually she agrees to go\nback in so she can open the box.<br><br>The box's message tells them life is outside the city's walls and that\nthe divergents are what humanity needs for survival. So the movie\nconcludes with them traveling toward the wall.<br><br>FINAL VERDICT: Nothing great. Skip it.\n"},
{"review": "\nThis whole series of films revolves around Woodley's inability to\nconvince viewers she's a physical force and presence like the character\nneeds to be. You can't take a girly girl and give her a weapon and\nexpect anyone to believe she can beat people up.<br><br>Watching Woodley run in this film is silly -- she has no athletic\npresence to sell this role, and without that, the whole premise\ncollapses on itself. Never mind the overdone stereotypes around her: If\nshe's the focus, the whole story relies on her believability, and it\njust isn't there. Bad casting (i.e., see \"Twilight\" and Kristen\nStewart/Robert Pattinson) can ruin the best of stories, and this story\nisn't even good to begin with.<br><br>Otherwise, the visuals are impressive to look at, and that alone might\nbe worth the price of a rental to see how another director envisions a\npost-apocalyptic world created by a rip-off artist author.\n"},
{"review": "\nDoes Insurgent have it's problems? Yeah but I don't think it's as bad\nas everyone says it is. The acting and cast is impressive and they're\nall giving good performances. The soundtrack is really good, the sets\nare very well constructed, the special effects were also amazing, and\nthe overall message is beautiful. There's some similarities between\nDivergent series and The Hunger Games series but they're still\ncompletely different entities. I have seen this movie three times and I\nstill have no clue why it's so hated. The plot is sometimes rushed but\nit's nothing entirely awful. I thought the ending was good and was\nappropriate. Again, this movie does have it's problems. There were\ncertain parts that I didn't understand and some situations were\ncomplete copies of other YA novels (not Hunger Games though). Insurgent\nhas it's faults, but the bad does outweigh the good here.\n"},
{"review": "\nWhen I watched Divergent, I imagined it to be exactly like the book.\nAfter watching Divergent, I read the book and there was an immeasurable\namount of detail missing in the movie that was displayed in the book.\nIn other words, I expected Divergent to be like The Hunger Games series\nor the Harry Potter series, whose screenwriters and authors tried their\nhardest to explain the book into a movie and succeeded. I gave\nDivergent the benefit of the doubt. <br><br>I thought that maybe the writers for Insurgent would learn from their\nmistakes, but instead they made the second installment of the series an\neven bigger fail. The movie skipped many critical scenes that would\nhelp explain the key events. The ending of the movie was one of the few\nscenes that shook the crowd. Overall, I wouldn't recommend watching the\nmovie, but rather the books. Veronica Roth is a great author and I\nhighly recommend reading the Divergent series.\n"},
{"review": "\nInsurgent<br><br>The worst thing about living in a dystopian world is you're stuck with\nthe same series of iPhone forever.<br><br>Mind you, the adolescent survivors in this sci-fi movie have more life\nthreatening matters to worry about.<br><br>When the head of the Erudite fraction, Jeanine (Kate Winslet), gains\npossession of an enigmatic box that can only be opened by a Divergent,\nshe sends her death squad to round one up.<br><br>Unable to find a suitable subject she then turns to the gifted rebel\nTris' (Shailene Woodley), and uses her Dauntless friends to gain her\nsurrender.<br><br>Now Tris must pass five virtual aptitude tests in order to unlock the\nbox's secret.<br><br>The second installment in the questionable adaptation of the popular YA\nseries, Insurgent at least injects some action and motive into this\nso-far pointless post-apocalyptic parable.<br><br>Incidentally, the only people looking forward to a post-apocalyptic\nfuture besides teenagers, are militant loners. <br><br>Yellow Light <br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nThe first film wasn't too bad, I guess you could say it was acceptable.\nWatchable. Maybe even enjoyable for some. However this one wasn't\nenjoyable, unless you're watching it with the purpose of making fun of\nevery single scene, because in that case, it's an okay movie. I've read\nthe books and this film is almost unrecognizable. Although the\ncharacters (most of them) are the same, the storyline is very\ndifferent. And, let's be real here, the storyline they made up is\nabsolutely ridiculous. So, if you care about the characters or enjoyed\nthe first film, even if not much, I strongly suggest you try reading\nthe books, which I guarantee will not let you down let this film will.\n"},
{"review": "\nJust finished reading Insurgent, the sequel to Divergent and have seen\nthe movie. Gotta say they messed up big time with the movie, why did\nthey change the story that much. I understand that they sometimes need\nto change parts of the story to fit in a movie but come on, this movie\nis a total f#*# up from what the book is. So if you want to know the\nreal story, read the book. I don't even want to know who wrote the\nscript for the movie cause he or she is definitely and idiot. Sorry,\njust my point of view........<br><br>The author, Veronica Roth must be disappointed in this movie.\nDivergent, the first movie, was good but this one is definitely a waste\nof time.\n"},
{"review": "\nI never write reviews for movies. But this film was such a complete\nwaste of my time, even on a Trans Atlantic flight, that I have to leave\na message for someone. I would have rather watched a film I've seen a\nhundred times before than this again. Disappointed.<br><br>I am not saying the acting was terrible, not that it was stellar, but\nthis film delivered nothing except a short semi nude scene of Shailene\nWoodley. <br><br>Maybe if you are a fan of her you'll not hate this flick. I would have\nrather spent the time sleeping or watching another bad movie. <br><br>I am pretty much just typing to meet the minimum requirements to fill\nthis review, but the bottom line is I just want to save your time so\nyou don't have to suffer through some terrible movie to get an ending\nthat leaves you shouting wow this is really it.\n"},
{"review": "\nTris and Four escape the system, but the past still hunts them. I\nreally enjoyed the first movie, there was something unique and\ninteresting about the functions and the training and in the end, it\nwasn't boring as everything was just enough. But the second movie is\nsimply bland. The action scenes are nothing spectacular, the acting is\nbadly and the whole box thing is boring. Tris is a very complicated\ncharacter, she looks like she is empathetic, like she doesn't care, or\nrather like she is bored, but she has a different personality all\ntogether, she is violent and frankly doesn't look the part of a hero.\nIn Hunger Games, Katniss did look like she cared and the whole thing at\nleast had a depth, but I don't know if it is the actors or the script\nthat make Tris look odd. So 3 out of 10, because Miles Teller did give\nsome flavor to it.\n"},
{"review": "\nScience Fiction is normally one of my favorite genre of movies to watch\nand I'm always open to a futuristic story even if they are far fetched.\nBut with this one I'm not satisfied at all. With a budget of 110 000\n000 dollars you would think you could make something better. I saw much\nbetter Sci-Fi's with a much lesser budget then Insurgent honestly. In\nfact I think the whole story is too difficult and too boring. I don't\nsay Kate Winslet or the other actors were bad or so. The story was just\nnot good enough to entertain me during the whole movie. I hope this\nwill be the end. We do not need another divergent story again. If they\nmake another one I seriously doubt that I will watch that one.\n"},
{"review": "\nI had high hopes for this movie, since Divergent was really good...and\nyes I have read the books....But watching this movie , I was like\nummmmm...did I read a different book? They kind of butchered\nit....There was no box....they fight and win under the stupid truth\nserum....and soooo much other stuff....they basically rewrote this\nstory...WHY do authors let them do this? I am super confused....I do\nlike the actors and if I wouldn't have read it, I would probably think\nthis movie was kick ass...DON'T go see it in 3D....its not worth\nit....the 3D is not great....so don't spend the extra money on\nit....overall I give this a 6 because I love the characters....I hope\nthey do book 3 some justice...because it is actually the best of the\nseries in my opinion....so we shall see...I will say Shailene looked\nAMAZING....I wanted to love this...but its just not the right story and\nnot what I expected AT ALL!!!\n"},
{"review": "\nI can't believe they actually made sequel of garbage that's even worse\ngarbage. And I can't believe I watched it. In short, this is Matrix\nwannabe that has horrible script, bad acting, tons of plot holes, and\ncheap drama. Oh, and orgy of special effects that mostly doesn't serve\nthe plot. 1,000 words are way too many to describe this garbage. The\ncast isn't bad at all. Kate Winslet, Ashley Judd, Naomi Watts... have\nno idea why they chose such a garbage. The script is so immature and\npredictable and just... stupid. That mankind would kill so many\ninnocent people for what? An experiment? 6.4 stars? Are you kidding me?\nThis is one of the worst, if not the worst movie I've ever seen.\n"},
{"review": "\nWhat a disappointing sequel. I like Sci-fi but it has to have a lot\nmore connective tissue that Insurgent. If I'm constantly asking myself\nwhere Triss is getting her wardrobe from in every scene when she is on\nthe run, it's missed the detailed mark for me. Poor acting met with\npoor scripting, and left us with a movie that was piecing scenes\ntogether instead of a flowing story line. What storyline? Stating the\nfactions over and over and over again, proved that they were trying to\ncapture a new audience that had not seen Divergent or read any of the\nbooks.<br><br>My 3 points go to the loveliness of Theo James as always, but that's\nwhat held me on until the 35 minute mark until I switched off. Shocking\nshocking shocking.\n"},
{"review": "\nI thought the first film in this franchise was alright, but this was\nfalters a lot more. It's an okay watch, but it's easily forgettable and\nvery far from being original. The concept and the premise just seemed\nway to familiar, and it didn't seem all that in depth when it came to\nthe story. It just seemed like another fugitives on the run, fighting\nagainst a over controlling government that is all about keeping order.\nLike many teen romance movies and Asian dramas or most movies/TV shows\nin general, the hook in the beginning leads to the next installment\nbeing anticipated by it's fans. Overall, I thought this movie was\ntypical and mundane, but it's still somewhat watchable but easily\nforgettable. Mainly because of the script that lacks substance.<br><br>5.8/10\n"},
{"review": "\nI loved insurgent it was good and adventurous. Usually, the second\nparts of movies suck but this one was amazing. But I hope in the third\none Tris doesn't die like she does in the book.I think that they did an\nexcellent job with insurgent. Tris and Four were great. My favorite\npart was when peter was like four do the thing you do when he thought\nTris was dead. I like when all the dauntless people were like were not\nhanding her over to the faction-less people. Four's Mom try to stop\nfour from going after Tris when she went to go turn herself in. I'm\nhappy they killed Eric. He was so determined to kill Four and Tris. But\nwhen Four shot him he didn't even look away he just shot him in the\nhead.\n"},
{"review": "\nI went to see the movie on Saturday and I have a couple things to say.\nFor those who haven't read the book it would have been a good, action\nmovie. However for the book fans it was a little disappointing. To\nstart off with they changed the reason Jeanine was hunting Divergents\nand who kills her. Also they changed the whole idea of a hard drive and\nmissed out some major scenes from the book. The book was a lot better\nand the movie was very disappointing. :( Overall I think that the movie\nwas OK but not the best and the book is so much better as is the first\nmovie they will do the same to allegiant as well. So if you have not\nread the book you will probably enjoy the movie.\n"},
{"review": "\nImagine the weakest moments of Hunger Games, add the bad parts of\nMatrix and finally dash in an even worse love story than Twilight, and\nwhat you get? Divergent - Insurgent - It's urgent to leave the theater.<br><br>After watching Divergent I figured I have to see where this all leads\n(I mean how many scenes can be stolen and put together in a boring and\nunimaginative way), so I brought this upon myself. 139 minutes of\nsuffering. The story itself is full of clichés and the characters are\nso shallow you don't really get attached to any of them (I actually\nhoped for their death so the movie would end sooner but that didn't\nhappen). <br><br>Don't watch. Not this movie. Not for any reason. Do you get me,\nsweetheart?\n"},
{"review": "\nthis movie is literally an epic fail. almost fell asleep watching this\nmovie it wasted my time and money to watch this movie. coming from the\nfirst movie divergent which was awesome and then this. it blows. i was\njust wondering how IMDb had a rating of 6/10. what? are you guys\nserious? LOL. come on thats simply absurd. oh well. :P this movie is\nliterally an epic fail. almost fell asleep watching this movie it\nwasted my time and money to watch this movie. coming from the first\nmovie divergent which was awesome and then this. it blows. i was just\nwondering how IMDb had a rating of 6/10. what? are you guys serious?\nLOL. come on thats simply absurd. oh well. :P\n"},
{"review": "\n'divergent' was such a great movie because it properly balanced action\nwith the story. it set everything up and engaged you, developing\ncharacters so you form a relationship with them, whether you love or\nhate them. 'insurgent' unfortunately, did not have that same balance. I\nwouldn't say I was bored, per say, but definitely had trouble following\nthe point. I don't remember the details of the 'insurgent' book but i'm\nalmost positive it was more entertaining than this. I also don't\nappreciate the break down of the four and tris relationship. they\nbickered a lot in the last two books, but there's also a lot of love\nthere, and i didn't feel it much here except for in one totally\nHollywood scene that contradicts the books. (you'll see what i'm\ntalking about)sorry, holding hands everywhere doesn't count as cute\nmoments for me. also, there was great dialogue and banter from the book\ni recognized NOWHERE. disappointing. if they hated the 2nd book so\nmuch, why bother making it a movie? they should have picked a\nscreenwriter who actually enjoyed it.\n"},
{"review": "\nHere it is, about 1/3 of the way through the movie I stated to play\ngames on my phone. And it was hard to get that far into it. My wife\nwatched the whole thing and she said it was crap.. The first one was OK\nbut this was so boring. Yawn. I think the main character look awful\nwith short hair. Her attitude and personality during the movie makes\nher unlikable. The so called tough guys are a bunch of pretty boys with\n10 pubes between them. I can handle a boring movie if it has\ntitties,swearing or Zombies but no go.. The one good thing I can say\nabout the movie is that it did indeed have an ending and we appreciated\nthat part.\n"},
{"review": "\nAs a Divergent book trilogy fan, I must say this movie sequel is far\nbelow expectations, especially if you have read the book. <br><br>The plot differs way too much, the filmmakers could have done much\nbetter job with the movie adaption. This wouldn't have been the problem\nif some crucial elements of the plot hadn't been left out or completely\ndeformed. Not to mention that there are some scenes that are so\nridiculously naive even for small children (accent on gunfights). All\nin all, waste of talented actors and a prospective story, unlike the\nfirst movie which was done way better. I hope they make a decent third\nmovie.\n"},
{"review": "\nFrom a technical and cinematographic there is nothing wrong with this\nfilm, hence why I have it a five and not lower, in regards to the book\nthis film is awful.<br><br>Divergent did a fairly good job of conveying the first book with\nslightly less depth; Insurgent, however, stripped almost all of the\ndepth and intricacies of the book and turned it into a mindless film\nthat ends all nicely tied up with a bow. To say Insurgent took creative\nliberties with the book would be a massive understatement, what it did\ndo was take out many of the unpleasant but intriguing elements, invent\nmajor changes in the plot that are not remotely congruent with the\nbooks narrative rendering it shallow and patronising to not just adults\nbut also youth.\n"},
{"review": "\nMy score is solely based on the fact that the movies so far have\nentertained me far better than the books. The tweaks in the script from\nthe original novel is certainly value added...so far! The family bond\n(Tris' family), the chemistry of Tris &amp; Four, the evils of Jeanine &amp;\nEvelyn, and most of all the narration, are all brilliantly held up.\nEven more, the characters that did not make it to the movie (from the\noriginal novel) are rarely missed.<br><br>The cast live up to their standards, and the direction is decent as\nwell.<br><br>Having said that, the recent age of these dystopic, virtual reality,\npost apocalyptic themed adaptations already feel like a drag. Still,\nhoping for the last part of the trilogy to come out as good as\nDivergent &amp; Insurgent. In the very least, the series seem much less\nviolent than its counterparts, suiting my taste.\n"},
{"review": "\nThe Divergent Series: Insurgent (also known simply as Insurgent) is a\n2015 American science fiction adventure film directed by Robert\nSchwentke, based on Insurgent, the second book in the Divergent\ntrilogy, written by Veronica Roth. It is the sequel to the 2014 film\nDivergent and the second installment in The Divergent Series.Along with\nthe first film's returning cast, the sequel features supporting actors\nOctavia Spencer, Naomi Watts, Suki Waterhouse, Rosa Salazar, Daniel Dae\nKim, Jonny Weston, Emjay Anthony, and Keiynan Lonsdale.<br><br>Now on the run from Jeanine (Kate Winslet) and the rest of the\npower-hungry Erudites, Tris (Shailene Woodley) and Four (Theo James)\nsearch for allies and answers in the ruins of Chicago. They must find\nout what Tris' family sacrificed their lives to protect and why the\nErudites will do anything to stop them. Side by side, Tris and Four\nface one seemingly insurmountable challenge after another, as they\nunravel the secrets of the past and -- ultimately -- the future of\ntheir world.\n"},
{"review": "\nRun of the mill science fiction film. Insurgent has all the ingredients\nof a sci fi/ love interest movie. Forbidden love, virtual reality,\nconflict with an evil conspiracy, and a final show down. Reminds me of\nThe Hunger games. The beginning is a continuation of part 1 and ties\nthe story into what is happening for part two. The dispersed group of\nrebels must adapted and improvise to fix the problem/conflict. The\nconclusion ties all the lose ends and has the shocking/science fiction\nending. Formulated, but well acted and directed. Kate Winslet performs\nthe villain excellently. If you are a fan of the genre you will like\nInsurgent. If not, the viewer will find Insurgent an inferior movie to\nHunger games. Seven out of ten stars.\n"},
{"review": "\nOnce I saw the reviews I started losing hope but when I saw the movie\nthe hope when up more. This movie wasn't terrible YA like 'The Host'\nbut it's not great like 'Catching Fire'. I read the books and a fan but\ndidn't really mind the changes at all because I love a surprise. It had\na lot of action but I really see how it was confusing and had certain\nsub- plots that weren't really understandable. I really like the action\nsequences and the simulations, but if i hadn't read the books before\nthe movie i would be really confused and would be kind of lost. I also\nsee how some of the characters like Evelyn (Naomi Watts) and Johanna\n(Octavia Spencer) and a lot of others had not much to do like in the\nbooks. They could have done better it was well worth my time not the\nbest. If you loved the books and don't mind big changes then you'll\nenjoy this movie. If you don't care about story and care a lot more\nabout the action then I recommend it. If you prefer the story then i'd\nrather wait until it comes out on cable...\n"},
{"review": "\nI read the first book and really enjoyed it but not enough to go on\nwith the series. The first movie was really good, it stayed with the\nbook for the most part but left out a few things that I know fans were\nupset about. This movie however, made three extremely important and\nloved characters from the book super minor in the movie (heard from my\nfriends). Also, another thing I personally did not like was the amount\nof killing and unnecessary violent shots in the film, of course they're\nfake but there were just too many graphically violent scenes that they\ncould of toned down a bit. I recommend this movie if you liked the\nfirst one, just to see where the story goes. If you haven't seen the\nfirst film yet I suggest watching Divergent first or else you will be\nvery confused.\n"},
{"review": "\nI read all three books and loved the first movie because they tried to\nfollow the original story and did a pretty good job of it. I really\nlike the actress and follow her in other movies. She's also from my\nhometown.<br><br>But this sequel simply sucked. If I were the author, I'd be angry they\nbutchered my story.<br><br>It was obvious to me that they were squeezing the middle and last book\ntogether into some hurried mishmash of warped destruction of both. Make\nmoney quick, was the goal, I'm sure.<br><br>Just so you know, this movie is nowhere near the original story in\ncontent or quality. The original storyline is really good and the third\nbook explains everything, when the characters go outside the fence. I\nwon't spoil it for you and say what they find. The trilogy ends\ntragically, unlike this dumb movie version. I guess they were trying to\ndumb down the plot for what the director perceives as a YA bubblegum\naudience. That is really too bad, because they could have really had\nsomething. <br><br>What a disappointment.\n"},
{"review": "\nWhen a movie is so awful, that you stop mid-movie just to post your\ndisgust of it in several sites.<br><br>Apparently, The true identity of the heroine is lady luck. <br><br>Examples: 1- A full straight hallway of people shooting at her as she\nruns in a straight line and does not get shot. <br><br>2-In a stairway playing dead while being the only one wearing different\nclothes and the soldiers give her a poke with a rifle to check if shes\na sleep and they move.<br><br>Two of many more examples.<br><br>WTF.\n"},
{"review": "\nI wouldn't have been surprised if at some point Freddy Krueger would\nhave popped up to say \"hello\". But apart from a big chunk of the movie\ndealing with Nightmares, this is a step up from the first entry in the\nseries. While still not great (some of the clichés are just really\ntough to handle, one concerning your Whiplash lead, being the one of\nthe worst \"leafs\" you have seen lately), it still has quite a few\nthings going for it.<br><br>One of them being the better special effects. It also tries to distance\nitself from the Hunger Games series (which never hid or mentioned what\nit was copying itself, Battle Royale being one of the sources). Does it\nsucceed? That's up to you to decide. Every teenage movie (YA as the\nmovies and books are called) going for that theme, will have that\ncomparison. I'm not sure if the next one will be the last, but even if\nit so, the next YA movie series will be coming soon ... they are just\ntoo successful ...\n"},
{"review": "\nBefore watching Insurgent I didn't expect much, based on Divergent.\nHowever I stand corrected, Insurgent delivered action, romance and some\ncomedy. It was more unexpected than the first movie and I have to say\nit even made me tear up a bit. Shailene Woodley did an amazing job as\nTris and she delivers a trustworthy performance and she starts growing\non me more and more. Theo James also made a great performance as Four/\nTobias and you just can't help but fall in love with his character. I\nhave to say that Insurgent had me on the tip of my toes most part of\nthe movie and I leaved the theater with an unexpected expectation for\nAllegiant.<br><br>Great movie, great performances. A movie I would recommend. 9/10\n"},
{"review": "\nAs a big fan of science fiction, I have read the Divergent installment,\nand INSURGENT is the best by far. Unsurprisingly I was thrilled to\nwatch the movie - and guess what? - I liked it!<br><br>First, Insurgent starts pretty much at the beginning of the movie with\nTris and Four running to Amity - the kind faction to find a place to\nhide. But they find out the struggles of being in a faction that does\nnot belong to them. Meanwhile, Jeanine is searching in all the factions\nthe one special divergent that will be able to open the mystery box\nthat Tris's parents were hiding from the society. As a result, Tris and\nFour find them selves on the one hand running from Jeannine and on the\nother hand preparing for war against Jeanine.<br><br>Insurgent is packed with action,strong emotional and romance scenes and\nalso lots of well done performances from all the actors ( especially\nShailene Woodley's).<br><br>In my opinion you should ignore all the reviews and go watch a very\ngood movie that contains lots of drama,action,well done performances\nand romance.\n"},
{"review": "\nTake a group of the worst acting Nickelodeon kids, have them directed\nby the worst Disney kid show director, replace the lead actress'\nscreams with an unbearable squawk, plagiarize every thing every other\nmovie made for teens, add a couple cameo appearances by fading stars\n(Winslet &amp; Judd), give some extra actors, who have never even owned a\ntoy gun, over- sized gun props that don't even fit in their hands, and\nfinish with some bad CGI and voice-overs, and you'll have this $19 mil\npiece of unwatchable garbage... unless, you are under the age of 10.\nKids may like. This might quite possibly be the worst movie I have ever\nsat through. Even the scoring was awful. the closing theme song at the\nend credits make you go from an anxious exit to a near sprint for the\ndoor. Somebody should go to jail for this one...and a few agents should\nbe fired.\n"},
{"review": "\nI didn't know this was a sequel and hadn't seen the first movie\nDivergent; subsequently, this movie was confusing.<br><br>It took me ages to figure out what was going on as it assumes a lot. By\nthe time I did, the movie was nearly over. So see the first movie\nbefore you see this. <br><br>Maybe then the movie will be easier to understand?<br><br>I also found myself wondering where they got their change of clothes\nfrom, and various other anomalies in the film.<br><br>Overall, the film seemed to lack good storytelling.<br><br>Having said that, the effects are good, but the plot is a little\nflimsy. Not overly impressed - The Matrix was much better.\n"},
{"review": "\nPlease. Do not watch this movie. Anything you watch would be better\nthan watching this piece of trash.I watched the first movie and I\nreally thought this one would be a little better. But I was very wrong\nabout it. I do not know how someone could accept this horrible piece of\ntrash to be anything good enough to be on the screens. Guys... do\nyourselves a favor. Do not watch it. I repeat.... do not watch it. I\nspent almost two hours of my life watching it and you have no idea how\nmuch I regret by doing so. If you are reading this and think that I am\nexaggerating, you just have to read the other guys who have written\nsomething here.\n"},
{"review": "\nA Lover of the Divergent Series (books) and highly enjoyed the first\nmovie. This second film can only be described as an abomination of a\nbook adaptation. Following the original by less than 5% of the actual\nstory. How it can classified as a film of the book is ludicrous\nconsidering the story is completely different.<br><br>The only thing similar is the vague concept of the film and the\ncharacter names. Everything is completely re- written and not at all in\na good way.<br><br>If you are a movie collector (including terrible films) Add this to\nyour library. If you are a Divergent Fan you will certainly want to\ngive this film a miss and forget it exists.\n"},
{"review": "\nAfter watching this movie I had to re read the book because I thought I\nmust have read the wrong book before. I didn't. Did the makers of the\nmovie read the book? I seriously doubt it.<br><br>This movie is the worst book adaptation since the Vampire Academy\nmovie. (that is still the worst one I have ever seen). They made\nunforgivable changes in the story. Not only is it nothing like the\nbook, it also doesn't follow logically to the previous movie. It is\nconfusing, unlogical and just very bad done. I really liked the book\nseries of Divergent. I'm very disappointed in how they ruined this\nmovie. Don't watch this one if you loved the books.\n"},
{"review": "\nSo like a sequel, lots of expectations. But now that I watched it, I\nthink the writer took some ideas from Logans Run. Different from it but\npost-apocalyptic world with nothing but young people running around in\na manipulated society. But its a good entertaining movie for a movie\nnight. The one adult scene was too little to get them in trouble with\nratings and too much for this movie. Almost like why did they do it. I\ndidn't really sense a good connection between the two main characters\nromantically, even though it was throughout, it just didn't seem\nsincere. Beatrice was distant and distracted, but perhaps that is the\nway it was supposed to be considering her role. The romance was\ndefinitely not the theme here, and a dedicated friend (Theo James)\nwould probably been better. But it didn't distract too much.\n"},
{"review": "\nInsurgent isn't a god awful second trip to the series, it just makes\nmistakes. This time the stakes are set higher, the action pumps up a\nnotch and Ansel Elgort wipes his grin and gets in the fight. Robert\nSchwnetke's previous, R.I.P.D was a disaster, to make up for his bad\nfilm, Insurgent's brilliant direction. Woodley is absolutely amazing,\nElgort, James and Winslet are fantastic as well. This time, the whole\nplot is cheesy, and filled with bad twists and turns. Divergent was a\nmediocre, rushed but well acted adaptation, and Insurgent keeps more of\nthe same genes. Overall, this is a movie for fans only, I have read the\nbook, and this is a solid adaptation if it weren't for the flaws. 6/10\n******\n"},
{"review": "\nOnly a few days ago was I advised to watch a spectacular addition to YA\ncinema. I was immensely impressed with the film-making efforts and the\nscope of imagination in the world of \"Divergent\". It was only a few\nhours ago, that I confirmed that 2015 is going to be as good as last\nyear, when I was exposed to yet another sublime addition to this new\nand compelling saga. \"Insurgent\" delivers just as much as its\npredecessor but with more emotion, gravity, and exuberant ambiance. The\nbeginning and the ending combined make for a great flavoring of the\nsubstance. Shailene Woodley is a luminous bella donna of modern\nmainstream cinema and is unbeatable at what she has to offer. I am so\nglad I got to be a part of this new franchise and now I must commit to\nit as I have committed to The Hunger Games and The Maze Runner\nfranchises --&gt; with great expectations. This was indeed an honorable\nrecommendation\n"},
{"review": "\nI loved the first movie and I loved Insurgent even more. I love the\nactors and actresses, they all are new faces with talent. Also there is\nexperienced stars like Kate Winslet. I must tell, I never thought she\nwould play a villain role perfectly. You can absolutely feel the\nhatred. Also, it was great that they include love between a daughter\nand mother. Most of the movies include love between two lovers but\nnever talk about family love. It was sad that Caleb was willing to\nsacrifice her sister for his ideals. I didn't read the books so I don't\nknow if the movie seems not good enough (I think it happens for every\nsingle book) but there was nothing I would like to change about the\nmovie. Not a scene, not a line, NOTHING. When I watch a movie, even\nthough I enjoy it I always think there is that one scene that should\nnot be in the movie or should be in a different way but not for this\none. I absolutely recommend it if you like sci-fi movies.\n"},
{"review": "\nThe movie was horrible. I saw it, because I was chaperoning four\nthirteen year old girls who were dying to see it. The whole theater was\nfull of a similar group (sex and age). Subpar acting, very idiotic main\nstory; a complete waste of time and money.<br><br>There is really no much more to be said. Perhaps I am not in the\ndemographic for the book and movie (I am over forty years old). but I\ncould not wait for it to finish to go home and spit the mouthful of\npuke I was holding.<br><br>Please take my advise and spare yourself the suffering of this. I\nsacrificed myself for you, and I have come to advise you, from your\nfuture, not to fall as I did.\n"},
{"review": "\nPoor acting, Low Budget, Poor cinematography Boring predictable story\nline. The mom of the Tobis, looked young enough to be his sister. <br><br>The leading female actor was the wrong person for the role. She did not\nportray a rough and tough character..she was just a pretty girl with\nthe perfect eyelashes after a fight scene.<br><br>If you have not seen the first movie of this series do not go see this\nmovie, you will not under7stand what is happening and why. You will be\nlost. <br><br>The movie also did not seem like 3D movie. <br><br>Do not waste your money on this movie, wait till it comes out on DVD,\nTrust me you will thank me for the advice.<br><br>Duane\n"},
{"review": "\nalthough it's not quite like the book, insurgent is just an amazing\nride, with really good special effects and very good acting, especially\nfrom woodley, who is outstanding! the story itself, differs from the\nbooks and it is a bit convoluted, divergent is a bit better in that\nway. Just know what you're in for, a fun action ride. Theo James was\nsurprisingly good, he gave a deep performance. Some of the main cast\nacted like they didn't wanted to be there, Ansel for example. miles\nteller was so funny and good, i really really liked peter a lot more in\nthis movie. so, watch it, it's good, but not perfect,as i said before,\nthe story could be better, it is different from the books, a lot, but\nactually, it didn't bothered me. the final sequence in the film was\nmind-blowing! i just loved it...\n"},
{"review": "\nWatched Insurgent Featuring Shailene Woodley(The Fault In Our Stars) as\nTris Prior, Theo James(Downtown Abbey) as Four , Miles Teller(Whiplash)\nas Peter ,Ansel Egort(Carrie) as Caleb Prior,Jai\nCourtney(I,Frankenstein) as Eric Coulter, Octavia Spencer(The Help) as\nJohanna Reyes, Zoe Kravitz(After Earth) as Christina ,Daniel Dae\nKim(Lost) as Jack Kang ,Maggie Q(Priest) as Tori Wu, Naomi Watts(King\nKong) as Evelyn Johnson-Eaton and Kate Winslet(Labor Day) as Jeanine\nMatthews . as the Sequel unlike The First Divergent film it wasn't\nsetting up it was high Octane from the Get Go also you got see the\ncharacters at there most vulnerable which is great by my Film Standards\nbut the film story was pretty decent though mildly predictable near its\nclimax but still pretty good. Amazing Score By M83(Oblivion) and\nDirection By Robert Schwentke (RED) Better Than its Predecessor but\nStill Average Compared to The Maze Runner and The Hunger Games 7/10\n"},
{"review": "\nI have read all three of the divergent series books and loved them. I\ndidn't mind the divergent film however it wasn't great. I had high\nhopes for insurgent and thought it would be amazing. But when I watched\nit, it felt very rushed and many points in the plot didn't match up\nwith the book. It was extremely hard to distinguish what was real and\nwhat was a simulation. the ending was very bad and didn't make any\nsense,plus it felt like the director over used fighting scenes to hide\nthe fact that the dialogue was not properly thought through. it was OK\nbut i would not advise it, but if you do decide to watch it make sure\nyou have not read the book first or you will be very disappointed!!!\n"},
{"review": "\nI fell in love with the characters in this one, more so than the first\none. I could feel every inch of passion within this film as if I\npersonally connected with these characters in an emotional sense, which\nby the way is something I find rare in most movies, especially sci-fi\nfilms. Though I can't stand movies altering original story lines based\nfrom novels/comics, Insurgent made it work and fitted in delightfully\nlike a missing puzzle peace. Props to the producers for that ballzy\nmove. Overall, this movie sent a rush of vivid emotion through my\nsenses; from anger to fear to being absolutely moved and touched from\nall its glory. A few scenes triggered goosebumps to soar through my\nbody in an epic sensation of emotions. I almost wanted to shed a tear a\ncouple times, but only just almost. Conclusively, this was definitely\none of the most powerful films I've seen since The Fault in our Stars,\nironically enough. Coincidence?.. hmm<br><br>Highly looking forward to Allegiant.\n"},
{"review": "\nDespite (as far as I recall) the first movie being pretty good,\nInsurgent just betrays everything that happened at the end with an\nunsatisfying explanation of why the villain is still in power.<br><br>The movie contains plot twists that a five year old could have\npredicted, and is generally lackluster in it's dialog. With a weak\nplot, boring characters, and a total disregard for all character\ndevelopment from the first movie, this was an extreme disappointment\nfor me. I will admit, there were some good scenes. But a diamond\nsmothered in cow manure isn't very attractive.<br><br>The bottom line is that I didn't connect with any of the characters. I\ndon't know if this is the case, but it seemed like they were trying to\nfit a lot of things from the book in that didn't belong. The plot\njumped all over the place, without getting to know the characters in\nthe plot or subplots. I just got out of the movie and I can only\nremember three of the characters names.\n"},
{"review": "\nIf I had not first read the book before watching the movie, it probably\nwould have been pretty great, however, I did read the book and was\nquite disappointed. As I am aware that for time purposes not every\nsingle detail can be included, though, many of the scenes and details\nthat were included occurred in a way that was unlike the way they\nhappened in the book. Several major characters were either left out\nentirely or their roles were minimized. I also felt as if there was too\nmuch fighting and action and as a result the plot line suffered. It\nseemed as if they were trying too hard to make sure the movie would fit\nthe 3D viewing style, and they forgot about the storyline.If you have\nread the book, I would recommend that you be prepared for a movie\ngenerally unlike the book in many ways. Overall though, this movie has\na beyond wonderful cast who performed BEAUTIFULLY.\n"},
{"review": "\nLet me start off by saying that I was very skeptical when I bought the\ntickets of insurgent because their were a lot of bad reviews for\ninsurgent on IMDb and I thought that divergent was bad because they\ncouldn't get tris' character right, anyways, I went to the cinema and I\ngot the tickets and I watched the movie, and I think they did a better\njob of it then the book deserves. The finally got Tris' character\nright, their was just so many details in the smallest scenes of the\nmovies. <br><br>The only con in this movie, which is a big one, is that they rushed the\nmovie a ton. There was little character development, it was just action\nscenes upon action scenes. Therefore I am going to remove 1 star\nbecause of that. So 7.3/10 For me. :)\n"},
{"review": "\nThis movie was great. It was gripping and beautiful. I will admit it\nwas different from the book, but personally I don't believe that was a\nbad thing. In the book, the author spends 300 + pages of Tris moping\naround because daddy and mommy died and she killed her friend. Although\nthis is still a problem in the movie, it is a lot less focused on. The\npeople who wrote this movie did something the author did not they stuck\nto a plot and left out meaningless details. They kept all of the heart\nof the book without making it drag on and on. It is worth watching in\ntheaters. As someone who read the books, I greatly prefer the\nmovies.This does not disappoint.\n"},
{"review": "\nThe most disappointing movie of 2015 so far. I was looking forward to\nit, since the Divergent was pretty consistent with just a few awkward\nspots. However Insurgent, i would call it complete trash with just one\ngoal - earn money. The visual effects were good, except for those long\nshots being made just for the 3D - like the flying above the city in\nthe end, it looked so cheap. The plot is predictable, very slow/boring.\nMost of the crucial moments are too shallow in their results. The movie\ncompletely lacks logical structure - not sure if its written like this\nin the book too. SPOLER ALERT How everyone is so OK not to guard a guy\nwho had been an enemy just few moments ago? How would whole army get to\nthe building without being noticed?\n"},
{"review": "\n. . . as only the most deluded fan-boy could argue that there's ANY\nsignificant difference between the theme and plot direction of THE\nGIVER, THE HUNGER GAMES, THE MAZE RUNNER, and DIVERGENT. This quartet\nof recent releases all share the common thread of being dumbed down\nversions of THE TRUMAN SHOW, from way back in 1998. All five of these\n\"worlds\" involve characters who are born and raised in decades-long (or\ncenturies-old) closed-system social experiments reliant upon computer\ngaming concepts to conceal the Real World from some or all of the\npopulace. TRON and SNOWPIERCER are two of the less copy-cat efforts\nalong these lines. As for INSURGENT and similar fodder of this ilk\n(including at least five more sequels planned for the ALLEGIANT HUNGER\nRUNNER clone wars), I say: stop hogging all the multiplex screens! We\nneed more films about cancer teens, kids visiting Heaven, and flicks\nbased on Nicholas Sparks novels!\n"},
{"review": "\nI personally loved the sequel to Divergent. I loved it. Packed with\naction, some emotional scenes and humor. You do have to see the\nprevious one in orded to understand some scenes. I love the actors and\nthe characters they played. Was nice seeing them again. The movie is\nnot too long so you can enjoy the show. I do not understand why all the\nnegative reviews. The ending was unexpected, the movie was packed with\nstory line, humor, action scenes. I was at times on the edge of my\nseat. It is worth seeing. The story picks up exactly where the other\nmovie, divergent , left off , so there is a continuation of the action\nand story line. Love the main characters, the brother and Peter. Great\nactors.\n"},
{"review": "\nOne big disappointment. I kinda liked Divergent, but Insurgent tries\nway to hard to be the next Hunger Games. The movie doesn't have a good\nstory line and the acting performances of all the young actors was very\nbad (especially Shailene Woodleys performance was unbelievably bad)\nThis movie tries way to hard to be the next Hunger Games, but it fails\nat each part. Bad storyline, bad acting and an uninteresting story is\nwhy I see this film as a big disappointment.<br><br>If you liked the hunger Games you better wait until the next Hunger\nGames arrives in November. Sorry Divergent fans, but Insurgent isn't\ngoing to be the movie of the year.\n"},
{"review": "\nI really enjoyed this fast paced action adventure. Non-stop excitement\nand an actual storyline...very rare qualities in these times. Oh, and\nwhat an excellent cast. Shailene Woodley and Theo James are brilliant\ntogether. I see them as a very balanced team and both are smart at\ntheir craft. The rest of the crew were outstanding as well, each and\nevery one. I was particularly impressed by Kate Winslet...she is such a\ntalented actor. It seems very easy to be a good 'guy' and be liked all\nthe time, but an actor's true chops are exposed playing the villain.\nThe story is fast paced jammed full of necessary action. I'm not a big\nfan of CGI and special affects - but these spellbinding additions were\nso skillfully melded into to the story - they did not overshadow the\nimportance of the actors or take anything from the story. Masterfully\ndirected...this movie delivers the whole package. Unlike many other\nflicks, I did not get a sense that I was to be bombarded with money-\ngrubbing sequel after sequel. My wallet is very happy about that.\n'Insurgent' is a good movie worth a look.\n"},
{"review": "\nInsurgent uses the concepts of the books, but pretty much is just an\ninterpretation. I loved it. I loved the action. I loved how the movie\nbrought in the third books' story. After reading the books I was not\nhappy. The story made no sense, the 3rd book had no connection with the\nfirst 2 books. I felt like the story should have ended after the second\nbook. What the movie so brilliantly does is make the rest of the story\nrelevant. It feels like there is more to tell at the end of the movie.<br><br>Things I didn't like: Tris looking to boyish. not just the hair, (she\nwas beautiful in Fault in our stars), but her whole demeanour, her body\nis to masculine. It was supposedly only a \"few days later\" from where\nDivergent ended. and she looked completely different. I hated that it\nwas in 3D. Will watch it again in 2D. it wasn't done properly.\nStruggled to focus my eyes. very blurry sometimes.<br><br>Things I loved: Four. And his whole story. The changes they made to the\nstory. the Box.\n"},
{"review": "\nHaving finally just watched Divergent, I was excited to follow it up\nwith the next instalment. It helps that I love this type of movie and I\nwas not disappointed. It certainly reminds you of Hunger Games and\nmovies such as Maze Runner so it's a 'sit back and enjoy the ride' type\nof movie. Action packed with fantastic special effects, the movie takes\nup exactly where Divergent leaves off, and so flows effortlessly. Tris\nplayed by Shailene Woodley and her boyfriend/partner Four played by\nTheo James are very credible as a couple fighting Janene played by Kate\nWinslet the Leader of the five Factions. I like seeing Kate in this\nrole as it's different for her, but she plays a great bad guy. The\nending leaves the viewer on a fairly happy note, but not having read\nthe books, I will be keen to see where the final install Allegiant\ntakes us. Thumbs up!\n"},
{"review": "\nMovie ratings are always interesting, I personally loved the movie\nbecause it kept me entertained, involved and interested. It builds upon\nthe first one (I really feel many of the recent trilogies are really\njust one movie) and to me also offers a deeper meaning within its story\nline and the \"divergent\" concepts. Is it perfect? No, but then again\nthat's an arbitrary opinion. I still highly recommend it as one of the\nmost satisfying movie I've experienced of late. Obviously, one needs to\nhave seen part 1. Looking forward to part 3. (PS: I've never read the\nbooks).<br><br>I saw the non 3D version with the excellent Dolby Atmos sound track.\nThis is an action movie with some personal intimate touches or perhaps\nthe other way around, with what I would call some pearls of wisdom\nbeneath its skin. I will not discuss these in this review because\neveryone's perspective will be based on personal experience and\nperception. Enjoy the experience.\n"},
{"review": "\nIt's really a shame that so many people are such harsh critics on here.\nIt makes me wonder if they actually enjoy ANY movies. The way some\npeople put this movie down is unbelievable. I truly believe this movie\nwas awesome. I've read the books, thought they were OK but a bit\nboring. However loved the movie. There was a few changes from the book\nwhich was definitely needed otherwise would've been quite dull. So if\nyou're looking for a movie that is action packed, full of adventure,\nand set in a post apocalyptic time then this is for you. I went and saw\nthis with a group of people 20-30 yr olds including my skeptical\nhusband and everyone of them loved it. They loved the amount of action\nand I was the only one out of 12 people to have read the books and was\nso glad it exceeded my expectations. I'll be seeing this a few more\ntimes at the cinema\n"},
{"review": "\nAwful movie, probably good for the fans, i'm surprised this franchise\nhas fans.. Awful acting and directing, would defiantly not recommend it\nfor anyone. You might as well go watch the matrix, because it is the\ncopy of that, the only thing good in it is the CGI, thats what the\nwhole movie consists off. Shailene Woodley's character wasn't even in\nit much, isn't her character the protagonist? Theo James Character was\nin it more than Tris. For the acting, there isn't any hype about it,\nshailene showed no emotion or anger, for theo james he was good, he\nshowed everything that was needed. I would say that the movie is good\nfor the fans but thats it. Its just as confusing as the first one for\nthe non-book readers, but the books are suppose to be bad to.. Oh well\nI guess this is another flop movie for the divergent franchise.\n"},
{"review": "\nBetter than expected. Can easily stand comparison with the Hunger Games\nfranchise. In fact, I have found it more real content, if one doesn't\ncount some inconsistencies for too much. Behind all strong CGI effects\nprotrudes more depth than it appears at first sight. The acting is\nstrong too, especially by the 2 protagonists. Although no one would\nsincerely believe that Tris (Sheilene Woodley) has as much physical\nstrength as she displays here, her screen presence is intense and\ncharismatic. Her friend and partner, Four (Theo James) does a good job\ntoo, he seems to have grown as an actor. The film is said to address a\npublic of adolescents and young adults. Add to that, without\nhesitation, also a fully adult, mature audience. Recommended.\n"},
{"review": "\nI would of given this movie 9.8 but that is not an option. Moving on,\nthis movie was very enjoyable. At the start of the movie, I was\nskeptical but as I progressed through the movie, I learned to love it.\nThis was a great book to movie adaptation. Some people said it was\nuntrue to the book and, I admit they did add a couple things. But, they\nstill stayed true to the story. I usually don't say this very often but\nI enjoyed this movie more than the book. I was excellent. In some\nparts, characters were bland, but most of the time, they did good.\nOverall, this movie was great and I would definitely recommend watching\nthis to all Divergent fans.\n"},
{"review": "\nFirs of all I wanna say that its been a while without being disturbed\nin a cinema watching a film. It was so amazing looking all that people\nstaying so focused on the film for 2 hours. Just this fact means a lot\nin my opinion. After I saw the Film I am convinced that Insurgent was a\nbetter than Divergent for 2 reasons. 1. More action 2. More Special\nEffects. Overall this Film like my summary tittle says is an all in one\nfilm: 1. Intrigant storyline (even for the people like my friend that\nDoesn't have seen the first film) 2. An amazing cast and specially\nShailene, Its incredible the part when she has to fights against\nherself. Great performance really. 3. Stunning special effects 4.\nFantastic soundtrack all over the film. After U saw this film in the\ncinema without special emotions well U are an old grandma or grandpa :)\njoking<br><br>Just go and enjoy this film is great.\n"},
{"review": "\nInsurgent disappointed me. The acting was poor, the invasion scene was\npathetic, some of the plot was empty and laughable, and some things she\ndid didn't make sense. There was a lot wrong with the movie, and the\nrebel group wasn't even worked up at all.<br><br>Furthermore, the headquarters for said rebel group have a scene that is\nthe same exact scene that they used to do the Mockingjay \"messages\"\nscenes, with the rose petals on the broken concrete. Minus the rose\npetals in this movie, it was the exact same scene.<br><br>3 of the tests were stupid too, where she had to just be normal, and\nshe didn't even have to try for those tests. And when she was fighting\nherself, her not-that-really-terrible self, there came a point where\nshe sacrificed herself to her copy and her copy just dispersed, rather\nthan \"killing\" her and waking her up.<br><br>It would have been an OK movie had it not been a sequel, but being that\nit was a sequel, they just failed. I'm kinda sad, I was expecting so\nmuch more.\n"},
{"review": "\nI do not understand the critics at all!!! What movie are you guys\nwatching? This movie is fantastic just like the first one. And if you\nare going to throw the comparison of Hunger Games, well the last Hunger\nGames was HORRIBLE!! I like hunger games but lets be honest, the last\none was so not that great.<br><br>I love Theo James and shailene woodley chemistry so much and their\nacting its spot on, this is was a fantastic film... haven't read the\nbooks, so cannot say what it supposed to be like.<br><br>Don't listen to the critics, but lets face it if our job was to\n\"critic\" movies, then we would be always looking at ways of how to\ncriticize something HEAVILY just because we can.<br><br>Don't over analyse it... this is a action packed film, so it\naccomplishes THAT exactly.\n"}
]