[
{"review": "\nThe stand out feature of the Lego Movie for me would be the way the\nLego Universe was created. The movie paid great attention to detail\nmaking everything appear as it would made from Lego, including the\nwater and clouds, and the surfaces people walked on all had the circles\nsticking upwards a Lego piece would have. Combined with all the yellow\nfaces, and Lego part during building, I was convinced action took place\nin the Lego Universe.<br><br>A combination of adult and child friendly humour should entertain all,\nthe movie has done well to ensure audiences of all ages are catered to. <br><br>The voice cast were excellent, especially Liam Neeson's split\npersonality police officer, making the 2 personalities sound\ndistinctive, and giving his Bad Cop the usual Liam Neeson tough guy. <br><br>The plot is about resisting an over-controlling ruler, highlighted by\nthe name of the hero's \"resistance piece\". It is well thought through,\nwell written, and revealing at the right times. Full of surprises, The\nLego Movie won't let You see what's coming. Best animated film since\nWreck it Ralph! Please let there be sequels.\n"},
{"review": "\nI was the only adult who didn't bring kids to the theater and all I can\nsay is that I was leading the clapping when the credits rolled.<br><br>\"The Lego Movie\" was an awesome, super creative, and extremely\nsatisfying film for all ages- that is, if you have ever played with\nLegos. Even people that have never bought a Lego set will this enjoy\nthis awesomely humorous and in the end, heartfelt movie.<br><br>(Notice I am using the word awesome a lot, because one cannot stop\nsinging the \"Everything is awesome\" song played in the movie. Too\ncatchy!)<br><br>The creators did a wonderful job putting all the classic things about\nLegos and making a new movie packed with humor.<br><br>The voice actors were outstanding. You can tell they really enjoyed\ndoing the movie and put in a lot of effort. Liam Neeson was fantastic\nas the Good Cop/Bad Cop. But the most credit to the success of this\nmovie goes to Will Farrell who played the villain, President Business.\nHe gives such a great effort in this movie which allows you to laugh,\nsmile, and want more Lego awesomeness.<br><br>I give the Lego movie a big two thumbs up and is by far the best\npicture I've seen in a few months. Highly recommend this movie to all\nLego lovers who have a passion to build and create something awesome,\njust like the movie makers created this amazingly, AWESOME, film.\n"},
{"review": "\nThe Lego Movie is a winner on several levels. There is a good amount of\nclever gags and I was constantly bursting with laughter. I was\nsurprised by how it contained so many memorable cameos, pop icons and\nfilm references, providing a strong nostalgia factor to older viewers.\nThe playful approach towards movie clichés made it a really enjoyable\nand refreshing watch. The animation is absolutely stunning and the\nblend of CGI with stop motion worked brilliantly. Everything can be\nattachable, making the vibe of each scenario feel very unique and\nunlike anything you've ever seen. The Lego Movie has plenty of heart\ntoo by the end of the journey and it's going to be really tough for\nanother animated film to surpass its inventiveness and charm.\n"},
{"review": "\nThis is my first review. I never wrote a review because I felt other\nIMDb member had captured what I felt like saying. You may think it's a\nmistake to see this movie because it's just a \"toy\" movie. But that's\nwhat makes it so brilliant. There are so many well known characters\nthroughout the film, and it's rare to see such great character\ndevelopment.<br><br>Even though there are so many it's really the charming Emmet (Chris\nPratt) who steals the show. <br><br>It really was a LOT better than the previews made it seem. Charming\nfrom beginning to end, with a few surprises you won't expect. The less\nsaid, the better.\n"},
{"review": "\nIf you watch the trailer and you think its just gonna be a fun\nstop-motion animated Lego movie, you were wrong. The Lego Movie is\nbeyond fun. its creative and it brings back a lot childhood memories.\nThe story was amazing, the jokes were hilarious, and they have great\nintention in details.<br><br>But, the most important thing, the movie remind us to be creative.\nBecause sometimes, As we grow up, in someway, we stop being creative\nand just follow the rules and instruction. For adults, this movie will\nbring back your childhood memories and how you used to play randomly\nwith those Lego. And for a kids, you'll just love this movie, and\ndefinitely makes you want to play with your own Lego.<br><br>totally worth watching movie! even your grandparents will enjoy this\nmovie! 9/10\n"},
{"review": "\nWent to see it with my brother. With the age difference between us we\nboth loved the movie for different reasons. For me it was superb. It's\namazing to see how lego people in a world made by lego, live and\ninteract with each other. There were some funny moments for kids and\neven some moments for adults too. Overall it is a very enjoyable movie\nand it is sure to remind you of your childhood. I recommend it to\nanyone who has ever played with any form of lego whatsoever. You'd be\nsurprised to see how relevant this movie will feel. <br><br>I think all people from all ages can find something in this movie that\nwill warm their heart. A timeless classic for sure.\n"},
{"review": "\nThis film has great animation and a great story, it has an all star\nvoice cast example Morgan freeman and will Ferrell. This film will be\nup on the shelve as one of the greatest films ever animated, ever\nthought about and ever written. When I was a kid playing with Lego I\nnever thought to my self that they will make a film on it now that they\nhave all my Christmases have come at once. Cant wait for the special\nfeatures on blue ray. This movie will be up there with toy story 1 2\nand 3 , the lion king , frozen and wreck it Ralph. The power of good\nfilms are in Lego hands people are genius congrats to all the Oscars\nfor the road ahead\n"},
{"review": "\nI usually enjoy children's films more than my children (Shrek and Toy\nStory being two examples). This one didn't quite hit the mark with me.\nThere's enough to keep the children amused throughout and the graphics\nare what you would expect from today's CGI standards. However, the\nhumour doesn't sparkle like the titles I mentioned above, and the whole\nfilm had a claustrophobic feel to it, a bit like Tron Legacy. The\nending, though charming, was a little lame, I felt. I went to see it\nbased on the score given by previous viewers, but won't be bothered if\nI don't see it again. One other gripe - the continual playing of the\n'Everything Is Awesome' song became very irritating- even the children\ncommented on this.\n"},
{"review": "\nI go to see this movie with other four people, and neither of us like\nit. I was so disappointed, because the trailers make the movie seems\nlike a really funny, unexpected and unique adventure. So, when I came\nhome and know that have a 8.9 in IMDb is just make me feel worst.<br><br>In my case, the humor is not funny, is like they try so hard, the\naction scenes are to fast to really enjoy them and I found the plot no\ninteresting at all. And the worst was the characters, which aside of\nBatman, were too plastic, predictable and just boring for my taste.<br><br>To me, this is just a huge commercial from Lego, but that's just me.<br><br>People really like this movie, and that's great! I'm happy that people\ncan see thing in stuff that I don't, but personally, I found this movie\nalready very overrated.\n"},
{"review": "\nThis movie was so so SO overrated. The jokes were terrible and Emmett\nwas insanely annoying! I mean the first line was, \"He's coming. Cover\nyou butt.\" The moment I heard that line, I knew the movie was gonna go\ndownhill from there. And I was right! The jokes flew by so fast, they\nwent right over my head. But the ones I did get... weren't funny at\nall. Now I will admit I enjoyed the character Unikitty (I know, a\ncat/unicorn. Stay with me). She was pretty funny with the whole\nhappiness thing and she kept saying no about the negative stuff (it's\ncalled irony). Plus the ending got boring. Around the time the people\nappeared on screen, the line cues got slower and slower (and more\nboring). Most people have been saying that the ending sucked (it did),\nbut I like it because the movie finally ended. Anyway, this movie is\nbad! The only reason why I'm giving it a generous 5 is because the\nanimation actually was awesome. That was one of the few good things\nabout this movie. So unless you only pay attention to the animation and\nnot the story line, this is not for you.\n"},
{"review": "\nI'm the only person I know that didn't love this movie. After hearing\nall the rave reviews I had high expectations. I had several issues with\nthe film...<br><br>-The pacing in this film was very off putting for me. Frenetic start!\nCharacter development was weak and things happened very fast for the\nfirst 15-20 minutes. It sort of made my head hurt. Then things slowed\nway down and I found the movie to be pretty boring right until the end.<br><br>-The plot line, where a father is taking away his kids legos, kind of\nirked me and it was obvious from the start he was going to come around\nby the end of the movie. As a Dad, I also thought it had the potential\nto undermine my authority with my kid a little. <br><br>-The punch lines just weren't that funny. I chuckled a few times but\nthat was it, and all the best jokes were already in the trailers. <br><br>-Too much product placement. Lets be honest, the entire move is big ad\nfor Lego. But then they throw in all the other products, and it really\nmade the whole film feel like a giant \"get your parents to buy this!\"\ncommercial to kids. <br><br>So, there it is. My opinion on a very highly rated film that I just\ndidn't enjoy very much.\n"},
{"review": "\nI absolutely hated this movie. Having paid for my family around £10\neach to watch what is basically an advert for Lego, I just feel\ncheated. I didn't find the cheeky nods and winks to other classic films\nfunny, I didn't find the script funny. It was too loud, too slow, too\n... rubbish for me to watch. I'm not sure if this is a spoiler or not\nbut I have no idea what the ending was about, the whole Will Ferrell\nthing with it's preachy lesson of adults forgetting the value of being\nable to be creative - complete tosh. My family felt the same by the\nway. No amount of reading the rave reviews with explanations can hide\nthe fact that this film simply does not live up to the hype.\n"},
{"review": "\nA fun film that made me a kid. Of course, I am already a proud kid.<br><br>Never since TOY STORY 3, I had so much fun in an animated film. Also,\nthis film made me nostalgic as I used play with Lego toys when I was a\nkid. So there are some personal things that are attached with this\nfilm, and indeed they drove me to the film more than the trailer of the\nfilm itself.<br><br>The film is a simple, the premise that an ordinary guy can become a\nhero, only if he believes in himself is well presented. It's not a film\nthat has epic conflict or great story. But it's charm lies in the\nwriting, the wit that is inevitably laughable. Most were laughing out\nloud in the theater, from my 4 year nephew to a 70 year grand uncle. <br><br>The animation is surely top notch, we have to consider that making a 3D\nfilm with real toys is really challenging, and that's where the\nanimation industry in Hollywood must be praised for. Their quality of\nanimation just keeps getting higher and higher and it's so wonderful\nfor the cinema world over. <br><br>The music plays a vital role is conveying that indeed \"everything is\nawesome\". Also, the well choreographed events and the detailing of the\nanimation is great. It's all colorful and pleasing to the eyes and the\n3D technology gets due justification in a few scenes too. <br><br>I am going with 4/5 and would love to catch it again at the theaters\nwith more kids around, I loved it and hopefully if you ever see it, the\nkid in you is revealed or you are helped a great deal by your own kids.\n"},
{"review": "\nOne of many done in good crop of animations that cinema is providing\nincreasingly more often. A definitive example of smart and edgy script,\nwhich can enjoy brilliantly the legacy of one of the most popular toys\nof all time. <br><br>A universe that seems to come from a psychedelic hallucination in\nbreakneck pace, is narrated the journey of Emmet, the most common Lego\ncharacter, that quiet life amidst the building blocks, will become a\ntrue hero. <br><br>Masterfully using the resources of dystopian fiction plus lots of\nhumor, and a visual that never fails to impress, \"The LEGO Movie\" is\ntailor- made for generations accustomed to the pace of video games,\nthat with quite a collection of characters charismatic , a ton of\ncolors and creativity, will deliciously take you until the surprising\nand affectionate outcome that celebrates the power of childish\nimagination.\n"},
{"review": "\nCute movie. That's about it. A few, funny references and jokes. It's\nnot at all an 8/10. I rented it from Redbox for $1.20 and it was well\nworth that price. I will write more lines because IMDb insists on a\nminimum content. Not sure why. My opinions about the movie were easily\nexpressed in the first, two sentences. I will simply fill in wasted\nwords and a waste of my time because this site has become so full of\nitself. Used to be a genuine place to investigate and review movies.\nNow, we have to log in, verify ourselves as ourselves and type\nencrypted words to be \"accepted\". Seems to me that Hollywood doesn't\nreally want \"every man's\" opinions. They are happy to stay within their\nown world.\n"},
{"review": "\nThe outer story is about a kid and his dad who doesn't understand play.\nAn inner story has tokens that elaborate on this, a story that is\nmostly flashiness. The animation is based on Lego and I am sure there\nis a large franchise in the works. <br><br>An inner, inner story is about an intrepid girl who doggedly searches\nfor the legendary special piece. She is a master builder and it is she\nthat repeatedly saves the day and pulls the hapless hero through the\nstory. This character is sadly drawn. She has identity issues, picks\nher men unwisely and is disappointed in not being the chosen one.<br><br>At the end of the movie, when all else is reconciled, her agency is\nremoved as she becomes 'the girlfriend.' That agency is insultingly\nreplaced by the boy's little sister. I think we need to see her again,\nand see her master her situation.\n"},
{"review": "\nThe Lego movie may not seem like your cup of tea and perhaps you have\ninstantly disregarded it as suitable for children alone, but I urge you\nto watch this film at your earliest convenience and see if you too do\nnot become enraptured by this world of LEGO mini figures; and if the\nend credits appear before you have even uttered a squeak of delighted\nlaughter, then I apologise for the misery that must be your life.\nBecause if the LEGO movie doesn't make you chuckle at least once in the\nhundred minutes of on screen time then I cannot say I know what will. <br><br>The fresh faced witty humour of the characters was refreshing and led\nto shrieks of amusement from the prepubescent's that filled the cinema\nand the belly laughed guffaws of parents alike. Unlike many children's\nfilms to date, the film featured none of the thinly veiled innuendos\nand stereotypes (commonplace in Disney films). Deviating from the norm,\nthe 'hero' of the story (subject to personal opinion) was unaware and\nunprepared to fulfil his role and in actual fact, one of the main\nlessons to be derived from the film is that anyone has the ability to\nbe someone special as long as they believe in their own ability to do\nso. Instead of portraying heroism as something designed for the 'elite'\nand privileged few who have been 'destined' for greatness since birth,\nthe recurring theme within the movie is that anyone can be a hero.<br><br>Full review http://thatgirlreadallaboutit.blogspot.co.uk/2014/02/the-\nlego-movie_24.html\n"},
{"review": "\nJust watched The Lego Movie last night...wow...I haven't laughed this\nhard OUT LOUD at a movie in so long! As a Lego fan growing up, I was\neager to see it after the great reviews, and it surely didn't\ndisappoint. All the characters are alive and downright hilarious...from\nBatman to Green Lantern and Kitty and Abe Lincoln. I can't give away\nthe plot, but it is clear the producers and directors also have an\naffinity with Legos. The underlying message comes across as fresh; a\nmessage everyone can relate to. I enjoyed the ending, although when it\ncame I was exhausted from laughing and giggling for an hour and a half.\nThis movie earns the high marks due to the attention to detail, the\nhumor, and the funny story. A definite 10.\n"},
{"review": "\nmy god this movie is amazing, and surprisingly pretty darn good. the\nanimation is spectacular, acting is great. I forgot the premise though.\nit's funny, creative, and enjoyable for any age I'm 19 and I like this\nfilm. great cast, its just a lot of fun. bring your friends, family and\nsee for yourself. this movie reminds me of when I was a kid playing\nwith Legos with my brother and having a blast. this movie is so great I\nthink it should get at least one Oscar if not already. no wonder why\nthe ratings on this site was great. I like the cast its a great one\nespecially for a kids movie I guess what you might call it. would I buy\nthis film yes. I saw it with my dad and him and I were laughing and\nenjoying every part of it. go check this out because its one of those\nmovie you cant miss.\n"},
{"review": "\nStarted watching without any expectations at all. <br><br>What an incredible experience it was. The whole film balances really\nwell between drama, action movie and a hilarious laugh-out-loud comedy.\nEnding had an unusual twist and added depth to the storyline. More\nover, this is a story from which almost everyone could learn something\nnew. <br><br>I really loved the way the heroes were chosen - it was like a bubbling\nmixture of superheroes, magicians and well-known cartoon heroes in\ngeneral. <br><br>Again this is a reminder that we can be much more than society tells us\nto be. This movie should be definitely watched on big screen because of\nmany little details. Definite must see!\n"},
{"review": "\nIf you want either a primer into the experience of having ADHD or an\nendless advertisement for Lego toys, then this unmitigated piece of\nrubbish is for you.<br><br>From the opening onwards it is a series of visual and audio assaults on\nthe viewer, with one demolition scene after another. It all felt the\nsame after about fifteen minutes. Boringly the same.<br><br>Lots of reviewers have commented that it was very funny, but whatever\nhumour was in it bypassed me. I barely smiled at anything in it. And\nI'm not normally the curmudgeon in the crowd.<br><br>Perhaps the nadir came when the human characters were introduced. Just\nin case we didn't quite get the heavy-handed messaging, we needed real\nhumans to show us what it really looks like. And the message was simply\nphilosophical romanticism married to pop psychology. Pleeeeaaaase can\nchildren be fed with something more helpful, if they have to be given\nthese \"moral lessons.\" If this movie was meant to recapture the\npleasure of playing with Lego as a child, it didn't do it for me.<br><br>Three out of ten only because I've got to leave room for other even\nmore dreadful flicks. One of which is most likely going to be Lego\nMovie 2 scheduled for 2018. Ugghhh...\n"},
{"review": "\nThis is a film that I contemplated seeing for a long time. It appeared\nto be another one of those young kid movies with cool explosions and\nsome boring clichés. While yes, the movie certainly contains those,\nthere an underlying message in this film that is undeniably\nheartbreaking for all ages. The strict Lord Business, the boring\nEmmett, the fun and rebellious Wildstyle; it all comes together with\nsuch grace and entertainment and is surely one of the best animated\nfilms of all time. Show your kids, show your parents. This film will\nremind you what its like to be a kid and also remind you that sometimes\nit's necessary to break a few rules.\n"},
{"review": "\nThe Lego Movie is one of those films where you shouldn't judge a film\nby it's cover, making a film based on Lego's sounds stupid right? Yeah,\nbut this film is far from stupid, it's the best animated film of 2014\nand one of the funniest animated films of all time IMO, here's why.<br><br>The story follows Emmet Brickowski, a ordinary Construction worker who\nlives a daily life in Bricksburg With his best friends, until he\naccidentally stumbles across a woman and starts following her which\ncauses Emmet to fall Down a pit and finds the Piece of Resistance,\nsince he found this piece, he is now considered the Chosen one and a\nmaster Builder even though he isn't one of them, since he is a Master\nBuilder, he must stop Lord Business from taking over the world and With\nhelp by comedic side characters and many others.<br><br>The film's characters are amazing, Batman is very funny and Bad Cop is\nthe best character in the film IMO. I thought Benny was pointless and\nUnikitty was a bit annoying but i really like the other characters,\nespecially The Man Upstairs.<br><br>The film's humor is pretty good, many in-jokes and pop culture\nReferences that will keep you pumped up, especially the Terminator and\nIndiana Jones References shown in the Movie, there's many Visual jokes,\nverbal jokes and all kinds of humor thrown in.<br><br>The film's live action scenes are pretty emotional and well crafted,\nbecause of the father and son relationship and the effects of The Man\nUpstairs breaking the Lego pieces, which causes the world to break as\nwell.<br><br>There is no real issues With the film, but the Everything is awesome\nsong is annoying and the film is way too similar to The Matrix, but\nthat's it really.<br><br>The Lego Movie is a funny and clever animated film. The humor, Message,\nemotional scenes, Music, characters and plot is good, but some songs\nare annoying and the film is way too similar to The Matrix. Check this\nfilm out.<br><br>10/10\n"},
{"review": "\nIt's a nice movie but I wouldn't say it was awesome. Concept was good\nbut nothing revolutionary and it was a little bit clunky in its\nexecution. I did actually enjoy the Lego format though. It brought back\nmemories of when I was little and I used to love building with Lego...I\nmean who didn't. I still can't help myself if I have a pile in front of\nme. All the old references were classic and what made it fun.<br><br>While the characters were a little one-dimensional they were lovable. I\ncared about them enough to keep me engaged in the movie, especially\nEmmet. The cameos and different Lego lands were also cool and turned it\ninto a proper motion picture instead of a TV movie. So not my favourite\nmovie of all time but it was a good movie.\n"},
{"review": "\n\"The LEGO Movie\" is a children's film in the category of toys that come\nto life, and may interact with their owners. Such films include the H.\nC. Andersen \"Brave Tin Soldier\" segment from Fantasia 2000, accompanied\nby Shostakhovich's 2nd piano concerto, or Pixar's classic \"Toy Story.\"\nHow does \"LEGO\" stack up (pun intended) against \"Toy Story\"? I gave the\nlatter an 8/10, and I would say \"The LEGO Movie\" is at least 2 notches\ndown. 6/10.<br><br>Of course the best part is the LEGO landscapes. The director\nintermingles plenty of product lines, from Star Wars to Pirates to\nDuplo to Cityscape. It all would have been really impressive if it had\nbeen done with real blocks by stopped motion animation, like some of\nthe fan shorts. Alas, it's just CGI, but at least they stuck to LEGO\nbrick rules all the way through, as far as I could tell.<br><br>The story is humdrum: an evil and not-so-special LEGO figure wants to\nglue everything together with superglue. In the real world, dad wants\nto do the same with his big basement LEGO project, so his son can't\nmess it up. To the rescue comes an ordinary LEGO worker figure who\nshows that anyone can be \"special,\" and convinces the evil mastermind\nto stand down. A bit of pop culture reference is thrown in here or\nthere, a bit of satire now and then, but none of it rises above the\nlevel of a 14 year-old bionicle user who may be watching, never mind a\ngrizzled old moviegoer who wants to see something new.<br><br>So the movie is what it is: harmless, fluffy kid's fare, lacking the\ncharm of stop-motion animation LEGO shorts, with a \"theme song\" that\nruns out of melody and lyrics in about 10 seconds. It's sure to spawn\nsequels to please the 6-10 year old crowd. And it should, they could be\nwatching worse.<br><br>The biggest irony: the only novel idea in the film was the\ndouble-decker couch!\n"},
{"review": "\nIn the Lego Movie, and evil minifig named Lord Business has decided\nthat he is tired of all of the creative people messing around with his\nstuff. He is already the most powerful creature in Legoland, but to\neliminate the chaos he has decided to end the world by gluing it in\nplace with the Kragle (actually a big tube of Krazy Glue). The\nmasterbuilders can only count on the \"Special,\" a minifig destined to\nsave the world by putting the Piece of Resistance on the Kragle.\nEmmitt, a regular construction minifig turns out to be the hero.<br><br>The Lego Movie is a new twist on an old idea, what some critics would\ncall a dystopian science-fiction piece. These stared with George\nOrwell's 1984 and have come to full fruition recently in the movies\nwith The Hunger Games. The purpose of these movies is to exaggerate\nsome aspect of our society, usually an oppressive government or\ncapitalist system, in order to \"expose\" it.<br><br>In the case of the Lego Movie, it is entirely peculiar that the villain\nis \"Lord Business.\" After all, there are barely any better capitalist\nventures in the world than Lego, and this movie in particular has\nalready grossed $260 million. Making a boatload of money off of a\ncritique of Capitalism strikes me as a bit disingenuous.<br><br>Nonetheless, one of the reasons for the big gross is that this movie is\nactually pretty good. There's lots of laughs, great animation, even\ninteresting plot twists and some genuinely touching human drama. You\nhave to love a movie that gives prominent cameos to both Abraham\nLincoln and Shaquille O'Neal. Fair to say you are likely to be\nentertained by this movie, and that is better that simply getting a\nboring infomercial for Legos.<br><br>The problem is that these guys are criticizing Lord Business all the\nway to the bank.\n"},
{"review": "\n*** WARNING! SPOILER ***<br><br>The movie overall was great! Really funny beginning and a interesting\nmiddle, but the end.... Disappointing! If they kept it animation all\nthe way through, it would have been a fantastic movie! (8 Stars).<br><br>The beginning was great! Absolutely Fantastic! The song was very\ncatchy; I had it in my head for hours! The suspense was good, very\nunpredictable!<br><br>The ending when they turned it into real-life felt like Phil Lord or\nChristopher Miller (writers) couldn't figure out a better way of ending\na nice movie!<br><br>Conclusion: Nice film but be prepared to be disappointed.\n"},
{"review": "\nI have seen this movie a couple times now and I just do not get it.\nReally? This is what people are calling the best animated film of 2014?<br><br>It's passable, even cute sometimes. But for the most part it's\nhyperactive and noisy to the point where I was exhausted after seeing\nit. The animation style is cool at first, but really starts to give me\na headache once the action starts. The only remotely interesting\ncharacter was Batman, who was more clever parody than real character.\nThe live action ending is nice until you realize that the Lego company\nliterally releases sets that come with instructions on how to build\nwith them, leaving little room for imagination. On top of all of this,\nthe film is going to be dated by next year. The style and humor and\nwriting and casting screams 2014 and in the worst possible way. People\nare even praising its \"message\"? What message? Some flimsy commentary\non conformity and how everyone is special? Get in line, Lego Movie.\nThat's been done to death.<br><br>And I guess all of this would be okay if it weren't for the awards\nseason coming up. This film is being heralded by many as the obvious\nchoice for Best Animated Picture and that's really sad considering the\nfilms it will be up against. Movies like Big Hero 6 and How to Train\nYour Dragon 2, with their strong emotional cores and gorgeous\nanimation, will be overlooked in favor of this mindless garbage.<br><br>In conclusion, if I wanted to watch a Lego commercial, I would've tuned\ninto a kids TV channel and waited for one to come on. This movie is\nhighly overrated and I can't wait until people finally get over it.\n"},
{"review": "\nThe LEGO Movie, on the surface, seems like a product placement for one\nof the world's biggest toy-brands; the truth about the movie is that it\ncapitalizes on its heritage and satires the basic premise of capitalism\nthrough its character Emit. And The LEGO Movie has a loose but flexible\nplot that never gets too self-restrained: only when the script says so.<br><br>This film is a charming, colourful and memorable treat in animated\ncinema, and the computer-animation is used to emulate stop-motion and I\nliked how the animation didn't TRY to look like it was done on\ncomputers. While it is noticeable that it is CGI, it is done so with\nmemorable style that hardly gets in the way of enjoying what you're\nwatching.<br><br>The LEGO Movie is an advert for promoting not only toys, but\nimagination and thinking outside the 'instructions'.<br><br>Also, Batman is in this movie. So there's that.\n"},
{"review": "\nContent is over the head of children of age to be playing with Legos.<br><br>Yes, some of the humor is funny reference for adults and the graphics\nare excellent...but that's about it.<br><br>The story line/plot could be any of 90% of movies, animated or not. I\nhave no idea how people review this as top notch with a straight face.<br><br>It's an ad they got you to pay for or, at least spend over an hour and\na half to watch.<br><br>I have to write at least 10 lines of text for some bizarre reason here\non IMDb. Some reviews simply don't need that much.<br><br>Seriously\n"},
{"review": "\nI wasn't expecting much out of this movie, after all, it is just about\nlego mini figures, how good could it be?<br><br>Surprisingly, it was pretty damn good. The jokes were clever and they\nall fitted in to either contemporary culture or were related to lego,\nthe storyline was pretty much as expected but still executed in a way\nthat left me thoroughly enjoying it and the effects were better than\nsome Hollywood blockbusters.<br><br>Overall, a totally enjoyable 90 minutes with enough in there for adults\nand children alike.<br><br>Now, where is my lego set????\n"},
{"review": "\nThe Lego Movie is a different and fun animation , see lego that many\nchildren playing in childhood into a movie is something very nostalgic,\nthe film's plot is simple and nothing innovative , the soundtrack is\ncool, and the characters may be the most positive pointer the film, the\nprotagonist is funny is charismatic , the animation has participation\nof comic heroes, Star Wars character , etc., Batman is featured in this\nmovie and it's really fun , Superman also makes an appearance , the\nvillain is to cool, more nothing different from other villains in\nanimated films , the end is very good, and the pace is great , the\nanimation flies , the film's duration also helps , the Lego movie is a\nvery fun animation with the participation of many well-known characters\n, besides having funny moments . Note 7.9\n"},
{"review": "\nWhen this movie was announced, I'm pretty sure the collective wails\ncould be heard all over the world, both from our childhoods being\nruined (\u0085again - I'm looking at you Michael Bay and Battleship) and for\nthe future of movies.<br><br>I have to say I was pleasantly surprised that this wasn't a horrible\nmovie!<br><br>It has a story for the adults to follow, it's hugely bright and\ncolourful, it's funny, and the story also, while predominately funny,\nhas heart and a range of emotions.<br><br>For the kids it has Lego but it doesn't stop at ordinary Lego men and\nwomen, it has plenty of movie characters like Batman, Superman and My\nLittle Pony.<br><br>There is a huge cast of actors voicing this movie, including Anthony\nDaniels and Billy Dee Williams voicing the Lego versions of their Star\nWars characters, and there is even some live action acting in it.<br><br>Now I didn't see this in 3D so I couldn't tell you what it was like or\nif it's worth buying the 3D Blu-ray.<br><br>The Lego Movie is definitely worth a watch, just something to sit back\nand switch your brain off for 90 or so minutes, or even something to\nown for the kids or even yourself.\n"},
{"review": "\nThe movie felt like a LEGO commercial, but it was so obvious,\nespecially when showing the different worlds and themes, that it was\nfine, it just seemed like a satire of their own ads. <br><br>For me, the jokes were very good, we really see the traditional\n(super)heroes act differently than normally, because they are \"played\"\nby a kid, who puts his own thoughts in his LEGO toys. <br><br>What's most interesting is the idea that there's no absolute bad - at\nsome point it stops to be the idea of following the rules, use logic vs\ncreativity : when both are together, there is a transformation of the\nworld, of this LEGO world, that Gabriel Tarde would describe as an\nemergence of values. Something new, different, is created, because of\nthe confrontation of both entities. Unlike most movies, it's not a\nduality (bad vs good, tyranny vs rebellion) in which one wins against\nthe other, it is really a transformation. <br><br>So the next question we could ask is if they used this method to build\nthis movie : did they really, put the values of the producers (eg. :\nmake money), of the actors (e.g. : be well known), of the spectators\n(both kids and more grown-ups), etc. in confrontation to come with a\nfresh, new movie that would not have been created if, for example, the\nvalues of the producers dominated the others... I like to think so, to\nthink that this story is after all, meta-communication about the movie!\n"},
{"review": "\nI went into this film thinking that it was going to be another soulless\nkid film filled to the brim with pop culture references that would be\noutdated in a year. I'm glad to say that Lego Movie isn't that at all.\nThis film starts off with a really catchy song that you'll never be\nable to get out of your head and a main character who is actually\nrelatable. The characters in this film who are licensed works like\nBatman and Superman are actually made into funny characters with their\nown personalities. The ending of this film, I won't say here, is sort\nof a twist but it's a twist that brings this film a strong sense of\ndepth and astuteness that I totally wasn't expecting at all. I highly\nrecommend this movie to kids and adults alike.\n"},
{"review": "\nI really enjoyed watching this movie. It is one of the most\nentertaining film i have seen to date. At first, i was a bit unsure if\nthe movie was really as great as they say it was. From the trailer, it\njust looked like talking blocks with some lame animations. That all\nchanged after i saw the movie. I loved it! It contained so many funny\nmoments as well as cross-overs from many heroes and villains (lego-\nfied, of course). The animations and special effects of this movie were\namazing! I couldn't ask for anything better. It also contained parts\nwhere it will warm you heart and make you full of joy.I don't think you\ncan ask for a better movie. I recommend this movie to people of all\nages because I don't think there are going to be many movies that will\nbeat the Lego Movie's funny and entertaining story line.\n"},
{"review": "\nEverything is awesome!<br><br>I just re-seen this movie with my kids and had the urge to write my\nfirst movie review in IMDb. I like animated movies a lot. I don't see\nthem just because of the kids. This one is among the best and I will\ntry to explain why:<br><br>#It is brilliantly animated. Really, those seem \"real\" Lego, down to\nthe fingerprints on Emmet. The animation called for a lot of\nimagination to recreate blockbuster action \"special effects\" by using\nonly Lego!<br><br># It is heart warming. The are truly naive animation sequences (you\nsmile to the ingenuity portrayed) and the originality of the master\nbuilders is, well, awesome. This is an ode to the imagination of a\nchild and the lost ability of adults to see with those dreamer eyes.\nYou will remind yourself of that time.<br><br># It is smart. It has tons of references to Lego history and pop\nculture. It has jokes to all. It portrays criticism to western way of\nliving, TV culture, capitalism... It makes you think. <br><br>#It is funny. Some jokes seem like they are made for you, because of\nthe multiple references to movies, characters, everyday life\nsituations.<br><br>I truly enjoyed this movie. It has all the elements right. It feels\nlike a great idea brilliantly explored and polished to perfection.\nAwesome.\n"},
{"review": "\nI probably would have loved this movie even if it was merely a largely\nnonsensical romp through Lego lore with groundbreaking visuals and\ncatchy songs. As it turned out, the story had a lot more depth than I\nanticipated. Best movie I saw in 2014.<br><br>The usage of the licensed characters who appear in the movie was a lot\nof fun as well. Lego Batman is pretty much how every 8-year-old boy\nimagines Batman these days.<br><br>One thing I appreciated about the visual effects is that the Lego\nblocks have a definite tangible quality, making them look like the real\nthings as opposed to simple CGI renderings.\n"},
{"review": "\nThe world in this movie is amazing. It feels limitless and imaginative\n- which exactly has always been the strength of the Legos. I love how\nthey didn't just make a dumb funny movie, but actually captivated the\npower the toys have always had. Another amazing thing about the world\nis how it plays with many levels of reality. Of course there are the\nmany different worlds in the Lego worlds, but that isn't all, as you\ncan guess by the 'Man from upstairs'. <br><br>The plot is good. It is of course simple, but what do you expect from a\nmovie that suits for the whole family.<br><br>The humour is amazing - it has many different types of humour, since\nit's meant for people of all ages to enjoy. <br><br>And the animation! I loved it, it looks so much fun compared to the\ntypical Disney Pixar -type of animation. <br><br>Definitely a good movie. It should have won the Academy Award for best\nanimation, simply because it's so much fun and it feels like there are\nso many different philosophical themes one could talk of.\n"},
{"review": "\nAnimation Movies continue to mesmerize with 'The Lego Movie'. This is a\nJoy of a film, a roller-coaster ride, that you wish didn't have to end.\nYes, its that superior a film!<br><br>'The Lego Movie' Synopsis: An ordinary Lego construction worker,\nthought to be the prophesied 'Special', is recruited to join a quest to\nstop an evil tyrant from gluing the Lego universe into eternal stasis.<br><br>'The Lego Movie' is visually dazzling &amp; its heart touching narrative\ncompliment each other, magnificently. The story about the \"special\"\nwithin us all, is told sensitively, although there are some\nmind-bending action bits here too. Its eventually a tale about finding\nthe better in us, in a world, where the good is dying slowly, but\nsurely. The message is important &amp; its delivered with zeal.<br><br>Phil Lord &amp; Christopher Miller's Screenplay is delightfully\nentertaining. it borrows some of the most iconic characters of film\nhistory &amp; pitch them in perfectly, without ever looking overdone. The\nWriting is super-strong at all times. Their Direction, on the\nother-hand, is dazzling. The Visual Effects are OUTSTANDING! A Special\nMention for Mark Mothersbaugh's Score.<br><br>Performance-Wise: Chris Pratt leads the pack &amp; enacts the unlikely\nprotagonist, with full commitment. Elizabeth Banks as Wyldstyle, is\ncharming. Will Arnett as Batman/Bruce Wayne &amp; Liam Neeson as Bad\nCop/Good Cop, are the show-stoppers though. Morgan Freeman as Vitruvius\n&amp; Will Ferrell as the villainous Lord Business, also leave a solid\nmark. <br><br>On the whole, 'The Lego Movie' is truly a masterful tale. Two Thumbs\nUp!\n"},
{"review": "\nDespite its blatant marketing ploy and brand-oriented message, The Lego\nMovie is a delectable postmodern melange of pop-culture references,\nirreverent genre pastiche and elegant hyper-realist animation.<br><br>The casting is inspired. Chris Pratt is perfect as the hapless,\nbumbling protagonist (his predictable, generic style suits the role\nfittingly), Morgan Freeman excels in his overly familiar but enduringly\neffective wise-man role and Will Ferrell is hilarious just being Will\nFerrell (when isn't he?). Complemented by strong performances from\nElizabeth Banks and Liam Neeson, the cast is in good working shape.<br><br>Not only a perceptive satire on the insidious perils of consumerist\nsociety (which alone couldn't sustain the adult appeal), but also a\nnostalgic homage to, and parody of, genres such as the Western, the Cop\nThriller, the Superhero Movie (primarily D.C. it seems) etc., The Lego\nMovie sets up a number of levels of operation and sustains them\nsuccessfully without tipping too far in any one direction.<br><br>The real genius of this film lies in the brilliant writer/director team\nof Phil Lord and Christopher Miller whose razor-sharp scenario whips\nyou along at just the right pace, somewhat in the vein of Edgar Wright\n(it shares a great deal in tone with that of Scott Pilgrim vs. The\nWorld).<br><br>Overall, if you can survive being manipulated by a frustratingly\nclichéd 'message', and unfortunately you will be, then you will\nthoroughly enjoy this movie, as I did, for its many visual and\nconceptual treats.\n"},
{"review": "\nThe Lego Movie: this movie is bloody amazing. I remember seeing the\ntrailer for this a few months before it came out, and I was sure it was\ngoing to be awful. Like in comparison i thought the purge anarchy was\ngoing to be citizen Kane and this the room. But wow this is fun. I mean\nthe trailer makes it look like a series of flat jokes, but it's really\na special story, and the fact that it didn't win the animated Oscar,\nlet alone get nominated, has to be one of the biggest snubs this\ndecade. The Lego movie is a really fun movie that anyone can enjoy, the\nending is unexpected but extremely cleaver, and overall just really\nfun. 8.3 is the number for this one, and sincerely is one of my\nfavorites, and one of the best, of 2014. If you guys want more in depth\nreviews, please be sure to check me out, Quinn C with the James Bond\nemblem, on YouTube. I do daily videos reviewing films of old and new,\nand also give very in depth analysis of the James Bond films. So if you\nenjoyed and/or appreciated this review, please be sure to check me out\nat Quinn C on YouTube with the James Bond emblem, thanks\n"},
{"review": "\nThe nice thing about Legos is that they can be anything. They have the\nplastic malleability to become structures, characters, villains; you\nname it. Of course, just about every movie for kids is about saving the\nearth or the universe. This is a non-stop fountain of the primary\ncolors that keeps going. The strength isn't so much in the plot but in\nthe multiple way the Legos can be used to show emotions and true\n\"humanity.\" There is some romance and some brinkmanship, but ultimately\nit gets down to true creativity. The universe is truly the Lego board\nand if you or your kids have ever played together, you know the\noverwhelming possibilities. There are some pretty good songs in here\nbut, I must admit, they have become pretty tiresome.\n"},
{"review": "\nThe Lego Movie is a phenomenal film which encompasses all the traits\nthat make a great animation film. The animation style is the real trade\nmark of the film as it is shot to appear as if it were a stop motion\nfilm. This works perfectly in the film with its utilization of Lego\nblocks and allows the film to do certain things very effectively which\nthe traditional animation features could not.The movie also composes of\na stellar voice ensemble such as Nick Pratt, Will Ferrell, Will Arnett,\nMorgan Freeman, Elizabeth Banks and numerous other comedic stars which\nperfectly fit their characters and add flair to the film. The film\nboasts many laughs and a general fun experience to all ages with its\nintriguing direction, relatable story and comedic voice cast. After\nwatching The Lego Movie I am excited to see where LEGO goes from her. <br><br>9/10\n"},
{"review": "\nFar more fun than the concept really had any right to be, braving new\nhorizons while still remaining loyal to the beating heart of the\nproduct and its passionate generations of fans. Simply enough, this is\na perfect encapsulation of the kind of imagination, enthusiasm,\nadaptation and sheer randomness that runs like lifeblood through the\nspirit of a happy childhood. It jabs in delightfully unexpected\ndirections. It bends physics without an explanation (nor a need for\none). It casually hops from one licensed fantasy to another, mashing\nGreen Lantern with Gandalf, and doesn't even slow down to consider the\nrepercussions. At the best of times, I felt like I was a kid again\nmyself, lost in nostalgia and the infinite potential locked away within\nevery new block. And while the last act overreaches in an effort to\nreally hammer the morals home, otherwise this is pretty much a direct\nhit. Crafty, funny writing, a dazzling array of vocal talent and a\nplayful, distinct visual style - this is the kind of family film I can\nalways make room for.\n"},
{"review": "\nIf you have noticed putting live action segments into a cartoon is as\ntrend these days.<br><br>Anyway, I was raised near Billund where Legoland opened in the 1960's.<br><br>Many rides and shows had went and go.<br><br>From the vanished 3D shows to shows with dolls.<br><br>Loads of LEGO movies and shows was made for DVD and VHS.<br><br>Rows of LEGO games came out like LEGO LOCO.<br><br>Finally in 2014 the LEGO movie was released in the cinemas.<br><br>We follow a LEGO man that lives his ordinary life.<br><br>But later on he must save the World.<br><br>It all ends in a Live Action dimension.<br><br>The climax ends abrupt, and leaves place for the upcoming second LEGO\nmovie.<br><br>Watch the movie over and over again, as there are an explosion of\ndetails.<br><br>Set the volume to max too.<br><br>The LEGO maniacs will have their field day here.<br><br>10/10\n"},
{"review": "\nUntil the last 20 minutes of \"The Lego Movie,\" I was about to call it,\n\"the best animated feature ever\". Full of the madcap \"Looney Tunes\"\nhumor and sly references to the New World Order and libertarian\nadvocacy, I had, to that point, loved every minute. THEN, Will Ferrell\nshows up and spoils everything. Actually, the unfortunate choice to\n\"wire the ghost\" was the first slip-up. However, the live action scenes\nwith Will Ferrell just laid there. Most of the problems in these scenes\nare likely the fault of the director or editor. In any event, they\ncompletely destroy the pacing of the movie. Darn; and I was hoping to\nsay I liked \"The Lego Movie\" better than \"Big Hero 6; which,\nironically, reaches its level of brilliance at nearly the same point as\n\"The Lego Movie\" falls apart. Oh well, NEARLY \"everything is awesome\".<br><br>I give \"The Lego Movie\" an \"8\".\n"},
{"review": "\nThis is very funny for both old and young, especially the younger crowd\nwill see all the wonders that you can create with Lego :) and the grown\nups just get the childhood back and it is riveting.<br><br>I grew up with LEGO, being from Denmark it was a big part of what was\nthe thing to play with, we even visited Lego Land in Jutland several\ntimes when I was a kid. This film really brings back happy times.<br><br>But the film itself is also very well made and really has humor, great\ntiming, a good story and much much more. There are small things\neverywhere, in the big scenes and in the dialogs and the characters not\nall is for the younger crowd, but it is enjoyable for all ages and\nthere is never a dull moment.\n"},
{"review": "\nI was much impressed, what is a giant commercial for Lego is one of the\nmost self-aware movie I have ever seen. It is not just for kids, the\nmovie is funny and full of references that will be impossible or hard\nto get for kids (well, I for one did not show Terminator 2 to my\nchildren). CGI is also very, very well done.<br><br>Emmet is a boring lego piece living in a perfect world. He's lonely,\nbut he lives in a lego city where pieces live in harmony, follow all\nthe rules, consume over-priced coffee, watch stupid TV shows and listen\nto catchy (and stupid) songs played non-stop on the radio, under the\nguidance of the benevolent President Business. Nothing like our world.<br><br>We find out later the story is made up by a kid, Finn, in his basement,\nwhere his father, the man upstairs, a lego aficionado, created several\nsets representing various world (Far West, big city...). Of course, for\nthe man upstairs, the sets are supposed to be a depiction of reality,\nnot a playground, but Finn creates a story in which all the sets are\nlinked together, and this is one of the best idea of the movie. When a\nchild tells a story, realism and plausibility go out of the window, you\ntake what you like and what you have on hand, mesh it together and\nvoila! a plot. <br><br>Against the Man Upstairs/Lord Business, who intends for his creations\nto be final, and will glue them in place once they are perfect,\nFinn/Emmet wants his toys to be... well, toys. To be used as toys, not\ncollections, and who cares if the set is supposed to be a house? Why\ncouldn't we make a spaceship out of it?\n"},
{"review": "\nThe Lego Movie (2014): Dir: Phil Lord, Chris Miller / Voices: Chris\nPratt, Will Ferrell, Elizabeth Banks, Will Arnett, Liam Neeson: One of\nthe most original and impressive animations since Toy Story. Physically\nit regards the building toy blocks that have been around for decades.\nIt also symbolizes the building of friendship and loyalty. Chris Pratt\nvoices Emmet an average construction worker who comes across a\nmysterious female rebel named Wyldstyle. When he falls down a hole he\nis arrested and learns that he has a piece of the resistance attached\nto him. The villain is Lord Business whose war is against anything that\ndisturbs his view of normality. He plans to use a substance called the\nKragle, which is a tube of Krazy Glue with certain letters rubbed out.\nThis is being used to glue the universe in place. Directed by Phil Lord\nand Chris Miller whose previous credits include the overrated 21 Jump\nStreet. Emmet is the portrait of the average joe and indicates that\neveryone is important and gifted. Emmet is not that intelligent yet has\nthe amusing ability to come up with bizarre ideas. Elizabeth Banks\nvoices the rebellious Wydestyle who is out to find her importance. Will\nArnett steals moments voicing Batman who is Wydestyle's boyfriend. Will\nFerrell voices the tyrant Lord Business as well as appear in reality as\na struggling father. Liam Neeson steals moments voicing Good Cop / Bad\nCop who is the henchmen of Lord Business. There is also a host of other\npopular pop culture characters as well as hilarious references that\nwill allow adults to build on enthusiasm as well as children. Score: 9\n/ 10\n"},
{"review": "\nIf you have kids, be sure to watch this movie. As its funny and\nsometimes sad. But in one word the animation is well done. Its a must\nto see, and you will love it again and again because each time you see\nnew things that you haven't seen before.<br><br>And yes according to me it is suitable for young children also, so sit\nback relax and get ready to enjoy.<br><br>Be sure to watch the other lego movies also.<br><br>I find it amazing how they can make such a movie with lego blocks, it\nmust have been a lot of work.<br><br>Just go and see it and i know you will like it, even if you did not\nlike to play lego when you were a kid. Relax they do not want you to\nbuild something.\n"},
{"review": "\nhe Lego Movie (stylized as The LEGO Movie)[6][7] is a 2014 computer\nanimated adventure comedy film directed and co-written by Phil Lord and\nChristopher Miller, distributed by Warner Bros. Pictures, and featuring\nthe voices of Chris Pratt, Will Ferrell, Elizabeth Banks, Will Arnett,\nNick Offerman, Alison Brie, Charlie Day, Liam Neeson, and Morgan\nFreeman.<br><br>Emmet (Chris Pratt), an ordinary LEGO figurine who always follows the\nrules, is mistakenly identified as the Special -- an extraordinary\nbeing and the key to saving the world. He finds himself drafted into a\nfellowship of strangers who are on a mission to stop an evil tyrant's\n(Will Ferrell) plans to conquer the world. Unfortunately for Emmet, he\nis hopelessly -- and hilariously -- unprepared for such a task, but\nhe'll give it his all nonetheless.\n"},
{"review": "\nAnd I finally watched it! The Lego Movie!<br><br>The LEGO Movie is a 3D animated film which follows lead character,\nEmmet a completely ordinary LEGO mini-figure who is identified as the\nmost \"extraordinary person\" and the key to saving the Lego universe.\nEmmet and his friends go on an epic journey to stop the evil tyrant,\nLord Business<br><br>So, when I was a kid, I was a big fan of legos. I was playing with them\nall the time. But now, when I saw this movie, I am thinking:\" Well, I\nstill have my legos under the bed.\"<br><br>There is a fantastic crew of actors here. We have Will Arnett (Batman\nvoice), Elizabeth Banks (Wyldstyle), Will Forte (Abraham Lincoln),\nJonah Hill (Green Lantern), Morgan Freeman (Vitruvius), Dave Franco\n(Wally) and, of course, Liam Neeson (Bad Cop/Good Cop). And all of them\ndone well. I wasn't expecting this much.<br><br>Humour in this movie is for everyone. There are jokes that kids can\nunderstand, but parents and older crew will laugh as well. There was\none joke that really reminds me of \"Two and a half man\", and it was, of\ncourse, \"Honey,where are my pants?\"<br><br>Also, song \"Everything is awesome\" is as well, awesome. It's so catchy\nthat I must share it on facebook. The song is not complicated and it's\ngood rhythm.<br><br>There is a lot of clichés, but with everything mentioned up here,\nthat's nothing. Some of clichés really reminds me of \"Ice Age\" series\nwhich were having a lot of clichés as well.<br><br>So, this movie is really entertaining commercial for legos, but\ncommercial with humor and good acting crew. Definitely recommending it\nto everyone!\n"},
{"review": "\nNovel graphics, good fun.<br><br>I had low expectations for this movie, thinking it was simply a kids\nmovie. Turns out it is suitable for all ages. Interesting, though not\nthat original, plot. Very funny, snappy, dialogue. Generally, a good\naction-comedy.<br><br>Obviously, the thing that stands out most is the use of Lego for\neverything. Incredibly original in that regard.<br><br>Great casting for the voices: Chris Pratt, Will Ferrell, Elizabeth\nBanks, Liam Neeson, Will Arnett, Jonah Hill, among others. Best of the\nlot, in my view, is Will Arnett as Batman. Very funny.<br><br>Not perfect though. Plot gets quite random, almost silly, towards the\nend. The novelty of the graphics wears off too. Plus there are scenes\nwhere the Lego graphics don't do the movie any favours - you sometimes\nstruggle to figure out what you're seeing.<br><br>Overall: good entertainment.\n"},
{"review": "\nThe Lego Movie has been cult well among many fans, as a great visual\nexperience, and the film can be seen as living to its expectations. It\nmight seem like a reach to base a film essentially on a series of\nplastic blocks, but this 3D animated comedy has some visual inspiration\nbehind it, even if the big laughs aren't quite plentiful enough to\ncarry a feature-length production. The story essentially follows the\nmisadventures of Emmet (voiced by Chris Pratt), an ordinary Lego\nconstruction worker who stumbles on to a diabolical attempt at world\ndomination by President Business (Will Ferrell) and his henchmen led by\na two-faced cop (Liam Neeson). So Emmet turns from social outcast to\nunlikely hero as he teams with Batman's girlfriend (Elizabeth Banks)\nand a blind man (Morgan Freeman) who dispenses pearls of wisdom in an\neffort to save the day. Overall, a very well made film which has been\nin production for several years back.\n"},
{"review": "\nYou might not expect this to hold together the attention of an older\naudience, but this movie is all right angles where it counts and\nmachined to a fine tolerance. It's actually a brilliant deconstruction\nof the interchangeable pieces of the tropes of adventure stories, as\nalways centered on a substitutable everyman who just want to fit in.\nHis instincts are not heroic, if anything he is actually quite yellow.\nBut the movie builds a magnificent plot out of seemingly disparate yet\ninterlocking components making for a veritable play-set of a universe.\nIn all this it's a film that is much more than the sum of its parts ;)\nDuplo.\n"},
{"review": "\nAn amazing animation. I've never seen a stop-motion movie before that\nsucks you into the visual aspect so much. The dialogues are playful yet\nhave a deeper meaning: the children see the playfulness, the adults see\nthe deeper meaning. The story is relatable to children and their\nparents. The big moral is that you should let your children create\ntheir own world through toys and how parents should give them the\nfreedom and material to do so. The story during the animated part is\nmeant to entertain and is about the fight between good and bad.<br><br>The only negative thing I can mention is that at a certain point the\nmovie changes location to the real world which kicks you out of the\nanimated world that kept you so close to the story... The whole movie\nwas about the fight between good and bad, freedom and brainwashing and\nin a sudden it's about a father that doesn't gives his child the\nfreedom to create an own dreamworld. This kinda breaks the flow you\nfelt during the movie. But it's not that bad that it ruins the movie\nand when it goes back to animation you quickly pick the story back up\nagain.\n"},
{"review": "\nI found myself not engaged with the film as I was with \"The Boxtrolls\",\nsome of the CGI character design and animation for the heroes is your\nstandard character design and animation like Disney. And it wasn't all\nthat special, but it was more enjoyable than The Boxtrolls on many\nlevels. But it should've been nominated for an Academy Award because\nit's better than 'Big Hero 6' also, that little-teen, generic movie. I\nfound 'Mr. Peabody &amp; Sherman' a better movie than The Boxtrolls and\nkept me engaged throughout despite a little brat in there. Unlike \"Big\nHero 6\", it actually makes you laugh throughout the film. It also makes\nyou feel scared of the villain, pretty much the most well-thought out\ncharacter I've seen in a while.<br><br>I got this movie on DVD, expecting something cute and surprisingly\nbreathtaking like \"Wreck it Ralph\" but it was somewhat boring like 'Big\nHero 6' with some entertaining parts. The movie is too weird like Emmet\ncan get annoying with his talkative self and Unikitty (I don't remember\nmuch about her).<br><br>The ending was an okay one, but it was just added in there as a cloying\npart. It was too sad, too, but then everything's okay.<br><br>I don't think that many people over the age of 9 will enjoy this\nthoroughly.<br><br>All in all, The Lego Movie is an overrated film that is not for\neveryone and I really recommend Wreck-it Ralph more. It was an engaging\nand hilarious film from start to finish that will be something to watch\nover and over again. Don't expect much special from it.\n"},
{"review": "\nBatman: I only work in black and sometimes very, very dark gray.<br><br>Initially, the most promising thing about \"The LEGO Movie\" was its\nenormous cast of recognizable names (and voices). Other than that, I\nwasn't sure if the film would have anything interesting to tell us. It\nsounded like a bad idea, one that would have some decent child humor\nbut nothing beyond that. For like the 10th time in one year, I was\nwrong. 2014 was full of surprises, and \"The LEGO Movie\" was a big one.<br><br>Besides the many stars in the movie, all of the characters are\ninteresting, mainly because we know a lot of them from other films,\nshows, LEGO sets, etc. but here they play a caricature of the real\nthing, exaggerating their characteristics. It's actually quite funny\nfor anyone at any age. That's the main great thing about this film, its\nwide appeal to people of all ages. It's the definition of \"fun for the\nwhole family\".<br><br>The story in \"The LEGO Movie\" is hectic and not entirely serious, but\nthere are actually a few interesting lessons to be taught. Not of\nmorality or life choices (obviously, it's a movie about LEGOS), but\nones about freedom to play with LEGOS how you want to. Sound silly?\nThat's because it is, and it's proud of it. So yes, the movie has a\nnice, interesting, visually awesome story.<br><br>The last thing I want to talk about is how interesting the movie is\nvisually. EVERYTHING is made from LEGOS. Look in the backgrounds,\neverywhere, it's all LEGO. The creativity is massive, and the visuals\nand colors alone will entertain kids. Add in some really clever humor\ncoming from the voices of stars we've come to know and love, and you've\ngot an excellent family film that will be remembered for a long time.\n"},
{"review": "\nThere hasn't been any movie, even in animation, which has the visual of\nThe Lego Movie. Having one of a kind trait that everyone can relate to\nis a significant edge. It assembles the visual of CGI for stop motion\nfeel, vigorous cast and truly entertaining script filled with pop\nculture references. The movie is as exciting as getting your first set\nof Lego.<br><br>Emmet (Chris Pratt) is a Lego construction man, the run-of-the-mill\nordinary one. He stumbles across a mysterious piece after his work day\nis over. What comes is the heroic journey where he gathers friend to\noverthrown the nasty antagonist. This simple premise is used with very\nsatirical tone, and also unexpectedly deep narrative. The movie doesn't\ndwell too seriously on already known formula, it administers them with\nunusually fresh variety. It delivers an underlying message that\nresonates not only to children, but also all ages.<br><br>Cast is simply wonderful. Everyone has their own distinguish\nover-the-top flair. The characters are representation of pop culture,\nfrom Batman, Morgan Freeman's prophetic Vitruvius to Liam Neeson's no\nnonsense Bad Cop. Glued by an amazingly witty script and lightning fast\npace, the movie tirelessly delivers spot-on jokes, crazy one-liner in\naddition to surprisingly tender moments. The humor is sharp as well as\ncynical, they churn out humorous banter in nearly every conversations.<br><br>Graphic is nicely done, nowadays film animations have their own\ndifferent lively styles. However, The Lego Movie utilizes familiarity\nof its brand to the audience. It's compelling to see the minute details\nthey put in, creative design such as the spaceship parts or the waves\nof ocean that imaginatively engaging, even if some looks simplistic.\nThese features also contribute naturally on its many inside jokes.<br><br>The Lego Movie embodies the spirit of the toy, it's fun, ageless and\noffers delightful experience.\n"},
{"review": "\n*** This review may contain spoilers ***<br><br>Everything in \"The Lego Movie\" is, indeed, awesome.<br><br>Awesome as in the sort of silly yet wily kid-appropriate PG-rated film.\nIn my opinion, this is the best performance by Will Ferrell that I've\nbeen waiting for ever since \"Elf\" came out more than a decade ago.<br><br>It is exceedingly cool that a major-studio family film refuses to\nsimply capitalize on merchandising spin-offs by offering an oppressive\n100-minute commercial. Instead, \"The Lego Movie\" manages to be a\nsmartly subversive satire about the drawbacks of conformity and\nfollowing the rules while celebrating the power of imagination and\nindividuality. It still might be a 100-minute commercial, but at least\nit's a highly entertaining and, most surprisingly, a thoughtful one\nwith in-jokes that snap, crackle and zoom by at warp speed.<br><br>I had no interest in seeing this film; however, all my friends that saw\nit said it was a great movie, and I decided to give it a watch. This is\nthe best film of the year and, as far as I'm concerned, the best film\nI've seen if a couple of years. It is also the most subversive,\npro-liberty film since (I kid you not) \"V for Vendetta\" with smart,\nwell-deserved swipes at the head of the government. Bring your adult\nfriends if you don't have children of your own.<br><br>It is a wonderful movie, I had the same reaction to it as I had seeing\n\"Shrek\" and \"Toy Story 3\". If you do not have your own child, now is\nthe time to offer to babysit a niece or nephew. It's nice to see that\nimagination can still show up and surprise you in the best way\npossible. It was way better than it needed to be, for a toy- based\nmovie. With a message at the end that should be seen by many parents.<br><br>Best movie of the year, so far.\n"},
{"review": "\nThe Lego Movie was one of 2014's biggest blockbusters bringing over\n$257 million domestically, so the chances are you have seen this\nalready. But if you were reluctant as I was, you may still be thinking\nabout it as award season rapidly approaches.<br><br>As the budget for the animated movie is reported to be only about $60\nmillion, it is no doubt that sequels, prequels, and related projects\nare rapidly in the works at Warner Brothers, proving once again that\nthere is vast market for good, family-friendly movies.<br><br>Wait, did I say \"good?\" Well, much to my chagrin, I did wind up liking\nthe movie more than I had expected. The animation is outstanding. The\nvoice casting is spot on and quite diverse \u0096 Chris Pratt, Liam Neeson,\nElizabeth Banks, the 3 Wills (Forte, Arnett and Ferrell), Tom Welling,\nChanning Tatum, Jonah Hill, and Morgan Freeman, among many others. The\nstory, while not original, has enough twists to keep it interesting for\nyoung and old. But be warned, the theme song \"Everything is Awesome\" is\njust catchy enough that it will stick in your head more than you want\nor are willing to admit.<br><br>As with most good movies aimed mostly for the young audience, this\nmovie keeps the grown-ups interested with a non-ending stream of\ninsider references. You do not need to catch the director's knowing\nwinks to the audience to understand the story, but it is enjoyable to\nsee how many they sneak in.<br><br>In short, you can safely watch this with your children without fear of\nwasting their time or yours. You can even watch it if there are no\nchildren in the audience.\n"},
{"review": "\nI love(d) Lego... they are among my fondest childhood memories. Even as\nan adult i consider Lego to be one if not the best children's \"toys\".<br><br>It is exactly that which is addressed in the movie. - the way children\nuse Lego and the way an adult might use Lego - and the movie does a\ngreat job displaying it.<br><br>I have read plenty reviews that speak of the antagonist as being \"evil\"\n- but personally i did not think of him that way. He was using Lego\nfrom a different point of view for a different purpose - but of course\nthat prohibited the child to make use of Lego his way. There is a\nmorality about creativity and joy in the movie of course - but most and\nforemost there is the very basic joy to create.<br><br>Style and artistic creativity is well done, the mixture between CGI and\nstop motion is for the most part seamless.<br><br>An easy 8/10 - i had a lot of fun watching that movie.\n"},
{"review": "\nTHE LEGO MOVIE is a very entertaining, funny and, in the end, rather\npoignant film that will appeal to kids and adults. The story is about a\nnondescript, fit-in-with-the-crowd nobody named Emmett who accidentally\nhappens upon a mythical \"Piece of Resistance.\" Aided by the Master\nBuilders, he tries to stop the universe from being ruined by\nLord/President Business. Having only just watched this now, as it makes\nits way onto home video, I didn't watch it in theaters although I was\naware of the hype and positive reactions to it, both from critics and\naudiences. However, I must say that I wasn't too impressed with it. The\nstory is rather ho-hum and bland, not unlike the main character is for\nmost of the movie. What kept me invested was all of the in-jokes and\npop culture references. Nothing was laugh-out-loud funny, but it did\nmake me chuckle consistently. The best bits were probably from Batman,\nSuperman and Green Lantern (voiced by Will Arnett, Channing Tatum and\nJonah Hill, respectively). Another strong point was the large ensemble\nvoice cast, which included Chris Pratt (Emmett), Will Ferrell (Lord\nBusiness), Elizabeth Banks (Wild Side) and Morgan Freeman\n(Vitruvius/The Wizard?). Despite the rather bland story, things were\npractically saved near the end when it takes a rather poignant turn\nwhich I won't spoil (for the few people who haven't seen it yet). The\nend makes everything that came before it worth watching. Still, I can't\nquite bring myself to forgive everything else completely. Among those\nthings is a ridiculously catchy earworm that gets repeated ad nauseam.\nIn the end, it is something that both kids and adults can get enjoyment\nout of, even if it's more fluff than substance\n"},
{"review": "\nThis is a curious movie. I had not heard much about it, but knew it was\nhighly regarded. My wife and I started watching it last night, but shut\nit off after about 45 minutes. It didn't seem interesting at all.<br><br>But today I gave it another chance, finished it, and now understand.\nWhile it never will be one of my favorite animated movies, it was fun\nto watch especially during the last 10 to 15 minutes.<br><br>I tried to find out about how they made it by re-watching it with the\nDVD's cast commentary, but let me tell you that is one of the most\nannoying commentaries I've ever witnessed. Fortunately someone asked if\nmost of the movie is computer animated or actual shots of Lego pieces,\nsort of in a claymation style of animation. As it turns out almost all\nof it uses computer-generated images, but they did it in a way that it\nlooks like real Lego pieces were used. <br><br>I would guess that a person who grew up with Legos (not me) would get a\nbigger kick out of it. There's some funny stuff, like being afraid of\nthe 'Kragle', which we see is 'Krazy Glue' with the letters 'z-y-u'\nscratched out from use. But it mainly seems to want to give the message\nthat each of us has the ability to accomplish great things, and\n'everything is awesome, everything is cool when you're part of a\ngroup.'<br><br>SPOILERS: For most of the movie we see Lego figures and Lego machines\nin various settings, buildings, streets, etc. Their small world is\nanimated, it is as if they are alive, and I suppose in a sense they\nare. But then we see it is a giant Lego set built in a basement, and\nthe dad (Will Ferrell) comes down the stairs to see his young son has\nmade some alterations to what Dad had built. At first dad was angry,\nbut then he realized that his son had to exercise his creativity too.\n"},
{"review": "\nWhen I was a kid I used to love building with legos. I suppose back\nthen I might have liked this movie a bit better, but today I really\nthink it's lousy. A movie about legos is a great idea, but much of the\nfilm is rather awkward and confusing. It's hard to keep track of what's\nwhat. For a little while I was actually having a hard time staying\nawake. What makes it especially weird is how it eventually starts\ntransitioning from the fantasy animated world to the real world. I can\nsee why some people may like this, but I find it to be basically just a\nweird interruption. If the movie had started out in the real world\nbefore going into the main story, it would've made a little more sense.\n"},
{"review": "\nThe Lego Movie is an animated film that's like Legoland theme park\nvomited and then tried to cram as many pop culture references as\npossible.<br><br>The Lego Movie was one of those films that I had no desire to watch\nbecause it looked beyond stupid \u0096 and I'm adult enough to admit I was\nhugely mistaken.<br><br>Emmet is a completely ordinary construction worker in Lego city who\ngets mixed up in an epic journey to save the free Lego-world. Somehow\nhe gets mistaken for the prophesied Special and is recruited as the one\ntrue savior from an evil mastermind's plot for Lego universe\ndomination.<br><br>The Lego Movie is proof that commitment to and passion for your\ncraft\u0085.just kidding! Phil Lord and Christopher Miller have mastered the\nquirky referential comedy down to a science with the same unexpected\nvigor experienced from 21 &amp; 22 Jump Street. The Lego Movie is fresh,\nsmart and new rather than following the standard expected by family\noriented films set to capitalize on a franchise and rake in the dough.\nIt satiates entertaining children and adults equally the with seamless\nduality that can only come from true dedication to storytelling.<br><br>At first glance, The Lego Movie is a fun family-friendly adventure\nfilm. It is also a cheeky satire to those intellectuals able to catch\nthe never-ending barrage and chronic lampooning in the form of cultural\nreferences. Every single sentence within the dialogue of this film is\nan exploited opportunity to parody anything and everything.<br><br>With such an underwhelming year for animated films, The Lego Movie is\nthe stand-out winner. It may be a bit too manic for some viewers, but\nthat's okay because everything is awesome! Please check out our website\nfor all the recent releases, reviewed in full.\n"},
{"review": "\nFrom watching the trailer from this movie, I thought it was going to be\na action-only lego war-ish movie that had no story. I was incredibly\nwrong. This was such a funny and creative movie. <br><br>*SPOILERS*<br><br>The movie is about a normal LEGO construction worker named Emmet who\nlives in the city of Bricksburg. The citizens there follow instructions\non how to live life made by \"President\" Business. When Emmet meets a\nmaster builder named Wyldstyle who claims he is the \"special\", the one\nwho is the most interesting, extraordinary, amazing person in the\nuniverse, and tells him about \"Tako Tuesday\", a day where \"Lord\nBusiness\" (President Businesses other title) has plans to unleash a\nsuper weapon called the Kraggle (which is actually glue) on all worlds\nin the universe. So it is up to Emmet to put the \"peace of resistance\"\n(which is the Kraggle's cap) on the Kraggle to save the universe.<br><br>*SPOILERS OVER*<br><br>This movie was very creative and funny, enjoyable for all ages. I loved\nthis movie!\n"},
{"review": "\nSummary says it all. This is, without a doubt, the best movie I've ever\nseen. The characters are cool, the plot is outstanding, the animation\nis magnificent, all summed up = The movie is awesome. <br><br>The plot of this movie is that in the Lego Universe, an ordinary Lego\nconstruction worker and his friends are in a quest to stop the main\nvillain of the movie, Lord Business from gluing the Lego universe into\neternal stasis.<br><br>This movie has tons of fun, and it means its song, everything is\nawesome!<br><br>My favorite scenes in the movie? I loved the whole movie. No apart-\nfalls, no clichés, no baddie moments, none of those, not a single\nnegative thing like those. Like the song's name, everything is awesome.<br><br>My favorite character in the movie is Princess Unikitty. Man, I love\nher to distraction! She's so cute!<br><br>Are there any least favorite things of mine about this movie? NONE. I\nloved EVERYTHING about this movie. I definitely recommend this movie to\nANYONE, because of how awesome it is.<br><br>10/10 because I love this movie to distraction.\n"},
{"review": "\nThe Lego Movie is an odd blend of energy and color wrapped around a\npaper thin narrative. Most of the film is an unhinged series of very\nbusy visuals with lots and lots of noise - stimulation overkill. I\ncould imagine the psychotic effects this would have on a child watching\nbefore bedtime, possibly something along the lines of the child\ningesting Strychnine and a bottle of No-Doze. The Lego Movie can be an\nexhausting film to watch, but more often than not, the film is charming\nenough without pandering to children. It does transcend its corporate\nshackles, in what could have easily been a feature length toy\ncommercial in lesser hands, but Phil Lord and Christopher Miller give\nenough soul to this material. The film is a lot easier to enjoy on a\nvisceral level, as these silly lego characters don't really engage and\nthe voice work is well cast and deliver their readings with enough wit.\nWhile not exactly deep subversive satire, The Lego Movie does have just\nenough substance beneath all the noise.\n"},
{"review": "\nThe film is very beautiful film in terms of humor, which carried the\nstory and that her body representatives brilliantly Add visual effects,\nbeautiful addition to the end of the film the most wonderful the\nbeginning and before that never simple cash that we are loved thank all\nthe workers on the production of the film for their fun of us, in fact\nwe enjoyed and we see this wonderful family film ... But after Be that\nthe output level of the desired Valvkahh and shooting angles were very\nJamali in addition to the movements and the way the characters talk and\nfashion either Amatherat sound and image was not too bad as the\ndirector excelled in making.\n"},
{"review": "\nThe Lego Movie is in the same vein as a Pixar production, this animated\nmovie will therefore appeal to the younger audience as well as the\nolder viewers thanks to the richness of the references and the\ncharacters density, its offbeat humour and cynicism. The cinematography\nand animations are beautiful but since it was made via CGCIs it's a bit\nhard to understand why they would want to make it look like it's\nstop-motion. As for the scenario, the story is well thought-out but\ngoes maybe a bit all over the place \u0097 especially at the end \u0097, you\nbarely could have handled even 15 minutes more. All in all, great\nsuccess for this first opus about the Lego world.\n"},
{"review": "\nI must admit, I wasn't expecting much walking into this movie. I mean,\nit's a movie about Lego characters, with an actual Lego Batman and\neverything. How good could it honestly be? But, to my surprise, this\nmovie made me remember just how much fun I used to have with Lego. The\nsheer imagination and endless possibilities involved were what made\nthem so great and this movie showcases those aspects beautifully.<br><br>It's also a good story in general and includes some really good twists.\nAdmittedly the final reveal and ending can seem a bit bizarre, but I\ncould stomach it without any major problems and many of my friends\nabsolutely loved how out there it was.<br><br>Furthermore, the voice acting is topnotch, the trademark characters are\nutilized well and with lots of humour and the original characters fit\nwell with them without being overshadowed. But the greatest part of all\nthis are the visuals. Everything has been built out of Lego blocks.\nEverything. And everything even has the Lego logo on it, every block.\nIt's mindblowing how much detail they've managed to squeeze in and how\npainstakingly accurate they try to remain. Enormous extra points just\nfor that.<br><br>The Lego Movie is excellent movie for children and adults alike.\nChildren will enjoy the characters and the visuals, while the adults\ncan indulge in nostalgia and the surprisingly profound message.\n"},
{"review": "\nFor me, watching The Lego Movie was more about remembering my childhood\nmore than the actual story.<br><br>Visually it was extremely impressive how everything in the movie world\nrepresented a Lego set with all the foreign objects that also got lost\nin the Lego rubble. It made me want to search out my old Lego and just\nbuild everything again.<br><br>Jokes wise it has caters for everyone, with jokes about pop culture to\nobvious slap stick for the kids seeing though it is primarily a movie\nfor kids.<br><br>In a strange way the most impressive aspect of the film was how it\nstayed true to the Lego franchise. The story while borrowing plots from\nothers still seemed original and the voice overs were clearly top notch\nwith the star studded cast.<br><br>Parents should definitely not fear buying this for their kids and they\nmight even catch you watching it by yourself.\n"},
{"review": "\nThe voice talent (read acting talent) that is here, is amazing. The\nmovie itself is very creative to say the least, something you might\nhave done when you were a kid too. Going places letting your mind fly,\nnot setting up barriers. At least that's how it feels to me. And the\nmovie makes a point of it.<br><br>While the movie is going on there is one big twist that will either\nshock you entirely (like myself) or you have read about it and it won't\nbe as shocking as it could be. It doesn't make the movie less good. Try\nto watch it as open minded as you can and enjoy the jokes (some taken\nfrom movies) and feel your inner kid enjoying himself again ... no\nmatter your age\n"},
{"review": "\nI'm not sure whether it is good or bad, but there were no kids at all\nin the theater when I watched the Lego movie - It was the last\nscreening of the day and there weren't too many adults around either. I\nsaw the 2d version of the film, but suspect the visuals may have been\neven more impressive in 3d. <br><br>The Lego movie tells the story of Emmet who is a very ordinary lego\nfigure mistaken for the chosen one who will save lego. He has to escape\nthe attentions of the evil Lord Business who wants to end the universe\nand the good cop/bad cop who is tasked with finding him by Lord\nBusiness. He is helped along the way by Wyldstyle who recognises that\nhe is the chosen one. <br><br>The movie is fast paced with loads of action and cameos by numerous\nfaces from popular culture. I will not spoil the surprise by listing\nthese, but the film is great fun from start to finish. I suspect the\nhumour will appeal more to adults than children, but don;t have\nanything to back up this gut feel. Good fun!!\n"},
{"review": "\nThe LEGO® Movie got to be the most \"awesome\" movie in the most\n\"awkward\" way. Is it an awesome movie? Erm, I got to admit, I was kind\nof dozing on and off for the first 80 minutes, which rarely happened to\nme (like once out of hundred films and this is that one time?) So\ninstead of raving about why you should watch this film like every\nsingle Lego fan out there, perhaps it will be more suitable for me to\ntell you WHO will actually enjoy or even understand the film.<br><br>The Must-Go-Watchers: Lego Fans (obviously), star wars or DC Comic\nfans. If you don't watch Star Wars, you might end up with several\nmoments where you are wondering why are people laughing (yes, that\nhappened to me -.-. Many classic lines, including lines from Liam\nNeeson's Taken, were used which made the film interesting. Fans who had\ngrown up playing Lego will find the film nostalgic, as they go into\ndetails like change hair, the body (outfit) and even what they can hold\nwith their claim like hands. What's more? They have a great catchy\nsong, which goes on in your mind like the minion song.<br><br>Read more: http://tiffanyyong.com/2014/02/05/the-lego-movie-review/\n"},
{"review": "\nMy son has been raving about this film for months including singing\nTHAT song.<br><br>When I initially got around to watch it I dozed off, granted I was\ntired. I decided to re-watch it later when I was more refreshed. Looked\nat a different perspective the film was better and less annoying.<br><br>I could never fathom how they made an animated film about Lego. The\nwhole idea sounds bizarre on paper. Its actually lo-fi CGI with added\ninventiveness. So a clone worker is suddenly mixing it up with Batman,\nGandalf and Han Solo (all legoised) as well as fighting the evil Lord\nBusiness.<br><br>The film then switches track with its underlying message that kids just\nwant to have fun with toys and play with them rather than dad having a\nprized collection, all neat and tidy. Something I might be guilty of\nmyself according to my offspring!\n"},
{"review": "\nWhen I convinced myself that I was going to watch The LEGO Movie, I\nthought I knew what I was in for. I was ready, and prepared myself\nmentally for a very childish and gimmicky film. I am very lenient and\nusually enjoy most films, so I was ready to give this one a chance\ndespite not knowing anything about it other than that it was the LEGO\nmovie. This movie goes right along with the saying, \"Don't judge a book\nby it's cover.\" It completely surprised me on all levels.<br><br>First of all, the subtle hints at government and society as a whole is\njust amazing. I was really happy to be seeing some positive subliminal\nmessaging (not really subliminal, pretty blatant). The writers use the\nmaterial in such a way that it is key to the comedy and progression of\nthe story. Very clever, I enjoyed it thoroughly and was amused by how\nthey called out everything.<br><br>The characters are all interesting and I do not find one being annoying\nand/or more interesting than the others. A lot of them are pop icons,\nso the movie is still gimmicky to an extent, but it helps that they are\nall voiced excellently and have hilarious one-liners or vital scenes in\nthe movie. The story is fresh even though it is just a twist on a\nregurgitated tale. I never stop being entertained with the storyline\nbecause it all just flows so well. There are intense action scenes, and\nquite skilled and beautiful animations to be found here as well. <br><br>I never imagined I would be praising a movie like The LEGO Movie so\nstrongly, but it is a truly great piece of work. Regardless of it's\nsurface, see through the commercial exterior and give this film a\nchance. Complete clean fun for everyone, deserved an Oscar.\n"},
{"review": "\nI'm an old fart as far as this Lego thing is concerned. I remember them\nfrom when I was a kid, of course, but that was before they started\ndoing all the stuff with them that they do now. In my day you could\njust build buildings with them. Not really special buildings either,\njust ordinary stuff. We also used to tie onions on our belts because\nthat was the style at the time, but I'll leave that story for Grampa\nSimpson to tell. Anyway, the voicework is great. I especially liked\nMorgan Freeman as Vitruvius. The story is surprisingly pretty good. I\nwas expecting something kind of dumb but it's actually a fun movie and\nsmarter than I thought it would be. It's something both kids and adults\ncan enjoy. Oh, and I thought the double decker couch was a good idea.\nSue me.\n"},
{"review": "\n'The Lego Movie' is intensely likable, visually inventive and\nconsistently funny. Like Phil Lord and Christopher Miller's other\nanimated film 'Cloudy With a Chance of Meatballs', this one is\nabsolutely bananas and has the air of being an improvised ideas party\ndownloaded directly from their brains. It's a CG animated film with the\nlook of a stop motion feature. I laughed and I admired it and I'm glad\nit exists.<br><br>It's also far too hyperactive. I liked the film's energy but I was\nexhausted by the time it was two thirds over; I could have done with a\nlittle breathing space here and there. That's a minor grumble, however,\ncompared to the film's big misstep, namely the live action scenes with\nWill Ferrell as a killjoy father obsessed with keeping his Lego sets\naway from his son. These parts are overly sentimental and at odds with\nthe anarchic sensibility of the rest of the movie, and they drain away\nany investment I had in the Lego world by announcing that it's all just\na game anyway. <br><br>It's a shame because the movie is so close to being brilliant. I could\nwatch it again quite happily when its problems have faded from my mind,\nbut it's never going to be as great as I'd like it to be.\n"},
{"review": "\nWow, just wow! Having grown up with Lego through the 70's &amp; 80's and\nliking nerdy things (Star Wars, Super Heroes and fantasy/Dundeons &amp;\nDragons), this movie was just pure awesomeness . Along with the\nnerd-fest, the CGI (computer graphics) actually looks more like old\nschool stop-start motion animation. To be honest, I have grown to hate\nCGI. It is over used and has a certain cheap look to it. The animation\nbased company that did the animations in this film have achieved\nperfection here by making the movie look like stop-start motion\nanimation and creating a sense that the Lego is real. A big thumbs up\nto the Australian CGI company that was hired for this job. Oh yeah, the\nStar Wars scene was awesome.\n"},
{"review": "\nThe Lego Movie finally arrived in Australian cinemas last week, so I\ntook the chance to see it since having so much high-anticipation since\nreading IMDb user reviews and the hype it had! I can admit that this\nwas indeed a fun movie to see!<br><br>The storyline here is obviously children aimed, but I was surprised\nthat so many adults my age and older were interested in this, it felt\nlike too it was aimed at both children and adults. It had humor,\nimagination, moral and even heart in its tale, delivering a strong feel\ngood feeling of who who we are and what we are capable of. <br><br>Animation is a major feature in The Lego Movie and I can admit that it\nwas astoundingly achieved by Australian visual effects company Animal\nLogic (the creative team behind Happy Feet 1 and 2). So much detail and\nthought was given into the Lego universes featured in the film, it\ngives a strong sense of what the imagination from the mind can do! The\n3D itself gave an amazing sight to behold this amazing Lego world, sure\nhope in future that Animal Logic wins awards for their hard-earned work\n(and maybe even Best Animated Film in the 2015 Academy Awards).<br><br>Overall, an exciting move that takes fun to a whole new level in terms\nof story, film-making and even genre. Can't wait for the Blu Ray\nrelease later this year and the already confirmed sequel in the future.\n"},
{"review": "\nThe Lego Movie was a spectacular movie for my wife and kids, they\nenjoyed it thoroughly. The voice talent was also comedic and not over\nthe top type of comedy. Emit and Wildstyle were the most lovable\ncharacters by far. We only wished the film was a bit longer because my\nthree kids couldn't get enough of it but I suppose that was for the\nbetter as it leaves room for more in the future. The Lego Movie is a\nbit reminiscent of a childhood cartoon I used to watch called \"GoBots\"\nwhere my favorite character or hero was sort of the weak link of the\nbunch. In all, Lego Movie was fun for ages 5 to 80 and the marketing\nhas been off the wall! I give this movie a 9 out of 10 simply because\nthe \"Awesome\" song was sung in the car all the way home.\n"},
{"review": "\nLego Movie is almost in a genre of its own, appealing to kids but I\nsuspect adults will like it more. It's entertaining, with many\ngenuinely hilarious moments, so with respect to shelling out 20+\ndollars for a 3D ticket - YES it's worth it. As a film it feels a\nlittle more uneven, but the proceedings are so creative that they kinda\ndefy criticism<br><br>I was really taken by the opening sections, the introduction into the\nworld with the ecstatically happy music and utopian Lego urban\nlandscape I thought was brilliant. But overall I felt there the mocking\ntone overtook the sincere areas and it ultimately makes the surprise\nending hard to take seriously, or to feel moved by. <br><br>It's crazy fun though - especially in 3D.\n"},
{"review": "\nThe Lego Movie was not exactly what I expected it to be. It was much,\nmuch better!<br><br>I thought going in to see this with my date that I was being dragged\ninto something that would just be a glorified and over hyped commercial\nfor Lego products and toys. What I got instead was a fantastic movie\nthat was really enjoyable for both children and also adults, with some\nreally great jokes.<br><br>The voice acting was top notch and the story was pretty good,\nespecially for a kids movie. Although it wasn't perfect the Lego movie\nis definitely worth seeing!\n"},
{"review": "\nThis film is probably one of the best films I've ever seen. I'm amazed\nwith how everything is made of Lego. Not just do children love it but\nso do adults. If you ever get the chance to choose a film to go out to\nwatch choose the Lego movie. The reason I've given it ten stars is\nbecause it's funny, inspiring and awesome! when I went to see it almost\nevery one was laughing. There are no dull bits or boring bits in it at\nall. i think it's epic how they put in Lego city, Lego star wars and\nloads more! This film I'd recommend it to absolutely anyone. I was\nlaughing the whole way through the movie! it's the most creative film\nI've ever seen. Whatever you do GET BUYING TICKETS!!! By Archie, aged 8\n"},
{"review": "\nLego Movie in my opinion could go down as one the biggest surprises\never in cinema history. I know the Lego franchise has gone waayy beyond\nexpectations with the toys, models and gaming industry (Lego Harry\nPotter, Lego Star Wars etc etc), but a Lego film I never thought would\nwork, and if one was released, it would be so childish I would never\nlay eyes on it...... How wrong could I be, as this film could easily\nhave just made it in AT LEAST my top 50 of all time.<br><br>First of all, this film will probably only appeal to so many friends,\nunless you're all super perfectly in sync with another. I saw this\ntonight with 3 other people, and only 1, as well as myself were\nlaughing throughout, the other 2, didn't get any of the humour at all.\nThe humour is witty, very immature in places, but perfectly timed. THIS\nIS ONE OF THOSE QUOTE THE FILM FOREVER FILMS!<br><br>However as funny as this film is, and as much as I have already quoted\nBatman in the past 2 hours since seeing the film, it's not the humour\nthat has pushed this film waaaaay beyond expectations. Without giving\ntoo much away, this film has a really deep back story, and a massive\nsurprise towards the end with the story entering a world that I never\nthought would exist in the film, and it really did help explain why the\nfilm was as random as it was, and just brought everything together.\nKudos Lego Movie, Kudos.<br><br>Can not wait to add this to my blu ray collection (the film is\nstunning).\n"},
{"review": "\nMy son &amp; I had a blast watching the Lego Movie. Very funny for adults\nand children. I loled at some parts , great sound track . Very good\nstory made me remember what fun it was to play as a kid and how much I\nmiss that. Had a lot of action too. I would totally see this again. I\ngot that Awesome song stuck in my head. This movie made me way happier\nthan I should be. Even hours later while writing this I am still\nfeeling happy. That is weird right? I mean I am normally not unhappy\nbut I am just not happy either I mean I am just normal feeling but I\nchecked..... Yep Still feeling happy ..... weird but not \"WEIRD\" weird\n, just good weird I guess?. You ever notice that weird is kinda weird\nwhen you spell it it just looks weird ... like kinda wrong but ya know\nyou spelled it right. That is weird ... I think I am tired but I still\nfeel happy. I just wish I could get the Awesome song out of my brain .\nUUUUGGGGHHH !! stupid ear worms any ways go see the movie and be happy\n"},
{"review": "\nI will say that when I saw the preview for this movie I wasn't too\nexcited about it. I was never a fan of Lego's even as a kid and never\nreally played with them. Only through the great reviews and word of\nmouth did I decide why not give this a shot and I'm glad I did.<br><br>I didn't see it in 3D and it might have made it more entertaining with\nthe way the special effects were used. It was a clever piece of work\nwith the way they portrayed water, fire, smoke, and a whole bunch of\ndifferent things.<br><br>Even though most kids will want to see this, its the adults that will\nprobably be heard most in the theater laughing. The jokes are more for\nthe adults but because its Lego's the kids will have a fun time too.\nThere is a bit of a twist at the end that I didn't see coming.<br><br>Overall, its simply just a fun time at the movies that both the kids\nand adults will equally enjoy.\n"},
{"review": "\nGreat story, I don't why the other reviewers don't see it (must not be\nthe special). The story is about how government and business control\n(micromanage) every aspect of your lives and (micromanagers) are\ngovernment agencies. That means that unless you are (a master builder),\nyou are not free. Even the Will Farell in reality is a reference to how\nthe story itself is reality, love it!!! However, unlike the ending to\nthis movie, I don't see business and government ever realizing that by\nletting the people do what they choose out of free will, it will\nbenefit them and it could. Anyway, excellent movie and if you don't see\nthe above in it, watch it again.\n"},
{"review": "\nMy new favorite movie, defiantly the best one I've seen in 2014 so far!\nAs the title suggests, this film has it all:<br><br>- A great story - hilariously memorable funny moments - A wide range of\njust about every theme (though some of my personal ones are missing,\nbut there is always the sequel) - Very much feels and looks like a Lego\nmovie would! - Good music - Great writing at making something feel very\nfresh and unique, when this concept (i.e. Roger Rabbit &amp; Wreck It\nRalph) has been done countless times b4 - An unexpected twist that in\nhindsight makes sense with the theme of the movie - An excellent moral\nabout being your own special stuff and just being natural, that has\nbeen previously portrayed, but in this execution it stays with you as\nyou remain entertained simultaneously - And of course, as per the title\nof this review, the new song that will be trapped in your head:<br><br>EVERYTHING IS Awesome! <br><br>9/10!\n"},
{"review": "\nWith LEGO toys, it was about imagination. Make them move, make them\nfight, have your own stories, have your own ending...where we had to\nmove them ourselves...speak for them ourselves. For me, that was 25\nyears ago. Now when I see it, I'm reminisced a little bit of those\ndays...but the whole story is not grabbing enough. <br><br>Everything is predictable...but then again, the stories I imagined 25\nyears ago were also predictable now. If you are a true LEGO fan and\nstill buy them for yourself or the kids...you'd totally enjoy it...the\nanimation and characters are true LEGO style. And with the trademarks\nthey can use they've done a fun but 'not-so-great' job.<br><br>At my age, I'd think they could do a lot more with the licensing they\nhave...but if I saw this 20 years ago...I'd definitely be mind\nboggled!! <br><br>I am remembering my childhood days when watching the Flame animation\nand faces...but its not enough to rate it at par with the all the other\nwonderful animated movies I have seen this year. For a fact... if you\nhave never ever played with LEGO toys, there are tonnes of better stuff\nout there...which I personally would say you should watch...with a\nlittle bit of Google assistance.\n"},
{"review": "\nAn ordinary Lego construction worker (Chris Pratt), thought to be the\nprophesied 'Special', is recruited to join a quest to stop an evil\ntyrant (Will Farrell) from gluing the Lego universe into eternal\nstasis.<br><br>As much as I dislike posting reviews with spoilers, this will have to\nbe one in order to justify my lower rating. For the most part, until\n66% or maybe even 75% of the movie, I really thought this was one of\nthe best animated features I had ever seen. It looks great, the story\nis good (even if the message is a bit lame and blunt), and there are\nsome genuinely funny moments with old characters in new situations\n(Lando and Batman, for example).<br><br>But here is where they lost me: the introduction of human, live action\ncharacters. When the already obvious message of being against\nconformity and growing up suddenly gets even more obvious by showing\nthe interaction of father and son, it loses me. Why do we have to go\nthere? And why do we have to have the Lego universe exist in a kid's\nimagination and not some real place?\n"},
{"review": "\nHere we go again, Another copy up movie 1st of all, The movie is\nactually alike to Chicken little Here's the reason why, The plot's Is\nalike from Disney.<br><br>The total mayhem is alike, Same thing! They did War of worlds, With\nrobots?! Same Same thing! The movie was Not bad, But its not worse.<br><br>The city is also alike! :NOTE Well I guess it was terrible after all,\nAfter 60 minutes, They started to do a War of the worlds, AGAIN! The\nplots again! The animation again, the City again, But everything else\nbesides the Characters, Including the movie,\nTERRIBLE!!!!!!!!!!!!!!!!!!!!!!!!!!!\n"},
{"review": "\nWish it could have had more substance, but from the opening moments of\nthe film, The Lego Movie fires an endless array of jokes at its\naudience from seemingly every angle. Writers Phil Lord and Christopher\nMiller (who also directed the film) have an expert grasp of the absurd,\nand they use it to great effect, ensuring that every scene is stuffed\nto the gills with laughs. Many of the film's best moments are derived\nfrom the fact that the characters, vehicles, and environments are\ncreated from Lego pieces: one of the rules established by the\nfilmmakers was that everything appearing on screen must be possible to\nconstruct in the real world. It's a good mix of humor, heart, and\ncreativity, and provides a great foundation to build on.\n"},
{"review": "\nA very refreshing and enjoyable film with lots of clever use of\nanimation and humour for both young and old. But I am of the generation\nthat never built Lego - only bought it for the next two generations. It\nis cleverly done as a movie, and the twist twenty minutes from the end\nputs the rest of Hollywood's wunderkind to shame! The characters are\nvery predictable, but put themselves down with a distinct lack of ego\n(but then plastic models can, can't they?). The plot is yet another\nriff on George Lucas with a 'Metropolis' like society needing a Chosen\nOne to release them to freedom - only the one chosen is not really of\nheroic stature. But the journey takes him to his destiny - freeing\neveryone to build their own models and not just what the packet tells\nthem to! It runs out of steam after an hour before the big finish kicks\nin - plastic model cartoons can only go so far! And the animation can\nonly go so far before iteration (like live action Hollywood!), but the\nbiggest product placement in movies works well enough for long enough\nlong enough to give a great deal of pleasure.\n"},
{"review": "\nI can't believe how impressive this movie was. When I first saw it, it\njust blew my mind away. Every about it was lovable. The story, the\nanimation, the cast, the characters, the humor, it was a thrill ride.\nIt's definitely a good film to kick of 2014, and is one that you\ndefinitely don't want to miss. You could tell that they went all out on\nthis. It's one thing to make stop motion in general, but doing with\nLego and making it that good is just impressive. And let's not forget\nthe strong cast which includes Chris Pratt, Morgan Freeman, Liam\nNeeson, Will Ferrel, Elizabeth Banks, Will Arnett, and numerous cameos\nincluding Channing Tatum, Jonah Hill, and Shaq among many others. But\nprobably the best thing about the movie was it's sense of humor. Though\nthe first 10 minutes was quite boring and seemed like a typical\nanimated film, the film spiraled high after wards and will keep you\nlaughing all the way through. All of the cast members like Liam Neeson\nand Morgan Freeman who you would never expect to do something comedic\ngave it there all here, and that only made it 10x funnier. But if\nthere's' some thing I didn't like about the movie, it would have to be\nthe ending. I won't spoil it for you, but there's this little twist in\nthe end that was quite un-expecting, but a bit unnecessary. With all\nhonesty though, the ending wasn't that bad, and some of you may even\nlike it. Overall, The Lego Movie\" is a great movie that' sun for all\nages.\n"},
{"review": "\nIf you have young children at home, take them to see this movie \u0096 it's\na must. This is THE kids' movie of the decade. Yes, this flick was\ndesigned for the child equipped with a bottomless pit of energy and in\ndire need of a nap. Hi energy scene after hi energy scene left me\nexhausted and physically drained. Talk about zapping the energy out\nyou. At the end of this carnival of spasmodic plastic rattling and the\nceaseless repetition of, 'Everything is Awesome', I thought my soul had\nbeen sucked out of my eyeballs and felt bodily fluids oozing from my\nears. Granted, the theme is a common premise, but it is easy to\noverlook. What theme you ask? Crying out loud - it's echoed throughout\nmost 'blockbusters' recently produced. You do know the theme, right?\nHere it is as a reminder, \"Big Brother is pushy and overbearing, and\nbrainwashing the masses. The only way to overcome the 'The Collective's\nControl' is through the brave, selfless act of an individual. (kind of\ncuts against the grain of Hollywood \u0096 I like that).\" The cool thing\nabout this movie is that good beats evil using happy-happy-joy-joy\nmethods (and LEGO Batman \u0096 of course) and not arrows shot from burning\ngirls or some powerful, magical female divergent idol. One sad note\nthough. Even though I did see the movie I forgot what it was all about.\nNow remember I do know the movie was a lot of fun, the story left very\nlittle impression. Let me see, how would I put this movie in a\nnutshell? Let's say you had to save the entire world. You also had a\nbox of cute kittens and you gave them each double-shots of espresso \u0096\nwhat would you remember? See this movie\u0085you will like it and then you\nwill appreciate your bed.\n"},
{"review": "\nOne of the first must watch movies of 2014.<br><br>Way better than I though it could be. A lot of funny scenes that will\nkeep all ages entertained. Although a couple of scenes felt longer,\nthat is simple due to how fast and funny the other scenes are.<br><br>The animation and voice work are both brilliant. Will Arnett is great\nas Batman, and Liam Neeson as BadCop/GoodCop was just epic. Also\nCharlie Day as Benny was brilliant and is the star of one of my\nfavourite scenes in the movie (you'll know it when you see it). The\nrest of the cast are fantastic as well.<br><br>Lots of awesome cameos, including some unexpected (but still as\nawesome) ones.<br><br>The plot is simple, but that doesn't mean the movie is any less\nentertaining.<br><br>One of my favourite movies of all time and is still enjoyable on\nmultiple viewings.\n"},
{"review": "\nIf you have not yet seen this movie, here are two heads ups: one, it's\nextremely fast paced so brace yourself, two, if you have seen a lot of\nmovies the plot may get predictable.<br><br>Traffic was slow on this day so I barely made it to the theatre in time\n(about halfway through the previews). So I was a bit stressed when I\nsat down. The fact that the opening of the movie was very fast paced\nand there were so much happening at once did not help my mood. However,\nthe humour kicked in quickly and each one made me at least chuckle. The\nstory eventually slowed down (a little) and I was finally able to fully\nenjoy this movie.<br><br>It's indeed worthy of its praise: the pop-culture references are of\ngood taste, the humour is excellent, the visuals (though hard to keep\ntrack of) are amazing. Even if the movie is fast paced, this is LEGO\nafter all. Having the characters build something slowly than what you\nsee in the commercials would not be LEGO. It's not my favourite movie\nbut I am glad I saw it, and will definitely see it again. Beware: the\ntheme song is very catchy.\n"},
{"review": "\nI watched this yesterday at 2:30pm its now 9:10am and i cannot help but\nthink of this film. I think of the animation the jokes then the little\nsubtle jokes that younger kids wouldn't get and then the beautiful\nanimation and the voice work by Chris Pratt and others i cannot find a\nsingle fault with this film i don't have one maybe the song was\nannoying but i ended up buying the album off iTunes (Everything is\nawesome) i hated it at first and i now love it i cannot think of a\nfault with this movie. Its kinda like a social commentary with\nfollowing instructions and all that and president business voiced\nbrilliantly by Will Ferrell. I found that kids might not respect this\nmovie as much as adults cause there are jokes they will not get I'm\nhonest i heard more GROWN MEN laugh than some of the children. OK the\nvoice acting is outstanding all round my personal favourite is Bad cop\nvoiced by Liam Neeson the voices are great all round. The last 15\nminutes are really heart felt and i couldn't believe that they did\nthat. I will be honest some of the jokes did fall flat and where funny\nbut just didn't lift off like some the others did but thats minor\ncompared to the other jokes and this is a laugh out loud movie and i\nlove this film to death i will go far as to say i enjoyed this a little\nmore than Monsters inc (my favourite animated film in my top 20 at 19)\nand i would say this has just taken my number 18 spot i love this film\ni recommend it for all ages and family's.\n"},
{"review": "\nI used to enjoy a lot of Lego time when I was a child. I used to enjoy\nmost of what was used from pop culture and references in this movie, so\nthis one was basically a gathering of all that was important to me\ngrowing up. <br><br>Pity that it was kinda generic as a movie... the plot is so convoluted\nit makes you scratch your head sometimes. Too much references and no\ntime to develop them properly. It was very promising in the trailer,\nkinda like a mix between Toy Story and Wreck it Ralph, but... those\nlast two, sorry WB, they said it way, way, waaaaaay better the same\nmessage you're trying to give us.<br><br>As a bunch of isolated references from the 80's, it kinda works in that\nnostalgic sort of sense, as an adult, I got entertained with all the\nreferences and I'm pretty sure that kids will have fun beyond belief,\ntoo. As a movie, it turns out to be a convoluted mess. I know that they\ntried to make like (SPOILERS AHEAD!) the imagination of a little kid,\nbut back then, Andy was so much more creative and more addressing! <br><br>Sorry WB, good try, but you're way better with your DC Animated\nUniverse, so stick with that. If you're trying to overcome Pixar,\nwell... better luck next time. Bottom line, it's worth the price of\nadmission once, but just once, like a fireworks show, one viewing it's\nreal fun, a second viewing though, is out of question.\n"}
]