[
{"review": "\nBlack Mass serves as a nice redemption for the floundering career of\nJohnny Depp, who has leaned more on quirky voices and loud makeup than\nhis actual skills in recent years. His portrayal of mob boss Whitey\nBulger is a powerhouse performance and easily his best since he first\nintroduced the world to Jack Sparrow. It's too bad the movie as a whole\ndoesn't fair quite as well. Despite a great cast and some interestingly\ninsane source material, somehow a movie about one of America's most\ninfamous criminals feels more like small claims court. Director Cooper\nfocuses his narrative on Bulger's less-than-legal partnership with the\nFBI. It's a fascinatingly close-knit community we witness (agents,\nfelons, politicians, and families alike) in which loyalty and\ncorruption go hand-in-hand. It's a grimy yet quiet 70's-feel gangster\nfilm that engages its audience nearly as much as it reminds them of\nbetter films. Therein lies its big problem: What is Black Mass offering\nthat hasn't already been perfected in other gangster films?\nUnfortunately, instead of a true movie-making vision, it's like a guy\nwatched every crime drama from the last 40 years and just spit out a\nless-interesting copycat. Not that a counterfeit of something great\ncan't still have its positives: the score is beautiful and the\nperformances from the top-notch cast around Depp are nearly as superb\nas his, all of whom nail the oft-parodied Bostonian accent with aplomb.\nBut with too many side plots to juggle, not enough cohesion to the\nstorytelling, and an unfortunate lack of auteur vision, Black Mass just\ncan't stand against the great American crime films of yore (Chinatown,\nGodfather, Goodfellas).\n"},
{"review": "\nIf you like slow, plodding movies full of unlikeable characters, by all\nmeans gear up for this sleep inducing film. Goodfellas is an action\nmovie compared to Black Mass.<br><br>There are a few good qualities here: top shelf production, excellent\nacting, a clear, concise story of characters making poor choices -\nleading to predictable consequences.<br><br>But who cares? There's no entertainment here! None of these characters\nare worth giving a damn about, and the few sporadic scenes that offer\nany true value sit like islands on a still horizonless sea.<br><br>But I learned something... Really? This might be the number one reason\nto sit through this boring expanse, and the info is not worth it. The\nscumbags are scumbags, the protagonist is a weak, shallow excuse for a\nlaw enforcer, and the other surrounding characters are bland at best\n(including Benedict, who for all his talent, brings nothing of note to\nan already white bread affair). Speaking of white bread - No culture\nwhat-so-ever, and often these fat, out of shape gangsters look absurd\nin their early 80's sunglasses and attire. There will be no awards\ngiven for costuming or make-up here. True Depp is transformed with\nprosthetics, but as a friend and I joked - his character is far\nexceeded by the likes of Tom Cruise in Tropic Thunder.<br><br>If you've seen the trailer, you've been robbed of one of the films\nthree or four memorable moments. Interestingly, all of these good\nscenes are just spice to the meat of the film. This is not a good\nthing! When the main arc is dull, the violence (while realistic) lacks\nstylistic punctuation, and the constant voice overs are delivered with\napathy... one wonders what the hell the director was thinking!<br><br>Waste of time, even for fans of actors involved.<br><br>my score? a disappointingly average 5 out of 10.\n"},
{"review": "\nI swear to God I really really wanted to like this movie. I am kind of\na fan of Bulger's for some sick reason and I felt like Johnny Depp was\nappropriately menacing and weird looking and did a good job with making\nthe Violence believable. What failed was the writing. There is never\nreally any attention paid to why Whitey was Whitey or how he got to be\nWhitey or why he wanted to be Whitey. His kid is dead his marriage\nruined and he is just accumulating money to accumulate money? Why? He\napparently has no vices to speak of except giving money to con men from\nthe IRA. The whole thing just makes no sense. The whole thing just\nseemed apathetic.It could have been a real classic but they fornicated\nwith the puppy yet again. It was just Depp looking weird and enjoying a\nWHitey Halloween costume while he strangled hookers and killed\ninformants. Thanks Hollywood. I suspect you can blame the producers.\n"},
{"review": "\nBlack Mass is a crime drama movie revolving around the true events\nbehind the Winter Hill Gang and the gang's leader Whitey Bulger played\nby Johnny Depp. The premise for the film was very interesting as it\nplayed on Whitey Bulger's connections as his brother, William Bulger,\nplayed by Benedict Cummberbatch is a Massachusetts State Senator while\none of his childhood friends John Connolly played by Joel Edgerton is\nan FBI agent. This an amazing premise however it was not fully executed\nas it focused mainly on Joel Edgerton's character and Cummberbatch's\ncharacter felt out of place at times. This may have been a more\nrealistic approach however I felt like they could have utilized\nCummberbatch's character more in the film as it would have added two\nassets for Whitey. The Film is divided in three parts overlooking\nWhitey's almost twenty year reign. However because of this approach it\nleaves viewers wondering what happened in that time frame and feels as\nif it was forced to make the movie feel more like the actually events,\nso spread out. The cinematography and direction of the film is very\ncrisp and sleek which makes the film a lot more enjoyable. The acting\nall together throughout the film is superb as it holds a stellar cast.\nI found Johnny Depp, Joel Edgerton,Kevin Bacon and Benedict\nCummberbatch to be all great. Depp's performance was electrifying and\nhe should get an Oscar nod but I would not be surprised if he does not\nget one.<br><br>Overall decent film<br><br>7/10\n"},
{"review": "\nEncompassed with episodic rhythm and an awfully conventional format,\nScott Cooper mutates a story of rich soil capable of greatness to a\ndetaching and routine crime film. Black Mass grasps only on the\nsuperficial layer as it focuses solely on documented events of the\ncrime they organized. Due to this, the movie suffers as it seems to be\nmerely a biography- laying out these horrific events in these specified\ntimeframes but not putting any focus on the characters that performed\nit. All action, but none of the story that happens between that allows\nthe audience to view who they are and what they're like. Black Mass\nfails to delve deeper into the roots, and this of course limits the\nscope of all the actors. Great mob cinematography such as The\nGodfather, Goodfellas, and the Sopranos- all of these were so great\nbecause they allowed the audience to see what the characters were like\nwhen they weren't shooting, beating, or plotting against people.<br><br>That being said, in their limited boxes boy do these actors put on a\nshow. Led by Johnny Depp and Joel Edgerton, the audience can tell\nstraight from the start that this cast reveled and lived their roles.\nWith the amount of overwhelming, heinous events; the film had to have\nsomeone cold-hearted and sleazy, and woah did these actors become the\nepitome of that. However, due to this heavily limited character, the\nonly \"rise\" the audience feels are from the bone-chilling actions that\nthese men did. Black Mass fails to captivate. And when the closing\ncredits roll a feeling of disappointment washes over you, as it feels\nlike you just watched an episode on the ID channel with really, really\ngood actors.\n"},
{"review": "\nI don't usually write reviews but I felt compelled to inform others\nabout how awful this film was. And I want to prefice this by saying I\nlove crime films and have seen the greats such as Goodfellas, the\nGodfather, and The Departed but this was just drivel. <br><br>Let's start with the acting: Johnny Depp plays Boston crime lord James\n\"Whitey\" Bulger and reveals virtually nothing about the character he\nplays aside from the violent actions he portrays. The supporting cast\ndoes nothing to make this a compelling story either with the exception\nof Joel Edgerton's John Connolly as a street-wise kid turned FBI agent\nloyal to Bulger's cause. <br><br>The pacing and dialogue are also the biggest culprits here. The film\ndevelops slowly leaving the watcher wondering if it will ever pick up\nto an emotional crescendo with only to find out the ride is as\nmonotonous as your daily drive. Moreover, the dialogue feels like\nstudents taking turns reading out of a textbook. I know that the film\nis a biographic one but there's no need to have it feel as though\nyou're reading a Wikipedia article. <br><br>Likewise, the musical score tries to underpin the uneasy feel of the\nmovie but only works to put the viewer to sleep with its two tone rise\nand fall. None of the cinematography and shots of the scenes work to\ncreate anything worth capturing attention. There are shots of Southie\nthat do convey the bleak outlook of Bulger's turf but they are few and\nfar between as the film mostly focuses on the boring and uninspired\ndialogue and setting the actors are captured in such as living rooms,\noffices, dark bars, and car interiors. <br><br>If I was to summarize watching this film with an analogy I would\ndescribe it as eating and tasting a cardboard box.\n"},
{"review": "\nI saw this movie with a bunch of my college friends (we are all in\ncollege). They all loved it. And I will say that Johnny Depp and Joel\nEdgerton were fantastic in this movie, however, the movie lacked the\nqualities of a great mob movie. I have always been fascinated by the\nmob genre. I have watched the sopranos, goodfellas, donnie brasco, the\ngodfather, and basically all mob movies under the sun. I feel like\nJohnny Depp and Edgerton are great at portraying their characters, but\nI feel like no other character was developed at all. Benedict\nCumberbatch is one of the great actors of today, but Cooper just wasted\nhis talents on a weak supporting role.<br><br>I was also looking forward to see the inner workings of how Whitey\nBulger came to power. I understand that he was a silent, cold-blooded\nmobster that used the FBI to become to be one of the most influential\ncriminals in Boston. However, other then a few choking scenes and\nmurder scenes, I would have liked Cooper to show more of the specifics\nof Bulger's rise to power. Also, we rarely see Bulger interacting in\nthe everyday mob-life, but we always see how he handles unique,\nproblematic situations all-the time. I would have liked to have seen\none normal day in Whitey Bulger's life given the movie was only was 2\nhours long. <br><br>Overall, a decent movie with great acting by Depp and Edgerton, but\nlacking on some of the finer details of a classic mob movie. <br><br>P.S. I could not take Ben Wyatt serious in that mustache.\n"},
{"review": "\nThe icy blue eyes of notorious Boston crime boss James \"Whitey\" Bulger\nstare out from the screen in Scott Cooper's \"Black Mass\" like the gaze\nof some confident jungle predator calmly lying in wait, holding his\nground until the moment he moves in for the kill. And that same coolly\ncalculated composure extends to every aspect of how the actor playing\nBulger embodies the role, or rather disappears into it. But if Johnny\nDepp's mesmerizing performance \u0097 a bracing return to form for the star\nafter a series of critical and commercial misfires \u0097 is the chief\nselling point of \"Black Mass,\" there is much else to recommend this\nsober, sprawling, deeply engrossing evocation of Bulger's South Boston\nfiefdom and his complex relationship with the FBI agent John Connolly,\nplayed with equally impressive skill by Joel Edgerton. Something of an\nanti-\"The Departed\" (which was partly inspired by the Bulger case), the\nmovie has an intentionally muted, '70s-style look and feel that may\nlimit its appeal to the date-night multiplex crowd, but quality-\nstarved adult moviegoers should flock to one of the fall's first\nserious, awards-caliber attractions. Not only that but Benedict\nCumberbatch (who plays as a Senator and as Whitey's brother) has given\na stellar performance. He is truly a talented person who gives his all\nin every film/show he acts.<br><br>BOTTOM LINE: Johnny Depp deserves an Oscar, if not then at least a\nnomination. Truly worth watching\n"},
{"review": "\nThe only time I ever recall of being terrified of Johnny Depp as a\ncharacter was in Sweeney Todd and I never thought he could top that\nperformance. <br><br>But I stand corrected, his performance as Whitey Bulger is not only\nterrifying as hell but one of the best performances Depp has ever\npulled off! This is the type of the film that makes you want more and\nmore after each scene is done all the way towards the end, and the\nsupporting characters really help Black Mass reach its full potential\nof hitting the right spots for a moviegoer. Scott Cooper did an amazing\njob in this biopic he also she be up for best director, Joel Edgerton\nsteals the spotlight in some scenes and bloody nails it in all the\nscreen time he gets. This film also has a nice funny side to it as well\nwhich really makes you laugh then BAM all seriousness. By far probably\nthe best film I have seen this year!<br><br>Deserves more than 10/10\n"},
{"review": "\nIn the 70's, the Irish criminal James \"Whitey\" Bulger (Johnny Depp) is\nthe leader of the Winter Hill Gang in South Boston after imprisonments\nfor many years. His brother William \"Billy\" Bulger (Benedict\nCumberbatch) is a Massachusetts Senator. When the ambitious FBI agent\nJohn Connolly (Joel Edgerton) is assigned to investigate the mafia in\nBoston, he proposes a deal to Whitey, who is a childhood friend, to\nbecome an FBI informant; in return, the FBI would neglect any\ninvestigation of his gang. They take down the Italian mob with Whitey's\ninformation while Whitey becomes one of the most powerful and notorious\ngangsters in South Boston. But when the prosecutor Fred Wyshak (Corey\nStoll) is assigned to Boston, he demands investigation of Whitey\ndespite the interference of Connolly and Whitey becomes one of the\nFBI's Ten Most Wanted List criminals.<br><br>\"Black Mass\" is another crime film based on the biography of a\nnotorious gangster, this time the criminal James \"Whitey\" Bulger in\nSouth Boston. The impressive performance of Johnny Depp is maybe the\ngreatest attraction of this movie. The story is like many others of\nnotorious American gangsters, with violence, corruption and justice in\nthe end. \"Black Mass\" never disappoints fans of this genre and the\nproduction is careful with the atmosphere in the late 70's and 80's. My\nvote is seven.<br><br>Title (Brazil): \"Aliança do Crime\" (\"Crime Alliance\")\n"},
{"review": "\nBlack Mass is a waste of your time and money. DO NOT see this. The\nnumber of well-known actors used in this film is a damn shame because\nevery single role is such a cardboard cutout that any lesser-known\nactor wouldn't have made a difference. Depp plays \"Whitey\" Bulger, and\nto constantly remind the audience that he's a real bad guy, he gives\nstone-cold, eye piercing looks, he throws in the necessary run of the\nmill curses, kills a few unremarkable people throughout and that's it.\nDon't expect any action or colorful, well-written characters. Yes, this\nis based off a true story, but, in the context of the film, there is no\nsignificance; it doesn't matter--it's been done a ton before and it\nadds absolutely nothing new or refreshing to the genre. Except for a\ncouple of interesting subplots (which are all quickly brushed off and\n\"resolved\" by a single line of dialogue in a following scene), this\nfilm has nothing going for it. And it really is a shame; there are\nhints of a better film that shine through every once in a while during\nits seemingly forever-feeling run-time, but, that's not to be had.\nThere's not much more to say because this film really doesn't have much\ngoing for it. DON'T go to see this--it really is THAT bad.\n"},
{"review": "\nA good movie. For me, biopic as a whole (and in some ways this is the\ncase of this film) are part of a genre that is extremely difficult to\nmake interesting, engaging, or at least curious to the public, that is,\nit requires a huge racing everyone involved in the production, and also\nthat the story in question has some basis to be adapted to the cinema.\nBlack Mass is not an example of excellence in this type of film, far\nfrom it, but can fulfill its role as a whole is good, has an extremely\nattractive story, and at times his many jumps in time cease all very\nchopped, but the whole experience is justified by a major factor:\nJohnny Depp. All actors in the main long core are fine in their roles,\nwhich already slightly increases the overall grade, but Depp is really\nfantastic, leaving those who really watches in fear for all who engage\nwith him, even with some dramas placed within the story somewhat\nunresolved, all convictions and Jimmy Bulger motivations are extremely\nconvincing in the hands of the great actor. Analyzing only the\nnarrative and structure of the feature film the note would be 6 or even\n5 though, as the evaluation can not just focus only on a few factors,\nbut in all, 7 seems but fair, a good movie, which has great asset as\nthe expertise of its actors.\n"},
{"review": "\nI watched this on a plane ...what a joke...I am sick of the bogus\nBoston accents too...Depp is bad, don't kid yourself.<br><br>If you read the weasle confessions from the gang...you have the\nstory...they just seemed to act out what has been written in\nnewspapers....it starts with a bad script and no back story....everyone\nis so in awe about Jonny Depp transformation from a drûgged out punk\nmovie actor to a semi bald Bulger...please! It is holly weird they can\nmake anyone anything....bad movie, bad acting...go see a high school\ntheater group it will be more entertaining and much more talents.<br><br>They miss out a lot on what really happened with Jimmy and southie, no\nshakedowns, no Framingham aqueduct hit...lots missing. Seemed they just\nrushed through it all and had no drama.\n"},
{"review": "\nThe American crime genre is arguably the cornerstone of modern cinema.\nThink cinematic masterpieces and there's a good chance every third one\nis a mobster flick or underworld yarn. This breed of film is nothing if\nnot reliable. Why, then, is the first notable movie about one of\nU.S.A's most notorious and durable heads of crime so unmemorable?\nChecking off key points in an organised but uninspired manner, this\nJames \"Whitey\" Bulger biopic is seemingly more concerned about fitting\nin all the Wiki-worthy moments rather than truly delving into the\npsyche of a monstrous man. The unfocused script stems from the choice\nto trace two decades of Bulger's life (1975 to 1995), an unwieldy\nstretch of time that results in an unclear filmic timeline and the\nrequirement for truly horrible makeup and wigs. Johnny Depp has\nsucceeded at portraying a gangster before \u0096 his John Dillinger in\nPublic Enemies is enthralling \u0096 however he's lumped with too many\npoorly executed physical alterations and character development\nshortcomings to make an impression here. Aussie Joel Edgerton fares\nbetter as a morally intriguing federal agent skating on thin ice, and\nKevin Bacon is enjoyable as a frustrated FBI boss, but why Benedict\nCumberbatch signed on for such an inconsequential role, as Bulger's\nSenator brother, is anyone's guess. Scott Cooper keeps it relatively\nlow-key behind the camera, aside from a couple of stylish murder\nsequences, with the suitably dour cinematography and unfussy score\nfollowing suit. Overall Black Mass is never overtly bad, per se; its\nmajor sin is just being so damn standard.\n"},
{"review": "\nPoor acting. Extremely slow moving story. Do Not watch this movie. Its\nbarely watchable in bits but largely uncoordinated with no consistent\nnarrative and characters. The director needs to learn to do some\nediting and script writing. No body in their right mind would have\napproved this movie to go into production. <br><br>I've heard some critics discuss the overuse of violence in the film.\nThough there is quite a bit of violence, I thought it was used very\ntastefully. No blood was used where it didn't seem necessary, and\npersonally, I think that the violence becomes numbing, which takes us\neven further into the mob guys' mentality on murder. <br><br>All the positive-rated reviews are by Johny depp fan boys and not good\ncinema critiques. Avoid watching it if you can, at all costs. A sheer\nwaste of 2 hours! The ending is predictable within the first 5 minutes\nof the movie. Go re-watch the usual suspects instead.\n"},
{"review": "\nThe trailers for this movie were awesome, and contain 5 minutes of\namazing acting, directing and writing. The other 117 minutes are a\nbitter disappointment. All the action in the entire movie is already in\nthe trailer. Nothing else happens. I can think of no reason why anybody\nwould want to pay money to watch this.<br><br>This movie looks as though it was intentionally made to bore the\naudience. I can't imagine anything that could be done to make this\nmovie more boring. Even a black screen for 122 minute would have been\nbetter because then you get to sleep.<br><br>The movie moves at such a slow pace with so boring a plot and so many\nattempts at making everybody look good and being politically correct,\nthat even the awesome Johnny Depp performances in the trailer look weak\nand halfhearted when put into context.<br><br>Basically: Watch the trailers (they're awesome), but not the movie!\n"},
{"review": "\nI really don't know where to start, commenting about this movie.\nPerhaps I've setup my expectations to high due such a huge marketing\nmedia promoting the debut of this movie.<br><br>The only thing I know is that I left the movie theater with a sour\ntaste in my mouth. <br><br>I am far from being a movie critic, but I have seen enough good movies\nfrom Mr.Depp to know that this one is not his \"opera prima\" like some\nmovie critics have already said.<br><br>The script is sometimes boring, and I wonder what Francis Coppola and a\nmore recent director Martin Scorssese would think about this movie\nafter seeing such a fiasco at trying to characterize the mafia day in\nthe 70 in the American society. Again, I am sorry but I don't see\nMr.Depp characterization being as good as the press claims. <br><br>If you have a plan B, pick it, this is not a plan A movie\n"},
{"review": "\n\"Long and boring\" are the first words that come to mind when exiting\nfrom this film, which seems strange because a gangster film which is\nboring is almost a contrast in words. Off-hand I can't think of another\ngangster film that had less action, suspense, or drama. Apart from the\nlength and direction, the musical score is almost non-existent, which\nin a film of this nature trying to recapture bygone days, is a cardinal\nsin.<br><br>Perhaps the worst feature of the film, though, is the acting, from\nJohnny Depp's poor imitation of Jack Nicholson to the Irish accents\nthat come and go throughout the film. It's not all bad acting. For me,\nDavid Harbour (\"End of Watch\"), Dakota Johnson (\"The Social Network\")\nand Juno Temple (\"Magic, Magic\") stood out.<br><br>This is a film you can surely miss.\n"},
{"review": "\nBlack Mass was such a boring movie. There, I said it..<br><br>Not only was it boring, but it was also confusing at several points\nwhich made it nearly impossible to enjoy while watching it for the\nfirst (and only) time. It isn't completely impossible, but there were\nfar too many pieces missing throughout.<br><br>I checked my watch an hour in and dreaded the fact that I still had\nanother hour to sit through.<br><br>Excessive swearing and random killing is all this movie was. Were the\nperformances outstanding? Hardly. And this surprised me considering all\nof the positive reviews and famous names of people who were in it.<br><br>In the end you're left with an overrated crime based \"drama\" movie that\nisn't worth watching and full of regret wishing you had bought that\ndessert rather than sitting through over 2 hours of whatever the hell\nthat was. I was very disappointed.\n"},
{"review": "\nBy now we've seen this format often enough with its well-rehearsed\ndrills: men in suits and big ties: large hair on everyone; a soundtrack\nof known and more obscure period hits; moody settings in bars,\nwasteland, and a shabby district of town; a protagonist that is\nattractive in a psychopathic sense, a supporting cast of solid actors\nembellish the entire piece; a script with a couple of strong scenes and\na memorable line and bada bing - it's a quality piece of work.<br><br>There's little wrong with this movie: some people may quibble about\nDepp (who seems to have channeled a bit of Nicholson from The Departed\nas he filched Keith Richards for the pirate series), but really, it's\nnot worth the struggle. We've seen it, or a variation of it a few times\nand it does nothing new. So it grinds on to it's inevitable conclusion\nand then we forget about it.<br><br>If there is tedium it's in the script which skates over the material in\nthe standard ways, although it offers a central focus over loyalty, but\nsomehow this too has been over done, overplayed too often as well.<br><br>It's not bad, it's not great; its just another product off the line.\n"},
{"review": "\nI was really looking forward to this..not so much for Depp but Egerton\nas I seen him in \" The Gift\" and he was brilliant.<br><br>What I got was a very lacklustre and badly told story.In my opinion all\nthe cast were well below par and unconvincing.<br><br>It tried to be a \"L.A.Confidential \" mixed with \"Goodfellas\" but for me\nfell flat.<br><br>The way the story was told was far too narrative based and Johnny Depp\nwas trying his best to look and sound like Ray Liotta .<br><br>Not a good attempt all round and I cannot see it doing well at all.<br><br>I found that I didn't really care at all for the characters and\neverybody over acted in the extreme.\n"},
{"review": "\nFirst of all don't compare this movie to good fellas or departed. this\ncan stand on its own. i am big fan of good fellas and departed &amp; still\ni like BLACK MASS.<br><br>johnny Depp gave a power packed performance.every single scene is\ndominated by him.there are some scenes made the movie slower and there\nare some scenes not accurate as it was happened but still story was\ngripping and also it was narrated clearly didn't confuse the audiences.<br><br>i know that i cant expect any surprises in the end.we all know how its\nend still some scenes made me interested like Depp's performance at the\ntable scene with David harbour.<br><br>see it for Johnny Depp's acting .\n"},
{"review": "\nthis a Protest Review:<br><br>as a movie Fiend first and as a Bostonian second Horrible Movie\nHorrible Screenplay and a horrible Cast..Johnny Depp was good as usual\nKevin Bacon was alright but the rest of the cast is basically talent\nless... who is casting these days in HollyWeird??? not worth the 10\nbucks or more importantly the wasted time. they should've had a cast\nlike the Departed (2006) and a better plot not a bunch of low tier\nwanna be and non presentable British or OZ talent less cast well funded\nand well represented...it's a shame what's happening to the film\nindustry in HollyWeird. it really gets weirder everyday i Rest my Case.\n"},
{"review": "\nMaybe this is my fault and I missed the point of the film, but it\nsimply doesn't allow you to get to know Bulger at all. Its simply a\nstring of scenes of Bulger doing bad things with little connecting,\nlittle explanation and nothing in terms of who he really is. How did he\nbecome who he is, whats his motivation? None of this is answered in the\nfilm. I think it was simply too big of a story to tell in 2 hours so\nthey cut out any background or emotional story lines and simply left\nthe more \"exciting\" murders and crimes. <br><br>The acting was average. Nothing stood out as being exceptional or\ncringy, though the characters seemed one dimensional. Not the worst\nfilm of the year and I think if it interests you then see it, at worst\nyou'll be disappointed.\n"},
{"review": "\nThis movie had fantastic trailers. I was beyond excited to see it, and\nwent out opening weekend with high hopes. Unfortunately, it completely\nfailed to live up to my expectations, leading to a very poor night.<br><br>As most reviewers will tell you, the acting is done well in this movie.\nDepp especially does a fantastic job. However, his character (Whitey\nBulger) was never fleshed out, the only backstory given through the FBI\nagent (Connolly) who he informs to, who was a childhood friend of his.\nIn fact, the plot was executed so poorly that you never truly care for\nWhitey and have no idea what his story actually is, or his motivation.\nThis is exemplified perfectly in one early scene.<br><br>Whitey is introduced in a scene which takes place in a bar, in which he\nsits silently at a table with a group of mob members. These members are\nhaving a conversation meant to set up a bit of plot regarding the\ncurrent mob politics. The characters who speak, however, can barely be\nheard over the bar noise. They aren't even shown on camera, because\nvisually the scene focuses only on Depp watching another character eat\nout of a peanut bowl after licking his fingers. After the conversation\nends, Depp calls out the character for doing this, and threatens him.\nRight from the beginning, the plot took a backseat and the movie served\nonly to show that Whitey is a really bad guy.<br><br>This movie completely failed to deliver on plot, with no connections\nfrom one scene to the next and no excitement. There was not even a\nclimax. Towards the end, Depp suddenly gives guns to the IRA and gets\ncaught in the next scene. That's it. The movie ends minutes later. The\nlack of emotion and plot, with the only focus being on Whitey Bulger's\nbad side, holds this movie back from offering anything compelling. It\nwas just bad.\n"},
{"review": "\nFirstly I just don't get why Johnny \"prosthetics\" Depp is even in this.\nWhen you are introduced to him you immediately mistake him for Ray\nLiotta. Down to the eye lashes even the accent. They worked hard to\nmake him Ray Liotta on every level except he's dull and monotone where\nray does that stand up and applaud rage face Depp is incapable of. He's\njust not enjoyable to watch. He looks a bit like Whitey Bulger but it's\nreally incidental and a waste of effort. Hell if anything he looks more\nlike Dracula than Whitey Bulger who was actually a fairly attractive\nguy. <br><br>The rest of the movie is a weird borefest. None of the scenes connect.\nStuff just happens then they move to days or weeks or years later with\nno transition. Nothing in any point ties to later scenes either\ndirectly or metaphorically. Characters come and go aimlessly. <br><br>It's a real shame, other than Joel Edgerton who's wasted on this poorly\nwritten bad cop the rest of the cast is quite good. Roy Cochrane played\nhis partner Steve Flemmi and he was great. <br><br>I don't think anyone's gonna read these reviews and pass on this, but\nI'd say at least don't waste money on this one. Just go watch good\nfellas, it really is just ripping off it pretty bad. I'm gonna go watch\nthe Whitey Bulger documentary, I suspect it be more entertaining and\nenlightening. You also leave this film feeling like you didn't learn\nmuch about Bulgar. <br><br>I think the critics are giving this movie too many breaks because they\nwere wowed by Depps Ray Liotta impression. I was not.\n"},
{"review": "\nBlack mass is a decent flick, but by no means is it anything more than\ndecent. Nothing stood out at all; the acting was fine, the story was\nfine, and the soundtrack was terrible in my opinion. The music sounded\nlike it belonged in a Bourne movie. All of the \"plot-twists\" that were\nsupposed to feel surprising didn't feel very surprising. It was\ncompletely obvious when something bad was going to happen to someone,\nunlike other gang movies like Goodfellas or Godfather. <br><br>If your not too picky and want to watch some decent gang action and\ndrama then you will likely enjoy this movie, but if your a movie snob\nlike me I would recommend passing on this one.\n"},
{"review": "\nBoth my gf and I saw this just now and we both wanted to leave after an\nhour but kept sticking with it. The acting is fine, but this movie\nfalls flat on keeping the audience engaged and interested. We spent the\nwhole movie looking at each other and hoping it would end. Definitely\ndon't recommend seeing this. Love Johnny Depp like most of you, but\ntake my advice and watch this when you don't run the risk of waisting\n$15 and two hours of your time.<br><br>The movie spans 30 years of crime under Whitey Bulger and jumps from\nhit to hit and scene to scene leaving the viewer questioning why it\nmatters to continue to watch the movie. The primary point of drama is\nwhether is Bulger's relationship with his friend Cooper will unravel\nand leave them both out to dry; but the viewer quickly loses interests\nwhen it becomes evident that the move has nothing special to it. I am\nvery disappointed I spent money to see this.\n"},
{"review": "\nI really don't know a whole lot about James \"Whitey\" Bulger outside of\nwhat I got in the documentary about him that came out shortly before\nthis film. Needless to say, he was quite an unsavory character, but\ninteresting movies have been made about those types, even in the\ngangster genre. BLACK MASS didn't always work as an engaging story,\ndespite combining two of my biggest interests (gangsters and true\ncrime), because it never really focused on a particular aspect of the\nevents and, as such, was a little unwieldy and never really let its\ncharacters develop. To be sure, it has an impressive cast and all of\nthem do fine work, but few of them outside of Johnny Depp were given\nany room to make an impression. Still, this is a well-crafted film from\na technical perspective, with excellent camera-work, a good score\n(courtesy of Junkie XL, no less), and a welcome return to form by\nJohnny Depp. This is the best I've seen him in years, possibly since\nDONNIE BRASCO. For all of the faults in the narrative structure, Johnny\nDepp is what makes this worth watching. There are times when he was\nlegitimately frightening, even though a couple of these moments were\npartially given away in the trailers. Although BLACK MASS aspires to be\nin the same company as GOODFELLAS and DONNIE BRASCO, it doesn't quite\nlive up to them, at least in terms of lasting quality and\nrewatchability. Still, it is a perfectly serviceable true crime tale\nwith a top-notch performance by Depp, itself alone to recommend at\nleast one viewing.\n"},
{"review": "\nThis biopic of a famous Boston crime lord falls flat for a number of\nreasons. Depp acts his socks off and the make-up and camera departments\ndeserve credit for imbuing a coldness in those blue blue eyes.\nCumberbach also copes ably with a role that is a departure from much of\nhis previous work. But the story fails to engage. The main problem is\nthe FBI office. The complicity of the FBI in the rise of this nefarious\nindividual is what makes this story stand out, but the squabbling\nbetween the various characters in that setting lacks gravitas. Kevin\nBacon is unusually limited. The story chases Boston authenticity,\nforsaking gripping drama in the process. There is one scene where\nBulger plays mind games with an FBI officer over the dinner table about\na 'secret' family recipe. A potentially dramatic scene, if we hadn't\nwitnessed it before, beat for beat, in Goodfellas. Taking a\ncookie-cutter to that iconic 'You think I'm funny?' scene is\nsymptomatic of the lack of ambition and verve in this film. Not a\nterrible film, but the lack of risk, or surprise, is disappointing. The\nfilmmakers should have watched 'Snowtown' before starting out.\n"},
{"review": "\nBlack Mass is a film that intrigued me from the initial trailer with\nits atmospheric and chilling introduction to this portrayal of such a\nnotorious gangster.<br><br>As someone who hadn't heard of James Bolger until this film (whether\nthat's weird or not I don't know) I found it fascinating to learn about\nhis story and his life through Johnny Depp's portrayal of Whitey. This\ntruly is a showcase of Depp's acting chops through and through, with\nother great performances from actors like Joel Edgerton and Kevin\nBacon.<br><br>Director Scott Cooper and writers Mark &amp; Jez don't hold back on showing\nsome of the more gruesome aspects of this gangsters life. The harsh,\ngrounded and brutal scenes really strike a chord with you and make you\nfear this person, really making you feel lucky you didn't live in South\nBoston during the 80's.<br><br>Wonky pacing makes for an uneven film and some actors I felt were a\nlittle miss-cast (as much as I love him as an actor I don't feel\nBenedict was a good choice for Whitey's brother), but overall this is\nan enjoyable yet haunting true tale.\n"},
{"review": "\nJohnny Depp rarely disappoints and most especially does not here. Scott\nCooper has assembled a superb supporting cast, and elicited brilliant\nperformances from them all around. It is absolutely beautifully\nshot...the lighting, angles, tone...everything. Dark and emotional, yet\nwith an undertone of functional coldness. It mirrors the characters,\nthe emotional tone of the content, as well as the era. Coupled with a\npoignant score throughout, ranging from funk/disco to classic strings,\nyou are taken on an emotional ride touching all bases. Be advised: this\nis not an action shoot- 'em-up gangster flick. This is a journey into\nthe mind and soul.<br><br>Blood, honor, and loyalty...peppered with more than a touch of\npsychopathy. Bulger is a complicated and conflicted man and Depp seems\nto have captured all of him, especially his humanity, flawed as we all\ncan be. I sincerely hope that he sees this film &amp; realizes the honor\nJohnny has done him in this portrayal.\n"},
{"review": "\nFrom 2015, Black Mass is the story of Boston mobster Whitey Bulger\n(Johnny Depp), the boss of the Boston Irish Mob called the Winter Hill\nGang. His brother was President of the Massachusetts Senate, William\nBulger, here played by Benedict Cumberbatch. <br><br>Under investigator John Connelly (Joel Edgerton), Whitey served as an\ninformant, with Connelly giving information to the FBI. Whitey's crimes\nwere ignored as he fed them info on other gangs, using the FBI to\ndestroy other gangs while his stayed in power. Once his activities -\ndrugs, murder, racketeering, money laundering, Irish gun running, and\nextortion were exposed, everyone was humiliated. <br><br>Bulger took off for sixteen years, finally arrested at the age of 81 in\nCalifornia, and is now in prison.<br><br>The performances are all terrific. I lived in Boston and I personally\nsaw nothing wrong with Benedict Cumberbatch's accent, or anyone else's\n-- when people don't want to like you, they don't, and that's it.\nEdgerton and the rest of the cast were very effective.<br><br>Depp is terrifying, keeping his voice low but ready to snap at any\nsecond. A marvelous performance. I'm not sure why Cumberbatch did this\nfilm - he doesn't have a very large role. He reminded me a little of\nDennis Quaid here, though I'm not sure why.<br><br>Truth be told, I watched this because I love Depp and Cumberbatch, but\nthis to me was not a great movie. Lots of violence and the f-bomb every\nother word is fine, but putting up with all that blood just wasn't\nworth it. In the hands of a less experienced cast, I think this would\nhave a real dud.<br><br>I think the pace could have been much better, and at 2 hours and 3\nminutes, maybe 10 or 15 minutes -- a couple of strangulations perhaps -\ncould have been cut. We got the point - cross him and he'll kill you.\n"},
{"review": "\nThis movie is based on actual people and real events. It's not a\ntypical crime thriller, it's a realistic classic on the same level as\nGoodfellas.<br><br>Director Scott Cooper, the screenwriters and lead actor Johnny Depp do\nan excellent job of gradually revealing the personality of Whitey\nBulger, a true psychopath. Bulger is quick to betray his friends and is\nunforgiving even to his closest associates when they present the\nslightest threat to him, while at the same time he demands total\nloyalty from everybody around him.<br><br>I haven't liked Joel Edgerton in other roles, such as Ramses in Exodus:\nGods and Kings, but he is the ideal actor to play John Connolly.<br><br>Black Mass moves along at just the right pace, not too fast for\ncharacter development and yet quickly enough so that it's never dull.\n"},
{"review": "\n7 /10 from 74,742 users. Not too generous if you ask me... but I have\nbeen longing for something similar to Donnie Brasco (1997) for a long\ntime. I hope the score is significantly underrated and I will have a\nblast with this one.<br><br>9 minutes - so far, it doesn't do anything different than any other mob\nfilm <br><br>33 minutes - I can't get enough of the ugliness of Johnny Depp's\ncharacter... it is beyond fugly~! <br><br>1h 11 minutes - definitely interesting to watch, many things happen and\nthe story is being told in a nice way <br><br>1h 27 minutes - the level of the creepiness.... over 9000! The things\nthat they have done with Johnny Depp's image is just unbelievable...\nWhatever there was left of him... he finished it off with his acting <br><br>1h 36 minutes - the line of the entertainment and excitement is rather\nflat, there are no ups and downs in this film, but... it is rather\ngood, if the line started at high position from the start, isn't it? <br><br>tgchan's rating: 7.5 /10\n"},
{"review": "\nNow this is what I call a quality movie. One of those movies you truly\nenjoy from the first to the last second. And the fact that it is based\non a true story makes it even better. Johnny Depp absolutely runs the\nwhole movie. The other actors did a great job as well but Depp is the\nactor that gives an exceptional performance. Don't expect to see the\nDepp you are used to because they transformed is whole look and you\nbarely recognize him. Black Mass, the story of James 'Whitey' Bulger\n(played by Johnny Depp) is very interesting and pleasant to watch if\nyou are into crime and Mafia stories. For sure, one of the better\nmovies I saw in the last months.\n"},
{"review": "\nNo.<br><br>No way! <br><br>Hell No! <br><br>Is it Hollywood dogmas with its Star System Thing <br><br>or<br><br>Is it just a non-inspired part of the Director and the Editor's Lives?<br><br>This movie, when you know all the movies that have been made about the\nmob, and include many Gems that transcend decades of movie-making and\nare still on the top of movies of all times, this movie just does not\nget in the competition with them.<br><br>Many very good actors : <br><br>-Joel Edgerton, <br><br>-Peter Sarsgaard, <br><br>- Rory Cochrane<br><br>just give awesome sensitive performances.<br><br>And indeed (as I've read in a review) the real star in this movie is\nJoel Edgerton. More precisely, his character is more interesting than\nthe movie star's character.<br><br>I don't have much to say about that one. I have been bothered through\nALL the movie by the prosthetics used on him. Couldn't he have shaved\nhis head instead? You know, Christian Bale transformed his hair in\nAmerican Hustle in a very credible way. Here it was not. And don't get\nme started on the eyes! No, No way, Hell no! <br><br>Oh and all the movie! The editing! Really I don't like to say so many\nnegative things. But the scenes were often too long and not significant\nenough. It was always like a sauce that never thickens. Odd. At some\npoint, there is this view from the sky, and it's halfway of the movie,\nand I got me thinking : I could as well stop now! <br><br>They should not have put a big star on the movie poster and all these\nlittle faces below him. Because these little faces are what saves this\nmovie. I would say : watch it, make your own opinion, and don't miss\nthe not-big-stars performances.\n"},
{"review": "\nJimmy (Johnny Depp) and his associates form an Irish American crime\nsyndicate. This film certainly doesn't glorify cold blooded murderous\nkillers, quite the opposite. However what useful information Jimmy\nactually gives the FBI as an informant isn't entirely clear except one\nscene where John Connelly (Jimmy's FBI confident played by Joel\nEgerton) turns up to the office with a load of snaps of Jimmy's rival\ngangster clan hanging out. The film looks great but the audience never\nreally get to know any of the characters. Towards the latter stages of\nthe film Joel Egerton acts every scene as if he's on his fifth shot of\nwhiskey which is mainly caused by the introduction of an FBI\ninvestigator keen to pursue Jimmy's criminal activities. Benedict\nCumberbatch plays Jimmy's brother, who is also the state senator. After\nthe perimeter's of the film have been established the pace slows and a\nscene by a beach that caused me to hope there would be a tsunami was a\nreminder the action was on gangster movie cruise control.\n"},
{"review": "\nThis may seem like a bold statement, but this might just be Johnny\nDepp's best performance of all time. Depp's always been one of my\nfavorite actors and I just loved that he decided to do this movie,\nbecause, despite his talent, it just felt to me the characters he\nportrayed lately are kind of Tim Burton parodied versions of himself or\nsomething. But I love that he went for this project, because he\nabsolutely nailed it, big time. His performance is flawless, but let's\ntalk about some of the other actors in the film who are also great.\nBenedict Cumberbatch nails the Boston accent, surprisingly, he's great.\nJoel Edgerton is also pretty fantastic in the move, as well. However,\nthe unfortunate reality of Black Mass, is that it's enormously elevated\nby its performances, particularly Depp's. I wasn't really invested in\nthe story as I should have been and the plot moves achingly slow. What\nthey really should have done is they should have focused almost\nentirely on Johnny Depp's character, because every scene he's in is\npretty much the best scenes in the film. The entire under the table\nstuff with the FBI simply didn't do it for me, and it's really a shame\nbecause it's like the entire second half of the film focuses entirely\non that. However, I do think Black Mass is a good movie, it's just not\na great one. But it's worth the price of admission simply to see Johnny\nDepp.\n"},
{"review": "\nScott Cooper is a guy who directed Crazy Heart which I've heard is good\nbut haven't seen, and Out of the Furnace which I was unimpressed by for\nits tone. Regardless, his film have a solid feel to them - they feel\nrobust, and he is great for getting great people in-front of the\ncamera.<br><br>In this film, the two featured leads, Johnny Depp and Joel Edgerton,\ndeliver the best work they could possibly do; Depp's performance as\nJames Bulger is malevolent, terrifying, and in many scenes totally\nbelievable. He isn't a light, jolly, seductive figure that Depp's\nreputation lends itself naturally towards, and I think is totally\nworthy of an Oscar. Joel Edgerton as John Connolly, Bulger's FBI\nhandler who is manipulated is fantastic as the man whose awe of Bulger\ndrags him in deeper and deeper to the point where he can't separate\npersonal and professional boundaries.<br><br>The biggest problem with the film is that the emotional fulcrum point\nis around the two most emotionally compromising people. The other cast\nare fairly wasted; the most notable example is Benedict Cumberbatch,\nwho does great as Senator Billy Bulger, who creates a honorable, no bs\nman who loses his position because of his brother is pushed to the side\ndespite a great performance with a believable Boston accent.<br><br>Overall the film is a strong one, but it keeps itself from being\nperfect. Depp's performance however IS perfect, and is solely worth\nseeing for that.\n"},
{"review": "\nJohnny Depp and Joel Edgerton star in this 2015 crime drama based on a\ntrue story. This takes place in South Boston during the 1970's to 80's\nand Depp plays Irish mob figure, Jimmy 'Whitey' Bulger who becomes an\ninformant for the FBI for long time friend, John Connolly (Edgerton)\nwho is one of the bureau's top agents. John gets himself in a mess when\nhe reveals secrets and Jimmy starts pulling crimes and wiping out other\nwitnesses as well as mobsters to be on top. Kevin Bacon, W. Earl Brown\nand Dakota Johnson also appear. This is a pretty good film, Depp is\ngreat in it as usual and the film sort of resembles \"Goodfellas,\" \"The\nDeparted\" and \"Donnie Brasco.\" I recommend this.\n"},
{"review": "\nAs gangster films go, you could do worse, but that being said you could\nalso do better. Admittedly, what makes this film most interesting is\nJohnny Depp, and if it hadn't been for him the film would be yet\nanother formulaic gangster movie, with all the same clichés and the\nsame basic plot as countless others. Which it is of course, but its\njust slightly more interesting.<br><br>Depp's performance is good because it is unusual for his career. In my\nopinion Blow was both a better film and better acted, but here Depp\nplays to his age, which is new, and he does it very well. <br><br>Depp's character, James Bulger, was a homicidal psychopath who once\nstole a poor mans winning lottery ticket so he could add a few extra\nmillion dollars to his million dollars. Quite why we should have a film\nthat glamorises that I don't know, but I digress. The point is that\nDepps performance is so charismatic that we find ourselves rooting for\nthis scumbag until the very end.<br><br>Depp's acting aside there are some good moments, but those moments are\nspread thinly between gangster caricatures and, to be honest, an\nobvious plot. Its well written, adequately directed and generally\nstrong in most areas but it lacks that special something that would\nmake it deserve to be remembered.\n"},
{"review": "\nAs a man who knows his crime movies, I was very stoked to see this. The\nadvertising campaign made this movie look like the cinematic event of\nyear. Everyone got so excited, that they got disappointed when they\nrealized that it wasn't another Goodfellas. Let's be honest, how many\nmovies are? It was really never meant to be in the first place. The\nWhitey Bulger story is something much slower, creepier and slimier.\nBlack Mass is the Whitey Bulger story, as it really went down. With\neverything considered, it is nothing short of a great crime movie. At\nthe center of it all is a tour-de-force performance by Johnny Depp.\nIt's the best performance he's done in more than a decade. He has the\nBest Actor nominations on lock. Every time he is on screen, you cannot\nkeep your eyes off of him. He's fascinating, and yet absolutely\nrevolting. Other than Depp, we have a so-so performance by Joel\nEdgarton, and a surprisingly stellar performance by Benedict\nCumberbatch as Billy Bulger. It's as violent as any great gangster\nmovie, and just as well shot. I think it's not to be missed, as long as\nyou remind yourself that this isn't going to be Scorsese.\n"},
{"review": "\nI have to say I was disappointed. I watched with greater expectations\nthan I should have. The film failed to engage my interest (that doesn't\nmean it wont engage someone else's)I had seen Legend recently which was\na far better production and Tom Hardy superb; so films with a Gangster\ntheme appear to be prominent this year. This film also based on a true\nstory was far grittier and didn't glamorise the actions of those that\nthe film portrays - Johnny Depp is almost unrecognisable as Whitey\nBulger which the film is essentially about. This could have been a\nbrilliant film instead it is a collaboration of scenes mismatched\ntogether threaded together to make some sense which it fails to do as\nyou don't connect to the characters in it; becoming ordinary and\npedestrian instead of gripping your attention as say characters in the\nDeparted which has been often referred to in reviews. I agree with a\nprevious reviewer that had more emphasis been put on the development of\nthe characters from childhood Whitey Bulger, John Connoly and Billy\nBulger (brother and senator) and how this then transformed into later\nlife this would have been a really good film as it is, it is worth\nwatching but don't break a leg to do so. It also fails in the final 30\nminutes as it doesn't show us how we get to the bringing the gang down\n- it simply just happens! there is no tension or how it all unravels.\nWatch the Departed on DVD for a real gripping film and Legend for\nbetter acting and a better presented story.\n"},
{"review": "\nBlack Mass is at times engaging and throws you in a world of vivid\ncharacters. Depp particularly shows that despite the foibles of his\npast years he is still a great actor. Yet despite those few gems the\nmovie is coated with a deep layer of mundanity that does nothing but\nleave you with a sense of emptiness after the movie is done.<br><br>Black Mass suffers from a common ailment of Based on True Events films\nin that real stories do not fit nicely into narratives. That's\nespecially true for films that try to span many years. Black Mass, like\nmany such films, feels rough around the edges like it just doesn't have\nthe time to tell the entire story so it just bites off pieces here and\nthere making the finished work look like Cliff's Notes of a much larger\nstory.<br><br>I didn't feel satisfied with what I got in the end. The movie doesn't\nfocus on any one character or at least paint a portrait of the criminal\nworld. To tell the truth I felt rather disappointed after the movie\nended because I expected so much more from this film. I do believe it\nhad the potential for greatness.\n"},
{"review": "\nJohnny Depp's acting is as always amazing however even that could not\nsave this movie. From the trailer I had the impression of going to see\na mix of 'The Departed' and 'Johnny Brasco' however with so much going\nfor it this movie failed to deliver. My main issue with this movie is\nthat the Character Development is average at best. You get no sense why\nJohnny Depp (Whitey Bulger) and Joel Edgerton (FBI Agent John Connolly)\nhave such a deep connection. With a great cast it is sad that the plot\nfell so far behind. It is worth watching but I would definitely wait\nfor it to be on DVD/Streaming Service. This movie is just not worth the\nprice of admission.\n"},
{"review": "\nThe only thing that will surprise you about Black Mass is why we ever\ndoubted Johnny Depp in the first place.<br><br>In all fairness Depp hasn't had the best track record as of late but\nnot for his lack of effort. Yes he loves to hide behind make-up and\nprosthetics, but doesn't Mr. Depp always sink into these bizarre\ncharacters like a glove? His range of performances is something to be\nadmired, and his portrayal of the notorious South Boston gangster Jimmy\n\"Whitey\" Bulger is no different. It's simply an outstanding\nperformance. The entire film seems to hinge on it; he's captivating,\nfrightening, odd, and charismatic all at once. And Depp isn't the only\none doing great work here. Benedict Cumberbatch does a fine job with\nthat difficult Boston accent, Kevin Bacon is reliable as usual, Dakota\nJohnson, Corey Stoll, Jesse Plemons all provide solid character work.\nBut the real standout is Joel Edgerton. This man is unstoppable as of\nlate. With The Gift earlier this year and now his turn as a corrupt FBI\nagent in this film, Edgerton has established himself as a true talent\nwe can expect great things from. But with all these fantastic\nperformances the film just isn't that memorable.<br><br>Director Scott Cooper does an admirable job but his approach to the\ncontent lacks insight or originality. The story stays engaging at first\nbut looses steam midway and never seems to find it's footing near the\nend. Overall it's an entertaining film thanks to its actors but won't\nbe leaving you wanting more.\n"},
{"review": "\nBlack Mass is a terrific movie with a very well developed storyline and\nan outstanding cast. It's a fantastic crime film that dives deep in the\nlife of Whitey Bulger, one of the most infamous criminals there is,\nrevolving around the FBI's struggles to find any proof of him\ncommitting a crime, because of his skills with the law, the story is\nvery interesting and you will find it very hard to believe that it is\nall completely true. The only thing about this film that I felt was\nmissing was more violence, Bulger lived a long life full of crime, and\nI think making this film 15A was a mistake, because they weren't\nallowed show as much as regards to the terrible crime himself and his\nmen committed. It pans away for certain scenes or moves forward to the\nnext scene at times when you can tell things are about to get intense,\nit would have been better off with an 18's rating. All the performances\nare absolutely outstanding, ranging from top notch acting from the\nlikes of Joel Edgerton, Benedict Cumberbatch and Jesse Plemons, and\neven some unexpectedly terrific turns from the likes of Dakota Johnson,\nAdam Scott and Kevin Bacon. However, none of these great actors can top\nJohnny Depp in the lead role, he shines in every scene, he lives and\nbreaths Bulger and it is very clear that he went method for his\nperformance, I've never been unimpressed with him in any movie, but\nthis is some of his best work yet. While it may be lacking in thrills\nat times, Black Mass boasts a terrific story, excellent character\ndevelopment and outstanding performances, I would recommend it to\nanyone looking for a good crime drama. <br><br>The story of real life criminal James \"Whitey\" Bulger, following his\nlong life of crime in Boston, which he was able to keep up after\nforming a relationship with the FBI. <br><br>Best Performance: Johnny Depp\n"},
{"review": "\nThis film is totally average. So many things wrong with this film\nstarting with the story though, undeveloped characters and little to no\nexplanation of the back story to James \"Whitey\" Bulger other than he\ndid some time behind bars because someone snitched on him.<br><br>The accents are questionable and the dialogue cliché. It tries to copy\nthe great gangster flicks of our time but just ends up being mediocre.<br><br>When we are introduced to the CIA agent things got a little bit more\ninteresting, but then the film tends to speed past anything interesting\nas if it's not of any importance and tries to focus on intimate moments\nbetween the main characters, it might of worked if the script wasn't so\nboring.\n"},
{"review": "\nI was really looking forward to this movie but at the end it was a bit\nunderwhelming. Good acting from Johnny Depp and Joel Edgerton. Depp in\nparticular is menacing as Bulger. He will probably get nominated for an\nOscar and so will the makeup artist. <br><br>Some characters were wasted such as Benedict Cumberbatch as whiteys\nbrother and Corey Stroll as whyshak. But I guess they couldn't fit them\nall in the movie.<br><br>Some unnecessary scenes like the dinner scene with David Harbor which i\nsuspect they were trying to make like the \"what do you mean funny\",\nscene from Goodfellas.<br><br>I enjoyed the scene at the start with Bulger explaining to his son how\nto get away with crime<br><br>so like I said good but not great.\n"},
{"review": "\nBefore I get to watch this film, I thought that it may be another\ngangster movie which just average, but after watch it, it really blow\nmy mind and this is one of the best this year! Director Scott Cooper\nhave directed Crazy Heart and Out of the Furnace which I still haven't\nhave a chance to watch it yet, but I know both previous film got a high\nrating, but after watching Black Mass, I think director Scott Cooper\ndid a great job! The editing and story telling are great, the way it\ncross edit story with the interrogation is good, one of a good way to\ntell the story.<br><br>All the actors and actress performance are great. Johnny Depp got his\none of the best performance in Black Mass, how he acted like whitey\nBulger, the way he talk, the way he re act in the daily life and the\ncruelty of the character, Johnny is bravo on this character.<br><br>Those who love Johnny Depp, I think you won't want to missed this, and\nfor those who like to watch gangsters movie or mafia movie such like\nGodfather, American Gangster etc, Black Mass will be your choice too,\none of the best this year, so don't miss it!\n"},
{"review": "\nIt's time that we'd had another refreshing mafia pic, although Black\nMass is not in the same category as old unforgotten classics. Again,\nthis is based on real characters, Depp at his creepiest, who has his\nmoments, of really making you unsettled, and we love this great actor\nfor it. First off, the acting is superb, no one out of line here,\nDakota Johnson looking sexier here than in Fifty Shades, who plays\nDepp's wife. Whitney Bulger (Depp) was the most feared gangster in\nBoston, where Depp's obviously done the character justice. Responsible\nfor a supermarket of crime, but impossible to catch. An old friend from\nthe neighborhood, John Connolly (Oz's Edgerton) now, FBI, throws an\noffer at Depp to be an informant, taking down obvious arch enemy mob\nfigures, Bulger, hates, while maintaining to go on doing what he does.\nWhat's truly sad about this arrangement was how John and his partner,\ngot themselves in something way over their head, really copping a\ntragic blow, by really trying to do good, where Connolly, lucked out\nmost of all with an eye widening and truly unjust sentence. It's the\nlast half an hour, the dangerous situation and predicament of\nConnolly's and co, that really makes this part of the movie's most\nengrossing which doesn't ensue as you think it will, as in more blood\nspattering. There are other frightening moments, and some predictable\nones, in this that comes from seeing other mafia pics, but B.M. is\nanother reason, to see a great actor at work, in probably what is his\nfinest hour. Bulger was a despicable figure and there were times, you\nactually sympathize with him, through his pathetic self, but Depp's\nperformance will leave his mark on ya. Trust me.\n"},
{"review": "\nI have read quite a few underwhelming reviews which I think do not do\njustice to this captivating film. First of all, forget about \"The\ngodfather\" or \"The departed\". It's different, less flashy and maybe\nalso less entertaining, especially for people not used to \"slow\"\nmovies. However I also find it more realistic and thought-provoking.\nSome of the more critical opinions point out the \"lack of depth of the\ncharacters\", however we should not forget that real-life carrier\ncriminals are often in fact, less than complicated and certainly aren't\nthe uber cool guys often depicted on screen. They might be intelligent\nin some cases, but they are greedy, violent and don't have moral\nboundaries. Frequently they also show sadistic tendencies, as the\nprotagonist does. I consider it exhilarating that there's no\nglorification of organized crime and those involved in it, just a quite\nfaithful, as far as I know, adaptation of true events.<br><br>The stellar cast is top-notch, even secondary characters give a\nconvincing performance. Depp's acting is certainly Oscar-worthy, he is\nunrecognizable and really frightening. Edgerton is just perfect as the\nsleazy, yet loyal in his own twisted way, cop. Cumberbatch is solid as\nalways, I 'd have loved to see more of Kevin Bacon, one of my all- time\nfavorite actors. Furthermore, I was absolutely stunned by Sarsgaard's\nperformance, he really shines in his small part. <br><br>I definitively recommend you watch it in the cinema, in order to fully\nappreciate the style, the musical score and the gloomy atmosphere. I\ndidn't give it a 10/10 rating, because imho the editing should have\nbeen slightly tighter, especially during the first third of the film.\nOtherwise I hope time treats it kindly and puts it among the classics\nof its genre, as it deserves.\n"},
{"review": "\nI'm Irish and I live in a Boston suburb. Here is what I would have done\nto make a better movie. Start the film in the projects when Connolly\nand the Bulgers were young. Show the environment they were raised\nin.The cops. the Catholic Church. All were relevant in their\nupbringing. How being a \"rat\" was considered more serious than being a\nmurderer. How loyalty was considered the most worthy quality. Tell us\nsomething about the growth of Howie Winter and the Winter Hill Gang and\nhow Bulger grew within that gang . Describe the relationship between\nthe Irish gangsters of Southie and the Mafia in the North End. Take the\nfirst 30 minutes of the movie as background and then tell the Connolly-\nBulger story. I didn't like the way that the Connolly angle shared\nequal screen with the Whitey angle. As for the Whitey Bulger portrayal,\nforget the drivel of the tragedies of his son and mother's deaths. The\nguy was a bad guy. The viewer doesn't need to be reminded that even bad\nguys have a heart once in a while. I never got the feeling that the\nwhole film was nothing more than the story of a local hood.A little\nknow gangster outside of South Boston. As for the Angiulo family, pure\nhogwash . My friends and i used to go over the the North End for pizza\nafter a Bruins game and we knew where Angiulo lived so how could the\nFBI not know. The actors' make up was horrible. Boston accents were\npretty good and Depp was good . An o.k. movie but could have been so\nmuch better\n"},
{"review": "\nSure, Johnny Depp is almost unrecognizable and sinister and creepy as\nthe real life gangster James Whitey Bulger.<br><br>But he is not creepy enough. He never seems out of control and totally\ninsane like Heath Ledger's joker in The Dark Knight.<br><br>It's not just that Depp is unlikeable, he's suppose to be unlikeable,\nits more the fact that there isn't a single likable character in the\nmovie.<br><br>Joel Edgerton ticked me off from the moment he appeared in the movie.\nHe looked constipated and fat. And not once was he not wearing a suit\nwhere even his neck was covered by the collar of his shirt. I hated his\nsuits and his big hair. Like everyone else in the movie he was scum.<br><br>The movie is in general depressing and boring. As bad as Good Fellas,\nwhich in my opinion is one of the crappiest and most overrated gangster\nmovies ever made.<br><br>And I love good gangster movies like Donnie Brasco, another gangster\nmovie with Depp where he is so much better. Or The Untouchables or\nScarface. Masterpieces within their genre.<br><br>This could have been an interesting movie if Depp have had the guts to\nplay Bulger like a complete psycho. Like Al Pacino in Scarface. Sure he\nkills several people violently, but even that is done boring. If there\nhad been even one character worth rooting for it could also have\nimproved the movie.<br><br>Black Mass is one cliché after another and it goes completely by the\nbook as far as gangster movies go which unfortunately makes it very\nvery boring.\n"},
{"review": "\nMaybe it's because I lived in Jersey for thirty years and got use to\nthe dialects or reading about the mob in the newspaper over a cup of\ncoffee at Dunkin Donuts. But to me Black Mass was about as exciting as\nwatching a bad night of karaoke when you've promised yourself you\nweren't going to drink or smoke anymore.<br><br>Truth be told, I didn't even recognize Johnny Depp - that's how great\nan actor he is, but sometimes even a great actor can't save a movie\nfrom oblivion.<br><br>Of course, I realize critics love this type of movie for all the\nlogical reasons they learned in film school, but really, if I hadn't\nbeen invited to see it with a friend I would have walked out halfway\nthrough.<br><br>Like I said in the opening, maybe it's just me or maybe the king really\nisn't wearing any clothes ;-)\n"},
{"review": "\nI always get expectations about Depp's new movies. OK, maybe not when\nhe's doing Caribbean pirates and Chocolate factories and all that\nmeaningless massmedia empty distracting movies. But, for example, I\nreally liked Public enemies (but maybe Bale saved that movie). But\n-again- I got soooo many disappointments with this overrated actor:\nTrascendence, The tourist. I can still save, I guess, The rum diary.\nAnd I love the guy, outside of the screen, i mean. And I guess he WAS a\ngreat actor: From hell, Donnie Brasco, The Mexican, Edward\nScissorhands... He WAS a great actor and that's it. As, for example, De\nNiro or Sean Penn... I guess they run into an age where they're not\nable to do great performances again, may be a matter of physical\ncondition, mental condition, the need to do a job, the willing to do\nit.<br><br>Here people, in 2016 biggest deception, you can't tell when was that\nDepp's son die! you can't tell when was that his mother die! Did they\nhave to shoot the whole movie in a day?! How come that?!<br><br>To made it complete, I can't stop thinking of Cumberbatch's part and\naccent: it was Boston, buddies?! Couldn't you just put one of the\nAfflecks or Matt Damon there?! Matt is in every movie you watch, except\nin the one they need him!<br><br>Also: Dakota Johnson?! Julianne Nicholson?! What a pair of non played\nroles.<br><br>Got to save Rory Cochrane, Earl Brown and -in the first half of the\nmovie- Joel Edgerton, but i've really looking forward to this and it\njust let me so down\n"},
{"review": "\nBlack Mass is a biographical film that was based on the 2001 book Black\nMass: The True Story of an Unholy Alliance Between the FBI and the\nIrish Mob that was written by Dick Lehr and Gerard O'Neill.It stars\nJohnny Depp together with Joel Edgerton,Peter Sarsgaard, Rory\nCochrane,Kevin Bacon,Peter Saarsgard, Dakota Johnson, and Corey Stoll.<br><br>During the 1970's,FBI Agent John Connolly convinces Irish mobster James\n\"Whitey\" Bulger to collaborate with the agency in order to eliminate\nthe mob.In the process,it leads to Whitey to be able to use his\nconnections to evade the law consistently and become the one of the\nmost feared and ruthless mobster in Boston.He,too is able to provide\nprotection for his family.As the story progressed,we get to see\nConnolly and the his fellow members of the law get arrested for the\nillegal schemes they themselves got involved in and with Whitey\nsurprisingly getting arrested as an elderly in 2011.<br><br>The film looks really promising to be a great mob film.I was expecting\nit to become like The Departed.Unfortunately,it did not reach that\nlevel as it was basically more like a character study of Whitey and his\nability to manipulate the law enforcers.It lacked suspense and the\nemotional level was somewhat not as intense unlike other great mob\nmovies.\n"},
{"review": "\nEven though some might have argued otherwise back then (or maybe even\nknow, remembering that time), but I'm making more of a remark to the\nmovie Goodfellas. Or Godfather for that matter, movies you shouldn't\ncompare this movie too. It will always lose out in that compartment. If\nyou can watch this for what it is (based on a real person) and can\nimagine Johnny Depp in something different than Captain Jack (some\nargue that's all he does or is able to do right now, which I beg to\ndiffer), than you will able to enjoy this.<br><br>It's crime and that also has to be something you want to watch. It will\nget mean and it will get violent. We are supposed to learn about the\nperson that while helpful to his community in one way, was very\ndestructive in other ways too. Not the greatest story, but still a more\nthan decent one\n"},
{"review": "\n\"Black Mass\" wasn't as bad as some of the reviews I read said it would\nbe. It's a pretty decent crime film with a good story-line, some depth,\nand great acting. Now I'm not going to put it up there with the likes\nof \"Goodfellas\" and \"Casino\" but it was good. I wasn't disappointed,\nbut I will say this, if Martin Scorsese had put his magical touch to\nthis film it would have been better. Johnny Depp put on a nice\nperformance as James 'Whitey' Bulger, almost Oscar worthy, as with Joel\nEdgerton, who played the role of John Connolly. The only problem I had\nwith this film was Johnny Depp's make up. To me the attempt to make him\nlook like James 'Whitey' Bulger only ended up looking \"Bad Grampa\"ish.\nThat really didn't take away from the film but it must have been pretty\nobvious if my wife noticed it being that she doesn't take movies as\nserious as I do. \"Black Mass\" is a film about James 'Whitey' Bulger\n(Johnny Depp), a violent gangster who becomes an FBI informant in order\nto take down a Mafia family who is disrupting his criminal activities\nand at the same time involving John Connolly (Joel Edgerton), an FBI\nagent. I heard of James 'Whitey' Bulger from documentaries and stories\nafter he got caught. If he was anything like the character Johnny Depp\nportrayed in this film he should be locked up forever! I'm glad I\ndidn't read any of the reviews before watching this film because I\nwould have probably missed out on a good one.\n"},
{"review": "\nBased on the true story of Boston crime lord Whitey Bulger and his\nlongtime not-so-legitimate association with the FBI, 'Black Mass' tells\na notable slice of American history. The film is credited as a\nbiography on IMDb, which is not quite right; Johnny Depp is electric as\nBulger, but he is more of a supporting character in the tale with\nemphasis constantly on Joel Edgerton as his FBI contact - a childhood\nfriend who finds himself in a tricky position, torn between loyalty to\nthe Bureau and his a lifetime pal who has looked after him for as long\nas he can remember. It all seems fine at first, with Edgerton able to\noffer Depp immunity if he agrees to turn informant, however, as Depp\nmisuses his immunity to take down those around him and become even more\nruthless, Edgerton finds himself stuck in a corner. On one hand, all\nthe emphasis on Edgerton does not feel right. With limited room for\ncharacterisation, Depp's Bulger is defined in very broad brushstrokes;\nwe are led to believe that his anger over his son's death hardened him\nas a criminal, but we seldom see how he ticks beneath the tough\nsurface. On the other hand, Edgerton is so great wrestling with his\ninternal conflicts that more emphasis on him may have in fact been\nbetter. Either way, the film is quite uneven with all the jumping\nbetween characters, but solid acting keeps thing afloat. While Edgerton\nsteals the show, Depp has several excellent moments; his anger over a\n'family secret' recipe is a surefire highlight, and the scenes where he\nbonds with his son shed a lot of light on the way his mind works.\n"},
{"review": "\nI think some of the negative reviews comparing Black Mass to classics\nlike Goodfellas are being a little unfair.<br><br>Classics like The Godfather have already expertly dealt with the lure\nof power and how it ultimately corrupts, whilst Black Mass isn't in\nthat kind of league, it does offer a fresh perspective.<br><br>Depp's character is facilitated by FBI agents, who use him to take down\nother crime syndicates, whilst turning a blind eye to his dealings.\nThis idea that they created their own monster, believing that the end\njustifies the means, is an interesting theme, not really explored too\nmuch in this genre. Recently, The Departed touched on similar ground,\nwith Jack Nicholson's character actually being inspired by the\nreal-life Whitey Bulger, but Black Mass gives us the full story.<br><br>Depp gives a great performance as Whitey, all too often he's dismissed\nlately as a 'gimmicky' actor, but once again he proves he can deliver\nin a grown-up movie. Beneath the make-up he gives depth, and believable\nmenace.\n"},
{"review": "\nBlack Mess is a better title for this film.<br><br>This could have been so much better. As strange as this is going to\nsound, the biggest problem with the film is whoever was doing Johnny\nDepp's makeup was not consistent with it through out the film and\nbecause of that, I was taken out of the movie almost everything Depp\nwas on screen. And sometimes his makeup was so bad that it made what\nshould have been his most powerful scenes look ridiculous. And there\nwere problems with the story and etc, etc. it is a shame because the\nstory of which this movie is based on is pure gold. The acting is\nexcellent almost all around. In the end, I think the ultimate fault\nfalls on the director. Hollywood needs to stop risking the outcome of\nproperties by saving a few dollars using noobie directors who have less\nthan 5 films under their belts. Anyway, you would be better of watching\na documentary about Whitey than wasting 2 hours of your life on this\nmovie.\n"},
{"review": "\nJames 'Whitey' Bulger (Johnny Depp) is a small time Irish mobster in\nSouthie Boston. FBI agent John Connolly (Joel Edgerton), from the\nneighborhood, recruits Whitey to be an informant through his political\nbrother Billy Bulger (Benedict Cumberbatch). Connolly and his boss\nAgent Charles McGuire (Kevin Bacon) are trying to bring down the\nItalian mob in Boston. The loyalty of Connolly is in doubt as McGuire\ndemands more from Whitey who starts to become a powerful gangster.<br><br>Johnny Depp regains his acting cred. The story is told in a straight\nforward manner. It's a bit too straight. Connolly is the missing\nemotional drama element. Edgerton is fine but his character could have\nbeen even more epic. In many ways, his character is the mystery and the\npossible main character study. It's his character that changes\nthroughout the story. It's his character that provides a possible arc.\nThe reveal of his manufacturing of Whitey's information is a dramatic\nhighlight. The question of why is touched on but it could be a whole\nmovie by itself. Connolly would make for a superior main character.\nThat's not saying that the acting from both is anything but top rate.\n"},
{"review": "\nBoston, late-1970s. The FBI are looking to break the Mafia hold on the\nnorth of the city. Agent John Connolly (played by Joel Edgerton) is on\nthe case and is willing to go to any lengths to achieve his aims. A\nSouth Boston native, he decides to \"ally\" the FBI with South Boston\ncrime kingpin James \"Whitey\" Bulger (played by Johnny Depp), as his\nmain enemies are the Mafia. Approaching Bulger via his brother Billy\nBulger (Benedict Cumberbatch), a Massachusetts State Senator, Connolly\nis successful in gaining Bulger as an informant and ally against the\nMafia. However, this alliance only seems to embolden Bulger in his\nquest for power and wealth, as he is able to operate with impunity and\nutter ruthlessness. Not realising he is being duped, Connolly finds\nhimself backing Bulger, rather than law, order and justice.<br><br>An engrossing crime-drama, based on a true story. As far as gangster\ndramas go, it's hardly in the league of The Godfather or Goodfellas,\nbut it's entertaining and, besides, not much is in those movies'\nleague. <br><br>Superb performance by Johnny Depp in the lead role. His choices of\nmovies of late have been sub-par but this is a fine return to form.\nVery convincing as a ruthless crime lord, with his alternating between\nmob boss and doting father quite breathtaking.<br><br>Good work too from Joel Edgerton.\n"},
{"review": "\nmakes for some fine entertainment, Johnny Depp play gangster, Jimmy\nBulger. He is contacted by FBI agent, John Connolly, who grew up in the\nsame neighborhood and they have respect for each other. He wants Jimmy\nto give intel on the mob- less competition then. So he gives them the\naddress of the mob boss and from there he takes over the streets. Jimmy\nbecomes more powerful while Connolly keeps him safe from prosecution.\nOne rule-no murder. Of course, doesn't take long to break that. Soon,\nothers in the FBI realize they aren't getting intel from Jimmy and that\none of their own is in too deep. So bad cops have to go down.<br><br>FINAL VERDICT: Based on a true story, check it out.\n"},
{"review": "\nThe horrifying story build upon, and around the person of James\n\"Whitey\" Bulger and his rise to bring terror in the South Boston\nstreets. A well told story, evolving around the main subject Whitey\nBulger, in my opinion, opposite of many criticizer's, the movie unfolds\nbrilliantly without necessarily providing a sublime story or plot.\nInstead the movie is well produced to follow the outcomes of being\naround or against Whitey Bulger, and how his grab on the Boston streets\nexpands further. An outstanding movie, providing excellent acting well\ndeserving of more recognition. Especially Johnny Depp and Joel Edgerton\nput all of their talent on display.<br><br>A very underrated crime gem, highly Recommended.<br><br>Simon B. Nielsen\n"},
{"review": "\n***SPOILERS*** Overblown film, in trying to make him look somewhat\nlikable, about Boston Irish Mob boss James \"Whitey\" Bulger , Johnny\nDepp, with an in depth look of the man who's anything for the youth of\nAmerica to look up to. We see right from the start that \"Whitey\" is\nwilling to rat out his own kind, mobsters, to the FBI in order to be\nfree to do his dirty work without any interference from the law.\n\"Whitey\" has his brother big time state politician Billy, Bennie\nCumberbatch, stick his neck out for him that in the end destroyed his\nmeteoric political career.<br><br>As For \"Whitey\" himself he just goes through the movie doing his thing\nin breaking skulls shaking down business with his protection racket and\nmurdering his victims mostly doing it close and personal with the law\nnot for a moment laying a glove on him. At first it was the FBI's\nattempt to use \"Whitey\" to get information on his fellow gangsters that\nseemed like a good idea but later that's turned and bit \"Whitey\" on his\nbehind with his fellow mobsters, those that he was ratting on, ratted\non him to save their own hides.<br><br>It's when Kojack look alike FBI section chief Fred Wyshak, Corey Stoll,\ntook charge that things start going sour for \"Whitey\" and his boys or\nthose that were still willing to put up with him and his back stabbing\nas well as murderous antics; That included shipping arms, as a\npatriotic juster, to the IRA in its war against the British Empire's\noccupation of Northen Ireland. On the run for some 15 years \"Whitey\"\nfinally gave himself up to the FBI that for years covered for him. In\nthe end we see Whitey as an old and broken down man soon to serve two\nconsecutive life sentences for as many as 11 murders as well as the\nmany crimes that he committed through the years from murder\nracketeering down to public intoxication and shop lifting that dates\nback to the early 1940's.\n"},
{"review": "\nBlack Mass (2015)<br><br>Well, Johnny Depp is amazing\u0097almost unrecognizable in this role as a\npsychopathic Irish mobster. And the vivid realism of lat 1970s and\n1980s Boston is impressive\u0097really gorgeous and believable. These are\nthe strengths.<br><br>The story is, however, another mobster movie where one group is out to\nget another, and there are betrayals and revenge killings and beatings\nand a kind of unraveling of the underworld as it gets more and more\nextreme. Sometimes there's pathos or ironic beauty, but this is no\n\"Godfather\" nor \"Goodfellas.\" The characters blend together and so we\nnever quite identify with anyone. And Depp plays the main bad man and,\nunlike Marlon Brando (for example) he lacks anything even remotely\nhuman or admirable. <br><br>So the viewer is left cold, watching things happen at a distance. It's\nnot unemotional\u0097sometimes it's horrible and shocking\u0097but it's not about\nfeeling for the characters in their brutal, calculating desperate\nsituation. And there is a lot of violence of a very unflinching kind,\nharder to take than, say, Tarantino's where it's over the top and\ntheatrical. <br><br>I think this is a kind of good movie that just doesn't rise above. And\nthere are so many movies like this it makes it unnecessary. Good, yes,\nbut old territory.\n"},
{"review": "\nIf you need a lot of over the top action and explosions, this isn't the\nmovie for you. For anyone who truly appreciates quality cinema though,\ndon't listen to the negative reviews, it's well worth the watch. All\nthe acting is top notch, but Johnny Depp truly turns in an Oscar worthy\nperformance. It's worth the watch, if only to see Depp's amazing\ntransformation. This film leans more towards drama/biography, but gives\na great look at the rise and fall of Whitey Bulger. It might not be a\nmovie you'll want to watch over and over again all the time, but for\nanyone who loves drama and great acting, you'll definitely want to see\nthis movie.\n"},
{"review": "\nJohnny Depp's portrayal of Boston crime boss James \"Whitey\" Bulger must\nrank among the most repellent characters in recent Hollywood films.\nPerhaps the film's greatest achievement is to dramatize how Bulger\nescaped prosecution for blatant lawless, including racketeering and\nmultiple murders for years. Incredibly, he lived undetected for sixteen\nyears in an apartment in Santa Monica, California, prior to his arrest\nand conviction to two life terms in prison.<br><br>One of the themes of the film is the loyalty that existed among the\nIrish men from South Boston. Bulger had lifelong ties to his childhood\nfriend John Connolly, who became a career FBI agent and protected\nBulger for years as a presumed informant. The sleaziness of the FBI\nagent, the associates of Bulger, and Whitey Bulger himself are a great\naccomplishment of the filmmakers.<br><br>While much care went into the recreation of the period of the 1970s and\n'80s, the pacing of the film was slow and there were too many\nextraneous subplots and incidental events portrayed. The editing could\nhave been tighter to focus on Bulger. Except for the depiction of his\ndevotion to his mother and the tragic death of his young son, Bulger's\npersonal life was not fully developed. It was not clear, for example,\nwhy he would not be a pallbearer at his mother's funeral.<br><br>Despite its shortcomings, the film was a compelling portrayal of a life\nin crime and the shocking incompetence of the police and the FBI to\nallow Bulger to create mayhem and madness in Boston for so many years.\n"},
{"review": "\nThis movie was not that great of a movie. For a story that is supposed\nbe on one of the most dangerous gangsters in U.S. history, it lacked\nsuspense. The story went on at an incredibly slow pace. There was not\nanything happening that would keep interest for what was about to come.<br><br>It was weird to have two brothers on opposite sides of the law. Whitey\nBulger, played by Johny Depp, is the gangster. William Bulger, played\nby Benedict Cumberbatch, is a senator of Massachusetts.<br><br>It did not make sense that providing the FBI with valuable information\nto take down the mob is considered as business because it meant saving\nyour own life. But if someone else had spoken to the police or law\nofficials and gave up any information it was considered snitching, and\nit resulted in that snitch being murdered.\n"},
{"review": "\nLet's forget for a moment that this is a movie about real (and still\nliving, at least some of them) persons and concentrate on the \"movie\"\npart. This is one of the flick perfect for generally underestimated\nactors to show what they can do when given an opportunity. Depp is\nexcellent and everything else is on a high professional level. Story is\na bit depressive (and confusing at moments - apparently you cannot\nencompass such a complex man/story in so little given time), but I\nguess that's how it was, more or less. And it was a pleasant experience\nto see J. Depp in a such demanding role doing an excellent job (even\nwith blue contact lens). Not DiCaprio excellent, but close. Worth a\nwatch, but not many times.\n"},
{"review": "\n'The Departed' in every way in point of fact 'The Departed' was the hip\npost millenial version of 'Whitey Bulger.<br><br>Depp should have gotten an AA for his performance and I say that\nknowing full well his lack of recent skill - this is a great\nperformance as were all the attendant pieces esp. Julianne Nicholson\nand Joel Edgerton as the Connolly couple.<br><br>There was nothing sentimental per Bulger - a foul human being from the\nget go -a loser and one committed to infecting all with his twisted\npsychopathic homicidal mind set.<br><br>No cutsie sarcasm or 'insert the racist, ethnic or fag joke here' as\nScorcese is want to do - rather a gritty dusty wind blown accounting by\nformer associates and flunkies that did Whitey's bidding.<br><br>A great film and Depp should be proud of his performance.<br><br>The Departed had the hip: crew, music, director, sarcastic ridden\nscript all of it. As time wears on that very Scorcese trait will sink\nit below 'Black Mass'.\n"},
{"review": "\nI wasn't sure at first about the choice of Johnny Depp to play the\ninfamous Boston mob kingpin \"Whitey\" Bulger, as it seems of late his\ncinematic output has been at best , uneven, and at worst, abysmal.\nUnder Scott Cooper's direction, though, Depp turns in a performance\nthat is truly astonishing. Depp manages to convey both unbridled mob\nviolence with scenes of domestic tenderness, often within mere seconds\nof one another. He is ably supported by the fantastically cast Joel\nEdgerton as the not-so-upright FBI agent who nails a perfect Bostonian\naccent in addition to the nuances of his conflicted relationship with\nBulger. In fact, all the supporting roles are faultlessly cast.\nBenedict Cumberbatch-who seems destined to become the all-time winner\nof the Cinematic Workaholic Award at the rate he's racking up roles-is\nexquisite as Bulger's social climbing yet loyal brother, and Kevin\nBacon and Peter Sarsgaard both give their brief appearances wonderful\ntexture and depth. My one negative is the failure to really flesh out\nthe female characters, with the exception being that of a young hooker\nwho has one of 2015's great dramatic scenes. I love love love that\nparticular scene both for the heartbreaking emotion and self-assured\ncamera work. Hopefully this is the start of more good work to come from\nboth Depp and Scott Cooper.\n"},
{"review": "\nExpected more, as it was a bio-pic of the criminal lord Whitey Bulger,\nand more over Johnny Depp was doing it, coming to the movie, it was\nstraight-forward dive into the kingpin's life, when it comes to the\ndirection scott Cooper does a decent job in handling only a piece, of\nunveiling friendship b/w bulger and his alliance John Connolly. Depp\nwas controlled, measured and sweeping against all odds. But the main\nsad thing was,it was not more than an alliance between two southies in\nboston, it delivers a vile piece of criminal story with gloomy\nperformances from the solid-rock actors. Rather than a film, it was\nbetter to watch a documentary on Bulger to get more close to the true\nevents.\n"},
{"review": "\nWhitey Bulger is one of the most notorious American criminals in\nhistory. His story is meant to be recorded on the big screen in order\nto document the overwhelming power and influence he had on the Boston\nmafia and on America. Sadly, \"Black Mass\" fails to do so. Even though\nJohnny Depp gives a cool and menacing portrayal of Bulger, the writing\nand directing is misplaced, focusing more on the cops than the\ncriminals. If more focus was taken away from the FBi who negotiated and\nbribed the Boston gangster and was directed towards the man himself,\nthen you'd have a story. Instead you get cop cliché's and the same\nbroken record of a story played out that leads just as expected.\nBulger's story is unique and dark, great material for a film. It's a\nshame that opportunity was missed.\n"},
{"review": "\n'Bulger's playing us, making a fool of the Bureau. We're in too deep,\nand he knows it! God help us all.'<br><br>Director Scott Cooper brings us via screenwriters Mark Mallouk and Jez\nButterworth the true story of Whitey Bulger, the brother of a state\nsenator and the most infamous violent criminal in the history of South\nBoston, who became an FBI informant to take down a Mafia family\ninvading his turf. It sounds impossible but the tale is true and the\ndirector makes sure every detail of every person involved is summarized\nat film's end. If Mafia type crime films are your cup of tea BLACK MASS\nwill certainly satisfy. For most, despite a huge case of outstanding\nactors, the story is so fragmented that it seems an ongoing bloodbath\nand once again we are privy to the corruption within the law\nenforcement system \u0096 especially in Boston. <br><br>The synopsis pulls it together rather well: 'Based on a true story of\nJames \"Whitey\" Bulger (Johnny Depp), an Irish Mob godfather and FBI\ninformant who had a \"secret trading\" deal with his brother, William\n\"Billy\" Bulger (Benedict Cumberland), a state senator and a Boston\npublic figure, and John Connolly (Joel Edgerton), an FBI agent. They\nplanned to take down the Italian mob and mafia in Boston, which went\nawry and things turned massively violent. When the credence for each\nother began fading out, drug dealing, murders, and extortion started to\nrise, and forced the FBI's Boston office to confirm that Whitey Bulger\nwas one of the most notorious criminals in US history and also one of\nthe FBI's Ten Most Wanted List criminals.'<br><br>Take a look at the cast \u0096 Peter Sarsgaard, Kevin Bacon, Dakota Johnson,\nJuno Temple, and an array of bit part players each with viable varying\naccents of Boston areas \u0096 and you can see how this violent evening\nwould work. History here \u0096 and it still is going on.\n"},
{"review": "\nThis film tells the story of a mafia boss in Boston, who has a special\npartnership with the FBI to take his competitors out of Boston.<br><br>I find \"Black Mass\" initially quite confusing, as there are so many\ncharacters to deal with. After I get the story, it is captivating\nbecause of the moral decisions of the characters in the story. It is\ncaptivating to see Jimmy Bulger getting increasing distrusting, killing\neveryone who he suspects might be in his way. The fact that John\nConnolly blurring what is right and wrong, and forgetting where his\nloyalty lies is also very captivating. I find the film rather violent,\nand it made me jump quite a few times. I did enjoy watching it though.\n"},
{"review": "\nThere are a lot of great performances here but overall this movie is\njust so thoroughly mediocre that it's hard to justify watching it. <br><br>Deppis great. Bacon is great. Really everyone is, but it's just not\nthat enjoyable to watch. <br><br>Sort've feels like if you took Goddfellas and took all the fun and\nstyle out of it. Not sure if that's a Boston thing, or a director\nthing, or a side effect of how movies are made today versus the way\nthey were in the 90's, but overall, this felt a lot like a trip to the\ngrocery store.<br><br>I think this movie had so much going for it but really didn't build any\nmomentum at all. seemed more like a docu drama on TV?<br><br>performances were all great and on point. locations were good too, but\nyeah, for some reason this just didn't pull it together.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"Black Mass\" (2015) is a very true story about a local mobster in\nBoston, who by the help of FBI ruled the streets for some time. This is\na very good movie, absolving one, with great acting by all involved,\nvery solid directing, engaging script that never isn't boring, and is\ninvolving from start till finish. That said \"Black Mass\" isn't\n\"Goodfellas\" by any means, because you can re watch \"Goodfellas\" again\nand again, and \"Black Mass\" is basically a one time movie, but\nnevertheless it is a very solid one. <br><br>The best acting in this movie was not Johnny Depp's (altough he is VERY\ngood in here, haven't enjoyed Johnny Depp's movie in very, very long\nwhile now), but from superb and always reliable Joel Edgerton. He\ncreates or recreates in this case this FBI guy, who is as much as a\ngood guy trying to do good, but at the same time he is more then an\nfriend to James 'Whitey' Bulger - and that isn't a really good thing\nconsidering the circumstances, but he was as he was. This is a very\nsolid performance. And about Johnny Depp - in the beginning of this\nmovie noticing his eye lenses and make up - it was a bit to heavy in my\nopinion even distracting, but it grown on me during the movie, it is a\nvery solid performance.<br><br>Overall, Scott Cooper, a great director (of a brilliant \"Out of the\nFurnace\") does a very solid job in recreating true events. I liked this\nmovie very much, it not a classic by any means, but just a very solid\nfilm. I also liked that this movie never tried to show any glimpses of\nWhitey's redemption or anything like that - he was a bad guy at the\nbeginning, middle and the end - he is just a bad guy. All in all this\nis a very solid movie for one viewing.\n"},
{"review": "\nI do respect the skills of ac-tor Johnny Depp, I really do. Sadly\nthough, he was so badly wrong for this part. You only have to re- watch\nAl Pacino as Scarface to see how badly this match-up pales in\ncomparison. Like Tom Cruise lacked the height to do Jack Reacher\njustice, Depp lacks the credibility X-factor of menace in this role- a\nproblem that I felt was exacerbated by the fact make-up had him looking\nlike Michael J Fox playing his older plasticine-faced self in Back to\nthe Future II with the drawn on liver spots and contrived hair fail.\nThe behind the scenes team of Bad Grandpa should have been consulted on\nthissun!<br><br>The plot and the characters substantially lacked in depth, which risks\nleaving the viewer dangerously apathetic as to how things unfold in\neither respect.<br><br>It's entertaining enough not to make you walk out early, and the cast\nis good...<br><br>It's just.<br><br>Nearly.\n"},
{"review": "\nBlack Mass could have been great. Like American Hustle, it's great true\ncrime material. South Boston Irish mob, psychopath ultra violent\ngangster, brother of a senator, gang war with the Italian mob,\nambitious and corrupt FBI agents. However, unlike American Hustle the\nscreenplay just plays out like a loose documentary, with no real sense\nof drama or emotional character development. I kept thinking this\nshould be great like American Hustle, but instead of getting sucked\ninto it's world and caring about the characters like in American\nHustle, I just felt like I was watching a docudrama. There were many\nopportunities to develop deep empathy and emotional ties to John\nConley, Billy Bulger, and Steve Flemmi. But the writers or film makers\njust provide a superficial glimpse into their internal conflicts and\nflaws, and never develop them enough to build a relationship with the\naudience. The writers also never explore any kind of background on what\nmade Whitey Bulger, Whitey Bulger. He's just a mean criminal thug, and\nthat's it. And it's not for lack of circumstance. South Bronx, brother\nof a senator, friend of an FBI agent... This could have been so good.\nJohnny Depp and the make up artists on the other hand deserve Oscar\nnods or statues. I'd forgotten how good of an actor Johnny Depp was\nwhen he's not playing a feminized drunken pirate in every movie even\nwhen it's not Pirates of the Caribbean. I forgot this was Johnny Depp\nso many times, and just some unlikable middle aged Irish thug. Depp's\nacting and the makeup artists were amazing. Completely believable. But\nnot enough to make this more than an interesting documentary. Oh well.\nEntertaining enough for streaming, but not for $11 tickets or blu-ray\npurchase.\n"},
{"review": "\nYes, Johnny Depp steals show, but the show is so very lame. Bunch of\nmafia clichés, hollow characters, no genre expected suspense. The movie\nwants to build idea of mafia friendship, followed by betrayals (this is\nshown on start already). But relationships among main characters aren't\nwell defined, there are no connecting stories to make bonds believable.\nI like most actors so i was not prejudiced. I read somewhere Joel\nEdgerton was good in Black mass. Perhpas that is true, but John\nConnoly's dialogs were so childish, his actions that should be sneaky,\nscheming and cunning were simply transparent and unbelievable. No, i\ndid not buy the story for a minute. Which is strange since the story is\ntrue. The good part, which isolated could be given high scores: Jimmy\nWhitey Bulger Johnny Depp looks scary indeed. The empty bright eyes\ncould fit the horror flick. Strong occasional resemblance with\nChristopher Walken made me think Johnny studied him for this part. He\ndid good job, but director could benefit from mafia classic recipe with\nJoe Pesci being the funny little guy made scary as hell by the story.\n"},
{"review": "\nThis movie was more about style than substance and even the style was\nlacking.<br><br>The substance issue comes from the fact that the story was not even\nclose to being fully told. If I think about a similar type movie like\nGoodfellas I can only say that this movie pales in comparison.<br><br>It just left too much out and instead concentrated on just a few\nintense moments of the main character's life. That doesn't work. For\ninstance, we didn't get any view into Bulger's personal life during all\nof these events. The FBI agent Connolly was covered a bit but not\nBulger. Think of Henry Hill in Goodfellas and how we got a pretty\ndecent view from start to finish.<br><br>Perhaps I'm expecting too much as I'm sure it wasn't meant to be a\nbiography but it's a fascinating true story that needed more coverage.\nIt was like eating a bland plate of food and still feeling hungry\nafterwards.<br><br>The neighborhood shots and overall feel of the movie for that time\nperiod was done well so I'll give it that. The negatives were a plenty\nthough, in addition to the swiss cheese story. The accents were awful,\nespecially Cumberbatch. Casting an English actor to play an Irish\nSouthie was just wrong on so many levels. The makeup was also quite off\nfor a few of the characters like for Depp and the Jesse Plemons\ncharacter.<br><br>There was quite a bit of buzz and critical acclaim for this movie and I\nhave to think that it was mostly due to the cast. It is indeed an\namazing cast but at the end of the day the movie doesn't tell the story\nso it doesn't matter who's in the cast.\n"},
{"review": "\nJohnny Depp will forever be one of my favorite actors. I have always\nbeen blown away with how he can completely disappear into characters,\nbringing to life some of the most eccentric, vibrant characters that\ncinema has seen in quite some time. However, a recent string of\ndisheartening duds left me doubting Depp's acting prowess as he\ncontinues aging (I mean, Mortdecai? Seriously?) However, Depp's turn as\nthe murderous Whitey Bulger might possibly be the finest performance of\nhis illustrious career. I forgot that I was watching Johnny Depp once\nthe movie got going, instead focusing on Whitey Bulger himself menacing\nfrom the other side of the screen. The best performances are ones that\nhelp you see characters, not actors in makeup or wigs. However, the\nproblem with Black Mass as a whole was that aside from Depp's wonderful\nportrayal of Bulger, there wasn't much here to entertain. The other\nperformances were either unremarkable (Edgerton, Johnson) or too brief\nto be of any consequence in judging the film (Scott, Harbour, Stoll,\nBacon). The story was solid, but at the end of the day, it's simply\nsomething that we've seen countless times before. Thus, I recommend at\nleast one watch to see the best performance that Johnny Depp has ever\ngraced us with. The rest you can judge for yourself.\n"},
{"review": "\nI've only ever seen Johnny Depp in two roles where I believed he was\nbrilliant. And this is one of them, the other being Captain Jack\nSparrow from the first pirates movie. Being in a lot of Tim Burton\nflicks and occasionally popping up in other things now and then it\nseemed like Depp needed to find a new voice and I believe he found it\nhere. To be fair I haven't seen many recent films of his but this one\ntruly stands out from the ones I have seen. This is his best film in\nlong while and I wont be surprised if he is nominated for the academy\naward for it. He gave atmosphere in every scene he was in and gave a\nless is more performance which worked really well. There are a couple\nof scenes in particular where it felt like he truly knew who he was\nplaying. He definitely is the reason to see this film <br><br>As for the rest of the film, it is pretty decent but not great.\nEveryone plays their parts well such as Benedict Cumberbatch as Billy\nBulger and Joel Edgerton as John Connolly. No one seems Miscast for the\nfilm. Apart from the performances I cant really think of much more\nreason to watch the movie. The biggest problem this movie has is that\nthe story (being of true events) seems to be more a template for a\ncharacter study of James whitey Bulger (Depp). Everything seems brushed\nover which doesn't give a movie like this justice, especially since\nthis is a movie based on a true story. <br><br>The violence is shown in a very gritty and realistic way, and gives it\nmore of a stylised look rather than the other exploitive representation\nin a lot of gangster movies. The film was shot really nice and a few of\nthe scenes were really nicely composed, it all looked smooth and I saw\nno issues. The biggest problem is the story as it isn't very\ninformative and really focuses mainly on the main character. If you\nwant to see a character study of a dangerous criminal, then you may\nenjoy this. Its no Goodfellas but its not a terrible gangster film.\n"},
{"review": "\nBlack Mass<br><br>The Irish make the worst bootleggers because they drink all the\nmoonshine before it can be sold.<br><br>Thankfully, the felons in this drama are more partial to racketeering.<br><br>As a means of eliminating his Italian adversaries, south Boston mob\nboss James \"Whitey\" Bulger (Johnny Depp) becomes an FBI informant for\nhis office-bearing brother's (Benedict Cumberbatch) childhood friend\nJohn Connolly (Joel Edgerton).<br><br>With his newfound federal protection Whitney strengthens his\nstranglehold on the city. But a pertinacious prosecutor, Fred Wyshak\n(Corey Stoll), refuses to let him get away with this, or ignore\nConnolly's obvious corruption.<br><br>While Depp turns in an intimidating - and potentially award-winning -\nperformance as the mad dog assassin, his true to life exploits don't\ncome off as intense or as grandiose as the filmmakers would have you\nbelieve.<br><br>Incidentally, the best way to kill your Sicilian rivals is to hold a\nGodfather screening then firebomb the theater. <br><br>Yellow Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nThis, we're told, is the true story of James 'Whitey' Bulger (Johnny\nDepp with a dubious hairline), an Irish American crime lord who 'ran'\nSouth Boston with savage ruthlessness in the 1970s and 80s but turned\ninformer to help the FBI clear out Cosa Nostra rivals who were\nthreatening his 'turf' in protection, gambling, drugs, all the usual\nrackets. So far, so familiar. The unusual element to this story is that\nBulger's brother Billy was a rising figure in the Massachusetts state\nsenate. One of the movie's great flaws is that it never makes clear why\nJames's criminal activities, which regularly made the newspapers, had\nno apparent impact on the senator's career for more than twenty years.<br><br>The movie's other great flaw is the \"so far, so familiar\" element.\nStories like this have been told before, with repeated scenes of\nviolence and fusillades of f-words, in GOODFELLAS and with a lot less\nprofanity and a lot more style in the GODFATHER trilogy. We see James\nordering and even carrying out brutal killings, but despite the weird\nhair and weirder expressions Depp's performance has a slightly\npantomime air about it: you don't feel the incarnate evil of Ben\nKingsley in SEXY BEAST or Sean Penn in DEAD MAN WALKING. Cumberbatch\nhas a good stab at Bobby Kennedy Boston, but does not look comfortable\nin the role. Joel Egerton is probably the best thing in it as the star\nFBI agent who finds that dancing with the devil puts his soul in peril.\nA gripping movie, even enthralling, but short on originality.\n"},
{"review": "\nBlack Mass is supposed to be Johnny Depp's return to form. After the\ndismal Mortdecai earlier in the year, Depp has got some making up to\ndo. His take on the notorious Boston gangster James 'Whitey' Bolger is\none heck of a performance, one that's expected of his caliber. His\ntransformation far exceeds the act. His piercing blue eyes is enough to\nmake anyone flinch.<br><br>This movie follows the chunk of Bolger's life accredited to his\nrelationship with the FBI, chiefly agent John Connolly (Joel Edgerton),\nwho he knew growing up. They strike a deal; the Bureau will leave\nWhitey alone if he gives up the location of rival gangsters. This gives\nhim free will to do whatever he likes, whenever he likes.<br><br>Black Mass has an open narrative. A select few of Whitey's men tell\nstories of their time they spent with Bolger. Just as much focus goes\non Edgerton as it does Depp, which greatly hinders the man we want to\nknow more about. <br><br>What we do see though, looks fantastic. The low-key lighting and the\ndark, gloomy exteriors fit Bolger's ever cloudy mood. This is a\ngangster films that broods and will be remembered for its main\nperformer.\n"},
{"review": "\nI've seen some strangely negative reviews on here which are completely\nbaffling to me. I found Black Mass absorbing, not least by it's\nrelentless violence, brilliantly filmed. But it's not the gripping\naction scenes that hold this together, but the all round superb acting.\nJohnny Depp is menacing and intimidating as James 'Whitey' Bulger who\nended up one of the FBI's 10 'most wanted'. This is maybe Depp's best\nperformance to date in my opinion but I want also to mention Joel\nEgerton in particular, as a corrupt FBI agent. I haven't really noticed\nhim before, although his name has appeared in a couple of movies I've\nseen, but here he gives possibly an award winning support performance.\nHave to wait and see. Surprisingly too, British actor, Benedict\nCumberbatch is very convincing as an American senator and Depp's\nyounger brother, who ignores his sibling's criminal ways. Dakota\nJohnson as Depp's wife and Juno Temple for the ladies, both stand out\nfor me in small support parts. Even Kevin Bacon sneaks in as Egerton's\nFBI boss. Scott Cooper the director has drawn wonderful performances\nall round. Maybe he's an actor's director because I've just noticed he\ndirected Jeff Bridges to an Oscar win for Crazy Heart and this is only\nhis third director's movie. The other thing I want to mention is that I\ncould hear every word of dialogue and that is a real luxury in today's\nmovie market. In so many films today, I have to resort to the internet\nto find out what I've just watched as I can't understand half of what\nthe actors are mumbling. Not so with Black Mass, it's completely\ncoherent. This is and actor's film of the highest calibre and yes, I\nhave seen The Godfather, Goodfellas and The Departed that other people\nkeep comparing it unfavourably to, but then it's not really like those\npictures.\n"},
{"review": "\nMobster James \"Whitey\" Bulger\" is pressed into service by childhood\nfriend and FBI man John Connolly to be an FBI-sponsored informant in\norder to shut down the Boston mafia. Having done so, Bulger then uses\nhis immunity to build his own criminal empire up.<br><br>This true crime drama features impressive performances from Johnny Depp\nas Bulger, Joel Edgerton as Connolly, Benedict Cumberbatch as Bulger's\nsenator brother Mickey and, in fact, pretty much everyone in a fairly\nstarry cast. It is grim, gritty, and very violent and, yet, not without\nsome moments of genuine emotion. Depp's Bulger is a monster, yet there\nare times when we feel real sympathy for him.<br><br>Unfortunately, Black Mass (why is it called Black Mass? This is never\nmade clear during the film) wants to be Goodfellas, but it isn't.\nDespite the great performances, it suffers from an air of\ninconsequential rambling \u0096 there is little sense of urgency and, quite\nfrankly, I got bored. Had it been 45 minutes shorter its events would\nhave held my attention a lot better (there were a lot of shots of Rory\nCochrane looking moody and troubled, all of which could have been\ntrimmed to half their length, for instance).<br><br>There seems to be a consensus that it is good to see Depp doing decent\ndramatic work after so long hiding behind funny teeth, hair and\ncostumes, and I can understand this. It's just a shame it's not in a\nbetter film.\n"},
{"review": "\nBlack Mass is a crime drama starring Johnny Depp, Joel Edgerton,\nBenedict Cumberbatch, and Kevin Bacon. And its a true story about\nWhitey Bulger, he is a violent criminal that becomes a FBI informant to\ntake down a mafia family invading his own empire. Johnny Depp is\namazing in his role, he truly become his character with the make- up\nand performance. He is a really disgusting man and it proves that he is\na leach-like human. Joel Edgerton is also great and he is really\nshowing that he can act really well. Basically all performances are\nvery good. But in its story, there is a hollowness in the script as all\nof them are bad persons and you really cannot find a good person and\nroot for them. Also there are some pacing issues that derail the main\nplot. Other than that I really enjoyed Black Mass easily proving Johnny\nDepp can actually win an Oscar. 8/10\n"},
{"review": "\nHaving recently watched the excellent film Legend I was a bit unsure\nwhat to expect from this film. By looking at the trailer I was not sure\nif I would like this film at all. However the performance of Johnny\nDepp put my worries completely to shame. The same goes for the other\nactors as well, a quite impressive performance from all.<br><br>I kept reminding me that this movie is based on a true story. When you\nkeep that in mind Depp's performance is chilling at times, but to my\nsurprise he is also able to portray a character that is both pure evil\nand surprisingly caring all in one nice package.<br><br>What made me like this film is that I did not notice any fancy CGI\neffects, the film felt natural and believable and not over the top.\nWhen watching the end credits I needed to remind myself that the main\ncharacter here is actually the same man who portrays the innocent\nEdward Scissorhands. A unforgettable performance, a interesting story\nand a good pace throughout the movie. Well worth the enjoyment!\n"},
{"review": "\nThe real story should have provided a great script yet it's at times\nterribly violent but overall simply dull. I'm giving it 5 stars solely\nfor the great performances by Jesse Plemons (who looks nothing like\nFNL's Landry and it took me a while to realise where I've seen that\nface before!) and Johnny Depp, whose artificial blue lenses are so\nobviously fake it's a testament to his enormous talent that I found his\ncharacter at all convincing. Just you know, maybe blind, since his eyes\nare made of glass. The brutality is sparse but gut-wrenching and yet it\nfails to add anything to the plot or characters. There is nothing\nredeeming about any of the villains, and the good guys are even duller\nthan the bad ones (Kevin Bacon has very little charisma as the cliché\nshouting boss, and Adam Scott doesn't even get to utter a line for the\nmost part of the film, just sits pointlessly in the background) Overall\nit feels like a massive waste of actors' talent, potentially great plot\nand viewers' time and money. Avoid!\n"},
{"review": "\nBlack Mass (2015) Johnny Depp performs wonderfully in this \"based on\ntrue events\" film. Now I'm not a huge fan of films on content such as\nthis but the story flowed very nicely and kept my attention very well.\nIn the beginning I didn't even realize that it was Mr. Depp at all,\ngreat makeup work. This film had a very strong documentary based feel\nto it though still the vibe of living in the shoes of each character as\nthe story progressed. The acting from all actors and actresses within\nthe movie were totally on point and presented their characters very\nwell. This wasn't a film in which I'd thought it'd be as the given film\ndescription and trailer just didn't catch my interest at all.<br><br>If you're a fan of the mobster movies with some sort of \"based on real\nevents\" hook to it, this one is just right for you.\n"},
{"review": "\nI had high expectations for this film but it turned out to be a little\ndisappointing. Despite the big names in it it is not anything\nspectacular.<br><br>The pace is a bit slow and at some moments it is boring. Some of the\ncharacters seem undeveloped enough with the exception of the main ones.\nNeedless to say, all actors are very talented but none of them gives a\nmemorable performance that really stands out and can survive the test\nof time. The film fails to establish a connection between characters\nand the viewer and it's not easy to feel the emotions that they go\nthrough.<br><br>The film tries a bit hard to be at the level of other films of the same\ngenre. It manages to capture the feel of the time during which it takes\nplace but it is easily forgettable.\n"},
{"review": "\nJohnny Depp's performance is so great! So is his makeup. And what else\nwould be a good reason to recommend this movie?<br><br>The Story is really not that wonderful. And also the character is not\noutstanding, special enough for people to remember.<br><br>It is based on history in Boston. So that might be a reason for me to\ngo to theater to watch it.<br><br>Good but old, classic mob and gangster movies would be: Godfather\n(1972, 1974, 1990) Goodfellas (1990) Pulp Fiction (1994).<br><br>Besides this, we cannot really see there's some good gangster movies\nrecently. How is it coming?\n"},
{"review": "\nWhen this movie came out in September (I'm writing this months later,\nin Nov.), it never occurred to me to pen a review. If you haven't seen\nthis movie, catch it wherever it is showing. This is a very, very good\ncrime movie. It's extremely brutal but it's due to how horrible a\nperson James \"Whitey\" Bulger was (or still is) and why he was on the\nFBI most-wanted list for so many years. I can't say enough about Depp\nwithout mentioning his co-stars, as Joel Edgerton shines as the\ncorrupted FBI agent Connolly as do everyone else in their respective\nroles. Depp, however, disappears not only because of excellent make up\nbut some really kick-ass acting that makes one remember why Johnny Depp\nis so highly acclaimed. He goes from a nice guy to cold-blooded killer\nin mere seconds. Based upon the book Black Mass, from what I remember,\nthe film does a good job with what it takes from the book. I would have\nliked to have seen what ended up on the cutting room floor (a scene\nwith one of Whitey's girl friends for one) because that might have\nwarranted a 10 instead of a 9 from me.\n"},
{"review": "\nA crime thriller/drama based on true events starring Johnny Depp as the\nmain character James 'Whitey' Bulger. The rise and fall of the famed\ngangster \u0096 a theme that has been dealt with over and over in Hollywood.\nWhile I have seen my fair share of gangster movies, Depp being cast as\nthe lead role is what drew me to the theater.<br><br>Johnny Depp shines as Bulger, showing finesse in handling a character\nthat is split into two equal halves \u0096 one that is unpredictable with\nhis retribution and the other that is a doting father and loving\nhusband. It is this very contrast that lends his character a sense of\ncredibility and helps the audience relate to him, despite him being\nsomeone that would typically be considered as \"bad\" or \"evil\" on the\nmoral scale.<br><br>Continue reading the review at my blog below:\nhttps://microreels.wordpress.com/2015/11/09/black-mass-film-review/\n"},
{"review": "\nGreat movie overall. Johnny Depp gives a great performance as Whitey\nBulger. The rest of the cast hits the nail on the head as well. Be\nforewarned that the music in this movie is so ridiculously loud you\nwill have a hard time hearing the dialogue between the characters. This\nmovie would have received a 10/10 except the music brought it down 1\nstars. The other star loss was due to Joel Edgerton's terrible Boston\naccent. He really needs to work on it. It was not convincing in the\nleast bit. Other than his accent, he played a great part. This movie\nwill pass two hours by pretty easily. I don't think it's ever going to\nwin any academy awards for best picture. Not with the type of editing\nit received. The music really annoyed the group of friends that I\nviewed this movie with.\n"},
{"review": "\nThe True Story of an alliance Between the FBI and the Boston Irish Mob.<br><br>Director Scott Cooper offers an intermittently ultra violent, well\nacted and staged film, the Black Mass is strong gangster film with a\nlarge scope. While not reaching the heights of the Godfather parts,\nGoodfellas or Once Upon a time in America, it's certainly up there if\nnot surpasses the comparable Donnie Brasco and Casino.<br><br>There's a strong supporting cast of actors, lead Johnny Depp is steely\nand downright intimidating as \"Whitey\" Bulger. His brother Bill, a\npolitician is played by Benedict Cumberbatch and (even though top\nbilled) has limited screen time. Joel Edgerton is FBI agent John\nConnolly and steals the show. Notable is Kevin Bacon.<br><br>Depp is fantastic right down to his shoddy teeth, the aged makeup as it\nflips between time periods, not just on Depp, but the other cast\nmembers is terrific. The set design, locations and music captures the\nperiod back drop flawlessly.<br><br>While some of the accents may not be perfect, Cooper and writers Jez\nButterworth Mark Mallouk based on the book by Dick Lehr and Gerard\nO'Neill offer a deeply engrossing shocking gangster tale.\n"},
{"review": "\nThe title of Scott Cooper's effective, violent and atmospheric crime\ndrama Black Mass has several meanings. The first is a reference to the\nIrish-Catholic values of the film's real life subject, the gangster\nJames 'Whitey' Bulger, whose violent actions in South Boston from the\n1970s to the 1990s were a terrifying contradiction of his religious\nupbringing. The second meaning is a scientific and philosophical\nviewpoint, reflecting how matter or mass can never entirely disappear\nbut becomes invisible to the human eye. Invisibility was imperative for\nWhitey because according to the film, his attitude was that if no one\nwitnessed a crime, particularly a murder, it never happened. The\nmerciless brutality of Whitey is embodied by Johnny Depp, whose wicked\nperformance and hideous transformation ignites a desperate victory for\nthis once inventive character actor. He is matched by a colourful turn\nfrom Australian actor Joel Edgerton, who plays self-interested FBI\nagent John Connolly, a childhood friend of Whitey. Connolly represents\nanother form of darkness. Money and status encourage him to sweep away\nthe devil's crimes, meaning Black Mass is a film that draws from the\nOld Testament, warning us about how people of power and status succumb\nto life's temptations. The two lead actors and the complexity of their\ninvolvement to each other carried my interest almost entirely\nthroughout an untidy but compelling and gruesome crime opera.\n"},
{"review": "\nI'll have to admit it was a little slow but I do have to say it was\npretty good. I thought Jonny depp did a tremendous job and so did joul\negderton. I thought all of the acting was great but there were time\nwhere I thought that there were to many F words, but what did you\nexpect there gangsters who don't what they say, how they say it l, and\nwho they say it to because they don't care. It wasn't as brutal as I\nthought it was but still bloody. All the reviews I've read about this\nfilm were just horrible and I don't get it. It wasn't that bad of a\nfilm I mean it's a gangster movie most of them are slow. I came into\nthe theater knowing that it might be slow. Look all I can say is is\nthat this is a good film and it talks about a cruel violent man who\ndidn't care about other people other then the people he associates\nwith.\n"},
{"review": "\nThis is my second review on Black Mass. After having seen the German\nversion and leaving the theatre rather disappointed and empty, I\nthought I give it another try. And watched the OV in the cinema. So the\nwhole crime story of an unholy alliance between FBI and mobster Bulger\nagain in Boston American English. I must admit, despite much, maybe too\nmuch cursing and blood splatter, the film grew on me. Depp's\nperformance as Bulger definitely works for me (despite the original\nBulger not being amused about his portrayal). Maybe the whole thing\nworks best when not related too much to some \"true story\". True stories\nand Hollywood - let's face the facts, it's an oxymoron... Taken as a\nmere gangster movie, it works. I didn't learn very much about Bulger's\ncharacter or his motivation. The movie is still a collection of\nmurders, crimes and curses. But the somewhat creepy alliance between\nJames \"Whitey\" Bulger and his boyhood friend John Connolly evolves\nslowly and subtly from a \"friendly\" cooperation into a misunderstood\nloyalty and disaster for everyone involved. Loyalty is the glue and the\nbomb. But while Connolly insists on his loyalty to Bulger, Bulger stays\nrather loyal to himself... His criminal energy is always present,\nperfectly embodied by Johnny Depp. The whole cast is brilliant, may it\nbe main characters or supporting actors. Watching the film a second\ntime gave me a better overview and understanding. And more thrills,\ndespite the movie going at a rather slow pace, and still somehow\nmissing a plot. Yes, it's different than the usual Hollywood\nBam-Boom-Bang, smart characters, explosions and car chases. But once I\ngot used to the rather narrative, documentary and distant style, I was\nat times sucked into the film. Maybe I should watch it a third time...\n"}
]