[
{"review": "\nI will just start with some quotes from other reviewers that describes\nit the best.<br><br>\"This is easily one of the most overrated films of the year and\nprobably the worst film Tarantino has ever done.\" \"The ONLY good thing\nin this movie was the performance of Mr. Waltz\".<br><br>\"So I was really disappointed, and seeing this movie on place #40 of\nthe greatest movies of all time is the only thing about this, that\nleaves me with my mouth opened\" Now for more details go and read \"Hated\nit\" reviews.<br><br>One thing I hate about a movie is when it treats audience as bunch of\ndumb people. (Spoiler ahead). Now I know Tarantino's style is based on\nfantasy and fictitious plots, but come on, Adolf Hitler and 200 top\nNazis Officers will be in attendance of a movie premier in occupied\nFrance and you have only two guards in the whole theater and the\nsurroundings? Where also an American-African walks around freely with\nsteel pipes locking doors and setting fire. These 2 guards are then\nexecuted in seconds opening the door for our 2 \"heroes\" to slay Hitler\nat point blank with around 100 rounds... very dumb. At least, challenge\nour intelligence and create a smarter plot to kill one of the most\nfeared tyrants of all time (Go watch Valkyrie). Besides, Mike Myers\nimpersonation of a British general is more realistic and authentic than\nthe guy doing Hitler, just picture that.<br><br>What ruined it further, is that the only smart and powerful character,\nwhich nailed everyone in the movie, with his psychological and mind\nbending interrogations, ends up to be effortlessly tricked by the most\nmindless character in the movie.<br><br>After watching the movie, I was sympathizing with Nazis, who were\nportrayed to have more bravery and humanity than our Basterds!!!\nImagine that.<br><br>My recommendations, if you have insomnia, 2hrs 33 min to waste or you\nwant to give your mind a break, go watch this movie.\n"},
{"review": "\nThis is one of the worst movies I have ever seen.<br><br>What is the purpose of this movie? A bunch of Americans enters\nNazi-occupied France and starts slaughtering Germans. You see them\nscalping their enemies and beating them to death with baseball bats.\nWhile making jokes, of course.<br><br>Some will say that this movie is a parody of a certain genre. For a\nparody, it is neither witty nor funny. The contents is zero. It is\nexceptionally brutal and disgusting. Underneath lies a subtle political\nmessage, because it is again \"the good guys\" killing \"bad Nazis\". The\nwhole plot is unthinkable if you turn it around. Could you imagine a\nstoryline where Nazis (while making jokes) kill everybody in the Warsaw\nghetto with flamethrowers? Probably not, but this movie is exactly\nabout that, with the exception that is satisfies the weird moral\nexpectations of a certain audience: slaughtering people is so cool when\ndone by the right people.<br><br>This movie only works because of the hidden Nazi-ideology underneath.\nIt does not regard the enemy as people. And if the latter is supposed\nto be an element of the fun, I am happy to say that this kind of fun\nwill always remain a mystery to me.<br><br>Another mystery is how such violence can fascinate the American crowd\nwhile a bit of nudity will freak them out. But if a naked body is\npornography, this movie with all its brutality is pure pornography at\nits very worst.<br><br>Inglorious Basterds is a pointless, boring and tasteless waste of time\nand money.\n"},
{"review": "\nThat's what I thought, when I heard about the cast of Inglorious\nBasterds. And I'm both from Germany and into movies.<br><br>That guy is older than 50 and so far he almost only played in mediocre\nTV series - and even there he didn't play the main parts. Obviously\nnobody ever noticed, what he's capable of. Now, thanks to QT, he got\none shot to change that - and - let's put it this way - that was a\nbingo! He is the living proof of what a great caster Tarrantino is.<br><br>By the way: I think it's a great privilege to watch the movie as a\nGerman - being able to understand everything. And the German dialog is\nwritten almost as good as the English.<br><br>Now I could repeat, what many others have written here before. I'll put\nit short: Finally, QT is back.\n"},
{"review": "\nInglorious Basterds makes no apologies, asks for no forgiveness, it's a \r\nno holds barred assault on the senses. Tarantino doesn't care if he \r\noffends, if he steps all over stereotypes and clichés, this is film \r\nmaking at it purest. It's great to see a film maker whose work clearly \r\nisn't interfeared with by the powers that be. Tarantino is a master of \r\neffortlessly cranking up immense tension and suddenly mixing it with \r\nlaugh out loud moments; you're not sure if you should be looking away \r\nin disgust or rolling around laughing, either way it's a roller coaster \r\nand one not to be missed! It's not for everyone, certainly if you're not a fan of Tarantino's style, this may be a little hard to swallow, but \r\nnever-the-less, it is a film which simply has to be seen. No self \r\nrespecting film fan should miss this. And the performance of Christoph \r\nWaltz... Oscar don't you dare ignore him!!\n"},
{"review": "\nSeriously disappointing performance by Brad Pitt and Q T, the plot is\nvery superficial and lame, and, unless indirectly intended, this film\nactually glorify the Nazis and portrays them as men of honor, and show\nthat the Jewish people are deceiving, cant keep promises and bloody\nvicious. ((THE FOLLOWING CONTAINS SPOILER)) Hitler together with the\nmost notorious Nazis are attending a stupid plot less movie about the\nkilling of 300 Italian soldiers in a small cinema theater in Paris is\nunbelievably ridiculous. the Nazis laughing and hooraying each killing\nin the movie as if watching a basketball game STUPID, the deal at the\nend is lame. whats really appalling is that the movie earned great\nreviews and is ranked here in the 40s amongst the greatest 250 films.\nwill not be surprised if it harvested many awards, including Oscars, as\nwell. the movie is simply a kissing ass to the Jewish people, but hey\nreconsider, its not even doing a great job doing that. it truly dwarfed\nthe whole Nazi - Jews conflict and a pure insult to all who fought and\nsuffered from the tyranny of the Nazis.\n"},
{"review": "\nPrevious Tarantino movies were from a guy in love with other movies.\nThis one is from a guy in love with his own writing. It isn't\nInglorious, its disgusting.<br><br>I absolutely hated Inglorious Basterds. The entire point of a film is\nto entertain - if u call bashing people's heads and removing their\nscalps entertaining!!!! - and if there is one unforgivable sin a movie\ncan commit, it is extreme boredom or disgust.<br><br>The movie is just a collection of endless and excruciatingly boring and\ndisgusting scenes of people talking at tables in various languages.\nThere is even one scene where 3 people talk for nearly 45 minutes at\nthe same table, before, thankfully they are all shot. I wished they\nwould have been killed off after 5 minutes. Even Woody Allen knows when\nto shut the F**K up.<br><br>This table talk style is a Tarantino hallmark, but in other films, I\nactually cared about what they were saying and the people who were\ntalking. Here, I couldn't care less. All of Quentin's films display an\nenormous confidence, particularly Jackie Brown. But here there is a\npervasive feeling in every scene, Tarantino had no idea where he was\ngoing with the film.<br><br>Is it violent? Sure there's torture and scalping galore, but you'd have\nto remind me. Thankfully, the film was so thin, I didn't even remember\nI had seen it earlier in the day when until I saw a review headline on\nMSNBC.<br><br>He's out of gimmicks and apparently dying to write a novel. But do us a\nfavor QT and spare us the movie.<br><br>I walked out of this movie halfway through and I would never recommend\nanyone seeing it no matter what a die-hard quarantino fan he or she is.<br><br>I give it 0 / 10.\n"},
{"review": "\nFor those that have studied WWII, and unfortunately, seen real human\nbrains on the ground, this movie is a travesty, a sadistic farce, and a\ncomplete waste of time like most of Tarantino's other questionable\nwork. I do admit to liking \"Reservoir Dogs\" to a point. However, this\nthing does not even have an original title.<br><br>I (unfortunately) received this DVD by mistake and see this project as\na new low for Brad Pitt and the other actors taking part in this joke\nof making jews more barbaric than the Nazis. It perpetuates blame on\nthe common German soldiers while covering up the major part US and UK\nbankers like Prescott Bush had in funding Hitler, as well as, the now\nconfirmed part that British Intelligence had in bringing Hitler and\nMussolini to power beginning immediately at the end of WWI.<br><br>WWII was a complex and tragic event, and the real world history\ndeserves better than this self serving, mythological blood feast served\nup for fools too lazy to look for the truth and try to prevent a\nrecurrence. History can repeat itself when we become manipulated by\npropaganda, desensitized to inhumane actions, and self righteous.<br><br>If you want to look at atrocities, many can argue that Stalin made\nHitler and the Nazis look like rank amateurs in the business of\nmurdering innocent people, as well as, the drug crazed gangs of Niger\nroping off streets with human intestines. Where does it end? We need to\nbe getting the multitude of shadowy intelligence agencies under control\nand accountability instead of getting a cheap emotional thrill about\nperpetuating their myths in Hollywood and our capitol cities.\n"},
{"review": "\nI had the PRIVILEGE of attending the UK premier of Inglorious Basterds\nthis evening! Having seen the trailers i had high hopes but had doubts\ndue to a string of self indulgent films (c'mon lets be honest, self\nindulgence is his tarantinos middle name)<br><br>I was surprised to find though that he had pulled the cat out of the\nbag with this one. The film is rich with interesting dialogue, Perfect\ntimed comedy with a dash of brutal assassination.<br><br>The crowning glory of this film though lies with Christoph Waltz whom\nno fault or error can be found. He manages to create a real tension in\nthe audience whilst remaining quite \"theatrical\" (couldn't think of a\nbetter word). He definitely deserved his prize at Cannes and is heading\nfor an Oscar no doubt!!!! Hoping to see him in something again soon!\n"},
{"review": "\nI will never go to another Tarantino movie again. The entire film was\nworthless. My wife and I both regret that we didn't get up and walk out\nat the first indication of what the film was really going to be about\n(which is still hard to determine since it was such a ridiculous\nstoryline...blood, guts, and violence seemed to be the only real\ntheme), but we kept hoping there'd be something redeeming just around\nthe corner. Unfortunately, there wasn't because there wasn't anything\nthat made sense! We, along with a lot of the other people in the\naudience walked out of the theater muttering \"that was disgusting\",\n\"what a waste of time\", \"I should've walked out\", \"where was the\ncomedy\", \"that was pathetic\", etc. It actually made us, the audience,\nvoice our disgust and the feeling that we had just been thoroughly\nripped off. The only thing of merit in the film was the costuming and\nthe acting ability of almost everyone in the film....there just wasn't\na plot/script worthy of their talents. I rate this a 1 because there\nisn't a 0. I can't quite understand how anyone could rate this higher\nthan a 0!\n"},
{"review": "\nReviews of this film are largely split into 2 camps; it's good because,\nor it's bad despite, it's direction by Tarantino.<br><br>The question I asked myself after this was would this have been made\nwithout the Pitt/ Tarantino stamp? The answer was no; and the result\nwas a film that made me so irate that I was moved to post my first\nreview on IMDb...<br><br>I found everything about this film treated the film goer with something\napproaching contempt. The script was thin with the exception of one\nwell written character - Landa. Scripting for other characters was\nanodyne or non-existent, or, in the case of the \"Jew-Bear\", simply a\nbit weird. Same for the other aspects of characterisation, that was\nformulaic and thin in nearly every case, especially the made-for-Pitt\nAldo Raine and the other Basterds. Style pastiching that normally works\ndidn't; subject matter was treated with either insufficient levity or\nindifference; scenes were badly edited or irrelevant. The redeeming\naspects were cinematography and production values - style over content.<br><br>So - am I taking it too seriously? No; this is not a funny film (though\noccasionally it seems to try) and the violence that is shown sits\nuneasily between cartoonish and unnecessary - a prime example is that\nof the surrendered German who was beaten to death; added nothing, in\nany way. In fact the tone of the film was so inconsistent in the way it\nconsidered the material that it made me very uneasy.<br><br>For me - Tarantino needs to start making films to impress others, not\njust himself. Obviously (most of) the rest of the world disagrees, but\nthat's something either Mr T or I will have to learn to live with...<br><br>One of the most disappointing films I've seen.\n"},
{"review": "\nObviously I am not intelligent enough to understand the ingenious work\nof QT as some of other reviewers did. But here are some messages I get\nof this movie:<br><br>1) The Nazis were honorable man who rather die then betraying their\ncountry.<br><br>2) America formed a group of blood thirsty Jews to wipe out the Nazi\noccupation. Actually they are not only blood thirsty but also mentally\ndeficient. (just consider how the Bear Jew behaves after killing the\nGerman officer with a bat).<br><br>3) It was an easy job to assassinate Hitler, who had only 2 guards in\nthe whole city while he was attending a movie in occupied France. The\nother high ranked German officers didn't even consider the need for\nguards.<br><br>I was also disappointed at the and when the only powerful and well\nportrayed character in the movie (Colonel Landa) turned so easily\nagainst his country. He was even enjoying the situation which was in\ncontrast with his character.<br><br>Well, you may say that this movie is the result of QT's superior\nimagination and I could only say \"good job dude...\"\n"},
{"review": "\nTarantino continues to make idiotic cartoons that at best glorify and\nat worst encourage violence. Next time there's a mass shooting\nsomewhere, consider whether movies like this one have made violence\nfashionable, dramatic, cool, newsworthy, glorious or even a little less\nthan totally unacceptable.<br><br>Suspension of disbelief can't possibly include fantasizing that the\nNazis would be stupid enough to send all four of its top leaders into a\ntiny Jewish-run cinema in Paris. Comic book authors usually won't\ninsult their readers to that extent. On the contrary, they tend to\nwrite with a level of logic and intelligence far above Tarantino.<br><br>Production, acting, music, cinematography in the film are very good,\nbut they can't counteract the insipid premise, plot, and overall\nconcept. Speaking of music, the borrowed Morricone pieces are very\ngood, but the rock, r&amp;b, etc., are totally out of place and tear down\nthe facade of a period piece.<br><br>Similarly, Christoph Waltz as SS detective Hans Landa gave an amazing\nperformance which was ruined by psychotic leaps out of character as\nwritten by Tarantino. Yes it showed Waltz's amazing acting range, but\nit also destroyed the integrity of his character.<br><br>There are numerous \"artistic\" continuity errors in the film, no doubt\ncreated to give a cleaner looking shot. When Landa strangles von\nHammersmark, both of their chairs mysteriously disappear. When Raine\ncarves Landa's forehead, Landa's handcuffs disappear so he can grasp at\nthe grass in pain, etc. Again this reinforces the notion that these are\ncomics, and rather bad ones at that.\n"},
{"review": "\n... would you have seen it ? The first scene was very inviting and\npromising, with a fabulous Waltz and Menochet, and then it slips into\nthe third dimension. A Jewish woman with a black young man managing a\ncinema (or whatever shop), in France in the middle of the 40s ???\nHitler's attending somewhere without tight security of Leibstandarte SS\n??? Where do they all get tailor made smokings in a few hours time, all\nthat, without people noticing that they can't talk french or German ???\nYou are kidding me. What's the point of this movie ? It has no historic\nvalue, no humor, nothing. WWII is a serious matter. This film is an\ninsult to all our parents and grandparents who lost their lives to\nfight the evil. At least, I would have preferred if there were no\nreference to historic characters.\n"},
{"review": "\nI am witnessing a decrease of IQ in scripts and directing over the last\n20 years in Hollywood. Never quite liked Tarantino movies but I have to\nsay I always enjoyed a good plot and believable acting (Pulp Fiction).<br><br>I hate the thing that nower days anyone can be a script writer and a\ndirector. This movie should be offending for a man with IQ over 85.<br><br>The conversation is childish, there is not one thing that makes this\nmovie believable in any way.<br><br>I will not even begin to relate to the bad acting. But hey, what can\nyou expect from an actor playing a ridiculous f--ked up character?! <br><br>I will end it here: the worst thing in this movie is the gratuitous\nviolence that marks the long conversation scenes.<br><br>And mister Tarantino, if you are a homicidal maniac in abeyance, if you\nhave money, fame, and many important friends does'n't mean that the\nrest of us will enjoy your twisted gratuitous violence. Please, keep\nyour maniacal impulses for yourself and don't poison us with it.<br><br>You should come forward and appologise to the German people. I have a\nfew German friends and they are not a bunch of drunks, idiots, sadistic\nkillers as descripted in your sick joke of a movie.<br><br>As a human being I am offended of this movie and others like it and\nthink that the world should stand up against this kind of gratuitous\nviolence and movies like this one should be thrown away to the trash\ncan where they belong.\n"},
{"review": "\nCountless Historical &amp; cultural mistakes 0/10<br><br>(1) A Jewish guy named OMAR!!! Hahahaha (2) Brilliant detective was\ntaking out by the least intelligent guy in the movie! (3) Jewish\nsuicide bombers!! That was funny. (4) Hitler and his top guns went to\nwatch a movie downtown Paris!!! With two guards at the door. !! shoot\nme. (5) Brad Pitt overacted and it was painful to watch him. (6) Mr. QT\nis re-writing history, \"Hitler was killed in a theatre\u0085 really!\" the\nfunny thing about this is that people \"and I mean stupid people\" will\nactually believe this plot. <br><br>And finally can any one tell me, how this movie made it to the top 250\nmovies of all time!!! Shame shame shame, still wondering how can anyone\nlike this movie.\n"},
{"review": "\nI attended a showing of this movie locally at the invitation of\nfriends. If this had not been the case I would probably have left\nwithout seeing it in it's entirety. I feel uncomfortable living under\nthe same sky with people who would not only take this bit of fluff\nseriously but actually like it. I didn't appreciate the story line due\nto having such difficulty with the subject matter, the chauvinism\netc.Believe it or not all members of the German Army were not Nazis\n(members of the Nazi Party) Also if you could consider the history of\nWW2 dispassionately you would conclude that soldiers of the Elite\nGerman Units such as Leibstandarte SS Adolph Hitler,Das Reich,\nStandarte Viking,Grossdeutschland, etc. Were among the best (if not the\nbest) Soldiers of the 20th Century.You would see this in their\nperformance and also in the making of the man. What makes a good\nSoldier? Equipment,Training,Leadership, and Motivation. Brad Pit in my\nestimation is indeed a twit for getting involved in this grotesque\nimitation of a film.Anyone who makes light of the German Army of the\nthird Reich lacks knowledge and intelligence. Please don't anyone give\nhim my regards.\n"},
{"review": "\nToo many morons will believe this is a factual film and those idiots\nwill pass it on as such. It is an insult to the veterans of WWII, and\nan insult to the intelligence of film goers. The trailer for the film\nis a piece of misleading garbage that has little to do with the film,\nand the group portrayed in the trailer should have been called \"The\nInglourious Idiots\". Added to all the above is the fact that too many\nHollywood drug addicts think that having most of the film in a foreign\nlanguage makes it a better film. That just proves that much of the\nHollywood crowd is a bunch of snobbish, self-important, elitist, and\ntruly uncreative a**es that do not know how to make a good film. I have\nnever been more disappointed in a film. <br><br>The high point of the movie is Brad Pitt (Angelina Jolie's live-in).\nHis pitiful imitation of the Billy Bob Thornton (One of Angelina's many\nformer squeezes)character in \"Slingblade\" was hilarious. The attempt to\ncopy Billy Bob is soooooo bad that Pitt should be at the top of the\nlist for that \"Rotten Tomato\" award.. <br><br>Sheesh, when will film makers try to actually make a good film again.\nOf the last 100 I've watched, there have been two I'd like to see\nagain. This one is 101 on the list...\n"},
{"review": "\nThe acting is overacting. The plot does not exist. The story is\ncompletely unbelievable. This is fiction with over-fictional elements\nbrought in a semi-serious setting. A farmer hiding Jews in the\nbasement, being \"interrogated\" friendly by a Nazi, while the guards\nwait outside, they come in later and shoot them all and let one escape.\nThat is a bad start. It is stupid. The stupidity does not end. This was\nnot a funny movie, this was not satire, this was not entertainment,\nthis was a long long list of stupid scenes, one unbelievable plot hole\nafter another. An insult to history, an insult to every intelligent\nmovie-lover. I was mad after seeing this. I really do not understand\nwhy people give compliments to this movie. Really.\n"},
{"review": "\nWe were really looking forward to this movie and after we watched it,\nwe were glad that we hadn't rushed off to pay for it. Terrible movie. I\ndon't know what Tarantino was trying to do. Usually a stickler for\ndetail, this movie appears to be an offering trading on name only -\nie., let's see what crap we can edit together and people will still buy\nit because it's a Tarantino movie. Given this theory - there a lot of\nfools giving way too high a rating in here. Were you drunk people? <br><br>No joke. In the past, after watching a Tarantino movie there has been\nso much to think back on - when this one was over, I was irritated that\nI'd wasted my time. There is NOTHING clever about it. <br><br>SPOILER: The reason they get caught out is because of the shoe (and\ntheir own dead men) left behind in the bar after the shootout. Now the\nBasterds have been ANAL perfectionists in their operation throughout\nthe movie and suddenly they neglect to clean the scene?? Not a chance.\nSorry. Useless product. Disgusting quality. <br><br>If you already have enough money Mr Tarantino, just stop making movies\n- I for one won't ever be paying for another of yours.\n"},
{"review": "\nThis movie is one of my top ten (worst movies ever made), I mean this\nis the first movie I'm writing a review for because I don't understand\nhow can you people like it- maybe we are not from a same planet or\nsomething like that, but if the whole movie is about making fun of\nHitler&amp;Co and in a most stupidest way possible, then yes, it is an\nawesome movie, but otherwise... I'm certain that Guebels movie from\nthis movie would be better, and if this movie won an Oscar, then I\nthink that academy award is for marking the movie that you would not\nlike to watch, at least if your IQ is above 80, and you don't laugh\nlike an idiot on every joke with point that is so obvious to everyone\nin 0.005 seconds... Anyway, just my opinion, feel free to disagree,\nhate it, or just call me moron, I don't care... :)\n"},
{"review": "\nPLOT (or lack thereof): A group of Jewish American soldiers, led by\nBrad Pitt, go overseas to during World War 2 to terrorize and massacre\nNazis while a Jewish cinema owner, the only survivor of her family,\nhaving barely escaped a German soldier known as \"The Jew Hunter\" played\nChristopher Waltz, who now plots to have her revenge when a film about\na German sharp shooter is forced upon her to debut at her theater,\nwhile Waltz plans defection.<br><br>The film is really nothing but another exercise on director Quentin\nTarantino's part to see just how much useless dialogue he can cram into\na scene and see how long he can drag a scene out before the audience\ngives up and turns the film off (similar to his misguided \"Death\nProof\"). Where Tarantino's earlier films, affectionate deconstructions\nof the noir genre, had enough chaotic energy to keep the viewer engaged\nwhile his characters blathered nonsense, much of it pop culture and\ncinema laced, this time around, like Death Proof, Tarantino fails to\nbring any of that lost energy to the proceedings. The film is dull,\ninert, and lifeless. Scenes drag on pointlessly with no real tension,\nin no small part because the characters are cardboard cut outs. Even\nChristopher Waltz's much ballyhooed and frankly overrated performance\nas the \"Jew Hunter\" Nazi fails to set off any sparks. The fact that the\ncharacter is more annoying than interesting doesn't help.<br><br>Brad Pitt and his \"Basterds\" aren't even in the film that much. While\nthe marketing campaign suggested a darkly comic take on the Magnificent\nSeven formula, the truth is the that Pitt and the \"Basterds\" are barely\nplot devices.<br><br>Trust me, you won't miss much by skipping this inglorious mess.\n"},
{"review": "\nEvery movie Quentin Tarantino has made has become progressively worse.\nI'd like to believe that most people would agree with that statement,\nbut seeing as \"Inglourious(sic) Basterds(sic)\" has an 8.5/10 from over\n100,000 ratings, it doesn't seem like the general movie-going public\nhas any sense. Even his best work, Reservoir Dogs, wasn't a\n'masterpiece.' The trouble is that claiming that you like Tarantino's\nwork has become trendy. As soon as that happens, you get boatloads of\npeople ready and willing to hop on another bandwagon. They will ignore\nlaughably terrible acting, and utterly self-indulgent writing just so\nthey can be part of the exclusive club called \"everyone.\" This movie is\nso terrible, that I swear it must be some sort of twisted joke by\nTarantino to see how much torture his fans will tolerate and still\npraise him. Like another reviewer has already said: \"Previous Tarantino\nmovies were from a guy in love with other movies. This one is from a\nguy in love with his own writing.\" I couldn't agree more. This movie is\nnothing more than self-indulgent and in-joke riddled writing paired\nwith acting ability taken right out of a high school play. But, thanks\nto the general movie going public, I'm sure it will still go down as\none of the best movies ever made. Bravo, Tarantino. You've pulled-off\none of the best practical jokes of all time.\n"},
{"review": "\n\"Inglourious Basterds\" is supposed to be Quentin Tarantino's homage to\nthe Spaghetti Western. And here's what is interesting: Tarantino has\nhad 40 years to improve on Sergio Leone's 1960s masterpieces. And he's\nfailed miserably.<br><br>\"Basterds\" is a rambling, incoherent mess of a movie. It's obvious that\nTarantino desperately wants to be the ultimate \"bad boy\" of cinema who\nmakes \"controversial\" films. But if Tarantino really wanted to be\ncontroversial in making a war film, he'd tackle the horrors of the Iraq\nWar, instead of World War II, a long-ago war that already has been\nre-hashed over and over from every conceivable angle over the decades.<br><br>Tarantino deeply wants to shock us, to outrage us and to create\ndisturbing art. And he fails miserably. The fact is, Leone was\ninfinitely more daring and controversial way back in 1968 than\nTarantino ever has been. When Leone depicted the vicious cold-blooded\ngunning down of a child in \"Once Upon a Time in the West,\" he created a\nscene that Tarantino would never, ever have the courage to film.\nCompared to scenes like that, everything in \"Basterds\" is tame and\npredictable (as is the case with all of Tarantino's work).<br><br>Last, but not least, I really can't understand why anyone would be\ninterested in Tarantino's take on the 1960s Spaghetti Western film\ngenre. I mean, why not just watch the stunning originals? The original\nItalian directors did vastly more with their tiny budgets than\nTarantino can do with his bloated $80 million budgets.<br><br>If you want truly challenging and original film-making these days, I\nurge you to check out the best of what East Asian cinema has to offer.\n(Takashi Miike is infinitely more daring, dangerous and talented than\nTarantino). Tarantino is a grossly overrated director and the fact that\nhis work is praised in the U.S. shows just how utterly creatively\nbankrupt Hollywood is these days.\n"},
{"review": "\nI'm astonished that this film made the top 250 -- indeed, at time of\nthis writing, number 84. I'm guessing that a number of the reviews are\nwritten by one-view enthusiasts who haven't very deep roots in film\nhistory or film criticism.<br><br>I was tempted to rate the film at one star just to even things out, but\nthat wouldn't be honest. There are two scenes in this movie that are\nstriking and worthy -- the opening scene where Christopher Walz (Col.\nLanda) was looking for hidden Jews, and the second when a number of the\n\"Basterds\" are in a cellar pub trying to make contact with a defecting\nactress, but are interrupted by unforeseen events. Both scenes, really,\nare at times breathtaking.<br><br>But the rest of the film varies between maudlin, unbelievable (even on\nthe terms of its own alternative history) and just plain boring. The\nreferences to other films and directors (Hugo Stiglitz? Give me a\nbreak!), not to mention the comic book-style titles and all that were\nreally wearying.<br><br>How many of you think this is really a better film than \"Rebecca\"? Or\n\"The Wizard of Oz\"? I thought we only had grade inflation in higher ed\n...<br><br>I can't imagine this film will improve on second viewing, and there is\nabsolutely nothing about it that invites such an investment of my time.\n"},
{"review": "\nWhen I saw the trailers for Inglorious Basterds, I was less than\nimpressed. I have a (very) soft spot in my heart for Reservoir Dogs and\nPulp Fiction, but the movie seemed ridiculous. So I watched it with\nvery low expectations. <br><br>I sadly found out that I was correct in my assumptions. The movie\nmanages to feel like 5 hours and still be very thin, both in plot and\ncharacterization. Tarantino tried to cram in a 12 hours long movie into\n150 minutes and it failed - miserably. The Basterds storyline is by far\nthe weakest. We are treated to a short speech about the Nazi killers, a\nfew few short scenes and montages and then the final massacre at the\ntheater. I feel that Tarantino would have been better off leaving them\nas shadowy figures in the background, as a real band of vengeful and\nsilent assassins, instead of making them appear as unlikable cretins.\nGive them less screen time, but make it count. <br><br>The Shosanna storyline is as thin, but at least Laurent's character's\nback story is given to the viewer (in parts, at least). The love story\nwith Marcel also felt tacked on at all moments. <br><br>What is even sadder is that the movie started out great. The farm scene\nis up there with Tarantino's best offerings. Much of that praise can be\nattributed to Waltz's performance as Lauda which is simply stunning and\nfrightening. Too bad the movie started going downhill afterward, what\nwith wooden 40 minutes dialogs (nothing new for Tarantino there, but at\nleast the long conversations used to be funny or clever) and\nsuperfluous/masturbatory references that only served to remind the\nviewer that he was watching a QT flick.<br><br>Still, the movie merits a viewing if only for Col. Lauda, but it\ncertainly won't become a classic.\n"},
{"review": "\nThis review gives everything away, so see the movie first.<br><br>It is neither allegory nor satire, the two finest categories in both\nfiction and cinema, and yet it approaches perfection anyway. It is of a\nnature I have no name for, but it is a nature that reveals truth and\nundermines falsehoods. <br><br>Nothing is more cloaked in falsehood than the victor's depiction of\npast wars. It is especially true of the children of the\nvictors--especially the children of US WWII veterans, like myself.<br><br>We get our view of the war from movies like Audi Murphy in To Hell and\nBack or Saving Private Ryan. Nothing but praise for our heroes and\ncheers for killing the enemy. <br><br>But QT exposes this hypocrisy by engineering a film where we are\ndisgusted first by the excesses of the enemy and then by the excesses\nof our heroes. That is the first instance. The hypocrisy is slammed\nhome in the second instance where we are first disgusted by the sight\nof American after American being shot dead by by a German sniper hero\nand secondly brought to revel in the butchery of several hundred enemy\nat the hands of our heroes. Tit for tat.<br><br>It fits the pattern of praise for our heroes and cheers for killing the\nenemy, but because it is presented both ways the hypocrisy becomes\nself- evident. This is why so many people hate the movie--even if they\nfail to realize it. High art, true art, 10 of 10.\n"},
{"review": "\nWow, what a terrible movie. <br><br>Slight spoilers, not that there's much to spoil.<br><br>The entire movie feels like an adolescent fantasy. Actually that's too\nharsh - I don't think even a 5 year old could come up with such\nstupidity. OK, fine, caricature Nazis and make the Jews blood hungry\nrevenge psychos, but at least do it with some intelligence and flair.\nClose up of the guy's face as he guns down trapped women is just not\ntoo interesting. I'm not offended, I just find it plain stupid.<br><br>Tarantino, you're delving into dangerously unwatchable territory. Even\nDusk Till Dawn was better that this. Please find your way back, I used\nto enjoy your stuff.\n"},
{"review": "\nThis is the worse movie I have watched in a long, long, time. The\nWeinsteins should provide a carload of toilet paper for the viewer who\npaid money to sit through this.<br><br>Quentin Tarantino has proved himself the equal of Just Jaeckin as a\nwriter/director with this effort. I can honestly say I've heard my five\nyear old nephew generate better stories and dialogue than this abortion\nof puerile immature unlettered lack of imagination and talent.<br><br>Quentin, save your money. You'll need it to pay viewers of your films.\nin the future.<br><br>How bad was the film, I suspect the cast and crew have carpal tunnel\nsyndrome from writing these reviews. No one who watched the movie and\nis not making money off of it could possibly give it more than one\nstar. It was like watching a 2 1/2 hr. car accident.<br><br>I would rather go see a prequel to Heaven's Gate. The only saving grace\nwas that I didn't pay money for the experience.<br><br>Skip this movie, and I use the term movie very, very, loosely.\n"},
{"review": "\nBrad Pitt sticks his index finger in Diane Kruger's leg wound and keeps\nit there until he gets what he wants. Funny, horribly so. The invented\nyarn takes \"The Dirty Dozen\" for a ride and sometimes abandons it to\npay tribute to other movies. Lots of fun. Even \"Paris when it sizzles\"\nis mentioned in a delightfully organic piece of dialog. I was thrilled\nby Christoph Waltzer's character and by his sensational performance.\nBrad Pitt creates a true original. I love the actor's lack of vanity.\nThere's a quirk in the character that is pure Brad Pitt. Tarantino\nvisits a new universe but. fortunately, his hand. his brain and his\nheart are visible all over the place.\n"},
{"review": "\nas someone already pointed out, a 1 star rating for this movie is to\nmuch.<br><br>this movie not only destroys the image that i had of quentin, based on\nPulp fiction, Kill Bill, but it disgusts me at an extent that i felt i\nhad to register to express it.<br><br>this is an offence to all the German people out there, a terrible spit\nin the face of all WW2 events. i know jews suffered and needed to take\nrevenge on the Nazis and the German people, but come on, it's been\nalmost 70 years since the events, move on.<br><br>there is so much gratuitous violence, so many disgusting scenes that i\nfelt sick to my stomach. and i deeply enjoyed PF and Kill Bill..<br><br>i honestly see nothing witty, funny or insightfull about this movie\n(apart from that almost brilliant performance by Waltz), it is simply\nthe most overrated (much worst than hurt locker) piece of trash i have\never had the bad luck to watch.\n"},
{"review": "\nAnother movie about Jews and why we should care because somehow their\nsufferings were more important than all the other ethnic sufferings in\nWWII.<br><br>Well there were more more Russians and Ukranians killed than Jews so\nwhy not have a movie about them? But Hollywood is controlled by those\nwhose aim is to further Israels influence and importance.<br><br>As quoted by another reviewer \"((THE FOLLOWING CONTAINS SPOILER))\nHitler together with the most notorious Nazis are attending a stupid\nplot less movie about the killing of 300 Italian soldiers in a small\ncinema theater in Paris is unbelievably ridiculous. the Nazis laughing\nand hooraying each killing in the movie as if watching a basketball\ngame STUPID, the deal at the end is lame. whats really appalling is\nthat the movie earned great reviews and is ranked here in the 40s\namongst the greatest 250 films. will not be surprised if it harvested\nmany awards, including Oscars, as well. the movie is simply a kissing\nass to the Jewish people, but hey reconsider, its not even doing a\ngreat job doing that. it truly dwarfed the whole Nazi - Jews conflict\nand a pure insult to all who fought and suffered from the tyranny of\nthe Nazis.\"\n"},
{"review": "\n*may contain spoilers* I probably was expecting better from Tarantino\nbecause I have to say this is his worst. I prefer Jackie Brown and Pulp\nFiction to this rubbish. Brad Pitt stuck out like a sore thumb, only\nbigger-his character is a real jerk and as far as I'm concerned is\nabsolutely useless to the story. This is trying too hard to be funny. I\nliked certain characters (Fassbender's Lt. and Kruger's actress) far\nmore than I enjoyed the story. In fact, what WAS the story? The film\nediting was so choppy. Quite frankly after the scene in the bar with\nFassbender and Kruger, the whole film just goes downhill from there.\nI'm a fan of war films and films that portray the German side, but this\ncertainly cannot be taked seriously with others. This movie got so much\nundeserved hype.\n"},
{"review": "\nI'm not a film buff but I do watch films regularly and I have greatly\nenjoyed all of Tarantinos films to date.<br><br>This film only succeeds on one level - cinematography. It fails on\nevery other level - script, costume, storyline etc... The editing stood\nout as being particularly bad.<br><br>The whole film lacked pace and direction which was unexpected as that\nis pretty much what Tarantino is know for and to date did it well.<br><br>The last scenes with Brad Pitt beside the bloke from 'the office' well,\nI just had to remind myself that Brad Pitt wasn't being paid over 10\nmillion to do this film and the bloke standing beside him was probably\ndoing it for free.<br><br>I also didn't quite get the NAZI Jewish thing.<br><br>Everyone knows that Hitler killed millions of Jews, Poles, Gypsies,\nInvalids, Catholics, Communists, old people etc ... Less than Stalin\nthough. Perhaps one of the new Russian billionaires will finance a film\nabout stalin? And it is still true, as in the film, that Jewish people\nrun the movie making industry in America so where is the irony? So for\nTatantino as an American film director it wasn't exactly pushing the\nenvelope to make a film about jews getting revenge on Hitler.<br><br>It isn't an awful film, it's just well, not a good film and borders on\nbeing a bad film.\n"},
{"review": "\nThis movie is a joke for our history... is Quentin Tarantino some how\nstupid? he got Adolf Hitler killed in a movie theater in his movie?!?\nVery poor in landscaping...it's filmed like a cheap novice\nmovie...nothing extraordinary except the magic performance from\nChristoph Waltz, which indeed was the best character in this average\nfilm. By the way please send Brad Pitt to his wife and God make him do\nLegend's of the Fall again or something similar because the priest at\nmy church looks more fierce than his role here. Please don't vote for a\npoor screenplay which has made the history of WW2 a joke... and for my\nbeloved Quentin, stay to Pulp Fiction because it was a\nmasterpiece...not a low quality \"dream\" like this one.\n"},
{"review": "\nWhenever Quentin Tarantino feels the need to share his imagination with\nus, we get treated to a film. Sometimes it works, as in Pulp Fiction.\nOther times, as in Inglorious basterds, we wish he kept his fantasies\nto himself.<br><br>Without giving too much away, Tarantino has created a film where the\nsurvivor of her family's massacre at the hands of Nazis is an\nunsympathetic character. The title characters are unknown, mere bit\nplayers. As they enter the theatre we don;t really care if they will\nlive or die. <br><br>We have the traditional Mexican stand-off, a staple of Tarantino when\nhe is too lazy to be creative. A German war hero becomes smitten with\nthe owner of the theatre, the survivor of the family tragedy. He tries\nto woo her, and when she tells him that she is not interested, for\nabout the fourth time, he suddenly becomes aggressive and completely\nout of character....but at least out of character is better than no\ncharacter at all, as the players in this movie drift in and out of\ndialogue without displaying any sense of who they are.<br><br>For a movie to run two and a half hours, one would think the characters\nwould be well defined and make us care about them. One wonders just\nwhat the hell Tarantino spent his time on...endless chatter that\namounted to one third of the film's plot, repeated ad nauseum in three\nlanguages.\n"},
{"review": "\nWell, here we are again drawn by Tarantino's increasing reputation of a\ndirector who will present himself in a ludicrous light. To say the\nleast, as it turns out.<br><br>The story is simple, it's based by events which happened between 198455\nand 199847, when Donald Duck Hitler and the evil Mazi Empire invaded\nAtlantis in order to implement the new internet broadband system.\nSomewhere along the way they really put off a group of cape wearing\n007's who felt the need to intervene. I don't have to tell you what\nhappens to Micky Mouse Goebbels in the process...pure genius. <br><br>On a more serious note, I believe it's safe to say that nowadays\nwatching a Tarantino flick based on his own story is GUARANTEED to make\nyou laugh. The more serious the subject, the better.\n"},
{"review": "\nI really like Brad Pitt. I like QT as well.<br><br>This movie however... Oh my god, I had relatively high hopes and was\nseverely disappointed.<br><br>There were aspects of it that were very entertaining...<br><br>Oh say the first 30 seconds of 20 minute long conversations in the\ntheater or bar. (Ok I'm estimating, probably high... but really were\nyou trying to put me to sleep????) What probably irks me most though,\nis the shootout in the bar.<br><br>I don't really think the other table knows what is going on, yet the\nsecond the shooting starts at \"our\" table, all those soldiers are up\nand shooting. The whole thing goes down in what, 2-3 seconds? Are\nsoldiers trained to just get up and start shooting before they know\nwhat is transpiring? I should really go back and time that scene.... 20\nminutes of boring dialog followed by a 3 second shoot-out.<br><br>And this movie is rated in the top 250? There are some really great\nscenes, like Brad breaking the Nazi solder out of prison. Some really\nfunny stuff at times, but man - this is one poorly written movie.\n"},
{"review": "\nI had to give this a vote which suggests that it's worth something so\nI'd firstly request that the IMDb mob do a thumbs voting method and\nthis film most certainly gets the thumbs down from me.<br><br>I would also like to say that thankfully, I am not the only one who\ndoesn't rate this film and I'm puzzled to see why it has such a high\nrating considering this.<br><br>The opening section was very good, had me gripped and wanting more,\nwhat a shame then that QT had to ruin it with the rest of the tripe\nthat I sat through - I've watched it twice, the first time before\ngiving up, I made it to the bar scene in which drunken soldiers spill\nbeer over the uniforms of SS officers, I don't think many officers\nwould stand for that kind of behaviour but anyway, I digress.<br><br>I couldn't watch any more, the acting from a good majority of the cast\nwas awful, the plot was woeful suited more to an 8 year old playing\nwith his soldiers and conjuring up amazing ways to win the war and I\nalso found it tasteless, wishing that Aldo, the Bear and the other\nmiscreants could have been killed in an earlier scene by the German\nsoldier who, when questioned what his medal ribbon was for, provided an\nanswer for a virtue lacking in any of the captors before him.<br><br>Yes, heroes die and quite often at the hands of unlikeable characters\nand sometimes the unsavoury ones get away with it but surely, should I\nreally be hating the Americans for the entire film after that?<br><br>I did give this a second attempt, after all, a lot of films demand a re\nwatch so I thought I'd give this another chance, I wish I hadn't, it's\nmindless pi-sh for mindless people.<br><br>If there's to be anymore WWII output (or any other war for that matter)\nfrom QT, I would suggest he purchase himself a pile of 1960/70's\nCommando comics, the plot lines within are far more realistic and for a\nbonus, some of them are actually true stories.\n"},
{"review": "\nQT needs to go back to Directing School - indeed, if he ever went there\nin the first place. To describe this as 'art' is ludicrous; ever listen\nto 'The Emperor's New Clothes'?<br><br>As an example - the table talk scene - how is it that the dog only\nbarks when the people aren't speaking?<br><br>Also getting a little tired of the world being saved by the American\n5th Cavalry - what were we - oh that's right - THE ALLIES!<br><br>Got a can of Gloss - going to paint a wall and watch it dry -\nmarginally more interesting<br><br>Get a life\n"},
{"review": "\nStupid me, I didn't even notice who the director was before I sat down\nto watch this really peculiar film.<br><br>With the possible exception of the first segment, the film - despite\nwhat the storyline is saying - is entirely in the here and now. A\nfantasy of revenge played out amid - not just gratuitous - but\ncompletely surreal, graphic, sickening violence. The carnage is so\nover-the-top that it quickly doesn't even garner a raised eyebrow, it\nbecomes simply wallpaper behind a really vapid, simple fairytale. And\nthe sets and costumes, though I guess not entirely inappropriate for\nWWII, never feel like anything more than just what they are - sets and\ncostumes. The ambiance being much more akin to gangsta rap than Glen\nMiller. \"Forties\" it definitely is NOT.<br><br>Though I initially was interested in the story, it devolved quickly\ninto a nonsensical race to the bottom in trying to outdo itself for\nsheer in-your-face, amoral brutality. Is this Tarrantino thinks passes\nfor entertainment? God, I can't imagine what a twisted, jaded,\nsocio-pathological mind can produce such disgusting, visually repellent\nimages.<br><br>And then for a finale, QT decides to completely rewrite history, and\ntwo members of a ragtag troop of misfits - with the help of a theatre\nowner and her projectionist - defeat the entire German high command. No\narmies required, TYVM. What a joke.<br><br>In the end I found myself somewhat ashamed for having sat and watched\nthis. It says far more about who we are today in 2010 America, than it\never would about WWII. And what it says is something less than\ncomplimentary.\n"},
{"review": "\nAn fun, engrossing, beautifully crafted piece of nonsense, the likes of\nwhich we hadn't seen in a long long time. The silliness of the story is\nmarvelously camouflaged with great dialogue and some superb\nperformances. Christoph Waltz must be thinking already about his\nacceptance speech. What a performance! The civilized monster, polyglot,\nrefined and deadly. He gets us going from the first, sensational scene.\nBrad Pitt is also wonderful. Was he putting a Mussolinni chin while\nimpersonating (hilariously) an Italian? I thought so. His character's\nname sounds like Aldo Ray and I'm sure that's no accident. The film is\nfull of movie references. Another character is named Fenek, as an\nhomage to his 1970's sexpot, Edwige Fenech. What is already one of\nTarantino's trademarks is his sure step along the most immediately\nrecognizable bits of pop culture. He's clearly not a cultured man but a\npop expert, king in a world where people get their news from TV, don't\nreed, other than magazines and comics, etc. That's how it happens, to\nbe in the right place at the right time. For better or worse this are\nTarantino times.\n"},
{"review": "\nThe answer: Having to READ about 2 hours of it! Yes, the man is\ntalented. And yes, there are parts of this overly-lengthy film that are\nterrific, but I've just come to the point where the thrill is gone.\nGone is my appetite for Tarantino's style with excessive homages to an\nera of films I never saw, and neither did many of his hard-core fans.\nGone (if it ever was truly there) is my desire for endless\nconversations that seldom lead anywhere or advance what little plot his\nfilms often have. It's all pretty much gone. Tarantino has been doing\nthis to us for almost twenty years now, and its time that either\nhimself or myself moves on.<br><br>Inglourious Basterds is marketed to the masses as somewhat of a revenge\nfilm about Jewish commandos slaughtering Nazi troops behind enemy lines\nwith Brad Pitt as their leader. Some of this lengthy film will in fact\nactually deal with that story line. But so much more of it is window\ndressing with long, subtitled conversations in either French or German.\nMany of our characters are not believable... even in a Tarantino\nuniverse. Nothing we see is plausible. And very little of it is tense.\nMany have pointed to Christoph Waltz's portrayal of a kind of SS\ndetective as being the lone good aspect of this film. That's pretty\nmuch the case. This guy grabs the film and runs away with it. Pitt is\ntolerable for once, but his character doesn't have to do much in terms\nof acting range. Thank Goodness. Diane Kruger has some nice moments,\nand its good to see her in something other than National Treasure\nmovies. I guess... watch if you must, but this is not the director's\nbest work. His breed of film peaked with the Kill Bill movies, and it\nisn't clear if he is capable of doing anything that isn't just a\npatchwork of what others have done. Inglourious Basterds is a long,\ntalky waste of 153 minutes. Its few good scenes aren't enough to\njustify the rest. 5 of 10 stars.<br><br>The Hound.\n"},
{"review": "\nThis has to be one of the worst films I have seen in a long time. the\nFilm started great but went down almost as fast as the girl running\ndownhill in the opening scenes. I can expect a little bending of the\ntruth when it comes to war films but this storyline was well over the\ntop and feel it was a insult to a lot of veterans from that war. A lot\nof talent wasted there talents on this film I expected more from\nTarantino, obviously Tarantino does not mean a Great Film. In the\nclosing scenes where the film reels are set on fire, I feel it a pity\nthis film was not thrown onto the fire too. Paying out good money to\nsee a film like this makes me feel I have been mugged for my money and\nmy money would of been better spent going to the red cross. :-(\n"},
{"review": "\nBefore i start with this comment... let me assure you that i am a\nQ.Tarantino fan and i loved Pulp fiction and Reservoir dogs. i also\ndon't mind the bloodshed and gore in his or Eli Roth movies. I was\noverjoyed when i heard about Brat Pitt in the movie., and believe me i\nwaited for this movie for about 4-6 months.<br><br>And... i was totally disappointed. This movie is just historically\nincorrect in many ways.. but also an insult to human intelligence.<br><br>STORY: OK., i will agree that there is no RULE for a movie be\nhistorically correct or to show who is good or bad., i will surely\nenjoy Nazis getting tortured in a fictional comic book story... but u\ncant forget the fact that the person in the story is Hitler and he is\nat least a leader of country which terrified the whole world.<br><br>If he and most of his important generals are guarded by 2 men is one\njoke., then to kill him., the whole of Britain, Russian and their own\nGerman resistance who have been trying infiltrate into his inner\nsecurity fail., a small group of Jewish Americans with a terribly acted\nleader Brad Pitt achieve this? <br><br>oh.. i forgot.., it is the Americans who save us from Aliens to\nterrorists(who keep changing from time to time).. and now even from\nNazi Hitler?<br><br>Screenplay: I really enjoyed the conversations between characters in\nboth reservoir dogs and pulp fiction( i have not seen jackie brown).,\nbut here.. i was bored. i waited and waited for that one interesting\nbit, but it never came.<br><br>The only consolation might be pretty brilliant acting by Christoph\nWaltz and pretty good picture and sets.<br><br>Basically i dint find any part funny and was very much bored., not once\nor twice., but 10 times.. in all those patches.<br><br>.. a big disappointment to me..,\n"},
{"review": "\nMy brother recommended this movie for me don't know why. <br><br>It could of gone a good movie but its a major failed. It doesn't show\nthem fighting Germans at all or doing guerrilla or apache tactics. I\nexpected it to be suspenseful and action but sadly no.<br><br>I agree with the other comments about this movie it's really lame.\nInteresting dialogue from the jew hunter but fail in character plot and\nthe German troops. What happen to the other inglorious basterds their\ngone missing and why is there only two guards protecting Hitler, I\nexpected a climax at the end. I don't see a lot of German troops at all\nonly about 5 in the bar and only 2 at the cinema what the?<br><br>Here's a good movie have lots of German personnel and tanks, more\naction more suspense and make them cunning, well trained and battle\nhardened. Have french resistance, SAS commandos and the inglorious\nbasterds. Put them all together you could of made a hell of movie just\nlike Wolfenstein or Hidden and Dangerous. <br><br>It was a good idea but failed to be put into action because of you\nQuintin Tarantino\n"},
{"review": "\nJust come out the cinema and felt the need to review this fabulous\nmovie. I really didn't enjoy Tarantino's last movie (\"Deathproof\") so I\ndidn't enter this one with high expectations. But it was phenomenal.\nFrom the opening scenes, I could see Tarantino had taken the Sergio\nLeone formula (\"The Good, The Bad, and the Ugly\") and cleverly\ntransposed it into the WW2 era in Nazi-occupied France. In fact, the\nopening scenes at the milk farm are incredibly similar in tone and feel\nto the opening scenes of Leone's GBU. Every scene of this movie is\nbeautifully shot and wonderful to watch. Tarantino has returned to form\nhere and works the camera like a master. I was reminded of the kind of\nsuspense you get from Alfred Hitchcock's best suspenseful scenes. Much\nof this movie is like that, an ever increasing build-up of suspense\ntaking the audience to cracking point before letting off the steam.\nBrad Pitt's performance as Aldo Raines is terrific and leaves you\nbegging for more, and the guy who played the main Nazi villain, and the\ncinema owner girl. All terrific. Even Eli Roth didn't bother me in his\nrole which I thought he would. The use of movie music was great\n(especially BATTLE OF ALGIERS in the prison break scene) and moments of\ntypical Tarantino humour made me smile throughout. I didn't know what\nwas going to happen next and that's what makes a great movie for me. He\nhas made a really top World War 2 movie here, without resorting to\nbarely any clichés or action at all. I don't wanna give anything away\nbut this has gone straight into my top 10 favourite movies of all time.\nEven the use of contemporary music (David Bowie for example) doesn't\nseem as odd as it sounds and works really well. I'll be getting the\nsoundtrack and the DVD. Oh, and thanks for letting the Jews wins this\none Tarantino, good man!\n"},
{"review": "\nTarantino is so full of himself, but the only achievement I can\nacknowledge is that he has reached unconditional praise and success for\nmovies that are vastly overrated, severely violent, so incoherent that\nthey should be changed to fantasy genre because of their lack of\nrealism.<br><br>Inglorious Bastards is basically Ocean's Eleven remake with violence\nand 100% ego displayed. There's no story, it's not funny, nobody is\neven trying to act.<br><br>I don't have a problem with directing a comedy about WWII - after all,\nthe Grande Vadrouille is a sensational and hysterical movie, that\nmanages to ignore completely the gravity of the war and the occupation.\nWhy ? Precisely because it is a real comedy. <br><br>All the fundamental laws for directing a movie are missing, it's\nalarming.\n"},
{"review": "\nTexas? Brooklyn? Midwestern? Couldn't tell but whatever it is irritated\nme greatly as an affectation.<br><br>Then there's both plot and story - not so much as plot and story\n(fantasy is fantasy) but their presentation, which struck me as pretty\nmuch being on the same level of affectation as Pitt's accent.<br><br>Same with script, cinematography, characters, soundtrack, acting and\nanything else I may have left off.<br><br>Now I can see how one could see this as a ridiculously off the wall\nparody of a war/cum spy movie but, as such, it just irritated me -\nneither plot nor story made sense, none of the characters were engaging\nand none of the 'bits' - like the German officer trying to negotiate\nmedals, position and pay for allowing the bomb plot to go off - worked.\nFor me.<br><br>Given the movie's success and rave reviews, mine is obviously a\nminority opinion. Which is fine and congratulations to all of you who\nenjoyed it. Just as I found it a weird exercise in slightly ugly\npointlessness, it is fitting that if it does work for others, it works.\nThat is the nature of any work of the imagination, that both viewpoints\nare valid.\n"},
{"review": "\n8.5 points rating (26.11.2009)? For what are these points? What do\npeople like on this sh**? Usually Tarantino makes not too bad movies\nwith ridiculous violence scenes - but now? The whole movie looks like a\ndumb army propaganda video.Every normal human should see, that the\nactions of the \"heroes\" are in no way better then those of the\n\"enemies\". Killing unarmed kneeing people with baseball bat's is tough?\nThe Nazi sign on the head is nothing else as the Yellow star (even\nworse cause its not removable). The story is simple, also the\ncharacters - only a little thrill and the rest is very very dumb. Nazis\nkilling is fun,Nazis are no humans - before 60 years it was the same,\nonly with Jews instead of Nazis. Looks like you've learned exactly\nNOTHING! So who are the real Nazis in this movie? So many people like\nthis crap, i'm really afraid!\n"},
{"review": "\nJust terrible. Turn the table around and have the audience laugh when\nSS soldiers smash Jewish heads while making baseball jokes. Disgusting!<br><br>Tarantino is determined to see how far he can push idiocy before the\npublic and critics realize their legs where pulled. Shatting on the\nfloor is not art despite being done by Leonardo da Vinci it is just....\nshat!<br><br>One could easily stop here but adding to the stupidity is the\nridiculous portrayals of Germans as stereotypical witless automatons\nwhile the crude and charming smartness of our utterly psychopathic\n\"heroes\" is supposed to be taken for granted. Americans you know! <br><br>I guess Tarantino, just like an obstinate child, tries to push our\npatience to the point where the crowd goes berserk but no. The world\ntolerates an insidious amount of stupidity.\n"},
{"review": "\nLet me start by saying I was a big fan of Tarantino's early work. I\nrate some scenes from True Romance, Reservoir Dogs, and Pulp Fiction as\nsome of the most engaging I've ever seen...and own copies of all three,\nwhich I've watched numerous times each.<br><br>Sadly, for me, QT has completely lost whatever gift he gave that early\nwork. His early films were so fresh...and constantly challenged ones\nexpectations making their story-lines unpredictable and entertaining.<br><br>And his reputation for creating dialog and characters in those films\nwas WELL deserved.<br><br>BUT...Inglourious Basterds contains only flickers of that earlier\ngenius.<br><br>IF the dialog does share any of that former glory...it is COMPLETELY\nmasked by being in foreign languages a LOT of the time (French, German\nand Italian)...and then the subtitles (which over-ride your disc's) are\ntiny and hard to read.<br><br>So you strain to understand a LOT of what is being said.<br><br>The story is historically inaccurate to say the least...which would be\nOK if it wasn't completely flat and unbelievable...and in addition you\nfind yourself caring so little about most of the characters that when\nthey are killed off you don't care.<br><br>Brad Pitt puts on a phony accent and smirks his way through another\nperformance...and is paired with Christoph Waltz who is appropriately\nmenacing at times...and completely over the top at others.<br><br>So the movie begins to take on a cartoony, farcical feel...complete\nwith lame characterizations and ludicrously improbable situations.<br><br>I bought my copy at a LOW price from a sale bin at a store (no wonder\nthere)...and will likely NEVER watch it again.<br><br>Hopefully I'll save some of you time you'd not get back otherwise...but\nif you read this and go on to see this film...you can't say I didn't\nwarn you.\n"},
{"review": "\nI'm surprised that even years after the fact, this film still ranks so\nhigh. This has got to be one of the most overrated films in all of\nIMDb. In my opinion, it's hands-down the worst movie Tarantino ever\nmade. In fact, I don't think I'll ever be able to forgive Tarantino for\nmaking this movie.<br><br>I used to be a huge Tarantino fan. I was a teenager when Reservoir\nDogs, Pulp Fiction, and From Dusk Til Dawn came out - I absolutely\nloved them all. I always thought that Tarantino and I shared an inner\nlove of dark humor... up until watching this movie.<br><br>I am just dumbstruck that Tarantino is responsible for this movie. I\nfeel betrayed. Not only does this movie fail in every possible category\n(acting, plot, etc), but I think Tarantino himself has failed, at a\nmuch deeper, moral level, as a human being.<br><br>His movies have always been over-the-top, extremely violent, and darkly\nhumorous. But this movie... was not humorous at all. It revealed the\ntruly ugly, mean-spirited, hate-filled side of Tarantino. I came out of\nthis movie with the impression that even Hitler himself was not as bad\na guy as Tarantino is.<br><br>In a nutshell, this is such a horrible movie that it should be given a\nscore of NEGATIVE 5 stars, representing \"a massive betrayal of the\nentire human race, particularly the indie scene.\" Tarantino is\ndisgraced for life.\n"},
{"review": "\nThis must be Tarantino's worst movie. Not only is the storyline utterly\nabsurd and implausible, but the characters are straight out of a comic\nbook for 10-14 year old boys. I cannot understand why this loathsome\npiece of cinematic garbage gets such good reviews from people who\nreally should know better. What is so great about a bunch of American\nJews, hellbent on violent revenge, who go into occupied France to kill\n(murder) as many Germans as possible? And the idea that the entire Nazi\nleadership, including Hitler, would gather to a cinema in Paris to\nwatch the premiere of a new Nazi movie, is so stupid and implausible\nthat it's not even funny. At least Tarantino's previous films, though\nas insanely violent as this one, did have good story lines and were\ncredible. This one is straight from the mind of an inmate of some\nlunatic asylum. Fans of Tarantino will praise everything he does, but\nthis creation is well below his best. The only positive thing about the\nmovie is the superb performance of Christoph Waltz.\n"},
{"review": "\nI won't spend too much time rehashing what so many others have already\nwritten, but I will add my voice. This is truly a failed movie.<br><br>The script is horrible and the direction is no where near what one\nwould expect from QT. Occasional glimpses of good acting can't save\nthis train wreck of a movie. The references to classic films are too\nmany, too obvious and utterly pointless. The violence is speculative\nwithout being the least bit satirical, it's just violence-porn. Finally\nthere is the unpleasant feeling that the \"message\" of the movie is\nactually very close to that of the real life Nazis, even though the\nroles are reversed.<br><br>I'm sorry to say that Tarrantino is way past his peak and if this film\nis any indication he might want to consider doing something else for a\nwhile.<br><br>The contradictory positive reviews are puzzling, I can only assume\nthere are lots of QT fan-boys out there who just can't criticize their\nidol.\n"},
{"review": "\nThis movie has a simple target market: adolescent minded Jews with the\ngrudge that justifies torture and killing(maybe even worse than the\nNazis themselves-let's hope that's not the case for humanity sake).<br><br>What I hated about this movie that it is highly overrated and I don't\nknow why. The film is crap, in short. Weak dialogs, the scenes are\ntaking too long, violence that justifies torture(shame on you) and the\nridiculous southern accent from Brad Pitt has no boundaries of mockery.\nLet's end with the ability to kill Hitler so easily. The director was\nnot even trying to make it more compelling in the story. No, it seems\nhe didn't even try(apparently that's Q.Tarantino style)<br><br>QT needs to get off his cocaine bucket to get some clarity which might\nhave helped making it a better film, if only a little.\n"},
{"review": "\nEverything is forgiven because \"Inglorious Basterds\" is so entertaining\nand at the end of the day that'ìs what matters. I think it's a pity\nthat certain critics, specially in Italy, are determined to transform\nthis clever pulp director into some kind of god. Maybe, partly, because\nTarantino has been very clever, elevating some of the Italian pulp\nmovies of the 60's and 70's to a sort of cult status. Italy is very\ngrateful for that, he's rewarded with interminable praise. I fear\nthat's the wrong approach, it's also confusing. He makes popcorn\nmovies, brilliantly. The characters have never anything important to\nsay, Burger King, Superman, that's the extent of its depth and I think\nhe's tapping into a society that's getting shallower and shallower with\nevery passing year. But, if I'm mentioning this instead of talking\nabout all the great things I could be saying about his movie is because\nthere is a strange force trying to brain wash me into believing that\nTarantino is the most important influence in movies since time\nimmemorial. No, he's a great director of inconsequential fun movies. I\nconsider myself a fan and I intend to see all his future movies. This\none has some wonderful touches, winking at other movies by John\nSturges, Robert Aldrich etc. Brad Pitt and in particular Christoph\nWaltz give wonderful performances. Waltz is at the center of my\nfavorite scenes in the film. Enjoy this movies for what it is and not\nfor what critics are saying it is. You'll enjoy it even more that way.\n"},
{"review": "\nVery entertaining, that's for sure. Great little moments \"inspired\" by\nother movies. \"The Guns Of Navarone\", \"Operation Crossbow\" and a myriad\nof 70's B exploitation Italian movies. Tarantino is certainly clever\nand knows how to use the camera but then, I have to say it, nothing.\nThe childish \"divertimento\" dressed in smart ass dialog remains there.\nThe entertainment value is, perhaps, the most one should expect from a\nmovie but it seems a damn shame that such a talent should be put at the\nservice of something so one dimensional. I can't help but remember\nErnst Lubitch's \"To Be Or Not To Be\" that was also a comedy with\nremarkable, inventive dialog but it also had so many other layers that\n\"To Be Or Not To Be\" after 70 years still resonates with whoever has\nseen it. Christoph Waltz is terrific and Brad Pitt is always great fun\nto watch but the experience is purely epidermic in spite of some truly\ngruesome moments. Am I expecting oranges from an apple tree? If that's\nso forget what I've just said and run to meet Tarantino's basterds.\n"},
{"review": "\nThe movie had some moments where it portrayed the worst face of Nazi\nGermany but fails to be either historic or funny.<br><br>On the contrary, when comparing it to what we see today of ISIS\nhorrifying acts and other similar radical groups I would say that this\nmovie is in fact glorifying the ill doings of ISIS and the likes of\nradical groups.<br><br>In addition, the sarcastic way in portraying Hitler and his leaders as\nidiots and cowards and attempting to claim some terrifying and ugly\nacts of Jews shows them as blood sucking ugly killers and revengeful\npeople!!<br><br>Do the Jews like to be portrayed as an ISIS radicals and revengeful\npeople, I wonder?!\n"},
{"review": "\nTo me, this was one of those films that got better as I briefly\nreflected about it days after viewing it. I realized how good it must\nhave been to keep my interest as well as it did for two-and-a-half\nhours of mostly dialect and a lot of it with subtitles.<br><br>It made me realize just how intense and good the actors were in this\nfilm, all of them with a lot to offer. Brad Pitt is the \"big name\" of\nthe group, and his character is really strange, but there is an\n\"unknown\" German actor in here, Christopher Waltz, who stole the show\nas \"Col. Hans Landa, The Jew Killer.\" He was just mesmerizing,\nparticularly in the opening scene which was incredibly tense. I'm glad\nto find out he won an Oscar for his performance.<br><br>Melanie Laurent wasn't far behind as far as good acting and an\ninteresting character as she played the beautiful-and-vengeful\n\"Shossona Dreyfus/Emmanuel Mimieux.\" In addition to the great acting\nand good direction, the Blu-Ray transfer, for those of you interested\nin that, was the best I've ever seen - just flawless.<br><br>The movie was up for eight Academy Awards so you know there were a lot\nof aspects to it that were done well, from the acting to the\nphotography to the sound and screenplay.\n"},
{"review": "\nI will never understand those people that find graphic violence and\nmurder and just plain nastiness 'humor.' I don't know how this movie\nwas ever labeled a comedy. Maybe in Tarantino's sick universe this\ncould be called funny, but I found it a horrible movie. But then again,\nPulp Fiction is supposed to be a comedy and I never saw the humor in\nthat, either. At first, I thought this was s fictional story about WW2,\nbut was stunned by the total fantasy ending. It was a completely\ndisastrous ending to a completely disastrous movie. None of the\ncharacter development panned out. My review...YUCK! It is a terrible\nthing that the industry kowtows to Tarantino so much that this movie\nshould be put onto any 'best of' list.\n"},
{"review": "\nI will admit something. I didn't actually see the entire movie. I\nwatched the first hour or so and left out of boredom. I came back at\nthe end just for grins to see how it would end. So, for that reason,\nthis probably won't be a very fair review. But still...I want my\nopinion to be heard! Sheesh, there was once a time when a film like\nthis could be made with a running time of about 90 minutes, and would\nbe a good film with plenty of action and character development.\nInstead, we get a two and a half hour plus turkey with overlong scenes\nand almost no action that for some reason is all the way up there in\nthe top 250. (At least it still is at the time this is written). I know\nI mentioned the overlong scenes already, but wow! The first scene was\nat least fifteen minutes long, and by the end of it, I was sure I would\nhate this film. I wouldn't mind a talky film if I saw it coming, but I\nexpected an action filled revenge story, not talky nonsense. I was also\ndisappointed because Tarantino can usually make a good film.Well...I\nguess this is an exception. Oh, and I hate Brad Pitt. That probably\ndoesn't help my opinion either.\n"},
{"review": "\nI am not the sharpest tool in the shed. I failed a lot of classes in\nhigh school including history and I know Hitler didn't get shot, burnt,\nand blown up in a French theater. I think every school kid knows he\nshot himself in a bunker a coward's death. This movie not only\nglorifies Hilter's death but also glorifies mutilation of enemy\nsoldiers. Also unless I am wrong, \"Nazi\" was a word pertaining to a\npolitical party. Much like democrat or republican, if you were to think\nabout it not all German soldiers were in the Nazi party they got\ndrafted, and shot if they fled. This movies like many others paints the\nGerman race as pure evil and messes with history. There is a lot of\nsubtitles that fly by so if you are a slow reader as I am, keep the DVD\nremote handy to pause it. Most of the movie is spoken in French and\nGerman with very little English. I wouldn't call this an \"Action Movie\"\nsince most of the movie is coffee talk. One scene is about strudel it\ngoes on too long as many of the talking scenes are nothing about the\nplot...<br><br>Also if you are watching it expecting a remake of the 1978 Italian\nmovie of the same title, it is not. The plot lines are mile apart and I\nprefer the Italian movie which is much better.\n"},
{"review": "\nI am sorry, but this is simply an awful movie. The only good thing\nabout this movie is Waltz and even he is unable to waltz this movie\ninto at least a mediocrity. I don't understand the desire to create\nsomething that did not exist. Jewish resistance to German rule was not\nabundant or organized, but it was not as insufficient to force\nmovie-makers into making these cartoons; Hollywood finds itself into a\nfamiliar territory yet again: rewriting history for future generations.\nOver 100 Heros of the Soviet Union (the highest medal given to soviet\nsoldier during war, usually after death in action) were Jews. Why not\nmake a movie about any one of them? What the hell was this? And you\ntake THIS to Cannes?<br><br>If anyone likes World War Two movies and appreciates historic validity\nof cinema, do watch the 2010 Russian Movie \"Brest Fortress\" (Брестская\nкрепость, both dubbed and subtitled versions exist). The main character\nof the movie and one of the Fortress defenders was also Jewish.\n"},
{"review": "\nIt was definitely AWFUL.. I guess it was the worst film I've ever seen\nand that was totally factitious..Jewish PROPAGANDA..I lost my faith on\nTarantino..Deep disappointment.. It was definitely AWFUL.. I guess it\nwas the worst film I've ever seen and that was totally\nfactitious..Jewish PROPAGANDA..I lost my faith on Tarantino..Deep\ndisappointment.. It was definitely AWFUL.. I guess it was the worst\nfilm I've ever seen and that was totally factitious..Jewish\nPROPAGANDA..I lost my faith on Tarantino..Deep disappointment.. It was\ndefinitely AWFUL.. I guess it was the worst film I've ever seen and\nthat was totally factitious..Jewish PROPAGANDA..I lost my faith on\nTarantino..Deep disappointment..\n"},
{"review": "\nWithout question, this movie is the worst movie in the top 100, and how\nit got there I will never know. <br><br>It is long. It has unbearably long sequences of the most awkward dialog\nyou have ever seen. And clearly it's written for the \"Low IQ\" crowd. It\nhad \"Pop up\" windows telling dimwits in the audience when a famous nazi\nwould come on-screen. They even had one scene where they couldn't find\nany other way to show the guys with dynamite strapped to their legs, so\nthey resorted to panning down, and doing a CGI \"cutaway\" of the pants.\nIt was about as subtle and complex as Peewee's playhouse. <br><br>And yes, in classic Tarantino fashion, the Nazis at the end were\nSIMULTANEOUSLY a) blown up and b) blasted with machine guns and c)\nburned alive. <br><br>All those of you who voted this movie up into the high 8s should be\nashamed. Tarantino jumped the shark well before Kill Bill, and this\njust cements him into the downward spiral he's been in. Hopefully he\ncrashes soon, it's sad to see the creator of masterpieces like Pulp\nFiction and Reservoir Dogs making tripe like this. <br><br>I'm giving this bomb 2 / 10. The concept of the team of Glorious\nBasterds was intriguing, and showed promise early on. Too bad we saw so\nlittle of them along the way....\n"},
{"review": "\nThe film seems to have a couple of false starts complete with chapter\nheadings. When we meet the the basterds they come straight out of\ncartoon territory. One even has a baseball bat which he uses to kill\nNazi's. Which much to my amazement he does.<br><br>Clearly there is some kind of bad joke stunt being set up but it is not\nclever enough to be satire. Brad Pitt is pretending to be a bad actor\nbut not quite bad enough to be entertaining. He is ponderous and stupid\nin every scene.<br><br>Just when you think it can't get more ridiculous there is a fantasy\nmusic sequence with the song from 1982's Cat People movie complete with\nclose up's on the actresses green eyes. An obviously out of period song\nwas there for what reason?<br><br>None of the characters are more than sketches. Maybe the point is that\nwar is some kind of absurdist nightmare but surely there was a better\nway to do all of this.\n"},
{"review": "\nAmongst the most disgusting films made, condoning &amp; GLORIFYING the\nbrutal torture of unarmed German soldiers in WW2. Against the Geneva\nconvention but seems to be OKed by Hollywood and the media. Can you\nIMAGINE a film being made with Israeli soldiers as victims ? No that\nwouldn't happen, and that says a lot doesn't it ! The message it gives\nto armed forces serving in war zones in todays conflicts, does NOT need\nexplaining<br><br>The style of the film ( as other reviewers have pointed out ) is oddly\nout of period, as if the director had been influenced by spaghetti\nwesterns. The main characters are portrayed in a crass 2d way, and\nthere are long sections of 'padding' between the scenes of human\ndegradation, and brutal murder.\n"},
{"review": "\nI watched Inglorious Basterds tonight after wanting to see if for\nweeks, because everyone was recommending this movie to me and it was\nabsolutely awesome! I don't know how Tarantino does it. I love the\npostmodern nature of his work, his imagination, his storytelling and\nhis absolute craziness. Nobody makes movies like him. Who else would\ntake a WWII and rewrite history? Who else would kill some of the most\nevil people of the 20th century; Hitler and Goebbels? Who else would\ngive power to a bunch of Jewish soldiers to bash out the brains of the\nNazi scum that was killing so many people? As I exited the cinema with\nmy friend, we said at the same time \"this is how it should have\nhappened!\". I don't think any filmmaker has ever made me say that\nbefore. If Tarantino does not get some award nominations as best\ndirector, there is no fairness in this world! <br><br>Best Performances in the film: Christoph Waltz - brilliant...the\nreviews of his performance are spot-on. He is incredible as someone so\nevil he can kill people while smiling and still be somewhat charming. I\ncan't see how he is not going to get nominated or win the Academy Award\nfor his performance, it was stunning.<br><br>Brad Pitt - he was hilarious. If anyone doubts Pitt's range as an\nactor, this movie should shut them up. He has fantastic comedic timing\nand his facial expressions in the movie were priceless.<br><br>Eli Roth - I loved him as the Bear Jew! He was savage, but you can\nunderstand his anger and thirst for blood, because of what is being\ndone to his people.<br><br>Melanie Laurent - She really is a very good young actress. Her subtle\nemotions, due of the horrific situation she finds herself in, are\nbeautifully expressed. Her bad-ass nature as well. I hope to see more\nof her in on this side of the continent.<br><br>Biggest applause goes to Quentin Tarantion though, who is not afraid to\ntake chances and tick people off with his storytelling. Bravo!\n"},
{"review": "\nAt first... this film is too long for presented story. How would Elvis\nsay? oh yeah...''A little less conversation, a little more action\nplease''. With this story film should take at least 30min less. What\nabout highlights and message? Oh... little Jewish girl Shosanna take\nrevenge for killing her family? Please! An Brad Pitt... he does not\nfall in this movie at all and his redneck accent... Please one more\ntime! And what is the biggest irony? In inglorious bastards is so much\ntalking and blaming German propaganda... and what is all this jumbo\nposters and commercials for this film? Its nothing else that American\npropaganda. And lets see statistic... Inglorious bastards has 8,6\npoints in average, release was one month ago and film has 71000 votes.\nAnd you tell me these votes are realistic and independent from flood of\ncommercials. I'm not saying this film is poor, but it is absolutely\noverrated. This is an average film for my taste and I think 6 points is\nenough. I would suggest you film Zwartboek (2006) if you like\nhistorical dramas ( Pay attention on number of votes ).\n"},
{"review": "\nOnce again, revenge is at the center of a Quentin Tarantino movie. This\ntime a Jewish dirty dozen takes things on their own hands. Tarantino\nre-writes history and shortens WWII with a comic stroke that is as\nentertaining as it is vacuous. A fantasy that re-arranges some\ncontroversial historical points. Okay, it's a movie and as such it\nworks for most of its two and a half hours. Christoph Waltz opens\nthings up in the most promising way. The opening sequence is filled\nwith a subtle but unbearable tension. Weltz amalgamates all the Nazi\nvillains we have loved and hated in the movies into one glorious\ncreation. (I will advise my countrymen to see it in its original\nmulti-language version - the Italian version is another movie\naltogether. Some of the extra pleasures are in the dialog that,\nnaturally, are not to be found in the Italian version) Brad Pitt,\nrapidly becoming one of the best character actors in the world, with a\nleading man's face and billing, is truly fantastic. Diane Kruger makes\na credible Barbara Bouchet (one of Tarantino's muses from trash action\nItalian movies from the 70's) and the rest of the cast has some\nexquisite touches like Rod Taylor as Winston Churchill. Highly\nrecommended for a Sunday afternoon.\n"},
{"review": "\nI know it's not very popular to not like this movie but I thought it\nwas awful.<br><br>The accents sucked, the pacing sucked and the characters were\nridiculous (why live in a sewer?). Some of the scenes made absolutely\nno sense whatsoever except as a prelude to some brutal shoot-out. I\ndon't like movies for idiots. This movie TELLS you what and how to\nthink and feel. It presents a glib and easy demarcation between good\nand evil. Oh those saucy American soldiers and oh... those evil Nazi\nbrutes!! I'm not in the majority. I don't care. This movie blows\nchunks.\n"},
{"review": "\nIt is a pretty brutal film. It feels like some form of \"revenge film\" I\nwonder if that is now a Genre? Anyway, we have the usual shtick of\n\"beat the nazi!\" BUT with such gruesomeness and ,,, well, if you have\nseen it, you'll know! So, we have Jews vs Nazis. This time, the Jews\nwin! BUT, again, and to hint back to my title - this is re-writing\nhistory! What did George Orwell say about that? From STUDYING history I\nlearn that the National Socialists were fighting Russia in the East AND\nTHE UK AND U.S.A in the west! How about that huh? Without getting into\nconspiracy theory, suffice to say that what happened to the jews by the\nGermans is NOT what modern cinema tells u! Spielberg's SHOAH Foundation\nProves this! These types of films simply continue to tell the lie. So\n10 year old children will go online and say, \"I hate Nazis!\" - They do\nnot even know what they are speaking about. Their actual words do not\nrefer to ANYTHING! It really feels as though these films simply detract\nfrom honest history and In my opinion telling FANTASY - such as this\nfilm - only works against Truth.<br><br>I'm not against Fiction! I love some of Tarantino's work. Yes! Pulp\nFiction, LOVE IT! But, we must have balance.\n"},
{"review": "\nI wish I could give this a zero. It's undeniable that Tarantino has\nsome cinematic flair, though Jackie Brown is the only film of his I can\ntolerate. In this film he does create some interesting situations. But\nit's basically amoral trash that seeks to implicate the audience in its\nmoronic inferno. It's the story-telling of someone who feels like an\nimpressionable and highly unsophisticated adolescent. I can't really\nwork my way into the world that Tarantino inhabits... His aesthetic is\nthat of someone who has never lived, like some brilliant but tragically\nretarded child who has been deprived of humanity, locked alone in some\nfilm vault that happens to be filled with the best bad films ever made.\nThe result is a series painstaking homages to exquisite awfulness. This\nfilm in particular is reprehensibly stupid and lacking in the basic\nhuman qualities that separate civilized people from the oh-so-evil\nNazis. A fantasy orgy of revenge violence to what end? How is an\naudience that could enjoy a film like this any better than the people\nit parodies and so delights in tormenting?\n"},
{"review": "\nThis contains a spoiler. So don't read if you haven't yet seen the\nmovie! <br><br>The movie has a riveting beginning. And the movie bills up suspense\nnicely as it proceeds, creating suspense and luring you into its plot.<br><br>But the climax fails miserably: it's too fantastic and unbelievable,\nincluding its portrayal of Hitler. The viewer cannot suspend disbelief. <br><br>I respect liberties taken with history, even with very sensitive\nmoments in history, but to create an ending as such in the movie\ncompletely denying the events that occurred in time reduces the movie\nto an insulting cartoon: it mocks the intelligence of the viewer.<br><br>Some actors and actresses, though, gave great performances: notably\nDiane Kruger, who may be the most seductive and feminine woman in the\nworld, and Christolph Waltz. Brad Pitt, on the other hand, is no Warren\nOates, and was not believable at all right from the very beginning of\nhis entrance in the movie.<br><br>\"Desperado\" worked for me: it was in part a spoof and largely\nentertaining. But this did not, partly because of its subject matter:\ntoo fanciful, unreal, and thereby insulting the viewer. <br><br>Sadly this could have been a great film. I read that the author had put\nthe script aside for years before completing it. Perhaps that explains\nthe disconnected ending and the film's failure.<br><br>The portrayal of Hitler truly missed its mark. It was not even humorous\nin order to make it palatable to the viewer. \"Fractured Fairy Tales\"\nportrayed the course of human events more realistically than this\nmovie.<br><br>My final grade? This movie could have been an A+; I give it an F-.\n"},
{"review": "\nThis film has one of the strongest starts I've ever seen. Waltz\ninterrogating a farmer is an absolute triumph of tension building.\nTarantino lingers here for far longer than other film makers would, and\nit's that that pushes the scene to another level. Subsequently any\nscene throughout the film where Waltz features earns a measure of this\nsame tension. Sadly everything else here doesn't quite stand up. The\nscene in the basement did something similar and was also enjoyable,\nwith a strong performance from Fassbender. Aside from that, pretty much\neverything else is frankly ridiculous, yet I didn't find this film\nfunny especially. The dialogue just doesn't hit home in that way very\noften. The Basterds particularly were both basic and uninteresting,\nthough perhaps that was intended, who knows... I also felt the tension\ndrained from the film towards the end, which is really the opposite of\nwhat you want. The more ridiculous and violent the film is, the less\ncompelling it is, but Tarantino wants to get all his tropes in there\nrather than go with the more serious and exciting film that this truly\nis at times.\n"},
{"review": "\nInglorious Bastards is a cinematographic masterpiece. It has a\nfantastic plot, where history is recreated to a point that makes you\nthink it couldn't be done, bringing this movie to another level.\nAlongside this, there are spectacular dialogs, most of them evolved by\ngreat tension, since most of them are done between enemies, or between\npersons that have animosity between them, which I believe was one of\nthe great challenges writing this movie. Also, Tarantino took a great\ndecision, when he chose to put actors playing characters from their\ncountry, since it enriches the movie, and plays it is his favor,\ncreating scenes based on the language barrier.<br><br>But to talk about this movie is to talk about it's actors performances,\nin particular a German actor, named Christoph Waltz. In an interview he\nsaid he had the opportunity to play one of the greatest characters ever\nwritten. I believe he is right. And the most amazing, is that he was\nable to be up to that character. He won the Oscar for best supporting\nrole.\n"},
{"review": "\nI am normally the first to slam revisionist history and did not go to\nsee this on cinema release.<br><br>It came onto television recently and having nothing better to do, and\nthere being not much else on, gave it a whirl. Well blow me down,I\nreally enjoyed it, and had to go away and think why I did so, when the\nplot is overall quite preposterous. And I think that is the key to the\nmovie, it is sheer over the top nonsense so that it actually transcends\nrevisionist history and becomes a piece of entertainment.<br><br>There is some stuff in there though that isn't much known that is real\nhistory. Both Goebbels and Hitler were huge movie fans and indeed\nGoebbels produced a version of Titanic that is quite extraordinary in\nits propaganda but is regarded as the first effort to seriously make a\nmovie about the tragedy (Google Nazi Titanic). It can be bought and I\nhave a copy but it can now be downloaded from You Tube. Goebbels\nproduction makes his one just as ridiculous as I.B. which adds to the\nirony.<br><br>I found it hard not to watch this movie without a grin on my face\nbecause it is very well acted (actually overacted) and so clichéd\n(deliberately) that it does not really take itself seriously, and you\ncan see that. Brad Pitt is having a ball. But it was the performance of\nCristoph Waltz that really blew me away. How good was he? The perfect\nblend of Nazi evil with a touch of vaudeville thrown in.<br><br>Recommended. <br><br>This movie is completely over the top which is why it works. It does\nnot want to try and rewrite history like the goddam awful Abraham\nLincoln:Vampire Killer which takes itself all to seriously.\n"},
{"review": "\nToo bad I couldn't give this piece of dog roll a big fat zero. I knew\nthis was going to be historically wrong crap when the movie begins in\n1941 with a Nazi round-up of French Jews. The round-ups began in 1942.\nWhat really worries me is that piece of wet-dream vengeance fiction\nwill be believed by the morons who get off on this sort of crap. There\nis no part of this movie that is not fiction; I suppose this is an\naccomplishment. Whoever wrote the script and the producers must have\nsome real knowledge of the period, especially in regard to film, in\nthat Lilian Harvey, Emile Jannings, and a poster featuring a Clouzot\nadd a gram of reality...that and the fact that Goebbels controlled\nfilm, that Hitler (like Mussolini and Stalin) was a film buff. Other\nthat that, the rest is the pornography of mindless violence. What was\nQuentin T thinking?<br><br>swgreif1943@gmail.com\n"},
{"review": "\nThis movie easily could have been really good but fails miserable.\nProbably because Tarantino did not put any effort in writing and making\nit good, there are so little of substance in this movie that it is\nembarrassing. Characterbuilding is almost non existing, logic is\nnowhere to be found and most of the actors do a terrible job. I was\nsurprised to find that even the Oscar wining Nazi was totally non\nbelievable and laughably overacting all through the movie. The only\nredeeming factor of the whole movie is Mlle Laurent who does a decent\njob of looking fabulous. I grew up on the type of b-movies which\nTarantino says that Basterds is a tribute to. But those movies were all\nfar superior to this piece of drivel even though they cost peanuts to\ndo compared to this D-movie.\n"},
{"review": "\nBiggest problem Tarantino is facing before making any movie, is that he\nmade his best two movies at the beginning of his carrier as director.\nThose are Pulp Fiction and Reservoir Dogs.<br><br>Almost every movie he made after that are good, but no where near as\ntwo mentioned above.<br><br>But this movie is simply ridiculous. Even Kill Bill makes more sense\nthan this alternate look on history. Such a high rating on IMDb is not\ndeserved at all. So many things in this movie treat audience as dumb\nass. Apart the first scene with Mr. Waltz everything else is just plain\ncrap. If you wanted to present alternate look on history that is all\nfine but do it without so many inconsistencies (like only two guards in\nfront of a theater)<br><br>A shame on Tarantino to allow to many mistakes in his creation.\n"},
{"review": "\nI admire Quentin Tarantino for his creative mind but find most of the\nmovies to be a tribute to murder and violence. Putting the gore aside\nyou'd be compelled to say \"it was a good movie\". I enjoyed the drama in\nthe bar when the inglorious bastards met the German actress (the\ninformer), and everything went wrong. I enjoyed the drama around the\ntheater and that the Germany's best Marksman fell in low with the\nJewish girl boasting about his many kills (without consideration to\nwhether her relatives or friends would be among the victims) and how\nthe circle is closed at the end.<br><br>But after seeing the mass murder scene in the theater I cannot help to\nbe disgusted by the glorification of hatred, murder and revenge. The\nbasic ingredients of anything marked Quentin Tarantino.\n"},
{"review": "\nThis was definitely one of the weakest films by Tarantino. And there\nwas a simple reason why.<br><br>He chose too serious and dramatic topic for his style. Yes, it fitted\nperfectly for Pulp Fiction and Reservoir Dogs but to rape World War II\nin that way is a bit too much. <br><br>First scene was very promising when the Nazi was explaining the French\nman why Nazi regime hates Jews. Secondly we were introduced to\nInglorious Basterds. The group of brutal Jews killing Nazis. First I\nthought it was a fine idea but later it got pretty tiring.<br><br>Then everything started to go downwards. Too long table scene showed\nthe Jew girl Emanuelle who had escaped in the beginning from Nazis\nthinking about showing the great Nazi movie in her cinema. Afterwards\nanother very long and weak table scene came by which ended with\nshooting.<br><br>And then the finale where Emanuelle let her lover burn down the Nazis\nfilled cinema including Adolf. <br><br>Some big mistakes were that the table scenes and empty discussions were\nawful. They didn't lead nowhere. History rewriting in such a way wasn't\nbelievable as well. All great Nazis including Hitler were killed in a\nmovie theater. And finally of course Tarantino's jokes which for me\nhave been usually fine but put in such a plot wentjust too far.<br><br>Still, if you can put it up you may enjoy this film. I wouldn't say it\nwas a complete waste of time but Tarantino crossed the line from where\nit got controversial for even myself. <br><br>More on the plus site there was some fine acting, some laughs and\noverall interesting point of view. <br><br>So let's just say below average, don't expect it to be Pulp Fiction..\n4/10\n"},
{"review": "\nI watched this movie because I am very fond of Quentin's\ndirection,specially his chapterwise description,cunning dialogs and\ndifferent sense of music.But it is unfortunate to admit that this movie\nhas nothing that can be praised except the acting of Christoph\nWaltz,Daniel Bruhl,August Diehl.<br><br>This movie is full of flaws &amp; acting disasters.In second half of the\nmovie Bradd Pit was acting like he is doing mimicry of Godfather's\nMarlon Brando.<br><br>I was surprised to see the ratings of this movie at IMDb.I would say\nthat it is very overrated &amp; 8 nominations in Oscar,what were they\nthinking?\n"},
{"review": "\nAs a fan of Tarantino's 90s gangster flicks, especially Pulp Fiction, I\nreally wanted to like his latest offering. I wasn't all that impressed\nby Kill Bill, so was hoping this would be a return to form. Sadly, it\ndidn't quite do it for me. The story is an interesting one: a team of\nJewish American soldiers are sent to Vichy France to hunt down Nazis.\nThere were a few entertaining set-piece action scenes and the odd bit\nof snappy dialogue. Overall, though, the film seemed to drag on at an\nachingly-slow pace. I could see that Tarantino was trying to build some\ntension etc, and the opening scene where a Nazi interrogator spends\nsome time in inane banter with a man harbouring Jewish refugees was\nreally well-played. The nerves increased as I wondered whether he would\nfind the Jews hiding under the floorboards and there was some decent\nsuspense. What undid the film, though, was that such scenes were more\nor less replayed several times over. I felt that Tarantino was too\nconcerned with paying homage to various things/people/music, rather\nthan directing a tightly-scripted film. This could have been really\npunchy at about 90 minutes, but it rambled on for over 2 and a half\nhours. The finale was pretty good and made up for that somewhat, but\nwhen it was over I just felt a bit empty: this could have been so much\nbetter. I don't think Tarantino will be able to match his earlier\nachievements and I probably shouldn't compare films which are\nadmittedly different. Yet I couldn't help feeling disappointed that\nthis latest Tarantino movie wasn't on the same level as Reservoir Dogs:\nwe know he is capable of greatness, but maybe he's got nothing left in\nthe tank...\n"},
{"review": "\nO.M.G. is it wrong to be BORED by this film? What has happened to my\ncute Brad baby? Can ya tell? I hated this movie. The two women were the\nonly redeeming factors for me. Tarantino is a juvenile fan-boy of\nviolence and shows it lovingly on the screen, in close up and long\ntakes. But his fan base loves it all too, so he will keep getting funds\nto make these piles of dung. The opening sequence at the farm house is\nsuspenseful and starts things off well. We dread what we know will\nhappen to the Jews hiding under the floor boards. But by the time the\nyoung woman is running across the field, and it just ends with the\nofficer yelling at her, things have already started to go wrong. At\nleast to me. So much of the rest is just disjointed and makes you want\nto scream - get on with it! - too many long meaningful looks, too many\nin jokes that I for one didn't get. 4/10 only for his good actors doing\ntheir best.\n"},
{"review": "\nThe movie is pointless. My opinion is that... actually Im not even sure\nif I can come up with at least 10 lines that IMDb requires me to\nproduce. so I will try to come up with something to justify my 15\ndollar movie ticket. I know that you cannot expect historical accuracy\nfrom the entertainment industry but this movie just makes no sense to\nme. There are no action packed sequences. No historical accuracy. some\nviolence? If you liked the movie for its violence, then ...well then\nthis movie is in your category. You must've liked the Hostel and\nHostel2 too.:) <br><br>I noticed most critics in major News outlets gave it 5 stars and seems\nmost people bought it. I just didn't get it, I guess thats why I'm not\na critic:)<br><br>One good thing about the movie is its linguistic scope. Not uncommon\nfor Tarantino. Very good set of actors. Christofer Waltz will finally\nbe recognized after 20 years of acting in Europe..!;)\n"},
{"review": "\nA film about the Second World War without Russian? This is really\nfunny.<br><br>The only adequate scene - the first one.<br><br>My first thought after watching the film - a flight of paranoid\ndelusions. But given the director can say otherwise: good cynical, but\ntoo bombastic farce.<br><br>The film is not worthy of Oscar and repeated viewing.<br><br>I'm very afraid that this film will see my grandma or one of those who\nerected the red flag over the Reichstag.<br><br>2/10 for a sense of humor\n"},
{"review": "\nthis jackie brown meets spaghetti ww2 feature earns 8 + stars? Are you\nkidding. I could barely get past the first half hour before ejecting\nthe c.d. &amp; was filled w/ regret I made the mistake of purchasing. What\na horrible movie. 8 + stars. I am truly amazed how low the bar is set @\nIMDb. From the start, I could tell production was in way over its head.\nIn the first place German soldiers would not indiscriminately fire @\nthe floor hoping to strike their intended targets. Instead of making a\ncomplete mess, they would of captured their prey w/ the intent of\nidentifying &amp; questioning their captives. Finally, the scene 'bear jew'\nclubs the German sergeant was laughable. Before doing his Ted Williams\ndance, he asked if the Iron Cross, worn by the sergeant was given for\nkilling jews. Any partisan behind enemy lines would know better.\nMessage to Hollywood: world war two was much more than slaughtering\ninnocent jews. Just ask those who lived in the former Soviet Union.\nSorry, this payback movie is horrible\n"},
{"review": "\nA total waste of time. Don't be fooled by the great reviews. Tarantino\nhas never made a movie as good as Pulp Fiction, which I think is\ngenius. If you like your movies with mostly subtitles and totally\nillogical and unbelievable situations you may and I say may like this\npiece of crap!<br><br>A total waste of time. Don't be fooled by the great reviews. Tarantino\nhas never made a movie as good as Pulp Fiction, which I think is\ngenius. If you like your movies with mostly subtitles and totally\nillogical and unbelievable situations you may and I say may like this\npiece of crap! And this 10 lines of text crap is bullshit as well!\n"},
{"review": "\nI find all the rubbish from Mr Tarantino either over complicated or\nsick. This is no exception. I watched around three quarters of this\nrubbish and found the plot ,if there is one, weak and fractured. Also\nas usual the violence is the main part of the film. Tarantino needs\npsychiatric help if this type of film is all he can produce.<br><br>The people who rave about this worry me to. I think that until this\nidiot can make a film which actually entertains I think the studios\nshould ban his work.<br><br>ABSOLUTE \"SICK\" RUBBISH , BEWARE Finally the original film is better\nbut still poor but at least it does not try to shock.\n"},
{"review": "\nI have never registered or went to the effort of commenting on a film\nbefore as I believe we are all different and thus have different\nopinions, but oh but I had to comment on this film when I read all the\nother comments . I watched this film knowing who had made it with the\nknowledge it would be graphically violent and shall we say imaginative\nbut my dear was I caught of guard by the sheer awfulness of this film .\nThe acting seemed to be a case of breeze in do your bit and go pick up\nthe check at the door , the dialogue was that of a 10 year old boys\nimagination as for the story , please it smacked of \"we know its awful\nbut if have loads of other little stories it might blur the main story\n\" that I was finding myself laughing as each scene passed . Quentin you\nmade a decent film once before and now you believe the hype about\nyourself a big mistake . As a film fan who thinks films first entertain\nand may or may not stir up emotions I do draw the line at a film that\nis just not entertaining and stirs the emotion of I,ve wasted time . So\nin my humble view only watch this film if you are made to\n"},
{"review": "\nOverrated. Tarantino seems to make movies just to prove he can; there\nis NO depth or soul. At times, we heard chuckling in the audience.\nSomehow I did not expect to find comedy in a movie about Nazi Germany.\nAdd in the over-long drawn out scenes showing a strudel dessert, or a\nhat w/veil being put on...painfully 'artistic'. The storyline of\ngetting even with vicious killers by viciously killing them seems\ncontradictory in a sense. Somehow it makes a mockery of what the\nholocaust victims endured. I think this movie is only being applauded\nbecause it was made by Tarantino. IF anyone else had directed it, it\nwouldn't even be on the radar. Maybe the only ones impressed by this\nfilm needed to be Tarantino diehards. If that is true, there is no need\nfor criticism as ANYTHING would satisfy. Sorry fans, it just didn't\nlive up to expectations.\n"},
{"review": "\nWell, what can one say, and, in any event, who would read this review\nat this point anyway. Even though the first scene had some perverse\ninterest, after that I skipped thru it to the end, but still couldn't\navoid 1.) Brad Pitt doing one of the worst performances of all time; 2)\na whole lot of scalping by the US team, filmed with obvious relish and\ndisgusting detail by the psychopathic director; and 3)a total and\nextremely boring and unfunny rewrite of history. This film could only\nappeal to serial killers and the ilk who like QT. Whew! The real\nquestion is how can people watch and enjoy this rubbish. Since there\nhave been few if any good films produced in the last decade, I guess\nAmericans et al. are starved for entertainment. Still, watching such\nviolence makes me again believe that a good % of viewers are sadists,\nwith the assumption that most of these are young men since I cannot\nb3eliev that a woman could sit through this tripe.\n"},
{"review": "\nI must say I love movies about history and previous wars.<br><br>So I was trying too enjoy this movie, but I would not get over the fact\nthat all kind of cliché's are wrapped up in this single movie. I\nthought this movie would be a pleasant surprise since it's a\nTarrantino, BUT it was so predicable. There where no surprises in this\nmovie and we knew how the movie where going too end very early on.<br><br>Movies about WW2 are beginning to water out!, we have seen them all and\nwe are constantly reminded by Hollywood about this part of history.\nPlease Hollywood,,,,, time has changed and the holocaust offspring are\nnow repeating history in their promised land. I could not keep myself\nfrom thinking that the justified cruelty in this film is probably going\nto justify the unjust cruelty going on in the worlds single\nconcentration camp in the promised land.<br><br>I'm disappointed in this movie and Tarrantino\n"},
{"review": "\nBad bad bad....<br><br>This is another stupid movie. still don't know what is the language of\nthis movie? is itEnglish or french or German!?!! you have to be\nspeaking all 3 languages ( at least ); preffered Italian too to\nunderstand it. poor quality translation with very hard to read font.\nshowing a very stupid way of ending this movie!! in the mid of the\nmovie you will lose interest in this movie and start to think why am i\nwatching this?! brad pitt is proving that his acting talent is going\ndown.<br><br>Maybe this is the movie number 1000000 that talks about Nazis. is there\nany other subjects that Hollywood can produce?! I think this movie is\nanother American propaganda to show super heros American. I expect next\nHollywood movie is American hero will save Jesus!!!\n"},
{"review": "\nWhat can I say apart from 'do not waste your money'. Tarantino is\nvastly over-rated in my view, but I was beginning to change those views\nat the beginning of the film where the opening scenes were superbly\ntense. Then it went downhill into a mixture of 'how the USA won the\nwar' and simply 'complete nonsense'. The more the movie progressed the\nmore annoying it became and the more bizarre and contrived the\nstoryline became. Why contrive a film about (in)famous characters and\nthen try to rewrite the whole history of the 2nd world war? I'm sorry\nbut Tarantino is a pretentious little man who unfortunately believes\nmuch of the adoration written on this site. I would have preferred to\nhave watched Eastenders !!!\n"},
{"review": "\nFirstly, the film has merits, the action scenes are pretty good, the\ngore is around abou right and it does depict the brutality of ww2 well\nin places although it goes a little over the top in terms of what makes\na film good or like its trying too hard to be shocking.<br><br>I cant give this film a good rating simply because of how much it\nsmacks of American arrogance. The sheer idea that a group of criminals\ncan appear in France and kill Hitler so easily with brute force is\nsimply ridiculous.<br><br>I know tarrentino is known for his films in terms of their violence and\ngore, and the kill bill series was good, this simply was not. Im yet to\nsee a film made so ridiculous that the story is so bad it ruins what\nwould have been a pretty good film.<br><br>Im told its a film to be taken with a grain of salt...but i think you\nneed to take an entire pot of salt with it...its watchable but id\ncertainly never watch it again.\n"},
{"review": "\nOne-dimensional comic book characters; a disjointed plot - really just\na series of vignettes, each with a predictable violent ending,\nsignifying nothing; punctuated randomly with adolescent humor; and\naccompanied by trashy music which would undercut what is going on, if\nanything were going on.<br><br>I guess it's supposed to be a parody or something but if so it never\nquite rises above the level of Mad Magazine.<br><br>Brad Pitt gets to mug yet again. Waltz and Laurent get a promo out of\nit. I hope they go on to better things with a real director.<br><br>There is recognizable craftsmanship in the parts, but a movie is a\nwhole, not merely a sum of the parts, and it must be judged\naccordingly.\n"},
{"review": "\nI have only registered here to write a word or two about this movie.<br><br>It just amazes me what success can the cheeky, uneducated and totally\nuncultured half-wit director receive. It is just unbelievable. Yes, I\ncan see that if you are an average American - Homer Simpson type of a\nguy - you will \"loooove\" this movie (as well as the other Tarantino's\nmovies). If you are just a bit thougtful, educated and know at least\nsomething about the WWII history (from serious sources!), you will be\nshocked by this \"act\".<br><br>I have never ever seen (or read) such a mixture of pure stupidity,\nmental emptiness and totally false and misleading interpretation of\nalmost everything in the NAZI era - from the beginning till the end. If\nyou want particulars, please read Dr.Sam's review below, I don't need\nto repeat it.<br><br>To put it simple, this a cheesy and kitschy cowboy-like movie situated\nback in the WWII era which can be appreciated only by those who live\njust for presence and are unable (or don't want to) to use their brain.\nI know this is insulting but so is this \"movie\" to my intelligence!!!<br><br>p.s. yes, the only \"good\" thing in this movie is Mr.Waltz's\nperformance, great actor (who cannot save it all, of course).\n"},
{"review": "\nThis is really a movie I'd like to forget very soon. Awful\nperformances, violence with no meaning at all, bud representation of\nthe epoch, characters that aren't even characters but caricatures. Jews\nthat looks like Vikings, Nazis like gangsters, a Hitler like goofy, A\nterrible mess of a movie. I think that this is one of the worst movies\nI ever see in my hole life. And Tarantino gave us glorious moments with\n\"Pulp fiction\" etc. But this was a terrible miscarriage, not even\nacceptable us a joke of bud quality!! And 8,5 in rating ? That was a\nreal surprise for me. It seems that many people have a terrible taste,\nor that ratings aren't very reliable any more... If I was in your\nposition, I would watch movies like this only if I was in calaboose!\n"},
{"review": "\nQuentin in my opinion has written and directed only really one good\nmovie and that was the multiple award winning Pulp Fiction. However,\nmost of films, especially of recent, have been real REAL turkeys.\nPeople still rate him and his stuff today and i really can't see why.\nThere are many other directors and writers nowadays producing far\nbetter entertainment in all aspects of their movies. From this point\non, i shall not believe the hype that is a Tarantino movie.<br><br>Inglorious was too long and worse still you felt it. The humor was,\nwell, minimal and not that humorous. The violence was nothing new\n(minus the end scene). The dialog was sometimes very VERY drawn out.<br><br>For some they'll love this movie; and for others they'll hate it.<br><br>... and i thought the subject matter of Nazis was finally put to bed\nwith the awesome 2004 German movie Der Untergang.\n"},
{"review": "\nShame on IMDb saying this is a drama/thriller/war film. Nothing of the\nsort. \"Saving Private Ryan\" would come into that category, not this\ndreadful mess of a movie.It looks and feels like the writer/director so\ncalled has made it up as he goes along as the whole thing is uneven and\ndrifts from drama to farce and various other genres.<br><br>It is part parody, part fantasy, part black comedy(without being\nfunny)and proved to be a total waste of my time and goodness knows why\nI did not bother to turn it off sooner. Brad Pitt is a complete\nembarrassment as he looks like he got out of his VIP chair to ad lib\nhis role. And the actor playing Hitler is also an absolute joke but\nhumorless.<br><br>In brief the scenario is that a bunch of Jews in the 1940's go to get\nrevenge on Nazi's, and the climax of this takes place in a cinema in\nParis where all the German leaders will be present. <br><br>The picture has unnecessary and needless violence, the plot and story\nare outrageously ridiculous and whilst Christopher Waltz steals the\nshow even he cannot save this movie.<br><br>Now have to ask rhetorically:<br><br>Why do the members here give this movie over 8/10 on average? Further,\nwhy have are the box office takings almost twice the apparent budget?\nSeems that a few influential but totally out of touch film reviewers\nand some clever misleading marketing has duped a lot of people into\nbelieving there is some worth in this disaster of a movie.<br><br>My verdict:<br><br>What a load of rubbish,<br><br>1/10\n"},
{"review": "\nAfter seeing many Tarantino films and understanding and enjoying much\nof his darker humour and intellect, I was hugely disappointed in this\nmovie and the way it was presented. Although many of his films are\ndepicted with violence which is graphically portrayed this time seemed\na bit out of the ordinary and over the top. Maybe after seeing so many\nof his films I was wasn't expecting the level of violence as it was\nportrayed or maybe I'm just tired of seeing the same old thing from\nhim. The film opens up well and cements Christoph Waltz's character\nbeautifully as the Sly, calculating and deadly SS officer, a character\nthe was so well developed that you really hate him and just want some\nhim to get what is deserved. Daniel Brühl also plays his annoying and\npersistent character well and although you want him to get what he\ndoes, you also feel some pity for him. But for the rest, well they just\nfilled the gaps in some very long drawn out scenes that by the next\nscene you have try and remember what the hell is going on. Story was\nless about the Inglorious Basterds and their exploits and more about\nthe plight of a young Jewish girl whom escapes from the murderous\n(Christoph Waltz). So where this title comes from is unknown. Brad Pitt\njust rolls with the punches and doesn't deliver anything extraordinary.\nNice touch to use an old Universal Logo at the beginning and roman\nnumerals under the title like a 1960's war movie. But thats where the\nsimilarities end. Tarantinos effort to cross a war drama of old with\nhis own unique style failed in my eyes by using Scalping and other\nvarious violence to make it entertaining. Very disappointed in this.\n"},
{"review": "\nI actually sat down expecting to like this movie, and honestly even\ntried to enjoy it. Ultimately, however, it failed to entertain me.<br><br>Rarely have I seen a film that I thought so dull and childish. Besides\ntwo scenes that were nearly interesting, the rest, bad as they were,\nwere dulled even further by lengthy and unlikely dialogue punctuated by\nscenes of gratuitous, gory violence.<br><br>The entire film seemed somehow schizoid, straining precariously on the\nverge of being a farcical comedy, yet ne'er so much as a titter was\nraised from this viewer.<br><br>The long-winded opening scene held some promise, but between that and\nan interesting rendezvous later in the movie, it sagged. After the\nsecond nearly-interesting scene, it free-wheeled downhill.<br><br>The tedium of the movie was almost salvaged by the compelling\nperformance of Waltz, and Laurent, attractive and convincing, almost\ninjects a touch of passion... but it wasn't enough. I frequently lost\ninterest.<br><br>At points, I was almost offended - not so much by the ludicrous plot,\ninept writing/direction, or wanton brutality, but by the sheer\naudacity, inaccuracy, anachronism, and blatant historical theft that\nattempts to lend gravitas and meaning, but simply insults the\nintelligence.<br><br>It's a shame that an otherwise promising line up was wasted on this\nsloppy, thoughtless material - how can such a great cast be so...\nmiscast?<br><br>I've given it two stars. One star is for the opening scene, which I\nfound genuinely gripping, and the other is for the strongest and most\ninteresting character in the entire movie, some of whose scenes are the\nonly ones worth watching if only for the chilling cordiality that\nshrouds the menace he infuses into every line and gesture.<br><br>The other eight stars are in a drawer somewhere with Quentin's lost\nmarbles.\n"},
{"review": "\nHow this film managed to get the rating it has is beyond me since it is\nutter swill. I could go into detail and list all of the things so\nterribly wrong with it, but I feel that most of those have been covered\nby other reviewers who thankfully had the presence of mind to see it\nfor the rubbish that it really is. And to think this came from the same\ndirector who made \"Pulp Fiction\".<br><br>To keep it short, this film is a waste of time and intelligence. I'd\nnormally give this a zero star rating. Sadly, that's not possible. I'm\nglad I was able to directly delete it from my computer's hard drive. <br><br>Now if only I could erase this atrocity that easily and quickly from my\nmemory. Ugh :(\n"},
{"review": "\nI love QT's films. All of them. Until today. Inglorious Basterds, in\nmany reviews is accosted for being to ludicrously violent. It is that.\nBut I'm not bothered by it. It's a QT trademark, after all. It is\nlambasted for its absolutely ridiculous fragment of a plot. I agree\nthat what's there is frankly, insulting. But QT has often managed to do\namazing things with such plots. Problem is: It is intensely boring.\nthere is this thing that happens to famous directors. They forget there\nis this concept called editing. They come to believe that their vision,\ntheir every second of imagery is heavenly treasure; that to cut a line\nof dialog out of, for instance, the third 20-minute conversation around\na table, is to cut the heart out of their child. We're here, folks. QT\nhas become boring. His once masterful dialog may be in there somewhere,\nbut it's buried in stuff that would make George Lucas reach for the\nscissors. And that is all this movie is--talking. Sure, there's some\nblood and explosions, but QT dashes through the action so that he can\nget back to yet another stilted, pointless conversation among\ncharacters who, frequently have no role save for that conversation.\nBoring, boring, boring. Stupid and violent, yes, but the boredom:\nthats' unforgivable.\n"}
]