[
{"review": "\nTo put this in context, I am 34 years old and I have to say that this\nis the best film I have seen without doubt and I don't expect it will\nbe beaten as far as I am concerned. Obviously times move on, and I\nacknowledge that due to its violence and one particularly uncomfortable\nscene this film is not for everyone, but I still remember watching it\nfor the first time, and it blew me away. Anyone who watches it now has\nto remember that it actually changed the history of cinema. In context-\nit followed a decade or more of action films that always ended with a\nchase sequence where the hero saved the day - you could have written\nthose films yourself. Pulp had you gripped and credited the audience\nwith intelligence. There is not a line of wasted dialogue and the movie\nincorporates a number of complexities that are not immediately obvious.\nIt also resurrected the career of Grease icon John Travolta and\nhighlighted the acting talent of Samuel L Jackson. There are many films\nnow that are edited out of sequence and have multiple plots etc but\nthis is the one they all want to be, or all want to beat, but never\nwill.\n"},
{"review": "\n\nIf you think \"Pulp Fiction\" is brilliant, you're wrong. It's more than that.\nIt's a milestone in the history of film making. It's already a classic. But\nwhy? Because of the many \"f\" words, or maybe because of the brain and skull\npieces on the rear window of a car? No, that's surely not the point\n(unfortunately some other users - fortunately the minority - don't get\nit).\nTarantino has made a movie that's someway different from many other action,\ngangster or crime movies. What's so different? He knows the subject of the\nmovie is \"cool\", he knows it's a product of mass culture, and he even likes\nit by himself. But he smiles at it and tells three great stories with a lot\nof irony. And this irony is the first point. The second point is that he\ngave souls to extremely schematic characters. They surely aren't another\naction heroes who you forget as fast as you can twinkle. They are human\nbeings like we are, talking about Burger King and McDonalds, about TV series\nand a foot massage. They just earn their money with killing others or\nselling drugs.\nWhat else is so great about \"Pulp Fiction\"? It's the acting, the directing,\nthe cinematography, the soundtrack, the sense of humour and the whole rest.\nIn my opinion it's all worth nothing less than a 10 out of 10. A\nmasterpiece.\n"},
{"review": "\nPulp Fiction may be the single best film ever made, and quite\nappropriately it is by one of the most creative directors of all time,\nQuentin Tarantino. This movie is amazing from the beginning definition\nof pulp to the end credits and boasts one of the best casts ever\nassembled with the likes of Bruce Willis, Samuel L. Jackson, John\nTravolta, Uma Thurman, Harvey Keitel, Tim Roth and Christopher Walken.\nThe dialog is surprisingly humorous for this type of film, and I think\nthat's what has made it so successful. Wrongfully denied the many\nOscars it was nominated for, Pulp Fiction is by far the best film of\nthe 90s and no Tarantino film has surpassed the quality of this movie\n(although Kill Bill came close). As far as I'm concerned this is the\ntop film of all-time and definitely deserves a watch if you haven't\nseen it.\n"},
{"review": "\nViewers are taken on a ride through three different stories that\nentertwine together around the world of Marcellus Wallace. Quentin\nTarantino proves that he is the master of witty dialogue and a fast\nplot that doesn't allow the viewer a moment of boredom or rest. From\nthe story of two hit-man on a job, to a fixed boxing match to a date\nbetween a hit-man and the wife of a mob boss. There was definitely a lot\nof care into the writing of the script, as everything no matter the\norder it is in, fits with the story. Many mysteries have been left such\nas what is inside of the briefcase and why Marcellus Wallace has a\nband-aid on the back of his neck, which may be connected. The movie\nredefined the action genre and reinvigorated the careers of both John\nTravolta and Bruce Willis. This movie is required viewing for any fan\nof film.\n"},
{"review": "\n\nMy oh my.  \"Pulp Fiction\" is one of those roller-coasters of a movie.  It is\nboth a joy and a trial to sit through.  Amazingly original and\nunforgettable, Quentin Tarantino's trash masterpiece never gets old or seem\noutdated.  It put a face on American independent film making in 1994. \nMiramax had been around since the 1970s and no one had heard of it before\nthis film.  Studios went into a panic when this film came out because they\nknew it would be an amazing hit.  Of course it was.  Independent film making\nbecame the rage and hit its peak in 1996 when four of the five nominated\nBest Picture films were from independent studios.  The screenplay and\ndirection by Tarantino are quite amazing, but the cast makes the film work. \nJohn Travolta (Oscar nominated) re-invented his career with this film. \nBruce Willis cemented his celebrity.  Samuel L. Jackson and Uma Thurman\n(both Oscar nominees) became marketable superstars.  Others who make\nappearances include: Ving Rhames, Christopher Walken, Eric Stoltz, Rosanna\nArquette, Steve Buscemi, Frank Whaley, Harvey Keitel, and of course Quentin\nTarantino himself.  They all leave lasting impressions as well.  Samuel L.\nJackson stood out the most to me, his lack of substantial screen time may\nhave cost him the Oscar.  Just an amazing accomplishment, all involved\ndeserve recognition.  Easily 5 stars out of 5.\n   \n"},
{"review": "\n\nTarantino is without a doubt one of the best directors of all time and\nmaybe\nthe best of the 90's. His first film, Reservoir Dogs was amazing and\nclaustrophobic, his segment in Four Rooms was by far the greatest (even\nthough Rodriguez's was excellent too)and Jackie Brown is a wonderful homage\nto the Blaxploitation films of the 70's. However, Pulp Fiction remains my\nfavourite.<br><br>It was nominated for so many Oscars that I still find it hard to believe\nthat it only got one: Best original script. I'm not complaining because\nForrest Gump got best picture, since that film was also Oscar-worthy, but\ncome on, movies like Tarantino's or the Shawshank Redemption deserved much\nmore.<br><br>Anyway, going back to the movie, I particularly liked the first and second\nchapters, and that's really a contradiction because one of the movie's\nfinest characters, Mr. Wolf, appears on the third. Bruce Willis also does a\ngreat job, and as far as I'm concerned he fell in love with the movie right\nafter having read the script. I like the way his character gives a \"tough\nguy\" image at the beginning and then we discover he's so affectionate and\ntender to his wife. Travolta is obviously the star of the movie and his\nsecond encounter with Bruce Willis in the kitchen along with the scene\nwhere\nhe dances with Uma Thurman is when the movie reaches it's highest\npoint.<br><br>The other star is Samuel L. Jackson, who plays a wise assassin that\nobviously knows how to handle situations. \"And I will strike down upon thee\nwith great vengeance and furious anger...\" is my favourite\nquote.<br><br>Summarizing, Pulp Fiction is a modern classic and a must-see for anyone who\nis at least aware of what a movie is. I give it a 9 out of 10.\n\n"},
{"review": "\nQuentin Tarantino's Pulp Fiction is a terrific film. It also gets\nbetter with each viewing, especially if one of those happens to be on a\nbig theatrical screen where all of the BIG compositions get bigger and\nmore detailed. How much else is there to talk about it after all these\nyears? It's filled with dynamite, sudden and always interesting action,\ngreat and naturally clever dialogue, and memorable characters. Also,\nthe acting is always something to behold as by turns straightforward,\nover the top, subtle, and just downright menacing and spot-on. The\ndirecting is one of the strongest that we've seen from Tarantino, as he\nmakes his choices in pacing with shots in unconventional ways but never\nin a way that would be distracting. And writing, already noted, has\nbeen copied by many, and only equaled by a select few. <br><br>The dance sequence. Samuel L. Jackson's superlative monologuing. It has\nloyalty among low lifes, and many other odd characters that are all bad\nand not one is a villain or hero. And somehow even after years of\nparody and terrible rip-offs, it holds its own and- as one can say\nafter seeing it at a midnight screening- holds its audience as much as\nit had the countless times before they saw it (or if they are, the\nfirst time). The first time you're surprised, the second time you look\nfor the clues or other ambiguity, and then the third time you laugh you\nhead off. The fourth time... I'll leave to you.\n"},
{"review": "\n\n*********Spoiler Warning**********<br><br>When this movie came out a lot of people I knew were making a big deal about\nit because it was made by a guy from Knoxville who even talked about K-town\nin the movie---and guess where I lived at the time?  Most people overlooked\nthat Tarantino was only born there and lived most of his life somewhere\nelse, and both Tarantino and Knoxville are highly overrated.  Trust\nme.<br><br>I can't see why this movie is regarded as highly as it is; it seems the key\nto Tarantino's storytelling is to mix together story elements kind of like a\nblender.  So we get things like the cab driver who's a sexy latin woman\nwho'd look more at home in a luxury restaurant than a grungy cab, or the\nvery seventies looking Samuel L. Jackson running around with the nineties\nlooking John Travolta.  The result is the average person goes \"that's kind\nof strange,\" while the intelligentsia go \"yes, the man is a\nGENIUS!\"<br><br>I put off seeing this movie for several years because of the supposed\nextreme violence and the notorious rape scene.  When I finally broke down\nand watched it I was surprised how tame it was, even the rape scene was\nmostly people shouting behind a closed door.  It was nowhere near as scary\nor unnerving as the one in \"Deliverance.\"  In the end the violence was\nmainly psychological or limited, although the guy getting shot in the car\nand bits of you-know getting everywhere was a real turn-off.<br><br>But really what did the movie in for me was the plot, or lack thereof. \nSupposedly we're getting an homage to film noir and hardboiled fiction\nnovels of the forties, done up in a modern story theme.  What we see on the\nscreen is a confused mess of people running around and doing the most stupid\nthings.  It's not a horrid movie, but there's a lot better ways to spend a\nfew hours.\n\n"},
{"review": "\nSorry for the image, but if you take a bowl of crap, rearrange it, put\nsome sugar and a little cherry on top, what to you get? ... a bowl of\ncrap.<br><br>This is the most overrated film of all time. I'm even feeling strange\nto call it a film. It has no story, no feelings, no plot, no music -\njust 4 different scenes of disgusting, violent, abusive, offending and\nracist content put together in a mixed sequence.<br><br>How this crap scores a 9 on IMDb is beyond me. Sometimes when people\nsee a 9 they automatically deceive themselves into believing this is a\nmasterpiece and that maybe if they didn't like it, something is wrong\nwith their opinion or taste. Nothing's wrong. It's a bad movie from\nbeginning to end. The problem is that sometimes Hollywood movies are\nover-hyped for business reasons like what happened in Titanic and\nAvatar which by the way were \"OK\" movies but didn't deserve the huge\ncredit they received.<br><br>I gave this a 1 because Samuel L. Jackson was the only thing\ninteresting in this disaster. I'm not going to tell those of you that\nhaven't seen it not to, you have to go through the experience on your\nown and make your fare judgment. Don't listen to anyone's opinion -\nespecially the ones that think if you love this one, then you're COOL!\n"},
{"review": "\nYou want to do something really neat? Take the movie \"Pulp Fiction\" and\nre-cut it, so that, instead of being out of sequence, it is actually in\nproper sequence. It can be done. Why do this? Because if you do, you\nwill see what a nothing movie this really is. There is no central plot,\nthere is no real theme, or story or climax. It is just a bunch of\ntricks and overly snappy dialog, masquerading a piece of fluff that has\nas much depth as the kiddie pool. Hey, more power to Tarantino, the guy\nis a Houdini, full of slight of hand. But are we really so simple, that\nwe are ranking this one of the ten greatest movies ever made? Come on!\nOK, I know that Travolta is cool and Jackson is funny. However, let's\nreserve the greatest films of all-time category for real masterpieces\nand real stories, and not some overly slick pulp geared towards video\nstore geeks.\n"},
{"review": "\ni watched the film 20 years later since it's making and attain 0%\nsatisfaction of viewing pleasure considering it's 5h top position on\nIMDb. The movie is an experimental art house crap that chooses no\ndestination and lack brilliant, appealing sketching of it's theme. The\ndialogues are the heartbeat of the film that lose it's rhythm every\nmoment when stretching same words to make viewers understood the\ncharacters's stand, view in perplexing crime world and how they\nperceive.<br><br>The one thing, the film depressingly is in desire of clapping is Bruce\nWillis part of a boxer, who is feared but not a coward. The rare male\nprotagonist with conscience.<br><br>Uma Thurman leaves a desire to see her complicated struggle with drug,\nlust and hunger to live free.<br><br>Tarantino has tried to harvest a violent creativity, but the offspring\nemits extragalactic passion that fail to make any beauty.<br><br>I have watched it and guarantee You waste of time\n"},
{"review": "\nPulp Fiction is often considered the coolest and greatest film of all\ntime. But, the people who usually say this are pretentious film snobs\nand people who think this is something extraordinary. Excuse me, it\nisn't.<br><br>First of all the film has NO plot. If a film has no plot, then why\nshould we care about the unlikeable characters? Second, the diagloue is\nso....BAD. Does the director think people actually talk like this,\nbecause, well they don't.<br><br>Third, the grossly, glamorous violence, is disgusting. This isn't a\nhorror film, so why do we need such violence popping in and out of the\nmovie? So, I urge everyone to avoid the hype of this pretentious,\nterrible mess.\n"},
{"review": "\n\nIs it possible that something so loathsome and awful could actually be\nadored and lauded by millions of people?  Is it only a matter of chance\nthat\nsome movies are loved and others hated, regardless of their content?  I\nhope\nthis is true, because I cannot believe that there is actually anything\ngood\nabout the movie Pulp Fiction to lead any sane, reasoned, drug-free person\nto\nwrite the glowing comments that surround mine, much less the oodles of\npeople who actually handed over their money to see this\nthing.<br><br>Why is this movie so bad, you ask?  Okay, I'll tell you, even though it's\nlike pointing out why windows are transparent.  Starting with the script,\nI\nsee no reason to be impressed by an assemblage of overly stylistic\ndialogue\nand flat, boring characters.  There is nothing amazing about two guys\ntalking about French McDonald's restaurants, and then killing some guys.\nEvery awful stretch of dialogue is dragged out as long as it will last,\nand\nthen some.  It's as if Tarantino said to himself \"I think I can cram one\nmore line about milkshakes in here\".  You have to give him credit for\npadding the film in ways that nobody's ever tried before.  The actors look\nas though they're doing their best to salvage this turkey (and they are\ntalented), all the while knowing in the back of their minds how much of a\ncow pie the whole thing is.  As far as Tarantino's directorial style is\nconcerned, he should just get himself a career in Nike commercials because\nthat's where his talent level cuts off.\n"},
{"review": "\nSo there is a lot of hype surrounding Pulp Fiction. It won Original\nScreenplay. It was nominated for six other Oscars including Best\nPicture and Best Director. I see it is given four out of four stars if\nit is on TV. It is also in IMDb's Top 250. (But) what is the big deal\nabout it? I was bored and disappointed. Pulp Fiction did not really\nmake a whole lot of sense. I can not remember if it was nominated for\nediting or not. If they wanted to be in that category or have a better\nchance at winning then obviously more editing should have happened. I\ndo not see the point of Vince and Mia's date. All if not a lot of that\nshould have been cut. Why drag on Bruce Willis being on the run from\nthe mafia don? That took too long. Was the whole story about the watch\nnecessary? Couldn't Bruce and his woman just talk about it? Aside from\nbeing disappointing and boring Pulp Fiction was confusing. Bruce shoots\nJohn Travolta. And kills him. So how is he alive in The Bonnie\nSituation? Does Quentin Tarrantino not like editing too much? Well more\nediting could be needed a lot of times.(PF hint hint.) So yeah Pulp\nFiction was boring, disappointing, confusing, etc. It should not have\nwon Original Screenplay. It should have gone to someone else but if all\nfive nominees were bad then it should have been none of them. Too much\nhype. Too much movie. Overrated. I can not remember much of this movie\nand happily so. So what is such the big deal?\n"},
{"review": "\nI have to agree with those reviewers that find this film disjointed,\noverly and unnecessarily violent, and just plain difficult to\nunderstand. I, for one, fail to see how this movie resurrected the\ncareer of John Travolta as his performance was just totally\nunbelievable. Focusing on what appears to be several unrelated life\nexperiences, Tarrantino once again utilizes his penchant for violence,\ndrug addiction, rape, and other assorted seedy topics. The plot (if you\nwant to call it that) is non-existent and the scene involving Ving\nRhaimes is just flat-out disgusting. For Tarrantino fans, this may be\nthe ultimate. But for me, it's just not a good film.\n"},
{"review": "\nAbsolutely no idea why this film is so popular. I was bored out of my\nmind from the first scene to the last waiting patiently for a twist of\nsome sort to tie the multiple stories together, which never happened.\nProbably my least favorite movie i've ever watched. The acting wasn't\nbad and the film did tie in some aspects of popular culture and\nprevious films, but if the viewer doesn't give a crap about any of the\ncharacters whatsoever, or the plot(if you could call it that), then\nwhats the point. I gained nothing from watching this movie besides an\nintense feeling of emptiness that usually comes after wasting 150 or so\nminutes of your life watching a pathetic piece of crap film about\nnothing. Was I at the edge of my seat, yes, however It wasn't because\nof the suspense, I couldn't keep my head from falling forward or my\neyes open. And the way that the scenes were arranged, terrible. The\nmovie memento is hard to follow sometimes and slightly dull at some\npoints but at least there was a freaking point in the way the scenes\nwere arranged, considering the main character had memory problems. In\nthis movie, there was no reason for the random mix up of the scenes,\nexcept to just do something different and make a movie so weird and\ndisgusting the critics think its a masterpiece. I usually like movies\nthat are critically acclaimed, like The Godfather, one of my favorite\nmovies, but Pulp Fiction isn't even in the ball park. There isn't the\ndark complex characters like in the godfather, just a bunch of rambling\nidiots tripping over their stupidity.\n"},
{"review": "\nPulp Fiction is one of those movies you feel uncomfortable to talk\nabout in negative terms since mainstream loves it. The real killer of\nthis movie are the dialogs supposedly so cool but instead being silly\nand irritating, from the very first scene when endless minutes are\nwaisted talking about a frivolous argument. The violence in this film,\nrather strong, is very often disturbing but never fun or entertaining.\nTarantino takes himself a little too seriously making the movie lose\nmost of its ironical aspect. Unless you are a fan that goes wild for\nthe overweight Travolta, you will find his so-called cult scenes dull\nand of no interest. All the characters in this movie are exaggerated,\nand that wouldn't be a bad thing, but they also are not fun. There are\nsome good action scenes, very few, which anyhow will not save from\nfailure a movie that lasts 2hrs 40min!\n"},
{"review": "\nWhat is it with this film? What IS IT!?!? Gangsters walking and saying\nabsolutely nothing. A lot of idle and boring dialogue. Boring stories.\nClichéd camera angles and borrowed materials from other films. And a\nwhole lotta f-words to fill a space-cruiser. Some acting is good, but\nthat's the actor for you...<br><br>Everything else is empty, empty, empty... Peer-pressure and the moronic\nmasses of people say this film is \"a masterpiece!\" How? Because they\ntalk about Quater Pounders with Cheese? Because of the \"morale\" of the\ngangster? What morale? \"We cool?\" \"We cool.\" Yeah those phrases have\nabsolute impact...ooh hoo, bobby!<br><br>Yeah this is \"the movie that re-defined cinema\"... without re-defining\nit at all.<br><br>Skip this trash and watch something else... for the love of\nmovies,please do that!\n"},
{"review": "\nThis is, in my opinion, the most over-rated film of all time. Sure,\nthere is some snappy dialogue here and there, and Tarantino has a good\near for music, but none of this warrants the gushing praise heaped upon\nthis movie, nor the godlike status bestowed upon Tarantino himself.<br><br>It's over-stylised, over-loud, over-acted, (sorry Samuel, Tim, John,\nUma &amp; Bruce) and the non-linear narrative so favoured by the director\nsimply doesn't work.<br><br>But it's fashionable, so it's popular.<br><br>By the way, this is one of the few films where I've actually seen\npeople get up and walk out of the cinema before the end, so I guess I'm\nnot the only one who didn't like it.\n"},
{"review": "\n\nThis is a great film? By what standards? Anyone can string together a\nbunch\nof violent, disjointed scenes, designed to shock and disturb the viewer.\nViolence, in and of itself, without context and pertinence to the story,\nis\nthe tool of no-talent scoundrels masquerading as filmmakers. Such,\nunfortunately, is Tarantino. What a shame for Travolta that this was his\n'comeback' film. For me, the only watchable part of this film was the\nsequence featuring Bruce Willis. Even that, though...how Willis was\nconvinced to be in this film is a mystery to me. Cameos by Emil Sitka,\nChristopher Walken's brief part, and Harvey Keitel's appearance cannot\nsave\nthis self-indulgent and troubling example of a director gone wild,\nsuffused\nwith the sense of his own talent. This was a BOMB.\n"},
{"review": "\nWhen Pulp Fiction hit the theaters it had an incredible word-of-mouth\nrecommendation. And Palme d'Or cemented its reputation. Bear in mind,\nit was before internet was relevant and watching movies online was\npossible. Therefore it was a must see. And after the movie i was\nsatisfied but also asked myself self: Was that it?<br><br>Some years down the line i've seen more contemporary TV shows from the\nUS and it became clear why Pulp Fiction stood apart. As the title\nsuggest it is a pulp novel brought to screen, done brilliantly, if you\naccept there is an extraordinary way to do a below-average thing. Why\nthe critics saw a masterpiece in it is hard to explain, but it simply\nisn't. There were other things where Pulp Fiction excelled. For\nexample, the soundtrack became an inevitable part of any CD collection\nat the end of the 20th century.<br><br>The way i understood Tarantino after watching some interviews, he is a\nmovie buff and makes movies he always wanted to see. Although not the\nonly to try this approach, he is one of the lucky few that made a\nliving out of it.<br><br>Overall, Pulp Fiction is an exercise in marketing. The title, as well\nas author's statements, suggest it is an entertaining movie. However, a\nlot of people read higher meaning into it, elevating it's reputation to\nbeing one of the best movies of all times.\n"},
{"review": "\nPulp Fiction is a movie all credited to its director....Mr. Q. T. This\nmovie is such an amazing and fast track of events all tied up nicely\nand cohesively that one can't deny its grandeur.<br><br>But here comes the boom. It is a highly un-required movie that is\noverrated just due to its above mentioned qualities. But when something\nis made there must be a purpose behind its existence but the film is so\nuseless and itchy that in my opinion this film is not the best film in\nhistory of cinema. Yes the film has a huge potential to influence movie\nmaking and direction but it itself is nothing but a crap of laughable\nand senseless events.<br><br>So to mention Sir i am not buying any of this movie but lets just\nconsider the direction and cohesion of events.\n"},
{"review": "\nThis movie is definitely the most overrated piece of sh*t ever.<br><br>No story, no plot, no message, just Tarantino so totally in love with\nhis own \"witty\" dialogue.<br><br>The movie is empty in every sense of the word. In addition, it's also\nhorribly boring and therefore ridiculously hard to watch. I always try\nto sit through every movie I start, but damn, with this one it was a\nhard task not to simply get up and walk away.<br><br>Pulp Fiction does not deserve to be on top of IMDb's list of best rated\nmovies with actual masterpieces like \"The Shawshank Revenge\". The\nlatter is a work of art, Pulp Fiction is merely a piece of sh*t dressed\nup as one and it's amazing how many people fall for it.\n"},
{"review": "\nThis whole movie is empty really empty. I'm not saying every movie has\nto give message 'cos i don't believe in that. But this so-called\nmasterpiece seems to be about nothing.<br><br>Events are unconnected. What is Uma Thurman's character's almost dying\nhas to do with the Bruce Willis' boxer storyline? What's boxer\nstoryline has to do with the main characters? Or, why is there a boxer,\nit all seems unnecessary.<br><br>Now, please tell me how this 'work of art' can described as\nmasterpiece? Because of the directing, famous soundtrack or acting? I\ncan say OK to all that but this movie only contains unconnected events,\ncharacters and has no main storyline and we don't know what this is\nabout?<br><br>I can hardly say Tarantino is a big director. I can't call a man full\nof emptiness and bulls**t a master. His only film i like is Kill Bill\nwhich surprisingly different from this garbages, has a main storyline,\nnow's where to going and i can only name Kill Bill a masterpiece.\n"},
{"review": "\n\nPulp Fiction in my opinion is the most overrated movie of all-time.  I\nreally don't understand why many people claim it to be one of the greatest\nmovies ever.  It's cruel, stupid, idiotic.  It's full of violence &amp; f-words\nto the point that it's sickening.  It's like, let's get a couple of guns, a\ncouple of f-words, a couple of murders and let's combine them to make a\nmovie.  I hated everything about it.  EVERYTHING.  To me, all the positive\ncomments on this site about this movie are written by only 1 fan under\ndifferent usernames.  So the scenes were not in chronological order, big\ndeal.  That doesn't make it a masterpiece.  This is hollywood garbage. \nThere are some scenes that are sick.  The movie is SICK.  This is my review.\n I gave it a 2/10 just because the actors are respected.  Everything else is\nidiotic.\n"},
{"review": "\nYes, that's right. Crap. This film is just that. If you take a closer\nlook at f.ex. Bruce Willis, who seems to make people scream their head\noff every time he's near the screen, you can clearly see that this\nperson lacks personality. He has two expressions: One that says ON,\n(with a little wrinkle above his nose) the other is of course OFF, when\nhe's asleep. a machine of a man, which perhaps cries a bit when he\ncomes home, because he's in desperate need for a personality, some\nfeelings, a higher IQ and an even bigger paycheck.<br><br>Why this person has become so popular has to do with you mindless\npeople out there. Voting, cheering and stamping your feet for\ntalentless and retarded actors, musicians, artists etc. That is why\nthis world goes straight down the toilette. Making your modern remarks\nthat everything is so \"Cool\" all the time.<br><br>Pulp Fiction is at best a bad joke from a below average director. There\nis no inventions, no good or natural acting, no deeper meaning with\nthis movie at all. Just exploitation.<br><br>The era of good movie-productions are long gone. Classic actor's like\nChaplin, Bogart, Cooper, Peck, Holden and Quinn don't get born any\nmore. Today it's just you gray and unpersonalized people out there\n(With some exceptions), watching to see if there's something that can\nkill your brain even more, with splatter and gore above your ears.\nYeah, you're a really \"cool\" bunch, drowning on dry land.\n"},
{"review": "\nI really find it difficult to believe this movie is rated highly by\npeople. It's hands down the worst movie I've seen in my life (58\nyears). When my wife and I went to see it, soon after it came out,\nmultiple people walked out of the theater saying either it was a\nterrible movie and/or it sickened them. Maybe all of us were just\nallergic to Tarantino's sick fascination with violence. The violence is\njust so gratuitous and casual as to make it seem like a bad video game.\nOutside of that, the overall movie has the feel of being viewed through\nthe eyes of someone high on bad drugs. Please excuse my lack of\nspecifics regarding the film, but I've fortunately blocked most of them\nfrom my memory. In any event, I worry about a society that thinks this\nis a good film, I really do.\n"},
{"review": "\nThe hugely overrated trivial chatting, the grotesque violence, the\nmoral vacuum, the deadly slowness, the length --- about an hour too\nlong --- make it incomprehensible today how this picture ever made\npeople rave the way they did on this board.<br><br>The greatest film ever? Excuse me, this is a feature film that says\nnothing, depicts no authentic feelings or character development, is\ngrossly self-indulgent and filled with idiotically implausible\nsituations, such as people firing powerful handguns repeatedly,\nsimultaneously and then hanging around chatting as if nobody would ever\nreport the firing and summon the law.<br><br>Perhaps the most implausible character of all is played by Mr\nTarantino, who shouts at the two hoodlum killers as if they were\nplaymates from school and complains that his wife will divorce him if\nshe returns from work to find a car in the garage containing a man with\nhis head blown off.<br><br>Where is the moral compass of the people who revere this schoolboy\nnonsense? Nobody in the film is remotely principled, and nor is anyone\n(except possibly the pawnbroker) actually evil. The scene where he\nreleases a leather-studded sadist from a cage is possibly the most\nunbelievable rubbish ever deployed in a Hollywood feature.<br><br>\"It's only entertainment,\" I hear people protest. Well the difference\nbetween Mr Tarantino and film-makers of stature is that they are\ncapable of entertaining while instructing, and of integrating the two.\n"},
{"review": "\nPulp Fiction, despite borrowing from just about every movie ever made, is\nthe most invigorating cinema experience a filmgoer can ever hope for. Its\nhodgepodge of violence, mayhem, and generally deviant behavior is an\nassault on the senses, not to mention political correctness. However,\ndespite all the film's cleverness and style, it hinges on the performance\nput forth by Samuel L. Jackson as Jules. The fact that he was denied an\nOscar is a downright shame. Martin Landau, the best supporting actor winner\nthat year, was terrific and funny in Ed Wood, but Jackson was perhaps the\nmost commanding screen presence in film history as the bible-quoting,\ngodfearing hitman. The last scene in the coffee shop with Tim Roth still\nsends chills down my spine, no matter how many times I've seen it. Rumors\nof a prequel involving Jules and Vincent (John Travolta) have been floating\naround lately. If Quentin Tarantino wishes to regain the fans he lost with\nthe dissapointing (but still pretty good) Jackie Brown, he should get to\nwork right away. I'll be the first in line to see the finished product.\n\n"},
{"review": "\nI don't know why people like this movie. It is a mess of violence &amp;\ncurse words, none of it makes any sense at all. I think it is one of\nthe worst movies I have ever seen. It literally took me a week to watch\nthis movie. I would watch for about 10 to 15 minutes at a time &amp; then\nhave to turn it off. My friend at work would tell me to keep watching\nit &amp; I finally did. This movie is full of senseless violence, torture,\nrape scenes, horrible dancing &amp; stupid dialog. The only thing it\ndoesn't have is a cohesive story line. Watch at your own risk. I really\ncan't think of one good thing to say about this movie other than the\nfact it has some well dressed characters in it.\n"},
{"review": "\nthis is everything i don't want to see in a movie. when i watch a movie\ni would at least hope for it to be more excited than my own little\nexistence at my little house in the dead of winter. id rather watch\npaint dry. And its as if they did it all on one take. the acting is the\nonly halfway descent thing about it, and thats because of the obvious\ntriple A lineup.<br><br>this movie is very boring. flat out. i have seen more action and better\nwriting in a Spanish daytime drama. there seems to be about 8-9 short\nfilms one after the other, with only slight relevance to one another.\nwhile me and my wife hated this movie, we love all of the inside jokes\nwe play about with each other now, like how when we go out for icecream\nand we get a cherry, my wife dramatically sucks and licks the cherry\nfor 5 minuets making fun of the jackrabit slims scene. i actually\nhighly recommend watching this movie so you can see how horrible it is\nfor yourself.\n"},
{"review": "\nQuentin Tarantino is a good director who has a knack for combining\nwildly imaginative music selections for his movies that seem to work so\nwell you have to laugh with joy.<br><br>He also is known for dark comedy, combining unexpected twists that\ndismay audience members to the point they often refer to him as a\n\"genius\".<br><br>The problem with \"genius\" is that what is genius to some is mundane to\nothers. <br><br>Tarantino is also known for his plot twists. However the excessive\nfocus on plot twists creates an expectation from the audience, which\nopposes the basic appeal: the element of surprise.<br><br>In Pulp Fiction, twists are introduced with little finesse. Tarantino\nhas improved with the years, but Pulp Fiction, an early film, becomes\nboring before it is over.<br><br>Certainly worth watching, but early and raw compared to Tarantino's\nlater films.\n"},
{"review": "\nThis is pure sh*t. Movie without normal plot and characters. Only part\nwhich is funny is when Samuel L. Jackson interrogates that dude in the\napartment. Bruce Willis has no part in this movie,he just sit around\nand rage's about some watch which his father carried in the a** during\nworld war. Not to mention that stupid gay part...no comment on that. It\nwas suppose to be a bad a ss movie and it was just pure sh it. Quentin\nTarantino go direct and produce some third-class Chinese shi**y movies.\nThis was suppose to be in a bottom 250 movies not in top 10. People are\nso stupid and like shi**y movies. John Travolta just dance in this\nmovie and shot a guy in the face but nobody gave a fu*k because it's so\nstupid movie.\n"},
{"review": "\nThe movie is as bad. If Aleksandr Nevsky directed it it would be very\nvery wonderful. YOur Tarantino is no talent he is in a shadow of\nAleksandr Nevsky. His movies are not badass nor funny. Aleksnadr\nNevsky's movies are actiony good sotry and good jokes. the movie has\nnot script it was directed on the go. Tarantino no scirpt means bad\nbusiness. I thought the movie is gonna be as beautiful as Treasure\nHunters by Aleksandr Nevksy but it is no. No no no just very really no.\nAvoid your spending time of life on this garbage go and watch Aleksandr\nNevsky's movies. They are very underrated. Pulp fiction is overrated\nbecause Tarantino is no Aleksandr NEvsky. I know good you know bad.\n"},
{"review": "\nTo contradict my summary line, this film is actually one of the least\nappealing films I have ever seen. It's violent, disgusting and crude,\nand none of these are particularly bad traits, its just that it offers\nme nothing, and leaves me with an emptiness, the fact that I have\nwasted 2 1/2 hrs watching this, then not to be compensated.<br><br>This is entirely my opinion, and clearly mine alone. Nearly everyone\nloves this film, and they are honest enough to clarify it, but if my\nreview is completely the opposite, I still feel compelled to write.<br><br>I'm sorry, but 9th on the list of the top 250 films, seems grossly\ninappropriate.\n"},
{"review": "\nBoring. Rubbish Film as per most of Tarantino's stuff. The only good\nfilm Tarantino ever directed was the first half of 'Dusk till Dawn'.\n'True Romance' was good as well,though he didn't direct it. It was also\nlet down somewhat by Tarantino's poor dialogue (see Patricia Arquette's\nspeech where she reveals she's a call girl. Appalling dialogue. Very\nTarantino.) I recommend you spend you time better by watching all the\nfilms he's paid homage to (ripped off) such as 'Vanishing Point',\n'Death rides a horse', 'the Baby Cart series', The original 'Inglorious\nBastards' etc Tarantino and his rehashing of films which have passed\nout of the collective conscious is pretty unpleasant and not clever.\nThe whole point of taking influence from other people's work is to then\ncreate something of your own which is greater than the sum of its part.\nThis Tarantino fails to do repeatedly.\n"},
{"review": "\n\nGolly, everyone is falling all over themselves about this one.  Why, please?\nIt's silly violent, nihilistic, pointless.  And every character has the same\nway of talking -- talking about clever things in that pseudo-way that only Quentin could possibly dream up.  Ooooooh, the talent!\nPass.\n"},
{"review": "\n\nWhy did people like this?<br><br>Tiresome streams of pop-culture references?(\"like kane in Kung Fu\" \"Elvis or\nBeatles? Brady Bunch or Hogan's Heroes? Buffy St. Marie or Dusty\nSpringfield? Leo Sayer or Captain &amp; Taneall?\")<br><br>mundane out of context dialogue?(\"wow this coffee sure is good. I didn't\nexpect you to have such good coffee.  this is one mean cup of\njoe!\")<br><br>Hip depictions of Drug Culture.?<br><br>It's annoying bellyflop into the middle of the retro craze fashion\nherd?<br><br>one dimensional characters pointing guns at each other's heads? (the\ncheapest, most half-assed, most cliched way to generate drama = person\npointing gun at another person's head.  And yelling. over and\nover.)<br><br>\"cool\" sunglasses?<br><br>Take these things out, and the movie still isn't very good. Leave them in\nand it's trendy and annoying.<br><br>If you are a teenager and don't know anything about HK films, films from the\n70s, or the 70s in general, are easily duped by hype, I urge you to see this\nmovie. It was made for you!! It will TOTALLY BLOW YOU AWAY, MAN!\nDude!<br><br>\n"},
{"review": "\nSometimes after seeing a lot of good movies people want to watch\nsomething undefined and different,but it does not necessarily mean that\nthe movie is good.When the theme song is the best part of the movie you\nsurely can understand the quality.Sometimes ranking and charts do not\nshow the real picture,this movie does not have a good story,a good\nscreenplay or good dialogues but still it is in the top 10.But believe\nme this movie can neither give you entertainment nor any sense of\nunderstanding.Yeah i agree the movie is not boring,but it is not\nenjoyable either.Movies like shawshank redemption,godfather or lord of\nthe rings,all of them has a magic-feature.Sometimes it is\nscreenplay(Shawshank redemption) sometimes its dialogue(Godfather)\nsometimes it is the story (The lord of the rings) .But all of them had\nthe important feature called continuity.I think it is a very important\nquality of a movie to keep it's continuity.This movie is divided into\nfour parts which actually made the movie look like a comedy-puppet\ndance just with humans(Because the parts do not define one-another).\nThe most embarrassing thing about this movie is after watching it you\nwill think who is the fool yourself or the writer and directer.Yes this\nmovie is different but not always Difference make something great at\nleast in motion pictures at least.Whatever this is a must see movie for\nall because you can differentiate the better movies after watching it.\n"},
{"review": "\nPulp Fiction is good, but it's not as good as Reservoir Dogs. The\nreason for this is that after his debut with Dogs, Tarantino no longer\nfelt obliged to make his films in any way realistic. I know Dogs is\nderivative and probably not even realistic, but there is a certain\nsuspension of disbelief - a humbleness in terms of realism - that\nTarantino never felt obliged to observe again.<br><br>I love The Bonny Situation especially. I love many aspects of the film.\nBut it's too retro and silly. Dogs is more real and shocking.<br><br>Jackie Brown I feel he tried again to get the realism, but since then\nhas simply not bothered. It's like he's said to himself: to hell with\nit... this is the way I am...\n"},
{"review": "\nThis movie is junk I've watched it twice I honestly don't see what\npeople see in this garbage. Acting okay storyline garbage and\npredictable. I've seen this exact movie in 3 other totally different\nmovies it's not original, it's an overrated thing just like breaking\nbad, game of thrones, the kardashians, and celebrity babies. This is\ngarbage at its stinky's pulp fiction, pulp reality don't judge\nsomething on what other people think at the end of the day watch\nit,read it,play it,buy it, You have the power don't listen to me watch\nit you can be the judge. The movie isn't my favorite it sure isn't the\nworse its definitely not the best it's overrated and transformers is\nbetter.\n"},
{"review": "\nThis movie was alright, I mean I understand it but maybe I just don't\n\"get\" it. It's a pastiche (which is a fancy word for a positive,\nnostalgia like satire) of pulp crime movies. Okay. That's a fine\npremise but the rest of the movie does not compute. I enjoyed the\ncircular and completeness of the plot but it's strange when considered\nin light of the characters and the themes. I think far too many people\ntake this movie at face value, and that value is a little\ndisappointing. I enjoyed all the actor's performances and undeniably\nthis movie has set a genre and a wealth of movie clichés. But it's\noverlong and cringe-worthy at points. I just don't think it's a\nclassic.\n"},
{"review": "\nI was very underwhelmed by this film. I thought thought that the\nperformances, while excellent given the flimsy material, were so\nunfounded in depth of character which made me think \"ok, why should i\ncare whether he dies? or whether she dies? or whether he cant pay back\nthe gangsters?\" I found the interwoven stories to be a nice idea\nhowever the sheer length of each story for approximately 15-20 minute\nintervals made me lose any interest i had with the previous characters.\nTo this end the film became this consistently unfunny, boring, benign\nexperience to which there was no reason to care about the characters,\nthe plot or the subtext, and the ending while clever was very\nlongwinded with no beneficial or worthy climax.<br><br>3 stars given for 1) John Travoltas performance 2) occasionally witty\nlines/conversations 3) the opening scene in the diner\n"},
{"review": "\nOne of the worst movies I have seen. Sure, the dialogue is interesting,\nbut pointless. If I wanted to have conversation about random things, I\nwould just talk to my friends. I don't want to hear Samuel L. Jackson\ntalk about television or John Travolta about European travel. I don't\ncare. This movie could have been about 1/4 as long as it was. The jumps\nback in time serve no purpose. It seems like Tarantino tried too hard\nto make something different and strange. It just didn't work. So if you\nlike random violence and cursing, this movie is for you. Violence and\ncursing doesn't bother me in movies, but in this film it just seemed\nforced. It did not piece well together or flow. Poor job of writing\nthis time around in my opinion.\n"},
{"review": "\nOK first of all I saw this a little while ago and I don't see how\nanybody could like this film except for the stars: John Travolta,\nSamuel L. Jackson, Uma Thurman, Peter Greene, Bruce Willis, and Ving\nRhames. The plot is all messed around and unorganized making it very\ndifficult to understand. The Characters are all technically bad guys.\nLike I said the only good thing this film has to offer is the acting.\nOverall the film makes very little sense the way it is told, the\ncharacters are all unlikable. I really believe that if any film should\nget rated way lower than a 0 out of ten, this is it! I mean just how it\ngot as high as an 8.9 out of 10 is beyond me. I'd continue on ranting\nabout how bad the story is written but this film just isn't worth\nanymore time. Please if you're wanting to see a great crime film go\nwatch Goodfellas(1990) and if you want to go see a good action film go\nwatch the Hunted(2003). This film rated from me is only a 1 out of 10\nsince it did have many famous and good actors but Mars Attacks is way\nbetter and that was a comedy film!!!\n"},
{"review": "\nWhile I am in no way against gore in a movie, I found the fact that\nthis movie exploited it so badly, that the plot was so stupid, and the\nacting so completely idiotic (and I like these actors/actresses) that\nthis is by far the worst movie I have ever seen. Far worse than any of\nthe famously bad cult/monster movies of the 50's-60's. never could\nunderstand how anyone could ever have thought this movie had any\nredeeming qualities, much less actually liked by anyone. The movie is\nso bad, it prompted me to register with IMDb to add my vote. Wish I\ncould vote a zero...as in the movie never should have been made. Could\nnot imagine a greater waste of time or talent.\n"},
{"review": "\nI watch it last night after reading millions of praising reviews for it\nand i was hoping i would see a spectacular classic movie but i was\ndisappointed a lot..I agree Music was good..great cast..but something\nwas lacking in it...movie ends and i was hoping it should have better\nend although climatic speech was good..... some 3 interrelated stories\nare combined by the Tarantino..dialogs are average entertaining with\nlots of f stuffs..you would hate scene of accidental shootout and\ncleaning brains stuffs after it so it's cruel, stupid, idiotic. It's\nfull of violence &amp; f-words to the point that it's sickening...it should\nbe carefully viewed and analysis....you can have glimpse of dark\nhumor..yeah i agree acting of Uma Thurman is good but why the hell\nTravolta nominated for Oscar.. but two and a half hours was too long in\nmy view ...I will give it 7 out of 10 due to good casting and music and\nits average movie for me but it does not deserved in IMDb top 250 and\nit was not touching in any sense..\n"},
{"review": "\nSome observations:<br><br>1. Anytime your most admiring audience is comprised of 17-year-old\nmales you know you're in trouble.<br><br>2. Anytime the most common adjective used to describe your movie is\n\"cool\" you know you're in trouble.<br><br>This is a silly, juvenile, vulgar movie. Tarantino should have had the\ncourage to make a cheap, violent, trashy Hollywood-style movie and been\nproud of it. Instead, he made a cheap, violent, trashy, Hollywood-style\nmovie and hid behind the \"irony\" façade. Works for 17-year-olds,\ndoesn't work for the rest of us.\n"},
{"review": "\nThe story development is very poor, and has very long dragged scenes\nthat add nothing to the story. The non-linear and looping time order of\nthe scenes smacks of an effort to cover up the lack of coherence in\nplot and character. The movie is like several episodes of a TV show\nthrown together.<br><br>Some sequences, especially one involving bondage harnesses and\nhomosexual rape, have the uncomfortable feeling of creative\ndesperation, of someone who's afraid of losing his reputation\nscrambling for any way to offend sensibilities. <br><br>The actors are doing a fine job with the crap they are given. However\nthe distinct lack of a coherent plot, the disjointedly interwoven and\nhalf-baked story lines, the absence of characterization and incorrectly\nusing of the music, makes this movie a good example of bad Cinema!\n"},
{"review": "\nI have watched 75% percent of this film twice: the first time, I\nwatched it on TV, and about 3 quarters of the way, I gave up...\nHowever, due to the film's cult following, I gave it another shot (and\nwatched it to the end) and, to be honest, I didn't like it anymore than\nI did the first time I watched it...<br><br>Why is that?<br><br>First of all, it was utterly chaotic for the most part. It felt like\nthose experimental, amateur films, which I personally didn't like at\nall...<br><br>Then there were the conversations within the film: as always with\nTarantino's films, obscenely profane and crude, plus they get\nnowhere...<br><br>Moreover, I found it over the top violent. Obviously, the storyline\nwouldn't be the same without all the violence, but at times I found it\nto be overdone on that department...<br><br>Lastly, I found the script to be utterly appalling, in true Tarantino\nfashion, and nonsensical at parts...<br><br>I only liked one thing about Pulp Fiction: the acting. Everyone did\ntheir best and in the end, wasn't the actors that disappointed me, but\nthe film's script...<br><br>So, the verdict:<br><br>It might be that I dislike everything that involves Quentin Tarantino,\n(his signature obscene violence and cruelly long, pointless and crude\nconversations have always appalled me) but I cannot give this film more\nthan a 3 out of 10. For me it was painful to watch, only to reach a\ndisappointing ending. Utter loss of time! But then again, it seems I'm\none of few here on IMDb that disliked Pulp Fiction...\n"},
{"review": "\nI really don't know what the big deal is. This is obviously another one\nof those \"highly intellectual\" movies I am too stupid to understand.\nThe critics compare it to \"The Godfather\"... I find that to be\nsacrilegious! I agree with one critic only when he states that the film\n\"presents meaningless issues in an intensely-fascinating and almost\nlyrical fashion\", and I would like to put a big emphasis on\nMEANINGLESS!!! How can something meaningless be good?<br><br>Another famous critic, Roger Ebert, claims \"Seeing this movie last May\nat the Cannes Film Festival, I knew it was either one of the year's\nbest films, or one of the worst. Tarantino is too gifted a filmmaker to\nmake a boring movie, but he could possibly make a bad one...\" That is\namazing! One of the world's most acclaimed film critics watches a\n'masterpiece', and right after that cannot decide whether it is really\na masterpiece or garbage? Then he goes on to say, 'oh, but it can't be\ngarbage if such an in-director made it, so it must be a masterpiece'.\nSo much for competent individual judgment... I suppose you would not be\nable to call yourself a critic if you wrote that Tarantino simply\nscrewed up this time...<br><br>In my opinion, the film has a ton of famous actors, an \"in\" director,\nand nothing else. The plot is practically non-existent, there is no\nmessage, no \"higher\" meaning, nothing but violence for the sake of\nviolence..., and above all, it does not entertain either! If this is\nart nowadays, I want to go back to the past!\n"},
{"review": "\nThis is for all the guys who voted to make this movie a masterpiece. I\ndon't know on what everyone depended in evaluating this movie. Everyone\nagrees that the cast includes some of the best actors out there, but a\ngood cast doesn't mean that the movie is a masterpiece. This movie was\nwithout a subject, no message, too much repeated sentences, nothing\nconnected with each other. You will get tired of listening to\nduologue's about \"foot massage\", \"hamburgers\", \"Butch's fathers watch\"\n.\u0085etc, these things cover more than a half of the movies length without\nmeaning anything to the movie.<br><br>I was very disappointed when I saw this movie. This movie is way\noverrated and should be among \"IMBD 100 Bottom\". If you want to waste\ntwo and a half hours listening only to duologue's without a subject\nthen this is the movie and if you really want to know how a masterpiece\nlooks like then you should watch The Shawshank Redemption.\n"},
{"review": "\ni don't why people had ranked this movie so high but there is nothing\nin this movie which is good expect john and Jackman Samuels\nacting.................this is slowest movie i have ever seen the parts\nlike start with boss wife is not needed..................... when i\nhave seen rating of this movie i was really exited to see it i bought\nthe movie CD when i stated watching movie is good at start it attracts\nmine interest but after the two stories the third seems much boring and\nafter that the others are also boring and does not make any sense i\nthought that there will be any suspense in the last part but what i\nthought was crap so movie is much much below mine expectations.......\n"},
{"review": "\nThe 90s sucked. It was one of the major eras of entitlement, and\ndagnummit, Quentin Tarantino was ENTITLED to the stylistic gimmicks he\nabsorbed from French new wave, 70s exploitation and martial arts films.\nHe was entitled to use every character as a mouthpiece for his\npreciously quirky, offbeat voice. He was entitled to that word that\nmakes Spike Lee mad when white people use it. He was entitled to co-opt\nobnoxious heroin- chic, \"hip\" retro-fauxhemian fashion trends.\nTarantino's movies echo the problem with Modernism: okay, you think the\nstatus quo is Bad, but if what you do is just a kneejerk reaction to\nthat status quo with no values, ethos or any sort of moral core, how\ncan you be sure the result won't also be Bad? In fact, chances are it\nwill probably be Worse! Right? Nonsense. The emperor doesn't appear to\nhave clothes, but that's just because only the most profound, virtuous\npeople can see them. You want to be part of that group, right...?\n"},
{"review": "\n\nIt seems to me that much of the stylistic elements of the movie were taken\nfrom the 1955 film Kiss Me Deadly.  Kiss Me Deadly was full of quirky\ncharacters and had a mysterious chest which contained a glowing object.  The\nmain difference in style was that the humor in Kiss Me Deadly is much more\nsubtle, while Pulp Fiction is trying real hard to get a laugh or a reaction.\n Because of that, I feel that Kiss Me Deadly is the far superior of the\ntwo.\n"},
{"review": "\n\nAfter 4 years, I still consider this the worst movie I have ever seen.  I\nhave yet to watch any thing else with QT's name attached to\nit.\nEverything about this film is annoying, (the presence of the ubiquitous\nSam\nJackson and Steve Buscemi, the weak attempts at shock value, the cameo by\nthe director) but the one\nelement that makes this number one on my all time worst list is the\nobnoxious dialogue that tries to be hip and funny.  THREE'S COMPANY reruns\nhave better dialogue (and I hate that show). It's such a shame though,\nbecause QT and I do have a lot of the same obscure tastes in movies. My\nadvice is to try a project that tries not to be shocking, funny or hip,\nbecause PULP FICTION fails in all three departments miserably.\n"},
{"review": "\n\nThis is one of those movies (like \"Fargo\") which expects the audience to\nlaugh about the most cruel scenes of violence. That's not only disgusting\nbut even dangerous, because in spite of \"It's only a movie, you know\" we all\nshould know how influential screen behaviour might be, don't\nwe? \n"},
{"review": "\n\nI saw this movie on video, after hearing all sorts of movie critics\npraising\nTarantino's masterful use of \"multiple narratives\" in this film.  I\nsuppose\nI was expecting something along the lines of \"Rashomon,\" which was\nprobably\nsetting my expectations too high.  There are three story lines (two and a\nhalf really--the Tim Roth-Amanda Plummer story is not sufficiently\ndeveloped), only one of which is really interesting: the final story,\nrevolving around Bruce Willis.  And that story takes up maybe one-quarter\nof\nthe movie.  The remainder is filled with the John Travolta-Uma Thurman\nstory\nline, which would have been interesting in the hands of a more talented\nwriter or director than Tarantino.  The most interesting character is\nKeitel's--a great movie could be made of him, but he is on screen for only\nabout ten minutes.  Tarantino does a nice job of exploring the \"banality\nof\nevil, but the \"hard-boiled\" dialogue is more often artificial and\nembarrassing, and when he runs out of expletives, he resorts to violence.\nAs for the multiple story line concept, it's wasted here.  Tarantino\nactually did a better job with interweaving multiple story lines in\n\"Reservoir Dogs\" (another flawed film, but for different reasons).  And\nregarding what's in the briefcase--ultimately, who cares?\n"},
{"review": "\nI will never understand why Pulp Fiction is hailed by so many as one of\nthe greatest films ever made. Quentin Tarintino's first film Reservoir\nDogs was amazing. It had excellent performances, some good action\nscenes, an impressive structure and fantastic sound track. When Pulp\nFiction came out in my country in October 1994, i could not wait to see\nit. Empire Magazine gave it 5 stars. I remember when i went up to\nGlasgow to see it with an anticipation i had not felt since i had went\nto see some thing like Star Wars or Indiana Jones.<br><br>Oh boy, twenty minutes in and i was already sick to death of Samuel\nJackson's character. He just talked and talked and talked\nand....talked. John Travolta's Vince Vega was a guy i wanted to\ndecimate, oh Travolta you looked ridiculous with those hair extensions\nand then you talked and talked and talked with Uma Thurman in a silly\nblack wig. There was so much talking in this film that it made me want\nto walk out. I have only ever done this once in my life and it was with\nthat utter garbage Jack Nicholson flick Wolf. Tosh.<br><br>So i kept hoping that something good would happen...Christopher Walken\nas an army bloke talking and talking about a gold watch up his\nass...NOT GOOD...a male rape scene with talk...NOT GOOD...Quentin\nTarintino turning up in a cameo that should have got him shot (in real\nlife) talk talk about disposing of bodies...oh, this film was the pits,\ni must have been the only one in the audience that hated this film,\nbecause everyone was whooping and hollering like they were watching a\nNaked Gun comedy. Oh yes, they loved it.<br><br>Quiet frankly my admiration of Tarintino was gone forever, he got his\nhead together with the brilliant Jackie Brown then lost the plot again\nwith the silly Kill Bill volumes. Pulp Fiction is one of the worst\nmovies I've ever had to endure, its a long boring ride to a sore head.\n"},
{"review": "\n\nThis is what I call a fad movie.  People say it is a great movie because\nother people said it is great.  People are afraid to express their true\nfeelings because they don't want to be ridiculed by their friends,\nespecially if one is a member of the so-called X-generation.  I would\nimagine that the number of people who rented the video or saw it on cable\nthat stopped watching the movie because it was so bad is fairly high,\nespecially for a movie that is considered a great movie.<br><br>However, I concede that a number of people truly like it.  However, I find\nthat there are just as many people who are repulsed by this movie.  They\njust don't express their feelings in this type of format because a bad\nmovie\nisn't worth the effort of making a negative opinion.\n"},
{"review": "\nWow, a lot of people have been fooled into believing that this was a\ngreat film. I've never seen anything like it, and I hope I never will\nagain. This is one slop of a film, and I'm disgusted to know that it\nhas so many high reviews. It was a confusing ball of goo that amounted\nto nothing. I didn't care for the characters and never will. What a\nhopeless bunch of freaks. I don't jump on the \"freak bandwagon\" unless\nthey're natural ones, not arrogant embodiments of deranged\nentertainment. The glorification of smut is worse than the smut, and\nthat is exactly what this movie is. The sad thing is, I don't believe\nthat some of these actors were acting at all. They were just being\nthemselves. Travolta and Jackson in wigs??? That was scary! The only\ninteresting thing about the movie was the sequence of events. I like\nthe way that it started at one point and ended in the same, but dislike\neverything in between. The problem with this film is that it tricks the\naudience into giving it great reviews. It uses the \"peer pressure\"\nmethod. You know, \"this movie is for intelligent and cool people\"\nCRAP!! Well, I'll gladly stand among those who know that this was\nnothing more than a \"shock flick\". It was produced to see if the letter\ncould be pushed a little further. Unfortunately, it drags what little\nrespect that Hollywood has with it. I'm afraid that this is one of the\nmajor stepping stones to a pathetic industry that only produces films\nfor vulgar lust.<br><br>There's my two pennies, don't spend them all in one place!\n"},
{"review": "\nthis movie is painfully overrated: every time someone tells me that\npulp fiction is their favorite movie of all time, I die a little bit\ninside. Mind you, it's not a terrible movie, it has style and memorable\nmoments, but nothing THAT great that justifies the hype among these\npseudo intellectuals. You know the type: these college kids who just\nlove Pulp Fiction and Fight Club, probably jerk off to Bukowski's\npoetry, think Kubrick is THE GREATEST DIRECTOR OF ALL TIME, absolutely\nLOVE to bash religion and make sure everyone knows they're an atheist,\nand yet still manage to think they're better than you. The sad thing\nabout Pulp Fiction is that I used to enjoy it when I was younger,\nwasn't my favorite movie of all time, but was definitely on the top 10.\nWatching it now, having endured thousands of these guys and their egos,\nleft me bitter and annoyed. I realized that I didn't even speak all\nthat much about the movie, sorry about that, I'm just salty.\n"},
{"review": "\nThis is by no means boring, but by no means 'essential' or intelligent\nor really worthwhile at all. It's a very fun watch, hence the 5 points\nout of 10 I will concede it. But yet it is void of any meaning\nwhatsoever and benefits from a contemporary society that will erect any\npiece of meaningless junk into a grande piece of art solely on the\nbasis it is 'original'. Originality on its own is no virtue. There\nneeds to be purpose, meaning, a particular sense of coherence and\noverall an intelligence to it. All things this movie surely lacks. The\nscript is quite awful and tries hard at being edgy and memorable for\nhow random and 'original' it is. This film is constantly patted on its\nback for being structurally and cinematographically complex and\n'original', but that never makes up for how skin-deep and hollow inside\nit so clearly, evidently is. Acting is good, and it's pretty diverse; a\nsuccession of little stories somewhat interlinked. A good watch for\npurely entertainment purposes, but nothing more. And certainly not a\nmasterpiece.\n"},
{"review": "\nPulp fiction is one of the best crime/ dramatic movie of my time. The\nmovie had such a great cast, and some intense dramatic scene pretty\nmuch through the whole movie. I remember not liking this movie when I\nwas a kid, but now that I am older I really enjoy watching this film.\nThere are a lot of great scenes in this movie but the most memorable\nscene I think was when Uma Thurman and John Travolta are dancing on\nstage at the restaurant to \" You never can tell\" by Chuck Berry.\nAnother famous and great scene is Samuel L Jacksons speech hes giving\nto the guy while shooting every one else. A lot of action shots in this\nfilm, drugs, guns, and violence. A very brilliantly shot film.\n"},
{"review": "\nEvery Terintino film I've ever seen has been awesome. This is no\nexception. The movie is so good and just interesting he has like four\nstories and ends up connecting every single one. The movie is super\nintense at parts and then really funny at others. The part where Sam L.\nJackson takes that guys big kahuna burger and is questioning him is so\ntense since you know he isn't making it out alive. Also one my hands\ndown favorite parts in a movie ever is when John Travolta's gun goes\noff in the car and he's just like ah man I just shot Marvin in the face\nlike it was just a little slip up. The guys head exploded h=in his car!\nAnyway incredible movie definitely watch.<br><br>Also if you didn't know there is a theory that was confirmed by\nTerintino That all his films are connected.\n"},
{"review": "\nfor starters I could kind of tell that this was a Quentin Tarantino\nmovie because all his movies seem to be dramatic or I guess you could\nsay realistic and bold. This is a harsh story about drugs, robberies,\nand just overall mischief. Vincent Vega played by John Travolta was\ninvolved in a robbery of a diner right as the movie began. Making\nhimself seem like an upstanding young man he is also heavily involved\nwith heroin and mob like activity. Things get strange when he is asked\nby his mobster boss, Marsellus Wallace, to escort his wife, Mrs. Mia\nWallace, while he is out of town. It seems like a recipe for disaster\nhowever not in the way one would normally think. The two did not hook\nup but Mia was in a deadly situation when she mistook Vince's heroin\nfor cocaine and snorted it and overdosing. When Vince finds her he\ntakes her to Lance's house where he normally buys his drugs and gives\nMia an adrenalin shot to her heart. That situation could have been\nmessy if they had screwed up in any way. Overall I thought this was a\ngood movie although sometimes hard to follow. The harsh truth to it all\ngives it the essence of a Quentin Tarantino film.\n"},
{"review": "\nPulp Fiction is a masterpiece! No it isn't. It's over-rated. It's good,\ndon't get me wrong, but it's not as good as it's painted. And\nTarantino's faults - which become more apparent with every\n(pretentiously) numbered subsequent movie - are all here on show.<br><br>His dialogue is good - it's his main strength, and is correctly\nrecognised as such. But a) it is over-reliant on the F-word (his CSI\nepisodes and Inglourious Basterds show that he can write excellent\ndialogue without it), and b) it would greatly benefit from external\nediting: Tarantino badly needs a McCartney to sweeten his Lennon, a\nLennon to apply an edge to his McCartney.<br><br>His direction is good - he extracts brilliant performances from his\nensemble, and his ability to present a truly eye-catching image on\nscreen is beyond doubt. Action is good, effects are good, set design is\ngood etc.<br><br>But he comes in for undue praise for other things. Self-indulgence is\none - again, he desperately needs someone to take him in hand and\nmoderate some of what he does for the benefit of the film.<br><br>Case in point - Pulp Fiction's non-linear storytelling. The zip-rewind\nhalfway through is not some sudden work of genius. It may very well be\nexperimental but, if so, it does not work as well as linear\nstorytelling would have done (which, I suspect, would have involved\nmore work in breaking the story threads into coherent sections which\nstill worked together when interleaved, or else inserting flashbacks).\nTarantino has taken an unconventional, but easy, road and, in so doing,\nhas got away with it because of the \"Emperor's New Clothes\" factor.\nHowever, it doesn't make Pulp Fiction a work of genius, it actually\nmakes it a worse film.<br><br>Tarantino's lack of self-discipline means that, despite his abundance\nof talent, his output continues to be over-rated.\n"},
{"review": "\nQuentin Tarantino really is a wonderful director, he understands his\naudience, and loves being behind the camera. His passion for directing\nreally shines through the entire movie and all of his films, this is\nwhy I adore Tarantino, he's simply the best director.<br><br>Pulp Fiction was the movie that made Uma Thurman, revamped Travoltas\ncareer, and created some of the most iconic scenes in cinematic\nhistory.<br><br>I loved the intertwining story lines, the somewhat non-sequential\ntimelines, and every single scene, seriously I couldn't believe I\nenjoyed two people arguing about a bloody Big Mac, only Tarantino could\npull a move like that. He's a goddamn genius.<br><br>There is a scene in this movie that slightly perturbed me, this\nshouldn't stop you watching it, it adds to the movie and the scene was\nplaced perfectly, but it has a disturbing element to it so viewers\nshould be cautioned. But it's Tarantino, so it's to be expected...<br><br>I quote this movie constantly, it is simply iconic.<br><br>Pulp Fiction: 10/10\n"},
{"review": "\n\nI have read some of the comments on this website concerning Pulp Fiction\nand\nperhaps I missed it but no one has mentioned the fact that Tarantino used\nan\nelement from Elia Kazan's \"On the Waterfront\" in 1954 staring Marlon\nBrando.\nIn Pulp Fiction, Marsellus Wallace told Bruce Willis that he is supposed\nto\nintentionally lose to a boxer named Wilson:<br><br>Marsellus: \"In the fifth, your ass goes down. Say it.\"<br><br>Butch: \"In the fifth, my ass goes down.\"<br><br>Bruce Willis, not only doesn't go down and lose the fight, he kills\nWilson.\nWhen I saw this, I became flushed with movie deja vu and felt very\nsatisfied. Why was the boxer called Wilson? In \"On the Waterfront\" Marlon\nBrando has a famous monologue in which he expains how his boxing career\nended: He went down intentionally against a boxer named Wilson because of\ngreedy mobsters. Wilson, therefore was the invisble antagonist against\nMarlon Brando. Tarantino, being a smart guy, knew that in the deep annals\nof\nthe film buff world, he could redeem Marlon Brando and all us film buffs\nthat hate Wilson more than anything by killing Wilson. If it wasn't for\nWilson, Marlon Brando \"coulda been a contender.\" So, by killing Wilson\nforty\nyears later, Tarantino effectively killed off the jerk that ruined\nBrando's\nBoxing career in \"On the Waterfront.\" I don't know if many people had\nalready realized this but I thought I would bring up to people's\nattention.<br><br>Also, for Tarantino fans, watch \"Kiss Me Deadly\" (1955) by Robert\nAldrich.\nIt has the answer to why the contents of the briefcase, when opened by\nTravolta, give a glowing lightbeam on Travolta's face and we never see\nwhat's inside.<br><br>\n"},
{"review": "\nI did not understand what Quentin Tarantino wanted to convey to the\nviewers with this film. I don't really see what the hype is about when\nit comes to this movie. Lack of a solid story and bond between events\nand choppy. Weird, offensive, violent, and even sodomy rape. There are\nample of examples of bad photography throughout the movie. I am 49 and\nfor me it's a complete waste of my time. Uma Thurman, John Travolta and\nBruce Willis were brilliant though.There is nothing in this movie that\nwill leave a mark in your mind or soul. It's a style-over-substance. I\nwill not recommend this movie. I think, this film is the most overrated\nmovie in history.\n"},
{"review": "\nIt kind of feels redundant trying to write a review for Pulp Fiction as\nit approaches its 20th birthday. As a film it needs no introduction, it\nwon the Palme d'Or at Cannes, won a BAFTA and Academy Award for Best\nOriginal Screenplay (Tarantino), and garnered a whole host of other\nawards and nominations. Box office beef was meaty and its reputation\neven now shows no sign of waning (it currently sits at number 4 on the\nIMDb top 100 list), it is by definition one cool MOFO of a movie, a\npicture loved by a cross section of demographics. But why?<br><br>Pulp Fiction oozes humour, romance, violence and stylish flourishes. It\nremains compulsive viewing throughout; even as it threatens to get\nsubmerged in its own complex structure. Film lover Tarantino takes a\nnumber of low life and unfortunate characters from Los Angeles,\nmainlines then with movie clichés, and then amazingly breathes new life\ninto them. It knowingly winks at B movies from the past yet always\nremains fresh on its own terms. I myself having just revisited the film\nafter a 5 year gap can attest to just how well it holds up, laughing at\nthe dialogue, perched on the edge of the seat as violence starts to\nrumble, and yes, singing along with that most catchy of soundtracks.<br><br>Yet for all its flashiness and hipster chattering, there's one thing\nthat often gets overlooked when talk of Pulp Fiction's greatness\narises. That of a basic human urge to survive or find salvation,\nTarantino's main characters may be bottom feeders or scummy operatives\nof the underworld, but there's love and needing beating slowly in its\ndark heart before the drugs and violence take a hold. Neat trick that\nfrom Tarantino, brilliant in fact. 10/10\n"},
{"review": "\nI am baffled by the users who rate this film so highly. If one deleted\nthe N word and the F word there would be no script. How can we expect\nyoung viewers to treat people respectfully when Hollywood bombards us\nwith racial slurs? Yes life imitates art although calling this movie\nart is a stretch. <br><br>I read that Tarrantino is a high school drop out. Must be true judging\nfrom this script. I am certainly no prude or a stranger to adult themes\nand language. However the script was filled with glorified drug use and\nviolence yet failed to show one ounce of Character growth. The barrage\nof profanity and violence was both offensive and boring. Quentin\nTarrantino movies are on my list of films to avoid. Waste of time.\n"},
{"review": "\nThe hit-men Vincent Vega (John Travolta) and Jules Winnfield (Samuel L.\nJackson) work for the powerful mobster Marsellus Wallace (Ving Rhames).\nVincent has lived in Amsterdam for three years and is assigned with\nJules to retrieve a suitcase that belongs to their boss. There is a\nshootout and Vincent and Jules do not die because the shots of one\ngangster fails the target. Jules believes that God's hand has\ninterfered in the bullets and he decides to redeem himself from his\nlife of gangster. Vincent is assigned by Marsellus to go out with his\nwife Mia (Uma Thurman)while he is traveling and he is scared when she\nhas an OD. Marsellus pays the boxer Butch Coolidge (Bruce Willis) to\nlose his fight on the fifth round, but Butch wins the fight. He flees\nfrom Marsellus and his gangsters but his girlfriend Fabienne (Maria de\nMedeiros) forgets to bring his golden watch that belongs to his family\nfor many generations. Butch returns to his apartment and he faces\nVincent first and Marsellus later. But an incident with sadistic\nperverts brings Marsellus and Butch side by side. <br><br>\"Pulp Fiction\" is one of my favorite movies ever. I had seen this movie\nfor the last time on 11 January 2002 and today I have just watched it\nagain. When we compare the nominations for Best Picture in the 1995\nOscar (\"Pulp Fiction\", \"The Shawshank Redemption\" and the winner and\nweakest \"Forrest Gump\") with the movies nominated this year we can see\nthat the Oscar winners are not necessarily the best movies of the\ncinema history. \"Pump Fiction\" saved the career of John Travolta that\nwas in the ostracism and put on the spot Quentin Tarantino after the\ncult \"Reservoir Dogs\". The complex screenplay with four entwined story\nhas shown to the world the brilliance of Quentin Tarantino. My vote is\nten.<br><br>Title (Brazil): \"Pulp Fiction \u0096 Tempo de Violência\" (\"Pulp Fiction:\nTime of Violence\")\n"},
{"review": "\nIt seems to be the fashion among film \"intelligentsia\" to give wild\npraise to the most incomprehensible and incoherent rubbish, sending the\npartly unspoken message that if you, the film-goer, do not get it, you\nare not smart enough to understand it. This applies to most of the\noeuvre of the late Stanley Kubrick (with the exception of LOLITA, DR\nSTRANGELOVE, and to a point A CLOCKWORK ORANGE), and it applies equally\nwell to this odd and trashy bit of nonsense handed to us by Quentin\nTarantino. To say that sitting through it was painful would be an\nunderstatement, but if that isn't bad enough, it is also incoherent and\nconfusing (at one point the Samuel L Jackson character dies, if memory\nserves, only to show up alive later with no explanation given). Uma\nThurman is striking to look at in that dark wig, and Travolta stretches\nwhat little acting talent he has, but I still to this day have no idea\nwhat the movie was about, and frankly, Tarantino failed to make me care\nvery much.<br><br>Like most of Kubrick's work, this film is visually striking: the color\npalette in particular is stunning. But at the end of the day, how a\nfilm looks means nothing unless there is some substance underneath the\nsurface, and if there is any here, I did not see it.<br><br>At the time this movie came out, the critics were falling all over\nthemselves proclaiming that it represented a new direction for\nHollywood films. Fortunately that seems not to have been the case.\n"},
{"review": "\n\nThis movie is one of the few that I nearly walked out\non it was so bad.  It was too disjointed and I could not\nunderstand the point or plot.  People were killed in\none scene and then popped up in another.  Lots of\ngratuitous violence and brutality that did not seem\nto have much to do with the plot.  \n"},
{"review": "\n\nThat was to lower it's stupid ridiculously high average, but to put it quite\nsimply, I hated this movie. I didn't expect to like it, I was only watching\nit for Frank Whaley, but I hated this movie, really hated with it with it's\nvarious plot holes that do not make sense(watch \"Short Cuts\" if you want to\nsee a decent movies about the interrelating lives of people), obnoxious,\nunsympathetic characters(I wanted to cheer when John Travolta died, or did\nhe die? I had no idea since the film epitomized non-sense making. Someone\ndied, and I didn't like any of the characters, with the exception of\nWhaley's, so I would still have wanted to cheer), bad writing, with obvious\nattempts at being \"cool\" and trying to have \"catch phrases,\" etc etc etc! I\nfound nothing good about this film in the least. So why did critics? I hate\nwhen violent, immoral films are regarded as \"daring\" \"good\" film making.\nThis one sure wasn't, and nominating John Travolta and Samuel L. Jackson for\nacting awards?! The first one is just absurd and the second has proven to me\nthat he can act, but the only thing he was acting in this film was\nobnoxious. This one is up there with \"Born on the Fourth of July\" and \"Do\nthe Right Thing\" for my least favorite \"good\" movie.\n"},
{"review": "\n\nI did - what many listed here - have done.  And rented it against my\nbetter\njudgement : since the previews had done little to entice\nme.<br><br>As objective as an analysis goes : (here's my 0.02$)<br><br>Positives :\n1) The movie is original\n2) the way the multiple stories intersect is probably the\nhigh-point\n3) It contains seasoned actors that perform the role as well as can be\nexpected.\n4) I did smile during the door shooting scene with Travolta &amp; Jackson,\nand\nfew others humours one-liners/conversations.<br><br>Negatives :\nI) There is *way* too much foul language ... is it possible to let the\nclock\ntick with hearing an f-word, I can even commend times it should be used\nto\nunderline/emphasize ...etc ... but every 45 seconds !!!<br><br>II) Individually, some stories might have become interesting - but by\njust\nskimming on the better ones (Bruce Willis) - and digging deeper in the\nblander ones (Travolta's)and the dude \"bagged\" in the car =  you come\naway\nwith a : Yeah - so what ?  lingering in your mind.<br><br>III) A few original lines and skewed timeline doesn't a movie make.  One\nhas\nthe sense of a hyped up boxing match where the Champ get cut in the 1st\nminute of the 1st round, thus ruled a \"no-contest\" ...<br><br>I can see it appealing to some MTV-type crowd or some that desperately cr\nave\nsomething original (which it is) , but gives me nothing to \"digest\" once\nover, VS something one can really connect (and sink his teeth into like :\nThe Shawshank Redemption, Gattaca, American Beauty - that one is a rose,\nby\nany other name ...<br><br>And it **Certainly** doesn't deserve to be in the Top100 of all times\n!<br><br>Enjoy the show, Folks !<br><br>Jerome M.\n"},
{"review": "\nDon't get me wrong i generally like gory mature movies. But, this movie\nwas terrible; repulsive fast paste griddy storyline with no plot is not\nmy idea of a good movie. It was simply a bunch of unpleasant scenes put\ntogether sporadically in a timeline sequence until the end of the movie\ncame. And you come to realize the moral, doing bad things isn't good\nfor you, also the most elementary concept one knows. The only one that\nmakes it out unscathed is Samuel L. Jacksons part. And i believe this\nis wholly because he abandoned the path of immorality. Teaching us what\nis commonly known through a disgusting and unorganized movie.<br><br>Nothing at all embracive, enthusing, funny, witty, or intelligible. I\nmean their were themes, but they were incredibly dull and boarish. I am\nblind to how people see this as a good movie. I found this movie as a\nwaste of life.\n"},
{"review": "\n\nI should have gotten this the first time but I didn't. While Butch is\nat Zed's contemplating helping out Marcellis. Right when he's at the\ndoor you see a license plate behind him from Tennessee, and the motto\nreads, \"The Volunteer State\". I just thought that was funny cause Butch\nwas from Tennessee and he volunteers to help Marcellis. This thing\ntells me that I have to write 10 lines of text. I love this movie. It\nis very funny in many parts and I like the part when Vincent does\nheroin while driving. That has to be the funniest thing EVAR! Two more\nlines. This movie has Uma Thurman in it. She was great too because she\nknows how to act. Bruce Willis can act too. I think they should do a\nmovie together. Oh wait they did.\n\n"},
{"review": "\n\nOne of the best movies of the 1990s is probably the most unique in the sense\nthat it stands by itself in its audacity and vitality.  Quentin Tarantino is\nan auteur of the 90s and has proven a masterful director for great ensemble\ncasts, an insightful well-developed script, inspiring and striking camera\nangles and cinematography, and has developed a new genre of gangsters,\ncrime, and mystery with an array of violence, drugs, sex, and fast-paced\naction.  John Travolta and Samuel L. Jackson are dynamic and deliver\npowerful performances as a duo of hitmen, Bruce Willis is compelling (in one\nof his finest roles) as a prize-fighter and struggling boxer, and Uma\nThurman is memorable as a sexy drug addict.  All these lowlifes are\nconnected in one way or another to big time mafia leader Ving Rhames who\nhappens to be Thurman's husband.  Movie is also unique in the sense that it\nis broken up into different scenes that don't seem to go in order from\nbeginning to end.  Obviously the movie is not for all tastes for its\ndehumanizing and repulsive theme which is evident in every single scene. \nNominated for several Oscars including Best Picture, Pulp Fiction is a\nmezmerising ride.  9/10            \n"},
{"review": "\n\nTruly a classic.  <br><br>A movie with long scenes, and they're all well played (believable or not). <br><br>One minute you're laughing, the next scared s---less.  When Jules blasts\n\"Flock of Seagulls\" on the couch while Brett quakes in his boots digesting a\n\"Big Kahuna\" burger, the laughter &amp; fright seem simultaneous.  <br><br>Often imitated, &amp; certainly never duplicated, this is (to quote John\nCusack's Rob Gordon character in \"High Fidelity\") in my \"Top 5 movies of The\n90's\".\n"},
{"review": "\n\nWhen I first heard the beginning conversation of this movie, I knew this\nmovie would have truth to it. Now, I'm not a gangster, but I'm pretty sure\nthat killers don't just talk about killing and crime. They probably have\nnormal conversations, like they do in the other amazing Quinten Tarantino\nmovie, Reservoir Dogs. Unlike movies like The Godfather, they make mobsters\nlook like all they know is \"the family\", and all they can talk about is \"the\nfamily\".<br><br>But what also came through in this movie is Samuel L. Jackson's role when\nspeaks about a Eziekel 25 verse 17. Cold blooded killers are not so cold\nblooded. People might not think that these kind of people read the bible.\nCharacters in movies like Joe Peschi in \"Casino\" distort the ideas people\nget about gangsters. Even if the line Jackson recites in a violent one, he\nwould have to read the bible to discover it.\n"},
{"review": "\n\nI finally saw this film for the first time in 2002.  I read some of the info\non IMDb before seeing it, I remember that it seemed to contain more goofs\nthan any other film that I have looked up on IMDb.  What little I knew about\nthe film made me biased.  I, of course watched it carefully and analytically\nyet I still didn't pick up on any of the little nuances.  Where are all\nthese alleged clocks that say the time is four-twenty???  Who made up that\nup??? I guess I'm not quick enough to appreciate Tarantino's commitment to\ndetail. The only thing I was able to question was that the background in the\ncab scene was pretty chintsy but I thought that it was deliberate to give it\na 1940's film-noir kinda feel.<br><br>It's mildly funny and quite philosophical.<br><br>Even after seeing it, I still feel like I have not seen it yet!  Does anyone\nknow where I can get a \"real\" version of the film?  It was not what I\nexpected.  I guess ANY slight knowledge of this particular film is an\nultimate spoiler.  I didn't see how Uma Thurman's character had to do with\nthe whole thing.  I would have edited her out completely, yet she was the\nmovie's marketing image.   However, I think the cast and acting was\nbar-none.  Overall a great experimental attempt and a stepping stone of\nfilms that followed.  At least I know why my friends have changed since 1994\nin their speech and attitude.  This could have been an interesting\nblaxploitation film if it had been released circa 1976.  I would say the\nmovie is like (Deliverance) meets (Lock, Stock and Two Smoking\nBarrels)<br><br>I don't see what the big fuss over this movie was, though it did have an\npersonal impact on me.  Makes me think everyone around me has a\ngun.\n"},
{"review": "\n\nThis is the film that got me into violence big time. I do crimes for a\nliving and this film is the best film ever made. If you don't believe me\nthen watch it or I will do crimes on you. It's not as good as real violence\nbut it helped me get through a difficult patch in my life when I killed\nsomeone (accidentally it was later proved) and for a while I thought I was\nPulp Fiction. However, when I watched it again I realized that I am not\nbecause I was made before it. This is the best film ever made but it's not\nas good as the Tarantino contribution to Four Rooms which is the best film\never made. \n"},
{"review": "\n\nGood old Quentin Tarantino has done it again,giving us another great\nmovie\nwith great dialogue,a great soundtrack and a brilliant\ncast.\nThe story revolves around a number of different characters,including\nVincent(John Travolta),Jules(Samuel L Jackson),Butch(Bruce Willis)and\nMarsellus Wallace(Ving Rhymes).The whole cast is in top form,giving some\nof\nthe best performances of their careers in my opinion.\nThis film is crammed with some of the best dialogue i've ever heard,In\nno\nother film will you hear \"bring out the gimp\".Hurrrayyyy,Life is\ngood.\n"},
{"review": "\n\nNow Quinten Tarantino is my 2nd favorite director (first being Martin\nScorsese), and I think what makes his movies so great is the dialogue.\nThroughout the whole movie superb dialogue takes place just before, or\nright\nafter a turning point in the movie. Now I'm not saying it would have been\nbad if the dialogue wasn't there, it still would have been a good movie,\nbut\nthe conversations about things that are totally trivial make this an\nexcellent flick! Not for the faint of heart, but for anyone else, because\nthis is one of the great films in American cinema! 10/10\n\n"},
{"review": "\n\nQuentin Tarantino sure knows how to put together a movie, huh? While, it\nwill take you a couple of times to watch to decide whether you like it or\nnot, Pulp Fiction is a unique film with top-class actors, grade-A acting, a\nsuperb storyline, and heaps of plot twists and turns.<br><br>It's all about a web of people who's lives intertwine with eachother for\nvarious reasons. <br><br>John Travolta and Samuel L. Jackson star as the two main characters, who\nturn in great performances, while Harvey Kietel and Uma Thurman are also\ngreat, but aren't in it as much.<br><br>Bruce Willis is also great here as a boxer, on the run from a hitman, while\nEric Stoltz plays one of Travolta's dope-smoking associates.<br><br>Not a film for the slow-minded, 'Pulp Fiction' is a fast-paced adventure\nride, that you'll laugh at, love and hate, all at the same\ntime.\n"},
{"review": "\n\nI and most of my friends use this movie to separate peers into two groups-\nthose who understand something and those who don't.<br><br>Us: \"So what do you think of Pulp Fiction?\"\nThem: \"Yeah, yeah.  I saw that in high school, it was funny.  But did you\nsee Shawshank?!\"<br><br>Thus, in the above episode, \"Them\" has placed him or herself squarely\nwithin\nthe group of people who do not understand.<br><br>This is the first movie that everyone my age saw, besides maybe \"Planes,\nTrains, and Automobiles,\" that made you believe in its profound relevance\nno\nmatter what it did.  Two characters discuss MacDonalds in Europe, and you\nbelieve.  A woman traces a visible rectangle in thin air with her fingers,\nand you don't know why, but you believe.  The confidence of the dialogue,\nperhaps, or the sublimely offhanded complexity of the plot.<br><br>It also features career-making performance from every one of its actors.\nThis is the movie that defined comeback with John Travolta, and that\ndefined\nSamuel L. Jackson in the first place.  Uma Thurman could walk off the\nscreen\nand you wouldn't notice.  Bruce Willis makes you realize who Bruce Willis\nreally is.  And in a Tarantino tradition foreshadowed by \"True Romance,\"\nChristopher Walken's one scene is achingly nuanced and hilarious, the\nclosest thing I know of to perfect.<br><br>Pulp Fiction is simply the most important and best movie of the 1990's\nand,\ntherefore, since the 70's.  If you haven't seen it and you're older than\n16,\nyou must must do so, right now.<br><br>And I like Shawshank a lot, by the way.\n"},
{"review": "\n\nA great, very enjoyable film from the auspicious Quentin Tarantino. The\nscript is one of the best in a 90's film, and the cast is full of huge\nstars\nwho actually give huge performances. Casting John Travolta as the lead was\nbrilliant, and would seem unusual if you haven't seen Pulp Fiction,\nbecause\nmost of Travolta's other work is, well, I'll say \"not good\". Although Pulp\nFiction deserves much praising, there are things in the film that keep it\nfrom being a masterpiece, ones that I'm sure you can find yourself and\ndon't\nneed my pointing out.<br><br>Watching Pulp Fiction is awesome. I can't wait to get the DVD (the one I\nhave now is terrible- no features!) with director's commentary. It'll be\nfantastic, I'm sure.<br><br>****/5\n"},
{"review": "\n\nPulp Fiction serves as an excellent social critique of the seeming\nglamorous\ndrug and crime world. Jackson and Travolta were excellent. I will always\nthink twice about pawn shops--seeing as how some may have the Gimp tied up\nin the basement. My only question is what was the glowing content(s) in\nthat\nall important briefcase Jules carried around? It is never shown\ndirectly--but appears to give off some form of hypnotic light as noted\nwhen\nit is displayed for the would-be diner robber at the end of the movie.\n\n"},
{"review": "\n\nQuentin Tarantino's Pulp Fiction is great! Tarantino wrote it, directed in\nit and starred in it. Top rate cast includes John Travolta, Samuel L.\nJackson, Uma Thurman, Ving Rhames, Harvey Keitel, Quentin himself,\nChristopher Walken and Bruce Willis! Every scene in this film is filled with\nhumorous, thought-provoking and sometimes very dramatic\ndialogue.<br><br>(SPOILER coming up!) Perhaps the most underrated scene is when Christopher\nWalken talks to Bruce Willis (as a child) and explains what his father's\nwatch went through to get to him.<br><br>A great, totally excellent film from a very good director.<br><br>****\n\n"},
{"review": "\n\n\"What country you from Bret? What! Well that ain't no country I've ever\nheard of. They speak English in what?\" <br><br>The character Jules makes this film for the classic it is. If Tarantino had\nthrown in Vince w/ a partner more like himself, then I'd have to say that\nthis would be perhaps the most boring movie I ever saw.<br><br>This is a movie, chartered by three separate but revealing short stories,\nabout the same characters. The first begins with a prologue in a coffee\nshop, then takes you to an apartment where some thugs get capped off by\nJules and Vince. Then the next stories' about Vince taking his bosses' wife\non a date, and then goes on to tell about a boxer who stiffs Marcelus of a\nbribe, and then graduates to explain the prologue. <br><br>Homophobes may not want to watch this one. There is a scene that will make\nyou cringe as I did the first time. <br><br>The dialogue is what makes this film unique, original, and funny as hell. It\nis also the masterpiece which had introduced me to crime/action films, which\nbefore I had been previously uninterested in. <br><br>\n"},
{"review": "\n\nI love this film, one of my all time favorites.  One thing bothers me\nthough.  Jules' mis-quoting the bible.  I haven't seen anything to\nhighlight\nhis embellishment of Ezekiel.  If you care, the verse goes like\nthis:<br><br>\"I shall perform frightful acts of vengeance &amp; inflict furious punishments\non them; &amp; they will know that I am Yahweh, when I exact my vengeance on\nthem.\"<br><br>Nice and simple. Nothing about the paths of righteous man beset by the\ninequities of good men.\n\n"},
{"review": "\n\nPulp Fiction is the absolute greatest film I have ever seen (and I have\nseen\na lot of films). Quentin Tarantino is just a genius. People think that I am\nstrange for select this film as my all time favorite. In today's high\npriced\nHollywood, when a director can put together the kind of talent that appears\nin a low budget film, and makes it work........he is one of a\nkind.\n"},
{"review": "\n\nQuentin Tarentino masterfully plays with the element of time in this\nOscar-winning black comedy. He weaves four seperate stories that brilliantly\ncome together. Vincent Vega (John Travolta) is the slightly overweight\nhitman that has to kill boxer Butch Coolidge (Bruce Willis) who\ndoublecrossed his boss Marcellus Wallace (Ving Rhames). In another story\nVincent and Julius, another hitman, played by Samuel L. Jackson, go on a\ntrip to recover a case of stolen money from a couple of small time gangsters\nand accidently kill their contact in their car. This is where the Wolfman\n(Harvey Keitel) comes in and saves the day. In between we see how boxer\nButch Coolidge and hitman Vega struggle in everyday life and how Jules is\nenlightened. This all starts with the robbery of the diner where Jules and\nVince discuss religion and saviour and where we meet robbers Tim Roth and\nAmanda Plummer who are taught a lesson by gangster Jules. Definately a movie\nto watch and well worth the Oscar \n"},
{"review": "\n\nIn Quentin Tarentino's masterpiece, Pulp Fiction, the story of two hit men,\na strugling boxer, a feared and reveared crime boss and two diner robbers,\nwe see what a great director can do.<br><br>This is a great film, on parr with Pink Flamingoes and train spotting, and\nvery entertaining. Anyone who enjoys a fun, but at some times twisted good\ntime, should check this out.\n\n"},
{"review": "\n\nQuentin Tarantino struck mega paydirt with this little diddy of a movie.\nAnd invented, or perhaps, re-invented a whole genre of film.  Tarantino is\nperhaps the most derivative filmmaker in history, but much like rap music,\nTarantino has taken the art of ripping off other people's ideas and making\nthem fresh and cool.<br><br>The shoots out and wiseguys in black suits with skinny ties?  That's\nstraight outta John Woo and Scorsese.  The pop culture references?  That's\nGodard.  The trippy way the film jumps back around in time?  Jim Jarmusch\nand Kurosawa did it first.  Despite all of this Tarantino has made a\nbrilliant film.  You don't just see 'Pulp Fiction'.  You drink it, eat it,\nbleed it, breathe it, savour it, spit it out and ask for more.  You can dig\nthat can'tcha?\n\n"},
{"review": "\n\nA spectacular and surprising (original) three movies in one! Won the Golden\nPalm for best Movie (Cannes 1994) and was nominated for seven Oscars; got\nonly one... for original script. Brilliant plot, surprising scenes,\nterrific\ndialogs and great humor! My favorite scene is the one that Vincent Vega\n(Travolta) and Jules Winnfield (Samuel L. Jackson) are discussing French\nfries being served in The Netherlands; with loads of mayonnaise! (a true\nfact).\n"},
{"review": "\n\nPulp Fiction fascinates in many ways. Under it´s delusive external surface\nyou can find great irony. Tarantino shows us every possible kinds of\nrepulsive characters and ugly situations. Satire certainly isn´t an easy\ngenre: neither for creators nor for audience. Everything you see in this\nmarvellous film is opposite of the purpose. Where Tarantino aims to, is to\nmake fun of the vanity of violent action films. The movie treats current\nproblems in film-making: superficiality and distorted values. We are\nentitled to get a good laugh in Pulp Fiction many times, but why? Enjoying\nthe endless cruelties? No. Because of the discriminating critic against\nimmorality? Yes.         \n"},
{"review": "\n\nQuentin Tarantino movies  always seem obsessed with three  things, 1) a\nnonlineal structure, 2 hip language and  3) pop culture references.  While\nPF isn't really complex or deeply philosophical it is tremendously\nentertaining. The three stories involve two out law lovers ( Tim Roth and\nAmanda Plummer), a boxer ( Bruce Willis) and two philosophizing hitmen (\nJohn Travolta and Samuel L Jackson). The film is an endless recycle of\n50's\ncrime dramas, film noir, french new wave, action movies, b exploitation\nfare\netc. , but it is the unique spin that Tarantino puts on these old\nconventions and cliches which makes it so clever and inventive. Also\nTarantino's great use of music which sets the moods of his films\nperfectly.\nThe film has some memorably funny dialogue and quirky characters that\nleave\nan indelible mark on the viewer equaling two and half hours of\nentertainment\nwell spent.\n"},
{"review": "\n\nThis movie really gorges with characters view angle and the normal \"from\npoint A to point B\" is replaced with fickle sense of time; picture jumps\nround but in the same time gathers the plot in to one piece. Pulp is\ncult.\n"},
{"review": "\n\nIf you have read any of my other comments, I usually olny comment on the\nmovies I hate.  That is because they trigger emotional responses from me, in\nmost cases, dissapointment and hate.  But here, I am writing this review\nbecause I felt awe after seeing this movie.  I absolutely love this film. \nThe dialogue is hilarious and it provides great insight into the lives of\nthose involved in organized crime.  Fiction or not, it still is pretty\nrealistic.\n   There are several great things about this movie.  1)  Characters.  The\ncharacters portrayed by.....everyone in this movie are great.  These\ncharacters have depth, humor, and are colorful.\n    2)  Story.  This is not a movie for people who only half pay attention. \nA lot of laughs are caused during this movie because you think, \"So that's\nwhy that happened.\"  People complain that this movie has no plot.  If you\ncan't find a plot, look harder.  It is basically about the lives of 4 people\nover a course of 2-3 days.  Even though it is so simple, the situations\nthese people go through in these days are comical and interesting.\n   3)  Direction.  Tarantino is just plain great.  The camera angles and\nsets are colorful and cool.  The moods are dark and, well, moody and the\nmusic is incredibly well matched to the scenes and locations.  Good job,\namigo.\n   This may not be a movie for everyone.  But if you like movies like \"The\nUsual Suspects\" and \"Four Rooms,\"  don't pass this one\nup.\n   Final Thought:  Great, one of my top 10.\n"},
{"review": "\n\nWhile I still think Reservoir Dogs is better, this film is definitely\nfunnier, and more engrossing. Divided up into three stories, my favorite\nbeing the first one, it is always spitting little surprises up for it's very\nshort 150 minutes. While the last story does lose a bit of the films\nsustained momentum, it gains it back quickly, giving way to an excellent\nconclusion. Not to mention on of those undeniably intriguing opening\nsequences. Recommended for all those who can take nonstop profanity,\nviolence, and drug use.<br><br>PLOT: 8 DIRECTION: 9 SCRIPT: 10 ACTING: 9 CINEMATOGRAPHY:\n8<br><br>OVERALL: 8.5\n"},
{"review": "\n\nQuentins best movie so far..\nA movie about the day in the life of two hitmen Jules(Sam Jackson) and\nVincent (John Travolta).who have to get a case for there boss\nMarcelus.\nI loved the movie because of the way it went back and forward in\ntime..\nA recommended movie...<br><br>\n"},
{"review": "\n\nAnybody who hasn't seen this movie has missed out on the greatest cinematic\nachievement in the history of mankind. The ingenious script written by the\nbest of the best, Quentin Tarantino, keeps you on the edge of your seat\nthroughout. If that is not enough, this film features probably the best\nensemble cast ever put together including the likes of Tarantino loyalists\nsuch as Harvey Keitel and Tim Roth, the very talented Bruce Willis, and\nhands down the God of the acting world:\nSamuel L. Jackson.\nIf you haven't seen this movie, hurry up and give yourself the pleasure of\nenjoying every single pulse pounding, gut wrenching, adrenaline filled\nmoment of this extraordinary cinematic event.   \n"}
]