[
{"review": "\nBrilliant adaptation of the story of Bletchley Park and the\ncryptanalysis team, ran by Alan Turing, that cracked the code of the\nGerman Enigma Machine during World War II. Featuring an outstanding\nstarring performance from Benedict Cumberbatch as war hero Turning and\nsupporting acts from a brilliant cast including Keira Knightley,\nCharles Dance and Mark Strong, 'The Imitation Game' is a powerful and\neminently well-made biopic that illuminates the facts whilst respecting\nthe story it is based upon. The English-language debut of 'Headhunters'\ndirector Morten Tyldum, this British World War II thriller is a highly\nconventional story about humanity that creates a fascinating character,\nanchored by a hypnotically complex performance.\n"},
{"review": "\nI'll make my review short. Go see this. It has all the elements of a\ngreat movie from the acting to the score by Alexandre Desplat.\nExcellent script and delivery. It was well received at TIFF 14 where it\nwas named People's Choice. The cast members really gelled on screen. It\nwas well edited because the pace of the movie did not lag at any time.\nWhen watching this you will quickly realize that these actors (Benedict\nCumberbatch, Keira Knightley, Matthew Goode, Mark Strong, Allen Leech)\nwill be around for a long time entertaining us. If you like A Beautiful\nMind or even Good Will Hunting, you will enjoy this. It comes out in\nNovember 2014. Don't miss it. This one is Oscar worthy.\n"},
{"review": "\nA movie which oozes Britishness from every frame, The Imitation Game is\nan instant classic. Wartime Britain is depicted vividly, if a little\ncaricatured, with an autumnal palette and a jaunty air.<br><br>A true story, sympathetically told, with good performances all round\nand a stand-out Turing from the indefatigable Mr Cumberbatch. The young\nTuring is also extremely well realised by Alex Lawther.<br><br>Meandering through Alan Turing's life since school until shortly before\nhis death, the script demands your attention and regularly makes you\nsmile.<br><br>Highly recommended.\n"},
{"review": "\nThis is THE movie for anyone who wants to learn about the birth of all\nmodern computing and cryptography. It also provides a deep commentary\non the ignorance of people who hate those who do not fit in. I wish the\nfilm could have gone into more detail about Alan Turing after the war\nwhen his deepest personal struggles were in full force. However, for a\ntheatrical film it would have been far too long. This film illustrates\nhow far we have come as a society in terms of accepting gay and\nlesbians and their contributions to society. I will not spoil the film\nbut for the cypherpunks out there you will be a little uneasy if you\ncompare the MI-6 tactics to those of today's NSA and other three letter\nagencies that spy on our every digital move. All in all a brilliant\nfilm with great actors that will move your hearts and minds.\n"},
{"review": "\nIt is a shame this movie is a stack of lies.First time polish broke\nenigma it was in 1932, 1933 they created first working example of\nEnigma, and first anti-enigma device, narrowing settings combination to\n105 456. In 1936 Germans changed the design, and Polish answered with\nRejewsky bomb, machine with 6 enigma connected together,breaking new\ndaily code in 2 hours.Another German changes required building 54\ndifferent machine designs, and Poland didn't have enough money so they\nasked allies to help.July 1939 Uk and French representatives visited\nWarsaw and got all documentation how to break ENIGMA.After beginning of\nthe war, polish encoders moved to Paris, and British started Bletchley\nPark operation. Unfortunately, Polish people are always forgotten,\nbecause they are not part of US/UK/France/Germany nation.Shame on you\nBritain.\n"},
{"review": "\nThis film, while entertaining, aims mainly to be a purely twenty-first\ncentury anti-bullying parable, regardless of the historical truth about\nAlan Turing. While I have been more firmly opposed than most to\nboarding school bullying, in this case, the nobler the goal, the worse\nthe writing. The film tries unsuccessfully to make Turing both a\nfriendless quasi-autistic lone genius, and the head of the entire\ndecryption project; neither point has any relation to reality, and\nbarely cohere to each other. (I admit to some bitterness about this\nslur on my grand- supervisor, since it implicitly denies the existence\nof my graduate-school supervisor.)<br><br>The film also does disservice to Joan Clarke's genuine contributions,\nsubstituting a muddled and completely ahistorical subplot about her\nprofessional dependence on, and mathematical superiority to, Turing,\nwhile seeming more concerned with her appearance than her intellect.\n"},
{"review": "\nI really enjoyed watching the movie, however left the cinema\ndisappointed! Fantastic story, great Alan Turing - pioneer of computer\nscience. BUT - German military texts enciphered on the Enigma machine\nwere first broken by the Polish Cipher Bureau, beginning in December\n1932. This success was a result of efforts by three Polish\ncryptologists, Marian Rejewski, Jerzy Różycki and Henryk Zygalski,\nworking for Polish military intelligence. Alan devised a number of\ntechniques for breaking German ciphers, including improvements to the\npre-war Polish bombe method. Shame Polish Intelligence was omitted in\nthe movie.\n"},
{"review": "\nI have just one comment. Why is a movie founded on a lie such a huge\nsuccess and even nominated for an Oscar? Alan Turing was not the first\nguy to crack the code. He and others at Bletchley Park were merely the\nsmart folks who used Polish groundbreaking cryptography methods to\ntackle Enigma. Turing is portrayed here as a hero and the success as\nsolely his, all according to the sneaky writers of The Imitation Game.\nDid they forget to carry out a proper research or was their mission to\nundermine Polish part a deliberate thing? Brits often forget about\ntheir 2WW allies, ascribing all the war effort success to themselves.\nBut hey, even 'bletchleyparkorg', the official website, says \"The Poles\nbroke Enigma in 1932\"...In 1939 with the invasion on Poland imminent\nthe Poles reached out to Britons for help and thus Bletchley Park\nbecame the centre where cryptographers were unscrambling the code. See\n\"The Imitation Game' - Success Has Many Fathers...\" a review by Witold\nSobkôw<br><br>Get your facts straight people.\n"},
{"review": "\nMake fictional characters and tell fictional story. It will be okay\nthen. But when you take real peoples names you should tell real story\nabout them. Otherwise its nothing more than propaganda. <br><br>This movie is nothing more then very touching, well acted and well\nfilmed propaganda. Focusing on one person. And lying to the viewer that\nhe single-handedly brake enigma code. The lack of any explanation about\nhow this machine worked is a miss too. <br><br>And its a shame because the story itself is so fascinating. Full of\nreal heroes and tragic stories about them. <br><br>Watch it for entertaining values only. And if you interested in enigma\nwatch some documentaries on the topic. There's plenty of good ones.\n"},
{"review": "\nSo I just saw this film tonight, and I quite enjoyed it. It was\ninteresting and engaging and entertaining and everything you'd want\nfrom a movie. I went home quite satisfied, and indeed had my interest\nin Alan Turing, the main character, piqued. So, when I got home, I did\na little online research.<br><br>Now, I know that this was a movie, and not a documentary, so I expected\nthat there would be some liberties taken with the story, but hoped they\nwould not be anything too significant. Well, here's what I discovered:<br><br>It's ALL bull$hit.<br><br>All of it! The events, the characterization of Turing, all of it. It's\nonly true in the absolute broadest outlines of the story. I invite--\nno, urge-- each and every one of you to pull up the Wikipedia article\non this movie and read the section \"Accuracy\". Then come back and tell\nme this was a good movie.<br><br>My initial liking of this movie has turned to bitter hatred.\n"},
{"review": "\nCan nothing be told vaguely how it happened without having to force\nfeed us with today's politically correct values? The obligatory\nrighteous downtrodden woman physically assaulting a man, being better\nthan all the rest yet being treated like a chimpanzee by all the evil\nmisogynistic men, but of course ultimately being vindicated. FFS sake\nchange the record with this stuff, it got tired a long time ago and\nit's stinking up so many movies. That and the historical inaccuracies\nand overacting rendered this laughably bad for me. What a shame -\nthere's a great story to be told here by anyone with sufficient respect\nfor the subject matter, who's not intent on using it as a manifesto for\nsomething else. And if there's not enough drama already in this story\nwithout all these manufactured incidents and theatricals, then the\nscreenwriter should be banned from writing again. Another great story\nirreparably shat all over and a chance to educate people about history\nsquandered.\n"},
{"review": "\nWhat the film lacks in my opinion is a seriously constructed drama.\nAlthough the film carries a certain amount of tragedy, somehow I\ncouldn't managed to get deeper convened with the characters and\ncomplications they experiencing on a daily basis. Maybe it's because of\nthe large number of one-dimensional characters. I'm not entirely sure.\nAlthough the script has some glitches, what definitely sells this movie\nand makes it worth a multiple of view is the brilliant performance of\nBenedict Cumberbatch. This brilliant British actor amazes us in the\nrole of a brilliant but tortured genius. Because of him all the other\nelements of the film gets thrown in the background. The spectrum of\nemotions he gives is great, Benedict contribute so much that the film\nraises because of him a whole new level.\n"},
{"review": "\nThis is one movie I really enjoyed. Someone once said, the best stories\nare written by life. And this is one excellent movie based on a true\nstory. I have not known much about Benedict Cumberbatch before this\nmovie, neither was I a fan, but I am sure now. He performed the\ncharacter of Alan Turing so beautifully, he was an excellent choice. I\ncan't wait to see what is next for him. I loved the chemistry and the\nfriendship between him and Keira Knightly. Keira Knightly as Joan was\nawesome, I love a good strong female character, and she give an great\nperformance as Joan. I enjoyed the surroundings and the carefully\nchosen cinematography. U really got the feeling like you were in the\n40's. Great job!\n"},
{"review": "\nFor me, the best scene, and deserving of a special clip on Youtube\nmaybe, is when they are at the pub, and Helen tells about her\nrelationship with an unknown German.<br><br>We see, and can almost hear, Turing thinking and realising that this is\nhow he can beat the Enigma. Helen (Tuppence Middleton) (sic!!) is so\ngood, and this is the point after which everything is possible. The\nworst scene is the attempt to show the convoy destruction. The CGI is\namateurish, hopeless!<br><br>The basic plot is well known now, about how the whole team at Bletchley\nmanaged to beat the German Enigma code machine. The story develops well\nand the acting is superb throughout.<br><br>One tiny grizzle, is that we are not shown what Joan (Keira Knightley)\nactually does.\n"},
{"review": "\nThis movie is great from every possible standpoint. Cinematography,\nacting, directing, music, effects, and, of course, the story and\nscript. It is one of those films that you can gladly watch again. What\nmakes the story great is that it is about a famous person, yet one that\nmost people don't know much about, and that no movies have been made\nabout him, until now that is. It would be great if more films were made\nabout real-life scientists, to show the difference their inventions\nhave made for the humanity. This film is dialogue-rich, so you better\nbe watching it in an environment where you can concentrate and have no\ndistractions. Spoiler alert: the exchange between Alan Turing and naval\ncommander is especially delightful, and reminds viewers about the high-\nquality of British cinema.\n"},
{"review": "\nDuring the World War II, the mathematician Alan Turing (Benedict\nCumberbatch) joins a team of code-breakers at top-secret facility at\nBletchley Park to try to decipher the code of the German enigma\nmachine. Turing is a homosexual genius and along two years, he and his\nteam successfully develop another machine to decipher the enigma.<br><br>\"The Imitation Game\" is an excellent dramatic thriller based on a true\nstory. About twelve years ago I saw another good movie (\"Enigma 2001)\nabout a team of cryptanalysts put together to break the code of the\nGerman enigma. \"The Imitation Game\" is a superior version, with\nmagnificent screenplay and performances. The plot is based on\nhighlights of Alan Turing's biography (see the Wikipedia) entwined with\nfictitious facts to give the necessary pace and keep the attention of\nthe viewers. My vote is eight.<br><br>Title (Brazil): \"O Jogo da Imitação\" (\"The Imitation Game\")\n"},
{"review": "\nThe story was interesting, but it was filmed in such a predictable and\nconventional way, I just hated it. I already saw \"A Beautiful Mid\".\nHere at least they had the decency of saying that the guy was gay.\nExcept for that, this movie is as bad, as corny, as predictable. There\nare the usual same ingredient for a movie about a hero, and about a\ngenius. Nobody understand him, there is the evil handsome coworker, the\nbeautiful girl who is better than everyone else, the evil military\ngeneral that hates the main character, the drama about a coworker\nloosing his brother. They packaged a probably very boring story of a\nman inventing the computer into an epic triumph of evil vs good. The\nonly saving grace was the gay theme.\n"},
{"review": "\nIn a way its difficult to write a review on this film about the life of\nAlan Turing, perhaps after Einstein the greatest scientist of the 20th\ncentury.The difficulty is the character of Turing which is given a\nportrayal by Benedict Cumberbatch which is one of the finest I have\never seen on screen. Turing invented the Turing machine which all\nmodern digital computers have their foundation,but is Turing actually a\nmachine himself? He is almost like DATA from Star Trek, in this very\nspecial performance. Alex Lawther as young Turing is also absolutely\nbrilliant. This life story of Turing is shown in three parts, swinging\nbackwards and forwards. The only weakness is when we get to the major\n\"faction\" part of the story concerning the Soviet spy John Cairncross.\nAnybody that knows the true story concerning Cairncross knows that this\ninteraction with Turing is a load of fiction. The rest of the Enigma\nstory is fair enough, although the way how the \"cribs\" such as Heil\nHitler were discovered is treated in the film, with lets say a poetic\nlicense, which is OK by me.\n"},
{"review": "\nWhat an absolutely riveting watch this is! There is some superb acting\nin this imagined story giving an explanation of Turing's role in the\ncode-breaking efforts at the secret Bletchley Park. Even Cumberbatch's\nbright blue eyes give us a story - pinched pupil's at the moment he\n'separates' from Joan Clarke (Knightley), for example. Thankfully,\nKnightley gives us a better performance than she has done for some\ntime, though, some dialogue could have been better formulated. I might\nalso quibble with the less than believable hat-less and cap-less\ncharacters at times - Charles Dance's luminous white bonce should often\nhave been under a hat and, there should have been more Brylcream in\nevidence. But, hey, this is a really engaging film. Motives, scenes and\nquotes quite likely filched from other stories are used to set the\nscene - and set the scene they really do. We don't necessarily have to\nbelieve them though. Turing is, in this presentation, given an\nAsperger-like tic - well, true or not, it helps this particular story\nalong very well.\n"},
{"review": "\nEven before I researched into the true story of Alan Turing and the\nsignificant part he played in the war effort I could tell when this\nmovie was straying into fiction. Commander Denniston ordering the\ndestruction of Turing's 'Bombe' decoder machine (renamed Christopher in\nthe movie after Turing's schoolboy friend), Turing getting punched in\nthe face (I don't think so!) and the absurdity of one of the\nCryptographers having a Brother on-board one of the ships during the\nsequence when Turing forbids the team informing the Hierarchy of an\nimminent U-Boat attack on the British fleet (Please!). Cumberbatch is\ngood as Turing but its not an Oscar winning performance nor is this the\nbest film this year....but then again last years Oscar was won by the\ndreadful '12 Years A Slave' so anything could happen.\n"},
{"review": "\nDefinitely one of the best films I have ever seen. Benedict Cumberbatch\ngives a performance of a lifetime. His chemistry with Keira is simply\nbeautiful. The film is a masterpiece. I was at the edge of my seat the\nentire time. I had an unexplainable, extraordinary feeling whilst\nwatching it. Tears were streaming down my face. I am not saying that\ndoesn't happen often, but this time it was different. The Imitation\nGame is a heart-breaking, impeccably written film, with an amazing\ncast. I have read the book that it's based upon and all I can say is\nthat Ghram Moore deserved his Academy Award for best adapted\nscreenplay. When I walked out of the cinema I knew I have found my new\nfavorite. As a filmmaker and student of Film and Broadcast Production,\nI highly recommend this film.\n"},
{"review": "\nAmazing biopic and outstanding cast with Benedict Cumberbatch leading\nthe race. He demonstrates in this piece why he is one of the greatest\nactors of his generation. Great pace and the film does not let up until\nthe final moments. Both captivating and heart-rending. Definitely an\naward worthy film. The way the film tackles the different themes of\nsex, morality, ethics and patriotism left me interrogating myself. The\ndialogue is taut and the action constrained but very intentional and\nthe actors really do an amazing job of guiding us along the story. Each\ncharacter was very distinct with their own motivations and truths (and\nthis is not necessarily a universal concept). I applaud writer and\ndirector alike for the singular vision that was brought to the fore.\nFilmmaking at its finest and a classic that will be remembered for\nyears to come.\n"},
{"review": "\nKnowing the story of Turing I wondered how they could make a movie\nabout him that wasn't boring.<br><br>They certainly tried. To do this they made up a lot of stuff and left a\nlot of stuff out. Right from the start there are subtle warnings - like\nwhen we see video of early war British battleships sounding late war\nAmerican destroyer sirens.<br><br>Too many other reviewers have gone into all the other inaccuracies so I\nwon't list them again here. <br><br>No matter how many positive reviews about this movie you read here\nplease note that there is a good chance you will be bored. Secondly,\ndon't believe the fairy tale the script writers have come up with.\n"},
{"review": "\nThis and The Grand Budapest Hotel, I believe, were two of the best\nmovies of 2014. Ironically both films were scored by the same composer.\nKudos to him.<br><br>The acting and screen writing to this movie was impeccable. Great,\ngreat, great is all I can say about those aspects of the film.<br><br>All the actors were superb especially Benedict Cumberbatch who I\nbelieve should have won the Academy Award for his performance. I am\nlooking forward to the next season of Sherlock.<br><br>I also enjoyed the acting and roles played by Mark Strong and Charles\nDance. I first came across Dance in The Jewel in the Crown and thought\nhe would go far but alas such was not the case.. As to Mark Strong,\nwhat can you say? He is one of the best actors around.<br><br>The only let down related to Keira Knightley - her over the top accent\nand that ugly, repulsive hair colour. Why on earth did they give her\nthat shade of hair colour for the movie? It was distracting to me.<br><br>This movie is great. By all means see it. You will not be let down.\n"},
{"review": "\nThe Imitation Game is a must-see. Perfect for those interested in\nhistory, technology, social conventions affecting groups (women, gay\npeople, those with autism) and the struggles of visionaries way ahead\nof their time.<br><br>I knew a bit about Turing from computer science studies, but was eager\nto learn more. While The Imitation Game does take some artistic license\nin dealing with the facts, it more than makes up for it by delivering\nan intense, thrilling and surprisingly funny drama with a tragic\nending.<br><br>The story covers the historical aspects of Turing's work and includes\nsome glimpses of his earlier years in a beautiful, engrossing way,\nthanks to a stellar performance by Alex Lawther. Benedict Cumberbatch\ngives his best performance yet as the adult Turing, and the rest of the\ncast is excellent as well. I was pleasantly surprised by Kiera\nKnightley's strong performance as Joan Clarke; she movingly portrayed\nthe struggles faced by a brilliant woman in a technical setting, and\nshe showed the compassion and support that helped Turing endure some of\nhis struggles.\n"},
{"review": "\nThe Imitation Game is a historical thriller starring Benedict\nCumberbatch and Keira Knightley, based on the life of code-breaker Alan\nTuring. I found it very suspenseful and the subject matter was\nfascinating too. Benedict Cumberbatch gives possibly the performance of\nhis career.<br><br>Alan Turing (Benedict Cumberbatch) is a brilliant but socially awkward\nmathematician recruited by British Top Secret Intelligence to help\ncrack Enigma, an extremely cryptic code created by the Nazi military\nduring World War II. Enigma is considered impossible to decipher but\nAlan, along with his team of code-breakers, believe it can be solved,\nnot necessarily by a lone human, but with a machine.<br><br>Benedict Cumberbatch was fantastic in this movie. He really channels\nthe way he plays Sherlock Holmes from Sherlock into his portrayal of\nAlan Turing. Keira Knightly was great as well as one of Turing's\ncode-breakers Joan Clarke.<br><br>I rate it 8.5/10.\n"},
{"review": "\nBest movie i have seen, in a long time, was afraid to see the movie, if\nit was bad, but i am glad I did it. The movie is brilliant, love every\nbit of it, exciting,gripping and touching. A film that leave behind a\ngreat impression. The actors play great, Benedict is amazing, as this\ncrooked person, with obvious difficulty's.<br><br>To all who complaints,that its not historically accurate. The people\nbehind the movie, know it is not quite historically accurate, current\nthey pronounced it is loosely based on Allan Turings life. So they did\nknow, when they made the movie.<br><br>Overall amazing piece of movie.\n"},
{"review": "\nThis film is about Alan Turing and it's about his life before, during\nand after the WWII. Alan Turing is an mathematics teacher and is also\none of the smartest persons alive. Alan and other scientist are trying\nto crack the Germans communication system called Enigma. I don't really\nwant to say to much about the movie, but I really want to write what I\nreally think of it. It's a piece of beauty when it comes to acting and\nthe scenes and clothes are really well done. You really set yourself\ninto the movie itself. The movie itself is really good and as I said\nearlier the acting is world class. One of my favorite actors is in this\nmovie and that makes it even greater.\n"},
{"review": "\nThe Imitation Game is an amazing film based on the story of Alan\nTuring. This movie is exhilarating, emotional, poetic, beautiful, and\nlast but not least an extremely saddening story. The cast and acting by\nthe cast were superb, and the story-line was perfectly formed. The\ncinematography was perfect in every-way and very believable for the\ntime setting in which the film is set in. I loved this movie for it's\nstory and in what Alan Turing did for the world as we know it, and I'm\nsadden to see how humanity can be such a disease to not only ridicule\nsuch a human in those times but still act in this behavior today.<br><br>The Imitation Game is a great movie and I highly recommend it to\nanyone.\n"},
{"review": "\nA movie that shows the other side of the war and the heartache of Alan\nwho just wanted to love.<br><br>Going into the movie I had no idea of Alan's sexual preference and how\nintertwined it would be with the movie, it was cleverly done so even\nthe most homophobic of people could relate without really knowing until\nthe end, or if they pieced it together during the movie.<br><br>10/10 rating is just like every other 10/10 rating people have\nsubmitted. I prefer a simple message that this is a movie I will buy\nand be proud to display in my cabinet of very few other movies over the\nyears. It may not be a movie full of drama or action that I would watch\nevery few months like a fanatic, but it's a movie I have enjoyed, and\nlikely to not forget, just like WWI and II, it plays it part of bring\nhistory back to life.<br><br>A movie which should be played in history classes in school.\n"},
{"review": "\nGood film, would have been an excellent film. However the shockingly\nre-writing of history and the glaring movement from fact to fiction\nrather took the edge off it for me.<br><br>Might as well have changed the character names as well. Should have had\nthe disclaimer any resemblance to actual events and persons very slim.<br><br>At the end of the film you have the feeling that the film has been\nadapted to fulfil clichés. The computer is re named christopher and we\nare meant to think that this is representing Alan Turing lost love!<br><br>Why, oh why could it not have been closer to reality. At the end of the\nday it leaves you with the slight feeling that you have been conned.\n"},
{"review": "\nNice to watch and main cast play was very on the top, However most of\nthe story is fictional. Alan Turing didn't build Enigma machine, nor he\nbroke the actual code. History wise, Enigma code was broken by three\npolish cryptologists: Marjan Rejewski, Jerzy Rozycki i Henryk Zygalski.\nAlso according to some posts on internet Alan personality was also\naltered.<br><br>As I wrote, The movie in nice and the main actor does very good job\nhowever the whole story is very different from reality and information\non the front saying that the story is based on Alan Turing live is very\nmisleading.\n"},
{"review": "\nI was really looking forward to see this movie. As a gay man working\nwith computers all my life, and the director being one of my fellow\ncountrymen, my expectations were high. Unfortunately I left the cinema\nvery disappointed. In my view, Morten Tyldum should not have applied\nthe recipe of a Harry Potter movie to such an exiting historical drama.\nOr maybe a comparison to the Sherlock Holmes movies by Guy Ritchie\nwould be closer, just without the action. It is difficult to express\nthe immense irritation and frustration the format of this movie\ncreated. The cast is excellent, but the director's choice of a fairy\ntale format is ridiculous. If you are looking for a Disney movie, I\nguess you would enjoy it though.\n"},
{"review": "\nHere I was a happy little clam watching a WW2 movie. Sure, it was\nrather predictable and makes much of Turing's accomplishments which are\nrather exaggerated as the Poles had broken Enigma some four years\npreviously(as noted by another reviewer). What struck me as the\nabsolute height of idiocy was the fact it took them some two years to\nthink of using recurring words in trying to break the cypher. When I\nwas six I bought a book on cyphers and the first thing you learn is to\nsearch for recurring letters and words. After half the movie it became\nmore than apparent that this was not a movie about the Enigma machine\nbut was yet another thinly veiled tale of a poor hard done by\nhomosexual. Yes! Just another in a never ending litany or Hollywood\nproductions about homosexuality. I feel cheated.\n"},
{"review": "\nIt was like watching a more serious version of Sheldon Cooper and I\ntotally loved it. The movie is very well executed. It has an\ninterestingly developing plot that keeps you engaged, great cast with\nBenedict Cumberbatch and Keira Knightley acting marvellously and it\nevokes curiosity about a true event and makes you wonder 'did this\nactually happen'. And not to forget it is emotional at times which\nmakes the movie even more likable. <br><br>The real-life lessons: One lesson that can be identified and is quite\nimportant is that you need friends to achieve what you want to. You\nneed other helps, team work not matter how smart you are. Alan Turing\nonly really had a chance to build the machine and crack the code when\nhe received the support and help of his colleagues. It pays off to be\nnice. Secondly, being sociable and talking to people is crucial even\nfor the workplace work. Alan Turing only got the idea of how to solve\nthe code during a random conversation with a stranger that he met a bar\nthat he otherwise wouldn't be in if it wasn't for him having made\nfriends.\n"},
{"review": "\nThis movie was a let down for me, but that still doesn't mean that it\nwas a bad movie. This movie was a very interesting look at the times\nback when war was almost upon us. The acting in this film was excellent\nfrom everyone involved, but especially that of Benedict's. The editing\nand the shots were both very good, and at times even genius. The\nsoundtrack was also very good. I'd recommend this movie to anyone who's\ntired of the action packed explosion fests like the Fast and Furious\nfilms (Thank god that's over) or anyone who's interested in history\nreally. The reason it was a let down for me was the fact that it wasn't\nas well written as I'd hoped. Still good.\n"},
{"review": "\nA masterpiece that fits the life of a true hero that Alan Turing was.\nRemarkable performance by Benedict Cumberbatch which should have been\ncrowned with an Oscar, in my opinion. But for me the best thing about\nthe movie is the the score by Alexandre Desplat. Moving, beautiful and\njust perfectly sending shivers down your spine in every moment of the\nfilm, without being intrusive. Never bought an OST before but after i\nsaw The Imitation Game, i did. Just watch this moving Drama/Biography\nand sink into it, with the great tunes of Alexandre Desplat. The only\nthing why i gave 9/10 points and not 10/10 is Keira Knightly. She\nplayed the role good, but in my opinion not good enough or let's say\nnot as memorable as Benedict Cumberbatch did. So a bit overrated for\nme. But all in all a must-see in every aspect.\n"},
{"review": "\nBased on a true story of Alan Turing, Morten Tyldum's Oscar-nominated\nmovie The Imitation Game, depicted Turing's life during World War II as\nAlan Turing tried to crack the enigma code with the help from fellow\nmathematicians. <br><br>The Imitation Game was vibrant and lively, engaging its audiences on\nthree levels: The fascinating way the Nazis managed to outsmart the\nrest of the world until Turing came along, how his giant computer\nworked, and what happened to him in the end, when the truth about him\nwas finally revealed. <br><br>However, the movie had been criticized for inaccuracy, and historians\nclaimed that Turing wasn't a socially awkward, fragile man as depicted\nin the movie, but rather a brave and courageous man. But still, I\nenjoyed the movie because it held the interest of the audience through\nseveral dramatic qualities. <br><br>The lead actor and actress Benedict Cumberbatch, and Keira Knightley,\ndid a fine job, even though he was perhaps too well fixed in the minds\nof the audience now as another peculiar genius, Sherlock Holmes. <br><br>87/100\n"},
{"review": "\nA movie which oozes Britishness from every frame, The Imitation Game is\nan instant classic. Wartime Britain is depicted vividly, if a little\ncaricatured, with an autumnal palette and a jaunty air.<br><br>A true story, sympathetically told, with good performances all round\nand a stand-out Turing from the indefatigable Mr Cumberbatch. The young\nTuring is also extremely well realized by Alex Lawther.<br><br>Meandering through Alan Turing's life since school until shortly before\nhis death, the script demands your attention and regularly makes you\nsmile.<br><br>Highly recommended.\n"},
{"review": "\nThis is NOT a well made film. Number one - the dialogue is stilted.\nNumber two the actors are wooden. The glowing reviews must have been\nposted by relatives and close friends of the actors because there is no\nway this rates 8.1. Add to that, the editing is sloppy, with quick\nbreaks to flashbacks and even quicker breaks returning to the central\nstory. All this with a lack of continuity of the four segments, present\n1951, childhood at school, prewar, wartime, then no resolution to any\nof these parts. Then as to the ending - was there a reason for the\nassumed reconciliation? Benedict must be replaying Sherlock in this\nrole, using the same facial expressions and quizzical looks. I watched\nintently to the bitter end and wondered why had I done so?\n"},
{"review": "\nThe Imitation Game with Benedikt Cumberbatch!<br><br>The Movie is based on a true story about the code from the German\nEnigma. The story has a few historical mistakes, but they are not very\nimportant.<br><br>Cumberbatch plays his role as brilliant as always. (Like in Sherlock)\nThe same applies for Keira Knightley. <br><br>The music by Alexandre Desplat is absolutely fantastic and the best\nsince Interstellar.<br><br>In my opinion \"The Imitation Game\" is until now the best movie in 2015\nand one of the best in the last years.\n"},
{"review": "\nHave to agree with the first review (at least when I logged on) that\nthe movie is inaccurate. It's laughable that a half-dozen cryptanalysts\nhandled all the intercepted traffic. Actually, three round-the-clock\nshifts of 10,000 people worked in Ultra! The secret of Ultra started\nleaking out in 1967, hardly \"more than half century.\" Decryption of\nGerman messages was uneven, to say the least. It required carelessness\non the part of users; the Luftwaffe was the worst offender. Since\nGoering managed to control what should have been ground forces, this\ngave away army secrets as well.<br><br>At the movie's end, Turing is summarizing Ultra's contribution. The\nmention of Ardennes (aka, Battle of the Bulge) makes one wonder what\nthe script writers really know. This was a monumental failure of Allied\nintelligence. The Axis were now using landlines and Hitler was keeping\nthe operation largely to himself anyway. Ultra's greatest contribution\nwas winning the war against the U-boats if only because this was\nfoundational to all other efforts.\n"},
{"review": "\nI bought this DVD because on the many positive reviews here. I have to\nadmit that I have never heard before about these secret codes. It was\ninteresting to see how hard it was to decode the enigma code. Benedict\nCumberbatch delivered a very convincing role and should have won the\nOscar. Nonetheless i wouldn't watch it again. It has not a fast pace\nand there are some too long dialogues. So it was sometimes boring to\nwait until the next interesting scene came. For all people who didn't\nhear about this secret mission before it is really worth a watch.\nOtherwise check it out only if you have nothing special to do. See\ninstead the other great second world war mini series Band of Brothers.\n5/10.\n"},
{"review": "\nNot Alan Turing cracked the Enigma. It was an team of polish\ncryptologists in 1932. They are: Marian Rejewski, Jerzy Rózycki and\nHenryk Zygalski. Rózycki buid an machine named \"cryptographic bomb\"\n(cyclometer) and decoded so the enigma. So the poles could buid the own\nprototypes of Enigma. As the WWII began, they are moved from Poland to\nFrance and then to England and bring the Enigma prototypes and their\nexperience to the allies. All work of Turing and other cryptologists,\nbased on the polish discovery.Not Alan Turing cracked the Enigma. It\nwas an team of polish cryptologists in 1932. They are: Marian Rejewski,\nJerzy Rózycki and Henryk Zygalski. Rózycki constructed an device named\n\"cryptographic bomb\"(cyclometer) and decoded so the enigma. So the\npoles could buid the own prototypes of Enigma. As the WWII began, they\nare moved from Poland to France and then to England and bring the\nEnigma prototypes and their experience to the allies. All work of\nTuring and other mathematics, based on the polish discovery.\n"},
{"review": "\nA superbly written script which keeps the viewer engrossed in the\nstoryline from the very start. It is not only an apt tribute to war\nhero but also to a high caliber mathematical prodigy. The tenacity of\nAlan as well as the group is a lesson to be learned by all. <br><br>The movie also makes the viewer sympathize with Alan's personal\nproblems and the challenges he faces because of his homosexuality. This\nmovies would surely help a section of the viewers to grow sympathetic\ntowards the LGBT community and the need to give them space in our\nsociety. A must watch for people interested in biopics as well as in\nworld war movies.\n"},
{"review": "\nThis has to be one of the best films of this or any other year. It\nfeatures a performance from Benedict Cumberbatch that will surely win\nhim an Oscar. He is supported by an outstanding cast and a story line\nthat if it were not true would be hard to believe! As a tribute to Alan\nTuring this fine film fits the bill. The story will be familiar to most\nbut still manages to have a few twists and turns along the way as\nTuring's personality clashes with those above and below him. Benedict\nCumberbatch presents Turing as someone who is just too intelligent for\nnormal society. His obsession with cracking the code leads to tension\nwithin his team and a lack of support from those above him. His\nsexuality is touched upon at the end of the film and his post-war years\nviewed from 2014 seem to be from another different world of social\nacceptability. A must see film!\n"},
{"review": "\nGoing in - as an AI major, nonetheless - I was pleasantly surprised\nsomebody actually dug up significant money to make a film about such a\nniche subject. Having actually seen it, I'm a bit torn. <br><br>The good news: \"The Imitation Game\" is a well-meaning biopic about a\ngreat, complex man most people haven't heard about but absolutely\nshould. It's highly recommended if you have a passing interest in\neither computers or WW II.<br><br>The bad news: the film has been considerably dumbed down to make it\nsuitable for mass consumption, leading to far-fetched dramatic setups,\nnonsensical science, forced dialog and a simplistic rendering of pretty\nmuch all of its characters. Knightley and Goode have little to work\nwith, and Cumberbatch fails to fully tap into his inner nerd: Turing's\nsocial awkwardness is never real, and neither are his autistic\nmannerisms. You'd probably be best served to skip \"The Imitation Game\"\nif you know a lot about computer science or related fields, as it will\nleave you either underwhelmed or slightly insulted.\n"},
{"review": "\nAfter all the rave reviews I was expecting a much better movie.\nUnfortunately they spend way too much time on the gay angle and not\nnearly enough on the intelligence gathering at Blechly and the\naccomplishments of Turing and his team in that regard.<br><br>So they strayed away from the book this is based on and I think it was\nquite detrimental to the movie. Obviously at some point the script\nwriters decided that spending more time on Turings homosexuality would\nmake the movie more interesting. I couldn't disagree more.<br><br>The book went into a lot of detail about the intelligence gathered that\nhelped Britain win and some of the drama surrounding that. There were\nalso things that went on with the enigma device such as adding the 4th\nwheel that the movie did not get into at all.\n"},
{"review": "\nJust saw this at the Savannah Film Festival. This movie is Oscar\nworthy. Excellent plot excellent actors. Can't wait for it to be in the\nmovies to see it again.the story is so interesting to watch. It was\npowerful. Never knew about this part of history. The acting was superb.\nBenedict Cumberbach was fabulous. Scenery was great. It was like you\nwere actually there. Just saw this at the Savannah Film Festival. This\nmovie is Oscar worthy. Excellent plot excellent actors. Can't wait for\nit to be in the movies to see it again.the story is so interesting to\nwatch. It was powerful. Never knew about this part of history. The\nacting was superb. Benedict Cumberbach was fabulous. Scenery was great.\nIt was like you were actually there.\n"},
{"review": "\nIt is Turing for Dummies. I am reminded of the Al Jolson story where\nthey neglected to mention two of his four wives in his bio pic. The\nPoles made a huge initial contribution to tackling the Enigma problem.\nThis film not only largely ignores that, but creates the impression\nEnigma was all that happened and Turing was running the whole show. The\nreality is a complex, compelling and far more thrilling story involving\na collection of very clever people. There is no mention of Tommy\nFlowers. Tommy who? And what of the Lorenz traffic? What of Max Newman\nand John Tiltman. His team reverse engineered Lorenz without ever\nseeing one. It was an astounding intellectual exercise. Turing was a\ngenius, one of many at Bletchley. I think he deserves better than this\ntwaddle by numbers. I am surprised they didn't include a montage and a\ngroup of Bletchley staff walking in slow motion in front of a series of\nexploding Enigma machines. It is puerile lazy dross.\n"},
{"review": "\nA fascinating story about the other side of the war. Not the one of\nblood and tears but the figures and mystery one. An intense film that\nhighlights the overlooked aspects of war trough a striking story.<br><br>And what better way to play a genius that with another genius ? Indeed,\nBenedicth Cumberbatch is absolutely bluffing in the role of Alan\nTuring. He really brings us into his mine, helped by flashbacks which\ntake important moments of his life.<br><br>A successful biopic, carried by an excellent cast (Benedicth\nCumberbatch, Keira Knightley, Mark Strong) and a staging that takes us\ninto the incredible world of Turing.\n"},
{"review": "\nAlan Turing, a weirdo of his times, had the brains for puzzles but\nsocially inept. Once his talent and genius is appreciated by the\ngovernment, he is fancied. He engages the computer revolution by\ncreating a working machine that could crack the German encrypted radio\ntransmissions, called Enigma. In so doing saving many thousands of\nlives and ending the war at a sooner date, and might also alter the\noutcome of the war. The film would have been great fiction if it wasn't\nfrom reality.<br><br>(SPOILER) The film has some strange undertones and should be noted as a\nwarning to all inventors who act in the benefit of their country. See\nthat his employer in the British Secret Service. Plants in the work\ngroup a Russian spy, and the secret service employer himself is a\nCommunist ! Once Turings homosexual activities is discovered, His good\ndeeds was soon forgotten. The British Goverments thanks him by putting\nhim on a medical treatment, resulting in his suicide. His reward was a\ndeath sentence ! A tragedy .\n"},
{"review": "\nI hesitated a long time before watching this film, because I feared\ndisappointment. My fears were realised. Crucial parts of the story are\ngrossly distorted. In particular, the depiction of Turing's colleagues\nand of his boss, Alastair Denniston, unacceptably, and unnecessarily,\ntraduced them, and Turing himself. Denniston had been a schoolmaster\nbefore he became a code-breaker, and understood his people. When\nrecruiting for the forthcoming war, he realised that mathematicians\nwere going to be needed as well as linguists. And there is no evidence\nwhatsoever that Turing's colleagues regarded him with anything other\nthan affection and respect, as evidenced by his nickname of 'the Prof'.\nAs to the 1951 episode, Turing told the police himself that he had been\nwith a young man at the time of the burglary. The truth is dramatic\nenough, and I cannot understand why the film lacked the confidence to\nstick closer to the facts. In the end I could not stand it any longer\nand switched off. I prefer my biopics to stick closer to the bio.\n"},
{"review": "\nThe Imitation Game, 2014.<br><br>*Spoiler/plot- A 'bio-pic' covering a gay member of the British staff\nthat broke the German \"Enigma\" machine military coding machine and it's\ncomplex language during WW2. The ethics of this complex situation is\nexplored through the plot with the film's characters.<br><br>*Special Stars- Benedict Cumberbatch, Keira Knightley, Matthew Goode,\nRory Kinnear, Allen Leech.<br><br>*Theme- Global issues can be coped with through honesty and\nprofessionalism.<br><br>*Trivia/location/goofs- UK production.<br><br>*Emotion- The heroic historic story of the WW2 Enigma machine and code\nbreakers was interesting. The preachy gay under plot towards the film's\nend ruined the under plot for me.<br><br>*Based On- The historic successful attempts to break the German\nmilitary \"Enigma\" machine and codes by Allied mathematicians.\n"},
{"review": "\nI don't know in what amount this movie is historically inaccurate, as\nmost of reviews claim, so I'm judging by what I can judge. For much\ntime I thought this actually won the Oscar for best picture, then I\nrealized it hadn't. (I have sometimes prejudices towards latter\nOscar-winning films.)<br><br>The first thing I liked about it was the non-linear story-telling,\npartly similar to Christopher Nolan's movies. Other than that the story\nmanged to be touching the way it was told, although it included the\ntheme of homosexuality with which I'm not completely comfortable. In\naddition, it managed to be exciting, without any action. Definitely\nBenedict Cumberbatch performed greatly in the role of Alan Turing.<br><br>I might confront this movie's magnitude with \"The king's speech\". It's\nso similar in themes that it almost feels a sequel to said movie. To\nsum up, The Imitation Game isn't a really bad movie, but not a\nso-excellent movie. It's averagely good.\n"},
{"review": "\nWell when a movie like 'The imitation game' is nominated for Oscar\nawards you feel happy because it deserves a nomination. The movie\nrevolves around Alan Turing (Benedict) and his efforts to decrypt the\nEnigma codes used by Germans in their battle against the Allies. The\nstory is pretty straight forward but it is the plot and the screenplay\nwhich keeps you bonded with the movie. The film also reveals the dark\nside of our society and its mentality about homosexuals.<br><br>Alan is a complete genius and Benedict looks so natural that you forget\nthat he is just playing a character of Turing. Kiera Knightley does her\nrole pretty well. The other supporting characters of the film are good\nas well. Overall a must watch film!!\n"},
{"review": "\nThis is thoroughly enjoyable. As an aside, I wonder if I can sort out\nthe truths: Here they are: Turing was gay. And a mathematical,\nscientific genius.<br><br>And he may not have killed himself.<br><br>The untruths are legion: Joan Clark was plain and practical and would\nnever have uttered the anachronistic bilge she spews here.<br><br>Enigma was invented years before in Poland.<br><br>Turing didn't have control over the Nazi plans of bombing sea lanes,\netc. In fact he had no access to maps of such detail. Ever.<br><br>And much, much more, far too long to list here.<br><br>But in watching the brilliant Cumberbatch and his numerous sidekicks\nthere is enormous admiration for great acting, excellent direction,\ngood sets, and brilliant atmospheric cinematography. Score is well done\ntoo.<br><br>So 8 out of 10 for fact suspension and a ripping good yarn.\n"},
{"review": "\nDear readers, keep in mind that this my first ever review at IMDb so go\neasy on me. The fact that i took the time to actually sit down and\nthink-write a review means that it is a good movie! Anyway here goes\nnothing! Oh and the review does contain spoilers and a bit of iffy\ngrammar and spelling. Apparently if we systematically bully our\nbrightest students (especially those we suspect are gay) we will be\nable to produce amazing super-scientists who will advance science in\nincredible ways and potentially win wars!<br><br>Irony aside, the movie deals with one of the less known and\nunappreciated aspects of WW2, and its brilliant at that!<br><br>Performances where a bit flat and the plot predictable but sufficient.\n"},
{"review": "\nThe story about Enigma has been told before. Also in the pictures. It\ndoesn't stop it from being fascinating, but reality was probably more\ninteresting than all film melodramas.<br><br>This is one of them. It's not just about breaking the German codes,\nit's also much about homosexuality during a time when it was sociably\nunacceptable.<br><br>But this film just tells. It doesn't give us any soul insights, which\nwasn't to be expected, since this is quite mainstream. England during\nwartime is shown in a rather competent way, but it stops there. And the\nexciting story about breaking Enigma is told once again.\n"},
{"review": "\nA typically impressive leading performance by Benedict Cumberbatch ties\ntogether both the successful and the looser elements of the story.\nOverall, The Imitation Game can't escape coming off as distractingly\nhistorically inaccurate, which ultimately leads to a bitter aftertaste\nonce the novelty of viewing another well acted biographical drama wears\noff. The character of Alan Turing himself is only paid arguably just\nhomage, as he's portrayed with borderline Asperger Syndrome to keep\nwith Cumberbatch's socially awkward genius typecast. That being said,\nthe sacrifices in terms of history pay off in terms of drama, as\nviewers can feel the tension wanting to be portrayed by the crew in a\nmore personal manner than if what historically happened was actually\npresented on screen. All in all, it's a recommendable drama, though not\none of the best that 2014 had to offer overall.\n"},
{"review": "\nThe movie tells the story of Alan Turin, the man who broke the enigma\ncode. Performancy wise, the movie is excellent. Every actor seems\ncommitted to its role, and that helps the movie. The story itself is a\nstrong one, and although the back and forth are a little tiring, the\nstory line is understandable. Of course the whole breaking the code is\nnot that understandable unfortunately, and the presentation of it isn't\nhelping. For me, analyzing the characters was more entertaining than\nthe actual code breaking. The whole atmosphere of the film is nice,\nalthough doesn't really shouts war period easily. And so, I give the\nimitation game a 4 out of 10, because it could have been presented\nbetter.\n"},
{"review": "\nOne of the many things that make \"The imitation game\" into a great\nmovie is the amount of detail that has been put into small details\nabout Alan Turings life. Almost everything in the movie actually\nhappened to Alan Turing which makes it even more interesting to people,\nlike me, who know a lot about Turings life. Having a special interest\nfor Turing and/or mathematics is definitely not required to still enjoy\nthis movie as we are not only dealing with a bunch of terrific actors\nwho really fit their roles (I personally think Benedict Cumberbatch was\nan amazing choice for Alan Turing) but also a story which is both\ncompelling and well written. The only minor complain I have about the\nmovie, which keeps it from being a 10/10 movie, is the fact that the\nending could have been better especially considering how Turings story\nin reality ended. If you liked this movie I would also recommend: \"The\ntheory of everything\" \"The wolf of Wall street\"\n"},
{"review": "\n\"The Imitation Game\" is one of that movies that you MUST see at least\none time in your whole life. I went to the cinema with the feeling that\nthis one was going to be a great movie...and so it was! Not only for\nthe amazing cast and their incredible performances (Benedict\nCumberbatch-War Horse,Keira Knightley-Atonement,Mark Strong-Zero Dark\nThirty, Charles Dance-Game of Thrones), but also for the wonderful\nstory that hooks you from the beginning.<br><br>The film tells the race against time of Alan Turing ( Benedict\nCumberbatch ) and his team in their attempt to decipher the Enigma\nencryption machine of Nazi Germany during World War II .Focusing on the\nmost important periods in the life of Turing : when the young boy is\nunhappy and bullied at boarding school, the triumph of his secret\nwartime work in building the revolutionary machine to decipher Enigma,\nwho was able to break 3000 naval codes generated by that one, and also\nhis unfortunate years after the war.<br><br>Finally,I left to say that this film was rewarded for 8 academy\nawards,and 5 golden globe awards.\n"},
{"review": "\nMy summary line might be a bit out of touch, but it was the first thing\nthat came to my mind and I just put it there. The movie itself is\nanything but light (you won't be able to find too many funny moments in\nthis, though the direct and dry responses by Benedicts \"character\" do\nhelp with that a lot), telling a true story, about someone who had to\novercome a lot of obstacles.<br><br>It might be easy for those who know the real person or to others who\nobserved better than me, to see one of the biggest dilemmas of our\ncentral character is. There are a lot of course (not being able to take\nno for an answer, unable to work in a team and so forth), but I'm\ntalking specifically ... and a thing he might not be able to \"work\" on,\neven if some try to make you believe there is always \"a choice\".\nPutting this all into the mix, might feel too much for some, or not\nnearly enough to create real tension. But the movie is very well made\npersonal journey through a difficult time ...\n"},
{"review": "\nWasn't sure what I was going to get with this movie as I have not been\nmuch of a fan of Benedict Cumberbatch. I was pleasantly surprised to\nwarm to him as a character and to appreciate his skill as an actor. The\nmovie is extremely good with amazing performances by both Cumberbatch\nand Keira Knightly. I can appreciate now why he was nominated fir an\nacademy award. The plot of the film is well known but it was\nenlightening to learn the details of how it all happened and how things\nwere hidden by the government. I really cannot fault anything in this\nmovie. A great cast with some extraordinary performances. Well worth\nwatching.\n"},
{"review": "\nDuring the winter of 1952, British authorities entered the home of\nmathematician, cryptanalyst and war hero Alan Turing (Benedict\nCumberbatch) to investigate a reported burglary. They instead ended up\narresting Turing himself on charges of 'gross indecency', an accusation\nthat would lead to his devastating conviction for the criminal offense\nof homosexuality - little did officials know, they were actually\nincriminating the pioneer of modern-day computing. Famously leading a\nmotley group of scholars, linguists, chess champions and intelligence\nofficers, he was credited with cracking the so-called unbreakable codes\nof Germany's World War II Enigma machine. An intense and haunting\nportrayal of a brilliant, complicated man, THE IMITATION GAME follows a\ngenius who under nail-biting pressure helped to shorten the war and, in\nturn, save thousands of lives.\n"},
{"review": "\nIf you are looking for a movie just about cracking the enigma code then\nthis isn't the one. There is a lot more to it than that. To start off\nthe acting is stupendous. I couldn't picture any other actor other than\nBenedict Cumberbatch to portray Alan Turing. When I say that this movie\nis not just about enigma I mean that its more about the life of Alan\nTuring. One thing I did not like was how the whole story turned so\nquickly on the subject that Alan was gay. They did it so abruptly. They\ncould have started the story with us knowing, because in the end the\nwhole story is about how he was gay and how he changed the world even\nthough people hated gays. So in conclusion great acting with a decent\nstory behind the whole thing!\n"},
{"review": "\nYou have to listen carefully otherwise you will miss the plot.\nThismovie makes you think and makes you feel . Cumberbatch with a\npower-packed performance and equally well supported by Mathew Goode and\nKeiraKnightley . This has to be in the top 3 movies of 2014. Never a\ndull moment and every scene is well taken and kudos to the editing team\nfor it. I would give this movie a 8.5 out of 10. And I had to tell you\nI loved the theme music of this movie.This quote is the best 'sometimes\nit is the people who no one imagines anything of who do the things no\none can imagine.From this TV-show guy where he shocked everyone to till\nnow the performance from Cumberbatch is something to stand and applaud\nfor . He might of missed the Oscar this time but he is in the right\npath and his unique way of delivering his lines stand out from the\nrest.\n"},
{"review": "\nThe Imitation Game in my opinion is the worst given the Oscar for best\nfilm in 2015 , the direction of Morten Tyldum , and it has an\ninteresting future , since the Norwegian is still young ( he will\ndirect Jennifer Lawrence and Chris Pratt in Passengers ) the cast draws\nattention , the amazing Benedict Cumberbatch , Keira Knightley ,\nMatthew Good , Mark Strong , and etc. , Benedict Cumberbatch of the\nperformance worth the film, he is excellent as always ( I really want\nto see him as Doctor Strange ) , the script is good, even with a few\nmissteps , I found the chemistry of Benedict and Keira soft spot , I\nfound the movie with slow pace , and I wanted the film to end as fast\nas possible , because I really do not like the movie , the Imitation\nGame is in my opinion weak, even with good performances and a competent\nscript , I found the film slow. Note 4.8\n"},
{"review": "\nStupid and not telling the real truth who really brake Enigma machine.\nEnglish man only can have tea.<br><br>The first breakthrough in the battle to crack Nazi Germany's Enigma\ncode was made not in Bletchley Park but in Warsaw. The debt owed by\nBritish wartime code breakers to their Polish colleagues was\nacknowledged this week at a quiet gathering of spy chiefs. On the\noutskirts of Warsaw, some of the most senior spy bosses from Poland,\nFrance and Britain gathered this week in a nondescript but well-guarded\nbuilding used by the Polish secret services. Their coming together was\na way of marking the anniversary of a moment three- quarters of a\ncentury earlier when their predecessors held a meeting in Warsaw that\nplayed a crucial role in the victory over Hitler in World War Two.\n"},
{"review": "\nI've read the reviews and mostly pointing out the inaccuracy of the\ndetails in the movie. I have never read or learn about Alan Turing or\nany evolution of Computers. <br><br>Based upon the meaning of the movie, I think it is so fascinating. I\nbelieved the producers were trying to point out the fact that being\ndifference is what matters. Ordinary things is boring and wont bring\nany changes. <br><br>Benedict did a fine job as Alan, from being a curious over the head\nthinker (like he always does in Sherlock) to an insecure man. Oh! The\nyoung Alan did a great job especially that scene where he tries to hide\nhis tears upon receiving the sad news about Christopher form the\nheadmaster. All the characters were well played and the scenery of the\nmovie is spot on specifically for the WW period.<br><br>What's more striking about the movie is the indication of the way\nhomosexuals are being treated back then. It just makes me sad, I mean\nwhat else could he have done if he was to live longer. <br><br>9/10\n"},
{"review": "\nI thoroughly enjoyed 'The Imitation Game' from start to finish. It has\neverything; wonderful story, brilliant production, great script and a\nstrong cast. This is one of the few movies that manages to tick all of\nthose boxes.<br><br>I'm not a fan of Benedict Cumberbatch, but I can't fault his\nperformance as Alan Turing in this film - he was brilliant. It can't be\neasy portraying a national hero and it must carry an extra pressure to\nget it right, but Cumberbatch delivers. As do the rest of the cast,\nstrong performances all round.<br><br>I'm pleased they decided to make a movie of Alan Turing's achievements\nand struggles, and it made for great viewing. I wish there were more of\nthese types of films. Highly recommended.\n"},
{"review": "\nOne of the best movies I've seen . Maybe I'm a suspect because study\ncomputer engineering and the topic covered in the film,goes directly\nagainst my interests. No doubt that the film was very well done and\nwhen you learn something with a real interest would be impossible not\nto like. Being all very well done scenario , with an excellent\nperformance by the actors. It leads us to ponder the great difficulties\nthat puzzle decoders, had for the lives they choose to save or not .So\nwithout any doubt I recommend this movie to all people who like\ncomputers, or to learn facts about the epoch of the 2nd World War. For\nI say it better would be completely impossible\n"},
{"review": "\nWhat can I say? It is just awesome &amp; great. A story pushed to its\npotential. The actors did a great job. The scripts were well written.\nThe movie was very accurate. It portrait WW2 really well. <br><br>The movie told the story of Alan Turing really well. The movie did a\ngreat job on promoting the inspiration of Alan Turing. Very heart\ntouching, meaningful, and inspiring film. After watching the movie, I\nwas in thought for a while. <br><br>Recommend all of you to watch it! You'll especially like this movie\nmore if you are the type of person who always have ideas; and does not\nfit in. You will feel a great connection when watching the movie, so do\nI?<br><br>I was not surprised that this won a Oscar award. This movie truly\ndeserved it!\n"},
{"review": "\nThis film is based on the true story of British mathematician Alan\nTuring who designed the Enigma computer that enabled Allied forces to\ncrack the secret codes used by the Axis powers in WWII.<br><br>Turing was a nonviolent man who helped to bring one of the world's most\nviolent conflicts to an end. His experience keeping secrets about his\nown homosexuality no doubt prepared him to keep secrets about the\nimportant project he was working on. He loved solving puzzles and he\nsolved the most important puzzle of his generation.<br><br>As a math / computer / retro-tech nerd, this movie was right in my\nwheelhouse. I gained new respect for Benedict Cumberbatch's acting\nabilities, too.<br><br>The reason why this gets 9/10 and not 10/10 from me is because I felt\nlike the \"Turing Test\" used between Turing and the reporter as a\nframing device was a little forced and clunky. That said, I'm not\nreally sure how they could've found a seamless way to include it.\nMight've been best to leave it out.\n"},
{"review": "\nCaptivating story, accurate or not. WWII London always a poignant\nsetting. Main character was fascinating and endearing. Character\ndevelopment is skillful, for the most part. Cinematography very good.\nGood casting. Like any good movie, it allows the viewer to forget the\nactors are acting and simply enjoying being told a good story. The\nhistorical parts are enriching. The production seems to underestimate\nits audience, with its overt messaging at the end. I would have liked\nto enjoy the crux of the story, without being taken to \"Sunday school\"\nabout the evils of being mean to (gay) people. I think most of the\naudience already believes that. Gratuitous last-minute PR pitch\ndistracts somewhat from the experience.\n"},
{"review": "\nI enjoyed Benedict Cumberbatch and the recreation of the WW II\natmosphere. Also, the story, as a story, was fairly compelling.<br><br>But in the end, the movie insulted my intelligence by oversimplifying\neverything. As just one example, after Turing's machine starts\nsuccessfully decrypting Enigma messages, one team member wants to use\nit to stop an attack on an Allied convoy. And to make it more\nmelodramatic, his brother is on the doomed convoy. They all have a big\nfight about it because some of them realize (apparently for the first\ntime) that that might tip off the Germans that their code has been\nbroken. These weren't dumb people. The problem would have occurred to\nthem long before.<br><br>Overall, the movie was fake, contrived, and manipulative. I understand\nliterary license, but it went way beyond that.\n"},
{"review": "\nI had never heard of Alan Turning until this film came out (thanks,\nAmerican Public School System!) but, if you watch the film, there's a\nreason we never heard of him for a long time. Aside from having his\nactivities classified for some time, Turning's story is a tragic one\nfrom a time when the human race was far less kind to the homosexual\ncommunity\u0085being denied a cake from an intolerant bakery is (and excuse\nthe pun) a cake walk compared to what happened to Turning. And that's\nthe double-edge sword being wielded by the elephant in the room\u0085it's\npart of what makes Turning's story interesting and captivating.<br><br>The tale and tragic end of Alan Turning is completely enthralling,\nhorrifying, bittersweet and interesting all around. The film was moving\nand easily engaging and, when you combine the excellent performances\nfrom not only Benedict Cumberbatch but literally everyone on the cast,\nyou have a film that hits all the right dramatic notes and makes a film\nthat is incredibly emotional and powerful.\n"},
{"review": "\nThe film certainly shows a negative view of British attitude towards\nhomosexuality in the 1950s. Once you were found out, you were literally\nblacklisted, shunned and imprisoned.<br><br>The film deals with the math professor who worked for the government\nduring the war and brilliantly helped to decode a Nazi Enigma Code that\nwould allow for the allies to react before a Nazi attack.<br><br>Benedict Cumberbatch is quite good as the professor. He is essentially\nafraid of life and that's why he is unable to get along at first with\nhis assistants. Of course, he is also trying to hide his sexual\npreference. His homosexual performance reminded me of David Niven's\nOscar winning performance as a homosexual fearing life as well.\n"},
{"review": "\nAlan Turing was a remarkable man, but so much of The Enigma Project, or\nUltra, story, is left untold. The scenes at the bar, the honor among\nmathematicians, and the totally fictional Kiera Knightley character\nmimic The Beautiful Mind. The Beautiful Mind, with a few fictional\nalterations (the nature of Nash's paranoia, etc.) is a true story and\nso well acted. The acting in The Imitation Game was good but two\ndimensional; nothing like Crowe and Connelly in A Beautiful Mind. It\nseems the author/director/producer of The Imitation Game wanted to\nfocus on the terrible treatment of homosexuals - truly tragic, yes.\nCummerbach was well cast but seemed to be playing Sherlock, with slower\nspeech. But to overcome schizophrenia and win the Nobel, with the woman\nyou loved staying by your side (they did leave out the divorce, but\nthey continued to live together) is a true story of heroic stature -\nthe kind Russell Crowe loves.\n"},
{"review": "\nAlan Turing is a mathematician dedicated to his work who has no sense\nof humour . keira knightley is lovely as Joan Clarke , the only woman\ncryptanalyst in highly male dominated field . the sacrifices Alan made\nfor his country are indescribable and cruel treatment by society makes\nit worse . his actions are hard to judge . this movie will leave you in\ntears . it is hard to believe that British society was so narrow minded\nin sexual matters during period around second world war . Alan does\nthings by logic not emotion . the way he decides to propose is apt .\nnot no jargon about breaking codes , focus is on team work to solve\npractically impossible puzzle . narration is solid . the ending is\nunpleasant and pitiful . it is tragic . scenes from war are appropriate\n, i wonder how did they get such archived footage . inferior treatment\nto women in intellectual matters is highlighted . secrets ruin lives ,\nnobody should ever be in such an unenviable position . had second world\nwar not occurred , alan could have made lot of contribution .\n"},
{"review": "\n\"Sometimes it is the people who no one imagines anything of who do the\nthings that no one can imagine.\" During WWII the Germans sent cryptic\nmessages that were easily intercept-able but impossible to decode.\nEngland enlists their greatest code breakers to find a way to crack the\ncodes. Alan Turing (Cumberbatch) comes up with a machine that will be\nable to break any code they can come up with, while at the same time\nhiding his secrets from the world. This is just a fantastic movie. I\nhad pretty high expectations going in and it met or exceeded everyone\nof them. I have yet to see the Theory Of Everything but Cumberbatch did\nan amazing job in this that I am not sure how he didn't win best actor.\nThis is a movie that will both inspire, move and infuriate you all at\nthe same time. I could go on and on about this but I will say just\nwatch it. Today. Overall, easily one of the top movies of the year,\namazingly good. I easily give this an A.\n"},
{"review": "\nThis movie is beautifully filmed, the production and acting is quite\nsuperb, however to keep things in a historical perspective I would\nadvise everyone to also get a copy of the BBC documentary series \"The\nSecret War\" made in 1977 and watch episode 6 which Focuses specifically\non the cracking of the \"ultra\" code, featuring interviews with the\npeople who were actually there at Bletchley Park and elsewhere. The\nmovie tends to give the impression, rather misleadingly, that the\neffort to decode the Enigma messages was done exclusively by a small\ngroup of technicians - whereas in fact it involved a vast, dedicated\nteam of ordinary people who should also be acknowledged for their\ncontribution.\n"},
{"review": "\nAn historical drama on the life of Alan Turing, his achievement in\nbreaking Enigma codes and his life struggles. His machine is one of\ninspirations behind today's modern computers, but sadly ended his own\nlife because of yesteryear's' laws of Britain that punished people\nhaving \"abnormal\" sexual interests.<br><br>Benedict has done his role well for this movie especially the\nstammering parts. Drama is well scripted. The on screen chemistry\nbetween him and Keira is not supposed work out well as per the script\nand both have done well to prove that. That's odd challenge for actors.<br><br>I thought this was some old classical spy thriller and did not have the\nidea of this movie being based on true story. But I really enjoyed it.\nAnybody who has heard/read about Alan Turing or his Turing Machines or\nat least the Turing tests would definitely enjoy this movie. <br><br>This movie movie is worth the rating of 8/10.\n"},
{"review": "\nThe story is just magnificent, Compelling till the last minute.<br><br>The cast is another story,, from Benedict Cumberbatch, Keira Knightley,\nMatthew Goode to Mark Strong and all the characters were amazing and\ntheir roles engaging is indescribable.<br><br>one of the scenes where i really loved their lines: \"I'm not a spy, i'm\na mathematician\" said Alan Turing, \"we're gonna have such a wonderful\nwar\" said Stewart Menzies :D<br><br>The script is well written, the story itself varies in many levels and\nrises from just being a code solver to government worker with MI6 to\nbeing incriminated by being gay ... splendid turn of events, and the\nnarrative style made it more intriguing.<br><br>The ending is sad though,, well supposing that \"this could'v happened\"\nit sends a couple of messages for those who feel odd and maybe\noverlooked from society like knowing that \"Sometimes it is the people\nwho no one imagines anything of who do the things that no one can\nimagine\" ;)\n"},
{"review": "\nI do not expect this movie will be that good when i saw the trailer of\nthe movie.<br><br>Surprisingly the movie play very smooth with Ben shows his very good\nact as the strong character as Alan Turing. I should say this movie was\nvery nice with actors and actresses blended one each other.<br><br>Keira also beautiful and not show a slow pace acting.<br><br>The jokes was very smart and successful makes me laugh.<br><br>This movie is very entertaining and smart.<br><br>Have a strong feels like 'Rush'. Superb.<br><br>I love it.<br><br>10/10\n"},
{"review": "\nTo my knowledge he did not invent this machine just thanks to himself.\nThere is nothing mentioned about Polish people who broke the code. this\nis why he was able to built the machine. Poles did not do it because of\nnot having the money. Very disappointed how it was showed ... As usual\nPoles are the less important in history.. The movie is OK but the\nhistory is not 100% true. The whole story is OK but it is crucial to\nshow how significant role Poles played. Unbelievable how misleading\nthis movie is .Now all people will think it is only thanks to him. Can\nnot even describe my disappointment. Nowadays I believe it should be\nclearly stated that thanks to Polish and British efforts the Enigma was\nbroken !\n"},
{"review": "\nI always enjoy movies more when they are based on real life events. And\nthis one certainly falls into that category. Following all the steps\nthe code breakers had to do to crack the enigma code was pleasant to\nwatch. They are the inventors of our actual computers. Without them I\nwould probably not be typing this right now. Thanks to Alan Turing\n(played beautifully by Benedict Cumberbatch) and his team science took\na big leap. Maybe the story is not 100% accurate about all the\ncryptologists it still remains a good movie to watch. All the actors\ngave good performances and the storyline was easy to follow. I can't\nimagine that anyone would not be entertained with this movie.\n"},
{"review": "\nand he worked on breaking Enigma at Bletchley. There the reality ends\n... apart from the great emphasis on his sexual orientation.<br><br>As I am sure many people familiar with actual history have mentioned,\nthe Enigma was broken in the early '30-s at the Polish Cipher Bureau.\nTuring's work concerned extending that to the enhanced Enigma\nintroduced at the start of the war. Without the work of the Poles\n(which they handed over on the brink of the German invasion) the\nBletchely crew was unlikely to have been able to make headway, and\ncertainly not in time for it to be useful.<br><br>In any case, Turing's most important work (compared to which Bletchley\npales) is his seminal work on computability theory. His paper, together\nwith those of Kurt Gödel produced an earthquake-like shift in\nunderstanding the foundations of mathematics and what could or could\nnot be proved or solved.\n"},
{"review": "\nI haven't got the best eyesight in the world. So I find the current\nstyle of action movie really hard to watch. They move far too quickly\nfor me.<br><br>The Imitation Game is totally different. Beautifully filmed, it had me\ngripped from the start and two hours passed in the blink of an eye -\nthe sure fire sign of a fantastic film. <br><br>The story is so strong. The acting sublime. The music is stunning. The\naction moved between three time frames so easily and clearly. Benedict\nCumberbatch utterly lives up to his reputation as one of the most\ntalented actors on the planet.<br><br>All in all, I found this incredibly watchable. Utterly heartbreaking\nand gut wrenching at times, yet funny and warm.<br><br>If this doesn't win a mass of accolades, then there is something\nseriously wrong with the global awards system.\n"},
{"review": "\nI'm not sure if it's possible to write a spoiler for a historical\naccount, but I checked the spoiler alert box just in case. I think I\ngive lower reviews to movies for which I had high expectations (usually\nfrom overly generous ratings on IMDb), but I think I would have been\nsomewhat disappointed regardless. There is seemingly a very interesting\nstory to be told of Turing's life, but this movie gets a bit lost. The\nwhole police interview as narration that starts at the beginning\nultimately seems flat. It provides an interesting segue to the scene of\nhis ultimate demise, but too little time is spent on what happened to\nhim after the end of the war, or even after the initial success in\nbreaking the code. Instead, the filmmakers seemed more interested in\nshowing how difficult it was to spend time with him until he discovered\nthe value of friendship with Keira Knightley's help. The writing in\nthose parts just felt kind of boilerplate Hollywood. I did think the\nscenes of Alan as a boy were quite nicely done.\n"},
{"review": "\nThe Imitation Game is well constructed, moving and absolutely brilliant<br><br>I was watching this, not really knowing what to expect. Normally I'm\nnot into historical films, but this one caught my attention from the\nfirst minute.<br><br>The actors are terrific, especially Benedict Cumberbatch, he is simply\namazing in this. <br><br>I sat 1 hour and 50 minutes, totally sucked into another universe, and\nwhen I was finished I felt really empty. <br><br>This is easily the best movie I've watched this year, and I'm so happy\nI decided to try it even though it wasn't my usual cup of tea.<br><br>I highly recommend this movie, not just to Benedict Cumberbatch fans or\nhistory lovers, but everyone. Go watch it fellas :)\n"},
{"review": "\nThis story is about a British mathematician in age of the Second World\nWar. Some British are collected a place to decipher Enigma. It is\ndevice used by the German military to encode strategic message before\nand during the war. All the British are intelligent, but especially the\nBritish mathematician are more intelligent than the other British. Thus\nhe doesn't obtain a helping hand from his companies. He is a lone wolf.\nBut he can't decipher the code by himself. Then his companies help him.\nAnd he knows that people is supported by someone and he learns it's\nimportant. <br><br>This is a story that a man develops as a person. This movie tells us we\ncan't live alone. It is necessary for us to obtain a helping hand from\nsomeone. And it also tells we always seek to be understood by someone.\nIt becomes a support of our hearts. In addition, the mathematician is a\nhomosexual. It describes the discriminations of sexuality. The\ndiscrimination is the truth, and so crucial. The Is movie tells us a\nlot of things.\n"},
{"review": "\nI'm a Benedict Cumberbatch fan, and after such positive reviews and\nnominations/awards for this movie, I was looking forward to it. But I\ncouldn't even get through the whole movie. I had to stop watching after\nthe scene in which they have just broken the code but let a convoy be\nattacked because they decide its too risky to warn anyone. That\ncertainly wasn't the first significant historical inaccuracy in the\nmovie, but I couldn't bear any more. You can read more about the\ninaccuracies in other IMDb reviews and by googling \"imitation game\ninaccuracies.\"<br><br>What a disservice this film does! The true story is a fantastic one.\nBut the vast majority of people will come away thinking that this\ndumbed-down version is fact. Uggh!\n"},
{"review": "\nWow. I don't even know what to say. I already watched this film a while\nago and thought it was really good, but now I watched it again and it\nreally is one of the best works I've ever seen. The film captures\nTuring's life in such an emotional, but still believable way. While\nwatching Turing and his co-workers/friends slowly breaking Enigma, we\nnot only get some flashbacks into Turing's childhood, but also see what\nhappens after the war. Turing was an absolute mastermind with an\namazing personality and an ending which he did not deserve. Two things\nI'd like to mention are the music which is incredibly emotional as well\nand the ending scene which told us about Turing's machine and suicide.\nAll in all, it's a breathtaking film that I'd definitely recommend to\neveryone.\n"},
{"review": "\nThe Imitation Game contained, not only an interesting and organized\nplot, based of real events, but was also blessed by the extraordinary\nperformance of Benedict Cumberbatch, who never seizes to surprise me.\nThe way he brightly plays his particular personality and intelligence,\nin order to solve the enigma, is absolutely stunning. It is definitely\nalso to praise the development the producers, and again Cumberbatch,\nput into the character of Alan Turing, what was indispensable, since he\nis an important historic figure, that brought a lot of innovation and\nprogress to mankind. To summarize, the Imitation Game is an amusing way\nto learn how our society evolved to where it is now, and to see the\nbrilliant \"Sherlock\" in action once again.\n"},
{"review": "\nan embroidery. more than a film. high attention to details. acting\nremembering a theater play. emotion in precise doses. and a drama who\nwas build level by level to be a story without sin. touching, sure. but\nin a strange, specific manner. interesting portrait. but far to be more\nthan cold and almost cryptic. a drama who could have status of parable\n- new skin, old recipes. the result - an embroidery. fascinating but\nwell known. a pledge. not real comfortable. a life who has to many\nmarks from a semi god's existence. a correct film. maybe, too correct.\nbecause the themes, the image of Turing, the acting of an actor to seem\nbe the perfect piece for the perfect clock are virtues but not at all.\n"},
{"review": "\nIn an age where my calculator has more processing power than the Apollo\nmission's computer system it becomes hard to imagine the origins of our\nmodern computer systems. This movie does a phenomenal job of showing\nthe intense thought and dedication that the Turing and his team go\nthrough as they try to break the Enigma Cipher. Since the movie is\nbased on a true story it is easier to relate to the characters stories\nand what they are going through emotionally during their struggle. The\nstory is very thought provoking because of how important computers are\nin our society, so thinking about the origin is wonderful. While\nwatching this movie just think about all of the inventions and concepts\nthat came out of this one concept, the modern computer, and the story\nbecomes even more amazing.Whether you are an expert coder that has\nstudied Turing and the Enigma machine or just like movies this is a\ngreat movie to watch.\n"},
{"review": "\nI really like films from this era, and this one is no exception. I also\nlike these troubled genius type movies. Turing's story is absolutely\nfascinating, and probably one of WW2's best kept secrets up until now.\nI really appreciate learning about something of such great historical\nrelevance. Benedict Cumberbatch is an excellent actor, and he did an\nimpeccable job in this film. I thought he was great in Star Trek 2, but\nin this film he played a totally different character, and he played it\nto perfection. Keira was also impressive, though this was hardly her\nbest work - how can she ever top her performance in Pride and\nPrejudice? However, she is still a joy to watch. Can a movie that just\nrelies on an awesome script and talented actors still be good without\nCGI and pyrotechnics? Absolutely! There wasn't a boring minute in this\nfilm. I don't know if The Imitation Game was the best film of 2014, but\nit was certainly among the best and is well worth seeing.\n"},
{"review": "\nIt can't be stated enough: Alan Turing was (is!) a hero, and the way UK\ntreated homosexuals back then was inhuman.<br><br>And now on to the film: This is an important story that deserves to be\ntold. The casting of Cumberbatch was perfect, as he manages to portray\nboth the genius with social difficulties and the emotional,\nmisunderstood outcast. The conflicting emotions in some of the scenes\nfeels genuine, and he especially nails some of the more challenging\nscenes near the end.<br><br>My problem with this film, however, is the (oscar winning) story. The\npeople above Turing in the chain of command, like the character played\nby Charles Dance, are so one dimensional and villain-like that they\ncompletely pull you out of the movie's realism. There are other moments\ntoo (they are running of time! the police are circling in on him!) that\nfeels exaggerated, due to this being a movie and all. And while I am\nnot saying that a movie ought to be 100% accurate, I wish that it would\ntry to be a bit more realistic.\n"}
]