[
{"review": "\nI was forced to watch this horror by people who should have known me\nbetter. (The only movie I really wanted to watch this week was a Polish\nfilm, Ida, which was playing nowhere).<br><br>Godalmighty, what a stinker this was. Character development? None.\nDialogue? Laughable. Plot? Who knows.<br><br>Against a ridiculous and badly done Washington process screen, I saw a\nton of cgi star trek crap, mostly consisting in four-frame quick-cut\nscenes of people (?} kicking each other to no effect, a hell of a lot\nof useless machine-gun fire to equal effect, and explosions filling the\nscreen followed by firy explosions filling self-same screen, giving way\nto yet more kicking and firy explosions.<br><br>It did occur to me that I was not the target audience for this total\ncrap, but then, as I have said, I was dragged to it.\n"},
{"review": "\nRobert Redford is willing to sacrifice hundreds of millions for the\nlives of billions, the 'good guys' are willing to kill hundreds to save\nthe lives of those hundreds of millions. Both are playing a numbers\ngame, the only difference is that Redford's is on a bigger scale and\nisn't hypocritical, he acknowledges the human cost, the 'good guys'\ntreat the hundreds of soldiers they kill (and the many civilian\ncasualties resulting from their lavish tactics) simply as necessary to\nget the job done. This is a fight of visionaries against hypocrites,\nand hypocrites win. An awful message, an awful movie. It also has the\nstandard 'just in the nick of time' tropes, ridiculous and impossible\nfight scenes, a frankly annoying score and the ever-loathable Samuel L\nJackson.\n"},
{"review": "\nNever have I watched a movie with so many clichéd lines, excessive use\nof firearms and complete lack of credible story line. Plot twists were\ntedious and lines were forced and overacted. I believe Marvel has taken\na turn for the worst. Why couldn't have been as well acted and written\nas the Avengers? Instead we are given a mockery of all superhero movies\nto date. We have been presented with unnecessary amounts of CGI and\nguns and killing. Superhero movies are supposed to present morals. How\ncan a superhero movie depict a couple of characters running around\nshooting at each other and killing massive amounts of people in the\nprocess. In my opinion just plain awful. I can't but I'd rather give it\na 0/10. (Only giving this review for the people with good taste in\nmovies and are not forced to watch it like I was)\n"},
{"review": "\nA fine mediocre movie. Not too good, not too bad. It is so overrated.\nBad action scenes with shaky cams and tons of cuts. The story is OK.\nThe villain is really good. Had charisma and charm throughout the\nmovie. The movie was boring throughout with some cool scenes in it. The\ncharacter development for Falcon is poor. He is not given any origin\nstory. No flashbacks yet he is the main sidekick of Captain America.\nThe ending was cheesy. You might not like it. The CGI in the movie was\nnoticeable and seemed fake. Fairly, this movie is one-time watch only.\nThis movie was maybe one of the finest Marvel movie but it is not the\nbest. This movie is overrated among fans.\n"},
{"review": "\nPersonally I was not impressed with this movie, certainly not as good\nas the first movie, but then squeals that are as good or better than\nthe original are rare. I found the storyline quite weak and the\ndialogue hard to hear over the too loud mood music, editors never seem\nto learn this fact. The SFX were OK but nothing breath-taking, and the\nacting was lack-lustre. In saying all this I enjoyed the movie and\nwould recommend it as a easy-to-watch piece of entertainment, with a\nbucket of popcorn a cup of coke/coffee and your Kindle to read to stop\nyou getting bored. Someone to wake you up for the exciting bits would\nalso be an advantage.\n"},
{"review": "\nThe dialogue is absolutely horrid, the acting uninspired and\nconsidering what they have to work with it's no wonder. The action\nscenes are made for 10 year old kids, it's embarrassing to watch.<br><br>There is absolutely zero tension, movies like this are supposed to have\nus on the edge of our seat. And on good old Cap himself, I just cringe\nhard, there is nothing captivating about him at all. Natasha's aura of\nfake is palpable. <br><br>I feel sorry for this generation and I pity those who watch this and\nthink it's a fantastic movie. I sawed my way through this while amazed\nthat yet another Marvel movie could be this bad.\n"},
{"review": "\n..But really, what did I expect. During some of the scenes I wanted to\nhave Nick Fury's eye-patch on...but on both eyes. I don't expect movie\nadaptations of comic books to be art house cinema. But, I wish the\ndirectors etc. of these movies would make up their mind and either: a.\nmake them serious (ie. watchmen, Christopher Nolan Batman etc). or b.\ncamp. It's hard to watch a movie that seems to be trying to take itself\nseriously. When the one liners and goofiness make you feel like Arnold\nSchwarzenegger was gonna come on screen and be all \"Allow me to break\nthe ice. My name is Freeze. Learn it well. For it's the chilling sound\nof your doom!!\".\n"},
{"review": "\nThis movie is bullshit full of crap. From the beginning it was quite\nobvious where this will all go but i said to myself maybe it isn't just\nanother Transformers or James Bond crap. But i was wrong really wrong,\nit is maybe even worse. Movie is full of stupid shitty wannabe jokes\nand retarded brainless unrealistic fights. If you dnt believe me on my\nwords you will see it for yourself. I cant believe that this movie is\nscored above 8, are we really that domed!? How peoples love this kind\nof dumb movies is beyond my imagination. I hope that directors of this\nmovie dnt ruin another movie. Never ever gonna watch Captain America\nagain, have given 1 more chance but not any more.\n"},
{"review": "\nCaptain America continues where it left off from the first movie and\nthe Avengers.<br><br>Chris Evans did a good Johnny Storm in Fantastic Four and does an even\nbetter as Steve Rogers.<br><br>The movie is fast paced with lots of action that keeps you glued to the\nscreen. New weaponry, spectacular fight scenes, introduction of new\ncharacters and possible love interest for Captain America.<br><br>Jackson, Evans and Johansson put in some good performances and the\nchemistry between characters new and old was good, very believable.<br><br>There is a strong emphasis on trust in relationship for all the\ncharacters and a sprinkle of political interference which was developed\nthroughout the movie.<br><br>The film has the customary spectacular ending which does not\ndisappoint. There are some flashback done very well. Good surprises,\ntwist and turns, which you probably wont have anticipated.<br><br>This film is a great addition to the Captain American franchise and is\nvastly superior to the Thor and Iron Man nonsense.<br><br>I cant wait for the next installment of Captain America\n"},
{"review": "\nFormulaic, boring. I wasn't compelled to care about the characters or\nthe story. Interesting moral dilemmas always ended in the clichéd\nsentimental choice. For example, the climax, Capt throwing away his\nshield and most probably his life for his \"friendship.\" I would expect\nCapt America to be intensely responsible for his life, for he has the\npotential to save millions or billions of people many times over. His\nchoice was illogical and irresponsible to the larger context of his\nlife and humanity. The way his character is morally structured, it\ndidn't make sense.<br><br>I'm always baffled by these superheroes/saviors/good guys who are\nchased around and have no problem causing mass destruction and loss of\nlife. Unless their mindset is to survive for the good of the many vs\nthe few, although that mindset doesn't see coherence through the movie.\nJust another stupid movie, in my opinion.\n"},
{"review": "\nWhat an awful movie, it was 2 hours of me, two friends and the\ndesperation of not being able to leave from the cinema early. As a\nperson who loves movies, I don't even know what I was thinking when I\ndecided to go watch a Marvel movie. <br><br>This movie just proves how Hollywood is nothing but cliché dialog and\nCGI for movies these days. <br><br>Captain America is a movie that had really nothing going for it. First,\nlet's start by it's horrible plot, which seemed artificially created\nand dumb. Second, even though this is a movie that is supposed to be\nabout heroism (hence the super hero!), it really had nothing heroic\nabout it other then a guy who's power was given by experiments an is\nnow able to fight bad guys. He has no heroic words to give (except for\nthat one line in the movie that was super dumb) and he showed nothing\nto strive for.\n"},
{"review": "\nI don't think anyone was expecting Captain America: The Winter Soldier\nto be just as bloody fantastic as It was. Honestly, from the beginning\nto the end It's thrilling, It's action packed, It works as something\nthat's more than a superhero movie and It's just fantastic. Not to\nmention is the cast joined by Robert Redford (no, seriously they\nmanaged to get Robert Redford) and the continuing evolution of\ncharacters of Captain America, Black Widow and Nick Fury whilst\nintroducing new characters like Falcon and of course the bad ass\nantagonist of the movie, The Winter Soldier. The action scenes like the\nbrawl in the elevator scene and the epic first confrontation between\nCaptain America and the soldier stand out above not just the MCU, but\nsuperhero movies altogether. And also to comment on, is the amazingly\ncomplex and intricately written plot of mystery, deceit and the past\ncatching up with people. Truly gripping, as pretty much everything in\nCaptain America: The Winter Soldier is.\n"},
{"review": "\nIn recent years it seemed to me all too often that action movies\ndirectors and script writers felt like they had to choose between\ncharacters development and a coherent plot, this one strike the balance\nas close to perfection as I've seen in a very long while. It does help\nthe actors (as I've said more than once - good actors can work wonders\nwhen they have properly written characters to work with), and even more\nimportant as far as I'm concerned, it helps in examining the moral core\nof the whole sci-fi comics concept. The inherent fascist undercurrents\nof the entire super hero idea. This concept has been dealt with by all\nthe real good comics adaptations, both on screen and on print.<br><br>Bottom line, it's a fun ride with added value to boot, if you like\nsci-fi comics adaptations, this one is a must see.\n"},
{"review": "\nI was not a great fan of Captain America before the first movie came\nout in 2011 with impressive sequence and strong story line. Not that I\nloved the first movie, I was waiting for this movie to be released and\njust watched and I loved it. Visual treat as well as story are well\nframed and flawless. The winter soldier is portrayed very nicely. A\nwhole lot of techs and thrills are filled from the beginning to the end\nof the movie. As a personal opinion, the black widow from Iron Man and\navengers looks better than in this one. The movie is filled with\nhumours which being an action movie, I had a lot of reasons to smile.\nAnyways, a must watch to all marvel lovers and DON'T MISS THE END.... u\nknow what mean :)\n"},
{"review": "\nOne of the most solid projects Marvel brought to the screen . Although\nAvengers was placed as one of the highest grossing films of its genre\nand the very Captain America : The First Avenger, as of the most\nanticipated , Captain America : The Winter Soldier , is a delight on\nscreen. From the start you can receive all the care of the production\nand excellent work in each of the departments in charge of this\nrelease. I could delve into details but I refer to say it is a very\ngood choice for a movie of this season. I can add that the references\nto the Marvel world parallel to this episode does not detract much less\naffected by the inclusion of chronological attachments in this second\npart of the \" Cap \" . At no time affected the time-line or the argument\nof this epic showdown . You can see Captain America kicking many\nenemies to a fault , it is something which we like to see and sure will\nnot disappoint. It gives me great pleasure to see the performance and\nevolution of Marvel projects in the house , and surely those who come\nwill not let us upset.\n"},
{"review": "\nIt's rare that we get a serious Marvel movie these days since the first\nIron Man but this was totally mind blowing. Captain America: The Winter\nSoldier too a risk and it worked. This was more of a thriller than just\nyour ordinary super hero movie. This is the Dark Knight of Marvel. The\nstory unfolded and a steady pace and for once no loop holes. Well\nwritten. This film dealt with real life government issues such as how\nfar should the government go to keep us safe. The fight choreography\nleaves Captain America: The First Avenger and Captain America in the\nAvengers by a gap. I have never seen so much character development in a\nMarvel movie as much as Captain America. In this movie we really get to\nsee Steve Rogers flesh out his abilities. I am usually against Marvel\nmovies so for me to incredible compliment this film is saying\nsomething. This is a must watch. Do watch it in cinemas. Truth is\nCaptain America: The Winter Soldier beats The Avengers, Thor: The Dark\nUnder World and Iron Man 3 by a gap.\n"},
{"review": "\nIn the comics, the superhero is a man or woman of mystery....the\ncostume, the mask, secret identity...not in this film! Hey, Cap jumps\naround with no mask, a pair of chinos and Harrington like\njacket.....the kind of clothes you would wear going shopping....but not\nwhilst fighting major baddies with Alice Cooper type hairdos and\n\"school's out\" attitude. Okay, Okay, i know the story gets updated,\nhey, i read Brubaker, but this film, in my opinion, like the last Iron\nMan film,is an example of Marvel's arrogance in thinking they can\napprove crap movies. Conclusion? Overlong and very boring....Robert\nRedford is like a \"cardboard gangster\", unconvincing. The \"diehard Cap\nfans\" may say this is great, but deep down,may think different.\nDisappointing\n"},
{"review": "\nThis was not dissimilar to watching an old Rambo/Schwarzenegger 'shoot\nem up' action flick where the body count soars as the story and\ndialogue plummets. Sure there's lots of CGI chaff to distract you from\nthe basic premise, which has been overused in better movies. It lacks\nthe wit and originality of Avengers and great series like Star Trek\nNext Gen and Firefly. The acting is dire and the plot so predictable I\nwalked out a good 45 mins before the end. Watch it and weep. I got the\nfeeling that this is the type of film which will appeal to hyperactive\n12 yr old boys who are into computer games and little else. When will\nHollywood realize that expensive FX driven, soul-less films are great\nbox office but little else.\n"},
{"review": "\nWow, this film absolutely blew me away. The plot is good and the action\nscenes are just breathtaking. It is basically 2 hours of non stop\naction. Fighting, flying, explosions, shooting, it has everything.<br><br>Chris Evans is just great as Captain America. The costumes look\nbrilliant every single fight scene had me on the edge of my seat.\nCaptain America pretty much destroys everyone who stands in his path.\nScarlett Johansson as Black Widow is absolutely incredible as well, she\nneeds her own movie! <br><br>I can't recommend this highly enough. I think even those who are not\nfans of this genre may like it purely for the action. I'm a huge fan of\nMarvel movies and this is definitely one of the best ones.<br><br>Without giving too much away, just go and watch it and be prepared to\nbe blown away. Literally.<br><br>9.5/10\n"},
{"review": "\nI went into this film with a lot of expectations and I must say they\nwere surpassed.Once again Marvel gives us another entertaining film\nleading up to Avengers Age of Ultron.The action in this film was\nexciting,fun and very intense.It was light hearted in tone which helped\nthe film a lot.It had a lot of subtle moments that i did not\nexpect.Chris Evans continues to own this role and really does a great\njob.I loved Scarlett Johansson as Black Widow:She's sexy,tough and a\nreally exciting presence on screen.The winter soldier himself is very\nhardcore and If you see the film you will know what i mean.Veteran\nactors like Samuel L Jackson and Robert Redford do a great job in the\nfilm to their credit.If you go see it keep 2 things in mind:Go with an\nopen mind and stay after the end credits.Trust me its worth it.A very\nsolid sequel and to me It gave me more thrills than Man of Steel and\nThe Dark knight sequels.Yes that's saying a lot but that's just my\nopinion.\n"},
{"review": "\nThis movie was an excellent addition to the Marvel: Phase 2 collection.\nEffects were incredible, character development was great. We really get\nto see more of Cap and Widow's personalities that we didn't get to see\nin Avengers. <br><br>I love, love, love, that we get to see some of our Marvel Heroines\nstepping up and kicking some ass. In this film we definitely get to see\nsome of Natasha Romanoff and Maria Hill's skill in taking out the bad\nguys. <br><br>I was on the edge of my seat the entire time, this film had me\nlaughing, crying, and gasping out loud. Chris Evans gave a brilliant\nperformance as Cap but the real stand out star was Sebastian Stan, he\nbrought the Winter Soldier straight to life, like he jumped right out\nof the comics. It was a great surprise to see how much work Stan put\ninto his portrayal of Bucky and it definitely showed on screen.\n"},
{"review": "\nThis review is purposefully vague to avoid spoiling any major details,\nand that is going to be extremely difficult mainly because almost\neverything that happens in this film is plot important. So, let's just\ngo with the barebones.<br><br>The performances given by Chris Evans, Scarlett Johansson, and\nespecially Samuel L. Jackson are damn near perfect.<br><br>What else is damn near perfect is the way the film is structured. This\nis not a superhero movie. It is a SPY THRILLER with superheroes in it.\nYes you read right. This is a conspiracy flick, and directors Anthony\nRusso and Joe Russo do not let the big name superheroes get in the way\nof the plot. The script is fantastic and... well... I actually can't\nfind anything wrong with this movie.<br><br>This has become one of my favorite marvel films. and it holds the\npotential to be yours too. I implore you to see this movie.\n"},
{"review": "\nWhoa, this movie is undoubtedly spectacular! A must watch for all\nMarvel fans! Anthony and Joe Russo have done a really decent job in\nmaking this movie. The apparently considered good guys in the beginning\nof this movie eventually turned out to be the bad guys! Well at least I\ndidn't have to hate them, for they were like the bad good guys! Also,\nthis movie reminds us of many incidents that occurred in Captain\nAmerica: The First Avenger, the first movie headlining Captain America.\nSo this way, we get back on track and don't literally associate this\nmovie with The Avengers, expect maybe when it comes to Project Insight.\nWell, as of my opinion, both The Avengers and Captain America; The\nWinter Soldier are equally awesome! This movie was perhaps the best\nthing that ever happened after The Avengers. The ending was sensational\nand logical! The whole cast was entertaining. Plus, the theme song\nliterally rocks to the core! Moreover, the action was unquestionably\none of a kind! Even if you don't like the story, there's a hell of a\nlot more to enjoy!\n"},
{"review": "\nThis movie has got everything. Unlike other marvel movies this seems to\nbe different. Contain everything- action, thriller, suspense. Worth\nwatching. Why does Indians not make movie like this. They should learn\nfrom this that how stupid they are. The whole logic was awesome. It has\nthrived me from inside. I am going to watch it once more as the movie\nwas dubbed in Hindi which has irritated me. The Hollywood should not\nrelease such movies in India in Hindi dubbed as it loses all the\ncharms. My rating to this one is 10. I am now desperate to watch\nspider-man. Please marvel make sure to rock me again. I am going to\nwatch this movie again.\n"},
{"review": "\nThe best film of marvel till date nod doubt about that .the action\nsequences are the top notch of our generation. the suspense and thrill\nis way beyond comprehension .Chris Evans is hardcore as Steve Rogers\n.Bucky delivers a powerful match for captain.Samuel L.Jackson shows his\ntrue capability and awesomeness .maria hill is welcomed. Anthony Mackie\nis excellent as falcon and as a sidekick.The Russo's are the exact\ndirector to continue the franchise no doubt about it.MARVEL rules till\nthe end.Chris Evans has made it clear that he is non replaceable as\ncaptain America .i wish to see falcon in the future movies .Natasha is\nalso good .fury needs to step out more in the light rather than in\nshadows.\n"},
{"review": "\nThis movie was absolutely great in my opinion; it might even be my\nfavourite Marvel movie at this moment. <br><br>The beginning already sets a bit of a mood for this movie. We see Steve\nRogers, aka Captain America, and he is starting to get used to this\nworld, the 21st century. He is a charming and a bit quirky guy.\nEspecially the relationship between him and Natasha Romanoff, aka the\nBlack Widow, is absolutely amazing! She is a strong female character\nand that is so great to see in a superhero movie. <br><br>The movie soon turns into a conspiracy spy movie esque setting, we see\nold characters returning. Basically: S**t just goes down. <br><br>At some point there was a bit too much action in my opinion. Not\noverwhelmingly much so as it distracts you, but still, a teensy bit too\nmuch. The soundtrack is great though, the characters are amazing; it is\njust a pleasure to watch it. <br><br>No spoilers here, so just go and watch it.\n"},
{"review": "\nThere aren't many films where I think I may actually walk out but after\nthe 20 minutes but I seriously thought about it. It did get a bit\nbetter thereafter though. Character development was poor. Did I care\nmuch for the characters...a little. A bit of effort is expended in\ntrying to inject some emotion but mostly it falls very flat.<br><br>I saw this film in 3D. Why did I pay a premium for this ? In some of\nthe hand to hand fight sequences you can barely see what's happening.\nThe effect being akin to watching clothes going rounds and round in a\nwashing machine. 3D technology appears to be very lacking for fast\nclose action fighting sequences.<br><br>The story is weak with action/explosions being the main selling point\nof this movie.<br><br>If you go with very low expectations you may come away feeling it was\nan OK movie. Unfortunately for me I will lament those 2 hours of wasted\ntime.\n"},
{"review": "\nOverall: A pretty good movie; way better than 'Catpain America: The\nFirst Avenger'. In the top half of Marvel movies; definitely recommend.<br><br>Good: The acting is great from all characters and the effects are great\nwith a series of explosions that would make Michael Bay proud. The\ncinematography is great and the score is awesome. All the characters\nare well done, well developed and well introduced. The story and themes\nexplored are actually pretty cool with some interesting villains to\nguide it along. The Doomsday Weapon is actually cool and is NOT just a\nbeam in the sky.<br><br>Bad: There are numerous plot inconsistencies and abnormalities which\ncan be annoying if you pay attention.<br><br>Best Part: The Nick Fury car chase which introduces 'The Winter\nSoldier'<br><br>MVP: Samuel Jackson as Nick Fury<br><br>8/10\n"},
{"review": "\nthis second movie in the Captain America franchise was much better than\nthe First Avenger,at least in my opinion.i thought it had more energy\nand better action.i also thought the uniform was much better,and I\nliked the villain more.once again the acting is good.Sam Jackson\nreturns as Nick Fury.Scarlett Johansson is back as Natasha\nRomanoff/Black Widow, and Anthony Mackie is good as Sam Wilson/Falcon.i\nalso really liked Cobie Smulders(the TV series How I Met Your\nMother,and Avengers) as agent Maria Hill.overall,this was just a better\nfilm.but again this is just my opinion.for me,Captain America: The\nWinter Soldier is an 8/10.\n"},
{"review": "\n\"Winter Soldier\" is a step up from \"The First Avenger,\" as this movie\nis more gripping with its political thriller theme and the suspense and\naction-oriented elements. The evil Hydra organization from the first\nCaptain America movie takes on a more sinister role as they infiltrate\nCaptain America (Chris Evans) and Black Widow's (Scarlett Johansson)\nS.H.I.E.L.D. department to launch a powerful weapon against humanity.<br><br>There are plenty of unpredictable moments, from character trust issues\nto espionage elements, that make this film full of surprises and a good\ndose of comic relief where appropriate - not forced comedy or overdone\nstuff like the Thor movies.<br><br>Solid acting and a to-the-point plot, this is a great superhero film,\noverall, and one of the best from Marvel.<br><br>Grade A\n"},
{"review": "\nI was disappointed by the first Captain America film, so I was pleased\nthat I found myself liking 'The Winter Soldier'.<br><br>Director Fury has a prominent role - he is hounded out of his position\nand almost killed. So Captain America finds himself in a position where\nhe doesn't know who to trust. That said, he seems to trust Black Widow,\nwho he quickly teams up with and who also features heavily in this\nmovie.<br><br>And that's just the start of it. Together, Captain America and Black\nWidow uncover a truly sinister secret at the heart of the organisation\nthey work for.<br><br>It's all delivered with perfectly good fight scenes and character\ninteraction throughout. The sinister plot is unravelled at a steady\npace, meaning it's easy to stay interested right up to the climax.<br><br>My major criticism is that I don't find the characters all that\nengaging. Captain America is a boringly clean-cut hero, and the bad\nguys didn't seem very memorable.\n"},
{"review": "\nAs a fan of superhero movies and the first captain America movie (\nwhich some people like and others hate) I had my doubts going into this\nmovie but boy was i surprised, the action scenes in this movie were\nwell choreographed, the story was as compelling as it could get and the\nplot twist at the end is one to look out for. Captain America winter\nsoldier shows how captain America adjusts to modern life and while he\nbegins to build trust with men of today, he gets very betrayed before\nmeeting up with something from the past which he thought was gone. As\nthis film comes from people who directed only comedy before it is a\nvery big shock that one of the best comic book movies comes from them.\nBravo is all i can say!!!!!\n"},
{"review": "\nCaptain America: The Winter Soldier is a well-done film, I just don't\nget any personal investment out of it. Everything is well-done from the\naction sequences to the story but nothing holds me tight and truly\ngrips me for me to enjoy like a lot of other people do. I definitely\nthought the action was really good and there were some genuinely\ninteresting sequences but the film feels sort of...light. It's not like\nI can't appreciate the films efforts and there succession into crafting\ngenuinely entertaining sequences, I just don't find it very enthralling\nand I don't think it deserves to be hailed as a masterful political\nthriller.\n"},
{"review": "\nIt should be time to change more thoroughly the plots and the\ndevelopment of this kind of superhero movies like, also, those of\nsecret agents. You see one and it's as if you've seen them all.<br><br>In this case, however, the pleasant note is that the ideas around the\nspecial effects (computer graphics) are very pleasant and there are\nvery nice action and fight scenes to watch.<br><br>For the rest, the film, like all those of superheroes of the last years\nis extremely predictable and obvious as is as the script. A good film\nfor a young audience mainly, fun but, nothing really new under the sun\nfor technically savvy viewers.<br><br>8/10 because yes, it is obvious but, undoubtedly entertains and well\ndone.\n"},
{"review": "\nAbsolutely better than the first, and I am incredibly impressed. I\nreally loved the interaction between Captain America and the Winter\nSoldier and seeing a few other heroes come along for the ride was a\ngreat experience. Plus seeing that Bucky Barnes was in fact the Winter\nSoldier was a fun nod to the comics that I was really happy to see, and\nthen there was the huge surprise involving Hydra, which blew me away.\nThe fact that S.H.E.I.L.D. was infiltrated was awesome to see. Along\nwith this darker toned movie, the characters where really well done and\ndeveloped, the plot was incredible, and it was amazing to watch the\nHelicarrier fall. There was also the fun addition of the Falcon who\nhappened to be a very good well thought out character who I am happy to\nsee is sticking around for future movies. I give this a 10 out of 10\nfor a spectacular performance. \"Even when I had nothing, I had Bucky.\"\n\u0096Steve Rodgers\n"},
{"review": "\nI read comic books years ago but not for a long time. I have watched\nmany of the Marvel films already released but don't have that\nfoundation that the fan-boys have. My mistake was not realizing there\nwas a previous movie when I went to this one. So it took a little\ninformation from my twenty something son to get me up to speed. I'm\nsure most of you reading this know the Captain America mythos. This is\na high speed, action every minute, mind bending experience. The\nindividual characters are interesting and complex. I still need to\nwatch the first movie to actually figure out the whole \"Shield\" and\n\"Hydra\" thing and how it works and what Captain America has done.\nHowever, when you have your characters being pursued by the most\nformidable of villains, it isn't necessary to have an encyclopedic\nknowledge of all this stuff. For an old fogie, I thoroughly enjoyed\nthis film and look forward to going back and watching the first one\n"},
{"review": "\nThose DC fans are always around to mess up the marvel movie scores! I\nmean, come on! This movie deserves a score around 9. Awesome plot,\ngreat acting, cool cast, awesome fighting scenes and stealth mode\naction, awesome car chase scenes, tons of fighting scenes and a pinch\nof humor-- A perfect marvel movie recipe. What more do you want DC\nfans!!!!!??!!?!! Yeah the only thing that was missing was Hawkeye...I\nwouldn't say that the movie really felt incomplete without him but, If\nHawkeye were the movie would have deserved a 10. By the way, the movie\nis any day better than the first one. It is the best marvel movie for\nme though......\n"},
{"review": "\nThis Captain America was really good and actually had me kind of\nsurprised. This movie had just the right amount of action, character\ndevelopment and an intense shock fused with a little bit of personal\nfeelings getting involved. When this movie showed Captain America\ngaining advice from some old lady and turns out that was the love of\nhis life that shocked me and even feel bad for the lady losing her love\nbut realizing that he was still alive and young. What made the movie\neven more awesome is when he made a new friend and turns out that was\nFalcon in the making. What really was a huge surprising moment was when\nwe found out that the Winter Soldier was actually Captain America's\nchildhood best friend and when they were going through their final\nfight against each other, Captain America gave The Winter Soldier a\nquote from their childhood which made the Soldier come to his senses\nand they crashed together and the Winter Soldier even saved Captain\nAmerica's life which was a beautiful thing, showing the power of true\nfriends is stronger than any indoctrination.\n"},
{"review": "\nCaptain America The Winter Soldier is definitely an improvement to\nCaptain America The First Avenger. It had more action, a little bit of\ncomedy and some lovable characters. The first time I saw this movie I\nwas like \"So awesome!\" I mean it's one of the best Marvel movies I've\nseen. <br><br>It also had a better and more interesting story. It made me get hyped\nfor its next movie Captain America Civil War. I hope they can make the\nnext movie awesome too. <br><br>In conclusion, Captain America The Winter Soldier was such an awesome\nfilm. Marvel has a bright future of making more awesome movies like\nthis one.\n"},
{"review": "\nI wasn't a fan of Captain America: The First Avenger I rated it a 5 as\nto me it was just an average popcorn movie, nothing stood out about it\nbut there was nothing terribly wrong with it either. It just felt like\na prelude to Avengers and not a fully fledged film in itself.<br><br>Thankfully though this sequel feels like a proper Captain America film.\nI liked the story of the winter soldier, there was some great action\nsequences and I liked Nick Cage and Black Widow getting more screen\ntime.<br><br>This is how the first film should of been. It was enjoyable and one the\nbetter MCU films up there with the first Iron Man and Avengers (not\nseen Guardians yet). If like me you found the first Captain America\nlacklustre don't let it put you off watching this one. 7/10\n"},
{"review": "\nSteve Rogers (Chris Evans) is still trying adjust to the modern world.\nHe befriends fellow soldier Sam Wilson (Anthony Mackie) who later\nbecomes Falcon. He goes on a mission to rescue hostages but Black Widow\n(Scarlett Johansson) is more interested in securing intel. He is angry\nat Nick Fury (Samuel L. Jackson) who is building an armada called\nProject Insight. Fury uncovers some secrets and is targeted by the\nmysterious Winter Soldier. He warns Captain America before being\nkilled. Then Captain America is attacked by SHIELD after being\nquestioned by Secretary Alexander Pierce (Robert Redford). Black Widow\nhelps him investigate.<br><br>This is a good movie whether it's a Marvel movie or a comic book movie.\nIt's got some political espionage thrills. It takes the Marvel universe\ninto darker territories. It advances the plot to an interesting place.\nThe characters get room to move and grow. The action is great and\ndoesn't overwhelm. It's more human-sized. It's a smart action thriller.\n"},
{"review": "\nI have to say that I was pleasantly surprised by this. The jingoism of\nthe first film was gone, replaced with a rather interesting discussion\non the moral compromises we are often urged to accept for the sake of\npeace. Action-fans are provided with the requisite explosions and\nshoot-outs, too, of course. Borrowing as much from political thrillers\nas blockbusters raises the quality of the piece. It's very 'talky' by\naction movie standards, but nicely balances that action with\ncharacterisation (in that Chris Evans HAS one, this time, and Me\nJohansson is more than just kick-ass eye-candy), and hints at a rather\ndarker Avengers flick to come. <br><br>And we had Batroc ze Leaper. A fan-boy 'Yea!' to that!\n"},
{"review": "\nMy expectations was not huge for this second part of Captain America,\nbut I was fascinated. The story was great and the film was made\nperfectly. I am a fan of MARVELS and watched all films that are\nreleased. In my opinion the best films that have been made in the\nseries of Marvel come first: \"Captain America: The Winter Soldier\",\nfollowed by \"The Avengers\" and \"Iron Man 3\". Now I'm looking forward to\ncome \"The Avengers 2\" and of course next year \"Captain America: Civil\nVar\". I believe that certainly both films will be a great spectacle and\nstrongly recommend to anyone who has not seen the films of Marvel to do\nthis. You will not regret!!!\n"},
{"review": "\nIt was the trailer. The trailer pulled me into seeing this movie. I am\na huge Marvel fan, and this movie was just fantastic. Blown away. The\nfirst Captain America film, is a bit of a blur, it has been a while\nsince I watched the movie, but I knew what was going on. There is\nhumour, and a lot of action. And secrets being revealed. The best\nsecret dropper in all Marvel history. James Buchanan Barnes, aka Bucky\naka Steve's dead best friend, is actually the Winter Soldier. The words\n\"Bucky? Who the hell is Bucky?\" made my heart stop. That one line was\njust wow. The fact that Sebastian Stan, the actor who plays Bucky,\ndidn't have a lot to say, he said it through emotions. Sadness,\nconfusion, anger. He played Bucky perfectly. This was the best Marvel\nmovie of all times at the moment. I am a huge Winter Soldier fan now,\nand I can't wait for what the future holds for Bucky...\n"},
{"review": "\nCaptain America The Winter Soldier seamlessly utilizes umber of\ninnovative techniques to create a film that seems to seamlessly merge\nthe real world with the fictitious Marvel Cinematic Universe. Using the\n\"political thriller\" genre for the basis of this movie proved to be\nvery successful as it help give the story that relatable, realistic\nfactor that the first movie lacked. The different approach that the\ndirector's took with Captain America also helped elevate not only the\nmovie, but also the status of the Super Soldier himself. The deciding\nfactor that puts this movie above other typical superhero movies is its\nvillain. The Winter Soldier was a perfect choice for the villain, an\nhelped introduce the more darker tone that most Marvel movies lack.\nHowever, Captain America The Winter Soldier does have its fair share of\ncons, with the movie at times being a little to cliché, but overall, it\nstill manages to prevail as one of the best action movies of all time.\n"},
{"review": "\nI actually liked this movie, which was surprising because I thought the\nfirst Captain America film was boring and not entertaining. But this\nwas the exact opposite. It had an entertaining plot and you could\nfollow it. The winter soldier was good too with his metal arm. Even the\nguy flying(Falcon) had good special effects. And I liked how the plot\nbasically let you know from the start that Robert Redford's character\nwas not all he seemed to be.<br><br>BTW: Did anyone really believe Fury kicked the bucket? I mean what\nabout the other avenger movies.<br><br>FINAL VERDICT: An action movie worth checking out.\n"},
{"review": "\nMuch better than I expected, especially after the first one.<br><br>The first Captain America was fine, though not fantastic, and then got\nruined right at the end. Given that, and having seen most of the recent\nsuperhero / comic-book movies I wasn't expecting much from this. That\nis was expecting all style, no substance, token plot, wooden\nperformances, lives and dies by action scenes and special effects.<br><br>Captain America: The Winter Soldier has the action scenes and special\neffects, but it has much more than that. Plot is fairly good. Not\nwatertight, but moves along well, mostly makes sense, and has some\ncharacter development.<br><br>Performances are good. The interplay between Chris Evans and Scarlett\nJohansson works and the supporting cast give solid performances.<br><br>Overall, an entertaining movie and the best of the Marvel movies.\n"},
{"review": "\nWith Captain America \u0096 The Winter Solder, Marvel steps away from its\nmega-moneymaking formula of witty dialog and action, action, and more\naction and moves into a darker direction based on suspense and\npolitical intrigue. Surprise, the movie still is a mega-moneymaker.\nThat is mostly because Marvel retained an engaging cast (Chris Evans\nand Scarlett Johansson), top- notch action sequences, and brought\nCaptain America into today's world where moral ambiguities predominate\nthe absolutist approach to good vs. evil.<br><br>This film will be enjoyed by anyone who has enjoyed prior Marvel\nofferings but should probably only be seen if you are familiar with\nCaptain America's back-story through the comics or the first movie,\nCaptain America: The First Avenger (2011).\n"},
{"review": "\nAs Steve Rogers (Chris Evans) struggles to embrace his role in the\nmodern world, he teams up with another super soldier, the Black Widow,\nto battle a new threat from old history: an assassin known as the\nWinter Soldier.<br><br>This was a very clever plot idea. Rather than the super villains of\nother heroes, have Captain America take on his own spy agency. This is\nthe sort of thing one might expect in the Nick Fury comics, but Cap\nfills the role in nicely here. (Apparently Cap is replacing Fury, as\nnow we see that he had the \"Howling Commandos\" in World War II, a group\nformerly lead by Fury in the traditional continuity).<br><br>Apparently the Russo Brothers wanted to keep visual effects to a\nminimum, and this was a wise choice. Unfortunately, the effects kept in\nlook really bad. How this got an Oscar nomination is unclear, because\nthe scenes are just so animated-looking. Cap on the plane, attacking it\nwith a shield? Could probably have been done without effects, and now\nlooks silly.<br><br>At least we finally got to see Samuel L. Jackson in an impressive car\nchase.\n"},
{"review": "\nAgain a movie where i was kind of \"dragged\" into by my friend. I was\nexpecting to be not only bored but actually annoyed by it - mainly\nbecause off of all the A-list heroes, captain America is probably my\nleast favorite...or has been.<br><br>What can i say - i was not bored - and actually liked the character\nshortly into the movie. Captain America and Widow have a pretty good\nchemistry and work well on screen. <br><br>A fair warning though to people like me - who have no or very little\nbackground knowledge about all the Marvel heroes.. There is not much\nexplanation given. When i was in the theater - everyone seemed to know\nwho hydra was or why they tried to infiltrate the secret service of\nAmerica. It seemed like a big deal that was never explained.<br><br>The only criticism i have is <br><br>Wasn't that an avengers movie? They could have called more of them in.\nIronman, Halk or the Arrowguy. Instead they had this man with the wings\nthat did not feel like a real hero.<br><br>Anyway - it was fun to watch - and i wouldn't mind watching it again on\na video night.\n"},
{"review": "\nI could care less about Captain America, but given the positive reviews\nfrom my friends, and IMDb, I decided to give it a try. In fact, it has\na good story, and great action. It seems that Hollywood is learning how\nto make good fight choreography nowadays. Of course the movie's main\nstrength is in the action and spectacle. However, the conspiracy part\nis well played. It provides tension, and some room for guessing.\nHowever, Robert Redford seemed suspicious too early in the movie, and\nSamuel L. Jackson's character was underplayed. It also helps that there\nis a great villain: the Winter Soldier, who always seems to have a\nslight advantage over Captain America. Despite my good opinion on this\nmovie, I am not sure I want to see Captain America 3. For that, I am\ncounting on Marvel to surprise me again.\n"},
{"review": "\nWhere do I start the fill was amazing the action sequences where spot\non, great directing from Anthony Russo and Joe Russo also wonderful\nacting from Chris evens and Anthony Mackie who play falcon, he has\nquickly made that role his own. The action sequences between Captain\nAmerica and the Winter Solider where just great to watch. There are\nalso two great end credit scenes which greats you ready and excited for\nfurther films. I would highly recommended watching this film even if\nyou don't like or enjoy superhero films because this film is just has\nsome great action scenes which everyone will enjoy. However if you are\na Captain America fan you might notice a few changes from the original\nstory however don't worry because it is not distracting, so its a great\nmove for every one.\n"},
{"review": "\nAfter watching Captain America: The First Avenger, I had high\nexpectations for this film and wanted to see Captain American in more\naction to reach his full potential as a superhero. And guess what? We\ndo get to see that in this film!<br><br>The Winter Soldier is by far one of the best Marvel films to date as it\nmixes hardcore action with an intricately woven conspiracy story that\nkeeps the audience at the edge of their seats for the entire movie. You\nnever know what's going to happen, and the layered story builds up to\nsome epic moments of fighting and revelations. <br><br>There are plenty of action scenes along with some comedic moments that\nfit in perfectly with the soul of the film, and it is entertainment at\nits best. <br><br>I give it a 10/10 because it was well worth the money to go see this\nmovie and I'm happy with the way Marvel is investing in the quality of\nmovies being put out so far.\n"},
{"review": "\nThey should concentrate on Iron Man or the Avengers. Special effects\nare OK. There is action, whereas one would have thought that the one\ntop Hydra soldier (Brock Rumlow) would find his end by the hands of the\nFalcon aka Sam Wilson but no, he just disappears in the falling\nbuilding when one of the Heli-carriers crashes into it. Shame. But\nthere was some glimmer of hope although a very short one when Stan Lee\nentered the stage and realized that 'Captain Americas' uniform was gone\n(museum exhibit). For me the best scene in the movie. So have a look at\n1:33:51 in the movie. At least this time he had a short but popper\nscene. Otherwise everything was done very well but that money could\nhave easily been spread between the other bigger parts of the\nfranchise.\n"},
{"review": "\nAfter the cataclysmic events in New York with The Avengers, Steve\nRogers, aka Captain America, living quietly in Washington, D.C. and\ntrying to adjust to the modern world. But when a S.H.I.E.L.D. colleague\ncomes under attack, Steve becomes embroiled in a web of intrigue that\nthreatens to put the world at risk. Joining forces with the Black\nWidow, Captain America struggles to expose the ever-widening conspiracy\nwhile fighting off professional assassins sent to silence him at every\nturn. When the full scope of the villainous plot is revealed, Captain\nAmerica and the Black Widow enlist the help of a new ally, the Falcon.\nHowever, they soon find themselves up against an unexpected and\nformidable enemy-the Winter Soldier.\n"},
{"review": "\nIf someone thought that Captain America is the most vulnerable\nsuperhero then see this movie. It is bound to change your perception.\nThis has to be one of the best marvel movie ever made. The\nconspiracy,the revelations, the action, the light moments, are all\nworth watching.There's everything in this movie and anyone watching it\nis sure to love it. Especially, the fight between the captain and the\nwinter soldier is the highlight of the movie. This movie also gives an\ninsight on the black widow. The reason becomes apparent that the\nassassin girl deserves a movie of her own. Overall, its a must watch\nmovie for everyone. My Rating : 8/10. Must watch. Don't miss this one.\n"},
{"review": "\nI was slightly sceptical about this movie as the first Captain America\nwasn't too great but i was soon put in my place after seeing this. It\nwas incredible by far the best second entry to marvel films, it blows\nThor 2 away as well as the new Spiderman! Steve really proves himself\nin this movie through taking on countless hostiles as well as The\nWinter Soldier who proves to be quite the formidable villain. Black\nWidow as well as Falcon also plays their parts in this movie pretty\nwell by backing up Steve against SHIELD, which has been taken over by\nits enemies, who end up betraying them as well as Nick Fury. This movie\ncontains an insane amount of Action, a strong script and the visuals\nare astounding. This movie will blow you away, I thoroughly recommend\nevery Marvel fan to watch this movie and remember to stay after the\ncredits ;)\n"},
{"review": "\nBetter than the first Captain America, The Winter Soldier is also as\ngood as the Avengers. It has action at every second and some humor. The\nbest thing about this movie is the cast. Chris Evans, Scarlett\nJohansson, Samuel L. Jackson, Robert Redford, Cobie Smulders, and\nAnthony Mackie. The plot was good, although it did have its weak\npoints. Captain America himself was as awesome as ever. . I'd give this\nmovie an A- . <br><br>Really is a must see of 2014 . <br><br>C a p t a I n<br><br>A M e r I c a\n"},
{"review": "\nEmily VanCamp and Chris Evans flirted modestly through an attack on\nsubversion of the world's super powers. An intimate mind game between\nloyalty and power forced Captain America, Chris Evans, into alliances\nwith a new hero, Birdman. The super-duo, the rising heroine, Emily\nVanCamp, and their cast of protagonists won with surprisingly little\nfire power. Ninja like moves from these Avengers adequately compensated\nfor the arsenal of the heavily armed corruption infecting SHIELD. This\nworld's most powerful defense faced falling to the irony of betrayal\nand the genocide of millions. Innocent people put their trust in an\nexuberant team of headstrong superpatriots though the cost would be a\nquarrelsome Civil War!\n"},
{"review": "\nI'll keep this simple. If you don't like Marvel movies, watch this\nfilm. If you do like Marvel movies, still watch this film. This is the\nonly marvel film to date that actually has a strong story and is well\nexecuted.It does lose its way near the end and becomes a very generic\nmarvel action film ( Save the world etc) but everything up until that\npoint is great and truly interesting to the viewer. I was still not\nquite sold on Chris Evans as Cap but the Winter Soldier has really\nshown how perfect he is for the role. <br><br>I hope Marvel continues down this direction in the future and that they\nsit down and think out some exceptional stories for Thor Ragnarok and\nCivil War.\n"},
{"review": "\nThis is on my top 5 MCU films at the time when this review has been\nwritten. That flick had it all and then some ,action, good drama, an\nmind blowing story and its outcome has opened this Francaise, which is\nnow composed of movies and TV series, to a brave new world. The effects\nof the Winter Soldier, seen them in following movies and in Marvel's\nAgent of Shield the past two years made me convinced that after the\nAvengers, Marvel isn't done get and the fact that at 2014 Guardians of\nthe Galaxy also came out, wow, you bet that the following years this\ncinematic universe won't die any time soon. To summaries this film made\nCaptain America awesome and show us that he isn't a good kid because\nhe's an American ,but because this is his nature as a person not only a\nSoldier as everyone were thinking.\n"},
{"review": "\nI absolutely LOVED this movie!! Ten isn't enough to even say how much I\nloved it! The action scenes in it was so long and amazing, the acting\nwas 100 % good. Chris Evans did an amazing job at portraying Captain\nAmerica, so did the others. The actors did a 100 % good job!! It was\ngood from start to finish, I absolutely adore this movie and I will\ndefinitely watch it again and again. I've recommended it to my friends,\nbut some of them have already watched it, so we discuss it. I'm\nshipping Stucky so much! I like Chris and Sebastian's chemistry, even\nthough I know they are just bro pals. Scarlett is also in it so it\ndefinitely is an amazing movie, also the other characters are A++.\nCaptain America and Black Widow - someone I would happily let protect\nme from danger. They are awesome. 10/10 because of the good acting, the\nvery good action scenes/fighting scenes and a movie I'll never get\ntired of watching.\n"},
{"review": "\nIn 2008, director Christopher Nolan did his part to change the world of\ncomic book movies. Rather than use the source material to create\nanother action blockbuster with a recognizable superhero lead, the\nfilmmaker instead made The Dark Knight as a dark crime thriller that\nhappened to feature Batman as the lead detective. To say it\n\"legitimized\" the genre is reductive to some of the fantastic movies\nthat were released before it, but its unique approach garnered deserved\nattention from those who might not otherwise be interested in\ncape-and-cowl wearing vigilantes. Of course, in that same time span,\nMarvel Studios has left an equally impactful mark. Not only have they\ndelivered differently toned superhero stories \u0096 favoring the bright and\nfun over the dark and dramatic \u0096 but they've also developed the\ninnovative and risky Marvel Cinematic Universe that webs together all\nof the studio's characters into one shared world.\n"},
{"review": "\nWell, I enjoyed first Captain America movie, but that was kinda boring,\nbecause of Nazi stuff and WW2. The stuff we already had known and fed\nup with. On the other had, Captain America 2 is all about future! In\nthe movie, The SHIELD and Agent Natasha is also added. There is some\ninformation and characters from first Captain America, that makes\nmovies more enjoyable to watch. Before you watch this movie, I suggest\nyou to watch Captain America 1, for obvious reasons, and Also to watch\nAvengers 1 to learn a little about Natasha and SHIELD. It was amazing\nto watch. And if you enjoy superhero movies you will love this. To be\nhonest, I found it better than few other marvel movies. There was\nhandful number of surprises and some great action. Captain Rogers\nfights much better in this movie. If you remember in first movie there\nwas more gun stuff and less fist fight. However here we got both of\nthem in brilliant ratio. I gave it 8/10, because it is hard to impress\nme sometimes and I saw better movies like BATMAN TRILOGY. But all in\nall it was BRILLIANT movie.\n"},
{"review": "\nI think we have finally found the balance with seriousness and comic\nbook style in this film. To compare it to Batman, I would call it a\ncross between Tim Burton and Christopher Nolan. I never really\nsupported Nolan's films but fans always said his were better because\nthey were more serious. I always argued that they didn't have the style\nand aesthetics of a comic book film. I was not sure it was possible to\nappease both sides. Winter Soldier did that.<br><br>All of the actors do a fantastic job. Robert Redford is a surprisingly\nevil **** and Anthony Mackie does a great job as the Falcon. Samuel L\nJackson turns on boss mode. Sebastian Stan is the terminator. Chris\nEvans and Scarlett Johansen whoop ass all day long. And we have at\nleast three more (geez, that's 8) to mention--Frank Grillo, Emily Van\nCamp, and Georges St. Pierre. Heck, even the Russos themselves are in\nthe film and do OK with their roles! Great film. No question. 10/10!\n"},
{"review": "\nIt's almost midnight, in fact it's only a few minutes away and whilst I\nimpatiently sit waiting for the movie, I can't help but think back on\nthe previous midnight movie I saw. That film was, to say the least,\ndisappointing and not as great as I had hoped. <br><br>This film though...this film is amazing! My favorite of all Marvel\nfilms without a doubt. It's script, story and character development are\nwhat glued me to the screen, it was a heart pounding thriller that\nkicked some serious arse. <br><br>I'm not a huge fan of the First Avenger but believe me, the Winter\nSoldier taught me not to underestimate the good Captain America. He's a\nbadass Avenger who could probably give Iron Man a run for his money.\nEveryone performs brilliantly and they deliver the well crafted line so\nwell. <br><br>If there was one film that deserved an Oscar, it was this.\n"},
{"review": "\nThis movie is great. I walked into the theater with high hopes and was\nnot disappointed. The action was breathtaking and the story-line kept\nme on the edge of my seat. Captain America really showed off his skills\nin this film too. In The Avengers and Captain America:The First\nAvenger, Cap does not show off his skills. Before this film Cap was one\nof the least popular Avenger. But,this movie turned things around. He\nis now one of the most popular Avengers. Also, Falcon was a great\naddition to the Marvel Cinematic Universe. Hopefully he will have an\nimportant role in the upcoming Avengers films. Also, The Winter Soldier\nwas an amazing villain. The twist of Bucky being alive was excellent\nand the fact that he is now against Cap is even better. All in all,\nthis movie was a great addition to the Marvel Cinematic Universe and\nset the tone perfectly for the Avengers Age of Ultron.\n"},
{"review": "\nNot really a superhero movie, more of a spy espionage thriller, and\ncertainly not about the Winter Soldier as he barely features. But that\nsaid is was a hell of a lot of fun<br><br>Plot In A Paragraph: following the events of the first movie, and the\nevents of \"Avengers Assemble\" Steve Rogers struggles to embrace his\nrole in the modern world and with a little help from Black Widow and a\nnew friend, he battles a new threat from old history: the Soviet agent\nknown as the Winter Soldier.<br><br>Chris Evans is as excellent as ever as Steve Rogers/Captain America,\nScarlett Johansson is likewise excellent as Natasha Romanov/Black\nWidow, Samuel L Jackson is as reliable as ever as Nick Fury, Cobie\nSmulders does well in her small role and Anthony Mackie is a welcome\naddition as Sam Wilson/Falcon<br><br>However Robert Redford seems totally out of place as Alexander Pierce A\nsenior leader within S.H.I.E.L.D and Sebastian Stan is not given as\nmuch to do as one would hope as Bucky Barnes/The Winter Soldier\n"},
{"review": "\nThis movie is awesome. With the Thor series, The First Avenger, and The\nIncredible Hulk being average, and The Avengers being a bit of a let\ndown, this movie really did take Marvel to another level. The music is\ngood, but the acting, plot, and story is fantastic. Captain America may\nnot be the greatest superhero ever, but this movie took MCU to a whole\nother level and is (in my opinion) in the top tree for greatest\nsuperhero films ever made. The villain in this film is really\ninteresting as it ties back to the first Captain America. The action\nscenes are amazing as every fight is breathtaking.This film may not\nhave the humorous scenes like all the other marvel movies but it's\nreplaced by non-stop action.The effects are also good.I would recommend\nanybody to watch this movie as it is that good.\n"},
{"review": "\nLet me start off by saying, I wasn't the biggest fan of the first\nCaptain \"Murica\" film so going into this film I didn't have the highest\nof hopes. But I was really surprised on how much I enjoyed this film,\nIt acts as a squeal to the first Captain America film and The Avengers\nso there is lots for the story to cover. It follows Cap working with\nSHIELD and highlights how different his views are compared to that of\nSHIELD. All the big name SHIELD agents are back to :Samuel L. Jackson,\nScarlett Johansson and Anthony Mackie. The Action in this movie (What\nreally Matters) Is amazing, Car cases,Great CGI and just all around ass\nkicking. It held my attention much better then the first, great for a\nweekend movie night\n"},
{"review": "\nI was lucky enough to get this film from my local library, so I watched\nit several times. I love many of these Marvel films, but the Captain\nAmerica ones are the best...better than Iron Man, Thor, Hulk, or\nSpiderman. Maybe it's Chris Evans good looks and goody two shoes\nqualities, or the good guys fighting the bad bad guys. But Cap America\nhas a storyline that works.<br><br>You really can't talk much about this film without giving out spoilers.\nJust be ready for some major changes. My fave scene by far is the\nelevator scene where it becomes obvious who is on what side. Plenty of\ngreat fighting, and as you'd expect, a finale involving Cap and Winter\nSoldier. <br><br>It would have been cool for Cap to get together with Black Widow, but\nit seems that at least for now, not happening. Keep it up Marvel.\nenjoy.\n"},
{"review": "\nFinally We Ended Up In Cinemas For A Followup to The Avengers And\nCaptain America.The Film Begins 2 Years After The Events of The\nAvengers with Steve Fitting In With Rest of The World.The Hostage\nSituation in the beginning just confirmed that we will be getting an\nawesome movie.The Shield Secret was unexpected and was a great plot\ntwist.Anthony Mackie was well chosen and gave a great performance as\nFalcon.The Special Effects were nice,so was the cast.Chris\nEvans,Scarlett Johannson,Samuel L Jackson,Robert Redford and Anthony\nMackie were well chosen and great so was Sebastian Shaw With His\nPortrayal of the Winter Soldier.Speaking of the Winter Soldier,His\ncharacter and Character Development were really impressive.Finally,The\nRusso Brothers gave us an excellent film with their Excellent Direction\nand gave us a great movie and gave a hint for what's next.<br><br>P.S.I Too Noticed The Doctor Strange Easter Egg\n"},
{"review": "\nThere are a lot of movies I've watched this year, but Captain America:\nThe Winter Soldier is, undoubtedly the best I have seen not only in\nthis year, in a long time. The most I liked from this one was the\nhand-to- hand combat. It was because the fights scenes are so well\ndone, with a great choreography behind them. Special effects are\namazing, see it and you will realize that everything in this movie\nlooks realistic.<br><br>Chris Evans does a great job as Captain America, I just hope he won't\nbe replaced for the next movie. Sebastian Stan, Scarlett Johanson and\nSamuel .L. Jackson were so good at their roles. With this, Marvel has\ndemonstrated that they have a lot more to show and I can't wait to see\nThe Avengers: Age of Ultron. I'd say that Captain America is now my\nfavourite superhero after seeing this.<br><br>Don't miss it. This is a must watch!<br><br>10/10.\n"},
{"review": "\nGreetings from Lithuania.<br><br>I'm not a big Marvel fan, nevertheless like many out here i have\nwatched all Marvel movies. I still think that \"Iron Man\" (2008) was the\nbest of the bunch, more exiting than \"The Avengers\" (2012) - now you\ncan start throwing rocks at me. I also highly enjoyed \"Captain America:\nThe First Avenger\" (2011) - it was very cool movie. And the worst from\nthe bunch was annoying \"Thor: The Dark World\" (2013) - crap, not a\nfilm. <br><br>\"Captain America: The Winter Soldier\" is what Marvel does the best,\nit's not very complicated, but very enjoyable action flick - nothing\nmore. Actions scenes are very cool, not overdone in CGI, i was\nsurprised seeing greatly done car chases in superhero movie, they were\nreally cool. Like i said, i'm not a fan of Marvel stuff, so overall, if\nyou enjoy the first Captain America film, you are going to like this\none as well. Nothing really new, but still 2 fun hours to waste.\n"},
{"review": "\nThis movie is definitely one of the best marvel movies so far. In my\nopinion it's there just behind the avengers. This movie was handled\nperfectly and is a lot better than the first movie. After watching iron\nman 3 I was worried that Disney would try to make this movie the same\nway but they made it so much better. There was a lot of comic relief in\nthe fight scenes but it was not done like in iron man 3 where the\ncomedy distracted me it was done in such a way that it made me laugh\nbut didn't distract me from the fighting. The falcon was put into the\nmovie perfectly not like in the avengers assemble TV show in that show\nhe is made to look like a childish hero but in the movie he was done so\nmuch better that it made me forget that the childish falcon even\nexisted. The winter soldier is a great villain and I can't wait to see\nhim in the future movies. So if you haven't seen this movie I would\ndefinitely say for you to go and see it as soon as possible.\n"},
{"review": "\nThroughout the film, my mind was blown all over the place. Yes, my\nexpectation to this film was very low because of the first one (that\nbrought me to sleep). But when the movie start, there is a feeling that\nthis film might be good, not awesome,not yet. Along the journey of the\nfilm till the end, my expectation change 180 degree. Its action-packed,\nemotional, elegant(in an awesome way) and bedazzled. I am really mad of\nmyself because giving this such a low expectation. But above all this,\ni just wanna say, Captain America, you're the best Marvel's movie in my\nentire life although you're kinda old-school. This also maybe had\novercome Marvel's The Avengers (which also my favorite superhero\nmovie). BTW, the scene between the credits is awesome as an\nintroduction to Quicksilver and Scarlet Witch.\n"},
{"review": "\nTo be honest, I never really liked Captain America as a hero. I was\nmore a Spiderman/Batman guy. But, after seeing this movie, my thoughts\nhave changed. Chris Evans acts wonderfully as Cap with all the jokes\nand fighting. The action sequences are just amazing. And the twist in\nthe middle. AH-MAZING! But the other actors do a terrific job. Anthony\nMackie is just too good as Falcon, Samuel L Jackson excels again as\nNick Fury, Sebastian Stan makes the most badass villain ever, but\nRobert Redford is the clincher. His acting is just masterful. Must\nwatch for any moviefan. P.s- watch the credits scene, important stuff\nhappens ;)\n"},
{"review": "\nMarvel has been doing great movies since the start, and the all new\ncaptain America is once again, another film that's up to all fan's\nexpectations. I find Captain America The Winter soldier an excellent\nand engaging movie, which will engulf you into a world of excitement\nand entertainment. In this movie you finally see Steve Rogers dealing\nwith the new modern world, and it added more feeling to the movie\nseeing that he wasn't absolutely comfortable with the new modern world.\nSPOILERS. Once you find out that The Winter Soldier is Bucky Barnes,\nthe movie gets interesting because you start to wonder how captain\nAmerica is going to fight his best friend? The baddie doesn't have many\nlines, but was all told by his eyes and movements, great acting\nSebastian. Chris Evans was also an amazing actor, he portrayed the\ncharacter brilliantly. It was an excellent movie, and everybody should\nbuy the next tickets for The Winter Soldier in the cinema near you.\n"},
{"review": "\nI really enjoyed the first movie, but this one is way better! The way\nthe action sequences, history, jokes, and every aspect is glued is\nsuperb!, you never get bored and the film always keep you entertained.<br><br>Also the plot twists are very good.<br><br>The CG are from the best in modern films! you can't even tell the\ndifference from real sets/locations and from Computer Graphics.<br><br>The action sequences feel very solid, are credible and keep you excited\nand wanting more!<br><br>Marvel has achieved a good integration of other films, characters and\neven from the TV series Agents of SHIELD.<br><br>It's a must for any comic fan but also for any action film lover.<br><br>Hope that from now on, every other Marvel movie is crafted and\ndelivered in the same way!\n"},
{"review": "\nThis movie is just pure awesomeness. It's really fun and entertaining.\nThe plot in this movie was way way better that the first Captain\nAmerica. However, even though it's more fun and entertaining that the\nfirst one. The drama part is lesser,if they are more drama part it\ncould have more tension, that's the only problem. I just want to see\nmore dramatic part between Captain America and The Winter Soldier which\nis his best friend Bucky. That's the only problem in the movie I think.\nThe movie is fun, entertaining, and better plot that the first one.\nRobert Redford is just amazing in the movie, he tricks everyone\nincluding Nick Fury. This movie is just great in almost every way.Very\nclose to being the best marvel ever in my opinion. I think the only\nMarvel movie that is better than Captain America: The Winter Soldier is\nprobably Iron Man. However, this movie is amazing. It was one of the\nBest Marvel Movie Ever! Captain America, you did it this time!\n"},
{"review": "\nI will admit when watching the followup to 2011 film I liked how it\nshowed Steve Rogers dealing with the modern world and continuing to\nhelp others. When Steve's old friend Bucky Barnes as the winter solider\nwho has been brainwashed by hydra into being a assassin it makes Steve\nquestion the morality of shield and its ethics. In terms of the\nnewcomers I would say that Anthony mackie is fantastic as Sam Wilson\naka the falcon who is an important ally to Steve Rogers. I do wish that\nEmily van camp would have been given more to do as Sharon carter ask\nagent 13 but hopefully her role will be bigger in the third film. I\nwould say that Robert Redford as Alexander pierce is a rather\ninteresting addition to the role since there is a sense of mystery to\nhis character. I will say that the events of this film will be a set up\nfor the avengers sequel age of ultron. Can't wait for the next captain\nAmerica sequel.\n"},
{"review": "\nAfter the Avengers this is by far the best flick by Marvel Studios.\nWithin the Marvel universe the last Iron Man movie was a complete\ndisaster, Cap. America delivers from a much more approachable angle\nwith the rise of hydra, Cap questioning the ever more growing police\nstate and constant surveillance. While Cap thinks compromises are\nnecessary it isn't worth it with the loss of freedom, and challenges\nthe established ethos. Later to find out S.H.I.E.L.D being compromised\nby HYDRA within.<br><br>Actions shots were awesome at the beginning with Cap, but later on it\nkinda movies into whats with the shield Cap Pic up a gun in a gun\nfight. Later scenes it get screwed up with Cap risking the mission when\nhe did not properly neutralize Winter Soldier aka Bucky. Personally it\nfelt like lazy story telling. <br><br>What more I think the movie does shed some light into the overgrowing\nsecurity and surveillance obsession the world is gearing towards\n"},
{"review": "\nCaptain America:The Winter Soldier consists of a great plot,great\ntwists,marvelous action moments and one of the very best fight\nchoreographs in history!!!Chris Evans manages to balance Steve Rodgers\nand the man in the suit!Great performance,Cap is Chris Evans no\ndoubt.this time Natasha and Fury shared enough screen time so we took a\nbetter look to these characters than any other movie of the MCU\ncombined!Scarlett and Samuel did a great job,any time they were in\nfront they grabbed the moment...also i was surprised with Mackie\nalthough he didn't have much screen time,he offered the proper humor\nfor this more serious marvel movie with great memorable lines!In fact i\nam not in a position to describe how well developed,constructed and\ndirected was this movie.All i can say is i wanna see it again and again\nand again....CBMs watch out...ON YOUR LEFT!!!!!!!!!!\n"},
{"review": "\nCaptain America is an amazing Science Fiction movie. It is about\nCaptain America a S.H.E.I.L.D super soldier who everyone hates because\nNick Fury, the president of Shield had been shot in Steve Roger's\napartment. Everyone in Shield believes that Steve had shot Nick Fury.\nLuckily for Steve a girl knew who shot Fury! Together, they found out\nthat a terrorist group called Hydra - tracing back to the Nazi days -\nhad secretly been controlling Shield through the secretary of the\nSecurity Council. They joined up with another friend -an ex Shield\nsoldier - and destroyed Hydra. Steve's friend Paki, had his short term\nmemory erased and is tasked to kill Rogers. Fortunately, he realized\nthat Steve was his best friend and stopped fighting. This movie is\noutstanding and I would rate it 10 on 10.\n"},
{"review": "\nI'm gonna be as spoiler free as possible, but this movie holds a seat\nright there next to Avengers for me. Some reviews may have said it's\ntoo long but I think it was the perfect length. For me it made up for\nwhat Iron Man 3 and Thor the Dark World lacked. As much as I enjoyed\nboth movies, this has made Phase 2 STELLAR! I look forward to the rest\nof Phase 2. And I'm pumped for Phase 3. The action in the movie is deep\nand the lack of CGI makes the movie that much better and more realistic\nthan others in the Marvel Universe. The Russo's are right up there with\nFavreau and Whedon as best directors in the MCU. I'm just so impressed\nby how deep the mythos have gotten. You can sign me up for whatever\nmovies come next from marvel. Don't fail me now!\n"},
{"review": "\nThe winter soldier is a masterpiece. But the USP is Sebastian Stan(the\nwinter soldier). He takes the movie to another level. very less\nvillains do so much better. Chris Evans is as better as he can. In\nnutshell, this movie doesn't have a single second of boredom. it'll\nsurely keep you on the edges of your seat.<br><br>Black Widow looks sexy as always, but she wasn't given much screen\nspace. this part is so much better than the previous one. Captain\nAmerica's fan numbers are going to increase after this movie. Also,\nbefore watching this one, make sure you have watched the previous part\nas much of the stuff is related\n"},
{"review": "\nActually, i'm not one of Captain America's fans. But this sequel movies\nis much better than the first avenger. the winter soldier show us great\nstory lines, effects, script and best cast. i can't imagine Captain\nAmerica playing by other actor. Chris Evans did a very good job for\nthis role.<br><br>I love watching the movie right from the start until the end, at first\ni thought this movie will be boring like the first one. but it come out\ngreat and i want to watch it again in the movie.<br><br>for you question this movie worth to watch? yes this movie is worth to\nwatch, and i'm giving 9 out 10 for this movie. hope this useful :)\n"},
{"review": "\nAfter watching the first Captain American I thought that it wasn't as\ngood as the likes of Iron Man and other Avengers films, but after\nwatching this in 3D I can honestly say I change my mind. Chris Evans'\nperformance was great, taking into consideration that he's only a\nmoderately known actor.<br><br>The film is a direct sequel to the first and after The Avengers\ncontinuing from where the first left off - in the 21st century - but\nbeing that it's set in the 21st century, Marvel seems to have took\nadvantage of that by adding a range of bad ass equipment to it.<br><br>The winter soldier is completely a bad ass leaving you in shock once\nyou find out who it is. The film continues mixing faster pace scene\nwith slow pace scenes to balance it out, but the fight scenes are\nfantastic! There are some familiar faces and amazing twists, all formed\ntogether nicely with an undercurrent of comedy.<br><br>Definitely worth a watch. 9/10\n"},
{"review": "\nI simply loved Captain America: The Winter Soldier. It felt more like a\nspy movie than another Superhero movie. In the first Captain America\nand the Avenger, I never felt like he was really important since he was\njust a little bit strong and really good at gymnastic. In this movie,\nit was more about his intelligence mixed with some action. The balance\nwas perfect between both. It was more psychological and darker which\nyou don't really have in the Marvel Universe.<br><br>Though I took off a point, since every plot twist was predictable since\nit's a Superhero movie from the Marvel Universe. Though, I felt that it\nfitted perfectly in our reality with the NSA and the CIA covering up\neverything. I felt more involved in the movie since it was during the\n21st century. This was a brilliant effort and I was really surprised. I\nnever thought it would be fun and entertaining as well.\n"},
{"review": "\nThis part was best and better than first part. I would like to see\nthird part with enemies from another country. I will get sick of Hydra\nif they use same name in 3rd part.<br><br>Overall Chris made a great symmetry and looks perfect for super hero.\nMovie is worth watching no major CGI or virtual displays used like in\nIron man. The CGI was very limited and gave a good twisted here and\nthere.<br><br>Looking forward for great story and less CGI in 3rd part with more\ncharacters and continue to keep that serious look in Cap.<br><br>I wonder if they would get more side kicks in next part. I'm really\nexcited for the next one.\n"},
{"review": "\nWRITERS READ THIS. Spoiler alert! I liked that the Captain kept his\nword to the scientist who made him that way, to do good. It would have\nbeen funny to see the Captain trying to adjust to cell phones,\ncomputers, Flat screen TVs etc. But I think it wouldn't hurt if he and\nBlack Widow had just a small thing going outside of hero work for a\nwhile or longer. I know they don't like making superheroes get involved\nor married, I don't see why. It was good the writers showed Captain A\ngo visit Peggy. I hope Chris Evans keeps doing the sequels AND LOVELY\nScarlett keeps portraying Black Widow. I hope Bucky remembers the\nCaptain and they team up in future sequels. I don't read the comics but\nI have a feeling Hydra went into space and will be back.\n"},
{"review": "\nIt's gonna be hard for any Marvel movie this new Captain America movie,\nthis film has great action, and good acting, and mixes a little of a on\nthe run type thrillers like Three days of the Condor(1975).<br><br>Steve Rodgers/Captain America(Chris Evans) is S.H.I.E.D.S top agent,\nwhile still trying to adjust to life in the new millennium. But then is\ndouble crossed by someone inside, and he and Black Widow(Scarlett\nJohansson) quickly go on the run, while trying to uncover of who is\nbehind this, they are tailed by someone who is called The Winter\nSoldier, who's super human abilities are a match for Captain America.<br><br>This marvel film is gonna be hard to top. Chris Evans is great, so was\nScarlett Johansson and Samuel L. Jackson we really get to see them grow\nhas characters here. Anthony Mackie was awesome The Falcon, hope to see\nhim in more marvel movies in the future. Robert Redford is good also,\nnever thought i'd see him in a superhero film, but he was great. It had\ngreat action, and great fight scenes. This marvel film is gonna be hard\nto top.\n"},
{"review": "\nFrom beginning to end is full of action packed and great camera shots\nof fights. Adding Robert Redford to the movie as a stunning villain,\nwas a smart move, as he takes the whole movie to a different point from\nan actors performance point of view. He plays a smart and frightening\nrole in a brilliant way.<br><br>Even if some of the characters miss the depth of the likes of Dark\nKnight it is still a brilliant movie that you should give a try.<br><br>Now and since the movie is a hit worldwide, surpassing the first one in\ngross revenues and setting a new April record lets hope they keep the\ngood work with the (hinted) upcoming Avengers movie and put both\nAnthony Russo, Joe Russo and Joss Whedon as consultants.\n"},
{"review": "\nHands down this is my favorite marvel movie so far. This exceeds the\nfirst Captain America by 1000%. The action was amazing, the plot kept\nme on the edge of my seat, and the CGI was perfect. This feels a lot\nmore like an action/thriller than a superhero movie. I love that the\nsuperhero elements are not forced. They are still there but it feels\nlike it's apart of the movie rather than an aid to the movie. I can't\nwait to see Civil War.<br><br>I highly recommend seeing Captain America: The Winter Soldier.<br><br>Plot:10/10, Action:10/10, CGI/Scenery:10/10<br><br>I'm team Captain America all the way!\n"},
{"review": "\nIt's worth to wait and this is a very good action hero films you've to\nwatch, i think that funny some shot but it's a original very super hero\nfilms or call \"best of marvel\". everyone loves it. my parents loved it.\nmy friend loved it \"this is very funny moments\". my grandpa loved it\n\"that's very action and boom!!!\" or my girlfriend loved this. she went\nto cinema with me since 2012 and we watched many films. but she doesn't\nlike any films. then this films came to cinema. she asked me to watched\nbut i didn't want to watched it very much. finally we went to the\nnearest cinema and watched it. i like it so much!!!! then my other\nfriend asked me to dinner but i invited him to the party and i very\nfunny that's a excellent moments i've never seen like this before and i\ndrunk some beer and cookies that my mom made it from the butter and\nmilkshake!! so we watched captain America and Batman.\n"},
{"review": "\nThis is an amazing movie. i was really impressed by the movie. I am\nlooking forward for action blockbuster in the Cap America series.\nEspecially in 3D, final fight was superb. And Chris Evans impressed me\nvery much.And the timing of little bit humor is awesome. As usual\nSam.L.Jackson proved what an actor he is. And story line dint lost any\nlogic even after having action scenes.This movie is worth seeing trice.\nLooking forward for the Avengers 2 movie. Hope it will reach the\nstandards of Cap America 2 Movie. And a terrific elevator fight\nsequence probably stands out as truly memorable whereas the encounters\nwith the Winter Soldier never feel repetitive. The actors are\nabsolutely brilliant in their roles. This film is simply exceptional in\nevery way.\n"},
{"review": "\nThere are a few things at which \"the Winter Soldier\" excels. One, it's\nentertaining (draggy in parts, but overall great). For another, it's\ngot some great chemistry. I liked the repartee between Chris Evans and\nScarlet Johansson. She delivers a lot of her lines almost with a\nknowing wink. But there's a genuine relationship between Cap and Falcon\n(someone who's introduced as an actual fleshed-out character). And I do\nlove that this is a '70s political thriller masquerading as a comic\nbook movie. Secrets govern everything, D.C. is choked up with sleeper\nagents and the mistrust runs deep.<br><br>As a sequel, it's self-assured and a great Captain America story. And\nwith another Avengers movie on the horizon, it's not a glorified\ncommercial, which is saying something.<br><br>7/10\n"},
{"review": "\nI'm one of the few that don't like superhero movies, except for maybe\nthe darker, more serious ones like the Dark Knight. Although the world\nseemed to think that the Avengers was top Blockbuster worthy, I found\nit to be no different than the slew of over-the-top superhero movies\nbefore it like Iron Man and Thor. It did not do anything for me.<br><br>But Captain America: the Winter Soldier is legit. There were no bad\nguys from another planet with supernatural powers and such, there were\njust bad guys who were tough to beat. And the fight sequences in this\nmovie, in my opinion, is setting a new bar for the best fight\nchoreography so far. Amazing fight scenes, amazing stunts, and amazing\nvisuals. All the characters were great and believable, and the acting\nwas top notch(considering it's not so much a script movie as it is an\naction movie). Have to say, love the bad guys in this one. Go see it,\nyou'll have a great time!\n"},
{"review": "\nMarvel just keeps getting better and better, and with their seemingly\nendless releases and sequels, the bar gets raised higher every time.\nOut of all the Avengers, Captain America is one of my favourites. He\nhas 50's charm and naivety with an astonishing amount of brawn and\nbravery. <br><br>This film is fast paced, will have you jumping out your seat and for\nserious Marvel fans, will tug at your heart strings. The plot is\nextremely well developed, filled with surprises and plot twists that\nreflects the inner turmoil that Captain America is faced with as he\nstruggles to figure out what exactly he is fighting for, and what is\nthe true meaning of freedom. <br><br>Special effects and fight scenes are mind-blowing. And as always, stick\naround for the end credits for a sneak preview of the next Marvel\nadventure... it's going to be a good one.\n"},
{"review": "\nAfter the cataclysmic events in New York with The Avengers, Steve\nRogers, aka Captain America, living quietly in Washington, D.C. and\ntrying to adjust to the modern world. But when a S.H.I.E.L.D. colleague\ncomes under attack, Steve becomes embroiled in a web of intrigue that\nthreatens to put the world at risk. Joining forces with the Black\nWidow, Captain America struggles to expose the ever-widening conspiracy\nwhile fighting off professional assassins sent to silence him at every\nturn. When the full scope of the villainous plot is revealed, Captain\nAmerica and the Black Widow enlist the help of a new ally, the Falcon.\nHowever, they soon find themselves up against an unexpected and\nformidable enemy- the Winter Soldier.<br><br>Captain America: The Winter Soldier is a mesmerizing superhero film\nthat satisfies on every level. When that last snake head is chopped\noff, you still find yourself wanting more after 136-minutes of pure\ncomic book superhero cinematic nirvana.<br><br>So I want you guys to go to the cinema and enjoy this movie, That's all\n"},
{"review": "\nBefore seeing this film I had very high hopes. The previews looked\namazing and the reviews were all pretty good as well. And it didn't\ndisappoint. This might be my favorite Marvel movie yet. It has it all\nwith the action, comedy and twists to keep you entertained throughout\nthe entire movie.<br><br>I personally didn't like the first one at all. I thought it was boring\nand didn't keep the audience interested. The action wasn't all that\ngreat either. But this one has you hooked from the start. You laugh a\nminute into the movie.<br><br>Over the course of the movie things happen and it definitely sets it up\nnicely for the next Avengers movie. All these marvel movies seem to be\nepisodes in a very long TV series but instead of episodes, they are\nhigh profile movies and I'm not complaining because I think they all\nkeep getting better and better.<br><br>Once again stay past the end credits...and I mean all of the credits.\n"},
{"review": "\nA superhero movie with it's usual pack filled with action and mayhem.\nAlong with the lines of political thriller and roots from the comic\nbook storyline. Captain America 2: The Winter Soldier has everything\nthat a fanboy can cheer for.<br><br>Compared to it's weak prequel, The Winter Soldier Excels in every\naspect. Whether it is story or action. Aside from the movie milestone\nAvengers, this might be the best movie in the MCU. Chris Evans, now in\nhis signature role shine as ever. Samuel.L.Jackson, Scarlet Johanson\nand Anthony Macke are also joyful to watch. But it was Sebastian Stan's\nwinter soldier was the treat for eyes. With cool movements and skills\nhe steals the show. <br><br>As for the downside, the plot was a predictable one, and the whole\nHydra business was a bit overlooked. Aside from that Captain America:\nThe Winter Soldier is a perfect blockbuster for every age.\n"},
{"review": "\nNot being a fan of captain America and not enjoying the first film,\nbecause it was full of clichés, I was quite surprised by this movie. It\nwas actually really good! For a Marvel film this is definitely great\nand one of my favourite superhero films now.<br><br>It was a welcome change to see a superhero film tell a tale which\ninvolves politics, security and the role of authority. Captain America\nis a great choice for tell us a story because of what he represents:\nthe ideal American in superhero form. Well done to all involved for\ngoing beyond a straight-cut comic book-to-film adaptation and making a\nmemorable story.<br><br>As with any superhero and action film there are movie mistakes,\nridiculous moments and inconsistent character actions. Often these can\nruin a film however in this instance being a superhero film, and a good\nstory, it doesn't detract at all and instead you'll be interested all\nthe way through.<br><br>I can easily recommend this to anyone.\n"},
{"review": "\nI always love superhero movies... I don't read the comic, but from the\n1st and the 2nd movie, one thing that surely being the character is\nthat Steve Rogers always have different way of thinking which emphasize\nmany values of humanity and not just derived by being \"true\" or being\n\"wrong\".<br><br>In this sequel, one thing that I didn't get the point was why should\nCaptain America steal his old uniform from the museum ? I thought it\nwas to help Bucky gain his memory back, but what I saw is that was just\nto create some humor.<br><br>When Nick Fury presumed dead, I was 100% sure that he was not, so, I\nthink such trick has been used million times in movies and it will be a\nlot better if the scenario didn't put such plot.\n"},
{"review": "\nMarvel's 'The Avengers' set the bar awfully high, and up until now\ntheir so-called \"Phase 2\" had clumsily done the limbo right beneath it.\n'Captain America: The Winter Soldier' doesn't reach the dizzying\nheights of 'The Avengers', but it delivers a thrilling, fun, thoughtful\nfilm that manages to both build upon the Avengers cinematic universe\nand yet stand on its own.<br><br>What I really love about 'Winter Soldier' is that, at its heart, it's a\n70s-style political conspiracy thriller. As if to drive that point\nhome, they cast Robert Redford, who adds a real dimension of gravitas\nto the film. Of course the movie is called 'Captain America', and Cap\nis in fine Form here. Evans really owns the role now, bringing a quiet\nintegrity as well as the physical goods.<br><br>My enthusiasm for Mighty Marvel's cinematic Lollapalooza had started to\nflag, but now I'm more excited than ever for 'Avengers 2'.<br><br>Avengers, assemble!\n"}
]