[
{"review": "\nI was really looking forward to this movie even knowing that Abrams\nwill be directing it. And now I wish I didn't watch. It was just bad.\nNo other words for it.<br><br>Everyone already said about plot being just a random rehash of previous\nepisodes. We've already seen all situations, all locations, all plot\nturns. There's nothing original in this movie and it seems pointless in\ngeneral. <br><br>SPOILER SPOILER SPOILER SPOILER<br><br>Some basics of the SW Universe are changed to accommodate the\ncharacters. Now a guy who is not a Force-user can fight with a trained\nSith using a lightsaber. Untrained Force-user can use jedi mindtricks\nwith no training at all. Sith can feel a non-Force-user from across\nconsiderable distance but not if the same man is standing 10 meters\napart from him. Stormtroopers see Sith have a fit if pointless\nhysterics and calmly walk away from him despite his summons. Light Side\nis a constant seduction to Siths. And so on and so on... It all feels\nlike a badly written fanfic.<br><br>END SPOILERS<br><br>And it is also filmed badly. In all Star Wars movies first appearance\nof ship or a planet always was a momentous scene. This is totally lost\nhere. Also there are many unflattering camera angles, poorly\nchoreographed scenes, battle sequences are rushed and not always\nthought-out. With modern technology and special effects it could have\nbeen magnificent, but instead it's cheaply looking. I've caught myself\nthinking that \"A New Hope\" looked better and more advanced than this\none.<br><br>Maybe if you've never watched Star Wars you will like this movie, but\nfor those familiar with old episodes it most probably will be a major\nlet down.<br><br>1 out of 10 just because it' impossible to give 0.\n"},
{"review": "\nStar Wars to me has always been about imagination.<br><br>There's a lot that has been said about George Lucas in the last forty\nyears, but there's one thing that can't be denied: he had imagination.<br><br>JJ Abrams however does not and it shows in The Force Awakens. Besides\nthe plot, which isn't original to say the least and has a lot of\nquestionable elements, the visual design is very bland and derivative.\nThe actual look and feel of the film reminds more of JJ's Star Trek\nfilms than of the original Star Wars trilogy, although luckily there\nare only a handful of lens flares to be seen.<br><br>Even the music sounds uninspired. Which is a shame since the music was\nalways one of the strongest parts of Star Wars.<br><br>All in all it's an extremely average film, which would have been fine\nif it wasn't Star Wars. Star Wars is about pushing the limits and the\nonly thing that was pushed here is your hype button.<br><br>The prequel trilogy was a misstep in a lot of aspects, but at least\nGeorge tried to innovate and create something new. The Force Awakens\nhowever is a big step backwards.\n"},
{"review": "\nThis is a prime example of a modern movie with stunning visuals but\nlame writing ...not a bad way to kill a few hours whilst stuffing your\nface with popcorn and playing with your phone but overhaul the story\nhad to many stupid moments that you'd have to be utterly mindless to\nforgive.<br><br>There's also nothing new here and the dark side are making the same\nstupid mistakes they were making 30 years ago. It's almost like a\nremake or homage to the original films.<br><br>The two main good characters are awfully skilled in lightsaber fighting\nand/or using the force considering they didn't even have a clue twenty\nminutes earlier and had no training in either. The main bad guy despite\nhaving training from the dark side appears average against the two\nnobody's who suddenly have discovered their remarkable skill.<br><br>Eye candy not brain candy. It's mindless fun but too mindless...more\nbrain dead...leaving the intelligent member's of the audience thinking,\nwhat?\n"},
{"review": "\nSo. I was under the impression, that this was supposed to be a sequel,\nnot a remake. It markets itself as a sequel, so there is no reason to\nthink of it as a reboot. Yet the plot and the characters were recycled\nfrom the old movies.<br><br>A Darth Vader wannabe, with a plan from ep. IV, a re-gendered Luke with\ngod mode powers turned on, female Yoda 2.0, etc. Whole scenes were\nremade. The plot was copy-pasted and yet they somehow managed to make\nit inconsistent. The characters were terribly profiled. I found storm\ntrooper kid totally laughable. Over-powered Rey was just the icing on\nthis disgusting cake. The acting was terrible, but even Orson Welles\ncouldn't make these fan-fic level characterizations work.<br><br>This movie is beyond unoriginal. It is just saddening how well received\nthis over-hyped piece of crap was. It makes me think that it's enough\nto tell people what they're supposed to like, to give some money to\nreviewers and everything's gonna be OK for you.<br><br>A disappointing movie in itself and as a cultural phenomenon. One of my\ngreatest cinematographic disappointments. Then again: makes me\nappreciate the prequels just a little bit more. Although they were\nterrible movies, they brought tons of new stuff to the table. I can't\nthink of anything original, this movie has brought, and lemme tell you:\nIT FEELS FRIGGIN' DEPRESSING! Is this ENOUGH for movie-goers and\ncritics? THIS?! I hate this movie with all of my heart, but I can't\nbring myself to give it less than 4/10, because it is technically well\nmade. On a very crude technical level... Even with 4/10 though, I never\nquite hated any movie like this one. I hate it with a passion. Been\ngiving people thumbs up merely for hating it because I think that it's\ngot far too much praise. It ran one of the most original franchises\ninto stale, unoriginal, politically correct derivative waters.... God I\nhate this movie so much, along with everything it represents, it makes\nme wanna cry.\n"},
{"review": "\nNever felt the need to review a movie before but thought i had to\nspread the word that this reboot is beyond terrible. I went in with an\nopen mind and hoped jj Abrams would restore my faith in the franchise\nafter the terrible prequels. <br><br>Instead i got another rehashed,regurgitated story like we have seen\nrecently in so many other rebooted franchises such as ;terminator,the\nhobbit, spider-man etc.<br><br>This was made apparent when it became obvious that the plot was\ndirectly lifted from episode 4 and nothing new or original was created.\nWhat was delivered was some lame sand planet which was a direct copy of\ntattonine and a death planet that was 50x bigger than the original\ndeath star but was still easily destroyed by a small group of xwings.<br><br>Just like myself it seems the empire have not learned from their\nmistakes about the problem with building death stars and i have learned\nnothing about spending money to watch reboots.<br><br>Han solo dies which as my friend mentions to me is a metaphor for\nlovers of the old trilogy watching this piece of crap movie.\n"},
{"review": "\nUnder Disney ownership and with hacks such as JJ Abrams (with creative\ninput from Simon Pegg...God help us) at the helm now, unfortunately\nStar Wars has been reduced to yet another Transformers/Marvel mindless\naction, zero plot franchise designed purely to reach the widest\npossible audience. The legacy of the iconic characters of the OT\n(particularly Luke) have been reduced to the point of them being almost\nunrecognizable losers. The previous six film story arc has been\ncompletely undermined to say the least and the mystique and nature of\nthe Force simplified, dumbed down and instant.<br><br>The endless coincidences, JJs nonsensical, deus ex machina story,\nriddled with plot holes, absurd pacing and editing (which explains John\nWilliams difficulty to nail the score), lack of character\ndevelopment/backstory, so on and so on. The bastardization of SW\nuniverse laws and the basic fact that this was supposed to be Episode\nVII in a seamless saga, but instead we were coned and sold a\nforgettable reboot was utterly unforgivable. But alas it's a huge\ncommercial hit and the mob sing its praises. But without Lucas, it's\njust spaceships and lasers.\n"},
{"review": "\nLook, at least with the prequels George Lucas had the task of tying all\nof the plot subtleties together. This movie had the freedom to go any\ndirection it wanted.What did we get? Exactly what the mindless masses\nwanted, A New NEW Hope. <br><br>Nobody in the Disney chain of command thought that they should mention\nthat this is a totally unimaginative rehash? Nah, too many toys to\nsell.<br><br>Harrison Ford's phone-it-in performance was up there with the Crystal\nSkull, complete with the self-aware \"remember when\" lines delivered\nwith a \"why the f#ck am I here\" urgency. But hey, he got paid and got\nhis wish of killing off Solo as his character tried to point out how\nlow things have stooped in the end with this-is-horsesh*t gems like\n\"it's another death star.\"<br><br>No Han, this is a totally original idea, a device that brings death to\nstars as it powers itself up to destroy other planets. But alas, it has\na weakness, provided an X-Wing flies down a trench or some sh#t. Dark\nside, tie fighters, cantina, millennium falcon, my balls.<br><br>They young cast tries, but are left with the character development\nspace of, what's his name.... hell, Samuel L. Jackson played\nhim....um... that purple saber Jedi guy.<br><br>Hey, let's not be too critical, this movie gave me the confidence that\nI too could make it as a writer/director.\n"},
{"review": "\nThis film has four layers 1. Beautiful visuals, the outer layer 2.\nNostalgia 3. Cheesy jokes and predictable action 4. Emptiness, there's\nno weight to any of it, no atmosphere<br><br>Don't get me wrong I don't think it's a one out of ten but it does not\ndeserve to be ahead of films like the hateful eight and I feel bad for\nall the money Disney has managed to make for nothing original, I was\nlooking forward to it, but was so disappointed, there are plot holes\neverywhere that make you escape from the movie because you don't\nbelieve any of it, and everything is made overly dramatic without any\nsubtly so it just makes you cringe instead, there are no New ideas and\nthey make the galaxy feel as if it's the size of a small town rather\nthan that feeling of endlessness you get from the originals, the first\nhalf was better but the second half is so predictable, I liked Kylo ren\nand hope snoke is not just emperor 2.0 but the plot was far-fetched and\nthe cheesy jokes felt awkward and cringe worthy like in a marvel movie\nbut those jokes have more place in them\n"},
{"review": "\nI've never left a review for a movie before, but this movie calls for\nit. Disney completely broke the trust of long-time fans, and\nunnecessarily made a movie that could have been a positive experience\nfor many people into a very negative experience by killing Han Solo.\nWhy? They do not provide any new real heroes (or villains) and instead\nmake you watch the most iconic hero of the Star Wars universe die in\nfront of you in front of a laughable villain. I think a lot of people\nare going to be saddened by this completely unnecessary act. Even the\nforce itself was nothing that had \"soul\" anymore. Even that was flat.\nPeople weren't in love with Star Wars or lightsabers, they were in love\nwith the heroes that dared to go against tyrants. But this movie was\nmade by tyrants of the entertainment industry, what could we expect?\nThanks for nothing, Disney.\n"},
{"review": "\nFirst let me say that this is my first review on IMDb because Star Wars\nfor me in 2015 was the biggest hope... Now it is the biggest\ndisappointment ! There was no greatness in this movie at all, no great\nmusic, no great light saber battles and at the end Luke Skywalker did\nnot say even one word. Many people pointed out correctly that this was\na remake of various parts from previous movies. The only part which was\ngood was acting by Han Solo and a few good jokes but even then they\nkilled him and how, by his son ! How could Kylo Ren take off his mask\nthat fast in front of Rey without any mystery remaining for the next\nchapter ? J.J. Abrams did a great job in turning Star Trek from a\nboring movie into something close to Star Wars Clone Wars but he killed\nthis one, he totally led himself by Disney CEO's - shame on you J.J.\nAbrams !!! Also how could a girl or a boy who never was trained in\nlight saber duels face a Sith ( was he even a Sith-Apprentience ?)Yes\nthe new droid was great and fun, a few good jokes here and then but the\nspirit of star wars is gone ..... even in the phantom menace and clone\nwars they at least showed / introduced a planet with its creatures\ncombined with great music and have build up to every scene .... so gone\nis my love for star wars !!!\n"},
{"review": "\n.. or why not just call the eagles, they'll solve everything.<br><br>Rey could fix the film, she's never made a film -- or been on a working\nspaceship -- but she sells scrap, man! She knows everything about the\nFalcon, can just rip out a circuit board that was clearly put there for\nno reason at all. <br><br>Then she'll figure out she can control your mind.. how convenient.<br><br>Crazy part is, Daisy Ridley (Rey) holds the film together. Her acting\nfeels real. Unfortunately makes those around her look pale and hollow. <br><br>What justifies a 1/10 rating? Providing excellent story elements,\ncharacters, and thus potential, and then wasting it with plot holes: -\njumping over the shield - fixing/hacking random complex technology -\nlearning superpowers on the spot - losing superpowers on the spot (what\nup, Kylo Ren?) - Han shooting dudes over his shoulder - Han using\nChewy's crossbow for the 1st time (\"I like this!\" !?) - Lame acting,\nlooking at you John Boyega (Finn)<br><br>Most of all, Jeff Abrams, this is your mess. It's your job to\nsynthesize the elements together.<br><br>Han dies. That's fine. Sure, I don't think it did the character\njustice. But the movie jumped the shark at, well, jumping the shield.<br><br>Ultimately, it feels like a fan-film. Fun in parts, jilted plot line, B\ngrade acting, and something best forgotten about.<br><br>Star Wars is a trilogy.\n"},
{"review": "\nI went to the movie not expecting much and it managed to go past my\nsmall expectations and make it a very bad experience.<br><br>Two things that made me give this review: <br><br>1. It is a total rehash of old movies/ideas<br><br>2. The callousness use of nostalgia and modern day movie tactics ( fill\nit with action so that people don't notice the lack of story or meaning\n).<br><br>No meaningful scenes and a script that can only be described as written\nby teenagers. No new worlds, no new technology or civilizations. They\nmade a mockery out of the audience by using only a few scenes and\nmilking them until your eyes bleed. <br><br>Example: A scene with a building (hideaway)takes up 30 minutes of the\nmovie with no real value being added to the movie with this. <br><br>A villain that is not capable to fight after so much training he had\nuntil now and a girl that can defeat him with a light saber ( even\nthough she had no training). Even a traitor storm trooper can fight a\ntrained Jedi with no prior training (not to mention that he used the\nlight saber and for now has not been revealed as a Jedi or anything of\nthat sort). A mockery i tell you.<br><br>They even destroyed the bad ass image of Han Solo with the last scene\nhe had. That is not the image he had/should have/was build up to until\nnow.<br><br>If it would have been a stand-alone movie i would see this movie at an\n6.2 rating. But because it is part of a franchise i have to take into\nconsideration the movies made prior to this one so i cannot go past the\nrating of 1 star. In comparison, this movie does not deserve even this\n1 star because it was a rehash of the other movies!<br><br>I won't go to the cinema for the next one. I prefer to be disappointed\nat home with no wasted money on rehash junk.<br><br>May your profits be small, Disney!\n"},
{"review": "\nSpoilers follow: I've watched Star Wars 4-6 and I've enjoyed it\ntremendously.<br><br>This movie simply has too many plot holes.<br><br>For example: Why would the First Order rehash a bigger Death Star with\nexactly the same flaw as the original two. Is the First order incapable\nof learning from mistakes, or inventing anything new? Its laughably\nbad. Was it the directors intention to make the First Order look stupid\nand incompetent? They succeeded.<br><br>How is it Rey can pilot the Milennium Falcon with no training. Are the\nlaws of common sense not applicable in this movie? I thought Star Wars\ntried to make everything believable and down-to-earth. Here...not so.<br><br>Why is Han Solo wearing the same thing as 30 years back. Doesn't the\nwriter have any imagination that he could possibly be wearing something\ndifferent--or be doing something different. This is zero imagination to\nthe extreme.<br><br>Why would the First Order desperately try to find Luke. Is the First\nOrder so incompetent that the capability to destroy planet is not\nenough advantage against the resistance. Again it shows the First Order\nincredibly dumb. Transformers had better villains than this.<br><br>Where is the dialogue which drives the story. Nobody seemed to say\nanything remotely interesting or meaningful? How was this script\napproved&gt; To summarize, no matter how much money this makes, its\nclearly a product of hype--not a good story, nor good direction. This\nfeels like a poor imitation of a great product. Incredible waste.\n"},
{"review": "\nI've been on a roll with movies. I've enjoyed the last 5+ movies that\nI've seen in theaters. In addition, I am a huge Star Wars fan who is\neven a fan of the prequels. <br><br>I went into SW7 thinking there would be no chance I would be\ndisappointed... But I was so amazed by how bad this movie was.<br><br>The movie commits multiple FATAL FLAWS:<br><br>1) They take EVERYTHING from previous movies. Literally the most lazy\nwriting I've ever seen.... A bigger death star, a new emperor who has\ncontrol over a new Darth Vader who run a new Empire called First Order,\nwho face the same rebel forces... O yea, and since the father-son thing\nwas so cool the first time, they did it again... this time Han Solo is\nthe father... I'm now hearing rumors that a father-daughter\nrelationship will be released... Does anyone have appreciation for good\nwriting anymore?<br><br>2) They do a terrible job at setting the movie up. SW 6 ended with\nuniversal peace. 30 years later the \"First Order\" is even bigger than\nthe Empire... I guess they wanted to copy Episode 4 so bad that they\nhad to set the stage this way.<br><br>3) The worst flaw by far though... Rey beating Ren with no\nexperience.... I get it, you advertised this movie so girls would go\nsee it, but don't mess with SW like that. She's new and has to train\nlike everyone else. This was a giant middle finger to SW fans. Worst of\nall, it was done for the sake of raking in money.\n"},
{"review": "\nI don't understand all the reviews saying this was the best Star Wars\nmovie. This movie was a major letdown. I was expecting a new and fresh\nstoryline, not the Original Trilogy plot line (mostly episode 4) all\ncrammed into one movie. The entire movie theater was quiet after the\nmovie was over and it looked like a funeral. This movie was so\npredictable and there were plot holes everywhere. The character\ninteractions felt inauthentic. It's weird how Finn and Poe became best\nfriends instantly. I also didn't like that Rey's character learned how\nto use the force, ride the falcon, and fix random things like an expert\nout of nowhere with no training. I like strong female characters like\nAshoka, but I don't like it when the male characters respond to\neverything cool she does as if it was unexpected; this happens many\ntimes throughout the movie. I also hated the villains. Snoke looked\nlike Voldemort and looked like a giant troll at first with bad cgi. Ren\nstarts off cool and turns into whiny b*** as the movie goes on. I see a\nlot of people who liked it or who have been paid to like it saying that\nif you didn't like this movie that it means you didn't like the\noriginal trilogy. Thats BS. I love star wars and enjoyed episodes 1-6.\nThis movie is so bad that I miss the creativity of Episode 1. Episode 1\nwas weak, but at least it was original. This movie felt like Age of\nUltron and the Transformers movies. George Lucas needs to come back. He\nat least cared about storytelling.\n"},
{"review": "\nBoring is too much of a compliment, this movie is almost annoying. Very\ndisappointed as Star Wars fun, I've been looking at the watch\nimpatiently waiting for the end of the movie. It's like a never ending\nintroduction, you always wait for the real film to begin, but it never\ndoes. Absolutely no glamor, no imagination, no new star ships,\nshameless copying from previous episodes for an asphyxiating plot with\nno change of scenes/planets/stories to take a breath. And an\nunforgivable mistake: having taken it all far too seriously.<br><br>A positive remark just for the two actors Daisy Ridley and Adam Driver,\nvery well chosen, but unfortunately very badly utilized in the movie.<br><br>And a very strange phenomenon: all the excellent critics by almost\nevery magazine/newspaper, which really makes you thinking about their\nreal independence. Very surprised also by the overall IMDb rating.\n"},
{"review": "\nWe have to give JJ Abrams credit here for he has done something that no\nStar Wars fan expected... he made the prequels look good.<br><br>If there was one stand-out aspect of Star Wars that made it so great it\nwas its almost unparallelled imagination. Lucas created a hugely\ndetailed and original universe with an epic story line. The prequels,\nwhilst flawed in their over-use of mediocre CGI and themselves\nDisney'fied to a degree were still based on a deep, interesting and\nhighly original story line. Abrams utterly failed in this respect with\nThe Force Awakens.<br><br>It's hard to even know what TFA is even supposed to be. A complete and\npointless rehash of Episode IV with bits of V and VI thrown in. Zero\noriginality and by far and away the worst dialogue of any Star Wars\nfilm - absolutely cringe-worthy in places. Almost every scene or story\naspect of any note is plagiarised from the original trilogy and\nreproduced in a hugely inferior way.<br><br>We all took George Lucas for granted when we saw the prequels. We saw\nthe flaws and didn't appreciate the brilliant story beneath the\nsurface, the original characters, ships and locations. TFA stands in\nstark contrast to this GL's brilliance... a pointless, corporate,\nplagiarised piece of unimaginative rubbish.<br><br>** TFA is probably worth about 5 or 6 out of 10, but it gets a 1 to\nbalance out the corrupt IMDb rating system.\n"},
{"review": "\nUnoriginal plot, characters, planets, space fighters, weapons, script\n........ This movie makes the prequels look stunningly good. <br><br>You have already seen this movie before - in 1977! The original was\nenjoyable, this unfortunately is a predictable yawner. I actually fell\nasleep a various points because I knew that I wouldn't miss much.<br><br>It's tragic that this reboot has been wasted when both Rey and Finn\npull off relatively good performances even if we have seen their\ncharacters before.<br><br>This is targeted at youth under 20. A re-introduction to Star Wars that\nwill sadden and disappoint most die-hard fans.<br><br>If your over 20 years of age save your money and go see something else.<br><br>PS - Jurassic World suffers the same fate!\n"},
{"review": "\nOK, let's start by stating the obvious: JJ Abrahams sucks. He ruined\nthe Star Trek universe, he help script Armageddon (yikes)... He is one\nof the worst, mot generic Hollywood junk food pusher there is. George\nLucas might have turned insane at some point, but he was a TERRIFIC\nfilmmaker when he made Star Wars, and a true film scholar. The amount\nof creativity that went into making his original trilogy is perhaps\nstill unsurpassed in film history. <br><br>When Disney bought the franchise, people were concerned, the prequel\ntrilogy was unwatchable but would Disney simply turn in into a generic\nHollywood film series, diluting its magic and uniqueness.<br><br>Well, now we know, and the answer is a resounding YES.<br><br>They took a crap filmmaker and a bunch of unimaginative people and\nasked them \"How can we make this more like the old ones, the ones\npeople liked?\"<br><br>\"Huh... we... a... we need a droid being taken by scavengers on a\ndesert planet and... a Boba Fett like guy, and a snow planet and a\nforest planet and...\"<br><br>I mean seriously, the whole film feels like a complete remake of the\noriginal trilogy! Oh, with some really clichéd battle scenes or jokes\nhere and there...<br><br>The special effects are well made yes, but they were well made in\nGodzilla too, I mean who cares, that's not what this is supposed to be\nabout.<br><br>Watch the despecialized version of the old ones and forget about\neverything Star Wars that came after, including this one.\n"},
{"review": "\nWow, I've never ever written a review of a movie in my life and feel\ncompelled to write one at 2:14 am right after watching this sad excuse\nof a star wars film.<br><br>I've never been this disappointed, it was worse than the phantom\nmenace. I repeat it was worse than the phantom menace. There are no\nJedi's in this movie, no lightsaber duels worth watching, story is\nabsolutely moronic...<br><br>I'm sorry I just can't write anymore, i have to go to sleep and forget\nabout this. I'll tell you this much though, it was so bad that I swear\nI checked to see if I was having a nightmare or if it was really\nhappening, I did a \"dream test\" I would look at the exit sign and look\naway and then look back (in a dream written text changes if you look at\nit a 2nd time - I'm a lucid dreamer). Biggest letdown for the biggest\nstar wars fan. <br><br>George Lucas I miss you.\n"},
{"review": "\nLet me start by saying I have genuinely never felt more disappointed in\nmy entire life. When the opening summary rolled I felt like the writers\nwe're digging from the bottom of the barrel but I decided to go with\nit, it sounded new and unique. Oh how very very wrong I was. <br><br>The entire film is basically an alternate version of Episode IV. I had\nsuch hope for JJ. Looking back at interviews he states very clearly he\nwanted to go back to the style of the originals to make the fans happy.\nThis seemed to be synonymous with blatantly copying the plot of the\nfirst movie. <br><br>I could go through how utterly IDENTICAL the main plot line is but I\nsee someone has already done that. Instead I just wanted to let people\nknow how much of a let down this film is to anyone who knows the\nstories inside out. <br><br>As a stand alone this film is fantastic 8/10. As a Star Wars SEQUEL it\nis probably the worst thing I can imagine. I would genuinely prefer a\nfilm just about Jar Jar. The only thing that could repair it would be\nto scrap, apologise and start all over in 5 years. This sadly will\nnever happen as the ratings stand at 8.8 at the present. <br><br>My new and only optimistic expectation is that the sequels (VIII and\nIX) will take us on a new and original path. <br><br>Help me George Lucas, you're my only hope. Be genius like you once\nwere, step in and take back the reigns. I don't know who else could.\n(Ep 4,5,6 style) <br><br>Star Wars has now joined Marvel in the world of awful plot lines but\namazing fighting choreography and CGI to distract the weak minded. All\npart of Disney too. <br><br>Really, really, really upset by this film.\n"},
{"review": "\nThis movie was a huge disappointment for me.<br><br>--- warning spoilers ahead --- <br><br>First of all, this movie doesn't give a single clue about things\nhappened after Episode 6. It seems that J.J. has chosen to create a\nfresh new universe which has little connections with original SW\nuniverse. Who the heck are the \"Knights of Ren\" and the \"First Order\"?\nWhat happened to the Republic? Where are our beloved Coruscant and the\nJedi Temple? How dark Side could become so powerful in just 30 years?\nJust remember that in Ep. 6 Dark Side was totally defeated.<br><br>How an ex-Storm Trooper with a light saber could fight against a\nwanna-be Sith Lord? A girl with zero pilot training could fly\nMillennium Falcon even better than Han Solo? Huh? You really want us to\nbelieve this J.J.? Sorry but I don't buy all these.<br><br>Sith is gone and it has been replaced with a guy who obviously has a\nbig problem with anger management! I laughed at him each time he had\ntemper tantrums.<br><br>And again Rey with \"0\" training in Jedi arts could just defeat a \"Sith\nLord\" in a light saber duel? It was such a shallow movie which I can't\neven remind a couple of quotes! Sorry Lucas but your decision to sell\nSW to Disney was your worst move ever.\n"},
{"review": "\nThe Plot...<br><br>Lonely, abandoned kid, barely existing in some desert junk yard,\nAccidentally (destiny) becomes a key figure. Father/son struggling to\nrekindle after a betrayal. Must stop super planet weapon from\ndestroying peaceful planets by sneaking into the support site and\ntaking down the shields. don't forget to hit the achilles heel and fly\noff before it all goes boom.<br><br>Did the writers have any new ideas, other then overt political\ncorrectness?<br><br>Despite the warm and fuzzy cameos and some new faces, There was no\npolitical intrigue, genuine suspense nor interesting fight sequences.\nWe spend the whole movie waiting for the relationships to be confirmed\nwithout any interesting twists.\n"},
{"review": "\nI'm a huge sci-fi fan...star wars, star trek, anything sci-fi.<br><br>I really enjoyed the first 1/2 of the film. Good story, new characters,\nnew droid, new sabers and storm trooper weapons, paced and told very\nwell...all very interesting and cool.<br><br>But the second 1/2 was miserable. The story was completely predictable\nand was definitely a larger scaled telling of episode 4...another death\nstar OK it's really big, but destroyed the same way I was bored during\nthe attack. Leader Snoke was not interesting or intimidating in the\nleast. Kylo Ren shouldn't have removed his mask except for the exchange\nwith his father. He was very intimidating with the mask and voice, but\njust a kid without it and not scary. BTW he felt Dad's presence when he\nwasn't even on the death star, yet he couldn't detect him only few\nhundred feet away that seemed unrealistic. Rey's character was very\nwell done, except there's no way she should have even had the slightest\nchance of fighting Kylo Ren. I mean come on she just realized she had\nsome slight awareness of the force moments before, yet she defeats\nhim?? Let's get real...Luke spent weeks or possibly months of intensive\ntraining with Yoda, yet Vader kicked his ass. That whole scene was not\nplausible.<br><br>I liked the Han Solo death scene, very good. I had planned on seeing\nthis movie twice but I'll wait for episode 8, it was very disappointing\nugh..still a fan but very much let down with the story...\n"},
{"review": "\nThis movie flat out sucked. All the other honest reviews on here do a\ngreat job of explaining why this is nothing but tomfoolery. I'm happy\nthis movie sucked. I'm happy it killed Star Wars and I'll tell you why;\nbecause it means I don't have to waste another penny on any of the 90\nupcoming Star Wars trash Disney is going to pump out in the next few\ndecades. And for all you mindless sheep defending this lame duck, I\nhave news for you! You are not allowed to change your mind about this\nmovie! People you know will call you out for loving this film in a few\nyears from now and you will look like a complete idiot. Those pricks\nrunning Disney will not fool me again. Episode 8, 9, 10, 20, 50 and 70\ncan wait for television.\n"},
{"review": "\nActually, it was more like ending a universe. Abrams, clearly tried to\ndisenfranchise the core audience and ever so blatantly turn the movie\n(next set of movies) into a scifi hunger games while alienating the\noriginal theme of what makes the sage\\universe so unique. Rey\\Finn are\nclearly a rip off of katniss\\peeta. Not only was it poorly planned, but\nthe movie left no climax or build up to a climax what so ever. I think\nthe only thing you forgot was the berries. <br><br>As for the kill off for one of the sagas main characters, it was a\ndisappointment in how it was done. Abrams literally had a well known\nmoney making universe to work with and really put out an embarrassment\nof a movie.<br><br>The primary reason for the success of the movie is because of its\nsecrecy and its ability to have anything done with it. Then next will\nbe down hill, its a given. The other movies were prewritten prequels to\nthe movies everyone was sold on. There wasn't much that could be done\nwith that. Here, everyone looks like a hobo on a low budget film. Shame\non you Abrams, your an embarrassment to your to the profession and the\ngalaxy.<br><br>Great job buddy, you just made a movie that makes about as much sense\nas a Shaft reboot staring Tom Hanks.\n"},
{"review": "\nWhere does one even begin with this joke of a movie? This has to be the\nmost over-hyped and most disappointing movie of all time. The story is\nliterally copied and pasted from A New Hope, only with horrible plot\nand laughably bad dialogue. The visuals is the only thing I can say\ndidn't suck, besides Snoke looking like the orc villain from the Hobbit\nmovies. The amount of plot holes in this movie is absurd. People hated\non the prequels, but The Farce Awakens is exponentially worse.<br><br>I will not even consider this a Star Wars sequel. I see it more like a\nfan film, nothing more than the piece of junk this is. It is obvious\nmany of the high ratings here are illegitimate, this film does not\ndeserve a rating higher than a 6 from ANYONE. Thanks Jar Jar Abrams for\nwiping your butt with Star Wars!\n"},
{"review": "\nEasily the worst Star Wars movie in history! J.J. Abrams is a horrible\ndirector! I have no idea why Disney chose him as the person to ruin\nwhat could have been a great Star Wars movie. I went to the theater\nexpecting much more and I was actually excited to see the movie. After\nabout 20 minutes I begin to look at my watch. I just wanted to go home\nand get drunk. I was so depressed that I just spent 40 dollars on this\ngarbage. The PC police probably forced the director to include a woman\nand and African American as lead characters. Even an overly effeminate\nvillain also thanks to PC brigade. The movie was in no way a sequel it\nwas a rebooted mix of the previous 6 star wars movies. My 10 year old\njack Russel Terrier dog could have written a better script then the\nretarded writers that Disney hired. If you like wasting money go ahead\nand see this movie.\n"},
{"review": "\nI am speechless, what a let down!<br><br>This movie was a replica of the Episode IV, made in 2014/15. Or you can\nsay, it is a fusion of Star Wars + The Lord of the Rings + Star Trek +\nHunger Game, all in one. Weak acting, poor script, predictable plot,\nand so on. Hate the stupid cross light saber, big- head Gollum\nresembling evil master............. <br><br>I just felt like I had a bottle of cheap, terrible beer at an expensive\nbar and needed to rinse my mouth by watching the original Episode IV\nright after. <br><br>Looks like Disney made this movie just to lure young audience that\nnever watched the Episodes IV, V, and VI or born after 1985. They could\nhave done better with an animation version instead or should have hired\nPark Chan Woo to direct it. <br><br>This movie has no SOUL.\n"},
{"review": "\nNo more words to spend on it. Just watch it, you will understand by\nyourself... But since the review has to be at least 10 lines of text, I\nwill briefly express my disappointment... I am not the kind of Star\nWars fan that will tell you s**t about Ep. 1, 2 and 3, I am pretty open\nminded, and I found them quite good! But this movie... This movie is\njust so bad... From the Teenager Jonas Brother Darth Vader, to the\nannoying \"humour\", to the protagonist Jedi Girl that almost killed the\nbad guy swinging a Lightsaber without any training but already better\nthan Obi Wan (because we wanna make something new), to the Bigger Death\nStar (because good things never go old), to the pointless black guy in\na main role that almost killed the bad guy swinging a Lightsaber\nwithout any training but already better than Obi Wan (because here, at\nDisney, we are not racist), to the completely boring story, just a\ncomplete disaster! I could keep on listing the various things that made\nme feel robbed of time and money, including writing this review, but,\nluckily, the 10 lines of text have come to an end... May the Force be\nwith you after you finish watching this movie!\n"},
{"review": "\nIn a nutshell, if you want to know how this movie plays out, watch A\nNew Hope.<br><br>This is what corporate takeover does to a beloved and one of the most\ncreative movie franchise in history. It takes what has worked before -\nthe original trilogy (1977-1983), edit some bits and add contemporary\nflair to the film and voilà! Force Awakens is what you get.<br><br>If this movie had decided to work on something new with the younger\nSkywalker generation and not focus on a familiar rehash of the main\ncharacter found in a desert planet and the Death Star, the movie would\nhave been fresh and JJ Abrams would not have to hear the common\ncriticism about it.<br><br>What bothers me also about the movie apart from the lack of creativity\nin the film is that it fails to bridge the prequels and the originals\ntogether. Yes, the prequels are not great films, but it would be pure\nignorance to pretend that they have not happened, especially if these\nprequels are OFFICIALLY canon of the series. This film had so much\npotential, but it failed to deliver a refreshing and redeeming movie\nthat could have rectified some contents of the prequels rather than\nhardly mentioning their events at all. It is a continuation of the\noriginal trilogy AND the prequel trilogy.<br><br>In the end, I can only hope that the next two sequels would bring in\nnew adventures - things that have not been done before and that can\nultimately tie all that is Star Wars to a fitting and satisfying end.\n"},
{"review": "\nWow, has everybody been brainwashed or something? This is horribly bad,\nan absolute stinker of a Star Wars movie. I was expecting a new plot\nnot a greatest hits mash-up featuring variety show style cameos. The\nacting is absolutely diabolical, especially from Ford and Fisher who\ndial it in like never before for a last fat payday. Many of the worst\nscenes are written simply to get one of the old lines in like \"I got a\nbad feeling about this\". The film lifts all the audio and visual cues\nfrom the first movie and merely shifts the generation up a notch, Luke\nis set to become Yoda, Han is Obi Wan, there's even a giant, planet\ndestroying space station with a weak point to destroy. Anybody hoping\nthe Jar Jar factor has been eliminated is in for a rude awakening, that\nstupid BB8 robot dominates the whole film. The concept that the latest\nmerchandising craze should be a sphere with a sphere on top (ball +\nball = BB and the eight shape = 8) and the fact that they are selling\nthis tat hand over fist says more about the people buying it and this\nfilm than the people flogging it to them. Brainless, weak and lazy and\nbefore anybody asks what I expected from a Star Wars film then the\nanswer is I WAS expecting a new plot or why bother with all the\nsecrecy. This should be The Star Wars Christmas Special 2, it's on the\nsame level.\n"},
{"review": "\nSo just finished watching this and now I realize what a God Lucas truly\nis for the movies he made. Cos this JJ crap is utter trash. Zero\ncreativity, nothing new at all, just a rehash of the original 3 movies\nwith a useless predictable death for shock value.<br><br>Kylo Ren is the worst villain ever- he wears a mask for no reason at\nall. lol.<br><br>And the story is so fast and disjointed it was hard to make heads and\ntails of it. Why so fast? It should be called Episode VII- Fast &amp;\nFurious. Take time to flesh out the characters and let the settings and\nthe atmosphere set in with the audience. Hell no. Just get straight to\nthe rehashed set pieces and kick in the nostalgia and hope everyone\nforgets what crap they are watching.<br><br>And seriously Rey and Finn have never held a lightsaber in their hands\nbut a Sith trained Kylo Ren has a hard time fighting them off?? What\nthe hell? And he gets defeated and cut up by Rey at the end and falls\ndown and suddenly next shot they are like 30 feet apart allowing a\nlandslide to separate them and thus saving Ren. Who the hell made this\ncrap??<br><br>And come out of lightspeed inside the shields of the Death Star? LMAO.\nAnd yes another Death Star that taps into the power of its Sun?\nWouldn't that cause the star to go Supernova?<br><br>Also the 3D is hit and miss. Sometimes its great but other times it\nmakes the spaceships look like toy models.<br><br>And John Williams seems to have sleepwalked through this soundtrack\nnothing really stands out as new. :(<br><br>This movie is all about using nostalgia of the audience to make a buck.\nNothing more. Worst of all it left a bad aftertaste in my mouth which\nis the worst thing that can ever be said about a Star Wars movie. And I\nhave zero compulsion to watch it again. I remember when Attack of the\nClones was released I watched it 6 or 7 times. Even times I went to see\nSpiderMan I ended of watching Clones.<br><br>Star Wars is Dead. RIP my old friend.\n"},
{"review": "\nStar Wars movies used to be great. Remember that? Remember how they\ninspired a generation of loyal fans? Remember how they virtually saved\ncinema from terminal audience decline in the 70s? So scoot forward 40\nyears, and see the empty soulless rubbish lapped up by brainwashed\nPavlovian audiences and critics. How much did Disney pay the critics\nfor all those gushing reviews? Either that or the art of film criticism\nhas been lost.<br><br>Lucas may be $4 billion richer but I bet he wishes he hadn't sold the\nrights. Star Wars will now be forced down your throat, hyped beyond\nhype, new toys every month. The dollars will keep rolling in.<br><br>This movie is just a total rip off of the original trilogy; nothing\noriginal in it all. It sucks the joy out of this franchise. It revels\nin the stupid. A Death Star that can't go anywhere, A Death Star whose\nDeath Ray is faster than light (how else can it reach those systems in\nseconds?) Luke Skywalker. Hero for millions all over the world. Here he\nhas run away. People who can become master Jedi without training. Poe's\namazing reusable jacket - which he should still be wearing when Fin\npicks it up. A hundred other mistakes and holes. Yep. Thanks Abrahams.<br><br>Han Solo. One of the most beloved cinema icons of all. Written out\nbecause a bored actor wants another Indiana Jones Movie. Princess Leia.\nOr what passes for Princess Leia. Just sad. All the original cast are\nbasically guest stars in their own franchise, so we can have a younger\ngeneration take over and keep milking the cash for another 40 years.<br><br>Ah, yes, JJ. himself. Started out as a Spielberg hack, became a\nRoddenberry hack, now a Lucas hack. Yep, a third-rate hack all round.\nThis guy has ruined more franchises then anyone I can think of.<br><br>This is the future of modern cinema. And you're welcome to it. Remember\nwhen mainstream movies used to be good?\n"},
{"review": "\nThis is the first movie review I ever wrote but seen the insane 8.5\npeople gave this movie I had to do it. \"Sploilers Ahead\"<br><br>This is by far, far away the worst Star Wars film there is. This film\nit's a total and complete contradiction to the Star Wars rules and\nuniverse. As mentioned by many users the plot it's a cheap copy of\nEpIV, adding the Disney touch to the Star Wars Universe (stupid jokes\nall the time, political correctness, racial inclusion, etc). Kylo Ren\nis the worst villain there is, he lost a battle with an ex janitor and\na scavenger who has never used the force before, JJ Abrams know nothing\nabout the Star Wars universe, that's a NO, she can't learn the force in\n10 seconds by just closing her eyes, it doesn't work that way! The\nlightsabers know don't cut you, they just simple made a little burn,\nKylo Ren get's hit 4 times and he keeps on fighting (Obi Wan get a\nsimple touch of a lightsaber in his arm in EpII and gets disabled\nimmediately). And the casting except for Rey is really really\nterrible.....RIP Star Wars\n"},
{"review": "\nI was expecting something with more OOMPHH than Darth Vader times, the\nOriginal trilogy. But what i get after a long 2+hours is totally\nfrustration. It's just a reboot of A New Hope, and the best(worst) part\nis, this 2 totally new force user can almost instantly use their new\nfound power like someone who has been practicing for years. Wow! 1st\ntimer can mind control, 1st timer can swing the sword and defeat a\nDarth Vader wannabe? wow! COOL (yeah right, so NOT cool that is)<br><br>And the all new bad guy Darth Vader wannabe whose name I don't even\nfeel worthy of mentioning, is like a what? spoiled kid who just smashes\nup everything around when he can't get what he wants... gosh... and\nthis kind of character is a leader material? is a bad guy that people\nfear? *spit spit spit*<br><br>If this is your 1st time watching Star Wars, yeah, it's kinda\nenjoyable. but for old school, I think we have just wasted time and\nmoney to learn that this force awaken is just the same as A New Hope\n1977. Do the maths, after almost 40 years! from an era with lousy\ncomputer to an era where a computer is just the size of our palm and\nyet, I don't see any significant improvements in Star Wars.<br><br>My advice would be: just get a copy of the Originals Trilogy, stay home\nand watch them over and over and over again... You can't goes wrong\nwith this choice. Chances are, for episode 8 and 9, we will have the\nsame disappointment. They think they can control our mind but sorry~\nyour mind trick doesn't work...\n"},
{"review": "\nAs I finally got to see Star Wars last night I felt the soul of Star\nWars universe evaporating before my very eyes. The movie was cringe\nworthy. Yikes. How can it be getting such good reviews??? With the\nexception of the original casting (Harrison Ford...) the acting was\nterrible. The character Finn was annoying and incredibly awkward. Worse\nthen the addition of Jar Jar Binks. He ruined the movie. And just when\nI thought Disney managed to produce a cool sith lord Kylo Ren takes off\nhis mask and reveals he's some mix of side show bob and the Jonas\nbrothers goofy step child. And what about super size Gollum as the\n\"Supreme Leader\" of the dark side. <br><br>And Don't even get me started on the plot. All the writers at Disney\ndid was plagiarize George Lucas's plot from the first three films and\ntweak it a bit. Come on Hans Solo is Kylo's father, all they did was\nreverse George Lucas's epic revelation in Empire that Darth Vadar is\nLuke's father. This film has ruined star wars for me forever. <br><br>Only great thing about the film was the great acting of the Original\ncast. And then they go and kill off one of Star Wars best characters,\nHans Solo. Terrible film.\n"},
{"review": "\nI wouldn't have taken the time nor the effort to post a written review\nof this movie were it not for the suspiciously inflated IMDb score of\n8.5. Curious, I scrolled through the first 20 PAGES of reviews and\ncounted exactly 5 positive ones. The many negative reviews gave it one\nstar explicitly to balance out the ridiculous score it now has overall. <br><br>I will do the same and I urge everyone else who gave it 5 stars or less\nto amend your review and give it a one star rating instead. The IMDb\nbooks are cooked. I'm not a conspiratorial person by nature but with so\nmuch money at stake I have to believe that the House of Mouse might\nhave had something to do with it. <br><br>At any rate I would honestly rate it a 6 out of 10. But my sense of\nfair play bids me give it only one star.\n"},
{"review": "\nLast night I and my son went to see the new Star Wars movie \" The Force\nAwakens\" Having been a Star Wars fan since 1977 when I saw the first\none I expected the series to continue to be exciting along with a good\nstory. Throughout the series I had some praise and some boo's for the\nsaga. The first 3 movies were in my order Great, Good, OK then there\nwas a lapse which brought on the next 3 in order of rating Boring,\nSnoring and finally \"YEAGH\" they got it right.<br><br>Now we have the highly anticipated, and overly hyped Star Wars \"The\nForce Awakens\" and 'OVER HYPED\" it is. This movie first of all is just\nanother \"REMAKE\" I will say it again \"REMAKE\" OF THE 1977 \"A NEW HOPE\"\nwith the same storyline, related characters. It also features worst\nacting I ever seen. I never knew there were so many hard English\naccented people in space. This movie was like a collaboration between\nHarry Potter and the Hunger Games in space. Worst of all the villains\nweren't intimidating dressed in cheesy \"SCI-FI\" black uniforms probably\nleft over from a old \"Flash Gordon\" movie.<br><br>I really threw my hands up in the air when the whole point of the story\nother than the \"REMAKE\" part was the search for Luke Skywalker had ran\naway to hide and R2D2 was in a deep depression with a blanket over his\nhead.<br><br>What made the original movie from 1977 so great was the casting. You\nbelieved the characters and the actors who played them the heroes acted\nlike heroes and the villains were believable. This movie makes\neverybody look like a bunch of sissy's playing paint ball.<br><br>So I say it again ...Can the \"FORCE GET MY MONEY BACK\"?\n"},
{"review": "\nThat movie was made for only one purpose, sell, sell and sell. Massive\nlack of imagination. Just copied the Episode IV and changed the\ncharacters. Now all markets and shops are full of the new character.\nDisney and JJ seem more worried about merchandising that the movie\nitself. Now we have a introvert teenage with serious psychological\nproblems who kill his father (looks like they found out the character\non a newspaper chronicle) as Darth Vader. A girl who live on a dessert\nand find a robot with a hidden message, wow, what an explosion of\nimagination. The only new thing is that now everybody can understand\nthe droid's language, so i can imagine it won't be a new C3PO. The Nazi\nway of the stormtroopers speech, the gangs chasing Solo, the\nstorm-trooper using light-saber as a great Jedi. Everything pretty\ncheap and nonsense. Even star war video games have better script.<br><br>Story: 0 points. Suspense: 0 points. loyalty to the saga: 1 points.\nMarketing: 10 points. Profits: 10 points.\n"},
{"review": "\nWorst Star Wars movie.<br><br>After so many years the engineers still failed learning the importance\nof a backup system?<br><br>Both sides are using rusty fighters built several decades before?<br><br>The Force has become so cheap and Rey could beat Ben in no seconds?<br><br>If so why she is looking for Luke? The old Jedis were so dumb they need\nmore than 10 years of training to play a mind trick or handle a light\nsabre!<br><br>YOU KILLED CAPTAIN HAN SOLO?<br><br>Every character is so shallow that I didn't feel anything. I personally\nfelt worse and worse as it came to an end.\n"},
{"review": "\nThis is my first review, and I'm only writing this to say \"stay away\nfrom this crap\". A lot of people are convinced now that the prequels\nwere better than this awful reboot/remake and God are they right. Why\non earth, just to make money, you have to re-do entirely \"Star Wars -\nepisode IV - a new hope\", and filling it with emo-teenagers a-la\n\"hunger Games\"/\"Twillight Saga\" with stupid dialogs (\"... do you have a\nboyfriend\"? oh please..), total disrespect of the FORCE and use of the\nold characters just to cash-in with nostalgia effect? At least, those\nfirst three episodes, despite being extremely full of flaws, were also\nfull of devotion for each and every character and their back stories,\nand Lucas wasted a lot of time (our time maybe), explaining everything\nwe had to know throughout the whole franchise. I'm not going to spend\nwords on the spin near the end because by now everyone knows the fate\nof one of the most lovable heroes in the history of blockbusters. Watch\nthat scene and just feel bad like you should. I mean we're talking\nabout the guy \"who shot first\"! Why the fk you have to transform him\n(and the rest of the old school) like a mono- dimensional figure, no\nevolution whatsoever... I mean... 30 years later and they're still\nplaying the same character (the smuggler, the female general, the furry\nloyal friend ecc...) like ghosts or shells, like plastic figures for\nchildren. Shame on you J.J.Abrams and shame on Disney too.\n"},
{"review": "\nThe film starts off with Max Von Sydow dying after 1 minute of screen\ntime (he was probably paid 7 digits to appear).<br><br>Then, I watched A New Hope for the second time this year. Though\nstrangely, Luke had become a girl.<br><br>It's the same as Episode IV. Han's Death was not very interesting, Kylo\nRen is the worst villain I've ever seen. They rebuild the Death Star\nfor the third time in forty years, not pausing to wonder what they\ncould change so it doesn't get blown up again. But this time they make\nit ten times bigger in ten times less time.<br><br>Han and Leia's split up feels forced. If your son goes rogue, you don't\nleave your wife forever to go smuggle in space. Han is King of\nAlderaan, he shouldn't go back to smuggling.<br><br>Rey learns what takes Luke six years in ten seconds. Literally. After\nlearning how to force trick... without knowing the force exists for\nsure, and never seeing it before, she manages to convince James Bond\nthe Stormtrooper to untie her (after three tries, where Daniel Craig\ngives a static and boring delivery of his lines).<br><br>Rey and Finn are boring characters, and appallingly written. Finn makes\ntypical \"black stereotype\" jokes that made me cringe and give me the\nfeeling the writer is racist.<br><br>Kylo Ren gets beaten by a teenage girl and a binman. That binman\nconveniently knows how to destroy a machine so big that it's about ten\ntimes the size of the second death star, which is slightly smaller than\nour Earth. It has it's own ecosystem! Awful film, boycott the next\nones.\n"},
{"review": "\nI'm going extra hard on this Movie. Just after watching it I'm extra\nconfused, I wish I could go through scenes and see if it's as bad as I\nfeel.<br><br>I don't see what you guys are talking about when you say it's great, I\ndid feel it had good parts. But overall it makes no sense. Kylo Ren is\na Crying bitch and acts like a spoiled brat, he doesn't even look like\nHan or Leia and yet he's supposed to be their son.<br><br>They killed Han Solo in the most random pointless way imaginable. I\njust don't get how any star wars fan could forgive this? Seriously our\nnew darth vader is so pathetic he can't even handle two brats that\nnever even held a lightsaber? Do I say that it has no good Points? No,\nit's more well written then the prequels but it doesn't feel like Star\nWars. It feels like a star wars fan film with a massive budget and the\noriginal actors in it.<br><br>They said Kylo Ren were supposed to have ended Luke Skywalkers new jedi\norder but can't handle two kids that never even held a saber? Was\nLuke's jedi order full of pussies? It makes no sense at all...<br><br>And who the hell is snuke? Why should we care for him? Why do you guys\nfeel this Movie is so great, I'm simply not feeling it. This Movie was\nNOT Worth ruining the ending in Return of the Jedi in order to make.\n"},
{"review": "\nThis is my first review of a movie and I just had to put it out there.\nGuidelines on this site require that I put 10 lines of text in this\nreview but to be honest I am not really sure this movie deserves that\nmuch. I do not know how critics came up with such high marks for this\nmovie but scenario and characters felt like something that has no\nconnection with the ideas established in the Star Wars universe from\noriginal trilogy. <br><br>As for the content of the movie, I think that Han Solo actually killed\nhimself in the end while thinking: <br><br>\"Thank God this is over!\". <br><br>If he didn't, who knows what would they make him to in the next movie.\nSell lollipops perhaps?<br><br>At least my $12 popcorn bag was good until it lasted.<br><br>That is all I have to say.\n"},
{"review": "\nwith virtually no imagination this is a terrible re-write of Episode IV\nbut with rewriting the basic rules of star wars into meaningless drivel<br><br>Now it seems that light sabers come with a on-off switch andante\ntwo-bit can easily operate one with no training whatsoever. And light\nsabers only have the \"power\" if the bad guy (whose light saber looks\nlike a flame) wields it but if the \"Jedi\" wield it you can battle them\nwith nothing more than a baton and beat them as the Jedi weapon cannot\naffect anything non-organic an even when hit full in the face all you\nget is a little scar - big whoop.<br><br>Now apparently you can build a death start that can simultaneously\ndestroy five planets but even then the 'force' doesn't register a\ndisturbance and billions of lives are winked out - what?? And the **!$#\nwho came up with the worst plot twist ever - kill Hans Solo - what the\nhell?!?<br><br>Graphics and sound effects are really nice but storyline is BORING.\nSave you money do not pay for this\n"},
{"review": "\n**SPOILERS**<br><br>Basically a remake of A New Hope with shocking character kill off and\npoor ending!!!<br><br>Way to p*ss off the fans!<br><br>The main plot is basically the same as ANH, Empire wants info, info\nplaced inside droid and cast into space. Meanwhile another Death Star,\nrenamed Star Killer base has yet another convenient weakness easily\nexploited by the good guys in the end!<br><br>Another stupid plot point about Star \"Death Star\" Killer base is that\nthe shields are impenetrable .... Unless you conveniently fly through\nthem at LIGHT SPEED?!!! AND rather than send a fleet of fighters to do\nthis they send the Falcon, alone! OMG! Given the relative ease of which\nthe Falcon did this i assume a fleet of state of the art X-Wings could\nof done this more efficiently and completed the mission more\nefficiently. <br><br>Finn's disassociation of the First Order was rushed and felt thrown\ntogether, there was no real character development here, no real inner\nturmoil seen or any emotion of conflict .. Was as simple as 'I have\nseen enough (Even though it is my first battle despite being in the\nOrder since childhood) so i'm off to runaway/join the alliance'.\nRubbish. <br><br>Luke has disappeared because he tried to train Han and Leias son and he\nwent bad instead ... Would Luke cry off?! I think not!<br><br>Han Solo KILLED!!!!!!!! NOOOOOOOOOOOO!!!! WTF!!! And next to no\nmourning period, everybody moves on so quickly, barely noted despite\nthe huge huge character Han was!<br><br>R2D2 unable to power up due to Lukes absence but some how powers on\nnear the end in order to advance the plot and help display Lukes\nwhereabouts!!Typical Deus ex machina!!!<br><br>Luke Skywalker has 30 seconds of screen time at the end of the movie!!!<br><br>The ONLY good thing in this thrown together pile of poop is that the\ndog fights and flight sequences are amazing, that is it people. Good\nCGI only!<br><br>Awful. Disappointing. Underwhelming. A slap in the face.\n"},
{"review": "\nIf this were written by a ten year old for other ten year old children\nit would be acceptable (perhaps) but it has no believable characters,no\ncharacter development, no back story for the last 30 years and a rehash\nof tropes from episode 4. I can only assume that it has gathered any\npositive reviews due to black hat Search Engine Optimisation and\noutright bribery. The best acting was from the robots. The music was\nmostly bland and forgettable (nothing even came close to Duel of the\nFates or Battle of the Heroes), most of the scenes were soulless rip\noffs from the Original Trilogy and the new protagonists were equally\nvapid. And let's not leave out Kylo \"Scotty Evil\" Ren, a character who\nencapsulates the film in a nutshell-a weaker copy of something much\nbetter. Would Darth Vader have been as Iconic as he is if he had thrown\na tantrum when he couldn't find the Death Star plans? Disney could have\nso easily used stories from the Expanded Universe like Dark Empire or\nThe Thrawn Trilogy-instead, they opted for a lame attempt to free ride\nGeorge Lucas' ideas and 'Disneyfy' them with flawless, 2D characters.<br><br>Please bring back Jar Jar! He was a much better character than any of\nthe ones Disney added!\n"},
{"review": "\nAs was summarized in other reviews, Force Awakens is very derivative of\na New Hope. JJ Abrams tries to summon the nostalgia factor and he\nsucceeded. Unfortunately if you compare, all the characters were ghosts\nof the originals.<br><br>Darth Vader&gt; Kylo Ren. Kylo Ren lost a light saber fight against a Finn\nthe Janitor and Rey the complete novice. He throws tantrums like a\nteenager. He kills his own father in a totally cowardly way. Was Han\nSolo a terrible parent to raise such a loser? Darth Vader never loses\nhis cool and kills Obi Wan in revenge.<br><br>Young Luke&gt;Old Luke Young Luke defeated and redeemed his father by his\nlove and compassion. Old Luke despaired enough to camp on an island and\nwatch the galaxy burn. Young Luke risked it all to fight Vader to save\nhis friends on Cloud City. Old Luke didn't give a &amp;*^34^!, and camped\non an island and watched the galaxy burn.<br><br>Young Luke&gt;Rey Luke Skywalker in the Original trilogy had flaws. He was\nuntrained, impulsive, naive, and fought Darth Vader and lost his hand.\nHe struggled and grew, and eventually became the hero. Rey was perfect\nfrom the beginning, and defeated Kylo Ren with zero training. She had\nno struggle. The story had no drama.<br><br>Rey already beat Kylo Ren, the Second Strongest Dark Side User in the\nGalaxy TM without breaking a sweat. I'm sure she can go the the First\nOrder HQ and destroy Snoke(that is a terrible name) after fighting\nthrough all the storm troopers. The next movie will be 10 minutes long.<br><br>I'm tired, I think I will go to sleep.\n"},
{"review": "\nBefore I saw the movie, I'd already read some bad reviews. I'm a huge\nSW fan so I decided to go see it. I couldn't believe how poorly made\nthis film was. Acting was mediocre to say the least with the exception\nof the droids and Chewbacca. The old cast trio acted very little in the\nfilm, especially Mark Hamil who appears only a couple of minutes. The\nlight saber fighting scenes were poor and uninspired. I don't want to\ngo into EU, non-canon issues as that's a personal opinion. For me it\nwas a bad mistake not to follow the EU with all the epic material out\nthere. I mean there is material right there, served on a golden\nplatter. The villains were weak as it's usually the case with Disney's\nmovies, all talk but no backbone. To have the main villain, the leader\nof the \"First Order\", be defeated by a girl who never touched a light\nsaber before in her life... that spells disaster in my books. Where is\nthe ominous presence of Darth Vader, Count Dooku, Darth Sidious, Obi\nWan etc.? Where is the epic atmosphere of the previous films? What of\nthis \"Supreme Leader Snoke\"? He looks like Gollum! Where on the galaxy\ndid they find Luke's/Anakin's light saber and stored it in a chest in a\nbasement?? That light saber was cut off Luke's hand and dropped in the\nchasm of Bespin's bottom (probably down in the ocean) in episode V. How\ndid Kylo Ren find Darth Vader's mask? That was burned on the moon of\nEndor some 30 years ago. Finally the story. Ah the story, it seemed to\nme I was watching a remake of Episode IV... come on! Another bigger,\nbadder Death \"Planet\"... No background, no nothing. I really do hope,\nGeorge Lucas buys back the franchise, disavows this film, and makes a\nproper one.<br><br>I give it a 2/10 grade, 1 for the SW logo and 1 for the past films. No\nmore.\n"},
{"review": "\nBesides quite a few plot holes. <br><br>Besides some pretty corny stuff (like jump out of speed of light behind\nthe shields, manually, I might add). <br><br>Besides bad character development (Rey the self taught Jedi, learning\nnew Jedi skills whenever she needs them, or \"new Vader\", Kylo Ren\nlosing powers instead, and gets his ass whooped by Rey. And Finn, the\nformer storm trooper, turned out to be somewhat of a comedian, they\nshould have toned down Finn's humor a notch I think. Kylo Ren goes from\nbadass to immature sissy. Like a damn kid with temper tantrums.\nliterally! And let's not forget the \"silvery storm trooper\"... or..\nlet's do just that, forget her, also a total sissy.<br><br>Anyway,besides that. The real downer is that this movie is just a\nreboot/re-hash/remake. There's a new death star, a orange yoda, new\nLuke, new Vader, new Emperor, new father-son story, the rebels,\nrecycled lines and settings, the...<br><br>Buuu Disney.<br><br>They went for the money, too scared to try something new. I am\nsurprised so few critics have anything negative to say.<br><br>EDIT: Oh, and I have to add, is it just me, or did the new emperor\n(what's his name, Snake? Snoke? Snook?) look just like Gollum? Either\nway I think he was quite poorly made.\n"},
{"review": "\n* contains spoilers * <br><br>In keeping with my expectations JJ Abrams thoroughly disappointed -\nwhich for me is a pyrrhic victory given I really wanted to enjoy this\nmovie. <br><br>First, the story..... if you've seen the first Star Wars, imagine a\nbigger more powerful Death Star and change the leads. I can almost hear\nYoda going \"Sh*t that was Star Trek, you would not protest, so kick in\nthe balls, for Star Wars you will get\".<br><br>Kylo and Han's family reunion moment on the bridge was an Oscar moment,\nit was a duel of epic proportions because both parties are congenitally\nincapable of ACTING - it was a real nail biter watching which of the\ntwo would be worse. In the end .....i think it was a tie. I thought\nKylo was worse (and consequently won) till I saw Hans expression when\nthe saber went through him. Tie it is.<br><br>Rey is as clumsy with a light saber as her (i expect it to be revealed\nin the future) dad Luke was in the first 3 - she seems like she'd\nstruggle to use a broom effectively much less a saber. But she's\ndefinitely Luke's daughter given this obvious genetic clue.<br><br>Oh yes, and while Kylo's entry is almost inspired (he stops a blast\nfrom a ray gun cold in mid air) he quickly devolves into a whiny\npetulant adolescent throwing tantrums all over the place ultimately\ngetting is bum kicked by a girl with no prior (as far as we can see)\nForce training. Like, what the...?!! <br><br>Can someone please deprive JJ of his directorial licence, he's done\nenough. Sure this movie is already an unqualified blockbuster - which\nwe all knew it would be even before it was made. My point is that its\nsuccess has little to do with how good (or bad) it is but nostalgia and\nfanboys and fangirls.\n"},
{"review": "\nFor those of us who are Star Wars fans but still burdened with a\nfunctioning brain, I expect you will find this latest installment\nincredibly lacking. It is a given that any true fan will see this film;\nhowever, when contemplating ownership and how many times can I watch\nthis very flawed movie, I am certain the answer for myself is\nabsolutely not and perhaps only a few times more from the blessings of\nvideo rentals. I have two major problems with the movie. Stop hear if\nyou wish to avoid spoilers. First, from the moment the latest planet\nkilling monstrosity appears, you know it will be destroyed in some\nimplausible fashion. Any time a story devolves into placid\npredictability, the story begins to hemorrhage. There are also too many\nsignificant plot points that are equally not very surprising, The most\nsignificant being the monstrously telegraphed confrontation between\nSolo and his anti-prodigal son, Jacen. When Solo begins approaching\nhim, I suppressed eye rolling with my supreme force of will and\nthought, \"He's dead.\" The scene lost all gravity in what should have\nbeen a seminal moment. The resulting cry from Chewbacca was obligatory\nand was far less compelling than his anguish on Hoth during the\nundisputed champion of all these films, Empire. Contrast this death\nwith that of Captain Pike during Into Darkness, which was a\nmasterpiece, and the death of Solo, whom I had far more emotional\nattachment to having been a fan since early childhood, feels utterly\nlacking. The second catastrophic flaw was the final duel. I grant that\nKylo Ren was in conflict, but it didn't stay his hand from killing his\nown father moments earlier. If it was meant to be conveyed that Kylo\nwas somehow sparing Finn and Rey, it was the worst lack of\ncommunication from a director to his audience that I have ever\nwitnessed. If they were truly fighting, Finn should have died from\nforce strangulation or from a beheading as Kylo rent Rey to pieces.\n"},
{"review": "\nAnother Disney movie infested with mistimed jokes (had an Avengers\n2feel to it)... Though, I'll admit, I did laugh. It was an enjoyable\nfilm if you just look at the comedic value and the nostalgia it offers.\nLet's get to the gist here now, the movie lacked consistency,\nseriousness, intensity, emotion, and originality. Pilot's friend dies\nand he busts out a joke after getting captured. Death of the best\ncharacter in this episode was brushed off like it was nothing. Plot was\nessentially the 3 original films clumped into 1. Music was 0/10\ncompared to the other 6 films. Main characters were able to defeat the\nvillain with 0 light saber and force training. \"That is not how the\nForce works!\" Well, Disney made it seem like that wasn't the case.\nFinally, we get the same prequel villain we've bashed for years, yet\nsomehow and some way people LOVE this guy! Temper tantrums, no\nintimidation, and he looks like a mix of Nicolas Cage and Severus\nSnape. Honestly, the positive reviews are simply because the movie\nkisses the asses of blinded Star Wars fans.\n"},
{"review": "\nJ.J. Abrams if this is your fault, you will burn in ****! How could\nyou!?! Take this from a grown up guy who has grown up with Star Wars,\nwho has seen the original movies I guess 30-40 times, how has lived the\nlegend, who has unpacked Christmas presents loaded with Star Wars\nartifacts, who has been running through the woods as Luke and Solo more\ntimes then I can remember, who has cherished the amazing universe which\nis Star Wars, who can recite most if not all of the spine-chilling\ndialoges from the old movies... Oh forget it... HOW COULD YOU! NO!!!\nJUST...NO! This is not Game of ****** Thrones!!! You do NOT have to\nprove anything! Shock and denial... The Falcon is empty... Childhood\nruined... World is empty...\n"},
{"review": "\nWhat else can I say, FabledGentleman said it best and there is nothing\nelse to add. This movie was the biggest letdown and I am sad that I\nspent money to be disappointed. The story was terrible with little to\nno thought devoted to the script. The story line was the same old\nstory, revived from episode 4. No indication as to what happened over\nthe last 30 years. No background info on the characters or who they\nare. The whole movie seemed to be rushed to the big screen for the sole\npurpose of making money. I'm sorry, but this is the Star Wars story, it\ndeserves to be one of the best story lines brought to the big screen.\nAnyone who is connected to this story, needs to bring they \"A\" game. I\nreally hope the next attempt, encompasses all the Star Wars has become.\n"},
{"review": "\nNo vision, no villain, no acting, no script, no imagination, no 'Star\nWars' wisdom, no music. In a word - NO-Movie. There are movies that you\nwatch and you forget about them on the next day. This is not the case.\nThis movie you forget in the next hour and you never want to remember\nabout it. And what is even worse I don't think that they can turn the\ngame in the sequels with this casting. The only good things in the\nmovie were BB-8 and that it finished. If they rename it to \"Teenage\nStar Wars\" than it could make scene. And let someone that really cares\nto make the Start Wars move that each generation deserve. Never, ever\nhave seen such a misleading rating.\n"},
{"review": "\nWhat is going on with the 8.5 score on IMDb!!! Have people lost their\nminds! JJ Abrams has ruined the Star Wars franchise. This was a\nterrible remake of a new hope, there was no original ideas and all very\npredictable.. A droid keeping a secret yawn! Let's destroy the death\nstar again yawn! There was no character development, everything felt\nrushed, Poe and Rye became best buddies with Finn instantly. There were\nstupid jokes across the film which I'm sure Disney came up with to\nappeal to kids who love the Avengers. The main character Rye magically\ndiscovers she has the power of the force and then has a full on battle\nwith Ren and defeats him! Com'on Abrams, isn't this guy suppose to be\nthe next Vader? So why did he come across as a complete wimp! Even Finn\ngave him a run for his money! please!!! I will never watch another Star\nWars movie in the cinema again. Abrams you have sold out to Disney and\ndestroyed the franchise. This was an opportunity for you to take Star\nWars into a new direction but instead you ripped off episode IV and\nruined it! Bring back George Lucus, at least he came out with some\noriginal ideas, they may not have all worked out but at least he had\nthe guts to try something new!\n"},
{"review": "\nVery difficult to live up to the original trilogy but this was just a\nbad movie. Big explosions lots of CGI and not much else. The plot and\nscript seemed to be just thrown to together with little thought. Very\nsilly and makes little sense with many comical parts which are so silly\nit's funny for all the wrong reasons. JJ Abrams pulls out many tired\nold action movie clichés. Bad corny cheesy dialogue, bad jokes,\nmediocre acting, superficial characters, well I guess this is Hollywood\ntoday. Hate to say it but when the dust and hype settle another Phantom\nMenace. Michael Bay could not have thrown together a more idiotic silly\nincoherent plot and script, which has gaping holes and making any sense\nis not much of a consideration at all. This was like the PG rated\nDisney TV version.\n"},
{"review": "\nIt was a train wreck. Do you people out there really want to see the\nsame plot over and over? The Jedi are MIA. The Galaxy is ruled by an\nevil empire. They have a huge space station that can destroy planets.\nDroid with important info gets lost and is found by the heroes. Space\nstation is attacked and destroyed by the rebels. Sound familiar? The\ndialog was boring and predictable and I didn't care about the\ncharacters. If this movie had been made in 1977 instead of the first\nmovie it would have been a total dud. The only surprise was when they\nkilled off Han Solo, the one character I liked. Star Wars is dead,\nPLEASE let it rest in peace! I will never go to another movie with J.J.\nAbrams name on it.\n"},
{"review": "\nFool me once, shame on you Ep 1-3. Fool me twice, shame on me for\ngetting sucked into the Ep VII hype.<br><br>After spending countless hours reading plot predictions, learning about\nthe new characters, and of course viewing the trailers hundreds of\ntimes, I feel like I got defrauded. The problem is, it's unclear who's\nthe fraudster. Most of the wrath has been directed at JJ Abrams. I'm\nnot so sure. In several interviews he said he spent countless hours\nwith writer Lawrence Kasdan meandering the streets of New York, London,\nand Paris. It's unlikely that their collective inspiration would be\ntantamount to Ep IV rechauffee with bits of V and VI mixed in.<br><br>No, they're better than that. A LOT better. Rather, the Disney bigwigs\nhijacked the script and dumbed it down by several orders of magnitude.\nAnd what we're left with is this incredibly banal, vapid, and flimsy\ncrapper of a film.<br><br>Every stolen element and plot line has already been addressed. No need\nto rehash. <br><br>Just to give you a sense how much I hated this movie...had special imax\n3d tickets prepaid for Dec 23. However, due to the insane hype, had to\nsee it sooner. So I saw it in 3d on Dec 20. Did not go to the Dec 23\nshow, even though the tickets cost $20. Yeah, it was so bad I felt I'd\nbe better off forfeiting the $20 than enduring this movie for the\nsecond time. There is not one scene, not one memorable line, moment, or\ncharacter worth seeing again. <br><br>I will not get sucked into the hype for Ep 8.<br><br>Thank goodness for all the reviews here<br><br>If anything, a chance to commiserate.\n"},
{"review": "\nI give it a 4 maybe. I guess it was OK. But it was kind of like a\nremake of a new hope, but with boring heroes and a stupid whiney\nvillain. The plot was okay, but like I said before it's exactly the\nsame. There's a person on a desert planet, only a girl this time. The\nonly differences that are between Tatooine and Jaku are their name and\nthe fact that Tatooine has two suns and Jaku has only one. There's a\ndroid (that this time around is extremely annoying) that holds valuable\ninformation. There's one leader that commands people around and wants\nto rule the galaxy. In the old movies, it was a terrifyingly great\nmixture of the voice, the makeup, and the feel of mystery in the scene.\nThis time, however, we get this huge ugly CGI thing called \"Snoke.\"\nReally? The Emperor sounds evil, mysterious. Snoke sounds like a\nmixture of snake and nose. They also have to blow up this one thing\nthat is really easy to blow up. Apart from the parts that were exactly\nthe same, the rest of the movie just ticked me off. The took the theory\nthat you need years of Jedi training, ate it, pooped it out, and\nflushed it down the toilet. Also, the plot twist of Han Solo's death?\nI'mm going to be like Disney. Plot twist! I give it a 1. Overall I\ndon't recommend this movie for anyone who likes Star Wars. But hey, a\nlot of people liked this movie. But a lot of people haven't even seen\nthe original trilogy! That is crazy. That is sad. Sorry for any Star\nWars fans that watched this movie. Honestly I'd rather watch the\nPhantom Menace. At least it was better than the holiday special. Not by\nmuch, though.\n"},
{"review": "\nPositive: Daisy Ridley if fun to watch.<br><br>Negative: Daisy Ridley doesn't get enough screen time. She should have\nspent some time training, even via Luke-run holograms on the Falcon, or\nsomething! How Rey can do things that Anakin and Luke had to train hard\nat, just by closing her eyes and focusing for a few seconds really\nbreaks story continuity.<br><br>I'm amazed by the rave reviews. The Force Awakens is currently enjoying\na high rating at IMDb, which puts it on par with The Empire Strikes\nBack. TFA is frozen in carbonite next to TESB!!! I thought the movie\nwas blah. A few people clapped at the end which was an improvement over\nEp3 where folks were laughing uncontrollably at the Emperor's poor\nacting during the movie. This is nowhere near the enthusiasm I\nexperienced at a Jackie Chan movie.<br><br>J.J.Abrams really drops the ball directing, and I like the new Star\nTrek despite the hyper-attempts at political correctness (ask yourself,\nwhen engage in political correctness if you;re not a politician running\nfor office? Hmmm....).<br><br>That last scene between Luke and Rey was goofy and full of pregnant\npause and leaves you kind of empty. I expect more creativity from a\nfilm that recycled so much else.<br><br>A New Hope Reboot is not what I expected as it feels like Spiderman or\ntake-your-pick reboot franchise instead of a grand new story. This\neffort leaves me as I was before, ignoring all but the three original\nfilms because there is nothing compelling or really satisfying here.\nSigh........\n"},
{"review": "\n** Warning don't read this review if you haven't seen the movie. I\ndon't plan on spoiling anything but to be safe. ** This film is one\nreason why plagiarism is a bad idea.<br><br>Other's are not haters when they say the storyline is heavily lifted\nfrom star wars IV.<br><br>A huge disappointment. This was my least favorite of the series.<br><br>I blame whoever wrote and followed the screenplay. It was bad.<br><br>Whatever one thinks of I-III, at least they were original; new story\nlines, new weapons, species. The villains were complex, credible and\nweighty; palpatine, count dooku. Palpatine played 3-4 sides against\neach other. OK so hayden was annoying and not credible at times.<br><br>Sure Disney is happy that they will make billions off of this, having\nsold water to a thirsty man in the desert.<br><br>Too bad they did not come up with an original storyline. Looks like\nthey took the least risk possible in the storyline and the fans lost.<br><br>Maybe Disney/director should have looked at the criteria users here are\nsupposed to follow for their reviews \"Your submission must be your own\noriginal work.\".\n"},
{"review": "\nSigned up here today just to make my feelings known and to warn others\nwho love the Star Wars universe of my experience with this truly\nterrible piece of story telling.<br><br>I have thought for days about why The Force Awakens left me feeling\nunmoved and numb at it's conclusion. I have finally worked it out. JJ\nAbrams has killed the franchise for me, and many others.<br><br>The plot and the lead character simultaneously 'jumps the shark' within\nthe first 20 minutes, my brain was screaming what the f**k, are you\ntaking the pi*s. From this point on all I saw on screen were actors\ngoing through the motions, none of it seemed believable, nothing moved\nme, even events that should have saddened me to my core. Maybe I could\nforgive one such event but the movie is littered with them. I suspect\npeople who parked their brains at the cinema door didn't notice but\nanyone who's seen the original trilogy will react initially with\ndisbelief and then anger.<br><br>The only thing that will get me to watch episode 8 is if I find out\nthat in the yellow scrolling message at its start that Luke had gone\npsychotic and when Rey hands him his light-saber, he neatly cleaves her\nin two with it. Then the story could begin again with something more\noriginal and hopefully credible. I suspect this will not be the case,\nso Star Wars in my eyes is dead and the numbness I felt was actually\ngrief for the death of a friend I've known and loved for 38 years.\n"},
{"review": "\nStar Wars, the affirmative action is a garbage movie. You have a young\nuntrained 90lbs weaking woman beating a man. (JJ Abrams is Jewish so\nthe bad guy's lightsaber looks like a cross). Big surprise that this\nmovie is full of left wing propaganda. White woman, black guy heroes.\nWhite man is the great evil.<br><br>People writing good reviews are lying, which is why I trust meta critic\nWAY MORE than IMDb on ratings.<br><br>They rehashed the death star, for the 3rd time, like they literally\nhave no creativity other than the gender and racial obsession of left\nwing people. Desert planet rehash, forest planet, ice planet- rehash\nrehash rehash.<br><br>The young 90lbs weakling with no training also knows how to fix Han\nSolo's ship- the ship he's been flying for 40 years- because women are\njust superior than men. Fu feminism. Black guy with no force abilities\nuses lightsaber, because affirmative action. Convenient that Jewish\npeople are not demonized constantly by the media and in movies. You\ncannot escape it, like Django Unchained- \"I get paid to kill white\npeople, how could this job get any better\".\n"},
{"review": "\nThis is my first public review in 8 years with IMDb and there is a\nreason for this.<br><br>There are enough comments around how bad the movie is. Specifically :<br><br>Bad / uninspiring sound track, poor / unrealistic story line where the\npowerful Empire is made to look stupid, boring visual effects and\ncostumes in the shadow of making them look 'original', casting and\nacting are surprisingly amateur too.<br><br>I went in very optimistically and really tried to like it. I was hoping\nthat even if its o.k , I can throw my fist in the air and tell me\nfriends 'Star Wars is back'. Sadly I wish I did not see this film at\nall.<br><br>I just do not understand the misleading IMDb ratings. Either 'Star\nWars' has an unbelievable fan base or something even weirder is\nhappening ! Beware.\n"},
{"review": "\nI make it three fourths of the way through this film and cast away all\ndoubts I had about it then they do something I'll never forgive,they\nkill Han Solo,best gunslinger and pilot in the galaxy. Han Solo has\nbeen my favorite character since I first watched the original Star Wars\ntrilogy as a kid,I even had a toy of his blaster. I was hoping this\nwould have been a better movie than the prequels,I'll admit I went in\nthinking it would be just as bad as the prequels,but I found myself\nchanging my mind while watching it,that is until they took a wrong turn\nand Ren kill Han Solo. I never thought that would ever happen seeing as\nhow Han Solo was just as much of a main character as Luke or Leia,but I\nshould have known better I should have known that Disney would find\nsome way to ruin Star Wars. They killed Star Wars for me,I will not buy\ntickets for the next Star Wars movies and I won't buy anymore Star Wars\nmerchandise.\n"},
{"review": "\nWell JJ has yet again made of mockery of a great franchise. It's like\nthey've spliced pieces of the OT and chucked it in a food processor.\nKylo Ren is the most pathetic Sith Lord ever (and you thought dooku was\nbad) he comes across as a petulant child with a big stick and kills his\ndad (Harrison ford finally getting his wish to kill off Han since he\nfirst played him) the main cast were good (besides Mark Hamill's 2 min\nnon speaking role right at the end in which he looked like the beegees)\nbiggest beef was with the secondary cast, they all looked mid 30s and\nhardly stood up to the older more experienced looking commanders\nadmirals etc in the OT. Most the action sequences were good because we\nall knew that's what jar jar Abrams was gonna do, some of the CGI\ncharacters looked woeful especially gollum the supreme leader (Andy\nSerkis) or Snoke the stupidest name since Sheev Palpatine. My other\ngripe was the pathetically obvious use of Nazi-ish visuals that are so\nover the top they might as well gave them all Hitler moustaches. So if\nyou thought jar jar Abrams would be the saviour of Star Wars and return\nit to its former glory you're sorely mistaken. I never thought anyone\ncould out \"Michael bay\" Michael bay then JJ is surely a contender.\n"},
{"review": "\nIt started with Marvel. Characters who simply make fun of bad guys, bad\nmouth them to their faces and destroy them without even trying. For\nsome reason the audience ate this up and they've been making 10 Marvel\nmovies every year using the same stupid formula. No tension, no\nconnection with the characters, nothing to make me want to watch these\nmovies, yet they are huge successes. Now this cancer has infected Star\nWars, where no one respects the main villain, (why would they even\nfollow him) the 'good' guys insult him to his face and he does nothing\nabout it (he should have executed them on the spot). I really despise\nMarvel movies and this is what Star Wars has become. It's sad. I was\nexpecting a Game of Thrones, where there are no real \"good\" and \"evil\"\njust motivations and people with depth and we can all decide who to\nlike, but no, we have to have this garbage propaganda piece crammed\ndown our throats. Other than this, the massive amount of holes in the\nplot are unforgivable. One of my favorite ones: a sanitation worker\ngets sent to kill people(why?) realizing he is not a killer, he decides\nto rescue our good guy and kill stormtroopers instead (which are real\npeople now not clones)anyone else see how ridiculous it is for him to\nbe against killing and then killing a bunch of poor brainwashed people?\nOh, anyone else realize why they are making a spin off film about the\nrebels from episode 4? Just to have Darth Vader in it.<br><br>They can't stand on their own 2 legs, if anyone ever saw this film\nwithout seeing any other Star Wars movie they'd be ridiculously\nconfused because it was entirely fan service. Conversely, one could\nwatch the prequel trilogy without the original because it had its own\nstory.\n"},
{"review": "\nFirst review ever but I feel compelled to write after watching this\nmovie last night. No spoilers in the review below.<br><br>The script was poor, too many attempts at one liners that fell flat.\nMany of the lines delivered by the female lead in a deadpan manner. <br><br>There was no plot at all. The director of the movie has crammed many\nscenes but they are too brief and no tension is allowed to build. Every\nthing achieved by the Alliance seemed all too easy. <br><br>Finn, Poe and BB8 were all pretty good and made the best of what they\nwere given in the movie.<br><br>Action is important in a Star Wars movie but it should not be the only\nfeature.\n"},
{"review": "\nNormally I like to write reviews on IMDb to push up some ratings &amp; give\nsome merit for movies I like. Rarely I come here to show my\ndisappointment for a particular movie and that's what The Force Awakens\nmakes me feel.<br><br>They took up nearly 12 years to write out this?? I mean what we have\nnot seen before about the father v/s son relationship, a 99% similar to\ndeath star planet destroying weapon, a young villain deciding whether\nto choose the dark side,a new Jedi learning her/his skills.. (within a\nfew seconds she is controlling minds too lol!), a final battle 99%\nsimilar to the final battle that Luke does in Episode 4 New hope. Oh\nlord, many scenes and dialogues were as if copied from Episode 4.<br><br>Star wars was always about planets, worlds, surprising creatures,\namazing battles, thrilling lightsaber confrontations, droids like R2D2\nand C-3PO doing humour and completing missions not to forget the great\nvisuals and special effects we had from Episode 5 , 6 and 1,2,3.\nSpecially the great battle inside the volcano between Anakin &amp; Obiwan.<br><br>Alas, The Force Awakens falls short in many ways. Nothing great\ncomparing special effects, worlds, creatures, bots, poor Snoke vs Ray\nfight scene as if two teenagers fighting in the woods. Am I watching\nTwilight lol? Where's the intensity? Snoke appears a poor villain &amp;\nsucks! Adding to that the father mother son sister relationship\nappearing like those Indian TV series melodrama. Hopefully movie\nbelongs to Ray in some scenes. No humour between the droids. You cant\ncompare with Revenge of the Sith and definitely not with the level of\nEmpire Strikes Back and Return of the Jedi. <br><br>The Magic is gone. Even Star Trek movies appear much more exciting and\ninnovative now. JJ why you gave your best to Star Trek and ruin the\nStar Wars franchise. How am gonna watch 2 similar movies in the same\nfranchise (4 and 7)? 12 years to select such a boring script!!\n"},
{"review": "\nOK so the special effects are good...big deal. SPFX should be used to\nhelp tell a story not replace it and what a poor effort this was in\nterms of story.<br><br>People have been distracted by a bunch of PEW PEW PEW, explosions and a\nbeach ball droid that looks like it belongs in WALL-E.<br><br>This movie is a simultaneous deconstruction and reconstruction.<br><br>It undoes the victory at the end of Return of the Jedi (you know where\nthe Emperor is dead, Vader is redeemed, the Rebels win, Han and Leia\naren't fighting anymore and Luke is a fully fledged Jedi who will go on\nto restore the Jedi Order).<br><br>Instead of the future we all thought we would get (and I believe were\nsold in the Trailers btw) we are back where we started in 1977 Han and\nLeia are fighting, Han is a low-life (and still wearing the same\noutfit), there are no Jedi because Luke is a failure, the First Order\n(Whatever that is) is destroying planets.<br><br>This movie undoes the Original Trilogy. Han, Luke and Leia now have no\npoint except to give rise to the new Villain. Han and Leia are failed\nparents and Luke is a failed teacher...that's it folks, there is no\nmore than that.<br><br>We are introduced to lots of new people to replace the old ones so we\ncan all go buy new toys. Poe = Han (although more politically correct),\nRey = Luke, Han = Obi Wan, BB8=R2D2, C3P0 has a new red arm so we can\nbuy more toys etc etc The plot is a recycled mishmash of the original\ntrilogy and that's all it is. Just because they swapped the sex of the\nmain character so what? I can't believe a budget of $200 million gets\nyou this piece of rubbish.<br><br>I am beyond disappointed in this movie. I wish they would remove it\nfrom the canon and give us our old heroes back as heroes rather than\nwashed up has-beens. They could also give us believable new characters\nrather than corny jokes, a forced romance and someone who's instantly\ngood at everything.<br><br>Just not good enough Disney and JJ.\n"},
{"review": "\nWhen it comes to this, it seems that there really isn't much of\nsubstance to this movie. Various things happen, a lot of commotion on\nthe screen, but where do they ultimately lead? What is the bigger\npicture? Truth is that there isn't even a bigger picture. What we see,\nis all that is and it is nothing particularly exciting even if they try\nto mask the hollowness behind a bunch of explosions, shootings and\nother stuff. <br><br>To be honest, I see no difference between this Star Wars movie or any\naverage Michael Bay movie. Plot wise it's about as deep as\nTransformers. <br><br>We have got Harisson Fordie back and Carrie Fisher and that weird\nblonde dude. Carrie used to be smoking in the 80's. I mean, she does\nlook a bit like a farmer from 19th century, but in that slave outfit,\neven if the movie was bland as hell, I could still enjoy the sight of\nher cleavage. But now she's 60 and that sight isn't particularly\nattractive to me anymore. <br><br>And Ford? He used to be such a man in the 80's. But now he's just an\nold man, who looks like he should be at a retirement home watching TV\nwith other old people. <br><br>And the blonde dude is just as annoying as he was. He ain't a Jedi.\nJust a farm boy. <br><br>This movie really lacks in every department imaginable. How you suppose\nfor me to enjoy a piece like this when there's nothing beyond the\nsparkling facade? Where's the emotion? Where's the depth? <br><br>In my opinion Star Wars has to be one of the worst franchises\nimaginable and I will never associate myself with any person that\nbelongs to it's fan base.\n"},
{"review": "\nWell where do we start with this review?... I guess with my first\ninitial thoughts of WTF! This movie is awful, dreadful, and pretty bad\nto boot. Its like the original star wars was reminiscing about its past\nwhile sat on a park bench with a bottle of wine in a paper bag...<br><br>This movie has nothing of the star wars spirit, in fact it wouldn't\nhave been surprising if Micky mouse was the new bad guy... In some ways\nthis is entirely true...<br><br>So lets call this movie out for what it is... Its just a weak ass money\nmaking machine, serving its corporate task masters, playing on the\ndedication from fans of the original series.<br><br>The only acceptable part of this movie was seeing solo and chewbacca\nback together. I initially wanted to add a spoiler,but then thought it\nwouldn't be fair to people who may actually go out and spend their had\nearned cash on it... save your money, get some friends together to buy\nit on DVD and watch it together, trust me you will never want to watch\nit again..\n"},
{"review": "\n** spoilers alert **<br><br>As a fierce woman, i went to this movie excited at seeing a new female\ncharacters fiery amazonian strength strutting around the star wars\nscreen. (I had my expectations set at the Tomb Raider Bar) i was SO\ndisappointed when i saw straight through Daisy Ridley's posh accent and\nforced enthusiasm. I began comparing her to the girl with the dragon\ntattoo and wishing and hoping for some passion :( i felt more\nexcitement when Harry Potter discovered he had wizard powers, when Rey\ndiscovered she had the force, it was quickly dismissed and went back to\nthe continual rushing around with big flashes ending in a Corny joke.\neurgh, the character lacked mystery and imagination. when she met\nprincess Leia, her fellow female warrior, the hug was like something\nfrom nanny mcphee.<br><br>I kept on kidding myself into thinking Natalie Portman would soon walk\nin with her commanding, powerful and mystical presence. <br><br>I don't know wtf happened here, but i am unwilling to accept this as an\nofficial star wars movie, i find myself looking at the movie poster\nbemused, because it seems undeserved to have the official star wars\nlogo on it ?!<br><br>This whole movie was a sham and me and my mum were so disappointed :(\n:P\n"},
{"review": "\nAfter reading some of the reviews here, I am really glad I wasn't the\nonly one extremely disappointed when seeing this so called \"movie\". I\nwas SO excited to see this movie. The trailers got me hooked, it looked\nEPIC and after watching some of the red carpet event and reading the\nreviews saying things like \"JJ pulled it off\" and \"This is the best\nStar Wars since The Empire Strikes Back\", my expectations were even\nhigher. But within minutes of watching it, I was devastated. Something\njust didn't feel right from the beginning. I kept thinking this has to\nbe a joke, that I was in a parody of the movie I paid to see. This\nmovie is NOT a Star Wars movie, this is a Disney movie made for kids.\nEverything felt SO rushed with no character development and full of\nplot holes. Most of my friends and family were extremely disappointed\nas well. I hope the next director can do better, although I doubt it\nbecause Disney holds the key and will not unlock it for anyone to do\nanything original. Disney killed The Avengers and now Star Wars. I will\nno longer support Disney in any way. I will just pretend that this\nmovie never existed and watch the other movies instead.\n"},
{"review": "\nHated it. Was bored in the opening scene and the boredom continued\nthrough to the end. It wasn't Star Wars. Trying to capture the original\nstar wars in 2016 was a bad move that only hurt the franchise. There\nwas little depth to anything force related, there was no memorable\ndialogue, the music was highly unmemorable (snooze John Williams,\nplease retire your best work is done), the only aspect I enjoyed was\nKylo Ren. Snoke, Jesus, don't even get me started on what a failure his\nattendance was. Fans actually destroy their own franchises in the end\nby demanding what they know, and when they get what they know, they cry\nabout it. I for one enjoyed and miss the richness of the sequels and\nbelieve the whole franchise would have been better off under Lucas's\nguidance.\n"},
{"review": "\nEstafa, fraude, fraud, scam, cheat, copy etc. It's only a reboot of IV\nV &amp; VI episodes, made it to accomplish standards of U.N. &amp; Human rights\nin 2016. Boyega's acting it's very superficial, and lacks the cliché of\nblack actors comic movies characters \"attitude\". He always broke all\nthe possibilities of realism in the movie. Entire movie and Disney's\ncommercial urges delivers a big, enormous historic failure in the\nindustry, if star wars was buried or almost dying J.J. Abrams take a\njump to a infinite black hole well. I felt every minute: this is bad,\nthis is bad, this is bad, and the sensation continues outside the\ncinema. At first I give 5 of 10 stars because I think like 50% of work\nwas done but I'm realize the work it's only marketing, publishing and\ncreate noise and expectation. The result it's similar when you discover\nthe fraud in small typo.\n"},
{"review": "\nI am a huge fan of the original star wars movie and yes, even the\nprequels. I grew up with Star Wars, lego star wars, Spaceballs,\nBattlefront 2 you name it. I remember having anxiety when they\nmentioned making a 7th movie. I had a feeling they were going to blow\nit but I went into the movie with no expectations and still, I walked\naway severely disappointed. Many other people have pointed out the\nobvious flaws in this movie but for me the biggest one is that, it\ndidn't even feel like a Star Wars movie. Sure we had lightsabers,\nblasters, x-wings but I felt like I was watching a foreign movie. It\nwas clear the entire movie was forced (forced haha) and that JJ Abrams\ndid not have Star Wars fans intentions upon making this movie.If you\nare a die hard Star Wars fan this movie was a slap in the face. Not\nonly because of the over-hyped garbage they tried to sell it as but the\nway they treated the force and old characters. I can go on and on but I\nregret seeing this movie, I will never think of it as a Star Wars\nmovie. I promise I will not be seeing whatever trash they pump out in\nthe coming years.\n"},
{"review": "\nAlmost a direct plagiarism of New Hope. <br><br>Also we're back to the era of incompetent bad guys. <br><br>Do not expect a good light saber fight because that doesn't happen. <br><br>Very little in the way of answers about anything you see. <br><br>Essentially an hour and a half chase scene followed by half hour of\nfighting, but nothing new within the context of fighting. <br><br>Exceptionally disappointing. There has been far better Star Wars fan\nfiction and fan films on a fraction of the budget.<br><br>A major character does not speak a single line. <br><br>Apparently the Star Wars galaxy wasn't big enough for new ideas.\n"},
{"review": "\nWhat can be said for this movie...<br><br>Predictable, boring, unoriginal and to top it off a HUGE dollop of\ncringe from the casting. I am absolutely bewildered by the whole\nexperience. What has bewildered me further is that people are spending\nmoney to see it for a second time...<br><br>Abrams has pretty much stolen your money. He has stolen the plot and\nsimply AMERICANISED IT! BIGGER isn't always better... It made the movie\nentirely predictable from scene to scene. The acting was...\nuncomfortable. Daisy Ridley? She should consider another career. Her\nperformance was so bad, it extended beyond the limits of comedy.<br><br>Adam Driver? You could flick him and he would probably cry. Hayden\nChristensen reincarnated as even whinier.<br><br>This embodiment of female strength appearing in movies is getting\nirritating. Daisy Ridley? Without prior training, understanding or\ncomprehension is somehow able to defeat a Sith Lord, even if he was\nwhiny, this was ridiculous. <br><br>The characters, after spending a total of 5 minutes of screen time\ntogether were acting as if they had known each other all their lives.\nThe connections between characters was well non existent. There was no\nemotion what so ever. I actually become so irritated with Ridley that I\nbegan routing for Driver to take her out and then put himself out of\nhis misery.<br><br>The only conclusions I have come to that can allow me to understand why\npeople are rating the movie so high are:<br><br>They have been paid to do so.<br><br>The Star Wars fans (bless their souls) were longing so much for the\nStar Wars rebirth of their dreams that they crossed the boundary of\nsanity. To be honest I would love to be able to lie to myself and\nbelieve that Star Wars hadn't been shat on not once but TWICE, but I\njust can't.\n"},
{"review": "\nEverything bad that's been said about this movie has already been said,\neverything from bad writing, bad plot, bad character development and\nthe blatant plagiaizing of Episode IV and even though I do agree with\nall these points I wanted to talk about how shamelessly Disney has\ntreated the Star Wars franchise. They have turned the precious\nspiritual message of Star Wars into nothing more than a Coca-Cola\ncommercial that's all hype, with zero substance or originality. To the\nDisney Corporation, Star Wars is nothing more than a Happy Meal--just a\nthrowaway product, nothing else. What a complete smiling shame. \"They\npaved paradise, and put up a parking lot\"-Joni Mitchell.\n"},
{"review": "\nIt doesn't feel like Star Wars,very little effects,poor acting,too much\ntalking,it has 2,3 3D effects.I wanted to leave after about 20\nminutes.Don't watch it,it doesn't deserve to be named Stars Wars.I was\nafraid that this might happen,because they could make a movie in two\ndifferent ways.One(invest hundreds of millions dollars and make an EPIC\nmovie),or spend as little as possible,and make BIG money on just the\nname and legacy of Star Wars franchise.In my opinion,they should have\nmade the movie EPIC,and not just to make money from people who love\nStar Wars.I am ANGRY and DISAPPOINTED that i waisted my time and money\nto see this movie.This is the WORSTE movie that i have EVER SEEN.DON'T\nWATCH IT,IT DOESN'T DESERVE TO BE WATCHED.IT IS AN EMBARRASSMENT TO THE\nFRANCHISE.\n"},
{"review": "\nthis movie broke my heart they changed things the main villain is a\ncrybaby,he is not the best villain he is the worst,Han solo dies is\nbull crap and i'm not the only one who thinks this its a damn reboot\nits the story of a new hope just with more tits i will watch one two\nand three then this crap i hate JJ and ford for making solo die and for\nasking for him to die it does not do it for me and i will check out\neight and nine just to see what else they do wrong George man why did\nyou sell you did better then this i will not watch eight or nine i will\nwait for spoilers for them and if i don't like it i will not watch it i\nwill not spend my money on this movie or the others\n"},
{"review": "\nWhat makes this move an ultimate bore? - extremely weak plot, scenes\nbuilt entirely from recycled material, ludicrously shallow characters,\nunimaginative execution? Or perhaps an overall feeling that the people\nat the helm of this business venture were extremely eager to deliver\nthe ENTERTAINMENT and VALUE FOR MONEY and QUALITY and of course to\ntarget the right audience with an uttermost precision. <br><br>What kind of audience this movie tries to hit right into the pleasure\ncenters?<br><br>Seems like it is the generation of 14-16 year olds who were somehow\nstuck with their intellectual and emotional development at 8- year old\nlevel, yet they are very keen on gadgets and social justice. <br><br>More or less like the central DARK character (what's his name?), who is\nuncannily portrayed more retarded teenager than the powerful overlord. <br><br>And the whole top command of the evil First Order is as imposing as\nCambridge cricket team of the second decade of the 21st century. Well,\nthey are all white, middle class and undoubtedly British. So they are\nentirely evil. Sure. <br><br>Would this movie make these kind of audiences lift their heads from\ntheir smart phones for long enough? Perhaps so. Yet there is nothing to\nremember, nothing to treasure and to be fond of. I guess the next\ninstallment in the franchise will advertise newer robotic toys, that's\nall. <br><br>Even the music is entirely forgettable. Who wrote it? I would prefer to\nremain clueless.\n"},
{"review": "\nThis movie has about as many (or more) plot holes and inconsistencies\nas some of the worst B-movies of the Eighties. Nothing makes sense,\nnothing feels designed to have some meaning or to build drama, instead\neverything that happens is like a loose succession of trivialities:<br><br>Protagonists stumble upon each other as if the whole galaxy was small\nlike a village.<br><br>Protagonists don't seem to be able to express any real human emotions,\napart from violent outbursts like 8 year olds, or shallow friendships.\nNothing feels real. Protagonists turn into friends or enemies without\nreal character development. It's like when you watch 8 year olds\nnarrate stories while they play with their SW toys. Movie plot has the\nexact same emotional depth as 8 year olds playing with toys, I am not\nkidding.<br><br>Don't expect to hear a new compelling music score, you won't find any.\nAlso don't expect to see new creatures or planets that stimulate your\nimagination, creature design is just a rehash of what we are used to,\nNOTHING new is explored, no new planets or sceneries. (you just get the\nobligatory desert and ice planet, etc... I thought we had a whole\ngalaxy to explore???<br><br>Can you believe how shallow the character design is? Apparently there\nexists an Asian looking gang in this universe whose name is\nKanjiKlub-Gang. You can't make this stuff up. It's EXACTLY what an 8\nyear old would choose as name.<br><br>Also there is a childish understanding of astronomy, like in one scene\nhaving multiple planets just a few thousand miles apart from each\nother. (the old trilogy had much more scientific accuracy, at least\nthey didn't make such glaring mistakes)<br><br>This movie feels like a giant jedi mind trick. It's a TRAP!\n"},
{"review": "\nMinor Spoilers! I am a Star Wars fan and was a member of the Star Wars\nfan club that was based in the US. I was 11 when I saw Episode IV-A New\nHope and loved the OT because the first trilogy gave me memorable\ncharacters and scenarios that the prequels did not. Just hearing the\nscore and the themes for each scene like Darth Vader marching in, Leia\nand Han Solo's romantic moments, epic battles in space and down below\ngave me thrills. What made me watch Episode 7 was the fact that I would\nbe seeing the old characters and I thought they would be depicted in\nways that would make their send-offs as memorable as when they were\nstill the main leads in late 70s to early 80s. Unfortunately, this film\nnever took what motivates a character to behave a certain way seriously\nso there were a lot of senseless behavior and unexplained scenes. It\nwas okay to kill off Han Solo but they could have made his death more\nheroic as befitting the epic tradition of Star Wars. Rey, though a\nnatural, should not be portrayed as someone who could easily harness\nthe force without training. Sadly, I agree with those who hated this\nfilm. It is more a remake or a reboot than a sequel. My classic OT is a\nhard act to follow after all. This new film lost the heroism and soul\nof the OT because it seems the generation today prefers mindless action\nscenes reminiscent of The Man of Steel and The Amazing Spiderman. I\ndon't think remakes or reboots today can capture the essence of the\noriginal stories I grew up with so I should not be fooled again and\nagain, grrrrrrr......\n"},
{"review": "\nI came out of the cinema yesterday thinking that I'd just seen the\noriginal Star Wars film re-filmed with different characters. The plot,\nespecially the critical junctures are 1:1 carbon copy of the original\nStar Wars with some elements of The Return of the Jedi thrown in.<br><br>I don't think I've ever walked away from a movie feeling as cheated as\nI was feeling with this movie. I understand sequels have to have\nsimilar elements to capture the fans but come on. There was nothing,\nabsolutely nothing in the story of this movie that somehow expands or\nbuilds the Star Wars storyline. Even though episodes 1-3 were awful and\nwooden, at least George Lucas was trying something. This was a complete\nand utter rip-off.<br><br>Also, is Snoke Gollum's long lost uncle? And did the Force Awakens\nsteal the Moon Nazis from \"Iron Sky\"? Totally out of character visually\nand otherwise.<br><br>I now know why Luke Skywalker was looking so perplexed at the end of\nthis movie. He was thinking \"how the hell can I carry this miserable\nplot on from here?\"\n"},
{"review": "\nThe single piece of laziest story telling i have ever seen in my\nlife..If this is the new standard for Hollywood, then it's utterly\ndisgusting..The story was pitifully bad...The characters were pointless\nand shallow..It was a dumb mary sue propaganda video with a few special\neffects thrown in..Disney and Abrams should be ashamed of\nthemselves...This was a really bad ''any kind'' of movie. Let alone a\ngood star wars movie...I bet the ones that hated on the prequels want\nto beg Lucas to direct the future movies now...DO NOT SEE THE NEXT\nMOVIE AT THE CINEMA OR Hollywood WON'T GET THE MESSAGE...ALSO..DO NOT\nBELIEVE TRAILERS..THEY JUST MAKE YOU THINK THE MOVIE WILL BE GOOD..IT'S\nCALLED HYPE, AND THE WORLD GOT CONNED BIG TIME WITH THIS GARBAGE.\n"},
{"review": "\nWarning there may be the odd spoiler.<br><br>It is simply a poor remake of the original Star Wars movie from the\n1970s pretending to be something new. In this respect there has been\nabsolutely no creatively. They took the original story and messed about\nwith it and made it far worse. <br><br>Very poor and shameful use of the original characters. <br><br>The outcome of the final battle is so predictable that nobody will care\nwhen the death star on steroids is finally destroyed. There is none of\nthe excitement and exhilaration of the original. <br><br>The villains are a poor shadow of the villains of old. We still have\nthe same tie fighters, x wings and star destroyers. Apart from a new\ncute Disney robot, nothing new has been created for this movie.\n"},
{"review": "\nWhat you find in this movie:<br><br>- A mix of SW topics <br><br>- Silence or small talks with no sense (C3PO verbiage is lost) <br><br>- A remix of the 3 first movies <br><br>- Poor history copy/pasted from previous SW movies. Even the new 'bad\nboy' wears a mask, apparently with no other reason that to look like\nDarth Vader. <br><br>- Lots of explosions and digital effects <br><br>- Previsible, you know what is going to happen next every minute of the\nmovie <br><br>- Lots of explosions and digital effects again, and again<br><br>The only thing I liked was the old characters appearance, but even this\nwas point poorly made, almost no text, Solo/Leia discussions are lost,\nand the new characters have no character, like the animated ones from\nNemo or The Little Mermaid.<br><br>It looks like today a movie is made around digital effects, and decades\nago this digital effects were only a way to spice a great\nhistory/acting/direction.<br><br>The worst thing they have done with this movie: they SW mojo is lost.\n"},
{"review": "\nThe only explanation for this movie having such a high start rating,\nconsidering both how bad it was and how many negative reviews have been\nposted, is that the makers must have people who go on IMDb and flood\nthe site with 10 star scores. Seriously, what other possibility is\nthere? I blame IMDb for this as much as the people who made the movie.<br><br>As for the movie itself, it is what should be expected from anything\nput out by Disney. Political correctness and girl power taking\nprecedence over story and believability. It was irrelevant that the\nmain character had no reason to be as competent as she was, except that\nshe was a cute little girl, so nothing else mattered. Unlike Luke, who\nhad to work hard at becoming a good at using the force, our brave\nheroine simply pulls it out of her pretty little butt and beats the\nstuffing out of the main villain. But then who cares? She's cute,\nright? <br><br>And as for Finn, is this the best they could come up with for the first\nblack lead in the Star Wars films? A flaky sidekick to the main\ncharacter? It's like the writers simply started with the idea of having\na little girl and a black dude as the leads, then used a plot from a\nprevious movie for the story. It's almost as if they followed what they\nthought was a can't miss formula that failed miserably in almost every\nway possible.<br><br>The only good aspects of the film came out of what they brought in from\nthe previous movies. Han, Leia and the Millennium Falcon. But that and\nsome awesome special effects are not enough to save it from becoming a\nfestering pimple on the butt of the Star Wars franchise. One can only\nhope that they give up on making any additional movies and stop the\nbleeding before it is too late.\n"},
{"review": "\nI have never before written a movie review, but after watching this\nabomination I felt compelled to spread the truth: THE EMPEROR HAS NO\nCLOTHES!<br><br>Now I understand why Disney bought Lucasfilm and with it the rights to\nStar Wars - they hated its success so much, so that they wanted to\ndestroy it once and for all, but making a lot of money on the way. To\nbe truly efficient they needed to get the sith lord of movie-making\nJ.J. Abrams on their side, whose storytelling talent is that of a log\nin a fireplace. For hours after watching this so-called movie, I\nwondered how the story writing was actually done - did they first start\nwith the plot or with the plot holes. The plot holes in SWTFA are so\nbrilliantly executed, so that hundreds of books and Disney cartoons\n(generating more profits along the way) will be needed to fill in the\ngaps. While I agree that the plot holes made some sense (in terms of\nfuture PROFITS), I cannot say the same about the plot itself - its\ncomplete lack of logic is staggering. The next step in their plan of\nruining SW was even better - they had to create 2-dimensional\nuninteresting characters (no need to mention specific ones since they\nall fit this definition perfectly) that had to be acted very poorly\n(which explains the subconscious desire of Han Solo to die and relieve\nHarrison Ford from carrying on with the role). For the picture to be\ncomplete they had to add cheesy humor and cheap CGI effects - obviously\nsupreme leader Snoke was so powerful, so that he succeeded to escape\nthe LOTR universe and jump right into the SW one. I don't know why John\nWilliams decided to participate in this plan and ruin his own music,\nbut this time he delivered a completely unmemorable score.<br><br>Although my review seems overly critical this move has one redeeming\nvalue, that makes up for all its flaws - now, I consider the prequels\n(SW 1-3) to be true masterpieces of movie-making.\n"},
{"review": "\nIt did not have any new content.Lazy done. Remake, and very cheap. I am\nsure Disney will try and relaunch the whole Star Wars again, with\ncheaper actors. I am not going watch another star wars again after this\none. Waste of my $20. I think the movie has fallen to the wrong hands,\nand the producers will not be able to live up to the old fan's\nexpectations. As a movie alone without even mentioning expectations,\nthis movie still fails to impress an average viewer. The only reason I\nthink this movie got anywhere near an 8 is because of all the hype. The\nstory line is missing, the actors barely have any connection with the\naudience, in exception to few old ones. In conclusion, this movie is a\n6.5 without minding that it is successor to Star Wars, but the fact\nthat it is a Star Wars this actually deserves a 0 out of 10.\n"},
{"review": "\n. I think it's possibly the worst film I've seen. A complete carbon\ncopy of the first film. How JJ Abrahms had the brass neck to accept a\nwage for that, I don't know. The storyline is scant at best. An effort\nto try and hide that it's a rehash of A New Hope, I suspect. The\ndialogue sparse. The characters are shallow and unappealing. And the\neffects ain't nothing to write home about either. What makes it a\nmillion times worse is that Disney/Lucas ignored brilliant stories from\nStar Wars Universe. Also to make sure they didn't eat into their\nprofits they stifled the Star Wars Universe. Once they bought the name,\nthey stripped the right for authors to write new books. I'm sorry. My\n12 year old daughter writes better stories than this. I found myself\nshouting \"I saw this in 1978\". The film is an utter disgrace. If that\nis Disney, for the love of God get it back in the hands of toy seller\nLucas. I'd even rather Jar Jar over that shower of vapid, shallow,\nno-character characters.\n"},
{"review": "\nIt is just sad to see a wonderful story like the one this franchise\nhas, being ruined. I am really surprised by those that give good\nreviews in this movie. Has any of them seen the original trilogy???<br><br>After watching it, I realized that the prequels were not too bad,\nbecause at least they HAD A STORY to tell. Star Wars VII: The Force\nAwakens is actually a 100% remake of the original 1977 film, with more\n\"diversity friendly\" characters (and they are not as likable as the\noriginal ones)!<br><br>It's really the 3rd time in Star Wars franchise that the bad guys have\nbuilt (or attempting to build) a Death Star-like planet. Even the\nscenes are the same with the original Episode IV; they just made them\nlook more \"modern\". Seriously, can't you just have a Death Meteorite\ninstead, a Death Black Hole or something else?? <br><br>You should have given the scenario to children, they could come up with\na better story (at least they would have come up with A story)! Or get\nsome inspiration of the hundreds wonderful stories in Star Wars books\nand games' content. Much better ideas out there than recycling the same\none and ruining the franchise!\n"},
{"review": "\nI was expecting a lot more. Wasn't expecting something perfect, nor\nfeeling the same way I felt with the original trilogy. But THIS has\ngone too far: if they only intended to sell lots of silly ball-robots,\nthey could have warned us. The plot, childish and a total remake of the\nIV movie. The acting mediocre. Kylo Ren and Finn are maybe the two\nworst characters... although Leia is close enough. One point out of ten\nis maybe too low, I know: if this had been a completely different\nmovie, the scoring would have been better, sure. But I have got two\nreasons for voting this low: first, my expectations, utterly betrayed.\nSecondly, with the characters coming from the old trilogy, the plot,\nall the feelings people had... it is difficult filming something this\nbad. And JJ... I have no words... no words: my first review ever in\nIMDb thanks to you. It's 3:50 a.m. and I go to bed in a very sad mood.\n"},
{"review": "\nI just came from cinema,and felt the necessity of write some\nlines,because I felt insulted. That's the true.<br><br>This \"new\" movie is a mixture of the first trilogy with nothing new. I\nhave read some critics that list the similarities,so i'll obviate\nthat,but i have to say something about the part when they discuss the\nattack plan: the planet-weapon has the same weakness as the\ndeath-star,the same! I mean,we are not that stupids. Have some respect\nfor the public,for god's sake! Even in the movie they said \"it's\nanother death-star\".<br><br>This was sad. You had a lot of material from the expanded universe to\nmake a great movie,an epic one. Instead,you have done a really bad\ncopy.(Seriously, I have played star wars games with better plot) <br><br>I'll put this film the worst rate possible,because it has ruined maybe\nthe greatest movie saga of all times.\n"},
{"review": "\nI was eager to see the new Star Wars film. I even love the prequels.\nWhen I watched the \"Force Awakens\", I felt that the director\nunderestimates my intelligence. <br><br>The movie has no story whatsoever, the female protagonist is there just\nto please the feminists and I rarely see a movie trying so hard to be\npolitically correct. I mean seriously, with zero training she could use\nJedi mind tricks and beat a guy trained in the Jedi ways. <br><br>I watched a whole Star Wars movie and I don't even feel I explored the\ngalaxy at all. No emotions, no excitement, nothing. Only Disney jokes\nand fast paced nonsense. <br><br>Please give me my money back.\n"}
]