[
{"review": "\n\nAmerican Beauty is the greatest movie ever made.<br><br>If you haven't already, watch American Beauty by yourself and give yourself\nsome time afterwards to think it over. You will never, ever look at life\nthe\nsame way. It does exactly what movies are meant to do - give us a window\ninto ourselves, and American Beauty does that better than any other film\nhas\never done. No word of dialogue is unnecessary, no character exaggerated,\neverything is perfect...but if you have seen American Beauty you should\nknow\nthat already. Once you look closer at this movie, and see Beauty in every\nframe, it becomes so much easier to look closer and see Beauty in\neverything\naround you. You think I'm waxing poetic? Then you must not have seen the\nmovie. Every character is a part of each of us: the Lester Burnham of\nchange, the Carolyn of uncertainty and failure, the rebellion of Jane, the\ndefeated Barbara, the false control of Angela and the Colonel, and the real\ncontrol of Ricky. To me Ricky, not Lester, is the center of this story; he\nsomehow controls or sets in motion the heart of Lester's rebirth and\ndownfall. There are several parts of this movie where I lose control every\ntime I see it, and none more so than the paper bag scene. To me that scene\nis simply the greatest monologue ever written.<br><br>I listened to the message of American Beauty - look closely and you can\nfind\nBeauty in anything - and it changed my life. I rose out of a long, deep\ndepression and started out into the world. Sometimes there is so much\nBeauty\nin the world, I can't even stand it, and it feels like my heart is going to\nburst.<br><br>This is the most beautiful movie I have ever seen.\n\n"},
{"review": "\n\nProbably the best film of 1999. This dark comedy drama marks\ntwo fantastic feature film debuts with Alan Ball as writer and Sam\nMendes as director (both winning oscars for their sterling\nefforts).<br><br>Kevin Spacey plays Lester Burnham, a man on the brink of a\nmid-life crisis, who suddenly becomes obsessed with one of his\nteenage daughters friends played by Mena Suvari. His daughter\n(Thora Birch) is, as Lester tells us; \"a typical teenager. Angry,\ninsecure, confused...\". And his wife Caroline (Annette Bening) has\nan obsession of her own, her public appearance.<br><br>Life starts off on a downer for the Burnhams and their new\nneighbours the Fitts despite their lives looking good from the\noutside.<br><br>As life begins to improve (with most of the main characters finding\nwhat they think is love or new relationships) it soon all comes\ncrashing down in the climactic final day.<br><br>The writing is nothing short of brilliant and made even more\namazing by knowing that it comes from a first time feature film\nscreen writer Alan Ball (who had had years of prior experience\nwriting TV sitcoms -  not  that you'd be able to guess from the tone\nof this film).<br><br>The directing is on a par with the writing and Sam Mendes\nmanages to get some brilliant performances from the great cast,\nwho are all faultless. No doubt Mendes' theatre directing past\nplayed a huge part in directing the actors so well.<br><br>Another person worthy of a mention is the late director of\nphotography Conrad L. Hall, another one of the five oscar\nrecipients for this film.<br><br>All the elements in this film gel perfectly together to make one\nsuperb masterpiece. Not one person, either cast or crew, steals\nthis film or does anymore than anyone else to make this film what\nit is. Truly an ensemble effort. 10/10.\n"},
{"review": "\n\nThis movie was a joy to watch.  I didn't know what to expect when I came\ninto it.  I had heard the buzz of the acting and the story, etc...but we've\nall heard that before and had been disappointed, but not so with this one.<br><br>Kevin Spacey plays this part to a \"T\".  He is strong when it requires and\nmeek when it is needed.  His emotional rollercoaster ride is a trip to\npartake in. Annette Bening is marvelous as well.  I think they both should\nbe nominated.<br><br>The support cast is also spectacular.  Thora Birch, Wes Bentley, and Mena\nSuvari all give great performances as the troubled \"Teenagers\" in the film.\nOf particular mention is Wes Bentley's performance, worthy of a supporting\nnomination as well.<br><br>This is a dramatic and funny tale of a man and his life in a state of\nturmoil and transition.  When he happens to see a beautiful friend of his\ndaughter's at a cheerleading exhibition, he is completely infatuated with\nher beauty.  Using this as his inspiration, he attempts to change all\naspects of his life.  He confronts his marriage, his job, his ego, and his\nlibido.<br><br>The music in this film is also very well chosen.  There are moments when the\nmusic fits so perfectly with the scene that they meld together as one to\npresent a perfect emotion.<br><br>The plot can get rather involved, but you will follow it endlessly to see\nwhere you go.  I was simply involved, hook, line and sinker.<br><br>See this movie more than once, and skip some of the other movies out now\nthat are dare I say, trash.<br><br>This should be on the top of many critic's lists this year and it is\ncertainly on top of mine.<br><br>My Rating (1 - 10):  10<br><br>\n"},
{"review": "\nThe intention is so clear that everything else falls into place,\nperfectly. Kevin Spacey's suburban husband and father reminded me of\nhis character in \"The Ref\" and that could only be a good thing. Annette\nBening and her giggle works wonders here. Their marriage is a tabloid\nversion of a \"Who's Afraid To Virginia Woolf\" Which means very close to\nsomeone we know. The biggest surprises in the film. besides the amazing\ndexterity of Sam Mendes at his first outing behind the camera, are West\nBentley. Chris Cooper, Thora Brch and Allison Janney. As I'm writing\nthis 8 years after its first release, the Oscars and the whole\nhullabaloo, I'm very surprised that West Bentley hasn't become a major\nstar. He is amazing in \"American Beauty\" the complexities of his\ncharacter are based on recognizable human stands, the hardest to face\nup to and I went where he went. Thora Birch is lovely as the object of\nhis attention and the film, I believe, is here to say.\n"},
{"review": "\n\nWhat can I say, except that this film really knocked me on my keaster.  I\nwent in to the theater not knowing what to expect, but was pretty sure it\nwould be worth the ticket price.  Boy was I happy when I left.  Not only was\nit worth the ticket, I paid to see this film two more times.  This film is\nvirtually perfect.  The acting is superb, the story is magnificent, the\nnarrative is brilliant, and the structure of the film is truly\ngroundbreaking (absolutely loved the last 20 minutes).  What really\nsurprised me about this film was how well the cinematography was done.  In a\nsmall,\ncharacter driven film such as this, it is very unusual to have such great\ncinematography.  With this film, there is something interesting going on in\nevery scene, not many films you can say that about.  In a year where first\ntime directors have made some of the best films, Three Kings, Being John\nMalkovich, etc...  Sam Mendes seems to have out-done them all.  Though I\nhave yet to see The Green Mile or Magnolia, I find it hard to believe that\neither film will out-shine American Beauty.  This film should easily win a\nsubstantial amount of the Oscars this year.  What's up with all the cirtics\nawards snubbing it so far?\n"},
{"review": "\n\nThis piece of sitcommy, cliche-ridden claptrap is just smart enough on its\nsurface for the middlebrow Academy to pimp it for a Best Picture Oscar. But\nanyone with half a brain will see through this tired male fantasy pretty\nsoon. Mendes shows us a Edward Scissorhands-type of suburbia: perfect\nlawns,\nidentical homes, etc... We are expected to know (since we've seen ES, Ice\nStorm, Happiness, Serial Mom, etc.) that these people must lead shallow,\nempty lives - look where they live! And... they do! This is just the first\nof many obvious themes that we have seen so many times before. And we\nhaven't even reached Spacey's character's midlife crisis yet. (Surprise! He\nfalls in sexual lust with a gorgeous high-school blonde. Sooooo subversive!\nLook closer, and you'll find even more cliches.) Spacey's wife is,\npredictably, a self-centered shrew who won't satisfy him sexually but cooks\ndelicious nutritious dinners and sells (surprise) real estate. His daughter\nis a misfit (wow!) with whom he can't connect. The new kid on the block (of\ncourse there is one) is a weird, sensitive (but handsome) loner type\n(shocker) who (believe it or not) falls for Spacey's moody daughter. Don;t\neven ask about the gay neighbors. Mendes does nothing but condescend to his\ncharacters, his setting, and above all, the audience. Positives: Thora\nBirch\nis terrific and lovely; Mena Suvari is breathtakingly beautiful, and the\nplastic bag sequence is affecting. Pretentious c***. \n"},
{"review": "\n\nThis is a profound movie that examines ordinary people.  For all their\nflaws\npeople are basically beautiful and that is one of the many threads of the\nfabric of this film.  I liked that it was revealed at the start of the film\nthat Lester would soon meet his demise.  And I also liked at the ending,\nthe\nidentity of the person who took his life didn't really matter, just the\nsadness of the loss of his life.  'Look Closer' was the theme of this movie\nand Lester even had this motto in his cubical.  Kevin assumed the persona\nof\nLester with a range of acting that is quite worthy of awards.  Bening\ninhabited Carolyn in much the same way.  Which one of us hasn't experienced\nthe disillusionment of our teenage years, only to later re-experienced it\nagain through our children.  And like Carolyn, who among us has not been\nintensely disappointed with ourself at some point?  That one scene was\namazing, it looked so real that it transcended acting.  And can a movie\nactually move beyond entertainment by causing more than absorbing\ndiscussion, but real change in it's audience?  Perhaps.  But if this is\ntrue, then that movie would be American Beauty.  And for those who feel\nthis\nmovie doesn't achieve this lofty accolade.  To them I say, \"Never\nunderestimate the power of denial.\"  A ten, of course.\n"},
{"review": "\nThe first time I heard about this movie I thought it was this movie and\nabout a man with cancer and then read a lot of good things about and\nthen say some trailers and then I saw it. At first I did not like this\nmovie but than say it again on T.V and then loved it ever since. This\nis one of the most original films I have ever seen. The performances\nare one of the best and more Oscars should have been handed out. The\ndirecting by Sam Mendes is superb and I'm glad that he won the Oscar.\nAlan Ball wrote one of the best screenplay and story's ever thought and\nthere's a reason why he won the Oscar and most deserving. This is the\nBest of the 1990's and that decade had a lot of great movies came out(\nGoodfellas, L.A Confedintil, Pulp Fiction to name a few). This was the\nfirst movie that I saw that was perfect and I had to see it over and\nover so I can just uncover everything that was in this movie. This\nmovie is in my top ten movies of all time and I'm glad that it's rank\nnumber 35 and that one of the reason why I joined this because it was\nthe only website people respect my opinions and agreed with me. Keven\nSpacey gives his best performance and one of the best of time. Spacey\nbrings a great performance for a really deep and is just a great\ncharacter. Annette Bening does a great and for some reason missed the\nOscar. Chris Copper does a great job and didn't get notice that much,\nalso did Wes Bentley, Mena Suvari and thora Birch did a great job and\nshould have more notice. Sam Mendes does a great directing job and is\none the best film debut ever. This film was one the best ever made and\nshould be seen by everyone hows looking for great movie or how just\nwant have fun watching a movie.\n"},
{"review": "\nMuch-praised film about a man facing mid-life crisis in suburbia,\ndreaming of playing Humbert Humbert to a Lolita that is his daughter's\nfriend. There is only one word to describe this film: pretentious.\nMendes thinks he is making the Great American Motion Picture but it is\npopulated with cookie-cutter characters and it superficially touches on\nwhat the filmmakers regard as important themes. The acting is mediocre\nat best. Spacey gives the kind of performance that the Academy loves\nand awarded him with the Oscar but his acting here can be best\ndescribed as mugging. Benning does not fare much better as his\ndesperate wife.\n"},
{"review": "\nWhy don't we live in Westport!!, My wife is the one with the balls in\nthe family, I have the hots for my daughter's friend, Some homophobic\nNeo-Nazi kissed me on the lips, I'll have an affair with a business\nmentor, I hate my parents because that's what everybody in suburbia\ndoes. This only begins to comprise the cacophony of quirks that this\nfamily expounds on!! A mid-life crisis occurs when the most exciting\nthing in your life is masturbation!! Let's nurture the psychotics!!\nLet's patronize the adolescents!! Let's make excuses and thoroughly\nbelieve them!! Cavalier changes are the perfect depiction of the phrase\n\"Too little too late!!!!\" A remote understanding of family and friends\nis just too much trouble, so let's just not bother!!! Did you know that\ndad got his brains blown out!! Oh well!! Nobody knows why!! Daughter\nand wife and company will eventually think of something else in the\nvery near future....It is a fact that an obscenely mega mortgaged\nAmerica is incredibly self centered...All these demented problems\nprevail in sweet suburbia!!! Suburbia is mainstream America, so are\nthese hang ups!! These hang ups and so many more!!! Anybody else care\nto add to this list feel free to do so!!!\n"},
{"review": "\n\nWhat can I say that hasn't already been said?  This movie was one of the\nfunniest yet most disturbing movies I have seen in a long time.  Kevin\nSpacey gives what may be his best performance  (yes, I thought he was\nbetter\nin this than the Usual Suspects).  The directing was top notch and all the\nother acting was terrific.  I think this movie paints a good picture as to\nwho we are as people. Not everyone in this world is a perfect, good looking\nperson, and this movie plays on that notion.  Everyone should go see\nAmerican Beauty.\n"},
{"review": "\n\nWatching \"American Beauty\" is like looking into a handful of American lives\nslowly plunging into moral and emotional devastation. Although these people\nare gaining a sincerely fulfilling happiness, they are also slowly losing\ntheir grip on human value and order. This is not your average social\ncommentary, it has something most satires lack; poignancy. On one hand,\nthis\nis a scathing examination of the facades and truths that surround a\nseemingly \"perfect\" suburban family, displaying what it would be like if\neveryone's true colours emerged, as they liberate themselves from the\npainful phoniness that society forces them to live by. One the other hand,\n\"American Beauty\" is a thought-provoking and emotionally devastating\ncharacter study of two families finally achieving joy for the first time in\ntheir lives, unaware of the profound impact they are having on themselves\nand each other, and neglecting the consequences that will inevitably\nfollow.\n\"American Beauty\" shines in almost everyway, from it's stunning imagery of\nbeauty fused with violence and tragedy, to it's darkly hilarious script,\nthis is one of those rare films that stay with you for a long time. But the\nmain thing that makes this movie soar are the performances, Kevin Spacey\nand\nAnette Benning are simply sensational as the feuding married couple\nexploring new realms of life,  Wes Bentley, Chris Cooper, Mena Suvari and\nThora Birch also showcase excellent performances. A truly remarkable\nfilm.\n"},
{"review": "\n<br><br>A definite addition to my Ten Best List for 1999,  is AMERICAN BEAUTY which\nis sure to earn Kevin Spacey, Annette Benning  (robbed in the past for her\nwork in BUGSY and THE AMERICAN PRESIDENT),  and Alan Ball (most original\nscreenplay to come along in awhile), Oscar nominations. It is the story of\nwhat suburban life and the pursuit of the American Dream can do to an\nAmerican Family. But unlike the critic's darling from a few years ago ICE\nSTORM, which left me freezing, this film is genuinely funny and moving at\nthe same time. The ideas projected by director Sam Mendes literally leap off\nthe screen.  Spacey's edgy performance as the ad exec pushed over the brink\nby the pressures of having to have it all and his passion for \"The American\nBeauty\"  he missed when he was young enough to enjoy it, offer a visual\nfeast.  Annette Benning as the Queen of suburbia, Spacey's wife, is  a sort\nsexy, gorgeous, Martha Stewart gone mad, convinced if she has just one more\nmotivational seminar she will reach nirvana.  She is in a word \"wonderful.\"\nThe boy next door is sort of cross between Timothy Hutton in ORDINARY PEOPLE\nand Benjamin in THE GRADUATE.  He deals drugs, observes life around him\nthrough a video camera and convinces almost everyone that he is the straight\narrow next door.  We know immediately, that like everyone else in this\nmovie, he is not as he appears.  AMERICAN BEAUTY peals away, layer by layer,\nthis oh so imperfect world of suburbia and those in denial who live there.  \nIf you have already seen NOTTING HILL you NEED to see AMERICAN\nBEAUTY.<br><br>\n"},
{"review": "\n<br><br>A definite addition to my Ten Best List for 1999,  is AMERICAN BEAUTY which\nis sure to earn Kevin Spacey, Annette Benning  (robbed in the past for her\nwork in BUGSY and THE AMERICAN PRESIDENT),  and Alan Ball (most original\nscreenplay to come along in awhile), Oscar nominations. It is the story of\nwhat suburban life and the pursuit of the American Dream can do to an\nAmerican Family. But unlike the critic's darling from a few years ago ICE\nSTORM, which left me freezing, this film is genuinely funny and moving at\nthe same time. The ideas projected by director Sam Mendes literally leap off\nthe screen.  Spacey's edgy performance as the ad exec pushed over the brink\nby the pressures of having to have it all and his passion for \"The American\nBeauty\"  he missed when he was young enough to enjoy it, offer a visual\nfeast.  Annette Benning as the Queen of suburbia, Spacey's wife, is  a sort\nsexy, gorgeous, Martha Stewart gone mad, convinced if she has just one more\nmotivational seminar she will reach nirvana.  She is in a word \"wonderful.\"\nThe boy next door is sort of cross between Timothy Hutton in ORDINARY PEOPLE\nand Benjamin in THE GRADUATE.  He deals drugs, observes life around him\nthrough a video camera and convinces almost everyone that he is the straight\narrow next door.  We know immediately, that like everyone else in this\nmovie, he is not as he appears.  AMERICAN BEAUTY peals away, layer by layer,\nthis oh so imperfect world of suburbia and those in denial who live there.  \nIf you have already seen NOTTING HILL you NEED to see AMERICAN\nBEAUTY.<br><br>\n"},
{"review": "\n\nMy fiancee &amp; I saw this movie at a sneak preview showing in her college. \nThe big lab building was filled with mature college students, and there were\nthose who still haven't grown up yet.  The lights dimmed and the movie\nstarted.  It started out with Lester Burnham (played by Kevin Spacey), in a\nshort monologue with an overview of the city they live in.  From that moment\nuntil the ending credits rolled, I did not blink, I did not budge...except\nwhen I laughed...and BOY did I laugh.  The movie itself was a bit....shall I\nsay..oh...weird.  My fiancee didn't like it too much, cuz it was too weird\nfor her.<br><br>I thought it was a very serious movie, but with most of the serious scenes,\nit contains lots of humor.  That's why I thought this movie was very good &amp;\noriginal.  It's very very serious, but at the same time, it was hilarious\nand shocking.<br><br>Please do NOT take your kids to this movie either (like I saw some parents\ndo in American Pie), it's very BOLD &amp; BRAVE.  It has Kevin Spacey nearly\ncommits statutory rape, it has Spacey masturbating (it actually showed it!),\nand it had Annette Benning having sex with Peter Gallagher..&lt;very rough\nhard sex&gt;.  <br><br>In short, I think Spacey &amp; Benning &amp; Chris Cooper (the Neo-Nazi marine) all\ndeserve oscars for this movie!   As for best picture, as of right now,\nthere's no movie as bold, daring &amp; very well acted like this movie is.  So,\nAmerican Beauty, you have my votes!<br><br>  \n"},
{"review": "\nWell crafted movie for sure, all performances strong and \"believeable\"\nwithin the context of disbelief suspension.<br><br>However, where is it going? What is it showing us? What revelations\ndoes it want to share? <br><br>What it seems to want us to understand is revealed in what amount to a\nstring of clichés: the male mid-life crisis, the female search for\nnon-domestic excitement, the ungrateful, petulant daughter, the\nsuburban slut, the homophobe confronted by \"partners\" up the street,\nthe moody teenager full of angst about the \"ordinary\" world, imagining\nhe is Holden Caufield personified. Oh my, the pervasive phoniness of it\nall.<br><br>But then, ahah! Look Closer. The father really cares about his daughter\nmore than his firebird! The wife is totally insecure and the the\nself-help slogans don't help! The petulant daughter thirsts for\nattention and finds it outside her social norm! The slut is a virgin!\nThe homophobe is . . gasp! They took the clichés and contrived them\ninto rather silly revelations, and the crowd went wild. <br><br>Sorry that I don't have the strength to get up for the standing O.\n"},
{"review": "\nI heard a lot of this movie when it was released on TV, I heard that it\nwon many prizes, etc., so I decided to watch it. Very provoking, isn't\nit? Yep, even my dad changed the channel many times so I didn't watched\nsome scenes, but it didn't mattered, I watched the most important\nscenes.<br><br>This movie deserves to be in TOP 250, it's a truly masterpiece, I\nlaughed, almost cried too with the ending, and I couldn't stop thinking\nin many things of the life. For almost a complete hour I could find\nbeauty in everything I watched, even in a bag, like in the movie.<br><br>Yes, the movie will let you thinking in many things, for example, the\nlife of any person becomes boring when you have sons, a wife or\nhusband, and a normal life, so, why not to live the life? The\ninteresting of this movie is that you can see how many persons live,\ntheir wishes, their intelligence, anything.<br><br>This, my friends, is something that must be called a movie, a really\nMasterpiece that will stay in TOP 250 for a long long time. You know\nwhat's a movie? Then you already watched this movie. I really liked\nthis movie, as many other persons.<br><br>A TRULY MASTERPIECE: <br><br>10/10\n"},
{"review": "\n\nThis has to be one of the, if not the best films I have ever seen. The\nperformances by Spacey, Bening, Birch, and all the other actors were\namazing. They will all be hopefully remembered at awards time. The thing\nthat makes this movie so great is not only the stellar cast, but also the\ntruthful and solid writting. This film was superb, and it will be\nremembered\nas one of the best films ever made.\n"},
{"review": "\nI didn't think that much of this movie the first time I saw it. But\ncertain images just stuck in my head.<br><br>I saw it a second time and I really saw it for the first time, an\namazing movie. I just watched it for a third time and it just grows and\ngrows. <br><br>The story is so simple and short. Yet it has the enjoyment, the journey\nof a major novel. I personally hate chick-flicks, am more the\naction-adventure type. But there isn't a boring moment in what is\nreally casually paced.<br><br>The cinematography and the acting is so well done as to become\ninvisible, just captivating. One of the few films where I never thought\nof any of the actors being \"them\" playing a part. They are so real.<br><br>A beautiful journey into a world so foreign, yet so familiar to our\ndeepest thoughts.\n"},
{"review": "\nThis movie is the first one I have written a review for, because it is\nthe one that means the most to me.<br><br>No word in the English language can give enough praise to do this film\njustice. I could write a whole book about the significance and meaning\nof every artistic shot, of every remarkable performance, and every\nevent and still not capture the essence of this movie.<br><br>The truth is that this is the most complete portrayal of human emotion\nand interaction I have ever seen. It encompasses every aspect of\nmankind; from jealousy and intolerance, to romance and happiness. Every\nsingle aspect of each scene has a meaning and message, and if your mind\nis open, then this movie will affect you in so many ways.<br><br>On a more technical note, this movie is not only superbly written, but\nexecuted flawlessly. Kevin Spacey gives the performance of the century,\nhitting every nuance of his character with grace and style. In a lesser\nmovie, his performance would have been the sole reason to watch. Yet\nthis is not the case. Annette Benning also shines with her portrayal of\na troubled housewife that is nothing short of Oscar-worthy. The musical\nscore also stands out as a fantastic attribute of the experience; not\noverpowering, yet still just as relevant.<br><br>I could go on and on about the flawless cinematography and lighting\neffects and such. But I can sum that all up in a different manner:\n\"There is no bad aspect of this film.\" Everything works together to\nperfection to provide the most outstanding movie of this age.<br><br>\"American Beauty\" is quite simply the most significant film of its\ntime. Yet this movie also transcends time to provide an emotional and\nthought-provoking experience for years to come.\n"},
{"review": "\nI think that it's safe to say that American Beauty and M. Night\nShyamalan's supernatural-thriller The Sixth Sense were definity the\nsleeper hits of 1999.<br><br>Here Kevin Spacey shows the amazing form that he's been showing for the\nlast ten years, in films like The Life of David Gale, K-PAX, Pay it\nForward, L.A. Conifedencial and Swimming With Sharks. It's also funny\nthat this is called an American Classic when the director, Sam Mendez\n(Road to Perdition), is in fact English.<br><br>Spacey stars as Lester Burnham, a loser who hates his wife (Annette\nBenning- The Grifters, Mars Attacks) and whose daughter (Thora Birch-\nPatroit Games, Ghost World) hates him, whose life changes when he black\nmails his boss, falls for his daughters best friend (Mena Suvari-\nAtomic Train, American Pie 1 &amp; 2, The Musketeer) and is introduced to\nthe world of drugs by his neighbour (Wes Bentley).<br><br>I know wrote in a previous review that I see \"To End All Wars as better\nfilm-making triumph\" and I still stand by that, but you just can't help\nbut to be drawn in to this wonderful movie by the amazing Academy Award\nwinning combination of Alan Ball's screenplay, Mendez's direction and\nSpacey performance.\n"},
{"review": "\nI found out about this film completely by accident but am so glad I\ndid. I had seen the trailer and was not that convinced, what made me\nwant to watch the film was the amazing soundtrack performed mostly by\nThomas Newman.<br><br>I was completely hooked from the beginning and was not bored for a\nsecond. American Beauty really is a masterpiece and probably one of the\nbest films ever to have been made. The film deserves a lot more credit\nfor the storyline and was directed in an amazing way. Everything is\nperfectly timed and nothing drags along, it all fits together in a\ngraceful yet unique way. The characters are all part of the jigsaw that\nthe story unravels throughout the film to an exciting but shocking\nconsequence.<br><br>10 out of 10.\n"},
{"review": "\nSo much has been said about this movie that it's hard to think of what\nelse I could add. I wasn't even going to comment on the film for this\nprecise reason, but then I figured I needed to give my favorite film of\nall time a shout out.<br><br>To start, I honestly believe that this is one of the true masterpieces\nof the decade. This is a beautifully crafted movie on absolutely every\nlevel but it's the use and exploration of character throughout that\nmakes it truly astonishing. I find each of the characters incredibly\nfascinating and very rich. The tagline \"Look Closer\" is spot on because\nthere's always more going on than what you observe on the surface. If\nI'm ever missing the beauty in my own world, this is a great work of\nart to remind me that I don't have to look very far.\n"},
{"review": "\nThis movie is probably one of the greatest I've seen in my entire life.\nEvery character in this movie plays his/her role phenomenal. A movie\nlike this doesn't come around every so often. This movie deserved every\nacademy award that it won (but it did deserve more.) Kevin Spacey plays\nLester Burnham. This is probably one of the greatest acting\nperformances in history. If you saw the movie then you would realize\nwhy I say this.<br><br>The movie has a very dark tone about it. The theme of this movie goes\nmuch deeper than you realize, and explains how beautiful and how bad\nlife could be.<br><br>From Start to finish this is a masterpiece and I strongly recommend it.\n10/10\n"},
{"review": "\n\nWithout a doubt, American Beauty is the most overrated movie I have seen.\nFor those of you who have read Joan Didion, this script smacks of Play It\nAs\nIt Lays.<br><br>What happens when a \"typical\" suburban professional male realizes his\ndissatisfaction with his life? He reacts in an insubstantial and\nunconvincing way. My job stinks - quit my job. I have trouble\ncommunicating\nwith my daughter - smoke dope. My wife is distant and cold - fantasize\nabout\nanother woman. And so on. Yes, it is Mar-eye-ah cracking a boiled egg on\nthe\nsteering wheel all over again (Didion reference).<br><br>Here's the question I really wanted this movie to explore: if, at\nmidlife,\nLester really feels that his life is not what he expected, where does he\nwant it to go, what will he do about it, and can he get away with\nit.<br><br>Sorry, but get religion, join the French Foreign Legion, or start a\nhome-based business. If you're life is a joke Lester, don't make it worse\nby\nbecoming a cliche.\n"},
{"review": "\n\nWatching \"American Beauty\" is like looking into a handful of American lives\nslowly plunging into moral and emotional devastation. Although these people\nare gaining a sincerely fulfilling happiness, they are also slowly losing\ntheir grip on human value and order. This is not your average social\ncommentary, it has something most satires lack; poignancy. On one hand,\nthis\nis a scathing examination of the facades and truths that surround a\nseemingly \"perfect\" suburban family, displaying what it would be like if\neveryone's true colours emerged, as they liberate themselves from the\npainful phoniness that society forces them to live by. One the other hand,\n\"American Beauty\" is a thought-provoking and emotionally devastating\ncharacter study of two families finally achieving joy for the first time in\ntheir lives, unaware of the profound impact they are having on themselves\nand each other, and neglecting the consequences that will inevitably\nfollow.\n\"American Beauty\" shines in almost everyway, from it's stunning imagery of\nbeauty fused with immorality, to it's darkly hilarious script, this is one\nof those rare films that stay with you for a long time. But the main thing\nthat makes this movie soar are the performances, Kevin Spacey and Anette\nBenning are simply sensational as the feuding married couple exploring new\nrealms of life,  Wes Bentley, Chris Cooper, Mena Suvari and Thora Birch\nalso\nshowcase excellent performances. A truly remarkable film.\n"},
{"review": "\n\nI saw this film on a whim and was more than pleasantly surprised. The story\nline is incredible, and rather realistic. Kevin Spacy's acting is\nwonderful,\nas it is all around. I couldn't take my eyes off of the screen. Spacy lives\nthe suburban (as well as my own) nightmare. His character is so believable\nthat I could swear he was me. A wonderful, yet darkly uplifting,\nmovie.\n"},
{"review": "\nAmerican Beauty is a brilliant drama, so powerful and moving. Having\nread roughly what the film was about before I started watching it, I\nwas pleasantly surprised by how multi dimensional it turned out to be.\nThere was much more going on than I expected and all the story lines\nwere interesting in their own way. <br><br>The plot goes much deeper than I imagined and it really is just a\nbrilliant drama. It also has its comedy moments which help the film to\nflow. The cast in this all delivered very strong performances and made\nit seem so real, especially Kevin Spacey. Wes Bentley is also deserving\nof a mention for his portrayal of the very mysterious neighbour. The\nway it ended won't be to everyone's taste but for me it makes it more\nmemorable. <br><br>Overall it is a brilliant drama that I would highly recommend and I\nwould certainly watch again. Top marks from me, one of the best dramas\nI've seen. <br><br>10/10.\n"},
{"review": "\nWith some of the best writing, characters, and scenes ever put to film,\nAmerican Beauty is simply a luscious and beautiful movie. It has so\nmuch substance in it that you could watch it thousands of times and\nnever get bored.<br><br>In all honesty, I wasn't exactly the biggest fan of Kevin Spacey before\nI saw this movie. My overall opinion on him was that he was a so-so\nactor that had his good movies and his bad movies. This film changed my\nmind all together. Spacey's performance is heartbreaking, perfect, and\nmost importantly, realistic. The entire time he is on screen, he\nliterally is just magnificent. Wes Bentley was also captivating to\nwatch, and it's really a wonder that he's not a bigger movie star. His\nperformance in this film was just flawless and incredible. He is quite\nthe scene-stealer, and often outshines some of the other actors.<br><br>Overall, American Beauty was a fantastically good film with some of the\nbest writing around. The movie was moving, realistic, and\nthough-provoking; could one really expect any less from the genius Alan\nBall, who is also responsible for the amazingness that is Six Feet\nUnder. Don't miss this film under any circumstances, as it is by far\none of the most excellent films I have ever seen.\n"},
{"review": "\nOccasionally, Hollywood makes an independent film. This is my case in\npoint. Saw it again last night and didn't realize how many subjects\nthis film actually deals with. Kevin Spacey and Annette Benning are\nterrific as a middle class couple with the perfect life on the surface\nwith the demons slowly poking through the bottom of their false\nexterior. Spacey's mid life crisis is sharp and believable as he\nattempts to change is life, quiting his job, buying a 70's Pontiac\nforebode and working out in his garage as his wife cheats on him with a\nlocal real estate tycoon. His daughter, played by the now grow up Thora\nBirch, is at similar odds as she deals with her creepy next door\nneighbor and her young but sexy friend played by Mira Suavi. American\nBeauty plays like a middle American nightmare, where change is always\nthe best thing.\n"},
{"review": "\nThis film is the most over-rated film i have ever seen<br><br>OK, so people will tell you it is more than what i am about to say, but\nreally, if you think about it, it's not! It's just not!<br><br>This film is about a guy (Spacey) trying to bed his daughter's best\nfriend (Suvari), while his daughter (Birch)is distracted by the\nneighbour (Bentley) who his dad (Cooper) thinks is gay with Spacey,\neven though he is just selling him drugs...while Spacey's wife (Bening)\nis off having bedroom fun with her biggest business rival! <br><br>The only good thing about this film is when Spacey!! The man is without\na doubt one of the greatest actors of all time - he is at least in the\ntop 10, if not 5! Spacey gave an outstanding performance, which was\ndeserved of a more worthy film! <br><br>This film is simple at best, and this is because it tries to be too\nclever!<br><br>There are many more options to chose from if you are stuck on what to\nwatch next time you are in the local video store and this film catches\nyour eye...i have warned you, watch only at your own risk!<br><br>A failure!\n"},
{"review": "\nTragedy meets melodrama meets the fearless hip '90s, following the\nBurnham family as they deal with their first-world problems. Lester and\nCarolyn (Spacey and Bening) are getting older, and both are trying in\ntheir own way to hang on to the last moments of what each thinks is the\nprime of their lives; while their teenage daughter Jane (Birch) is\nhaving issues of her own, dealing with finding her identity and not\nfeeling pretty enough next to her \"friend\" Angela (Suvari). Neighboring\nFits family (consisting of Bentley, Cooper and Janney) work their way\ninto the mix because the son is stalking Jane. A film that speaks to\nthose who have seen a midlife crisis, and is still entertaining to\nthose who have it to look forward to. Oscar-winner is entertaining\nright from the get-go, and is an experience as flawless as a rose upon\nfirst viewing. However, after you've seen it a few times, the rose\nbegins to wilt, unmasking contradictory characters and inexplicable\nevents that unfold just to appease its themes of confinement,\nconformity, redemption and sexuality\u0097why does Lester lecture Carolyn\nabout materialism right after HE's the one that bought a Pontiac\nFirebird? Why didn't writer Ball or director Mendes at least try to\nmake Bening's character slightly redeemable? All the many other\nquestions to raise require spoilers, but the list goes on... Hard to\ncompletely hate because it's easy to understand why so many people like\nit.<br><br>★★½ (out of four)\n"},
{"review": "\n\nSam Mendes was able, in this fine, dark film, to take a tired old theme -\nsuburbia angst - and turn it into something entirely new.<br><br>In addition to the acting - which was so on target on everyone's part -\nMendes' direction, the writing, the look, the colors, the sound track, the\ncamera angles, all were superb.<br><br>Kevin Spacey's Lester, however, centered the film, and gave it, in my\nopinion, the wry life it so needed. Everyone else was so off kilter, so\nnuts, except maybe for the cheerleader queen, that we needed Lester's\ncomments out of Spacey's twisting mouth, looking at Spacey's expressive\neyes, to find the humor in a\ndecent man trapped (most of it his own fault) in a desperate\nsituation.<br><br>Annette Bening, who had a role full of hysteria, handled it so well, that\nyou felt very sorry for her most of the time.<br><br>I was impressed with Chris Cooper in a very different part for him, and\nAllison Janney, who played his wife, could break your heart.<br><br>There were scenes of beauty, and one, in driving rain, full of tension,\ndanger and poignancy.<br><br>All three kids were good too, but it is Spacey's film, and boy, does he run\naway with it.<br><br>I'd say go see it, but don't expect to feel good when you\nleave.<br><br>Murph\n"},
{"review": "\n\nI am Lester Burnham. Well, I'm 42 and I've been married for 15 years. I\ndon't think one has to see themselves in this film to appreciate it, but how\ncan I know? <br><br>One comment I'd like to make as a reader of books about writing--American\nBeauty is a model for how to take derivative concepts, or specific textbook\ninstructions, and make a unique mix that is art for the ages. The film owes\nmuch to \"Sex, Lies and Videotape\"; some to \"Ordinary People\" and \"The Ice\nStorm.\" Others have pointed out that the \"from beyond the grave\" narration\nis not original. Every book on dramatic writing quotes Tolstoy: \"If there is\na gun hanging on the wall in Act One, it had better be fired by the end of\nAct Two.\" And yet this particular blending of these ideas is new. If you've\never tried to create a story or a song and you became frustrated that you\nwere just borrowing ideas, perhaps you'll understand why American Beauty is\nsuch a role model for me.<br><br>It's hard not to become more introspective and more honest with yourself\nafter seeing this movie and I think that makes it great.\n"},
{"review": "\n\nI saw a special preview of the movie tonight. It's true. I laughed. I cried.\nI saw some things there that I never thought would be there. But, nothing\nhit me so hard as the ending until 15 minutes after I had left. I had to\nwalk away from the group of people I was with, because I was so\nflabergasted. I suggest anyone who wants a movie that will *truly* leave you\nmoved (unlike a certain overhyped with movie), I HIGHLY press \"American\nBeauty\" onto you. I will be there many more times.\n"},
{"review": "\n\nI saw American Beauty last night and I can't stop thinking about it. It\nwas\none of the best movies I have seen in quite awhile.\nI don't want to give anything away so I'm  just going to give some\ntidbits.\nThe acting was brilliant. Kevin Spacey was in his best form, I really\nthink\nthis is the perfect role for him. Annette Bening was great, and her hair\nwas\neven better. I'm not real familiar with Wes Bentley, but his portrayal of\nRicky Fitts was spectacular.\nThe direction by Sam Mendes was beautiful. He created such a great feel\nand\nvision it's hard to not want to see it again just for the images. I think\nschools should consider showing this movie to film students to show them\nhow\nto completely create a mood with such few gimmicks. The mood Mendes\ncreated\nmade me laugh and feel uncomfortable at the same time. I guess it was a\nlittle bit like the way we all feel about life itself, which is what the\nmovie is about anyway.\nYou must see this movie if you are serious about film, and you should see\nthis movie if you still like to be moved by a brilliant\nstory.\n\n"},
{"review": "\n\nI saw an early screening of this phenomenal movie and it blew me away.\nThere\nare laugh-till-you cry moments, especially as Kevin Spacey goes through\nthe\nearly stages of his midlife crisis. But the harshness and exquisite\ntenderness of life in all its glory are never far from the center of the\nstory. Anyone with a family will be able to relate to the film.\n\n"},
{"review": "\n\nI saw a sneak preview of American Beauty recently and all I can say is that\nI intend to see it again.  This is a WONDERFUL movie that is worth the\nmoney\nto see in the theaters (the only movie I've been to where half the audience\nbroke into applause during the film).  Kevin Spacey plays Lester, a man\nwho,\nwhile going through a mid-life crisis, begins to lust after a teenage\nfriend\nof his daughter's.  Spacey is, of course, a fabulous actor and really\nshines\nin this role.  There are a few interwoven story lines involving Spacey's\nrelationship with his control freak wife (Annette Bening, who is good if a\nlittle bit over the top in this role) and daughter, and the family next\ndoor, which includes a military general father, a mother who is apparently\nclinically depressed, and a very interesting son who is obsessed with\nfilming beautiful things (including Lester's daughter Jane).  What is\nunusual about this movie is that the plot is not unusual or particularly\nunique--it's a couple of families in an anonymous American suburb and how\nthey relate--but the filming of the movie is absolutely beautiful, and is\ndone in a way that makes the film alternately hilarious, heartbreaking, and\nhorrific.  It is definitely for mature audiences--there is some violence\nand\na couple of frontal nudity scenes (both of which are essential and very\ntastefully done)--but older teens might enjoy it as well.  Be wary of how\nthe media chooses to portray this movie--it may be called a \"black comedy,\"\nbut, while sometimes hilarious, it is definitely a drama.  Go see it--I\ndon't think you'll be sorry.  \n"},
{"review": "\n\nI am the lone soldier who didn't like this movie....and it had all the\nmakings of something I'd really love.\nPerhaps if I'd watched it alone...but watching it with others made me\nfeel a little uncomfortable. Why...I don't know. Possibly because the\nmovie\nopened with a guy jerking it in the shower. I'm not a prude by any\nmeans...but honestly this movie was just a little weird for me.  Call me\nuncultured, lacking in taste...I really don't care. The movie wasn't awful\nor anything....it just made me squirm.\n"},
{"review": "\nSam Mendes' entire film career has consisted of woefully misguided\nattempts to dissect the many ills of American culture without remotely\nunderstanding them. Perhaps he should spend some time slinging his\narrows at Britain's problems before jumping across the pond.<br><br>\"American Beauty\" is a movie about American suburban malaise set in a\nversion of suburban America that simply doesn't exist. Its characters\nare either gross and grotesque caricatures or mere vessels for\nregurgitating Alan Ball's pretentious screenplay, forced to utter lines\nthat never sound like things people would actually say. Kevin Spacey\ngives the consummate Spacey performance -- one-note snideness delivered\nin a sardonic monotone -- that he gives every time he's in front of a\ncamera, while poor Annette Bening is unwatchable in a frenzied\nperformance that I have to believe was forced on her by the director,\nsince she's never again been as bad, either before or since. The worst\nof the film's dialogue is reserved for all of the angst-filled\nteenagers, and most conspicuously for Wes Bentley, a tortured and\nphilosophic youth who reads a ridiculous soliloquy about the beauty to\nbe found in a plastic bag as if he's reciting Shakespeare.<br><br>The film has a weird preoccupation with homosexuality that doesn't\nreally fit and makes itself most manifest in the character of Chris\nCooper, a closeted ex-serviceman who, true to the film's form, is\ndepicted as a goulish representative of conservative America.<br><br>What is the point you ask of all this glib satire? Hell if I know.<br><br>Grade: D\n"},
{"review": "\n\nIt makes no sense that the people at the Academy awarded this movie the\nOscar. Since when have they awarded great movies best picture? Maybe this is\nthe beginning of a new Academy without the corruption that has ruled for so\nlong.<br><br>It was brilliant in every sense of the word, and should not be missed.\nSpecial mention must also be made to the excellent direction,  and superb\nacting from the entire cast.\n"},
{"review": "\nI just saw how highly-rated this movie was on the IMDb top 250 films of\nall-time (I want to say it's in the top 30). This movie belongs in the\nbottom 100. However, I did see this movie only once, and nearly every\nscene was indelibly etched into my memory (I've thankfully forgotten a\nlot of it by now). That's because most of the scenes (including a\nmisuse of shampoo in the shower) are completely over-the-top. The\ndirector should have cut out any dramatic pretenses and went with a\nZucker-Abrams-Zucker comedy concept. Kevin Spacey's character is a\njerk; he loses his job \"unfairly,\" and immediately turns around and\nblackmails his boss. Then, he buys a sports car, smokes \"100% safe\nweed,\" and hates his life as it is, until he re-discovers \"puppy love.\"\nGood for him? Annette Benning's character is all right, the rest of the\ncharacters are stupid, and I forgot Allison Janney was in the movie.\nQuestion: in real life, is the \"boy next door\" who acts like a real\ncreep actually the wisest person in the world who knows \"what's it all\nabout?\" Oh, he's also the coolest drug dealer in town. Yikes! pass me\nsome G-13. There really are only two good segments: Lester in the\ndrive-up window, and Lester with the R-C car. That's about 3 1/2\nminutes worth of movie. Were there plot twists? Maybe, but none of them\ncreated a story that I cared about.\n"},
{"review": "\n\nThis film suffers from the same problem that much of current pop culture\nsuffers from.  It coasts along, only working as a narrative if you assume\nall the cliches the film displays to be true.  From the power-driven\nmother\nto the closet homosexual, there's nothing here original, interesting, or\neven vaguely accurate.<br><br>Beautiful photography can't cover an ugly world view.  Avoid this\nover-hyped\npile of trash.\n"},
{"review": "\nEvery time I see a plastic bag, flying through the air, I have to think\nabout this film, \"American Beauty\". Although I wouldn't say it's one of\nthe greatest films I've ever seen, it left its marks on me. <br><br>The story about an ordinary American family in an ordinary American\nsuburb with ordinary American jobs, whose whole life turns upside down,\nwhen the father, Lester Burnham (Kevin Spacey), falls in love with the\nbeautiful friend (Mena Suvari) of his daughter Jane (Thora Birch),\ntherefore recognizes his rotten life and tries to change it, plays with\nthe idea of the American Dream and uncovers its unreality. <br><br>When Lester masturbates in the shower (and the marital bed!), when his\nwife Carolyn (Annette Bening) totally freaks out, because she's not\nable to sell a house (real estate!) and their daughter Janes only\nproblem is how to get enough money for a boob job, everyone starts to\nthink about the \"behind the scenes\" of every all-so-lovely, perfect,\nsuburban family. This is probably what director Sam Mendes intention\nwas, when he exaggerated both camera work and dialogs. Because when the\nneighbors's boy Ricky (Wes Bentley) starts to philosophise about the\nbeauty of a plastic bag dancing with the wind, it's on the edge between\ncraziness and truth. But by using this concept for the whole film\nMendes created a worth seeing spectacle, fitting every film evening.\n"},
{"review": "\nOf course I heard about this praised and many awards-winning movie\nbefore is saw it, so I was curious about seeing it to find out whether\nit is worth it's high rating. And as I nearly expected, it's worth it.<br><br>After a short foreshadowing on one of the most telling scenes of the\nfilm, the action begins with an overview on the ordinary life of Lester\nBurnham, the main character, who tells his story from his own grave. He\nis a 42-year old add-writer who is bored and annoyed of his life. His\nwife Carolyn, a very stressed and dainty career-addict and his daughter\nJane, a highly depressed and ordinary teenager can not change his view\non his life either, they only make his life even worse in his eyes.<br><br>His coma-like perception of his life changes all of a sudden when he\ngets to meet his daughter's sexy and willing friend Angela, who makes\nLester get foolishly obsessed with her. Driven by his will to attract\nher, Lester begins to change his life by starting to work-out, quitting\nhis job and go back to his teenage roots, which means smoking pot and\nwhile listening to rock music.<br><br>But Lester is not the only character who changes his life and mind\nduring the film. All the characters go through an interesting\ndevelopment of character traits, so do Carolyn and Jane, and even the\nweird neighbor family of a freaky Boy called Ricky and a brutal and\ncold military man who is his father.<br><br>Sam Mendes really knew how to make this movie a brilliant one. The\ncharacter's development is worked out very well. The way to their\nchange of mind is understandable and surprising at the same time. The\nenvironment they life in really seems to show the reality of the\n\"normal\" American everyday life who sometimes tries to get one down,\nand the movie shows the way the characters try to fight against it.<br><br>So what is left at the surprising end of the amazingly profound movie\nis the realization that everything is not what it seems.\n"},
{"review": "\nBefore seeing this movie I had a lot of expectations, because everyone\ntold me this would be a great film experience. Honestly I didn't really\nknow what was expecting me, so I was looking forward to an unique\nexperience. As I heard we would watch this movie in our English class,\nI remembered my former expectations and couldn't wait seeing it.<br><br>And with the first second of this awesome movie I was touched and began\nto believe all the good words I heard before. At first American Beauty\nseemed to lead into a kind of Comedy performance as far as the\natmosphere was presented as an ironic one. At this place I have to\nhonour Spacey's excellent acting and credibility. He was able to make\nLester Burnham, a midlife-crisis bothered and even lovely typical\nAmerican dad, the most likely character of the film. This impression\nstayed until the very end of the film and his life.<br><br>At this point it's time to appreciate the other cast as well and\nespecially the Burnham family members. Due to Bening's and Birch's\ncredible and strong appearance, the film got this dark and special\ncharm. Another highlight, like Lester's morning shower for him, was\nMena Suvari as Jane's seemingly extroverted, but actually very shy\ngirl, with a huge crush on Mr. Burnham who reciprocates this\nattraction. But although every actor and actress really impressed me,\nno one could reach Spacey's top performance.<br><br>And as if this weren't enough, cinematic genius Sam Mendes stages this\nevery single Oscar worthy masterpiece with an ironical dark touch.\nEspecially the end with all the excitement and electricity in the air\nis a real highlight in movie history. Together with some other little\ntreasures like the symbolic roses, make it a treat.\n"},
{"review": "\nThe general theme and concept of the screenplay closely parallel\nHemingway's story, \"The Short Happy Life of Francis Macomber\". Inner\npeace and strength, respect of one's self, and becoming a whole person\nindependent of the actions and influences of others... might come late\nin life, but never too late. Burnham, like Macomber, \"finds himself\"...\nalthough he does not live long to enjoy it. Nonetheless, this change\nmeans he still wins in the end.<br><br>There are other similarities between the movie and the story. It is\nworth reading... one of Hemingway's best.<br><br>Not casting aspersions on the screenwriter here, but in general, it's\nobvious some of the best literature gets \"farmed\" for new work. Rear\nWindow was just about plagiarized from H.G. Wells' short story \"Through\na Window\". There are countless examples.\n"},
{"review": "\n\nAmerican Beauty is one of best 90's movies.<br><br>This movie shows us people like us. But what do we do? We \"ticket\" the\ncharacters.\"You're the loser, you're the drug user, you're the conservative\ncolonel, you're the bitch\" and etc. We are wrong.Yes, they are ordinary\npeople, but they're not we think they are, they have conflicts ,they have\nfeelings, they are HUMAN! And different.\nWe think we know them: Lester , Carolyn, Colonel Fitts; but the movie\nsurprise us with a great image of the society we live. In this image we can\nsee, Lester, Carolyn , Colonel Fitts and... us!\nTo see this movie is a great experience, because it makes us think about\nour\nour lives using themes like hypocrisy, marriage, sex and\ndrugs.\nAll of it is put in the movie with a marvelous cinematography, a tense\ndirection by Sam Mendes and a disturbing screenplay by Alan\nBall.<br><br>**** of four!<br><br>\n"},
{"review": "\n\nAre the sixties back?<br><br>                                                            That's the\nimpression you get after seeing\n                                                            \"American\nBeauty\", because there is a sense of\n                                                            morality based\non spontaneity as salvation, or a\n                                                            'Hurry up,\nbrothers, there's still time to rethink\n                                                            and recover'\nattitude. And a somewhat hidden sense of a\n                                                          generation gap, so\ndear to the hearts of people\n                                                            born in the\nforties, who were in their twenties by\n                                                           \n1968.<br><br>                                                            A great script!\nAnd don't forget that the\n                                                            scriptwriter was\nborn in 1957.\n"},
{"review": "\n\nThis one of the movies I have liked the most. It´s outstanding. It lets you\nspeechless. One feels so stupid, so guilty, after it. It shows clearly that\nyou can make your life nonsense so easy, following the \"american dream\"\nlifestyle.<br><br>It touches your soul, really. It's full of fool and nasty things in a too\nclean, \"smiley\", world. It examines the american paradigma and gives a\nwarning alert.<br><br>I loved the dancing bag scene. It was, for me, really \ntrascendental.<br><br>For me, that live in a South American country, it made that I appreciate\nthat we still have feelings, and that we're still a romantic, somewhat\ndreamy world, thanks to God.\n"},
{"review": "\n\nBelieve me, I've seen a lot of movies (each year a try to watch about 200\nfilms I have not seen before), but American Beauty surpasses everything.\nIt's the best picture I've ever seen. I never before focused on one single\nfilm as my favorite (there were always about 1,000 fav films), but with\nAmerican Beauty it is different. It's just perfect, brilliant, marvelous,\ndivine. Every single frame is adorable - and yet, it's so simple - there\nis\nno need for hoards of extras, for elaborate sets or meaningful events in\nthe\ncourse of the story. Just a few strange people, people just like us. This\nfilm features some of the best acting performances ever to be seen on\nscreen, esp. Kevin Spacey, Annette Bening, Wes Bentley &amp; beautiful Thora\nBirch. Witty &amp; intelligent dialogue that's rare in today's cinema, and the\nstructure of Alan Ball's script is just perfect - the best plot narration\nI\ncan imagine. Marvellous cinematography - one of the rare pictures in\ncurrent\ncinema that denies fast-paced camera moves, but instead just sits there in\nstatic images that tell you so much more than every camera move ever\ncould.\nI'd like to say more about that film, but my breath is still taken from\nwatching it the fifth time last night. Besides, I fail further words that\ncould describe it. It's just masterly accomplished regarding any\naesthetics,\nthe contents, the acting, the photography, the editing, the story, the art\nin itself...<br><br>A grateful bow to first-timer Sam Mendes and his crew.\n\n"},
{"review": "\n\nI know this is comment no. 940, but what the hell.<br><br>American Beauty is in some ways the antithesis of the equally brilliant\nFight Club. Both concern men with their best years behind them, stuck in\nmeaningless, middle-class jobs, who embrace extreme behaviour in an attempt\nto recapture meaning in their lives, with fatal consequences. Fight Club is\nthe more dangerous, more radical and ultimately more nihilistic side of the\ncoin. American Beauty is on safer territory, but its ultimate vision of the\nbeauty of life is more affirmative and uplifting. Both films are\nmasterpieces in their individual ways, but it says something about Hollywood\nthat American Beauty will probably win the Oscar, whereas Fight Club\nprobably won't even be nominated.<br><br>On top of this, one can only marvel at the performances, at Thomas Newman's\nwonderful and memorable score, at Conrad Hall's glowing photography, at the\npoised and profound script, and at Mendes's loving direction, his debt to\ntheatre immediately obvious. The plastic bag sequence had me in tears. If a\nfilm leaves me feeling, as Ricky puts it, that God has looked straight at\nyou, then I give it a 10, whatever its flaws. Like Good Will Hunting, this\nfilm transcends cinema and touches your life, without ever stirring your\ncynicism. For that reason alone, American Beauty is a triumph.\n"},
{"review": "\n\nWith it's razor sharp wit and biting satire this movie drags you into it's\nmurky depths and has you rolling in the aisles. Sam Mendes was smart when\nhe\nwaited so long to jump into film. 'American Beauty' has beautiful\ncinematography, editing that screams along with the pacing, tremendous\nacting, and a wickedly funny script. Best Picture of the year... no doubt.\nBest Picture of the decade... possibly. It's been called the definative\nmovie of the '90's and I can't help, but agree.\n"},
{"review": "\n\nI saw this movie at a free preview screening and was just stunned. Truly\nawesome performances from all the cast lead to a fantastic\nmovie.\nBut the main, show stealing performance falls to a plastic bag. You'll see\nwhat I mean.\n"},
{"review": "\n\nRight now I think this may be the best movie I've ever\nseen.\nIt has some of the same elements as The Dead Poets' Society,\nIce Storm and Fight Club, but I liked it more than any of\nthose.<br><br>But those are just comparisons, and I don't think this\nmovie copies from anything that much, like some people\nhave\ncommented.<br><br>The story is rich, so much better than all the calculated\nHollywood stuff. <br><br>This movie contains stuff that might offend some\npeople, but I found those parts very good.\nDespite some elements that warrant the R-rating, this movie\ndoesn't have anything 'cheap' in it. The story definitely\ntakes a fresh view on things!<br><br>And I didn't think this movie was 'sad' or 'tragic' at all, just incredibly\nbeautiful!<br><br>I recommend this movie to pretty much everybody, but especially\nfor the people who get bored with how similar\nmovies often are to each other...<br><br>\n"},
{"review": "\n\nHave to sort of echo earlier comments.  This movie was Beauty-ful in many\nways.  I went in cold, not knowing what to expect.  Spacey, Bening, and\nreally the entire cast, were outstanding.  The camera work was a\nrevelation.\nThe story, great.  I was dumbfounded walking out of the theatre, and still\nmostly dumbfounded now, four days later.  Go see it!\n"},
{"review": "\n\nWow.<br><br>This is film at its peak, I left the theater awed, and I don't doubt I will\nhave an incredibly difficult time ever finding a movie that surpasses\n\"American Beauty.\"  It bears repeating:<br><br>Wow.\n"},
{"review": "\n\nLet me just say that one rarely sees a movie with a perfect cast.  Here it\nis.  Spacey and Benning give career defining performances in what is hands\ndown the first real Oscar/Golden Globe contender of the year.  In addition,\nthe supporting cast (if one can call them supporting) is fabulous especially\nthe drug dealing neighbor has these piercing eyes that make you hang onto\nhis every word (just like Hopkins in Silence of the Lambs).<br><br>The movie itself is a tightly constructed narrative that can really speak to\nthe viewer if he wants to listen.  In a miserable, routine existence find\nsomething - ANYTHING - that will make you truly happy.  It's relatively\nstraightforward.<br><br>When seeing this film, note that it is a first effort from the director who\ndoes an amazing job.  The visual symbolism and the mise-en-scene is\noutstanding.  This is quite possibly the best freshman attempt at filmmaking\nsince Frank Darabont made The Shawshank Redemption.\n"},
{"review": "\n\nbrilliant dramatic comedy is  the best picture of the year so far.Annette\nBening is great while Kevin Spacey is brilliant as the middle aged father &amp;\nhusband.Film has great direction while the movie has disturbing depiction of\nsex.Thora Birch is impressive as the daughter.I'm betting money on this\nmovie to nominated for best picture and other nominations.<br><br>Rating:***** (out of five) \n"},
{"review": "\n\nAmerican Beauty is a wonderful film, full of rich, moving symbolism, and\ndeep reflective moments.  It is the kind of film that European film-makers\nproduce more often than American ones, although American culture is in more\ndesperate need of this form of art than our overseas cousins.  The ultimate\nindictment of an emotional bankrupt society.  10/10\n"},
{"review": "\n\nan amazingly inciteful, painfully  honest script remarkably acted by such a\nsymbiotic inspired cast  of \nserious actors who inhabit the world of the directors vision\nseamlessly...production values and editing \nare flawless as well as an extraordinary music supervisor and score who\nknows when to hang back or \ncrank up with out overpowering as if it were in another film...the\npenultimate black comedy to close this \nmillenium..\n'dangereuse laisons' meets 'heathers' meets 'cruel intentions' 'ridicule'\nand 'to die for' with a touch of \nlarry kasden!<br><br>we will see a touch of us all in this bitter and twisted\n"},
{"review": "\n\nThe movie American Beauty is probably the best movie that i have seen all\nsummer.  The movie is very deep in much of its meaning while it still is\nable to be enjoyed at face value.  I believe that Kevin Spacey performed his\nfinest performance since the usual suspects, and this is a definate\nreflection on the ability of the rest of the cast.  Not to mention that this\nwas a very well directed movie in that it showed the life of the average\neveryday family in a twisted view, which to some extent is an accurate\ndepiction of the people in the society.  If you see this movie though, I\nwill warn you that the movie is not exactly for everyone based on content,\nbut there was a lot that can be learned in this movie.  If I were to compare\nAmerican Beauty to any movie, I would have to cross Falling Down, together\nwith war of the roses and to some extent some American History X, but this\nmovie is unique in what it has done.  I hope that this picture, like Pulp\nFiction in 1994, is nominated for best picture, because this movie was\nbrilliant in every way.    \n"},
{"review": "\n\nBig High Five to the Spaceman.\nHuge.<br><br>Like good hand cream, this movie starts sinking in right away and lasts for\ndays.  Sophisticated. Smart. And thoroughly entertaining. <br><br>Spacey Rules! (and masturbates furiously)<br><br>You'll laugh, you'll cry, you'll dream of nubile cheerleaders.  Go see this\none, and buy some hand cream.\n"},
{"review": "\n\nI saw this movie at a screening in Los Angeles on 9/8/99.  The director and\nstars were available for half an hour after the movie for a Q&amp;A session. \nOne thing that I found interesting was that the movie's budget according to\nthe director was only $15 million.  (That, and the plastic bag scene was\nfilmed by the director with his own home video camera in a parking lot\nsomewhere in L.A. - by himself!)<br><br>Although this movie has a lot of humourous moments and scenes that are\nobviously designed to make the viewer laugh, it is first and foremost a\ndrama.  Artistically filmed (sometimes with characters looking directly at\nthe viewer and narration giving plot points away) this film is very unique. <br><br>It truly takes the viewer into the lives of its characters.  There is more\ncharacter development in this movie than in most any other movie you have\nprobably seen.  <br><br>Annette Bening portrays her character perfectly.  Her acting is, as usual,\nsuperb - but the character really isn't too meaty.  Mena Suvari and Thora\nBirch play their roles perfectly, also.  We truly grow and learn about life\nthrough Kevin Spacey's character's eyes.  <br><br>The true surprise, for me anyway, was Wes Bentley.  The audience is taught\nto see beauty through his character.  If you thought you knew what beauty\nwas - or how to live life - then you will learn again.  Everybody, I hope,\nhas felt what the character Ricky has felt (the pure joy of witnessing raw\nbeauty) - but he describes it in words and shows you with expressions so\nthat his wonder at true beauty is a visual representation of what you know\nto have felt inside you.  <br><br>You will walk away from this movie touched inside.  Let it teach you\nsomething about how to live life and how to appreciate true beauty. \n\n"},
{"review": "\n\nSince others have summarized the plot, I'll just put in my two bits. <br><br>I got to see this film on Sept 8 at a preview showing for \"college-age\nadults\" (though I'm a bit older) at the Mann Bruin.  The film itself is the\nbest I have seen this year - a drama with humor, excellent acting, an\nuntouchable script, a the capability to leave its audience in thought about\nlife issues that we should reflect on more often.  The director, producers,\nand four of the main actors (everyone except Annette Bening) took questions\nafterwards (most of which were quite disappointing non-questions and\nstar-induced, voice-quavering pleas for autographs or hugs).  The entire\naudience was quite animated throughout, clapped enormously at the end, and\nenjoyed themselves tremendously.  I think audiences across the world are\ngoing to find themselves clapping at the end of this film - something we\ndesperately need more of from Hollywood.  <br><br>Also note, (a) the producers mentioned that they made this film for approx\n$15 million dollars - quite an accomplishment, and (b) this is Mr. Mendes'\nfirst film directing effort - he will be deservably lauded for this work. <br><br>Those involved with film have reason to be proud.  It reasserts my (failing)\nbelief that there is still genius in Southern California, on\noccasion...\n"},
{"review": "\n\nThis is a strange and engaging movie that one must see with others in order\nto have someone to discuss with afterwards, similar to another great film\nfrom this year, \"Election.\" The acting is top-notch, and expect one or more\nto be nominated for a Golden Globe and/or Academy Award, and possibly an\naccolade for the movie itself as well. It's deservedly rated R for some\nlanguage and sexual situations, but doesn't go overboard with either.\n'American Beauty' makes no attempt to preach a moral nor would one work\nbecause we are seeing the most extreme of every personal and family\nstereotype, and very humorously in many cases, heavy-handed in others. An\nadditional plus is the music, which uses deep bass in conjunction with\nsubtle piano strokes to create a black comedy atmosphere for the ages. \n\n"},
{"review": "\n\"American Beauty\" is a pure cinematic triumph that is both funny and\nsad. It's disturbing... and yet, it's extremely provocative and deep.\nThe film is an extraordinary achievement that reveals a tragic and\nrealistic story about a family that is anything but ordinary. It's a\nfilm with so many layers that it is almost impossible to dissect them\nall in one single thought.<br><br>Meet Lester Burnham; a man who feels like he's completely dead inside.\nHis wife and daughter despise him and do not show him any signs of\nrespect. On the surface, the family seems like a picture-perfect family\nthat everybody dreams about--but inside is a completely different\nmatter. His wife is obsessed with material possessions and doesn't care\nfor \"petty\" things like love or life, while his daughter resents\nherself because she isn't \"perfect.\" Lester's mental coma is rudely\ninterrupted when he meets his daughter's friend and starts fantasizing\nabout her. The awakening might be due to a disturbing thought or\nfeeling, but the wake-up call changes Lester and allows him to realize\nthat there's always time to erase his \"forced-image\" and be the person\nhe really is. This is all a set-up for a funny, disturbing and tragic\nmovie. I don't know about everybody else, but my mind was literally\nracing around when this movie was playing before my eyes. It's one of\nthose films that allows you to pick up on something different upon each\nviewing.<br><br>Overall rating: 9 out of 10.\n"},
{"review": "\nOne of the best movies I've seen, probably the best. It has it all,\ngreat acting, great director and a magnificent story. I like all of it.\nKevin Spacey did a great job acting in this movie, if I may say that\nthis is his greatest performance on screen. Comedy parts of the movie\nare brilliant, especially the dinner argument I laughed so hard\nwatching that scene. Music on the beginning of the movie is one of the\nmost recognizable soundtracks of all time, I played it over and over\nagain a thousand times. You could watch this movie a thousand times and\nnever get bored of it. This is my very first review so excuse me for\nthis amateur review.\n"},
{"review": "\nAmerican Beauty is a romantic comedy that doesn't suck, which is a nice\nbreak. It follows a man stuck in an unhealthy relationship with his\nwife and eventually falls in love with his 16-year-old daughter's best\nfriend. It's an unconventional love story, and it's done beautifully. <br><br>The plot is great. It's presented in a very comedic way and it's\nactually very funny. It's interesting and realistic, which is a little\nsurprising, but nothing ever felt out of place. The subplot is also\nvery good, and while I think we've all seen it before I think that it\nwas the more relatable and serious of both plots, which created a\nreally nice balance of both fun and seriousness.<br><br>The characters are quite good too. You have a good idea of who they\nare, and they aren't horribly far-fetched either. All of them were\nflawed people, but not so flawed and that they were obviously fake. A\nlot of them, especially Kevin Spacey's character, were very likable as\nwell. <br><br>Like I already said, the movie is very funny. But all the humor is done\nin a very natural way. During character conversations they might say\nsomething funny, but it's part of the conversation and further develops\ntheir character as well as furthers the conversation, so it exists as\nmore than just a joke. <br><br>Overall American Beauty is fantastic. The plot and subplot are very\ngood, the characters are great, and it's incredibly funny without\nfeeling forced. In the end I wouldn't hesitate to recommend this movie,\nso long as you're willing to be wowed.\n"},
{"review": "\nThe first time I saw this movie, I thought it was a very weird movie.\nThe experience quickly faded off, although I that boy-who- records's\ncharacter intrigued me a little. Yesterday, I chose to give this movie\nanother watch and I couldn't emphasize enough how drastically my\nopinion has changed. <br><br>The second watch helped me form a better view about this. And if it is\nanything to go by, I believe it is one hell of an anti- establishment\nmovie. Almost all the characters are, although seemingly \"normal\", are\nliving pathetic lives- all except the boy- who-shoots. It is revealed\nlater on why he is way ahead of all other characters in terms of\nappreciation of \"beauty\" as he calls it. The film showcases a drastic\ntransformation in the lives of every character. The facades come\ncrumbling down. All the tightly- knitted culturedness, normalcy's,\nbelief-systems come apart as characters discover how pathetic all their\nlives are. The younger generation is more open to changes, the elders-\nthe more they resist change- the more frustrated they become. Meanwhile\nit is revealed that the most straight-jacketed (in terms of\nconservative notions like homosexuality, marriage, discipline) is a\nsecret admirer of fascism and the most sorrowful character. Slowly, as\nall the characters let go and accept their natural feelings, instincts,\ndesires- sometimes bordering on scandalous- they feel better, relaxed,\nhappier. All but one is transformed. <br><br>The film describes how heavy orthodox beliefs can get, how they have\nthe power of consuming people's lives, harming people. The film, for\nme, is an acute critique of all means of classifying things into\nbinaries. It endorses a more tolerant view of life and portrays the\ninsidious nature of judgments. I loved it and would watch it again,\nsoon.\n"},
{"review": "\nThere are few movies that leave me speechless when the closing credits\nroll. This was one of them.<br><br>The acting was near impeccable by basically every cast member. The\ncinematography was very tasteful and delicate. The story was hilarious,\nhaunting, and so beautiful. <br><br>Along with the many other habits and lifestyles that are generally\nlooked down upon shown throughout the movie, such as stalking,\nhomosexuality, physical and verbal abuse, vanity, and insecurity, this\nmovie makes Lester Burnham's lust over a 16 year old girl feel\nextremely human and almost justifiable. The characters' realness made\nme question the morality of a lot of tough subjects.<br><br>When I heard about this movie, I didn't really know what to expect, but\npart of me thought it would just be an entertaining movie about Kevin\nSpacey being attracted to his daughter's friend. This movie was so much\nmore. <br><br>The tagline, \"Look closer...\" sums up everything about the movie\nperfectly.\n"},
{"review": "\nI was honestly amazed at how beautiful this movie came out and have\nbeen trying to find a movie similar in feel but all fall very short.\nThis movie is simply extremely unique and makes the viewers really see\nthe different perspectives of lives that cross each other. It is chaos\nin the most beautiful way. I didn't expect the plot to be ever so\nentertaining. Every shot was honestly beautiful and the soundtrack is\nheavenly; so well put together and I honestly recommend for any type of\nview who enjoy movies which make you think. Even to a certain degree\ndid I feel that we were living through the characters and it just\ngenerally had something to say on the nature of man.\n"},
{"review": "\nYou may read the little summary on the film up above and look at the\nmovie poster and make assumptions about this movie, but the description\nis misleading. I know it was for me because when I finally watched the\nmovie I was pleasantly surprised. This is one of those few movies that\nyou will remember what you were doing while you watched it. The main\npoint of the movie is not directly tied to the description up above -\nit is something that you will figure out for yourself..if you watch the\nmovie. American Beauty is a breed of movie all its own, and should be\nwatched with care- however silly that sounds. Overall, just watch it.\nKevin Spacey's narration is perfect for this movie and he really adds\nto his character.\n"},
{"review": "\nAmerican Beauty is the epitome of perfect emotional cinema. It boasts\ngreat direction, screen writing and performances all round, making it,\nin my opinion, one of the greatest films ever made.<br><br>The story follows Lester Burnham, a man who seems to have lost all hope\nin life, as he is stuck in a joyless marriage and has trouble\nconnecting with his teenage daughter. This all changes when he meets\nAngela, his daughter's best friend. From then on, Lester decides to\ntake back control of his life. The question is, how will it affect\nthose around him?<br><br>Kevin Spacey gives a career defining performance and once again nails\nit as Lester, a man so fed up with life that he needed a radical\nchange. The evolution of the character is done to perfection and\nSpacey's Oscar winning work is the proof. All other actors do their\nparts in great fashion as well and make the movie even better. With\ninspired performances like these, the film only gets better with a\nmagical combination of Alan Ball's script and Sam Mendes' debut as a\ncinematic director. Among other things I love about this film, I can't\ngo on without mentioning the heart wrenching soundtrack that pulls out\na wallop of emotions.<br><br>American Beauty is a wonderful, yet ultimately tragic tale of how\npeople can hide their true selves. However they choose to change, one\nthing is certain: it will affect everything in the status quo. Lester's\nstory is the example of that and it is one that I will heartedly\nsupport every time I watch this movie.<br><br>Rating: 10/10\n"},
{"review": "\nWhether you like it or not, you always watch a movie with an\nexpectation. I didn't know much about this movie, and expected a sleazy\nand cheap flick about a horny old man. I have to say - I got a lot more\nthan I asked for. I got a movie so filled with life lessons, so rich in\nso many ways, that I think it spoke to me. I loved the characters in\nthis movie. The one that sees all the beauty in the world. The\nfrustrated middle-aged man that is not happy with his life. The tough\nguy that does not know how to handle the social situations and problems\nhe and his family is facing. I loved the music. I loved how it told\nsuch an important story with at times comedic means. Although I might\nhave preferred a different ending, it still felt right.<br><br>I don't know if you will like it. You might well hate it. It probably\ndepends on your expectations. I know one thing for sure, though: This\nmovie is the work of spectacular minds. It is a movie for people that\nlike to think. And if you did not think before you started it, I bet\nyou will when you are finished.\n"},
{"review": "\nWell worth seeing, especially if you're a Kevin Spacey fan. Different\nthan I expected, but fantastic. A lot of character development through\nout, where as I was expecting most to be focused on Spacey, a lot was\nspent on all characters which makes the movie all the better. You will\nnot be disappointed if you decide to watch this movie. Very complex\ncharacter interactions. Some odd/creepy parts but I think that it gives\nthe movie its interesting touch and willingness to cross some lines\nmade it unique. Along with Spacey, Chris Cooper also does a fantastic\njob and plays his typical character as a strict military man. Annette\nBenning also was fantastic. Great movie.\n"},
{"review": "\nI don't understand on what basis academy awards are chosen! i began\nwondering after seeing this flick. I kinda felt it is a no-brainer, or\nperhaps heavy brainer so that ordinary mortals like us can't\ncomprehend.<br><br>A man who is frustrated with his life and family members is infatuated\nwith his daughter's friend. In pursuit of boning her, the person tries\nheavily and begins to change his life and his attitude from being\nbovine to being able to voice out his interests and opinions. The wife\nis a real bitch who cares only about her career and doesn't give a hoot\nto anything else.<br><br>All the characters except a few appears to be from mental asylum.\nProbably they shared the neighborhood with the people who recommended\nthis one to Oscars!!<br><br>I give 5 for this , 3 for Mena's face and body, 2 for the rest :-)\n"},
{"review": "\nThere is a motto which too often is over used by many which goes \"It's\nWhat Every Man Dream's of.\" The film American beauty is one such basis\nfor that foundation. In this story Kevin Spacey plays Lester Burnham\nwho is a burned out magazine salesman and after fourteen years, suffers\na a mid-life crises. With his bosses planning to down-size him, his\nwife and daughter abandoning him and his future becoming mundane,\nLester feels he is stuck in a dead-end life with nowhere to go but\ndown. However, into this spiraling, bleak existence enters, youthful.\nteenage Ricky Fits, a next door neighbor who teaches him that life does\nnot have to be taken so seriously. To add imagination to this idea he\nis further captivated and sexually tempted by beautiful Angela Hayes\n(Mena Suvari) who encourages his admiring, lustful stares and fertile\nday-dreams, creating a Lolita like romance. However, situations in his\nlife cause Lester to become unaware of the murderous dangers arising\nfrom his neighbors, adulterous wife and patristic daughter, so much so,\nthat what he sees as freedom, others consider destructive family\nthreats. The film, with it's rich dreamlike sequences is destined for\nClassic status and that which we consider dreams are the primary\ningredients for this awesome movie. ****\n"},
{"review": "\nThis is truly a classic movie for those people who appreciate real art\nwhen watching films. The movie is basically all about the lives of\nAmerican suburbanites but put in a very realistic way. This is a great\npsychology movie because it shows a large amount of information on\ndevelopmental processes. The acting and the dialogue in the movie are\nof course the best part. The movie is primarily based on Kevin Spacey's\nrole which he captures and absolutely stunned me when seeing him. Wes\nBently was also very good. It's his script that really moved me and\nmade me think hard about life after hearing some things he said. It's\ntruly a wonderfully well made movie. A good drama and good thing to\nwatch for those of you studying psych in school.\n"},
{"review": "\nthis movie is as moving and insightful as a fart. the director and his\nactors have no grasp whatsoever of the human condition. instead of\ngiving an accurate or interesting snapshot of humanity they chose to\ncreate some sort of suburban nightmare and allow a bunch of hateful and\ninhumane people inhabit it. the scene wherein the paper blowing around\nis filmed and called \"beautiful\" by one of the \"actors\" in this flick\nsums it up for me. i.e. if you call it beauty, then people will want to\nfawn over, look and act like it. in this case, and in the case of the\nmovie, it was just trash. you and i were scammed. and the academy did\nits usual part by praising this garbage to the sky. only in the case of\ntitanic has a movie been less deserving of an award.\n"},
{"review": "\n\nBy no means a bad movie, AB is nevertheless a film that suffers from it's\nown self awareness.  One cannot help but feel preached at much of the time\nwhich, at least for me, grew wearisome.  The stereotypes are irksome, as\nwell.  This movie joins the long list of \"Oscar winners\" that were not the\nbest picture of their year.  \n"},
{"review": "\n\nA  man who is lonely as a cloud, makes every effort to obtain spiritual\ntranquility through a hollow wedlock and a world made of steel and\nstone.His\nheart is painted  blue.Each day that goes by is nothing but one new pace\nto\nthe finish line of his lifetime.His teenage doughter(Jane) doesn't love\nher\nanymore and his frustrated wife(Carolyn) only feels affection for her\njob.There is nothing new under the sun for him,Until the day that one girl\nturns his world upside down and this crush sparks the flame of love inside\nhis monotonous reality.The girl is his doughter's friend Angela.To Lester\nshe is the essence of his life and he starts building castles in the\nair.Tempted by her prettiness he resolves to commence a new living.Where\nhe\nhas been unsuccessful in the side of social and family liability, he has\nbeen victorious in reawakening the inner self of his youth.But this\nfeeling\nof rejuvenation doesn't remain alive for a long time and he departs just\nwhen he has perceived the true meaning of life.\n\n"},
{"review": "\n\nThis film surrounds more than just one man,It includes all of those lonely\npeople who live in this loveless world.<br><br>American Beauty is a film that will not turn on people who are squeamish or\nthose who don't want to come up against factual topics,It is for those who\nfind pleasure in films with profundity and abstruseness.<br><br>A great film like The American Beauty shows that there are yet touching\nmovies that come out of Hollywood. \n"},
{"review": "\n\nA transcendant, beautiful film about suburban decay circa late 1990s. Dark\ncomedy mixes wonderfully well with serious drama, creating a dreamy though\nrealistic narrative sprinkled liberally with fantasy. Spacey has never been\nbetter; his range and delivery are amazing. Equally deft supporting work\nfrom Bening, Suvari, and Cooper, with Birch and Bentley creating a lovely,\nnuanced young couple that is rooted in their individual and collective\nuniqueness. A fiercely strong debut for director Mendes.\n"},
{"review": "\nI have to agree with those IMDb reviewers who simply cannot understand\nhow this movie won the Best Picture award or for that matter, how it is\neven considered a good film. It's nothing more than an overblown,\nexaggerated view of a dysfunctional family set to the backdrop of a\nsuburban lifestyle that, for the most part, seems totally unrealistic.\nWhile Kevin Spacey usually turns in consistent performances (although\nhe always seems to play rather offbeat characters), I felt his\nperformance here was very weak. He plays a middle-aged man going\nthrough his midlife crisis period but to me, just seems unconvincing.\nEven Annette Benning's performance seemed way below par. Quite frankly,\ndefinitely not worthy of Best Picture and not one that I would want to\nown.\n"},
{"review": "\nI've seen this one a few times before, and I never liked it as much as\nI did the first time; that probably had something to do with certain\npositive circumstances I can't go into here. In any case, 'American\nBeauty' has a couple of fine scenes that always greatly amuse me. You\nknow, Angela's dance, the dance of the plastic bag and Jane and Ricky's\nintimate moments for instance.<br><br>At many other moments, though, I wish Sam Mendez had toned it down\nconsiderably. Now it feels much like an over-stylized pastiche of\nconcentrated misery with too many angles (i.e. characters). A lot of\ndialogue (and monologue) feels too contrived, as does the whole story -\nthough some of it works really well, I must add. So I can't say that\nit's a bad film, but for a black comedy it isn't always sharp and funny\nenough and for a drama it doesn't go deep enough, mainly because it has\ntoo many things going on.<br><br>And then there is Kevin Spacey. I love him in films such as 'Se7en' or\n'The Usual Suspects' where he plays no less than iconic bad guys, but\nhere there are only bits and pieces that really convince me. Most other\nactors are quite convincing, like Gary Cooper, but his role of\nhomophobic, militaristic (helpless) husband and father is one of those\n'things' that feel so overly contrived - though, again, there is a lot\nof potential.<br><br>6 out of 10.\n"},
{"review": "\nAmerican Beauty is a film that exposes the secrets and unruly\npredicaments of a suburban American family.<br><br>My reaction to American Beauty can be summarized into one word--\nspectacular, as what Kevin Spacey said in the movie. The movie combines\ndifferent genres to form a very interesting mix-- drama, suspense and\ncomedy.<br><br>American Beauty is definitely praise-worthy, especially with the way\nthe story went. The characters' lives get messed up in very\nunpredictable ways that will make the viewer stick till the end. The\nalternating mix of comedy, drama and suspense work under the spell of\nthe beautiful score.<br><br>The characters are also a secret to the film's beauty. The\nnot-so-usual-but-really-interesting characters are well-complemented\nwith outstanding acting, especially Kevin Spacey, who I think did a\ngood job in portraying a fed-up father who loses it.<br><br>Final say? American Beauty is definitely Best Picture quality. It is\nable to capture the dark side of suburban America while providing\nviewers with witty laughs.\n"},
{"review": "\nI loved this movie.I have had this mad crush on Kevin Spacey since I\nfirst saw it.I have probably seen it at least 10 times. The\nrelationship that he and Mena Suvari have is so (out there).It reminded\nme of my own (pre) mature thoughts about older men ,when I was younger.\nI really liked the oddness of it all.There were so many twists and\nturns that you did not know what to expect until they happened.It was\nuplifting to see Lester get his independence.He made it all so worth\nit. For those of you that have never seen the TV movie \"Homeless to\nHarvard\" with Thora Birch you are missing a really good performance.\nAmerican Beauty is by far one of my favorite top 10 movies of all time.<br><br>Becky Brown , Fort Worth Texas\n"},
{"review": "\nMy new favorite movie! I would never have watched this movie outside of\nmy high school Film Studies class. But the first two minutes of the\nfilm seemed to have got my attention. I felt that the tone of the movie\nwas really interesting. Most of the film was quiet and wasn't action\npacked like most movies that typical high schooler's watch. In the\nbeginning, the movie was really mellow and then slowly the intensity\nstarted to build up. The thing that helped make the movie so great was\nthe music. It's a type of music I can't explain. It gave the movie that\ncertain tone that it has.<br><br>The characters in the movie were great! And if Lester was played by\nsomeone other than Kevin Spacey, the film would not be as good. I love\nLester Burnham, he's so laid back, he doesn't really get angry at all.\nHe only loses his temper one time in the movie and I found it hilarious\nbecause it was so random.<br><br>It's just a great movie, you have to watch it! <br><br>Best quote- \"Would someone pass me the *&amp;%^(#$ Asparagus!\"\n"},
{"review": "\nSam Mendes does a great job showing the troubles and problems a\nteenager might go through during their high school career. I'd have to\nsay that this movie was more based around the father's life and his\nproblems with it. Mendes really portrays well what a troubled father\nready to give it all up might do to get things to go his way. The\ncreepy neighbor boy was a bit far fetched but added the third part of\nthe story that i believe it needed. The use of roses was amazing and\nwere perfect for the times they were used. the cast for this was a\nperfect selection. Kevin Spacey played a perfect role as the miserable\nfather/husband. Thora Birch was the best choice for a wanna popular\ndark teenager. Overall this was a great movie to watch and one worth\nits time.\n"},
{"review": "\nIn the footsteps of David Lynch, this film explores the nightmare\nunderbelly of suburbia USA, when ordinary people try to be\nextraordinary. With dire results. Beautifully crafted, and with a\ndefinitive performance by Kevin Spacey, ably supported by a great cast,\nthis is a standout film. A man in middle age crisis, feeling himself to\nbe a loser in every respect, becomes infatuated with a young girl\nfriend of his daughter. Revives his zest for living, but complications\ninclude a homophobic neighbor, with a weird son; his wife having a\nrelationship with the Real Estate King, and his daughter becoming\ninvolved with the weirdo next door. An explosive and unexpected finish\nmakes this a film to remember.\n"},
{"review": "\nThis is truly an excellent movie. However I can see why some people do\nnot enjoy nor like this movie, this is by no means the kind of movie\nyou grab some pop corn and drink then watch through it. This is a movie\nthat requires you to concentrate on every scene, and think about the\nmeanings behind them. That is what makes this movie great.<br><br>Unlike most movies in nowdays, there is no hero, there is no running\nchasing blowing things up to give the audiences adrenaline rush. This\nis a drama that will make you re-evaluable your life with respect to\nyour culture, every protocol we know in life versus our desire to seek\nhappiness. It is a movie that in a very realistically subconscious way\ndepict our modern lives.<br><br>I will not go in much detail here to spoil the movie, if you have not\nseen this movie, see it. I cannot guarantee that you will like it, but\nI can assure that if you think about what the movie is trying to say,\nyou will have a happier life :)\n"},
{"review": "\nGiving the 10 i say all. This movie is one of the best i've seen all my\nlife long. It's scarily, see the reality like this. The romance between\nRicky Fits and Jane Burnham... without words. The first time i saw it,\ni begun to think in everything can happen in the planet and we don't\nexpect. All the bad actions, the secrets, the lies, the supposed\nbeauty... perfection. That's not beauty. I think the movie just... stay\nin the brain and the thoughts of everyone who see it. Something so\nstressing in the film: Ricky's father. That man is just so crazy,\ntrying his son and wife like this... and he kills one man just to keeps\nhiding his secret.\n"},
{"review": "\n\nI have this movie on DVD and I watch it over and over again, and Alan Ball\nand Sam Mendes have shown me the omphh that has been missing in other films\nfor a long time. I subscribe to a lot of the accolades to this film, but I\ndo not think that it deserved Best Picture. It was an excellent film- but\nnot an important one. As a kid, I grew up in suburban Orange County where\nthere was truly a lot more than what seemed. I've seen comments posted that\nstate that all of the \"corruption\" just isn't there: \"fascist, repressed\nMarine Corps colonels; middle-aged men obsessed with high school girls;\ndrug\ndistribution amongst teenagers; etc.\" Well, I have news for those soccer\nmoms who like to live in their hermedically sealed worlds and listen to\nCeline Dion- \"LOOK CLOSER\"! Kevin Spacey deserved Best Actor and Annette\nBening was quite impressive as the two-faced housewife. The supporting\ncharacters were just as good and this movie never seemed to drag. It is not\nfor everyone: it is unsettling, disturbing and somewhat raw. But a majority\nof conservative societies don't want the kind of in-your-face dynamic which\nthis movie has. Well, okay. That's why they have movies like \"Stuart\nLittle.\"  \n"},
{"review": "\n\nAmerican Beauty is a great movie about beauty. Everything you see in this\nmovie is beautiful, even those which seem ugly. Kevin Spacy acts Lester\ncharacter delicately and beautifully. The script is so powerful containing\ngreat dialogues mixed with remarkable scenes. Some scenes are unforgettable.\nfor instance, the scene in which Ricky shows the most beautiful thing he had\never filmed. This scene is so touching. In fact, the whole movie is\ntouching. I felt every characters in the movie. And at last, the name of the\nmovie is some kind of a metaphor. Because American Beauty is the name of the\nvariety of hybrid rose.(according to Webster Dictionary) Spielberg has found\na new talent again(Sam Mendes) and of course Sam has done a great job for\nhis movie directing debut. The film deserved to gain 100 oscars instead of\none for best picture. Thanks to Alan Ball and all who were involved in\nmaking this special and beautiful movie. \n"},
{"review": "\nWhy has this dreary little piece of suburban angst become such a\nfavorite with so many people? The whole premise is abominable: after\nlosing his job, hen-pecked Kevin Spacey (an actor whose appeal is\nbeyond me) starts buying pot from a high school kid and drooling over\nhis lovely teenage daughter's Lolita-ish friend. What's so hip or\nrevolutionary about working out, listening to classic rock, or smoking\npot? Spacey acts like he's in prison (although with his shrewish wife,\nplayed by a grating Annette Bening, maybe he is). Then there's the\nself-hating repressed homosexual Marine Corps colonel, a stereotypical\nfigure played without a shred of subtilty by Chris Cooper. Where's R.\nLee Ermey when you need him? Then there's the eponymous \"American\nBeauty.\" Mena Suvari is no doubt a cute girl, but she's not really\nbeautiful. Thora Birch, the daughter in the film, is far better\nlooking. But there's something creepy about building a whole film\naround ephebophilia. This is one of the few films I ever bought on DVD\nthat I was unable to watch more than once. I gave it to my cousin for\nChristmas. Now I have to spend the next twelve months dreading what her\npayback will be come Yuletide.\n"},
{"review": "\nAmerican Beauty shows the contrast between the two faces of America.<br><br>American Beauty extends the idea that nothing is ever perfect. It is\nset in a small suburb; it shows the contrast between American the\nbeautiful and America the violent. American Beauty shows this idea with\nJane Burnham. At the begging of the film she is unhappy with her body\nwhile she is looking at best augmentation on the Internet before\nschool. Jane's appearance is a dark gloomy feel, but as the film\nprogresses and Jane has a relationship Ricky Fits. Jane becomes\nprogressively better looking and more appealing to the audience. She\nbecomes an almost natural beauty in the film much more so than Angela\nwho everyone thinks is a goddess. The real message of the movie is that\nthere is no such thing as beauty, but everyone espiers to be beautiful.\nIn the very begging of the film there is a shot of a rose. As you might\nknow a rose looks beautiful but it does have thorns beneath it just\nlike all of the characters in American Beauty they all have something\nto hide.<br><br>American Beauty shows the shady underside of suburban life, or having a\nmysterious neighbor and a not so perfect marriage. It gets the message\nacross that nothing is ever perfect and there is no such thing as\nbeauty.\n"},
{"review": "\nThis has to possibly be one of the greatest.....screenplays of all\ntime. That's right, screenplays. I didn't much care for the movie\nitself, but I had an edge: before ever seeing the movie, or knowing who\nthe actors in the main roles were, I read the screenplay by Alan Ball -\nand fell in love. The way it was written, the sheer POETRY of the\nwords, made me want to just sit there and read for the rest of my life.\nI could physically see the action happening in my head, without even\nknowing who played the characters, and every single word was just as\nimpactful (if not more) than if I had seen it on the big screen.<br><br>This is an overall EXCELLENTLY written movie, with an incredible plot\nline and especially the twisted ending. The music also helps to bring\nout the true emotions of the film, utilizing every millisecond of the\ninstrumental power provided by the excellent composing skills of Thomas\nNewman to intensify the raw power of emotion this film possesses. I\nlove the script, I ADORE the soundtrack, and I highly recommend this to\nanyone who has ever listened to any of Thomas Newman's work, or seen\nany of Alan Ball's scripts.\n"},
{"review": "\nI'm not good in writing critics,i just wanted to say that this is\ndefinitely one of the best movies I ever saw.And I feel very lucky to\nknow that it touched me, and reminded me of things I knew already but\nwere hidden inside.The choice of the actors is also a big plus in this\nmovie,they're all excellent.Anette's Benning was really impressing for\nme,I actually never pictured her in such a roll,but she was really\nbrilliant.Nothing else I could add about Kevin Spacey...WOW! Sad to\nknow,(like the first person to comment this movie said),that there's\npeople who wouldn't watch this movie cause \"I would never watch a movie\nwith a title like that\". How blind are we.<br><br>P.S:Awesome the plastic bag scene :-)\n"},
{"review": "\nI view the characters in this film much as I view the characters in\nJohn Steinbeck's 'Of Mice and Men'. Each character in the book has\ntheir dreams, their goals, whether simple or fancy, they are dreams and\nmost of them know deep down that they will never get there, but in\norder to lift themselves from the reality they are in, they need\nsomething to look forward to. In each character is a desire to be\nsomewhere else, and in each character there is a major flaw, a\nweakness. In creating characters like these, Steinbeck has given each\ncharacter redeeming features in such a way, that however hard you try,\nyou cannot pick out a villain. Each and every character is a 'good\nguy', but each has their flaws that lead them to tragedy, and that is\nan excellent dynamic. <br><br>In American Beauty, Lester, Janie, Angela, Carolyn, Ricky and Frank are\nall made out to be bad guys in some way or other, but each have their\ndreams, each have their flaws and they are all led to tragedy in one\nway or another because of them. Oh, and each are 'ordinary'. Its this\nCharacterisation that really makes the film, aside from the cracking\ncinematography, acting, direction and ball-busting script. I would be\nvery surprised if Alan Ball's inspiration was not partly because of\nSteinbeck. As you can see, I love this film.\n"},
{"review": "\n\nThis was a terrible film about terrible characters who regret their\nterrible\nlives.  It was unoriginal with hardly any worthy content. Spacey: Whaaa! My\nlife sucks.  I'm gonna beat myself up and get a job at a fast food\nrestaurant! Gosh that sounds really interesting.  And what an ending! Whew!\nBlew me away.  Everyone's got a homosexual/homocidal side to them, don't\nthey? Gosh, i can relate.\n"},
{"review": "\nAmerican Beauty, released in 1999 and starring Kevin Spacey, Annette\nBening, Thora Birch, Wes Bentley, and Mena Suvari, couldn't be ordinary\nif it tried. The movie is a deep, wonderful, and penetrating film that\nwill leave the viewer not only questioning their life, but American\nsociety as a whole. The movie hits on many key points ranging from\nconformity in society to individual perception, and really hits home\nthe concept of social disillusionment. The tag line of this movie is\n\"Look Closer\", which is exactly what American Beauty does with its\nportrayal of the Burnham and Fitz families. On the surface both\nfamilies appear to be well-off and happy, but in reality they are\nstruggling greatly with what they want and what they think will make\nthem fit into society. For example, Colonel Fitz on the surface\ndespises homosexuals because he believes that they are not conforming\nto society's view on marriage, however, in reality he is upset that he\ncannot break the bonds of social conformism and be gay himself. The\ntruth is, the only happy people in the movie or those who are able to\nbreak from society's rules and live their lives according to their own\nperceptions\u0085unfortunately for most, they reap the consequences society\ndeals to those who are unwilling to bend. Ricky Fitz is sent to a\nmental institution and ostracized by society because he does not keep\nthe society's view on beauty. And Lester Burnham, though finally able\nto embrace happiness after waking from his twenty year coma, is killed.\nAmerican Beauty combines not only great acting and directing, but also\nincludes the audience by asking many questions that will make them stop\nand evaluate their own lives.\n"},
{"review": "\n\nEnough pro and con comments have been written about this so-called\nOscar-winning \"masterpiece\" for me to make this review a brief one--but to\nthe point. 'American Beauty' took up too much time to tell a relatively\nuncomplicated story of mid-life crisis involving several severely\ndisfunctional personalities. If it gives you pleasure to watch Kevin Spacey\nbe little more than sarcastic for two hours or to watch a shallow youth show\nyou a plastic bag pushed about by the wind as a sample of beauty in little\nthings, then this movie is for you. The only genuinely moving and original\ncharacter in the movie is not Spacey--it's Chris Cooper as the homophobic\nneighbor who suspects his son is having an affair--with tragic results. His\nperformance in the climactic garage scene is stunning. The symbolism of the\nrose petals was overplayed and much too simplistic. As was the lengthy shot\nof the floating plastic bag which so many viewers found deep meaning in--but\nstruck me as arty, pretentious and boring. With a rambling and vulgar\nscript, this emerged as no more than a sad commentary on the complete\ncollapse of American culture. All of the characters are not only weird but\nunlikeable. For me, this was an ordeal to sit through--the only jolt I got\nwas from the ending (which took too long to get to)-- and then, mercifully,\nI was able to take the cassette out, certain that I would never want to view\nthe movie again, despite the fact that it won a Best Film Oscar.  As someone\nonce said, \"the mirror of life should be tilted upwards\" more often to make\nfilms more inspirational. The gutter is not a pleasant place to spend two\nhours of your life--look for true beauty elsewhere. A big thumbs down on\nthis one.\n"},
{"review": "\nAmerican Beauty is an exploration of midlife crisis and the illusion of\na 'normal' family. Lester Burnham (Spacey), his highly strung wife\nCarolyn (Bening) and resentful daughter Jane (Birch) each struggle to\nfind a sense of purpose to their lives as the facade of their happy\nhome deteriorates. The story follows Lester on a journey to turn his\nlife around after meeting his daughter's provocative friend Angela\n(Suvari). His lust for the teenage girl inspires a new lust for youth\nwhich he captures by discarding all of adult life's responsibilities in\nan attempt to re-live his youth. As he quits his respectable job, takes\non a position flipping burgers in a fast food joint, and starts smoking\npot he finally gets the object of his desire \u0096 but was it really what\nhe was looking for? Kevin Spacey's performance as the world-weary and\nrebellious Burnham is magnificent. The honesty which Lester gives off\nwhile everything around him radiates artificiality is astonishingly\npowerful - aided in no small way by Sam Mendes' use of lighting and\ncolour which is remarkable. Visually, every shot is a work of art, a\nportrait of discomfort. You can really feel the unease as the camera\ntakes you on a journey through the Burnham household, furbished in\nblue-greys and white \u0096 not so much as a fork out of place - mixed with\nthe stark contrast of red roses. In short, an absolutely breath-taking\nfilm, American Beauty is shocking yet humbling, sad yet tranquil and\nultimately beautiful.\n"},
{"review": "\nAt over 5 years old this movie has probably been seen by most people\nalready. But just in case it did pass you by, for whatever reason, i\nsuggest that you see it as soon as possible.<br><br>The characterisation is sublime and has not to my knowledge been\nmatched since, every stereotypical character is so realistically\nportrayed, by a combination of fine acting, great writing and excellent\ndirection; that you feel a connection with everyone in the movie.<br><br>I won't try and link this film with any particular genre, as i believe\nit stands out on its own, but i will say this. Whatever kind of film\nyou usually go for, 99% of you will like this one, and most of you will\nlove it.<br><br>Look closer and you will find an absolute gem.<br><br>10/10\n"},
{"review": "\nHis life sucks, family sucks, society sucks. So...lets just write a\nstory affirming it. Gee thanks. Good acting? Abosulutely. (Thus it gets\n3 stars from me) But a film ought to have a point beyond spreading\ndepression. What was I suppose to come away from this movie feeling?\n\"Wow...at least I'm not THAT bad off\"? There are plenty of pointless\nfilms out there, so no need to bag on this one in particular, but what\nis pointedly offensive is how \"acclaimed\" and \"revered\" this movie was\nby the critics and industry at large. What gives? You throw great\nactors at something and it just has to be good? Or was their marketing\ndepartment just working in overdrive?\n"},
{"review": "\n\nQuite possibly one of the least deserving \nOscar winners of all time, American Beauty \nsimply spikes a hot iron into my hide every time\n I hear praise dished out to it.<br><br>I will admit, I thought it was pretty good the \nfirst time around, but then, I realized my lack \nof insight proved to be poorly developed. Like \na bad wake-up call, I realized how stupid and \nidiotic this film was, kind of like enjoying a \nvideo game from 1986, then seeing how \npoorly it has aged compared to today's \nstandards. American Beauty accomplished \nthis in a matter of months. <br><br>The characters, except for Lester, had no point. \nThe kids were poorly drawn characters, \nexcessive moot that could have been edited \nout of the film. This film had no idea what mood \nit wanted to be, no semblance of consistency, \nand no reason to be made in the first place. A \nfilm I will continue hating until I'm six feet under.\n"},
{"review": "\n\n\"American Beauty\" is excessively praised as a great piece of American film,\nwhen in reality it isn't even good enough to be a decent rip-off of better\nfilms.  Unfortunately, many viewers have fallen for it.  (\"Moonspinner55\"\nand \"tubist38\" have good reviews.  Note that one person who initially\npraised the film reviewed it again a year later and said, \"What was I\nthinking?\")  Mendes wastes some excellent actors in these meatball scenes\n(for example, Spacey throwing the asparagus...who couldn't do that well?)  A\nlot of this film is some snappy one-liners or clever scenes strung together\nwith...nothing.  Everything that happens is almost laughably predictable. \nAnd the crucial scene, where an empty plastic bag blowing in the wind is\nsupposed to impart some deep meaning on the true nature of existence in the\nphenomenal world?  Right.  Finally, I must comment on Annette Bening, who is\none of the better actresses working today being cast in the role of a\ncartoon...what a waste.<br><br>This film is a \"1,\" and should in fact have a turkey symbol next to it. \n\"American Beauty\" is the perfect symbol of the decline of the serious\nAmerican film.  \"Ordinary People,\" \"Out of the Blue,\" and \"The Sweet\nHereafter\" are much better films.  \n"}
]