[
{"review": "\nAntoine Fuqua's and Denzel Washington's paths collide once more as they\ncome together to create a stylish and daring action thriller about a\nman with a mysterious past, whose quiet life suddenly turns into a rip-\nroaring adventure of guns and thrills. Both Denzel Washington and Chloe\nGrace Moretz give stellar performances and display perfect chemistry as\ntwo friends stuck in a world of crime and violence. Arguably Fuqua's\nbest film since 'Training Day', 'The Equalizer' is a brutal and\nmerciless tale that explores the Russian underworld on the East Coast\nand the corruption ties within the law enforcement of Boston's police\ndepartment.\n"},
{"review": "\nJust when I thought Hollywood couldn't go lower, comes this\nmasterpiece. I'm sad to see Washington agreeing to play this role which\nis way below his standard. I guess Uncle Sam payed him hefty dollars to\ntake part in this political message to Russia. Long story short, Denzel\n(Obama) single-handedly, and with use of some home appliances, kills\nthe entire Russian mob organisation including the boss in Russia,\nVladimir Pushkin (Putin). He even blows up the gas pipeline\n(seriously?) The prostitutes represent Ukraine, that needs protection\nfrom big bad Russians. Uninventive, childish, crude, terribly written\npolitical propaganda. Avoid if you can.\n"},
{"review": "\nThe movie was action packed and I love when the good guy always win.\nThe character don't talk much but you can only pull that off if you are\na good actor. The young actress I hear she is 17 did an amazing job to\nplay that part.Denzel no words you still got the box office power. My\nhusband ex marine he would not stop hollering when one scene came up he\ngets a kick out of that stuff. Never seen the Equalizer series at all\nso my opinion is from the movie only. Sequel is wide open lets have\nmore next year. Hope to see more. Love It. Hope the DVD be out for a\nChristmas Present for the husband I will be buying it. All I can say is\ngo see this movie because it is very good don't listen to the haters.\n"},
{"review": "\nFairly solid action scenes, characters and overall execution. Somehow\nthe filmmakers and actors make this very hard to believe film\nenjoyable. This is definitely a sensationalistic film(The most\nsensationalistic of Washington's career without a doubt.), and it's\nmostly a regurgitated cookie cutter crowd pleaser of violent vengeance\nas well, but it does manage to remain quite an entertaining action film\nat the same time. Even though it has a running time of over two hours,\nthe film does feel overall as though it is missing a few key scenes,\nbut nonetheless it's still worth a look if you're into these kinds of\nfilms. The movie didn't remind me much at all of the old T.V. series of\nthe same name. The film is much more reminiscent of some of the old\nbrutally violent morality tales that Charles Broson use to do. All that\nsaid, this basically chalks up as a good film to watch when you don't\nwant to think much, and you just want to watch a lot of kick ass\nentertaining violence. It's that kind of guilty pleasure. 6.5/10\n"},
{"review": "\nIf it was not a Denzel Washington movie; it could easily pass for \"B\"\ndirect to video movie. Low production values; not outstanding\ncharacters or actors (aside from Denzel and little used Cloe Moretz), a\nquite predictable and lazy written story, several \"USA POLITICALLY\nCORRECT DETAILS\" **spoiler follow** Denzel never kills a cop **end of\nspoiler** This is a movie Denzel can do it while sleeps and he is\nreally good; but it is not a good movie by far. Too long for his own\ngood and cheap special effects, uninteresting final showdown. Antoine\nFuqua made the mid budget \"Olympus Has Fallen\" last year and the looked\nfar more expensive that this one (which reportedly cost over 50M) In\nbrief; if you are a fan of Denzel; get \"Training Day\"; this one is not\nworth the over two hours spent.\n"},
{"review": "\nHuge disappointment. Enter the Cold war II!A single 60-years old guy\ndestroys the most severe Russian gang in a local DIY with screws and\nhammers. The first 10 minutes were OK, but after that it turned into a\ncheap action without any logical plot. The final was crushing - Denzel\ngoes to Moscow and kills the bad guy in his bathroom, preliminary\nliquidating his army of bodyguards. The message - Russians, don't mess\nwith us or we shall send you our deadliest weapon - DIY supervisor. We\nhave a new sheriff in town - killing the bad, protecting the poor Latin\nminority, punishing the corrupted cops... Hollywood best days were over\nlong time ago. RIP! I haven't watched such ridiculous propaganda since\nRambo. 2 hours wasted time and bad taste in the mouth.\n"},
{"review": "\nYet again a movie about a lone (american) man that saves the day and\nkills all the (foreign) bad guys. OMG Hollywood this again. Who writes\nthis crap. Seen it a million times before. Back in the day it was still\ncool but now just shameless.<br><br>Cliché after cliché, no humor, virtually no story, illogical, plot\nholes, action is somewhat enjoyable<br><br>To my shame i must admit i enjoyed some of the mindless action scenes\nbut the biggest problem is that it is all to far fetched. Without any\nrealistic basis it just looks stupid. Denzel isn't helping either.\nDon't get me wrong i like Denzel and credits to him for trying, but his\n(over) acting feels out of place. He is just trying to hard and way to\nserious in a movie you can't take serious.\n"},
{"review": "\nGoing in to the Equalizer I was expecting an updated Man on Fire and\neven though it is not in the same league it was still pretty damn good.\nDenzel Washington plays the role of quite avenger to perfection. He is\none of the few actors I believe can really do this and I would pay to\nwatch him do it.<br><br>The Russian villains were outstanding and well cast. Especeally the\nmain bad guy. He was unlikeable and I could not wait for him to reach\nhis demise.<br><br>The action sequences in the movie are really well done and the only\nother movie that gets close in 2014 is John Wick. You feel part of the\naction and when he starts his timer to see how long it will take him to\nkick a** I couldn't help but love the character. It's not a question of\nif he will kill every damn person in the room, more of a question of in\nwhat interesting ways can I do it.\n"},
{"review": "\nI like a good 'underdog triumphs over adversity' movie but we have been\nhere before with Denzil (Man On Fire!) who I previously much respected\nfor his earlier works. If you have seen any film in the genre you have\nalready seen this which offers nothing original. Seems like Denzil had\na spare couple of months and million (also producer credit) and thought\nhis name could carry this predictable rehash of Edward Woodward's\noriginal, much more believable brand. As expected, DW is a great actor\nbut he should be ashamed of this carbon copy as should those who voted\nto bring this to an IMDb 7. I am losing faith in this scoring. I know\npeople liked this but I guess expectations are currently low.\n"},
{"review": "\nI actually smelled the odor of a piece of \"riiiiiight\" cinema pretty\nearly on, and decided to stop watching. A \"riiiight\" film, for those\nwho don't know because I just made it up, is where the filmmaker tries\nto make you believe something so unrealistic and far fetched that you\nsay to yourself (or maybe even say out loud): \"riiiiiight, possibly\nfollowed by \"suuuuuuuuuuure\".<br><br>The boredom of a 10 hr flight got to me in the end, and I decided to\nturn it back on. Many \"riiiiight\"s later I got to the end. I often get\npeople telling me that they like these movies even though they know\nthey are far fetched because they are \"just entertainment\". But when\neverything is so overdone that it looks like a satire but it really\nisn't, I check out. This was such a film. In spite of maybe murdering\n50 villains during the movie, Denzel is the good guy, and we are\nsupposed to feel sympathy for him. And the Russian bad guys were so, so\nbad. Thank god Denzel is there to slaughter them all with no collateral\ndamage. He's such a bad ass.\n"},
{"review": "\nThis is such a bad movie on so many levels i do not understand the IMDb\nrating.<br><br>The violence is very graphic, and thats about it. Can not get more\ncliché than this movie, it's like Welcome to the Rileys with a whole\nbunch of retard thrown in.<br><br>The film is pretty much a definition of cliché, Ex special forces guy\nliving an ordinary life, Corrupt cops that he beats up, ha ha, A young\ngirl caught up with some nasty shite decides to trust this guy to save\nher, probably because of the way he stares at people.<br><br>It's just ridiculous, I walked out 2/3 through the movie, it really was\nthat bad, only the second time in my life i've done that. And it's\nbeyond me how the movie got such a high ranking here, the term ignorant\nmasses comes to mind. <br><br>If you love overdone overplayed clichés, you will love this film.\nOtherwise give it a miss.\n"},
{"review": "\nAlright, so I was dragged to IMAX and had to pay 17 pounds to watch\nover two hours of headache-inducing visual/sound effects, ridiculously\nunrealistic characters, logical inconsistencies and a shameless\nglorification of gore &amp; violence. If you want to use far fetched gore\nscenes then at least have a plot that can back them up\u0085So its a 7.8/10\nhuh? Anyone praising this film is either under 15 years old or\ncompletely out of his mind. Wont be watching any Denzel Washington\nflicks anytime soon, shame on a so-called \"established\" actor for\ntaking part in such an atrocity. I would give it a zero out 10, seems\nthat IMDb doesn't have such an option tho.\n"},
{"review": "\nTo be honest, Denzel Washington showed off a brilliant performance and\nhis character is pretty good. Everything on the other hand was pretty\nmediocre, the action scenes were a bit boring, the plot was tiresome,\nand there wasn't much excitement until the last twenty minutes.\nChloe-Grace Moretz did an okay job but she doesn't offer much screen\ntime as I was hoping. There were many scenes throughout that simply\ndidn't make much sense which took away the film's entertainment.<br><br>The action scenes were not terrible but I believe they could have been\ndone much better. The main character (Denzel Washington) fights off\nsome of the Russian gangsters near the beginning and the fight looked\nrather unrealistic, especially when he drives that corkscrew through\nthe guy's jaw. The final fight scene at the end, however, was pretty\ngood and was a good end to the climax.<br><br>I recommend this film to anyone who is a Denzel Washington fan.\n"},
{"review": "\nThis movie is so bad that really made me and my gf laugh at many\nscenes. It seems like a 10 years old wrote this, it only has clichés\nall over the film. There is no real action, and of course the bad guys\nalways miss their shots. A vigilante for the dumbass that only wants to\nsee a big explosion and some gunshots. You can really know what's\ncoming next, and in this case it was all lame clichés about other\naction movies (someone compared this film with Die Hard, yes they even\nnamed the good guy with an Irish surname). There's nothing good in this\nmovie, I cannot understand how people give it up to 9-10 stars. I've\nseen many bad action movies, but this is the worst.\n"},
{"review": "\nSeriously, it was that bad. Normally, a movie featuring so many guns\nand spilling so much blood would get my attention, but the action\nsequences were just dumb. From beginning to the end, the whole thing\nfelt like a mindless grind. And you could tell from the sticky\nperformances of the actors that they thought the project was stupid\ntoo. But with a $50 million budget, it must have been a nice payday for\neveryone involved and so they went through the motion to get the movie\ndone.<br><br>Denzel Washington shows his age and is unconvincing as a super\nassassin. He is too rotund around the waist for people to believe that\nhe has the quick moves needed to get the kills. Washington is best\nsuited for a movie like \"Flight\" where he played a bitter and washed up\nalcoholic. For his own sake, he should either get in shape or turn down\nthese action roles.<br><br>\"The Equalizer\" should never have been made. There is no need to insult\nthe audience with this kind of trash. Unfortunately, it is rumored that\nthey are making a sequel. Save your money and give this one a pass.\n"},
{"review": "\nThe summary says it all, he killed more people than Rambo with more\n\"gadgets\" than MacGruber. This is the kind of a bad move i wish he got\na lot of money for because it is not very good, and is one of those\nwhat did i waste my time on? <br><br>Plot: Retired mystery man with great skills who stooped doing dirty\nstuff because a promise to his dead wife goes against the whole Russian\nmafia for a prostitute (with a good voice witch we never hear) he hangs\naround with when she gets beaten by her pimp.<br><br>To sum it up: Do people really think one man can kill the entire\nRussian mafia and a few petty criminals along the way with house whole\nappliances/chemicals. <br><br>The only reason i gave it 4 stars and why this movie is different than\nlow budget TV movies is because of the actors and their performances.\n"},
{"review": "\nThis is one of the dumbest films I've watched this year.<br><br>Danzel seems to be one of those actors who accept any role as long as\nthe pay check is decent.<br><br>\"The Equalizer\" is your typical, run-of-the-mill, full-of-clichés\nvengeance film. A super-ultra black-ops or whatever comes out of\nretirement to rescue a young prostitute with a heart of gold.<br><br>The point is that the films is a succession of a violent scenes, and a\nhero who is as convincing as snow in July in LA.No plot, or better,\nplot holes the size of Texas, the whole things become tedious pretty\nfast.<br><br>At least, Schwarzenegger's films had some humor, they were dumb, but\nwere fun to watch.<br><br>This one is another waste of time...\n"},
{"review": "\nSad. This was barely a notch above a Steven Seagal movie. But worse, it\nhad Denzel Washington in it. That hurt me.<br><br>The movie was as cliché' and stupid as most action movies. This one\nseemed slightly unique in its bland of the revenge porn template with a\nslasher gore thing. Only the slasher was the protagonist.<br><br>Seeing Washington put a screwdriver into the back of someone's skull,\nthen pull the trigger, was truly the low point of his career. But it\nwas also another low point in mainstream American film.<br><br>The moral inversion is almost complete. We have serial killers as\nheroes. Why not a madman with power tools.<br><br>This kind of violence is supposed to be funny. The chainsaw massacre,\nso over the top, you laugh out loud. But what Antoine Fuqua has done\nwith this movie is attached psychopathic bloodletting with the cause of\njustice. And this isn't just bloodletting. Mel Gibson perfected that\nyears ago.<br><br>This is psychopathic bloodletting. By another American psychopathic\nhero.\n"},
{"review": "\nThis, was the best action I've seen in a long time. Let me explain: The\nstory is, Denzel is a retired man from an obviously highly trained\norganization, trying to normally live his life, and gets influenced by\na sad prostitute that wants to sing. So, he goes on a rampage killing\npeople to get her wish. That may sound like a trope, but no other movie\ndoes it better. Yes, it wasn't the best movie ever, but no movie gets\neverything right.<br><br>You think the clichés made it terrible? Well many movies would have a\nhard time making content to put in if they avoided all the clichés you\nthink make movies worse. I loved this simple good guy doing the right\nthink movie, and Denzel is definitely better than Arnold at this kinda\nmovie.\n"},
{"review": "\nA lot like the Bourne Idendity's.<br><br>It will have you on the edge of your seat, Denzel as always is\ncaptivating as an actor and it is a entertaining film for adults.<br><br>Not too often I watch a movie that is believable enough to keep me\nintrigued and entertaining enough to keep my eyes on the TV.<br><br>I gave it a 9 but its as close to as a 10 as you get. Great movie<br><br>Their is 1 fight scene in a club that is outrageous! Denzel really\nnails the role <br><br>I would love to see the director and/or prodducers come out with\nanother movie like this.<br><br>Good movie Adults can enjoy\n"},
{"review": "\nThe equalizer is a fantastic movie about Denzel Washington(McCall) Who\nis a hired gun or was a hired gun for the government we don't fully\nknow in this film and we don't truly ever find out what he was before\nwe see him For the first time we just know by the way he takes care of\n\"business\" that he doesn't mess around. If you haven't already seen\nthis movie in theaters you need to go down to the store and buy it\nright now!<br><br>The equalizer is a pretty straightforward movie no twists and turns no\nmystery nothing but blood and action. This movie is a gory movie and it\nhas been rated properly so if your thinking of taking your\nnine-year-old son to go see this movie don't on the other hand I'd say\nif you're more towards the age of 12 and up depending on the parent\nthis'll be a great movie to go see with some friends. I love this movie\nand I think you'll love it too I give the 10 out of 10 stars.\n"},
{"review": "\nThis is a Wesley Snipes movie in which they inexplicably managed to\nhire Denzell to play Snipe's role. Really, it's a \"B\" movie. The story\nis not just dumb, it is painfully dumb. In fairness the actors do a\ngood job considering the dreck they had to work with. Marton Csokas and\nChloe Moretz especially do nice work. Denzell, who is now on the wrong\nside of sixty, is miscast in the Perfect Killing Machine role. But the\nactors cannot redeem this movie from it's preposterous story line.<br><br>How this managed a 7.2 on IMDb is mind-blowing. I guess there's a lot\nof people out there who'd watch a film of Denzell reading names from\nthe phone book and call it art.\n"},
{"review": "\nDenzel Washington gives a solid performance as always, but the\nEqualizer is of the same quality as many other Denzel led thrillers:\nwithout him it would not be meaningful, with him it's watchable &amp;\nspecial. There's definitely a pleasure in watching Denzel taking down\ntough- talking baddies, and that's what the film delivers, no more, no\nless. The conflicts are generally well written and ratchet pressure\nnicely, especially when Denzel has some chilly conversations with his\nsoon-to-be-victims before they inevitably make their bad decisions. The\ntense sit-downs were equally entertaining for me just as the bloody\nviolence. Director Antoine Fuqua goes about his business in a more than\ncompetent manner; the technical qualities are above average, though the\nfilm has moments where it seems too infatuated with its slick sense of\nstyle. The Equalizer is an exciting, high-adrenaline thriller.\n"},
{"review": "\nThis movie was actually better than I expected. It was kind of a mix of\nbond/bourne type ingenuity action with an added modern day superhero\nquality - the type that allows the viewer to get a bit carried away\nwith all the action without questioning how believable the story line\nis. For me it has some great high adrenaline action and at the centre\nof it all is the ever cool Denzel Washington. The story line tends to\ndelve further into the unbelievable the further it goes on - eventually\nto the point where you wonder how Mr Mccall could so easily seemingly\nreturn to his normal everyday life after such outrageous public\nexposure. But then you remember that it's all about unapologetic action\n- and doesn't try to be particularly believable or convey any deep and\nmeaningful message. It sets out to entertain - and that it certainly\ndoes.\n"},
{"review": "\nThe Equalizer (2014) is your typical run of the mill movie. It's not\ngreat and it's not bad, it's nicely done and worth watching. I do tend\nto enjoy Denzel Washington's acting within most of the movies in which\nhe is in. This specific film reminded me of \"A Man on Fire\" without the\nending, this ending was pretty nice. The action was well put together,\nand of course it will be one in my collection of DVDs. I'm a sucker for\nmovies with Russia involved, and this film had so much to do with it.<br><br>When I looked at the genre, I'm not seeing the thriller part of it as\nI'd think it would classify more as a suspense action; either way this\nmovie was good. Chloë Grace Moretz did a great job in her role as well,\nwow she has changed so much since Kick-Ass. The scripting was really\ngood, the acting was to par; all and all a really good action film.\n"},
{"review": "\nAn average movie with a common and cliché story. A guy , who was a CIA\nagent , has started a new quiet life. But when he meets a young girl\nunder the control of Russian gangsters, he has to help her. The plot\nwas really obvious. There was nothing unpredictable that could surprise\nyou. Denzel was good, as usually, and his character was quite likable\nand enjoyable. Violent scenes were good, but I need more than that. I\nam not saying that it's bad, but i didn't find anything special about\nthis one. There are so many movies exactly like \"The Equalizer\". So, as\nI said before, it is just a good movie. Don't expect anything more. My\nrate is 6/10.\n"},
{"review": "\nI guess the real reason why is the studio still thinks the name \"The\nEqualizer\" still is a draw. While I thought this film was OK. A fairly\nmediocre action film my real problem with it is its title. As a fan of\nthe show in the 80's I was eagerly looking forward to seeing this. It\nbares very little resemblance to the show on which it is based. Not\nthat I don't like Denzel, but I personally was hoping for someone that\naudiences have seen in a role similar to the TV show. In that respect I\nwas hoping for Timothy Dalton. Regardless this film is as I said\nneither great nor horrible. If you like action films it is worth\nseeing, but as a fan of the show I just wish they had called it\nsomething else rather than getting my expectations up there with what\nwas a fine show for its time period.\n"},
{"review": "\nThis film has all the ingredients of the classic American action movie:\nthe good versus the bad, America versus Russia, the happy end.<br><br>I must say that even though the film misses any sort of true storyline\nor plot, and never fails to amaze in its total implausibility, never at\nany point did I get bored or want to turn off the movie. I guess that\nit is only the quality of the performance by Denzel Washington that\nmakes you forget about the lack of storyline and the unrealistic\nsuper-hero capabilities of his character, which is a complement for him\nbut not so much for the script itself.<br><br>A decent watch for a lazy, rainy Sunday afternoon.\n"},
{"review": "\nAgain, Denzel Washington delivered another good one. Coming after\n\"Flight\" and \"2 Guns\" he just keeps dropping them. In a way, this film\nwas reminding me of \"Man on Fire\", just on a more blue collar level\nbecause of the kind of work his character did in the movie.<br><br>Robert McCall(Denzel Washington) is a good man who lives a quiet life\nbut has a secret past, with Teri(Chloe Grace Moretz) being involved, it\ndoes make for a typical action movie, but a good one! The fact that\nRobert McCall is a good man who helps anyone around him is part of what\nI think makes this a good film.<br><br>With an actor like Denzel Washington you could never go wrong even if\nit is a typical action flick. His acting is always going to be on point\nno matter what kind of film it is, not leaving out the other actors in\nthis film, the entire cast excellently performed. You won't be\ndisappointed if you rent or buy this movie. It's a good one.\n"},
{"review": "\nThe equalizer is about Robert McCall(Denzel Washington), a man with a\nmysterious past, trying to stay a quiet life but when he meets\nTeri(Chloë Grace Moretz),she gets in trouble with some Russian gangster\nand Robert will now use his skills he had in the past to stop them.\nFirst off the equalizer is an action movie but when there's not action\nits very slow pace. The story is okay, there's a sub plot that very\ndoesn't need to be in the story but oh well. When there is action, it\ndelivers!! Denzel Washington is always Great as an action star. The bad\nguys in this movie are so plain. We have seen this so many times\nbefore. When will we have a great villain. Overall the equalizer was an\nokay movie, with a weak story but did have some great action scenes,\nit's a good rent at redbox.\n"},
{"review": "\nGood old story line where a good guy kills bad guys... A hero saves the\ngirl and the day.... <br><br>Thanks to Denzel Washington's acting skills (in general casting and\nacting is good) and the director's talent it turns out to be a good\nmovie and not a complete waste of time.<br><br>However, you'd love it, unless you are sick of a guy, who used to be a\nbut now tries to have a laid back life style, yet trouble finds him and\nhe kicks ass again...<br><br>So, if you want to spent a Sunday watching a good action movie with no\noriginal story, it's a good choice. <br><br>Yet, nothing more than mediocre in my book.\n"},
{"review": "\nA good better than average movie. It was all about action and good old\nfashioned revenge for the dear one. If you go with a lot of brains in\nthe movie then you will be disappointed for sure.<br><br>The movie has a simple story but many things about the lead were\nunclear and well you can say a hero is a hero and luck and script is\nalways with him hehe.<br><br>Direction was good, Denzel was good, the mafia people were also OK,\noverall it was entertaining but as i said if you try to be logical here\nthen you will miss the action.<br><br>So just go ahead enjoy the action and have a good time.\n"},
{"review": "\nSome people might agree with me some might not but The Equalizer is 10\ntimes better than John Wick and here's why even tho Denzel Washington\nnever grabs a gun for the whole movie the way he kicks ass in this film\nwas amazing and it totally blew my mind he was a great character you\nsaw somethings he done from the trailer like when he brought that ring\nback to that woman when that thief stole it from her. But the best\nscene for me was the ending and i think the direction was good and even\ntho it's something that you have seen before in multiple films it's a\ngreat action movie and i enjoyed it and Washington was a total badass\nand if you haven't seen it yet? you need to like now also the\nsoundtrack when he took every bad guy one by one was awesome!!\n"},
{"review": "\nSaw this on DVD and to be fair it starts off well but the plot line is\npaper thin and predicable down to the script. It has plenty of action\nand is a good film for Denzel as i like most of his past work. Near to\nthe end of the film it seems the writers were asked to take a hike and\na producer took over as it turns from a nice, action movie to a mushy\n\"gee ma can we be American too?\" type situation, which is not required,\nwanted or enjoyed. More mush and gush than Tom Cruise talking about\nhimself, ugh. For me this ruined what was an enjoyable experience and\nthe last action sequences are stupidly ridiculous which also ruins then\nfilm. Only watch if there is nothing better on.\n"},
{"review": "\nDenzel Washington, a nice job, a kind man and a predicament when he\nsees how some gang leader hit a nice prostitute, some nice dialog and a\ngood start.<br><br>That's about the kindest thing I could say about the movie, after the\nfirst 15 minutes the whole premise went downhill.<br><br>This has to be the worst action movie in a long time, there is\nabsolutely no tension whatsoever when you see a seemingly\nindestructible guy because Hollywood says so that is able to take down\nand destroy pretty much everyone in his path.<br><br>This is pure Hollywood American propaganda where the Latinos are weak,\nthe Americans are super powerful and Russians are just gangs and\npsychopaths.<br><br>Total and absolute waste of time with excessive violence and really\nuncalled for.<br><br>Denzel, I like your inspirational talks but you gotta stop doing this\nunnecessary violent movies.<br><br>Not recommended for anyone.\n"},
{"review": "\nDenzel Washington makes this film watchable, but even he can't make it\nsoar. A former military man works in a home depot, but has to fall back\non his 'special skill set' in order to help those around him. The guy\nis less Good Samaritan and closer to goody-two shoes. He wants to\nlaunch the singing career of a prostitute, and help a tubby colleague\nslim down to take a test. It is all a bit saccharine and twee, till an\nintriguing Russian villain shows up carrying real menace. From there\nthe film becomes more action oriented, but still doesn't out-do the\nTaken or Bourne franchises. Our man goes back to his bosses to ask not\nfor help, but \"permission,\" an especially sleek piece of dialogue. The\nfilm is tonally inconsistent, and seems too obviously an attempt to\nre-boot the TV show. Denzel is as charismatic as ever, but his range is\nbarely tested in this role. A decent B-movie action flick, but not much\nmore.\n"},
{"review": "\nA little disappointed by this one, Denzel doesn't even seem to try in\nthis one to make anything ordinary of his character and he's one of my\nfavorite favorite actors but he appears like he only did this one for\nthe money<br><br>And I expected Chloe Moretz to have a bigger role, she's only got about\n25 minutes of screen time or less<br><br>And the movie is too long and doesn't seem to know what direction it's\ngoing a lot of times<br><br>Based on a TV-series and it shows, it often feels like a big budget TV-\nseries pilot<br><br>It's not complete crap but we've seen it all before and a lot better<br><br>I loved Fuqua's directing and Washington's acting in Training Day so\nit's surprising that it's not better than this\n"},
{"review": "\nI had recently watched the equalizer and I liked its story acting and I\nalso liked a action bar sequence by watching that sequence I had felt\nthat the movie has got incredible action but as the movie was going I\nhad felt that it has been more concentrated on a story line rather than\nshowing some action and as the story was normal they had stretched the\nmovie too much which I had not liked.<br><br>The movie had felt me like I watched it 100 times helping others and\nall I am too much disappointed by this movie but as I liked it for its\nquite action sequences especially bar sequence and also for its bomb\nblasting sequences but the movie was not great not only in story but\nalso in action in comparison John Wick was awesome than this it had\nalso got a simple story but it's action sequences led me to like that\nmovie.<br><br>But in case of equalizer there is nothing I can like except some scenes\nnot the whole movie I am saying don't waste your money on this.<br><br>\"A ONE TIME WATCH\" believe me\n"},
{"review": "\nThis is clearly supposed to be a hard-edged realistic film, but it\ndoesn't work without McCall being super-powered in some way. And OCD is\nnot time dilation.<br><br>I kept thinking of the tagline from the Taken movies: I have a very\nspecific set of skills. If CIA agents were like this we wouldn't need\nthe US Army.<br><br>The plot is predictable.<br><br>I thought McCall had a completely unexplained no-guns policy, despite\nthe TV character's highly visible pistol, because he keeps ignoring\nguns in favor of cutting up his own hands, but at the end he shoots a\nwhole bunch of people. And why do the bad guys fire silenced assault\nrifles without a target?\n"},
{"review": "\nThe first 20-30 minutes of the movie was good. But after that, the\nstory just sags. Nowhere near \"Training Day\" quality or story. Sad that\nit is a Denzel Washington movie and we do not see much of his acting\nskills. If you have nothing else to do on a boring weekend afternoon,\nthen go watch the Equalizer. InterSteller and Gone Girl were much\nbetter than Equalizer.<br><br>The first 20-30 minutes of the movie was good. But after that, the\nstory just sags. Nowhere near \"Training Day\" quality or story. Sad that\nit is a Denzel Washington movie and we do not see much of his acting\nskills. If you have nothing else to do on a boring weekend afternoon,\nthen go watch the Equalizer. InterSteller and Gone Girl were much\nbetter than Equalizer.\n"},
{"review": "\nSome films are a triumph of style over content. This isn't exactly a\ntriumph but Antoine Fuqua directs with a panache that the ludicrous\nplot and risible dialogue don't merit. There's a highly enjoyable\nshowdown in the US equivalent of Homebase, with nail guns, electric\ndrills, strimmers and a variety of power tools being used to murderous\neffect. The heavies are a mix of corrupt Boston cops and assorted\nRussian mafia, the latter sporting villainous facial hair and scary\ntattoos. They're no match for Denzel Washington, however, even though\nhe's looking a little on the paunchy side. In a finale that manages to\nbe more unlikely than what's gone before, he takes a short trip to\nMoscow to finish off the main heavy, one Vladimir Pushkin, no less.\nDaft but highly watchable.\n"},
{"review": "\nIn common with a lot of Hollywood features I have to confess I\npreferred the first half of this movie to the second half. <br><br>The first half of the movie is very much character driven and focuses\non the relationship between Robert McCall (Denzel Washington) and Teri\n(Chloë Grace Moretz). McCall is a man leading an ordinary life and\ngetting away from the extraordinary talents from his earlier life. He\nbefriends a prostitute Teri who is stuck in her situation despite\ndreams of being a singer. This part of the movie is extremely engaging\nand that certainly helps when the movie moves to a more action based\nfocus. <br><br>The second part of the movie is also pretty good although there's very\nlittle of the dialogue that makes the first hour so enjoyable. Well\nworth a watch!\n"},
{"review": "\nI rented this title based solely on Denzel Washington's presence. He's\na great actor and I have loved almost every role he's played from\nTraining Day to the Pelican Brief. This movie was a turd almost from\nthe beginning: the killing of five Russian mobsters over a girl he\nbarely knows. Not saying they might not have deserved it but this\ndisconnect runs through the movie. Wanton killing without ever\ndeveloping a believable motivation. The ending is so over the top, I\nhad to run home and watch the last Die Hard installment to wash the\nawfulness of this movie out of my mouth. The final killings in Russia\nwere sheer crap. So ridiculous, so over the top, I was left wondering\nhow Denzel ever agreed to a role in this slag heap. 4/10 is WAY\ngenerous.\n"},
{"review": "\nAll ingredients here for a Bourne-level epic but it never, repeat,\nnever, forms a cohesive whole.<br><br>You can almost hear the writers and directors talking among themselves.<br><br>\"We can't do this straight-up,\" someone said, \"because that's the way\nVan Damme and Seagal would do it. So we will slow it down, have long\nstretches where nothing happens, and really dopey music, the kind that\nalmost puts you to sleep. We will call that character development. And\ndon't forget to make the lighting dim, dim as possible. Can we have\nrain in every scene?\" First mistake.<br><br>\"We can't make this the equivalent of a martial arts film because we\nhave Denzel. So we low-key the action until the end.\" Second mistake.<br><br>\"Let's tease the audience with the backstory. That shows we are\ncreative. Hold the 'reveal' until the halfway point.\" That's three\nstrikes and you're out.<br><br>Oh by the way this COULD HAVE been done with class. The Koreans did it,\nsame basic story, MAN FROM NOWHERE 2010. And they produced a much more\nenjoyable film.\n"},
{"review": "\nThe advertisement showed Denzel Washington starring,and that was the\nmain reason i wanted to watch the film,and i did. Denzel didn't\ndisappoint,as expected. But the story did. At times,i felt he didn't\nreally need to get involved in the story at all-it was very impersonal.\nThe violence is good and stylish and deserves credit,but the action was\nwithout point-the hero seemed to be fighting without a cause,as if\nfighting for the benefit of the human kind for its own sake and because\nof that,the movie seemed to keep dragging on. I found myself checking\nthe time and wishing for the end.It could have been and should have\nbeen done better. I rate it 6 out of 10,mainly because of Denzel and\nthe stylized action.\n"},
{"review": "\nAlmost all said in the title. Denzel is great and I really like him but\nthis role is far too overpowered and all the bad guys look so\nincredible weak that one should ask oneself if those guys could\npossibly be able to rule/suppress someone without getting kicked by\nsome school boys. I like the first fighting scene (in the bar) which\nwas good but then it started to become ridiculous. He can kill whoever,\nwhenever, wherever with whatever he finds lying around. A mixture of\nRambo and MacGyver. Sorry but that was far too much especially the fact\nthat he consequently refused to use the heavy weaponry of the killed\nbad asses but preferred to use garden equipment or a nail gun powered\nby a war air pressure patron. I mean look at the power of the \"nail\"\ngun. I used some of those myself and they can never be that powerful\nout of the box. That is just one example of an too over-exaggerated\n\"hero\". 5 Stars because I like Denzel if it would't been him I would\ngive around 3 Stars.\n"},
{"review": "\nSeriously, this is a film for young kids who still believe in super\nheroes and fairly tails, otherwise you have to be a little dimwitted to\nlike to this film.<br><br>Let me start off by saying that the film is stylish, and had a lot of\npotential, however the scenes and storyline are really awful and\nquickly bring this film down to the gutter! The evil incompetent\nRussians vs the righteous American hero cliché is really well worn out!\nThe clichés, predictability and lack of originality are so nauseating\nthat i don't know where to begin. You literally know everything that is\nabout to happen. This is all well and good if it was a comedy or Arnie\nfilm, but we are expected to take this film seriously!<br><br>To sum it up, lame, cliché, unoriginal. Leave your brain at the door\nwhen you watch this film.\n"},
{"review": "\nMy expectation were not high when I began watching this movie (mostly\ndue to the fact that there are a dozen movies like this out there, with\nsimilar Russian mob clichés). But I am a huge Denzel fan, and I must\nadmit that there is a part of me that enjoys watching people get\nbrutally punished for their sins.<br><br>This movie made me feel happy, happy that justice exists at least in\nthe movies. It gives me a break from the harsh realities of life and\nhow helpless we are when it comes to crime syndicates. I enjoyed this\nmovie more than I had expected, particularly the music which just\nseemed very dark and appropriate.<br><br>Every man has a sadist hidden deep inside of him and since we live in a\ncivilized society, take out your frustrations by watching this movie.\nIt worked for me, it should work for you.\n"},
{"review": "\nThe equalizer is a formula movie. I guess the actor was in between\ndoing something interesting. It was cute to see him save Russian\nhookers if that is your idea of living vicariously though a lot of\npsychotherapy as to why you will never make it. He seems to be lost in\na giant hardware store like the ones we all go to. Of course what a\nbetter place than there to have action scenes like chasing people. It\nwas sort of Superman without the cape and tights. Basically, Mr.\nWashington is predictable and although remotely interesting, you know\nexactly what is going to happen. He wins every fight (just like\nSuperman) and no one is even close to beating him. The writers do show\na few levels of creativity with how to kill the bad guys. They seem to\nneglect the obvious of using identity theft which seems to be the\nbiggest scare we all have when using our credit card in a store like\nthat. Robert Stack\n"},
{"review": "\nI am speechless.. How, OMG, how this flick got above 7 on IMDb? What an\ninsult, not to Russians but to anyone with enough gray matter in their\nskulls. Cliché on cliché. We have seen this way too many times. All of\nit. And given the latest anti-Russian crusade by our\nless-than-competent administration this movie apparently is supposed to\nmake \"good folks\" to feel some righteous anger towards \"those savages\".\nDenzel definitely could do better here, without getting in to perilous\nNicky Gage's game. Could be a career ender for some. I am not even\nstarting about that ridiculous tattoos and accents. Yet another reason\nto stop watching anything mainstream.\n"},
{"review": "\nThis had the magic combination of unpleasant violence without\nrelevance. There was absolutely nothing original. Zero. That's unusual.\nIt wasn't a star vehicle for anybody. <br><br>Denzel could not decide whether he was Charles Bronson or Steven Segal.\nHe settled for Forest Gump. Perhaps Hit Girl could have done better\ntoo.<br><br>The film could have been almost 30 minutes shorter, but insisted on\nnonsense exposition of the revenge type. But every aspect of this type\nof film has been bettered elsewhere.<br><br>I'd be surprised if the Russian community don't complain. Every Russian\nwith a line (or grunt) was a dumb psycho.<br><br>Please just ignore this pile of shite.\n"},
{"review": "\nIn his previous movies such as Man On Fire and The Book of Eli, Denzel\nplays the Avenger so perfectly, it was difficult to believe he could\nsubstantially improve his performance.<br><br>And yet, after just walking out of the theater, I must say that Denzel\nmakes Jason Bourne look like, well....an understudy.<br><br>The action is so palpable, you could reach out and touch it, albeit\nextremely violent.<br><br>The co-actors' performances, almost without exception, are spot-on.<br><br>The fact that it's shot in Boston by the same producers as The Town\nadds to the appeal.<br><br>The soundtrack is excellent! Eminen's song at the end was a surprise\nwell as a Soundgarden track. Perfect!\n"},
{"review": "\nThe characters develop, the story unfolds..then after 40 minutes it\nturns into a Steven Seagal movie..played with Denzel Washington !! This\nis not as good as heat/ training day . I think I prefer Kevin's\nCostners' 3 days to Kill about 10 times over this. I hope he is the\ngood uncle in the next movie!<br><br>The movie is not original at all, the ending is pathetic, careless,..\nthe characters become inconsistent and careless! I should have left\nafter 60 minutes..Did the script writers/ directors get impatient half\nway through ? did somebody tell them we need more Steven Seagal?<br><br>Disappointed, I still give it a 5 ***** . 3 * for the first 40 minutes.\nand because the villain was also a good actor and 1* for Denzel ..It\ncould have been 8 * easy had the middle to end of story been more\nbelievable, the characters more consistent/ careful.\n"},
{"review": "\nI usually don't mind Denzel and was looking forward to see this\nmovie... Slightly intriguing at first although somehow already\npredictable. And then it became so tedious, like if it was superman\nwith a magic wand! There was some good effort with mood, music and\nsound but at times it was out of syn-ch. with the action, or rather the\nlack of it. I think I could have watch it in FF one step and save time\nfor the same result I think. Such a shame to waste good actors (for me\none good actor) for such a flat story. Wow I need more line I thought I\nsaid enough and I have nothing more to say about this film I found so\nbad and a waste of my time\n"},
{"review": "\nI like Denzel but never thought of him as a Jason Bourne type but in\nthis movie, he's definitely up there with Liam in 'Taken'. He doesn't\njust kick butt, he really kicks it and he looks them straight in the\neye when doing it. He's no nonsense, no explaining the situation, no\nnegotiating. The payback in this feels good because the bad guys are so\nbad - well acted, too. The scenes are done well - setting the mood. The\nlate night diner scenes are great. If you've ever been up in the middle\nof the night and couldn't sleep, and you go out to the local 24 hr cafe\n- this is just what you'd picture it would be like. You don't get a lot\nof detail behind Denzel's character only that he's definitely been\nthrough a lot, had a wife, has OCD. His apartment is stark - no\ndecorations, just the necessities to live. No mess. Everything in it's\nplace. Denzel does this characters incredibly well. It's a tough one to\nplay. There's very little emotion even in very emotional situations.\nGreat action - great power. Check it out - highly recommend.\n"},
{"review": "\nThis movie is up there with John Wick as pretty much perfect in my\nbook. I actually can't fault it. Not only does it have a superbly\nsatisfying plot, it's beautifully acted and has incredible\ncinematography throughout. Basically this is just a very simple\nvigilante story on steroids. Denzel Washington ploughs through the\nkilling with single- minded, stony-eyed purpose. The deaths of the\nbaddies are gory, inventive and leave you with a warm glow of justice\ndone. As with John Wick, there is no romantic distraction to water down\nthis excellent, macho indulgence: mano a mano from first frame to last.\nI'm on my third viewing. There'll be more. Highly recommended.\n"},
{"review": "\nThe diner scenes appear in the longshots to be a shout out to Hopper's\n\"Nighthawks.\" The eerie late night glow serves to accentuate McCall's\nrestlessness and inability to sleep. Teri becomes vulnerable there and\nshares her interest in what he is reading, rather than staying in\nhooker character. And McCall dispatching of the hit-man sent to kill\nhim stresses the finality of his actions.<br><br>While the last scene in Homemart is a little smaltzy, with McCall\ndispatching the tactically armed bad Russians with gardening tools,\nfencing and a nail gun, is a little incredible; it is a statement on\nhis inventiveness. Skills that have served him well in his \"black-op\"\nlife.<br><br>Leaving no loose ends he \"cuts off the snake's head\" and Teri is\nallowed to return to a life she desires. A well directed and shot\npicture that should keep you riveted to the screen.\n"},
{"review": "\nThis movie is a cross between The Professional and Taken. Don't get\ncaught up with Hollywood and Russian stereotypes and so forth. Just\nenjoy some good ol entertainment and action. That's what we're paying\nfor right? <br><br>This movie was amazing. I loved both the movies mentioned above so why\nwouldn't I love this one. This is even better because Denzel is so\ncool, calm and collected throughout the whole movie which makes him\neven more of a bad ass. He can't lose. All in all, this one is a keeper\nfor me and will be watching this again and again over the years. Slow\nto start but once it does, the action and dialogue is great.\n"},
{"review": "\nThe virtue of helping the unprotected and tendency of eradicating roots\nof evil shown in the film is respectful , but the role played by Denzel\nwas very clichéd . Another minus point is that the idea is that devil\nis from Russia.To cast the blame on a source out of the society.<br><br>confession of the ex KGB agent regarding that he has no emotions\nirritates the audience to induce and generalize this notion to\nRussians.<br><br>finally , I was expecting a much more sophisticated movie when I saw\nDenzel Washington was the actor.<br><br>It is just good for entertainment as superficial as Bollywood films .\n"},
{"review": "\nNot a bad film by any means but it could have been so much better. It\nis hard to know where it failed as Denzel is his usual brilliant best\nand Chloë Grace Moretz was incredibly good.<br><br>I also can't really blame the story line as it was pretty standard for\nthis type of movie. But maybe that's the problem? It follows the usual\nHollywood formula and other movies have done this sort of thing much\nbetter.<br><br>I also though there was far too much profanity, I am not a prude but it\nwas just over used by a few characters.<br><br>I also thought that the end scene could have been better. I didn't find\na lot of what Robert McCall did was overly clever and that is the whole\npoint of the Equalizer.<br><br>So overall I would say this is a watchable movie but not one I will be\ntoo keen to watch again.\n"},
{"review": "\nI never watched the TV series, but based on what I read about it, this\nis a not-too-bad movie version of it. Denzel Washington is well-cast in\nthe lead as a man with a mysterious past and a drive to help people in\nneed-and he meets one in a hooker in trouble with Russian hit men. He\npulls out all the violent stops to help her as she gets beaten up in\nthe process. Chloe Grace Moretz is good as the hooker who tries to\nbetter herself.<br><br>This is not for the squeamish due to all the persistent violence, but I\nlike the good substories and the leads. Get it if you are a Denzel fan.\n(Who isn't?) The acting and shooting (cameras and guns) are all good.<br><br>*** out of ****\n"},
{"review": "\nThe equalizer is a fantastic movie about Denzel Washington(McCall) Who\nis a hired gun or was a hired gun for the government we don't fully\nknow in this film and we don't truly ever find out what he was before\nwe see him For the first time we just know by the way he takes care of\n\"business\" that he doesn't mess around. If you haven't already seen\nthis movie in theaters you need to go down to the store and buy it\nright now!<br><br>The equalizer is a pretty straightforward movie no twists and turns no\nmystery nothing but blood and action. This movie is a gory movie and it\nhas been rated properly so if your thinking of taking your\nnine-year-old son to go see this movie don't on the other hand I'd say\nif you're more towards the age of 12 and up depending on the parent\nthis'll be a great movie to go see with some friends. I love this movie\nand I think you'll love it too I give the 10 out of 10 stars.\n"},
{"review": "\nOne thing that remains constant in this action packed thriller. Denzel\nWashington's mysterious former life remains just that throughout the\nmovie. What organization did he work for? Who were these two people\nfrom the group that we briefly see.<br><br>Settling down to a quiet life following his wife's passing, that is all\nupset when he meets a Russian girl, most likely a hooker, who is being\nharassed by her Russian gangster mates.<br><br>The rest of the film is devoted to Denzel assuming a Rambo role and\nkilling the first group, which sends others after him. All we then see\nare violent, horrible ways that Denzel kills his prey.\n"},
{"review": "\nHe prefers books over movies <br><br>He dislikes wearing cherry curls<br><br>He never blushes in front of girls <br><br>He is fascinated by Russian kitchen and night life <br><br>He loves well furnished rooms <br><br>He enjoys destroying them completely<br><br>He doesn't like bloodless victories<br><br>He can't dance, but serves well as one man army<br><br>He is overwhelmed by autistic thinking<br><br>He can't count well, or why would he let go the classy chick just with\na bunch of dollars, while having them stock piled in front of him\nthrough half of the movie? <br><br>Resumee: somewhat overdrawn &amp; spectacular towards the end, but many bad\nguys, hot chicks &amp; lots of cool FX. 6 out of 10.\n"},
{"review": "\nWatching this movie makes you wish Luc Besson had given the makers of\nthis movie some lessons about how to make an action movie. Director\nAntoine Fuqua turns things round with an invincible African American\nhero dealing with white criminals eg the Russian mob and crooked Boston\nIrish cops.<br><br>The problems are mainly in the pace and the action sequences. The pace\nis uneven, with some draggy staring scenes interspersed by some sudden\nexcessively graphic violence. The violence is revolting, not funny -\ntoo much is shown during each killing.<br><br>Denzel as the invincible vigilante like ex agent does some fighting and\naction but it's a bit like Liam Neeson's fighting in the last few Taken\nmovies - a bit suggested with camera work.<br><br>Chloe Grace Moretz as an abused Russian prostitute is a scene stealer\nand shows she can act any kind of role well.<br><br>Overall a not quite get your money's worth flawed action thriller.\n"},
{"review": "\nOf course we have seen \"this film\" before. Except for a few unique film\ndramas, most of us like the familiar of new wine in old bottles.\nRecently Liam Neeson has turned the revenge flic into a minor cottage\nindustry. And Charles Bronson did fine with Death Wish. Denzel\nWashington now gets a turn updating the old Edward Woodward TV series\nand he does a nice job. The bad guys are bad and unless you are a bad\nguy, you're going to cheer as this Robert McCall evens the score(s). No\ndoubt we might like some additional back story, but I'm in no rush. I'm\nwilling to wait for a second film for additional info. For this one,\njust sit back and watch this new Don Quixote tilt at Russian windmills.\nThere are some nice performances here by Bill Pullman, Melissa Leo, and\nfor me newcomer Johnny Skourtis. And Marton Csokas plays the villain we\nuse to hiss at during the Saturday Matinees. Let's hope we get at least\na trilogy out of this run.\n"},
{"review": "\nWhen I heard positive reviews from friends I decided to buy on DVD. I\nexpected more but I was not disappointed anymore. What I missed was a\nfaster pace with much more suspense. It works anyway as a solid action\nthriller. This could be even a promising franchise for the future. I\ncan imagine a sequel because it lets some potential story development.\nDenzel Washington came great here and was very cool. The action and\nexecution details were well studied. But be warned: there are some\nbrutal and bloody scenes.<br><br>I liked the clear message in this movie for peace and not to abuse\nminor teenagers.<br><br>For fans of Denzel Washington this is a must see. If you like this\ngenre I recommend all Taken series<br><br>My rating: 6.5/10\n"},
{"review": "\nOlder black John Wick does good things for people as the antagonist\nfrom xXx hunts him down.<br><br>In all seriousness The Equalizer has some good action, good\ncinematography at times, and it was entertaining. I marked it down\nbecause some of the dialog is not delivered great, and the story was a\nlittle generic and predictable.<br><br>The way John Wick handles it by not screwing around with a story and\njust getting right into was the way it should be done. The story of\nthis felt like it was trying to give him a purpose to do these things,\nwhen you could have just done them from one incident.<br><br>It also tries to tell you why he got out of the businesses, they give\nyou his whole backstory. John Wick implies it, which it great, it\nleaves some mystery.<br><br>Overall, good movie, but John Wick did it better. I won't be buying it,\nbut will probably watch it a second or third time. If Nicolas Winding\nRefn would have stayed and directed it, it would have been great.\n"},
{"review": "\nWell, Liam Neeson must have been busy so the producers got Denzel\nWashington to take the lead. This character is exactly what Neeson has\nbeen playing in his recent movies like Taken. I guess now that Denzel\nis over 60, he wants to become an action star like Neeson.<br><br>In this film, quite, mild mannered Robert McCall, whom works at a Home\nDepot type of store, befriends a young hooker. Well the Russian mob\nbeats her up and he's mad. First he tries to buy her freedom, but when\nthat fails, we find out exactly what kind of a guy McCall really is.\nPretty good scene as to how he takes care of the gangsters.<br><br>Well the head of the mob is losing money, so he sends his ace guy to\nfind out whom killed his guys. The guy tracks down McCall and he's not\nprepared for whom he's up against. McCall visits some old friends to\nfind out whom these mob guys are and then it's on. McCall uses his\n\"skills\" to take care of the bad guys in some pretty cool ways, never\nusing a gun.<br><br>FINAL VERDICT: Fun, over the top, action flick. If you are tired of\nshoot outs, check this movie out.\n"},
{"review": "\nYou get what you expect from this,its a revenge flick .Doesn't ask for\nanything else just a few hours attention.Typical good guy versus bad\nguy stuff with nasty Russians thrown in,then thrown out. Man On Fire it\ncertainly is not,but it does not pretend to be either.Taking its name\nfrom the TV series seems rather odd but there you go.Den Washington\ndoes a great job as a brooding nobody who used to be a somebody.Good\nfight scenes that get a tiny bit silly toward the end but it's all done\nwith the best intentions. Probably the start of a franchise. Good movie\nmaking and a step up from the usual revenge flick.Just checked my\nwatch.....\n"},
{"review": "\nThe Equalizer (2014). Better yet, fill the empty box with Denzel\nWashington \u0096 secure in his position, coolly cranking out box office\nhits \u0096 then dress it up a bit so it looks like it's about a few halfway\nrelevant things, or even just one thing, or even just half of a thing.\nAnd if that half of a thing is Denzel Washington fighting the faces off\nof bad dudes with lumber and drills and his bare hands, then that's a\ngood enough half of a thing.<br><br>Washington is Robert McCall, a Boston man with a mysterious past. He\nlives quietly and works at a Home Depot-style store called \"Home Mart.\"\nHe's an insomniac, spending his nights reading classic literature in a\n24-hour diner so Edward Hopper-ish that it might as well be named\n\"Nighthawks.\" He reads The Old Man and The Sea. He reads Don Quixote.\nThese titles are meant to convey the shape of his soul and the deeper\nthemes a different film might explore. Aim well, movie; fill that box.\n"},
{"review": "\nA former secret agent with a special set of skills who has tried to\nleave all this behind him but is pulled back into the field when a\nyoung woman is badly treated by foreign thugs. Sound familiar? This is\nvery much the ground trodden by the \"Taken\" franchise, although the\ntitle of this film and the name of its lead character are borrowed from\na television series of the late 1980s. <br><br>On the small screen, Edward Woodward played a British former spy; in\nthis big screen version, the role is filled by the charismatic Denzel\nWashingtion as ex-CIA. It starts slow and remains pedestrian for\nhalf-an-hour so. Then the action starts and rackets up and up to a\nmajor shoot-out in the hardware depot where Robert McCall was\npreviously a nondescript worker and now find original use for some of\nthe tools on sale.\n"},
{"review": "\nThis could have been good, the idea was good, but between the script,\nthe lead actor strutting style and the Mr Invincible Persona, this in\nthe end was quite poor and not even remotely believable (makes James\nBond look true to life). Given the TV series had a measure of sense,\nthey seemed to have gone OTT with this as while letting their lead do\nhis brooding act at the start to then his arrogant can't touch me smart\nalec style. Denzel Washington does his usual self-righteous peacock\nacting and at no stage is there any suspense as this leads to a\npredictable ending without even anything that goes anyway off cue. This\nis very disappointing as with a better script and a better actor (he\nseems to have one style and that's it), this could have been done\nbetter. I think if Superman,Batman and the Marvel avengers all turned\nup, Washingtons character could beat them all up while drinking a cup\nof tea.\n"},
{"review": "\nI was hoping that having Denzel Washington and the director of\n\"Training Day\" onboard, \"The Equalizer\" would have been epic. Sadly,\nit's not but it still is a must watch, in my opinion.<br><br>Honestly, I thought the story to this one was pretty messy and way too\nboring in way too many parts. Additionally, the characters are pretty\nlackluster and don't really have much depth to them\u0097well, most of them\nanyway. However, the acting is great and Denzel is just cold as ice in\nhis role. But the true shining light in this film is the brutal and\ngritty action sequences. These parts break up the film's tedium and\nmonotony extremely well and singlehandedly make the film something to\nwatch.<br><br>\"The Equalizer\" might not have ended up as intriguing and engrossing as\nI had hoped it would have been but watching a cold, calculating Denzel\ndeal out justice with an icy stare makes the film something to take in.\n"},
{"review": "\n(spoilers) If you're in the mood for a Mindless action movie with a\nstandard Denzyl Washington performance, the you might like director\nAntoine Fuqua's \"The Equalizer\". And notice Mindless with a capital\n\"M\". Here you have a lead character, conjured as part Macgyver, part,\npart Casey Rybeck and part Jason Bourne though infused with the\neloquence of Washington. It makes for an interesting and CALM Bad@$$.\nThe movie though is completely ridiculous making Equalizer character\nRobert McCall into a superhero, with super-reactions - devoid realism.\nIn only one fight the whole movie is he actually physically challenged,\nand oh, what an unclimactic terrible final fight with the Martin\nCsokas, playing a menacing enough bad guy. The thugs are imbeciles or\nbrainless, and the untouchability of Washington's character got stale\nquickly. 6/10 for Washington's effort and some fun action scenes.\n"},
{"review": "\nWe all make mistakes. One of my greatest failings (if you ask ME, that\nis) is that I often rent or pay to see a movie without double-checking\nthe credits. I sat through THE EQUALIZER because I think Denzel\nWashington is one of the finest actors of his generation and because\nI'd often enjoyed the teleseries upon which this movie was based. It\ngets off to a slow start, with scenes as predictable (and just about as\ncompelling) as, say, the opening scenes of an episode of an old\ntelevision series... and it doesn't really make any Forward Progress.\nIt's been quite some time since I saw an episode of the old teleshow,\nso I'm not going to say one's better than the other, but I WILL say\nthat I expected a lot more from this movie than it delivers. Washington\nis wasted here. THE EQUALIZER is standard \"action fare\" of the\ntelevariety- nothing more.\n"},
{"review": "\nI liked it. I laughed. DW killed five Russian gangsters alone and bare\nhanded. Then the new but not improved villain take his guys to the Home\nDepot where DW works. Sarcasm intended \"hey great plan\" I'm thinking\nOMG I'll need pen and paper to keep track of tools. Then I'll need more\npaper for the ways they die. It's the children of the corn scene from\n\"Twister.\" This is a sequel to \"A Million Ways to Die in the West\" or\n\"Man of Fire\" no wait, does \"Creasy\" die at the end of that one? I\ndon't get the title, is it meant to be ironic? \"Equalizer\" he doesn't\ntake a gun because it wouldn't be fair. The idiots have everything but\ninfrared. I love the line \"He's not looking for help he's asking for\npermission!\" Other movie quotes \"Just how dangerous is he\"; \"Compared\nto what.\" \"He could be right behind you and you wouldn't even know it\ntil you're dead.\" \"He can kill most men with his breath.\"\n"},
{"review": "\nNothing more than a 7/10.<br><br>How many times did we see this scenario. One guy with AMAZING martial\narts skills goes 1v100 against a whole Russian,Albanian mafia and kills\nthem all.<br><br>It is really packed with good action scenes and for the people who love\naction movies this is the real one for you. <br><br>Denzel gave an amazing performance once again. But still, with these\nkind of movies, he will not make it in the top 250. Too much cliché in\none movie.<br><br>For a conclusion, if you love action movies this is the one for you.\nBut if you don't love Action and so much cliché and unreal killing,\nplease do not decide to watch this movie. There are plenty of other\nmovies that deserve to be watched. :)\n"},
{"review": "\nWhen, as a kid, I was asked what 'The Searchers' was about I told that\na Comanche tribe had the stupidest idea you could have in Far West:\nkilling John Wayne's family. And that the rest of the movie was the\ninevitable consequence of it.<br><br>This was my first encounter with 'God of Vengeance' kind of film. And I\nliked it, just as I liked the present one. There great sceneries filled\nthe screen, here very good action, fantastic lighting and the\nastounding performance of Denzel Washington nail you to the seat.<br><br>I don't think this kind of films has a good influence on kids: to me it\nseemed that John Wayne was right, the revenge he pursued was noble and\nkilling those Indians made him a better man. If a Comanche tribe ever\nwere to show up in Rome and kill my family\u0085 well I don't how it would\nhave ended.<br><br>But, you know, probably I just was the only stupid kid on Earth.\n"},
{"review": "\nThe story isn't anything new or unique. The plot is fairly predictable.\nDenzel plays an unstoppable bad-ass anti-hero who kicks ass. This\npretty much sums up the film.<br><br>But its solid entertainment. The action sequences are wonderfully\nexecuted. Some very interesting kills in the film without the use of\nmany guns. The atmosphere set is wonderful. The film feels a bit long\nat 132 minutes and certainly could have been a bit shorter but its\nstill entertaining throughout its runtime. You will certainly enjoy\nsome great R-rated violence if you are a fan of it. Denzel acts very\nwell and is a bad-ass you will root for.<br><br>A solid 7/10.\n"},
{"review": "\nI liked the movie. I enjoyed its entire run time except the finale. It\nspoiled the entire build up of the story. If the Villain killed some of\nthe Home Depot employee's it would have ended spectacularly but we get\ntoo much of Deus Ex Machina vibe in the end. One man can't save\neveryone. Sometimes when a war's started there will be casualties.\nDenzel may be calm, precise and deadly but he too can't kill 10 people\nwith a single sniper shot. Chloe grace's acting was good but I liked\nthe actress who played Chloe's friend. She really looked the part. This\nis not a full blow by blow action movie. I realized when I saw the\ntrailer that I have to savor the silence and enjoy the mayhem. Becacuse\nsilence increases the violence level.\n"},
{"review": "\nA classic Denzel Washington movie: his looks and faces, blazing guns\nand some story. And you enjoy the hell out of it! It's an entertaining\nmovie just to watch, relax and see some shooting. The story is full of\nclichés, such as military background, going under the radar,\nprostitutes to save and all that, but, in the end, you end up liking it\n:)<br><br>However there were some issues that I found annoying: 1) The thing with\nhis watch, that he uses only in some parts of the movie to time his\nactions is never explained, 2) The old Russian Mob Cliché, 3) Old\nstory, other actors 4) Really, no one could find that girl?! 5) And\njust like that get all the images for all cameras from six blocks.\nYeah.\n"},
{"review": "\nAntoine Fuqua's 'The Equalizer' is skillfully made and boasts a strong\ncast, led by the always great Denzel Washington, but as I was watching\nit I couldn't shake the feeling that it just wasn't quite clicking the\nway it should. Like a high performance sports car with a bad piston.<br><br>I did appreciate that it took its time building up to the point where\nDenzel inevitably begins equalizing, but after he's pulled back into\nthe world he'd thought he'd left behind, it seems like everyone in his\nlife suddenly finds themselves in need of his special talents and the\nstory begins to lose its focus and momentum. Perhaps this premise is\njust better suited to episodic television.<br><br>Despite all this, I would say that 'The Equalizer' is definitely worth\na watch and I'd be up for a sequel now that the groundwork has been\nlaid.\n"},
{"review": "\nI am writing this review just to do what I can in my small way to lower\nthe viewer rating for this movie (if that is what it was). I can only\nspeculate that the majority of viewers saw another movie, certainly not\nthe one that I tried to watch. I did not stay to the end but that is\nbecause the older I get the less inclined I am to torture myself. I\nsimply refuse to believe that somewhere in this country that there are\nnot writers who could actually write a screenplay for Denzel Washington\nthat would at least rise to the level of mediocrity. The writing in\nthis movie could only have been dreamed up by a social deviant during a\nroot canal. It scares me to think that anyone around me might find such\nviolent moronic tripe to be entertainment. The only saving grace is\nthat apparently it only takes one ex-CIA agent to dismantle the best\nthat Russian mobsters can throw at him, and boy did they try to! GO\nUSA!\n"},
{"review": "\nThis is a vigilante movie. A man with a dark, mysterious past, lives an\nordinary life, until something wakes his older self and he starts\neliminating bad guys. <br><br>The premise is old and overused and there are hardly any innovations in\nthis movie. However, it is very well made. Nicely acted, Denzel is\nconvincing at his role and the supporting cast play their parts very\nnicely. Nice direction, nice soundtrack and a decent finale. No upsets,\ntwists or surprises - No disappointments, letdowns or frustration\nwhatsoever. It is pretty violent for children and some women were\n\"annoyed\" by the brutality of some of the killings, but it won't give\nyou nightmares.<br><br>Overall I was entertained by this movie, fans of the genre will be\npleased.\n"},
{"review": "\nThe equalizer is a very violent film but surprisingly humorous at times\nfor example: when densely asks to see the guy's gun and looks away then\njust takes it from him. In the warehouse when he sets all the traps,\nits like home alone and you expect one of the bad guys to get hit in\nthe face with and iron, or a blowtorch but the bad guys didn't fall for\nthat one. You see that the main character can heal himself temporarily\nbut very quickly, and still appears to be helping people at the end of\nthe film, which leaves it widely open for a sequel. I think it's very\ncreative and well produced and look forward for and possible sequel.\nGood Film!!!!\n"},
{"review": "\nI can not understand what is the meaning of this more than two hour\nfilm. That there are some ex FBI guys who if got angry could destroy\nall alone the Russian mobsters all over the globe, even in Moscow, no\nmeter they are like a crow among pigeons. but they don't. got angry.\nstill. @!?!?! I don't just like Denzel Washington, I love him; why?!?!\nAt the first half hour I thought: wait, this is Denzel after all, wait\nand you will see the hidden masterpiece. This is not even a good action\nmovie.. Are the authors trying to create the new super hero: the\nsupermarket man with hammer and drill, who calmly kills the bad guys.\nHe's got mysterious abilities that we do not see or even been hinted\nfor, he just travels the local bus and protects people he likes. He\nsays he do not knows why, just trying to reach justice and peace!?! I\nsee it is based over a comics, maybe some do not need to be filmed!\n"},
{"review": "\nThis review does not contain spoilers. I am a huge action fan, but i am\nalso 30y, and have been watching many action movies so when you read my\nreview you must take that into account. <br><br>We have all seen this before. This movie brings nothing new to the\ntable. Denzel movies are usually pretty good, and has a twist to the\nregular action movie plot, but not this one. This movie is just\nstraight forward. <br><br>Its also very violent. I like violent movies like \"the raid\" for\ninstance. But this movie just plays on violence because it has nothing\nelse. It makes the violence seem like a trick to keep you watching. I\nwatched the whole thing thru anyways, don't make the same mistake.\n"},
{"review": "\nI saw \" The Equalizer \" starring the immensely smart Denzel Washington\nas the protagonist. He plays this shrewd man called Robert McGall who\nstays away from what he does best until a day arrives when he comes\nacross a situation which forces him to expose his \"other\" side. And\nthen all hell breaks loose. And thereafter, the movie's entertainment\nquotient increases by leaps and bounds.<br><br>Denzel Washington exudes this chic persona in almost every movie\nstarring him. He does the same for this movie and the result is for you\nto see. And the bad guys are just as awesome. The man who plays their\nhead seems to be the perfect fit for a heartless villain, ready to\npounce on his adversary at the first given opportunity.<br><br>Antoine Fuqua is a lovely director. He had directed Denzel in the\nsuper-awesome \" Training Day \" and their second collaboration has done\nwonders again. The city of Boston has been shown in all its grandeur.\nBuy yourself a plate of nachos and sit back and enjoy watching Denzel\nwreak havoc. I'm sure you are gonna love this movie.\n"},
{"review": "\nI went to the movies to see an action film and I got what I payed for,\nhowever I will say that the beginning of the movie was painfully slow,\nwatching Denzel Washington read in his empty apartment is not my idea\nof a good time. However once the movie gets to Denzel Washington\nbeating the crap out of Russians the quality of your experience goes\nup. I'm not sure if it was supposed to be subtle comedy or it's a\nRussian style, but the mustache on one of the goons in the movie was\njust ridiculous, so much that I laughed aloud. The movie definitely\ncould have gone without it. Anyways I was not taken by Chloe- grace's\nperformance as a Russian prostitute, it would have been better casted\nby someone who looked more mature, like scarlet johansson. I mean\nwatching Chloe-grace in kick ass as a borderline kid and then watching\nher as a hooker, was too hard to believe. However if you are into\naction the second half of this movie is for you.\n"},
{"review": "\nfor me action movie should be a realistic one, i am not watching a\nscience fiction movie while the hero has abnormal abilities,\nconsidering that he is a human being. i saw the abilities of Denzel\nWashington near those Arnold Schwarzenegger has in terminator movie,\nand its not fits the differences between pure action film and a one\nwhich has in it a science fiction sides. also no one can defeat an army\nspecially when we talks about a Russian mafia gangs, the master\nexaggerated scene was when Denzel break into the mafia boss castle\nfacing no resistance, killing him and walk away on peace, how ironic\nspecially while Denzel left with no wounds. the movie has its nice\nsides of entertaining and it full of action and rapid strikes. There\nwas a rush in the end As if the filmmaker note that the film Has lasted\ntoo long, so he decided to end it skipping some action scenes that are\nnecessary to complete the whole image. so you can see it if you have\nenough time and not interested in details.\n"},
{"review": "\nEqualizer was a bit of an unexpected surprise. First, I would never bet\nagainst Denzel. I usually enjoy all his films. I was on skeptical since\nAntonio Fuqua has not really won me over as a director. Unlike the\nmajority of people I did not like \"Training Day.\" Therefore I was a bit\nskeptical of the re-teaming of Denzel with Antonio. Fortunately I was\npleasantly surprised. This movie was really good. Denzel has been on a\nrole lately with his foray into more action oriented films lately. He\nplays the character with such understated poise and humility. The hand\nto hand combat was great. The movie has a message but does not hit you\nover the head with it. Marton Csokas was stunningly evil. He is the\nkind of villain like Anthony Hopkins....quiet but lethal. Even when he\nis not doing anything he just makes your fearful of what he could do. I\nwould love if Denzel finally gets his own franchise since this could\neasily have a sequel. Overall great movie and worth the price of\nadmission. Perfect casting!!!\n"},
{"review": "\nThis movie probably invested by USA Government! Hahahaha, Obama killing\nRussian oligarchs by his hand drill against machine guns and killing\nthem, and taking their tonnes of money of their storage! and finally\nkilled Putin! what a poor story and never seen like this stupid movie\nwith 7.4 ratings and also from Denzin Washington, don't understand why\npeople giving 10 on this piece of ###, the story is unclear, who is\nthat professional man, and howecome one person doing karate against\nfully armored professional killers, and showing that USA cops are too\nstupid and nothing can do, and Obama is too old for that fast movement\nagainst youngsters, it is like Superman, wanted to proof how USA black\nman strong for the Russians, very unsatisfied and wasted whole 2 hours\nlike this stupid movie ... this rating is just overrated!\n"},
{"review": "\nVisually appealing yet remarkably devoid of content and vitality. But\nthat's what a Hollywood \"action potboiler\" is supposed to be all about,\nisn't it? I'm not sure what I was expecting, and yes, I'll have to\nreflect on that, but ridiculously slicing-and-dicing and hole punching\nand barbwire garroting, etc., the generic Russian prison tattooed bad\nguys in the local hardware warehouse left me cold and annoyed I'd\nshelled out the price of a ticket. I wonder how it would have played if\nhe'd worked at Dunkin' Donuts? Admittedly, the bad guy was venal and\nrepulsive, just another \"thug doing his job\" (trained on the streets of\nGrozny?) when no one else on the oligarch's staff can get the job done\n- and he got his just desserts. Yay! And the reformed teenager finding\nhim on the street at the end to thank him? You're kidding, right?\n"},
{"review": "\nBut the movie was pretty poor. I get what they were trying to do, but\nwhy bother. It's been done so many times already. It's been done a lot\nbetter elsewhere. Hell, it's been done better elsewhere by Denzel\nWashington. Watching him in this is like watching Muhammed Ali getting\nknocked senseless by nobodies at the end of his career, or seeing\nRubens Barrichello lapping Michael Schumacher. Fortunately, there\nwasn't too much of that \"I'm too old for this\" rubbish. It's bad enough\nwhen aging action starts try to re-live their youth, but worse when\nthey have to constantly make excuses for why they suck. Chloe Moretz is\npretty lame in this, too. All the promise she showed as a little kid\nhas come to nothing, since her acting is no better now than then, only\nnow there is no excuse. It happens. She's going the way of Christina\nRicci and will be appearing topless in a zombie movie in the\nnot-too-distant future\n"},
{"review": "\nThis movie is a movie with the best black players that I have ever seen\n!!! other than that, this movie can inspire everyone that the position\nwas very similar and we all should not discriminate between people.\nThis movie players that Denzel Washington has inspired me in the world\nof cinema. This movie is very memorable for me. I really appreciate the\nfilm.for me this film as a crunchy snack once and shall at all to\nwatch, especially for adolescents and adults. dazzling action and\nextraordinary in my opinion is very great and can hypnotize all\naudiences This is one of the greatest action movies I have ever seen in\nthe world of international cinema. I think that's it. that can be an\ninspiration for all the audience and continued success for the world of\ncinema world\n"},
{"review": "\nDenzel stars as a man with a hidden past that includes many specialized\nand dangerous skills. The prostitute he befriends is beaten up by the\nRussian mob. All he really wanted to do was to encourage her to read\nclassic literature, instead he's ready to take down the mob\nsingle-handed. <br><br>It really seemed like the movie was supposed to star Liam Neesom (might\nof been better too). <br><br>Same story as hundreds of other movies, just ramp up the violence. Same\nDenzel: how many times do we have to see him squint his eyes and look\nwith serious hatred, then suck on his bottom lip. It was great in\nGlory, but come on man, learn some new facial and vocal expressions\nalready. He is the same in every movie. Which only made this worse. <br><br>I suppose it's a decent action movie for a matinée or a rental, just\ndon't make it your first choice.\n"},
{"review": "\nI am a great fan of Denzel Washington and really wish he made more\nmovies, but this one I didn't enjoy. Yes his performance was good; he\nalways is but the movie was nothing but one scene of stylized violence\nafter another. I enjoy bad guys getting there due as much as anyone but\nsometimes it's just a little too much and frankly just ridiculous. Here\nyou have two intelligent people couldn't they find something more\ninteresting to do with Nikolai and Robert but this. Again Hollywood\nsuffers from really terrible storytelling. It seems the only good\nstorytellers are Disney and Dreamworks. Maybe Denzel should consider\ndoing an animated movie or some Indie movies instead of this junk. We\nknow that they're going to do this story again I hope that somewhere\nthere is a good writer that they can tap.\n"},
{"review": "\nLet me guess? Denzel Washington is the hero again taking down all of\nthe Russian mafia in his wake with some very predictable and no so\noriginal fight scenes. I am not sure how many times I have seen Denzel\nwalking away with an explosion in the background and at times I felt\nlike I was watching Man on Fire again and had to remind myself that\nthis was not that film. While this is not by far Denzel's best action\nfilm, it is entertaining for the most part and I found the best scene\nnot actually one of the fight scenes but the verbal confrontation of\nboth He and Teddy (Marton Csokas). I did get the feeling that this film\nwas made in a hurry as it simply could have been made so much better,\nin saying that it is worth watching so long as you remind yourself that\nit is just a movie.\n"},
{"review": "\nThe Equalizer is just the same old tired rubbish you've seen before.<br><br>Denzel Washington plays the same character he's played about 10 times\nbefore. <br><br>Clichéd, boring characters with highly unimaginative back- stories. <br><br>Dull, forgettable plot. <br><br>Slow motion walking with explosions in the background.<br><br>If you've seen a Hollywood action film in the last 10 years there is\njust no point watching this, it's nothing new whatsoever.<br><br>However, if you're just looking for a mindless action film to kill an\nhour and half, it's watchable, just don't expect much.\n"},
{"review": "\nDon't listen to people saying the movie is slow. Trust me, the movie is\neverything except slow.<br><br>It wasn't action heavy, but it had some good characters, good action\nand amazing performances.<br><br>The best parts were the moments where Robert and Teddy were face to\nface. I would like to see more of these scenes. <br><br>The best part was the final action bit, where our hero uses everything\nhe can, to kill the bad Russian guys. From spears to barbed wire to\ndrills. Did I forget to mention glass and nail guns?<br><br>The ending sets up a sequel, so be sure Robert ( Denzel ) will be back\nfor more. He IS The Equalizer.<br><br>The flaws are the main villains deaths, which were weak. I also missed\nscenes during daylight.\n"},
{"review": "\n\"The Equalizer\" is an Action - Crime movie in which we watch a man\nbelieving that he changed and left his past behind him. All of these\nchange when he meets a young girl who is under the control of Russian\ngangsters and he decides to help her.<br><br>I liked this movie because it reminded me a combination between the\n\"American Gangster\" movie and \"Training Day\" which in my opinion is two\nof the best movies of Denzel Washington. The plot of this movie is very\ngood with a lot of mystery behind the main character which is something\nthat makes him as the time passes more and more interesting. The\ninterpretation of Denzel Washington is for one more time magnificent.\nAnother interpretation that has to be mentioned is Chloë Grace Moretz's\nwho played as Teri the young girl who is under the control of the\nRussians.<br><br>Finally I have to say that \"The Equalizer\" is a very good movie and I\nstrongly recommend it to everyone to watch. In addition to this if you\nare a fan of Denzel Washington's then this movie is a must for you.\n"},
{"review": "\nThis action-thriller is actually based on an old 1980's TV series; but\nremember this is the big screen...do it big or don't try it at all.\nDenzel Washington plays Robert McCall, a former intelligence operative\nlooking forward to retirement. He does return to working, but it is\nmundane and fits his newly scheduled lifestyle. He has tea and reads a\nbook every morning in a local dinner about 2:30. He notices an\nattractive young girl, Teri(Chloe Grace Moretz); and is a bit concerned\nabout her obvious life choice of \"hooking\". When she is brutalized, the\nnatural thing is to come to her rescue. Doing so McCall ends up going\nagainst a Russian Mafia's prostitution business and major crime ring.\nFury is unleashed.<br><br>Other player's: David Harbour,Vladamir Kulch, Melissa Leo, Haley\nBennett, David Meunier, Bill Pullman and Johnny Skourts.\n"},
{"review": "\nDenzel Washington has discovered invisibility. He can walk through the\ncity killing all the bad guys, but no one ever see him. He is so proud\nof his invisibility, that he even rejects taking the guns when he has\nthe opportunity and 10 armed guys in front of him, because it is\nfancier to kill them with his own hands (or whatever devices he finds\naround, to make the movie bloodier than needed). Of course, he gives\nthe bad guys the opportunity to repent from their sins, but they reject\nand he feels obliged to kill them (typical justification of the capital\npunishment of so many American movies...). All this spiced with the so\noriginal wuthering past of a guy who does not like what he does but is\nforced to do it by the reality, the corrupt policemen, and the dumb\nfriend who finally becomes a hero (if not calling the police when\nseveral armed guys are trying to kill someone could be considered a\nheroicity).\n"}
]