[
{"review": "\nTo be honest, when I saw the preview I thought it was going to be\nanother Disney movie gone bad. So when the movies came around, I had\nreally low expectations for it. But holy crap nothing has made me laugh\nthis hard at a movie since maybe Amelie or Up! Baymax is a\nnon-threatening huggable robot who's only purpose is to nurse those who\nare in need of medical attention. The only way to wake him up is to\nscream out \"OW\" and he is alive and will help you until you are better.\nThe only way to put him back to sleep is to say \"I'm satisfied with\nyour work\" (Or something like that I'm only paraphrasing) and he has\ngone back to sleep. But this movie isn't all comedy: it does have a bit\nof an emotional side to it which I won't go into too much detail about.\nHowever I do know that the movie isn't really like the comic books: the\nback stories of the characters aren't how they are in the movie and\neven the plot itself isn't like how the movie is, so for the devoted\ncomic book fans, I understand if you hate this movie. However the\npeople who didn't read the comics confuse me when they say it's\n\"Cliche\" \"awful\" \"boring\". I found none of these things in the movie at\nall. I was smiling right from the beginning and found myself a little\nteary-eyed towards the end. <br><br>So I do recommend this movie if you're up for a nice light movie with a\nlot of laughs: it might be better than you think.\n"},
{"review": "\nThe last time I left a cinema feeling anything close to this elated was\nafter Gravity. My heart was racing, I felt so joyful. I never feel like\nthis after a film. Big Hero 6 immediately replaces the Lego movie as my\nNo.1, main stream, animated film. <br><br>I came onto IMDb to find out more about this entertaining, action\npacked, emotional roller-coaster only to see half a dozen vicious\nreviews ... I feel so somber. I can't believe anyone would loath this\nfilm to the levels of some reviewers have gone to on this site. It was\nan absolute joy. The whole cinema was ecstatic, both kids and adults. <br><br>I have a 7 year old boy, and even without being a dad, I'd still love\nthis film. Hope it picks up the awards (Oscar, Golden Globe, BAFTA etc\netc) it deserves.\n"},
{"review": "\nPlease don't listen to the bad reviews and watch this yourself.<br><br>I registered with IMDb just to write this. That is how much faith I\nhave in this film. I really cannot believe some of these bad reviews..\n\"Not a kids film\"?? kids would go mental for this.<br><br>Animation was nothing short of exquisite<br><br>Comedy was extremely funny (and i'm not one for comedies)<br><br>Story line was really great too<br><br>Also made me cry a little... meh<br><br>please please please watch how awesome this is. i'm nearly 28 and I\nabsolutely loved it.\n"},
{"review": "\nHaving the opportunity to view this film twice really helped me get a\nperspective of the film that many may not have right now. This film is\nnot FROZEN... it is not filled with songs or magical snowmen.<br><br>But this film has something else, it has family, friends, action ,\ndrama, and most of all a big robot named Baymax who will examine your\nfunny bone and sense of humor . The film shows what kind of magic\nDisney can do with super hero's . The story is fast paced for the most\npart and the laughs and entertainment are high flying, that is if you\nlike heights , but if you don't its OK because this movie knows how to\nget down also. <br><br>The characters work well with each other, kinda like the scooby doo\ncrowd but twist that with a bit of incredibles and you have a fun\nfilled, action packed movie that will delight boys and girls of all\nages and keep parents happy that they took their child to see this. I\nknow my family and I enjoyed it twice and will be back for multiple\nviewings.\n"},
{"review": "\nDisney has brought many gifts and rarely disappoints me. Big Hero 6 is\none of the best Disney films I have seen since last year's Frozen. This\nfilm is fun, clever, imaginative, and filled with spectacle. While the\nfilm is somewhat similar to Pixar's The Incredibules due the film's\nplot dealing with robots and and children with superpowers, it is very\nenjoyable and would easy please children as well as parents. <br><br>Big Hero 6 is not only brings out the charm with heart-filling\ncharacters and comic relief but has some of the most dazzling CGI I\nhave seen in a Disney movie. The animators did a fantastic job on the\ncharacter models and the environment was nice looking. My favorite\ncharacter would probably be Baymax. What's not to like about a funny,\ninflatable robot who cracks funny one-liners,has the power to heal, and\nassists Hiro (main character) on his quest to defeat an evil scientist? <br><br>I can't tell you how much I enjoyed this movie. I recommend this movie\nto all parents and children. Big Hero is a family thrill ride!!!\n"},
{"review": "\nContains spoilers, pass this review if you don't want to see any\nspoilers, such as end scenes and more.<br><br>I actually wasn't planning to watch this particular movie, until my\nfriends told me it was a good movie and that I should watch it.<br><br>I decided to try it and see how it goes. I instantly fell in love with\nBaymax. He's huggable and simply adorable. Along with that, he's a\nHEALTHCARE companion! It was certainly a HILARIOUS movie, and I enjoyed\nevery last bit of it.<br><br>I love how that Hiro, originally a boy who was interested only in bot\nfights, decides to do something big- starting with joining the nerd\nlab. There. he meets people like Wasabi, Fred, Go-Go, and more. <br><br>This movie also played with your emotions. And no, not just a little\nbit, but a lot. Disney seriously did a good job doing that. This movie\nwas one of those that actually almost made me cry. Near the end, Baymax\nhad supposedly \"died\" and that made me very emotional. I was so happy\nthat at the end, Hiro managed to make another Baymax using the chip the\noriginal Baymax had left behind. <br><br>All I have to say is that this movie is definitely one worth watching,\nespecially if you like humorous animated films.\n"},
{"review": "\nBig Hero 6 [2014] is the Disney 3-D animated comedy action film that\ncenters on Hiro Hamada, a 14-year old robotics prodigy, Baymax (an\ninflatable health companion robot) and an unlikely team of superheros. <br><br>5/5 graphics. Big Hero 6 transports viewers into a new visual realm and\nrelatively individual style (besides its anime resemblance). The story\nis set in the futuristic city of 'San Fransokyo'. A little of Tokyo and\nSan Francisco in one place. This explains the amalgamation of both\nJapanese and American components within the story and setting. It\nshould be noted that Big Hero 6 is not a wholly original idea, and the\nanimation is inspired by the Marvel comic by the very same name. <br><br>Baymax. Voiced by Scott Adsit, this lovable robot is animated to appear\nsoft, cuddly and adorable, credit goes to the graphics and writing team\non this one. Hiro's close friendship with Baymax is a highlight. Baymax\ncan hold his own on the screen alone too, just strolling through the\ncity streets, caring for others health and well-being. So yeah, he's\ncute and he knows it. <br><br>Expect to have a couple of teary moments. I won't describe or skim\nthrough details, out of utmost respect for those who haven't had a\nchance to see it yet. Since more serious topics aren't the usual in\nchildren targeted animation films, it's a nice change of pace. <br><br>Fantastic message for the young'uns. The main character Hiro (voiced by\nRyan Potter) and the rest of the superheros team study robotics at the\nlocal university (including T.J. Miller from Silicon Valley and Damon\nWayans Jr from New Girl). Reach your potential, practice non-violence\nand exercise sacrifice. That's just the tip of the iceberg. There are\nmore spoiler-worthy ones that will be omitted from this review\nentirely. By the way, it's not 'preachy' in the slightest.\n"},
{"review": "\nI have seen this animated film a number of times now, and have not\ngrown to become sick of it. I love the plot, the characters (especially\nmy favorite, GoGo) and am so thrilled that this film won an Oscar for\nBest Animated Film 2015. The only downside is that my favorite male\ncharacter, Tadashi, dies, but I understand why the writers included\nthis in the plot, for it had a huge impact on the film and brought\ngreat reflection to - especially - Hiro Hamada. The idea that the\noverall 'hero' is a non-threatening vinyl 'marshmallow' brings further\ninterest to the film, for he ends up saving just about all of the\nprotagonists lives, not to mention he is a very appropriate character\nfor all audiences, as well is the film entirely. All in all, I rated\nthis film 10 out of 10 stars for its excellence, in my opinion, and\nlook forward to any future works that will come out of this film!\n"},
{"review": "\nAn amazing Disney movie.Maybe the best one I ever watched. I have to be\nhonest.The best Disney movie since well, maybe 'The iron giant' or\nperhaps any other great cartoon. Ignore the haters. Believe me, the\nhaters are dumb. Because it's an action packed, funny, and emotional\nstory with a great plot that you will probably enjoy with your family.\nIt may seem cheesy at times. But you may not walk away unsatisfied.\nReally realistic animation, and amazing voice acting. Is it for only\nfor children? Nope, I don't think so. I watched this with my younger\nbrother, and we both enjoyed it equally. If you love to watch cartoons,\nand if you enjoy movies with great plots, and if you want to enjoy a\nhearty laugh ... This is a great bet. Believe me ... This is an amazing\nmovie, that you'll enjoy with your family and friends.\n"},
{"review": "\nWhere do I begin? Big hero Six is one of the best movies I've seen all\nyear. In one of my previous reviews, I used the term over and over\nagain that Disney has always done what it's done and should stick to\nthat. And this movie has! Running Disney themes have this movie that\ngets me very happy with Disney. This movie as I said in my previous\nreview brings us back from the god awful frozen. Very original and I'll\nbring this back from any any old tales or fairy tales, big hero six\ntells the tale of a young man's struggle to find the men who killed his\nbrother.With great action scenes good moral values and enough strength\nand motivation in its stride it brings me back to good Faith with\nDisney. Constant Disney clichés that always want to make me watch this\nmovie over and over again , with a side of no backtracking and no\nunnecessary characters brings us to believe that Disney's got it back\nagain. This movies originality, good writing, and overall good happy\nfeeling, got me believing that Disney can move on from its mistakes.\nDisney has shown that it can make a good movie again by showing that\nyou don't need a musical and ridiculous characters to get little kids\nup and happy to buy your merchandise. This movie spoke to a wide\nvariety of people and not just easily fooled little kids. This movie\nmust've been a stowaway on the crap boat that was frozen and\nmaleficent.This movie is a rare occasion of well done combinations of\ndifferent elements (superheroes, Disney clichés, etc). If you lost your\nmoney to frozen watch this movie so you metaphorically won't waste it.\n"},
{"review": "\n\"Big Hero 6\" is a movie that shows the best of both Disney and Marvel.\nIt's funny, has exciting action scenes and has enjoyable characters.<br><br>Baymax (Scott Adsit), the inflatable huggable healthcare companion for\nHiro (Ryan Potter) was, for me, the best part of the movie. Baymax\nbrings laughs in almost every scene he is in, has a lot of action\nscenes and you end up loving him. Hiro is the most developed of the\nhuman characters (he is funny, his actions, however rash and dangerous,\nare understandable and he grows and learns from his mistakes) and he\nalong with Baymax makes the movie great. Although the other humans are\nall fun in their own way, I wish we got to know more about them.<br><br>The villain in this movie is good as well. Just goes about his job\ndoing evil stuff in an evil manner and is threatening throughout.<br><br>My only issue was with the ending which unfortunately went as\npredicted. However, this was still a very fun movie which did go places\n(dark intense places) I did not expect and improved the movie for me.\nBig Hero 6 entertained me a lot and will be fun for the entire family.\n"},
{"review": "\nBig Hero 6 is another movie based on Marvel source material but isn't\nlike others recently released.. this one is also a Disney animated\nfeature. How to train your dragon 2 was previously my favourite\nanimated film of the year.. that was until i saw this gem.<br><br>The story follows a smart kid named Hiro who is suffering from kid\ndepression after his brother is killed in a huge fire. This is where he\nmeets Baymax, the star of the film and possibly my favourite Disney\ncharacter since Olaf the snowman. Baymax is a big lovable idiot-type\nrobot who was built to provide healthcare for humans. Hiro sees Baymax\nas a chance to get revenge on his brother's killer and with him and his\nnew- found friends they embark on a journey to get justice.<br><br>Some of the film's best scenes come from Hiro's attempts to turn Baymax\ninto a badass fighting machine. This results in hilarious moments\nbecause we still have our big lovable idiot.. but now he has awesome\nsuperpowers, and i must say this kept me thoroughly entertained. The\nother characters were also awesome and each had their own personality\ntraits but at the end we are left with the relationship between Hiro\nand Baymax, although definitely not a bad thing because as an audience\nwe can never have enough Baymax.<br><br>I did feel that this film suffered from what Guardians of the Galaxy\nalso suffered with which is that the villain was underdeveloped,\nalthough unlike Ronan the villain in this film (no spoilers) did have a\nfleshed out plan and was quite a surprise twist. In the end I came out\nof Big Hero 6 feeling satisfied and entertained, featuring the humour\nof Marvel and the heart of Disney, this one is well worth a watch for\npeople of all ages and if you don't want your own personal Baymax by\nthe end then something must be wrong with you!\n"},
{"review": "\nHiro is a teen genius who seems to waste his time until his brother\nsets him on a right track. Tragedy strikes, and Hiro teams up with new\nfriends to find the truth...eventually saving the day.<br><br>Baymax is a robotic healthcare assistant that could have been developed\nas the usual annoying sidekick that has the heart of gold, but he just\nhas a heart of gold here--as in doing research, his only intention is\nto help whomever he can.<br><br>On a scale from 1 to 10, I rate this movie a 9 because its heart and\nsoul outweigh the problems I have with it. Some scenes might be\nupsetting to younger viewers, but it is perfect for all ages.<br><br>My issues:<br><br>1. One of the characters sounds stereotypical. 2. The villain's\nidentity and motive feel tacked on.<br><br>I know the primary audience is not going to notice things like this,\nbut I do...and I this happens to be one of those times that I cannot\nlet it go.\n"},
{"review": "\nMy family got tickets to an early showing. The movie was excellent. The\natmosphere was refreshingly different, the characters fleshed out, the\nplot touching, and the humor was rich and consistent . I would\nrecommend this one to anyone, and especially to couples and families\nwith children.Big Hero 6 really blew me away, I expected it to be good\nsince Disney is having another animation renaissance but once the\ncredits began to roll all I could do was wish it was longer. This movie\nhas something for everyone, comedy, action, some despair. In fact,\nsurprisingly the only thing missing was romance, which is fine with me.\nIf you love superheroes, robots, and animated films, I think you've\nfound your holy grail.\n"},
{"review": "\nBig Hero 6 is now literally my new favorite of all time! It is the most\nawesome movie in the entire world. I can't wait for the sequel, if\nthere is not a sequel I will die (not literally, just an expression).\nMy favorite part is the immortals scene where they all get suited up\ninto super heroes. I'm not going to say any spoilers, because some\npeople haven't seen it yet, like some of the girls at my school. My\nfavorite character is Hiro, its not just because he is smart and nerdy,\nbut the guy who plays him (Ryan Potter) is really cute. If there is a\nnext movie I think that, Hiro should fall in love and somebody kidnaps\nBaymax to make it more interesting. Big Hero 6 is amazing and I can't\nwait for the sequel.\n"},
{"review": "\nI popped along to the most anticipated movie of my Babes Inflatables.\nBig Hero 6. The film surrounds an Inflatbles that sets about saving the\na town. How it stats that is that a young kid Hiro has an amazing\nrelationship with his Bro Tashadi. Hero starts with Robo Fighting. His\nbro Tashadi is exceptionally looking out for him. I've never seen such\ncloseness. He brings his Bro Hiro to a Nerd School college kinda. Hiro\nis overwhelmed. He meets Baymax(INFLATBLES). He's an Inflatable Robot\nthat is a \"Healthcare Companion\". They go on a journey in finding out\nthe mysterious person who was involved the fire. <br><br>Overall a FANTASTIC film. Pure emotional at times. But fantastic. I\nsmell a sequel on its way.\n"},
{"review": "\nFirst review I write, will recommend this to any family and anybody\ngreat movie one of the best Disney movies I've watched...Brought my\nkids to watch it and think I enjoyed it more then my kids ha ha...<br><br>Give much props to writers producer and all involved well made and put\ntogether probably best Disney movie and there are plenty of good ones\nout there.<br><br>I need 10 lines to give review, don't want to say much about the movie\nI personally hate spoilers so don't want to mention anything in\nparticular. Just pay attention in the beginning of the movie great\nstart ha ha...Bring your kids you all will enjoy can almost guarantee\nit.\n"},
{"review": "\nBig Hero 6 is the most sensational Disney movie ever made! <br><br>The Storyline is about a boy named Hiro Hamada, a intelligent 12 year\nold boy who becomes a friend to his Late- older Brother's (Tadashi)\nNurse Robot BAYMAX and to find who is the Supervillan:Yokai, who stole\nhis Experimental Microbots and the one who is responsible of the fire\nthat burnt his college and his brother. Hiro, BAYMAX and his friends\nbecome superheroes to save San Fransokyo.<br><br>The movie is very emotional ( so take a box of tissues) about a loving\nbrother-brother relationship, friendship and on-going storyline.<br><br>Here are my point of views from scale of 1-10: 10/10 effects 9/10\nhumour 10/10 storyline 10/10 animated movie characters 11/10 Movie of\n2014/15 (Off the scale?!)<br><br>I would recommend this astonishing movie to family,friends and marvel\nfans!!\n"},
{"review": "\nThis movie made me laugh and cry. I love the character Bay Max so much.\nEven though he was a robot, I felt he had a true heart. The fact that\nthey made him look like a huge marshmallow was genius. So many people\nwill be able to relate to his character just in that sense alone. The\nstoryline was done so well and captured the hearts of both kids and\nadults. Throwing in problems and finding solutions to the problems was\nonce again reiterated here. My mom and her friends even enjoyed the\nplot. The fact that there was an incredible invention developed in this\nstory gives all those inventors out there a push to go forward with\ntheir ideas. The future of technology is here and the bots are not too\nfar away from becoming a reality. Another great job by Disney!\n"},
{"review": "\nBig Hero 6 is hands down one of the best animated films I've ever seen\nand maybe the best non-Pixar film since The Lion King. The realism in\nthe animation, while not losing the charm associated with the genre, is\nstunning, the humanity and emotion in the film is superior to most live\naction films you'll see, and the story is fresh and entertaining. It\ncombines humor with sadness with action to make for an exciting viewing\nexperience. They also make you absolutely love Baymax, the big, white,\npuffy looking marsh mellow robot in all the advertisements. Overall,\nthis movie is suitable for people of all ages, genders, cultural\nbackgrounds, etc. Jump into San Fransokyo and get ready for a great\nfilm.\n"},
{"review": "\nWow...just wow! When I went to see this movie it was a late evening\nscreening so there were no children, only adults. How we all loved this\nmovie! We laughed, we cried and we were amazed. <br><br>First of all: the animations are absolutely amazing in this movie!\nEvery hair, every detail, water, fire, you name it; I caught myself\nwondering at times how they made everything look so natural!<br><br>Then the plot; though the overall storyline is not that original, the\nway they built the characters around it and still gave the story it's\nown unique personality is brilliant. This was one of those movies that\nI didn't want to end just because it was so fantastic.<br><br>One of the most important reasons I loved this movie so much is the\nhumor in it. Especially the way Baymax learns and still tries to remain\ntrue to his original programming had me to tears (from laughing)\nseveral times. And not just me; the entire (adults only) cinema was\nbursting out into laughter!<br><br>Whether you go with kids or not; I guarantee you will have a great time\nseeing this movie. I will definitely watch it again and recommend it to\neveryone I know! Instant happiness :-)\n"},
{"review": "\nWatched Big Hero 6 featuring the Voice Talents of Ryan Potter(Senior\nProject) as Hiro, Daniel Henney(X-Men Origins Wolverine) as Tadashi,\nT.J. Miller(Transformers Age Of Extinction) as Fred, Jamie Chung(Sucker\nPunch) as Go Go , Damon Wayans Jr.(The Other Guys) as Wasabi, Genesis\nRodriguez (Man On A Ledge) as Honey Lemon,Alan Tudyk(Justice League\nWar) as Alistair Krei featuring Maya Rudolph(The Way Way Back) as Aunt\nCass and James Cromwell(Star Trek First Contact) as Robert Callaghan\nalso Newcomer Scott Adsit(30 Rock) as Baymax. The film was fantastic it\nwas like The Avengers met Ninja Turtles also it was an interesting\ndynamic to see College Nerds dawn the Mantle of heroes also the film\nhad heart and personal touch really loved the Brother Dynamic Between\nHiro and Tadashi I too have a brother which adds personal touch and in\nThe Same Vein as Frozens Sister Dynamic between Elsa and Anna also\nBaymax was awesome loved how he was an Learning A.I. also Enjoyed his\nprogression as trying Help Hiro The film was brilliant amazing Musical\nScore by Henry Jackman(Captain America:The Winter Soldier) also Amazing\nDirection by Don Hall(Winnie The Pooh) and Chris Willliams(Bolt) This\ndefinitely deserved its best animated feature win also it is one of my\nfavorite animated films A Fantastic Superhero Animated Film and Best Of\n2014 10/10\n"},
{"review": "\nI have been a lifelong Disney fan, and make a habit to see any new\nreleases from Disney. After hearing many positive things about Big Hero\n6, I was eager to see it. However, I tend to proceed with caution on\nmany new Disney movies because I know that the quality will likely not\nbe on par with the classics. This movie proved to be an exception.<br><br>I found all of the characters in this movie to be wonderful and\nwell-developed, even the supporting characters. Hands down, Hiro,\nTadashi, and Baymax are the most memorable, and the watching the film\nwill make you become attached to these characters. Only Disney could\ncause you to feel attached to a robot, and they hit that nail on the\nhead.<br><br>The storyline is very unique and original, even though it is loosely\nbased off of the \"Big Hero 6\" comic from Marvel. The many plot twists\nwill leave you wondering what is yet to come. In addition, this movie\nhighlights the struggles of overcoming grief from the loss of a loved\none. As this is something that many viewers have experienced, you will\nprobably find yourself feeling emotional and will be able to relate to\nthe feelings of most of the characters (especially Hiro).<br><br>Big Hero 6 brings us back to the magic that many recent Disney films\nhave been lacking. This movie is definitely not just for little kids.\nI'm 19 years old and loved this movie, and my parents AND grandparents\ngreatly enjoyed this movie as well. I hope Disney learns from the\nsuccess of this movie and continues to produce wonderful films. It is\nperfect for the whole family to enjoy!\n"},
{"review": "\nWOW! What a film this is. I felt like I was on a roller-coaster ride\nthere were soooo many emotions in this film, which made it more \"real\".\nWhen it is sad, it's brutal and when it is good, it's almost\nempowering!! The characters are amazing but my favourite had to be\nBaymax, what a lovable character!! My son has already gone out and\nbought a Baymax teddy! <br><br>It will take a lot for another animated film to be as good as this, it\nhas a great storyline that hasn't already done before, wonderful\n&amp;deeply thought-out characters and a great deal of action/comedy\nwithout being too much.<br><br>Just brilliant, every adult and child will fall in love with Big Hero\n6. It's hard not to. Wonderful Just wonderful. One of the best Animated\nfilms I have seen.\n"},
{"review": "\nI can't believe the reviews. people saying: too predictable, too\ncliché, the same all over again. Hey, people, IT'S A MOVIE FOR KIDS.\nNow you expect that all the cartoon and animation movies for kids fills\nyour expectations? Are you kidding me?<br><br>This is a great KIDS movie that teaches respect, vengeance is not good,\nfriendship, to pursuit your dreams and most important: If you are\ntalented, don't waste it.<br><br>I'm 30 years old. I didn't wanted to see this movie and I absolutely\nloved it. the part when Baymax is running out of gas, he is acting\ndrunk. I was laughing in tears.<br><br>Stop trying to make Pixar, Disney or Dreamworks work FOR YOU. Their\nmovies is FOR KIDS. We apologize that kids love this film but you\ndidn't because \"it's too predictable\". <br><br>maybe if you people see this movie in a child's' eyes, you would like\nit and enjoy it as I did.\n"},
{"review": "\nI can't believe the reviews. people saying: too predictable, too\ncliché, the same all over again. Hey, people, IT'S A MOVIE FOR KIDS.\nNow you expect that all the cartoon and animation movies for kids fills\nyour expectations?Are you kidding me?<br><br>They also make you absolutely love Baymax, the big, white, puffy\nlooking marsh mellow robot in allthe advertisements.<br><br>Really realistic animation, and amazing voice acting.The message was,\npeople are people. Animation was awesome. Dialogues were intelligent.<br><br>So I do recommend this movie if you're up for a nice light movie with a\nlot of laughs: it might be better than you think.Go watch it.\n"},
{"review": "\nBig Hero 6 is another in a line of many successful Disney animated\nmovies. And rightly so, might I add. The movie is about a boy, Hiro,\nhis friends, Nerds and a health care prototype robot, Baymax. They live\nin a not so distant, technologically advanced future in a city called\nSan Fransokyo. The story is action-packed comedy with dramatic elements\nto it and, as such, is appropriate for all ages. If you love Marvel\nmovies, you will most definitely like this one as well. If you are more\nakin to beautiful landscapes and animated design, then by all means,\nthis is the movie you will want to watch. If you are feeling down, the\nabundance of comedy, present in this movie is sure to make your day up.\nThere is also a lot to learn from this movie, as some of the most\nimportant things (as well as most painful) in our lives, are depicted\nin this movie. Plus, the movie features one quite notorious figure\n(without too many spoilers). In short, the movie is a must see for\nchildren and for grown-ups as well, if they have a child lurking\nsomewhere within them. Do not make a mistake and pass on a beauty of\nthis movie.\n"},
{"review": "\nMy fiancé and I are both big Disney fans but neither of us were too\nexcited by this film when it was first announced or even when we saw\nthe trailer, but thanks to friends and family raving about it we\nwatched it and both thought it was great.<br><br>As always with Disney the animation is fantastic, colourful and\nimaginative, the characters likable and funny and the robot Baymax is\njust amazing in how a robot without facial features can be so lovable,\nthe script is funny but the story is nothing you've not seen before but\nit's handled well.<br><br>The film was much better than I thought it'd be, I really enjoyed it.\n8/10\n"},
{"review": "\nWhenever I have turned it for few seconds to check some moments, I just\nsimply couldn't turn it off! Every random scene, seemed so good and\namazingly animated that I had big trouble with stopping watching it. I\nhave been holding myself from it for such long time... but no more!\nLet's see if it is really so good! <br><br>4 minutes - it starts out of blue, straight into action, good or bad?\nConfusing for sure! <br><br>8 minutes - amazing animation, high technology, robots and plenty of\nhumour! What's there not to like!? <br><br>23 minutes - damn... that was a little shocking and sad for an animated\nfilm for kids...<br><br>32 minutes - hilarious, funny, adorable, cute and I have not idea what\nelse but I love it! <br><br>1h 25minutes - it looks fabulous and the action is amazing too <br><br>It's really nice and kids will love it for sure, I am almost 30 years\nold and I liked it... should I say more?<br><br>tgchan's rating: 7/10\n"},
{"review": "\nI went to watch this movie with my son aged 10 and daughter aged 7 - it\nwas my son who was especially keen to see this, and to be honest, I\nwasn't really expecting much, as I hadn't watched any trailers about\nit, or heard much about it, &amp; I thought it maybe more a boys' movie and\nmy son would enjoy it more than my daughter or myself... <br><br>However... For the entire movie, myself and both of my children were\ncompletely immersed in it, and it evoked a range of thoughts, feelings\nand emotions in all of us, which included laughter and reducing us to\ntears (and I don't usually cry easily!). We all came out from the\ncinema each wanting our very own Baymax, and we were talking about and\nreliving moments from the movie for weeks after! My son who is a huge\nMarvel fan too spotted and enjoyed that he could make connections with\nBig Hero 6 to its Marvel origins. <br><br>Mine and my children's conclusion... We loved this pretty much the same\nas we loved Frozen... Another fantastic animated movie from Disney!\n"},
{"review": "\nso i originally didn't care for this film. a waster of time, irrelevant\nto both Disney and marvels big plans. i assumed it would end up like\ndaredevil or black cauldron, best forgotten, bow was i wrong. this film\ncombines the amazing animation, writing and greatness of recent Disney\nlike frozen and tangled, with the great plots of marvel. it nearly had\nme in tears at times, because there is so much emotion in this film,\nand had me laughing uncontrollably at others. the group is full of\npersonalities that are lovable and great. baymax is the true highlight\nof the film, but hiro and tadashi are incredibly stong and great\ncharacters. wasabi is always there for the comic relief and gogo is\nbad-ass. but they all become great as serious characters. and you have\nto love how honey lemon says \"hiro\" obviously, there are some issues.\nno film is without sin. it is predictable, cliché and some of fred's\nlies are just too stupid for words. but they aren't the points that you\nwill remember. this film is definitely worth a watch and i suggest to\nto EVERYONE\n"},
{"review": "\nBeautiful movie. Great theme. Love all aspects of it. Way to go Disney!\nBrilliant way of making this movie. The music on the background goes\nperfect with all that is going on. Children will love the whole Baymax\nthing. Family can enjoy it together. Great way to starters on Disney\nuniverse. Although Disney is more into magical things. Through the\nyears technology have been a theme Disney is developing more and more.\nIt is so good watching more Disney film talking about science, even\nthough is fictional. Oh and by the way, it will be an unexpected turn\nof events through the movie making it more interesting. Disney teamed\nup with Pixar has been the greatest get together of the century.\n"},
{"review": "\nI grew up with Disney like so many others. I love my Beauty and the\nBeast, AristoCats and Frozen. I love both old and new ones.<br><br>And then comes Big Hero 6. I knew it was going to be good. But I didn't\nexpect greatness. Disney certainly did a amazing job combining what we\nlove about Disney with what we love about action movies.\nA-freakin-mazing!<br><br>The characters were nice and goofy, the aunt was adorable. <br><br>The only bad thing was the usual \"kill of a loved one\". Did not\nappreciate that. To be honest, I don't understand why Disney loves\nkilling of characters in so many movies. And in this one the brothers\nhad already lost their parents and then Hiro loses another member of\nthe family.. Just makes me a little frustrated that's all. <br><br>But that is the only negative thing I can think of right now. A cute\nmovie, really well done and I hope there will be a short movie about\nBaymax.\n"},
{"review": "\nDisney Animation Studios, back in November 2014, bought us a story of\n14-year-old robotics genius Hiro Hamada and robot nurse Baymax, who\ntogether band together a team of heroes in speed demon Go Go, chemistry\nmaster Honey Lemon, organized Wasabi and school mascot wannabe Fred,\nwhose mission is to help the citizens of San Fransokyo.<br><br>This film is like nothing else on Earth. A unique animated movie, it\ncombines aspects of the Marvel Comics line of the same name, while\nstill keeping the magic of Disney animation.<br><br>Combined with the valiant, electro-rock anthem \"Immortals\", created\noriginally by the immortal Fall Out Boy just for the movie, Big Hero 6\noozes heartfelt sentiments, safety tips, and the strength of family and\nfriendship. The Academy recognizes it too, as the film has been\nnominated for dozens of awards, including nominations for both the\nGolden Globes and Oscar.\n"},
{"review": "\nI can't say that I'm really a fan of the source material for this movie\nbut the animated product that Disney Studios made from it I can\nhonestly say that I am a big fan of! <br><br>After numerous (and, in my opinion, warranted) changes to the \"Big Hero\n6\" superhero team from the comics, Disney Studios created a superhero\norigin story that never felt like all the other superhero origin\nstories and contained a story that had a lot of heart, tons of exciting\naction, and lots of ridiculously funny moments. Additionally, the film\nhad a slew of interesting and diverse characters and all of them were\nperformed amazingly well by a cast of very talented actors. Disney also\nproved that it is very possible to create a legitimately entertaining\ncomic book film in your usual Disney 3D animation style and not make it\nfeel like it was doing a disservice to the world of comic books.<br><br>I don't have a single complaint about \"Big Hero 6\" and it easily sits\nright next to some of the other great Marvel films out there (even\nthought it isn't actually a part of the MCU). In my opinion, this film\nis just as entertaining as \"The Avengers\" or \"Iron Man\" or \"Guardians\nof the Galaxy.\" Just a great, great movie\u0085and Baymax is flippin'\nadorable! <br><br>Hi! The name is Rev. Ron and if you feel like reading more of my rants,\nramblings, bad jokes, geek references, and other movie reviews (like a\nmore in-depth look at \"Big Hero 6\" and other films based on comic\nbooks\u0097obscure or well known) you can visit my blog at\nrevronmovies.blogspot.com. If you don't want to do that because you are\nbusy trying to make a real-life version of Baymax, you don't need to\nvisit because you clearly have important work to do\u0085and where can I\nsend my check so I can get one of those once you figured out how to\nmake them?\n"},
{"review": "\nOn the one hand I can understand why this film makes people\nuncomfortable.<br><br>For starters it takes place in \"San Fran Tokyo\" (?) and the core\npremise for the story is that it is \"OK\" to start an animation film\nclearly targeted for kids with a double homicide.<br><br>That does take some getting used to.<br><br>Oddly like its subjects (kids who experiment) there is a lot of\nexperimentation taking place here too.<br><br>There are some things I have never seen before in an animated film and\nquite liked.<br><br>Other bits did not work as well.<br><br>Anyway, for breaking new ground, I gave it an 8.<br><br>Maybe history will be kinder. And maybe it won't\n"},
{"review": "\nSo many movies give the story up in the trailer. Was pleasantly\nsurprised at each of the significant reveals in the story.<br><br>There were definitely Hollywoodisms, but to reject all of them is yet\nanother Hollywoodism, so I can't fault the film for that.<br><br>I was also pleasantly surprised with not only how much esteem this\nmovie holds the scientific community, but with how relatable each of\nthe characters was.<br><br>The only thing I can really fault the movie for is the lack of\nside-character development in the middle/end of the film. Each of them\nwere really treated like extras rather than the interesting characters\nthey were introduced as. Still a significant step forward for the\nanimated film community.\n"},
{"review": "\n3 February 2015 Film of Choice at The Plaza Dorchester Tonight - Big\nHero 6. With an Executive Producer like John Lasseter, whose name can\nbe found on most of the well known animated films from, Toy Story, and\nCars to the mighty success that is Frozen, you just know this is going\nto be another great. Great it was. These days it seems if you can find\na good story you can make an amazing animation. Set in the futuristic\nyet oddly homely city of San Frantokyo, this is the story of Hiro, a\nbrilliant 14 year old who is devastated after the death of his brother.\nTogether with Baymax a health robot created by his brother, Hiro\ndiscovers dark deeds afoot and he uses his exceptional mind and some\ngood friends to help save the day. The modern animation never ceases to\namaze me how it can stir as much emotion as an live action feature.\nTake the opening 15 minutes of Up for example, if that doesn't make you\nreach for a hanky then there is no heart in you. This film is the same,\nyou feel sorrow and it makes you laugh. I was advised to sit through\nthe credits until the very end to see an extra, and in doing so I\nlearned a flew things.....the amount of people needed to produce an\nanimation is just as many as a live film, there is even an animator in\ncharge of crowd scenes, and the sound was managed by Skywalker Sound\nout of Marin County California. Oh and the extra I was telling you\nabout......let's just say......roll on the sequel.\n"},
{"review": "\nI went to watch big hero 6 with my friends and I loved it. The detail\nof the animation itself was what stood out to me as it was beautiful -\nthe writers were very creative with the scenes they put together. With\nlaughs as well as heartache, this film is brilliant and a must see for\nall. You will fall in love with the characters instantly as they bond\nreally well. I think most people loved Baymax, judging from all the\nlaughs at the cinema. :)<br><br>Overall, I would definitely go see big hero 6 again. The action had me\non the edge of my seat and the plot twists were great. However, I wish\nDan and Phil's characters could have had more screen time, but\nnonetheless their parts were enjoyable. If you're someone who's on the\nfence about watching this film, what are you waiting for? go watch it!\nalso, remember to stay after the credits for a surprise.\n"},
{"review": "\nI just LOVE this movie!! How awesome was mixing San Francisco with\nTokyo and the plot was lovely, I am in fascinated with the brother's\nlove and friendship. I can't understand why people hate this much, this\nis a movie for kids!!! I am tired of all this comments \"was cliché, was\npredictable, was stupid..\" It is made for all ages, God. Is it too hard\nto understand? And please, stop comparing movies, for lord Jesus.\nBaymax is one of those characters who can basically do no wrong. Every\nsequence he's part of is automatically funnier just because he's on\nscreen. A big, gorgeous, consistently funny and touching animated\nadventure. And what i love the most about it was that it celebrates\nnerd culture. And not merely the pop-culture- obsessed version (comic\nbooks) but the let's-invent- something-cool kind. To me, this kind of\nfilms makes me want to work in this business of creation and\nentertaining, highlighting universal values and dreams. Personally I\nhave to say that this is very inspiring and motivating, it reminds me a\nlot of my little brother who is a genius tech lover I am separated from\nhim but watching this, kind of make me feel him closer. Now I am\nfeeling better after watching this movie. It just worth it, and I give\na 10 to 10, it is going straight forward to my top 10 of my Disney\nfavorites movies of all the time. Thanks again Disney, you made it\nagain! &lt;3\n"},
{"review": "\nWhen I first heard Disney was doing a movie about giant robots, I was\nskeptical. I thought it would be just like Transformers or all the\nother giant robot movies.<br><br>Boy, was I mistaken.<br><br>It's not traditional Disney--there's no romance, princesses, or\nblockbuster songs--but it's actually better without those things.<br><br>Baymax has to be one of the best Disney characters I've seen. For a\nrobot, he's quite the personality, rivaling even WALL-E in that regard.\nUnlike Olaf from Frozen, Baymax doesn't exist solely for comic\nrelief--he plays a major dramatic role in the movie as well.<br><br>The rest of the cast shines and each member is given memorable lines.<br><br>If I had a drawback, I would say it's the soundtrack. However, Frozen's\nwas a tough act to follow.<br><br>But Big Hero 6 has it where it matters most--heart. I guarantee that\nyou will want your own Baymax by the end of this movie!\n"},
{"review": "\nThis is probably one of the best animation movies I've watched in the\nlast 10-15 years, believe me, I've watched almost every animation in\nthat time period. I love how the friends of the brother of Hiro fit in\ntogether, so you can definitely find yourself back in one of those, or\nin the main character or Baymex. I love how Baymex brings humor and\nfeels in the movie on the right moments so you can cry like a little\nbaby or laugh your ass off, even if you don't want too. I also find it\nawesome that there is a bad guy in this movie that you can extremely\nsympathize with, which makes it more relaxing and exciting to watch.\nAnd further, I like the graphics very much, the story line is well\nplayed out (build up to the bad guy, escape too poor guys villa, change\nof heart and a happy ending). I recommend the movie too every movie\nenthusiast, because you're a gonna watch, enjoy and laugh/cry the hell\nout of it!!<br><br>For anyone that is interested, I registered only because I wanted too\nrate this movie so bad!\n"},
{"review": "\nBig Hero 6 was really funny, beautiful to look at, and very charming!\nThe jokes are adorable, with a lot of hilarious scenes with Baymax(the\nwhole theater erupted with laughter whenever the fist bump part came\non) and plenty of clever dialogue from the other characters. The\nanimation is very colorful and lifelike, with realistic character\nanimation and unique action scenes and backgrounds. The film is not\nwithout its heart, as the charm of Baymax and the surprises will hit\nthe mark in the soul. Overall, Big Hero 6 is a true phenomenon in\nanimation with cute humor, imaginative visuals, a huge heart and some\nvery cool surprises. This is the best animated film of all time!\n"},
{"review": "\nreally don't understand how anyone could rate this badly. I watched\nthis film yesterday with my 2 daughters which where glued to the TV\nscreen even wanting to watch it over again. we then went on to watch a\nmouse tale but no kids got bored half way through and put big hero 6\nback on. right from the beginning of this film it gets you hooked. you\nwill be giggling on a few occasions the script is outstanding the story\nline is fantastic will certainly keep the children entertained for a\nwhile. I have pretty much watched all the children animation films and\nthis one is right at the top of my list I can just hope that a number 2\ncomes out :)\n"},
{"review": "\nBig hero 6, is the best animated movie ever. I mostly loved baymax and\nhero. Balala. So funny. It just brought a smile to my face. The\nrelationship between baymax and hiro is beautiful and classical. It\nreminded me of how to train your dragon. Hiccup and hiro have the same\nhair, their both smart. And they kinda have relationship with their\nfriends. Everything was good except the villain. He goes out of his way\nto kill his own students all for his daughter. The worst part was that\nhis daughter was alive the whole time! When the students he tries to\nkill save his daughter he looks at her and it seems like he didn't\ncare. He just thought he did it all for nothing. But otherwise the\nmovie was awesome.\n"},
{"review": "\nI believe I have not seen such a great film in my taste since Wall.E,\nthat is also by Disney.<br><br>It is a high quality film that teaches the importance of humanity in\nour lives, instead of losing control at moments of distress and hurting\nother people. It is a family movie.<br><br>It presents very different characters that find themselves together at\nuniversity for their higher levels of intelligence. It also shows the\nlove and care between the robot and a boy, a theme that is usually\nsuccessful when used on this perspective. I also like the fact that\nthis is an American film, but the main character is Japanese.<br><br>After the credits of the movie, there is a scene that I believe is\nimportant to the next one...<br><br>I hope they win many prizes for this great production!\n"},
{"review": "\nHoly crap! This movie was SO much better than expected! Baymax is so\nincredibly lovable, and made me laugh so hard throughout the entire\nmovie! I didn't expect to laugh this much over a \"kids\" animated movie.\nAlso the animation is VERY well made. Especially the views of beautiful\nSan Fransokyo made me \"wow\"! The story is very well written, and you\nfeel entertained at all time. It contains a perfectly balanced amount\nof laughable, touching and action packed moments. Big Hero 6 has made\nit up there with my top 3 animated movies of all time, and Disney\nAnimated Studios has proved that they can deliver movies in absolutely\ntop quality. I highly recommend people of all ages to go see it!!!\n"},
{"review": "\nI have seen Big Hero 6 twice, and both times I've been amazed by the\nquality of this movie. Baymax was an amazing sidekick, who actually had\na place in the plot, with the addition of being adorable and a well\ntrained nurse! Sure, Hiro didn't fall in love, and the brothers didn't\nhave a happy ending. But I think this shows that not everything has a\nhappy ending. Plus, the main charters were complete nerds! As a fellow\nnerd this brought great joy in my life. I was surprised when I first\nheard this movie was in production, but never the less I think it's\nlived up to the hype of Frozen and Wreck it Ralph. And of course I\nenjoyed the hidden Disney items within the movie. Fantastic!\n"},
{"review": "\nThis movie was awesome and appeals to anyone comic book fan or not. You\nlearn to love and care for every character. Baymax is also a great role\nmodel for kids. He shows a large, huggable posture that can really be a\ncool mascot at Disney parks or events for all to enjoy and remember\nwhen \"I saw that movie\". Also, Hiro shows you to never give up, no\nmatter what happens along the way. Just stay positive and keep your\nfriends close to help you. It truly deserves an excellent review, even\nwith all the odd hate. This movie was right on the dot for comic fans,\nfans of comedy, or just people looking for a good movie to see. It's\nstill out so get to the nearest movie theater quick.\n"},
{"review": "\nOkay, let's first start with the pros. This movie successfully\nshowcased how good the animation 3D technology can be. My friends and I\nquite enjoyed its overall quality. Also this movie has pretty much\ninnovative elements in it, with some big high tech creations. Overall,\nit's a light hearted movie. I'm sure almost everyone can find it\namusing. It is not perfect of course. First, seriously, all big hero\nmovies have to start with a family tragedy? I understand revenge is an\nemotional treat and good for plot, but this seems to be forcing the sad\nparts in and I don't like that idea of big heroes all have to suffer\nfrom family loss. Apart from that, some jokes are kinda stiff. The big\nmarshmallow bear's blalalala is pretty lame on my side. It certainly\nhas good branding effect tho. I see big ad boards everywhere including\nthe bus station at Zhongguancun, Beijing. In a nutshell, it's amusing,\nsort of funny, nice animation with fairly good character settings. You\nmight enjoy it if not being too critical.\n"},
{"review": "\nBig Hero 6 is awesome! One of the best Disney movies I've seen. This\nmovie is less cliché than the other movies which is a good thing\nbecause we are able to see something new. The story was well written\nand the characters were introduced properly. <br><br>Things happen in an unexpected way. Same goes for this movie because\nit's unpredictable and I like it that way. Another thing I like in this\nmovie is that it can mix our emotions. There are scenes that are fun,\nalso there are sad scenes. I thought Baymax was really going to be\nstuck inside the portal but later on we learn that his \"memory card\" is\non Baymax's rocket arm. That scene made me happy at the end of the\nmovie. And also, the funniest scene is the end credits scene where Fred\nsees his dad which surprisingly, is Stan Lee. Not only it had a good\nending but it also had a funny end credits scene. <br><br>In conclusion, Big Hero 6 is an awesome movie. It satisfied me. Safe to\nsay it is a child friendly movie (because it's Disney).\n"},
{"review": "\nThis was one of the most enjoyable films I have watched in quite some\ntime, and is one that I believe I'll continue to enjoy even years down\nthe road after viewing it multiple times.<br><br>It offers great balance to the story and is pleasing to a wide range of\naudiences. The session I went to watch in the cinemas had people old\nenough to be my father and kids young enough o be my own all getting\nheavily engaged and enjoying the film.<br><br>If I were to be completely objective, I should in fact be giving this\nfilm a score of about 8.5. It has a good story, good actions scenes\nwith good animation, and a very healthy serving of humour, making it an\nexceptional movie. Unsurprisingly there are elements that are quite\npredictable, which would prevent it from being a flawless film, but\ngiven the emotional response it can evoke, and just the sheer enjoyment\nit gave me watching it, I was quite happy to give it a perfect 10.<br><br>This movie, despite being targeted primarily at a much younger audience\nthan me, really captivated me. I was always engaged, and never left\nwanting, which combined with the fact that it struck a few personal\nnotes with me too, meant that it was by far the most enjoyable film\nI've watched in recent years.<br><br>Very impressed with it, and highly recommend it to anyone, of any age.\n"},
{"review": "\nA really inspiring piece of work from Walt Disney! As for me, I wanted\nto watch this movie like HELL from the first time I've watched the\ntrailer! Simply amazing characters, the soundtracks were perfect,\nBAYMAX IS AWESOME &lt;3 The most thing I liked about this movie and Frozen\nwas the brotherhood &amp; sisterhood mixed with perfect clear emotions\nmentioned in these two movies.<br><br>I don't really know how some people haven't enjoyed such a beautiful\nmovie!! I actually watched it today for the 7th time and never EVER got\nbored from it!! The same laughs, same sniffing at some parts, same\nexcitement and the same AWESOMENESS!!! I really like science and stuff\nlike that especially sci-fi (my best genre for movies), so I would\nprobably say: \"The best animated movie I've watched in my life,\nEVER!!!\" I LOVE YOU WALT Disney!! A REALLY HUGE THANK YOU FOR MAKING\nTHIS MOVIE!!! &lt;3\n"},
{"review": "\nIn 2014 Its my best movie .I Choose Big hero 6 for great animation ,\nstoryline ,comedy and little but emotional. It is a Full of entraining\nmovie . LOVE You Baymax but the animation will be much better.<br><br>And BTW thanks a lot Disney for such a great movie . i appreciate your\ngreat works . keep rocking . In 2014 Its my best movie .I Choose Big\nhero 6 for great animation , storyline ,comedy and little but\nemotional. It is a Full of entraining movie . LOVE You Baymax but the\nanimation will be much better.<br><br>And BTW thanks a lot Disney for such a great movie . i appreciate your\ngreat works . keep rocking .\n"},
{"review": "\nA endearing tale masked as a adventure movie for boys; I laughed a lot,\nI cried a lot. That should speak for it. <br><br>The movie is about a boy who has an intellect that he uses for own\namusement, instead of using it for the greater good; then, he sees his\ncreations used for evil, and rebels against it; but mostly, what this\nmovie teaches him and us is that we have to use creation and share it\nwith the world, while honoring those we love. \"Somebody has to help,\nyou understand?\" It is an absolute moving story, about loss, and what\nyou do about it... revenge? helping out others in similar positions? I\nthink this movie is gonna help a lot of people. The main character,\nHiro, deals with growing up and having responsibilities, personal loss\nand outdoing himself using his head alone, with a little help from his\nfriends. And meanwhile, you get to see a non stereotypical movie, with\nAMAZING GRAPHICS, with nerds that are the cool kids, a bad guy who\nisn't really that, a neurotic black guy (xD), and a robot, who makes\npeople laugh just by moving... look, this is the oldest form of humor.\nIt works. The movie just works. It's amazing. I am 23 and traditionally\ngo see Disney with my childhood friends; everybody FREAKIN loved it OK?\nIt is for all ages. Better than Frozen? Yeah, it's better. And I loved\nFrozen. But it lacked some darkness, and this one has everything. So\nyeah, 10/10.\n"},
{"review": "\nThere have been a number of \"Super Hero\" movies this year From CA\nWinter Soldier to Guardians of The Galaxy and a few more scattered in\nthere, I personally would rank Big Hero 6 right up there with CAWS.\nAfter watching GofG on Blu-Ray last week (I wasted $20.00) and was\nseverely disappointed, I thought it would be a while before I would\nenjoy another Super Hero flick. But my kids have been begging to see\nBig Hero 6 since it came out in theaters. We went today and were\npleasantly surprised. There were many LOL moments, it kept my\nchildren's attention from beginning to end. There were many teachable\nmoment too. Can't wait till this comes out on Blu-ray, we will purchase\nimmediately!\n"},
{"review": "\nFresh from the Disney studio, another instant classic story has been\nrevealed. Following the story of a young teen 'Hero'. Adorable and yet\nrelatable to most at his age ,this character tugs at all the heart\nstrings. This film also sees the introduction to a new side kick and\nbest friend 'baymax' the cuddly marshmallow man who says little words\nbut is full of humour and love. As well as pulling off grade A animated\ncharacters , Disney have out done themselves with the imaginative\n,futuristic technology. <br><br>All good films need an evil villain and I feel his back story and\nappearance were great however feel we should have seen more action\npacked fighting scenes between 'Yokai' and the heroic members of 'Big\nHero 6'.<br><br>Overall this is a FANTASTIC , must see film for all family members.\nOverspilling with humour , adventure and action.\n"},
{"review": "\nseriously the cutest movie EVER!! they really made it sad, cute, and\nsweet all in one! i really enjoyed this movie and hope Disney keeps up\nthe good work.at first i thought this movie would be bogus because,\ncome on! its a Disney movie, so it must be only for kids and very\npredictable. and i was proved wrong, because not only was it\nUnpredictable, but it was so cute that i think i would even enjoy\nwatching a sequel to this! This is definitely a family movie, that\nEVERYONE will enjoy. Im 20yrs old and I enjoyed it! My friends even\nadmitted to enjoying the movie and said they thought it was the cutest!\nmy little sis also thought it deserved a great rating!\n"},
{"review": "\nBig Hero 6 is the most visually stimulating animation of the year.\nFransokyo the setting of the movie is very bright colored with neon at\nevery corner of the city, we have Hiro and his brother Tadashi. The\nother six include Go Go, Wasabi, Honey Lemon, and Fred. Baymax is one\nof the best animations I have seen in years, the inflation and\ncrinkling of his balloon like body amazed me. Animation has come a far\nway in the past couple of years. I really hope they make a big hero 6\n2, it will be a movie i will love to see. I've seen this movie twice in\na row already, this is another great job by Disney and its counterparts\ni will look forward to seeing what else Disney and it affiliates can\nmake in the near future\n"},
{"review": "\nOne of the best animation movies in the past couple of years. Gets hold\nof its audience right from the beginning and doesn't lose grip until\nthe credits. Charged with grandeur of animation, once you begin to\nwatch the movie, neither the popcorn, the soda nor the people around\ncan make you take your eyes off the screen. It's a real ride!! The fast\npaced screenplay and a very well written script around robotics keep\nyour heels dug. May not be as good a treat for adults but will not be\nreprimanded by them either. For kids, it's got everything to keep them\nbubbling throughout the movie. From its characters to the well executed\naction sequences to its superb background score the movie is a delight\nto watch. All the ingredients of a \"BOX OFFICE HIT\" animation movie are\npretty palpable. The ever evolving protagonist of the movie Baymax who\nsenses pain around and activates, determined to go beyond limits to\ntreat its patients (Hiro most of the times,) receives blows, puts\nitself through any challenge and rises again. Though just a robot\nthat's programmed this way, the portrayal of its character is what\nmakes Baymax the real Hero of this story. Nice job by Disney again. I\nhope the Disney announces the sequel soon.\n"},
{"review": "\nFirstly I must mention that it's been three days since I've watched it\nfor the first time and since then 6 times I watched it entirely.<br><br>I'm 29 and I've watched every animation movie at top ranks and bottom\nand I think it's safe to say that Big Hero 6 is one of the most\nentertaining, emotional and inspirational animation movie I've watched\nmy entire life. And I'll prove that to you.<br><br>An animation is made out of imagination and through that, it is made\nfor us to think that our lives and living boundaries has no longer\nexist as if we are living in a dream world.<br><br>So, about this movie, the creators showed us the importance of family\ncare and family values, technological care and use of different\nperspectives as if it's good or evil or both(in this case), friends\nthat takes care of friends when they are in need and few mysteries\nbehind the curtain. Although there is slightly obviousness about the\nplot, but Big Hero 6 was worth to watch it again and again just to feel\nthose emotions. Once you realize, you are connected to the brain of\nHiro(main character) and feel the accomplishments as if they are yours\nand losses, as if they are yours.<br><br>Some of the reviewers are so much unfortunate that they compare this\nmovie to non-animation movies or comic books. I even have read a few\ncritics about the title.<br><br>Moreover, some reviewers were so lazy to watch it twice or third, they\nhave reached a conclusion that the villain has created the fire. There\nis not a clue of that. Watch it again!<br><br>Grow up people and see the things as they are!<br><br>And Lastly, for those who knows nothing about the process of creation;\nresearch and realize the effort to make a good animation movie. Maybe\nthen you will write something useful.<br><br>Well done Big Hero 6!!!<br><br>I highly recommend this movie to kids, adults and technology\nenthusiasts.\n"},
{"review": "\nIt is obvious that Big Hero 6 was the best animation film of 2014.I\nalways appreciate those movies which motivates us and especially\nchildren towards science and Big Hero 6 is a awesome example of\nthat.This movie movie was full of fun and show us the importance of\nfamily,friends and how to clam down when we lost our loved ones.when it\ncomes to characters i must say Baymax is truly a masterpiece,every\nchildren and people of all age surely will love this character because\nof his loving and HUGGING personality.The special bond between Baymax\nand Hiro was incredible and that made this movie my favorite next to\nHow to train your dragon.Big Hero 6 is that kind of movie that make us\nbelieve that i can be super hero and that differ it from other\nsuperhero movie.And last of all when it comes to villain,Big Hero 6\nmovie did an outstanding job because there was quiet a good story\nbehind his evilness.the graphic and sound quality was truly marvelous.\n"},
{"review": "\nI don't normally write reviews, however after reading some other\nreviews on here I felt that it may have been misinterpreted. Whilst it\nis a kids film, which is obvious in the animation and relatively simple\ncharacters, Big Hero 6 is so much more. Disney has attempted many new\nthings which in my opinion has invigorated the brand and widened the\naudience. The obvious one being the use of a Marvel Comic and superhero\ntheme. This allowed for the movie to be much deeper than a typical\nDisney movie as it was a metaphor for loss and the seven stages of\ngrief. For example, the superheroes convey the fight that Hiro needs to\nhave within him in order to overcome such tragedy. The anger he feels\ntowards Callaghan conveys the betrayal one often feels after\nexperiencing a loss and how they may lash out, isolating themselves and\nperhaps hurting loved ones. This is seen in his treatment of the four\nfriends and Baymex when he removes the memory card and tells him to\ndestroy. In the end he eventually manages to move on and accepts his\nbrothers death. This theme is also explored through Callaghan.\nTherefore I believe that this is as much an adults film (or perhaps\nmore) as once you explore it beneath the surface there is an alternate\nmeaning.\n"},
{"review": "\nA childhood prodigy delivering on the grandest stage..awesome\nmovie..just my kind of animation.plus there a humor that tickles you\nevery time..although the ending is a bit sad. This kind of movie just\nmake you like animated movies more and more as they depicts moves and\neffect that is never possible in a real movie..<br><br>Moreover, the whole good robot turning into a more cooler dark robot\nbut still retaining its good behavior is an apple to the eye..also the\nupcoming a a new hero in a movie is always welcome for the\nviewers..This kind of movie fits viewer of all ages..whether you are 9\nor 30..just awesome..and by the ways..it is one of the best animated\nmovie in 2014..lets hope for more sequels...i suggest every user to\nwatch it..\n"},
{"review": "\nSo basically, it's a movie which is inspired from the Marvel's comic\nbook with the same title. Removing the serious parts from the comic\nbook, Big Hero 6 by Walt Disney is a bliss for those who ended up\nloving similar movies, for example, Kung Fu Panda, The Incredibles etc.\nThey have changed the story a lot which makes it way too different than\nthe comic.<br><br>Other than that, what I loved about the movie is how, throughout the\nmovie, Hiro, the protagonist learns of responsibilities and to come\nover his pain.<br><br>They have done a great job on Baymax, who, in the comic was a \"monster\"\n(seriously)? At some point, the movie seems like it is lacking the fun\nbut that's just for 10-20 minutes and I am very sure of the fact that\nmost of the viewers will end up loving Baymax for his behavior and way\nof speaking.<br><br>This is not some another movie like Planes but a whole new experience\nfrom Disney which blends comedy and action nicely along with a sense of\nresponsibility.\n"},
{"review": "\nHonestly, I put off watching this because I didn't feel like I would\nenjoy it so much. I was proved wrong. Right from the start, the fresh\nanimation of this film along with the brilliant editing and voice\nacting had me engaged. Though the plot is pretty flat and for kids, the\nconcept is pretty new (in that it hasn't been totally overdone),\ndealing in robotics which allowed them to show some cool stuff. But the\nstory being from Disney, did have moments of it being 'too easy' as\nwell as a few stock characters but it wasn't such a big deal. The story\nwas told well, and wasn't cheesy or boring at all. The freshness of the\nvoices and the animation really put this film together.<br><br>The connection between the voices and animation really showed on screen\nthe chemistry between the characters, and this worked to gain the\nsympathy of the viewer's at certain scenes. I thought that was well\ndone, the characters were developed well in relation to each other. And\nI know I keep saying this, but I just really like the animation, and\nthe effects. Baymax is so cute, and the other character's have a kind\nof Asian feel to them. It's also quite cool how the animated characters\nalmost always resemble the actors voicing them (I guess this is\nintentional).<br><br>However, watching the trailer again, I notice that they miss some of\nthe scenes out. I mean if you put it in the trailer, you've got to put\nit in the film! I would've liked to have seen the scene with Baymax and\nthe soccer ball.<br><br>Read more movie reviews at: championangels.wordpress.com\n"},
{"review": "\nPrecocious genius Hiro, at the behest of his big brother Tadashi,\nauditions his minibot invention for a place on an educational science\nprogramme. There is an explosion and Tadashi is killed. Discovering the\npersonal health companion robot Baymax invented by Tadashi, Hiro starts\ninvestigating the suspicious circumstances of the fire, helped by\nTadashi's work colleagues.<br><br>Disney, CGI, based on a comic, heroic goings-on \u0096 I know I was going to\nenjoy this before I went through the doors. What I didn't realise was\nthat it is a super-hero origin story (or, rather, a super-team origin\nstory). And, for me, it had everything \u0096 great characters, emotional\ndepth, and terrific action. It had heart \u0096 something I always love in a\nfilm - genuine jeopardy, and a sense of joy in its super-heroics that\nlast year's drab, depressing Man Of Steel couldn't even sniff at.<br><br>Oh, and it's very funny, too.<br><br>And I was delighted to see that a flyover of the animated city of San\nFransokyo clearly showed the small beach where I paddled last year on a\nholiday which took in San Francisco.<br><br>Highly Recommended.\n"},
{"review": "\nI highly recommend it! Big Hero 6 has a very entertaining story, I mean\nis Disney and Marvel. This is the first animated movie Disney creates\nbased on a Marvel property.<br><br>Like other Disney films Big Hero 6 is a mix of action, drama, comedy\nand strong relationships between the characters I can tell you are\ngoing to lo love Baymax.<br><br>Visually it's amazing, Disney animators are pushing boundaries with\nevery new film. In some shots, specially those showing San Fransokyo\nstreets you can forget you are watching computer generates graphics it\nlooks so real. Also the textures like the hair of the characters is\nmind blowing. I watched it in 2D but know I want to re watch it on 3D.<br><br>Well you should go and see it to see if you agree y or disagree with my\nenthusiasm!<br><br>Ps: the short film at the beginning is also very good.\n"},
{"review": "\nI know there are generally many bad movies out there but Big Hero 6 is\nnot one of them. Yes I know we had some pretty forgettable movies from\nDisney in the past but nowadays they have been able to show so much\nmore than too simplistic stories or even annoying endings where it ends\nin a pathetic way. But Big Hero 6 does not have any of those I do not\nunderstand all the hatred?<br><br>Ignore the stupid fact about this is a kids movie, BH6 showed so much\nmore than what the negativity wants you to believe in to. There are\ncharacter development, a story that really focus to find its goal,\ngood-spirited and likable characters, enjoyable soundtrack and of\ncourse it's heart.<br><br>I refuse to agree that this is a horrible movie, it bloody isn't! If\nyou want to talk about bad Disney movies then talk about Little Mermaid\n2, Pocahontas 2, Cars 2 or Brave. This is Disney's most entertaining\nand their best movie since Wreck-It Ralph. Ignore the hatred and see\nthe beauty of this Oscar winning film which I guarantee it's also worth\nwatching.\n"},
{"review": "\ni want post my review for the first time, sorry for my bad grammars\ntrailer makes me going excited in the first place and when i was saw\nHiro for the first time nothing words to deserved it except adorable.\nand Baymax , please stop being a big baby and too cute that's not\nhealthy for my hearts. i love all , characters and story, though it's\neasy to predictable and the animation really good. but one's i regret\nit ,duration not enough to satisfied me. and Tadashi's destiny so sad.\ni hope still there's development relationship of Tadashi and Hiro.\ninteraction of Baymax and Hiro still love the most. in the end of\nmovie, i don't want this movie going to end. i don't mind if big hero 6\nwould be animation TV and appear on the world\n"},
{"review": "\nInspired by Frozen I started my search for new Disney movie which will\noffer me same \"Disney magic\" as i experienced in Lion King, Pocahontas,\nBugs life, Frozen etc.<br><br>So I found Big hero 6, and the magic started. This movie is made for\nall ages. What i find very interesting in this new Disney movie is that\nhe is very educational, specially for children, but grown ups will\nenjoy ether. characterization is very deep , and you will feel as you\nare one of the characters in this beautiful story. Visual effects are\nstunning, so u will experience another Disney master piece. <br><br>After seeing this movie , I would really recommend it to all movie\nlovers, especially fans of the Disney cartoon movies. If you are\nlooking for an intelligent and inspiring cartoon movie for your\nyoungest, you can stop looking because you just found it.\n"},
{"review": "\nWhat I appreciated most about this movie was the setting, having\nneither been to San Fransisco nor Tokyo I cannot comment on if it is\ntrue to either of them - but I really liked the city and the culture\nthat resulted from it.<br><br>You can hardly see the effect of the technological advances that has\nhappened in this world, and because of this it feels like it's in the\nnear future. As it is a movie for younger audiences, it is\nunderstandable that they want it to be easily relatable.<br><br>The parts of this movie that I did not like are probably some of the\nparts that the younger audiences will like the best. The Fred-character\nwas partly delightful, but also \"too much\". The same with some of the\nmoments in the film (like the suggestion given by one of the heroes in\nthe last fight). Some of the motivations of the characters are also\nsimplified so much that they are hard to understand.<br><br>If you are a comics geek, I recommend staying till after the credits!\n"},
{"review": "\nI did read before I went to see this movie that Disney would be testing\nsome adult subjects, like the loss of somebody. Without putting out\nsome spoilers, I might say that the movie really touched my boys. I\nhave two boys in the age 6-9, and both of them had both laughter and\ntears during the movie. <br><br>It is a great action, comedy, drama package. Both my sons fell in love\nwith Baymax, and if he where standing outside the cinema when we left\nhe would have been given a big hug for sure. <br><br>The storyline is good, and as a father I had quite a few laughs myself\nand managed to stay awake for the whole movie. Many times going to the\nmovie with your kids can be a snooze-fest, but this one actually\nentertained me as well.\n"},
{"review": "\nSo I am a little biased as i love comic book movies. Just gonna start\nwith that.<br><br>So I nerve new that this was originally a marvel story. So when i heard\nthat it was definitely on my must see list. Not to mention the trailer\nwas pretty funny, the scene in the police station and the following\nscene at the kids home.<br><br>This movie has the driving force that all great hero stories have,\nfollowed by the conquering of self and the inevitable epic battle. This\nmovie has everything necessary to be a great comic book movie and a\ngreat Disney movie. Fun for all ages, and friendly as well.\n"},
{"review": "\nAre we soon coming to a time when the truly life-like actions and\nrepresentations of objects by animated films are taken for granted? I\nhope not.<br><br>\"Big Hero 6\" tells the story of a young boy and his robot. And I hope\nno one is taking for granted the amazing \"cinematic effects\" created\nvia animation. These animators repeatedly fool the eye into thinking\nthe images are created through the lens of a camera. To further this\nillusion, the point of view is what one might see through a camera. It\nis almost tempting to compliment the camera's movement, until you\nrealize there is no camera. In the same vein, I love the \"shots\"\nthrough translucent (but not clear) glass, the slo-mo, and the depth of\nfield created by \"unfocused\" objects in the background.<br><br>The overall style of the film is reminiscent of anime and classic\nsci-fi. And it starts with a mystery that our hero (Hiro)\ncleverly--with the aid of a clue that is genius in its simplicity and\ndesign--sets out to solve.<br><br>Time and again, the characters look and behave in very human ways. And\nsince I am not yet ready to just accept such technical artistry as de\nrigeur, I say \"Bravo!\"<br><br>If you liked \"The Incredibles\" or \"Wreck-it-Ralph\", you will probably\nlike \"Big Hero 6\".\n"},
{"review": "\nbasically I will say that I like all marvels live action movies but\nactually I never expected it will prove itself in animation too.<br><br>the film was awesome the action and techs were awesome especially\n\"microbots\" and I liked the whole team especially bay-max and the\nemotion between the Hamada brothers and between bay-max and Ciro were\nalso awesome.<br><br>I like live action movies only though I watched smurfs but after\nwatching this movie I will watch the animated movies too.<br><br>I thought marvel is awesome in live action but they proved themselves\nin animation through this movie. I heard that the sequel is announced\nand maybe it releasing in 2018 hail\nmarvel................................\n"},
{"review": "\nJust seen Big Hero 6 and really enjoyed it, another terrific animated\nfilm by Disney. I thought it was every bit as good as Wreck-It Ralph.<br><br>The film is somewhat a film of two halves, at the start it is all about\nthe characters and it is absolutely hilarious in parts too. The second\npart of the film went a different direction as we saw a lot of action,\nwhich I wasn't expecting. But it was still good.<br><br>The animation is superb as usual and the voice cast are very good. I\nliked most of the characters in the film but Baymax is truly memorable,\nBaymax provided so many funny moments and in general is just a very\nlovable character.<br><br>A film that is a good mix of everything, sweet relationships between\ncharacters, very funny, cool gadgets, great action scenes and some\namazing visuals. Just a really fun film to watch for all ages.<br><br>9/10.\n"},
{"review": "\nGreat, amazing, excellent. I feel lucky that I got my daughter to watch\nthis film and I have equally enjoyed it. One of the best of Disney's.\nThe story kept the interest during the whole film. Laugh, emotion,\naction, message, friendship, family, inspiration\u0085 had it all. Fully\nrecommended to parents with children but anyone will enjoy it. Really\nworth it. <br><br>What touched me the most was the message tried to pass on of getting of\nthe chair and fight for a purpose. Firstly the effort of the older\nbrother, to help his brother stop wasting his bright mind and get him\nto the university. Then Hiro himself tries to fight the loss of his\nbrother with the help of the robot and the other friends.<br><br>Scored it 10 without thinking. One of the best films I have seen, among\nall categories, not only the cartoons one.\n"},
{"review": "\nYou will fall in love with the main character . The story is simple .\nIn great movies , I have often seen use of a normal phrase apt to a\ndefining moment which gets overlooked in normal situations . The\nduration is a bit short . The feelings of revenge , love , mindless\nenthusiasm are shown vividly in different contexts . The first half has\nmore laughs . There is some similiarity with iron man but the original\nlook of protagonist is far more entertaining . Everybody likes happy\nending . This is not comparable to wall-E which had deeper meaning .\nSeems , animation movies are now being created in bulk . A few years\nago , all animation movies had revolutionizing ideas with great fun ,\nNowadays it is less funny and more formulaic for commercial success .\nStill , this movie is good . I will call 'lego' as far more intense in\ngraphics due to its unique presentation . You can watch this lightly\nwithout analysing .\n"},
{"review": "\nOkay I had some expectations on Big Hero Six going into this. I was\naware that Hero Six was already a Marvel property that Disney was\nrelaunching as their own separate movie away from the Marvel cinematic\nUniverse. Well to be honest I don't see these guys throwing down with\nIron Man you know because they are animated. But one thing I will say I\nhad a lot of fun with this movie, kinda reminded me of my own child\nhood as well.<br><br>Right from the get go we are introduced to our Hero in this movie,\nironically called Hiro. Automatically I loved this little guy and I was\nalready on board with his adventure. He was funny a lil cocky and kinda\nhad a Luke Skywalker sort of Vibe to him, with a spice of Marty Mcfly\n(Star Wars and Back to the Future similarities stopping now) But then\nthe movie takes a dark turn (no Spoils so relax) and it reminded me of\nold Disney movies such as Lion King and Bambi. I always thought that\nlately Disney movies have been dulled down, and instead of teaching\nkids life lessons through cinema they are more focused now on just\npreserving their innocence. But not in Big Hero Six's case these guys\nhit us numerously with heart tugging emotions that really make me think\nback to classic Disney. For the record its not like they are shoe\nhorned in these events, they have key elements to the characters\ndevelopment and the stories development as well.<br><br>On the lighter side the movie was funny it had a great story line, kids\nmums and dads will love this movie, hell I'm 18 years old and I'm\nbuying this when it comes out. we are introduced to characters like\nBaymax who I can so easily see being this years hottest toy weather it\nbe on plushy's or any other gizmo toy industries can concoct.<br><br>Go see this movie if you love Disney a good laugh and just in general\nfun. One of Disney's jewels Cheers\n"},
{"review": "\nA little over a year after I took my granddaughter Catrin (then almost\nthree) to her first ever movie \"Frozen\" (which she utterly adored), I\ntook her (now just four) to see this very different film from the same\nstable (Walt Disney Animation Studios) and I'm delighted to record that\nshe loved it. We saw it in IMAX in 3D and we were both blown away.<br><br>Although this time the central character is a young boy - Hiro Hamada\nof the city of San Fransokyo - rather than two princesses, my\ngranddaughter had no trouble relating to it because Hiro is so cute,\nhis inflatable robot Baymax is androgynous, and two of his four friends\n- making up the six heroes - are very capable girls.<br><br>I reckon that \"Frozen\" plus \"Big Hero 6\" - with a few films in between\n- will give her a lifelong love of the movies.\n"},
{"review": "\nThe special bond that develops between plus-sized inflatable robot\nBaymax, and prodigy Hiro Hamada, who team up with a group of friends to\nform a band of high- tech heroes. <br><br>Big Hero 6 is the first Disney animated to have Marvel characters in it\nas the story is inspired by the Marvel comic of the same name!\nApparently we get Marvel movies in a form of Disney movies now: it is a\ngood time to be alive! There's even a Stan Lee cameo! Life is good. A\nlarge theme of this film is science, how it could be use to help\nmankind and before the adventure even begins they make it look cool.\nWhat makes this film special is the relationship that forms between\nHiro and Baymax. In fact, Baymax is one of the most lovable character\nI've ever seen in an animated movie, everything that come out of his\nvoice and behaviour is hilarious. This bound that forms between them is\nwhat gives the movie its emotional core. We mostly have seen this movie\nbefore as it is a sort of amalgamation of The Incredibles, Iron Man,\nThe Avengers and Terminator 2; but the movie is written and directed so\nwell, is so funny, that characters are what drown you into it.\nObviously this film is aiming children but the major theme being\nscience it will appeal to all ages, it has this feeling of ingenuity\nwhich can influence and inspire children to make something special for\nmankind. This film tells a story that is realistic and that children\ncan understand, sometimes in life certain things do happen and even\nthough this is a fictional/fantastic movie there are a lot of human\nemotions to be felt; emotions that are not forced at all. It is good\nfor kids to know that they're out there. Finally it has some quite\nentertaining action scenes however for an hour and a half long movie it\nalso has some pacing issue, at one point I feel like the movie was\ndragging a little bit but then it goes on. <br><br>Overall Big Hero 6 is a movie for the entire family in which everyone\ncan learn something and be entertained\n"},
{"review": "\nBig Hero 6 was whimsical and wonderful and an absolute joy to watch.\nI've long grown out of kids' movies, so I stepped into the theatre with\na cynical mindset and very low expectations, especially considering the\nrecent animated movies Disney has put out- but it blew me away! It's\ngratifying to see that the entertainment industry is still capable of a\nfeminist, racially diverse, culturally respectful movie that's\nall-around sweet, heartwarming, tear-jerking and funny, complete with\nhumour that's neither crude, clichéd, degrading nor disrespectful\ntowards any gender or race, and highlights familial love and friendship\ninstead of the classic romance. It has has singlehandedly restored my\nfaith in animated movies (and Disney). Kudos to Disney and may they\nkeep producing animated movies of this quality.\n"},
{"review": "\nI didn't see this movie when it was first released back in December,\nI've read a few Big Hero 6 comic book issues, not a big fan. But the\nmovie is really well done, you really care about the characters and\ntheir situations, the animation is superb, the story is really well\nconstructed. The only \"problem\" with this movie is that it's the\ntypical super hero origin story, there's really nothing new about it.\nHowever, this is not a problem since it's so well done. Without giving\nany spoilers, the movies gives us what Disney ALWAYS gives to the\nviewers, a tearjerker story. It's not as harsh as Bambi or the Lion\nKing, but if you cry easily, get a lot of tissues along with the\npopcorn. Kids will love it as well as super hero fans. And there's some\njokes here and there for the parents, they won't be bored with it. Big\nHero 6 is a great time.\n"},
{"review": "\nBig Hero 6 continues Disney's winning streak that started around\nTangled with this adaptation of a little known Marvel comic. Big Hero 6\nis a simple superhero origin story for this kid friendly style of The\nAvengers with possibly the most adorable robot ever in Baymax who is a\nhealth care bot redesigned to be a superhero. Big Hero 6 is colorful\nand massively entertaining with a lot of funny characters and heart.<br><br>Good: The relationship between Hiro and Baymax is the driving force of\nthe movie. After a serious event (which I liked seeing in recent\nanimated movies which is a sign they are not striving for the lowest\ncommon denominator), Hiro and Baymax are a great team. Baymax is quite\npossibly the cutest robot ever, but the cuteness is not overdone to\nmake it syrupy. Their connection is layered and provides some weight to\nthe events later on. The rest of the characters have a lot of\npersonality and provide plenty of funny moments. I also really like how\nthe movie makes science look like a blast possibly inspiring children\nto seek out a possible career in it and promoting creativity. The\nanimation is beautiful with the surroundings bright and colorful.<br><br>Bad: I wish the movie was maybe a bit longer and the villain had a\nlittle more to do because the story is really strong and could have\nbenefited from a few more scenes.<br><br>Overall, this is another ace for Disney as it brings forth sweet action\nand funny jokes with a good dose of heart.\n"},
{"review": "\nFrom the creators of Wreck-It Ralph (2012) &amp; Frozen (2013), here comes\nanother impressive animation that's as fabulous as the above mentioned\nfilms, continuing the recent success streak for the studio. Big Hero 6\nis based on the Marvel Comics superhero team of the same name. It is\nsuch an outstanding animation a whole family can enjoy.<br><br>The story of Big Hero 6 is set in a futuristic city called San\nFransokyo (a coinage of San Francisco and Tokyo), the scenery is\namazingly beautiful.<br><br>The protagonist Hiro, a genius in robotics, has a special bond with his\nolder brother Tadashi's invention called Baymax, a cuddly balloon like\ninflatable robot, which is designed to serve as a personal health\ncompanion. The relationship between Hiro and Baymax is very touching.\nWho doesn't like this cute, kind, lovely, royal, cuddly human-like\nrobot?<br><br>The version I have watched is 3D but the visual effects are almost the\nsame as 2D. So, if you don't want to spend extra money on the 3D\nversion, 2D will be fine in my opinion.<br><br>All in all, the animation is superb, the plot is interesting, the\ndialogs are humorous. I am a 13-year-old boy watching this movie with\nmy family. We all loved it. This is the movie for all ages. Definitely,\na must watch!\n"},
{"review": "\nYes, I'm a huge fan of Disney's previous movie. People can call it\noverrated as they like, but it's certainly one of my all-time favorites\nand will continue to be so. Given that,I had pretty high expectations\nfor Disney's next effort. And turns out,I was not disappointed.Big Hero\n6 is excellently crafted. It's massively humorous,yet has some feels\ntrip.It hits the note right with the balance of comedy and emotions.\nIt's packed with excellent team super hero action like The Avengers,\nbut also is equally clever at needed times like How to Train Your\nDragon. It's one of the funniest movies I've seen in recent times, but\nalso is emotionally intense. Greatest of all,the movie also packs some\nstrong lessons and is thematic as well. Big Hero 6 combines the much\nneeded elements of many movies and executes them superbly and adds some\nof it's own flavor on top. It also has excellently designed and nearly\nlifelike distinct characters. Only problem was that the movie felt too\nfast paced at certain points. And I won't give away anything,but the\nending felt a bit too similar to one of my all-time favorite non-Disney\nanimated movies that came out in the 90's. Hence the term contrived.\nBut the movie is still great in it's own rights. Get ready for\nexcellent entertainment,great superhero action and some well-executed\nsmartness as well when you're seeing Big Hero 6. It's one of the finest\nanimated movies to come out this year.\n"},
{"review": "\nI'm tempted to say that children's movies or family oriented movies are\ngetting better, but that would be tantamount to outright dismissing\ngems like The Dark Crystal, The Neverending Story, The Princess Bride,\nLabyrinth, The Secret of N.I.M.H, and so many other fantastic movies\nfrom my own childhood. So, even though the movies today might not\nactually be better as far as subject content and narrative are\nconcerned, there are a lot more of them...and that makes me happy. Big\nHero 6, which I just watched last night, was both sweet and adorable\nwhile simultaneously poignant with its handling of difficult subjects\nlike the death of close family members and the grieving process. My\nfavorite thematic element would be the focus on science and engineering\nas positive and pleasurable hobbies and occupations for children to\npursue, a sentiment that is sadly underrepresented in the world today.\nMuch like Frozen, Despicable Me, and Monsters Inc., there isn't much\nthat I could complain about where Big Hero 6 is concerned. The\nanimation, like so often anymore, was fantastic and the cast of voice\nactors brought life to even the less pivotal characters on screen. Like\nmost, if not all of the family friendly movies coming out, this isn't\njust for children and can be enjoyed by anyone of any age, I think.\n"},
{"review": "\nThis is the perfect anime family film. Its funny and has a great\nstoryline. There are many more good points to this movie including cool\nfight scenes. I really think this film has done well for its self and\nbrings Disney back to form after a roll of bad movies including Frozen,\nMaleficent, Planes, The Lone Ranger and OZ the great and powerful. This\nis a big statement but this is the best animated film since The\nIncredibles and Monsters Inc. This movie is also very clever in the way\nit shows technology off throughout the movie. If you are thinking about\ngoing to watch this movie, go now. Overall this movie has good action,\nclever storyline, funny and great for the hole family. 8.2/10 gives\nthis film justice.\n"},
{"review": "\nBig hero 6 is the story of a Boy named Hiro Hamada who lost his brother\nto a fire and is left with his creation, a huggable healthcare robot\nnamed Baymax. when they both discover a villain that stole Hiro's\ninventions to get revenge, they form a superhero team of robotic nerds,\nto save the day. so, what do I like about this film? it has a great\nstory, great cast of characters, a great villain, great animation, a\ngreat crossbreed of two big cities, and the greatest character ever\nmade by Disney. it also has a good message about getting over loved\nones but still holding them dear to your heart. and it has a great\ntwist halfway into the movie.<br><br>This movie is Oscar worthy. I'm predicting it'll win best Animated\nfeature film at the 87th Academy awards.\n"},
{"review": "\nBig Hero 6 is a big shot through the heart (with a taste of Bon Jovi)\nto all of the other films of this year. Being one of the first major\ncollaborations between Disney and Marvel, Big Hero 6 delivered one hell\nof a blast in the box office to become one of the best movies of this\nyear. Keeping the lovable Disney style with the typical Marvel taste\ngave this movie a big jump in quality. It looked gorgeous, it felt\nsmooth and savory, and I enjoyed every second of it.<br><br>Mixing a beautiful visual quality with its glorious soundtrack, it felt\nlike I was watching Guardians of the Galaxy. Having a great cast of\ncharacters who had their wonderful personalities and visible flaws (as\nall people do, this is personal flaws, not flaws in the actual\ncharacters), it felt like I was watching a mini Tony Stark trying to\nbuild his way to solve all of his problems. The movie was a perfect\nlength, having a quick introduction into who everyone was (with no 20\nminute backstory *jumps up and flails in excitement*), and then it got\nto the problem. It was on point and direct all the way through, just as\nwell as having fun along the way.<br><br>I only had one, very very VERY slight problem with this movie. It was\nhow Hiro (the main character) didn't come across as to who the supposed\nvillain was, even though he could build an army of neuro-transmitted\nmicrobots in a garage. And how quickly the scene seemed when he came up\nwith the solution to fight the problem with his friends. Very very\nslight personal issues and nothing that reflected in on my review of\nthis film.<br><br>Big hero six is a clever, cute, funny, and VERY creative take on the\nmodern day superhero film. The movie took itself to great heights and\nearn its spot among some of my favorite movies of all time. This was a\nmovie made for anyone of any age, and that is a hard thing to pull off.\nFinal note, stay until after the credits. (It's a Marvel movie.)<br><br>Final Review Score: 10/10\n"},
{"review": "\nOh Yes. I did a *Insert Name Here* Is Love and Life meme. Because I am\nseriously obsessed with this movie! I haven't been in love with a movie\nthis badly since The Lego Movie! Even though Big Hero 6 does not have\nlots of Political Messages as The Lego Movie, It Still is a fantastic\nfilm that should be more loved. I really want to support this film in\nits fullest.<br><br>PLOT: Hiro is a Bot Fighter. But after Tadashi convinces him to go to\nUniversity where he sees potential, things go bad as 1. Tadashi Dies in\nan explosion. 2. His Micro Bots that he has made is found to be stolen\nand 3. A masked man is using the micro bots for his own good. So now\nits up to Hiro and his friends, The Big Hero 6 to set off to save San\nFransokyo!<br><br>From what I looked up, the movie is very different from the comics\nwhich I will have to look into more and find some to read. But for what\nthe movie is... WOW. San Fransokyo looks amazing in its opening shots\nof the movie. It looks incredible! As for the characters, MY GOD I LOVE\nTHEM ALL. Baymax is hilarious and is the center messenger of the film.\nHiro is really cool and so are all of his friends. <br><br>The whole film is filled with so much heart. An important movie because\nof its commentary on technology and if we are really ready to step into\nthe future and how it should be used properly. <br><br>By the end of the movie, I was wanting more and more! I actually wrote\na fan letter to John Lasseter who was the executive producer of the\nfilm to make a sequel or better yet, a TV series because there is so\nmuch you can do with these characters!<br><br>Big Hero 6 I think is going to be one of the all time classic animated\nfilms. I hope more people will support this movie because I would love\nto see every character again.<br><br>97/100 A\n"},
{"review": "\nIs Pixar even capable of making a bad film? I ask that honestly. Every\nfilm I have seen produced by them I either loved or at least respected\nthe precision of quality they give every production they do.<br><br>Big Hero 6 is certainly no exception.<br><br>The story of Hiro, a little boy who is into fighting bots who\nbefriends, what was originally designed to be a health care robot, is\ntouching, delightful and fun.<br><br>Hiro puts together a team of his science friends who each have their\nown special talents which he catapults into super hero \"powers\"\nincluding \"upgrading\" Baymax, the health care bot.<br><br>Together they try to figure out a whodunit and save the day.<br><br>Hero, as well as his team, learn a lot of valuable lessons throughout\ntheir adventure and if you don't come away from this movie wanting your\nown Baymax I would be surprised.<br><br>Although there are some darker moments it is nothing that would\npreclude little kids from enjoying the movie as the dark moments are\nnot that bad and the movie as a whole is a family friendly experience.\n"},
{"review": "\nI was reading some of the user reviews on here and don't understand\nsome of the negativity...so wanted to share my perspective on the film.<br><br>For me, the Good Guy vs. Bad Guy \"action\" sequences aren't the main\nstory line of the film. Rather, it seemed it was about loss and the\nstruggle of living up to the lost person's expectations while still\ntrying to hold on to the memories of that person and not let that loss\nruin those memories. In so many ways, I was very pleased that this\nmovie wasn't overly violent (Lego Movie) or princess focused but\ninstead had this more heart focused goal of loyalty and remembrance\ninstead.<br><br>Whereas some of the lines may have been cheesy or cliché and many of\nthe supporting heroes weren't developed, I found that was fine because\nthere was much more focus put into the main story line and it made it\nlighter on delivery. I also found the story was fresh and characters\nunderstandable - even the villain. <br><br>In summary, this movie was fun...with a good blend of serious. Highly\nrecommended.\n"},
{"review": "\nThis movie, if you haven't already seen it is a must see in my opinion.\nI grew up watching Disney movies and i recently haven't watched any of\nthe new titles they have been releasing. But i sat down and watched\nthis just because nothing else was playing and i was not disappointed.\nIt was really nice to see the Japanese concept i feel like they haven't\ntouched on the Asian community since Mulan. I would love to give this\nmovie a 10 however compared to the lion king and Aladdin it takes the\nsilver. The only thing its missing to be a truly great animated Disney\nflick is of course the musical numbers. Other than that this movie is\ndefiantly one i must add to my collection worth every penny and time.\n"},
{"review": "\nThis animated film tells the story of a technology geek who lost his\nbrother in a fire in a technological convention. He finds out that his\ninvention called microbots got stolen by a masked man, and he sets out\nto save the world with his friends.<br><br>\"Big Hero 6\" has fun and really cute characters. Everyone is very\nadorable, especially the marshmallow robot who has unconventional\nsuperpowers. The best thing about this film is that the superpowers are\ntechnologically relatively sound, at least in the not too distant\nfuture, making the heroes and the plot look a little more realistic\nwithin the fantastical dream. I also like the mash up between San\nFrancisco and Tokyo, making the city look like San Francisco with a\nJapanese twist. I enjoyed the film throughout, and there is not a\nmoment of boredom.\n"},
{"review": "\nJust watched this with my movie theatre-working friend who had seen\nthis twice before and liked it very much. So did I after viewing\nthis-what an awesome display of a bunch of science nerds becoming\nsuperheros after some tragic occurrences that happen early on. Baymax,\na rubber robot, is also on hand to help his human counterparts to set\nthings right. I didn't watch this in 3-D so when certain scenes came\non, I winced a little in not being able to do so. Still, this was such\na great mix of humor and action and had very likable characters, I\nmostly didn't care, one way or another! I mean, this was quite an\nawesome experience, I was simply just glad for the ride! So on that\nnote, Big Hero 6 is highly recommended. Oh, and don't miss the\nafter-ending credits sequence, it's a great hoot!\n"},
{"review": "\nI just came out of the cinema and I had to wipe my tears from my face.\nTears of laughter and emotions. I know this is not by Pixar but for\nonce I think Disney reached Pixar levels of amazing. Best Disney for me\nsince Monsters Inc. (if you count it as a Disney). The kids in the\ntheater loved it too of course but it works just as good and even\nbetter for adults. I thought Frozen was good but not 'amazing' like\nsome thought. This however surpasses Frozen on every level... except\nthere's no singing of course. But the movie is way funnier and will\nalso make you really sad at some points. Amazing movie, can't stress it\nenough. I just hope they don't pump too mich sequels out of this...\n"},
{"review": "\nThis is has Academy Award nomination written all over. <br><br>The characters are excellent and fun. Hiro is a great character and the\nwriting for his character is very consistent as a genius and going\nthrough the reality of a teenager. Baymax is a well written character\nand has most of the character development with Hiro being close second.\nThe chemistry and relations between Baymas and Hiro is great. One of\nthe girls pronounces Hiro's name right in Japanese pronunciation. <br><br>The acting is pretty good and speaking off I found TJ Miller annoying\nin Transformers but not here. He is pretty good being the comic book\njock and does not outstay his welcome. Speaking off this is a Marvel\nmovie so there is a Stan Lee cameo in the post-credits. <br><br>The center of this movie is not about being a Marvel superhero movie,\nit is about a boy and a robot getting justice for the death of his\nolder brother and then it becomes a superhero movie so it works getting\nto that point very well. <br><br>The jokes hit very well more than they miss. Some of the jokes got me\nlaughing. <br><br>The animation for this movie is pretty good and I find them very\ncolorful. <br><br>The story is pretty good and intriguing, and they have the tragedy at\nthe beginning when Hiro's brother is killed in an explosion. <br><br>I say the film's biggest weakness that it is predictable. There is a\ntwist on who is the main villain and it is easy to figure out on who is\nthe main villain. So it's predictiablity what hold this film back for a\nperfect score. <br><br>If you hadn't see it yet, then go see it because it is really great. I\nsay this film is better than Mockingjay and Interstellar.\n"},
{"review": "\nI know for a fact that it will be nominated for Best Animation at the\n2015 Oscars, no doubt. After the princess high I am sure everyone was\non after Frozen, it was nice to see a Disney film with a male lead and\nabout hi tech/engineering (Obviously not the first, I just enjoyed\nseeing this). This film had action, enough emotion to make you want to\ncry, and some seriously funny lines that had most of the adults in the\naudience laughing. Disney has really found it's way of really being for\nall ages, I went with my boyfriend and there was just as many older\ncouples as families. This movie was not just a film to entertain, it\nwas a push for kids to create, Who didn't want to build their own\nBaymax after watching this?!\n"},
{"review": "\nI absolutely loved this movie! It had cute adorable scenes and it had\nsad scenes, as well as some action scenes. The animation was beautiful\nand the concept of the whole movie was interesting and different. I can\nhonestly say that this is my new favorite Disney movie. Frozen? Who\nneeds Frozen when we now have Big Hero 6! This movie was really just\nthe epitome of perfection and it is so perfect that you could watch it\nwith your family! This movie overall made me smile and keep that smile\nfor the rest of the day. A movie definitely worth watching even if\nyou're an adult or you don't particularly like watching animation. This\nmovie will warm your heart and make you want to be a hero all over\nagain.\n"},
{"review": "\nI cannot get over how adorably cute this movie is. The movie constantly\nhits all the right notes. It is adorable, quirky, witty and completely\nemotional at the same time. The love portrayed between a young boy and\nhis brother, a man and his daughter and of course a young boy and his\nrobot is amazing. <br><br>It definitely is in the frozen league and m certain there will be\ntremendous fan following for baymax. Now that I have seen it, I am not\nsurprised at all that it grossed way more than interstellar. Everyone\nneeds movies like big hero 6 that leaves you warm and fuzzy right to\nyour core. <br><br>I am satisfied with your care. - once you get familiar with this quote,\nif you cried when you did, rest assured, you are awesome.<br><br>Oh and btw, don't worry, the ending leaves you happy happy happy.!!!!!<br><br>P.s. It is probably the only Disney movie where the characters do not\nburst into a song. :p <br><br>Bottom line - must watch for humans of all ages..!!\n"},
{"review": "\nThe movie is beautiful in a way that only Disney can do it. The main\ncharacter is an wonderful kid, I love intelligent kids and this one has\na background not so good to tell what makes his story more likable. His\nbrother's robot is hilarious and so sweet, and his robots are\ncompletely amazing too! I cried many times during the movie. To me is\nan absolute must seen for animation movies fans. For kids movie will\npass a good message about the will of want know and have great\nachievements, maybe a boost for interest on robots and science.\nFurthermore, the typical message about friends: with friends is easy\npass by tough situations, they always help us and will be there for us.\nAn important one. In future I absolutely will show this movie to my own\nkids!\n"},
{"review": "\nIt is a cute movie. As really it is bout friendship and relying upon\nothers. In the midst of adversity. <br><br>Hiro the prodigy and protagonist of the story is really smart and\ngraduated early from high school. But is ruining his life playing with\nillegal bot fights. After he wins, and gets the money, the bully he won\nagainst and his goons tried to get him.<br><br>But his older bother Tadashi, a college student rescues him and after a\nbrief jail stay, their aunt bails them out. Their parents died when\nboth were young. <br><br>His brother shows him the school Tadashi attends and he meets his older\nbrother's friends and is amazed. As he wants to now apply and realizes\nhe is wasting his potential indeed.<br><br>But when he shows his potential and his awarded the scholarship to the\nschool Tadashi attends. But a fire breaks out and his brother loses his\nlife along with his college mentor, Professor Callaghan.<br><br>Depressed Hiro seeks refuge but then he realizes a robot named Baymax\nthat was of his brother's. Who takes care and heals people. Learning\nnot to harm people along the way. Is how he was trained. Hiro takes\nBaymax as a friend and his brother's older friends as his own to help\nhim cope. <br><br>As Hiro learns that someone in a mask and black trench coat that is\nstealing his invention, Hiro and the older friends of his brother set\nout to find out who it is. <br><br>Hiro also makes Baymax upgraded hence the red amour outfit along with\nthe others giving them new outfits and powers. <br><br>It is a cute movie and not all is what it seems as you will find out\nwatching this. Very cute movie. It is heartwarming and bittersweet at\nthe same time. Love Disney!\n"},
{"review": "\nI am not a huge fan of CGI films. Now I am not saying I dislike them,\nbut I do feel that sometimes there are too many and too many mediocre\ncomputer generated cartoons. However, I think that \"Big Hero 6\" is\ndefinitely a welcome film to the genre. Why? Because the film is\nabsolutely beautiful, as the graphics are just amazing. Additionally,\nwhile I also think there have been way too many superhero movies, this\none is different enough to make it worth seeing.<br><br>The film is about a brilliant young man named Hiro. Hiro, though\nincredibly bright when it comes to robotics, is directionless until his\nolder brother introduces him to his research facility at the local\nuniversity. To win a scholarship to the place, Hiro creates an amazing\nrobotic system--one so amazing that someone is willing to kill to get\nit. And, once they've stolen it, Hiro uses his brother's medical robot,\nBaymax, to help punish the baddie and restore justice and niceness to\nthe world.<br><br>While the film DOES feature the usual sort of finale (the weakest part\nof the film--though I do understand why it's there), so much of what\nleads up to it is nice. I liked the characters, the back story and the\nwriting. It's really very clever in places--such as their wonderful use\nof Stan Lee in his cameos since this one is so unusual AND he appears\ntwice in the film (so stay and watch ALL the film or you'll miss it).\nWell worth seeing.\n"},
{"review": "\nSure to be the mega-hit of the holidays, Disney's futuristic tale ticks\nall of the right boxes: it's funny, smart, charming and exhilarating.\nSet in San Fransokyo \u0096 a clever amalgamation of American and Oriental\nstyle \u0096 we follow mourning teen-genius Hiro (Ryan Potter) as he bonds\nwith his late brother's friends and scientific creation, Baymax. With\nan irresistibly huggable design, amusing voice (thanks to Scott Adsit)\nand delightful demeanour, Baymax provides the lion's share of laughs\nand, ultimately, is the star of the show. Not as memorable as the\ncuddly, inflatable robot, the humans are a mixed bag. Whilst lead\nprotagonist Hiro and his brother Tadashi (the sort of older sibling we\nall want, voiced by Daniel Henney) are likable and fleshed out, their\nragtag group of mates are cardboard cut-outs and the pair of scientists\nvying for Hiro's invention (awesomely conceived micro-bots) are clichéd\nand one-dimensional. But underdeveloped supporting players and it's\nsomewhat generic ending are minor gripes, as Big Hero 6 segues from\nelectrifying action sequences to hilarious comedic set-pieces, via the\noccasional touching moments, with absolute ease, resulting in a\nnon-stop joyride. A wonderful Christmas treat from the Mouse House\nthat'll be a smash with young'uns and, possibly even more, with their\nparents.\n"}
]