[
{"review": "\n\nThe Green Mile is a masterwork. This is film as art, at it's very best. The\ndepth of the cast is extraordinary, with all of the players delivering\nexcellent performances. There is a clear sense here that all involved in\nthe\nproduction knew that this was something special, and gave it their all. See\nthis film if you truly enjoy actors giving everything to their craft. Watch\nfor the countless subtleties of expression, and the great power that the\ncast creates with silence. This is evident in the opening sequence and\nremains throughout. Above all, Michael Duncan as John Coffey is\nexceptional.\nHe brings gripping emotion to a unique, fascinating character.<br><br>The Green Mile should bring you joy, laughter, and if you are like most in\nthe theater this night, tears.<br><br>BRAVO!<br><br>\n"},
{"review": "\n\n\"The Green Mile\" is one of my favorite Stephen King books and I have read it\nseveral times.  I was anxiously anticipating the film version, but was\nconcerned that the emotional impact of the book could not be replicated on\nscreen.  Fortunately this wonderful story was adapted by Frank Darabont, who\ndid such a magnificent job bringing King's \"Shawshank Redemption\" to the\nscreen.  He does the same high quality work with \"The Green Mile\".  The\nstory is faithful to the book, only losing details that were not important\nto the story anyway.  The casting is superb - every actor is perfectly\nsuited for his role and does an excellent job, although I would like to\nsingle out Doug Hutchison.  His portrayal of the detestable Percy is right\non the mark and suggests complexities in this character I had not discovered\nin the book.  The length is about three hours and it seems that critics are\ncomplaining about that.  I can't understand the complaints.  The film never\ndrags and is never dull, and it certainly didn't feel three hours long.  The\nlength is needed to tell this story the way it should be told, and the story\nis so very engrossing.  Best of all, Darabont and the actors bring so much\nemotion ot the screen, that I cried like a baby through several scenes.\n\"The Green Mile\" will haunt you.  \n"},
{"review": "\n\nFrank Darabont returns to the directors chair with another adaptation of\nStephen Kings novel. The events take place at a death row, the guards call\nthe green mile. The story is a layered, rather character-driven fantasy tale\nof the events that transpire at \"the mile\" after the arrival of a giant man,\nJohn Coffey (Michael Duncan), convicted of the murder of two small girls.\nActually this is not one single story, but several tied together seamlessly.<br><br>A character-driven movie requires a lot from the cast, and fortunately when\nit comes to cast, The Green Mile delivers. As the poster of the movie tells,\nthis movie stars Tom Hanks as Paul Edgecomb, senior prison guard of the\nmile, and as always he performs very well indeed. Yet the cast around him is\neven more spectacular, perhaps partially due to them being relatively\nunknown. With a face you know, one inevitably remembers previous\nperformances, and the new role is coloured by this.  Doug Hutchison as Percy\nWetmore, a mean spirited prison guard was particularly impressive, yet his\ncharacter could have been given more depth. The most captivating was the\nperformance of Michael Duncan.<br><br>It is hard to find a flaw in this movie. The camerawork is superb, cast\nwonderful and direction flawless. The movie's considerable length, a bit\nover three hours, is something that had me worried. Yet the marvellous cast\nand the peaceful yet firm pace of the movie held my attention progressively\nthrough the three hours right to the touching culmination. Many will find\nthis movie to be too long, but I for one was delighted of the style,\ncombination of simplicity of events and depth of characters and\nconversation.<br><br>All in all the The Green Mile is a very touching drama, with the joys and\nsorrows of the life pictured with great skill, if not the best movie of the\nyear. Five out of five.\n"},
{"review": "\nHaving seen the movie, The Green Mile, and read the novel of the same \r\nname by Stephen King, I am glad to say that the movie stays true to the \r\nbook, which in itself is a great read.\r\n\r\nI read the book in one setting about a year ago, and after seeing the \r\nmovie, I didn't see one scene from the book, or one plot point, left \r\nout. There were a few minor changes from the book but which in no way \r\ndetract from either work.\r\n\r\nAs far as performances, I can imagine many people pointing to Michael \r\nDuncan as John Coffey or Tom Hanks as Paul Edgecomb as the best \r\nperformances of the movie, and they are good, but I would hope that \r\nMichael Jeter would receive recognition for portraying Eduard \r\nDelacroix. He plays Delacroix exactly as I pictured him when I read the \r\nbook.\r\n\r\nI can very well see why King himself said this is his favorite of the \r\nmovies adapted from his novels. It is the only one played out as he had \r\nwritten it.\r\n\r\nI wouldn't compare this movie or the book to (Rita Hayworth and) The \r\nShawshank Redemption because that would be unfair to both. They are \r\nboth great, but are both different. The Green Mile isn't a movie about \r\nhope and friendship, as The Shawshank Redemption was, it is a movie \r\nabout a miracle of a man, and the people he affects.\r\n\r\nBut like The Shawshank Redemption, I give The Green Mile 4 out of 4 \r\nstars. Great story, great cast, great look.\n"},
{"review": "\n\nThis movie is a real gem.  It is hard to find fault with it.  Hanks is\nexcellent in a role that clearly calls for him to suppress his natural slant\ntoward humor.  He is Paul Edgecomb; Tom Hanks is nowhere to be found.  Yet\nhe gives Edgecomb just the right flavor.  One cannot find a single weak cast\nmember!  Michael Jeter should have got an Oscar.  Michael Clark Duncan put\njust the right shading on his huge character to make him vulnerable and\nsympathetic.<br><br>Flawlessly shot on perfect period sets, the whole production binds together\nto bring the extraordinary story into the realm of a believable and\ncompelling study of human injustice and charity.\n"},
{"review": "\n\nWithout using all the old cliches, I would recommend this movie to anyone\ninterested in a creative, intriguing, and life enhancing experience.\nEverything about this movie was delightful. I recommend seeing this movie\nwith someone especially close to you. After the movie my Fiancée and I\nspent\ntwo hours talking and expanding on the films ideas and concepts. This was\ntruly a electrifying experience. I would venture to call this movie one of\nthe best movies of all time.  Sure, there are things that I would have\nliked\nto see done differently, but that is what makes a movie more enjoyable. The\ndiscussions following this film were wonderful.\n"},
{"review": "\n\nHaving doubts about seeing this movie because of the length (3 hours can\nbe\ndeath to a film).I was so surprised that I didn't look at my watch once\nthroughout the whole movie. Tom Hanks, in my opinion, gave the performance\nof his career by bringing emotion and depth to his part. The only actor\nthat\nbettered him was Michael Clarke Duncan. How he made this giant like\ncharacter into a vulnerable pussycat was a marvel. On whole, the cast came\ntogether and gave the best performance I have seen in a movie for a long\ntime. Not one of them let the side down by being weak. David Morse who is\nmore known for his supporting roles was also excellent and hopefully not\nlong till he's carrying his own movie. If you haven't seen this get it out\nnow,forget about the running time and connections to 'The Shawshank\nRedemption' and enjoy it for what it is, a little miracle.\n4 out of 5\n\n"},
{"review": "\n\nThe length of the movie was perfect. It kept to the story to an amazing\ndegree. The few changes didn't hurt the feeling nor the telling. The story\nitself is stirring and captivating. The casting of the parts and their\nportrayal were right on. This is one of the best movie versions of a Steven\nKing novel I've ever seen, and I think I've seen them all. If you're prone\nto tears at a film, take extra tissues, you'll need them. The theater I was\nin was a mass of sniffles through the end credits. If you like fantasy/drama\nthe film cannot be missed. There are some graphic scenes that may upset\nsome, but this is Steven King. This is a movie I plan to add to my video\ncollection as soon as the Letter Box version hits the shelves.\n"},
{"review": "\ni expected this movie to be a normal and i just want to see it for Tom\nHanks but as movie goes through i cry,i laugh and there comes a feeling\nwhich can't be described in words. i rate this movie as the best i have\never seen. some moments in the movie makes me hold my bed pillow in the\ntightest ever grip. i can guarantee that this movie will leave an\nimpression in your mind for a long time. i even say that this movie is\nbetter than shawshank redemption.fantastic story, brilliant acting,mind\nboggling feelings and overall an unforgettable drama. if you have\nwatched 1000 movies and not this then your movie watching journey is\nincomplete.i will also make sure that even my next generation should\nwatch this one.\n"},
{"review": "\n\nWhat an excellent movie this picture was. When I first saw the trailers in\nOctober, I thought it might be pretty good.<br><br>The Green Mile exceeded my expectations. Tom Hanks leads a wonderful cast in\nthis movie which stands out by far from most others. If you liked Shawshank\nRedemption, you'll love this one.  I've realized just how good Stephen King\ncan write, now that I've seen this and Shawshank.  It's three hours long,\nand worth every minute of it.  It touched me in many ways.  I was fortunate\nenough to see it twice. And I will buy it on dvd as soon as it is available.\nThe Green Mile will certainly become\na classic. Go see it, you won't be disappointed.   \n"},
{"review": "\nThere's a reason why this Oscar winning tour de force is #67 ranked of\nall films on IMDb, despite the fact that it's 3 hours long and has some\ntruly grisly scenes (not for the squeamish, children, or a first date.)<br><br>It's chock full of outstanding performances, not only from Hanks, but\nalso from the many supporting characters, all who are rich and full. It\nwill seem slow to the impatient, but will be richly rewarding for those\nwith the stamina to make it to the end. <br><br>It will certainly get you thinking about capital punishment and perhaps\ndifferent shades/degrees of evil. It is either a deeply moving\nspiritual tale or a wonderfully creepy journey down the rabbit hole of\nStephen King's mind; take your pick. Either way, I put it right up\nthere on my desert island list with the likes of Shawshank Redemption.\nIt is definitely required watching.\n"},
{"review": "\nThis movie goes beyond others into an elite group with movies like\nFacing The Giants, Good Will Hunting, Men Of Honor and others; in which\nthe story is so brilliant and takes you to a climax higher than the\nusual, that it baffles you to think that there exist possibility in the\nhuman mind to create such a story. Kind of like songs, in which there\nare songs so brilliantly written that you can't imagine a human being\nwriting it.<br><br>I love drama, they're my favorites and I don't get bored with them\nespecially when it's interesting; so the length, which is something\ncomplained about by a lot of people with this movie, doesn't bother me\nat all it just adds more interest.<br><br>One of the best movies of all time and a must see! <br><br>10/10 without a doubt.\n"},
{"review": "\nGREATEST FILM I HAVE EVER SEEN. i remember seeing it when it first came\nout when i was 12 years old. now i just finished watching it and have\ngone through practically a whole box of tissues...<br><br>that pure, love and honesty was portrayed so exquisitely well by\nMichael Clarke Duncan... it made me want to tear my hair out. If there\nis anything in this world which reminds me of true human love and\ncompassion, it is this film. If you ever give up hope on humanity and\nthe destruction which our disgusting race has brought to this world,\nwatch \"The Green Mile\" Hopefully it will change your outlook a little\nbit like it just has mine.<br><br>11/10 SHOULD HAVE WON ALL THE AWARDS AVAILABLE THE YEAR OF IT'S\nRELEASE.\n"},
{"review": "\nIn every way, this is a wonderful film and IMO deserves a rare 10/10\nbecause it's hard personally for me to see how it could have been made\nany better. Hugely touching, emotive on every human level, a brilliant\nstoryline, by all accounts a faithful screenplay and wonderfully cast.\nIt's long, but the time flies.<br><br>Hanks is superb here as is the inspired choice of Michael Clarke Duncan\nand in fact all of the cast. Even the mouse was brilliant!<br><br>SPOILERS:<br><br>It's the story of a simple man wrongly convicted of the worst type of\ncrime. Set in a time where there is no real recourse to justice for\nsuch men and with a subplot that becomes the main focus of the film. Is\nJohn Coffey a gift from God and if so why are we allowing him to be\nlegally murdered? That he ultimately doesn't mind, doesn't ease Paul's\npain or the viewers pain at what we are watching<br><br>Both Bitterbuck and Delacroix will make you question the death penalty<br><br>Percy's grossly offensive behaviour will make you question your\nhumanity <br><br>Paul Edgecomb will make you realise what a fantastically emotive actor\nTom Hanks is and Duncan's John Coffey will make you weep<br><br>Hats off to you Mr Darabont once again and thank you for a truly\nbeautiful film.\n"},
{"review": "\nThis is easily one of my favourite movies of all time. do not be put\noff of watching this movie because of its run time(3 hours) because\nthose 3 hours will just fly by as this movie is so interesting and such\na huge success. tom hanks is the main character but i think that\nMicheal Clarke Duncan really does steal the spotlight away from him.\nStephen kings novel (with the same title) is not as good as the movie\nbut it still stands tall i would recommend viewing this little gem if\nyou're a fan of tom hanks or Stephen king.i have never watched a movie\nthat has made me cry but i have to say i was very close to tears after\nthe undeniable ending.the script is just outstanding and the acting is\nspot on.the storyline is very original as i have never seen anything\nlike this before and i don't think anyone will ever try to copy it.<br><br>if you're thinking about viewing this title and you haven't seen it\nalready i suggest you get the tissues ready.\n"},
{"review": "\nThe world is teeming with wretched prisons wherein all manner of men\nare housed. Because these men are said to have committed a crime, the\nplaces are manifest and most men serving there, have earned their stay.\nHowever, as history has shown, there are innocent men incarcerated as\nwell. Occasionally, one of these innocents are not only imprisoned, but\nare further remembered because their life becomes legend. In this case,\nthe realization is nothing short of incredible as the new prisoner is a\nnatural empath. Steven King the prolific American horror writer,\nchronicles this unusual story in a Louisanna prison where one Joe\nCoffee, (Michael Clarke Duncan) a huge, nay, enormous Black man, having\nbeen convicted of murder, is sentenced to be executed, by\nelectrocution. Tom Hanks( And Dabbs Greer) plays Paul Edgecomb, an\naging Prison Guard, who recalls his years in the state prison. Working\non 'Death Row' or \" The Green Mile \", Mr. Edgecomb recalls Mr. Coffee's\narrival and the strange events during his stay. With sympathetic\nGuards, like Brutus Howell (David Morse), Dean Stanton (Barry Pepper),\nHarry Terwilliger (Jeffery Demunn and one particular sadistic guard\ncalled Percy Wetmore (Doug Hutchison), Edgecomb recollects his\ndiscovery of the man's unusual healing powers and the surprising\nrevelations concerning his innocence. The story is crafted by Steven\nKing and it's application to the silver screen is perhaps one of the\nfinest adaptation ever done. Duncan is magnificent and has a superb\nability to allow the audience to learn his true purpose. Were it not\nfor the sadistic behavior of Hutchison, who earned his ultimate reward,\nthe story would not have carried it's genuine sympathetic awe which\ngave this movie it's Classic status. A great film and a must for true\nmovie fans. ****\n"},
{"review": "\nThe Shawshank Redemption is possibly my favorite movie ever. I had seen\nmany movies before it, and I've certainly seen a lot after, but not\nmany of them made me feel what that one did. Now, I have that feeling\nagain. And once again, it comes from watching a Frank Darabont movie. I\ncouldn't possibly explain the overload of emotions I experienced in the\n3 hours it lasts. I have laughed. I have felt the emotions of every\ncharacter. And most of all, I have cried. Very few movies have touched\nme like this one. Is there something to say about the acting that\nhasn't been said before? No, it isn't. You may have heard it is\nflawless, incredible, whatever. You did hear right, it absolutely is. I\ncan't think of anyone in the whole movie that wasn't convincing in the\nleast. The script has its funny moments, but it's incredibly deep,\npoignant and heartfelt. The characters are so \"human\" and unpretentious\nyou can't help but adore them. But, well, there will be some you'd like\nto strangle. There has to be a villain everywhere, right? The Green\nMile is a movie I will hardly forget. You can't possibly forget such an\nemotive story.<br><br>What, you want to watch it? Great! But don't forget to have grab some\ntissues first.\n"},
{"review": "\n\nWhen I watch films like the Green Mile I feel absolutely furious.\nMainstream\nUS cinema industry has unfortunately bombarded us with products (I cannot\ntreat them as artworks) of very low quality, to be consumed immediately\nand\nprovide some instant but short-lived gratification of the senses. Such\nfilms\ntrigger shallow reactions of fear, sadness, sympathy etc., but never stick\nto mind and will never become points to which one would return at leisure\nto\nponder or draw meaning for one's own purposes. Extraordinary and\nunrealistic\nsituations, special effects, obsession with violence and cruelty, cheap\nmorality and ostensible moral struggle and (on other occasions) sex are\nthe\ningredients of 95 per cent of such products. I am deeply sorry that these\nso-called artists seek to maximise profits at the expense of their art and\nI\nhope that they sometime wake up, if they ever can, to complex social\nrealities and relations and to the multiplicity of the human condition,\nwhich they so obviously ignore and downgrade.\n"},
{"review": "\nTom Hanks, in my opinion, gave the performance of his career by\nbringing emotion and depth to his part. The only actor that bettered\nhim was Michael Clarke Duncan. How he made this giant like character\ninto a vulnerable pussycat was a marvel. On whole, the cast came\ntogether and gave the best performance I have seen in a movie for a\nlong time. Not one of them let the side down by being weak. David Morse\nwho is more known for his supporting roles was also excellent and\nhopefully not long till he's carrying his own movie. The Green Mile\nisn't a movie about hope and friendship, as The Shawshank Redemption\nwas, it is a movie about a miracle of a man, and the people he affects.\n"},
{"review": "\nThe Green Mile.... Yet another movie which made me cry.<br><br>Outstanding work by Frank Darabont. Both his prison dramas \"The Green\nMile\" &amp; \"The Shawshank Redemption\" are real class! <br><br>This film is beautifully written and perfectly cast. Michael Clarke\nDuncan delivers the performance of his career. There are scenes in this\nfilm that will make you quiver, and there are scenes that will keep you\non the edge of your seat until you cry. <br><br>Tom Hanks once again provides a strong support for a talented ensemble\ncast.<br><br>Darabont's skills as a screenwriter that even after three hours, he can\nbring the film to such a good, solid conclusion.\n"},
{"review": "\nI think I got the message of the film after about 45 minutes; that\nthere is so much hatred and anger among people, and that revenge is\nnothing constructive. A very important message which I think the film\ndelivers brilliantly, with John Coffey as a \"triumphant card\". The\nsupernatural effects in the movie might be unbelievable if you focus\nsolely on them, but I think they're \"metaphoring\" and make things a bit\nmore understandable, maybe. A wonderful movie that moves at a measured\npace on to a very unexpected ending. As with most great movies the\ncasting is almost perfect and each character gives added depth to a\nrich script. Tom Hanks gives another outstanding performance, his\nsupporting actors (particularly David Morse)actually support and\nenhance his role. A really great story - not at all what I expected,\nbut much more.\n"},
{"review": "\nFrank Darabont directs another masterpiece adapted by a Steven King\nnovel.Sheer brilliance at its finest.Tom Hanks makes perhaps his\ngreatest performance as the corrections officer Paul Edgecombe who\ndoesn't believe in miracles until he sees one.While Tom and the others\nall shine in their roles I think that Michael Clarke Duncan deserves\nmost credit as his magnificent portrayal of John Coffey-a convicted 8\nfoot tall giant murderer.He is accused in the killing of two little\ngirls and sentenced to death.With time however Paul starts to wonder if\nthe gentle hearted Coffey really did commit the murder.The movie has so\nmany emotional moments that it's hard not to sympathize with the\ncharacters.The deep emotional drama of some of them is mentally\npressuring and you become connected with these people - again expertly\naccomplished by Darabont who perfectly understands the source material\nand sticks close to it.Like Shawshank before it the movie teaches us\nthe value of human life and how strong each one of us can be.This is\nachieved here similarly as again there is an innocent man put in prison\nbut unlike Andy John is touched by God.He is a magical being who calls\nforth sympathy and by the end the audience is so аttached to him that\nthe somewhat tragic ending is quite sad.As his previous movie Mr\nDarabont creates yet another fantastic film sure to stay in your heart\nfor a while.Steven King should be proud.\n"},
{"review": "\nNever have I been this angry with a movie. Never, and except for 'The\n51st State' this is by far the worst I've ever seen. Of course, you\ncan't question or criticize the standard of this production - it's\ndefinitely an a-movie if you were to look at the amount of money put\ninto it, but that's really not the point. It wouldn't be the first time\na studio put a couple of millions too many into an easily sold, and too\neasily chewed, heart breaking story.<br><br>And yeah, the story is so hilarious, I'm not going to comment on it\nmuch further, but it contains \"the narrator\", \"the hero\", \"the one that\nbrings the story forward\", \"the good\", \"the bad\", \"the funny\" and \"the\nunbeliever that becomes a believer\". Nothing new beneath the sun, only\npoorly executed re-runs of ideals belonging in the 19th century. When\nit finally reaches the not very surprising end, we are supposed to be\ncrying our guts out. If we are, we have been had by the studio, falling\nfor all the oldest tricks in the book.<br><br>'The Green Mile' is in short one of those films that are glowing in\ntheir very contempt and low thoughts of the viewer. Every clishé, and\nno artistic thought, has been put into it. It really is as if Darabont\nis mocking us with it. Doesn't he think more of us than an ignorant,\neasily entertained, and easily moved, mob? Is he kidding?<br><br>The only thing I can say that is at least a bit positive about 'The\nGreen Mile' is Graham Greene. Had it not been for him, my 2 would have\nbeen a 1.\n"},
{"review": "\nThis movie does not hold up as well as people thought it would. Coming\nout the same year as some of the 90s greatest such as Fight Club,\nMatrix, and American Beauty it gets nominated for 4 Oscars because of\nits sappy plot and religious viewpoint. It is overrated and frankly,\nway longer than needed. On top of this, the plot isn't even revealed\nuntil an hour into a three hour movie leaving plenty time for boring\nsub-plots that makes you realize when the writer ran out of ideas. This\nis not to say that there are not elements that are enjoyable, but i\npersonally believe it is not worth sitting through 2 hours and\nforty-five minutes to see fifteen minutes of brilliant filmmaking.\n"},
{"review": "\nIn my \"Powder\" review I mentioned the similarities between this movie\nand Powder where the latter was even written years before this one was\nreleased. If you see both movies you will know what I am talking about.\nThe most charming scenes in the Green Mile are taken from Powder. I am\nsure that all who watched both remembers quite well the scene where\nPowder makes the guy who hunts the deer feels the pain of the animal.\nExactly same scene when Michael Duncan makes the guy who kills the\nmouse feel its pain. Another similar scene or idea is when Michael\nDuncan in the \"Green Mile\" heals James Cromwel's ill wife which is\ntaken from Powder who helps the Sheriff's wife to deal with her dying\nprocess.<br><br>I am not saying that the \"Green Mile\" is not a good movie. On the\ncontrary, I enjoyed it a lot but Powder is a decent one and was made\nway before the Green Mile so it deserves to be praised being the\noriginal at least.\n"},
{"review": "\n\nI saw this film the other day and expected a lot, great cast, director\nwith a\ngood track record but I was very disappointed. The green mile does cut it\nlike shawshank and the story really doesn't stand up.\nI would only recommend this to someone if I wanted to take their\ngirlfriend\nout while they sat in and watched it.\n"},
{"review": "\n\nI thought the book was great, until I saw the movie.Movies made from books\nvery well suck, they leave out so much fine details and meat and potatoes\nabout the storyline but, this one really did justice to the book and\nbrought\nthe characters really too life Hanks was at his best and newcomers was also\ngood I recommend reading the book.   Stephen King is a very bad boy can you\nspot him in the movie?\n"},
{"review": "\n\nWhen I was going to rent THE GREEN MILE, I was doubting that I would like\nit\nbecause of the idea that the story couldn't be that realistic. A man with\nspecial powers in death row didn't sound that exciting and I thought to\nmyself, how could the Oscars nominate a picture with that kind of storyline\nthat lasted three hours long? When I watched it, my whole attitude\nchanged.<br><br>Frank Darabont's vision of THE GREEN MILE is amazing in everyway. It is so\ntouching. Children to elders will hang on to the very end to see what\nhappens. We see what it is like to live in the south, in the depression, in\na death row prison. Tom Hanks leads an outstanding cast including Academy\nAward nominee Michael Clarke Duncan as the gentle giant John Coffey, like\nthe drink only not spelt the same.<br><br>The makeup in this picture is just as amazing. I am surprised that Oscar\noverlooked THE GREEN MILE there. The picture is inspirational and\nmarvelous.\nIt's competition for Best Picture though are much better films. THE GREEN\nMILE I feel is even better than Frank Darabont's \"The Shawshank\nRedemption.\"\nA great film!\n"},
{"review": "\n\nI saw this in a Corpus Christi hotel room a couple of months ago. what a\nwonderful movie. I loved everything about it and \nespecially thought that the Wild Bill character was hilarious. not as good\nas Shawshank Redemption but still pretty cool. I recommend this movie to\nanyone who believes in miracles.<br><br>9/10 - great performance by Duncan\n"},
{"review": "\n\nWhether it is fair to compare this film with \"The Shawshank Redemption\" is\na\nquestion up for debate.  However, since there is no decision on that topic\nI\nam going to make the comparison.  \"The Green Mile\" is a long way from \"The\nShawshank Redemption\".  This film deals with a massive death row inmate in\n1935 Louisiana played by Michael Clarke Duncan (in an Oscar nominated\nperformance) who is charged with the murders of two small girls.  It is\nclear from the start that this man is not evil or dangerous at all, in fact\nhe is blessed with the power to heal.  The supernatural aspect of this\nmovie\nturned me off almost immediately.  It seemed that writer-producer-director\nFrank Darabont was going for something between \"The Shawshank Redemption\"\nand one of Stephen King's other novels that dealt with supernatural\nphenomena.  The result is a film that is uneven in many respects, in spite\nof the fact that it is very well made.  Tom Hanks does nothing to help out\nthe problem as he gives his weakest performance in years.  William Sadler\nand Gary Sinise have such little screen time that one barely even notices\nthem.  Everyone else just seems to be along for the ride.  Duncan is the\nrevelation.  He keeps a questionable screenplay above water and holds the\naudience's attention for most of the 3 hours and 7 minutes.  That's another\ndrawback, this film is way too long.  I think that 30 minutes could have\nbeen deleted and the end product would have still been the same.  A very\nconsiderate 4 out of 5 stars.    \n"},
{"review": "\n\nThis is a good film, primarily because of Tom Hanks' subtle ability to\nportray a man who is tough, hard, and duty conscious, and at the same time\ncompassionate and human. This character reminded me of Hanks' portrayal of\nCapt. Miller in Saving Private Ryan. A few scenes are grisly, but the tone\nof the film is generally positive, and several scenes are surprisingly\nmoving. The supernatural powers of one character stood out strangely in a\nfilm that otherwise seemed to be dedicated to harsh reality, but I suspect\nthat was intentional, for contrast, and it worked.<br><br>One detraction was that I had a nagging suspicion that Hollywood was once\nagain taking an opportunity to promote it's sociopolitical views, on capital\npunishment, race, and regionalism, but maybe I have become over-sensitive to\nthis issue. At least they did not bash Richard Nixon, but then, it was set\nin the 1930's.<br><br>Compared to American Beauty, this was a better film. I gave it a 9 out of\n10.\n"},
{"review": "\n\nThis movie was spectacular!!  I was watching it intently from beginning to\nend and did not even notice the time.  This movie is a true masterpiece. \nTom Hanks and Michael Clarke Duncan were wonderful and the supporting cast\nwas fantastic.<br><br>Based on a serial novel by Stephen King, the Green Mile is about Paul\nEdgecomb, a officer in charge of prisoners on death row and everything was\nthe same as usual until the day that John Coffey (Clarke Duncan) was brought\nto the mile.  Coffey is an extraordinary person and Paul Edgecomb never\nbelieved in miracles until the day he met one.  <br><br>This movie is one of the best adaptations of a Stephen King novel that I\nhave ever seen.  I think that I would recommend this movie to everyone, and\neven if you don't like King's work I am certain that you will love this\nflick.  This movie was robbed at the Academy Awards, but never the less, it\nis still one of the most memorable movies I have ever seen.  A small warning\nthough, if you are a bit squeemish then you may need to hide your eyes for a\nfew scenes, but don't miss out on this movie because of it.  I give this\nmovie a 9.5 out of 10!!!\n"},
{"review": "\n\nOur Warner Cinema is 45 minutes away and I spent the whole time on the way\nback trying to fault this film, and I couldn't think of anything.<br><br>I read the book when it came out and that too was excellent, prior to\nseeing\nthe film I couldn't think of how they could do some of the stuff in the\nbook\nwithout it being cheesy, so I assumed they would change a lot of it, but\nthey didn't and it is one of the best adaptions of a book I have yet seen,\nalong with The Shawshank Redemption.\n"},
{"review": "\n\nWell to start off this is the first movie that I went to and I turned\naround\nto find my fellow bored moviegoers snoring.Michael Clarke Duncan played the\nstereotypical dumb,subservient,and country black man.Tom Hanks played the\nliberal white savior.This movie was the most outrageous and ridiculous\nmovie\nI have seen in my entire life.I went with my aunt and her boyfriend and a\nhour into the movie they were sleep\nit seemed as if the rest of the theater was!!I was speechless as I left\nbecause I could not believe this garbarage.This is must\nmiss.\n"},
{"review": "\n\nThis is clearly a well-made movie, with good intentions, but it's easily an\nhour too long.  You could actually read most of the book in three hours. \nAnd with the ample lighting provided by people checking their Indiglo\nWatches, you could actually do it in the theatre.  If there were more to\nuncover about the characters in the story, I might have better tolerated the\nlength.  But I don't know any more about these people than I did in the\nfirst 15 seconds in which they were introduced.  They are either Very Good,\nor Very, Very, Insanely, Ridiculously Bad.  Admittedly, Stephen King has\nnever been the master of character depth, but he has never been this\npredictable.  You don't need to go farther than John Coffey's initials to\ntell you what's going to happen to him.   Props to Michael Duncan and\nMichael Jeter for powerful commitment to their one-dimensional\nroles.\n\n"},
{"review": "\n\nAfter waiting for the green mile to come out, I saw this right away, having\nhigh hopes because the director was Frank Darabont. But it fell short just\nlike a largely anticipated \"The Matrix\" (you can see my review) i think this\nwas made mainly for the hope of getting an award(s).And talk about forced\nacting all except Tom Hanks he was an acception. Please feel free to E-mail\nwith any questions or concerns in regard to any movie.\n"},
{"review": "\n\nThe Green Mile made me think about very real things in life<br><br>although its story goes into the realm of fantasy. What this<br><br>movie succeeds in is to make the fantasy work for the questions<br><br>it is posing. What makes this movie great is that it involves<br><br>you with its story and leaves you with a lot to think about...<br><br>this makes a good m\n"},
{"review": "\n\nCapital punishment still remains as controversial issues although still\nsome\ninnocent people go to death row and bad people walkout fine. And someone\nwho\nis watching the ball s**t as a witness can't do anything about it but\ncomfort the prisoners until the final day. But watching actual electric\nchair execution is whole different story. Disregards of intensity of\ncrimes\nhe did, no guards can watch him being fried from the chair. That's why\nmany\nguards are nice to prisoners in death row because sooner than later the\nprisoners will face worst treatment ever. In this movie, I can see guards\nand prisoners bond with friendship behinds the strict rules. Well, there\nare\nass-guards in this movie and so there are full of revenges here and there\nin\nthis movie.<br><br>One last thought, Tom Hanks distinctive facial and voice expression fits\nvery well in movies such as \"Forrest Gump, Philadelphia, Turner &amp; Hooch\"\nwhere he plays with black characters as partners. It is fact that there\nare\nplenty of racial conflicts going around and perhaps this movies (where he\nis\nin) can lighten up people.\n"},
{"review": "\n\nI was not surprised from what to expect from this movie.Having  seen\nDarabont again,i new the result would accomplish my expectations.The film\nwas tender full of hidden messages and all the actors have given the best\nabilities to the roles.The biggest surprise was Michael Duncan's role as\nJohn Coffey, and i think he deserves the second role academy award this\nyear.As for Mr Tom Hanks, the only comment is that all his latest works\nhave\nall won an Oscar nomination!\nGo see the movie.It will speak to your heart,and make you understand the\nmagic of acting and creating characters.\nMovie is not just about directing and creating effects all the time.Acting\nis having the most significant part and this movie is a total pleasure!\n\n"},
{"review": "\n\nIronically, although the 3-hour length of this film flew by for me\n(inclusive of time taken to change discs), I didn't really enjoy it that\nmuch. None of the characters were really outstanding, and the plot seemed\nlike a long X-files episode.\nThis film did not tackle the anguish of death row that well - \"Dead Man\nWalking\" (of which we are reminded early on in the scene when Percy is\nwalking John to his cell) did a much better job of it. Neither is it a\nshowcase the triumph of the human spirit over adversity - \"The Shawshank\nRedemption\", another Frank Darabont film has that honour.\nI'd conclude that it's a watchable film, but not deserving of 3 hours of\none's time. I'm glad I only spent 10 Ringgit for the video\nCD.\n"},
{"review": "\n\nThis is an excellent adaptation of a novel, far better than most\nadaptations. I've been to see it 4 times (I'm not usually that type) and\neach time the audience is larger and more expressive. Full burst of\napplause\nat the end, as at a play. Too bad there's no curtain call, because everyone\nis great. This movie, I'm afraid, is going to get ripped off at the Oscars.\nI've seen many excellent movies this year, but this is the\nbest.<br><br>Watch for the little things. ([1] I think the last line of the movie is an\n\"in\" joke. [2] Del assumes a Jesus-crucified position as his mouse runs\nacross his shoulders. [3] John refers to God specifically as \"God the\nFather\"; there is more than a hint that he himself represents the Son,\nwhose\ninitials {and, in some cases, abilities} he shares. [4] Check out the names\non the tombstones at Elaine's funeral. [5] Old Paul's teacup is one of a\nset\nthat he and his wife had in the 30s. [6] Melinda gives John a St.\nChristopher medal; St. Christopher is supposed to have carried Christ to\nsafety once. [7] Hammersmith, an unsympathetic observer of the early part\nof\nJohn's ordeal, has a name that suggests preparation for crucifixion. No\ndoubt there's more!)\n"},
{"review": "\n\nThe Green Mile caught me by surprise.  Being that The Shawshank Redemption\nis one of my all-time favorite films, I went into this film expecting an\nattempt to capitalize on \"Shawshank\".  Man, was I wrong.  Aside from the\nprison settings, these two films could never be confused with one another. \nWhile Shawshank is about the triumph of the human spirit, The Green Mile is\nmore about who we are at our core.  Are we good or evil?  Can we change who\nwe are?  Why are bad things allowed to happen?  There are some imbedded\nreferences to Christ, even symbolized in John Coffey, where we see the\nsacrifice of His dying for our sins.  The cynics out there may choose to\nsmirk at these actions, but I think that they would be making a knee-jerk\nmistake.  This film makes no judgements about us as a society or any such\nnonsense, but rather tries to make us look at ourselves, individually, and\nhow we relate to the rest of the world.<br><br>Hanks does his best work in a few years.  Michael Duncan and David Morse, I\nthink, are the most compelling, however.  I've heard criticism that the film\nis \"too long,\"  I don't really know how to repond to that argument other\nthan to ask the person if they came to that conclusion before having seen\nthe film.  If a film grabs and interests you, then holds that attention,\nthen there is no way one should be able to make that claim about The Green\nMile.  It is the length it should be and needed to be.  I enjoyed it\nimmensely and will put in in my top ten for the year.<br><br>One last note to the cynics among us:  cynicism does not automatically make\none smart or thoughtful.  In fact, it can be a good thing.  I only say that\nto remind you that just because a film, book, song, or event is about\nsomething \"good\" does not automatically make it bad or\nuntrue.\n"},
{"review": "\n\nUsed the same idea as in Ellen Burstin's Resurrection, i.e. someone with\nthe\npower to cure.  Both movies had imaginative endings that were highly\nsatisfying both emotionally and intellectually.   Resurrection has the best\nending to any movie I have ever seen so Green Mile is in good\ncompany\n"},
{"review": "\n\nWhat can I say?  Frank Darabont is a cinematic genius.  Every shot was\nwell\nthought out, perfectly timed, and beautiful to watch.  As the story starts\nto unfold, we learn what each character is about, and we see them grow\nalong\nwith the story.  I don't think I stopped crying for the last 20-30 minutes\nof the film due to the amazing performances of everyone in the cast.\nMichael Duncan Clarke was superb and Tom Hanks delivers another great\nperformance.  I admit I never read the novel,'The Green Mile' and have\nnever\nreally liked many \"Stephen King\" based movies.  I loved this one as much\nas\n'The Shawshank Redemption'.  When I left the theatre at the end of the 3\nhour film, all it's images, characters, and ideals went with me.  I really\nfeel that Frank Darabont finally deserves his Oscar for both best director\nand best film.\n"},
{"review": "\n\nAs I reflect on the film, I keep coming back to one basic thought. It is\nthe\nthought that struck me about 20 minutes in: This is a film that has been\nperfectly cast.<br><br>It has been four days since I last saw Darabont and Tattersall's The Green\nMile and it still hasn't quite all sunk in. I had read Stephen King's\nserials while recovering from back surgery. The week before surgery, my\ngirlfriend told me that the people who made Shawshank Redemption were\nadapting another King story and that it would star Tom Hanks and that big\nguy from Armageddon. So, finding myself confined to my bed, I started\nreading. I was finished within a day.<br><br>I like delude myself a little. I like to think I know a few things about\nfilm and I could be a director, you know? When I read good stories, I like\nto picture which actors would be good for which parts. It was the casting\nof\nJames Cromwell as The Warden that iced the cake for me. That was one I\ndidn't expect. I thought he would be playing Irish Police Chiefs until he\nkeeled over. Not that playing a southern Prison Warden is casting against\ntype exactly, but he still puts in a nice performance. As does everyone in\nthe film. This must have been a fun film to make.<br><br>The only thing that I didn't like about the film was that it explained too\nmuch to the audience. So much can be said with just shot sequence and\ngesture. Sometimes dialogue gets in the way of things that can't be\ncommunicated with speech.<br><br>Still, I cried like Nancy Karrigan.  \n"},
{"review": "\n\nThe movie I've waited all year to see.  It was worth it, as\nthe\nscreen vividly brought to life Stephen King's endearing and memorable\ncharacters.<br><br>The Green Mile is a faithful adaptation of the serial novel.  It moved\nright\nalong and completely held my interest even though it's 3 hours long.\nActually, it could even stand to be a bit longer and go into more detail\nabout the condemned inmates themselves and Paul Edgecombe's investigation\ninto Coffey's defense (or lack thereof).<br><br>Brilliant performances by Hanks and Duncan.  I was especially wowed by Sam\nRockwell's intensity as \"Wild Bill\".  The only flaw was not enough Gary\nSinise!<br><br>I can't wait for it to come out on DVD (perhaps in an expanded Director's\nCut), but meanwhile I may have to see it a couple more times in the\ntheater.\n"},
{"review": "\nThe Green Mile is a masterwork. This is film as art, at it's very best.\nThe depth of the cast is extraordinary, with all of the players\ndelivering excellent performances. There is a clear sense here that all\ninvolved in the production knew that this was something special, and\ngave it their all. See this film if you truly enjoy actors giving\neverything to their craft. Watch for the countless subtleties of\nexpression, and the great power that the cast creates with silence.\nThis is evident in the opening sequence and remains throughout. Above\nall, Michael Duncan as John Coffey is exceptional. He brings gripping\nemotion to a unique, fascinating character.<br><br>The Green Mile should bring you joy, laughter, and if you are like most\nin the theater this night, tears.\n"},
{"review": "\nI believe I'm one of the few human beings that had no idea of what is\nmovie was about. I heard a lot about this picture, of course, but I\ndidn't even know what the main story was. Maybe it's a plus, since it\nallowed me to see the entire thing without knowing what was gonna\nhappen next. Well, like other death row movies, this one really touched\nme; ending with people lives, despite what they've done, is a sad\nsubject for me. It must be the most terrifying feeling to know you're\ngoing to be killed in a matter of minutes. Preparing yourself for the\nelectric chair might be even worse. As a thrilling Stephen King's\nstory, \"The Green Mile\" brings an innovation-- this time, a character\nhas a special gift of healing people, like a saint. It is indeed\nbeautiful to see that big and apparently bad guy helping people as he\ncan. Filmmakers are mean in this case-- they make you adore the\ncharacter, just to kill him in the end and let you down. It happened to\nme as well, I cried in the end and it is not a common thing for me-- so\nby that you can imagine how strong this movie is. A masterpiece in\nmatter of acting, story and life.\n"},
{"review": "\nThe Green Mile is my favorite movie! It was a complete roller coaster\nride of emotions that made me cry. The end was the saddest when Michael\nClarke Duncan's character is put on the chair although we know he is\ninnocent and it was the crazy man locked up. I also thought it was so\nsad when they were watching the last movie that the prisoner got to\nwatch before he died, and then Tom Hanks's character started to cry! I\nalso loved how even though the prisoner was huge, he had a heart of\ngold, and he actually appeared cute and innocent to me during the whole\nmovie. The only con of the movie was it took me a little bit to\nunderstand the murder of the little kids that was committed by the\ninsane man in the movie. I also loved when the old Tom Hanks showed the\nold lady that he was telling the story to the mouse that was still\nalive. The amazing thing was i had watched this movie right after\nseeing Forrest Gump and I was worried that I wasn't going to be able to\ntake Tom Hanks seriously, but I could! It just proves how amazing an\nactor Tom Hanks is.\n"},
{"review": "\nI must say, this is one of the best movies in the world. But why? I am\ngonna tell you why, it is one of the greatest movies of all time\nbecause: <br><br>*Good and well written story. An interesting storyline that is\nentertaining all the way to the end.<br><br>*From book to movie with a great result. The novel is written by\nStephen King and the movie was created in almost the same, good result.\nBut I recommend you too read the book.<br><br>*Good acting and well played roles by the characters. Tom Hanks does a\ngreat job in the movie.<br><br>*Sadness and Goodness that touches your soul.<br><br>*Almost all kinds of movie lovers will like the movie. It doesn't\nmatter what kind of movies your most into, this movie will entertain\nyou.\n"},
{"review": "\nIt's not everyday that a movie is able to change an audiences opinion\non something. \"The Green Mile\" is a movie that made me think long and\nhard about supporting the death penalty. The film, based on a novel by\nStephen King, contains such a variety of emotional events that it\nrepels its audience away from its subject rather than glamorizing it.\nOnly a handful of recent productions have been capable of such power.\n\"The Green Mile\" is truly one of the best films this year and is Oscar\nWorthy in many categories. It is a unique, three hour experience that\nmust be seen to believe. \"The Green Mile\" contains so many vivid\nperformances, I will not be able to honor everyone who deserves credit\nin my review. Michael Jeter, Gary Sinise, Doug Hutchison, James\nCromwell, Bonnie Hunt, and David Morse are all superior in strength of\ntheir characters. Each contributes Oscar worthy performances, and if\nthe Academy leaves these individuals out at Award time, they need to\nrecheck their databases. Michael Clarke Duncan recently received a\nGolden Globe nomination for his supporting role, and he deserves it.\nTom Hanks is just unspeakably brilliant in the leading role. He is\nright behind Kevin Spacey from \"American Beauty\" in the best\nperformance of 1999.\n"},
{"review": "\nHad been long waiting to see this movie. At last when it happened, it\nwas really worth the wait. One of the few beautiful movies i have seen.\nHanks comes up with yet again splendid performance and adds crisp to\nthe good cast. Particularly Michael Clarke Duncan as John Coffey, WOW\nwhat to say!! He, his size, his innocence surely cant go\nunnoticed.Every scene creates a sort of expectation on whats going to\nhappen next. n satisfies them pretty nicely too. It makes a good watch.\nIt may not b a feel good movie.. but definitely makes u think a lot\nabout humanity and human values. I am waiting to read the book from\nwhich it has been adapted\n"},
{"review": "\n\nI was at one point a great fan of Stephen King. I still list a couple of\nhis\nworks among my favorites, this one among them. The book, though marketed\nby\na gimmicky (but fun) serialization, wove together a complicated story in\ntwo\ntimelines. The prison story of John Coffey was a book within a book, and\nwas\ncarefully intertwined with the 1990s present of Paul Edgecomb(Tom Hanks).<br><br>The most grievous failing of this adaptation was the neglect of the way\nthe\ntimelines merged for Paul Edgecomb. Instead of this carefully intertwined\nstory, viewers get a sappy version of the 1930s storyline, with a brief\nnod\nat the 1990s tale. While interesting in and of itself, the focus of the\nscreenplay on the 1930s timeline left me annoyed at the piece of the\npuzzle\nthat seemed left out to me.<br><br>In addition, I feel that Tom Hanks was probably not the best choice for\nPaul\nEdgecomb. Even in this serious roll, he gives off his own aura,\nconstantly\nreminding me that he is Tom Hanks, not Paul Edgecomb.<br><br>Finally, the ending of the movie adaptation is lacking. The book's ending\nleft me feeling the deep despair of the aged Paul Edgecomb. The movie\njust\nleft me feeling annoyed.<br><br>\n"},
{"review": "\n\nThis is one of the best films I have seen! It really made me cry, because\nit\nwas the way the characters were portrayed made it very good. The acting was\ngreat, and it was really good how they made the executions looked\nrealistic.<br><br>Even though the film was three hours long, I was able to sit through it\nbecause you wanted to find out what happened.\n"},
{"review": "\n\nThis was a good- not great- movie. The sad part is that if it wasn't so\ndrawn out, it would have been much better. The acting- particularly Tom\nHanks and Michael Clarke Duncan- was tremendous. However, the other\ncharacters really aren't fleshed out well at all, which is really bad in a\nthree hour plus long movie. \"Shawshank\" it ain't.\n"},
{"review": "\n\nThere are a number of standout performances in THE GREEN MILE, particularly\nby Michael Clark Duncan.  As the spiritual center and Christ figure of the\nstory, Duncan is superb.  There are so many things to like about this movie\n(it is an effective and moving indictment of the death penalty) that it is\nsad to see it undone by a plot absurdity.<br><br>Any story that depends on supernatural elements requires that the audience\nsuspend disbelief.  However, accepting supernatural elements demands\nconsistency and logic in the other supernatural elements.<br><br>(Spoiler)<br><br>In this movie, Coffey's talent as a healer becomes known to the guards and\nthe warden.  Near the end of the movie, Coffey is able to pass on a\nmemory/image of the person who actually committed the crime he was convicted\nof to the guard/narrator (Tom Hanks).  Although Coffey is clearly innocent,\nwe are told that nothing can be done to save him.  This is totally absurd. \nIn the real world, where there is no evidence for actual spiritual or\npsychic healing, practicianers (or charlatans) enjoy fantastic success.  If\nthere were a REAL healer, who could also transfer images from the minds of\nkillers to other people, then publicizing his talent would be a trivial\nexercise.  We already know that officials came to the prison to see a mouse\nperform -- why wouldn't people come to see a genuine healer?  Finding\npowerful supporters who would argue for clemency would be the next logical\nstep.  In essence, the momentum of the movie is to kill Coffey since he is a\nChrist-figure, and the plot is the ultimate casualty.<br><br>Trying to paper over the hole with the idea that Coffey was ready to lay\ndown the burden of empathizing all of the world's pain and embrace death\njust didn't work and felt condescending.<br><br>Rating: 5 = Performances (8) - plot hole (3)\n"},
{"review": "\n\nAt some point, not far enough into the movie, it was pretty clear to me what\nthe outcome would be.  Maybe it was just me, but after the ending was clear\nto me, the movie just seemed to drone on, and dramatize on.  It seemed\ndetermined to take the long way around to the ending.<br><br>Maybe I'm just unfortunate in having my idea of how it would end up be\nexactly what happened.  To me, it seemed like a lot of attempts to dramatize\na thin plot, and put touches on it to make it seem profound.  Apparently, it\nworked for many people, unfortunately not for me.\n\n"},
{"review": "\n\nWell I must say that I was very disappointed with this one. It´s one of the\nworst \"Stephen King\" movies. The questions I asked myself that you never got\nan answer to was\n-Who is the black man, is he god or something else? Why did he sit there\nwith the two little sisters? where did he come from, and that kind of stuff.\nBut you never got the answer, and that is strange cause you usually get\nanswers in \"stephen king\" movies. So that was a big disappointment.\nOtherwise it was kinda boring nothing really funny never happened. Just like\nthe same thing over and over...but the ending made it a bit better\nthough...give it like a 6.5/10  \n"},
{"review": "\n\nStephen King truly is a brilliant storyteller. This is another of his\nnovels\n(but the first 6-parter) to be made into an instantly classic film.\nFeaturing rich, gripping performances by David Morse, Michael Duncan, Doug\nHutchison, and of course Tom Hanks, this movie presents the human struggles\nwith good and evil, justice and law, and our ultimate fate.  Kings story\ntelling juxtaposes often gruesomely terrible events with the true goodness\nof the human soul.  Because he is never afraid to present the audience\nhorrific images of the evil potential of man, his examples of goodness and\nlove shine through even brighter.\n"},
{"review": "\n\nThe Green Mile contains the best ensemble of actors.  In any film with Hanks\nit would be easy to lose the other actors in such a huge shadow, but\neveryone shines with equal brilliance.  All the characters are believable.\nThe script is absolutely amazing and spreads the mezmerizing dialogue around\nvery democratically.  Also, that mouse deserves some kudos for performing so\nwell.  The Green Mile is the best movie I have seen this year, and while\nsitting for three hours seems to be an awfully large commitment on behalf of\nthe viewer, not a minute of it is ill-spent.\n"},
{"review": "\nTruly a wonderful picture. I agree with what most people on here are\nsaying: this film, along with Shawshank define great American cinema.\nBoth pictures are ingenious in their conception -kudos to master writer\nStephen King - and really spark more than just entertainment. This is\nnot ars gratia artis, art for arts sake; it's art for the sake of\nhumanity; for portraying brilliant stories that center around human\ninteractions in the most inhuman of places. If anyone stumbles on this\nreview, understand that there are few similarly heart-wrenching films\nout there. Others have pointed out more, and I agree. But these stand\nout among the rest, and that is indisputable.<br><br>If you are a film enthusiast that has not seen these films, or if you\nare just looking for a great flick, look no further. Definitely rent or\nbuy these films for they are pearls of American cinema.<br><br>Enjoy!\n"},
{"review": "\nFrank Darabont, the extraordinary director of the hit \"Shawshank\nRedemption\", comes back to the big screen with yet another adaptation\nof another prison drama novel by Stephen King. This time, the story is\n\"The Green Mile\", and this time he has the help of Tom Hanks and\nMichael Clarke Duncan joining a powerful cast that also includes Bonnie\nHunt, Michael Jeter, and Sam Rockwell. The movie stars Hanks as Paul\nEdgecomb, an officer on death row, with a serious bladder infection,\nwho rounds up a new suspect named John Coffey, portrayed by Michael\nClarke Duncan, a man with mysterious immortality powers, that may have\nbeen accused for the raping and killing of two innocent girls. The\nmovie follows as a dramatic and entertaining tale of hope, faith, and\ncourage. Darabont brings back the lucky charm used in \"Shawshank\", but\nthis time he combines real life with fantasy, and creates a story of\nmiracles and dreams. Anyways, the film has powerful backgrounds, and\nthe film focuses on the story with lots of drama and thrills, and the\nscript is more well-written since Shawshank was well-written. The\nspecial effects are amazingly realistic, and the story is like a\nspecial charm from the heart. I really enjoyed this film, and it's fun\nto watch it again and again. You will enjoy it so much, you will start\nto wonder where the 3-hour running time has gone. \"The Green Mile\", in\nmy review, \"an exhilarating prison drama, truly watchable\".\n"},
{"review": "\n\nThe Green Mile, as you already must know if you're here, is a story about\nBlack Jesus (hey! I thought that was Everlast! =D), aka John Coffey (JC -\nget the hint? Well, the rest of the movie is even less subtle) played by\nMichael Clarke Duncan and everyman-type White Pontius Pilate (Paul Edgecomb\nhere - surprising it's not Paul Pedgecomb) Tom Hanks - whose distinguishing\nfeature, unfortunately for all of us is a often-showcased urinary infection\n(couldn't they make it like a sore shoulder or something?). As for the\nstory, you pretty much already guessed it - you've heard of the Bible,\nright?<br><br>Okay, you know that already, we established. You probably also know that Tom\nHanks is a great actor. David Morse also is in a creepy way. Michael Clarke\nDuncan isn't, unfortunately. But Hey, I guess if the script calls for a\ngiant, your choices are pretty limited?<br><br>But all in all, the cast is good, and the interplay between them is also\nvery good. That is not the problem.<br><br>Well, then, you may ask, what is? Is there even one? Sorry to disappoint\neveryone, but, yes, there is - or are - two, in fact.<br><br>One: I didn't think it was at all possible but this movie manages to me more\nover-dramatic self-important and pompous than Frank Darabont's previous\neffort - that way-overrated #2 movie in the world for-some-bizarre-inexplicable-reason\nShawshank Redemption.<br><br>Two: The Length. 3 hours plus. To me, that's just unnecessary. I mean yes,\nif a movie is good you don't really care how long it is, but when it's\nborderline like this movie is, that just goes to annoy you, the\nviewer.<br><br>A side note - this movie scores the third greatest last line in movie\nhistory with the (I hope intentionally) bittersweetly too-true \"Sometimes\nthe green mile can be so long.\"  Good point, Tom, but actually, it always is\n- no matter how you watch it it still takes 188 minutes every\ntime.<br><br>Overall, I'll give it a 5 out of the 10\n"},
{"review": "\n\nOk I have no idea why this movie is so popular it's very unoriginal and\npointless! everybody in the movie did a good job but the plot sucked, it\nwasn't original and it had no point. I think this movie has the worst ending\nof all time simply because it has no point, do not see this movie it's 3\nhours long and you'll want your 3 hours back!\n"},
{"review": "\n\nThis has got to be one of the most overrated movies of all time.  It didn't\nsuck really bad, IMO, but was just plain average - and on the boring side of\nthat.  I didn't find it very emotionally moving, and I thought it was quite\n\"cheesy\".  I didn't get really involved and enveloped into the movie as one\nwould when watching a truly great film, and I even say this in a nice big\ntheatre too.  This movie just didn't turn my crank, it was very predictable,\nwas not very thought provoking, and I'm very surprised there aren't more\nmixed reviews at least from the users of this site...<br><br>The Green Mile is NOWHERE CLOSE to The Shawshank Redemption, and shouldn't\neven be mentioned in the same sentence as an emotionally powerful\nmasterpiece such as that.  Granted that neither film is meant to appeal to\nyour intellectual side, but more to your emotions - this film even fails at\nthat, in my opinion.  Perhaps I just couldn't get into it because it was too\ncheesy...<br><br>Overall, this was a disappointing film, and I know I'm not the only one who\nthinks that as well.  Based on people I've spoken with, this film should\nhave more mixed reviews rather than the overwhelming praise it seems to have\ngot.\n\n"},
{"review": "\n\n\"The Green Mile\" tries hard to be a nice movie, to steer your emotions, to\nfeel along. Etc. Everybody who is nice simply is nice, character depth is\nsecondary. What completely ridicules the entire thing is the influence of\nfantasy elements to enlighten the atmosphere. Not only is everybody nice,\nbut heah, with some special abilities they are even nicer!<br><br>Technically the movie is of course well done. Camera, lights, everything is\nin the green. Unfortunately that doesn't make a good movie, when characters\nare simply created to fulfill general expectations. Although this simply\nseems to be a routine production to appeal to mass audiences, anyway, and of\ncourse it hits right on the target. That Hanks was in for a role here is\nunderstandable - his main aim nowaday seems to be building up his reputation\nwith the Academy. For Duncan the decision was probably more difficult, he\ngot to play the usual part of the black country guy. But a chance to get a\nrole in a \"made to please the academy\" film is a hard thing to refuse, esp.\nwhen your co-star is Hanks and a name like Stephen King stands for the\nnovel.<br><br>It is much more reccomendable to watch \"Dead Man Walking\" for a good look on\nthe topic, but of course if you felt along with the characters in Cameron's\n\"Titanic\" this is your thing to go for.\n"},
{"review": "\nOne of the most moving films ever put on screen is director Frank\nDarabont's The Green Mile, a deep,tragic, and overall wonderful film\nthat teaches lessons, reaches into your heart, and leaves you taken off\nyour feet, and sad.<br><br>The Green Mile is told through the eyes of a prison guard named\nPaul(Tom Hanks) and a year he spent with John Coffey(Michael Clarke\nDuncan), a death row inmate who has miraculous powers. As the film goes\non, you get to know Coffey, and you love him, though, he's impossible\nto hate.<br><br>The Green Mile is one of the most heart wrenching films I have ever\nseen. Aside from its wonderful story, there are characters here that\nyou grow to love, such as Paul and John, but yet there are characters\nthat you really grow to hate, and that brings me to the unbelievably\nfantastic performances.<br><br>Aside from Duncan's marvelous Coffey, the best performance here is from\nDoug Hutchinson as Percy, the films most hatable character. He's not\nthe bad guy, but if you've seen this guy you wouldn't be surprised if\nhe was. Percy is an arrogant doushbag, and you really can't stand him.\nI hated him more than the film's actual villain(not going to reveal).<br><br>In 3 hours, Darabont focuses on the characters and the story lines,\nwhich I admire. These are some of the best 3 hours I have ever spent.\nAnd even though The Green Mile ends on such a sad note, I have to say\nthat I preferred it over The Shawshank Redemption. Sue me, I don't\ncare.<br><br>A\n"},
{"review": "\nI was coerced into sitting through \"The Green Mile\" the other evening\non video. Quite a watchable thriller, really, but left me very\nuncomfortable. I'm a white Englishman, but even for me the words \"Uncle\nTom\" were hovering in the air and refused to go away. OK, the plot\ndevice of the automatic assumption of guilt and wrongful arrest of the\nbig black guy only worked if he was black. But the - apparently\nsurprising - fact that he could be huge and black but still \"nice\" then\nseemed to be a central part of the plot.<br><br>The only thing this story reveals is the prejudice and bigotry of the\nwriter and his intended audience.\n"},
{"review": "\nI don't know, I rented this movie after hearing a lot of people\nclaiming it was so touching and all(including Britney Spears herself in\nan interview, damn you Britney!). They should've labeled this movie\n\"Based on something Stephen King has written\" so you know that prior to\nactually watching it. I'm not saying Mr. King is bad, it's just that\nit's very hard to make a touching movie out of a plot that is depending\non something that is so hard to believe in. It's just too unrealistic\nwith all the healing stuff, when the movie was over I just thought\n'Ok... so?'. I gave this movie a 6/10, if you want good Stephen King,\nwatch the Langoljeers (that what it's called?). If you want a touching\nmovie on the subject, watch Dead man walking. And if you just want a\ndamn good touching movie, go see American Beauty.\n"},
{"review": "\n\nOK. The movie starts all right. The acting is good. But my god, what a\nsentimental crap is this story! It seems to me the writers only thought of\njerking as much tears as possible. By making the big feller soooooo\ninnocent. And the bad guy soooooo bad. And they leave no stone unturned to\ntear your tears out, because when an audience weeps, the film must be\ngood.<br><br>Well, it isn't. YES, I wept. But it didn't feel good. Because it was SO\ncheap. When you hit me with a hammer on my toe, I weep as well. And this\nfilm was about as subtle as that. And so I felt emotionally raped by this\nmovie. I actually did.<br><br>PLEASE see the Shawshank redemption instead...\n"},
{"review": "\n   ***SPOILERS***   ***SPOILERS***\nI really don't understand how anyone with a critical sense can like such a\nfilm. I mean, I'm not a cynical person, but I truly can't stand\n100%-righteous characters such as Coffey, Hedgecomb and all the other nice\ndeath row wardens. I'm not a 5-year-old kid and I can't watch The Green\nMile\nwithout being sarcastic. How can any spectator accept the way this tall\nblack guy is playing? And what did Frank Darabont expect spectators to\nreact\nwatching his so unfair and unhappy fate? Did he want us to burst into\ntears?\nCome on! The Shawshank Redemption was shot a few years ago by the same\ndirector. It was a prison movie like this one but it was a good one for it\navoided too many melodramatic effects and because the characters played by\nTim Robbins and Morgan Freeman were above all human characters. Those\nplayed\nby Tom Hanks and every other cast member aren't humans. They are nothing\nbut\nall-American icons and I hate that. Besides the death penalty issue is the\nheart of the film. Does Darabont seriously tackle it? Never! In The Green\nMile, being legally executed appears to be something which has to be taken\nfor granted by every citizen, no matter if people die in some awful way\n(i.e. Eugène Delacroix, the guy with the lovely mouse), and no matter if\nan\ninnocent guy sometimes gets toasted. At the end of the film, old Hedgecomb\nconfesses that he couldn't stand executions anymore after Coffey died. So\nwhat did he decide to do? Did he organize public protests and\ndemonstrations\nagainst this punishment? No! He just left the penitentiary and found\nanother\njob. What a hero! What an activist! Sorry, everyone, but all this really\nsucks.\n"},
{"review": "\n\nTom Hanks seems to be obsessed with starring in movies that go for\nridiculous lengths of time. Once again I was bored out of my brains watching\nHanksy (who can act) work with nothing for 188 minutes. So much boredom, so\nmuch of my time wasted.<br><br>I don't mind a magical story as long as the characters who are portrayed as\nnormal humans react in such a manner. None of these characters did react\nrealistically which quickly turned the movie into not only a raving bore,\nbut an absolute farce as well.<br><br>I didn't altogether hate this movie, even though it was awful. If the small\npotential it possessed was condensed into a two hour flick then it may have\nkept me from yawning for 188 ridiculously long minutes.\n"},
{"review": "\n\n***** POSSIBLE SPOILERS ****** <br><br>Aw come on guys how can anyone vote this film into the IMDB top 250 ? First\nof all it features the most unconvincing prison officers in the history of\ncinema who are wetter than drowned fish , there`s no way these guys would\nget jobs as bleeding heart social workers never mind become guards on death\nrow . Secondly this film is just so predictable ( Which is why I warned of\npossible spoilers ) there`s no way the audience can be taken in that John\nCoffey is guilty of murdering a child , and likewise you just know that\nPercy ain`t gonna enjoy his pension . Thirdly am I alone in thinking Percy\ndidn`t deserve his fate ? He`s surrounded by murdering scum so what do I\ncare if he breaks inmates fingers and lets them suffer in the chair . At\nleast Percy acts in a believable way and consistent manner unlike his\ncolleagues Fourthly this film lasts more than 3 hours and there`s hardly any\nplot twists that saved THE SHAWSHANK REDEMPTION from accusations of being\noverlong <br><br>All in all a very overrated overlong film based on a very weak Stephen King\nstory . The fact that King`s original novellas were marketed through a\ngimmick says a lot about the uninteresting story . Is it any surprise that\nno one wants to adapt King novels for the big screen these days\n?\n"},
{"review": "\nits first virtue - profound grace. grace of acting and script, grace to\ntranslate Stephen King novel in a movie - travel in heart of things.\nits secret - great performance of each actor and unique way to give to\nhis character sweet light of real beauty by Michael Clarke Duncan.\nresult - gentle work, touching lesson about roots of miracle. in fact,\na pure Christian lesson without any desire to be more than a kind of\ntestimony about a special meeting. a film like shadow/frame of a\nfeeling, seed of emotions. not pink, not exaggerated, not a\ndemonstration. only occasion for few good actors to create air of a\nworld.\n"},
{"review": "\n\nA superb film adaptation of Stephen Kings work. Having read the book, I\nwas\nsomewhat cautious of wanting to see the film, as so many screen\nadaptations\nof books that i have read leave me disappointed.\nThis was not the case! ALl the nuances pertinant to the charecters were\nincluded. this has to be an all time classic.\n"},
{"review": "\n\nThe movie was simply poetry. Characters are so excellently portrayed, the\nstory is so touching you can't avoid thinking it is one of the best movies\nyou've never seen.\nTom Hanks acts at his best and David Morse proves to be a great actor as\nwell.\n"},
{"review": "\n\nTom Hanks looks more constipated than ever in the role of a virulent prison\nguard caught in the middle of a strange story about a giant man dropped from\nthe sky (!) and who have the power to rise from the dead people , this in a\ntotally funny and ridiculous way . \n  \nThe screenplay and direction is reduced to its most simplistic and academic\nform to not mislead the easygoing viewers, making THE GREEN MILE one of the\nmost linear movies I have ever seen , to such a degree that we can\nanticipate what's going to happen every next minute for over 3 atrocious\nhours long. \n  \nIt's a shame that Stephen King says its the best film ever made out of his\nnovels ; he didn't like Kubrick's adaptation of THE SHINING , and he seems\nto forget other good films such as CARRIE , STAND BY ME  and THE DEAD ZONE...\n  \n"},
{"review": "\n\nYet another brilliant King/Darabont collaboration in the same genre as The\nShawshank Redemption.  There is plenty for the outstanding but small cast to\nget their teeth into here and the screenplay is executed to perfection.  The\ncasting is spot on with Michael Clark Duncan and Sam Rockwell in particular\nputting on World-class performances.  Hanks was good too, as expected but I\nparticularly enjoyed Mr Jingles' performance !  <br><br>Great stuff, not a dry eye in the house.\n"},
{"review": "\n.. I'm always bemused by the \"user\" comments on IMDB.  They tell you as much\nabout the folks that make them as if you were in Group analysis with them\nfor months.\nCynicism, self-esteem problems, shallowness and self-centeredness are all\nrevealed.\nLet's address some:\n\"unbelievable plot (supernatural)\" DUH!  This IS a Stephen King\nstory!<br><br>\"I Knew the ending after...\"  once again, after you read a  few King novels,\nyou learn to see where he's going; it's HOW YOU GET THERE,\nDUMMY!<br><br>\"This movie scared me\"  voices of the Titmice that want to pretend and\nactually WISH that the world was full of Pollyanna's like themselves.  News:\nThere's a few budding Hitler's Stalin's, Amin's, that agree with you so they\ncan herd you lemmings into their own sea.<br><br>A film is a film, a movie a movie.. what's important is that it entertain,\namaze and instruct.  Green Mile does that.  It also helps you understand\npeople.. none are all good, none are all bad, but some come very close to\nthe edge.<br><br>Summary: If you liked \"A Clockwork Orange\", Any VanDamme movie, or \"The\nLetter\", you'll probably hate this.  Get my drift?\n"},
{"review": "\n\nThis movie was fantastic! It might remind you a little bit of the classic to\nkill a mockingbird, but this rather faithful adaptation of Stephen King's\nnovel left me breathless. It might be too long, but I didn't really mind.\nThe best parts were the performances turned in by Tom Hanks and Michael\nClark Duncan. The latter gave a terrific show. I recommend this\none!!!<br><br>*** 1/2 out of ****\n"},
{"review": "\n\nWow!  This movie was truly one of the very best I have ever seen for\nrunning\nthru one gamut of emotion and then doing a 180 degree into another!  Tom\nHanks is awsome and his supporting cast...well, they don't just\nsupport...they SHARE the responsibility for bringing a story that you\nwouldn't expect to get \"into\" but find yourself sitting right there on\nthat\nshiny green floor soaking up every BOLT!  Excuse the sophmoric wording of\nthis critique, but I just saw this movie and I really am still reeling\nfrom\nit!  Can't wait to see it with my daughter who cries during the credits of\n\"Beethoven's 2nd\"! \n"},
{"review": "\n<br><br>*Spoiler Alert*<br><br>I'm sorry, people- the best film ever made? Are you serious? Reading some\nof\nyour comments makes me believe I saw a completely different movie.<br><br>The first hour is great- a nice set up makes you want to love it, but as\nyou're hoping for a sensible ending you slowly realize there won't be one.\nThe problem is not the acting or direction, it's all brilliant. Tom Hanks\nand Michael Clarke Duncan make this film worth watching, but when Duncan\nsucks a tumor the size of a lemon out of some woman, and blows it out in\nthe\nform of thousands of whasps (which can make a man kill, of course) I\ncouldn't help but laugh. And many with me.<br><br>From the moment Duncan's divine ability becomes clear the film descends\ninto\nslow, overly predictable bollocks. After a very atmospheric first hour,\nevery scene that followed could be predicted from a mile away. What made\nshawshank so great was the highly uplifting ending, but this is simply\nmissing in The Green Mile.  And I can suspend disbelief (Sixth Sense, What\nLies Beneath) when the story remains logic and surprising, but The Green\nMile is definitely not that.<br><br>It's clear that I don't consider this to be a masterpiece, but the\nwonderful\nperformances from the entire cast and the calm direction make this a film\ndefinitely worth watching and worthy of  ***1/2 (out of five)<br><br>\n"},
{"review": "\n\nFrank Darabont's second adaptation of a Stephen King story is far superior\nto his first, \"The Shawshank Redemption\", particularly due to the excellent\nperformances he gets this time around. Credit, however, should be given to\nTom Hanks who always manages to bring out the best in the performers\nsurrounding him (particularly David Morse and the sublime Michael Jeter).\nBut there's also a lot to like in Darabont's well-crafted screenplay; he's a\nfine writer who manages to add some subtlety to King's obviousness and\nsentimentality. David Tattersall's richly saturated cinematography is\noutstanding.\n"},
{"review": "\n\nEveryone knows that movies based on books are never as good as the novels\nbut The Green Mile (also Shawshank Redemption) prove the Frank Darabont is\na\nbrilliant director/writer. The movies he makes are just as good if not\nbetter then the books there based on. It's so lovely to see Stephen King\nnovels/movies that aren't made just to scare people.\n"},
{"review": "\n\nThere should be an Academy Award for \"Best Ensemble Cast\" and this movie\nshould get special consideration.  I don't believe that there has been a\nbetter group of performances in one film in the history of film.<br><br>The screenplay for this movie was perfect and the book (though much more\ndetailed) translated so movingly to film.  I have never watched a movie so\nmany times and been moved in different ways each time.  I feel pity for the\nactor that played \"Wild Bill\" because he was so good in this movie that I\nwill hate him forever.\nThank you for a beautiful and unforgettable movie....\n\n"},
{"review": "\n\nWhilst not a hardcore King fan I have read a few of his books and enjoyed\nthem immensely and although not all of the movies and mini-series were that\ngood, King's work on celluloid has provided some of the mediums finest\nmoments (The Shining, The Stand, Misery and Christine to name but a\nfew).<br><br>Having never read The Green Mile I didn't know what to expect from this\nmovie and I must admit that the premise sounded fascinating. The Green Mile\nis an exceptionally acted and scripted peice With Hanks and Duncan giving\nsuperb performances. The characters (as usual for King) are well realised\nand scenes are often touching and shocking alike.<br><br>This is one of those films you wont forget in a hurry....\n"},
{"review": "\n\nTom Hanks is a damn good actor.  That said, this movie did not live up to\nthe incredibly good word-of-mouth reviews I'd heard just prior to renting\nit.  I would recommend it, too, but just don't expect the stars.  And to\nanyone who is on the fence in re: capital punishment, after viewing this\nmovie you will surely come out against the death penalty.  And as Martha\nStewart would say, \"That's a good thing.\"\n\n"},
{"review": "\n\nPossible Spoiler:***   I am 22, and I see lots of movies on a weekly and\nmonthly basis. I had no interest in seeing it in the theater, but then a\ncouple of my friends saw it and told me how incredible it was, so I waited\nfor video. Boy, I wish I had followed my friends advice and seen it in the\ntheater. I rented it and was completely blown away by it. I haven't cried\nat\na movie in over 4 years, and at the end of this I was crying like a 2 year\nold with a scraped knee! Michael Clarke Duncan should have won the Academy\nAward for his performance, he was astonishing as John Coffey. Tom Hanks\n(brilliant as usual) makes the most of his role as head guard on The Mile.\nThe entire cast is perfect, and Darabont's direction is flawless. Even\nthough it is over 3 hours long, it only seems like an hour, that's when\nyou\nknow you have a great movie. As soon as it is available for purchase I\nwill\nbe owning it and I have recommended it to all my friends and family. After\nI\nwas done watching it, my mother watched and was also blown away by it, we\nwere both crying. There are many powerful moments in this film.  One of\nthe\nmost powerful scenes though, is when Coffey \"shows\" Hanks what he knows.\n\n"},
{"review": "\n\n*sorry for spelling misstakes*\nWhen i saw this movie i just sat there in my chair,i had nothing to say it\nhas a ending that is so amazing.\nYou can't explain it in words.John Darabont is a really good director with\nhis good movie The Shawshank Redemption.\nI think that this movie is a little bit better than his the shawshank\nredemption.It has so great script,plot and actors and actress,this is one of\nthe best movies based on a novel by \nStephen King.This movie is so wonderful and touching so i give it 9 out of\n10.\n"},
{"review": "\n\nWhen i saw this movie i just sat in my chair and thought:What a great\nmovie.The actors are great this is one of tom hanks best roles ever,it\ncomes\nclose to forrest gump,and Frank darabont is doing an excellent job\ndirecting\nthis movie,this movie is better than his shawshank redemption.This is\nMichael clark duncan's best role ever as john coffey the wrongful accused\nman.I think that this movie should come a lot more higher on the imdb top\n#250 list.This is Stephen king's best movie ever too,it is much better\nacting and plot than in most of his past movies.\nI give this movie a strong 9 out of 10,because of the great work by tom\nhanks and michael clark duncan and the other GREAT actors and\nactress.\n"},
{"review": "\n\nA great effort all around, THE GREEN MILE  is well worth seeing.  Superior\nperformances by all the cast including the newcomer who plays John Coffy,\nthe condemned man accused of the heinous killing of two little\ngirls.<br><br>Symbols abound including unexplained miracles, the transmitting of pain and\nsuffering into John's body, the sadistic cruelty of  people, and the\ntortured, painful yearnings of all of those who seek after truth and\njustice.<br><br>THE GREEN MILE is a much superior film than THE SHAWSHANK REDEMPTION.  The\n\"Mile\" never sinks into formula or sentimentality as the \"Redemption\" does.<br><br>Highly recommended for adults and mature teens.\n"},
{"review": "\n\nI liked this movie. However, I found it a bit too longish, and for some\nreason the aspirations of Darabont to make \"another one of those 'Tom Hanks\nmovies'\" were annoyingly transparent throughout the film. Praise has to go,\nthough, to the entire cast which delivers very convincing\nperformances.<br><br>IMDb rating 7.5\n"},
{"review": "\n\nAnother \"jail-movie\" from Frank Darabont.\nLike The Shawshank Redemption this film is\nfantastic. Both takes place in jail, but the story\nare so different that you can't compare them.\nYou will get surprised of the story if you haven't read the book, or heard\nfrom you friends...\nStephen King has done a good job with the idea, but\nMr. Darabont made a special touch to it.\nReally a touching directing job!!!.\nAlso great acting by Tom Hanks and David Morse.\nBy the way; I think David Morse should say yes to more \"good-guy\" roles\n:-)\n"},
{"review": "\n\nThe Green Mile is a very good movie based on Stephen King's serialized\nnovel. I have read most of King's books and this is one of his very best. It\nis adapted nicely to film by Frank Darabont, the man responsible for the\nfilm version of King's story Rita Hayworth and Shawshank Redemption.\nShawshank was a great movie too, with brilliant performances by Morgan\nFreeman and Tim Robbins. I'm hoping Darabont will adapt more King\nstories.<br><br>The acting is the highlight of The Green Mile. Tom Hanks, one of the best\nactors working today, is great as Paul Edgecomb, a death row guard. David\nMorse, Barry Pepper and Jeffrey DeMunn all give strong performances as\nfellow prison guards. Doug Hutchinson (Eugene Tooms in two early X-Files\nepisodes) as creepy guard Percy Wetmore and Sam Rockwell as sadistic killer\n\"Wild Bill\" both give standout performances. James Cromwell, Michael Jeter\nand Bonnie Hunt are good in smaller roles. Harry Dean Stanton is hilarious\nas a drunk janitor used in run-throughs for the executions.<br><br>However, the best performance is turned in by newcomer Michael Clarke Duncan\nas John Coffey. Coffey is one of the most inspiring characters I've ever\nseen in a movie and I hope to see more of Duncan in the future. He deserved\nan Oscar for his performance. This film ranks with American Beauty and The\nInsider as the very best films of 1999.\n"},
{"review": "\n\nYeah ! This movie, in my mind, is almost as good as \"The Shawshank\nRedemption\" ! \nThe plot is good, the actors are all great, and the music is\nfitting.\nI recommend it to people who enjoy watching good dramas, and academy award\n-performances ! Michael Clarke Duncan was nominated for his part, and Tom\nHanks is excellent and should have been nominated...\nLots of good scenes, maybe not suitable for the squeamish, since there are\nquite a few \"electric chair\" -scenes which may be upsetting for some, but\nthen these are not the scenes I refer to as \"good\" either ! :-) I'm\nreferring to the drama in the movie, and not the horror.<br><br>I love Stephen King's \"normal\" stories, they are great. Not such a big fan\nof his terror, blood and gore-stories, though -too weird for me. \n:-)\n"},
{"review": "\n\nThis movie was robbed.How did Michael Clark Duncan NOT get the Oscar for\nhis\nperformance??Why didnt this get the best picture Oscar??American Beauty\nwas\na good movie,and deserved the nomination,but by far,this was twice as\nbetter.Better than any of the movies this year.10 out of 10,four out of\nfour\nstars.\n"},
{"review": "\n\nI am the kind of person who reads novels first, and then goes out and sees\nthe movies made out of the novels so I can note the ways in which the two\ndiffer.  The Green Mile, though, seems as if it were directly written for\nthe big screen.  The movie deviates little from the novel, but I must warn\nthat if you thought Del's execution in the movie was ghastly, don't dare\nread about it in the book version.<br><br>As for the story itself, well, I must give it a thumbs up.  It's touching,\nand realistic.  I read reviews that skeptically asked why John Coffey\nwasn't\nlynched on the spot for his crime, then I thought, \"Well, look at the size\nof him.  How are they gonna hang him from a tree?  He must weigh a ton!\nThey don't make white boys that big.\"  But all kidding aside, the movie\nprovided some excellent performances.  Percy (Doug Hutchison) was exactly\nas\nI imagined him, and kudos to Bonnie Hunt (Janice Edgecombe), Patricia\nClarkson (Melinda Moores), and David Morse (\"Brutal\" Brutus\nHowell).<br><br>8 out of 10 stars\n"},
{"review": "\n\nIt's amazing what Hollywood can do to a good book.  In an effort to make\nthis a \"new age\" movie, Darabont stripped the book of its essential\nspirituality.  Whereas the book has several, specific prayers and a visible\nminister character, this PC version leaves out any specifics, in a seeming\nquest for the separation of church and mind.  This is not surprising, if you\nvisit the official WB site, which has a link to a new age organization\npeddling a book \"Experiencing God without belief.\"<br><br>Many of the performances are exceptional, especially Doug Hutchison (Percy),\nwho brought depth and finesse to a very difficult character.  King's\ncompelling book is airbrushed and soft-focused out of leaving anything but\nemotional impact behind in a new-age soup of feel-good, feel-bad emotional\nhighs &amp; lows.\n"},
{"review": "\n\nThe Green Mile is a wonderful film full of great performances and emotions\nbut, I have a couple of quibbles with it.  <br><br>1.  In 1930's America, John Coffey (as a black man) would have been strung\nfrom the nearest tree WITHOUT benefit of trial and jury for the heinous\ncrime that he was accused of.  (I definitely had to suspend dis-belief\nconcerning this part of the story).<br><br>2.  As many others have stated the movie is far too long.  It could have\nbeen shortened to two hours.<br><br>3.  The movie could have been just as enjoyable without the mouse.  I\nthought that the mouse was a distraction to the main story.<br><br>That's all.  7/10\n"},
{"review": "\n\n  The Green Mile has to be one of my favorite movies of '99.  The story: Tom\nHanks plays a security guard who encounters John Coffey (Michael Clark\nDuncan), a man wrongly accused of murder and who later reveals that he has\nthe power to heal people.  Michael Clarke Duncan is awesome as John Coffey,\na giant of a man who is gentle and child-like.  He has to be my favorite\ncharacter out of this movie.  Tom Hanks and all the other guards and\nprisoners of the Green Mile, the name given to the death row because of the\nlime-green floor, are also very good characters.  Pursey, a weaseley guard\nwith a bad attitude, is one of those characters that you just love to hate. \nThere are many other likeable characters in this movie, including a mouse\nwhich a prisoner names \"Mr. Jingles\".  This movie has some lighthearted\nfunny moments in it.  For instance, in the night the guards try to find a\nmouse that has been poking around the prison. (Mr. Jingles)  \"Three grown\nmen, outsmarted by a mouse!\"\nIt is also very touching in parts, specifically towards the\nend.\nIf you get the chance, see this movie.  In my opinion it's one of the best\nmovies of 1999.  Michael Clarke Duncan should of won an Accademy Award.  Oh,\nwell.<br><br>\n"},
{"review": "\n\n1994 saw a modest Stephen King novel translated into a modest, little-seen\nprison drama...that is, until it was blessed with a surprising seven Academy\nAward nominations, including Best Picture. Since then, everyone and their\ngrandfather has espoused \"The Shawshank Redemption\" as the little movie that\ncould...and did. Five years later, its director, Frank Darabont, has adapted\nyet another prison-based King tale into a highly pleasing entertainment. But\nthere the similarities end. While \"Shawshank Redemption\" essentially belied\nits typically macabre Kingian origins, but for a similar tone and languid\npace \"The Green Mile\" includes a crucial plot element not atypical from the\nhorror-meister's oeuvre. Told in flashback, a former death-row prison guard\n(solidly played by Hanks) relates the extraordinary story of John Coffey\n(Duncan), a simple-minded and gentle inmate who is readily accepted as a\nkiller in the summer of 1935 because of his hulking size and damning\ncircumstantial evidence. But Coffey (initials J.C., ahem), in addition to\nhis overwhelmingly considerate attitude, possesses a singular talent for\npsychic empathy with others and an ability to heal the sick. Gradually, he\nconvinces most of his captors, to varying degrees, that he is not a man\ncapable of the heinous crime he is condemned to die for imminently.\nCompounding their crisis of conscience are the presence of a callous fellow\nguard and a psychotic neighboring inmate. Despite its over-length (by at\nleast 20 minutes), the 3-hour \"Green Mile\" succeeds in every other respect.\nOften moving and technically astute, its premiere quality lies within its\nensemble of actors, each of whom is simply perfect in their respective\nroles. Hanks may be the star of the show, and Duncan may stand out because\nof the uniqueness of his character, but their co-stars are consistently\nequal to the standard they've both set throughout. That alone is reason\nenough to see \"The Green Mile\".\n"},
{"review": "\n\nI agree with some of the other comments made about Stephen Kings\nadaptations, some work and some definately don't. This is one of those that\nfortunatley does, and it even makes up for some of the one's that\ndon't.\nDon't mistake this for just another prison flick, or expect a rip off of the\nShawshank Redemption, because this is neither.\nIt follows the lives of prisoners and guards on a prisons death row, Hanks\n(Paul Edgecombe) is the head guard who tries to show a little compassion to\nthe prisoners facing the inevitable, most of his fellow guards are of the\nsame mind except one, who uses his position as nephew of the governor's wife\nto keep him in a job that enables him to induldge his bullying\nnature.\nMichael Clarke Duncan is John Coffey, who, with shades of Forrest Gump,\nintroduces himself as John Coffey, \"like the drink only spelled different\"\nis a prisoner on death row for killing two girls, as the film progresses the\nguards come to realise they are about to send an innocent man to the\nchair.\nIt has some nice moments in it, particularly with Mr Jingles, a mouse who\npatrols the 'Green Mile' floor and eventually makes friends with the guards\nand prisoners, and I have to say I haven't seen an acting performance like\nthis from a mouse since Tom and Jerry.\nAll the cast play their parts well, Tom Hanks and Michael Clark Duncan\nespecially.\nKing's story gives the film enough of a twist to make it interesting and\ndifferent, but it's not so over the top with the effects and to make it\nnonsensical.\nThe film wasn't quite what I expected, and was pleasantly better than I\nthough it was going to be.\nIt maybe a 3 hour epic but I've seen shorter films that have seemed twice as\nlong, and I could quite happily sit through the film without getting\nantsy.\nOn a par with 'Shawshank' so if you liked that chances are you'll like this\nas well.\n\n"}
]