[
{"review": "\nI went to see a critics preview of The Prestige this afternoon and to \r\nmy surprise I found the film to be one of the best I have seen all year \r\nso far, and that writers can come up with an excellent script it they \r\nwould only try a little harder. The acting performances by Hugh \r\nJackman, Christian Bale and Michael Caine were the best I have see in \r\na long while. The only objection I had to the film was that it was a \r\nlittle long, but once you leave the theater you will discuss the film \r\nand it many twists and turns. My wife and myself discussed it all the \r\nway home from the movie theater. This is a winner and should be up for \r\nsome academy award statues, and my recommendation is go see this as \r\nsoon as you can, you will not be disappointed.\n"},
{"review": "\nWhat makes this movie so incredible is that while it is indeed a movie\nabout magicians (or illusionists) it is also a complex character study\nabout how self destructive obsessions are with a sideline love story\nand a sci-fi twist. A unique plot with an amazing cast--any of whom\ncould believably garner an Oscar nomination. Christian Bale was amazing\nin one of his rare cockney performances. We already know from Kate and\nLeopold how well Hugh Jackman plays a distinguished English gent. He's\nabsolutely priceless. Is there any point in discussing Sir Michael\nCaine? He brings polish to the movie. <br><br>This is the kind of flick that you can discuss for weeks after. The\nplot is so detailed and complete and open to interpretation. My friend\nand I have been discussing various nuances of this film for the past 3\nweeks. It definitely stays with you.\n"},
{"review": "\nI couldn't help myself. I just kept saying \"wow, what a beautifully\ncrafted film,\" all the way home, and around my house when I arrived\nhome. I have not been so captured and entertained in a long time. I was\nespecially enamored with the screen writing and how tightly and\nbeautifully the visual metaphors tied in with the writing, and with the\nimpact of the human message about obsession, competition and\nretribution carried to the extreme. <br><br>One can relate to this personal human struggle for victory over another\nat all costs on a much grander scale, as the two magicians could easily\nbe symbolic of how leaders of countries come to blows with each other,\nat the expense of their women and children -- something we struggle\nwith right now in our world. There are deeper layers of this film that\nwill be uncovered over time.<br><br>Hugh Jackman, Christian Bale and Sir Michael Caine all contributed\nstunning, emotional performances. Rebecca Hall, who played Sarah to\nBale's Alfred Borden, turned in a highly charged performance as well,\nmaking Scarlett Johansson's Olivia flat in comparison. And although\nsome people thought the plot line a bit tedious, I found it to be\nrefreshingly complex and engaging, while not being so complex as to\nlose you. If you can't follow this one, you've been watching television\ntoo long. And who cares if the illusions are mundane or scientifically\nunbelievable? Isn't that what both movies and illusions ask us to do?\nTo suspend disbelief? Meantime, there's a message in its madness.\nHello.<br><br>The film is visually moody and evocative, easily transporting you into\nthe time period. What more could you ask for? A film is a visual medium\nand this one is a visual ten. The acting is superb as well as the plot.\nIt keeps you interested; it keeps you guessing right to the shocking\nbut most appropriate end.<br><br>It asks you, what is one willing to sacrifice for the \"prestige?\"<br><br>I think this one's an Oscar definite.\n"},
{"review": "\nI have to say this is one of the best movies i have seen this year, i\nwas not expecting it to be that good. There's twist after twist, and\nwhen you think there is no more, there will be. Great performances and\never better plot. I highly recommend this movie to all ages.<br><br>New idea for a movie, and they succeeded it at it greatly. It will have\nyou thinking every time you see a magician on TV!<br><br>i had to give this movie a 10/10, and i only have 4 movies that i would\nrate that way in my life time. If there is anything you do this year,\nmake it a trip to watch this movie!<br><br>I hope you enjoy it as much as i did.\n"},
{"review": "\nThe Prestige. I am impressed. I am a HUGE fan of Hugh Jackman and\nbought the book as soon as I heard he would be in this movie. I read it\nand enjoyed it, but wasn't especially fond of it. But I still had been\nreally looking forward to this movie.<br><br>I went to the first showing opening day (Friday, Oct. 20th) with 2\nfriends and sat a row behind them, alone, to enjoy it peacefully. I\nloved it all.<br><br>Christopher Nolan really has a gift at directing. The way the movie\ncuts back and forth between different places and times is clever.\nAlthough some might be confused or left stupefied, others will be happy\nand glorified. The movie will keep you guessing the whole time until\nthe very end. The script, acting, settings, props, everything was so\nwell-done.<br><br>Hugh Jackman was excellent as the angry, obsessive magician trying to\ngain back his life by revenge. Christian Bale was equally impressive as\nthe mystifying, secretive showman, never letting out his secrets until\nnecessary. Michael Caine rocked in supporting everyone else's parts\nwith his curiosity. The rest of the cast rounded out nicely and helped\nout where need be. I really recommend this movie to a sophisticated\naudience who doesn't mind a long, mysterious movie.<br><br>And man, what an ending.\n"},
{"review": "\nThis was the best movie I have seen in at least the past two years.\nMost movies have me leave the theater feeling like I wasted 8 dollars\nor so. So many movies lately have left me feeling like I wasted away\nprecious hors of my life that could have been spent doing better\nthings. Yet this movie was truly a masterpiece and kept me guessing the\nwhole time. The acting was superb and so was the plot. I usually can\npredict the outcomes of movies pretty early on. And usually I can see\nthe twist the writer planned. With this movie I was still left\nwondering into the last 5 minutes of the movie. I can't wait to own\nthis on DVD.\n"},
{"review": "\nI've seen this film twice now - about a year ago and then yesterday -\nand thoroughly enjoyed it both times, even the second time when I\nremembered some of those fantastic twists in the last half hour.\nSometimes it's even more fun to view a film like this when you know a\nfew things, because earlier scenes take on new meaning.<br><br>It's not an easy film to totally digest, even with two viewings,\nbecause that ending has some mind-boggling revelations. Without having\nto resort to spoilers, let me just say the story is extremely\ninteresting, the acting very good, the period pieces fun to view and\nit's a pretty clean movie so grandma can also enjoy it, too, without\nlanguage or sex concerns.<br><br>Basically, it's a story about obsession between two magicians in the\nlast decade of the 19th century. They continually try to top one\nanother and things get nasty along the way. Hugh Jackman and Christian\nBale are both fun to watch in those roles, as are Michael Caine and\nScarlett Johansson in supporting roles.<br><br>This is one movie guaranteed to have you thinking about it when it's\nover!\n"},
{"review": "\nReading these drooling reviews, I have to wonder what has gone wrong\nwith the movie-viewing community of late.<br><br>This film is nothing more than a very expensive exercise in\noverstatement. How many times can we possibly hit our audience over the\nhead with the same exact symbolism? How blatantly obvious can we make\nour \"elaborate plot twists\" by the end of the film? Hugh Jackman's\nclosing speech is perfectly typical of this film. Shot and dying on the\nfloor, he suddenly comes to this very drawn out and very boringly shot\nepiphany about how he was never REALLY obsessed with finding out his\nopponent's secrets. He actually traveled thousands of miles, spent\ncountless amounts of money, (How did he have this, by the way?) shot,\nstalked, kidnapped, and did his very best to destroy his opponent's\nlife, but he actually did it for \"the look on their (the audience)\nfaces.\" Please.<br><br>And plot twists? No no no, my friends. There is precisely one plot\ntwist, and it is given away by the \"tease\" at the beginning of the\nfilm. As soon as you see that the hat doesn't leave, you know the rest\nof the movie. Okay, it clones things. He makes new and kills one of\nhimself every time. It's not a huge leap in logic, but the filmmakers\nsee fit to treat the audience like a bunch of Neanderthal second\ngraders.<br><br>Finally, we are supposed to like the magician/twin that makes it back\nto his daughter in the end. Forgetting of course, the fact that he\nbroke Hugh Jackman's legs, killed his wife, crushed that innocent\nwoman's hand, and oh yes, shot and killed his rival. But he was\njustified, right? WRONG. Once again, Hollywood comes out with the kind\nof ambiguous, almost-moral movie that makes you just cringe with the\npansy-butt quality of their statements.<br><br>Please do both me and yourself a favor and skip this tripe.\n"},
{"review": "\nI love a film that doesn't spoonfeed the plot and the story and the\ninterest in it to the audience. This one takes you along if you are\nsmart enough to go and if you are not so dumbed down by most\nentertainment that you can stay steadily involved.<br><br>I wanted to love it to death...it has everything I think a film should\nhave, including a wonderfully rich atmosphere, a great cast and\nexcellent direction. Through most of it, it dares the audience to be\nintelligent and to have an attention span longer than a fruit fly. It\nhad all the makings of a great film, but I kept looking for (and\nlonging for) the greatness to impact me. It never did.<br><br>It fell flat for me by the end. I really didn't care about any of them\nby then. I wasn't even sure I cared about the little girl. I certainly\ndidn't care how anyone did any of the illusions; I was sick to death of\ntheir obsession with each other and just wanted them to move on\nalready. Although there would be no film without it, it all seemed to\nbe 'too much trouble to go through' and obsession is about getting\ncaught up in it...for me, I couldn't get caught up in itnor could I\nquite get their obsession. Although Iam a big fan of the long, thinking\nperson's film, I have to say I thought it dragged on and on by the end\nand I just wanted it over. It definitely did not leave me wanting more.\nI just wanted different.<br><br>I had paid attention all along, I was impressed with the film and\nthought the acting, the cinematography and the direction were all\nsuperb. Even though some of the twists seem unnecessary, I thought many\nwere brilliant and I kept trying to will myself to care about it, to\ncare about them, but I didn't.<br><br>It was a very good film in a detached sort of \"viewing art\" way but as\nfar as feeling \"wow\"'d by the end, not so much.\n"},
{"review": "\nLong ago I watched The Prestige and The Illusionist in the same\nweekend. Comparisons are odious but it is inevitable for me to think of\nthe second when talking about the first. You want to know why, keep\nreading.<br><br>Magic is present in everybody's childhood, but it is something we lose,\nas we get older, in part because there are not many movies about magic\nto watch when you grow up. But if you want to turn the clock back and\nfeel excited about how magicians perform tricks and get some answers\nabout \"how it is possible\" or \"what's the trick\", lucky you because\nthere are two movies which will definitely satisfy your curiosity.<br><br>Both movies take place in England at the end of the XIX century. They\nnot only have in common their genre, drama-mystery but also a fantastic\ncast. Edward Norton' remarkable portrayal of Eisenheim in The\nIllusionist is as memorable as Hugh Jackman and Christian Bales's in\nthe Prestige. The appealing special effects, the convincing costumes\nand the compelling dialogue; you will enjoy these movies from the\nbeginning to the end.<br><br>Although there are several similarities between the two movies their\nplots are quite different. The Illusionist is, without a doubt, a much\nmore romantic interpretation of the life of a magician. The Prestige,\non the other hand portrays the rivalry between two magicians where\nrevenge is the main feeling. The second movie is, indeed, more\naction-packed but no less moving than The Illusionist.<br><br>These two must sees will trap you and will carry you to an enjoyable\nworld full of magic. But if you really love cinema and good stories the\none I highly recommended to you is the Illusionist.\n"},
{"review": "\nI continue to be blown away at how fantastic this film is. It is\nexecuted with extreme precision. Every aspect of the film, all the way\nfrom visuals to the character development, is masterful.<br><br>I'm not sure how it fared awards wise upon its release, but it should\nhave racked up quite a few. The story is wonderfully layered, the\nacting is superb, the directed is spectacular, etc. I can't find\nanything about this film that I would change.<br><br>Congratulations to the entire team that put this project together. I\nconsider it one of the best films of all time.<br><br>If you have the opportunity I strongly urge that you check this film\nout. I think you'll be glad you did.\n"},
{"review": "\nIf you think this film is mediocre or just a \"period piece\" then you\nhave to think again because the true depth of this plot cannot be\nrealized without watching repeatedly.<br><br>I have watched it through several times and still can't tell if the\nMichael Caine character was the true mastermind.<br><br>This screenplay could play in any time or place, even with unknown\nactors, and still generate eternal wonder.<br><br>Too many directors rely on gratuitous violence, expensive action\nsequences, big name actors and grandiose sets/CGI to wow the viewers\nChristopher Nolan is an unmitigated genius and doesn't need any of\nthose tricks.\n"},
{"review": "\nThe Prestige is awesome! You have not seen a better movie in years!\nHugh Jackman, Christian Bale, and Michael Caine are going to win some\nawards, let me tell you. And so is the screenplay. It's completely\nastonishing! The whole movie is! <br><br>Robert Angier (Jackman) and his assistant, John Cutter (Caine), are\ninto magic. Robert is the illusionist, and John is his assistant with\nbuilding and testing illusions. When a man picks two volunteers to tie\na woman (Robert's wife) to bind her in ropes so she cannot possibly\nescape the water cage (like one of Houdini's escape tricks), it all\ngets interesting. The two volunteers were Robert Angier and Alfred\nBorden (Bale), who didn't even know each other until that day where\nthat woman -- who was Angier's wife -- drowned in the water cage all\nbecause Alfred Borden tied the knot in the assistant's hands wrong. She\ncouldn't slip out of the knot. She died.<br><br>Now Robert is angry. He shoots Alfred's hand later on in the movie,\nlosing two of his fingers. Now, they are fighting at each other, not\nphysically, just apart. THE TRANSPORTING MAN ILLUSION is a wonderful\nillusion that Alfred Borden made up, and now Robert is trying to steal\nhis secret. He has become obsessed. So, he makes it better. BUT THERE'S\nTOO MUCH! JUST SEE THE MOVIE! <br><br>Oh, and for those who pay attention to music in movies, you'll be\ndisappointed. There's not much music to pay attention to. There's just\nsome violins and other orchestral instruments here and there and\noccasionally there's a, \"BOOM\" of a timpani when you're supposed to be\nshocked or surprised at something.<br><br>Sorry if I gave too much away, just PLEASE agree with my comment. I\ndon't get any people who agree with my comments. I would greatly\nappreciate it.<br><br>My MPAA rating: PG-13: Thematic Material, Some Very Startling Scenes of\nViolence, and Disturbing Images <br><br>My Canadian rating: 14A: Frightening Scenes, Mature Theme, Violence\n"},
{"review": "\nEvery so often I see a film that I get addicted to. As soon as I watch\nit in the cinema I know I'm going to buy it the day it comes out on\nDVD.<br><br>Well The Prestige is the latest of these. This film gets better and\nbetter with each viewing. Hugh Jackman should have won many awards for\nhis role. People say \"Oscar\" but there are better awards out there than\nthat, the Oscars are about as representative of what's the \"very best\"\nas the IMDb's Top 250 list is.<br><br>People have told me that they predicted the end, well that's their\nfuneral, I never clicked until it was revealed for me, so I got much\nmore value for my money.<br><br>Christopher Nolan is a master. Even though he seems quite humourless in\nhis DVD extra interviews. He makes extremely entertaining films that\nare well cast and superbly executed, just as the Prestige is. <br><br>All those who never liked the film should be rounded up in a field and\nused for crazed scientific experiments, we could use Tesla!\n"},
{"review": "\nthis has has to one the best movies ever if not the best..Christopher\nNolan is a genius..there is no flaw in the movie..the direction is\nexcellent..Christian bale and Hugh Jackman have put in Oscar winning\nperformances..the plot is mind blowing.. the movie is centered around\ntwo magicians with a contrast idea of what magic is and the two are\ndriven by intense rivalry towards each other..each tries to outdo the\nother and even try to sabotage each others performance..in the end one\nbecomes obsessed to learn the secret of the other's trick and he is\nwilling to risk everything to obtain it.. the movie is filled with\ntwists and binds the viewer.. all i can say is its a must watch..\n"},
{"review": "\nYes, TDK was unbelievably awesome. Yes, Inception was original and\nawesome. No, neither of them is Nolan's masterpiece (to date). That\ntitle belongs to The Prestige, at least in my opinion. Featuring an\namazing pairing of Jackman and Bale, and the hot off of critical\nfailure Insomnia, Nolan's movie scorches from the beginning. Putting\nTesla in as a historical anchor was pure brilliance, and with the aid\nof Tesla technology most of the illusions they pulled off could easily\nbe done, even the shocking ending(s). Therefore, despite what some\nmight say, this is all entirely realistic.<br><br>In fact, I think Nolan would be smart to re-visit Tesla and do a\nbiopic, because there are few people as insanely weird and full of pure\ngenius, in history, as Tesla was.<br><br>On the surface, this is a simple magician versus magician period piece,\nbut it slowly evolves into a battle of wit between two incredibly\ndriven men. The twists in this movie, the first time viewing, are\nnearly impossible to predict (unlike Inception/TDK), and everything\ncomes together perfectly. One of the most under-rated movies, ever.\n"},
{"review": "\nThe truly amazing thing about this movie is that it has managed to fool\nnearly its entire audience into misinterpreting it, even though the\nclues it leaves behind are so numerous and apparent as to make the\nsolution to the movie absolutely obvious. It makes a fool out of its\nown audience.<br><br>The movie succeeds in tricking the audience into believing the machine\nis a cloning device, while actually being something else entirely. The\ntrue secrets are never revealed to the audience yet it believes it has\nan adequate solution. That is part of the brilliance of the movie. It\ntries to make a fool of the audience in general and succeeds.<br><br>Im sure there are a few keen minds that truly understand what the\nmachine does and are skeptical that Fallon is really Borden's twin, but\nthe audience in general is duped into accepting faithfully what it's\ntold. The movie never reveals its secret but the audience still feels\nthe plot is resolved.<br><br>It manages to paradoxically resolve the plot for the audience while not\nresolving it at the same time. It successfully sells them an alternate\nsolution that isn't accurate and leaves them completely oblivious to\nthe real solution. But they don't mind, because like the closing line\nsays, the people watching \"want to be fooled.\"\n"},
{"review": "\nThis movie was truly a game-changer for me. I initially saw it simply\nbecause I enjoyed some members of the cast so much (Bale, Caine,\nBowie), but I left the theatre in awe. It is such a well-written,\nlayered, intense, character driven story on par with Faustus or Jekyll\nand Hyde in terms of characters that are overly driven by their\nobsessions. It invites you to watch in the first lines of dialogue and\nfrom that point forward, you hardly have a choice. One of Nolan's\nstrengths is that he doesn't shy away from difficult stories to tell.\nNone of the characters are entirely likable. It's hard to pick someone\nto root for, but that is one of the things that makes them so human.\nJackman and Bale are both fine actors that attack their roles with\ntremendous capability and Rebecca Hall is one of the best discoveries\nI've had in movies. Even Johansson, who is easily the weakest link, was\nused sparingly and didn't detract from the movie. The plot is\nfascinating and leads to an immensely satisfying ending. I can't watch\nthis enough times.\n"},
{"review": "\nI've been a fan of Nolan for a long time, ever since Memento. He has\nthe ability to create mood and deep, well rounded characters better\nthan almost anyone in the thriller genre, ever. For my money, only\nHitchcock was better. And the Prestige was something worthy of the\nMaster himself. Its is a dark, twisty, surreal film that truly goes\nunexpected places. Nothing is what it seems. And Nolan manages to pull\nof the twists, turns and surprises expertly, never once make a jump in\nlogic that you don't take with him without question. The acting is\nphenomenal, Bale, Jackman and Caine are all excellent. But it is\nJackman who owns this film. Between this and The Fountain (which I\nstill don't know if I liked or not) he has really come into his own as\nan actor. Its a shame he was completely ignored at awards time this\nyear. Towards the end of the year, there were some truly great films,\nbut this is unquestionably the best. Its a well paced, thoughtful,\nintricate thriller that is better written than almost anything I have\nseen in years. Nolan is one of the most talented directors of his\ngeneration, something he continues to prove film after film. Howmany of\ntodays \"franchise\" directors take a break in the middle of a superhero\nfranchise to make a moody, dark period thriller about dueling\nmagicians? The man is a master, only a notch below Hitchcock himself,\nand this film is his masterwork, so far.\n"},
{"review": "\nA lot has been said about the film's beauty, but this is also an\namazingly complex film and I think a lot of people didn't really get\nall that the first time. Some critics were upset about the twist ending\nwhile others were concerned with the sci-fi plot. To these people I say\n\"Are you watching closely?\" <br><br>In retrospect, this film's cleverness comes from its plot that is\nstructured similar to a magic trick. Both Angier and Borden's story,\nhas a pledge, a turn and a prestige. In the film, they both share the\nsame prestige; seemingly reappearing from the dead. The ultimate twist\nin the film is literally told to the audience several times, but as an\naudience we naturally doubt the obvious, and wish to be fooled. This is\nsimilar to a magic trick, we know the truth behind the magic; that it's\nnot real, but only a great magician can, for a moment, make you doubt\nthat truth. It's the magician's job, to quote the film, \"sell it all\nthe way through\" and this film does just that. Even though you might\nhave it figured out, the film gives you distractions that have you\ndoubting it just long enough so when the pieces come together you\nrealize what you just saw was something truly special. That's the\nbeauty behind this film.<br><br>The science fiction plot fits both visually and thematically. The film\nshows us that during this time period magicians had to change to keep\nup with the times, so they adopted more science fiction into their\nacts. This is why Borden and Angeir seek out Tesla. It brings closure\nto the other reoccurring theme in the film which is obsession, how far\nwill one go? Their obsession to keep topping one another leads Angier\nto take it to the next level, but he goes too far, starts toying with\nreal magic and ends up going to hell for it.\n"},
{"review": "\nIf all you read are some of the other comments here, you might think \r\n\"The Prestige\" is a cheat and a disappointment. And maybe if you are \r\nwatching it with a superficial mindset, it is. But if you really pay \r\nattention, and delve into the many layers of story, you will see the \r\nmovie as so much better than that.\r\n\r\nTwo magicians rival to be the best, and this movie takes you through \r\nmany years of that rivalry, along with the resulting jealousy, anger, \r\nbetrayal, and ethic and moral dilemma. Oh, and did I mention death, \r\ndisfigurement, and deception? The performances are gripping, and the \r\nproduction is stunning, creating a believable setting that draws you \r\ninto the story. I did experience some moments of confusion when the \r\ntime lines jumped into the past or present a bit abruptly. But in the \r\nend, most questions will be answered. It's important to remember, \r\nthough, that the most compelling question is not what was real and what \r\nwas deception, but rather, how far do you allow yourself to go to prove \r\nyou're the best?\n"},
{"review": "\nI don't know how any movie buff would not see the twists coming from a\nmile away. One can see when a twist is done in a tasteful and careful\nmanner, and when the film makers are desperately trying to fit square\npegs into round holes. Credit must be given to Hugh Jackman, Michael\nCaine, and David Bowie for their superb acting. However Christian\nBale(who I normally like) and Scarlett Johansson were terrible. A few\nof my specific gripes: 1. The ending is given away in the first minute.\nChristian Bale is accused of killing Hugh Jackman. EVERY MOVIE that\nstarts with this presentation ends up with the supposedly accused being\ninnocent.<br><br>2. The cat was duplicated. Surely by this alone anyone can deduce that\nJackman was also duplicated. Hence the pointless \"solving the puzzle\"\nscenes.<br><br>3. Mystery/suspense turned into Steven Spielberg's Amazing Stories\nscience fiction halfway through the movie.<br><br>4. Jackman conveniently tears up the Transported Man secret(which was a\ndriving plot) so he can be shot by Bale's twin brother.<br><br>5. Jackman conveniently finds an exact look-alike in a bar.<br><br>6. Bale's wife amazingly knows which days he loves her and which he\ndoesn't, in a dire attempt to connect the twin brother twist.<br><br>7. I was terribly disappointed with Perabo's death scene and subsequent\nfuneral. These were two important moments in the film and should have\nbeen emphasized and given more attention. \"What knot did you tie?\". \"I\ndon't know\". \"You don't know?\".<br><br>8. A supposedly \"dead\" Jackman trots in public without any concern of\nbeing recognized to have a contrived face to face dramatic effect with\nhis nemesis.<br><br>9. Just get a gun and shoot each other in the back. The movie would be\nover in 10 minutes and there would be no need for tantalizing\nsabotages.<br><br>To conclude, this movie was made with the intention of \"let's get in as\nmany twists and turns possible\" rather than \"let's tell a good story\nwith a twist\".\n"},
{"review": "\nI found the most interesting part of this movie to be the behind the\nscenes look at some of the tricks used by illusionists and magicians.\nThe broader story has great potential. Hugh Jackman and Christian Bale\nplay rival illusionists in late 19th century London, whose rivalry goes\nbeyond just a fun competition and becomes dangerously obsessive with\nultimately tragic results. All that sounds pretty good, and both\nJackman and Bale were solid in their roles as Angier and Borden\nrespectively, as was Michael Caine as Cutter, Angeirs' assistant.\nSpoiling the story somewhat for me was a sort of mini-subplot about the\nrivalry between Thomas Edison and Nikola Tesla. Edison is never\ndepicted in the movie, while Tesla is played by David Bowie of all\npeople. That rivalry was very real of course but dissolves into a bit\nof a farce here, as Tesla has supposedly invented some sort of\nteleportation device that Angier wants to use in his show. A simple and\nobsessive rivalry would have been quite sufficient without that dive\ninto sci-fi silliness. I also have to say that while the movie\ncertainly had its strong points, for the most part the story just\ndidn't take hold of me. I found it a little long and slow-paced at\ntimes, and in the last 15-20 minutes there just seemed to be too many\ntwists and turns happening, which again took away from the story's\ncredibility. In the end, my reaction was that this was OK, but nothing\nmore. 5/10\n"},
{"review": "\nDepicting the story of two magicians, who develop a rivalry that\neventually turns out into a true war, \"The Prestige\" is a movie that\nkeeps you connected all throughout its two hours. Some people said\nabout it that sometimes the action tends to be boring, but I consider\nexactly the opposite: I didn't have the time to get bored, due to the\nvery well-written story. The actors are amazing: Hugh Jackman -\ncharming yet sometimes scary, as we know him, and Christan Bale, more\nlively but equally \"strong\" as in Batman Begins, are the two rival\nmagicians. Their act is sustained by Michael Caine, as their mentor,\nand Scarlett Johansson. I didn't go to this movie expecting much, but\nafter having seen it, I can say without any doubt that this is one of\nthe best movies I've seen in a very long time, and I strongly recommend\nit. It's a film to savor and to feel (and eventually maybe to love)!\n"},
{"review": "\n...but it fell like a card-house. I really like the thought of the \"its\nall about the sacrifices you make\" plot but it just doesn't last. Up\nuntil Nikola Tesla did his cloning/teleport thingey I still had some\nhopes for the movie and I sat hoping that Tesla had faked the cloning\njust to get some more money when i saw the hats and cats on the ground.\nI genuinely hoped the filmmakers illustrated Tesla as a hoax, it sure\nseemed better than the movie getting all Star Trek! Unfortenately the\nwriters didn't pick up that extra ace from their sleeves and the movie\nliterally flat-lined and just died. <br><br>Beam me up Scotty :(\n"},
{"review": "\nSorry, but I guess I'm going against the grain on this one. I remember\nwhen Michael O'Donoghue was writing for National Lampoon; he had a \"how\nto write a short story\" article. The thrust of the piece was -- if you\nget bored or can't figure out an ending, have your character get hit by\na bus. This movie seems to take that approach.<br><br>The 'miracle' invention that Tesla apparently provided Hugh Jackman's\ncharacter, which allowed him to duplicate himself, is nowhere\nreferenced in the movie. The ending is a cinematic equivalent of \"then\nhe got hit by a bus\". In short, I think the audience was cheated.\nApparently most of the people who commented on this movie didn't mind\nthat, but I thought it lacked integrity.<br><br>Beautiful cinematography, tortured accents, and a conceit that's actual\na deceit. Not recommended.\n"},
{"review": "\nChristopher Nolan's The Prestige tells the story of two rival\nmagicians, Borden (Bale) and Angier (Jackman). The two battle over\ndeceiving and outsmarting each other as they try to be the better\nmagician. Spanning several years and often jumping backwards and\nforwards in time, The Prestige is a beautiful, brooding tale about\nobsession and how far it can and shouldn't go.<br><br>Being one of Christopher Nolan's more modest films (being made between\nBatman Begins and The Dark Knight and on nowhere near a larger scale),\nThe Prestige is one of those films that only those who pay attention\nunderstand it's true greatness. With a typical Nolan-esque cast\n(Christian Bale, Michael Caine\u0085), the film is setup for quality cinema\nand does not disappoint. From start to finish you are fixated and\ndeprived of attachment to the world around you much like Borden and\nAngier as you too do not want to miss any of the films trickery.<br><br>One of the best things I like about The Prestige is how it deceives the\nviewer just as a magician would to their own audience. 'Are you\nwatching closely?' a line which is repeated throughout The Prestige\nhints at the films very own nature. 'You want to be fooled,\" the last\nlines of the film as uttered by the legendary Michael Caine, leave the\nviewer in a bewildered state as they reconsider what they have just\nseen.<br><br>The cinematography is grand. DOP Wally Pfister who has worked on all of\nNolan's films I believe, deserves just as much credit as the director\nhimself. From the dark and electrifying theaters to the eerie Colorado\nMountains, The Prestige looks fantastic. <br><br>Having seen the film several times and enjoyed each viewing as much as\nthe next, The Prestige continues to amaze me. It truly is a mesmerizing\nand brilliant film which just cannot go unseen by anyone.\n"},
{"review": "\nIf you didn't enjoy this film, well. You, I am afraid to say, have no\ntaste in films whatsoever. <br><br>I see people moaning about how they didn't understand the plot and how\nit was boring for them, that would probably be because you didn't WATCH\nthe movie properly. It tells you from the very beginning to watch\nclosely because this is a film that requires your full attention to\nunderstand and you will be well rewarded if you do. If not, you become\none of those commenting with \"I don't understand, omg it's such a bad\nfilm because I don't get it.\"<br><br>The acting is amazing and the twist at the end of the film is not\nsomething that I saw coming. At times it is a little predictable, but\nall films have their moments and it certainly doesn't take away from\nthe magic that it brings to the audience member.\n"},
{"review": "\nWatching a movie ten times is stupid. Unless, of course, that movie is\nThe Prestige. When my girlfriend asked me if I wanted to watch it\nagain, I was more than happy to acquiesce. You may be wondering how\nsomeone's attention could be held after watching a movie so many times.\nIt can be summed up, quite simply, by the fact that Christopher Nolan\nis a brilliant director. He manages to take a movie that has one of the\nmost simple themes and build an intricate plot around it. The movie\nfocuses on the competition between two magicians as they each strive\nfor supreme success. Along the way, they each face the hardships of\ndeath and the slow decline into obsession with their work. In one of\nthe most influential scenes of the movie, one of the characters is\nbegged to give up his quest for greatness because it will only bring\nhim sorrow. He, of course, does not heed this warning, but I will not\ngo deeper into that to avoid spoilers. Along with the way Christopher\nNolan developed a brilliant plot, he did an incredible job of casting\nhis roles. Hugh Jackman plays one of the magicians, Robert Angier, and\nChristian Bale was cast as his competitor, Alfred Borden. Michael\nCaine, Scarlett Johansson, and David Bowie each contribute vital side\ncharacters and stories. Ultimately, this movie was created to get your\nmind thinking in ways that are very far outside of the box. There are\nsome supernatural events, yet it is easy to relate to certain\ncharacters in the film. One of my girlfriend's complaints was that she\ndid not know who she was supposed to like in the movie, but I think\nthat was Nolan's purpose. He wanted the viewer to look at the film from\nall perspectives and not be fixated on just one of them. I don't even\nlike writing a review for this movie because it is one that almost\nneeds to be entered with a completely open mind.\n"},
{"review": "\nThis is seriously the best movie you will ever see. By far, both Hugh\nJackmans and Christian Bales best ever performance.<br><br>I was on the edge of by seat the whole time. It is a dark and\nmysterious movie that draws your attention and is very intriguing. It\nmay appear hard to comprehend but the whole movie is tied together in\nthe final chapter and it is at that moment when you truly realize what\nan amazing movie this is.<br><br>Possibly the best Christopher Nolan movie yet!! He employs many\ndisturbing and emotive scenes to highlight the instability of the human\nnature. This movie has gone way under the radar. This deserves to be up\ntheir with the very best and beyond.<br><br>I am not a fan on the average movie that entails little action scenes\nor movies that appear to take time to unravel, but this blew me away.\nIt gets into your head and messes around. I watched this and for 4 days\nit was all I can think about! an absolutely amazing art work.<br><br>10 out of 10. Enjoy!\n"},
{"review": "\nThe movie is astonishingly good. It kept me on the edge of my seat the\nwhole time guessing what was behind this \"Transported Man\" trick. I had\nmy own guess, but it turns out I was fooled along with others. The plot\nis very sophisticated, almost flawless and with the appropriately woven\nscience-fiction scenes. 19th century London being on the edge of new\n\"electrified\" era was shown perfectly well, all the costumes matched\nthe time, as well as the exteriors. The actors did a good job depicting\ntheir characters, especially I would like to point out the performance\nof Christian Bale. <br><br>The movie is fully complete, doesn't require a sequel. Such movies are\na very rare thing and are definitely must-watch!<br><br>10 out of 10!\n"},
{"review": "\nWhat sets Nolan and this film apart is the content of this film, not\nthe acting (the only weakness being the Scarlett Johannsons accent,\nwhich is easily overlooked) and not even so much the story (which is\nalso quite good). The story is okay, but what really took my breath\naway was the atmosphere (much like in Memento). He creates the perfect\natmosphere for his movies, his style is brilliant. The shots are just\ngorgeous. In my opinion he is leading the charge in giving movie-goers\na different experience; watching a Christopher Nolan film is a hugely\ndifferent and a much more absorbing experience than nearly any other\ndirector. Well, for me anyway, obviously the experience is a hugely\nsubjective thing.<br><br>This film is special. There are no real good guys, no real bad guys,\njust human struggles with that hedging of the supernatural that really\ngets you thinking. His films are not perfect in that they don't fit\nmolds or answer all the questions. That is what makes this film\nspecial, it draws you in and really makes you question things;\nimportant things.<br><br>However, the important thing is that it is a truly absorbing\nexperience, what more can you ask of a film?\n"},
{"review": "\nI think this is one of the all time best movies. I just happened to see\nit recently after I saw the first two of the Batman trilogy to\nunderstand the third, after I saw what Christopher Nolan had done with\nthe Batman Trilogy! To remember each detail, to connect it so\nexquisitely, to utilize each character so perfectly, to show vengeance\nand yet to show humanity through vengeance and to create the\nsitting-on- the-edge-of-the-seat experience, is an act of genius. <br><br>Be it the main stars Christian Bale, Hugh Jackman, the ever-brilliant\nMichael Caine, Rebecca Hall, Scarlet Johansson, and Piper Perabo or be\nit somebody like David Bowie or Andy Serkis, the utilization of the\nrole and portrayal of emotions be it anger, love, joy, intimacy or\nhumanity is brilliantly crafted. <br><br>Each twist is beautifully crafted delving into the details but not over\ndoing. Although the story constantly switches between present and the\npast, the viewer is never lost as Christopher Nolan puts it all\ntogether so exceptionally well. <br><br>The entire movie is built around the cool, composed but wizard-type\nportrayal of Christian Bale vs a 'plagiaristic' Hugh Jackman with the\npure obsession of being the best and to do it the villainous way. <br><br>Too bad that nobody won Oscar for this movie. But 2006 had some really\nclassic movies. The Prestige is a must-watch!\n"},
{"review": "\nwow. how did this slip so far under the radar for so long with so many\npeople? the Oscars ignored it, audiences ignored it, i don't get how!!!\nthe story has more twist and turns than if the usual suspects had a\nthree-way with the 6th sense and se7en. the way you're rooting for hugh\njackman's character then you're neutral then you're rooting for\nChristian bale's character then back again... it never stops!!!\nfantastic performances by everyone as well... bale as the better\nmagician with the lousy showmanship, jackman as the man out for revenge\nwho will stop at nothing to learn the other's secrets, caine as the man\nconstantly finding out the type of men he's been dealing with. it just\ndoesn't get any better. chris nolan you are a god.\n"},
{"review": "\nA wonderful, dense, entertaining and shocking film. In a way it defies\nanalysis (there's manicured irony in using Thom Yorke's 'Analyse' as\nthe song under the credits). It's part Gothic horror, love story,\noccult sci-fi thriller... the plot hangs together despite its many\nsleights of hand but quite how it remains so utterly compelling is a\ndifferent issue.<br><br>I think it's largely to do with the acting from an extraordinary\ndiverse cast. A (cockneyfied) Bale and Jackman head the cast which\ntakes in cinematic aristocracy old (Caine) and new (Johansson), untried\n(Rebecca Hall) and cult (Serkis and Bowie). There are no weaknesses.<br><br>But then I suspect that Nolan has an auteur's grip over the project.\nThe editing is exact and deftly directs the audience to where he wants\nthem to look. The script is what is being delivered - sometimes a\nlittle too softly in the mix from Bale, my only gripe - and the film\ntakes no indulgent turns over its fleeting 2 hour span. It's a movie of\nhigh craftsmanship. 8.5/10\n"},
{"review": "\nIn the end of the Nineteenth Century, in London, Robert Angier (Hugh\nJackman), his beloved wife Julia McCullough (Piper Perabo) and Alfred\nBorden (Christian Bale) are friends and assistants of a magician. When\nJulia accidentally dies during a performance, Robert blames Alfred for\nher death and they become enemies. Both become famous and rival\nmagicians, sabotaging the performance of the other on the stage. When\nAlfred performs a successful trick, Robert becomes obsessed trying to\ndisclose the secret of his competitor with tragic consequences.<br><br>\"The Prestige\" is a great tale of rivalry, obsession, revenge and\nsacrifice. The unpredictable screenplay has many twists, disclosing\nunusual situations and hooking the attention of the viewer until the\nvery last scene. Christopher Nolan, after the masterpiece \"Memento\",\noffers another excellent movie for the cinema lovers, better and better\nthan the Oscar winner \"The Departed\". The amazing dispute between the\noutstanding Christian Bale and Hugh Jackman is supported by the\nextraordinary Michael Caine and a wonderful cinematography. My vote is\nnine.<br><br>Title (Brazil): \"O Grande Truque\" (\"The Great Trick\")\n"},
{"review": "\nNow this was a movie that made you stop and think and then think again,\nand then go buy a ticket to watch again and think. Most of the people\nin the audience looked stupefied at the end of this flick. No greater\ntribute can be given for a movie based on magicians, magic, and science\nfiction. This is every magicians dream and to do it through the cinema\nis quite a trick in itself. The performances are excellent and\nChristian Bale as always is the character in life and breathe. Hugh\nJackman is so turning out to be more than an eye catcher and can act in\nthe most excellent and gentlemanly fashion. Michael Caine.......when\ndon't you turn in an awesome performance. Scarlett Johanson does an\nexcellent job and surrounded by such thundering performances, how can\nshe not excel in the pouted way of hers and it is put most excellently\nto use in this movie. Take the rabbit out of the hat and take a bow,\nthis was definitely a magic trick of a movie.\n"},
{"review": "\nThis movie had the potential to be excellent. Great setting, great\nacting, great potential for a twist. However, though this might have\nbeen easier to hide in the book, the \"twist\" was too easily foreseen.\nThe first glance at Fallon, and I said \"hey that looks like Christian\nBale,\" but wrote it off as coincidence. However the second time we\ncaught a glimpse of this mysterious character, I figured out the\n\"mystery\". An undeveloped character with a beard, lowered hat, and\nobviously disguised? Hmm. I could tell his eyes were Christian Bale's\nfrom the start. And as the movie dragged on, with this character\nspeaking no lines, it only proved the obvious. Fallon is Borden's\n\"double\" (twin) with makeup and fake facial hair. He is too\nunderdeveloped, mysterious, and quiet to be anything else. And he just\nplain looks like Christian Bale! (minus the fatter cheeks from the\nprosthetic.) The clues stacked up too high throughout. How certain\nlines to Fallon were worded. His role in the family. The altering\npersonalities of Borden. There was no surprise when Fallon took of the\nmask and shot his rival. So much for the crazy twist.<br><br>Though there were some smaller more interesting twists, and the movie\nwas well-done, this ruined the big surprise for me. <br><br>Also, after developing this great theme of clever outsmarting of your\ncounterpart through illusion and skill, the ending is left to science\nfiction? Sigh. I wish it wasn't real this time, I wish it was some good\nmagic.\n"},
{"review": "\nAuthentic tricks , Shallow deaths, deadly secrets, a twisted plot and a\npainful obsession. Once again Christopher Nolan has brought us another\nsensational film. I just recently watched this movie and felt the need\nto watch it a second time. In this dramatic thriller Alfred Borden\n(christian Bale) and Robert Angier(Hugh Jackman) try to discomfit each\nother in becoming the better magician. Robert Angier started off as\nbrilliant as Berenice but then towards the end of the film became\nmalefic. You will descry shocking conclusions about these characters.\nThe complex plot twist makes this film even better in a way that leaves\nyou wanting more. Christian Bale and Hugh Jackman did a fabulous job\nplaying their roles.The way how everything is filmed just compels you.\nYou may have to watch the movie again to have a truly better\nunderstanding of what has happened. I strongly recommend this brilliant\nfilm.\"Abra Cadabra\" -tasha\n"},
{"review": "\nThis is a very good example of Hollywood spending a lot of money on\nstars and directors to try to make a great, deep movie, and failing.\nThe \"art style\" editing, cutting scenes back and forth in time, trying\nto make the story, cut up, seem deeper than it is.<br><br>Why is he in Denver, where is Tesla, why is Scarlet Johannsen even in\nthis movie, who cares about the surprise ending (and who believes\nit?)?? These are all good questions that we scarcely care about. Just\nlooking at my watch waiting for it to end.<br><br>The actors are good, but you actually need an interesting story to\ntell. A similar period (Sherlock Holmes' London) is done much better\nwith the Downey/Law flic just out. For this one, don't see it in a\ntheater, don't pay to rent it, maybe watch it if someone lends you a\ncopy or you are huge Hugh Jackman fan, otherwise, save your energy.\n"},
{"review": "\nTHE PRESTIGE<br><br>I am a fan of Nolan's direction and it is because of this film. The\nstory-line of this movie is simple but the way of showing it to the\naudience is brilliant. This is the kind of movie that will make you\nwanna watch it twice. It is about two friend who turns into rivals due\nto an uncertain situation. It will make you think that Christian is\nright but then you will think that Jackman is right and this will go on\nand on and the movie lets you decide who is right and wrong because\nthey are drunken in vengeance and their ego is way too much to\nunderstand or know what they are doing or where this is going or what\nmight actually happen which leads them to horrible situation and\nconditions where there is no turning back. <br><br>One should watch this movie before dying.\n"},
{"review": "\nChristopher Nolan, the co-writer/director, loves to over-complicate his\nfilms a lot, especially in his twists in the endings, and counts on the\nsimplicity of the masses to get confused and be called a genius despite\nfailing to deliver in his films' ultimate goals: the twists at the end,\nbecause most of his films rely on those heavily to be given any meaning\nor quality at all. In this fairly long-running drama, Bale (as usual)\nand Jackman produce high quality performances, and special credit given\nto Bale's wife in the film and David Bowie (who can really act !); in\nan otherwise strong cinematography flick. The main issue is that the\nfilm builds up a great momentum, with lots of twists and turns, but as\nwe're held in suspense for the grande finale at the end, lots of if not\neverything that's been mounted before seems to crumble as we discover\nthe truth unfolded in the dying, yes *dying*, moments of this\ndisappointment. It's like the end discredits everything that's been\nbuilding for long chunks of Nolan produce, like the film shoots itself\nin the foot (or in the head ?). Too bad. This feels like a great, but\nit surely isn't.\n"},
{"review": "\nIf you are a fan of surprises, twists and turns then this movie is for\nyou. The movie in itself is magic. You couldn't predict the next two\nscenes if you tried. <br><br>A classic Christopher Nolan piece with Christian Bale and Hugh Jackman\nat their very best. In my opinion Nolan should have clinched an Oscar\nfor directing this film as his interpretation of the novel was\nfantastic with his usual awesome add-ons of course.<br><br>Another reason why i rated this movie 10/10 was because of Bale's\nsublime performance. He has collaborated with Nolan on previous\nprojects and i have enjoyed every single one of them. I would\ndefinitely recommend this movie to anyone who loves suspense as there\nis a lot of unpredictability in here.\n"},
{"review": "\nThis has got to be one of the best movies ever made that looks at the\nlives of illusionists and the great pains they have gone through in\ntimes past. The Prestige has an amazing and talented cast, with\nChristian Bale, Hugh Jackman, Michael Caine, Scarlett Johansson and\nRicky Jay, all putting in terrific performances, playing their roles\nperfectly. Also, how awesome was David Bowie as Nikola Tesla, what\nperfect casting on Nolan's part. Speaking of Nolan, I have yet to see\nhim make a bad movie, in fact, his movies just keep on getting better\nand better. Between the awesome script both he and his brother wrote,\nand the breath taking cinematography of Wally Pfister, Prestige is\nutterly perfect. And what an ending, it made want to watch it again\nright away, just incredible. 5 Beards Out Of 5 Check out my video\nreview @ https://www.youtube.com/watch?v=ZS19QL3VAkk\n"},
{"review": "\nIf anyone was given a chance at making this movie, I can assure you no\none would come close to what has been done. <br><br>Christopher Nolan, well known for his Thriller movies with a 'unique'\nstyle of film-making has done justice to this script by directing it to\nthe best of his abilities. His 'suspense' mechanism which gradually\nbuilds up in the film and leaves viewers baffled towards the end has\ndone wonders yet again. Without spoiling too much, I'd say that the\nfact that the multiple twists in this plot made the movie even more\nexciting to watch. Every scene was shot perfectly and the closing scene\nbrings goosebumps to anyone's body.<br><br>A must watch, if you love Thriller-themed movies with amazing plots.\n"},
{"review": "\nI really have no words to describe it. One of the best movies, I have\nseen till now. The tough to understand plot, so dynamic storyline, too\nawesome performances by each of the actors and actresses, the rhythmic\nturn of events,slow and steady pace and what not. Everything has been\nexecuted so perfectly. The storyline is so scattered yet so well knit.\nAll the scenes, starting from beginning to end, unfolding series of\nevents, the take overs through diaries, the flashbacks, even the last\nscene, it's marvellous. I am not being able to define the awesomeness\nof this movie, through words. In fact, words aren't enough. For people,\nwho mistakenly by chance, go through my review, just one word: \"Watch\nthis movie, before you die. Else you are gonna die a looser\".\n"},
{"review": "\nBatman, Wolverine, and Alfred do magic. Wolverine's wife dies and he\nblames Batman. So Batman goes off and starts doing his own thing and it\nbecomes a big rivalry between Batman and Wolverine, probably because\nAlfred decided to hang out with Wolverine. So Batman and Wolverine keep\none-upping each other and Wolverine shoots off two of Batman's fingers.\nThen Wolverine hires The Black Widow to do some spy stuff but she\ndouble crosses Wolverine and falls for Batman but Batman is already\nmarried to former Iron Man booty call Maya Hansen. Batman's wife finds\nout and kills herself. Meanwhile, Wolverine got really messed up\nbecause Batman sabotaged one of Wolverine's tricks and now Wolverine\nlimps around. Black Widow brought Wolverine Batman's diary but it was a\ntrick but Wolverine didn't know and then Batman tells him a secret and\nso Wolverine goes to America to find Ziggy Stardust. Ziggy Stardust and\nhis assistant Gollum build Wolverine this crazy device that makes\nclones or something and Wolverine uses it to become the super awesome\nmagician and then Batman tries to sabotage him and gets framed for\nkilling Wolverine and goes to Death Row. But it was just Wolverine's\nclone and now Wolverine has Batman's kid but Alfred gets mad and helps\nBatman... except that there are two Batmans and one of them gets hanged\nand the other shoots Wolverine and then goes and gets the kid, that I\nthink is his but it might be his niece... I don't know... Christopher\nNolan needs to stop taking drugs.<br><br>The End.\n"},
{"review": "\nI'd never even heard of this movie when it was shown on TV and only\ndecided to give it a watch after I read that Michael Caine and David\nBowie were in the cast.<br><br>I was immediately caught up in the story line, which is almost totally\nbelievable, considering the function of the Tesla machine this is no\nmean feat of writing and acting. It was totally engaging from start to\nfinish.<br><br>The scene where a young boy starts crying because he believes a canary\nhas been killed is a massive clue to the whole mystery, which is\nrevealed right at the end. This is one movie that I am looking forward\nto seeing again, it's not often one says that.\n"},
{"review": "\nWell at first i wasn't sure about this film, i looked who was in it and\nthought \"great actors, ill give it a try\" and i am so glad i did, it is\nby far one of my best films. It is just twist after twist after twist\nand the film shocks you all the way through. The film itself is very\nclever and well thought out.<br><br>The actors play their part amazingly and perfectly. To be fair the film\n\"wowed\" me, it really did, it was very interesting, had humour too, i\nwas hooked, watching it from start to finish in amazement. <br><br>I hope another film like this comes out soon, i really enjoyed it and\nwould recommend to anyone who loves a film with lots of twists and\ngreat acting.<br><br>9 - 10 / 10.\n"},
{"review": "\nFilm critic Roger Ebert described it as \"quite a movie \u0097 atmospheric,\nobsessive, almost satanic.\"-Wikipedia. So true... I honestly can't\nrecall how many times I have watched this movie, its just that good. I\nnever get bored of watching this film no matter which kind of mood it\nfinds me in. This film should serve as an inspiration for future\nfilmmakers who wish to make intelligent movies that can keep the\naudience entertained as well as thought provoking. This movie is great\nin so many ways that I felt I had an obligation to express my feelings\ntowards it. The acting is great, the directing is splendid, but what\nreally made this movie awesome was it's script. Hats off to the Nolan\nbrothers for bringing us another masterpiece. P.S This review was long\noverdue..\n"},
{"review": "\nAs a Christopher Nolan Fan i must tell you that this movie is a feather\nin a cap for him along with Inception and Dark Knight. <br><br>Absorbing performance from Christian Bale, Hugh Jackman and Michael\nCaine. The movie keeps you guessing. You think he wins it, no he\ndoesn't, oh again he does it but he didn't. It was a spectacle for me.\nThis movie tells us human life is simple with no magic but when you do\nsomething tricky people wonder about it and appreciate it. Same thing\napplies for this movie. This movie just more personifies Nolan's\nDirectorial talent. Expects him to give equally more good movies. <br><br>Hats Off......But how many....you will know it when you watch it.\n"},
{"review": "\nThe film has a pace to it which is satisfying and enjoyable, and it is\nfast to take off. The complexities of the story are involved from the\nword go; as the film begins at a stage just moments from the\nconclusion, when characters have already been defined, and the plot\nfully explored. It then progresses to the past, and, narrated partially\nby a friend of the two magicians (Caine), the story of how the men came\nto be where they have just been shown to have ended up is told.\nAlready, you have been privy to scenes which are, though not entirely\nunderstood by you (as the lead-up to these scenes has not yet been\nviewed); they are still pleasantly electric and exciting. As you start\nto see more of the past, and to know the characters and their stories,\nyou begin to feel anxious for the future of these people, watching with\nthe fervent hope that all will turn out as it should, but knowing from\nwhat you have already seen that this is not so. You are, in this way,\ncaptured by the story from the moment it begins - caught up in the\nsuspense of a semi-revealed outcome and the lives and feelings of a\nmultitude of characters. Such interlocking of the story continues\nthroughout the entire film, as flashes of the present are coupled with\nthose of the past, and the truth can only be yearned for.\n"},
{"review": "\nWithout any doubt this movie comes in top 10 best movies I have ever\nwatched in my lifetime till date and It will surely be for a coming\nlong time. Nothing of this tale left you unsatisfied or bored at a\nsingle second. Truly a masterpiece to must have in one's video library.\nhats off to all the team! Human emotions represented at most vibrant\ncolors and zest of passion of one's mad obsession. Another aspect which\ndrives this movie more near to my heart is the Scientific historical\nfacts used as baseline of story. Magic is not just a game but a way of\nlife. I have watched it numerous times and still it keeps its freshness\nalive every time I repeat it. Christian bale has surely discovered his\nbest acting career through this movie. Each and every character of this\nmovie is just awesome!\n"},
{"review": "\nThe prestige is awesome. I have to say this is one of the best movies i\nhave seen. You couldn't ever imagine what will happen in every scene\nbecause we must think a little bit hard. This movie has a lot of\nsecrets. I love one sentence in this movie. \"Now you're looking for the\nsecret... but you won't find it because you're not really looking. You\ndon't really want to know the secret... You want to be fooled. \" The\nacting from all actors, especially Alfred Borden(Christian Bale) &amp;\nRobert Angier (Hugh Jackman) are very good, they compete each other to\nprove who is the best magician and make a new trick in every scene. I\nthink the prestige is one of Nolan's best movies.\n"},
{"review": "\n... but after watching it quite a few times I have to honestly say\nsomething is missing for me. I remember watching it for the first time,\nI was quite impressed by the story, the way it was built up and\ndelivered, the cast and the acting, and basically everything about the\nmovie. I think the point where it becomes a little too much is towards\nthe end of the movie. Without giving out spoilers I can say that the\nending is something you would expect but is still shocking, although by\nthe time it arrives you already know everything that's going on and\nthis way it doesn't hit you as hard as it should. I have to absolutely\nmention that I liked everything about this film and I still love and\nwill always love this movie. But my mind just doesn't want to settle\nwith a ten for some reason.\n"},
{"review": "\nThis Prestige is about two magicians whom have been friends and co-\nworkers in the past, but this rivalry begins with the two and ends up\ndestroying their friendship. Magicians are known for scamming the\naudience into believing something that's not real. Well, that's exactly\nwhat the Prestige delivers.<br><br>Hugh Jackman was outstanding as this irritated, fixated magician\ngaining back his life by revenge. Christian Bale was just as impressive\nas the baffling and mysterious showman. The rest of the cast ended\nbeing acceptably and well done as their characters<br><br>Christopher Nolan in fact has a contribution at directing. The way this\nfilm delivers the scenarios between the different places and times is\nwell done and smart. It is a possible to some viewers that the film,\nPrestige, will leave the viewers confused, and might not actually like\nit, but there will be others who will enjoy the film entirely and be\nadored by it. It is not for everyone. The film remains into this world\nof presumption the entire time until the end. It will keep the viewer\nguessing and wondering what's going to happen next. <br><br>The script, acting, surroundings, support, and everything were a\nsuperb.\n"},
{"review": "\nWelcome to the ultimate cine-magic trick! Encased in the late 1900's\nwhen \"mans' reach exceeds his imagination\" competing magicians enter\ninto each others escalating tricks and entangled traps. But how willing\nare they to get their hands dirty and do they have the commitment that\nis required to pull off the trick? The films' darkness is appropriate\nas Christopher Nolan maximizes the story, while his cast and spins his\nseduced audience. It's difficult to not get reeled in by the storyline\nand we are even told the tricks, but the astonishment of the prestige\nstill amazes! The film begins with the line,\"Are you watching closely?\"\nand yet when it's all over you will need to ask yourself the question\nagain and again!\n"},
{"review": "\nThis is so far the best movie I've seen in my life. I watched this\nexpecting it to be a decent movie, but it wasn't, it's the BEST, in my\nopinion! IMO, it's also too underrated! I won't add a lot of\ninformation, but if you haven't seen this movie yet, and are reading\nthese reviews first, and/or if you like magic, fantasy, and suspense\nthrillers, watch this movie ASAP. You will not regret it. It's worth\nit! By the way, make sure you don't read the plot/summary AT ALL. Even\nif you read a single line by mistake, it may be the suspense and you\nmight spoil the movie for yourself! Also, make sure you watch this\nmovie in complete silence. It's quite complicated, but trust me, don't\nstop! Continue watching it. It's honestly not a movie to watch on a\nparty etc.\n"},
{"review": "\nSorry for the review, but I am not English so there are some mistakes I\nam sure. :) What I wrote in the summery is true in my opinion. It's\nsure that this is one of my favorite movie. I think that was the\nbiggest fail of the year that the actors and the director got nothing\nin the Academy Awards. And I can't imagine which movie was better than\nthis in 2006? Because 2006 was one of the worst year in the film\nindustry in my opinion. I remember just for a few good movie. I\nrecommend the movie for everybody who like to think and not just\nwatching the explosions (which I like, but this movie is about\nsomething else). It wasn't long for me, I think this is the kind of\nmovie what I would call \"a perfect one\". I don't think that everybody\ncould write a better \"Prestige\" then this. The sound effects and the\nmusic created a very good and formidable atmosphere. Oh and my favorite\ncharacter was Tesla like in science. He was really one of the best\nscientist who ever lived, maybe better then any one else, but I don't\nwant a debate about this. These are just my opinion. 10/10 More movies\nlike this!!!\n"},
{"review": "\nThe prestige is very glamorous movie.You can not understand it first\nwatching.You must be very clever.So you must be very careful while you\nwas watching the prestige.The movie is telling two young\nmagicians;Robert Angier and Alfred Borden.They want to be\nwell-known.Angier's wife Julia Piper Perabo dead in their show so\nAngier thinks, responsible is Alfred.Then,they will be enemy\nlifelong.They will want to bad other one.I think,you should watch this\nmovie with somebody because you can take the other one's idea.If you\ndidn't watch the prestige,you would watch this movie.The movie has a\nlot of secret . You should find them because if you find them you will\nbe happy .\n"},
{"review": "\nWell, I don't know in what mood to be when I think of that film i\nwatched. Generally, it's good film, but it has too much torn offs. I\ngot bored of them... And though I hate Jackman, I accepted to watch the\nfilm. Bale is perfect actor, and if there was some other actor playing\nhis role, the film would be crap! O, and by the way, Nikola Tesla did\nnot have different eyes color. David is a person who must be respected,\nI agree, but he was positively funny in Nikola's role! Nice film, but\ntoo much bulls... in it! Sory to all fans, but, I gave just 7! Cheers\nAnd I have to have 10 lines, but my comment is always short and clear,\nso this last sentence is less sentence like ;)\n"},
{"review": "\nA great film, if a little predictable, which is only slightly spoilt by\nan ending which is 'somewhat' unbelievable.<br><br>However the acting is great - Bale and Jackman are very good (Oscars\nnominations should beckon for both, although in my opinion Bale does\nsteal the edge). They are excellently backed up by Michael Caine (who\nis as always great in films that he wants to be great in, and this is\ndefinitely one of them!).<br><br>A film which I have recommended all my friends to definitely go and\nsee, if only to see if they guess the Bale twist as soon as I did.<br><br>In summary, it is good Saturday night out stuff.\n"},
{"review": "\nJust in case the reader of this review has not watched this movie\nsomehow. I've included no spoilers. I just watched The Prestige again\nnow some 8 years later after its original release with some friends.\nEven though I still remembered a bit of what to expect in this\ntwisting, turning show. Was still blown away by this first rate movie!\nMy friends who were privileged in it being there first viewing. Had an\neven more high tend experience as the credits rolled. <br><br>Yet because its such a well done show. In its direction of story,\nscreen play, and acting. It all comes together to make a timeless\ntreasure! A movie your going to enjoy again and again. Its movie magic\nand will entertain people forever! Don't miss out on this movie. This\nis why movies are made.\n"},
{"review": "\nI think this film is a vastly under-rated feature and is one of Nolan's\nbest in terms of the narrative and plot. The film is great in that it\nkeeps you thinking throughout with it's woven non-linear structure and\nthe cast that are in the film seem perfect for their respective\ncharacters, the film charts the personal and professionally rivalry\nbetween two magicians in the Victorian age with each ruining each\nothers performances in a different number of ways before building up to\nit's twist of a climax, Michael Caine plays his role well as the\nfatherly figure for Algier (Hugh Jackman)whilst the leading cast play\nit well as two men obsessed with topping the other as things take a\nturn for the worst the more the film plays out, for me Bale's character\nBorden is the better of the two but Jackman still puts in a great\nperformance.\n"},
{"review": "\nWarning!!! Contains LOT's of spoilers!<br><br>So yesterday's evening on TV where running this movie called The\nPrestige. Before movie I sure checked it on IMDb and saw that is has\n8.4 and it has won 2 Oscars. That sure made it worth watching.<br><br>Evening came and movie started. I played Splinter Cell Conviction and\nactually weren't in a mood for watching a movie (now thought that I\ncould exchange this movie for SC:C just horrifies me...). First 20\nminutes of movie passed. I weren't paying too much attention to movie\nand didn't understood what's going on. Then I stopped playing SC and\nthought : \"That's all! Let's watch movie.\"<br><br>It wasn't easy to understand what's going on but slowly I managed to\nput everything in places. After all I missed only beginning of movie.\nAs I watched movie I became pulled into movie even more. It was amazing\nto watch those two Illusionists battle with each other, their tricks,\nacting in home life and other stuff ( Thank you Jackman, Thank you\nBale... You made my evening!). They went even further in their\ncompetition, using more unfair methods. I were completely pulled in\nmovie. Movie's storyline was one the best I've seen lately. And then\nthe ending come. The best part. I were totally amazed about Angier's\nand Borden's game in trying to kill each other. How Angier used his\ndouble to send Borden in Jail and how Borden's twin brother sacrificed\nhimself for Borden. <br><br>In the end I can surely say this is one of the best movies I've seen...<br><br>P.S. And as the movie ended, and I sat completely stunned tit res\nappeared and I firstly saw Nolan's name. A smile showed up on my face.\n\"Of course. Nolan. Who else?\" Was my first thought.\n"},
{"review": "\nGreat movie!!! .. or so I thought. Christopher Nolan is a good\ndirector. Not a great one, but a good director. This, and other works\nof his, prove that.<br><br>6/10 may be my fault since I raised my expectations quite high for this\none. I heard about it, and decided to delight myself with a\n'masterpiece'.<br><br>To be objective, the film could've scored 7-8/10, but only if there\nwere a permanent power failure in the world and I wouldn't have seen\nthe finale.<br><br>Tesla teleporting hats, cats and people for a living? Come on! That\nmeans that Friedrich Nietzsche was selling donuts to buy Jaguar wheels.\nThat was disappointing.<br><br>I understand that film is 90% fiction, but Nolan, next time stay away\nfrom putting real (historical) figures do some fictional facts. Nobody\nlikes it.<br><br>The other 99% of the movie, is filled with thrill, a great plot, some\ngood situation turns and such.<br><br>I really couldn't say that I wasted 130 minutes of my life. I wasted\nonly 5 with this movie. Even the credits were more interesting than the\nfinale.<br><br>Tip: If you're reading this and planning to watch the movie, throw soda\non your TV near the end, and don't buy a new one. That way you'll\nreally like this movie! Over and out!\n"},
{"review": "\nUsing advanced storytelling techniques (see the Advanced Screen writing\nClass and the Masterpiece Software) is probably the single best way to\nset yourself apart from the Hollywood screen writing crowd. But this\napproach is extremely challenging as well, and if you aren't careful\nyou can weaken the very story you are trying to showcase.<br><br>In their story of competing magicians, the writers of The Prestige use\na double storyteller. While not uncommon in a medium like the novel,\nthis advanced technique is extremely rare in mainstream Hollywood film.\nStructurally a double storyteller creates two equal main characters.\nWhen you have virtually unlimited amount of time to explore character\n(as in a novel), this isn't a problem. But in the relatively short\ntwo-hour time period you have in a Hollywood movie, it's a huge\nproblem.<br><br>If you add the advanced technique of making both characters\nunsympathetic, you compound the problem even further. Contrary to the\nconventional wisdom, characters don't have to be sympathetic. But they\ndo have to be compelling. By cross-cutting between two main characters\nin the time a writer normally has to define one, these writers make\nboth of their heroes superficial and opaque.<br><br>The great strength of The Prestige is the plot. But ironically, that\nsimply highlights the fatal weakness of the story. This film about\nslight of hand and trickery has plenty of slight of hand and trickery\nin its plot. But without the proper character work, it's all just\npulling strings. By being extra complicated, the mechanics of the plot\nactually become more, not less, obvious. The audience pulls back and\nnotices they are watching a movie.<br><br>Instead of showing us how clever they are, these talented writers show\nus how they have failed in the first job of the writer, to make the\naudience care.<br><br>FOR MORE REVIEWS, please visit www.truby.com\n"},
{"review": "\nThe Prestige is a fantastic film by far. Christopher Nolan has done\nmany fantastic and awesome films. The Prestige is almost as good as The\nDark Knight. The Prestige is on my favorites list as #2 because never\nbefore have I seen such magic. The Prestige is magic in many ways,\neither with magic or it's so good it's magic. I haven't seen such\nfantastic ways of story telling than Nolan's The Presige. The Dark\nknight has the same sort of theme. Also, his other great and awesome\nfilm Memento is very unique. The Prestige has a great cast including:<br><br>Hugh Jackman(X-Men, Swordfish)<br><br>Christian Bale(Equilibrium, The Dark Knight)<br><br>Michael Caine(Sleuth, Miss Congeniality)<br><br>Scarlett Johannson(He's just not that into you, The Other Boleyn Girl)<br><br>David Bowie(Labryinth)<br><br>Scarlett Johannson has a pattern with her film roles. In every film,\nshe plays some sort of skank. In He's Just not that into you, Bradley\nCooper's having an affair with her. In The Prestige, she dumps Hugh\nJackman for Christian Bale. She has a good reason for that though. She\ndoesn't play a skank in every film, but it sure as hell seems like it.\nThe two main characters are Robert Angier and Alfred Borden.\nPersonally, I prefer Alfred Bordan(Christian Bale). Bordan isn't as\nmuch of a prick as Angier(Hugh Jackman). The Prestige has a really\nclever ending and it definitely deserved the best film of 2006 award.\nIt was only nominated for two Oscars. But it really deserved more\nbecause The Prestige is one of the greatest ever.<br><br>The Plot: After a magic trick goes terribly wrong, two magicians become\nrivals. When one of them comes up with a fantastic new trick, the other\ntries to steal it.\n"},
{"review": "\nI really enjoyed this film and Christian Bale turns in yet another\nsolid performance in Christopher Nolan's capable hands. I'll admit that\nit didn't take me very long to figure out most of the Jackman side of\nthe plot but I freely admit that I never considered the 'twins' twist.\nI barely recognized Scarlett Johansson and Michael Caine did his usual\nseamless work.<br><br>I was confused for a bit but when the story threads started to come\ntogether, I began to really get into it. The story was fascinating and\nDavid Bowie as Tesla was an inspired casting choice, adding just the\nright touch of murky mysteriousness. The sets were just awesome and the\ncinematography was spot on, conveying a dark but not oppressive mood. <br><br>I usually judge a film by the impression that it leaves (or doesn't) on\nme hours or even days after viewing it, and this one had me running\nthrough all of the puzzle pieces in my mind for some time afterward. It\nwas dark and somber but not enough to make one feel like it was a\n'downer' experience. It did, however, leave me in a contemplative state\nof mind--and that's a good thing. This was a smartly written, solid\npiece of entertainment on all fronts.<br><br>***-As a side note, I wish that Chris Nolan would get another sound\ndesigner---I'm sick of all of his movies having dialogue that you can\nbarely hear, even with your sound system cranked up, only to have the\nnext scene rattling the windows!***\n"},
{"review": "\nOver the past few years, there have been many movies which proved that\nis possible to combine both action and a good storyline. The Prestige\nis a clear example of that.<br><br>Christopher Nolan has made a very good movie that doesn't get boring at\nany time, and keeps you awaiting for more. The script is great, and the\nacting doesn't disappoint. Christian Bale is definitely the one who\ngives the best performance. Nevertheless, the rest of the cast does a\npretty good job as well. <br><br>It gives a clear definition of what the world of magic is made off.<br><br>If you haven't see it yet, I strongly recommend you to do so.\n"},
{"review": "\ni came across this movie while while looking through shelves at the\nlibrary.i overhead some woman talking about how great she thought it\nwas so i thought i'd give it a try.<br><br>the film was a lot different than i thought it would be,but that\ndoesn't mean i didn't like it.the story kept you confused right up\nuntil the end. the characters we're developed rather well and you could\nfeel the tension in a number of different scenes.<br><br>i really wasn't expecting the movie to end the way it did,because,like\na character thought,it was too easy.if you want a film that is\nentertaining with an original story-line and an allstar cast than look\nno further.the prestige is for you.\n"},
{"review": "\nThe Prestige is significantly brilliant. From the tense acting to the\nbeautiful directing, all the aspects exceed my expectations.\nChristopher Nolan (Batman Begins, Memento and The Dark Knight)\ncontinues to pursue brilliance. And quite literally has reached it. All\nof his films are of such perfection that no other director that i can\nthink of could ever come close. His efforts in creating The Dark Knight\nfor example are beyond anything i have ever seen before.<br><br>Christian Bale (American Phyco) and Huge Jackman (X-Men)both play rival\nmagicians. But when Alfred (Bale) performs the ultimate magic trick,\nhis former friend turned enemy Robert (Jackman)tries to find the secret\nin the trick. Each twist and trick leaves the audience wanting more and\nwhen the credits roll you would feel like this film is deserving need\nof the best picture Oscar. And quite rightly so.\n"},
{"review": "\nWell, what can i say, it was one of the best movies i ever watched.\nChristopher Nolan has always been one of my favorite Hollywood\ndirectors. I have always enjoyed all his movies, whether it was the\nmemorable Memento or the beginning of the new chapter in Batman Begins.\nBut over here, Nolan has managed to portray a fine movie despite making\nsome changes to the original plot by Christopher Priest. Nolan has\nmanaged to pull out excellent performances from Hugh Jackman and\nChristian Bale. Michael Caine, as ever is, dependable on his role as\nthe sidekick. The ending of the movie actually leaves the viewer\ngasping for more. I strongly suggest this movie for viewers to watch.\n"},
{"review": "\nStarring Christian Bale, Hugh Jackman, Michael Caine, Scarlett\nJohansson, Rebecca Hall, Andy Serkis, Piper Perabo, and David Bowie (as\nNikola Tesla). Well\u0085 you thought \"The Sixth Sense\" had twists and\nturns? Not compared to this one! It's the late 1800's. The next\ngeneration of stage magicians is coming \u0096 and they are VERY\ncompetitive. Two are near the top, and keep trying to out-do the other\nfor top position. Then things get out of control. This is SO much fun,\nand the complexity is so finely structured, you finally just sit back\nand let yourself go for the ride. Think roller coaster that keeps\nshooting past the starting gate for another loop. \"The Prestige\" has a\nsub-story, and that is of the inventor Nikola Tesla, whose biography I\nrecently read. You will enjoy knowing that ALL the inventions and\nevents depicted for Tesla were TRUE \u0096 until you get to the final secret\nrelated to the top hats. That's all I'll say. This was an exhilarating\ncat-n-mouse-n-mouse-n-cat-n-mouse story.\n"},
{"review": "\nThis is the best film i have ever seen. It's simply awesome! <br><br>When i was watching this film, i couldn't stop myself, even i wanted to\ngo to the loo. <br><br>There's no doubt that everyone will love this film.<br><br>\"Now you're looking for the secret... but you won't find it because\nyou're not really looking. You don't really want to know the secret...\nYou want to be fooled. \" <br><br>I love this sentence very much, it includes all the summary and plot in\nthis movie. <br><br>There's a lot of twists and turns, you can't believe what you've seen,\nthe answers are always different to what you've think of....\n"},
{"review": "\nWow. I heard from this movie right after I heard Edward Norton was\ndoing The Illusionist. As a huge fan of magicians, Edward Norton and\nHugh Jackman my day couldn't possibly be better. I just had to see\nthese movies.<br><br>First I watched the Illusionist. It was completely different than what\nI expected, but it was quite a nice movie. The Prestige however was\ntotally as I expected and was absolutely perfect. The atmosphere it\ncreated was just wonderful.<br><br>The plot twists this movie has are just genius. Every time you think\nyou understand whats happening, the plot twists and you have to think\nit all over again. That's, I think, the strength of this movie.<br><br>The performance of the actors was great, but thats not surprising when\nlooking at all the big names \"Hugh Jackman, Christian Bale, Michael\nCaine). They all are very convincing in their role and I think they did\nan excellent job.<br><br>Also the end is very satisfying. It ends very mysterious and you really\nwant to know what's going on.<br><br>I recommend this movie to anyone who loves a great movie. This is\nsimply one of best.\n"},
{"review": "\nI think Maybe, because of all the positive reviews on this movie.I\ncouldn't wait to see it.My wife didn't like it.To many twists for her\nto follow.I didn't like the heavy accents,at times hard to understand.<br><br>I didn't think there was much magic either,not like the illusionist.I\nthought was so much better.<br><br>We never knew why he would keep using someone that screwed him so much\nor the girl either? It didn't make a lot of sense and the ending was\nsorta dumb.The guy got hung for something he didn't do. Oh well goes to\nshow you don't believe what you read.<br><br>I think the emphases should have been more on the stealing of secrets\nwhich was OK,And a lot more magic.One minute they were dirt poor next\nminute rich?I didn't like the hurting aspect of the grudge.ruin each\nother OK,shooting one not so cool\n"},
{"review": "\nChristopher Nolan directed seven films so far, and The Prestige is his\nworst one. It's not necessarily bad though. The Prestige is typical\nNolan filmmaking. There are no notable performances even though the\ncast consists of some of the most famous actors working today. Only\nDavid Bowie and Hugh Jackman make somewhat of an impression. The film\nis heavy-going and long. Nolan continues to aim for the noir look, but\nhe can't capture it well in his film projects. So the film ends up\nbeing too dark and somber for its own good. The ending is meant to be\nclever, but with Nolan's direction it doesn't feel that way. Still,\nit's a solid release overall. There's nothing to distinguish it,\nhowever. Like all other films by Nolan it's overrated. He is not a\ngreat filmmaker. This is a man who's been influenced by Ridley Scott\nand the Wachowski brothers. He rarely comes up with anything original,\nand just continues to copy them. I don't recommend watching The\nPrestige. The magic tricks here are nothing to get excited about. Nolan\nerroneously aims for realism, but this approach leaves a bad taste in\nthe mouth. This is far from being anywhere near Steven Spielberg's\ngenius.\n"},
{"review": "\nThis movie was so good that I bought the DVD and that's something I\ndon't do very often unless that movie has caught my attention, well it\ndid. It was very well plotted and I loved how Jackman and Bale(in the\nmovie) showed their rivalry, it was really believable. My favorite part\nwas when Robert does this amazing trick that is really hard to explain\nunless you've seen the movie. But, they used a person that looks just\nlike him(even though it was really him)I expected it to be kind of\nboring but it didn't bore me one bit. I was interested in the movie\nfrom the beginning. If you haven't watched this movie already,I suggest\nyou find a way and see because you will not regret watching it. I jope\nthat Hugh Jackman and Chris Bale could work together and make another\nmovie because this one was phenomenal! I give it a 10/10! Great Movie!\n"},
{"review": "\nThe Prestige. Where do we begin? Let's name all the good things about\nthis movie: Chirstopher Nolan, Christian Bale, Hugh Jackman, Michael\nCaine, the plot. Despite allegedly being nothing like the book The\nPrestige, Nolan directed a spectacular film. Part of it was how Nolan\nput the scenes all out of order, yet you lost no sense of what took\nplace in what order. In addition, the scenes were in just the order to\nmake you say, \"Wow, that makes total sense now!\" at the end of the\nmovie. For instance, the movie opens with a shot that you don't think\nabout until many scenes later at which point you go exclaim the\naforementioned exclamation. Bale, Jackman, and Caine did stellar\nperformances in The Prestige. Bale masterfully played Alfred Borden,\nthe great magician couldn't book a decent theater, or make his tricks\nlook good. Jackman was incredible as Robert Angier, the not-as-good,\nyet obsessed magician who could make his tricks look like something\nunbelievable. Michael Caine, also did amazing as the illusion engineer\nwho was the source of most of Angier's tricks. The Prestige's plot was\nfull of twists, turns, and parts that made made you say \"Woah.\" Upon\nre-watching the movie, one notices that the script is riddled with\nhints that reveal the end. The plot contains a bitter rivalry, revenge,\nand things you have to notice to figure it out before the movie ends.\nOnce the ending is revealed, the audience's jaw drops when the end is\nnot what it seems. The cover to the DVD says \"You want to see it again\nthe second its over.\" That's probably the best way to put it. The first\ntime you watch it , you're not really looking for how the story comes\ntogether, you want to be shocked. 10 stars. This movie was awesome.\n"},
{"review": "\nThis movie is an absolute masterpiece of epic proportions. Director\nNolan gives us one of his best directing jobs. <br><br>This movie contains everything from romance to pity, and power to\npoverty. <br><br>Both Jackman and Bale play amazing characters. Bale is power hungry\nindividual who stops at nothing short of owning and controlling\neverything in the world. <br><br>This movie portrays the feelings and emotions of guilt and punishment. <br><br>What is a great story and gripping account of what happens when dreams\nturn into nightmares.<br><br>This is so much better than 'The Illusionist'<br><br>I also love the lack of profanity.\n"},
{"review": "\ni start by giving it ..nothing less than 10 ......it deserves it\n...anyway <br><br>this movies is scripted beautifully,has a sense of mystery and clever\ntoo because it has to cover many sub plots also,and the writer is\n..more than successful in achieving it.The dialogs and the\ncinematography of the scenes with long shots is fabulous in all senses.<br><br>The story takes away the show by some extraordinary twists and turns\nand a strange flow of its own kind.And apart form the huge twists one\nafter another,they are stated in such manner that people can also\nbelieve them at the time they come crashing there brains....!!<br><br>Coming from one of the best directors today ..The Prestige is indeed\nprestigious,and by far one of the greats of all time ..and deserves a\nplace at least higher to No Country For Old Men..in the 250 chart.<br><br>At last i recommend it strongly to....own a DVD of this movie...if you\nlike content full films of any kind ........you will not be\ndisappointed at all.....<br><br>sit back...and let the magic fascinate you ....... and you will leave\nwith long lasting effects ..of disbelieve and pleasure ..........<br><br>hats off or this one ....\n"},
{"review": "\nI've just watched The Prestige and thoroughly enjoyed it.<br><br>I've always had a fascination for stage and street magic - not so much\nto \"figure out the tricks\", but with an appreciation of the\ncombination, of stagecraft, misdirection, and sleight of hand. The\ngreat magicians aren't remembered for \"clever tricks\" - rather, for the\noverall entertainment, for the illusion.<br><br>And this film is perfect for all that. There is a mystery to it (in\nfact, at least two mysteries), but the clues to each are telegraphed\nall throughout the film, in plain sight. You have to watch and be\nalert.<br><br>I figured out one of the mysteries in the middle of the film, but was\nstill fascinated by how it was done. I think this is the same thrill I\nget when I'm watching a film about con artists (or a good episode of\nthe old Mission Impossible), because what is shown is not always what\nis.<br><br>And as this film explains, it's not how such things are done that\nmatters (because once it's explained, no one cares any more), rather,\nit's that creation of illusion so that we have \"mystery\", that does.\n"},
{"review": "\nAt one point in the film, Hugh Jackman's character says \"That was the\ngreatest magic trick I've ever seen.\" I walked out of the theater\nthinking the same goddamn thing! This whole movie is just one big trick\nthat the filmmakers have pulled on you, and by the time it's over,\nyou'll realize that you just spent a couple bucks on a huge, two-hour\nmagic trick. This may be my favorite movie ever. Just when you think\nyou know what's going on, something else happens! It is very, very\ncomplicated stuff. There are flashbacks upon flashbacks, and it may be\na little difficult to follow. Acting a key element in this film, and\nit's mostly great. Christian Bale carries it all on his shoulders, as\nhe truly is the \"Prestige\" to the film's great rick, which I will not\nreveal. Hugh Jackman is good as the magician who grows mad with power,\nbut Bale far surpasses him. Michael Caine is as memorable as always,\nbut he's essentially playing a harsher version of the character he\nplayed in \"Batman Begins\". One of the best performances comes from\nRebecca Hall as Bale's wife, who becomes confused and depressed after\nhe loses his former glory. Scarlett Johannson isn't really offered much\nto work with but she does have a few memorable moments. The films final\ntwists and turns will leave you so shocked that you realize everything\nyou were going to say you hated about the movie, you now love. See this\nmagic trick. It's very dark and depressing stuff, but you know that you\nwant to be fooled.\n"},
{"review": "\nthe prestige is the one of the best Hollywood movie i have seen.t2 and\nrocky balboa were my previous favorites. This movie is a pure\nmasterpiece.It has the best screenplay and individual performances.\nChris bale continues to impress again....Chris Nolan is such a amazing\ndirector,i cant see anyone else directing this movie to such\nperfection...This film cant be remade anywhere else... One who did not\nget he hang of the movie the first time,has to see it again...you will\nbe amazed.. I cant imagine how much time it took to write this\nmagnificent script,its just top notch..This movie is way better than\ndeparted or some other 2006 movie,it should have got an Oscar 100/100..\n"},
{"review": "\nIt's a long time since I saw a film where I was so hooked on the story.\nThe Prestige has a plot so full of twists and turns it merits several\nviewings - and even then there will be arguments over who did what -\nbut I can honestly say that it is so engrossing that I enjoyed every\nminute of it again and again. What I really admire is the way\neverything - every word spoken, every action - was linked throughout\nthe story. Nothing is wasted.<br><br>I have seen the film criticised for being too cold and calculating.\nMaybe some of the characters come across in this way, but this isn't a\nfilm that wears it's heart on it's sleeve. It's not a romance. I think\nit goes deeper than that and asks questions about life and what we\nthink are prepared to sacrifice.\n"},
{"review": "\nThe Prestige sees two rivaling magicians, Borden and Angier, in an\nintensive battle of wits that goes so far that their lives at stake.\nThe two are portrayed by Christian Bale and Hugh Jackman who deliver\npowerful performances, supported by an excellent cast of Michael Caine,\nAndy Serkis and, guess who, yep, David Bowie.<br><br>Director Chris Nolan again shows his trademark by going back and forth\nthe storyline as the film progresses, much as he's done with the\ncritically-acclaimed Memento and Batman Begins, which, through his\nskillful execution, is used to tremendous effect. With involvement from\nhis brother, Jonathan Nolan, the duo are able to recreate the suspense\nand complexity as shown in Memento, intriguing the audience as they are\nbrought deeper and deeper into the story.<br><br>This is story-telling at its finest. With a tremendous twist ending\nthat ties up the knots neatly but also leaves out some tiny loose ends,\nthe movie is satisfying but will make you sit through the credits,\nthinking you might have missed something...\n"},
{"review": "\nWhat a movie, it's really one of the best movies i have ever watched.\nIt took to me about 5 hours to finished it, i reversed it many times to\ntry to understand. It deserve an Oscar, there's no more, I LOVE \"THE\nPRESTIGE\". It is very helpful to get comments of many people who likes\nmovies, I watched it around 3 weeks ago and i have not finished to\nunderstand all points, there is a lot of magic. After I red several\ncomments i will watch again, I really want to watch again, maybe this\ntime i will be able to discover all secrets. Thanks to Nolan's for this\nmovie, it makes feel that \"good movies\" does not finish yet.I am from\nMexico, regards\n"},
{"review": "\nA great film!, 7 well earned stars for this movie; this is a little\nbelow the user's ranking, but in my personal standards is very high. I\nrecommend deeply this movie; the way that you get involved with the\ntricks and the engineering behind some great magic shows makes you\nalmost feel like a magician too; all the scenarios and cinematography\nis captivating, and the story keeps you at every single moment deeply\ninvolved with the film. Please watch the film and feel the magic behind\nthe magic, the acting roles are performed excellent, the intensity of\nAngier and Borden is tense and captivating, and the involvement of\nCutter with the tricks is great too, a magical film behind the magical\ntricks of the 19th century entertaining industry.\n"},
{"review": "\nUtterly gripping turn of the century English theater tale. Excellent\nperiod feel, costumes, sets, engaging interplay between all the\ncharacters, pacing, cinematography, all first rate. The audience is\nmesmerized by the magic acts, the romantic entanglements, but at the\nsame time, is left utterly cold by the complete lack of warmth and\nhumanity. This is not a movie for someone looking for a uplifting,\npositive two hours. This movie is devoid of any warmth. There are no\nheroes, no good guys, no role models.<br><br>Scientist/inventor Nikola Tesla, whose work all movie goers have seen,\neven though they may not know it, figures prominently in this movie.\nAmong other things, he invented the Tesla Coil, which is frequently\nfeatured in science fiction movies. The coil generates impressive\nelectric displays, like controlled lightning, arcing between\nelectrodes. The main plot of this movie revolves around the use of this\nelectric \"magic\". The movie is not, however, a scientific documentary,\nand the leaps of logic from Tesla's scientific experimentation, to\nmagic tricks shown in the movie, requires accepting highly implausible\nevents requiring much suspended disbelief, but that fact doesn't\ndetract too much from the movie's allure. The magic is well enough\nperformed to be engaging and plausible. You want to believe it. It\nworks. <br><br>The movie doesn't entirely satisfy however. The main thing that does\ndiminish the movie's appeal is the unlikable nature of all the\nprinciple characters. You just can't \"like\" them, any of them. <br><br>The movie well worth seeing however. Just don't go when you're in a bad\nmood already. This movie will only make it worse.\n"},
{"review": "\nAs a former professional magician, the concept of this movie is close\nto my heart. It was fun seeing Ricky Jay, a real magician, playing a\nsmall part. Equally fun was the faithfulness with which most of the\nmagic was presented. Rather than stoop to the level of camera tricks,\nthe magic presented is the same as it would be presented by any modern\nday magician.<br><br>Similar to \"Memento,\" this movie skips about in the time line where\nsome information presented earlier makes more sense later when you see\nit in context. Be prepared for rather plodding plot more in keeping\nwith the offerings of M. Night Shyamalan with a similar style twisting\nending. Personally, I guessed the ending too early.<br><br>Faithfully reproduces the time period.<br><br>Personally, I think Hugh Jackman (as Robert Angier) and Christian Bale\n(as Alfred Borden) are too similar looking in appearance and demeanor,\nwhich made keep track of who was whom a bit distracting for me.\n"},
{"review": "\nThe second magic related stories to be released in just over a month.<br><br>Christopher Nolan has constructed an elaborate puzzle box of a movie\nthats a really good thriller. This is the story of two magicians who\nattempt to out do each other. The hatred is the result of a tragedy\nthat happened years before on stage. Told in a series of flashbacks the\nfilm is a search for the secret of each man's version of the teleported\nman.<br><br>Superbly acted, this is one of the rare recent films where the actors,\neven when big stars like Hugh Jackman and Michael Caine completely\ndisappear into their roles. Its clear why everyone was involved with\nthis film because everyone gets real meaty roles. David Bowie appears\nas Nikola Tesla and has the best role he's yet to appear in. You really\nmust see this film for the actors if nothing else.<br><br>You have noticed that I'm rather light on details and thats\nintentional. This is the sort of movie that is best taken on its face\nvalue. You'll want to see the twists and turns of its plot for yourself\nand not have them spoiled by reviewers and friends who feel the need to\ntell you too much about the story. What Nolan has constructed is a\ncomplex little thrill ride. What I will tell you is that he does play\nfair, in the end you will know all.<br><br>For me this is going to require a second or third viewing. Its one of\nthose movies where I'm in love with the construction of the film so\nmuch that I have to see it again to see if the thing is as good on an\nemotional level, I think it is but I'm still distracted by the\n\"sparklies\" of the box.<br><br>Go see this film if you like good twisty stories with more than a hint\nof real magic in them.\n"},
{"review": "\nIts surprising how a movie about 2 magicians actually managed to reach\na producers table, but I am glad it did.<br><br>\"The prestige\" comes like a breath of fresh air, considering the\nmediocre fare, us moviegoers are being served these days and as usual\nChristopher Nolan doesn't disappoint. Christopher is quite deftly\ncarving a name for himself among the best directors of this generation\nand has followed phenomenal movies such as Memento and Batman Begins\nwith another masterpiece. There are not many directors who can boast of\nhaving their last 3 movies in the IMDb top 250 list.<br><br>The movie takes on an unusual tale of the story of 2 magicians and\nweaves a poignant drama around it. Full of suspense and mystery.\nWithout revealing too much, I would implore all you viewers to give\nthis movie a dekko, and you will not be disappointed. If the suspense\nof Memento intrigued you, if the dark and poignant drama of \"Batman\nbegins\" thrilled you, then The Presitge, will take over and take you to\na world of envy, jealousy, suspense, drama and yes .. prestige.<br><br>Enjoy!\n"},
{"review": "\nDespite the similarities and the release timing, this movie is very\ndifferent from \"The Illusionist\" in that it is more of a character\nstudy into very obsessive individuals as well as an adventurous,\nexciting and intriguing example of what film-makers can achieve if they\nreally try.<br><br>The performances are outstanding, the storyline complex enough to keep\nyou guessing till the end. There are some really quite clever plot\ntwists and surprises.<br><br>Im happy to say that I didn't \"work it out\" until the various\nrevelations.<br><br>Very well made and thoroughly enjoyable; a thinking persons film.\n"},
{"review": "\nI totally enjoyed this film from beginning to end. The acting,\ncostumes, and locations were superb. Funny, the only other movie I've\nenjoyed as much this year was \"The Illusionist\". (Pick a card, any\ncard....) I've always been interested in the life and times of Nikola\nTesla. This movie was a great tribute to this misunderstood, brilliant\nscientist. Yes, just like time-travel scenarios, this film makes you\nthink but not enough to give you a brain cramp. It's twists and turns\nrival the most demanding road rally track and will keep you involved\nthe whole time. Not too many films do that for me anymore. It's a\nterrific way to spend 130 minutes. Be sure to have plenty of popcorn on\nhand.\n"},
{"review": "\nThere seems to be a strongly defined split in posters' opinions about\nthis movie. On the one hand, there are those who didn't see the two big\nstory twists coming and thought the film was the best of 2006. Then\nthere are those who did see the twists coming and felt cheated, just\nlike audience who booed Bale's Chinese ring magic early in the film.\nOne poster went so far as to say that because THE SIXTH SENSE kept him\nguessing then all came together but he didn't like the way the ending\nof THE PRESTIGE had to be explained by the narration, then the latter\nfilm somehow failed.<br><br>I fall into the \"Didn't see the twists coming\" category (whereas I knew\nBruce Willis was a ghost pretty much straight away in SIXTH SENSE).<br><br>I'm afraid I didn't figure out Christian Bale's secret until it was\npointed out at the climax of the film, though I did have an inkling of\nhow Hugh Jackman's Tesla machine worked (the clue was in the hats and\ncats)<br><br>But none of this matters. The real value of a movie is not the same as\nthe value of a magic trick. Even if the film is ABOUT magic tricks. A\nfilm doesn't fail only because you figure out the twist ending. The\njourney is every bit as important as the destination. (And then there's\nfilms that DON'T have twist endings at all - are they automatically\nbad?) I know how the special effects are done in STAR WARS - doesn't\nspoil my enjoyment of the film one jot!<br><br>No - in my opinion THE PRESTIGE is an ingenious examination of the\nobsession magic generates in its adherents where the entire film is a\nmetaphor for the nature of performance magic.<br><br>And it has TWO great twist endings. Surely, that should satisfy anyone?\n"},
{"review": "\nAntici..................................pation! <br><br>( With apologies to the Rocky Horror etc,etc.)<br><br>The Prestige is the third act in a magic show where the magic is\npresented. (The first two are called the pledge and the turn)<br><br>The basic premise is of two magicians at the end of the 19th Century\nwho become mortal enemies over a woman. And, as important, their\nrivalry in search of the greatest magic trick. And naturally the\ndilemma of what you can lose when you want to win, damn the\nconsequences. <br><br>The protagonists are superbly played by Hugh Jackman and Christian\nBale, ably supported by Michael Caine and assisted by Scarlet (why her,\nagain?) Johannssen.<br><br>Bale who was the boy in the exquisite EMPIRE OF THE SUN (9/10) and, of\ncourse, the not so personable anti-hero in American PSYCHO (8/10) as\nwell as the latest Batman incarnation, is growing into his roles. He is\non the cusp of A list status and thoroughly deserves it. <br><br>This film is like an exotic buffet; exquisitely crafted, beautifully\npresented with oddities and interests available throughout. Moody and\nelectric, it captures the time and era beautifully. It is another\nfeather in the amazing Christopher (MEMENTO (9/10) Nolan's cap. He's\nbecome a name director that you can trust with your hard-earned moolah.<br><br>Especially interesting in reality was the whole story of the\nEdison/Tesla feud which was only touched on here. Tesla was basically\nthe person who invented AC current and then was shafted by Edison.\nWatch for an interesting cameo appearance here. And Andy (gollum)\nSerkis in a non-digitized role.<br><br>THE PRESTIGE was really magic.\n"},
{"review": "\nI watched this movie and not only was I totally surprised with the\nending it kept me thinking about it over and over. This movie is\nwithout a doubt something to remember, something to shock you and\nsomething to keep you wondering. Not only does this movie show you an\namazing story it keeps you wondering what side to pick and it makes you\nchange sides over and over. At the end who was wrong and who was right?\nYou be the judge while watching this movie. Great actors, great story,\nbeautiful and very detailed scenery, a bit of history, a bit of drama\nand everything else you'd desire from a movie. Enjoy this movie and be\nsure to recommend it.\n"},
{"review": "\nA wonderful movie with a twist to beat all twists . . . everything I'd\nexpect from the Nolans. I swear, I audibly gasped in the theater when\nthe final reveal happened.<br><br>Christian Bale is amazing and believable, and although I'm not usually\na Hugh Jackman fan, I was even impressed with his performance. Creepy\nand dark, this movie is one of those films you just can pay close\nenough attention to--I can't imagine anyone having it figured out\nbefore the movie lets you in on its secret. I think that \"The\nIllusionist\" stole some of this film's thunder, and it's a shame--that\nfilm was nowhere near the masterpiece that this film is. I am waiting\nfor this film to come out on DVD, just so I can watch it a few more\ntimes, being able to (hopefully) listen to the Nolans' commentary\ntrack.\n"},
{"review": "\nA very different setting, a very different story of the art of magic\nand illusions makes the movie a classic. Bale and Jackman fight it out\nfor the top spot in the theatrical worlds of magic and trickery. And\nthey weave a spell of magic doing so. i was spellbound in the entire\nmovie, drawn into making hypothesis of how each trick was being\nperformed, and they managed to trick me every step of the way. Both\nactors are geniuses and deliver a powerful presence on-screen. The\ndialogs are good, performances great but what makes the flick stand\napart from the rest is the imaginative storyline that made me sit the\nentire movie, moth agape. In the end, when the truth is revealed, one\nis left speechless. words don't do justice to the film. A must see for\nall. A slow movie, but that adds to the beauty of it. A definite 9/10.\n"},
{"review": "\nthis movie is excellent... the story is outstanding and the plot full\nof twists, yet there are plenty of perfectly fitting clues during the\nmovie... acting is good too and the late 19th century setting is\ndetailed and intriguing...<br><br>While undoubtedly entertaining \"the prestige\" gives you a chance to\nthink about the endless conflict between lies and truth or fiction and\nreality, stage roles and real life managing at the same time not to\njudge the characters and leaving to the audience the freedom to decide\nwhere good and evil (if any) stand...<br><br>a \"must see\" for everyone, thought it would be wise to note that during\nthe movie appear a few scenes that while not truly violent might be\nquite upsetting for a young public...\n"},
{"review": "\nIt's been a long time since a movie has captured my interest the way\nthat The Prestige does. The prestige is a movie that intelligently\nmotivates the viewers to keep guessing a simple and yet complicated\nanswer. Like ALL of the most \"INCREDIBLE\" magic tricks ever to be\nperformed there is somewhat of a disappointing secret, but nonetheless\nif you can keep the audience from ever discovering this secret, they'll\nnever be disappointed. A lot of reviewers will say, the tricks weren't\nthat impressive as if the answer was so obvious but I can bet that\nuntil things were made REAL clear those review critics would have never\nguessed it either. There was no real spoiler in this comment, but if\nyou go and watch the movie after reading what I said about there being\na very simple answer to the ultimate trick, you should be able to\nfigure it out even though you might doubt yourself at the beginning.\nStill, you WON'T be DISAPPOINTED!!\n"},
{"review": "\nThis film is about the unscrupulous rivalry between two magicians, who\ntried to do everything to be better than the other.<br><br>I have already heard that it is a very good film before I saw the film.\nIndeed, the film has not disappointed me. This is the best film I have\nseen in a long time! First of all, the plot is excellent. A story about\nmagic is in itself intriguing. Coupled with a lot of very unexpected\nand unimaginable and yet realistic twists, this film leaves you\nsurprised until the very end. There are many chilling moments, and many\nmoments where the viewers are made to fidget in their seat because of\nimmense suspense. When everything was unveiled and demystified in the\nend, I was in astonishment of the outstanding quality of the film.<br><br>The character development is excellent. The viewers can all understand\nthe cause of the rivalry, and we can all relate and sympathise with he\ncharacters.<br><br>Acting is great. The set designs are visually attractive and nostalgic,\nand it can easily be seen that a lot of effort has been put into this.\n"}
]