[
{"review": "\nI very rarely write reviews for movies, but after watching Tomorrowland\nI've never seen a movie that's been so unfairly maligned by negative\nreviews,especially considering that this movie was an absolute joy from\nbeginning to end. After watching it, and reading truly horrible,\nreviews I'm starting to think that somebody hired a few live bodies to\nslate this movie for their own specific reasons. <br><br>The script, actors and directors captured the feeling of endless\npossibilities perfectly. The FX were fantastic, there were no lulls in\nthe plot, George Clooney did his thing perfectly, the child actors were\nincredible, and there were just enough twists and turns to maintain the\npace.<br><br>Please, please watch this movie and make your own mind up - the\nnegative reviews almost put me off, but I'm so glad I actually took the\nchance. <br><br>Actually there's one proviso here - and is probably something\nconsistent with most of the negative reviews: If you lack imagination,\nor the yearning for a better world, then you'll hate this movie. Or you\nwant to raise kids who aspire to be nothing more than reality TV\nactors. Or if you're a reality TV actor. Or your kids can't read or\nwrite because you don't think it's important. Or if you think science\nis dumb. Or if you can't embrace hope.<br><br>As for me...I loved it. I'll be watching it again and again :-)One of\nthe best movies of 2015, and now on my \"favourite movie\" list.\n"},
{"review": "\nI can't believe the bad reviews. I also can't believe that nobody\nunderstood what they accomplished with this film. It's Ayn Rand's Atlas\nShrugged! They managed to take that book and bring it up to date while\nmaking it accessible to all ages. That is a fantastic feat in and of\nitself. To also make it really entertaining is extraordinary. Cerebral\nand action packed, it holds the attention of the young right to the\nend. And the end? The film was the pin that showed the audience what\ncould be if only we don't give up and just make things better. Atlas\nShrugged and then asked for help. Everybody should see this film. Now.\nOh, ignore the comments about continuity. Does it really matter?\nArtistic licence anyone? Right my review is over but I have to keep\nwriting because it won't post unless I fill the minimum line count.\n"},
{"review": "\nI went and saw this with an open mind because of the mixed response,\nand I must say I had a blast.<br><br>The story is unique, creative and quite compelling. It is original\nscience fiction which we do not get too often. The film is inspired by\nthe Disney park, but at the same time, it's more of it's own thing.<br><br>It is well acted and the characters are quite likable and believable.\nFrank Walker is interesting, entertaining and has a sense of humor.\nCasey is also an interesting character. I think George Clooney and\nBritt Robertson portrayed their leading roles very well.<br><br>The film is also quite funny at times. During this film, I think I may\nhave laughed more than I usually do at the movies, which is saying\nsomething.<br><br>I think Brad Bird did a very goo job directing. The visuals are\nstunning and the special effects, while mostly CGI, are impressive. The\naction scenes are neat and intense. There is not a single moment where\nI was bored with the film. It also pays a nice homage to the Sci-fi\ngenre.<br><br>The one problem I had with this film is that I was expecting a little\nmore of the \"Tomorrowland\" place and that the story needed a little\nmore work.<br><br>Overall, this was a great film and I highly recommend it to fans of\nscience fiction. Plus, I think it totally puts \"The Haunted Mansion\"\n(2003) to shame.<br><br>In the end, \"Tomorowland\" may not fully realize it's potential, but it\nshould be satisfying as a fun and intriguing Disney family\nsci-fi/adventure comedy thrill ride.\n"},
{"review": "\nI think this movie was fantastic. You should know what you are watching\nand who is the target audience and have the right mindset. For example\nif you are watching any of the Aliens you are looking for a bit of\nhorror, thrill and some brutality; and if you are watching Avatar you\nare looking a hardcore mystery and thrill. I think Brad Bird did an\namazing job for its target audience. When I watched it I was not\nexpecting brutality, hardcore action or deep mystery, I was expecting\ngood quality soft Sci-Fi. I think it did great to keep me extremely\ninterested throughout the movie and the message of the film and its\ndelivery was beautiful. Talking to and reading the reviews of those who\ndidn't like it, I think they were expecting a Sci-Fi like Aliens, or\nTerminator which is like eating Coffee and Cookies for lunch! You'll\nnot enjoy it because you have the wrong expectations! It's the problem\nof the consumer not the product. So the bottom line is, if you are\nlooking for a beautiful soft inspirational Sci-Fi with an amazing\ndirection that you can watch with your kids and teenagers and\nre-energize the dreamer in you, go for it! :)\n"},
{"review": "\nI looked forward to this movie since seeing the trailers. The stunning\nvisual of Britt Roberts transported to an other worldly place, then\nGeorge Clooney asking \"do you want to go?\". Seriously? Heck yea! Maybe\nI'm a hopeless romantic, but I enjoy stories that hold out the promise\nof adventure mixed with hope and some genuine magic. I was not\ndisappointed. Tomorrowland hit all the right points with me--adventure,\nmystery, characters to love and root for, surprise story twists, laugh\nout loud moments, and, the best magic of all, hope. Saw it twice,\nsecond time with grand kids. I will be adding Tomorrowland to my Disney\ncollection.\n"},
{"review": "\nDon't listen to the haters giving this movie ones and twos, because\nthis movie is phenomenal! This was my favorite Disney movie\u0085 before\nInside Out came out (then it became my number two favorite). The\ncharacters are nice and fun with just enough screen time and character\ndevelopment to make them likable. The story: Brad Bird's GREATEST\nPREMISE since a Superhero family! The world is going to end because\nsomeone has implanted that idea into everyone's heads. So it is up to a\ngirl with a great imagination and determination to save it. But the\ntwist is the bad guy in this movie isn't George Clooney for making the\ndevice, or the Audio-Animatronic girl, or even Hugh Laurie. It's US.\nBecause we didn't know any better, we didn't try to fight the idea of\nthe end of the world. So, in a way, WE are the reason that this movie\nexists. I guess the only reason people hate on this movie is because of\nthe continuity errors and the fact that they are the bad guys. Speaking\nof, this movie does have it's faults, but who cares when you have a\ngreat story and characters AND amazing special effects. And, yeah, the\neffects in this movie are beyond amazing. When I saw Tomorrowland for\nthe first time, and the rocket in the Eiffel Tower, I was blown away! I\nsaw the trailers and the effects made me gravitate towards this movie!\nAnd the trailer is probably another reason why people don't like this\nmovie. The trailer made it look like an early preview for Star Wars 7.\nI was also expecting that, but when I saw the actual movie, the trailer\ndidn't matter. So what if you didn't get a dumb action sci-Fi flick.\nYou have a new original idea acted well, directed well, written well,\nand made at the right time that this movie should have been a hit!\nTomorrowland: Disney's dream on the big screen, and I LOVE IT.\n"},
{"review": "\nA bit uneven and too long (It takes the movie about 30 minutes to\nreally kick into gear). Otherwise I enjoyed the plot of slowly figuring\nout what is Tomorrowland and what's the purpose behind it all. So it's\nnot a perfect film but a long way from the failure it's made out to be.\nBrad Bird doesn't disappoint.<br><br>I have read quite a lot of negative comments about this movie and even\nits message and I find that to be slightly odd. From saying science\nshould only concentrate on inventions instead of research to being\nannoyingly preachy. God forbid if a movie has a message these days and\ndespite it having an agenda I thought the movie was fun and\nentertaining.<br><br>I personally found the message of the movie to be pro-science and to\nfight the cynicism and apathy that makes it seem it's impossible to\nsave the world from the direction we're going in. I usually feel\nthere's no hope for the human race but I like to see movies that try to\nconvince me otherwise and try to keep the small glimmer of hope alive.\n"},
{"review": "\nFrom Walt Disney Pictures and Brad Bird, the Oscar winning director of\nanimated classics as The Iron Giant (1999), The Incredibles (2004), and\nRatatouille (2007), comes Tomorrowland, a new sic-fi action flick with\na powerful message, great acting from George Clooney, Raffey Cassidy,\nand Britt Robertson, and breathtaking visuals. I give this film a\n9.8/10 instead of the mixed reviews from the critics (like a 50% on\nRotten Tomatoes). It is also too bad that the movie was a box office\nflop only earning $210 million worldwide against its HUGE $190 million\nbudget. It is a film about how fun the future can be if everyone has\nthe thought of \"a great big beautiful tomorrow\". I highly recommend\nthis to any Disney fans or those looking for a fun action flick, then\ngo check this one out.\n"},
{"review": "\nAfter watching Tomorrowland last night I have to say it is interesting\nand insane from Disney to create a movie like this.<br><br>Like others I have seen the trailer for the movie. It was my nieces who\nasked me to watch it with them so I thought why not.<br><br>The movie is not your normal Disney motion picture and I'm actually\nsurprised that it got a PG rating. But more or less the film shall make\nyou go WOW.<br><br>The film has a original plot that you don't see too often also the\nvisual effects are just breath taken they really brought their top\ntalents to give us effects that will leave you in amazed. <br><br>The Cast:George Clooney, Britt Robertson, Raffey Cassidy, Hugh Laurie\nmade the film work with their performances George and Britt actually\ndid a strong job in the film. <br><br>There is also some good action that make you go that's insane. It\nactually surprised that they did this in a Disney movie<br><br>However the film did stall a few times and part of the story didn't\nmake any sense leaving you feel disappointed. <br><br>Overall Tomorrowland took something different and ran with it so you\nmight be surprised once you watch it.<br><br>I give Tomorrowland an 8 out of 10\n"},
{"review": "\nThe creativity and imagination that went into this movie is stunning. A\ngreat message about how positive and forward thinking can influence our\nfutures and the futures of generations to come. The movie brought me\nback to my younger days when my imagination would make exciting dreams\nand made me think that anything was possible. <br><br>The characters were great and the scenery and colours were spectacular.\nI have never written a review before on this site, but after watching\nthis movie I was inspired and felt impelled to give my comments, if\nonly to encourage others to watch it. I remember watching Star Trek as\na child and how imaginative it was with all the communication gadgets,\nmost of which actually exist today. I wonder if many of the items seen\nin this movie will one day become reality as well, perhaps not in my\nlifetime, but with the advancement of technology and the imaginations\nof the creative people at Disney, who knows! All I know is that I don't\nagree with the critical reviews and will always form my own opinion.\n"},
{"review": "\nWho would have thought that one of the most imaginative films of the\nlast five years would be a film targeted at children? Tomorrowland was\na pleasant surprise. There were a ton of really amazing scenes and a\ngrand sense of scale. The cast is magnificent. George Clooney is great\nas always. However, it must be mentioned that Raffey Cassidy almost\nsteals the show. She is definitely one to watch and as long as she\navoids the pitfalls that go with fame, she is pretty much guaranteed a\nvery bright future in the acting business.<br><br>The story is compelling and has a good message -- without sounding\npreachy. Lots of great classic science fiction homages in here, plus\nplenty of very cool modern ideas. It was great to see three generations\nof future aesthetic in the same film.<br><br>In general, the pacing is pretty good. There are a few parts where it\ndrags a bit. It makes up for it in spades in the last half of the film.\nEditing was expertly done with plenty of quick reaction cuts between\nactors to thread things together neatly. As usual, Disney's shot\nchoices are very good (very textbook actually) and the score suits the\nfilm nicely.<br><br>Be sure to treat the kid(s) in your life (your children, nieces,\nnephews) and or course, yourself to this movie. It's one of the few\nmodern family films that's actually genuinely enjoyable for all ages.\nPlus, you'll get to see some of Santiago Calatrava's more extravagant\narchitecture.\n"},
{"review": "\nThe fact that this movie gets as many bad reviews and ratings as it\ndoes absolutely astonishes me, I'm very critical when it comes to\nmovies with a \"environmental message\" like this, but I had no problem\nwith it, it was delivered in a fun laid-back tone, and Clooney's\nperformance was very sarcastic and cynical, I loved this movie for that\nreason. I don't watch Clooney often, but I'm happy he was in this.<br><br>It simply tells a great story revealing \"secrets\" of the great minds of\nprevious generations, and gives us plenty of back story and interesting\nlaws that apply to \"Tomorrowland\" <br><br>5/7 would watch again.\n"},
{"review": "\nI went into this with somewhat low expectations, do to the poor box\noffice. I was more than pleasantly surprised. It was visually amazing.\nThe cinematography was so well done. A perfect combination of CGI and\ninteresting set locations. <br><br>Acting and casting was superb. Britt Robertson is one of the most\ncompelling young actresses. She has brought her A game to the big\nscreen. <br><br>If you can get around the global warming nonsense that creeps into\nalmost every film these days, Sort of like the cold war and Nuclear\nproliferation were in all of the films of the 60's and 70's., the plot\nis actually clever. I really enjoyed this picture and wish I had seen\nit in 3d. I think it may have a cult following in the future\n"},
{"review": "\nAbsolutely lovely! I'm 17 and saw this with my 8 year old brother, and\nwe both loved it! Dazzling special effects. Great Disney nostalgia\nright from the beginning. Really good acting, particularly on 11/12\nyear old Raffey Cassidy's behalf, who manages to be both convincingly\nrobotic and also human enough to be empathized with. George Clooney\nplays George Clooney as usual, what else could you ask for? The film\nalso has some pleasantly thought-provoking themes that left me\nwondering whether the villain was truly evil or not. To add to this,\nthe ultimate message of optimism that shines throughout the film is\nsomething lacking somewhat in films these days, and really makes this\none stand out from the crowd in the glut of super-high budget family\nfilms that have been produced in the last few years.<br><br>Now, important to add is that this is very much a kids' film. So maybe\nnot an appropriate film to see with your college or work mates on a\nnight out. And naturally, don't go and see this expecting masterful,\nsubtle storytelling or realistic dialogue. The story and dialogue are\nboth unabashedly silly, but quite frankly, why on earth would anyone\ncare? Don't go in expecting a storytelling masterpiece. Honestly, just\nsit back, let down your critical barriers and enjoy the magic of\ncinema.<br><br>And one more thing: If you're reading this in time, this is DEFINITELY\na film to see in the cinema while you can. Get the benefit of the big\nscreen and surround sound while you can.\n"},
{"review": "\nSorry that this review is so late in the day. I have only just recently\ngot around to seeing Tomorrowland. All the acting performances in this\nmovie are wonderful and the humour is first rate. The soundtrack too is\nespecially good. A great soundtrack improves a story enormously. I\ndecided to turn on the subtitle channel on the DVD to follow all the\ndialogue and this also helps on the first viewing to follow the\nnarrative better. I am supposed to type out a minimum of 10 lines\naccording to the rules but to do this I would have to put some spoilers\nin and so therefore I am going to try and waffle for as long as\npossible to fill out because I do not wish to spoil anyone else's\nenjoyment of Tomorrowland.\n"},
{"review": "\nI mean, don't be surprised. <br><br>Yes, Tomorrowland is a science fiction adventure of the highest grade,\nan unpredictable thrill ride of a movie, full of plot twists,\njaw-dropping imagery, hauntingly beautiful music, and brilliant acting\nby major star power. Not to mention the great direction and editing\nthat does not leave a spare second throughout its two hour length.\nDisney, ILM and Pixar. Lindelof and Bird. Clooney and Laurie, Robertson\nand Cassidy. Wood and Murch. Giacchino. Rule-breaking and ingenious,\ninspiring and fresh, this is a top notch entertainment from a top notch\ntalent. <br><br>But it is more than all that. It is also a fable, a tale of two wolves.\nIt makes its moral pretty clear.<br><br>The thing is, people a fable is addressed to usually do not find it\nfunny or cute. I wonder how many 'dumb', 'disappointing', 'preachy',\n'pointless', 'boring', 'leftist propaganda', 'I fell asleep right when\nthe Grasshopper...' Aesop was getting in his time. <br><br>That is why Tomorrowland was a very brave thing to do. It takes guts to\nmake a movie where everything from start to finish very smartly, very\ncarefully, very distinctly adds up to the core message 'negativity is a\nfailure' -- and to release it in a world full of negative people. Wow.\nI get why they hate it. I can also see why Brad Bird skipped Star Wars\nto make it. Personally, I think it was worth it. Thanks, Brad!\n"},
{"review": "\nThis movie really took a person's imagination to a whole new level.<br><br>The story was interesting, and keeps a person engaged with what is\nhappening. It was cool to see the power of imagination and how a simple\nthought could become something much bigger.<br><br>Frank Walker, played by George Clooney, was recognized by his limitless\nimaginative capability. It was going to one day change the world as it\nis. He was able to do just that. Walker was a genius scientist who made\na certain discovery about Tomorrowland that would hold the key to\nchanging the world. With the help from Casey Newton, played by Britt\nRobertson, Walker was able to travel to the city and unravel what he\nhad discovered so long ago.<br><br>This movie has a simple story, and it is ideal for those with a\ncreative and innovative imagination.\n"},
{"review": "\nI will try to be simple:<br><br>The good: Direction, original story, performance (especially the two\nyoung actresses), FX. A real jewel, and not only without a glitch, but\nwith funny moments and action at every minute, or even, some of them,\nvery touching.<br><br>The bad: ... It's supposed to need to write something? OK: nothing at\nall.<br><br>The worst: All the bad appreciation of critics which really have no\ngood taste for art. A lot of people does not understand that the movie\nis not just about Tomorrowland, but about a journey inside the heart\nand will of the people... and with this, as if that was a small\nachievement, an odyssey.<br><br>If you want to see a good exponent of the 7th art, don't hesitate to\nsee this movie. If not, just listen some critics. ;)<br><br>Additional comments: Some people say the movie has technical failures,\nbut believe me, there are none, and the reason is because this movie\nreturns to the most pure essence of Sci-Fi. Maybe some people does not\nliked because it touch sensible fibers about a very common and well\nknown message, or maybe because they believe that it was only to\npromote a Disney attraction, but even if that was true, doesn't\ndiminish the quality of the movie. A little childish, OK, the movie was\nintended for all the audience, and this is not a bad thing, in fact, is\nan incredible and amazing way about how to show the essence of\nsomething really beautiful. Finally, I see some comments about an\nover-acted Britt Robertson, but if you have seen some of her works\nbefore, maybe you can see that the little histrionism that she injected\nin her character is very intentional, and then you will see the talent\nof this great actress.<br><br>\"In a world where values, commitment, common sense, courage, curiosity,\nand thinking capacity are weakening, this movie is a beacon of hope for\nchildren... and adults too\".\n"},
{"review": "\nThis is not the full-on action movie that the trailer suggests. It is\nmuch better than that.<br><br>Tomorowland combines humour, action, great adventure, sharp script,\nthoughtfulness and social commentary in a thoroughly enjoyable package.\nAnd robots. Robots are always good. Especially killer robots with,\n'have a nice day,' smiles.<br><br>So when the preaching arrives about the sorry state of our society you\nwon't mind. It's damning truth is balanced by our hero's desire and\nability to do something about it.<br><br>A memory that I took away from this movie is the story of the two\nwolves. I forget the exact words but one is despair and the other is\nhope. They are always fighting. Which one wins? The one that you feed!\nSo we all just have to feed the right wolf.<br><br>And don't worry that this film might actually try to teach you\nsomething. Don't forget - it has smiley, killer robots!\n"},
{"review": "\nI almost did not watch this movie due to the lower rating - thankfully\nthe first review I read praised the acting and movie set. For that\nreason, I wanted to share a review highlighting the cast lineup which\nwas phenomenal! Who could ask for more than having Hugh Laurie and\nGeorge Clooney and Tim McGraw in the same feature movie! The special\neffects were \"out of this world\" (Please excuse the pun). This sci-fi\nstory brings to the forefront the deliberate abuse that we are heaping\non our Earth and that we are knowingly doing nothing to make a change.\nIt speaks to never losing hope and to always keep the dreams alive. It\nwas worth every minute of watching and is very entertaining and family\nfriendly. Definitely a 10 out of 10 for me and a movie that I would\nwatch again.\n"},
{"review": "\nThis is a great movie. As a show, as piece of art, as a good story,\ngood action, and even good plot. I think it is misunderstood(perhaps\ntoo intellectual for most US people?).<br><br>This world is full of scares such as global warming, pop. explosion,\nenergy crisis, terrorist attacks, nuclear explosion, etc. It is like\nsome global endemic and if you do not agree with those scares and no\nsympathetic to those gloomy future of us , you are not or not a good\nperson even. <br><br>This story has a great value. It is not a corny some fairy tale. It has\nall the cinematic components as a good movie, too. Good actors.\n"},
{"review": "\nMy quick rating - 6,0/10. Unfairly dogged in the theater but it does\nhave its flaws. The story itself is contrived and really doesn't try to\nexplain itself to well. Then again, it is fantasy ad summer blockbuster\nso why am I bothering being critical. The movie looks fabulous as\nexpected (200 million in budget will do that) so at least the movie\nbroke even (not even close with marketing). Britt Robinson(female lead)\ndoes a very good job in her acting role and is very believable as the\napprehensive young kid. Nice to see some good wholesome kid sci fi that\nstill entertains adults, this is why I think it didn't get a fair\nshake. Parents should've been rushing their kids to a little more\nmature sci fi film but I guess the marketing just didn't hit the right\naudience. To be honest, by the marketing, I personally saw it as\nanother George Clooney vehicle which it wasn't. Oh well,still an\nenjoyable film that stands up even with its flaws.\n"},
{"review": "\nI absolutely enjoyed watching this movie with the story's complexity.\nIt is very different to most sci-fi movies.<br><br>All the actors in this movie played there characters really well\ndelivering that aspect of the story to the next level, putting you in\nthe shoes of the main character and having you think about what you\nwould do in this situation.<br><br>I first watched this movie when it came out in the movies with a girl\nthat I had a crush on, that made the experience for me that much\nbetter. Its hard for me to watch a movie and not spot something cool\nthat the crew behind the camera had done. I ended up telling her about\nthe continuous shot that took place when she first enters Tomorrowland.\n"},
{"review": "\nThis movie is AWESOME. Don't get me wrong, I may be the exact\ntarget-demographic for this film. I'm an optimist, a hardcore Disney\nfan, and a comedy/action film fan. I will not tell anything about the\nplot because if I do, I will probably put a spoiler unwarily. First of\nall, the opening to this film is great. Okay, I may have said I won't\nput any spoilers in here, but I am. Having \"There's a Great Big\nBeautiful Tomorrow\" play in the opening made me go-all fan boy. Now\nthat I added that spoiler, I feel obligated to say others. The\nthird-act get's a little boring with Nix saying how the world will end,\nbut it revives itself with a great action sequence, a sad death, and a\ngreat ending. <br><br>Pros: Great scenes for Disney fan-boys. Funny. Original storyline.\nActors are great. Great special-effects.<br><br>Cons: Long and boring during the 3rd-act.\n"},
{"review": "\nThis movie has a powerful message behind it for those who want to see\nit! It brings about many emotions and ideas, that are somehow always on\nthe surface, but not enough recognized. It is an eye opener so to say.\nI highly recommend the movie, not only for the enjoyment of watching it\nbut for the message it sends out. My 7.5yr old son enjoyed this movie,\nfor a different reason than I did, but goes to show u, it is a movie\nfor both children and adults alike. Had some pretty intense moments,\nand good, convincing acting. :) Gets your heart pumping and your mind\nthinking, and sends u through the series of emotions that any good\nmovie should. Highly recommended....especially for 'dreamers' :D\n"},
{"review": "\nWhat? Why didn't Tomorrowland receive higher reviews? It's a lovely\nadventure story of hope and imagination. It's a fairytale land for the\ncurious.<br><br>It's an innocent feel good film and reminiscent of Disney's 1997 Meet\nthe Robinsons. The movie does leave you feeling something powerful. It\ndoes make you want to get up and do something. I love that it's so very\nuplifting.<br><br>It's not a film that is going to blow your mind, it's not dark and\ngritty but give it a shot. I wouldn't even call it just a popcorn\nmovie.\n"},
{"review": "\nI wanted to see this film and I have now had the chance and I really\nenjoyed it. The premise of the film sees a young girl find a pin that\nshows shows her tomorrowland. With the help of friends she tries to get\nto tomorrowland. Britt Robertson is pretty unknown but she is really\ngood as the lead character in this film. Her character was interesting\nand likable as you followed her on this journey. George clooney is also\nreally good in this film as her mentor who tries to get over his own\npersonal problems. His character was also really interesting and he\ndelivers a really good performance. There's a young girl in this film\nand I don't know the actresses name but she is great in this film and\ndelivers a good performance especially for her age. Hugh lawrie is a\ngreat actor but unfortunately his character was really cliché in this\nfilm and didn't add anything to the film overall. The story is pretty\ninteresting as you follow these interesting characters on their\njourney. However, this film does get a bit overpreachy with a moral\nmessage. Also the last act of the film has been seen many times before.\nThe script is really good, it has allot of well placed humour and also\nsome drama that works. The style is really good, the contrast between\nthe real world and tomorrowland really works for the film. Overall this\nis a fun film that is worth watching.\n"},
{"review": "\nOriginal screen play a pleasure to watch. Entertaining like a good book\nyou cannot stop reading. Exciting action all the way. It was a\nrefreshing to watch. The message it conveys is simple but huge. I did\nnot know what to expect when watching it, wow. I did not know the\nstoryline, so when it started it sucked me right in. I recommend that\none should see this movie. If you are going to be analyzer or a couch\ncritic this movie may not be for you. I say just watch and enjoy, and\nallow yourself to be taken on a journey. I did, Excellent. Cinema\nphotography, sound effects, and special effects in my honest opinion\nwere top notch.\n"},
{"review": "\nI was not expecting much of Tomorrowland because of its low score in\nIMDb, however, I decided to give it a try and was very pleasantly\nsurprised. Perhaps it may never become a classic, but I find it\nengaging, funny and with a positive message. For me it is an 8 but I'm\ngiving it 10 to compensate for the undeserved bad scores. It is a kids\nmovie and have to be seen with an open mind and just enjoy the\nconcepts, the visuals, the non-stop action and the clean jokes. The\nplot is deeply discussed in other reviews so I will skip on it to avoid\nspoilers.<br><br>Things I liked was the very natural behavior of the characters in the\nsituations presented (It was not like other movies where ordinary\npeople, confronted with a dangerous situation, instantly became martial\narts experts, hyper accurate shooters, and/or Olympic class athletes\nable to outrun a tyrannosaur wearing high heels. In Tomorrowland, the\nonly unusual thing they were able to do was withstand some hits and\nfalls, with a lot less damage than normal people); the clean jokes; the\nnice special effects (even with some errors noticed elsewhere) and the\ngeneral tone of the movie.<br><br>In conclusion, if you do not expect to see the most impressive exponent\nof 2015 cinematography, but want to have a 130 minutes experience of\nclean, nice fun, with a positive, optimistic message, I recommend\nwatching Tomorrowland.\n"},
{"review": "\nI watched the trailer for this and it seemed like way to many things\nwere happening in this movie. This meant that when i had the time to\nsit down and relax to watch it, i changed my mind and watched Maze\nRunner - Scorch Trials instead. This is a mistake that should not be\nmade as that was so bad i can barely describe it.<br><br>Anyways i decided i would watch it even though the trailer was a mess,\nand what a pleasant surprise. It was not messy in any way and it got me\nhooked from very early on. <br><br>It has amazing visuals, great casting and a very meaningful story. <br><br>Rafael Cassidy (Athena) did an amazing job. At such a young age to pull\noff such a performance is rarely seen, and given the right chances she\ncould be worth to follow through her career. Clooney is good but not\nspectacular as his character is not great in the beginning. He catches\nup though. Britt Robertson (Casey) also does great and is another one\nto watch in the future.<br><br>The story is actually very timely and is something i reflected on after\nwatching the movie. It heads off with some background story before\nnicely introducing us to the characters. I was hooked all the way as we\nfollow Casey around though thick and thin. <br><br>Great movie and a bit low rated in my opinion. I would place it at 7.5\nand therefore i give it the benefit of the limits with an 8.\n"},
{"review": "\nThought this movie was brilliant, very futuristic with an amazing\npicture. I was entranced in the movie the whole time! The acting was on\npoint with lots of \"favorite\" actors in the movie and made you believe\nas if you were a part of the movie itself. I would most definitely\nwatch this movie again, but would love to watch it in 3D. This is a\nfeel good movie that makes you think and is enjoyable for any age group\nto watch. It's nice to see a movie that could have people left thinking\nabout the environment and what more they could do for not only\nthemselves but the world around them. Again I would suggest this movie\nto anyone!\n"},
{"review": "\nI put off watching Tomorrowland because of all the negative reviews I\nwas reading. I have discovered from past experiences that sometimes I\nwill love the movie even if it has bad reviews,so I tried that with\nthis movie \u0096 and I am so glad I did. I have absolutely no clue as to\nwhy some people do not like this particular movie. I think it has to do\nwith the people of today and their spiritual vibe. Not anything\nreligious, just basic human spirituality here. This movie will be\nenjoyed by only certain people. People who's frequencies match. That\nmay sound like pure incoherent drivel, but trust me, it is far from\nthat. Tomorrowland is one of the best movies I've seen in a long time.\nI have been around and have seen many movies too. Do not listen to\nthese negative nannies here on IMDb. I seriously believe that many of\nthem write negative reviews just out of pure malice. I have three words\nfor those haters:<br><br>Don't Hate \u0096 Appreciate!\n"},
{"review": "\nIt's rare for me to walk into a theater and watch a film that I\ninstantly love. Even more rare is when I get sucked into such a film,\nand loose my \"director's eye\" that exposes every angle, cut, and page\nfrom the script within my own mind. However, if there was such a\ndirector who's consistently done this, it's Brad Bird. The Iron Giant,\nThe Incredibles, and Mission Impossible: Ghost Protocol are some of my\nfavorites films of all time, and greatly inspired me as a filmmaker.<br><br>Yet, none of the previously mentioned films add up to how I feel about\nTomorrowland! It is one of those films you watch, and are never the\nsame afterwords. It takes a rather happy weekend and makes it even\nbetter. It uplifts you when you didn't realize that you were down, and\nperfectly stimulates your imagination! It enters your thoughts and will\nmost likely be there, somewhere, in the back of your mind by the time\nyou die. - It's a film you'll always remember.<br><br>Perfectly blending Cyberpunk AND Steampunk to create a fictional world\nis no easy feat. I probably would have said it was impossible before\nseeing Tomorrowland, but, now, am convinced that the two sub-genres can\nperfectly work together in harmony! The visuals, jokes, pacing, action,\nand acting are all on par - a staple of Brad Bird's films. While I\ncould see how some may pass up this film if they aren't ones for Back\nto the Future or The Rocketeer, everyone else will enjoy this film.<br><br>I feel like this is almost an understatement, but, I put Tomorrowland\nas my 3rd favorite film of all time! It's perfect, in every sense of\nthe word - maintaining a realistic image, while not taking itself too\nseriously. Tomorrowland has it all. I'm already fairly certain it'll be\nmy favorite film of the year. I'd recommend that everyone go see it\nsometime. It doesn't have the hype of something like James Cameron's\nAvatar, but easily deserves it!\n"},
{"review": "\nIgnore the bad reviews, they are just jumping on the trash-it bandwagon\nwhich is always easy. Don't let the ridiculously over-the-top critical\nnay-sayers convince you to avoid it, go see it for yourself!<br><br>The visuals are stunning, the message is inspiring, and it's got a good\nstoryline.<br><br>I suppose if you are a movie junky that likes dismal, dystopian,\ndepressing shows with no hope, then maybe Tomorrowland isn't for you.<br><br>But if you like good entertainment, that might actually dare to inspire\nyou to look with hope towards the future, then by all means go see\nTomorrowland!\n"},
{"review": "\nI loved this film! It's an earnest, hard-working story; it attempts the\nlofty goal of expecting the audience to WANT TO think beyond the\nfilm-going experience!<br><br>I believe that for Brad Bird, films are not the end-product but a\nworthy vehicle for grand ideas. Ideas change people - lives are bigger\nand more important than any film. This is true of all the films he's\nmade (MI excluded). <br><br>The ideas of this film are ambitious and difficult to spoon-feed. An\naudience expecting summer blockbuster fare like the Avengers, Furious\n7, Thor or any other \"tentpole product\" from a studio are bound to be\nleft wanting. Those films are pretty and amusing, but they are not\nattempting to make you think about what you as a viewer of a film are\nactually bringing to the world. <br><br>I believe that this exactly the point of the film. Some call it\npreachy, yet I suspect that those who do so were wanting the film to\nserve up the hoped-for spectacle and inconsequential emotional cadences\naudiences expect. <br><br>I feel the profound yearning in this film to affect change in the\nviewer. That is a testament to how much Brad Bird believes in his\naudience. There is a brilliant irony in the snarky disappointment some\nreviewers articulate - they are actually represented in the film!\n"},
{"review": "\nThis movie is full of inspiration and a reminder to all that we\ninfluence the future for better or worse depending on our actions and\nbeliefs. I don't want to spoil the movie, but the story line of which\nwolf to feed has really stuck with me. My kids ages 9 and 11 loved it\ntoo, and every now and then I will ask them which wolf they are\nfeeding. The story has great special effects, and the ending is\npositive. I admit to being a Hugh Laurie fan, as well as Disney fan,\nwhich is what motivated me to go see the movie in the theater. If you\nare looking for some inspiration that is not too heavy and not sad, I\nrecommend this movie as a fun, thoughtful escape.\n"},
{"review": "\nHollywood often tells us to deny our true emotions and find some way to\npretend that bad news is good, encouraging us to sit on the Titanic and\ncheer the upcoming iceberg. According to Hollywood, THAT is the\ndefinition of optimism and a positive attitude. Of course, this is not\nwhat anyone who has ever made history has ever done, and most people\nhave always known that such an approach to our fate is stupid, but\nwe've kind-of been brainwashed into apathy. This film was far\ndifferent. It reminds us that, if we don't like what we see ahead, we\nhave the option to CHANGE COURSE, to DO something about it. This\nmovie's definition of optimism is refreshing in that it reminds us that\nwe can control our destiny, rather than the message we are used to from\nthe media: that we are supposed to happily accept a prechosen destiny\nfor us, and try to see that preselected destiny through rose colored\nglasses. This was one of those movies that I had to watch more than\nonce before I could truly see what a clever and timely masterpiece it\nis. I'd had that experience before with the movies Thor and God's Not\nDead. Movies that initially seem simplistic but are actually deep in\nmeaning seem to be the new thing, but I appreciate the mental exercise.\nThis is one of those movies that will instantly appeal to kids, but\npeople over 35 may need to see it a few times. It will appeal to you\ntoo, if you give it a chance and honestly try to follow the message.\nFrankly, it may be a better message for older folks, since they\ncurrently have more power to change things than kids do. Right now,\nwhat we do impacts their future.\n"},
{"review": "\nI LOVED Tomorrowland! The only explanation for all of the bad reviews\nis maybe exactly what this movie is trying to point out, that\nnegativity feeds on itself and just snowballs.... Was the movie\nperfect? No, but I have yet to see a \"perfect\" movie.<br><br>The premise of the movie was very clear, we once looked with hope and\nanticipation to the future, and we were building it! Then for whatever\nreason people began losing hope and stopped caring, stopped building.\nIt all became a self-fulfilling prophecy....but maybe it's not too\nlate, maybe if we can find people who have a that spark still in them,\nmaybe we can \"fix it\". That's the message of Tomorrowland. No, it's not\nan \"elitist\" message as some have suggested, it's not a left or right\nmessage either, it's a message of freedom. Free people, free to\nimagine, free to dream, free to create and build something for the\nbenefit of ALL. \"Man has dream, and that's the start, he follows his\ndream, with mind and heart, and when it becomes a reality, IT'S A DREAM\nCOME TRUE FOR YOU AND ME!\".<br><br>The 1964 Worlds Fair segment was an incredible recreation! I sat there\nwondering \"how did they do that? I felt like I was going back in time!\nOf course the segments in the Tomorrowland City were absolutely\nstunning! How could you not be inspired? It's everything and more than\nI imagined for an awesome futuristic metropolis! Who wouldn't want to\nlive there? Bravo! (I would have liked to spend more time there in the\nfilm however...).<br><br>Excellent performances from ALL of the actors, but special hats off to\nthe young actors Brit Robertson and Raffey Cassidy who nailed their\nperformances! Thank You Brad Bird and Damon Lindelof for bringing this\nfilm and it's inspiring message to the silver screen! Phooey on the bad\nreviews! Us dreamers need to stick together!\n"},
{"review": "\nWhat a great family movie that is intelligent, inspiring to kids, well\nthought out and exciting. I know family movies are not the money maker\nstudio's want and it appears audiences are content swallowing plot less\naction flicks, but Tomorrowland is a nice diversion from garbage spit\ninto the cinema world like smoke from a factory pipe. <br><br>Clooney is perfect for this part more than I have seen him since The\nDescendents. The kids are great, and don't take that for granted look\nat Hayden Christiansen or Andrew Garfield. <br><br>The environmental tone was a bit soap boxy but still was well placed in\nthe story and relevant, very much like Mr. Andersen's speech to\nMorpheus in the Matrix. A few slow moments on the road trip but it had\nnice moments.<br><br>Overall a real great film for kids to step into a larger story movie\nthat has good characters, plot, and action without the wanton\ndestruction, foul language, sexual innuendo, or forced comic relief.\nOne of the best family movies I seen since the Incredibles, nice repeat\nBird.\n"},
{"review": "\nI had lot of prejudices. But in the middle of the movie i threw them\nall away. I really loved the movie! All the actors and the characters\nmatched and the director was awesome. The names wasn't very memorable.\nThat cute little girl was really good actor, and I just loved Britt!&lt;3\nAnd the Eiffel-tower rocket was totally AMAZING!! Clooney was so\nmysterious... I'm really waiting for second one! I think the end kinda\nhinted about episode 2. At the beginning I thought it was gonna be\nabout 1900 century and be super outdated and old-fashioned, but after\nwhile it turned to be very modern and ahead of its time. I think todays\nkids will be thrilled about this\n"},
{"review": "\nCompared to Other films on right now just by looking at them they look\nboring but this film was amazing. The Walt Disney company have really\nshown a new side to their film making. I highly recommend seeing this\nfilm. They also related the film very well to the Disney theme parks.\nJust amazing!! Maybe just a little slow getting to the Turing point in\nthe plot but all the characters were amazing. Love how they put the New\nYorks world fair in at the start of the film to give us an idea of what\nmight happen. Along with the world famous theme park attraction \"it's a\nsmall world\" which is the gateway into tomorrow land. As I am a great\nDisney fan I really do believe this was a really good film suitable for\nall the family to enjoy.\n"},
{"review": "\nThis movie is GREAT! Not sure why people think it's the worst they've\never seen....<br><br>The movie was well written. I felt it was a fairly smooth script,\ndidn't jump around like others have mentioned. Was easy to follow, and\nI was never lost. The actors and actresses were great! all great\nchoices, they all performed very well. <br><br>The visual effects were just incredible, one of the most beautifully\nlooking movie I've seen this year. The idea of the pins was awesome,\nand the way they showed it was great. There is only one thing I was a\nbit confounded with, was when she touches the pin to find the city, she\ncompletely forgets she is also still cemented in the real world... But\nbesides that there aren't any stupid things the characters do. <br><br>The ending was good, nothing spectacular, but the film is really\ncarried in the first 2 acts, the 3rd isn't as good, but is still great. <br><br>Hugh Laurie was a nice addition to the cast and played it perfectly. <br><br>The film was funny, witty, but not over the top. Kept me in aw over\nwhat was going on. Well worth seeing it in the theaters. <br><br>This movie, along with others he has done, has gotten me very excited\nfor what he'll do for a Star Wars Anthology film!\n"},
{"review": "\nBrad Bird, a respected director has once again proved that the sky is\nthe limit! His latest film Tomorrowland has hit me in my heart as he\ndirects the movie flawlessly and encourages teenagers to reach for the\nsky! This movie flows, makes sense, and is a great family movie to\nwatch on weekends. The cast were fantastic! Raffey Cassidy, a cute 12\nyear old British actress stars as a robot girl and holds the team\ntogether. They work together to get to Tomorrowland. Along side a\nthrilling ride to Tomorrowland to uncover a final master plot of a evil\nBrit! How Fantastic! Overall this was an awesome film! It gives you a\nsense of passion after you are done watching it. You feel inspired by\nit!\n"},
{"review": "\nBrad Bird has yet to let me down, this movie has divided audiences but\nthe division is pretty much down to those who share the quality of\nimagination and creativity as opposed to those who have nurtured their\ncynicism to the point of interpreting everything as a negative. That\nbasically is what this film is about in a nutshell, its made to inspire\nhope from the creative among us who are not living our potential due\nlargely to the multitude of negativity, conflict and selfishness the\nhuman race seem to have become comfortable in wallowing in.<br><br>If this film had been released 20 years ago, I might have never given\nup my previous profession of drawing comics for a living. This is the\nfirst movie that's ever made me reflect on my choices in life and feel\nashamed that I \"fed the wrong wolf\" so to speak. If you have kids then\ntake them to see this movie, inspire them to dream, create and be\npositive now more than ever. Ignore the critics and the negative\nreviews, this movie is nothing short of superb family fun with a\nmessage more important today than any film you'll probably ever see\nagain.<br><br>Brad Bird and Michael Garaccchino are the new Steven Spielberg and John\nWilliams, the music in this film is outstanding and will stay with you\nlong after you leave the theatre. This movie has earned a very special\nplace in my heart and up there with Mad Max Fury Road for best movies\nof the year so far.\n"},
{"review": "\nI am not one that likes to be preached to about things like how the\nworld is going to explode and global warming is happening whether you\nlike it or not. I don't like guilt trips as motivators. I didn't get\nthat with this movie. This gave me hope. It gave me a fictional earth\nand a fictional Tomorrowland. I am a big Disney fan because they make\ncleaner movies that are family oriented so perhaps I am biased. I would\nrecommend this move to anyone that can allow themselves to be immersed\ninto a fiction and not critical of every little detail. The special\neffects were amazing, the script was good, and I left feeling motivated\nand not filled with negative, vulgar, and gratuitous content.<br><br>I go to a movie to be taken away and be engrossed by the movie and that\nis exactly what I was able to do with this movie.\n"},
{"review": "\nIt took me to another world, I forgot all my negative feeling, Really\none of the best movies ever! It made me feel good! this movie should\nhave at least nine out of ten, mysterious, full of thrill, very\nawesome! You won't ever regret watching this, and you'll not forget it\never! I watched a lot of movies most of them disappointed me, and were\na waste of time to me, even though they were with a high IMDb review, I\nreally hesitated watching this movie because of the law review index,\nIt really shocked me how a movie like this gets negative reviews from\ncritics! And it is not hard to be understood as some people said, It\nwas very smooth and like a dream! At last you really have to watch\nthis!\n"},
{"review": "\nFirst of all i didn't watch that kind of film for a long time. After\nwatching the full movie one thing I'm sure about that man is using\ntheir imagination to see a new land. This movie is the sign of the\nupcoming future. Although this movie bears ambiguous and visually\nstunning things but the main prospect is for the newer future, The\nfuture of that days and it's begin now. I don't know why some people\ncommend bad speeches.It's quiet natural. Brad Bird, Director of this\nfilm shown a new world which is in people's imagination and which isn't\nfar away from us. Lastly the total team include Brad Bird did a\ntremendous job, I've seen lot of films but unbelievably this one is the\nbest than best.\n"},
{"review": "\nI can't figure out the (relatively) low rating on this movie, which I\nfound to be a fun and imaginative tale with a message of hope. It's\nvery much a Disney movie, with clear references to the Tomorrowland\nconcept, but without hammering the idea. The science fiction is a bit\nvague, but uses well known concepts in interesting ways, borrowing from\nmuch that is past while creating a unique story that kept my interest\nthroughout. The casting is great, both for new comers and well\nestablished actors; having the brother be the Humanex from Extant was a\nnice touch. The final solution is also a bit vague, but promotes the\nconcept of hope and perseverance, which is a welcome change from most\ncontemporary science fiction films. A good story well told that\ncaptured my attention.\n"},
{"review": "\nBelieve it or not, this is a classic already. Like Iron Giant. Like\nBack To The Future. People used to wonder why they don't make movies\nlike that anymore. Well, they do. This is it.<br><br>It's got everything - humor and sadness, hope, empathy, engaging\ncharacters, clever plot and great performances all around. It's got its\nfollowing already and its hater club. It's got people from all over the\nworld logging on to write their first review in years telling how much\nthey loved or hated it. Either way, it does not leave people untouched.\nThat's a lot more than I could say about most of the latest\nproductions. Best of all, it can be watched over and over again because\nthere is so much more in it than meets the eye.<br><br>My prediction, it will be a recognized cult classic in months. In five\nyears it will be playing back to back on major holidays and people will\nbe scratching their heads thinking what the heck they were thinking\nabout while it was in theaters. Wanna bet?\n"},
{"review": "\nA great movie as long as you take it for what is, a good adventure.\nWatch it with an open mind. We could all do with a little more hope...<br><br>For me this movie was fun and carried a poignant message, about doing\nsomething with our future. It is very easy to sit back, be cynical and\ndo nothing. We are told that the future is going to be awful for all of\nus, global warming, over population etc... Back in the 50s and 60s the\nmessage was different, why has the message changed? Back then it was\nknown about over population and the need for change. Do we need to\nbelieve the message that we are told, if we don't agree why can't we do\nsomething to change it? Maybe this would have an positive effect on the\nnumbers of people today having to take anti-depressants. Any way enough\nof that, glad to get that off my chest... :-) <br><br>The movie doesn't take itself seriously. I particularly liked that the\nuse of the word \"bollocks\" towards the end, very unDisney like. There\nare some great effects, although they didn't go overboard. I liked the\ncameo appearances (teachers preaching disaster) by the two actors who\nplayed scientists in Stargate Atlantis. Also Kathryn Hahn as the one of\nthe owners of the Scifi store.<br><br>I particularly liked the conversation between Casey and her father: <br><br>Casey Newton: There are two wolves who are always fighting. One is\ndarkness and despair. The other is light and hope. The question is...\nwhich wolf wins? Eddie Newton: The one you feed.<br><br>Spoiler alert! We're feeding the wrong one...<br><br>So that was my 2 cents...\n"},
{"review": "\nI have to admit I am a bit surprised this didn't do well at the Box\nOffice. It is a weird little movie, but it does have the star power and\nit is accessible to children. But while George Clooney has a lot of fun\nand can bring out his inner kid, the real stars are the two young kids\nin the main roles. I don't know how long the casting process went, but\nthey did a great job selecting the actors for this.<br><br>The movie and the flow of it might seem a bit weird, but apart from the\ngeneral story there is a message here too. Maybe you don't like it, but\nthe movie does more than a decent job portraying and giving us that\nmessage. It's fun and light, but has a couple of dark moments too. It's\na great fantasy adventure set in the future (Science Fiction mixed in\nthere) for the whole family. Hopefully this will find an audience on\nHome media/medium, it deserves it\n"},
{"review": "\nMy review may be a little bias. I have been anticipating this movie for\nyears. I played along with the alternate reality game, the Optimist,\nthey did a couple of years ago about the concept. That was incredibly\nintriguing. I was at the D23 expo when they went through the \"dusty\nbox\" of artifacts. The tomorrowland exhibit and app was by far the\nhighlight of the expo. I also read the book \"Before Tomorrowland\"\nbefore watching the movie.<br><br>Such a deep world that they created through other sources of media,\nwell before the movie, sold me. It is such an ambitious and captivating\nproject. And this was all years before the movie came out.<br><br>Then the movie came out and I heard it was such a financial flop. I\nthought I was going to be disappointed after years of waiting based on\nsome reviews. But I definitely was not. It added to this world that I\nalready was sold on. It was fun and left me wanting to see it again.<br><br>I realize that a vast, vast majority of those who see it will not have\nread the book, or tried to piece together the clues from the app.\nAsking that type of commitment is ambitious for the casual moviegoer\nand that probably made people walk away from the movie like they missed\nsomething (because they did). But I applaud this type of original\nconcept, unique marketing, and positive story. I HIGHLY recommend\nseeing it. I also recommend doing you own exploration into Tomorrowland\nwith the app or book. This type of creative ambition should be\nsupported and does not deserve to be a flop.\n"},
{"review": "\nA great feel-good movie with a giant \"what if\" button.<br><br>I've read many negative reviews saying, basically, it didn't solve\nenough problems. Those are high praises if you are actually expecting\nscience from a science fiction. <br><br>The basic gist is that something can be done and to just look for a\nsolution rather than be defeatist. That is all the movie is supposed to\nrepresent. It does not advocate anything besides optimism which can go\na long, long way. <br><br>So great movie, truly. It does not provide answers other than whatever\nyou produce personally will combine with everyone else efforts. So\nproduce something good instead of being careless and producing\nsomething wasteful.\n"},
{"review": "\nFirst of all, I loved this movie. My kids loved this movie, and I just\ncannot understand why anyone would be so negative about it.<br><br>The acting is excellent, particularly from the younger members of the\ncast , the script has the right amount of humour and as you would\nexpect the special effects are superb. <br><br>The story comes in for some criticism from a lot of people but I\nthought it was a great ride and had a profound message about the\nenvironment but without ruining the film.<br><br>After the movie my kids were talking about jet packs and flying baths\nbut also about how we should look after the planet. Mainly my eldest\n(11), the environmental message went right over my 7 year old's head,\nwhich shows how its not rammed down your throat. He did think the\nlittle girl robot was cute however which was also a reasonable\ntake-away!<br><br>I can only imagine the bad reviews for this movie have been\n\"encouraged\" by industries like motor, oil and gas, mining, etc, who\nall have a vested interest in people not seeing this film.<br><br>I cant recommend this film highly enough, take your kids to see it they\nwill love it and may have their eyes opened to an important message\nabout how we can make a difference to the future of our planet if we\nreally want to.\n"},
{"review": "\nWell, that was ... different.<br><br>One of the few gems amongst all the junk that has been cranked out over\nthe last decade!<br><br>I watched this on a rental DVD because I've already given up on buying\nthem, let alone bothering with actually sitting through new movies in\nthe cinema. That's how disillusioned I have become with the \"products\"\nof the whole industry.<br><br>But this one is most certainly different.<br><br>Original enough so as not to be lost in formulaic action-burdened story\ntelling. Magnificent actors - both old and young. Hillariously\nentertaining story transitions. Beautiful imagery yet no overdone CGI\nstuff. <br><br>OK, the ending was a bit message-laden but I can live with that. <br><br>Watch it!\n"},
{"review": "\nTomorrowland is probably the most original film in years and how did\nthe critics felt about it? Ambitious and visually stunning,\nTomorrowland is unfortunately weighted down by uneven storytelling.\nSeriously? they like dumb sequels like Magic Mike XXL but not this? The\nproblem the real problem here is maybe the trailer? because we didn't\nsee anything for what the film is really about? or the pacing? and yes\nbut i totally get it if you feel like that but for god shakes it's\ndirector Brad Bird the same genius who directed Iron Giant and\nIncredibles and other awesome films. The world that Bird has fixed is\nmagical and the cast is great Britt Robertson, Hugh Laurie, George\nClooney and the biggest star of the film is the little girl Raffey\nCassidy that steals the show. Tomorrowland is not the best Disney film\nof all time but it's definitely not a bad one.\n"},
{"review": "\nThis is one of the best of the best from Disney.<br><br>It does the job. It delivers what ALL ART is supposed to be about. This\nis why Disney is what it is, and why this movie is a 10 out of 10. This\nmovie is a beautiful beam of light in this world. I can't recommend it\nenough. It has love, hope, optimism, science, wisdom and forward\nthinking. I absolutely loved it. I have enjoyed every second of it.<br><br>This movie also came in a perfect time, it is very up lifting. Life\nbecomes what WE think of it. Let's think of a wonderful future. Let's\nbuild it together.<br><br>BE the change you wish to see in the world.<br><br>BE the change you wish to see in the world.<br><br>BE the change you wish to see in the world.<br><br>Think of a wonderful future. Let's build it together.\n"},
{"review": "\nBeautiful, sublime, wonderfully told story both visually and textually\nand yet the critics crucified it...what a pack of sheep. <br><br>I've read a number of the reviews posted here and it appears that many\nof the writers have never heard of \"suspension of disbelief\". If you\ncan't buy into this world, you better have an imagination checkup. <br><br>Can the future be beautiful? This film gave me hope that it could be.\nNot just a technological wasteland, but a warm, verdant world.<br><br>But maybe I'm a dreamer...<br><br>Hope I'm not the only one.<br><br>If you don't join us, <br><br>The world won't live too long....\n"},
{"review": "\nI did not expect it to be very good. I did not listen to the reviews,\nbut I knew how awful they said it was. I am surprised about their\nreviews because it is based off what Disney envisioned. Everyone loves\nDisney and the innovation he had. Tomorrowland was made into a story,\nhow it came to be was made into a story.I like movies like this because\nit makes one think. We know about tomorrowland, but how did it begin? I\nremember riding space mountain as a child with my parents in Disney\nworld and going to epcot center and mgm when it first opened.the people\nthat write bad reviews, have they ever been to Tomorrowland or was it\njust because of Clooney? Sometimes it can be just about the actor.\n"},
{"review": "\nThis movie is made for kids, so if you expect something realistic or\ndead people in piles, this movie is not for you. If you can watch it as\nif you were a kid, then it can be something enjoyable. According to\nothers you should not compare it to the book either, but I did not read\nthe book, so I cannot confirm that.<br><br>I can't even remember the last time I watched a film with such a strong\npositive message. Actually I could rarely find a movie in the last 2\ndecades with any useful meaning at all. Let's check some movies/series:\n300 - kill people who attack your country, join to the military!\nTerminator - kill bad robots to prevent the judgment day. It follows -\nbe afraid of creeps, they will kill you if you let them close to you.\nGame of thrones - killing people in sadistic disgusting ways is cool.\nVikings - slaughtering Christians is cool. LotR - save the world by\ndelivering the nuke, I mean ring (I really liked the battle scenes).\nThe hobbit - do insane things for money. Prometheus - aliens kill you.\nJurassic - dinosaurs kill you. 2012 - there is no hope to save the\nworld, but you can survive on ships (the effects are cool).\nInterstellar - still no hope to save the world, but you can survive on\nships, I mean spaceships (the effects are cool here either). Armageddon\n- Bruce Willis can save the world (I assume Bruce is too old now,\nthat's why we cannot save the world since '98), Die hard - kill the\nterrorists if you are a cop (actually that makes sense). As you can see\nit is really hard to find something supportive you could agree with or\nsomething which could have a positive effect on you. So I think this\nmovie is unique in this way and it is worth to watch. It's a shame that\nit is not made for adults many people could have learned from it.\n"},
{"review": "\nWhile this movie has received many critical reviews claiming it is a\nloss of money, it is the complete opposite. When looking for a film\nthat is both family friendly, and educating Tomorrowland is definitely\nthe one to watch. It teaches everyone to never stop believing in\nthemselves, and to always keep dreaming, Walt Disney says that \"...\nThis whole thing started with a dream and a mouse.\" The future part in\nthe movie comes with a bit of a surprise but opens your eyes due to the\nfact that it makes you realize that the future really is in your hands.\nIt teaches you that you have the power to change it and that the time\nto take action in now, after all the future is tomorrow. With the\nglimpse of what it could be through the eyes of an optimist, it also\nlooks through the pessimistic point of view, showing you the good and\nthe bad and how it matters when you take charge.\n"},
{"review": "\nThere are nine pages of negative reviews before the first hint of\npositive words. This is explained by the fact that the majority of\nthose reviewers don't actually understand the messages in this film and\nhave completely missed the point. Tomorrowland's overall rating is\ndisappointing but not surprising given the tragic state of world\naffairs but more to the point, it underscores why the pin is only given\nto select individuals. I expect that the executives anticipated this so\nI don't think they will be busying themselves with worry over ratings\nor box office figures and will otherwise remain excited by the prospect\nof arousing Walt Disney's motivation and optimism latent within people\nwho dream of creating a bright and wonderful future. While this film\nremains an enigma to many it will only be those who truly understand\nthe messages in this film that will walk away feeling empowered to act\non the ideas and ideals that define them. Certain individuals who watch\nthis film will find out that they have the ability to change the world.\nSo how will you know if you have been selected? It's simple, you will\njust know.\n"},
{"review": "\nOne of those movies where I'm thinking the whole time, \"Man, is\neveryone else absolutely insane? This is great!\" It was very similar to\nanother live action Disney movie of recent years, The Lone Ranger. I'm\nnot sure what other movie people are seeing, but this is a highly\ninventive, interesting, fun, smart movie. It has its flaws, for sure,\nbut they're rather minor. Its big problem is that its so ambitious it\ncan't wrap it all up in a 2 hour package without being slightly\ndisappointing. We really don't get to see enough of Tomorrowland. The\nfilm follows teenager Britt Robertson, a smart kid who is interested in\nscience and has positive views of the future. She is chosen by a\nvisitor from Tomorrowland (Raffey Cassidy) to experience the wonders of\nher home. This wraps Robertson up in a strange conspiracy, where she is\neventually led to loner George Clooney so she can learn the truth. Much\nof the film is a chase sequence, with Clooney, Robertson and Raffey\nrunning from robots trying to hunt them. The film has a positive\nmessage and absolutely wonderful special effects and production design.\nThe main reason I was interested was the retro-future look from the\n1950s/60s, and you get a lot of cool stuff to look at (this is the rare\nfilm where I might think seeing it in 3D would be cool, particularly\nthe introductions to Tomorrowland). In addition to the three actors\nmentioned above, Hugh Laurie plays the villain (well, it is a Disney\nfilm, there has to be a villain). Keegan Michael-Key and Kathryn Hahn\nhave an amusing appearance early in the film, and I loved Matthew\nMacCaull as the robot with the creepy smile. The script (co-written,\nalong with Brad Bird, by one of the internet's most hated people, Damon\nLindelof) is far from perfect, but there's a lot to love here.\n"},
{"review": "\nI loved this movie. A good science fiction story, with humor, drama and\naction very well balanced. It's refreshing and somewhat different from\ntypical SF movies due to the heroes of the story, their ages and\nstatus. I saw the trailer and had high expectations and the movie\nsurprised me in the sense of not so much SF and special effects as I\nexpected, but the story makes up for that on another level -\ninteractions and possibilities. Of course there are some clichés like\nthe end of the world, robots and some genius kids, but, come on that's\nsuch a probable future we are coming to... I recommend this movie and\nhope you enjoy it also.\n"},
{"review": "\nThis movie has one of the best sci fi child actresses performance I've\never seen.<br><br>I was truly amaze and pleasantly surprise at the great acting\nperformance of both Raffey Cassidy (Athena) and Britt Robertson\n(Casey).<br><br>Britt's acting made it easy to feel the joyful emotion of her character\nas she gobbles up each new gadget.<br><br>Raffey's acting was far superior to most A-rated adult actors.<br><br>The pace of the movie was fast, but it didn't look rushed. Moreover it\nslowdown in the right places to let you capture the characters feelings\nand emotion.<br><br>I can not see how anyone could rate this movie lower then an 8. This is\nthe most underrated film I've ever watched.\n"},
{"review": "\nNot sure why this one has gotten such mediocre reviews. The acting is\ngood, both girls did a great job, very believable. Clooney too, but\nthis was an easy one for him I think. The effects are good, and so is\nthe sound. There are a few clumsy edits, but I don't think most people\nwould be bothered by them. The plot is clever. The unpredictable parts\nare unpredictable because of the complex nature of the science it's\ntackling, making it an honest-to-God science fiction family film. The\nplot developments are usually smart and clever. It's really\nentertaining without pandering or over-explaining. The subtext about\nhumanity's drive toward its own apocalypse is totally legit, the real\nscience bits make sense, the alternate history is almost plausible\n(complete with a taking into account historical personalities like\nEdison and Tesla). And it's pretty funny. It also bears multiple\nviewings.\n"},
{"review": "\nI didn't really have any high expectations for this movie, since the\ninitial impression I got from the poster/description reminded me of\nmovies like \"The Golden Compass\" which is basically just a bad\nchildren's fantasy movie.<br><br>But I were definitely brought to shame by making that comparison.<br><br>The movie spends quite a lot of time, establishing the entire\nfoundation of the story, which makes for a rather convincing storyline,\nand even though it's a fantasy, and a lot of it is science fiction, it\nactually makes a lot of sense. The only downside of this thorough\nintroduction is; I could have used a 30min longer runtime in the end\n(the end felt a bit rushed).<br><br>But I walked away having genuinely having enjoyed watching it.\n"},
{"review": "\nI read a bunch of negative reviews and almost didn't view this movie.\nThat would have been my loss. It's almost like the negative reviewers\nwere talking about themselves and their own lives in their harshly\nnegative assessment of Tomorrowland. It's fun, positive, fast-paced and\nvisually very pleasing. <br><br>I'm an old man, and was actually at the 1964 World's Fair whose theme\nwas \"Peace Through Understanding\". It was a time of limitless\npossibilities. It was a time just before space exploration and all the\ninventions that came from that technical effort; calculators, cell\ntechnology and of course computers. Everything seemed possible. The\nmovie starts there, where George Clooney's younger self comes into\ncontact with a type of Cold War scientist. The movie explores the\npossibility of what would have happened if the free spirited positive\nthinkers had taken control of America, not the Lyndon Johnson and\nRichard Nixon \"Peace through War\" types. The children of the people who\nsupported the death of the ideals in 1964 are now the a**holes writing\nnegative reviews. <br><br>What's so bad about a movie fantasy where the good guys win, and build\na better world with positive values and cool technology?\n"},
{"review": "\nI just watched TOMORROWLAND again, it was an in-flight movie on Delta\n(lucky break I guess), and I just had to come back here and replace my\nold review with this:<br><br>Well, there are different types of reviews: 1) Retelling of the plot\n(done by bloggers), 2) Critical comparison essays (me.dot.com guys), 3)\nYour own impressions (I like these ones best), or 4) Hater attacks (\"i\nwasn't watching the movie but i hate it anyway, one-star\" types).<br><br>Let this one be a fifth type, an Opinionated Advice:<br><br>TRY IT! <br><br>Quite honestly, I don't recall a movie that gave me so much pure joy\nwatching, other than classics like RAIDERS OF LOST ARK, BACK TO THE\nFUTURE and TERMINATOR 2: JUDGEMENT DAY (last really good T). Seriously,\nit IS that great, an instant classic on a par with all three. And like\nthese, it's not a one-time through movie. If anything, it gets better\non - the first time you are too busy being surprised ('wow! wait, what?\nWow!!'), next time you start to appreciate how smart and polished the\nwhole thing is. Gosh I'm waiting for DVD release now like a child\nbefore his birthday, lol.<br><br>I could write pages (and I did last time) on how the acting is great\n(remember Athena? you will), story is one ingenious thrill ride,\nvisuals stunning, message intelligent and timely, how it is full of\nhope and wonder, sprinkled with smart references to science history and\nclassic sci-fi movies, and how the whole movie came out even greater\nthan the sum of its parts -- and it is all that and more. But the last\npin I... er, the best hint I can give you is:<br><br>Try it. Get it and watch it.<br><br>You'll thank me later on. :) <br><br>( Useful or not, that's an honest opinion. )\n"},
{"review": "\nHonestly based on the trailer I was expecting this to be a lame action\nfilm set in the future. My husband really wanted to see it though, and\nI'm glad I did because I enjoyed it.<br><br>The trailer is pretty vague, and there's actually a lot going on to\nmake the movie more interesting. I liked the opening flashback, the way\nthe It's a Small World ride opened up to a portal to Tomorrowland, the\nway the pin was actually only a type of type of 'promo film' and didn't\nteleport you anywhere, the robot girl, the 'bad guy.' I liked the\nfather and brother in the film. The trailer kind of makes the dad seem\nlike a jerk but he's actually a cool engineer dude. Overall, it was a\nfun and enjoyable movie.<br><br>I don't know why the critics are so concerned with \"mis-casting\" and\nthe plot. I thought the casting was fine and the plot made complete\nsense if you weren't caught up in being a butt-hurt critic.\n"},
{"review": "\nA movie for the whole family, it asks what if all the things that are\nscience fiction excised in one city, another earth. Where a teenage\ngirl(Britt Robertson) and inventor(George Clooney) have to go in order\nto see what destiny that fulfill them.<br><br>director Brad Bird(The Iron Giant, The Incredibles) really shines with\nhis direction, making it a fun Disney film for kids and adults. George\nClooney and Britt Robertson have such great chemistry, appears that\nthey are having the best time working together, looking like it was a\nlot of fun working on this film. Hugh Laurie is also good in his role,\nbringing the same sarcastic charm that he brought in the show\nHouse(2004-2012). The effects are amazing, I mean almost beyond. It\nwill adults feel like kids again.\n"},
{"review": "\nSome movies solve their dilemma with a bomb, bullet, computer virus or\nphoton torpedo. This one isn't about bullets, bombs or computer\nviruses. Its about hope. <br><br>If Frank Capra had interned at ILM, he might have made this movie.\nWe're living in a time where the slightest shred of hope is mocked by\npeople who make a very good living on hopelessness. We've come to\nexpect it and grow suspicious when we don't see the angle right up\nfront. What if that were by sinister design?<br><br>It has some trouble finding it's stride but it never loses hope, which\nis more to the point. Its got an conclusion that'll stick with you,\nenergize you and even motivate you to get up and do something, anything\njust for a chance at Tomorrowland.\n"},
{"review": "\nI am finding it harder and harder to trust the public's choices of\nmovies. Giving this film such a low score is so incredibly wrong. Were\nthere a few flaws? Yes. There are flaws in EVERY film EVER made. So why\nsomeone would be hung up on the girl using her gloved hands to operate\na touch screen or the lack of explanation of the second truck they\ndrove, is unexplainable. Overall this was a fantastic story and a\nwonderful film. The hope and the inspiration that is built into this\nstory is great, I just wish that the world could see it instead of\nbeing so negative. I have to fill in some space here so I am going to\nsay that I liked this film just in case the people reading this are to\nstupid to understand that in less than 10 lines. I sure hope they are\nnot. IMDb seems to think they are they also think that I cannot explain\nmy views of a movie in less then 10 lines.\n"},
{"review": "\nI do not review films, just because I watch so many and I am greatly\ndisappointed by them. I think the people who have watched this and gave\nit 1 start simply are simple minded and don't understand the movie at\nall or what it's getting at. Sad really because it really is a\nfantastic flick for adults and for young ones alike (13+ due to maybe 2\nbad words). <br><br>I (unlike others) won't give away the movie nor express my thoughts on\nwhat you should or should not believe. That is what is so great about\nthis movie. It touches on such a wide variety of topics and views that\nif 200,000 people watch the movie you would get 200,000 different\npoints of view. <br><br>I don't care for SciFi and don't really consider this to be as much a\nSciFi movie as many others. <br><br>It's well written, the little boy, the young man that played the\nbrother, and the two young ladies could all be leads here. They really\nimmerse you into the movie and for 2 hours you really feel like you're\nin a better place. My disappointment came when the movie was over. I\nwas wanting more. I guess the simple minded don't get that or lack that\nimagination.<br><br>Definitely see this movie. I have watched it twice and it was better\nthe second time around. <br><br>Tomorrowland was a hit...\n"},
{"review": "\nI found this movie to be enjoyable and it had a lot of positive\nmessages for the viewer. It ignited a passion in wanting to fix\nproblems instead of waiting for some miracle to occur. When I saw the\nname Brad Bird, I instantly thought of \"The Iron Giant\", a movie which\ntold me as a child that I can be whatever I want to be. Yes, this movie\nmay be seen as \"preachy\" and I felt that way too watching it, but why\nis that a bad thing. We all at times need these preachy messages to\nwake us up and hopefully inspire great things in us. We need to stop\nfocusing in the latest celebrity gossip and pay more attention to\nadvances in science, space exploration and the environment to name but\na few.\n"},
{"review": "\nMost people shy away from this movie because it gets constant 1 star\nreviews on IMDb. really the hatred towards this movie just proves it\npoint. Without giving anything away I will say the movie is very\ncentered around this positive message of a good and bright future. Most\npeople seemed offended by this idea and tear this movie apart. But\nreally Brad Bird just wants people to get excited about the future\nagain, which I agree is something we should be doing. But people\ninstead say this movie is preachy and boring and sloppy and just rip\napart Bird's goal for this movie. Most people expect a totally\ndifferent movie going into it, which I think is part of the\n\"disappointment\" people are getting. I honestly think this movie is a\ngreat culmination of good storytelling and a good old ending that'll\nleave you inspired for the future... Or if your not me hating this\nmovie to death. Go into it clean, don't expect anything or take anybody\nelse's opinions into view and just enjoy Tomorrowland.\n"},
{"review": "\nThat's what Tomorrowland is about. Hope. And imagination. It's a film\nthat makes you believe in the future. Sadly, it seems that many of the\nreviewers here have lost that belief, and blame that on the film.\nTomorrowland is not about how to change the world - it's about\nbelieving that we can. And we need that belief more than ever in our\ndepressing modern society.<br><br>Tomorrowland is about the power of believing. It's not a blueprint for\nhow to change the world - because the point of the story is that there\nis no blueprint. It's up to us to believe in the future. That's not too\nvague for me, and it shouldn't be too vague for you. This film makes\nyou believe in the possibilities of the future. Watch it and tank up on\nhope and imagination.\n"},
{"review": "\nTomorrowland was a totally unexpected movie for me. \"SciFi Action\" is\nwhat I usually go for. I didn't do my homework on this one and it's a\ngood thing as I would have missed an amazingly good film. The first 20\nminutes are quite confusing, which is good. I like a mystery. By the\nend of the movie all is explained. The Sci Fi angle is just right and\neverything works. The casting is perfect as is the chemistry between\nvirtually all the actors. It is a thoughtful, emotionally rich movie\nthat can be enjoyed by children at one level and adults at another.\nDon't miss this Disney gem. (PS, this is my true opinion and nobody\npaid me to say it.)\n"},
{"review": "\nPerhaps the greatest reason for the negative analysis , is the fact\nthat this film is the opposite of what the haters are. people who do\nnot help or move somewhere atom, they are waiting for the end , seeing\nthe bad side of everything. It is not just a fantasy film that holds a\nmagical land with villains and monsters , but it shows the villain who\nlives in us , the monster fed to the present where the future does not\nmatter as long as is good here and now, the haters by incredible as it\nmay seem soulless are the villains of the film, and in the absence of\nwhat to do and a whole world to hate , proves that coming here and\ngiving a bad review.<br><br>That's was I thought incredible in this movie, so, Dreamers have to\nstay together, Haters its gonna hate.\n"},
{"review": "\nAside from a horribly rushed plot, the irritating know-it-all unnatural\nteenage genius who doesn't ever say anything smart or what would at\nleast sound like her own thoughts, aside from the rape of Isaac\nAsimov's story - as if someone had read just the beginning and the end\nof it without getting the message - as a Ukrainian, I am highly\noffended that the movie had used the actual footage from the mass\nprotests which took place in Kiev in 2014. Many people had died that\nday at the Independence Square in Kiev, defending their freedom of\nassembly and democracy in Ukraine. Many police officers who had been\nthrown by the illegitimate government to battle their own people at the\nstreets had fallen that day too. Our country is still torn because of\nthe tragic events of 2013/2014, the community is an open wound. When I\nhave seen these events crammed into a sappy disaster montage, I was not\nonly shocked, I almost felt like I have had a flashback to a year\nbefore, which had left me with a sour taste for the rest of the movie.\nAnd then the creators of this schlock have the nerve to tell us that\nthe reason for all human violence is a sci-fi techno babble antennae,\nthat \"projects bad vibes\"?! This movie is heinous.\n"},
{"review": "\nAs far a science fiction goes, this movie is good enough. But what\nreally struck me were the young actors with how believable their facial\nexpressions were. I haven't seen this kind of acting since the days of\nHarrison Ford, Mel Gibson and Dustin Hoffman.<br><br>Not surprisingly, George Clooney and Hugh Laurie are quite adept at\nsubtle expression changes, something I have always appreciated about\nthem. But the four kids, as young actors, had facial expressions that\nwent right along with what was happening and what they were doing and\nsaying. I can't tell - because I've never seen them before - if they\nare incredibly talented actors, or if it's due primarily to the\ndirection of Brad Bird, who I also don't know. But all four of them -\nBritt Robertson, Raffey Cassidy, Thomas Robinson, and Pierce Gagnon -\nare all true actors, and I look forward to seeing more of them.<br><br>Granted, Britt Robertson isn't a kid, but she is young. Her expressions\nwere just incredible, and added immensely to the impact of her role.\nOne of the most expressive acting I've seen in many years. Maybe she\ncould coach Keanu Reeves? My applause, also, to the casting director\nfor placing Thomas Robinson as the young Frank Walker. He was not only\nbelievable in his acting, but is also believable as a young George\nClooney.\n"},
{"review": "\nI hope this isn't a spoiler, but this is a message movie. And the\nmessage is 'Pessimism is a self fulfilling prophecy. Don't give up'.\nNot a bad message. Yeah, the goofy naive optimism it celebrates is kind\nof anachronistic, still I'd root for the dreamer over the person with\napocalyptic nightmares every time. It's a sweet film with a\nconstructive message. If we don't at least try for a positive outcome,\nwe condemn ourselves to failure. Brad Bird and company may not have\ncrafted a Hollywood blockbuster, but they made a film they should be\nproud of. It's a fun film with an important message. It may never be\nanother Citizen Kane or Casablanca, but I really enjoyed Tomorrowland\nand its message, and it instantly earned a place on my rather small\nlist list of favorite films. Clearly, it's not for everyone, but I\npersonally loved it. Check it out. You may too.\n"},
{"review": "\nI think, this movie is much more complicated and multidimensional, than\nit might seem at the first sight. At the same time it looks at one go.\nI watched it already 3 times. The Idea and the major feeling of this\nmovie are totally Christian: \"According to your faith be it unto you\".\nBeside the great work of Britt and the fantastic duo of Clooney and\nLaurie an absolutely mind-blowing element of this film is Raffey\nCassidy's acting. She stunningly coped with a near-to- unachievable\ntask - to perform on the screen a truly transcendent character, whose\nmesmerizing emanation (esp. through an absolutely special expression in\nher eyes) sometimes even reminded me of Higher Power representatives on\nthe paintings of Leonardo: the unearthly tenacity of spirit, the\naxiomatically inexhaustible faith, the highest wisdom, the deepest\ncompassion and condescension and the immanent joy of self-dedication\nand belonging to the saving source of true life - to Love. I find this\nfilm extremely timely and modern. Many-many thanks to the writers,\ndirectors and actors for their preeminent and so essential work!\n"},
{"review": "\nWe've spent years watching science fiction productions fairly\ninexpensive, but it is that despite having little publicity, he became\na very good movie, with a fairly high budget without the many special\neffects you have, which makes this film quite surprising in view, in\naddition to usher in a world fantasy full of possibilities and dreams\nthat we all want to have, introduces us wonderful characters of which\nwe can each one pull out a good message.<br><br>It's amazing and the moral message that leaves us at the end of the\nfilm, and does not end there, it's also a film for all ages both\nchildren understand the film in its own way as adults with some\nknowledge of science and science fiction can find a wonderful sense to\nthe film.<br><br>Finally I can say that the film will never bore and two hours and 11\nminutes it takes you will be stuck so that when finished you will see\nseen one of the best works of the new generation created by Disney\n"},
{"review": "\nThe movie is really exciting. From the very beginning, George Clooney\nwill make you like it. It is made for both children and adults. There\nshould not be any negative review on this movie. Budget was excellently\nused to make the graphics enticing. Although the setting was\ninterchanged, it tried to go with the title of the movie. There is a\nsurprise in the movie in every scene. Very disappointing that it did\nnot perform in terms of box-office but it deserves better. Actors\nreally did well and every second is exciting. It deserves another\nchance to be previewed again. This movie is Tommorrowland. Any other\nstatement is obviously vague. The 2 votes that did not make the cut is\nbecause the movie was \"too deep\". Too deep in the sense that you really\nhave to think to understand the movie. It does not appeal to the common\naudience. One needs to be really understanding to get what the movie is\ntrying to portray\n"},
{"review": "\nThere seem to be two ways to view this film it seems. <br><br>1. You hate it and feel it is a waste of time.<br><br>2. You are inspired, watching the film with goosebumps out of sheer\nenthusiasm and feeling - this is what the world needs!<br><br>Count me squarely in no.2. I found the film to be inspiring and awesome\nand after watching it with my wife, I genuinely feel that there is a\nchance to change the world for the better, if we only dare to act upon\nit.<br><br>This is a must see film. I would not be surprised if this film becomes\na cult classic.\n"},
{"review": "\nOkay, after reading many of the reviews of this movie on this site-many\nof them on the negative side-here's mine: It was mostly quite thrilling\nand touching and a little thoughtful and occasionally humorous and it\nwas awesome seeing it on an IMAX screen! Perhaps it was a little long\nfor a family film but, still, I think many kids would be a little\nenthralled in this with the way director Brad Bird movies things along\nmost of the time. George Clooney and Hugh Laurie perform well in their\nroles and that girl robot and teen girl also were pretty good,\ncharacter-wise. I suppose I have to admit that the story took awhile to\nget together but when it ended, I sorta thought it made enough sense by\nthat point. But I don't blame anyone who wasn't too thrilled by this\nmovie not getting it. So on that note, Tomorrowland is at the least,\nworth a look.\n"},
{"review": "\nThis movie was so good that it inspired me to write a review and i only\nwrote 1 other review besides this. I did not expect this movie to be\namazing, but it was. This movie shows us that we could change our\nplanet by the way we think about the future. However we choose to think\npositive or negative can affect the future. The future is not set, The\nfuture can be bright.<br><br>The acting from Raffey Cassidy was Amazing, she can act. The way she\ncarries out her expressions is on par with Actresses like Emma stone\nand Jennifer Laurence. <br><br>I hope Disney makes more movies like this. It Inspired me and gave me\nhope for the future.\n"},
{"review": "\nI like that the Film addresses the issues of missing solutions, ideas\nto overcome the Problems we are facing in the world. I agree that a lot\nis going wrong in our education system and the world in General. I\ndon't like that they blame politicians and greed without pointing out\nthat it is we all who are greedy who allow individuals to accumulate so\nmuch money because everyone hopes he get's his lottery ticket one day.\nGuess what: It's not gonna come. What I am trying to say, the film has\na good Analyse, but lacks showing any kind of real Solutions apart from\nletting children dream that they are chosen to get in an isolated,\nbetter place. That they get a letter that they can get to Hogwarts. We\ndon't need a holy city of science in another dimension. We need to\nfigure out how to better organise society and economy here and now on\nthis planet.\n"},
{"review": "\nTomorrowland, 2015.<br><br>*Spoiler/plot- Tomorrowland, 2015. A pre-teen girl finds a mysterious\nring and once it is worn transports you to another world full of\namazing technological tools and people. She works to learn more about\nthe ring's origin and tracks down the reluctant ring's owner to return\nto the magical futuristic world.<br><br>*Special Stars- George Clooney, Hugh Laurie, Britt Robertson.<br><br>*Theme- Imagination can solve much of our problems.<br><br>*Trivia/location/goofs- Filmed in Louisiana, USA. Closely based on Walt\nDisney thoughts and work in his theme parks plans in 1952. Watch for\nall the 'hidden Mickeys' in this film scenes.<br><br>*Emotion- A unique and fun film plot idea. Weaves into the film visuals\nsome futurist ideas that Walt Disney incorporated into his theme park. <br><br>*Based On- Disneyland's Tommorrowland area them park area ideals and\npurposes.\n"},
{"review": "\nGeorge Clooney and Hugh Laurie are great. Nix's big speech was awesome.<br><br>The look of Tomorrowland imagined by people in the 60s is awesome. It\nhas cool pieces of technology like the time bomb and freeze gun and\nthere was an awesome robot fight. The basic plot and theme are solid,\nfeed the right wolf by acts of compassion, giving and love and don't\nfeed the wrong wolf of greed, self servitude and hate, though they may\ncome across to some as too preachy. The ending was brilliant where\npeople from different cultures are invited.<br><br>Some of it is a bit derivative (Baymax style safety suits), the adult\nFrank Walker looked creepy for his love for Athena and film is little\ntoo meta once you realize the movie itself is sorta feeding the wrong\nwolf since its also about the immediate threat of an apocalypse but it\ndoes show the future can be changed by being optimistic that people can\nwork together to change things.<br><br>The robot Athena was cool and it was a shame she died. The film\nsucceeds in being different to the trend of Dystopian movies we've been\ngetting recently by shown that change is possible.\n"},
{"review": "\nGeorge Clooney plays George Clooney as usual, what else could you ask\nfor? The film also has some pleasantly thought-provoking themes that\nleft me wondering whether the villain was truly evil or not. To add to\nthis, the ultimate message of optimism that shines throughout the film\nis something lacking somewhat in films these days, and really makes\nthis one stand out from the crowd in the glut of super-high budget\nfamily films that have been produced in the last few years.<br><br>Now, important to add is that this is very much a kids' film. So maybe\nnot an appropriate film to see with your college or work mates on a\nnight out. And naturally, don't go and see this expecting masterful,\nsubtle storytelling or realistic dialogue. The story and dialogue are\nboth unabashedly silly, but quite frankly, why on earth would anyone\ncare? Don't go in expecting a storytelling masterpiece. Honestly, just\nsit back, let down your critical barriers and enjoy the magic of\ncinema.<br><br>And one more thing: If you're reading this in time, this is DEFINITELY\na film to see in the cinema while you can. Get the benefit of the big\nscreen and surround sound while you can.\n"},
{"review": "\nwhat a brilliant movie they showed future but i have already seen that\ntype in many movies but they just make is much then much amazing i just\nlove this movie this movie have little similarity with lucy movie they\nboth go same way in future or past and this is the second movie i give\n10 rate in IMDb after lucy. lucy is the my first all time favourite\nmovie both much related to science stuff but in this movie i like the\nway they showed to go in a future city or something and the most amazed\npart to go there they uses a rocket and which is launching between the\nParis eiffel tower the rocket was launching between it that's is\nincredible and in starting there is a batch type something when girls\njust touch it she is in future how fast is it just touch and reach even\nshe is not reach in real but she can see all stuff like real i like\nthis very much and the pretty girl robot who did find both two wise\nguys and in last they showed emotion in the robot girl even this is not\npossible maybe she is a robot but it makes end much much better if you\nliked lucy movie i am sure you will love this one two like me\n"},
{"review": "\nHave We become so Cynical that a Fun Frolic of Super Special Effects\nsurrounding a Message for Our Time that has gone Unheeded despite the\nFact that the Signs of our Disconnect from Fixable Problems and the\nNeed for Reexamining Our Priorities and Abandoning Our Apathy, is met\nwith this Hateful Disregard.<br><br>Sure, the Preaching is well, Preachy, but what does Anyone Expect? Some\nsort of Egghead Verbosity with \"Between the Lines\" Insight Needed to\n\"Get It\". Fact is, We don't \"Get It\", so \"Once more into the breach\". <br><br>It has to be said Again and Again, Over and Over, Dumbed Down to the\nLowest Common Denominator, Sledgehammered Home, if We are ever going to\nWake Up and Smell Catastrophes awaiting.<br><br>The Movie is Filled with Feisty Youth (after all the future is Theirs),\nRousing Action, enough Eye Candy to cause Cataracts, and Yes, a Topical\nRant. It's Clever and contains what amounts to a Cartoon Ride of\nAdrenalin and Every Member of the Human Race has a Ticket. So Pin on\nthe \"T\" and Get Going. <br><br>The Film is Noble, not without flaws, but its Intent is Admirable and\nis Entertaining with its Post-Modern Palette. A Family-Friendly,\nSci-Fi-Action-Adventure that is Highly-Underrated and comes with it a\nCritical Knee-Jerk Reaction to Clooney Politics and Compartmental Party\nDisdain with Ideological Idiocies that Hate what's to Love.\n"},
{"review": "\n\"Tomorrowland\" is a sci-fi adventure film with a beautiful\ncinematography and good cast, highlighting the gorgeous and talented\ngirl Raffey Cassidy. There is good action scenes and special effects.\nUnfortunately the story fails since does not provide explanation about\nTomorrowland. Is it an alternate dimension or a distant planet? How is\nexactly the connection between Earth and Tomorrowland and how does it\naffect Earth? Unless the viewer researches Internet, he or she will not\nfind the answer in the film. Maybe the intention is to make a prequel\nwith the missing explanation. But anyway it is worthwhile watching. My\nvote is seven.<br><br>Title (Brazil): \"Tomorrowland: Um Lugar Onde Nada é Impossível\"\n(\"Tomorrowland: A Place Where Nothing Is Impossible\")\n"},
{"review": "\nTomorrowland has a lot of fresh and creative ideas, but its ambitions\nbecome over reaching, and the movie feel chaotic and out of control at\ntimes. There are many wonderful themes that are explored by this movie,\nbut the movie didn't quite expand on them enough in my opinion. There\nare decent performances from Clooney, Laurie, and Robertson, and there\nare some funny on screen moments with them. Their overall chemistry\njust added to the fun displayed on screen. I feel one of the biggest\nweaknesses, is that the movie wasn't fully developed within its 2 hour\ntimeline. Another problem is that the villain had weak character\ndevelopment and motivations. Overall, this movie is worth a DVD rental,\nand is worth watching once at home with your family, but doesn't\nwarrant a trip to the theaters.\n"},
{"review": "\nExceedingly bright and optimistic, Tomorrowland is a fun and uplifting,\nyet thought provoking film for both adults and children. It's a shame\nsuch an original work is being so under appreciated, I would highly\nrecommend going to see it.<br><br>In stark contrast with the majority of films these days, Tomorrowland\nbrings a sense of optimism and hope to the future. So often are we\nsubject in film to futures that are dark, grim, gritty wastelands that\nI forgot how refreshing a film about a bright and better future really\nis. Tomorrowland is director Brad Bird's most recent addition to his\nportfolio of already fantastic films (The Incredibles, the Iron Giant,\nRatatouille, and Mission Impossible: Ghost Protocol), and as much as\nthis film is getting panned by the majority of critics, it is very well\ndone affair. A completely original film, Tomorrowland really stands out\nas a fun, optimistic piece that's really quite different from the\nmajority of films coming out these days. Go read my full review here!<br><br>http://nerdnut.blogspot.com/2015/06/the-\nblindingly-bright-world-of-tomorrow.html#more\n"},
{"review": "\nIt's hard to speculate whether like Avatar (2009) the novelty of the\nfresh new look of a movie has a lot to do with a movie's popularity or\nrating. In Tomorrowland there is both the initial nostalgic retro-feel\nof a glorified past 50s at the New York World's Fair which I did attend\nas a child and the fantastic images of a future that really never gets\nthe brilliant and spectacular vision of hope and optimism. Unlike the\nsci fi classic Blade Runner (1982) and its dark vision of Los Angeles,\nTomorrowland presents a different look. It's a look that is so\nenticingly omitted at the end of The Day Time Ended (1979) a rather\nmediocre sci fi movie that involves time travel.<br><br>This family Disney sci fi adventure has a family connection element, a\nchildren's element, and except for some deadly live action scenes that\nseems out of character for a family Disney movie, this entertaining and\nemotionally appealing movie captures a step above the ordinary sci fi\nmovie. Unlike Orson Scott Card's Enders Game (2013) there is more a\npersonal, relational dynamic that plays with fate, destiny, and\nimagination of the innocent, wondrous, special type.\n"},
{"review": "\nSo far I've only seen bad reviews about this movie , and since I had so\nmuch fun watching it last night and offcourse my moonsign is Libra I\nneed to equal things a little bit here and simply give it a 10 when in\nreality I would rate it 9 for Fantasy And FUN and maybe 5 or less for\nprobability because that is one of the aspects for the bad reviews I ve\nread so far. Written By Older people who watch maybe 1 or 2 movies a\nmonth they complained about the Improbability and Unlikelyhood of many\nthings that you will see in this movie. But in the end - I guess that\nis what really makes it a - FANTASY am I right ;) ... The 2nd reason\nfor the bad reviews was because they saw the trailer for this movie and\ndecided to go and watch it in the cinema. Now, because they paid to\nwatch it, they expected way too much of it , and in the end got\ndisappointed. Anyway, watching this movie was great fun for me and I\nhope that I will see more movies like this one. I just love this genre.\nUnlike those people who wrote the bad reviews I am someone who watches\nLots and Lots of movies and series and I can tell when a movie is worth\nto watch or not and this one IS... I didn't pay to watch it so I wasn't\ndisappointed at all and I will watch it again as soon as I find better\nquality version of it... In short - Kids and Teens will love it, also\nsome more open-minded adults ;) It is excellent Family watch... Just\nclose your eyes and say - Anything is possible - and you will like this\nmovie too, it isn't a scientific documentary, it is a FANTASY movie !!!\n"},
{"review": "\nI almost didn't watch this movie due to the reviews it received here,\nbut I'm glad I did because I really enjoyed it. What I found was that\nthe reviews stating they couldn't follow the storyline, or that it was\nsenseless or boring, or that it used pseudoscience most likely weren't\npaying attention, know little to nothing about science, history, or\nquantum mechanics, and like their movies to explain every detail in a\nnicely wrapped little package with absolutely no previous intelligence\nrequired.<br><br>This movie does require an ever so slight bit of intelligence to get\nthe most from it. It has historical references. I can almost hear\nwhoever's reading this groan, but you can relax, the references are of\nhistorical figures that anyone with an eighth grade education should\nknow. I stress the word should. Now the science and technical\nreferences are a bit more advanced, and they don't explain the science\nbehind it, so for someone that barely knows how to work their\nsmartphone I can see the assumption of pseudoscience, plus most people\nwill simply go \"SCIENCE\" or \"TECH\" and leave it at that. However for\nthose that are familiar with and do understand the references, such as\nthe use of tachyon particles, it's a nice little hat tip from Mr. Brad\nBird.<br><br>To sum it up, it's an overall enjoyable movie even if you don't get all\nthe references.\n"},
{"review": "\nI just saw this movie with my wife, my 2 teenage kids and one of their\nteenage friends. We all LOVED it! All 3 of the kids said it was one of\ntheir favorite live action movies in recent memory (all 3 really liked\nGuardians of the Galaxy as well). I can't see any reason for some of\nthe really negative user reviews except for perhaps for people who are\njust generally cynical about life in general. Or perhaps people who\ndon't like Disney in general, or don't like Brad Bird or George\nClooney? I'm not sure what it is. I'm a film major and as big a fan of\nmovies as anyone I know and I highly recommend this movie. The acting\nwas excellent all around. The screenplay was original. The soundtrack\nwas great.\n"},
{"review": "\nBut of course, we are the people who would have lived in Tomorrowland.\nWe aren't cynics, we aren't self-absorbed Millenials, and we are\neducated. To those with the wisdom to see, Tomorrowland is a message of\nhope, and the plot makes perfect sense.<br><br>Yes, it is silly at times, the villain too one-dimensional, and some of\nthe technology looks like a Rube Goldberg device, but it was no more\nfar-fetched than the gadgets in \"The Davinci Code\", \"National Treasure\"\nor \"Doctor Who\", all of which are international sensations. Enjoy them\nfor what they are.<br><br>Is it an original story? Absolutely not. Preachy? If you thought this\nmovie was preachy, read Cyril M. Kornbluth's \"The Marching Morons\",\nPlato's rejections of democracy*, or anything written by Ayn Rand. All\nof this was required reading when I was in school. Tomorrowland largely\nsugarcoats what is a very real problem. Unfortunately, it's one that\nwill not be solved, as NOTHING has changed in the past 3000 years.<br><br>I find it amusing that so many peoples berate this movie, yet faun over\nBioshock, a video game with *exactly* the same premise, \"crazy\"\ndevices, and hordes of mutants and unstoppable killing machines\ndefeated by a single man.<br><br>P.S. Plato was right.\n"},
{"review": "\nFirst off I wouldn't be Clooney's Biggest Fan. I find him very hit and\nmiss with some right Stinkers in his back catalogue. No other Actor has\never been forgiven as much as George.<br><br>This however is Clooney at his finest. For some reason he works best\nwith young Female Leads. Shailene Woodley In The Decendants, Anna\nKendrick in Up In The Air and Now Britt Robertson and Raffey Cassidy in\nthis fine Disney Action Adventure Film. The relationship on screen is\nonce again magic between the two girls and Clooney. The Father Figure\nseems to bring out the best in Clooney.<br><br>The Movie starts slow but kicks into gear once Clooney shows up.<br><br>Hugh Laurie phones this one in and any Actor could have done as well in\nhis role. But that doesn't take away from the flow of this movie. Once\nit takes off it doesn't stop. We find that we care about the 3 Main\nCharacters. The two young ladies are superb and Young Raffey puts in an\nastounding performance and we forget that she's only 13 years old so\nmany times during this movie.<br><br>Britt more than holds her own against Clooney during the Movie.<br><br>This is a good family movie, with a good positive message and lots of\nhighs and lows.<br><br>You cant go wrong with this one.\n"},
{"review": "\nI was intrigued when I heard of Tomorrowland; a movie made off of a\narcade ride! I was not disappointed in the least. The cast is well\nchosen and perform their roles well; I was most impressed with Athena\n(Raffey Cassidy), I expect we might see her around more in the future,\nand seeing Hugh Laurie as the antagonist is appropriate; I love his\nwork. The directing and editing are performed well enough. Being a\nDisney film does lend the over-all story and plot lines to have certain\npredictability - all of which is fine for me. The special effects were\nvery good. The movie is for all ages, both in context and content,\nchildren will be able to follow the story. Take the family and enjoy!\n"},
{"review": "\nI like this movie, well to say that I mean I like the movie up until\nthey get to Tommorowland. The movie up until they get to Tommorowland\nis richly original and fun to watch. I thought it was cool seeing our\ncharacters traveling across the country and encountering sci-if stuff\ncontrast to the homely city location. It was just such a fresh take on\nsci if and I was loving how it looked, but then we do go to\nTomorrowland and it sucks. That's when things are confusing, and don't\nreally excite as much as the first 60-70 minutes. I'm not saying\nremoving the arrival to Tomorrowland would've made a more interesting\nmovie, the movie just needed to make the Tomorrowland segment more\ninteresting. But for the film they are getting across I liked it fairly\nwell. After all this movie's heart is in the right place with a hopeful\nmessage. <br><br>Overall: Not as great as Pirates of the Caribbean, but not as terrible\nas The Country Bears either.\n"},
{"review": "\nTomorrowland (2015) Starring: George Clooney, Hugh Laurie, Raffey\nCassidy, Brittany Robertson, Thomas Robinson, Kathryn Hahn, Tim McGraw,\nJudy Greer, Keegan Michael Key, and Christopher Bauer Directed By: Brad\nBird Review Imagine a world where nothing is impossible. If the film is\ncalled Tomorrowland then why isn't about time travel. (it's a terrible\njoke). This is actually based on a Disney attraction that i'm guessing\nthat had to do something with a persons imagination and they would\ncreate wonderful things for this world. The film centers on a girl\nnamed Cassie(Britt Robertson) who finds this pin after she is arrested.\nWhen she touches the pin she goes to this amazing place called\nTomorrowland. But when the pin dies she tries to find out more about\nthis place while being chased by Security agents from Tomrrowland.\nAlong the way she meets Athena and Frank who help her try to save the\nearth and bring us to Tomorrowland. Before I saw this film I heard it\nwasn't that impressive which broke me to pieces. I honestly thought\nthis would be the best live action Disney film ever. That titles still\nbelongs to this years Cinderella. But a lot things buged people about\nthis flick, on the other hand only two of those problems I can agree\nwith, it's the inconsistent tone and ending where it's like save your\nplanet. We have seen that message a million times and it's been done to\ndeath. The inconsistent tones comes from how the movie can feel like a\nchildren's film, but then its a hard adult drama and then back and\nforth. Everything else I found to be fine with in the movie, the acting\nis great, the pacing is good and I still can't see what else there\nisn't to like about this picture. It's creative, imagnititve, fun, has\ngood characters and Brad Birds direction was impressive, not his best\nwork clearly but for a mis-step it's not that bad, it's a pretty great\nfilm. I'm giving Tomorrowland a four out of five.\n"}
]