[
{"review": "\nI recently saw Sucker Punch at an advance screening and thoroughly\nenjoyed it. To be honest, I am the target demographic here. I'm a guy\nin his twenties who plays video games and enjoys fantasy movies and\naction.... but this is a decent film overall. It appeals to my\n\"sensible adult\" side that appreciates a good, well written film, with\ngreat directing, great acting, and overall good cinematography. It also\nappeals to my \"twenty-something male\" side that loves sexy ladies,\nguns, killer robots, dragons, samurai and swordplay. The abundant CG is\nstunningly beautiful and doesn't feel overdone or become visually\nexhausting like some movies. This movie gets me. and I know that there\nwill be a good number of people who dislike this movie, dismissing it\nas juvenile, or stupid. who dislike the amount of CGI used in this\nmovie. I don't care... I love this movie for exactly what it is... a\ngood movie that appeals to me in every way.\n"},
{"review": "\nI have been absolutely pumped for this movie since I first saw the\ntrailer for it last summer. I'm fresh from viewing it, and I have to\nsay that it's not quite what I expected, though not necessarily in a\nbad way. To those who haven't seen it, two words: Do it. But be open to\nthe fact that it will almost certainly not be exactly what you expect.\nAlthough it looks like a somewhat mindless kick ass, eye candy flick,\ndon't be fooled: there is a pretty good story here, and its deeper than\nyour first impression of it will be, also. Oh, and don't try and\npredict the ending.<br><br>After you watch it, you will need to process what actually happened,\nbut put your thinking cap on- because its deeper than you think.<br><br>All in all, the acting was good enough (though it didn't blow my mind),\nthe visuals are stellar (did blow my mind) and the soundtrack is\namazing (where is my mind?). Definitely worth seeing. 8/10\n"},
{"review": "\nSucker Punch is totally out there, and probably the only way to combine\nso many different things in a single story.<br><br>The story telling is incomplete, in itself, but not the story. Most of\nit is told metaphorically. You get to imagine the rest. An easy thing\nto do is to dismiss the movie because of the beautiful women, or the\nintense and fantastical action. That is a grand mistake. The story is\npoignant and very sad, yet wrapped in a beautiful cinematographic\ncocoon. It's breathtaking. I kept wondering when the hammer blow of bad\npoorly constructed elements would descend upon me and disappointment,\nbreak my heart. It never did.<br><br>The dialogs might look simple, and the story line really quick, but\ntheir complementing information is in the magic of the metaphors. It's\nan incredible ride led by the excellent acting of those gorgeous\ncreatures and genius directorial mind, as well as the superb editing\nand CGI.<br><br>Ride the wave, shed a tear, see it.\n"},
{"review": "\nEven with millions of bullets flying through the air, dozens of swords\nswinging &amp; the hundreds of punches these hotties take, not one of these\ngirls ever gets a single scratch during the battles. After the first\nbrawl pitting the Girls Club against steam-powered Germans &amp; ferocious\nshooting planes it's so painfully obvious that none of the girls will\nbe in any real danger that the big budget special effects are just\nfluff &amp; overkill. What's the point of all the bullets &amp; bad guys if the\nchicks are indestructible? By the second battle it's just so irritating\nwatching these females punch, kick, shoot, jump &amp; slice their way\nthrough crowds of bad guys when they could have just walked &amp; not\ngotten hurt. The story is clever but watching chicks that fight again &amp;\nagain &amp; can't possibly be defeated is not one-tenth as interesting as\nwatching people who can actually die in battle.\n"},
{"review": "\nI,m not sure who and why rated this masterpiece so bad, I guess it's\njust that you either love it or hate it...but the movie has everything\nand is for everyone. You just have to let yourself go in it and enjoy.\nWell, half naked and attractive girls kicking ass, dance, strip;\nfantastic music, flawlessly directed fight scenes, drama, sadness, true\nnature of man who is just evil and one good girl is giving all to beat\nit. With every viewing you get something new, cause it's hard to\nunderstand it fully. But that's the beauty of it, the story behind of\nanother story, dream within a dream and it's all wrapped up in a box\nwhich is made to entertain and teach you something. That's what movies\nare for, and that's why I love it!!\n"},
{"review": "\nI heard nothing but bad things about this movie, and I finally saw it.\nI fell in love with it. Everything about it was so great and visual (as\nexcepted with Zack Snyder). What people lose grasp of, I think, is that\n90% of the film is in Babydoll's head. Therefore, anything goes. Yeah\nthey're dressed scandalously, but what else would they be wearing in a\nyoung girl's mind? And of course they're going to be able to fight,\nit's all in her mind. It was a way of escaping for Babydoll. If my\nmother and sister were just killed, I might be a little screwed in the\nhead too, wouldn't you? I think people saw the preview, and just\nassumed hot chicks and special effects. They didn't (and usually never\ndo) think beyond what is shown to them on screen. I love Synder's work,\nand it's sad that this is by far his least appreciated film.\n"},
{"review": "\nThis is by far, Zack Snyder's worst movie until present time. However,\nit is still a ravishing visual spectacle, guided by a magnificent\nfeminine bombshell cast and accompanied by an electrically dynamic\nsoundtrack.<br><br>The problem is that these elements are unable to delete the sensation\nof a story sometimes told in a 'videoclip' manner and the ''300''\ndirector on a autopilot mode, only concerned with the film's aesthetic\noutlook.<br><br>Despite that narrative ellipsis, this is a perfect Sunday afternoon\npopcorn flick, presenting itself as a delirium 'video game' crossing\nbetween ''The Matrix'' and ''Charlie's Angels''. Only without the\nintellectual quality than the first one, but with more and better\naction than the second.\n"},
{"review": "\nWatch the extended version, do not watch the theatrical version, I\nrepeat the extended version is 1000% better and it makes sense and it\nhas two well known actors in it that were cut from the theatrical\nversion! But be warned it's darker, but only because we get\nanswers....... The rest of this review must be non-filler. Why is it\nrequired that I type this much, who knows? This movie, with a proper\nending, can be compared with Fight club, if that doesn't convince you\nmaybe my personal testimony will, I almost never write reviews on here,\nI've only written one other review other than this one. Watch the\nextended cut! If anything watch it to see more of the high roller,\nplayed by John Hamm and to understand the ending.\n"},
{"review": "\nAn impressive and inspiring fantasy movie with impressive visuals and\nimpressive cast, a fascinating movie that tried to speak to you outside\nof reality, a movie that inspires you to dream, to live in a reality\nwhere you can control everything, a movie that deserves to be called a\nmasterpiece, a movie that teaches you that it doesn't matter where you\nare the mind will always be our home sweet home.<br><br>Strong and solid performances in the movie, worth to mention Emily\nBrowning as the lead character that connects with the audience and\nAbbie Cornish as the fascinating strong headed deuteragonist, Carla\nGugino outshined half of the cast with her solid performance as Dr.\nVera Gorski, but Scott Glenn and Abbie Cornish are the ones that truly\nshine in this fascinating movie with strong and solid Golden Globe\nworthy performances.\n"},
{"review": "\nI give this movie a 7 out of 10. The Movie is about a young girl who is\nsent into an asylum by her evil step dad and then creates and alternate\nreality in her head in order to find a way to escape. Emily Browning\ndid an amazing job at portraying Baby Doll, her real name (in the film)\nwas not used because they were given stripper names. This was not just\na normal asylum. During the film the director, Zack Snyder, used many\ndifferent elements including music and camera angles to give a sense of\nsuspense or shock during the scenes. What i think makes this such a\ngreat film is because it is very serious about a girl being trapped and\nmisused, however in her alternate realities, Baby Doll gets to fight in\nmany engaging action scenes throughout the movie instead of watching\nher dance on stage. Which also helps make the movie more about the\ncharacter and not about half naked girls dancing on stage for fat old\nmen smoking cigars.\n"},
{"review": "\nthis film is one of the greatest films ever made, this is way better\nthan Inception, in the film, <br><br>they keep telling you that \"Its you who holds the power over the worlds\nyou create\" and its true you get to choose/believe in whatever you\nthink happened in the film, whether Babydoll accidentally shot her\nsister or framed by her father, whether babydoll is real or the girls\nor they could just be a pigment of SweetPea's imagination, there are a\nlot more theories that you get to choose how to end. but them (the\ngirls: baby doll,sweetpea,rocket,blondie and amber are definitely using\ntheir bodies sexually, to get what they need but instead of thinking\nthey are being raped/abused they turn them into action packed fantasies<br><br>this film has little dialogues and an and the story line really quick,\nbut thats the best part of it , SO PAY ATTENTION while watching. It's\nan incredible ride led by the excellent acting of those gorgeous\ncreatures and genius directorial mind, as well as the superb editing\nand CGI.\n"},
{"review": "\nI totally love it. The story, the acting, the CG &amp; the music. Movies\nare made to entertained and i was. And it had a metaphor which was\ngreat. The first time i saw it i didn't quite understood it, mostly\nbecause as many other people I'm not used to \"think\" to understand a\nmovie. But after watching it a couple of times, it becomes more a more\nclear to me. Besides I love the music so much it wasn't a drag. I will\nsee this movie again and again :) I don't know what else to say. I\ndon;t usually give reviews to movies, just because i think people like\nso many different things, but i figure this would be my way to\nrecommend this amazing film to you. Give it a try, I'm sure you won't\nbe disappointed.\n"},
{"review": "\nNo words to say !! Its like , when poetry becomes a movies !!! I'm glad\nthat the movie has 6.1 score because if everyone could understand that\nmovie then a problem should arise to our mind.why the word we line in\nis like that? That movie addresses to few people!!!The colors, the\npictures, the scenario, the words , the acting was perfect. while i was\nwatching this film, i could image of an old person, in a peaceful\nplace, talking to me about life and about my inner personality that\ncontrols my mind. Just like an angel. sometimes it is hard to face the\ntruth that comes up from our soul. sometimes we know it is hard to look\nat ourselves, to put up a fight to our ego.what is the reality we have\nto defense? and what is the true meaning of the word reality? who\nteaches us what is real and how to laugh at lies? who chains us? and\nwho holds the key that can set us free?\n"},
{"review": "\n...And Zack Snyder delivered the goods over and over and over the top.\nHe is now (having not seen the Owls film) IMHO in a small collection of\ndirectors as Masters Of The OTT: Terry Gilliam, Baz Lehrman, Ken\nRussell... and now, Zack Snyder.<br><br>This film has been sniffed at and derided by the critics, a collective\nshrug of Meh... and it is wholly undeserved.<br><br>This is Zack Snyder's The Matrix Inception at Moulin Rouge, as stylish\na musical as anything else out there, but filtered through the creative\nmind that has lived the era of MTv meaning music videos that were short\nmusicals and sometimes (all of my favorites, anyway) short musical\navant garde films.<br><br>Wild, rollicking, slipping into and out of eras and aeons, seriously\ncool soundtrack, it is eye candy for people with functioning brains.\n"},
{"review": "\nIt is one of my best ( if not the best ) I hope there will be a Sucker\nPunch 2 movie ..<br><br>and if there won't be .. there must be a remake or at least another\nmovie of the same kind and directing :)<br><br>I think that Sucker Punch is a great idea of an epic action fantasy\nthat takes us into the vivid imagination of a young girl whose dream\nworld provides the ultimate escape from a there.<br><br>Sucker Punch does damage and is an increased priority move. If the\ntarget does not use an increased priority move during the round that it\nis used, Sucker Punch will go first regardless of the user's or\ntarget's Speed.\n"},
{"review": "\nI've read a lot of bad reviews on this film but feel that perhaps\npeople are missing the point.<br><br>Yes- the movie is chaotic and confusing. It's difficult to know what if\nany of this film is set in the real world or if it's all a schoolgirl's\nparanoiac fantasies. But I think that's the whole purpose of the movie.<br><br>We don't know and it's quite a ride. Is her stepfather abusive? Is her\nsister? alive or dead? Is she in an institution for juvenile delinquent\ngirls, a French finishing school for rich young debs, a child brothel\nin Eastern Europe, an American mental asylum or none of the above.<br><br>It doesn't matter. We're looking at the workings of an unbalanced mind\nor minds and it's graphically, and visually stunning, with a soundtrack\nto boot- and that's the beauty of it. Oh - and girls can do anything.<br><br>Just enjoy.\n"},
{"review": "\nI think Zack Synder must suffer from ADHD judging by this film, and\nthats not a bad thing. I've been a fan of his since Dawn of the dead,\nnot a fan boy but I like his style over substance filmmaking, he's\ncertainly better and more consistent then a lot of other big budget\ndirectors out there.<br><br>Right from the start we are in the familiar Snyder-isms of CGI and slow\nmotion. Complaints about the lack of story are valid but then that's\nnot the point of this film. Its purely a visual experience and as such\nit delivers in spades.<br><br>Coupled with the sheer beauty of Emily Browning's eyes and game\nperformances from all involved, this is great, not perfect, summer\nentertainment. I think that Synder continues to grow and develop as a\nfilmmaker, and I look forward to his Superman film.\n"},
{"review": "\nThis is one of he best movies, I've ever seen. It's real, and unreal at\nthe same time, it's gripping and emotionally engaging. It's also full,\nof eye candy, but that only adds to the feel of some parts being\nunreal, and because of that they are also beautiful, while the reality\nis cruel and unforgiving. The cast was chosen excellently, the music\nand sounds were beyond perfect. Well, I guess, I am not a really good\ncritic, but if a movie makes me register to a site, just to worship it;\nthan that movie has accomplished something thousands of others\ncouldn't. I strongly advise anyone to go on and watch this movie, it's\na masterpiece. P.S.: If you got scared of how too artistic, or too\ncruel this movie is at the very beginning, than give it an other try,\nyou wont regret it..\n"},
{"review": "\nperfection. its not all about a fantasy movie or comics its all about\nbrain. and deserve really hard applauds. thats the point; there s one\ngirl who fight against her fears and what she got from life and finally\nshe wanted to escape. and she doing this so well in her brain. with\nguns, with fire and all the immortality. those re means endless power\nof her about what she wants to do. escape. <br><br>the end of this experiment (i mean the movie) we think that everything\nabout ourselves. everything in our hands. all the good and bad things.\njust about our minds. but later we seeing some other point, we cant\nknow and see who will gonna make light to our way in the future. its\nlike a miracle. <br><br>totally loved this movie. its just all about catch the meaning. but\npeople will see that what they want to see.. or what they can see\nanyway. have a nice day.\n"},
{"review": "\n\"You will be unprepared.\" It was the tag line for this movie and I was\nunprepared like literally, it took my breathe away scenes after scenes.\nI really do have high hopes for this movie and it lived my\nexpectations. Since it was announced I told myself that I have watch\nthis movie. The first twenty minutes has no dialog. No one said a thing\nbut you can clearly see what they were going through. Then it follows\nthe sudden change of the movie setting. It started from the asylum then\ninto a burlesque brothel. Then every time Baby Doll (Emily Browning)\ndances, she channels another world. A world where she and her friends;\nSweet Pea (Abby Cornish), Rocket (Jena Malone), Blondie (Vanessa\nHudgens), &amp; Amber (Jamie Chung) kicks asses of Samurai-robot warriors,\nclock works, dragons, gores and robots from WWI to dragon lairs. And\noh, the action sequence is AMAZING &amp; the CGI effects was epic. This Zac\nSnyder film will blow your mind away with an incredible story line. So\nto make this long story short, GREAT MOVIE! I recommend you to watch\nthis.\n"},
{"review": "\n2007 he brought us \"300\" and in 2009 he brought us the comic book\nadaptation \"Watchmen\". Now we are blessed with \"Sucker Punch\". <br><br>Im not going to explain the movie in this review, but I am going to\npoint out the good and the bad points.<br><br>PROS: I love the action sequences. Sure, they're a bit cliché, but who\ngives a flying f**k. I love the way Synder makes his movies. The story\nis deep and great. and the graphics? This is Blu-ray material, ladies\nand gentlemen.<br><br>CONS: the PG-13 rating. It holds this movie back a lot. It could have\nbeen better if they had released it as an R rated movie. (this is the\nonly reason keeping me from giving this movie a 9)<br><br>If you enjoyed 300 And Watchmen, You'll love this, If not, go watch\nBattle: Los Angeles.\n"},
{"review": "\nThe plot lacks of some development, as well as some of the characters,\nhowever, it is very entertaining to see the action scenes in their\nsurrealism, yet it is very anime-styled action,<br><br>*** SPOILER ***<br><br>Basically our main hero is a small girl which creates a surreal world\nto survive a place where girls are orphans sexually exploited, in her\nsurreal world she fight's against giant monsters, robots, soldiers and\nsuch in a small skirt while getting objects needed to escape from the\nplace.<br><br>***************<br><br>I would recommend to see this movie on a free night one might have, i\nthink it wouldn't be a waste to pay cinema price for the visuals in\nthis movie but it would be OK to watch it on a DVD as well, i've found\nthis movie enjoyable.\n"},
{"review": "\nWell, the movie is completely underrated here. That's why I'm leaving\nthis brief review. It's Zack Snyder's film, not for everyone. The movie\nis dark, music is good, plot is excellent, three CGIs set-ups are from\ngames - fantasy, WWI and scifi. It's a kind of mix of everything. But\nthe major plot is brilliant, and the ending is great. You don't need to\nconcentrate on CGI scenes or their quality. Zack Snyder could equally\ninsert anime or just pictures instead with the same effect, it doesn't\nreally matter. The movies is not about manga girls acting in games.\nWhen you watch all this darkness of the clinics recreated by Zack\nSnyder, and the final medical verdict made, and you know a bit history\nof American psychiatry, you start thinking more about dark American\npast and where all these evil people came from. Surely, not from dreams\nof the poor girl.\n"},
{"review": "\nI hate this phrase, but this movie truly shows \"girl power\". It's\nextremely sad, but it shows what a person can rise above and how if\nsomeone really wants something, to rise above, they can. Like a quote\nfrom the movie, \"You have all the weapons, now fight!\". It also proves\nthat there are people who will sacrifice themselves for someone they\ncare about or a cause that they care about. I love how they showed the\n\"theater\" when Baby Doll first gets there, and then she ends up acting\nout scenarios in her head that describe how she's feeling, how it feels\nto fight for something. The best part I think, is the fact that they\nsay, everyone has a guardian angel, they come in different forms, an\nold man one day and a young girl the next. Most of all, that they\naren't here to fight your battles, you're here to fight your battles,\nthey are just here to show you the way and to keep you going. Overall,\nI think this is a must-see!\n"},
{"review": "\nThis movie is actually pretty complex and intelligent in spite of its\nbad reputation as a meaningless action flick. The most entertaining\npart of it all is, how few people seem to have noticed many of the\nmetaphors within the movie. It's pretty funny to read stuff like:<br><br>\"Are you kidding me? I think I've seen this movie before in Every Video\ngame ever made\"<br><br>\"What's with the blonde idiot pretending that she can \"fight\", when\nit's painfully obvious that she has NO idea of what she is doing. She\ncertainly can't act!\"<br><br>Guess that punch really hit homebase :)<br><br>Good movie with a fitting title.\n"},
{"review": "\nNow I wasn't going to review this movie, but seeing how Zack Snyder's\n\"300\" which is a load of...well, stuff has a rating of 7.7 and this\nmovie only got 6.1. I am thinking why?? Perhaps the story was too deep\nfor most viewers.<br><br>Anyhow, it's a great movie, when I am picking a movie to watch I\nusually don't pick anything that has a rating below 7, unless strong\nrecommendations from friends, but this movie didn't deserve a 6.1.<br><br>It's got a story, the visuals and CGI are amazing, the action sequences\nwill leave you breathless and the story will break your heart. By the\nend of the movie you will feel like you want to get into it and help\nthe characters.<br><br>Watch it!\n"},
{"review": "\nAfter watching the DVD, I actually felt compelled to go online and\ncheck the ages of these girls. I liked the movie but again I felt\nuncomfortable at times. I liked this movie which is kind of weird\nbecause at any moment I felt like the movie might pause itself and\nChris Hanson of NBC Datelines \" To Catch a Predator\" might appear and\nask me, Why did I come here and did I know what was I watching? (humor)\nwell sorta... However, I want to believe the movie was trying to reach\nthe Japanese anime devotees but I felt the message of its genre wasn't\nclear enough. I gave it a 7 but the Chris Hanson fans might statutorily\ncall it more like 5 to 15.\n"},
{"review": "\nThis movie is fantastic. From a filmmakers point of view it is an\nartist practicing their craft in its full potential. The movie has\ntheme, texture, a social influence, feeling, and power. This is the\nsort of thing that an auteur can take and realize to its full\npotential. Zack Snyder is not dumb. If I have one thing to say about\nthe movie it would be this -<br><br>Zack Snyder (and a few hundred others) made something pretty cool and\nyou should see it.<br><br>There seems to be this idea that Hollywood as an entity fails to create\nanything new. Sequels are constant and the remakes come in multitudes.\nSuckerpunch is something new. Remember people, new is good. Change is\ncool.<br><br>There is also the idea that Hollywood promotes common society beliefs.\nThings like patriarchy, fitting in, and capitalism. This movie goes\nagainst some of these things. This is probably a good thing. For those\nwho fight for it, life has a flavor the sheltered will never know.\n"},
{"review": "\nDeceiving, deviant, fragmented, layered then collated. Reminiscent of\nan echo.<br><br>Sucker Punch is a film that's more than a sum of its parts. It'll be\nappreciated long after most of the present commentators and creators\nare gone.<br><br>Something that comes close to capturing the early 21st century video\ngame otaku occidental cum oriental online sub-culture. It represents an\nera when borders only existed in a physical sense.<br><br>A great film, intentionally or\nnot...............................................\n"},
{"review": "\nIf you like science fiction/adventure, this is just a great movie.<br><br>It has a sad plot but a very good and surprising fact to tell.<br><br>This movie has the most, a lot of action and power, sad story, great\nperformance, great effects and a surprising end. A power story who has\nboth a strong and sad story to tell.<br><br>I will dare to compare this movie with Avatar and The Marix.<br><br>All I can say is, wow, what a great movie.<br><br>A movie that I am definitely going to watch several times.<br><br>I recommend you all to take a good look at this movie.<br><br>Kind regards Brian\n"},
{"review": "\nI saw this show with no expectations.. in fact I didn't even know the\nplot really. I have to say its the best show i have seen all year...\npossibly even longer. It has me so gripped that i cant stop talking\nabout it to everyone i know. It leaves so much to interpretation that\nyou cant help but talk about it with others that have seen it. I highly\nrecommend this show.. the story is very deep and dark. I thought the\nacting was perfect. The dream sequences and slow-motion CGI was\namazing. The best part is that it didn't take anything away from the\nstory.. it wasn't just senseless violence. I am very surprised at the\nGross and rating. I guess there are people that had some high\nexpectations and even possibly didn't understand it. but please go see\nfor yourself.\n"},
{"review": "\nSucker Punch is one of my favorite movies. I know that it hasn't got\ngood rating but I think this is because most of the people did not\nunderstand the meaning of the movie. Personally I believe that it has\nmany meanings. Zack Snyder did an excellent work. I really love this\nmovie and when I watched it second time at the cinema I thought that I\nwatched a different movie than the first time.I understood more about\nsucker punch. The title is fine and people who said that it doesn't fit\nwith the whole story is because they didn't understand it. People who\ndid not like it is because nowadays people are used to watch ordinary\n''Hollywood'' stupid movies and calling them great movies.<br><br>Keep up the good work Zack Snyder\n"},
{"review": "\nMe: 19, Female, and NOT into fantasy/anime/manga/comic books. So,\nplease, stop stereotyping the entire audience that liked/loved this\nmovie! CGI was stunning in all except one or two instances. I'm not\nsuper picky about movies. I don't care if it \"moves\" me (but it did, to\na point)or has layers upon layers of storyline and complexity to the\nplot (it felt like it did, but that's opinion). It did, however, give\nme something to think about. I enjoyed the artistic aspect to it,\noverall it really felt like a great experience.<br><br>It's silly for people to get so wound up over a movie. You would have\nwasted that money on something just as, if not more, pointless. Relax\nand focus on enjoying the experience. DVD release is July 26th. I\ndefinitely recommend picking it up for movie night!\n"},
{"review": "\nI can understand entirely why others have disregarded this film as\nterrible and after reading a few bad reviews I was very doubtful, but\nas I love movies I won't miss one because other hate it. <br><br>As I watched this movie I began to notice why other may have disliked\nit as this is one of those movies that you have to look past logic and\nrealize it is fantasy. It shows how Baby Doll executed the plan to\nescape in her mind. Not how it was done in reality, it was done on how\nshe envisioned it and gave it life. It is plan from a girl with an\noveractive imagination. For those who can put down the need to hate\nwhat does not follow logic the story is worthy.<br><br>The visual effects were fantastic, give it the feel of an imagination\nfor me at least.<br><br>The acting could have been better but was good none the less. <br><br>Overall I say this movie was executed with little failure and had a\nfantastic result, Definitely worth watching.\n"},
{"review": "\nMost of the movie took place inside the fantasy world minds of young\nwomen committed to a mental hospital. There was a fantasy world inside\nthe fantasy world(kind of like a play within a play). The film dealt\nwith a very mature subject (molestion) without actually showing any\ndisturbing scenes to gross you out (unlike the TV show Criminal Minds\nfor example). The young women fought their demons in a video game-like\nfantasy world as a kind of out of body experience. Killing dragons and\nNazis in the fantasy was slaying their own personal monsters in their\nminds. The plot was original and unique. The actresses played their\nroles to perfection and Scott Glenn was excellent. I believe in\nguardian angels and have worked with patients who have had out of body\nexperiences so the movie fit well into my personal belief system. It\nwas entertaining, exciting, and surprising. My sons \"got\" it and liked\nit.\n"},
{"review": "\nprobably the best movie i have seen in the last 5 years. i already love\nzach synder's work, 300 and watchmen are 2 of my favourite films ever.\nsucker punch is such a great movie, i have watched it twice already. i\nmust say that the extended version is much better and i would recommend\nanyone to see that for your first viewing. i knew people would slate\nthis movie as the trailer makes this film out to be something that it\nisn't. this movie has so much to offer, you just need to watch it with\nan open mind. to fully understand this movie takes a little work from\nthe viewer, I've watched it twice and i still come up with differn't\ntheories as to what happened, but that's what i like most about it.\nsoundtrack is also amazing.\n"},
{"review": "\nİf u were because u couldn't catch that idea i can see that clearly\nfrom your point now read it and remember <br><br>Who honors those we love with very life we live ? Who sends monsters to\nkill us... ...and at the same time sings that we'll never die ? Who\nteaches us whats real and how to laugh at lies ? Who decides why we\nlive and what we'll die to defend ? Who chains us ? And who holds the\nkey that can set us free ? İts You. you have all the weapons you need.\nNow Fight.... can u understand know ? u should watch movies carefully\nand relate them with a real life when u are able to do that u can\ncriticized the movies\n"},
{"review": "\nI liked it.<br><br>This is a very unique movie. It has a multilayer plot where real\nactions are presented to the viewer as visual metaphors. I'm not gonna\ntell much more about the plot. Just understand the basic style of this\nmovie.<br><br>The action scenes were awesome. They were dynamic, fast, epic and hot.\nAlso pretty random. But isn't it what we people mostly want to see?\nJust screw the idea and watch the insane action where the milieu, bad\nguys and explanations don't matter?<br><br>Despite that, the real-life plot wasn't bad either. They made it\nsomehow depressively cool. The editing was good (slow motion, other\ncamera tricks), and the music, especially remixes. The computer\ngraphics were good, but not the best. But I still really like the\nfantasy world they're in - the environment and details especially.<br><br>Oh, and one more thing. Go see the movie now!\n"},
{"review": "\nBy now everyone interested in seeing this movie probably has seen it,\nor has at least read about it.<br><br>I will say. I do not know why anyone would read about the movie,\nunderstand how it is done, then complain about how it is done. May not\nbe a 10 for everyone. But if you don't like it, then I don't know why\nyou chose to watch it. It isn't as if you were caught by surprise by\nwhat the move offers.<br><br>That would be the equivalent of: Reading how a train can never leave\nit's tracks. Then complaining that you wish the train could drive\nthrough town.<br><br>Amazing movie.\n"},
{"review": "\nSucker Punch is a knockout. A visual masterpiece with enough story and\nacting to make it feel substantial. If you combine Heavy Metal,\nSuspiria, Tron, Kill Bill, Big Trouble in Little China, along with the\nvisual flair of 300, you end up here. To call this film psychedelic is\nto make the understatement of the year. Zack Snyder definitely\ncontinues to improve as a filmmaker (even if Dawn of the Dead is just\nabout perfect). The characterization were engaging and I enjoyed the\nmulti-layered reality, especially the transition to the higher-level\nfantasies. Gets a 10 from me, and I hope this trend toward\nintellectually stimulating special effects extravaganzas continues. I\ndidn't realize I'd enjoy the fantasy imagery as much as I did. Oh, and\nthe soundtrack is just perfect. Perfect.\n"},
{"review": "\nI had high hopes for this movie and it did NOT disappoint. The movie is\nfull of action and suspense. The action scenes in the movie are\nperfectly made,taking you into a new world that seems like video games.\nIt leaves you hanging to know what will happen. The story likewise is\nsimple but very nice and leaves you thinking. The twists and turns are\nawesome. The VISUALS &lt;3 WOW.It's what makes Zack Snyder's movies\nspecial. I won't spoil the movie for you,but the movie is a must-watch\n=D Also, I really liked the fact that the movie is not in 3D. Just\nbecause a movie is in 3D doesn't make it nice. I am really glad Zack\nSnyder didn't make this movie into 3D.<br><br>All in all, GREAT movie.\n"},
{"review": "\nWhen I bought the ticket my expectations weren't high, I assumed that\nI'll be watching some standard action film with lovely girls and good\naction sequences but what I got surpassed all of the above and more. In\nthe whole duration of the movie I managed to blink only twice as my\nsore eyes are so happy to remind me at the moment. The story line is\nsuperb, action sequences interwoven with such mastery that they didn't\nstood out, new actors to me came together better than puzzles and\ncombined with stunning graphic scenery they deliver the best story I\nhave seen in this genre. I believe some my have their views of the\nmatter but in my eyes this one is shame to miss on the silver screen.\n"},
{"review": "\nOriginally, i decided to watch the movie because of Emily browning.\nLoved her in UNINVITED. I thought the movie was a pretty cool action\nmovie with all the special features and cool fantasy world battles. But\nit was just too confusing with its storyline for me. It was only after\ni found a movie explanation that i could finally understand it.After\nunderstanding the movie,I thought the movie was pretty great especially\nwith all the \"thinking out of the box\" and \"mess with your head\"\nanalyzing you gotta do to understand the movie. But without a\nexplanation, its would have just been an action movie about hot girls\nkicking butt in a weird fantasy world.\n"},
{"review": "\nI agree with the first reviewer that gave this movie time to sink in.\nAs I find the themes popping up in conversations in coffee shops and\ncocktail parties, the violence fades as the shear creative fantasy of\nconsidering all options in creating art in life. In creating beauty,\nartists have to have the freedom to consider all the options, IMHO.\nBoth good and bad, and the conscious choice of beauty as the Dr. Suess\nbook: I have brains in my head and shoes on my feet, which way I go\ndepends on me. <br><br>Most choices are situational as the dance in this movie, imagine the\ncreativity once given the freedom to let freedom sing. Bravo.<br><br>Lawson Ransom Canyon\n"},
{"review": "\nSucker Punch smacks you down!<br><br>This movie is a softly violent blend of Kill Bill and Inception with a\ntouch of Lord of the Rings, Terminator and Mortal Kombat thrown in for\ngood measure. Unlike Inception, this movie succeeds because it isn't\ndidactically trying to make you buy into the premise, it just lays out\nthe story, and let's you decide what might or might not be going on.<br><br>Overall, I thoroughly enjoyed the creative mix of both the action dream\nsequences, and to a lesser degree the character development. There is\nmuch subtlety crafted into this plot and the main character's\nsubjugations and aspirations. <br><br>If I have one gripe, the use of sepia and dark grayscale tones\nthroughout the movie is overused. This was obviously the film maker's\nintent to bring out color when it does appear, as in the dragonfire,\nalas I feel true color could have been used to more advantage, so long\nas it didn't rise to the over color saturation movies like Avatar fell\nprey to.<br><br>Absolutely recommended if you like intense kung fu surreality flicks!\n"},
{"review": "\nFirst of all, you must give credit to Snyder about one thing: in the\nworld full of remakes he made completely original movie with solid\nplot.<br><br>Let's start with babes: They are very sexy and wearing a tight and\nprovoking clothes, is this were on purpose like in Bay style I don't\nknow, but it was good to watch. Acting is barely mediocre, but barely,\nsometimes is seems like everybody just hardly wait for a pause....:(\nVisuals are great, not THAT great, but great. You have different kinds\nof battlefields (which were great scenes and scenery), stormy hospital\nand one lounge bar. It could be better, but I liked it .<br><br>The main problem with this movie is it can't glue audience for the\nseat, sometimes it gets very boring (like Watchmen, if you don't like\nwatchmen you wouldn't like this either) and annoying, plot is let's say\nlittle predictable and it has no atmosphere like other Snyder movies\n(Dawn Of The Dead, 300), it is just an ordinary flick which falls into\nabyss as soon as you watch it.\n"},
{"review": "\nYeah, it's one of those movies which you're either like \"WTF am I\nwatching?\" or \"Wow, this is so bad ass.\" For me it was the latter. The\nstory is about this girl in an institution where she uses Dance as her\nsurvival. Her dance takes her into this weird but amazingly shown\nplaces where she basically fights off real problems shown as monsters &amp;\nmagic. The ending in my opinion was really unexpected and awesome! The\ncinematography is stunning and so are the soundtracks. The star cast,\nnot famous, but gorgeous, does a pretty good job too specially the\nlead. If you're into details, the weapons, swords, statues, castles\neverything is right to a perfection. The only reason someone would hate\nthis movie is if they try to watch it with logic. Keep an empty mind\nand let the movie flow! Just enjoy it without applying thoughts!\n"},
{"review": "\nNinja cheerleaders with guns fighting robots, zombie Nazis, and\ndragons. I'm not sure what else you need to say, but IMDb wants ten\nlines. How about \"The Jacket\" meets \"300\" and \"Sin City\"? All in all, a\nthrill ride with plot twists that keep you guessing the entire time.\nThe story line is more about crazy situations than plot exactly, but\nthe stunning visual effects more than make up for any plot holes. I\nwould put this slightly ahead of \"Sin City\" and \"300\"--also graphic\nnovels--just for the visual effects and cinematography. The originality\nof the story earned it an extra star from me. There are a couple places\nwhere the story is disjointed, but overall it is complex. You can\ndiscuss the fine points of exactly what each person thinks really\nhappened around the water cooler. Or, just watch it for the\ncheerleaders. Either way, it is worth seeing, worth seeing twice, and\nworth owning.\n"},
{"review": "\nSo I Concluded My Snyder Bash with Sucker Punch Feautring an All Female\nCast Polar Opposite Of Snyders All 300 Male Cast. This Featured Emily\nBrowning(The Host) as Baby Doll, Vanessa Hudgens(Beastly) as Blondie,\nAbbie Cornish(RoboCop) as Sweet Pea, Jamie Chung(Premium Rush) as Amber\nand My Favorite Out of The Bunch Jenna Malone(The Hunger Games:Catching\nFire) also Frequent Snyder Collabrator Carla Gugino(Sin City) as Madame\nGorski and The Main Villain Oscar Issac(Robin Hood) as Blue and Guest\nAppearances by Jon Hamm(Mad Men) as High Roller and Scott\nGlenn(Secritariat) as Wiseman, I Really Like This Movie because each\nsequence was a Tribute to each Genre is Nerd Culture\nJapanese/Anime,Steampunk,Medieval/Fantasy and My Favorite Science\nFiction also I really Enjoyed The Lesson it taught on Bad times don't\nlast forever also once Again Amazing Direction By Zack Snyder(Man Of\nSteel) &amp; Costume Design By Michael Wilkinson(Man Of Steel) and Score By\nTyler Bates(Conan The Barbarian) Also This Gets Me Excited For Snyders\nNext Film Man Of Steel ! :D 7/10\n"},
{"review": "\nIn Zack Snyder's stylistic breakout movie, a group of mentally unstable\nwoman are placed in a mental ward, and to breakout, they imagine it as\na prison.<br><br>This was an okay movie, it's not award worthy, but if you're looking\nfor a good party movie, here's your go to film.<br><br>I rather like breakout films, and I felt that this film rather brought\nthe bar up for me! The effects are stunning, and it's well casted!<br><br>Out of 10 tickets, I give it a 7.5 ticket stub!<br><br>I didn't enjoy every last second, as special effects aren't really my\nballpark, but I could look past it and enjoy it as a good breakout\nflick!\n"},
{"review": "\nSucker Punch is a true roller-coaster ride that any 12-22+ male will\nstrap into and scream the whole way. Combining hot women, action, guns,\nSteampunk Nazi Zombies, futuristic robots, Orcs, dragons, Eyegasm\nvisuals and slow motion CGI, this movie really does hit a home run.\nWith a subtle, hidden story/meaning behind it and an amazing\nsoundtrack, Snyder(director) should feel proud of himself. This is the\ntype of movie where you expect a cheesy, guns-blazing, video game like\nthrill fest, and receive one, but the amazing thing is, you come out of\nit feeling high on life and awesome instead of angry that 2 hours of\nyour life are down the drain. Saying much more would spoil, but trust\nme, if I were to say more, it would be more compliments about the\nhidden story, the true meaning of the title, and the sinister,\nJoker-like acting from Oscar Isaac(Blue Jones). Two thumbs-up, will\nwatch again and again and again!\n"},
{"review": "\nThe very first time i saw this film i was a bit sceptical if I'm\nhonest, but as the film goes on it pieces the story together and parts\nof the film at the start where you thought \"what is going on\" all\nstarts to make sense, its a very unique movie and if given\nconcentration you WON'T be disappointed. half my friends hated it BUT,\nthis half of friends don't really have the best attention span, its a\nfilm you have to be patient with and concentrate on everything that\ngoes on.<br><br>when I'd watched the whole thing i was a bit gob smacked at how\nenjoyable it was, its what i would call a \"very cool film\" all round\nits a very well thought out and very clever movie for people who give\nit a chance and are up for a \"work things out for yourself\" kind of\nmovie.\n"},
{"review": "\nComplaining about this movie is like complaining that a Monet is\nblurry, or that Memento is confusing. This isn't a linear allegory\nwhere each thing exactly represents something, and the construction\nisn't linear. It creates impressions, like abstract art, and it's\npoint, I think, is the power of fantasy in marshaling one's will to\naccomplish and be free.<br><br>It isn't genius-level, like Monet or Memento, but it is definitely good\nyouth art, and visually excellent. Despite being a retired gentleman,\nI'm a film buff and could admire and enjoy it for what it is, instead\nof wishing it was something else.\n"},
{"review": "\nActing: 4.5/5 Effects: 5/5 Music: 4/5 Plot: 4.5/5 Ending: 2.5/5<br><br>Total: 20/25 Rating: 80%<br><br>This movie was better than expected. The plot was interesting and\nimaginative, albeit full of adult themes. The actors and actresses were\nall very well cast for their roles, and the special effects were\nstunning. There were 2-3 times when the music seemed to detract from\nthe overall feel of the movie, most notably when a pop song played\nduring an action sequence. The ending, however, was disappointing. It\nseemed like the whole movie led toward one happy (even if cliché)\nending, and then suddenly turns around for no real reason. On the plus\nside, I now know why the movie is called \"Sucker Punch:\" the ending\nfeels like a sucker punch to the gut. \n"},
{"review": "\nthe trivial moviegoer won't get Sucker Punch... they'll say it lacks a\nplot or character development, is one long music video, is nonsensical\nfluff.... a lot of negative stuff...<br><br>the intellectual philosopher who sees film as a canvas to present an\nartists view of the world will be able to see much more.... the\nalternate reality within and alternate reality / dream state view of\nlife struggle and personality perspectives is very rich in this\nmovie... as with most deep movies, it is open to a great deal of\ninterpretation... for those who wish to see more... it's a great\njourney.. and happens to be very fun at the same time... especially if\nyou see the uncut R version which adds some significant depth to the\nstory.<br><br>There's a genre class of directors attacking big questions with\nvisionary work of late... Aronofsky and Malick's new stuff comes to\nmind right away... if Snyder continues this direction, I'll look\nforward toward everything he does....\n"},
{"review": "\nI feel that this movie is underrated. Sure, the story is weird but I\ncan watch this movie over and over again unlike other movies. This film\nhas style over substance. This is a great popcorn flick. You want to\nwatch a bad movie? Go watch the Transformers movie series. I would\nrather watch this movie instead of Transformers. This movie is just\nvisual eye candy with a great soundtrack. Beautiful actresses with\ngreat action scenes. Story and Dialog is stupid, but come on, you are\nnot watching this movie because of the award winning screenplay. It is\nwhat it is. Hot girls kicking ass. The visual imagery is top notch. The\nacting was okay but I was distracted by the hot girls. Good movie for\nartists.\n"},
{"review": "\nThe movie itself was a work of art.I am a woman, and not really into\nthe whole sci-fi thing, but this movie was excellent. It made your\nbrain work, and stuck in your mind. There were only one or two parts\nwhere I thought \"can we just get on with the story?\". Other than that,\nit kept my attention.The outfits weren't worse than what I've seen some\ngirls on Nickelodeon wearing. if your older and not into the sci-fi\nthing, then this is not the movie for you, and you probably will think\nit's stupid. It's aimed towards the teenage audience, not towards\nthirty or forty year olds.It's a movie for those who want to escape\nfrom reality, and not a romantic comedy. It's supposed to be crazy and\nunpredictable. She's in a mental institution for a reason. So if you're\nlooking to escape form reality or just watch something crazy, this is\nthe movie for you.\n"},
{"review": "\nThis film was not at all what I expected. In all honesty I was\nbeginning to be somewhat disappointed about halfway through the movie,\nbut the film really brings it in for an amazing ending. Like others I\nexpected something visually stimulating based on trailers, and this\nfilm goes beyond those expectations. I did think some of the action\nscenes were a little too long and too much focus on using slow-motion\ntechniques with zooming in on details, but the film as a whole more\nthan makes up for it. The story is an amazing one. I do wish they\ndeveloped the background story more and at times I was wishing they\nmade more obvious transitions between all of the alternate realities\npresent, but upon seeing the film in it's entirety I think they did a\ngreat job overall. The story is heart-wrenching, and is one that makes\nyou think about your own life. All in all, they may have done things a\nlittle differently than I wanted but in the end the film is absolutely\nNOT a letdown and leaves me really wanting to focus internally.\nSomething I will definitely be adding to my collection.\n"},
{"review": "\nSucker Punch is NOT about cinema, it's not trying to be meta, and it's\ncertainly not about the flashy graphics and excessive effects. Sucker\nPunch is an attempt to reach the audience in a way movies usually\ncan't. It shows simply that each of us suffer our own asylums, but not\nmany are as rambunctious as the character Baby Doll. Looking at it as\nit is, a movie, it certainly has its cons. But it's not just a movie,\nit's a lesson, one to be taught to everyone. Too many people just sit\naround complaining about their lives, about how crappy their situation\nis. And more than likely they're right. Sucker Punch is a movement to\ntry and get the audience off their a**es and fight for what they want:\nfreedom. If you can't see the movie as more than just flashy lights and\ngood effects then you're wasting your time. Get off your a** and go do\nsomething with your life, something you've wanted to do for a long\ntime. Free yourself.\n"},
{"review": "\nAwesome animation. Yes.<br><br>I love Sucker Punch, it's very entertaining. The graphic's so nice I\ncan't wait to see the other scenes over and over. And I love how the\nbaby doll jumped and held the sword like a pro. Too bad I didn't watch\nthis movie when it first released. But there was HBO, airing Sucker\nPunch and then I fell in love.<br><br>I'm a little confused to know that Sucker Punch, perhaps, in fact,\ndoesn't get a worth feedback from the world. It has a great story, well\nlet's call it as not-so-bad. And the animation is great too. So what's\nthe matter? <br><br>I think this movie is underrated. I like Sucker Punch better than\nChronicle.\n"},
{"review": "\nI was so pleasantly surprised by this move that I felt compelled to\nleave these comments - my first 'review' here on IMDb.<br><br>I really connected with this movie. The cinematography was absolutely\nbeautiful. The soundtrack amazing. And Emily Browning's character, Baby\nDoll, was nothing short of hypnotic.<br><br>Even though I'm sure it wasn't intended, I felt true emotion with\nEmily's character throughout the movie. I was angered, saddened, and\nexhilarated right along with her.<br><br>In fact, even on my third viewing of the film, each several months\napart, I found myself so angered at the treatment of Baby Doll that I\nhad literal tears flowing. Something not so easy to bring out of me.<br><br>To me the film represents the perfect combination of fantasy, art,\nstory line and acting. I absolutely loved it.\n"},
{"review": "\nI must say that this movie really took hold of me. The cinematography\nis stunningly beautiful, the music is painfully fitting and the entire\nmovie is one wild dream. <br><br>However, as the credits also state, it's \"Cruel and uneasy\" and\nslightly uncomfortable to watch and this movie will leave your mind\nwandering for days.<br><br>Ignore all the comments on acting and the plot, this movie IS really\naffecting, but only on a completely different way then the standard\ndrama movies and many people fail to understand this because they lack\nthe open mind to watch a film that does not follow the Hollywood\nformula and that is unlike any other film you will see.<br><br>And if you have this open mind, you end up wanting to watch it again\nfor all the fine metaphors and nuances of the intertwining realities in\nthis film.\n"},
{"review": "\nDon't understand how critics and public underrate this movie. Starting\nfrom messages and ending with special effects, this movie is like a\nsong from the beginning to the end. The flow, transitions which are\nsmooth, the pictures themes, mood - everything looks very professional\nand expertly. The messages, messages, messages which author wanted to\nconvey and even unintentional messages are great. Performance of the\nactors could definitely been better, but has nothing to do with plot\nand special effects.<br><br>I think it's a very, very good movie. I would watch it twice, which\ndoes not happen to me very often....\n"},
{"review": "\nI just rented this one with some average expectations. Saw the trailer\nand was quite curious, since 300 is one of my all time favorites.<br><br>For those CGI lovers, I guess the movie is awesome. From anime styled\ncamera angles, to outstanding acrobatics, it really gives you the taste\nof state of the art sci-fi action.<br><br>Without spoiling the plot, the movie sets the character, into several\nscenarios where she must obtain an item to escape her \"prisons\" in the\nreal world. Typical video game cliché. She even has fantastic boss\nfight at each \"level's\" end. This actually works quite well because the\nsubplots within the movie are simple and engaging enough to give\npurpose to all these sets. If you're a fan o games like Devil May Cry,\nKillzone, Soul Calibur or Ninja Gaiden you'll love this movie.<br><br>I did find some flaws in it though. The dreamy worlds do not quite add\nup to \"reality\". Some \"glue\" plot is missing and after Inception you\nwould hope for better.\n"},
{"review": "\nA feeling of Quentin Taratino but without the fully polished storyline\nand product. <br><br>Still I rate this movie highly and feel it is one you are wondering\nabout for quite a few days afterwards. The cinematography, cgi and\ngirls are all beautiful. The acting is excellent, of the main\ncharacters and the not so main characters. I just wish there was a bit\nmore, I don't know where. Maybe I wanted more survivors or more\npunishment dealt to the evil characters.<br><br>All in all very underrated movie!<br><br>Enjoy!<br><br>PS. I wanna see babydolls dance, which you never get to see! Is there\neven a dance, this film leaves me with so many questions and\npossibilities it gets slightly frustrating!\n"},
{"review": "\nI have to say I thoroughly enjoyed this gem of a film. I went in to the\ncinema not expecting much, because of all the bad reviews it received,\nbut came out pleased and surprised and baffled at the same time as to\nwhy it was slashed by the critics. The most common arguments by the\ncritics was that it lacked a story line,good dialogue &amp;was demeaning to\nwomen. This is completely and utterly wrong. Anyone with half a brain\nwould pick up the storyline although it could be interpreted\ndifferently, the dialogue was appropriate to the film genre,(u don't\nexpect them to speak in a 17th century Shakespearan style)&amp; I thought\nit was empowering to women.Yes the girls were in tight, cleavage baring\nattire most of the time but the film sent out a message of \"Never give\nin\" &amp; \"Fight for your rights and your freedom\". It is fun,\naction-filled, colourful, underrated and though provoking.\n"},
{"review": "\nIf this movie does not dazzle your eye then their might be something\nwrong with you. Hot chicks fighting impossible odds, Zack Snyder kept\nit simple, he was not looking to win Oscars he was just looking to\nentertain people in a unique way. This movie will entertain you plain\nand simple. The story structure is a little messy and at times you do\nnot know what reality you are in.<br><br>The movie carries a big backpack of action and like just what us\nAmericans like our movies. I like rating my movies into categories\nVisuals 10 Audio 9 Entertainment 10 Story 7 Imax Experience 10<br><br>Lets rate movies for what they are not compare an action cgi movie to\nblack swan.\n"},
{"review": "\nSUCKER PUNCH is one of the best films i have every seen. This movie is\na brilliant dramatically, action-fantasy genre mix movie with awesome\nmusic, very beautiful womens and a interested story. I love it from the\nfirst to the last second. This is a great idea from Zack Synder. Few of\nthe songs are performed by Emily Browning and it sounds great. My\nlovely actress here is Emily Browning alias Babydoll.<br><br>The story is already posted here, so i do not describe it again.<br><br>TOP in this movie: - Dramatic music movie start - Very beautiful Girls\n- Great Reality/Fantasy mixes - Very good action fights - Many great\neffects - Unexpected Scenes and film ending<br><br>In Cinema i saw it 17 times in the last weeks and I cannot wait for the\nDVD.<br><br>Best Regards from Germany, Munich<br><br>Christian P.\n"},
{"review": "\nthe movie starts out cool, gets weird, gets really good and goes back\nand fourth a lot, your sorta lost and then towards the end it all makes\nsense., its written very well, they have a lot of great scenes. the\ncast is very well placed, the scripts totally fine and it has very good\nproduction as well as directing and all that other stuff. i hope they\nmake more like this film and its been a lot of fun and i will defiantly\nwatch it again in the future. the only bad thing is at first your\ntotally lost but thats how they want it to be. also i would of\npreferred someone else besides Emily Browning to play the main\ncharacter. all in all have fun, it has plenty of brilliant action\nscenes. if your someone older then you might not like it at all.\n"},
{"review": "\nSucker Punch, one of the most interesting movies that ever hit the\nsilver screen. The movie really captured the crowd's attention with its\nit uniqueness of story, unbelievable effects and great directing.\nThough might not be called an \"Oscar\" movie, its twist and turns\ndefinitely leaves you talking about it. Aside from its noteworthy plot,\nthe movie also shows values of courage, independence, friendship,\nself-sacrifice and many more. It's imaginative director, Zack\nSnyder,and all the other people who worked behind the scenes really\ntook their audience to another world. Of course, a movie is not a movie\nwithout the actors and actresses and, for me at least, they were very\ngood. Sucker Punch is the kind of movie you want to watch with your\nfriends or siblings because it really exemplified being there for each\nother and working as a team. To those people who said they did not\nunderstand the movie, I suggest watching it again and this time only\nfocus on the movie and I assure you will see its magnificence. I\nrecommend this movie to everyone.\n"},
{"review": "\nOne heck of a thriller this movie is. After the first scene I was glued\nto my seat and wanted to know why,where,when will happen next. The\nmusic plays perfectly into the storyline and action scenes, which makes\nthe film enjoyable. All in all a great film perfect cast and great\nacting,a for sure buy on DVD and will be watching this again and again!\nThe action scenes are amazingly done and looks so real, also the ending\nto the film was a shock to me and I didn't like at all, but not in a\nbad way in a darn they should have all lived and had normal lives. All\nfive girls play their roles good and nothing bad to say about any of\nthe acting in this film as they all did a fantastic job. This movie is\nprobably one of the best I have seen this year as movies these days are\ngetting to be dull and it's great to have watched this film! <br><br>Thank You!\n"},
{"review": "\nIt's a bit difficult to give this movie a vote since you are most\nlikely either going to love it or hate it. <br><br>It's perfect for young men who want to see action, hot women and don't\nreally care if the movie is realistic or not. It has great fight scenes\nthat range from evil samurai demons to Nazi robots, which is completely\nridiculous - but they just make it look so good that it doesn't\nmatter... <br><br>The acting is not bad at all for this type of movie - or maybe its just\nbecause the women are so hot that you don't notice the acting, I can't\ntell.\n"},
{"review": "\nLet's face it. The rating isn't that good, the reviews are mixed and\nmeta-score is just plain bad. Why go see this movie? I admit, i went to\nsee it for the action (which, despite not \"300\" category is still very\ngood) and the booty - and since most people see only that the movie's\nrating is as it is. However, I got more than that.<br><br>If you are able to see through action and girls-in-sparse clothing\nshots, you can enjoy a film that leaves you thinking about life. It\nsure doesn't give all the answers, but gives it's opinions at best.<br><br>Let me say it on other terms: Have you seen \"7 samurai\" and enjoyed it?\nGo see the movie open minded. Otherwise, just watch it if you want to\nsee more of what you saw in the trailer - mind numbing, but pretty\nfights.\n"},
{"review": "\nMe being a fan of Zack Snyder's movies, I went into see Sucker Punch\nwith the correct level of expectations and I came out happy. The movie\nsimilar to other Snyder's movies, is fantasy based and high on style\nwith stunning slow-motion action scenes and a pulsating background\nscore. If you expect a classic cinematic masterpiece, give this one a\nmiss. This movie needs to be seen as a out n out commercial\nentertainer. Girls ruled the movie and they looked hot(particularly\nJamie Chung). Great art direction and good editing. This movie might\nnot do well in US but will definitely rake in the moo-la in Orient\ncountries. Snyder's creative imagination knows no bound. 300 , Watchmen\nand now this movie. I would definitely watch this movie again. Now\nwaiting for Snyder's Superman reboot :)\n"},
{"review": "\nThe action scenes and the visual style are brilliant. Zack is really an\nartist and full of experimental and innovative ideas. However, this\nfilm could have gone further if without the strange storyline and the\ndark ending. Zack is a very good story teller but the problem is that\nhe shouldn't really use this type of story for this film. The film did\nalmost everything that it wants to achieve; but it's just that these\nachievements are somehow covered by the story, which shouldn't be an\nimportant part of the film in the first place. I hope Zack could have\nused a much simpler story so that the audiences can focus more on the\nvisual part of the film, realise its achievements and give a better\nresponse. I cannot say that I totally like or enjoyed the film but I\nstill appreciate Zack's work on it. Afterall, still a good job Zack;\nkeep working on. Hope to see more movies made by you.<br><br>Oh, one more thing. The part that Baby Doll fights against the three\ngiant warriors, it is, WOW, so cool that I almost don't know how to\ndescribe it.\n"},
{"review": "\nSeeing the trailer, I immediately (and wrongfully) assumed this movie\nwas going to be targeted at young male guys, who are probably single,\nand want to witness hot girls in heavy action sequences. How far off\ncould my first impression be?<br><br>It was a fantastic movie in my opinion and I cannot understand the hate\nfor this movie. Its so much more deeper than I imagined and the cgi is\nvisually stunning. The storyline is brilliant and 'Blue's' acting is\ndefinitely one of the reasons this movie held together so well. Sucker\nPunch shows there is more than meets the eye.<br><br>Oh no. Oh no. Oh no. OH YEAH!\n"},
{"review": "\nI normally do not write reviews for movies, however, when a movie has\nleft an impression on me I feel compelled to do so. I actually had high\nexpectations for Sucker Punch and this movie exceeded those\nexpectations. It's not just a bunch of hot girls in skimpy outfits\nkicking trash and an overabundant amount of CGI. The story is\nfantastic, easy to follow, and downright original. I can guarantee that\nthe people who do not like this movie are stuck up, and have no\nimagination, and are probably the kind of people I wouldn't want to\nhang out with. If you aren't one of these people, then I promise you\nwill love it from start to finish. I can only wish more movies brought\nsuch entertainment and originality.\n"},
{"review": "\nI'm really surprised at a lot of people's thoughts on this film. I've\nheard it called misogynistic and s hallow, but I thought it was exactly\nthe opposite. I thought it was empowering. <br><br>It depicts the journey of a young girl through guilt, pain and loss\nthrough the medium of an alternate reality. This metaphor in which the\ncharacters live is a cabaret style brothel. The girls fight for freedom\nand dignity in a situation that so harshly strips them of it. <br><br>I especially loved the action scenes within this. They were,\nadmittedly, a touch far fetched, but the amazing level of kick ass\ncontained in these scene out weighed any sense of unbelieving. <br><br>I really loved this movie. I loved that it was so very open ended. I\nloved that it was so original. I loved the way the action scenes broke\nup the emotionally heavy storyline. I loved the whole thing. I just\nloved it.\n"},
{"review": "\nFirst I would like to thank my dear friends for making me watch this\nAWESOME movie!!! This was so wicked cool man. Lots of nice girls for\neye-candy and a amazing story!!!!! watch it. \"Sucker Punch\" is an epic\naction fantasy that takes us into the vivid imagination of a young girl\nwhose dream world provides the ultimate escape from her darker reality.\nUnrestrained by the boundaries of time and place, she is free to go\nwhere her mind takes her, and her incredible adventures blur the lines\nbetween what's real and what is imaginary. She has been locked away\nagainst her will, but Babydoll (Emily Browning) has not lost her will\nto survive.\n"},
{"review": "\nThru posters and advertising I was expecting a super hero kind of\nmovie.<br><br>During the first few minutes of the movie I started to feel\ndisappointed. Seeing the main character so helpless was not what I was\nexpecting.<br><br>As the movie evolved, I realized this was imperially exciting. A series\nof events, under the eyes of a very strong willed, ingenious minded\nBaby Doll, the movie makes you travel to a world where almost\neverything is possible sending this strong message to its audience: We\njust have to put our minds to it to accomplish what we want. <br><br>Very sad drama story which includes a very adult issue, displayed with\na lot of taste and brilliance.<br><br>Awesome scenery, beautiful fights, and characters. I loved the movie\nmore and more and the story developed. Right at the end, I realized the\nmovie was indeed about a hero.<br><br>Zack Snyder has never disappointed me and this is simply put a master\npiece.\n"},
{"review": "\nZach Snyder paints another masterpiece. Visually spectacular and\npoetic, Director extraordinary, Great Style and Set (the same of\nAvatar), Soundtrack Powerful, Good Cast (Emily Browing is very Good)\nand incredibly original plot. The first very long sequence is to be\nleft open-mouthed, to the movies a lot and we were ready to see a\nmovie, Casino and full of rhythm (wich still are) just started ... but\nall in silence, he has kidnapped, has just silenced. And who often goes\nto the movies know what it's like this. IMHO the only flaw is that the\nmovie is a little too short, so i Hope in a Directo's Cut in Blu-Ray.\nIf you liked 300 or watchmen this is an absolutely MUST SEE!\n"},
{"review": "\nWell \"You will be unprepared\" is aptly quoted. The movie is original in\nits concept and creativity. Beautifully done graphics and action packed\nsequences. However, with still a feeble story line.<br><br>So despite all the brilliant work put in it by its creator and the\nfairly decent work put in by the actors, the movie falls flat on its\nface. The continuity is questionable, the switch between the first two\nrealities is very abrupt and not explained at all.<br><br>The second,third and the fourth action sequences are fairly similar and\nlack the excitement of the first. Their concept could have been so much\nmore creative.<br><br>Costumes and make up were well done. The characters were well thought\nout. Maybe the story lost out during editing or was just left a little\nunexplained to make it more thought provoking or mysterious. Whatever\nthe reasons, Sucker Punch fails to be as brilliant as it potentially\ncould have been.\n"},
{"review": "\nI saw this at Warner Bros. where I work. Really like Zach's visual\nstyle, but man, is he weak on story. So many things are not well played\nout. The girls are at an asylum, but no one acts crazy. The fantasy\nworld of the movie feels like set pieces for an upcoming video game.\nThere are times when the girls seem to be capable of anything, and\nother times hopelessly ineffective. One last thing, if you're going to\nuse rock music in a score, use the originals, or at least have killer\nversions by new artists. Glad I saw it, but I'm really getting tired of\ncartoon movies and cartoon characters. Zach Snyder has so much promise\nin this industry, and I'm really pulling for him, but I think his only\nhome run so far has been \"300\".\n"},
{"review": "\nA lot can be said about this film, but only when accompanied by\nclenched fists and a look of bewilderment. Wooden acting,\none-dimensional characters, awful writing, boring and repetitive action\nsequences, a plot which is predictable in it's journey to no-where, a\nlack of meta-story, a horrible degradation of well-loved songs,\nevidently bad editing (which is a rare one)... All contributing to a\npile of misogynist filth that makes you wonder why you still bother\ngoing to the cinema. This film characterizes everything that is wrong\nwith modern cinema, emphasizing looks above content and a type of\n'stylised' filmmaking which is long past its sell by date above common\nsense. Don't see this film, unless you enjoy developing an aversion of\nmovies.\n"},
{"review": "\nI have been a fan to Mr. Zack since the movie 300. A total of 5 years\nin making will be paid off when you watch this one. I love the gradient\ncolors, stunning CGI and video game based hack and slash stunts. Plot\nis simple, but the execution is tough. Zack had done a beautiful job in\npresenting this movie with his own glamor style. Emily does justice to\nthe character with her cheesy looks and decent acting. The rest of the\ncrew is apt to their roles. Music is very nice which will mix up to the\nscenes. Overall an average story with great screenplay with gorgeous\nvisuals which makes you to stick to your seat. A brave 8/10 for this\nbaby doll.\n"},
{"review": "\nThis movie gives me ambivalent feelings. It has excellent technical\naspects, as one would expect from Zack Snyder, but i rather more\nenjoyed the LEGEND OF THE GUARDIANS than this one, which although was\nan animated one about owls, had more story and worthy visual effects\nthan this one. Mistake me not - the FX in this movie are super cool,and\nthe eye-candy kicking their way through the plot are well worth it. But\nit is the plot that i cannot grasp. The director has definitely\nsucceeded in blurring the lines between reality and fantasy, and you do\nget to understand the way things go even though it appears to be\nfantasy, which is the basis of this film ( as per tag line and\nstoryline, a girl dreams of other things to plot of escape in a very\nglum asylum) However, after sitting for nearly 2 hours with this one, i\ncan't keep wondering...what's the point of this film??\n"},
{"review": "\nThis movie was, in my opinion, too confusing. At first, everything\nseems to make sense, the stepfather is trying to kill the children to\nget the money. But within 2 minutes, things start to get weird. First\noff, Baby Doll hits the light bulb with the gun, which is hanging from\nthe ceiling, but yet her sister is still hit, appearing to be about 4\nfoot tall. What's even worse, it hits her waist! As well, the movie\nspends too much time in the fantasy acid trip harem whatever you call\nit, and not enough time in the 'real world'. It became too hard to\ndetermine what was actually happening. And then the ending was a\ncop-out. They just said, \"Oh yeah, this girl is not the main character,\nthe other one is.\" My only compliment is that the fight scenes are\nawesome!\n"},
{"review": "\nThere are a handful of scenes that are magnificently illustrated and a\nreal treat to watch. But the character portrayal and overall story is\nappallingly bad. <br><br>What you do if you watch this is you skip through the hospital scenes\nand go to the scenes which take place inside her imagination. The\nreason the movie was made was to spotlight the nice effects. There is\nbasically no story at all being told here.<br><br>Is Emily Browning a good actress? Its hard to tell by watching this\nmovie. Congratulations to Larry Fong for the cinematography, to Michael\nWilkinson for the great costumes and to the entire art department. I'm\ngoing to avoid watching anything written by Zack Snyder in future.\n"},
{"review": "\nOne Flew Over the Cuckoo's Nest meets Charlies Angels meets Final\nFantasy (meets 300) meets Fight Club. <br><br>Not sure if this film is an unapproachable mess or a deep genius-\ninspired masterwork full of symbolism and philosophy. Or both. If its\nboth it still doesn't work as it should, clearly. But what an attempt!\nIt seems to be trying to have a say on several issues but all at once\nand all symbolically. Surely you don't think most viewers can pick up\non all that? Whats real? Who's real? Whats the message and whats the\nmessage behind the message? Its a little dizzying and Im pretty sure\nthey don't pull it off. You really need to actually take notes\n(especially when the narrator(s) talk) to really have a chance at\nputting it all together. But in the end you are left with extra pieces\nand things that don't seem to fit. What a ride though!\n"},
{"review": "\nI liked this movie quite a lot but it makes me irritated that you want\nto love it but can't. The story underneath the psychedelic drug trip is\nvery interesting and it 's a bit of a Life of PI situation. The movie\nis basically ruined by the best thing in it. Which 's strange. The\naction is amazing but that is what takes you out of the story that is\nactually going on. When babydoll dances in the film she shows us what\nthey are doing but in a different way and as a result we end up with\nthese metaphor clogged video game missions that take you out of what Is\nactually a very good story about freedom. They are cool to watch but\nthey sort of feel out of place in a movie about a brothel or a mental\ninstitute depending on how you look at it. <br><br>But definitely worth a watch.\n"},
{"review": "\nMUSIC: 10\\10.<br><br>VISUAL EFFECTS: 11\\10 .<br><br>IDEA:12\\10.<br><br>STORY/SCREENPLAY : 6.5\\10 .<br><br>ACTING(action scenes): 7.5\\10.<br><br>I liked it.<br><br>but missing things kept me from reaching CLIMAX.<br><br>OVERALL MOVIE MAKES (6.8\\10) SENSE .<br><br>Could have been better .<br><br>story felt incomplete.\n"},
{"review": "\nI do like movies in which reality gets mixed up and so I also came to\nsee this one. And as many others I'm totally confused after watching\nit; It is an amazing spectacle but is it total garbage or is it a great\nmovie, I really do not know. The absolute weird things of the movie,\nlike the casting of apparently botoxed Emily Browning as baby doll,\nseems to be a big mistake, but on the other side it fits very well\nbecause the movie is in many cases so totally overdone, like the\nimagery which sometimes reminds of a music video clip and often focuses\non details, the bizarre soundtrack, the acting. So then I came to the\nconclusionit must have been on purpose and the movie is more a parody\non the sexy girls with weapons movies then it tries to fit in. So\ndepending on what you expected in this movie you will be either\ndisappointed or flabbergasted. If like movies that confuse you, it is a\nrecommendation. If you want a simplistic mindless evening, better avoid\nit.\n"},
{"review": "\nSucker Punch is totally different movie than any others in this type.\nOf course it is made of sole of pop culture - violence, love, blood and\npretty-stupid girls even called \"doll\". But there is some structure\nthat people love about. There is a circle route that main character\nneeds to take. As Campell said - the hero needs to start a journey of\nhis/her life. And that what it is with this movie. The symbolic journey\nof Sucker Punch is full of mystical details like: key, knife, dance and\nso one. I got more to say at my website, feel invited:\nhttp://kinoswiata.blogspot.com/2012/07/wolnosc-w-filmach.html<br><br>Enjoy the movie :)\n"},
{"review": "\nI don't know whether this is a good or a bad film. It's just not\nordinary, that's why you get the love-hate impression. I think the\nacting could be a tad better, but the script is bad. This is one of\nthose films to be seen in the cinema: big screen for the action scenes\nand special effects, because there is no story development. One turn\naround, it's very simple. If only action scenes excite you, it will be\nan almost enjoyable film. I wouldn't watch it again soon, maybe within\nsome months for fun. The script is not good. If the film is uncommon,\nthe script is almost cliché. If it seems too critical, don't worry, you\ncan take your fun out of it. But that's all.\n"},
{"review": "\nI think its a highly impressive movie with a lot of energy and emotion,\nIn fact it strikes people a lot because some of these things can happen\nin real life. However I believe strongly of the fact that the stories\nof how the other characters ( the 4 friends of the main character and\nthe dancing teacher) got into the mental place, also how the owner of\nthe place got it for starters, it certainly needs more story and work\nbehind it. I also think it could have been just a bit more realistic.\nIts a shame how a simple but powerful movie could have had more in it.\nAs a summery of all, it had the best storyline for a\nsuspenseful/sadistic/thriller movie but it was like a draft as if we\ncould have heard the history behind the place. I also think its a big\nshame how the movies a dream of a dream because it kills the feeling in\nit.\n"},
{"review": "\nStory. that's the main part of a movie. \"Sucker Punch\" being the latest\nin a series of movies I've seen recently which seem to lack this\nessential ingredient, I am feeling sadder every time a movie with\npotential comes short and becomes a forgettable 90min entertainment\nflick.<br><br>I am really starting to miss movies like Rain Man (great story), Sin\nCity (what a good ride!) and even 300 (respectable one).<br><br>and it's sad to see so much effort go to waste. my own\nexperience.....well, i liked this movie. i didn't mind the CGI at all.\non the contrary i felt some parts were very well made. even some scenes\nreminded me of Sin City. and i REALLY enjoyed the music. soundtrack\nchoices were well placed, and i have to admit i always have a soft spot\nfor anything with White Rabbit in it ;)<br><br>but we again come back to story. and that's where it comes short. i\nthink they tried. i believe this movie had something to say, but it was\nwell underdeveloped.....<br><br>anyway it's sad to see something having the potential of becoming a\nmemorable movie turn into this.\n"},
{"review": "\nBeing a Snyder movie I expected great visuals. And it delivered. The\naction sequences are great to look at, with fantastic adversaries that\ndeserve a movie of their own (film makers: we need more of those\n\"chaingun wielding giant demon samurais\"!!).<br><br>The story is OK, nothing special. Although it takes place in three\nworlds (the \"reallity\" world\", the \"escape from reality\" world and the\n\"escape from the escape from reality\" world), it's easy to follow and\nthere are no surprises.<br><br>The main problem I have is with the characters. They are not\ninteresting and have little personality. And you never become invested\nin them. Though it's not the fault of the actors, who do an OK job.<br><br>In conclusion, this movie is fine if you concentrate in the action\nsequences. Just don't expect too much from the rest.\n"},
{"review": "\nThe visuals and fight scenes are of the best quality of eye candy. The\nCGI is fantastic. But sadly the title says it all. On a story level it\ncomes across as just that, the writer/director sucker punching the\naudience. The story made a faint attempt to hint at some kind of\nphilosophy, without actually providing any. The warrior women seemed to\nbe instantly endowed with fantastical fighting abilities without have\nto attain them. Those parts of the movie is all sugar but with no real\ntaste. The rest of the movie is all like meat gone rancid. Just filming\na movie, despite high production values, with such extremes does not\nnecessarily a good story make.<br><br>I liked Watchmen a great deal and re-watch it often. I just hope that\nthis director is not getting intoxicated on his success and developing\ncontempt for his audience.\n"},
{"review": "\n'Sucker Punch', directed by Zack Snyder, is a passable entertainer,\nthat is visually breath-taking &amp; stylishly directed. <br><br>'Sucker Punch' Synopsis: A young girl is institutionalized by her\nabusive stepfather. Retreating to an alternative reality as a coping\nstrategy, she envisions a plan, which will help her escape from the\nmental facility.<br><br>'Sucker Punch' begins well, but loses pace in it's second hour. The\nWriting Material is innovative in the first-hour, but later-on, gets\nslightly uneven. The Special Effects are Spectacular, and truly stand\nout. Zack Snyder's Direction, is stylish. Cinematography, Editing &amp; Art\nDesign, are worth a mention. <br><br>Performance-Wise: Emily Browning is first-rate as the protagonist.\nAbbie Cornish, Jena Malone, Vanessa Hudgens &amp; Jamie Chung, are\npassable. Carla Gugino &amp; Oscar Isaac are fair. Scott Glenn appears in a\ncameo. <br><br>On the whole, A One-Time Watch!\n"},
{"review": "\nMichelle Pfeiffer once commented that \"the Music adds 50% to a Movie.\"\nIf you do the math, that means that about one-third of the Movie\nexperience is comprised of the Music.<br><br>Although this film takes quite a few risks, the choice of Music is not\nat all risky, but rather consists of some tried and true classics:\ntunes immortalized by the Eurythmics, Roxy Music, Queen, the Beatles,\nthe Smiths, Sugarcubes, Jefferson Airplane and Iggy Pop--plus some\nMozart.<br><br>A pleasant twist includes performances of some of the songs by cast\nmembers Emily Browning and Carla Gugino.<br><br>Otherwise, the formula for the film is a fairly straightforward \"Video\nGame\" theme with the usual array of young and hot female action\nheroines: three with the \"Skinny Blonde Look\" that everyone in\nHollywood loves (Emily Browning, Jena Malone and Abbie Cornish) and two\nwith the currently popular \"Exotic Raven-Haired\" beauty (Vanessa\nHudgens and Jamie Chung).<br><br>So check it out if you like the Music, if you like Video Games, and if\nyou like hot women in the roles of action heroines.\n"}
]