[
{"review": "\nForget about the formulaic spies plot and its flaws, the film does not\nlook silly for the wise decision of making it into a comedy and it\nsparks thanks to the strong rapport between Johnson and Hart. The\nthriller may seems to be dumb and lack of inventiveness in all the\nright ways but it is also a bit smarter than what audiences could have\nexpected. The hilarious but not nonsense actions, sweet high- school\nbuddies friendships, comedy about bullies and inspiration to transform\na better oneself however are all blended well into this\nlack-of-originality thriller; though insufficient to generate big\nhumors, it is still able to keep your smile till the end. The film\ncentralises on the delightful chemistry between the two actors, both\nHart and Johnson deliver a cheerful bromantic, especially the latter\nwho takes his character and silliness seriously other than just knowing\nto flex muscles. It might lack in depth to explain about the quest of\nthe mission but it is overall entertaining due to the commitment of the\ncast to bring us laughter.\n"},
{"review": "\nStarted well, but sadly went down hill. I really expected great things\nfrom this movie after all the two main characters can be extremely\nfunny, sadly this was not the case. I felt the plot also let it down,\nleaving me with a lot of fun unanswered questions, don't get me wrong\nit's a comedy so I don't expect in depth thought provoking scrip, but\ncome on guys! I felt both lead actors were let down by the script, what\nI would describe as \" a fluffy film \" . I personally couldn't get to\ngrips with Dwyne Johnsons character at all, seemed a little slow\nwitted, yet works as a CIA operative? Not that I care either way but\nalso they seemed to have made him gay I think, but to be honest I'm not\nsure, as I say lots of holes in both the script and sorry to say the\nacting.<br><br>OK so would I recommend you going to watch the at the cinema? In short\nno, wait till its on TV I'm not saying it's not worth watching, but I\nwouldn't waste your money going to the cinema.\n"},
{"review": "\nHere comes another buddy cop film,this time with Dwayne Johnson and\nKevin Hart in the lead roles.I thought this movie would fail\nmiserably.I thought it was ripping off Ride Along(which is not a good\nfilm to rip off) but it surprisingly stands on its own and makes for a\nfun time at the movies.Bob Stone asks his old classmate,Calvin Joyner\nto help him with his computer skills.I don't really like Kevin Hart all\nthat much,because he plays the same character in every film and even\nthough he does have acting skills,he goes OTT in every performance.But\nhis character is a bit more serious in this one and Dwayne Johnson is\nawesome as ever in his role.The main strength of this movie is the\nchemistry between the 2 leads.They are so much fun to watch.One is a\nfearless agent and the other a normal guy who can't even hold a\ngun.There are some nice jokes and gags as well.<br><br>On the downside,the film falters sometimes in the plot section.Yet\nanother OTT performance by Kevin Hart(as mentioned above) I wish the\naction scenes had a bit more lustre in them.But do not be bothered by\nthat because this is the action junkie in me speaking,and you may like\nthis movie more than I did.<br><br>This movie isn't completely flawless,nor is it totally groundbreaking\nin the buddy cop genre.But it is still worth watching in the\ntheatre,thanks to the chemistry between the 2 leads and a lot of\nlaughs.\n"},
{"review": "\nI just have to say that this film inspired me to write a review because\nof the bad acting as I just wasted a good 90 minutes of my life.<br><br>I love action and I love comedy as the fusion keeps it interesting. The\nproblem is I don't think there was any action and the comedy I must\nhave missed it as I was in too much pain <br><br>The story was you usual Hollywood plot with no depth of all. The\nattempt to put a twist into the movie made it even more annoying. <br><br>At first, the bad acting I thought was part of the show but it just\ncontinued.<br><br>The highlight of the film was the finish as I was put out of pain, the<br><br>closing blooper was probably the funniest part of the show.\n"},
{"review": "\nI was invited to an early screening of this movie in Norway, brought\nfriends and did not have high hopes for this movie (since I've already\nsat through many Hartflicks, without laughing once). <br><br>But this one is a bit different! Without spoiling to much, Dwayne \"The\nRock\" Johnson brings a lot to this, and is already known as Dwayne \"The\nFranchise Viagra\" Johnson, so this is going to be big! <br><br>The bromance between the characters is much more believable than Harts\nmovies with Ice Cube, Josh Gad or Will Ferrell. And Dwayne Johnson\nfreshens up our memories of his performance in the 2005 comedy \"Be\nCool\".<br><br>All in all, I had a blast! So go see it with your girlfriend or\nbest-friends, and enjoy yourselves!\n"},
{"review": "\nRecently a lot of Kevin Hart's movies have been pretty lack luster. The\nRide Along movies and Get Hard were shredded by critics. When I saw the\ntrailer for Central Intelligence, I thought this would be just another\none of those flicks. Thankfully, I was very wrong! The page here lists\nthe film as an \"action, comedy, crime\" movie but really it is more of a\n\"action, comedy, drama\" flick. Dwayne Johnson plays the gentle giant\nBob Stone/Robby Weirdicht (haha pun) who works for the CIA while Kevin\nHart plays the everyday joe Calvin Joyner (a nice change of pace in my\nopinion). These two are the reason this film works as pure\nentertainment. They have great chemistry together and they play rather\ninteresting characters. Robby is on the same level as Jason Bourne when\nit comes to hand to hand combat and other spy stuff like that but he\nhas the sensitivity and the tastes of a fourteen year old girl. I don't\ncare who you are, you have to admit that's hilarious. Calvin was the\nfavorite student of his high school but now he is just a washed up\naccountant upset with where his life has gone. Hart and Johnson bring\nsome real comedy to their roles as well as true conviction. You can\nbelieve that these two are dealing with some real emotional problems. I\nnever thought of either of them as good actors but they do a splendid\njob here. The stunts they pull also look so very realistic. They are\nvery thrilling and pretty creative too. Now the movie isn't without\nproblems-what movie is? The spy portion of the plot is pretty straight\nforward and shallow. It's obviously just an excuse to get these two\ntogether but is that really such a bad thing when what they are\noffering is so good? Central Intelligence is kind of like that movie\nTwins with Arnold Schwarzenegger and Danny Devito. Two popular actors\nplay as comic foils to one another as well as provide great drama with\nsome cool stunts thrown in. What more could you want?\n"},
{"review": "\nCentral Intelligence is a great movie with a well developed plot and a\nterrific comedic cast. It's a fun, mindless comedy action that you can\nswitch off from reality while watching and have a good time, there are\nmany side splitting moments and even parts that had me at the edge of\nmy seat. The writers did a great job of making us care for these\ncharacters before they set off on their journey, which helped out in\nthe long run. However, the pacing was certainly slow, it was not as\naction packed and intense as the trailers made it out to be, there's a\nlot of slower moments, even times where I was begging for some plot\ndevelopment instead of mindless comedy. The cast are terrific, Kevin\nHart and Dwayne Johnson shine in the lead roles and their chemistry is\nthe film's highlight, they are joined by a stellar supporting cast that\nincludes Amy Ryan and Aaron Paul, as well as a few brilliant cameos. It\nalso deserves credit for switching roles and getting the lead actors to\ndo something unexpected of them, putting the well known comedian, Hart,\nin a straight role and putting an action star, Johnson, as the\nflamboyant, over the top character, this differentiated the movie,\nmaking it more interesting. Though it may not be as exciting as the\ntrailers made it seem, Central Intelligence is simple fun, and I would\nrecommend it to anyone looking for a good action or comedy. <br><br>An accountant gets himself in trouble with the law after reuniting with\nan old high school acquaintance looking to prove his innocence. <br><br>Best Performance: Aaron Paul\n"},
{"review": "\nIt's quite possible that they cast Kevin Hart and Dwayne Johnson just\nto make \"Little Hart, Big Johnson\" pun. As far as buddy cop goes, this\ncontrasting nature can provide some chuckles, however the espionage\nthem might not hit all the marks. Still, there are significant amount\nof scenes where laughter is secured by sheer timely body language and\njokes alone.<br><br>Dwayne Johnson plays as Bob, a CIA agent who tries to reach out to his\nold friend. This escalates into a chase for secret files and national\nsecurity. The way Bob is presented relies heavily on juvenile gag and\ndemeanor despite his imposing physique, this is fun at first but it\nhampers the credibility as an agent. The movie wants to add some\nbullying subplot which is commendable, although it doesn't have the\ndepth to accommodate it.<br><br>Kevin Hart is excellent in creating reactions and gestures. He's\nsurprisingly identifiable with high school nostalgia and occasional\nself-doubt. Many of the good moments come from his outbursts and\nbabbling. The script has a few nifty pop references and sometimes even\nwitty gags, so the comedy is not just slapstick throughout and\nundermines the \"intelligence\" in the title.<br><br>There are serious undertones of adult life or self-acceptance even\nthough they are not fully fleshed out. Action is pretty light, it's\npassable without being too demanding. The most important thing is it's\nenjoyable. Sure, there are a few awkward moments, yet they make the\nbest out of it to present a light humorous spectacle, a better buddy\ncop gimmick than expected.\n"},
{"review": "\nKevin Hart &amp; Dwayne Johnson are two of my favourites and I am a big fan\nof buddy movies.Recently I rated 9 for each Ride along movie.I don't\nwant to go for a detail review but for you guys who have not watched it\nyet and have a high expectation about this particular\naction-comedy,please lower a bit of your expectation.If possible don't\ngo for it.I mean I feel bad about this movie for their cast.Personally\nI believe no matter how good you choose your cast,If the plot is not\ngood,it's not good at all.6.5 in IMDb means a big I know.May be some\nfound it good but for me it was a real disappointment.So I would\ndefinitely not recommend this one.Thank you\n"},
{"review": "\nIt is not really funny, basically there is no one good laugh in the\nwhole movie. But, there are many somewhat funny situations/lines, like\nwhen Rock and his little partner jump out the window onto a big\nballoon-monkey.<br><br>It is not really fun, but, it is engaging enough to not be boring or\njust plain bad. The Rock kicks some but, but in a mostly-believable way\nand not too much.<br><br>The story is not really good, but, it doesn't have serious flaws, for a\ncomedy, that is. It is mostly consistent, has a good progress and\ndoesn't just implode near the end, like a lot of modern movies\n(comedies included).<br><br>Acting is not really good, it's mostly over-acting, but, both the Rock\nand his little partner don't \"over do over-acting\", so to speak. Again,\nit's a comedy, over-acting is somewhat expected.<br><br>So there are a lot of better movies, but, this one satisfies the\nminimum quality bar. It's a good way to take a rest if you're not\nsleepy.\n"},
{"review": "\nI just saw a sneak preview of Central Intelligence, and I really\nhaven't had such laughs for a long time. Kevin Hart plays Calvin\n\"Golden Jet\" Joyner who peaked in high school, and now is an accountant\nwho can't seem to win. Enter the Rock (Dwayne Johnson) as Bob Stone aka\nRobbie Weirdicht who acts like a man-child with hero worship for\nCalvin. They were never really friends, but Calvin was the only one who\ndidn't laugh when Robbie Weirdicht was humiliated in front of the whole\nsenior class, and actually helped him out.<br><br>Kevin Hart does a great job through the first half of the movie playing\nthe straight man while the Rock hams things up. While the Rock's role\nis over-the-top, he plays it with such sincerity, it's absolutely a\nriot to watch. I usually don't like when a character's embarrassing\nbehavior is the point of the comedy, but in this case it really works\nwell.<br><br>The plot twist arrives relatively early on (minor spoiler), when the\nCIA shows up and tells Calvin that \"Bob Stone\" is a rogue operative.\nFor the rest of the movie Calvin is freaking out because he is caught\nbetween the CIA and his old high school acquaintance. Calvin has to\nfigure out who to believe, as both sides tell the same story, with\nslight critical differences.<br><br>Amy Ryan does a great job as the cold CIA operative, Agent Pamela\nHarris, trying to hunt done Bob Stone. She has the sharp dead-pan act\ndown, which lets Kevin Hart play his usual loud squirming act.<br><br>There are a number of action scenes, but frankly they are over way too\nquickly. Sure it makes \"Bob Stone\" look super impressive in how quickly\nhe can dispatch adversaries, but I prefer actually being able to see\nthe action, and appreciate the skills involved.<br><br>Overall, I really enjoyed the movie, and judging from the laughter and\nsmiles on the preview audience leaving the theater, I wasn't the only\none.\n"},
{"review": "\nI looked forward to seeing this movie as soon as it was announced - The\nRock and Kevin Hart seemed like the perfect combination for action and\ncomedy. The trailer was decent too.<br><br>Ultimately, after watching it, I was disappointed. The story was really\npointless and unexciting, the Rock's acting was confusing and very poor\nat times. Kevin Hart was his funny old self as usual, couldn't fault\nhim, but the poor plot couldn't even help him stand out. The poster and\ntrailer looked like it would be one of the funniest, and best, movies\nof the year, but it really wasn't.<br><br>To explain the 4 stars - it wasn't the worst movie in the world, but\nfor its big names and huge hype, it didn't deliver. It had somewhat\nfunny bits but in all honesty, a movie that added nothing to my life,\nand one that I could have done without watching.<br><br>You're better off waiting for this movie to come out on a movie channel\nrather than going to see it on the big screen.\n"},
{"review": "\n14 July 2016 Bastille Day Film of Choice at The Plaza Dorchester\nTonight - Central Intelligence. Dwayne 'The Rock' Johnson and Kevin\nHart star in this absolutely farcical movie about a bullied fat kid\nturned muscle man who also happens to be in the CIA. The script gave us\nscenarios reminiscent of Eddie Murphy in the Beverly Hills Cop movies\nwhere he uses about a million words when one short sentence can\nsuffice. The story was outlandish, and everyone was overacting so much\nit all combined to give us one of those amusing films that actually\nmake us laugh out loud from time to time. Even though once again we got\nshown most of the funniest bits in the trailers they still made me\nlaugh when they were put into context in the film. I just knew the\nmismatched partnership would work, The Rock is about 15 feet tall and\nKevin Hart is about quarter of that yet they awkwardly rub along\nthroughout the whole film. Total trash........loved it!!!\n"},
{"review": "\nIn a way, this movie is nearly a 10, because it is hard to imagine it\nbeing any funnier. When watching it the stuff between Johnson and Hart\nis so good that I have to hope they are going to do another movie with\na script like this one. This movie is more fun than any film I have\nseen in a long time.<br><br>Too often when WWF Wrestler's get into acting, their egos are so large,\nthey can't transfer it into acting or comedy. Dwayne Johnson (aka. The\nRock) does that transfer here. He shows he can act and do comedy with\ngreat skill at both and does not let anything get in his way. Kevin\nHart does not hurt as the two of them with a full foot difference in\nheight really seem to have this down. Their timing and pace are so good\nthat I could not help laughing more than I have at a movie in a long\ntime.<br><br>It is almost hard at times to take the CIA spy plot seriously, but then\nevery so often you get to wondering who are really the good guys and\nwho are really the bad guys. The script is good enough to keep you\nwondering for most of the film. Centering around a 20 year high school\nreunion the plot works well. <br><br>This one is worth checking out because it really lightens the mood and\nthe supporting cast really backs it up too. Both Amy Ryan and Danielle\nNicolet stand tall here despite being shorter than Kevin Hart. The\nGolden Jet and Bob Stone make this film funny, and the support and\nThurber's Direction pace here are just about perfect. The running time\nof less than 2 hours is perfect and the inclusion of great pieces of\nthe gag reel at the beginning of the credits made me leave the theater\nwith a big smile.\n"},
{"review": "\nAfter a few minutes of a promising start, the movie falls right into\nthe \"rigmarole\" cliché.<br><br>Kevin Hart does nothing but gesticulate, obviously desperate for some\nfunny lines, that he never gets to say. So, instead, he tries and fills\nin the blanks, however it sounds poor and empty.<br><br>It reminds me of some 90's movies with Eddie Murphy.<br><br>Maybe the writers could have helped at some point.<br><br>Dwayne Johnson is quite OK, some jokes somehow work, but it's not\nenough to carry the movie.<br><br>I would have loved to have loved it...\n"},
{"review": "\nOne of my favourite things is when a film is a hybrid of genres \u0096\nhorror comedies, romantic comedies, dramedies and romantic dramas.\nUnfortunately, Central Intelligence is an action comedy which skimps on\nboth the action and the comedy.<br><br>This was disappointing for so many reasons, but mainly because\nexpectations were high with the tagline for the film being such a\nstroke of genius: \"Saving the world takes a little Hart and a big\nJohnson\" (I do love a good pun). I can handle when a film is predicable\nin plot if it makes up for it in other ways, and I was hoping this one\nwould have fresh jokes to counteract the cliché story however this is\nwhere it fell short. Kevin Hart's character Calvin Joyner is a\nstraight-laced accountant who was once the high school golden child. He\nreceives a Facebook request from a nerdy and overweight ex-classmate\nBob Stone (played by Dwayne 'The Rock' Johnson) and when they meet to\ncatch up over drinks, Calvin is slowly drawn into a crime underworld\nwhere Bob is an ex-CIA agent gone bad\u0085 or is he? (Cue dramatic music\u0085\nyawn).<br><br>Kevin Hart plays the same character he always plays \u0096 whiney and a\nlittle nerdy, whilst Dwayne Johnson's character has a little more meat\nto it (and I don't just mean his biceps). Even though Bob had bulked up\nover the years, he maintains the soft and fluffy persona that his high\nschool self once was. This was probably the only redeeming feature of\nthe film which made it even remotely unique and interesting. With Ike\nBarinholtz as one of the screenwriters, you would think the film would\nhave many more laughs than it did. I think the comedy was just too PG\nfor my liking and with no amazing action sequences to boot, it became a\ndull journey where the only excitement I felt was when the closing\ncredits began to roll.\n"},
{"review": "\nThis is a pathetic excuse for a star comedy. Not even trying to be\nconvincing on any level it plods through some 'twists' and the stars\npick up their paychecks. There is no reason to care about anyone or\nanything in this badly written, badly shot bore. Why did it take more\nthan one major studio to bring this waste of money to the screen?\nAnother annoying film where a main character (Kevin Hart's) arrested\nthen acts and starts babbling in ways that no living person ever would\nwhile the arresting CIA agents hang around in the scene inertly (and\nno, his act is not in the slightest way funny.) Likewise its hard to\nget any handle on Dwayne Johnson's character - he's made good from\nbeing the bullied fat kid at the opening but a confusing trajectory\nwhich led him to be a CIA agent, but is he good or rogue? Who cares?\nHis giving a comeuppance to a nasty character is just thrown away too.\n"},
{"review": "\nCentral Intelligence is a studio feature film in the bromance/buddy\ncomedy genre. It's The D Train meets The In-laws. <br><br>Kevin Hart (American History X, Kevin Hart) plays the straight man\nopposite Dwayne \"The Rock\" Johnson (Scorpion King, Expendables),\nreprising his gentle giant role from Pain and Gain. Like much of the\njokes, Central Intelligence falls flat--not that there are many to go\naround.<br><br>It's basically one joke repeated ad nauseam, a la Saturday Night Live.\nThe Rock asks Kevin Hart \"Are you in?\" (a mad-cap adventure) to which\nKevin Hart replies, \"No, I am definitely not in.\" In a twist that\noutdid itself in stupidity, The Rock somehow becomes Kevin Hart and his\nclueless wife's marriage counselor. <br><br>Central Intelligence was very 2016 in that it dealt with the \"body\nshaming.\" The Rock was bullied as a youth, yet inexplicably he is still\nstuck in high school nostalgically and can't wait to hit the reunion.\nThe Rock's lines were delivered with the enthusiasm of Ferris Beuhler's\nteacher, with McLovin style. He was better in true crime story Snitch.\nKevin Hart is better doing stand-up. <br><br>This is a good example of what the industry is buying in the comedy\ngenre. Central Intelligence has themes of regaining lost youth with\n\"inappropriate\" behavior and finding redemption. <br><br>Central Intelligence can't hold a candle to the ultimate bullying\nmovie: Carrie.\n"},
{"review": "\nWhen it comes to spy team up comedy what makes it work is the partner\nto partner dynamic. The witty banters, clever executions and humorous\nset ups. I recently saw the spy comedy \"Grimsby\" and despite it being a\nvery very crude movie, it's the better comedy. This basically relies on\nDwayne Johnson to carry the movie, and just about all of this movies\nbudget went to him. But even he didn't seem to care and had that\nexpression of \"Gosh I am in my 40's why am I doing this? Well time to\ncollect my paycheck\". The humor just seemed to fall flat with the\nconstant over exaggeration and the jerk trying uber hard to be a jerk.\nI still give this movie a 3.8/10 because of it's message of being the\nhero of your own story. The team up this time is the lovable guy that\ngot bullied all the way through high school and now is a butch and fit\nagent that knows how to kick ass. The other is Kevin Hart being well\nKevin Hart. Basically a accountant that looks back on his glory days\nwhen he was in high school. The Rock seemed to have tried at humor with\n\"Pain &amp; Gain\". In This not so much at all, he just seemed like he was\nwinging it all the way through like I said. It's a very cliché,\npredictable and flat spy comedy. I would not see this again, it's one\nof those whatever movies. They need to put some more effort into it\nnext time even if it's just a cash in.<br><br>3.8/10\n"},
{"review": "\ncentral intelligence, is a really let down, the trailer makes it looks\ngood, the story line sounds pretty good even though it's quite short\nand all that comes to watching it and it's a total disgrace. I mean the\nfirst half was OK, then when the second half comes it's a big let down.\nI'm reviewing this movie simply because I was disappointed with the way\nthe movie went.<br><br>central Intelligence, is an action comedy film, the action wasn't too\nbad and the comedy, well just couldn't get the sense of humor I watched\nbetter action and comedy even when it is an action comedy film like Hot\nFuzz or 21 Jump Street which are really good. you can sit there\nwatching central intelligence slouched and probably fall asleep.<br><br>overall, I give central intelligence a 3/10 because the action is a big\nlet down some action scenes where not that bad but then it comes to the\naction and comedy together it didn't work for me at all. <br><br>finally, don't waste your time with this movie, it's nothing compared\nto the other action comedy's out there.\n"},
{"review": "\nIt had its moments..<br><br>Not a very good chemistry, but it was a little bit funny, I mean it's\nnot boring but you feel like it was made for kids.<br><br>There are some good jokes in it..<br><br>Hart's acting was good, but I don't like him that much..<br><br>I like The Rock, but he's not very good in this movie, he wasn't funny,\nand his acting wasn't good..<br><br>The movie has a lot of drops, it doesn't respect a grown up mind, like\nI said it's meant for kids most likely.<br><br>Watch it if you don't have anything else to watch..\n"},
{"review": "\nGoing in to Central Intelligence I didn't know what to think. With many\ncomedic movies, I didn't want to build it up too much in my mind, cause\nthat is a sure fire way to not enjoy the movie. I was pleasantly\nsurprised by the picture though. Hart and Johnson almost switched roles\nin a sense, with Johnson taking on a quirkier role and Hart playing the\npart of the level headed thinker. They both were able to take a new\nrole and add it to the same gut busting comedy we love from them, and\nmade a movie that was truly delightful to watch. Several times I\nlaughed till my stomach hurt. The other thing that made this film more\nenjoyable was the plot line. In most movies, as the story progresses\nyou start to make assumptions on what is going to happen, or who the\nbad guy is. With Central Intelligence, I was wrong in my assumptions,\nand when I found out I was wrong, it made the movie much more enjoyable\nin a sense. It made me go back and rethink what had happened, and I\ncould see where I was wrong in my thinking. All in all it was a great\nfilm that I will watch again.\n"},
{"review": "\n. . . after high school--it simply gets a lot worse! That is the main\nmessage of CENTRAL INTELLIGENCE: No matter how many school counselors\nmake big paychecks prattling pleasant platitudes that Real Life's going\nto be all Rainbows and Unicorns post-High School, kids need to know\nthat these Feel-Gooders are only in it for the money, Warner warns.\nThough the National Teen Suicide Hotline made Warner tack on some\ngratuitous Happy Ending Plot Points, the CENTRAL INTELLIGENCE offered\nhere is that the Fat Lady has finished singing by the time she pops you\nout. On the brighter side, Kevin Hart leads a trio of sure 2017 Oscar\nWinners among the CENTRAL INTELLIGENCE key urban cast members. Only the\nlack of a lead minority actress will prevent the Citizens of Color in\nthis flick from duplicating IT HAPPENED ONE NIGHT by sweeping ALL of\nthe acting statuettes. But now that most if not all of last year's\ndespicable Oscar Voters have been replaced by Millennial Minority\nPeople, the only thing that can prevent #Oscarsoblack is a Trump\nPresidency!\n"},
{"review": "\nHad some funny parts but fell apart in my opinion because of Dwayne's\ncharacter. Fair enough he was a nerd in school but as he started\nbuffing up and getting all the ladies he would've gained confidence and\nnot still been all nerdy as he matured. I don't think Kevin knew how to\nwork with that ridiculous character and so it didn't really work as a\nwhole. <br><br>Someone else nailed it here when they said it lacks depth. The\ncharacters are trying too hard to be funny and super buddy and just\ndon't gel. I would almost rather see Kev and the rock put in a real\nlife situation, reality TV style, where their own jokes would be much\nfunnier! Just my point of view.\n"},
{"review": "\nCalvin (Kevin Hart) was the star of Central High long ago. He was a\ngreat athlete, student and friend, nicknamed the \"Golden Jet\". On the\nother hand, classmate Bob (The Rock) was overweight and the butt of\nmost jokes. On the day of a closing ceremony in the school gym, bullies\npushed Bob onto the floor straight from the locker room showers. Only\nCalvin helps out by offering his letter jacket to cover Bob as he exits\nthe place. Flash forwarding 20 years, Cal has married the most lovely\ngirl in the class, Maggie (Danielle Nicolet) and is a staid accountant.\nIn part, he feels ashamed for he aspired to higher ambitions. As the\ntwenty year school reunion is approaching, Calvin is startled to get a\nFacebook invitation from Bob. Agreeing to meet in a bar, Calvin is\nastonished to see Bob is a lean, mean, fighting machine, tall and full\nof muscles. Not only that, Bob is a CIA agent who needs CALVIN'S help\nto find accounting trails of a big criminal he has been trying to take\ndown. Flattered, it turns out to be more than paperwork, as Calvin is\nsoon involved in gun battles way over his head. Not only that, but a\ntough lady agent wants Cal's help to bring Bob down, as she says BOBBY\nis the bad guy here. Who can Cal believe? Will he live to see it\nmatter? This fun, somewhat-mindless flick is a good yukfest for those\nwho truly need to \"get lost in laughter\". Hart and The Rock make a\ngreat duo, not only in size difference but in styles of humor. Nicolet\nis very beautiful while the rest of the cast is nice, too. (Watch for a\ncameo from someone special). It also sports nice costumes, venues, and\nsets. No, its not going to bring home a dozen golden statuettes. But,\nwho cares? Therefore, slip out some evening soon to send the blues\nmiles away.\n"},
{"review": "\nI am a big fan of Kevin Hart, Dwayne Johnson, and all the other big\nnames that made appearances in this movie. However, they kept setting\nup situations that could have been really funny - but nothing happens.\nThe joke just withers away. It was like they had a lot of funny jokes\nor situations in the script, but at the last minute the censors made\nthem take out the punchlines. I did like the story, and there was even\na bit of \"who dunnit\" suspense. The fact that they had a decent\nstructure and great talent leaves me thinking that the writers were\nmore interested in drama and action than comedy - but the movie was\npromoted as a comedy, and has several events and props that scream\n\"COMEDY MOVIE.\" But when it came to being funny, for the most part it\nleft me hanging. Dwayne Johnson and Kevin Hart were still doing a top\nnotch job delivering the material they had, but this movie could wait\nfor home viewing.\n"},
{"review": "\nVERY DISAPPOINTED. I most always like Johnson. He can be as funny as\nanyone without being nasty. Not this movie. It is hard to enjoy a movie\nthat is full of stupidity. It could have been a good funny movie if\nsomeone knew how to wright the script. Instead it was a nasty bunch of\ncrap. Nasty sexual references and fowl language. So unnecessary. I was\nsurprised that Dewayn Johnson would have his name on anything this bad.\nAnd I don't see how it received a PG13 rating when it should have been\nrated R. Let me put it this way. This was the first movie I ever walked\nout on before it ended. For anyone with kids I would suggest picking\nanother movie. I made the mistake of taking my 12 and 13 year old.\nThere is junk in this movie that made me sick and ashamed to watch it\nmuch less my kids. My 13 year old said this was even worse than she\nhears in the hallways of her middle school. My wife teaches so trust me\nTHATS BAD.\n"},
{"review": "\n'CENTRAL INTELLIGENCE': Four Stars (Out of Five)<br><br>An action-comedy buddy flick, starring Dwayne Johnson and Kevin Hart.\nIt was directed by Rawson Marshall Thurber (who also previously helmed\nother hit comedy flicks, like 'WE'RE THE MILLERS' and 'DODGEBALL'). It\nwas written by Thurber, David Stassen and Ike Barinholtz. The film\ncostars Amy Ryan, Danielle Nicolet and Aaron Paul. It's a pretty funny\nmovie, because of the pairing of Johnson and Hart, and it's also\nsurprisingly touching (at times).<br><br>Johnson plays Bob Stone; a once bullied (and severely overweight) nerd,\nthat's now a lethal CIA agent. Calvin Joyner (Hart) went to high school\nwith Stone; he was really popular, and helped Bob out during a\ntraumatizing incident. So Bob has idolized Calvin ever since. The two\nmeet for drinks, the weekend of their high school reunion, and Calvin\ngets pulled into a life threatening CIA adventure.<br><br>Johnson and Hart have beautiful chemistry together; it really is a\nclassic odd couple pairing! That's the highlight of the movie, but it\nalso has a lot of heart; and a strong message about bullying. It's\ndefinitely 'forced' and 'clichéd', but it's also (surprisingly)\nemotional. I really enjoyed the movie, for that reason as well. The\nplot, and action scenes, are routine (and forgettable), but the\ncharacter development is awesome! It's probably the best Kevin Hart\nvehicle yet!<br><br>Watch our movie review show 'MOVIE TALK' at: https://youtu.be/-\nKJTB5KGois\n"},
{"review": "\nWe are introduced to Calvin Joyner (Kevin Hart's character) in 1996 at\nhis senior high school graduating assembly; the principal introduces\nhim as 'Most likely to succeed'. <br><br>The scene changes to Bob Whierdicht (please note how last name sounds\nwhen said aloud) at school taking a shower. Four students drag him from\nthe shower and into the assembly. Equally unconscionable, the principal\nstates to Calvin, \"That's a - hard one- to top.\" <br><br>The only redeeming quality of the scene is Calvin lending Bob his\nletter jacket.<br><br>When students worry about bullying, these writers and producers of\nControl Intelligence apparently feel a thirteen year-old can see the\nabove because Calvin later mentions to his wife that Bob never returned\nafter that day. <br><br>Present day, Bob contacts Calvin via computer. After Calvin responds\nsexual material is displayed on his computer. <br><br>Three more minutes Dwayne Johnson finally makes his appearance as Bob.\nFollowing two or three more sentences I left; ten minutes after the\nmovie started.\n"},
{"review": "\n18 June 2016: I saw Dwayne Rock Johnson &amp; Kevin Hart in their new\naction comedy and it was really good. I knew that Kevin Hart would be\nfunny and that is what the audience is expecting from him, but the\nsurprise stand out is action actor tough guy Dwayne Rock Johnson, who\nproved in this movie and in a movie he did several years ago titled\n\"The Game Plan\" with cute little actress, Madison Pettis in year 2007\nthat he can really transform from tough guy to letting himself go and\nbe really good in a comedy film.<br><br>The really cute actress who plays Kevin's wife, Danielle Nicolet\nAfrican American looks like a younger version of Italian American\nactress television host, Juliana Rancic.<br><br>All of Dwayne scenes were funny and on point. He looked very natural. I\nwould give this film a 10, but the only reason, I will not give it a\nten is because of some of the unnecessary profanity. This movie would\nhave been just as funny without the cursing. Nice cameo by Melissa\nMcCarthy.\n"},
{"review": "\nCentral Intelligence stars Dwayne Johnson and Kevin Hart and is about\nthem teaming up to save the world. I'd like to say that I had zero\nexpectations going into this but was still looking forward to it. This\nmovie is HILARIOUS! The Rock and Kevin Hart are fantastic together and\nhave some of the funniest jokes I've heard all year. Watching them both\non screen is the best part of this movie and it was extremely funny. <br><br>The story follows both of them having reunited 20 years after high\nschool in order to save the world. The main plot is the weakest part of\nthis movie since there's not much emphasis put on it. I will say that\nthere are some pretty sweet cameos in here that are awesome. The action\nis mostly good even though it got a bit shaky in some places.<br><br>Overall, Central Intelligence is a pleasant surprise this summer. This\nmovie is honestly battling Deadpool for funniest movie of the year; I\ncan't believe I just said that. This is definitely one of the better\nbuddy-cop action comedies we've gotten in the past few years.<br><br>Central Intelligence gets a B.<br><br>Check out my Youtube channel where I review movies as well!:\nhttps://www.youtube.com/channel/UCOGWUFunDhIwKVcL7eNMWiQ\n"},
{"review": "\nRented it for Thanksgiving along with Daddy's Home and it was way\nfunnier than this. It does have its moments, but It is very dry.\nJohnson trying to act like he is back in high school fails. The\nbloopers were much funnier and am quite surprised that he did something\nlike this. From the beginning I wondered when it was going to pick up.\nI thought Johnson and Hart, one cannot go wrong and was not what I\nexpected. The ending was cute when they get to the reunion, but if I\nwanted to re-live high school, I can go to my own reunion. I like\nJohnson and give him credit for doing different roles because he can\npull it off nicely meanwhile some celebs can only play one role and\nfail miserably when trying another, but this movie is not worth seeing\nagain. I am glad I rented it from Redbox.\n"},
{"review": "\nThere is a lot of Talk among Critics who Drone-On about Generic, Loud,\nUnintelligent, Assembly Line, By the Numbers, Cookie Cutter,\nInoffensive Movies that are So-So-So Bland and Offered Routinely and on\na Weekly Basis, well, The Beat Goes On.<br><br>Here's Another for Your Consideration. Nobody with any Degree of\nCentral Intelligence is going to Deny \"The Rock\" has what They call\n\"It\", that Unbuyable Thing, Charisma. He's a Natural, and it can't Hurt\nthat His Hours spent in the Gym have Yielded \"Results\" and Recently,\nsomeone did a Survey and He was Voted the Sexiest Man Alive. So all of\nthat Sells Tickets and Dwayne Johnson has Cashed-In on a Regular Basis.<br><br>His Legions of Fans Love the Guy. A Guy who has it All. He's Sensitive,\nCompassionate, and can Hug a Tree while Kicking-Ass, and No One is\ngoing to Question His Manhood.<br><br>But even a God cannot Turn Water (the most basic and generic substance\non the Planet) into Wine, or Can He? Well, in this Case the Answer is\nNo. Teamed with a Likable Comedian, Kevin Hart, the Two High-School\nBuddies are Reunited 20 Years Later and Go Through the Standard\nReflections of most Human Beings about that Bygone Era of Jocks and\nBullies, Shaming any Weakness.<br><br>That's the Recycled Premise of this Tiresome and Tepid Movie that\nthrows in a \"Save the Free World\" Story involving CIA and other\nassorted Bullies Stealing Secret Codes and Screen Time. It all Falls as\nFlat as \"The Rocks\" Abs.<br><br>Overall, there are a Joke or Two that can Raise a Chuckle and the Two\nLeads Walk Through the Thing with a Minimum of Cringe Inducements. But\nit's just another Movie that will be Forgotten the moment it's Over and\nif this is the Kind of Thing You Enjoy, just Wait a Week. More on the\nWay.\n"},
{"review": "\n\"Central Intelligence\" was a film I was mildly excited for after seeing\nthe trailer. It looked like it had potential and some laughs.<br><br>The film packs a solid comedic punch with a charismatic performance\nfrom Dwayne Johnson and some clever, comedic gags to pop culture. If\nyou pick up on them, it'll add a lot to you for the not so brilliant\nscript. The story's strongest point is its guessing \"who's the good\nguy\" which also might be its weakest flaw. While some will enjoy that\nelement, others might find it annoying to constantly be guessing who\nthese characters really are and where they stand. Should hold your\ninterest though. <br><br>Overall, Central Intelligence wasn't disappointing. It's comical and\ndefinitely a good time at the movies. However, if you're expecting the\ncomedy highlight of the year, this isn't it. Nor is it the comedy you\ndeserve but it is, nonetheless, a decent film.\n"},
{"review": "\nAlthough marketing went with something different (Little Hart, big\nJohnson) I do think they could've used this one too. If you like that\nand are amused by any or maybe even both those word-plays, the\nprobability is high that you will also like the movie. I know I had a\nlot of fun with it. At times it just seems that the direction was,\nthese are your characters, you're in a bar, now make it up as you go\nalong ... AND ACTION! And it does work.<br><br>Again if you are in the right frame of mind. This is supposed to be fun\nand while there are a couple of cogs in the machine and it does stutter\nfrom time to time (sometimes you could even say the movie seems to\nstand still), the overall flow is nice. Doesn't make a lot of sense,\neven if Kevin Hart is trying to create junction and some distance plus\nplays it as straight as possible. Still the two are funny and they make\na good team together ... they can almost get away with any sort of\njoke. Even the silliest of them ...\n"},
{"review": "\nCalvin Joyner (Kevin Hart) meets Bob Stone (Dwayne Johnson) who used to\nbe known as Robbie Weirdicht a 300-pounder in High School, who was also\nembarrassed in the last Assembly when he was tossed naked onto the gym\nfloor. As Bob Stone he looks like Mr. America. Bob needs Calivin's help\nto track down a meeting with someone known as the Black Badger who is\ntrying to buy information that would harm the United States. CIA chief\nHarris (Amy Ryan) tells Calivin that Bob Stone is a Rogue Agent and\nmust be captured. Later Bob Stone tells Calivin he is not a Rogue\nAgent. Calvin is confused. <br><br>This is very silly in parts but it does have it's moments that will\nbring chuckles from most. Kevin Hart is funny, but he does overact a\nlittle too much. Dwayne Johnson can be funny at times, but even in here\nhe has his silly moments and some of them are actually funny. <br><br>There are a lot of funny, well coordinated, and choreographed sight\ngags. Seems they must have used Jackie Chan's choreographers. Kudos.<br><br>Notables: Aaron Paul as Phil, Bob Stone's former partner; Melissa\nMcCarthy as Darla, Robbie's um Bob Stone's love interest from high\nschool; and Jason Bateman as Trevor who was the one who threw Robbie\nonto that gym floor in high school. <br><br>The ending when Bob Stone takes off all his clothes at the High School\nReunion was a complete disaster and totally unnecessary. It was not\nfunny and you only saw him from the waist up. <br><br>Now the really funny parts of this movie are in the out-takes when the\ncredits run. HA ! (5/10)<br><br>Violence: Yes. Sex: No. Nudity: Yes, Robbie's backside. Language: Yes,\nnot much though.\n"},
{"review": "\nI'm hit or miss with Kevin Hart films. I liked this one. He was a\nsimilar character to what you're used to seeing from him but its a\nlittle more... \"mature\" in like a depressing adult, toned down way. But\nhe's still funny and dials it up and down as the film goes.<br><br>The Rock isn't just the big macho guy either. He's a bit quirky and\nweird and its a nice change of pace from mountain man action man you're\nused to. His comedic timing is better than I expected. Plus he wears a\nfanny pack.<br><br>The movie follows some tropes you expect and then swerves at others so\nit doesn't feel too predictable. Sometimes it swerves and then swerves\nback so you still end up where you thought you were going but you get\nthere a bit differently than the generic way you'd expect.<br><br>There is a fun level of cheese to it as well. The movie never takes\nitself too seriously.<br><br>It isn't a long movie which is great. Each scene just moves at the\nright speed and you're never bored or waiting too long for a gag.<br><br>A lot of the minor characters have great scenes and moments which helps\nkeep things fresh.<br><br>If you got 90 minutes for a comedy and a bowl of snacks I'd recommend\nit.<br><br>Full review: http://wp.me/p3Ww9J-lF :)\n"},
{"review": "\nThis movie is like eating at taco bell, it is enjoyable while eating\nbut feels lacking afterwards.<br><br>Central Intelligence is a pretty standard buddy-spy style movie. I\nrented it from Google Play videos ($4.99) to watch with my wife because\nit has the Rock in it. Overall it was enjoyable to watch while we\nwatched it. The Rock is fun to watch in goofy comedies, he is very good\nat that role. Kevin Hart plays a very Kevin Hart role, and that was\nfun. There is a mystery that runs through the movie that kept me\nfocused on the movie.<br><br>However, the ending was mediocre. and afterwards looking back it just\nfeels shallow. There is a lot of easy humor, but few standout jokes.\nthe characters who are not the Rock or Kevin Hart are weak. Overall the\nmovie is forgettable.<br><br>Recommendation: If you are looking for a funny movie to watch, there\nare many better buddy spy movies. I would not go out of my way to watch\nit again. But I do not regret watching it and it was fun.\n"},
{"review": "\nTwenty years ago, Calvin \"The Golden Jet\" Joyner (Kevin Hart) was voted\nthe most likely to succeed in his high school. Robbie Wheirdicht\n(Dwayne Johnson) was the bullied fat kid who got humiliated by Trevor\nOlson and his friends. Now, Calvin is a simple accountant who gets\npassed over for a promotion. He's married to school sweetheart Maggie\nJohnson (Danielle Nicolet) who is more successful than him. With the\nupcoming high school reunion, he is friended by Bob Stone. It turns out\nto be Wheirdicht who gets him involved in an international espionage\ncaper. CIA Agent Pamela Harris (Amy Ryan) reveals to Calvin that former\nagent Wheirdicht killed his partner Phil (Aaron Paul) and is the\nmysterious criminal Black Badger out to sell stolen satellite codes.<br><br>Kevin Hart and The Rock have great chemistry together especially these\ntwo characters. It's a solid odd couple. Hart doesn't have to go crazy\nand he's actually more of a straight man in this coupling. The movie\nworks great whenever they are together. The story itself is a mix of\nfunctional Macguffin with problematic details. It would have been great\nfor the duo to have more time together.\n"},
{"review": "\nCentral Intelligence was a film that in my opinion had everything to be\none of the worst of the year, even with Dwayne Johnson in the cast and\nKevin Hart, more just enjoying it amused me enough, I liked the\nchemistry of The Rock with Kevin Hart, the film is problematic, has a\nweak script, dialogues mostly uninteresting, the scene of the fat Rock\nI found very poorly made, the pace is moderate, what we finished\nwatching is the main actors who are fun, has funny moments, some more\nand forced, I found the film with too many references, some\nunnecessary, they always cite some classic movie, Central Intelligence\nnot get to be bad, more ta far from good, is only watchable. Note 6.7\n"},
{"review": "\nThis film had the potential to be the best comedy of the year, it\nopened so well, but did not conclude on high. Like everything suddenly\nhalted, the story came to an end with giving clichéd reason. Though the\nactors were amazing, and many jokes were awesome. The lead two\ncombination was among the best Kevin Hart worked so far like in the\nrecently with Ice Cube and Will Ferrell.<br><br>The opening scenes set off the tone for the rest of the film. Twenty\nyears later, an adventure begins, but that part was so familiar, except\nthe influence of the opening part that carried till the final scene.\nEven though slightly unpredictable scenes, because the diversions were\nneatly done against what viewers could expect. The focus was largely on\nthe lead pair, so theirs undertaking was kind of faded away.<br><br>There's a guest role at the end, also some behind the scene clips\nduring the end credit cheers us. I think it is a good comedy than it\nlooks, but definitely not the best. Its not the narration, but the\nactors that makes worth a watch. The stunt sequences were just okay,\nbut utilised according to what the story required. Overall, an\nenjoyable, time pass film.<br><br>6/10\n"},
{"review": "\nThe golden jet &amp; bob stone make a great buddy comedy. Lots of laughs,\nand it didn't have that lull in the third act that most movies of this\nsort have. Quiet a few cameos, each of them were well placed and gave\nme a smile. Lots of easter eggs, and references to the 90's so pretty\ncool if you can associate with that also, but it's not necessary in\norder to enjoy the movie. A few dick and fart type jokes, but the core\nof the film was just well written comedy. I could definitely see there\nbeing a sequel, especially with the rock and kevin hart doing so many\nmovies these days. It was also a feel good movie, and not just\ncrow-barred into the movie to falsify depth, it genuinely had a good\nmessage, and made me happy. So check it out and have some laughs.<br><br>I give it a seven out of ten.\n"},
{"review": "\n,you should enjoy this film. it's entertaining enough..Dwayne Johnson\nand Kevin Hart make a good team.Kevin hart Plays Calvin Joiner,who\nunwittingly gets caught up in a CIA operation,while Dwayne Johnson\nrecruits him(sort of)there are some very funny bits,and lots of\naction.the film is fast paced.Amy Ryan also appears here and is\nexcellent,as always.she doesn't have a huge role,but she classes up the\nmovie when she is on screen.Jason Bateman has a small but memorable\ncameo.Kevin Hart was in The movie Ride along, with Ice Cube and I\nthought that was a funnier movie.still I would recommend this movie.if\nyou enjoyed 48 hours or The Lethal Weapon series you will probably\nenjoy this film.at the very least,it will keep you entertained for just\nunder two and a half hours for me,Central Intelligence is 6/10.\n"},
{"review": "\nCentral Intelligence<br><br>High school reunions are a great opportunity to rob the homes of your\nformer classmates.<br><br>Unfortunately, the alumnus in this action-comedy chose the right side\nof the law.<br><br>Athletic and academic all-star Calvin (Kevin Hart) is having a hard\ntime accepting his adult existence as a boring accountant. But all that\nchanges when the fat-kid from his graduating class, Bob (Dwayne\nJohnson), shows up fit, claiming to be a CIA agent tracking a master\nthief.<br><br>Things get complicated when a second agent (Amy Ryan) appears arguing\nthat Bob is actually the master thief they are after.<br><br>While it is yet another buddy-comedy for Hart, what sets this clone\napart is its inclusion of Johnson as its comedic half. More than\ncapable of keeping the far-fetched script on-track, he also makes his\noutlandish character work.<br><br>Moreover, telling your old classmates you're a spy is cooler than\ntelling them your childless. <br><br>Yellow Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\n\"Central Intelligence\" turned out to be a very surprising movie, and it\nwas much more enjoyable than I had initially thought it would be.\nGranted, I had somewhat of not that high expectations given this movie\nstars Dwayne Johnson and Kevin Hart, but they most definitely proved me\nwrong.<br><br>This movie is full of action, comedy and it kicks into fast pace right\nfrom the beginning and doesn't really slow down again until the end.\nThere is a lot, and I do mean a lot, of funny scenes and situations\nwith Dwayne Johnson and Kevin Hart. On the screen those two just make a\nwonderful match, complimenting one another hilariously.<br><br>The story in \"Central Intelligence\" was actually quite good, it offered\ncomedy, action and actually also had something for you to think about\nthroughout the movie.<br><br>The acting talents in the movie were well cast, especially Dwayne\nJohnson and Kevin Hart, both individually but also opposite one\nanother. They really brought so much to the movie. It was also a treat\nto see Jason Bateman in the movie, despite having a fairly small role.<br><br>I was laughing a good amount throughout the course of this entire\nmovie, and I was more than genuinely entertained.<br><br>I can strongly suggest that you sit down to watch \"Central\nIntelligence\", especially if you enjoy these action comedies that we\nsometimes see from Dwayne Johnson.<br><br>\"Central Intelligence\" scores a solid seven out of ten stars rating\nfrom me.\n"},
{"review": "\nAn extremely fast-paced lot of laughs, gunshots, explosions, and chop\nsocky.<br><br>Kevin Hart is the unwilling \"best friend\" of a man (Dwayne Johnson) who\nclaims to be a maverick CIA agent.<br><br>The movie relies on a few occasions on the stereotypical \"scared Negro\"\nwhich in the politically correct 1970s and 1980s would have been\nconsidered overtly and offensively racist.<br><br>It is hilarious, with a lot of little surprises and a lot of big ones,\ntoo.<br><br>It's an educational film, and it's not a spoiler to say the lesson is\nsomething about bullies.<br><br>Check your sensitivities at the door and have a good time!\n"},
{"review": "\nPart \"buddy comedy\", part \"odd couple\", part espionage thriller and\npart anti-bullying manifest. The result: I don't remember. Central\nIntelligence is one of those films which are so generic and lacking of\npersonality that, even a few hours after having watched it, I struggle\nto remember something I liked... or even something I didn't like. The\nstory is built by pre-fabricated scenes we have seen in uncountable\nfilms (examples: the louts bothering the hero in a bar and getting what\nthey deserve; the government agents who end up being villains, etc.).\nWith two likable actors in the leading roles (the opinion of the reader\nmight vary) and a screenplay co-written by the subversive comedian Ike\nBarinholtz, I expected Central Intelligence to at least offer enough\nhumor to compensate the incoherent \"mystery\" of the stolen secret\ncodes; the anemic \"action\" scenes, incapable of generating the\nslightest suspense or exciting; and the \"endearing\" (and instantaneous)\nfriendship forged between two different, and at the same time similar,\npersons. Dwayne Johnson repeats his \"sensitive tough guy\" routine;\nKevin Hart is given the ungrateful role of being a generic buffoon; and\nAmy Ryan brings some gravity as the agent in charge of the\ninvestigation (Does she belong to the good or evil ones? Who cares?). I\nwish I had a more vehement (either positive or negative) opinion about\nCentral Intelligence; unfortunately, it's one of those grey and\nindifferent films which aren't worthy of being remembered. I feel it\nwould have been more productive to talk about the restaurant in which I\nate after watching Central Intelligence; but the food was equally\ninsipid. Good metaphor of the movie; bad culinary experience.\n"},
{"review": "\nThis movie was fairly entertaining production that is action packed\nwith a few laughs. Though I was quite let down as both of the main\nactors can be quite humorous in their own way, and this was not\nnecessarily the case. Don't get me wrong there were a few laughs but\nnot as many as you would expect. The movie started pretty well but\ntowards the end it got a bit hard to keep up with, confusing and just\ndisappointing. I thought the lines were fairly well written. This movie\nis more for people of younger ages, as the movie is more 'goofy' than\nfunny. The character that the Johnson plays is not like his usual\ncharacters as he plays Robbie who is seemingly childish, but Dwayne\nseems to pull it off with a few sloppy scenes here and there. Overall\nthis movie was fairly good but a bit of a disappointment with comedy\nand did not lack in action packed scenes.\n"},
{"review": "\nCentral Intelligence is another entry into the Kevin Hart partners with\na stronger and taller person. However, the exception that actually\nhelps this movie is the addition of Dwayne Johnson as that partner.\nThis movie tries to change the formula around by having Kevin Hart be\nthe straight man for once and The Rock goes for the crazy role which\nmakes this for an entertaining time.<br><br>Good: Hart and Johnson make a good team together with chemistry and a\ngreat back and forth. I like that Hart takes a backseat as plays the\nstraight man while The Rock goes for the comedy by playing a very naive\ngoofy guy. The dynamic works and overcomes the staleness of the plot.\nThe jokes work because of the chemistry between the two actors. There\nare also a couple of cameos that brought some surprise laughs.<br><br>Bad: The plot is still your basic buddy cop comedy and it doesn't stray\nfrom the formula. The villains are cookie cutter and the action is\nalright. There is an attempt for a twist that doesn't really work as\nthe predictability weighs heavily on it.<br><br>Overall, as another Kevin Hart buddy cop comedy, this is easily the\nbest one he has made thanks to the inclusion of Dwayne Johnson. Worth a\nshot if you are in the mood for a light comedy.\n"},
{"review": "\n6'5\" Dwayne Johnson plays a timid, shy goofball, who has somehow been a\nCIA agent for years, and contacts an old high school friend (played by\nKevin Hart) through facebook, who turns out to be bored with his decent\n(but not great or exciting) life. Shenanigans ensue, when Hart is\nunsure if Johnson is who he claims to be, or if he's a killer and\nhacker.<br><br>Hart occasionally overdoes his usual screeching act, but he does well\nas the straight man, and he and Johnson do have a great chemistry\ntogether, which alone makes this worth watching. Jason Bateman puts is\na really weird, but really funny cameo, as the former high school\nbully, in a weird twist, vaguely reminiscent of 2015's, The Gift. <br><br>Funny but unmemorable buddy/ action movie could have benefited from a\nbit of editing, it's about fifteen minutes too long, and has at least\nthree endings.\n"},
{"review": "\nThis film tells the story of a high school superstar who grows up to\nfind that he is not as stellar as everyone thought he would be. On the\nother hand, the high school loser grows up to become a strong and\ncourageous CIA agent. Their paths meet again and together they fight\nfor national security.<br><br>\"Central Intelligence\" has a very unlikely story, as a regular person\nsimply will not do all the things Calvin Joyner does in the film. I\nwould certainly not invite someone I have not seen for twenty years\nback to my home, certainly have cooperated with the authorities and not\nhave played along with Bob Stone in the doctor's appointment!\nNonetheless, it is fun and entertaining to watch. There are quite a few\nbig stars in the film that is not mentioned in the poster, so there is\na series of nice surprises as familiar faces appear on the screen.\nOverall, it is a fun film for a brainless evening.\n"},
{"review": "\nThis movie had quite a bit going for it, Dwayne Johnson, Kevin Hart,\nthey're known for decent films, but this movie had too many cons, but\nlet's start with the good side:<br><br>1. The action scenes were a good balance between funny, action packed &amp;\nborderline ridiculous, Hart's lines during the action sequences made up\nfor some of the ridiculousness. 2. Johnson's &amp; Hart's chemistry is\ngood, it's not amazing, it's just good. They bounced off each other,\nthey're lines, some of which were improv, didn't totally fall flat, but\nsome did.<br><br>The Cons: 1. The writers were trying too hard to make the viewers\nexpect something, but throw us completely off guard it makes either, no\nsense, or makes the characters seem too dumb. 2. A lot of the\nreferences to pop culture fell flat &amp; were too outdated. Everything\nfrom old online videos that weren't incredible back then &amp; now are just\nobscure to reference now. 3. Johnson's character is just too weird, if\nyou've seen the trailer, that's basically who the character is, he's\ntoo dumb &amp; weird, it could almost be insulting to some people. 4. The\nTrailer Showed The Whole Film! They tried to make it so it's not the\nobvious answer, but it's the trailer &amp; I quickly got bored of it.<br><br>But my biggest problem with Central Intelligence is: The Bloopers Are\nThe Best Part! During the credits, they show bloopers from the film &amp;\nthey were genuinely funnier than the rest.<br><br>You'll enjoy it if you're a 15 year old boy, but it's more of a last\nresort to waste time.\n"},
{"review": "\nThe movie seems to be just another action comedy like everyone used to\nsee it before. Even if the chemistry between Johnson and Heart is just\nright and they act greatly together, I'm missing some new innovative\nideas in the movie. It's clearly fun to watch but it's never really\nsurprising. At some point the story line misses something and gets\nconfusing for a while. Later in the movie this problem doesn't matter\nanymore because the main part of the story is over too fast.<br><br>The friendship of Johnson's and Heart's characters changes through the\nwhole movie several times, which just gets boring in the end. And don't\nget me wrong: I like the movie and the ending but it's definitely not\nnew to me.<br><br>All in all the movie offers good entertainment with two well playing\nactors and an average screenplay.\n"},
{"review": "\nI was highly disappointed by an absolutely awful script for this\nconcept. For the genre of comedy, action there was the addition of\ndramatic elements of the Hero's character. This was actually a\nsub-genre of comedy: The buddy picture. Both characters had back\nstories to their high school days. There's the irony of the\noverachiever \"little guy\" and the buffoonery and cruelty toward the\n\"fat guy.\" Then we have the \"most likely to succeed\" wallowing in his\ncareer as opposed to the \"fat guy\" who worked out 6 hours/day for 20\nyears and now is a superman in strength and who now is a CIA operative\nwith superhuman combat skills. But how the above was related to the\naudience is where this script really fell down. The opening 10 minutes\nwas pure talk. No action, just talk, talk, talk in one location. And\nthen we have the incident we've been waiting for: the meeting of the\ntwo buddies. Then for the next 10 minutes, we have more talk, talk,\ntalk at a bar...one location. So for 20 minutes, it's slow moving and\ngoing nowhere. In the action genre the audience comes prepared to see\naction. There is none. In the last 10 minutes of Act 1, we finally get\na reveal as to the covert work that Dwayne has been doing these past 20\nyears, but it's more talk, talk, talk. Then we have the C.I.A. breaking\nin and we have the spoof of the Bourne series. Okay. I love the acting\nof the two buddies, but the script was so predictable, and yet so\nabysmally boring with talk, talk, talk, the audience was shifting in\ntheir seats from sheer frustration. No spoilers here, but this was an\nidiotic plot with predictable turns. Even the decent chemistry between\nthe stars could not save it for me.\n"},
{"review": "\nCENTRAL INTELLIGENCE: Dwayne Johnson, Kevin Hart and the rest of the\ncast are having a great time in this buddy, espionage, action, comedy\nand so will you. A high school classmate (Johnson) shows up 20 years\nlater seeking 'accounting' help from the most popular kid in school\n(Hart) and the latter becomes involved, with great reluctance in a plot\nto secure secret US satellite codes. Johnson may or may not be the\nBlack Badger who may or may not be a rouge CIA operative who is after\nthe codes. The direction keeps the story moving at a crisp pace, the\ncomic timing is spot on, the sight gags are sharp, the action sequences\nare entertaining and it's laugh out loud funny. There is a cameo\nperformance at the end that will delight. Score: 8.5. Go. Stay for the\nout takes.\n"},
{"review": "\nI'm a 40 year old white woman who doesn't enjoy childish, Adam Sandler\nstyle potty humor. I also don't really like gross out humor either.\nThis film was by in large neither of those. It was just plain, classic\ncomedy. Dwayne Johnson and Kevin Heart have perfect chemistry for a\nbuddy comedy and play very well to their strengths throughout. My whole\ntheater was laughing through the entire film. To give some perspective\nthere, I rarely see comedies in my town because of boring crowds who\ndon't make a peep at the funniest parts. I think This film has a very\nwide appeal and I highly recommend it if you're looking for a fun night\nout.\n"},
{"review": "\nI really enjoyed the central mystery of who was the Black Badger in\nthis movie. The action sequences were great, but the comedy was lacking\nthroughout the movie. The funniest moment was hands down when Calvin\nreceives the friend request from \"Bob Stone\" and some guy pops up on\nthe screen with a metal rod attached to him. That was hilarious. There\nwere some awesome nods to shows like the Office and Breaking Bad, like\nhow Amy Ryan was named Pam (receptionist from the Office), and when\nAaron Paul said \"BITCH,\" just like he does in Breaking Bad. I didn't\nfind Kevin Hart and The Rock to be as funny as everyone else did, but\nthe movie was still good. The first 20 minutes or so were hilarious,\nbut the rest was average.\n"},
{"review": "\nI really enjoyed this movie a lot. It was almost as good as the intern.\nI would highly recommend it. I went to see it because my brother said\nthat he thinks it is great a first I did not want to go because it\nseemed cheesy, but I was in for a nice surprise! Go see it! Just go!\nKevin and Dwayne's chemistry is great. Also the plot is interesting.\nThe final part of the movie is also funny!Also it's pretty clean movie\nnot a lot of bad words, and almost no sexual things going on. It's PG13\nyes. I have to say that there is no real message in the movie only fun\nto watch and laugh. For sure watch the final part of the movie after\nthe end. Those are a lot of fun!\n"},
{"review": "\nI haven't seen a comedy movie that had made me laugh out loud in a\nwhile. Most movies nowadays throw in drugs, sex and parties which\npretty much sums up most of the comedic movies that have hit the big\nscreen in 2016. I wasn't expecting much out of this movie, but I knew\nthat I had a decent chance to get a laugh.<br><br>Both Kevin Hart and Dwayne Johnson delivered with a chemistry which\ncould only be described as bromance; a bromance which rivals Jackie\nChan and Chris Tucker in rush hour 1, and 2. Now don't get me wrong\nhere, I am not saying it was a better bromance than we witnessed in\nthose movies, but it definitely gives those two a run for their money.<br><br>Grab the popcorn, hang on tight, and enjoy the movie like you were\nabout to watch Jackie Chan in rush hour.\n"},
{"review": "\nThe movie is better than others are giving it credit for, and I am\nlargely unsure why. The plot is solid and keeps you guessing, the\nacting is for the most part perfect. The jokes are on point, the pacing\nis good, and you are able to laugh then rest and then get excited over\na well down action scene rest and then repeat the process. It is hard\nto find a movie that lets you get a moment to catch your breath and\nreset your emotions a little. <br><br>The Rock is amazing in his role of someone so friendly and caring, yet\nalso so out of touch with reality. He has good chemistry on screen with\nKevin, and the scenes of him just basically ignoring everything Kevin\nhas to say or think in order for him to get him to come along are done\nvery well. <br><br>Where the movie has trouble is the scenes with Kevin Hart trying to be\nKevin Hart. When he is in a scene without Dwayne, and is trying to be\nfunny it falls flat. His over the top style doesn't work when someone\nis being better at it, which Dwayne does in almost every scene. Kevin\nactually does some good acting when he is serious and not trying to\nforce laughter on the audience. <br><br>Also the movie is paced at such perfection that you don't even notice\nthat 2 hours have flown by, and that is important. A 2 hour film is a\nlong sit, and when you are thinking about the time and not the movie\nthat tells you that a movie hasn't got you invested in it, but Central\nIntelligence does a good job of keeping you invested. <br><br>I can't wait to own this one on DVD.\n"},
{"review": "\nKevin Hart does it again as the washed up high school athletic star and\nDwayne Johnson as a character who almost anyone can relate too and a\nlot of laughable and cringe worthy moments<br><br>May not be Oscar material but the acting was good for what it was\nsuppose to be<br><br>This movie is a busy cop action comedy for all types of people, and\nactually not as dirty as you would think<br><br>Not for young kids in my opinion<br><br>Their were two big surprises at least in the US version to where the\ntwo stars of Identity Thief show up in an unaccredited role and made\nthe whole movie\n"},
{"review": "\nAvoid this movie ! This weak story line is not helped in the slightest\nby Kevin Hart and Dwayne Johnson poor attempt to act. Even though Kevin\nHart is a respected stand up, there was no funny moment in this movie\nthat was not shown in the trailer. Save yourself some money and time by\njust having a cheap laugh at the trailer as this contains the few\ndecent parts of the movie. The predictable story line of the popular\nhigh school jock (Kevin Hart) in the future becoming a bit of a loser\nstuck in a dead end job. While a school nerd becoming some cool FBI\nagent (Dwayne Johnson) is such a lazy plot and there is no real\ndevelopment on the story line other than this. Not to mention the fact\nthat Dawyne Johnsons attempt to play a different sort of character than\nthe typical hard man just comes across strange and unbelievable and is\none of the worst examples of acting i have ever seen in my life.\n"},
{"review": "\ni love this movie, i love the puns, jokes, and even the anti-climatic\nthings, its a great movie and has cool action packed scenes to keep you\non the edge of your seat! i personally recommend this to you and anyone\nelse (13 or above) i don't know if anyone got any Oscars for this but\nthey should for great acting! There is so much drama, mystery,\ntheoretical thoughts going through you mind during this movie, it truly\nbrings a bang to your imagination, and not to mention the hilarious\nfailures in the movie, outstanding! id love to spoil the rest of the\nmovie, but that is not *IMDb* material stuff, so ill let ya spoil\nyourself Enjoy!\n"},
{"review": "\nLoved the duo of Dwayne Johnson and the Rock the movie was hilarious\nand a great movie! Seen it 10 times, its great. What i cannot stop\nthinking about is how in the heck did Aaron Paul (Phil) do the\nroundhouse kick he did its like he was horizontal flipped 2 or 3 times\nand then kicked the Rock ITS AN AWESOME KICK!!! (yes i know they\nprobably used wires and camera magic, but still makes me wonder is that\nkind of kick even possible?)<br><br>The Rock was really cool in this one, and saw a great friendship grow\nthroughout the whole movie. And it all ended with a big bang! Showing\nthe girl I have a huge crush on crushing on Melissa McCartney LOVE\nHER!!! Shes hilarious. I can't get enough of this movie! <br><br>Kevin hart shows how all people should treat the ones who have been\nbullied. And the rock shows how strong someone can become overcoming\nthe trauma of a bully!\n"},
{"review": "\nAfter he reconnects with an awkward pal from high school through\nFacebook, a mild-mannered accountant is lured into the world of\ninternational espionage. Central Intelligence packs 2 great leading\nperformances by Dwayne Johnson \"The Rock\" and Kevin Hart they are both\nhilarious and The Rock kicks some serious butt in this film he is a\nbadass, he is funny and when the film is dealing with him and his\nbulling problem and how he overcomes it's truly terrific also spoiler\nalert Melissa McCarthy makes an appearance for around 3 minutes and\nshe's truly terrific and she is a lot better than Ghostbusters, there's\na lot of references to Sixteen Candles and Road House but my favorite\nis Aaron Paul's Breaking Bad moment which was awesome. If you love good\nmovies about action and humor in it you won't be disappointed i give\nyou my word but only if you're a fan of this 2 and this kind of type\nfilms if not skip it.\n"},
{"review": "\nBut its not, its totally not. Its a different kind of stuff and its so\nfunny. Its make me laughing all the time with all the jokes and gags. <br><br>When the trailer come out, I just thought that this is just some \"fast\nmoney maker\" for \"Ride Along\"'s hit. I did watch both \"Ride Along\" and\nI really like the first one but not the second one because I think its\nso cliché and not really funny. Then, I still watch this movie because\nI just want to enjoy some lighthearted fun movie and... its really a\ngood choice!<br><br>Its really funny, exciting and hilarious to watch. Oh God I don't know\nthat The Rock could be this funny. Highly recommended guys!\n"},
{"review": "\n\"I didn't trick you, you offered to help me.\" Calvin Joyner (Hart) was\nthe most popular and successful student in high school. Years after\ngraduation he is struggling to live up to expectations and is\nconsidering not attending his class reunion. When Bob Stone (Johnson),\nthe most unpopular kid in school shows up Calvin thinks he is being\nnice by talking to him. When Bob's true intentions, and secrets, come\nout Calvin is put in a rough spot..and the fate of the world rests on\nhim. I was not really looking forward to seeing this at all. I'm not a\nhuge fan of The Rock and I do think Kevin Hart is funny, but can get a\nlittle annoying sometimes. I say that to tell you that this movie is\nhilarious and both of those actors where amazing in this. The Rock\nreally lets his comedic side show and Hart does a great job playing,\nessentially, the straight man in this movie. Not once did I find him\nannoying and that added to the enjoyment of this for me. There are some\nvery funny lines and scenes in this and I laughed pretty hard and loud\na lot throughout this. Overall, one of the funniest movies I have seen\nin a while, great chemistry by the actors but the best part was that no\none seemed to try to hard\u0085which made it seem real. I highly recommend\nthis. I give this an A-.\n"},
{"review": "\nThe smallest man in Hollywood teamed up with the largest man in\nHollywood. Sounds like a recipe for success, right? After all 'Twins'\nin 1988 starring Arnold Schwarzenegger and Danny DeVito was considered\na hit. The problem 'Central Intelligence' faces is that its stars have\nalmost zero chemistry together. They are purely working as individuals.\nA film can still survive with its stars doing that, but it does take a\nlot of quality away. Kevin Hart is his usual self, trying to be the\nlife of the party and doing his best Chris Tucker impersonation at the\nsame time. Every movie he's in seems to be almost the same performance\nthese days. Does he have more levels to his acting ability? I'm\nstarting to doubt it. <br><br>Dwayne Johnson on the other hand gives a fairly solid performance. He\nhad layers, with his character changing motives many times throughout\nthe film, and he pulls them all off. He was still lacking the comedic\ntiming that a professional funny-man would have nailed, but his\nenormous physique also lets him pull off jokes that others could not\nget away with. <br><br>Sadly though, both are acting purely on their own and never manage to\nfeed off each other. Luckily for them the script is actually quite\nstrong and well-written which covers a lot of this up. There are some\nquite good action scenes and the story actually has some genuine\nmystery and suspense to it at times. There's a tremendous amount of\nnods to the audience to look out for (one from Aaron Paul of 'Breaking\nBad' is particularly noticeable) and some unexpected cameos that work\nin quite well. All in all it's a watchable, yet forgettable, action-\ncomedy.\n"},
{"review": "\nCentral Intelligence stars Kevin Hart and Dwayne Johnson and its the\nstory of how Kevin's Harts character teams up with The Rock for a CIA\nmission of some-kind. The best part of this film is the chemistry of\nthe main leads. Kevin Hart and the Rock play each other really well and\nthey seem to be having the most fun in this movie. But what this film\nfell apart for me is the \"intriguing\" story the film tries to tell. Its\nreally dull and too complicated for its own. Besides that, the film is\nreally funny and i think Kevin Hart steals the whole show. The Rock is\nfine but since his character is being bullied throughout the film and\nalso in the past, the film does a lousy representing what i think is a\ngood message, but its handled in the worst way possible and its really\ncliché. Also i don't know why but throughout the film, Kevin Hart does\nnot want any part to do with the rock's plan, and it kinda seems that\nThe Rock is a bad guy, and that was kind of weird at first. Then it\nkicked off where it started at the end based on the chemistry of the\nleads. Overall, the action well handled, its really funny at parts, and\nthe actors play well with one another, but the story that the film\ntries to give us, its really bad. Also the overall message is important\nbut not played well in this film. 6.5/10\n"},
{"review": "\n'Central Intelligence' is driven by the charisma of Dwayne \"The Rock\"\nJohnson and Kevin Hart. Both of the terrific actors boast enviable\nenergy &amp; rise above the film's clichéd narrative. Its good fun! <br><br>'Central Intelligence' Synopsis: After he reconnects with an awkward\npal from high school through Facebook, a mild-mannered accountant is\nlured into the world of international espionage.<br><br>'Central Intelligence' rests on a predictable plot, that doesn't hold\nmuch innovation. But, as mentioned before, its Johnson &amp; Hart who make\nit thoroughly watchable &amp; also enjoyable. They are willingly ready take\nup the silly jokes &amp; also turn up the action-sequences, with complete\nconviction. And Director Rawson Marshall Thurber plays to their\nstrengths right!<br><br>On the whole, 'Central Intelligence' has its heroes doing it right.\nWatch It for them!\n"},
{"review": "\nHow can American be so crude and out dated as to keep making race\nmovies? A formulaic racial stereotypical movie here! The fast- talking,\ndark-skinned black man with the light skin toned wife, who is\nintelligent. Had the wife been a dark skinned black woman, she would\nhave been, head shaking, loud, lascivious and uncouth. <br><br>Don't take my word, go back and watch any movie or television show in\nwhich the black woman is dark-skinned, she will be a fool! <br><br>Of course, some of you can pick an exception, and granted, there may be\na few. But the overall formula is light skinned smart, dark skinned\ndumb, and with no class, sex hungry, etc. <br><br>And the dark-skinned scared for no reason a black man that Hart\nportrays here is from the old days of Charlie Chan, Three Stooges\nShorts(This house is sho gone crazy!) The difference here is, they can\nuse a little profanity. How many times did Hart make the comment \"I'm\nblack\" in this movie? <br><br>It is just sad that Hollywood and our Global Esoteric Elite still\nprefer to keep the racial stereotypes alive. Italians are all\ngangsters, the Irish are drunks, Mexicans are thieves, Polish are dumb,\nand Jews are money hungry! <br><br>And, it is not playing the race card for me to mention a racial\ncomponent to a movie or show. This type of entertainment widens the gap\nbetween all of us.<br><br>If you like the movie fine, but keep on living and you'll soon come to\nunderstand why this type of brainwashing is bad for our collective\nhumanity. Movies like The Help, The Butler, Django, 12 Years a Slave,\nand Tarzan, are all a part of the program to bring out ill feelings\nbetween blacks and white in this country and the world over. <br><br>These movies, along with the recent white cop killing black men, and\nblack man ambushing and killing white cops, are all a part of a greater\nscheme. Don't fall for this folks!\n"},
{"review": "\nI do not mean that as an insult! This was an enjoyable movie to watch. <br><br>The movie, overall, is fun. If you don't see the chemistry between\nJohnson and Hart during the movie, you definitely will in the bloopers\nthat show up during the end credits - which I would stick around for. <br><br>Story wise, there are not going to be any big surprises. <br><br>Much like other reviews, I can't help but feel this could have been\nmuch funnier. There's plenty to laugh at, certainly, but there wasn't\nanything that really had me out-of-breath laughing, either from a\nsingle joke or a part where there could have been a string of them.\nHowever, this movie does have a very good underlying theme, that was\nset up in the beginning scene, used for creepy/joke material a bit\nthroughout, with redemption at the end. <br><br>Like I said, a very good matinée.\n"},
{"review": "\nThe movie really tried to be funny. But with all those Kevin Hart\nmovies, it's just a bit much with this movie. It's like people\nanticipated more after all those movies, which don't really got to be\nso funny. This movie's earlier premise seems interesting enough that it\nspots the focus on Dwayne Johnson being a new kind of character than\nhis usual buffed up macho man. But the movie clearly failed to deliver\nthe justified conclusion to its premise. The character development also\ndidn't feel good. The acting is just flat, just all other Kevin Hart\ncomedies. Yet while they depend on the story and jokes, this one failed\nto deliver in following suit.\n"},
{"review": "\nThis is an action comedy which does not aim very high and therefore\ndoes not fall very flat. <br><br>It's a kind of bromance in which the two male characters are not just\ndifferent from each other (one a short office worker and the other a\nhuge CIA agent) but different from how the were when they were at the\nsame high school 20 years ago (the coolest kid in school failing to\nachieve his expected future while the fat, bullied kid becomes a\nturbo-charged fighting machine).<br><br>No prizes for guessing which of the two lead actors - Kevin Hart and\nDawyne Johnson - takes which role (one fast with his mouth, the other\nfast with everything else), but they are both sufficiently engaging to\nmake a mediocre movie quite entertaining.\n"},
{"review": "\nHumorous, action packed and heart warming story with Dwayne '\"The Rock\"\nJohnson and Kevin Hart. <br><br>I was invited to an advance screening of central intelligence on the 4\nJune in London hosted by Kevin Hart and the film is certainly a crowd\npleaser with a lot of good action in between the silly but funny\nantics. <br><br>It's certainly a role reversal with The Rock bringing most of the witty\ncomedy and Hart being the more serious of the two characters.\nNonetheless there's a good screen chemistry between these two that\ndoesn't appear in similar Kevin Hart films. This isn't just a roll your\neye and laugh at the stupidity type of film. There is an entreating\nstoryline throughout that keeps you guessing to the end and there's a\nlot of things to keep you entertained along the way much like the Rush\nHour movies (Albeit nowhere as good) <br><br>A Must watch. Fingers crossed for a sequel!\n"},
{"review": "\nCentral Intelligence <br><br>Directed by Rawson Thurber who you might remember directed DodgeBall\nand We're the Millers. Unlike DodgeBall, I probably laughed as many\ntimes as I did in We're the Millers. This of course isn't the directors\nfault but Ike Barinholtz's. The guy from MADtv, it was his first time\nreally doing a major film and the jokes were too far and few in\nbetween. <br><br>Dwayne Johnson plays a CIA agent who needs the help of his high school\nbuddy to exonerate him. Johnson committed himself to being in character\nthroughout the film and it really shows how far he's come as an actor. <br><br>Kevin Hart plays Calvin Joyner, the popular kid in high school that\npeeked and is having trouble in his personal life now. He just wants to\ngo back to the familiar lifestyle despite being brought in time and\ntime again by Johnson. His performance was much better than in Ride\nAlong 1 or 2. <br><br>There are three surprise actors in the film that the trailer didn't\nshow and they are each worth it. The dialogue was great, not funny, but\nmuch of it takes some references from TV and movie culture to\nunderstand. Something perhaps a teenager or elder might not get. <br><br>I also want to mention that Danielle Nicolet was in the film as Calvin\nJoyner's wife. She does a wonderful job and is an under-appreciated\nactress in Hollywood. I recognized her from 3rd Rock from the Sun and\nas the wife from Key and Peele. <br><br>Verdict: Watch the movie. Don't watch the trailer as it has many of the\nfunny parts in it and would spoil it for you. The ending is good, but\nalso predictable.\n"},
{"review": "\nCentral Intelligence succeeds because the chemistry between Kevin Hart\n&amp; Dwayne \"The Rock\" Johnson is so engaging that the film really becomes\nthe ultimate bromance movie. The chemistry between them is so strong\nthat it almost carries the entire film but ultimately falls short due\nto a weak third act.<br><br>Dwayne Johnson portrays a lovable, goofy, yet straight arrow CIA agent.\nHe is impressive as a comedian, he provides plenty of charm and is\nsurprising vulnerable. Kevin Hart is pleasantly restrained but still\ncomes off very likable. He is a great straight man which is a real\ntreat compared to what I usually see him in. Bravo to both men for\nplaying against type.<br><br>The films biggest flaw is in its third act. The story of these two men\nwho haven't seen each other since high school and becoming reacquainted\nto attend a high school reunion really should have been the heart of\nthe story with the Johnson's involvement with the CIA kept only as a\nsubplot. As it is, the films third act devolves into a standard, paint\nby numbers action flick and almost grinds the film to a halt.<br><br>As it is Central Intelligence is a fun afternoon popcorn flick.\n"},
{"review": "\nIt was hard to accept that Kevin Hart and Dwayne Johnson were going to\nbe in a movie together. The thought of them having good chemistry....it\njust never worked for us! However...we were proved wrong again! Kevin\nHart and Dwayne Johnson have excellent chemistry as not only high\nschool buddies, but as a team to work together to bring down the main\nvillain! The first segment of the movie shows us what happened to Bob\nStone (Dwayne Johnson) in school and he he was humiliated and bullied\nin front of the whole school. Calvin (Kevin Hart) was the only one that\nreally looked out for him or helped him. Now years later Bob Stone\nsends a facebook message to Calvin asking him if he wants to hang out\nagain like old times. Calvin accepts and they both have a fantastic\nnight. Little does Calvin know what is installed for him: Bob Stone is\nCIA Agent and needs Calvin help to locate the main Villain behind all\nof this.<br><br>Dwayne Johnson is actually really good at comedy. His comedy shines\nduring the first half of the movie, but during the second half Kevin\nHart steals the show with his comedy by being over the top and having\nthat high pitched voice we all know and love! The comedy..well..there's\nhit and misses when it comes to the comedy in this movie, but luckily\nit is saved by the emotional and heartwarming message of this film,\nwhich is that bullying is wrong and you should be accepted no matter\nwho you are and no matter what you do. Normally this does not work in\nmany comedies, but luckily it works here. There were missed\nopportunities throughout this movie, and it could have been longer and\ndug deeper within the two main characters, but it is what it is and it\ngets the job done.<br><br>All in all, it's a very watchable movie. Heart breaking, emotional and\nvery funny in certain scenes (especially a scene involving a counseling\nsession). Go and grab your girl or guy and sit back ,relax and enjoy\nCentral Intelligence! 3.5/5 stars. 7.5/10 -Autistic Reviewers\n"},
{"review": "\nOK. I'm not gonna beat around the bush on this one. This film has been\nreceiving mixed reviews, and I'm not a huge fan about that. This film\nis totally great. The relationship between Kevin Hart and Dwayne \"The\nRock\" Johnson are great as well as the other characters, the jokes were\nfreaking hysterical (Including the end credits where they show outtakes\nof the film) and the story was full of twists that I honestly did not\nexpect. But it does have a bit of a problem: Some, not all but some, of\nthe movie was kind of boring to me. That, and the dialogue was kind of\nflat at some parts. But overall, Central Intelligence is a mostly great\nsummer comedy and I am glad to give it a 7.5 out of 10.\n"},
{"review": "\nCentral Intelligence stars Dwayne(The Rock)Johnson and Kevin Hart and\ntells the tale of a former popular high schooler named Calvin(played by\nHart)who had it all in school. Meanwhile an obese guy called Robbie\n(played by Johnson)was bullied in school and was made fun of. Fast\nforward 20 years later and now Calvin is a down on his luck accountant\nwho gets a mysterious invite on FaceBook from a guy called Bob Stone\nwho wants to catch up with Calvin. Little does Calvin know is that Bob\nStone was the obese kid at his high school 20 years ago and he is now\nworking for the CIA and is tracking down the black badger. So Calvin\nand Bob go off on a crazy action packed adventure to find out who is\nblack badger and clear Bob's name. But could Bob's former partner in\ncrime have anything to do with this?<br><br>Overall I seen this today in the cinemas and quite frankly I really\ndon't know what the critics are saying about it. It was funny and I\nthought both Dwanye and Kevin had great chemistry as the oddball\naccountant and the former nerdy loser who was made fun of his weight\nRobbie.<br><br>Now I am gonna tell you the good and the bad.<br><br>Good: The humor was funny and the two main leads was great. Kevin Hart\nreminds me of Chris Tucker right down to the mannerisms.<br><br>Bad: The story seems to rip off The Heat which starred Sandra Bullock\nand Melissa McCartney(who makes a brief cameo in Central\nIntelligence)and it gets kinda predictable too.Also Dwanye Johnson is a\nfairly descent actor but his smile is so forced.<br><br>But still I had a great time watching this with my brother who also\nlaughed at Kevin Hart's references from Sixteen Candles to Taylor Swift\neven Twilight and Face Book gets mocked in this film.<br><br>Zootopia's Jason Bateman also makes a cameo as the boy who bullied\nDwayne Johnson's character as a kid. <br><br>7/10<br><br>4/5\n"},
{"review": "\nCentral Intelligence (2016): Dir: Rawson Marshall Thurber / Cast:\nDwayne Johnson, Kevin Hart, Amy Ryan, Aaron Paul, Danielle Nicolet:\nAction comedy with a title that references heart. Dwayne Johnson plays\nRobbie Weirdicht, an overweight kid caught showering naked. During a\npep rally to finish off the 1996 school year he is tossed by bullies\nout into the gym where his nakedness is met by laughter by all except\none person. Kevin Hart plays Calvin Joyner, an accountant who is passed\nup for a promotion and feels that his life is going nowhere. He was\nhigh regarded in high school but became a hero to Robbie when he issued\nhis jersey to cover himself up during the prank incident. He is married\nto his high school sweetheart but unsatisfied with his life. Robbie\nre-enters his life as Bob Stone who is seemingly innocent until C.I.A\nagents turn up looking for him. Calvin becomes mixed up in this when\nBob thought his accounting skills to uncover codes. While the ending is\ncorny the screenplay does a great payoff with regards to who is\ninnocent and who is guilty placing viewers squarely in Calvin's\nposition. Johnson displays some vulnerability as Bob whose tough in\nshape agent conceals emotional pain from yesteryear. Hart as Calvin\ndemonstrates friendship but ultimately confusion when decisions rack\nup. Supporting characters are props including Amy Ryan as agent Harris,\nAaron Paul as Bob's ex-partner in a predictable development, and\nDanielle Nicolet as Calvin's wife. Well made action farce with a\nmessage regarding bullying and its lasting affect as well as good deeds\nnot forgotten. Score: 7 / 10\n"},
{"review": "\nThe combination of wrestler Dwayne \"The Rock\" Johnson and comedian\nKevin Hart proves a winning formula in this laugh out loud summer\nrelease. Hart plays accountant Calvin Joyner who was once popular back\nin high school lending his varsity jacket to a bullied CGI overweight\nJohnson as Robby Weirdicht aka Bob Stone. This event has repercussions\ntwenty years later as Hart's Joyner has become disaffected in his\nprofessional life and having trouble in his marriage. Bob Stone shows\nup right before the twenty-year high school reunion and he has packed\non the muscles from working out six hours everyday for twenty years.<br><br>Stone also has become a CIA agent and involves who he believes is his\nbest friend, the accountant Joyner. Hart is great as the reluctant\naccomplice caught up in a case of international espionage that doesn't\nhave much of a background focusing more on jokes. There are a few spots\nwhere the action pauses to let Hart deliver long comedic monologues\nthat don't always hit as great as his standup does and slows down the\nplot but the comedy is greatly enhanced by The Rock's giddy\nperformance. As a once peculiar kid, Johnson embodies the bullied kid\nWeirdicht who has now become a tough international spy.<br><br>Check out more of this review and others at swilliky.com\n"},
{"review": "\nI just discovered another \"big\" actor, Dwayne Johnson. He's very big,\n6' 4\" (1.93 m). I can not say that he doesn't have some charm, I\nexpected something much worse from this \"Central Intelligence\". I don't\nknow about Kevin Hart, is he really a gifted comic actor or just a\ntedious presence? The other actors, Amy Ryan, Jason Bateman, Aaron\nPaul, Thomas Kretschmann? They do their best to win their existence,\nit's not easy at all to be an actor, specially when the script it's not\nso good. Anyway, it has some action and some good music. For the level\nof \"intelligence\" in the world today, the film is above. Be careful\nwith the CIA, not to burst over you in the house (or cinema), while you\nwatch it! Everything is possible nowadays...\n"},
{"review": "\nI'd never normally choose to go and see a film like this, but free\nticket. Happy I went. I don't normally laugh out loud in a cinema, and\nthis had me chortling throughout. Many other reviews explain the story\nand the 'chemistry' between the two main actors. But what really struck\nme is what a fine actor Dwayne Johnson is. I guess all those years in\nWWF have paid off. In the movie he plays two very different people, and\nvery believably. He switches effortlessly from one role to another, and\ncan really bring menace to his part. His comedic side was excellent,\nplaying the over-enthusiastic buddy, and delivering banalities with\nsuch sincerity you almost forgot it was scripted. Well written, though\nsometimes Hart's black shtick was a bit overdone, nicely paced after a\nslow start, and really good fun that doesn't take itself too seriously.\nGreat date film, she'll love you for it :)\n"},
{"review": "\nthis is your basic buddy movie, fighting the bad guys, bigotry, racism,\netc. it's not my usual fare, but the movie got pretty good reviews so I\ngave it a try. there is nothing wrong with the movie, exactly: it just\nlacks imagination and spark. the director paints by the numbers and\ngets us from a to z. there are no surprises as far as the film goes and\neverything works out as you expect. when I say no surprises, I can't\nsay that about the two stars. their chemistry is great and I was\nespecially impressed by dwayne Johnson. he is really quite good here.\nhe is a natural and his line readings are right on the money. I suppose\nthere was some amount of acting in his former profession. anyway, it's\na nice little movie. just don't expect a lot. every movie can't be a\n10.\n"},
{"review": "\nDewayne Johnson continues to impress as he pretty much carries the film\nhere. It must be said that he wouldn't be nearly as effective without a\ngood co-lead. Kevin Hart hits a sweet spot here against Johnson. It's a\ngood pairing which works hard to make a ridiculous story work.<br><br>The ugly duckling turn mysterious black swan (i.e.possibly an evil\nswan) begins a wild ride in which Hart's over-acting seems, well,\nnaturally correct. Hart's Calvin Joyner \"The Golden Jet\" character,is\nthe former high school golden boy who has hit a rut. His life is\nsuddenly turned upside down by the one person who was the most bullied\nand downtrodden classmate, now known as Johnson's evolved new man, Bob\nStone. The strange re-union of the two is exemplified by the fact\nthere's a 20-year class reunion looming among all the chaos. <br><br>These two might have hit it even better had the story not been as thin\nand lightweight, but considering all things this is a case where the\ntwo leads gel so well as to make the picture much more enjoyable than\nit has a right to be.\n"},
{"review": "\nSat down wanting to shake off the day over a couple of jars and a few\njokes. After allowing for the slightly clumsy though well acted set-up\nthe pace did not let up for a moment. With two high quality leads and\nexcellent scripts this \"brain off\" funny movie left me and my family in\nstitches. <br><br>I want slapstick and with this vehicle for visual and verbal jokery and\nwas rewarded in spades, this was not an intellectual chuckle, I hurt\nfrom laughing. <br><br>Dwayne Johnson and Kevin Harts swapping of funny/straight lines was\ndone crisply and the best comedic talent was bought out of both actors\nwho balanced hamming it up with some excellent down the line acting. <br><br>The support cast of wives, friends, CIA etc. come straight out of every\nAmerican movie you've ever watched and were done to perfection.<br><br>Well worth it humour for teens and up..\n"},
{"review": "\nThis has got to be the BEST SUMMER COMEDY in 2016. In an era when\ncomedies have slipped into inane stupidity floundering, falling way\nbelow any Animal House level or Spaceball spoof, Central Intelligence\nhas broken the mold with Fantastic Comedy, Pure Adrenaline and\nKick-the-Bully-Heart!<br><br>This movie is inventive, has fabulous misdirection and engaging special\neffects and the chemistry between the male leads simply is a joy to\nwatch. In a head-to-head with Ghostbusters, Central Intelligence\nactually won - thankfully Melissa was in both, but her cameo in Central\nIntelligence was just off the charts adorable and had the audience\nrolling in the aisle! <br><br>Trust me. Go see this movie and you will love it. G-rated enough for\nfamily fun, romantic enough to take your girl, and thrilling enough to\ngo out with a group of friends and come away with laughter, lessons and\nthe hunt for the Black Badger alone will have you asking \"Did you see\nthat Twist coming?\"<br><br>Rock On...\n"},
{"review": "\nThose were her words after the movie. All you really need to know is,\nmy wife and son laughed hysterically often, and I laughed a lot more\nthan I expected to. It's fun, silly and a great time out at the\ntheater. That's it... all you absolutely need to know about the movie.<br><br>(But, I'll add more anyway!) This is not a dark, gritty look into\nAmerican Intelligence Agencies. It's not a somber tale of relationships\nor unrealized potential. It's a wacky, unrealistic, action packed, fun\nfilled COMEDY! And, again, as my wife said, \"If someone doesn't love\nthis movie, I don't want to know them!\" I think that means she gives it\na lot of stars!\n"},
{"review": "\nI know Kevin Hart is a funny guy. We all know The Rock is awesome. This\nmovie just isn't as good or funny as it should be. Maybe it is the\nwriting, maybe it is the directing; I don't know. All I know is if The\nRock or Kevin Hart were not in the movie, it would panned by all the\ncritics and fans. I almost feel bad for The Rock because you see him\ngiving 100% but not even his 100% can help a flat script. The idea\nbehind the movie is great. The idea behind the characters is great. But\nthe execution of the movie just fails. Don't get me wrong, the movie is\nfunny but not as funny as it should be. Kevin Hart and The Rock have to\ndo all the heavy lifting and it is a sad because this could have been\none of those classic comedies you would go back and watch over and over\nagain. Oh, and let us talk about that ending. That ending pretty much\nconfirms that the writing/script kills the movie. I just now took the\ntime to use IMDb to see who wrote this and yeah, go check for yourself.\nIt was the writers who turned this into a C- kind of movie. What a\nshame.\n"},
{"review": "\nThe millions......and millions of the peoples champion will flock to\nsee this film as the trailblazing eyebrow raising never takes a fall\nevan when working with kevin hart who is small, comes to the big\nscreen. This is one of those films that just works you cant explain why\nbut you know it works, central intelligence has a easy to follow script\nand story with some great comedy. Kevin hart is his usual role as the\nbumberling underdog and the rock who plays a CIA agent, the chemistry\nbetween the two works really well which you see clearly through out the\nfilm. Plenty of action, simple story, enjoyable characters and overall\ncentral intelligence works from start to finish.\n"},
{"review": "\nCentral Intelligence was hilarious. Sione Kelepi delivered a\nquintessential high school bullying victim who returns as Dwayne\nJohnson's portrayal of a super agent. Kevin Hart played the burnt out\nall star whose workplace nemesis is Ryan Hansen's character. Danielle\nNicolet's role as a supportive yet uncertain wife pit Dwayne and Kevin\nagainst each other for one of the movie's funniest scenes. These two\nfinally joined forces and faced their grownup high school bully, Jason\nBateman, while defeating a crime syndicate. Rawson Marshall Thurber,\nthe movie's director, captured the comedic chemistry among this cast\nwhile employing very basic cinematography.\n"},
{"review": "\nThis movie was easily one of the funniest movies I have seen in quite a\nwhile. The plot is focused around Calvin, an accountant who was very\nsuccessful now a failure and Bob (formally Robert) who was a failure in\nhigh school now ex-member of the CIA. Bob eventually gets Calvin to\nhelp him find encryption codes that have been stolen. The plot to this\nmovie, well, was not memorable. Why did I give it 10 stars then? I was\nnot expecting a good plot. I was expecting comedy and fun and action,\nalthough not too much as that would ruin the comedic atmosphere and\nthis movie performed. Kevin Hart's performance was outstanding in this\nfilm and I would definitely be interested in watching more of the work\nhe is in. Dwayne Johnson in this film is awesome and I personally think\nthat he should be in more of these types of films; funny action movies.\nWould recommend it for anyone wanting a good time.\n"},
{"review": "\nHysterical! Laughed so hard I cried! My sides hurt at the end! The Rock\nand his self- deprecating humor are a hit once again! Didn't even know\nthis was out. Never saw a preview of it. But I like the Rock so\u0085 why\nnot?! See it - you won't regret it! Hysterical! Laughed so hard I\ncried! My sides hurt at the end! The Rock and his self- deprecating\nhumor are a hit once again! Didn't even know this was out. Never saw a\npreview of it. But I like the Rock so\u0085 why not?! See it - you won't\nregret it! Hysterical! Laughed so hard I cried! My sides hurt at the\nend! The Rock and his self- deprecating humor are a hit once again!\nDidn't even know this was out. Never saw a preview of it. But I like\nthe Rock so\u0085 why not?! See it - you won't regret it!\n"},
{"review": "\nI give this 2 stars because of a great concept and story line. It was\nrated pg 13 and the trailer looked hilarious and exciting. Checked the\nMPAA info and looked like something my teen girls could handle. <br><br>The fat-suit butt was a little crass for my tastes, but we finally had\nto get up and leave half way in because of the crotch shots, porn\nreferences, and way to many sh**'s to count and more F***'s than I\nthought were allowed in a PG-13. I can't submit a parents guide, but\nfrom the half of the movie we endured. I can tell you that this is not\nappropriate for teens. I have never walked out of a movie before. <br><br>Could have been great... SMH\n"},
{"review": "\nI'm a Johnson &amp; Hart fan but this movie lacks chemistry as oppose to\nHart &amp; Ice Cube. Johnson's character was poorly written and it was\nevident in the movie that the Rock was struggling to produce a natural\ncomedic performance. Spoilers: the movie wanted to do a twist in\nJohnson's character by having him portray to be good and bad which\nreally makes it weird how near the end, Johnson gave a smirk after\nturning away from Hart as he enters the underground parking. Bateman's\ncharacter, Trevor, felt weird and out of place as an adult. I just feel\nthat the script was poorly written and the movie kind of reminds me of\nAdam Sandler's Do Over but with better writing and performances. I want\nto give it 3.5 but round up to 4/10\n"},
{"review": "\nAs if there's not a high school geek in the world he does not want to\ngrow up to become the most electrifying man in showbiz, Dwayne Johnson\nplays a CIA agent still effected by the kids who bullied him twenty\nyears ago. It was hard to believe that someone like The Rock is a die\nhard fan of unicorns and the 80s movie Sixteen Candles, but Johnson\nonly proves his talents.<br><br>It was more surprising how Johnson carried this film on his very big\nshoulders being the screwball side of this comedic duo. Most\nimportantly, we do get to see the Rock kick ass and take names (while\nwearing a fanny pack, but...) He's action, He's comedy, And I can\ndefinitely smell what he's cooking. <br><br>And if the Rock is not enough for you, Kevin Hart is in it too. One of\nthe funnest men in movies today. Though I must admit, Kevin Hart is not\nat his funniest being Johnson's straight man, and I could have used a\nfew more direct laughs from his side of the table, but the two men are\na real dynamic duo on the big screen. <br><br>Central Intelligence is a good time at the movies.\n"},
{"review": "\nI was invited to see this movie last minute, unprepared for what it was\nabout or anything. After watching it, I was really thankful that I\ndidn't personally pay to see it.<br><br>The movie tried super hard to be funny, but it felt really forced.\nMajority of the scenes weren't funny, and they just seemed to happen\nfor no explainable reason (The plot is really weak). <br><br>The acting was above average, but not particularly great. I would put\nthis down to the fact that there was no real story line, this movie\nfelt like it was all over the place.<br><br>I found myself rather bored throughout a lot of the movie, and ended up\nscrolling through Facebook to pass the time. <br><br>I really would recommend saving your money, definitely not worth the\ntime or money.\n"},
{"review": "\nVideo Review link is at the bottom. I am not the best typer so I would\nrecommend going to the video instead. <br><br>Central Intelligence is a buddy cop film starring Kevin Hart and Dwayne\nJohnson. They both have exceedingly good chemistry in the film with\nKevin being this guy who you can relate to after high school and Dwayne\nplaying a socially awkward CIA agent. Both these two come together to\ntake down a huge deal involving multiple countries. Although their\nchemistry is strong at first it begins to get awkward at times even for\nthe audience and they can make you stray away from enjoying the movie.\nSome of their scenes feel forced and sometimes the movie can obsess too\nmuch into the spy stuff going on. In other words, most of the movie is\ngood, and most of their relationship is great. Just be wary of the\nflaws the movie has. <br><br>Video Review link is right here. Has more info and I'm better speaker\nthen typer. <br><br>https://www.youtube.com/watch?v=QLFOJnACVlo<br><br>Will be out at 3 pm on June 18th because it is a scheduled Release on\nYoutube\n"},
{"review": "\nThis movie Central Intelligence is a hilarious action comedy. This\nmovie mixes humor with action at the same time, and Kevin Hart and\nDwayne Johnson are a great pair together as their acting is\noutstanding. I read the reviews and noticed that the critics judged the\nmovie by saying it was a typical buddy cop comedy movie such as \"21,22\nJump Street, but they are wrong because the plot is very easy to\nunderstand and it stands out of 21 Jump Street or any other buddy cop\nmovie. This film has a message to it which is about bullying. Bob Stone\nback in the day was known as Robbie Werdicht and was bullied and thrown\nout naked onto the gym. While Calvin \"The Golden Jett\" Joyner was the\nall star of the whole school and was very popular. Calvin helps Robbie\nby giving him is Letterman jacket, so Robbie could walk out of the gym\ncovering his private part, while the whole gym just laughed at Robbie.\n20 years later Bob shows up to his high school reunion looking tough\nand it shows that people can change as Bob did. Bob stands on the stage\nall proud and shows that even if I was bullied I am a changed man now.\nI think that many people should watch this movie because it has a great\nmessage to it. The one thing that could've been better about the film\nis the plot, but overall great film!\n"},
{"review": "\nSorry, but way too many swear words and sexual innuendo for a PG-13\nmovie. The opening scene which exposes a rear-end is funny and I really\ndidn't have a problem with it. But all the references to intercourse,\noral sex, etc. were really too much and took away from what would be a\ngreat movie. If my 13 year old and I have to look at each other 5-6\ntimes during a movie with angst, then it's too much. I would let a\n15-16 year old see this but not a 13YO. The movie was really funny and\nwould have been an 8* if it wasn't for the overkill, silly/sex\ndialogues. I thought the plot was good and kept you guessing until the\nend and there were plenty of funny moments--just too gratuitous with\nthe \"bad stuff.\"\n"},
{"review": "\nNot being a Kevin Hart fan, I did not expect to laugh as hard as I did\nwatching Central Intelligence, because I had my expectations so low to\nbegin with. Almost everything in this buddy action comedy hits the\nright notes- the execution of the plot, the chemistry between the cast,\nthe performances of the cast themselves(The Rock was the bomb!), the\nexecution of the humor, the charming anti-bullying message(wasn't\ncringe-worthy like other movies), the film's goofy self-awareness, the\ncreative action sequences and most of all, the way the two main\ncharacters interact. What makes this movie genuinely funny is the\nentertainment Dwayne Johnson and Kevin Hart provide with their energy\nwhile improvising(Hart's at his best with his stand-up, here) their\njokes- the whole audience was laughing heartily and loudly throughout\nthe movie mainly because of this reason. It sounds like I'm going too\nfair on this movie because people aren't raving on and on about it- but\nfor how hard I laughed during this movie, I'll shift my rating to a 9,\nas such an accomplishment deserves such a rating, especially for this\nnon-Hart fan.\n"},
{"review": "\nOK, it wasn't utterly terrible but it's by far the Rock's worst outing\nwhich disappointed me quite a bit since I\"m a fan and tuned in\nspecifically to see him in action. <br><br>Contrasting that, Kevin Hart, someone who never moved my needle any,\ntruly showed quite a bit of good stuff. I think it's fair to say he\nsaved the show. He showed a good deal of range without the 'feets do\nyour stuff' eye rolling I was half expecting. <br><br>Rock's character just isn't believable or likable. He varies from\nwheedling to bullying to whatever. The plot is supposed to have a bit\nof tension about who the bad guy is and toward the end throws Jesse\nPinkman in as Jesse Pinkman for those Breaking Bad fans everywhere. <br><br>The ending left, to say the least, a very bad taste. It pure\nembarrassment amped up ten times. There were any number of dignified\nways to wrap this one up but the director choose the least appealing.\nAppealing? It was appalling. <br><br>A minor diversion made at least somewhat worthwhile due to Hart's\ncharacter. Else, nothing much and surely NOT a place for a Rock fan.\n"}
]