[
{"review": "\nThis movie was awful. As a comic book fan I felt like Josh Trank just\nslapped me in the face by using so very little of the actual comics. He\nbasically used the name of a comic I love to get me to see it and then\ngave me a different movie. The casting was awful (none of the\ncharacters matched their comic counter part. They were all too young so\nof course Reed Richards didn't have gray streaks, who thought it would\nbe a good idea to make a tiny guy the Thing?, and was it really\nnecessary to make the Storm family have a \"modern home\"? That's more of\na story that would fit in the X-Men), the origins dragged on for too\nlong, and their origin wasn't even the same! The Fantastic 4 is\nsupposed to be all about space travel not going to other dimensions.\nThat's Dr. Strange's territory. I walked out of this garbage and got my\nmoney back.\n"},
{"review": "\nTerrible movie as previous reviewer writes the pacing is all wrong the\ncharacters are bleh you don't feel any attachment to them with them\ncreating no chemistry.The middle section of the movie is drawn out\nwhile the climax feels rushed like the director went gosh where running\nout of time quick rap it up. After the recent awesome avenger movies\nand the Thors this felt like some hacked together 1990s offering.The\nstory has so many gaps in it with supposedly super smart scientist\ndoing super stupid things and Miles Teller playing Mr Fantastic is just\na terrible choice he has no screen presence as a leader. Wait for DVD\nor what ever and let it go quietly in to the past .\n"},
{"review": "\nJust because it's based on Marvel comics doesn't mean it's made by\nMarvel Studios. It's made by FOX, which licensed the rights to the FF\ncharacters from Marvel years ago. Thus, any comparisons to other MCU\nfilms such as the recent Ant-Man are totally meaningless. And that is\nwhy it's such a mess. Marvel had no control over what FOX did with\ntheir source material.<br><br>For those not aware, this film was plagued by problems from the start.\nThe director was all but banned from the set and editing room in the\nfinal stage of production, after which a good deal of the footage was\ndumped and re-shot. In the end, it was slapped together by one of the\nproducers and a temporary director, and the results show: there is a\ndisconnect between the first two acts and the third. It's almost like\nthere are two separate movies trying to co-exist, and it doesn't work.\n"},
{"review": "\nSorry but this movie misses the mark big time. Compared to the 2005\nMovie which was perfect, this one is just really bad.<br><br>The story is OK but not executed well. The characters are not as\nportrayed in Marvel. Michael B. Jordan as Johnny Storm, why? Political\ncorrectness gone mad. Johnny Storm was not a black man.<br><br>Kate Mara compared to Jessica Alba? Well there is no comparison really.\nAnd Ben Grimm is really just some overdone cgi, nothing compared to\nMichael Chiklis brilliant portrayal in the earlier movies.<br><br>The biggest question about this movie for me is why? Why was it made\nwhen the 2005 version got it so right?\n"},
{"review": "\nI began watching this movie with great anticipation, however, it really\nfailed me within twenty minutes of it.<br><br>I still continued to watch it and thought that the movie would get\nkicked off now but the now never came.<br><br>The worst thing is that the invisible girl got her powers without going\nto space and that is so stupid because all my life I have been brought\nup seeing the girl in space and getting power, not outside of it.<br><br>More than an hour into movie and there is no action. The villain\nappears in the last thirty minutes, the fight lasts of 10 minutes and\nthe movie is over.<br><br>Really a waste of time and money.\n"},
{"review": "\nI'll be concise: this FANTASTIC FOUR reboot is a waste of your time. It\nis not a bad film, so much as a pointless one. The acting is adequate.\nThe script is terrible. There is not a trace of wit or reality to any\nof the dialogue. Characterisation is two-dimensional at best. The\neffects are, in comparison to other films of this type, poor. There is\na story, but no plot. The final 'showdown' with Dr Doom takes place in\nthe last 5 minutes. To describe it as perfunctory is to be kind. Only\nsee this film if you have an 'unlimited' cinema pass for one of the\nchains - please don't spend money on it. At the special Cineworld\npreview, everyone sat through the credits waiting for an extra scene.\nNope, nothing. \"That was a load of sh*t!\" exclaimed someone in the\nsuddenly silent auditorium. Oh yes.\n"},
{"review": "\nFox, give the rights back to Marvel, and lets pretend this movie just\nnever happened.<br><br>- Bad script<br><br>- Bad acting<br><br>- Bad characterization <br><br>- Bad Doctor Doom<br><br>- Bad action<br><br>- Bad effects<br><br>- Badly boring<br><br>- Bad Fox Studios<br><br>This movie sucked so bad that I didn't even bother finishing it. Give\nme a break Fox, you can do better and we deserve it, because this makes\ntwo failed attempts now, and a third would just make the F4's chances\nof ever getting a good movie even worse. Give the rights back to\nMarvel. <br><br>Yours sincerely <br><br>A person with a brain and eyes\n"},
{"review": "\nI would like to start by saying no. Just no. Oh my gods No! Josh Trank,\nI assume your name is short for 'Tranquilizer', yes? I cannot think of\na single thing that can save this film. Kate Mara, you are gorgeous and\na wonderful actress and I admire your work and, most importantly, I\nhope this willfully awful thing has not destroyed your career.<br><br>So: Script = No. Direction = No. Characters = No (which is odd, because\nthe Fantastic Four are great characters, and yet you have managed to\nget a 'no' with them. Remarkable!). Miles Teller = No. Josh Trank = No.\nEven for cereal commercials, no.<br><br>Recast the original Fantastic 4 movie and reboot THAT. What you have\ndone is bad. I'm stunned. This was worse than Batman &amp; Superman vs\nStorytelling, and you can read my review on that travesty on IMDb to\nlearn just how badly you have done!\n"},
{"review": "\nWhat the hell did I just watch? What a slap in the face to Stan Lee and\nall the comic fans around the world!<br><br>This movie has nothing to do with the actual fantastic four. Instead\nit's some awful movie about a group of super intelligent multicultural\nteenage orphans who travel to another dimension. Later these teen\norphans battle against their friend after he becomes an emo who wants\nto blow up the earth. If that sounds vaguely interesting, its not. I\nfell asleep 5 times while watching it!<br><br>The people involved in making this movie f***** up. If you're going to\nbutcher the source material and alienate the original fans, at least\nmake it a good film.<br><br>Battlefield Earth was a better film than this.\n"},
{"review": "\nThis movie was just beyond awful. I was sad that the original cast was\nnot going to play in it and did not tend to see it but i was dragged.\nThe actors were good and the costume but the story base was horrific. I\nlove marvel and I knew marvel did not make this movie but Fox did.\nThere was only action in the last 15 minutes other than that nothing.\nIt was not amusing or better as the first one in any type of way. I\ndidn't blame Stan Lee for declining to being in the movie and he is\nalways in one of his movies. The writer was so disrespectful to the\ncast members and others who help make the movie. He should not write\nanother movie and they should not reboot Fantastic Four again. I am\nsorry to say this but Fantastic Four is dead and if they are making a\nnew movie they would have to make a huge comeback from this.\n"},
{"review": "\nSo I was contemplating if I should watch this a few months ago and I\nsaid no. The fantastic 4 looks like high school kids... WTH is this! It\nalready looks horrible. <br><br>I came home from work today and wanted to watch a movie. There was\nnothing on so I decided eh fantastic 4. There's nothing else to watch,\nhow bad can this be... <br><br>I just wasted 2 hours of my life I can't get back..... very\ndisappointed.... I have never wrote a review on IMDb before, but this\nmovie just did it for me. The 2005 movie was 10 times better than this,\nwhy would you ruin fantastic four..\n"},
{"review": "\nI am not telling Anny spoilers here. I just saw this disaster of a\nmovie on TV my god am i glad that i didn't pay money tho see this in\nthe cinema. I mean nothing happens in this movie nothing at all. How\ncan so many talented people make such a abomination. I can't believe\nthis is from the same director of chronicle. That was a great found\nfootage film. And i am just going to say it Johnny should be played by\na white actor. Now all you people who think i am a racist here is an\nexample. The new blade movie is coming out and blade will now be played\nby Gerald butler bow would you feel about that? It would suck. That is\nmy opinion\n"},
{"review": "\nOne of the top 10 worse films of the year. Certain films, I find myself\nasking, why was this made? What was supposed to be the point of making\nthis movie?<br><br>Even though I read a few of the negative reviews, I decided to watch\nwith an open mind. Unfortunately it feel short in almost every aspect.\nFirst the casting for this movie seemed to be way off. The characters\ndidn't really seem to fit their roles. I'm no expert on the F4 universe\nbut as a movie the characters didn't work. The events/pace in the movie\ndidn't work. It was rushed when it should have explored and slow when\nit should have been fast. Genius was common place. Anything that needed\nto be accomplished was just sorted in a few giggly moments between the\nactors. It gave no validity to the movie.<br><br>There's so many issues with this movie, but down to its core, it just\ndoesn't work. If you're curious, wait for it to be provided on a\nstreaming service to attempt a watch.\n"},
{"review": "\nI'm going to cut right to the point... The first portion of the movie\nis extremely slow and nothing happens. They get to this other dimension\nand all hell breaks loose and the four mc's get powers. When they cut\nto one year later, it looks like it could have been five years later,\nso it made no sense that so much could have changed in the time span of\nONE year. It becomes utterly, depressingly and horrifically dark from\nthere as Doom who they thought died comes back and kills a bunch of\npeople. The ending and battle with Doom was so rushed, it felt like the\ndirector forgot he couldn't make the movie three hours long. While the\noriginal movies weren't very good either, at least they were a little\nfun to watch. This one was lackluster in every sense, and much too\ndark.\n"},
{"review": "\nIf that black/Negro kid is in this movie, then you've instantly ruined\nit. I have absolutely no desire and no interest in watching one more\nSuperhero movie get ruined by the overwhelmingly offensive integration\nof a Black/Negro person into a legendary role that firmly belongs to a\nWhite man.<br><br>Please Stop subjecting America to these evil people. You're increasing\nthe hatred.<br><br>It was difficult in watching the previous Fantastic Four films. The\n\"Thing\" was just too short and half the team were foreigners. <br><br>Probably the German element in my blood talking here, but \"I\" am the\ncustomer and I only want to see my kind around me. English/Scottish and\nGerman, the original founders of this great country. <br><br>The others can make a movie of their own. They did this for the Wizard\nof Oz, didn't they?\n"},
{"review": "\nIt could be called \"Teen Not Fantastic Four\". Unconvincing pseudo-\nscience, uncharismatic actors, boring story... In my opinion, the CGI-\nmade Thing is the worst in all live action \"Fantastic 4\" movies (he\nlooks like an ent from Tolkien's Middle Earth), including the first\none, from the 90's, which is always considered (exaggeratedly) as one\nof the worst superhero movies ever made. Indeed, if you wanna know, in\nspite of its much higher budget, this movie is worse than that one,\nwhich has been made with no real intention to be released. It was also\nridiculous to put Susan Storm as a Kosovar adopted girl just to justify\nthat she is the sister of a black Johnny Storm. Besides that, is it\nserious that nobody talked about Victor Von Doom since the accident\nuntil he reappeared?!\n"},
{"review": "\nThe acting was fine, costumes good, but the story plot was laborious\nand horribly drawn out.. not to mention, just plain boring.<br><br>Not worth writing more about it, it was truly a painful watch. It's\nbest to multi-task while watching this movie.. IF you really have to\nwatch it.<br><br>Damn 10 line limit. Anyway, the characterisation was quite annoying.\nThe corporates are so clichéd in their typical greed and stupidity.<br><br>I like Marvel stories, but this was a reboot that was avoidable. It was\nreeking of plot holes BTW..<br><br>/spoiler Taking the chimp out of the pod, without any quarantine, but\ngoing all suited up otherwise. Sigh. The overall jealously of Doom over\nSue and Reed. Come on.\n"},
{"review": "\nLook guys it's my first time I'm reviewing a movie so I won't say a\nlot. Although the good SFX and the optic effects this movie for a hero\nfan is a complete trash. It completely destroys the origin story of the\nfantastic four by making them travel to another dimension and not even\nall of them. Also Dr. Doom has completely different superpowers e.g.\nwhere is the lightning??? Moreover we see that the heroes can't handle\ntheir powers in a point than johnny is permanently on fire and Suzann\ninvisible and that they need special suits to control their powers.\nAnyway there are a lot of mistakes and I wish I hadn't spent 90'\nminutes of my life to watch this movie the previous movies where far\nmore better.\n"},
{"review": "\nThe \"original\" Fantastic Four movie was far from \"fantastic\", this,\nhowever is just plain awful. It seems like the Marvel grindhouse has\nmore than ran out of ideas but is content to destroy any of the\nreasonable efforts that went before.<br><br>While these endless rehashes seem to draw numbers at the box office for\nnow, in the long run all Marvel succeed in doing is tiring an audience\nbegging for something good. This is not it. Neither was \"Amazing\"\nspiderman (1 or 2), nor Age of Ultron, The Dark World or any of the\nother recent efforts.<br><br>Give up now. Before you alienate an entire generation who are already\nbored with these tawdry, lame excuses for entertainment. Either that or\nproduce something worth watching.<br><br>That will be all.\n"},
{"review": "\nThis movie definitely had a creative edge to it in the beginning, it\nlooses steam quickly. They introduced the main four characters fairly\nwell, but left far too much to be desired about it's villain. The\npacing of the movie is all over the place, it felt like a full hour\ninto the movie before we seen any character with power. The lines and\nwriting in the movie was very groan inducing, I couldn't believe some\nof the cheesy quips the characters had. The build up for the end comes\nout of nowhere. While the final confrontation was easily the best part\nof the movie, it took way too long to see the characters use their\npowers, and it was rushed, the best part lasted what seemed like only 5\nminutes. The movie itself feels like standing in line for a roller\ncoaster that was only 20ft long. It's not worth your time, nor are you\nmissing anything if you decide not to see it. Given a better writer and\nDirector, it could've been great.\n"},
{"review": "\nMy English is more than what I have to say but see the movie Fantastic\nFour I am filled with disgust and anger very low resolution, and\nhistory too tedious and very embarrassing , and reviewing critical for\nme is the \"second worst movie of year \" , with 2.6 points after the\nsequel of the super cop with 2.1 points , and I thought to be the\ncourse \" event of the Year \" for me is a wake and me are all dead ,\ncomparing to other disasters superhero , \" Elektra \" with 3.1 points ,\n\" Dardevil \" with 4.6 , \"Green Lantern\" with 4 points \"Batman and\nRobin\" with 2,5 and \"Ghost Rider\" with the first 3.8 and the second\nwith 3 points it became clear that this it is the worst movie of\nsuperheroes that I have seen in my life , also for Marvel Studios\nDisney wants to stay with the rights of Fox took over , and for me that\ndo not make a sequel to believe that is another disaster does not more\nor worse and I say no , and no is no , and as they say in my country\nnow , IT HAS EARNED DAMN!.\n"},
{"review": "\nI used to read all the fantastic four comics, the trip to space and the\ncosmic rays which made the fantastic four. Susan storm who's brother to\nJohnny, however in the film she has a step brother who's black I ain't\nracist it's the fact they changed the story lines to the remake, also\nthey changed the storyline again to when they get there powers from the\nspace trip to teleporting to another planet. This is such a boring\nstoryline. Again..: they changed it Dr. dooms powers in this film it\nshows him to be 20x power powerful with GREEN glowing telekinesis, his\npowers is to manipulate electric with his armour which he doesn't have.\nThe story in this film is so tedious. When Stan Lee doesn't make a\ncameo you know it's really bad.\n"},
{"review": "\nI usually do not write reviews, but I feel like I had to four this one.\n(Pun)<br><br>Anyway, I will start off by saying this movie was not Fantastic, let\nalone anything near that. It has NOTHING to do with the originals, nor\nthe comics. To be honest, I have no idea what I was even watching. Why\nwould they waste half the movie just to show us how they built the\nmachine. They wasted another 1/4 of the movie showing how they had\nbecome lab rats, and the last 10 min was a fight scene that made zero\nconnection to my love for the comic. I would rather watch ANY of the\nother fantastic four movies over this any day. I do NOT suggest anyone\nwaste their HARD EARNED money on this waste of time, half made, junk\nsized, piece of crap. <br><br>Please feel free to down vote this and mark as spam and spend your\nmoney and anything else. Just here to say that this movie sucked worse\nthan the final episode of clannad after story.\n"},
{"review": "\nThe worst movie ever, everything sucks i don't understand why they made\nup a story, the are already a lot of story's in the comics, and the\nworst part is that Johnny storm is black I cant believe they use a\nmonkey to play that character at least you could make sue black as well\nto make some sense but no, and they get their powers being drunk ¿?\nwhat the hell I mean reed Richards was a serious man a scientist and\nthey used an actor way too young for that character. I strongly don't\nrecommend you this movie, make yourself a favor and just don't watch it\notherwise you are just going to waste your time as i did when i watch\nit and when i right this review.\n"},
{"review": "\nOnce again Fake Crap Hollywood makes a movie with ZERO substance and no\nfeeling. Hope they loose a lot of money on this project. WHAT is so\nfantastic about this movie, seriously?? When they wrote the script,\nwere they drunk or on some drugs??<br><br>Since it's all about story telling, I ask myself: \"WHAT WERE THEY\nTELLING?\" Well, The American government is all about turning everything\nto weapons... Weaponise EVERYTHING and basically kill everybody on the\nplanet, no matter who. Second: it only takes ONE person to destroy the\nplanet - so no need for protection because we have more than psycho\nhere...<br><br>No loving of the characters, actors themselves lacked acting skills\n(Well, Dr. Storm, the father was okay though, some feeling in his\nvoice), no depth... nothing good at all - not even the CGI.<br><br>Only good part was the very ending that informed how many job\nopportunities the movie created...\n"},
{"review": "\nAlthough I am not a devout follower of all things Marvel, I will say\nthat this version of F4 makes no sense in that it is a completely new\nstory and has nothing to do with the move 10 years ago and from what I\nunderstand is not from the original writings of the characters. This\nmovie wants to be a biopic simply to leave room for yet more sequels,\nhowever, I don't think the producers will move forward.<br><br>Only because more is required to post...I will say that the movie\nattempts to prop up individuals with real problems such as broken homes\nand dysfunctional relationships. The movie does not surprise in any way\nbecause it is so predictable. A bunch of geniuses and outcast have a\ngreat idea and the DOD wants to take it over. How original!\n"},
{"review": "\nIf your a Marvel fan as I am you will be thoroughly be disappointed by\nthis total failure at a reboot of the Fantastic 4.<br><br>Boring drawn out with a slight after thought of action at the end! Stan\nLee how the heck did this butchery of the original comic Fantastic 4\nget past you?? The story was weak and completely unlike How you guys at\nMarvel wrote and illustrated it originally. Dr. Doom (when he finally\nbecame Dr. Doom) came and went out in less that 20 minutes.<br><br>The first two were much better and truer to the original comics. Sad\nattempt at re-writing that which is already set - Big failure!!<br><br>Save your money!\n"},
{"review": "\nSo , so , so disappointed. When you grow up on this stuff. Meaning you\npurchased every comic book that came out. Read them and lived them as a\nchild. You have them memorized from front to back. Then someone takes\nand changes sacred parts of it, you want to slap that person and ask\nthem who the F they think they are........... You don't dissolve the\nbrother sister relationship. That was just wrong. You don't change a\nrace of a person for any reason. That was just wrong. I watched it and\njust kept asking myself WTF. Why would someone do that to these\ncharacters and all those still alive to know the difference. Tragic is\nall that comes to mind. The last one was so much better they could have\nre-released it and everyone would have been happy.......movie is a\nserious rip-off. It was like having a hunter kill Rudolph the Red nosed\nReindeer before he could guide Santa's sleigh. Just shouldn't have been\ndone.......\n"},
{"review": "\nThis is how you take a perfect story and ruin it. Kind like they did\nwith the First \"hulk\" movie. Why change a story that already Works? I\nhave read some FF4 comic in the past, and i never recall that Johnny\nwere Black? As we have seen lately, it seams that for every\n\"Reboot/Remake\" of Marvel hero's, they just getting worse. The only\ngood thing about this movie, is that it only 100 minutes long, even\nthat it feels longer. This movie are no doubt the most boring superhero\nmovie I have seen for a long time. Even Hulk from 2003 is better than\nthis \"Fantastic\" movie. Maybe Movie studio's should stop making new\nbeginning all the time from \"Reboot/Remake\" and just going forward with\nthe stories. We already knows how the superhero's got their power from\nprevious movies, we don't need to get it shown for every new \"Reboot or\nRemake\".\n"},
{"review": "\nI was never hyped for this movie. As soon as I knew they were gonna\ncast some kids I knew this wasn't something I wanted to watch. But\nsince everyone was talking about how bad it was, I did check it out and\nit was way worse than I thought. I thought the movie had a good first\n20 minutes building up but after than it was a total train wreck. The\nmovie had one of the worst CGI I have seen in modern movies and felt\nlike I watched around a half of the movie. It was like they were\nintroducing the characters for about 90 minutes of the movie and boom\nout of nowhere we are in the final battle of the movie. It was a total\nincomplete movie and had a bad storyline filled with a bad cast and\neven worse CGI.\n"},
{"review": "\nSo this is the new Fantastic Four???<br><br>I watch a lot of movies in the cinema and I am a big fan of Marvel and\nall superheroes. The old Fantastic Four was really great. Good actors,\ngood story, humor, action and romance. It gave you good emotions. But\nthis new Fanstastic Four??? I have no idea what they where thinking\nwhen they produced this? I even wonder if they watched it themselves\nbefore putting it in the cinema? It is one of the worst movies I ever\nsaw in my life. Chooise of actors 1/10. The story... does not follow\nthe original script and they made very stupid changes 1/10. Effects\n2/10. Action 2/10. Humor 0/10. Romance 0/10. Emotions after movie? I\ncould not even finish it. That is how bad this is. I don't even know\nhow IMDb can have a total score of 4 from 10? I bet that the movie\ncompany paid for a lot of these votes to get it up so high.<br><br>My advise is to avoid this movie. Forget that it exist and don't waste\nyour time and money on it. If you want Fantastic Four... then buy the\nold movies on DVD.\n"},
{"review": "\nThe movie was not that bad although the original movies were far better\nas plot goes and they had a better cast but the most important thing is\nfox keep rebooting franchises while there have been just a few years\nthe first fantastic four movies were released.<br><br>what they were thinking ?<br><br>Instead of giving us a new sequel with the original cast they rebooted\na franchise no one wanted to see rebooting in such a quick time.<br><br>Although the first two films were nothing special they were at least\nfun to watch and this reboot offered nothing new.<br><br>to watch how these people got their powers again and again is a silly\nand foolish thing to present.<br><br>I TELL U WHAT FOX<br><br>In 2 years please make another fantastic four reboot and then u will\nsee even lower box office gross but if u instead make a good true\nsequel with the original cast then u may save the franchise.<br><br>people want to see sequels // prequels and not useless reboots\nespecially after a few years of releasing the original movies.\n"},
{"review": "\nThis movie has the unholy trinity of elements that make for a really\nbad movie. Bad acting, bad story and bad visual affects. Josh Trank, no\nmore movies from you....please! To submit my review I have to type at\nleast ten lines but it doesn't take ten lines to express my opinion on\nhow bad this movie really was. I mean really, I can sum up this movie\nin two words,\"Fantastic Snore\" because I found myself starting to nod\noff half way into this movie forcing myself to shove unnecessary\namounts popcorn into my face just to stay awake, but at least picking\nthe popcorn kernels out of my teeth kept me amused throughout the\nsecond half. The first fantastic four left me feeling like I misplaced\na $20.00 bill but this piece of garbage left me feeling like I just got\nrobbed at gunpoint. Thanks a lot Hollywood, just when I think that you\nhave finally hit rock bottom, you come out with something like this.\nStop It!\n"},
{"review": "\n⭐️⭐️⭐️<br><br>There has been much talk the past year surrounding this movie. Mostly\nnegative it is sad to say with many rumors of a power struggle between\nDirector Josh Trank and Fox. It is more tragic that it has drained any\npositive hype which might have been prior. <br><br>When Reed Richards, Ben Grim, Johnny Storm and his adopted sister Sue\nStorm get hit with a blast of energy, they acquire special abilities\nand are taken in by the government and used in the military. <br><br>Fantastic Four is a decent movie which is let down by a disastrous\nfinal 15 minutes of shoddy editing. <br><br>The effects were fine for the most part but the editing leaves a lot to\nbe desired. <br><br>This franchise has potential and it is a joy to see something different\napproach to the comic book genre. It will be interesting to see if Fox\nchoose to push on with a sequel despite the obvious financial hit they\nwill take from this latest effort. Only time will tell.\n"},
{"review": "\nThis was actually a good movie. Nothing over the top just a good movie.\nPeople were too hard on this movie simply because its fantastic four. I\nwent into the movie theater with very low expectations. I mean come on,\nMiles Teller, the kid from whiplash, is Reed Richards?! But when it\nstarted, I was surprised. He filled the superhero roll better than i\nthought. The movie kept me entertained throughout and I didn't have a\nproblem being bored like what a lot of reviews said. Yes the ending is\na little rushed but it was still a good movie. Is this a movie as good\nas the avengers? No. Not even close. But it is still a fun watch and is\na good reboot. Ignore all the negative reviews, and see if you like\nthis movie. Watch it, I encourage you to.\n"},
{"review": "\nFant4stic is directed by Josh Trank. It stars Miles Teller, Kate Mara,\nMichael B. Jordan, Jamie Bell, and Toby Kebbell. This movie is about\nnothing. I'm being serious if you've seen the trailers you already saw\nthe \"movie\". This movie had so much bad buzz prior to release and near\nall of it is now proved true. <br><br>The script is absolute GARBAGE. Every single line is exposition and\nit's boring beyond belief. I sat alone in a theater in disbelief I saw\nit in it's second weekend and I'm still sick. The visual effects look\nunfinished and so obvious that it's distracting. <br><br>You can clearly see that nobody cares about this rights grab. If the\ncast and crew don't care about this movie why should I?<br><br>I gave this movie a ONE out of 10 and I wish I can give it a 0.\n"},
{"review": "\nChildish story, idiotic characters, even more idiotic situations.<br><br>No even thinking that is a superhero movie we can face the horrible,\nhorrible film we have here. You poke seeing X-Men 3? Prepare to have an\nstomach cleanup.<br><br>And beyond this horror circus, is the EVEN MORE MORONIC fact that Sue\nis still a black guy's sister. Could've worked if both were black, or\nif he was half black/half white.<br><br>But as is presented, is an insult not only to spectator's intelligence,\nbut Mendel Laws themselves.<br><br>\"Being politically correct\" at the cinema is killing this industry.<br><br>I asked for a refund, and half of the spectators were shouting behind\nme. On the premiere.<br><br>Take note.\n"},
{"review": "\nI have an unlimited cineworld card and I can watch any film anytime as\nmany times as I want for £16.40 a month. AND that's the reason why I\nwent to see this film; it was exclusive screening; so I went to see it\nbefore any reviews were available. Please do not waste your money if\nyou don't have an unlimited card. I mean really just don't waste your\nmoney. It is awful. Word's cannot describe how bad this film is. The\nacting is bad; the script is awful. Fair there is couple of comedy\nlines but apart from that there really isn't much. Visual effects are\nawful. It is just really bad. I think that the directors should be\nashamed of themselves for wasting our time and money for their greed.\nWhy bother with this crap film ?\n"},
{"review": "\nThe word rubbish was create for this movie. I can't believe I just\nwaste $10 for this trash.And you will be regret even you watch this\nmovie for free. You can know 90% of the story by watching the\ntrailer,and if you have brain, you can guess the rest 10%. The movie\nspend 50min to explain how the Fantastic four get their power,20min to\nshow what their power could do,25min to find the boss and 15min to\nfight with him.Thats all, they kill the boss with one punch.... Do not\nwatch this movie!!!! I'm not sure many time did fantastic four use\ntheir superpower in the movie, but I'm sure none of them has more than\n15times. 100min.And this 100min is my darkness time in my life.\n"},
{"review": "\nWinning an award makes me wonder how rigged that must have been\nconsidering that this movie is such a fail.<br><br>Considering the fact that this movie is made to keep the license and\nwithout any passion shows the contempt they have for the PAYING\nviewers.<br><br>Insulting.<br><br>My hope these guys take the hint for once and cancel the followups or\nmake a proper movie. <br><br>The last versions were not that great as well....<br><br>Looking forward the next Marvel movie with the Thanos stories.\n"},
{"review": "\nAs a supporter, i can tell- it's DD 2003 all over again. 138 minutes\nscrapped to 93 minutes? How can you expect more from this? I hated the\nhaters i wanted this to be great. but it's is simple as this, remember\n2003 version of DD? it was bad, but we know it was the studio which\nmade it worse by cutting down the movie for 30 minutes. it was nothing\nlike DD but the director's cut turned out to be epic with the real\nmovie from the director. <br><br>I gave it 3 but still gave it 5 only because of that amazing build up\ntill the first 40 minutes. then it's chaos and clichés and something we\ncan't express. <br><br>Doom was right, he knew Doom was coming. The funny part is Doom only\nsays the word \"Doom\" for once. <br><br>All i can say is this is not the movie they made. The Fantastic Four\n2015 is somewhere in an editing room scrapped into pieces, i want to\nsee that long version from Josh but like he said we may never see it.<br><br>Haters- surprised that it was way worse than you wanted it to be?\n"},
{"review": "\nBeing a comic book fan from the 90s, I noticed many dissimilarities\nfrom the classic origin story and this film. Which were fine, and more\nin tune with the times. It also made me feel like this was new and\npotentially exciting.<br><br>Unfortunately it never led anywhere. By the time they get their powers\nlittle of the film remains, and things after that feel rushed and lack\ncredibility. Reed Richards' character acts particularly odd, specially\nfor those used to the comics. Also, the villain's actions made very\nlittle sense to me, as well as his powers. Avoiding spoilers, at one\npoint he is apparently stranded, and the next minute he is basically\nomnipotent.<br><br>Sue was the nicest character for me, and much smarter than the comic\nbook version. Ben was alright, as was Johnny. Reed seemed off. Doom,\ndespite being miles away from the comic, was pretty interesting.<br><br>There's very little action in this film, and the final battle is rushed\nand uninteresting. Dialogue towards the end felt cliché and lame. I\nsort of regret having paid the full ticket price for this.\n"},
{"review": "\nI don't want to write a lengthy review but I felt I had to come and\nrate this movie as in my opinion it is underrated and hated without\nreal reason.<br><br>I gave 10 just to pull the negative rating a little bit up otherwise I\nwould have given 7 or 8.<br><br>The casting is great, all youngsters made great acting although I agree\nwith that the characters could have been introduced/developed a little\nmore detailed.<br><br>The current 4.3 rating is really not showing the real potential of this\nmovie.<br><br>I am a comics fan since my childhood, I was watching this movie with my\nwife and we both enjoyed it very much. Much better than the previous\nFantastic 4 movies...\n"},
{"review": "\nI'm always one to go and view films that I don't think I will\nparticularly like but this one was one of my least favourites. First of\nall, I feel the film was too short. I rarely say that about films but\nthis one could have quite easily gotten away with a further 30-40\nminutes when they could have actually allowed more time focusing on the\ncharacters after they had been to the other world. They could have\nfocused more on how the characters would have felt with the\nabnormalities they now had. Secondly, Doom, when he was actually the\nvillain, featured very little in the plot which I feel could have bee\nincorporated more into the plot. There was no real threat as he\ndefeated within minutes which wasn't quite what I expected to happen.\nYou barely got to know Doom, even before he got trapped on the other\nplanet which could have been included more in the plot. All you see of\nhim is that he gets a bit jealous and has a thing for Susan.<br><br>It isn't a film I'd watch again but it did have many good elements to\nit as well.\n"},
{"review": "\nUsually I am pretty forgiving of bad movies and I'll be the first to\nsay it wasn't so bad but I couldn't take it in this movie. I'll save\nyou time and money and warn you not to go. I liked the Star Wars\nprequels, the original Fantastic 4 movies, and Daredevil. Were they\namazing movies? No. But they were enjoyable. This was a bad movie\naltogether as wasn't even enjoyable. Plan 9 from Outer Space is an\n\"awful\" movie but it was quite entertaining. I'm not a comic fan but my\nboyfriend is and he was practically yelling at the screen because he\nsaid it was nothing like the comic. So it was a collaborative decision\nto leave. I seriously can't think of a worse movie I've ever seen. I'd\nrather watch a full days worth of the annoying show Mulaney than finish\nthis movie. Based off of how the movie was going I probably already\nknow the ending. . . Nothing happened. I also thought that Marvel\nmovies were supposed to be funny.\n"},
{"review": "\nA lot has already been said about this. This is an abomination of a\nsuperhero movie. A total waste of money. I contemplated walking out of\nthe cinema midway through the movie but decided to stay because it was\nhot outside anyway. The AC and the comfy chair was the only reason I\neven stayed.<br><br>As for the movie? Oh please. A black Johnny Storm? A stupid looking\nDoctor Doom? This is NOT the fantastic four. The actors had decent\nindividual acting but there was ZERO cohesiveness/connection between\nthe four of them.<br><br>PLEASE FOX, GIVE BACK YOUR RIGHTS TO MARVEL!\n"},
{"review": "\nWe can't even find the words to say just how poor this is. We're not\nsaying don't don't watch it, but don't say we didn't tell you so. When\nyou want those wasted 92 minutes back ... oops!<br><br>Terrible plot. We thought we'd missed a big chunk of storyline ...\nsadly we hadn't.<br><br>Dreadful characterization. We thought we'd missed some amazing acting\n... sadly we hadn't.<br><br>The start of something big ... perhaps the producers etc. are thinking\nof a sequel and producing massive ranges of merchandise in time for\nChristmas. Sadly they probably will.\n"},
{"review": "\nThis movie spends most of the time telling the story of how the\nsuperheroes lived before they got their powers. A story most already\nknows, and I was just waiting for them to get that part over with so\nthe real movie can begin. Unfortunately, by that time you will most\nlikely be asleep, and wont be able to enjoy the five minutes or so of\nsuperhero action at the end.<br><br>Maybe they didn't have the budget for special effects and instead\ndecided to fill most of the time with boring dialogs. Nevertheless,\nyou'd have more fun just picking up a comic book and read that instead.<br><br>Waste of your time, even if you're a fan of the comics like me.\n"},
{"review": "\nOver the last few years marvel have been rebooting films quicker than\nwe can blink which is either because they need to to keep the rights to\nthe film and are desperate or because they want to tie it in to there\nuniverse. Let's start with there recent ones the amazing spider man\nwhich first one was good but second one was as awful as Spider-Man 3\nwith venom. DC rebooted batman with Christopher Nolan and made one of\nthe best trilogy films you will find, DC showed marvel how to do it\ncorrectly so you would think with the fantastic four reboot it would be\nworth a watch.....WRONG AVOID AT ALL COST this reboot is embarrassing\nand makes no sense at all to the point DC are probably rolling around\nin there office laughing. From start to finish its just cringeworthy\nthere is nothing good or interesting about this film at all. If you\nwant to watch a proper reboot watch batman begins\n"},
{"review": "\nIt is the worst reboot of a movie series I've ever seen. It's an insult\nto the previous films of Fantastic Four. Those were awesome movies. I\ndon't understand, how this movie even got permission to use that\nawesome name. I was eagerly waiting to watch this movie. But was really\ndisappointed after watching it. As the previous \"Fantastic Four\" movies\nwere awesome, I had high expectations from this movie. Technology in\n2015 has developed much more than it was in 2005. But the 2005 version\nof F4 looks great than this. I had to watch that movie again to remove\nthe impression of this movie from mind. Hope it will get rebooted again\nand with better story,plot and animation like old ones.\n"},
{"review": "\nThis could possibly be one of the worst movies of 2015. It's poor\nreviews are completely justified and I would strongly advise giving\nthis film a wide berth. As far as origin movies go this would be the\nworst. There are barely any high points, in this show to keep viewers\ninterested. I would advise not blinking during the final moments of\nthis film as you would miss what is suppose to be the final battle\nbetween the four protagonists and antagonist. It's as if they were\nmaking a movie and realized they had run out of money. Not only are the\nfinal parts of the film cringe worthy but the dialouge that accompanies\nAre just as horrid. There are no redeeming factors for this movie and\nI'm sure that it will go down as one of the big flops of 2015.\n"},
{"review": "\nBefore I begin, I'm only giving this a vote of 1.0 out of 10 because I\ncan't pick 0.<br><br>This movie is terrible. The acting, the story, and the awkward use of\niconic characters is depressing. I know this has been said over and\nover, but why... seriously... why is Victor Von Doom, the single best\nvillain in the Marvel universe depicted as a weird emo hacker\nstereotype? It's the least inspired film I've ever seen which is\namazing considering I've actually watched the 1994 Chris Elliot film\n\"Cabin Boy\"who's hallucinogenic cupcakes was more creative than this\nturd blossom.<br><br>Please don't watch this movie.\n"},
{"review": "\nThis was so bad I don't know where to start. Why reboot the series\nanyway! They should have continued on from the first two movies using\nthe same actors if possible, if not at least the same age group! Why\nthe writers decided to reinvent the origins of the F4 is beyond me. And\nmaking the Storm siblings to be ethnic opposites, even implying Sue is\nadopted, was a sad and pathetic attempt by the writers to be\npolitically correct. Why not stick to the comic book version??? The\n2005 version and 2007 sequel are a far superior take on this popular\ncomic book. This version was so bad I couldn't even watch the rest.\nSave your money!\n"},
{"review": "\nSo Marvel sold its rights to Fox, and that was the biggest mistake that\nthey ever made. To be completely honest the only franchise that is\nstill doing well would be the X-Men franchise, I mean seriously just\ngive the rights back to Marvel. This film lacks focus and is a poor\nremake, the film went from a science nerd movie to a forced super hero\nfilm. It only has 20 mins of Fantastic Four and 1 and a half hour of\nnerdy geeky stuff that is a pain the ass to watch. This film has set a\nnew low for Fox as its previous attempts too failed to bring the\nfranchise back to its popularity. It is absolutely horrid and isn't\nworth your money if you are planning to watch it. Overall it was a\ncrappy film that I would most certainly scrap from film history.\n"},
{"review": "\nI think its one of the worst movies i've seen in a long time. The\nentire movie felt like a rushed and confusing story. The effects and\nstuff were alright, but would expect more from a $120 million budget.\nThe actors were alright but i think that the movie is what makes\neverything look bad. The ending is even worse. It quickly ends after\nthe defeat of the bad guy. There was not much of a storyline when you\ncompare it to the other Fantastic Four movies. There was more action\nand more of a story which you could understand. <br><br>Overall the entire movie is shocking and is a waste of time going to\nsee, even if you a huge Fantastic Four fan. I'm telling you now, you\nwill be very disgusted. Marvel haven't spent enough time focusing on a\nstoryline and more of a connection. The only real thing i believe they\nhave focused on is the fight scenes, the destruction and the special\neffects that are within the movie. A whole lot more could of been done\nwith $120 million. <br><br>Don't bother going to the cinema to come out fed up and disappointed.\nDon't say i didn't warn you.\n"},
{"review": "\nI was excited (at first) during a sneak preview, when I realized\nthey'll show the movie, because I would have gone to see it anyway. I\nloved the old Fantastic Four movies, but it makes sense to reboot due\nto the new Marvel Movieversum.<br><br>But just after a few minutes I realized, this movie will get worse and\nworse. Not only that Susan Storm appears to be too meek, also why for\nheavens sake did the change the family history and why for crying out\nloud is Johnny suddenly black? Also I miss the more mature Reed and the\nback ground story of Ben being a high ranked pilot makes much more\nsense than him being used as a tool of the military - he is not as\ndumb, as he is portrayed in the crappy reboot!<br><br>Hopefully they wont continue this story line! I hoped to see the\nFantastic Four joining the Avengers at some point, but these kids\nshould just go home and be ashamed of this movie.\n"},
{"review": "\nWorse than Batman and Robin. <br><br>A bigger pile than Superman IV. <br><br>Makes Catwoman look like Fanny and Alexander. <br><br>Nothing is worse than a blatantly horrid superhero movie that makes it\npainfully clear to all that witness its doom just how little thought\nand care everyone involved put into the project. This is NOT once of\nthe worst superhero movies of all time, it is the WORST movie ever made\nin an attempt to be taken seriously. NOTHING HAPPENS! I fell asleep AND\nwent to the bathroom in its runtime, two things that I have never\nbefore done due to my respect for the filmmakers. Sadly, this steaming\npile of total trash is literally on its knees BEGGING you to wipe any\nounce of respect you may have for it through a puddle of sh*t.<br><br>To all those responsible for its release, please die.\n"},
{"review": "\nThis movie truly was horrible. It was literally 80 minutes of building\nup to a huge fight at the end.<br><br>And who's fault was that? The producers who thought Josh Trank, and\nJeremy Slater could make a decent film. Simon Kinberg also wrote part\nof the screenplay and has done some really fantastic films in the past\n(X- Men sequels, Sherlock Holmes), but he should have spotted this\nhorrendous pile of garbage that Jeremy Slater wrote. I mean, let's face\nit; Slater's prior experience was the Lazarus Effect. Why would you\nentrust your head screenplay guy to be the guy that wrote...THE LAZARUS\nEFFECT. Josh Trank has hardly any experience directing Chronicle and 5\nepisodes of Kill point, which were both admittedly good. But a much\nmore seasoned and solid director should have been involved in this.<br><br>The producers went for a money grab. They didn't care about the\noutcome. They dumped a ton of money into marketing and cared more about\nthe $$$ than the\n"},
{"review": "\nIn my opinion,Sony needs to give MARVEL the movie rights back, stop\nmaking crappy films the fans hate. As for as the Fantastic Four\nFranchise, let Netflix have a run at this franchise because poor\nwriting has killed this movie for the big screen. I don't think the\nworld would except another reboot even if Marvel Studios was doing it.\nI would love to see what Netflix could do with this with a 10 hour\nseason.<br><br>As it becomes clear this movie is going to be one gigantic flop, lets\nhope the actors of this movie know it's not their fault and that it was\ndoomed from the beginning. Finally SONY, learn a lesson here, we the\nfans are who you must please,if you are going to take the stories and\ncharacters we loved growing up and make them suck the end result will\nbe undeniable.\n"},
{"review": "\n*** This review may contain spoilers ***<br><br>People are complaining unnecessarily...just because what? We did not\nsee Jessica Alba nude? wow... This reboot is definitely worth watching: <br><br>I don't get why I should feel ashamed of liking this short but awesome\nblockbuster. The poor director must feel so bad about making this. He\nshouldn't feel sad. I thought it was great how they changed it because\nmaking something different is better than copying the comic. I can't\nsay everyone but most people say that the movie and the characters have\nto look the same as the comics, still who cares, that writing in the\nposter that says \"change is coming\" it was actually true. <br><br>I don't think it was so bad because they had great actors, an awesome\nplot changing from space to inter-dimension travel which I think was\ngreat, they a diabolically awesome villain which in the comics is a\nhippy turned into lord of Latveria and in the movie is a genius turned\ninto a demon.<br><br>So just don't think all the other reviews are true and try to enjoy\nthis movie.\n"},
{"review": "\nI would actually give this movie a 9 but I thinks its deserves an\nhigher average. I don't understand why people think this movie is so\nbad. Yes the reshoots are very obvious with the ugly wig. But there is\nact very well by an amazing cast, and I think the music is very\nbeautiful. So what's the problem? When I saw the trailer I was\nimmediately hooked. So I went to the cinema and I couldn't believe that\nsome people don't love this. Yes I understand that building the\nteleporter and that they try too control their power is boring for some\npeople but that was that I loved the most. I hope that there will be a\npart two and I look forward to it. But I think it was very stupid to\nlet Kate Mara cut her hair when they weren't totally finished yet. In\nmusicals there are a lot of wigs and they don't look fake at all. Maybe\nthey run out of time. But I don't think you have to react so negative\nbecause it's a great story\n"},
{"review": "\nAfter viewing this film and leaving the cinema I came to the\nrealization that if extraterrestrials ever saw what just transpired in\nthat room it would mean the destruction of out planet. If I was\npresident Barack Obama I would find every copy of this movie and erase\nit from history, I only hope its not to late.<br><br>This movie is so bad that if I was one of the creators I would kill\nmyself just from the pure shame that is this movie, if I could give\nthis movie a zero I would. I was going to go into more detail as to why\nthis movie is so bad, but that would be giving the movie to much\ncredit.\n"},
{"review": "\nAbsolutely not recommend to see this movie. I watched it last night and\nI have to say this movie is such a disappointed ever. I don't know\nwhat's going on with Dr. Doom, the way Fox created him was so suck. He\nlooks like a person who just got serious burned. He doesn't' even have\nany muscle as the comics. The plot is so damn sucks, 1 year after the\naccident in the dimension world, no character even bother to mention\nabout him, all people in the world just focus on how to find Reed, like\nVan Doom is never exist in that movie...this is weird. And seriously,\nsomeone please give Ben a pants instead of showing his rock butts on\nthe screen like that. This movie is way more worst than the 2 previous\nmovies, so far away my expectation :(\n"},
{"review": "\nTo use 1 star in this movie is way too much condescending from me. If\nyou tell someone: - ¡don't do it'... 'be careful, please'... And\nrepeat, and repeat, and repeat.... <br><br>And despite all warnings and efforts, not only they do it... but also\nshows everything you lost your time trying to prevent in the first\nplace... Do you think it deserves a one or a ZERO? How can you measure\nsomeone closing eyes and ears? One 'dragon ball evolution' is not\nenough? The producers don't/can't understand they are making this kind\nof movies for the comic fans?<br><br>Pitiful... a lost of time and patience. Forget this movie and better go\nwatch anything else.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"Fantastic Four\" (2015) is not the worst movie ever and even not the\nworst movie this year. I seriously enjoyed on the same level as\n\"Avengers Age of Ultron\", they are both equally messy and uninvolving.\nIt is bad that \"Fantastic Four\" didn't had any humour, and ending was\nvery generic, with villain who wants to destroy the earth - how is that\nfor some originality huh? While the plot is predictable and lame,\nacting was OK, but nothing special. After this movie will end you will\nforget it very quickly, but it's not the worst movie.<br><br>Overall, \"Fantastic Four\" is by a mile better then for example second\n\"Thor\" movie. Still that doesn't make \"Fantastic Four\" a guilty\npleasure, because it is simply becomes boring and uninvolving by the\nend. At running time 1 h 30 min it drags here and there, so if you will\nskip this flick, you won't lose anything.\n"},
{"review": "\nWith the dark feel of a serious alternative to the original this reboot\nimmediately grabbed my attention. What a crying shame. Poor dialogue,\nunbelievable relationships, rushed and ruined. With a palette of\nawesome special effects and quite clearly a huge budget this could have\nbeen a cracking movie. For me this is a wasted opportunity. Did the\nDirector and Production team actually watch this before release? If so\nhow are they actually taken seriously within their profession? More\npatience should've been shown and an extra 30-40 minutes added to\ndevelop plot and characters. Don't bother, dust off an old copy of\nx-men instead.\n"},
{"review": "\nbad movie cant begin to explain what a disappointment it was the first\nones were far better bad bad idea id rather watch my dog s--t in the\nyard then wait for rain and watch it fade away seriously that's how bad\nit is id rather watch my grandma clean her dentures I can think of some\nmore but I'm bored now the plot of a low budget porn would be more\ninteresting I mean I made this account just to rate this s--t movie and\nhave to write 10 lines to submit it id rather get in my car drive to a\nbeauty shop and eat a pile of cut hair not quite to ten yet id rather\nlisten to Obama give a speech not sure about that ??? id rather watch a\nfull episode of the kardashian's OK no I wouldn't no no way\n"},
{"review": "\nOh my God! What is wrong with Hollywood!!! I am sick of remakes and\nprequels. And the worst part is; its getting worse! Before, remakes are\nfor 30 years or older movies (still annoying to watch same thing). But\nlook at that! Only 10 year. We don't have to see same thing again and\nagain. We are not moron, we can understand when we first see. Like new\nspider-man series. Same thing with bad actors and actress and poor\nscripts. <br><br>You have lots of money. Do something original. And now you don't even\nneed to tired, because of 'the holy green screen'. Back than movies are\nwatchable. (I am only 21). We can see hard working and tear. Now only 1\ncomputer guy make armies. Look awful and fake armies. Yes I am talking\nto you P.Jackson.<br><br>Anyway. Movie was bad\n"},
{"review": "\nWhen I saw the 2005 Fantastic Four movie I was a little disappointed,\nbut it was still \"okay\", at a push. Surely the point of rebooting a\nfranchise is to make it better? Well if anything they made it worse.\nThe cast are awful, the writing is terrible and there is absolutely NO\nTHING laudable to say about this sham of a movie. You want it to get\ngoing, it never does, and then it ends. Oh my word, the film was so\nstultifying that just watching it has made me lose my ability to fully\nconvey in words how bad it was. I feel like I may have actually lost\nbrain cells. If you are thinking perhaps its an okay 'popcorn' movie\nand that maybe my terrible review has lowered your expectations so much\nthat you may go on to enjoy it... I guarantee you that you will not,\nand if you watch it against my advice you will later lament this poor\ndecision.\n"},
{"review": "\nThe best part of this stinky pile is Marvel hated it so much they\ndecided to show their displeasure by killing the cast. Drawn in the\nlikeness of Miles Teller, Jamie Bell. And Kate Mara the trio waits for\ntheir friend Mike who they say is late and can't believe he thinks his\ncharacter Johnny will be the star of the movie with director Trang.\nIt's pretty obvious what movie they are talking about. It's around this\ntime they notice there are explosions going off then the next panel\nzooms out and shows the diner blow up. It's glorious! I still can't\nwait to see what Marvel Studios has to say about this bastardized\nversion of Marvel's First family. I don't know what was worse the fact\nthey basically made the movie unrecognizable from the comic or the fact\nthe movie had no content. At least the previous movies had content.\nThey may have been cheesy but at least they embraced it. And please\nTrank pay the light bill! This movie was too dark for it's own good.\n"},
{"review": "\nI went in with very low expectations. I didn't find it to be a total\ntrainwreck, worth 9/100 on review sites etc. while watching it. But, a\nfew hours later, when I think about it; I have to be honest : it's not\nvery good. Basic stuff to poke - although it's almost too easy : the\ncharacters never look like teenagers. Hard to identify / find them\ncredible when they look like 30 really. And some actors (the big evil\ncorporation guy especially) were just not good. Special effects were\nalso of another era. My partner described them as 1990s' level, I found\nthem to be direct to video level. And this is supposed to be a summer\ntentpole, so that's not acceptable. And finally: the story lacks a\npoint. Half the movie setting an origin, another half not going\nanywhere... Pretty poor in retrospect. As a fan of the source material\nsince my earliest years, the sanction has to be severe - it's simply\nnot good.\n"},
{"review": "\nFirst i have to admit, that F4 was never really \"my world\", anyway i\nwatched \"F4\" and the sequel \"Silver Surfer\" and found them simply\ngreat. So, since i'm a big Marvel-Fan i hat to watch this one too, just\nfor curiosity. I asked myself, \"why would Marvel redo it, what's the\npoint in this\"? If you watch a movie, and then watch a remake with a\nsimilar storyline, it's hard NOT to compare them. In the end i have to\nsay \"they shouldn't have redone it. The characters are quite \"flat\",\nthe characters motivations for doing what they do and for becoming what\nthey become, are quite thin. The animations and CGI are good work, but\nthat alone can't keep a movie \"alive\". Compared to the prequels' great\nhumour, stories and characters, this one was (at least for me) not\nworth watching.\n"},
{"review": "\nThis has got to be the worst interpretation of a marvel movie made, it\ntook at least 3/4 of the movie till u actually see the main villain\nthen 10 minutes later he gets killed off and the movie ends,\nridiculous, the plot was not thought through well even sue storm\nshouldn't have got her powers the way she did because the explosion\nthat occurred when they returned Kent if she got powers that everyone\nin the blast radius should have got them as well, doesn't deserve and\nshould not get the upcoming sequel. Especially when the back story\ndoesn't match the original comic book start up in any shape or form,\nthey should have stuck with the original movie and made a sequel before\nCaptain America was made, what an epic fail.\n"},
{"review": "\nwant to watch this movie? watch the 2005 version and bang your head\nagainst the wall. that would be more enjoyable. I know they had\ndirector problems but the problem is not that; the issue is that the\nstory is awful. spend an hour with foreplay, 10 minutes for real action\nand a pathetic ending. this is the Fantastic Four! director blows, cast\nis okay, just a terrible script/story. good luck with number 2. It\nlooks like you are repeating the history of the 2005 version and the\nsilver surfer version. no one who has ever had an interest in the books\nhas any respect for what you have done. Just another spider man, and\nspider man reboot. hire a real director, hire a good writing team that\nhas actually read the books, pray to God that everyone doesn't think\nyou are a joke, again. Learn how to make a graphic superhero movie.\nDon't sell out to some studio to make it PG or PG-13.\n"},
{"review": "\nNormally we expect a lot more from such sci-fi movies specially with\nsuch established characters like this movie have. This movie does not\ndeliver a quality to the viewers in terms of story telling and acting.\nThe graphic and CGI is OK but acting is the worst. Miles Teller does\nnot deserve a lead role like this and this movie will be a living proof\nof this fact. Michael B. Jordan is not better than Miles Teller either.<br><br>No character building is there and we do not feel attached to any of\nthe characters at all. Sometimes it feels like the actors are trying\ntoo hard to act and its obvious they are over acting.<br><br>On a short scale, the movie sucks and only watch if you have nothing\nelse to do.\n"},
{"review": "\nmaybe i hate it becos i am a 40 year old and was a comic fan. i wonder\nhow i'll react with a young lex luthor, anyway back to FF. <br><br>the kid acting young ben grim stole the show and set it up very well\nfor jamie bell who executed his role a tad dark. maybe its the\ndirection that they wanted, who knows? the human torch obeying\nauthority is new to me. sue storm, i love the flying. reed...the\nspecial effects for him is superb. doom (this version) i really can\nrelate to him, save for the annihilation bit. <br><br>the entertainment factor of the show is solid....but for the purist in\nme (i am a contradiction) have to hate the show and the new franchise.\n"},
{"review": "\nI was very much looking forward to watching this film. I had enjoyed\nthe previous Fantastic Four films and so had hoped for much better,\nbigger productions with new technology, effects etc. etc. I ignored all\nthe negative press and bad reviews so that I could make my own mind up.\nIt was bad! It wasn't even cheesy, it was past that. I would actually\ngo as far as saying it was boring. I admit I watched the whole film,\ndesperately looking for its saviour. Didn't find it. Well I most\ncertainly wasted my time. It had so much potential, what went wrong?\nI've got a list. Casting maybe? The ending where they came up with\ntheir collective name, Fantastic\u0085 completely cringe worthy. Cannot\nimagine what the sequel is going to be like. Dare I say it can't be\nworse?\n"},
{"review": "\nit's really an awful movie . i can not imagine how and why these actors\nshould agree to do it. it's nothing fantastic at all. and not full of\namusement as other movies . i believe the old fantastic four 1 and 2\nare much much better than this one? so please guys don't waste your\ntime and money to watch something you can not be impressed of, one\ncheap movie after all, thank god i just watched online and regretted\nthat i watched it. it's better for you to watch something else like a\ndrama. this movie has no emotions. just was made to collect money from\nour pockets . i hate such a stupid style, and the director of this\nmovie is inexperienced and full trolls. please mr. stupid director do\nnot make any more movies, go wash dishes in new york better for you\n"},
{"review": "\nThis movie had nothing to do with the real Fantastic Four. I got the\nimpression that the director hated the comic book characters and simply\nwanted to destroy their reputation. You have to wonder how with\nlicensing and legalities nowadays, a director would be allowed to make\na mockery of the whole comic book series? The movie drags and seems to\nbe a rip off of other comic book movie scenes all mish mashed together.\nOne of the worst mistakes in the casting was to make Sue Reeds\nbiological brother black and then cover it up in the movie by claiming\nSue is adopted. Making Doctor Doom an angry internet blogger borders on\ninsane. And having the Thing have no pants was kind of creepy.\n"},
{"review": "\nIt amuses me how people have made reviews on here for Fan4stic saying\nthey want to be honest with their rating, but lied just boost the\nrating for it. So here goes, a review to keep this awful awful awful\nmovie down in the dumps where it belongs.<br><br>Fan4stic (this title cracks me up, I can't take any of it serious)\nstarts off dark, and ends dark. It starts off a mess and ends even\nmessier. We have the typical \"origin\" story where two of the friends\nare in grade school and create a science project type experiment pretty\nmuch for kicks. They make a teleporting device out of spare game and\ncar parts. Yes, that is true. Skip some years, Ben Grimm is forgotten,\npeople do stupid crap that has little to do with the story. I find\nmyself bored with writing this review, just as I was bored with the\nmovie. Seriously, it is a true abomination of a movie and really\ndeserves a lower rating than what it already has. Just being honest\nhere... And to all the people who defend it, stop. Please.\n"},
{"review": "\nMan I hate this guy so much ..seeing his face on screen makes me watch\nanything else ,How does he get work. Must have a rich daddy.<br><br>Watched 20 Min's of this movie and left the cinema as it did so\nbad!!!..end of review..... Man I hate this guy so much ..seeing his\nface on screen makes me watch anything else ,How does he get work. Must\nhave a rich daddy.<br><br>Watched 20 Min's of this movie and left the cinema as it did so\nbad!!!..end of review..... Man I hate this guy so much ..seeing his\nface on screen makes me watch anything else ,How does he get work. Must\nhave a rich daddy.<br><br>Watched 20 Min's of this movie and left the cinema as it did so\nbad!!!..end of review..... Man I hate this guy so much ..seeing his\nface on screen makes me watch anything else ,How does he get work. Must\nhave a rich daddy.<br><br>Watched 20 Min's of this movie and left the cinema as it did so\nbad!!!..end of review.....\n"},
{"review": "\nCONTAINS SPOILERS! YOU HAVE BEEN WARNED!<br><br>Other reviewers on IMDb have talked about how this film is an\nabomination. This is not the case. It's not worth 1-2 stars like many\nhave raved about, but it's still not decent as a film. I came into the\ncinemas hoping that this would be a great movie that I could review. I\nsimply couldn't. It had good actors under a bad director, insane\npredictability and ABSOLUTELY ZERO CHARACTER DEVELOPMENT. The villain,\nDr Doom was obviously going to be left in the Earth- 0 and come back\nand try to destroy the Earth. In the ending the team brings up the\npossibility of their team name having the name fantastic in it. As soon\nas I heard the word 'fantastic' I shouted \"ROLL CREDITS!\" and sure\nenough, there was the film title card. The film was disappointing but\nat least the CGI was decent.<br><br>5/10 Mediocre -Bad Villain -No character development -Bad directing\n-predictability +Decent CGI\n"},
{"review": "\nI'll try to make it simple and short:<br><br>I did like:<br><br>- the effects used to do the human torch... - Kate Mara &amp; the invisible\nWoman - Reg E. Cathey<br><br>I did NOT like....<br><br>- the rest of the movie.<br><br>F4 has never been so dark, broody, brutal and senseless. Never been\nfilled with sadistic mass-murders and -murderers, never about the\nf@ck|ng US-Army, never been filled with so much blood, gore and totally\nsenseless brutality.<br><br>10 years ago many have complained about the \"old-fashioned\" way the\nprevious film(s) have been produced. But at least it was about\nsomething, this movie is not. <br><br>And for whatever pq\u0080rverted reason, everything must be gore, mame,\ndark, brutal, depressing and so on.<br><br>Okay people who have complained 10 years ago: Here you have what you\nhave ordered.....<br><br>The fantastic farts... The fantastic failure.... ...and so on....\n"},
{"review": "\nThis might just be one of the worst movies I've ever watched, and\nbelieve me I've seen some bad ones. The action is minimal and terrible.\nThe CGI is awful. The dialogues are crushingly boring. There is no\nstory or character development. The plot is incredibly silly. The\nmakers should be made to compensate the viewers for wasting an hour and\nhalf of their life. This movie left such a sour taste in my mouth that\nI may never want to see a Superhero ensemble movie ever again. The only\nother movie I can think that was this bad was \"Rollerball\" from 2002.\nHow a movie of this quality can be released is beyond my imagination,\nwhat were they thinking when they invested so much of time and effort.\n"},
{"review": "\nThe film definitely lives up to the horrible comments and anticipation\nof how much it would bomb. I figured there was no way it could be that\nbad, and that everyone was just hating on the film for the sake of it.\nBut I was wrong. When I thought the film couldn't screw up any further,\nit did just that.<br><br>There are too many reasons to list why this film did so horribly -- one\nof which being the unnecessarily long beginning which took twenty\nminutes too long to reach the actual point in the film that we all knew\nwas coming.<br><br>Another thing was how they \"killed off\" the villain (which we all knew\nwould survive), and not bringing him back until the last twenty minutes\nof the film. The leading fight was a huge disappointment that ended\nmuch too quickly.<br><br>This was definitely a major disappointment, and I found myself finding\nthe last two Fantastic Four films (which were bombs as well) much more\nenjoyable than this film. I wouldn't recommend anyone watch it, and\nhopefully Fox comes to their senses and decides to return the rights\nback to Marvel.\n"},
{"review": "\nI went into this expecting to see the worse thing to happen to the\ncomic book genre since Catwoman. I was pleasantly surprised, I\nthoroughly enjoyed the film from start to finish, now I'm not saying\nthis was a great film but by no means was it a terrible film. I enjoyed\nthe new take on the origins, Fox went for a darker tone with this\nfilm,which is nice to see as it stems away from the typical recycled\nformat for Marvel films. Fox have assembled a great cast of young\nactors and in my eyes there is a lot of potential for a sequel and\npossibly an X-Men crossover as long as Josh Trank isn't involved as\nit's clear the disagreements between him and Fox and his treatment of\nhis actors is what 'ruined' this film.\n"},
{"review": "\nThis might have been acceptable if the title wouldn't have been\n'fantastic four' and the superheroes would have received powers that\nare different from the fantastic four. In other words if they had\nchanged everything that is associated with fantastic four instead of\nhalf of it. Now there is no story continuity and not even character\ncontinuity..I mean..now torch all of a sudden is a black guy?, that is\njust about as awful (and politically motivated my cultural Marxism) as\nThor changing into a girl. This movie is a clear example of what\nhappens when there is no artist integrity but just market share\nanalysis. 'We need to make them young, to attract the teenage\ndemographic', 'we need a black guy to draw some black audience', it\ndoesn't matter it if the story doesn't make any sense!, people are\nstupid, as long as there are spectacular special effects they will\nwatch any moronic story line. <br><br>In conclusion: this movie is an insult.\n"},
{"review": "\nWhat blows my mind is that Josh Trank had 120 million$ and he made a\nboring movie. I can't believe how boring this movie was! They're going\ninto another dimension which is so not fantastic 4. There's no action\nuntil the very end and even that is super short and all CGI nonsense.\nThe training montage is rushed, the story is not interesting and\nNOTHING HAPPENS! The movie is so incredibly uneventful! The fantastic 4\nhave no character development! The movie just exists to set up a\nsequel. The only good things are that Kate Mara is super hot and that\nthe thing looks pretty epic. But even those can't stop this movie from\nbeing a total bore. Also Dr Doom is a joke! No seriously! He doesn't\neven have his trademark mask. This movie had so much potential and the\ncreators were like: nah let's just make it boring. The acting is so\nmediocre. The special effects are bad! Even Kate Mara's hotness and the\nthing's awesomeness can't save this lame movie. At least the other\nmovie was funny and didn't take itself seriously. Don't watch this\nmovie! It's so boring!\n"},
{"review": "\n3.9 is generally being to nice.<br><br>Poor Acting, Poor Plot.<br><br>Before anything half decent starts to happen it's honestly to late for\nyou to care.<br><br>My cinema only charges 2.50 for films, and I'm gutted I paid that much,\ndon't bother spending anything money on this film. <br><br>They should of left the Fantastic Four on the high of the original, now\nsadly it's being left on a bad note. They honestly had to make a bad\nfilm just in introduced them into the \"Avengers\" ( Apparently it's what\nI read!\" <br><br>So basically save your money for a decent film and to not watch this\ncheese balls of a movie!\n"},
{"review": "\nWhen in the cinema, I really hate when other people look at their\nphones throughout a movie. Except on this occasion I was willing to let\nit slide. <br><br>This film is boring, so boring in fact that I went to get a refill on\nmy Tango Ice-Blast in order to try and fill up my bladder. So that I\ncould give my self the everyday thoughtless task of going to the\nrestroom to relieve my bladder oh and also my brain from that awful\nfilm. <br><br>Some of the visuals in this film were great, and I say \"some\". That's\nbecause the majority of this movie is poor story telling, with next to\nno character development and hardly any of the Marvel action/battle\nsequences that we have now come accustomed to. Yes it is an origins\nstory in some sense, but lacks everything a Marvel movie should have.<br><br>Some of the acting in this film felt very dull and flat, to the point\nwhere it felt like Josh Trank must've been having a bad day and just\nstarting finishing scenes in one take, just to get the hell out of\nthere...probably to fill his Tango Ice-Blast.\n"},
{"review": "\nOkay so our time is ticking until we pass and I just wasted 2hrs of it\non the worst movie I've ever seen in my life. It was like 3hrs of\nnothing then in the last 5 minutes of the movie the action is thrown\nin. Horribly directed. Very disappointed. If only I could get my money\nback.What I saw cannot be unseen please... Don't watch it. SpongeBob is\nbetter than what i watched. No wonder the theater was empty for that\nHorrible movie. It just made no sense it looked as if the movie was\nmultiple thoughts of what the movie could of been made into. I can't\nbelieve it's still in theaters. Don't take your family to see it. My\nkids were asking when the movie was going to be over and leaving for\nthe bathroom every 5 minutes because they were so bored. My youngest 9\nyears fell asleep and he's a fan of marvel and superheroes that should\ntell ya something.\n"},
{"review": "\nWhen are Fox going to learn just because they have to make a FF movie,\ndoes not mean that they should! They should accept the fact that they\ncannot make a decent FF movie and for sanity's sake let the movie\nrights revert back to Marvel, who what the fans want.<br><br>I am not going to repeat what a lot has already been said on the\nprevious reviews, because I cannot add any more than what has already\nbeen said.<br><br>All I will say is that this version lacks any heart that it's\npredecessors had. Even the cast lacked any on screen chemistry, which\nis important for any FF movie. The film itself felt rushed and devoid\nof any humour that comic (which holds a firm place in my heart) has.<br><br>I very much doubt Fox will learn from their mistakes and we will see\nanother FF movie inflicted upon us in the next few years, but I\nsincerely hope they listen to the fans and do what is right.<br><br>Now, if you excuse me, after going seeing that excuse of a movie, going\nto have a very hot and long shower, as I feel all nasty and violated\n(ARRGHGH!!! Unclean! Unclean!)......\n"},
{"review": "\nI went to see this a couple of days ago now but am still really\ndisappointed with what I saw. <br><br>My first real problem with this movie, is that Stan Lee was none\nexistent. I don't know if there was a certain reason or anything but I\nalways watch out for Stan Lee's cameo, in every single Marvel movie I\nwatch. To say I was sad is a understatement.<br><br>Secondly, the 'battle'. A superhero based movie has to include a battle\nof some sort. This did. But, the 'Fantastic 4' won the battle with\ntheir first attempt? Nope, that's not meant to happen, it was like they\ndidn't even have to put up a fight. Stupid.<br><br>The 3/10 is for the actors, I thought the acting was good and there\nwere some well known names involved in the film, which I was pleased\nabout.\n"},
{"review": "\nI have to believe that not all people that watched this film read the\ncomics. I mean, just no. I haven't read them and therefore I could only\nanalyze this movie as standalone. And besides a few horrific uses of\nfacial CGI and a few ridiculous scenes, this was quite OK. <br><br>I can only attribute the bad rating of the movie to comic book fans who\nwanted that exact work to be replicated in video - as that would be the\nonly acceptable sign of artistic expression - and then everybody else\njust assumed that they knew what they were talking about.<br><br>Well, comic fans, mind your own business! I wanted to see a sciency\norigin story film for a ridiculously named group of obscure heroes and\nthat is what I got. The only reason you won't see more of them is\nbecause you whined like little children that your new toy ain't red.<br><br>Bottom line: could have been better, sure, but that could be said about\nany film. In my view this reboot was going a decent way.\n"},
{"review": "\nSo the new Marvel thing seems to be resetting some of their heroes with\nnew, younger actors and retelling the story from scratch. There's only\nthree things wrong with that - 1) if we like the original actors\nthere's no reason for the change (other than the studio saving money!);\n2) we've already heard this story before; and 3) there was a third\nreason, but until I can remember it I think replacing guys we liked\nshould count for two. The original casting for FF was great, spot on,\nand it's not that important to the FF concept that they stay teenagers\n(that is a little more important to Spidey). Subbing in a new cast came\njust too soon after getting connected to the original actors. Beyond\nthat, these new folks were ehhhh and the story wasn't very compelling\nand the action that did happen was on another, bland planet. So not\nonly did they engage in premature substitution (I hate when that\nhappens), the product wasn't very good. Can they still bring the old\nguys back? Sheesh.\n"},
{"review": "\nI read the reviews, but seeing as I'm a superhero nerd I thought I\nmight overcome the filmism I found in some other reviews. (I made a\nword). The harsh critics aren't wrong, this is a boring movie. It has\nthe most stereotypical plot you could possibly imagine (if you were to\nplot a line it'd look like a gentle slope up for the first 75% and drop\noff for the remaining 25%) and the peak represents a single very bland\nconfrontation. I'll give it to them that the producers didn't spend a\nton of time explaining how the characters get their powers, but that\nsaid they didn't spend any time explaining anything about any of their\ncharacters. This cost about $229,900,000 in digital effects and\n$100,000 in scripting.\n"},
{"review": "\nThis film is not based on the \"fantastic four\" of the comic books - it\nis more based on \"X men\" - so everything or mostly everything is\nirrelevant to the ORIGINAL Fantastic Four. The Film starts slow.. too\nslow... <br><br>The action, characters, acting, and directing is very sub par. This\nentire film does not make much sense. The first two films were decent\nto sub decent. But this \"reboot\" (as if we need to know how they become\n\"super heroes\") is just boring. Not worth seeing, or even renting. <br><br>This film should have been titled by another name .. like \"Fantastic X\nmen\", even though, one character is female. We will not be carrying\nthis film on our Film Libraries (with good, or \"bad\" reasons)..\n"},
{"review": "\nI just saw the movie this morning, with an open mind and I can honestly\nsay it was not NEARLY as BAD as the initial reviews. Angry die hard\nfans of the comic want the Fantastic Four wearing baby blue suits with\ngiant 4's on them. That was never going to happen when the studio hired\nsomeone like Josh Trank. His only directing credit is a dark and twisty\nscience fiction movie like CHRONICLE. It was very grounded and solid at\nleast to me. Not great. Not \"fantastic.\" But a solid movie nonetheless.\nI do personally think it needed a little more comedic moments, bigger\naction sequences and more overall interaction between Sue and Reed. I\ngive the movie a C+ or maybe even a B- ...but like I said that's just\nmy opinion.\n"},
{"review": "\nNothing was right about this movie. I went into the theater and the\nmovie started and I couldn't help but think I had wasted money going to\nthis terrible movie. The thing was that the trailer actually made the\nmovie look not too bad but in fact it was all a trick to make its money\nback. Miles Teller was never really the right choice and poorly acted\nas the super smart Reed Richards. The villain was also extremely\nunconvincing and while the actor wasn't terrible, the character just\ndidn't really fit into the movie very well. Lets just hope that Fox\ndecide to sell these characters back to Marvel since they are the only\nones who seem to know what to do with their characters. One good note\nabout the movie was there was no after credits scene so it is possible\nthey might decide to not go on and make a terrible sequel (Maybe they\nmight think about teaming up with Marvel like Spider-man has.\n"},
{"review": "\nAt the beginning, i have a lot of expectations for this movie, since\nthe trailer come out i was so exited. So, with that kind of trailer you\nhave and idea of the movie, but this time i only got a big\ndisappointment. The movie start very slow, it's boring, lack of sense\nof humor and you star to get tired of the same routine and just waiting\nfor some action or memorable dialog. After a 40 minutes of torture,\nfinally something, but the problems come to float, the story behind the\ncharacters is pointless, dull and the antagonist is not what you\nexpect. There are no chemistry between the actor, all of the have their\ngreat performance in TV and cinema, but the is no direction or writing\nthat helps to reinforcement their relationship. <br><br>In conclusion don't waste your money !!!!\n"},
{"review": "\nI expected so much out of this movie, since I grew up loving the first\nFantastic 4. First of all, the movie was way too fast paced. Boom, they\nget their powers, and a year later they go and fight Victor, and then\nit's over. They tried to push Susan and Reed together with barely any\ndevelopment. Johnny Storm.. was that even him? Barely cocky, arrogant,\nhumorous. And at the end they tried pushing the love/hate relationship\nbetween Johnny and Ben. I expected the movie to end right when they\ndefeated Victor. That's how abrupt and short this movie was. There were\ntoo many gaps, not enough development, unlike the first Fantastic 4.\nJohn Trank, you could have done better. Plus, Ben was barely showing\nany signs of insecurity. He basically said, \"What happened to me? I\ndon't like it, can you change me? OK thanks.\" I didn't feel sad for him\nlike I should have.\n"},
{"review": "\nAfter the last FF4, you would hope they could at least improve on this,\nespecially with a good cast and Matthew Vaughan on board (after saving\nX-men), hopes were high. For the opening hour or so, all was looking\ngood, the story was developing, a little bit of a wobble after they\ngained their powers, but the story picked up again and looked like it\nhad a strong foundation to continue with.......then it crashed into a\ncrescendo of diabolical storyline, acting and action, that was an\ninsult to the viewers and cinema as a whole. It started so well, but\nfelt like they for the last twenty minutes, they decided to test the\ntheory that if you put infinite monkeys in a cage with typewriters,\nthey would recreate Shakespeare......Instead they employed 20 monkeys,\nwho proceeded to soil themselves, throw it at each other, but produced\na plot ending, that would have embarrassed a straight to VHS 1980\nB-movie\n"},
{"review": "\nNo story, No character development, full of pathetic lines and actors.\nThe 10 year old version was way better than this crap. Its so slow and\nso bad! you feel like why why did they spend so much money in making\nthis stupid movie! This movie has nothing. There is not even a single\nscene which I could appreciate. The way they they get their\nsuperpowers! and the villain. I cant seem to understand why he would\nwant to destroy the earth. He has the superpower like jean Grey of Xmen\nkilling people via telepathy. But he couldn't use it rather didn't use\nit on any of the so called f****** 4. And the worst is. How they pick\ntheir names at the and of the movie . I felt like pulling my hair out!\nPlease DO NOT watch this movie! The Fantastic four(2005) or the rise of\nthe silver surfer - I would rate them 10 if compared to this movie.\n"},
{"review": "\nScientist Reed Richards has discovered the secrets of interdimensional\ntravel and with a group of friends goes into another dimension. However\nsomething goes wrong and when they return they discover that they all\nhave different powers. One of Marvel's best comics gets the movie\ntreatment. The 3rd movie after the 2005 Fantastic Four movie and the\n2007 sequel Rise Of The Silver Surfer and 4th if you count the so bad\nit was never officially released 1994 film. For some reason the\nFantastic Four just doesn't translate well to the screen. A decent\ncast, Miles Tellar, Kate Mara, Michael B Jordan and Jamie Bell are all\nOK and the film livens up after a painfully slow start and there is a\ndecent scifi film struggling to get out but it isn't anything remotely\nlike the original comics. Time for Fox to give the rights back to\nMarvel! An Insult to Comic Fans !!\n"},
{"review": "\nI had a terrible experience watching this. One of the worst super-hero\nmovies of recent times! There's no passion in acting, and the story,\nlord, horrible! As some said, they ever can do a reboot. Some details\nof the characters and the essence of the comics are completely\nunrecognizable here. I didn't understood the proposal of the director\nto change that way the origins of team members. As a fan of comics,\nthis did not pleased me after all. The visual proposal of the movie is\nquite interesting, but, unfortunately boring and simplistic. There are\nnothing on the clothes that can be called \"fantastic\"; there are no\nidentity on them. Somehow they tried to move away the most of what we'd\nseen in comics and previous adaptations. On the one hand they were\nsuccessful in doing so, secondly, they failed miserably in the\nproducing of a good movie.\n"}
]