[
{"review": "\nSome have cast doubts on the verisimilitude of parts of this picture.\nOf course, those who impugn whether some events really happened or\nwhether they happened the way they are depicted in the movie neither\nunderwent the kind of training Navy S.E.A.Ls do nor did they ever find\nthemselves in circumstances remotely approaching those of the four\ncomrades. We do not know what punishment the human body is truly\ncapable of withstanding until we are put to an extreme test, gods\nforbid.<br><br>All I can say is that, regardless of whether this movie is accurate\n100%, 0% or anything in between, it brought me to tears. I can honestly\nnot remember the last time a Hollywood movie did that.<br><br>Very moving, very poignant, very touching. For that alone, as well as\nfor keeping me riveted for the whole of two hours (which is quite a\nfeat given my cynical and jaded nature), it deserves unalloyed\nplaudits.\n"},
{"review": "\nCompletely unrealistic movie. Propaganda film, as the Soviet of fifty\nyears ago. Do not watch! They tried to fix bad image of American\nsoldiers and the things they made ​​in the recent wars and have made\nsome bad mix of Superman and Rambo. People are dropping tens of meters\ndown a rocky mountain, strike with a head in stone but firing\nunerringly, killing hundreds of opponents, who are naturally evil,\ndirty and sad examples of human beings. Do you remember the worst war\nmovie you watched? This one is several times worse. I can not believe\nthat anyone could give this movie a positive evaluation. In war, people\ncan overcome their opportunities, especially superbly trained soldiers\nbut there are limits to what the human body can not handle. Header into\nthe rock after tumble at high speed down the mountain is one of them.\n"},
{"review": "\nIf you read the book and heard the interviews with the actual \"lone\nsurvivor\" you know that this movie got as close to the real events as\npossible. The 4 actors really gave it their all. Beginning long before\nshooting when they started their training so they would look realistic.\nThis movie is also the most visceral experience since \"Saving Private\nRyan\". There were falls in this movie that actually hurt more just\nwatching than when I broke my foot 2 years ago. And in the making of\nyou see that crazy stunt people actually did those falls, supposedly\nwithout dying. It's of course impossible to spoil this movie given it's\ntitle but it's important to note that the guy who helped him risked his\nwhole village for \"The Americans\" Safety. And he didn't think twice\nabout it. Sometimes we forget that not all of them are Taliban. After\nall is said and done this is a must see if there ever was one.\n"},
{"review": "\nThe movie is not easy to watch. Right at the beginning you'll some\ntraining \"videos\" (more like footage) from the real people that are\ndepicted in this movie. But it will be apparent a couple of moments\nlater, that there is a lot of Death to follow. It's almost a case of\nwhat can go wrong will go wrong. And while there are a lot of other\noutcomes that this could've taken, decisions had been made,\nconsequences had to be taken (upon).<br><br>What really gets you though are not some clichés about soldiers (and I\nthink this stays as much as possible away from them), but the fact,\nthat this feels as real as it can be, without you actually being in a\nwar. Mark Wahlberg and the other actors have to go through a lot, when\n... well you know what hits the fence. And it does hit pretty hard. Not\nfor anyone squeamish, this is fraught with tension ...\n"},
{"review": "\nAs many war films have surfaced along the years, Lone Survivor is one\nof the better depictions of true events. Lone Survivor stands as an\noutstanding account of bravery and comradeship under fire, with acts of\nselflessness abounding. And director Berg (Friday Night Lights) could\nnot have presented it more humanistically, or with more compassion for\nthose who gave their lives on a mission that was doomed from the start.\nAs it observes one of the four SEALS originally dropped onto Sawtalo\nSar, the rugged mountain near Asadabad where insurgent leader Ahmad\nShah was believed to be commanding a large band of Taliban fighters.\n\"No curse,\" Luttrell replies, \"just Afghanistan.\" But cursed they were,\nas Luttrell (Mark Wahlberg) and fellow SEALs Danny Dietz (Emile\nHirsch), Matthew Axelson (Ben Foster) and their leader, Michael Murphy\n(Taylor Kitsch), encounter nothing but horrible luck after confirming\nShah's presence.\n"},
{"review": "\nnever mind the stupidity of war in the first place, but: - they could\nhave leave the prisoners tied up - they could have taken the prisoners\nas far as possible and then release them or leave them tied up - they\ncould have only release the old man and leave the other tied up - they\ncould have take with them a prisoner and leave the others tied up and\nthen release him - a sat phone has the antenna above your head at a few\nkilometers, so a lower ground with 20 meters should not be an issue -\nif you live in the bush or in a war zone you have to be smart to\nsurvive, you won't last long if you are stupid. it makes no sense to\nsacrifice 40 to get the 4 Americans...\n"},
{"review": "\nGoing into the movie, I had high hopes, with ratings on this website,\nword of mouth, box office receipts. I must have missed the memo because\nI was thoroughly disappointed with the overall message the movie was\ntrying to get across.<br><br>Why was this movie made? What was the point? How many more movies do we\nneed to exploit our brave Navy Seals? It doesn't put them in a very\ngood light, as many mistakes (according to Hollywood) were made during\ntheir fateful mission.<br><br>Overall, I can see the allure of the movie to those Patriotic Americans\nwho need to validate their belief that we belong in Afghanistan. For\nthe rest of us who have been against this atrocity before we even went\nthere, it's another reason to shake my head.<br><br>Also, people who claim they are Seals here? I have to call them\nout...what \"real\" Team member would want you to run out and watch them\nfail?\n"},
{"review": "\nI found myself covering my eyes through a lot of this movie because I\nknow a lot of people in the military and it was just too personal to\nwatch these soldiers being killed so brutally and needlessly. I also\nfelt a lot of anger during this movie because of the ridiculousness of\nthe assignment given especially in light of the failing equipment and\nlack of response by the commanders. It is because I know these failings\nare true first hand and that the fighting man's back is not the first\nconcern, this movie stuck in my stomach. I loved seeing the part about\nthe men who helped him survive. This is something that is not often\nshown in war movies but is a part of the reality of war.\n"},
{"review": "\nEveryone did a fantastic job, I absolutely fell in love with the movie.\nI did my best to hold back a few tears, but I think I failed. I don't\nknow what real Navy SEALs look like, but if I had to guess it would\nhave been what these actors showed. I wish the best for these families\n&amp; for Marcus, I hope god is taking care of them. Also one more thing, I\nloved that Eric Bana was in the movie, I have been a big fan since\nBlack Hawk Down. I hope that he takes up another military role. This\nreview needs at least 10 lines in order to let me submit, so I will\nalso add that the stunt men did an amazing job, definitely one of my\nall time favorite movies. Another thing that I saw was that the extras\nand the actors that played the villagers were great. Thank you\n"},
{"review": "\nWatched Lone Survivor Featuring an Amazing Performance By Oscar Nominee\nMark Wahlberg(The Fighter) as Marcus Luttrell . Also Featuring Taylor\nKitsch(Savages)as Michael P. Murphy, Emile Hirsch(The Motel Life) as\nDanny Dietz ,Ben Foster(3:10 To Yuma) as Matthew Axelson and Eric\nBana(Closed Circuit) as Erik S. Kristensen The film was amazing but Sad\nalso Understanding what went during the War On Iraq also War is not\nglamorous also many tough calls have to made which I love how the film\nconveyed also really enjoyed the performances from all the cast as well\nand loved how this movie honored our troops. Amazing Music By Steve\nJablonsky(Gangster Squad),Cinematography By Tobias Schlissler(The Fifth\nEstate), Costume design By Amy Stofsky(Prime Suspect) and Direction By\nPeter Berg(Battleship ) A Pretty Accurate War Movie 10/10\n"},
{"review": "\nThis movie caught me by surprise. It was a great watch with action and\ndrama. I did however have several issues with it. For me to really love\nand get into a movie, I need to know and love or hate the characters.\nIn this movie I found that I couldn't tell some apart, even at the end.\nAnother issue, was the visual effects only by way of the filming\nlocation. This movie, set to take place in J-Bad, was way too obviously\nfilmed in the US or Canada, or so I thought. At the end of the movie I\nhad to look up filming location because it was not real enough for me.\nI don't want to spoil anything so watch and make your own decision, and\ncheck out the filming location if you feel it seems strange. A good\nwatch, but could have been a lot better if the script had played more\ninto a deeper story background.\n"},
{"review": "\nWhen you see a movie that depicts any kind of war conflict it usually\nborders on propaganda or something similar. It's inevitable. Having\nsaid that, I really enjoyed this movie as it seems and was more real\nthan many others that I have watched! <br><br>You can say whatever you like for the training and tactics of the\nMarines and you can agree or not, or find this really unnecessary and\nviolent or whatever. But what's true is that what you see is what\nactually happens in the real world. And being inspired from a true\nstory, makes this movie really really worthwhile. <br><br>The fact that these four guys are left against all these enemies and\nthe way in which the fight for their lives is truly remarkable and well\ndepicted! It's not your usual thing where the lead man always dodges\nbullets and gets out of a gun fight without a scratch. <br><br>As far as war movies are concerned, it's a 7.5 for me, closer to 8 than\nto 7... If you like this kind of movies, you will definitely love it!\n"},
{"review": "\nLone Survivor (2013) is an amazingly crafted film showing many values\nwithin war that are rarely displayed. Typically war films tend to leave\nout that they're good and bad people on both sides of the war-zones,\nnot everyone within such a situation are bad or good, there is good and\nbad in everything. Lone Survivor (2013) shows a story of bravery, and\nat the same time shows great values within human beings that may be\nshown from all people of all nationalities. I'm not a big war film buff\nas I truly disagree with many actions that are forced to take place in\ntimes like that as I love people no matter where they are from or what\nthey believe in; this movie is well put together and I really liked it\na lot. Great acting, great script, and I believe what the film is\ndedicated for is beautiful.\n"},
{"review": "\nThis is a harsh movie, but you already know that with the introduction,\ntaken from some kind of breaking boot camp for seals.<br><br>This is based on real events, that makes it personal in a way and very\nvivid. Three acts is what this movie holds, and director Peter Berg\nmakes sure we know the characters and their lives before heading them\ninto the second act, this is where hell breaks loose, lots of action,\nbullets, explosions etc. going on there. The third act ends it of, it\ndoes however not show every Afghan as a Taliban terrorist, very\nrefreshing and a different ending then what you mind expect. But it\nalso gets a bit to stars and stripes for me, maybe thats the liberal\nEuropean in me talking... never mind that.<br><br>The Scenes seem very real, great action, great explosions and great\nscenery to keep it all together. This is entertaining and you should\nsee it if you like war scenes with all that that entails.\n"},
{"review": "\nWords can't describe how I feel about this movie. I had goosebumps from\nthe start to finish. The symmetry between the Director and the actors\nwas powerful and it showed on the screen. Once they started with navy\nSeals training to the sprint between Dietz and Murphy I knew this was\ngoing to blow my mind. <br><br>I love war movies, Platoon,Thin Red Line were at the top of my list\nwith Private Ryan but this one has replaced them for me anyway. I\nthought all four of the leads were exceptional with Kitsch and Foster\nbeing my personal favorites in this film. Wahlberg at times can be hit\nor miss but I thought this was one of his best performances. <br><br>The Score was spine tingling, I loved the \"Waking up\" musical score\nthat is spread throughout the film and Peter Gabriel's Heroes with the\nreal Navy Seals faces was a terrific way to end it. <br><br>One of my favorite films of this decade and I also loved the extras and\nthe real families. Peter Berg you blew me away\n"},
{"review": "\nLone Survivor is an excellent movie. It is based on a true story, which\nwill make you appreciate the plot more. The pain and terror that these\nSeals went thru will have your heart pounding. If you have seen Black\nHawk Down and consider it one of your favorites, then Lone Survivor\nwill be a new favorite. The movie begins slow at a military base in\nAfghanistan and shows the military lifestyle of the Seals. They show\nclips of the camaraderie and hazing that takes place as well as the\nrelationship with their family in the states. This engages the audience\nand makes the characters human. Once the action begins with that first\nshot fired, hold on because it just keeps going from there. The main\ncharacter played by Mark Wahlberg was a great casting choice. I read\nthe book before the movie came out and when I found out Wahlberg was in\nthe movie as the lone survivor himself, I was excited. He embodied the\ncharacter that my mind created while reading the book. I recommend this\nmovie to any movie goer that is up for some edge of your seat action.\nIt was intensely entertaining.\n"},
{"review": "\nThe movie starts very promising. You get to know the team and what kind\nof mission they are facing, but the fact that almost the entire movie\ngot spoiled in the movie title \"Lone Survivor\" is just sad. The title\nfits, but it ruins the whole movie. When for example the Apache escort\ngunships came, you knew something really bad where going to happen so\nthat the two Navy Seals couldn't go home. The title also spoiled that\nthe main character was going to be the only survivor of the four Seals\nthat were sent on the mission.<br><br>So the lesson this movie should teach Directors: \"Choose your movie\ntitles carefully\"\n"},
{"review": "\nThis movie just topped my all time top 3 WORSE MOVIE EVER list: 1. Lone\nSurvivor 2. Skyline 3. The Grey<br><br>ABSOLUTELY HORRIBLE. I can't believe people make these sort of\nmovies... Enough said, done deal, shame on you Peter Berg.<br><br>And oh, please IMDb find a way to stop paid marketing for movies. It's\nsad. I see it happen more and more; this movie DOES NOT deserve a 7.6\n:(. It doesn't even deserve a 1.<br><br>Apparently people like patriotic robot-like American superheroes\nkilling Taliban bad guys like they are dummies. I need to make up some\nmore text, because there is a 10 lines minimum but I'm not creative\nenough to come up with anything more right now, so you better stop\nreading by now, if this is ever read... lol. Still I had to express the\nawfulness of this movie.\n"},
{"review": "\nMarcus Luttrell, a Navy Seal, and his team set out on a mission to\ncapture or kill notorious Taliban leader Ahmad Shah, in late June 2005.\nAfter running into mountain herders and capturing them, they were left\nwith no choice but to follow their rules of engagement or be\nimprisoned. Now Marcus and his team are left to fight for their lives\nin one of the most valiant efforts of modern warfare. When Peter Berg\ndirects a film and basically a War film you know that he won't\ndisappoint and damn he doesn't Mark Wahlberg gives an extraordinary\nperformance as Marcus Luttrell he is the Lone Survivor and his story is\nreally very inspiring and it totally worked for me it's easily one of\nthe best War Movies since \"We Were Soldiers\".\n"},
{"review": "\nFinally I decided to buy the DVD and to give it a chance. I have to\nadmit that my expectations were met by far. Sorry to describe the\naction scenes similar to a Rambo movie. These sequences are well done.<br><br>I couldn't imagine that the five Navy Seals had to fight against all\nthese Talibans soldiers. Director Peter Berg captured all scenes very\ncredibly. He managed very well the dramatic countdown too that I won't\nto spoil here anymore. Just watch it. It's a worth see. Especially Mark\nWahlberg and the other actors did a great job here. Congratulations to\nall people that made possible to reconstruct this story based on true\nevents. For all victims that died in this dirty war I want to express\nmy respect and that God bless them. Solid 7/10. <br><br>Another one that you shouldn't miss is No Escape.\n"},
{"review": "\nA hard hitting war drama that shows the true nature of brotherhood and\nfriendship that is built and destroyed during war. At the same casting\na light onto the pain of losing friends and brothers. A well shot film\nthat casts the beautiful Afghanistan scenery alongside true events from\nOperation Red Wing. The use of real footage from the gruelling training\nof the elite Navy Seals at the start of the film instantly shows how\nthe film establishes the theme of brotherhood. Individual acting is\nlimited to moaning about injuries, harsh barking of orders and some\njovial banter between comrades but the bond between the soldiers is\nclearly demonstrated inthis film which is the ultimate aim of the film,\nto retell the story of the brave men who died during that fateful\noperation. A touching slideshow of photos of the soldiers who died in\nthe operation to finish the film is a perfect ending to the film.\n"},
{"review": "\nI had read the book and enjoyed it so naturally was excited to see the\nmovie. The movie is not even close to recognizable to what I read in\nthe book! When the seals first run into the 3 Afghan men Marcus'\ncharacter is arguing to keep them alive. In his book he goes into\nlength stating how government dictates rules of engagement and how\npoliticians tie the hands of soldiers! Yet in the movie he is a\nspokesmen for the lives of the enemy. <br><br>Then the soldiers pick off the Afghan soldiers easily, but they take\nbullet after bullet and never seem to bleed out. They even tumble off a\ncliff with one hitting their head on a rock, another slamming his back\ninto a tree yet everyone can get up and keep fighting! It is\nridiculous. This could have been a good movie if the actors looked at\nthe actual material seriously instead of turning it into an 80s action\nflick! Even the background music stunk.\n"},
{"review": "\ni watched this film alone,and enjoyed it, it starts a bit slow, with\nthe usual watching soldiers mucking about on the camp, this i found\nboring, and i was glad i hadn't paid to watch it in the cinema,\neventually the action starts, that's my only real qualm about the film.\nalso i didn't understand what their mission was, but also didn't care,\nas the action is great, lots of shooting, getting shot, breaking bones,\nnasty injuries, the combat sequence was exciting, as always there are\nbits that don't see true, like surely the navy seals would speak some\nafghan? at least enough to greet people, or tell them to put their\nhands up etc..as shouting in English cant be very helpful. the stunts\nare amazing and look very painful, and id say almost no CGI was used,.\nif you like war films, action then you'll like this\n"},
{"review": "\nThe Lone Survivor. And that pretty much sums the film up.<br><br>Some soldiers go on a mission and once the shooting starts, we already\nknow that Mark Wharlburg (I'm sure I'm spelling that wrong) is going to\nlive whilst the others all die.<br><br>So, no real suspense, not much tension, just an hour-long gunfight that\nisn't really all that great and then the film ends.<br><br>Yes, this could win an award for the stupidest title of the year, but\nthat really is about all it has going for it. A very bland,\nmiddle-of-the-road affair and I don't care if it's based on real events\nor not, because it simply wasn't a very good film.\n"},
{"review": "\nI think that this movie for most is probably a wake up call to what our\nwarriors go through everyday but also what our men in special\noperations around the world go through. this movie shows perfectly the\ndifference between what your average civilian has compared to the heart\nthat our warriors have. If you take for example the thought of having\njust you and your three brothers being in the mountains maybe 2 klicks\noutside of a occupied rebel village , have no comms , a down sat phone\nand then having your op be compromised right after your infiltration ,\nthese men had the odds against them from the get go and still undertook\nthis mission shows the love for country like none have ever seen. <br><br>I think the underlying sadness of this movie is that some people will\nsee it as war propaganda and will never support this movie or what the\nmen of operation redwing did. Being a veteran myself this movie will\nalways have a soft spot in my heart and this movie is great because it\ntells a story that otherwise would have never been told.<br><br>Grimwolf\n"},
{"review": "\nTrue stories are always awesome topics for movies. This movie also\nbased on the awesome story. The Red Wings Operation was really sad\nhistory for US military history and these had showed how it was hard to\nfight against Taliban in their land.I want also mention that Eric Bana\nis always good option for acting positive and spirited leaders and in\nthis movie he again did his best. The only weak point of the work is\nmaybe some fighting episodes were so exaggerated, especially rolling\ndowns in couple times. I strongly recommend for biography and history\nlovers. I always prefer scenarios which are based on true stories like\nLone Survivor and could say that this movie met my expectations. Thanks\nto all cast and crew for this perfect work.\n"},
{"review": "\nif I was younger, I will go to the Seal training, it's hell, and not\neverybody can go through but after this movie I wanted to sign in even\nmore.<br><br>the movie is about a small part of Red Wings Op. but, not the easiest\none, far from it and the only thing which bothers me is, why they\ndidn't tie up the 3 guys then get the call or tried until they find a\nplace high enough and someone says ''yep, we will be there in 20 min to\npick you up'', released the 3 Muslims after ward, will never know<br><br>this is one of the best since Black Hawk Down, all the cast gives a\nsuperb performance and there are the stunts which are unbelievable,\nthey (the real Seals) should have died almost 10 times before finally\nbeing shot down. <br><br>It was a great story to tell, about cool, committed and proud people,\nthe cherry on the cake is P. Berg, who did a stunning job as always, if\nyou've liked the Kingdom you will adore this movie like I do, I've seen\nit many times now and still good<br><br>well it's a must watch\n"},
{"review": "\nWell to start of the beginning of the movie was long and tedious. The\nbiggest flaw which came early on in the movie was that they could've\njust taken the 3 taliban sheep herders up the mountain with them. but\nthis wasn't one of the 3! options. Maybe this was intended by the\nproducers to show how pressure can compromise the logical thinking\nprocess of the American soldier. But i think its fair to say it\nwould've made the movie a lot worse if they had done so. If America was\nmy hometown i would have sued the people responsible for making this\nmovie cause nothing can compensate for the time i lost on this movie. I\nhave to go to bed now slightly annoyed that i didn't do something else\ninstead.<br><br>2 for effort\n"},
{"review": "\nIf you love action movies and don't care for much else you might love\nthis film. I didn't.<br><br>The premise is really interesting and, being a true story, if you know\nwhat happens you won't be entirely disappointed by watching it to the\nend. As a film, it falls down with an absence of any character\ndevelopment at all - we have no reason to care for the characters and\nwe don't know how strong their relationships with each other are.\nThere's no reason to actually care for any of them.<br><br>The film focuses on heavy, extended action sequences for its\nentertainment value. Its entertaining enough but, ultimately, the film\nfails to be anywhere near as it could have been because of a lack of\nfocus on story telling and character development. 5/10 from me\n"},
{"review": "\nRead the credits, it's based on a true story. Every second of the movie\nis not exactly what happened. The sad thing is that there are still\nindividuals who question and re-question the validity and realism of\nmovies. Take a stroll through combat lane sometime and come back and\nrelive your closest friends who would die for You, and recount every\nsecond of the worst day of your life for a book or a movie you never\nplanned on writing except to honor the best people on this earth. If\nyou haven't done it don't talk like you have. Show some respect. Those\nwere real people who fought and died for what 95% of you would never\ndo. Try looking at the bigger picture. In another review some kid\ncomplained about how the number of enemy dead didn't match the book,\nfor God sakes. Thanks,from a vet.\n"},
{"review": "\nI hate war movies. Always brimming with forced patriotism and the fact\nthat good ol u.s. Of f****** a Will remain the ultimate force. Or the\nstandard scenarios jamming Com's etc etc. Or superhuman soldiers. <br><br>And yes this movies has that in abundance. And i mean its oozing with\nit right from the get go. But i hear you think why give it a 10 out of\n10. This movie is amazing this i an emotional roller coaster. I found\nmyself gripping the sofa so hard that i got cramps. I felt admiration,\nastonishment, fear, hate, sympathy, disbelieve and pure excitement in\none movie. What a ride omg in my top ten. And yes i hate war flicks.\nWatch it please watch it.\n"},
{"review": "\nI am a vegetable! I wanna be in the field! Hoo-Raa! I am gonna give\nthis movie TEN out of TEN! I can take it! Am I ready to give up? Hell\nNO! Have I reached my limit? Hell NO! I am gonna do this! You can drop\nout but I am gonna do this! You can drop out at any moment in the movie\nand go home! Am I gonna drop out and go home? Hell NO! What am I? I am\na vegetable! Where do I wanna be? I wanna be in the field? What am I\ngonna do in the field? I am gonna give this movie TEN out of TEN!\nHoo-Raa! Hoooooly night... Siiiilent night...<br><br>You gonna have to force yourself son! I know you have all it takes to\nsit this on out to the end! Because this is what it's all about! Taking\nit to the end! No Fear son! They are not gonna bore you to death with\nlame propaganda! You will make it! You will come home and tell your\nchildren about it! And be proud as Hell!\n"},
{"review": "\nI really liked this movie, but they should have come up with a\ndifferent name because it spoils the entire movie. From the start, you\nknow only one of the Seals is going to make it.<br><br>Anyways the story takes place in Afghanistan where 4 Seals are sent on\na mission in the mountains to take out a Taliban leader. Their mission\nis compromised when 3 goat herders stumble onto them. My biggest\nquestion is, why didn't they just leave them tied up till the mission\nwas over, and then release them. Or why not wait until dark, knock all\n3 out, untie them, then get out of there before they could warn the\nTaliban. The solution they chose was stupid on their part.<br><br>Anyways, soon the Seals are surrounded and a thrilling gun fight\nensues. It's very disturbing to think anyone in real life being in that\nsituation. Also, I find it hard to believe that the villagers would\nhelp an American, but maybe that part is true. I guess they thought the\nTaliban was worse.<br><br>FINAL VERDICT: Good story, intense action, definitely check it out.\n"},
{"review": "\nThe gripping \"Lone Survivor\" has that \"eye of the tiger\" as a surreal\ncinematic experience that will keep you on the edge of your seat. This\nadapted true story stars Mark Wahlberg as Navy Seal Marcus Luttrell who\nis sent on a mission with his three Seal compadres to kill or capture\nTabilan leader Ahmad Shad. When the mission turns into a nightmarish\nexperience, Marcus and company have to fight for their lives by\ncombating a full army of Tabilans. Director Peter Berg, who has not\nbeen much of a Berger Directorial King in his past work, does surprise\nhere by brilliantly capturing the authenticity of the misery of war\nthrough Marcus' &amp; Co. unforgettable experience. Wahlberg was on target\nas Marcus, and Ben Foster also fostered in nicely with his work as Navy\nSeal Matt \"Axe\" Axelson. There are many scenes that are a bit too\nheavy-handed for some viewers, but \"Lone Survivor\" is a must-see and a\ntrue valiant lesson of overcoming insurmountable odds. And I don't\nthink I am the lone critic (or pseudo-critic better stated) that has\nthe same sentiment. **** Excellent\n"},
{"review": "\nLone Survivor is not a movie where you go on a killing spree and become\nvictorious. It is an engaging real incident about the life of a navy\nseal. You will see how rough things get and the importance of\nbrotherhood and kindness that bring so much meaning to life. The scenic\nviews make you forget that you are watching a war movie. The camera\nwork and the details of the incident are clean and realistic. The\nacting is amazing.<br><br>Two hours of engaging replication of a real life incident under\ngruesome condition of fight, sacrifice, kindness, and recovery.A must\nwatch movie and stands up straight against all other war movies in the\npast.\n"},
{"review": "\nWhen you thought you couldn't have been any more proud of our troops,\nthis movie will change everything for you. This movie is definitely not\nfor people who doesn't like blood. But this is a story that everyone\nshould know and watch. It is very well written and I thought that the\nrun time was very good. It didn't not drag out too long and the ending\nwas masterful. I shed tears throughout the whole movie. It keeps you so\nfocused in the movie you did not want to leave your seat. <br><br>I would definitely recommend this to every one that I know. A excellent\nmovie. The sacrifice that these men have went through is just\nunspeakable. I cannot preach this movie more. I don't even know how\nthey would have told a better story, if this was based on a true story,\nthen what they have recaptured is unremarkable. I can't even pin a weak\nstory plot in the movie the actors were ALL fantastic.\n"},
{"review": "\nI can't see why the film was ever made.<br><br>I enjoyed the whole \"Afgans can be friends\" message however, 4 seals\nthe supposed elite can't workout that the solution to the initial\npuzzle of the goat herders was to take them up the mountain until they\ngot some radio signal. <br><br>Please don't think I am an army hater, far from it, but its a film\nabout really poor decision making and every time I talk about the film\nI just can't get over the blindly obvious solution to the problem. They\nthought of 3 options, kill them, tie them up or let them go.<br><br>A really poor advert for the military brain.\n"},
{"review": "\nproduction and acting were fine ---but if this is based on actual\nevents it speaks volumes on bad decisions at all levels--all that fancy\nhi-tech gear,all that training,the brutal weeding out--and it produces\n'warriors' who are concerned about how they would be portrayed on\nCNN--I played that part over--that and 'rules of engagement'--the ROE\ncould not have been designed better for failure if they had been\ncrafted by the enemy--it doesn't make us morally superior,or better,it\njust helps the enemy kill us,defeat us and cost us in every way.The\nopening scene with the big knife in the village--check out dozens of\nsimilar events on live leak--in reality it is not done the way it was\nhalf shown in this movie--who researched that scene? A bad start--down\nhill from there--false peak notwithstanding.\n"},
{"review": "\nThis isn't all about the movie review. I don't really understand some\npeople on here,why would you rate this kind of a movie below 7,really i\nknow everyone has its opinion on any movie but this is bad. I was\nreading peoples review and it was so sad what some people had to say.\nFirstly before you watch a movie like this check out the title,i first\nheard of this movie when i saw it on mark wahlberg's facebook page,then\nsomeone told me to watch the movie BC it was so touching. At first i\nthought it was a war movie but i was wrong i am a American wanna BC of\nthe great things that happens in America and BC of the things American\nwould do to protect its country this movie is based on a real life\nstory and thats what makes it unfair they were willing to die for\nanything as long as it matters to their country i respect America the\none thing that puzzles me about the movie is what happened to the man\nthey were sent to kill/capture in real life and what happened to that\nAfghanistan man and son that helped wahlberg?? If you got the answers\nplease tweet it to me on twitter @iamowomizz\n"},
{"review": "\nJust huge! Digest of frustration and joy! The actors play incredibly\nwell in a breathtaking scenario! Mark plays incredibly well and begins\nto have a nice array of films to his credit! Few times but unlikely all\nperfectly done!<br><br>ENJOY I really love this movie!<br><br>A lovely movie with lovely actors! Please give more movies to Mark!\nENJOOOOOOOY A little bit long but not too much Easy to watch with\nfamily or friends! I give him 9 because it's not the perfect movie but\nit was very pleasant! Il love all the Mark's movie a lot and i want him\nto continue how he plays!\n"},
{"review": "\nOfficial, the Taliban are the new Hollywood Nazis. Swarms of the bad\nguys eager to blindly offer themselves up as cannon fodder. Dozens of\nthe critters, one after the other stupidly walking out from behind\ncover to offer themselves up in the memory of John Wayne and Ronald\nReagan.<br><br>One shot is all it takes for these mortal bad guys, yet are heroes take\nshot after shot and refuse to bow out of the fight. Jumping down\nmountains and over cliffs Rambo style.<br><br>As Bill Hicks once said, \"go to sleep America, here, watch American\nGladiators\".\n"},
{"review": "\nThis is not a realistic war movie, although it is probably more\nrealistic than Bravo Two Zero, which a lot of other reviewers compare\nthis movie with. In Bravo Two Zero an intrepid band of SAS soldiers\ndecide, unlike their other squadron's teams, to leave their vehicle's\nbehind, and as a result, suffer for it. Somehow they take on almost the\nentire Iraqi army in flat, desert terrain, killing many without\nreceiving a single wound themselves. At least in Lone Survivor the\ntruth/Story isn't stretched as far, although they do seem to be immune\nfrom injury when falling down cliffs. Lone Survivor is a very well\nmade, good guys versus the baddies with the cavalry coming to the\nrescue in the end. I'm not sure how the cavalry could work out the\ndifference between the good and bad guys? This movie is no way as bad\nas a lot of reviews have made it out. It is entertaining, great on a\nbig screen with good sound, just don't expect a documentary.\n"},
{"review": "\nI don't normally review movies because they are so subjective, but I\nreally felt like I had to review this one. I felt like my heart had\nbeen ripped out and I was exhausted when it was over. The actors did an\nexcellent job of making you care about them even though you knew most\nof them didn't make it. The action sequences were brutal and realistic.\nIt captured the hardships of the Afghan people and the humanity of the\nnon-Taliban people who are driven to help anyone in need. The movie was\nraw and emotional. It ranks as one of top movies I've seen. The bonus\nfeatures were worth watching as well. The interviews with the families\nof the fallen and hearing that they felt the movie was respectful to\nthe memories also made the film even more endearing.\n"},
{"review": "\nThe movie starts with a promise and as it progresses it becomes more\nand more funny.So much of training,endurance and all and when they are\nin a mission they even didn't have a back up plan! Too much show\nbusiness of greatness of them.They just let go the goat-herders and\nwalked back with a slow pace as if they were going for picnic! so so\ngreat they are that they even didn't tied them up and continue what\nthey wanted to do! It seems that Taliban kids are better with guns!\nFinally it was hilarious how the whole team were diving on the rocks\nfrom the slope like they were diving in the swimming pool,breaking\nthere bones,loosing guns,medipack.At this point my brain started\ndenying the movie at such a level that I shut it down and started\nwriting this.Why I rated 5 is the camera,gun and sound. Please don't\ntell me the rest of the movie, I don't want to waste more of my\ntime@#%^^ Give me back my one hour.\n"},
{"review": "\nA routine war movie well acted and directed but not particularly\ninteresting nor spectacular, after all predictable and too rhetorical.\nA tribute to the soldiers and their families, certainly, but if you are\nnot among them you may choose to watch something else. I read other\nreviews comparing this movie to \"Saving Private Ryan\"... it was\nmisleading in my opinion. This movie reminds me more Black Hawk Down\nbut it is far less spectacular and gripping. Battles scenes are quite\nrealistic but the whole story is built around a small episode after all\n(big enough for those who took part in it, but what about the others?).\nIf you like war movies give it a try but don't expect too much or you\nwill end disappointed.\n"},
{"review": "\nFrom the get-go, Lone Survivor grabs the viewer with an entertaining\nand supposedly accurate portrayal of life inside the lives of US Navy\nSEALs when not in the field. Great chemistry from its team of actors\nimmediately makes for entertaining wordplay and dialogue. The immediate\ndoes of 'Merica will push the viewer towards a welcomed patriotic feel\nfor the rest of the film. From there the action, cinematography, and\nmusical score are all impressive and entertaining. Keeping the viewer\nengaged by never slowing down, the fast-paced thrill ride known as Lone\nSurvivor will make you feel patriotic and entertained. Thoroughly\nenjoyed the musical score as a supplement to a very entertaining War\nmovie.\n"},
{"review": "\nMark Wahlberg wasn't as good as I was expecting and any of the other\ncast members could have played Luttrell better. I have no doubt a lot\nof this movie is fictional to keep the audience entertained BUT this\njust was too over the top. This movie shows that all the technology and\ntraining in the world just can't beat true will and toughness. These\ntowel heads are below 3rd world yet they kicked our ass!! I thought it\nwas funny to see Luttrell in the movie and he actually signed off on\nthis flick? Nothing like a \"Saving Private Ryan\". Decent movie but I\ngive it a C+ for effort. I didn't like how the ending had the American\nmilitary coming to the rescue and the beginning of the movie was as\nfake as they come! Luttrell NEVER was about to die on a chopper.\n"},
{"review": "\nI wanted to see an Action/War Movie. The trailer of \"Lone Survivor\" Was\namazing so I watched the Movie. This Movie was one of the finest/Best\nmovie I Ever Saw. If you have time, Watch this movie.<br><br>What happens in the movie (Little Spoiler): 4 Americans are fighting\nagainst far more Taliban. They saw each other as friends. They saw Each\nother Die. One man can change the world.<br><br>The Film is emotional and full of excitement.<br><br>This movie is a 4 / 5 Star Movie<br><br>Have fun Watching It, And write your review :)<br><br>JD.\n"},
{"review": "\nI went to see this movie only knowing two things: <br><br>1: It's based on a true story.<br><br>2: It's from the director of \"Battleship\".<br><br>Knowing those two facts, I kept an open mind as to how the story would\nbe told, and boy was I disappointed. It lacked the substance that other\nwar/combat films (Saving Private Ryan, Thin Red Line, Black Hawk Down,\nand American Sniper) had. It tried, and fell flat.<br><br>The story of Lone Survivor in a nutshell is a very tragic story of very\nbrave men who made the ultimate sacrifice with only one man left alive.\nA skilled filmmaker should have had no problem conveying that to the\nscreen. This one did with weak character development, poor pacing, and\n(what looked like to me) a glorification of violence.<br><br>I'm not bad mouthing the actual events that happened to these brave\nmen. All I'm really saying is, these men deserved a better film than\nthis.\n"},
{"review": "\nWhy do these 40-somethings need to be the star hero in action films\nabout young athletic men? Fat face walberg has no business being in\nthat group. Those guys were racing around with washboard stomachs, and\nout rolls blimp walberg in baggy clothes. Yeah we get it, you're the\nmoney man behind the film, mark. <br><br>Come on, Mark. Don't be another bruce willis. Tom cruise. Evolve your\nroles and for god's sake. . .if you insist on playing a soldier at\nleast drop the french fries and go back on steroids for a few months\nprior. It's about the same as Stallone honestly, but at least you have\nto give Sly respect for keeping himself in shape, even into his 60's.\nWalberg is a marshmallow, disgraceful.\n"},
{"review": "\nnot a lot of effort at all to make this realistic the portrayal of\nspecial forces was flabbergasting and to be frank they deserved more to\nbe called speshul feces. The film is neither on purpose over the top\nlike the expendable or harrowingly accurate like saving private Ryan or\nthe hurt locker. The effort put into making this realistic was\natrocious in one scene you see uncamoflaged men \"hiding\" under pine\ntrees that offer very little in the way of protection from being\ndiscovered and indeed these supposedly elite troops come across as\ncomplete morons. This and the action sequences are also pretty poor.\nI'm a massive fan of Mark Wahlberg and I was very disappointed with\nthis it just seemed so half arsed.\n"},
{"review": "\nall i can say is ts a pity IMDb doesn't have a 0/10 rating or i would\nhave gave it that.the film really does make Rambo look realistic.<br><br>i watched the film with 3 mates pretty much baked and even in that\ninebriated state did it make the film either believable or enjoyable.if\nwar porn is your thing and your from the USA and suffer from a deluded\nform of patriotism then u might like it but for normal people its just\ntoo hard to swallow.As stated in other reviews how many falls off cliff\nfaces and bullets can a person survive.if you want to watch a descent\nfilm about the US military watch \"the boys in company C\".This is one\nfilm to definitely avoid!!\n"},
{"review": "\nThinking of going to Lone Survivor? Don't. An embarrassing, travesty.\nHollywood owed these true-life heroes more than a poorly acted,\ncharacterless, shaky-cam version of goodguy/badguy. Pathetic.<br><br>Location looked like Rocky Mountains not Afghanistan. Wasn't even good\nif taken as a Docu-drama. No character detail. Even the fighting scenes\n- a Hollywood staple seemed lame.<br><br>Want a real movie about Afghanistan? Watch Restrepo. Want a Great War\nmovie with epic characterization and great screenplay? Watch Boys In\nCompany C. <br><br>Don't support this Hollywood ripoff. They've tied this piece of dung to\nTrue American Heroes just to make a buck. A complete travesty.\n"},
{"review": "\nBeside a very nice movie with a lot of good scene's and acting and also\na perfect sound mixing &amp; editing we see the reality of war. The reality\nof war is pain, cruelty, kill, fear and at the end death. We can now\njust imagine a world without war and fight. people are dying everyday\nin everywhere in earth with no mercy and defense. soldier's are\nfighting for nothing because they are not even in they're homeland and\ncountry. they are fighting and dying far from they're house and\nfamily's because of nothing. How hard it is for the mother's and wife's\nwho are waiting for they're son's and husband's? how hard it is for the\nmen and women who are dying far from they're loved ones and the last\nthing they are going to see is fire and blood?<br><br>I hope with all of my heart that one day we see all soldier's get back\nhome safe and healthy and there be PEACE IN EARTH.\n"},
{"review": "\nWow. What a horrendous movie. The tali-ban leader they are trying to\nkill is said to kill 20 to 30 American soldiers per week so you would\nthink that that would mean he is a capable leader and warrior. That's\nobviously not the case as shown at the end of the movie. The final\nscene is when all the tali-ban bad guys attack the village by running\nthrough open ground in the middle of the day and getting wasted by the\nvillagers and the American military. That didn't happen and I have no\nproblem with the producers deciding to put on something that didn't\nhappen. I do have a problem when the movie makers finish the movie with\na pathetic, 1 minute scene of a bunch of bad guys getting wasted out in\nthe open in the middle of the day. To the movie makers out there,\nplease listen. I am not that stupid. Neither are a lot of my peers who\ngo to movies. Oh sorry, I forgot about the young crowd who make up most\nof your audience. Go ahead and keep making movies for that crowd. Let\nme know when you can make a real movie.\n"},
{"review": "\nThis film somehow managed to fly under the radar. There is a quality to\nit that puts it into the realms of Braveheart. War propaganda? Perhaps.\nIf the story had roles swapped would it still be as good? Probably not.<br><br>War is the by product of mans ego. The brutality has been captured to\nportray the horror of what those that put their lives on the line go\nthrough. More effective than American Sniper the essence of four men's\nbattle, from start to finish, to stay alive and save their 'brothers'\nahead of themselves is tough to watch. <br><br>A true story which is unrelenting, sometimes difficult to relate with\nand thoroughly well put together and as realistic as it gets.\n"},
{"review": "\nThe movie truly is the best war film to have come out in years. The\nbest part about the film is its deliverance of heartfelt glory. Loved\nit. If you are looking for a movie that is an exact enactment of the\ntrue war, it becomes a must watch. No matter what your nationality is,\nonce through, you will have a sense of respect for the soldiers in war.\nThere are a few scenes so brilliantly executed, that my eyes teared up.\nUnlike the usual American war films, the movie wears a shade of\nrealism. Michael Murphy though not the highlight of the film, became a\nhero for me. In just a few words- A brilliant piece of art to have come\nout in years.\n"},
{"review": "\nmovie making and the sheer high performance of today's military\nweapons. A gut wrenching, harrowing experience to witness in a movie\ntheater, let alone to live through or not live through. Lone Survivor's\ndirecting, writing, acting and production are first rate and show the\nothers of Hollywood that movies of this savagery can be entertaining,\nyes entertaining and informational. I rarely vote a movie a 10 unless\nit has truly moved me to write a review of it giving it terrific\naccolades. Mark Walberg has long been a favorite of mine in these type\nof action movies but I believe I would have given this movie a 10 even\nif he hadn't been in the lead. See this movie to get a genuine feel for\nwhat was and is going on over there. Yes, I know there was the Green\nZone and others but I have never given any of those a 10. See this\nmovie - its an experience.\n"},
{"review": "\nLone Survivor is a great movie with a very well developed storyline and\na very talented cast.The movie is very intense almost from the get\ngo,you are following these soldiers in a dangerous area and are really\nhoping they will be safe.This is certainly one of Mark Wahlberg's most\nimpressive performances to date,quite possibly his best,he is a very\nhit and miss actor,sometimes he's a great ,other times he's awful,but\nin this he is certainly outstanding,he really got in to his character\nand I really feel like he became his character,he wasn't just\nacting.Lone Survivor is a great movie that I would recommend to anyone\nlooking for a good action or war film. <br><br>A group of soldiers set out on a dangerous and risky mission to find\nand possibly kill Taliban leader Ahmad Shah. <br><br>Best Performance: Mark Wahlberg Worst Performance: Alexander Ludwig\n"},
{"review": "\nI am a big fan of Peter Berg. I like his Rundown, The Kingdom,\nBattleship, and yes even his role in that Corky Romano film. But LS is\njust a let-down. Plot: what plot? A bunch of guys go in, most killed,\nwith a lone survivor, the end. Yes there is gun fight, camaraderie,\nexplosions, limbs, etc, but they all fall into this very linear and\nsimple plot. You can see these things in Hellraiser movies, with a more\ncomplex story. Acting: they are already dressed like soldiers, with\nmud/blood/ammo on them. There is absolutely zero character development.\nStory: see plot. As long as they are not laughing and just acting hurt,\nit's sufficient acting for the premise. Effects: have you seen Saving\nPrivate Ryan? This is not better. Overall: this is a very disappointing\nfilm from PB. He has done better and more entertaining films. I am not\ncertain why this movie got such a high rating at IMDb. Maybe some\nwriters here are paid to praise. Due to the lack of plot here, while\nthe actors in it did their best to act, this movie is a mere chapter of\nany war/shooting movie out there.\n"},
{"review": "\nwasn't sure about this film before watching, thought it might be a bit\nof a slow drama about how caring and brave US soldiers are in the face\nof adversity. And it's a true story so however the film depicts them,\nit must be true..<br><br>In fact this film is about a group of soldiers getting shot the crap\nout of for over and hour. where in most films two groups of people\nshoot at each other, and bullets fly off the ground and rocks, but\nunless they land a fatal blow, people generally don't get hit, pretty\nmuch the opposite here, they get hit.. a lot. I mean they really did\nnot have a good day up on that hill. And the hero of it all, was a\nlocal villager. <br><br>Was a good film, and the slideshow of the end of the real people\ndepicted in the film was good, especially the one of the 'lone\nsurvivor' and the villager that saved him.\n"},
{"review": "\nThis portrayal of 'Marcus Luttrell' is interesting viewing with any\nmovie about human spirit overcoming the odds, being inspirational to\nwatch. However many reviews this film has got are flattering to say the\nleast. As a war movie, this hardly compares to 'Saving Private Ryan' or\n'Born on the Fourth of July' and as a biopic, it's obvious this has\nbeen largely exaggerated. The cast is good and they deliver based on\nwhat they are given, but the film ignores them as people and fails to\nallow the viewer to empathise with their sacrifice and the role of the\nvillagers is also largely ignored. Without giving too much away, I hope\nwhen people watch this movie, they are able to recognise who the real\nheroes were. That's if we can get over our own prejudice.\n"},
{"review": "\nLone Survivor <br><br>The key to surviving in the wilderness is to avoid going into the\nwilderness in the first place.<br><br>Unfortunately, for the Navy SEALs in this action movie, it's part of\ntheir job.<br><br>When a Taliban leader is located in a remote region of Afghanistan,\nsnipers Marcus Luttrell (Mark Wahlberg) and Matthew Axelson (Ben\nFoster), along with spotters Danny Dietz (Emile Hirsch) and Michael P.\nMurphy (Taylor Kitsch), are dispatched to a nearby mountain range.<br><br>Waiting for a shot, the team encounters goat herders. Torn between\nkilling them and freeing them, Luttrell eventually let's them go.<br><br>Moments later, they're attacked by their targets. Outnumbered and\nout-gunned, the team makes their last stand.<br><br>Based on the best-selling biography, this intensely violent and\nemotionally draining adaptation is a shocking example of military\nineptitude, and the senseless valor it can produce.<br><br>Besides, when pinned down by Islamic fundamentalist, it's time to start\npraying to Allah. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nA good word to summarise this movie is the word \"intense\". This must be\none of the most intense movies I have watched in my life. Period. <br><br>What makes this movie good in itself is psychological. The narrative of\nbeing surrounded by enemies, outnumbered, and out-firepowered compels\nus to watch the movie's developments intensively. Furthermore, since\nthis movie is based on a true story, it makes the whole narration even\nmore engaging. What you really need to give to this movie is the sheer\nminute to minute actions, which the protagonists are trying to fight\ntheir out. There is simply no let up to the intense level. What I am\nsaying is not just some mindless shootings in movies that perpetuate\nfor the reason of only prolonging the shooting scenes. But moment to\nmoment attention captivate actions. <br><br>Please watch it and you will know how intense this movie can be.\n"},
{"review": "\nThe effects and movie itself is very good. you see much fast scenes\nwith violence but its not that hard. except the scene with the knife.\nthe characters are hollow and the story itself is slow until half of\nthe movie. i did expect it to start right at the beginning. it surely\nis a military propaganda movie with a lot of good sponsors. the story\nis tragic, but i think the real hero is not the soldier, its the\nAfghani who rescues him. you see him about 1-2 minutes in the movie and\nat the very end, you see a picture of him. without the story about the\nAfghani, it's just a simple action/war movie like we all have seen\nenough.\n"},
{"review": "\nRealistic,Touching,Brutal n a Well made War film.A Soulful tribute to\nthe USA SEAL Force members who led the Operation Red Wings regarding\nthe USA- Taliban war.The most notable n appreciable part of this film\nis it showed some good shades of the Afghans.Moreover their 2000 years\nold code of honor called Pashtunwali n most remarkably their daily\nstruggle against the Terrorist Talibani troops. Kudos to director Peter\nBerg n the whole cast n crew of the film.Mark Wahlberg is the obvious\nchoice for a war film.And Its not the exceptional one too.As usual,he\ngave his best.Eric Bana is always a pleasure on screen.Nice Movie.Treat\nto Watch.\n"},
{"review": "\nI Went into this film with no expectations, just a spur of the moment\nthing with friends (We flipped a coin between this, and RoboCop.) It\ntries to be a black hawk down style military true story survival film,\nbut reaches neither the levels of emotion, nor action of that film.\nAdmittedly, I hadn't heard of this story beforehand, but some parts are\njust far too unbelievable, lack of continuity, tired clichés, bad\ndialogue and lack of character development or investment, makes it seem\nan empty action flick, instead of what it should have been. However,\nthere are good parts to it, the action sequences can sometimes work,\nand the tension created works well. Overall I just felt, like I'd seen\nit all before, just this wasn't done as well and no reason to feel\nanything for the characters. I felt it should have been an emotional\npersonal story, when really, it just turned into a generic military\nfilm\n"},
{"review": "\nHaving read the book in anticipation of the films release I have to say\nthere are many differences between the two versions Please read the\nbook it is actually far more exciting and has not been changed to fit\nin with the budget constraints of the films backers. I wholeheartedly\nadmire the courage of these men and there comrades still serving ,Make\nno mistake about the fact that they are highly trained warriors doing a\nvery difficult role in a highly dangerous world. I really would not\nlike to elaborate on this but an example of this arises when the\nvillagers protected Marcus from the Taliban due to an ancient custom\n.Without the strength of these people and their doggedness to follow\nthis code Marcus would have been handed in for execution,<br><br>The film mentions this only in one line on the screen just before the\ncredits roll . This is explained far better in the book I do not want\nto name any specific scenes where I can explain this further so please\ngo see and enjoy the film for yourself\n"},
{"review": "\nEverything in the movie was somewhat in sync with the book...then as\nthe scene fades to darkness and Luttrell is rescued, my jaw just\ndropped as to the final events of the movie. Please, please, please\nread the book and get the facts straight from Luttrell, not Hollywood.\nThere was no violent ending to Luttrell's rescue as it was depicted in\nthe final scenes of the movie. <br><br>Much respect to the true heroes who died during Operation Redwing, but\nI do not have any respect for Hollywood and their poor portrayal of a\ngreat story of survivalism and heroism. Again, please, please, please\nread the book. \"Based on a True Story\" movies are not always great\nexamples of what actually happened.\n"},
{"review": "\nFor the first 45-60 minutes, I enjoyed the well-played look and feel of\nan elite military culture - the compound, the camaraderie, the language\nall felt realistic and captivated me. <br><br>The attempts to humanize the characters were weak and lazy. Tropic\nThunder actually came to mind a few times, with the cliché one-liners.\nThere wasn't any attachment to the characters that forced me to cling\nto the heroes of the movie. Even the anti-heroes, the Afghans, had no\nsoul or objective whatsoever, and I really found it to be pro-American\nand devoid of any plot depth in that regard. I would cringe in\nembarrassment at this movie in about 50 years, I'm sure.<br><br>I wanted this film to be challenging. It began as though it was going\nto raise some serious dialogue about war and civilization, but it ended\nup being a shoot-out action hero sequence that NEVER ENDED.<br><br>Do I really even need to tell you how it ended?\n"},
{"review": "\nIf Hollywood mirrors the development of US society, then there is a\nfrightful thing brooding in the US. Battleship, the Expendables 1\nthrough x and now this lone survivor show very much respect for the\nheroism and valor of persons whose primary occupation is killing other\npeople without giving it too much of a thought. Why is a Talibanleader\na bad guy when he kills 20 marines? What were those marines doing there\nin the first place. Following orders, just as these navy seals were\njust following orders. It's not OK in the US to criticize the poor guys\nfollowing orders. You must 'support our troops'. This film shows a\nTriumph des Willens. And that is quite scary.\n"},
{"review": "\nMurican soldier never give up never surenndar, he immortal, fall of\ncliff no problem m8, stands up noscopes 3 Talibans, climbs cliff, calls\nbase, GG.<br><br>Taliban use AK - Russian weapon suck in CoD, so it suck in movie, m4\nkills all Taliban, GG<br><br>4 Muricans behind 2x2 rock &gt; 200 Taliban soldiers shooting nonstop with\nRPG's and AK... maybe they should buy American gun first!<br><br>Very touch I cry ervitim!<br><br>Murica the bestestest sniparz NA and Talibans suck in call of duty -\n10/10 IGN\n"},
{"review": "\nThis film could have been so much more, yet it falls short on so many\npoints. Real Navy SEALS these guys ain't.<br><br>I highly suggest you read the book 'Lone Survivor' by Marcus Luttrell\nif you want to know what really happened and get a real feel of being\nthere. It will grip you 100 x more than this film will &amp; will also fill\nin the many facts left out of the story; the biggest one being the\nhorrendous chapter of him surviving on his own against all odds,\nsurrounded by Taliban, badly wounded, yet continuing to fight on &amp; kill\nthe enemy, until he was finally rescued.<br><br>This film fails to incite any emotion on any level. In many ways, this\nfilm seems to be just 'going through the motions' and I honestly think\nI could have easily fallen asleep through it.\n"},
{"review": "\nI did enjoy the movie. Very likable actors in a suspenseful situation\nwith a lot of action. Too much action, in fact, as it started to feel\nlike one of those drawn out fights where you are tempted to fast\nforward. Theses guys put Superman to shame as to how they can keep\nmoving after numerous wounds and falls that should have broken every\nbone in their bodies. The attempt to show the Seals as superhuman with\na strong ethical soul was a bit overdone. The biggest fault was their\ndecision to let the goat herders go. They had other options to avoid\nkilling them while allowing themselves to remain undiscovered. But I\nthink the desire by the writer/director to make a point led to the\ndecision. Besides, they were going to die anyway, why not make them\nmartyrs.\n"},
{"review": "\nAn excellent portrayal of, for the most part, evidence based events\nbestows upon this film a dignity seldom achieved in war films.\nFurthermore, the integrity of the cast and director make for a very\nworthy and honourable tribute<br><br>The DVD version contains the 'special features' in which considerable\nhard evidence is given to substantiate the main thrust of the story.\nClearly some review contributors here would benefit from watching this\nor doing some research here for example:\nhttp://www.imdb.com/character/ch0318799/bio<br><br>I believe this film will become accepted as one of the finest war films\never made and in my almost 70 years of life I have seen a lot of them.\nLike many, I have been fascinated by the contradictions in human nature\nthat surface during the extreme circumstances of war. I do not have to\nagree with the reasons for war to acknowledge the dedication, courage\nand single-mindedness of individuals who rise above the norm.Nor am I\nrequired to make political points off their sense of duty.\n"},
{"review": "\nNo offense to Navy officers who lost their lives for their country. I\nrespect them dearly. I speak only for the movie as an art form.<br><br>I think the movie is another Hollywood bubble. Visually stunning but\ntells no story, and it is forgettable. The reviews I read mostly about\nhow it is accurate and how the movie awesome. I do not watch movies for\ntheir accuracy. I watch documentaries for that. <br><br>Many characters have not had time to be developed. Main four\ncharacters, they do not have enough screen time to explain their\nintension. They are just soldiers and they do what they are trained\nfor. They go, they fight, they die. This is the story. I would rather\nlearn who they are than how they died. I think director should have\nfocused on character development, instead he spent an hour on how they\njumped, how they got shot, how they killed, and be killed. It was just\ncheap story telling. I only liked the beginning (how they are trained)\nand the end (Pashtunwali).\n"},
{"review": "\nIf you have seen Hurtlocker, Zero Dark Thirty, or Private Ryan then you\nunderstand what these soldiers are experiencing or sacrificing their\ntime and energy everyday in war zones in order to store peace and\nharmony and protect the innocent at all times. This film depicts the\nimportance of U.S military interference in the Middle East.<br><br>The movie conjures up all sorts of feelings, and great sympathy towards\nall the fallen soldiers. Since the movie is based on a true story it is\neven more shocking and if one imagines how authentic this film is I am\nsure that you also get shivers.. The film posthumously respects these\nsoldiers who have gone through hell in order to complete the mission,\neven if it costs their life.<br><br>It is a must watch, it raises awareness and respect towards soldiers.<br><br>Thanks for taking time reading this review! BD\n"},
{"review": "\n(Spoilers)<br><br>OK, but not great, modern war story. The band of brothers aspect was\ngood but a touch overdone, and is nothing new. Plus, the first few\nscenes of the movie seem full of empty sentimentality. <br><br>The first half of the movie, is on the surface, about heroism and\ncamaraderie. However, more than this, it is about military\nincompetence. The overly complex mission, so complex any small detail,\neg loss of communications, can derail it. The failure to terminate a\nmajor threat to the mission. The hung-ho, uncoordinated rescue attempt.<br><br>The first half was actually somewhat irritating, as it seemed to value\nheroism over good planning and prudent decision-making.<br><br>This is redeemed somewhat by the second half. Here it is a movie about\nsurvival, grace, generosity and kindness.<br><br>Powerful ending.<br><br>Decent performances all round, though nobody stands out.\n"},
{"review": "\nLone Survivor is a brutally effective movie, made by people thinking\nthey're serving their country. However these people make the audience\ncoarser and more self-centered. They perpetuate the kind of propaganda\nthat sent the heroes of the Seal Team 10 to death. The film is intense\nthough but balanced by the moments of surprising tenderness, among the\nmen themselves and also in the field. The ensemble cast delivers\nproperly, working with a screenplay telling the story with considerable\nforce. The story itself is not just about a fire fight with the enemy,\nit regards more the sense of brothers in arms helping each other to\nsurvive. This is what makes the film powerful and somewhat satisfying\nin a terrible sort of way.\n"},
{"review": "\nA gripping action packed war film. The Hurt locker meets Saving Private\nRyan.<br><br>An high octane all action war movie, now I am not in the army and have\nno knowledge of what its like to be in a situation of life or death but\nthis film seems to me the most realistic portrayal an actual war zone\nthen most other films of the same genre in recent years. The film\nstarts off quite slow but be patient because after half hour you wont\nbe able to take your eyes off the screen as your thrown into the heat\nof battle. Its just as gripping as being in a call of duty death match.\nThe hairs on the back of your neck will stand up as you feel the fear\nthe soldiers are feeling as bullets reign down around them. Mark\nWahlberg leads a group of four American soldiers stranded without a\nradio connection behind enemy lines as a mission goes wrong deep in\nTaliban controlled Afghanistan.This film is based on true life events,\nif you love war films there is no reason you wont love this one.<br><br>http://raroe.wordpress.com/\n"},
{"review": "\nIt wasn't much what I expected based on IMDb ratings , box office .\nLiterally Mark Wahlberg's performance saved this movie from being a\ncomplete failure . I think the screenplay wasn't that good and din't\nmade it a real action movie but mostly of the time in first 50 minutes\nwas boring as f*** . Only Mark when was left by himself the only that\nsurvived the movie started to revive the movie . His fantastic acting\nskills made the movie awesome with his dramatic role . <br><br>The script (story) was fantastic , but I don't know maybe the producing\nor director or something turned into a boring movie till some point\nMark came and saved it . <br><br>Love Mark's performance 6.8/10 this movie :D\n"},
{"review": "\nI cried with on a number of films... but I never had it stuck in my\nthroat ... what a movie, it really is one of my all-time favorite war\nmovies, and stories for that matter! Absolutely breathtaking shots and\ncinematography! The music is mindbogglingly awesome! That it is close\nto the real story makes it even more impressive. Mark Walberg is\nabsolutely not my favorite actor by a long shot, and his role in this\nis far from perfect, but the story is so good that it doesn't matter.\nAbsolute 10... The area where the movie is shot is brilliant for the\nstory and the pictures at the end of the lost brave men who fought and\ndied for this story, it took my breath away. Made me look like a\nschoolgirl, sobbing on the couch.\n"},
{"review": "\nLone Survivor further goes into the war genre, however it being a true\nstory adds emotion and further intrigue to this film. The sound and\nmusic played through out the film is captivating as well as the story\nunfolding. The story is inspiring and will appeal to large audiences\nhowever, the way the movie was presented was in a way where I myself\nand many people have seen before in a war movie. The story is touching\nand really shows the nature of the cruel Taliban as well the grit and\nfight of the American Army. There were no stand out performances and it\njust didn't blow my mind as some War movies do e.g. Saving Private\nRyan, Black Hawk Down, Apocalypse Now etc. but it is safe to say 'Lone\nSurvivor' is this generations Black Hawk Down. In summation, it is a\nwell filmed movie, done by Peter Berg with up and coming actors as well\nas Mark Wahlberg. Only 7/10\n"},
{"review": "\n1: Let's stand around and debate what we're gonna do with prisoners we\nalready have tied up. 2: Then, wonder why the enemy is \"faster than\nus!\".<br><br>I don't know about you &amp; I do not care about the book, but military\npersonnel, especially elite groups are all BUSINESS &amp; QUICK THINKERS.\nThere would not have been any lengthy discussion on what to with the\ncaptives. They would've been gagged &amp; tied down. End of story.<br><br>Also, elite groups are PREPARED. All that gear and not one of these\nclowns have rope? Not one is smart enough to use the belts or clothing\nof the captives to tied them up with???<br><br>This is stupid film making at it's best. Not surprisingly, since the\ndirector is responsible for some other garbage.<br><br>Save your money &amp; watch Blackhawk Down (which blows this movie some\nclown compared to Saving Private Ryan. LOL! Really??\n"},
{"review": "\nWhy do film makers today think we have the brain capacity of a 5 year\nold. The moment i saw the actors in Afghanistan I knew that some penny\npinching fool had cut back on the locations. Straight away I new this\nwas shot in the USA and the illusion of the film and my buy in\ndisappeared ruining the rest of the film as it was just a bunch of\nactors running around playing guns....come on Hollywood..pull you head\nout from your bum.<br><br>Apart from walburg I didn't buy into any of other actors who looked as\nhard as my gran. This film needed pretty boy Hollywood in it...no it\ndid not.Real navy seals aren't pretty boys with stupid beards but\ntrained professionals who do a dangerous role.<br><br>It took me three attempts to watch this drivel and each time I tried\nnot to think \"cheap skate location budget \" but it never worked...ever.<br><br>I can't find any redeeming qualities on this film apart from the end\nwhich made me laugh..it wasn't supposed too I was just relived that I\ndidn't,the have to watch it ever again.\n"},
{"review": "\nThe expectations where set to high with that line, it's a good film,\ngreat acting. I read the book prior to seeing the move, perhaps that\nwas my biggest problem with this show. More character development would\nhave made the movie more interesting. Narrative dialog would have\nhelped fill in the blanks. The movie see end like a long 2 hour action\nsequence. There is more to operation read wings then was described\nhere. This story could have been in the same class as Saving Private\nRyan but it had none of the elements that made that show great. The\naction scenes where fantastic. The realism was top notch. The acting\nwas a 10 star performance. The story was empty.\n"},
{"review": "\nFirst, let me say that this is NOT a high budget Hollywood movie that\nglorifies war. It is a tribute to the story of the brave soldiers that\ndied during Operation Redwing. The movie will bring you up close and\npersonal on the mountain with four Navy Seals and their ordeal with a\nTaliban ambush.<br><br>This story could easily have been made into a PG-13 feel-good Hollywood\nblockbuster, but it would have been a disservice to the soldiers that\ndied. The action sequences are brutal, gory, and real... as is war.<br><br>The movie follows Marcus Luttrell's book pretty closely, though some\nparts were omitted... as is needed to make a book into a movie. That\nsaid, all the key points of the story were covered.<br><br>To any soldiers that may be reading this, Thank you for your service.\n"},
{"review": "\nthis movie is great in so many levels. it tells the story of 4 solders\ndoing what it takes to survive against 200 men even if it means\nsacrificing your life for your fellow solders,and the fact that this is\nbased on a true story brings me up to tears.with a great selection of\nactors and great directing is weird that this movie was did not win an\nacademy award it had Mark Wahlberg at his best.the movie looked\nvisually amazing,there were a lot of parts that made me so tens i\nstarted to scream on at the screen.in short its a breath taking film\nwitch reminds us what war is really like and what we are wiling to do\nto survive it physically and mentally i highly suggest this movie to\naction and drama fans.\n"},
{"review": "\nI loved this movie it is just awesome. To see how amazing our military\nis Mark Wahlberg does an amazing job. So do all the other actors in\nthis movie. It is just mind blowing to see what they went through. It\nis just amazing and I recommend this movie to everybody. There is quite\na bit of language in it but it is expected from a military movie. There\nis violence and blood which in some parts pretty intense but it does\nnot take away from how amazing this movie was it is one of the greatest\nmilitary movies ever and one of my favorites also.And i loved how they\nactually allowed the lone survivor to be in the movie however short it\nmay have been it was just awesome.\n"},
{"review": "\nI thought this movie was great. I loved how it told the story through\naction. The suspense was thrilling and I thought the director did a\ngreat job of showing the passion of the Seals that were being\nportrayed. In all, I think this movie does a great job of honoring\nthose brave men who lost their lives fighting for our country. It was\nvery entertaining, and even though I'm not a huge action fan, It kept\nmy attention the entire time. I also appreciated the fact that the\ndirector made sure to emphasize the kindness of the man who aided him.\nIt is a step in the right direction to stop prejudice in our country.\nOverall, this movie is a great choice for anyone wanting to see a good\nfilm.\n"},
{"review": "\nit was a toss up between grand piano and lone survivor. the latter won\ndue to movie timings as well as the fact that mark wahlberg and emile\nhirsch was in it. from the time i sat down to the roll of the end\ncredits it was a movie that transported me to the throes of humanity\nand how we see situations differently. no one is painted an enemy but\nwe adapt and thus the same people we let go at times comes back to\nhaunt us and if we don't have friends who have our back we are just\nforgotten. the cinematography and the background score was mesmerizing.\nthe fact that it is a true story and well depicted by the four band of\nbrothers as well as the other casts. hats of too peter berg for yet\nanother star.\n"},
{"review": "\nThough not as epic as Zero Dark Thirty, Peter Berg bounds back from the\nfailure of Battleship to make this moderate budget action kicks into a\ngreat patriotism and moral value film in this traditional quiet box\noffice month. The art of inserting the life of SEALS and to reveal the\nafter life at the immediate of the story work well, turning the film\ninto an emotional set piece better than Act of Valor. Based on a true\nstory being modified onto a big screen, the sense of danger starts to\nrelay from the appearance of the first huge numbers of Taliban forces\nuntil the end of the last scene.<br><br>Overall, good film to check out in the theater in this boring January.\n"},
{"review": "\nBest \"war movie\" I've ever seen. The casting was spot on, Peter Berg\nand his crew are geniuses, and the story is both inspiring and\nheartbreaking. Where do we find men such as these? Maybe it's in all of\nus, just waiting for someone, or something, to draw it out. God-loving\nfamily men who were raised to do special things. I have had the good\nfortune to meet Marcus, twice actually. Finer, braver men have never\nlived. These men put everything they had into their duty to this\ncountry. Watching this story, I felt proud. I had a lump in my throat\nthe entire movie. I love these guys for what they did, and still do\ntoday.<br><br>Special men do special things.\n"},
{"review": "\nWhen this film began, I feared that I was going to be\ndisappointed...but I was so wrong. The opening sequences certainly set\nthe tone of what was to follow. The acting and setting of the war in\nAfghanistan came across as 100% believable, and it brought home the\nbravery of Navy Seals under unimaginable conditions. I am not an\nAmerican, but was so in awe of the bravery of the real people who are\nhonored in \"Lone Survivor\". Mark Wahlberg grows in every movie he\nappears, and is brilliant, as is Taylor Kirsch as his superior officer.\nGood to see Eric Bana too. I must disagree with another reviewer who\nfelt the credits at the end were not suitable - I felt they added quite\nbrilliantly to the veracity and emotion of a very fine Movie. I fully\nrecommend seeing it-\n"},
{"review": "\nBased on the true story of Operation Red Wings, 2005, LONE SURVIVOR is\ngripping, well-acted, and well-filmed. It shows in no uncertain terms\nwhat it's like to train and fight in an outfit like the Navy Seals.\nLots of death and violence, but no really blatant gore.<br><br>LONE SURVIVOR is too grimly realistic to function simply as a cheesy\nwar thriller, which is good. Still, shoot-'em-up scenes in the\nmountains of Afghanistan very much predominate. That, of course, was\nmostly what ORW consisted of: Some will like this quality of the film\nwhile others won't. Nevertheless, LONE SURVIVOR would have been better\nif there had been more back-story on local Taliban leader Ahmad Shah's\nactivities, as well as more on the specific politics of the region and\nthe operation. More of an alternating focus on the Seals, the Taliban,\nand the neighboring villagers would also have been a plus.<br><br>One small but glaring anachronism: Rattlesnakes? In Afghanistan?\n"},
{"review": "\nAt last Hollywood can make a war film without all the American macho\nbullsh*t, the reason why? it is obviously based on true events and what\nis shown is the reality of combat.<br><br>I have not researched details of the original operation but I am hoping\nthat this is a true account of events.<br><br>You don't get long to know the characters but you soon share their\nterror and hurt as they face over whelming odds, I'm a ex soldier so I\nfelt for these guys, and not forgetting condolences to the families and\nfriends I'm sure they will agree this film was a great tribute to their\nmemories.\n"},
{"review": "\nLets be honest with ourselves. When you walk out of the movie, you may\nhave the irrational urge to go and take up a rifle and join the Navy\nSeal program as soon as possible. When i first saw that Mr. Walberg\nwould be the main actor in this movie i kind of chuckled at thought of\nhim playing a Navy Seal. We are talking about the same guy who played\nthe stud racer, bully beat down type character in the Itallian Job ten\nyears before. But back to Lone Survivor. If you are one that might be\nknown to have a faint heart, this movie is most certainly not for you.\nThis might just be one of the most graphic movies i have ever seen.\nBlood, Guts, and an Instant American classic.\n"},
{"review": "\nLone Survivor a Breathtaking, often unbearably brutal account of a June\n2005 military mission that claimed the lives of 19 U.S. soldiers in\nAfghanistan's Kunar province.The movie is absolutely filled to the brim\nwith action, emotion, and decent acting.Watching each of them falls is\nheartbreaking, with some breathtaking camera work and stunts, we see,\nhear, and feel every bullet zoom by, every burst of fire, and every\nbone shatter.The gun fights are very good, again you get the feeling of\nbeen there with them and having the fear of danger.The real acting came\nfrom Ben Foster and the others. Foster was excellent! Eric Bana strong\nsupport.Wahlberg was very good, He does injury and pain well, but not\nso much when he need to be vulnerable.Lastly a truly well made\nbrilliant movie that is an extremely satisfying watch.\n"},
{"review": "\nThis film details the failed operation of US SEALS in Afghanistan to\ncapture a Taliban leader in 2005.<br><br>The title already gave the plot away, and the first scene confirms all\nsuspicion of the title. Hence, viewers are already given a grim outlook\nfor the respectable soldiers portrayed in the film. For the first forty\nminutes, nothing much happens. I was about to lose interest in it,\nthinking it was boring and uneventful. When action strikes, it strikes\nbig time. It is brutal and violent that most of the time I had my eyes\nclosed. It's so sad to see the soldiers in such desperate situations,\nand yet they combat valiantly until the last minute. There is little\nemotional or dramatic element in the plot, but it will still evoke much\nemotions because the battles are so brutally realistic. \"Lone Survivor\"\nis certainly not a film for entertainment or an easy relaxing evening.\nBe prepared to see loads of nasty wounds.\n"},
{"review": "\nFirstly I'd like to start off by saying why the negative reviews and\nwhy the so called propaganda term being incorporated with this. I\nactually found this a compelling, gripping, gritty and realistic true\nstory on the mission operation red wings. This movie is extremely\naccurate if you have read the book and nearly everything that happens\nthrough out the film happened in real life. It may be tough to watch at\ntimes but I could never take my eyes of the screen. How is this\npropaganda ? How I ask. The film to me was actually more an anti- war\nmessage being portrayed as it doesn't just show the enemy as the enemy\nand it shows a different side to Afghanistan, this side we never really\nhear about. The film also packs some great performances with Taylor\nKitch and Mark Wahlberg leading the pack. The films brutality and\nrealistic warfare just adds to the tensity. Seriously if this film had\nbeen made 10 years ago it would have been hailed as one of the great\nwar films but in a generation like today's where war movies are all\nhailed as propaganda it doesn't get the credit it deserves.\n"},
{"review": "\nThis movie has been snubbed for every Oscar this year and it has been\nunjustly snubbed because Lone Survivor is one of the best films of\n2013.<br><br>Mark Whalberg pulls off an amazing performance and so does Taylor\nKitsch. Peter Berg's direction is incredible and the way this movie is\nfilmed made it even more intense.<br><br>This movie was, in my opinion, more brutal of a film than the\ncritically acclaimed 12 Years a Slave.<br><br>Everyone should see this movie it is incredible.<br><br>I'm going to give Lone Survivor an A+\n"},
{"review": "\nBetween the undeveloped characters and glamorization of war, the Lone\nSurvivor wouldn't even be in the top 20 of best war movies. The film is\nnothing but a series of half-truths. The entire ending of the movie is\na falsification of real world events. It's existence is purely because\nof the need for a better climax. Ever little moment is subtly twisted\nfrom its real-life counterparts to cast the Americans in good light.<br><br>The movie is also overwrought with clichés. How many times do I have to\nhear about brotherhood in a war movie? Am I suppose to care for these\ncharacters the second they utter the word; brother, cause the first\nfive minutes of the movie where they show a few family photographs\ndidn't work. In fact, it came across as nothing but a shallow attempt\nto make these people human, just like the rest of this film. <br><br>The action scenes are well done, but if you're looking for a movie\nthat's more than a string of gung-ho American bull-crap, look\nelsewhere.\n"}
]