[
{"review": "\nChristopher Nolan (and cast) have pulled off what I hadn't dared to\ndream - a Batman every bit as good as Burton/Keaton's vision - and\neradicated the camp, feverish memories of Clooney, Kilmer and (cough..)\nO'Donnell.<br><br>The story is as good an origin story as you'll find - covering all the\nmajor (true-to-the-comic) events, and not wasting ages on them. We see\nWayne's all-important training period (previously ignored), and his\nconnection to the Tibetan shadow-ninja clan led by Ra's Al Ghul. We see\nBruce come up with ideas for his symbol, his costume, his gadgets, his\ncar, his cave - IT ALL FITS SO PERFECTLY.<br><br>That's not all - Liam Neeson is perfect (as ever, when Lucas isn't\nwriting his lines), Batman's first mad nemesis (the Scarecrow) is\ngenuinely frightening; with some outstandingly scary 'fear' effects..\nGary Oldman looks just like a young Commissioner Gordon (and doesn't\ndominate), Morgan Freeman and Rutger Hauer give solid heavyweight\nsupport to the boardroom machinations at Wayne Enterprizes. I love\nMichael Gough(?) but Michael Caine is great as Alfred. It's only Katie\nHolmes who didn't ring true for me - not because of her performance,\nbut simply because she looks all of 15 years old (sorry Katie). I am\nalways blown away by Christian Bale, and this is no exception.<br><br>The fights are great, the Bat-gadgets all there, the car is amazing,\nthe plot is thorough and exciting, Gotham looks great, Batman really is\nfrightening &amp; menacing (and lethal!).. And the scenes with the bats\nthemselves FINALLY get across the idea of how scary they can be.<br><br>There is some humour, but it's fairly dry. The soundtrack, like all the\nbest original soundtracks, is excellent - you hardly know it's there,\nbut the emotions of the scene are enhanced and boosted. For the most\npart this is a serious Batman film, with plenty for long-time fans.\nThis NEW Batman is one I'd like to see again. Bravo Mr Nolan, bravo.\n"},
{"review": "\nI got a chance to see 'Batman Begins' just this past Friday evening. I\nmust say that before seeing the film, I felt in my heart this is the\n'Batman' film we've been waiting for. Within ten minutes into the\nmovie, I turned to my date and said to her, \"This is it! This is the\nmovie!\" I just can't believe that after all these years, Warner Bros.\nfinally got it right. For me the most intriguing part of the film,\napart from the great script, and great acting, was Christopher Nolan's\ndecision to base the film in reality. Deciding that Batman could really\nexist in our universe and our world was a stroke of genius. Another\naspect of the film that's so refreshing is that instead of the focus\nbeing on the villain, Batman is the film's star. And rightly so. It's\namazing what can happen when a studio leaves a respected director, and\nthe creative team alone, and allow them to make the best movie\npossible. The only two negatives that I can think of is Katie Holmes\nand the fight sequences. Holmes does indeed look like a teenager\nplaying grown-up. Her performance isn't bad per SE, it's just that you\nreally don't buy her as an Assistant D.A. As for the fight sequences, I\nfelt the cameras angles were too tight on the action, edited too\nquickly, and lit too dark so that you really couldn't tell what was\ngoing on and determine who was hitting who. Maybe we can attribute this\nto the fact that Nolan is not an action director. Hopefully the next\nfilm will open up the fight sequences so we can actually see Batman use\nthe martial arts skills he developed during his exile. But apart from\nthose relatively minor quibbles, the film is excellent, and I'm\ndefinitely going back on opening day June 15th, and seeing it a second\ntime. A third and fourth viewing is definitely not out of the question.\n"},
{"review": "\nI just came back from a special screening of Batman Begins and I must\nsay this is the best movie I have yet seen this year. All of the\nblockbuster movies I had seen this year with much expectation have been\ndisappointing. But Batman Begins is not the typical corny action film;\nit incorporates all aspects of genre: action, fantasy, drama, and even\ncomedy. I was at the edge of my seat from the thrills in some scenes\nand clapping &amp; laughing from the humorous lines that director\nChristopher Nolan had written for the characters. I was really amazed\nby the acting performances from the new generation of actors, assuming\nthat they wouldn't have been able to compete with and compliment the\ntalented, veteran actors such as Michael Caine, Morgan Freeman, Gary\nOldman, and Liam Neeson. I mean you couldn't have asked for better\nactors!! Christian Bale was just perfect for the role: he had the\nintensity, physique, and charm you'd expect a Batman character to\nencompass. Every actor was casted perfectly for their roles. I even\ngive props to Katie Holmes for playing a district attorney considering\nher previous roles consisted of \"the young girl\" or \"girlfriend\". <br><br>I hardly ever see action films nowadays because I don't want to waste\nmy time watching a conventional, corny, over-digitalized,plot less\nfilm. To be honest, I gave this film a chance not because it was a\nBatman movie, but rather because of the talented veteran actors as well\nas being a fan of Christopher Nolan's previous films. Whether you're a\nfan of Christopher Nolan or just a Batman fanatic, you'll enjoy every\nsingle second of the movie. People of ALL ages will appreciate this\nfilm. The violence in this movie is not vulgar, but rather sends out a\nlot of great messages of loyalty, respect, and humility. Not only is\n\"Batman Begins\" the best of the Batman series, it is the most\nunconventional. This recommendation is coming from a person who mostly\nwatches art-house/independent films.\n"},
{"review": "\nThis film easily trumps any live-action incarnation we've scene of the\nDark Knight before, borrowing heavily from both the comics and the Dini\nand Co. animated series. This is a hard, fast, driving, heartfelt epic\nthat draws you into the character of Bruce Wayne and makes you damn\nwell care. Batman doesn't play second-fiddle to the villains here like\nin the other films. It's his movie and that's the way it should be.<br><br>Much has been said of the film's \"reality\" quotient, and I'm here to\nsay it works. Nolan talks about how Batman's strong because he does\npush-ups, he gets around because of his gadgets, and by introducing\neach of them with a plausible explanation, we forget to quibble and go\nalong with it. The technology may be fantastic, but it's believable.\nAnd, unlike the \"reality\" of something like Daredevil, Nolan doesn't\nforget his ideals halfway though and start having Batman wire-jump\nthirty feet into the air.\n"},
{"review": "\nI've just come back from a preview screening of Batman Begins. I went\nin with low expectations, despite the excellence of Christopher Nolan's\nprevious efforts. Talk about having your expectations confounded! This\nfilm grips like wet rope from the start. I won't give away any of the\nstory; suffice to say it mixes and matches its sources freely, tossing\nin a dash of Frank Miller, a bit of Alan Moore and a pinch of Bob Kane\nto great effect. <br><br>What's impressive is that despite the weight of the franchise, Nolan\nhas managed to work so many of his trademarks into a mainstream movie.\nThe story does not progress in linear fashion for the first half, and\nthere are some truly spectacular hallucination scenes. Parents thinking\nof taking their young kids along, think twice. When we left, a\nterrified 8-year-old boy was being comforted by his parents. Some of\nwhat's up there on screen really is the stuff of nightmares.<br><br>Of the cast of Brits chosen to bring this American tale to the masses,\nChristian Bale convinces in his dual role, while Michael Caine as\nAlfred comes up with the humour just when the film is in danger of\ntaking itself too seriously. Gary Oldman and Tom Wilkinson provide able\nsupport, as does Morgan Freeman. <br><br>Most refreshing of all is the way that Nolan and co have come up with a\nway of bringing comics to the screen that does justice to the often\nadult source material in a way that, say, Daredevil, tried and failed\nto do (although the director's cut is better). If the Dark Knight\ndoesn't return after this, there's no justice.\n"},
{"review": "\nIt had some original stuff that displayed intelligence and thought with\nregards to his suit, car and weaponry. It did try to dwell on Bruce a\nlot more and convey some of his darkness but I found towards the end it\nbecame very Hollywood-ised. Sometimes filmmakers try to over complicate\nthings and this was a good example.<br><br>I don't know why they can't have a simple bad guy with a simple plan,\nwhy do they have to be so elaborate a plot leaving a growing feeling of\ninevitability that by the end there will be some big explosions,\nbuilding destruction, lots of flashing lights and Batman will prevail.<br><br>The inability of seeing the fighting was immensely frustrating. I don't\nthink I saw him actually land a single punch. It seems a fight scene\nwould be imminent and the makers would speed up the camera, ramp up the\nbass on the sound, scatter the scene with crunching thuds and smacks\nbut then forget to actually choreograph a fight. Maybe believing that\nif we heard the thuds and saw some activity on the screen that the\naudience would imagine the rest and think 'wow, what a scene'. I'd much\nrather have two or three clearly thrown punches or kicks than 1-2\nminutes of whirling cape, bangs and crashes and people falling to the\nground.<br><br>It's a shame that they re-launch the franchise in a blaze of 'this is\ngoing to be darker and different' which it certainly starts off doing\nbefore descending a little bit into Hollywood banality. Why not have\nthe courage to really shake things up, have the bravery to maybe end it\nbadly (taking T3's lead) or just not conform to the normal formula.<br><br>Showed promise, had some clever stuff and made more of an effort than\nsome in the franchise but still nothing to rival Batman:Mask of the\nPhantasm as the best batman ever made in my opinion.\n"},
{"review": "\nI have just seen The Dark Knight, and while I wanted to review it as\nfast as I could, I felt it might make more sense to at least review\nit's prequel, Batman Begins. It focuses on Bruce Wayne's beginnings.\nHow he became Batman, and why he did so. He reflects a lot about his\nparents' death from a murderer, and gets sent to jail after having his\nrevenge. In jail, there is a mysterious man that will bring to another\nmysterious man by the name of Râs-Âl-Ghul, who trains him to become a\nwarrior. And, after harsh choices, Bruce Wayne then becomes Batman. The\ncast is unbelievable, the special effects are dazzling enough that they\ndon't steal from the story like in previous superhero films. Also\nunlike previous superhero films they don't hand the movie over to a\nmega-star actor as an over-the-top villain.\n"},
{"review": "\nSaw a free screening on Tuesday. I must say, I had my expectations low\nfor this one, as the previous Batman franchises was just cartoony, over\nthe top, and flat out mind dumbing. Why do studios continually think\nthat spending money on 'bankable stars' and special effects will make a\nton of money on box office receipts? Granted \"Batman Begins\" has a\npretty sizable budget, but they made the right decision with casting\nactors that can act and hiring a director that shares the same vision\nof the comic book. You will not see any caricatures of the comic book,\nbut rather be immersed in how Bruce Wayne has that internal conflict of\nmorality as he becomes Batman. Christopher Nolan takes his time\ndeveloping Bruce Wayne's character in the image that Bob Kane had with\nhis own flair to it. Anyone familiar with Nolan, Christian Bale, and\nCillian Murphy's work will not be disappointed with this movie. Make no\nmistake about it, it is a dark movie, which is what makes it so great.\nNolan uses CG effects very sparingly (thank God!).<br><br>I rarely give movies a 10 out of 10, as I am pretty brutal with\nratings, but Nolan resurrects a failed franchise. Personally, this is\nwhat Batman should have been all along - The Dark Knight! Anyone who is\na Batman, Nolan, Bale, Murphy fan will not be disappointed. I only wish\nI took that money I spent on \"Star Wars: ... Sith\" went to \"Batman\".\n"},
{"review": "\nBeing a fan of Nolan's previous work, I went into this with high\nexpectations, and yet somehow, my expectations were surpassed. My\ncongratulations to the entire cast and crew for making such a\nphenomenal film.<br><br>It all begins with the story. Nolan and Goyer didn't just adapt from\nthe comic book, they re- imagined and re-invented Batman and his world\nwhile staying true to it. I might even say what they did was in some\nways better than the comic book. Things in the comic book that would\nprobably seem preposterous in a live action film are brought to life in\nan intelligent way, like the reason for the costume, and the reason for\nthe villains and their costumes. I won't go too much into the story,\nbecause I think it's best for people to go into this film knowing as\nlittle as possible.<br><br>Christian Bale IS Bruce Wayne, and IS Batman. It will be hard to ever\nsee someone else play the role. The look on his face when Joe Chill\nwalks out of the courtroom... That demonic voice he gives Batman... The\nway he tries to hide his pain when he's told that \"the apple has fallen\nfar from the tree\"... an incredible performance. The rest of the cast\nis fantastic too, with Michael Caine and Morgan Freeman dishing out\nsome great humor.<br><br>And the film looks great. Gotham actually looks like a real city (with\nnods to Blade Runner), the lighting is nice and contrasty, and Batman\nis believable as a flesh and blood character. Even the flying scenes\nare handled nicely. It's hard to talk about this film without giving\nthings away. If you haven't seen it, please see do. You won't be\ndisappointed. I'd like to thank Warner Brothers for letting an\nintelligent and talented filmmaker make this film without much\ninterference. Please make more like this one.\n"},
{"review": "\nThis new take on Batman just doesn't seem to work quite right. Nolan\ntries to basically get Shakespearean with the character and completely\nignore the first four films. In some ways that works but in other ways\nit veers off into a Batman universe that makes no sense and becomes\nbasically a movie that seems like he's attempting to have Batman seem\nmore realistic to being like a person in our real universe. This is\nwhere Nolan fails. The magic and fun of Batman evaporates quickly. A\nman dressing up as a bat and fighting crime has a humorous element to\nit that Nolan completely ignores with this incarnation and everyone in\nthis universe acts really dumb about it and their reactions to it make\nlittle sense especially Gordon's character. A lot of what Gordon does\nlacks logical sense and he never seems to really question the mental\nstate of the person he first sees dressed as a bat. He's portrayed like\nsome idiot willing to eventually put complete trust in someone he knows\npractically nothing about running around in a bat suit. His reasons for\nbeing so trusting are never clear. Does he know something everyone else\ndoesn't? Bale's performance was pretty average but not as compelling as\nKeaton or Kilmer. He also tries to have a Batman voice that sounds\nridiculous. The only reason for this film's critical success is that it\nstruck a cord with the comic book fan die hards. It certainly didn't do\nthat impressive box office numbers. Now with news that Nolan is going\nto present The Joker in a sequel, I see a potential disaster waiting to\nhappen.\n"},
{"review": "\nSorry to upset die-hard Batman comic book fans, but I really hate and\ndetest this movie. It is an insult to the 'Batman' I love and remember\nfrom my childhood. The Burton/Schumacher pictures were marvellous fun\nbecause they did not take themselves seriously. All I got from this one\nwas a king-size headache and a sore bottom where I was bored senseless\nfor the best part of two hours. Chris Nolan thinks 'Batman' should be\ntaken dead seriously. A rich man who goes out at night in a rubber suit\ndesigned to resemble a bat? Oh, come on! Putting the Caped Crusader in\na film like this is like making 'Austin Powers' the star of a Daniel\nCraig-type Bond film. Worse, the chief villain - The Scarecrow (\nCillian Murphy ) - is another nut, only this one runs round with a sack\non his head! Michael Caine's 'Alfred' cannot hold a Bat-candle either\nto Alan Napier or Michael Gough. The story of this film...well, was\nthere one? All I saw was a lot of fighting with nothing in-between. It\nhas been announced that Warner Bros. are rebooting the franchise once\nmore. Good idea. They need to use the Burton/Schumacher movies as a\ntemplate for any further entries. This one hit the big screen with all\nthe force of a wet lettuce. Ker-flop!\n"},
{"review": "\nThis latest Batman film disappointed a lot of people....but not me. I\nappreciated it because they didn't overdo the violence, didn''t have a\nstupid romance angle to muddy up the real story, and fount it an\ninteresting history of how Batman became Batman. <br><br>The first hour of this \"prequel\" dealt with his origins. If you're a\nfan of the comic book stories and the other Batman films, this part in\nthe film should not bore you. It was like a documentary to me, about a\ntopic I was interested in. In fact, on the second viewing I enjoyed\nthis even more.<br><br>Christian Bale did a fine job as the latest Batman. It's too bad there\nhave been so many actors playing this role, ruining the continuity of\nthis latest series. I hope Bale continues with a few more efforts with\nthis character.<br><br>It was nice to see Michael Caine in the role of \"Alfred.\" He was\nexcellent and the stabilizing force of the story. Katie Holmes did not\nhave anywhere near as big a role, or romantic one, as I expected, and\nthat was fine with me. I just enjoyed looking at her face, leaving it\ngo at that. Gary Oldman was also interesting as a low-key young\ndetective Gordon who would go on to become Commissioner Gordon in all\nthe other episodes (but, once again, played by another actor.)<br><br>The film ends with what would be the beginning of the first Batman,\nfeaturing \"The Joker.\"<br><br>After having seen all the Batman films several times, I now think is\nthe best of them all....perhaps an unpopular choice, but that's my\nopinion. Don't let the naysayers keep you from watching this movie. You\nmight be missing the best of the Batmans!\n"},
{"review": "\nI've come to realize that I've attempted to watch this movie five\ntimes, and I've never made it past the first hour and fifteen minutes.\nI either fall asleep from sheer boredom, or I lose interest and get up.\nBut, as a huge, massive comic book fan boy (Batman tattoos and all), I\nkeep trying to give this movie the benefit of the doubt. But it has yet\nto win me over even in the slightest... Plus, who can watch Katie Homes\nin anything?<br><br>I saw about 20 minutes of the sequel, and wasn't blown away at all. In\nfact, as soon as Bale put on his 'Batman' voice, my two even bigger\ncomic fan friends, started to laugh so hard in the theater that we were\nasked to leave. Does anybody really find that voice cool?\n"},
{"review": "\nAll i can say is thank you Chris Nolan,,,I still think you will have to\nbe a magician to beat Tim Burton's Batman film's but Nolan has is well\non his way to becoming Houdini. This is a film that describe's Batman\nas he was in the comics and i think as Bob Kane imagined...So how has\nNolan done it..Simple..i've seen the xtras on the Region 2 DVD and it\nappears that he didn't rush anything and really worked hard on this and\nrecruited the best of the best in the movie making business,it's an\nextremely hard character to portray and a risky franchise as a director\nto do a good job as Joel Schumacher found out. He has had some good\nfilms like The Lost Boys etc but his take on the Batman was purely a\njoke and i think he had potentially ruined a huge money making\nfranchise...But however it has been saved with Nolan's amazing take on\nGotham and Christian Bale's Dark Knight which truly is an amazing\nlikeness to the comics,,,This film has everything that we wanted and\nmore because it has a beginning a middle and an amazing end which makes\nbatfan's itching for more and a sequel which promises just that,,,it\nhas an all star cast too,Morgan Freeman and doing an amazing job in\nsucceeding the great Michael Gough's Alfred we have Michael Caine..The\nvillain is the Scarecrow but in true Gotham Style there are more\ncorrupt going's on in Gotham than good and who are they gonna call to\nclean it up..Simple.....THE BATMAN...This film has more gadget's and\nlifelike special effects than any other Batman Film so it's definitely\none to watch..Thanks and i hope you enjoy it as much as i did..\n"},
{"review": "\nFor those of you who were disappointed with the last few Batman movies,\n'Batman Begins' redeems the caped crusader in a big way. 'Batman\nBegins' takes us on a journey through Bruce Wayne's tragic past again,\ngiving us a real insight into what drives and fuels his quest against\nsuffering and injustice. We discover how the billionaire came to be\ntrained in the martial arts, develop his alter ego, and acquire his\ntechnological arsenal. Christian Bale gives us a riveting performance\nas not only a very dark hero, but also a tortured soul looking for the\nmeans to combat the wrongs of society, a society that we see is also\nresponsible for the death of his beloved parents. Another thing we\nnotice from the beginning is this story does not tie into that of the\nother movies in the series. This is however not a disappointing\nfeature, in fact it seems to breathe new life into this timeless\nclassic. So for all of us who have followed the Dark Knight's\njourney's, strap yourself in for a wild and inspiring ride.\n"},
{"review": "\nAm I missing something? What is it people saw in this movie to give it\nsuch a high rating? It must be Nolan fans and studio plants. This movie\nwas a train wreck from beginning to end from the casting mistakes to\nthe nonsensical plot. As for being more true to the comic books, are\nthe people who believe that on crack? This was a complete departure\nfrom not only the previous Batman films but certainly Bob Kane's\noriginal intention. There has to be at least a sprinkling of humor for\nBatman to work and make sense because a man dressing up as a bat does\ncome across as humorous no matter how you cut it. The idea is Bruce\nWayne has gone so far into a dark place in his mind that he does go\ncrazy and a man running around as a bat is crazy and a little funny.\nThis film tried to make the notion so serious that it was too serious\nto be taken literally. And as far as everybody complaining about how in\nthe first Batman Bruce Wayne's parents were killed by The Joker, stop\nyour whining. I laughed at the court room scene where the criminal who\nkilled Bruce Wayne's parents is shot walking out of the court room by\na...woman! Then Katie Holmes reaction saying, \"Bruce you don't need to\nsee this.\" to Christian Bale muttering, \"I have to see this\". It was\nbeyond ridiculous. All in all forget this film and stick with the first\nthree. It is a complete over-hyped waste of time.\n"},
{"review": "\nFinally, A movie that pulls a franchise with excellent potential out of\nthe swamps of \"Joel Schumacherism\"!! This could well be one of the best\n(if not THE best) movies ever. It has all the elements of a successful\nmovie, and comic adaptation as well. The beauty of this movie is that\nit is as realistic as.. I dunno... reality! let's just break this down:\n1) Characters: I couldn't have imagined a better Wayne than Keaton, but\nafter I've seen Bailey he completely disappointed me, because I kept\nbetting he'd suck as Bruce Wayne.. he didn't... Absolutely brilliant\nthis kid is. Gordon (Gary Oldman) is as great as ever -although a bit\nunder-nourished. Michael Caine was just born to be Alfred, Ducard (Liam\nNeeson) was legend and Watanabe, even with a small role, flying him all\nthe way from China was worth the effort.. and Cillian... oooh Cillian\njust blew my head off with his performance, I don't think we could have\nseen the Scarecrow on screen better than we did here (although I missed\nthe ragged costume and the hay and all).<br><br>2) Gotham City: Forget all about Schumacher's \"City of Light\"... also\nforget about Burton's Gotham \"Dark even at day\" city. This is Gotham as\nit should have always been, the big rotten apple... pretty and shiny on\nthe outside, but rotting and full of maggots on the inside.<br><br>3) Christopher Nolan: Need I say more? anyone who's seen his previous\nwork will know what they're up against. Great camera work, Psychotic\nmotion effects. Pure art if I might say.<br><br>that's about it... I could have gone on forever but I'd rather leave it\nhere and let you guys see this masterpiece that brought the DC world\nback to kick major Marvel behind.\n"},
{"review": "\nAt last it appears evident that Hollywood have listened and made the\nsuperhero more believable. Batman through Bale is an honest character\neasily related to his alter-ego. The enemy is normal (compared to the\ngreen goblin and nuclear man!), and the City although futuristic allows\nthe audience a certain mystical sincerity. Bale is strong as both Bruce\nWayne and Batman. The underpin to the story line depicting how Wayne\nbecame Batman is well written and acted. There is of cause the usual\nmoral picture painted through Wayne and his childhood friend\nemphasizing that revenge is a negative motivation in cleaning up\nGotham. Good kit and a great car... 2008 is marked up for the follow up\nwith Bale in the lead role again, keep up the good work and we hope\nSuperman is as REAL.\n"},
{"review": "\nthis was one of my favorite movies of the year. and i don't say that\nlightly. i saw this movie with my friend as a backup to lords of\ndogtown which was sold out and boy am i glad i did. Christian Bale did\nan amazing job with the tough role of being batman. i then saw this\nwith my cousin who loved it as well. this is probably the best\nsuperhero movie I've ever seen. superman, horrible. batman, OK.\nspider-man the first one, OK. spider-man 2, boring. and so on. but\nthis, this was amazing. it was well worth the 10 dollars to see it and\ni cant wait until it comes out on DVD. one of the best movies of the\nyear and it deserves to be in the top 10.\n"},
{"review": "\nThe best film I have seen so far in 2005. It had everything, action and\na little romance. but not enough to distract you from the main story\nline. Forget all the Batman films of the past and look to the future.\nBatman is back, bigger and better. The stunts are great, and add to the\nplot instead of being the hole story. And for once the supporting\nactors don't let you down. They actually boosted the story and helped\nto keep the plot moving in the right direction. Unlike those in the\nBtman films of the past. When Batman Begins comes out on DVD in October\nI will be buying the 2 disc set and I hope you will too. When the next\nBatman film hits the big screen I will be the first in line to see it,\nand being a woman that must mean a great deal.\n"},
{"review": "\nI can only say what several critics have said before me; at last they\ncapture the essence of the Batman legend on film! What makes this movie\nso great is how it takes its material so seriously. There is also a\nmain theme that ties the movie together: Fear. It's relentless in its\nquest to explain why and how a man of Bruce Wayne's wealth and public\npersona would dress up like a bat and battle crime. This is the core of\nthe movie, and it treats this with confidence and conviction. When a\nmovie believes this much in the story it's telling, it's much easier\nfor the audiences to believe in it as well. This is a big cinematic\nexperience, and it shouldn't be missed. One of the year's best films,\nand quite possibly the best comic book-hero-movie of all time. <br><br>If you have seen this movie once, then it gets even better by the\nsecond time you see it. And if you haven't seen it yet... well, what\nthe hell took you so long?!\n"},
{"review": "\nBest Batman. Most rewarding overall cast. Most dutiful to comic. Rich\nsubtext to true fans. About intellect and character over flash and\ndisrespect to depth. Quick motion camera is meant to make you think, as\nfilm is Psychology and Action combined. Batman brings fear to\ncriminals, and the dread of disorientation is what makes him such a\ncompelling mystery. Burton's was great but this is a truer Batman and\nit is only going to get better from here. Its like the Atlas shrugged\nBatman, all about competence over fatalism and decay. Fantastic. The\ncast was dynamic and the pacing was great if you are smart enough to\nnot need padding and ham fisted plot devices or short cuts. It was like\na literary take on the character, as it should be since he has a long\nhistory.\n"},
{"review": "\nSince \"X-Men\" and \"Spider-Man\" came on the scene, the comic book movie\ngenre has experienced new life. Those films were filled with action,\nwitty dialogue and good acting. \"Batman Begins\" is certainly no\nexception. It leaves the previous movies in the \"Batman\" series far\nbehind- in fact, it's no use comparing them. The movie is practically\nseamless; there are very few complaints to be made about it.<br><br>Christian Bale is the perfect Batman. He brings a new perspective and\ndepth to the character that is unmatched in any other comic book film.\nThe supporting cast is also extremely good, including such great actors\nas Michael Caine, Liam Neeson and Morgan Freeman. This cast takes the\nmovie far beyond just a comic book film. They make it into a movie that\nstands on its own, even if you've never heard of Batman before.<br><br>The movie itself is excellent. It manages to avoid most of the\ncorniness that is evident in many comic book film adaptations. True,\nthere are a few moments where the script leaves something to be\ndesired, but these moments are very rare. When they do occur, the\nactors make them much less corny than the moments could be in less\ncapable hands. The action in the movie is present, but it doesn't take\nover.<br><br>In short, this movie is a must-see. You'll notice that I didn't discuss\nthe plot at all; that is because it contains many unexpected twists and\nturns and revelations. The attention to detail is incredible. Truly,\nyou must see this film in order to comprehend it. It leaves all other\ncomic book movies far behind.\n"},
{"review": "\nThis movie was absolutely dreadful. Christian Bale as Batman was just\nabsolutely ridiculous not to mention Michael Caine with his accent.\nThere were several points in the movie I burst out laughing at Bale's\ndelivery of lines. It was like he practically growled as if to sound\nmenacing. I think the public at large just has no idea what is an\naccurate portrayal of Bob Kane's comic character. To me the closest I\nthink was the original 1989 Batman movie. The absurdity of Batman\nBegins was how serious it was trying to be which made you laugh at it\nrather than with it. The Scarecrow was the most disappointing villain\nof any of the previous Batman films. He was completely boring and just\ndownright stupid. This film was such a complete insult to the fans who\nhave stuck with the movie series through the good sequels and the bad.\nUnfortunately a new generation of children think this is cooler than a\nBatman that makes much more sense and has an element of fun to it.\nTedious and bland is the only way to describe this new reinvention of\nthe Dark Knight. Next!\n"},
{"review": "\nEight years after the infamous abomination Batman &amp; Robin that killed\nthe Batman franchise, Christopher Nolan stepped in and started a whole\nnew series a darker (even darker than the first two Tim Burton Batman\nmovies) and realistic level. <br><br>Now at first, I wasn't mad on Batman Begins because at first I thought\nit was boring and it took a while to get to the part where Bruce Wayne\nbecomes Batman. But after a while, I loved the film. In fact, it turned\nout to be my favourite Batman movie even though I really like the first\ntwo Batman movies by Tim Burton. <br><br>I really like how we get to see the origins of Batman like the tragic\ndeath of his parents and becoming a martial arts expert in somewhere in\nAsia. Also I think it's clever how they made Batman act like a ninja\nthan a superhero. Christian Bale is really good and intimidating as\nBatman but I think he's not as good as Michael Keaton's Batman. But\nalso I think the rest of the cast did very well like Katie Holmes, Liam\nNeeson, Michael Caine and Cillian Murphy. But I can't understand why\nKatie Holmes was nominated for a Razzie for Worst Supporting Actress. I\nliked her as Rachel and she was a lot better than Maggie Gyllenhaal;\nnot to mention better-looking. <br><br>It's too bad The Dark Knight and The Dark Knight Rises weren't as great\nas Batman Begins. I mean I think The Dark Knight is really overrated. I\nmean most people seem to be overglorifying it just because of Heath\nLedger's performance as the Joker and his death. But The Dark Knight\nRises was brilliant and gave a nice ending to the trilogy but I don't\nthink it wasn't as fresh as Batman Begins. By the way, happy birthday\nto the creator of Batman, the late Bob Kane!\n"},
{"review": "\nI thought this movie was absolutely spectacular, I took me by surprise.\nI never thought I would see a Batman movie with depth and that showed\nthe true fear that is the character Batman that he brings to his\nenemies. Christian Bale did a excellent job and I truly look forward to\nhim in another Batman Movie! <br><br>The story was absolutely amazing and in my humble opinion very\noriginal. Raj Al Ghul is an excellent villain and to portray him in the\nway he was portrayed was top notch, not to mention he was played very\nwell. Many people I talked to complained that the actor who played him\nwas not of Asian decent. However I believe it truly didn't matter at\nall.<br><br>Not to mention Alfred was great. Gordon (later Commissioner Gordon) was\nexcellent as well.<br><br>No other Batman Movie has portrayed Batman truly as the Dark Knight and\nas I said already I truly look forward to more along these lines.<br><br>-ND\n"},
{"review": "\nThis is the Batman I have been waiting for! Tim Burton's Batman\n(Batman, Batman Returns) movies were good Tim Burton movies, but not\ngreat Batman movies. Joel Schumucher's (Batman Forever, Batman and\nRobin) I'm convinced were made to mock the Dark knight and destroy his\ngood name. But this new one is everything Batman should be and needs to\nbe. And the villains are all played to perfection! Christopher Nolan is\nmy favorite director and this (along with Memento) is his best work. If\nyou see no other movie this year, see Batman Begins.<br><br>Note: This is not a prequel to Tim Burton's Batman. This is a\ncompletely new Batman movie series.\n"},
{"review": "\nForget Michael Keaton, forget Tim Burton....THIS IS THE BATMAN MOVIE!\nPerfect casting, actors that NEVER over-do it! Excellent\ndirection...this movie does what it sets out to do...shows you just how\nBruce Wayne became the \"Dark Knight\", and makes you actually care about\nhis personal conflicts and resolve to set things right in old Gotham.<br><br>Put it this way...when Christian Bale says, \"I'm Batman!\" you're glad\nyou're not the person he's saying it to!<br><br>And the special effects are dead on. For once, you get just enough\ntechno-babble to explain how the Batman's equipment works. And you get\nto find out just where \"he gets all those marvelous toys\" (stolen from\nJack Nicholson's Joker character in Tim Burton's \"Batman\").<br><br>Enjoy this one! I'm looking forward to the next installment.\n"},
{"review": "\nEvery now and then, an innovative and groundbreaking film emerges and\nchanges the genre by taking its genre and combining others. Film\nschools teach you that talking head movies don't work, but Godfather\nshowed that captivating dialog and memorable characters could drive a\nmovie and capture an audience's attention just as well as action. When\nthis summer is over, Batman Begins will do the same thing for the comic\nbook genre. It shows that a reality and character driven set piece can\nwork for these types of movies. <br><br>There are NO superpowers in the movie. The villains rely on mastered\nsword fighting, physical athleticism, and cunning as their vehicles to\ncreate chaos. And although there is action, which is done masterfully,\n(The car chases and hang glide scenes will blow you away)the story is\nmoved completely by its lead character and not the events surrounding\nhim. <br><br>The movie is a journey of self discovery. One man's struggle to deal\nwith guilt and anger. And minus the batsuit and batmobile, this movie\ncould stand alone as a powerful drama about self discovery, and would\nprobably even merit Oscar consideration. The acting is superb and this\nis the first comic book movie to ever leave me with a lump in my\nthroat. The relationship between Alfred and Bruce is completely genuine\nand heartfelt. <br><br>So enjoy the movie and be prepared for an onslaught of copy cat films\nto come.\n"},
{"review": "\nSaw an early screening of Begins this weekend and I must say, it lived\nup to my expectations.<br><br>Something had to be done to rescue our hero's good name. Thankfully,\nBatman Begins, the start of a whole new series chronicling the origins\nof the Caped Crusader - does all that and more.<br><br>Where Burton's Batman claimed to be dark, this one is genuinely\nmenacing. It's a violent and truly scary film.<br><br>Everyone in the movie does a great job in their role ( except Kate\nHolmes which had more to do with the character then her ) the movie is\na trumph of epic proportions. It doesn't leave out much to the\nimagination, everything is set up to the last drop.<br><br>One of the best comics adaptations ever and I cant wait to see it\nagain.\n"},
{"review": "\nThe name of David Goyer among the writing credits made me fear the\nworse. After all those Zig Zag and Blades appallingness you can hardly\nblame me. So, you may imagine my surprise to discover that Batman\nBegins is not only better than the previous Batmans but much better.\nThe genesis of the character as well as inedited insights into the\nseven mystery years in the life of Bruce Wayne makes the whole\nenterprise engaging even thrilling. Christian Bale is an American\nPsycho Batman, pouty lips and unexpected sexual presence. Katie Holmes\nis lovely, with a sharp intelligence and a riveting imperfect beauty.\nMichael Caine fills the shoes of the butler with wit and charm. Gary\nOldman, looking more Oldman than Gary, adds another surprising\ncharacterization to his already impressive gallery. So, very nice.\nThere is still hope in hopeless trends. Who knew.\n"},
{"review": "\nThis film is a start for a Christopher Nolan Batman film series (which\nI hope will continue for a long time). This film is not that good as\nThe Dark Knight but much better than earlier Batman movies. The film is\ntaking itself more seriously and that is what's good about it. I liked\nthe plot very much and also a colorful characters. Maybe the film\nitself isn't that good as The Dark Knight but the action here is much\nbetter and here is much more of it(especially the fighting scenes). A\nplot, action, acting, costuming, direction - everything was great in\nthis film. So just watch it, especially if you are action movie fan\nbecause there is a lot of action.\n"},
{"review": "\nAs mentioned above three legendary artists reuniting for a legendary\ncharacter like Batman is more than just amazing. This movie clearly\nexplains why Christopher Nolan movies are highly rated at IMDb.\nRecently the same trio combined for \"The Dark Knight\", a masterpiece\nsequel for this amazing film, which stormed to the #1 spot among the\nIMDb top 250 movies pushing the over-rated Godfather down. I didn't see\nthe sequel yet but since its the #1 at IMDb, i have no doubts that its\ngonna be the best movie of the year. The Dark Knight also features late\nHeath Ledger, a legend in his own self, as Joker and he should be\nawarded an Oscar for it. I heard that he scared the s**t out of the\naudience during his on-screen presence in theaters. I can't wait to see\nthis. \"Batman Begins\" also helped me to face my own fears without any\nfear and handle it myself which is earning me more appreciation. So\nmore than just a movie its a lesson for life. The flawless narration,\nwonderful story, beautiful acting, adrenalin pumping action and\nemotional contents all packed in to one big action/drama entertainer\nand is always a treat to watch. Hats off Chris Nolan! you rock! <br><br>I'll definitely give it a 9.4/10 rating and it deserves a #2 spot for\nsure. A must watch for all Batman fans and also Batman haters!\n"},
{"review": "\nthis movie was awesome. i liked it a lot because it was more realistic\nthen the other batman films by Burton. this movie was awesome. i liked\nit a lot because it was more realistic then the other batman films by\nBurton. this movie was awesome. i liked it a lot because it was more\nrealistic then the other batman films by Burton. this movie was\nawesome. i liked it a lot because it was more realistic then the other\nbatman films by Burton.this movie was awesome. i liked it a lot because\nit was more realistic then the other batman films by Burton. this movie\nwas awesome. i liked it a lot because it was more realistic then the\nother batman films by Burton. this movie was awesome. i liked it a lot\nbecause it was more realistic then the other batman films by Burton.\nthis movie was awesome. i liked it a lot because it was more realistic\nthen the other batman films by Burton. this movie was awesome. i liked\nit a lot because it was more realistic then the other batman films by\nBurton. this movie was awesome. i liked it a lot because it was more\nrealistic then the other batman films by Burton. this movie was\nawesome. i liked it a lot because it was more realistic then the other\nbatman films by Burton. this movie was awesome. i liked it a lot\nbecause it was more realistic then the other batman films by Burton.\nthis movie was awesome. i liked it a lot because it was more realistic\nthen the other batman films by Burton. this movie was awesome. i liked\nit a lot because it was more realistic then the other batman films by\nBurton. this movie was awesome. i liked it a lot because it was more\nrealistic then the other batman films by Burton. this movie was\nawesome. i liked it a lot because it was more realistic then the other\nbatman films by Burton.\n"},
{"review": "\nThis is certainly, without question the best Batman film ever made,\nalthough that isn't saying much. Christopher Nolan makes this into a\nvery dark and brooding tale that tells more about Bruce Wayne than\nBatman, something the other movies would never have done. Nolan is a\ngreat director and he takes a great leap of faith by showing perhaps\nthe most important screen superhero in such a way that the city of\nGotham and its components don't feel like taken from a comic book, but\nfrom real life. Batman Begins is based more on graphic novels and the\noriginal characters by Bob Kane, so the realism and details are there\nwithout all the fluff and showboating Joel Schumacher would have put\nout. Christian Bale is perfect as the title character and he creates a\nmore interesting Bruce Wayne than Batman only because we see more of\nWayne in this installment. All other roles are perfectly cast,\nespecially Liam Neeson as a mysterious yet intelligent and brutal\nmember of the League of Shadows. Katie Holmes is nice and sweet as\nWayne's childhood friend, and there will never be another Alfred as\nlong as Michael Caine resides.<br><br>Simply put, Batman Begins is worth the time and money. It pulls you\ninto a world you would never expect to see in a Batman movie, than\ntransports you to Gothan City, the rotting core of it mostly. When we\ndo get a glimpse of Batman, it really is quite different than other\ninterpretations. The action here is based more on suspense than\nviolence and the plot moves along quite well to make this movie feel\nshorter than its 140 minute running time. So, if you are going to see\nThe Dark Knight this weekend, be sure to check this out first. Indeed,\nif it is anything like this one, this franchise is going somewhere\ntruly spectacular.\n"},
{"review": "\nWhen asked who your favourite superhero was, these 3 are some of the\nbiggest household names. We have now seen all of them portrayed in a\nrecent movie (or 3 in spiderman's case) and we are confronted once\nagain with the burning question of who is the greatest...<br><br>To compare all of them, batman is the most human with no extreme alien\nqualities such as web or superhuman strength. Batman relies on\ntechnology and his incredible fighting techniques to destroy his enemy.\nIt is impossible to relate to any of these superheroes yet the human\nfactor of Batman makes him a far more interesting character. That and\nhis car...<br><br>Spiderman is of course a legend, he needs to keep up the much more\ndifficult facade of Peter Parker compared to the other 2 heroes. The\npopularity of spiderman is noteworthy and the 3rd movie is a testament\nto this.<br><br>Superman is the least imaginative of all the superheroes mainly because\nhis superpowers are clichéd and unimaginative. The latest superman\nmovie was by far the biggest waste of film in the last 50 years. Never\nbefore have I hated a movie so passionately. Smallville however is a\ndifferent story, it has all the makings of an awesome beginning to\nsuperman. Except.... As with so many series, if it takes off in its\nfirst season, the writers crave a bigger paycheck and in their endless\ngreed the storyline goes straight to hell. Sad but true.<br><br>So, in conclusion Batman is the clear winner in this skirmish with\nSpiderman in a close second! Unfortunately superman falls way back, and\nas they say, \"Those who fall behind, stay behind\".\n"},
{"review": "\nThis is the best movie about Batman bar none. This is an excellent film\n, it can't really even be classified as a comic book Super Hero movie.\nIt is that good. Great characters , great story, and of course great\naction. I highly recommend buying the DVD, you won't be\ndisappointed.Christan Bale is totally believable as Bruce Wayne and\nBatman. Unlike the previous movies Batman is the star of the film. Also\nthere are no campy elements or corny one liners. And the car!! Batman's\ncar in this movie is exactly what a vigilante would need or use in the\nreal world , because a sports car can be stopped, not this baby. No\nneon lights, no huge fins , no nonsense, Batman's new ride is awesome.\nKeaton did a fine performance as Batman , but I had a hard time\nbelieving he was Bruce , and physically Batman. Bale came in with the\nheight , build , and attitude. Chris Nolan did an outstanding job\ndirecting this instant classic.\n"},
{"review": "\nThis movie is one of the best movies ever made, if not the best in my\nopinion. I never had my hopes up of it being anywhere near as good as\nwhat it turned out to be. People that have not seen it I urge you to\ntake a look because it's worth it. I bought the DVD collector's edition\nand will cherish it for the rest of my life. Trust me I never bought a\nDVD movie let alone a DVD collector's edition for any other movie\nbefore. I just can't wait to see the sequel.<br><br>Hopefully they keep most of the original crew so it has the same\natmosphere from Batman Begins cause if they do, it'll be another\nkick-ass movie.\n"},
{"review": "\nBatman Begins is definitely the best Batman movie to date and one of\nthe better movies of 2005 and of all time. The real credit to this\nmovie should go to director Christopher Nolan who has produced a\nbrilliant movie. This movie is so great because it does something that\nthe other Batman movies didn't..... show exactly how different (and\nbetter) Batman is from other heroes and superheroes. The acting was\nbrilliant (with the exception of Katie Holmes). Liam Neeson would be my\npersonal pick from this movie.<br><br>But I am a bit surprised that some people are complaining about the\nconfusion surrounding the action scenes.... for god's sake that's how\nit's meant to be. The confusion surrounding the fight scenes is another\nfactor that makes Batman different.<br><br>All in all it's a brilliant movie. The only thing that wasn't working\nfor it was Katie Holmes. But I still gave it 10/10.<br><br>Can't wait for the sequel.\n"},
{"review": "\n\"Batman Begins\" finally has captured the true spirit of the character\nof Bruce/Batman from the comics. This live-action adaptation has been\nsmartly directed, scripted, and cast to produce the more realistic dark\nnature of a human hero out to avenge his parent's murder with every\ncriminal that threatens his Gotham City. It's the best of all the\nBatman movies, and stands tall next to the godfather/blueprint of all\nsuperhero movies, 1978's \"Superman\". Where \"Superman\" left off with a\nmore campy telling of it's superhero, 'Begins' ushers in a more adult,\nserious take on it's mythic hero, dispensing with any camp and treating\nBatman seriously, grounding him in a more realistic environment that is\nmore accessible for the audience without dumbing down the story.\n"},
{"review": "\nI am not a Batman fan...actually i am a Superman Fan.But after watching\nthis movie i was overwhelmed! Definitely its a good movie!! Much better\nthan the previous ones.But Christian Bale completely amazed me. I have\nseen most of his movies. He always did some great movies but never got\nrecognised properly.What a great actor he is. He did this double role\nof Bruce Wayne/Batman so naturally that it made me almost believe that\nhe is actually this person.For the first time Batman/Bruce Wayne was\nhuman..we could see his fear,grief,rage,love. Now about the movie..all\nthanks to Christopher Nolan that he did this movie.Otherwise we could\nhave never known that a superhero movie could be made so earthly!!\n"},
{"review": "\nI'm a big Batman fan, and I got to say that this movie was the best\nBatman movie ever. Even better than the 1989 original w/ Michael\nKeaton. I thought Christian Bale did an excellent job, the suit and the\nnew Batmobile looked more realistic, can't wait for the next one. I\nreally want to try the new video game. They even filmed it in IMAX and\nI heard it;s now the highest grossing IMAX movie. If you love Batman, I\nstrongly recommend to own it when it comes out on DVD. I know I'm\ndefinitely going to own this one. I even have a tradition of when every\nhouse I moved into the first movie I put on is the '89 version, but\nwhen this comes out the new one is gonna take over. If I were to rank\nthe top 3 Actors that portrayed Batman: 1. Christian Bale 2. Michael\nKeaton 3. Kevin Conroy (Animated Series)\n"},
{"review": "\nThis was definitely the best movie I saw all summer! i think i saw it 3\ntimes and loved it every time. I also saw it in IMAX and that was such\na thrilling experience. I've never seen such a great ensemble of\nactors. First of all, Christian Bale was absolutely perfect for the\nrole of Batman. His acting is absolutely phenomenal and he brought a\nnew edge to the Dark Knight and i think this franchise really needed\nthat and i have to tip my hat off to him for buffing up for this role\nafter being so sickly skinny for The Machinest- now thats a dedicated\nactor. Michael Caine was definitely the comic relief of the movie and\nbrought some pretty funny one-liners, but overall this movie was a\nserious, emotional thriller and thats what made it so great! Morgan\nFreeman was also quite funny and enjoyable to watch as the somewhat\nsidekick of Batman. Liam Neeson was brilliant as usual, but Katie\nHolmes I was not completely happy about, but the movie still turned out\ngreat and I'm definitely buying it the day it comes out on DVD. I just\nhope the special features are as great as the movie. To top it off, I\nalso thought the music was phenomenal as well. This is definitely a\nmust see and #1 on my list.\n"},
{"review": "\nBatman Begins is by far the best comic based movie I've ever seen. I\nknow that is a bold statement but there are a couple of reasons I say\nthis. The depth of character is terrific. The motivation of the nemisis\nis far more complex than usual. It's not just, \"I'm evil and wanna rule\nMiddle Earth.\" Bruce Wayne struggles to become great. His insecurity\ninduces him to strive. He grows as a person and as a hero as the movie\ndevelops.<br><br>Lucas, who's wisest of all characters, Yoda tells Luke, \"Do or do not.\nThere is no try.\", a truly silly line as we all know we grow through\nour failures so long as we don't quit. Bruce's father, by contrast,\nasks, \"Why do we fall?\" With perfect pause and delivery he continues,\n\"We fall, so we can learn to pick ourselves up.\" This is but one scene\nwhere Nolan sets the tone and timing perfectly.<br><br>The filming, dialog, action, characters, plot and oh yes, the acting\nare all superb. I rarely leave a movie completely satisfied and almost\nalways have something I'd change. This movie is my first 10. I only\nwish I possessed the skill to better articulate my appreciation. Flat\nout, this movie not only raises the bar for comic-to-film efforts but\nfor action dramas in general.\n"},
{"review": "\nwho is batman? from now on it is without a doubt in my mind that\nChristian bale is the ultimate batman. i know this is shocking to hear\nas Micheal Keaton was moody, dark and superb but bale has something\nthat no other screen batman had, the sense of rage, anger and the\nactually possibility of snapping emotionally like the original DC\ncomics. Batman always seemed he could snap, and bale, an expert at\npsychological roles (american psycho, the machinist) actually looks\nlike breaking down in parts of the film. but this film is not just\nabout bale. Bow down to the king of creepy, Cillian Murphy. what a\nchange from the scruffy git in 28 days later to the smirking and\noutright shocking scarecrow. the first time scarecrow appeared on\nscreen the cinema sounds near threw me from my seat. personally, i\ncan't wait to see him in red eye.then there is Micheal Caine, humorous,\nconfident, great acting (as always) and for the first time relaxed.\nAlfred is not some posh pompous servant but a helper, an essential part\nof the team which was neglected in some of the earlier films. there are\ntoo many good performances in this film to mention, so i'll leave it\nwith this, marvel have got their work cut out!!!! BALE!!!!\n"},
{"review": "\nFirst of all, this movie was fantastic. Even if there were some\ninconsistencies (I certainly didn't notice them in the theater) the\nmovie was smart, dark, sexy, humorous, and concise. Nothing dragged on\nor lost my attention, at any point. I am not a huge fan of the other\nBatman movies, but this is clearly the best one. Christian Bale is\namazing and even that stupid idiot Katie Holmes was able to take\ndirection. I'm pleasantly surprised. However, my question to all of you\nis this: Why does everyone seem to think there is going to be a remake\nof the first Batman? And with some kind of name like Batman: Rise of\nthe Joker. BATMAN BEGINS was clearly a PREQUEL, people. The end of the\nmovie clearly set up the connection to the first Batman. And that's it.\nThat is probably the end of the Batman franchise: Batman Begins.\n"},
{"review": "\nWell it is summer movie season and I've seen two movies in two days. I\nam a BIG scifi fan and was really looking forward to War of the Worlds.\nToo many inconsistencies, and a fast ending left me flat. I then had\nthe pleasure of Batman. The plot was tight, the best Batman ever. The\ngadgets and the car were great, and the actors right on. The pacing was\nwas good, and exciting, and the emotional ties to the audience were\ngreat. I thought this was a much better movie than War, just much more\nenjoyable. It could have something to do with the War plot being a\nrehash of an old movie, and a book, but the IMDb votes speak loudly for\nBatman as the better movie. If you choose one choose this one! I do\nagree with Cruise on one thing: Katie is one cute woman!\n"},
{"review": "\nOK guys,listen up.I 've grown up with batman but trust me,this will not\naffect my judging. Christopher Nolan Made an excellent work with his\ncamera games.Besides we couldn't expect less from the director of\nmemento right? The script,is excellent.It showed us cleverly Bruce's\nchildhood (through nightmares,or memories and stuff),yet the dialogs\nare awesome,full of emotions and pretty smart if u ask me. Acting was\nsuperb,especially Bale deifies his role as batman.You see thats the\ntrue face of batman.Scary and rough mostly. Also i must say that i am\nvery satisfied from the effects of the film.It has few 3d effects,and i\ncan say that the way that this batman is made,is everlasting Guys u\nmust see this movie...\n"},
{"review": "\nWhere is Gotham City? I only ask because this movie makes you feel as\nif you could actually go there, as if it actually exists somewhere. I\nliked Tim Burton's Batman, but Christopher Nolan's vision is so well\npaced and so real, that it is, in my humble opinion, the first REAL\nBatman movie. Christian Bale brings Batman to life with all of the\nemotion of a real person, I guess it takes a real actor to do so. The\nsupporting cast is a group of actors with so much character that they\ncould have had there own movies. Alfred is awesome. So many great\nmovies stumble some during their running time, but this one did not\nmiss a step. 10 out of 10. I wonder if Bruce Wayne would give me a\nloan?\n"},
{"review": "\nAs a fan of the comic books, I've been disappointed with the more\nmainstream comic translations (Not Sin City, or Road To Perdition, or\neven American Spendor). This movie has it all. For the drama nuts deep\npsychological depth and character development. For the action buffs,\nthe coolest fight scenes. Comicbook fans will feel a bit annoyed by\nsome oft points, but's good enough. It's dark and how Batman is\nsupposed to be. Keep in mind this is better than the last four by a\nlandslide. Unlike Spider-man one and two, it has appropriates humor.\nThe acting is strong, and the impact will linger within you. This will\nbe one of the most entertaining movies out there,\n"},
{"review": "\nThis is an exceptional movie, filled with coolness from start to\nfinish. Christian Bale kicks bootasky, and he has a little help from\nhis friends. You know a couple of small time actors like Michael Caine,\nRutger Hauer, Morgan Freeman, Gary Oldham, even Katie Holmes was\nexcellent. Christian Bale did a great job, he was believable, and\nintense without being melancholy. Fantastic. They did such a great job\nof bringing Bruce Wayne to life that you find yourself enjoying the\nscenes with Bruce, as much if not more than The Bats himself. Tim\nBurtons first Batman film will always remain a classic, but this film\ngoes along way towards knocking it off the top of the mountain as the\nbest Batman movie ever!<br><br>Well written, well directed, well acted, well go see it monkey boy!!!\n"},
{"review": "\nGoing into the theater I had a lot of high expectations for Batman\nBegins. I am a die hard fan of the Batman movie franchise that started\nwith Michael Keaton, and I was hoping that Christopher Nolan would\nbreathe life back into the lungs of a fading dynasty. Keaton's Batman,\nwas a very dark films, yet Bale's depiction takes it to an even darker\nlevel. This Batman is more of a man than an impervious superhero.\nBatman Begins depicts not only Batman the hero, but also the man who is\ntrapped behind the mask. Christian Bale's Batman is the most intense\nand ruthless Batman yet. He seems to be the Batman straight out of\nArthur Miller's \"The Dark Knight Returns\". He is more violent, more\nangry, and seemingly more vengeful than any Batman of his time. It was\na real treat to see a Batman movie that deals directly with Bruce\nWayne's transformation into Batman, as opposed to flirting around the\npremise of simply being out for justice. This movie was less focusing\non the action sequences (which were exhilarating) and more on the\ncharacter development, which is the true heart of the Batman legacy.\nBatman Begins was a beautifully made movie, with powerful dialogs and\nexcellent acting. It was so worth the ticket price that I wouldn't have\nminded having to pay for a few guests. Can't wait for a sequel!\n"},
{"review": "\nFor future comic book heroes movie wannabes, this is how a superhero\nmovie should be made. I can name major and minor aspects of the movie\nthat hit bullseye on everything to do with Batman. All the original 4\nBatmans are crap compared to this one. And yes, it really does out beat\nthe first movie. I don't care what anyone says, Joker doesn't even\nstand a chance against this version of Batman. The one thing that\npeople overlook about being a Batman fan and a critic of this movie is\nthe fact that at the end of the movie. Batman chose to deal out his\nversion of justice. Batman was and has been in between good and evil\nfrom the Year One comics. For people who saw this movie, he chose to do\nwhat he did at the end of the fight in the train. That was and still is\nBatman's version of justice. I am so proud of this movie that I'm not\ngoing to download it and I will respect the copyright of it and will\nwait for this movie to come out on DVD. This movie deserves your $7.50.\nI plan on seeing it again this weekend and next paycheck. This really\nis the movie that you have been waiting for. This is a movie of a\nlifetime that will truly represent future superhero movies to come.\n"},
{"review": "\nIt's not merely the best Batman movie, it's quite possibly the best\ncomic-book movie ever crafted. Seeing it on the big screen last night\nwas a thrill, the kind of thrill provided by the original \"Star Wars\"\nor \"Raiders.\" <br><br>Breathtaking cinematography combines with genius editing to replicate\nthe comic experience in a way no movies have-- the experience of\ngorgeous art telling a tale in panels that aren't necessarily\nsequential nor do the spell out what's happening in a pedestrian way.<br><br>I'd suspect that Frank Miller would be impressed by this film.<br><br>The action sequences are so well-crafted and presented in such a unique\nway, I was reminded of the feeling I got watching the U-Boat landing in\nthe beginning of \"Saving Private Ryan.\" The difference is that\nSpielberg shot his wad in those first grueling minutes and was unable\nto return to that momentum during the rest of \"Ryan.\" In the case of\n\"Batman Begins,\" Nolan teases us with an ingenious prison fight\nsequence that is actually built upon--even topped--as the movie\nprogresses.<br><br>This is finest E-Ticket ride, a roller-coaster that builds momentum to\na thrilling conclusion that leaves the audience in wild applause. An\nintelligent, complex, brilliantly executed piece of film-making that\njust so happens to present the most authentic picture of the Dark\nKnight we've ever seen. Go ahead, file away that old 1989 copy of Tim\nBurton's \"Batman\"-- there's a new sheriff in town and his name is\nChristopher Nolan.<br><br>It just doesn't get any better than this. Can't wait to see it in IMAX.\n"},
{"review": "\njust got home from seeing batman begins. its the best batman of the\nseries, it has the best batman actor (christian bale), and it is just\nan awesome film!! from start to finish it brilliant, Christopher Nolan\n(a fellow UK person) has pulled off the impossible and best Tim Burtons\nBatman with Michael Keaton, its beat that by miles!! The bat-mobile is\nf**king excellent, the bat suit is brilliant, its has no nipple sh1t,\nits the best! what i think now is forget about the other batman films,\njust let Chris Nolan take batman into his direction, which is the right\ndirection! Christian Bale is excellent as batman, its like he was born\nto be batman, Michael Caine was superb as Alfred (a fellow London\nperson like me), Morgan freeman as luscious fox was just great, the\nwhole cast i just want to say thank you.<br><br>And this film in my opinion is the best film i've seen for years Thank\nyou Chris Nolan and Christian Bale\n"},
{"review": "\nMY ORIGINAL 2005 REVIEW<br><br>'I went to the midnight showing last night, and I've also been to see\nit again this morning, and both times I left feeling thrilled and\nexcited. I've been waiting for this film ever since it was first\nannounced and let me tell you it doesn't let you down one bit. Now I\ndon't want to go through explaining the story, I just want to say how\ngood this film is. It's the best Batman film ever, now I'm a big fan of\nTim Burtons, but after seeing this, I couldn't imagine another Batman\nor another version of Gotham. The film expelled on all levels. I\nremember the anticipation I had before going to see Terminator 3, but\nfelt really let down when I came out. But not this one, I just couldn't\nwait to get in and see it again. So I've been twice already and I'm\nplanning on going again tomorrow morning. I'm going to stop babbling\non, but if you go to see three films this month, go see this first,\nthen star wars and then Mr &amp; Mrs Smith. This is the best film of the\nyear so far and the best comic movie alongside Superman The Movie! PS\nThank god this movie eradicates the camp Joel Schumacher versions. Long\nlive Batman!'<br><br>HOW I FEEL IN 2016<br><br>It's been 11 years since Batman Begins was released in the cinema, and\nsince then we've had The Dark Knight and The Dark Knight Rises,\ncreating one of cinema's all time great trilogies. I've seen this movie\nupwards of 20 times, it's one of those movies that is so good that you\nappreciate it every time you watch it without getting tired of it. It's\nperfectly cast, the action is exhilarating and drama is well written\nand acted. Batman Begins continues to be one of the best superhero\norigin movies out there.\n"},
{"review": "\nHaving seen the screening and witnessing how on the mark this movie is,\nI will be recommending it to anyone who has an interest in Batman.\nEverything from plot to writing to acting to music is bang on. It was\ngreat to see Gary Oldman play a good character instead of an evil one.\nAny movie that has Morgan Freeman, Michael Caine, Liam Neeson and Gary\nOldman is something to see. Christian Bale is perfect as Bruce Wayne as\nhe shows how his character came to be. The music is done by James\nNewton Howard and Hans Zimmer, creating an excellent mix of emotional\nand action scoring. Finally, any worries about Christopher Nolan doing\nan action/adventure are wiped away. Go see this movie!\n"},
{"review": "\nBatman Begins is nothing less than amazing. A feast for the eyes AND\nthe brain. <br><br>Whoa, I just got a little film-critic quotey there, but I can't believe\nhow damn good the film is. <br><br>This movie has more plot than the last four Batman movies put together.\nIt's less concerned with flashy visuals and more interested in layers\nupon layers of character development, story structure, and credible\nacting. Totally redefines the super-hero genre, even more so than Ang\nLee's Hulk.<br><br>Without any spoilers, I will say that the casting is perfect on all\nlevels, with some real fun bit parts from big name actors.\n"},
{"review": "\nBatman Begins is easily one of the best superhero movies ever made.the\nmovie basically tells the story of the genesis of the caped\ncrusader.obviously,there is a fair amount of character development\ninvolved,which you would expect based on the title.but not so much that\nthe film becomes tedious.Batman is shown as more of a full dimensional\ncharacter than in previous incarnations.this version is also more\nfaithful to the comic.Director Christopher Nolan shows great skill as a\ndirector,pacing the film very well.there are also some touches of\nhumour throughout and we get to see a more human side to Bruce\nWayne.The villains are also more fully realized than in most movies of\nthe genre,instead of simply being devices for the hero(the\nprotagonist)to have a villain(antagonist)to defeat.Gary Oldman and\nMorgan Freeman are standouts in their respective roles,as is Liam\nNeeson.Katie Holmes Has yet to reach the level of maturity require for\nher role,so she is a bit weak.This Batman movie is less cartoonish than\nprevious efforts,and is closer to the realm of realism(relatively\nspeaking)the movie is also more thoughtful than many movies depicting\nsuperheros there is much more substance.in fact more substance than\nstyle,though it is just stylistic enough.All in all a brilliant\ndepiction of the origin of the caped crusader.this movie sets the bar\nhigh for its successor,the Dark Knight,which is to be released sometime\nin 2008. 10/10\n"},
{"review": "\nWent in expecting a couple of hours of fluff action movie escapism, and\ninstead was treated to the best film of the summer. <br><br>Having villains who have honest motivations you can almost agree with,\nand heroes whose vigilantism you can almost disapprove of makes for a\nmovie asking real questions about what is \"right\" and what is justice\nvs. vengeance. It's not every movie that shows both sides of a war.<br><br>Great and unexpected plot twists, incredible action sequences,\nespecially the big batmobile chase, lush filming, all the explosions an\naction film should have, and yet a thought provoking story of loss and\nlove after all. A perfect 10, hit out of the park!\n"},
{"review": "\nThis was clearly an amazing movie, but I'm surprised no one has made\ncomments about it. The entire theater erupted in applause after the\nDark Knight flew off the screen - I've NEVER seen this in an action\nflick - the surprise factor really got everyone.<br><br>However, I had trouble with the film at the beginning - I kept losing\nconcentration and thinking this didn't feel like a Batman flick - let\nalone any other comic book film. However, when he turned it on in the\nairplane with Alfred after his final conversion I was an instant fan.<br><br>This is the first movie in a while that I want them to make a sequel as\nquickly as possible for.<br><br>Comments?\n"},
{"review": "\nTwo Words: Batman Begins.<br><br>The Batman franchise has been resurrected and it is better than ever. I\ncan't stress enough on how good this movie is. Christopher Nolan\ndirected (and co-wrote) a darker Batman that is portrayed perfectly by\nChristian Bale. A new youth and energy has been drawn out of the Batman\nlegend and displayed perfectly. All of the performances in this movie\nare stellar, and each one does not seem out of place or pointless. The\nmusic keeps your blood pumping with the action and never lets up. And\nspeaking of the action, you haven't seen anything until you see the\nBatmobile in motion. This thing is mint. I honestly wish that I could\nwrite something a lot better about this movie and go into great lengths\nof describing each piece of this glorious pie; but in all honesty, I\nwill simply ruin the movies for others. I am not one to keep secrets.\nSo please end my torment and go watch this movie. Then I will have\npeople to talk to about it.\n"},
{"review": "\nBy far--the best movie this year--and the best Batman movie ever.\nWhoever had the vision to cast Christian Bale as Batman deserves the\naward of the year. This movie was my introduction to him and the impact\nhe had on me was similar to the impact I felt when I first saw Russell\nCrowe on the screen. What a talented actor! (both of them). The movie\nwas not camp. It was serious and intense and made you almost believe\nthat there could really be a \"Batman\" out there someday. The villains\nwere menacing and nasty without being cartoonish and campy. The\nbackground story on Bruce Wayne was detailed and very welcome. It laid\na strong and credible foundation for everything he did. The other\nactors were also strong in their roles. Morgan Freeman is simply\nirreplaceable. What will we do if and when he retires? And what a\nturn-about role for Gary Oldman! He's another of my favorites. I'll\nnever forget him in Dracula--absolutely superb. But this movie belongs\nto Christian--no doubt about it. Great story, great effects, great\nacting, great package of a movie. Highest recommendation.\n"},
{"review": "\nI'm shocked that the film i loved when i was a kid, has come back in\nsuch a way, especially after the terrible forever film. what can i say\nthat already hasn't been said, everything about this film was brilliant\napart from Katie(child looks), but she cant help that. i recommend that\neveryone goes out and watches this film, it makes all the other\nsuperhero films fall short in comparison(including spider man). also\nwhat i like to say is that all the comments i heard before the film was\nlaunched have been blown out of the water, such comments as \"it will\nterrible because it has a British batman\". how wrong they where, with\nthe film being of mostly British and by having a British director\nreally paid off, it was made how it should have been and not\nhollywooded up like the originals. why the film is still of Hollywood\nit seems they are looking at us brits to bring the life back into\nmovies which has been missed i.e LOTR, Harry potter, and with many more\nin the works all i can say is keep it up.\n"},
{"review": "\nWhat else needs saying? Apart from a quick mention of the turgid idiots\nwho work the projection booth at Cheltenham Odeon, and let the film run\nblurred on numerous occasions. So sorry, even that couldn't ruin what\nis quite frankly the finest comics movie ever, better even than Sin\nCity, no need even to pause for thought about any of Marvel's efforts.\nLet's hope that Bryan Singer is prepared to bring it all to the table,\nbecause anything less than perfect will look like soggy crap. So there\nit is - great script, great acting, a great movie. Where do you start?\nIts not just the Batman movie that fans have waited there whole lives\nfor, it's the Batman movie that Batman has waited his whole life for -\nfrom bad comics in the thirties, through Adam West, and Frank Miller,\nand (God help us all) Akiva Goldsman. This is it, Batman as Batman\nshould be, Batman as we always hoped he'd one day be, Batman done\nright.\n"},
{"review": "\nI went seeing this movie already knowing too much about it. I had read\nthe leaked script almost a year ago. Had avidly followed every news\nabout it. But I was surprised to find the movie to be so fresh for me.<br><br>The biggest strength of the movie is that it is reality based. The\nmovie bases the myth of Batman in a real world. Maybe it demystifies\nbatman a bit too much. But its a very entertaining to watch how they\npull off a believable masked vigilante in a city which could be New\nYork City.<br><br>The cast is impeccable. Christian Bale's Bruce Wayne is a study of\nstudy of a troubled should tormented by the anger and despair of not\nbeing able to avenge his parents' mindless murder. His Batman is\ncertainly the most accurate till date. He portrays it like a madman\nlooking who believes that he really is more than human. The support\ncast is fabulous. Morgan Freeman, Liam Neeson, Michael Cain, Gary\nOldman, Tom Wilkinson, Cilian Murphy play the characters so well that I\ntotally bought some of the lines which might sound a little over the\ntop otherwise. Katie Holmes is bearable, she does enough to do justice\nto a well written character. Though I would have preferred the\ncharacter to be Harvey Dent. Cilian's Scarecrow is really creepy.<br><br>The action sequences could have been done better, but still are very\nentertaining. The Batmobile car chase is really thrilling. The fight\nsequences are brutal but a bit too speedily edited.<br><br>The ending leaves you wanting for more. There would surely be sequels.<br><br>The movie really captures the essence of Batman. One of the best lines\nis delivered by Katie Holmes at the end. She says to Bruce something to\nthe effect of \"This is your mask, the real you is Batman\". That to me\nis the essence of the myth that is Batman.\n"},
{"review": "\nI don't want to say too much about this film as i wouldn't want to\nspoil it for others. You can find out all the plot points etc many\nplaces.<br><br>Right, straight to it. The film is perfection. I didn't know whether\nNolan would pull it off. I was really excited at the prospect of a year\none/dark night batman film, exploring the origins and being smaller\nbudget. When it all started getting much bigger, i was worried. That\nhas gone now as what we have here is quite simply the best batman film\never and possibly the best comic book movie ever, though its a tie with\nSin City which also happens to be the most faithful.<br><br>The story was great and not lost under action set pieces, the action\nwas great, the score top notch, great cinematography etc etc.<br><br>I really cant recommend this film enough and advise you go and see it.\nNow\n"},
{"review": "\nNot to be too dramatic but we need a Batman. With all the injustice in\nour government and dark corners of the world, we need to believe that\nthere could be Batman. And in my thoughts all involved in this film\nhave delivered that to us. You leave the theatre believing in Batman,\nthat you could see Batman saving someone and you see that anyone with\nthe drive and means could be a hero - and thankfully you also see the\nramifications, the human aspect; the cuts and wounds Batman receives on\nBruce Wayne's body and the choices he must make to do what he must. <br><br>I don't agree with comparing this Batman film to Tim Burtons since I\nfeel they are different ideals of Batman and need to be seen as\ndifferent films. I will leave you with this however; Batman Begins is\nBatman. The actors are their characters, the film-makers have made a\nFILM not a two hour waste of time.<br><br>Thank you all who were involved, you've brought hope to Batman fans\nagain!<br><br>-A humble indie film-maker and comic book geek\n"},
{"review": "\nThis is not a continuation of the previous franchise. This is\ncompletely independent and completely original. Nolan's vision of\nGotham City is amazing. If you liked Burton's version of Batman, you'll\nlove this film. If you DIDN'T like Burton's version of Batman, you'll\nbe relieved by this film.<br><br>Goyer's script is very solid, but it's not what makes the film great.\nIt's 85% Nolan's direction, 15% acting/casting. Katie Holmes has the\nweakest performance, yet it doesn't at all detract from the film as a\nwhole. The focus is on Bale the entire time, with the occasional\nbrilliant performances from Oldman, Freeman, Neeson, Caine and Murphy.<br><br>The film is basically split up into two halves: the first is about\nBruce Wayne, the second is about Batman. It's preparation, then action.\nAnd each half will keep you on your toes the whole time. It starts off\nunlike anything you'd expect and builds the whole first half. When\nWayne finally gets back to Gotham, the audience is ready for Batman and\nknows exactly what Wayne is feeling about the loss of his parents, the\ncorruption of his city and the fear of losing it.<br><br>This is not a stupid action movie. It's a character-driven drama, with\nsome amazing action in it. If you have any hesitancy about seeing\nanother Batman movie, let it go. You've got nothing to worry about.\nThis is how Batman should be portrayed.\n"},
{"review": "\nWell, this movie in my view is the best of all the Batman movies.\nChristian Bale lived the role, he brought to the screen \"The Real\"\nBatman, dark and scary, which was depicted by the creator Bob Kane.<br><br>Right from the start, how Bruce Wayne is a victim of his own fears, the\nway he takes in his own fear and becomes fear himself is terrific.\nEnding was great, the scene where Gordon shows him 'The Joker' card. I\nhope they remake all the Batman movies right starting from The Joker.\nIt would be great for all the Batman lovers.<br><br>Comparing with Spider-Man, you can't compare these two. They are\nsuper-heroes but they are in a different league of their own. Spidey\nhas super powers while, Bruce Wayne uses his money and brain to become\na super-hero. Thats where we have to draw the line.<br><br>Oh, and by the way THE BATMOBILE IS FANTASTIC.\n"},
{"review": "\nJust saw this tonight (Thursday 16 June). When I first heard of the\nproject, I thought \"Another one? Christian Bale???\" I forgot all that\nin a hurry! This film is what the others should have been. I found it\nmore credible and realistic than the others and the acting gave it the\ndepth that the others failed to create. The \"new\" Batmobile ROCKS!\nEssentially, scrap the other shows as this is not really a \"prequel\" it\nis a fresh start. The telling of the parent's demise and the origin of\nthe \"Dark Knight\" has been retooled, which supports this as a new\nseries even though it hasn't been long since the last Batman. Great to\nsee Sir Michael, the guy from \"28 Days Later\" and the guy from \"The\nFull Monte\" working on this with the impeccable Mr. Freeman. Best movie\nI have seen this summer. 1. Batman 2. Crash 3. Cinderella Man.<br><br>Cheers!\n"},
{"review": "\nMany wonder why Batman Begins is in the top 100 on IMDb top 250. The\nanswer is simply this: This movie redefined what a summer blockbuster\nshould be like.<br><br>The summer blockbuster before this was supposed to be a mostly an\naction/effect based film with a mix of comedy and drama, however the\nmovie in the end was about and memorable for the action and F/X. Batman\nBegins however, did something different. It had the action, though\nlittle F/X. But it made the dramatic elements of the movie just as\nimportant as the action. The comedy element stayed the same as it\nbefore, thus creating this new genre of film: A dramatic action\nblockbuster.<br><br>Nolan and Bale are the two big people to thank for this new genre.\nNolan direction and Bale acting combined created this genre that made\nyou think about the world and your actions, BUT IT ALSO was a fun film\nthat entertained you and had great one-liners.<br><br>The messages that you learn from this are valuable in life and ones\nmost should follow. They are real.<br><br>However, there is also that fantasy element thrown in this, where your\nmind is suspended in disbelief, such as the batank \"flying on\nrooftops.\" This element is actually necessary to the film. For without\nthis, the film is just this character-drama. And without the other\nelement, the film is just another action-film. But combined, you get\nthis dramatic-action that you just can't help but love because there\nare just too many reasons to love it.<br><br>If you're an \"art house\" guy, you can love the film for the character\ndrama. If you're just a regular movie-goer, you can love it for the\naction. And if you're like me, who is sort of a mix, you can love it\nfor everything as it has everything from all the genres.<br><br>Batman Begins may not be considered to be one of the greatest to most,\nbut most can not deny that this film has redefined what a summer\nblockbuster should be. From now on, all blockbusters quality will be\njudged upon this film.\n"},
{"review": "\nI saw Batman Begins on opening day and let me say WOW. I was very\nimpressed at the way this movie was put together. First I would like to\ngive props to director Christopher Nolan (Memento) for creating such a\nmore believable Batman then its predecessors (B, BR, BF, B&amp;R). I like\nhow the first half of the movie focuses on the character of Bruce Wayne\nand not Batman. This allows viewers to get a more detailed description\nof why he became Batman and his reason for choosing a Bat as his\npersona. The Cast was well assembled having the likes of Christian Bale\n(Bruce Wayne), Katie Holmes (Rachel Dawes), and Cillian Murphey (The\nScarecrow). But what made this movie work were the more older veteran\nactors such as Morgan Freeman who plays the helpful Lucius Fox, Rutger\nHauer as power hungry Earle, Liam Neeson as the mysterious Henri\nDucard/Ra's Al ghul , Gary Oldman as the honest Jim Gorden, and Michael\nCaine as the insightful Alfred. These characters are the ones the made\nthe story move. I recommend everyone to see this movie. There are many\nplot twists that only Christopher Nolan can conjure so go see it 4/4\n****/****\n"},
{"review": "\nI don't know about you, but I was tired of comic book films. They\nturned out to be OK, mindless fun. After a while this gets tiring.<br><br>This movie, however, is different. It has depth, interesting\ncharacters, and an even more interesting story. It's got action, humor,\nthrills, chills... It has everything you could want in a movie.<br><br>Critics have had three major complaints: The dialouge, the fight\nscenes, and the new Batmobile.<br><br>Dialouge- Yes, there are cheesy one-liners. But come on, this is\nBatman! Every super hero needs to utter cheesy one-liners as they beat\nthe crap out of a thug and/or supervillan. This part added to the fun\nfactor.<br><br>Fight scenes- They say the editing was to quick, and you couldn't tell\nwhat was going on. They don't realize that this is supposed to happen.\nWhen Batman attacks, it is chaotic, and the attacked do not know what\nis going on.<br><br>New Batmobile- I loved it. It was actually different. We got away from\nthe sleek design that we had seen again and again... We got something\nnew.<br><br>All in all, a great film that I definitely recommend.\n"},
{"review": "\nBatman is back and he takes the form and exudes the aura he should have\nhad in the beginning. All previous versions, with mild exception for\nthe first, were travesties that made a lot of money. It is nice to see\na movie about a hero that truly shows the battle that they go through\nin their own minds. In order to understand why they do what they do we\nmust be able to grasp how their minds have become twisted.<br><br>This movie completely blind-sided me......I was expecting another\npopcorn superhero movie and walked out of the theater\nuttering....\"Damn!\", over and over again. It came at me in such an\nonslaught that a second viewing will be required to grasp what\nhappened.<br><br>I won't bother with a synopsis because if you don't go see this movie\nthen you will miss one of the year's best and should just stop buying\ntickets. ENJOY!!\n"},
{"review": "\nI believe this is the best Batman film yet. This one explained how he\nis and what he does better than the original Burton/Keaton film's feel\nof \"I'm Batman, I can, Deal with it.\" I loved the explanation of all\nhis \"Wonderful Toys\". The Scarecrow and Ras Al Gul were great villains\nfor the choice in his first superhero encounter. Batman uses fear in\nsuch great ways this go around. There were comical moments but not\nenough to throw off the darkness the film meant to portray. Michael\nCain was a great Alfred and Gary Oldman was a great younger Gordon.\nAnother great feature to the suit was the fact there were no nipples\nthis go around.\n"},
{"review": "\nIn all honesty, it was one of the best movies I have ever seen. I was\nthoroughly entertained throughout, and went through multiple emotions.\nI seriously began to tear up at one point, and I cheered out loud at\nanother, and laughed out loud as well. Excellent plot, great acting,\nand jaw-dropping action all make this the finest of the Batman films,\nand one of the finest movies I've ever seen. One of the best parts\nabout the film is that the \"romantic interest\" doesn't interfere or\nde-rail any parts of the film. In fact, it's hardly a \"romantic\ninterest\" at all! When you see the movie, you'll see what I mean. There\nreally isn't much I can say, except that I went into this movie with\nVERY high expectations, and I still had no idea that it would be this\ngood. At no point was I bored, and there is nothing in the film that I\nfound unnecessary. A must see for anyone, especially Batman fans\nwaiting for a film that lives up to the lofty standard set by Tim\nBurton with the original Batman movie with Michael Keaton. In my honest\nopinion? Batman Begins surpasses those standards. I'm not sure how\nanother installment from this cast and director would fit into the\nseries, but here's hoping that they do.\n"},
{"review": "\nVery fun and entertaining. If you like to go to the movies to have\nfun...see this film. It has adventure, action, true emotion, brutal\nrealism, interesting characters, and a fun story. I watch a lot of\nmovies, and I have to say that this was the most fun I had at the\ntheater in a long time. Also, if you are a fan of the true dark Batman\nfrom the comics, you will be very pleased. This movie fully explains\nwhy a man would dress up like a bat and fight crime. When Bruce Wayne\nfinally dons the bat suit, it doesn't seem ridiculous at all. Don't\nbring young children under 10 or 11 to this movie expecting a campy,\ngoofy film. This film is dark, with brutal violence and very scary\nimages. An example of this would be the character the scarecrow. The\nScarecrow uses a fear inducing toxin to make people hallucinate, and\nyou get to see some of the hallucinations. Also the story is quite\ncomplicated for a young kid to understand. If you have a tough kid who\nloves movies, don't worry about it.<br><br>Overall, this movie was awesome!\n"},
{"review": "\nI have to say that after seeing it for the first time I was thrilled.\nAfter the second time i confirmed what i thought. this is without a\ndoubt the best batman film ever made. whether you're a fan of the\ncomics or not everyone should love this movie. Anyone who doesn't at\nleast enjoy it somewhat can only be one of those types who always have\nto go against whatever is popular just for the joy of going against the\nmajority. <br><br>Bale is the closest Bruce and bats to the comics I've ever seen and i\nhope he stays on for all of the sequels in the new franchise. Micheal\nCaine actually turns Alfred from an old nanny to an important character\nwith a lot to add to the story, and the film perfectly sets up why\nthere are so many frigging villains running loose in Gotham, in fact it\nsets up three specific villains by the films end.<br><br>I pleas and beg with everyone out there who thinks they're too grownup\nor cool or just not a comic person, give it a chance i bet you'll love\nit. We need to make sure this one does well or else as punishment\nthey're gonna let Schumacher make another one with egghead and the evil\ncowboy from the Adam west show as the villains.\n"},
{"review": "\nI was fortunate enough to be able to see an advanced screening of\nBatman Begins and it was more than worth the two hours that I had to\nwait in line to get in to it. Christopher Nolan brings the darkness and\ndepth to Batman that the franchise so desperately needed. The film's\ncharacters and story lines all revolve around the concept of fear and\nNolan makes it the perfect psychological element to this iconic\nsuperhero. Christian Bale is fantastic and even manages to hint at\nMichael Keaton while in the famous cowl. The rest of the cast is superb\nas well; Michael Caine is a riot and Cillian Murphy is perfect as the\nScarecrow. Batman fans will not be disappointed and will want to see\nthis installment again and again.\n"},
{"review": "\nOh my god, what a good movie this this. It could have been a banana\nskin for Warner Bros., but director Christopher Nolan has produced a\nfresh take on an old subject and done it extraordinarily well.<br><br>\"How does one man change the world?\"<br><br>It's a question that haunts Bruce Wayne (Christian Bale). The death of\nhis parents, murdered on a Gotham street outside the Opera house has\nfilled him with guilt and anger. Disillusioned with life and seeking\nthe means to fight injustice, he travels the world to educate himself\nin the ways of the criminal. Emerging from this phase in his life,\nBruce starts to become the Bat man and what an adventure it is.<br><br>This film really is great. Primarily filmed in the UK with bits in\nIreland, Iceland and Chicago, this is yet another American backed film,\nshot in the UK with British/Irish and Welsh actors aplenty. Of course,\nthey are mainly playing Americans and doing it very well.<br><br>Refreshingly, Gary Oldman is playing a good guy and Tom Wilkinson is\nplaying a bad guy. Cristian Bale is perfectly cast for the Bruce\nWayne/Batman role and it was a real kick to see Rutger Hauer back in\nthe big screen in a major film. At least with Rutger, his performance\ndidn't once make me think of Blade Runner.<br><br>This was not the case with Liam Neeson as he, in essence, reprises his\nrole as Qi Gon from The Phantom Menace. Katie Homes puts in a decent\nperformance and Morgan Freeman is a good as ever. Michael Caine was\nbrilliant as the butler Alfred. His accent turns from butler British to\nLondon, East End Cockney by the end of the film. He has a few classic\nlines and I'm sure that when the sequel is made and believe me, there\nhas to be one, he will star prominently.<br><br>Batman Returns will be a massive hit. Excitingly, there is also an IMAX\nrelease.<br><br>Verdict: Best film of the year 10/10.\n"},
{"review": "\nAfter being disillusioned by just about every comic book \"blockbuster\"\nof recent times, Batman Begins comes as a nice surprise. The film draws\na lot of visual inspiration from Blade Runner and looks all the more\nimpressive for it. The storytelling is done at a decent pace, giving\neach stage just enough time to have an impact before moving on. On the\nacting front Michael Cane as Alfred steals the show serving as the\ncomic relief. Katie Holmes is a bit disappointing but her role is\nlargely forgettable. Christian Bale does an excellent job of\nre-imagining Bruce Wayne, even if he doesn't look quite right with the\nmask on. Just goes to show, with this and Sin City looks like Hollywood\ncan do Comic Books.....\n"},
{"review": "\nconsidering the history of the batman movies you would think that this\nwill be a classic well it is .<br><br>the last batman movie was so bad with George Clonney as the caped\ncrusader and also was so disappointing that it nearly made the whole\nfranchise crumble , but batman is back and blacker than ever this time\nChristian bale is taking up the role and he does a very, well great job\nas the man himself .<br><br>this time the movie focuses on his decent into batman and it is very\nwell told as it is a difficult subject to handle .<br><br>all i will leave you with is that this is a very interesting movie and\nafter star wars the summer time has never been better for big budget\nmovies .\n"},
{"review": "\nI caught this offering on a freeview channel. And at first I began to\nwonder if the listings had got screwed-up. Where was Batman? For a\nseemingly indefinite time, somebody - I suppose it was Bruce Wayne -\nwas faffing about in what I think were the Himalayas. They were\nmountains anyway. There was a bald-headed monk with a self-satisfied\ngaze like a hang-over from Quai Chang Kane's adventures, and Wayne\ngetting the crap kicked out of him frequently. Here, I gather, was\nsupposed to be the 'why he became Batman' expose, but the whole boring\nand verbose pantomime went on for so long that this little grasshopper\ndozed-off before he could grasp the pebble.<br><br>I've awarded 3 ex-gratia stars for whatever I missed because so many\npeople rave about this movie. But judged by the 20 minutes or so of\nwhat I did watch I'd offer no stars at all as it couldn't even sustain\nmy attention enough to keep conscious.<br><br>I would suggest aspiring viewers fast-forward to about halfway through.\nPresumably it livens-up a bit.\n"},
{"review": "\nSuperheroes have been a part of our culture for nearly a century now\nand they have many, and I mean many ardent fans. For some reason I\nnever got into that world nearly as much as others, but from what I do\nknow and what I've seen I can see why they get so much love. Batman,\nbeing one of the more well-known superheroes, became a hit movie series\nin the late 80s and early 90s, but many felt that after 'Batman\nReturns' the series lost it's footing and became too over-the-top and\nsilly. The last one was a critical failure and even though it still\nmade a decent chunk of money, it made less than both it's budget and\nit's predecessors. For eight years there was talk of another, with\nideas ranging from a prequel to a reboot as they like to call it now.\nWhat we got was the latter, which after seeing the film for myself I'd\nsay was exactly what the series needed.<br><br>Pros: A first rate cast. Very nice production design. A good retelling\nof the Batman legend. It's nice to see a Batman film more grounded in\nreality. Stunning photography. An exceptional job from director\nChristopher Nolan, who gives us what may be the smartest and most\ngrown-up Batman movie yet. A memorable score that's at times subtle and\neven somber and fast and exciting at others. Moves at good steady pace,\nwhich starts a bit slow but picks up. Some exciting and well\nchoreographed fight scenes. Also many cool stunts. Some of the best CGI\nwork in recent memory.<br><br>Cons: Maybe a few minutes could have been shaved off the running time.<br><br>Final thoughts: I didn't really know what to expect from this film\nbefore seeing it. Afterwards it didn't matter because I was really\nimpressed. Many comic book related films are just plain silly, which\nisn't always a bad thing, but for this franchise it just didn't work\nand I'm glad it got back on track. Onto 'The Dark Knight' I go! <br><br>My rating: 5/5\n"},
{"review": "\nBatman Begins is actually a very good movie. I thought it would be more\nlike the first Batman from the original four, where it just begins with\nhim already Batman and he just has to fight some villain like the\njoker. This movie, however, delved even deeper in the world of the Dark\nKnight and took some creative liberties that really ended up paying\noff. I especially liked how they depicted the Scarecrow. He was not\nnearly as comic book as he could have been. No, in this movie he was\ngenuinely creepy and seemed like a freak. Batman's relationship with\nRas Al Ghul is also played up very well. Its sort of like the\nrelationship between Magneto and Proffesor x, where they both respect\neach other, they just have differing opinions about how to achieve\ntheir own goals.\n"},
{"review": "\nIt is the first Batman movie I have watched and I must say,I was hugely\nimpressed.Though I have not watched other Batman movies,I can tell that\nthis looks better than those made in the 90's.In a reboot of the\nfranchise,the story starts at the beginning,hence the name of the\ntitle.Christian Bale stars as the titular character,Batman as well as\nhis alter ego,Bruce Wayne.After certain issues in Gotham City that\noccur to Bruce,he leaves and travels the world in search of looking for\nsomething.He encounters a mysterious man by the name of Henri\nDucard(Oscar nominee Liam Neeson in one of his best roles) among\nothers.The cast was great including the likes of Christian Bale,Liam\nNeeson,Michael Caine,Gary Oldman,Morgan Freeman and even Katie\nHolmes.What was also good is the film focused on character and\nstoryline development instead of on just the action and Christopher\nNolan is the man to thank for that as he directed the film and written\nthe screenplay for the film.Watching this today has made me even more\nexcited for the next Batman film,The Dark Knight.Well done to everyone\nwho worked to make this film a great film.\n"},
{"review": "\nForget all about the previous Batman movies because this is the only\none you need to see! I know people who are not Batman fans and even\nthey said that they enjoyed it very much. I watched it again last night\nfor the umpteenth time and like the first time, I couldn't take my eyes\noff the screen! <br><br>This is one of the best movies I have ever seen! Christian Bale is the\nultimate Bruce Wayne/Batman. Michael Caine is an excellent Alfred! Gary\nOldman and Morgan Freeman are also very good. Christopher Nolan's\ndirection is faultless! The Acting is mostly excellent and the action\nscenes are awesome! <br><br>Next week sees the release of the sequel, The Dark Knight and I for one\ncannot wait to see it! After a very disappointing year for movies, I'm\nconfident that this one won't disappoint!<br><br>Batman Begins is a MUST-SEE movie! 10/10\n"},
{"review": "\nI was so surprised when I first saw this film simply because I thought\nit was going to be another stupid Batman movie...boy was I wrong.<br><br>When I saw that Christopher Nolan had directed this film I got pretty\nexcited because I had seen his previous movies and was a big fan; I\nespecially enjoyed \"Memento\". With already one good thing to this\nmovie, I figured why not check it out. I love the darkness of this\nfilm. It's a different take on the series and it works very well. The\ndarkness of the story, the characters, and everything else. I also\nreally liked how Nolan showed the origins of Bruce Wayne and how he\neventually became what he was destined to be, it was just great.<br><br>The acting is superb. Especially Christian Bale as Batman; he pulled it\noff very well and is probably one of the best Batman in the\nlong-running series. Cillian Murphy is very good as the villain.\nMichael Caine is good as Alfred and he and Bale have good chemistry in\nthe film making it all the more believable.<br><br>Overall, I really enjoyed this film and I can't wait to see The Dark\nKnight.\n"},
{"review": "\nThis is one of those few films that amaze you on pretty much every\nlevel and thats the truth.<br><br>From the directors point of view, it must have been pretty hard for him\nto try and clean up the mess from some of the previous films but Nolan\ndoes it flawlessly. He is able make a film about Bruce's journey to\nbecoming Batman which is sort of makes this film about redemption which\nadds to the power of the film.<br><br>The acting is some of the best I have ever seen. Christian Bale, Liam\nNeeson, Morgan Freeman, Michael Caine and Tom Wilkinson all give\nstunning performances but Cillian Murphy nearly steels the film with an\nincredibly scary performance which I hope he continues to do in the\nDark Knight.<br><br>This is beautifully well made film that can appeal to new and old\nBAtman fans and to those who aren't fans at all. The best Batman film\nat the moment which covers new darker ground but the way film is more\nabout redemption leaves you feeling at the end that this is no ordinary\nsuper hero film.\n"},
{"review": "\nI actually saw this movie for English, we had to do a essay on it\nbecause it had Gothic elements I loved this movie, very good action\nMusic was outstanding in my mind I don't really see what bad things\nthere are in this movie Like i said before, the action was good, the\nninja parts were cool, and the train scene I cant wait for The Dark\nKnight to come out, i think Heath Ledger had a Oscar winning\nperformance <br><br>Christian Bale was good as well, i liked the batman voice that he did,\nso if you have'nt see this movie, you better, it's been out for a few\nyears so your missing out\n"},
{"review": "\nI became a fan of Christopher Nolan after watching this film because he\nhas just changed the way superhero movies were made till now. He gives\nthe movie a dark look and a realistic look too. With excellent\ndirection there are top notch acting skills shown by Christen Bale. He\nexcels as batman on all ways.Surely all the other movies made on batman\nlook a piece of crap if you watch batman begins because surely this is\nwhat batman needed in his beginning.The thing that is good about this\nmovie is that batman is shown according to his getup i mean what do you\nexpect from batman he is the most serious super hero in town boys which\nwere not able to see in the other batman flicks.<br><br>I am waiting for the sequel of batman \"THE DARK KNIGHT\" and i know i\nwont be disappointed.\n"},
{"review": "\nThe Dark Knight is coming out soon so I thought as a tribute I should\nreview the previous outing. I have been a fan of the Batman movies ever\nsince the first Batman(1989)came out when I was four. Viewing it now I\ncould not believe that I actually loved it once, it is an overrated\npiece of tripe. Oh well enough about the first one Batman Begins is\nwonderful,I would call it better than the original. I only viewed it\nfor the first time after I purchased the DVD and from the first few\nreels I was hooked. Batman is a welcome return for one of my favourite\nsuperheroes after some pretty awful outings. Batman Forever was OK but\nBatman and Robin was shameful and an embarrassment to fans of Batman.\nChristopher Nolan is rather good,Micheal Caine is good as Alfred,Gary\nOldman was good but Katie Holmes disappointed. BB tells the story of\nBruce Wanye before he became Batman, which I found fascinating to find\nout. At the end there is a reference to Joker,Jack Nicolson played him\nin the first Batman and Heath Ledger(may he rest in peace)will be\nplaying him in The Dark Knight. Batman Begins has put the franchise\nback on track after it derailed.\n"},
{"review": "\nBatman is back and he means business. That's a very cheesy way to start\nthis review, but it's a fitting one. I loved the Burton Batmans mostly\nbecause I'm a big Burton fan and a was a moderate Batman fan. AFter\nseeing all the junk that Schumacher had made and basically ruined this\nfranchise, people were waiting for the best comic book here to make a\nreturn. The Bat nipples, poor choices for Batman and overdone villains\nruined every Batman movie up until Begins. Bale is hands down the best\nBatman as he has the style and posture of the Bat. Please, do yourself\na favor and watch this movie. I only felt like I had to write this\nreview in order to get people pumped for The Dark Knight.\n"},
{"review": "\nI was first introduced to \"Batman\" when I saw the Tim Burton film in\n1997. I immediately loved the hero; he became my favorite because\nBatman, like Indiana Jones, represents the real heroes of today, the\nones without superpowers who are just as human as you and I.<br><br>I then saw \"Batman Returns,\" which was alright. It didn't serve my\nexpectations like the first one did, but it was alright.<br><br>Then I saw \"Batman Forever,\" and the franchise started getting campy,\nand the writing started to suck, and the actor for Batman just got\nworse. But that didn't stop! Then came \"Batman and Robin,\" which was\none of the worst movies I've ever seen in my entire life. George\nClooney, as good as he is, is no Batman. It all seemed to go downhill\nfrom here until...Christopher Nolan! Christopher Nolan resurrects the\nfranchise with this fantastic reboot! He even chooses a perfect Batman\nwith Christian Bale. One other thing that I liked about it was how it\nfocused entirely on Batman and not on the bad guys like the first four\ndid. Liam Neeson was also very good in it as Henri Ducard aka Ra's Al\nGhul. Christopher Nolan also reminds us why we like Batman: because of\nhis humanity and because of the fact that he's just so damn cool! I\nwelcome \"The Dark Knight\" with open arms entirely. Kudos to Christopher\nNolan!\n"},
{"review": "\nBatman Begins blows Tim Burton/Shumacher movies COMPLETELY out of the\nwater and hands down the best superhero movie I've ever seen...period.\nIt's got it all; action, comedy, drama, suspense and fantasy brought\ntogether so eloquently by Christopher Nolan (Memento, The Prestige)\nalong with tight direction, cinematography, and astounding special\neffects with a sense of verisimilitude so strong and effective\nthroughout it comes together in a stellar package. And Christian Bale\nis simply superb in the role; making Batman dark and brooding, the way\nhe should be. Many have criticized Katie Holmes, but I liked her in\nthis film (especially in Pieces of April, Abandon, The Gift). The\nvillains also get top billing and are far more menacing and three\ndimensional than before. The original movies were good in their day but\nthey pale in comparison to what Nolan and co brought to the big screen\nbecause staying true to the source material pays off and is more\nengrossing in the end. Some superhero movies have tried to go the other\nway around resulting in failure but this film nailed it spot on. My\nmain complaint is the fight scenes were too heavily edited. Hopefully\nthey will be fleshed out in the next film. I enjoyed Spider-Man and\nX-Men and their sequels (except the third installments) and Iron Man\nrespectively but Batman will always be my favorite superhero and with\nthe sequel approaching this summer, it's gonna be one hell of a treat.\n"},
{"review": "\nBatman Begins is one of the best films of 2005, if not the best. I had\nmy doubts before seeing this. Shumacher was basically a flop, but after\na couple minutes viewing this film, my thoughts instantly changed. The\nmovie starts when Bruce Wayne was a little child, and leads to when he\nmastered his fears and became Batman. Christopher Nolan did a very good\njob directing this film. He had a Burton-like sense of how things\nshould make you feel. This film was dreary-feeling, but in a good way.\nThe acting was outstanding. Christian Bale was a good fit for Batman.\nThe rest of the cast includes greats like Morgan Freeman, Michael\nCaine, Katie Holmes, and Liam Neeson. The score was memorable. The\nscript could've been no better. Also, the visual effects was\noutstanding. It seems like that these things were real. I definitely\nrecommend this movie. I give this film a 10/10.\n"},
{"review": "\nThis another awesome batman movie and for all the same reasons it has\nlots of action in it has a good screen play to it the acting in it is\ngood and the actors in it are good in it Christian bale does a great\nbatman and also this is his first time playing batman and he does it\ngreat. The villains in it are good i think cillian Murphy does a great\nscarecrow and same with Liam neison. So i'm sure you will not be\ndisappointed with batman begins and you will have a good time watching\nit and you will watch it over and over again. So make sure you rent or\nbuy batman begins because it is a great batman movie. Great adaption to\nthe batman comic books.<br><br>Overall score ********** out of ********** <br><br>***** out of ***** <br><br>Also i can't wait to see Christian bale in his next batman movie called\nthe dark knight with heat ledger as the joker the dark knight sounds\nawesome.\n"},
{"review": "\nI saw this In Imax 2 years ago, and went in not expecting anything but\na fun little superhero movie, holy crap, what i got, was my favorite\nmovie of all time.<br><br>Acting- the best acting i've seen in a film, Christian Bale was\nIncredible, he was so into his character and pulled of playing Bruce\nWayne and Batman very well. Most of the actors in the last saga were\neither a good Bruce Wayne, or a good Batman, and Christian Bale pulled\nboth off. Other than him, the rest of the cast was amazing, every\nsingle person, i cannot pick someone in the film who wasn't\noutstanding.<br><br>Story- What made this Films story different from almost all superhero\nmovies, is that it wasn't just that a Bad guy is causing trouble and\nthe superhero has to save the day, Batman Begins showed his journey to\nbecoming the hero, and in a very detailed manor. The Villain wasn't an\naverage bad guy either, and i won't tell you who he was because i don't\nwant to spoil it for anyone who hasn't seen it.<br><br>All I can really say is that if you have not seen this film, than you\ntruly are missing out. I have seen it at least 20-30 times, no joke,\nand every time it amazes me even more.<br><br>10 out of 10\n"},
{"review": "\nChristopher Nolan is already proving to be one of the very best\ndirectors, with films such as The Prestige and of course, Memento. Then\nthere's this, Batman Begins. There are many things that make this one\nof the best ever comic book adaptations. The dark musical score, along\nwith snapshots of Bruce Wayne's childhood are great accompaniments,\nshowing Bruce Wayne's dark nature of anger and guilt, where most\nsuperheros are just being shown to show how good will always triumph\nover evil. Here Bruce Wayne is shown as a normal man (apart from being\namazingly rich!) with huge personal problems, and the film shows how he\ntriumphs over his own insecurities.<br><br>The best thing about Batman Begins though, is that Batman is not\nactually shown as a superhero, as he doesn't actually have any\nsuperhuman powers (such as flying etc.), he is shown as a man with a\npoint to prove to himself, and he believes that only by \"turning fear\nagainst those who prey on the fearful\", he can prove himself. The high\ntech gadgetry and Bruce's ninja training are fantastically done to show\nwhere Bruce got his inspiration to become Batman, and learnt his\nskills. Nolan has used the fact that Bruce is a billionaire where no\none has before, showing how he uses his money to create his fearsome\nalter ego - buying wires to suspend himself from, weapons, his cave and\na new-look batmobile.<br><br>The fight scenes are really good, Batman flying from all angles - its\nreally cool! Christopher Nolan really is a genius director, here he has\nmade a film which for the first time has shown that a hero such as\nBatman could exist in real life. 10/10\n"},
{"review": "\nI've seen all of Batman movies and they were OK at best and sometimes\nawful .. I nearly lost hope of this series but when I heard that Nolan\nis directing the next Batman .. I braced myself to a very good movie at\nleast and Nolan hasn't let me down .. it is the only Batman movie that\nyou could call a masterpiece even people who liked it less consider it\na very good movie and the best batman (so far). This movie is loaded\nwith class A starts (like other batman movies) but they are the best of\nthe best .. Liam Neeson &amp; Michael Caine were very good .. Morgan\nFreeman wasn't at his best but he was OK at least .. Christian Bale is\na unique actor and I think he will show us great performance in other\nmovies to come in the future .. he is the type of actor he will try\neverything and anything that makes his performance good .. keep in mind\nhis awesome performance in \"The Machinist\" .. he has a great facial\nexpresses that he uses very good .. Gary Oldman wasn't very good but\nwasn't bad either .. Cillian Murphy also was very good .. even Katie\nHolmes was good. The visual effects were convening and were so\nrealistic that sometimes I feel that they didn't use much of computer\neffects. What can I say about this masterpiece !! in short, Christopher\nNolan worked hardly on this movie and he surely has lifted it up to the\nmasterpiece level .. everything sounds prefect in this movie. Do not\nmiss it .. <br><br>it is one of the best in 2005 and absolutely the best batman movie (so\nfar) .. I hope Nolan is directing the next batman so I enjoy it as much\nas I enjoyed Batman Begins.\n"}
]