[
{"review": "\nPerhaps the biggest dilemma you will have before going into this, is\nwhether or not it will live up to the legend of Harry Potter. As\nsomeone who loved the series and was skeptical about Yates undertaking\nthis endeavor, I am pleased to say that I'm relieved, As Yates delivers\na refreshing and whimsical film. Sure, it doesn't have the characters\nwe've come to love, but with the creatures you encounter and with the\nadded humor of J.K Rowling, you will come to grip with the fact that\nthis movie will leave an impression.<br><br>Newt is a scientist who has an uncanny resemblance to Doctor Who, as\nhis strange and cunning outlook bares the trademarks of the epic\ncharacter. Newt is searching for unorthodox creatures. As he stuffs\nthem into his suitcase which is an accident waiting to happen. The\nsuitcase seems to be unhinged and dire need of a proper lock. As he\narrives in New York he mixes his bag with Jacob Kowalski, who lets\nloose beasts that start to run rampant in the streets. J.K. Rowling's\nfirst outing as a screenwriter is a wild success, with her keen eye for\ndetail and whimsical taste. \"Fantastic Beasts and Where to Find Them\"\nbecomes a fine addition to her epic saga. I'm glad that there are four\nmore awaiting us because if Rowling proved anything, it's that she has\na lot more to offer.\n"},
{"review": "\nAmazing movie, they've done it again! The cast was amazing (though\nJohnny Depp as Grindewald takes time to get used to),visual effects\nstunning and the movie is everything you can except it to be. The movie\nhas so many great moments, it's happy and funny yet serious enough and\nhas AMAZING humour, I laughed a lot while watching it and so did\neveryone else :) LOVE, LOVE, LOVE THIS MOVIE and can't wait to see\nmore!!! I also love the fact that they didn't try to continue the\nPotter series but instead made a ''stand alone'' movie franchise which\nhas so many connections to the Harry Potter books/movies, it really\nmade me feel like they're not trying to ''milk us'' but just want to\nprovide us more amazing movies from the world we all love so much :)\n"},
{"review": "\nThe magical community in Britain has been fleshed out rather well\nthrough the seven Harry Potter books and the eight films that followed,\nbut America's magic users have been pretty much overlooked.<br><br>Until now.<br><br>The year is 1926. In the midst of the dark wizard Grindelwald wreaking\nhavoc in Europe, an unassuming man travels to New York City with a case\nfull of, well, fantastic beasts ( a case which goes full TARDIS, as\nwell). <br><br>There's also an unknown magical threat tearing up streets and striking\nfear in the hearts of the nomaj (non-magical, US term for muggle)\ncommunity. The Magical Congress of the United States is searching for\nthe culprit, and who do they blame? The unassuming man, Newt Scamander,\na role that Eddie Redmayne fits into perfectly.<br><br>With the help of Tina Goldstein, a disgraced Auror, and Jacob Kowalski,\na nomaj who gets caught up in Scamander's creature exploits, they must\nclear Scamander's name and find out who is behind the attacks in New\nYork and stop them.<br><br>This film has a lot going for it, but it really holds up as an\ninstallment of the Harry Potter franchise in the way that it showcases\nthe allure of the universe without the old story of The Boy Who Lived.\nIt is also buoyed by great visual effects and witty banter throughout.<br><br>This will prove to be just the first of possibly many films in the\nHarry Potter universe (and yes, Johnny Depp does show up as\nGrindelwald), and if this film is any indicator of the wonder this\nuniverse instills, I can't wait for more.\n"},
{"review": "\nIt's a letdown. The fun and charming bits of Harry Potter were left out\nof this film. I like J.K. Rowling's work immensely, so that's hard to\nsay.<br><br>Plot-wise, things are a mess. Newt and his luggage full of magical\ncreatures are a side plot to the important things going on. The real\nstory is that an auror in New York is searching for a powerful and\ndangerous magical force that manifests within a teenager. His plan:\nturn the destructive energy the teenager carries into a weapon, I\nassume. Enter Newt Scamander, who is trying to transport a\nthunderbird(?) to Arizona for release back into the wild. Some of\nNewt's other creatures escape in New York, and he has to round them up,\nall while becoming entangled with the auror and his teenage target.<br><br>The plot sounds sort of okay, but it's not well integrated. The\ncharacters don't add up to much of anything, either. The sidekick baker\nis fairly likable, though, along with his brewing romance with Queenie.\nNewt's a bit thin as a character. Eddie Redmayne's dialog also tended\nto come out mumbled, which made him hard to understand at times. Throw\nin a few acronyms and oddball words like MACUSA, and that makes for\nmore confusion.<br><br>Altogether, the film needed more work to tighten the story lines and\nmake Fantastic Beasts a story focused on Newt and his menagerie,\ninstead of what we ended up with.\n"},
{"review": "\nFantastic Beasts and Where to Find Them is a spin-off of the highly\nsuccessful Harry Potter-franchise. Naturally, there were great\nexpectations for this first part of a whole new franchise in the J.K.\nRowling's wizarding world and I can honestly say that it delivers\neverything you would dreamed of.<br><br>From minute one the movie gets you on a journey with great visuals,\nvery recognizable music and great performances from Eddie Redmayne and\nDan Fogler. From now and then you get the, sometimes funny, sometimes\nsmart references to Harry Potter, but nevertheless is this a movie that\ncan totally stand on it's own.<br><br>There are some nitpicks, such as the very long introduction before we\nstart to see what the story is all about and the fact that there were a\nlot of lines referring to events that were setting up the second or the\nthird movie, but for a film that had to set up the rest of an upcoming\nfranchise it was totally acceptable and not a slight bit tedious.<br><br>Fantastic Beasts and Where to Find Them stands perfect on its own and\ndoesn't need Harry Potter or any of the planned movies to get you\ninvested in its story and yet it is an obligation for every J.K.\nRowling wizarding world-fan to go see this movie. The director David\nYates found this perfect balance and ended up with a result that has to\nbe seen in theaters by everyone.\n"},
{"review": "\nFilming is beautifully done, acting superb, humor everywhere. Fantastic\nimagination and script by JK Rowling.<br><br>Of course, we would have loved to see our old group back on the screen,\nbut alas, that wasn't possible. At least we can emerge our self again\ninto the magic world, and get to meet Newt Scamander, a very\ninteresting character. The best role is, though, the NO-MAJ. We fall in\nlove with him the second he appears on our screen. But most of all, we\nwant that fantastic beast who loves those shiny things.<br><br>Very well done, gets a smile on our face again. We are impatient for\nthe next 4 parts.\n"},
{"review": "\nJK Rowling will forever be known as one of the most genius humans to\never live. The fact that she can pen such a detailed and perfect\nmagical world without Harry Potter and the beloved characters we have\ngrown to love, it makes you feel like this world is actually real! This\nmovie is very entertaining and and heartwarming. It's no longer a dark\nsaga of an evil dark wizard trying to kill a young boy, it is an\ninsight into a magical world that is so grand and amazing! <br><br>Despite taking place way before our known HP time, there are enough\nquick and witty references to our known HP world throughout the movie\nto make Potterheads smile. I went in with less than no expectations,\nand I was pleasantly surprised. And LOVED IT. And the best part of it\nall- I've always somewhat disliked the HP movies, because I'm a\ndie-hard fan of the books. The movies never lived up to the books. For\nFantastic Beasts, there are no books to compare it to, so there's no\nroom to dislike! Can't wait for the next movies!\n"},
{"review": "\nI admit, I am not one of those folks who call themselves Harry Potter\nFans. However thought I would give this one a try. thought it would be\na perfect way for me and my family to spend a cold afternoon...<br><br>I felt this was was 2 hours of waiting for something to happen. I get\nthere are usually slow starts with most trilogies as the characters and\nstory line are provided to the audience. However for me felt the movie\nwas extremely slow and sorry, seeing new magical beasts is not very\nexciting. They did that with avatar a decade ago. My boys ages 8 and 10\nhad trouble as well engaging in the movie. Both gave it a thumbs down\nwhen we were leaving.\n"},
{"review": "\nI say really, whether or not you have been into Harry Potter, this is a\nlovely film, full of different emotions, and I am so thankful for J.K.\nRowling coming back and creating more of her world for us to see. I\nthank the whole team for the efforts put into the film, from the\nacting, to the scenery, it was wonderfully done. I am to afraid of\nspoiling, but it will keep you on the edge of the seats, though for my\nheadache tonight, very loud at some points, be ready, it is a turn of\nevents, that will shock you, but do not be surprised, if you have an HP\nfanatic sitting next to you bouncing in their seat in excitement over\nsomething they might have noticed, I apologize to my husband and\nbrother in law for being so excited. To the non-HP people, go watch it,\nit is worth it as a movie by itself. To the HP-People, remember there\nis difference in the Wizarding World, and you will enjoy it as a\nnewcomer :)\n"},
{"review": "\nI love Harry Potter and I enjoyed to watch every movie about this\nbeautiful universe. But after watching this film, I felt violated. The\nonly connection with the original HP was the opening title with the\nfamous HP melody. The rest of the movie was a complete incomprehensible\nmess. Not only the plot was bad, but the whole acting of this amazing\ncast looked fake and unprofessional. I couldn't stand seeing frozen\nface of Eddie Redmayne for two hours, who never looked in the eyes of\nhis companions during the talk and was always smiling. His crash,\nKatherine Waterston was a gray mice, can't remember much of her. Her\nsister (Alison Sudol) was beyond fake. Thanks god there was a funny\nmuggle Dan Fogler who saved me from falling asleep. The appearance of\nJonny Depp was quite ridiculous. Dude, go retire, please.<br><br>This movie contains too much of special effects, that was absolutely\nunnecessary and it didn't help at all. I can not understand why it has\nsuch a high rating and why there are so many people who loved it. Then\nagain, Brexit and Donald Trump, what do you want from the mass...<br><br>I do not recommend it even for a home screening. Peace and love.\n"},
{"review": "\none of the worst movies I have seen - wasn't really a fan of the potter\nseries but at least I could sit through them - this movie had me\ncontemplating walking out but because I was with others I suffered\nthrough - not really any cogent story line, wooden performances, nil\ncharacter development and some hooky cooky scenes that can be seen in\nany old casper cartoon - absolute waste of time and another movie that\nis just big on tricks but short on story and completely unmemorable - I\nfeel ashamed I went to see this movie because I am now part of the\nproblem - if we keep going to the cinemas to see rubbish like this they\nwill keep making it - don't be weak like me - just don't go to see this\ncrap\n"},
{"review": "\nThis is a straight-up trap and waste of special effects.<br><br>JK Rowing must be too lazy to think up a new good story so she just\nslapped the Harry Potter theme in a Harry Potter universe and filled it\nwith special effects and no real story. <br><br>I'm serious a 10 year old could have written this story.<br><br>The only thing that sells the movie is JK Rowing and a huge special\neffects budget.<br><br>You will be disappointing if your movie maturity is older than 15 years\nold or you have a working thinking brain.<br><br>I'm a die hard fan of Harry Potter but this was just boring and crap.\n"},
{"review": "\nIt is difficult to include spoilers, which presume a plot. There is no\nproper plot, just a series of loosely connected episodes. There are far\ntoo many noisy special effects at contrast with the quiet subtlety of\nsuch items in Potter as 'Fluffy' or Quiddiitch. What was even worse was\nthe acting. There wasn't any except for Johnny Depp''s small moment at\nthe end and Eddie Redmayne's ever pleasant charm. But it is Eddie who\nis charming us, not some unconvincing character called Newt Scamander.\nIf there is to be a series of Newt Scamander films, PLEASE spend the\nmoney on the cast and not the effects and PLEASE return to the humanity\nwhich were hallmark of the Harry Potter books and also a fundamental\nreason for their greatly deserved success.\n"},
{"review": "\nThis is my first review on IMDb. I felt compelled to do so after\nreading Empire's underwhelming 3 Star review (does their opinion count\nfor anything any more?), then going on to watch the movie myself last\nnight.<br><br>It was excellent. Heart-warming and charming with extremely likable\nlead characters. The story wasn't too heavy - enough to keep things\nticking along - though there were plenty of \"Easter Eggs\" and\nsatisfying references to other known HP people &amp; places (Grindelwald,\nLe Strange, Hogwarts, Dumbledore etc)<br><br>The Special FX were pretty amazing - most of the Magical Creatures were\nwell realized and convincing. There was plenty of humour throughout,\nwhile the music....I am not sure if other have mentioned it....but the\nmovie's soundtrack is just as fantastic as those wonderful beasts!<br><br>Highly recommended.\n"},
{"review": "\nI had high hopes for this movie. I was excited to go! However, the plot\nwas painfully boring. The CGI looked incredibly fake. And the whole\nsubplot was just plain creepy. I was so disappointed. It was\nimmediately obvious who was the bad guy and there were definitely some\nbizarre interactions between characters. Honestly, you don't really\nlove or hate any character in the movie, even though, from the first\nminute, you really, REALLY want to like one of them. There was nothing\nthat felt really magical about this. It was just bland and boring. If\nyou are seeking another magical movie from the Harry Potter franchise,\nthis is not that. You might love it, but if you are truly honest with\nyourself, I'd doubt it.\n"},
{"review": "\nAlthough I don't like David Yates' directing, I think he did his best\nwith this movie. The cinematography isn't perfect, but the colour\ncontrasts are really beautiful to watch. The movie is highly\nentertaining and I recommend it to everyone (especially to\nfamilies/adolescents).<br><br>PROS: -Eddie Redmayne's acting! He is a real cutie in this film. His\ninteraction with his \"fantastic beasts\" are adorable! -Eddie's\nchemistry with Dan Fogler and Fogler's believable chemistry with Alison\nSudol. -Alison Sudol is gorgeous, sweet and pulls off her role without\na doubt. -Colin Farrell's scenes. He has the most interesting ones.\n-The Beasts in general. All scenes, especially the ending are\nbeautifully scripted and filmed. -The score is beautiful and fitting.\nPacing and editing are fine. (why did Warner Bros and David Yates screw\nit in The Legend of Tarzan then???) -Great CGI. Worth to watch in\nIMAX3D.<br><br>CONS: -Katherine Waterston's acting... she gives a very disappointing\nperformance in this movie. I know her previous work and her acting\nisn't that dull actually. Apart from that, she looks extremely plain\nand black hair makes her look hideous. -Unfortunately less Colin\nFarrell. - Johnny Depp as Grindelwald. Seriously? How bad was that?!\n-Very few magic spells are recited. That was very disappointing, as\nwe're watching the world of the wizards, aren't we? -There are many\nmovies which take place in the US, therefore, I think the Harry Potter\nuniverse should have stayed in England. I hope the sequels will be\nfilmed in Hogwarts and we will get to see more wizards, teachers and\nso. <br><br>Overall the movie is really refreshing, as it has an original\nscreenplay that isn't based on a novel, comic book, etc. The movie also\ngives a profound message about the desire to be accepted into society,\nespecially when one is different than the majority.\n"},
{"review": "\nthe movie is very slow. No story. Only some comedic situations. that\nalso you can find in other movies. if harry porter movies were given 10\nmarks i would give this movie 1 mark. I am still wondering why people\nare saying this movie is good. is it trump effect? The story is very\npoor. t here is no villain... they defeat the villain with emotion.. no\nmagic. only bullshit.. I don't know what has happened to people. people\nare giving high ratings to absolutely crap movies and good movies they\nare giving bad rating even without seeing them... Dr strange and This\ncrap having high ratings then a gem movie like Train to Bussan really\nannoys me... Have people lost their mind\n"},
{"review": "\nI must admit at the very beginning, I'm one of those adults who bought\nthe small booklet, and even enjoyed it. I always appreciate when an\nauthor creates an entire world in which his/her story takes place, very\nfew compare with the totality of the world created by JK Rowling. So no\nwonder that the full story of Newt Scamander has already existed in her\nmind, when she wrote his textbook for the Hogwarts' students and all\nthe rest of us. But this was written from the very start as a movie,\nand in my mind is the fruit of the creative partnership she had formed\nwith David Yates, who directed the final three installments (4\nactually) of the Harry Potter saga.<br><br>The result is both a visual marvel, a heartwarming story, and a tale of\nfantasy, action and suspense. Another part of Rowling's magic is the\namazing characters she creates. She created here four wonderful leads,\nthat gave room to some wonderful acting performances: Eddie Redmayne,\nKatherine Waterston, Alison Sudol, and the most surprising of all Dan\nFogler, with whom I was already familiar as a voice actor (Mars Needs\nMoms) and he proves, that a good voice actor, is a good actor. One more\nspecial mention must go for Ezra Miller, who's so superb as Credence,\nthat he almost spoils the surprise at the end of the film. <br><br>Bottom line, not really a prequel, but a wonderful independent story\nthat happens to fit into the same universe where Harry Potter exists.\nDon't worry, there's room there for much more.\n"},
{"review": "\nI practically grew up reading the novels and I distinctly remember how\nmy friends and I would have 'duels' after class. Then came the movies,\nwhich more or less brought the magic to the big screen (apart from the\nGoblet of Fire, which I thought deviated too much on trivial stuff).<br><br>After the 8th movie had come and gone, we were all a bit disheartened,\nand would anxiously wait for Pottermore for our entertainment. Then\nJ.K. Rowling (takes a bow!) launched the spin-off books and things\nstarted looking up again.<br><br>To be honest, I've been having a rough week, and movies are the only\nthings that are keeping me sane right now. Marvel is always a bright\nspot, with its recent success with Doctor Strange. However, I had no\nidea how this movie would turn out to be when I went for it, knowing\nvery well that all characters are new, and knowing very little about\nthe Fantastic Beasts in the first place.<br><br>I don't think I moved even an inch during the entire 2 hours and 13\nminutes. J.K. Rowling has come up with a highly imaginative narration,\nthis time based in the US instead of the UK, and every character, scene\nand set has been brought alive marvelously by director David Yates. The\nmovie has everything - comedy, suspense, plot twists, scare moments and\nof course, brilliant visuals. <br><br>I'll be waiting for the next 4 sequels with the exact same anxiousness\nas I did with the original series. Thank you J.K. Rowling!\n"},
{"review": "\nbad casting bad movie plot this is just a bad idea ....normally i would\nlike this kind of movie but when they only focus on cgi it gets boring\nreally quick ,but I'm sure if you are a kid you would like this ....but\nfor us not kids i would rather poke out my eye than watch this again\n....and the worst part of this is that they are going to make more\nmovies ...come on seriously four more movies that will be about nothing\n...the world needs magic but not this kind of cheap movie if this is\nwhat creative minds can make we a fu. ............\n............................. ....... ................ ....... ....\n............ ............ ............ ........................\n............... ............... ................ ........\n................. ........... ...................\n"},
{"review": "\nThis movie was horrible. This was the worst movie I've seen in a long\ntime; J.K. Rowling lost my confidence allowing this to be produced and\ndelivered with her name on it. I'll never see another movie based on\nsomething she has written; although I will read Harry Potter over and\nover again.<br><br>I wouldn't ever recommend this movie to any one; it had no plot, no\nclear motivations for the characters, Eddie R. should not have been\ncast in this role and he shouldn't have brought his Stephen Hawking\nstichk to this film. It made no sense. I haven't been disappointed in a\nmovie in a long time; this was just amazingly disappointing.\n"},
{"review": "\nOkay... Why lie? I absolutely loved it! But what I loved above\neverything else was Credence and his story. Dear God, did I love the\nroll he played. Not to mention Ezra Miller's acting (Sweet baby Jesus\nhe took my breath away!) I loved what J.K. Rowling so boldly offered\nfor us to witness and especially how the story of Credence played out.\nIt was in now way cliché and honestly had you holding your breath and\nalways second guessing yourself. I can't praise that part of the movie\nenough. Or the animation! Jesus, the animation was breath taking!<br><br>But there was only one thing that put a sour taste in my mouth... And\nthat was definitely the development of romantic relationships. I mean I\nlike romance just as much as the next girl, but I didn't think it fit\nthe heavy atmosphere of the movie. I thought it was totally\nunnecessary. I didn't like it and I thought it made the plot of the\nmovie deteriorate from its original magnificence. There was too much\nnew information to take on, too much plot to catch up to, and too\nlittle character development for me to really appreciate it.\nUltimately, I felt that by also including a romantic relationship or\nthe implication of one the director was trying to push too much into a\ntwo hour and twelve minute long movie.<br><br>If that part of the movie, and only that could be extracted, Fantastic\nBeasts and Where to Find Them would have been the movie to end all\nfantasy movies.\n"},
{"review": "\nI've never read any of the books (Potter or this one), so I go into all\nof these movies completely blind. This was done very well. Families,\nsingles, adults, and kids... all will be highly entertained. This is\ndifferent than the Potter movies because these aren't folks who are\ntrying to learn their craft, they know it so they aren't limited using\ntheir magic and the things that they don't know. One of the best\nperformances, if not the best one is that of the lone muggle. We seem\nto get to experience everything through his eyes (to a certain extent).\nHis wonderment is our wonderment. And I really enjoy the actor Eddie\nRedmayne, for the life of me, I can't remember his character name, but\nthere were opportunities for him to be over the top and he never was. I\nsat next to someone in her 20s (I am in my 50s) and she was just\nover-the-moon watching the movie. I enjoyed it immensely as well. Just\nfantastic special effects, great storyline.. and all actors perform\nsplendidly. This is a multiple view movie that your kids will never get\ntired of. It is a nice little addition to the Potter franchise. (The\nstory takes place before Potter). I say this is a must see on the big\nscreen.\n"},
{"review": "\nI will keep this brief....<br><br>No significant story to speak of...the film just drones on and on with\nthe \"gotta catch the creatures that escaped from the suitcase\" crap.\nThat is basically it.<br><br>Poor/inadequate character development. There are just \"characters\" in\nthe movie....we know little to nothing about them or their\nmotivations....and care little to nothing about what happens to any of\nthem.<br><br>The essence of the film is \"look at the weird and charming CGI\ncreatures we created\". I cannot believe that after all the years of\nCGI...the producers of this movie still believed that effects alone can\nmake a movie....but apparently they do. The CGI is not new or\nrefreshing in any way that I could see...just CGI.<br><br>I am sure this movie will get some audience in the first few days, just\nby tapping into the \"Harry Potter\" world. But it won't last. Word will\nget out, and the (currently ridiculously inflated) IMDb ratings will\ndrop like a stone.<br><br>Take my word on this. This is a boring and bland failure of a movie. I\nslept through about a third of it, and those moments of unconsciousness\nwere the best part.\n"},
{"review": "\nFellow movie goers and harry potter fans. Don't waste your time and\nmoney to see this terrible, repeat - terrible - film. I didn't read the\nbook, but have seen all of Harry Potter's films and love the world. But\nthis just feels like their are ripping you off so you can return to\nthis world, but it's like a film made for TV...instead of a 180 million\ndollar movie with big stars. It's simply uncomfortable....there is no\ncharacter introduction, no charisma on lead actors, Eddie just makes\nthe same cute boy face during all the movie, the girl is a B version\nBrie Larsson and they carry this muggle around for no reason. Just\nridiculous. And they finish off with drunk and bloated Johnnie Depp,\nwho should now file for retirement from being...Johnny Depp. Just\nexchanging one bad villain for the other. You don't care for\nanyone....too much special effects make it unbelievable...and the\ncreatures are just there and looking also not real. Bad acting, bad\nscripting and bad sense of judgment to launch this awful god movie.\nWould have left the movie theater if I hadn't paid to see it.\n"},
{"review": "\n21 November 2016 Film of Choice at The Plaza Dorchester Tonight -\nFantastic Beasts and Where to Find Them. For those of you who are\nmissing the adventures of Harry Potter and his wizarding world,\nFantastic Beasts plugs that gap with alacrity. With a cast headed by\nthe supremely talented Eddie Redmayne, as Newt Scamander, this film\nimmerses us once more into a place where the world of wizard and No-Maj\n(American for Muggle) collide. We are again treated to an insight of\nthe machinations of J K Rowling's brain, and I for one am always happy\nthat she shares it with our world. You absolutely do not have to watch\nany of the Harry Potter films to understand any of the references to\nMuggles, Hogwarts and the like, this film is story on its own and we\nare introduced to a whole new collection of characters.......and\nmagical beasts, some of which are cute and some downright weird.\nExcellent visual effects, and a screenplay which includes more than a\nfew lighthearted moments. Another smash from the wizarding world and I\neagerly await the next instalment.\n"},
{"review": "\nWhen I was rating this movie I wondered if it wouldn't be too easy to\ngive it 10 stars. Giving it lesser stars would be a downright lie, so I\ngave it a go.<br><br>When I watched the trailers for this movie I was hyped and my\nexpectations were very high, I'm a real Potterfan FYI.So when I went to\nsee this movie during a pre-screening I had butterflies in my stomach\nand I was nervous as hell. My best friend, who went with me, had the\nsame feeling. The moment the WB logo came on, the audience erupted in\ncheers and applause. A marvellous feeling came over me.<br><br>Without going into details, I thought the movie has a very good plot,\nwith a big twist... the actors were also very very good, I enjoyed Newt\nand Queenie the most, stellar performances, especially Eddie Redmane.\nThe music that supports this movie is moving and it supports the\n'coming home' feeling. There is definitely magic in this movie and not\njust because of the CGI, which makes everything look very good, but\nalso because of all the reasons I spoke of woven into one big, new,\nfantastic (see what I did there) world.<br><br>I can't wait to see the other parts.\n"},
{"review": "\nI think it was the main character who made it the best. I really liked\nthe girl with the blonde, curly hair. I haven't seen many people look\nas good as her. They both weren't afraid to be a stimulating. The\nbeasts were so cute. I really liked the little green plant-looking\nthing that picks locks. It was so cute when it cried when taken away.\nI'm glad the main character was able to get him back in the end. I\nactually bought something from a movie with a little creature that\nwhined when being held, too. The beasts weren't a big part, but I was\nable to not think about that while I watched the rest of the movie. It\nreally captured my attention most of the time. I liked seeing the\ndifferent characters and what they represented and finding ways to\nappreciate them.\n"},
{"review": "\n,,Fantastic Beasts And Where To Find Them\" immediately reminds us how\njoyful the world of Harry Potter is. Rowling and Yates have given us a\nterrifically good-natured, filled with magic and humor film. When you\nthink of this wizarding world, you are reminded of the endless novels,\nHogwarts school of witchcraft and wizardry, and the beloved characters\nthat people of all ages have come to admire. Years after the Harry\nPotter franchise concluded, the novel ,,Fantastic Beasts And Where To\nFind Them\" was published. Without question, of course Warner Bros. were\neventually going to want to adapt that story for the big screen.\nRedmayne's lovely performance sets up the emotional core of the\nfranchise. Big,bold and teeming with imagination, the wizarding world\ngives us hope for an even more magical adventure next time.\n"},
{"review": "\nJust got home from seeing \"Magical Beasts and where to find them\".\nAfter a rough start ( the projector windows platform crashed and they\nRestarted from beginning). My Sister and I found it well worth the\neffort for us to see it. Plots in side plots , No-Majs (muggles).\nBeautiful creatures, And one I could not name until the end. I will\ndefinitely buy this one when it comes out on DVDS or Blu ray. Thumbs up\nfor a unique view on American views of magic. I would like to see more\nof this type of entertainment. It is worth the cost to see this.. This\nis one parents can take their kids to see. It is definitely a magical\nexperience for all.\n"},
{"review": "\nTake a younger Matt Smith from Dr. Who, the British sci fi television\nseries, place him in early 20th Century New York along with an\nInception-like (2010) special effects and new visual fantasy world like\nAvatar (2009) along with a strong ecological theme and you get\nsomething like Fantastic Beasts. Fantastic Beasts continues the darker\nevolution of the Harry Potter world while inserting a comedic older\nmuggle male character to help balance the tone of the movie. Whether or\nnot the expanding beauty of this visual universe will retain its magic\nor not remains to be scene as Avatar set a new standard of imagination.\nAnd whether or not due to budget or technological limitations, the\neffects were not quite as great as to be expected with all the new\nvisuals that Fantastic Beasts brought to the screen.<br><br>The target audience of the movie script might be aptly described as the\ncontinuing audience who grew up from the original Harry Potter movies\nwho were in elementary school and grew up through junior, middle school\nand high school. Fantastic Beasts includes the familiar ominous\ndarkness and stark loss, evil abuse, as well as happiness, joy, and a\npitch of accidental stupidity found in most of us.<br><br>Overall, Fantastic Beasts is fresh, new, dark, and enjoyable with some\nmeaningful messages endangered species, about child abuse, pain, and\ncompassion and tolerance, something that America needs more than ever\nnow.\n"},
{"review": "\nAs a die-hard fan of Harry Potter, I can't tell you how exited I was\nfor this movie to come out. For over a year I had a countdown app to\nkeep of how many days were left until the 18th. But, after having read\ncursed child and being disappointed with how she continued the series,\nI was cautious about how she would illustrate the past. But Fantastic\nBeasts did the very opposite of disappoint. It was better than I could\nhave ever dreamed and it's a shame that we now have to wait two years\nfor the next one. Even if I wasn't a fan of Harry Potter I would still\nlove it (though a lot of it would go over my head) Every fan NEEDS to\nsee this movie asap.\n"},
{"review": "\nJust absolutely brilliant!! This new story first of all is funny. There\nis so much humour in this movie, a thing the potter movies always\nfailed to have, despite the books have lot of it. So in Fantastic\nBeasts you can really feel J.K.Rowlings style. And despite it being a\nprequel, it is incredibly creative, with so much imagination and good\nideas. The characters are just so funny and well thought through.It is\nin many ways a return to old times. To cast a spell you have to say it\nagain and the music is just a wonderful fantasy-soundtrack. Still in\nthe end you can feel the darkness to come... All in all just perfect\nfor anyone who likes fantasy and Harry Potter. And also just greatly\ndone in all technical ways.\n"},
{"review": "\nHonest, unbiased review by a Harry Potter hater!<br><br>I'll keep this short. No one needs a massive essay to read.<br><br>I begrudgingly went to watch this movie at the behest of my other half\nas she's a massive fan of all things Harry Potter. Where as I can't\nstand any of it.<br><br>Well, how I was surprised! <br><br>Fantastic Beasts and where to find them is by far the best movies I've\nseen this year. In fact, it's one of the best movies I've ever seen!<br><br>It's one of those movies that has something for everybody. Captivating\nstory line, excellent castings with exceptional performances. I could\ngo on forever... Go and watch it right now! Now, dammit!!!\n"},
{"review": "\nFantastic beast a first installment of this movie series a magic is\nwonderfully because the great story line and star-cast is very\nimpressive acting of this movie. <br><br>A great Wonder magic and visual effects are most effectively.<br><br>FB is past of future then harry potter world to amazing story .<br><br>Directed by David Yeats amazing making of movie is always greatest\nmovie in history of Hollywood movies world. <br><br>If you should go to watch movie to my suggestion to watch movie on your\nlife.<br><br>I guaranty to you are not watching on of the greatest movie your life.<br><br>The movie is very attractive of huge visual effects.<br><br>First movie is attractive to wiring for all movies of this movie\nseries.<br><br>Watching this movie to be you should be not control to watching second\ntime for this movie.<br><br>My review to this film is 10 of 10 stars.\n"},
{"review": "\nFantastic beast a first installment of this movie series a magic is\nwonderfully because the great story line and star-cast is very\nimpressive acting of this movie. <br><br>A great Wonder magic and visual effects are most effectively.<br><br>FB is past of future then harry potter world to amazing story .<br><br>Directed by David Yeats amazing making of movie is always greatest\nmovie in history of Hollywood movies world. <br><br>If you should go to watch movie to my suggestion to watch movie on your\nlife.<br><br>I guaranty to you are not watching on of the greatest movie your life.<br><br>The movie is very attractive of huge visual effects.<br><br>First movie is attractive to wiring for all movies of this movie\nseries.<br><br>Watching this movie to be you should be not control to watching second\ntime for this movie.<br><br>My review to this film is 10 of 10 stars.\n"},
{"review": "\nFantastic beasts and where to find them is a true Rowling story. It\nreminds you of the first two Harry Potter films ie it gives priority to\nthe story. For example, simple things like the wands in this movie made\nme beam with joy because they looked exactly as they were supposed to -\na normal piece of wood that holds immense power.<br><br>From the beginning of the film (when the newspaper montage is shown)\none can see Rowling's flair and style of writing. The film is a mixture\nof dark scenes and vibrant bright scenes which (like her books) has the\neffect of the ever lasting battle between good and evil. <br><br>The story covers it all - romance, mystery, plot twists and turns and a\nbrilliant climax. As always, JKR uses her eye for detail and leaves\nnothing to imagination. As the story begins, the audience starts having\nquestions and as the story progresses, all those questions are indeed\nanswered. <br><br>The only negative here perhaps is that if you haven't read the books\n(and especially if this is your first Harry Potter experience), you\nprobably won't appreciate it as much as a seasoned Potterhead would as\nthere are a lot of references (that arnt explained in detail - they\ndon't have to be if you have read the books) from the Harry Potter\nseries. For a seasoned Potterhead however, these references, some\nsubtle - like the Hallows' necklace; some not - like Leta Lestrange;\nmake the movie all the more enjoyable.<br><br>Finally, Jonny Depp is Gilderwald to the T. The few minutes he is on\nscreen makes your skin crawl in a magnificent way as you want to face\nhim but somehow do not. <br><br>Bottom line - I loved it. Can't wait for the next part. Cannot believe\nit isn't a book. And simply cannot stop obsessing.\n"},
{"review": "\nI am so pleased the world of J.K Rowling has come back to are screens.\nI can't fault this movie. The visual effects was extraordinary. the\nstory line and the music behind the film was fantastic, just like the\ntitle. It feels like coming home watching this movie. I seen it in the\nIMAX 3D. it was truly wonderful and warming. though its not harry\npotter and its starting all over again getting to know these new\ncharacters, it's been great. we will always have a piece in are heart\nfor harry potter that we can enjoy watching over and over again. but i\nam sure this won't be a one off movie. they surly will make more of\nfantastic beasts. i am looking forward to see whats going to happen\nnext. go watch this movie if your a harry potter fan you are going to\nlove it\n"},
{"review": "\n21 November 2016 Film of Choice at The Plaza Dorchester Tonight -\nFantastic Beasts and Where to Find Them. For those of you who are\nmissing the adventures of Harry Potter and his wizarding world,\nFantastic Beasts plugs that gap with alacrity. With a cast headed by\nthe supremely talented Eddie Redmayne, as Newt Scamander, this film\nimmerses us once more into a place where the world of wizard and No-Maj\n(American for Muggle) collide. We are again treated to an insight of\nthe machinations of J K Rowling's brain, and I for one am always happy\nthat she shares it with our world. You absolutely do not have to watch\nany of the Harry Potter films to understand any of the references to\nMuggles, Hogwarts and the like, this film is story on its own and we\nare introduced to a whole new collection of characters.......and\nmagical beasts, some of which are cute and some downright weird.\nExcellent visual effects, and a screenplay which includes more than a\nfew lighthearted moments. Another smash from the wizarding world and I\neagerly await the next instalment.\n"},
{"review": "\nFantastic Beasts and Where to Find Them... It's not Harry Potter,\nhowever it is a classic in its own right. I loved the creature\ncreations for this movie including of course those greedy goblins which\nI was so very happy to see in this film as well. Eddie Redmayne did\nsuch a wonderful job as Newt Scamander and his cast of creatures was\nbreathtaking. They were all created differently and beautifully in\ntheir own right. His deep connection and understanding of the creatures\nwas so well done by Redmayne who seemed to be a little Autistic with\nhis lack of eye contact most of the time while talking, which if it was\ndone on purpose, I love it. It gives the character even more depth and\nbeauty. The other wizards were amazing, I think my favorite was Queenie\nGoldstein she was so endearing and such a wonderfully played character.\nShe had a lot of heart and that endeared her to the audience even more.\nIt was cool to see the differences between the American and British\nMinistries of Magic and the difference in terminologies between the two\ncountries. All in all this movie gets 5 enthusiastic stars from me. The\ncontinuity was incredible and I highly recommend it.\n"},
{"review": "\nAfter the Harry Potter Series, J.K Rowling has come up to bring all\nthose characters who were just mentioned in the HP Series. I went with\nmy friend on the 3rd Day from the release and experienced the movie in\n4DX. We both expected a lot more magic, the Hogwarts Castle and as in\nthe movie they mentioned about the Wizarding school in America, it was\npretty obvious that everyone wished a look at it. The title suggested\nthat the movie would be similar to the Deathly Hallows Parts of HP,\nwith a change, in place of Horcruxes we have Beasts. It also suggested\nthat Newt Scmandar is on his way to America to find some of the beast,\nbut instead he had them with himself. The movie shows that Newt is\nwriting the 1st Edition of his book, but in HP part 1, we can see Harry\nreading the 52nd Edition of the book. So, we can expect at least 5-6\nmore parts to be in the series. The overall movie experience was\namazing, especially the 4DX effects. Expected more from the movie, but\nits back in 1962, so that's OK for me.\n"},
{"review": "\nIf you have been, and still are, a super nerdy Harry Potter fanatic\nlike me, you will have a blast watching reference after reference to\nthe now already older HP-movies, and it will be easy to follow the\nstory line because of that. Don't even get me started on an amazing\nreveal towards the end. You will feel a chill running through your\nbody.<br><br>The story is well written, as usual, by her excellency J.K. Rowling,\nleaving almost nothing unclear or confusing by the time the credits\nroll. In my opinion though, a few things still need clarification, but\nthat's absolutely the whole charm of it, because it makes the desire\nfor the next four all the bigger.<br><br>Last but not least, hats of to Eddie Redmayne for a fantastic portrayal\nof Newt Scamander, which was just outright stunning. Furthermore, there\nis one more supporting actor who deserves great credit for a very\nemotional, humoristic and overall grand portrayal of a quite\nsignificant role, but I won't tell you who, because you need to go\nwatch the movie now...\n"},
{"review": "\n(no spoilers). the movie is actually very well done. I was a bit\nworried when I saw trailers, but the movie definitely exceeds\nexpectations.<br><br>Now, the good stuff: *the movie has the same feeling as harry potter\nsaga, it has the same charm and so on. I guess it's the biggest plus\nfor me, to see and feel the HP world again. *actors do a good job.\nActing is good, strong. The main character is likable too. *it's a\nlighthearted movie with humor, but at the same time it also has\nseriousness. So it's quite a balanced movie. *really good CGI in 3D.\nDefinitely go to 3D, it really makes a very big difference.<br><br>Now, the reasons why I deducted one star are: *some scenes were a bit\nslow and too long. But nothing major. *some humor in one or two scenes\ndidn't feel too natural. But overall the humor is good, so no worries\nabout it.<br><br>In overall, I really recommend seeing this movie(especially in 3D),\ncause believe it's a treat for you eyes, and at the same time with the\ncharm and feelings of HP world from HP saga.\n"},
{"review": "\nWhisper it quietly, but I might just have enjoyed this more than any of\nthe Harry Potter series. Not that any of them were bad. The first 2\nwere a bit ropy but still set out the world beautifully, our first view\nof Diagon Alley was a wonder to behold, and they generally improved\neach after the other, though 3 may still be the best. But maybe the\nfact that this could just be a movie without beholding to the books,\nwhich the original series had to, gave this much more freedom. It was\nalways impossible to completely be faithful to the complexity of the\nbooks story lines in the time restraints of a films runtime. Plus not\nknowing how it was going to turn out before even entering the cinema\nwas a bonus. I also appreciated the fact that the wizarding world could\nbe expanded beyond Hogwarts and its grounds, and the New York of 1920's\nwas beautifully realised and the ways in which the magical world of\nAmerica differed from that we had previously seen was cleverly done.\nThe film is also improved by the fact that from the start it has better\nacting talent in the main leads as with the best will in the world the\noriginal child cast, with exception of Emma Watson and Tom Felton, were\nlacking a touch, though they improved a bit as time went on. This does\nsuffer from the problems of the first couple of Potters in that it has\nto set up the world, and maybe tries to squeeze a bit too much in to\npave the way for the sequels, and also Newts story and the forewarning\nof Grindelwald seem a bit squashed unnaturally together. But despite a\nfew faults I really enjoyed this and am looking forward with impatience\nfor the rest of the story.\n"},
{"review": "\nThis is certainly not Harry Potter or anything like it. I gave it a 4\nbecause the story-line is convoluted, the movie is long and dull with\nvery few substantial scenes or narrative to keep the viewer enthralled.\nThe sound of Eddie Redmayne's voice is also so muffled that it's\nsometimes hard to discern what he's saying.<br><br>I wish I could relate in my review what the story is about but it was\nso convoluted that I lost track. The movie also goes overboard on the\nspecial effects and quite frankly I've seen enough movies with monsters\nand aliens rampaging through the streets of a city and demolishing\nbuildings and parks - is all that grand destruction really necessary?\nSave your money for the DVD release.\n"},
{"review": "\nI went to see this film with ONE expectation: make me feel magical like\nHP films did. Bring the magic! Well, Fantastic Beasts delivered.<br><br>First of all, let me write down a few lines about Eddie Redmayne's\nperformance and about his Newt Scamander. Eddie was just amazing. He\nnailed the character. His expression, non-verbal language and kindness\nbought me over almost instantly. He is shy, closed person who\nabsolutely loves all sorts of fantastic animals and more importantly -\nunderstands them. It was a treat seeing him in every single frame he\nwas in. Bravo! <br><br>Moving on to Colin Farrell, aka Percival Graves. The moment you first\nmeet him you know this guy means business. He is focused and powerful.\nWhat I liked personally was that throughout the whole story you weren't\nreally sure whether Graves is bad or sort of good... I find this\nmorally gray personality compelling, especially in times where we live\nin Disney Star Wars and Disney Marvel, both featuring pretty damn bland\nprotagonists and antagonists. Breath of fresh air indeed. <br><br>No-Maj was outright fun and interactions between Newt and him simply\nput a big ol smile on my face. That is the kind of humour I do like and\nenjoy. Great fun!<br><br>Now the picture itself. Look, it's nothing ground-breaking, even a\nlittle predictable at times, but it's the execution that plays the main\nrole here. Special effects are sharp, clean and very subtle. Beasts are\ncolorful, properly magical and perfectly voiced. You will get lost in\nNewt's zoo, never wanting to go back to real life. Every character has\nits logical place and pacing makes sense. <br><br>I have yet to create a final opinion about Johnny Depp being casted as\nGellert Grindelwald, as I'm not fond of his acting skills. However,\nthis did not hurt my overall rating of Fantastic Beasts and Where to\nFind Them. <br><br>Go see it in IMAX, you will get magically rewarded.\n"},
{"review": "\nFantastic Beasts and Where to Find Them<br><br>This was a most excellent film! The production values were top notch.\nThe acting was on point. The casting was superb. The script was tight.\nThe action flowed quite well. The two and a quarter hour run time\npassed in a flash. The dialog was fully appropriate and well done. On\nall points, this film delivered and was well worth watching.<br><br>For fans of Harry Potter this film fits wonderfully into that existing\nrealm - but stands nicely apart from it. Some, just enough, actually,\nof the familiar landmarks and touchstones are there - Hogwarts,\nDumbledore, muggles, etc. - but only as frame setting reference points.<br><br>The story is otherwise apart from the world that Rowling showed with\nHarry Potter and we're well rewarded by journeying to it. Thus, you\ndon't have to be a Potter fan or have read any of the books or seen any\nof the previous films as this tale well enough stands on its own.<br><br>The characters were well rendered and nicely believable. Their\nmotivations were realistic and made sense within the confines of the\ntale. Aside from Farrell and Voight, the rest of the cast were\nessentially unknowns. That's a grave risk for any film with such high\nexpectations riding on it. Yet, that cast was exceptionally well cast\nand delivered handsomely in their performances.<br><br>The sense of wonder and awe and beauty of magical possibilities was\nwell handled and quite different from what we'd seen previously in the\nPotter films. A different tale, this, and thus a different flavor.<br><br>With this release and its well deserved coming success, there's sure to\nbe more Rowling tales set in America and thus will have an entirely new\nand different audience than what the Potter-verse has already created.<br><br>I recommend this film highly. It's a great and enjoyable bit of magical\nentertainment.\n"},
{"review": "\nThis was a very great spin off of the Harry Potter books. After all,\nNewt Scamander did not appear in the Harry Potter books, but was\nmentioned in the books. Also we saw Gellert Grindelwald, who was of\ncourse the inspiration of Tom Riddle, also known as the evil Lord\nVoldemort. He was also once Albus Dumbledores friend until his rise in\ndark power and then was imprisoned after trying to possess the Elder\nWand and then was murder by Voldemort when he was looking for the wand.\nThis movie also tells more about Grindelwald's past. He uses this boy\nnamed Credence Barebone who was also an Obscurial a powerful dark force\nthat causes destruction and chaos. Its sister is called an Obscurus and\nthe Obscurial was its host and Scamander kept it alive in a magic\nshield even after the Obscurial was destroyed by the counsel of wizards\nin New York City. Grindelwald was also arrested and then taken to\nAzkaban. Scamander also came to New York with a suitcase full of\nmagical creatures that got loose and ran a muck around the city, but\nthey weren't dangerous. Just mischievous. Newton Scamander managed to\nget them all back though and safe in his suitcase and then went back to\nEngland and after saying goodbye to Porpentina who of course becomes\nhis wife in the future. Also Jacob Kowalski is also a likable character\nand opens up his own bakery after working in a can factory. Also he is\nthe first muddle to be in love with a magic person. Yep this movie is\nreally interesting and if you read the book that its based on, it will\ntell you all about the creatures in the Harry Potter universe.\n"},
{"review": "\nAll I can say is that this movie is a great opening to the future\nstories. The whole cinema was immersed with the movie, I can tell. We\nall missed the wizarding world. I swear to god the entire cinema made\nan \"aah..\" sound when the hedwig's theme was played at the start of the\nmovie. The jokes were funny, we laughed, and we also were carried away\nby the thrilling adventure. Although I felt that there were some parts\nthat were a bit too stretched out (cannot complain though as i enjoyed\nevery minute in the wizarding world). Newt Scamander was acted\nsplendidly by Eddie Redmayne. The gentle, animal lover/geek with\nawkward personality towards human was really shown. Some might say that\nthe CGI was a little bit too much, but how else can you include dozen\nof mythical creatures in a movie? The only downside I saw was that the\nAmerican wizarding school, Ilvermony, didn't get as much part as I\nthought it would get. After the ilvermony sorting feature and the\nilvermony's backstory on pottermore, I thought this movie was going to\ninclude some parts about the school, but apparently it wasn't. It is\nindeed not a mind blowing movie, but it gave such nice aftertaste. It\nis the kind of movie that makes you smile while and after watching it.\nOh the nostalgic feeling you will get after seeing the wizarding world\nagain!<br><br>All in all, a new wizarding story awaits! Now I clearly see why J.K\nRowling decided to make 5 movies instead of 3. I believe there are some\nserious plots ahead.\n"},
{"review": "\nI am a big harry potter fan and I have read all the books at least\nthree times. I went to this movie with high hopes seeing all the\npositive reviews and was not disappointed. I really loved Dan Fogler\nacting, such a talented guy. He can make you laugh just by his facial\nexpressions. Acting was brilliant, very natural. I hope he and Eddie\nRedmayne will play a part in future movies. I watched this movie in\nIMAX 3D and I would recommend everyone to watch it in this version, you\nwill not be let down. Brilliant cinematography, really feels like\n1920's New York City, and the musical score fits perfectly with it. J.K\nRowling has proved once again that she has a gift of telling stories in\nsuch a way that you are hooked from the beginning. After watching\nboring movies in summer, for example Star trek (very predictable), this\nmovie, Doctor Strange and Arrival according to me are the best movies\nof the year. November has been truly a blessing. I don't want to give\ntoo much away plot wise, but I am imploring you to watch this, if you\ncan, with your friends and family, you will leave as a happy man/woman.\nOf course it is not perfect but which movie is? I am a philosophical\nkind of person, so I could see lot of moral/ethical lessons, especially\nfrom Newt, that I can apply in my life too.\n"},
{"review": "\nI have to say that I am really disappointed of the movie as a whole.\nThe Harry Potter movies are easily one of the best and most rewatchable\nmovie franchises so far. And this movie is sadly nothing like the\noriginal HP movies. The only thing that is has in common are the\nspecial effects (for the apparitions). There was no real dialogue\nbetween the characters. Just silly one-liners and the occasional\nhumorous remark. I am also very angered by the fact that they just\nintroduced a new concept (obscurials) to the HP franchise that would\nliterally change everything (if obscurials exist why hasn't Harry\nPotter become one? After all he fits the criteria).<br><br>There was also way too much CGI in the movie. It became a real nuisance\nafter a while. Especially because it wasn't even \"up to today's\nstandards\".<br><br>My final critique concerns the overall flair of the movie. It just\ndidn't feel like it belongs to the magnum opus that is the HP movie\nfranchise. And righteously so; why did they film it in NYC? The HP\nfranchise is the most British thing since James Bond and Doctor Who. I\nnever really realized it before but now that I watched this movie it\nbecame very clear to me. You can't just change the location like this\nand expect the audience to embrace it. Sorry. What's next? Fantastic\nBeasts in Japan? No thanks. We already have that, it's called Kaiju.\n"},
{"review": "\nAll of those who have grown up watching Harry Potter and thinking this\nmight not be up to their expectations, my advice to them is, give it a\nchance and you're never gonna regret it. If Queen Jo can create a truly\nmagnificent magical world before, why are you putting her abilities to\nenhance the magic beyond limits to doubt??? This is her first, as a\nscreenwriter and it is splendid and she has bound her audience in the\nmagical world, they had already quit trying to escape. Eddie as an\nactor has proved AGAIN that he has got what it takes to bring the\ncharacter to LIFE. Newt IS Eddie. It's refreshing to see new faces in\nthe same scenario that we grew up with. Of course, you'd miss Harry\nPotter, but this is something worth watching. And even I am a\nPotterhead, I am happy that they are thinking of making four more.\nEnjoy... :-)\n"},
{"review": "\nAlthough I was a fan of the Harry Potter series, I had no preconceived\nnotions or requirements for this stand-alone movie, other than an\nexpectation that J.K. Rowling would not disappoint.<br><br>Nonetheless, I was disappointed. The first half of the movie is\nbasically an overlong visit to a CGI-created zoo. We watch as the\nprotagonist hunts down a half dozen or so \"fantastic beasts\", mostly\none at a time and in extended chase sequences. If you do not enjoy\nvisiting zoos or watching car chases (which have the same dynamic as\nanimal chases, no matter how exotic the species), you may be bored. I\ncertainly was.<br><br>The second half of the movie is more engaging, as loose strands from\nthe first are finally woven into a conventional good vs. evil morality\nplay. But even here, virtually every turn in the plot is easily\npredictable, as Rowling uses the same pro- Muggle/anti-Muggle dynamic\nemployed in the Potter series to define her characters, plus an\nironically preachy lesson in the harmful nature of organised religion.\nFortunately, the actors, particularly the good guys and gals, are able\nto overcome the limitations of the script so that I couldn't help but\nlike them and cheer them on. The cinematic recreation of early 20th\ncentury New York is also well done.<br><br>However, on the whole, I think Rowling is capable of better work than\nthis. For movie-goers content to be dazzled by special effects, this\nfilm may do the trick. For those who want more than a formulaic \"Hagrid\nsaves the world\" knock-off, the film will probably seem much longer\nthan its two hour running time.\n"},
{"review": "\nI went into this movie with a very open mind. I am not a Potter-head,\nbut I am not totally ignorant either, I heard about a horcrux, I know\nwho Dumbledore is ... and I like magical fantasy movies ... but I have\nnot been that non-entertained in a long time. The characters all felt\ndistant to me, could not relate, as if I had missed a prequel or\nsomething. Hence I ended up not caring about the convoluted plot that\nfelt like the old Potter problem: too many things in one book trying to\nsqueeze into one movie. I found myself checking for the run time of the\nmovie in the middle to see when I can go. The CGI and set pieces were\ngreat eye candy, which is a total waste when the audience lost track or\nsimply does not care anymore. The creature design felt very uninspired.\n"},
{"review": "\nI was actually holding on to keep watching this movie in theater. I\nshould have left it in the middle. It was a waste of 2hr. The movie was\nSOOOOOO slow. The audio was terrible. The Video was also terrible, all\ndark and cant see anything. The story was predictable and not\ninteresting at all except the last scene. And to be honest it wasn't a\nshocker since they have showed a man at the beginning and then we all\nwere waiting him to appear somewhere. It is waste of your money, time\nand space in your brain. I am a huge fan of HP but I am kinda\ndisappointed. They shouldn't make more of this movie. Its quite waste\nof resources.\n"},
{"review": "\nThe biggest dilemma you will have before going into this movie, is\nwhether or not it will live up to the legend of Harry Potter, and the\ncuriosity how can you make a 'Harry Potter' movie without Harry Potter?\nBorrowing its title from one of the textbooks Harry studied at Hogwarts\nSchool of Witchcraft and Wizardry, \"Fantastic Beasts and Where to find\nthem\" marks the first screenplay written by J.K Rowling herself. Though\nthe world-renowned novelist had always kept a tight rein on how those\nadapting her Potter stories went about their task, this assignment\ngives her the unprecedented ability to address her massive global fan\nbase directly, while current events have given her something more\nsubstantive to say. For those that haven't seen Harry Potter, do not\nworry! From minute one the movie gets you on a journey with great\nvisuals, very recognizable music and great performances. Every now and\nthen you get the, sometimes funny, sometimes smart references to Harry\nPotter, but this is a movie that can totally stand on its own.\nFantastic Beasts and Where to Find Them stands perfect on its own and\ndoesn't need Harry Potter or any of the planned movies to get you\ninvested in its story and yet it is an obligation for every J.K.\nRowling wizard world-fan to go see this movie. The director David Yates\nfound this perfect balance and ended up with a result that has to be\nseen in theaters by everyone.\n"},
{"review": "\nI'm gonna say I've never been a fan of Harry Potter, now don't get me\nwrong, I've watch the films and found them entertaining. I don't hate\nit, but don't love either. Now I was into this after seeing the\ntrailer.<br><br>Magic scenes are effective, reminds us why we loved Harry Potter, even\nthough this is a prequel. Eddie Redmayne does have quite a boyish charm\nhas the wizard Newt. Dan Fogler brings some memorable moments here, has\na human who gets pulled in the magic world. He and Redmayne have such a\nButch and Sundance like chemistry. Alison Sudol is also quite the scene\nstealer, has a happy go lucky wizard. Colin Farrell really gives his\nall here, I really don't want to spoil anything about his character.\nBut everybody else seems so lifeless in there roles, Katherine Waterson\nalways looks like she's gonna cry in every scene.<br><br>At least in the Harry Potter movies I've seen, all the characters had\nsome degree of life in there performances. I think I would have liked\nit more if the movie was more focused on Newt and the Beasts. The\nBeasts in this film where more watchable also, even though they where\nCGI. All in all not terrible, but not Fantastic. Hard core Harry Potter\nfans will probably wanna see this. But I could sit through Doctor\nStrange a million times more then Fantastic Beasts. Does not make me\neager for the sequel.\n"},
{"review": "\nWalking into this movie I really had no expectations, It wasn't that I\nthought It was going to be particularly bad or anything, I just wasn't\nhyped. How wrong was I ... After one viewing Fantastic Beasts and Where\nto Find Them has become my favorite film of 2016 as of this moment, and\nfor good reason. The characters were so likable after five minutes of\nscreen time or less, the acting was on point with particular favor\ngoing to Ezra Miller who gives another knock out performance after We\nNeed to Talk About Kevin and the special effects are just straight out\nof this world. Each and everyone of the creatures look beautiful with\nmy favorites being the Occamy, the Thunderbird and of course the\nadorable Niffler. Eddie Redmayne plays the roll of Newt Scamander\nperfectly, Kowalski is both incredibly likable and greatly hilarious\nand most surprisingly of all Colin Farrell is great as Percival Graves\nuntil he becomes Johnny Depp's Gellert Grindlewald. And what more can I\nsay, J.K Rowling's still got it, as has David Yates and I just couldn't\nfind a thing wrong with this movie. Top marks.\n"},
{"review": "\nAs a self-proclaimed Potter-head I admit I was excited, but also a bit\nworried when I entered the theater. How could anyone create a wonderful\nworld of witchcraft, without Harry?! But, I must admit, JK Rowling did\nit again. I was smitten almost immediately as the adorably unassuming\nNewt Scamander's thieving beast escaped, and from then on, the film had\nme. <br><br>Before I went to the theater, I hadn't read the book or even seen more\nthan half of a trailer. I honestly had no idea of what the story was\nabout, except that it had something to do with some pretty Fantastic\nBeasts. I had no idea of the heart-warming, action and suspense packed,\nincredibly filmed, tale of fantasy that awaited me.<br><br>First, I want to talk about the story. Without the adventure that\nRowling created, the film would have been beautiful but boring. The\nstory perfectly weaves magic from Potter world we know, with the old-\ntime-y feel of 1926, while also incorporating more than enough action\nand suspense to keep us on the edge of our seats, while the\nheartwarming story of a young man and his beasts. As JK Rowling's\npremier screenplay, she did fantastically- as the name implies. <br><br>The wonder of the film doesn't end at the plot. The cinematography was\nbeautifully curated to present us an entirely new era of the wizarding\nworld. The special effects gave us some of the most fantastic creatures\nthat our minds could comprehend, while also feeling so real that the\nviewers couldn't be anything but fully engaged. The actors were also\nperfectly chosen for their roles, and fully embodied the characters\nthey transformed into. <br><br>Overall, I was impressed. The seemed to be almost fully indented of\nHarry Potter, only sharing their world. This separation I think was\nextremely important because it leaves Fantastic Beasts room to grow and\nbecome its own series for this next generation. I can't wait to see\nwhat comes next!\n"},
{"review": "\nSince I found out about this movie in early 2016, I had been excited\nfor it, and, after seeing this last night, I was right to be excited.\nThe cast was great, and there were a lot of great characters in it, but\nthe one that stole the show for me was Kowalski. He was always very\nfunny and usually quite sarcastic. Eddie Redmayne was great as Newt\nScamander, the future author of the Hogwarts textbook fantastic beasts\nand where to find them. Who, accidentally lets some of his beasts loose\nin New York, and has to track them down and put them back in his\nsuitcase. Seems simple, right? Only no, it's a lot harder than Newt and\nthe gang think, because because of things like zoo chases and having to\njourney throughout New York to do so, and a dark energy force called an\nobscurus, which can cause pure destruction and destroy anything that is\nin its path. So overall this film needs only one word to describe it:\nfantastic. Definitely a must see film. Your move rogue one.\n"},
{"review": "\nThis movie is absolutely beautiful from start to finish. If you can see\nit in 3D I highly recommend you do. It enhanced the already beautiful\nand magical quality of the movie. The story was interesting and had\nboth light and dark elements to it which made for a highly engaging and\nemotional movie experience. Eddie Redmayne as Newt was entertaining,\nintriguing, and mysterious and quite honestly just perfect for this\nrole. All supporting cast members I felt were wonderful in their roles\nas well and the chemistry between them was great. The \"beasts\" were all\nbeautifully done and magical to watch. I will definitely be going to\nsee this again!\n"},
{"review": "\nIt's not bad, it lacks the childlike wonder that came with the Harry\nPotter novels and movies, but it was still a ride back into that world\nand one that we've all been itching for and for a fairly long time.<br><br>You get a beautiful Art Deco New York between the wars and Colin\nFarrell fittingly doing his best Melvin Purvis impersonation, at least\nwhat would be his best if the Irish didn't keep slipping through.<br><br>Eddie Redmayne was fantastic, even if he did, from time to time,look a\nlittle too much like Roger Daltrey for his own good.<br><br>And then the rest of the cast, you see A-list celebrities popping up in\nthe smallest of roles, as if the script hit Hollywood and every\ncloseted Rowling fan dove for a little slice of the script. In a way it\nhelps the movie, and in a way it's distracting to have Ron Perlman and\nJon Voight jump up in minor roles.<br><br>What is it with Perlman and heavily prosthetic roles? The world may\nnever know.<br><br>Still, it is far more adult than the first few Harry Potter novels,\nfilms,and this time the cast is more adult to match. But don't worry,\nit doesn't take away from the heart that comes with Rowling's world.<br><br>And, the surprise cameo may be a teaser for more to come. The world my\nnever know.<br><br>Either way, it's the fix we've been waiting for since the Deathly\nHollows and the disappointment that the last story was a screen play\nand not a novel. At least we got to see it on the big screen.\n"},
{"review": "\nHonestly when I saw the trailer I thought it was going to be terrible\nbut it wasn't! I went to go see it in 3D and it looked amazing.<br><br>However, it wasn't the best movie I've ever seen, every Harry Potter\nfilm I've watched was awesome because I would get this warm fuzzy\nfeeling inside me every time and it was enjoyable.<br><br>This film though is a completely different story, it had an entire new\nfeeling to it, the characters just felt a bit wonky, like they were\nsilly and weird characters that you really didn't get attached to and\nthat's what I hated the most. The magic is another thing, this movie is\nset in the world of Harry Potter but it doesn't feel like it, the\nspells they use are sort of different.<br><br>I don't know, maybe I'm a HP dork and can't get over the fact that this\nisn't a HP movie, either way it was good, not the best but good.\n"},
{"review": "\nThe film is just amazing, with stunning, sets visuals and plot. My\nfavorite character is Jacob the no-mag. Definitely worth paying the\nadmission, it was so amazing that I was left speechless at the end. I\nlove the fact that it has some resemblance to the Harry Potter. I loved\nhow Newts case has lots of dimensions. My favorite beast was the\nNiffler, I thought it was really quite cute. However it isn't really\nlike the Harry Potter movies, which I think is a good thing because it\ngives HP fans a chance to see something different by J.K Rowling, with\nsome different actors too. I thought Eddie was the perfect choice for\nNewt. I loved Dan Fogler too! The film was the best film I have ever\nseen, I cant wait for the second film.\n"},
{"review": "\nSince 2014 I heard about this and was so Excited that I didn't think\nabout if it would be good. So when I saw it I was impressed, because I\nkept seeing people saying it was a disappointment compared to Harry\nPotter, but let me say this. This isn't Harry Potter, this is a whole\nnew story that's beginning!<br><br>It's starts off with Newt arriving in New York and I absolutely loved\nthe characters including Newt(Eddie Redemaye), because he was so\nawkward and quiet until he's around his animals and you see the real\nhim. So overall this was a good movie and and can't wait for the next\n4!!!\n"},
{"review": "\nI went with somewhat lowered expectations due to some very negative\nreviews. However, the movie was solidly entertaining. A few reviewers\nsaid the film did not live up to its name but I found it sufficiently\nbeastly for me. There were some comments about it leaning heavily on\nthe Potter franchise which don't appear to be true. It does follow the\nHP universe with an American twist. I particularly liked the actor who\nplayed the lead, Newt Salamander. He reminded me of Matt Smith who I've\nbeen missing ever since he left Doctor Who (Capaldi just doesn't cut\nit, sorry). I also found the subplot with the baker/cannery worker\ncharming. It was just what the movie needed - a bit of muggle :^). In\ngeneral the actors did a very good job. Many may claim the CGI was\noverdone but I found the film well-paced and enjoyable. It totters a\nbit before it finds its feet but comes together for a satisfying\nfinish. Production values are excellent (to my eye) and the direction\nis good along with the script. I suspect there will be a ready audience\nfor a sequel if they make one.\n"},
{"review": "\nThe best thing about the movie is the creatures, and the world of these\nfantastic creatures. The photography was excellent in capturing the\nmagic and awe of the world of magic. This is backed up by Eddie\nRedmayne's brilliant performance as the awkward but kind Newt\nScamander. Co-starring alongside Redmayne is Dan Fogler, who seems more\nlike a Kevin James lookalike. He is both charming, and funny. Another\nstrong point is the cameos by Johnny Depp, and an unrecognizable Ron\nPerlman as Gnarlak. The bad part of the movie was the story-telling. It\nseems like two different stories set in the same world. The tones are\ncompletely different. One story focuses on Newt and his creatures,\nwhich is more like a children's adventure story. The other story,\ncentering more on Farrell's character is darker and follow's the tone\nof the Carrie remake. When the two stories merged, it seemed forced. I\nguess Yates is brilliant in focusing on one story, like he did in the\nHarry Potter movies than he is at telling intricate plots. The pacing\nwas a problem too, as it seemed to proceed too slowly, especially the\none focusing on Ezra Miller's character. Miller's character is wasted,\nand despite having little screen time, you can't feel a sense of\ntragedy for his character at the end. John Voight was unnecessary, and\nprovided no new stakes to the story. However, Harry Potter fans will\nprobably enjoy this movie because is opens a new world to the Harry\nPotter universe. For non-Harry Potter fans like myself, I am just\nmildly entertained. Let's see if the sequel is better.\n"},
{"review": "\nLet me say up front that this is not a bad movie. But I notice a lot of\nPotter-fans are looking at this movie through rose-colored glasses, and\nare unable to see its obvious flaws. This is a pretty flawed movie.\nFun, but not great.<br><br>But lets start with the good. The characters are fun, the visuals are\nstunning and impressive. And the amazing Potter atmosphere of whimsy is\nall over this film. I also liked how the music of the movie starts with\nthe soft Potter-theme, and then immediately abandons it for the rest of\nthe film, and sticks with its own new theme music. There's plenty of\nreferences for fans to enjoy, but you do not need to be a Potter fan to\nunderstand what is going on in the film. This movie can very much stand\non its own.<br><br>But now the bad. The movie seems to forget that it has a plot for about\nhalf of its running time. For most of the movie we follow the main\ncharacter in his quest to retrieve his missing animals all over New\nYork, which is fun, but has very little to do with the main plot. It\nseems as if the movie suddenly remembers that it has a villain (who is\nbriefly mentioned with quick flashes of newspapers during the opening)\nand it forgets that it still has to build towards a finale. Out of\nnowhere the final act is suddenly dropped into the movie. That is a bit\nsloppy, and it leaves the main villain very undeveloped. I also think\nmany of the characters are a bit shallow, and steeped in stereotypes\nand clichés.<br><br>Technically, the movie feels a bit sloppily edited at times, which\nmakes some scenes hard to follow. And especially during the final act\nthere are a lot of bright flashing lights that are a pain on the eyes\nif you are sitting in a dark theater.<br><br>That said, I was still entertained. But the film critic in me feels\nthat this should have been a lot better. I also noticed that I had a\nhard time remembering the names of most of the main characters.\n"},
{"review": "\nI have to say that while watching it, I found it filled with flaws.\nThere seemed to be many structural problems, some pacing issues, and it\nsuffered from being a little messy. Definitely a lot of things to\nnitpick. However, it still fared very well with me. The experience was\none filled with a lot of joy and wonder, which is what these films are\nsupposed to induce. As flawed as it was, I realized that I did form an\nemotional connection to the film and to its characters. The main\nfoursome is a really strong batch of characters and I would be glad to\njoin them on any adventure. So after seeing several reviews where\ndisappointment was the recurring theme, I actually found this to be a\nbit better than that. A great film? Probably not. But a very good one\nindeed and a more than solid start to this franchise.\n"},
{"review": "\nThe movie takes place in the Harry Potter world. You can recognize\nwords, ideas and places from the same universe, although the story\nfeels fresh with original fantastic beasts. This movie is targeted at a\nmore mature audience. The story is very creative, with excellent\nactors. The main actor, Eddie Redmayne, did an amazing job and created\na peculiar character, better than our imagination could contrive. The\nmovie has dark scenes but in our mind, only the sweet and pleasant ones\nremain by the time we leave the movie theater. JK Rowling mixed the\nreal world with the magical world and in this way was able to create\nfunny moments.<br><br>The movie is very good and you can enjoy it!\n"},
{"review": "\nWatched Fantastic Beasts And Where to Find Them with Oscar Winning\nActor Eddie Redmayne(The Theory Of Everything) as Newt\nScamander,Katherine Waterston(Inherent Vice) as Tina Goldstein,Dan\nFogler(Fanboys) as Jacob Kowalski,Allison Sudol(Transparent) as Queenie\nGoldstein,Collin Farrell(The Lobster) as Percival Graves,Carmen\nEjogo(The Hunger Games Mockingjay Part 2) as Seraphina Picquery,Ezra\nMiller(Suicide Squad) as Credence Barebone , Samantha Morton(John\nCarter) as Mary Lou Barebone, Ron Perlman(Sons Of Anarchy) as Gnarlack\nRalph and Jon Voight(Woodlawn) as Henry Shaw. As A Harry Potter Fan I\nreally enjoyed this film diving into the expanded Universe of Rowlings\nWizarding one thing that made the films great is The Characters and we\ngot a new trio which was awesome I also enjoyed Redmaynes Performance\nas Newt also Fogler was great as Jacob who stole almost every scene\njust by his facial expressions alone also really enjoyed the\nintroduction of MACUSA as the Easter eggs from the previous Harry\nPotter films as well as it opening in a similar fashion which was\nawesome hard to say what was wrong with this film i was only taken out\nof the film once it was because of the 20's flapper Goblin Singer in\nGnarlacks bar other than it was great . Great Music By James Newton\nHoward(Concussion), Cinematography By Phillip Rousselot(The Nice Guys)\n, Costume Design By Coleen Atwood(Alice Through The Looking Glass) and\nDirection By David Yates(The Legend Of Tarzan) An Epic Beginning For\nthe New Trio Of JK Rowlings Wizarding World 9/10\n"},
{"review": "\n. . . to warn America (and the rest of The World) of the Approaching\nStorm. After Weasel Bush used the anti-Democratic Lazy Racist Southern\nLoophole Clause buried in America's Constitution to barge into the U.S.\nWhite House and enable (or facilitate) the Carnage of 9-11, War in\nAfghanistan, Hurricane Katrina, and War in Iraq while allowing the\nRove-Cheney-Rumsfeld-Ashcroft Gang of Thugs to snatch and torture folks\nthroughout the world (these are just a few of the Low-Lights in W.'s\nReign of Terror), Rowling switched Harry Potter's Hogwart's Universe\nfrom a Bright Utopia of Sweetness and Light to a Drab, Dark Dungeon of\nDeath Eaters, Dolores Umbridge, and Fatal Doom Curses putting World\nCitizens in mind of Guantanamo Bay, Rendition, Water-Boarding,\nIntrusive Inescapable U.S. Spying on Innocent Civilians, and assorted\nBlack Ops of all kinds. Now with White House Resident-Elect Rump using\nthe same Election Losers Loophole to Rig his way into Power, J.K.\nRowling and Warner have released FANTASTIC BEASTS, depicting an America\ndivided between what sure looks a lot like Magic-Minded Millennials of\nthe Future and the Racist Rump Minority of the Past. Please Obliviate\nme when this Threat is past!\n"},
{"review": "\nOK I loved the movie don't get me wrong it was fun and funny and action\npacked just the action wasn't nonstop as the previews had suggested\nthat it could have been but it was a good time and perfect for the\nthanksgiving weekend or any time for that matter I loved Chastity she\nwas sweet charming and hilarious I kinda developed a crush on her by\nthe end of the movie lol take the family or go by yourself just go see\nthis wonderful little movie and enjoy the magical treat you are going\nto experience with the movie one of the years best films for a good\ntrip away from reality for awhile get out and run don't walk to your\nnearest theater and see this movie\n"},
{"review": "\nquality follow up to the harry potter story as a whole. worth the\nwatch. brings back the memories of the harry potter movies (music,\nwizarding world, newspapers) but is a completely new experience with\nnew characters and plot (wasnt as good of a plot but the story in harry\npotter was beautiful and few come close). basic plot: newt travels to\nnew york in order to free a magical creature in its native land but a\ncouple of his creatures escape when a muggle (americans call them\nno-mags which annoyed me but oh well) ends up with the magical case\nthat newt brought with him. newt has traveled the world collecting\nvarious magical creatures and studying them working on writing a book\n(a textbook used in the 3rd harry potter book I believe) that he wants\nto use to show that these creatures are not to be hunted. Now the rest\nof the story is focused on re capturing these magical creatures. There\nare other complications with he US magical congress and a\nanti-witchcraft organization.\n"},
{"review": "\nTo start things off I wanted to mention that I've not ever been a real\nbig Harry Potter fan; I didn't dislike the films; they just weren't\nfilms that held my attention well. When I saw the promotion material\nswarming the net talking about Fantastic Beasts and Where to Find Them\n(2016) and that the idea came from within the Harry Potter films, I\nwanted to see it.<br><br>Yesterday we had the time to swing into the theater and check it out.\nFrom the beginning to the end the graphics were completely off the\nchart, the story was fun and imaginative; certainly held our attention.\nThe cast for Fantastic Beast were perfectly selected, the characters\nheld their own throughout the entire movie. Honestly after watching\nFantastic Beasts and Where to Find Them (2016), I plan to kick back\nthis week and watch the entire Harry Potter collection just to give it\nanother chance. Fantastic Beasts and Where to Find Them (2016) is a\nwonderful film.\n"},
{"review": "\nHere we go !! The wait is over for this movie. I bet everyone missed\nharry potter from past few years. well, this movie gives you exact\nthrills and chills as any of harry potter movie. you don't have to be\nfan of harry potter or there is no major links from this movie to harry\npotter movies, there are certain Easter eggs. I am your average movie\nfan. I haven't read any of novels. and i almost had forgot stories of\nharry potter movies. Watching this movie certainly brought back\nmemories. The story is around 1920s , which relates to American era\nwhere most of them thought witchcraft existed. This movie takes place\nin New York. All the casting were really good choice. Eddy Redmayne has\nperformed another wonderful character, its so good to see him in those\nnerdy characters. Qweeny part portrayed by Lucie phol aka Fine Frenzy\nis so beautiful. 3D , animations , beast characters were very creative\nand mind blowing experience to watch them on big screen. Story was good\nbut in my opinion it needed to be bit more descriptive. i guess those\nparts come in next movie. I am so thrilled, cant wait for 4 more movies\nof this franchise. Do watch this, you wont regret it.\n"},
{"review": "\nThis movie is great for Harry Potter fans. There are a few jump-scares\nwitch takes away 1 point. Would rate it PG-13. If your kid is prone to\njump-scares then I would wait for DVD or rental. There is some scary\nmoments for younger kids with some people dying with a scary mark on\ntheir face. It seems like there may be some sequels. The plot is\ninteresting. I felt the plot would more be about traveling around the\nworld finding mythical beasts. If you have the book (I do) it was not\nat all like the book. Probably because the book is only a guide for\nwhat they are. When Newt says he is going to make a book I think it was\njust to sell march like that book\n"},
{"review": "\nI just watched this at cinema and this is too good. It has a good\nstory, emotional ending but it still has a lot of plot holes, and some\nscenes are not connected to each other but it still a watchable film.\nThe antagonist in this film is seems to be very powerful but in the end\nit had been killed by the MACUSA easily. The ending between Goldstein\nand Newt is kinda disappointing, me and my friends expected to see they\nwill at least having a goodbye kiss but in the film Newt just went away\nnot even look at her last time. In the entire 2h13m run-time, you can\nfeel the Harry Porter's atmosphere and some Easter eggs about Hogwarts.\nThere are some twists in the film and most of them are good but some\nare just too easy to guess.It's still a good film though .I'm looking\nforward to seeing the sequel which will be released in 2018.\n"},
{"review": "\nDirected by David Yates, the steady hand who'd steered Harry Potter\nfilms five to eight to popular and critical acclaim has done the same\nwith the Fantastic Beasts. Though Fantastic Beasts is genealogically\nlinked to Harry Potter, with nods and winks sprinkled like cake crumbs\nthroughout the script, in practice there's no particular reason it had\nto be. The catastrophic timing and tone of Depp's pop-up gurn sends you\nout of Fantastic Beasts feeling more anxious about the franchise's\nstamina. Solidly extending the Harry Potter franchise to a different\nera with new characters, Fantastic Beasts And Where To Find Them starts\nslowly before finding its groove, delivering sufficient spectacle\nalongside a little emotion. I go with 4/5 for this beginner of a new\npotential franchise.\n"},
{"review": "\nIt's not Harry Potter, but the magic go on!<br><br>If you go to the theater to watch \"one more Harry Potter's movie\", you\nare very wrong.<br><br>We can see a lot of things who make us remember Harry, like the\nuniverse, the spells... Each spell they conjure, we thrill a lot.<br><br>The acting is the highlight of the movie (almost all is good as well),\nDan Fogler was the character of the movie, in almost all the funny\nscenes, he was there. <br><br>This movie is to all ages. The kids will like because of the beasts and\nthe history of course. The adults will also like because there is a\nsuspense in the movie. Yes, there is suspense, and that isn't a just a\nlittle, the dark side of the characters is really bad and full of\ndarkness and thriller.<br><br>As I've said, almost all in this movie is good, but I didn't like some\nscenes with a Dragon Bird (I don't know if it's the correct name) that\nthe CGI could be better.. BUT all other beasts are just fantastic.<br><br>To finish my review, The good parts surpass the bad parts. I'm really\nanxious to the second, third, fourth...<br><br>I have to say one thing, you guys will have a big surprise in one of\nthe last scenes!<br><br>Thanks for reading. Enjoy the movie!<br><br>Bye.\n"},
{"review": "\nJust as the Harry Potter books gave much more info and supplied more\ndetail than can be crammed into a movie, I feel this story needed a\nbook to help flesh out some of its characters and inventions. For\nexample some of the most memorable acting from Samantha Morton and Ezra\nMiller portrayed characters I'd liked to have known more about and the\nevil force/creature was as difficult to comprehend as a 'horcrust'\nEddie Redmayne is usually believable but in this you could see his\nacting. The choreography of his mating dance with the large\nrhino-creature was a comedic misfire and just looked goofy. As for his\nfarewell scene, he's conveyed contrived awkwardness. But I really liked\nthis film. it was very entertaining, funny and moving, with beautiful\nCGI beasts. Alison Sudol and Dan Fogel showed hearts and souls of the\nmost delightful people in this tale.\n"},
{"review": "\nFor all the Harry Potter fans out there, Fantastic Beasts (and Where To\nFind Them) has nothing to do with Harry Potter (almost nothing) and\nthat is the best part of it! It does not try to overshadow Harry Potter\nseries nor does it try to compete with that, it's a different style of\nstorytelling, one that will take you on an adventure and keep you\nintrigued. This one has more human elements to it than being just all\nabout magic, and that's what I liked about it. It won't blow your mind\nbut will definitely make you care. For that reason (and of course it is\nJ K Rowling!), Harry Potter fan or not, you should go watch this one!\n:) :)\n"},
{"review": "\nWithout any spoilers, this review will be shorter than I would like,\nfor a film so delightful in its entirety. However, no spoilers here,\nsince I would never risk ruining the discovery for a new viewer, or\ncheating anyone out of the development of Newt's character, richly\nportrayed by Eddie Redmayne.<br><br>First off, the visuals in the movie are positively spectacular! Today I\nenjoyed some of the most realistic effects I have ever witnessed in a\nfilm, and the acting reflected this as well. The spells, the creatures,\nand the action are all delicious, and utterly believable on screen.<br><br>Even better than the visuals was the main character, Newt Scamander; he\nand the other leads complemented each other masterfully. Newt begins as\nan odd person, slightly out of place, and always watchful, as one might\nexpect any new wizard might appear, arriving in the USA from the UK in\n1926. Newt's concern for the creatures he studies is revealed in\nsmaller stages early on, but midway through the film we see his\npowerful understanding as he explains his chosen purpose in more\ndetail. I was moved and, again, delighted by the way he follows this,\nand Eddie Redmayne embodies this character with flair throughout the\nstory's evolution.<br><br>The other central characters were well revealed, though not all as\ndeeply as Newt's, but again, these are people for whom you will come to\ncare deeply by the end of this installment. I have heard that there are\nothers to follow this story, and yet it stands alone, beautifully told\nand well-contained without any background in the (later-set) Harry\nPotter universe. Ten out of ten stars!\n"},
{"review": "\nFantastic Beast and Where to Find Them in IMAX 3D is Fantastic times\n150. It has been the best movie I have seen all year long and there has\nbeen so many outstanding movies this year but this had great 3D great\nacting just a great movie the whole way through. I am not that person\nwho gets upset when a movie is over, but I was so upset when this movie\nwas over because it was that good if you have not seen this movie there\nis something wrong with you because this movie is one to watch it is a\nstandout masterpiece that needs to be whiteness.<br><br>Fantastic Beast is the spin off of the Harry Potter franchise and it\nmakes the Potter movies look like crap that is how Damn good Fantastic\nBeast is and if you saw it you then know what I am talking sbout\n"},
{"review": "\nThis film is the perfect expansion of the Harry Potter universe. Thanks\nto J.K. Rowling as the screenwriter and producer, and David Yates as\nthe director, we can enjoy a very dark, mature and humorous film. Eddie\nRedmayne appears to be a flawless actor that can play any role. The\nsoundtrack is very emotional and nostalgic: in fact we can notice an\ninspiration from the famous Hedwig's Theme from Harry Potter. Moreover,\nthe cinematography is fantastic and very detailed. The visual effects\nare stunning and perfect as well. There are a lot of connections\nbetween this film and the other films of Harry Potter, but you can\nenjoy the film even though you don't know Harry Potter (of course, if\nyou are a fan of it, you'll enjoy this spin-off/prequel much more than\nother people).\n"},
{"review": "\nWhen I read the title of this movie I thought: great! Finally; the\nJelly Fished themed family adventure we've all been waiting for.\nFantastic Beasts. Fan-tas-tic. Only one beast came to mind fitting that\ndescription and we all know who that is. The kids were up the walls\nwith excitement and they were heavily sedated by the time we hit the\ncinema. Little Jodie kept mumbling \"Jel... jell..fii..\" over and over\nagain. \"Soon!\" my wife and I said jokingly. We nearly thought we were\ngoing to have to dope her up again but she settled down thankfully.\nWell imagine our shock and disappointment when 20 minutes into this\nmovie we realized there weren't going to be ANY Jelly Fish in the movie\nlet alone in a lead role. I shoveled popcorn into my pockets and fled\nleaving my crumbling marriage in the cinema. I haven't seen any of them\nsince.\n"},
{"review": "\nFantastic Beasts and Where to Find Them suffers from a lack of story\ndevelopment and relies all too heavily on an overabundance of special\neffects. We spend an inordinate amount of time following our main\ncharacters chasing CGI creatures around and looking more like a Pokemon\ngame than actually delivering anything that's terribly interesting as\nfar as story development goes. The film looks great and the\nperformances are solid but it is so lacking in the aforementioned that\nI found it increasingly tedious as the film dragged on. If you're\ndazzled by movies heavy on creatures and effects and don't care if its\na bit light on story, you'll probably love this. But if you're looking\nfor something that's going to deliver a compelling story that decides\nto get interesting some time before three-quarters of the way through\nthe movie's two-hour running time, then you'll really need to look\nelsewhere. I give this five out of ten not because it's utterly\nterrible, it isn't, but it's just not interesting enough and I don't\nthink it warrants the high scores people are giving it. There are far\nbetter films that rate that high.\n"},
{"review": "\nI kept waiting to engage with either the characters or with one of the\nbeasts. Such an engagement was not forthcoming. I like Eddie Redmayne,\nso it is nothing to do with him. So much emphasis on creating this\nalternate world that the basics of filmmaking appear to have been\nsacrificed. Never does anyone look into you, the screen, and speak.\nThere is never any eye contact. You do not feel attached to Eddie's\ncharacter. Even my children were squirming in the seats and looking\naround bored. They wanted food and said they were hungry. The movie\ntherefore appears to fail both children and adults like me. My 12yo son\nwho is a mega Harry Potter fan could not engage with the movie. \"I like\nreading J K Rowling's books but I am not sure about this one\" is what\nhe said. What he means is that, after having watched the movie, it has\nput him off the book as well. <br><br>I got up to get food for the kids, they followed me and were more keen\non ice creams and sweets rather than getting back to the screen to what\nhappened next. So much for fantastic pointless beasts. If you liked\nHarry Potter then that is not a guarantee that you will like this one.\nThat is for sure. If you liked The Lord of Rings and sat through the\ntrilogy, then you may have what it takes to sit through this one.\nPerhaps looking at this as a movie nothing to do with Harry Potter\nmight help. If your children do not get attached to the movie then\ndon't be surprised.\n"},
{"review": "\nI saw \"Fantastic Beasts and Where to Find Them\", starring Eddie\nRedmayne-Jupiter Ascending, My Week With Marilyn; Dan Fogler-The\nGoldbergs_tv, Balls of Fury; Katherine Waterston-Steve Jobs, Taking\nWoodstock and Colin Farrell-Saving Mr. Banks-Crazy Heart.<br><br>This is the beginning of a 5 picture franchise that is a spin off of\nthe Harry Potter series-not a sequel or a prequel, but a spin off. It's\nwritten by J.K. Rowling and it is in the same Potterverse but it takes\nplace about 70 years earlier, in 1926. Eddie plays Newt Scamander, a\nperson of magic that is traveling to New York from Britain while\nresearching his book about magical creatures-FYI: His book is\nreferenced in the Harry Potter movies as being studied by students at\nHogwarts. Eddie is carrying a suitcase with some of these magical\ncreatures inside it but some get loose and draw the attention of the\nU.S. magical counsel. Katherine is sort of a rule enforcer for the\ncounsel that tries to keep the magical world and the human world\nseparate. Don't want the frail humans to panic, of course, so if a\nhuman sees something that they shouldn't, they are magically made to\nforget whatever they have seen. Oh yeah, in the Potter movies, humans\nwere called Muggles. Here, they use the term No-Mags, which is short\nfor No-Magic, referring to humans that don't have magical abilities.\nDan is a No-Mag that becomes friends with Eddie. Colin is a person of\nmagic that is on the counsel. The effects are fantastic and so are the\ncreatures and there is a big name star that makes a cameo near the end\nof the movie, as the villain. I was a fan of the Harry Potter movies so\nit is good to get into a version of them that has adults in it, instead\nof kids. It's rated \"PG- 13\" for fantasy action and violence and has a\nrunning time of 2 hours &amp; 13 minutes. If you liked the Harry Potter\nmovies, you should enjoy this one-and the 4 more in the works. I liked\nit and would buy it on Blu-Ray.\n"},
{"review": "\nWizard comes into muggle world and loses some of his magical and\nincredible animals which cause some problems. Start of the movie had a\ngreat deal of information on dark wizard Gellert that from the\nbeginning you are in expectation of him and it kind of triggers later\non. So now Newt is trying to figure out where are his beasts while\nbeing constantly followed by Tina and her paranoia about everything and\nJacob, a muggle that wants to open a bakery but accidentally found\nabout beasts. As movie goes it gets darker and a lot of characters get\nin the way and most interesting is Percival (Colin) that is a dark and\npowerful character which helped a lot to get a notion that he might be\nimportant. Last 20 minutes of the movie were absolutely amazing as Depp\ngot his on screen time and it was great to see him. Movie is sometimes\nvery slow paced and doesn't get an idea where it is going but then it\nsomehow gets there. Eddie as Newt is absolutely incredible as he proves\nhe is magnificent actor that deserves everything and in movie his love\ntowards beasts and kindness are huge. Colin as Percival is also\nbrilliant with not so much time on screen but when he gets there he\njust shines even brighter then everybody else. Most interesting movie\ncharacter is Jacob played by Fogler, it is entertaining, funny and\nbrings brightness to everything. Katherine's character Tina is very\nhard and sometimes it is incredible but sometimes feels like boring and\nyou just wish she wants there at all. Beasts are magnifying.\nEntertaining movie with some great and extremely funny situations but\nsometimes pacing isn't correct and flow of the movie seems sometimes\nmessed. 8.4/10\n"},
{"review": "\nI'm real sad to say it but this movie is a complete letdown.<br><br>The biggest problem of this movie is that the pacing is all wrong, the\nintroduction gets an absurd amount of screen time. The real story only\nstarts about halfway through the movie.<br><br>The epilogue also drags on way too long.<br><br>The main characters are mostly shallow and cliché. The acting is good\nbut the script just isn't up to par.<br><br>It just all seems so forced how the group of main characters gets\ntogether for their adventure. <br><br>It's such a shame. The setting is wonderful, the actors are wonderful\n(especially Colin Farrell), the special effects are beautiful,.... The\nscript just doesn't connect this into a good movie. <br><br>The climax feels way too rushed and short. The revelation at the end\nhas no emotional impact or impact on the story.<br><br>It just feels like they are holding out on a good story and sprinkling\nit over multiple movies and cramming them full of scenes that do not\nprogress the plot or character development in any way.<br><br>Sorry guys, wish I had better news.\n"},
{"review": "\nI went to this movie as, while I'm not a HP nerd, I did enjoy the first\nfew films and I like the story theme of looking after/capturing fantasy\ncreatures. However, I left the film disappointed.<br><br>The characters to me, especially Newt and Tina, who were both playing\nthe \"Shy awkward\" type and lacked any chemistry or audience appeal.\nThey were too inward, speaking to themselves rather than other\ncharacters, but at the same time they didn't have any mystery or\nintrigue.<br><br>The setting is also very mundane, the 1920s wasn't the most vibrant\ntime but even the magical realm was very plain with bad cgi.<br><br>Which leads me on to the monsters. I wish they'd gone with at least\nsome physical puppets. As a main part of the plot, the weightless\nsub-par rendering really let me down. Major suspects were the goblin\nclub dancer ( which gave me an Oblivion character vibe), the demiguise\nwith bad texturing and hair-physics and the Thunderbird, who looked\nhollow. <br><br>I will say the Obscurus did look interesting though, it was well\ndesigned as a faceless angry mass.<br><br>The crazy anti-magic cult felt like they were from another movie, and\nwithout the HP element, you could easily make a Carrie-esque horror.<br><br>The pacing is also slow at the beginning, you could easily walk in on\nthe animal-care scene and not miss much. <br><br>Overall, just a very mundane movie which is a pity for the HP franchise\nand fantasy films in general.\n"},
{"review": "\nSPOILERS HERE: I'm a \"young 73\", and saw this movie with a lady friend.\nI'm not sure what this film was, or who it's for. It's from a book by\nJ.K. Rowling, but it sure isn't Harry Potter, and it sure isn't for\nkids. There is a \"witchy\" young girl who walks around mouthing silly\nchants. There is a \"disturbed young man\" with a bad haircut, who is\napparently a child molester? There is an overlong noisy destruction of\na fantasy old New York City. There a two female characters whom I\ncouldn't tell apart, and Katherine Waterston's is one of them. Eddie\nRedmayne does a lot of looking up in wonderment, and there are plenty\nof people around with magical powers and wands. Colin Farrell's\ncharacter, \"Graves\" leaves us wondering whether he's good or bad. Same\nfor the female leader of the city. For me, the two brightest characters\nin the film were Dan Fogler's \"Kowalski\" and the woman who became his\ngirlfriend. I'm not sure who played her. But who is this movie for? It\nstarts very slowly, and though action builds, there are young\ncharacters in it that only grownups can understand, sort of. How very\nnice that massive destruction done to the city can be magically\nreconstructed. I won't be going to the sequel.\n"},
{"review": "\nI'm sorry but It's a complete disaster, bore and awkward.<br><br>It's a pity because I like Harry Potter at least 3,4 and more or less 2\nand 8 of the films series. <br><br>But maybe this fail is currently obvious, after 8 movies, without a\nbook backing it up, the magic ... It's gone.<br><br>--------------------------- Spoilers ----------------------------------<br><br>- The Beasts<br><br>There are \"10\" beasts in the movie only \"2\" are Harry Potter's style (\na kind of thief Anteater and something like a Plant) the other ones\nseems more like Avatar's or Pokemon's style.<br><br>- The Main Character<br><br>He is so shy and in moments too much awkward, that It's no a big\nproblem because if we remembered \"Harry\" isn't so much charismatic or\ninteresting either, but Hogwarts School, the forbidden forest, even the\nHagrid's Hut, ... you know \"The Magic World\", the Atmosphere and the\nSupporting Characters ... yes, they were. So.<br><br>- Supporting Characters<br><br>A Ron Weasley equivalent maybe but It's no that funny because he is\nolder and sometimes he seems too much ridiculous for his age.<br><br>A Hermione Granger equivalent no absolutely not. The bigger lost.<br><br>A Lord Voldemort equivalent It's a fat, with an eye in other color, old\nfreak Johnny Deep.<br><br>A Draco Malfoy equivalent He really have problems with his mind and\nwith his hairdresser.<br><br>The other ones are pretty bad to compare them.<br><br>- The World<br><br>Big mistake show the world inside of Newt Scamander's suitcase, why?,\nbecause It's badly done. <br><br>The place old New York City.<br><br>And there are more deficiencies, but a I really don't want to write\nthem.\n"},
{"review": "\nRedmayne needs to learn not to mumble into his chin, for Chrissake!\nEditor needs to learn not to push NOISE over actor's speech! Then, one\nMAY be able to follow the dialogue. I wish I had more to say but,\ntruly, the movie itself is OK, it's the incessant hunt for the\nRedmayne's trailing voice that drains the viewer. On top of that, it's\neither the editor or the cinema engineer that needs to learn how to\ncrank the light where it needs to be for a 3D experience. One or both\nforgot that and the movie, for me, was dull as if dipped into liquid\ndrab, washed out and dull. Definitely NOT what I planned to give my\nmoney for, including the previous complaint about the sound. Story is\non its own merit OK, but it had trouble staying desirable and\nentertaining after actors, lighting, editing took their toll.\n"},
{"review": "\nI wasn't sure what to expect from Fantastic Beasts and Where to Find\nThem. It smelt curiously of \"cash grab\" since the Harry Potter films\nmanaged to conclude themselves quite perfectly, all the more so\nconsidering Warner Brothers preemptively announced four sequels before\nthis film had reached theatres. The best compliment I can give it is\nthat it proved me wrong- Fantastic Beasts and Where to Find Them never\nfeels lazy, or cheap - it's a worthy adventure that will have all but\nthe most cynical revelling in the wonder of the Wizarding World. <br><br>The film is fast paced and constantly dishing out new surprises, in the\nform of beautifully rendered, inventive CGI \"beasts,\" and a number of\nhilarious, imaginative features of this magical world of New York that\nsuccessfully create the illusion of being in a different world. There\nare tons of minute little details that delight in the purest sense. The\nset of new faces are mostly agreeable, the most likable being Dan\nFogler, whose bumbling \"non - magi\" is a welcome addition. He elevates\nsometimes silly jokes with expert comedic timing and facial\nexpressions. Katherine Waterston is fine enough, as is her flirtatious\nsister. And what of star Eddie Redmayne? He is alternately charming and\nannoying. The character of Newt Scamander is one fully realised by\nRowling's script, yet Redmayne's Hugh Grant- esque, crouched delivery\nis at times grating. Nonetheless he wins you over in the end. I won't\nsay who the villains are, because that plays into the intrigue of the\nplot, but suffice to say villainous characters were decidedly underused\nfor my taste, and could've used far more development than the already\npacked script granted them. <br><br>In all, this film never quite touches the awe and great characters\nimbued within each Harry Potter film and book, but it offers many\ndelights nonetheless, and is definitely worth seeing, especially on a\nbig screen, where it looks positively beautiful.\n"},
{"review": "\nProbably the worst movie in all Harry Potter era. The story line was\nbasic, even boring. There was no magic, just a plain story, no soul.\nDialogue was poor and predictable. The rhythm of the movie was a bit\nbizarre, flat, without keeping suspense, so everything was a bit\nobvious. Images and beasts were too digital, you could start watching\nthe movie in the middle of it and you wouldn't know if it is Harry\nPotter or How to train your dragon. Beasts were like avatar style,\nthere was a lack of imagination and in some scenes the quality was not\nthe best. It was too long, I was almost fall sleeping at some point. I\nwas very disappointed, there were good actors on it.\n"},
{"review": "\nIt's 7:30 pm, we're finally here. It's happening. The theater is\ncompletely full, people are wearing Gryffindor scarves and round\nglasses. Then the lights go out, we can hear every heartbeat of the\nroom getting crazy. It is time. Welcome back to the Potter-Verse. Well,\nnot really...<br><br>*<br><br>Rotten Tomatoes gave a hundred percent fresh to Fantastic Beasts. Why ?\nCertainly because the script is easy enough for them to understand it.\nYou know ? Just like those MCU movies that they idolize.<br><br>This is not a bad movie, it's really not. But I think we have here the\nperfect example of the exact thing I hate these days : everything is\npredictable from the start to the end. Add to this the fact that I\ndidn't felt the HP magic. It was not here, it was completely different.\nI hope we'll get there in the second movie.<br><br>Is there any surprises ? No. Not if you are familiar with this type of\nproductions. I felt like everything is made to sell tickets and copies.<br><br>I had a great time tho. The cast did a perfect job, especially Ezra\n'The Flash' Miller, Redmayne, and Farell. And I'm super excited to see\nwhat's coming next.<br><br>ROY<br><br>PS : Again, I'm French, and... not that good in English. Sorry for the\nmistakes ! Have a great night.\n"},
{"review": "\nOK am I the only one who got really frustrated of this movie? I love\nHarry Potter series, I read all the books and I watched all the movies\nthe minute they were out there. But I was waiting more from Fantastic\nBeasts. Nice cast, nice characters, but where was all the scenario?\nWhat was the point of all this? What was the point of using a good\nactor like Jon Voight in that role? The only good thing about the movie\nwas Colin Farrel and his transformation which I have to admit was a\npretty nice revelation, but I got the feeling that the whole movie was\nan introduction to a new wannabe good trilogy. Maybe the next movie\nwill be great but this one, not even close. Nice colors, nice humor,\nnice feelings, but what was the point of the obscurus and Grindewald\nand the whole chase when everything ended like an ancient Greek tragedy\n(Deus ex machina)?! Until the end of the movie I could not learn or\nremember the name of the protagonist, because I did not care. I did not\ncare for anyone of the characters. Harry Potter made you live the story\nwith him, I only felt sad when they caught Grindewald, and that was not\nsupposed to happen. I am bored of all this new movies who try to\nexploit an old good franchise and a good story but they just don't go\nfurther (star wars VII). At least the star wars VII movie was a copy of\nthe first star wars movie.\n"},
{"review": "\nThis film is no ways a bad film, in my opinion, it was just \"OK\". The\nplot's good but it was forgettable for a Harry Potter spin-off.<br><br>I could not remember the characters' names, except for Kowalski and\nNewt.<br><br>I liked the setting and it's characters although I can't remember their\nnames even how hard I tried to remember them.<br><br>I thought the villain \"Graves\" or Grindelwald was clichéd and I didn't\nknow why he was the villain in the film. <br><br>The most clichéd moment was when Graves betrays Credence in the most\nvillainous way. It's when they arrive at a house where a family of 12\nwere killed to find Credence's sister when Graves verbally assaults him\nsaying he is \"unteachable\" winch causes Credence to go into a rage and\nGraves tries to apologize to him but Credence causes destruction in New\nYork City anyways.<br><br>And the worst thing about it was that Graves still tries to get\nCredence on his side again but fails miserably maybe Graves shouldn't\nhave done that at all if he wanted on his side again.<br><br>I also hated the ending when they use Newt's Thunderbird to wipe the\nmemories of New York City citizens in a rain fest shame really. I would\nreally want a war between the magical and un-magical.<br><br>Overall. Fantastic Beasts is an OK Harry Potter spin-off for fan\nservice.\n"},
{"review": "\nHave you ever wished you could erase an entire series, book, movie from\nyour mind? Just so that you could experience it for the first time all\nover again. Of course you have, but we never get that opportunity. With\nthis film we do get something pretty close though. I never thought I\nwould experience the Wizarding World for the first time again, and yet\nwith the release of this film, we do.<br><br>There are no spoilers here but I will tell you to look out closely for\nthe name of Jacob Kowalski's bakery's name when he is showing his plans\nat the bank. The initials JK for a man selling rolls has the potential\nfor a nod to the most important person associated with the franchise.<br><br>The question Warner Bros will have been asking themselves is - How do\nwe make more Harry Potter films without Harry Potter? <br><br>In the end they settled for new compelling characters, a new\nenvironment, new beasts! But underlying all this was the same\natmosphere from the earlier Harry Potter films. Light-hearted humour\nthat entertains, with serious scenes that remind you that even in the\nworld of magic and wonder, there is threat.<br><br>From eight fantastic Harry Potter films we have developed a good\nunderstanding of the British Wizarding World so where better to explore\nnext than America. From smaller changes such as using the term no- maj\nin place of muggle, and outrageous laws such as no marrying a 'no-\nmaj', it becomes clear that the US will be a very interesting location\nfor further Fantastic Beast Films. <br><br>The film features fantastic actors that play their roles perfectly and\nincredible CGI that really brings these fantastic beasts to life. If\nthis movie is any indicator of the future films associated with this\nworld then we are in for a real treat.\n"},
{"review": "\nI saw it in theater yesterday, and although it was not what I expected\nit to be, it was very pleasant surprise. Harry Potter without Harry\nPotter is great.<br><br>While Harry Potter franchise is focused on children in Britain magical\ncommunity and adults and the magic in the rest of the world is\nmentioned only in passing, Beasts takes us to America where things are\nset differently. Something terrorize the city and slightly clumsy\nmagical beasts lover, fired Auror and muggle who was incidentally\ninvolved in all the mess are trying to solve the mystery and prevent\nmagical world being exposed. And in the focus of the story there is\nmagical suitcase that's bigger from the inside, as if it originated\nfrom Doctor Who's Tardis and Terry Pratchett's Luggage combined.<br><br>Movie is fast, resourceful, very witty and entertaining. Cast is\nexcellent (Johnny Depp shows up only for a brief moment, but I hope\nthey'll give him more space in sequels), CGI is great and there's lots\nof it, and magical beasts are truly fantastic. You'll fall in love with\nthem for sure. Story doesn't have that epic feeling like Harry Potter\nhad, but it is epic fun for all ages.<br><br>8,5/10\n"},
{"review": "\nI admitted that I am never a Harry Potter fan. I grew up with the\nnovels and films, but I just never find them that much interesting.\nHowever, this brand new film in the same universe just simply put me in\nawe.<br><br>The visual effects in the film were glamorous. Every magical creature\nwas in such great detail as if they were real. Besides the appearance,\nthe creatures were put into great characteristic and emotions. Their\ninteraction with Newt was the highlight of the film.<br><br>This is a film that certainly worth to see in the cinema, and highly\nrecommend to see it in 3D!\n"}
]