[
{"review": "\nI'm struggling to understand how this got such good reviews. I usually\nrate the IMDb score as the gold standard but something has gone\nseriously wrong here. I did see the trailer, it was good and contained\nthe only laughs of the movie. The movie was truly the most tedious\nthing I have ever experienced. Why did it get such good reviews from\ncritics and such a high score on IMDb? User reviews here are spot on.\nNot a single good review. The reviewer above who mentioned he had sat\ndown to more entertaining bowel movements surpassed any joke in the\nfilm.<br><br>Something is very wrong here.\n"},
{"review": "\nI'm wondering if the infant in the film has fired her agent for landing\nher this gig.<br><br>I love bawdy humor. I actually love bad movies (\"The Thing With Two\nHeads\", for example) but this one misses on every count and I'm\nsupremely puzzled by the positive reviews along with alleged media\ncritics asking if this is the \"...funniest comedy of the year?\"<br><br>Really?<br><br>The basic concept was not a bad one -- partying frat boys next door to\na 30-something-couple-with-infant trying to retain their youthful\ncoolness -- that the couple never convinces you they had in the first\nplace.<br><br>As a former journalist who knows many useless small details, it grated\non me that the frat house operated so far outside of municipal\nregulations its existence would never have been allowed along with\nrickety plot gimmicks that derail the couple's efforts to uproot the\nfrat boys through official means.<br><br>The sexual humor was uncomfortably crude and unfunny rather than bawdy\n(i.e., the scene where a frat boy wins a fight using his erection) and\nthere is not the slightest success in creating the most threadbare aura\nof believability necessary for genuine comedy.<br><br>Those who made this film could have taken some lesson's from Chaucer's\nMiller's Tale on how to handle off-color sexual humor and scatology\nwith precision and good effect.<br><br>It seemed the writers thought up crude things and then\nreverse-engineered them into the script making it a collection of\nrather dumb gags disconnected from a discernible story arc.<br><br>My afternoon viewing of this film was interesting in that the entire\naudience was 60 or older and when the film ended the house was silent.\n"},
{"review": "\nAs I write this review, there are around 200 reviews posted. As far as\nI can tell, fewer than 10 of them rate this film at 7 stars or above,\nyet its average rating is slightly more than 7 stars. In fact, while\nthe vast majority of reviews on the first five pages give it only 1\nstar, the ratings summary says that only 1.2% of those rating it gave\nit just 1 star.<br><br>This is a long way of saying that it's now inescapable fact that\ntrolls, spoofers, and studio shills dominate the site. A system is only\nuseful until enough people figure out how to game it, and this is\n(sadly) now the case for this site.<br><br>On to the review: Neighbors had a big challenge to overcome with me, as\nI just don't normally find Seth R. and his \"Seth Pack\" to be very\nfunny. Unfortunately, this film fails on every level to provide either\nhumor or entertainment. It's a rare film that can depict all characters\nas totally unsympathetic and get away with it. After all, the viewer\nneeds to be able to identify with SOMEONE in a story or film, even if\nit's the third-party narrator. This movie has absolutely no sympathetic\ncharacters in it at all. It's the essence of comedic nihilism. I didn't\nlike any of the characters, none of them said anything that was vaguely\nfunny, and I didn't identify with any point of view expressed in the\nfilm. To make matters worse, the director relied solely on profanity\nand T&amp;A for shock value.<br><br>Totally worthless movie. Don't waste your time.\n"},
{"review": "\nIf you are looking for a great comedy movie,this film is certainly not\nfor you. It is an awful R-rated movie with sex and without comedy. It\nwill remind you of Jackass because you will see graphic nudity (sexual\nintercourse between a man and a woman,a man was forced to suck a\ndildo,people reveal their butts and throw fire works by means of their\nbutts). Honestly,I did not find this movie worth watching at\nall,because it lacks 90 % of comedy and it tries to tempt the audience\nto see it through cheesy and explicit sex. Take my advice and save your\nmoney and time and see a better movie. Do not believe the hyperbolic\nrating!. Neighbors(2014) is an awful sex movie that disguises as a\ncomedy movie.\n"},
{"review": "\nI didn't laugh once during the entire movie. The writing was lame and\nthe acting was horrible. The movie was probably geared to 16 year old\nboys. The cash I spent to watch this piece of crap would have been\nbetter used to wipe my rear. Conversations between the husband and wife\nwent like this; we're gonna do it ! Yes, let's do it ! Are you sure you\nwant to do it? Yes let's do it. OK I will do it to them. You go baby\nand do it to them. OK, here I go. I wanted to puke the writing was so\nbad. Seth should get some advice from a new agent because of the crap\nprojects he has been in lately. I can't think of a single redeeming\ncharacter or line during the entire movie.\n"},
{"review": "\nMy distaste for \"Neighbors\" has little to do with the overall poorness\nof its quality. What gets me is the film's basic opinion of what is, or\nshould be considered, funny - an opinion that disgusts and depresses\nme, and doesn't speak well of who we are as people. Seth Rogen (moping\naround without a hint of comic energy or skill) plays a loser who gets\ndrenched with a deluge of filthy butt gags. Now comes the depressing\npart: The movie (just like several Will Ferrel films) can't think of\nanything for the \"hero\" to do with himself except to hurt and humiliate\nthe people who interfere with with desire to get what he wants. And\nwe're supposed to LIKE it. We're supposed to be CHEERING for these\nbabyish acts of sadism. Cruelty and amorality CAN, in fact, be a source\nof humor (I consider \"Ruthless People\" one of the greatest comedies\never), and \"Neighbors\" does provide one character (an ego maniacal\nMe-generation yype) who's a fit target for the audience to enjoy a\nlittle slap-down. But this overall assumption that there's an inherent\njoy in seeing innocent people get injured or embarrassed (also\ncharacteristic of Adam Sandler movies) leaves me asking, \"What kind of\nworld am I living in? What's WRONG with people?\"\n"},
{"review": "\nI like comedies, and was looking forward to an experience in the same\nalley as the \"Hangover\"-movies. But \"Bad Neighbours\" was probably an\nall time low for me. This film probably sets a new record in using the\nwords sh*t, fu*k and d*ck. Together with other kinds of swearing.\nNormally swearing doesn't bother me at all, but this time it just gets\nboring. The whole movie is a repeat of itself. Parties and \"can you\nkeep it down, please?\" If that sounds fun, go ahead and watch it! What\nis the punchline? Is there really a punchline? I couldn't fine any.\nZach Efron is, as always, quite handsome and a quite talented actor.\nUnfortunately that doesn't help much. The storyline is too thin. A\ntotal waste of money for me.\n"},
{"review": "\nThe premise looks funny. The trailer is mildly amusing. The final\nproduct is lame. Unfortunately, the funniest parts are all in the\ntrailer, so after about 30 minutes it just felt like I was sitting\naround waiting for the next scene I had already seen in the preview.<br><br>Some of the scenes seemed like first takes. I felt like I was watching\nDVD extras. I highly doubt they had a completed script. It felt like\nthey were winging it half the time, which basically means Seth Rogen\nplaying Seth Rogen, which was old ten years ago.<br><br>Skip this and go find yourself a midnight screening of Revenge of the\nNerds.\n"},
{"review": "\nWhy can't IMDb offer 0 ratings? This movie was the worst comedy I had\nto sit through in 30 years! Comedy is supposed to be comedy not a damn\ndialogue non acting flick. Seth was horrible. He was blabbering about\nnothing the whole movie and his script I don't think there was one. Him\nand that annoying wife were worse than two 7 year olds talking about\ntonka toys. It's as if they were ad libbing the whole movie. <br><br>Director sucks. Writer sucks. Actors suck! none of these people\nbelonged in this movie. Not one person not even a drunk bleach blonde\nbimbo laughed 1 single time. I looked at my chick 40 mins in and said\nlet's get the f$&amp;k outta here and go to the bar. Zach sucked. The lines\nin this movie were so cheesy. The baby was stupid the sex scenes were\nappalling and the music was retarded. How anyone calls this a comedy is\nplain dumb. American pie makes this movie look like a kids horrible\ncartoon. Swearing doesn't make a comedy. I have nothing else to say and\nI just walked out of the theater. And trying to imitate dinero? Are u\nserious. Holy s#it what a corny movie. Not 1 person laughed. Not 1!\nTime to watch something funny on Netflix. Ps. Look at the first 35\nreviews. Almost all are 1's. How the heck is this at 7.2? Paid\nreviewers that belong in prison for scamming the public. Any typos I\nmad I didn't correct on purpose as I was done wasting my valuable time\nwith the cheesy @ss movie. Want comedy go watch George carlin on\nNetflix. Don't waste your $28 on this garbage.\n"},
{"review": "\nI'm not a prude. Far from it. BUT, I don't know ANYONE who feels the\nneed to drop the F-bomb, in every sentence, like they did in this\nmovie. Sometimes, more than once, in a sentence? Why? What is the\npoint? I'm friends with college kids, and they don't talk like that!\nSo, I don't really think it's an age thing. <br><br>And this couple has a small baby, that they leave at home alone? Just\ntaking a baby monitor with them, to check on the baby? What kind of\nparents are these? Basically, the mentality level here, is more\nelementary school, than college.<br><br>Okay, okay.... maybe I'm just in a different frame of mind. I only paid\n$5.00 to see the movie. They should have paid me to watch it.\n"},
{"review": "\nDear Seth,<br><br>I just watched your latest effort in the \"Neighbors\". Here are a few\ntips for you, your current and future directors, writers, producers and\nmovie execs, to help you to not make another movie that my somewhat\nintoxicated adult friends turn off less than half way through.<br><br>1. Saying \"F*ck\" in every sentence does not give you street cred, nor\nis it particularly humorous after about 5 seconds. 2. You are in crappy\nphysical shape. Quit having your writers put in sex scenes with you and\nthe obviously unattainable women you are cast with. The sexual\nchemistry between you and Rose Byrne was about as believable as the\nchemistry between a swan and a water buffalo. 3. Watching a nearly\nmiddle-aged man-child get f'd up on shrooms, pot, etc. is about as\nentertaining as watching a dog lick its b*lls. It is mildly\nentertaining for about 10 seconds, and then is simply disgusting and\nannoying. 4. You are NOT a modern Jimmy Stewart \"everyman\" character.\nYou are in fact the very antithesis of that. Overweight, pot smoking,\nvideo game playing D'bags that refuse to grow up have very little in\ncommon with folks that have to work for a living, raise a family and\nmuddle through. 5. You are a middling character actor that, through\nsome Faustian bargain, has become a quasi-leading man in romantic,\nraunchy comedies. Grow the F up, learn a little more range of emotion\nthan \"Holy F*ck Man\" and \"I'm so F*cked up\", and maybe you can keep you\nsoul (if you indeed ever had one).<br><br>Sincerely, Raynjuls\n"},
{"review": "\nThis movie is so bad,it is going to have you asking some pretty deep\nquestions about where humanity is heading at this time,and what is our\nfinal destination destined to be. Something needs to change,people need\nto wake up,this kind of disgusting vulgar sexual low life humor must\nnot turn out to be something our children,friends or anyone for that\nmatter should become accustomed to,because once that happens,human race\nis no more human,its a herd. This movie is not made to make you\nlaugh,its made to make you stupid. Spare yourself,don't watch this,it\ndoesn't deserve to be watched,give 5 bucks to some homeless\nperson,you'll feel a lot better.\n"},
{"review": "\nTrailer Movie {Definition}: Any motion picture, video or film whereby\nthe movie's funniest, scariest and/or most dramatic/action scene(s), is\nincluded, coupled w both plot &amp; overall-message in less than a 3:00\nminute 'trailer', rendering the actual full-length film a complete &amp;\nutter waste of time. There are hoards of bad 'trailer movies'; however,\n'Neighbors' is arguably the quintessential trailer movie of all time.\nIt's as though the creators of this flick, were attempting to force a\nsquare peg (e.g. a 2x4), into a round hole (a mouse's rectum). Perhaps\none day, rating movie-trailers will become as mainstream, as rating the\nactual movie itself..., and should that day ever arrive, this trailer\nwill well deserve a strong '8', because like a high-dollar Vegas call\ngirl, sipping on champagne at the Mirage, I ultimately paid for the\nnight's rental.\n"},
{"review": "\nI waited months until this flick came to the second-run theater and\nwent on discount day to see it for $1.00. But even at that, I felt it\nwas a sheer waste of my money and time. The movie was one-joke endless\ntake on a frat house moving next door to a married-with-child couple.\nThe jokes were sophomoric, boring, and grasping to be funny. Watching\nthe trailer just showcases the whole idea. Sitting there for 90+\nminutes to watch this repetitive magma of crude comedy does not bring\nlaughs. Add nudity, simulated sex, urinating, hazing, same-sex kissing,\ndildos,stale Seth Rogen shtick with his endless trying-to-be-so-cool\nand you have a feeble attempt of a movie with actors and extras vying\nto see who can be absolutely gross.Parents leaving a baby home alone\nall night to get wasted is sheer irresponsibility along with having\nsaid baby chew on a condom seems like some kinda crazy abuse. I\nwouldn't even buy the DVD to see the deleted scenes and gag reels which\nI am sure is more of the sick and rotten same.\n"},
{"review": "\nThis was supposed to be a comedy. Yet, I never laughed once. In fact\nafter 15 minutes I was ready to turn it off but I thought I'd save\nothers the 15 minutes and warn people off watching this. So I watched\nto the end. It was such dross that I now struggle to remember what\nhappened.<br><br>Instead of comedy it should have been categorized under embarrassed. I\nfelt embarrassment for the director, the writers and the actors most of\nall. The same embarrassment I felt when I watched \"The Internship\"(OMG\nwhat a terrible movie) .<br><br>The movie felt like something that you would see on YouTube. The acting\nwas terrible it was like a bunch of friends who decided to make a movie\nfor the laugh. I'm sure it made them laugh. It certainly won't make\nyou.\n"},
{"review": "\nI got tickets to see a preview of this film and being a fan of these\nguys took them up on the chance (well .. 15 minutes of it) i had to\nleave, it was just wrong! I dread to think what people will feel if\nTHEY pay to see this rubbish! The body suits that the actors wear are\nshockingly made, it's like this is a sketch for some TV series gone\nwrong! At 76 minutes too i imagine the film makers know this and have\nkept the running time to a minimum so as not to offend viewers even\nmore! Also the fact that Zac Efron is billed as one of the stars of\nthis film is such a laugh, he isn't even an actor and she appears\nbriefly in the film - hardly worthy of a credit!\n"},
{"review": "\nThis movie was by far one of the worst movies I've ever seen in my\nlife. It was a waste of time and money. If I could have rated it a\nzero, I would have done so. The friend that went to this movie with me\nfelt the same. We couldn't understand why it played as long as it did\nand had so many showings. It must have appealed to a particular age\ngroup? because one young man working at the theater didn't like it and\nanother working there did. We'll be careful in the future to avoid\nshows with these \"actors\", anticipating it may again be a waste of time\nand hard-earned cash. We can think up other ways to deplete our wallets\nand not feel ripped off.\n"},
{"review": "\nThis really has to be one of the all time turkeys I have ever had the\nmisfortune to sit through. It was seriously unfunny from the start to\nthe point I decided to regain my life by turning the drivel off (after\nabout 25 minutes). <br><br>I'm not sure if this is because American humour failed to cross the\nAtlantic or if it is simply a seriously crap film. Either way, if you\nfind this funny you are likely to male, under the age of 15, and\nprobably doing rather badly at school.<br><br>Many reviewers on this site must have seen a different film to the one\nI endured for 25 wasted minutes.\n"},
{"review": "\nI am not sure how this movie got 6.7 rating on IMDb. I was not\nexpecting much from Seth Rogen but some mediocre time pass. I started\nto watch this movie, the beginning was completely boring so I thought\nit might get better. I was really hoping that once the fraternity moves\nin then it might become somewhat interesting.....but all my hopes\ncrashed.... this movie is such a waste of time.... poor script, poor\nacting, mediocre direction........overall absolute disaster of a comedy\nmovie. I didn't even giggle during the whole movie.......I think some\nhorror movies have better funny scenes than bad neighbors........ Seth,\nplease change the name from BAD NEIGHBORS to BAD BAD MOVIE.....\n"},
{"review": "\nwww.tgchan.pl <br><br>20min of the movie and I am already getting that weird feeling... wtf\nis this sh*t and how come it has got 6.6 score !? So far it is so lame\nthat I want to slap myself across the face just for watching it... It\nis pathetic and painful to watch... After 50minutes I am still waiting\nto have a reason, even to grin... I would really love to say something\nmore about it but there is nothing worth mentioning!<br><br>Comedy and horror genre is not easy cookie to bite on, different\nthings/reasons cause a different people laugh or be scared. Don't be\nfooled though... this is not the issue here. The movie is so retarded\nand unfunny at the same time that I am seriously ashamed I have watched\nit for 1h before I have decided give up wasting a lot more time... It\ndelivers nothing and I seriously warn you to stay away from it! I don't\nmind stupid funny comedies or smart and unfunny ones, but this piece of\ngarbage is neither! It shouldn't have been even labeled as a comedy,\nthis is \"WASTE OF TIME\" genre...<br><br>tgchan's rating 1/10\n"},
{"review": "\nThis movie is an insult to the immature. Haven't we seen enough movies\nwith a nebbish, hairy Jew with a beautiful wife/love interest that\nnobody would believe would happen in real life? This movie made a lot\nof money but that is a testament to the marketing efforts and not the\nscript or direction. Zach Efron's body deserves a better vehicle. Total\nwaste of time and insulting on every level with the exception of the\nboy eye candy and a few tit shots that seemed creepy and not funny. And\nwho would leave a baby alone in a house while they partied all night?\nCrackheads? Forget thisone and move on. Zach and the Franco boy should\nhave made out to save this from the trash bin.\n"},
{"review": "\nSometimes I really wonder what is the rating criteria? For such an\nAWFUL movie, there should be a MINUS rating... something like -3! What\nis so special about a movie that is FULL of swearing, sex toys, bad\nfamily, addicted couples, etc...??? This is one of the movies that I\nregret spending that time to watch it. It is an insult to everything! I\nRARELY have such opinion about any movie, in general, but this one...\nreally pushed me off the edge! DO NOT waste your time watching it... go\nto the car wash... more beneficial! Seth Rogen and Rose Byrne... was\nthat acting??? Zac Efron... what did you tell yourself? Are you\nserious? Anyhow Seth, you did not do well in your career... so why you\nshould do something different now? a TOTAL loser!\n"},
{"review": "\nI didn't laugh ONCE during this. Not once, not even a snicker. It's\nwell made as in it looks good, some interesting direction especially in\nthe party scenes but there is just nothing else.<br><br>I kept waiting for something to happen. I can see how this would have\nbeen green lighted. Possibly sold on the synopsis alone \"hey I have\nthis great idea about a fraternity that moves next door to a married\ncouple with a kid\". Script is written in 3 weeks shopped around and\nsold.<br><br>It just goes nowhere! Fizzles out to a boring ending, no laughs, just\n90 mins of absolute fluff!\n"},
{"review": "\nI was left speechless at the amount this crap got regarding the votes.\nIt's clearly a studio effect rather than people actually watching this\nutter garbage.<br><br>The funniest part of the money was when it all actually ended and I\nlooked at my torn ticket and laughed at my luck in watching this crap.<br><br>To see Seth Rogen half naked in multiple parts was a nauseating feeling\nand awful idea by all concerned. <br><br>Seeing him grind on Rose Byrne was hideous and she can do way way\nbetter. Such a disgusting sight and I had to put down my Nachos and\ndiet soda after a while.<br><br>The scene with the kid almost swallowing a condom was disturbing and\nunnecessary and showed what this movie was all about.<br><br>Zac Efron seems to be going through a downward spiral and it's\ncontinued with this movie.<br><br>Not funny nor entertaining and Seth Rogen needs to stop \"acting\"\nbecause he's just an awful actor.<br><br>2/10.....1 vote for the idea and the other for the end credits.<br><br>Awful awful film.\n"},
{"review": "\nDo not give this one a try. You'll regret it. Acting and script is sub\npar. If you crack a giggle let me know and I'll reward you with a\ndiagnosis. Rogan and Byrnes did an awful job playing the disconnected\nolder couple and I really think Seth Rogan's career is taking a turn\nfor the worst. Some actors can turn a crappy script into a laugh fest\nand let me assure you this is not the case. I made it about 20 minutes\nin and furiously turned it off. If I were in a theater, I'd demand a\nrefund. I felt awkward and was seeking anything to get me into it. It\nfelt forced and poorly executed; these frat boys were not believable\nand I think the 9 month old baby was the best actor. A bad neighbor in\nreal life is better than this film.\n"},
{"review": "\nThis is an unfunny comedy with jokes that only miss the mark. If you\nlike any of these actors--don't see this movie. It will ruin your image\nof them. It's like catching your Dad having sex with his secretary.\nYou'll never respect him again. You'll just be glad when it's over.<br><br>The plot is nonsensical. The jokes are nonexistent. The actors are\nthere only to pickup a paycheck. The writers had nothing to offer. No\nstructure. No jokes. No care that the audience actually enjoy\nthemselves. I feel robbed and I only paid $1.62 at Redbox.<br><br>Don't watch this movie with a friend. Don't watch this movie with a\nspouse. Don't watch this movie alone. Don't watch this movie. <br><br>You're welcome.\n"},
{"review": "\nThis is my first review of a movie and possibly my last.<br><br>I haven't allot to say about this \"film\" only that I was looking for a\nlaugh and ended up disgusted and BORED.<br><br>I had high expectations that were just dismissed with in the first\n20mins.<br><br>How on earth did this movie get such a high rating!? I read over\nreviews to see if it was just me.. The latest reviews are SPOT ON but\nthe earlier ones just boggle the mind. Did they get paid to say those\nthings?<br><br>What an overrated P.O.S. and waste of time/money.\n"},
{"review": "\nI'm here to try to correct the blatantly incorrect rating of 6.8 stars\nwhich has to be some sort of hack of IMDb. <br><br>This movie was awful and that's sad because I really wanted to like it.\nI like Seth Rogen and Zach Effron but this just...sucked.<br><br>First off this should have been rated NC-17. It seemed every 5 minutes\nsomeone was having sex. The scenes are supposed to be humorous but it\nwas just awkward and unnecessary. I think the only part of the movie\nwhere I did laugh was the flash back part when they showed the guys\nfrom Workaholics as past members of the fraternity. Too bad that was\nonly 10 seconds of the whole movie. My boyfriend didn't laugh the\nentire time and actually fell asleep. I watched it all the way through\nhoping it would revive itself and instead it slowly withered and died.\nOther viewers are correct that the trailers showed the good parts so\nunless your watching it for free I wouldn't recommend it...even then I\nwould only under extreme duress. You've been warned.\n"},
{"review": "\nI'm with the other negative reviewers on here. From the previews this\nmovie seemed like a winner; 30's something couple trying to be\nresponsible has loud obnoxious fraternity move in next door and the war\nis on! I knew going in this movie it would have crude humor but\nseriously it went way over the top and I mean American Pie was super\ntame compared to this... This has to be hands down the most awful movie\nI've ever seen before. I'm going to save you the reading time because\nother people have shared what's up in it. I'm left wondering how a\nmovie this crass can be excepted in modern day society? Sure call me a\nprude but who in their right mind would think it's okay for a baby to\nstick a condom in their mouth? Please never watch this.\n"},
{"review": "\nHow could this dreadful movie possible have nearly 7 stars ! when\nreview after review after review is outlining just how bad the film is\nand rating it accordingly? this movie is completely unoriginal full of\nbadly wrote and executed toilet humor with the usual over rated actors\nplaying the roles they always play ... there are movies with less than\n1 tenth the budget that deserve half the publicity . anyway I've\nofficially lost all faith in the IMDb rating system , there are\nobviously corporate interests at play which outweigh the actual public\nopinion. what a surprise.. How could this dreadful movie possible have\nnearly 7 stars ! when review after review after review is outlining\njust how bad the film is and rating it accordingly? this movie is\ncompletely unoriginal full of badly wrote and executed toilet humor\nwith the usual over rated actors playing the roles they always play ...\nthere are movies with less than 1 tenth the budget that deserve half\nthe publicity . anyway I've officially lost all faith in the IMDb\nrating system , there are obviously corporate interests at play which\noutweigh the actual public opinion. what a surprise\n"},
{"review": "\nDisgusting.. Awful.. no more words... I just went to take my family and\nI could not finish to see the movie. Shame for Zac Efron, I don't know\nhow he accepted to participate in this garbage. I wasted my time and\nmoney.I you have some respect for yourself, you won't see that movie.\nThe baby was the best actor.I do not know why this movie is rated 7.6.\nI think that it is not true. Honestly, a good rating would be around 2.\nAnyway, I regret the moment when I decided to drive to the cinema spend\nmy money, I was like throwing my money to the sewer, because it is the\nplace where this move belongs. Almost every time that I go to see a\nmovie, I checked the reviews from users. In this case I did not check\nthe reviews, because I can see that many people has the same opinion\nthan me. I am posting this review hoping that someone can see these\nmany reviews and avoid the shame.\n"},
{"review": "\nI was in disbelief when I saw this movie garnered an average rating of\nnearly a 7. I have never provided any feedback regarding a movie, but\nthis movie was so bad, and the rating so unrealistic I had to write\nabout it. The movie uses every possible cliché, is completely\nunrealistic, and simply not funny. All of the truly funny scenes (what\nfew they were) are what you see in the trailer. I don't know how anyone\ncan truly rate this movie anything better than a 2 or 3, considering\nhow many truly other good movies there are in the world. Please head my\nadvice and the overwhelming advice from the majority of other reviewers\non this board and don't waste your money or time on this movie.\n"},
{"review": "\nI get the Idea of the movie about, *good parenting *fraternity's aren't\nuseful in education *true friendship *fixing couples relationship\n*regret always comes at end *being responsible etc. But those are\ndumped and covered by a lot of shitty scenes in the movie. Every good\nthing are lost because of crap scenes it the movie such example in\norder to be a good parent do they really need to do those nasty stuff\nwith frat-men?; its a bad thing to see a mother drunk, kiss &amp; flirt. I\nknow it's rated R but theirs some rated R movie that the themed and\nmoral always reign but in this movie I cant help its hard to recognized\nthose good scenes anymore because the movie was drowned by the goal of\nfrat leader to have great party to be putted in frame and so those\nneighbors retaliation began. The good idea of movie is lost in those\nneighbors fighting. And can America do a movie without using the word\n\"fuck\" too much? Too much shouting too, are those called acting?\n"},
{"review": "\nBad taste, bad humor, all about dicks and tits, farts and body fluids.\nI pity the actors having to put up with this junk. Why choose a\ndirector 5 years old? Everything below the belt is not necessarily\nfunny. In this movie it is consistently awkward and embarrassing.\nNoisily excited and bawdy the actors push the scenes to the grand\nfinale. If nothing else it proves that humor is not so easy. Neil\nSimon, Billy Wilder, Woody Allen, to name some of the best had/have\nreal talent. Timing, dialog, acting in unity. The theater I went to\ngenerated very few laughs, most of the audience in their twenties; at\nleast some hope for next generation. Very strenuous experience. Wish I\nhad stayed away.\n"},
{"review": "\nBad. Really really bad. The characters were utterly unpleasant to watch\nand seeing them made me feel uncomfortable and embarrassed. Not\nembarrassed because \"oh gosh! they said a dirty word!\" Embarrassed like\nwhen you get invited to watch a stand up routine by someone you know.\nOnly, they aren't funny and you wish you could laugh at something\nbecause the utter silence from the audience makes you want to run\nscreaming from the room.<br><br>The advantage of shock humor like in Something about Mary or Idiocracy\nis that it's funny even if done only passably well. This movie had a\nhuge amount of shock but nothing funny. The theater never really\nlaughed out loud except once or twice as thought they were trying\ndesperately to get into the movie. By half way through people were\ntalking to each other and no one shushed them.<br><br>Seth Rogen owes me 11 bucks and 97 minutes of my life.\n"},
{"review": "\nMovies fail for many reasons, and I can generally forgive most of them.\nWhat I can't forgive is when a studio the size of Universal throws 18\nmillion at an staggeringly inept, mostly empty trashcan like\n\"Neighbors.\" The film makers in this case are well aware of the dreck\nthey're producing. They simply don't care. No one older than a four\nyear old (or someone profoundly retarded) would mistake this swill for\nhumor.<br><br>I didn't expect much, of course. Who would? But I at least thought\nthere would be a coherent storyline or plot structure. Not that it's\nneeded if you have a bunch of ace improv'ers. But Rogan has never been\nin that league. He can be amusing on occasion but he tends to rise or\nfall with the quality of the film, director, and other actors he's\nsharing screen time with. Many times he's just the weakest link. There\nare points in \"Neighbors\" when the flat chemistry between Rogan and\nByrne threatens to deafen you even more than the soundtrack (which is\nactually quite good). Neither seems to know what to say next but,\nreally, what *does* one say after you're forced to spray breast milk\ninto the face of your co-thespian? The desperation here is\nexcruciatingly palpable.<br><br>And how about those mostly stellar mainstream media reviews? The Rotten\nTomato average is 73% with many huge outlets loving this piece of crap.\nIt just proves how much Universal obviously threw around promoting this\nwonderful flagship for their 100th anniversary. They should be so\nproud. One for the box set, I bet (sadly true - most of the films in\nmany of the big studio's 100th anniversary boxes this decade focus on\nsales over quality --- only exception taken if the film's a big Oscar\nwinner. Same dif!)<br><br>Universal's contempt for movie goers with brains is depressing. The\namount of \"1\" votes here at IMDb, though, is a breath of fresh air.\n"},
{"review": "\nTerrible movie, just like all other recent Hollywood \"comedy\" movies.<br><br>Look at all the recent comedy movies, they promote sex and drugs and\nespecially to youth, and they think its the normal thing to do.<br><br>For example the new movie called Sex Tape staring Cameron Diaz, that's\nLudicrous! Its all over Ads, on buses, subways everywhere, and kids see\nthis stuff.<br><br>Nothing out of Hollywood has good quality humor like back in the day\nwhen there were morals at play, Hollywood used to push out great movies\nand that actually teaches good values to everyone.<br><br>Now its all about drugs, incest and sex, if you don't believe me go and\nwatch a recent comedy movie, you will see yourself how evil they are.<br><br>Well its going to effect Hollywood and the people that run it, and you\nsee that in the world today with the whole Gaza Israel conflict.\n"},
{"review": "\nThis is my first review, because I do not like to waste my time this\nwas , but I think one should not waste his/her time watching this\nmovie.<br><br>Bad Neighbors is a bad movie, on the other thought it should not be\ncalled that but instead A Very-Very Bad Movie.<br><br>Avoid at all cost. Go outside for a walk. Lunch with your girlfriend.\nAttempts to pad the comment with junk words can result in your account\nbeing blocked from future submissions.<br><br>Bad Neighbors is a bad movie, on the other thought it should not be\ncalled that but instead A Very-Very Bad Movie.\n"},
{"review": "\nI feel compelled to write this review because it falls into that\nrarefied category of 'Terrible'. Few films i've watched have managed to\nachieve this dubious accolade. Bad neighbours can stand proudly in that\npantheon of utter dross.<br><br>This film just keeps delivering just when you expect it to improve it\ncontinues in the same formulaic vein, vacuous genital and drug humour\nproliferate like in most of Rogens work.If you had any growing\ndisenchantment with Rogen then watching this garbage will truly cement\nyour dislike of him. Its just the same old fecal matter.It is 90\nminutes of unforgiving sewage. Nobody comes out of this film unscathed,\nall who took part should bow their heads in shame.<br><br>As someone else has pointed out, the IMDb rating seems way off, i came\non the site expecting it to have received a generous 4.5, maybe 5 but\nfor it to get a 7 is just ridiculous, even Rogen fans would have to\nadmit to this being an extremely unfunny effort. I couldn't wait for\nthe end, i spent the first 20 minutes trying to like it, which is never\na good sign, but then, as it began to dawn on me that it wasn't going\nto improve but actually get worse, i just wanted it to all be over and\nif it wasn't for the company i was in i'd have gotten up and walked\nout.\n"},
{"review": "\nI laughed twice ... The airbags ... It has to be said that this guy\nreally has outstayed his welcome ... Its just all become so obvious and\nTIRED In this of course we get the cringe worthy ( in anything ) Zac\nEphron as an extra annoyance ... All this guy will ever be is teen girl\n( and some guys I suppose ... Though gord knows why ) masturbation\nfantasy ... He personally makes my skin crawl ... He and his cohort in\nthis both look as if they have been going out with plastic surgeons\nsince birth and it is not a good look ... And why is this man who is\nobviously in his 30s still in college anyway The whole thing is a waste\nof time ... Rogans wife has an on and off Australian accent ... The\nacting of course is fine for the soap that this is ... But its been\ndone to death Self important mediocre muck for middle class married\nnonentities Drop the Bomb\n"},
{"review": "\nTruly dreadful. <br><br>I confess my review is based on only perhaps the first 30 minutes. I\nlasted until Lisa Kudrow came into it, and then I really did want to\nthrow up. <br><br>However much I searched, with an open mind, for some redeeming spark in\nscript, actors, or direction with which to drive me to stick it out, I\nsimply couldn't. This is pure, unadulterated drivel.<br><br>During what would have been the back half of the movie had I not\nswitched off, I checked reviews on IMDb. I couldn't believe, page after\npage, that the 1/10 scores somehow added to a 7.0 total rating at the\nend. <br><br>As with the movie, I never got to the end of the reviews. I tallied 2-\n3/10 from the several pages I read. Its average ranking rates above\nmany of what one could call the seminal and decent movies you've seen\nover your viewing lifetime. Statistically, the remainder of the reviews\nmust rate this near god-like to raise the average rating to what it is. <br><br>To me, that stinks as much as the sloppy turd this movie is.\n"},
{"review": "\nI love Seth Rogan I think he is a great actor but this was the worst\nmovie he's been in! Rose Byrne performance was terrible! Zac Efron\nPlayed a spoiled frat boy which had its funny moments. in all i think\nthe movie might have slowed down Dave Franco's career. Franco is a\nyoung actor that did not pick a good movie to act in But he will get\nmore chances. I thought The Milking scene was too much for the movie It\nwas all in all a Gross scene.I mean who the Hell milks a Human Being. I\nalso thought the music selection was terrible! When i saw who was gunna\nact in the movie i thought it was gunna be fantastic.But Nicholas\nstoller should of directed it better.\n"},
{"review": "\nI made it through nearly an hour of this dreadful film before my\npopcorn ran out. My wife made it about half as long. The popcorn was\nvery good and had just the right amount of salt and butter. The film\nwas not as as good. Walking out of this one left me feeling liberated,\nfree. The time I saved was precious and could be put to more productive\nuses like having three much needed drinks before heading home. They\nwere needed to wash the taste of this one away. On a side note there\nactually was someone in the theater that was laughing continuously\nthroughout the lame antics. She sounded like she was about 12 years old\nand had somehow managed to sneak in after smoking a bit too much of\nsomething. Anyone older than 12 would be left baffled by this one. With\nthe amount of effort that had to be put in bribing critics the film\nmakers should have just tossed this film can and tried starting on\nsomething new.\n"},
{"review": "\nI've never seen a movie so uninspired, yet has a premise that's so rich\nwith potential and relatable humor. $18 million later, we got a lazy\nmovie with cheap comedy.<br><br>Thankfully I didn't pay to watch this garbage, but it did steal about\nan hour of my time before I eventually ignored it and started writing\nthis review. Actually it was a Redbox rental, about $0.99 overpriced.<br><br>I'm more of a horror, sci-fi, fantasy movie buff but every once in a\nwhile I indulge in a comedy. It's an interesting paradox though,\nbecause one whose cynical is often dismissed as missing the point of a\ncomedy and therefore there's no accountability for terrible, trashy\nfilms like this one which is the elephant in the room. I'm sorry, but\nthis movie is the manifestation of everything that's wrong with comedy\nand why I often shun the genre.<br><br>The sense of humor here is Half Baked (1998) meets the vulgarity of\nSouth Park; but without the clever satire or commentary of a social\nissue. Bad neighbors... yes, we've all had them, but none of us can\nrelate to how Mac and Kelly deal with them in the movie which makes it\nso boring.<br><br>Seth Rogen basically plays himself. Rose Byrne plays herself. They\ninject themselves into a series of SNL skits too risky for TV, and\nBOOM... there's your movie. It's completely outlandish, it misses the\nmark by a mile, and not one single moment of it is memorable. I forgot\nevery line uttered about as quickly as I heard them. If this movie\nspawns some sort of following, then I seriously fear for the future of\nart.\n"},
{"review": "\nI don't know why every new \"comedy\" needs to have sex language,<br><br>nudity and explicit sex scenes.<br><br>I don't remember when was last time I enjoyed in good comedy. Advice to\nall who wants to watch this movie: <br><br>If you are over 18 don't waste your time and money. <br><br>This is just another teenage movie without sense.<br><br>Scene when they try to f... in front of child?? Come on, its\ndisgusting.<br><br>Most of time I was wondering who is taking care of baby.<br><br>Too many plot holes, lame acting. And best actor was a baby.\n"},
{"review": "\nNeighbors is one of the most poorly written and executed comedies I've\nseen in a long time. The entire concept is terrible and they failed\ncompletely at coming up with even a plausible premise. No, this isn't\nscience fiction. You should not be required to throw reality out the\nwindow in order to enjoy it. Seth Rogen's typical charm is non-existent\nin this film and when Dave Franco gives maybe the movie's best\nperformance, you've got to question what you could've been doing during\nthose 90 minutes that wouldn't have been as painful. Bamboo shoots\nunderneath finger nails comes to mind.<br><br>That being said, there were two redeemable elements to the movie. The\nfirst is that Rose Byrne is absolutely gorgeous. She is stunning and\nshould be in more movies than she is. The second is that the fight\nscene in the end with Rogen and Zac Efron is hilarious. That's honestly\nthe only part in the entire film that was even remotely funny. In all\nhonesty though, those two things are not worth even bothering to watch\nthe film. Twiddle your thumbs instead... you're welcome.\n"},
{"review": "\nLame comedy, stupid humor... This in very short way describes my\nopinion about this movie. Everything in movie was so predictable.\nBeginning was even interesting, but after a 15 minutes of watching my\nwife fell asleep and I managed to watch it until the end. Idea for\nmovie wasn't so bad, but it wasn't done right. Acting is very poor. In\nsome moments I thought that director wasn't there during shooting. When\nI saw awards, nominations, rating on IMDb I expected much more. Didn't\nlike it at all, skip it. But, what can be expected after so many\nmovies. In these days it is almost impossible to find a good comedy.\nFor my first comment, enough. Bye\n"},
{"review": "\nThe film is terrible, relies on clichés to add humor. The film overall\nwas too disastrous to be even called a comedy, and there were too many\nadult scenes that they thought we'd find funny. All in all, I laughed 2\ntimes at some moderately funny one liners, but mostly I laughed just to\nmake it worth the £8 I paid. Please do not waste your money watching\nthis; the acting was OK, but the script was awful, and the film was\njust too over the top, and the jokes were not unique and were out of\ndate. The only good part was the end. The baby was cute though, and Zac\ndid have his top off though a lot of the film, but that made no\ndifference; the film was terrible, and Zac isn't even that hot to\nchange my opinion of the film.\n"},
{"review": "\nThis film is just awful. I love crude comedy type films, American pie\netc. This is just so unfunny and difficult to watch. This is the first\nfilm I have ever walked out half way through. The cinema was half full,\nit was deadly quiet no one laughing. <br><br>Don't waste your money, I read the user reviews on here and thought it\ncant be that bad, it is, trust me folks. The trailer portrays a\ndifferent type of film to what it actually is<br><br>The best part of the film was getting a refund, the lady at the counter\nsaid that lots had asked. <br><br>Normally Seth Rogan films are very good, I question whether I will see\nanother after this.\n"},
{"review": "\nThis is the result of a b u c h of rich j-e-w-s with influence in\nHollywood trying to make a comedy. And someone even gave them some crap\nprise for it too. As the 344 BAD REVIEWS before me say, don't waste\nyour money on this garbage. <br><br>I guess IMDb has a flawed rating system since all of those who saw the\nmovie and are not directly implicated in the film industry rated this\nwith a maxim 2 points out of 10. And the \"flaw\" is not entirely\ninnocent, since the paid version of IMDb actively promotes movies,\nactors, producers etc. I mean they get more money the more people go\nwatch Hollywood's crappy movies after seeing the trailers here...not to\nmention the so called rating system...<br><br>And remember not to ever watch a Seth Rogen movie ever again !\n"},
{"review": "\nA most distasteful, annoying and disgusting film that I have seen in a\nlong time.<br><br>A very immature couple prone to using profanity live with their newborn\nin a house only to have a fraternity move in next to them. Joining them\nso as to beat them regarding the noise doesn't work so the film becomes\ndevoted to each group doing nasty things to the other with complete\nmayhem resulting.<br><br>Where is the rest of the neighborhood in all this commotion? The dean\nof the college comes across as a perfect idiot with her 3 strike system\nand the police are also looked upon to being quite foolish here. <br><br>The film becomes so awful that it shows their baby swallowing a condom\nand that all this nonsense has a nasty effect on their marriage.\n"},
{"review": "\nNot sure I can add much that has not already been said in previous\nreviews. I rented this, and settled down with the wife expecting a\nmovie that would reflect the 73 score given to it by critics. What I\ngot was a film with maybe three laughs that you can see watching the\ntrailer, and the rest filled in by painfully unfunny trite.<br><br>Seth Rogen and Rose Byrne are a totally unconvincing young middle class\ncouple who have the misfortune of having a fraternity move in next to\nthem. What follows is a series of dumb skits (the \"plot\" is\nnon-existent here) that will leave you...well staring at the screen\nwaiting for the laughter to start. There is not a single believable\nmoment here. Most of the jokes fall flat, others take things too far\n(think cringe factor here), and others will just leave you rolling your\neyes thinking you are watching a Setzer/Friedman film. The characters\nactions here are so ridiculous and over the top that for a second I\nthought this was an Adam Sandler film. Rogen looks like he is at least\ntrying, but it is not nearly enough. Byrne checks out to the level\nwhere she does not even try and hide her accent. And Effron, who\nactually has some talent, looks completely lost. This does not work is\na normal comedy, it does not work as a dumb comedy, it does not work as\na bawdy comedy, it falls flat on every conceivable level. It is a\nshame, because there is talent here, and the film's premise is a\npromising one.<br><br>The director of this movie is Nick Stoller. His previous efforts\ninclude the actual funny films Forgetting Sarah Marshall and Get Him to\nthe Greek. I have no idea what went wrong on this film (well, the\nscript was probably the beginning, but alas), as both he and the actors\napparently gave up very early in production. Think of this film as the\nincestuous mutated cousin of a Judd Apatow film.\n"},
{"review": "\nThe best thing about this movie is that I did not pay to suffer through\nit. I am not a huge Seth Rogen fan, but he can be funny, sometimes.\nThis time he has struck out. Sadly and drudgingly, this story muddles\nthrough a dialogue which was so disjointed and choppy, it was\nimpossible to detect any semblance of a punchline. I understand\npotty-humor is popular with some people...just not with me. Maybe this\nstory might grow on me. I might see the humor in the gross abuses of\ndrugs and alcohol? Nah. I might enjoy the torture of trying to find the\ncomedy? Nah. I might even enjoy the horrible script? Nah. I have been\neducated. Comedy for some, means torture for others. I might take a\nbreak from Mr. Rogen for a spell\n"},
{"review": "\nAbsolutely not funny. Bad acting and a ridiculous story line. Who ever\nwrote this has zero talent for it. But the worst: It is not just\nproduct placement - it is a full Apple commercial. The movie is almost\na copy of \"Sex Tape\". Same dullness, constant use of sexually related\nlanguage and a plain Apple commercial. This seems to become a plague.\nAnd like in several other reviews I'm really wondering how such a movie\ncan ever get a rating above 2. Is Apple paying people to rate here so\nthey make more people view their 90 minute commercial? People should\nactually get money instead of having to pay when seeing this in a\ntheater. Don't watch this. Ever.\n"},
{"review": "\nIam amazed at these type of films showing USA collages students and\nstaff even portrayed as such childish disgusting utterly without any\nadult standards at 18+ these are the future of the USA, god help us\nreally!!! the whole film was extremely bad,all, seth rogan is a really\nbad example in the extreme, to say this is 'only a film' is wrong ! its\na world insight into the workings of American students there are no\ntimes that you can say this is a film to ''entertain'' all it does id\noffend and insult our intelligence the righting is to say poor is\nwrong,think they where all ablibing as NO ONE could sit and right this\nstory /? or am I wrong? iam afraid if this is the stuff that is going\nto be a view of USA film making thats the last American so called,\ncomedy, thats a laugh to say its a comedy! no more would send all who\nparticipated in this to the reductions section of USA. if there is one,\nand looking at this generally,its to late!<br><br>DO YOURSELF A FAVOR EVEN IT GIVEN THIS ON DVD Don't WASTE YOUR TIME\nWATCHING IT ITS NOT WORTH YOUR TIME!!!and you can always stay at home\nand be offended! don't pay for it!\n"},
{"review": "\nI have to review this, because the current rating and the title have\nmisled me. After twenty minutes I was just shocked and I started to go\nahead faster with the forward button, stopping here and there looking\nfor its redemption. But nothing, until the end. This is a completely\nbrainless (in its bad meaning, not relaxing) movie, seems made by some\nstupid adolescent to spectators I really hoped didn't even exist.\nDefine this as comedy is an offense to comedies, to compare it to\n\"animal house\" it is a sacrilege. Everything is annoying and forced,\nthe actors, not a single joke worthy of note, not a single scene.\nNothing, under any aspect, in this movie show a little mentality, it is\njust unintelligent and plain stupid. It was so bad that I removed from\n\"movie to see\" the others with Rogen as actor and Stoller as director. <br><br>I do really hope this will not be the way the human culture is going to\nlaugh and have fun. <br><br>And yes it is 1/10 without any exaggeration by me, and it is 1 just\nbecause I couldn't give it 0 or less.<br><br>Failed on all fronts. Just waste of time.\n"},
{"review": "\nThis movie was not funny. I barely laughed. What a joke this movie was.\nSeth Rogan makes awful movies most of the time. I waited a long time to\nsee this movie. The humour these days is made for retarded kids with\nabsolutely no intelligence. The ending was awful also. The humour in\nthis movie was very weak also. All i say is watch the movie Neighbors\nmovie from the 80's that one is way better then this one hands down.<br><br>This movie had some nudity in it. That is about it. just a garbage\nmovie overall with stupid concepts. I hope they don't make a sequel\nthat will be the stupidest thing they can possibly do. If they do I\nhope the movie will have lots of giraffes in it who drink beer from a\nstraw. That'd be interesting to see.\n"},
{"review": "\nYes, as you may have already read a hundred times, this film is\nabsolute boring FILTH. Also, you should be very aware by now that the\n\"good reviews\" and ratings for this movie are certainly bought and paid\nfor.<br><br>What blows my mind is that these types of films cost many millions of\nprecious dollars to make. If just ONE of these meaningless films would\nsimply cease to exist, a small country could likely be fed! It's truly\namazing that such a tiny group of people working within Hollywood have\nmillions in spare change to make this kind of garbage and then have the\naudacity to CHARGE people to be dumbed-down, brainwashed, and\nmentally/emotionally corrupted.<br><br>It's time to wake up....Supporting this mindless smut is to our\ndetriment.\n"},
{"review": "\nA strange one this, the groundswell opinion on internet forums by film\nfans of various ages is one of contempt, whilst on the professional\ncritical front reviews are more favourable, certainly on the plus side.\nBad Neighbours is neither a 1/10 or a 7 - 8 - 9/10 movie, it's sits\nsomewhere in the middle at averageville station still awaiting the\nsignal for go.<br><br>Trying to pitch together frat comedy and middle aged comedy worries is\na dangerous idea, more so when the entire film comes off as a sketch\nshow. Too many gags fall flat on their face here, the makers straining\ntoo hard to make something viable for a cross generational audience to\nlaugh at. It mostly feels like ad nauseum, like we have been here\nbefore, seen it before and worn the tight fitting t-shirt.<br><br>Rose Byrne and Seth Rogen deserve better than this, yet they are the\nonly ones keeping the picture watchable, where even as they are forced\nto fumble around with weak willed gross - cum - sex comedy sketches\n(improvised or otherwise), there's a pull from them that at least gives\noff a grounded reality vibe. There's also a couple of comedy gold\nmoments, of which do not need to be spoilt here.<br><br>So it's not a total loss per se, but its comedy longevity is sure to be\nbrief. 5/10\n"},
{"review": "\nI've long went off the Rogen/Franco trail with their urge to highlight\nthat drugs seem to be such a fun thing to enjoy and its okay to do, in\nevery movie they seem to poison. And yes, although James Franco is not\nin this, his cute younger brother with the annoying voice takes over...<br><br>I was bought this for Xmas and my husband wanted to watch it, even\nthough he hates Rogen, but more than likely because a roids built Zac\nEfron (complete with matchstick legs as most men in the US don't know\nabout leg workouts) was topless for most of the movie.<br><br>Yes we giggled ever so slightly in a few scenes, most of which are\ncontained in the trailer, but within ten minutes the drugs were\nintroduced and the bottom of the barrel vile had already been kicked\noff!<br><br>I long miss the classic humour of Mel Brooks, Gene Wilder, Steve Martin\netc who's movies all stood miles taller than the crap Rogen and team\nare forever giving us. They didn't need to rely on gross drug comedy to\nget a laugh because they knew how comedy worked. Something most of\ntoday's stars and directors in Hollywood don't have a clue how to do.<br><br>Bad Neighbors sucks. I guess its box office takings reveals how many\nbrainless people there are in the world who enjoy crap and for that\nreason we will no doubt be seeing more of the same from them soon\nenough...\n"},
{"review": "\nI gave this piece of junk a one because they don't have a zero. Rose\nByrne must have vomited in her mouth every time she came within three\nfeet of that walking cesspool Seth Rogan. If you saw the trailer you\nsaw the one funny moment in she movie and then they repeated that two\nmore times. Not funny. Poorly written. Loud annoying music.I foolishly\nspent 6 dollars and 100+ minutes of my life just because I stayed just\nso I could write a review based on seeing it to completion. Why Seth\nRogan even gets parts in movies is beyond me. Rogan's acting (if you\ncan call it that) is completely one note and he is disgusting to look\nat.Maybe bathing,shaving, a haircut and a career change would be the\nbest thing for him.\n"},
{"review": "\nCan I just say, by having Christopher Mintz-Plasse in your movie, will\ntake my interest if there is any. To a very dwindling mess of\ndisapproval and anger.<br><br>The movie opens up with new parents Mac (Rogen) and Kelly (Byrne)\ngetting it on vigorously or at least trying to while their baby is in\nhere baby walker watching on from mere feet away. A look into what\nparenthood may be like for us when we hit our early 30s.<br><br>Out of nowhere, as if brought in by the Gods of \"lets mess your life\nup\" wanted fun, Teddy (Efron) and Pete (Franco) move in next door with\ntheir College fraternity Delta Psi. A few nights after they move in Mac\nand Kelly go around to complain about the noise, however end up getting\nhigh as kits and drunk as skunks, during this night is probably the\nfunniest scene in the entire movie. When Mac and Teddy have a\nBatman-off, obviously Keaton vs Bale.<br><br>And obviously as movies go, their unlikely allegiance doesn't last, in\nfew scenes afterwards Mac and Kelly are complaining once again about\nthe noise to the cops. Setting off and almighty battling feud between\nboth households. Resulting in at one point Mac flooding their basement\nin order to try and draw them away.<br><br>I can't really say much more without ruining pranks and what are\nsupposed to be funny scenes, however for me all the funniest parts\nwhere given away in trailers with the exception being the Bat-off.<br><br>Overall, if you were to take the opinion of reviewers to heart, I would\npersonally say it's and OK watch. However wait for a friend to buy it\nor until it is on a streaming website like Netflix or Amazon. I will\nsay it is not the worst Comedy movie I have ever seen, just not as a\ngood as other Comedies. I will give Zac Efron the props he deserves\nthough, he has very much stepped out of the shadow cast upon him by his\nDisney days, he will have a bigger future in movies that I ever guessed\n"},
{"review": "\nSeriously? What happened to real comedy? Hollywood has become a haunt\nof jackals. Seriously, there's nothing left folks. Penises flapping in\nthe wind, sperm on people's faces, dildos, children being used sexually\nfor jokes...<br><br>It's the likes of Seth Rogen and his ilk that are destroying any\nremnant of morality left in the West. The peculiar part of all these\nkinds of filth movies...WHO is behind it, WHO promotes it, WHO PUSHES\nthis repulsive snot down everyone's throat? <br><br>Societies tend to grow and expand and experience golden ages or at\nleast build toward this half-remembered \"ideal\" of a\ngolden-age...however, when society becomes depraved and immorality is\nrampant, you know it's VERY near it's end. <br><br>Welcome to the end. Basically stupefying pornography here. Nothing\nmore. Yep. It's what \"they\" want for you and your children. You did\nnothing. You didn't even try. Welcome to the end of your civilization.\n"},
{"review": "\nI really don't know how this movie (if I may call it a movie), got 6,4\nin IMDb. It is certainly NOT funny, the plot is laughable and I just\nwanted to put my hands in my eyes and rip them off, during the entire\nmovie. This is definitely the worst movie in the history of cinema.\nDull, boring, uninteresting... simply, lame!<br><br>The movie could easily be like 25 to 30 minutes, if it was all about\nthe young couple and their baby. But then, there wouldn't be any movie,\nwould it? So, the director and the scriptwriter, decided to put a Frat\nhouse in it, just to spice things a bit. But, they really spiced up my\nnerves. <br><br>So bad I'm willing to sue the guys who made that movie... Not joking :)\n"},
{"review": "\nI've always read that it's hard to get a movie made in Hollywood,\nespecially these days, yet it somehow still manages to spew out sub par\ndreck like this on a consistent basis. This film actually made a lot of\nmoney which is another horrifying gauge of the cultural devolution of\nour society towards single celled life that will ultimately function\nwith no brain, apparently only having a mouth to eat &amp; eyes to watch\nflickering images of mediocre talents who have somehow been relegated\nto star status by accident or via satanic contracts. The premise of\nthis movie is simplistic enough and continues to remain unsalvaged by\nany further indication of creativity as it progresses and I use that\nterm in its chronological sense only. It's probably even dumber than\nthe half baked idea for a movie you wrote one afternoon on the\npartially used napkin you stuffed in your coat pocket after lunch\nexcept you had the good sense to realize later upon further reflection\nthat it was as tainted as the stain left by the remnant of the salad\ndressing adjoining it. I laughed one time in this movie although\ntechnically it was probably more of a chortle or a snigger rather than\na guffaw. Rogen's brilliant specialty appears to be jokes about naughty\nbody parts ( penises are emphasized in this flick with boobs placing a\ndistant second ) and pot. These concepts may in fact work if ever\ninjected with any actual humorous aspects but no such consideration\nremotely exists in this script. I gave it 2 stars because any movie\ngets one star for simply existing although I could be tempted give it 5\nstars if we could go back in time and delete it meaning that I wouldn't\nbe subjected to viewing it in the first place and that's a potentially\ncontradictory comedic premise that this crew could clog with dick and\nreefer jokes.\n"},
{"review": "\nThis was a disappointment. There were a few laughs but Seth Rogan has\ndone much better--Zach and Miri Make A Porno for example. I can't\nbelieve any parents would be as irresponsible as the leads were. What\nlocal police, or for that matter, what neighborhood, would tolerate all\nthe noise without complaint? <br><br>This could've and should've been done so much better. I don't usually\ngo for Seth rogan films and this is a good example why. Not very funny,\npoorly written. How this is rated 6.4 is beyond me. I'm glad I rented\nthis and wasted my money on the DVD or blu Ray. Or worse yet, I could\nhave wasted my money to see it in the theatre. Makes me think twice\nabout wanting to watch The Interview.\n"},
{"review": "\nIt is sad to see Rogen prostituting himself for money. I saw him in the\n2011 \"Take This Waltz\" in a non-comedic role and he was excellent. But\nmost of his roles are like the one here, sophomoric and dirty humor\nthat is only humorous to the younger crowd that likes dirty humor.<br><br>Here he is Mac Radner, an office worker, with wife Rose Byrne as Kelly\nRadner. They also have a small child, a girl not quite one year old.\nThey banter at home and it is usually sex talk, and it isn't funny at\nall. <br><br>As fate would have it, otherwise the name of the movie would be\ndifferent, their new \"neighbors\" are a fraternity house that likes to\nparty hard, loud, and late into the early morning hours. The president\nof that frat is Zac Efron as Teddy Sanders. Actually Efron is the only\npartially saving grace for this movie.<br><br>So the story is mostly about the neighbors battling the frat boys to\nrestore some peace and quiet in the neighborhood. Unless you are a kid\nwho relishes this kind of attempt at loud and dirty humor, most\nthinking adults will find their time totally wasted on this mess.\n"},
{"review": "\nI had the 'pleasure' of seeing this moving on HBO OnDemand; so on the\nplus side I didn't spend any additional money on this tripe. I should\nalso point out that I didn't make it real far into this movie (maybe\nthe first 30 minutes - I then looked for something else and ended up\nwatching the Escape Plan which was orders of magnitude better).<br><br>The good - the premise<br><br>The bad - dialog; the conversation between Rogen and his wife are\nHORRIBLE; I don't know anybody at any age that talks like that no\nmatter how high they are. <br><br>The Ugly - since I didn't bother seeing the whole movie I can't comment\non how ugly things get (just read other reviews and I'm sure you'll get\nthe gist of it) but can Seth R. not play any other character? Its\ngetting to the point where I feel the need to say \"WE GET IT SETH, YOU\nLIKE DRUGS; NOW MOVE ON AND PLAY A DIFFERENT CHARACTER\".<br><br>What a horrible movie - I've even slogged my way through crappy SYFY\nmovies waiting for a payoff, but I couldn't make it through this one. <br><br>In what was a staple of the movie I would like to say \"F**k you Seth\nand your stupid F*_@king moves\".\n"},
{"review": "\nI like stupid comedies, can watch them all day. You don't have to be\nintellectual to make me laugh. But you do have to have a well written\nstory and and a talented cast. Those two categories are where this film\nis terribly lacking. You have very little actual comedic talent working\nhere. Rogen is really phoning this one in, pretty sure they were paying\nhim in weed, and they were filming all of his parts after he came down\nfrom the high. The other problem is the screenplay was just awful. The\nguy knew nothing about fraternities or much of anything at all. Seemed\nlike a screenplay based on a screenplay based on a screenplay. And I\nlove raunchy, love it! But the so-called \"raunchy\" in this film is so\ntacked on, it appears that they added most of it after they watched the\ncut of this lousy film and said, ouch, this blows. And to close with\nthe awful scene of the two shirtless leads standing outside the\nAbercrombie, was there anybody laughing or not checking their watch at\nthis point?\n"},
{"review": "\nYour ability to enjoy Neighbors depends entirely on your definition of\na comedy. If you enjoy your comedies vulgar and crude, with plenty of\nsexual innuendos, condom gags and actual sex scenes, Neighbors will hit\nthe mark. However, if you desire more sophisticated comedy (such as,\nsay, the kind that was common in movies twenty, thirty years ago),\nNeighbors will fall far short of the goal. It has its moments of\nenjoyment (the finale, airbag scene and the Batman argument between Zac\nEfron and Seth Rogen were my favorites), but in between there will be\nscene after scene of condoms, nudity and other crude references. I did\nenjoy the performance of the frat brothers, but ultimately there is too\nmuch garbage here to sift through to get to the highlights.\n"},
{"review": "\nNeighbours was such a disgusting film. Whatever laughs were there were\nshown in the trailer... else nothing funny there is only disgust shown\nin the film.<br><br>The concept was a good one to show rivalry, but was poorly\nexecuted...except the air bag part... so funny that i gave a whole star\nto it(1+1)!!<br><br>I don't know how this movie is rated high above 6.... Users make your\nreviews worth, this film is super bad(oh.. another Seth rogen).<br><br>And Seth rogen stop making such stupid movies. Nudity is not the only\nway to make people laugh. Overall neighbors is stupid and I bet if you\nhave seen the trailer you won't utter a single laugh.\n"},
{"review": "\nI was really looking forward to this comedy after the great surprise of\nthis is the end plus to me Seth Rosen usually does no wrong in\ncomedies. However Seth Rogen didn't write this like he did this is the\nend meaning same actor but different written humor.<br><br>If you are a fan of Seth Rogens films like knocked up, Superbad, this\nis the end, etc. then don't expect Much this time. This is because it\nisn't written by him which means different brand of humor, I know I've\nstated that twice but that is because it is probably the main factor of\nwhy I didn't enjoy this film that much. <br><br>Another big thing I didn't like was how a lot of the jokes weren't well\nexecuted, a lot of the hilarious jokes from the trailer I expected\nwould be expanded in the film to a bigger joke, but the jokes in the\nmovie were not any different then when they were in the trailer (not\nall of them but a lot of them). A couple of parts gave me a decent\nlaugh but unfortunately those were rare and didn't make up for it.<br><br>The only group I would think would enjoy this are the likes of immature\nteens. I'm sure this film might interest some people to where they\nenjoy it but this one didn't deliver like it should of. Overall skip it\nand you wouldn't miss much if anything but watch it if you want and\nthen give your own opinion on this website.\n"},
{"review": "\nI (as most of the female population who has went to see this movie)\nwent because Zac Efron and Dave Franco were in it... I didn't mind\nseeing them shirtless, and didn't think the movie would be too bad. I\nwas completely wrong. The movie opens up with Seth Rogen doing the\nnasty with his wife IN FRONT OF A BABY. And seeing him naked is\nsomething I sadly will never get out of my mind. The movie showed\nwaaayyyy too many private areas, and was a disgrace to the movie\nindustry. This film was poorly directed and written, and had only 3\ntruly funny parts in it (which were already shown in previews). The\nmovie shows neglectful parents leaving their baby alone in their house\nwhile they went to party and try to start war with frat boys. About 70%\nof the movie is nudity, and the other 30% is taken up by drug use, sex,\nfoul language, and down right DISGUSTING details. Might I add, they\nshowed the baby eating a condom. I sound like a total parent here, but\nI'm just stating the truth. I LOVE movies like 21 jumpstreet, we're the\nmillers, etc. But this film took things WAY too far, and I just felt\nvery uncomfortable 99% of the movie. If I wanted fat hairy porn, I'd be\nonline for that. I went to see this movie to laugh, and ended up\nwanting to vomit.\n"},
{"review": "\nWhen I first started watching this I thought like Knocked Up it may get\nfunnier as it went along. Then I realised this is probably what the\nsequel to Knocked Up would be if you took all the good bits out and put\na fraternity next door.<br><br>When it wasn't poorly executed dick jokes it was the main characters\nmugging it up and overacting. Rose Byrne is an okay actress but this\nwas terrible (actually she was also in a film I walked out of it was so\nbad, really never go and see I give it a year!).<br><br>In fact the whole script pretty much stank.<br><br>We decided as a group of females that if Zac Efron hadn't spent have\nthe movie with his shirt off that we would have left.\n"},
{"review": "\nWhat an incredibly poor movie. Yet it grossed a vast amount and the\nratings here are high. Just shows, once again, easy to fool the masses.<br><br>This picture is meant be a \"comedy\", but the script seems to be made up\nas it goes along and written by pre teens. I found nothing that was\nfunny and the makers decided best to try to get cheap laughs from a big\ndose of crudity.<br><br>All the players in the movie are very unattractive especially the lead\ncouple who come across as selfish and stupid. Its their 'war' with a\nbunch of \"frat\" student neighbors which is the main story.<br><br>But of course in keeping with the type of movie this is, the film\nmakers want to glamorise the likes of drug taking and drunkenness et\nal.<br><br>This film sums up much of what is wrong with America.<br><br>No wonder the USA is in such a mess.<br><br>1/10.\n"},
{"review": "\nA few years ago I saw knocked up and thought it was a terrible movie,\nall puerile jokes, swearing and no real plot to speak of. I should have\nheeded my own words... Having also seen him in the Green Hornet (which\nwas pretty terrible all round, so I can't pin that entirely on him) I\nshould have realised that Seth Rogen + movie = turkey. However the\npreview of this didn't look too bad. Having sat through the entire\nmovie willing it to get funnier/less puerile/find a plot it seems that\nthe preview did in fact contain the only funny part of the whole movie.\nThis is perhaps the second worst film I have ever seen (nothing will\never beat The Brothers Grimm). Can't think of anything funny? I know -\nlets swear some more. Eventually you wonder whether this film is\nactually in English or some juvenile language that only moronic actors\nspeak. I felt for the poor baby in this film - she may be permanently\nscarred by this terrible film.... Avoid!!!\n"},
{"review": "\nThe trailers for this movie were awesome and I looked forward to seeing\nthis film for months. It wasn't funny. The cop scene where the cop\ncomes over to ask if they called and then he says we have caller id\neveryone does and then says don't call again. How is that funny? The\nthings they tried to make funny were ridiculous and so far fetched that\nit was just boring. I caught myself drifting off to sleep several times\nand then wishing it was over already. The best part of the movie was\nwhen the frat house had a Robert De Niro party. I was hoping the rest\nof the movie would be that awesome but no it was just stupid but even\nthen stupid can be really funny but this was just a huge waste of time\nand money. I don't understand the rating this movie received when there\nare so many bad reviews just like mine. How can that be accurate? This\nwas a bad movie! Save your money watch the trailer which also contains\nscenes that were not in the movie, kinda like a bait and switch.\n"},
{"review": "\nI thought it would be a good movie reading the plot but I was wrong. I\ncan only guess a very young audience is targeted. Teenagers would be my\nguess. I like raunchy comedy but not stupid lame raunchy comedy. I am\namazed that anyone would find this funny. I laughed twice but mostly\nwas amazed that anyone would produce this loser movie. If you are an\nimmature 18 year old then go for it. Asinine. Boring. Not funny. Why in\nthe world do I need to take 10 lines to review this movie. It's not as\nif it has a deep plot that I can discuss. Actually, the plot is dumb.\nIt could have been a good movie if not so ridiculous. Who wrote this\nfilm? They should find another job. Don't pay any money to see this.\nMaybe drinking a beer or two beforehand would help but doubt it.\n"},
{"review": "\nI had 1 laugh in this entire movie, and it was when they showed a scene\nfrom \"the office US\", everything else was just painstakingly humorless.\nIt was vulgar, dumb and boring. Do not watch. Seth Rogan did his thing\nagain, where he propagates drug use for no reason what so ever. It's\nthe only thing that distinguishes his characters in movies. He's always\nthe vulgar, lazy drug using average Joe. Not funny, not cool, not sad,\nnot dramatic, not relevant. His last funny scene is years in the past.<br><br>The rest of the film is just as irrelevant. The comedy is absent, but\nthe writing is deplorable. The dialogs truly are dramatic. The best\nactor in the movie was the baby, who looked cute. Everyone else was\nlost. <br><br>If you have a copy of this movie, destroy it.\n"},
{"review": "\nSo the movie goes like this, a married couple with a baby have their\nlives turned upside down when a college fraternity movie in next door.\nWell, the movie supposed to be funny. But to be honest, I didn't laugh\nat all while watching it. Maybe during the fighting scene, but that's\nit. Too many sexual jokes, again not even funny, too many sexual\nimitations and too many parties. At some points the film did try to get\na deeper grasp of the characters, but failed to carry that through. I\nguess Dave Franco and Rose Byrne were good enough, Seth Rogen was his\nwell known self and Zack Efron was just cruising by, being hot and all,\ntrying to get back his high school musical moments. And it is a same,\nbecause he can do much better than that. Now I think I saw somewhere\nthat they are making a sequel, which is a really terrible idea, as I\ndon't think there is much more to the story that wasn't covered or even\nworth being repeated. So, 2 out of 10 and pretty sure that I am not\nwatching number two.\n"},
{"review": "\nI watched the movie based on other reviews. IMDb requires ten lines of\ntext so here goes: The chemistry between the main cast was flat. I\nshould have realized the plot line was not substantial enough to make a\nmovie. But I opted to watch the film because of the IMDb ratings and\nthe fact that I've always enjoyed films in the past with members of\nthis cast. This movie was seriously tedious to watch and without merit.\n\\So disappointing all in all - thankfully I did not pay to see this\nmovie in the theater. Full disclosure I did not watch the entire film\nand opted not to waste more time after about half of the film. Again, I\nwas sorry to have wasted my time on this film I will also not put much\nstock in IMDb ratings in the future. Very disappointed in the film\nbased on the ratings of users. I watched the Way way back earlier this\nweek and that was a much better film. Sorry to ramble, this 10 lines of\ntext requirement is going to result in this\n"},
{"review": "\nMindless, stupid trashy junk. But even mindless, stupid trashy junk has\na place in the world.<br><br>I personally found it boring. I think it works better if you are either\nunder 20 or at least slightly gassed. In either of those situations you\nwon't really care that you have just lost 2 hours of life you can't get\nback.<br><br>It's basically Spring Breakers moving in next door to the young\nmarrieds. You can imagine the many very predictable scenes and dialog\nthat come out of that. Beer, parties, condoms, etc. One note. Please do\nnot bash me as I speak now as an overweight out of shape man myself. I\nam begging Seth Rogen to keep his cloths on. Just stay dressed Seth.\nYou are not the \"type\" who should--ever--be nude on screen much less be\non top of Rose Byrne. (Whom I assume, was paid handsomely to do these\nscenes with Rogen. It must have been a burden for her. It was certainly\na burden to watch. What makes every actor these days think we want to\nsee them in these positions?) Nothing better to do? Go for it. It'd\nrather have 2 hours with a good book.\n"},
{"review": "\nThis Is The End was a good dark comedy. And when I heard Rogen was\ndoing another one like it, I thought, \"This is awesome\" I heard the\ntrailer was good and when I finally rented it, I watched it first\nthing.<br><br>And here's where the review goes downhill.<br><br>A majority of the comedy in this film was too immature. No surprise,\nbut in This Is The End, it was funny because that wasn't the entire\nfilm. I think if you have to be THAT immature to be \"funny\" then you\naren't very funny.<br><br>This movie is so damn boring and not funny. I laughed because something\nfunny happened twice. I laughed about ten thousand times at how stupid\nthis movie is.<br><br>There isn't much else to say about this movie, because it's a comedy,\nand not some Transformers or Marvel movie. It's terrible. But watch\nthis if you want to see some stupid crap. Just don't say I didn't warn\nyou.\n"},
{"review": "\nI thought that this would be bawdy fun. With talented and popular\ncomedic actors like Seth Rogan, Zac Efron, Rose Byrne, and Dave Franco,\nit could have been a raunchy but likable comedy. No such luck. The\nfault lies not with the lead actors, who do what they can, but with the\nscreenplay. In fact, if it weren't for the leads, this film would\ndeserve a negative rating. The film's ideas of humor are just\ndisgusting. I don't mean that it's dirty or raunchy in a funny way,\neither. Raunchy humor has its place if its done with wit and talent.\nBut not here. There are lines and gags which are so gross, they would\nembarrass as sex-starved 13 year-old. The condom swallowing scene is\namong the most offensive of any film this year or even decade. The\nbreast milk clogging scene deserves dishonorable mention, as well. Seth\nRogan delivers his lines very well, but he should be banned from ever\ndoing a nude scene. Zac Efron can give a good performance, but here his\nshirtless torso does most of the acting. Rose Byrne is likable and\nlooks nice topless, but her talent and breasts are wasted in this\nrotten movie. Were there actually people who enjoyed this? The fact\nthat this film made money is very disturbing to me.\n"},
{"review": "\nAll I can say is thank God for the library. But even a free viewing of\nthis movie can't relate just how bad it is. Even the previews are all\ndirect to DVD films, which gives you an idea of what the studio thinks\nof it.<br><br>There's not much to say that hasn't already been said by other\nreviewers. All I can say is don't believe the 6.4 rating this film\ncurrently has. It's easily one of the worst films I have ever been\nunfortunate enough to have watched. I chuckled once during one of the\nair bag scenes, but that was it.<br><br>Watch it if you must, but don't say you haven't been warned.\n"},
{"review": "\nBy far one of the worst movies I've ever seen.<br><br>I love all types of movies, I do have favorite actors and directors and\nsome I don't like as much but it never usually holds me back from\nwatching a movie. While I didn't pick this movie, I did sit down and\nwatch it. How I got through it I cannot tell you. <br><br>For all the recent information of torture coming out, the government\ncan re-write the script and instead of water boarding potential\nterrorists, just have them watch The Neighbors. <br><br>I don't understand how the ratings are so high for a movie like this,\nbut to each his own. This one will go down in the history books as one\nof the bad ones.\n"},
{"review": "\nLike most comedies these days, most of the funny parts were given away\nin the trailer. Unlike some of the wet blankets posting comments about\nthis movie, I did actually get a couple of laughs from this one. I\nliked Rose Byrne and her character. I was not very familiar with her. I\nsaw Bridesmaids, but Ms. Byrne did not register with me for some\nreason. Seth Rogen can deadpan these lines okay. Yes, much of the humor\nis smutty or scatological, which is largely not my cup of tea, but what\nelse can one expect these days, particularly from a mass market\nvehicle? I cannot really recommend this film, but it is, I guess, okay.\nI have definitely seen worse.\n"},
{"review": "\nIndescribably unfunny. Not even funny on a sophomoric level. On a side\nnote, I think by now we all know Seth Rogen really likes pot. Can we\nmove on? I really can't comprehend some of these positive ratings. I\nkept waiting and waiting and waiting for a laugh, it never came. At\nsome point, despite all the activity and action on the screen, it was\nquite boring. Debauchery usually has comedic moments, not in this\nmovie. It's like the movie is trying really hard, but it just isn't\nfunny. I can't say it enough, this movie is really, really, really bad.\nThe highlight was when it ended. I could compare it with other movies,\nbut that would be a disservice to pretty much every bad movie. Yes, I\ndidn't like the movie, but what was more amazing was how unfunny a\ncomedy could be.\n"},
{"review": "\nNo Spoilers here because I couldn't finish watching it. 30 minutes was\nall I could handle. It was an awful, non-funny movie. And thank God for\nRedbox. I only wasted $1.27 to rent this cinematic Hindenburg. There's\nnothing worse than blowing money for tickets, popcorn and soda and then\nleaving the theater after seeing a horrible movie. I think any positive\nreviews written here are probably written by either die hard Seth Rogen\nfans, or by the movie production company themselves. The 30 minutes I\nwatched just seemed to be a constant back and forth banter between\nRogen and whoever played the wife with the at times, hard to understand\nAustralian accent. So I gave it a \"3\" and that was generous because I\ndid take into account that maybe I'm losing my sense of humor as I get\nolder?\n"},
{"review": "\nHorrible, Bad, awful. Why was this movie made ? To show everyone that\nSeth Rogen is a politically correct boot lick and nothing more. I\nreally tried to find something funny in this movie . There where a few\nminor chuckles but that is where it ends. I gave this movie a 3 and I\nam being kind.What amazes me even more than this move being made, is\nthe clearly rigged score it has on IMDb. Seth Rogen is a very one\ndimensional actor &gt;The script ? Boring,lacking ,oddly paced I could go\non and on about how this movie missed it's mark but to be honest,Why\nbother. If you like mediocre comedy and watching a fat hairy backed\nSeth Rogen try to have sex , then this movie is for you. Everyone else\nplease do yourself a huge favor and avoid this movie like the plague.\n"},
{"review": "\nWriting a review for this movie seems stupid to me since it's not\nintended to be high-brow filmmaking or comedy. Yes, it's unoriginal.\nYes, it's unfunny. Yes, it's totally unrealistic. It appeals to a\ncertain type of movie audience that's out there. It will make the\nstudio some money, then fade into obscurity.<br><br>That said, it's not a 1-star movie. The acting has some charm to it,\nand the movie isn't the worst I've ever seen. I made it to the end-\nthat alone bumps it from 1 star. <br><br>So to repeat- If you need a dumb 90 minute experience, this movie will\nsuffice. Turn off your brain, giggle at stoner humor, go to bed. If\nyou're looking for anything more, the problem isn't the movie, but\nrather with you.\n"},
{"review": "\nZac Efron's relentless drive to get away from his Disney image took a\nquantum leap with this ode to Animal House film Neighbors. I'm not sure\nhe'll like the direction. <br><br>Neighbors is a witless and rather gross comedy about a married couple\nwith their baby who have the misfortune to have a fraternity headed by\nEfron and his best friend Dave Franco. Seth Rogen and Rose Byrne play\nthe couple and they for reasons I haven't figured out yet want to be\nseen as hip and cool to the frat boys. But when after one of their\nparties gets way out of hand war gets declared.<br><br>Animal House wasn't all that much better, but at least it never\npretended to be anything but what it was. I can't say that for\nNeighbors. I feel bad for Efron who gave such a great performance in\nCharlie St. Cloud.<br><br>Sights of Efron and the other hunky lads in various states of undress\nshould titillate the audience of teen girls and gay men. Efron really\nbulked up for the role.<br><br>I hope something better comes along for you Zac.\n"},
{"review": "\nMy congratulations to the producers of \"Neighbors\". You may not have\nmade much of a movie but you came up with a great marketing campaign,\none that persuaded me that I might actually have a good time watching\nthis picture. Instead I wound up wasting my time sitting through\nsomething that most definitely was not funny. Actually, the funniest\nthing that happened during the movie is that the popcorn machine in the\nconcession stand at the theater I was at (Franklin Square, NY)\nmalfunctioned and starting burning the popcorn, which set the fire\nalarm off and stopped the picture dead for 20 minutes (no, I am not\nmaking this up). This happened 10 minutes into the picture and little\ndid I know at the time that it was a reprieve rather than an\ninterruption. I give it a rating of 3 for the 3 laughs I had during the\ncourse of the movie. 3 laughs for 90+ minutes was not a fair exchange\nfor the ticket price. A must to avoid.\n"},
{"review": "\nIt's taken me almost a fortnight to get around to writing this review.\nThat tells you pretty much everything about Bad Neighbours (or\nNeighbors if you're in the USA).<br><br>The 'selling point' that it's a brash comedy \"From the guys who brought\nyou This is the End\" was enough to put me off from the outset. Then I\nsaw the trailer, laughed out loud and chided myself for judging Bad\nNeighbours prematurely.<br><br>The trouble is, both funny moments are in the trailer and they're just\nnot funny second time around.<br><br>I'm well aware that Bad Neighbours' target demographic is late teens to\nlate twenties and I was fortunate to find the perfect audience to watch\nMac (Seth Rogan) and Kelly (Rose Byrne) romp about with hilarity in\ntheir neighbourhood warfare with Teddy (Zac Effron) and his fraternity\nwhen they move in next door. However, guess how many laughs I heard\nfrom the audience? I could hold up five fingers and have a handful of\nchange.<br><br>It stinks. It is severely over-egged, lacks restraint, completely\nmisses the delicate art of comedy and eschews the rule 'leave them\nwanting more.' Bad Neighbours doesn't know when to stop and probably\nshouldn't have started in the first place.<br><br>There are some comedic gems that are visually set up and then pummeled\nuntil absolutely every dim-witted drunk in the audience 'gets' it. Sex\nwith topiary? Yep, we'll keep on humping that sculpted bush until\nsubtlety becomes a distant dream.<br><br>Bad Neighbours is (yet again) another great idea for a work of comedic\nart that is hammered rather than sculpted. Director Nicholas Stoller\n(The Five-Year Engagement) has forgotten to rein in his actors and\nattempted to wring a laugh out of every single syll-a-ble rather than\nstepping back and looking at the effect of the broad canvas.<br><br>The result is a labored, embarrassing mess. Think: Animal House for the\nlobotomized.<br><br>For more reviews from The Squiss, subscribe to my blog and like the\nFacebook page.\n"},
{"review": "\nOverall: I personally thought the movie was very funny, however the\nhumour will definitely not be for everyone.<br><br>Good: Zac Efron and Dave Franco have great chemistry as do Seth Rogen\nand Rose Byrne. Seth's friend, Ike Barinholtz, is also a fun and\ninteresting character. The idea is pretty cool although I am not\nentirely sure it is original. The cinematography was decent and, for\nme, it was consistently funny from start to end. Seth Rogen and Rose\nByrne act pretty well.<br><br>Bad: Sadly, I think the rest of the cast's acting was just sub-par.\nNothing to do with the script I just didn't but their performances. Ike\nBarinholtz's acting just felt like he was reciting his lines and going\ncrazy. Obviously, the humour will definitely not be for everyone and is\ntargeted to a specific group of people.<br><br>Best Part: The airbags...<br><br>MVP: Seth Rogen as Mac Radner<br><br>7/10\n"},
{"review": "\nFor what this is, this is just fine. The whole gambit, which is the\ndifference between Appatow stuff that work and those that don't, is to\nhave skits that mask themselves out by spontaneity and characters that\nyou can buy as people who are troubled by real stuff before they have\nto morph for the cartoon. They do it here mostly. A lot of it is down\nto Rogen and Byrne conveying a great vexation.<br><br>It's about this couple of 30 year olds who have ushered into proper\nadulthood, bought their first house in the suburbs and just had a baby.\nThe film begins with the notion that maybe they would like to party\nonce in a while but this new life is too hectic. What do you know, a\nsorority moves next-door, reminder of crazy youth they have to leave\nbehind and are probably better off for it.<br><br>Enjoyable to watch overall and more of a breeze than not, which is what\nI expect to get out of a night with this.\n"},
{"review": "\nThe basic idea of the plot had comedic potential, and the beginning was\nokay. As the movie went on, however, it stopped being funny and I\nfast-forwarded through most of the second half. Characters lacked depth\nand were unrelatable, jokes were either really predictable or crude in\na bad way, and I didn't laugh the entire time (and I'm not a tough\naudience for comedies). <br><br>By the end of the movie I felt like I had lost some faith in humanity\n(because of its high rating.) Thankfully I read other reviews on here\nthough, and it seems like most people found this movie terrible. I'm\nreally not sure why \"professional\" review sites had such good things to\nsay- I'm guessing they were payed?<br><br>Anyways, 2 stars for the beginning which was okay, and because some of\nthe party scenes were cool to watch.\n"},
{"review": "\nA truly awful attempt at comedy. Not sure that there a single line or\nscene that had even the slightest chance of generating laughter. <br><br>Roughly set - the fraternity (led by Zac Efron, looking more and more\nlike John Stamos) moves in next door and causes too much noise for the\nfamily (Seth Rogen, Rose Byrne) raising a baby. First, the neighbors\nattempt to win the boys over by being cool. Being cool meaning spending\nall-night at the frat party and watching the baby through the use of a\nbaby- monitor. Good parenting at its best, but the premise can be\noverlooked in the pursuit of comedy.<br><br>When the boys have another party and do not respond to phone calls to\nkeep it down, the neighbors call the cops who are as unsympathetic to\ntheir plight as could be imagined. And so, taking matters into their\nown hands, begins the ever-escalating attempts to get the frat boys to\nleave or to be banned by the school, and the counterattacks to make the\nneighbors truly miserable.<br><br>Nothing original. All over the top. Not grounded in any semblance of\nreality. The writers and director should rewatch Animal House to see\nhow this genre was meant to be made.<br><br>And the \"good news\" - this movie made so much money that a sequel has\njust been announced. I cannot wait.<br><br>To see my other movie reviews, please visit:<br><br>https://nomorewastedmovienights.wordpress.com\n"},
{"review": "\nThis is a silly movie. With this theme of course it would be, but at\nleast it could have some funny moments. But I didn't laugh or even\nsmiled at one single thing. Seth is really starting to be more than\nrepetitive in every part his on. Its just the same character all the\ntime. The only one that has some kind of funny bone in this movie is\nRose Byrne when she tries to be the \"cool\" person. <br><br>This movie does not work. The youngster in the party house ain't funny\nat all and are only annoying. When the couple and the college kids\nparty together and start to become friends its so bad that its beyond\nbad, I actually feel bad for the script that has to have this\ncombination of words put together. And the actors suck and surprisingly\nmake it even worse, and thats an achievement in itself. The inescapable\nconflict between the two houses could have some funny moments. But its\nmore like a background environment for Seths bad lines.<br><br>If you want to watch comedies, there are a lot better than this around.\nEven in the silly party movies category.\n"},
{"review": "\nMy My, what an awful movie. Made no sense except for excuses to talk\ndirty and have lots of sex. The best part was the end. IT ENDED. Most\nmovies nowadays, and this is no exception. are made for the young\ncrowd, like 18- 29. When will screenwriters write real stories with\nREAL characters use real actors. This movie was atrocious garbage. I\nknow its only a movie and not supposed to make sense, but wouldn't the\nother neighbors have complained, even if they were 'helped' a bit by\nthe kooks that infiltrated the house? No matter how you look at this\nmovie, it stinks. Why did I finish it? Only to see if there were some\nredeeming values. None. So if you're looking for an ill-conceived,\ndirty, filthy, rotten mean spirited, terrible acted and inane movie. DO\nSEE THIS ONE\n"},
{"review": "\nA couple with a young baby are tormented by a group of students who\nmove into the house next door. Despite a promising premise and a good\nfirst 15 minutes this quickly degenerates into a lame lowbrow comedy\nwith absolutely no class. <br><br>I'm not a massive Seth Rogen fan as he just plays the same character in\nevery film. His wife is played by Rose Byrne who brings nothing to the\ntable apart from the ability to be irritating. Strangely enough the\nacting honours are taken by Zak Effron which I think says it all about\nthis film. <br><br>The toilet humour wears thin quickly and has been done better in many\nfilms before it. The film meanders aimlessly from one unfunny situation\nto another aided only by more witless moronic dialogue. The only thing\nI'll remember this for is the young baby (probably the cutest baby yet\ncommitted to celluloid) who also happens to raise the only laughs in\nthe film. <br><br>Unless you are a massive Seth Rogen fan there is little to recommend\nthis very poor comedy and it must be watched with the lowest possible\nexpectations.\n"},
{"review": "\nSeriously, I think Seth Rogan is a good actor to make some parts as\n'the dumb person', but this sex jokes are getting annoying. In the\nfirst scene I already get a bad feeling about the movie. The first joke\nis about the baby won't notice what they are doing, she only gets\nbouncy balls and that she will see Mac balls bouncing. And it is just\nall about that stuff. Plastic dildo's made out of the boys penis, and\nthe big one gets Kenny's ex-wife, a 'fight' that one guy hold the other\nballs(?!) and he gets a hard one? I don't know what's the fun nowadays\nto laugh at this anymore. I really encourage that these kind of jokes\ncould be changed, or even taken down a notch; or maybe two; how about\n5. Kids can also laugh at other situations without recurring to sex\nreferences and all that. Besides, that 'Ass Juice' pledge, seriously?!\n"}
]