[
{"review": "\n\"Remember, remember, the fifth of November, gunpowder treason and plot.\nI see no reason why the gunpowder treason should ever be forgot.\" <br><br>I've never read the graphic novel, but I don't think you need to read\nit to appreciate the movie. I saw the film last night at it's World\nPremiere at the Berlin International Film festival. Though it became a\nlittle weighty in the middle (one part seemed to drag a little) other\nthan that it was a great experience. The story was so topical that I\ngot seriously emotional during a lot of parts. Weaving did an excellent\njob with the mysterious title character \"V\", creating a poetic,\nintelligent, and compassionate yet ruthless character. Portman always\nseems to surprise me, except with her Star Wars character. She portrays\ntremendous emotional range and transforms completely throughout the\nmovie. This is one of those movies that really sticks in your head long\nafter you watch it though... and it continues to stir and grow.\n"},
{"review": "\nI am speechless. I just came back from the theatre, where I watched 'V\nfor Vendetta'. There are three main elements in the movie and it excels\non all three of them.<br><br>First off the dialogues and script. Intense, witty, honest but not\npatronising, intelligent but not pretentious. That's the first level at\nwhich the movie surprises you. You don't except such high level of\nscript from an action movie. But it is slowly revealed to the audience\nthat V for Vendetta is not just an action movie. The story is filled\nwith current events and has a definite strong political sense.<br><br>Secondly Hugo Weaving's performance. It is definitely what grabs you\nfrom the start. He delivers some of the hardest lines with incredible\ncharisma. His performance shines throughout the movie and honestly he\nsounds as good as any of the best actors out there. He should be\nnominated for an academy award.<br><br>Finally the visual part. Incredible, yet no \"Matrix\" effects used.\nEverything looks beautiful, dark yet vibrant. The cinematography is top\nnotch. The final battle scene brought tears to my eyes.<br><br>Do not miss 'V for Vendetta'. It's one of the best movies of all time,\nan eternal classic.<br><br>10/10\n"},
{"review": "\nThere are some that will, upon seeing this film, say that it was akin\nto Andrew Lloyd Weber attempting to make a political statement: overly\ndramatic. These people would be well served to remember that the symbol\nof drama is a mask, which certainly begs one important question- Why,\nif you are so put off by an overtly dramatic motion picture, would you\nchoose to see a movie that stars as the (anti)hero a man in a mask? I\njust saw this film at an advanced screening and I must say it is\nnothing short of uniquely brilliant. Entertaining from the start, V\nmanages to combine a strong socio-political message in a compact and\nhighly intense experience. Infused with issues and concepts that\npervade in the global political climate of our times, this movie is\nendowed with a tremendous timely relevance that belies its trappings as\na mere action adventure.<br><br>The acting, the cinematography, the effects, and the general vision of\nthis film all lead me to believe that it will likely receive a cult\nfollowing. It is only my hope that the message of this film will come\nto summarize the history of our future ascendancy to true liberty.<br><br>Ask not what your country can do for you, but what you can do for your\ncountry. In the meantime, go see this movie.\n"},
{"review": "\nI saw this movie yes today here in Denmark, and i didn't know what to \r\nexpect, because i haven't heard of the V or read the Comics from \r\npublisher DC comics.\r\n\r\nBut was i in for a BIG treat, this movie is so superbly acted by all \r\nthe actors, especially Natalie Portman performed according to me to an \r\nOscar nomination next year.\r\n\r\nThe movie is perfectly put together, so if you haven't read the comics \r\nyou will be on the edge of you seat the whole movie. Its really that \r\ngood folks.\r\n\r\nAnd lastly, the visual effects is fantastic, and the action scenes is \r\nnothing but spectacular.\r\n\r\nWatch this movie :-).\n"},
{"review": "\nwell... all i can say is goddamn.<br><br>keeping in mind that anytime you see a movie as part of a major film\nfestival world premiere, where the cast and creators are present, along\nwith hundreds of avid film fans and press, it tends to raise the\nexperience a notch or two... but having said that - i found it to be a\nwork of monumental genius. i thought it was so amazingly good in fact\nthat i actually had to say something as extreme as that to express my\ncurrent mood towards it, which is still only a mere fraction of how i\nfelt when i actually left the theatre. it was seriously that good.<br><br>and yes, i'm biased, if you can call it that. but i like the\nwachowski's for a reason, not blind admiration. they're geniuses, and\nthey've trained mcteigue well.<br><br>naturally, i think it will be under-appreciated by much of the general\npublic as its not nearly as action-packed as the trailer would have you\nbelieve, but whether it makes 100 mil or 200 mil, it should at least\ncompletely redeem the wachowski's legacy in even the most critical of\ncritic's minds.<br><br>i have to say, the rush of adrenaline i felt when...well, you know if\nyou've seen the trailer - made me want to stand u and cheer. when a\nmovie can make you feel like that, it's succeeded.\n"},
{"review": "\nOK, I only went to see this because of the Wachowski brothers\ninvolvement. I went totally expecting to hate this movie about a\nterrorist but it was so much more. I'm amazed to say that it's AWESOME!\nWhile not an action picture there's plenty of action and at least one\nfunny homage to The Matrix. You've gotta see it. It's very inspiring,\nbelieve it or not and it didn't make me want to blow up buildings\neither. It just made me appreciate freedom even more. Hugo Weaving is\nterrific and Natalie Portman leaves Princess Amadala far behind with\nher performance as Evey. Everyone's great. Stephen Rea is terrific\ntoo. I just can't believe I liked this movie. I'm still in shock.\n"},
{"review": "\nThe problem is to realize that terrorist groups, diseases and economic\ncrises are used by the government to frighten you so that you will see\nin it your last hope of survival. \"I want everyone to remember why they\nneed us!\" I've seen the movie on its wold premiere in Berlin, a city\nwhich has its own strong history with a reign of terror closely related\nto the movie. But in the movie, it is Great Britain in the near future\nwhich is threatening its own people. The graphic novel written in the\n1980s by David Lloyd and Alan Moore never has been more actual than\nnowadays. President Bush's call for Congress to give him the power to\nuse the military in law enforcement roles in the event of a bird flu\npandemic - where there is no pandemic jet.<br><br>V, who knows that not only diseases are used by his government to blame\nterrorist groups but in fact are home made biological weapons tested on\nthe own people, is spreading an idea of freedom and weakens the\ngovernment with real terror it cannot control.<br><br>A very honest movie, strong pictures, a great story. 10 out of 10.\n"},
{"review": "\nIf this had been a children's-movie rated by children getting the 8.3\nit got, I would have understood. But grown-up boys and girls surely\nhave better things to do with their time than to overhype this\ncelebration of averageness into the top 250 of this website.<br><br>The grown up boys 'n gals haven't rated a movie, they have rated\nsubject-matter as it would appear. I guess that showing some\nconcentration camp imagery, an evil Hitler-like character (a grumpy old\nman version of an Adolf anyway) and rehashing '1984' is enough these\ndays to make something profound.<br><br>I mean, why else would a movie which has obvious pacing-flaws, a script\nso full of nonsensical alliteration that it would even make a Vogon\ngnaw off his own ears, anything but a lavish plot, a pedestrian view on\npolitics and an agonizingly bad performance by one of its leads (Nat\nPortman (God bless her soul and looks) couldn't act her way out of a\nhigh-school drama even if she tried it without a fake foreign accent.)\nbe regarded so highly? <br><br>Watching this borefest, my eyelids cramped from fighting gravity. I\nwon't get into all the complaints I have with this talky and plodding\ntwaddle, it has all been pointed out by other reviewers in the\n'hated-it' section. These are just my two cents to warn anyone with an\neducation about the incredibly inflated polling-numbers for this\ncringeworthy exercise in film-making, scripting, casting etc. It\ncertainly isn't thé worst movie ever made, but it's average rating\nshouldn't be higher than a 5.5 and not a decimal more.\n"},
{"review": "\nWhile critics scratch their heads at questions like, \"Can a terrorist\nbe a hero?\" and \"How could one man do everything V does?\", they miss\nthe metaphor, and the point, of V for Vendetta.<br><br>V at one point in the film says, \"...ideas are bulletproof.\" The idea\nof this film is that unless the citizens of a country question their\ngovernment's spin and propaganda, they will succumb to the policies of\nthat government no matter how wrong-minded those policies may be.<br><br>I'm sure it's difficult for pigeon-holing critics to accept a Wachowski\nBrothers script that doesn't revolve around the action sequences, but\ninvestigates the castigation of an entire society using engaging\ndialogue and intense, involving characters. And after the Matrix\nsequels, this is somewhat understandable. However, V for Vendetta not\nonly surpasses those disastrous sequels, but the original Matrix as\nwell in terms of cohesiveness and depth.<br><br>This film must be a nightmare realized on screen for Republicans and\nconservatives the world over. They would have to label all of the\nnon-government characters as \"unpatriotic\", and V himself an insane\nterrorist. They probably don't understand that he represents every\nfree-thinking citizen of the world who is concerned about the actions\nand policies of his/her government, even though this point is made\nseveral times in the film. Further, they probably don't understand that\nthe violent actions of V and his compatriots are symbolic of everything\nfrom peaceful protests over the War in Iraq to Senator Russ Feingold's\nresolution to censure President Bush. On second thought, they probably\ndo see this comparison, and believe these non-violent actions to be\njust as outrageous as the blowing up of government buildings!<br><br>Discussions of governments gone awry aside, V for Vendetta is a\nrock-solid film that kept me riveted and unblinking for the entire 132\nminutes. See it on an IMAX screen if you can!\n"},
{"review": "\nIf you enjoyed Alan Moore and David Lloyd's graphic novel from 1988 --\nas I did -- do yourself a favor and avoid this pale rendition. Alan\nMoore has disassociated himself from this film, and with good reason. A\nfew of the character names are the same, and a couple of sequences bear\na slight resemblance -- but that's it. The fire, the passion, the heart\nand soul that so infused the novel is completely absent. The screen\nstory was already written, and the filmmakers ignored it, rewriting\nwhole scenes, cutting out others, eliminating a good 75% of the story's\npower, meaning and resonance. The characters are shallow, empty husks\nof their original selves, and the pacing is abominable. Nowhere in this\nsuperficial yawnfest is the true understanding of revolution made\nmanifest. Nowhere is the audience truly brought in to and made a part\nof V's tormented motivations or Evey's harrowing journey. That would\nrequire some creative camera lingering, and sets that didn't look like\nsound stages. If this had been made 15 years ago -- as a mini-series --\nperhaps some of the gritty integrity and enduring strength of the human\nspirit might have been retained.<br><br>Shame that it ended up in the hands of overpaid incompetents.\n"},
{"review": "\nI have just realised that by watching V for Vendetta this evening I\nhave missed Cronenberg's Eastern Promises on another channel. In light\nof V being awful that is genuinely annoying.<br><br>There are several reviews here that deal with the poverty of the film's\nsimplistic political message, its clumsy script and its nonsensical\nplot. (Evey imprisoned by V? Come off it. Dietrich's ludicrous decision\nto lampoon the High Chancellor? Totally unbelievable.)<br><br>I didn't care for the characters, I didn't care for the politics and I\ndidn't care for the production.<br><br>Where does it get the 2 points I've given it from? There are worse\nfilms that deserve lesser rewards. Oh, and I liked the explosions.\n"},
{"review": "\nMorally aggravating and cinematically direction-less and pretty dull, V\nfor Vendetta strikes me as yet another over rated Hollywood picture\nwhich may seem to have something going for it but ultimately does not<br><br>Set in a totalitarian future in England, (a vision pioneered by legend\nauthor George Orwell), the story follows a strange masked individual\nwho dresses like Guy Faukes and is planning a conspiracy to over throw\nthe government. The only person with whom he shares his secrets is a\npretty young lady who he rescues from thugs one night and he brings her\nto his lair. both their lives are suddenly taking a strange turn as\nmutual feelings for each other start to emerge.<br><br>Pop culture tends to like stories which attack power, authority or\nreligion, but this one is a bit absurd. It praises one of England's\nbiggest traitors. Guy Faukes was caught trying to blow up the\nparliament buildings in 1605. This is not however what bothers me most\nabout the film. the real problem is the writing. With the exception of\na few moderately neat scenes, most of the film boring, with not much\nplot progression, and the script includes a lot of silly and\npretentious lines which sound clever but arn't. A good example comes\nafter our hero survives a round of gunfire, he says to one of his\nattackers 'Behind this mask there is an idea, and an idea is\nbulletproof'. <br><br>Whatever else V for Vendetta has to offer isn't worth your time. Some\nbits of charm and wit shine through here and there, but all I really\nsaw was a barren film.\n"},
{"review": "\nI'm sorry that I can't focus on the movie, but a great movie I think\nshould bring up things other than the story itself.<br><br>Just like a friend of mine said, any government who bans this movie, it\nmust be a government just like the one in the movie. Unfortunately, the\ngovernment of my country, PR China is one of them.<br><br>It's just what they do, although not so explicitly. Everyday, Chinese\npolice censor all kinds of political sensitive content we can reach,\nput away brave-enough-to-speak journalists like Shi Tao, they even put\nup a project called Red Shield to control the Internet, which we always\nbelieved to be non-controllable.In China, we have never seen a TV show\nthat makes fun of the God like leaders, cause all the so called\nPeople's media were never people's. And what we citizens usually do?\nJust like what they do in the movie, eating, fncking and and shutting.<br><br>Thank God(every God we people believe in) there is still a country\ncalled United States, whose people haven't yet felt tired to remind us\nof how we should be living.\n"},
{"review": "\nIt's a perfect story, too perfect for this world too imperfect. It was\nthe first thing I thought while watching the movie, while living the\nworld that is told by images. More than a film; a dream, a world, an\nutopia. A view that lacks technical appraisals, because the sensations\nreach beyond dogmatism, \"What is this? How can there be something so\nperfect in such an imperfect world?\". The shock remains until today,\nbecause the story went on to take the edges of me, of what I am, the\nideas that this film conveys, freedom, truth, revenge, things of life\nitself. But the times, the effects, the views, it's poesy, it is\ntheater, spooky, shocking. Until today, this is the best movie I have\never seen. Because movies are trips, and worlds, the movie itself sets\nup a world where I want to live, I want to live that revolution, I want\nto live that idealism.\n"},
{"review": "\nThis film looks wonderful and yet gracelessly misses its mark - think\nof a springboard diver executing a two-and-a-half reverse tuck only to\nclip his head on the board while falling. (Did I really just make a\nDIVING reference?) Yes, I understand that this movie used a graphic\nnovel as a source material; this is why most comic book movies have\nless entertainment value than Laffy Taffy wrapper jokes.<br><br>The visuals and performances were top-notch, but the message delivered\ninside of the story was pure rubbish. It was the \"slippery slope\"\nrhetorical device typically used so nauseatingly by social\nconservatives (The whole world's gone to hell since (pick one) long\nhair on boys/the slam dunk/the birth control pill/rock and roll) - only\nthis time, the slippery slope falls to the far right: If you're against\ngay marriage, it leads to the internment of gays. Opposition to radical\nIslam leads to the criminalization of the practice of Islam. Opposition\nto illegal immigrants leads to the deportation of all immigrants. There\nwas also fodder for conspiracy buffs: the government knows and sees\nevery last thing. And the government is waaaaaaaaay bad. I mean\nseriously - like, EVIL. There was even a Rush Limbaugh sighting,\ncomplete with prescription drug addiction! <br><br>It's obvious that this movie is anti-conservative, which I don't mind\nat all. We need honest disagreement (which we do have in this country)\nas long as we are willing to work together (which we have not had in\nthis country since the 1810's). However, I really hate to see\nsophomoric distortions like these presented as some sort of provocative\nsatire. It's not. It's got all the thoughtful gravitas of \"Rock Against\nBush\".\n"},
{"review": "\nThis film tries hard to be deep, but is actually quite shallow. It hits\nyou hard in the face with simple themes, kind of like \"1984\" for\ndummies, but without the foresight and vision.<br><br>The performances were fine, but some of the writing was so bad, it made\nme want to crawl out of my skin. Too many cheesy lines.<br><br>Visually, it is quite spectacular, so if you like that, and that is all\nyou require in a film, you might like this one.<br><br>I live in the NYC area and hearing a line like \"sometimes there's no\nbetter way to change the world than to blow up a building\", did not sit\nwell with me. You could argue that is an open invitation/love letter to\nterrorists. I don't think that is sexy, artsy or cool.<br><br>All in all, not worth the price of admission.\n"},
{"review": "\nWith the exception of Crash, V for Vendetta is the film least deserving\nof a place in the top 250.<br><br>This film has all the problems of the matrix trilogy, with none of the\ngood points. It's script is clunky and melodramatic, and it lacks any\nof the amazing action that is so endearing with the Matrix. Hugo\nweaving hams it up spectacularly behind a grinning mask who has a\npractically schizophrenic personality (seriously, if we are to believe\nthat this man is a cold-blooded freedom fighter, we do not need to see\nhim flipping pancakes). Natalie Portman proves beyond all doubt that\nshe cannot act for toffee, and gets by on attractiveness alone. Stephen\nFry makes the best use of a badly written character, but even he is\nbelow his usual standard. The rest of the cast were perfectly\nunmemorable.<br><br>The film was V. V. boring (see what I did there!). Without any action,\ncoherent storyline, decent script or well rounded characters, this film\nis not worth anyones time and energy. I suppose it's because I'm\nBritish and can't stand any melodrama, but this film just irritated me.\n"},
{"review": "\nI can't believe what I just saw. This is one of the worst HQ\nadaptations I've ever seen! They simply mutilated the story,\ntransforming a child into a grown woman (in the original story, she\nbecame a woman ALONG the plot), hundred thousands of dead into 80.000,\nthe slow and complicated fall of a dictatorship into the most simple\nand clean transition of power ever (not one single person of the people\ngot hurt, or had to do anything).<br><br>And mainly, they transformed the most ambiguous, complex, mysterious\ncharacter (he never revealed his sex, or gave any signs of doubt in his\nactions or love for the girl) into a masked ninja like those seen by\nthe dozens in Hollywood.<br><br>Alan Moore was right to deny any knowledge of this.\n"},
{"review": "\nV for Vendetta was a weak attempt at political commentary and a\nsimplistic illustration of revolution. I couldn't help but laugh at the\nending with the fireworks and people. I think I'm going to make a movie\nthat harps on peoples ignorance and emotions. I'm going to fill it with\nimages of death for shock factor, make knives fly in slow motion\n(instead of bullets like they did in the matrix) because I can't think\nof anything original, and make my protagonist hero/terrorist speak so\n\"eloquently\" so that the movie seems smart because no one can\nunderstand the alliteration blather coming from behind that mask. The\none thing I was impressed by was Hugo Weaving's ability to recite his\nlines. Natalie Portman was garbage as always. Characters: all\n1-dimensional. The action was generic and predictable. When it comes to\nIMDb ratings, some people jump to say that this is \"the worst movie\never\" and give it one star. That is silly as anyone with a brain can\nsee that there is a tremendous difference between it and \"SuperBabies:\nBaby Geniuses\" which holds a bottom spot on this site. However, it is\nnot even close to worthy of a top 250 berth. 6/10\n"},
{"review": "\nThis film has become a symbol for all free men in the Arabic countries,\nI think it affected the Arabs more than the West, Egypt likes young\npeople wearing this mask does not know that they were fully insured,\nonce wrote a news website HTTP://Iraqi-website.com/ story guy wearing\nthis mask for fun police had arrested and imprisoned for three years\nand he's locked up yet. Maybe the revolutions were not created for the\nweak, but I like this movie because he found me a fantasy I liked to\nlive in it, perhaps state fair and the distribution of wealth but nice\nfantasy fiction, I watched the movie 5 times and each time I discover I\nforgot certain detail, hoping to produce again with a new vision might\ninclude Arab revolutions and violent religious extremism\n"},
{"review": "\nThis is another movie that brings in the question of what if? Natalie\nPortman is excellent, V is excellent. Makes you think of how the\ngovernment would actually treat the people.<br><br>One man is on the mission to bring liberty back to London after years\nof oppression by the government. After being used for experiments and\nput through torture for years V recruits Natalie Portman to help in\ngetting his message across. By spreading his message across London he\ngets the people to be able to get the nerve up to face the government. <br><br>Highly recommended to see, I've watched it so many times and will watch\nit more in the future.\n"},
{"review": "\nThis is MY \"greatest movie of all time\" and has been for quite some\ntime now. I often hope something may come along and knock it off the\nshelf, but it has not happened. (Children of Men came close) I've come\nto understand what's most important to me in storytelling, Encompassing\nthe entire human experience.<br><br>Most will not agree, but I found the film better than the comic book,\nand the comic was top notch! I know Alan Moore hated it, I think he\neven tried to get it banned or something, but to me Hugo's performance\nis beyond incredible. The general fear of a main character behind a\nmask with no facial expression's is totally beyond comparison here.\nHugo, if you're reading this, you have reached Ian McKellen status in\nmy eyes.<br><br>It's really difficult to imagine this comic being put onto the big\nscreen and more so, being acceptable, yet I found it truly compelling,\ninspiring and the overall essence captured. This is a movie that I\nbelieve will stand the test of time and is more relevant with every\npassing day in our modern world.\n"},
{"review": "\nWhile watching V for Vendetta recently, I couldn't help getting a\ndistinct feeling I'd seen something very similar before. And I had, it\nwas a few months earlier and it was called 1984.<br><br>1984 isn't as easy to grasp as V for Vendetta. You need to go into the\nplot to understand what's going on. V for Vendetta makes that a whole\nlot easier by adding a villain which anyone can get to know and a main\ncharacter who goes from being conformist to oppositional through the\ncourse of the film. In addition there is an ultimate goal instead of\nthe entire film just being a description of life in an completely\nauthoritarian state.<br><br>This is all very nice, unfortunately V for Vendetta fails to impress.<br><br>The symbolism of November 5th is at times taken too far. Despite the\nentire plot being built around Guy Fawkes and the blowing up of the\nparliament, the reasons behind it are too weak to make an entire film\nout of it. Having said that, I'm sure films have been built on less.\nFurthermore, the idea of a villain who's there to save the world, or in\nthis case, Britain, has been severely worn out by now. As always, the\nvillain is hiding behind a mask. Why?<br><br>All in all, if you liked and understood \"1984\", you'll be disappointed.\n"},
{"review": "\nThis movie's atmosphere and some of the camera-work reminded me of The\nRunning Man (that old Arnie movie 80s stinker) without any of its fun -\nall those ridiculous scenes with audience members and extras watching\ntelevision or movies - ridiculously self-absorbed as if watching other\naudience reacting is stirring. Directors the world over should know\nbetter than to show movie's or visuals of actors/actresses/extras\nwatching other movies or TV!!! The last thing I want to watch is other\nactors and actresses watching movies/television within a movie or TV\nshow - it's completely pretentious, flat, and decadent. It's about as\nmuch fun as looking in a mirror of yourself with another mirror behind\nyou. This movie fails as trying to be introspective - it has a decent\nrevenge premise, but the whole big-brother paranoid government setup\nreminds of bad Arnie 80's movies minus the fun of having Arnie. V is a\nstuffy pompous snob, supposedly elegant yet revolutionary. The problem\nwith movies these days is that in their effort to create style they\ntake themselves too seriously.\n"},
{"review": "\nI was not expecting to have such a great time when I went to this movie\nthis weekend, but it hit all of my hot buttons: loss of freedom,\ngovernmental plots against their own people, religion used as an excuse\nrather than as faith, homosexual rights, and ideas stronger than\nromance. <br><br>I understand that the graphic novel from which this film derives was\nwritten in the 1980's, well before the USA's start of the war. The\nprescience of the author is to be commended, even though I have been\ntold that he doesn't like how his novel was changed for the screen.\nI'll have to purchase it to decide for myself.<br><br>I normally don't go to movies with large amounts of graphic violence,\nbut this is one which I endorse and even take my kids to see because it\nshows that extreme measures and intelligence can triumph over\ninstitutionalized evil, as well as that every decision (such as looking\nfor security) has a price.\n"},
{"review": "\nV for Vendetta is a continuation of the modern super-hero movies. In\nwhich the protagonists are not superman like characters who are\ninvincible. Beside one slightly unrealistic scene towards the end V is\ncompletely human. Much like the heroes of Spider-Man and the recent\nBatman Begins.<br><br>Looking at the movie after it was finished and considering everything\nthat has happened I came to the realization that V for Vendetta really\nhad everything. It was thrilling, taut action, snappy dialogue, and a\ndistinct lack of plot holes. The pacing is brutal, which helps maintain\nthe level of suspense. It would seem if you only read this part of the\nreview that I would give V for Vendetta a 10 out of 10. But alas V for\nVendetta is not perfect.<br><br>To be honest at times V for Vendetta is incredibly pretentious. The\nromance between Natalie Portman and V is contrived and is unnecessary.\nThe middle portion of the movie (a.k.a. the torture part) lags and when\nyou think about what's happened in that sequence after the scene is\nover you will see how insane the entire situation was.<br><br>Overall V for Vendetta is a solid movie. It has some flaws but stays\nsolid through the final explosive scene.\n"},
{"review": "\nI honestly don't have the words to describe this movie....<br><br>Really...<br><br>I'm speechless...I've never seen anything like this in my life that\naffected me in such a profound way.<br><br>The only way I can describe this movie is in flashes of words:\n...1984... ...ZorromeetsBatmanmeetsThePhantomoftheOpera...<br><br>Let's just put it this way: if things continue on as they are, what\nwith the amendments added to our constitution in order to create laws\nthat facilitate the removal of rights; if we don't wake up and start\nthinking about the implications of these laws that are being passed to\nremove rights; if we continue to keep our mouths shut, allowing the\ngovernment to baby-step us out of our rights...<br><br>I can see this happening to us.<br><br>Within our lifetimes.<br><br>I think that this movie will stay with Thinking People(tm) long after\nthey leave the theatre. This isn't just a movie in the sense of\nentertainment. This is more of a wake-up call disguised as\nentertainment. If you weren't a Thinking Person(tm) before you see this\nmovie, if you have two brain cells to rub together, I guarantee that\nyou'll be one after you see it.\n"},
{"review": "\n''People should not be afraid of their governments. Governments should\nbe afraid of their people.'' <br><br>Having this brilliant quote, ''V for Vendetta '' is one of the best\nmovies I already watched in my entire life. It became one of my\nfavorite movies, and even writing about it is hard, because there are\nSO MANY things to say about this outstanding movie that I get lost. I\nwant to read the comic series as soon as I can! <br><br>I am in love with V! What a guy! What a spirit! I cannot imagine a\ndifferent voice from Hugo Weaving's to talk in his place, because\nHugo's is sexy as hell. Not only him, but also Natalie Portman, are\nexcellent in their roles and they totally deserve an Oscar for it.<br><br>The movie remembered me ''Nineteen Eighty-Four'' a lot, because all\npeople were always watching TV,their Prime Minister of Britain was\nalways talking to the people and his officials by a Big TV, very ''Big\nBrother'' look alike and they also have a fascist party full of members\nwith high privileges then the others. Not to mention that it makes a\ncritic to many things,like the power that the minority has from the\nmajority (And that happens in most governments) the fascism, the\nprejudice against everybody who is different, the control that the\ngovernment has from everything that happens in a country( many ways\neven creating lies for scare their people and give them( the\ngovernment) credit), the hypocrisy of many members of the catholic\nchurch and so on.<br><br>The plot is : In a near-future Britain after a war, the world is a bit\ndestroyed and an extreme fascist party called Norsefire has arisen.\n\"V\", an anarchist revolutionary dressed in a Guy Fawkes mask, begins an\nelaborated campaign to bring down the government and awake the people\nto protest against the way of life they are all living. He counts with\nthe help of Evey, a young woman who was rescued by him. Besides wanting\njustice, V has reasons from his past to kill the members of the Party.\n"},
{"review": "\nRemember, Remember the 5th of November the gunpowder treason and plot.\nI see of no reason why the gunpowder treason should ever be forgot.<br><br>This movie starring Natalie Portman and Hugh Weaving was amazing. I saw\nit on my birthday and I couldn't get it out of my head. This movie was\nbased on the comic books. I haven't read them but I don't think that\nyou would need to read them to love this movie. This movie was about\nfreedom and the way that some countries might end up. People control\ngovernment. Not the other way around. This movie was heavy at times but\nreally made me think. I think that this movie was wonderfully done and\nexceeded all of my expectations. The performances were brilliant and\nNatalie Portman really did a great job with her character. See this\nmovie!!!\n"},
{"review": "\nV for Vendetta is a really, really good film. It's spectacular in\naction, subtle in character development, nuanced about war and complex\nconcepts like good and evil, moving, exhilarating, thrilling and\nchilling.<br><br>The actors are great, the story keeps you on edge, the editing was\nbeautiful and I felt like calling the Wachowski brothers and the\ndirector to tell them.<br><br>As a movie V for Vendetta is utterly satisfying in all respects. What\nstays with you afterward is the intelligent ideas that are in the film\nánd under the surface.<br><br>In a world that is more and more divided in 'good and evil', where\neveryone is supposed to support a 'war on terrorism', where criticism\nis deemed unpatriotic, this film manages to turn those ideas\nupside-down.<br><br>Terror can be of the state and what is called terrorism by officials\ncan be exactly the opposite. The concept of freedom struggle as opposed\nto terrorism, the idea of 'terrorism is in the eye of the beholder' is\nfundamental to this film.<br><br>* spoiler * The final images of the film when the London Parliament is\nblown up draws in my view a direct parallel to the Twin Towers. Another\nsymbolic building representing power of state is demolished by an enemy\nof the state, showing clearly that black and white statements often do\nnot do justice to reality (and no I'm not saying the WTC is identical\nin any way). In this case the bomb clearly sets people free, it's a\nweapon of liberation and by using this kind of daring symbolism in\ntheir film, the Warchowsky brothers use art and movies for a serious\ncriticism on the current state of the world where good vs evil and\n(fairy)tales of fiction rule politics - A great film.\n"},
{"review": "\nAstonishing. Easily the best film I've seen in my years. It combines\ncreate cinematography, writing, screenplay, and directing into a\nconglomerate of breathtaking film. This film makes you want to be\ninvolved, stand up, and see it again. Furthermore, it's a film that\nwill stick with you.<br><br>If you can go into this movie with an open mind and willingness to\nthink and not just be spoon fed a story, you will fall in love with the\npiece the Wachowski's have brought to you. From start to finish you are\nengaged in a inspiring tale that uncovers just enough for you to figure\nout things by yourself. There are many times you can feel your whole\nbody receive goosebumps, and many more times you can look around and\nsee smiles or looks of worry on peoples faces around you in the\ntheater. <br><br>Do not be scared away by the mask, many people have said it's the\nreason they don't want to see this movie. It's not scary, it's not\nsilly, Hugo Weaving turns the mask into a fully breathing, living\ncharacter you yourself might find admiring.\n"},
{"review": "\nOh,really a stunning performance by both excellent actors Hugo Weaving\nas (V) and Natalie Portman as (Evey) and great outline of the plot of a\ndramatic story excellent action and scenario as in the tag line that\nwas said by Hugo Weaving as (V)Beneath this mask there is more than\nflesh. There is an idea and ideas are bulletproof.I really was amazed\nby this i think it deserved what it take to make an excellent movie and\nmy god the Wachowski brothers they really got with that movie after the\nMatrix sequels the definitely made me enjoy that movie and i think\nothers will.It was really great i loved it pretty good Directeing by\nJames McTeigue it was so cool me and my girlfriend and my friends loved\nit was never less than Matrix sequels it was excellent.\n"},
{"review": "\nThis was an excellent drama akin to the stories of Brave New World or\nFahrenheit 451 in its scathing indictment of those who rule through\nfear and force. I enjoyed the story and the characters immensely.\nThough you never see Hugo Weaving's face, his dialogue is masterfully\ndelivered, both a charm and an inspiration all at once. Natalie Portman\nclearly delivers one of her most stunning performances and projects\nconvincing emotion in her demonstration of an internal struggle. The\nwriting for this project was well done and stands out as a remarkable\nwork of drama whose powerful statements will continue to thrill and\nhaunt you for years. Although I know the graphic novel it is based on\nwas written as an indictment of the Thatcher administration, it\nnevertheless stands as a reminder to all people of all nationalities\nthat freedom is earned and totalitarianism is given away.\n"},
{"review": "\nThere aren't a lot of movies that I care to watch. Too boring, too\ngory, or just plain stupid. This is not one of them.<br><br>V for Vendetta, is one of the greatest movies I have ever seen. I got\nthe DVD and watched it three times. I could watch this movie forever.<br><br>Best love story, best action, best plot, and the acting was\noutstanding.<br><br>You hated Hugo Weaving in the Matrix, but you will love him in this.\nNatalie Portman has, definitely , made her mark, no more Star Wars\ncartoons for her. <br><br>The 'Valerie' scene was so powerful, so powerful, indeed. Yeah, I\ncried.<br><br>Excellent.\n"},
{"review": "\nWhen I go to a movie, it's either to make fun of it or because I really\nhave nothing else to do on Friday nights. Last night, I saw 'V For\nVendetta' and I blown away. I didn't go to make fun of it of course,\nbut I was just floored.<br><br>The political satire was wonderful. Using Muslims and homosexuals as\nscapegoats for the things wrong with society and lying about searching\nfor weapons so as to torture citizens in unknown prisons are parallels\nto today's America, even though the movie took place in the future in\nEngland. :) I was amused that the USA had been through a Civil War and\nwas now a Leper Colony. That's a WONDERFUL future for the Americans,\nwouldn't you say? (I'm being sarcastic of course) I didn't care for\nsome of the slow motion knife twirling, but even that was overpowered\nby V actually slicing someone. The great thing about this film is that\nit's almost unbelievable and ridiculous to a point, but because V\nrepresents all the people (as Natalie Portman's character states in the\nfilm) you feel sucked in and you love V as a hero, you want him to\nrepresent you.<br><br>I also like how they did have some humor in the film. When Evey wakes\nup and goes into the kitchen, V is in a frilly apron making her\nbreakfast. When he introduces himself to her in the street, his diction\nis made up mostly of words that have the lette v or begin with the\nletter v. He said it all so quickly and it was just amusing.<br><br>I suggest this movie for anyone who is in the mood for some\nBush-bashing, impressive action sequences, and damn good music.\n"},
{"review": "\nLike many i was skeptical about v. i had read the comic, and enjoyed\nthe wachovski brothers work, i was carefully optimistic.I saw it the\nday it came out there were very few people at my theater i was shocked.\nwhen the credits started to roll i stood up and applauded , i NEVER do\nthat. i was even shocked at myself. after being pulled through each and\nevery movie i've seen over the past few years i found a gem, a diamond\nin the rough. This movie was incredible. i believed in the characters,\ni laughed with them i felt sorry for them, i felt their rises and\nfalls. the story was incredible, it was churned out from the page to\nthe screen so beautifully. and it had a message. i don't mean that\nsappy message you get at the end of a Disney movie. it spoke to me, i\nmade the connections, i followed the dotted lines, and i was impressed,\nit showed the evils of the world and it showed that freedom is a price\nyou must sacrifice, avenge, and possibly die for. if somethings not\nright you do something about it, an eye for an eye a tooth for a tooth,\nall that good stuff. all in all v for vendetta was a movie i will not\nsoon forget if ever i was appalled when i walked out of that theater\nsome guy said \"that sucked\" then i realized that not everyone\nunderstood what i understood, a lot of people just saw a guy in a mask.\ni felt sorry for them i hope if you have not seen this film, you will.\ni gave this a 10 out of 10 with all my heart. I hope you enjoyed this\nreview, until next time... FREEDOM FOREVER!\n"},
{"review": "\nThis movie is transparent simplified movie logic wrapped around mainly\nEquilibrium with a little bit of Zorro tied in. With all the great guts\ncarved out and replaced with thinly-vield bombastic allegories and\nmetaphors comparing the current administration to Nazi Germany. I do\nconsider myself to be pretty solidly 'left field' politically--and who\ndosen't hate Bush, but wow... what brazen left wing propagandistic\npopcorn. I think a little bit of discretion and couth were definitely\nin order.<br><br>The movie offers nothing new or original, except an extremely thinly\nveiled jab at the current administration and the direction its heading,\ndumbed down with 1 dimensional action hero movie logic and the tired\nold fight-the-power futuristic anti-totalitarian theme.<br><br>Also, you can't make honest real world allegories while villainifying\nyour subject to the point of ludicrousness.<br><br>I had heard great things about this movie but watching it has left me\nscratching my head.\n"},
{"review": "\nThis movie was c for clichéd...i couldn't wait to leave the theater.\nAnd all of this for a guy who loves everything from comic adventure\nfilms, to silent oldies, to foreign language, or Errol Flynn\nswashbucklers, or anything written by Robert Bolt. I've seen a lot of\nmovies and this was at the top of the list for how many times I checked\nmy watch. The only film I've seen in the last 10 years that was more\nannoying was \"The Happening.\"<br><br>Why was this film so bad? It was predictable at every level and\nsurprising at none. Further, it was filled with every politically\ncorrect cliché in the book..really? A religious right group that takes\nover the world, and persecutes lesbians? And the only way to stop them\nis terrorism? I kept wondering if Michael Moore was behind V's mask\n(now that would have been a truly surprising ending).\n"},
{"review": "\nAs I write there are 2050 reviews of this film, so I imagine everything\nthere is to be said is already here. That's 2050 people who cared about\nit enough to put finger to key, and the vast majority adding to the\npolarisation created by it.<br><br>I don't read graphic novels, so I came in blind. The first time I saw\nthe film it captivated me, the second and third time I saw how silly it\nis, but remained enchanted, and I believe that is what the movie set\nout to do. There is something about V which stirs the spirit, and those\nwho place it among the greatest are simply able to overlook its faults\nin the way that hope springs eternal. And anger punches the air.<br><br>Everyone needs a saviour, and with the aplomb of Zorro, self- sacrifice\nof Christ and the righteousness of Batman, V makes heroes of us all,\nshoulder to shoulder. It's a fantasy of the enlightened that their\nfellow citizens, even if at the eleventh hour, come to share that\nenlightenment.<br><br>I cannot see how The British, and particularly Londoners like me, can\nwatch the shots of an army of masked, smiling revolutionaries marching\nshoulder to shoulder through the streets of the capital amidst the\narchitectural symbols of power and not be emotionally overwhelmed.\nThose scenes alone for me made the entire project worthwhile.\n"},
{"review": "\nBased on the graphic novel by Alan Moore, 'V for Vendetta' is a\npolitical thriller set in a fascist-ruled England in the 2020s. A film\nthat delves into the political side of oppression and anarchy, whilst\nrunning a somewhat emotive and heartfelt story of a character in\nbetrayal, 'V for Vendetta' is a visually stunning and extremely smart\nflick with some fantastic performances from Hugo Weaving and Natalie\nPortman (whose English accent is rather impressive). The film is\nnowadays considered a cult classic, and rightfully so, even to the\nextent that the film has been utilised by governments as an allegory of\noppression.<br><br>I have now started finding better movies through www.flickstree.com. It\nnot only suggests great movies to watch, it also tells where you can\nwatch the movie online.. Highly recommended.*\n"},
{"review": "\nShould be rated 10/10 with a depth and mind blowing plot and heart\ntouching attraction and a quality of 100%<br><br>\"People Shouldn't be afraid of their governments, governments should be\nafraid of their people\" The ultimate and most important teaching for\nall time. <br><br>Each and every dialogue, each and every sentences are important in this\ngreatest film over years. Bravery, boldness, patriotism, determination\nare represented here with a unbelievable smoothness and carefulness!! <br><br>It's not like other movies, not like merely entertainment, or\nrefreshment; but much more then those. It enlightens anyone's mind with\nwisdom and patriotism. Broadens the outlook and clarify the ideology of\nprotest against any unruly, manipulating, exploiting, humiliating\ngovernment. <br><br>LOVE THIS MORE THAN ANYTHING I'VE SEEN IN MY LIFE....IT'S THE BEST OF\nBEST.....\n"},
{"review": "\nThe greatest movie I've ever seen. The greatest masterpiece that has\nbeen ever made in the history of movies. I wonder such heart touching\nand deep movie is in such lower rating(!!) Why!? It should be rated\n(10/10) The best movie of the century I have to admit... A movie that\nwill stand top of all the movies for the next centuries even. <br><br>When I saw this movie first, I was amazed like nothing could do to me\never, no film no drama, nothing ever! <br><br>This is what I'll never forget in my lifetime!! <br><br>When my wife and family member watched this, the first thing they asked\nme was, why we had saw this late!<br><br>All of my friends loved it more then anything they've ever watched. I'm\nproud of the movie, but i expect more rating what this greatest movie\nreally deserves....<br><br>It deserves above 9 without a word as all say...\n"},
{"review": "\nI rate it(10/10) The best, mind blowing, amazing, touching\nunforgettable movie I've ever seen from my 2500+ movie collection. A\nmovie beyond time limit.... The deepest and most brilliant story ever\nmade for all time. A movie beyond words.... A bloody Masterpiece\nnothing can express it....<br><br>The best inspiration for anyone who love his country more then his/her\nlife. The movie of Patriots... The best film ever which can create the\nstrongest feelings of love and unity for the motherland and it's\npeople... The best film ever which can create the strength, bravery and\nboldness against the cruelty, injustice, humiliation, exploitation and\nall sorts of tyranny of the governments. <br><br>It Teaches us the words that..... PEOPLE SHOULDN'T BE AFRAID OF THEIR\nGOVERNMENTS! GOVERNMENTS SHOULD BE AFRAID OF THEIR PEOPLE!!..... <br><br>The best movie of all time...... Really I am speechless...... I'll\nnever forget it's heart throbbing power...... The best movie I have\never seen......the best.....the best of all forever it is........\n"},
{"review": "\nRemember remember the fifth of November When I first watched V for\nVendetta I didn't know much about it. However I have always had a\nfascination with darker comic book movies such as The Crow and some of\nthe Batman's. I am going start by saying that the character of V played\nbrilliantly by Hugo Weaving is one of those characters that will be\nremembered and is an instance classic. This in truth is 1 of my\nfavourite Natalie Portman performances, she is just so full of\ndetermination and curiosity and it's infectious. The scene where V and\nEvey first meat is truly tremendous. V saves Evey from some men trying\nto rough her up, she does hold her ground, V shows off some kick ass\nmoves and a very versatile vocabulary (see what I did there). One of\nfavourite things about V is he is an antihero yet he still views\nhimself as a sort of freedom fighter who is standing up for the\nopposing government. The reason why I love this movie so much is the\ntrue determination to do what is right and the casualties that had to\nhappen. V was a broken body but a free soul that wanted to make a\ndifference and he did so. Was everything planned, I don't know but all\nI know is this movie is a must watch and truly is amazing\n"},
{"review": "\nIt's the late 2020s and London is ruled by a fascist government. A\nvigilante known only as V is trying to stop the government from ripping\npeople's freedoms away by using a danger plan involving terrorist\nattacks and well timed murders. The movie follows Evey, a young woman\nwho plays the key role to V's plan without even knowing. The movie\nstarts with V, the vigilante, jumping down from the rooftops and saving\nEvey from a group of England's oppressive law enforcement. Afterwards,\nhe inquires that Every come with him to see something he had set up.\nShe reluctantly follows to see that he has blown up a government\nbuilding and hacked into all of the speakers around the city which he\nhad made to be shouting classical music as the building exploded into\nthe night sky, fireworks streaking through the air. As the movie goes,\ngets into trouble as he sends a message to the whole town over a\ngovernment frequency about how they have been censoring everything and\nstands for and stifling the whole city to ensure their rule. He also\ncomments that in one year of the explosion he will act again, but even\nbigger and more destructive. The rest of the film follows Evey as she\ntries to survive on the run as the year passes. This movie focuses a\nlot around the idea of rights and how the government can control its\npeople. Throughout the movie we see the government use censorship to\ncontrol how the people act and feel. During V's first terrorist attack\nhe plays classical music. The government bans this music from being\nplayed to do this to try and make people forget the event. Another\ninstance in the movie where censorship came into play was near the end\nwhen they banned any clothes that looked like V's clothes to try and\ndeter people from helping him or following in his footsteps. This movie\nis great representation of why civil rights are so important and is in\ngeneral a really great movie.\n"},
{"review": "\nI have always thoroughly enjoyed this movie for it's unique story. My\nfavourite part of the movie would have to be the the power struggle\nbetween Peter Creedy and Adam Sutler. We are led to believe that Adam\nSutler is, and has always been, the one with the most power. Yet during\nthe course of the movie, Mr Creedy's past deeds and his zealotry push\naside Adam Sutler as the main antagonist and allow Mr Creedy to take\nthe spotlight as the main antagonist. Additionally, Chief Inspector\nFinch's struggle between finding out about the truth about the St\nMary's virus and his loyalty to the Norsefire party is very intriguing\nand engaging. I love this movie, and it will always hold a special\nplace in my heart.<br><br>Remember, remember, the Fifth of November.\n"},
{"review": "\nWhat an Amazing film I have seen it like 4 times and I would see it\nagain for sure. The story line is first rate the acting is top notch\nthe plot right on the money, and it has a very real feel to it as if it\ncould truly happen with the way things are going today with all the\nterror cells all over the place. It has a nightmarish complexity to it\nand make one think about our own world. No though a film for children\nthe story line is thoroughly political and way way too DEEP for anyone\nunder 16 to understand, and the violence is way too over the top for a\nchild. But all in all a great watch a definite Ten out of Ten stars and\nin my mind a Golden Globe winner. If you want a thought provoking Film\nthis is the one for you.\n"},
{"review": "\n\"I, like god, do not play with dice\".<br><br>A brilliantly written movie and well made. the thought provoking\nwriting leaves you interested throughout the movie. The Wachowski's\ndelivered a script that might even be better than The Matrix.<br><br>Hugo's performance despite the mask is a testament of amazing acting\nand all you need is the voice to tell you. Portman also had a wonderful\nperformance and did not lack emotions when needed.<br><br>Overall, I think this one is set for the ages with the story,\nperformances and direction. It will be enjoyed for years to come and by\nevery generation.\n"},
{"review": "\nI don't know weather it was designed to create the group 'anonymous'\nbut that is what it did, anonymous very frequently use quotes from this\nfilm in a lot of what anonymous do, and anonymous operate in a similar\nway as V did, this is a very politically in depth movie and it really\nrepresents the world/ governments as they really are. Im sure after\nwatching this people have do some digging into their political system.\nIt even showed that the bishops rape young children, as it is known\nthey do, and i have not watched anything else in the mainstream that\ntruly represents bishops/ priests as the paedophiles that they are, not\nsaying all are. To be honest I don't know how the creators of this film\nare still alive, it is like a conspiracy theorist made a film about the\nilluminati, it is SO truthful/\n"},
{"review": "\nExquisite, passionate action-romance-melodrama from screenwriters Larry\nand Andy Wachowski has the U.K. under martial law and a fascist regime\nin the 2020s. Working girl Natalie Portman (in a charming performance\nwithout too much sturm und drang) chances to meet a masked vigilante\nnamed V after he rescues her from thugs; turns out his hit list is full\nof government officials, and she is asked to comply with V and be his\naccomplice. Despite some confusion in the latter portion of the plot\n(as well as an unnecessary recap of visual highlights, as if from a TV\nmini-series), the film is slick and smooth, easily consumed, and often\nvery exciting. Director James McTeigue carries us through the nastier\nelements of the plot without dwelling on the excesses (this isn't\n\"RoboCop\"), and Portman and masked Hugo Weaving are a scintillating\npair. Brilliantly designed and photographed, with amusing soundtrack\nchoices and a satisfying finale. *** from ****\n"},
{"review": "\nI am currently asking myself which movie to review to finally get that\ntick mark I see whenever I open my IMDb profile. I could choose Fight\nClub which has probably been reviewed by every second reviewer or I\ncould choose a movie that is quiet unpopular - a hidden gem so to say.\nBut no, I chose to be review number 1988 for \"V for Vendetta\".<br><br>Now why did I choose this one? Easy - it is in my honest opinion one of\nthe best films I have ever seen. Many people on this site see movies as\nart, not as a form of entertainment. \"Not everybody can understand and\nvalue movies just as much as those who see it as art\" is what you read\nagain and again. I however, do see movies as art which are also a form\nof entertainment. Every movie is a piece of art, but what matters most\nto me is that it entertains me. It has to keep me right at the edge of\nmy couch, it has to be so good that I will think of it again and again\nand again. I want to be able to recommend movies to everyone, not start\nevery sentence with \"Well, it is art - so you might not like it\". And\nthis is what in my opinion really defines a movie. It should have the\naim to entertain, not just to be art.<br><br>And now we finally get to the point why I chose this movie, why I rank\nit at the very top. V for Vendetta does not only convince with\nexcitement, great actors and an interesting theme - it is art for\neveryone. I can recommend it to anyone and be sure that they will like.\nBecause it is just what a good movie should be - it is entertaining. I\nlike to watch it, and I like to watch it twice, I like to watch it 50\ntimes. To sum it up it is a really nice mixture of action, suspense and\nan interesting story base without being the mainstream popcorn cinema\nfrom Michael Bay or the piece of art only critiques can value - it has\nfound the perfect balance.\n"},
{"review": "\nV For Vendetta had thrill, excitement, sadness, happiness, it was\nabsolutely amazing! Looking for some kind of trill? Watch V For\nVendetta! I know V's announcement by heart, I remember the \"remember,\nremember, the fifth of November\" by heart. I'm absolutely a huge fan! I\neven think of the Government the same as V, I wish we all could be\nfree! You will definitely fall in love with this movie. The thing that\nbothered me the most is the movie was long. Other than that the movie\nhad great graphics and the people whom played the characters did\nabsolutely perfect! I would definitely recommend this movie to friends,\nfamily, or all around the net/world who hasn't seen or heard of this\namazing movie!\n"},
{"review": "\nWell.. I think this film is powerful as can be. It is touching your\nhearts. It is hugging your brains. After film,you can not think about\nanother thing. You think about this film for hours. It made me\nsurprised. It made me cry. My opinion is,this film's topic is 'If you\nafraid of a lot of things,you will not be free,you can not be free.' <br><br>Another thing is..Natalie Portman. I watched her Leon,I watched her\nBlack Swan,I watched her V For Vendetta anyway,I ADORE HER. She is one\nof the most successful actress I think. And this is a good role for\nher. I guess anyone else couldn't be. <br><br>What can I say? V for Vendetta, is one of the greatest movies I have\never seen. Little bit love,little bit revolution,little bit political.\nExcellent.\n"},
{"review": "\nV for Vendetta is a fairly engaging entertainment which is hugely\naided, in America, at least, by the questions it raises about civil\nliberties vs security. Hugo Weaving does a nice job of overcoming the\nmask with his voice and body language and a strong supporting cast of\nfine character actors outweigh a merely adequate performance by Natalie\nPortman. But the Brothers W let us down with a half-baked screenplay\nand the more you think about this movie the less good it is. Consider,\nin particular, V's ability to circumvent an enormous security\ninfrastructure to assassinate top level officials in their homes at\nwill, hijack a government train, acquire and distribute a half million\nGuy Fawkes masks, and stock his personal museum sanctuary with art\ntreasures. How he does any of these things is seldom shown, and more\noften than not he simply tells us that he has done them. If you have\nnever thought much about the political issues raised and this film\ncauses you to do so, that's great. But it's far, far from a \"work of\ntowering genius.\" Marvelous explosion at the end, though.\n"},
{"review": "\nIt's just so typical of dumb asses on the IMDb to overrate this tired,\nbadly written piece of nonsense. The overuse of bad explanatory\nspeeches/ dialogue combined with its simplistic didacticism really\ngrated - the film offered a cheesy crash course in political\nsubversion/ rebellion for cretins. The love story was irrelevant,\nsentimental and completely uniteresting because the charcterisation was\nso lame - princess amrilla's character was nothing more subtle than the\npretty scared girlie who grows a political conscience and a bit of\ncourage. The direction and editing were hackneyed, dull and\npredictable. The photography was stunningly flat and badly framed, just\nboring -take the shot of the English people watching telly - it was\nlike a particularly tedious Kodak moment from a family album.\n"},
{"review": "\nWas it just me, or was the movie really really fast, blurry, and kind\nof drifted. I felt as though everything was going so fast, I couldn't\nbreath, listen, register, and sink in the words and thoughts of the\nmovie. And it was surprising how Eve &amp; V from the beginning were so\ncomfortable with each other. Natalie played Eve as though there was no\nreal character choices. Like it was her portraying herself instead of\nthe character. The movie makes me want to read the book, and see for\nmyself. And I've read and watched F451, 1985, etc... and this movie\nreminded me of a combination of those books. Movies these days are so\nsensationalized, and even audiences are getting tired of it, and seeing\npast the hype and are laughing at the style.\n"},
{"review": "\nV for Vendetta, is in short brilliant ! Much like a lot of other comic\nbook fans, I find myself disappointed in to the extreme when some hack\nfilm maker takes a look at the brilliance of Alan Moore, and then\nthrows any old rubbish at the screen.<br><br>This take isn't the graphic novel, book it keeps faith superbly with\nthe character of V.<br><br>Hugo Weaving is astounding in the role.<br><br>Natalie Portman also puts in a very performance as Evey.<br><br>Can't rate this highly enough. It is by far and away one of the best\ncomic book films to hit the big screen.\n"},
{"review": "\nI went to see this film not thinking I would like it much. But I really\ndid, more so than the other people I saw it with. The idea it brought\nto my mind was \"when\". This was an extremely believable plot that\nreally did provoke much thought. The dialogue throughout was superb,\nand the casting was excellent. I'm not a huge fan of films that use\nAmerican actors to play Brits or vice versa, but I really can't think\nof a British Actress who could have played Evey. and Hugo Weaving was\nspot on with all the accents in the film. Northern England by an\nAmerican cannot be easy!! What I also enjoyed about the film was the\nway that everything was laid out like a TV serial of a crime. I felt\nlike I was watching a special drama. Not many films can do that. The\ndanger with a film put in the genre of action is that the writers and\nproducers go overboard with the special effects because that's what the\npublic expects. The specials in 'V' were effective because they were\nused necessarily. What carried the story was the dialogue, but the film\nwas still action. I thought the finale was excellent and very fitting\nfor the film. Definitely worth a watch.\n"},
{"review": "\nI read the comic before and had high hopes for the movie after reading\nall the reviews. I was not disappointed. One of the best movies I have\nseen in a long time with in my opinion the best performance of Natalie\nPortman yet.<br><br>I was amazed by the performance of Stephan Fry as well. He played\nbasically himself, but not in the obnoxious way we are used from him,\nbut more in a toned down subtle way. <br><br>I know many people do not agree with the terrorist undertones and\njustifications in the movie - but it is true to the book.<br><br>10/10\n"},
{"review": "\nIncredible movie, and outstanding performances by Portman and Weaving.\nPart action, part psychological thriller, part love story...this film\nsucceeds in all of the above. Of all the films of \"masked\" heroes, I\nnormally can't wait for the moment the wearer is revealed. Until now.\nWhat lies beneath the Guy Fawkes grin is unimportant, both to me in the\naudience, and eventually to Evey. It's not the man himself that the\nfascists seek to find and destroy...but the IDEA he represents. After\nthe molten dreck that was MATRIX 2 and 3, The Wachowski brothers have\nredeemed themselves with this film. ****SPOILER**** The ending is\nbittersweet. Which in reality, is true of most people who take a stand.\n"},
{"review": "\nIf you really think about it, V himself is kind of sexy. I mean you\nhave a man who always wears the same mask but has different emotions\nand persona's. Even though the mask never changes, one can understand\nthe emotions beyond the mask and really feel for the character. When\nhe's angry you can feel it regardless of that grin, and when he's sad\nor upset that's visible as well. (Possible Spoilers) At the end when\nEvey begs him to stay and kisses the mask on the lips, you can almost\nfeel him tremble and when he says I can't, the voice is one of a man\ntrapped in hell because he wants to stay with her but also needs to\nfinish what he started. When he stumbles back after the last fight and\ncollapses in her arms, he tells her that even though he's glad its\nalmost over, he never expected to fall in love again or rather didn't\nthink he was capable again after the last time. Despite the same black\nclothes and the same wig, hat, and that Guy Fawkes mask, you can tell\nthat he loves her with all of his heart. A heart that has been scarred\nwith the horrors of his life, but still just before he dies you can\nfeel him redeemed because of her. Even though this movie is packed with\naction its also a really high-tech future-istic love story. At first I\nthought that V should have let Evey see his face but than I realized\nthat it made him who he was trying to be and others to see. It's\nbecause of that, I think made him very appealing to women; power,\ngentleness, and love behind the mystery. He wasn't there for evil, he\nwas there to stop it, to bring it down, with revenge and some serious\nskill. All of us women, need a little V in our lives.<br><br>10/10 ~ definite recommendation.\n"},
{"review": "\nV for Vendetta is a great movie that made me want take action\n(non-violent of course) and made me rethink the current situations\ngoing on in the world. I loved the movie's story and the\ncinematography. There were parts in the movie that were humorous and\nadded to the personalities of the characters. I thought the writers of\nthe movie did a great job at making people think about current events.\nAfter seeing the movie with a group of friends, it got us to talk about\nsituations and think critically about them. I think that for a movie to\nmake people think critically is very powerful and that the writers\nsucceeded in what they were trying to create . I suggest that everyone\ngoes and sees V for Vendetta.\n"},
{"review": "\nV For Vendetta was one of the best modern day movies I have seen. Very\nmysterious movie, but a thriller as well. The movie starts off with a\nyoung lady walking alone at night, however there is a curfew and she\nwas captured by 3 members of the government in a dark alley. Then like\nmost typical action movies someone always saves the beautiful woman\nfrom the bad guys. Well, the main character, V, appears and saves the\nwoman. The woman falls for V and V also falls for the woman himself.\nThere is much more, However, I do not want to ruin the rest of the\nmovie for you. This is a must see movie, if you haven't seen it\nalready, then i suggest you rent it or even buy it.\n"},
{"review": "\nThe movie captured my imagination.Excellent movie! Worth every minute\nof your time. The dialogs grab your attention, especially from the\ncharacter V. Hugo Weaving has given an Oscar-worthy performance, even\nwith a mask on. Natalie Portman is stunning as ever, and has given an\nequally excellent performance. The movie without being too big on\naction scenes, delivers the idea of action very well. I especially\nloved the first set of dialogs between V and Eve, when every word V\nspeaks begins with the letter 'V'. Hugo Weaving creates this\nmysterious, strong, and yet, sensitive personality in an unparalleled\nway. Excellent casting, cinematography and amazing sets. Amazing!\nOverall, an excellent watch. I know this movie is going in to my movie\ncollection.\n"},
{"review": "\nI hadn't intended to see this film but it was on at the IMAX and I had\na free evening so I figured I'd take a look see. After all a comic book\nfilm would have effects and those would look amazing on a giant screen,\nthus compensating for all the shortcomings that comic book films so\noften have.<br><br>WOW!!!! It was a film chock-full of ideas, many of which are still\nfermenting in my head. It was about the indomitable human spirit. It\nwas about the integrity of each individual. It was about a vendetta. It\nwas about love of self, love of society (a much-abused concept), love\nof an individual, love of ideas, love of art, love of books, love of\nwords, love of your fellow man. By the end I was almost\nhyperventilating at the power of the images and the ideas and the\npossibilities.<br><br>What didn't I like? Well, I wouldn't have cast Natalie Portman. She was\ntoo California skinny and her accent was appalling. I'd have got an\nactress with a healthier English build and the ability to hold an\nEnglish accent. Having said that, she didn't let the film down or make\nit unwatchable. The cast, directors and production team were so good\nthat they were able to carry her easily.<br><br>Please see this film. It may shock you but it will also make you think.\n"},
{"review": "\nThis movie was amazing. My sister and my dad dragged me off to see it,\neven though action movies aren't really my thing. I thought it was all\ngoing to be about some oppressed loser getting back and the kids who\nstole his lunch money in elementary school, but, it's really about a\nrevolution. V's poetic humor and polite manor is terrifying and\nbeautiful at the same time. Evey's steady growth as a character and as\nhuman being leaves you no doubt to her destiny. The political\ncause-and-effect scheme is as such that it can relate to anything and\neverything happening in our time. this movie shows a modern day\nrevolution of a corrupt government that will make you feel like one\namong many and many among millions.\n"},
{"review": "\nI went into the theatre to watch this movie expecting an action flick\nof the likes of the matrix. However, V for Vendetta more than surprised\nme with its direct comment on the politics of dictatorship, censorship\nand intellectual slavery.<br><br>The movie is a comment on the growing shackles that governments the\nworld over are imposing on their citizens. I personally believe that we\nare less free than we were about 10-15 years ago. The events that have\nshaped the past decade have allowed governments to justify intense\ncurbs on freedom the world over in reality.<br><br>Although the movie might not appeal to your average person who doesn't\npay much attention to what is going on in the world, it does present a\ndramatic (though a little overstated) history of the near future in\nwhich the government takes over private liberty in the name of\nsecurity. It also makes a subtle comment on how propaganda is used as a\nweapon, though the movie doesn't fully recognize its potential.<br><br>Vendetta goes on to show that the power of a thought, sparked off by a\nsingle person is enough to return freedom to a nation.<br><br>Overall, I think the movie presents a message to the people who see it,\na message that we are being fettered each day with greater curbs. A\nmessage that we need to awake to the way the world is being shaped at\nthis very moment and respond before it is too late.<br><br>Quite inspiring.....\n"},
{"review": "\nI think V for Vendetta is a truly great film. It is one of the best\nfilms to be released in the last 2-3 years. The plot is different,\nmakes people think and provides good plot, characters and action. Altho\nbits from the comic, I feel, could have been introduced into the film.\nLike Dominics transformation to the new role of V leading the people of\nLondon. Perhaps they felt they should not corrupt the film with a\nsequel, I know that Alan Moore the original writer was unimpressed with\nthe film project and left, so perhaps it was in kindness to him. I\nthink it is ignorant to pick up the small things in the film that are\nperhaps wrong. I see people writing about how people in the UK never\nsay elevator, course they do, just because you don't say it. Hugo\nWeaving as the lead role does seem to suit him, his voice is superb,\nbut still it would be interesting to see how James Purefoys voice would\nhave sounded behind the mask. Natalie Portmans acting was also very\ngood, I can see where people are coming from on her accent but she\nstill did a good job, portraying emotions. Just my thoughts!\n"},
{"review": "\nThere isn't much I can say that hasn't been said already. The acting is\nunbelievable, the characters and their dialogue are brilliantly\nwritten, the plot is deep and thought-provoking without being\nconfusing, and the special effects are jaw-dropping without being\noppressive. The best effects in the entire move are actually the ones\nthat required no computer animation or modern technology; fans of\nclassic movies will notice such devices as low-key music, camera\nangles, and background noise fading into silence all being used\nmasterfully. I saw this movie on a Friday night, opening weekend, in a\ncinema packed with over 300 other people. Not one person moved or\ntalked for the last 30 minutes of the film; we all sat in stupefied\nsilence, utterly spellbound by this powerful movie.<br><br>Ironically, one of the major theme of this movie is that intelligence\nis perhaps the strongest weapon in the world. This is ironic because\nall of the people frantically blaming this movie for religious or\npolitical reasons are the ones that misinterpreted it. My advice to\nanyone that has not seen it is to go do so right now, but leave\npersonal prejudices outside the cinema and enjoy an experience that is\nas poignant as it is absolutely mind-blowing.<br><br>Oh, this is off-topic, but I thought someone might want to know that\nthe IMDb spellchecker will try and \"correct\" several words even if they\nare spelled correctly.\n"},
{"review": "\nTo Start with , all I can say is , this is one of the best film i've\never seen in my whole life.<br><br>I went to see this on nearly a week ago , only because I like Natalie\nPortman. First before I've seen it I expect this movie to be a\ntotal-action movie and no story , However This films turned out to be\nAwesome for my point of view that This movie has everything .<br><br>If your a total action movies fan I strongly suggested that you do not\nwatch this film , however if you're not a popcorn cinemas fan I\nstrongly suggested and be able to guarantee that this would be one of\nthe best movie you have ever seen .<br><br>I , without a doubt would give this movie 10/10.\n"},
{"review": "\nI think that the movie was really good. It makes you think what if? and\nI like that not a lot of movies do that today. V is also futuristic but\nno in the way the Matrix was. I am so enthralled with the movie that I\nhave chosen it as my last topic speech in my college Communocations\nclass. I think that it is high time to address some harsh topics of the\npast and present so that people understand why present day is what it\nis. V is the man! I thik that more people should go and see this movie.\nIf you haven't read the graphic novel on V please do. It is very good\nand it will tell you more of V's story. I give a 10 to V for thought\nand good old action. Go V.\n"},
{"review": "\n\"Remember remember, the fifth of November\"... <br><br>Well, I know for sure that I will always remember the day that I first\nsaw this movie. The Matrix was of course a very good movie (the sequels\nwe can argue about) but 'wow' at the V for Vendetta! <br><br>I didn't really have any expectations when I went to this movie, but it\namazed me too much!! The introduction of V is great and every single\nword he says after this is even better! The mask in combination with\nthe voice.. the trouble from history and the problems of these days..\nall together it is brilliant! <br><br>Bravo, bravo... to everyone I wish to say... go and see, enjoy and get\namazed by this masterpiece! <br><br>The surprise of this year!\n"},
{"review": "\nIt seems that quite a few people don't like this film. Most dissenting\nvoices appear to be not overly concerned with the quality of\nstorytelling, visuals, dialogue, acting etc, for all excel, but rather\nwith the broader concept - the rights or wrongs of sedition, the\nquestions raised by the totalitarian state of the film, the eternal\nleft/wing continuum...<br><br>Well they're entitled to their opinions of course, but it appears that\nthis film has caught a mood, and that something very slowly is\nhappening out there. I've rarely seen public opinion so galvanised by a\npolitically-motivated film, and I've personally never been so affected\nby a film in my life.<br><br>To leave a movie theatre open-mouthed in astonishment, one's brain\nwhirring at a million miles per hour, is an all-to-rare occurrence in\nlife. Yet it happened after watching V For Vendetta. But why? The fight\nscenes, though cool and crisp, are relatively brief, and I'm not really\none to get off on fight scenes much anyway. If that's all I want, I'll\nwatch Bad Boys II. The explosion scenes, equally, are executed with\namazing aplomb, but the film would barely register a loss if the\nclimactic explosion didn't occur. The primary message of V is that\nideas are paramount, ideas count above all else and ideas will lead us\nto freedom. And it is the idea of the film that cuts so deeply.<br><br>I have never been so affected by a film, to the extent of contemplating\nleaving my lucrative but pointless job after watching it... I would\nwelcome every single individual in the UK watching this with an open\nmind. If it's not your thing, fine. If you find the action not mindless\nenough for your taste, again fine - most of Hollywood's other product\nwill cater for you.<br><br>But if you feel, as I feel, that something's not quite right with how\nour countries are ruled, then see this film, and get a glimpse of what\nmight lie in store.\n"},
{"review": "\nThis movie was truly incredible. Before seeing the film I figured it\nwas just another one of those boring action films where the main\ncharacter is virtually invincible, but this was different. The main\ncharacter \"V\" was very intriguing. The one man rebellion was very\nimpressive with his mix of intelligence and shadowy figure. I strongly\nrecommend seeing this film. There was never a dull moment. When I say\nnever a dull moment I don't mean explosions and bullets every second\nbut a very well developed plot. The title seems to reflect the film\nquite well, it was a great choice by whoever named it. Overall the film\nis a must see because of it's very good plot and very good special\neffects. Also it seems quite inspirational and very enjoyable by a wide\nvariety of audiences.\n"},
{"review": "\nAn interesting forecast of events which reflect very clearly the\ndangers of 1939-45 which might have been presaged in 1933 with a little\nmore attention. Makes you wary of the danger of incremental power\naccretions while providing an entertaining and emotive experience.\nNatalie Portman was finally given a role in which she could flex some\nacting muscles after the disasters that were her lines in Star Wars and\nHugo Weaving excels at imparting emotion without having to reveal his\nface - acting with only his voice, he demonstrated a real appreciation\nof his craft and testified to the potency of words alone. There were\ncertainly some scenes inappropriate for children and yet there were\nalso scenes that need to be seen, images of things that might have\nhappened, could be happening and are likely to happen so long as the\npublic remains acquiescent. Although the movie preys on current fears\nand worst-case scenarios, it is well to remember that it is a\ncommentary on the potency of fear as a weapon of power, and not\nconfined to the specifics of contemporary environments. The movie made\ngood use of evocative symbolism, music and dialog as well.\n"},
{"review": "\nV for Vendetta had the makings of a typical Hollywood movie filled with\nexplosions, blood and violence. But the Wachowski brothers created a\nfilm with multiple levels of meaning that the trailers failed to even\nbegin decoding. It is set more than 20 years in the future in England\nwhere a masked man attempts to change the world. There are elements of\nHitler's rise to power through the induction of fear, the mystery of\nPhantom of the Opera, but most importantly an inquisitive protagonist\nsimilar to the one found in Orwell's 1984. The theme is evident: People\nshould not be afraid of their government; the government should be\nafraid of the people. Through ingenious acts of deception and illusion,\nthe main character, V, shapes Evie, a girl he rescues in an alleyway.\nAs a common woman, she represents all of society. She has the ability\nto incite change but is unsure how to go about it. V's acts come across\nas horrendous to some, but for those attentively listening to his\nrationale, seems so logical. A higher-thinking member of the audience\nwill be able to draw parallels to present life and come the horrific\nrealization we better take care of the future before we fall victim to\nthe same totalitarian rule.\n"},
{"review": "\nGreat movie.. I liked it a lot. I really wasn't expecting much since\nthe Matrix series was little more than a brainless special effects\nreel.<br><br>But this film, this one is good. Not only is Vendetta entertaining but\nit's also socially important. Like \"A Handmaid's Tale\", it's something\neveryone (at the very least, within the United States) should see and\ntake consideration of.<br><br>All the actors were great, the script was surprisingly good, and I have\nthe feeling Natalie Portman's shaved head will start a trend or two.<br><br>\"A revolution without dancing is a revolution not worth having.\" - V\n"},
{"review": "\nThis is probably one of the only films I have seen that deserve a full\n10/10. It is absolutely jaw-dropping and an amazing piece which is a\nperfect example of pure cinema. I have not read any of the comics so I\nwent to the film with no knowledge of it and no preconceptions of what\nit should be like. And I am glad I didn't. Hugh Weaving was well cast\nand he gave the character of V great charisma, wit and made him\nstrangely attractive ( although that could just be me). Natalie\nPortman's character Evey was good and provided the typical love\ninterest but the way the film ends, with V dying just after they\nrealise how they feel about each other was well shot and portrayed the\nemotions felt by both characters. However, I don not think that she is\na particularly good actress as some of her scenes are quite wooden,\nalthough this could also just be the fact that her lines weren't as\ninteresting or as well written as V's. In general, however, the film is\nastonishing. The acting, the plot-line and that final scene of the\nHouses of Parliament blowing up make one leave the cinema completely\nblown away and the film is definitely a diamond in the rough of other\nrecent releases which just cannot compare!\n"},
{"review": "\nI went to see this film with average expectations. The trailers were\nthere, the posters were there but was it really going to be all that\ngood. Well I can safely say it was, I was glued to my seat. When I\nwasn't listening intently to every syllable coming from the mouth of\nthe hero V, I was delighted with exciting fight sequences and a few\nexplosions which left me feeling nothing less than liberated. When\nsomeone informed me that Hugo Weaving would have the mask on throughout\nthe entire film I was concerned that the character would never be able\nto connect with an audience at all never mind portray strong emotions,\nkey to such a character and I believed I would quickly loose interest.\nHowever Weaving managed to keep me extremely intrigued by V. Something\nI could never have imagined possible without having seen it done.\nWeaving has a charisma perfect for this role and I can't imagine anyone\nelse playing V so well. The other actors also kept me interested in\nevery character that came across the screen, especially John Hurt who I\nthoroughly enjoyed hating. Natalie Portman was a joy to watch. Although\nher British accent wasn't so fantastic her presence on screen more than\nmakes up for it. The non-conventional theme of fascist governments and\nterrorist hero's may not be for everybody but I certainly found this\nfilm one of the most entertaining things I've seen in a long time. A+++\nfrom me.\n"},
{"review": "\nThis film plays well to those of us who have already made their minds\nup concerning current events(that certain governments are evil). So\nwhat? Government gets away with all kinds of bad things, no matter who\nruns the show. <br><br>Aside from this, this movie reminded me a lot of \"The Trial of Billy\nJack\" in its negligent desire to reach a more mature audience. I am\ntired of \"R\" rated films for adolescent mentalities. Young minds are\neasy to propagandize, especially with easily digestible, non-thinking,\nfiery slop. Since the story comes from a comic book, maybe it is just\nfor the the intellectually lazy. <br><br>There are better films that portray similar ideas. \"Brazil\" and \"1984\"\nare such endeavors. They are far more frightening in their depiction of\nevil police states. <br><br>But ideas can be whispered and still change the world. \"V for Vendetta\"\ncame close to putting me to sleep, not only because of its naive\nstorytelling, but also because of its tired imagery. Entertainment is\nwhat it's all about, and this isn't that much fun to watch.\n"},
{"review": "\nThis movie is good enough, if you have to kill time. It's not a bad\nmovie, but it must have made it to top 250 movies because of its\npolitical appeal to the reviewers, not because of any cinematographic\nachievements. It's a political statement, for an imaginary political\nsituation. I think part of the appeal to some people is, that they see\nthe real world in the way the movie, thus they can better relate to the\ncharacters.<br><br>As a movie it's just an average Hollywood movie. In the special effects\nand in ways of shooting the scenes, it borrows from some earlier\nbenchmark movies, but looses in quality to them. The plot is far from\nmind blowing and has no big surprises. Just what you would expect as\nyou watch it.<br><br>My guess is that you will like it more if you are politically to the\nleft and like the idea of having to fight for your idea i.e. like\npolitical activism. And you better not like Christianity, as in the\nmovie Christianity is referred through a Hitler like dictator and a\ncorrupt pedophile bishop.\n"},
{"review": "\nIt is not often the facade of a character can emerge from disaster to\nbecome a hero. However, there are precedents, like Phantom of the\nOpera, Darkman and The Hulk. They however, lack subtly. beauty, poetry\nor as the highbrows call it, Panache. Seeking to find an intellectual\nor sophisticated hero, I give you \" V .\" It is not the usual movie.\nIndeed, it is quite a bit more. In fact I would go so far as to\nproclaim it is the best film of this genera, I have seen in years.\nThere are many special qualities of a classic film and this one has\nthem all. There is violence, suspense, drama, revenge, romance, comedy,\nintrigue, excitement and of course, mystery of character. Most of all,\nthis film has Chancellor Adam Sutlet (John Hurt) who embodies the\nunbridled and ruthless power of a brutal government. Arrayed against\nhim is V, superbly and adroitly played by extremely talented Hugo\nWeaving. The story is that of a dark hero who is condemned to\nunspeakable torture and imprisonment returns from certain dead to\nstrike terror into the heart of an established totalitarian system\nwhich created him. Using the facade of a dead anarchist, Wearing plays\na dangerous cat and mouse game with the police and the dictator, using\nboth special effects and a dazzling dexterity with knives. His aim, to\nallow society to awaken from apathy and reclaim it's government. A must\nfilm for any modern citizen who remains reluctant to find fault with\nit's present malevolent government. ****\n"},
{"review": "\nits a great great film and without a doubt one of the most breath\ntaking film I've ever seen in my whole life and Hugo is the best actor\ni have ever seen as:u cant see his face but he makes u see it with his\ngenius and his outstanding performance ..... Hugo you are the best\nactor I've ever seen and port man ... u are so talented and i cant\nforget the great role of the director of this movie and the sound\neffects and visual effects and who ever wrote this story is a great\nwriter and novelist and i really wanna know if the story of Fawkes is\ntrue or not or if it was a legend and the best line the film that\nreally affected me is when v told Creed beneath this mask there is more\nthan flesh.beneath this mask there is an idea Mr Creed and ideas are\nbulletproof\n"},
{"review": "\nAmazing movie...truly a brilliant tale of a freedom fighter/terrorist\nin post Iraq war Britain. A fascist oppressive government rules Britain\nand its up to V to show to people they need to rise up and disband this\ngovernment. Away from the plot I knew this movie was going to be simply\namazing...I didn't even bother renting before I bought it, the\nWachowski brothers did the screenplay so i knew it was going to be\namazing...and it was. The directing was great...Hugo Weaving does an\namazing job playing V, and the supporting actors do a great job too. I\nbelieve this movie is not slamming the Bush administration, like so\nmany people say, rather what could happen when the governments power\ngrows too great. Governments should always be for the people and by the\npeople, this movie demonstrates what could happen if it wasn't for the\npeople. All in all this movie is simply amazing, the cinematography is\ngreat, the acting and the directing is great. This is probably one of\nthe best movies I've seen in awhile and I suggest you rent it because\nit is truly worth your time.<br><br>My Rating: A\n"},
{"review": "\nIn this day and age of tired remakes and formula films, this plot stood\nout as original &amp; unpredictable. Being not familiar with the comic book\nsource, everything was totally new to me. I truly was pleasantly\nsurprised at some of the turns the plot made and took great enjoyment\nin not being able to second guess what would happen next. Further,\nPortman's acting ability really shines in this role. Her portrayal of\nEvey added a human dimension to the movie that kept this movie from\nbeing just a superficial film rendition of the comic book. The acting,\ndirecting, and visual effects wove together well to create a believable\nalternate reality in which the viewer could immerse themselves.\n"},
{"review": "\nIt is a compelling drama and a fantasy at the same time. It's one of\nthose rare movies that leave you thinking about the world around you\nand how the events in the film could actually happen - or may be\nhappening now.<br><br>Of all the movies I've seen in the last 12 months, this is the only one\nthat left me pondering today's events in view of the movie events.\nThat's a powerful movie. But it is also entertaining and funny at\ntimes. The acting, the cinematography, the lighting, all support the\nplot and feel of the movie. <br><br>Hugo Weaving does a tremendous job evoking emotion through a masked\ncharacter (that never removes his mask). Natalie Portman is superb as a\nyoung woman who is forced to realize that V is not the enemy of the\npeople, he is the solution to the enemy of the people.<br><br>It's one you shouldn't miss.\n"},
{"review": "\nWhen I entered the theater I was hoping to see a movie that I would add\nto my favorites list. A movie that would have many different emotions.\nI was hoping to see a great film. The movie went above my expectations.<br><br>In the first 10 or so minutes, I worried that there would be nothing\nbut violence... but the next scene threw that out the door. With a\nbombardment of \"v\" words who couldn't smile? This film didn't only have\nhumor and violence... it had so much more. More that you just cannot\nexplain. For example: right when you have a serious point in the film,\nsomeone will ask a question... the answer will be so simple that you\nalmost laugh.<br><br>Almost nothing turned out the way I expected, and I'm normally pretty\ngood at figuring out endings. When it was over I just stared at the\nscreen, as did my friend and my mom. It was over... yet not.<br><br>On the way home you just keep thinking. It feels as if everything you\nonce thought was taken out of your head, then replaced, but with a new\nthought too. Will this really happen? that's one thing you wonder. This\nis a film you will want to see more that once, as you are blown away\nthe first time.<br><br>This movie will not be my favorite... for reasons I'm not sure. It will\nbe a movie I will buy and watch a few times for sure, but it just\ncannot be classified as my favorite... it's just not it's style. It\ndoesn't seem right.<br><br>And also... as I went to sleep that night, I could not get Guy Fawkes\nface or the 1812 Overture out of my head. :)\n"},
{"review": "\nI chose to see this movie based only on the trailer that I saw when I\nwent to 'The Hills Have Eyes' and knew nothing at all about it. I must\nsay though that it will probably rank as one of the best, if not the\nbest, movie of 2006 (for me, that is.) I'll admit to being somewhat of\na conspiracy theorist, and also admit to being rather mistrustful of\nour (US - G W H Bush) government. This movie though, should serve as a\nwarning to all that may chose to give up 'liberties' to gain some vague\n'security.' The totalitarian regime depicted in this movie isn't really\nall that far off from some that are currently in power in several\nso-called 'free' countries and we really must maintain vigilance that\nour leaders do not gain the powers that the leaders in this movie have\ngained.<br><br>I won't give anything away here, but I strongly urge ANYONE who is\nconcerned with civil liberties and free will to see this movie and to\nrecommend it to all their friends.<br><br>Writing this review a full five days after viewing, I still must give\nthis film a complete (and totally out of character for me) ten out of\nten, not for any acting, directing, or editing, but simply because I\nfeel that it conveys a very valuable message that ALL people who value\ntheir hard-earned freedoms should take heed. Our founding fathers would\nprobably love this movie, much as I did.<br><br>Enjoy!!\n"},
{"review": "\nThis movie is based on the fact that governments create fear in people\nto control them and spend billions on weapons and the military. See\n\"The Power of Nightmares\" by Adam Curtis for a documentary on this\ntopic.<br><br>The movie is not too far from reality when it depicts a dictator who\ndoes not care for his people and controls the media to spin his lies. A\nlot of oppressive regimes act this way around the world and in each of\nthese countries there are freedom fighters or terrorists depending on\nwhich side you are on.<br><br>The movie also communicates that the purpose of taking actions against\nthe oppressors is not just revenge but that each action is a strategy\nto make the oppressive regime collapse. Each of V's actions creates a\npre-calculated reaction which climaxes with the end sequence of the\nmovie.<br><br>Excellent work and truly emotional. The controversy will be that\nviolence was used by V to end the oppressive regime instead of the\nnon-violent ways of Gandhi and MLK.<br><br>Clearly the message of the movie could be taken one step further: The\nanalogy being the US committing state terror against other countries\nand that the oppressed people will fight back. The media control is\ncertainly well documented by Noam Chomsky in \"Manufacturing Consent\".\n"},
{"review": "\nThis is a punk film in every sense from the banned classical music to\nnatalie portmans haircut, punk originally set out to get itself\noutlawed yet ironically this film shows what the punks of 1976 could\nhave become had they become the law, maybe they are ? and it's too\nlate, a future banned classic maybe.Watch and listen between the\nlines..... Natalie portman is the complete actress with shades of Jodie\nfoster, Sigourney weaver and er, that girl out of Leon ? Cool. Equally\nadmirable is that this film has a true British quality to it that\nreminds us that although we are a small island we do tend to make a\nworld wide impact from time to time and not all of them regrettable. I\nsimply sat spellbound by this film wondering what old punks i knew had\nmade their way sufficiently enough in todays society to make all this\npossible, then i phoned a curry.<br><br>1984/10\n"},
{"review": "\nThis movie adaptation of the graphic novel is an astounding feast for\nthe eyes, thought food for your head and a emotive testament to the\npower of people in the face of adversity. The original 'comic' was set\nin a fictional version of neo-Nazi Thatcher era Britain, but taking out\nactual historical figures (apart from Guy Fawkes) gives the piece a\nmuch bigger net to cast. With enough fantastic fight scenes, and things\nblowing up to keep the action fans happy, V brings a multi-layered\ncomplexity, poetry and wit that one does not usually associate with\nthis kind of movie. Even though it is fiercely British (the dismissive\nand passing references to the civil war in \"the former United States\"\nis a powerful backdrop) one of the things that gives this movie such a\nresounding impact is the parallels that can be drawn to current world\nevents. If power corrupts, then absolute power corrupts absolutely. It\nlooks at how governments control the media, mutate and mold the publics\nperceptions and use questionable methods to their own ends. The tag\nline of 'People should not be afraid of their Governments, Governments\nshould be afraid of their people', is such a powerful and brave thing\nto say in this day and age when countries all over the world initiate\nsedition and treason laws. It's theatrical release was held back in the\nUK due to the London bombings and it's easy to understand why, but I'll\nspare you the spoilers. Their are some incredible performances, Natalie\nPortman as Evie gives perhaps the best performance of her career. John\nHurt's malevolent High Chancellor is a seething cauldron of hatred.\nStephen Fry as Gordon is magnificent and gives a glimpse of what I hope\nwill be more dramatic roles for him. And then there is V, played by\nHugo Weaving, who although you never see his face gives a remarkable\nportrayal full of humour, madness, righteous vengeance and tenderness.\nThat mask will forever evoke strong feeling in me. V FOR VENDETTA is an\nabsolute must see movie.\n"},
{"review": "\nI thought this was an amazing movie. It was very well put together and\nput out an amazing message about how media lies to sway peoples idea\nabout what goes on. Also it shows how people can come together to go\nagainst a totalitarian authority and defeat them without fear. This\nmovie reminded me a lot of the book \"1984\", the movie \"Wag the Dog\",\nand the movie \"Loose Change\" about 9/11. It showed how the chancellor\ntried to cover up what was really happening by feeding lies to the\npublic, which the publice did not buy. I recommend this movie to anyone\nlooking for a film that makes you think about our govt and if these\nkind of things really happen, we just don't know about it... Great\nmovie, one of my favorites.\n"},
{"review": "\nIn a near future, a totalitarian state is ruling England. On November,\n5th, a man self-calling V (Hugo Weaving) explodes a symbolic monument\nand starts fighting for freedom using terrorist technique. He also\nrescues Evey Hammond (Natalie Portman) from the claws of the abusive\nsecret police and later she becomes her allied. The man in charge of\nthe investigation, Inspector Eric Finch (Stephen Rea), discloses the\ntruth about his leaders while chasing V.<br><br>\"V for Vendetta\" is in my opinion the best action movie of the year.\nThe story, about a totalitarian state that uses fear and terror to win\nthe elections and dominate the population, inclusive forging terrorist\nattacks, is much updated. There are many excellent lines in this\nOrwellian story, but I would like to highlight the following ones:\n\"People should not be afraid of their governments; governments should\nbe afraid of their people\"; and \"Ideas are bulletproof\". The awesome\nPyotr Ilyich Tchaikovsky's \"1812 Overture\" fits amazingly perfect to\nboth scenes of explosion. \"V for Vendetta\" is not only a brilliant tale\nof revenge as the name suggests, but mostly a magnificent message and\nhymn of freedom. This is a movie that deserves to be watched many times\nas a lesson of freedom and citizenship. My vote is ten.<br><br>Title (Brazil): \"V de Vingança\" (\"V for Vendetta\")\n"},
{"review": "\nV for Vendetta was an original movie that has substance. The comic book\nthat inspired this film has many deep seeded issues that I feel we all\ncan relate too. There was so much rich dialog that made you think, and\nthe action had you on the edge of your seat or at least mine\ndefinitely. Hugo Weaving did a great role choice to be V he also made\nthe character believable. I loved V for Vendetta in the theaters and\ncan not wait to own it at home. It was a well thought out film that has\nan edge and was very serious about what the world can become. I knew\nthat this movie was going to be good once I found out a little bit of\nbackground about it but I had no idea it was going to be as good as it\nwas. More movies should take the approach of V for Vendetta because it\nhad great screen shots, once again dialog, and a unique story line. V\nfor Vendetta is a movie you will want to watch over and over and over\nagain. Once you see this film it will be hard to talk about anything\nelse but V for Vendetta.\n"},
{"review": "\nThis is one of my favorite movies ever. The story stars with Evey, a\nwoman who is trying to visit her boss. When she is attacked by the\npolice, a mysterious figure, V, helps her. When he meets her, he makes\na speech using much alliteration with the letter V, ending with, \"You\ncan call me V.\" I think that is a very nice touch. The movie doesn't\nstrongly follow the comic book, but this is not a disappointment. In\nthe comic, each victim is killed in a symbolic way, but in the movie,\nthey all get a lethal injection from V. When V is ready to execute his\nplan, he takes over the TV studio, and puts a mask on every person,\nsimilar to \"Inside Man\" This movie is highly recommended.\n"},
{"review": "\nThis film is one of probably the best of its kind after the classic\n1984. Similarities are many to the original 1984 (as in all\ntotalitarian regimes) and the presentation of things is both amazing\nand intense. Acting is brilliant by all of the actors and the\nappearance of some action scenes does not spoil the film at all. The\nmost wonderful about this film is the fact that it presents imaginary\nfacts with a tremendous resemblance to todays \"war on terrorism\". In\nthe end terrorists are which ones ? Even all the citizens of your own\ncountry ? Words like freedom and safety sometimes get on the opposite\nsides of the road. There are big similarities (at least in behavior)\nbetween the Prime Minister of the film and other totalitarian leaders.\nAnyway ... what an amazing film !!!\n"},
{"review": "\nThe film \"V for Vendetta\" is based upon the same-titled comic book\nwritten referring to a real-life event: the assassination of one of the\nmost honorable English protesters of his time Guy Fawkes, who\nsacrificed his life in the name of peace and human dignity. Remembering\nthe persecution of the Church during the English assent to it's new\nliberalism with the manifestation of Parlement and to the excesses of\nThrone at the time. <br><br>A very political film since it demands the audience place themselves\nnot in the Edward Gibbon (\"Decline and Fall of the Roman Empire\")\nSenatorial mindset but one of the world - and in this case the\nfuturistic English society - drone Babbits in the guise of Natalie\nPortman's character.<br><br>In a time when political discussion is forbidden in the workplace, in\nreligion (outside rubber stamping each and every authority), in\nentertainment (again outside bitchy comments on SNL or Comedy\nCentral)it was probably too much to hope the general public would - or\neven could - assimilate this motion picture.<br><br>Each segment has a reference to today's political, economic and social\nhierarchy - and would in a fair world would be picked apart by high\nschool teachers like they do other populist entertainment. <br><br>But it is not useful to any cause that is currently embraced by the\nsocial order so that's not likely. -- We'll have to wait until there is\nyet another challenge to the status quo in twenty years for the film to\nsuddenly be discovered for use as a battering ram against \"convention\"\nas was done in 1960s with \"King of Hearts\" and later with \"One Flew\nOver The Cuckoos Nest\".<br><br>But I'm patient - in time it will be enthroned as a poster child for\nanother generation that it missed in ours.\n"},
{"review": "\nWow, went to see it with a bunch of prior feelings of oh god another\ncrummy movie of 06 But believe me, if u want a movie that incorporates\nthe following things: Fast Paced action, a good plot, humor, Nathalie\nPortman, and a good amount of criticism against totalitarian\ngovernments. Obviously it is a strike against current anti gay views,\nconservatism, etc. (sorry previous reviewer ... i tend to disagree and\nit doesn't hurt pushing the liberal agenda ... yes it is fiction but so\nis American Idiot by Green Day, that doesn't mean there is a message\nbehind the fiction... or as they say in the movie: \"Artists use lies to\ntell the truth; Politicians use lies to cover it up\") ... Best movie in\na while, hands down.\n"},
{"review": "\nMy favorite movie ever! Absolutely the best movie I've ever seen!!! Saw\nit 4 days ago and still can't get over!!! How can one write the story\nlike this!!! The most brilliant story and cast and filming\u0085!!! The\ncharacters are so well played! It's unforgivable! I'm not normally\nwatching the film a second time. But with V for vendetta I just can't\nwait to see it again! Will have to get a book and also a DVD to add to\nmy very-very strict DVD collection. <br><br>Don't expect just to relax and watch the movie. It's very tense and\nit's getting tenser to the end of the movie. You will be completely\noverwhelmed by the time you finished watching it. <br><br>A try peace of art! The top of my list! Highly recommended!!!\n"},
{"review": "\nA wonderful movie from start to finish. Some of the best dialog for a\nmovie iv seen in long time. Very well done. Credit goes to the\nWachowski Brothers for an Excellent movie.<br><br>I couldn't imagine anyone doing V any better then Hugo Weaving, his\nvoice was perfect for the role. Nataly Portman was also at her best\nproviding for some very believable performances. The movie has\neverything, well written script the right amount of twists, surprises\nand situations that have you thinking about the world we live in.<br><br>I loved the touch with the Chancellor using Fear on the television to\nkeep control of the people. Reminds me of the US president. I thought\nfor sure we where going see the Red/Yellow terror alert for V LOL.<br><br>Great Movie.\n"},
{"review": "\nV For Vendetta is a stunning adaptation of Alan Moore's science-fiction\ngraphic novel that is faithful to its ideals, albeit with some updates\nwhich make it seem more relevant to today's world. What makes it truly\nunique is its believability. While the masked freedom fighter V is the\nstuff of comic books, the background story of the world's fall into\nruin and fascism seems frighteningly possible.<br><br>The most powerful part of the movie occurs when Natalie Portman's Evey\nreads the autobiography of Valerie, a remarkable woman who was\npersecuted, tortured and killed because of her lesbian sexual\norientation. Valerie refused to give up her integrity or her dignity,\nin the face of tremendous evil.<br><br>The graphic novel was written in the time of Thatcher and Reagan.\nToday, the forces of greed and ignorance are once again ascendant.\nConservatives threaten our values and want to turn back the clock on\nall the progress made by good-hearted, progressive people. The story of\nV For Vendetta is a powerful reminder of what could happen if we ever\nlet them win, if we ever give them that \"last inch.\" It is also a\nhopeful film, however, as the forces of wisdom win in the end, just as\nthey always have and always will. Perhaps the very fact that this great\nfilm could be made and distributed by a major studio provides the\ngreatest hope that its events will not come to pass. Liberty prevails.\n"},
{"review": "\nI'll keep it short, this was the best movie I have seen in many years,\nquite possibly ever. I will probably always \"LIKE\" most of the Star\nWars movies better, and possibly a few others, but I really think this\nfilm was beyond excellent. It's story, characters, effects, message,\netc., etc. as a whole make it probably the \"best\" movie I've ever seen.\nAs I said, I may \"like\" or \"enjoy\" other movies a fraction or two more,\nbut ever since I have seen this film, I now consider this the \"best\"\nfilm I've ever seen. And it is definitely in the top 5 films that I\n\"like\" or \"enjoy\" the most. The day after I saw it I called three of my\ngood friends to tell them how good it was, and that I'd go with them to\nsee it again if they were going to go see it. I will buy the DVD the\nvery first day it comes out. I'm not going to try to analyze or\ninterpret the meaning or message here, as I feel almost anyone can\nbenefit from seeing this movie, no matter their views or opinions, and\ndebating the underlying meanings/messages/implications/innuendos, etc.\ncould take me more hours than I want to spend, in addition to the\nresponses, replies, etc. that I'd want to respond to. Just see the\nmovie.\n"},
{"review": "\nThis is a small comment and it goes like this: Rare have been the\nmovies that make me see them so often. I was getting very bored with\nthe film industry lately. Gay cowboys movies and other frauds like that\nwere getting on my nerves. V for Vendetta has awaken me from my movie\nsleep. Hugo Weaving OWNZ yet again. Never have i seen such a movie\npersona as V. Makes me laugh and think, not the most common combination\nnow-a-days. OH the mystery of it all. What great scripting. I could\nlisten V talk for hours and hours, something i don't usually\nlike.Natalie isn't bad either, except for that over-crying part in V's\n\"Lair\".Yes, \"Lair\", the man's a super hero in my opinion. Thank you\nvery much for this movie.\n"}
]