[
{"review": "\n\nThe Matrix...when I first heard about it, I expected just another sci-fi\naction thriller.  Good and filled with insane stunts, but not terribly\nintelligent.<br><br>Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes,\nthey are awesome.  And the special effects are absolutely amazing (even if\nsimilar ones have been used in other movies as a result- and not explained\nas well).<br><br>But the movie has plot as well.  It has characters that I cared about.  From\nKeanu Reeves' excellent portrayal of Neo, the man trying to come to grips\nwith his own identity, to Lawrence Fishburne's mysterious Morpheus, and even\nthe creepy Agents, everyone does a stellar job of making their characters\nmore than just the usual action \"hero that kicks butt\" and \"cannon fodder\"\nroles.  I cared about each and every one of the heroes, and hated the\nvillains with a passion.  It has a plot, and it has a meaning...and lo and\nbehold, a plot does help the fight scenes!  Just try it, if you haven't seen\nthe movie before.  Watch one of the fight scenes.  Then watch the whole\nmovie.  There's a big difference in the feeling and excitement of the\nscenes- sure, they're great as standalones, but the whole thing put together\nis an experience unlike just about everything else that's come to the\ntheaters.  Think about it next time you're watching one of the more\nbrainless action flicks...think how much better it COULD be.<br><br>All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on\none of the best films of all time.  It isn't just special effects,\nfolks.\n"},
{"review": "\n\nIt's been a while since a movie has generated enough interest in me for me to\nwatch it.  \"The Matrix\" looked exciting enough in the trailers, so I decided\nto give it a look.  What I found was an amazing movie, with some of the\ngreatest special effects I've ever seen.  The camera angles really work for\nthe action sequences and the choreographed fight scenes made me yearn for\nmore.  Say what you want about Keanu Reeves' acting.  He may not deliver the\nbest dialogue, but his look can carry a film.  He was a great choice for the\nrole of Neo.  Carrie Anne Moss was great as was the underrated Laurence\nFishburne.  I highly recommend this film for those who are a fan of visually\nstunning movies.  It will blow away your senses...\n\n"},
{"review": "\n\nThe Wachowski Brothers vision of a possible future takes the visual and\nsound aspects of filmmaking to a new high. Incorporating older still\nphotography with computer enhancement to the degree that appears on the\nscreen has raised the genre to a level that will be very hard-pressed by\nfilmmakers for a number of years. Acting was wonderful, script, visual,\nsound, everything about this film is a tribute to a usually overlooked\ngenre.\n"},
{"review": "\n\nThe Wachowski brothers really did excel themselves with this movie. It's a\nbrilliant movie on a number of different levels - the directing is\nexcellent, the camera work is great, the visuals are stunning, the kung-fu\nis A+, acting is executed with style and conviction, and the plot is truly\ninspired. It's really hard to use enough superlatives on this\nmovie!<br><br>It'd be a 10/10, except for the ending. Having Neo do what he does at the\nend really lets it down, in my opinion. However, there's a couple of\nsequels\non the way, so let's see what the Wachowskis can do to make up for\nit.<br><br>Other than that, (and like I said above) the movie is operating on so many\ndifferent levels that each time you watch it, you pick up something new...\nthis isn't by accident, either. The Wachowski brothers had the actors read\na\nnumber of definitive works (Simulation &amp; Simulcra was one I believe) in\nmodern literature and psychology, and applied liberal dashings of aspects\nof\nthe major religions to provide the best sci-fi movie of the decade, if not\never.<br><br>I'm yet to meet somebody who hasn't enjoyed it. It's my favourite movie to\nwatch on a good cinema system, too.\n"},
{"review": "\n<br><br>Who is to say what is real or not? We are defined by our view of reality,\nno matter how twisted or demented it is in comparison to 'normal' people.\n*evil eye* Yes, I see you all, looking in the mirror, trying to decipher\nwhether or not your view is the reality we all share.<br><br>The Matrix not only supplies the world with a whole new level of special\neffects mixed with style and substance, it also brings a whole new meaning\nto the word 'paranoria'. This is one of those great epics that becomes a\nmilestone in our present day world, a mark for which just about everybody\ncan appreciate. Not since the original Starwars trilogy has a science\nfiction film reached across almost the entire population and gripped it\nwith\nawesome special effects, great sound, and a overall feel of ground breaking\nmovie making magic. It also serves up a good dose of paranoid delusions we\nall need in our lives every now and then.<br><br>With that, I leave you with the fact that I've seen more different types of\npeople liking this one film than most other films to date. Move over George\nLucas, you may have just met your match... :)\n"},
{"review": "\nIn the year 1999, \"The Matrix\" and \"Fight Club\" were undoubtedly the\nbest films of the year. The Matrix was truly revolutionary in special\neffects, specifically in CGI (Computer-Generated-Imaging) technology.\nThe still cameras that were used to capture multiple angles of a single\nshot, in bullet-time technology, was a creative new approach. The film\nis initially suspenseful with people not knowing quite what was\nhappening until Morpheus (Lawrence Fishburne) reveals that Neo's (Keanu\nReeves) reality was actually a fabricated world that is an elaborate\nsimulation created by machines. Neo and the majority of the world's\ninhabitants have been stuck in simply a mental simulation prison. <br><br>The magnitude of philosophy in sync with special effects make \"The\nMatrix\" a one-of-a-kind movie masterpiece. College classes show this\nmovie in their philosophy class, and at the same time can prove to be\none of the best special effects movies ever. Supplementally, \"The\nMatrix\" also provides endless action and a pretty solid storyline that\ninfluences the philosophical ideas in the movie. <br><br>There are so many great things in this movie, it is just crazy.<br><br>The color palette along with the time and effort put into stunts also\naccelerates this movie on all filming levels. \"The Matrix\" leaves the\nviewer a sense of pride in the world he/she can live in to just know\nthat people are capable of creating at this level. Unfortunately,\nmonetary and timing motives offset the potential quality of the\nsequels. \"The Matrix Reloaded\" and \"The Matrix Revolutions\" were just a\nwaste of time and weren't carefully thought out, as was the first\nMatrix. <br><br>10/10\n"},
{"review": "\n\nYou walk into this film not knowing what the Matrix is. You take your seat\nand watch the trailers. The green Warner Brothers (green? you ask) trademark\ncomes up, and without warning you are thrust into the Wachowski brothers\ngrand vision. 2 hours of excitement later, you stumble out of the cinema,\nknowing what the Matrix is.<br><br>This is one great movie. Keanu Reeves is cooler than cool as Neo. The\nWachowski brothers skilful direction is brilliant. The special effects\nsequences will blow you away, did I mention the government lobby scene?<br><br>The film starts off with a 'what is real?' first half, and then the first\nkung-fu sequence makes way for an action- packed, John Woo-esque second half\nwith slomo and style cranked up all the way to the top. Did I mention the\ngovernment lobby scene?<br><br>Keanu becomes Cool Keanu, Carrie-Anne Moss is a real find and Hugo Weaving\nis perfect in his against typecasting role as the evil Agent Smith.<br><br>You may notice in this review that I have not revealed what the Matrix is.\nLike the trailer says, 'You have to see it for yourself.'<br><br>Excellent. Best film of '99. 9/10. \n"},
{"review": "\n\nRight there with Seven and Silence of the Lambs for me.  I love this film,\nand rate it a notch above some of the other great action films of our time\n(i.e., Terminator, Predator) because it has a really well thought out\n(although moderately unbelievable) story line.  A lot of thought provoking\nmaterial, and some interesting subtleties. I've seen it 10 times (I don't\nusually watch a movie more than once), and I'll watch it a few more. \nEnjoy!\n"},
{"review": "\nI think there were Action/Sci-Fi movies before The Matrix and there are\naction/sci-fi movies after The Matrix. It changed everything. <br><br>This movie was one of it's kind when it came and there was nothing like\nthis seen before. Awesome action sequences, bullet times, slow motions\nand the concept, everything was awesome.<br><br>Not just action, the movie is great in other aspects too. The movie is\nthought provoking and very influential. This movie forced every\nfilmmaker of action/sci-fi movies to step up.<br><br>I still remember when i watched this movie for the very first time more\nthan 10 years ago, it felt like i'm in a different world. I've never\never seen anything like this. Movie had awesome effects, that might\nseems outdated these days, but that time it was first time something\nlike that was shown in movies.<br><br>This movie was really a gamechanger, and we are lucky that this movie\nactually happened.\n"},
{"review": "\nWhat made The Matrix special was the ground breaking visual effects\nsuch as 'Bullet Time' that have been often imitated in other films and\nvideo games. The Wachowski's simply knocked it out of the park.<br><br>Keanu Reeves is Mr Anderson an ordinary computer programmer by day and\nsecret hacker called Neo at night who is suddenly pursued by government\nagents led by a sinister Agent Smith (Hugo Weaving) after he is\ncontacted by computer hacker Morpheus (Laurence Fishburne.) <br><br>Morpheus believes Neo is the 'One.' Humans lives in a false reality\nthat controls humans and Neo will lead the harvested humans to rebel\nagainst the machines creating the false reality.<br><br>The film mixes cyberpunk science fiction with Hong Kong style martial\narts and elements of Japanese manga type animation as inspiration.<br><br>Keanu Reeves is in his element is a world where he does not understand\nthe world around him. He looks cool and does well in the martial arts\nsequences. I guess revisiting this genre made up for the failure of\nJohnny Mnemonic.<br><br>Laurence Fishburne is even more cooler as Morpheus guiding Neo in this\nhostile new reality and how to take down the system. Carrie-Ann Moss is\nkick ass sexy in black leather as Trinity who displays superhuman\npowers.<br><br>The film has philosophical underpinnings as the Wachowski's ask us to\nthing about the world around us and our existence within it.<br><br>The film is cool, it is hip but I felt slightly too long and little bit\nto po faced. However the Wachowski's did manage to catch lightning in a\nbottle which they did not manage to do with the sequels.\n"},
{"review": "\nThis movie is literally the reason I do what I do. the special effects\nwere so amazing for it to be a 99 film, the fighting was beyond well\nchoreographed and the story!!? don't even get me started, do you know\nhow many times I had to watch this movie!? it took years for me to\nunderstand it all.I couldn't thank the director enough for this film\nthis movie inspired me to begin doing things that were extraordinary\nand that stood out. my passion for parkour, riding Motorcycles, to my\nmartial arts. now I just wanna become an actor and be great, do my own\nstunts, and not be a nobody. Neo (Keanu Reeves)was my idol, and I hope\none day I can be as great as he was in this film!!\n"},
{"review": "\nI find it strange that most of the people who watched Matrix were only\nattracted by the visual effects and overlooked the scientific facts on\nwhich this movie was based.<br><br>People enjoyed the flying mostly and hence liked Matrix 1 more than\nthey did with 2 and 3 although the answer was in part 3 that is who\nwill win the war eventually between humans and machines. Some people\nthey make fun of the idea that one day humans will be in direct war\nwith machines but those people have not read yet about the Nano\ntechnology. The latter technology offers something like the software\nwhich teaches Neo how to fight in little time. Well through Nano, they\nwill be able to plant a brainlike chip which works 10,000 times faster\nthan our brain and they are now trying to optimize the speed limit in a\nway that doesn't endanger our brain which might be burnt working under\nsuch speed.<br><br>As for the flying part, it is very possible if the science of\nPsychokinesis is given more consideration and in the near future I\nreckon they will with the evolution of human body which is going toward\nless and less movement. Has anyone seen the prototype of the new cars\nwhich have no pedals and we use sticks to drive and direct the car in\ndifferent directions.<br><br>Well, I guess the movie has tackled all these scientific aspects\nalongside psychological and philosophical ones in a very brilliant way\nand I 100% give this move 20 on a scale out of 10!\n"},
{"review": "\nThe Matrix (1999) is basically the idea of The Matrix, an ultra-\ncomputerized sci-fi film by Andy and Larry Wachowski that has an\nexcellent concept but squanders it by falling back on the same old\ntired action movie conventions. The Wachowski siblings have given us an\nhour's worth of excellent cinema, filled with fascinating ideas. <br><br>The film begins where We start with a woman named Trinity (Carrie- Anne\nMoss), who seems to be on the run from a gang of Men In Black- types\nled by Agent Smith (Hugo Weaving). Luckily, she can leap tall buildings\nin a single bound, run around on the walls, and so on. So she gets\naway, but not before contacting a computer hacker named Neo (Reeves) by\nsending him a cryptic message on his monitor. Following her directions,\nNeo meets up with Morpheus (Fishburne), who is in charge of a ragtag\nteam of humans from the late 22nd century. And why did Morpheus seek\nout Neo and bring him up to speed? Because Neo is The One; he's the\nmessiah. He's going to save us all.\n"},
{"review": "\nIt might seem \u0096 but it isn't \u0096 condescending to find it ill-considered\nfor any one of us, in unqualified fashion, to declare one particular\nmotion picture the \"very best\" unless and until thoroughly familiar\nwith the whole spectrum of all genres and disciplines from the last\ncentury. An absolute favorite, certainly, as in music, literature and\nthe arts; but there is the work of Mizoguchi; Godard; Buñuel;\nRiefenstahl; Fellini; Ozu; Fritz Lang; Satyajit Ray; Renoir; Dreyer;\nTruffaut; Bresson; Murnau; Welles; Kurosawa; Kazan; Ophuls; Eisenstein;\nKeaton; Bergman; Kubrick; Minelli; Kieslowski; Yimou; Hitchcock;\nRohmer; etc. \"B-e-s-t\" might reasonably include at least a handful of\nother movies in world culture.\n"},
{"review": "\n*Deeply exhales* The movie MATRIX was indeed a breaking point for movie\nmakers, and it paved way for both marketers, producers, and film makers\ngenerally. The era at the time the MATRIX was released really needed\nsomething new and different, and this was what the MATRIX was able to\ndeliver. With ground breaking still motions and effects, it was indeed\na movie of the time. While being perfectly casted with Keanu Reeves\nplaying NEO, and Carrie-Anne Moss playing Trinity, while leaving the\nboss himself in the middle of it all, Laurence Fishburne playing\nMorpheus. Their roles were imbibed in them as if it were their true\nnature and this really made a significant difference between the so\ncalled science and fiction.\n"},
{"review": "\nThe Matrix is a 1999 American-Australian neo-noir science fiction\naction film written and directed by the Wachowskis, starring Keanu\nReeves, Laurence Fishburne, Carrie- Anne Moss, Hugo Weaving, and Joe\nPantoliano. It depicts a dystopian future in which reality as perceived\nby most humans is actually a simulated reality called \"the Matrix\",\ncreated by sentient machines to subdue the human population, while\ntheir bodies' heat and electrical activity are used as an energy\nsource. Computer programmer \"Neo\" learns this truth and is drawn into a\nrebellion against the machines, which involves other people who have\nbeen freed from the \"dream world\".<br><br>The Matrix is known for popularizing a visual effect known as \"bullet\ntime\", in which the heightened perception of certain characters is\nrepresented by allowing the action within a shot to progress in\nslow-motion while the camera's viewpoint appears to move through the\nscene at normal speed.\n"},
{"review": "\nThis movie is perfect in the way this is an exposed of the system we\nliving in this is no movie this is real or so call t the truth so\nthanks for letting us waking up let it all fade away the soul blinded\nsystem we living in my vote for this movie is a 10/10. this is a movie\nlike buy before you try thing so we getting stronger in the end truth\nbless us all ones you see it free your mind free your life free your\nway free your message to the living being's stand up for the don't\nstand up is like a reborn wit no more pain in all of us but anyway\ndon't let fear take you over just be happy wake up watching greetings\n-znAKe - Solo Minded Productions\n"},
{"review": "\ni've seen a lot of movies , i was surfing the web until i found a list\nof the best hacking movies on this link :\nhttp://www.aqweeb.com/2016/05/hackers-Movies-P2.html then i try to\nwatch every single movie , after that , i realize the the MATRIX is the\nbest one of them , i watch it more that 5 times , and all his parts ,\nreally awesome movie . but the most awesome of that , is the acting of\nKEANU REEVES , i love this actor , i watch his las movie John wick and\nKnock Knock , really awesome movies , i hope that there is more parts\nof the Matrix , but no problem , we can watch more movies of KEANU\nREVEES instead .\n"},
{"review": "\nThe Matrix not only supplies the world with a whole new level of\nspecial effects mixed with style and substance, it also brings a whole\nnew meaning to the word 'paranoria'. This is one of those great epics\nthat becomes a milestone in our present day world, a mark for which\njust about everybody can appreciate. Not since the original Starwars\ntrilogy has a science fiction film reached across almost the entire\npopulation and gripped it with awesome special effects, great sound,\nand a overall feel of ground breaking movie making magic. It also\nserves up a good dose of paranoid delusions we all need in our lives\nevery now and then.\n"},
{"review": "\nThis Movie Is Great. Not Only Did It Set High-Bars In Visuals And\nSci-Fi, The Originality And Concept The Wachowskis Have Created Pulls\nYou Into This Awesome Sci-Fi World. The Performances Are Great, So's\nThe Writing, Directing And Visuals!<br><br>Neo? Keanu Reeves NAILED IT As Neo. When I Started Watching This Movie,\nI INSTANTLY Related To Him, Which Is Hard For Me Nowadays\nBecause.....Reasons?<br><br>Hugo Weaving As Smith? One Of My Favorite Movie Villains. Weaving Is\nAble To Capture The Charm For Me That He Does In All Of His Other\nRoles. <br><br>The Visuals Were AMAZING. They Manage To Capture What It's Like To Be\nIn A Computer For Me, With Video Game Style Graphics One Scene, And\nRippling Explosions Another.<br><br>This Is A Complete Package And A Definite Must-Watch. Trust Me, It'll\nBe Worth Your Time.\n"},
{"review": "\nMr. Anderson (Keanu Reeves) day time programmer, night time hacker code\nnamed Neo. Finds himself falling down the rabbit hole. Trying to find\nthe answer to what is the Matrix, he searches for Morpheus (Lawrence\nFishburne) to find the answers. What he finds is beyond any. Neo finds\nout that the world he know is just a computer simulation. Morpheus\nfrees Neo from the matrix and shows him that machines have taken over,\nand are using humans as an energy source. They keep us in line by\nkeeping us in a virtual reality world known as the Matrix. Neo learns\nthat he is the ONE and he can control the Matrix. It was prophesized\nthe One would come and free the humans from the machines imprisonment.\nThe movie show Neo progress from first being freed to learning he is\nthe One. With lots of kung Fu style fighting Neo learns that he can be\nfaster and better then what the computer sends to stop him.<br><br>The general theme is the world we know is an illusion. They use\nlighting to show the real world as a cold dark place, while the Matrix\nis bright and made to look like the world as of 1999. Similar movies\nare Alice in Wonderland, and the Thurman show. The Matrix is an\nadrenaline rush of action with a great story line to boot.\n"},
{"review": "\nThere is a reason why The Matrix is a classic. The (then) ground\nbreaking visual effects coupled together with on point acting and a\nclassic story revised for a new generation. If you plan on working in\nthe film industry and you have not seen this movie, than you need to\nmake time to see it. It's essentially a play by play on how to be\ncreative with equipment, and how to make a story appealing to modern\naudience's while giving it a lasting impression that can be enjoyed for\ngenerations. Regardless of what anyone thinks of the sequels or what\nthey may say about the story, should not turn you away from this great\nmovie.\n"},
{"review": "\nThis movie will not only fulfill your action/adventure needs but also\nreveals a whole new world of possibilities and questions that will have\nyou coming back for more. Your imaginative and creative part of your\nbrain will thank you again and again for this unforgettable sci-fi\njourney. Life lessons will be learned without even realizing it in the\ngreatest way possible. \"Sooner or later you're going to realize just as\nI did that there's a difference between knowing the path and walking\nthe path.\" The biggest realization in this movie is to free your mind.\nDoors are everywhere in life with endless possibilities within each\none, but it's up to each individual to walk through.\n"},
{"review": "\nThe was the best and the most complicated movie of Science fiction\ngenre I have ever watched, and still one of the best science fiction\nplot. I enjoyed every minute of the movie to the best and really worth\nit's rating. The was the movie introduced various visual effects for\nthe fighting scenes and it's special color and ambiance. The visual\neffects looks much modern than the time it was made. <br><br>With awesome fighting scenes and unique appearance of characters inside\nMatrix with special suits and sunglasses gives amazing look to the\nmovie. And the concept used for the movie is awesome and interesting. I\nbelieve it deserves much higher rating.\n"},
{"review": "\n\nOk, I'm getting sick of comments saying stuff like \"The Matrix is the\ngreatest film EVER MADE!\"<br><br>That's complete and utter bullturd. Yes, it had great cinematography and\neffects, yes it had a great soundtrack but NO WAY was the acting superb and\nNO WAY was the storyline great.<br><br>Take that storyline and stick it in any other action movie and you would\nleave feeling disappointed at the end. It's major selling point was \"What\nis\nthe Matrix? You have to see it for yourself.\" Come on, the only plot twist\nwas that thing to do with Cypher, and that wasn't greatly unforeseeable,\nthere's things like that in every frigging action movie.<br><br>The thing that set it apart was the ground-breaking camera effects, gnarly\nspecial effects and a funky soundtrack, as well as the costume design bit,\nwith all that leather and expensive sunglasses. Without this stuff, all you\nwould be left with is your average action movie.<br><br>I'm not saying it was a bad film at all, just not one of the greatest.\nHighly entertaining, great to watch with your mates, definitely one of the\nmost interesting films in recent years. But give me The Third Man, Memento\nor the Usual Suspects any day.<br><br>7/10\n"},
{"review": "\nIt's been a while since a movie has generated enough interest in me for\nme to watch it. \"The Matrix\" looked exciting enough in the trailers, so\nI decided to give it a look.<br><br>What I found was an amazing movie, with some of the greatest special\neffects I've ever seen. The camera angles really work for the action\nsequences and the choreographed fight scenes made me yearn for more.\nSay what you want about Keanu Reeves' acting.<br><br>He may not deliver the best dialogue, but his look can carry a film. He\nwas a great choice for the role of Neo.<br><br>Carrie Anne Moss was great as was the underrated Laurence Fishburne.<br><br>I highly recommend this film for those who are a fan of visually\nstunning movies. It will blow away your senses...\n"},
{"review": "\nThe Matrix is an action packed, special effects driven master piece\nthat is sure to catch the attention of any futuristic film critic.\nSeveral chase scenes utilize cross-cutting techniques to establish\naction occurring in two different locations. As I watch this film, I am\nreminded of two films from memory -Enter the Dragon (1973) and Stand by\nMe (1986). Both films reiterate the theme from Matrix, struggle with\nchoice and the consequences of those actions. Spoiler Alert: Neo,\nplayed by Keanu Reeves, is a software writer who struggles to find his\nplace in the world and as a result turns to computer hacking to escape\nhis mundane life. At the party Neo is approached by Trinity, played by\nCarrie-Anne Moss. Trinity is driven by her love for Neo and her\nunwavering loyalty to Morpheus (Lawrence Fishburn). Imaginative\nMise-en-scene is created during the first scene between Neo and\nMorpheus. Morpheus can be considered a profit; he predicts the coming\nof \"the one who will save Zion.\" Morpheus offers Neo a life altering\nproposition-a choice between taking a red pill (which reveals the truth\nof the Matrix) or the blue pill (which will doom him to the old life\nwhich Neo struggles to escape from). Neo's adversaries are a group of\nthree steely faced agents simply known as \"The Smiths.\" The Smiths are\nagent programs who keep order within the Matrix by dispatching their\nown form of law and order. Throughout the film as Neo, Morpheus, and\nTrinity battle the Smiths, Neo subconsciously begins to believe in\nhimself and the power he holds inside. By the final show-down, Neo has\nmiraculously developed a skill to stop bullets. In each situation he\ndiscovers that the path he wants has been laid in front of his feet\nlike a red carpet. The only thing stopping him from taking advantage of\nthe gifts bestowed upon him, is his own reluctance to \"go for it.\"\n"},
{"review": "\nThe Matrix is the best ever movie's. This movies was blow-ups everyone\nmind. The best technology ever use on the movies. Keanu Reeves is the\nbest actor's. I hear from someone, In Greek Mythology Morpheus is the\ngod of dreams. Some personal information can be seen on Thomas\nAnderson's \"criminal record\" that Agent Smith glances at when he\ninterrogates Neo: The last update to the file was July 22, 1998 Neo's\ndate of birth is \"March 11, 1962\" Neo's place of birth is \"Lower\nDowntown, Capital City\" Neo's mother's maiden name is \"Michelle\nMcGahey\" Neo's father's name is \"John Anderson\" Neo attended \"Central\nWest Junior High\" and \"Owen Paterson High\" (named after the film's\nproduction designer). Recommended movies.\n"},
{"review": "\nHave you ever felt, with every fiber of your being, that something was\njust not quite right? That something or more correctly someone(s) were\nmanufacturing events, and you know what events I'm referring to, to\nmake our reality a living hell and there is simply no logical reason or\nexplanation for it? Well the Matrix is a possible explanation (doubtful\nbut possible although I have a much more cogent explanation). Every\naspect of this film was groundbreaking! The soundtrack was impeccable,\nopening with Rob Zombie's Dragula, followed by others like Manson's\nRock is Dead, Clubbed to Death, Rage Against the Machine's Wake up,\netc. it simply was a groundbreaking soundtrack with no equal. Has\nLaurence Fishburne ever been better in anything else? His performance,\nas well as his co-stars, was very, very good but his stood out for me!\nAn amazing film that takes you on a mind blowing ride of possibilities!\n"},
{"review": "\nThe film's story follows Thomas Anderson (Neo), a computer programmer\nby day and a hacker by night. When another hacker named Trinity\ncontacts him she tells him a number of unbelievable, and seemingly\nimpossible things. When his questions just lead to more questions he\nagrees to meet a man named Morpheus. Neo is given a choice, learn the\ntruth about what he calls reality or stay blissfully ignorant to the\ntruth. After choosing \"truth\" he finds the real world as he knows it\nisn't real at all. It seems that in the early 21st century, there was\nan all-out war between human beings and advanced machines, resulting in\nthe triumph of artificial intelligence. Freed from the false world \"The\nMatrix\", Neo is ready to do battle with the forces that made the world\nwhat it has become.\n"},
{"review": "\n\nPeople who enjoy this film and consider it the ultimate in science fiction\nfilms haven't (A.) seen enough good films to judge or (B.) really have no\ninterest in a well written screenplay or characters that have depth and\nemotion. The Matrix is like Independence Day all over again, extravagant\nspecial effects but no character development or half way decent writing. I\ncringed when I heard some of the cliches used throughout the film. And did\nnobody notice that most of the main characters introduced played no real\nrole in the plot? This movie needed only four people, Neo, Trinity, the\nagent, and Laurence Fishburne. The other characters were added for either no\nreason or just terrible comic relief. Won four Oscars (swept every nominated\ncategory) for Visual Effects, Sound, Sound effects editing and Editing. A\nsadly overrated film.<br><br>**\n\n"},
{"review": "\n\nPeople who enjoy this film and consider it the ultimate in science fiction\nfilms haven't (A.) seen enough good films to judge or (B.) really have no\ninterest in a well written screenplay or characters that have depth and\nemotion. The Matrix is like Independence Day all over again, extravagant\nspecial effects but no character development or half way decent writing. I\ncringed when I heard some of the cliches used throughout the film. And did\nnobody notice that most of the main characters introduced played no real\nrole in the plot? This movie needed only four people, Neo, Trinity, the\nagent, and Laurence Fishburne. The other characters were added for either no\nreason or just terrible comic relief. Won four Oscars (swept every nominated\ncategory) for Visual Effects, Sound, Sound effects editing and Editing. A\nsadly overrated film.\n"},
{"review": "\n..........................................................from\nPasto,Colombia...Via: L.A. CA., CALI, COLOMBIA.....and ORLANDO, FL <br><br>The Wachowski brothers certainly have a handle on the art of film\nmaking for the new millennium! 20 or 30 years in the future, a plethora\nof both historical and imaginary virtual world venues available at your\nfingertips, via your virtual reality headgear, you won't be asking\nyourself, once immersed in the world of your choosing, \"Wait, how did I\nget here and why am I here?\" <br><br>MATRIX illustrates just how insightful and prophetic Marshall McLuhan's\nassertion \"The Medium is the Message\" has proved to be! Does Matrix\nglorify violence? Is it really original? Does it border on blasphemous?\nMost of the discussion and critique of MATRIX really seem to miss the\npoint entirely. MATRIX is the essence and epitome of style...not\nsubstance.<br><br>Through a seamless symbiotic blending of diverse visual and auditory\nelements, most notably the 360º sequential surround photography of\nartfully choreographed and precisely executed human action scenes, the\nWachowski's have achieved a true re-definition of the cinematic\nexperience, on their own terms.<br><br>Engaging, engrossing and bombarding your senses with their signature\nstyle, ultimately transporting you to a virtual world much more\nconvincing than any drug-induced one. MATRIX clearly speaks to us in a\nnewly formatted cinematic language. My recommendation: Put aside any\nnegative preconceived notions and just listen....<br><br>10* STARS*....ENJOY/DISFRUTELA! <br><br>Any comments, questions or observations, in English or Español, are\nmost welcome!\n"},
{"review": "\nIt's way to long movie to watch and enjoy with it. i liked visual\neffects, it was awesome 17 years ago, but now it's not a big deal, so i\nhave to rate it with 6. story is garbage in my opinion, and there is\nmany mistakes in movie. 2 h and 15 m is too long for this movie, i was\nbored and almost Falled in sleep in half of movie. there is good action\nscenes but only in moments and not in whole movie. Im 'not' gonna talk\nabout acting, it was normal except Keanu, i really like Keanu, but he\nwas stupidly confused in this movie, he was exactly like Ted Logan.\n*SPOILERS* i really didn't liked one scene in this movie, when Neo was\nalmost killed by agent smith, i think he was pretty dead but it does\nnot matters, trinity kissed Neo's body and he came alive?! what the\nf###? i Think'd i had Deja Vu but then i remind i already has watched\nsnow white and seven dwarfs. i really didn't get it he came alive when\ntrinity kissed him because he was chosen? Im done.\n"},
{"review": "\nThis movie is one of my most favorite ones. I really like the concept\nof the movie, where we live in some kind of dream world called the\nMatrix and we can escape this to get into the real world. Also I like\nthe fact that Neo the protagonist of the movie grows into his character\nas being The One, and has to save mankind. It's kind of like the story\nin many religions where one person is the savior and that there's an\noracle telling the person how to be this. Just like in the Matrix where\nthere's an oracle setting Neo on the path to become The One. The whole\nconcept of this all is what makes this such a great movie for me, plus\nit has a lot of great action scenes, like the on in the entrance hall\nof an office building, where they go and save Morpheus.\n"},
{"review": "\n\nAndy and Larry Wachowski's The Matrix is an unbelieveable achievement.\nNot\nonly in  the visual sense,  but in storytelling, the way society is, and\nmuch more.  And, Keanu Reeves is almost good here.<br><br>Reeves playes 2 people in one- Thomas A. Anderson, a regular Joe who is\njust\nworking it today's society.  The other is Neo, a comuter hacker who has\nbroken every single known computer hacking law.  But, he soon meets\nMorpheus, played with great mysticism and wiseness by Laurence Fishburne,\nwho brings Neo down the rabbit hole to tell him the truth about the world;\nwe are living in a world called the Matrix, which uses out brain energy to\ntrun us into batteries.  Unbelieveable to be sure, but it is incredibly\noriginal story wise, as it sprawls into something every average movie goer\ncan appreciate- hard boiled, visually and bloody packed action, gore and\nviolence.<br><br>The best part though is that this film breaks many boundaries in\ntechnology\nand (with it's 4 Oscars for editing, sound, sound editing and visual\neffects) and deserves every bit of credit it gets.  True, some might find\nthe plot confusing and boring and true it isn't for all tastes.  But if\nyou\ncan like the story and the action, you've got the key to a fantastic\npicture, otherwise it is another action flick (great action\nnever-the-less).\nKudos to everyone who worked on the film, making one of the best films of\nthe year, decade and of sci-fi film history.  A++\n"},
{"review": "\nA large part of the appeal of 'The Matrix' for me was the special\neffects and action-packed scenes. But, on reflection, part of the\nappeal is also its philosophical and religious underpinnings...<br><br>When asked whether Buddhist ideas influenced them, the Wachowski\nbrothers offered an unqualified \"Yes!\" and at a very basic level, the\nmovie portrays two levels of reality: our everyday existence and a\ndeeper, more significant, underlying reality (the matrix). This is very\nmuch like the Two Truths in Buddhism: relative truth, in which\neverything is perception, and ultimate truth which is the way things\nreally are (objective reality). <br><br>Because of our ignorance, we mistake the everyday world for something\nreal and objective, and this is the cause of our suffering. As in 'The\nMatrix', breaking through relative truth to direct contact with\nultimate truth represents a high spiritual attainment, some would say\nenlightenment, an awakening. (Remember the message on Neo's computer\nscreen: \"Wake up, Neo!\")<br><br>Mahayana Buddhism suggests that there are great spiritual warriors\n(like Neo?) who are walking the path from ignorance to enlightenment,\nand who can in turn guide us on the path.\n"},
{"review": "\nWith more than a billion dollars in ticket sales worldwide, it's\nabundantly clear that an awful lot of people fall into the former\ncategory. So, without doubt, \"The Matrix Revolutions\" will make\nmillions of additional dollars.<br><br>However, in the spirit of full disclosure, I fall firmly into the\nlatter category.<br><br>Before you start sending nasty e-mails -- and believe me, I'll get them\n-- I do think the \"Matrix\" series has been revolutionary in terms of\nspecial effects and the use of groundbreaking computer-generated\nimages. The mysterious Wachowski brothers, Andy and Larry (who wrote,\ndirected and executive-produced all three films), have created the\nvisual gold standard for every action/sci-fi flick that has followed\ntheir 1999 original. The action and the images are truly breathtaking.\n"},
{"review": "\n\"The Matrix\" is a virtual film full of cyber action and kinetic\nexcitement! The special effects are Incredible. The fight choreography\nwell placed. Even the sound effects that are edited with each punch,\nkick, hit, and miss, are captivating. This is one of my favorite films!\nThe casting director was genius with every character that was cast for\neach role. The script and plot was very well put together and\nintriguing to keep the viewer glued to the TV screen. The animation of\nbullets flying and flying martial arts moves steal the show. Even tho\nthis movie was full of special effects, it still gave you a real sense\nof fighting and battles in the near future. Basically this movie hinted\non our future generation of the unknown possibility.\n"},
{"review": "\nThis movie was a stepping stone for action cinema all over the world.\nWith revolutionary visual effects and a solid story that if you analyze\ndeeper is a story about the second coming of Jesus and the end of days.\nThe cast was excellent, the characters were carefully crafted and used\nin a very smart way to complement the final main plot but at the same\ntime develop completely separated stories that were incredibly\ninteresting and worthy of attention. On the downside, at moments the\nstory is repetitive to the point one can lose interest for some time.\nThis is overcome by incredible action scenes and plot twists that can\ntake your breath away. Overall a really good movie.\n"},
{"review": "\nIn all honesty I don't think this film is well acted, every member of\nthe cast is wooden and stale with the exception of Hugo weaving who is\nover the top campy. The love story in this film is pretty terrible and\ncomes out of nowhere and as also dammed by the fact the Keanu Reeves\nand Carrie Anne-Moss have no chemistry. Yet I still love this film as\nevery other aspect works and the negatives surprising don't seem to\ndetract from the viewing experience. The action is spectacular and\nmesmerizing, the direction is strong, cinematography is stylized\nappropriately and it's never boring. While I don't think it's he\nmasterpiece everyone else thinks it is I do believe that it's a\nfantastic sci-fi action film that is constantly entertaining.\n"},
{"review": "\nThis movie is a very popular movie.at the starting of movie i felt it's\nvery beautiful Subject. Then the next part starts.movie is full of\njoy.if we talk about the theme of the movie, then i want to tell a one\nthing theme is good as well as characters of film also good.They act\nwell according to the theme.i think music of movie is average. Theme\nmusic was very nice.because it is matched with emotions.besides, the\nstory all around about the main theme.stunts were dangerous but most\nstunts are well.moreover the selection of sets of movie are amazing.The\ntechnical terms which used in movie were nice.moreover end parts are\nnice also. I rated this movie with 7 stars.\n"},
{"review": "\nFirstly i want to Talk about the starting part of the movie Matrix.\nMost scenes of starting  part were just amazing and others were near\nabout creative things.many casual things are shown in some scenes.next\nI want to tell the two things, firstly the classic views of movie is\nawesome and secondly there were some limitations also some scenes\nregarding editing.The theme music of this movie is presents something\nnew one and i felt this is very hard job.But more interesting \nvariations can be added according to emotions, specifically in\nmotivational scenes.The mid part of movie shows more interesting\ntasks.at the of movie i felt end parts were some effortless things.\n"},
{"review": "\nThe Matrix was pretty groundbreaking wasn't it? It showed the world\nthat big budget action movies can be philosophical. That said, looking\nat it now, it does have a dated appearance. Does that make it any less\na film. Not exactly, but it's easier to laugh at some of the things\nabout it. We've all seen people make fun of Keanu Reeves going,\n\"Whoah.\" That said I still like the movie. It's a fun action flick that\nalso makes you think, and I like that. The story was good, the effects\nare good, most of the acting is good (most of it), and I really do\nappreciate what this film did for the action genre. It wasn't unheard\nof for action movies to be philosophical, it just wasn't as common as\nit now. Today a lot of action movies can double as thinker movies, and\na lot of that is down The Matrix. If you haven't seen it, you should go\ncheck it out.\n"},
{"review": "\nThis movie may be future of human being. Machine control human beings.<br><br>At present, it is said artificial intelligence can control human\nbeings. To see future, this movie is worth watching. Neo is ordinary\nman, but will save the world from machines.<br><br>Story is very good. I think this film made visual effects popular.\nWithout visual effects, we could not watch this movie.<br><br>this is my first movie on DVD. this is my first movie on Blu-ray.<br><br>this is one of the most impressive movie for me. One film changes\nsomeone's life.<br><br>This movie is a prediction. Now, smartphone controls human beings. Real\nworld is coming close to this movie.<br><br>I hope machine help human beings, not control.<br><br>Anyway, this movie is worth watching.\n"},
{"review": "\nThis movie came out the same year as The Phantom Menace (1999). So we\ncan say that at least one innovative and epic sci-fi came out of 1999.\nThat one is The Matrix. The One.<br><br>So the Matrix is a sci-fi that revolves around the truth about our\nworld and the truth that Mr. Anderson or \"Neo\" must discover. Apart\nfrom sounding preachy, this movie is host to a ton of symbolism, but at\nthe same time makes for an emersive and entertaining experience.<br><br>The digital effects are astounding for its release date and are put to\ngood use, creating some of the Awesomest moments in cinema. Every knows\nthe bullet dodge. And everyone loves it too.<br><br>Keanu Reeves' offerings as an actor are not to be over looked in this\nfilm. I've always thought that Keanu makes a great action movie hero,\nand this movie confirms my beliefs.<br><br>All in all, the Matrix can be described in three words; creative,\ninnovative and BADASS. So follow Alice down the Rabbit-hole and take a\nlook at The Matrix. It won't disappoint.\n"},
{"review": "\nIf you're not big into understanding computers and how they work, this\nfilm may not make too much sense to you. The reason being is because\nthis production is set in a near-future point in time and\ncomputers/electronics are the main source of power. I believe what the\ndirectors were trying to say in this production is that we are all\n\"sleeping\" and what if we woke up? What if the we are all under\ngovernment control, being drugged to stay asleep and a program is\nhaving us all dream this same dream we call \"life\"?<br><br>In the Matrix, Neo wakes up and finds a world nothing like the world in\nthe dream he has been having all his life and he is \"born\" again into\nthe real world and reprogrammed.\n"},
{"review": "\nTechnically very rich. It takes us in the moment of reality and\ncomputer program. The Matrix slams you back in your chair, pops open\nyour eyes and leaves your jaw hanging slack in amazement.<br><br>\"The Matrix\" is a visually treat for all the cyberadventure, full of\nkinetic excitement, but it retreats to formula just when it's getting\ninteresting. <br><br>It is a Classic Sci-Fi and a step above the average movie. The Matrix\nis one of the few films that you'll find in almost anyones movie\nlibrary. This is no surprise however, because the Matrix is a step\nabove many sci-fi movies like it. The plot does not falter at any point\nduring the film and the acting is superb. The shootouts are\nexhilarating and the special effects were ground-breaking. I'd\nrecommend the Matrix to everyone. Action fans will be satisfied by the\nviolence and people looking for something more than just action will\nalso be pleased by the ideas and questions that the Matrix raises.\n"},
{"review": "\nThis is really nice movie. I liked all movie of this series. Use of\ntechnology is amazing. quality of site is wonderful. \"The Matrix\" is a\nvisually dazzling cyberadventure, full of kinetic excitement, but it\nretreats to formula just when it's getting interesting. It's kind of a\nletdown when a movie begins by redefining the nature of reality, and\nends with a shoot-out. We want a leap of the imagination, not one of\nthose obligatory climaxes with automatic weapons fire.<br><br>I've seen dozens if not hundreds of these exercises in violence, which\nrecycle the same tired ideas: Bad guys fire thousands of rounds, but\nare unable to hit the good guy. Then it's down to the final showdown\nbetween good and evil--a martial arts battle in which the good guy gets\npounded until he's almost dead, before he finds the inner will to fight\nback. Been there, seen that (although rarely done this well).<br><br>Too bad, because the set-up is intriguing. \"The Matrix\" recycles the\npremises of \"Dark City\" and \"Strange Days,\" turns up the heat and the\nvolume, and borrows the gravity-defying choreography of Hong Kong\naction movies. It's fun, but it could have been more. The directors are\nLarry and Andy Wachowski, who know how to make movies (their first\nfilm, \"Bound,\" made my 10 best list in 1996). Here, with a big budget\nand veteran action producer Joel Silver, they've played it safer;\nthere's nothing wrong with going for the Friday night action market,\nbut you can aim higher and still do business.\n"},
{"review": "\nThis is one of those films, that has so much meaning in it, its unreal!\nHowever, the action scenes are incredible, and the concept is original.<br><br>It starts with Neo (Reeves) living a dual life, one as a computer\nhacker, one as a standard 9-5 office worker in a technology\nconglomerate. After a strange dream, Neo awakens &amp; never quite feels\nnormal, always questioning the blandness of his life.<br><br>Once he is hacked, he is told to 'follow the rabbit down the hole',\nwhich is the proceeded by a knock on the door. Once he answers the\ndoor, he realizes it is just his friends asking him to join them on a\nnight out. Whilst he initially declines, Neo then spots a tattoo in the\nshape of a white rabbit, and decides to listen to the earlier message\nso he joins them on a night out.<br><br>The film contains everything, from great acting, good dialogue and my\nfavorite is an original story line. The idea that we, as humans, are\nhappy to continue working 9 to 5, whilst questioning our purpose on\nthis planet. Coupled with our increased dependency on machines in the\nmodern age means that the idea that machines will eventually supersede\nus is not a fairy tale concept.<br><br>The action is great, with some of the characters now becoming infamous,\nmost noticeably Fishburne's character Morpheus, seen as a sensei- type,\nbut one with an incredibly high intellect, that teaches to ask the\nright question then look for the right answer.<br><br>On the downside, this film contained too many action film moments where\nit was clearly possible to escape a fate, suspect a Judas-type moment,\nor to act faster and therefore make life so much easier on themselves!<br><br>Really great movie, which for me beckons the ultimate question: Would\nyou take the red pill, or the blue one?\n"},
{"review": "\nThe Matrix (1999): Dir: Andy Wachowski, Larry Wachowski / Cast: Keanu\nReeves, Carrie-Anne Moss, Laurence Fishburne, Joe Pantoliano, Hugo\nWeaving: Confusing film that assaults our senses with strange theories\nand exhilarating action sequences. Keanu Reeves is picked up by agents\nwho force a mechanical object in through his navel and he awakens in\nhis own bed. Laurence Fishburne informs him that the Matrix is\neverything around him. It is destined to keep people under control.\nReeves is presented with two pills. One will allow him to awaken\nwithout memory of the incident, and the other one allows him to\ndiscover whether or not he is the Missing Link. Directed by Larry and\nAndy Wachowski showcasing distracting action scenes and interesting\ntheories. This is certainly a departure from their earlier film, Bound.\nReeves is appealing as someone thrusts out of ordinariness into the\noverwhelming unknown. Fishburne makes for a fine instructor as he\nallows Reeves the freedom of choice but cautions him on the\nconsequences. In other roles are the electrifying Carrie-Anne Moss, and\nthe double-crossing Joe Pantoliano as the villain. Hugo Weaving also\nplays a villain named Agent Smith who has an array of special powers\nthat screws up more than one's brain. The action is exhilarating with\nthe most original combat scenes ever filmed. Overwhelming visual appeal\naccompany the symbolism. Score: 8 / 10\n"},
{"review": "\nThe reason why I gave this a 10 was not merely because I liked it. Not\nmerely because I thought it was cool and had a lot of action in it. No,\nthe reason why I liked it was because there was so much truth in it.\nThe idea behind The Matrix was that the \"real\" world is veiled to\nhumans. The world that humans live in is an world full of indulgence\nand ignorance. This connects to the beliefs of Christianity, and that\nthe world we live in is controlled by Satan, who wants us to believe\nthat we live in a good world. Because of this, we are blinded to the\ntruth. Neo and the other rebels connect to today's Christians, who\nunderstand this fact, and do their best to rebel against the enemy,\nwhich is the world they once lived in. This analogy that the directors\nused is great way to unveil the truth of the world, and for that reason\nI give it a 10.\n"},
{"review": "\nThe Matrix by the Wachowski Brothers is one of the best action films I\nhave ever seen. Along with great acting performances from Keanu Reeves\nand the always great Laurence Fishburne, they have managed to create a\nfilm that contains eye catching special effects, way ahead of its time\nand a storyline that teaches you the value of human life against its\nmass destruction. Hugo Weaving whom plays Agent Smith is the ultimate\nbad guy. His originality as a villain sparks up even more excitement\nwhen conflict starts between him and Neo (Keanu Reeves). It does not\ntake long for the action to start, which couldn't be better for a\ntypical action lover. The film has everything, action, thrills, martial\narts, superhuman abilities and love.\n"},
{"review": "\ni think this idea was original and gripping. i thought that the actors\nwere spot on and well cast and the story really captures ones\nattention. it plays with a common super hero gets the girl and invites\nyou to dream on your curiosity, most people can relate to having a\ndouble-life with an ultimate purpose where in your other life you're\nthis awesome powerful (what-ever) hero and you can be just like that\nregular guy who finally took a chance on himself and it works out\nbrilliantly. because the underlying story here which grips you is the\nselflessness in it all throughout every matrix movie. selflessness is\nawesome and powerfully emotional. each character represents walks of\nlife, its our same story thats been told the same way 1 million\ndifferent ways &amp; it still hooks you. i think it was a great and\npleasing remastered version none the less. :)\n"},
{"review": "\nVisually entertaining, thought-provoking and extremely well executed.\nThe Matrix has been on the top of my favorite films list for quite a\nfew years. I've heard a lot of people say it hasn't aged well, and I\nhave to strongly disagree and say that this movie was ahead of it's\ntime, making now (2014) a perfect time to watch it! While it's sequels\nstruggle to conduct a clear plot and fumbles around with countless\nloopholes in logic, the original film doesn't have a single story\nmistake (at least as far as I can think of!) and manages to follow\nthrough with intelligence and cleverness. Style! Did I mention this\nmovie has style? In more ways than one. Not to mention a dozen pop\nculture references, a solid cast, and unforgettable special effects.\nThe whole movie is laced with dialogue that becomes a brain game for\nthe audience, forcing them to think and ponder about whether or not\ntheir own world is real or not. I know when I first watched it, I\nstarted to get a bit paranoid! The overall atmosphere of the film is\none of awakening to your surroundings, the struggle between what people\ntell you to feel, and what you truly feel. Rebellion, the challenging\nof authority, being creative and the survival of human life. Overall,\nthe film is basically one big action packed, mentally stimulating and\ngratifying present wrapped with a bow that is trying to say in the\nbiggest way possible: You can do anything if you believe...<br><br>\"Don't think you are, know you are\" - Morpheus\n"},
{"review": "\nI could say this is a modern day allegory of \"The Cave\", but it is so\nmuch more. I believe the movie redefined the science fiction genre film\nfrom what I first saw it 15 years ago, and has even opened up new\ngateways for various philosophies.<br><br>In my opinion, this movie is all about taking chances and breaking free\nfrom the monotonous dealings of everyday life; along with making\nchanges to be free from the shackles of one's personal limit.<br><br>Another one of the themes it asks us: nothing is what it seems. It\ngives us a sudden realization of what is hidden from us from plain\nsight and the opportunity to see what's \"underneath\" the curtain of\nillusion. It gave us the idea to question ourselves and the potentials\nof our minds and our bodies.<br><br>Say what you will about Keanu Reeves, after 15 years I cannot picture\nanyone else for the role of Neo and that's saying a lot for the\ncharacter he has portrayed. He plays a convincing role of a frustrated\nman living a normal life until he takes the pill of salvation.<br><br>It is my number one best movie ever released, go see it!\n"},
{"review": "\nIn 1999, a worker named Thomas Anderson works for a major world\nsoftware company, but is also the hacker Neo(an anagram for \"One\", his\ntitle) by night. He is approached by an underground rebellion whose\nultimate goal is to give salvation to those trapped in a computer\nsimulation which shares the movie's name. This is the plot of the\nSci-Fi pinnacle of the 20th century, \"The Matrix\". The story is one of\nthe most unique of all time, and everything about the movie deserves\nthe immense praise. Lawrence Fishburne, Keanu Reeves, and others give\nthis movie a solid cast. The writing is solid and the many twists and\nturns the producers introduce make you think just to a certain degree\nfor it to be enjoyable and not overly confusing. If you are planning to\nwatch this be young ones, I would recommend 13 and up(the movie is not\ndeserving of its R- Rating, it is more PG-13). The Matrix is a very\nunique and fulfilling movie that will keep anyone on the edge and seat\nand guessing! Amazing!!! 10/10\n"},
{"review": "\nThis movie, which I find the Best of the Matrix trilogy, is an\ninnovation and a Pioneer in the field of Man-Machine relationship in\nthe human world. It very intricately brings out the Complex Equilibrium\nthat we ought to maintain, otherwise in presence of some 'Super\nIntelligence' we might find it very difficult to control the\nrepercussions, even if it's not like the Matrix story line itself. It\nsignifies the spirit of Human Survival against all the odds; and also,\nan urge to manifest one's desires as human, even in adverse\ncircumstances. Great acting by Keanu Reeves, Laurence Fishburne,\nCarrie-Anne Moss, Hugo Weaving, and others. Direction is of par\nexcellence, every bit of the movie mingles so well; and comes with\ngreat surprises. Awesome piece of work by The Wachowski Brothers.\n"},
{"review": "\nexcellent movie!<br><br>In the near future, a computer hacker named Neo discovers that all life\non Earth may be nothing more than an elaborate facade created by a\nmalevolent cyber-intelligence, for the purpose of placating us while\nour life essence is \"farmed\" to fuel the Matrix's campaign of\ndomination in the \"real\" world. He joins like-minded Rebel warriors\nMorpheus and Trinity in their struggle to overthrow the Matrix. \"The\nMatrix\" is a visually dazzling cyberadventure, full of kinetic\nexcitement, but it retreats to formula just when it's getting\ninteresting. It's kind of a letdown when a movie begins by redefining\nthe nature of reality, and ends with a shoot-out. We want a leap of the\nimagination, not one of those obligatory climaxes with automatic\nweapons fire.<br><br>I've seen dozens if not hundreds of these exercises in violence, which\nrecycle the same tired ideas: Bad guys fire thousands of rounds, but\nare unable to hit the good guy. Then it's down to the final showdown\nbetween good and evil--a martial arts battle in which the good guy gets\npounded until he's almost dead, before he finds the inner will to fight\nback. Been there, seen that (although rarely done this well).\n"},
{"review": "\nI personally think that the Matrix was and is still one of my favourite\nmovies today. I love watching science fiction movies but many do not\nlast in our memories or often talked about. There are many great\nimaginations originated from the Matrix, and one of my favourite was\nthe technical aspect.<br><br>From time to time, I sometimes still hear people referencing the\nmovie's bullet-time camera scene, to fighting scene, to the red pill or\nblue pill talk around the water cooler.<br><br>Since the creation of the Matrix, prices of consumer video cameras have\ncome down in prices and recently I am finding more people are putting\ntogether clips similar to the bullet time used in the Matrix. Some of\nthe videos are amazing giving viewers different perspective looking at\na single scene.<br><br>This is a good indication that the Matrix was well made and will be\ntalked about for many more years to come.\n"},
{"review": "\nMy god my mind has exploded by the pure action of this movie. I love\nthe action and I think that it is giddily so funny to watch. The bullet\ntime is great. The jumping is great. The shooting is great. The writing\nis \u0085. good maybe. Okay so the idea of The Matrix is good. It's probably\nbeen done before. The whole idea is that the Matrix is a reality\ncreated in a computer for humans to live in. I found this intriguing\nand enjoyed this premise. But the writing. It's alright. This movie is\ndriven by action. The writing is in the backseat and the action is\ndriving the car. The movie is full of philosophical talking and one\nliners. And it's not great. It works, but it's not great. The acting is\nactually really good for a film like this. Keanu Reeves does a really\ngood job. Laurence Fishburne is awesome as Morpheus. Though there is\nHugo Weaving. He is an incredible villain that is benefited by the\nstrong part of the movie the action. He is meticulous and menacing\nwhenever he is on screen. The other cast is good, but not great.\nHowever we should really talk about the better thing about this movie.\nThe action. Holy cow. Mind-blowing. Okay the tech is a little bit\nprimitive by now, but it really is effective. I mean the bullet time.\nThe slow motion work. It's amazing. It's so fun to watch. I will say\nthat that the settings of the film are also very creative. The way the\nMatrix works, the scout ship. I love it. I will say that the costume\ndesign is a little bit dated. The black trench coats are fun, but they\nare a little but dated. I will say that my liking for this film is\ndampened by the fact that I LOVE the Wachowski's better crafted and\namazing Cloud Atlas. Just because that movie is incredible and the fact\nthat this was also the Wachowski's other film I just had trouble with\ntaking this move as seriously. But its good. I give The Matrix an 8 out\nof 10\n"},
{"review": "\nOne of the best movies ever, classic during 1999. Cool, groundbreaking,\nmind-twisting and simply phenomenal! A landmark science fiction\nmasterpiece, that set a whole new standard for out-of- the-box\nfilm-making. Keanu Reeves may be dryer than a stick under the scorching\nCalifornia sun, but I still think he was one of the greatest of all\npossible casting choices for Neo. The true scene-stealer of the film,\nhowever, is the mesmerizing brilliant Hugo Weaving, as the chilling and\ncalculative Agent Smith. He isn't the typical villain, but an extremely\nintelligent baddie, whose every utterance is a fascinating piece of his\nmulti-faceted, yet cold-hearted mind. Of course, the real crowd-drawer\nhere though, is the visually spectacular special effects.\n"},
{"review": "\nEven in 2014 this film has something magic. With his stunning effects\nand a mind blowing story-telling, story-structure and bad-ass\ncharacters this movie is still one of the best movies in the world.\nJust the confrontation with philosophical questions of our life and the\n\"fantasy of science-fiction\" makes this movie to one of the must-seen\nfilms in history. I don't think that Matrix just got his success with\nthe really cool presentation, more important the mix of the really well\ntold story, character development and environment complexity gives the\nmovie the required plus to be a 10 Star movie. I even think that the\nnext two movies of the Matrix trilogy are really good too. I would give\nthe whole Matrix-trilogy a 10 out of 10!\n"},
{"review": "\nthe best movies of all,But the movie has plot as well. It has\ncharacters that I cared about. From Keanu Reeves' excellent portrayal\nof Neo, the man trying to come to grips with his own identity, to\nLawrence Fishburne's mysterious Morpheus, and even the creepy Agents,\neveryone does a stellar job of making their characters more than just\nthe usual action \"hero that kicks butt\" and \"cannon fodder\" roles. I\ncared about each and every one of the heroes, and hated the villains\nwith a passion. It has a plot, and it has a meaning...and lo and\nbehold, a plot does help the fight scenes! Just try it, if you haven't\nseen the movie before. Watch one of the fight scenes. Then watch the\nwhole movie. There's a big difference in the feeling and excitement of\nthe scenes- sure, they're great as standalones, but the whole thing put\ntogether is an experience unlike just about everything else that's come\nto the theaters. Think about it next time you're watching one of the\nmore brainless action flicks...think how much better it COULD be.\n"},
{"review": "\nWhen this movie first appeared in the theater I watched it without\nexpecting that I would become so addicted to it. Since then I must have\nwatched it over a hundred times. Why? Well because I couldn't\nunderstand it at first, so it took me 2-3 times just to understand what\nis going on. Not that I'm stupid or something, but every time I watched\nthe movie with a different perspective in mind and \"a different pair of\neyes\". This is one of those rare movies that makes you want to watch it\nagain so you can see the beginning one more time and confirm the theory\nthat you concluded in the end of the movie.<br><br>The casting crew is great, although I don't know what will it have come\nout if Will Smith played the main character. The visual effects are\ngroundbreaking for the 20th century and have set a standard for the CGI\ngenerations to come. Great story line, maybe one of the best futuristic\nstory since... IDK... Star Wars, probably inspired by a bunch of\nJapanese anime/manga like Ghost in a Shell. That whole recipe mixed\nwith great sounds/music makes an all time best!\n"},
{"review": "\n\"The Matrix\" is a visually dazzling cyberadventure, full of kinetic\nexcitement. <br><br>I've seen dozens if not hundreds of these exercises in violence, which\nrecycle the same tired ideas: Bad guys fire thousands of rounds, but\nare unable to hit the good guy. Then it's down to the final showdown\nbetween good and evil--a martial arts battle in which the good guy gets\npounded until he's almost dead, before he finds the inner will to fight\nback. Been there, seen that; however this one is an exception, as it\ndone very well.<br><br>Still, I must not ignore the movie's virtues. It's great-looking, both\nin its design and in the kinetic energy that powers it. It uses\nflawlessly integrated special effects and animation to visualize\nregions of cyberspace. It creates fearsome creatures, including\nmechanical octopi. It morphs bodies with the abandon of \"Terminator\nII.\" It uses f/x to allow Neo and Trinity to run horizontally on walls,\nand hang in the air long enough to deliver karate kicks. It has leaps\nthrough space, thrilling sequences involving fights on rooftops,\nhelicopter rescues and battles over mind control.<br><br>And it has performances that find the right notes. Keanu Reeves goes\nfor the impassive Harrison Ford approach, \"acting\" as little as\npossible. I suppose that's the right idea. Laurence Fishburne finds a\nbalance between action hero and Zen master. Carrie-Anne Moss, as\nTrinity, has a sensational title sequence, before the movie recalls\nthat she's a woman and shuttles her into support mode. Hugo Weaving, as\nthe chief Agent, uses a flat, menacing tone that reminded me of Tommy\nLee Jones in passive-aggressive overdrive. There's a well-acted scene\ninvolving Gloria Foster as the Oracle, who like all Oracles is\nmaddeningly enigmatic.<br><br>\"The Matrix\" did not bore me. It interested me so much, indeed, that I\nwanted to be challenged even more. I wanted it to follow its material\nto audacious conclusions, to arrive not simply at victory, but at\nrevelation.\n"},
{"review": "\nA must-see among genre fans, especially guys in their teens and 20s,\nfor whom the script's pretentious mambo-jumbo of undergraduate\nmythology, religious mysticism and tech-babble could even be a plus\nrather than a dramatic liability. Its a high tech sci-fi must see film.\ninspired by different sources (including Japanese anime), The Matrix is\na new kind of movie, a visionary mixture of technology, philosophy and\nthrilling action.Where other films are done in by the freedom offered\nby computer effects, The Matrix integrates them beautifully.Exemplifies\nthe idea that a sufficiently cool outcome justifies all of the tortured\nnarrative it takes to get there.\n"},
{"review": "\nKeanu Reeves stars as Thomas Anderson, a skilled Computer\nprogrammer/Computer Hacker who goes by the name of Neo. The film,\nall-in- all, is absolutely incredible. I have never seen such an epic\nscience- fiction film with as much intense action, scenes of fighting,\ninspiring acting, shock and awe and...and just so much more. The\nWachowski Brothers really made this film what it is. Them, Reeves and\nof course the supporting cast, Hugo Weaving, Carrie-Anne Moss and\nLaurence Fishburne. Hugo Weaving as the co-star casting as the main\nvillain \"Agent Smith\" trying to destroy the city of Zion and keep\nhumans from making the escape from the Matrix. This film is entirely\nbrilliant and it has one of the highest ratings, as you'll see, on\nIMDb. It's certainly in my top 3 science-fictions of all-time. Any\nSci-Fi fan will love this film and this is seriously the best of all\nthree parts. A masterpiece of a film and I would not be able to\nunderstand how anyone could dislike it.....though, I have never met\nsomeone who has.....! 10/10.\n"},
{"review": "\nThis trilogy is very beautifully made and thought, in an alternative\nuniverse, where machines maintain humans in a so called world \"Matrix\".\nThere characters were well chosen. Script was well made. Graphic\nscenery was well made as well. Great movie, I still watch it now a\ndays. Simply amazing! I really enjoy movies that are made/created in an\nalternative dimension/universe. Interesting thought, us being\ncontrolled by machines/users, as we can control Sims in The Sims games.\nVery unique distinction from other movies. This trilogy, can be very\neasily watched in a whole day, and you still could ask for more, what\nhappen after the end? Very nice movie, recommend it to anyone.\n"},
{"review": "\nI love this movie! it's action packed and great for anyone, considering\nage. You may find it confusing, but most is explained in the following\nmovies. There are many parts, for instance, when Neo first leaves the\nMatrix that make you think. The use of digital effects is stunningly\nrealistic and wowing. If you end up enjoying this movie, you would\nenjoy the sequels, when you follow Neo and the others through the\nMatrix, fighting the machines that did this to them. As the brave man\nNeo is, he can prove to the world, of man and of machine, that he\nindeed is the chosen one.i give this movie a 9 out of 10 and believe it\nis defiantly worth watching.\n"},
{"review": "\nI watched this movie as a child, way before i should have seen it to\nunderstand it fully the first time around.<br><br>That has created an effect that i believe that has changed me all the\nway through today. I didn't get it the first time, so i was curious, so\ni watched it again, and again, and again. Until i understood it. It's a\ngreat way to question your existence when you're down (sorry to hear\nthat btw) and an amazing way to confirm it if you feel confident (you\ngo girl!)<br><br>This movie had the ability to change me and I believe those are the\nmovies worth watching! So go ahead!\n"},
{"review": "\nLove all these movies. Hoping they make another! Possibly use all the\nsame actors and not so much time on fight scenes, although they are\nspectacular. Maybe do one before, showing how the Matrix was started\nand focus mainly on that. Love all these movies. Hoping they make\nanother! Possibly use all the same actors and not so much time on fight\nscenes, although they are spectacular. Maybe do one before, showing how\nthe Matrix was started and focus mainly on that.Love all these movies.\nHoping they make another! Possibly use all the same actors and not so\nmuch time on fight scenes, although they are spectacular. Maybe do one\nbefore, showing how the Matrix was started and focus mainly on that.\n"},
{"review": "\nThomas Anderson is a man searching for answers, by day a respectable\ncomputer programmer, by night the infamous hacker known only as Neo.\nWhen fate brings him to the attention of the man simply known as\nMorpheus, his entire perception of reality is shaken and the truth is\ndiscovered about the true nature of the very world and mans existence\nwithin it. Neo will learn of the prophecy foretelling the coming of the\nOne and the forces opposed to him and all humankind, and the answer to\nthe question, what is the Matrix?<br><br>One of the most visually appealing films to have graced the silver\nscreen. A truly original and unique film going experience with mind\nbending action, the Wachowskis bring the first of their mind bending\ntrilogy to the screen. Philosophical at its very core that leads one to\nbelieve that this ground breaking film is more than just a simple\naction film. Highly original in its story and well acted by its\nprincipal players is a must see for any fan of film. One of those films\nthat must not only be viewed but experience by the viewer. Reeves and\nFishburne fit into their roles respectively and do a masterful job of\nbringing the heroism, suspense and intrigue to the forefront. Reeves\nwho isn't known for his stellar performances, really outdoes himself\nand what may go down as his most iconic and famous role of his career.\nThe film is a mind bending ride that deliverers in its attempt to not\nonly sweep away the viewers but truly invests the viewer in not only\nthe story and characters but in the alter techno fantastic world of The\nMatrix.\n"},
{"review": "\nThe Wachowski brothers directed this innovate blockbuster hit that\nstars Keanu Reeves as Mr. Anderson, who is an ordinary computer\nprogrammer suddenly thrust into a new reality(which he had always\nsuspected) when government agents led by Mr. Smith(played by Hugo\nWeaving) target him for interrogation after he is contacted by computer\nhacker Morpheus(played by Laurence Fishburne) about his true destiny as\n\"The One\", renamed Neo, who will lead the enslaved humans to rebel\nagainst their machine masters who have created a false world in order\nto fool and control humans. Only by escaping this state can Neo begin\nthis fight... Exciting and thought-provoking film filled with fantastic\naction scenes and memorable characters. Fine acting too; co-stars\nCarrie Ann-Moss as Trinity, and has a thrilling ending, though two\nsequels would follow.\n"},
{"review": "\nReeves is the \"chosen one\" to defeat a bunch of supercomputers\ncontrolling the world with a matrix. Some of the clichéd dialog tells\nyou that the plot and characters are just background music to show off\nsome really huge and grossly ugly special effects. I especially dislike\nthe scene where Reeves and his female partner break into the high\nsecurity skyscraper to defeat the forces that have imprisoned Morpheus\n(Lawrence Fishburne}. He is armed the neck with weapons and ammunition\nto blast hundreds of people away. I cannot help but think how this\nmight have inspired James Holmes when he went to a Batman movie in a\ncostume concealing a similar arsenal around his chest to shoot twenty\nor thirty people. People who produce these ultra violent shows are\nmechanics who never think about what the end results of their work\nmight be.\n"},
{"review": "\nthis it the best film still now. i enjoyed every single part of this\nmovie.<br><br>NEO i love you. we want you back. matrix is in inside me.<br><br>Oscar WINNER: Best Editing Best Visual Effects Best Sound Best Sound\nEffects<br><br>A theatrical blockbuster at the time of its release in 1999, The Matrix\nproved to be a mind-blowing advancement in cinematic visual effects.<br><br>Set in the 22nd century, The Matrix tells the story of a computer\nhacker (Keanu Reeves) who joins a group of underground insurgents\nfighting the vast and powerful computers who now rule the earth.<br><br>In addition to amazing effects, the stellar cast, including Laurence\nFishburne, Carrie-Anne Moss, Hugo Weaving and Joe Pantoliano, helped\nmake The Matrix a modern sci-fi classic.\n"},
{"review": "\nWho hasn't seen this movie and what can be said that hasn't already.<br><br>This movie takes an original idea, computer graphics, great characters,\ncharismatic actors, a wonderfully imaginative script and turns science\nfiction on its head.<br><br>Who is \"The One\" destined to change the plight of mankind. Does he even\nexist?<br><br>Do not miss this film. Sci Fi fan or no this movie delivers. This movie\nhas a lot of action and there is considerable violence but the violence\nis so beautifully choreographed that it becomes its own art form. My\nmost vivid memories are of the savagery somehow turned into alluring\nmusic. Who can forget the shot of the Vulcan gun firing from the\nhelicopter hovering outside the office building as it shreds a room\nduring the rescue of Morpheous? Its one of the most beautifully shot\nscenes in my memory topped only by the slow motion storming of the\noffice building by Trinity and Neo.<br><br>A small group of dissidents set out to free mankind from the grip of an\nomnipotent computer. Will they succeed? Is there any point to resisting\nanyway? We'll just have to see.\n"},
{"review": "\nThe Movie is the best Action and Science Fiction movie I ever seen. I\nloved it so much along with the sequels. I Even brought the Four\ncollection case of the movies. I will watch them every once in a while.\nI like the main character (Neo), who I use to wish when I was young\ncould meet his actor Keanu Reeves. I thought Morpheus was good but I\nthought he looked like a guy you can not trust which is why I\nunderstand Neo did not. Trinity was good. I like her in this film\nbetter than the sequels. She was a hot-head in 2 and 3. Agent Smith was\nkind of cool but I was annoyed that Him in the rest of the Agents were\nalmost unbedable. It was great and fun to watch and it is definitely a\ngood prequel to watch first before you see a sequel.\n"},
{"review": "\nI recommend this film, it was and it still is one of my favorite movie\nof all time. Neo's transformation up until the last movie was pretty\nmuch the same though. If you like fighting, shooting, philosophical\nquestions, awesomeness, slow-mo, then this is the movie for you. Neo\nflying at the end was a bit to much but i guess it fits with him being\nable to conquer the world that once controlled him. the part where NEO\nenters Agent smith, that part was a bit puzzling for me, I didn't\nunderstand why he would have to do that. Neo needed a new body? he came\nback to life. what was the purpose of he going in to SMITH? I'm sure\nNeo didn't know he was going to destroy SMITH by going into his body.\nor else he would've done the same to the other agents that were in\nfront of him. Then again, he was in a hurry to save Trinity and\nMorpheus. Oh that's right he was, instead of running to his right to\nget the phone which he had enough time to do. He goes stands there,\nstops the bullets, runs into SMITH... Trinity and Morpheus hold on...\nscares the other agents away, then he runs back to the phone. i guess\nwhat I'm trying to say is that the ending could have been better and\nmore rewarding. Neo is basically immortal in the Matrix, his heart\nstopped, nope, come back to life he says. Smith tried to control him,\nnope, denied he says. If Neo can defy physics by flying, by stopping\nbullets in mid air, and coming back to life. why not use that power to\nstop SMITH in the first place, he stopped bullets, what is he using to\nstopped them. couldn't he use the same power for other stuff or does it\nonly apply to bullets? If Neo had never gone inside Smith, smith\nwouldn't had multiplied. I guess Smith was needed to move the plot\nforward for the next two movies. eventually ending the war between man\nand machine that went on hundreds of years with a lame truce.\n"},
{"review": "\nOne of the best movies ever. The idea is very interesting and everyone\nwho loves conspiracy themes will find this good! This is the first part\nof three movie parts which includes most of the information. I like how\nthe actors got into their lines. Only laurence fishburne has not\nsatisfy me good enough! Still this is one of my favorite movies of this\ngenre and i can really tell everyone to watch it, and listen to the\nlittle details at the background. I think, the only way to really feel\nwhat the writer wanted to show us is to watch it on a big screen with a\ngood sound. The soundtrack is a classic and if you watch it in a dark\natmosphere you will notice how you get into the theme.\n"},
{"review": "\nThough this movie is pretty dated, the special effects are top notch. I\nwas actually very surprised I was watching something that wasn't just\nmade! There is quite a lot of violence, and it was particularly\ngruesome when the bug crawled in the protagonists belly button, but\nother than that, this movie should have been rated PG-13, because I\nhave seen many PG-13 movies that are worse than this R one. This movie\nis a bit violent, but its nothing more mature kids can't handle. It has\nsome good messages in it. Even when Morpheus was captured the Agents,\nand the others wanted to kill him before he gave them any information,\nNeo was determined to get him out of there and did. He never gave up on\nhis friend and saved Morpheus's life. The violence and swearing in this\nis definitely PG-13 and not R.\n"},
{"review": "\nThis brilliant film, no this perfect film, is so revolutionary for\nfilmmakers- so inspiring for story writers- and of course a huge leap\nfor martial arts films, I would say it is the best science Fiction film\nI have seen.<br><br>I would make a bet against any type of person- to watch this film, all\nthe way through and say they didn't enjoy just a little bit. It has\neverything for any type of person- it has romance, it has action- it\nhas fantasy.<br><br>\"Movie\" a movie to me is a dream- a movie to me is an adventure- a\nmovie for me is an escape, a drug to take from my life for and hour and\na half or if I'm lucky two hours+ and this movie ticks all those box\nfrom start to finish forgot your problems and watch this \"Perfect\nmovie\" Thanks for reading :D\n"},
{"review": "\nthere are good film-makers and then there are excellent film-makers.<br><br>but what the wachowski brothers did in this trilogy is create an\nalternate reality so fine, highly detailed and realistic that if\nsomeone planned to enslave whole humanity by trapping their minds in a\nvirtually realistic computer program, then movie movie makes a\npractical handbook for them.<br><br>i have seen the whole matrix trilogy at least a dozen time. and trust\nme when i say that every single time i saw these movies, i could\nunderstand and realise something more and more every single time. i\nhave come to a point that watching this movie has become a\nphilosophical experience.\n"},
{"review": "\nI loved movie that has its own world. You know, like \"The Matrix\" that\nmakes the audience open their mind and start to think of the idea of\nthe movie. I like it, when amazing cinematography of action meets the\nideology of science-fiction that unite as one of masterpiece in the end\nof 20th century.<br><br>Actually, I just watched this movie twice. First time I watched, I\ndidn't get what 'Wachowskis' duo means. I mean this is a deep movie and\nyou must pay more attention in its key-scene. And the second times I\nwatched, yes it is a splendid movie I've ever watched. The new\nbreakthrough of science- fiction and the door to visual effects of the\nnew century.<br><br>Great movie!\n"},
{"review": "\nGod made the human being in the most intricate way. But He never\ndictated us instead He gave us the freewill to do things on our own by\njust, us, using our knowledge and actions. Along the way of this movie,\nmen were overtaken by machine and unfortunately machines were the ones\nwho is controlling people's minds. With jealousy, anger, hatred and\nvengeance ( the very good formulas for disaster and erasure of human\nlife )we sometimes over use the knowledge or wisdom that God bestowed\nupon us. It also sometimes erases the very core value of our existence\nwhich is love and trust. Sometimes we tend to forget that though we\ntried to survive from our daily ordeals in life, yet we do not let go\nof the past and its bitterness. That is why the formulas of disaster\nare there. But in Order to put things straight, we have to use the\nwisdom in the right manner and way through our actions and using our\nhearts and conscience. Truly in this movie, it was shown that evil\ncannot be overthrown by its own shadow, instead, love and heart should\nbe used first in order to overcome the unjust happenings of our lives.\n"},
{"review": "\nMatrix for me was amazing. I couldn't get enough watch it. All those\nflying effects just made me say \"WOW\" so many times. It is just simply\namazing. It would be such an amazing thing if this may be implemented\nin real life too. I loved the slow time effect, it just made the film\nperfect and became very popular effect, these days people are using it\na lot. To be honest this film is speechless. Beside the motion\ngraphics. I liked the movements and martial fighting. Gave a very\nstrong and powerful action combined with graphic effects. You\ndefinitely can realize the martial fighting movements are so perfect\nfollowed with that slow time effect. Honest since this film I used that\neffect a lot.\n"},
{"review": "\nThis is one of the greatest movie's of all time.. At least the 1st one.\nThe rest of the trilogy was still good because it was an entire story.\nI feel like the 1st Matrix was just so eye opening. The way the writer\ndescribed the world makes it believe that we are truly living in a\nMatrix. Since this movie came out I feel like the world has slowly\nopened their eyes to this idea of an alternate reality. There is no one\nelse that could have played Neo but Mr. Reeve's.. He was talked bad\nupon because of the way he acts but that's him. If Will Smith would\nhave locked down the role of Neo I don't think I would have liked the\nmovie the same. Morpheus was such a big role for anyone to play. He is\nthe reason why the Matrix exists. Without him finding it and trying to\nfind the one, everyone in the world stays asleep.. I also feel like we\nare in a Matrix and wish Morpheus would call me to give me a pill.\nFavorite line from the movie... \" Yeah everyday, it's called\nmescaline.\" I don't know how you can follow up the second and third\nmovie after the first Matrix. It was just so good. The second Matrix\n\"Reloaded\", had those awesome ghosts. That chases scene on the high way\nsaved the movie for me as far as hype. But the Matrix is the Matrix and\nyou can never take that image of Neo waking up the black screen with\nthe green writing out of your mind. It's burned in there. Thank you for\nthe Matrix. I still watch it till this day all the way through and\nlearn something new.\n"},
{"review": "\nTruly a revolutionary film trilogy. Still a better love story than\nTwilight. Love Hugo Weaving's performance in this one (especially after\nwatching him in Cloud Atlas recently). Brilliant actor. Brilliant film.\nBrilliant movie marathon. Mouse is my favorite character although he\ndoesn't have the longest life span. Along with Cypher, Tank, and Mouse,\nit is truly one of my favourite castings in film trilogy history\n(unlike The Mummy trilogy and how they changed Evy's character in the\nthird installment of the series and made Alex like seventy-eight years\nold!! The actors and actresses had very good chemistry with each other\nand helped to develop the story into an awesome sci-fi adventure!!\n"},
{"review": "\nMatrix... is the movie based on the system in which we are surviving.\nIt is great movie and simply explains how the system works. If any body\nfeels something..like he is not what he is and what he is doing is not\non his own will, and hence he must realize that he lives in the\nmatrix.It's a winner, because it's a reality that creates an impact of\nit's own. Direction is superb, and performances are award-worthy.As far\nas production is concern,the producer has put all his efforts to make\nthe movie a masterpiece.For most of the user,its just a film. But for\nme it has revealed and explained the very true side of the image. The\nimage of our system in which we are living and delivering all our\nefforts to make the system efficient without knowing that in return the\nsystem is spoiling our future.\n"},
{"review": "\nwell surely the movie is great on action scenes (has made fighting\nsequences an art form) but so are some other action popular Hollywood\nmovies. Acting is as usual awesome by all the actors, eg. Neo's body\nlanguage is a novelty. Dialogues has become part of daily parlance,\nlike \"My way or highway\" etc. which are work of literature. One can\nsurely get an Ph.d degree working on it. These are exteriors which are\nbeautifully sculpted. But the main thing which makes the movie\noutstanding is it's message which it tries to convey. The idea that we\nare in a matrix(mayajaal) from Indian philosophy. &amp; this is where it\ntriumphs . Neo is a seeker of truth. Morpheus being his rightful\nguide(spiritual Guru). Agents being different form negativities which\nwill try to block your spiritual ascent. The computer generated world\nis what we see in our daily life but would never understand till we'r\nself-realized, as Neo in last lines says to get connected i.e. to the\nall pervading superpower &amp; only then we will know our real powers\nsurely we will may not start flying like superman, but may be it's a\npossibility. But surely one's perception will change a lot,\n(symbolically: Neo sees the code going through matrix). So, i would\nwish the ardent fans who have really understood the essence of the\nmovie will do something practical(Yoga: please, check the right\nmeaning). This will be right tribute to \"Matrix\" makers.\n"},
{"review": "\nWhen the Wachowskis released \"The Matrix\" in 1999, it marked the dawn\nof a new age for the science fiction and action genres with the\nnumerous technical and aesthetic innovations it contributed to the film\nindustry. These would go on to earn it the widespread recognition of\nbeing one of the most important films of its generation, as well as\nquite arguably one of the greatest sci-fi films of its generation. At\nthe time, few could have anticipated that such an edgy, high concept,\nand quasi-religious film would achieve the blockbuster success in which\nit did. Most assuredly technological advances in graphics, such as the\n\"bullet time\" technique developed specifically for the film, and an\ninnovated aesthetic to the complexity of choreographed fight sequences,\nare factors contributing to its earned acclaim. However, one of the\nmost critical elements, which has and will continue to contribute to\nthe film's success, was the innovative postmodern hybrid score that Don\nDavis wrote for the film. Davis made unique orchestration decisions\nthat were foreign to the popular trends in scoring at the time, and he\nconstructed textural motives instead of themes to portray concepts\npertaining to the film as opposed to the more traditional approach of\ncreating thematically driven material designed to quite often score the\ncharacters. In doing so, he offered a unique sonic perspective and\naesthetic quite fitting for such a mind-blowing and thought-provoking\nfilm which persuaded the critics, cult enthusiasts, and fans alike to\ntake the red pill and happily tumble down the rabbit hole.\n"},
{"review": "\nThe Matrix is an excellent movie.<br><br>It's a very innovative movie and interesting for the viewer to discover\nthe truth with Neo. The Matrix reveals that our life is nothing else\nthan an illusion and a lie. We have destroyed ourselves. Maschines have\ntaken over and use us as power sources.<br><br>It's an exciting film with an interesting and scaring idea. The film's\nfighting scenes in slow motion have left a mark on cinema and\nespecially Lawrance Fishbourne's performance is memorable.\nUnfortunately, the sequels to this film have been disappointing. <br><br>9 stars.\n"},
{"review": "\nn addition to the wealth of interesting characters, we have a terrific\naction plot--the defending of the village from 40 marauding bandits by\nthe small troop of samurai--, and a more subtle secondary plot\ninvolving the distrust of the samurai by the villagers due to the\nhistorical interaction of these two classes in feudal Japan. All of\nthese plot and character elements are woven together into an\nunforgettable epic, but, at least in my opinion, its not one that can\nbe absorbed in a single sitting. While it's similar in this sense to\nanother of my favorite epics, Leone's Once Upon a Time in the West, it\nis more complex given the number of characters.\n"},
{"review": "\nI want you to take a walk with me. A walk that leads to a path that\nmight be familiar to you. The first path has a wealth of memories as\nThe Matrix breaking new ground in technology and visual treasures. Is\nthat your experience? No? Then you are on the second path. This path\nhas led from another generation and you were just born in 1999 and\nlegitimately have no knowledge of this movie and/or are from a country\nthat did not have this movie.Is that you? We won't hold it against you.\nIn fact, that's mainly who these user reviews are helpful to the most.\nDo you have a cellphone? No, I am not a telemarketer nor is this a\nsales pitch. Technology changed greatly with this movie. The space-age\ntelephone in this movie was a prototype and actually did not work. Now,\nwe have moved beyond the modified flip-phone into versions that would\neven impress Morpheus. Be prepared to take a journey, suspend belief,\nand go down the rabbit hole...\n"},
{"review": "\n\"The Matrix is a digital world that controls the mankind\", after\nlistened to this definition in the movie, i momently repeated this\ndefinition about three times, and i thought it was true. In fact, it is\ntrue, because without digital technology,there is nothing,the movie,the\nIMDb,everything is nothing without digital world.<br><br>The movie,prominently a visual effects lead the movie towards the\nsuccess,and keanu Reeves,lead role,i heard about his life,was so\nhorrible but he is awesome.bullet time motion graphics was\nastonishing.As a computer science student, i realized that the\nprogramming languages ruling the technology.Amazing screenplay made the\nmovie understandable and far away from elusive.\n"},
{"review": "\n\"The Matrix\" is a movie which has began a new era in the cinema. It was\na movie that started a new trilogy of Sci-Fi. \"The Matrix\" is a movie\nin which you will be stunned, it's a really nice movie with a\nwell-known cast of actors.<br><br>The movie show us a hacker who learns from mysterious rebels the truth\nabout the real life and the fake one. It also show us the two sides of\nwar. From one hand is the rebels and on the other hand is the\ncontrollers of them.<br><br>The well-known cast plays an important role on how we see this movie\nbecause of theirs interpretations. Keanu Reeves as Neo made an\noutstanding performance, such as Laurence Fishburne as Morpheus and\nCarrie-Anne Moss as Trinity. Hugo Weaving as Agent Smith (the bad guy)\nmade an also good performance.<br><br>\"The Matrix\" for more people is the upgraded version of a movie in\nwhich Keanu Reeves played a few years before, this movie is \"Johnny\nMnemonic\" (1995) and the leading actor is who else than Keanu Reeves.\n"},
{"review": "\nAs of writing this review, I have seen this like a 1000 times between\nthe ages of 12 to 26. I have seen another 1000 movies in the same time\nframe but The Matrix has a charm and attraction attached to it like\nnone other. Its sleek, stylish and so much substance. This is one movie\nthat makes a compelling case against people who argue that only books\nhave depths, because this movie describes its story, characters and\nevents in a manner that mere words cannot capture.<br><br>This is my first review on IMDb.com and I am a sort of computer geek\nand I am being biased and this is my ultimate movie. But when I say I,\nI am confident that I describe the sentiments of a generation that has\ngrown up under the influence of this movie.<br><br>That should say it all, but among the many fine qualities of this\nmasterpiece, two stand out for me. One, The Matrix is no doubt the\nfinest computer based science fiction there is, the concept is clearly\none of the most imaginative and vivid and detailed piece of genius, and\nit presents a parallel reality, the possibility of which cannot be\ncompletely denied, and its theories on machine and AI development still\nmake sense after 14 years of its release. Secondly, this movie is slick\nand fast paced, layered with actions sequences that set a precedent\nboth in terms of the creativity and technology with which they were\nshot, but their emotional, spiritual and existence in the story itself.<br><br>If you are reading this review after watching the movie (as I often do)\nthen all I have to say is watch it again, there is more there then what\nyou have already seen.Enjoy!!\n"},
{"review": "\nI cannot get enough of this movie. I have seen this movie more than any\nother movie, and I cannot get sick of it. It has everything I need to\nkeep coming back. This movie is on a whole other level when it comes to\nsci-fi. It is so well done, so smart, so stylish and everything any\nsci-fi or computer nerd wishes would happen to them. It's\nanti-establishment and really feeds into how the government and\ncorporations are trying to bring humanity down in a way that is so\npoetic and amazing. I love love love love love this movie! The acting\nis perfect, the storyline is flawless, the graphics are insane, the\nplot is believable, and you just want to live in their world with them.\nCannot say anything bad about this movie.\n"},
{"review": "\nI finally saw this one, and I'm glad I did. Some people didn't like the\nacting, but I thought it was fine. The storyline seems to get in the\nway of the action at first, but if you take the time to watch this 3 or\n4 times, the storyline ADDS a lot to the film and shows you that the\nawesome gun-flashing scenes had a reason to them.<br><br>Agent Smith was cool, the kung-fu action scenes were cool, the guns\nwere cool, and the special effects were great. I don't want to\ndisappoint anybody by giving them high expectations before they saw the\nmovie, but this is a great movie. How can you resist the idea of being\nable to download ANYTHING you want to learn in an instant? 10 years of\nkung-fu experience downloaded into your brain in 7 seconds! The idea is\nas seductive as time travel, which made Back To The Future so popular.\nSee this!!!!\n"},
{"review": "\nthe matrix brings action to the big screen that was never seen before\nwith intense fights scenes,a well thought out story line with a hint of\nlove that keeps you wanting more.the story follows Mr. Anderson who\nworks a regular 9-5 job by day but by night Neo (hacker name) makes\nextra cash by being a computer hacker and selling computer programs.His\nlife takes a dramatic turn when finds out the life he's been living is\na lie and actually he's a slave to a world overran by machines,Its kind\nof ironic that he hacks computer programs but is a slave to a computer\nprogram made by machines. its a well thought plot that deserves a 8 out\nten stars its worth watching then putting the sequel in for an encore.\n"},
{"review": "\nMany people had related it to different concepts. Some to spiritual,\nfictional world and some to the actual world. I am one of those who\nbelieve we may be in Matrix. The concept is more about the will, belief\nand determination on oneself. <br><br>Now, about the movie, its the most entertaining, action filled with\nsuperb stunts and well fitting characters. Unlike many other movies of\nthe same genre, the concept is not very hyperbole but realistic in the\npresented situations. If you do not like the movie in first go, it\ncould mean you do not like sci-fi, action, thriller or like me...did\nnot understand the concept. Well...watch it again. After you get a\ncomplete grip, like me after my 3rd run...i watched it like more than\n10 times and every time i watch a better print and i love watching it.<br><br>10/10 movie!!!\n"},
{"review": "\nWhat if virtual reality wasn't just for fun, but was being used to\nimprison you? That's the dilemma that faces mild-mannered computer\njockey Thomas Anderson (Keanu Reeves) in The Matrix. It's the year\n1999, and Anderson (hacker alias: Neo) works in a cubicle, manning a\ncomputer and doing a little hacking on the side. It's through this\nlatter activity that Thomas makes the acquaintance of Morpheus\n(Laurence Fishburne), who has some interesting news for Mr. Anderson --\nnone of what's going on<br><br>In THE MATRIX, Keanu Reeves stars as Neo, a computer programmer with a\nsideline as a hacker, who gets mysterious messages that lead him to\nMorpheus (Laurence Fishburne), leader of a ragtag group that lives\naboard a rocket-style craft. It turns out that it's not 1999 but about\n100 years into the future. All of humanity has been turned into a\nsource of energy to keep machines \"alive.\" The Matrix is a massive\ncomputer program that has the humans believing that they are still\nliving in a world that has actually been destroyed. Special agents, led\nby Smith (Hugo Weaving), seek out Morpheus and his followers to destroy\nthem.\n"},
{"review": "\nThe Matrix has an intense, well-thought-out plot that leaves you\nwanting more. The acting is believable and sincere, and Keanu Reeves\nsuits his role as the main character perfectly. The visual effects are\nbrilliant and all the stunts are executed without any fault. Watching\nthis movie, I could not believe that it was released in 1999 - the\neffects and camera-work are so good that they would fit in with the\nmovies being released now, 14 years later. I recommend this movie to\nanyone who loves action or interesting story lines with an exciting\ntwist. This movie deserves its place in the top 250. I give it a nine\nout of ten. Go watch it right now if you haven't yet (and if you have -\ngo watch it again!).\n"},
{"review": "\nThe Matrix is one of the best films of all time, as well as the best\nsci-fi movie ever made and also one of my favorites of all time! The\nMatrix is one of those movies like Usual Suspects which holds you from\nthe opening credits and does not let up til the lights come on in the\ntheater. By now we all know the story behind the Matrix and how great\nthe special effects and action was, but I noticed that most people\nforgot to mention the depth of the story.<br><br>Yes! Matrix is an action movie, but it is also Biblical in many ways.\nNeo is Jesus... he is the \"one\" selected to free the people from\npersecution. Cypher is the disciple who betrayed Christ... he sold out\nMorpheous for materialistic items and was then was forever banished\nfrom the real world. Morpheous is God... the all knowing, he is\neverywhere, yet nowhere. And Trinity is the Virgin Mary, for it was her\nefforts which brought Neo to the \"real world\". Other references include\nZion,the Nebucanezhar and the Oracle.<br><br>I have seen this film three times, will see it again at the theaters\nand I am definitely going to purchase the DVD on Oct. 5. Forget Phantom\nMenace, the Matrix is IT!\n"},
{"review": "\nThe matrix should be the \"BEST movie of all time\" If you don't agree,\nis because you don't understand the movie :) The Matrix has all topics:\nCyberpunk, the Mind, The reality, The Control, All about Software,\nvirus, hackers. I ask you: Why Seraph has YELLOW code in matrix ? Do\nyou understand why? Think it.It's one between hundreds of reflections\nand questions around matrix. If you see The Matrix several times, you\ncan see incredibles references to others movies and authors. Like\nCyberpunk movie is incredible the mention to others ideas that we 've\nseen in Ghost in The Shell, Level 13, Existez, etc. You can complement\nthat movie with the game \"Enter the Matrix\" and the Animatrixs movies.\n"},
{"review": "\nWell I am a huge fan of this great movie and every time I watch it I\nenjoy it!This movie is sci if so if you are not a fan of this type of\nmovie then u will not be a fan but for me it has every eliminate I go\nin looking for.It has effects,great plot and its also entertaining.I\nknow this review is short but I just want to say its great!If you like\nsci if u will love this movie and If u don't you might still appreciate\nit for the originality and thrilling and unpredictable plot!This movie\nisn't just for nerds if you r thinking that because heaps of people I\nknow who are not nerds love this movie including me.This movie is rated\nr but unrighteously so and I definitely think heaps of pg 13 movies are\nway more explicit and this movie isn't gory or disturbing or constantly\nviolent either.Id definitely let a 12 year old watch this movie because\nI don't believe the rating and its not always right!!\n"}
]