[
{"review": "\nHilariously dumb and manipulative, it's entertaining on that level\nalone, although scary in that it's so boarder line that you can't be\nsure the movie was made with tongue anywhere near cheek, I'm inclined\nto think not. That this movie is serious, that America needs to feel\nlike a scared kitten rescued by a big stack of muscles. That stack of\nmuscles is Dwayne Johnson and it's hard not to love him. He's kinda\ngood in this, I like him, even when he's part of this manipulative\npropaganda. The special effects were nice. it kinda flowed, sort of, I\nguess, lots of plot holes but why bother looking for them when the iq\nlevel they're aiming this at is so low you're not supposed to notice.\nThe cheesy flag at the end gives you another good piece of cheese to\nchoke on. If we're going to go down we might as well go down stupid.\n"},
{"review": "\nThis movie is absolutely terrible.<br><br>Imagine melting a 4kg ball of Edam, a 12kg slab of cheddar and 47 cases\nof mozzarella, it still wouldn't be anywhere near as cheesy as this\npiece of drivel.<br><br>I was dragged along to see it and for the entire time I sat there\nwondering if this was some kind of sick joke I wasn't in on.<br><br>The effects were decent but lets be honest, which movie doesn't have\ndecent effects nowadays? The acting is absolutely horrific, the rock\nhas the acting ability of a disabled fox and I wanted the two English\ntoff kids to die every time they appeared on the screen.<br><br>The girl in it, although very attractive, has the personality of a\nsprout.<br><br>Bah! if anyone offers to watch this movie in your presence please punch\nthem in the face.<br><br>The ending where the rock says something like \"now we rebuild\" and the\nAmerican flag unfurls in the wind made me want to spew my popcorn all\nover the cinema floor.<br><br>Avoid at all costs.\n"},
{"review": "\nI read some of the reviews here and am wondering what all the negative\nreviewers expected. Who didn't know this was a huge, costly disaster\nmovie? Who didn't know there were going to be many unbelievable scenes?\nWho didn't know there would be some cheesy dialogue? <br><br>Well, I, for one, enjoyed it. The last good disaster movie I saw was\nThe Towering Inferno, and you know that was a long, long time ago. It's\nstill my favorite disaster flick. San Andreas, of course, had much\nbetter special effects. (several decades later, better effects, right?)\nI thought the scenes of the destruction were amazing. <br><br>We all know disaster movies usually focus on a handful of people in it\nand this one was no different. The movie was entertaining for me. I\nhope it is for you, too. :)\n"},
{"review": "\nThis movie was so bad that it actually made me angry. I didn't think it\nwas possible to make a more ridiculously stupid disaster movie than\n2012. I was wrong. I will just nit-pick the opening scene real fast\nsince IMDb reviews require 10 lines of text. So a car is hanging on the\nside of a mountain by a tree branch. It shifts and slides down three\ndifferent times for dramatic effect... Stupid. Why would the LAFD take\na reporter and her camera man on a dangerous rescue mission??? Stupid.\nThe reporter asks one of the rescuers, \"What is the biggest difference\nfrom rescuing people here in LA, rather than in the Middle East?\" The\nguy says, \"Well, we aren't getting shot at over here.\" She proceeds to\nwrite in her notebook \"CUTE NOT BRIGHT\", referring to the ex-soldier\nwho answered her question. What did she think the biggest difference\nwould be? He gave a very valid answer to her idiotic question. This\nmovie is terrible and completely predictable.\n"},
{"review": "\nI had been waiting to see this with much anticipation and what a\ncomplete let down. I can honestly say I have not seen such an awful\nfilm for a long time. After watching San Andres Fault by mistake I was\nso hopeful that nothing could be quite as bad as that. I was wrong. I\nknow it's a big blockbuster and made to leave the viewer in awe, but I\njust laughed at it. My partner and I sat and said what was going to\nhappen next and it did. The plot was dire from the start and I was kind\nof hoping the film would end before it had even got half way through\nit. Why do they always have Brits in American films who sound like they\nare so posh? Totally not called for. The acting was OK and I like\nDwayne Johnson, but this was beneath him. The most ridiculous film in\nyears.\n"},
{"review": "\nGoing into this film I knew it wasn't going to be one of the best films\nI've ever seen I just knew I would like the visual effects and the\naction, although there were some parts that wouldn't have happened in\nreal life but that's standard Hollywood, it's expected. The story line\nand plot wasn't anything spectacular. It wasn't anything you haven't\nseen before, very clichéd and predictable. The Rock's performance in\nthis film did give it that extra kick that was needed to make this film\na bit more tolerable. If you're planning on seeing this film enjoy the\nride for the visual effects and the action, don't expect very much\nmore. I'm not going to say it's bad and I'm not going to say it's good.\nIt's just a clichéd Hollywood work of art. You be the judge.\n"},
{"review": "\nI'm usually all in for disaster flicks, and the special effects in this\none are spectacular (Colin Strause). There's an excellent cast as well,\nled by Dwayne Johnson and Carla Gugino with good support form Alexandra\nDaddario, Paul Giamatti, and Hugo Johnstone-Burt. However, I hope\nyou're not expecting any earth shattering (no pun intended) dialogue or\nstoryline, because the filmmakers here have taken every plot cliché and\nhokey line of dialogue and thrown it into this movie.<br><br>All in all, this film, directed by Brad Peyton, with a screenplay from\nCarlton Cuse, is just an escape filled with one tension packed scene\nafter another, but don't be surprised if you find yourself\nunintentionally laughing out loud with some of the cheesy dialogue and\nplot elements.\n"},
{"review": "\nCan I give it zero? I have said this for years about disaster films:\nthey all have the same plot line. Somewhere at the beginning there will\nbe a failed relationship, one that usually has a child or two involved\nas well. From there (not saying it happens here), the ex- couple will\nstruggle to save their child, with usually the man becoming the hero of\nthe day, so that Mom and Dad will be together again with their\nchild/ren. <br><br>This was such a horrible, horrible movie!!! Reminds me of when 3D\nmovies came out in the early 80's - bad movies where they tried to\nthrow everything and anything at the screen, but lacked a story. Since\nCGI effects came on the scene, it seems many bad movies, like this one,\nthink they can overcome a badly written movie by making some awesome\neffects. It will work for most of the do-do's out there, but otherwise\nwill fall flat for most. <br><br>I should add, that \"hey! I ain't looking for something too deep, but\nfor God's sake, use your imagination a bit folks...folks being the ones\nwho are writing this garbage!<br><br>Extremely shameful!!!\n"},
{"review": "\nAt least in that film you cared a little about the characters, and\nbelieve it or not, most of the \"special effects\" worked better. As did\nthe realistic challenges of facing a disaster of that magnitude. The\nCGI destruction on LA in \"San Andreas\" is nearly indistinguishable from\nwhat we saw in \"2012\". And the close up scenes just don't work as the\ncamera is too focused on the actors faces and Dwayne Johnson's biceps\nrather than the action we paid to see in the first place. Like most\nfilms that rely too much on CGI, the destruction just isn't believable,\nand happens too fast in several scenes for you to understand what\nyou're looking at. However I have to admit that finally seeing San\nFrancisco take it up the Richter Scale scored high with me.\n"},
{"review": "\nI have read a lot of negative reviews about this movie and while I\nagree on some points I found the movie pretty good! A lot of people\nhave pointed out that Ray (Dwyane Johnson) should have helped others\nwhile searching for his daughter because that is his job. Yes... that\nis his job however if that was your job and your daughter was in\nhorrible danger you would probably do the same thing! It's human nature\nto protect your children and the ones you love first. and once in San\nFrancisco he did help others.<br><br>Although I did find the acting a bit wooden and the near death scenes\ntotally unbelievable ( who the heck falls 6 stories and still survives\nwith only minor scrapes and bruises I dunno) I liked the storyline\nthough and the visual effects were awesome! Pretty typical disaster\nmovie.\n"},
{"review": "\nOK, the special effects are good, the visual effects are good, the\nsound effects are good. The set pieces around these effects are\npreposterous. Gunning a boat towards a tidal wave to try to get over\nit? Swerving a boat at high speed between shipping containers falling\nfrom a cargo vessel?. Within 15 minutes I told my other half that , the\nparents about to get a divorce would not, the daughter missing after a\nmassive earthquake would be found, the new partner of the mother would\nbe killed and everyone would live happily ever after. And they did. The\nmost formulaic, generic, dare I say lazy kind of film making? Rock does\nit by the numbers as does everyone else but the numbers don't add up to\nvery much. 1/10 for the effects , zero for everything else. This movie\nstinks.\n"},
{"review": "\nWhen the city is all tore up with debris floating everywhere in the\nwater our hero dives from a boat deep into the metal and concrete laden\nwaters and what do you know, he misses every piece of junk to save his\ndaughter,this movie was probably the worst movie I ever watched.The\nacting was so so.The boat that was running with a prop through the\nconcrete infested waters was ridiculous. Every Time a person was in\ntrouble right after they got saved the building they were in\ntoppled,who would have thought. This movie was far from original, the\ntsunami part was as phony as you can get.Funniest part was when the\nyoung couple have a kiss and the young boy watches saying his mom will\nlike her, all of this while the buildings all around are blowing up,\njust so silly,should have been labeled a comedy !\n"},
{"review": "\nJust watched this on a 65 inch TV and I imagine on the big screen that\nthe CGI would be even more inspiring. Most films that depend this much\non green screens tend to have dark backgrounds for sets; not this one\nas everything is shot in bright daylight. So I give credit to those\ninvolved in all of that computer work. But the dialogue writer and\nacting coaches should be hiding in shame. Most films of this genre call\nfor a willing suspension of belief but this one calls for a \"What the H\nE double hockey-sticks f'ing unbelievable surrender.\" Once you accept\nthat premise and just settle back to watch the Hoover Dam and San\nFrancisco tumble down as our hero does the impossible, then you can\njust enjoy the architectural carnage. And of course use this as an\nexcuse as to why you refuse to set foot in California.\n"},
{"review": "\nIndependence Day. 2012. San Andreas. Lets review all three of them: <br><br>In the aftermath of some catastrophic event, the heroes (all divorced),\nsave the day and guess what? They happily take back the old hags that\ndumped them for other men.<br><br>Really? Are all the Hollywood writers out of ideas? Or there is only\none guy that keeps the story and creates a different cataclysm?\nPersonally, I'd rather be eaten by alien invaders, drown or be dead in\nan earthquake than returning to the x-wife.<br><br>As the CGI goes, of course, top notch. Acting is overdone, and the\nOscar goes to Paul Giamatti. Dwayne should stick to comedies. Carla\nGugino should be on the cover of Playboy. Wait! Playboy doesn't do\nnudes anymore ...\n"},
{"review": "\nLousy, one-dimensional acting. Stupid script. Muscle-bound male hero\nwith a never-changing scowl and female leads with big, heaving breasts.\nFilmmakers apparently never matured beyond the 14-year-old pubescent\nmale stage.<br><br>But I didn't give it a \"1\" because they spent a lot of time with the\ndigital effects and they were pretty cool.<br><br>And frankly, leveling San Francisco would be a boon to humanity, so\nthis movie isn't about a catastrophe after all.<br><br>In summary, this is the sort of movie where all involved in the project\nhold their noses while accepting their paychecks.\n"},
{"review": "\nWhen I've watched this movie with a couple of friends, we we're hoping\nfor some simple action, natural disaster impacts and not too horrible\nacting performances. Especially the last was very disappointing, the\nacting performances have never been believable. There never was a flirt\nbetween Raymond and Emma, and the flirt between Emma and her new\nboyfriend were non-existent. From the beginning on you can feel that\nthese two will probably get back together, we've seen that a thousand\ntimes before. The special effects were kind of cool, but it's totally\nUnbelievable that everyone dies and our main characters are just\nrunning through the streets with falling buildings, or are even\nclimbing on falling buildings and jumping in a helicopter. Seriously?\nThe love story between Ben and Blake is terrible to watch, or is that\nbecause of the horrible accent of the little brother? <br><br>All by all,predictable and unbelievable from start to finish. And the\nAmerican flag in the end just made me wanna puke. This could have been\nso much better.\n"},
{"review": "\nThe Rock did a good job with what was given to him... but the corny,\npredictable story line and the absolutely cheesy CGI effects had\neveryone in my house laughing. The only reason I kept watching was for\nthe... well, I'm a guy... so, yeah. And no helo pilot in his right mind\nwould ever think of pulling some of the maneuvers that were shown. They\ncould have easily stayed above the gorge and lowered the line down a\nbit longer. The boat that they borrowed near the end would have had a\nfouled or broken propeller within 1 minute of traveling in the flooded\nand debris filled city. Also, if so many people died during the\ntsunami, where were all of the floating bodies? We saw what kind of\ndevastation can happen with a large tsunami years ago in Asia. Overall,\nnot impressed at all with the movie.\n"},
{"review": "\nThis film was absolutely amazing, definitely recommend the film, it\nwasn't at all what I expected and was a brilliant on the edge of your\nseat film. Definitely would recommend this film to anyone who likes\naction and on the edge of your seat films, cause it gives you both all\nthe way through. The reason why I loved this film so much is because it\nis a very well put together action film and during the film more of the\nstory line emerges to help understand the film, also the film is a big\non-the-edge of your seat film due to the things that happen during the\nfilm. Finally, the film made me emotional during the ending as you are\nnot sure what is going to happen. So to finally summarise this film, is\na fantastic film and one I would definitely recommend for people to\nwatch\n"},
{"review": "\nDwayne, I like you man. You've been in some good movies (none I can\nthink of right now), but this... I don't know what to say. This was\nterrible.<br><br>I haven't seen a natural disaster movie since \"2012\". I could\nappreciate that movie even with some of its absurdities. This movie was\none big cliché: from the ridiculous stunts, the uninjured stars save a\nscratch, the divorced co-stars, the d-bag new man and on and on.<br><br>But this wasn't a movie about a natural disaster, the earthquake was\nsecondary--a back drop. The movie was about the power of love. Love\nconquers all. Love can stop time. Love can give you super-strength.\nLove can bring the dead back to life.<br><br>Feel it.\n"},
{"review": "\nYes, San Andreas looks great. I'm not just talking about the CGI\napocalypse which smashes LA and devastates San Francisco, but also\nabout the principal cast. Dwayne Johnson, Carla Guigino and Alexandra\nDaddario look great, and do well with what they're given to work with.<br><br>What the actors are given is a script so thin on story and character\ndevelopment you could almost perform microsurgery with it. Clichés and\ncardboard characters are the last thing I expected from one of the show\nrunners of Lost.<br><br>All isn't beyond redemption though, because the character of Blake,\nplayed by Alexandra Daddario, is great. She goes beyond the typical\ndamsel-in-distress stereotype and is actually very capable and strong\nin her journey through a rapidly collapsing San Francisco. Her\ncharacter and Daddario's portrayal make up 3 of the 4 points I'm giving\nthis movie. The other point is for the great effects, but really, good\nvisuals are to be expected these days.<br><br>Overall, a pretty shithouse film.\n"},
{"review": "\nThis is actually a 7 star movie but the negative people are leaving 1's\nand 2's. This is not a 1 or 2 star movie.<br><br>Yes, the physics did not always work out and buildings always fell just\nas the stars got away. And I think 2 minutes officially passed before\nthe girl came back to life but it's a movie and time doesn't need to be\nperfect. It's a representation of time.<br><br>Not too much character development, but what's to be expected when the\nearth is imploding. There's enough to give something to the viewer.<br><br>Great special effects; lots of action and pretty decent acting.<br><br>Let's just say the 90 minutes will go pretty fast and you might get a\ntear in your eye at the end.<br><br>Might I add with some humor, one wondered when the movie would give a\ntease shot of the daughters(18+) upper closet area. Well it came\ngratuitously underwater in the last 20 minutes. Thank you! Hollywood.\n"},
{"review": "\nSaw this for the first time last month and absolutely loved it. But one\nglaring problem...or rather inside joke.<br><br>It seems in almost every disaster movie I've seen that the parents are\neither divorced or in the process of divorce at the beginning. But\nalong the line of the entire movie the boyfriend of the mom gets killed\nin some way. And then in the end they get back together.<br><br>But despite this recurring issue I still like the movie.<br><br>And another thing about this movie.<br><br>I love Ioan Gruffudd in his other works including Amazing Grace. But in\nthis...oh my god! I hated his character and actually laughed at his\ndeath.<br><br>But out of everything I love this movie and would definitely recommend\nthis to family and friends.\n"},
{"review": "\nWho died and put Pig Vomit, a.k.a. Lawrence, played by Paul Giamatti,\nin charge?!?!? This movie is hilarious! Howard Stern's former boss, Pig\nVomit taking charge is perhaps the most hilarious thing about this\nmovie. Seeing numerous people having their day/lives ruined in the most\noutrageous ways was also fodder for extended hilarity.<br><br>There were one or two heart-warming moments, such as when The Rock's\ncharacter risked breaking his daughter's ribs to save her from\ndrowning.<br><br>The aerial shots were breathtaking, and reminded me of my days as an\nImage Analyst in the U.S. Army.<br><br>As a military man who has been through a divorce, and who has witnessed\nnumerous other military personnel go through bitter divorces, I could\nrelate to what The Rock's character was going through.<br><br>My wife and I both enjoyed this movie in 3D, and we agree that 3D movie\ntechnology has come a long way since we saw our first 3D movie, A\nChristmas Carol, in 2009.<br><br>I look forward to buying the DVD version of this film and watching it\nrepeatedly!\n"},
{"review": "\nThis film is outstanding and the best I've seen since 2012. Loved it,\nthe CGI is amazing throughout. The feeling you get watching this is a\nrange of emotions, happy, sad, tense, relief.<br><br>The San Andreas fault is changing, with earthquakes are felt right\nacross the fault and expanding. Dr Kim Park with Lawrence are at the\nHoover Dam have a break through with their machine which has pre\ndetected an earthquake. This one is going to be major off the scale\nearthquake, the dam collapses taking Dr Kim Park with it.<br><br>Ray the Los Angeles Fire Department rescue pilot races to his estranged\nwife Emma from the top of a high rise restaurant. Then finding out\ntheir daughter Blake is out there in the earthquake, begin their rescue\nmission to get to her.\n"},
{"review": "\nAs I have watched nearly all \"Disaster-Blockbuster\" around the world, I\nwas completely surprised by this one. This movie is almost \"running\"\nwith action scenes - you can not breathe a second, there is already\ncoming the next catastrophe. And apart from that, Dwayne Johnson is\nplaying his role quite sensitive and comprehensible. I could go with\nhis situation and feelings. Of course, there are some strange fortunes\nand unrealistic happenings, but as far as I can say, this is pretty\nnormal for a Disaster-Movie.<br><br>In summary I can say: this movie is really outstanding for this kind of\ngenre.\n"},
{"review": "\nI don't know about you but I am a natural disaster freak so when San\nAndreas came out I had to see it. If you have not yet seen the movie\nand wanted a summary to decide then here it goes- The city and\nsurrounding areas of Los Angeles have been having a few minor\nearthquake tremors a day for a couple of days now and people are\nstarting to worry. When Geographers say that the worst of the quake was\nover they were lying. A much bigger problem is lurking on the horizon.\nA 10.0 earthquake! Its all about Survival when Ray (Dwayne Johnson)\ntries to beat the natural disasters ahead of them to save his daughter\n(Alexandra Daddario) and wife (Carla Gugino)and bring them to safety\n"},
{"review": "\nSan Andreas. It is definitely the most epic movies of the year. Where\nelse can you see how demolish half of North America? And if you notice\nthat it's all computer graphics, i can only stand and applaud. The cast\nis good, Dwayne, actually, as always immaculately brutal and powerful,\nCarla and Alexandra are very, very similar to the mother and daughter,\nand it's true great. Cast justified itself uniquely. The plot in the\nmovie-\"world end\" usually does not shine, but there is an exception, I\nam truly worried about the fate of the characters, and waiting for\nfurther developments.<br><br>Cinema I left satisfied and I am sure that I will see this movie again.\n"},
{"review": "\nBeen reading some of the reviews from non-US reviewers on here and it\nseems they've got the wrong idea. This isn't a USA chest- thumping\nfilm, it's simply a mindless action flick and it succeeds brilliantly\nat that. If you're expecting something that makes you \"think deep,\" or\nsomething that stimulates conversation, forget it. But what you get\nhere is a solid, 100%, no-apologies-necessary action movie that rivals\nany of the Die Hard series for nail-biting excitement. The CGA graphics\nare pretty damned good, the cast is pretty damned good, the \"science\"\nis pretty damned good, and the premise is pretty damned good. When I\nsaw it was \"The Rock\" in the lead, I almost passed, but he did a fine\njob--as good an action hero as Sly Stallone, Arnold, or that cheesedick\nBruce Willis. So put your politics and national pride aside and just\nenjoy.\n"},
{"review": "\nNot an Indie movie, not a Sundance one, not a Focus ........all which I\nlove........this is a kick ass (spectacular!) movie......after so long\n(like Poseidon Adventure/Gene Hackman and Earthquake/Charlton Heston\nput together with new technology).....finally we are moving ahead\n.....Dwayne Johnson is coming along and the whole cast rock!......no\npun......got to watch it........in 3d.........awesome....arrive early.<br><br>Without alarming is a movie to enjoy but at the same time made us think\nin preparedness and take things like the news responsibly.....specially\nthe human factor of collaboration and the heroism that should exist in\neach of us...\n"},
{"review": "\nHi, This film was very well put together. The Rock showed a more decent\nside to his acting skills and whilst the plot is a straightforward\ndisaster and rescue, it was a brilliant edge of the seat film.<br><br>Worth watching at the cinema for the effects. Don't bother with 3D,\nthough. It's just as good in 2D.The film is around 2 hours long and my\ntwo boys and I were gripped through the whole film. <br><br>The helicopter scene at the start was well done. The graphics were all\nexcellent and the story was decent enough. We would all look out for\nour family in the case of a disaster and this is what they show in the\nfilm of the Rock rescuing his family. Brilliant film and thoroughly\nenjoyable.<br><br>Cheers.<br><br>Jabbar\n"},
{"review": "\nInstead of ripping into character depth and story line, the overall\npoint this movie delivered is an hour and 47 min of action packed\nthrill in 3D. It is not often your able to go to a movie theater, pay\nfor overpriced tickets, popcorn, and dirty theaters and get completely\nabsorbed into a movie and walk out feeling like that was worth my money\nand time. As for the common denominator for these kind of movies, at\nleast the daughter no longer needs pull ups after the world was\ndestroyed. Keep in mind, the length of this movie also keeps the\nmomentum of action, where as the director did not fill the void by\ninsulting the audiences intelligence.\n"},
{"review": "\nThis is the kind of film where it is difficult to do something\ncredible. Here, everything is \"too much\" even the Rock's muscles. We\nhave caricatured characters who seem to survive only when the entire\ncity collapses, but are struggling to attract sympathy. The wicked die\ntoo quickly and seem almost ridiculous. <br><br>OK, the CGI are almost well done. The 3D starts well, but, as often,\nthere's a lack of good use of this technology after the half of the\nmovie. We don't have a pompous music as in a Bruckheimer production but\nwe are not far of the same recipe. <br><br>Yet in all this, we are distracted, because it is only for this. A\npopcorn movie more!\n"},
{"review": "\nAn earthquake rocks California.<br><br>When I first heard that Dwayne Johnson was going to be the star of this\nflick I had some concerns over the casting, you see I am a bit old\nschool in my disaster movie tastes and someone like the late Chuck\nHeston the late Paul Newman seemed to be the expected guy for a film\nlike this. However, to my surprise, Johnson did the hero role very\nwell, and I actually love San Andreas!<br><br>The whole cast is wonderful. I don't usually love these CGI epics but\nthe film is a refreshing tribute to Irwin Allen of the 1970s and that\nalone is something that makes me very happy. <br><br>Attention Hollywood: please make more movies like this, but for the\nnext epic please find a film composer who scores like John Williams or\nthe late Jerry Goldsmith. Thanks.\n"},
{"review": "\nSan Andreas is a 2015 film , starring Dwanye \"The Rock\" Johnson ,\nAlexandro Daddario and others !!! Vfx team has done a great job !!! All\nthe disasters seemed so real !!! The underwater scenes were realistic\nand thrilling !!! Brad Peyton's direction was more than satisfying !!!\nThe role of Art Parkinson was cool !!! Alexandra Daddario's acting was\ngood !!! Overall , San Andreas is an edge of the seat thriller and\nentertainer !!! Definitely worth a watch !!! I have now started finding\nbetter movies through www.flickstree.com . It not only suggests great\nmovies to watch , it also tells where you can watch the movie online..\nHighly recommended.\n"},
{"review": "\nI did not see this movie in the theater. I saw it on DVD. And while\nthere were a great many \"goofs\" and required a great deal of suspension\nof belief, it was ... well, I don't know exactly. I did enjoy the movie\ndespite the issues with it.<br><br>My biggest beef with the movie was the scene with Natalie driving on a\nmountain highway loaded with curves and oncoming traffic, yet she takes\nher eyes from the road to 1. reach for her water bottle in her bag\nbehind the front seats. 2. She then reads a text message on her cell\nphone - again taking her eyes from the road.<br><br>I found that very disturbing because the amount of influence movies and\nactors have on people today. They see it on TV or in a movie and think\nit's okay. A good many states have laws in place regarding the use of\ncell phones while driving. That whole scene was highly irresponsible.\n"},
{"review": "\nThe only reason I gave this film any stars at all is purely because of\nthe special effects.<br><br>Other than that the story is sickeningly predictable and shallow.<br><br>If you like the usual formula for American 'feel good' movies then you\nwill probably love this, even with it's illogical and downright stupid\naction sequences.<br><br>The characters are the usual cardboard cut-outs indicative of these\nfilms. Stereotypical 'hero', along with stereotypical 'babe', 'clever\nchild', and the most awful portrayal of someone British on film I have\nseen since Hugh Grant and Colin Firth - and they are both truly the\nmost awful of awful. <br><br>Even if you watch this film for a bit of no-brainer fun you will cringe\nnumerous times, and be left wondering if a film could become any worse.<br><br>The only decent bit of acting comes from Kylie Minogue who has an all\nto short part.\n"},
{"review": "\nSan Andreas is a fairly generic action disaster movie. It stars Dwayne\nJohnson, the incredibly sexy Alexandra Daddario, Carla Gugino, and Paul\nGiamatti. Like I said before, this movie is fairly generic but there\nare a few moments so over the top and unbelievable that the movie is\nalmost a so bad it's enjoyable movie. Other than those few moments\nthough the rest of it is just okay. The acting is okay. The effects are\nokay. The music is okay. The sound design is okay. Most of it is just\nokay. The only thing that prevented me from giving it a 6 out of 10 is\nthe script is stupid garbage. I can't explain why because I will only\ngive spoilers to movies that are over 10 years old but believe me the\nscript is garbage. In fact it is such garbage that I almost have it a 4\nbut I didn't because of how hot Alexandra Daddario is. Would I\nrecommend it? Umm.....if you want to see a dumb destruction movie...\nsure. I mean it isn't the worst and it is kinda entertaining. So yeah,\nI guess watch it.\n"},
{"review": "\nSan Andreas is a masterpiece for the fact that it is so bad. The film\nhas all the making of a bad movie, Dwayne Johnson features in this\nmovie where the biggest earthquake of all time effects San Andreas. His\ndaughter is stuck in all of this. She meets a boy called Ben and his\nstrange brother who has not passed puberty and still is attracted to\nwomen, including Dwayne Johnson's daughter. Ben and Dwayne Johnson's\ndaughter, Blake, fall in love, what a surprise! When Ben and Blake\nfirst kiss, the young boy says \"Mum is going to love her\" and in\nanother moment when looking at Blake says \"I can't wait to be twenty.\"\nI dare you to watch this movie and not hope that everyone will die,\nexcept for Ioan Gruffudd, this character was the only person I wanted\nto live because he was a snob to everyone!!! And he's the only one that\ndies!!! This is a terrible movie and I will now say 'DAMN YOU DWAYNE\nJOHNSON!'\n"},
{"review": "\nSan Andreas is a big dumb disaster action film but it is entertaining\nenough with some good special effects.<br><br>The Rock plays a rescue pilot and a brave one as we see in the\nbeginning. However he is soon to be divorced, as his ex has found a\nmillionaire property magnate, he also cannot get over the death of his\nother child.<br><br>When the big quake strikes, The Rock springs into action, despite all\nthe chaos he rescues his wife from the top of a collapsing building and\nthen goes looking for his daughter, abandoned by her mother's boyfriend\nand aided by two random British kids she just met.<br><br>Never mind other people who are injured or needs rescuing, the Rock\nonly has his family in mind and he will commandeer any vehicle he can\nget his hands on. <br><br>The rest of the cast are underwritten such as Paul Giamatti's\nseismologist doing his best to warn others.<br><br>A popcorn film that you will see once and that is it. However how many\ntimes will we see The Golden Gate Bridge being destroyed though?\n"},
{"review": "\nSan Andreas is an educational film and not an entertainment in the\ncinematic sense. There is no entertainment in watching large numbers of\npeople getting squished by falling buildings or drowned by an enormous\ntsunami. There are two central characters. The action man is Fire and\nRescue helicopter pilot Dwayne Johnson. The brainy character is Paul\nGiamatti's college Professor. Dwayne Johnson's character Raymond Gaines\ngets to fly a helicopter, a light aircraft, a powerboat and a road\nvehicle. Paul Giamatti's character Dr Lawrence Hayes is the scientist\nwho, along with Dr Kim Park, gets to find out how to predict an\nearthquake in advance so that he can warn people to try and get out of\nharm's way in time. Although the West Coast gets flattened by the\nbiggest earthquake in history the film itself ends on a positive note\nwith a large Stars and Stripes flag being unfurled from what is left of\nGolden Gate Bridge.\n"},
{"review": "\nMuch like the vast majority of disaster films, San Andreas is your\ntypical 'worlds gonna end, we need a hero' blockbuster. As per usual,\nmost of the action scenes always end with you just laughing at the\nobscenity of them. Saying that, you just have to look past the fact\nthat it's a film that sets out to entertain with the biggest and best\nspecial effects money can buy. If you take these films too seriously\nthen don't bother watching them.<br><br>As mentioned, the special effects really are astonishing, and the best\nword to describe the disaster scenes would be colossal. From that point\nof view, its worth a watch.<br><br>The script is OK , the acting is fine (nothing spectacular, but what\nare you expecting?), however the overall story does have more holes\nthan a gold course.<br><br>I watched this film looking for action and entertainment, and thats\nwhat I got. So don't head into it looking for a classic, because you\nwon't find it.\n"},
{"review": "\nThis is just another mega disaster movie. No plot twist or anything\nthat will surprise you. Just another bad day for the people of US, a\nscientist warns people, a hero saves his family.<br><br>In my opinion the movie is much higher rated than it should be.<br><br>The acting is mediocre, the script is bad as it can be, a no brainer at\nbest, nice cgi effects and that's all you are going to see. We are once\nmore fooled by a trailer with full of great CGI.<br><br>Long story short you are not going to miss anything by skipping this\ntitle but if you have nothing to do better get your ice cream and get\nready to waste two hours.\n"},
{"review": "\nLet's be honest, the only reason why you and I would watch this is for\nthe special effects ! While they don't disappoint, there were a few\nmoments where they could have been better, in particular the opening\nscene, which was really bad in my opinion. Apart from that, this is a\ntypical disaster movie, and as such it suffers from all the usual\npitfalls of that genre : stereotypical characters (you've got the\nscientist, the hero who tries to reunite his family, the selfish\na**hole, etc), predictable storyline and of course the infamous shot of\na giant wave chasing the hero, or the earth shattering 2 feet behind\nhim. At least they avoided the annoying/helpless teenager cliché ! All\nin all, nothing new to see here. Not bad, but not great either : 6/10.\n"},
{"review": "\nThis film is outstanding, thrilling and exceptionally dazzling. It puts\nyou at the edge of your seat, the earthquake is just magnificent! <br><br>I rated it 8 because although it was good, I thought it could've\nachieved better. At least push the 12A boundaries to its highest peak\ne.g. Mockingjay Part 2 did (which was the best film ever &lt;3) . <br><br>Lovely, creative film. The VFX is just horrifically amazing! I mean,\nwho thought that technology was even made?! It is just... amazing..\ndazzling, superb.. <br><br>Would highly recommend it to watch it again and again until you get\nbored of this film and move on to another.\n"},
{"review": "\nI read reviews before watching this movies. I see the climate change\nfox news zombies calling propaganda about this movie. This is a great\naction movie to entertain you. It is however, a far fetched action\nmovie. I am saying far fetched because of the one second left saves\ndone by the rock. But again, that's what the action movies are all\nabout. I love the rock an most of the movies he does. Go into this\nmovie knowing there will be some scenes you will roll your eyes at. To\ncall it a comedy is not accurate at all. The flat earth society\nrepublicans need to get an education, instead of waiting for the next\nCEO to tell them what to think.\n"},
{"review": "\nOne has to know that this will go off the cliff (no pun intended) to\n\"thrill\" people to what could happen in CA. How far it is stretched and\nthe stories and situations get very stupid. Dwayne \"The Rock\" Johnson\nshould have stayed with the wrestling federation or whatever it was\ncalled. When he is flying the helicopter or \"Helo\" as he calls it, they\ndon't fly like fighter planes. The film thinks they do but whatever!\nBasically the wasn't even worth my time to endure it on cable\n(satellite in my case). Don't watch it unless you want to see what will\nprobably happened to CA eventually. When? We do not know. Stay tuned.\nYes I do live in Southern California, and if/when it comes, Las Vegas\nwith have beach-front property.\n"},
{"review": "\nI late 30 minute to go in because of some reason, and i saw that\nbuilding was falling down then 2 women was in restaurant and earthquake\nwas happened. San Andreas is about earthquake happened and dad saved\nfamily. Finally San Andreas' fault broke and it occurs 9.5 earthquake.\neveryone was escaping from building and Ray was in helicopter and\ncontact with Emma. at that time i thought if helicopter with full of\nfuel, when earthquake happens helicopter will be the most safe place.\nanyway, the most impressive scene was Thsunami scene, and i thought\n2011 Japan Thsunami. when daughter stuck in water, her dad broke things\nand saved her, i also nervous and afraid. Disaster scene was so scared\nbecause too realistic. anyway i hope more people watch this.\n"},
{"review": "\nJust why was this movie made? It doesn't make any sense! The story is\nnot full of holes, it is a hole! The actors in this movie are good\nexample of how you should not act. Director Brad Peyton was given a\ngolden opportunity to create something out of nothing, but he blew it.\nWriters of the story should be drowned in oil, for insulting everyone\nwho watches this movie. Special effects are really \"special\". This\nlooks like it was made by a drunk monkey. Don't waste your time. If you\nhave 120 minutes to spend rather go and watch cloud move. I am really\ndisappointed in Dwayne Johnson and Carla Gugino. After some really good\nmovies they demolish their career's like this. Why? I don't think it\nwas about money, but I just don't understand why.\n"},
{"review": "\nThis movie is a great fun action film that did get me to feel for the\ncharacters only because I had taken a CPR class a long time ago and\nknew you have up to five minutes to resuscitate a drowning victim\nbefore brain damage or brain death sets in. That wasn't explained in\nthe film. Otherwise, the action was fast paced, well shot, and the\nsituations well explained. I am sure the science in this film is all\ncorrect. But however it it had an overall paint by the numbers feel to\nit where you never have a doubt they were going to make it out alive.\nIt did manage to avoid the movie clichés like if their are two loving\ncomical brothers in the film, one is going to die, or the black guy\ndies. It manages to miss several clichés but hits so many others.\n"},
{"review": "\nI went into the movie expecting that it could possibly be a let down\nhowever I was quite pleased with the movie overall. The special effects\nwere great and though there were a few cheesy part with the story line,\nit was a great plot in general.<br><br>I'm not a huge fan of The Rock as it comes to movies but he played the\npart pretty spot on. I could tell he was really versed in the science\nthat went into the movie. <br><br>Would I go see it in the theater again, probably not. But I will\ndefinitely look for it on Red Box.<br><br>7/10\n"},
{"review": "\nSan Andreas is a movie about mostly disasters such as earthquake and\ntsunami and also facing family problems. It is a movie which is quite\nunpredictable yet interesting. The main character, Dwayne Johnson, Ray\nGaines in the movie was a great dad and husband and he was also a hero.\nOther than just watching the movie, viewers could learn about what to\ndo and what not to do when disasters happens. But, main actor, Dwayne\nJohnson was not really injured though he went through many disasters.\nThe filming techniques are all very good, especially the special\neffects of the visual. Overall, it's a awesome movie, I really enjoyed\nit.\n"},
{"review": "\nI normally do like big disaster movies even though you know it's going\nto be much exaggerated. It doesn't really matter to me because I just\nwatch those kind of movies as entertainment. But this one is too\nridiculous for words. The amount of times I was thinking \"Pleaseeee\"...\nReally nothing can harm our super hero Dwayne Johnson. It's really\nannoying. When you think that a couple million of people just died and\nthere is absolute chaos everywhere he still finds his daughter in the\nmiddle of a devastated San Francisco. His rubber boat can apparently\ndrive through debris without being damaged at all. No bodies to be\nfound during the whole movie while the biggest earthquake ever just\noccurred. Compared to other big blockbuster disaster movies this one is\nreally the worst I ever saw.\n"},
{"review": "\nOkay, here's the deal. An apocalyptic movie with the (C)ock, like Jean\nClaude Van Damme, like Chuck Norris before him, like The Expendables\nand every Jason Statham movie ever made, need to be assessed in\ncontext. Is this movie \"The Deer Hunter\" or \"Good Will Hunting?\" No, it\nis not. But does it deliver? Yes, it f----ng does. It's fun, it's\ngrandiose, it's intense and it's over the top. But isn't that what we\nknow going in? This is what makes it enjoyable. Not having our\nexpectations high as a kite, we can really just go out and have fun\nwith this one. All the uptight, White reviewers like Richard Roeper be\nda--ed. By the way, I pretty much enjoyed Battle Las Angeles, Godzilla,\nWar of the Worlds, Outbreak and Independence Day. If you liked these\ntoo, you will like this one. Always confront the cynical haters who\nhate us for having fun, feeling good, expressing our passion, our\nsexuality and our vision. They are the conservatives of the world.\n"},
{"review": "\nAnyone expecting a similar movie to \"The Day After Tomorrow\" will\neither be disappointed or, as in my case, hugely relieved.<br><br>Featuring superb CG, witness the disaster that overtakes California and\nThe Hoover Dam.<br><br>Amidst all this, witness the casting disaster of the Welsh Bloke as a\nslimy new boyfriend of The Hero's ex-wife.<br><br>Then witness the casting oddity of that girl with large breasts that we\nall watched in \"True Detective\" in 2014, playing the student daughter\nof The Rock. Sorry honey, you do not look 20, and this site says you're\n29. It's almost as bizarre as the 30+ Maggie Grace playing Liam\nNeeson's 17 year old daughter in \"Taken\". Almost.<br><br>In short, a cheesy predictable script but an all action family tale set\nagainst the backdrop of the largest quake in history. Just enjoy it.\n"},
{"review": "\nI am here to answer questions that you might have. First and most\nimportantly. Alexandra Daddario is hot throughout the whole movie.\nThere wasn't a scene with her that I wasn't pleased with watching her\n'creeperly'.<br><br>About the movie itself. If you like scenarios based on Natural\ndisasters you will love this movie. I think its the best one out there\nin its genre. In my opinion everyone played their role good I loved the\ndramatic off-story between father daughter and ex-wife. And the way\ncharacters develop. The CGI is amazing I got goosebumps on every\ndisaster scene. The plot is what you'd expect of this kind of movie.\nAll in all 9/10. I might consider giving an extra point because\nAlexandra is so damn beautiful. Actually yes, 10/10 I love Alexandra. I\nam out!\n"},
{"review": "\nYea it was a bit predictable but I thought it was a decent movie. I\ndon't see why people thought it was terrible ... there was lots of\naction and acting was good (I usually do not enjoy the rock). I am glad\nI watched it and would recommend it as something to watch if you have\nnothing better to do.<br><br>I thought the special effects were good too, I don't pay to watch\nmovies in a theatre ... I wait for them to come out. I wouldn't spend\n$29 buying it but to download and watch for free its worth it.<br><br>Overall I am glad I watched it, and my husband enjoyed it as well. We\nwere both left wondering why it got only a 6?\n"},
{"review": "\nAfter finishing dinner, I turned on HBO and there I found it. I was\nsitting in my chair and then I was really bouncing up in it when I\nfound Dwayne, Carla and Alexandra struggling before the mighty\nearthquake of all time! What I really enjoyed in the movie is not the\nacting of its characters but the special effects which showed me the\nimagination of destruction. How a natural phenomena can destroy us in\nseconds like we were nothing before, as we are not more than just ants.\nOf course I've seen movies of this genre before but still I really\nenjoyed watching it. The charm of this movie is Alexandra's blue eyes,\nCarla's presence (as I've the crush for her) and strength of Dwayne!\n"},
{"review": "\nLike many have already said....\"IT'S A DISASTER MOVIE FOLKS!!\" Given\nthe cast I expected a rehash of previous incarnations of this genre and\nI wasn't disappointed and found the 2 hour ride a lot of fun. My\npersonal taste in movies goes from Eraserhead via the Coen Bros to\npopcorn fun like San Andreas and anyone choosing to watch this film\nexpecting a profound script and Oscar winning performances seriously\nneeds medical help. The negative tripe written in many of the reviews\nhere simply point to frustrated, wannabe film critics or people who\nstepped into the wrong door at their Multiplex Cinema!!<br><br>Fun, fast-paced disaster movie with pretty good effects... ..did you\nseriously expect more??? duh...\n"},
{"review": "\nI can't believe anyone would give this movie anything less than 7\nstars, minimum. It delivers EXACTLY what a disaster movie is supposed\nto. Yeah--it was paint by numbers stuff, with pretty much every trope\nticked off--but that's expected in the genre.<br><br>Effects were great, and plentiful. The performances were just as over\nthe top as they should have been. It was cheesy but I'd rather have\ncheesy than a movie in this category that took itself too seriously.<br><br>Rating movies isn't apples to apples. Compared to a serious movie of\ncourse this is no masterpiece. As a representative of it's genre,\nthough, it's up there with the best.\n"},
{"review": "\nIt's another gripping tail where you are on the edge of your seat\nthroughout. A tale including heartbreak, misery and loss. From real\nlife events such as Earthquakes and Tsunamis to real life pain.<br><br>One father won't stop to find his daughter amongst the crowds of\nsuffering, dying and hurt people. He first has to help his wife but can\nhe save two people at once?<br><br>San Andreas lays in ruins but he won't stop. Johnson plays the\ncharacter immensely, he truly shows his true colours as a fighter, he\nrefuses to allow his family to lose anyone else.<br><br>A must watch movie. 9 out of 10 as I didn't want it to end and I had\ngoosebumps throughout.\n"},
{"review": "\nThis is a movie - it is not real life, the people in it are not real.\nIt is a disaster movie, a story. It has all the elements that movies\nlike this have. The only thing is that it is reasonable entertainment,\na popcorn movie. The special effects are good and quite convincing. The\nyoung kid is incredibly irritating as they always are in these things\nand people ,like the daughter, get into life threatening situations\nwithout actually getting hurt while all around them (the extras) are\nbeing blown away left , right and centre. It is enjoyable fluff and one\nshould not bring to it the same critical examination that you might\nwatch The Godfather with. The Rock is the main character and does not\ndo too bad a job with it as does the rest of the cast. Kylie Minogue's\npart is all too brief, unfortunately. It does make one wonder that if\nthere were such a catastrophic event how would the country ever cope\nwith so much death and destruction?\n"},
{"review": "\nthat I can get over how improbably everything that happens to our\nheroes and they survive. The Rock is a LA rescuer and he is called on\nto go to Nevada after an earthquake hits. His daughter, Blake, was\ngoing with him to Orgeon, instead she will go with her mom's new\nboyfriend. But wouldn't you know it, a quake hits California, so the\nRock must save his soon to be ex-wife and daughter.<br><br>There is some cool special effects with skyscrapers tumbling down and\nthe level of destruction a huge quake would cause a city. A giant wave\nwith a cargo ship and containers falling off, which our heroes must\navoid. And then the mom's new boyfriend gets what he deserves after\nbeing vilified.<br><br>FINAL VERDICT: This is what makes a good popcorn flick. Check it out.\n"},
{"review": "\nThe truth is that I expected much more from this movie, but generally\nit was a good one. I liked the special effects which were excellent. It\nwas like I was watching news on TV. Even though the plot and the\neffects were great there was something that I really hated about this\nmovie and that thing is the actor's performance. To be honest all the\nmovie was predictable and the actors except Dwayne Johnson were very\n\"fake\". The facial expressions looked so \"fake\", especially the drama\nscenes. Some scenes gave me the feeling that this would never happen in\nreality(I mean actor's behavior) and that thing \"detuned\" me from the\nmovie. Anyway, I enjoyed the movie like many others but it wouldn't be\nvery high in my best movie list, that's why I give a \"hard\" 7...\n"},
{"review": "\nFirstly let me start with this; Brad Peyton did this whole\n\"Catastrophic Natural Disaster\" depiction better than any and all of\nRoland Emmerichs' attempts... All!<br><br>San Andreas my have been hit with a 9.6 on the richter scale, however,\non the critical scale, it hit a strongish 6.4/10.<br><br>I like that Dr Hayes (Paul) and Chief Ray (Dwayne), never meet, because\nthat's the type of thing that can contrive an entire script, for some\nunnecessary objective, which usually makes a movie of this nature,\ntediously limp along, until you actually want the world to implode.<br><br>The main characters were a tad deflated, however, the bit of back story\nwe get, is enough to combine with the awesome special effects, the cute\nlove story of Ben and Blake, and the hero antics of Dwayne, to having\nus backing and cheering all of them in the end.<br><br>Some aspects of this movie felt as if they were dismissed, which caused\nsome jerks between shifting gears, but... overall, a very enjoyable\nDisaster flick.\n"},
{"review": "\nI really love Carla Gugino but her acting was so horrible in this\nmovie, it's like she phoned it in. Maybe she just didn't want to do\nthis movie. Dwayne Johnson's acting deserves a best actor nod compared\nto her.<br><br>Now, on to the movie. Just like War Of The Worlds with Tom Cruise, this\nmovie was ridiculous in the fact that the main characters always\nescaped death within split seconds. Everybody within inches of them\ndies, but they are always spared. Some may accept this because it's a\nmovie, but it becomes a little much.<br><br>In summary, I could forgive all the ridiculousness of this movie and\nenjoy it for what it's worth, save for the miraculous last second saves\nand the very below par acting from Carla. I give it a 6 because it had\nnice effects including sound, but the movie went exactly as anyone\nwould have predicted.\n"},
{"review": "\nThis action thriller has Dwayne Johnson playing Ray Gaines, a search\nand rescue helicopter pilot, who has to change vacation plans with his\ndaughter Blake(Alexandria Daddario), when the Andreas Fault line gives\nway and the Hoover Damn is the first big calamity. Ray and his\nsoon-to-be ex-wife Emma(Carla Gugino)make a treacherous trek over a\ncrumbling Los Angeles to try and find their daughter, who is on a trip\nto San Francisco with Emma's new companion(Ioan Gruffudd). If the\nmonster magnitude 9 earthquake wasn't enough for Frisco...on comes a\ntsunami.<br><br>The whole story line just doesn't jive for some reason. The CGI\ndisaster effects did get a lot of screen time, but I just couldn't feel\nany fear or urgency. Maybe the lion's share of the budget went to \"The\nRock\" and FX. I can say that Miss Daddario had me at first sight. I'm\nnot familiar with her previous work; but she saved this movie for me!\nOther players include: Paul Giamatti, Hugo Johnstone-Burt, Art\nParkinson and Kylie Minogue.\n"},
{"review": "\nThis film should be renamed \"Outrageous and Predictable\". I've never\nuttered the phrase \"Oh, please!\" so many times during any movie.\nAlexandra Daddario is the only thing worth watching!<br><br>Slight spoiler alert: The CPR scene in the end is way too long, the\nvictim would have suffered severe brain damage after only 4 minutes and\nbeen dead after about 4-6 more. The individual applying CPR was at it\nfor what seemed to have spanned at least 5 minutes, maybe more. <br><br>Just another big budget special effects extravaganza with no substance,\nI had to suspend disbelief one too many times.<br><br>I give it a 3 overall, but a 9 for special effects, and a 10 for\nAlexandra Daddario.\n"},
{"review": "\nWhy am I not permitted to give 0 out of 10 for this disastrous insult\nto human intelligence ? No plausible storyline. Poor or no Direction.\nUnimpressive CGI. Hollow self-centered characters. Both Rock and Carla\nGugino, whom I like very much (the reason why I saw the Movie in the\nfirst place) deserve to be treated much much better . There is\nvirtually nothing to redeem the film. If I had not seen it, I would\nnever have believed that Hollywood, for which I have the highest\nrespect, had made this atrocious Movie. I thoroughly agree with all the\nearlier Reviewers who have panned this Film, who have highlighted all\nthat is ridiculous about this film, and really there is not very much I\ncan add to what has already been written. My basic and only purpose\nwriting this review is to earnestly request IMDb to please introduce a\n0 out of 10 rating, which is most appropriate for this Movie.\n"},
{"review": "\nIts NYE so i tried to find a movie that will last me until 12am , and i\ncame across San Andreas , i thought i'd check it out because Dwayne\nJohnson ( one of my favorite actors was in it ) .<br><br>To start off with , the first scene was quite unexpected because\nwatching the trailer , you would've seen that there was mass amounts of\nwreckage and destruction. But the first scene wasn't related to that at\nall.<br><br>The film started getting really intense when the first earthquakes\nhappened ( this was when the two characters were scouting for the\nearthquake readings ) , a earthquake occurred killing a character and\nmany civilians and this pretty much repeated through the whole movie ,\nearthquakes occurring and buildings clashing etc ( of not killing any\nmain characters )<br><br>I would definitely watch this film if you haven't already! It's very\nintense and full of entertainment.\n"},
{"review": "\nWhole thing is a solid 6.5 movie with effects to be astonished and\ncharacters to like. Yet, the only thing that disappointed me was\nrevival of Blake, young female protagonist, which seems to be the\ntarget audience. She was dead, I felt the loss, I was afraid of it, and\nwas afraid of revival. <br><br>It just made me repulsed of Hollywood scripts. Even after million\ndeaths say \"we'll rebuild\" and leave mourning to other characters.\nBlind optimism of that ending doesn't let me feel connected to anybody\ndepicted. It makes me hard to trust a film. It makes me feel betrayed.\nIt makes finding a film to enjoy deeply even harder.<br><br>I agree with objective average number, but find it hard to ignore the\ntrope I got sick of.\n"},
{"review": "\nThis is your brain...this is your brain on San Andreas. <br><br>The devastation in this movie was only surpassed by my loss of brain\ncells for watching this unbelievably horrible frill-ride through\nDumbsville.<br><br>It was quite obvious that there was no money left after CGI to pay for\na screenwriter, or actors. I actually think this movie would be better\nif you could turn the dialogue off and just watch the destruction and\nthe sound of explosions. You certainly wouldn't miss anything\nimportant.<br><br>How does this possibly rate higher than Earthquake! 1974, which looks\nlike an Academy award winner next to this?<br><br>It barely made 2 stars in my book and only because I know there are\nworse movies out there.<br><br>If you'd rather watch paint dry, raise your hand.\n"},
{"review": "\nDwayne 'The Rock' Johnson leads the cast in a natural catastrophe epic\ntale of Cowardliness, heroism, family love and two English characters\nthat I would have dearly loved to throttle within 60 secs of screen\ntime. This is a catastrophe not a disaster movie. If you're thinking of\nThe Towering Inferno or Earthquake you're in for a shock, this film\nmakes Poseidon (2006) look like film of the year. The opening scene is\nirrelevant, the characterisations are awful and the excessive use of\nCGI, appalling. 41 years after 'Earthquake' hit the screens, and\namazingly the original is still more realistic than this piece of\nrubbish. This is by no means the worst film this year, but considering\nthe $110m budget, this is a stinker.\n"},
{"review": "\nI wonder how a \"Search and Rescue\" operative, in the middle of a\ncatastrophic event can only get phone calls from his wife and daughter\nand not from any of the millions of other endangered people or\nactually, from his boss, colleagues or friends.... we're supposed to\nfeel for his immediate family and not for the millions of others - in\nfact during this cataclysmic event, the characters often forget that\nmillion of others are dying and they themselves are completely\n'isolated' ... oh, and they discuss domestic issues driving along in a\ncar after just watching a city crumble.. <br><br>Come on script writers - show some heart but hey, the special effects\nare great, they really were, and those who \"love special effect movies\nand to hell with a good script\" will enjoy this.\n"},
{"review": "\n\"San Andreas\" is an adventure movie in which we watch a massive\nearthquake in California and which is the result of it. In all this\nsituation we watch a man who is trying to rescue his daughter who is in\nSan Francisco with his ex-wife.<br><br>I liked this movie because it had a lot of suspense which was something\nthat kept me in tense for most of the duration of it. Although I\nbelieve that they overdid it with the visual effects and in some point\nwas a bit tiring. That was the only annoying thing that I found in this\nmovie and also that the plot was not something special but I did not\nexpect it to be. In addition to this I believe that the interpretation\nof Dwayne Johnson who played as the father of the girl was very good\nand also I liked the interpretation of Alexandra Daddario who played as\nhis daughter and she was very good.<br><br>Finally I believe that \"San Andreas\" is a nice movie to watch and to\nspend your time on it because of all the above reasons and I really\nrecommend it to you.\n"},
{"review": "\noh mannn, i have just watched this movie. i am SOOOO glad i didn't pay\nbabysitter, parking, gas, popcorn to see it in a cinema. it must be the\nmost expensive b movie ever made. badly made.<br><br>bad CGI. ,really bad screenplay. was it a joke? did our amy have a hand\nin it? is it a cyncial comment on all those poor naieve cinema goers?\nyes, we can sell you this mierda AND get away with it.<br><br>our hero, a helicopter pilot, yes, a HELICOPTER pilot, drives 150/200\ntowards st fran before realising that maybe another plane or helicopter\nmight just be a good idea....oh the rock, between his ears....<br><br>i live in the village in spain where the founder of st. francisco came\nfrom. good riddance i think he would have said.<br><br>&amp; the end. borrowed out of day after tomorrow....helicopters (from\nwhere?) flying in to rescue them...he could have rescued a few of the\nfee paying suckers as well\n"},
{"review": "\nAn earthquake strikes in California and nothing -but nothing- is like\nit used to be. This is a movie that you know from the beginning that\nspecial effects are having the leading role. The cast is okay (their\nperformances is not for an Oscar and they know it) and their characters\nare as much interesting as a typical Hollywood blockbuster demands. I\nhad fun with San Andreas, the special effects left me amazed and I\ndidn't look my watch even for a minute. Okay, the story is about an\nearthquake, so you have a little bit of a drama too, but don't worry\nabout it, Dwayne's Johnson muscles -for the ladies- and Alexandra's\nDaddario eyes -for the boys- should do the trick.\n"},
{"review": "\nI really do not understand what is going on in the minds of the people\nwriting negative reviews for this movie. <br><br>I thought this movie was totally and absolutely fantastic. The acting,\nscreen writing, drama, special effects, and sheer magnitude and scale\nof this utterly fantastic movie will leave you glued to the screen with\na thrill that other movies just can't do.<br><br>Moreover, this movie is actually based on fact, and is not merely\nhypothetical, but truly can and will happen. Like he said in the movie,\nit's not a matter of if, it's a matter of when (don't worry, this is\nnot a spoiler). This will touch home to my fellow Californians.<br><br>I highly recommend this movie, you will not regret it!\n"},
{"review": "\nWhen they did the first scene of the woman driving along the roads not\npaying attention I thought this film might stand a chance by the way\nthey did it but then the Helicopter performed a physics defying stunt\nand it just went downhill from there.<br><br>Some of the acting was OK Some of the Computer Generated scenes even\nseemed to be almost real.<br><br>But anyone who gave this film more than a two score is either a\ncomplete fool or a total fan of Dwayne who probably just did this for\nthe money as the character he played was so badly written and\nunrealistically lucky that he couldn't have done it for the challenge.<br><br>I've seen much better films with a score of 4!\n"},
{"review": "\nIt's CGI destruction time as Dwayne Johnson battles earthquakes and a\ntsunami to go rescue his daughter - with estranged wife in tow of\ncourse.<br><br>Disaster films are easy to kick because very rarely they are nothing\nmore than candy carnage with a trite screenplay and cheese laden\ndialogue. Such is the case with San Andreas. In essence this is a\nremake of Roland Emmerich's 2012, only this is the shorter version with\nthe time span that 2012 should have had. This does exactly what the\nmarketing department promised it would, namely lots of crash bang and\nwallop, but just like Emmerich's behemoth it gets boring entering the\nfinal third, the writing just not good enough to hold interest once the\nnoise and destruction dies down before the big finale arrives. Suspense\nis absent, emotional investment in characters is null and void, while\nthere are no worthwhile surprises in store. But on the plus side\nJohnson is a likable guy and he carries us through till the end of what\nis a fun movie if expectation levels are appropriately set at dumb\npopcorn fodder. 6/10\n"},
{"review": "\nTo tell the truth, I didn't expect much from this disaster of a movie.\nNot wanting to waste $5, I waited for the film to come out for rental\non Blu-Ray. The technical mistakes have been cited by others and I will\nnot reiterate them. The acting, what little there is, was not\nsurprising giving the cast and subject matter. I make exception for\nPaul Giamatti. The majority of the credits for the film go to the\nspecial effects people, as unbelievable as they are. Two outstanding\npoints in this film belong to Alexandra Daddario; and her eyes are not\nbad either. Hence my rating of 2 rather than 1. God, I'm sure glad I\ndidn't waste two hours in a theater watching this tragedy of a\ndisaster. It is certainly too bad it grossed roughly five times more\nthan its budget. That will only encourage more of the same ilk.\n"},
{"review": "\nThrilling film!Having watched the film it had a sense of family life\nwhich made it that more engaging and thrilling...but to be honest it\nwas a bit too predictable towards the end. <br><br>The whole film together was an insight to the struggle of natural\ndisasters which made it that much more sympathetic. Was a great watch,\nI would recommend it to friends.<br><br>It is the type of film that restores my faith in humanity. Not one\nperson was selfish enough to just save themselves, but it was nice to\nsee people work together to fight for survival in the circumstances\nthat faced them.\n"},
{"review": "\nI like action/suspense movies as much as the next guy, but when they\nare unrealistic as San Andreas I get embarrassed for watching it. I\ncouldn't even finish the movie it was so bad! <br><br>Why can't Hollywood make realistic Action/suspense films? I realize\nthat most of the people who like these movies don't care or realize the\nfaulty science behind these action scenes, but come on! Ask a real\nexpert to consult!! Please!<br><br>I've taken college classes about earthquakes, and even the most entry\nlevel students could debunk most of the crap that was in this film. For\nexample, taller building are safer during earthquakes because they sway\nat a lower rate than shorter buildings...<br><br>And don't get me started on the Helicopter scenes! ugh!\n"},
{"review": "\nThis is the very definition of mindless summer escapism. It's like a\nroller coaster on film. It promises a wild ride that excites the\naudience without any intellectual effort and it delivers on its\npromise. Many have complained that the script isn't very intelligent.\nThey're right. Every character is just a prop with an invisible label,\nevery actor in it has nothing to do but act out their characters'\nclichés, every disaster movie cliché is recycled, and every major scene\nwill surprise no one who has seen a disaster movie before. When the end\ncomes for so many millions, no one stops to mourn, they just rush to\nthe next scene with no thought. It was brainless and obvious, but so\nwhat? I was on the my seat anyway. Films like \"The Poseidon Adventure,\"\n\"Independence Day,\" and especially \"Earthquake\" have done the same\nthing, deliver mayhem and near-death experiences with style and\nexpertise. I enjoyed it in spite of myself and so will anyone else who\nsees it.\n"},
{"review": "\nThis is a classic of disaster movies: a plot that makes no sense,\ncharacters that seem to exist in a bubble of their own and ridiculous\njustifications for plot advancements BUT destruction on a scale unseen\nso far, absolutely incredible special effects and disastrous (in the\ngood way in that case) quakes &amp; tsunamis. In that sense, no surprise.\nYet, somehow, one would have hoped that this movie would break the mold\nand make sense. But we have to compose with a grand total of 10?\ncharacters; a \"hero\" that goes from LA to San Francisco in a\nhelicopter, a plane, a car and then a boat to rescue his ex wife and\nhis daughter. Let's just woefully ignore that this would have caused\nthe death of 30 million people at least and cheer. Average score\nbecause it met the expectation and was good looking in its disaster.\n"},
{"review": "\nWas looking forward to this but almost turned it off after the first\nearthquake scene. The director should have at least watched some real\nvideos of earthquakes.<br><br>To be chatting and running in those sort of earthquakes is simply\nimpossible and kills the atmosphere. An large earthquake is as loud as\na truck driving past and almost impossible to stand upright during, let\nalone running back and forth across dams etc.<br><br>I realise this is a small thing but hey it's what the entire movie was\nbased around so getting the basics right would have helped.<br><br>Acting was average (5 out of 10), special effects OK (6 out of 10), far\nto many \"coincidences\" which actually push the movie over the point of\nridiculously bad (1 out of 10).\n"},
{"review": "\nwell, certainly you gonna enjoy the 2 hours of watching, it is a very\ngood movie overall, the top winner here is the great visual effects,\nstunning, maybe in some parts you feel like they were done in a hurry,\nbut of course we all know what is done when one is behind schedule, the\nmovie is running in a fast pace so you need to keep your breath\nfollowing it. The storyline is somehow repeated and there are some\nflaws in it. The script has nothing special except may be one quote \"If\nyou couldn't save her, then nobody could have.\" well, I liked it\nmyself, what u think? acting from all characters is good but no way to\neven dream about an Oscar there is nothing special about any of them,\nthe human side and survival instinct could have been better used, these\nare the main lines I need to talk about, but again a very good movie,\nand I enjoyed it and certainly recommend it\n"},
{"review": "\nI had huge expectation from this movie , was expecting some outstanding\n3d effects and story.. Ater watching movie it was more about Mr. ROCK\nsaving his family not others... so why name the movie as San Andreas\n??? They tried to show all possible disaster in one shot, earthquake\ntsunami flood etc and one man is flying all the way to save his family\nbut no other aid to save nation. Logic was missing. Still Good one time\nwatch and specially kids enjoyed it a lot... so I give 6. I would\nrecommend this too. Go for it if you want to enjoy showing your kids\nall woo effects and teach some lesson on science. Don't expect any\nstory or script.\n"},
{"review": "\nSan Andreas is directed by Brad Petyon, starring Dwayne\"the rock\"\nJohnson, Carla Gugino, and Alexandra Daddario. It's about Ray(the\nRock), he's a rescue copper pilot and when an huge earthquake hits\nCalifornia, you will see Ray and his family trying to survive this\ndisaster. First off this movie shows that the rock can carry his own\nmovie and be great In it. The bad thing is that the rock is one of the\nfew good things about San Andreas. The visuals are good but at some\ntimes you can see bad CGI. Some of scenes are breathtaking and need to\nbe seen on a big screen. The acting is good by everyone. If the rock\nwasn't the star of the movie, it wouldn't be a good movie at all.The\nRock is just a likable star. Overall San Andreas was a good disaster\nmovie,with a good performance by the rock and great disaster scenes.\nYou don't need to rush to the theater to see this but it also wouldn't\nbe a waste of your money.\n"},
{"review": "\nI'm not like this movie at all, I think it presented on a way too much\nand make me said \"such a fool\". first thing in my mind when earthquake\nhappen people should run to the nearest meeting point not run into the\ntop of a building. and everyone is panic i don't know how a person fall\ndown from a table like a drunk person, how a chef burn or people just\nscared and stay on their place not running away. a rescue person using\nan instance helicopter like that is his personal helicopter to save his\nown family not public that he should to save them all. and where the\nother rescue people? I just watch a half of this movie and I don't like\nit at all.\n"},
{"review": "\nWhile Sharknado was meant to be good fun San Andreas was meant to be\nall serious. The quality of the stories are the same but where\nSharknado was meant to be fun San Andreas is just plain ridiculous and\nstupid. When some of the reviewers say that San Andreas is a good\ndisaster movie they must have been seeing something I did not see. Yes,\nthe destruction of the city looks good but when they mix in scenes so\nunrealistic and stupidly heroish it all falls apart. I guess they\nintended to add at least some realism to the movie but there is not a\nscene in the movie that even comes close to being realistic.<br><br>OMG! Did I mention the acting and the dialogue? It's not worth the\nenergy talking about it. See it for yourself and cry (or laugh if you\nlike pain).<br><br>I want to see \"Sharknado in San Andreas\". That could have been a good\nmovie. As long as it is not intended to be taken seriously. Because\nthat is not what San Andreas is. It basically sucks and is nowhere near\nbeing realistic.\n"},
{"review": "\nHi this is my first time so i am a little shy so hear goes This movie\nis really great and is totally funny when this jerk gets crushed by\ncargo and i love the actors that played in this movie they really did a\ngreat job. they kept to whats going on not like other movies that i\nhave seen which is not that much. Its great action movie and i would\nrecommend this to all of my friends.I love action movies and this is\none of my top 20. Even though i gave this movie an 8 there is still\nsome problems and you don't really see any of them in the movie when\nyou watch it.What can i say about the movie the scenes are great and\nits as i wrote its a great movie and i love the actors. this is the\nbest movie so far for 2015.\n"},
{"review": "\nThis is not a movie which leaves your wondering, I can sum up the\nmovie. The Rock is getting divorced due to his inability to talk about\nhis daughter's death who drowned and he feels responsible, he has\nanother daughter the very fit Alexandra Daddario who was a lot better\nin True Detectives, the wife is getting shacked up with an obnoxious\narchitect. Earthquake strikes daughter hooks up with an English bloke\nand his annoying brother both who went to the Dick van Dyke school of\nfake English accents. Smarmy architect gets wiped The Rock saves the\nday, rescues daughter, wife falls in love with the Rock, the Rock\nrebuilds America. Oddly after a busy week at work I did not hate it,\nquite enjoyed the visual effects and I really could put my brain in\nneutral, the acting was non existent as it really was a side show to\nthe unrealistic scenes such as sailing up a 90 degree wall of water.\n"},
{"review": "\nDon't waste your time on this piece of junk. The movie is story wise\nweak, effects are crap and the acting... is sub par. Granted Carla\nGugino is one of if not the most sexy woman in the world so she is the\nsole reason i gave it 3 stars. As for Dwayne Johnson.... He failed, i\nusually love his movies but in this one nothing works. Its just a mess\nwith poor writing and poor acting. The only good acting comes from Ioan\nGruffudd who is hardly in the movie.... Sad panda.<br><br>The ripoff movie, San Andreas Quake, is better! Watch that instead :P\nOr go watch paint dry! Or go watch the laundry machine do its spin\ncycle.... Or go watch grass grow! All solid options that are better use\nof time.\n"},
{"review": "\nDespite giving this movie a 7 out of 10, it was pretty bad. I like\nDwayne Johnson and I love disaster movies, hence the 7/10, but be\nprepared to suspend all sense of reality during this dismal serving of\nego-centric poo. This is a movie for teenagers, young teenagers at\nthat, and certainly not for anyone looking to immerse themselves in\nanything close to realism. The acting was fine, the special effects\nwere pretty good, and the suspense factor was high, but the story was\nAWFUL!<br><br>If I did not know better, I would say this movie was made in a rush, as\nthough someone at the top was about to drop it, so the producers hacked\nit together as quickly as possible. Come on Dwayne, you can do better\nthan this, I have seen you do it, so stop taking on second rate roles\nand step up to the plate where you belong. This movie does not do you\ncredit sir.\n"},
{"review": "\nIf you want a couple of hours of action-packed entertainment without\nhaving to concentrate on plot and dialogue then this is the film to\nwatch.<br><br>The action scenes are plentiful and the effects are great, but there is\na bit of hammy acting, some implausible action scenes and it is all\nquite predictable, offering nothing new in the disaster movie genre.\nHowever, what is impressive is that it's all done on a massive scale,\nwith the disaster stakes really ramped up.<br><br>It's not a classic, but for the most part does the disaster/action\ngenre well and if you can live with the few gripes I mentioned above\n(which are only sporadic) then I'm sure you'll enjoy it as I did.\n"},
{"review": "\nThe disaster movie genre started in the 70s with such films as the\nTowering Inferno. They were usually ham fisted star studded turkeys.\nWhile the plot and dialogue in this one is pretty pedestrian, over all\nit is entertaining without being graphic or sexual, beyond the usual\ndamsel, or in this case, his daughter, in distress. It is a good family\nfilm that serves up the action and special effects but keeps it\ngrounded, albeit cheesy at times. Sure, the two English brothers who\nsaved his daughter at first then she saves them is pretty schmaltzy but\nnot too terrible. Add the cad of a potential step father who wimps out\nto save himself, in order to set up a possible re-union between the\nRock and his ex, played by Carla Gugino, borderline cheese too.<br><br>The Rock is so much a better action hero he-man type than his 80s\npredecessors like Stallone and Lundgren it isn't worth the comparison.\nNot that he is a great actor, but he has much better screen presence.<br><br>In all, it is a good enjoyable disaster movie and an easy watch, and\nsafe for the kids too\n"},
{"review": "\nI am normally satisfied by most reviews about movies I enjoyed.\nSometimes I disagree with a review and feel like commenting. San\nAndreas is a movie that is underrated, I think because it is\nunpretentious and kind of heroic. It's not about the acting which is\nmore than convincing but it's about the totality of the disaster and\nthe miraculous survival of a hand full of people, led by Dwayne Johnson\nin a very convincing role as a dad trying to save his daughter from a\ndisastrous earthquake and a humongous tsunami in San Francisco. The\nspecial effects were so realistic they were unbelievable. My wife and I\nwere literally transfixed watching this movie. And by the way if you\nlike Dwayne Johnson you will enjoy his character in the movie. If you\njust want to have a heart-pumping realistic couple of hours fun, this\nis the movie. Look for fun and ignore the bull crap.\n"},
{"review": "\nPeople seem to hate this film but just accept it for what it is - a\nformulaic disaster movie. There's not much you haven't already seen in\n'The Day After Tomorrow' (ooops there goes the Hollywood sign\nagain....) but there are some neat special effects and inventive ways\nfor people to get flattened by falling roofs/buildings/shipping\ncontainers... It was an enjoyable little romp and for 'us Brits' it was\nfun to see Kylie Minogue come to a grisly end (yes I know she's\nAustralian but she's v famous over here). Don't expect anything deep\nand meaningful - the American film studios' fondness for saccharine\nendings is here as per usual) - but don't dismiss it so quickly either.\n"},
{"review": "\nGreetings from Lithuania.<br><br>If \"San Andreas\" (2015) is the first movie you have seen in your life,\nit will blow you away. But if in case you have seen ~10 movies in your\nlife, you have already seen \"San Andreas\". This is disaster movie made\nby a book - tons of clichés, cheeze dialogs, happy ending when millions\nhave died and etc. \"San Andreas\" plays more like a rip-off from 2012,\nbut the problem is that this movie doesn't have John Cusack, instead it\nhas the always likable but miscast in this movie Dwayne Johnson who has\nto say corky lines. Dialogs are also predictable as well as 2D\ncharacters. Special effects on the other hand were truly spectacular,\nand i liked the tension at the end, although like everything else in\nthis movie the outcome is seen by a mile.<br><br>Overall, \"San Andreas\" is not a bad movie by any means, but it is\nsurprisingly to formulaic and predictable and flat. It is disaster\nmovie for the whole family, to which you won't going to back for a\nsecond viewing.\n"},
{"review": "\nFirst of all, this movie is definitely not intended for those who are\nseeking some accurate scientific depiction of natural disasters. They\nmight want to watch a documentary instead. This movie is intended to\nentertain audience, so if you're seeking an edge of the seat thriller,\nyou're going to enjoy this one. <br><br>The Rock, who plays a firefighter, sets out to rescue his family after\na powerful earthquake hits San Francisco. In some ways, this movie\nlooks like an imitation of 2012 (2012). There are similar computer\ngenerated scenes of massive destruction, aircraft maneuvering through\nfalling buildings, massive tsunami waves carrying ships onto land and\nso on. <br><br>Acting is just fine, plot is very narrow, and overall the movie is full\nof cinematic clichés. Nevertheless, watching it on big screen in 3D is\ndefinitely going to thrill the audience.\n"},
{"review": "\nIf aliens and a T-Rex had appeared out of the San Andreas fault and\ntransformed all the tomatoes in California into flesh eating bacteria,\nthis movie would have had a chance. The script is wretched, the action\nis completely unrealistic. All acting talent the performers could must\nis woefully insufficient to cover the ridiculously juvenile script\ndesign. From the very first scene of a girl, a car, a mountain road,\nand the ridiculous tumble down a mountainside, the movie wreaks of\nover-reaching effects and underdeveloped characters. This movie ranks\nright down there with Rambo and Missing In Action. My wife said it\nbest...hokey.\n"}
]