[
{"review": "\nI always find my viewing experience of the retelling of historical\nevents ruined when I come across scenes which I know have been added\nfor dramatic effect or when someone is played as a bad guy just to let\nus know who to root for.<br><br>The King's Speech was particularly guilty of the former, the portrayal\nof other teams in Glory Road had the latter, and The Imitation Game was\nshamelessly guilty of both. I'm not saying this made them bad films,\nbut it certainly made me feel like the experience had strayed away from\na retelling of the facts as known.<br><br>Everest is everything that is good in such a film. There is no needless\ngood v evil addition and no leading the viewer to conclusions. It tells\nthe story and I have since spent three or four days thinking about the\nhows, whys and wherefores... whilst knowing I will never find an\nanswer.<br><br>The other touch that really elevates this film is that there are no\nadded action sequences that have been added to make Everest more of an\naction move. The film makers have been intelligent enough to realise\nthat climbing Everest does not need any exaggeration, the characters\ninvolved were three dimensional people, and the story was interesting\nenough not to need embellishment.<br><br>I expected an action film but left pleasantly surprised by a biopic\nwith a light touch.<br><br>The one mark deduction is for the totally unnecessary 3D. The film\nabsolutely didn't need me wearing dumb glasses to be three dimensional.\n"},
{"review": "\nLike the real mountain, this movie is stunning to look at but a little\npainful to watch. I kept longing for the voice-over guy from The\nDeadliest Catch to chime in with some compelling back story about the\ncharacters or the situation, just to ramp up the tension a little. We\ndon't get much time to get to know the characters; most of their lines\nare designed mainly to give us information rather than developing their\nindividual personalities. We are left with archetypes: the Loudmouth\nTexan, the Humble Mailman, the Brash Adventurer, the Careful Tour\nGuide, the Taciturn Journalist. And then there's the annoying Keira\nKnightly, on hand with her squeaky mouse voice and her runny nose, to\nmake sure everyone in the audience has a good cry.<br><br>I wish the movie had been more about Rob Hall--his hubris and his\nheroism is really the heart and soul of this story. But you can't have\neverything in two hours, can you?\n"},
{"review": "\nThis is the true story of two different expeditions in 1996 who attempt\nto scale Everest but encounter massive storms on the descent down the\nmountain. Everest is a stunning looking film that you come away from ,\nfeeling totally exhausted. Because it is so realistic you do feel you\nare with the climbers at times. Sure , it's a stock disaster movie but\nbecause of the nature of the true story behind it , you feel more\nconnected. The special affects are amazing and the performances from\nJason Clarke and Keira Knightley are great too. I watched this in 3D\nbut ended up taking the glasses off because it was so annoyingly dark\nso i recommend watching it in 2D instead. It's a staggering statistic\nthat 1 in 4 people who attempt to get get to the summit of Everest ,\ndies. Why do people do it? that question is asked in this film but\napart from the stock answer of \" Because it's there\" it is never really\nanswered . Perhaps there isn't one?\n"},
{"review": "\nHaving read John Krakauer's account of the doomed Everest climb in his\nbook \"Into Thin Air\" I was anticipating a much more dramatic film with\na gripping script. The wonderful ensemble of actors didn't have much to\nwork with. The film is monotone with no edge-of-seat moments -- given\nthe life-or-death extreme setting. And not much of a dramatic\nsoundtrack either. The film has no cadence at all and just comes off as\na flat docudrama. The only highly emotional moment is when a dying Rob\nHall makes a final call to his wife in New Zealand. <br><br>I am especially disappointed that a compelling part of Krakauer's\nnarrative is almost completely left out. If there is one pivotal\nanti-hero in this story it is the NY socialite Sandy Pittman Hill.\nShe's accused of causing many of the crucial delays to the other\nclients' ascent. Without these delays the climbers likely would have\nlikely gotten back to base camp before the storm came. The film shows\none of these critical delays in the absence of rope lines being fixed\nto the summit. But the film never bothers to explain why this happened.\nIn reality Pittman's distraction of the Sherpa responsible for\ninstalling rope lines is to blame \u0096 at least according to Krakauer. <br><br>This would have made for high drama, but the filmmakers inexplicably\nshow her character in just a few brief shots. One wonders if they were\nthreatened with a libel suit by Pittman, or simply co-opted by her\nwhen, I assume, they interviewed her for background.<br><br>The blend of special effect and cinematography is excellent, and it's\nnot to be missed in 3D. But the story suffers from lack of oxygen.\n"},
{"review": "\nBased on real life events in 1996, this dramatic thriller tells the\nstory of Kiwi mountain-climber Rob Hall (Jason Clarke) as he leads a\ngroup of mountaineering enthusiasts on an expedition to the peak of Mt.\nEverest. Kicking off with Hall and his team boarding a plane to Nepal,\nthere's very little backstory provided for any of the numerous players\nbeing followed, with the focus squarely on their physically demanding\njourney ahead. And here's the rub: the film homes in so intently on the\nclimb itself, with gorgeous cinematography and tense, cleverly designed\nset pieces, that it doesn't take the time to actually make us care for\nthose in this life-threatening situation. Additional groundwork from\nthe onset getting to know the eclectic group of adventurers better\ncould have upped the ante even more, adding extra heft in the second\nhalf when things don't go according to plan. Yet there's no denying\nIcelandic director Baltasar Kormakur (Contraband, 2 Guns) presents the\naction and generates thrills with impressive craftsmanship, aided by\nseamless CGI and Salvatore Totino's Oscar-worthy photography. It's one\nof those rare motion pictures where the employment of 3D genuinely\nintensifies the experience too, lending depth and height to the\nextraordinary environment that is Mt. Everest. Kormakur also lands a\ncast to die for \u0096 including Clarke, Jake Gyllenhaal, John Hawkes, Josh\nBrolin, Keira Knightely, Robin Wright and Emily Watson \u0096 but wastes\nmost of them, especially the women, in slight roles with no meat on the\nbones. Everest is a solid cinematic outing with just enough excitement\nand tension to compensate for the frustratingly underdeveloped\ncharacters.\n"},
{"review": "\nOnce again I've gone to the movies with high expectations and been\ndisappointed. My expectations fell off the mountain and landed in a\nheap of \"what was I thinking and I want my money back!\"<br><br>This film was way too long for the story told. Viewers are given the\nthinnest possible background of the people involved. One man is from\nTexas and apparently very wealthy. He can afford to hire a helicopter\nto come rescue him off the mountain. One woman is Japanese and has\nclimbed six other peaks. One guy is a hippie type who likes to sunbathe\nin his undershorts at base camp. Another is a married man expecting his\nfirst child. One climber is pretty old to still be climbing mountains\nand doesn't seem well.<br><br>So, okay. That's all we know about them. After that, it's up the\nmountain they go and some of them don't make it back. It's pretty\ndifficult to feel scared or concerned or any other emotion about\ncomplete strangers whose lives are not explained in the least.<br><br>I'm giving the film a \"3\" out of \"10\" rating because the scenery and\nthe mountain itself is beautiful, but I could have found that out in a\ntravel documentary. Meh. Save your money.\n"},
{"review": "\nIt is going to be hard to make a review of this movie last 10 lines\nbecause it is that bad. OK, some of the scenery of Mount Everest was\ngood. There were a few well known actors in the movie, but they were\ngiven parts that were uninteresting in some cases. Some of the dialog\nwas either at low volume or spoken in another language, it was hard to\ntell. I realize this was a true story, not a made up story. Another\ncouple of reviewers mentioned that one would be better off watching\n\"Vertical Limit.\" Unfortunately, they are correct. I love books and\nmovies about mountains, but not this one. Here is my final observation\nof what I thought about this movie. After 30-45 minutes into the show,\nI was hoping it would soon be over.\n"},
{"review": "\nAnd i say that with the greatest respect for some of the cast who do\nwhat they can with the script.<br><br>Its biggest failing is that its over a decade too late, the story is\nwell known (well the real true story, not this Hollywood abomination -\nwhen has a true story survived the bs filter that Hollywood slaps on\nany of them), and has been covered in documentaries, newspaper articles\netc.<br><br>Its about as timely as Hollywood coming up with Battle Of\nBritain....years too late Can we like move the movie industry away form\nthe hackville that is Hollywood, no ones had am original thought there\nin at least a decade...M Night Shamalan was the last person widely\nregarded as having an original idea (or pretty close to it), and even\nhe couldn't maintain it for another film. Hollywood, your time is up,\nthis movie proves it. No new ideas ....<br><br>I gave 3 stars for the 3 main stars, the main characters i would like\nin any other film. Seriously why is Keira Knightley even here? If i\nwere her id fire her agent for the few spliced in bits she gets. Shes\nwasted here, but then, so is everyone else. Just when she was starting\nto get interesting (to me) and doing things like Laggies and Imitation\nGame - you know things that a man can actually watch and enjoy...and\nwhich she is REALLY great in, she gets this unpolished turd.<br><br>The whole thing is a colossal clusterfudge\n"},
{"review": "\nThe hype surrounding this movie made we want to go see a fantastic\naction drama with awesome camera work.<br><br>I didn't get any of it.<br><br>Characters were shallow and the chance to show us a 3D spectacle were\nhopelessley missed.<br><br>I felt I didn't care about the rich people wanting to do something real\nand felt as if there wasn't enough in the story about the local people\nor way of life.<br><br>Not so much a disaster movie as a disaster.<br><br>So much potential wasted .\n"},
{"review": "\nalmost fell asleep in this film. cardboard characters, little or no\nplot except the obvious. 3d effects unimpressive and cannot understand\nwhy others rate it so highly.no excitement at all. the only person who\nmay have been of interest was Doug the postman. why not build the film\naround him - he'd tried and failed 3 times before so how did he fail,\nwhat's his continuing motivation other than the obvious and where does\na postman get the money to climb? that's how i would have approached\nthe story. also Rob the leader says near the beginning that his\ndecision is final and if they have to turn back it is his decision. but\nas soon as Doug starts whining he allows him to continue when\nconditions (the weather and Doug's) are so clearly against a successful\nsummit bid. also the women in the film are an unnecessary distraction\nand have no real bearing on the story. at the end i couldn't have cared\nless who lived or died - just wanted to get home for a cup of tea.\n"},
{"review": "\nI have no doubt this movie will pick up a lot of Oscars in the\ntechnical categories, but will miss out on acting. That's not to say\nit's badly acted, but it is the story itself that is so compelling.<br><br>The soundtrack and cinematography are just amazing! And the 3D IMAX\nreally add to the spectacle of the whole experience.<br><br>I think you need a combination of courage and madness to take on\nEverest as it has been the final resting place of many a climber. You\nare in awe of the majesty of this mountain. Whether you make it or not\nisn't just dependent on your experience as a climber, you are at the\nmercy of the elements that can change dramatically within a few hours.<br><br>You don't have to have an interest in climbing to appreciate this\nmovie. This drama is based on actual events. The pace and direction are\nvery good. You don't learn a whole lot about many of the characters,\nbut they all have the same goal and ambition. I admire their courage,\nbut I like my adrenalin in a controlled environment at Cedar Point,\nOhio!!!! If this movie subject appeals to you, it is well worth seeing\n- and you should also check out the docu-drama Touching The Void!\n"},
{"review": "\nThis movie is filled with great scenes of the mountain, but could not\neven remotely stand close to the book. They don't concentrate on any\none character for more then a few minutes and when people start to get\nleft behind you don't really get any part of the real story. A huge\nbreak from even the made for TV movie which I thought was horrible but\nnow would choose to watch that over this remake any day of the week. An\nawesome book, an awesome and sad story, a Hollywood version where the\ncharacters are flat. Sorry - I would give this a 0 if it were an\noption. Go out and watch the original and read the book because you\nneed it to follow this story.\n"},
{"review": "\nIn 1996, the leaders of the commercial expeditions Adventure\nConsultants and Mountain Madness, Rob Hall (Jason Clarke) and Scott\nFischer (Jake Gyllenhaal), decide to team up to climb the Everest\ntogether. After the brief preparation and training, they attempt to\nreach the summit. However a blizzard strikes the Everest and they need\nto urgently descent the mountain. Rob loses some clients and when the\noxygen bottle runs out, Rob discovers that there are no spare bottles\non the location that it should be. His friend Doug Hansen (John Hawkes)\nfalls off the path and dies and Rob is stranded near the top of the\nEverest. Meanwhile Scott is totally exhausted and his clients continue\nto descent leaving Scott, the veteran Yasuko Namba (Naoko Mori) and the\nTexan Beck Weathers (Josh Brolin) behind. Later the rescue team\nsucceeds in saving Beck that has lost both hands and nose. In the end,\nthe survivors return home and Rob's corpse is left in Everest. <br><br>\"Everest\" is an impressively realistic film based on a true story. It\nis hard to see what is real and what special effects along the film\nare. The screenplay uses personal dramas entwined with the lead story\nand the direction is tight. The cast with famous names has great\nperformance and this film is highly recommended. My vote is seven.<br><br>Title (Brazil): \"Everest\"\n"},
{"review": "\nBoring, dull and full of unnecessary parts till the last part where the\ndisaster struck on the way back. <br><br>Jake Gyllenhaal was just grinning at everyone who says anything to him,\nand lying down topless at the base camp at EVEREST. I think that sums\nit up. <br><br>Cannot believe Rob, the lead character, ignores everything he knows and\nsuccumbs to his emotions and dies as the result of his illogical\nactions. Probably the best part of it was to see the real characters\nthat lived through (or could not unfortunately) the disaster that took\nplace in 1996.\n"},
{"review": "\nEverest<br><br>To capitalize off of inexperienced climbers, Nepal should really open a\nfuneral parlor on the side of Everest.<br><br>Case in point, the imperiled alpinists in this fact based thriller.<br><br>When competing commercial climbing companies descend on the legendary\nsummit in the spring of 1996, team leaders Rob Hall (Jason Clarke),\nScott Fischer (Jake Gyllenhaal) and their cliental (Josh Brolin, Sam\nWorthington, John Hawkes) are not prepared for the storm that strands\nthem on the slope, sans oxygen.<br><br>Meanwhile, the wives of the marooned mountaineers (Robin Wright, Keira\nKnightley) await word of their rescue, expecting the worst.<br><br>While it's hard to empathize with the willing participants and their\ndeath wishes, you can't help but feel for their families, or deny the\nwhite-knuckle action or edge-of-your-seat excitement emanating from\nthis ill-fated expedition.<br><br>On the bright side, at least the Yeti population now has a surplus of\nfrozen meals for the week. <br><br>Yellow Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nRun-of-the-mill, definitely an average film. The soundtrack was utterly\nboring, Baltasar Kormákur could have utilized the script much more.\nEventually it is a drama, terrible tragedies happened to the climbers.<br><br>The moment when they reached the summit of the everest in my opinion\nwas too weak emotionally, not any dramatic catharsis nor emotive\nupheaval. I really missed these feelings. The memorable events and\nturning points was primitive and did not bring forth deep sentiment.\nFor example when Scott Fischer died, not any portentous moment which\ncaught me. The dead came and Fischer accepted it and fell into sleep,\nend of story. Naturally in case of Rob Hall(when he was dying) it was\ngrandiose because Keira Knightley's acting was enthralling in that\nscene. Summarizing: Could have been a classic film if Terrence Malick\nwould have directed it.\n"},
{"review": "\nWe were hoping to see more of Sherpa people's life stories than some\nrich dudes climbing the mountain. <br><br>Very bad that Hollywood chose to highlight Westerners in this movie.\nVery bad that there is very little shown about locals. No one liked it.\nWe were all very disappointed. The movie is nothing about the place. <br><br>It is all about how some rich people got into problem because of the\nweather.<br><br>None of the school students like it.<br><br>They should have made a movie about Sherpa people. Hollywood has become\nso shamelessly ignorant about diversity.\n"},
{"review": "\nI kept waiting for something to happen. It never did.<br><br>The buildup surrounding this movie had me expecting to see a thrilling\naction drama with uncanny effects, and I was badly let down.<br><br>The film badly failed to deliver.<br><br>The characters were given no backstory and we couldn't care less about\nany of them.<br><br>The effects were OK, but did not provide any real excitement.<br><br>It's a story about a group of wealthy narcissists who put their own\nthrill-seeking above the needs of their families.<br><br>Do yourself a favor and see The Martian instead.\n"},
{"review": "\nTo start, there are some positives in the film. The cinematography is\nexcellent, with both the real-life backgrounds and CGI sequences\nblending very well. Along with this, the film also does a good job with\ncreating an atmosphere for the audience. Things such as the special\neffects and the sound editing help to involve the audience in the film\nand make it seem, to some extent, that they are there on the mountain\nwith the characters.<br><br>Aside from the previously mentioned things, nothing in the film exceeds\nmediocrity. There are attempts in the first half of the film to set up\nan emotional backstory and a family subplot for multiple characters.\nHowever, so little time is spent on the topics that they come off\nfeeling completely unnecessary. This is made worse due to the fact that\nthe family elements actually end up being revisited and take up a\nconsiderable amount of time in the final act of the film.<br><br>The script and performances by the cast range from average to bad and\nnever really exceed what you would expect from a summer blockbuster.\nThis is made even more disappointing because Jake Gyllenhaal, one of\nthe most talented actors working today, was wasted in the film, barely\nfilling and screen time.<br><br>Finally, the characters in the film are in constant danger, which is\nsuppose to be the main \"thrilling\" element that is suppose to engage\nthe audience. However, due to the lack of depth given to each\ncharacter, it just leaves you not caring about the fates of the\ncharacters. Also, due to the large number of characters in the film, it\nis hard to keep track of their faces, let alone their names. This is\nespecially true during the chaotic parts of the film, when you can\nbarely see anything, let alone the faces of the people in the film.<br><br>Overall, \"Everest\" looks very nice, but nothing else in the film is\ndone particularly well, with it never being able to exceed the level of\na below average summer Hollywood blockbuster.\n"},
{"review": "\nI wasn't blown away by the trailer for this film but after reading many\npositive reviews decided to give it a go, hoping to be proved wrong.\nSadly i was not. The beginning of this film which concentrated mainly\non the preparation and walk up to base camp was so rushed and there was\nso little character development for the various climbers that\nthroughout the film i found myself asking who's this guy again? and\nfelt very little connection with them as people. I didn't think the\ncinematography did the beauty of the mountains much justice and about\nthe only redeeming feature was Jason Clarke who i thought carried this\nfilm. There were times on the mountain in blizzard conditions i hadn't\ngot the foggiest who was who or what they were saying and there was a\npoint where it felt like there were scenes missing as it seemed to jump\nvery quickly without the proper development of the plot. Disappointed!\n"},
{"review": "\nhyped to heavens this movie is not too good.. u can easily predict what\ncan happen in the next scene. its just mediocre.i anticipated a great\ndeal about the scenes in the movie. but this movie is just\ndisappointing.. the story is so predictable... hyped to heavens this\nmovie is not too good.. u can easily predict what can happen in the\nnext scene. its just mediocre.i anticipated a great deal about the\nscenes in the movie. but this movie is just disappointing.. the story\nis so predictable... hyped to heavens this movie is not too good.. u\ncan easily predict what can happen in the next scene. its just\nmediocre.i anticipated a great deal about the scenes in the movie. but\nthis movie is just disappointing.. the story is so predictable...\n"},
{"review": "\nMy sympathy most certainly goes out to those and the families involved\nin this event based on fact. The movie has a good cast and is gripping\nhowever I found it difficult to understand why anyone would do this,\nespecially a father with dependents and this made it difficult\nwatching. Everest has been done and this type of tourism is dangerous,\nit does however show facts clearly, everyone is normal and are doing\nthis because of the adventurous human spirit. It does indeed show the\nsad side effect of doing something like this for the sake of doing it.\n$65000 to climb Everest, if you want to be a hero I'm sure that money\nwould save lives elsewhere. In that respect this movie has indeed\nsucceed in showing us how lives can be carelessly thrown away.\n"},
{"review": "\nEverest stars Jason Clarke and Jake Gyllenhaal, two tour leaders who\nband together on the lucky day of the year (10th May) and tackle Mt.\nEverest. Various A-listers are amongst them, some making the ascent\n(Josh Brolin, John Hawkes), others are part of the story in different\nways (Sam Worthington, Keira Knightley). The two groups face peril when\na storm hits. You can see where this is going. Disaster are on a middle\nlevel scale. Everest is gorgeously shot, the mountain friendly during\nthe day, by night an active presence waiting for its next victim. The\nsnow is blinding, and the sheer steeps and drops will put off any\nacrophobian. The A-listers' performances are just as grand as the\nmountain, but almost no emotion is sent their way because their numbers\noutstrip our emotional demand. In the end Clarke and co. never get the\nrecognition they deserve.\n"},
{"review": "\nReviewed by: Dare Devil Kid (DDK)<br><br>Rating: 3/5 stars<br><br>\"Everest\" boasts all the dizzying cinematography a person could hope to\nget from a movie about mountain climbers in today's times, even if it's\ncontent to tread a less challenging narrative terrain. Sadly, the\nscenes of peril and danger don't have the breathtaking, gut- wrenching\nwallop you'd expect from a movie about people pitting themselves\nagainst the highest peak on the planet, even if the visuals do well in\nestablishing where the many climbers were on the mountain on that\nfateful day, and the very real, mortal dangers that lurk beneath the\nbeauty of this place.<br><br>What's really remarkable and effective about \"Everest\" is that, on a\nvisual level, it's thoroughly convincing. There is not a single moment\nhere that looks like it was computer-generated or shot against a\ngreen-screen, though in actuality it was. Also, the film succeeds in\nshowing the logistics necessary in such a climb.<br><br>Eventually, \"Everest\" is worth seeing because of the visual beauty and\ndaring camera-work involved. The story itself is a downer and only\naccomplishes in highlighting the folly and insurmountable risks of such\na trek. If you do decide to see it, make sure you get the 3D, IMAX\ntreatment \u0096 it's so involving that you leave the theater checking for\nfrostbite and never wanting to look at a mountain again, which in all\nprobability is this movie's actual accomplishment.\n"},
{"review": "\n--SPOILER---- Another waste of a good cast. This director and\nparticularly a screenwriters didn't know how to picture a thrilling\nmovie. So many filler scene that don't have any purpose at all. I don't\ncare in any of the main character at all. They are just look like a\nrich guy who have nothing else to prove in this world other than\nchallenging their life goes into Everest , one member left his pregnant\nwife alone and following his own ego climb to everest, and the other\nleft his wife and his two child also, what the? How can you have any\nsympathy with one of those character? I don't. <br><br>Even so many scene it's just look like it's not in the same area and\none would guess they were shooting at the studio, and in another\nlocation it's look like in a real ascent. I can't take this movie\nseriously, at all\n"},
{"review": "\nA group of rich men go up a mountain and get caught in a bad storm. <br><br>I found it hard to summon up any sympathy at all for any of the bland\ncharacters in this big budget bore fest. There are a lot of talented\nactors on show but none even get the chance to do anything remotely\ninteresting. What a waste, it would surely have been far better to cast\na bunch of unknowns, instead as the plot was so turgid I kept checking\nIMDb every time I spotted a familiar face, of which there are many. <br><br>From a long way out you are left hoping for the finish but steel\nyourselves because it's quite a long film. There is some nice scenery\nbut apart from that there is nothing of interest to be found here.<br><br>This is a slow moving, unengaging, poorly scripted, poorly acted mess.\nBearing in mind the budget it's one of the most disappointing films\nI've seen in a long time.\n"},
{"review": "\nAs i was watching Everest i had a strange feeling i was about to share\nthe fate of some of the characters in this movie, that i wouldn't make\nit. And sure enough my journey up Everest lasted roughly 80 mins. I\nunderstood that this mountain movie was not going to be in the same\nvein as flicks like Cliffhanger or Vertical Limit, so i was quite\ninterested in this movie as i thought it would be a deep driven\ncharacter narrative story not some lame absolute soul sucking dreck of\na movie. From the get go this flick had no hope as the actors involved\nwere lumped in to performing some of the most laughable dialogue i have\nheard in any movie for a long time and once they finally decided to\nleave one of the 3000 base camps they continuously traveled between and\nbegin the ascent up Everest it turned in to an even more hilarious\nclichéd piece of crap. The only saving grace for this movie is the drop\ndead gorgeous camera work that captures the beauty of such a harsh\nenvironment, but i'm sorry i need a bit more in a movie then just that.\nI must note as well due to the quality of actors i thought that at\nleast the individual performances would bring something to the\ntable,but i was wrong. I have seen better acting from extras in porno\nmovies so this would have to go in the back of the resume of every\ninvolved. Overall just a horrible experience and one i hope anyone who\nreads this review will avoid.\n"},
{"review": "\n'Everest' under-uses some of its key components, and some of its\nbiggest potential selling points. When I think of Mount Everest, I\nthink of it as part of a landscape. Baltasar Kormákur and some of his\ncrew apparently don't. We don't get to see much of the Himalayas, as\nthe cameras (in spite of the cover poster) keep us uncomfortably close\nto the characters. The heavy focus on the mountaineers and their\ndistressed friends gave Kormákur plenty of opportunities to appeal to\nhis viewers' sense of humanity, but he didn't capitalise on any such\nchance. We're therefore left with a paradoxically claustrophobic\nexperience in which we can neither appreciate the scenery and magnitude\nof Mount Everest, nor become invested enough in the film's characters\nto really care (which is uncomfortable, given that it's based on a true\nstory!). A number of very strong dramatic performers made an appearance\nin Kormákur's film, including Keira Knightley and Jake Gyllenhaal.\nUnfortunately, they aren't given much room to manoeuvre or display the\nextent of their talents. Frostbite-induced groaning is about as good as\nit gets for many of the cast... which may be preferable to the\nboredom-induced groaning of the audience.\n"},
{"review": "\nThis film tells the story of a group of mountaineers who attempts to\nclimb to the summit of the mighty Mount Everest. They encounter a\nsevere snow storm while descending, and their supplies of oxygen runs\nlow, creating a disastrous situation.<br><br>The plot is pretty much predictable just from looking at the poster,\nbut fortunately the visuals make it a great film to watch. The mountain\nlandscape is stunning. There are plenty of perilous situations that are\nlife threatening. The constant cliff hanging makes my adrenaline soar,\nand my palms sweat most of the time during the film! The scene of a Rob\ntalking on the phone with his wife is very touching, because I do feel\nfor Rob's character. However, there are many characters in the film\nthat are poorly developed, such as the Japanese mountaineer, and I\ndon't know much about them to care about them. If the film makes us\ncare for many of the characters, the film would have been a sure tear\njerker.\n"},
{"review": "\nBaltasar Kormákur director of \"2 Guns\" (2013), returns with this film\nbased on a true story. It narrates the events that occurred during an\nattempt to reach the highest mountain in the world, Mount Everest, in\n1996. The two expeditions to suffers all kinds of weather calamities\nfacing one of the worst snowstorms that have arisen in those mountains.<br><br>The film was also made to see in three dimensions something that is\nwell suited to film images so spectacular. This most remarkable film\ngets to keep in tension throughout the footage. There are no bad or\nmurderers characters, Everest will be the big villain who gets in\ntrouble all the characters.<br><br>The director Baltasar Kormákur has assembled a cast of good actors and\nactresses among which are: Jason Clarke, Josh Brolin, Jake Gyllenhaal,\nKeira Knightley and Emily Watson. Its onset is relaxed and calm, as if\nthere was any kind of problem in sight, but when it starts to get\ntricky climbing there is nothing to stop it.<br><br>Apart from the cast, I liked to see these natural settings, these very\nwhite landscapes and how to film director. There risky sequences that\nare very real, because with \"Vertical Limit\" (2000) Martin Campbell,\nfilm with a similar theme had many sequences where pretty special\neffects were apparent,\n"},
{"review": "\nI read the book \"Into Thin Air\" when it came out and loved it. It is\none of my favorites. I also like documentaries and docudramas. This\nfilm could have been a solid 7 or 8, but sadly is a 4,, at best. This\nis because it seemed inaccurate and agenda driven- it was as though\nthey could not show a woman in a bad light.<br><br>The movie is about two teams who are into the commercial venture of\ntaking climbers to the top of Mt. Everest, People routinely die trying\nto make the summit, so the fact that some rich people with pseudo\nexpert climbing abilities pay somebody to take them to the top is\ndangerous, and difficult to respect. Great shots of the mountain, and\nof Nepal. There is also a compelling story behind the tragedy, i.e. a\nhideous storm coming in making it difficult, or impossible , to make it\ndown alive. The problem is not so much that the movie is inaccurate ,\nthe problem is the liberties seem so agenda driven. <br><br>SPOILER- In the movie they don't just soft peddle the fact that\nsocialite Sandy Pittman had to be short roped up by an exhausted\nShirpa, they don't mention it AT ALL. The short roping was partially,\npossibly mainly , responsible for the disaster, since said Shirpa\nwasted his energy on ONE person. Thats what I got from the book at\nleast, but maybe thats just me. News Flash to film makers- when you\nmutate the story , people notice. instead they blame it some Texas\ndoctor, who delays them and acts like a jerk. It was as though they\nwere afraid to show a woman in a bad light.\n"},
{"review": "\nThe catch line on the movie poster says \"Never Let Go\" and right at the\nbottom, based on incredible true story. Never let go of what precisely?\nDoug, Harold, Rob Hall, Scott, all let go of themselves. The Sherpas\nsent to rescue Rob Hall turned back at the earliest sign of a storm and\nhis buddy at base camp literally just say, OK. and honestly, i don't\nknow how incredible a story is when more than half the climbers end up\ndead? For the dead climber's sake, i seriously hope that what was shown\nin the movie did not accurately reflect the true event, because, most,\nif not all of the dead climbers wasn't killed because of the storm,\nthey're dead because they're unbearably stupid. Take Scott for example,\nbeing a guide, he must have been to the top more than once. What's the\npoint of wasting your life just to be up there again? Rob being an\nexperienced guide should know better than to allow a weak climber\nalready low on oxygen to make summit way PAST the turnaround time! and\nit didn't take much effort to persuade him either. This movie is so\ndisturbing and depressing. What's the point in making a movie where\neveryone end up dead? While i understand this is based on true events\nwhere people actually died, i feel the writer shouldn't have made it\ninto such a morally depleting movie. Writer should at least try to make\nsomeone a hero. If you're thinking of scaling the Everest, or any\nmountain really, DO NOT WATCH THIS MOVIE. Hell, you might even retire\nfrom climbing after watching this movie.\n"},
{"review": "\nEverest is a very, very harsh place. It feels like for the major\nduration, the true harshest and bitterness is painted over. Reading a\nfew blogs uncovers horrors this film doesn't even remotely touch on.\nEarly scenes almost float around 'The Beach' - people partying, having\nfun. There's no true connection to the sacrifices that people have made\nto be there. Yes, it costs upwards of $50k - what was the true cost of\nearning that money to buy your way in?<br><br>Yes, it's verging on EPIC. Yes, the audio is fantastic. Yes, the\nvisuals are superb. Yes, you probably will enjoy it.<br><br>It just constantly feels like a very missed opportunity to tell the\ntrue story of people who have died chasing a dream that probably can't\nbe completely fulfilled.<br><br>If you want to see 'real' mountaineering, watch 'Touching the Void'.<br><br>6.9/10\n"},
{"review": "\ni was actually really looking forward to this movie, the premise seemed\ngood, and the cast of actors seemed like a sure hit on paper, the\nfinished product isn't so great which can be blamed on the films rating\n(pg) being constructing for what they could of done with it while the\ncinematography is breathtaking, and the actors mostly on point, what we\nget is a slow moving film, that really feels more a glorified\nreenactment of the what happens, then a Hollywood film. Everest moves\nat a sluggish pace all the way to end, while being predictable and\nbland throughout this film really struggles to know what it is, as it\ntentatively makes moves to be dramatic, slightly thriller with jump\nscares and nothing else much.<br><br>I must say keeping track of the characters is rather hard as unless you\nsee there faces, you mainly cant keep track of who is where, as they\nall were similar clothes, but credit is needed for trying to give back\nstory to everyone in the main story, but you really don't form any\nemotional connection with any of the characters I cant stress how much\nthis film could of either been an intense thriller or a serious drama\nand it would of been a hit instead your just waiting for this big tense\nclimatic moment to come that never does, and suddenly after one scene\nmore, it just end making it feel anticlimactic Hence the 5/10 RATING\n"},
{"review": "\nDid we really need this movie? Or is Hollywood that desperate for money\ngrabbing? The movie is all over the place. It starts off slow, keeps\ngoing slow, and ends even slower. Is it a documentary? No. Is it a\ndrama? Not quite. Is it a... what is it exactly? Who knows. Probably\nnot even the director.<br><br>The \"plot\" was known due to the 50 previous documentaries (all of which\nwere more entertaining) and movies about this tragedy, this brought\nnothing new whatsoever; except big names in an attempt to seduce you.<br><br>Adding dramatic music to boring dialog and drama-less scenes does not\ncreate drama. This movie uses this technique throughout. You think\nsomething will happen due to the music, but then like a bad horror\nmovie, nothing does happen.<br><br>Verdict: Cue dramatic music and bury it under an avalanche.\n"},
{"review": "\nWhile so many documentary movies have been made regarding MT. Everest\nand the lives lost taking on the challenge of climbing that beast.\nEverest 2015 being a 2 hour film I must say added a bit more\npersonality to what was based on actual events. Other similar movies\njumped right into showing you what the nightmare of trying to climb\nEverest is like with huge dramatics. I have to be honest about this\nfilm. It had long drawn out moments in the movie that made it a bit\nslow. This movie gave an insight on why each person was climbing the\nmountain and got an idea of what their personal lives were like before\nmaking that journey. Another thing to point out is that this version\nalso includes the beauty of its native land while even reaching the\nbase camp. With some recognizable cast like Jason Clarke, Jake\nGyllenhaal, Keira Knightley and Emily Watson. This movie had its\nmoments of laughter with random jokes and oh a scene where Jake\nGyllenhaal is topless on the mountain drinking that reminded me of a\ncertain other similar film. Everest is not on the top greatest films\nnor the bottom. The movie is more for documentary lovers with a tad bit\nof let me touch your feels in it. Everest is a decent movie. By: Vorpal\nBunni of WoodBangers Entertainment\n"},
{"review": "\nI had the normal hopes that anyone would have for a movie of this kind.\nI did not have extremely high hopes, but they were not low, too. We'll\nhave to admit that the film is visually stunning and presents a very\ngood cinematography. The acting is quite good and solid, but not out of\nthis world, like you should expect in an Oscar bait film, that after\nwatching it, I believe it might get nominated for Best Sound Editing.\nThe story is, indeed, powerful, but it didn't live up to itself. You\nshould expect powerful intense scenes of survival and near death in a\nfilm about climbing the Everest, but you DO NOT get it. It causes nail\nbiting at times, but it never lives up to the gut-wrenching film that\nyou'd want to see here.<br><br>In the end is a 7/10. A reasonable cinematic afternoon that you can\ngive yourself. I had given 6.5 but I rounded it up to 7. Something that\nyou can expect is that the film is, sadly, very forgettable. EDIT:\nAfter further analysis, I believe that the film does not deserve a 7.\nTherefore I'm reducing it to a 6/10<br><br>6/10\n"},
{"review": "\nI give it high ranks for cinematography, but it was boring and\npredictable. What do you think is going to happen when a group of nuts\ngot out in the cold and heights for no reason at all? \"Because it's\nthere\"? For real? Is that why people risk their lives just to stand on\na mountain? While well filmed, this movie goes nowhere that you\nwouldn't expect. People get cold, run out of oxygen and freeze;\nwouldn't you expect that? I was an idiot for even giving this film a\nchance. I'm only giving it 2 stars, and that is being gracious, because\nof the cinematography. The actors are unbelievable, almost to a comic\nstate and I would not recommend you wasting your time.\n"},
{"review": "\nThe movie starts slowly but only to establish and humanize the\ndifferent important people so the viewer can figure out who is who once\nthey are up the mountain. There are many characters that the viewer can\nattach too as many of these characters die. Many of these people are\nplayed by some of the very talented actors and Jason Clarke is very\nlikable as Robb Hall. This movie feels like two different genres: it\nstarts out as a Oceans Eleven kind of movie, meeting the characters and\nplanning for a caper/ amazing feat. Then as they try to achieve this\namazing feat the movie becomes a horror film as each character is\nprogressively killed, one by one by this gigantic storm. The viewer\nreally does feel as if they are in the storm experiencing this violent\nforce of nature. All in all a very emotional recounting of a true story\nthat does justice to the people who died there with a very good movie.\n"},
{"review": "\nThis film attracted me by way of its huge advertising campaign,\nbrilliant cast ensemble and a thrilling premise. Unfortunately, it was\nvery boring. The set up in the first thirty minutes seemed rather\npromising and although the pace and characters seemed gentle and\nunassuming, I assumed there might be just a little more to look forward\nto than the hour and a half that followed. My time could have been\nsummed up by simply having someone explain what happened next, which\nwould have taken no more than thirty seconds.<br><br>If this film didn't have the cast it did then there is no way it would\nhave the score it does here on IMDb. This film is not memorable and I\ngladly forgot it's boorish tedium by engaging myself in another film\nsoon after.<br><br>I would avoid this unless you are by virtue quite a boring person, if\nso, then by all means, have at it. I would not recommend this film at\nall. It's basically a news article clipping that has been expanded with\na multitude of Hollywood fluff.\n"},
{"review": "\nSpoilers is advised, stop reading after this message!<br><br>Seeing the trailer to \"Everest\" was great, knowing about it being a\nthrilling survival movie that's based on a true story, it can get\npeople interested. But coming out of the movie theater, i wasn't too\nimpressed. The story was way too simple, get up the mountain and don't\ndie. Not a lot of the characters had a real reason to go up the tallest\nand most dangerous mountain in the world, either just to be another\nmountain they climb or to get away from family, because the are\nmiserable. The main himself knows that he's going to have a daughter,\nso what does he do...goes on a suicide mission to be in the newspaper.\nWhen it comes to characters, the writers of this movie, could have gone\ndeep into these characters to show the audience the real reason why\nthey're doing this, but no hand wave it away and then kill almost all\nof them. This movie lacks music, the movie \"Argo\" was based on a true\nstory and it had more amazing kinds of music. Where in this movie I\njust hear snow or tragic music, but i get the idea, some people died,\nbut not through the whole movie. My biggest complaint about this movie,\nthe camera continues to shape, making me seasick sometimes. But once\nthat camera stops moving; what a relief that is to just appreciate the\nsettings in the movie. My favorite element to this movie is the\nsetting; the view on the top of Everest was unbelievable with just that\nmoment of silents. The movie \"Everest\" to me is a slightly above\naverage movie that is a movie to see at least one time.\n"},
{"review": "\nEverest is a great movie with a well developed storyline and a\nfantastic cast. It's a very intense movie for the most part, certainly\nthe last thirty minutes are hard to watch, I found myself constantly\nlooking away and you will be at the edge of your seat throughout, it's\nall the more terrifying to know that this is based on a true story. The\nfilm definitely has its flaws on storytelling, it lingers for a long\ntime where nothing really happens and everything appears too safe, it\njumps around to different characters too often, it wanted to give each\nof them as much depth as possible, but because there is so many, we are\nleft with having no character that feels fully developed, it dosen't\nreally have a lead role, which is something I feel every movie should\nhave, this leaves it feeling like it's not using its full potential.\nThe cast is definitely the movies highlight, it's a star studded,\nensemble cast, and there really isn't a weak performance, the best\nmoments definitely come from the phone calls between Jason Clarke and\nKeira Knightley, as well as Josh Brolin and Robin Wright, the one on\none scenes between a husband and wife for all four cast members is very\npassionate and they give their all for every scene. It may have its\nweaknesses, but Everest is still a very intense and well acted film\nthat I would recommend to anyone looking for a good drama. <br><br>A deadly snow storm causes catastrophe for a large group of climbers on\nMount Everest. <br><br>Best Performance: Josh Brolin Worst Performance: Elizabeth Debicki\n"},
{"review": "\nI found this movie to be painfully drawn out and it was not dramatised\nenough to make it exciting. Basically a bunch of people climb up the\nmountain and fewer of them climb down again. The pace of the movie was\npainfully slow and none of the characters were particularly\ninteresting. There weren't even any exciting action scenes. I felt like\nI was watching a documentary rather than a movie. I found myself\nfiddling on my phone during parts of the movie as I was really bored.\nPersonally I think 'Vertical Limit' was a better movie even though it\nwas fiction. Don't waste time and money on this unless you are really\nbored.\n"},
{"review": "\nThis is a beautifully shot movie. Taking you as close to the mountain\nas you will ever get. It's amazing to see it in its full glory. Everest\nlooks like any other tall, rocky, snow-covered peak, almost accessible.\nThat is so misleading! As the movie explains, humans are not designed\nto survive long at the cruising altitude of 747.<br><br>I have absolutely no interest in getting anywhere close to the mountain\nin real life which makes me that more grateful for Everest the movie.\nThis is what cinema was invented for: to show us the places most of us\nwill never see. To let us experience, almost in person, things that\nmost of us never will. Unless of course you are willing to part with\nabout $65K and potentially your life in the process.<br><br>It is a great movie too. Especially if you are not familiar with the\nportrayed events. It's very suspenseful and almost until the very end\nyou do not know how the final list of casualties will look like.<br><br>It delivers on what only the best movies do: makes you want to dive\ndeeper, read more, learn. Go and watch it. And choose a huge screen\nwhile you are at it.\n"},
{"review": "\nBeing based on the true story of the 1996 Mount Everest disaster, it\nwas important that this film stuck to the facts and didn't get carried\naway for the sake of entertainment. Thankfully, it did, and the result\nis a realistic portrayal of the events in 1996. That aside, by far the\nbest part of the film is the stunning visuals and beautiful scenery\nwhich really makes the film a joy to watch.<br><br>It is, however, far from perfect. For all the drama, the film failed to\nbuild up tension and goes through dull and flat patches with little\nhappening. The film is, perhaps predictably, very slow-paced and takes\na while to get going. There are periods of suspense, particularly at\nthe end, but these are few and far between.<br><br>Overall, a realistic film with some stunning visuals, but\ndisappointingly short on tension and suspense, especially given the\nstory.\n"},
{"review": "\nMore and more commercial expeditions are climbing Mount Everest. In the\nsummer of 1996, Adventure Consultants is one of the many teams making\nthe attempt. Rob Hall (Jason Clarke) is the veteran leader leaving\nbehind his pregnant wife Jan (Keira Knightley) in New Zealand. Beck\nWeathers (Josh Brolin) and Doug Hansen (John Hawkes) are two of the\nclient climbers. Guy Cotter (Sam Worthington) is an assistant and Helen\nWilton (Emily Watson) coordinates from base camp. The group arrives at\nthe summit late. Veteran climber Scott Fischer (Jake Gyllenhaal) had\nbeen climbing back and forth between camps. Doug convinces Rob to stay\neven later and then a storm hits the peak. They can't find any extra\noxygen tanks. The group gets scattered and struggles to find safety.<br><br>The story leading up to the summit lacks narrative drive. The first\nhalf simply has no tension and the characters don't have depth. It's a\nseries of elevation points and uncompelling events. It might be better\nto concentrate solely on Jason Clarke and start later on the climb. It\nshould lay out the map and the climb better. There are some compelling\nscenes. It may look best as IMAX 3D. The chaos during the storm has\ngood tension. It is able to lay out the situation despite the chaos.\n"},
{"review": "\nI am very surprised reading bad reviews about Everest. What did you\nexpect it to be then? I sincerely did enjoy watching Everest. Also\nbecause it's based on a true story, what makes it even better to feel\nthe despair they had at the end. It amazes me people would pay so much\nmoney to live an experience like that, where your life is at risk all\nthe time. Okay it's a great achievement once you've done it, but I'd\nrather spend that money on a lazy sunny vacation trip. The fact is the\ntop of the Everest is a graveyard with bodies of people that tried this\nexpedition. The movie shows perfectly how hard it must be to climb the\nEverest. The lack of oxygen, the altitude, the sudden change of\nweather, it's all too much for a normal human body. The movie itself is\nbeautifully shot, with good actors, a lot of tragedy. I didn't get\nbored for one second watching this movie. It keeps you on edge the\nwhole time, because you can feel the courage and determination it takes\nto climb that mountain. Good movie if you ask me. Would watch it again\nin the future.\n"},
{"review": "\nI have just seen the film Everest and I will say that this is a pretty\ndecent film. The premise is based on a true story and sees a group of\nexpeditioners attempt to climb mount Everest when a dangerous snowstorm\nhits. Jason Clarke plays the main guy in this film and he does a really\ngood job. His character was the most interesting in this film and you\ncare about him the most because of his life at home. Josh brolin is\nalso in this film and does a good job, you also care about his\ncharacter because of his good performance. Jake Gyllenhaal was also\nreally good in this film as a carefree climber that developed as the\nfilm progresses and you care about him. Sam Worthington is surprisingly\npretty good in this role as he tries to help Clarke in the situation.\nThe story has a pretty good man vs nature theme as you see these people\ntry to survive the conditions. However, the film lacks any real\ninteresting narrative and the story seems to be forgotten. The script\nhas some great dramatic dialogue that will make you care about the\ncharacters. However, I do slightly wish there had been a little more\nhumour in the film to sometimes alleviate the tension. The style has\nfantastic cinematography that really makes you feel like your on the\nadventure with the group. However, the pacing of the film is all over\nthe place and it feels really slow too much of the time. Overall this\nis a pretty decent film that is worth a watch.\n"},
{"review": "\nBored out of my mind best describes my feelings towards this film.<br><br>O.E. Rolvaag, who wrote \"Giants in the Earth,\" would have had a field\nday with this film when he spoke about the vicissitudes of nature. What\nthese climbers of Mt. Everest had to endure, but of course we may\nalways say, who told them to go climb the mountain to begin with?<br><br>The movie seems to come down to the old Irwin Allen disaster films of\nthe 1970s. We get sympathy when we hear the pregnant wife speaking to\nher dying husband on the phone. Sure this evokes many a tear, but it's\ntoo late for this ultimate flop of any disaster film made. The\nperformances are satisfactory; one such climber can't stop coughing and\npulmonary edema is discussed. If you cough like that, don't go\nclimbing. Adequate oxygen was given to the climbers but the film lacked\nit. I was ready to start singing from The Sound of Music-climb every\nmountain,etc.\n"},
{"review": "\nUniversal Pictures presents this dramatic disaster flick directed by\nBaltasar Kormakur. EVEREST documents the incredible events involved\nwhen several expeditions of climbers attempt to reach the summit of the\ntallest mountain in the world. From the get go it is easy to choose the\ncharacters to succeed and fail. Very harsh and challenging conditions\nmust be encountered to fulfill lifelong obsessions. Fierce snowstorms\nto test the limits of climbers knowing they may not survive the trek to\nthe top let alone live to tell about it. Fighting some of the harshest\nelements on earth combine with the competing relationships of desperate\npeople. A breathtaking adventure that can leave you white knuckled.<br><br>A diverse cast that includes: Jason Clarke, Josh Brolin, Tom\nGoodman-Hill, Michael Kelly, Robin Wright, John Hawkes, Ang Phula\nSherpa, Keira Knightley, Thomas M. Wright, Martin Henderson and Emily\nWatson.\n"},
{"review": "\nEverest remembered me the other adventure thriller on the K2 called\nVertical Limit that I liked very much. But the difference between these\ntwo films is that Everest is a true story. <br><br>The first half is not happening very much. The second part is a real\ndramatic countdown. The special effects are well executed and looks\nreally original.<br><br>I found good especially the questions about the sense climbing high the\nMount Everst. The director delivered a solid job here and hope to see\nmore from him in future. I recommend this movie to all sports and\nnature fan of this genre. My final vote: 6.5 out of 10.\n"},
{"review": "\nThis movie was good, but it could have been better. Yes, it is based on\na true story; however, that does not mean everything in the movie is\ntrue. Considering that the group of people were attempting to climb the\nworld's tallest mountain, it should have had a bit more suspense to it.<br><br>During the climb up, there were two incidents where one of the people\nwere in trouble. Those scenes gave the impression that something\ndramatic was about to happen, but it turned out fine.<br><br>On the other hand, after reaching the top of Mount Everest, the climb\ndown s when some suspense began to build up. But it still was not\nanything that really draws a person in to keep guessing what was to\ncome. It was just a steady and slow suspense build up.<br><br>There were many opportunities to make this movie better that could have\nbeen capitalized on.\n"},
{"review": "\nBased on a true story, Everest tells about a climbing expedition on the\nworld's highest mountain that would become devastated by a severe snow\nstorm.<br><br>She stands and watches over us all, she is Mount Everest, and climbing\nher is seen as one of the pinnacles of mountaineering. No matter how\nmany lives are lost over the years, there will always be another group\nof adventurers ready to take on the mountain and the elements that come\nwith her.<br><br>The ill fated 1996 trek up Everest gets a worthy cinematic treatment\nhere. Sure it suffers from some of the pitfalls of the disaster movie\ngenre, such as weak characterisations and fake sequences, but emotional\ninvestment is high and ready to be grasped by those so inclined. The\ndrama on the mountain is gripping, and thankfully this is matched by\nthe frantic concurrent story strands involving the family and friends\nwaiting at base camp and the family homes. Cinematography is often\nbreathtaking, the acting performances as solid as one of Everest' rock\nfaces, but it's the story that sells itself. A tale well worth reading\nabout, and the cynical among us should do well to remember this fact.\n8/10\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"Everest\" (2015) is kinda disappointing movie if you asked me. It has\nbig great names in acting department attached, although we never really\ncare that much about them - sure this is a sad story, based on very\nunfortunate events, but script lacks more involvement with characters.\nActing was uniformly good, but nothing special. There are some great\ncinematography, and special effects do create this sense of place, but\nsometimes lazy directing takes away some tension moments. That said it\nsurprisingly good paced movie, at running time 1 h 50 min it almost\nnever drags.<br><br>Overall, \"Everest\" is a simply an OK movie for one viewing. Maybe we\ndid see those stories before, and some better done, and although this\nmovie is based on very true story, it fails to capture it - it is not a\nbad movie by any means, but overall package is flawed.\n"},
{"review": "\nThe film looks great, but without any character-development we really\ndon't care what happens to who down the stretch.<br><br>I rather enjoyed some of the accurate time-line and preparation stuff\nin the first 30 minutes of the film. Really stuck to the genuine\narticle in terms of time-line and locations.<br><br>It reminded me a bit of \"World Trade Center\" with it's cliché'd\ngrieving, worried-wife characters, and similarly lacks the early scenes\nto create an impact down the stretch. At least World Trade had two\npowerhouse performances from Cage and the under-rated Michael Pena.<br><br>Here we have a film with similar acting firepower but it never comes to\nfruition. The most interesting character here is Jake Gylenhaal, but\nmuch like the rest of the characters - he just doesn't have enough\nscreen-time. I think the film tried a little too hard to depict all the\ncharacters that lost their lives, and in-turn didn't flesh-out any of\nthem.<br><br>I mentioned I liked the set-up... I also liked the climbing scenes..\nreally well-done. Especially near the summit. You really feel like\nyou're rt up there.<br><br>The film is just above average overall, and for me falls in the middle\nof the pack of movies I've seen from 2015(probably about the 30th best\nfilm out of about 60 so far). It perhaps has some re-watch value for\nentertainment-purposes only. Definitely not for performances, drama, or\nstyle, but unfortunately and unexpectedly for it's 'popcorn-only'\nvalue.<br><br>I'd have liked to get to know these characters a little better.. I mean\nthey made such an effort to show us all of them... They might have\nneeded to make it 3 hours to do it, but I think I would have much\npreferred that \"Everest\" over this one.\n"},
{"review": "\nHope is a wonderful thing. Hope was all they had. Hope from the\nfamilies of the climbers who were far, far away begging their loved\nones would return. Hope from the climbers themselves as the tried to\nfind any way off the mountain. And Hope from me that this film would\nhave been better.<br><br>As I went into this rather vague about how this film would shape up, I\nwas eventually left with a feeling of disappointment and it all seemed\nso... anti-climactic.<br><br>Now When you watch the trailer for a film like this we all picture a\ntense, edge of your seat exciting movie but I found the overall lack of\npace a let down. Now don't get me wrong we got that whole \"Prepare for\ndanger, be wary of the threat\" idea luring over us but what it led to\nwas a few Climbers losing their breath and freezing to death, Simple as\nthat.<br><br>I guess I was expecting more... (Yes I'll be a fool and say it) Action.\nThe build up took what I believe was over 2/3 of the film and when the\nfinal storm was'a'blowin I felt nothing for the characters and who\nsurvived or didn't. Now I know that seems harsh but we never really got\nan insight into their true personality and other than the obvious\n\"We're having a baby\" there wasn't much to push for you to care for\nthese people. <br><br>In my personal opinion it lacked a more in-depth look at the people\nthemselves rather than the over exhausted process of the climb which\ncould have been cut down or turned into more valuable scenes. In the\nend I felt this is what let the film down and as much as I know this a\ntrue event and people lost their lives which is always sad, I have the\nopinion that these people knew the risks they were taking and they took\nthem anyway which is on them. Because of this and the fact I struggled\nto care for the on-screen characters I was ultimately left feeling...\nCold.\n"},
{"review": "\nbelieve it or not, i didn't know the story, never heard about it and\ni'm old enough. The 1st time i've seen the trailer i believed it was\nabout top climbers who had a very bad day on the Everest and because of\nthe cast, worth watching, kind of sport movie like Vertical limit .\nJack Gyllenhaal, Jason Clarke, Josh Brolin are really great everywhere,\nKeira Knigtley and Emily Watson as well.<br><br>But then in the opening you have a few sentences explaining who was the\n1st to climb and reach the summit and who died or did the same the next\n40 yrs and..... this: Rob and his Adventure consultant business who\ntakes every day people on one of the most dangerous mountain in the\nworld I mean what?! how is this possible, people are free to do\nwhatever they want with there lives but guys, use common sense\nright,are you insane? my view change instantly from a good sport movie\nto what it must be, an horror and catastrophic story. It's amazing to\nwatch people using ladder to pass over a crevasse, as Beck says, '' yes\ni'm scary, i know i can die but i didn't pay to die like i was in\nWalmart''<br><br>at the end you can't blame Rob Hall, he died trying to make every\ncustomers happy.. against all safety like Doug the Postman, what is he\ndoing here? none of them meet the requirement to be there, even Beck\nwho was training 6/7 days is a miracle, the man is alive but shouldn't.<br><br>i loved the movie because of the Everest's beauty, the cast who\ndelivered, and most importantly the story which was, for me,\nincredible. the survivors can't be proud of this adventure but really\nbe happy to be alive. it's a must see\n"},
{"review": "\nI didn't read IMDb.com carefully (shameless plug) and thought Everest\nwas going to be a documentary. I was pleasantly surprised to find that\nit was more of a docudrama based on real events.<br><br>I often choose which movies to view based on the appropriateness of the\nlanguage used, with the rationale that if I don't speak that way and no\none in my home should, why should I pay for the same? I can think of\ndozens of other films I've seen that were ruined by inserting swear\nwords where they seemed out of place. I applaud the movie Everest for\nbeing an intense adventure movie that used virtually no objectionable\nlanguage--at least that I can remember. The lack of offensive language\nwas incredibly refreshing.<br><br>The footage and drama were in this movie were riveting. I marveled that\nwhen the climbers were having such a hard time in some scenes shot from\nabove, how the photographers were able to record such shots. They must\nhave been staged on other mountains, but they looked realistic to me.\n"},
{"review": "\nMy summary above is actually just a joke. I will never even attempt an\nactivity where you have a 25% chance of losing your life! Since the\nfilm is based on true events, I don't want to be too critical and harsh\non the characters that lost their lives in this tragedy, but clearly\ninstructions were ignored (Leave the summit by 14:00) and some basic\nprecautions (oxygen tanks) seemed to have been completely missed. With\nall due respect, many of the people that died in this tragedy made the\nwrong decisions, an it cost them dearly. Many decisions were selfish in\nmy opinion. Many did this because of their ego or wanting to prove\nsomething to themselves or their families etc. When the journalist\nasked why people want to reach the summit, none of the answers were\nreally convincing to me.<br><br>What I liked about this film is obviously the cinematography and some\nsolid acting. It also seems to follow the actual events quite closely.\nIt did make me think much further than only Everest. Many of us are\nfaced daily with decisions. Some are small and some are life changing.\nHow we react to these challenges can change our lives forever. This has\nclearly been illustrated and confirmed in Everest.<br><br>I see that people mention that the first hour of the movie was boring.\nI actually really enjoyed to see what work and effort actually go into\nan expedition to the summit. It was really insightful. I do however now\nfirmly believe that Everest has been conquered and I don't understand\nhow people still want to take the risk to go up there.\n"},
{"review": "\n\"Human beings simply aren't built to function at the cruising altitudes\nof a seven-forty-seven.\"<br><br>Everest is a film based on the true story of a tragic disaster that\nbefell an adventure club on their expedition to summit Mount Everest in\n1996. <br><br>The cinematography is great in the movie. Some pretty breathtaking\nshots of Mount Everest and other areas of Nepal. Along with this, the\nsoundtrack was just as good, making it a real treat to watch at times.<br><br>The movie has a big cast comprising great actors like Jake Gyllenhaal,\nJosh Brolin, Jason Clarke, Keira Knightly etc and all of them did a\ngood job. Jason Clarke especially was great and made me care for him.\nIt didn't sugar coat the events nor it added tons of extra stuff for\nentertainment to appeal to the wider audience. It took it self\nseriously and honestly, by the time it was over, I was pretty sad, even\nthough it actually did a not-so-good job at developing the characters.<br><br>And coming to that, it was my main problem with the movie along with\nthat the pacing was uneven and the script was weak, giving the great\nensemble hardly anything to work with. It rushes in the earlier scenes\nwhere it should have taken A LOT more time to develop the characters\nbecause with so many of them in the movie, we hardly get to know them\nor care for them and hence makes the subsequent events less impactful.\nThe journey to the summit could have also benefited from more\ndevelopment and the release could have been so immense. <br><br>Regardless of its short comings, it was a solid film. Just feels like a\nbummer that it could have been much better if they did a little more in\nit. Oh and keep a blanket or heater nearby cause you can get really\nchilly while watching this movie. <br><br>7.5/10\n"},
{"review": "\n\"Everest\" is a really well-crafted film. Based on a real story it\nmanages to capture the dramatism and presents a realistic portrait of\nthe events of the 1996 disaster.<br><br>The actors are chosen very well and all of them seem to have become one\nwith their characters. Some very good performances can be found here\nand I am happy to see that they stay away from overacting and\noverdramatic emotions as sometimes films about disasters tempt actors\nto give. Everyone played their parts in such a way that they look\nperfectly fitting for them so what stands out is the character rather\nthan the actor.<br><br>The dialogues are well-written and delivered. They are just enough to\nguide through the story and reveal not only the facts but also the\nhuman part behind them.<br><br>The film has many picturesque sets and what makes them even more\noutstanding is the brilliant cinematography which increases the feel of\nrealism. There are moments you can imagine yourself as a part of the\ngroups that are climbing the mountain.<br><br>This film deserves a look because it shows that filmmaking is still an\nart.\n"},
{"review": "\nhere we go. properly identifying the actor instead of calling him that\none guy from planet of the apes part two. He has a twin, his name is\nMark Duplass.or that one guy from office space, KEVIN something... so\nanyway....here we have Jason Clarke doing tours up the mountainside of\nmt. Everest. Josh Brolin is one of his clients. Jake Gyllenhall is a\nclimber who either like lives on the side of the mountain or is a part\nof another team of people who have guided tours and assistance of going\nup the mountain.This film kind of highlights the unpreparedness of\npeople. Like when Jason Clarke had teamed up with another crew so they\ncould use the ropes, or when another team used the ladder and the other\nteams wanted to know why they were so professional but didn't have\ntheir own equipment. Also, there were levels of analysis in which the\nclimbers analyzed whether or not some of the crew were fit enough to\ncontinue, or if the weather was too terrible to go on any further. that\nwas the spectacular portion of the movie to me. then there was the role\nof kiera knightly who played an adult who responsibly married the grown\nup Jason Clarke.\n"},
{"review": "\nDespite the stellar cast, this adaptation of the doomed summit in 1996\nfails to capture the intensity of similar tragic-docu-films. Perhaps\nwatching on a small screen spoils the majesty of the Himalayas in the\ncinematography? I guess what the film really lacks is the element of\nsuspense because if you know the synopsis of the plot beforehand, you\nknow that as soon as the weather turns, the events that unfold are not\ngoing to bode well for those on the mountain...although there is the\nsurprise survivor who, despite suffering frostbite on his hands and\nface, manages to stumble to camp and is airlifted in a precarious\nhelicopter rescue. A film worth watching, if only to remind ourselves\nhow foolish adventurers can be in achieving their goals.\n"},
{"review": "\nThat isn't to say the Oscar bait of a cast goes completely to waste.\nJason Clarke exhibits perhaps one of his best performances inside his\nrecent string of action movies, rebounding from this summer's\nlackluster 'Terminator Genisys' and building upon his solidifying\nappearance in 'Dawn of The Planet of The Apes.' With an impeccable Kiwi\naccent and sincerely heart wrenching exchanges with his wife, Clarke as\nexpatiation leader Rob Hall skillfully suffers the very fate he so\ndesperately intended to protect from the team and himself. Applause\nshould also be reserved to Robin Wright and Keira Knightly, whose\nportrayals of distressed yet strong-willed wives are especially\ncommendable, granted that they were forced to concoct pure pain, hope,\nand determination without co-stars Clarke or Brolin in the room. Josh\nBrolin as the hard-nosed Beck Weathers is one of the film's more well\nrounded showings, evolving the character from subconsciously terrified\nyet confident climber to a frost eaten walking dead.<br><br>FULL REVIEW HERE:\nhttp://indieadam.com/2015/09/20/everest-review-indieadam/\n"},
{"review": "\nThe best audience for this movie may be people not familiar with the\nvarious and varying accounts of the 1996 expeditions. But the\ncinematography gives you a true feel of the riskiness of the\nenvironment: knife edge cornices, 2 foot trails with 5,000 foot drops,\nthe seemingly endless ascent. <br><br>Having read most of those aforementioned accounts, the movie makes only\nbrief exposition of the debated critical errors. Some are totally\nignored. I was much more emotional reading the accounts. Feeling the\ngut-wrenching nature of the life and death decision made when an ascent\nor descent goes wrong. I didn't get that feeling with this movie.<br><br>But if you don't want to get into a debate over who made the most\nmistakes (Boukreev vs. Hall. vs. Fischer vs. Ang Dorje, etc.), it's a\nvery good accounting of the events from the perspective of the\nAdventure Consultants' camp.\n"},
{"review": "\nDocudrama climbs new heights - in fact, to the summit of the world's\nhighest mountain - in this adrenaline-intensive re-creation of the\ntragic climbing season of May 1996 when eight people died in a two-day\nblizzard on Everest. Although there are big-name stars here (Jake\nGyllenhaal, Sam Worthington, Keira Knightley), no one is allowed to\ngrandstand: what counts is the ascent. The script gives us glimpses of\nthe climbers' everyday lives - the wives holding their breath at home -\nand the support team at the various Camps; and, never forget, the\nSherpas. But the movie's biggest star is the mountain - and, it must be\nsaid, the cameramen who surely took serious risks to obtain the\nfootage.<br><br>The CGI people have seamlessly joined scenes shot in the Italian Alps\nto the Everest shoot. You totally feel (especially if you see it in 3D\nand IMAX) that you are up there with these people crawling across\nbottomless crevasses and dizzying slopes. You also get a sense of what\ndrives these mountaineers, a force somewhere between bravery and\nfoolhardiness, to take on one of the greatest challenges our planet has\nto offer.\n"},
{"review": "\nI got around to seeing this at the local multi-plex over the weekend,\nand it's a first-rate thriller! \"Everest\" is based on the real events\nof the 1996 Mount Everest disaster, and focuses on the survival\nattempts of two expedition groups- one led by Scott Fischer, played by\nJake Gyllenhaal, and the other by Rob Hall, played by Jason Clarke. <br><br>Since I have a little thing called \"acrophobia\", no way in F**KING H**L\nI was going to see this movie in 3-D! It was still stunning visually in\nthe 2-D. This is one of those movies that even though it's set in this\nvast wide open landscape, it still manages to be a little\nclaustrophobic. You feel as if you are stuck right there with the\ncharacters. <br><br>And I have never been a big fan of Gyllenhaal's up until now- with this\nmovie and last year's \"Nightcrawler\", I think he is really coming into\nhis own. The rest of the all-star cast includes Josh Brolin, John\nHawkes, Robin Wright, Michael Kelly, Sam Worthington, Keira Knightley\nand Emily Watson.\n"},
{"review": "\nIn 1996, the dreams of a group of Everest climbers ended in tragedy at\nthe top due to poor decisions, short supplies, and blizzard conditions.\nThis is a well-made and fascinating story, but it lacked emotional\npower for several reasons: In 3-D, every time the camera panned, the\nbackground images were an unrecognizable, shaky blur that left me\nqueasy. I didn't feel the 3-D added anything to the scenery, which was\nalready awesome (They really did film at Everest Base Camp). Another\nproblem I had was that the characters were hard to tell apart with the\nbeards, goggles, caps, and other gear hiding their faces. And lastly,\nthere were a variety of accents that I found hard to understand, so I\nwas basically just following the action like a silent movie.<br><br>The old question of \"Why do you climb a mountain?\" is never answered in\nthis film, and there was only a very brief epilogue, but the movie does\nmake you think about the costs versus the rewards of scaling the peak.<br><br>(There was a 1997 TV movie, \"Into Thin Air: Death on Everest,\" which\nhad a smaller budget but packed much more of an emotional wallop\nbecause it focused on personalities and backstories of the climbers.)\n"},
{"review": "\nThe photography and cinematography and effects are worth seeing on the\nbig screen. Very realistic sense of being on the mountains and in the\nstorms. Can almost feel the cold and the physical suffering. The story\nis gripping too. It gives an interesting look at the arduous journey -\nthe practicalities and physical weaknesses encountered by the different\nclimbers along the way.<br><br>The big name cast makes this interesting to watch. The spouses: the New\nZealand accented Kiera Knightley to Texan accented Robin Wright. Emily\nWatson makes an unlikely but sympathetic base camp manager. Like Jason\nClarke more after this role as expedition leader. Josh Brolin smiles a\nbit too much but at least he is easily recognizable. Jake Gyllenhaal is\nquite easy to identify even in the snow.<br><br>After watching this movie I do feel more sympathy for the climbers.\nBefore I saw this movie I like many people felt climbers knew what they\nwere getting into by taking such a risky venture etc. But while\nwatching the movie I didn't feel that at all. In the end couldn't help\nfeeling sorry for the pregnant wife left behind and the farewell phone\ncall. Although it is entertainment maybe it will serve as a warning to\npeople not to tempt fate doing dangerous things.<br><br>A couple of faults. The New Zealand or Aussie accents are unnecessarily\nstrong. Maybe a more neutral accent would have sufficed. Didn't help\nthat the wind was howling and snow blowing in many scenes. Half the\ndialog is not comprehensible. Another problem is it was a little\ndifficult telling who was who with all their masks and hats on. The\ndeath of some of the characters could have been more clearly shown\nespecially Jake Gyllenhaal's character and the Japanese woman.<br><br>Worth watching on the biggest screen you can find.\n"},
{"review": "\nDirector Baltasar Kormákur film based on the tragic true story of Rob\nHall's (Jason Clarke) final climbing expedition to the highest point on\nEarth, Mount Everest. The New Zealand mountaineer joined forces with\nfellow climber, friend and competitor Scott Fischer (Jack Gyllenhaal)\nso their teams could summit the mountain during one of the most busiest\nseasons in the most safest possible way. During their mission they\nencounter the incredible force of nature leaving them to experience one\nof the most violent and catastrophic storms, turning Everest into a\nroaring beast where loved ones don't return.<br><br>A British\u0096American 3D disaster adventure/drama/thriller film written by\nSimon Beaufoy and William Nicholson. Josh Brolin (survivor Beck\nWeathers) digs his feet in and stands-out with a great realistic\nperformance showing why is one of the main stars in Everest, with John\nHawkes, Robin Wright, Michael Kelly, Sam Worthington, Keira Knightley\n(as Rob Scotts wife Jan Arnold), and Emily Watson also featuring. With\nbreath taking visuals and a true insight to the power and beauty of\nEverest.\n"},
{"review": "\nFirst of all, bravo on the cinematography. This film has some of the\nbest visuals i have ever seen on film and it really makes you feel like\nyou are 29.029 feet up touching the highest point on earth. The IMAX\nexperience was unlike anything i have ever seen. I was almost expecting\nto feel the cold wind in my seat as the group struggled for survival\nafter their expedition goes very wrong. I would not be surprised if\nthis film wins an Oscar for best cinematography. it was really that\ngood. <br><br>The characters were a bit underdeveloped i thought with an exception of\nJason Clarke and Josh Brolin who were the two standout performances for\nme. Sam Worthington was exceptional as well but with limited screen\ntime. Jake Gyllenhaal was the biggest waste of a character since as far\nas i can remember. you knew his fate from the very first time you saw\nhim and he was extremely under utilized. after all the main character\nwas the mountain itself which got the most screen time. (not\nnecessarily a bad thing)<br><br>I did not look up the story until after watching the movie because i\ndidn't want anything ruined and while watching this movie i found it to\nbe rather slow in getting the momentum going. Its really only the last\n30-45 minutes of the movie where things get pretty intense. I was\nexpecting Jason Clarke and Jake Gyllenhaal to team up and combine\nleadership skills and resources and fight back down the mountain but\nthat does not happen at all. However the filmmakers did not stray too\nfar from the actual story so i can't really knock the film for that as\nit is probably the most realistic portrayal of a disaster/survival\nstory since \"The Impossible\" and some of the main characters deaths are\npretty emotional. <br><br>overall it was a very enjoyable theater experience and i look forward\nto watching the bonus features on the blu ray a few months from now and\nseeing how this film was shot because it was absolutely stunning.\n6.5/10\n"},
{"review": "\nA climbing expedition on Mt. Everest is devastated by a severe snow\nstorm.<br><br>The first thing about this film that struck me was its beauty, not in\nan emotional sense but in a physical one. From the crisp, clean view at\nEverest itself to the spectacular view that Everest gives us, it's all\nincredibly captured by director Baltasar Kormákur.<br><br>The cinematography is the major source of this beauty, the scenes\nbefore the ascent up Everest are fascinating, from the view of the\nisolated town in the foreground of Everest, to the shots inside a small\nhut where the Prue-ascent rituals are preformed. <br><br>The film spends much of its time in the informative stage, this works\nto its advantage as it gives the audience an insight into the\npreparation and physical barriers facing the characters. I found myself\nsucked into the story from the offset due to its informative narration\nand great performances.<br><br>The ensemble cast is a true highlight of this feature, all the actors\nslot perfectly into their roles and no outlier is to be found. Jason\nClark leads the film as the central protagonist \"Rob Hall\" his\nperformance is top notch and investment in his character is instant.\nJosh Brolin, Kiera Knightly, Jake Gyllenhaal and Robin Wright each show\ntalent in important roles, with Gyllenhaal once again stealing the show\nas the cocky, rash and dedicated \"Scott Fischer\". <br><br>Where this Film doesn't work as much is in the second and third acts,\nit all becomes too repetitive and tonally inconsistent. The last third\nlacks the visual poetry and emotionally effect of films like Gravity\nand Mad Max: Fury Road. The predictability of these later acts make the\nfilm drag at certain moments.<br><br>But overall, I really enjoyed Everest due to its incredible\ncinematography and impressive acting. I am Going to give Everest a\n7.6/10\n"},
{"review": "\nGlorious at its name, the film is not a blockbuster with intense\nactions or CGIs, thanks to its original source from a true story in\n1996, it works well as an adventurous hiking drama. The beginning is\npretty surprising as it does not drag much and straight progressing to\nNepal, followed by preparation for the climb and then most of the\nsecond half turns into a terrifying experience struggling to survive.\nAt certain parts, there's some flaws of jumping scenes due to editing\nand it's quite confusing to track who is who due to too many characters\nbut the cast has delivered promising performances and the stunning\ncinematography has brought audiences the great scenery of the peaks.\nThe journey ends in an inspiring way that even though hiking is\nchallenging, the psychology to deal with death and to face the reality\nare the hardest in life.\n"},
{"review": "\nA simple and well told story of an actual event. My favorite thing\nabout Everest is that the film makers simply tell the story. They relay\nto us what most likely transpired with the various mountain climbers on\nthis death-defying excursion to the best of their abilities. This is a\ntrue story, and some climbers didn't make it down, so there were\nobviously some liberties taken as to why certain decisions were made\nand guesswork as to possible conversations between the climbers. There\nis sentiment but it's not overdone, there are incredible scenes of the\nchallenges faced on the mountain without the over-the-top visuals so\noften created by Hollywood movie makers. The movie is like a\ndocumentary that's been turned into a movie without any unnecessary\nstory lines added in.\n"},
{"review": "\nThe thing I liked about the movie was that it was clean and telling the\nreal story about the 1996 Everest disaster, there was no dramatic\nsequence as such the thing we expected from the movie. this is one of\nit's kind of cinema. But I would like people to watch it in 3D because\nit gives that real depth. Only the con in the movie was the actors\nacting it seemed that they were not paid enough to act well or the roll\nwas not sufficient or it was some person's point of view(just kidding),\nbut i personally felt that the acting by Josh Broilin and Jason Clarke\nwas fine, Sam worthington didn't get enough part in it and Jake\nGyllenhaal was also good. Bottom Line: nice movie, one time watch and\nwatch it in 3D ONLY.\n"},
{"review": "\nGreat work , but not for impatience people, Yeat could be boring but\nintriguing. Submitting this review you are agreeing to the terms laid\nout in our Copyright Statement. Your submission must be your own\noriginal work. Your review will normally be posted on the site within\n2-3 business days. Reviews that do not meet the guidelines will not be\nposted. Please write in English only. HTML or boards mark-up is not\nsupported though paragraph breaks will be inserted if you leave a blank\nline between paragraph. Your submission must be your own original work.\nYour review will normally be posted on the site within 2-3 business\ndays. Reviews that do not meet the guidelines will not be posted.\nPlease write in English only. HTML or boards mark-up is not supported\nthough paragraph breaks will be inserted if you leave a blank line\nbetween paragraph.\n"},
{"review": "\nFirst the good: The film had many captivating scenes of high alpine\nenvirons. The film makers did a good job portraying the rigors of\ncontemporary mountain climbing, even if most of the high alpine footage\nwas actually filmed 10,000 feet lower than suggested in the film.<br><br>Now the bad: The characters in the film were utterly unlikeable. These\nfolks were no Edmund Hillary and Tenzing Norgay let alone Charles Bruce\nand George Mallory. Unlike early climbers, these TOURISTS had all the\namenities they could dream of: lots of technical and logistical\nsupport, pre-set paths, experienced guides, etc. etc. How heroic is\nthat? Furthermore they were all full of pomp and attitude, especially\nthe men. The line \"100% Texan, here\" still rings painfully in my ears.\nI found myself rooting against the men on several occasions, especially\nnear the end. <br><br>Now to address the elephant in the room. HOW IS IT THAT THE FIRST MAJOR\nFILM ABOUT AN ASCENT TO EVEREST WAS ABOUT THESE IDIOTS? <br><br>Please, somebody, make a proper film about climbing Everest, such as\nthe ill- fated 1924 British Everest expedition. These were REAL\nexplorers, not the guided tourists from this pathetic film. There is\neven wide speculation that the 1924 climbers, Bruce and Mallory, were\nactually the first to reach the summit, something films like to\nexplore. They didn't have much technical and logistical support, and\nwere reliant on early 20th century technology. Unlike the characters in\nthis film, their story is actually interesting.\n"},
{"review": "\nVery impressive technically, well enough acted given the difficulty of\nmaking any kind of mark when there are so many characters, and nowhere\nnear as badly written as I'd anticipated, this is a solid movie that\ntells of an episode in the existence of a mountain.<br><br>The huge scale of the scenery is pitted against the puniness of the\nhumans. As the cast make their way over bottomless crevasses and veer\nfar too near the edge of the next ridge, it does get genuinely scary\nfrom time to time. The action sequences are skillfully filmed and\nedited, and definitely worth experiencing in 3D and big sound.<br><br>Those are the plus points. The minuses are to do with the compromises\nrequired to fit the story into the tight shoes of commercial cinema.\nIt's not just a matter of clunky exposition. It's the presence of big\nname actors who, excellent as they all are (and I am a real fan of Jake\nGyllenhaal) inevitably stand out as faces against their lesser known\ncolleagues. They can't help but turn EVEREST into one of those all-star\ndisaster movies like THE POSEIDON ADVENTURE or THE TOWERING INFERNO. I\nthink it would have been better not to have the stars. They militate\nagainst the true-to-life, in memoriam aspect of the film.\n"},
{"review": "\nThe movie is good and the plot are excellent. Since it is based on real\nstory so there is not much suspense or drama. The movie is very simple\nand understandable unlike other Hollywood movies. I will give 6 out of\n10 to rate the movie But I found one flaw in the movie. when Rob Hall\nreached nepal and was travelling in local nepal bus in the bus. one\nIndian song was played named 'banno ke sahele'. This song is from a\nmovie Kabhi Kushi Kabhi Gam which was released in the year 2001. But\nthe everest disaster happened in 1996. five years before initial\nrelease of song. So I found this flaw in the movie. Overall movie is\ngood. There is no such adventure or animation since movie is based on\ntrue story.\n"},
{"review": "\nThis film was special to me. And watching it was an experiment for me.\nI have read all the reports of the eyewitnesses. And when you dig you\ncan find that almost every person that climbed Everest in 1996 has\nwritten a book about what happened. Most interesting to me was that\nevery single person had an own view on it. And as things went wrong -\nterribly wrong and ended in chaos everyone had an own truth. Some\nblamed each other - some blamed the nature, or the mountain. Most of\nthem blamed the climber and adventure business and some came to a\ncatharsis point of view on it.<br><br>Knowing all those stories, the shared emotions and views i was very\ninterested how someone can adapt this complex story into a film. Is\nthis even possible? I was sure that i will be disappointed at the end\nas i was sure that it's impossible to fit such a complex story in 121\nminutes.<br><br>So i went to a blockbuster cinema, bought the obligated pop corn and\nput on the 3D glasses. In the end i went out and had the following in\nmy mind: wow: 3D is really amazing. Maybe it has even more effect when\ni don't take seat in the 11th row. Maybe the 5th would be better. Some\nreally great shots from the mountains of the great Himalaya. Some\namazing and really good made Spezial effects that gives an impression\nof the storms. Really good actor performance and i also liked the cast.<br><br>But, well, the story. I think it must be really difficult to tell a\nstory that was designed by reality and that is so complex. Krakauer\nreally did that job. Even if we can blame Krakauer for his blaming\nagainst Anatoli Boukreev, even when we don't agree with all his point.\nHis book \"In the Thin Air\". is the best source for getting an overview\nto the whole story.<br><br>What else is to say? Well, the film was Okay. Nice film - but the story\nis just too big for a single movie.\n"},
{"review": "\nThis movie was the first I have seen in IMAX 3D and will be the last. I\nhad noticed in previous 3D films that the camera focus on the central\nshot of the scene is brilliant, but it washes out all the background\nand peripheral into a blur.<br><br>Well, this would have been a majestic film full of incredible shots if\nit had NOT been ruined by this fact of 3D. Perhaps not everyone feels\nthis way about 3D, but everyone in my group of 6 that went left with\nheadaches, eyestrain, and disappointment.<br><br>I know personally two people who have climbed Everest, and they say it\nis a harrowing life changing experience. This story is very well told,\nand reflects much of the challenge realistically. One thing it did miss\nthough, the environmental problems at base camp. Base camp in reality\nis a trash heap, unlike most US National Parks and Forests which\nrequire backpackers to pack out what they pack in... the Everest base\ncamp is a pit of garbage, The film makes one tiny reference to this\nwhen a character picks up a few items of discarded litter.<br><br>The story itself reflects the great and sometimes tragic conflict\nbetween personal ambition and common sense. Climbing Everest was a\nlifelong goal for these people. One that entailed great risk. But when\nfaced with the choice between failure and death, personal ambition led\nsome to choose the course which led to death. And the real tragedy is\nthat others then died trying to help them achieve their goal, or trying\nto save them. There are no villains in this story, except perhaps the\ndangers of Everest, but there were several heroes. This movie is well\nworth seeing, but if you aren't really into 3D, see it in regular\nformat.\n"},
{"review": "\nWhy do film makers need to embellish true events? You can't find a more\ndramatic and interesting subject than this event, yet they always go\n\"Hollywood\" perhaps to show their brilliance? Case in point: first\nascent out of base camp the expedition is hit with an avalanche; 50\npound chucks of ice flying down the mountain at 50 MPH, literally\nsmashing into &amp; knocking over multiple climbers. In the real world\nthat's known as DOA. In the Hollywood world the leader cries out \"is\neveryone OK?\" In the Hollywood world, Not A Scratch. \"We're fine\" they\nall say and resume the climb. That's when I checked out and U should\ntoo!\n"},
{"review": "\nWith all due Respect to the Loss of Life and Limb in regards to Extreme\nactivities where the Risk of such things is High, the telling of this\noft told Tale of Real-Life Accomplishments and Tragedies is in this\ncase a Tedious exercise in emotional Overload.<br><br>The Third Act as things get Out of Control and the Climber's Inability\nto surpass Unsurmountable Natural occurrences is expectedly Heartfelt\nand a Gut-Wrenching personal Defeat at the Whims of the unpredictable\nWrath of Nature's Nastiness.<br><br>The All Star Cast becomes virtually Unrecognizable behind the blinding\nSnowstorm, Parkas, Masks, and Frozen Beards. The Talent on Screen is\nrendered Moot and the representations of the Real People involved might\njust as well been Cast with Unknowns.<br><br>The Landscape in all of its Beautiful Brutality is painstakingly\npresented for Maximum Effect and the Environment is patently\nDevastating. Overall, the Overload of the Emotional Ending is drawn out\nand is Suffocating to Watch the Suffering go on and on.<br><br>As a Docu-Drama it is about Average and it's a sincere Tribute to the\nAdventurers that Fell short of Their Goal even though They Accomplished\nthe Ascent, Failed to Return and in the end were Overwhelmed by the\nMountain and its lack of Cooperation with the Human Spirit, its\ndetermined Conquest at Any Cost. A High Price to pay.\n"},
{"review": "\nIf you don't DIE you might spot frozen dead bodies in various poses\nsuch as; being slumped over taking a nap, lying down taking a nap and\neating lunch. Also you'll have a high chance of losing your hands,\nlosing your nose, losing your sight and losing your mind. I'm not\ncomfortable rating this movie. It's either a 1 or a 10. It was\nentertaining to watch however I'm perplexed as to why someone would\npurposefully risk their lives to put a flag or keepsake on top of a\nmountain only to have it corroded by weather just because \"...it's\n(Everest) there.\" Although Fisher &amp; Hall seemed to be great guys I\ndidn't have a lot of sympathy for the clients who did not seem like\nthey had adequate experience as climbers. Also if I had the State of\nMind that induced me to Summit Everest, I'm definitely turning around\nonce I see a Frozen Dead Body! The Journalist guy was weak. Why didn't\nthey try to send a Helicopter up for Rob Hall?! After seeing this movie\nI've decided to surf an active volcano just because.... It's There...\n"},
{"review": "\nThis was a great movie. Fantastic cinematography, solidly directed and\ngreat performances. Empathy for characters who spend a small fortune to\ngo up a mountain with the understanding that they could be killed and\nfor that eventuality to be realized is difficult to achieve. Even the\nscript is self aware of that and in one scene the characters ask what\nthe appeal is. But do we need this justification?, the extremity of\nmountaineering, its toll to the human body and ultimately the human\nspirit is drama enough. To that end Everest beautifully charts the\nbeauty and horror of mountaineering as well as its impact to powerless\nonlookers. This would have been easier to make as a documentary but\nbravo to the filmmakers for scripting and acting this piece out. A\ngreat technical achievement. The performances are great too, Jason\nClarke is knock out. Josh Brolin was great too putting in a very honed\nin nuanced performance. However the usually brilliant Jake Gyllenhaal\nplays it too cartoonish and his performance was just that believable.\nBut thats a very minor negative, I strongly recommend you view this\nmovie on the largest screen you can fine.\n"},
{"review": "\nThis another on of those movies with big trailers, making you think you\nwill have almost full action packed movie.<br><br>Since this is the movie based on a true story and they are climbing the\nEverest the are no spoilers here...<br><br>To start of, I only gave the movie 3 stars, because its beautiful,\nlandscapes gorgeous so that part is OK. But for me, the movie is just\nlike a documentary gone wrong.<br><br>I love a good documentary, but this movie is even below that. The first\npart about climbing the mountain is so so boring, that we almost fell\nasleep watching it. The rest of the movie is sort of OK ish... But its\nstill a B grade movie, wrapped in a A movie shell.<br><br>This one the worst and boring, not interesting movies I have ever seen,\nand I have seen some bad movies... This is so bad, that it even does\nnot make you laugh, it makes you fall a sleep...\n"},
{"review": "\nBeing kiwi I didn't know much about Rob Hall - Kiwi mountaineering\nlegend - as I was only 19 when he passed away and for what ever reason\nI didn't pay much attention back then to the events on Everest. . So\nwhen this movie was released It got my attention. Picking Aussie Jason\nClark to play Rob Hall was an interesting choice . Naturally us Kiwis\nsquirm when Australians are selected to play NZ characters . However\nJason Clarke did admirably and he never really tried to do the kiwi\naccent . Thankfully kiwi Martin Henderson played his assistant. Over\nall I felt the movie gave a good summary of the events that happened in\n96 , although Rob Hall probably needs a separate movie. The events\nhappened over 48 hours so it would have been a stretch to try and\ncontain everything in 2hrs. I was satisfied at the portrayal of Rob\nHall. My girlfriend got quite emotional near the end.\n"},
{"review": "\nPower by amazing visual effects and a strong cast Everest not only\nTries to make this film powerful in emotion, but makes it gripping to\nwatch.<br><br>Led by director Baltasar Kormákur who does a great job displaying the\nhardships of climbing the iconic name, but as well shows off each\ncharacters personality very well. Add to that a cast that not only lift\nup the film, but adds more character in dept to it; making it\nsuspenseful and thrilling film to watch. <br><br>Overall, Everest sets up an emotional story, but a the same time an\ninfluential one as well.\n"},
{"review": "\nWhat killed this movie for me the most was their attempt at\n\"docu-dramism\" where they tried too much to be almost a documentary\nrather than a dramatic film. Things are told but never felt. You know\nsome things about the characters but you never get to know them. There\nis little time spent in establishing them as people.<br><br>The biggest reason for that is that the film never really settles on a\nprotagonist, but just sort of jumps from person to person. The film\nwould have been a lot better if it had told just one person's story,\nthen maybe it could have created some feeling in the viewer.<br><br>But besides all that Everest is by no means a bad film. What it does\nwell is give you a sense of the experience of mountain climbing and the\nmind numbing danger of it all.<br><br>Everest is not a bad film, especially for a large screen experience,\nbut drama wise it left me wanting more.\n"},
{"review": "\n\"Everest\" is the type of film that one wants to see because it offers\nthe opportunity to see a very special part of the world, the most\nimpressive mountains on the planet, majestic, forbidden territory, the\nultimate challenge for those who dare to go there.<br><br>The story introduces a group of people who are apparently ready to take\non the challenge. Some are going for the first time, some are veterans\nand have climbed a few of the other peaks in the chain. It becomes\napparent that they will be able to handle most of what is there, and\nsome might not make it, but what we don't know is how different the\noutcome will be because one element they haven't considered is the\nunpredictability of the elements in nature.<br><br>We are giving a passable amount of background, which becomes a weakness\nhere. There's too many characters to follow, and the screenwriter just\nfails to focus on two or three of them, trying too hard to introduce\ntoo many, neglecting to focus on what should have been the main\nelement, the challenge, the power of the mountain, the impending\npossibility that nothing should be taken for granted. Considerable care\ngoes into telling us what could happen if something goes wrong, but it\nnever feels as if we are there with the expedition members. We get to\nsee them play the roles, but they are sketchy performances. We know we\nhave jocks, addicts, adrenaline junkies, etc. We never really get to\nknow anyone. It's a pity because Gyllenthal, Brolin, and other fine\nactors are given little to work with.<br><br>One thing that stands out is that the trip never feels that special.\nYes, the winds are there, the storms are loud and deadly, the\ntemperatures can maim and kill you because they're part of the film,\nbut the emotional build up is weak, and we see something that is\nneither a good documentary or a very dramatic film. It's supposed be a\nthrilling ride, but we get something that never reaches that level.\n"},
{"review": "\nWARNING:Spoiler Alert!!!<br><br>This was a fine and entertaining film. There is a few things that i did\nnot liked, but they do not really matter. There is some characters I\nreally liked and did not wanted to die( Jake Gyllenhaal's character,\nJohn Hawkes's character and Jason Clarke's character). It did not knew\nthe real story, so the end was a surprise for me. It's a pretty sad\nmovie, which was unexpected and the only main character who survived\nwas the worst one (Josh Brolin's character). It is a good movie. It\nmade my cry and it totally deserves 7/10. The casting is done well. I,\nmy friends and my family enjoyed the movie. In one sentence: very good\nmovie, but \"The Martian\" was way better.\n"},
{"review": "\nEvery year lots of people try to reach the summit of Mount Everest\nguided by their passion to a mountain both beautiful and dangerous, a\ndesire to reach what so few have managed to achieve even if their own\nbody suffer unspeakable pain from the agonizing freezing temperature,\nEverest does it very well as building up the characters, telling their\nbackgrounds, the explanation of why they're doing something so\ndangerous. Due to the camera angles, a vertigo sensation can be felt as\nthe viewers glimpse huge cliffs and tops far away from the ground. The\nfilm creates a torturing atmosphere where the audience is affected by\nthe characters' suffering and there is no uniformity in the characters,\neach one has their own personality, their own reason for doing\nsomething so dangerous, making them more captivating. Regarding the\nsetting, there're some scenes which were actually shot in real\nlocations, such as Nepal, and others that CGI does most of the work. In\nthese scenes, the visual effects are impressive, although some scenes\nit's perceptible. The casting is composed by many good and talented\nactors and actresses, they deliver solid characters and when it's\nrequired a deep and emotional acting, they're convincing and\nheartbroken. The one who stands out is Jason Clarke, his character has\nsuch a charisma much due to his love for his family and they are his\nfoundation to keep trying to survive the catastrophe.<br><br>The film is confusing, not of having a complex plot, but in it, some\nscenes seems to be dislocated or doesn't fit. There're several scenes\nthroughout the movie where what happens in them aren't talked about\nlater in the picture. They may not compromise the story's\nunderstanding, but then, why are they in the film. Looking as if they\nare present just only to increase the length of the movie.\n"},
{"review": "\n'EVEREST': Three and a Half Stars (Out of Five)<br><br>Disaster flick, based on actual events; detailing the fatal attempts of\ntwo exhibition groups, to summit Mount Everest. It was directed by\nBaltasar Kormakur and written by William Nicholson and Simon Beaufoy.\nThe film stars Jason Clarke, Jake Gyllenhaal, Josh Brolin, Sam\nWorthington, John Hawkes, Emily Watson, Robin Wright and Keira\nKnightley. It's a slow moving, but ultimately intense, mountain\nclimbing adventure flick; not great, but definitely worth the watch.<br><br>The film takes place in 1996; and follows a very experienced mountain\nguide, named Rob Hall (Clarke). Gyllenhaal plays Scott Fischer; another\nvery skilled guide, who led another group up Everest. Other climbers\nincluded a doctor named Beck Weathers (Brolin), and a mailman named\nDoug Hansen (Hawkes). The movie details their disastrous attempts, to\nreach the summit that spring (and come back down), as well as many\nothers. <br><br>The first half of the movie is extremely slow-paced, it did help me to\nget to know, and care for, a lot of the main characters though. The\nsecond half of the film is both suspenseful and visually spectacular\n(it especially looks beautiful in 3D). It's also pretty depressing; and\nI was surprised to learn which characters survived, and which didn't.\nThe directing is decent, and I like most of the main cast (especially\nGyllenhaal). It's not the most consistently thrilling adventure flick,\nbut it is entertaining enough.<br><br>Watch our movie review show 'MOVIE TALK' at:\nhttps://youtu.be/NdWU81GeyN4\n"},
{"review": "\nThere were some decent performances from Jason Clarke and Josh Brolin\nbut mostly this film was pretty forgettable. I did like the beautiful\nshots of the massive mountain but didn't get that sense of vertigo that\nI was hoping for. This did not compare to the IMAX experience of Into\nThin Air. I only saw it on XD 3D but still I didn't get a sense that I\nneeded to see it on a bigger screen since it wasn't that impressive.\nThe characters were interesting at first and they did a decent job\ngiving them background to generate sympathy for later. However, once\nthey got to the top it seemed frustrating as an audience member that\ntheir ill-prepared venture wasn't foreshadowed more. I thought these\nguys knew what they were doing. The treat for this film were small\nroles for Jake Gyllenhall and Sam Worthington again. The ads and\npositive buzz brought me in but I wouldn't recommend this too highly to\nanyone.\n"},
{"review": "\nThe movie is a nice combination of drama, emotions and bravery.<br><br>What makes the movie even more interesting is that it is based on\nactual events from 1996. You do not have to be a mountaineer or\nadventure junkie to appreciate the movie. The gripping storyline keeps\nyou hooked all throughout.<br><br>The magnificence of Mount Everest is evident in the movie, which not\nonly makes you realize - how extremely difficult it is to conquer the\npeak, but also it helps us appreciate a mountaineer's true grit,\ncourage and physical endurance.<br><br>Great Star cast, Impressive Photography and Cinematography and\nLocations. <br><br>All in all - Amazing movie experience!\n"},
{"review": "\nI personally think it was pretty impressive movie. Story line was\nbeautifully written from the character's background to their state at\nBase Camp. I won't lie it made me sentimental at a point. Those\nbreathtaking scenes were amazing. Everything has its flaw like wise\nthings i found odd was Scott Fischer's story. I feel different for the\nguy. It was like he came, he died. No inside story. That guy deserved\nbetter story or something. And how did Beck happen to be alive its\nmystery but felt good after he came back. I was hoping Rob would come\nback which he never did. Which kinda made me sad. <br><br>I'm from Nepal that may have boosted my review to positive or not but i\nwould definitely recommend to anyone who loves adventures (trekking,\nhiking etc).\n"},
{"review": "\nVisually it was stunning, but found myself kinda angry during and\nstraight up disappointed afterwards. The plot was weak (even if based\non real events, they still could've have changed it a little), the\nactors underused, the climb felt too easy (except the oxygen problem,\nthe only issue was with some missing ropes - solved pretty easily).\nWhile spending the last 30 minutes waiting for something amazing to\nhappen, a miracle or something; and the scene I liked the most (in a\nclimbing movie) was final helicopter scene. Regarding the 3D\nconversion: it was not great, did not bring anything to the experience.\nSo a lot of lost potential, especially when I found out about the\nsubject and cast last year.<br><br>See The Eiger Sanction and North Wall instead - those are masterpieces.\n"},
{"review": "\nIn the capable hands of well awarded Iceland Director Baltasar Kormakur\n(2 Guns - 2013), this retelling of the 1966 climb to \"Mt. Everest\" is a\nreminder that well friendships are important and depended upon when\nfighting the elements, they can also be a hindrance. Writers William\nNicholson (Gladiator - 2000) and Simon Beauofy (Slumdog Millionaire -\n2008) don't over write the events, instead they let the location and\nthe situation speak for itself. While the film is packed with plenty of\nfamiliar faces (Jason Clark, John Hawkes, Emily Watson, Keira Knightly,\nJosh Brolin, Jake Gyllenhaal and Robin Wright - to name a few), many\nhave not been casted in such a unique setting, and thus their\nperformances are realistic and note worthy. Presented in 3D, the sheer\nmadness of the films situation, and the magnitude of the mountain\nenvironment, don't require any additional visual effects. However,\nwatching the film on a large screen is recommended.\n"},
{"review": "\nAs climber, I must say that I liked the film. We must try not to\ncompare it with the book (for evident reasons) which is much more\ncomplete, the characters are more defined, and the relationships\nbetween them makes the story more intense. I would say that the film is\nvery focused on what happens to guide Rob Hall and Beck Weathers, but\nthere are many interesting characters and events who are portrayed\nblurred. For example Anatoli Boukreev, who was instrumental in the\nstory, appears in the background, the relationship between Rob Hall and\nScott Fisher, Sandy Pittman...<br><br>Importantly, Krakauer's book has generated significant criticism to the\npoint that the guide Anatoli Boukreev (which was criticized by some)\nwrote \"The Climb\" in response Krakauer's book.<br><br>Yet the film is beautifully shot and deserves note. It is appreciated\nthat has not fallen into the sensationalism and lack of rigour of other\nHollywood climbing movies as we all know.<br><br>7,5/10\n"},
{"review": "\nEverest is a film that you know what you are going to get and it\ndoesn't disappoint in that aspect. In fact, Everest may be something\nmore then your typical Hollywood disaster film, with unpredictable\nmoments and truly distressing, realistic scenes. However, with the fast\npaced action, you lose the ability to really connect with some pivotal\ncharacters and the film glosses over so many potentially interesting\ncharacters, that when some of them meet their demise, you care very\nlittle about their deaths.<br><br>Everest left me on the edge of my seat for the entirety of the film.\nUnlike other films of it's caliber, Everest manages to surprise and\nmakes you positively invested in the story. Despite the loss of\ncharacterization and the addition of cheesy dialogue, Everest proves to\nbe the best paced film this year and good for some deliberate fun.\n"},
{"review": "\nThis is my review for Everest the film about climbing Mount Everest in\ncase you didn't know this review is spoiler free.<br><br>Plot: Robert Hall was a mountaineer who went on the most dangerous\nvoyage a man could take he decides to climb Everest, where the\nunexpected can happen the mountain really takes it's toll on the\nmountaineers.<br><br>This heroic biopic can really play with your heart strings but not in\nall ways this film isn't what I thought it was but I enjoyed it. There\nis wonderful acting form the main cast member Jason Clark (Dawn of the\nPlanet of the Apes, Terminator Genisys)who plays Robert Hall. There\nisn't really much character introduction but I think the film was\ntrying to get to the best bits really fast, in other films I would hate\nthat but didn't in this one.<br><br>This film has quite a lot of stars in it Josh Brolin (Sicario), Jake\nGylenhall (Southpaw), Sam Worthington (Avatar) and Michael Kelly (The\nAdjustment Burau. The lack of story of the characters is slightly\nannoying but you can get over that. I think this film should at least\nbe mention in the Oscars in my opinion.<br><br>Overall this is a very brave and enjoyable that needs a little more\nattention. 9/10 a mountain of a film, must watch.\n"}
]