[
{"review": "\nNow I know that 'The Departed' is based off of the Hong Kong movie\n'WuJianDao', but Scorsese really grabs hold of a great story and brings\nit to the American Screen. My father grew up in Boston and when we\nwalked out of the theater he couldn't stop talking about how authentic\nthe environment and attitude was. Then there's the acting in which the\nlead actors (Nicholson, DiCaprio, Damon) not only give stunningly\nentertaining performances, but you become engulfed in each one's\nperspective and dilemmas. The smaller roles that of (Baldwin, Walberg,\nSheen) are supporting roles that remind me of Jesus Quintana from 'The\nBig Lebowski', by this I mean that their screen time is limited but\nthey make lasting impressions that you cherish each and every scene\nthey are in, Alec Baldwin especially. The story itself starts off with\nthe basic intro of the players and the setting, but you'll find\nyourself slowing following each and every plot twist and rooting back\nand forth for the good guys and for the bad guys. If you're a Scorsese\nfan, which I am, I think you will appreciate this film. You can clearly\nsee the Scorsese touch ranging from the cinematography and of course\nthe music, it's great to hear \"Gimme Shelter\" again, but \"Comfortably\nNumb\" played in so well. It's another gangster flick from Scorsese, yet\nthis one stands alone because feels so fresh and most would agree\nScorsese does gangster films the best; so why not let him. Oscar\nworthy, the acting I certainly hope; this is DiCaprio's best role since\n'The Aviator' which was his best role since 'Gangs of New York', am I\nseeing a pattern here. But my lasting impression wasn't concerned with\nthe politics of the golden statue; my lasting impression was that I had\nsat through 2 and half hours of brilliant and especially entertaining\nstorytelling. Thank you Mr. Scorsese.\n"},
{"review": "\nPlease don't make negative comments like some of the aforementioned\npeople have been doing if you haven't seen the film yet! I have seen\nit, at a press screening last week. Not only is it the best film of the\nyear so far, it marks a return to form for Martin Scorsese, and ranks\nwith the likes of GOODFELLAS as being one of the best in his canon of\nfilms.<br><br>I'm a fan of the Hong Kong film, INFERNAL AFFAIRS, upon which this is\nbased. While THE DEPARTED keeps the basic structure of the original, it\nis very much its own movie, so much so that the screenwriter, William\nMonahan, didn't even watch the original film while adapting its\nscreenplay, thus enabling him to infuse the script with his, and\nScorsese's, respective visions.<br><br>All the actors are first-rate (yes, even Leo, for all you DiCaprio\nbashers out there), and turn in some of their best performances to\ndate. THE DEPARTED is sure to garner a host of Oscar nods, if not wins,\nincluding (hopefully) Scorsese's long-overdue statuette for Best\nDirector. Plus, with actors like Martin Sheen and Alec Baldwin playing\nsupporting roles, that says a lot about the quality of the film they\nsigned up for! THE DEPARTED is tough stuff, not for the faint-of-heart.\nThat said, it is a must-see for adult viewers who long for intelligent,\ngritty stories to grace our movie screens once again.\n"},
{"review": "\nExcellent. A great, great movie. I saw it last night at a special\nscreening and must say it was a tour de force. Even though Boston is\nnot really a gritty town Scorsese was able to capture a darker side of\nthe city. Coming from that area, I am always concerned when actors put\non the local accent as it tends to be distracting rather than\nsupportive. However, with local pros like Damon and Wahlberg they were\nable to really grab hold of it and not go overboard... most of the\ntime. The true stand out performance has to go to DiCaprio. He has\nreally come into his since hooking up with Scorsese, having scored a\nnumber of original performances all of which have expanded his range.\nHe really snagged onto a deep and tragic character and created\nsomething that will hopefully be recognized come awards season. One of\nmy favorite aspects was the friendly hostility the characters had for\neach other. It is a specific trademark that I have never noticed in any\nother city. In Boston, when you are really close with someone (or not\nreally) it is, more or less, a requirement to bust their balls and\nshoot cruel insults back and forth in rhythmic banter. That detail was\nextensively realized in THE DEPARTED and I doubt anybody who was raised\noutside of the metro Boston area, or at least visited at some point,\nwould find it nearly as hilarious as those who were. As for Scorsese's\ndirection, I think he scored big with this one. While many have\ncriticized that his movies have become more commercial I believe that\nhe has just evolved. There were some classic Scorsese moments here, my\nfavorite being a scene where DiCaprio is alone and packing his things\nin his apartment. Beautifully cut and stylistically directed. Is it his\nbest effort? No. But it still is truly mesmerizing. He has created\nsomething truly special from a city that is highly underrated.\n"},
{"review": "\nIdiots often say this: \"Oh, yes, it's very good for Hollywood I\nsuppose, but not a patch on the Uruguayan original.\" Well smack me in\nthe face and call me an idiot, 'cos the 2002 Hong Kong crime thriller\nInfernal Affairs (Mou gaan dou) is aeons better than the\nScorsese-directed, all-star Hollywood remake.<br><br>The original was 100 minutes long and so taught you could probably play\nit like banjo strings. Several of the scenes were filmed with such\nartistry that they set a new standard in beautifully realised\nintensity. The plotting was tight, the acting pitch-perfect, and you\nreally felt for the protagonists.<br><br>It was, in short, the best cops and robbers thriller anyone had seen in\nyears.<br><br>So of course it had to be remade.<br><br>Enter Scorsese, Nicholson, DiCaprio, Damon, Sheen, Baldwin et al.<br><br>What results is bloated competence.<br><br>The set-pieces from Infernal Affairs remain, but are slacker and less\nwell-handled. People in the cinema were laughing where they should have\nbeen clutching their heart to keep it in their chest.<br><br>The precision camera-work gives way to run-of-the-mill shots. Consider\nthe sloppy execution of the rooftop fall.<br><br>The film is considerably longer without any real cause (bar, perhaps,\nNicholson's hammy imperative to overplay any role he takes on). Witness\nthe affair storyline, which is an unnecessary sop to the need for a\nmore prominent female role, or the FBI addition, which is completely\nsuperfluous.<br><br>The end result is simply a lot weaker than the tightly-budgeted,\ntightly-edited, subtler original.<br><br>The only improvement \u0096 and I shudder to say this \u0096 is Alec Baldwin's\nrole as the wise-cracking police captain, which made me chuckle on many\noccasions.<br><br>Get the original out instead. Please. You won't regret it.\n"},
{"review": "\nBefore seeing this, I knew I was in for a treat, given that it's a\nScorsese movie, but The Departed was even better than I expected.<br><br>The acting is outstanding. Leonardo DiCaprio gives what is quite\npossibly the best performance of his career. Even the people who hate\nhim admit he did a good job. It's turned some haters into fans and my\nbrother who despises him even says he was great. Matt Damon and Jack\nNicholson give their best performances since The Talented Mr. Ripley\nand As Good As It Gets. Mark Wahlberg almost steals the show with the\nbest lines. Ray Winstone, Alec Baldwin, and Martin Sheen are good, too.<br><br>Definitely one of the best films of the 00's. And easily one of the\nbest remakes of all time. It's intense, funny, exciting, suspenseful,\nsuperbly acted, violent, has great characters, and has one of the most\nshocking scenes I've ever seen. And there's not a boring moment in it's\ntwo and a half hour running time. <br><br>The film will most likely be nominated for picture, director and\nadapted screenplay, and in my opinion, it deserves all three of them.\nDiCaprio and Wahlberg also deserve nominations.<br><br>See this as soon as you can.\n"},
{"review": "\nOh my God.<br><br>I can say without overstatement that I just saw the most gripping and\nentertaining American film to come out in at least the past ten years.<br><br>I was lucky enough to get a pass to an advance screening of The\nDeparted this past weekend in Boston. I wasn't sure what to expect and\nactually planned on being a little disappointed with all the\nexpectations and hype of such an all-star cast.<br><br>From the moment the opening credits came up, the movie grabbed me by\nthe neck, ripped me out of my seat and didn't let go until the final\nscene.<br><br>Each performance is more masterful than the next. Damon was a tour de\nforce as the lead, tapping every ounce of his acting reservoir for this\nrole. Nicholson creates another classic role to add to his already\nsterling resume. His mob boss would almost steal every scene he was in,\nif it not for every other actor being so fantastic However, the biggest\nsurprise for me personally came from Leonardo DeCaprio.<br><br>Having never warmed up to any of his roles or movies, I found myself\nblown away by him in this. I'm not sure if it was the material he was\ngiven, or if DeCaprio has grown this much as an actor, or a combination\nof both, but he finally won me over with his role in this instant\nScorsese classic. Every character is pitch perfect, every scene is\nright on the money. The plot builds to a crescendo of such dynamic\nproportions rarely seen on film. I don't want to give too much away,\nbut I'm still shaken from the ride I was taken on.<br><br>People go to the movies in the hopes that maybe once in a hundred times\nyou get to experience storytelling so masterful and transcendent that\nit changes the way you view cinema. This is one of those spectacularly\nperfect times.<br><br>Forget Taxi Driver. Forget Raging Bull. Forget Goodfellas. As much as I\nLOVE those movies and as much as they have affected me in my lifetime,\nThe Departed will hands down be Martin Scorsese's Master Work.\n"},
{"review": "\nThey sure know how to make their version real 'American' with all the F\nwords. That seriously was annoying, how every actor in the movie always\nneeded to curse, I should have counted them.<br><br>The original (Infernal Affairs/Mou gaan dou) is way better.<br><br>Why? Cause the most important key was missing! In the original movie;\nthe mole (Chan Wing Yan (as Tony Leung)) in the mafia gang had a great\nbond with the head guy of the entire case. He gave him a watch for his\nbirthday. At that moment you could see how those two has a bond with\neach other. That would explain the grief that he showed in the movie\nwhen the head guy got killed.<br><br>The American re-film: Billy and Queenan totally had NO connection in my\neyes. All Dignam could do was bash him with the f words. Why the hell\nwould Billy give a crap that Queenan died? They had no bond. <br><br>I think supposedly in both movies the death of the head guy was the\ntwist in the cases. The both moles (mafia side aswel the police side)\nrealized this cannot continue anymore. Afterwards they had to take\nstrong measurements to the case. That all cause of the death of that\nhead guy.<br><br>So yeah, I advice everybody to watch the original one first. I think\nthis movie is too overrated. I sure hope they won't re-film part II and\nIII of Infernal Affairs (it is possible you know...).\n"},
{"review": "\nLets start with a very slow intro to an amazing story. Then lets\ncompile a dream cast of characters to act out this amazing story. So\namazing in fact that it very well could be the best movie of the year.\nThen once this character had given up everything and risked his life in\nnearly every scene, lets FINALLY give him the opportunity to hand over\nthe dirty cop and set things straight. Well, we don't have time to\nfinish the story with a great ending, so lets just kill him. Then at\nthe end, lets kill the dirty cop so he can be decorated as a hero\ninstead of turning over evidence so he can be convicted. This could\nhave been the best movie of the year, and the story could have been\ntold in well under 2 hours. They should have just opened and closed\nwith a firing squad and I could have been in and out in 10 minutes with\nthe same results.\n"},
{"review": "\nI beg you all, especially those who vote &gt; 8, please view the trilogy\nof \"infernal Affair\" (Wu Jian Dao) from HK before doing any judgment on\nanyone in Departed.<br><br>I personally favorite staff in the movie, Jack, Matt, Leo, Martin. I\nhave to say all actors are the best, also, the script. Director, i am\nso disappointed.<br><br>The story and even most charming details are borrowed from the original\nversion(the first installation of the trilogy, if you are interested,\nthe following two are also the most excellent movies in HK movie\nhistory), however, Martin turned me down finally.<br><br>No discussion on the reasons why the two mouse come to be themselves,\n(it has been a long way why they \"departed\"), please do not use only\nF-word to attract us, please don't regard everyone of us as fool. Matt\nis kind of no-brain to get all the info to Leo when they finally meet\nat the police office, and then became just a cold blood killer(still\nno-brain) to delete his files. is that make any sense, they looks like\nidiots there? Music is nice, but still a long way to the old one, which\nis much compatible to the atmosphere(which is also missing in this\ncut).<br><br>And finally, the end is disappointed. where in the HK version, it is\nmost exciting and moving 10 minutes during last 10 years. thanks!\n"},
{"review": "\nI got to see a sneak preview of it, and I must say: the BEST film of\nthe year so far. Scorcese is at his best and truly deserves his\nanticipated first Oscar for this film. Also notable are the\nperformances of Matt Damon (such a great \"bad-guy;\" he really must do\nstuff like this more often), Leo DiCaprio, Jack Nicholson (as always),\nand Mark Wahlberg (best since Rockstar). However, some in the theater\nwith me who had seen Infernal Affairs did say that Departed did not\nlive up to the original. I have yet to see Affairs, but I honestly\nbelieve that Departed was pulled off well enough to really bring in\nsome respectable awards in the upcoming season.\n"},
{"review": "\nDare I? Dare I say it? This movie is better than Goodfellas. There, I\nsaid it.<br><br>I saw this latest Scorsese film at an advance screening. Needless to\nsay I was expecting a lot \u0096 more than I thought this director (of\nclassics like Taxi Driver but lately of Gangs of New York) would\ndeliver. I was very wrong.<br><br>Though the exact plot is unimportant, The Departed is about the blurred\nlines that distinguish good guy from bad guy, and cop from robber, in\npresent-day Boston. With a packed cast (which I need not mention) that\nincludes great supporting roles by Martin Sheen and Alec Baldwin, the\nacting in the departed is stellar. Living-legend Jack Nicholson\nflawlessly delivers one of his best performances in years as the\nexecrable mob boss Frank Costello. Nicholson's nuanced acting was so\non-point that at times I felt like I was actually about to be shot by\nthe slimy capo.<br><br>The Departed is nothing short of spectacular. Funnier that most\ncomedies, Scorsese is still able to amplify the bloodshed and\nmeticulously deliver a stunning cinematic achievement.<br><br>Bravo, Mr. Scorsese; you have outdone yourself.\n"},
{"review": "\nWhy does Hollywood continue to believe that people in this day and time\nneed to hear cursing in movies that goes way out of line. The entire\nscript was centered around who could use the F word the most in one\nsentence. I believe that the writer must believe that in order to be a\n\"real\" man that you have to curse. The truth is that a person who has\nto curse to try and prove himself lacks the character and integrity to\nbe a \"real\" man. Don't try and say that the characters in the movie are\ntalking like cops in the real world do. I am a police officer and have\nbeen for over 35 years and have never heard anyone use the f word like\nit was used in this movie. The Massachusetts State Police hopefully are\nin a uproar over the way they are portrayed in this movie. It makes\nthem look like a bunch of uneducated dunces that can only prove\nthemselves to each other by cursing. Stay away from this movie.\n"},
{"review": "\nThis film is overrated. I enjoyed watching it and expect it will sell\nwell, but being quickly included in the top 250 is more a factor of\nAmerican ignorance than film genius.<br><br>This film is mainstream. I don't remember any long shots or\ngroundbreaking lines. Instead, the Departed feeds the lack of attention\nand mainstream spit talk of a cookie cutter sellout.<br><br>This film is unoriginal. Do you seriously feel that this film develops\ncharacters properly? Do you think that the twists were unexpected\nbecause you were raised on Disney entertainment. Did you forget the\nunbuilt grey area regarding the CIA informer?\n"},
{"review": "\nI thought the original movie of it \"The Infernal Affairs\" was more\nentertaining than \"The Departed\". The Infernal Affairs had more actions\nand more emotional than The Departed. It was total copy cat of the\nInfernal Affairs. When Leonardo DiCaprio was trying to beat Matt Damon\non the top of the building was lame. With the Infernal Affairs was\nawesome. Tony Leung(Leonardo) pointed his gun at Andy(Matt) and said,\n\"Sorry, I'm a police officer.\" Later Andy killed Tony in the elevator\nthat was great action. Unlike The Departed was really retarded. For the\nInfernal Affairs it's a 10/10! There is one thing that was good about\nThe Departed was that there was Leonardo DiCaprio. He acted extremely\nwell. Matt Damon doesn't know how to act. They should of had Brad Pitt\ninstead. The performance would be more outstanding. They got lots of\ncheap actors for The Departed. For the Infernal Affairs, they got a lot\nof expensive actors. GO INFERNAL AFFAIRS!!!\n"},
{"review": "\nWhen I heard Scorsese made this movie, i was very excited. Because one\nthing that i know, Departed will be an adaptation of my favorite\nHongkong movie \"Infernal Affairs\" or \"Wu Jian Dao\". And when I read a\nmagazine, the director denied and said it's only inspired by. So my\nexpectation flew away. But all my dream has gone when I saw \"Departed\".\nIt's all the same. Sorry, spoiler, how the boss gang died, how the\ncaptain died, how the undercover died, all the same. In short, all the\nimportant scene, are all the same. Maybe, they have different ending\nbut if you have seen \"Wu Jian Dao\", \"The Departed\" just only follower.\nNo need a big name like Scorsese just to remake an Asian movie. One\nthing, \"The Departed\" has lost the thrill that \"Wu Jian Dao\" have.\n"},
{"review": "\nwhat a let down, after all the fuss and rave reviews, the film is not a\npatch on the honk kong original. scorcese takes two and half hours to\ntell a very simple story that in the original had you tensed up all the\nway. here what we get is banal dialogue,(goodfellas again) implausible\nplot turns, (i'm trying to remember if infernal affairs plot was as\nludicrous, take the fact that di caprio goes to see the police shrink,\nin the police building, what no ones sees him. the basic premise and\npoint of the movie is when and how they are going to discover,each, it\ntakes ages to get to this point, by which time i was bored silly with\nnicholsons way over the top performance, di caprio looked and sounded\nlike he was about to cry any moment, but worst of all was that the film\nhad no energy, it just sagged, this is now the third film from sorcese\nthat looks tired, it started with gangs of new york, then aviator and\nnow this, by this going, his next film will positively crawl to the\nend. overrated, overblown and forgetfull\n"},
{"review": "\nI went to see this film yesterday after reading all the wonderful\ncomments along with some slightly bitter comments from people that have\nwatched Infernal Affairs and were not entirely happy with Scorsese's\ntake on the Hong Kong original.<br><br>The first comment I would like to make is that I saw the original\nInfernal Affairs a week ago meaning that it is still fresh in my\nmemory. That film was a very complex thriller that got straight to the\npoint. The Departed on the other hand focuses on story telling and\nwhilst staying faithful to the original, it becomes its own film.<br><br>Scorsese has taken a great film and turned it into a masterpiece with\nbreathtaking violence and superb character development. If fans were\nexpecting a shot-for-shot remake, they obviously don't understand why\nScorsese is regarded as one of the best directors of all time.<br><br>The acting of all the leads were legendary and they all looked very\ncomfortable in their roles. Anyone out there who previously disregarded\nLeo DiCaprio as an actor will be totally converted as he delivered an\nastounding performance and showed a gritty side to his character. In\nfact, he was so good that Mr Nicholson didn't act him off the screen\nwhen they shared screen time together. Accolade also has to be heaped\non Damon also as he came into his own as the sneaky but smooth rouge\ncop. Add Sheen, Whalberg, Baldwin and Winstone to the mix and you have\nthe best cast assembled for a motion picture this year.<br><br>Offcourse no film is perfect (Although this comes close) but the only\ndisappointing aspect of the film will be from the perspective of those\nthat have seen the original. I am ultimately referring to the ending.\nWhilst anyone seeing this film for the first time will most probably\nembrace the climax, anyone that has seen the original will know what I\nmean.<br><br>That aside, this movie has marked its place alongside such classics as\nGoodfellas, Raging Bull and Scarface.\n"},
{"review": "\nJack Nicholson does his impersonation of Rip Torn, Dicaprio and Damon\nare distinguished only because one of them (but which?) has some facial\nhair, and all of them and everyone else puts on a lousy \"Southie\"\nBoston accent so even the actors natively from there come across as\nfake. Except a few actors put on a fine Irish Brogue so you know\nthey're Irish. Such entertainments are needed in this remarkably\nplot-free orgy of camp, grumbling, meaningless shootouts and poignant\ncell phone usage. I haven't counted to see if cell phones are used as\noften as guns, but no doubt a future thesis on the theme is lurking.<br><br>Jack Nicholson at one point refers to the John Hancock building. That's\na building in Boston. Wow, Nicholson was so in character he might have\njust winged that.<br><br>Everyone calls everyone else a rat, or an undercover, and sometimes\nthey say things like \"He's undercover!,\" What undercover?\" \"No, he's my\nundercover.\" Abbott and Costello more humorously expressed it: Who's\nrat's on first?<br><br>There's also authentic Hollywood crime lingo, like \"were you tailed\" (a\nplay on rats perhaps).<br><br>Everyone informs on everyone else and in the end, everyone shoots\neveryone else, except one person who's character is so vague you can\nlook him or her in the eye and not know who. \"I want my identity back,\"\nsays one character, mysteriously. All of this highlights the key themes\nof the film, that everyone is everyone else, and in the end, only cell\nphones survive.<br><br>There's also a lot of looking in cell phones, presumably because to\nHollywood types, even more than the rest of us, looking at cell phones\nis done often and always is a thrill. <br><br>This movie is a really good argument for having movies directed instead\nof run by mugging improvisers; alternatively a future film can dispense\nwith actors entirely, and focus entirely on cell phones and computer\nscreens.<br><br>However the City of Boston, played largely by itself, is convincing.<br><br>T\n"},
{"review": "\nI'm never going to be in a position to win an Oscar, so maybe I just\ndon't understand how goshdarn fab it is to get one. Still, were I\nMartin Scorsese, I can't imagine not being too ashamed to show my face\nin public after receiving an Oscar for this claptrap. This isn't a\nMartin Scorsese film; this is a Saturday Night Live sendup of a Martin\nScorsese film. This is the Academy saying, \"Well, we didn't give him\none for Gangs of New York or for Good Fellas, and he's getting a little\nlong in the tooth, after all. We'd better give him an Oscar for this\nbefore he croaks.\" Is there anyone -- ANYONE??? -- in this film, with\nthe possible exception of DiCaprio, who isn't acting following a major\ndose of Xanax? (Matt Damon evidently took his Xanax after a lobotomy\nthat was so botched that he could no longer even change his facial\nexpression.) And what's with Mark Wahlberg's HAIR??? Is there any\nredeeming social value in scene after scene (after scene) of heads\nexploding in a red cloud? Even Scorsese is bored with depicting\nviolence; he does it because it's expected of him, not because he\nreally gives a damn anymore. You're stupid enough to want it; he's\njaded enough to give it to you. A plot line with more holes in it than\nthe hull of The Titanic. Characters about as appealing as Jeffrey\nDahmer. You can't care what happens to a single person in this film,\nand you can't even care that the moral center collapses about an hour\nin. This film isn't even sickening; it's just dull, dull-witted, and\ntrashy. Scorsese got his Oscar out of sympathy; too bad the film\ndoesn't have any for the viewer.\n"},
{"review": "\ni am a huge fan of 'Infernal Affairs' when i heard that Hollywood were\nremaking it, i was a bit sceptical about it, then i heard it was being\ndirected by Scorses i was excited.<br><br>i sat there for the first half hour or so, thinking the original got\nthis part over and done with in about 10 mins. The Departed just didn't\nhave the suspense or the character development of the original. When\nSheen died, you just didn't feel anything for him, and the shock factor\nthat the original had was just not there.<br><br>the character development in the original was great, as you genuinely\nfelt for the characters went hey died, but in the departed it was like\nso what if you die. The ending of the departed was a bit of a joke, it\nwas just too much, i think Scorses just thought 'i don't want to make a\nsequel or a prequel to this movie' - (didn't want to make another\ngoodfellas).<br><br>to those who say Scorses deserves best director or that the departed\ndeserve best movie, must be kidding me. Infernal affairs didn't even\nget nominated for best foreign language movie. When it is certainly a\ncut above the Hollywood remake. I'm sure they'll be nominated but to\nwin, i don't think so.<br><br>however on the plus side, DiCaprio has probably produced his best work\nsince 'Whats eating gilbert grape', and is certainly in with a shout\nfor best actor.<br><br>the movie alone is a gd movie, but compared to the original its just\nanother unfulfilled remake So if you have only watched the departed, go\nand rent out/ watch on film four the original and then re-write your\nreview because I'm sure it will be very different.\n"},
{"review": "\nI love Scorcese, but, eh, this is the guy who also shot Gangs of New\nYork of ridiculous fame. And this... piece of work is worst. Don't get\nme wrong, I liked a lot the first half hour of the movie. Even\nNicholson is \"good\" and doesn't overplay his part in the beginning.\nQuite a miracle in itself for this decade! But then... where goes the\nplot? By the ending you get some unlikely situations that should have\nbeen \"preserved\" for the Da Vinci Code Crap: \"So, he is the traitor?\nWell, I'm not going to tell anyone, I will send him a CD with a\nrecording I don't have yet and I will bring him on the top of a\nbuilding to... huh... to use the lift with to get to floor level and\nI... huh... will call my old academy friend... huh... to... huh... ask\nhim to come so the 3 of us can use the lift! Yeah! Good idea! And we\nwill shoot everybody, and I won't tell the police, and I won't tell the\nonly officer who knows who I really am. Genius!\" NONSENSE! The last 45\nminutes are full of pretentious unbelievable \"so called smart ideas\".\nTry the original \"Infernal Affairs\". Even if it's not much glamorous,\nit definitely has \"something\". PS: and, BTW, don't you Damon is bland\nin this film?\n"},
{"review": "\nThis film should have just been called \"Infernal Affairs - Slightly\ndifferent ending\".<br><br>All the ranters and ravers of how glorious a film this is are those\nobviously oblivious to the existence of the far superior Hong Kong\noriginal.<br><br>I'll admit I'm a huge fan of most of Scorsese's other work &amp; was highly\nanticipating this release but upon watching this I was hugely\ndisappointed, so much so that I almost fell asleep, &amp; the only other\ntimes that has happened was during the remake of The Wicker Man -\nenough said there.<br><br>Advice for anyone who has not seen this would be see the original &amp;\npray Hollywood doesn't make a sequel.\n"},
{"review": "\nTrust me! Once you see the Hong Kong original, you would find out that\nScorsese ruined this terrific play!<br><br>The original title in Chinese was \"Wu-chien-dao\", which in Buhdism it\nmeans the bottom level of the hell. In this hell, people are doomed for\neternity and suffer forever. And in the original, Costigan killed the\nother guy Costello sent into the force and the movie ends. Costigan has\nto bear the quilt and live on! This is what the script wants to show!\nLiving but with the quilt is THE true hell after all! The new ending\ntotally ruined the essence of the script underneath. <br><br>What a waste!\n"},
{"review": "\nI have never been more disappointed in a movie in my life. A great\ntwist in a movie is one like \"the Usual Suspects\", where there were\nclues to the deception. In this film, the twists were just thrown out\nin mid air. Also, the entire \"love story\" angle was useless. Finally,\nhaving 3 or 4 or 5 endings was ridiculous. Sorry, one more thing, so\nwho was the good guys, who are we rooting for? I wanted to love this\nmovie so bad. But I wound up hating it. Sorry. One example of a useless\nscene. Jack Nicholson is in a porn movie theater and finds Matt Damon.\nNow, Matt Damon has essentially lived his life to protect and serve\n\"mobster\" Nicholson. What does Nicholson do? Threaten to take away his\ngirlfriend. How I will never know? Then advise him he is not doing\nenough for him. HUH??????? Damon was so loyal to Nicholson you would\nhave thought he was his father. Just another example of a scene where\nthe writer and director tried too hard and simply failed.\n"},
{"review": "\nThis movie sucked big time. I agree with all of those who complained\nabout the abusive and unrealistic cursing, specially when coming from\nthe cops. It makes no sense that educated people whose job it is to run\ninvestigations would keep talking like that all the time. But even if\nyou choose to suspend disbelief on that matter, there are just too many\ninconsistencies to be able to let yourself taken in for the ride. Other\nviewers have described them very well, so I thank them for saving me\nthe time. I also felt a great disappointment since I used to think that\nMartin Scorsese was a great director. Well no more I guess. Just\nanother big commercial production which just doesn't fly... Too many\nheavy weights and too much pandering to the lowest common denominators,\nthis recipe usually favored by Hollywood only succeeded in giving me an\nindigestion... buuurrrp!!!\n"},
{"review": "\nDo you know the story about the king who left his palace naked and\neveryone in the crowd watching him were commenting on his splendid\nclothes? This is how I feel after reading reviews from well-known and\n\"respected\" critics on Scorcese's \"The departed\". Because that is what\nScorcese's film is-it is naked, devoid of any rhyme or reason, of any\nreason why things happen, of any values. To me it is just the ranting\nof an older man, it is Scorcese fantasizing about violence, sex,\ncorruption ; it is Scorsese thinking \"wow it is so clever to show all\nthis blood and to have my actors swear all the time, yeah this is art\"\n. Well, I am sorry, but this isn't art. This is about Scorsese\nrepeating himself and indulging in his obsessions and us congratulating\nhim. I am not a conservative person- I just feel like the little boy in\nthe story who cried out that the king was naked; like the little boy\nwho wasn't a hypocrite and just showed things as they were.\n"},
{"review": "\nSorry, thought this was very bad.<br><br>Terrible story, have not seen Infernal Affairs but State of Grace and\neven the pilot of The Shield were far superior and credible.<br><br>Wahlberg too weak for the role, his scenes with Baldwin and Damon were\ncomical.<br><br>Alec Baldwin, enough said...<br><br>Nicholson overacting wildly the rat impression made me cringe.<br><br>DiCaprio's performance was going OK until the line \"I can't believe you\nare so vulnerable right now\" - Vulnerability! couldn't see that emotion\nanywhere but it seemed I was supposed to, which made me question the\nwhole performance.<br><br>Matt Damon was actually quite good.<br><br>Direction - the film looked good, sounded good but all to no avail when\ntied to such a poor story.<br><br>Not trying to pick a fight just my opinion. Nearly every review has\nbeen positive surely someone else hated it?\n"},
{"review": "\nAmerican remake of the successful \"Internal Affairs\" trilogy, about two\nmen seeking out each other's identity; one is a cop that goes\nundercover as a mobster, the other, a mobster that goes undercover as a\ncop. Dream-boats Damon and DiCaprio do a good job vanishing into their\nroles as tough guys, but their charm and ruthlessness still can't mask\nthe crime-thriller clichés; and the ultra-climatic conclusion is just\nreally nothing more than simply over-the-top. The wittiness of Jack\nNicholson doesn't impress since he doesn't seem to do much acting, but\nrather just charismatically act like Jack. The quirky dialogue of\nIrish-American mobsters comes off as corny and tiring. Martin Sheen and\nMark Wahlberg are memorable and well-delivered in the humorous\ngood-cop-bad-cop odd-couple, with the latter earning a Best Supporting\nActor nomination. It was the only nomination that was well-deserve, the\nonly nomination that didn't win and the only nomination that should\nhave won. Won Best Picture, Editing and Adapted Screenplay. It should\nbe called \"The Retarded\".<br><br>*½ (out of four)\n"},
{"review": "\nI was excited to see the movie because of the cast and the story. I was\nvery disappointed after 5th minute because it is the same exact copy of\nthe movie INFERNAL AFFAIRS '. The scenes, the story, everything is the\nsame. I would understand if they used the story as a base and made a\nmovie out of it but I will not accept it if the only thing they changed\nis the cast. I cannot make a good comment of the movie because it\ndefinitely is not a movie of it's own. There is no excitement of\nwatching the movie because I know what would happen on every scene. I\nwill give my vote to the actors only because their performance (\nespecially Leonardo Di Caprio )was very good but that's all.\n"},
{"review": "\nWith out Siu Fai Mak, this film would never have happened - even from\nMartin Scorsese. It is evident that Hollywood has completely run dry of\nnew ideas and is seeking great films from Asian nations to make money -\ne.g. 'The Ring'. After years of great original gangster films from\nScorsese, I am disappointed. A setting in Boston, is the only original\nitem of this film. For those unfamiliar with Siu Fai Mak, I deeply\nencourage you to watch 'Mou Gaan Dou' (\nhttp://www.imdb.com/title/tt0338564/ ) aka 'Infernal Affairs' - the\nbasis for this film. Infernal Affairs contains far more intense drama\nand (if not better) an equally high quality acting roster than this\nremake. Although this film was greatly entertaining, it would not have\nbeen made if not for the 2002 original from China.\n"},
{"review": "\nThe director practically gutted the original story. This is classic\nHollywood doings. I've never seen a worse adaptation from an original\nmovie. They basically added more sex scenes and cut out all the\nmeaningful parts of the original stories, made the story choppy and\nhard to follow, then stick a couple of big names to draw the audience. <br><br>The original Hong Kong movie Infernal Affairs has a solid character\ndevelopment. Infernal Affairs also used more intelligent ways of\ncommunication between the undercover and the source, making you sit at\nthe edge of your seat. Aside from much stronger story lines, it also\nportrayed mental health workers in a much more professional\nmanner...the psychiatrist in the Departed would've had her license\ntaken away in a snap as there are strict laws prohibiting dual\nrelationships. Just like all meaningless mainstream movies, as if\nputting in a sex scene and showing some flesh would make up for the\nhorrid chopped up story. The original made the psychiatrist-patient\nrelationship more real and tapped into the inner workings of the\npsychiatrist working with an undercover. If you are looking for a truly\nwell written screenplay with deep emotional plots, go watch the\noriginal Infernal Affairs instead!\n"},
{"review": "\njust saw this movie. absolutely pointless. everyone can fluff Scorsese,\nNicholson, etc, but this movie is not that good. everyone may think its\ngood because all movies now are garbage. however, a better smelling bag\nof garbage beside a worse smelling bag of garbage is still a bag of\ngarbage. DiCaprio does a good job and Damon is surprisingly good, but\nthe story is just so blah and predictable that it is easy to fall\nasleep while watching the movie. in my opinion,the movie does not focus\nenough on one character to facilitate viewer involvement. also,the\nmusic is not prominent enough and some of it is recycled from other\nScorcese films which makes a veteran movie goer such as myself think\nScorcese should ride off into the sunset.\n"},
{"review": "\nI didn't know who directed the movie until the credits when the name\nScorsese popped up, so I saw the movie without any expectations. I must\nsay I wasn't very impressed. First off the infiltration of Costigan\ninto Costello's gang happened way too fast and wasn't very convincing,\njust like the infiltration of Leo's character in Gangs of New York.\nMark Wahlberg's character Dignam felt really fake, the kind of language\nhe used was not very likely to be used by someone in his position, same\ngoes for Baldwin's character capt. Ellerby. The love triangle drama was\njust pathetic, why would she date some ex con with drug problems when\nshe's already moving in with Sullivan, a career cop who climbs the\nlatter in the department like a sky rocket (i.e. very unlikely). They\ntried to portrait Costello as this big time mobster but the way he\nhandled business felt more like a small time gangster, stealing pocket\nchange from some corner shop.<br><br>I haven't seen the original Infernal Affairs so I can't say weather or\nnot this was worse, but I would really think so. The only part that\nsurprised me positively was in the end when the other mull showed up\nand blew Costigans brains out, I didn't expect that one. That kind of\nwoke me up, too bad it was just before the credits.\n"},
{"review": "\nI went to see this movie with Infernal Affair fresh in mind. I wanted\nto compare the two. and I did. I thought The Departed was really good\nbut not better than Infernal Affair. there were a few changes but they\nwere more upsetting than making the remake better. Matt Damon is not as\ncharming and cool as Andy Lau in his character. I feel that they have\nsoften the character for Matt Damon. Leonardo Di Caprio was pretty good\nin his role though I must admit that i was more 'attached' to Tony\nLeung. Overall, I find that The departed is just a remake of Infernal\nAffair: it didn't really add up much. SPOILER: i really hate the The\nDeparted ending. Why did they end it like that? They should have stuck\nto the same ending as Infernal Affair. But then, if they did, Mark\nWahlberg's character would have been useless...<br><br>Even though it's Scorsese, it cant beat Infernal Affair. I give it an 8\nbecause I gave Infernal Affair a 10.\n"},
{"review": "\nQuite frankly, it took me a few viewings to figure this one out. This\nmovie seemed a bit too long and contained several unnecessary\ncharacters and events. Mark Wahlberg's character, in particular , just\nseemed way over the top and was just plain annoying. I still haven't\nfigured out why this character is even included in this story. As for\nthe other performances, Nicholson seems a bit out of place in this one\nand Martin Sheen is a little too low-key. I must agree with other\nreviewers that state that this movie contains way too much information,\nplot twists, and should have been a lot shorter. I have yet to see the\noriginal \"Internal Affairs\" but will now seek it out and compare the\ntwo. Again, I agree with other reviewers that I just didn't see what\nthe big deal was about this movie. This was not one of Scorsese's best\nas far as I'm concerned.\n"},
{"review": "\nThis is a terrible movie. It's two and a half hours of obscenities\ninstead of script, violence instead of acting and Jack Nicholson\nplaying who else but Jack Nicholson.<br><br>I'm sure a lot of people will say all this was necessary to give the\ngrittiness to the movie. It isn't; think of the great gangster movies\nof the thirties, forties and fifties. Bogart and the lot never said any\nmore than, \"darn\" and most violence was implied rather than cataloged.<br><br>It's no wonder society is running out of control when this type of sick\nmovie wins an Oscar.<br><br>Bruce\n"},
{"review": "\nI am not a real film buff, and neither is my wife. I had heard that\nthis film was supposed to be good, and rented it. Despite the excellent\ncast and good production values, I couldn't believe how labored the\nscript was, and how much overacting was taking place (much of it by\nNicholson).<br><br>When we finished watching the movie, I remarked to my wife that I must\nhave gotten the film confused with some other. I went to IMDb to see\nwhat rating it had gotten -- I figured maybe a 6.7 or something.<br><br>To my disbelief, it lands in the top 100, and won the best picture\nOscar! I went back to tell my wife that it had won the best picture,\nand she thought I was joking. Then her reaction was that someone had\nhacked my computer.<br><br>As far as the comments here, I would have had to think that there was a\nlarge astroturf component. But with the film winning best picture, I\nguess I am just seeing one of those occasional mass delusions that\nhappens in the world.<br><br>But what I *really* can't believe is that it won best script. Un. Be.\nLievable. This script was so bad, and so unconvincing, that after I\ntold my wife that it had won best picture and director, I remarked that\nfor sure it couldn't have won best scriptwriting. But it did.<br><br>I simply don't understand what people see in this film. The plot is\nsophomoric. The involvement of Costello in routine pickups and\ndeliveries, and the immediate trust and access to the boss given\nCostigan, is so implausible that I find it difficult to believe anyone\ncan take this film seriously. Is it supposed to be camp or something?\n"},
{"review": "\nThe fact that IMDb gave this movie as high rating as Academy did sure\ndoes shake IMDb'S OWN CREDIBILITY.<br><br>Some negative reviews i read above indicate to an awfully bad\ndirecting, to which after watching the DVD i fully agree. Mr Scorsese\nmust be ashamed for accepting this Oscar. He was robbed for his Oscar\nwith \"Taxi Driver\", now he lets Academy do the same s**t in turn to\nsome other deserving director. How shallow! Puts shadow on his earlier\nworks. It is my impression that ever since 9/11 Oscars were mostly\nfake, political, interest/profit driven. Is this an indication of THE\ndownfall? <br><br>The younger actors did well, too bad they will be remembered in\nassociation with THIS. Because when the balloon over \"marty's great\nmasterpiece\" pops, the critics - Eberts' etc. will go down on this\nmovie like flesh hungry condors. <br><br>However, i don't think watching it was a waste of time. It made me once\nagain appreciate the great \"Gimme Shelter\" by Rolling stones. The next\nmovie on my watching list IS titled \"Gimme Shelter\"\n(http://www.imdb.com/title/tt0065780/)\n"},
{"review": "\nso lame. you didn't believe any motives behind any character. Nicholson\n&amp; marky mark make you laugh i hope on purpose. Matt Damon doesn't get\nhit in the head nearly enough. there's a funny nod to jack's joker. do\nnot expect goodfellas. don't even expect a chainsaw sequel/prequel.\nthink more like scary movie 2, but without trying.<br><br>do Southey's ever get tired of being made fun of in movies? between\nthis and mystic river, i'd be real upset. i get it, Irish guys love\ntheir moms and miss their dads. the only thing that could have made\nthis worse is if ed burns was in it. the best performance was the lady\nwith the nose plugs.\n"},
{"review": "\nScorcese has lost it, between this movie and Gangs of New York and the\nGeorge Harrison documentary. The movie is way too long, poorly edited,\ndialogue ugh, I just don't get the hype. Must be the violence.<br><br>Nobody acts in this movie, it's Nicholoson, Sheen, Baldwin, and Damon\nbeing themselves. DiCaprio I give an A for effort. The female\npsychologist roles is the worst. I couldn't sit through this and I am\nfrom Boston. Unless you are a cell phone salesman. This reminds me of\nCrash all the mainstream media fell in loves with a \"Scorcese Gangsta\nFilm\" how he can go wrong.<br><br>The Oscars, the media, the brainwashing.\n"},
{"review": "\nI understand why you may think this film is good. Just the fact you\ndidn't know about the original movie made in Hong Kong. The Departed\ncannot even compare to the original - Infernal Affairs. It is like\nwatching a TV movie with seriously bad acting, bad direction, crap\nmusic. I can't find anything good about this movie apart from the\nstolen story line. Are you people blind or something? The story has\nbeen changed in parts for the worst. There is no style whatsoever to\nthis film. All I can say is that its the most disappointing remake of a\nforeign film I have ever seen. Watch the original trilogy to enjoy\nstory telling at its best. Scorsese??? Please!! U have no idea.....\n"},
{"review": "\nMartin Scorsese, the master of gang epics, is at it again. This time in\n\"The Departed,\" he uses modern technology to show what mobsters et al\ncan do to create mayhem.<br><br>The acting here is first rate as Jack Nicholson, who portrays a vicious\ncriminal, is right on target. His antics are terrific. Leonardo De\nCaprio delivers a knockout performance as the guy working secretly for\nthe police. Matt Damon does a fine job as the guy going in the opposite\ndirection.<br><br>The film deals with 2 young men recruited to serve in various\ncapacities. One works for the mob to infiltrate the state police\ndepartment in Boston, the other is a cop working for the mob boss. You\nwould think that their lives would connect sooner as both see and fall\nfor a female doctor.<br><br>The violence and use of the 4 letter word is really too much to bear. <br><br>Look for nice supporting performances from Martin Sheen, Alec Baldwin,\nand Mark Wahlberg as veteran cops.<br><br>The film goes downhill in quality as the body count begins to mount.\nThis film is certainly not for the squeamish.\n"},
{"review": "\nOh dear, it's Scorsese does Tarantino with some Goodfellas thrown into\nthe mix (even down to using the Human Beanz - Nobody But Me for a fight\nin a shop). The first third of the film is excellent, despite the\nconstant sound of the Rolling Stones - Gimme Shelter every five\nminutes, but then it goes downhill fast. The basic premise of a cop\ninfiltrating the Irish mob and a mobster infiltrating the cops is good,\nbut soon so many other things are thrown into the plot it becomes a\nfarce. Why make Costello am FBI informer? Pointless, other than maybe\nto give Matt Damon a reason to kill him, although it would have been a\nthousand times more interesting if Damon's reason was Nicholson's\ndismissive treatment of him since a teenager. Why did Matt Damon's\ncharacter have so much power to do as he liked in the force after only\njoining a few months back, able even to call a surveillance of Sheen\npolice chief? Stupid. How come Damon didn't figure out immediately that\nDicaprio's character used his phone at the meet with the Chinese? He\nknew the whole of Nicholson's crew apart from Costigan, but Scorsese\njust needed to drag the film out for another hour. Why was Baldwin's\ncharacter camping it up like a pantomime dame all over the screen? The\nacting from Baldwin was so bad it made me think he was play acting for\nDamon's character and actually new he was a mole, but he didn't,\nBaldwin just can't act. The mess of shootings at the ending wasn't a\ntwist either it was very dull 'ho hum' and 'so what' and i had lost\ninterest half an hour earlier when Nicholson exited the film. After the\nfirst hour this film is silly, contrived and with no clever plot twists\nat all but just pointless adding of layer on layer of meaningless guff.\nIf someone tells you this is an intricate and well plotted film, don't\nbelieve them, point them in the direction of The Usual Suspects.\n"},
{"review": "\nDespite all the hype, the Oscars, and the good reviews on this site, I\nfound the Departed a great disappointment. The story never for one\nmoment captured my interest. There was not one character that I cared\nwhat happened to. And, as it seemed that most the actors were doing\ntheir jobs quite well, I assumed it was either story or direction that\nwas the problem with the movie, or maybe both.<br><br>I found that the Departed suffers from Tough Talkitis. That is when all\nthe characters speak to each other with such tough, rude, arrogant\nattitudes, it becomes unreal (like a cop show on Fox). Why? Because no\npeople anywhere interact with each other that way in real life. It's a\nsynthetic movie-acting manner that actors take on to project toughness\ninto their roles. It is too fake.<br><br>DiCaprio and Damon do reasonably well in their over-tough parts,\nDiCaprio especially. Sheen is restrained. Wahlberg is particularly\nannoying as the police sergeant who never is for one moment human. He\nis smug and coarse. No doubt the director shaped that characterization.\nWorse than all is the outrageous hamming of Nicholson, a lifelong\nfavorite of mine. I never believed him for a second in this role as\nsome sort of serious Joker gangster. Alec Baldwin is very good in one\nof his small roles, which he seems to specialize in these days.<br><br>The story is humdrum and boring. I began looking at my watch about 15\nminutes into this epic. There is no humor, even less character\ndevelopment, annoying side shows (the shrink girlfriend), and no real\ntension in the tale. After one hour and forty-five minutes of this, I\nrealized that I did not care about what happened to any of these\ncharacters, nor did I care how the 'story' turned out. So I shut it\noff.<br><br>Three stars for a good try (stretching it!).\n"},
{"review": "\nSeriously, what's the big fuss about this movie? Too long, too\npointless, too slow. After an hour and a half I just couldn't keep\nwatching it. I like suspense movies. This isn't one. Is it supposed to\nbe about the characters? The info about them was so eschew that I\ndidn't know them very well after 90 minutes. What was supposed to be\ngreat about it?<br><br>I absolutely despised that this won best movie in 2007. Seriously. Far\nbetter ones in the category. It's outrageous that this is ranked better\nthan movies like Aliens, 2001 Space Oddysey and Forest Gump. Skip it,\nor just rent it and see for yourself.\n"},
{"review": "\nWhat a disappointment! Just saw the DVD of this allegedly Best Movie of\n2006 and am most disappointed.<br><br>Virtually all conflicts and threads are resolved with bullets through\nthe brain with concomitant spraying of blood. Nothing gets worked out\nintelligently.<br><br>And there are just too many inconsistencies in terms of police\nprocedures for any of this to be believable. And they have the audacity\nin one scene of the movie to have their cops dumping all over TV cops,\nwho are generally far more believable IMHO.<br><br>And is everyone so stupid that neither Damon or Di Caprio is recognized\nas a mole when there just aren't any other credible candidates? I\ncontrast this 2006 film with the far-more-satisfying \"Notes on a\nScandal\" in which the conflicts among the various characters are\nresolved through creative plot development; nary a pistol in site. I\nguess whoever said \"violence is as American as cherry pie\" wasn't very\nfar off the mark at all.\n"},
{"review": "\nGeez, I'm a Martin Scorsese fan and I've enjoyed just about every one\nof his movies but \"The Departed\" was just a terrible piece of film\nwork!<br><br>Granted the acting was superb but that is about where it ends for me!\nThis has got to be one of the meanest and dark movies ever made by\nScorsese... just over the top with characters that anyone would walk on\nthe other side of the street to avoid! <br><br>When the movie goes out of its way to make our protagonist a victim and\nnot allow him to get his life back, that's when it completely lost me!\nHow much frigging realism do we need? He could have gotten the point\nacross and not had Mark Whalberg's character be the only 'good' one\nleft... all others were killed off! And, with Whalberg, you never liked\nhim because of his attitude throughout the movie! <br><br>Damon was good and Nicholson was his usual scene stealer self and Leo\nwas in a league all his own, but the movie went 30 minutes too long and\nthe ending was too awful to enjoy! No escapism for me here, just a\nreminder that we have really bad people in the world and some of them\nhave taken a pledge to 'Protect and Serve'! <br><br>This terrible piece of trash will get Scorsese his first Oscar because\nthe Academy will award him more for his body of work than for this\nmovie; I'm just afraid that once he wins, other filmmakers will feel\nthe need to copy this movie's style and we'll see 100 clones of corrupt\ncops killing everyone that might remotely cross them! BLECH!\n"},
{"review": "\nI don't want to vote for this movie but I find it very low from the\nAmericans to remake an Asian movie and to get (or will get)a bigger\nsuccess then the original movie.I want to criticize the American movie\nindustry because they are not original. It is better to search for\noriginal ideas then to play the role of the copycat in our society.<br><br>I wanted to say my opinion to those who appreciate the American movie\nindustry so much.(and surely this movie)<br><br>good examples of remaked movies are : the ring , the grudge , the seven\nsamurai, Godzilla , (masked rider) and more (they planned also to make\nan American version of Battle royale)<br><br>Even if they remake it well they will never win my respect and i will\nconsider it like fake.<br><br>thank you\n"},
{"review": "\nWhat a waste to a masterful script! Scorsese has totally wrecked the\nscript by polluting it with unnecessary profanity, gore, blood and\ntasteless sex scene. The only good thing about this remake is Jack\nNicholson performance (except for the rubber penis). The original is\nthought provoking and make you want to see it over and over again. The\ncharacters in the original are captivating. The characters in the\nremake seems shallow and pointless. You don't feel for any of the\ncharacters, even the supposedly good guys, i.e. Martin Sheen, Mark\nWalberg and Leonardo DiCaprio because Scoresese did not care spending\nthe time to build the story behind the 3, instead he just overloaded\nWalberg character with mindless swearing and stupid insults to\nDiCaprio. What for?????? The last few scene of shooting is even\nlaughable. What a mistake! This is just one messy remake of a perfectly\ngood movie.\n"},
{"review": "\nThe Departed is loaded with talented actors and I went into it with\nhigh expectations. That said, during the last 30 minutes of the movie I\njust wanted it to end. <br><br>It has strong acting, but that's a given considering all the on screen\ntalent. It is too long, the pacing is too slow, and just felt like it\nwas missing something. A lot about the movie felt contrived to me and I\nleft the theater feeling deflated. The love story was predictable, a\nlittle weird, and definitely inappropriate considering the characters\npositions. The film didn't really have a climax, instead there were a\nseries of climactic moments that kept sort of just puttering out and\nletting me down. The cinematography was boring as well, most of the\nshots seemed pretty simple and uninteresting. Similarly, the score felt\ncontrived and pedantic. Like some bean counters calculated the songs\nmost likely to impress a 2006 American audience and threw all of them\ninto this film. Overall, I just can't recommend this film to people and\nI think it is possibly the most overrated film of the decade.\n"},
{"review": "\nI watched this movie (again) last night and it finally dawned on me\nwhat bothered me about it the first time I saw it. It's actually a\npretty weak story. Too many big names.(very distracting). Pretty weak\nacting. Especially Sheen, Nicholson and Wahlberg. I really like\nScorsese and Goodfellas is one of my all time favorite films but The\nDeparted isn't even in its league. Jack shows up, well, as Jack. I\nthink the last time Nicholson actually played a character, other than\nhimself, Reagan was still in office. I don't buy him as a powerful\nIrish Mob boss for a minute. Wahlberg just yells and cusses a lot for\nno good reason. And Sheen looks kinda like he had a minor stroke before\nfilming started. He looks like he's trying not to soil himself in every\nscene he's in. Not a bad movie but Best Film?? Really?? I also noticed\nthe Boston Police Department is portrayed as an inept bunch of clowns\nwho do nothing but yell, cuss, and argue instead actually doing any\npolice work. 5 stars.\n"},
{"review": "\nThe names that appear on the movie are just impressive: a great\ndirector (Martin Scorsese - I am a BIG fan of Goodfellas, taxi driver,\nRaging Bull just to name a few of his movies) and great actors (Di\nCaprio, Nicholson, Sheen, Daemon, Wahlberg), but the entire movie and\nthe way how it was directed is just a total disappointment from\nbeginning to end. Nicholson being overly cruel, Wahlberg being overly\ncynical and aggressive towards everyone (and why??), Di Caprio spending\nhis time in the movie crying like a girl, Sheen inexistent... Also how\ncan one believe that a stranger can earn a head of crime syndicate's\ntrust in just 6 months, especially when that head of crime syndicate\nhas the reputation of being very suspicious and doesn't trust people\neasily?? It looks to me that Scorsese was too ambitious, tried to do\ntoo much in a movie, and at the end, he just didn't deliver. I felt no\nsympathy or anger whatsoever for any single character in the movie. I\nam a BIG fan of Hollywood movies and Scorsese but for once, I prefer by\nfar the original Hong Kong version, Infernal Affairs which is far\nbetter directed, more dramatic, where the psychology of the characters\nis far better developed (I actually felt sympathy for the undercover\ncop), and the story far more credible (it took the undercover cop\nseveral years to earn the crime lord's trust in the Hong Kong movie as\nopposed to a few months in The Departed). I now have the proof that\neven super talented directors and actors (whom you believe have nothing\nto prove anymore) with a huge budget are able to deliver a garbage...\n"},
{"review": "\nThis was just not a good movie, it should be free, not for purchase on\ndemand. Screenplay was written terribly, and the directing or editing\nwas bad. It was sort of a bad joke. Not worth repeating. <br><br>There were time warp issues where things didn't fall into play\ncorrectly. It seems like they got finished filming and decided there\nwere too many big names to just scrap it and pretend it didn't happen. <br><br>The most disappointing was Jack Nicholson and Martin Scorsese were\ninvolved and they couldn't even save it. It might have been Jacks' most\nuninspired acting job of his career, but I think the screenplay was so\npoorly written as though to dumb it down as much as possible so that\nthe audience would realize how unsophisticated the Boston Irish really\nare. <br><br>DeCaprio and Damon were equally bad and Alex Baldwin and Marky Mark\nwere just behind them. The characters were bad, and the attempt to have\nus understand them was missing except for the vulgar language. I swear,\nScorsese must have a deep hatred of Boston and the Irish to portray\nthem so badly. <br><br>What was good? the shootings and violence were pretty good. <br><br>I think the script caused this all, it was so bad the top actors and\ndirectors couldn't save it. I'm really surprised it made it out. I'm\nmore surprised it is rated so highly online, but now i understand why\nit took me almost ten years to see it.\n"},
{"review": "\nMaybe it deserves a 7. It is quite to very suspenseful, with a valuably\ncomplex but not arcane plot, well-made, solidly acted (meaning in part\nthat Jack Nicholson does not just re-enact his job as the Joker.\nDiCaprio was better in Blood Diamond.) The cast is indeed stunning.<br><br>But right now it is ranked above such trivial fare as Citizen Kane, The\nShining, North by Northwest, M, Vertigo, To Kill a Mockingbird, Eternal\nSunshine, Bicycle Thieves...(citing only a few whose lower ranks make\nme want to vomit). I know I am beating a dead horse. It probably is,\nafter all, better than Shawshank (dumb fanboy movie of the world, I\nguess), Cuckoo's Nest, Inception, Forrest Gump, and arguably 5 to 15\nothers in the top 46.<br><br>But it has limited to no imagination and makes no contribution to film\nhistory. Its best picture Oscar should've gone to Pan's Labyrinth, or\nVolver, or conceivably The Lives of Others, or Letters from Iwo Jima,\nor Little Miss Sunshine--three to five other films to rank ahead of\nDeparted. I haven't yet seen Infernal Affairs, so I can't make that\ncomparison. But in a nutshell, I know Taxi Driver and Departed is no\nTaxi Driver (#68. Makes me nuts.)\n"},
{"review": "\nThis film is so overrated. Martin Scorsese gave us a poor copy of the\nmasterpiece \"Infernal Affairs\" and everybody applause. He received an\nOscar for best motion picture for it. It's such a shame, it's\nrevolting. I can understand that they wanted to reward Scorsese for his\ncareer but they rewarded a bad remake.<br><br>1- It's a lame plagiarism ! 2- DiCaprio is very good,as usual. Maybe HE\nis the only good reason to see it. But Tony Leung is unforgettable for\nthis character. 3- It's rude for no good reason. 4- It's a 2h30 film.\nScorsese did a confused remake that's almost 1 hour longer than the\noriginal. There's definitely something wrong here.<br><br>I'm sure that the people who love this film, didn't see the original.\nWell, if you read this, go watch Infernal Affairs. You will see that's\nan amazing film. And you will understand why some people think Departed\nis awful.\n"},
{"review": "\nThis remake of \"Internal Affairs\", a great movie in its own right, adds\na Whitey Bulger-John Connolly Boston twist that just BEGS for\nbrilliance - it's a can't-miss story line with a powerhouse cast.<br><br>However, it's a huge disappointment. Despite such compelling material,\nScorsese only skims the surface, opting for gloss instead of substance,\nadding confusing sub-plots that serve mainly to hook the audience.\nThese sub-plots destroy the momentum of the film and pull the whole\nthing off the tracks. Without these (no spoilers), the film may have\nhad a chance. Scorsese's trademark violence stingers are now overripe\nat best. Am I the only one who started to yawn when people were getting\npounded over a loud soundtrack in \"Casino\"? I doubt it...<br><br>There is some pretty silly ensemble work here, too - we're not talking\n\"Glenngary Glen Ross\" or \"The Usual Suspects\" here by any stretch. Most\nof the bad highlights usually involve Wahlberg's profane fool of a\ncharacter. Overall, the individual characterizations seem to be either\nshrill, as in the case of the annoying Wahlberg and chest-thumping\nDamon, or flat, like Sheen's police captain. Nicholson's Whitey Bulger\ntake is completely lacking in menace - it's amusing, if nothing else.\nOnly DiCaprio's brooding Billy Costigan stands out, but he's got\nnowhere to go, both literally and figuratively - the sub-plots\nbasically turn his character to face the wall... <br><br>Much has been made of the ending here, but I would describe it with one\nword - \"cowardly\". I just couldn't respect this film much, particularly\nin light of \"GoodFellas\" and other Scorsese masterpieces. Overall, 4\nstars and only because it's him - probably the worst best picture Oscar\nsince \"American Beauty\".\n"},
{"review": "\n'Awful' doesn't begin to describe this insulting, puerile, stupid waste\nof everybody's time. Do you hear, William Monahan? You wrote a script\nthat is lamer than the massed teams of the 2012 Paralympics. Not one\ncharacter in it is believable, engaging or sympathetic, not one word of\ndialog in it bears any relation to actual human speech patterns, and\nany semblance of plot is absolutely smothered in unnecessary, bloated,\nself-indulgent pretentiousness, disguised with profanity as the\n'honest' language of the good old Oirish Boston Police Department.<br><br>Martin Scorsese, you directed a tiresome, overlong, overcomplicated\nmess. The only actor that comes out of 'The Departed' with any credit\nis Alec Baldwin because it's so obvious he doesn't take it seriously -\nhe does a prototype of his '30 Rock' psycho-boss.<br><br>For the rest of the cast, they frown harder and harder as this\nextremely tedious film lurches to its anticlimactic conclusion, as if\nthat would make a viewer any more interested in it. If Jack Nicholson,\nthe scruffiest and most inept gang boss in cinema history, had been\nlooking for the 'rat' in his gang, he could have chosen a worse\ncandidate than Ray Winstone, whose American accent falls off somewhere\nwest of Shepherds Bush. As it is, he fails to suspect anyone at all.<br><br>OK, so it was purely a money-making enterprise, and succeeded in that,\nbut please; why could they not have fleeced their customers with a\nlittle good humour? Avoid this film like the plague - it's on cheap\nchannel reruns at the moment (Aug 2012), and it is disgracefully badly\nwritten, poorly acted, and sloppily directed.<br><br>On the other hand, if you want to hear Dvorak's 'New World' (you know,\nthe 'Hovis' ad) played on the bagpipes, which I am asked to believe is\nwhat the Boston Police play at all their funerals, fast forward to the\nend. Everybody but Mark Wahlberg gets shot. Monahan and Scorsese should\nhave been.\n"},
{"review": "\nWhat can I say? It's f..king overrated! And way, way too long... Tedium\nand confusion set in at times. Don't watch it \"cold\" as I just did on\nDVD. Without knowing exactly who was playing who; I certainly lost my\nway at times. Partly due to cramming so much plot, or what passes for\nplot, into so little time.<br><br>Best Picture of the Year? How could it fail to win when up against such\nheavy-weights as Babel, Little Miss Sunshine, Letters from Iwo Jima and\nthe Queen? And what glorious blood-shed and splatter! Remember the\nheavy \"flack\" against that in the Wild Bunch? But that was a great\nmovie. Basically, \"The Departed\" a B remake of a B plus Chinese film.\n"},
{"review": "\nSo very glad not to have spent money on this film in a cinema, but\nwatched it only on TV. I do wish that some of today's directors and\nactors would immerse themselves in an intense examination of some of\nthe Hollywood and British movies of the 1940s and 1950s to see how\nreally to make films that are crisp and tight in direction, how the\nactors of those times were able to speak their lines in clear and\nunderstandable English, and that self-indulgent acts (actors) like Jack\nNicholson simply were not given the time of day.<br><br>As for this film, far too much of it was devoted to scene after scene\nof interminable length, simply so that the director and actors could\nshow off their alleged \"skills\". That was, instead of the director\ngetting hold of the central storyline - potentially, quite good - and\nhis actors by the scruff of the neck and stating quite clearly: okay,\nguys, let's really get on with this and concentrate on the core\nessentials of the story in as tight a manner as possible.<br><br>Instead, the whole film went on and on in a cumulative exercise of\nscreaming tedium. And, I bet, that you wouldn't see for those old films\nthe interminable list of continuity goofs that accompany the comments\non this film on the IMDb entry!\n"},
{"review": "\nIt is just a bad terrible Hollywood copy of IA. I can't believe how\nHollywood treat the audience. Lots of scenes, dialogues or even acting\nwas the exact same as the original. Even most of the locations was the\nexact same as the original. The only different was the Hollywood\nending. I am very very very disappointed, we can be more creative, this\nis very sad !!!!! I don't believe the screen play writer hadn't watched\nthe original Infernal Affairs while writing the Departed screen play. I\nam sure everybody in the cast and of course the writer and Director had\nwatched the Original for at least 10 times if not 100 times. The actors\ndelivered the same exact emotions and writer and director just\nAmericanized the story. Add some sex scene. Add few sub plots not\nrelated to the story and a happy resolution in the ending. Come on guys\nyou can be a little more creative with 90 Million dollars budget. The\nother sad thing is how films are sold and marketed using actor names\nand not the story line. Infernal Affairs and Departed are great example\nof this. The Original Infernal Affairs when screened in US just made\n$89.6K, because in US there are very few people that watch anything\nmade outside Hollywood. Departed made $289 Million by using the same\nstory, plot, character and even dialogue, they just changed the actors\nand put the known actors and it made close to $ 300 Million . What can\nI say Viva Hollywood. Brad Bahmanpour\n"},
{"review": "\nFirst, is it me or is it still the in-thing these days to act tough by\nsaying f*** ALL the time? This movie is littered with f*** every other\nword. It makes the movie so 80s. All the subtleties are lost by the\npoor dialogue.<br><br>As you know, this movie is based of a hong kong made movie \"Infernal\nAffairs\". If you have the chance, watch that version. The plot is\nsimilar, but it has a lot more subtleties that this movie failed to\nproduce.<br><br>I'm very surprised that this movie won the best picture and directing.\nIt's an entertaining movie, no doubt, but it's definitely not up to\npar....\n"},
{"review": "\nI thought I kind of liked Departed, despite its obvious continuity\nproblems (surprising from such a supposedly amazing director), before I\nsaw infernal affairs and realized what a blatant word for word, scene\nfor scene, rip off this movie is. I'm giving Departed 1 star. Scorsese\nshows off his lack of creativity once again. I'll be giving Infernal\nAffairs 10 stars to compensate for other reviewers!! If you haven't\nseen Infernal Affairs I highly recommend it. You will not be able to\nhelp comparing it to Departed because it's all there- every scene! But\nit will be worth it to see what true originality and creativity look\nlike. Tony Leung is one of the best actors in the world and though this\nis not his best film it is still well acted considering the Hollywood\nstyle of the movie.-Yes, I'm hating on Hollywood now. Scorsese\nobviously tried to fill his film (rip-off) with as many big name\nHollywood stars as possible to compensate for the fact that he added\nnothing original to his movie. If imitation is the highest form of\nflattery then that's all the more reason to see Infernal Affairs. For\nthose of you looking for an unbiased review of the Departed-sorry\nyou're not getting it here. I just finished watching Infernal Affairs\nand all the tension and coolness I thought was in Departed was\ndisplayed so much better there- in it's original form. Oh, and did I\nmention that Infernal Affairs is an original- not that originality\ncounts for much I guess. I don't mean to bash Scorsese completely. He\ndoes get props for recognizing that Infernal Affairs is a good original\nmovie. But like the character in the movie- no spoiler here- Scorsese\nmimics something but does not become that thing. This has been his\ntrade mark from the beginning.\n"},
{"review": "\nCocky Boston police detective with the Special Investigations\nUnit--who, as a young man, was mentored by a drug kingpin, an overgrown\nthug who is still making everyone shake in the old neighborhood--is\nstill in-cahoots with this mob boss and attempts to ferret out the\npolice cadet whose job it was to infiltrate the bad guys' circle and\nget hired on. In turn, the cadet--who is frustrated by his lack of\nidentity--must find the spy on the police force who is playing both\nsides. Big Oscar winner from director Martin Scorsese is an\nAmericanization of Hong Kong's \"Mou gaan dou\" from 2002. It is also\nvery typical of this particular filmmaker: flashy, fast-moving,\nrepugnant and yet reveling in its nastiness--to the point where one\nnearly feels the rampant ugliness and constant homophobia gets the\ndirector's seal of approval. As the undercover cop, Leonardo DiCaprio\ndoes some of his finest work yet; although he can't do much with the\nman-woman stuff involving a perplexing Public Service psychiatrist,\nDiCaprio is convincingly rough in a very difficult role to pull off. As\nthe bad detective, Matt Damon is also first-rate, bravely playing a\nreal pr*ck while giving the picture a smug swagger that suits the\nnarrative well (I would have preferred more about this character's loss\nof morals however, which happens entirely off-camera). As the\ndrug-lord, Jack Nicholson performs without vanity and slithers through\nthe movie like a smiling cobra; his unpredictability as an actor is\ntailor-made for this role, and Scorsese is careful not to overload the\nscreen with Jack (we get just enough of him, although one sequence in a\nporno theater goes over-the-top). \"The Departed\" isn't particularly\nshrewd, and it is not Scorsese's best work, but the linear structure of\nthe complicated plot is nearly free of static and has many gripping\nscenes. **1/2 from ****\n"},
{"review": "\nBefore I saw the Departed I knew it was a remake of Infernal Affairs,\nso I expected the basic plot to be the same.<br><br>What I did not expect was for Scorsese to shamelessly copy Infernal\nAffairs practically scene for scene, word for word in some places.<br><br>All Scorsese does is change the title, the setting, the characters\nnames, add 50 superfluous minutes, two unnecessary characters and a cop\nout ending.<br><br>Scorsese is a great director and deserved an Oscar long ago, but for\nhim to accept an academy award for this outrageous piece of plagiarism\nis a disgrace.<br><br>The really sad thing is that so many people have watched and will watch\nthis thinking its a good original thriller, unaware that they are\nwatching a cheap imitation of a truly great Hong Kong film.<br><br>So please do yourself a favour and watch Infernal Affairs first, only\nthen will you realise what a sham the Departed really is.\n"},
{"review": "\nJack Nicholson is a real good villain, period.<br><br>As for the story - it starts off as extremely intriguing, a brick here,\na brick there, great acting, and still, in the end, which is blatant\nand potty, you feel there has been much ado about nothing.<br><br>Everybody shooting everybody for various reasons is a possible\nfinish-off, no doubt. But then why take the efforts to build up a\nfantastic background in the style of the best Mafia movies so far and\nthen end in a shooting scene which is not original, not exciting, not\ninteresting, not comprehensible, and does not follow logically from the\nplot.<br><br>I think there could have been a lot more to this story but they have\neither ran out of time or money or patience or their common sense. It\nis regrettable, since the build-up of the characters is so\nextraordinarily good and it all goes down the drain at the end of the\nday.\n"},
{"review": "\ndon't know why this thing got such high score. its cut like a frickin\nmovie trailer, watching this thing.. feels like watching a 2 hour long\nmovie preview.. jeez. extremely annoying. the story is pretty good\nthough, like the angle. but the cutting.. argh, its so annoying, it\ngets through everything, and all you can think of is how badly cut this\nmovie is.<br><br>then there's the characters. whole frickin bunch of wannabe tough guys.\nthey're so pitiful and lacks so much charisma they need to wade through\nrivers of blood to get any sort of credibility. waste of time. friggin\nwannabe Tarantino directors.\n"},
{"review": "\nThis movie has three things seriously wrong with it.<br><br>1. The dialog is juvenile, evidently intended for kids in the 12 to 16\nage group. It seems like every sentence included at least 3 curse\nwords. Apparently the writers were handicapped when it came to\nvocabulary.<br><br>2. The movie does not make use of Jack Nicholson's talents. He is\nupstaged throughout the movie by inferior actors.<br><br>3. The movie has a very poor ending. Most of the characters get shot\nwithin the last few minutes, and then the screen says \"The End.\"\nNothing was decided.\n"},
{"review": "\nDefinitely the the type of movie that makes it worth going to the\ntheater. Very intense action and violence, twisting plot, lot's of\nmisdirection.<br><br>The story line is a bit overly whelming at times, this isn't a good\nmovie to watch if you're tired and follow the action, the double\ncrosses and the sometimes confusing who's who of the movie, but if you\ncan just remember the basic characters the minor twists won't be too\nconfusing.<br><br>While it's certainly not a love story, there is that element, with a\nbit of a morality play going the whole time.<br><br>I can't make some of the statements I'd like to make because I really\ntry to avoid spoilers in my reviews, but I'll say that I enjoyed the\nmovie even though had I been in charge it may have ended differently...<br><br>All that said, if you like a thriller that has some rough and tough\nviolence and a plot with a few twists and turns this film would be one\nI'd recommend to you.\n"},
{"review": "\nI don't understand how can it have such great marks when the original\nversion is way better. It's pretty much the same as the original except\nfor one particular thing that was one of the best parts of the original\nfilm.<br><br>And the thing that really pisses me off is that it was given the Oscar\nfor the best adaptation... it was adapted from another film (tell me\nhow difficult it can be) and the good parts are all the same.<br><br>It may be true that the actors did it very well and that the plot is\nexcellent, but the original actors are as good as these ones and the\noriginal plot is even better so I highly recommend to watch the\noriginal one first (Infernal Affairs). You won't regret it.\n"},
{"review": "\nHi Everyone.<br><br>For those people who don't know, this is a remake of a Hong Kong\nclassic trilogy Infernal Affairs. Infernal Affairs is a better, more\ncompact film that has more tension,a great ending and it just flows\nbetter for 2 hours. Don't get me wrong, The Departed is a good film,\nwith many great actors, but you don't need these actors in this movies,\nI think this takes someone away from it. People didn't go to watch\nfilms like Reservoir Dogs or Donnie Darko for the actors, they went\nthrough word of mouth, because the films sold themselves.<br><br>Why does Hollywood remake ideas from other people and then get all the\ncredit for it? \"Scorsese, what a genius, he should win an Oscar\". What\ncrap, you tell me why he should get credit for this?. If anything\nAndrew Lau &amp; Alan Mak should get credited.<br><br>I can only hope that Hollywood do not get credit if and when they\nremake 'Oldboy', 'City Of God' and 'Downfall'. Perhaps Downfall will be\nset in the Whitehouse at the end of the Vietnam War.<br><br>Watch Infernal Affairs first, then you can pass judgement.\n"},
{"review": "\nI have seen Infernal Affairs(the original) and the Departed is really\nterrible in comparison. The scene for example where Damon's character\npretends to be a lawyer was MUCH better acted by Andy Lau in IA. Jack\nNicholson character was over the top and annoying. IMO, Jack comes off\nas a low class, dirty, scumbag than a \"mademan\" mafioso top dog. The\nscene with Nicholson holding the severed hand in front of Dicaprio was\njust an stupid scene all together. Mark Wahlberg?? What was the point\nof his character? All he seems to do was act like a hoodlum and curse\nwhen he is speaking. I was very impressed with the storyline, the\nacting, and subtlety scenes in IA, but TD just left me uninterested in\nthe story all together and this is the SAME FILM!! THE Departed is a\nterrible film with bad acting, by Hollywood A-list actors. Sorry, but I\ndidn't buy the plot, the acting, the emotions in TD. But then again\nwhat do you expect, its a Hollywood knock-off of an original. I\ncouldn't finsh the film that was how terrible it was.\n"},
{"review": "\nThe most disturbing piece of crap I've had the unfortunately pleasure\nof viewing in a long time. I'd rather watch StarShip Troopers. How many\nf-bombs and head shots can you stuff in a movie. I watched people walk\nout of the theatre and wonder why that couldn't be me. If you want to\nhear about 3 to 4 hundred f-bombs or graphic violence then this is your\nmovie. What kind of graphic violence you may ask. Well if you like\nwatching blood gush out of someone's head or see it splash all over the\nplace not once or twice or even six times then don't pass up this\nopportunity. Geez what else can I describe to meet the 10 line\nrequirement.\n"},
{"review": "\nIn a society where being rich and famous is everything, it's sad to see\na former rebel succumb to his nation's core values. Martin Scorsese\ndecided being a celebrity with all the material trappings were what\nmattered most to him, and dreadful films like Departed and Aviator are\nthe result. Perhaps Mr. Scorsese can rationalize his admirable work on\nfilm restoration and figure he's doing his part for the greater good,\nbut I'm not buying it. In fact, I no longer will see a film simply\nbecause Martin Scorsese is the director. I wish he and Mick Jagger\nwould take their champagne and yes-men to France, and leave the film\nand music-making to more eager and less corporate fellows. Also, as\nmuch as I respect Roger Ebert's analysis and writings, I can not take\nseriously his review of a Scorsese film. Don't know if their buddies,\nbut if Scorsese directed The Fish That Saved Pittsburgh, Ebert would\ngive it four stars.\n"},
{"review": "\nI liked The Departed a lot more before I saw the original. I'm a long\ntime Scorcese fan, but I have to say I'm pretty disappointed that he\nremade Infernal Affairs scene for scene without making it clear in the\nstates that The Departed is a remake. It definitely diminished my\nopinion of his version. The Hong Kong original is less violent and\nthere's no explicit sex (can't say I missed either), but it is\nliterally, scene for scene, the same movie. Nothing against remakes,\nbut I think it's only fair to make it absolutely clear when a project\nisn't original. If you like the Departed, watch the original and see\nfor yourself.\n"},
{"review": "\nI didn't see the HK original, but I was still dissatisfied with the\npicture.<br><br>Plot holes, inconsistencies, the female lead (Jack is always fun, but\nis always Jack being Jack...it didn't work for me here). Damon was\nmonochromatic, Sheen was marginal, Baldwin and Wahlberg were cartoons,\n(and Wahlberg has had much better performances elsewhere like Perfect\nStorm).<br><br>The screenplay didn't use its time wisely - too much time on stuff that\ndidn't matter and too little on stuff that did. It was like a speech\nwhere all the bullet points are treated equally and the speaker rushes\nthrough it without stressing which ones are really important.<br><br>Holding it up to GoodFellas, which Scorsese really should have won for,\nthis was NO GoodFellas. (The use of Gimme Shelter seemed like an homage\nto it). Marty is an Oscar caliber director. But this is not his best\nand was a pity Oscar. He was going to win it this year even if this was\na feature length film about Tennessee Tuxedo.<br><br>Oh, And the rat on the railing at the end made be laugh out loud.\nSubtle, that.\n"},
{"review": "\nHow can anyone think this is a good movie? We know the ending from the\nbeginning, and this can't be good for a movie that actually pretends to\nmix \"suspense\" with \"action\" and a touch of \"comedy\". Here's the story:\nJack Nicholson is some mafia guy who pays for Matt Damon's education.\nMatt Damon becomes a cop who helps Nicholson continue to be the bad\nguy. Then there is Leonardo Dicaprio, who is an informant who works for\nthe police trying to help them catch Jack Nicholson by pretending to be\none of Nicholson's men. Now Nicholson wants to know who might be\nbetraying him. The policemen want to know who is the bad cop helping\nout Nicholson. What is the ending of the movie: suspense, suspense,\nsurprise! They find out. In the meantime, everyone gets killed, Damon\nand Decaprio have sex with the same woman, and Nicholson and the cops\nswear a lot.<br><br>Wow, how creative! How interesting! This movie is stupid, very stupid.\nThis says a lot about those people who picked it as Best Movie at the\nOscars.\n"},
{"review": "\nThis film should be rated for language: not suitable for any age. I saw\nit in Argentina. At the cinema, there was one showing a day, at\n11:45pm, and there were stern warnings that only adults could buy\ntickets. The language was so coarse and untranslatable that the\naudience gave up and left. I was the last to leave -- eerily watching\nthe images continue on the screen in front of an empty room. I did\ndiscover that nearly all the characters were lying to each other, so it\ndid not really matter that we could not understand what was being said.<br><br>Upon my return to the US, I saw that the DVD is available and is\nlabeled \"not authorized for sale or rental outside the US and Canada.\"\nIf only that had been the general policy for this film, we would not\nhave exported such an embarrassment for US culture and especially for\nthe City of Boston and Massachusetts State Police. <br><br>In Spanish, the title of the movie is \"Los infiltrados\" which does not\nhave the meaning of \"departed,\" but everybody in the theater joined the\ndeparted, anyway.\n"},
{"review": "\nShocking is the only word for the originality of this movie.<br><br>The movie is an almost exact replica of a Chinese film made 4-5 years\nago called \"Infernal Affairs\" which won every nomination at the Chinese\nversion of the Academy Awards. Not only was Infernal Affairs better in\nevery aspect, it was original.<br><br>The director and writer of this movie should be sued on the same basis\nthat Taiwanese counterfeit makers are arrested for making Pradda with\ntwo \"Ds\", Nikey with a \"Y\" and Soney with an \"E\".<br><br>With all the money Hollywood makes, you'd think there would be some\nleft for originality. And to top that off, instead of an improvement\nwhich most remakes are, this movie did not do the original justice.<br><br>To those that are interested in watching this movie, may I suggest\npaying less to buy the DVD of Infernal Affairs, where popcorn would not\nbe a requirement to enjoy the movie, but rather a distraction from\nconcentrating on a well made original film.\n"},
{"review": "\nDo not be deceived by favorable reviews.<br><br>This is a bad movie from a director who has long ago lost his edge.<br><br>It is a naked king's clothes, the Jonestown cool-aid, an Iraqi WMD,\nIranian uranium for peaceful purposes only...all hype, no substance.<br><br>A suicidal Scorsese confided in friends in 1980 that Raging Bull would\nbe his last great film; he was not far off. King of Comedy was great.\nIn a vacuum, Goodfellas was also exceptional...but, if you think\nGoodfellas was on par with Scorecese's 1970s triumphs then you should\nwatch (or re-watch) Mean Streets, Who's that Knocking at my Door, and\nItalianamerican. Goodfellas is a big budgeted, sleek production that\nrehashes these earlier classics. <br><br>Which leads us to The Departed.<br><br>What is wrong with Scorsese? Has he developed dementia? Does he have\npermanent writer's block? Has his obsessive-compulsive disorder gotten\nthe best of him, again? Why has he lost the precious ability to be\nartistic and original? <br><br>In The Departed, the best Scorsese can do is abscond core themes from\nother great movies faster than Winona Ryder can stuff away apparel at\nSaks. <br><br>The Departed, itself a remake of a recognized foreign classic (Marty,\ndidn't you learn anything from Cape Fear?), grabs from far better films\nlike<br><br>Reservoir Dogs (e.g., the rat/informer) <br><br>Donnie Brosco (e.g., the undercover cop in too deep)<br><br>Mystic River (e.g., the gritty &amp; violent underbelly of Boston)<br><br>See these excellent movies and identify others that Scorsese has rubbed\nhis dirty hands all over. <br><br>Hey Marty, my version of The Departed has the Tigers' Kenny Rogers\nshaking your hand and leaving with enough smudge to pitch a few good\nones, (at least until Tony LaRussa gets a look).\n"},
{"review": "\nFrankly, i think Scorcese suffers from a personality crisis for quite\nsome time. This movie is another example that this director, who made\nmilestones of Hollywood history once, totally lost his style and\nconstantly tries to follow tired trends. That he's successful with it,\ntells more about his audience then the quality of his recent movies. A\ngood example for this is the nerve-wrecking soundtrack of this mediocre\nremake, which dive-bombs the viewer with one blaring rock song after\nanother. Who does Scorcese thinks he is? Quentin Tarantino? It would be\nexcusable for a beginner to over-spice his first movie with his\nfavorite mix-tape. I like music and i like movies. What i don't like is\nto be pestered with someones dated musical taste when i want to see a\ngangster-movie. My God, just read the list of songs at the end credits.\nIt's insane! You have to be numb to endure this.\n"},
{"review": "\nThe Departed is a movie that first-timers to the plot will enjoy most\nthoroughly. The idea of two sides both having a mole each is most\nthrilling and I am sure viewers will be most impressed, especially with\nthe line-up of stars in the cast.<br><br>However, I give this movie a 6 out of 10 as it is a direct copy of a\nChinese movie, \"Infernal Affairs\" (2002). I am not talking about the\ngeneral plot idea of the film, but rather the entire film sans the very\nlast moment of the film is a direct copy down to Frank breaking the\nmole's cast to check for wires. Even the elevator scene at the end is\nalmost a complete copy from the movie.<br><br>I would have rated the movie a lot higher if it didn't copy so much\nfrom \"Infernal Affairs\". The cast-breaking; the bad guy not revealing\nthat he has found out on his deathbed that the gangster is a mole; the\nelevator scene; the head cop falling from the roof. All of this happens\nexactly in \"Infernal Affairs\" (2002).<br><br>In fact, \"Infernal Affairs\" was a lot more interesting in terms of how\nthe moles went about communicating with their respective boss' and in\nthis way was a lot more thrilling. \"The Departed\" (2006) just feels\nlike a copycat, watered-down version of \"Infernal Affairs\".\n"},
{"review": "\nSad... It's so sad... This film, The Departed, has an 8'5. However,\nInfernal Affairs, the film that was the \"inspiration\" of this awful\nremake has just an 8'1... It's really sad finding one of the most\namazing and relevant directors of all times, Mr. Scorsese, father of\nmasterpieces like Taxi Driver, Goodfellas, Raging Bull or Casino,\nmaking the remake of an unknown Hong Kong trilogy. What happened? You\nsee DiCaprio, Damon, Nicholson and all the other stars and you have a\nmasterpiece? That's not what I thought cinema was. I've seen both\nversions, in fact I have it on DVD. The Departed is a great movie,\nthat's true. But it's nothing more. I can't understand why Martin\nchanged so many things and he still thought it would be the same story\nbut told in a different words. This is not about Italian Mafia!!! This\nis about Chinese mafia, and that's not the same!!! Please, everyone who\nenjoyed The Departed: Take a look on Infernal Affairs. Or ask Tarantino\nabout what he thinks about this remake... The film is OK, but there's\nno color between The Departed and IA. Salud!\n"},
{"review": "\nGood movie but a rip-off by all means! I can't say that wasn't a good\nmovie, I would be lying!!! Never the less though, it was a rip-off of\nthe best police movie that was ever conceived and filmed, \"Infernal\nAffairs\"!!!!<br><br>I mean the original had much lower budget and still it was visually\nstunning while \"The Departed\" felt like a movie that was made in a\nhurry... The plot where in the original \"Infernal Affairs\" was just the\nmost gripping film ever, here felt somehow shallow, if you had seen the\noriginal before. Honestly even the huge stars, which are really good\nactors with talent and real acting abilities, that played in \"The\nDeparted\" weren't as half as good as the Chinese counterparts in the\nspecific rolls.<br><br>What really gets me mad though, is that Scorsese and his crew will take\nthe credits and the recognition that don't belong to them!!!<br><br>All the Oscars should go to the original by far!!!<br><br>If you think that I got it wrong I really urge you to watch the\noriginal and you will understand the difference simply by the impact\nthat the characters will have on you and by the fact that visually is\nso much more detailed and in a much higher level.<br><br>My opinion... Give the credits to those who deserve it!!!!!!!!!!!\n2002's Wai Keung Lau's \"Infernal Affairs\"!!!!!!!!!!!!!!!\n"},
{"review": "\nI know everybody is crazy about this movie. But just because everybody\nswitches sides on each other doesn't make this a deep movie. How did\nNicholson not know that DiCaprio's character was a cop? He acted so\nnervous and it was obvious. But you know what? I didn't know what\nanybody was supposed to be by the end of the movie either. Way too\nconfusing. To me this movie was boring, complicated, and nothing\namazing. Definitely doesn't live up to all the hype it gets. One thing\nI did like was Nicholson as a mob boss. I thought it was a cool role\nfor him. Otherwise, I just didn't get this movie. If you're like me, it\nwill leave you scratching your head.\n"},
{"review": "\nAn absolute disappointment of the remake of the Hong Kong version. It\ntotally lost the spirit of the original version and poor acting from\nboth Damon and Dicaprio. No surprise from Nicholson either. It was a\nreal surprise that this movie could have won so many Oscars, especially\nBest Director for Martin Scorsess. It just shows how pathetic the Oscar\nCommittee is. I would strongly recommend anyone who really like this\nmove to watch the Trilogy Version from Hong Kong. Much better acting\nfrom Andy Lau and Tony Leung with tension throughout the whole movie\nand full of surprises. Perhaps Martin Scorsess should never have\nadapted this movie from Hong Kong... a huge cultural difference.\n"},
{"review": "\nA waste of talent, all around.<br><br>Users have voted this #62 of all movies in the IMDb database? Are you\nkidding me?! Wake up, people - Scorsese isn't even trying anymore. The\nfilm was amateur at best, insulting at worst.<br><br>The unnecessary homophobia and unresolved plot chunks (I hesitate to\ncall 20 minute digressions \"threads\") were pointless, detracted from\nthe 'plot' (I'm comfortable with the scare quotes), and left totally\nunresolved. <br><br>Character development, consistency...give us something to hang to here,\nMarty.<br><br>Total disappointment.\n"},
{"review": "\nI went along to see this after seeing various reviews, all of which\nsaid that this was a return to form for Scorcese etc... I was very\ndisappointed. The casting has got to be one of the worst things about\nit. WTF is Ray Winstone doing in this film? Mostly spoiling it, along\nwith Mark Wahlberg and David O'Hara. Their accents are really, really\nbad. The script itself had some good parts, had they been given to\nwell-chosen actors they may have been more believable. The only thing I\ngot any enjoyment out of was Matt Damon getting punched several times\nby Leo DiCaprio, whose performance in this film was the only highlight\nI can think of. He is definitely improving with age. Its also too long\nand upon leaving the cinema, all I heard were dissatisfied grumbles,\nno-one seemed to enjoy it and some people walked out before the end. I\nendured it hoping the conclusion would make up for the rest of it, but\nit didn't. Not a return to form in my opinion at all.\n"},
{"review": "\nThe Departed, the winner of the academy award for best motion picture,\nis just another remake based on a Chinese original. Critics called it\none of the best movies of the year 2006, but in my opinion it is a\ndisgrace to the Chinese original, called The Infernal Affairs. And it\nis also Scorsese's worst film ever. Even Gangs of New York were more\noriginal than this film. Let me explain why I didn't like this film.<br><br>First, the characters are empty. There is no emotion and the characters\ndon't develop throughout the film. They are just like chess figures on\na board.<br><br>If I go on, this is two and a half hour long remake of a trilogy of at\nleast six hours in length, so many important things were left out, so\nthe story is full of holes that really need to be patched.<br><br>As it is typical for Hollywood the body-count must always be bigger.\nMany characters just die for no reason at all. It seems like Scorsese\nthinks that if he delivers us a messy massacre the film will be a\nsuccess. Just return to your basics Scorsese. Your older films are much\nbetter than your recent crap that you call a movie.<br><br>Another big mistake is that Nicholson's character is more developed\nthan the characters of Damon and DiCaprio, maybe because Nicholson\nreally did a good job and acted as a professional. But this is the only\nbright point of the film. And this is the reason for my two stars,\nbecause Nicholson is the only one who keeps this movie above one star.\nA disaster in every way and a very unfair decision of the Academy to\nclaim this movie as the best motion picture, especially to the Infernal\nAffairs, which deserves an Oscar for the best motion picture more than\nthis poor interpretation.\n"},
{"review": "\nI started my day with 2046. I won't recommend that film to any but fans\nof Tony Leung (Mou gaan dou, Ying xiong), Li Gong (Miami Vice, Memoirs\nof a Geisha) and Ziyi Zhang Memoirs of a Geisha, Ying xiong). The music\nwas excellent and Tony Leung's performance was spellbinding, but the\nmovie was hard to follow.<br><br>I only mention Tony Leung because his performance in Mou gaan dou was\non my mind as I watched The Departed, which is a remake of that film. I\nwish I had a copy with me to watch again and remind me of why it is\nsuch a favorite, but I have seen it enough times to know that it still\nstand above the new version.<br><br>I just couldn't wait any longer, so I bought my copy yesterday and sat\ndown with some chips to watch. Leonardo DiCaprio was magnificent. I\nhave never been a big fan of Leonardo. I really liked him in Gangs of\nNew York and Catch Me If You Can, but this performance was over the\ntop. Having said that, I can't really think of another character's\nperformance in The Departed that is worth mentioning. It ran 50 minutes\nlonger than Mou gaan dou and the extra time was really a waste as it\ndid not add anything to the film. The setup in the beginning was really\na bore. Scorcese did so much better work in Gangs of New York and\nGoodfellas, one of my favorite films. I really don't see him winning an\nOscar for this film, though they will probably give it to him for\nignoring his earlier and better work.\n"},
{"review": "\nThis movie was one of my local Blockbuster Video's \"it's in stock or\nit's free\" titles. I came to the store the day after this movie won the\nAcademy Award for Best Picture and it was out of stock, so I thought\n\"what the hell\" and got a voucher for a free rental, which I redeemed a\nweek later.<br><br>I can't ask for my money back since I rented this movie for free, but I\nwish I could have my 2.5 hours back. This was the most pretentious\ntruckload of tripe I've sat through in a long time. I am a big fan of\nHBO's The Wire and other well made crime dramas. But I'm also a fan of\nmovies that have a point. This movie had no point except to portray\nsome laughably fake version of the \"gritty reality\" of Boston's crime\nscene and to pop off the main characters through one contrived \"plot\ntwist\" after the next. <br><br>A lot has been made about the acting in this movie. I think all the big\nname actors in this movie delivered highly-energetic, but completely\nboring performances. That is to say their idea of character development\nin this movie basically consisted of constant shouting. Nicholsen was\ncartoonish, acting less like his character and more like, well, Jack\nNicholsen. I never believed him as a crime boss, and I never believed\nDamon, DiCaprio or Walberg in their roles either. <br><br>A lot happens in this movie. A lot of people die graphic deaths and a\nlot of people swear a lot. A lot of people say \"Boston\" things like\n\"Boston\" people say them. A lot happens in this movie, but nothing\ninteresting happens. I find it interesting that many of the most\nnegative reviews of this movie come from real life cops and others who\nactually have some firsthand experience with the \"gritty\" urban life\nthis movie purports to portray.\n"},
{"review": "\nThis film has received an Oscar? Why? <br><br>It is not even a very good film, certainly not a Classic like\n\"Goodfellas\". <br><br>The script is poor. The Direction is stale. The Characters are\none-dimensional and Jack Nickolson acts badly for the first time in a\ndecade?<br><br>Is this award for the Directors past work? Scorsese has made some\nwonderful films and a couple of classics as well, but why did he not\nreceive the awards due to him at the time. This proves the Oscars are\nstill trapped in a stained reputation of it's own creation.<br><br>The film is a poor re-make for Gods sake!!\n"},
{"review": "\nThe Departed is an occasionally engaging film, beautifully acted and\nphotographed. It has powerful narrative energy as it breathlessly races\nthe viewer through a complex plot. However, the praise for this film\nhas been far overblown. The Departed is not as inventive as Taxi Driver\nand not startling and sublime like Raging Bull. In fact, Scorcese's new\nfilm is overly long and somewhat tedious. The contrived plot seems\nbanal, and neither Di Caprio nor the bland Damon make their roles\nparticularly interesting. Sadly, despite his technical virtuosity, it\nbecomes apparent here that Scorcese has little more to say about his\nthemes of urban alienation and the brutality of modern life. The film\nis grotesquely violent at times, and the viewer begins to wonder as yet\nanother bloody shooting \"goes down.\" Unfortunately, the shallowness of\nthis film and its predictable brain-spraying violence disappoint the\nScorcese fan.\n"},
{"review": "\nI'd have seen this film regardless of the reviews. Scorcese has\ndirected some of the most significant, dramatic and best-told stories\nof our time, and with Nicholson, Damon, DeCaprio, Baldwin, Sheen,\nWalberg and the rest, it at least had a solid chance to be a tour de\nforce. It's a mess, though, dragged down to lousy by a screenplay\nwritten by the same misguided pen of that disaster-bore-embarrassment\n\"Kingdom Of Heaven\". Bad or no structure can't be saved by\nover-cranking the ragefest volume.<br><br>It's hard to say why Marty needs to wallow in even deeper pools of\nperpetual manic violence and blood at this point in his career. Maybe\nhe still just likes it. Maybe he's feeling like we need to take some\npeople out. Maybe the only way he could punctuate and hold together\nthis cluster was with regular, loud, brain blasting, because if it\nweren't for the continuous bang-bang-blast, in-your-face-insults and\nface-punch scenes the story would've resembled a garbage pile. An\ninteresting plot line was strung together by an amateur, though\nfortunately you've got watchable actors, some wry funny lines and a few\noutrage scenes that pop.<br><br>The screenplay's choppy, the edits and lighting choices are weird, and\nthe script's incongruent in a bad way. It never builds a tempo. That's\nScorcese's fault. It was a great shame to see great actors content with\naccepting performance mania in lieu of characters. So in spite of all\nthe odd-crazy, there're also huge bald spots. Nobody in this film goes\nbeyond one-dimensionally anger-crazed, with the possible exception of\nDeCaprio. Still, I couldn't understand how Leo didn't explode during\nthis film; he goes from appearing over-stressed and over-drugged to\nrage-psycho. I felt possessed to snort Ajax watching his crazed eyes\nand jaw grinding for 2 hours.<br><br>I give it a '3' -- there's enough good violence to feel punched up\nafter a numbing week at work.\n"},
{"review": "\nMy husband and I were prepared to really enjoy this movie, but could\nnot get past the vulgar language. We don't enjoy a dialogue that has\nmore words that start with \"F\" than any other word in the English\nlanguage. Understand we're both in the construction business and are\nnot prudes, but if you can't express yourself without using the \"F\"\nword, every other word, just don't talk. They used vulgar language so\nexcessively I lost track of the point. I won't even comment on the\nvisual violence! Enough already. We went to the movies to be\nentertained not grossed out. I, personally, have decided I will never\nattend a movie with these stars and this producer again. How can we\nexpect our kids to NOT be violent when movies like this are the norm?\n"},
{"review": "\nI know that it is not difficult to say that in every remake's case, but\nthis one really got my hopes high. Unfortunately, it wasn't the case\nthis time. Don't get me wrong, the movie is still great, it just falls\nbelow expectation. Yes, Di Caprio is great for the first time (he was\ngood in some movies before, but here he is just superb). Nicholoson -\nis over the top, being 69 years old he is still much more charismatic\nand believable than his young rivals. The rest of the cast is just\ngood, no flaws.<br><br>Whenever they tried to stick to the original - everything worked great.\nFor some unfortunate reason they decided to over-complicate already\nsophisticated screenplay - and spoiled it. There are some unnecessary\ncharacters creating the mess, some FBI storyline in the movie that only\nGod knows what that was intended for. And also the ending - I do not\nknow, ending in the Hong-Kong movie was reasonable and understandable,\nhere it is basically the same - but messy. In the original all of the\ncharacters had very clear reasons for everything they did, and they\nlost it here.<br><br>My biggest problem with that one is that in the original neither one of\nthe main 2 characters was either complete bastard or saint - and here\nthey actually made it black and white.<br><br>And no, don't forget about Taxi Driver:) this one is very good\n(especially if you have not seen the original), but not great.\n"},
{"review": "\nFirst I saw 'The Departed'. It was cool. Then I saw 'Infernal affairs'.\nIt was awesome. Then, after some time, I saw 'The Departed' again. And\nI realized I've been conned. <br><br>I wish there was a way to talk about 'The Departed' without constant\nreferences to IA, but there isn't. This is not a re-imagining, it is\nnot a remake or a tribute- it's a pure and simple rip-off, most of the\ntime scene by scene, shot by shot. Everything that is good, interesting\nor storytelling in 'The Departed' originates in IA. All they did was\nchange the setting and the language and dumb down the story here and\nthere with some melodramatic/vulgar effects. Speaking of vulgar; I\ndon't give a s**t about 'ugly words', some of the best movies are full\nof cursing, and hell, that's how people really talk after all. But... i\njust couldn't get past of how scenes that are subtle and cool in IA are\nalmost systematically replaced with mindless cursing-orgies here. It's\nnot that they curse it's that they ONLY do that, as if a tirade\nWahlberg-style could actually replace acting and real emotions. It\nseems like throwing in a dick-joke, adding some punches, yelling, being\nall f**k this and f**k that is what makes true 'realism'. Even in minor\nscenes; in IA the mob-mole merely has a conversation with the\npsychologist; here he blows up, yells and runs away. After the cinema\nscene, when the cop nearly finds out who the mole is in IA you have a\ntense psychological scene; in The Departed Matt Damon MUST stab\nsomebody, apparently the director doesn't think it's cool enough\nwithout that. Or the classic rooftop end scene- in IA the two opponents\nact calmly, with dignity- here there's cursing and fighting and\npunching instead of a shared moment of drama. In one word- it's cheap,\nsomething you wouldn't expect from Scorsese and this cast.\n"},
{"review": "\nThe Departed is Copy of \"Mou gaan dou (2002)\" Viewers when i saw \"The\nDeparted\" i was really shocked that endless calculated movie made by\nMartin Scorsese, brilliant acting damn good script, direction, cut to\nshort everything was calculated, but few days ago when i saw the\nmentioned movie \"Mou gaan duo (2002)\", i was shocked coz the Great\nGreat Director \"Martin Scorsese\" did the same as Indian's are doing\nfrom last few decades, i don't know that at the \"The Departed\" premier\ndid anyone from the team mentioned that we are inspire from the movie\n\"Mou gaan duo (2002)\" &amp; we are making a Hollywood movie on the same\nstory line. Me also a big fan of \"Martin Scorsese\" but after this i\nthink i'm not. Brothers go &amp; see the mentioned movie \"Mou gaan dou\n(2002)\" &amp; u will know the secret of \"Martin Scorsese's Masterpiece\"\n"},
{"review": "\nIt's a good remake of a better film to my eyes Scorsese shot the same\nmovies with exact scenes, adding lot of others which don't serve his\nmovies... Infernal affairs from Wai-keung Lau &amp; Alan Mak is better &amp;\nshorter to me. Lots of scenes and details looks to me really strange,\nnow i've seen the original movie and i just understand that Scorsese\njust shot a copy, this way, these strange details and strange scenes\nhave a sense to me now... cause they are part of the original and still\ndon't have no sense in Scorsese version. This movie looks good but now\ni have seen the brilliant original it has no taste anymore <br><br>http://www.imdb.com/title/tt0338564/\n"},
{"review": "\nThis is probably different from other Martin Scorsese's movies but it's\ntruly enjoyable. Cast is excellent and each one of \"the splendid actors\ngives his best. Dialogues are strong and believable, soundtrack's\nreally great and suitable; as far as I can see there's no moment when\nrhythm is not steady or story lacks of focus. Furthermore it handles\nsubjects like power and loyalty in a way reminding Mathy's masterpiece\n\"Good Fellas\". We could say, to sum up, that Scorsese is back with his\nhumor, his class A actors (Jack Nicholson is huge) and his creating\nShakespearean atmospheres. \"The Departed\" is purely entertaining and\ngritty and its action is enjoyable 100%.\n"},
{"review": "\nHas there ever been a film with a better cast than this? I can't think\nof one. Comment if you can. The acting in this is amazing and every\nactor did their job. I think this is Leonardo's best performance. He\ndid it so well and it was actually like he was the character and not\nactually performing. The music is awesome. Especially Shipping Up to\nBoston which is done by one of my all-time favourite bands\n@dropkickmurphys. The song was the perfect choice for the film and they\nplayed it at just the right times. The plot is ingenious and Scorsese\ndirected it superbly. This film even managed to be better than Infernal\nAffairs, which is what this film was based upon. I love the opening\nscene with Jack Nicholson's monologue and it really set the film for\nwhat was to come. The film also had it funny moments (thanks to Mark\nWalberg). This film is extremely entertaining and I love the\ncharacters. There is nothing to complain about in this film and I could\nand probably will watch this over and over again. One of the best this\ncentury. I was actually sad when this film was finishing because I\ndidn't want it to end. Acting: 10/10 Dialogue: 10/10 Plot: 10/10\nCharacters: 10/10 Entertainment Value: 10/10\n"},
{"review": "\nThat was pretty good for the genre it falls in. Self Made South Boston\nIrish Mafia life in the hood epic. In a way, she climbed over so many\nother DVDs that have been published. It takes an honest look at the\nactivities and is blunt, what the characters are doing and why they do\nit. So many others are trying to turn in their illegal activities Thie\ngenre into a virtue and not unhappy. These types include the fact that\nwhat they are doing is illegal, and that they are evil and are the\nconsequence of their decisions. However, the dialogue could be tweeked\nto be better in some parts. Compared to some of the others I've seen,\nthis is a breath of fresh air in her delivery and thought.<br><br>I usually do not always bring race into a review, but does let's be\nreal, it is a factor in the films we sometimes enjoy. So, if you is not\nused to be around people like this, not like in a relationship like\nthis, you will understand how it enough to enjoy this film? Instead, it\nwill be repelled, to judge, snobbish, and claim that this film is a\nfailure. That is your opinion. But, I know people like this have I in a\nrelationship like this, and I love this movie. This film is awesome,\nVera Farmiga is nice and honest, I think, to every young woman in the\nhood as she felt that even with minimal Matt Damon's lol ... We laughed\nbecause we went through or know someone who has. This is a good movie\nif you can relate it in any way. If not, well, I do not know whether\nyou should bother.\n"},
{"review": "\nIf there was any doubt about Martin Scorsese's craft as a film\ndirector, The Departed silences any critic of his. However, if there\nwas any doubt in the first place I highly suggest quitting movies.\nScorsese delivers an epic in a time where movies are being churned out\nwith no emotion, no connection to the viewer, and reliance on gimmicks\nso the studios can earn a little dough and taking the prized honor of\nbeing the number 1 listed movie on a 12 year old kid's myspace page.<br><br>The Departed delivers in every facet. The cinematography is well\ncrafted - the camera positions to grasp the scene in its fullest while\navoiding being generic and also straying away from overly \"artsy\"\ncamera angles that make the film unwatchable. In fact, The Departed is\nprobably Scorsese's most rewatchable film. There are more twists than a\nChubby Checker concert which will make you both gasp and let out sighs\nof relief.<br><br>The characters are believable and engaging. Jack Nicholson plays one\nthe most accessible of all the mob villains of Scorsese's past. He is\ncomplete slime, but his demeanor is that of an uncle who permits you to\nwatch the TV shows that your parents told you not to. Matt Damon as\nColin is like one of those pompous pricks who cheat repeatedly and get\naway with it, and Leo as Billy Costigan grows on the viewer and as a\ncharacter through his dangerous line of work as a police informant.<br><br>The Departed is an American masterpiece.\n"},
{"review": "\n\"The Departed\" is right up there. I can't think of any other movie\nbesides \"Pulp Fiction\" that had me glued to the screen like \"The\nDeparted\". It has a great plot with fantastic acting. If you can get\nover Leonardo Dicaprio playing his type of role then you will at least\nlike the movie a little bit. I know its hard to imagine him doing this\ntype of role, but he really has evolved as an actor over the years. GO\nSEE THIS MOVIE. I'm not one of those guys that is going to get all\ntechnical. But this movie is real with real conflicts(especially\nDicaprio). Marky Mark, Nicholson, Damon, Sheen, even Alec Baldwin\nplayed their parts well. Simply one of the best.\n"},
{"review": "\nI only went to see this movie because I am doing a project in school\nabout Martin Scorsese. I did not really think that I was going to like\nit but it was so great!! Martin has a way with doing things in his\nmovies that make them so much different than any movie that I have\nseen. Leo Decaprio really shines in this movie as does Matt Damon.\nActually the cast was a total \"A\" cast. Mark Walburg will keep you\nlaughing every time he is on the screen. This movie has a lot of\ncussing so I don't think that kids should see it but I would recommend\nit to anyone else! I promise that you will not be disappointed in this\nmovie. Oh and it is pretty long but it is full of action the entire\ntime!\n"},
{"review": "\nAbsolutely awesome. I have had a hard time justifying going to spend\nthe money on any of the garbage that has been coming out of Hollywood\nlately. But I made a serious point to go see this, something fresh from\non old familiar face, or wait two, maybe three, or four, depends how\nold you are. One thing I think makes a great director is the use of\ninanimate objects as characters. If you haven't seen this film, watch\nthe Boston State Capitol building appearances. It says more with no\nduologue than some entire scripts do. Some songs are used with more\nvisual themes than others, but the audio counterpart to the eye-popping\ncandy is so intense I just couldn't wait for the next scene to unfold.\nAnd as for Jack well, very very good, best I've seen him in full tilt\nsince the shining. Many people are saying this is Tarantino Based. I am\nalmost thirty, I remember pre-Tarantino. Well pop Tarantino that is,\npre Pulp Fiction who knew about his hits, only a few in early years of\nhigh school had even watched reservoir dogs. What happened to him is\nhe's gone Hollywood, who else would take such interest in splitting a\nfeature like kill bill into 2 parts, oh yeah ticket sales, revenues, I\nsay CUT IT! The departed said what it wanted to say, THE RAT GETS THE\nCHEESE! America today needs more films like this that don't have a\nhappy ending, and expose the dirtier side of \"God's Country\". Had me\nfrom the first scene.\n"}
]