[
{"review": "\nThe film is not bad based on its technical merits. The lighting,\neffects, and acting are all fine and actually Johansson is fabulous in\nthe first part of the film. <br><br>What makes this movie so terrible is that it's attempting to make a\nsophisticated statement, but it can't even keep its own logic straight.\nThere is no conflict; Lucy is so powerful and devoid of empathy that\nthe film devolves into total nihilism. She just gun battles and goes on\ncar chases because she has only 24 hours to download her brain for the\nsake of... who knows? Humanity? So let's rush, because without that all\nis lost for... humanity? But Lucy doesn't give an f* about anyone else.<br><br>What does a person beyond human logic act like? Since that's\nimpossible, I don't know, and apparently the director doesn't either.\nWhy does using more of her brain make her lose all capacity for empathy\nor social logic? Don't know. <br><br>It feels like the whole thing is just for the sake of itself. Her\npowers and their progression are just not believable. Scene after scene\nof gun violence without any moral lesson or conflict gets very boring.<br><br>This movie could have made some sort of intelligent comment on human\nmorality, the origins and purpose of empathy.... nope, instead it makes\nthe comment that gun battles are cool.\n"},
{"review": "\nIf you're expecting a character driven storyline or you're someone that\nis unable to suspend disbelief for a couple of hours then this movie\nprobably won't be for you.<br><br>The storyline is nothing new and has been explored quite a few times,\nit's basically the concept of are we more or can we be more than what\nwe are.<br><br>Whilst they used an idea about the brain that has long since been\nproved nothing more than a myth it works to drive the concept of the\nfilm. I do think with a little thought they could of made this a little\nbit more believable though if they had just focused on being able to\nuse more of the brains potential rather than \"capacity\".<br><br>Anyway apart from the basic concept that we still do not really\nunderstand our brains and what they are capable of everything else in\nthe movie is based a lot in the realm of fantasy. There was a whole lot\nof things in the movie that could of been done better but even with all\nthose flaws I still found it entertaining.<br><br>The only thing that let the film down for me was the ending which even\nthough visually was probably the best part of the film it still felt a\nlittle too generic and overdone.<br><br>There seems to be a lot of reviews on here that bang on about realism\nand it being unbelievable etc but if you are going to rate a film on\nthat then recent films like Transformers and all the super hero movies\nshould be rated a 1 because hey a school student getting bitten by a\nradioactive spider or super sized robots trying to overtake earth is\nfar more believable...<br><br>This film is a fantasy sci-fi with great visuals and while not\n\"realistic\" or perfectly executed has a thought provoking concept.\n"},
{"review": "\nDisappointing movie towards the end. Starts off well, everything makes\nsense, everything is clever, logical and interesting. After a certain\npoint in the movie everything becomes ridiculous, unrealistic and not\nenjoyable to watch. The idea behind the movie was good, execution was\nnot. The characters were also a little bit boring in my opinion. The\nsituation the main character found herself in had an array of\nextraordinary things to do and take advantage of but didn't. Not a lot\nout of the ordinary happened, main character worrying throughout and\nnot taking advantage/playing around with the situation she was in. If\nyou're a fan of logical \"what ifs\" like myself I would not recommend\nit.\n"},
{"review": "\nObviously the main purpose of Luc Besson with this was initially to\nplease the audience. The poor scared girl who takes revenge on the bad\nguys that hurt her. But with the ridiculous premise \"what can we do if\nwe acquire the 100% of functionality of our brain\" the movie tries to\nbe philosophical and ...fails miserably. What is the meaning of life?\nThe purpose of humans?<br><br>The problem is that Luc Besson's brain isn't capable to provide such\nanswers.<br><br>When Lucy's brain is at 20% she's starting to control ...tv signals!\nIt's obvious that the writer will hit a wall by his own brain\nlimitations. At 30-40% she has telepathic and telekinetic powers. Later\nshe travels back in...time, and the way she controls it is with...swipe\nmove as in a smartphone! What else is there? The writer couldn't think\nof anything else! <br><br>I am everywhere! It's now a cliché since Edgar in \"electric dreams\".\nJohnny Depp has done it too! Well good for you.\n"},
{"review": "\nI think bad reviews come mostly from people who want to show other how\ngood their science is. Fair enough, this film starts from the premise\nthat humans only use 10% of their brains and Lucy can break this\nbarrier and reach a whole new level in human evolution. This leitmotiv\nwas quite smartly picked to raise interest,although scientifically\ninaccurate. However this film excites the mind of those who REALLY know\nphysics and know how few limits there are in what we can achieve in\npushing our evolution through science to become indistinguishable from\nmagic. \"Any sufficiently advanced technology is indistinguishable from\nmagic.\" I personally enjoyed every bit of the movie and, as it took me\nto a journey into the far far future, where humans can overcome their\nhumanity and become real Gods.<br><br>Enjoy this film and let your mind explore the impossible.\n"},
{"review": "\nCheck the genre of this movie, it says SCI-FI, which stands for science\nFICTION!! If I watched every sci-fi movie expecting it to correlate\nwith real life physics then there would be no point of the genre. All\nthese bad reviewers seem to be on the more intelligent end of the pole\nbut isn't cognitive enough to realize they're NOT watching a\ndocumentary!!!! This is a good sci-fi movie, which kind of lets you\nimagine what you could do if you knew everything and could do anything.\nObviously It's not possible because you would have to break the laws of\nphysics to even get near that point but it's still good to wonder.\nWorth a watch if you like the genre.\n"},
{"review": "\nThis movie is terrible, plain and simple. It starts out as a fun action\nmovie set in Taiwan. Scarjo is in some really cool scenes and is acting\namazingly. This is cut with shots of Morgan Freeman having a stroke and\nblabbering one-liners about life that wouldn't impress Jaden Smith.<br><br>Morgan Freeman was completely useless in this movie. Lucy knows\neverything anyway and his explanation to the viewer will hurt your\nsoul. It doesn't matter that the whole premise is impossible but STOP\nRUBBING IT IN MY FACE. The fact that hes presenting his ideas to a room\nfull of students and professors only ads insult to injury. No one asks\na simple why. Why does he think humans get psychic powers at 30%.\nTelekinesis? Why is he even doing \"research\" on some weird\nhypothetical. This movie is literally better if you cut out every\nMorgan scene. <br><br>This movie is way too pretentious for the few good action scenes it\nhas. If you insist on watching just watch the first 40 minutes or\nsomething. Its not worth it.\n"},
{"review": "\nLuc Besson, you really let me down!<br><br>I've been a huge fan of his past films. Leon, Fifth Element, Nikita,\nUnleashed, Taken, etc etc etc<br><br>The trailer to the film made it look like standard epic Luc Besson\nfilm. However it seems he clearly failed his basic science education at\nschool.<br><br>There so so much wrong with the science in the film, and I'm no\nscientist! I enjoy reading about science and have retained much of my\nscience education from school and right from the start when it was\nmentioned \"what if you could use more than 10% of your brain?\" .. I\nassumed that would get corrected a few moments later... not be the\npremise and explanation for all of Lucy's abilities.<br><br>Luc Besson seems to think having higher brain functionality allow you\nto time travel?<br><br>To be clear. The whole \"10% of your brain\" argument has been refuted\nmany times and is decades old. 12 years ago when I was at school we\nwere taught how this statement was total BS. Seems Luc Besson didn't\nget the memo and no one thought to tell him before he started the film.<br><br>None of the characters have any depth either. Morgan Freeman is...\nMorgan Freeman, standard 'I speak slowly and deeply which means\nanything I say appears profound'. Scarlet Johansons does nothing to\nmake anyone connect with her character.<br><br>The drug they are transporting at it's current state would be legal...\nSo why did they went to the effort of kidnapping I have no idea. Fedex\nwould of been much cheaper.<br><br>This film is NOT for: People with basic science education People with\ncommon sense\n"},
{"review": "\nF*** this IMDb rating. I haven't been this entertained in 90 minutes\nsince Pan's Labyrinth. Dawn of the Planet of the Apes gets 8 stars, and\neveryone is attacking the science of this film... f*** off. This movie\nis fantastically cool.<br><br>Remember, critics and joes thought Boondock Saints, Donnie Darko, and\nStar Wars blew... yeah. Watch it for yourself. If you're a Luc Besson\nfan, you won't be disappointed.<br><br>Bad-*** car chase, science-fiction, sex appeal my goodness, Morgan \"the\nman\" Freeman, Chow Yun-Fat worthy shootout, visuals that will blow\nyour-effing-mind, and it didn't even take 2 sequels and a prequel to do\nit. <br><br>What happened to people that used to enjoy movies?\n"},
{"review": "\nNormally I don't write reviews but these movie differed so much from\nwhat people told me I fell compelled to give my opinion. Because of the\nbad reviews I didn't expect anything at all. In fact, I expected a\nkiller heroine who would beat her adversaries to pulp. However, I got\nan extremely interesting, unusual and highly entertaining story, that I\nfound quite fascinating. Of course, it's completely unrealistically,\nbut the whole idea is quite funny and unusual. I generally like movies\nwhich manage to introduce new ideas or differ from the same old boring\npatterns (Iron Man 12, Final Destination 14, Transformers 8). Lucy does\nthat. Its just, well, cool. I absolutely enjoyed the Science Fiction\naspects and seeing Lucy developing her powers was just pure gold. So if\nyou don't break into tears because the movie operates on ridiculous\nscientific premises, watch it and have fun. It's different, it's\ninteresting and its extremely entertaining.\n"},
{"review": "\nLucy is a spectacularly ridiculous but very entertaining film which is\nthe best one Luc Besson has directed in a long time... even though,\nconsidering all the missteps he has had since he returned from\n\"retirement\" 9 years ago, that isn't a big compliment. For better or\nfor worse, Lucy employs Besson's habitual style, combining abundant\naction, a creative visual style and an accelerated rhythm which, in\nthis case, distract us from the parade of nonsense and inconsistencies\nfrom the screenplay (Hasn't the \"we only use 10% of our brain\" myth\nalready been discarded?). Fortunately, this film counts with solid\nperformances from the whole cast, starting by Scarlett Johansson, who\nbrings charisma and credibility. Morgan Freeman brings his usual\nconviction, serene presence and persuasive voice, while Choi Min-sik\nand Nicolas Phongpheth bring quite a personality to their villain\nroles. Besides, with only 89 minutes of running time, Lucy ends as\nquickly as it began, it never gets boring at all and it leaves us with\nsome philosophical reflections I found interesting. Lucy is not a great\nfilm, but it entertained me very much, and I recommend it as a pleasant\ndistraction which doesn't require us to pay too much attention. And\nbesides of that, I like to see Besson back on the right track in his\ncareer as a director.\n"},
{"review": "\nStupid. The antithesis of what the movie purports. The final line \"Life\nwas given to us . . . now you know what to do with it.\" Yeah. Don't\nwaste your time on this spew. Remember Altered States and all the\nphilosophical claptrap they put forth as plot and dialog? This is\nworse. First the premise that we only 10% of our brains is BS. We use\nit all. The 10% is nonsense that you can debunk on Snopes. Understand\nthat the writers didn't even go there for their information and didn't\neven bother to read Wikipedia on this concept and you now know how weak\nthis is. Steer clear, folks. Nothing, and I mean NOTHING to see here.\nEven the special effects are bad, low grade CG. Morgan, you've fallen a\nlooong way since Shawshank.\n"},
{"review": "\nIt amazes me how many negative reviews this movie has gotten when its\ncore, its message, is so giant.<br><br>I love this movie. Then again, I'm thinking of it in conjunction with\nThe Secret, the book Conversations With God, and my own crazy\nexperiences.<br><br>God = a giant being who was, is, and ever shall be, trying to become\nconscious of Himself.<br><br>Humans = each tiny piece God broke off of Himself to create our\nindividual selves.<br><br>Lucy = one piece of God (think = SOUL) that happened to have an\nopportunity to become conscious of itself.<br><br>The end is Lucy breaking apart into billions of pieces because the\nphysical no longer mattered. It was her essence... which is why she was\nable to be everywhere, like God.<br><br>I can't believe no one gets this. Look into quantum physics, even just\nwatch The Secret. All we are is energy. If we take this concept to the\nextreme and to fiction, Lucy is what we get!<br><br>I LOVE this movie. BTW.<br><br>Then again I think deeply and on a big picture basis, so hopefully all\nthese negative reviewers read this and feel like morons... because they\nare.<br><br>It's not meant to \"just\" be a movie. You really think Morgan Freeman\nwould've signed up for this if it didn't have some deeper meaning? Look\nat his track record!!! Come on, people, use that gray mass between your\nears!!!<br><br>Just saying. I love this movie. From a non-science, non-pop culture\nperspective. I love this movie from a transcendent perspective. The\nkind of POV that allows you to believe that nothing is a coincidence.<br><br>=)\n"},
{"review": "\nI am a sci-fiction lover and especially if it talks about human brain\ncapabilities. Movie will make you to stick to your seat till the last\nscene. Title is rightly chosen.<br><br>Building of a story is as usual(much similar to one of the BRADLEY\nCOOPER movie) which shows the effects of a human brain if it reaches\nfrom 10 to 100% capacity. Moreover the movie lacks on the details but\njust gives you a basic idea. <br><br>Some scenes will really question your mind and provoke you to think\nover it. On the scale of acting both lead actors were good and had\nproduced their best. And some actors are in futile role with no sense.<br><br>Though the film has used some fake data and hypothesis to impress upon\nthe audience, you will be entertained and learned. Ending of the movie\nwas fair enough in support of the story which gives her a immortality.\nMovie is more than a one time watch...\n"},
{"review": "\nAlthough a lot of the things shown are completely fallacies, it has so\nmany things that are proved and are scientifically correct. Like,\npersonally, I didn't know that substance (CPH4) and I have curiosity to\nknow how it works, and as a nursing student I have interest about what\nthe doctor said of the mother in pregnancy segregating it to her baby.\nI mean, there's a lot of things in this movie you can learn about, and\nmuch more that don't. But, that's OK, I enjoyed the 90% of the movie\nand my imagination was literally blown up, since that guy made the\nquestion to the professor: \"What would happen if someone access to the\n100% of the brain?\"<br><br>And no need to tell it. Scarlett looked damn sexy all the movie long.\nThank you for reading.\n"},
{"review": "\nHere's another real odd ball that I watched this past week. It stars\nScarlett Johansen and that is of course all I needed to wanna watch\nthis movie. Lucy is about this women who is kidnapped by this group of\nthugs and then gets a powerful drug put inside her that unlocks the\nfull 100% of her brain and now she's super smart and seems to have the\npowers of Jedi. <br><br>This movie is just really weird and not quite what I was expecting.\nThis is of course an action film. It's got all clichés that were use\nto. Then becomes a super hero movie and then a beautiful visual ride.\nIt's really confusing a bit at times and it gets worse in the end. The\nissue I have with Lucy is that she's the only super powered person in\nthis film and there's no one in this that ever becomes powerful enough\nto give a really cool final final fight in the end, but a weird and\nvisual like dream of a world kinda ending. It's not great and I highly\ndoubt someone would become super hero or a jedi if we used 100% percent\nof our brain. It's entertaining if you don't look much into it and it's\ngot Scarlett Johansen as a sexy bad ass chick with guns and Morgan\nFreeman Teaching science\n"},
{"review": "\nWe watched LUCY about on DVD February this year. I usually don't like\nthe typical shoot- them-up or speculative-futuristic or robotic movies,\nthey turn me off because they are predictable and way over the deep-end\nof ridiculousness in their violence, special effects, contradictions\nand same-old-same-old tin spaceships, weaponry galore, and silly story;\nlike the script and story were just thrown together for the sake of\nselling something at the box office or TV. LUCY, is excellent, credible\nbeyond the usual mush and the action and actors are great. If you like\na good story that will touch your heart, make you cheer and hope, take\nyou to possible scenarios and just enough chaos to make it interesting,\ngood actors and a great story, then you most like will like LUCY. My\nhusband and I often have different likes and opinions but our\ndifferences came together in appreciation of LUCY.\n"},
{"review": "\n... it is a love story. About a director so in love with himself, and\nso powerful in his profession, that he can take any half-baked idea, an\nidea no ordinary director/producer could ever hope to finance in their\nlifetime, and not only turn it into a major international feature but\nland one of the hottest actresses of the era to star.<br><br>As a sci-fi thriller, this film succeeds .... not so much.<br><br>As a love story .. it is pretty unique. You would have to go back to\nALTERED STATES (1980) to watch Ken Russell fall in love with himself\n(just the way Besson does in this film) to find an analogue.<br><br>Once you get past the first 45 minutes (a sad comment, given the film\nonly runs 90 minutes), past the pompous and overblown backstory and\nstill montage, the film more or less holds together as B level\nentertainment.<br><br>Not exactly high praise. But there is always Scarlett Johansson...\n"},
{"review": "\nI love Luc Besson - Nikita, Leon, Fifth Element, Arthur and the\nMinimoys, The Big Blue. But this ... this is a mess.<br><br>It's sci-fi fantasy, with a loose grasp on continuity and reasoning.\nLot's of action and special effects with an unnecessary amount of\npublic domain footage thrown in to pad the movie out.<br><br>It has a couple of good fight scenes, an obligatory car chase ... that\nmakes not much sense given her powers ... and about 15 minutes of\ngenuine storyline.<br><br>Hopefully the fan editors will pick this up, cut out all the filler,\nand turn this into the tight little 30 min sci-fi action short movie\nthat this really is.<br><br>For those that cry \"But what about the philosophy? What about the\nquestions of human potential?\", the greatest danger that this movie\npresents is that people may believe the fairytale that humans only use\n10% of their brain and that we have a magical 90% lying dormant ready\nto awaken for inner godhood. The reality is that 100% of your brain is\noperating, 100% of the time -\nhttp://en.wikipedia.org/wiki/Ten_percent_of_brain_myth<br><br>Luc Besson can do so much better. I hope this is not his last gasp.\n"},
{"review": "\nLucy finds herself caught up in a drug smuggling operation and ends up\ndigesting a large amount of the drug, which allows her to use increased\nlevels of brain capacity. The level slowly increases throughout the\nfilm, with Lucy getting more hardcore as it goes on. I was a bit unsure\nof what Lucy was trying to do, but it seemed first trying to collect\nthe rest of the drug from the other smugglers,then find Morgan Freeman.\nShe doesn't seem to care who she hurts on the way, happily causing\nunnecessary car accidents, hurting people in the way. Oh whilst gaining\nbrain capacity, Lucy's human emotions (e.g empathy!) reduces (which\ndidn't make sense to me!). <br><br>I have seen some negative reviews because it isn't scientifically\naccurate. When watching you need to remember it's not a documentary,\nits fiction. There are bits that are hard to believe, but I think if\nyou watch this knowing it isn't true and maybe a bit ridiculous, you\nwill enjoy it. <br><br>Yes, it is a bit unrealistic and not all the acting is up to scratch (I\nliked Scarlett Johansson's Lucy though), but I found it fun and easy to\nwatch with a nice bit of action thrown in there.\n"},
{"review": "\n\"Lucy\" is nothing at all like I'd expected - that is, your usual Luc\nBesson schlock. But he is seriously tripping balls with this one. All\nbecause of a drug o.d., Scarlett Johansson begins to open her mind far\nbeyond our known capacity; which means she's just full-on superhero.\nAnd the first half of this is a tightly-paced bundle of energy. IT is\npure comic book and a lot of fun. I'm actually surprised it isn't\nJapanese (\"Ghost in the Shell\" and \"Akira\" jump to mind).<br><br>The second half is where it loses step, explaining the nutballs plot\nand trying to make a statement on man's power list. Scarlett\nmanipulates space and time like Neo and it loses its winning\npersonality. For me, this movie boils right down to its lead. She is\nperfect; and I wonder how good this would've turned out with a lesser\nactor. Casting makes up for an awful lot in the writing department\nhere.<br><br>7/10\n"},
{"review": "\nLucy (Scarlett Johansson) starts out as a young nobody who, through no\nfault of her own, gets caught up with a Korean drug gang. The drug lord\ndecides to use her as a drug mule, and has a plastic packet full of\nCPH4 embedded under her stomach. Through recklessness by her drug\nhandlers, the packet rips, leaking the CPH4 into her. The CPH4\ngradually opens her brain, and she gains knowledge far beyond any\nhuman. She is able to see and do fascinating things, but she also\ngradually loses what makes her human. She has no interest in striking\nback at the drug gang, as her intelligence has progressed beyond this\nworld. Lucy calls her mother, but her basic message was: \"I love you\nmom, but I'm going someplace that you couldn't possibly understand, and\nI can't come back. Goodbye.\" <br><br>Lucy consults Brain Theory expert Professor Norman (Morgan Freeman) on\nwhat she should do with all of her knowledge. He suggested that she\npass on her knowledge to others, although he was also wondering if\nmankind could handle such knowledge. The drug lord, of course, is\ndetermined to kill her. <br><br>By the time Lucy reaches 100% of brain capacity, she ceases to exist as\na physical being. <br><br>Lucy starts off as a pretty good story, but there are a couple of flaws\nlater on. The big car chase scene, involving multiple car crashes, was\npointless. Lucy could have just used her brain to make the other cars\nstop, and mentally just pushed them aside. Same thing for the big\nshootout scene at the end. Lucy could have just made all the bad guys\ncollapse. Those scenes were just put in as action filler, but they kind\nof subtracted from the story.\n"},
{"review": "\nReading reviews seems to a risky matter: some reviewers are snobs and\ntry to be hypercritical, while others run the gamut. I approach movies\njust seeking to be entertained for awhile, and this movie did that. In\nfact, I liked it and as my above summary says, I will most likely watch\nthis movie again. As many reviewers have critically mentioned, the\nstory line is improbable, but so are the Star Wars movies. This movie\ndoesn't have the overuse of raw language or grab-you-in-the-ass\naction/gore/sex/fill in the blank which some people seem to expect from\nevery movie. I don't watch every movie waiting for the special effects.\nFor me, it was just a story that had enough going to keep me\ninterested. I do enjoy movies with character development and this movie\ndoesn't have much of that, but given what is happening with the main\ncharacter, she's not left with much personality. I think that it would\nbe easy to approach this movie with expectations that might not be met;\nif you take that approach,you may not find what you were looking for\nwith this one. Besides, it has Morgan Freeman and sometimes that's just\nenough.\n"},
{"review": "\nOnly 8 out of 10 because the author/screenwriter made too many\nassumptions about the audience. With over 900 reviews posted I don't\nknow if anyone has touched on my point or not. So here goes. Many of\nthe references will only be caught by sci-fi fans over the age of 30\nwho also paid strict attention while in high school or college. That's\nnot a jab at anyone's intelligence. There are simply not many people\nwho find quantum theory exciting. The movie attempts to give a\nvisualization to this not-so-well understood school of thought.\nCombining fiction along with real science is not easy to do while\nkeeping it entertaining at the same time. An example reference is with\nthe oversized USB flash drive shown at the end. Did anyone else notice\nit was \"full of stars\"? Not glitter...stars. Yep, that's a 2001/2010 A\nSpace Odyssey monolith reference. The shape of the drive along with the\nstars was a dead giveaway. Whenever a monolith appears in 2001 it is\nalways followed by a major evolutionary jump. What was Lucy\nexperiencing? An evolution of consciousness. What was Lucy seeing\nduring her armchair travel through time? If you also said \"evolution\"\nthen you are correct. She saw the evolution of life on earth as well as\nthe evolution of time and the entire universe itself. Lucy went a step\nfurther than 2001/10 in that it shows the interconnections with ALL\nthings at the quantum level and beyond. This is just one of the\nreferences in the movie that kept me entertained throughout. The main\nproblem with these kinds of references is that they usually don't\ntranslate very well when shown on the screen. Deeper explanations also\ntend to bore the heck out of an audience so they wind up on the cutting\nroom floor. Again, it's not an audience intelligence issue. It's an\naudience familiarity issue. Assuming that the audience is as excited\nand as deeply interested in the same heavy topics as is the writer will\nusually make for bad ratings and a \"meh\" movie.\n"},
{"review": "\nI personally found this movie to be quite fascinating. It was nothing\nlike I was expecting but it certainly was interesting. It has a heavy\nphilosophical focus and isn't your typical action thriller. It was\nactually rather odd in places and I couldn't pinpoint the exact genre\nthey had in mind for this film. That didn't really bother me as it\nseemed to work but the transition could have been smoother.<br><br>It was quite an emotionless film led by Scarlett Johansson but I did\nenjoy Morgan Freeman's role...as always. I liked the movie but I can\nsee how others didn't. I'm sure there are many scientific inaccuracies\nbut that's the point. It's a movie you can only imagine in your wildest\ndreams. The outlandishness of it all may be hard to fathom by some but\ndo we really know what we think we know. I can truly say I don't but\nit's nice to see the possibilities.\n"},
{"review": "\nthis is an exposed of the system we living in this is no movie this is\nreal or so call t the truth so thanks for letting us waking up let it\nall fade away the soul blinded system we living in this is how we all\nneed to be my vote for this movie is a 10/10. this is a movie like buy\nbefore you try thing so we getting stronger in the end truth bless us\nall ones you see it free your mind free your life free your way free\nyour message to the living being's stand up for the don't stand up is\nlike a reborn wit no more pain in all of us but anyway don't let fear\ntake you over just be happy wake up watching greetings -znAKe - Solo\nMinded Productions\n"},
{"review": "\nA Must see for the Intelligent Movie watcher who enjoys Science Fiction\nAction, &amp; Thought Provoking throughout. Morgan Freeman's part is\nperfect with the new twist I have not seen where the story moves back\nand forth from his Academic Speech on the Human Brain's usage based on\nthose of other living things to Start. I can believe that this movie\nwas given a 6+ rating, as the \"Dumbing Down\" of American Society is at\nit's peak and Movies like this are just not comprehensible to most, as\nthe Star Trek original TV series wasn't to the Audience back when it\naired on TV, with many of it's futuristic idea's (thought as completely\nfar-fetched) are in use today. If we do do not shift from our paradigm\nof thought, we will stop moving forward as a Society. Right up there\nwith the movie \"Interstellar\" in my opinion &amp; could watch over &amp; over,\nwhich I cannot do with very many film's. Enjoy this movie, then watch\nit again to understand what you missed, as it moves very quickly along.\nCongrats to the Writer, Producer,Director and the Actors! Brilliant!!!!\n"},
{"review": "\nI suppose if one really goes along with the film's premise, then any\ncriticism by us mere mortals with cognitive capacities of 10% would\nseem irrelevant. How could we possibly understand what it would be like\nusing 100% of brain capacity?<br><br>That is the film's strength. Go along for the ride and see what happens\nin the film-maker's imagination. If one is prepared to suspend\njudgement and do this, then the film is intriguing.<br><br>This film is as much a test of the viewer's preconceptions about using\n100% brain capacity, as it is about the actual events in the film. For\nexample, what moral changes occur in Lucy, and how does this relate to\nher sensory awareness of the personalities of the people she kills? The\nmoral changes are implicit, and unexplored, but evident from her\nbehaviour. If she's not a psychopath, then what moral plane is she on?<br><br>The film is intriguing on many levels, but especially this one. It's a\nfirst class sci-fi effort from Luc Besson which I found intriguing and\nentertaining.\n"},
{"review": "\nI was very surprised to see such a low rating for this movie. It is a\nnew concept inside a world of remakes and prequels. Not only that but\nit was done well, clear and thought enough for you to atlas entertain\nthe idea that \"what if this were true\"<br><br>The drug concept was a very good twist on some movies that would have\nUsed no creativity and just had a person born that could use 100% of\ntheir brain.<br><br>I truly have no complaints about this movie but it takes a lot to give\nmy movies a 10 and so I rare it a solid 9. It's a must watch film even\nif you only watch it once. Also it's a different role for Scarlett\nJohansson but she handles it well.\n"},
{"review": "\nI finally saw this movie on TV and I liked it. it gives meaning to\n\"what if\". We do not know what will happen if we do use all of our\nbrains because some people may use more and others less. Maybe that is\nthe difference between scientists who invent something or theorize and\nuse trial/error and the common blue/ white collar. why do some people\nhave higher IQs than others? Besides the movie being entertaining, I\ndid like the fact she can multi-task. Would we be able to do the same?\nBe here, there and everywhere at once.Maybe all would be geniuses,\nlooking or reading something and move something with a hand flick at\nthe same time while knowing A gun is pointed at you from behind. She is\neverywhere.\n"},
{"review": "\nOK, so I like Scarlett Johansson. This has not always been true - I\nthought Lost In Translation was disappointing given the hype, and Girl\nWith A Pearl Earring was dreary. This however was literally\nmind-blowing, and basically if you didn't get it, then unlucky, because\nyou really missed out.<br><br>Ms Johansson has the wonderful ability to act both vacuously dumb and\nsuper intelligent with a penetrating, unemotional stare. The plot was a\nvery interesting idea that gave new scope to her capabilities. There\nwas a clear end to the movie (don't like those that end up vague) - we\nall wanted to see what would happen when she reached 100%, and frankly\nany woman that can effortlessly overcome so many men is very enjoyable\nto watch. When you were watching it, didn't you think 'Gosh, I wish I\ncould do that?' - I certainly did.<br><br>And wouldn't you just love to know what was on that USB stick? What did\nshe see that we will never see? Of course, the film cannot tell you as\nno one knows, which is part of the magic. But it makes you think,\ndunnit?\n"},
{"review": "\nAlmost all reviewers complained about it not being real or accurate,\nbut hey! this is cinema, we've created this to escape reality , maybe\nto enhance it, we suppose to treat \"Lucy\" as a work of art, not a\nprojection of reality, the movie was an excellent masterpiece in terms\nof acting,story line,equipment ..etc, a well made movie, all the hate\nis unnecessary, it human reaction of anger toward his true nature, Lucy\nproved to us how incapable and weak we are by showing the opposite we\nseek unconsciously, let go already ! existence was there long before\nhumans even existed, intelligence isn't originally ours, the movie was\na total amusement, entertaining, and most thrilling, as it suppose to\nbe, as a movie, it did its job, if you look for a better reality,\nyou're likely not gonna find it here.\n"},
{"review": "\nI liked the sci-fi aspects of this story but thought it got a little\ntoo 'matrixy' toward the end, especially with the flash backward\nthrough time that Lucy (Scarlett Johansson) experiences in the latter\npart of the film. I can understand why a lot of folks consider the ten\npercent myth to be factual; when I was a kid in grade school over a\nhalf century ago, I recall teachers telling us the same thing. Only\nback then the number was just five percent. I guess inflation has\nbrought the fallacy up a notch.<br><br>Actually if you think about it, some of the ten percent business has\nmerit if one considers that you can continually learn more and more\nthroughout a lifetime by reading and studying, thereby accumulating a\nlot more knowledge than you started out with. So in one's youth then,\nthe limitation is strictly based on the amount of time one has been\naround. That's why I thought the introduction of the time element -\n'Time is the only unit of measure' - was a compelling one.<br><br>As far as the story goes, some of it's logic falls apart at the finale\nas far as that gun battle between the authorities and the Korean\ngangsters. It was already established that Lucy could control the\nbehavior of others in earlier scenes, so there was no need for all that\ncarnage except to satisfy the gore and violence fans. And if she could\ndefy gravity during the initial hit of CPH4 in her system, why remain\ngrounded for the rest of the story?\n"},
{"review": "\nFrom the start, everything is happening in some kind of mess. There is\nbunch of things happening all of once. I get it. It's partly fiction.\npartly action, partly romance, partly science. So many things happening\nall of once. Sometimes it's okay to see such a movie, but would I watch\nit twice? No, thank you. Even the main character is perfect, but I\nreally don't dig the whole thing how all of us would become part of the\nphones if our brain starts using 100% of its capacity. Should you watch\nit? Sure, why not. But should you watch it if you're looking for some\nfun time? No. It will make you think too much and question every step\nof the movie.\n"},
{"review": "\nI didn't really know a lot about this movie but I had heard mostly bad\nthings about it.<br><br>I don't know what those people were talking about; I really liked it!<br><br>There is an awesome interwoven mix of story and use of real videos in\nthe beginning that doesn't compromise the flow of the movie.<br><br>Morgan Freeman is in it and really, that should be enough! I can listen\nto that man read the phonebook and remain entertained.<br><br>It's futuristic without overdoing it and has an interesting take on the\nfuture scientific prospects, prospects that I wouldn't be surprised\nthat they would be working on as we speak.<br><br>Scarlett Johansson is awesome in it, as is the rest of the cast. It has\na good story with some pretty decent special effects and awesome action\nscenes.<br><br>I probably will see it a couple more times and maybe even buy it when\nit's released. Definitely worth a watch.\n"},
{"review": "\nAs stated above, overall this film is pretty good, but there are a few\nproblems, mostly due to non creative screen writing. They all occur at\nthe beginning of the movie. The first is, how many people go to study\ncollege in Taiwan, seriously? Writers, you might as well have had Lucy\nstudying in North Korea or Antarctica or Mars. The other problem I have\nis what kind of woman would allow their \"boyfriend\" to handcuff them to\na suitcase with out beating the crap out of him with it, or at the very\nleast, reporting it to the police. Ah, now I get it, there must not be\nany police in Taiwan, that's why the writers choose the location.\nThanks writers for not making that clear.\n"},
{"review": "\nI turned this on expecting a Matrix or Desperado type juggernaut of\ndestruction and there is some of that. But, it also has a nice mix of\nstyles. Some Oliver Stone, some Kubrik, some Matrix, some Ultraviolet\nand a little Altered States tossed in for good measure.<br><br>Johannson is competent in a role that tosses emotional content out the\nwindow pretty early on. Morgan Freeman acts as both narrator to the\nbeginning and a character later on, a little like Shawshank Redemption.<br><br>The cinematography is very interesting and very vivid.<br><br>The only thing missing is characters the viewer actually cares about.\nLucy commits an outright murder early on, making her alignment very\nambiguous. She comes off as amoral and a little scary.<br><br>I'm definitely glad I saw this movie.\n"},
{"review": "\nWhat would happen if humans could use all of their brain? The idea\nwould be cell regeneration, control and otherwise being able to control\nthe actions of others; more far fetched realms include being able to\nsee energy in the universe as well as manipulate time itself. This\nmovie explores this very concept, although it isn't apparent right\naway. Instead, it starts out as any comedy with a playboy that feels he\nis going to one up his fate by throwing one of his friends, 'Lucy' into\nthe madness. Instead, he gets little screen time and Lucy becomes the\nstar. Not only is she forcefully given a type of chemical that involves\nusing all parts of her brain, but she willingly accepts the role once\neverything is said and done. It would be this simple if she didn't have\na syndicate of Chinese henchmen after her \u0096 there is lots of stuff\nwe've come to expect from 'The Matrix' going on in this movie, but I\nfeel it executes it much better.<br><br>The movie does not go into trying to pass itself off as believable \u0096 it\nis far fetched and even admits some of the stuff that is occurring is a\nhypothesis. However, one has to appreciate the special effects, how\nseeing different forms of the magnetic spectrum, and possibilities of\ncontrolling one's own body, come into play. The movie is not\npretentious in this regard, nor does it act arrogant and say 'yes, this\nis what will happen'. It was pure fluke that this character experiences\nwhat she does, and she uses it for the better of mankind with a twist\nthat isn't unexpected. I recommend this movie, but do not watch it for\nthe action, but more for the philosophy and exploration of abstract\nthat it is meant to represent.<br><br>Originally posted to Orion Age (http://www.orionphysics.com/? p=5132).\n"},
{"review": "\nUsually I discuss older titles, every so often they are long-forgotten\nmovies remembered only by me, or so I often felt (thanks to IMDb I now\nknow it's not quite as bad as that). Today I'm tackling Luc Besson's\n2014 opus LUCY, and I am going to kick off by saying that it is\nspectacular, do see it, you are in for a treat if you do, but as this\none is a new movie, I am also really going to blast it plot-wise.\nScarlett Johansson is to me what it is all about, so, as far as I'm\nconcerned, the first half of the movie was the riveting part. You could\nhave kept all the special effects for my sake. The poor little bunny in\nsuch terrible distress, Please Mr. Jang, if you can't get rid of the\nchain, you don't have to chop off my hand... To me, a normal ol'\nsuspense drama would have been much preferred. This bit about unlocking\nbrain potential with the help of a leaking bag of CPH4 sowed in your\nstomach is just too much, way too much, the much simpler crime thriller\nthat was thrown away in favor of this banal monstrosity really is a sad\nloss. Anyway, keep Scarlett wrapped in cotton wool, she is a national\ntreasure, still every bit as hot as in THE ISLAND, years and years\nlater, Hollywood living must really agree with her! She has a most\nbeautiful huggable-bunny face reflecting childlike innocence. <br><br>Memo to self: Unlock 100% brain power. Open up world of endless\npossibilities. Enter movie, right there at that bit where she begs him\nto not chop off her little hand. Kick Mr. Jang's awful old ass... :)\nI'm not kidding.<br><br>Special effects and lofty theme make this one for many a Ten, but do\nnote that Scarlett is an Eleven.\n"},
{"review": "\nLucy is one of those films that brings about furious reactions, it is\nafter all a science fiction type action thriller. They always divide\nfilm fans right from the off. It's a film that to all intents and\npurposes needs to be viewed just as a cinematic experience, as a piece\nof popcorn fodder that may try to be something more cerebral, but\nultimately is a daft - but hugely fun - piece of film.<br><br>Luc Besson writes and directs a film that sees Scarlett Johansson duped\ninto being a drug mule, with the transportation of drugs sewn into her\nabdomen. It's a new drug, boy is it a new drug, and when things go\nbelly up and the drugs are unleashed into Scarlett's system, she's a\nthreat - or hope - to mankind.<br><br>It can be, and has been, called pretentious et al, such is the science\nfactor, which is perfectly understandable, so any hope of tight science\nfiction musings will only end up in a crushing disappointment.\nUndeniably Besson and his backers thought they had something to say, to\nopen up the film watchers' minds to something deep and probable, to be\nrelevant and viable. But unlike the makers we the viewers didn't have\naccess to donepezil, so we sadly couldn't all turn into Bradley Cooper\nand be limitless in our viewing capabilities.<br><br>Personally, it's a rollicking fun film for two thirds, when it's about\nScarlett kicking butt, a revenge driven babe, it grips and shakes all\nthe genre compliant cinematic senses. The ending, the grand finale,\ninfuriated me, and by the looks of Morgan Freeman (coasting for easy\nmoney), he was also a little frustrated. But I had fun, yet on the flip\nside if anyone fronted me up and said they hated the film with a\npassion? Then I would understand and take them home to play with my\nchemistry set. 7/10\n"},
{"review": "\nLucy is not a bad movie if you don't consider it as a serious Sci-Fi\nmovie. Yes, Lucy made some silly scientific mistakes like \"10% of human\nbrain\" or \"Lucy suppose to OD\" and blah blah blah. But if you consider\nit as a simple movie made only for entertainment, than it is pretty OK.\nIt was a fast paced movie that you can have your mouth full of popcorn\nwith, both Morgan Freeman and Scarlett Johansson did very decent job in\nthe movie and she was incredibly gorgeous as usual. It's true that the\nlogic and storyline is not flawless, but it still movie that worth a\nrate of B and rate A- only for Morgan Freeman and Scarlett Johansson.\nAnyway, it's a movie for entertaining only, and maybe you can have some\nthought about human-being after you left theater.\n"},
{"review": "\nLuc Besson, the genius behind The Transporter movies has done it again.\nOnly this time, he has the way to open people's minds in \"Lucy\". He's\ngot the perfect stars in this film. Scarlett Johansson plays the title\nrole, and Morgan Freeman is a professor who theories ended up being\nproved by her. College student Lucy(Johansson) is in Taiwan studying,\nis later duped by her boyfriend who is delivering a package to a\ndealer. When he gets killed, Lucy ended up being an unwilling mule. She\nand other mules have drugs seen into their abdominal cavities. Unlike\nthe rest, she gets kicked and the drugs are released into her body,\nunleashing a phenomenal potential. She developed powers of the mind\nwhich she never used: telekinesis, magnetism, mind reading, etc.\nWhenever the percentage of her brain is used, the more her humanity\nseems to be leaving her. When she contacted the professor(Freeman), she\ndemonstrates the potential ability of the drugs that enhances her mind.\nMaking her a genius beyond her wildest dreams. The action is fantastic\nand phenomenal, I can understand the mind of what it can do. I tend to\nstay away from people who have limited imagination. Just think. Albert\nEinstein got nothing on \"Lucy\". This movie is pure genius! 4.5 out of 5\nstars.\n"},
{"review": "\nWhen I first saw the trailer, I thought this would be some kind of\nsuperhero movie - maybe not saving the world, but some kind of origin\nstory. Well, as it turns out, I was wrong. Apparently \"superpowers\"\ndon't always equal superheroes in cinema. That's actually very good.\nI'm glad that this didn't turn out to be some mindless superhero action\nmovie with ray guns and all that stuff, even if this isn't on the same\nlevel with the actually deep, astonishing science fiction movies.<br><br>Cinematography was astonishing. The effects were good, and most of the\nscenes were very clear, and it was easy to keep track on what was going\non and were.<br><br>Lucy is slightly interesting as a character, but only because of this\nmystery around her. We don't know who she is, we know only small things\nthat are kind of useless little facts. But all that interest I had in\nher vanished after she started to change into this typical godlike\ncharacter who is in some way superior to others, and just knows\neverything, knows how to do everything, and then just sits there and\nexplains things we don't know about our word so expressionlessly it's\nalmost painful.<br><br>But to be honest this movie was disturbingly, well, racist. Mostly\nbecause of in the beginning this was a lot of \"White woman killing\nscary Asian men\". Come one, she shot one just because he didn't speak\nEnglish, that is disturbing considering were she was. <br><br>If you don't think about the racist parts for a while - and I know a\nlot of people won't - this movie is pretty good. However, I think it\nmight lose its magic after the first time, and you probably can't watch\nthis every weekend. But still, it's visually stunning, interesting and\nworth seeing.\n"},
{"review": "\nThat's awesome movie! I'm myself into space and molecular/organic cells\ncoexistence... I gave it 9 out of 10 because still it cannot be perfect\nabout all theories that are told in this movie, some of cannot be true\nor maybe they might. ;) Still don't know why is the common mark so low\n6.4/10 probably not all understand or into space stuff not considering\nhow did it all began indeed. I consider myself 7/10 or even 8/10 as a\ncommon mark totally deserves it. Anyways special effects were awesome\nand Scarlett Johansson played really good. Don't know if the producers\ndecide to film part II it could be awesome or maybe not as the original\nmovie basically shows its core.\n"},
{"review": "\nI was a little sceptical about watching this film as I had heard\nnothing good about it. Only the presence of Scarlett Johansson and\nMorgan Freeman persuaded me to give it a chance. Am I glad I did. This\nwas off the wall brilliance and one of the most original films I've\nseen. (Before anyone tells me there are others, I haven't seen them so\ncan't comment) I loved the idea of Lucy being able to open her brain to\nencompass the world around her because of the drug seeping into her\nstomach. OK, the idea is preposterous and the set pieces a bit\nludicrous but that didn't matter because this is science fiction and I\nwas able to willingly suspend my disbelief, a little like Lucy\nsuspended the bad guys in mid air. I loved the ending where she became\none with the universe and met her namesake in the past. Scarlett\nJohansson is becoming well known for oddball films and I, for one,\napplaud her for it. This film will not please everyone, as is evident\nby some of the negative posts on here but it is a must have for my\ncollection. Give it a try, you may be surprised.\n"},
{"review": "\nOne more Luc Besson masterpiece!! I'm not sure if there's even one\nmovie from him that I don't like, he's really amazing! This movie is\nreally interesting, Scarlett Johansson (not a big fan) was really\namazing, and the story is wonderful. In some moments reminded me of\nTransendence, but never mind, it's still very good movie. I just don't\nknow why so much negative reviews for this movie, if you're not very\nsmart to expand your thinking you should be watching Pride and\nprejudice or something like that.. I've even saw that people compared\nthis movie with Marvel movies and their comments were hilarious, cause\nthere's no way you can compare comic superhero with movie as this one.\nBut never mind, I would just like to recommend this movie to people who\nlike science, but also sci-fi, action, impossible things.. or just\nsomething new, and Luc Besson won't let you down. But to the ones who\nlike soft romance, tragedy, broken heart, and movies with similar\nthings to stick with movies like Valentine's Day, New Year's eve, Love\nactually.... Maybe the realistic rating would be 8, but since I'm a\nhuge Luc Besson fan after watching Leon: The Professional I'll give him\n10.\n"},
{"review": "\nThis will be another awful review for this half-hearted attempt at\nstanding out from a genre. If you can't tell science fiction from\ninstant custard powder by all rights like this movie.<br><br>Frankly I can not see how this movie would appeal to anyone other than\nthe most dedicated scientologist. Its only defense seems to be \"fiction\nis fiction\", well then thanks for the truism.<br><br>The only thing good about about this movie is the visual work, however\nthis merely creates a sense of eerie fascination in the same manner as\na corpse dressed in Sunday best to a five year old child. <br><br>Now if Luc would kindly have taken the 'time' to team up with old L.Ron\nHubbarb I'm sure the world would be a changed place for this film. As\nthings stand the movie is forgettable, please please let this movie be\nforgettable.\n"},
{"review": "\nLUCY is a French action film that explores the popular concept (some\nmight say misconception) that the human race only utilises 10% of the\npower of the brain. The convoluted storyline sees everyday Scarlett\nJohansson accidentally exposed to a new wonder drug which opens up her\nbrain to a much higher percentage and subsequently changes her life in\na very big way.<br><br>This is something of a mixed bag of a film which was missold by the\ntrailers and advertising as an action thriller. It's more of a thinking\nperson's science fiction film. There are some clumsy thriller elements\nin the story, namely those including the sinister criminal Mr. Jang (a\ndelightful western role for the fine Korean actor Choi Min-sik), but\nmost of all this is an exploration of the human mind and what it's\nultimately capable of. It's much like LIMITLESS in that respect.<br><br>Generally this is an enjoyable film that feels fresh and inventive. The\nearly thriller aspects of the story are handled very well with a ton of\nsuspense. Once the sci-fi twists kick in it takes a while for the\nviewer to acknowledge the change in genre, but from that point it\nremains philosophical and engaging. The ending threatens to become\noverwhelmed in CGI but the film as a whole remains fun and the likes of\nMorgan Freeman bring gravitas and believability to their parts. As with\nUNDER THE SKIN, Johansson proves herself an actress willing to accept\nmore outre parts, which is to be commended.\n"},
{"review": "\nA woman, accidentally caught in a dark deal, turns the tables on her\ncaptors and transforms into a merciless warrior evolved beyond human\nlogic. Although Lucy is not a forgettable film or even a boring one\nit's very unrealistic and the whole story is so over the top that gets\nkinda old after a while at times the film is straight up Transcendence\nand the rest of it it's a story of it's own but like i said it's not a\nbad film it's just that it's very unrealistic and if you think about it\nit's kinda dumb that a blonde girl uses 100% of her brain and her body\nthen travels inside computers and stuff it's just very over the top and\nif you think about not even a different actress or even a man couldn't\nsave it. Although it does have some pretty good action and humor here\nand there but don't except much.\n"},
{"review": "\nI'm a writer myself, and I've turned out a few horror novels where the\nfemale ingénue and the antagonist turn out to be one and the same; so\nwith \"Lucy,\" I was very interested to see how well this premise could\nbe converted into a \"Jason Bourne\"-like scenario. First off, Scarlett\nJohansson is awesome in the movie. It's almost what would be expected\nif the Black Widow from the \"Avengers\" went through the Captain America\nprocess then went after HYDRA. Unfortunately, in \"Lucy,\" HYDRA is\nreplaced by the Chinese mafia, and the Super Soldier Serum is replaced\nby a dangerous addictive drug which in small doses causes heightened\nintelligence. Small doses is the key because when Scarlett's character\nis unwittingly used as a drug mule, the drugs break open in large doses\ninside her, granting her heightened intelligence, psychokinetic powers,\nparanormal abilities and eventually a complete control over reality\nitself. Along the way, Morgan Freeman narrates what's happening as the\nexpert on this drug who she seeks out for help. While the action and\nchase scenes are \"Terminator\" quality, it soon turns into an\nuninteresting plot that runs out of steam. Starting out, the plot is\nfascinating and fun to watch, but as it gets closer to the end, and one\nstarts wondering where it's going with the metaphysical discussion, it\nbecomes more tedious and lackluster. The ending does not match the\nfirst ninety percent of the film. I don't understand it, it doesn't\nmake sense, and it outdoes \"The Shining\" on its vagueness. It could\nhave gone anywhere so to end on a question mark ruins what I thought\nwas an otherwise interesting flick. I give it 3 out five.\n"},
{"review": "\nI have to admit when I first saw the trailer for this film I thought it\nlooked fantastic, I thought about going to see it the cinema but never\ngot around to it, quite a while later I bought it on DVD and watched it\na few nights ago, for me I would rate it as average, Scarlett Johansson\ndoes a good job as the lead character of Lucy, a woman who is able to\ngradually use more and more of her brain throughout the film due to a\npotent drug entering her bloodstream, she uses these powers to go after\nthe people who wronged her. The character isn't really someone the\naudience can relate to because of her lack of emotion and not a lot is\nknown or hinted at about her backstory. <br><br>It's a hard film to enjoy because the plot is very basic and quite a\nfew of the scenes could have been so much better, for example there's\nthis scene where she is at the entrance of a corridor and there are\nmaybe about 10-12 enemies that the bad guy has sent to capture her/kill\nher and he's at the end of the corridor, what does she do, kick their\nasses with some kick ass fighting moves? Gun them down with precision?\nNo, she just makes them float about above her so she can stroll up to\nthe main bad guy, it was a real anti-climax to film and the ending was\neven more confusing. I felt Morgan Freeman was solid as ever in his\nrole but would have liked to see him given more screen time. In summary\na film that didn't live up to my high hopes and a plot that felt bland\nand boring despite a decent cast, 6/10\n"},
{"review": "\nLucy (2014)<br><br>Starring: Scarlett Johansson, Morgan Freeman, Analeigh Tipton, Amr\nWaked, Choi Min-sik, Julian Rhind-Tutt, Pilou Asbæk, Nicolas\nPhongpheth, and Jan Oliver Schroeder Directed By: Luc Besson Review THE\nAVERAGE PERSON USES 10% OF THEIR BRAIN CAPACITY. IMAGINE WHAT SHE COULD\nDO WITH 100%. I thought that this would be more enjoyable then it was,\nbut unfortunately I was wrong. This film stars Scarlett Johansson and\nits basically limitless trying to be more of an action film with a\nfemale lead. The film revolves around a woman, accidentally caught in a\ndark deal, turns the tables on her captors and transforms into a\nmerciless warrior evolved beyond human logic. The movie did not achieve\nits goal, it tries to be fun action film with a unique premise. But the\npremise is not unique and the film is barely any fun, it has its\nmoments no mind you but I just didn't have much fun with it. The story\nis not that interesting, it's basically limitless meets old-boy. We see\nLucy trying to kill the people who gave her this drug for being so\ncruel, and she takes more doses to access 100% of the brains capacity\nto save the information for a scientist played by Morgan Freeman. The\nperformances from most of the cast members is just awful, they were all\njust really boring to listen too. The only worthwhile people in this\nfilm are Johansson and Freeman. You know this movie starts off like\nOld-boy and one of the actors from this film was in the original\nold-boy. The direction from Luc Besson is pretty good but as for the\nwriting, now that's a whole different story. The film is poor due to\nits writing, it's not his best written work but most certainly his\nworst, or at least I doubt it is. All the elements of a good film are\nnot present in this picture. Lucy drives to entertain, but left me with\nboredom but with a little bit of good acting and good directing this\nfilm wasn't a complete waste of time. I give Lucy a three out of five\n"},
{"review": "\nThe movie is really entertaining and even acting is also good i can say\nbut if at all considering the climax it is just a time pass one can\nsay. No doubt characters chosen are superb but as they were showing\nregarding powers at the end they all messed up by showing that when\nLucy got 99% of using its brain capacity her hands came out running\ntowards computer and other electronic devices which was merely a\nfeeling of time pass and also when she said something is inside the\nintestine if at all that word is abdomen that one much suit to that .\nRegarding the story which is quite based on a real concept but what\nthey had shown is just nearly touching the concept but not actually\nbased on it fully. Overall to say its just good one showing something\nnew they might have gone much adventures if they might have shown some\nreal examples in such cases which exactly do exist.\n"},
{"review": "\nThe average human purportedly only uses 10% of their brain; watching\nLuc Besson's Lucy will only require 1% (if that), despite the director\nsteering his film into pretentious metaphysical territory during his\n2001: A Space Oddity-inspired finalé.<br><br>Scarlett Johansson is Besson's eponymous protagonist, who taps into the\nfull power of her mind after accidentally overdosing on a new narcotic.\nAs the drug courses through her body, the young woman becomes more and\nmore powerful, absorbing vast amounts of knowledge and cerebrally\ncontrolling her surroundings, before eventually becoming an omnipresent\nsuper-being. Professor Norman (Morgan Freeman), an expert in the human\nmind, can only look on in wonder.<br><br>While the film pretends to say something profound about the existence\nof man, what it is really about is packing in as many flashy special\neffects as possible, crashing a load of cars, emptying loads of guns,\nand briefly showing Johansson in her bra (which is almost worth the\nprice of entry on its own). It's all very flashy, and, despite its\npseudo-loftiness, very trashy\u0097a film to watch when you want to give\nyour brain the night off.\n"},
{"review": "\nI started watching this movie with no idea what's it about or even what\ngenre it is. The beginning was quite promising although the clips with\nanimals seemed somewhat clumsy or inelegant way to get ideas across. I\nstill expected a decent, adult movie. S. Johansson's acting seemed bad\nand I wondered if she was chosen because of her looks or because of her\nfame, but as the story progressed it all started to make sense. It's a\nteen movie, a typical Hollywood superhero flick for paying masses who\nJUST want to eat candy and popcorn and drink carbonated sugar water\nwhile being lightly entertained. Although IMHO the movie is not very\nentertaining... A sci-fi movie doesn't mean that viewer has to\nautomatically suspend all disbelief and there's nothing more to expect\nthan special effects and two-dimensional superheroes. Just take\n\"Perfect sense\" as an example - there can be layers, thought and so on.\nIn contrast this one just had some stuff sprinkled on it that made it\nlook like it might have some thought and ideas behind it, but at closer\nlook there's nothing really there. It's like the snacks and drinks sold\nin the cinemas that taste and smell like something edible but are\nmostly artificial and not really good for you. Despite being fake they\nsell and bring in the profit, and my guess is so did this movie.\n"},
{"review": "\nThis movie has it all, but on top of the list is the director's\nmasterful touches and Scarlett J's incredible acting abilities. <br><br>You only need the first few scenes to get the idea that you're in the\npresence of greatness. <br><br>Despite the nitpicky science nerds inane barbs, I found the entire\nmovie gripping and engaging. <br><br>Be prepared to go without bathroom and munchies breaks for the entire\nlength of the movie...I kid you not.<br><br>I have watched it three times...a rare thing...and will undoubtedly\nwatch it again. <br><br>Two thumbs up!\n"},
{"review": "\nIntriguing idea...which fails to deliver.<br><br>A woman, Lucy (played by Scarlett Johansson), is kidnapped by a gang in\nTaiwan. Drugs are hidden in her body but these are accidentally\nabsorbed, causing her to use far more of her brain power than any\nhuman. With power comes responsibility...<br><br>The movie was initially quite interesting. Yes, the whole \"we only use\n10% of our brain\" premise is just a myth and is actually absolute\nnonsense - we use our brain pretty much to its capacity. However, there\nwas room for a interesting story on what we could and should do if we\ncould extend our brain power.<br><br>It's a pity then that it just took a random direction, turning into a\n\"look at what I can do with CGI\" display by director Luc Besson, rather\nthan a coherent story. What follows is far from profound or satisfying.<br><br>It also became an action-drama, but even there it didn't really cover\nnew ground. Pretty much your standard good guys vs bad guys shoot-\nouts.<br><br>Disappointing.\n"},
{"review": "\nI went to see LUCY not really knowing what to expect. Honestly, I did\nnot read one review prior to seeing the movie. However, someone that I\nhighly respect was speaking about the mind and all it's magnificence\nwhen he refereed to the movie.<br><br>While I am aware that some things may have been a bit non-factual, I\nreally left LUCY thinking about how the mind can function beyond our\nwildest imagination. <br><br>Watching a family member rehabilitate from a head injury due to a hit\nand run car accident, I witnessed each level of healing process. At\neach phase there was a different action from extreme agitation and\nconstant movement to periods of calm. The doctors explained it was the\nmind repairing itself. Thumbs up to Scarlett Johansson for a great job.<br><br>Even though Lucy had different twist and turns that you may not\nnecessarily associate with the message of the movie, I enjoyed that I\ncan take something from a movie that made me think beyond the\nentertainment aspect.\n"},
{"review": "\nIn my view this is the best film Besson has directed since 1997's The\nFifth Element. The film in certain ways is a lot like Limitless, but at\nthe same time it takes a very different overall approach and look on\nthe subject of human evolution. I'm sure that many people will not care\nmuch for this film since it is filled with a lot of mystical/spiritual\nreferences and ideas and even some false science, however those with an\nopen mind and an active imagination will likely be very glad they saw\nthe film. This is clearly a work of fiction people, but there is no one\nsaying you can't relate fiction to reality either, and actually learn\nsomething from it once in a while too. Our limitless imaginations are\npart of what makes human beings so extraordinary, we are best off using\nthis gift and appreciating it. Fictional films can still be very\nthought provoking, and this one definitely fits that category. 2001: A\nSpace Odyssey isn't scientifically accurate in many ways to our current\nknowledge, but it's still a monster landmark of a film nonetheless.\nLucy is certainly not 2001, however they both ride that same\nimagination rules line that can spark the internal fires of unique\ncreative thinking. In my view Lucy is a sci-fi trip worth taking.\n7.5/10\n"},
{"review": "\nLucy is a Bourne Identity meets Kill Bill meets Limitless romp auteured\nby Luc Besson, the man behind classics like Leon the Professional and\nLa Femme Nikita. In one of the stranger wide releases in years, there\nis much reward given to those willing to give Lucy grace (ridiculous\npremise and over-the-top aspirations). It's flawed, but it's a brightly\nfilmed and darkly themed scifi action thriller that delivers. Lucy\nposits the debatable notion that humans only use 10% brain capacity.\nJohansson plays the title character that goes from monotony to\nsuperhero when a new drug gives her the ability to use 100% of her\nbrains power. Her capabilities aren't just big math problems and fast\nreading, but telekinesis, shape shifting and other comic-booky things.\nIt's a fascinating if overly ambitious premise that Besson puts to\ngreat use, playing it out like a briskly paced, inventive TV pilot. The\nscifi is strong, with theories and declarations posited throughout and\nthematic exposition that works. The shining element here is Johansson,\nwho continues her upward trajectory in a bombastic yet effective\nperformance. Her progression from a nobody to the most powerful femme\nfatale in history is emotional, funny and relatively believable. It's\ngreat to see Besson bounce back after The Family to present what may be\nhis magnum opus, touching on all of time and creation in under 90\nminutes. Sure, some of the effects are cheap and goofy, but the editing\nis unique and tight, the violence and style are lively, and the\nstorytelling is refreshing. Engaging and cool, Lucy is highly stylized\nscifi pulp of the highest order.\n"},
{"review": "\nThis is a god awful movie with a lot of wasted talent. The writing is\nabsolutely ridiculous and has more bad science than a theist trying to\nuse the bible to explain electricity. It is hogwash. It is 100% crap.<br><br>Besides the bad science it is filled with fallacies and logical errors\nthrough out the movie. Obviously the writers of this\nstory/script/book/whatever were high as a kite when they wrote it. Was\nthis by the Wachowski brothers? No? Luc Besson? Ah, Luc Besson.<br><br>The myth about using only 10% of your brain is just that, a myth. You\nuse 100% of your brain but most of it is sub-consciously done. All the\nfine motor skills, breathing, heart action, awareness, memory storage,\netc etc etc, is all done quietly and with out you knowing. So this\nmovie wants you to think that taking some drug would increase your\nbrain power from that 10% and when you reach 100% you can do crazy\nstuff like turn in to air.<br><br>Egad! Stop the suffering now! Turn the damn movie off!<br><br>This is a horrible movie and it shows that ignorant people influencing\ngullible people is a bad combination.<br><br>I wish I could give it negative points.\n"},
{"review": "\nScience Fiction is not really my thing but I thought any film with\nMorgan Freeman and Scarlett Johansson in it is not likely to be hard\ncore sci-fi and basically I was right! <br><br>So the precept of this film is that we only use 10% of our brains\n(which is not true) and what would happen if we could actually use\n100%. According to this film we would turn into some sort of robot with\nsuperhero powers. Johansson adopts robotic movements, turns into a\ncrack shot killer, develops immunity to pain and has atoms flying off\nher before she even reaches 20% so from early on we are left wondering\nwhat on earth will happen when the 100 is reached. Unfortunately what\ndoes happen is kind of disappointing and corny, but there again it\nwould be difficult to come up with a different ending considering what\ngoes before. <br><br>There are aspects of this film I really liked - Johansson is actually\nvery good within the limitations of the role and the imagery used is\nvery effectively done. Despite my disappointment with the ending I did\nlike the meeting of the Lucy's. The film zips along at a fast pace,\nthere are no 'quiet' moments or downtime. I just feel it was an\nopportunity missed because the idea behind the plot (although\nscientifically absurd) was original and interesting. I would have liked\nmore depth to the characters (because really we don't get to care at\nall about Lucy as a person), a more credible story line, a more\nsatisfying ending. Instead we get a sort of female Incredible Hulk\n(although a very glamorous one), a bundle of VHS tape type stuff and a\nmemory stick. Not satisfying at all. <br><br>However, I've given it 7 stars because it kept my attention from start\nto finish and I did find it entertaining. If you like action movies and\ndon't mind a bit of sci-fi lite thrown in you will probably enjoy this.\n"},
{"review": "\nNo need to go into great spoiler details, except to say it's all been\ndone before. This is not any better, nor much worse, than its\npredecessors. The spoiler is in how closely it thematically follows its\npredecessors: Altered States (1980) Transcendence (2014) Limitless\n(2011) Based on an untrue scientific principle that we can utilize only\nso much of our brains, it makes speculation as to what a fully used\nbrain might accomplish. And this is where, despite decent directing,\nfine acting and a sufficiently worked out screenplay, it lost me- on\nsheer lack of credibility. It is one thing to say a super human mind\ncould accomplish insanely fast calculations, assimilations, and\nmind-body coordination. It is another thing to say it could accomplish\ntelepathy, teleportation, and time travel. I became incredulous, as it\ntried to be incredible.\n"},
{"review": "\nI liked most of this movie except the ending. Lucy gets caught up in\nsome kind of drug deal and is forced to be a mule. The experimental\ndrug is placed inside her and leaks and basically turns her into a\nsuper smart, terminator like gal. The drug causes her to start using\nmore of her brain cells and throughout the percentage of her brain\nbeing used is flashed on screen. She can mind read, kick butt, control\ncomputers and phones etc.... And soon she has control over matter and\ncan manipulate objects. All the while the Korean boss is after her and\nI was never really sure why.<br><br>Spoilers\" The ending was what I didn't think made sense. Once she\nreaches 100 percent brain function, she just disappears, assumed to be\nin all electrical forces, computers, etc.... And then it just ends.\nThere is no conclusion.<br><br>FINAL VERDICT: A pretty good concept. But the movie is short and the\nsubject is complicated. A whole lot more could have been put in,\nespecially some sort of conclusion.\n"},
{"review": "\nI liked the idea of cerebral capability can reach up to 100%.<br><br>What I understand from the movie is we are making wonders even if we\nare using 10% of it.<br><br>Hacking mobile phone line using car windscreen superb. <br><br>After that chasing car I like the most.<br><br>Whilst they used an idea about the brain that has long since been\nproved nothing more than a myth it works to drive the concept of the\nfilm. <br><br>I do think with a little thought they could of made this a little bit\nmore believable though if they had just focused on being able to use\nmore of the brains potential rather than \"capacity\".<br><br>Anyway apart from the basic concept that we still do not really\nunderstand our brains and what they are capable of everything else in\nthe movie is based a lot in the realm of fantasy. There was a whole lot\nof things in the movie that could of been done better but even with all\nthose flaws I still found it entertaining.<br><br>The only thing that let the film down for me was the ending which even\nthough visually was probably the best part of the film it still felt a\nlittle too generic and overdone.\n"},
{"review": "\nI'm going to keep it real. The main reason I picked this movie up was\nLucy wasn't the best of films but it wasn't bad. It started off pretty\ngood actually, with some nice action and suspense, it kept me kind of\ninterested. It was when the movie got towards the end when everything\nfor me got kind of far-fetched. From the beginning, this film could\nhave easily started a creationism vs evolution debate. That's one of\nthe things that made this film start off pretty good actually. Morgan\nFreeman's acting in this film was awesome as usual and Scarlett\nJohansson playing a kind of super hero in this film was great as well.\nLucy (Scarlett Johansson) is caught up in a drug smuggling deal that\naccidentally turns her into a super human then goes after her captors\nand is aided by Professor Norman (Morgan Freeman). Like I said earlier,\nit starts off pretty good but towards the end it gets kind of\nfar-fetched. Now I'm not a neuropsychologist but I think there are some\nfeats that are impossible even if you actually used 100% of your brain\ncapacity. I know you might say well it's a science fiction movie, but\neven if I'm watching a science fiction film I would still like for the\nlaws of physics to be respected.\n"},
{"review": "\nThere are a few nicely done scenes, that is why I give it 4. It is not\nthe worst movie, but surely not the best science fiction movie I have\nseen.<br><br>But the story is thin - before any basis is done, we jump directly into\na drug gang, lots of violence, with absolutely no points.<br><br>The only funny part, is when Lucy is emotionless and make comment to\nher room mate that the person she ask to is dead, and she means it\nliterate, however roommate think he is exhausted from sex. That is the\nonly funny comment in the whole movie - or maybe it is supposed to be\nfunny when Lucy enter the room where the professor is, just as he talk\nto her on the phone? Violence, just pointless. In the start it is\nlogical, as the drug gang is just like that, but as soon as Lucy can\ncontrol more than one person mind at the same time, and DO stop the\ngang once in Taiwan and secondly in France, she doesn't do it permanent\nand fail to do it a third time, though it would have been much easier\nand safer than anything else she did.<br><br>OK, the extremely bad violent scene at the end, had to be there,\nbecause the head of the drug gang had his hands ruined by Lucy and he\nwas mad at her. Clearly, he had to chase her all the way from Asia to\nFrance, just to get revenge, by attempting to get the drug back and\nshoot her.<br><br>The last scene where Lucy see the history of human kind, the universe,\netc and make an USB stick - boring. And I do not see any logical\nfollowup to the story.\n"},
{"review": "\n'Lucy' is at best a stylish fast paced thriller, well made and\nbrilliantly led by Scarlett Johannson. At worst it is an over the top\nmovie based on a single concept that runs out of ideas and falls down.\nThe truth of this movie is somewhere in between. Lucy has a great\nopening, with a woman forced to transport a rare drug in her stomach by\nthe menacing Min-sik Choi 'Oldboy'. What happens after that is quite\namazing however the plot is too short for a feature length movie so the\nlast half an hour seems to lose track of anything remotely feasible and\nthis spoils the whole feel of the movie. Its a shame really because for\nthe most part this film is a good thriller but even sci-fi films have\nto remain convincing to be effective, no-one expects a realistic movie\nwith science fiction but it needs to be intelligent. 'Lucy' lost focus\nand descended into something quite absurd, despite this however it's a\ndecent ride with the stellar cast in brilliant form.\n"},
{"review": "\nApparently the idea of this film took 10 years to get realised that for\nsome people that was ten years wasted. The premise of this film sees a\ngirl get forced to take this drug which slowly unlocks her brain to\n100%. Scarlett Johansson is one if the biggest actresses in Hollywood\nand she delivers a decent performance. She transitions from frightened\ngirl to action hero pretty well. It's just her character becomes so\npowerful that she becomes impossible to relate to and hard to empathise\nto. Morgan freeman is decent in the movie too even though he basically\njust plays the same thing as always. The villain in the film has\nnothing to him because he stands as no opposition to Lucy at all. The\nguy she hangs out with also has absolutely no depth to him and you\nwon't care. The story has absolutely no depth to it at all and you\nwon't care about any of the characters. The tension just isn't there\nbecause Lucy has absolutely no opposition in the film at all and no\nemotion. The script us either cliché dialogue or expositional\nscientific dialogue that you don't understand. There are some alright\naction scenes in the film but the style of this film is bold and\nridiculous. They show animals in situations to explain stuff and just\nforget about it and the action becomes just absurd. Overall this is a\npoor action film that you really don't need to see.\n"},
{"review": "\nI saw the trailers for Lucy and thought that it would be an interesting\nmovie. It seemed very sci-fi and entertaining, so I thought to give it\na try. <br><br>After watching the movie, I'm still a bit confused as to what happened.\nThe character development wasn't the greatest in this film, and for the\nmost part, I thought that the scientific component of the movie was\ngrasping at straws. Of course, it's a fictional movie, but there's a\nlimit to excessive stretching of hypotheses and theories. <br><br>The CGI was fantastic in the movie, but the whole purpose of it wasn't\nexplained clearly. At the beginning of the movie, you start off\nwondering what is going on and what this drug does to your body.\nThere's no scientific explanation for it, and the gangsters that\nimplanted the drug in her body (as seen in the commercial) don't even\nspeak the same language to each other (Korean and Chinese). So right\nthere, you start to see irregularities in the film - easy mistakes that\nshould have been fixed. <br><br>Throughout the rest of the film, you see Lucy using more and more of\nher brain's total capacity, and she completely loses her humanity and\nbecomes a digital being, living in the cyberworld. But to what purpose?\nI still don't get it.<br><br>So my opinion is that it's an entertaining movie filled with suspense\nand action, but the scientific theories and story development are a bit\nunderdeveloped and exaggerated from the truth. I give it a 6/10 purely\nbecause of the entertainment factor.\n"},
{"review": "\n'Lucy'. Tosh. Take a dollop of 'Transcendence', a smidgin of 'The Fifth\nElement', some spare squiggly tracking-lines from 'The Matrix', and a\nlot of Scarlett Johansson shooting well-dressed Asian gangsters in a\nBlack Widow styleee...and you have proof that Luc Besson hasn't made a\ndecent film in years. The once inventive director has now, it seems,\nstopped trying to be an auteur and taken to re-hashing the greatest-\nhits of others<br><br>How 100% brain capacity, spiritual enlightenment and...er... kung-fu\nfit together, I don't QUITE see. It made very little sense back when\nKeanu Reeves turned into a techno-Jesus for the Warschovski Bros...and\nI still don't...though Scarlett IS prettier.\n"},
{"review": "\nQuickly seen and quickly forgotten... The only thing I will recall from\nthis movie is the brilliant music by Eric Serra. For the rest, well...\nThe plot is as simple as it can be: a nice looking female hero, a bad\nguy sooooo mean that he doesn't even knows himself why, and action (car\nchase, gunfight, that's it). The \"science\" here is only a poor excuse.\nThe scientific argumentation given by a very solemn Morgan Freeman is\njust laughable (\"go from evolution to revolution\" wow...). The end of\nthe movie is just nonsense.<br><br>This movie is not for : Sci-Fi fans, early Besson fans, scientists,\nlogical persons <br><br>This movie is for: ScarJo fans <br><br>Based on a similar plot,I would rather recommend Limitless (2011) with\nBradley Cooper and Bob De Niro, which is more subtle.\n"},
{"review": "\nIt is (science) fiction. People who complain about the 10% myth\nprobably complain about how impossible it is for Godzilla to breathe\nfire. I was entertained by this movie because it had action, some sci-\nfi, and definitely loved the visuals. In the beginning, I thought this\nmovie was going to be another Limitless, but fortunately it was not.<br><br>I feel like it could have done more because I didn't feel anything for\nany of the characters. What kept me watching was the desire to find out\nwhat happens when Lucy reaches 100%. The film doesn't have any replay\nvalue, but it wasn't a total waste of time. It's a refreshingly new\nkind of action film that gets you thinking a little about life's\npurpose.\n"},
{"review": "\n'Lucy' tries to be both an action-thriller and intellectually\nprovocative, but succeeds in neither of these ambitions. The film's\ntired plot relates how some blood-thirsty Chinese drug traffickers\nattempt to corner the market with a new designer drug. After sewing\npackages of the substance into the stomachs of some reluctant mules,\nthey blackmail them to fly to Europe with the contraband. Apparently\nthese incompetent mobsters haven't properly tested their product, and\nare ignorant that an overdose can endow its consumer with extraordinary\nphysical powers and intelligence. When one of the packages leaks, a\nditsy blonde mule metamorphoses into Superwoman. <br><br>The plot-holes are gigantic, so writer/director Luc Besson attempts to\ndistract the audience with his standard menu of theatrical fights, car\nchases, shoot-outs and gratuitous violence. These stale leftovers are\nserved up with some pretentious babbling about the drug's mutations\nprojecting humanity up the evolutionary ladder. Unfortunately 'Lucy'\nonly signifies another dead-end in film-making.\n"},
{"review": "\nThis film tells they story of a woman who unknowingly becomes a person\nwho can access 100% of her cerebral power, after a chemical substance\nis implanted into her.<br><br>\"Lucy\" has very cool social effects. There is quite a bit of such\nfootage of weather and nature, in keeping with the theme of evolution.\nThe final scene where Lucy accesses her college cerebral power is very\namazing. I like the plot a lot as well, as it's very imaginative about\nwhat happens when people can use their brain completely. Though it is a\nbit far fetched, it's very entertaining to watch. I find \"Lucy\",\ncaptivating and visually appealing, I very much enjoyed watching it.\n"},
{"review": "\nAs soon as I have seen the trailer, I wanted to see the movie.\nUnfortunately the trailer gives a completely different perception and\ndirection... it is a bit misleading - that could annoy some people - as\nthe movie is hitting my personal right buttons, I didn't mind.<br><br>For an action movie, Lucy goes quite a slow pace. I have seen reviews,\nwhich are describing it slow and fast and slow again - I would rather\nsay, slow and slower and then medium slow. But then the whole movie is\ncarried by the talent of Luc Besson to showcase impressive visual\ntreats - and while it is sometimes a bit \"head scratching\" (e.g. the\nrepetitive reference to Lucy the \"cave-human\")- it makes just an artsy\nand beautiful movie. What I didn't liked at all was the basic erroneous\nassumption, that the human is using XX% of his/her cerebral potential.\n10 years ago, Luc Besson could have got away with this - but nowadays\ncommon knowledge is flagging this just as nonsense... He could have\neasily adjusted the story. But he didn't and this \"nonsense\" goes on\nand on like that. Basically it is naive to believe, that using more\npotential of your brain, would give you control over more than your\nvery own body. This fact is excusable in fast and rather blunt\naction-movies with mutants and people with super powers. However a\nmovie like Lucy, which gives enough time to reflect and to think about,\njust deserves a better built \"game plan\". And these type of problems\nare going on and on until the very end. Lucy is still a very enjoyable\nmovie, which even could give some philosophical impulses. However it\njust didn't reached \"perfection\" because of mentioned reasons. After\nall - I felt, that I didn't wasted my time, by watching this movie -\nhowever it also felt that it was always a step below its true\npotential.\n"},
{"review": "\nNo, it's not exactly a concoction of Lucy Ricardo with Ethel Mertz.<br><br>At some point, I thought I was back in college in the standard physics\ncourse reading the text Matter and Energy, or viewing Cliff Robertson's\nOscar winning performance of a man who achieves genius in 1968's\nCharly.<br><br>Scarlett sure got more than what she bargained for in this half-brain\nthriller regarding a woman whose new boyfriend gets her to deliver a\npackage. He is quickly liquidated and the woman endures all sorts of\ntorture by her Asian captives as drugs are implanted in her stomach.\nShe also assumes tremendous intellectual power and also becomes a\nfemale Rambo in trying to extract revenge on those who implanted the\ndrug at her.<br><br>While all this is going on, Morgan Freeman lectures regarding cell\ndevelopment and the brain. In her travels, Scarlett eventually meets\nthe good professor to show him the power of the drug and the\n\"brilliant\" effects it has placed on her.<br><br>This is rather inane and a better name for this film would have been\n\"The Terminal Lady.\" This film needs termination rather quickly.\n"},
{"review": "\nAs the summary implies, my expectations were using 11% of my brain\ncapacity, but unfortunately, after viewing it I wanted to have my\nmemory erased. Other reviews name its worst crimes, so I won't bother\nto rehash them, but I will point out a few things that spoiled it for\nme. Lucy walks around in public with a gun (sometimes 2 guns) in plain\nsight, and not only is she not challenged by anyone, but no one else\nfinds this in the least unusual. In a country of primarily black haired\npeople, a blonde woman walking a hospital corridor would warrant a\nlittle attention on its own, but to be walking the same corridors with\n2 menacing looking pistols with silencers attached, and no one even\nBATS AN EYELID? Reall? In this day and age? Outside the hospital,\npolice cars screeched to a halt, knowing by now they are dealing with a\nposse of heavily armed Asian drug dealers. As they pull up they fail to\nnotice the half dozen or so black cars, with a large gathering of Asian\nmen in black suits, brandishing automatic weapons - TEN METRES AWAY!!\nSeriously?Near the end, despite being able to read minds, move things\nand travel anywhere by just thinking it, she fails to see or hear the\nboss bad guy walk up behind her with a gun. Why allow him to get a\nround off at all, why not so what she did to the others in the......\noh, never mind. Please someone, remake this properly.\n"},
{"review": "\nThe only interesting parts are the ones dealing visually with the\ntheories about increasing intelligence and powers. Thankfully these\noccupy most of the movie. The rest is some gangster filler with good\nactors that have nothing to do but look gangstery and punch and shoot.\nThe movie goes philosophically beyond reason and abruptly stops wowing\nas a result. Also it does not deal with the obvious issue that this\ncompound is now imminently available and many people can be like Lucy\nso now what, complete human crisis. It also bothered me that it's in\nthe same vein as Ocean's 11 and Bourne Identity, rich people making\nmovies about multiple luxurious foreign locations as if we've all been\nthere done that. Most people are paycheck to paycheck and this\njet-setter international shooting location style is something that is\nrevealing about the ultra rich lifestyle of the movie-maker and his\nmilieu rather than something necessary to the story.\n"},
{"review": "\nLucy (2014) <br><br>*** (out of 4) <br><br>Bizarre but entertaining action film about a young woman named Lucy\n(Scarlett Johansson) who finds herself being forced to carry a new form\nof a synthetic drug for a ruthless kingpin. The bag of drugs is planted\ninside her body but when it breaks open it begins to give her full\naccess to her brain's power and soon she's a deadly machine.<br><br>LUCY is certainly director Luc Besson's best film in a very long time\nbut I must admit that I think it's best that you turn your brain off\nright at the start of the picture. I'm still a little confused as to\nwhy Lucy didn't die of a drug overdose but, again, logic isn't going to\nbe your best friend in a picture like this so it's best just to sit\nback, put your feet up and enjoy the various visual styles and\nperformances.<br><br>Besson has always known how to structure an action scene and he\ncertainly brings a lot of flair and style here. The action scenes are\nall extremely well-directed and there's no doubt that the frantic chase\nthrough the streets are exciting and full of imagination. Another plus\nfor the film is that it has some stylish gunfights including one\nbetween the mobsters and the police towards the end.<br><br>Johansson also deserves a lot of credit for her performance. From the\nearly stages of the film where she's basically playing a crying wimp to\nthe scenes where her brain eventually evolves, the actress is certainly\nbelievable every step of the way. I was really impressed with the\nactress during the scenes where her brain is at full functioning mode\nas the actress really makes you believe she's this intelligent\ncreature. Morgan Freeman gives the typical Morgan Freeman performance\nbut it's always fun to see him. Min-sin Choi and Amr Waked are both\ngood as well.<br><br>Again, LUCY is a pretty strange movie and it's not all logically there.\nHowever, the performances certainly make it worth watching as does the\naction.\n"},
{"review": "\nWatching the trailer gave me the impression this would be like a good\nand complex story with lots of complications. However, it is not the\ncase at all. The story is pretty shallow and doesn't have a red line\nwhere you could sense a targeted ending.<br><br>Everything turns around the following question - What would happen if\nsomeone's brain gets to a full capacity. I must say according to the\nmovie it can be summarized as you get the telekinetic abilities and\nknowledge in the world just flies into you. And once you reach 100% it\nbecomes a divine power and you are everywhere and everything. So simple\ncan an answer be.<br><br>Despite a good performance and distraction from Scarlett Johansson once\nshe got the capacity increase (because the 'scared girl' play in the\nbeginning was really raspberry worthy) I could not help myself to\nwonder why this wasn't the story a viewer would expect according to the\ntrailer. I mean, a villain wouldn't really harm the movie. The Asian\ngang weren't real opponents because they weren't presenting the danger\nand the french cop was a terrible intermezzo. To sum up the final and\ndeciding opinion, everything happened way too fast. The drug bust, the\ncerebral capacity increase and even the final shootout. I assume they\nshortened everything because they had been feeling they were loosing\nthe red line.<br><br>Putting everything together I must admit the lack excitement or any\nentertainment. The positive thing is the play all-round was very solid\nand the effects were interesting. However, a big minus for the\nscenario.\n"},
{"review": "\n\"Lucy\" by Luc Besson, plays on an intriguing notion that humanity, if\ncapable of using more than just 10% of their brain, could achieve\nincredible feats, and practically become gods.<br><br>\"Lucy\" is about a young woman (Scarlett Johansson) who quickly finds\nherself in the wrong place at the wrong time. When forced to deliver\nsome drugs inside of her lower tummy, the package accidentally opens\nreleasing the drugs into her system. However, rather than killing her,\nthe drugs unlock her brains full potential.<br><br>Although the movie was not incredible, I did find it visually\nentertaining. Furthermore, the movie was full of action and interesting\nperspectives on the theory of evolution. However, the plot was a little\nunderwhelming. There were many times where I was hoping the story's\naction would be a little more \"up close and personal\", instead, we are\ngiven \"Limitless\" meets \"The Matrix\". Which by themselves are perfectly\ngood movies, but they could have maintained some element of Lucy's\nhumanity as it was very hard to relate to what she was experiencing. In\nthe end, it was as if she became like \"Amazo\", or \"Data\", which I\nunderstand was the director's intent, but it would have been\ninteresting to see what Lucy would have been like had she maintained\nall of her humanity.<br><br>Overall, \"Lucy\" was entertaining, but it is not something I would go\nand see again. For this reason, I give \"Lucy\" a 6.\n"},
{"review": "\nA life is what matters. This idiom will prove its meaning through this\nwhole movie. And no one is able to demonstrate this better and more\ncharming as the main actress, Scarlett Johansson as Lucy. Lucy is utter\nnonsense, utter chaos, love, and modern dialectic. As we are\nquestioning the meaning of life, we rather tend to obey other\ncircumstances which are of different matters. As such we do take notice\nhow a wonderful main actress does a superb job in a fantasy driven\naction thriller. Not that it would matter, but she does entertain as\naction hero, in contrast to the nice and sassy blonde chick with the\namazing sex appeal, we are used to. But it would be unfair to state\nthis movie good qualities just because of her, there are too many good\nactors and great performances to mention them all. To be honest, the\nstory itself is the weakest spot of Lucy. Darn it. They could have\nemphasised a little bit more on this topic, life and evolution, more\nthan the average peeper deserves. Enough of her lips and tits, we wanna\nsee Scarlet (r)evolutionize. Next time, give her a great character, a\ngreat team, and a great story. Make her real. 6 out of 10.\n"},
{"review": "\nWhat happens if our brain is made to use to its full potential? Just\nwith 10% of its usage world has witnessed the miraculous wonders, the\nuse of its fullest potential may be beyond the reach of human\nimagination.<br><br>2014 film ''Lucy'' is of the same concept, in around some dangerous and\naccidental circumstance Lucy get her blood streamed with some highly\nfunctioning nootropic drug that stimulates the potentiality of her\nbrain usage gradually enhancing from 10-100% of its capability that\nproviding the ability of telekinesis and telepathy, but the wondering\nthing in this movie is that the imagination of the maker to show the\nunknown as the potential possible truth breaching all kind of\nchallenges of viewer's logical thinking, to some extent director seems\nto be succeeded in making the audience believe the possibility of the\nbrain could do, but when it crosses the 80% of its potentiality it\nhappens bit difficult to be imagined, the best part of this movie is\nthe visual picturing of the imaginative elements by Lucy seems to be\nvery beautifully presented.<br><br>Scarlett Johnson had made her perfect screen presence with her\nconfidence portrayal as the Lucy, her decent and very precise\nperformance mark her as the well talented actor, Morgan Freeman though\nhas less screen presence seems to be perfect with his role, the\nhighlight of this flick is the graphic work that truly makes the\n''Lucy'' appreciable.\n"},
{"review": "\nI always enjoy watching Scarlett Johansson. And the first 40 minutes of\nthis film were entertaining. But the ending left me cold -- it didn't\ngo far enough. So she enlarges the use of her brain to 100%, manages to\nrevenge herself on the bad guys, killing a bunch of them in the\nprocess, and becomes an omnipresent, omniscient, omnipotent being. \"I\nam everywhere.\" Okay, then what do you do with all this power and\nknowledge? Nothing-- that's the end. I would have really liked to see\nsome sort of philosophy on what the purpose of it all is, and once you\nacquire power, what should you or could you do with it? She could have\nterraformed planets and resettled warring tribes there. She could have\nended hunger and war somehow. There is a lot she could have done, but\nwe don't even know what she considered worth doing. And I'm really\ntired of cars driving wrong way down the freeways for endless minutes.\nSeems like directors just do it because it's fun to create and they\ncan. But we've seen it -- it was done to perfection in Deju Vu. I never\nneed to see it again.\n"},
{"review": "\nThe idea of this mind extending drug is nice. Well casted roles and\npretty good played by them. OK Lucy reminded me of resident evil and\nthe girl whatever her name was but still pretty entertaining. <br><br>They used a lot of nicely made special effects and pictures. Tried to\ngive it a deeper sense but they didn't make it completely. Sadly, the\nend is far too much. Here a little less would have been a lot more.<br><br>Overall: Not the worst but also not one of the real treasures in movie\nhistory. If you want to see some easy entertaining movie with some good\nactors and special effects give it a try. If you look for some valuable\nmovie with some kind of sense and logic go ahead and keep searching.\n"},
{"review": "\nI have enjoyed many films starring Scarlett Johansson and taken in many\naction packed scenes and films by Luc Besson. So this collaboration was\nreally something I was looking forward to, but it ruins it for itself,\nit simply falls apart the further we move towards the end.<br><br>I really like the first \"half\" of the movie, it has a nice premise and\nthere are some really good and interesting scenes, as long as we are in\nthe theoretically phase and within the grasp of what might happen it\nactually works out. As soon as we step into the place where no one can\npredict what might happen if we are able to use about 40% or more of\nour brain capacity, the chains that links the story, reality and the\nentire film breaks.<br><br>There are some very nice action and fighting scenes in between, but all\nthe mind expanding and knowledge gaining and control is simply too\nweird and out of touch with anything you would believe will actually be\npossible.\n"},
{"review": "\nWe were excited to see Lucy based on some excellent reviews. We made\nthis a prime-time movie night selection as soon as it was available for\nrental. It was somewhat entertaining, but ultimately disappointing. Our\ntake is that the first half was fun and curiously \"realistic\" sci-fi.\nThe concepts explained by Morgan Freeman were very crisp and\nenlightening (although a bit academic.) We were quite engrossed in both\nthe academic and gangster story lines. About 2/3 of the way through,\nthe film \"jumps the shark\" with some absurd sci-fi leaps. We would give\nthe first half of the film a solid 8 and the second half of the film a\n5. Average is a 6.5, so we'll round this up to a 7. This film had great\npotential to reveal some breakthrough new ideas, but it lost its way.\n"},
{"review": "\nFrom a scientific stance, this movie makes absolute 0 sense and if\nyou're the type who's looking for a film that accurately reflects\nscience and all it's endeavors, stop here, this movie's not for you. <br><br>However, I genuinely do believe that the storyline is quite a unique\none, however, was ruined by a cringe worthy script, non diegetic and\ndiegetic sounds. The only thing that did save this movie from being a\ncomplete flop was a decent cast and some truly breathtaking CGI.\nConsequently, from a consumer and viewers point of view, it wasn't the\nworst film, but it could definitely had some patching to do with\ndirecting and soundtrack. Overall, a film that is worth watching once,\nunless you're a science fanatic. 6/10\n"},
{"review": "\nThe concept this film tries to explore is interesting but I feel like\nthey got lost somewhere along the way while doing so. As the film\nstarts, we see professor Norman explain to a class that humans only use\n10% of their cerebral capacity and he proposes a theory of what would\nhappen if we could somehow use more. The idea is good and part of his\ntheories are too. Then we see Lucy, who actually gets to use more than\njust 10% of her cerebral capacity and we see the changes she goes\nthrough as she reaches 100%. My main issue with this film is that I\nfelt like somewhere along the way they reached a point where they ran\nout of ideas and decided to turn this supposedly sci-fi film into a\nfantasy film. Some of the action scenes felt a little bit forced and\nout of place. I did enjoy watching this film nevertheless, the pace is\ngood, the acting is good and the visuals are great. The story is\ninteresting, but the way it develops is a bit crazy. If you're willing\nto overlook a few details and just take it for what it is, Lucy is a\nrather entertaining film.\n"},
{"review": "\nLucy <br><br>If humans used more than 10% of their brain network sitcoms would be\nendangered.<br><br>In fact, the brainiac in this action movie doesn't watch TV at all.<br><br>Coerced by her boyfriend to deliver a briefcase to a kingpin (Choi\nMin-sik), Lucy (Scarlett Johansson) becomes an unwilling participant in\nthe Taiwanese drug-trade.<br><br>Forced to mule a drug capable of boosting brain function back to the\nStates, a scuffle damages the product, entering Lucy's bloodstream.<br><br>In lieu of overdosing, she gains access to the other 90% of her brain,\nresulting in extraordinary mental and physical abilities.<br><br>She now hopes to unravel the mysterious of life, and get revenge.<br><br>While the concepts and car chases presented by writer/director Luc\nBesson are provocative, his attempt at a cerebral actioner is asinine\nand unbelievable at times.<br><br>Besides, even if a woman could use 100% of her brain around a cute guy\nshe'd still only use 7%. <br><br>Yellow Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nOK so fair enough I am only a quarter of the way through this movie but\nI had hoped when I read the back of the DVD cover that this wasn't\ngoing to be an attempt to remake Limitless, but having watched the\nfirst quarter of this film I am well aware this is basically copying\nLimitless and as much as the acting so far is convincing and good\nLimitless is streets ahead. This film was 9 years in the making, well\nit's a shame then it wasn't made quicker as I feel it has been pipped\nat the post. Nonetheless it seems well made so far and entertaining and\nI will enjoy this as long as I blank out the screaming in my head\nsaying Limitless Remake.. Limitless Remake!\n"},
{"review": "\nIt was not accidentally, that the main actress is female, a female that\nwill eventually achieve all knowledge, 100%. I know of another one,\neager for knowledge, cause she would had been as powerful as God.\nActually, Lucy in the end turns into God, cause she says by text: I'm\neverywhere! WTF! Tis is both hilarious and insulting to human\nintelligence! There is the What if? question as well: what if I would\nhave achieved I do not know...30-40% control of my brain abilities?!\nWould I have given the cure for incurable diseases, would I have been\nable to reach a state of mind when I could be able to cure myself from\nany possible disease? (placebo is just 0,1%). would I have stopped\nwars, and famine?! YES! I would! but what is this chick doing?! she\nbleeds noses, she fights, she gets involved in insane car chases, and\nwell, most of all, she uses technology! oh, she became so smart and\nstill needs technology! bleah! technology only makes us dumb, really!\ndumber and dumber... finally, my general review is that it is a total\nbullshit! it insulted me!\n"},
{"review": "\nIt's sad to see Besson sort of losing it. There's a footlooseness in\nLucy that reminds you of his early stuff: But his early stuff is more\nenjoyable. It's hard to pin down exactly why. But I'll try.<br><br>Lucy loses it because it's just plain weak. The premise and setup is\nmorally hazy. It just doesn't compute, in the sense of metabolizing\ninto compelling development. I think that, as time goes by, I have less\nand less patience for hyperbolic, action-flick, urban fairy tale-style\n\"evil\"; and this flick's setup sequences establish exactly that. Sorry,\nbut I guess I prefer human-dimensioned evil in my urban fairy tales,\nunless you're pointing the projectile over the wall of my credulity and\nfiring all rockets, like, say, Robert Rodriguez, or a lot of\nfantasy/sci-fi (like Guardians of the Galaxy).<br><br>To me the whole sideshow involving Freeman and his coterie was an\nattempt to gussy the proceedings up with a Greek chorus. It was\nsupposed to add theoretical rigor/gravitas, but just winds up coming\noff like cheap VO exposition of dubious scientific provenance, writ\nlarge.<br><br>There is a mythic element, and it's the ongoing play on the concept of\na young woman moving toward an inadvertent, human-manufactured\ngoddesshood, a la Dr. Manhattan. OK, that's sort of cool, and the film\ndoes deliver something compelling on that myth. It redeems the flick a\nlittle. But it still doesn't feel like enough. It's not an adequate\nbasis for a 90-minute sitting.<br><br>In general, I found the film weak, and weakness in a film irritates me.<br><br>I can't recommend it.\n"},
{"review": "\nI think this movie proves that two halves of a half-decent idea don't\neven half a decent movie. <br><br>I don't really care about the current fashion for checking with Albert\nEinstein or Charles Darwin to ascertain if far-fetched SF stories are\nactually plausible (witness film critics currently checking their\ncosmological constants in order to test if Interstellar is actually\nscientifically feasible), but I do care that the stories themselves\nhave something worth watching. <br><br>From the beginning I felt Lucy was a messy, poorly paced, and (sorry\nScarlett) poorly acted melange of confusing visuals, half-baked plot\nlines and unnecessarily unpleasant characters, particularly, and\nespecially, Lucy herself. <br><br>Whatever residual sympathy one might have for high-tec surgical drug\nmules (which is obviously considerable) is wiped away in a moment when\nLucy shoots dead an unconscious patient during surgery, and a dozen\nother rather wanton, gratuitous, and not even particularly entertaining\n\"action\" scenes.<br><br>The one thing I would say in \"Lucy\"'s favour is that the action doesn't\nstop, it is visually imaginative, and it isn't overlong -- and I did\nwatch to the end, which is more than I did with \"Prometheus\", \"Noah\",\n\"Olympus Has Fallen\" or \"White House Down\" and all the other recent\nidiotfests that have polluted the celluloid in the past couple of\nyears.<br><br>4/10, no better.\n"},
{"review": "\nI was not bored during the show of that film - but not too excited\neither. The story is forgettable, the action is about as good as\nexpected but certainly nothing special.<br><br>The acting is kind of flat and did not motivate me to care too much for\nthe characters. The idea of expanding the brain capacity and capability\nwas something i did not like much - considering that it reminded me on\nthat silly theory that \"humans only use 10% of their brain...\" which is\nkind of rubbish - and has been proved wrong many times.<br><br>Well, there are many better movies out there - but on a video night\nwith friends (and alcohol) - it might do.\n"},
{"review": "\nIf you, like me, enjoyed Morgan Freeman talk about science in a most\nAmerican way (where all aesthetic means points at the same thing), you\nwill also be entertained by 'Lucy'. Enough Said. Go see it.<br><br>The story line is a theory in itself using the body of Scarlett\nJohansson as a nice piece of wrapping paper. Hereto is added some\naction scenes and xenophobic group of evil doers. Adding the sound of\nEric Serra, who's quite good at making these straight-after-the-book,\nmakes it a piece of science theory made interesting. <br><br>I expected the bad story and the annoying voice of Scarlett Johansson\nwould annoy me and it did! It didn't disturb me so much as I expected\nthough... I just ignored it. It's watchable.\n"},
{"review": "\nIt was an OK film. I was rather bored by the explanations of what\ndifferent use of brain capacity looks like and could have done without\nthe section of wildlife videos. I liked the premise and how the story\nwove. It had some slick moments and some good effects, When it focused\non the main character it got better. I liked the ending even thought it\nwas slightly Matrix-ish. <br><br>Scarlett Johansson did a good job and the more the part developed, the\nmore I liked her. However, I din;t know what Morgan freeman was doing\nin that film (not a lot) because he had a rather nothing part and had\nno chance to show his acting skill. He seemed to have fallen into\nStooge Scientist With Famous Face character.<br><br>Don't go out of your way to watch it but if you can get past the animal\nplanet excerpts then it's not too terrible.\n"},
{"review": "\nThe idea behind 'Lucy' is interesting enough: what will happen when\nmankind uses more than the common 10 to 15% of its brain-capacity? For\nthis idea producer Luc Besson researched in the world of science,\nhaving the positive effect of it showing all over his movie.<br><br>So far so good. However, Besson was less happy in thinking that a\nsubject like this could result in anything more than a common science\nfiction-film. Not even a prominent lead like Scarlett Johansson is able\nto lift 'Lucy' from its corresponding flat story.<br><br>Which inevitably brings us to the conclusion that Johansson wastes her\ngreat acting talent here. Or to be more precise: the more Johansson\nmoves away from mankind's common 10 to 15% capacity, the more her\nacting vanishes into thin air. It is no surprise that Scarlett\nJohansson's characteristic down-to-earth performance comes out best in\nthe beginning of this film.\n"},
{"review": "\nAn action movie with an interesting concept and a beautiful lead\nactress, what's not to like about this movie? Well, personally one of\nthe main problems I have with movies is when the main character isn't\nlikable (unless they are meant to be horrible) but even then some bad\nguys are likable.<br><br>Lucy is put in a tough situation at the beginning of the film and from\nthere the story goes. Drugs are put into her stomach to transport but\nafter getting kicked in the stomach 3 or 4 times they leak into her\nblood stream and she becomes a butt kicking machine with the smarts of\nAlbert Einstein times 100.<br><br>She quickly is able to find a professor played by Morgan Freeman and\nasks for his help and opinion on what is going on. Obviously Freeman's\ncharacter is astonished and very curious. The rest of the movie is the\nbad guys trying to get their drugs back. Lucy was 1 of 4 \"packages\" and\nshe's stopped them from getting to there destinations.<br><br>While Lucy is trying to find answers, she's not very kind and doesn't\ncare much about other people and the consequences she leaves behind.\nWhat happened to her was terrible but before she's injected with this\ndrug we didn't know much about her other than she seemed a bit trashy\nand not someone who you would particularly like. It's not that I didn't\ncare about the character, it's that she didn't seem to care about any\none else either which made her somewhat not likable.<br><br>The action and premises were great and I really enjoyed most of the\nmovie. But the ending was a bit weird and abrupt for me but I guess it\nmade sense if you really think about it. A solid action film.\n"},
{"review": "\nWe use less than 10% of the brain's actual power, what could possibly\nhappen if we used more than that is what the film based its story upon.\nSounds exciting? Definitely! As you start to watch the film, the\npromise is definitely there to explore the uncharted territories of the\nhuman mind but no, do not expect some thought provoking , mind\nstretching imagery on a theory that has intrigued scientists for\ndecades. Not from director Luc Besson, you would not expect a film that\njust touches the surface of the power of the human mind. Instead we are\ntreated to standard cheap action sequences that make Scarlett reprise\nher tough girl image from the avenger movies and soon the movie drops\nto the level of the weekly mall movie tripe. Without putting in a\nspoiler: the ending of the movie is the most laughable, incredibly dour\nand stupid ending that would make even the least cynical viewer cringe.\nAgain, IMDb ratings are misleading? 6.5 for a piece of trash? Come on ,\nIMDb!\n"},
{"review": "\nThis is a huge disappointment for a Luc Besson film. The director of\nThe Fifth Element and Taken. Lucy is a movie with a really dumb premise\nthat has already been de-bunked. What if you can use 100% of your\nbrain? Even if we only used 10% and somehow achieve maximum usage, we\nwould very likely not be doing what is depicted in this movie. The main\ncharacter is an American student named Lucy (Scarlett Johansson)living\nin Taiwan who manages to get herself in a drug trafficking operation as\na drug mule. The drug that is put in her is experimental. After the\ndrug package breaks inside her body after a physical incident with a\ntrafficking henchman, the drug gives her the ability to do anything you\ncould imagine by the time she achieves 100% usage in their brain.\nThat's pretty much it. Morgan Freeman co-stars as a Scientist who is\nbasically in the movie to explain the whole \"100% of the brain theory\"\nlike a Science Channel program. I'm not even kidding about this. This\ngoes alongside an action-adventure as Lucy finds out what is going on\nwith her as the Korean gang that made her a mule tracks her down. The\nmovie itself is short with a gimmicky, stupid premise put in with some\naction and even sprinkles of philosophical dialogue about humanity\nthat's also present. LUCY may not be as bad as a DVD rental but I\nwouldn't waste time buying it.\n"},
{"review": "\nI actually like the premise of Lucy being hyper-aware/-sensitive,\netc... but I feel it paints science in a fairly bad light, suggesting\nit relies not only extrinsically, but intrinsically on hypotheses for\ntheories to be applicable. A hypotheses in itself has no application,\nunless it has predictive (not explanatory) power. I think the movie\ncould've been much better for me if it weren't trying so hard and\novertly. I didn't like the cut-scenes, score, etc very much. Way too\nmuch drama for me. Had nothing against the grit which is fairly good.\nMin-sik Choi has a good performance. I think Scarlett Johansson did\ntoo, for the most part.\n"},
{"review": "\nIt's been a long time since I've seen such a hard swing with such a\nloud miss. \"Lucy\" truly deserves an A for effort; and in the world of\nthis film, effort probably does start with the letter \"A.\" After all,\n1+1 does not equal 2, life did not begin 3.5 billion years ago (only 1\nbillion); and dolphins use twice as much of their brains as humans, Oh,\nand cerebral metastasis (AKA cancer) gets you high and gives you\nsuperpowers. <br><br>Now, despite what you may think, I highly recommend this film. For any\nof you who have not seen it, I promise, you are missing out on a once\nin a lifetime opportunity. It is a brilliant, postmodernist masterpiece\nthat subverts any universal presumptions, through an incongruous\ncombination of speculation, suppositions and searing bullshit. <br><br>Luc Benson's \"Lucy\" (starring Scarlet Johansson in the title role)\nfollows an American student in Taiwan. She quickly gets kidnapped by\nKorean gangsters who place an experimental, synthetic hormone inside\nher stomach, with the intent of making her a \"drug mule.\" The drug,\ncalled CPH4, winds up leaking into her bloodstream, allowing her to\naccess 100% of her brain. <br><br>I went into this film expecting to experience your basic summer\nblockbuster action film. I didn't expect or want a science lesson. I\nwanted to see Scarlet Johansson kick some ass! I wanted to get swept up\nin silliness at moments, cling to my chair at others and have my jaw\ndrop so low in awe at some innovative stunts. <br><br>Needless to say, action films are not what they used to be. There are\nno more iconic Donna Keegan, (doubling for Jamie Lee Curtis) hanging\nfrom helicopters (\"True Lies\" 1994), nothing that stays with you at all\nfor that matter. <br><br>So what happened to the action film today? <br><br>Surely nothing iconic is being created on the level we used to see.\n"}
]