[
{"review": "\n... because by the time the credits roll and you start to breathe\nnormally again, you will suddenly realize that this was not a horror\nfilm as such, this was a re-enactment of events that actually happened,\nwith real victims and real perpetrators and real well-meaning third\nparties covering up the whole thing as fast as the body count kept\npiling up.<br><br>And then you will once again have difficulty catching your breath.<br><br>As a film it is superb. McCarthy who did double duty as writer and\ndirector deserves acknowledgement. The cast is universally excellent.\nRuffalo gives the performance of his career, Keaton is solid as a rock,\nand McAdams reaps overdue dividends from her decision to broaden her\ncareer into non-glamorous roles at a time when the only scripts they\nwere sending her were for Diva parts. Smart lady.<br><br>A reviewer is not supposed to interject personal feelings in a review\nbut I will say without apology that I miss films like these -- films\nthat speak for the injustice in society and offer solutions -- and wish\nthere were more of them. It seems that when I was younger there was a\nlot more interest in doing the right thing merely because it was the\nright thing. This no longer seems to be the societal meme, and that\ntroubles me.<br><br>A must-see.\n"},
{"review": "\nThis movie undid something inside of me. It's that part of you that\nholds on to hope that people can be good, that there is hope for\nhumanity. I knew the basics of it when I went to watch it: that it is\nabout investigative reporters looking into a story of abuse in the\ncatholic church. And it uncovered so much more than just that.\nHonestly, this movie should be seen by anyone who seeks the true face\nof the world. We don't live in a pink bubble of happiness. F*cked up\nthings happen to people all the time; worst thing is when it happens to\nthe innocent. The little ones who can't protect themselves. When they\nare robbed of their faith and their hope and their future. Sitting in\nthe film theatre on the last row, I was brought to tears as in front of\nme a long list of places where victims spoke out was scrolling. I was\nboth shocked and mad. I felt sorry that people can fail so miserably.\n\"Mike Rezendes: They knew and they let it happen! It could've been you,\nit could've been me, it could've been any of us.\" Indeed. When we\nwitness darkness and we shut up and we don't do anything about it,\nthat's when we fail. A poet once wrote, \"You can join the millions\ntalking in the dark. Or you can stand up and scream light, out into the\nnight.\" So choose to stand up. In your profession choose to eradicate\nthe oblivion of evil. This movie is a masterpiece. From the dedication\nof the actors to their roles, to the script, the director and the\ncinematography. The score? Fantastic. Howard Shore did it again!\n"},
{"review": "\nEverything about this movie is outstanding -- the performances, the way\nthe true events are handled, the cinematography. In this day of digital\nnews, this movie makes us stand back and realize what we may lose in\nthe way of investigative journalism as we slowly kill off print media.<br><br>The lengths the directors go to to achieve a sense of authenticity is\nremarkable. We are there in Boston in 2001-2002. We get to know enough\nabout each character to make him or her real, but not enough to create\nside dramas. The focus remains the child abuse scandal in the\narchdiocese in Boston. That reflects the conflict the characters face\nand deal with when events make them rethink the focus of their article.<br><br>The movie is riveting, though we know the outcome.\n"},
{"review": "\nI've rated almost a hundred movies and I've only ever given out six 10s\non this website. I don't rave about many movies and I am tough to\nplease when it comes to film, but this film is absolute brilliance. It\nis flawless. This one earns its 10 and it is one of the best films I\nhave ever seen. <br><br>Everything about this film is brilliant. The camera work is great and\nthe score is underrated. However, what makes this film is an absolutely\ngenius screenplay that is acted to perfection. This script will rock\nyour world. I am not Catholic. I didn't grow up in a deeply Catholic\narea, but this film still affected me greatly. Everyone should see this\nmovie for that reason. That is something that you have to see for\nyourself. <br><br>However, I'd like to focus a little more on the technical aspects.\nBeyond the fact that the subject matter is heavy and extremely\nimportant to American and world culture, this movie does everything\nelse right. The acting is absolutely phenomenal. This is particularly\ntrue for Ruffalo and McAdams. I adore the subtlety with which they both\nact. It is brilliant. There isn't much more to say. This film is pure\nbrilliance from its opening frame to its closing moment. For both\ncinematic and cultural reasons, this is a film that every person should\nsee.\n"},
{"review": "\nThroughout the year I watched many movies and by the middle of the year\nI was finding it hard to watch a movie. I really had to force my self.\nI thought my love for movies is dying and I'm more of a TV person now. <br><br>I was wrong. <br><br>This movie (and the big short) proved to me that it wasn't me, it was\nactually the movies I've seen this year.<br><br>This movie has it's flaws for sure. But the acting, script, direction,\ndesign and pace of the movie adds a lot to an already strong and heart\nbreaking story. I was on the edge of my seat and even after the movie\nended I couldn't move for a while. <br><br>A well made film that I recommend to any drama fan. It certainly helped\nme find my love for movies again.<br><br>Even with it's flaws I give it a 9.5\n"},
{"review": "\nIt won best film, deservedly so. This is a film that resonated with me\nlong after I watched it. The complicated tale of the investigation of\npaedophile priests in Boston and the publication of it is told in\nriveting fashion by Tom Macarthy who does not waste a frame or a scene\nto anything less than the plot or character development. I never felt\nthe running time or in any way disbelieved any of the actors in their\nportrayals.<br><br>Keaton seems to be on a total roll at the moment and he is excellent as\nthe head of Spotlight but the whole ensemble seemed to put in a real\nshift. This felt like a documentary at times and I could feel the\naudience around me leaning forward as each new revelation is uttered. <br><br>Just brilliant.\n"},
{"review": "\nGoing into the theater to see Spotlight, I had read the rave reviews\nand knew I was in for something special. This movie did not disappoint!\nBeing from Boston, this movie really made me think about my life\ngrowing up, as a lot of \"what ifs\" came to mind. \"What if\" I went to\nchurch every Sunday...\"what if\" I was gullible enough to have a priest\nlure me into his lair. Spotlight goes straight to the heart of this\namazingly sad (and apparently never-ending) saga of the Catholic church\nand the amount of abuse priests have inflicted on hundreds of victims.\nThe acting is all-around fantastic, from Mr. Keaton to some actors that\nI am not familiar with, which is an aspect of this fine movie that\nmakes it so profound. Tense throughout, I was saddened to hear that\nthis abuse is an epidemic and probably will never be stopped. The\nexclamation point was when a member of the audience stood up and told\nthe rest of us \"...I am a survivor...\" WOW...\n"},
{"review": "\nBrilliantly acted, directed, and written, I just found this riveting\nand important film to be truly exceptional. Much of it is done in a\nlow-key style, as layer after layer of the abuse by Catholic priests\nand subsequent cover-up by the Boston Archdiocese as well as other\npowerful interests, is uncovered by the Spotlight investigative team of\nthe Boston Globe, in the early 2000's.<br><br>I haven't yet seen all the movies nominated for the Best Picture\nAcademy Award in 2016, but I can certainly see how this one won it, as\nwell as winning Best Original Screenplay by Tom McCarthy (who also\ndirected) and Josh Singer.<br><br>Overall, just an outstanding motion picture that I would recommend\nhighly.\n"},
{"review": "\nI liked this film, thought it was a well done solid film. But I am\nafraid I can't say anything more than that, it is very documentary like\nwhich can be it's biggest strength (a very fact driven plot heavy film)\nor it's biggest weakness (characters feel cold and distant and other\nthan the plot nothing really impresses, also quite bland in the visuals\ndepartment). However the characters do start to show some life nearing\nthe end of the film but by that time damage is done it can be hard if\nnot impossible for viewers to differentiate between the reporters for\nnearly one and a half hour of the film, they all suffer from different\nfaces but same objective syndrome and inadequate effort is made to\nseparate one from the another. Also speaking of run-time, this film is\na wee bit over two hours long, editing especially in the first half\ncould have made this film a bit crispier. However I did like the\naccuracy level in the film regarding the cellphones, ads, electronics\nand the cars used in 2001; a lot of films these days are becoming very\ncareless in this regard. I would compare it to last year's Foxcatcher\nanother fact driven docu-drama film, solidly acted, but nothing special\nin the direction, editing and cinematography department, I would still\nrecommend it but no way this film deserves a second watch, you can\nabsorb everything there is to get in a single viewing. All in all, a\nsolid well written docu-drama which will have it's time in the\n\"spotlight\" (pun!) this Oscar season and will become \"oh that movie\nabout pedo priests\" by next year's Oscar season.\n"},
{"review": "\nI get why movies like this get nominated for Best Picture and why\ntopical pictures get so much attention and star-studded casts. It's an\nIf this worth an Oscar...how it won best picture is beyond me!!!!\nSeriously though, it's just dull. There is nothing in this movie that\nis cinematically interesting. Just scene after scene of people in\nvarying states of agitation either reading or speaking. Compare this to\na movie like Steve Jobs (2015) which is also very dialogue heavy and\nnote all the various ways in which Boyle and crew aid their dialogue\nthrough camera movement, interesting angles and shadowing, etc. It\nmakes you realize how thoroughly uninteresting Spotlight is in that\nparticular way. Spotlight could have been done as a picture book with a\nfew sentences of dialogue per page and Mark Ruffalo's happy face or sad\nface plastered on top.<br><br>3 stars though just because a very interesting subject.\n"},
{"review": "\nFor me this film was beautifully tragic; by this I mean it was a\nfantastically acted film and gripping; but I'm disgusted and mortified\nthat it actually happened.<br><br>It was good that the film focused on how the conspiracy into the abuse\nwas covered up; for me it was a preference than focusing on the victims\nand bringing any more agony to them. It brought a tear to my eye to\nknow the depths that this went on (and probably still does) and the\nnumber of victims that were involved. As someone who has a criminology\ndegree with a focus on child abuse this film was particularly poignant.\nI was appalled at the end to see that the cardinal for Boston was moved\nto a high ranked job in the Vatican; when it was clear from scenes and\nevidence brought up in the film that he was aware. The end provides a\nlist of places where it has been uncovered; this is heartbreaking. <br><br>Mark Ruffalo was fantastic in this film, however, for me the stand it\nperformance was from Michael Keaton as the 'Spotlight' team editor. <br><br>For me it was first 10/10 of the year (2016)\n"},
{"review": "\nAs a screenwriter this movie really upset me - a bunch of journalists\nexpose a case, where hundreds of children have been molested by\npriests, and covered up by the church. How do the journalists expose\nit? they call up a bunch of guys who said it before, but nobody\nlistened to them. No doubt it's an important story, however I didn't\ndetect any brilliant journalism - this is not All the President's Men,\nnor is it The Verdict where Paul Newman battled against the church.\nSpotlight reporters never stray in the dark or risk anything - the\nstory is basically handed to them on a silver platter, and they only\nverify it. Drama? hell with it. worst of all - No brilliant cinema, no\nactions, just dialogue about this and that, we hardly get to know the\ncharacters outside of work, so we don't care about them. Bottom line is\nthat this horrible case leaves hardly any impact. By the end of the\nmovie you just realize that there have been pedophile priests. Didn't\nwe already know this? No climax, no anticlimax, no heroes to root for.\nHell I don't understand the raving reviews.\n"},
{"review": "\nFirst off, this is an important film. The fact there's such a rampant\nsystemic issue with an organization as large as the Catholic Church is\nappalling. The issue was known, but Spotlight highlights the story of\nthe brave men and women who had to invest copious amounts of effort\njust to tell the world about it. This movie is brilliant all across the\nboard: the performances, the cinematography, the story, the dialogue,\nthe direction, and just about everything in-between. If you're\nCatholic, please understand this movie is NOT an attack on Catholocism,\nbut mainly a film exploiting a systemic issue in the Catholic Church.\nIf anything, Catholics should be more outraged than the rest of us, but\nI digress. Spotlight is a beautifully realized film with a very obvious\namount of blood, sweat and tears put into it. From the geographic\naccuracy of Boston and other areas around it, to the details of the\nstory, to the portrayals of the characters, Spotlight is a\nnigh-flawless product that not only excels on a technical level, but is\ngoing to have relevance for many generations to come.\n"},
{"review": "\nAs several other reviewers have stated here, Spotlight is a \"solid\"\nfilm. There is absolutely no fault with the actors, who all acquit\nthemselves very well, and the movie itself never drags.<br><br>However, there's really no character in the movie whom the audience can\nlatch onto. It's a terrific ensemble, but the fault, I think, lies in\ntrying to give everyone in the ensemble an equal part in the story.\nWithout making it about one person (whether a reporter or a victim),\nthe emotional impact falls very, very short.<br><br>What the viewer is left with is a general notion of, \"It's shocking\nthat went on for so long and the church kept covering it up,\" but zero\nemotional investment and reaction. Unless you have a personal\nidentification with any of the elements in this story, I think you will\nremain similarly aloof in regards to this film.\n"},
{"review": "\nThis movie is one of the finest movie I have come across in recent\npast. The movie is based on true event and it is very important to\nacknowledge the research work made while making the movie. It will not\nleave to a second on which you say its going over the top. The inside\nof newspaper industry covered so well. Some of the punchline and scenes\nare best on its own. As the movie move forward you go along with it and\nif you don't have any background about the movie before you start you\nwill also realize with the cast that \"how big this story is?\" Time and\nagain it remind you the importance of newspaper and the hard work put\nin a lead to make it a story. Last but important part I would like to\nhighlight that this movie does not left any stone upturned. The same\nnewspaper did not look into the evidence send by same people in past\nwhich make you think its not you who is upgrading your knowledge but\nits a newspaper who decided what truth you want to hear. My best wished\nto the movie and hope it will do great.\n"},
{"review": "\nGarnered awards and horrifying subject matter put aside, take a look at\nthe movie poster for \"Spotlight\". It's a still image of the principal\ncast hovered over a cluttered desk in a small room. It's not flashy,\nbut still an incredibly effective piece of advertising. You know in an\ninstant that this is a journalism movie; die-hards in rolled-up\nshirtsleeves working all hours to unearth a national scandal. I am an\nabsolute sucker for this.<br><br>The scandal herein is the systemic cover-up of pederasty within the\nCatholic Church. To that end (even though a lot of the dialogue in this\nmovie is come-from-behind startling), one line in particular jumped out\nat me: \"They say it's just physical abuse but it's more than that, this\nwas spiritual abuse. You know why I went along with everything? Because\npriests are supposed to be the good guys.\" This isn't just a story\nabout the crimes committed, but there's also sensitivity towards the\nvictims themselves. I dunno, I just found that line deeply unnerving.<br><br>But when all is said and done, this movie runs on the grueling\nnuts-and-bolts detective work of investigative journalism; a uniformly\nexcellent cast, great writing and tension that continues to build.<br><br>Amazing stuff.<br><br>9/10\n"},
{"review": "\nI was deeply affected after watching Tom McCarthy's\nbased-on-a-true-story movie 'Spotlight'. After I left the cinema hall\nin my town I felt some kind of unease inside me. This feeling was\nprovoked not only by the fact that the movie is based on a terrifying\ntrue story but also by how the actors accomplished to bring this story\nto life with ravishing performances from Mark Ruffalo (Mike Rezendes),\nMichael Keaton (Walter 'Robby' Robinson), Rachel McAdams (Sacha\nPfeiffer) and Brian d'Arcy James (Matt Carroll).<br><br>'Spotlight' follows the story of an investigation, conducted by the\nteam 'Spotlight', working for the daily newspaper - Boston Globe. The\nteam of 4 investigating journalists brings to light a 30-year-old\nsecret that has its roots deeply in the Chatolic Church hierarchy. A\nstory, about child molestation, which nobody can be indifferent to.\nMost of the molested back then kids - 30 years later with kids of their\nown, had been through many obstacles due to the ghastly immoral act.\nSome of them had taken the path of the syringe and drugs. Others had\ngone crazy and schizophrenic and the other part had killed themselves\ndue to maybe the embarrassment they had to live with for the rest of\ntheir lives afterward.<br><br>Most of the kids, who were molested would not talk about the act,\nbecause they were in some way petted by the priests and were too scared\nand too abashed to talk with somebody about this. Tom McCarthy's\n'Spotlight' shows us the importance of the investigating journalist's\nwork and also that they have the power to unfold great mysteries to the\npublic no matter how dark and horrifying the mysteries are.\n"},
{"review": "\nIn the past 5+ years, I've read articles about the decline of cinema\nand the great successes of Television. There's no denying that there\nhave been some wonderful TV/web series in recent years, but I think a\nfilm like Spotlight is the refresh button that moviegoers have been\nlooking for. The story is compelling, the acting is unnoticeable, and\nthe script seems to flow the way a real conversation would. The writers\nand director of this film are the \"Spotlight\" of filmmaking, opening up\na sensitive story that people acknowledged but probably couldn't\nimagine on screen, and they brought it to us in a way where I felt all\nthe emotions of someone finding out the truth for the first time. I\nwatched Spotlight at the Zürich Film Festival and after 2 hours,\nthought it ended too soon. The only negative thing I could think of was\nthat those French &amp; German subtitles were really getting in the way.\nMaybe next time, the director could remove those ;)\n"},
{"review": "\nThis revealing drama is directed by Tom McCarthy, who also co-wrote\nwith Josh Singer. Winning the Best Picture Oscar brings about much\ndebate. The two hours plus film at times lumbers, but is saved with\ntalented acting. A team of crack Boston Globe reporters spend the best\npart of a year to reveal a string of cover-ups that goes back decades\nthat exposes the Catholic Archdiocese history keeping to be very\nrelaxed and void of child molestation reports and dozens upon dozens of\nhidden or overlooked complaints of clergy-initiated abuses. Many\nwhistles may have blown, but went ignored being heard.<br><br>A tremendously talented cast made SPOTLIGHT award worthy: Mark Ruffalo,\nRachel McAdams, Michael Keaton, Liev Schreiber, Elana Wohl, Paul\nGuilfoyle, Stanley Tucci, Jamey Sheridan and Billy Crudup.\n"},
{"review": "\nEveryone needs to see Spotlight. The writing, direction and acting are\nall flawless. The story is totally engrossing.<br><br>I never quite 'got' why the courts and the media are now going after\nthe Catholic Church hierarchy, rather than going after the pedophile\npriests. This movie answers that question.<br><br>What it doesn't answer is why the Church hierarchy didn't just de-\nfrock the pedophile priests, rather than move them from parish to\nparish. Kicking them out would have STOPPED the abuse rather than just\nMANAGING the abuse. It would have sent a message to other pedophile\npriests and actually done something to fix the problem rather than\nperpetuate it. <br><br>The other question I have is this: the vast majority of people in all\nchurches and all religions are good people, doing good work with good\nintentions. How could Catholic Church hierarchy have allowed the\npedophile priests to remain in the Church when they knew that children\nwere being abused. How could they have allowed the children. How?\n"},
{"review": "\na powerful look at how a team of reporters from the Boston Globe took\non the Catholic Church in 2001, \"Spotlight\" is not only gripping but a\ngreat introduction to Journalism 101, making it easily the best\nnewspaper film since \"All the Presidents Men\". The story jumps to 2001,\nwhere new editor Mary Baron (Liev Schrieber) is brought to the\nnewspaper from Miami to jump-start the papers performance. Among the\nvarious departments is the investigative small unknown SPOTLIGHT. Its\noverseen by Michael Keatons character. In his department is the\noutstanding Mark Ruffalo and Rachel Mcadams. While working a case they\nare alerted to a story alleging rampant abuse of children by a local\npriest. Intrigued they begin investigating, slowly uncovering victims\nand learning that higher members of the Church conspired to keep things\nquiet. The film, like the investigation, reveals secrets little by\nlittle, keeping you fully engrossed in the story. The script is helped\nby an amazing cast. Ruffalo seems Oscar bound here. Overall this is a\nmust see and a highly watchable film. bravo\n"},
{"review": "\nWent to see this movie because I heard it being compared to 'All the\nPresidents Men'. From start to finish I was engrossed in this movie.The\nacting was superb,Mark Ruffalo really played his part with passion. The\nsubject of the movie,clerical child abuse, is harrowing,but nonetheless\nit is a story that has to be told. We should never forget all those\nchildren who for decades faced abuse at the hands of priests whom they\ntrusted and looked up to. It is sickening to to see in the movie how\nthe Catholic church tried at every turn to cover up the abuse\nperpetrated by its priests.'Spotlight' brings the stories of abuse\nvictims to light,and while there is good and bad in everyone,those that\nabuse the trust others put in them should be prosecuted and not have\ntheir crimes covered up,whether it be by the Catholic Church or anyone\nelse.I would highly recommend this movie,go and see this.While their is\na sad story being told the actors and director brought this story to\nlight vividly. There is a tension in the movie that keeps you\ninterested until the very end.\n"},
{"review": "\nIn 2001, the Jewish editor Marty Baron (Liev Schreiber) is hired by The\nBoston Globe and he asks the Spotlight team to investigate the priest\nJohn Geoghan that was accused of abusing children and the lawyer\nMitchell Garabedian (Stanley Tucci) that has told that Cardinal Law\n(Len Cariou) knew what his priest did. Walter 'Robby' Robinson (Michael\nKeaton), Mike Rezendes (Mark Ruffalo), Sacha Pfeiffer (Rachel McAdams)\nand Matt Carroll (Brian d'Arcy James) are fully supported by Baron and\ntheir leader Ben Bradlee, Jr. (John Slattery) to set in motion the\ninvestigation of the priest and they contact the initially reluctant\nGarabedian; the lawyer Eric Macleish (Billy Crudup) that has defended\nmany victims; the leader of the victims' rights organization Phil\nSaviano (Neal Huff); and several victims that accept to meet them.\nAfter one year investigation, they confirm the names of twenty\npedophile priest in Boston and they publish the story showing that\nCardinal Law had prior knowledge of the priests' abuse of children.<br><br>\"Spotlight\" is based on a true story about the infamous Boston scandal\nwhen dark secrets of the Catholic Church were disclosed forcing the\nchurch to take responsibility for the shameful acts of some of their\npriests. The story stops with the publication of the scandal with names\nand other victims contacting the newspaper team. The screenplay,\ndirection and performances are top-notch. Just as curiosity, the\nfollowing link (http://www.historyvshollywood.com/reelfaces/spotlight/)\nshows the real face of several \"Spotlight\" characters. My vote is\neight.<br><br>Title (Brazil): \"Spotlight: Segredos Revelados\" (\"Spotlight: Secrets\nDisclosed\")\n"},
{"review": "\nAll in all it's a compelling piece of work from McCarthy, perhaps his\nbest to date. Spotlight is a zippy and mightily distracting film.\nPerformances are all excellent. \"Spotlight\" tackles a big, true and\nimportant story which really does deserve to be told. An admirable job\nof telling the events as they truly happened, showing the viewer the\nkey players and how they investigated this devastating case, from the\nbeginning to the end. No matter how close to the truth the story is,\nthe fact is that everything is perfectly compelling. The thing that\nmost people will be likely to remember is that the vents are gripping,\nforcing the audience to be glued to the screen. \"Spotlight\" does tell\nan important story and for its two-hour runtime, the film is perfect.\n"},
{"review": "\nFor me this film was beautifully tragic; by this I mean it was a\nfantastically acted film and gripping; but I'm disgusted and mortified\nthat it actually happened.<br><br>It was good that the film focused on how the conspiracy into the abuse\nwas covered up; for me it was a preference than focusing on the victims\nand bringing any more agony to them. It brought a tear to my eye to\nknow the depths that this went on (and probably still does) and the\nnumber of victims that were involved. As someone who has a criminology\ndegree with a focus on child abuse this film was particularly poignant.\nI was appalled at the end to see that the cardinal for Boston was moved\nto a high ranked job in the Vatican; when it was clear from scenes and\nevidence brought up in the film that he was aware. The end provides a\nlist of places where it has been uncovered; this is heartbreaking. <br><br>Mark Ruffalo was fantastic in this film, however, for me the stand it\nperformance was from Michael Keaton as the 'Spotlight' team editor. <br><br>For me it was first 10/10 of the year (2016)\n"},
{"review": "\nSo I watched this on the plane, had plenty of time to kill, because it\nwon an Oscar, yet it was as exciting as watching paint dry...<br><br>We get it that the subject matter is controversial and it's an\n\"important event\" in reality. THAT DOESN'T MEAN IT MAKES IT A\nPLEASURABLE ENTERTAINING FILM (and no, I don't need Michael Bay or\nridiculous 'Taken' action sequences; I'm looking for a story that has\ngreat build-up, brings in different emotions, blows my mind or puts me\non the edge, etc). You say 'WHAT?! You don't find people in the church\nraping young children finally being exposed by a local newspaper move\nyou in anyway?!\" The real-life story/subject matter, yes... but NOT\nthis film. <br><br>If your \"enjoyment\" is just observing a depiction of what we already\nknew and was established, then this is for you.<br><br>There really are no satisfying or shocking moments/ending. What you see\nis what you already know... you don't really get anything out of it.\nThe journey does not flow well. How can anyone find this movie\n\"shocking\" when we already knew about the premise and it really adds\nnothing new to it? I mean, for a movie like TITANIC, we KNOW the ship\nis going to sink, but the EXPERIENCE of the film made it worthwhile.\nSpotlight fails on the EXPERIENCE. It is as boring as observing a\nmeeting at an office. <br><br>For this to win an Oscar just meant they like to give awards to the\n'underdog' or just simply because of the controversy subject matter.<br><br>This film is on the same level as when 'The Artist' won Oscar - another\noverrated boring film (probably forgotten by most people by now; as\nmuch as I can enjoy black and white films) - which just simply won more\nfor the IDEA than the quality of the film. <br><br>Skip it.\n"},
{"review": "\nHaving watched this on a plane, and not fully finishing it (and missing\nsome parts because I was nodding off), this review is based on my\nimpression of the parts that I did watch. <br><br>Based on a true story, Spotlight does well at giving a pragmatic\naccount of what actually happened. I'm not very sure at which part I\nstopped watching (and which parts I missed) but from what I saw, the\nprogression of the film seemed to take a while. Also, because it dealt\nwith an industry I don't know much about, most of the technical talk\nwent over my head.<br><br>I mean it's great that they're bringing this story to light, but I was\nnot following along that well. The cast did a good job at playing their\ncharacters though, and it was great to see A-list actors playing\ncharacters outside their typical roles. As well, the mise-en-scene did\nwell in setting the atmosphere of the movie.\n"},
{"review": "\nDid SPOTLIGHT deserve to win Best Picture at this year's Academy\nAwards? Maybe, I guess. I still haven't seen all of the nominees yet,\nbut even still I recognize that SPOTLIGHT is an excellent film. Based\non true events, it tells how the Boston Globe broke the story about a\nmassive cover-up of pedophile priests in the Catholic Church. It also\nfeatures an incredible ensemble cast who, although not given much to do\nindividually, work great together in service of a very compelling (and\nsaddening) story. Out of the five actors given top billing, I would say\nthat Liev Schreiber and Mark Ruffalo fare the best, although the rest\nof the cast don't slouch by any means. Rachel McAdams is perhaps the\nweakest out of the bunch, but even she mostly holds her own. Far and\naway, the most important takeaways are the devotion to pursuing the\ntruth no matter where it leads you, as well as the integrity necessary\nin investigative journalism. Some people have called this the greatest\njournalism movie since ALL THE PRESIDENT'S MEN, but I still need to see\nthat in order to make such a comparison. Briefly touching on other\nmatters, I thought the score and cinematography were quite adequate\nenough to elevate this beyond something that would normally play as a\nmade-for-HBO movie. In particular, I liked the use of substantial\ntracking shots, which visually reinforced the winding and\ninterconnected paths that the Globe's spotlight team go on in pursuit\nof their story. Ultimately, there is a lot in here that could shake\none's faith in humanity and human institutions, particularly religion,\nhowever I never felt like they demonized anyone. It merely acknowledged\nthe imperfections and, some of the time, willful negligence of said\ninstitutions and the communities they serve, while also aspiring to\nbetter accountability in both. Best Picture winner or not, SPOTLIGHT is\nhands down one of the best that 2015 had to offer.\n"},
{"review": "\nThe journalism and print media have a hard time in the present times of\nonline informations everywhere. The events of \"Spotlight\" at the\neditorial staff of The Boston Globe happened 2001, when the internet\nwas new to the big crowd and journalists had time for deep research\nwork because of a lot of print readers (and enough money available for\ngood work. Because when things run massively wrong in society, like in\nthis terrible case at the Catholic Church, it needs dedicated people,\nwho look deeply behind the smokescreen. The movie shows, how difficult\nit is, to mess with established institutions like the church, because\npeople don't want to know, that with this savior they believe in,\nsomething totally going wrong. The members of the Spotlight team are\ntrue heroes, working in the background. The movie put a spotlight on\ntheir outstanding work.\n"},
{"review": "\nYou spotlight up my life, you give me hope, to carry on... Sorry to get\nall Debbie Booneish on you in my intro on my review of the spectacular\nmovie \"Spotlight\". Director Tom McCarthy's movie about the true story\nof how the Boston Globe uncovered the massive scandal of child\nmolestation and cover-up within the local Catholic Archdiocese is\nshaking up to the be the frontrunner of the Best Picture Oscar, and why\nnot? McCarthy's meticulous direction of the film and his layering of\nits expose was a sermonial, I mean a ceremonial piece of mastery. The\nBoston Globe's investigative \"Spotlight\" department shined on unveiling\nthis disturbing truth. What was not disturbing was the exemplary acting\nperformances from the actors playing the \"spotlight\" write players;\nincluding Mark Ruffalo as the emotional Mike Rezendes, Rachel McAdams\nas the conflicted Sacha Pfeiffer, Brian D'arcy James as the cerebral\nMatt Carroll, and the \"Birdman\" himself Michael Keaton as the group's\nleader Robby Robinson. Keaton and Ruffalo were the standouts here, but\nall should be given the proper spotlight for their commendable acting.\nOther fine thespian turns came from Stanley Tucci as the counsel\nMitchell Garadebian, Liev Schrieber as the paper's new editor Marty\nBaron, and John Slattery as the associate editor Ben Bradlee. It will\nbe very sad if this acting group does not get the SAG Best Acting\nEnsemble Award. McCarthy's script with fellow screenplayer Josh Singer\nhad all of the write stuff of a multi- dimensional narrative covering\nan uncomfortable subject matter. Sure, the film does depict journalists\nas literary superheroes, but their procedural process workings was\ntheir greatest weapon to get rid of the darkness of the subject they\nwere investigating; and it isn't that what superheroes do? or something\nlike that? Anyways, I pray that \"Spotlight' receives many Oscar\nnominations, as it should. So, it's now time for you to see and then\nshare the \"Spotlight\". ***** Excellent\n"},
{"review": "\n\"Spotlight\" is one of the best realistic and serious movies of recent\nyears. I don't want to tell the story, as you will watch it soon or\nlater, but I want to admire the movie and the content itself. Instead\nof falling into the stereotypical hero and anti-hero type of movies,\nthe movie narrates the story with realistic characters, sensual\nREALISTIC emotions and incredibly depicts the integrity and handwork of\nthe Boston Globe investigation team. The acting of Mark Ruffalo and\nMichael Keaton are great. Finally, the movie does not fall into the\ncategory of twisty blockbusters but a realistic movie about an\nimportant subject that anyone will admire.\n"},
{"review": "\nIt's not often I follow the Oscars or go out of my way to see\nOscar-winning films, because they're usually not to my taste. However,\nI can make an exception for SPOTLIGHT, a film which looked fantastic\nfrom the trailer and what I had read about it. Having just caught up\nwith it and watched it twice in a row, I can report that this is an\nexcellent piece of film-making: dark, harrowing, and grimly realistic,\nbut also thoroughly entertaining with it.<br><br>It tells the true story of the Boston Globe newspaper's exposure of\nchild abusing priests from the Catholic Church. The viewer follows the\nstory from the rumours at the outset to the very real and grounded\ninformation that comes through and the final publishing of the story.\nThere are lots of quieter moments and some eye-popping twists and\nturns, usually when the scale of the abuse is exposed. I know the\nsubject of paedophilia in film is very distasteful, but this film is\nmore about the crusading journalist team than the subject matter\nitself. In that way it harks back to classics like ALL THE PRESIDENT'S\nMEN, although Fincher's ZODIAC is also a reference point.<br><br>The calibre of this film is excellent and everything about it is very\nstrong from the cinematography to the direction. Despite the lengthy\nrunning time, this is a fast-paced feature in which no scene lasts more\nthan a couple of minutes. It takes you on a roller-coaster ride of\nfact-checking, breakthroughs, and battles against both a conspiracy of\nsilence and the American legal system. The acting is excellent across\nthe board, which is a surprise in some cases (Rachel McAdams) and\nexpected in others (Ruffalo equals and surpasses his performance in\nZODIAC). Michael Keaton also delivers one of his best performances and\nputs the old memories of a rubbery Batman far behind him. SPOTLIGHT is\na real gem.\n"},
{"review": "\nWith so many movies about investigative journalism elevating their\nprotagonists to near-godlike status, to the detriment of the film's\ncredibility, \"Spotlight\" is a welcome relief. Focusing on the Boston\nGlobe's investigation into pedophile priests' abuses and the shameful\neffort on the part of the Catholic Church's leadership - and a fair\namount of the congregation - to avoid the problem rather than fix it,\ncontributing to the life-shattering abuse of countless children.<br><br>The reporters and their bosses are portrayed as skilled, determined,\nand dogged, but still human, struggling with their own backgrounds and\nconcerns about their sources. More surprisingly, the managing editors\nand senior reporters are NOT portrayed as spineless, risk-averse\nroadblocks so common in journalism movies. Instead, the clear villain\nis the leadership of the Catholic Church and the lawyers for clients\nthat profited from settling cases ad nauseum for decades, contributing\nto the abuse.<br><br>As someone raised Catholic, this scandal didn't shake my faith in\nCatholicism but it certainly shook my faith in the institution. This\nmovie is unsentimental, avoiding subplots that would have been needless\ndistraction. In essence, this is a template for movies about\ninvestigative journalism.<br><br>Also, this is the movie that \"Kill the Messenger\" wanted to be but\ninstead fell into the normal, drama-enhancing traps (stereotyping the\nreporter's editors, stretching the facts, making the reporter a martyr,\netc).\n"},
{"review": "\nI rarely watch movies, but someone recommended this one to me as a\n\"balanced\" portrayal of the priest abuse crisis. I wasn't impressed,\nespecially after having read traditional Catholic Randy Engel's\nexcellent investigative journalism into the priest-pederast crisis, her\n5 vol. «Rite of Sodomy: Homosexuality and the Roman Catholic Church».<br><br>The film mentioned how homosexuality has nothing to do with this\ncrisis, which is not at all true (80-90% of the cases are ephebophilia,\nsodomitic attraction to teenage males, not pedophilia). It portrayed\nthe free press as the real savior of mankind (thus promoting more\nFrench Revolution, Liberal errors; cf. Pope Gregory XVI's encyclical\n«Mirari Vos»). The journalists were portrayed as \"secular confessors.\"\nI did learn one thing: The Boston Globe got its first Jewish editor,\nMarty Barton, right before the Spotlight team started running hundreds\nof stories against the Church. Conflict of interest? Balanced\njournalism? Where are the stories on pederast rabbis? Pedophile school\nteachers? etc.? In this sense, the film correctly portrayed Barton as\nbeing against \"the system\" (i.e., against the Catholic Church).<br><br>Also, Boston Globe won the Pulitzer Prize in 2003 because of its\nSpotlight team's work. The Spotlight film won an Academy Award for best\nfilm of 2015! Pattern here? Yes: Jew-dominated, self-laudatory awards\nbeing used to undermine the Church's authority.<br><br>The film's character development and artistic quality was sorely\nlacking.\n"},
{"review": "\nSpotlight is a gem, a must-see film. Spotlight was a special group of\nBoston Globe reporters tasked with taking on deep investigative stories\nthat took a lot of effort. Boy did they hit the jackpot with the\nCatholic priest scandal.<br><br>In the early 2000's, it was discovered that, the greater Boston Diocese\nknowingly allowed pedophile priests to continue working, transferring\nthem from one parish to another, and putting them in places for\n\"rehabilitation\", right in neighborhoods. This movie depicts the steps\ntaken by the reporting team, led by Michael Keaton, Mark Ruffalo, and\nRachel McAdams, to get to the truth. <br><br>Liev Schreiver also delivers as the new managing editor who comes in to\ndirect Spotlight's work when he smells the story that no one else goes\nnear. In Boston, the Catholic church is sacrosanct. But Schreiver is\nnot from Boston, so he feels no compunction to handle this story any\ndifferently than any other story of corruption and abuse of power.<br><br>Bit by bit, the reporters, working with the lawyer played by Stanley\nTucci, peel off the layers of the onion to discover the sordid, bitter\ntruth. The trail of corruption leads to the highest levels of the\nchurch, sending shock waves still felt to this day.<br><br>This is a no-nonsense film that will stick with you long afterwards.\nYou will feel disgusted and saddened by the horrible things done by\npeople who supposedly represent God on Earth. I don't think any of the\nreporters knew what they were getting into, but at the end, they were\nall emotionally shaken to get the facts.<br><br>Excellent acting by all, and wonderful, taut direction was rewarded\nwith the Best Picture Academy award, and 6 Academy nominations.<br><br>If you want to see a gripping, moving, and emotional true story, go see\nSpotlight, which sheds light on the darkest parts of the shameful,\nhidden Catholic church's behavior.\n"},
{"review": "\nI couldn't get my girlfriend to watch this movie with me, and I think\nthat's because of the subject matter, so I just want to say that this\nis not a movie full of searing, emotional moments with molested\nvictims. There are a couple of moments like that, certainly, but this\nmovie isn't about pedophilia, it's about investigative journalism, and\nthe film is tightly focused on the investigatory elements, with just a\nseasoning of victims and of reporters anguish over knowing something\nthey can't tell people (yet).<br><br>This movie is very much in the vein of All the President's Men, to the\npoint where I would expect everyone who likes one to like the other\n(although movie enthusiasm is never that one to one, so I'm sure I'm\nwrong). This movie is very interested in evidence and procedure, yet\nalso explores the way in which terrible things can be protected by the\nstatus quo, and the way powerful interests try to control the debate.<br><br>There are some sad moments, and there are many that will make you\nfurious, but overall you will be riveted by the story and impressed by\nthe acting and direction.\n"},
{"review": "\nIt's good to know when Justice prevails and its even better to see that\nthere are some people left who have put their heart and soul for\nreporting rather than doing it for selling some copies. Spotlight is\none of the best films of 2015. If you haven't seen it till now you are\nmissing on a lot of things.<br><br>The story revolves around the Catholic Church and the priests who are\naccused of molesting children ; since when nobody knows. There are\nreporters who want to discover the story and put an end to the\npredators who are using children in the name of god as there pray. The\ndirection was amazing. The acting was to the point.<br><br>A scene with Mark ruffalo being fed up to the point that he screams to\nserve justice to these scumbags will leave you in awe. There was\nnothing wrong in this movie.<br><br>Way to go Spotlight team. Respect till eternity.\n"},
{"review": "\nThe movie is a great disclosure of what is happening for a long time\ninside of Catholic Church. The picture in this case is the systematic\nconcealment by the Catholic Church in Boston of its decades-long,\nstate-wide dealings with almost 100 paedophile priests. I hope that\nthis movie will give more courage to the people who were molested to\nstep up. When I first saw Spotlight , I couldn't resist picking\nfavourites from its capable cast. And it was Ruffalo who jumped out,\nall but literally: his Rezendes is like a humanoid West Highland\nterrier, scampering into rooms to quickly get the measure of them, ears\npricked, nose twitching and wet. He gives a brilliantly calibrated\nphysical portrayal of a born investigator \u0096 in one scene, when he\narrives in a lawyer's office, he even scrutinises the chair in the\nfoyer before warily taking a seat.\n"},
{"review": "\nMichael Keaton was very impressive in 'Birdman' and when i decided to\nwatch spotlight,i googled it,looked at the ratings,realized that the\nfilm is probably good.Mark ruffalo is always a delight to watch and\nalso it was based on a true incident. The movie has a simple yet very\nstrong storyline.Rachel Mcadams' performance was brilliant, she was\nvery natural and so was keaton and ruffalo. In recent times we have\nbeen having movies which either are too much with the expense or\nspecial effects or cinematography or a complex plot which may be good\nbut is not for everyone. Spotlight is what a normal person can define\nwhat good movies should be like.The story about the investigation\njournalism which finally uncovers big scandal of molestations also\nshows us what the life of news reporters is like.Soundtrack is\ngood,gets along nicely with the theme of the film.Cinematography is\nokay too. Overall i would say it is a very good movie and i would love\nto more of this kind of films.Great work by Tom McCarthy.\n"},
{"review": "\nBy Now, Everyone who wants to Know Knows. Not so much a Decade and a\nHalf ago when Everyone had an Inkling.<br><br>This is one of those Stories that Hurts to be Told, but has to be Told\nnonetheless. A Reminder, an Underlining, a Throwback to that Thing of\nthe Past, Dedicated Investigative Journalism. <br><br>A Compelling Cast that seems Inspired and Involved in the Process of\nmaking this a Remarkable Retelling of the Now well Covered Involvement\nin a Cover-Up of Heinous Crimes committed by Clergy. Turning a Blind\nEye to Predators in Their Midst and a complete Lack of Compassion,\nAntithetical to Everything the Church Preaches.<br><br>Of Course, it was the Cover-Up that became as Horrific as the\nHorrifying Crimes and the Audacious Abuse of Power by the Smug and All\nPowerful Catholic Church. It is Certainly very Difficult to \"...say No\nto God\". The Real-Life \"Spotlight\" an Arm of \"The Boston Globe\" said\n\"No...not on My watch\".<br><br>Director and Writer Tom McCarthy must be given Credit for Not\nSensationalizing a Sensational Story. It's a Matter of Fact Style with\nFew Cinematic Overlays. The Film is a Gripping Group Effort from All\nInvolved. <br><br>Note...Took the Oscar for Best Picture of the Year.\n"},
{"review": "\nSpotlight is the true story about how the newspaper Boston Globe\nrevealed child molestation within the Catholic Church and how they\ntried to cover it up. As a student of journalism, I find this film to\nbe particularly interesting, especially the investigative journalism. I\nmentioned Spotlight in a post last summer and said that I thought it\ncould be Oscar material. Spotlight did win two Oscars on this years\nshow, best screenplay and best picture. Michael Keaton, Mark Ruffalo\nand Rachel McAdams does a fantastic job with great acting.<br><br>Spotlight never leaves anything for chance. It is a well played drama\nand as the journalists digs up new clues, the film itself always moves\none step closer to the truth. Even if we already know how it will end\nand just how bad it actually was, I still get pulled into the\nexcitement. Films like Spotlight has a dramaturgy with a constant\nforward motion and rewards for the audience in form of small clues we\ngradually figure out. These films seldom feel boring and the same goes\nfor Spotlight.<br><br>The relatively unknown director Tom McCarthy has in Spotlight found a\ngood balance between unwrapping the story with dialogue and by telling\nit in images. There's a lot of intense talkative conversations but they\nbreak away from them with longer montages of home visits and\ninvestigative journalism. Spotlight is definitely one of 2015's best\nfilms and a must see. I grade it a four.<br><br>David Lindahl - www.filmografen.se\n"},
{"review": "\n\"Spotlight\" is based on a real-life story surrounding the scandalous\nreveals of decade-long hushed-up affairs of sexual abuse in the Boston\nbishopric conducted by the reporters of the Boston Globe. The\nhot-potato-topic is an important addition to the already global\ncritical discourse regarding pedophilia in the Catholic Church and a\ncondemnation of its practice of merely removing child molesting priests\nto other parishes. The portraits of victims, already formed adults with\nfamilies or single, gay or straight, but with the common characteristic\nof suffering badly under the suppressed trauma of the abuse, are both\ntouching and revealing. It shows how deep you need to dig to find the\nsource of suffering in a person, and how a fear of stigmatization can\nturn a person into a psychological mess, whereas the real culprits\nremain unpunished. In many communities, the Church plays a central role\nin terms of social life or can even be the only way out of peril for\ndestitute people and children from troubled backgrounds. Which makes\nexposing the very people who help you as monsters in disguise even\nharder, bordering on unbearable. Coming from a country heavily\ninfluenced by religious institutions, I know how it feels to try to\nspeak up against them and to feel the herds of their brainwashed flock\ncoming at you.<br><br>Mark Ruffalo and Liev Shreiber did a great job here, and quite\nunexpectedly, the movie earned a best pic Oscar. An upside of the film\ncould be that, similarly like in Burnt, we see a very accurate\ndescription of work dynamics in a newspaper HQ, with the difference of\nthe former happening in a restaurant kitchen. If there's anything one\ncould point at as a flaw, it's the fact that the film borders on\ndocumentary in terms of style and you can't help thinking it could be\nreduced to a 45-minute long doc on sexual abuse scandals in the\nCatholic church, with no losses in terms of its effect on the viewer.\n"},
{"review": "\nA true story told from the point of view of a gumshoe group of\ninvestigative reporters, Spotlight is a film that needed to be made,\ndeserves to be seen, and was composed with a grace and maturity toward\nits subject that is hard to come by. An exploration of the child\nmolestation scandal that rocked Boston and later the entire world,\nSpotlight covers an uncomfortable subject.<br><br>Good journalistic films in the vein of All the Presidents Men (though\noverrated) are hard to come by, and one wonders how much this has to do\nwith Hollywood or how much it has to do with the state of journalism in\nAmerica. For ounce, what the Spotlight team uncovered, though far too\nlate, was an example of what journalism should be. Unrelenting,\nfocused, and guided by the public interest. <br><br>The film captures this and evokes the enormity, depravity, and emotion\nof the time. It accomplishes this through mature direction, a\nphenomenal ensemble cast, and intelligent dialogue. It's not always\neasy to watch, yet something that gains in appreciation as we confront\nwhat we don't want to.<br><br>4.5/5 Stars\n"},
{"review": "\nWatched this on demand last night and have to say it deserved the\naccolades and awards it has earned. The scandal was multi-layered but\nthe Spotlight team set their sights high and went after the top man in\nthe Boston Archdiocese. A man who knew what was going on for years and\nwas complicit in perpetuating the crimes and protecting his turf. In a\nfair and equitable world, he would be in jail. But in this world, the\nchurch rewarded him with one of the most powerful parishes in Rome.<br><br>The acting was tight and the directing crisp making a very complex\nstory easily broken down into pieces while maintaining a quick and\ninteresting pace that was consistent. It flowed nicely.<br><br>I grew up in Boston so a lot of this was familiar to me with regard to\nthe Catholic church never being questioned and the Irish omerta. In\nfact, I was lucky enough at the time of my youth to not know anything\nabout these goings on even though it was happening in some of the\nneighborhoods I lived in and the churches I attended. So it seems that\nthe church and many of its supporters did the job of keeping this\nabomination quiet.<br><br>If you are a thinking person, you will enjoy Spotlight.\n"},
{"review": "\nTom McCarthy's 'Spotlight' portrays the Boston Globe's investigative\narticles on the cover-up of pedophile abuse by Catholic priests. The\nmovie wastes no time in it's 2 hours and 9 minutes with on the edge of\nyour seat pacing. Every interaction is meaningful, every character\nbelievable, as layer after layer of the Catholic churches cover-up is\nunfolded. It is arguably the best newspaper movie ever produced. <br><br>But the underlying relationships of the \"Spotlight\" investigative team\nthat thrives as a proxy family is the element that makes this movie so\nappealing. <br><br>Idealic respect shared between the characters and the professional bond\nthat the diverse personalities have for each other is laid out by\nMcCarthy over the course of the movie. Like close siblings whose love\nand common bond allow for overlooking each others idiosyncrasies and\ngrow stronger under duress, the characters navigate the religious,\nsocial, community, political and legal challenges of bringing such an\nimpacting story to press. <br><br>The movie is nearly flawless in execution. Every facet - writing,\ncasting, acting, direction, cinematography, and editing, mixes together\nto yield 2015's best picture. <br><br>Spotlight goes onto my top 10 list of all-time best movies.\n"},
{"review": "\nSpotlight is an outstanding movie with a very well developed storyline\nand an overwhelmingly talented cast. It's a very powerful story as it\ndocuments the tale of how a newspaper organisation uncovered the\nCathaolic priests actions of child molestation, it was not afraid to\ntell this story, one that I feel anyone over the age of 16 should be\naware of. It's truly shocking to watch, of course we are all aware of\nthese scandals, but it was only when I saw the victims talk about their\nunpleasant experiences that I finally began to see the realness of the\nsituation, it makes you question your own faith, in both society and\nreligion, have to love movies that do that to you. However, I felt the\nfilm did not entirely rise to the heights of its true story, there were\ntimes where it felt like they were holding back, as if the real thing\nwas too much for audience goers, this easily could have been a ten for\nme if they had struck that level of power all the way through and did\nnot hold back for the sake of being too surreal. The performances are\nphenomenal and will be well appreciated for years to come, Michael\nKeaton and Rachel McAdams deliver some of their very best work, they\nare also joined by talented actors such as Liev Schreiber, John\nSlattery and Stanley Tucci who all manage to convey the passion of\nthese people for their work. The highlight has to be Mark Ruffalo, an\nactor who only seems to improve every time I see him, he is completely\nengrossed in to the role of Mike Rezendes, he understood the characters\nstruggles and felt them, ending up with a heart wrenching, very\neffective performance. A true story that everyone should know about and\na well deserved Best Picture win, I would recommend Spotlight to all\nmoviegoers. <br><br>Follows a group of journalists as they uncover the truth about child\nmolestation from priests across Boston. <br><br>Best Performance: Mark Ruffalo\n"},
{"review": "\nSpotlight is a film that shouldn't work on any level. This film has no\nflashbacks, no blood, no sex scenes and yet it deals with child sexual\nabuse that goes on every day in many churches and all over the world.\nSpotlight brings up the question of religion and puts it on trial\nmaking for a lot of powerful conversations that could make a person\nlose there faith in humanity and in the ideals that many of Americans\nbelieve about there on faiths. <br><br>Tom McCarthy makes this movie work so well. Allowing for each victim\naffected to tell there story in a way that never feels forced but\ninstead like real people talking to each other. There are very few\nOscar bait scenes as every character here feels like a real human\nbeing. Making this one truly amazing script. <br><br>Sadly the film can't help because of the nature and the choices they\nhave made in not showing a lot of flashbacks or grotesque sex scenes\nthat there are times when the characters are all just talking to each\nother and trying to uncover things that it can feel dull and there are\njust so many politics and things that stop the characters from going\nall in and making this story a reality and letting the people know. <br><br>Because of this I feel like this film did get some backlash from its\nOscar wins because of all of these things. As powerful as the film is\nto some it may seem like a failure in there eyes, but it most certainly\nisn't. <br><br>Spotlight might not be my favorite film of 2015, but it defiantly\ndeserves to be up there because of its powerful dialogue and script\nthat makes it all the more interesting to see it unfold before our\neyes.\n"},
{"review": "\nThis Oscar winner for best picture of 2015 is fabulous. There is\nnothing like good investigative reporting and this marvelous film is\njust that. It is really serving as a tribute to our journalists for\ndoing great research in investigative reporting to get down to the\nfacts and reveal the guilty parties, no matter who they may be.<br><br>The uncovering of the scandal involving priests sexually abusing boys\nand merely being placed on sick leave or transferred to a different\nparish is both shocking but yet so revealing.<br><br>It is the fact that the church itself comes under the criticism for the\ninstitution knowing full well what was occurring but covering it up\nuntil journalists delved into the situation.<br><br>There is absolutely fine acting by a truly ensemble cast and the film\nbrought out the extent to which the church covered up the incidents and\nthe various groups, attorneys included, went along with this for their\nown financial gain.<br><br>Truly a memorable film which shall long be remembered.\n"},
{"review": "\n3 March 2016 Film of Choice at The Plaza Dorchester Tonight -\nSpotlight. This film was most definitely an Oscar winner. The script\nwas outstanding, The actors were so enmeshed into their characters I\nfound myself locked into the story from the get go. Any film that\ntackles socially taboo subjects is going to be hard to write, act and\nto sell to the public, Spotlight does all that as it tackles the\nemotive subject of abuse within the Catholic Church. The film follows\nthe Spotlight team of the Boston Globe as they forage and delve down\nall possible avenues to uncover the story hidden for so many years. We\nshare the horror and the disbelief as the scale of the cover ups come\nto light and get an insight as to how a good journalistic team can work\ntogether to find the correct facts and the best time and way to present\nthem to the public. Spotlight was gripping and in no way uncomfortable\nto watch. I was rooting for The Danish Girl to win the Best Picture\nOscar but having seen this film I realise it was a far superior\noffering and very worthy of the award. Absolute silence in the cinema\nas the film ended.\n"},
{"review": "\nJust watched this with my movie theatre-working friend, this\nOscar-winning Best Picture that was quite a compelling account of the\nreporting of various Catholic priests' molesting children over many\nyears. He had seen it before and didn't mind going again while I was\njust experiencing this for the first time. No graphic scenes but many\nof the victims didn't mince words when describing what happened to them\nat such young ages so I either covered my mouth or hit the chair, not\ntoo hard, when those were revealed. Visually, this probably wasn't as\nimpressive as another Best Picture nominee-The Revenant, for\ninstance-but it was riveting enough dramatically, otherwise, for me and\nperhaps for my friend, as well. So on that note, I highly recommend\nSpotlight.\n"},
{"review": "\nThis film has got a very good cast,the acting department as far as I am\nconcerned is really good.A simple story shot realistically as it would\nhave been ,not too dramatic,simple narration with the background music\nslipping in at a perfect time.This film lays the whole issue not in a\ndramatical way but in a really straight forward way,though you do know\nwhat is going to happen in the end you will tend to( at least most of\nus) stick with it through the end.Whats special in this movie is the\nway they decided to bring the controversial issue.Its laid straight and\nin a very simplistic way.I have repeated it because when you see this\nmovie you sort of fell either a hollowness that something else is\nmissing or something different.I have not yet seen one movie which\ntries to bring something like these scandals in a very realistic and in\na not so melodramatic way.This is exactly where spotlight shines.my\nmarks would be 8,but seeing that this movie has already dropped to 8.2\nagainst 59893 voters i will give it 10\n"},
{"review": "\nSpotlight is a journalist-drama that the awards ceremonies will love.\nThe content, acting and unbeatable script merge to make a dreadfully\ncompelling story, one that doesn't scrimp or exaggerate its material to\navoid hurting particular factions. Spotlight covers a monumental\nscandal of recent years: the cover -up of child molestation by the\nCatholic Church. Led by head journalist Robby (Michael Keaton), the\nBoston Globe's Spotlight team unravel the truth. The script is perfect,\ngiving us information in spurts rather than spoon feeding it down our\ngullets. Every shock comes at a reasonable pace, dangling that juicy\ninfo I want to know. The four journalists in the Spotlight team put in\nsome fantastic performances, but none so more than Mark Ruffalo, whose\npassion and assurance shines through. This is one of the most tense\nfilms without any action you will ever see.\n"},
{"review": "\nThis journalistic drama recounts a pivotal 12 months of an\ninvestigative research team from the Boston Globe, who uncovered\ndecades of systematic abuse against children by the Catholic Church.\nWith subject matter so infuriating and gut-wrenching, it would have\nbeen easy for writer-director Tom McCarthy to create a good versus evil\narc and give the audience a clear-cut bad guy to despise and deplore.\nBut McCarthy opts for a more intelligent route and keeps the individual\noffending priests faceless (barring one unsettling and revelatory\nscene), instead homing in on the atrocities committed by the\ninstitution. Unravelling like a journalistic thriller sans the glee,\nSpotlight is an insightful, methodical and utterly compelling film that\nprovides a window not only into the earth-shattering monstrosities at\nits core, but also into the mechanics and minutiae of old-school\nreporting. Understanding that the interactions between the key players\nis critical to maintaining a level of reality in what would otherwise\nseem completely unbelievable (despite being true), McCarthy keeps his\ndirection unflashy, allowing the high calibre cast to flourish. Mark\nRuffalo, Michael Keaton, Rachel McAdams, Brian d'Arcy James, Live\nSchreiber, John Slattery and Stanley Tucci are all at the top of their\ngames with fleshed out and layered performances that favour subtlety\nover grandstanding. Spotlight is a brilliantly told true story that\ncaptivates from beginning to end, deserving each of its six Academy\nAward nominations and a place on everybody's must-see list.\n"},
{"review": "\nI thought it felt underwhelming and lifeless because nothing really\nstood out to me and The cinematography was Mei and so was the acting\nand script.It wasn't horrible and the plot was interesting but it\nwasn't shocking news and I felt like it depended on it\nshocking,disturbing,and angering the audience instead of making a good\nfilm.I like what its doing but its pointless if its does it so\npredictably and its characters feel so bland.LETS MAKE A MOVIE WITH NO\nREAL CHARACTERS AND PUT LITTLE EFFORT INTO MAKING IT FEEL IMMERSIVE OR\nINTERESTING BUT ITS ABOUT MESSED UP INJUSTICE AND CORRPTION THEYLL BE\nSO UPSET THEY WONT NOTICE ANY FLAWS.All my opinion of course.\n"},
{"review": "\nSpotlight is as much about \"spotlighting\" the realistic drama involved\nin investigating reporting, as it is a documentary about The Boston\nGlobe.<br><br>Talented acting throughout the documentary keeps the story's facts\nmoving along with the excellent performances. In my opinion, more\nmovies should highlight the value of investigative reporting. It helps\nto explain the professional risks journalists take when covering\ncontroversial subjects, written with the intention of revealing truths,\nbased on facts. \"Spotlight\" supports freedom of the press and portrays\nwhy this right matters.\n"},
{"review": "\nI am genuinely pleased that Spotlight took this year's Oscar for best\npicture. It is an important film and given the Royal Commission\ncurrently underway to address abuse cases originating from Australia, a\ntopical one that really should be seen.<br><br>Without spoilers, I can safely state that this film is actually quite\naccessible and not as difficult to watch as I had previously\nanticipated. Whilst Spotlight addresses horrific crimes against\nchildren, I did not consider it to be in any way gratuitous or\nexploitative. It has a docu-drama feel about it which makes it somewhat\ncold and impersonal.<br><br>It must be noted that Spotlight is a true story about the investigative\nprocess led by three committed journalists, their editor (brilliantly\nplayed by Michael Keaton), the socially awkward editor in chief also\nwonderfully downplayed by the always dependable Liev Schrieber, and\ntheir relationship with members of the legal fraternity. <br><br>It is however less concerned about the abuse victims' stories and is\nlargely focused on the team's interest in exposing the magnitude of the\nsystemic abuse by the Catholic Church. Which as we are now all\nwitnessing from watching the news, reverberates all the way to the\nVatican. Make no mistake, in certain scenes, this film will make your\nblood boil. And this is to me Spotlight's fundamental weakness in that\nit really only manages to scratch the surface of the horrors for which\nthe church is squarely responsible. And only just manages to do so.\n"},
{"review": "\nSpotlight, the four person team working for the Boston Globe,\ninvestigates into the repeated acts of priests sexually abusing\nchildren over the course of 30 years, resulting in the unfolding of\nhidden secrets that this team desperately determined to reveal.<br><br>Compelling, investing, and brilliantly detailed account of a story that\npeople tried to hide for so long. This film goes into so much detail\nabout the emotional distress, the determination from the team, the\nstruggle with the legal system in getting the truth out, etc. The\nensemble cast is well picked out, with everybody doing a great job.\nMark Ruffalo and Rachel Mcadams both give Oscar worthy performances,\nand Michael Keaton was surprisingly amazing, showing that Birdman was\nnot a one time hit for him.<br><br>For a touchy subject matter like this, It's really risky to put it out\nthere, as some people (including the Academy) don't like films with\nuncomfortable topics. This film handled it so perfectly and so maturely\nthat it deserves every bit of credibility. It's very historically\naccurate, resisting the temptation to make the main characters out to\nbe superheroes that save the day, but instead just portrays them as\npeople simply doing their jobs, which is what this movie does. It\ndoesn't go out of its way to blow itself up bigger than it is, or try\nto establish any bit of greater importance, it simply does its job, and\ndoes it great. It is completely airtight, there is no fat on this film\nwhatsoever. Every scene is escalating the plot further in some way, and\nis packed full of the meat of the story, which I savored every little\nbit of.<br><br>Tightly written, tightly edited, tightly acted, and tightly directed,\nthis is a unique and impressive quality film that will inspire you\nuntil the end.\n"},
{"review": "\nMy girlfriend and I were really impressed by this movie. Great\ndirecting, a superb cast and a beautiful storyline. This movie shows\nhow important it is to have great journalists / newspapers in your\ncountry, who have the time and funds for extensive journalistic\nresearch. A really important message these days if you consider that\nall the newspapers have lots of problems to make enough revenues, as a\nresult of the digital era where users almost expect that everything is\nfor free. Good journalism is essential in a democracy, and that is one\nof the great lessons this movie shows her audience.<br><br>I think Spotlight has a great chance to win the Best Picture award at\nthe Oscars. However, the Revenant has a higher chance of winning, as it\nis a more original movie which was certainly not easy to make. I think\nthe Academy will definitely reward that, but that doesn't mean\nSpotlight isn't one of the best movies of the 2015/2016 Oscar season.<br><br>Go see it guys!\n"},
{"review": "\nHas to be the best movie that I have seen from the class of 2015. No\nbells and whistles just a great cast, with an amazing script and a\nfantastic director. The three ingredients needed for a truly amazing\nfilm. Mark Ruffalo gives what I believe is the best performance of his\ncareer he truly stood out and in one scene gave me goosebumps (A clear\nsign the acting is believable) Michael Keaton as always was brilliant\nand Rachel McAdams is again showing her acting range she has really\nbroken away from the 'romcom' stereotype and the queen B from mean\ngirls and is producing some really amazing content! the rest of the\ncast was stellar. The movie as a whole was an emotional knife to the\nstomach, I was thinking about this film all day after watching it it\nreally shakes you to your core! Brilliant work all round I am crossing\nmy fingers for Spotlight at the Oscars.\n"},
{"review": "\nA solid movie, though I was not fully captivated. The story emphasizes\non the importance of a strong independent press. A very important story\nof course. The story of abuse in the Catholic church serves more as a\nvehicle to highlight this. The actors did a great job but to me they\ndid not blend in as much as I would like them. Mark Ruffalo is just too\nmuch Mark Ruffalo as is Michael Keaton very much Michael Keaton. I\nwould have added a few less known actors to the cast to make it more\nnatural. To me Liev Schreiber was the most credible, Stanley Tucci\n(with hair!) did also a great job. Watching the movie it had a bit of a\nold fashioned feel of the 70ths, any moment Robert Redford could show\nup, and I think that is the reason I was not completely convinced. I\nwas constantly reminded of All the president's men and that was just a\nbetter movie.\n"},
{"review": "\nMy big \"shock\" with this movie was seeing a \"C+\" experience suddenly\nturn into a a very strong \"B+\" experience roughly AFTER the 45 minute\nmark. I've been watching movies all my life, and I can't think of many\nexamples of this happening. <br><br>Before that point, the film seemed filled with \"newsroom drama clichés\"\n(IE: smirking villains, overly likable protagonists, montage after\nmontage, etc). It just felt \"ok...but I've seen this before.\" Also, I\nwas afraid it would become another \"Black Mass\"; a well executed,\nfactually correct, but ultimately, for me, a hollow experience.<br><br>But, there's a moment when this film decides to go its own way, and it\ndoes so very well: - The obstacles become increasingly more\ninteresting. - The emotional scenes in this film are handled well. They\nseem appropriate and never forced. - The film is brave in its portrayal\nof the Roman Catholic Church, and pulls no punches. With films like\nthese, you'd expect filmmakers to walk on eggshells and try not to\noffend their viewers. It was a nice surprise to not see this happen in\n\"Spotlight\". <br><br>7.8/10 or B+ Watch for Mark Ruffalo, who steals the show yet again.\n"},
{"review": "\nI'm continuing on with my round of watching all the 2016 Best Picture\nnominees, which has now brought me to \"Spotlight\", a well made film\nabout the true story of the Boston Globe's exposé of sexual abuse in\nthe Roman Catholic Church in the city of Boston. <br><br>I've given this film eight stars due to the fact that it's very well\ncrafted, and yet at the same time so difficult to watch that it was\nhard to really \"enjoy\" this film.<br><br>On the positive side, there is very little that is done wrong in this\nmovie. It tells its story well, and its cast is fun to watch\nthroughout. It was great to see Michael Keaton in a serious role a year\nafter \"Birdman\", and Keaton definitely adds to the film's gravitas.\nMark Ruffalo turns out a similarly strong performance. I had to do a\ndouble take, as I first thought someone had miraculously turned Tony\nDanza thirty years younger just for this movie--Ruffalo's haircut and\naccent were Danza to a T. But \"The Hulk\" turns out a strong\nperformance, and provides an effective performance in the film's\nclimax. Similarly, Rachel McAdams is my new celebrity crush--she shines\nin this movie.<br><br>The down side to this film is the subject matter. Yes, it's an\nimportant story to be told, and inasmuch as that's true, this is a very\nimportant film that everyone should see at least once. But as with\nother historical dramas of difficult subject matter, \"Schindler's List\"\nand the like, this movie leaves you emotionally drained. Because of\nthat, the movie is not one that many will want to watch more than once.<br><br>That said, I will note that the film ends in a very satisfying way,\nproviding a very effective closing scene that does add a certain amount\nof resolution to the movie. <br><br>All in all I'm going with 8/10 stars. It's extremely well made--just\n\"heavy\" in a way that makes it hard to enjoy.\n"},
{"review": "\nLoaded with great performances. I didn't know Liev Schreiber could be\nlovable. Or Stanley Tucci likable, let alone great. The main problem\nhere is you have a story with heavy subject matter, and a realistic\nportrayal about how a group of journals might go about solving the\nproblem. But the realism doesn't allow for a dramatic engaging look\ninto the issue that gets to its core, that is hard hitting enough for\nthe subject's weight. Basically it needed someone in the movie to go,\n\"It's about child rape. What's the moral grey area of that assh-les?\"\nInstead Mark Ruffalo goes ham but not really. \"If it takes a village to\nraise the child, it takes a village to abuse one.\" It needed more of\nthat.\n"},
{"review": "\nSpotlight is a true story about the reporters of Boston Globe that are\nuncovering decade long story about sexual abuse in the Catholic Church.\nEveryone heard these stories, but everyone remained silent. There are\ndozens of Catholic abusive priests and hundreds of sexual abuse\nallegations against minors that never been public.<br><br>Incredible story. I've heard many times about scandals in Catholic\nChurch, but I never thought it was this big. A story that should have\nbeen told, and I'm happy that I've learned about this history and I'm\nhappy that a movie about it is made.<br><br>It's a great writing job from Josh Singer and Tom McCarthy. I have to\nsay I've seen two hour movie one meter away from TV in a stool. During\nthe whole movie I was 100% focused on the film and I didn't want miss\nany single thing. Tom McCarthy did also a wonderful directing job. I\nhaven't seen a lot of movies this year, but from what I've seen, Tom\nMcCarthy got my Oscar.<br><br>Another strong praise goes to the actors, especially Mark Ruffalo.\nMichael Keaton and Rachel McAdams was great too. <br><br>I've just started to watch Oscar films and I think I've chosen the best\none to watch first. It's very dramatic, touchy, tragic, with a great\nstory, great directing, great acting.\n"},
{"review": "\nWhen this movie starts out, you could be forgiven for thinking that you\nare seeing *All the President's Men* or some other classic newspaper\nmovie. Very much unlike *The Big Short*, for example, another of this\nyear's feature-length films recounting a recent true story, there are\nno really innovative new approaches to movie making here.<br><br>But that is not to say that this movie holds no interest. Not at all.\nUnlike any of the classic newspaper movies I know, this one gets\ncomplicated when you start to suspect that there are people in the\npaper itself who are working against the journalists covering the big\nstory.<br><br>You also start to wonder what involvement the journalists in question\nthemselves may have had with similar situations, since they are all\nBoston Catholics themselves. Lots of old-fashioned close-ups of their\nfaces, faces that are expressing anguished thoughts not put into words,\nleave you wondering. This is not like covering the Watergate break-in,\nyou come to realize. These reporters are in fact discovering things\nabout themselves, their upbringing, their community, as they probe ever\nmore leads into cases of child abuse by Boston Catholic priests.<br><br>There is nothing innovative about the film making here, perhaps. But\nthe script is written for intelligent adults, and demands your full\nattention, which it amply rewards.<br><br>This is not an easy movie to watch, frankly, because you end up viewing\nthe case through the anguish of the reporters. In that sense, it takes\nthe ability to see all this as new and horrifying, despite all we have\nlearned since.<br><br>But it is very much a movie that is worth the effort, and the\ndiscomfort, to watch.\n"},
{"review": "\nSome will have agendas when watching this terrific film, and\nunderstandably so. This is a painful topic to delve into. <br><br>Reviewers' bias (pro or anti-Catholic, experience with child abuse,\netc.) may be reflected in their ratings. But here's what you need to\nknow: This is the best done drama I've seen in years -- on stage, TV or\nin the movies. And to top it off, the movie very closely adhered to the\nfacts of this amazing true story (check Google for verification).<br><br>This flick is what movie-making SHOULD be about, but seldom is. And it\nalso is a reminder to the press to carry out their investigative\nobligation -- a function that today seems to be atrophying.\n"},
{"review": "\nSpotlight (2015): Dir: Tom McCarthy / Cast: Michael Keaton, Mark\nRuffalo, Rachel McAdams, Liev Schreiber, Stanley Tucci: Captivating\nfilm about a group of journalist from the Boston Globe who are focused\non, or as the title fittingly puts it, putting the spotlight on over\nninety priest who have molested children decades ago and the legal\nsystem that covered it up. There are lots of regrets and many\nspeculations that this team is working to bring light to. Michael\nKeaton heads the operation hoping to convince old colleagues to reverse\ntheir previous decision and right previous wrongs. Mark Ruffalo has fun\nwith a rookie role where he saunters about trying to get an attorney,\nplayed by Stanley Tucci to allow him to interview past victims. Tucci\nwould prefer that the emotional wounds of these victims not be opened\nbut he soon comes to terms with the importance of not having these\nincidents happen in the future. Rachel McAdams plays another journalist\nwho is determined to break this story but often meets with rejection.\nAt one point she even has a former priest admitting his wrong until his\nsister warns her away. Liev Schreiber plays a new arrival who first\nopens this story up. Director Tom McCarthy handles the film in similar\nvein as All the President's Men or The Paper with realism in the sets\nand locations with a touch of paranoia thrown in. The subject is\nsensitive and controversial but perhaps the film deals this subject\nbecause it is handled very discreetly in reality. Now it is given the\nspotlight it needs to bring the guilty to justice and the victims\ncloser to closure. Score: 10 / 10\n"},
{"review": "\nThis is a great movie and hard movie to watch. It follows the Boston\nGlobes investigation into the Catholic church molestation allegations.\nWhat they uncover is widespread across not just Boston but all of\nAmerica. The journalism side of the film is really well done. You\nreally get to understand how they build such a big story and uncover it\nin great detail. All the actors who play the journalists working for\nthe globe are great. Michael Keaton leads the team and he does a great\njob of getting to the truth of the story. You can really feel he's a\nreal person in the story and not just acting. Rachel McAdams is also\nvery effective as an investigative journalist who goes and interviews a\nlot of the victims getting to hear their stories. Mark Ruffalo is also\ngreat as a man who is desperate for the truth and his character does\nlet his emotions get the better of him at a certain moment. But you\ncan't blame him this is a serious issue that has plagued the Catholic\nchurch for decades. Its not a subject matter that's easy to take. But\nif you love a great film that is really well written on investigative\njournalism, then this is the film for you. Its one of the best films of\nthe year. I highly recommend it.\n"},
{"review": "\nI'm not the first person to say this, but Spotlight probably is the\nbest journalism movie since All the President's Men. It starts with\nMartin Baron (Liev Schreiber), who plays the new editor of the Boston\nGlobe, catching on to a potentially explosive story that nobody seems\nto be covering in great detail \u0096 the sexual molestation of young boys\nby Catholic clergy. So he assigns the Globe's \"spotlight\" team to the\nstory \u0096 a close-knit group of journalists who uncover the biggest\nscandals in Boston. Michael Keaton leads the team consisting of Mark\nRuffalo, Rachel McAdams, and a few others as they delve into one of the\nmost important journalism investigations of our time. <br><br>The execution of Spotlight is what really made it the best picture\nwinner at the Oscars. The way it delves into the journalistic process \u0096\nthe countless interviews, the research, piecing things together with\nscant evidence until you get the smoking gun \u0096 that's what keeps you\nwatching this movie. A journalism investigation is not exactly\nsomething you think would hold your attention for two hours, but it\ndoes. It is also a very tightly edited film \u0096 each scene moves the\nstory forward and not a moment is wasted or excessive. <br><br>What I especially admire about Spotlight is its low key feel and humble\nnature. It celebrates the value of investigative reporting while\nacknowledging that journalists really dropped the ball by not pursuing\nthis story sooner. It gives this serious issue the importance it\ndeserves while asking the question \u0096 why did it take people,\nparticularly journalists, so long to act? All of the pieces were there\nfor them to put together. Could they have done something sooner? And it\ndoes all this with very few manipulative, Oscar baity moments. It lets\nthe story stand for itself. <br><br>Spotlight is a triumph of good story telling with little flash or\nstyle, and there's nothing wrong with that.\n"},
{"review": "\nMany people, judging by media reports, still seem to be a bit shell\nshocked that Spotlight hopped over The Revenant to win the Best Picture\nOscar yesterday. The bookies as we know had Revenant ahead. But so did\nlots of other commentators. <br><br>I was glad Spotlight won. Always thought it was a better overall film.\nAt first hearing it may not seem much like a movie that would be of\nwide interest. A bunch of investigative journalists uncovering a story\nof widespread child molestation by the clergy in Boston. Yup, sounds\ninteresting conceptually but perhaps too serious a subject matter for\nan afternoon's entertainment?<br><br>Actually, try it out. The team of journalists at the Boston Globe, all\nhave fleshed out characters, look vibrant and engaged in what they are\ndoing, and act well as an ensemble. No one big dominating hero here.\nIt's the team in focus. <br><br>Remember All the Presidents Men? That 1976 Redford, Hoffman movie about\nthe uncovering of the Watergate scandal by The Washington Post? Well,\nSpotlight is in that genre of films. You will not be bored\n"},
{"review": "\nSpotlight is a movie which is making you realize how dearly we should\nnever surrender our freedom of the press.<br><br>This movie tells the real story of a team of 5 journalists working for\nthe Boston Globe who, despite the deep willingness of the Church and\ntheir supporters to bury it, uncovers one of the biggest scandals which\nshook the entire planet: the scandalous and systematic cover up of\npriests molesting young children they were in charge of by the Catholic\nChurch itself.<br><br>It all started with one case, then thirteen until it reached the\nchilling number of ninety priests molesting children during their\nentire career while people knew but turned their eyes because of all\nthe good the Church was doing for the city.<br><br>I was deeply shocked by the hypocrisy and real stiffness of this system\nfor example when Rachel McAdams is interviewing that priest who admits\nthe facts he's accused of but insists that it was not rape as he was\nraped himself. When the interview ended, while she walks down the\nstairs, she realizes that the priest lives nearby a school. What's even\nmore shocking is the reaction of the Church towards the issue. They\nsurely know of it but prefer to cover it up by hiding legal documents\nproving the rapes so nobody could gain access to it with the\nprovidential help of justice employees or even by frequently putting\npressure on the journalists to protect the Church reputation.<br><br>This movie is also an ode to reporting throughout those 5 journalists\nwho keep digging, tracking down each of the victims to get their\nchilling statements even risking some hardly gained friendships with\ndefense attorneys to get to the truth. My compliment by the way to\nJamey Sheridan who played one of those attorneys who was just doing his\njob despite being secretly disgusted by his clients abuses.<br><br>Spotlight is a must see and it truly deserves its Oscar for the Best\nPicture of the year. And it deserves also the highest note to me. 10/10\n"},
{"review": "\n\"I know there's things that you can't tell me, but I also think there's\na story here. An important story.\" In 2001 the Boston Globe newspaper\nwas in transition. A new editor was brought in and budget cuts were\ncoming. The team of the Spotlight section has just been given a new\nstory to work on. The story deals with allegations of child abuse\nwithin the Catholic Church. What started off as a story with a few\nvictims with one priest began to grow the more they dig. By the time\nthey ran the story the victims and the number of priests grew to\ndisgusting numbers, but it didn't stop there. This is a movie that\nmakes you sick while you watch. This is another movie were everyone\nknows the outcome but that does nothing to make you furious with anger\nand want to scream at the TV. I don't want this to become too political\nor controversial so I won't go any further but I will say this is a\nmovie you MUST WATCH. This movie is important and transcends the screen\ninto true journalism and continues this needed conversation. I have\nseen 6 of the 8 Best Picture nominees for this year so far. This one\njumped to the front of the line for me. Overall, a true must see movie\nand I'm not ashamed to admit that I cried at the end. This film will\nmake you feel anger, disgust, gratitude and hope. Making you feel any\none of them is the sign of a good movie, one that makes you feel all of\nthem is the sign of a great movie that will be remembered. Watch this\nmovie today. I easily give this an A+.\n"},
{"review": "\nAfter seeing all of the best picture nominees this year, I have to say\nthis is my least favorite. It's a good movie, that's for sure, but I\nwasn't really blown away by it.<br><br>This movie is incredibly well written and especially acted (I want to\npoint out Mark Rufallo and Liev Schreiber) and the story was very\ninteresting. But still, when I finished watching the movie, I just\ndidn't have that special feeling I get when I watch a great movie. It's\nnot boring at all and it's not afraid to go into details, it's very\nrealistic and sometimes it even feels like you are watching something\nreal happen. This did happen and at some parts you really feel like you\nare watching that and not the movie and also some parts are really\nmessed up. It's never shown, bit you are shocked just by characters\ntalking about it which is great. But I just didn't find myself so\ninvested in the story.<br><br>It's a very well done movie, but to me it feels like something is\nmissing and till the end of the movie, I wasn't that interested\nanymore, but I think many people will like this movie.\n"},
{"review": "\nThis movie does for the Catholic Church what \"All The President's Men\"\ndid for the US Government. Both teams of journalists exposed the\ncreeping rot within these vast institutions. Both movies deftly explain\nthe roadblocks, the liars and lies, and the bureaucratic shams employed\nto keep reporters (or anyone) from finding out additional information.<br><br>I haven't had chills run up my spine like this since \"The Piano.\"\nHaving been in the atmosphere of the famous Santa Barbara molestation\ncases as a pre-teen (not a victim, but one my classmates was), I was\ncurious to see how this wide-spread bacillus was going to be portrayed.\nThe stunning list of scandal localities at the end of the movie\ndemonstrates just how vast this odious practice spread. <br><br>KUDOS to ALL the actors. I do not agree with the previous critic who\nsaid that Rachel McAdams had nothing to do in the movie. She provided\nthe quiet center and ballast to the proceedings. Two hours went by and\nI could have stayed for another two hours. I did think it was odd that\nin a theater seating 207, I was the only one at the showing.\n"},
{"review": "\nThe story of Spotlight - the investigative team at The Boston Globe -\nwho uncovered the abuse scandal in the Catholic Church, is told with\nsuch outstanding verve that this viewer was knocked sideways. I cannot\nrecall another film this year that so intelligently and without\nmelodrama produces scene after scene that just leave you wanting to\nknow more.<br><br>The all-star stellar cast is underpinned by Keaton, who seems to have\nproved he has had his comeback - here he focuses on a nicely\nunderplayed performance, and Ruffalo, whose slightly off-kilter manner\nworks to his advantage, and Rachel McAdams, who moves from romantic\ncomedies to this with the ease and promise she showed in Woody Allen's\nMidnight in Paris. There is not a dud moment in the film - it really is\none of the best films about journalism, and ranks along with All The\nPresident's Men.<br><br>At the end of the day this is not just a great story, director Tom\nMcCarthy, takes us along emotionally - but does so in such a forensic\nand well-judged manner that it produces a good mixture of trust and a\nmeasure of level-headedness. His script, with West Wings regular Josh\nSinger, is outstanding, simply the best script of the year that I can\nrecall by quite a margin.<br><br>Of all the films I've seen this year, this is the one that tackles its\ndifficult subject with bravery, clarity, and simplicity, but it never\nloses sight of why it matters. I am a loss to understand why it is not\non everyone's Oscar list.\n"},
{"review": "\nI went to this movie not expecting much of anything. I had no real\nopinion either way about the subject nor the film itself. I left\ncompletely moved by the power of this story and the sadness of these\nevents. The most moving part of this film is afterward when the screen\ngoes black. The next thing shown are three full screens full of a list.\nI will not say more. <br><br>Go see this film. The actors do a fantastic job of telling this story\nand the power of the events surrounding Boston in 2001. I was in the\nfilm and was sitting next to a women that could not hide her emotions\nand afterward I was unable to keep mine in check. To imagine the things\nthat happened and had been happening surrounding the Catholic Church\nfor decades and decades.\n"},
{"review": "\nThere was a lot of buzz surrounding Spotlight when it first premiered\nat the film festivals. Many were comparing it to All the President's\nMen, saying it was just about on par with that one. I had only recently\nseen All the President's Men and had high expectation for this movie if\nit was true that it was just as good. I'm ecstatic to report that this\nmovie not only lived up to the hype, but exceeded it to emerge as one\nof the year's best films.<br><br>Spotlight was built to stand the test of time with its true to life,\nedge-of-you-seat style drama. The story follows the journalists in the\nSpotlight department of the Boston Globe who broke the story about the\nmolestation charges against Priests that had gone on unnoticed for some\ntime. The story itself is engaging to start with but the screenplay,\ndirection, and acting all come together flawlessly to create an\nincredibly powerful and emotional film. By the time the end credits\nroll, the film has landed such a powerful and lingering punch that the\nevents portrayed almost seem surreal. This is most definitely a film\nthat will not be forgotten soon.<br><br>The acting is top-notch with everyone from Michael Keaton to Mark\nRuffalo to Rachel McAdams giving possibly the performances of their\ncareers, respectively. This is one of the best ensembles of the year.\nEven those who didn't have as much screen-time like Liev Schriber,\nStanler Tucci, and John Slattery shine when their time is given.<br><br>Overall, Spotlight is an exceptional film that will most likely receive\nsome major nominations come awards season. The leading and supporting\ncast all bring their A games as well as director Tom McCarthy. This is\na movie you most definitely do not want to miss.<br><br>\"It takes a village to raise them. It takes a village to abuse them.\nThat's the truth of it.\"\n"},
{"review": "\n'Spotlight' provides a riveting look at the Boston Globe investigation\nof the Roman Catholic pedophile priest scandal. As almost everybody\nknows, the church hierarchy concealed their knowledge of numerous\npriests who were molesting and raping under-age parishioners. The\ncover-up of these serious felonies was orchestrated through pay-offs\nand arm-twisting by Boston's archbishop, the despicable Cardinal\nBernard Law. This corrupt cleric seemed to rule over the city, and his\ncriminal negligence allowed the depraved activity to continue for many\nyears.<br><br>The victims were countless Bostonians who endured this abuse and had\ntheir lives ruined. The heroes were an embattled lawyer, a resolute\neditor and a small group of persistent journalists who dismantled the\nobfuscation and red tape of respected authority figures and entrenched\ninstitutions. The villains were Law, his venal church and the priests\nwho pretended piety while they preyed upon the young. 'Spotlight' tells\nthis twisted tale with excellent writing, direction and acting. <br><br>It's worth noting Law fled to Rome after the scandal broke, was given\nan honorary position and still lives in comfort in a Vatican palace. In\n2012 he was the prime lobbyist against giving women more responsibility\nin the church. Nothing much appears to have changed in the RC Boys'\nClub.\n"},
{"review": "\nHaving recently read Goodbye Good Men by Michael S. Rose -- which goes\ninto excruciating detail about homosexuality in the Roman Catholic\nseminaries during the Sexual Revolution of the 60s and 70s, which\ninevitably led to the ordination of sexual deviants -- 6% according to\nthe film, the pedophile priest scandal was a dreadful accident waiting\nto happen. Church authorities were indeed negligent and chose to engage\nin the massive cover-up, and the Globe's expose did some good.\nCatholic-bashers (both Christian and otherwise) gloated with glee when\nthe story hit (and kept on hitting).<br><br>However, there were numerous other reports of pervert rabbis preying on\nschool children which also were swept under the rug with the complicit\nassistance of newspapers. And also buried deep in the Metro section on\npage E-7 was the massive abuse committed nationwide by secular teachers\nboth male and female. <br><br>I'm sure the advocates of the \"do your own thing,\" and \"if it feels\ngood\" movements who preach tolerance of wickedness and evil, and those\nwho define deviancy down won't like this comment, but that's the\nbreaks. Deal with it!\n"},
{"review": "\n\u0085.and I see a lot of 'em. This film shows how professional journalists\nwork to uncover a tremendous story \u0096 said professionalism so sadly\nlacking in today's media world - with hard work, dedication and\nhonesty. How finding out the truth and exposing it was crucial to\nbringing hard to grasp facts to the focus of the entire world. I see\nOscar winners written all over this picture. Best Picture right on to\nBest Male Actor \u0096 and two of them should be nominated here, Mark\nRuffalo and Michael Keaton. Terrific performances by both. This movie\nmoves right along, bringing it all together in a way that almost numbs\nyour mind by the time it's done. When the end credits roll and it shows\nhow this single story brought out atrocious child molestation scandals,\nnot only in America, but all over the world, and you see the long, long\nlist of places, you can hardly manage to get up from your seat and walk\nout into the world. You are stunned. This is not a spoiler, but I have\nto say, at one point in this film, without a word spoken, you watch the\ncamera scroll down pages of names and facts, and in the background you\nhear a chorus of innocent young voices singing a Christmas carol, the\nhair on the back of your neck rises\u0085.you KNOW you are watching\nsomething brilliant. And that's what this production is, brilliant.\nWithout question one of the best pictures you will ever see. And the\none that will have you thinking and talking about it for a long, long\ntime after.\n"},
{"review": "\nAmazingly this is an excellent movie. It is amazing because in this day\nand age when Hollywood has opted to play up sensationalist glitz at the\nexpense of substance, this movie does just the opposite. It tells a\nstory. It does so in a straightforward manner, with no gratuitous\nscenes of violence or seedy sex. The story depicts a team of reporters\nwho do a job, and do it right. They have some leads, develop their\nsources, collect the evidence, put it all together and publish a story.\nWhat they did took a lot of courage. Michael Keaton gives a strong\nperformance as the leader of the team of reporters. However, it is Mark\nRuffalo who emerges as the star of this movie. His performance\ndominates the movie. The subject of the story is controversial and\nsensitive. It deals with a religious institution that allows itself to\nbecome a cover for sexual perverts and then tries to cover up the mess,\nin the process deceiving the public. Sadly, but not surprisingly, this\nmovie is based on a true story. That's why this movie must be watched.\n"},
{"review": "\nDespite the quality of this film, the disturbingly tragic topic makes\nthis film hard to watch. The ensemble cast is brilliant and the pacing\nkept a somewhat complicated and slow story very interesting. It's hard\nto make people talking on the phone and collating data exciting but Tom\nMcCarthy pulled it off though he usual fare is comedy. This is one of\nthe best films of the year and an important one.<br><br>In a crowded film, Mark Ruffalo stood out as Mike Rezendes, the\nintrepid reporter who hassled the lawyer of several abuse victims\nMitchell Garabedian played by a somber Stanley Tucci. Ruffalo did a\ngreat job getting into character and distancing himself from his more\npopular role as the Incredible Hulk. A speech he gives at the end is\none of the most moving in the film. <br><br>Michael Keaton as delivered a strong performance as the conflicted\nBoston native Walter Robinson. He didn't match his award snubbed\nperformance in Birdman but he nailed the Boston accent and the\nemotional turmoil the investigation caused.<br><br>For more of this review and others, check out swilliky.com\n"},
{"review": "\nAmazing cast (but none of them doing career best work), weighty theme\nhandled well (and yet the Church is completely demonized, with no\nreasonable opposing view of their actions in dealing with the scandal)\nthe direction is fairly tight - however the dialogue is occasionally\nvery on the nose and scenes often skim the surface and then cut away to\nthe next thing without really building or exploring in depth. The music\nand pacing was fine but at times felt like a really high end TV movie\nrather than a theatrical film. It is an affecting drama, well-told, I\njust felt it never reached the fever pitch of outrage it really should\nhave, and the ending is quite underwhelming. There is a lot of\ntalking/exposition/monologuing. Would have been nice for some\nrevelations to happen visually/through action the audience could\nobserve first hand. It feels kind of labored as is. I personally don't\nthink anything about the film is awards worthy, except maybe Ruffalo\n(what else is new?) and while Todd McCarthy is a fine filmmaker, this\nis not his best film and nowhere near the directorial achievement of\nsomeone like Lenny Abrahamson for Room. I just feel like the reason\ncritics are really raving about this film is that it shows their fellow\njournalists getting to be the heroes.\n"},
{"review": "\nMmm, might make my top 50 of 2015. It's a perfectly good movie about\ninvestigative journalism, and it's interesting to see the process of\njournalists, but it's extremely pedestrian filmmaking and has like zero\ninsight into the subject at hand (which is the cover-up of priest\nmolestations). Michael Keaton, Mark Ruffalo, Rachel McAdams and Brian\nd'Arcy James play the Spotlight team at the Boston Globe. They're all\ngood, but, except for one big moment with Ruffalo, none of them do\nanything exceptional. The Globe's new editor, Liev Schreiber (somewhat\nmore interesting, but not much), decides to follow-up on some earlier\nstories about the subject he thinks are incomplete. The best\nperformance in the film belongs to Stanley Tucci, who plays a lawyer\nfor victims. The second best belongs to Neal Huff as the leader of a\nvictims' organization. Both Huff and Tucci are angry that the Globe is\njust now getting interested in the story. I think even critics in\nBoston know that Mad Max: Fury Road is a better film than this. Maybe\nsome day the Spotlight team can uncover that conspiracy.\n"},
{"review": "\nThe topic is interesting, the real story is horrifying, the cast is\nstellar. But it is not working that well.. and I think it is the\ndirecting and maybe the editing. You do not feel the impact of the\ndrama. It is like if an assistant with a camera is just following the\nheroes. It is distant, you cannot feel the tense, the importance of the\ncase ... <br><br>And acting could be a bit better as well. Maybe the actors were too\nfocused imitating the real people behind the characters instead of\nshowing emotions.<br><br>Still, it is a movie I recommend you to watch.\n"},
{"review": "\nIt feels to me like an hour long crime drama, like Law and Order:\nSpecial Victims Unit, except they are not cops, they're an\ninvestigative journalism team, very similar to the movie Truth, but\ninstead of being TV journalist, they are members of the Boston Globe,\nbut going up against just as powerful of an opponent\u0085The Church.<br><br>Based on a true story, Spotlight is an investigative news column within\nthe Boston Globe, who back in 2001 were ask to do a follow up story on\na Priest caught molesting, a child, which open up a bigger conspiracy. <br><br>It was gripping watching this team go after the story. One of the\nelements that was really intriguing is how long it actually takes for\nthis team to compile this particular story. It took them mouths to\nfinish the story, but it does not feel like mouths, cause they make the\nstory they try to compile interesting to watch. Plus we get to know the\ncharacters on a personal level without getting too personal. Nothing\ntakes us away from the main focus of the movie.<br><br>Mark Ruffalo gives an impressive performance as Michael Rezendes. He\nwas very intense and passionate and it comes off great, and was a great\nrole for him. He stood out in a very interesting ensemble cast that\nincluded Michael Keaton, as the editor of spotlight supporting his\nreporters as they chase the story and Liev Schreiber, as the new editor\nand chief of the Globe, an outsider who saw a story that the others too\nclose to home, did not. They're other great performances from Rachel\nMcAdams and Stanley Tucci as well. <br><br>Spotlight also makes Boston itself a charter, by using scenery to show\nwhat a small town it can be and how much of an influence the Catholic\nChurch has on it. <br><br>It hits all the right buttons without trying, that's a sign of good\nstory telling. It brings you into a compelling story, well acted by a\ngreat cast that did great things together.\n"},
{"review": "\nI finally saw this film a few hours before tonight's Academy Awards\nbroadcast. I had a feeling that it had the chops to win the big one.\nMany of my friends have been touting it. It takes a truly skilled\ndirector and screenwriter to entice an audience to watch something\nwhere they already know the result. We are made aware of the foothold\nof the Catholic Church in the city of Boston. When a new news director\ncomes on board, he feeds the need for an investigation into priest\nmisconduct to the Spotlight team, a group of hard core reporters who\nare unyielding in their persistent investigation of whatever story is\nthere. The beauty of this film is that at no time is there a sense of\nsensationalism. Yes, the church tries to cut them off at the pass and\nuses sealed documents as a weapon, but time is the issue as much as\nanything visible. Strong performances abound, but the characters have\nweaknesses and at times become a bit emotional over their task. This\nplays out with subtlety and an almost you-are-there sense. Loved this.\n"},
{"review": "\nBy no means movies awarded the best movie academy award are the best\nout there. That's for sure. Neither Miss Universe is the \"most\nbeautiful woman in the world\" etc.<br><br>I will probably fail to remember which movies won the Oscar the last 3\ndecades. Some of them are totally forgettable and makes you wonder if\nthey were deserving a nomination in the first place. In my opinion \"the\nbest picture of the year\" should be a game changing movie, that leaves\nyou speechless while you are watching it and make a permanent imprint\nin your mind and soul.<br><br>Spotlight won the Oscar for the best movie of 2016. Was it worth it? In\nmy opinion faaaar from it. Was it a bad movie? Of course not. But it is\nfar from being great. It has adequate performances from the well known\nleads. A bright photography, which for me is always a plus, but...<br><br>Of course the premise touches a sensitive subject but it doesn't make\nan impact to the audience. You will hear: the number is not 13 it's\nmore than that like 20 or even 90, and that is supposed to have an\nimpact to the viewers, about the scale of child molestation from\npriests and a possible church cover-up, but it really hasn't. You hear\n2-3 testimonies but you don't see the act, not even in the form of a\nflashback. So, for that, it is not effective.<br><br>I read some reviews praising how \"controlled\" this movie is. In my\nopinion that was a mistake for that subject. The testimonies weren't\nenough to draw a picture about the problem. Also there is no actual\nheroes here. The reporters just doing their work and the paper had the\nopportunity to do something years ago but let it slide.<br><br>Overall: I cannot understand how this movie is considered as the best\nof 2016. It is a mild ride. No surprises no heroes. A little bit on the\nboring side in its 2 hours 7 minutes duration. Nothing extraordinary.\nJust adequate as a film and far less than that as a statement against a\nserious problem of our societies.\n"},
{"review": "\nThis was a solid drama elevated by superior acting from a top-notch\ncast but I left the theater somewhat underwhelmed. The movie lacked the\nsort of drama that makes you wonder how the story will end even when\nyou know how the story will end. The main problem is that the Catholic\nChurch just doesn't come across as a particularly forceful adversary.\nWe're told that the Church is so powerful and has kept the abuse hidden\nfor decades, but when a group of reporters actually goes digging they\nencounter some roadblocks but nothing that gives you the sense that the\nChurch was something to be feared. While I didn't necessarily need\nCardinal Law to dispatch some Opus Dei goons to discourage the\nreporters and the victims, the movie would have been more rewarding if\nthey'd encountered much stronger resistance from the Church, public\nofficials, and their own family and friends.\n"},
{"review": "\nI first watched this movie the day after the Oscar's after it received\nits best picture award, so I went into it with expectations but they\nweren't too high for I know about how critics may eat this up but\nothers may not be interested. My expectations were exceeded beyond what\nI could ever imagine. I couldn't believe that this actually happened\nand it was really amazing to watch as they try to uncover something\nthat has affected so many people. the cast was also terrific, there\nreally was no weak link and each member of the cast helped portray this\nin a way that could not have been any better. This is one of the best\nmovies I have ever seen and it is one that I will never forget.\n"},
{"review": "\nA story about a publication, journalists and detailing an unfolding\nscandal within the Catholic Church. Set in the early noughties during\n9/11, the film doesn't even go much into detail with the journalist's\nlives, their relationships with other but focuses on the victims, the\nscandal and process of exposing the scandal. An astounding film, on par\nif not surpassing 'All the Presidents Men (1976)' of the Watergate\nscandal with 21st Century appeal. Can't think of a film since that. Not\nonly thoroughly engaging as you walk away from this film informed of\nhow journalism but also how the legal system works as well as being\ngripped enfolding scandal. All of it condensed into cinematic story\ntelling backed up by a strong cast.\n"},
{"review": "\nI had heard about the Globe story -- I had no idea about the grind and\ndrama that went into working these horrific actions. Anyway I hired the\nmovie on a recommendation, if this was a book, I'd be writing \"page\nturner\" -- I have children and my hat is off to the cast, the writers\nand the actual reporters who have shown us some of the true horror in\nthis world.<br><br>I don't know how factual the information was in the movie. We've been\nhearing news reports here about child abuse in all kinds of\ninstitutions, women and men, all social areas, etc. I just dread that\nthe \"6%\" number used in the film, might just be 6% of everyone. That's\nmore than 1 in 20 if \"people are people\".\n"},
{"review": "\nThis movie is great both for what it does, and what it doesn't. There's\nso many traps you can go into making a movie like this, I and salute\nthose who managed to stay clear of them.<br><br>I don't know enough about the case itself or the people involved in it\nto say anything about how authentic it is, but it all feels very close\nto the truth. None of the characters feels forced, or put there only to\nkeep the story together. It does not seem like they try to squeeze the\nmost out of certain characters that they suspect will be popular with\nthe audience. It's all a dynamic, natural story being told.<br><br>And the story is good. All the president's men proved that\ninvestigative journalist can be exciting without any love stories or\naction scenes. The thrill of the search, the leads and the clues, it\nall adds up together to a great story (pun intended).<br><br>And it's told in such a roundabout way. This is what happened. These\nwere the people involved, and here they are doing their job. The movie\nis intense when they situation is intense, and not due to any audience\nmanipulation.<br><br>It is a great movie. I am not sure why I am not scoring it higher,\nbecause I am not good enough at this to diagnose the flaws. But when\nthe movie was over, I felt that something was missing. And I hope it's\nnot because I want the things I'm praising the movie for avoiding.\n"},
{"review": "\nI enjoyed 'Spotlight'. It's a nicely-paced character driven ensemble\ndrama: a slow-burn investigative tale which heaps outrage upon outrage,\nand builds to an indignant peak before asking the audience a few stern\nquestions about culpability and individual moral responsibility. 'If\nyou tolerate this...', and all that jazz! <br><br>It also gives Michael Keaton his best role in years, reaps a rare\nunderstated but powerful power from Liev Schrieber, and enjoys fine\nsupporting turns from Mark Ruffalo, Rachel McAdam and John Slattery.<br><br>A satisfying piece, and Tom McCarthy's best since the excellent 'The\nStation Agent': the guy knows how to get the best from his cast. <br><br>Yup, I enjoyed it. Would probably have enjoyed it more, mind you, if I\nhadn't been distracted \u0096 just a little \u0096 by an elderly lady two rows in\nfront of me, complaining loudly that it was 'All lies!' every five\nminutes! I'm sorry, dear lady, if you are offended by the film, but\neven the Boston Diocese admitted that this stuff went down, pretty much\nas represented on-screen. <br><br>Still, even in provoking such a rare and adverse reaction \u0096 the lady\nwas asked to leave \u0096 'Spotlight' appears to have been very successful\nin ENGAGING the attention of its audience. Which is, perhaps, the\npoint.\n"},
{"review": "\nA strong drama that tells the true story of abuse by priests in the\ncatholic church, the grand scale of the paedophilia and how far the\ncatholic hierarchy were willing to go to cover it up. <br><br>I will point out that the way this film is paced and the tempo isn't my\npersonal favorite but it flows with a certain class and dignity,\nespecially great when you realise the issue at hand here. Mark\nRuffalo's acting stands out among the rest although Michaels Keaton's\nperformance is also of a high standard. <br><br>Overall a serious film that you must invest in but let it flow and you\nare told a moving, at times troubling true story that will open your\neyes and make you aware just how wide spread the issue truly is.\n"},
{"review": "\nDid the world needed a scandal about child abuse in the Church? Well,\ndefinitely not.<br><br>Did the world needed a film about the uncovering of that scandal? Oh\nyes, it did. And you should watch it, because this film is going to\nmove you.<br><br>\"Spotlight\" (2016's Acadamy Award for Best Picture and Best Original\nScreenplay) is based on a true story. The revelations of the Boston\nGlobe worried the world 15 years ago and shook the Catholic Church to\nits foundations. The \"Spotlight\"-team was awarded for the Pulitzer\nPrize of 2003.<br><br>But even if you know the story behind that all, you will be surprised\nand still shocked, by each revelation during this movie, and you will\ngain much empathy for the investigating journalists.<br><br>That is thanks to the actors especially. It's no wonder the cast won\nthe Critics' Choice Award for \"Best Ensemble\" because Mark Ruffalo,\nRachel McAdams, Michael Keaton and Brian d'Arcy James totally nailed\ntheir characters. Also Liev Schreiber does a great job, as the new\neditor of the Bosten Globe, who gets the ball of investigation rolling.<br><br>And to deliver such an acting and such a passion is not easy in a film\nwhich is set mostly in the basement: the basement of a newspaper office\nand in the deepest basement of humanity.<br><br>Peace.\n"},
{"review": "\nAccurate, mesmerizing, astonishing thriller that will help you question\neverything you believe in. For the first hour of watching this\nperfectly amazing franchise, all I could think was how a couple of\npeople from a magazine were breaking a story. But suddenly mark Ruffalo\nsays up it could have been you. Suddenly the movie gets ultra\nsubstantial. Everything comes back to you. The story changes from being\na revelation to a revolution. Tom McCarthy uses every second of the\nmovie for character or plot development. You start caring about the\ncharacters from the very begginning. Mark Ruffalo, Michael Keaton and\nRachel McAdams give some extraordinary performances. After the credits\nroll out, you find yourself staring at the screen for 10 minutes\ndigesting what you just felt. Best of 2015 and indeed a Oscar winner.\n"},
{"review": "\nI would call this review \"Another Heartbreaking &amp; Excellent Reason Not\nto Be Catholic\" but someone else used it, fittingly, for the film\n\"Philomena\", another brilliant and must see film that exposes the\nunchristian ways of the Catholic Church. Yes I am a Christian so of\ncourse I'm not trying to make church look bad because the wickedness\nthis film is trying to make everyone aware of has absolutely nothing to\ndo with church. \"Spotlight\" is a well-crafted film that showed how the\nBoston Globe uncovered a huge scandal of child molestation in the local\nArchdiocese and how the Catholic Church tried to cover it up. I can see\nwhy this film won an Academy Award for best writing and original screen\nplay, also the performances brought on by Mark Ruffalo, Rachel McAdams,\nand Michael Keaton were fantastic. Being that this film is a true story\nit was disturbing how the Catholic Church went about covering up the\nscandal. While watching this film I was in awe. To me it was almost\nlike the local Archdiocese was worse than the Mafia. It was amazing how\nmuch power and influence they had on the community. \"Spotlight\" is\ndefinitely a must see, not only because it's a great film but also what\nthe film is about. I highly recommend this film. Please see it.\n"},
{"review": "\nSpotlight is a biographical drama directed by Tom McCarthy and stars\nMark Ruffalo, Michael Keaton, Rachel McAdams, John Slattery, Stanley\nTucci, Brian d'Arcy James, Liev Schreiber, and Billy Crudup. The film\nfollows Boston Globe's Spotlight team and its investigation into cases\nof widespread and systemic child sex abuse in the Boston area by\nnumerous Roman Catholic priests. This is a masterpiece of a film, with\nincredible acting and a great true story to go along with it. The\ndirector Tom McCarthy totally got the story right and paid tribute to\nthe amazing journalists while never making them look like people with\nsuperpowers or anything other than normal people tackling a story with\nweight for the good of everyone. Everybody does a fantastic job here,\nbut Mark Ruffalo stood out to me the most from the bunch. He was\namazing and was fully committed to the role from beginning to the end.\nAlso the soundtrack by Howard Shore was Oscar worthy even though it\nwasn't even nominated on the category for some reason. Everything from\nthe cinematography to the music and the editing builds up to an\nabsolute masterpiece of a film that is created superbly for our eyes to\nenjoy and our minds to think.\n"},
{"review": "\nPart docudrama, part social record, Spotlight highlights the crusading\nefforts by one group of journalists to bring to public awareness the\nmassive scale of child abuse perpetrated by Catholic priests over\ndecades in the late 20th and early 21st centuries. Slowly, not only the\nscale of the abuse, but the cruel indifference of church hierarchy and\nlaity to children's suffering, historical collusion of Boston\nauthorities, and the willful turning of a blind eye by the journalists\nthemselves comes to the fore. This film is compelling and highly\nuncomfortable in equal measure. The investigation is carefully revealed\nwithout ever feeling heavy in exposition. Keaton is superb, and\nRuffalo's pugnacious determination becomes the lightning rod for the\nrising fury of the audience. I came to this film wary of a\ndialogue-heavy, slightly preachy event. Instead, I left deeply\naffected, moved, curious, enraged, and humbled by the efforts of these\njournalists to shine a light on the unspeakable, and reveal the\namorality of power. Possibly the best film about investigative\njournalism since All The President's Men, and a classic in its own\nright.\n"},
{"review": "\nInitially I rated this film with a ten. But after several days I lower\nit to nine.<br><br>The film is good, no doubt. But maybe it is not really all about film\nthat is good and great but rather the story itself which is intriguing\nand controversial especially given the fact that it is based on the\ntrue events.<br><br>I must say that the very ending with the names of places around the\nworld where those crimes took place was what left the biggest 'wow'\nimpact on me. Because you see that this is something really huge and\nyou realize how big and powerful must Vatican be to cover all this up\nand keep it under rug swept.<br><br>The actors were all great - both journalists and the victims. And\nalthough no scenes of actual crimes were shown, you can imagine the\npainful experiences. It is a sign that the film was done in a great\nmanner ( for me) but still... just a bit away from the best rating.\n"},
{"review": "\nWell, when you choose to watch a movie with such a \"difficult\" topic,\nyou're always kind of \"on the fence\". I have to say that I really\nenjoyed every minute of the movie (as much as enjoy can be used as a\nverb in this type of cases). <br><br>Amazing acting, wonderful cast and a truly breathtaking story that no\nmatter how inconvenient it might be, it was 100% true. Mark Ruffalo and\nLiev Schreiber were truly amazing as was Stanley Tucci who's one of my\nall time favorite \"chameleon-like\" actors. <br><br>Especially the character of Marty Baron was a weird one, as you\ninstinctively disliked him in the beginning but for me, as the movie\nwent on, he became one of my favorites. I would highly recommend the\nmovie, even if you're not in the mood for something really deep or with\nlots of moral questions. I actually wanted to watch a cartoon instead\nbut the movie captivated me from the first minute to its last...\n"}
]