[
{"review": "\nArrival is the best sci-fi film I've seen in my 22-year-old lifespan. I\nhaven't seen certain sci-fi films like They Live, Alien 3, or\nMetropolis, so I can speak only from the standpoint of someone who\nwatches a shitload of narrative, documentary and experimental films.\nSome of my recent favorites are Holy Motors (2012), Son of Saul (2015),\nand The Look of Silence (2015).<br><br>I just saw Arrival two days ago at the Telluride Film Fest and everyone\nin the theater had their brains cheesed out at various points in the\nfilm. For people paying close attention to every frame, the rules of\nthe film might become clear in the beginning sequences. For an Average\nJoe moviegoer like me, the film is a slow, natural process of discovery\nfrom the first scene to the last. The influences of Stanley Kubrick on\nscience fiction films has been noted time after time, but Arrival picks\nup its Kubrick vibes with it's slow sense of discovery, even if Amy\nAdams and her technology moves around the screen more frantically than\n2001: A Space Odyssey. That's why I respect this film and also why I\nlike 10 Cloverfield Lane. A lot of sci-fi films (like the new Star Trek\nreleased this summer) don't create that unfolding sense of\nscience/alien-related mystery. The way information is revealed and\npresented leaves us begging for more answers, and boy does Arrival\ndeliver. <br><br>Oscar-worthy for sure, especially in production design/special\neffects/sound. Don't blow it, go see it November 11th or whenever it's\ncoming to your town. <br><br>Bring earplugs.<br><br>Just kidding.<br><br>But seriously.\n"},
{"review": "\nPrior to approaching this film, a word of warning that it is what many\nlike to call a \"thinking person's sci-fi\". If you're going to watch\nthis, I beg that you dedicate your utmost attention to it, as it is\ntruly one rewarding experience, one of the smartest, most\nwell-constructed science fiction marvels of recent years. 'Arrival' is\nVilleneuve's magnum opus.<br><br>Firstly, to put your mind at ease, I won't be analysing the plot, thus\navoiding the use of spoilers. This decade, Villeneuve has crafted some\nfantastic works of art in the form of 'Prisoners', 'Sicario' and now\nthis science fiction gem, and here's hoping his career further develops\nwith more movie masterpieces coming our way. In a world where mysteries\nremain and the possibility of extraterrestrial life still stands\nunanswered, 'Arrival' approaches this with it's cliché-free take on the\ngenre.<br><br>The relatively unknown Bradford Young provides the film with some of\nthe most stunning cinematography ever conceived, taking advantage of\nthe twilight hour to give the film its somewhat unique look, supported\nmagnificently by Icelandic composer Jóhann Jóhannsson whose score is\nboth haunting and beautiful. If you're someone looking for a\nscience-fiction tale that keeps you guessing and thinking throughout,\nwith fantastic performances, cinematography, music and near-flawless\ndirection, then 'Arrival' is the film for you. The masterpiece of 2016!\n"},
{"review": "\nARRIVAL delivers on so many levels it's impossible to describe without\nspoilers. The book is out there, so if you really must know before you\nsee a film, read, \"The Story of Your Life\" by Ted Chiang...but I highly\nrecommend you see the movie first. Honestly. You want it to unfold as a\nwarm, fresh croissant on a chilly morning, and melt in your mouth.<br><br>From visually stimulating scenes to an unexpected score masterfully\ncomposed by Jóhann Jóhannsson you recognize at once this is a thinking\nfilm you'll long remember. <br><br>One scene in particular features a cloud that took my breath away.\nSure, the extraterrestrial vehicle was amazing, but that cloud... As a\nphotojournalist of nearly fifty years, I was stunned at the lifelike\ncharacter of the cloud and suspected it was real, though I knew that\nwas impossible; you can't cue Mother Nature when it's time to roll. I\nwanted to praise the CGI team for the effect, but Shawn Levy confirmed\nit was natural. They had set up to shoot this wide shot, worried about\nimpending rain, or too much wind, or the lighting being too dark for\nthe right effect, but the cloud wanted to become a star that day, and\nit rolled into frame with absolute perfection. This scene alone is\nworth a nod to Bradford Young for best cinematography.<br><br>The special effects team delivered, too. <br><br>Amy Adams performance was stunning. Sci-fi is largely disregarded when\nawards are passed out, but if the Academy neglects to acknowledge Adams\nwork in this film, I may boycott them forever. Adams is Oscar-worthy\nfor a Best Actress nomination for her character of linguist Dr. Louise\nBanks in this one, though Meryl Streep will most likely take it for\nFlorence Foster Jenkins. <br><br>It is clear the five years taken to bring this story to the screen were\nwell worth the work. <br><br>Ten well-deserved stars for ARRIVAL. I wish it a huge success at the\nbox office so this team will continue to make more films of this\ncaliber.\n"},
{"review": "\nI saw this last night at the opening of the Mill Valley film Festival.\nArrival is unlike any movie I've ever seen. It's about love, loss,\ntolerance, language and non-linear time, wrapped in a science fiction\nstory about our first encounter with extraterrestrials. <br><br>Under director Denis Villeneuve's masterful direction, Arrival takes\nits time to unfold, but it gradually gets under your skin and commands\nyour attention. The last half hour was one of the most emotional\nexperiences I've had at the movies in a long time. There aren't many\nmovies these days that I would call required viewing, but this is one\nof them. And Amy Adams is Oscar-worthy in the lead role. In fact,\nArrival could also win Oscars for original score, sound, direction and\nBest Picture.\n"},
{"review": "\nTo this reviewer, there are two kinds of sci fi.<br><br>The common type dates back to Buck Rogers and has more modern\niterations in Star Trek and Star Wars. Action and mayhem.<br><br>The other type, the \"smart\" or intellectual type, is harder to\nclassify. It has been around forever but appears and disappears\nrandomly. Consider the DAY THE EARTH STOOD STILL (1951/2008) or CUBE\n(1997) or the more recent MARTIAN (2015).<br><br>Or simply give it up and consider ARRIVAL the best example of the\n\"Smart\" genre ever done.<br><br>And if Ms. Adams does not get an Oscar nod for picking this film up and\ncarrying it to the finish line (oh those eyes!) this reviewer will eat\nhis review.<br><br>A must see.\n"},
{"review": "\nPlease save your money. If I could, I would have requested my money\nback. When the film ended I heard at least 4 couples saying WTF!!!!\nReally boring movie. Not even close to any of the classics. I am\nreading all of the reviews that are saying a classic, right up there\nwith close encounter etc.... NOT EVEN CLOSE. All you want to do is\nsmack Amy Adams in the first 1/3 of the movie. Not a good character for\nher to play. Forrest Whittaker has the funniest accent(i think its\nBoston) you have ever heard. Totally goofy and giggle out loud funny. I\nlove SYFY movies, they don't have to be CGI, wham, bam type movies but\nthis is a total waste, gives you nothing and leave you with nothing.\nPeople will say , \"Man this really gets you thinking\", yeah it does, I\nwas thinking where the freaking nearest exist was 1/2way through the\nmovie. You are constantly waiting for the movie to get moving. NEVER\nhappens. Slow, grey, and totally un-moving. It tries to play on the\nheart strings a bit but fails dismally. I wont reveal the end but 1. If\nyou go don't blame me 2. Try not to throw your popcorn at the move\nscreen at the end, believe me you will have most of it left over.<br><br>If there was zero stars I would have given it. Total waste of time and\nmoney.\n"},
{"review": "\nHow did they get this green-lighted? Why did anyone want to make this\nfilm? I kept waiting for something to happen, butt nothing did. There\nwas a subplot of sorts, with a whispered narrative. Big chicken feet\ncame out of the mist to squirt ink blots on a glass wall. Whaaaat??\nThat's the alien encounter? I resented waiting on line to see this\nidiotic piece of crap for free. On my worst movies ever list. I was\nhoping for some great CGI, but that was not evident, either. Lots of\ngreen screening and flipping back and forth in time. Amy Adams and\nJeremy Renners performances are faultless. it's the plot that leaves\nyou wondering what is that about? Ultimately, boring and anticlimactic.\n"},
{"review": "\nNote to self: be sure to check the default sort order for IMDb reviews.\nI realize now that it was set to 'best' and combined with all the\nglowing reviews and 8.5 stars I was going to enjoy my first night at\nthe movies since Christmas.<br><br>So very wrong.<br><br>I don't thank I'm revealing any spoilers, but just in case, i'll say it\nnow.<br><br>The movie is about a linguist brought in to try and communicate with\naliens that have appeared around the globe. And that's it. You would\nthink that if she was successful there would be huge implications and\nif she was not successful there would also be huge implications. In the\nend, there were no implications - she wrote a book. And the book had no\nimpact on the world either. The end.<br><br>This is why I'm such a happy Netflix customer. I can give the movie\nhalf an hour to get going and when I realize that it's going to be a\nstinker (aka Fury) I can stop it and move on to something else. In this\ncase, I was trapped in a sold out theatre. When it was done everyone\njust quietly filed out. I'm pretty sure its because, like me they were\ntrying to figure out what the point was and how they got tricked into\nwatching it.<br><br>I'll give it a star though for the music score.\n"},
{"review": "\nSaw this at TIFF and was incredibly impressed. This movie has all the\nright components of an exceptional film - great cast, great director,\nand a great script that took a somewhat tired premise and turned out a\nscript full of thought-provoking substance, and a highly original\ntwist.<br><br>This movie's true beauty was how it masterfully balanced the plot and\nsub-plot throughout the entire film - to the point that the build-up to\nthe sub-plot (which also ends up being the twist at the end) is done\nvery subtly throughout the movie without the viewer even knowing for\nthe most part. It's only in the last half hour that Villeneuve starts\npresenting it's relevance for to the viewer. However, the primary plot\ndoes not suffer, it's only enriched.<br><br>This movie was an exceptional combination of great story-telling and a\ncast and crew at the top of their game delivering an entertaining film\nthat will have audiences talking about the questions it raises.\n"},
{"review": "\nCONTAINS SPOILER Not a big though.<br><br>There's a moment when Louise calls to the Chinese General, and he\nchanges his decision, and then Peace on Earth comes... they show us a\nlot of TV-screens with news from different countries, and there's also\nRussian news with the title (in Russian) \"The Government is searching\nfor Pakistani rebels\". Lol sounds like Russia was busy with other\nconcerns. <br><br>So, it was the best moment in the film. I give 1 of 10 for only this\nscene. <br><br>The rest of the movie was boring, pretentious, far-fetched pseudo-scifi\nsob story with a lack of common sense. Typical Hollywood. <br><br>I really do not understand acclaims and high ratings this movie gets.\nDid these people see the film?\n"},
{"review": "\nWell technically this is not a 1 star, but the 8.5 rating feels so\nrepulsive to me that I cannot help myself. THis movie was not good-\neven though it had all the tools to actually be good. It had decent\ncinematography (First scene when helicoptering to the ship was really\nnice actually, the way the background sounds melt into something like a\nson, really liked that) and the score was pretty nice. Some tracks are\nvery original and well produced, others are the kind of typical OST,\nbut good nevertheless. The first half of the movie had me interested,\nthe mystery was clear and how it will be solved was definitely the\nbiggest part of the movie. Unfortunately dialogues and especially the\nscenes with her kid were just off. All the scenes with the little girl\nsucked. The dialogue was bad, too cliché, too wannabe emotional. If any\nGerman read this - one line at the end of the movie is literally a\nFielmann advertisement. Literally. \"If you could relive your life one\nmore time, would you do everything just like you did before?\" No, Amy\nAdams would buy her glasses at Fielmann from the very start. Lmao. So\ndialogue is bad, and the worst thing about it is that the twist cannot\nmake up for it as it also sucks. It is obvious and feels rushed, as if\nthe writers were not sure how to pull off a real ending to this story\nand they just pushed whatever came into their mind. It was poorly\nconstructed and fairly obvious. All in all movie deserves 3-4, maximum\n5 stars. It is Interstellar in poor. If you like SciFi give it a try,\napparently many liked this movie (i do not know why to be perfectly\nhonest) and if not just stay away. Definitely not worth the watch for\nthe regular movie watcher.\n"},
{"review": "\nI love SF, but I didn't love this. First, it is slow. It is so slow I\nnearly fell asleep. People were leaving the theatre. Agonisingly long\nshots of the heroine with quivering lip trying to show fear, instead\nshowing angst and indecision. 'Mood' shots that bore. Repetitive motifs\nthat are simply dull. Second, it tries to be dramatic and fails.\nHorribly. Overly loud music/sound effects (think Cloverfield without\nthe menace), super-slushy strings for emotional scenes that are not\nthat emotional and I found it difficult to care about, and a score that\nis just odd, like bad ambient music. Third, the actual story is nothing\nspecial. Heroine is called in to save the day, after difficulties, she\ndoes. Wow. The 'reveals' are not exceptional, and the whole basic\npremise of the film, the 'thing that makes it special' is so contrived\nthat no matter what happened or you wanted to happen could be inserted\nand explained away. It's like a McGuffin. Fourth, the plot has a\nglaring hole in it, you wonder why 'they' did what they did in tat way.\nIt just doesn't make sense. I liked the idea of the film, but the\nexecution was really poor. Sunday evening with partner on the sofa,\nunder a blanket with a bottle of wine.\n"},
{"review": "\nI am not impressed by the movie. It was too trivial for my personal\ntaste. All that happens in the movie can be summed up in the following\nbullet point: protagonist has flashbacks and nightmares, protagonist\n\"communicates\" with aliens, miscommunication occurs, they resolve the\n\"problem\", movie ends. <br><br>But that's not even what really bugs me out about the movie. Lets talk\nsome real science here. I have been studying languages too and I am a\nphysicist by trade so I think that I am more than qualified to make a\njudgement call. The biggest flaw of the movie is that it makes\nabsolutely no sense. Apart from the fact that the aliens just started\nto scribble everything down instead of communicating vocally (If you\nwere in a foreign country where people didn't speak your language you\nwouldn't just start scribbling things down). It's impossible to\ndecipher a completely unknown language without prior knowledge about\nthe syntax and etymological nature of the aforementioned language. If\nwe were unable to decipher the Voynich manuscript for over 500 years we\nwon't be able to decipher an alien language in a mere month. That's\njust a fact. Sorry<br><br>Both protagonists are technically superfluous. Everything that they've\ndone in terms of deciphering the language could've been achieved in a\ntimely fashion by simply utilizing ML (machine learning) algorithms. I\nknow this to be true because that's what I'm currently doing for a\nliving.<br><br>The movie ends with one of the protagonists asking the other: \"You\nwanna make a baby?\" How very classy and romantic... (Sarcasm)<br><br>Concluding remarks: the whole \"they have a non-linear understanding of\ntime\" babble is pseudo-scientific hokum. Time is linear (because of\nentropy). I hate it when people pervert the hard sciences like that.\n"},
{"review": "\nNote: This is a personal review based on my preference and likes.<br><br>I wanted to like this film, given I was hoping for a scifi film that\ndidn't hang on the action to make it great. This wasn't that film.<br><br>The film is slow, constantly throwing out flashes of depressing content\nand making loud, unnecessary noises to try to create an atmosphere. The\naudio effects especially put me off the 'big' moments, i'd have\npreferred mysterious or subtle effects instead of glaring ones the film\nused.<br><br>It reminds me a great deal of the game Firewatch, where on one hand you\nhave this amazing thing and on the other a constant reminder of pain\nand suffering. Perhaps some people enjoy this contrast but I didn't, it\nruined the best parts of the film by constantly dragging you back in to\npainful parts.<br><br>So for me this gets a 2 for: - Poor Audio - Sad Parts break up the\nstory, take those out and it would be passable. At the very least just\nshow them once.. - Poor Audio - Desire to leave the cinema before the\nfilm ended, felt bored + Thinking out of the box and being a little\ndifferent + Special Effects and camera use, some very nice shots in the\nfilm\n"},
{"review": "\nI am a huge Sci Fi fan and was looking forward to this new movie\nstarring Amy Adams and Jeremy Renner. The trailer drew me in instantly\nbut within 30mins of the movie hardly anything was happening. It is one\nof the slowest paced movies I have sat through. The catch phrase that\nappears on the movie poster is 'Why are they here?' After two hours\nsitting in a cinema my response is WHO CARES. This movie had potential\nbut should have been a short film instead. The story could have been\ntold in 20mins. Dumbest looking aliens ever that would be best served\non a seafood platter because there is no way those things could have\nbuilt a spaceship let alone taken it to earth. Sci Fi can be other\nworldly but the level of sophistication these aliens apparently\npossessed stretched the borders of imagination to the ridiculous. This\nis a movie that contemplates its navel and finds only fluff there.\nSpend your money elsewhere\n"},
{"review": "\nThe film is definitely inspired by Christopher Nolan's film\nInterstellar and had a lot of potential with an interesting\nperspective. The visual side is certainly good. Unfortunately, there\nare more plot holes and several omissions. No explanation is given\nabout the coming of the ETs and their 'innocent' goals (to share\nknowledge). In essence, this is too much a philosophical drama\nsurrounding the protagonist (Dr. Louise Banks) and less insight into\nthe ETs. Unfortunately implausible plots in such a situation. Same\nparallel with 'Interstellar' for some unknown reason, ET's decided to\naid mankind, who is being put as the center of attention in this solar\nsystem. It is unknown why the ET's put up with all the human nonsense.\nCertainly the movie is not thought out well enough to this point. If we\nview the movie as a science-fiction flick it fails, but as a\nphilosophical drama, it has some potential if you ignore the\nunexplained paradox that occurs with the metaphysical.\n"},
{"review": "\n100% on Rotten Tomatoes? WTF?! I'm a big sci-fi movie fan especially if\nits story is quite philosophical and cerebral which IS the case with\nArrival, but it got bogged down in the complexities of showing how\nhumans would communicate with a superior alien intelligence amidst a\ndistrusting and violent Earth society. Figure out how to communicate\nquickly enough with the aliens in order to prevent war is the main\npremise.<br><br>I got confused. There are dream like flashbacks that at first don't\nmake sense, combined with a lot of Amy Adam's long drawn out ogle eye'd\ntearful stares of bewilderment morphing to fear bordering on amazement\nas she attempts to communicate and build a vocabulary as a translator\nwith the alien entities. Yes! Great visuals and audio to keep me\ninterested in how this was done.<br><br>But this movie relies heavily on building tension this way from an\naudience with high expectation and anticipation of what's going to\nhappen next with a pay out that is a bit of a let down, drawn out and\nconfusing to keep up with. I actually was struggling to keep from\ndozing off, but that may be from my trying to beat the anticipated\ncrowds (going Rotten Tomatoes 100% review) at a midnight viewing the\nday before Friday release. There were just a handful in the audience\nthat night.<br><br>Besides I was expecting something more profound than Jodie Foster's\n\"Contact\", a much better movie at relying on audience expectation and\nanticipation from experiencing a unique imagining of what it would be\nlike to communicate with extraterrestrial alien intelligence that also\nexplains how they overcome the limitations of space travel. \"Arrival\"\ndoesn't even go there. But it's still a well made movie.\n"},
{"review": "\nFirst thing I'd like to say is this is the most over-rated movie I've\nseen in 2016! I'll eschew the bandwagon and tell you the\ntruth.....boring, Boooooring.......unless you want to watch endless\nsequences of the heroine's face \"showing expression\" and a seemingly\nendless sequence of \"swirling hair, swirling mist, swirling hair,\nswirling mist...\", well, you get the picture. <br><br>This is simply yet another example of a filmmaker trying to awe us with\nthe CinemaScope because there's next to no story line there! <br><br>Her co-star appears to have no purpose except to stare at her in awe,\nwhile she stumbles around and experiences flashback after flashback of\nsupposedly meaningful memories? of her daughter. Oh, yeah, she's so\nawe-inspiring that he can't help but fall in love with her.....gee,\ndidn't see THAT coming! <br><br>I'm not bashing Amy Adams, as to spend and entire two hours pulling out\nendless facial expressions of confusion and sadness, alternating first\none, then the other, surely takes great skill. <br><br>Truthfully, the leap between her being selected to talk to the aliens\nbecause she was simply a renowned linguist with an old pre-existing\nsecurity clearance to, \"oh, yeah, actually she is the only person ON\nEARTH who is clairvoyant\", defies imagination. Give me a big fat break,\nand start putting out movies with substance, and quit counting on \"jump\non the band wagon reviews\" to pump your attendance records! <br><br>Ask anyone who attended this movie, \"Would you bother to watch it\nagain?\" I think not!\n"},
{"review": "\nHere we go again...<br><br>Arrival is another cliché-ridden, over-sentimental pseudo-science-\nfiction story with that ad-nauseam message that the world, humanity\nneeds to works as one or else.<br><br>Arrival joins ranks with pseudo-science-fiction bombs such as\nInterstellar and Prometheus which are films that substitute true\nadventure, discovery with this idiotic humanist, intimist, sentimental,\npsychological-whatever drivel. And curiously, one of the main\ncharacters behaves in the same mindless way as a character in\nPrometheus and removes her protective gear so that the aliens could see\nher better....It seems stupidity is contagious.<br><br>For god's sake, aliens are contacting humanity for the first time and\nall the directors and script writers have to show is this sugary syrup\nof a story? And the twist (yes, of course, there is a twist) is mind-\nboggling stupid. Writers had a nice concept, but did not know how to\ndevelop it nor how to close the story in an intelligent way. <br><br>Arrival is another dumb story packaged with an interesting photography.<br><br>It is 100% eye candy and nothing else.\n"},
{"review": "\nThis movie was amazing with many twists and turns. I wont tell to much\ncause I don't want to give much away. Rarely does a movie come along\nthat makes you ask questions like this one. I hope there is a sequel\nspoilers about when the heptopods need our help 3000 years in the\nfuture! spoilers I felt that there were many great topics brought up in\nthis movie, and I would recommend it to everybody. Unless you are one\nof those people who ask a bunch of questions during a movie... it has a\nlot of twist that you don't expect. Overall this movie is a 10 out of\n10 perfect. I understand why people are enjoying it so much. I am an\naspiring film maker and this is the exact type of film I want to make\n"},
{"review": "\nBelieve the hype because Arrival was great! The film was able to pay\nomoge to other Sci-Fi films while remaining it own thing. The way the\nstory is told is much different from other Sci-Fi movies involving\nextra terrestrials such as Independence Day, which makes the film all\nthe interesting. The way the score was used was also fantastic, and\nwill stay in your head long after you have seen it. The performances in\nthe movie particularly Amy Adams were all very good. The film also had\nimplications and subtitles that will stick with you as well. The film\nmanages to be smart without making the plot overly complex while still\nremaining fun. The only real issues I can find in this film is that\nthere are convenices, as well as a bit to much chesse in some areas,\nbut it never ditracted from my enjoyment of the movie. Overall I highly\nrecommend you check this movie out and I'm giving Arrival an 8/10!\n"},
{"review": "\nQuite honestly, I was excited for this film for a reason most others\nprobably weren't: I love the study of linguistics, the ideals of\nmultilingualism and universal communication. <br><br>I honestly didn't care what the aliens looked like going into it, but\nnow that I've seen the giant squid, I have something to say to\nHollywood. Please consult E.O. Wilson for all future alien films,\nbecause no advanced species capable of space travel would look like\nthat. They wouldn't travel in a giant cloudy rock, they would have some\nsemblance of opposable thumbs, and would have the ability to use their\nappendages to manipulate tools. These are just the facts of biological\ndevelopment and technological enhancement; not just on our planet, but\non any planet capable of sustaining life (which would in any case be\nvery similar to Earth.)<br><br>The rest of the movie was alright, if tediously paced and\nover-moralized. Look, I like the concept of some time-bending language,\nbut humanity's problem is not that we have languages that force us to\nexperience time linearly, but that we exist in a mostly rational,\ncause-and-effect universe that forces us to subsist in a linear\ntimeline, and our languages correspondingly reflect that. <br><br>Keep the message, but work on your writing of our base, pitiful, linear\nEnglish. Maybe then at least you'll be able to tell a compelling story.\n"},
{"review": "\nMost of the 'sci-fi' from big studios feels more like watching someone\nplaying a video game, with maximum action per-frame. Not that there's\nanything wrong with that. To my mind, great sci-fi makes the viewer\nthink about stuff they never considered. Or ponder mundane things in\nunimagined ways. I found Arrival immensely satisfying in the way my\nfavorite sci-fi books did. Like Clarke's Childhood's End or Card's\nEnder series, the scope of the story continues to build - as do the\nrepercussions. The story ends at a very different place ....or at least\nwith the attentive viewer in a very different place than they were\nlikely at when the movie began. I must say, the quiet yet unsettling\nway the film begins had me hooked from the start. I admit I had\nflashbacks to the chills I had on 9/11 when it finally hit me that\n'everything has instantly changed in ways I couldn't imagine. What do I\ndo now?' And I ended up going through the mundane motions trying to\ninternally digest this profound and jarring paradigm shift. If you want\nan action flick like Independence Day or Armageddon, look elsewhere. If\nyou want a film that stays with you and haunts you - like Children of\nMen... then maybe you'll like Arrival. Everyone in the cast and crew\ndeserve every accolade and award they're nominated for. Above all, if\nthis film isn't nominated for 'best adapted screenplay' there is no\njustice. I have not seen a film that lived up to my unrealistic\nanticipation in a long long time. Arrival is truly special and I hope\nbecomes a classic of the sci-fi genre. It's too soon to tell, but I\nwould not be surprised if it ends up at or near the top of most folks'\ntop sci-fi films (or simply story) lists. Profound thanks to everyone\nwho had a hand in making this haunting, eye- opening film.\n"},
{"review": "\nI'm not one to flat out break down in a movie theater but it just\nhappened. My daughter had an extremely rare incurable disease that took\nher from us a little over a year ago. The grief and torment my wife and\nI have endured cannot be expressed or understood by most people...then\nthis movie happened. It shed a new light on the beauty of life and how\nif perceived non-linearly life and death can be the same. The movie\nitself is sheer brilliance. The pacing, the cinematography, the music\n(MY GOD THE MUSIC)...the direction...and Amy Adams. My god she deserves\nall the praise she's been getting. Her grief is palpable. While\nwatching her \"dream\" in Heptapod dreams its as though she's in my mind,\nthinking of the little things and memories of my daughter that I'll\ncherish forever. I don't know how they accomplished this feat of a\nmovie, but I am so glad that for once, since my daughter has passed\naway...I don't feel so...alone.\n"},
{"review": "\nI don't understand the raves for the movie. All it did for me was to\nmake me want to see \"Close Encounters\" again. Acting and production\nvalues were stellar (Amy Adams was outstanding and Jeremy Renner gave\nhis usual tight performance) and those are the only good things I can\nsay about it. Too many plot holes to go into without risking the making\nof spoilers. Just because the script is convoluted and about a very\nserious subject it does not necessarily mean it is good. Since there\nare so few truly serious movies that make it financially I hesitated\nwriting this review. For me it adds to that list of movies that were\ngiven good reviews simply to show how erudite its critics are.\nPretentious does not equate with important or good.\n"},
{"review": "\nDon't listen to the 1 star reviews. They saw spaceships so they\nexpected Independence Day 3 and that is not what this film is. From the\nfirst minute you are hooked. It in not the performance of Amy Adams\neven though she is very good in her role but it is the way the story is\ntold. The visuals and especially the sound. And by sound I mean the\nscore and the sounddesign. It is the clever story that unfolds and\nmakes you think about it after you left the movie theater. After a few\nminutes you realize that you are watching something different from what\nyou have seen a thousand times. I new after Sicario that we can expect\nmore big things from the director and this film proofs me right. Go\nwatch this movie!\n"},
{"review": "\nAfter the arrival of twelve alien vessels on Earth, the government and\nmilitary enlist the help of Louise, a communications expert in an\nattempt to make contact with the interplanetary visitors.<br><br>Arrival is genius. It's filmmaking at its best - with Young's beautiful\ncinematography blended with rich and detailed CGI, combined with\nJohannsson's wonderfully complex score, it's one of the great sensory\nexperiences of the year. As a narrative it's also stunning. Not simply\na story of alien invasion or contact, but a gritty and\nthought-provoking view of humanity and our place in the universe.<br><br>The core of the movie revolves around Adams. She's incredible. The way\nshe invokes the amalgamation of confusion, grief, understanding and joy\nsimultaneously is something special. It helps that the cast around her\ndo a pretty great job as well, but make no mistake, this is her movie.\nShe's the beating heart and we can feel her pulse throughout.<br><br>It's Independence Day with a brain. Villeneuve is a great director,\nmaking a movie that will entertain you and blow you away, while asking\nyou questions about yourself as a human. All-round brilliance.<br><br>5/5\n"},
{"review": "\nFor the first time in my 11 years of watching movies I am able to say I\nhave a new favourite. I've waited for this moment ever since I watched\nThe Lord of the Rings trilogy, doubting it would ever actually come. I\nwas almost there with Interstellar, but it still couldn't top the\nmasterpiece that marked my childhood. Today, however, I can proudly say\nI watched my new favourite movie, that being Arrival. Subtle and\nthought-provoking, Arrival managed not only to meet my high\nexpectations, but exceed them completely. I stared in awe every time\nthe camera began focusing on the enigmatic ships called \"Shells\". I\ncouldn't help but smile when I understood the main plot point and the\nfantastic twist. The acting is top notch with Amy Adams giving an\nOscar-worthy performance and Forest Whitaker and Jeremy Renner at the\ntop of their game. For me it was perfect, as it gave me a new\nperspective and a new matter to think about. I strongly encourage you\nto see it, preferably in cinema, for the best experience. That being\nsaid, I hope my tiny review was helpful and that it gave you enough\nreasons to watch this masterpiece of modern cinema.\n"},
{"review": "\nAfter months of anticipation, \"ARRIVAL\" has got to be one of THE WORST\n\"FIRST CONTACT\" FILMS I've ever seen (no disrespect for the fine\nactors)! (...and I've seen just about every sci-fi movie made!):\ntedious, slow, and boring. Its predecessors, ie The Day the Earth Stood\nStill (the original 1950's version in BW!!!), 2001 &amp; Close Encounters,\nand even \"The Arrival\" from the 90's, are 100 x better.<br><br>Don't waste your bucks on this dreary, over-hyped movie. I can't\nbelieve the high ratings it's getting - did they actually WATCH it?.\nDeep???? Yeah... about as deep as a saucer of sour milk.<br><br>If this clonker is anything to go by, First Contact is going to be\nreally DULL! Stick to STAR TREK, Paramount.<br><br>Unless you're looking for a cure for insomnia, save your money &amp; just\nwatch the trailer - its the best bit. *yawn*\n"},
{"review": "\nAbsolute rubbish. I love science fiction but this was rubbish. NOTHING\nhappens. BORING. Not engaging at all. Do not pay to see this crap. So\ndisappointed! Some reviewers are calling this a masterpiece. A\nmasterpiece of what? I'll tell you what this is a masterpiece of and\nthat is boredom. Seriously the premise is good but the movie failed to\ndeliver excitement, drama, tension, action, character development etc.\nStay away. I was expecting something as good as Prometheus but this was\nso below that. I'd rate this a b grade movie. I just can not understand\nhow this slipped through the goal posts. Oh well lets hope the\nPrometheus sequel is good. You don't get many good science fiction\nmovies made these days they seem to make movies that are just mindless\naction appealing to teenagers.\n"},
{"review": "\nI was looking forward to a decent Alien Movie and hoped this would be\none. Not even close. This was so boring the guy next to me was snoring\nthrough it. Somehow I stayed awake hoping something might come\ntogether. Instead it stayed true in a disjointed fashion with no real\nplot to speak of. Most of the time the movie was spent trying to decode\nthe Aliens language which was like deciphering an ink blot test. There\nwas a bird in a cage that they brought with them when visiting the\nalien ship with no explanation why they always had it with them. Amy\nAdams had lots of flashbacks to being with her daughter back home which\nreally had no coherent reason. I will give Amy Adams and Jeremy Renner\na pass keeping in mind their great performances in American Hustle.\n"},
{"review": "\nI have never written a review. I feel compelled to write one as this\nwas one of the worst films I have seen in my life.<br><br>Absolutely nothing happens.You will never get these 2 hours of life\nback! <br><br>I have seen pretty much every film in the IMDb top 250 and I am a huge\nDenis Villeneuve Fan. Incendies (2010) and Prisoners (2013) are works\nof art. I would place them both in the top 10 films of all time.\nSicario was not great but nowhere near as awful as Arrival. As a\ndirector, I don't think it is possible for Villeneuve to create\nanything as good as Incendies/Prisoners.\n"},
{"review": "\nThis movie was so hyped up - we (me, wife, 13yo daughter) just had to\ngo and check it out right away. Booked tickets way in advance to get\ngood theater seats and we have been avoiding reviews all week so we\ncould be totally blown away by all of the 'surprises' this promised.\nBut now, after watching it, I think the majority of the excellent\nreviews posted on various websites must have been some kind of media\nconspiracy. Truly, I am pretty easy going when it comes to movie\ncritiques - but this movie essentially blew a big snot ball all over me\nduring the last 10 minutes. I was expecting some kind of marvelous\nrevelation or amazing \"ah-ha!\" moment; but when the credits began to\nroll, I realized that was not happening. Nothing was ever really\nexplained. I won't give away any spoilers away but what really\nirritated me was when the aliens were asked \"the real important\nquestion\" the answer they give is - well - you go and watch for\nyourself if you really want to know. This movie is just a bunch of\ndepressing, dreary scenes, and mostly boring, but sometimes the lead\nactors do use some really scientific dialog. I was not impressed nor\nsatisfied with any part of the movie. At the very least, I was hoping\nto enjoy watching the usual perky and cute Amy Adams, but alas she was\ndepressed and frumpy throughout this one. Even the cinematography is\nbland, gray, and utterly lackluster. Then there are the alien space\nships, which you have no doubt already seen in the trailers (or the\nmovie poster), look like grey cow-pies flipped on their sides. So to\nyou good folks out there reading this I say nay-nay on this flick. The\nonly redeeming part of this movie is that I was able to spend some time\nwith my family watching it together, then later discussing how empty it\nleft us all with the ending, so maybe that was worth the $38.00 we\nspent on the tickets. So I gave it an extra star for two-stars overall.\n"},
{"review": "\nI truly can't believe the garbage Hollywood is putting out these days.\nThe thinly veiled political messages, the complete lack of scientific\nfactual logic, it just goes on and on. Dumbed down audiences gobble it\nup. This was one of the worst movies I've seen in a long time. And oh\nyeah, I \"get it\". Believe me people don't waste your money on this\ngarbage. You've seen the same story many times before. Garbage! There\nreally isn't much else to say. People can go on and on about how this\nmovie makes you think, blah blah blah. It makes me think I'm truly sick\nof Hollywood's leftist messages. It makes me think I'm better off\nwatching PBS. Anyone with any amount of logic will see the flaws in\nthis film.\n"},
{"review": "\nHow can anyone rate this movie as 8.5 out of 10 unless they are out of\ntheir mind??<br><br>This movie is EFFING BORING right from the first frame to the last\nframe and everything in between.<br><br>Some movies get really, really lucky to get this kind of rating even\nthough they suck like hell.<br><br>An action movie should start with a bang and end with a bang but this\none has none of those.<br><br>I can't believe Dennis of Sicario fame directed this movie. Maybe he\nshould just stay away from alien movies.<br><br>OI wasted 2 hours of my time that I can never get back.<br><br>Stay away from this movie unless you want to kick yourself after\nwatching it for wasting your time.\n"},
{"review": "\nsome reviewers have made references here to contact. well, dear\nreaders, contact opened with a stunningly imagined &amp; executed reverse\nvoyage from deepest space into the retina of the star crossed lead. not\none image or sequence in this plodding grey un-imaginative movie comes\nanywhere close to greatness. the expectant audience at last night's\nfirst showing in dublin yawned &amp; fidgeted through the show, &amp; some\nlucky ones voted with their feet. i, determined cineast that i am,\nstayed planted to the end, suffering &amp; hoping til the credits roll. i\ncannot see this movie making money, nor more importantly , achieving\nclassic status. a MAJOR disappointment.\n"},
{"review": "\nGreat cinematography and most of the dialogue was solid. There are some\nglaring plot issues that you don't need to look into too deeply to\nreveal = SPOILER ALERT = ..... It asks us to accept that these aliens\nare way more advanced than us (spacecraft tech; interstellar\ncapabilities; non linear time sensing capacities etc) - and yet believe\nthey would need basic language teaching. Even if you disregard the fact\nthat they would already know the teachings (as they know the future! -\nso upon meeting they already will have had those lessons and know the\nteachings); they are so advanced they would have detected our crude\ncommunication via TV/Radio etc and would have learned all earth\nlanguages prior to the \"teacher\" meeting them. It of course then means\nshe has no teaching role in the movie and kind of kills the plot. But\nit is an inconvenient truth all the same. Also the sacrifice of the\nblown up alien would be preventable (they would know the future and so\nhave been able to stop the incident) - but it somehow served as a\nSECOND COMING sacrifice to humanity and so am sure that even though it\nwas predictable and therefore almost certainly preventable (precog\nstyle) - it could well have been put in as a Jesus v2.0 sacrifice. <br><br>Another slight plot issue is that the father of the child is not in the\n\"flashbacks\" (turned out to be premonitions) even though she would\nsurely know who her future husband is (as well as future daughter). Of\ncourse, it had to be that way as showing who that is (will be) would\ngive away the fact she sees the future (when we are led to believe we\nare seeing flashbacks)...<br><br>I don't think it was as gripping and realistic as Contact. It was still\nwell worth seeing as it felt very credible until it moved into the\nrealm of supernatural.\n"},
{"review": "\nExtraterrestrial life arrives in 12 random locations on Earth and\nhumans face their biggest challenge of all, communication between us\nand them. First of all movie was absolutely spectacular in every way\nand so much knowledge and intelligence combined to create an extremely\nclever and smart movie in years. Continuity in developing plot and\nlearning things from directing that was amazing is incredible as you\nare not being forced to break your mind in information but gives you\ntime to process everything. Scenes were extremely beautiful specially\nonce inside shell ( extraterrestrial ship) were mind blowing with lots\nof buildup and intensity. Way of putting scenes and editing of every\nframe of movie was incredible, just giving you what you need and no\nmore. Then ending comes and as it starts to reveal everything giving\naudience all answers and revealing everything was amazing and beautiful\nat the same time. Amy Adams was magnificent as she proves her great\ntalent and elevates every single scene with her commitment and passion\nbut also love and understanding. Jeremy Renner was also such a great\ncharacter inside movie and giving us a more scientific approach but\nalso shows his skill and passion. Writing and directing can be only\ndescribed with miraculous. Intelligent, passionate, brilliant, moving,\nstrong. Spectacular. 10/10\n"},
{"review": "\nAn alien film, that really makes us think. It's played very real if\nthis thing would happen. The effects do not feel faked, it's like we\nthe audience are seeing the spaceship has it was actually here. It's\nfeels like a two part about aliens and who we are as a society. The\nphrase we fear what we don't understand does come into play.<br><br>This film is an odyssey, really pulls you in. A puzzle you slowly put\ntogether. It has a twist that even a movie critic didn't see coming.\nAmy Adams was really good, so Forest Whitaker, although Jeremy Renner\nfelt under used for the most part. It starts out slow, but picks up has\nit goes on. This film reminds us that things are not what they seem,\njust when you think it's gonna fall in the category of those typical\naliens invasion films, it quickly turns it around.\n"},
{"review": "\nI have been waiting for another good turn on the alien contact genre\nfor years. As a scientist myself the richness of new ideas presented\nwas a great experience.<br><br>Both main actors are well-chosen and show an outstanding performance.\nSceneries are well used to develop atmosphere.<br><br>One risk in many alien movies is reaching a final conclusion that is\nsatisfying for the audience and at the same time consistent with the\nplot. This is achieved masterfully in Arrival.<br><br>Score, music and sound effects emphasize the overall feel and\natmosphere of the movie.\n"},
{"review": "\nBeing a linguist myself and a great sci-fi aficionado, I have to say I\nthoroughly enjoyed this amazing cinematic gem. It has absolutely\neverything I could want in a smart and thought provoking sci-fi movie.\nIt had me at the first several seconds - it gripped my attention from\nthe get go and never let up. Music and the actor played a great part in\nthis, but the story itself is what's really amazing. So simple, yet so\ncomplex. I definitely didn't expect the time component but caught on\nrelatively quickly. Definite recommendation for people who are not\nbrainless sheep used to Hollywood crash-boom-bang kind of sci fi. This\nis a meditative experience about human nature and its indestructible\nspirit. Tell all your friends about it.\n"},
{"review": "\nThis is an amazing movie.<br><br>It is dramatic, phenomenal. There are no action sequences yet you are\nglued to the screen from beginning to end.<br><br>The story starts as Aliens appear on earth and are pacific. The\nprotagonist then goes to help the government translate the aliens\nlanguage.<br><br>From then on, we are lead through a journey with a lot of ups and\ndowns. I recommend this to everyone!<br><br>The acting is amazing, the graphics are amazing. But the best part is\nthe atmosphere and the emotions shown to us by the characters.<br><br>Do it as soon as you can before it leaves the cinemas!\n"},
{"review": "\nFirst of all, this was one of the biggest surprises I ever had.\n'Arrival' doesn't fail to deliver to those who actually put their minds\nto work when watching a film, as there are some people who don't\nunderstand films like this simply because of that. They expect a Bruce\nWillis action movie where he kills all the bad guys and that's it. I'm\nextremely sorry for this kind of guys, but cinematography and great\nideas shouldn't be stopped from coming to light by them.<br><br>This motion picture is on par with 'Interstellar' and '2001' in my\nopinion, but it surely doesn't beat neither of them. On the one hand,\nthere's the brilliant way 'Arrival' was directed which makes me love\nit. It keeps you both excited and ambiguous at the same time if you can\nfollow the rhythm. On the other hand, you've got the plot that is kept\nlike a mystery in a magical chest. However, the end is very explicit, I\ncan say, so that the general public should understand this film pretty\ngood despite all the turns and flicks. There's nothing really special\nabout the acting, but the visual effects were awesome.<br><br>The idea of the film is original. Very original, actually, though a bit\nstrange and confusing. But the real weakness of it is that it doesn't\nwork without the drama in the film. And vice-versa. Another one is that\nthe ending both confuses and leaves you like: \"That's it?\" because\nsomething will be pointless. Though, the experience is nonetheless\nawesome and you can skip that.<br><br>In the end, I'll say that again: die-hard fans of action movies may not\nget it and take it seriously, but nevertheless they should try to think\nabout the film and understand it. I hope everyone will have a good\nwatch and make an opinion of themselves. Just enjoy the show!\n"},
{"review": "\nThe movie tackles one of the infamous questions that we are still\nstruggling to answer or at least to find a way how to answer: who are\nwe and are we really alone?. Before the release of the movie I had some\nheated debate with some linguists about the possibility of humans to\nunderstand a completely different semiotic communication pattern than\nwe. The movie goes around the idea that heptapods communicate through\nsome pictographic writing system that use it to communicate with us. Is\nit only designed for us or they use that system to communicate between\neach other. I use French when I'm talking to French who don't\nunderstand English. One thing that I has some reserves about the movie\nis that the fact in a matter of weeks they have reached an\nunderstanding of this complex pictographic language while we, humans,\nfailed to even decipher some of the ancient language of of our fellow\nspecies and there are some languages that are still a mystery till now.\nConsequently, it would not be a cinch to decipher such complex system.\nAlso, the link between this pictographic language and its ability to\nreveal the future was not well spoken and it didn't burn well. Again\nthis movie has made linguists look cool as it was described in some of\nthe newspapers.\n"},
{"review": "\nSpoiler alert! Some similarities to The Abyss but a more sophisticated,\ndeeper film-my opinion. It's a movie, I get it, but it does show how\nquite possibly, one person can, change the course of time-for the\ngood-the Amy Adams character or, in say present day America, a Donald\nTrump-for the bad-my opinion. Trump to alien, \"go f*** yourself...\"\nPolitics aside, the movie is beautifully filmed and Adams is at her\nbest, but I'm biased. This is a thinking person's film and it\ncompletely reeled me. The flashbacks to the extreme tragedy in Adams\nlife are incredibly touching and makes her character a heroine for the\nages-reinforcing the absolutely essential need for clear\ncommunication-in both personal and professional levels-the ultimate key\nto success. I loved this movie....\n"},
{"review": "\nIf you want a lot of loud action scenes this is not the movie for you\nbut if you want a good story about what first contact would probably be\nlike this is it.<br><br>Similar to Close Encounters of the Third Kind for those old enough to\nremember that movie. Definitely need to pay attention and bring your\nthinking cap on to watch this movie but it is worth it.<br><br>The movie is very laid back with the main character's personality very\nsubdued and little emotion shown with any of the main principles which\nfits the story line well and gives you room to think out what the movie\nis trying to tell you.\n"},
{"review": "\nArrival is definitely one of the better Sci fi movies that I've seen in\ndecades. With an outstanding lead performance, and definitely Oscars\nworthy, by Amy Adams, the movie draws you right in from the opening\nwith some quirky space alien- esque imagery and sounds, with swift\ndirection taking you into a world you've never known. <br><br>It delivers enough scientific and intelligent material to challenge the\nthinking type viewer, unraveling the mystery without too much lengthy\nexposition. It will make you think and will grab all your attention. <br><br>Intertwined with periodic flashbacks backed by a terrific score,\nArrival will also move you and touch you. While some of the material\nhas been done before several times, it definitely updates the\n\"worldwide crisis\" line of the story and even differentiates itself\nenough to stand apart from other movies that have done so. <br><br>In the end, Arrival is definitely one of the best movies of the year.\nBelieve the hype. <br><br>8/10\n"},
{"review": "\nArrival was pretty much close to what I wanted it to be. The trailer\nmade it look too much like an over-the-top thriller but it was so\nthoughtful in all of the right ways. I also think it's an amazing\nachievement, to be able to get a premise like that and make it work.\nThis is probably the best leading performance that I have seen Amy\nAdams ever give. I was also hesitant on her casting but I would say\nthat she was pretty close to perfect. I would say that the final scenes\nget a little too messy. It tries to reveal things that can already be\ndeciphered but I feel like it panders to its audience a little too\nmuch. It had its heart and head in the right place, and while it's\ndefinitely not flawless, it's still miles better than what Hollywood\nusually offers.\n"},
{"review": "\nWhat's most important to convey is this: The movie kept leading me on;\nIt somehow kept me convinced that I could of been watching something\nemotionally tugging and great during the first half. It was secretive\nso it kept me interested in terms of wanting to know more about what\nthey were dealing with as far as the aliens went. THEN I started to get\nannoyed when nothing that made any sense kept happening, like Louise\ndeveloping an ability to communicate in alien with her hands and smoke!\nSome aliens show up and have problems communicating with the humans.\nThen in comes the key: Louise. Basically the aliens convince Louise\nshe's a god and shes able to find that out just in time to save the\nentire planet from the aliens who just taught her that. Unless the\naliens weren't about to counter attack? I don't know. What's most\nannoying are the flash-backs or flash-forwards about Louise's daughter.\nThey became more abundant as the film went south. I guess they were\nabout her daughter from the future who would die of a disease. Maybe\nLouise was of age where one struggles to become a mother, maybe that's\nwhat the film was about. When whatever his name was said \"Lets make a\nbaby,\" to Louise towards the end, I walked out of the theater. It was\npainfully awkward to hear. And I guess Louise went on to have a kid\nthat she knew would wind up dying from a disease. The aliens gave her\nthe ability to look into the future and that's how it got used.\n"},
{"review": "\nPseudo science fiction movie, that probably will end up on no value box\nsoon. You can tell the original story was completely different only to\nbe butchered by hilarious dialog and situations. Could have been a\nbeautiful story like Contact (which the makers probably aimed at) but\ninstead it only insults ones intelligence. You can also see the lack of\nbudget everywhere - that would have not been a problem had the story\nbeen strong. This movie is a collection of stitches. Screenplay is\nweek, characters week, connection with the audience missing,\nmisleading, pretend and wanna be deep movie. Many of the situations\nhave conflicting logic, the atmosphere is totally missing.\nCinematography absent, screen play looks heavily edited and most of the\ntime you feel it was written for or by a twelve year old. It will\nalways be a mystery why Hollywood always elects the simplistic path\nwhen telling a story. It would be beneficial for everyone to just make\na good movie, a good story and the audience will love it - instead of\ntrying to please a public that seems lower and lower in standards.No\nway I am going to see this over and over again like the trailer hopes.\nWhat a joke.\n"},
{"review": "\nWhen going to the movies tonight, I was afraid that I would be\ndefinitely let down due to my high expectations after watching all\ntrailers, reading into the material and, of course, being quite the\nDenis Villeneuve appreciator. <br><br>After walking out of the cinema with my significant other, both of us\nagreed that this was probably one of the best movies we had seen in a\nlong time. <br><br>The lack of unnecessary action, the brilliant story telling, the\nbeautiful pictures combined with a much more than just suitable cast,\nmade this film an amazing experience - and to round this up it sent the\naudience into the night with a beautiful message - working together in\ndesperate times for the greater good will always be the solution. <br><br>L.K.\n"},
{"review": "\nThe movie was like two separate but great movies. <br><br>First part was very grounded and very real. The tone and atmosphere of\nthe first part was extremely effective in dragging the audience along.\nThe flow was established quite well and the audience could feel the\nsuspense. Both the actors and the director perfectly executed this\nfantastic situation in a very real setting. I loved this first part.\nThe pacing of this part was also so well done.<br><br>The second part was significantly different. It was much more\nfantastical and the science fiction element of the movie dominated.\nThis part was too fantastical for my taste. The movie takes a\nInterstellar or Lucy like spin in this second part. This part was well\nexecuted and cohere in itself like the first part. But it sometimes\ngets quite confusing and some parts are left unexplained. These were\nnot things to be interpreted, they felt more like they were left\nhanging in the air. Personally, I don't like going too fantastical\nwithout a mythology, which the movie kind of did.<br><br>Overall, the movie is among the best in science fiction for recent\nyears. I felt it was up there with Interstellar. If you like science\nfiction, you will definitely love this movie. If you aren't a big\nscience fiction fan, there is a lot to take from this movie like the\ncreation of suspense from tone and atmosphere to the great pacing. The\nmovie grasps the audience so well. You will feel the movie and it\nreally is an experience that every movie goer should taste.\n"},
{"review": "\n'Arrival' begins well, but ends up a major disappointment. Initially it\ntakes a novel approach - the world's finest linguists are corralled by\nnational authorities to enable communication with the aliens aboard\ntwelve huge egg-shaped spacecraft which have arrived on Earth. The\nships hover a few feet above the ground at various locations around the\nglobe, with crew members who resemble an octopus/elephant hybrid. Each\ncountry competes to unravel the Octophant language, selfishly hoping to\nacquire technological superiority over rival nations. Unfortunately the\nmeetings between extraterrestrials and linguists quickly become\nrepetitive, thereby squelching any sense of awe over humanity's first\ncontact with intelligent aliens. This loss of dramatic tension becomes\na serious problem as 'Arrival's' plucky heroine struggles to decipher\nthe aliens' complex circular hieroglyphics. <br><br>The actors' performances are more than adequate for the material, but\nthe narrative arc becomes increasingly predictable. As the story\nunfolds, it leans stubbornly upon the old Sci-Fi cliché of interstellar\ntravelers being confronted by mankind's paranoia and xenophobia. The\nEarthbound military powers foolishly adopt a threatening attitude\ntoward the ETs, who obviously possess more advanced technologies. The\nscreenwriters deploy some equally foolish plot devices as the film\ncharges headlong into a formulaic Hollywood cliff-hanger climax, before\nit winds up wallowing in sentimental hokum.\n"},
{"review": "\nI had high hopes for this movie: the premise (however unlikely\naccording to the laws of physics) of aliens visiting Earth is endlessly\nfascinating and the work has had rave reviews. But I was disappointed -\nfor me, this was \"Close Encounters Of The Slow And Boring Kind\" with a\nlack of entertainment value and a plot that was overly cerebral and\nrather opaque. <br><br>I'm sorry to reach this conclusion since French Canadian director Denis\nVilleneuve fashioned a brilliant work in \"Sicario\" and there is much to\nadmire in his latest film including striking cinematography by Bradford\nYoung, an atmospheric score from Jóhann Jóhannsson, and an excellent\nperformance from Amy Adams as a brilliant linguist who decodes the\naliens' complex language. <br><br>Ultimately the problem is the story-line which simply does not make\nsense and lacks narrative pace. I was not sorry when \"Arrival\"\ndeparted.\n"},
{"review": "\nEverything except tricking the dumb audience with some emotional stuff\nto come out and watch this nonsense. Worst movie of 2016 Its the same\npeople who liked Gravity kind of bad movies. All they did was put some\nemotional things and rest of it was such a load of stuff. A 6 yr old\ncould do a better drawing of aliens than this. There was nothing about\nscience fiction, the space ship was such a horrible job, terrible\nbackground music, these people are stealing from your pockets with this\ncrap. Please don't watch. I felt like 2.5 hours of my life are gone and\nare never coming back. Rotten tomatoes has good rating, I cant believe\nhow these many people can like such nonsense. I mean these days all\nthey have to do is put some absolute unrelated emotional crap and\npeople with it, what did her kid with cancer have to do with anything,\nwhy even bring that up.\n"},
{"review": "\nThere's 2 hours of my life, I would like back. I should have known\nbetter. I hated Amy Adams in \"Man of Steel\" as Lois Lane and her wooden\nacting has not improved. How does she get work?<br><br>The plot is astonishingly nonsensical, bad dialog, and endless\nflashbacks. I kept waiting for something exciting to happen, and it\nnever did. I rank \"Arrival\" with other overrated science fiction\ngarbage like \"Interstellar\" and \"Transcendence\".<br><br>The film is littered with preachy leftist propaganda. I don't know how\nit is getting good ratings.<br><br>When I finally saw the end credits I was so happy to depart, from\n\"Arrival\".\n"},
{"review": "\nCould it be that the less sense a movie makes, the better it's ranking\nhere on IMDb? As I write this, the film is #93 on IMDb's Top #250. I've\nalready ranted enough in other reviews to explain my position on this\nregarding new releases, so I won't bore you with it here. My main\nproblem with the picture is that there doesn't seem to be an inherent\nlogic to the story line. Linguist Louise Brooks (Amy Adams) makes\nsignificant inroads into understanding an alien language configured in\nRorschach-like circles, and as the viewer, we're never really privy to\nhow she managed to do it. The non-linear time element introduced into\nthe story is quite bewildering as well, highlighted by Adams' character\nplacing a phone call to a Chinese general AFTER he showed her his phone\nnumber, some time in the FUTURE! There are going to be those who hail\nthis film as brilliant film making, but I have to tell you, if I have\nto have it explained to me, then it doesn't pass a basic test for\ntelling a good story. Namely a picture with a solid beginning, middle\nand end.\n"},
{"review": "\nIt was disappointing for me. I was expecting the movie would show more\nof the process of understanding the language of aliens which looked\nvery interesting with the circular patterns and all. I wished the movie\nexplored more of that. I think it lacked focus because it continuously\nwent in flashback which I did not understand the significance of. I\nthink there is a deeper concept underlying the story which the director\nwas not able to convey properly. The cinematography was also not all\nthat great. I liked the alien's spaceship. Also liked the idea of\ngraphical written language in a circle which is faster to write. Wanted\nto see a lot of communication between aliens and humans which didn't\nhappen. The protagonist's personal life story was unexpected and not\nrequired. A rare movie where aliens are not attacking. Peace.\n"},
{"review": "\nThis one, from start to end has a slow but engaging pace which may be\nboring for some but was essential for the theme of the movie if you ask\nme. I think the director made exactly what he had in mind. This is an\nexample of next level cinema when you see the bigger picture but you\nhave to step back a little.<br><br>Arrival is a film about a linguistics specialist, played by Amy Adams\nwho works with the government to find out what the entities in the\nspaceships, which suddenly ended up on earth one day, want. She is\nbeing helped by a specialist in physics, played by Jeremy Renner. Both\nof them do what is essential to interact with these entities, or\naliens, to get to the bigger picture and ask bigger questions like what\ndo they want from us?<br><br>The movie does not only contain these conversations. Those are just the\nmain pathway around which the whole story is build like a big city. The\ninvolvement of others, people's reaction to this event, mistrust among\nworld powers are all things considered by the writers. This is what\nmakes the movie special. <br><br>So, I will suggest that sit back and enjoy this movie. Do not try to\nfind meaning in everything or look for an explanation after every\nscene, because after some time the explanations will present itself to\nyou in a subtle way which will leave a smile on your face.<br><br>Also, I would like to add that I think you may not like this movie if\nyou generally don't stand a slow pace. If you like Denis' other movies\nsuch as Enemy, Sicario and Prisoners you should go ahead with it.\n"},
{"review": "\nIncredibly depressing, morose and solemn.<br><br>This films goes nowhere. <br><br>Amy Adams is a linguist who gets called upon to decipher a bunch of\nsquid aliens who can be found up a giant chimney located in a suspended\nin mid air giant pebble, and seen through a transparent wall.<br><br>Wow! This movie was soooo entertaining!!! Said aliens shoot out ink to\ncommunicate to Amy and....ZZZZZZZZZZ<br><br>There was something about her knowing the future, the aliens coming\nback in time to teach them their language because they will need the\nhumans help in 3000 years time or something or other.<br><br>I can't really be sure as I did fall asleep half way through, then when\ni woke up, i went and bought an ice cream and had to wait 10 mins in\nthe queue to be served.<br><br>Forest Whittaker puts on another ridiculous accent and acts like he\nalways does, with that drippy, 'I've just been slapped in the face with\na greasy dildo' look in his face.<br><br>Utterly forgettable movie.\n"},
{"review": "\nArrival reminds me of a long episode of The Outer Limits. You're\nplunged into an exotic and mysterious science fiction scenario. You\nknow the outcome all depends on a \"big reveal\" that will come almost at\nthe very end of the story, and you will judge it based on how cool that\nreveal turns out to be. I wasn't as impressed as I was hoping to be. <br><br>I admired the style and the imagery of the film. I enjoy nearly all\nscifi and I particularly enjoyed this director's previous big movie,\nSicario, about the drug war in the Southwest and Mexico. However, I was\nunexpectedly bored most of the time while I was watching this one. For\none thing, as is true of most hard scifi scripts, the majority of\nordinary humans are dismissed as hysterics or religious zealots. That\nleft me cold. Any movie that casts Forest Whitaker, no matter how many\nawards he has, is going to make me wish all of his scenes had subtitles\nas a hurriedly mumbles through all his lines. Finally, the whole \"the\nworld as we know it will melt down into an apocalyptic disaster unless\nour hero gets this right\" is almost always an unconvincing crisis. I\nnever felt like anyone was really in the kind of imminent danger the\nauthor wanted me to feel, so all there was to do was admire the scenery\nand the occasional special effect. The story needed more characters,\nmore tension between them, and more interesting and less predictable\ndialog. Nice try.\n"},
{"review": "\nI didn't plan on seeing the film because I thought it was going to be\nanother rehash of 2001 and Childhood's End and in a sense, it borrowed\nsome ideas from those classics mentioned but in the end I was surprised\nto see that Arrival had a different spin on the genre. And most of all,\nI was surprised at Villeneuve's directorial prowess. This was a\nbeautifully shot film.<br><br>Its hard to describe this film without giving too much away. All I will\nsay is that the film is more about the final message than any character\ndriven drama. It took me a good 10 minutes of reflection after leaving\nthe theater to soak everything in and I found Arrival to be a very\ncryptic film, and a film that is very relevant to real world events.\nIt's not so much a science fiction film but more of a spiritual film,\nand a film that will make people take a close look at themselves, our\ncivilization and humanity in general. All in all, a very positive\nmovie, that will leave you feeling uplifted in the end.\n"},
{"review": "\nDon't believe the hype or the rave reviews. While technically a good\nfilm, it is very boring and a victim of its own \"cleverness\" and\npretentiousness. It's sense of \"originality\" is because it's lifting\nfrom other movies (like the ones in the title).<br><br>Amy Adams is sure to receive another Plain Jane (weak year) Oscar\nnomination, possibly win. But every other actor seems bored and phoning\nit in. <br><br>As I said technically a good 7 star movie, but I know I'll never watch\nit again and should've waited until I could see it for no more than a\n$3 rental.\n"},
{"review": "\nI honestly don't understand the dissatisfaction of some reviewers.\nMaybe sci-fi is too broad of a topic and some of the people just wanted\nto see flashy explosions and alien shooting. Although I found many\nthemes of the movie a bit overused (themes and ideas already seen in\nother movies, but don't want to go into detail here), it is still an\noriginal and grown up attempt to the genre.<br><br>It would require more risk taking to make this movie really stand out,\nbut at the same time, that probably wasn't the main objective. It was\nthoughtful and entertaining just enough to keep the average sci-fi buff\nhooked for 2 hours. At the end of the day, I guess it comes down to\npersonal taste and I can safely say I wasn't disappointed at all.<br><br>Villeneuve is becoming a director to look forward to.\n"},
{"review": "\nWhat ever movie genres you like: WATCH THIS MOVIE!<br><br>It is one of the greatest I've ever seen. The main plot of it is so\nwell done, with a great concept behind it and a perfect way to present\nit. The scenery is beautiful and well chosen, the story-line develops\nin an appropriate time and creates good tension. But the most\nconvincing part of this movie is its plot. It is both - convincing and\nunexpected.<br><br>Negative sides about Arrival: - some lines are just a cliché and a few\ntimes you know what the point of a conversation will be, right at the\nbeginning of it.<br><br>Overall I still rate it a 10, and it is for sure the best movie I\nwatched lately.\n"},
{"review": "\nIt is kind of confusing at first. As you have to sit all the way\nthrough the film to get top, middle, and bottom.<br><br>Adam Adams as a grieving mother who lost her daughter and is a linguist\nwho is recruited by Colonel Forest Whitaker to translate some alien\nlanguage.<br><br>Jeremy Renner stars as the potential love interest and physicist to\nhelp in the military as well.<br><br>As to decide whether or not that if the aliens are a threat or want to\nbe helping out humanity. And if the countries are up to the task <br><br>It is confusing as you will have to sit all the way through to\nunderstand this movie. But the acting has in the saving here of it.\nThanks to Adams, Renner, and Whitaker.\n"},
{"review": "\nFull of good things, and enjoyable and intriguing to watch, this is\nultimately a masquerade of a picture, superficially offering\nscience-fiction while increasingly claiming to be about something more\nprofound. It doesn't really make the transition effectively, and has\nmore than a whiff of M. Night Shyamalan about it, with its climactic\ntwist.<br><br>The good things are Amy Adams, who carries all the movie's emotional\ncontent on her shoulders as linguist Louise Banks; the cinematography,\nwhich is full of interesting colours and contrasts; and the music, a\nkind of follow-up by Jóhann Jóhannsson to his score for SICARIO for the\nsame director.<br><br>Jeremy Renner's role is notable for being the eye-candy, very much\nhanging behind Ms Adams as Ms Banks, in a welcome reversal of the\nHollywood norm.<br><br>It's well-crafted, but once you've left the cinema, it's as if it never\nhappened.\n"},
{"review": "\nSome of the best science fiction films are those that aren't actually\nwhat they appear to be about, but rather use a sci-fi premise to\nexplore the human condition right here on Earth. \"Arrival\" is one such\nfilm. Though an encounter with aliens and humankind's reaction to it\nsets off the action in this film and comprises the bulk of its story,\nit's the human characters that we learn and care about.<br><br>Amy Adams is one of those human characters, and she gives an absolutely\nlovely performance, one that totally carries the film. She gets no\nhistrionics or big Oscar scenes, yet days after the movie I was still\nthinking about her and the journey her character goes on. It's hard to\ndiscuss the plot of \"Arrival\" without giving too much away to those who\nhaven't seen it, and this is one movie that will be most effective if\nyou know very little about it. It's got what I suppose would be\nconsidered a plot twist, but it's not one in the traditional, gimmicky\nsense. It grows organically from the plot, and by the time it comes you\nrealize that it's not actually a twist but really what the movie's been\nabout the whole time.<br><br>The question \"Arrival\" asks is: \"If you had your life to do over again,\ngood and bad, and didn't have the option of changing anything, would\nyou?\" The ending, and Adams' character's answer to that question, had\nme crying like a baby in the movie theater.<br><br>Grade: A\n"},
{"review": "\nArrival is based on the short story, Story of Your Life by Ted Chiang.\nWhen alien spaceships land on Earth, expert linguist Louise Banks(Amy\nAdams) is hired by the army. Louise is given the job of translating the\nalien communications. Louise is part of a team that also includes\ntheoretical physicist, Ian Donnelly(Jeremy Renner). Together, they have\nto decipher the language of the aliens &amp; find out what they are doing\non Earth. <br><br>Arrival is a mind blowing film. Director Denis Villeneuve has directed\nyet another masterpiece after, Prisoners(2013) &amp; Sicario(2015). The\nbest part about this movie is that, it is nothing like the usual alien\nflicks. There are no over-the-top action set pieces &amp; the suspense is\nbrilliantly maintained, throughout the film. The climax of the movie,\nwill leave you speechless. The script by Eric Heisserer, based on Ted\nChiang's source material, is fantastic. Pay close attention throughout\nthe film, in case you miss any minute detail. The visual effects are\nsubtle &amp; perfect for a sci-fi movie, like Arrival. The haunting\nbackground score by Johann Johannsson is great. The cinematography by\nBradford Young is gorgeous. Amy Adams' performance as Louise Banks, is\nthe highlight of the film. Adams portrays a gamut of emotions\nthroughout the movie, spectacularly. Jeremy Renner is superb as Ian\nDonnelly. Forest Whitaker is effective as Colonel Weber. Michael\nStuhlbarg, Tzi Ma &amp; Mark O'Brien are impressive as Agent Halpern,\nGeneral Shang &amp; Captain Marks, respectively. Jadyn Malone, Abigail\nPniowsky &amp; Julia Scarlett Dan are amazing as Hannah(6 years old),\nHannah(8 years old) &amp; Hannah(12 years old), respectively. Arrival is a\nmust watch for everyone.\n"},
{"review": "\nI am a big sucker for first contact stories but decent movies in this\ncategory are very rare. Arrival is one these rare gems which are worth\nyour money. The cinematography is breathtaking and is supported by a\nvery fitting score. On the acting side Amy Adams and Jeremy Renner\ndelivered, although i still wonder why Jeremy Renners Character was\nneeded at all. The true star of this movie is the plot, as i should be\nand i wont spoil a bit of it. There are a few rather illogical twists\nbut they don't disturb the experience as a whole (well except for one,\nbut i let you be the judge of it). If you are a SciFi fan this movie is\na must. I consider it to be the best serious (or hard) SciFi flick i\nhave seen in a decade.\n"},
{"review": "\nI thought this movie was fantastic; original, not the same old tired\nstory line (think zombies, vampires, etc.) and it was filled with\nsurprises.<br><br>The movie really gives you something to think about as well, not many\nmovies can do this without being preachy and condescending.<br><br>To all the people who rated this one star, I don't understand what\nmovie YOU saw, was the bad review because there wasn't nudity or the f\nword every 15 seconds?<br><br>I plan on watching the movie again just to catch anything I might have\nmissed the first time.<br><br>I think Amy Adams was excellent in the film, I'd like to see her in\nmore things in the future.\n"},
{"review": "\nArrival takes 2016 to a whole new level; Amy Adams booked her ticket to\nthe 89th Academy Awards, but we must admit that this movie isn't that\nperfect.<br><br>As I pointed out the advantages of Arrival from the cinematography to\nthe performance,I have to point out that Arrival didn't focus on \"Why\nare they here?\" It focused more on the human side, that's not a\ndisadvantage, it's just that I wasn't expecting Arrival to take this\nside.<br><br>Of course I wasn't bored while watching Arrival that's because I\nappreciate beautiful cadres and compositions.<br><br>But overall Arrival is totally recommended as it's the best movie in\n2016 so far in my opinion.\n"},
{"review": "\nThis movie is the reason why science fiction has always been my\nfavorite genre. It takes something very human and turns it into a\nstory, using the science in the movie to further drive that story, and\nto give it more gravity and feeling. The score in this film is also\nvery beautiful and Amy Adams did an amazing job acting in this one.\nI've always thought she was a good actress but this one really\nconvinced me that she is truly Oscar worthy (so did American Hustle).\nThe music in this film should be nominated for an Oscar as well. This\nwas easily one of the best films of 2016, up there with 10 Cloverfield\nLane. I think it may be my favorite scifi film since Interstellar.\n"},
{"review": "\nArrival is undoubtedly one of my favourite movies of 2016. It is very\nhard not to imagine what would happen in real life if we were visited\nby space ships from another planet. The scenario that plays out in the\nmovie certainly seems plausible.<br><br>Amy Adams is cast as Louise Banks who is a leading linguist that is\nbrought onto the military operation. She is charged with trying to\ndecipher the communication from the alien craft. Jeremy Renner is cast\nas Ian Donnelly a physicist who befriends Banks on the team. The pacing\nof the movie is excellent and you are never quite sure where the movie\nis heading. Very engaging throughout.\n"},
{"review": "\nPersonal View - 7.5/10<br><br>A great movie in the Sci-fi genre. Finally a movie which deals with\nalien \"situations\" in the most pragmatic way possible.<br><br>Average Viewer - Might find it slow, with too many 'flashbacks\" which\ncould take out a bit of the momentum from the film, leaving people a\nbit flustered at times. <br><br>Otherwise - A thorough Sci-fi movie experience. The movie has delivered\nwith a peaceful, slow (approvingly) &amp; yet (understandably) tense\nfashion, and has convincingly brought out the message and essence of\nthe film.<br><br>Amy Adams has done a splendid job and has carried the movie pretty much\nsingle handedly on her shoulders.<br><br>Side Note - It's been a while since i have seen alien situations being\nhandled the way it was in this film and this was a major plus.<br><br>For those of you'll about to watch the film be warned! : This is NOT a\nfast paced action film with guns blazing and aliens jumping around New\nYork City. <br><br>Cheers!\n"},
{"review": "\nA thought provoking artistic movie of the 'emotional sci-fi' genre - a\nnew genre created by Nolan's 'Interstellar'. The movie trailer\nsuggested that it could be like Contact or Close encounter, but the\nstory-line is very original.<br><br>Great direction, and excellent acting by Amy Adams,but the narrative is\nslow, and leaves questions unanswered, and it feels more like an\nepisode of a sci-fi epic. It's still one of the best movies of 2016,\nmay be not the one that woos the masses but the one that wins the\nOscar. Some of the original concepts explained in the movie - Nonlinear\nOrthography, Sapir- Whorf hypothesis and nonlinear time :)\n"},
{"review": "\nI have seen many \"puzzle\" movies, including Memento, Cloud Atlas,\nInception and many others. This was one of the hardest to follow, not\nleast of which is because many lines were spoken softly with loud\nbackground noise and/or musical soundtrack. I left wondering what it\nwas about, and didn't feel comfortable that I had even a basic idea of\nthe \"point\" of it until after a long conversation with the friend I saw\nit with.<br><br>It was certainly interesting, and well done. I just wish the filmmakers\ngave us a little more help in following it. I would have left the\ntheatre with more than a sense of \"I think I liked it, I just don't\nknow for sure.\" And I think I would have had more of an emotional\nconnection to the characters and what happens to them.\n"},
{"review": "\nI often struggle with sci-fi films.<br><br>I love esoteric, 'out there' productions like 2001: A Space Odyssey\n(1968) and Under the Skin (2014) but get bored rigid by anything 'Star\nWarsy'.<br><br>Arrival is definitely one of the former films, a sublimely cerebral,\nquestioning piece about language, how we communicate and why talking\nand writing to each other is so important.<br><br>In this heavily digital age, Arrival posits that, simplistic a solution\nit may seem, the spoken and written word are more powerful than guns,\nnukes and Presidents. <br><br>Given the recent US Presidential election and the waves of worries and\nconcerns that have rippled out across the digi-sphere, the film has an\nimportant message within its stunning visuals and superlative acting\nfrom Amy Adams.\n"},
{"review": "\nI would not even give one vote. First the cinematography is poor with\nclouded and blurry computer generated graphics. Second, is the premise\nis old and tired. Third, the actors backstory is almost non existent.\nFourth the ending is non climatic. Fifth, it has so many hollow scenes\nyou could fall asleep. I should have known better when we walked into\nthe theater and there were only FOUR other people there. I see movies\nthree times a month and I was so disappointed we went to management\nwith another couple from the show and got a comp ticket for wasting two\nhours of our time. I was not alone in this opinion. I got chewed out\nfor not researching the movie better.The entertainment value is ZERO.\nIn retrospect even the trailer is a warning- don't go- don't go!\n"},
{"review": "\nWarning SPOILERS<br><br>I really don't agree with the high ratings of this movie!<br><br>OK, the acting was fine, the special effects were fine...but the story\nwas pretty lose!<br><br>The ending was woeful - The line Renner delivers about the all the\nyears looking at the stars and it was her she was looking for was so\ntypical of Hollywood.<br><br>It was also pretty amazing how the language moved so fast without any\ninteraction from the aliens, they didn't show examples of anything it\nwas all one way. I can only assume they understood English from the get\ngo and just show us their symbol when it was required.\n"},
{"review": "\nI was incredibly excited to go into this movie since it was being\ndirected by one of the best directors working today Denis Villeneuve. I\nwalked out of this movie floored. This film I have seen twice not and\nthere has been no other movie this year that has stuck with me long\nafter leaving the theater. There wasn't one thing in this film I had a\nproblem with. The performances are all incredible especially from Amy\nAdams who gives the best performance I have ever seen from her which is\nincredibly high praise since she is one of the best actresses working\ntoday. She is very subdued and you believe everything that she is doing\nbecause she sells her character so incredibly well. The cinematography\nis exceptional in this film and every shot has a unique visual style\nfrom Bradford Young. I am not going to spoil the ending but it takes a\nwhile to fully process and that is why it is an excellent film to go\nsee twice because it works just as well if not better seeing it\nagain.It's a film that gave me chills in the first 5 minutes of seeing\nit and pretty much the whole time. It stuck with me long after seeing\nthe film and it's a movie that raises questions. It is a hopeful movie\nwith bigger ideas than just a typical alien invasion movie. This has\nbeen one of the best movies so far this decade. Please do yourself a\nfavor and go see this movie. (A+)\n"},
{"review": "\nWhat a bad film. It is entirely boring, from the beginning when you\nwaste minutes and minutes waiting for the movie to go on and really\nstart but nothing happens. And I had to hear applause at the end in the\ncinema. OYG! Sorry but I cannot approve (5/10) this film. Actors may be\ngood there, but well played of nothing is nothing. It seams today is\nfashionable to make movies about space and aliens and to play with the\ntimeline. We have seen good films during the last years but this one\nno, this one is clearly overrated. I went to watch it because I was\nbelieving that every film rated 8 or more in IMDb is a very good film\nand eligible to watch it in the cinema. Mistake. Wrong.\n"},
{"review": "\nArrival came too late, for me, at least. I took an introductory two-\ncredit course on Sanskrit about 20 years ago, and although learning\nSanskrit is like learning to ride a bike or kissing your uncle (you\nnever forget how), that Sanskrit muscle memory just ain't what it used\nto be.<br><br>Or maybe it came to late with respect to, you know, all the other\nmovies with a similar plot and a Shyamalanistic, tantalizing reveal\nthat you might be able to predictably glean if you could just spot all\nof the clues and assemble them in time before the movie finally makes\nthe reveal upon you, like a deck of cards being flipped over slowly,\nslowly in turn.<br><br>It's no Insterstellar, no Contact, no Close Encounters of the Third\nKind, no Starship Troopers. And what exactly is Forest Whitaker's\naccent supposed to be? It's not Sanskritian, is it? What's the lesson?\nThat human beings suck at communication? We shouldn't fight each other\nbecause we all bleed red?<br><br>From the moment the arrivers arrive, to the end when they become\nleavers leaving, the aliens, which look like a pair of hand models way\npast their prime, unimpress even though they are pressing so hard,\nsometimes physically so against an impervious sheet of glass.<br><br>And maybe that's the big takeaway: we're all trying to communicate so\nhard with each other but we put up unnecessary barriers to impede\nmeaningful talk. If we could somehow sit down, take a deep breath, and\nreally convey meaning in a meaningful way, we might just make it as a\nspecies.\n"},
{"review": "\nHeavy spoiler .......<br><br>I'm walking around on a fine line between liking and liking. It's a\nstrange movie that has turned from being a legend. I like it because\nthe philharmonic direction is really strong. There is philosophy in\n2001 odyssey standard. I do not like it at the same time because there\nare a lot of open doors and unanswered questions and deficiencies. I\nlike it, because my narration is plain and simple. The introduction and\nthe dating process are pretty good. It smells of quality. Afterwards,\nit was ordinary film. It's a mediocre film.<br><br>I will write the headlines of these shortcomings, if you will give me\nan appointment, see if I am right. First of all we have to ask, these\naliens have such high standards, they can pass the speed of light, the\njourney is like that. Do they not learn English, which is a simple\nlanguage? So this system does not exist. Okay, come on, they were\ntalking to the rings, the system was different or I would pass it on!\nWhat a thing. These men came to say that you should not fight each\nother 3,000 years ago. Oh, man, what a pain you are. It's not worth the\nlight you burn. One more thing, why 12? 12 months, half of 24 hours why\n12? What was it and why was not explained. Let's say 12 months. It\nrepresents what it is. Later, when China did not attack, everything was\nresolved and then they all disappeared. I'm going to say that you\nmessed up a bag of pearls, Denis. This film is watched despite this\nnegativity.<br><br>Film note: If you know what you will live in the rest of your life,\nwould you do everything in the same way? Good looking ...\n"},
{"review": "\nArrival is a masterpiece, thought provoking and visually stunning. It\nis the story of the human perception, and of our fears and beliefs.<br><br>It doesn't rewrite history, its not a movie born from the CERN's micro\nexplosions, it's the Mona Lisa of 2016, it can be the best moment from\none's day.<br><br>If you leave the movie theater with many questions unanswered it means\nyou are one of our team now.<br><br>Hawking says we will perish in 1000 years, Arrival gives us hope. What\nmore can you say?<br><br>Great cast, great directing, great script. Why isn't it a 10? Because\n10 doesn't count, 10's are flawed by perfection.<br><br>Just one word left: Enjoy!\n"},
{"review": "\nThe movie has a very creative idea and shows some interesting\nscientific theories, especially in terms of linguistics. Unlike many\nother movies about aliens, it is not focused on banal action or horror\nscenes, and doesn't depict aliens as evil invaders. From the other\nhand, I believe the movie didn't present its creative ideas in depth,\nalthough it had much more potential to develop them. Many things are\nprobably worth thinking about on your own and with your own imagination\nafterwards, which makes the movie inspiring. In my opinion the plot was\nlacking some dynamics too, but as whole I would rate \"Arrival\" as a\ngreat alternative to the mainstream science fiction about aliens.\n"},
{"review": "\n\" Now that's a proper introduction.\"<br><br>This mind-bending sci-fi is simply amazing. From the visuals and the\nmusic, to the acting, writing, and fine details like the fact that a\nwhole visual syntax was developed for this film.<br><br>\"Arrival\" has to be one of the best films of the year, so if you see\nit, and I recommend that you come prepared for the cast and story to\ndraw you into it, from it's painful if somewhat enigmatic opening, to\nit's tense climax, to it's beautiful, bittersweet finale that makes you\nrethink yourself, humanity, and our universe.<br><br>One detail I really enjoyed was the design of the heptapods' craft was\nthe resemblance to the similarity to the obelisks in Stanley Kübrick's\nfilm adaptation of 2001: A Space Odessey (originally a series of novels\nwritten by Sir Arthur C Clarke) The heptapods' unique design was also a\nwelcome break from the average humanoid ETs commonly featured in\nHollywood.<br><br>Also, the recurring Abbot and Costello reference helped add just the\nright amount of humor to an otherwise serious film.\n"},
{"review": "\n.... From The Simpsons arrive on Eartth in a fancier a spaceship but\nforget their dictionary.<br><br>More seriously though, lots of problems with realism, unimaginative\nvisual effects, incredibly boring, fails to connect personal story with\nlarger story, <br><br>Harlequin romance level of storytelling, ethical problems, boring and\ngrating music.<br><br>I've seen so many movies that fail in every way to really tackle the\nidea of aliens coming to earth it's getting disappointing to go to\nthese things. Contact had the same kind of problem, and several others. <br><br>People who make these kind of movies need to do a hell of a lot more\nresearch first, take a page out of Stanley Kubrick's book and do your\nhomework.\n"},
{"review": "\nWithout comparing with all the masterpiece-Sci-Fi movies, I think\nArrival has some \"out of the box\" way of imagine that great arrival\nthat everybody has ever dreamed when we were kids (you can't say no). <br><br>The plot turns to catch you since the beginning, performances are\nawesome (specially for Jeremy Renner, who I used to think about him as\na bad actor, he does it really well here), visuals are acceptable and\nalso the soundtrack.<br><br>But, what I really find great in this movie, is that turns to implement\na kind of mindset on human's destiny and landing the idea of ET life\nout there really susceptible.<br><br>I consider this movie a masterpiece of modern Sci-Fi (just one step\nbelow from Interstellar)<br><br>PS. Sorry for my English written mistakes.\n"},
{"review": "\nHaunted by memories of a deceased teenage daughter, a lonely linguist\nagrees to assist in communicating with an extraterrestrial species in\nthis first contact sci-fi outing from Denis Villeneuve. The film looks,\nsounds and feels like Villeneuve's earlier 'Sicario' with aerial shots\nthat bask in lush landscapes, another perfectly brooding Jóhann\nJóhannsson music score and yet another plot about a young woman out of\nher depth. The action content here is negligible though, which renders\n'Arrival' refreshingly different from most other first contact movies\nas the film focuses on credible barriers with alien communication. The\nbig question is whether the aliens are hostile or peaceful since it is\nimpossible to understand them. The communication theme is not limited\nto the aliens though; with spaceships landing in twelve places around\nthe world, issues arise from various countries being unwilling to share\ninformation. Much like 'Under the Skin', the film also highlights\nhumankind's tendency to always react violently to what we do not\nunderstand, but there is actually a positive tone overall. The film has\nsome pacing issues though. The conclusion is overly drawn out (with at\nleast a couple of false endings) and the final few scenes only serve to\nblatantly spell out plot twists and turns that did not need to be\nexplicitly stated. The scenes of various young military personnel\nhaving their doubts also distract from the protagonist's journey.\nWhatever the case, Amy Adams is solid in the lead role. Villeneuve lets\nhis camera focus on her trembling hands as well as her face, allowing\nher to give a true full body performance. Strong support also comes\nfrom Forest Whitaker and Jeremy Renner even if it sometimes feels like\nthey could have been given more to do.\n"},
{"review": "\nDirector Denis Villeneuve (Sicario - 2015) provides a new look at the\n\"alien\" film, giving both a new space craft to marvel and explore, new\nalien sounds, and a different kind of creature to interact with. For\nthese reasons alone, the film is a success. However, with a complicated\nscreenplay by Eric Heisserer (based on a short story by Ted Chiang), it\nis the backstory that continually gets in the way of an otherwise\nintriguing viewing experience. Colonel Weber (Forrest Whitaker) calls\nin linguist Amy Adams (exceptionally terrific here) and Scientist\nJeremy Renner (playing second fiddle to Adams) to decode the alien\nchat. All is well and exciting until Adams starts having\nflashbacks/forwards (I couldn't tell) that somehow relate to the story\nand hold the secret to the world not falling into despair. When the\nfilm ended, I couldn't help but wonder \"what happen\"? Music is at times\npredictable Sci-Fi (Jóhann Jóhannsson), yet it is equally calming and\nhelps move the mystery of the experience along nicely. Cinematography,\nespecially inside the spacecraft, is terrific by Bradford Young. You'll\nprobably read that \"Arrival\" is the \"Close Encounters\" of our day\nand/or that the film is Stanley Kubrick oriented. Well I say, it's just\nanother alien film that manages to provide a fresh look at a genre we\nknow well.\n"},
{"review": "\nDirected by Denis Villeneuve, and adapted from Ted Chiang's The Story\nof Your Life [1998], Arrival explores how mankind would react to, and\ncommunicate with, extraterrestrial beings, who without warning and with\nan unclear purpose, touch down in twelve locations across the earth.<br><br>Threatened by their arrival a team of specialists, led by linguist Dr\nLouise Banks (Amy Adams) and scientist Ian Donnelley (Jeremy Renner),\nare tasked with communicating with the aliens, and ultimately deducing\nwhether they have peaceful or hostile intentions.<br><br>Perhaps surprisingly Arrival is not just a film about an encounter with\nextraterrestrials, but is at its core a heartfelt and visceral look at\nmore universal and ideological themes of love, loss, tolerance and\nacceptance, to name a few.<br><br>Acting, particularly from lead Amy Adams, is superb with scenes of\ngenuine emotion and delicate intimacy throughout. Jóhann Jóhannsson's\noriginal score matches this sentiment well, with deep and resonating\ncrescendos and delicate strings, which create subdued and deeply moving\nscenes. <br><br>Though the scenario of aliens landing on earth could be viewed as\ncliché and overdone (Close Encounters of the Third Kind [1977],\nIndependence Day [1996], Contact [1997], etc.), it is ultimately in the\nfinal act where Arrival steps into new ground, and transforms into a\nmovie that demands your attention and reflection long after the credits\nhave rolled.\n"},
{"review": "\nThe film has one interesting idea: that time isn't linear.<br><br>Reaching that idea is a plod so slow that I almost left the cinema.\nEverything about it is dull: from the dreary cinematography under\nleaden skies and gloom, ghostly Death Eater aliens lost in fog,\ndialogue that's lost in mumble.<br><br>I almost enjoyed the clichés (America saves the world, the military are\nthickos) because at least they produced interest.<br><br>Did I mention the gloom? It's soooooo dull that you almost need a pair\nof night vision glasses to find some light.<br><br>The acting from Amy Adams and Jeremy Renner is good though and the\nfinale is decent enough if rather obvious by that point: time isn't\nlinear. Wow. Great. Never been done before.<br><br>If you want atmosphere in an alien encounter then ALIEN is in a\ncompletely different league to this. If you want alien mysticism, which\nis basically how the language is transferred, then The Abyss did it\nyears ago in almost exactly the same way. And that's about it.<br><br>I so wanted this to be better.\n"},
{"review": "\nThere are many films coming out this year that far exceeded my\nexpectations but Arrival is at the top of the list. This is not only\narguably one of the greatest films of the year but one of the greatest\nscience fiction films ever. The story follows linguist professor Louise\nBanks-played by Amy Adams- who is assigned to help the military\ncommunicate with a group of unusual extra terrestrials. However, the\nsituation is slowly falling apart as many people are starting to worry\nthat the aliens might have sinister motives. The premise alone doesn't\nsound like anything too great but it is truly the execution that is\nwhat makes the difference. Amy Adams and Jeremy Reiner play well off\none another as both colleagues and love interests. The special\neffects-even the CGI-are also beautiful and completely realistic. But\nthat is the great strength of this film: it's ultra-realism. The\nscenarios, the dialogue, the science, the language, all of it could\npossibly happen in real life. That's what makes it so absorbing. It's\nnot a feel good movie like Independence Day but a thinking man's film\nthat's still very entertaining like 2001 Space Odyssey. But the best\npart is the ending. It might be confusing at first but if you think\nabout it, you will begin to understand it. Arrival is definitely one of\nthose movies you need to see twice in order to fully understand it. If\nyou enjoy films that make you think twice about what you saw, then\nArrival should be at the top of your list. With great acting, direction\nand special effects, Arrival is totally worth a second look.\n"},
{"review": "\nWent to see \"Arrival\" tonight: If you are only a Sci-Fi fan for movies\nthat have lots of action, this movie is not going to be for you and I\ndo not suggest you going to see it as you will find this film very slow\nand boring....However if you like Sci-Fi movies such as Interstellar,\nPredestination, Contact, etc.....you will want to give this movie a go!\n\"Arrival\" was beautifully shot with a refreshingly non traditional look\nfor an alien specie for the big screen. The movie has a thought\nprovoking take on communication and the possibility of a greater\nability once comprehended. Keeps you thinking throughout the film and\nwell afterwards. Amy Adams is brilliant as usual and though a strong\nsupport cast was not really needed for this one, Jeremy Renner &amp; Forest\nWhitaker were both solid and complimented Adams nicely.......If this\nsounds like it might be up your alley, I definitely recommend it.\n"},
{"review": "\nArrival is a more realistic and logical take on the idea of an alien\nencounter. This is probably pretty much how it would really go if some\nnon-hostile aliens arrived in our planet. Of course in order to avoid\nalienating the audience, the film doesn't go very technical on the\nlinguistics and how they are translating between languages. But they\nshow good enough to keep it logical and real. This film doesn't pull\nout a gun right in your face for dramatic effect. There are no nuclear\nexplosions, energy shields, battle drones coming out of the mother\nship. The alien ship is like a curious wild animal in the woods and we\nare trying to connect with it without scaring each other, or vise\nversa. Both sides are not sure if this can all go smoothly and\nfriendly. And the protagonist, a female character just like in Contact\n(1997), represents us and successfully connects with the aliens. But\nthere are other ships around the world and not all of them are as\nsuccessfully interacted. At this point human civilization must abandon\nthe paranoia against themselves and against aliens. This is the\nhumanity's ultimate test. Which reminded me The Day the Earth Stood\nStill (1951) where the humanity is tested in a similar way when the\nalien(s) refused to speak to one nation only. And in case of failure\ndestruction is inevitable. There is also a subplot, which is integral\nto the story, that tells the tragedy of losing a child. All in all,\nthis is a very well done film. Amy Adams' performance worth mentioning.\nAmong all these endless stupid superhero films of nowadays, this surely\nfelt good.\n"},
{"review": "\nThis film has been getting rave reviews everywhere I have seen and i\nhave now seen arrival and I really enjoyed this film. The premise of\nthe film sees an expert on languages recruited by the us army to\npossibly communicate with an alien threat. Amy Adams plays Louise the\nexpert on languages in this film and she is fantastic in this film. She\nis easily the most interesting character in this film and the character\nthat you care about the most. She is a pretty tragic character and you\nreally feel sympathy for her as the film progresses but she is a strong\ncharacter as well. Jeremy renner is really good in this film and adds\nallot to his character that just makes him a likable guy that works\nvery well with adams in this film. Forest whitaker is good in this film\nas the army colonel, he is a fair character that adds a sense of\nrealism to the film. This Is also the same for all the characters in\nthe bunker and from the other nations that add to this film. The story\nhas a really interesting take on the typical alien invasion that ha me\nsurprised and really interested. There's a twist towards the end that\ngave This film a real uniqueness to it that I really liked. However,\nthe film ha very little resolution involving the aliens and I found\nmyself with more questions then answers at the end of the film. The\nscript was great it has some great dramatic moments and dialogue in it\nthat makes you care about the characters. Also the film has a dry sense\nof humour that does work especially for renners character. The style of\nthe film is absolutely gorgeous, this film has the best cinematography\nof any film This year. But this film has incredibly slow pacing. At\ntimes it does work because it gives it's characters more time to\ndevelop but it does make this film seem longer then it actually is and\ndrags. Overall this is a really good film that is definitely worth\nseeing.\n"},
{"review": "\nI have just seen the arrival and overall it is a good movie. If you are\nexpecting to see some serious fights and mind blowing action scenes\nbetween aliens and humans well this movie is not for you. The arrival\nis a very human movie around 12 alien space crafts showing up overnight\nand the events fallow the incident. It allows the audience to be able\nto see the human nature and all our primitiveness behind our technology\nand science. Throughout the movie one can see how hostile and paranoid\nwe can be towards each other as humanity and as nations. We have very\nlittle faith in unity and almost every time we prefer fighting over\nreasoning. The story is good and catchy. Acting is also good. A good\nsci-fi movie with a story to tell...\n"},
{"review": "\nAnother year, another highly anticipated film from acclaimed director\nDenis Villeneuve, the director of \"Prisoners\" and \"Sicario\" is back at\nit again this time in the science fiction genre with \"Arrival\" starring\nAmy Adams and Jeremy Renner. \"Arrival\" based off of the novel \"Story of\nYour Life\" follows expert linguist Louise Banks played by Amy Adams,\nwho during an extraterrestrial invasion is contacted by the U.S.\nmilitary to try and decipher their alien language, trying to find out\nwhat their purpose on earth is, do they want peace? Do they want war?\nOr maybe something else? Well that's for Louise to find out, but\n\"Arrival\" isn't really about that, it's a love story, it's a sort of\ncoming of age story, a film about healing and revelation, beautifully\ntold by Denis Villeneuve and writer Eric Heisserer. \"Arrival\" doesn't\nquite measure up to other works from Villeneuve, but it stands as one\nof the best science fiction films of the last 5-10 years.\n"},
{"review": "\nArrival is a science fiction film starring Amy Adams and Jeremy Renner.\nEasily one of the most thought-provoking films I have seen since\nInterstellar, it is a must-see for anyone who enjoys cleverly written\nsci-fi. However, if you are expecting non-stop action and explosions,\nyou will be disappointed.<br><br>In random locations around the world, twelve mysterious alien\nspacecrafts touch down with unknown intentions. A special team is\nassembled by the US military, led by Colonel Weber (Forrest Whitaker),\nto attempt to communicate with the aliens. The team enlists the help of\nexpert linguist Dr. Louise Banks (Amy Adams) and mathematician Ian\nDonnelly (Jeremy Renner) to help translate the alien language to figure\nout if they are here for peaceful reasons or to declare war on\nhumanity.<br><br>Featuring clever and intriguing themes about the nature of humanity and\nour place in the universe, Arrival is a thinking person's sci-fi film\nthat delivers everything you'd expect and more. Director Denis\nVilleneuve's creative use of cinematography and long shots inside the\nalien spacecraft is very reminiscent of Stanley Kubrick's 2001: A Space\nOdyssey. I think he's a great choice to direct the upcoming Blade\nRunner 2049. Amy Adams gives an excellent performance in the role of\nDr. Louise Banks. There was never a moment in the film where her\ncharacter felt unbelievable or forced. I highly recommend it to anybody\nwho enjoys science fiction with something intelligent to say.<br><br>I rate it 8.5/10\n"},
{"review": "\nI've chance to see this movie at the festival UTOPIALES 2016 in Nantes\n(France) the 31 October, before the official release date in\nFrance(07/12/16). For me, it's the first incursion of Villeneuve in SF.\n(I've seen before Prisoners and Sicario two precedent production very\ngood too).<br><br>Hight quality SFX but also intimate filming of persons.<br><br>Denis Villeneuve joint for me, now, a very short list of exceptional\nrecent Directors : Matthew Vaughn, Christopher Nolan, David Fincher<br><br>I recommend and I wait now his Blade Runner 2049 version ...<br><br>PS : I apologize for my bad American writing\n"},
{"review": "\nI was expecting a good movie as I enjoyed the recent Prisoners and\nSicario by the same director. This turned out to be a GREAT movie! If\nyou've seen the trailer you'd be forgiven for thinking this is a\nstandard alien invasion film, and perhaps that you've seen all the best\nbits already. But Arrival is clever, contemplative and dreamlike, and\nnot short of surprises. Amy Adams is wonderful and her character\ncarries the entire film. In fact, for a film about aliens, the\noverwhelming theme is of humanity. The main message is one that is\nextremely important to me - we are all in this together and\ncommunication is the key.\n"},
{"review": "\nArrival may be marketed as a creepy alien invasion movie, but rest\nassured, Arrival has more in common with offerings such as 1951's The\nDay the Earth Stood still, Contact or The Man from Earth than it does\nID4, or something of that ilk. <br><br>Arrival is the newest output from Denis Villanueve, if you are not\nfamiliar with his work, think of Christopher Nolan, if Nolan knew how\nto compose a beautiful shot and write endings.<br><br>Amy Adams stars as the brainy linguist, brought in by Uncle Sam to\nattempt to figure just how in the hell to communicate with the alien\nrace, who have inexplicably appeared out of the night and seem to be\nhappy to more or less loiter in a number of creepy looking spacecrafts\nall over the planet. <br><br>To get into plot points would be quite spoilery and therefore we'll\nsuffice it to say that Arrival is a brilliantly crafted film with\nvisually arresting camera work and a haunting score.<br><br>At this point I'm comfortable in placing it into the top 5 of 2016.\n"},
{"review": "\nDennis Villeneuve has created yet another excellent feature to add to\nhis growing list of hits. Arrival is a visually stunning, thought\nprovoking film that will keep the audience captivated from beginning to\nend. If you've seen Christopher Nolan's Interstellar, you'll notice\nmany similar elements that have come to be a custom of the Sci-Fi\ngenre. <br><br>Arrival follows the protagonist Louise, a college professor and a\nleading figure in language translation, as she attempts to understand\nan alien language in hopes of answering one simple question, what it is\nthat brought them to Earth.12 alien ships, giant black totem shaped\nstones, spread throughout earth with its' intents unknown to the world.\nIt starts off as a race between nations to discover the secret of\ncommunicating with these beings. I would best describe them as tall\noctopus like creatures, with each of their long tentacles being used as\ntheir way of communication, releasing ink to create shapes and figures.\nThere's a concise message on just how important language is to\ncivilizations, and how the slightest misinterpretation could lead to\ndevastating results. <br><br>My last take away will be to praise Villeneuve's pacing of the film, he\ndoes it in such a way that reveals nothing too soon, but at the same\ntime just enough to let the audience decide for themselves what the\nculmination of everything they've seen is leading towards. I look\nforward to watching the future work of an incredible film maker.\n"}
]