[
{"review": "\n\nGothic, shocking, suspenseful, disturbing and clever, `Seven' marked a new\nbeginning for director David Fincher's career. This dark tale of murder and\ncrime revolves around two detectives in present New York city played by two\nbrilliant actors `Brad Pitt' and `Morgan Freeman' who are paired together to\nsolve a puzzle of murder that is at the hands of a man who kills regarding\nto the seven deadly sins. Both actors displayed striking performances that\nare so sharp and realistic sometimes you have to remind yourself that's its\nall acting.<br><br> David Fincher's masterpiece really gives us an opportunity of a lifetime,\nmaybe it's one that we don't all wish to share, but by seeing this movie you\nwill experience a glimpse of the horrors that this world is filled with, and\na small piece of mind of a man who you only prey you never have to meet.<br><br>Brad Pitt successfully proves to us that he's not just a pretty face on\nscreen, and that he sinks into his character so well, that you can walk off\nafter the film finishes classifying him as a pretty darn good actor.<br><br>You wouldn't expect anything else from Morgan Freeman because it's perfectly\nobvious that this guy was born to play the roles of the smart detective.<br><br>David Fincher's timeless directing and memorable filming captures all the\ngoods that this film has to offer and will undoubtedly leave you shocked and\nbegging for more films like this. Seven is a step into the harsh realities\nof life, a realistic portrayal of two detectives investigation into the\nun-describable horrific world murder, and the darkest realms of the human\nsoul.<br><br>We can only prey for more classic memorable work from Mr. Fincher and for\nthose future directors who are intent on making a gothic, psychological\nthriller, make sure you sit down and watch Seven with a pen and paper ready\nto take notes.\n\n"},
{"review": "\nRarely there has been a movie with such a good dark and chilling \r\natmosphere. I even see this movie more as an horror movie than as a \r\nthriller because of that.\r\n\r\n\"Se7en\" is unique in many ways. The movies mood is already set right \r\nfrom the beginning on. The movie starts dark, intense, chilling and \r\nmysterious, a mood that is present throughout the entire movie. It's \r\nvery depressing to watch and I mean that in a positive way of the \r\nmeaning of the word. The mood is set by good camera work and lighting, \r\nor better said, the lack of it. The music from acclaimed composer \r\nHoward Shore also adds to the chilling atmosphere.\r\n\r\nUnlike many other movies from the same genre, the movie is slow paced \r\nand takes it time to develop the characters without falling into some \r\nobvious cliché's. The two main characters played by Morgan Freeman and \r\nBrad Pitt are presented as an unlikely police-couple that are different \r\nin many ways from each other but in a way that is also what makes them \r\nsuch a great couple. Brad Pitt for once has the opportunity to play \r\nmore than just the pretty boy and he does it with success. Kevin Spacey \r\ntruly plays a bone chilling character, almost just as legendary and \r\nchilling as Hannibal Lecter. I would very much like to see the two of \r\nthem put in the same room, just to see who would make it out alive. \r\nFurther more it was great to see R. Lee Emrey again as the police \r\ncaptain.\r\n\r\nThe movie is filled with some truly gross, sickening and horrifying \r\nscene's, this seriously ain't no kids stuff! The movie has some of the \r\nmost sickening murders I have ever seen featured in a movie. But it \r\naren't just only the gross scene's that are good, there are also some \r\nscene's that are made with lot's of beauty and profession such as the \r\nlibrary scene.\r\n\r\nDark and chilling movie that you will never forget also thanks to the \r\nending which I will not spoil for you. A real must see.\r\n\r\n10/10\r\n\r\n\n"},
{"review": "\n\nThis movie is from start to finish a well produced and directed film.  The\nperformances in this movie are outstanding. Brad Pitt, once again, makes\nhis\nrole a stand-out performance by putting his versatile acting skills into\nhis\ninterpretation of Detective David Mills. Morgan Freeman is well-cast. His\nbrooding acting style fits the character (Detective William Somerset) like\na\nglove, and Gwyneth Paltrow gives her best performance EVER in the role of\nBrad Pitt's supportive wife/lover (Tracy Mills). And of course, Kevin\nSpacey\nwho plays the diabolical yet misunderstood serial killer.<br><br>The movie is suspenseful and in parts very exciting.  There is a\n\"Pseudo-Noir\" quality to this movie that really fits in well with the\ncontent of the film (Serial Killing). It has it's philosophical moments\nthat\nanyone who thinks a lot about the state of the world today can appreciate.\nIt makes subtle moral judgements without insulting any beliefs that the\nviewer may have and it also generates debate for any post-film\ncoffee/drinks\ngathering.<br><br>Andrew Kevin Walker (Screenplay) has taken the subject of the Seven Deadly\nSins and he really puts a great new twist on these themes.  As a writer, I\nreally could appreciate the depth that he goes into with these ideas. The\nmovie gives us just enough information to be entertained and informed yet\nnot bombarded and made bored with too much philosophy.  In this respect,\nthe\nfilm doesn't \"preach\" any special meaning even though the film's moral\nstatements are still maintained.  This film can be enjoyed on so many\nlevels\nand I really enjoyed the third act. One of the best pieces of storytelling\nand scriptwriting ever.<br><br>Outstanding performances from everyone involved (And yes, of course, David\nFincher does a wonderful job) Say no more. *****<br><br>\n"},
{"review": "\n\nDavid Fincher's bleak, relentless, and ultimately terrifying crime thriller\nSeven transcends other films of the genre with incredible plotting (the sort\nHitchcock might employ were he alive and making films in the 1990s) and\nscalding intelligence.  With only a small handful of minor flaws -- the\noverly familiar retiring cop/young cop pairing; the awful \"I'm taking you\noff the case!\" cliche seemingly required by the genre; one giant lapse in\nlogic in the downward spiral toward the conclusion that cannot be revealed\nwithout ruining the script's gruesome surprise -- Seven typically keeps its\nviewers imprisoned in their seats with a combination of morbid fascination\nand abject fear.  Despite attempts by studio executives to alter Andrew\nKevin Walker's ending, the filmmaking team prevailed and audiences\nexperienced that rare treat of mainstream cinema: an uncompromising\nvision.\n"},
{"review": "\nA stand out film dealing with a particularly unpleasant Serial Killer,\n\"Se7en\" (along with \"Silence of the Lambs\"), is something of a\nmilestone in this genre. An intelligent script, and admirable actors\nincluding the excellent Morgan Freeman, Prad Pitt, Gwenth Paltrow and\nKevin Spacey, with a cinema noir style, and very grisly murders\nrepresenting the Seven Deadly Sins. It is the performances however that\nlifts this movie above the average, Morgan Freeman as the older world\nwise detective, Pitt almost manic as his young enthusiastic sidekick,\nPoltrow plays the wife with a fine degree of sensitivity, and Spacey\ndoes his usual brilliant psycho routine. There is a pivotal scene with\nFreeman and Paltrow in a café which shows the depth of performances\nhere. They are believable characters in a dark disturbing world wherein\nit always seems to be raining. An effective thriller with tight\ndirection and atmospheric photography.\n"},
{"review": "\nDespite clichés, and a very depressing finale, this is one of the\nbest-made films of its era and genre.<br><br>The strengths of the film include an odd relationship between the two\nlead cops, who seem loosely based on the two lead cops of the \"Lethal\nWeapon\" series, but who (thankfully) never play for laughs, and never\nreally become \"buddies\" - the young cop is too arrogant, and the older\ncop has too much experience, which the young cop refuses to\nacknowledge. The two characters are also brilliantly acted by Morgan\nFreeman and Brad Pitt (probably his best performance).<br><br>There's one odd flaw in the film - about half-way through, I found that\nI had learned to \"expect the unexpected\" from the film, which meant\nthat the rest of the film was predictable in a bizarre way - simply\ndecide where the expected move would be, and then expect the unexpected\nmove instead. The most obvious instance of this is in the finale\nitself, which could be guessed at least 5 minutes ahead of time.<br><br>Normally, this would be a formula for disaster - but fortunately, the\nhigh quality of the film-making twists the film into an\nedge-of-the-seat suspenseful waiting game as we watch with horror the\none cop's encounter with the insanity of pure evil.<br><br>I didn't want to admire this film (to be honest, I dislike Brad Pitt\nsomething fierce), but I'm afraid I must - very professionally made, it\ndelivers its promised suspense all the way.\n"},
{"review": "\nAfter the Alien-debacle Fincher proved all the critics wrong. This film\nis one of the best in a genre that hasn't been very innovative for a\nlong time.<br><br>Everyone know's the story by now, so I won't waste time telling it.\nThis film was trend setting with it's dark, gritty look and opening\nsequence. We still see it copied in movies and TV-series today.\nEverything is great about this film. I guess if anything, the weakest\nlink in the film is Pitt, who is grossly overshadowed by Freeman. But\nlet's not look for flaws when there really aren't any. The script is\nintelligent and uncompromising. The direction is innovative en daring.\nThe production-design and cinematography are top-notch.<br><br>Fincher is one of the big boys in Tinseltown these days. Seven is the\nreason why.\n"},
{"review": "\nThis is one of those dark movies, where it's constantly raining and wet\nand where the light always seems to be dim. Appropriately enough, this\nchanges to bright and shimmering heat in the very end. As a kid, I\nhated dark movies. But perhaps it is appropriate in this case, because\nSeven attempts to be a statement about humanity: no one is without sin.<br><br>The seven deadly sins are gluttony, greed, sloth, pride, lust, envy,\nand wrath. Prime examples of people committing these are being punished\none by one, brutally and efficiently, by a psychopathic killer.\nDetectives, and reluctant partners, William Somerset (Morgan Freeman)\nand David Mills (Brad Pitt) are assigned to track down the killer.\nNeedless to say, the job gets accomplished. While some might argue it\nis done surprisingly, I'd argue otherwise.<br><br>For once, I wasn't impressed with Pitt's acting. I thought Freeman did\na great job. As usual, the villain, John Doe played by Kevin Spacey,\nprovides a chilling performance, even though he is not given as much\ncenter stage as, say, Anthony Hopkins was in Silence of the Lambs. In\nfact, the whole movie seems to hurry through without giving key\ncharacters enough time to build up their emotional worth, particularly\nMills' wife Tracy (Gwyneth Paltrow).<br><br>In the end, Seven does manage to get its point across effectively.\nWhile watching the movie itself, I thought it a bit anti-climatic, but\nwhen mulling it over later, the images echo very strongly in my mind.\nOne of the most disturbing films I've seen.\n"},
{"review": "\nI love psychological thrillers and this is one of the best I've seen.\nMorgan Freeman was elegant and convincing as a burnt out cop who wanted\nto retire but found the fascination of the job tough to let go of. Brad\nPitt made the transition from cocky new guy to serious cop vry\nconvincingly. And what can I say about Kevin Spacey who is always\nexcellent. (Except to wonder why his name doesn't appear in the opening\ncredits - I looked three times.) And Gwyneth Paltrow as Pitt's wife was\nas fresh and charming as ever. I truly enjoyed the performances of all\nthe main cast members.<br><br>The best part of this film is that even when the killer is caught the\nsuspense isn't over. In fact - it may be just beginning.\n"},
{"review": "\nSomerset, (Morgan Freeman) a deeply Intellectual Detective, with barely\na week left until his retirement and Mills, (Brad Pitt) the new cop in\ntown, who is a pretty weak detective, are thrown together to\ninvestigate what at first appears to be another Homicide.<br><br>After a second Victim is found, Somerset realises that this is no open\nand shut case, and requests that he is relieved, in light of his\nimpending retirement. Mills gladly takes over the case and plunges\nhimself in way over his head.<br><br>As the work of a Crimally insane genius continues, Mills grows more and\nmore erratic, and Somerset simply has to remain, to guide his young\npartner through the case, which ultimately leads to one of the finest\nclimax's in movie history.<br><br>With Wonderful Performances from both Freeman and Pitt and a really\ndark and morbid direction from David Fincher, the movie is crammed with\nsuspense, intrigue and Excitement.<br><br>My Favourite scene is John Doe (Kevin Spacey) tearing into Mills in the\ncar, driving towards the Climax, the acting is simply perfect as Pitt's\ncharacter is torn apart by the genius of the Criminally insane, and\nFreeman interjects with insightful rationality, demonstrating his\nsuperior mind. The Scene Carries such intensity, and at the same time\nencapsulates the primary characters basic elements. Most actors can't\nachieve this level of character depth, but these are three of the\nfinest actors of our time. 9/10\n"},
{"review": "\nAt first, I was a little hesitant about taking time out of my life to\nsee Seven. I mean, I am a busy person... but this film was well worth\nmy time... Perhaps the best Brad Pitt film that I have seen, this film\ninvolves two detectives (Pitt and Freeman) going after a delusional\nkiller (Kevin Spacey) who murders his victims according to the seven\ndeadly sins: gluttony, greed, lust, etc... Spacey takes pride in his\nkillings and leaves clues for the police, similar to \"Son of Sam\"\nkiller David Berkowitz when he murdered six women in New York City in\nthe 1970's (\"Summer of Sam\"= another great film)... This was an intense\nthriller that had me on the edge of my seat from start to finish...<br><br>Movies generally take a lot to keep me interested, and I am generally a\nfan of comedies and action flicks. But Seven was different.... it was a\nfantastic thriller that kept you thinking and waiting to see what\nhappens as Pitt and Freeman chase down the barbaric killer who feels\nthat he is doing \"God's deed\"... This film is a must-see!! My only\nregret is that I had did not see it until 10 years after its theatrical\nrelease... Please feel free to email me with any questions or\ncomments...\n"},
{"review": "\ni love this film, it is the ultimate thriller film, everything about\nse7en is brilliant. the cast are well picked and make the best\ncontributions, the main characters Somerset and Mills are portrayed\nperfectly through Freeman and Pitt. in my opinion this is both Pitt and\nFreeman's best film, they still have not outshines there fantastic\nperformances. Paltrow as mills wife was a good choice though there are\na few other actresses that could have played this part, though i think\nthat what paltrow brought to the role was the fragile emotional side of\nthe character, so i am pleased that she played this part so well. the\ndirector is my favourite of all time, Mr David Fincher! he is a\nfantastic director, not just for this film but for his other films like\nfight club. he gets fantastic results from his cast and crew and makes\nthe perfect film. and as i'm a budding editor myself i have to mention\nthe fantastic edit on the film, by the editor Richard Francis-Bruce, i\ndo love the edit on seven as he cut at hit points and generally did\nwell.<br><br>if you haven't watched it watch it, if you've seen it seen it again! i\ncertainly will.\n"},
{"review": "\n\nSpoilers herein.<br><br>What a great boon these DVDs are! -- where we get to view and review with\ncomments from the creators.<br><br>Sometimes the creative artist is a poor authority for the depth of their own\nart. So it is with some interest that I check if what I have seen was what\nthe director thought he put there. Often, I find them simply working on\nintuition. But the better performing artists are different. They must always\nintend -- if they do not intend a specific feel or effect then it simply is\nnot there. That's why when a DVD commentary involves an actor it is of\nparticular interest.<br><br>In this DVD, we hear Pitt, who really commits to delivering, who worries,\nwho prepares, who sublimates self in order to create an image of himself in\nyour mind. And we hear Freeman who is arrogant, demanding of you and not of\nhim, offering a here-I-am take-it-or-leave-it style of acting, which he\ncalls `intuitive.' This really explains a lot for me. It's why Freeman is a\nnegative attractor for any film I consider, and Pitt the other way\naround.<br><br>Either way, Spacey is the only one that connects with his character, and\nhe's given a relatively simple job. <br><br>I admit that this story moved well, engaging by shock and unexpected moves\nwhen I first saw it. But on repeated viewings, substantial sloppiness gets\nin the way. What remains is the very fine lighting. I think `Fight Club,'\nwas much the superior film. This one hardly rates any celebration.<br><br>\n"},
{"review": "\nThis is an outstanding movie. Morgan Freeman and Kevin Spacey are\npitch-perfect, and Brad Pitt is solid. Pitt actually had a lot to do\nwith this movie's success outside of his acting. He forced the studio\nto keep the original ending, and he forced them to shell out the money\nto get Spacey. It is fortunate that he did, as those two elements are\ncentral to the movie's greatness. Spacey played the killer so\nchillingly that it makes his message seem all the more unnerving and,\nperhaps, correct. The uncompromising ending leaves the viewer shocked\nand reeling. This movie could not have worked without it. Outside of\nthose obvious elements, another key to the film is Freeman's character.\nHis outlook on life is and how it is affected by the murders and by his\nnew partner is a key subplot the film. It brings more weight to the\npicture. Also, David Fincher's dark, dreary direction adds to the film,\nsomewhat similar to the way Ridley Scott's dark vision adds to Blade\nRunner. The constant rain is a nice touch, especially when it\nironically recedes after the killer shows up. I was never a Nine Inch\nNails fan, but their dark brand of music fits this film well, as\nevidenced in the opening credits. Overall, I think this is one of the\ngreat films of all time. Watch it if you can handle grisly images and\nif you like unnerving endings.\n"},
{"review": "\n\nI first saw this movie when I first visited America, I knew nothing about\nthis film (as it had just opened) so I paid my money and gave the film a\nchance. It simply blew me away. The ending is just unbelievable. The\nperformances are fantastic, the direction and art design are exceptional\nand\nKevin Spacey (my fave actor) popping up towards the end was the icing on\nthe\ncake. Plus every time I watch the film now it reminds me of being in\nAmerica... it's my favourite movie, for so many reasons.\n:)\n"},
{"review": "\nThe greatest thriller of all time right next to Silence of the\nLambs.David Fincher has outdone himself and it shows.The story is\nsimple.Two detectives must apprehend a twisted serial killer who\npunishes his victims for their own sins.But what they come across will\nsoon change them both forever!!!Expert story teller Fincher builds non\nstop tension which nearly explodes by the end of the movie.Morgan\nFreeman and Brad Pitt are at their best here.There is great chemistry\nbetween the two and Gwyneth Paltrow is terrific as Tracy.The end of the\nmovie is one of the most shocking experiences ever on film.The first\ntime when I saw Se7en i was shocked,horrified and just couldn't believe\nwhat just happened.THE END will shock you be sure but that is one of\nthe reasons the movie is so good.The final lines by Somerset are\nmoving:\"Ernest Hemingway once wrote that the world is a fine place\nworth fighting for...I agree with the second part\".\n"},
{"review": "\nThis is by far the finest serial killer movie of all time. The script\nis beautifully paced and original with a fantastic twist at the end.\nThe acting is superb, everyone is on the top of their game. Morgan\nFreeman shows his versatility and superb natural ability in the role of\nretiring detective Somerset, Brad Pitt gives the performance of his\ncareer as the young feisty Dectective Mills and Gwyneth Paltrow is\nfantastic as his highly sympathetic and caring character of his wife\nTracy. But of course it is Spacey who steals the show as the compelling\nchilling \"John Doe\".<br><br>His entrancingly calm and chilling performance lifts the picture above\nmany others of its genre and his pure evil glint is just as chilling\neven more so than Anthony Hopkins in \"The Silence of the Lambs\".<br><br>I believe that Se7en is far far superior to \"The Silence of the Lambs\"\nand others of its kind. It was one of the greatest films of the 90's\n(for me second only to \"The Usual Suspects\") and i feel is constantly\nunderrated by many. I am glad to see it at #36 although i feel it is\nworthy of the top 20.<br><br>This is David Fincher's finest hour as a director with his drab rainy\nsurroundings adding a superb drab atmosphere to a drab city. Andrew\nKevin Walker's script is however will be what remembered as an\nincredible story, perfectly crafted and acted out beautifully by\nSpacey, Freeman, Pitt and co.<br><br>A MUST SEE FILM FOR EVERY FAN OF GREAT 90's MOVIES, ONE OF THE DECADES\nGREATEST.\n"},
{"review": "\nDavid Fincher's best movie until date, Se7en is a dark portrayal of a\ngenius psychopath killer, brilliantly played by Kevin Spacey. He is on\ncamera for no more than last 30 minutes of the movie, but so dominant\nis his character that the entire movie seems to be cast around his\nuncanny-ness.<br><br>The hero of the movie though is neither he nor Brad Pitt nor Morgan\nFreeman \u0096 the two detectives entrusted with the task of tacking him\ndown. It is the plot and the script, extremely brilliant though very\nmurky and enticingly morbid. You see gory murders that leave trace of\nheart-rending torture, but all that it makes you do is become more\ninquisitive about the killer. The killer is the sole obsession with the\ndetectives too and the contrast between Brad Pitt's edginess and Morgan\nFreeman's poise is very well portrayed. It parallels the contrast\nbetween the killer's poise and the edginess of the action sequence.<br><br>The climax of the movie is startling, revealing and disturbing. It\ncharacterizes the essence of Se7en, a movie that stirs you and makes\nyou sit up and take note of it. Calling Se7en a psychological thriller\nis understating its significance. It is a movie that goes well beyond\nthat, making you aware of the morbid possibilities that exist in human\nmind. The movie is also remarkable for the fact the cinematic climax\ndoes not provide you any catharsis, it just sets your mind thinking \u0096\nnot in the least about what it takes to craft a script as this and to\nmake a movie as disturbingly poignant as Se7en.\n"},
{"review": "\n\nSeven is a very dark and tough thriller.  Most of the scenes are shot in\ndimly lit and wet places which add a lot to the dark mood of the film. \nAndrew Kevin Walker (8mm) wrote this somewhat brilliant screenplay in which\nBrad Pitt (12 Monkeys, Legends of the Fall) plays a young and cocky\ndetective new at the precinct who gets help from the wise old veteran about\nto retire, played by Morgan Freeman (Hard Rain, The Shawshank Redemption). \nIn their first few days together they discover a few bizzare and gory murder\nvictims which seemed to be done in a certain and planned way.  Soon Freeman\nis convinced that someone is using the seven deadly sins to kill people and\npreach a sermon.  So Pitt and Freeman are off on a man-hunt trying to find\nthis man.  Gwyneth Palthrow (Shakespeare in Love, Emma) plays Pitt's wife in\nthe film.  This is a disturbing film with several graphic post-murder\nscenes, but still a very good film.  Freeman is great as he always is.  Pitt\nwas disappointing, however, giving an average performance at best.  Kevin\nSpacey (The Usual Suspects, L.A. Confidential) is magnificent in a small,\nbut important role.  The film leads up to an incredible climax which is the\nbest part of the film and makes watching it all very worthwhile.  Highly\nrecommended.\n"},
{"review": "\nMaybe I've just seen too many movies. Maybe my expectations were too\nhigh, having seen this movie highly praised here. Maybe the story\nseemed a bit too predictable to me. Maybe I just found some of the gore\na bit over the top. Or maybe I've seen so much gore in films already\nthat I simply wasn't that impressed.<br><br>Whatever it was, this movie struck me as okay, certainly not bad, but\nnot the masterpiece others have praised it as. Interestingly, I've seen\nmost of the main characters in movies that I liked better: Kevin Spacey\nappeared in The Usual Suspects; Brad Pitt in Twelve Monkeys (although\nhe also did a fine job here); and Morgan Freeman in Driving Miss Daisy\nand The Shawshank Redemption.\n"},
{"review": "\n\"Se7en\" may be one of the greatest movies I have ever seen. The idea is\nvery original and intense. The movie is not boring for a second. You\nwill be entertained the entire time. This movie is definitely not for\nmost people, but if you like violent and thrilling movies, this is a\ndefinite see. This movie came out a long time ago, but it is up there\nas one of the best movies in the past 20 years. Kevin Spacey plays an\nastounding performance as \"John Doe\", the serial killer who uses the\nseven deadly sins as a purpose to murder. Morgan Freeman and Brad Pitt\nas well play excellent roles in this great movie. This movie is one of\nmy absolute favorites and I could watch it every week and never get\ntired of it.\n"},
{"review": "\nIncredibly gritty, very fluid, and most disturbing are all ways that\none might describe David Fincher's Seven, a film, as all of these\nreviews on here will attest to, is about a serial killer-maniac killing\npeople based on the seven deadly sins. There is little need to rehash\nthe plot here then but what makes Seven such a good film and one of the\nbest thrillers of the last few decades? 1). Two strong, key\nperformances by Brad Pitt and, in particular, Morgan Freeman as New\nYork police detectives just united as one, Pitt is coming, and the\nother is about to retire. Freeman and Pitt have some chemistry between\nthem and let's face it - Freeman is just plain good at just about any\nrole he assays. Add to this strong supporting work from Paltrow and R.\nLee Ermey and especially Kevein Spacey as the killer. Spacey's voice\nand looks sent chills down my spine each time he was on screen. 2)David\nFincher knows how to direct. This film is gross and really is selling a\nvery seedy product as something more. Fincher makes that happen with\nthe crisp dialog between Freeman and Pitt, the very low lighting\neffects throughout, the quick pacing of the film, and the depth of\ncharacterization that he allows his characters to have. 3) The story is\nwell-conceived, well-written, and just crazy enough to be believable.\nThe film has many scenes which are shocking and designed to be so -\nthey succeed. But behind all that blood and seedy atmosphere lies a\nchess game between two police detectives - each good at what he does in\na different manner - and one crazy but brilliant sociopath killer. The\njourney they take us on is one scary ride.\n"},
{"review": "\n\nThis great thriller is about a serial killer (Kevin Spacey) and his Se7en\nvictims who represent the Se7en deadly sins. Two cops (Morgan Freeman &amp;\nBrad\nPitt) have been assigned to investigate this case.<br><br>This is the best movie of the 90's, it has great thrilling moments, Morgan\nFreeman &amp; Brad Pitts performances are excellent. Se7en has one of the best\nbut shocking and surprising endings of all time. The end is something\nnobody\nwould expect, i kept rewinding over and over again to see them 3 short\nseconds where you see... (im not going to spoil the movie).<br><br>Kevin Spacey's role in this movie was a surprise for everyone, well except\nfor the people who use IMDB, it said who the killer was played\nby.<br><br>The most shocking moment for me was when you see that body on the bed and\neveryone thinks that person is dead because of the state of the body, but\nits not, that scene shocked me alot, i never forgot it and never\nwill.<br><br>Overall i gave Se7en 9/10, everyone that likes thrillers should go see\nthis\nmovie, HIGHLY RECOMMENDED.\n\n"},
{"review": "\n\nSe7en is excellent thrilling mystery that has a great cast! Brad Pitt was\nvery good and at the when he found out, his acting was superb! Morgan\nFreeman was also excellent! Kevin Spacey played John Doe flawlessly!\nGwyneth\nPaltrow was good. R. Lee Ermey was good as always! It was surprising to\nsee\nRichard Roundtree in the movie. John C. McGinley had a small part which he\ndid good for the limited time he got to perform and Richard Portnow was\ngood. The music by Howard Shore was very good. David Fincher's directing\nwas\nunique! The last part of the movie when John Doe turns himself, when he is\nin the car with Pitt and Freeman, and when they were on the desert and the\nhelicopter scenes were through the binoculars, and when Pitt and Freeman\nwere going back and forth, that entire scene is one of the greatest in\ncinematic history! This film is really horrifying and not for the\nsqueamish\nbut if you love gruesome murder mystery movies this is a great one to\nwatch!\n"},
{"review": "\n\nI thought this movie was a pretty remarkable exercise in style and an\nincredibly controlled performance by Morgan Freeman.  Most of it is kinda\ncliched \u0096 the retiring cop breaks-in a rookie (by-the-book vs. the loose\ncannon working on a hunch), the clever serial killer, the soulless city, the\nstandard noir ending where the searcher realizes that he is what he's been\nsearching for and so on.  \nThe art direction is wonderful, with a real attention to\ndetail.\nThe movie makes for riveting viewing the first time around.  I find myself\nskipping chapters though when I try to watch it again.<br><br>To make the last act measure up to the first hour of the movie, I think the\nwriting should have emphasized the idea that the wrath/envy set up was an\nexample of John Doe improvising after the detectives found his apartment. \nThe wrath/envy scene doesn't have nearly the convoluted menace of the Sloth\nor Gluttony scenes.  It's a noir thriller and Gwen is unaccounted for - the\nend seemed pretty obvious to me compared to the craziness of \"HELP ME\" in\nfingerprints.\n\n"},
{"review": "\nThis movie was just awesome.A thriller that really leaves you on the\nedge of your seat the whole time your watching. It starts morgan\nfreeman who always does a superb job, accompanied by brad pitt who\nalways did an outstanding job. And to top it all off it was directed by\nDavid Fincher who has made some great movies.<br><br>This movie is about two detectives (Freeman,Pitt) who are sent to\ninvesitage a weird string of murders. There is a murderer killing\npeople using the seven deadly sins as justification.<br><br>Overall this movie was really good. Great actors, great story line and\na lot of twists and turns to keep you interested. I really liked it.\n"},
{"review": "\nI never understood why Seven was never given the credit it truly\ndeserves. This movie has a total package. You get horror(in its purest\nform), suspense, drama and lots of action. I would rate Seven as one of\nmy favorite horror flicks. The way the film concludes with all seven\nsins being committed and the way the last two unfold is magnificent\nwriting. The sadistic style in which John Doe disposes of his victims\nhighlights the suspense aspect perfectly. I don't know if there has\nbeen a better selected cast. Brad Pitt as the rookie, cocky detective.\nMorgan Freeman(one of my personal faves) as the veteran. Best of all\nKevin Spacey as the macabre and very twisted John Doe. If you haven't\nseen this movie, rent it Tonnie.\n"},
{"review": "\nThis story takes you where it wants you to go. <br><br>The proof is that while there are some gruesome acts in this movie (you\nonly see the aftermath, no action), the most disturbing crime in the\nmovie is the least gruesome. <br><br>There are very few movies that pull-off a mix of repulsive crime and\npsychological involvement as well as this one.<br><br>The character development was done very well with while not distracting\nyou by burying you in the personal life of each character<br><br>Initially, I felt the main detective character was a little\nunbelievable a bit too methodical. As the character developed though,\nyou start to see that as a part of his personality, the element that\nlevels the playing field between him and the criminal. In the end, I\nfound him to be as diabolically analytical as the criminal.<br><br>The chess game between the main detective and the criminal was\nflawless. Had they got the criminal into custody any other way than\nthey did.. it would have ruined the movie.\n"},
{"review": "\nI went to a friends house last night and rented movies. I picked Se7en\nto rent because I've always wanted to see it since I saw David\nFincher's masterpiece, Fight Club and his well made thriller, Panic\nRoom. People have always said this movie was good so I wanted to see it\nif they were right and they were sure right. Seven is an insanely\nbrilliant film from start to finish. The performances by Morgan\nFreeman, Kevin Spacey, and especially Brad Pitt are all phenomenal in\nthis chiller. The movie was just plain out suspenseful and left my\nheart beating fast til the movie was done. The twist at the end was\nvery intense and you never knew it was coming. Totally unpredictable.\nOverall, a fantastic film and David Fincher is a pure genius when it\ncomes to smart films and Se7en deserves to be one of the greatest\nthrillers that has ever been made. I highly recommend it.<br><br>Hedeen's Outlook: 9.5/10 **** A\n"},
{"review": "\nThis movie really is a modern day classic. The film is a true suspense\nfilm that always has you at the edge of your seat from beginning to\nend. It truly is a great film for anyone to see. So I'll give it 20 out\nof 10! The scenes were shot great and very dark so it made you really\ninterested. Brad Pitt played a phenomenal part as the new detective,\nand Morgan Freeman as the old going to retire cop. they both had great\nchemistry between their characters and that really helps the film. But\nthe most greatest part in the film was the ending! You would have never\nthought that the killer would go to that extent! I will not give out\nthe ending, but believe me, you'll be be shocked!\n"},
{"review": "\nSe7en is great. Need I go on? Alright... Se7en starts off nicely making\nit look like another day at work. Well it is, but it's the beginning of\nsomething big. Not 5min into the movie and we're introduced to the\nfirst murder scene which is a obese man with his hands tied together\nunder the table and his face smashed into a pile of noodles. He's\nobviously dead. The killer in this movie picks his victims according to\nthe seven deadly sins, which if you don't know are: greed, gluttony,\nlust, pride, wrath, envy, and sloth. The killer is very original in the\nstyle he kills his victims, which are often times very gruesome.\nAlthough they don't really show any killings in here just the way they\nimplied lust was enough to turn my stomach. The movie does a great job\nwith its dark setting and bad neighborhood. Symbolic that this city\nsucks and is run down. The acting by Mordan Freeman and Brad Pitt is\nsensational, as well as Kevin Spacy's acting, whom I praise for his\nrole. Overall this is one of the best movies I've ever seen, and the\nending... oh buddy, the ending will getcha.\n"},
{"review": "\n\nDavid Fincher has become one of Hollywood's most wanted directors since this\nfilm and this is a fantastic film. Since this he hasn't done a bad film, in\nfact most are excellent. Seven is more conventional than his films the Game\nand Fight Club but it has a great script which is fantastically directed.\nThe actors of the film are of the highest calibre. Morgan Freeman, Brad\nPitt, Gwynith Paltrow and Kevin Spacey are all fantastic, Freeman and Spacey\nin particular. The film has plenty of twists and is involving while\neverything comes to a shocking and stomach churning ending. This is\ndefinitely one of the best crime thrillers ever made.<br><br>As with other Fincher movies it looks fantastic. The cinematography is\noutstanding. The score is also fantastic and the overall look and sound of\nthe film is top class. This is a modern classic, no doubt.\n*****\n"},
{"review": "\nThere is no doubt \"Seven\" is a superior film in every way, so far as\ncrime dramas/psychological dramas go, Fincher is indeed a visionary\ndirector. This film however has achieved an unrealistic and totally\nunsupportable \"aura\" of brilliance that is simply unjustified. Having\nseen it now five times, the latest last night after my son bought it\nfor my birthday, I have to declare it to be as boring and pretentious\nas the first night I saw it.<br><br>Without anything but praise for everyone's performance (Spacey,\nespecially) I still have nothing but blank indifference to every\ncharacter presented here. What in Zeus' butthole was the point of the\nfilm? Any half competent lawyer would have gotten Pitt a suspended\nsentence (justifiable homicide...temporary insanity..whatever) Who\ncares what the hell Freeman decided to do...hang around a few more\nyears, go shoot a few chickens? As for Ms Paltrow - the most boring and\none-dimensional actress yet paraded on the silver screen (though Nicole\nKidman isn't far behind)...HER fate was the highlight of the movie.<br><br>Shamelessly exploitive crap though it was, I found RESURRECTION (A\n\"Seven\" clone) way more interesting and given that starred Mr \"Wooden\"\nhimself (Christopher Lambert)....maybe I need therapy.<br><br>Quite frankly for all its social comment, upmarket direction,\ncinematography and set-design, I think \"Seven\" is a modern \"Kings New\nClothes.\" Great film....shame about the entertainment factor. ANY film\nthat feels like you've just donated four hours of your life has at its\ncore, a problem.<br><br>As for those who even MENTION this in the same breath as SILENCE OF THE\nLAMBS - you HAVE to be kidding! That sequence between Hannibal and\nStarling during their first meeting alone, blows everything this film\nhas to offer out the window.\n"},
{"review": "\nI didn't really hold out much hope for SEVEN . It's a film that's\nalmost 20 years old and one that I frequently miss usually on purpose\nwhen it's shown on television . I've always thought David Fincher was\npainfully over rated . \" Best director of his generation \" claim many\npeople which is patently untrue if you've seen a film by Danny Boyle or\nDarren Aronfsky or Ang Lee . The premise itself doesn't inspire\noptimism being a couple of mismatched police partners trying to track\ndown a serial killer who is motivated by the seven deadly sins . I\nalmost believed I was going to be watching a reworking of the Vincent\nPrice camp classic horror movie THEATRE OF BLOOD without the funny bits\nso I went in with very low expectations <br><br>What Fincher has done is construct a thriller that is dialogue driven\nwith a sense of portent dread . It'd be very easy , perhaps too easy ,\nto shock the audience with gore and startle moments . Instead the\ndirector resists this very easy temptation and put the audience in the\nshoes of detectives Somerset and Mills so this is a rare thriller where\nthe audience join up the dots when the detectives do . The film is\ngreatly helped by Morgan Freeman who was probably Hollywood's most\neffective character actor at this point but both amazingly Pitt and\nSpacey hold their own against this acting legend <br><br>In short this is a very good gloomy thriller with very dark\ncinematography and very dark subject matter . The fact that there's so\nmuch understatement to it is refreshing and nearly 20 years after it\nfirst hit the big screen it remains director David Fincher's best work\n"},
{"review": "\nThis movie is filled with ridiculous references to Catholicism. I\nremember watching it as a teenager and I completely did not notice it\nat the time. This is a sick movie (on so many levels) and I am not just\ntalking about the gore.<br><br>Gwyneth Paltrow's character wants to abort her unborn baby. She doesn't\nlike the violent city (New York) she and her husband have moved to; and\nis worried about raising their child in that city. What a good reason\nto have an abortion! Morgan Freeman's character talks her out of it.\nApparently, Morgan's character convinced his wife to have an abortion\nand \"later regretted it\".<br><br>The decision by Paltrow's character ends up being a mistake, because\nshe (and her baby) are gruesomely murdered at the end of the movie. But\nthis is only the beginning of the Catholic-related absurdity...<br><br>The killer in this movie is a crazed Catholic, who decides to\ngruesomely kill and torture seven people after reading a book by St.\nThomas Aquinas; one of the most gentle and brilliant men who ever\nlived. This includes - ironically - the unborn baby mentioned\npreviously.<br><br>This is a sick movie made by a director who - for some reason - felt\nthe need to insult the Catholic Church. He must have been schooled by\nScorsese.\n"},
{"review": "\nThrillers are either a hit or a miss. They can be awesome while many\ncan be awful. Seven is in the Very awesome category. Basing the film\naround the seven deadly sins is an concept that everyone can relate\ntoo. We have all sinned meaning we can be put ourselves in the shoes of\nthe victims ( not all victims mind you ) . When you imagine a film in\nwhich it always cloudy and overcast with rain pouring down 24/7 , you\nwould think it going to depress you . Truth is , you don't actually\nnotice the weather , but instead take huge interest on what happening\nin the homes of the city.<br><br>I'm not an huge fan of Brad Pitt but it seems that when he teams up\nwith Fincher , he always puts on an good performance. Then there's\nMorgan Freeman, which is fairness, is playing Morgan Freeman. He fun to\nwatch but you know what type of performance he going to act out. Both\nare very good but the one who steals it is Kevin Spacey. He may be in\nit for 20 minutes, but his role is extremely memorable. His character\nis well made and maybe deserves a bit more screen time . The film is\nvery well made and an joy to watch. It keeps you awake and leaves you\nto wonder about the next deadly sin. When watching it, you can clearly\nsee that Seven was an influence towards Leigh Whannell and James Wan\nand there SAW film. Everything about SEVEN was great, the concept, the\nacting, the finale. I highly recommend this film.\n"},
{"review": "\nThinking back, I do believe this was my first 18 certificate film I\nwatched at the pictures and it left a real impression. It's always been\na favourite even though for some inexplicable reason I have only seen\nit just the once.<br><br>So it was with some trepidation that I bought the 2-disc DVD on ebay\nrecently and decided to watch it the night before last. I wondered if\nknowing the dramatic outcome already would spoil the viewing pleasure\nof what goes before.....It didn't.<br><br>I wasn't wrong as a 15 year old in my assumptions that it was the best\nthriller I'd ever seen and while I've seen some great films over the\nlast 13 years I'm pleased to say that this one is right up there with\nthe best of them. It's also weird how I seemed to remember every single\ndetail from every scene, even with my notoriously dodgy memory.<br><br>I just can't fault this flawless film, Fincher was on top of his game\nhere and it's definitely my favourite of his and I am a fan of Fight\nClub\n"},
{"review": "\nIt really was. I saw this movie in a Five Below store. There were about\n10 copies of the normal version, and abut 2 of the special edition ones\nthat look like notebooks. I went on a limb and bought the special\nedition for $5. I had no idea what this movie was like nor what it was\nabout. But I am so glad I took the chance and bought it. This movie\nturned out to be a personal favorite. Morgan Freeman was excellent, not\njust because he's a great actor, but because in this movie he was\ndifferent than the \"optimistic, nature-loving\" characters he usually\nplays. In this movie he plays the close-to-retirement Detective William\nSomerset, who dislikes the world and what it has become. Brad Pitt gave\na great performance as the loud-mouthed, over-jumpy Detective David\nMills. Usually I don't like Brad Pitt and I think hes obnoxious and a\nlousy actor, but in this movie I'll make an exception. He was obnoxious\nin some ways in this movie, but it fit his character perfectly. Gwyneth\nPaltrow gave a decent performance as the stressed Tracy Mills. R. Lee\nErmey was great as the Police Captain, I always enjoy his performances\nno matter what the circumstances. Even the bad guy (Will not give the\nactor's name to prevent spoilers) was Grade A in his part. The weather\nwas rainy for most of the movie, and scenes were always lighted in\nsmall doses, meaning it was dark and gloomy for most of the film. THis\nreally set the tone. I recommend this movie to fans of crime, thriller\nmovies. 10/10\n"},
{"review": "\nDetective Lt. William Somerset (Morgan Freeman) is about to retire. He\nis teamed up with a young new detective David Mills (Brad Pitt).\nTogether they try to find a serial killer who uses the seven deadly\nsins as his M.O. Meanwhile Mills' wife Tracy (Gwyneth Paltrow) fears\nfor her husband's life and is very depressed.<br><br>Dark and depressing but just fascinating. Director David Fincher shots\nthe entire film in dim light and shoves the victims mutilated bodies in\nour face. The grimness of the tone wears you down but that's\nappropriate considering the subject matter. No humor either. It all\nleads to a truly harrowing ending. There was supposed to be a happy\nending but they (wisely) chose not to do it. Freeman and Pitt work very\nwell together and both give excellent performances. I even thought\nPaltrow (who I hate) was good! Kevin Spacey is very good too in a small\nrole.<br><br>If you have trouble with blood, gore and disturbing subject matter stay\nfar away from this movie. But if you can handle that, watch this one.\nIt's depressing and unpleasant but riveting.\n"},
{"review": "\n\"Se7en\" is unique because of the extraordinary sympathy it manages to\nfoster for its two main characters; it's unique because of its bleak,\nhopeless environment that serves as a symptom of civilization's general\ndecline. It's strengthened by its brilliant performances capturing\nmostly decent people struggling to survive in the sewer without\nbecoming tainted by it. The fictional John Doe would most likely agree\nwith all these theoretical snapshots of despair - the difference comes\nin his psychopathic desire to come up with a plan that he thinks will\nsolve it.<br><br>Few forms of popular entertainment manage to afford the villain his say\nwhilst still maintaining a sensible distance from his horrific acts.\nWhat I like best is the film's depressing contention that there isn't\nas much distinction as we think between the good guys and the bad guys.\nWe're all affected by the distasteful aspects of society, but do we\njust hope that our own positive contributions will be enough to offset\nthem - or in extreme situations, when we stare into the abyss, will the\nabyss stare back at us? <br><br>Some may well be upset that the killer's justification contains\nreasoned objections. It is really only by resorting to crime that he\nreveals himself as a madman. Rather than be outraged, though, I prefer\nto celebrate good writing that allows us to see hidden facets of an\nissue, however unpalatable the resultant consequences of such a\nviewpoint may turn out to be.\n"},
{"review": "\nWhat is the most simple way to present the Human's dark side? The\nanswer is by sins: Sins that from the Fifth Century announce Man's most\nawful deviations from God.<br><br>This movie isn't catholic yet, nor does it have an approach: it's\nimpressively dark and violently grim. From the first start, the\ncharacters are presented surrounded by a whispering, sad rain. The mood\nis also set with dampened colors and grayish tones. Nobody ever smiles\nin the film, they laugh for few seconds when united in a dinner. But\nthroughout the story, Detective Mills (Pitt) and Detective Somerset\n(Freeman) will set up on a case that is horrendous and enigmatic: a\nserial killer roams the city with the Capital Sins as basis to create\nhis assassinations. He preaches, according to Somerset. Mills isn't\naccustomed to the following Odyssey, he is yet not aware of the fatal\nobscurity of the Human Mind. Somerset is about to retire, and he knows\nwhat he deals with his job, Morgan Freeman with his tired eyes show you\neverything the character has seen among his trail.<br><br>As the play is opened; the killer behind the murders shows to be\nanalytical and intelligent and he isn't afraid of people chasing him:\nhe just introduces him to his ultimate \"work\". He plays with them. He\npresents a puzzle for them to solve as he is in total control. Kevin\nSpacey will surprise everyone with his psychotic demeanor and his empty\ngestures, showing spiritual deprivation.<br><br>\"Se7en\" is likely not for everyone. It is intended to expose the Dark,\nTwisted side of mankind, engulfed by a series of morbidly well thought\nmurders. Actings are stupendous, all variating from a negative panoply:\ndepicting Sadness, Anger, Worry superbly. Nothing is cheerful, nothing\nis lightning and warming. The movie shows you perfectly what man is all\nabout on their obscure range. It is shattering, it is demanding. But it\nis one of the most excellent experiences on nowadays cinema.\n"},
{"review": "\nThis film has many indelible moments, an amazing cast: Morgan Freeman\nas Detective Somerset is impressive and real. The Charlie Parker\nsoundtrack with the blues sung by Billie Holiday \"I Cover the\nWaterfront\" captures the dark mood and underlying violence which exists\nin the city. Being from New York, the street scenes at night are 100%\naccurate, executives, harried workers, hookers and dealers all\nintermingle in a pastiche of chaos.<br><br>We see the early scene where Freeman first meets novice detective David\nMills (well portrayed by Brad Pitt) and he asks him what NYC homicide\nis like, and won't agent Somerset regret retiring? Freeman answers\ntiredly ...\"I am moving....anyplace...far away from here\"...<br><br>Sloth, Greed, Lust, Pride, Envy, Gluttony, the seven deadly sins as\nproclaimed since Medieval era. Each murder is precisely carried out.\nJohn Doe is creating his masterpiece, an artwork of perfect murder.\nKevin Spacey is superb as John Doe. His presence and diction are\ncutting and menacing. I would love to see him in more of these roles.\nThe quote from Morgan Freeman at the end of it all resounds true: it is\nthe quote from Hemingway. The theme is \"ask not for whom the bell\ntolls, it tolls for thee\"....Everyone is affected by violence. Best\nthriller and suspense, other than Hitchcock. Kudos to David Fincher and\nthe cast The screenplay is amazing, I have bought that as well as the\nDVD. Highly recommended. 10/10.\n"},
{"review": "\nThis movie is a cross between Silence of the lambs and Bone collector.\nThere are some very clever investigation scenes and clever writing and\nset creation.<br><br>This movie was a showcase for Kevin Spacey and Morgan Freeman. This\nmovie had one of Morgan Freeman's best roles where he plays a educated,\nintelligent and experienced detective. Brad Pitt has a role but is not\nas impressive.<br><br>This movie certainly had a new approach to police / horror movies. This\nmovie and Silence of the lambs brought a whole new level of gore and\nhorror to mystery movies. This is not a kid friendly movie and does not\nhave a happy ending.\n"},
{"review": "\nThe serial killer movie is one of the (if not the one) concise genres\nof the 1990s. David Fincher started his feature film career in the 90s\nwith \"Alien 3\", a good but not great sequel to the \"Alien\"-series. But\nthis film already revealed his sensitive instinct for threatening\nscenarios. With \"Se7en\" he made one of the best thrillers of all time,\nan archetypal film for the word 'genre-defining'. So many films copied\nthe style of it in the following years until now, that this style\nultimately became nerve-racking for me in every new film. This is the\none problem I felt while re-watching it. New audiences may not even be\nable to really understand what made this movie so great when it first\ncame out. But its qualities are still visible today. The character of\nJohn Doe is a masterpiece of evil man-characterization. Kevin Spacey\nowns the screen his whole screen time, but I also like the\ncharacterizations of young hopeful cop and old cop, who has lost his\nfaith in the good of life. As I said: One of the best thrillers of all\ntime.\n"},
{"review": "\n\nDavid Fincher's breakthrough Se7en is one of few movies that deserves to be\ncalled a masterpiece. An incredibly dark movie (for mainstream that is)\nabout cruelty and human depravity that hooks it's fangs into the viewers\nspine like a bloodthirsty beast and won't let go even after the movie's\nover. This is both very wellplayed and wellcrafted. Gwyneth Paltrow, Brad\nPitt, Morgan Freeman and Kevin Spacey all do top-notch performances, the\nscript is one of the strongest in years and the ending must be on of the\nbest I've seen. It's strange that a movie that doesn't rely on shock effects\ncan be this shocking. After I saw this I was amazed by the pure cleverness\nof it all and the way I felt. The depressing mood of it all is just perfect\nand it works wonderfully as a foundation on which this movie lies. Go see it\nnow.<br><br>10/10\n"},
{"review": "\n\nthis film is one of the films which you have to see twice before\ncatching all of it and making some sense as the film gives you a lot to\nthink about, even in real life, the ethics, morals, the way of life,\netc. This film is as real as reality. I personally don't like some of\nthe remarks that people make about the film. About the justice system,\nthe police procedures and the behaviour of detectives. Apparently it\nain't perfect. BUT what is?? This film has pretty much everything you\ncould ask for in a crime/thriller genre movie. The suspense, gore,\nReality, originality but most of all logic. The way that the film\nuncovers the puzzle piece by piece. It pretty much uncovers itself very\nslowly until Doe walks in. The logic and the everyday life issues that\npeople encounter and don't even realize 'damn, where the hell do we\nlive?!...' ...in a world of greed, sloth, wrath, pride, envy, gluttony\nand lust.\n\n"},
{"review": "\n\nSeven is by now more or less a modern classic. The movie is so dark that\nI\nalmost felt depressed when I left the cinema. I disagree with another\nreviewer who calls it \"One of the most overrated \"thrillers\" of all\ntime\".\nThe only point this reviewer has is that the camerawork is great. Good\nacting, good story, great camerawork. Bottom line; If you are looking for\nsuspense you will get it here. You might even get a depression, but\nthat's\nfor free.<br><br>One of David Fincher's (director) best films. Fincher is very talented\nbut\nprobably also very depressed considering the movies he has made. Except\nfor\nPanic room (there is a turkey for you) he has made a couple of very\ninteresting and unusual movies (Fight club, The game).<br><br>Thriller rating: 8/10\nMovie rating 7/10\n"},
{"review": "\n\n\"Se7en\" is a police drama about two cops trying to find a mysterious killer\nwho is knocking off victims according to the sins they've committed.  The\nplot is intriguing, the acting is emotional, and the thrills are incredibly\ncreepy.<br><br>Though, this film wouldn't be as disturbing as some say it is.  Sure, the\nending is sad, but aside from that, it's just as 'gross' as every other\nforensic movie.  In fact, movies like \"The Bone Collector\" are more\ndisgusting than this.<br><br>And, of course, there's Fincher's excellent directing talent.  The camera\nangles are cool, the chase scenes are suspenseful, and the investigation is\nclever.  Morgan Freeman plays the grizzled old cop well, and Pitt delivers a\nmore comedic performance than a dramatic one as the young Det.\nMills.<br><br>The best part of \"Se7en\" would be Kevin Spacey's creepy role as the deadly\nkiller.  Sure, Spacey looks like your regular nice guy, but that's what\nmakes him so evil.  You hate him so much because you feel guilty for liking\nhim.<br><br>\"Se7en\" is a funny, dramatic, thrill-ride of a movie, 8.5/10.\n"},
{"review": "\n\nThis has to be, without a doubt, one of the most beautiful movies I have\nyet\nto see.<br><br>And I'm talking on it's artistic value. Not on it's less-than-delightful\nsubject matter. Every detail that went into the making of it, from the\nphotography, to the meticulous care with which the props were concocted\nis\nincredible. So many pieces, in such an intricate puzzle, that all come\ntogether to form a multi-faceted, and beautiful film.<br><br>The acting is well-done. While not amazing, I'd have to say each one of\nthe\ncharacters were perfectly formed, and played off of each other in exact\nharmony.<br><br>The storyline itself is somewhat classic in its cop-thriller genre. But\nas\nyou take a closer look, it has been magnified not only to account for the\n90's audiences bloodlust, but to step past it, making it seem grotesque\nto\never want to witness such a thing.<br><br>It doesn't hold back in showing true ugliness. Which is something that\nHollywood often neglects.\n"},
{"review": "\nA while back I thought after seeing Seven that this is a film gets in\nthe crowd of the macabre disturbing films including Texas Chainsaw\nMassacre, Clockwork Orange, Dawn of the Dead, etc. It does and then it\ndoesn't as well. It has that kind of horrific core on display of\nhumanities ills alongside the violent nature. But it is also a\nHollywood thriller, with big stars, and on that level it's just as\naffecting and successful. It's almost like a crossover film by having\nthis mystery-investigation side of the story, led by Putt and Freeman,\nwhile the investigation itself making it pretty clear its\nno-holds-barred moments. Fincher's work as a director here is absolute\nin making style serve the story.<br><br>It does this and more by making grissly images of cruelness and dark\nvibes that would make Nosferatu cringe (slightly). Story follows aging\ndetective (Freeman in one of his better roles) and new detective (Pitt\ndoes OK here, too) who hunt down a killer who is doing it in according\nto the 7 deadly sins. Nailbitting all the way to the end, even when we\nfind out the John Doe (and if your on this site, you know Kevin Spacey\nplays one of the most clever villains in recent thriller history).\nEntertaining, and with an everlasting appeal that has spawned on a\nseries of lesser films (i.e. Saw), and still holding up just as strong\nten+ years later.\n"},
{"review": "\n\nSe7en is a movie that is 100% suspense, style, and substance. The movie\nrises above a made-for-video serial-thriller, and joins Fritz Langs 'M',\nJohnathan Demme's Silence of the Lambs, and Michael Mahn's Manhunter as the\nbest in its genre.<br><br>It is downright depressing, and downbeat, without a hint of humour. It is\nalso compelling and intriguing at the same time.<br><br>The best thing about Se7en is the direction. David Fincher proves he isn't\nsome sadistic sicko, by heavily implying the murders and only showing the\naftermaths.<br><br>Freeman gives a decent performance as Sommerset, and Pitt gives his usually\nwisecracks as Mills, but Kevin Spacey steals the show in a small, but\nimportant part.   <br><br>It has no horror movie cliches, making it an intelligent movie, too, but it\nhas one scene that will make you jump right out of your\nseat.<br><br>Just when you think it is time for a chase with the killer, and the good guy\nshooting him for a pleasant, satisfying way to end the day, Fincher takes\nyou for one last turn, which will leave you feeling emotionally\ndrained.<br><br>PLOT: 8 DIRECTION: 9 SCRIPT: 9 ACTING: 8 CINEMATOGRAPHY:\n8<br><br>OVERALL: 8.5\n\n"},
{"review": "\n\nFreeman &amp; Pitt have great chemistry. Very dark atmosphere in this film. Kevin\nSpacey is creepy in a small role. Paltrow fits in nicely.<br><br>Rating:****1/2 (out of five) \n"},
{"review": "\nThere was tension throughout the entire movie and in significant doses\nand the mood was set just right. Great acting, too. The juxtaposition\nof personalities and life philosophies between Freeman and Pitt were\ngreat with Freeman showing a jaded, wise, and cynical character and\nPitt showing a more rash dreamer.<br><br>Most significantly, I feel the tone and underlying themes were\nincredible. An insane killer turns out to be incredibly smart and\nmanipulative and ironically the most rational one (in his twisted way)\nin the end, while Pitt allows himself to be manipulated into becoming\nWrath.<br><br>I feel Spacey was great and logical in his twisted way. I feel he\npretty much had the cunning and wit of Joker (Dark Knight) and the\ntwisted modus operandi and philosophy of the killers in the Saw series.<br><br>At first, I felt the pacing in the beginning and sudden thrust into the\naction was too fast, but by the end, I felt that this was a good move,\nas it helped keep a swift and ugly pace and tension.<br><br>The ending was also ingenious. Clever on the part of the writer, I feel\nit wraps up nicely.<br><br>Finally, I will definitely remember the last lines of the movie: Ernest\nHemingway once wrote, \"'The world is a fine place and worth fighting\nfor.' I agree with the second part.\"\n"},
{"review": "\nNow don't get me wrong and don't know any sick nut jobs like john doe\nis supposed to be but however - the film really just tries to prove how\ncunning and self righteous spaceys character is rather than how sick\nand scary which he would have to of been to do those things. The actual\nexplanations of what john doe has done by the investigators (at any\npoint in the film) or the written account of john doe's random thoughts\nin the book that detective sommerset read aloud were more disturbing\nthan spaceys performance at the end of the film.<br><br>Morgan freeman plays a reasonably believable part - brad pitt is pretty\ncliché but he isn't an absolutely pivotal character so it doesn't bring\nthe movie down too far but spacy is a real disappointment his part was\npivotal - the film is building him up the whole movie as you don't get\nto see him until near the end and if he would of pulled it off the rest\nof the movie which was a bit slow would of been worth it.<br><br>Yeah the whole idea of seven deadly sins was pretty much Hollywood\nschmaltz but again that wasn't massively jarring to the entertain value\nof the movie and could of been better overlooked if spacey made that\nidea his own. If he had seemed totally detached from reality and didn't\nexplain half as much as he did to the mills character in the car; maybe\neven played the 'seven sins idea' as a bit of a wind up to see if\npeople would swallow it - had he seemed more obscure and/or incoherent\nat times and mixed it up with some head games and cognitive exchanges\nit might of been more worthwhile.<br><br>Bottom line i didn't believe he did those murders he seemed too sane\nand plain. An unveiling of a monster it was not - and the line 'He\nisn't the devil....he's just a man' - didn't excuse the performance\n"},
{"review": "\nI was totally taken with this film. It's not The Usual Suspects, but it\nis really something. Unfortunately, I felt almost sick when I was\nfinished watching it. The madness of the murders and the general\nphilosophical sickness that carries it along put it out of reach for\nsome of us. I can't imagine the world portrayed here. Great cast. I\nreally thing Brad Pitt is excellent; and, of course, Morgan Freeman is\nhis usual complex self. Once again, however, in a relatively brief\nappearance, Kevin Spacey steals every scene he's in. It's that\nunflappable delivery of his. No matter what is said or done, he\nanticipates it. The murders are hideous. The camera doesn't show the\nmost gory details (which I appreciated), but they are sold to us\nthrough outside factors. I missed this the first time through and\nwanted it to be part of my movie-going experience. I don't think I\ncould ever watch it again.\n"},
{"review": "\nThis movie is such a 'blockbuster' that it is only movie I have ever\npurchased on DVD. I do not purchase movies because they are a waste of\nmoney to me, because I don't like to watch most movies more than once,\nand because it is so easy to download movies to ones PC from different\nwebsites for little money. But I purchased Se7en because this is the\none movie I can watch over again. Me purchasing a movie is the highest\nassessment I can give. So watch Se7en for yourself; it is suspenseful,\na thriller, has a great cast of actors who all perform outstandingly,\nand most important of all an ending no one could have guessed. I just\nwish that other writers, directors, etc., could produce more movies of\nthis quality and genre.\n"},
{"review": "\nTwo cops chase a killer who uses the Seven Deadly Sins as a motive.<br><br>Saw has a very similar story,but Seven has a *much* better\nexecution.The plot may sound sleazy and cliché,but Andrew Kevin\nWalker's dark take on the materials is not:The core of John's plan is\nvery clever and Gothic,and you will become absorbed into the twists and\nplot advancements.The murders are not only graphic,but highly inventive\nas well,in a sick way,and very sadistic.The acting is top notch:I am a\nfan of Morgan Freeman and he doesn't disappoint.Both him and co star\nBrad Pitt do excellent and focused jobs.Kevin Spacy is also excellent\nhere.Director David Fincher and cinematographer Darius Khondji does an\nAMAZING job at bringing the dark script to life:The movie is bathed in\ndarkness.There are some very well set up shots and the pacing is\nconsistent.Fincher gets the best from his actors,and never feels the\nneed to censor himself.The lead up to the conclusion is excellent,one\nof the most suspenseful scenes in movie history,extremely nerve\nwreaking.The end twist is just grotesque,yet the film ends on a subtle\nnote.<br><br>Highly recommend to those who can stomach it.<br><br>9/10\n"},
{"review": "\nSe7en is an undoubtful masterpiece concerning suspense, locations and\ncamera. The actors are also brilliant and the story is one of the most\nthrilling and intelligent of our time. Really great: none of the\nkillings are shown and are left to the mind of the viewer. So, why\nshould someone like me who has just written so nicely about this movie\nrate it with just se7en stars? It is because of its ending.\nSurprisingly indeed, but... I think, a little too surprising. In the\nending this movie seems to lack in logic. The characters Pitt and\nFreeman are playing make some progress in the story and they get to\nknow each other better and better. Freeman's role is the one of a very\nintelligent cop who often has to calm down the hot-headed character\nPitt is playing. But in the last minutes of the movie - I cannot\nimagine why - he doesn't calm him down and absolutely underestimates\nthe danger. It seems to me that this movie just wanted to have a\nsurprising, shocking ending (it really doesn't need to have!!!) and\nspoiled it a little bit to me. But anyway, this is a brilliant movie\neveryone should have watched. Once again, se7en out of ten!\n"},
{"review": "\n\nMorbidly intriguing, disgustingly fascinating.  I was deeply shaken by what\nI would call \"my favourite film\".<br><br>Forget Brad Pitt, I found Morgan Freeman's acting amazing.  He is calm cool\nand collected throughout the whole film.  A complete stoic.<br><br>Some good jazz tunes are part of the soundtrack and the film has\nstyle.<br><br>Watch carefully, the \"lust\" scene.  I didn't understand what had\nspecifically happened, the first time that I saw it.<br><br>I would like to compare the film with the psychological personality\ninventory called the Enneagram.  \"Ennea\" is Armenian for 9ine and I guess\ngram means...chart?  It is based on 9ine different personalities which,\naccording to some sources corresponds to the se7en deadly sins + 2wo\nmore.<br><br>1ne = wrath<br><br>2wo = pride<br><br>thr3e = deceit<br><br>4our = envy<br><br>fi5e = greed<br><br>6ix = fear<br><br>se7en = gluttony<br><br>ei8ht = lust<br><br>9ine = sloth<br><br>There is a theory about the enneagram (which I don't agree with) that\nstates\nthat a person will transform from 1ne personality to another in a\nparticular\norder to become more psychologically healthy as a \"whole\" person.  The\norder\nis this:<br><br>se7en: becomes fi5e<br><br>fi5e: becomes ei8ht<br><br>ei8ht: becomes 2wo<br><br>2wo: becomes 4our<br><br>4our: becomes 1ne who becomes se7en to complete the cycle<br><br>This is the same order that the \"sins\" are mentioned throughout the film.\nIt's basically the same order as above.<br><br>se7en gluttony is mentioned first<br><br>fi5e greed is mentioned second<br><br>ei8ht lust is mentioned.  9ine sloth is mentioned, which is next door to\nei8ht and breaks the cycle in half<br><br>2wo pride is mentioned<br><br>4our envy is mentioned<br><br>1ne wrath is mentioned.<br><br>In both cases The order is 7-5-8-2-4-1.  I was obsessed\nby this fact in 1995 when the film came out because I was studying the\nenneagram at the time.  Obviously, someone needed a life\n:)\n"},
{"review": "\nThroughout history the Bible and its wisdom have been used as an excuse\nfor murder. The director in \"Seven\" cleverly makes use the seven sins\nas Kevin Spacey's Divine permission to commit the biggest biblical sin\nof them all; murder! While Spacey is sacrificing his victims in the\nname of religion and punishing them in graphical behavior for their\nweaknesses; Morgan Freeman and Brad Pitt appear as the prophets\ndefending and protecting all that is good by trying to catch him. The\ndirector David Fincher keeps you on the edge of your seat as you watch\neach brutal murder appear across the screen and as you watch Freeman\nand Pitt getting closer to their killer. Freeman always appears the\nwiser while Pitt gets more and more engulfed with rage as the killer\ntaunts his pursuers while punishing his victims. We the viewers, are\nfilled with anger and wrath (one of the sins themselves), as we want\nthe killer to be caught but we realize at the end that he wants more\nthan that! At the end the shocking revelation takes over our minds and\nfills us with even greater anger as we want Spacey punished! We also\nwant him dead for his last brutal act! We also want Pitt to kill him!\nThe question to be asked, is the unborn child saved from been born in a\nworld full of religious contradiction or should those who wrong us be\npunished without question?\n"},
{"review": "\nThis movie has a good plot and strong acting performances from almost\nall the actors, good screenplay and direction. The only thing it lacks\nis a plausible story. The one thing which bothers me is the reason\nbehind the killer's (John Doe)actions. He starts off by killing an\nobese man because he is gluttonous. Obesity is not caused just by being\ngluttonous. Second is greed. Yes, lawyers are greedy but that is their\nprofession. In fact, in this very movie, John Doe also gets a lawyer\nwho supports him also knowing that he is a serial killer. Is that not a\nsin? Next is sloth. What does a drug dealer got to do with being lazy?\nBehind his every murder, the reason is pretty silly. And the most\nimportant thing which really bothers me is John Doe killing Mills'\nwifey. Mills' wife does not commit any sin that catches his eye and yet\nhe kills her just to unleash Mills' wrath on him. This makes John Doe\nthe biggest sinner of all. I liked zodiac which is more reasonable than\nthis movie. This movie is just average with a terrible music.\n"},
{"review": "\nHello! 'Seven' was watched post listening to numerous positive\nrecommendations. But, upon watching it, I realized that this is a movie\nwhich is highly overrated but seem to be not up to expectation. Brad\nPitt and Morgan Freeman played their part genuinely though the\nintensity of the serial crime happened in the movie was not catchy and\ninfluential. I take this movie is far away from reality! At times the\nmovie seemed to be boring and may cause eye lids to fall down. I never\nwatched a crime story with least thrilling vibe'. The justification\nseen behind each murders sounded childish. I don;t suggest you to watch\nthis movie rather can be used a sleeping pills!\n"},
{"review": "\nSe7en is not a bad movie but it's a big let down except the performance\nof Kevin Spacey and that ending there's nothing more good about it. The\njokes that the characters try to throw in some of the scenes are just\nawful and for sure not funny Brad Pitt and Morgan Freeman can't save\nthe film that David Fincher (Alien3) directed the cast is good the\nacting is meh except Spacey and the ending is a huge WTF that shows\nthat the Bad guys can truly win other than that Se7en is a 2 hour film\nthat is boring to the bone if you want to see a great serial killer\nfilm go watch Zodiac that is one hell of a film. Final Verdict 5 out of\n10 nothing more nothing less.\n"},
{"review": "\nWhat is the fuss about this film? Yes it has good acting (at times),\natmospheric scenes and well done dead bodies. But I would not\nunderstand someone wanting to view this more than once.<br><br>Basically it is a mystery story of a generic serial killer that\neventually owes up to his killings (well that was easy mystery to\nsolve) then kills the wife of a detective who shoots and kills him in\nanger. Am I missing something? Morgan retires, serial killer dead, Brad\nlives on depressed without a wife. OK.<br><br>The serial killer, killed people he thought were disgusting so he\nthought in his mind he was doing a good thing (yeah that is just like\nany serial killer, not original) then he ended up dying and the\ndetective lost his wife who was pregnant. BIG WOOP.<br><br>Yeah its well told story but I just don't see it being so clever that\nit is a best movie of all time and certainly doesn't warrant any more\nviewings in my eyes.<br><br>I don't know I just didn't find myself caring much for Brad Pitts\ncharacter or his wife. So I didn't really care at the end when you find\nout she was killed.<br><br>It felt out of place when they randomly started laughing round the\ndinner table, I was looking around thinking \"Really?\" why are they\nlaughing hysterically?<br><br>Cringeworthy stuff in the cafe when the wife tells morgan she is\npregnant, morgan says \"I got to go\" she says \"Morgan...................\nthankyou\" AHHH thankyou, I just rolled my eyes seriously. (forgotten\nFreemans character name sorry)<br><br>Overrated actually boring/predictable.<br><br>Off the top of my head I mean this isn't even my favourite film I have\njust watched it recently is all, something like \"Shutter Island\" leaves\nyou thinking and is just overall a better film hands down in my\nopinion. This film you get to the end, bored thinking OK. Fight Club\nanother GOOD film with twists, clever and real top film. Se7en not in\nmy eyes.\n"},
{"review": "\nI liked this movie from the moment it started. To me, mixing religion\nwith anything makes 'anything' infinitely more creepy - and this film\nstarted out just that way.<br><br>I loved the premise of the movie and how each new crime is set up for\nthe viewer. Also that the movie is set up in a world where each day\nseems grayer than the previous - and each crime more gruesome - it\nreally does a great job of grabbing your attention from the first\nscene.<br><br>Morgan Freeman does an excellent job of a weathered, yet wise,\ndetective - and then there is the Brad Pitt element. Ms. Paltrow does\nfine work in this movie. And then there is Brad Pitt...<br><br>I want to like Brad Pitt. Maybe it's just that I haven't seen the movie\nyet where he does a great job and doesn't seem like he's trying to act\n'too hard'. I have a hard time believing his character in this movie\n(or any movie he's in for that matter). But, the other actors and the\nscript for this movie do a great job of carrying him along.<br><br>Then there is the 'end' of the movie. I'm still annoyed by how this\nmovie ended. The last scene seems to be in direct contrast with the\nimagination, set up, reveal, shock and get-you-by-the-short-hairs\nscript used in the previous 80 minutes of this movie.<br><br>So...my 7 out of 10 basically means, for this movie - if it comes on -\nI will most likely get sucked into watching it again. And then when all\nthe great scenes are over with and I've become weary of one person's\nacting - I will find that the last 10 minutes are a good point to\nrealize, \"I've been sitting down watching enough TV today - time to go\nget something done. Like popcorn.\"\n"},
{"review": "\nI would like to first start by saying the acting and plot flow are\nincredible. There's no forced jig-saw puzzling trying to fit the\noverall plot of the movie.<br><br>I liked it, in spite of my screwed-up taste for movie these days (as I\nconsider myself very young). <br><br>This film has respectable built-up tension and succeeds creating a very\ngloomy atmosphere throughout the film.<br><br>Lines relating to the 'Se7en' is remarkable. They make you think, about\nthis world we are living in, about things happening in this world and\nwe are also maybe too 'arrogant' enough to ignore and just go on living\nour own lives.<br><br>For those who point out the finale was delivered in a poor way, maybe\nit was to point out the indifferent world we are living in.\n"},
{"review": "\nDavid Fincher of Se7en, The Game, Fight Club and recently the Curious\nCase of BB! What could you need more to get you into watching Seven if\nyou haven't yet?! Ah, let me guess, probably you'd need Brad Pitt and\nMorgan Freeman. What else, let me see, hmmm what about the great Kevin\nSpacey (come on Spacey of Americna Beauty, L.A. Confidential, Usual\nSuspect, 21 and his first and best Seven). Now, add to all that 7 sins\nwhich means 7 murders and not only that you need to guess what are the\n7 sins because many people have watched it, loved it, praised it but\nwhen I asked them who was the 7th victim, they simply didn't know the\nanswer. Count the people murdered in the movie once more and you will\nknow what I am talking about. This movie is, simply and in one word,\njust amazing.\n"},
{"review": "\nTwo detectives, retiring veteran Morgan Freeman (as William Somerset)\nand hotshot rookie Brad Pitt (as David Mills), team up to trail a\nserial killer chalking up victims as an homage to the \"Seven Deadly\nSins\" - \"Gluttony\", \"Greed\", \"Sloth\", \"Lust\", \"Pride\", \"Envy\", and\n\"Wrath\". Don't read anything more about this film; I didn't, and still\nhad it figured out during the final road trip. That it's fairly\npredictable, and presents two \"stock\" characters, doesn't mean \"Seven\"\n(\"SE7EN\" if you use all caps) is a bad trip.<br><br>In fact, it's an excellent film, with a stylish look created by\ndirector David Fincher and cinematographer Darius Khondji, from writer\nAndrew Kevin Walker's intriguing story. Strangely, only film editor\nRichard Francis-Bruce was nominated for an \"Academy Award\". And, there\nwere no acting \"Oscars\". Hopefully, Mr. Freeman just missed getting\nnominated for \"Best Actor\"; he certainly deserved to be, for his\nsharply focused take on the character type also happens to precisely\nreflect the mood of the piece.<br><br>******** Seven (9/22/95) David Fincher ~ Morgan Freeman, Brad Pitt,\nKevin Spacey, Gwyneth Paltrow\n"},
{"review": "\nThis movie is not for those offended by strong language and chilling\nviolence. But it most definitely is for fans of fine acting. Brad Pitt,\nMorgan Freeman and Gwynneth Paltrow are superb, as is the surprise\nappearance of the serial killer in the story -- I won't name him and\nspoil anything for he is not identified until the final credits even\nthough you will recognize him immediately once you finally see him\ntowards the end of the film. The cinematography is excellent,\nheightening the suspense all through the film. The musical score again\nfits perfectly, my only complaint being sometimes it's loud enough to\nmuffle dialog you really want to hear clearly. Other than that, a fine\n-- if blood-curdling -- film.\n"},
{"review": "\nWatched a movie after a long time and what a choice for a comeback .\nSe7en is a shocking, disturbing, cold, sinful thriller which takes hold\nof the audience for the entire length of the movie. The story is about\ntwo police cops, one about to retire and one a very young new entry\nplayed by Freeman and Pitt respectively. Just before Detective Somerset\n(Freeman) is about to retire, a strange case of murder comes into\npicture which introduces the police department to a cold-blooded,\npatient and deranged serial killer who kills people one after the other\non the basis of seven deadly sins mentioned by religion which are\nsubjected to death of the sinner. Thus the serial killer aims at\nkilling 7 people, one for each sin respectively. Detectives Somerset\nand Mills (Pitt) are given this case and they both try their different\nmethods to uncover this mystery and catch the killer. A very unique\nplot, this movie is made even more thrilling by the classic direction\nof Fincher. This movie can be called a milestone in the suspense genre.<br><br>Brad Pitt as the young, restless cop Mills has done his job pretty well\n. But there are some scenes where we feel that he is overacting a bit.\nMorgan Freeman on the other hand makes us feel that this particular\nrole of Detective Somerset was written just for him. Kevin Spacey in a\nsmall role as the deranged killer is impressive and makes us feel that\nhe is truly a cold blooded psychopath . Overall, a must watch movie\nRating : 8.5/10\n"},
{"review": "\nOne of the best serial killer movies ever, and also one of the best\ndetective movies! This movie is great. David Fincher is one of the best\nmovie director's. All of his movies (with the exception of Alien3) are\ninteresting stories, and visually beautiful. This movie was made at a\ntime when Morgan Freeman, Brad Pitt, and Kevin Spacey were all amazing\nactors. Since then they've all been in a few really bad movies. If you\nhaven't yet watched this movie, go watch it NOW!!! The plot development\nis perfect. the acting, directing, and plot line were very well done. I\ndon't know what else to say about this movie that hasn't already been\nsaid countless times, but this is definitely one of my favorite movies\nof all time. One of the best movies from the 1990s. A must see!\n"},
{"review": "\nI used to watch this movie all the time when it came out but just\nwatching it today made me cry. So emotional and so original. You cant\nhelp but think; what if this was done to you? At the end when brad pitt\nbecomes wrath, morgan freeman doesn't really try to talk him out of it\nlike in all the other films where the good guy doesn't kill the bad\nguy. Just the line \"if u kill him he will win\" that line is great\nbecause its true. It is what john doe planned all along and to foil his\nplans would devistate him. When i was young i always thought i would\nkill him for sure and i guess i still would but i think it would\ndestroy john doe if pitt didn't go through with it. Or perhaps since\nbrad pitts wife and unborn baby are dead he could kill himself and that\nwould give the old FU to john doe as well. What would u do?...\n"},
{"review": "\nThis movie was by far the most powerful psychological thriller ever\nmade to date. Three of the best actors in one film giving an air of\nelectricity could hardly be achieved by any other than The Usual\nSuspects. A film where two cops try to unravel the mysteries about a\nseries of homicides, stemming from the seven deadly sins. Each\ncharacter seeping a film of evil from themselves even though they are\ndead made the public think what if a serial murderer is right. That\neach death was necessary as he saw fit, making sure that the deadly\nsins was carried out to such a degree that the outcry from this maniac\nwas heard by the public. And in turn having each person reconsider\ntheir lives and why we are here. David fincher did a brilliant job\ndirecting this film, giving us a glimpse into the horrific underworld\nof the deadly sins, in the cracks of the streets or sidewalks and where\nthe stragglers walk the alley ways, and even capturing the stink of the\nscene where the public cringes their noses watching. Brad Pitt, Morgan\nfreeman, and Kevin spacey was magnificent together. Making the end\nscene the most powerful ever created, and along with the end scene the\nmusic that gave the film its most impactive climax to date. Wonderful\nmovie.\n"},
{"review": "\nThis generally is a superb movie. I didn't really expect much of this\nmovie, but i adore mystery/thriller movies and well this is epic. I'm\nnot going to bore you with the plot because you probably read it above\nbut i will tell you why it is absolutely a great deserving much higher\non the IMDb top 250 list than a measly 34/35.<br><br>It is a very eary thriller which is always sending a shiver down your\nspine because of the constant atrocious weather and dark, empty rooms.\nEvery part of the killers sadistic nature is captured exquisitely\nduring the investigations and i'm glad that lots of clues are found\nthat link to the killers identity whereas in some movies they just get\none clue and they know where to go next which bores me. This had so\nmuch more depth and each clue and piece of evidence links perfectly\ninto what the killer is going to do next.<br><br>I thought Brad Pitt was going to be terrible and i would get to slate\ndown his emotionless acting, yet he was terrific. A great loving sense\nfor his wife and kids and also becomes more likable as his character\n(Detective Mills) and Morgan Freeman's character (Detective Somerset)\nbecome more like partners rather than just cops. Obviously Morgan\nFreeman played the part amazingly and you always feel he has a great\nsense of knowledge and wisdom which is what i expected.<br><br>Each scene is well thought out and works well with the story so credit\nto the writer and some terrific music helped emphasise the tension of\neach scene.<br><br>So all in all a spectacular movie which case shall remain off my shelf\nand in my player for time to come. 10/10\n"},
{"review": "\nThe most absurd objection against Seven that I have ever read is the\none claiming that Spacey's too nice guy persona was not credible as a\nfierce murderer.Well,this may be so for someone whose first Spacey\nmovies were K-PAX or Pay It Forward or The Shipping News ;but I first\nsaw Spacey in the astonishing noir pastiche L.A. Confidential and then\nin the drama The Big Kahuna .We are talking about the actor from L.A.\nConfidential (1997), Glengarry Glen Ross (1992), The Usual Suspects\n(1995),etc.,that is,an endless gallery of villains.And not only a\ncompetent bad guy,but an authentic tough guy also\u0097a violent tough\nguy.The opposite of a dolt or a sissy;very tough,very strong,one of the\ntoughest guys on screen.His only convincing and interesting role as a\ngood-natured character is the one in K-Pax.<br><br>In my opinion,Spacey's best roles known to me are those from American\nBeauty, L.A. Confidential, The Usual Suspects, Se7en, The Big Kahuna\nand K-PAX.\n"},
{"review": "\nI love \"Se7en\". It's captivating, horrifically repulsive, thought\nprovoking, and violently thrilling. Fincher's style creates a\nforeboding and appealing atmosphere that makes you HAVE to look, even\nif mounting tension and repulsion would compel you to do otherwise.\nFincher shows you some very disturbing, bloody things in this film, but\nhe pulls back and uses implication rather than illustration at the\nperfect times. The climax is incredible in its ability to effect you,\nforcing you to be introspective about what you would do in the\ncharacter at center stage's position. Few films have engaged me\nemotionally and mentally in such a way.\n"},
{"review": "\nHave you ever came out of a theater and thought, \"Man that movie was a\ncomplete piece of sh**. It had a terrible plot, no excitement, and a\nunder satisfying ending.\" Well this movie will give you a complete\nopposite reaction. First off it is brilliant how the murderer in the\nfilm kills people. He works by referring to the 7 deadly sins. Second\noff, even at points of the film when things happen and you think that\nyou might know how this movie will end, you are completely blown off\nyour feet. I was so shocked about how this thriller ended, I couldn't\nhelp but spoil the ending to many off my friends. Even the acting in\nthis film was terrific, specially by Brad Pitt. I hardly like any of\nthe other films that Brad Pitt has been in, but this role was terrific.\nIf there is one movie that you have not seen and want to pick up the\nnext time you go to the rental store, i suggest se7en. *Caution get\nready to pee your pants from the ending*<br><br>I just became the living definition of what is wrong with user ratings.\n"},
{"review": "\nI thought this movie was very suspenseful. It's about two detectives,\nFreeman and Pitt,who are trying to solve serial mysteries. The victims\nwere innocent people who were being killed because the crazy \"john Doe\"\ncondemned to death because they had committed a sin. The title to the\nmovie se7en are for the seven deadly sins; gluttony, pride, wrath,\nenvy,greed, sloth, and lust. \"John Doe\" whom the detectives can't find\nany type of finger prints to kills each person and leaves clues for the\nnext killing. Freeman portrays a great detective in this movie, it was\nlike he was meant to be a detective, like in Along Came a Spider. I was\nvery intrigued when he stated \"there are seven deadly sins etc.......\"\nAt first i was like wow!! How does he know this ? Then he teaches Pitt\nwhat he should be looking forward to.Pitt goes and gets books and cliff\nnotes on the stories.<br><br>The movie is set in New York, some of the places the detectives visit\nis dark and gloomy. The are some scenes where you see the inexperience\ndetective Pitt, almost gags and/or cover his nose, which Freeman an\nexperienced Detective don't.The movie has a twisted ending which is a\nmouth dropper. I would advise anyone to see this movie, especially if\nyou love a suspenseful, crime, gory movie.\n"},
{"review": "\nWhen I first saw Se7en, I thought it was reasonable. Then, reading the\nendless comments on IMDb that held it up as some sort of masterpiece, I\nbecame frustrated with people thinking that just because it is a well\nput together serial killer film, it is a masterpiece. Yet of late, I\nhave realised, that Se7en is not a serial killer film. Not just that,\nanyway.<br><br>Se7en is an idea, a statement (if you're as pessimistic as that) about\nthe world we live in. There is not a single moment in this film that\ndoes not scream \"The world is a horrible place.\" Personally I don't\nagree that that is true, but that doesn't make the notion of the film\nany less masterful. So, it is since I have realised that Se7en is not\nabout a killer, but a horrible notion, that yes, it is a masterpiece.\nWhether you enjoy it or not, is a different story. But if you have not\nyet seen it, whilst you're watching it - consider Somerset's (Morgan\nFreeman) point of view, and consider how the film expresses it.<br><br>There are some brilliant dark films out there - but I consider Se7en to\nbe the darkest (and one of the best) of them all - hence the title of\nthis review, The Prince of Darkness.\n"},
{"review": "\n\nSe7en is your run of the mill detective thriller with a razor sharp and\nbloody edge, though it is not only the gore that sets this movie apart.\nWith an incredible cast (Morgan Freeman, Brad Pit, Kevin Spacey, Gweneth\nPaltrow, and R. Lee Emery), a sometimes overly slick but competent\ndirector\n(David Fincher of Fight Club fame), and a smart script by Andrew Kevin\nWalker (8mm) this movie was a much needed shot in the arm for the\ngenre.<br><br>We open on Dectective Somerset (Morgan Freeman) at the scene of a violent\ncrime, this pretty much sets the tone.  Dectective Mills (Brad Pitt)\nenters\nand we learn that Somerset is retiring and Mills is his replacement.  This\nis there \"transition\" period and Mills last week on the job.<br><br>These first few short scences are followed by one of the best opening\ncredit\nsequeces ever made.<br><br>At the scene of another horribly gruesome crime we come across a man who\nhas\naparently eaten to death.  When another, equally heinous, crime is linked\nto\nthe first we realize that there maybe a serial killer on the prowl.  The\nRace is on.  Can John Doe (Kevin Spacey), our friendly nieghborhood\npsychopath, be stopped before he kills one person for every deadly sin (of\nwhich there are 'Se7en'), will Somerset get is man before he is out to\npasture, and is there something more to these killings than at first\nglance.<br><br>I strongly recomend this movie, but only to the not so sqeamish.  With a\ndark gritty atmosphere and filthy city as the backdrop to the\nunconscionable\nactions of mad man, you should not be let down.  This is a highly\nentertianing film with more than one layer.  If you have not seen it you\nare\nmissing out.     \n"},
{"review": "\n\nPOSSIBLE MINOR SPOILERS\nThis is one of the most beautiful films i have ever seen, though it is not\nbeauty in the traditional sense. It is a dark, bleak portrait of suffering\nand pain, in a dank, depressing city. Every frame is filled with either\ndespair, or twisted horror. There's a strong Gothic element to the\nstoryline, (which involves the deliciously nasty punishments of several\nsinners), that you will either embrace wholeheartedly, or reject outright.\nBrad Pitt and Morgan Freeman both turn in convincing, powerful performances,\nwith the former proving that he's much more than just a pretty face. This\nfilm sucks you into it's uniquely dirty world, only relinquishing it's tight\nhold in a finale that you'll never, ever forget...no matter how much you\nmight want to. For the willing victim, this will be one of the best\nthrillers you'll ever see.\n"},
{"review": "\n\nI'm very fond of David Fincher's movies (favorite: Fight Club),and finally\nhad a chance to see \"Se7en\". It had all the Fincher elements I like , the\ntone of color, the density.... The plot is generally fine, but the ending\nwas just too much for me. It left me really sick. I know the ending is\nwhere\nthe climax is supposed to be, and it did strike me hard, but I just can't\nhave a nice feeling for this movie.<br><br>Usually I'm not very much disturbed by shocking endings(survived\nHannibal!),\nso I don't really know why this particular movie made me feel bad. Anyway,\nyou are warned. \n"},
{"review": "\n\nMorgan Freeman is everything a man can be - full of wisdom,<br><br>about to retire and contemplate his life, etc.  Brad Pitt is everything<br><br>a man wants to become - new to the force, full of hopes, dreams,<br><br>visions.  He has a wife and wants to start a family.  Kevin Spacey is<br><br>everything a man doesn't want to be, but is only understood by<br><br>those who are psychotic like him - to an outsider, Spacey's<br><br>character is true evil but to those who can sympathize with him. <br><br>Spacey is the voice for those who know not what they do.  Seven is<br><br>disturbing, not for the mild hearted, and made me jump at parts<br><br>(something that rarely happens.)\n"},
{"review": "\n\nIf you are squeamish, then beware of what you'll see in this film. Brad Pitt\nand Morgan Freeman play two detectives on the trail of a brutal serial\nkiller who punishes those who commit one of the seven deadly sins by turning\nit against them. Graphically violent, terrifically acted, and darkly\ndirected, this is a must for fans of the genre. The killer(whose identity I\nwon't give away) is extremely creepy as well. The violence isn't really\ndisturbing, but the way the film analyzes the evil and darkness of human\nnature is. One of the best thrillers ever. 3/4\n"},
{"review": "\n\nThis film was VERY VERY exciting.And it was also technical brilliant and the\nacting by Morgan Freeman(which is a great actor)has never been better but\nalso Brad Pitt is good.Even if the film are good it´s extremely Dark and I\nam not sure if I like the end because it´s one of the most dark endings I\nhave ever seen.Still the film is very well done,well acted and VERY\nexciting.4/5\n"},
{"review": "\n\nAfter seeing it a while back and thinking it was a good thriller, I saw it\nagain, maybe getting more out of it a second time. Boy was I right. Seven is\na complete masterpiece, a movie that is so tense, riveting, chilling and\ndark that it is a revelation in cinema history. Not one scene I found to be\ngratuitous, boring, or bad. Some of the scenes in it disturbed me so badly,\nI couldn't get to sleep for a couple of days, namely the knife-rape part.\nSeven is much like Fincher's recent masterpiece, Fight Club, in it's view of\nthe dark, ugly side of the world. Seven takes us there and never lets us\nback for air, and fascinates us at every thrilling minute. A landmark in\ncinema history. 10/10.\n"},
{"review": "\n\n\"There are seven deadly sins captain, gluttony, greed, sloth, wrath,\npride,\nlust and envy. Seven.\"<br><br>A killer is on the loose in the Unnamed City and they are using the seven\ndeadly sins as their MO. Two cops are assigned to investigate, Sommerset a\nworld weary cop, soon to retire, and Mills an experienced investigator,\nbut\nnew to this city and its ways. Its an old combo, but Fincher makes it\nwork,\nand work well.<br><br>Pitt in my opinion is at his best here. He portrays a very believable cop\n(at least in my experience) dedicated and not too cultured. Freeman, while\nplaying the intellectual-about-to-retire cop Sommerset, brings forth great\npresence to the movie, the calm ying to Mills raging yang (or is it the\nother way round?)<br><br>Some of the most disturbing aspects of this movie, are not those which we\nsee, but those which we are left to think about. The killer's reasoning\nbehind the murders almost makes it justified, perhaps the most disturbing\naspect of all.<br><br>The action sequences are all realistic and believable(well, as good as it\ngets in Hollywood anyway). The constant rain, the dilapidated sets, unique\ncamera angles, innovative film processing and a oppressive soundtrack make\nSe7en a complete indulgence of the senses.<br><br>As for the ending, it has to be seen to be believed.<br><br>This movie will scar, but then, isn't that what good thrillers\ndo?\n"},
{"review": "\n\nDark, evil tale of a killer using the 7 deadly sins as grounds. The cops on\nhis tail are always one step behind and get to witness the unbelievable\ncruelty that the murderer has inflicted upon his victims. No compromise:\nthis is the most evocative film to appear in recent years, and I bet the\nending had Andrew Kevin Walker bouncing up and down shouting: \"I'm the king\nof the world\" too. Fantastic.\n"},
{"review": "\n\nIts should be classified as the best thriller ever made. Its a classic.\nMorgan and Pitt where extra ordinary, they were made to be together in this\ngreat movie. Though in was not the full version of the story its still\ngreat. In the book Pitt hurt Morgan with his knife and then he was taken to\nthe court, he served a short period as far as I remember.\n"},
{"review": "\n\nFew films genuinely shock me nowadays, but this did. It is horrible yet\nfascinating, it fulfills the morbid curiosity which is in us all whether\nwe\nwant to admit it or not. There have been other films about serial killers\nbut none as desperate or dark as this masterpiece.<br><br>It is the unrelenting mental will of Spacey's character that chilled me\nthe\nmost. His utter insanity was matched only by his ingenuity and discipline.\nHis character is one of the most truly evil in film history, forget\nhannibal\nlecter !<br><br>The whole film is brilliantly made, the performances are great, even from\nBrad Pitt, and the atmosphere is wonderfully set, but there are two\nparticular things which, for me, set this movie apart.<br><br>The first is the way in which the city setting they are in is every bit as\nall consuming and intimdating as Spacey's character. People are swallowed\nup\nand spat out in this world, no one counts. It reminded me very much of an\nAlan Moore graphic novel called 'Watchmen' in which a character called\nRorschach becomes a vigilante to clean the streets of the 'scum'. Spacey's\ncharacter is somewhat like this striving to show people the evil that\nsurrounds them. The irony is that his methods are wholely more evil than\nanything he wishes to illustrate.<br><br>The second is the ending. Never has there been an ending like it to my\nknowledge. It is hard to describe how it makes you feel. There is no way\nhe\ncan lose, you feel cheated whilst still appreciating the cleverness of the\nmanufactured situation. It leaves you with nothing exactly reflecting how\nBrad Pitt's charcter must feel at this moment. The film leaves you\nbewildered and mentally fatigued.<br><br>However the perfectly handled ,and completely unique,  ending completes an\nawesome film.It is very downbeat and critical of humanity, Morgan\nfreeman's\ncharacter re inforces this in his final line, but there was a place for a\nfilm such as this and Se7en filled it.\n"},
{"review": "\n\nSeven is far superior to serial-killer cliches such as Silence of The\nLambs.\nSeven's graphic morbidness only helps exemplify the realities of the\nsituation. Great acting by Pitt, Freeman, and Spacy. The characters are\nbelievable in that they are not perfect or even-tempered;they are real.\nThe\nmovie is real. ...But if you can't handle violence, gore, reality, or\npolitical-incorrectness then stick to Mary Poppins.\n"},
{"review": "\n\nSeven is not your standard serial killer on the loose film.  It is a dark,\ngrimy, visceral thriller that chills you to the bone days, months and years\nafter you've seen it.  The crimes that John Doe perpetrates in this film\ngrow more and more atrocious as the film progresses, and we can't help but\nwatch.  It's a glimpse into ourselves.  We find these events horrible, but\nat the same time we wonder what could push someone to acts such as these?\nThat's where Brad Pitt and Morgan Freeman come in.  They provide the\nquestions that we as an audience are afraid to ask.  They doggedly pursue\nthe killer in an attempt to stop him.  The film ratchets up the tension and\nonly in the final act of the film do we meet John Doe.  Kevin Spacey is\nabsolutely chilling.  So calm, so cold and so damn intelligent.  The ending\nknocked me out.\n\n"},
{"review": "\n\nI remember watching \"Alien 3\" and not being too fond of it.  I was impressed\nwith the overall look of the movie and the darkness of it but it just didn't\nseem to fit in with the previous two movies.  I remembered the director's\nname and found myself looking out for more of his work.  I was extremely\nexcited in 1995 when I found out he had directed \"Seven\" since I thought his\ncareer had been destroyed by \"Alien 3\".  I was clearly wrong.  I saw \"Seven\"\nand walked out of the theater not knowing how I felt about the movie.  It\nstayed with me for a week so I went to see it again.  Brilliant!  Morgan\nFreeman is so amazing it's painful.  He takes a cop movie cliche (the soon\nto be retired, embittered cop) and takes it to amazing heights. He allows\nyou to understand his character completely.  A beautiful performance.<br><br>The movie is incredibly dark not only in tone but physically.  Somehow\ncinematographer Darius Khondji manages to take a desert setting in the\nmiddle of the day and make it dark, shadowy and bleak.  The dark look of the\nmovie adds to the overall feel of despair.<br><br>\"Seven\" pretty much gets your attention from the very beginning (introducing\nFreeman's character and Brad Pitt. . .who is really good) and then throws\nyou a pretty disturbed title sequence which makes you kind of twitchy and\nputs you in the proper frame of mind.<br><br>The movie starts off very graphically with the 'gluttony' killing.  If you\nmanage to make it through the scene where the body is discovered (I swear,\nyou can almost smell that apartment!) and the autopsy scene you've already\nsat through the goriest parts.  This doesn't mean that you can relax,\nthough.<br><br>A good job by all involved. We can only hope that David Fincher keeps making\nmovies this disturbing and interesting.  It seems as if he's definitely on\nto something.<br><br>\n"},
{"review": "\nThis movie is regarded as the definition of a modern thriller. It is\neasy to see why, as it is easily one of the most suspenseful movies I\nhave ever seen. What added to this suspense, was the straightforward,\nyet grim storyline, that keeps the audience interested.<br><br>The plot revolves around two detectives, William Somerset, and David\nMills, trying to solve the mystery of a serial killer. That killer,\nJohn Doe, leaves clues around for unknown reasons. Detective Somerset\nbelieves he (the killer) is following the seven deadly sins (hence the\ntitle Seven, or Se7en, and is leading them to something. What this is,\nis unclear, but they do eventually capture him, and he reveals that his\nfinal victim, is David's wife Tracy, thus showing he was playing a game\nwith them all along.<br><br>There are few movies I have seen, before or since, that are suspenseful\nas this. It is also quite bleak, which did admittedly put me off at\ntimes. It is still a great film, definitely worth a watch, if you are\nold enough (remembering this movie is rated R), and whether or not you\nenjoy it, you will probably find it interesting. From me it gets 8/10\n"},
{"review": "\nI arrived 20 years to late for the hype of this movie but that doesn't\nmake it any different. One of my favourite thrillers. They don't make\nthem like these anymore.. Realistic characters, an evil serial killer\nbut not as much emphasis on gore more storyline.<br><br>David Fincher did a class job, acting from Brad Pitt, Morgan Freeman,\nGwyneth Paltrow and Kevin Spacey was beyond outstanding.<br><br>Se7en follows detectives Somerset and Mill... Somerset is an older\nmature detective whos ready to retire whilst Mills is an energetic yet\nnot as knowledgeable, we see more of Mill' private life with his wife\nTracy.<br><br>The movie kicks off after the murder of an obese man... suspicious but\nno motive the cops are at a standstill. That is until a wealthy lawyer\ngets killed and in blood 'Greed' is written. Knowing there is a serial\nkiller on the loose its down to the detectives to hunt a man with an\nobsession with the deadly sins killing innocent people.<br><br>The ending to this movie I like a lot, I wont give it away but it shows\nhow sick and twisted minds of serial killers are.<br><br>Se7en will surely stick in your mind\n"},
{"review": "\nThis film got everything right! I mean every single casting choice,\nscene, and line was perfect! This was Brad Pitt's best role in movie, I\ndon't recall a movie where he ever achieved better acting than here.\nAlso, in my opinion, the same goes for Morgan freeman, him and Brad\nmake a great on screen team. The film was a real mind bender, which I\nlove! The dialogue was unbelievably great! The plot was so genius as\nwell. The twist ending was one of the best twist endings I've ever seen\nhands down! This movie has perfect acting, characters, plot, dialogue,\nending, and it definitely keeps your attention throughout, I wasn't\nbored once, and that's very important to me! 10/10, not a single flaw\n👍🏼\n"},
{"review": "\nI am glad I knew as little as possible about the movie before watching\nit. Seven is a meticulously crafted psychological thriller and one of\nDavid Fincher's best films! That shocking ending blew me away and\ncompletely caught me off guard. Seeing the two detectives following the\nleads and clues to catch the killer was always riveting and thrilling,\nso the whole journey to discover his real intentions was quite\ninteresting to watch. Brad Pitt and Morgan Freeman are excellent as\nalways, but Kevin Spacey is the one who steals the show as the\ningenious serial killer, who is usually one step ahead of them. David\nFincher is truly one of the greatest filmmakers of our time and I still\nhaven't been disappointed by his work so far.\n"},
{"review": "\nI've watched this true masterpiece several times over the years,I have\nyet to watch a film that comes anywhere near it in terms of pure horror\nat the lengths humans will go to inflict pain on each other... The\nbrilliance of this film is you don't see the acts been done,it's left\nto your own imagination. Brad Pitt,Morgan Freeman and Kevin Spacey are\nfantastically cast , the setting is wet and dark,( you never find out\nwhere the city is meant to be ).A Constant feeling of dread runs\nthrough this film which I can only say is an absolute must watch movie.\nIts is in my(and many others) opinion, probably one the best films ever\nmade in the history of film making .. WATCH IT!\n"},
{"review": "\nIts today's cult status this movie gained thanks to the excellent work\nof director David Fincher (whom this was only the second major movie in\nhis career) and screenwriter A.K.Walker (who also wrote the screenplay\nfor \"8MM\"). With this film Fincher ranked himself among the most wanted\ndirectors and gained a reputation of true heir of Hitchcock, which was\nconfirmed by his later movies \"Play\" and \"Panic Room\". The assignment\nof roles in the movie is excellent, and I especially need to emphasize\nBrad Pitt's acting (as in \"Fight Club\") which proved that he is not\njust a beauty figure whose main task is to lure women to cinemas, but\nalso showed that he knows to act! Freeman is excellent in the role of a\nveteran detective - like it was made for him, and Spacey in the role of\nthe killer was, as usual, brilliant and gravely. The atmosphere of the\nfilm is so dark and depressing that the bizarre and terrible murders\nmake it even more stressful. I was particularly impressed by the way\nmurders were described, which are quite original and leave a big\nimpression on the viewer. (Something like that was attempted in\n\"Resurrection\" with C.Lambert but not very successfully, and \"Saw\" -\ninteresting, but not on a par with \"Se7en\"). All in all this is an\nexcellent and original movie which is rarely seen.\n"},
{"review": "\nAs a 15 year old, I did not know what to expect from the movie. All I\nknew is that it was supposedly good and that the actors were the best\nthere are. The storyline takes the viewer on a journey along with the\ncharacters. The viewer soon begins to empathise with Brad Pitt's\nseemingly over- confident character. This is similar for Morgan\nFreeman's cool, calm and collected camera. This turns out to be\nsignificant towards the end of the movie. This movie is no murder\nmystery like any other, and perhaps not much of a murder mystery at\nall. This is due to the difficulty that the detectives have when\nattempting to solve the case. With any other actors, the movie may have\nbeen unbearable as it is often slow paced. However the acting was so\nreal and, well, brilliant that you can't take your eyes off the screen\nfor one second. All in all, the magnificent, unpredictable storyline\ncombined with brilliant acting makes this movie a must- watch for all\nfans of film.\n"},
{"review": "\nIf you will see this movie the first thing will come into your mind\nwill be\"Oh my god\". This is a tale of a serial killer and let me tell\nyou this one is quite different from other you seen. This guy (kevins.)\nis looking so intense in the movie. Though the story seems fit to the\ncharacters but the creepiness of the main idea is very unique....!! And\nlike always brad pit is looking handsome and morgen is intelligent but\nkevin is a winner in this movie. when i saw this movie last night i\nwasn't thinking that it will be so intense like its review says on IMDb\nbut just after watching it for 30 min. it gripped me in such a ways\nwhich words can not define. this is movie which you will remember for a\nlifetime and discuss with 1000 people and everyone will have the\ndifferent theory for the characters but i bet on that - everybody will\nbe agree on the idea and the intensity of the movie. A must watch if\nyou like the serial killer movie and light blood n gore but i bet the\nidea will more hit you then this. I am giving it 10/10!! Best in its\ncategory.\n"},
{"review": "\nSeven is a superb suspense thriller. The movie is binding with stellar\nperformances by all the actors. Brad Pitt in his portrayal of a\ndetective who is impatient with his partner is perfect , so is Morgan\nFreeman calm and calculated and , Kevin Spacey the serial killer who\nthinks his killings are justified .Gwyneth Paltrow also is brilliant\nplaying a wife full of hopes.<br><br>The seven deadly sins are not a monarchy to anyone , each one of us in\na way is affected and how deeply rooted they may be even in good people\nkeeps us thinking long after the movie is over. The story telling is\ngreat and so is the direction , a must watch.\n"},
{"review": "\nDavid Fincher, Morgan Freeman, Brad Pitt and Kevin Spacey: You can't go\nwrong with this team, can you? This is why Se7en is 9 out of 10 for me.\nAlmost perfect among the films categorized in the group of\nthriller/crime movies. With a very solid plot which does not allow the\nfilm to turn into a cliché about cops chasing a serial killer, Se7en\nstands out as a successful thriller. It's a good crime/mystery story\ndelivered by exceptionally good acting, very good directing and a\nflawless screenplay. While Morgan Freeman steals the show, Brad Pitt\nproves that he's a promising actor, and not just one of the most\nhandsome men in Hollywood. Needless to say, Kevin Spacey's performance\nas John Doe leads to one of the unforgettable villains on big screen.\nAll in all, it's a must-see and definitely one of the best of its kind.\n"},
{"review": "\n\nGothic, shocking, suspenseful, disturbing and clever, `Seven' marked a new\nbeginning for director David Fincher's career. This dark tale of murder and\ncrime revolves around two detectives in present New York city played by two\nbrilliant actors `Brad Pitt' and `Morgan Freeman' who are paired together to\nsolve a puzzle of murder that is at the hands of a man who kills regarding\nto the seven deadly sins. Both actors displayed striking performances that\nare so sharp and realistic sometimes you have to remind yourself that's its\nall acting.<br><br> David Fincher's masterpiece really gives us an opportunity of a lifetime,\nmaybe it's one that we don't all wish to share, but by seeing this movie you\nwill experience a glimpse of the horrors that this world is filled with, and\na small piece of mind of a man who you only prey you never have to meet.<br><br>Brad Pitt successfully proves to us that he's not just a pretty face on\nscreen, and that he sinks into his character so well, that you can walk off\nafter the film finishes classifying him as a pretty darn good actor.<br><br>You wouldn't expect anything else from Morgan Freeman because it's perfectly\nobvious that this guy was born to play the roles of the smart detective.<br><br>David Fincher's timeless directing and memorable filming captures all the\ngoods that this film has to offer and will undoubtedly leave you shocked and\nbegging for more films like this. Seven is a step into the harsh realities\nof life, a realistic portrayal of two detectives investigation into the\nun-describable horrific world murder, and the darkest realms of the human\nsoul.<br><br>We can only prey for more classic memorable work from Mr. Fincher and for\nthose future directors who are intent on making a gothic, psychological\nthriller, make sure you sit down and watch Seven with a pen and paper ready\nto take notes.\n\n"},
{"review": "\nRarely there has been a movie with such a good dark and chilling \r\natmosphere. I even see this movie more as an horror movie than as a \r\nthriller because of that.\r\n\r\n\"Se7en\" is unique in many ways. The movies mood is already set right \r\nfrom the beginning on. The movie starts dark, intense, chilling and \r\nmysterious, a mood that is present throughout the entire movie. It's \r\nvery depressing to watch and I mean that in a positive way of the \r\nmeaning of the word. The mood is set by good camera work and lighting, \r\nor better said, the lack of it. The music from acclaimed composer \r\nHoward Shore also adds to the chilling atmosphere.\r\n\r\nUnlike many other movies from the same genre, the movie is slow paced \r\nand takes it time to develop the characters without falling into some \r\nobvious cliché's. The two main characters played by Morgan Freeman and \r\nBrad Pitt are presented as an unlikely police-couple that are different \r\nin many ways from each other but in a way that is also what makes them \r\nsuch a great couple. Brad Pitt for once has the opportunity to play \r\nmore than just the pretty boy and he does it with success. Kevin Spacey \r\ntruly plays a bone chilling character, almost just as legendary and \r\nchilling as Hannibal Lecter. I would very much like to see the two of \r\nthem put in the same room, just to see who would make it out alive. \r\nFurther more it was great to see R. Lee Emrey again as the police \r\ncaptain.\r\n\r\nThe movie is filled with some truly gross, sickening and horrifying \r\nscene's, this seriously ain't no kids stuff! The movie has some of the \r\nmost sickening murders I have ever seen featured in a movie. But it \r\naren't just only the gross scene's that are good, there are also some \r\nscene's that are made with lot's of beauty and profession such as the \r\nlibrary scene.\r\n\r\nDark and chilling movie that you will never forget also thanks to the \r\nending which I will not spoil for you. A real must see.\r\n\r\n10/10\r\n\r\n\n"},
{"review": "\n\nThis movie is from start to finish a well produced and directed film.  The\nperformances in this movie are outstanding. Brad Pitt, once again, makes\nhis\nrole a stand-out performance by putting his versatile acting skills into\nhis\ninterpretation of Detective David Mills. Morgan Freeman is well-cast. His\nbrooding acting style fits the character (Detective William Somerset) like\na\nglove, and Gwyneth Paltrow gives her best performance EVER in the role of\nBrad Pitt's supportive wife/lover (Tracy Mills). And of course, Kevin\nSpacey\nwho plays the diabolical yet misunderstood serial killer.<br><br>The movie is suspenseful and in parts very exciting.  There is a\n\"Pseudo-Noir\" quality to this movie that really fits in well with the\ncontent of the film (Serial Killing). It has it's philosophical moments\nthat\nanyone who thinks a lot about the state of the world today can appreciate.\nIt makes subtle moral judgements without insulting any beliefs that the\nviewer may have and it also generates debate for any post-film\ncoffee/drinks\ngathering.<br><br>Andrew Kevin Walker (Screenplay) has taken the subject of the Seven Deadly\nSins and he really puts a great new twist on these themes.  As a writer, I\nreally could appreciate the depth that he goes into with these ideas. The\nmovie gives us just enough information to be entertained and informed yet\nnot bombarded and made bored with too much philosophy.  In this respect,\nthe\nfilm doesn't \"preach\" any special meaning even though the film's moral\nstatements are still maintained.  This film can be enjoyed on so many\nlevels\nand I really enjoyed the third act. One of the best pieces of storytelling\nand scriptwriting ever.<br><br>Outstanding performances from everyone involved (And yes, of course, David\nFincher does a wonderful job) Say no more. *****<br><br>\n"},
{"review": "\n\nDavid Fincher's bleak, relentless, and ultimately terrifying crime thriller\nSeven transcends other films of the genre with incredible plotting (the sort\nHitchcock might employ were he alive and making films in the 1990s) and\nscalding intelligence.  With only a small handful of minor flaws -- the\noverly familiar retiring cop/young cop pairing; the awful \"I'm taking you\noff the case!\" cliche seemingly required by the genre; one giant lapse in\nlogic in the downward spiral toward the conclusion that cannot be revealed\nwithout ruining the script's gruesome surprise -- Seven typically keeps its\nviewers imprisoned in their seats with a combination of morbid fascination\nand abject fear.  Despite attempts by studio executives to alter Andrew\nKevin Walker's ending, the filmmaking team prevailed and audiences\nexperienced that rare treat of mainstream cinema: an uncompromising\nvision.\n"},
{"review": "\nA stand out film dealing with a particularly unpleasant Serial Killer,\n\"Se7en\" (along with \"Silence of the Lambs\"), is something of a\nmilestone in this genre. An intelligent script, and admirable actors\nincluding the excellent Morgan Freeman, Prad Pitt, Gwenth Paltrow and\nKevin Spacey, with a cinema noir style, and very grisly murders\nrepresenting the Seven Deadly Sins. It is the performances however that\nlifts this movie above the average, Morgan Freeman as the older world\nwise detective, Pitt almost manic as his young enthusiastic sidekick,\nPoltrow plays the wife with a fine degree of sensitivity, and Spacey\ndoes his usual brilliant psycho routine. There is a pivotal scene with\nFreeman and Paltrow in a café which shows the depth of performances\nhere. They are believable characters in a dark disturbing world wherein\nit always seems to be raining. An effective thriller with tight\ndirection and atmospheric photography.\n"},
{"review": "\nDespite clichés, and a very depressing finale, this is one of the\nbest-made films of its era and genre.<br><br>The strengths of the film include an odd relationship between the two\nlead cops, who seem loosely based on the two lead cops of the \"Lethal\nWeapon\" series, but who (thankfully) never play for laughs, and never\nreally become \"buddies\" - the young cop is too arrogant, and the older\ncop has too much experience, which the young cop refuses to\nacknowledge. The two characters are also brilliantly acted by Morgan\nFreeman and Brad Pitt (probably his best performance).<br><br>There's one odd flaw in the film - about half-way through, I found that\nI had learned to \"expect the unexpected\" from the film, which meant\nthat the rest of the film was predictable in a bizarre way - simply\ndecide where the expected move would be, and then expect the unexpected\nmove instead. The most obvious instance of this is in the finale\nitself, which could be guessed at least 5 minutes ahead of time.<br><br>Normally, this would be a formula for disaster - but fortunately, the\nhigh quality of the film-making twists the film into an\nedge-of-the-seat suspenseful waiting game as we watch with horror the\none cop's encounter with the insanity of pure evil.<br><br>I didn't want to admire this film (to be honest, I dislike Brad Pitt\nsomething fierce), but I'm afraid I must - very professionally made, it\ndelivers its promised suspense all the way.\n"},
{"review": "\nAfter the Alien-debacle Fincher proved all the critics wrong. This film\nis one of the best in a genre that hasn't been very innovative for a\nlong time.<br><br>Everyone know's the story by now, so I won't waste time telling it.\nThis film was trend setting with it's dark, gritty look and opening\nsequence. We still see it copied in movies and TV-series today.\nEverything is great about this film. I guess if anything, the weakest\nlink in the film is Pitt, who is grossly overshadowed by Freeman. But\nlet's not look for flaws when there really aren't any. The script is\nintelligent and uncompromising. The direction is innovative en daring.\nThe production-design and cinematography are top-notch.<br><br>Fincher is one of the big boys in Tinseltown these days. Seven is the\nreason why.\n"},
{"review": "\nThis is one of those dark movies, where it's constantly raining and wet\nand where the light always seems to be dim. Appropriately enough, this\nchanges to bright and shimmering heat in the very end. As a kid, I\nhated dark movies. But perhaps it is appropriate in this case, because\nSeven attempts to be a statement about humanity: no one is without sin.<br><br>The seven deadly sins are gluttony, greed, sloth, pride, lust, envy,\nand wrath. Prime examples of people committing these are being punished\none by one, brutally and efficiently, by a psychopathic killer.\nDetectives, and reluctant partners, William Somerset (Morgan Freeman)\nand David Mills (Brad Pitt) are assigned to track down the killer.\nNeedless to say, the job gets accomplished. While some might argue it\nis done surprisingly, I'd argue otherwise.<br><br>For once, I wasn't impressed with Pitt's acting. I thought Freeman did\na great job. As usual, the villain, John Doe played by Kevin Spacey,\nprovides a chilling performance, even though he is not given as much\ncenter stage as, say, Anthony Hopkins was in Silence of the Lambs. In\nfact, the whole movie seems to hurry through without giving key\ncharacters enough time to build up their emotional worth, particularly\nMills' wife Tracy (Gwyneth Paltrow).<br><br>In the end, Seven does manage to get its point across effectively.\nWhile watching the movie itself, I thought it a bit anti-climatic, but\nwhen mulling it over later, the images echo very strongly in my mind.\nOne of the most disturbing films I've seen.\n"},
{"review": "\nI love psychological thrillers and this is one of the best I've seen.\nMorgan Freeman was elegant and convincing as a burnt out cop who wanted\nto retire but found the fascination of the job tough to let go of. Brad\nPitt made the transition from cocky new guy to serious cop vry\nconvincingly. And what can I say about Kevin Spacey who is always\nexcellent. (Except to wonder why his name doesn't appear in the opening\ncredits - I looked three times.) And Gwyneth Paltrow as Pitt's wife was\nas fresh and charming as ever. I truly enjoyed the performances of all\nthe main cast members.<br><br>The best part of this film is that even when the killer is caught the\nsuspense isn't over. In fact - it may be just beginning.\n"},
{"review": "\nSomerset, (Morgan Freeman) a deeply Intellectual Detective, with barely\na week left until his retirement and Mills, (Brad Pitt) the new cop in\ntown, who is a pretty weak detective, are thrown together to\ninvestigate what at first appears to be another Homicide.<br><br>After a second Victim is found, Somerset realises that this is no open\nand shut case, and requests that he is relieved, in light of his\nimpending retirement. Mills gladly takes over the case and plunges\nhimself in way over his head.<br><br>As the work of a Crimally insane genius continues, Mills grows more and\nmore erratic, and Somerset simply has to remain, to guide his young\npartner through the case, which ultimately leads to one of the finest\nclimax's in movie history.<br><br>With Wonderful Performances from both Freeman and Pitt and a really\ndark and morbid direction from David Fincher, the movie is crammed with\nsuspense, intrigue and Excitement.<br><br>My Favourite scene is John Doe (Kevin Spacey) tearing into Mills in the\ncar, driving towards the Climax, the acting is simply perfect as Pitt's\ncharacter is torn apart by the genius of the Criminally insane, and\nFreeman interjects with insightful rationality, demonstrating his\nsuperior mind. The Scene Carries such intensity, and at the same time\nencapsulates the primary characters basic elements. Most actors can't\nachieve this level of character depth, but these are three of the\nfinest actors of our time. 9/10\n"},
{"review": "\nAt first, I was a little hesitant about taking time out of my life to\nsee Seven. I mean, I am a busy person... but this film was well worth\nmy time... Perhaps the best Brad Pitt film that I have seen, this film\ninvolves two detectives (Pitt and Freeman) going after a delusional\nkiller (Kevin Spacey) who murders his victims according to the seven\ndeadly sins: gluttony, greed, lust, etc... Spacey takes pride in his\nkillings and leaves clues for the police, similar to \"Son of Sam\"\nkiller David Berkowitz when he murdered six women in New York City in\nthe 1970's (\"Summer of Sam\"= another great film)... This was an intense\nthriller that had me on the edge of my seat from start to finish...<br><br>Movies generally take a lot to keep me interested, and I am generally a\nfan of comedies and action flicks. But Seven was different.... it was a\nfantastic thriller that kept you thinking and waiting to see what\nhappens as Pitt and Freeman chase down the barbaric killer who feels\nthat he is doing \"God's deed\"... This film is a must-see!! My only\nregret is that I had did not see it until 10 years after its theatrical\nrelease... Please feel free to email me with any questions or\ncomments...\n"},
{"review": "\ni love this film, it is the ultimate thriller film, everything about\nse7en is brilliant. the cast are well picked and make the best\ncontributions, the main characters Somerset and Mills are portrayed\nperfectly through Freeman and Pitt. in my opinion this is both Pitt and\nFreeman's best film, they still have not outshines there fantastic\nperformances. Paltrow as mills wife was a good choice though there are\na few other actresses that could have played this part, though i think\nthat what paltrow brought to the role was the fragile emotional side of\nthe character, so i am pleased that she played this part so well. the\ndirector is my favourite of all time, Mr David Fincher! he is a\nfantastic director, not just for this film but for his other films like\nfight club. he gets fantastic results from his cast and crew and makes\nthe perfect film. and as i'm a budding editor myself i have to mention\nthe fantastic edit on the film, by the editor Richard Francis-Bruce, i\ndo love the edit on seven as he cut at hit points and generally did\nwell.<br><br>if you haven't watched it watch it, if you've seen it seen it again! i\ncertainly will.\n"},
{"review": "\n\nSpoilers herein.<br><br>What a great boon these DVDs are! -- where we get to view and review with\ncomments from the creators.<br><br>Sometimes the creative artist is a poor authority for the depth of their own\nart. So it is with some interest that I check if what I have seen was what\nthe director thought he put there. Often, I find them simply working on\nintuition. But the better performing artists are different. They must always\nintend -- if they do not intend a specific feel or effect then it simply is\nnot there. That's why when a DVD commentary involves an actor it is of\nparticular interest.<br><br>In this DVD, we hear Pitt, who really commits to delivering, who worries,\nwho prepares, who sublimates self in order to create an image of himself in\nyour mind. And we hear Freeman who is arrogant, demanding of you and not of\nhim, offering a here-I-am take-it-or-leave-it style of acting, which he\ncalls `intuitive.' This really explains a lot for me. It's why Freeman is a\nnegative attractor for any film I consider, and Pitt the other way\naround.<br><br>Either way, Spacey is the only one that connects with his character, and\nhe's given a relatively simple job. <br><br>I admit that this story moved well, engaging by shock and unexpected moves\nwhen I first saw it. But on repeated viewings, substantial sloppiness gets\nin the way. What remains is the very fine lighting. I think `Fight Club,'\nwas much the superior film. This one hardly rates any celebration.<br><br>\n"},
{"review": "\nThis is an outstanding movie. Morgan Freeman and Kevin Spacey are\npitch-perfect, and Brad Pitt is solid. Pitt actually had a lot to do\nwith this movie's success outside of his acting. He forced the studio\nto keep the original ending, and he forced them to shell out the money\nto get Spacey. It is fortunate that he did, as those two elements are\ncentral to the movie's greatness. Spacey played the killer so\nchillingly that it makes his message seem all the more unnerving and,\nperhaps, correct. The uncompromising ending leaves the viewer shocked\nand reeling. This movie could not have worked without it. Outside of\nthose obvious elements, another key to the film is Freeman's character.\nHis outlook on life is and how it is affected by the murders and by his\nnew partner is a key subplot the film. It brings more weight to the\npicture. Also, David Fincher's dark, dreary direction adds to the film,\nsomewhat similar to the way Ridley Scott's dark vision adds to Blade\nRunner. The constant rain is a nice touch, especially when it\nironically recedes after the killer shows up. I was never a Nine Inch\nNails fan, but their dark brand of music fits this film well, as\nevidenced in the opening credits. Overall, I think this is one of the\ngreat films of all time. Watch it if you can handle grisly images and\nif you like unnerving endings.\n"},
{"review": "\n\nI first saw this movie when I first visited America, I knew nothing about\nthis film (as it had just opened) so I paid my money and gave the film a\nchance. It simply blew me away. The ending is just unbelievable. The\nperformances are fantastic, the direction and art design are exceptional\nand\nKevin Spacey (my fave actor) popping up towards the end was the icing on\nthe\ncake. Plus every time I watch the film now it reminds me of being in\nAmerica... it's my favourite movie, for so many reasons.\n:)\n"},
{"review": "\nThe greatest thriller of all time right next to Silence of the\nLambs.David Fincher has outdone himself and it shows.The story is\nsimple.Two detectives must apprehend a twisted serial killer who\npunishes his victims for their own sins.But what they come across will\nsoon change them both forever!!!Expert story teller Fincher builds non\nstop tension which nearly explodes by the end of the movie.Morgan\nFreeman and Brad Pitt are at their best here.There is great chemistry\nbetween the two and Gwyneth Paltrow is terrific as Tracy.The end of the\nmovie is one of the most shocking experiences ever on film.The first\ntime when I saw Se7en i was shocked,horrified and just couldn't believe\nwhat just happened.THE END will shock you be sure but that is one of\nthe reasons the movie is so good.The final lines by Somerset are\nmoving:\"Ernest Hemingway once wrote that the world is a fine place\nworth fighting for...I agree with the second part\".\n"},
{"review": "\nThis is by far the finest serial killer movie of all time. The script\nis beautifully paced and original with a fantastic twist at the end.\nThe acting is superb, everyone is on the top of their game. Morgan\nFreeman shows his versatility and superb natural ability in the role of\nretiring detective Somerset, Brad Pitt gives the performance of his\ncareer as the young feisty Dectective Mills and Gwyneth Paltrow is\nfantastic as his highly sympathetic and caring character of his wife\nTracy. But of course it is Spacey who steals the show as the compelling\nchilling \"John Doe\".<br><br>His entrancingly calm and chilling performance lifts the picture above\nmany others of its genre and his pure evil glint is just as chilling\neven more so than Anthony Hopkins in \"The Silence of the Lambs\".<br><br>I believe that Se7en is far far superior to \"The Silence of the Lambs\"\nand others of its kind. It was one of the greatest films of the 90's\n(for me second only to \"The Usual Suspects\") and i feel is constantly\nunderrated by many. I am glad to see it at #36 although i feel it is\nworthy of the top 20.<br><br>This is David Fincher's finest hour as a director with his drab rainy\nsurroundings adding a superb drab atmosphere to a drab city. Andrew\nKevin Walker's script is however will be what remembered as an\nincredible story, perfectly crafted and acted out beautifully by\nSpacey, Freeman, Pitt and co.<br><br>A MUST SEE FILM FOR EVERY FAN OF GREAT 90's MOVIES, ONE OF THE DECADES\nGREATEST.\n"},
{"review": "\nDavid Fincher's best movie until date, Se7en is a dark portrayal of a\ngenius psychopath killer, brilliantly played by Kevin Spacey. He is on\ncamera for no more than last 30 minutes of the movie, but so dominant\nis his character that the entire movie seems to be cast around his\nuncanny-ness.<br><br>The hero of the movie though is neither he nor Brad Pitt nor Morgan\nFreeman \u0096 the two detectives entrusted with the task of tacking him\ndown. It is the plot and the script, extremely brilliant though very\nmurky and enticingly morbid. You see gory murders that leave trace of\nheart-rending torture, but all that it makes you do is become more\ninquisitive about the killer. The killer is the sole obsession with the\ndetectives too and the contrast between Brad Pitt's edginess and Morgan\nFreeman's poise is very well portrayed. It parallels the contrast\nbetween the killer's poise and the edginess of the action sequence.<br><br>The climax of the movie is startling, revealing and disturbing. It\ncharacterizes the essence of Se7en, a movie that stirs you and makes\nyou sit up and take note of it. Calling Se7en a psychological thriller\nis understating its significance. It is a movie that goes well beyond\nthat, making you aware of the morbid possibilities that exist in human\nmind. The movie is also remarkable for the fact the cinematic climax\ndoes not provide you any catharsis, it just sets your mind thinking \u0096\nnot in the least about what it takes to craft a script as this and to\nmake a movie as disturbingly poignant as Se7en.\n"},
{"review": "\n\nSeven is a very dark and tough thriller.  Most of the scenes are shot in\ndimly lit and wet places which add a lot to the dark mood of the film. \nAndrew Kevin Walker (8mm) wrote this somewhat brilliant screenplay in which\nBrad Pitt (12 Monkeys, Legends of the Fall) plays a young and cocky\ndetective new at the precinct who gets help from the wise old veteran about\nto retire, played by Morgan Freeman (Hard Rain, The Shawshank Redemption). \nIn their first few days together they discover a few bizzare and gory murder\nvictims which seemed to be done in a certain and planned way.  Soon Freeman\nis convinced that someone is using the seven deadly sins to kill people and\npreach a sermon.  So Pitt and Freeman are off on a man-hunt trying to find\nthis man.  Gwyneth Palthrow (Shakespeare in Love, Emma) plays Pitt's wife in\nthe film.  This is a disturbing film with several graphic post-murder\nscenes, but still a very good film.  Freeman is great as he always is.  Pitt\nwas disappointing, however, giving an average performance at best.  Kevin\nSpacey (The Usual Suspects, L.A. Confidential) is magnificent in a small,\nbut important role.  The film leads up to an incredible climax which is the\nbest part of the film and makes watching it all very worthwhile.  Highly\nrecommended.\n"},
{"review": "\nMaybe I've just seen too many movies. Maybe my expectations were too\nhigh, having seen this movie highly praised here. Maybe the story\nseemed a bit too predictable to me. Maybe I just found some of the gore\na bit over the top. Or maybe I've seen so much gore in films already\nthat I simply wasn't that impressed.<br><br>Whatever it was, this movie struck me as okay, certainly not bad, but\nnot the masterpiece others have praised it as. Interestingly, I've seen\nmost of the main characters in movies that I liked better: Kevin Spacey\nappeared in The Usual Suspects; Brad Pitt in Twelve Monkeys (although\nhe also did a fine job here); and Morgan Freeman in Driving Miss Daisy\nand The Shawshank Redemption.\n"},
{"review": "\n\"Se7en\" may be one of the greatest movies I have ever seen. The idea is\nvery original and intense. The movie is not boring for a second. You\nwill be entertained the entire time. This movie is definitely not for\nmost people, but if you like violent and thrilling movies, this is a\ndefinite see. This movie came out a long time ago, but it is up there\nas one of the best movies in the past 20 years. Kevin Spacey plays an\nastounding performance as \"John Doe\", the serial killer who uses the\nseven deadly sins as a purpose to murder. Morgan Freeman and Brad Pitt\nas well play excellent roles in this great movie. This movie is one of\nmy absolute favorites and I could watch it every week and never get\ntired of it.\n"},
{"review": "\nIncredibly gritty, very fluid, and most disturbing are all ways that\none might describe David Fincher's Seven, a film, as all of these\nreviews on here will attest to, is about a serial killer-maniac killing\npeople based on the seven deadly sins. There is little need to rehash\nthe plot here then but what makes Seven such a good film and one of the\nbest thrillers of the last few decades? 1). Two strong, key\nperformances by Brad Pitt and, in particular, Morgan Freeman as New\nYork police detectives just united as one, Pitt is coming, and the\nother is about to retire. Freeman and Pitt have some chemistry between\nthem and let's face it - Freeman is just plain good at just about any\nrole he assays. Add to this strong supporting work from Paltrow and R.\nLee Ermey and especially Kevein Spacey as the killer. Spacey's voice\nand looks sent chills down my spine each time he was on screen. 2)David\nFincher knows how to direct. This film is gross and really is selling a\nvery seedy product as something more. Fincher makes that happen with\nthe crisp dialog between Freeman and Pitt, the very low lighting\neffects throughout, the quick pacing of the film, and the depth of\ncharacterization that he allows his characters to have. 3) The story is\nwell-conceived, well-written, and just crazy enough to be believable.\nThe film has many scenes which are shocking and designed to be so -\nthey succeed. But behind all that blood and seedy atmosphere lies a\nchess game between two police detectives - each good at what he does in\na different manner - and one crazy but brilliant sociopath killer. The\njourney they take us on is one scary ride.\n"},
{"review": "\n\nThis great thriller is about a serial killer (Kevin Spacey) and his Se7en\nvictims who represent the Se7en deadly sins. Two cops (Morgan Freeman &amp;\nBrad\nPitt) have been assigned to investigate this case.<br><br>This is the best movie of the 90's, it has great thrilling moments, Morgan\nFreeman &amp; Brad Pitts performances are excellent. Se7en has one of the best\nbut shocking and surprising endings of all time. The end is something\nnobody\nwould expect, i kept rewinding over and over again to see them 3 short\nseconds where you see... (im not going to spoil the movie).<br><br>Kevin Spacey's role in this movie was a surprise for everyone, well except\nfor the people who use IMDB, it said who the killer was played\nby.<br><br>The most shocking moment for me was when you see that body on the bed and\neveryone thinks that person is dead because of the state of the body, but\nits not, that scene shocked me alot, i never forgot it and never\nwill.<br><br>Overall i gave Se7en 9/10, everyone that likes thrillers should go see\nthis\nmovie, HIGHLY RECOMMENDED.\n\n"},
{"review": "\n\nSe7en is excellent thrilling mystery that has a great cast! Brad Pitt was\nvery good and at the when he found out, his acting was superb! Morgan\nFreeman was also excellent! Kevin Spacey played John Doe flawlessly!\nGwyneth\nPaltrow was good. R. Lee Ermey was good as always! It was surprising to\nsee\nRichard Roundtree in the movie. John C. McGinley had a small part which he\ndid good for the limited time he got to perform and Richard Portnow was\ngood. The music by Howard Shore was very good. David Fincher's directing\nwas\nunique! The last part of the movie when John Doe turns himself, when he is\nin the car with Pitt and Freeman, and when they were on the desert and the\nhelicopter scenes were through the binoculars, and when Pitt and Freeman\nwere going back and forth, that entire scene is one of the greatest in\ncinematic history! This film is really horrifying and not for the\nsqueamish\nbut if you love gruesome murder mystery movies this is a great one to\nwatch!\n"},
{"review": "\n\nI thought this movie was a pretty remarkable exercise in style and an\nincredibly controlled performance by Morgan Freeman.  Most of it is kinda\ncliched \u0096 the retiring cop breaks-in a rookie (by-the-book vs. the loose\ncannon working on a hunch), the clever serial killer, the soulless city, the\nstandard noir ending where the searcher realizes that he is what he's been\nsearching for and so on.  \nThe art direction is wonderful, with a real attention to\ndetail.\nThe movie makes for riveting viewing the first time around.  I find myself\nskipping chapters though when I try to watch it again.<br><br>To make the last act measure up to the first hour of the movie, I think the\nwriting should have emphasized the idea that the wrath/envy set up was an\nexample of John Doe improvising after the detectives found his apartment. \nThe wrath/envy scene doesn't have nearly the convoluted menace of the Sloth\nor Gluttony scenes.  It's a noir thriller and Gwen is unaccounted for - the\nend seemed pretty obvious to me compared to the craziness of \"HELP ME\" in\nfingerprints.\n\n"},
{"review": "\nThis movie was just awesome.A thriller that really leaves you on the\nedge of your seat the whole time your watching. It starts morgan\nfreeman who always does a superb job, accompanied by brad pitt who\nalways did an outstanding job. And to top it all off it was directed by\nDavid Fincher who has made some great movies.<br><br>This movie is about two detectives (Freeman,Pitt) who are sent to\ninvesitage a weird string of murders. There is a murderer killing\npeople using the seven deadly sins as justification.<br><br>Overall this movie was really good. Great actors, great story line and\na lot of twists and turns to keep you interested. I really liked it.\n"},
{"review": "\nI never understood why Seven was never given the credit it truly\ndeserves. This movie has a total package. You get horror(in its purest\nform), suspense, drama and lots of action. I would rate Seven as one of\nmy favorite horror flicks. The way the film concludes with all seven\nsins being committed and the way the last two unfold is magnificent\nwriting. The sadistic style in which John Doe disposes of his victims\nhighlights the suspense aspect perfectly. I don't know if there has\nbeen a better selected cast. Brad Pitt as the rookie, cocky detective.\nMorgan Freeman(one of my personal faves) as the veteran. Best of all\nKevin Spacey as the macabre and very twisted John Doe. If you haven't\nseen this movie, rent it Tonnie.\n"},
{"review": "\nThis story takes you where it wants you to go. <br><br>The proof is that while there are some gruesome acts in this movie (you\nonly see the aftermath, no action), the most disturbing crime in the\nmovie is the least gruesome. <br><br>There are very few movies that pull-off a mix of repulsive crime and\npsychological involvement as well as this one.<br><br>The character development was done very well with while not distracting\nyou by burying you in the personal life of each character<br><br>Initially, I felt the main detective character was a little\nunbelievable a bit too methodical. As the character developed though,\nyou start to see that as a part of his personality, the element that\nlevels the playing field between him and the criminal. In the end, I\nfound him to be as diabolically analytical as the criminal.<br><br>The chess game between the main detective and the criminal was\nflawless. Had they got the criminal into custody any other way than\nthey did.. it would have ruined the movie.\n"},
{"review": "\nI went to a friends house last night and rented movies. I picked Se7en\nto rent because I've always wanted to see it since I saw David\nFincher's masterpiece, Fight Club and his well made thriller, Panic\nRoom. People have always said this movie was good so I wanted to see it\nif they were right and they were sure right. Seven is an insanely\nbrilliant film from start to finish. The performances by Morgan\nFreeman, Kevin Spacey, and especially Brad Pitt are all phenomenal in\nthis chiller. The movie was just plain out suspenseful and left my\nheart beating fast til the movie was done. The twist at the end was\nvery intense and you never knew it was coming. Totally unpredictable.\nOverall, a fantastic film and David Fincher is a pure genius when it\ncomes to smart films and Se7en deserves to be one of the greatest\nthrillers that has ever been made. I highly recommend it.<br><br>Hedeen's Outlook: 9.5/10 **** A\n"},
{"review": "\nThis movie really is a modern day classic. The film is a true suspense\nfilm that always has you at the edge of your seat from beginning to\nend. It truly is a great film for anyone to see. So I'll give it 20 out\nof 10! The scenes were shot great and very dark so it made you really\ninterested. Brad Pitt played a phenomenal part as the new detective,\nand Morgan Freeman as the old going to retire cop. they both had great\nchemistry between their characters and that really helps the film. But\nthe most greatest part in the film was the ending! You would have never\nthought that the killer would go to that extent! I will not give out\nthe ending, but believe me, you'll be be shocked!\n"},
{"review": "\nSe7en is great. Need I go on? Alright... Se7en starts off nicely making\nit look like another day at work. Well it is, but it's the beginning of\nsomething big. Not 5min into the movie and we're introduced to the\nfirst murder scene which is a obese man with his hands tied together\nunder the table and his face smashed into a pile of noodles. He's\nobviously dead. The killer in this movie picks his victims according to\nthe seven deadly sins, which if you don't know are: greed, gluttony,\nlust, pride, wrath, envy, and sloth. The killer is very original in the\nstyle he kills his victims, which are often times very gruesome.\nAlthough they don't really show any killings in here just the way they\nimplied lust was enough to turn my stomach. The movie does a great job\nwith its dark setting and bad neighborhood. Symbolic that this city\nsucks and is run down. The acting by Mordan Freeman and Brad Pitt is\nsensational, as well as Kevin Spacy's acting, whom I praise for his\nrole. Overall this is one of the best movies I've ever seen, and the\nending... oh buddy, the ending will getcha.\n"},
{"review": "\n\nDavid Fincher has become one of Hollywood's most wanted directors since this\nfilm and this is a fantastic film. Since this he hasn't done a bad film, in\nfact most are excellent. Seven is more conventional than his films the Game\nand Fight Club but it has a great script which is fantastically directed.\nThe actors of the film are of the highest calibre. Morgan Freeman, Brad\nPitt, Gwynith Paltrow and Kevin Spacey are all fantastic, Freeman and Spacey\nin particular. The film has plenty of twists and is involving while\neverything comes to a shocking and stomach churning ending. This is\ndefinitely one of the best crime thrillers ever made.<br><br>As with other Fincher movies it looks fantastic. The cinematography is\noutstanding. The score is also fantastic and the overall look and sound of\nthe film is top class. This is a modern classic, no doubt.\n*****\n"},
{"review": "\nThere is no doubt \"Seven\" is a superior film in every way, so far as\ncrime dramas/psychological dramas go, Fincher is indeed a visionary\ndirector. This film however has achieved an unrealistic and totally\nunsupportable \"aura\" of brilliance that is simply unjustified. Having\nseen it now five times, the latest last night after my son bought it\nfor my birthday, I have to declare it to be as boring and pretentious\nas the first night I saw it.<br><br>Without anything but praise for everyone's performance (Spacey,\nespecially) I still have nothing but blank indifference to every\ncharacter presented here. What in Zeus' butthole was the point of the\nfilm? Any half competent lawyer would have gotten Pitt a suspended\nsentence (justifiable homicide...temporary insanity..whatever) Who\ncares what the hell Freeman decided to do...hang around a few more\nyears, go shoot a few chickens? As for Ms Paltrow - the most boring and\none-dimensional actress yet paraded on the silver screen (though Nicole\nKidman isn't far behind)...HER fate was the highlight of the movie.<br><br>Shamelessly exploitive crap though it was, I found RESURRECTION (A\n\"Seven\" clone) way more interesting and given that starred Mr \"Wooden\"\nhimself (Christopher Lambert)....maybe I need therapy.<br><br>Quite frankly for all its social comment, upmarket direction,\ncinematography and set-design, I think \"Seven\" is a modern \"Kings New\nClothes.\" Great film....shame about the entertainment factor. ANY film\nthat feels like you've just donated four hours of your life has at its\ncore, a problem.<br><br>As for those who even MENTION this in the same breath as SILENCE OF THE\nLAMBS - you HAVE to be kidding! That sequence between Hannibal and\nStarling during their first meeting alone, blows everything this film\nhas to offer out the window.\n"},
{"review": "\nI didn't really hold out much hope for SEVEN . It's a film that's\nalmost 20 years old and one that I frequently miss usually on purpose\nwhen it's shown on television . I've always thought David Fincher was\npainfully over rated . \" Best director of his generation \" claim many\npeople which is patently untrue if you've seen a film by Danny Boyle or\nDarren Aronfsky or Ang Lee . The premise itself doesn't inspire\noptimism being a couple of mismatched police partners trying to track\ndown a serial killer who is motivated by the seven deadly sins . I\nalmost believed I was going to be watching a reworking of the Vincent\nPrice camp classic horror movie THEATRE OF BLOOD without the funny bits\nso I went in with very low expectations <br><br>What Fincher has done is construct a thriller that is dialogue driven\nwith a sense of portent dread . It'd be very easy , perhaps too easy ,\nto shock the audience with gore and startle moments . Instead the\ndirector resists this very easy temptation and put the audience in the\nshoes of detectives Somerset and Mills so this is a rare thriller where\nthe audience join up the dots when the detectives do . The film is\ngreatly helped by Morgan Freeman who was probably Hollywood's most\neffective character actor at this point but both amazingly Pitt and\nSpacey hold their own against this acting legend <br><br>In short this is a very good gloomy thriller with very dark\ncinematography and very dark subject matter . The fact that there's so\nmuch understatement to it is refreshing and nearly 20 years after it\nfirst hit the big screen it remains director David Fincher's best work\n"},
{"review": "\nThis movie is filled with ridiculous references to Catholicism. I\nremember watching it as a teenager and I completely did not notice it\nat the time. This is a sick movie (on so many levels) and I am not just\ntalking about the gore.<br><br>Gwyneth Paltrow's character wants to abort her unborn baby. She doesn't\nlike the violent city (New York) she and her husband have moved to; and\nis worried about raising their child in that city. What a good reason\nto have an abortion! Morgan Freeman's character talks her out of it.\nApparently, Morgan's character convinced his wife to have an abortion\nand \"later regretted it\".<br><br>The decision by Paltrow's character ends up being a mistake, because\nshe (and her baby) are gruesomely murdered at the end of the movie. But\nthis is only the beginning of the Catholic-related absurdity...<br><br>The killer in this movie is a crazed Catholic, who decides to\ngruesomely kill and torture seven people after reading a book by St.\nThomas Aquinas; one of the most gentle and brilliant men who ever\nlived. This includes - ironically - the unborn baby mentioned\npreviously.<br><br>This is a sick movie made by a director who - for some reason - felt\nthe need to insult the Catholic Church. He must have been schooled by\nScorsese.\n"},
{"review": "\nThrillers are either a hit or a miss. They can be awesome while many\ncan be awful. Seven is in the Very awesome category. Basing the film\naround the seven deadly sins is an concept that everyone can relate\ntoo. We have all sinned meaning we can be put ourselves in the shoes of\nthe victims ( not all victims mind you ) . When you imagine a film in\nwhich it always cloudy and overcast with rain pouring down 24/7 , you\nwould think it going to depress you . Truth is , you don't actually\nnotice the weather , but instead take huge interest on what happening\nin the homes of the city.<br><br>I'm not an huge fan of Brad Pitt but it seems that when he teams up\nwith Fincher , he always puts on an good performance. Then there's\nMorgan Freeman, which is fairness, is playing Morgan Freeman. He fun to\nwatch but you know what type of performance he going to act out. Both\nare very good but the one who steals it is Kevin Spacey. He may be in\nit for 20 minutes, but his role is extremely memorable. His character\nis well made and maybe deserves a bit more screen time . The film is\nvery well made and an joy to watch. It keeps you awake and leaves you\nto wonder about the next deadly sin. When watching it, you can clearly\nsee that Seven was an influence towards Leigh Whannell and James Wan\nand there SAW film. Everything about SEVEN was great, the concept, the\nacting, the finale. I highly recommend this film.\n"},
{"review": "\nThinking back, I do believe this was my first 18 certificate film I\nwatched at the pictures and it left a real impression. It's always been\na favourite even though for some inexplicable reason I have only seen\nit just the once.<br><br>So it was with some trepidation that I bought the 2-disc DVD on ebay\nrecently and decided to watch it the night before last. I wondered if\nknowing the dramatic outcome already would spoil the viewing pleasure\nof what goes before.....It didn't.<br><br>I wasn't wrong as a 15 year old in my assumptions that it was the best\nthriller I'd ever seen and while I've seen some great films over the\nlast 13 years I'm pleased to say that this one is right up there with\nthe best of them. It's also weird how I seemed to remember every single\ndetail from every scene, even with my notoriously dodgy memory.<br><br>I just can't fault this flawless film, Fincher was on top of his game\nhere and it's definitely my favourite of his and I am a fan of Fight\nClub\n"},
{"review": "\nIt really was. I saw this movie in a Five Below store. There were about\n10 copies of the normal version, and abut 2 of the special edition ones\nthat look like notebooks. I went on a limb and bought the special\nedition for $5. I had no idea what this movie was like nor what it was\nabout. But I am so glad I took the chance and bought it. This movie\nturned out to be a personal favorite. Morgan Freeman was excellent, not\njust because he's a great actor, but because in this movie he was\ndifferent than the \"optimistic, nature-loving\" characters he usually\nplays. In this movie he plays the close-to-retirement Detective William\nSomerset, who dislikes the world and what it has become. Brad Pitt gave\na great performance as the loud-mouthed, over-jumpy Detective David\nMills. Usually I don't like Brad Pitt and I think hes obnoxious and a\nlousy actor, but in this movie I'll make an exception. He was obnoxious\nin some ways in this movie, but it fit his character perfectly. Gwyneth\nPaltrow gave a decent performance as the stressed Tracy Mills. R. Lee\nErmey was great as the Police Captain, I always enjoy his performances\nno matter what the circumstances. Even the bad guy (Will not give the\nactor's name to prevent spoilers) was Grade A in his part. The weather\nwas rainy for most of the movie, and scenes were always lighted in\nsmall doses, meaning it was dark and gloomy for most of the film. THis\nreally set the tone. I recommend this movie to fans of crime, thriller\nmovies. 10/10\n"},
{"review": "\nDetective Lt. William Somerset (Morgan Freeman) is about to retire. He\nis teamed up with a young new detective David Mills (Brad Pitt).\nTogether they try to find a serial killer who uses the seven deadly\nsins as his M.O. Meanwhile Mills' wife Tracy (Gwyneth Paltrow) fears\nfor her husband's life and is very depressed.<br><br>Dark and depressing but just fascinating. Director David Fincher shots\nthe entire film in dim light and shoves the victims mutilated bodies in\nour face. The grimness of the tone wears you down but that's\nappropriate considering the subject matter. No humor either. It all\nleads to a truly harrowing ending. There was supposed to be a happy\nending but they (wisely) chose not to do it. Freeman and Pitt work very\nwell together and both give excellent performances. I even thought\nPaltrow (who I hate) was good! Kevin Spacey is very good too in a small\nrole.<br><br>If you have trouble with blood, gore and disturbing subject matter stay\nfar away from this movie. But if you can handle that, watch this one.\nIt's depressing and unpleasant but riveting.\n"},
{"review": "\n\"Se7en\" is unique because of the extraordinary sympathy it manages to\nfoster for its two main characters; it's unique because of its bleak,\nhopeless environment that serves as a symptom of civilization's general\ndecline. It's strengthened by its brilliant performances capturing\nmostly decent people struggling to survive in the sewer without\nbecoming tainted by it. The fictional John Doe would most likely agree\nwith all these theoretical snapshots of despair - the difference comes\nin his psychopathic desire to come up with a plan that he thinks will\nsolve it.<br><br>Few forms of popular entertainment manage to afford the villain his say\nwhilst still maintaining a sensible distance from his horrific acts.\nWhat I like best is the film's depressing contention that there isn't\nas much distinction as we think between the good guys and the bad guys.\nWe're all affected by the distasteful aspects of society, but do we\njust hope that our own positive contributions will be enough to offset\nthem - or in extreme situations, when we stare into the abyss, will the\nabyss stare back at us? <br><br>Some may well be upset that the killer's justification contains\nreasoned objections. It is really only by resorting to crime that he\nreveals himself as a madman. Rather than be outraged, though, I prefer\nto celebrate good writing that allows us to see hidden facets of an\nissue, however unpalatable the resultant consequences of such a\nviewpoint may turn out to be.\n"},
{"review": "\nWhat is the most simple way to present the Human's dark side? The\nanswer is by sins: Sins that from the Fifth Century announce Man's most\nawful deviations from God.<br><br>This movie isn't catholic yet, nor does it have an approach: it's\nimpressively dark and violently grim. From the first start, the\ncharacters are presented surrounded by a whispering, sad rain. The mood\nis also set with dampened colors and grayish tones. Nobody ever smiles\nin the film, they laugh for few seconds when united in a dinner. But\nthroughout the story, Detective Mills (Pitt) and Detective Somerset\n(Freeman) will set up on a case that is horrendous and enigmatic: a\nserial killer roams the city with the Capital Sins as basis to create\nhis assassinations. He preaches, according to Somerset. Mills isn't\naccustomed to the following Odyssey, he is yet not aware of the fatal\nobscurity of the Human Mind. Somerset is about to retire, and he knows\nwhat he deals with his job, Morgan Freeman with his tired eyes show you\neverything the character has seen among his trail.<br><br>As the play is opened; the killer behind the murders shows to be\nanalytical and intelligent and he isn't afraid of people chasing him:\nhe just introduces him to his ultimate \"work\". He plays with them. He\npresents a puzzle for them to solve as he is in total control. Kevin\nSpacey will surprise everyone with his psychotic demeanor and his empty\ngestures, showing spiritual deprivation.<br><br>\"Se7en\" is likely not for everyone. It is intended to expose the Dark,\nTwisted side of mankind, engulfed by a series of morbidly well thought\nmurders. Actings are stupendous, all variating from a negative panoply:\ndepicting Sadness, Anger, Worry superbly. Nothing is cheerful, nothing\nis lightning and warming. The movie shows you perfectly what man is all\nabout on their obscure range. It is shattering, it is demanding. But it\nis one of the most excellent experiences on nowadays cinema.\n"},
{"review": "\nThis film has many indelible moments, an amazing cast: Morgan Freeman\nas Detective Somerset is impressive and real. The Charlie Parker\nsoundtrack with the blues sung by Billie Holiday \"I Cover the\nWaterfront\" captures the dark mood and underlying violence which exists\nin the city. Being from New York, the street scenes at night are 100%\naccurate, executives, harried workers, hookers and dealers all\nintermingle in a pastiche of chaos.<br><br>We see the early scene where Freeman first meets novice detective David\nMills (well portrayed by Brad Pitt) and he asks him what NYC homicide\nis like, and won't agent Somerset regret retiring? Freeman answers\ntiredly ...\"I am moving....anyplace...far away from here\"...<br><br>Sloth, Greed, Lust, Pride, Envy, Gluttony, the seven deadly sins as\nproclaimed since Medieval era. Each murder is precisely carried out.\nJohn Doe is creating his masterpiece, an artwork of perfect murder.\nKevin Spacey is superb as John Doe. His presence and diction are\ncutting and menacing. I would love to see him in more of these roles.\nThe quote from Morgan Freeman at the end of it all resounds true: it is\nthe quote from Hemingway. The theme is \"ask not for whom the bell\ntolls, it tolls for thee\"....Everyone is affected by violence. Best\nthriller and suspense, other than Hitchcock. Kudos to David Fincher and\nthe cast The screenplay is amazing, I have bought that as well as the\nDVD. Highly recommended. 10/10.\n"},
{"review": "\nThis movie is a cross between Silence of the lambs and Bone collector.\nThere are some very clever investigation scenes and clever writing and\nset creation.<br><br>This movie was a showcase for Kevin Spacey and Morgan Freeman. This\nmovie had one of Morgan Freeman's best roles where he plays a educated,\nintelligent and experienced detective. Brad Pitt has a role but is not\nas impressive.<br><br>This movie certainly had a new approach to police / horror movies. This\nmovie and Silence of the lambs brought a whole new level of gore and\nhorror to mystery movies. This is not a kid friendly movie and does not\nhave a happy ending.\n"},
{"review": "\nThe serial killer movie is one of the (if not the one) concise genres\nof the 1990s. David Fincher started his feature film career in the 90s\nwith \"Alien 3\", a good but not great sequel to the \"Alien\"-series. But\nthis film already revealed his sensitive instinct for threatening\nscenarios. With \"Se7en\" he made one of the best thrillers of all time,\nan archetypal film for the word 'genre-defining'. So many films copied\nthe style of it in the following years until now, that this style\nultimately became nerve-racking for me in every new film. This is the\none problem I felt while re-watching it. New audiences may not even be\nable to really understand what made this movie so great when it first\ncame out. But its qualities are still visible today. The character of\nJohn Doe is a masterpiece of evil man-characterization. Kevin Spacey\nowns the screen his whole screen time, but I also like the\ncharacterizations of young hopeful cop and old cop, who has lost his\nfaith in the good of life. As I said: One of the best thrillers of all\ntime.\n"},
{"review": "\n\nDavid Fincher's breakthrough Se7en is one of few movies that deserves to be\ncalled a masterpiece. An incredibly dark movie (for mainstream that is)\nabout cruelty and human depravity that hooks it's fangs into the viewers\nspine like a bloodthirsty beast and won't let go even after the movie's\nover. This is both very wellplayed and wellcrafted. Gwyneth Paltrow, Brad\nPitt, Morgan Freeman and Kevin Spacey all do top-notch performances, the\nscript is one of the strongest in years and the ending must be on of the\nbest I've seen. It's strange that a movie that doesn't rely on shock effects\ncan be this shocking. After I saw this I was amazed by the pure cleverness\nof it all and the way I felt. The depressing mood of it all is just perfect\nand it works wonderfully as a foundation on which this movie lies. Go see it\nnow.<br><br>10/10\n"},
{"review": "\n\nthis film is one of the films which you have to see twice before\ncatching all of it and making some sense as the film gives you a lot to\nthink about, even in real life, the ethics, morals, the way of life,\netc. This film is as real as reality. I personally don't like some of\nthe remarks that people make about the film. About the justice system,\nthe police procedures and the behaviour of detectives. Apparently it\nain't perfect. BUT what is?? This film has pretty much everything you\ncould ask for in a crime/thriller genre movie. The suspense, gore,\nReality, originality but most of all logic. The way that the film\nuncovers the puzzle piece by piece. It pretty much uncovers itself very\nslowly until Doe walks in. The logic and the everyday life issues that\npeople encounter and don't even realize 'damn, where the hell do we\nlive?!...' ...in a world of greed, sloth, wrath, pride, envy, gluttony\nand lust.\n\n"},
{"review": "\n\nSeven is by now more or less a modern classic. The movie is so dark that\nI\nalmost felt depressed when I left the cinema. I disagree with another\nreviewer who calls it \"One of the most overrated \"thrillers\" of all\ntime\".\nThe only point this reviewer has is that the camerawork is great. Good\nacting, good story, great camerawork. Bottom line; If you are looking for\nsuspense you will get it here. You might even get a depression, but\nthat's\nfor free.<br><br>One of David Fincher's (director) best films. Fincher is very talented\nbut\nprobably also very depressed considering the movies he has made. Except\nfor\nPanic room (there is a turkey for you) he has made a couple of very\ninteresting and unusual movies (Fight club, The game).<br><br>Thriller rating: 8/10\nMovie rating 7/10\n"},
{"review": "\n\n\"Se7en\" is a police drama about two cops trying to find a mysterious killer\nwho is knocking off victims according to the sins they've committed.  The\nplot is intriguing, the acting is emotional, and the thrills are incredibly\ncreepy.<br><br>Though, this film wouldn't be as disturbing as some say it is.  Sure, the\nending is sad, but aside from that, it's just as 'gross' as every other\nforensic movie.  In fact, movies like \"The Bone Collector\" are more\ndisgusting than this.<br><br>And, of course, there's Fincher's excellent directing talent.  The camera\nangles are cool, the chase scenes are suspenseful, and the investigation is\nclever.  Morgan Freeman plays the grizzled old cop well, and Pitt delivers a\nmore comedic performance than a dramatic one as the young Det.\nMills.<br><br>The best part of \"Se7en\" would be Kevin Spacey's creepy role as the deadly\nkiller.  Sure, Spacey looks like your regular nice guy, but that's what\nmakes him so evil.  You hate him so much because you feel guilty for liking\nhim.<br><br>\"Se7en\" is a funny, dramatic, thrill-ride of a movie, 8.5/10.\n"},
{"review": "\n\nThis has to be, without a doubt, one of the most beautiful movies I have\nyet\nto see.<br><br>And I'm talking on it's artistic value. Not on it's less-than-delightful\nsubject matter. Every detail that went into the making of it, from the\nphotography, to the meticulous care with which the props were concocted\nis\nincredible. So many pieces, in such an intricate puzzle, that all come\ntogether to form a multi-faceted, and beautiful film.<br><br>The acting is well-done. While not amazing, I'd have to say each one of\nthe\ncharacters were perfectly formed, and played off of each other in exact\nharmony.<br><br>The storyline itself is somewhat classic in its cop-thriller genre. But\nas\nyou take a closer look, it has been magnified not only to account for the\n90's audiences bloodlust, but to step past it, making it seem grotesque\nto\never want to witness such a thing.<br><br>It doesn't hold back in showing true ugliness. Which is something that\nHollywood often neglects.\n"},
{"review": "\nA while back I thought after seeing Seven that this is a film gets in\nthe crowd of the macabre disturbing films including Texas Chainsaw\nMassacre, Clockwork Orange, Dawn of the Dead, etc. It does and then it\ndoesn't as well. It has that kind of horrific core on display of\nhumanities ills alongside the violent nature. But it is also a\nHollywood thriller, with big stars, and on that level it's just as\naffecting and successful. It's almost like a crossover film by having\nthis mystery-investigation side of the story, led by Putt and Freeman,\nwhile the investigation itself making it pretty clear its\nno-holds-barred moments. Fincher's work as a director here is absolute\nin making style serve the story.<br><br>It does this and more by making grissly images of cruelness and dark\nvibes that would make Nosferatu cringe (slightly). Story follows aging\ndetective (Freeman in one of his better roles) and new detective (Pitt\ndoes OK here, too) who hunt down a killer who is doing it in according\nto the 7 deadly sins. Nailbitting all the way to the end, even when we\nfind out the John Doe (and if your on this site, you know Kevin Spacey\nplays one of the most clever villains in recent thriller history).\nEntertaining, and with an everlasting appeal that has spawned on a\nseries of lesser films (i.e. Saw), and still holding up just as strong\nten+ years later.\n"},
{"review": "\n\nSe7en is a movie that is 100% suspense, style, and substance. The movie\nrises above a made-for-video serial-thriller, and joins Fritz Langs 'M',\nJohnathan Demme's Silence of the Lambs, and Michael Mahn's Manhunter as the\nbest in its genre.<br><br>It is downright depressing, and downbeat, without a hint of humour. It is\nalso compelling and intriguing at the same time.<br><br>The best thing about Se7en is the direction. David Fincher proves he isn't\nsome sadistic sicko, by heavily implying the murders and only showing the\naftermaths.<br><br>Freeman gives a decent performance as Sommerset, and Pitt gives his usually\nwisecracks as Mills, but Kevin Spacey steals the show in a small, but\nimportant part.   <br><br>It has no horror movie cliches, making it an intelligent movie, too, but it\nhas one scene that will make you jump right out of your\nseat.<br><br>Just when you think it is time for a chase with the killer, and the good guy\nshooting him for a pleasant, satisfying way to end the day, Fincher takes\nyou for one last turn, which will leave you feeling emotionally\ndrained.<br><br>PLOT: 8 DIRECTION: 9 SCRIPT: 9 ACTING: 8 CINEMATOGRAPHY:\n8<br><br>OVERALL: 8.5\n\n"},
{"review": "\n\nFreeman &amp; Pitt have great chemistry. Very dark atmosphere in this film. Kevin\nSpacey is creepy in a small role. Paltrow fits in nicely.<br><br>Rating:****1/2 (out of five) \n"},
{"review": "\nThere was tension throughout the entire movie and in significant doses\nand the mood was set just right. Great acting, too. The juxtaposition\nof personalities and life philosophies between Freeman and Pitt were\ngreat with Freeman showing a jaded, wise, and cynical character and\nPitt showing a more rash dreamer.<br><br>Most significantly, I feel the tone and underlying themes were\nincredible. An insane killer turns out to be incredibly smart and\nmanipulative and ironically the most rational one (in his twisted way)\nin the end, while Pitt allows himself to be manipulated into becoming\nWrath.<br><br>I feel Spacey was great and logical in his twisted way. I feel he\npretty much had the cunning and wit of Joker (Dark Knight) and the\ntwisted modus operandi and philosophy of the killers in the Saw series.<br><br>At first, I felt the pacing in the beginning and sudden thrust into the\naction was too fast, but by the end, I felt that this was a good move,\nas it helped keep a swift and ugly pace and tension.<br><br>The ending was also ingenious. Clever on the part of the writer, I feel\nit wraps up nicely.<br><br>Finally, I will definitely remember the last lines of the movie: Ernest\nHemingway once wrote, \"'The world is a fine place and worth fighting\nfor.' I agree with the second part.\"\n"},
{"review": "\nNow don't get me wrong and don't know any sick nut jobs like john doe\nis supposed to be but however - the film really just tries to prove how\ncunning and self righteous spaceys character is rather than how sick\nand scary which he would have to of been to do those things. The actual\nexplanations of what john doe has done by the investigators (at any\npoint in the film) or the written account of john doe's random thoughts\nin the book that detective sommerset read aloud were more disturbing\nthan spaceys performance at the end of the film.<br><br>Morgan freeman plays a reasonably believable part - brad pitt is pretty\ncliché but he isn't an absolutely pivotal character so it doesn't bring\nthe movie down too far but spacy is a real disappointment his part was\npivotal - the film is building him up the whole movie as you don't get\nto see him until near the end and if he would of pulled it off the rest\nof the movie which was a bit slow would of been worth it.<br><br>Yeah the whole idea of seven deadly sins was pretty much Hollywood\nschmaltz but again that wasn't massively jarring to the entertain value\nof the movie and could of been better overlooked if spacey made that\nidea his own. If he had seemed totally detached from reality and didn't\nexplain half as much as he did to the mills character in the car; maybe\neven played the 'seven sins idea' as a bit of a wind up to see if\npeople would swallow it - had he seemed more obscure and/or incoherent\nat times and mixed it up with some head games and cognitive exchanges\nit might of been more worthwhile.<br><br>Bottom line i didn't believe he did those murders he seemed too sane\nand plain. An unveiling of a monster it was not - and the line 'He\nisn't the devil....he's just a man' - didn't excuse the performance\n"},
{"review": "\nI was totally taken with this film. It's not The Usual Suspects, but it\nis really something. Unfortunately, I felt almost sick when I was\nfinished watching it. The madness of the murders and the general\nphilosophical sickness that carries it along put it out of reach for\nsome of us. I can't imagine the world portrayed here. Great cast. I\nreally thing Brad Pitt is excellent; and, of course, Morgan Freeman is\nhis usual complex self. Once again, however, in a relatively brief\nappearance, Kevin Spacey steals every scene he's in. It's that\nunflappable delivery of his. No matter what is said or done, he\nanticipates it. The murders are hideous. The camera doesn't show the\nmost gory details (which I appreciated), but they are sold to us\nthrough outside factors. I missed this the first time through and\nwanted it to be part of my movie-going experience. I don't think I\ncould ever watch it again.\n"},
{"review": "\nThis movie is such a 'blockbuster' that it is only movie I have ever\npurchased on DVD. I do not purchase movies because they are a waste of\nmoney to me, because I don't like to watch most movies more than once,\nand because it is so easy to download movies to ones PC from different\nwebsites for little money. But I purchased Se7en because this is the\none movie I can watch over again. Me purchasing a movie is the highest\nassessment I can give. So watch Se7en for yourself; it is suspenseful,\na thriller, has a great cast of actors who all perform outstandingly,\nand most important of all an ending no one could have guessed. I just\nwish that other writers, directors, etc., could produce more movies of\nthis quality and genre.\n"},
{"review": "\nTwo cops chase a killer who uses the Seven Deadly Sins as a motive.<br><br>Saw has a very similar story,but Seven has a *much* better\nexecution.The plot may sound sleazy and cliché,but Andrew Kevin\nWalker's dark take on the materials is not:The core of John's plan is\nvery clever and Gothic,and you will become absorbed into the twists and\nplot advancements.The murders are not only graphic,but highly inventive\nas well,in a sick way,and very sadistic.The acting is top notch:I am a\nfan of Morgan Freeman and he doesn't disappoint.Both him and co star\nBrad Pitt do excellent and focused jobs.Kevin Spacy is also excellent\nhere.Director David Fincher and cinematographer Darius Khondji does an\nAMAZING job at bringing the dark script to life:The movie is bathed in\ndarkness.There are some very well set up shots and the pacing is\nconsistent.Fincher gets the best from his actors,and never feels the\nneed to censor himself.The lead up to the conclusion is excellent,one\nof the most suspenseful scenes in movie history,extremely nerve\nwreaking.The end twist is just grotesque,yet the film ends on a subtle\nnote.<br><br>Highly recommend to those who can stomach it.<br><br>9/10\n"},
{"review": "\nSe7en is an undoubtful masterpiece concerning suspense, locations and\ncamera. The actors are also brilliant and the story is one of the most\nthrilling and intelligent of our time. Really great: none of the\nkillings are shown and are left to the mind of the viewer. So, why\nshould someone like me who has just written so nicely about this movie\nrate it with just se7en stars? It is because of its ending.\nSurprisingly indeed, but... I think, a little too surprising. In the\nending this movie seems to lack in logic. The characters Pitt and\nFreeman are playing make some progress in the story and they get to\nknow each other better and better. Freeman's role is the one of a very\nintelligent cop who often has to calm down the hot-headed character\nPitt is playing. But in the last minutes of the movie - I cannot\nimagine why - he doesn't calm him down and absolutely underestimates\nthe danger. It seems to me that this movie just wanted to have a\nsurprising, shocking ending (it really doesn't need to have!!!) and\nspoiled it a little bit to me. But anyway, this is a brilliant movie\neveryone should have watched. Once again, se7en out of ten!\n"},
{"review": "\n\nMorbidly intriguing, disgustingly fascinating.  I was deeply shaken by what\nI would call \"my favourite film\".<br><br>Forget Brad Pitt, I found Morgan Freeman's acting amazing.  He is calm cool\nand collected throughout the whole film.  A complete stoic.<br><br>Some good jazz tunes are part of the soundtrack and the film has\nstyle.<br><br>Watch carefully, the \"lust\" scene.  I didn't understand what had\nspecifically happened, the first time that I saw it.<br><br>I would like to compare the film with the psychological personality\ninventory called the Enneagram.  \"Ennea\" is Armenian for 9ine and I guess\ngram means...chart?  It is based on 9ine different personalities which,\naccording to some sources corresponds to the se7en deadly sins + 2wo\nmore.<br><br>1ne = wrath<br><br>2wo = pride<br><br>thr3e = deceit<br><br>4our = envy<br><br>fi5e = greed<br><br>6ix = fear<br><br>se7en = gluttony<br><br>ei8ht = lust<br><br>9ine = sloth<br><br>There is a theory about the enneagram (which I don't agree with) that\nstates\nthat a person will transform from 1ne personality to another in a\nparticular\norder to become more psychologically healthy as a \"whole\" person.  The\norder\nis this:<br><br>se7en: becomes fi5e<br><br>fi5e: becomes ei8ht<br><br>ei8ht: becomes 2wo<br><br>2wo: becomes 4our<br><br>4our: becomes 1ne who becomes se7en to complete the cycle<br><br>This is the same order that the \"sins\" are mentioned throughout the film.\nIt's basically the same order as above.<br><br>se7en gluttony is mentioned first<br><br>fi5e greed is mentioned second<br><br>ei8ht lust is mentioned.  9ine sloth is mentioned, which is next door to\nei8ht and breaks the cycle in half<br><br>2wo pride is mentioned<br><br>4our envy is mentioned<br><br>1ne wrath is mentioned.<br><br>In both cases The order is 7-5-8-2-4-1.  I was obsessed\nby this fact in 1995 when the film came out because I was studying the\nenneagram at the time.  Obviously, someone needed a life\n:)\n"},
{"review": "\nThroughout history the Bible and its wisdom have been used as an excuse\nfor murder. The director in \"Seven\" cleverly makes use the seven sins\nas Kevin Spacey's Divine permission to commit the biggest biblical sin\nof them all; murder! While Spacey is sacrificing his victims in the\nname of religion and punishing them in graphical behavior for their\nweaknesses; Morgan Freeman and Brad Pitt appear as the prophets\ndefending and protecting all that is good by trying to catch him. The\ndirector David Fincher keeps you on the edge of your seat as you watch\neach brutal murder appear across the screen and as you watch Freeman\nand Pitt getting closer to their killer. Freeman always appears the\nwiser while Pitt gets more and more engulfed with rage as the killer\ntaunts his pursuers while punishing his victims. We the viewers, are\nfilled with anger and wrath (one of the sins themselves), as we want\nthe killer to be caught but we realize at the end that he wants more\nthan that! At the end the shocking revelation takes over our minds and\nfills us with even greater anger as we want Spacey punished! We also\nwant him dead for his last brutal act! We also want Pitt to kill him!\nThe question to be asked, is the unborn child saved from been born in a\nworld full of religious contradiction or should those who wrong us be\npunished without question?\n"},
{"review": "\nThis movie has a good plot and strong acting performances from almost\nall the actors, good screenplay and direction. The only thing it lacks\nis a plausible story. The one thing which bothers me is the reason\nbehind the killer's (John Doe)actions. He starts off by killing an\nobese man because he is gluttonous. Obesity is not caused just by being\ngluttonous. Second is greed. Yes, lawyers are greedy but that is their\nprofession. In fact, in this very movie, John Doe also gets a lawyer\nwho supports him also knowing that he is a serial killer. Is that not a\nsin? Next is sloth. What does a drug dealer got to do with being lazy?\nBehind his every murder, the reason is pretty silly. And the most\nimportant thing which really bothers me is John Doe killing Mills'\nwifey. Mills' wife does not commit any sin that catches his eye and yet\nhe kills her just to unleash Mills' wrath on him. This makes John Doe\nthe biggest sinner of all. I liked zodiac which is more reasonable than\nthis movie. This movie is just average with a terrible music.\n"},
{"review": "\nHello! 'Seven' was watched post listening to numerous positive\nrecommendations. But, upon watching it, I realized that this is a movie\nwhich is highly overrated but seem to be not up to expectation. Brad\nPitt and Morgan Freeman played their part genuinely though the\nintensity of the serial crime happened in the movie was not catchy and\ninfluential. I take this movie is far away from reality! At times the\nmovie seemed to be boring and may cause eye lids to fall down. I never\nwatched a crime story with least thrilling vibe'. The justification\nseen behind each murders sounded childish. I don;t suggest you to watch\nthis movie rather can be used a sleeping pills!\n"},
{"review": "\nSe7en is not a bad movie but it's a big let down except the performance\nof Kevin Spacey and that ending there's nothing more good about it. The\njokes that the characters try to throw in some of the scenes are just\nawful and for sure not funny Brad Pitt and Morgan Freeman can't save\nthe film that David Fincher (Alien3) directed the cast is good the\nacting is meh except Spacey and the ending is a huge WTF that shows\nthat the Bad guys can truly win other than that Se7en is a 2 hour film\nthat is boring to the bone if you want to see a great serial killer\nfilm go watch Zodiac that is one hell of a film. Final Verdict 5 out of\n10 nothing more nothing less.\n"},
{"review": "\nWhat is the fuss about this film? Yes it has good acting (at times),\natmospheric scenes and well done dead bodies. But I would not\nunderstand someone wanting to view this more than once.<br><br>Basically it is a mystery story of a generic serial killer that\neventually owes up to his killings (well that was easy mystery to\nsolve) then kills the wife of a detective who shoots and kills him in\nanger. Am I missing something? Morgan retires, serial killer dead, Brad\nlives on depressed without a wife. OK.<br><br>The serial killer, killed people he thought were disgusting so he\nthought in his mind he was doing a good thing (yeah that is just like\nany serial killer, not original) then he ended up dying and the\ndetective lost his wife who was pregnant. BIG WOOP.<br><br>Yeah its well told story but I just don't see it being so clever that\nit is a best movie of all time and certainly doesn't warrant any more\nviewings in my eyes.<br><br>I don't know I just didn't find myself caring much for Brad Pitts\ncharacter or his wife. So I didn't really care at the end when you find\nout she was killed.<br><br>It felt out of place when they randomly started laughing round the\ndinner table, I was looking around thinking \"Really?\" why are they\nlaughing hysterically?<br><br>Cringeworthy stuff in the cafe when the wife tells morgan she is\npregnant, morgan says \"I got to go\" she says \"Morgan...................\nthankyou\" AHHH thankyou, I just rolled my eyes seriously. (forgotten\nFreemans character name sorry)<br><br>Overrated actually boring/predictable.<br><br>Off the top of my head I mean this isn't even my favourite film I have\njust watched it recently is all, something like \"Shutter Island\" leaves\nyou thinking and is just overall a better film hands down in my\nopinion. This film you get to the end, bored thinking OK. Fight Club\nanother GOOD film with twists, clever and real top film. Se7en not in\nmy eyes.\n"},
{"review": "\nI liked this movie from the moment it started. To me, mixing religion\nwith anything makes 'anything' infinitely more creepy - and this film\nstarted out just that way.<br><br>I loved the premise of the movie and how each new crime is set up for\nthe viewer. Also that the movie is set up in a world where each day\nseems grayer than the previous - and each crime more gruesome - it\nreally does a great job of grabbing your attention from the first\nscene.<br><br>Morgan Freeman does an excellent job of a weathered, yet wise,\ndetective - and then there is the Brad Pitt element. Ms. Paltrow does\nfine work in this movie. And then there is Brad Pitt...<br><br>I want to like Brad Pitt. Maybe it's just that I haven't seen the movie\nyet where he does a great job and doesn't seem like he's trying to act\n'too hard'. I have a hard time believing his character in this movie\n(or any movie he's in for that matter). But, the other actors and the\nscript for this movie do a great job of carrying him along.<br><br>Then there is the 'end' of the movie. I'm still annoyed by how this\nmovie ended. The last scene seems to be in direct contrast with the\nimagination, set up, reveal, shock and get-you-by-the-short-hairs\nscript used in the previous 80 minutes of this movie.<br><br>So...my 7 out of 10 basically means, for this movie - if it comes on -\nI will most likely get sucked into watching it again. And then when all\nthe great scenes are over with and I've become weary of one person's\nacting - I will find that the last 10 minutes are a good point to\nrealize, \"I've been sitting down watching enough TV today - time to go\nget something done. Like popcorn.\"\n"},
{"review": "\nI would like to first start by saying the acting and plot flow are\nincredible. There's no forced jig-saw puzzling trying to fit the\noverall plot of the movie.<br><br>I liked it, in spite of my screwed-up taste for movie these days (as I\nconsider myself very young). <br><br>This film has respectable built-up tension and succeeds creating a very\ngloomy atmosphere throughout the film.<br><br>Lines relating to the 'Se7en' is remarkable. They make you think, about\nthis world we are living in, about things happening in this world and\nwe are also maybe too 'arrogant' enough to ignore and just go on living\nour own lives.<br><br>For those who point out the finale was delivered in a poor way, maybe\nit was to point out the indifferent world we are living in.\n"},
{"review": "\nDavid Fincher of Se7en, The Game, Fight Club and recently the Curious\nCase of BB! What could you need more to get you into watching Seven if\nyou haven't yet?! Ah, let me guess, probably you'd need Brad Pitt and\nMorgan Freeman. What else, let me see, hmmm what about the great Kevin\nSpacey (come on Spacey of Americna Beauty, L.A. Confidential, Usual\nSuspect, 21 and his first and best Seven). Now, add to all that 7 sins\nwhich means 7 murders and not only that you need to guess what are the\n7 sins because many people have watched it, loved it, praised it but\nwhen I asked them who was the 7th victim, they simply didn't know the\nanswer. Count the people murdered in the movie once more and you will\nknow what I am talking about. This movie is, simply and in one word,\njust amazing.\n"},
{"review": "\nTwo detectives, retiring veteran Morgan Freeman (as William Somerset)\nand hotshot rookie Brad Pitt (as David Mills), team up to trail a\nserial killer chalking up victims as an homage to the \"Seven Deadly\nSins\" - \"Gluttony\", \"Greed\", \"Sloth\", \"Lust\", \"Pride\", \"Envy\", and\n\"Wrath\". Don't read anything more about this film; I didn't, and still\nhad it figured out during the final road trip. That it's fairly\npredictable, and presents two \"stock\" characters, doesn't mean \"Seven\"\n(\"SE7EN\" if you use all caps) is a bad trip.<br><br>In fact, it's an excellent film, with a stylish look created by\ndirector David Fincher and cinematographer Darius Khondji, from writer\nAndrew Kevin Walker's intriguing story. Strangely, only film editor\nRichard Francis-Bruce was nominated for an \"Academy Award\". And, there\nwere no acting \"Oscars\". Hopefully, Mr. Freeman just missed getting\nnominated for \"Best Actor\"; he certainly deserved to be, for his\nsharply focused take on the character type also happens to precisely\nreflect the mood of the piece.<br><br>******** Seven (9/22/95) David Fincher ~ Morgan Freeman, Brad Pitt,\nKevin Spacey, Gwyneth Paltrow\n"},
{"review": "\nThis movie is not for those offended by strong language and chilling\nviolence. But it most definitely is for fans of fine acting. Brad Pitt,\nMorgan Freeman and Gwynneth Paltrow are superb, as is the surprise\nappearance of the serial killer in the story -- I won't name him and\nspoil anything for he is not identified until the final credits even\nthough you will recognize him immediately once you finally see him\ntowards the end of the film. The cinematography is excellent,\nheightening the suspense all through the film. The musical score again\nfits perfectly, my only complaint being sometimes it's loud enough to\nmuffle dialog you really want to hear clearly. Other than that, a fine\n-- if blood-curdling -- film.\n"},
{"review": "\nWatched a movie after a long time and what a choice for a comeback .\nSe7en is a shocking, disturbing, cold, sinful thriller which takes hold\nof the audience for the entire length of the movie. The story is about\ntwo police cops, one about to retire and one a very young new entry\nplayed by Freeman and Pitt respectively. Just before Detective Somerset\n(Freeman) is about to retire, a strange case of murder comes into\npicture which introduces the police department to a cold-blooded,\npatient and deranged serial killer who kills people one after the other\non the basis of seven deadly sins mentioned by religion which are\nsubjected to death of the sinner. Thus the serial killer aims at\nkilling 7 people, one for each sin respectively. Detectives Somerset\nand Mills (Pitt) are given this case and they both try their different\nmethods to uncover this mystery and catch the killer. A very unique\nplot, this movie is made even more thrilling by the classic direction\nof Fincher. This movie can be called a milestone in the suspense genre.<br><br>Brad Pitt as the young, restless cop Mills has done his job pretty well\n. But there are some scenes where we feel that he is overacting a bit.\nMorgan Freeman on the other hand makes us feel that this particular\nrole of Detective Somerset was written just for him. Kevin Spacey in a\nsmall role as the deranged killer is impressive and makes us feel that\nhe is truly a cold blooded psychopath . Overall, a must watch movie\nRating : 8.5/10\n"},
{"review": "\nOne of the best serial killer movies ever, and also one of the best\ndetective movies! This movie is great. David Fincher is one of the best\nmovie director's. All of his movies (with the exception of Alien3) are\ninteresting stories, and visually beautiful. This movie was made at a\ntime when Morgan Freeman, Brad Pitt, and Kevin Spacey were all amazing\nactors. Since then they've all been in a few really bad movies. If you\nhaven't yet watched this movie, go watch it NOW!!! The plot development\nis perfect. the acting, directing, and plot line were very well done. I\ndon't know what else to say about this movie that hasn't already been\nsaid countless times, but this is definitely one of my favorite movies\nof all time. One of the best movies from the 1990s. A must see!\n"},
{"review": "\nI used to watch this movie all the time when it came out but just\nwatching it today made me cry. So emotional and so original. You cant\nhelp but think; what if this was done to you? At the end when brad pitt\nbecomes wrath, morgan freeman doesn't really try to talk him out of it\nlike in all the other films where the good guy doesn't kill the bad\nguy. Just the line \"if u kill him he will win\" that line is great\nbecause its true. It is what john doe planned all along and to foil his\nplans would devistate him. When i was young i always thought i would\nkill him for sure and i guess i still would but i think it would\ndestroy john doe if pitt didn't go through with it. Or perhaps since\nbrad pitts wife and unborn baby are dead he could kill himself and that\nwould give the old FU to john doe as well. What would u do?...\n"},
{"review": "\nThis movie was by far the most powerful psychological thriller ever\nmade to date. Three of the best actors in one film giving an air of\nelectricity could hardly be achieved by any other than The Usual\nSuspects. A film where two cops try to unravel the mysteries about a\nseries of homicides, stemming from the seven deadly sins. Each\ncharacter seeping a film of evil from themselves even though they are\ndead made the public think what if a serial murderer is right. That\neach death was necessary as he saw fit, making sure that the deadly\nsins was carried out to such a degree that the outcry from this maniac\nwas heard by the public. And in turn having each person reconsider\ntheir lives and why we are here. David fincher did a brilliant job\ndirecting this film, giving us a glimpse into the horrific underworld\nof the deadly sins, in the cracks of the streets or sidewalks and where\nthe stragglers walk the alley ways, and even capturing the stink of the\nscene where the public cringes their noses watching. Brad Pitt, Morgan\nfreeman, and Kevin spacey was magnificent together. Making the end\nscene the most powerful ever created, and along with the end scene the\nmusic that gave the film its most impactive climax to date. Wonderful\nmovie.\n"},
{"review": "\nThis generally is a superb movie. I didn't really expect much of this\nmovie, but i adore mystery/thriller movies and well this is epic. I'm\nnot going to bore you with the plot because you probably read it above\nbut i will tell you why it is absolutely a great deserving much higher\non the IMDb top 250 list than a measly 34/35.<br><br>It is a very eary thriller which is always sending a shiver down your\nspine because of the constant atrocious weather and dark, empty rooms.\nEvery part of the killers sadistic nature is captured exquisitely\nduring the investigations and i'm glad that lots of clues are found\nthat link to the killers identity whereas in some movies they just get\none clue and they know where to go next which bores me. This had so\nmuch more depth and each clue and piece of evidence links perfectly\ninto what the killer is going to do next.<br><br>I thought Brad Pitt was going to be terrible and i would get to slate\ndown his emotionless acting, yet he was terrific. A great loving sense\nfor his wife and kids and also becomes more likable as his character\n(Detective Mills) and Morgan Freeman's character (Detective Somerset)\nbecome more like partners rather than just cops. Obviously Morgan\nFreeman played the part amazingly and you always feel he has a great\nsense of knowledge and wisdom which is what i expected.<br><br>Each scene is well thought out and works well with the story so credit\nto the writer and some terrific music helped emphasise the tension of\neach scene.<br><br>So all in all a spectacular movie which case shall remain off my shelf\nand in my player for time to come. 10/10\n"},
{"review": "\nThe most absurd objection against Seven that I have ever read is the\none claiming that Spacey's too nice guy persona was not credible as a\nfierce murderer.Well,this may be so for someone whose first Spacey\nmovies were K-PAX or Pay It Forward or The Shipping News ;but I first\nsaw Spacey in the astonishing noir pastiche L.A. Confidential and then\nin the drama The Big Kahuna .We are talking about the actor from L.A.\nConfidential (1997), Glengarry Glen Ross (1992), The Usual Suspects\n(1995),etc.,that is,an endless gallery of villains.And not only a\ncompetent bad guy,but an authentic tough guy also\u0097a violent tough\nguy.The opposite of a dolt or a sissy;very tough,very strong,one of the\ntoughest guys on screen.His only convincing and interesting role as a\ngood-natured character is the one in K-Pax.<br><br>In my opinion,Spacey's best roles known to me are those from American\nBeauty, L.A. Confidential, The Usual Suspects, Se7en, The Big Kahuna\nand K-PAX.\n"},
{"review": "\nI love \"Se7en\". It's captivating, horrifically repulsive, thought\nprovoking, and violently thrilling. Fincher's style creates a\nforeboding and appealing atmosphere that makes you HAVE to look, even\nif mounting tension and repulsion would compel you to do otherwise.\nFincher shows you some very disturbing, bloody things in this film, but\nhe pulls back and uses implication rather than illustration at the\nperfect times. The climax is incredible in its ability to effect you,\nforcing you to be introspective about what you would do in the\ncharacter at center stage's position. Few films have engaged me\nemotionally and mentally in such a way.\n"},
{"review": "\nHave you ever came out of a theater and thought, \"Man that movie was a\ncomplete piece of sh**. It had a terrible plot, no excitement, and a\nunder satisfying ending.\" Well this movie will give you a complete\nopposite reaction. First off it is brilliant how the murderer in the\nfilm kills people. He works by referring to the 7 deadly sins. Second\noff, even at points of the film when things happen and you think that\nyou might know how this movie will end, you are completely blown off\nyour feet. I was so shocked about how this thriller ended, I couldn't\nhelp but spoil the ending to many off my friends. Even the acting in\nthis film was terrific, specially by Brad Pitt. I hardly like any of\nthe other films that Brad Pitt has been in, but this role was terrific.\nIf there is one movie that you have not seen and want to pick up the\nnext time you go to the rental store, i suggest se7en. *Caution get\nready to pee your pants from the ending*<br><br>I just became the living definition of what is wrong with user ratings.\n"},
{"review": "\nI thought this movie was very suspenseful. It's about two detectives,\nFreeman and Pitt,who are trying to solve serial mysteries. The victims\nwere innocent people who were being killed because the crazy \"john Doe\"\ncondemned to death because they had committed a sin. The title to the\nmovie se7en are for the seven deadly sins; gluttony, pride, wrath,\nenvy,greed, sloth, and lust. \"John Doe\" whom the detectives can't find\nany type of finger prints to kills each person and leaves clues for the\nnext killing. Freeman portrays a great detective in this movie, it was\nlike he was meant to be a detective, like in Along Came a Spider. I was\nvery intrigued when he stated \"there are seven deadly sins etc.......\"\nAt first i was like wow!! How does he know this ? Then he teaches Pitt\nwhat he should be looking forward to.Pitt goes and gets books and cliff\nnotes on the stories.<br><br>The movie is set in New York, some of the places the detectives visit\nis dark and gloomy. The are some scenes where you see the inexperience\ndetective Pitt, almost gags and/or cover his nose, which Freeman an\nexperienced Detective don't.The movie has a twisted ending which is a\nmouth dropper. I would advise anyone to see this movie, especially if\nyou love a suspenseful, crime, gory movie.\n"},
{"review": "\nWhen I first saw Se7en, I thought it was reasonable. Then, reading the\nendless comments on IMDb that held it up as some sort of masterpiece, I\nbecame frustrated with people thinking that just because it is a well\nput together serial killer film, it is a masterpiece. Yet of late, I\nhave realised, that Se7en is not a serial killer film. Not just that,\nanyway.<br><br>Se7en is an idea, a statement (if you're as pessimistic as that) about\nthe world we live in. There is not a single moment in this film that\ndoes not scream \"The world is a horrible place.\" Personally I don't\nagree that that is true, but that doesn't make the notion of the film\nany less masterful. So, it is since I have realised that Se7en is not\nabout a killer, but a horrible notion, that yes, it is a masterpiece.\nWhether you enjoy it or not, is a different story. But if you have not\nyet seen it, whilst you're watching it - consider Somerset's (Morgan\nFreeman) point of view, and consider how the film expresses it.<br><br>There are some brilliant dark films out there - but I consider Se7en to\nbe the darkest (and one of the best) of them all - hence the title of\nthis review, The Prince of Darkness.\n"},
{"review": "\n\nSe7en is your run of the mill detective thriller with a razor sharp and\nbloody edge, though it is not only the gore that sets this movie apart.\nWith an incredible cast (Morgan Freeman, Brad Pit, Kevin Spacey, Gweneth\nPaltrow, and R. Lee Emery), a sometimes overly slick but competent\ndirector\n(David Fincher of Fight Club fame), and a smart script by Andrew Kevin\nWalker (8mm) this movie was a much needed shot in the arm for the\ngenre.<br><br>We open on Dectective Somerset (Morgan Freeman) at the scene of a violent\ncrime, this pretty much sets the tone.  Dectective Mills (Brad Pitt)\nenters\nand we learn that Somerset is retiring and Mills is his replacement.  This\nis there \"transition\" period and Mills last week on the job.<br><br>These first few short scences are followed by one of the best opening\ncredit\nsequeces ever made.<br><br>At the scene of another horribly gruesome crime we come across a man who\nhas\naparently eaten to death.  When another, equally heinous, crime is linked\nto\nthe first we realize that there maybe a serial killer on the prowl.  The\nRace is on.  Can John Doe (Kevin Spacey), our friendly nieghborhood\npsychopath, be stopped before he kills one person for every deadly sin (of\nwhich there are 'Se7en'), will Somerset get is man before he is out to\npasture, and is there something more to these killings than at first\nglance.<br><br>I strongly recomend this movie, but only to the not so sqeamish.  With a\ndark gritty atmosphere and filthy city as the backdrop to the\nunconscionable\nactions of mad man, you should not be let down.  This is a highly\nentertianing film with more than one layer.  If you have not seen it you\nare\nmissing out.     \n"},
{"review": "\n\nPOSSIBLE MINOR SPOILERS\nThis is one of the most beautiful films i have ever seen, though it is not\nbeauty in the traditional sense. It is a dark, bleak portrait of suffering\nand pain, in a dank, depressing city. Every frame is filled with either\ndespair, or twisted horror. There's a strong Gothic element to the\nstoryline, (which involves the deliciously nasty punishments of several\nsinners), that you will either embrace wholeheartedly, or reject outright.\nBrad Pitt and Morgan Freeman both turn in convincing, powerful performances,\nwith the former proving that he's much more than just a pretty face. This\nfilm sucks you into it's uniquely dirty world, only relinquishing it's tight\nhold in a finale that you'll never, ever forget...no matter how much you\nmight want to. For the willing victim, this will be one of the best\nthrillers you'll ever see.\n"},
{"review": "\n\nI'm very fond of David Fincher's movies (favorite: Fight Club),and finally\nhad a chance to see \"Se7en\". It had all the Fincher elements I like , the\ntone of color, the density.... The plot is generally fine, but the ending\nwas just too much for me. It left me really sick. I know the ending is\nwhere\nthe climax is supposed to be, and it did strike me hard, but I just can't\nhave a nice feeling for this movie.<br><br>Usually I'm not very much disturbed by shocking endings(survived\nHannibal!),\nso I don't really know why this particular movie made me feel bad. Anyway,\nyou are warned. \n"},
{"review": "\n\nMorgan Freeman is everything a man can be - full of wisdom,<br><br>about to retire and contemplate his life, etc.  Brad Pitt is everything<br><br>a man wants to become - new to the force, full of hopes, dreams,<br><br>visions.  He has a wife and wants to start a family.  Kevin Spacey is<br><br>everything a man doesn't want to be, but is only understood by<br><br>those who are psychotic like him - to an outsider, Spacey's<br><br>character is true evil but to those who can sympathize with him. <br><br>Spacey is the voice for those who know not what they do.  Seven is<br><br>disturbing, not for the mild hearted, and made me jump at parts<br><br>(something that rarely happens.)\n"},
{"review": "\n\nIf you are squeamish, then beware of what you'll see in this film. Brad Pitt\nand Morgan Freeman play two detectives on the trail of a brutal serial\nkiller who punishes those who commit one of the seven deadly sins by turning\nit against them. Graphically violent, terrifically acted, and darkly\ndirected, this is a must for fans of the genre. The killer(whose identity I\nwon't give away) is extremely creepy as well. The violence isn't really\ndisturbing, but the way the film analyzes the evil and darkness of human\nnature is. One of the best thrillers ever. 3/4\n"},
{"review": "\n\nThis film was VERY VERY exciting.And it was also technical brilliant and the\nacting by Morgan Freeman(which is a great actor)has never been better but\nalso Brad Pitt is good.Even if the film are good it´s extremely Dark and I\nam not sure if I like the end because it´s one of the most dark endings I\nhave ever seen.Still the film is very well done,well acted and VERY\nexciting.4/5\n"},
{"review": "\n\nAfter seeing it a while back and thinking it was a good thriller, I saw it\nagain, maybe getting more out of it a second time. Boy was I right. Seven is\na complete masterpiece, a movie that is so tense, riveting, chilling and\ndark that it is a revelation in cinema history. Not one scene I found to be\ngratuitous, boring, or bad. Some of the scenes in it disturbed me so badly,\nI couldn't get to sleep for a couple of days, namely the knife-rape part.\nSeven is much like Fincher's recent masterpiece, Fight Club, in it's view of\nthe dark, ugly side of the world. Seven takes us there and never lets us\nback for air, and fascinates us at every thrilling minute. A landmark in\ncinema history. 10/10.\n"},
{"review": "\n\n\"There are seven deadly sins captain, gluttony, greed, sloth, wrath,\npride,\nlust and envy. Seven.\"<br><br>A killer is on the loose in the Unnamed City and they are using the seven\ndeadly sins as their MO. Two cops are assigned to investigate, Sommerset a\nworld weary cop, soon to retire, and Mills an experienced investigator,\nbut\nnew to this city and its ways. Its an old combo, but Fincher makes it\nwork,\nand work well.<br><br>Pitt in my opinion is at his best here. He portrays a very believable cop\n(at least in my experience) dedicated and not too cultured. Freeman, while\nplaying the intellectual-about-to-retire cop Sommerset, brings forth great\npresence to the movie, the calm ying to Mills raging yang (or is it the\nother way round?)<br><br>Some of the most disturbing aspects of this movie, are not those which we\nsee, but those which we are left to think about. The killer's reasoning\nbehind the murders almost makes it justified, perhaps the most disturbing\naspect of all.<br><br>The action sequences are all realistic and believable(well, as good as it\ngets in Hollywood anyway). The constant rain, the dilapidated sets, unique\ncamera angles, innovative film processing and a oppressive soundtrack make\nSe7en a complete indulgence of the senses.<br><br>As for the ending, it has to be seen to be believed.<br><br>This movie will scar, but then, isn't that what good thrillers\ndo?\n"},
{"review": "\n\nDark, evil tale of a killer using the 7 deadly sins as grounds. The cops on\nhis tail are always one step behind and get to witness the unbelievable\ncruelty that the murderer has inflicted upon his victims. No compromise:\nthis is the most evocative film to appear in recent years, and I bet the\nending had Andrew Kevin Walker bouncing up and down shouting: \"I'm the king\nof the world\" too. Fantastic.\n"},
{"review": "\n\nIts should be classified as the best thriller ever made. Its a classic.\nMorgan and Pitt where extra ordinary, they were made to be together in this\ngreat movie. Though in was not the full version of the story its still\ngreat. In the book Pitt hurt Morgan with his knife and then he was taken to\nthe court, he served a short period as far as I remember.\n"},
{"review": "\n\nFew films genuinely shock me nowadays, but this did. It is horrible yet\nfascinating, it fulfills the morbid curiosity which is in us all whether\nwe\nwant to admit it or not. There have been other films about serial killers\nbut none as desperate or dark as this masterpiece.<br><br>It is the unrelenting mental will of Spacey's character that chilled me\nthe\nmost. His utter insanity was matched only by his ingenuity and discipline.\nHis character is one of the most truly evil in film history, forget\nhannibal\nlecter !<br><br>The whole film is brilliantly made, the performances are great, even from\nBrad Pitt, and the atmosphere is wonderfully set, but there are two\nparticular things which, for me, set this movie apart.<br><br>The first is the way in which the city setting they are in is every bit as\nall consuming and intimdating as Spacey's character. People are swallowed\nup\nand spat out in this world, no one counts. It reminded me very much of an\nAlan Moore graphic novel called 'Watchmen' in which a character called\nRorschach becomes a vigilante to clean the streets of the 'scum'. Spacey's\ncharacter is somewhat like this striving to show people the evil that\nsurrounds them. The irony is that his methods are wholely more evil than\nanything he wishes to illustrate.<br><br>The second is the ending. Never has there been an ending like it to my\nknowledge. It is hard to describe how it makes you feel. There is no way\nhe\ncan lose, you feel cheated whilst still appreciating the cleverness of the\nmanufactured situation. It leaves you with nothing exactly reflecting how\nBrad Pitt's charcter must feel at this moment. The film leaves you\nbewildered and mentally fatigued.<br><br>However the perfectly handled ,and completely unique,  ending completes an\nawesome film.It is very downbeat and critical of humanity, Morgan\nfreeman's\ncharacter re inforces this in his final line, but there was a place for a\nfilm such as this and Se7en filled it.\n"},
{"review": "\n\nSeven is far superior to serial-killer cliches such as Silence of The\nLambs.\nSeven's graphic morbidness only helps exemplify the realities of the\nsituation. Great acting by Pitt, Freeman, and Spacy. The characters are\nbelievable in that they are not perfect or even-tempered;they are real.\nThe\nmovie is real. ...But if you can't handle violence, gore, reality, or\npolitical-incorrectness then stick to Mary Poppins.\n"},
{"review": "\n\nSeven is not your standard serial killer on the loose film.  It is a dark,\ngrimy, visceral thriller that chills you to the bone days, months and years\nafter you've seen it.  The crimes that John Doe perpetrates in this film\ngrow more and more atrocious as the film progresses, and we can't help but\nwatch.  It's a glimpse into ourselves.  We find these events horrible, but\nat the same time we wonder what could push someone to acts such as these?\nThat's where Brad Pitt and Morgan Freeman come in.  They provide the\nquestions that we as an audience are afraid to ask.  They doggedly pursue\nthe killer in an attempt to stop him.  The film ratchets up the tension and\nonly in the final act of the film do we meet John Doe.  Kevin Spacey is\nabsolutely chilling.  So calm, so cold and so damn intelligent.  The ending\nknocked me out.\n\n"},
{"review": "\n\nI remember watching \"Alien 3\" and not being too fond of it.  I was impressed\nwith the overall look of the movie and the darkness of it but it just didn't\nseem to fit in with the previous two movies.  I remembered the director's\nname and found myself looking out for more of his work.  I was extremely\nexcited in 1995 when I found out he had directed \"Seven\" since I thought his\ncareer had been destroyed by \"Alien 3\".  I was clearly wrong.  I saw \"Seven\"\nand walked out of the theater not knowing how I felt about the movie.  It\nstayed with me for a week so I went to see it again.  Brilliant!  Morgan\nFreeman is so amazing it's painful.  He takes a cop movie cliche (the soon\nto be retired, embittered cop) and takes it to amazing heights. He allows\nyou to understand his character completely.  A beautiful performance.<br><br>The movie is incredibly dark not only in tone but physically.  Somehow\ncinematographer Darius Khondji manages to take a desert setting in the\nmiddle of the day and make it dark, shadowy and bleak.  The dark look of the\nmovie adds to the overall feel of despair.<br><br>\"Seven\" pretty much gets your attention from the very beginning (introducing\nFreeman's character and Brad Pitt. . .who is really good) and then throws\nyou a pretty disturbed title sequence which makes you kind of twitchy and\nputs you in the proper frame of mind.<br><br>The movie starts off very graphically with the 'gluttony' killing.  If you\nmanage to make it through the scene where the body is discovered (I swear,\nyou can almost smell that apartment!) and the autopsy scene you've already\nsat through the goriest parts.  This doesn't mean that you can relax,\nthough.<br><br>A good job by all involved. We can only hope that David Fincher keeps making\nmovies this disturbing and interesting.  It seems as if he's definitely on\nto something.<br><br>\n"},
{"review": "\nThis movie is regarded as the definition of a modern thriller. It is\neasy to see why, as it is easily one of the most suspenseful movies I\nhave ever seen. What added to this suspense, was the straightforward,\nyet grim storyline, that keeps the audience interested.<br><br>The plot revolves around two detectives, William Somerset, and David\nMills, trying to solve the mystery of a serial killer. That killer,\nJohn Doe, leaves clues around for unknown reasons. Detective Somerset\nbelieves he (the killer) is following the seven deadly sins (hence the\ntitle Seven, or Se7en, and is leading them to something. What this is,\nis unclear, but they do eventually capture him, and he reveals that his\nfinal victim, is David's wife Tracy, thus showing he was playing a game\nwith them all along.<br><br>There are few movies I have seen, before or since, that are suspenseful\nas this. It is also quite bleak, which did admittedly put me off at\ntimes. It is still a great film, definitely worth a watch, if you are\nold enough (remembering this movie is rated R), and whether or not you\nenjoy it, you will probably find it interesting. From me it gets 8/10\n"},
{"review": "\nI arrived 20 years to late for the hype of this movie but that doesn't\nmake it any different. One of my favourite thrillers. They don't make\nthem like these anymore.. Realistic characters, an evil serial killer\nbut not as much emphasis on gore more storyline.<br><br>David Fincher did a class job, acting from Brad Pitt, Morgan Freeman,\nGwyneth Paltrow and Kevin Spacey was beyond outstanding.<br><br>Se7en follows detectives Somerset and Mill... Somerset is an older\nmature detective whos ready to retire whilst Mills is an energetic yet\nnot as knowledgeable, we see more of Mill' private life with his wife\nTracy.<br><br>The movie kicks off after the murder of an obese man... suspicious but\nno motive the cops are at a standstill. That is until a wealthy lawyer\ngets killed and in blood 'Greed' is written. Knowing there is a serial\nkiller on the loose its down to the detectives to hunt a man with an\nobsession with the deadly sins killing innocent people.<br><br>The ending to this movie I like a lot, I wont give it away but it shows\nhow sick and twisted minds of serial killers are.<br><br>Se7en will surely stick in your mind\n"},
{"review": "\nThis film got everything right! I mean every single casting choice,\nscene, and line was perfect! This was Brad Pitt's best role in movie, I\ndon't recall a movie where he ever achieved better acting than here.\nAlso, in my opinion, the same goes for Morgan freeman, him and Brad\nmake a great on screen team. The film was a real mind bender, which I\nlove! The dialogue was unbelievably great! The plot was so genius as\nwell. The twist ending was one of the best twist endings I've ever seen\nhands down! This movie has perfect acting, characters, plot, dialogue,\nending, and it definitely keeps your attention throughout, I wasn't\nbored once, and that's very important to me! 10/10, not a single flaw\n👍🏼\n"},
{"review": "\nI am glad I knew as little as possible about the movie before watching\nit. Seven is a meticulously crafted psychological thriller and one of\nDavid Fincher's best films! That shocking ending blew me away and\ncompletely caught me off guard. Seeing the two detectives following the\nleads and clues to catch the killer was always riveting and thrilling,\nso the whole journey to discover his real intentions was quite\ninteresting to watch. Brad Pitt and Morgan Freeman are excellent as\nalways, but Kevin Spacey is the one who steals the show as the\ningenious serial killer, who is usually one step ahead of them. David\nFincher is truly one of the greatest filmmakers of our time and I still\nhaven't been disappointed by his work so far.\n"},
{"review": "\nI've watched this true masterpiece several times over the years,I have\nyet to watch a film that comes anywhere near it in terms of pure horror\nat the lengths humans will go to inflict pain on each other... The\nbrilliance of this film is you don't see the acts been done,it's left\nto your own imagination. Brad Pitt,Morgan Freeman and Kevin Spacey are\nfantastically cast , the setting is wet and dark,( you never find out\nwhere the city is meant to be ).A Constant feeling of dread runs\nthrough this film which I can only say is an absolute must watch movie.\nIts is in my(and many others) opinion, probably one the best films ever\nmade in the history of film making .. WATCH IT!\n"},
{"review": "\nIts today's cult status this movie gained thanks to the excellent work\nof director David Fincher (whom this was only the second major movie in\nhis career) and screenwriter A.K.Walker (who also wrote the screenplay\nfor \"8MM\"). With this film Fincher ranked himself among the most wanted\ndirectors and gained a reputation of true heir of Hitchcock, which was\nconfirmed by his later movies \"Play\" and \"Panic Room\". The assignment\nof roles in the movie is excellent, and I especially need to emphasize\nBrad Pitt's acting (as in \"Fight Club\") which proved that he is not\njust a beauty figure whose main task is to lure women to cinemas, but\nalso showed that he knows to act! Freeman is excellent in the role of a\nveteran detective - like it was made for him, and Spacey in the role of\nthe killer was, as usual, brilliant and gravely. The atmosphere of the\nfilm is so dark and depressing that the bizarre and terrible murders\nmake it even more stressful. I was particularly impressed by the way\nmurders were described, which are quite original and leave a big\nimpression on the viewer. (Something like that was attempted in\n\"Resurrection\" with C.Lambert but not very successfully, and \"Saw\" -\ninteresting, but not on a par with \"Se7en\"). All in all this is an\nexcellent and original movie which is rarely seen.\n"},
{"review": "\nAs a 15 year old, I did not know what to expect from the movie. All I\nknew is that it was supposedly good and that the actors were the best\nthere are. The storyline takes the viewer on a journey along with the\ncharacters. The viewer soon begins to empathise with Brad Pitt's\nseemingly over- confident character. This is similar for Morgan\nFreeman's cool, calm and collected camera. This turns out to be\nsignificant towards the end of the movie. This movie is no murder\nmystery like any other, and perhaps not much of a murder mystery at\nall. This is due to the difficulty that the detectives have when\nattempting to solve the case. With any other actors, the movie may have\nbeen unbearable as it is often slow paced. However the acting was so\nreal and, well, brilliant that you can't take your eyes off the screen\nfor one second. All in all, the magnificent, unpredictable storyline\ncombined with brilliant acting makes this movie a must- watch for all\nfans of film.\n"},
{"review": "\nIf you will see this movie the first thing will come into your mind\nwill be\"Oh my god\". This is a tale of a serial killer and let me tell\nyou this one is quite different from other you seen. This guy (kevins.)\nis looking so intense in the movie. Though the story seems fit to the\ncharacters but the creepiness of the main idea is very unique....!! And\nlike always brad pit is looking handsome and morgen is intelligent but\nkevin is a winner in this movie. when i saw this movie last night i\nwasn't thinking that it will be so intense like its review says on IMDb\nbut just after watching it for 30 min. it gripped me in such a ways\nwhich words can not define. this is movie which you will remember for a\nlifetime and discuss with 1000 people and everyone will have the\ndifferent theory for the characters but i bet on that - everybody will\nbe agree on the idea and the intensity of the movie. A must watch if\nyou like the serial killer movie and light blood n gore but i bet the\nidea will more hit you then this. I am giving it 10/10!! Best in its\ncategory.\n"},
{"review": "\nSeven is a superb suspense thriller. The movie is binding with stellar\nperformances by all the actors. Brad Pitt in his portrayal of a\ndetective who is impatient with his partner is perfect , so is Morgan\nFreeman calm and calculated and , Kevin Spacey the serial killer who\nthinks his killings are justified .Gwyneth Paltrow also is brilliant\nplaying a wife full of hopes.<br><br>The seven deadly sins are not a monarchy to anyone , each one of us in\na way is affected and how deeply rooted they may be even in good people\nkeeps us thinking long after the movie is over. The story telling is\ngreat and so is the direction , a must watch.\n"},
{"review": "\nDavid Fincher, Morgan Freeman, Brad Pitt and Kevin Spacey: You can't go\nwrong with this team, can you? This is why Se7en is 9 out of 10 for me.\nAlmost perfect among the films categorized in the group of\nthriller/crime movies. With a very solid plot which does not allow the\nfilm to turn into a cliché about cops chasing a serial killer, Se7en\nstands out as a successful thriller. It's a good crime/mystery story\ndelivered by exceptionally good acting, very good directing and a\nflawless screenplay. While Morgan Freeman steals the show, Brad Pitt\nproves that he's a promising actor, and not just one of the most\nhandsome men in Hollywood. Needless to say, Kevin Spacey's performance\nas John Doe leads to one of the unforgettable villains on big screen.\nAll in all, it's a must-see and definitely one of the best of its kind.\n"}
]
