[
{"review": "\nLet me say it right now; I hated this movie. It was bad. Look, the\nconcept of a being movie cut into two parts just does not work. The\nwhole thing felt like a two-hour exposition. The first 30 minutes were\nso damn boring I literally could not stop getting out of focus and move\nuncomfortably in my seat. There really isn't anything special going on\nas it progresses, too. There is war going on, but they do not really\nshow it and it doesn't suck you in. It's very slow paced with lots of\nteenage drama and not a lot of \"games\" or \"hunger\" as in the previous\nfilms (which I liked, by the way). And now there's Jennifer Lawrence's\nacting, which was trying too hard (while making lots of weird facial\nexpressions that made me laugh at inappropriate moments). Overall, I\nthink the idea of splitting a movie into two parts; thus making the\nfirst half boring, isn't a very good one. And in this particular movie\n\"not very good\" is a compliment. 3/10\n"},
{"review": "\nI had never heard the term \"set-up movie\" before today. There has\ndefinitely been a trend of splitting up a story into multiple movies.\nThese movies don't have a beginning-middle-end the same way other\nmovies do but at the very least there's some progress. <br><br>The problem with the Mockingjay Pt 1 is not that it's boring or poorly\nmade. In fact, there is a lot of excitement in this movie. The problem\nis that from beginning to end there is hardly anything that changes. If\nyou look at where the characters are in the beginning and where they\nare in the end there isn't much that's changed except for what happens\nin the very end. Katniss has been doing things but we haven't seen much\nof the effects of her actions.<br><br>I didn't dislike this movie that much despite it's slow beginning. I\njust can't give this my seal of approval when I left the theater\nfeeling like I saw half a movie. By the time the story gets its payoff\nmy memory of this movie will be worn-off.\n"},
{"review": "\nLike watching paint dry. Boring to a mind-numbing degree. How many\ntimes can we see Katniss be horrified and/or emotionally distraught?\nMaybe the filmmakers thought they were adding depth to their\ncharacters. Well, they were wrong. Instead we, the audience, sit\nthrough one scene after another in which really nothing happens at all.\nThis whole thing could have easily been compressed down to 40 minutes\nand then we could have had the rest of the book as the rest of the\nfilm. This felt very much like they were stretching it out so they\ncould make two movies - which is the new thing to do in Hollywood with\nthese franchises. Not good storytelling.\n"},
{"review": "\nI am so disappointed of the movie. And that's because there happens\nclose to nothing. At nearly every point you notice it's stretched for\nmaking out of one book two movies. At the beginning I liked it, because\nmany parts of the book found their way into the movie. But I realised\ntransferring the story of a book 1:1 into a movie isn't that good.<br><br>(NO SPOILER) As an example they need about 5-10 minutes just to go down\na staircase, back upwards because \"missing\" something and down again.\nAnd nothing really happens. All the time absolutely no excitement rose\nin me and I just got bored. And I am pretty sure this should be a part\nwhere your heartbeat is meant to been rising.<br><br>Sure there are some nice and decent scenes but most of the stuff is\njust lame. In the book it works but clearly not in the Movie (plus the\nshowdown of the book is missing because of the split).<br><br>But at least I enjoyed the screenplay of Josh Hutcherson and Philip\nSeymour Hoffman, which lifted the Movie \"up\" to 3 Stars. I hope the\nlast one gets back on the level of the first two movies.\n"},
{"review": "\nGreat acting from the cast; especially Jennifer Lawrence, the\ncharacters were as believable and entertaining as they were in previous\nfilms, this is pretty much the highlight of the film.<br><br>The plot however was dull and uneventful, as in nothing really went\nanywhere. in the majority of the film there was no tension; for the\nmost part it was basically \"stuff happens in a bunker for 2 hours: The\nMovie.\" which is super disappointing because although I haven't read\nthe books; I'm told by people that have that they skipped a bunch of\nthe action and downplayed the apparent love triangle.<br><br>If you wanted an action packed flick like the first two or you are the\ntype of fan who doesn't like stuff in the book to be left out, you will\nbe sorely disappointed as this is clearly a filler movie to get some\nextra $$$ before the series ends.<br><br>wait for DVD.\n"},
{"review": "\nThis movie was extremely dull and boring. You could probably skip\nwatching this movie in the series and you wouldn't miss much. The story\nwas dragged out so much that I found myself shifting in my seat and\njust waiting for it to end.<br><br>The acting was especially bad and I was cringing at the amount of\ncliché lines. My friends and I were also really surprised by such a\nlack of chemistry between Katniss and Peta; their relationship is so\nforced and I had difficultly even caring about the characters because\nthey are so underdeveloped. So many scenes were completely unnecessary;\nthey added nothing to the story and were just there to take up time.\nMockingjay was extremely disappointing even though I went in with low\nexpectations. 2/10, would not recommend.\n"},
{"review": "\nThe first movie was fresh and entertaining. I've been dragged by my\npartner to watch the second one which I actually enjoyed until the end\nwhen I realized it was not finished yet. The Hunger Games: Mockingjay\nPart 1 is simply a jock. I've never been so much bored from a movie and\nat some point I really considered leaving the theater. The pace is\nslow, the acting terribly poor and every single scene predictable.\nJennifer Lawrence's character has been stretched to the maximum. All\nshe does is crying and pretending all movie long.I will not watch the\npart 2 in theater nor on TV as we all already know what will happen.\nThis movie is perfect if you want to feel frustrated, disappointed and\ntricked.\n"},
{"review": "\nThe Huger Games has clearly grown up in Mockingjay. Social criticism is\nmuch stronger than previous movies. Films theme is much more brooding\nand ominous than before. But that doesn't save this picture totally.\nDividing the movie in two parts is clearly a huge mistake. Many scene\nare way too long and some of them are clearly just vain. Topmost\nfeeling is just making more money. It would be much better to make only\none movie instead of two. One three hour long movie is much easier to\nkeep together, than two over length movies. It is clearly Hollywood's\ngreed to capitalize on movie (and book) series fans. How many times\nmore the audience will accept that? Jennifer Lawrece is great at her\nrole as Katniss, but somehow Josh Hutcherson as Peeta's role as\nbrainwashed puppet doesn't convince. There is a lot of good elements in\nthis movie so it is a shame that Hollywood want just get few more money\nfrom the fans. Mockingjay part 1 is despite that quite eligible movie\nthat end up in green money making. Good movie ends up to mediocre\naction flick and that is shame.\n"},
{"review": "\nI liked the Mockingjay movie, and saw some (on message boards and blogs\nand sh!t) mention Battle Royale 2: Requiem. I believe \"Ripped off\" was\nthe words used. Hitherto, I had not known there was a sequel to the\ngreat Battle Royale movie, so I got around to watching BR2 today, and\nI'm rather convicned they're pretty much identical movies. They both\nfeature the kids forced to kill each other, in a controlled\nenvironment, that go on to take part in a revolution, but before that,\nthere is all the stuff about Noriko's brainwashing and the propaganda\nwar, even the road full of skeletons looked like it was taken from the\nsame storyboard. Battle Royale 2 seemed to be about control of a\npopulation through violent entertainment, exactly like Mockingjay. But\nwhy did they leave off the ending? Note that BR2 had not captivated\naudiences as did BR1. <br><br>So, while I really liked Battle Royale 2, I only kinda liked\nMockingjay. I'm sure others will have their own preference.\n"},
{"review": "\nLiterally, each and every character, most of the action scenes, and\ndialogs in the film are inspired, or say blatantly copied from the\nJapanese Battle Royale II film.. You name a character, you got him in\nthis film. Even the background score is lifted from BR and BR2. And the\nworst part is that this plagiarism didn't pay off in the end. The\nscreenplay was very poor. Action sequences looked too much fabricated,\nsuper slow, and lacked depth. It's a congery of B-grade visual effects,\nmelodrama, and toothless humor.<br><br>Final word: If you're are an eleven year old with no Hollywood\nexperience, it's a treat for you. Or else, don't bother watching it.\n"},
{"review": "\nThis is by the most boring movie I've seen this year. The production\ncompany just want to squeeze money out of people like me who apparently\nhad nothing to do this Saturday afternoon but to watch a movie that\nmaybe is okay~~ Alright, let me simply tell u why this is complete\ncrap. Story is non- existent. Loop wholes as big as Twilight. Boring\nemotional scene with lame monologue.I think a law should be passed to\nforbid producing so many sequels for a single movie. It just make use\nof people's desire to finish something and the recognition from the\nfirst.. Frankly I would rate this movie zero star if I can. Yup, one\nmore thing, Jennifer Lawrence performance was actually OK. But it is\nobscured by the laughable lines and story telling.\n"},
{"review": "\nIts longest trailer i ever saw in my life.<br><br>Please save 2 hours of your life and do something else. This is not\n\"The Hunger Games\" you expect, its a movie for being one. I really\nloved first and a second one.They are entertaining, fun, good to see\nwith friend, eat popcorn with and so on, But this one.... its just a\n\"wow\", Its more like bad TV show then a movie.<br><br>What happens in this movie 2 hours long? SPOILER: &gt;&gt; Nothing! You can\nskip this one \"scamming\"jay movie.<br><br>Its more like Santa Barbara series then theater movie. And i really\nwant to ask, god damn, why? Why this kind of movie gonna get to the\ntheater, after that disaster TV show in movie theater Hollywood is\nasking why people stop going to see movies. because of this scam-films\nyou make for sake of money. <br><br>You have to wait a year now to see Mockingjay - Part 2 to actually see\nthe movie you expected to see this time. <br><br>Awful, Pain to watch it.\n"},
{"review": "\nI don't know how this movie got 7.5 out of 10 so far but for me its\nawful. There's not much to be happy about in \"Mockingjay,\" which\nshouldn't come as a surprise if you've read the book (it's pretty\ndepressing). <br><br>Much of the film plays out in District 13, a secret underground bunker\nrevealed in last year's \"The Hunger Games: Catching Fire\" that's led by\nPresident Coin (Julianne Moore). <br><br>Unlike the previous two films, \"Mockingjay\" doesn't have a whole lot of\naction. Katniss fires off only one arrow throughout the film from her\nnow iconic bow. The first movie of this year that I kept checking the\nclock for movie to end . It was so boring , I felt like I just watch\n1/4 of the story line . I should have watch Big Hero 6 second time\nrather than paying to see this movie\n"},
{"review": "\nThis movie was made only for profit!<br><br>What can I say besides that the acting is very poor and the fact that\nthe whole action could be concentrated in 10 minutes?!?! Nothing\nhappens in this movie!<br><br>I watched all the parts at cinema, but I promise that I won't even\nwatch the last part at HBO... <br><br>So, if you haven't managed to see it yet, please don't go to cinema,\nmake the producers go to bankruptcy!<br><br>This movie doesn't deserve 10 lines of text... Please vote with 1, 7.5\nscore convinced me to watch it!\n"},
{"review": "\nThis is one of the movies that I regret watching it and waisting my\ntime. Can't agree on one person who thinks this movie was great,\nbecause NOTHING happens in that movie and then it ends on a unfinished\nnote.<br><br>The story about children killing children is a pretty sadistic theme,\nbut the first two movies make up for it! but now that is see that their\nripping money off you I think thats wrong I mean it actually should be\ncalled the \"The Hungergames part 1 of part 3\" NOW DO YOU SEE IT?<br><br>If anyone is reading this before watching! DO THAT, WATCH IT! But\nremember - this part didn't have anything important so you can just\nwait this out and just start from the next movie\n"},
{"review": "\nWow, what a terrible premise for a movie. I made the mistake of getting\ndragged to this movie with a new woman I am putting away so I admit to\nnot seeing the earlier episodes. That being said this is absolute\nrubbish aimed at kids or simpletons. I am a 40 yo straight male and\nthis movie did not interest me in any way for even a second, the woman\nI went with is 21 and she loves this crap(it was very hard for me to\nhide my disgust in both the movie and her) The performances were over\nthe top and terrible, particularly the homosexual host character. This\ncharacter has surely set homos back 10 years , I really thought we were\nbeyond this. ( think broke back mountain , sure there was gayness but\nit wasn't over the top and cringe worthy) The plot was boring ,\nunoriginal and a poor mans Running Man, in fact Arnolds performance was\nOscar worthy compared to this rubbish. <br><br>I cannot believe this series has done so well , it makes me worry for\nthe future of mankind . This is A grade tripe.\n"},
{"review": "\nStop doing these Part 1s and 2s. And why do you have to have a 2 hour\nfilm about making commercials for a revolution? That is the only thing\ngoing on. Jesus, and then JLaw keeps crying on about Peeta. Why is he\neven called Peeta? What a stupid name. Every name in this film is\nstupid. <br><br>I mean, why not call him Peter? Parents who call their kids Peeta\nshould be arrested. I bet some parents are calling their newborn son\nPeeta at this very moment. <br><br>I can't take anything seriously when I hear the name Peeta. This film\nwould've at least gotten 2 stars from me if he was called Peter\ninstead. P.O.P Hold it down! Pimp Squad 4 life!\n"},
{"review": "\nWhat did I expect? The Hunger Games concept is a copy of Battle Royal.\nWhen a writer is trying to develop the concept to be something else\nthan young people killing each others - well - the result is quite\nboring. This movie could have been a 15 minutes intro to the next\nmovie. In order to add some excitement they are adding small scenes\nthat have nothing to do with the story or the story boarding. <br><br>I have forgot all about the characters from the last movie - and I\ndon't care. The only thing I can do is to be amused/entertained by\nDonald Sutherland's evilness. <br><br>Jennifer Lawrence is not a bad actress at all - but her acting skills\nare not sufficient to save this movie alone. Although Philip Seymour\nHoffman is/was indeed a great actor is role is to small as well to make\nany difference.<br><br>This movie is a disappointment - and they are \"milking the cow\"\nshamelessly.\n"},
{"review": "\nWhat a waste of my time this film was. The acting was so flat you\nwonder whether the director also slept through it all. Indeed, we all\nknow the actors are good but, watching them in this film, you'd think\nthey're straight out of a failed 2nd grade sitcom. There is no tension\nwhatsoever, no excitement, no suspense, no life.<br><br>The storyline is even more boring than the acting and the special\neffects are like watching paint dry. <br><br>What a load of drivel the dialogues are and don't start me on the music\nwhich is no better.<br><br>Looking at the 7.5 IMDb user rating I now know for sure that the\nstudios have fake user accounts to cheat the IMDb rating. Looking at\nmetacritic high scores also demonstrates what goes on in this movie\nbusiness/PR/marketing. Some people are definitely corrupt.<br><br>OK it's my fault: I know better and should have left the theatre and\ngone to bed earlier.\n"},
{"review": "\nThe movie has barely any substance to it at all because new line\ncinemas had the genius idea to make the slowest, shortest and worst\nbook into 2 parts. The plot consists of Katniss finding a bunch of\nnothing and talking to people once. She barely does anything at all\nthat genuinely has anything to do with the plot. The movie is abysmal\nat best and should be avoided so movie companies stop ruining finales\nby splitting them into 2 parts. The same thing happened with Harry\nPotter. Part 1 was slow, dull and overall, a horrible experience. The\nHunger Games: Mockingjay Part 1 follows the same pattern. Maybe the\nsecond part will be OK, but based on the first two movies, I wouldn't\nget your hopes up.\n"},
{"review": "\nI enjoyed the first two parts and was completely surprise by this one.\nThe script is bad, the rhythm of the story is very slow and I didn't\nunderstand some of the things that happen there. Why is she not in love\nwith her boyfriend anymore and suddenly she loves Peeta? It doesn't\nmake sense. Also, her performance is really bad and the other actors\nare not doing better either. Almost nothing is credible anymore. And\nsince the script does not have a clear continuance, I almost forgot\nwhat happened in the first two parts. Really bad, I watched it hoping\ntill the end that at some point it will get back to its 'original'\nrhythm and to a better performance of the actors.\n"},
{"review": "\nThey stole the entire movie from Kenta Fukasaku's Battle Royale II\"\nRequiem, which was fantabulous creation. I never knew they were such\ncheats. Guys do check out Kenta Fukasaku's anime version of\nCinderella... And you'll know all.<br><br>They've got whole storyline running from there. It's just that it's not\nthe Japanese masterpiece this time. Kenta Fukasaku's original is really\nold one. They needed people's attention and praises so cheated whole\nthing from someone else. How cheap, isn't it?<br><br>Fukasaku Sr. is no more I guess... But still I think his works are\nworth an applause. Maybe it's just because am a big fan of classic\ncinema but this is too much. Never ever gonna watch this Lion$gate's\nversion. I feel bad for Fukasaku.\n"},
{"review": "\nI came out of the movie theater annoyed, and I felt like I wasted my\ntime. The acting wasn't very good, and the plot felt like it was moving\nat an extremely slow pace. The action scenes were cheesy, and nothing\nactually happened besides rescuing the captured tributes. This being\nshortened into a one hour movie in my opinion would have been much\nbetter.<br><br>The movie should be renamed, 'Minor Stuff goes on in a bunker for 2\nhours: The Movie'<br><br>I really hope the next HG movie makes up for this one. All of the\ndialog was cheesy, and unrealistic. A 3 hour Mockingjay movie would\nhave been much better.\n"},
{"review": "\nYes i read book, but i do not think this affected my opinion about the\nmovie.<br><br>Acting was terrible, i have no doubt that Jennifer Lawrance will be\nnominated for Razzie award for this terrible performance.<br><br>Plot was insufferable and worst of all, the idea of cutting the movie\ninto two part was just meaningless. Great Julianne Moore, even you can\nnot save this bad, bad movie.<br><br>Obviously, they extended so many line just to make sure that they have\nenough ''minutes'' to make a movie, that's why we watched so many\nboring dialog and so many bad acting.\n"},
{"review": "\nAwful film, could easily have been reduced down to about 10 minutes.\nInstead it drags on offering you nothing for entertainment, character\ndevelopment or intrigue.<br><br>I love this franchise but they have left me feeling jaded by the\nruthless money-grabbing approach of splitting the book up into 2 parts.\nNothing happens. NOTHING HAPPENS, and it is full of deliberately long\nscenes and scene repetition. They then even had the gumption to tease\nthe exciting scenes that will in the next film at the very end. Left\nwanting more but not in the good way \"that was amazing, I don't know\nhow I will survive the next 12 months waiting for the conclusion\" way.\nIts a bit more \"this Big Mac really doesn't look as exciting or\ndelicious as it does in that poster\". Save your money, wait for part 2\n(something will actually take place in that film)\n"},
{"review": "\nLESS than awful it's really a zero but I can't even give it that.\nAbsolutely trash, they should have never made the first movie, let\nalone this one and the following movie they're making now! Don't even\nbother going to see this heap in the theaters. wait till it comes out\non DVD/blue-ray, don't even bother PAYING for those either, as it will\nencourage them to make more garbage movies like this and the first one.\nSave your hard earned money and go spend it on something much nicer for\nyourself or someone else you care about. This movie and the previous\none were and are EPIC fails. Part 2 will be more of the same, don't\nfall for their tricks again people. This movie series is one of the\nworst ever of the last 20 years!\n"},
{"review": "\nThere was nothing to watch. I don't know how you can sell a movie by\ndoing some close up shots of Jennifer Lawrence in leather tights. It\nwas just plain stupidity in every scene. Same old revenge drama with\nhalf side shaved heads, war torn buildings and desperate attempts to\nsell its viewers the idea that its a master class. At least should have\nshown some respect to the book from which its taken. This movie should\nbe shown at some fashion shows during couture week may be it can get\nsome applause there. The movie was so boring that gradually the whole\ntheater started booing and and walking out of there shaking their\nheads.\n"},
{"review": "\nThey're totally different in mood, feelings, and content. Hunger Games\ngets to see a female lead and one who doesn't have to use sex or\npromiscuity to be powerful! That alone makes this book/film franchise a\nwinner in America. People, please remember that most stories are merely\nadaptations of other stories told before, just like with Cinderella,\nAlice in Wonderland, A Christmas Carol, etc. There have simply been too\nmany creators writing for too many years for anything to be truly fresh\nand original anymore. Almost every story you read or film you watch is\nlifted from a story told before (think about Disney-Almost none of\ntheir films are original, yet everyone loves them!). So while you're\nbashing all of the Rip-Off artists, like Suzanne Collins, just think\nabout how many of your favorite books or films may have been stolen\nfrom someone else's idea, perhaps even hundreds of years ago.\n"},
{"review": "\nThe Hunger Games: Mockingjay - Part 1 fails to bring any of the\ncreative fun of the second Battle Royale movie. This second one is\npretty juvenile, coming across as mainly a trite rehash of the official\nBR sequel (and a bore). Jennifer Lawrence, who was captivating in the\nfirst ripoff, is too fine an actress to be treated to such a\nthoughtless and obvious plagiarism. I suppose we will watch the third\ninstallment in two parts just to see how BR2 turned out, but hopefully\nthe creators will make a production that exceeds this by-the-numbers\ncopy job.<br><br>An absolutely horrible movie. Wheres's the fighting to the death? No\nviolence, no particular plot line to follow. Very poorly made movie.\nThe only thing that impressed me about this movie was that I managed to\nstay awake for the whole thing.\n"},
{"review": "\nI really enjoyed the first two films, and was looking forward to the\nnext installment. However all I saw was 2 hours of Jennifer Lawrence\nlooking either angry, miserable or crying. There didn't seem to be\nanything of value to make this an actual independent film. When all is\nsaid and done this film will be the one out of the boxset which\neveryone will just skip. I don't see how they couldn't make mockingjay\njust one film, even if it lasts 2 and a half hours. I haven't read the\nbooks so I'm not sure how much is left to see but nothing happens in\nthe film. This could have easily been cut down to 30/40 minutes. Very\ndisappointed and highly unlikely to go watch the next installment.\n"},
{"review": "\nReally not that much to say. This is one of those films that I would\nmuch rather rent, at which point I could have fast-forwarded through\neverything. The story did not peak at any point. Incredibly\ndisappointing. <br><br>When the film ended you could hear people in the cinema saying \"that's\nit?\"<br><br>Granted, some of the emotional scenes were quite good and the actors\nare all decent. However, this is one where the production is to blame.\nThe director clearly had no clue what he was doing.<br><br>The two previous ones were much better. This might actually explain why\nthe cinemas are getting emptier by the year...\n"},
{"review": "\nEven though i went in to the movie pretending i was watching an\nentirely original movie, this remake was awful. The plot was ALMOST the\nsame but he changed things that shouldn't have changed but kept small\nthings exactly the same. The ending was a \"cliff hanger\" type ending to\nsucker the audience. Donald Sutherland i usually love his acting but in\nthis movie he was almost like a cartoon character villain. Francis also\nunderemphasizes the blood, death, genocides and gore. The speech scenes\nalmost look all way too rehearsed and are lifted straight from the\nshoddy English subtitles of the Hong Kong DVD of BR2. Overall the plot\nchanged made the movie less believable for me and ending definitely was\na way of \"suckering\" the audience.\n"},
{"review": "\nWatched the movie today and sadly it didn't add up to my expectations,\nand the hype that everyone was making. It is very dull. They wasted\ngreat actors like Julianne Moore. The whole movie is just all over the\nplace. I think there was only one arrow shot. They didn't even show the\ncinematic effect of the bombing of the rebel base. Just some reaction\nof the actors-- not enough. I'd like to remember some scenes while\ndoing this review, but none really stood out, just the face of Katniss\nwith a confused face.<br><br>Really, this was the first from the HG franchise that I watched on the\nbig screen, expecting it to be y'know, better than the first 2. But,\nnah I'll just keep on remembering the scenes from Guardians of the\nGalaxy and looking forward to The Battle of the Five Armies.\n"},
{"review": "\nIt is one of the most boring movie...no meaning...senseless and i don't\nunderstand some people who judge this movie because of the acting of\nmain actor?!?!?! Who is responsible for wasting two hours of my life\nwith such a loser subject? Maybe the game is famous and beautiful to\nplay and this loser director should create something more nicer than\njust a game and i realized that this director is good to spend money\nfor fake empty boring senseless ideas. I didn't understand anything\nwhat happened. I don't know what is the idea of this movie, what is the\nsubject or what is the moral. I cannot tell even to my friends what\nhappened in these two hours with this Katniss or Peeta or other amateur\nsoldiers with their pretending moves. I would punish this director not\nto have chance to make a movie again in his life.\n"},
{"review": "\nKatniss criticized her sister went back to save her cat and said the\ncat was stupid cat, her sister can do whatever she wants. I really hate\nher with no mercy with animals, and acted like she was kindhearted in\nthe movie, such a hypocrite. Jenifer Lawrence's acting was awful, for\nexample, at the beginning when she step on the skull, that is not how a\nperson will act in real life, face expression is more complex than just\ncover your mouth and shred a tear, for people who are more emotional\nunstable they would even hold their fists so tight and tremble, but her\ncharacter does not fit in this category and she has experience of\nseeing dead, so all she needed to act is complex face expression.\n"},
{"review": "\nThis film gets the primary goal for its creation: to MAKE MONEY.<br><br>They had to use 2 parts in order to sell lot of tickets, twice if\npossible, and to do that they dedicated to extend EVERY POSSIBLE SCENE\nto a lenght and tedious dimension I thought I would never seen in this\nmovie series.<br><br>From the moment I saw the trailer, I started to suspect, but with the\nbenefit of the doubt, went to the theater and man, what a\ndisappointment.<br><br>It does not deserves a 0/10, lets make this clear, because the acting\nis not bad. But it does not deserves, in my opinion, more than a 4/10,\nsince we have been given HALF MOVIE.<br><br>I feel robbed, and I feeli should be allowed to see the second part FOR\nFREE.\n"},
{"review": "\nIf i were you i wouldn't go to the cinema, I've already wasted my money\ndon't waste yours too. The division in two parts is merely commercial,\nthey haven't earned enough money with the first and the second movie\n(sarcasm). In principle the division could have been a good thing for\nthe scenography, the narration and so on, but they have cut the story\nin the wrong point. In the end we have a slow and boring movie. In the\nmost of the film there wasn't any action, just one arrow is shot by\nKatniss through all the movie! And in the majority of the film there\nwas no tension. I didn't like the scenography, i.e. what they have\nchosen to play. The book is so much better. So, my advise is: Buy the\nbook and read it, Don't Watch this crappy movie!\n"},
{"review": "\nThis movie was both boring and disappointing. Those calling it the\n'Best Games yet' are i believe paid. This was not the best games yet,\nCatching Fire is 10 times better. Total waste of money, there were some\ngood parts but thats not enough for the overall movie. And Jennifer\nLawrence's acting was just boring, not enough character in there\ncompared to her Catching Fire Katnis.<br><br>This film was a total waste of money, and the Part 1 and Part 2 thing,\nis just a grab for money. This isn't Harry Potter or Twilight, this is\nterrible just utter crap.<br><br>Good Day, I'd like a refund\n"},
{"review": "\nThis movie was nothing like the first two. The story really never led\nanywhere. There were a few scenes that were very well executed that I\nreally liked, but for the most part I found myself bored and checking\nthe time constantly. It was a very obvious attempt of splitting one\nstory into 2 movies to increase profits. This movie has no real plot,\nno climax, not even a good cliffhanger. Many scenes were so drawn out\nit was an obvious attempt to just increase screen time to make a full\nmovie. I have to say I found Jennifer Lawrence's acting to be\nparticularly terrible and emotionless in this film. <br><br>Skip the theater on this one, just wait for part 2 to come out and\nwatch them together, or just watch the first 5 minutes of part 1 and\nthen fast forward to the end because nothing happens in the middle\nanyways.\n"},
{"review": "\nSo I was planning on writing a long review about this movie and how\nawful it is. But as I started, I realized it was about to happen again.\nThe producers once again were about to steal my time. So this review\nought to be short and sour:<br><br>1. Story sucks 2. I loved the two first movies. But all that was fun\nabout the first two is gone. What's left is a normal action/war movie\nbut with really poor story and actors 3. It last 2-2.5 hours and has no\nstory. It is super clear they could have merged part 1 and 2 of\nMockingbird into one movie.<br><br>All in all, I feel exploited by Hollywood crooks trying to maximize\nprofit. End of story.\n"},
{"review": "\nSO TERRIBLY BORING MY SISTER BEGAN FARTING TO ENTERTAIN HERSELF I\nPROMISE YOU'LL FEEL FOOLISH FOR WATCHING. YOU WILL HAVE MISSED NOTHING.\nLife is far too short to waste your time watching this movie.<br><br>I'm only writing the further because IMDb required a minimum of 10\nlines.<br><br>This movie is nothing remotely similar to the first two movies. The\nworse of all sequels in a series. It consists of long drawn out rants\nwill literally almost nothing being said or done in the entire movie. <br><br>2 HOURS OF REPEATED NON-SENSE AND DRONING. I mean this honestly,\nacknowledging it might sound extreme; this was the worst film I've ever\nseen.\n"},
{"review": "\nSooooo, this was boring.... Sorry to be blunt and all, but that's just\nthe sad truth I'm afraid. As other reviewers already mentioned...\nnothing really happens in this Part 1. Everything just feels like it's\nbuilding up to something and then there were credits. Kinda like the\nfirst Hobbit movie.<br><br>I liked the first 2 movies of Hunger games. It even convinced me to\nstart reading the books. Books are great... but then again, these books\ncan't be stretched anymore to make more money. Aaaaand the movies can.\nLet's lure more people to the movies, yeah!<br><br>So, if you feel like watching a trailer of about 2 hours... be my\nguest. I'd advice to see the real trailer, it pretty much sums\neverything up. <br><br>Oh yeah acting not bad but mostly forced dialogue. Almost George\nLucas'ish... 3 action scenes that'll wake you up in time before the\nmovies over.<br><br>Can't wait for part 1,5!!!!!!!!!!!!\n"},
{"review": "\ndisappointment in the movie catching fire far superior main reasons for\nlow score 1) lack of action 2)restiant leader was hiding most of the\ntime 3) not good acting 4) lack of plot.<br><br>1st 45 min was so boring almost walked out<br><br>Lots more action in catching fire ,the producers seem to think that\nhardily any action is required in this final part 1.<br><br>Hopefully part 2 will be a lot better ,why this was split into 2 parts\nis beyond me .<br><br>The acting of the main part was mediocre at best<br><br>THe one action which Jennifer Lawrence had was the shooting <br><br>down of the bomber and that was a short lived action part\n"},
{"review": "\nHey everyone.<br><br>I went today to the cinema with pretty high expectatives from i have\nwatched in the past movies(1st wan was pretty fine for me, and 2nd one,\ni think was even better). Leaving behind the fact of poor actings, i\nwasn't even sure if the film that i was watching WHOLE joke or what.\nBut no, the minutes were passing, and i was still at this punishment\nbased really really awful history filled with poorer scripts. I was\ncounting every seconds to get out of that crap. Save money guys! I\nreally mean it!! With that amount of money you would be able to buy a\ncouple beer, hangout with and ugly girl, and you won't regret more than\nhave watched that disaster movie.<br><br>For the last, i have to say. THIEVES!\n"},
{"review": "\nThis is my first review ever, just because the movie was so terribly\nlousy that i had an urge to write something... There are hundreds of\nmovies where you have to suppress the tears just by hearing some cello,\nor some emotional acting. In this one...even they try soooo hard...\nthere is absolutely nothing... no emotions at all, no sparks nothing...\njust never ending meaningless conversations. (Sadly not even the music\ncan fix that) It really is nothing more than a preview for Part 2,\nwhich I certainly won't go to watch it... I wonder how it can get so\nmany positive reviews.... are people really that easy to satisfy, or am\ni asking to much of a good movie\n"},
{"review": "\nI have to admit that probably never looked more boring blockbuster of\nthis. Stretched to the pain, the enforced acting, empty dialogues, in\ntwo hours absolutely nothing worth mentioning, aside from the great\nJames Howard's song sung by Jennifer Lawrence (The Hanging Tree).\nUnfortunately, I was expecting a lot more after the first two episodes,\nalthough we all should be clear when they changed the original decision\nto extend the trilogy in four parts. The horror of this desperately\npoor screenplay could not be mended nor sound actors. Hollywood seems\nto run out of steam... This garbage was never meant to be taken and\ncompany should pay back the money to people and even compensate them\nfor mental anguish and lost time watching this disaster. Big thumb\ndown! (and ready rotten tomatoes)\n"},
{"review": "\n1. The pace is very slow. Literally nothing happen in the first 1.5\nhour. <br><br>2. MockingJay is claimed to be \"unique and irreplaceable\". But she has\nabsolutely no ability or leadership skills or braveness or what so\never. Basically a useless character in the movie. <br><br>3. No thrilling fighting except for a large group of people crying,\nshouting, or running for no reason. <br><br>4. MockingJay is supposed for fight for the whole district. But her\naction is solely based on her selfish emotion for her boyfriend. <br><br>5. Graphics and sound are mediocre. <br><br>Absolutely the worst movie I have seen in the past few years.\n"},
{"review": "\n\"Besides shooting an arrow at a jet which is shown in the trailer all\nKatniss really does is Propaganda Commercials and cry over things\" Said\nbest by another reviewer Daniel.<br><br>It's boring. I got up to get a drink 3 times just to get over the\nboredom. I got really tired of Jennifer Lawrence's piercing stare and\ncrying fits. The whole movie is one self aggrandizing infomercial about\njoining the rebellion. There is very little to like about the movie. It\nis nothing like when the games are going on. I would like to write more\nabout how bad it is but I just draw a blank. It's a forgettable movie,\nprobably best remembered as Phillip Seymore Hoffman's last film.\n"},
{"review": "\nDo not waste your time and money by going to this movie. I haven't\nwatched the previous parts but I knew the story. The whole story could\nbe told in 5 minutes. Nothing new in new series, while the old one\ndidn't have much! I understand the movie was probably targeted for\nyouth but I love to watch cartoons that are for kids. The only nice\nthing in this movie was the main actor Jennifer Lawrence who looked\nbeautiful but it is not limited to this movie (She looks gorgeous on\nany movie she played or any media).<br><br>I wish there was score ZERO so that I could vote it for this movie.<br><br>The worst movie I have ever seen in Movie Theater by far!\n"},
{"review": "\nIt's not entertaining like the previous movies, a lot of talking and\ndialogues in a bunker, they just extended the franchise to make more\nmoney and I'm not gonna watch the next one in the theaters, very\ndisappointing!!! Jennifer Lawrence acting was good, in some parts it\nwas a bit, just a little bit exaggerated. But overall I think she did a\ngood job. Some parts were so cheesy and bad that were very amusing. I\ncould hear people laughing at some ridiculous scenes.. The typical\nlaugh you hear when you're watching a BAD movie. I think this is an\nexample of how a studio wants to make more money by extending the\nfranchise. You can tell the budget wasn't big, yes there are some cgi\nand special effects, but it looked very average. I felt asleep in some\nparts as well. Bad movie, I don't recommend it whatsoever!!!\n"},
{"review": "\nThere is nothing to tell about this move. it is a test to your\npatience. I did watch hunger games films. This was a worst movie i saw\nrecently. it is just 2 hour narration of same piece of information\nagain and again, again and again. movie won't go further and do not\nexcept a single action sequence even though in the movie, there is war\ngoing on as part of story. from begin to end, all they did is just\ntalking in different places ( a bunker or ruined building or near a\nlake). <br><br>only scenes I liked were fights carried by rebels against capital.if\nyou are going to this film do't dare to have any expectation. i hope\nthat they will make part 2 in much better way.\n"},
{"review": "\nThis is my first ever review on IMDb and wow can I just say this is not\nworth watching. <br><br>The acting is beyond tame in comparison with the first two movies and\nit has been dragged out beyond believe!<br><br>I was even in the so called cinema listening to people crying with\nlaughter some how at scenes which were supposed to be emotionally\nconstructed! <br><br>The only respectable appearance was from Josh Hutcherson aka \"Peeta\nMellark\" who should have more of a role as he gave some substance to a\nfilm which was made as a money spinner and has ruined my film\nexperience!<br><br>3/10 is very generous!\n"},
{"review": "\nThe direction in this film is pretty solid, and the visuals are\nimpressive.<br><br>Unfortunately it falls down in every other area. It's slow, boring,\npredictable and unbelievable. The reactions to Peeta are severely\nunconvincing. Seriously? In his situation that's precisely what would\nhappen and everyone would understand that, but there has to be tension\nbecause of Teenage Drama (TM).<br><br>Yawn. It started off with a sub Battle Royale conflict and went\ndownhill from there. The books aren't much better either, although the\nfinal ending is mildly amusing.<br><br>Go watch Maze Runner instead - it's a decent film, and an improvement\nover the books.\n"},
{"review": "\nVery shallow and trivialized storyline with no depth to the acting. The\npace was slow and the content thin. Moviegoers are tired of being\ngouged by greedy studios. The splitting of the movie into 2 parts with\na 1 year intermission just does not work well. The split ending was\nvery abrupt as well with no real incentivized cliff-hanger. In my\nopinion one of the worst teenage disasters of 2014 by far. Shameful\ncharacter development and a huge waste of money and manpower. Many will\nbe disappointed with this poor effort at depicting what could have been\na great story and potentially captivated audiences. My friend woke me\nup twice and caught me snoring in the middle.... Hunger Shames :(\n"},
{"review": "\nIt is a 2 hour film packed with Jennifer Lawrence's constipation face\nand nonsensical drama. Poor story telling and filled with numerous\npointless shots. The tension between Katnis and Coin was never revealed\nclearly. On the other hand, the bombing from Snow never occurred to\nKatnis that she is indirectly responsible, yet she's still manipulated\nby the 13th District propaganda like an idiot. Extremely poor suspense\nscenes, thundering music when Katnis' sister was rescuing a cat? For\nreal? I just feel obliged to write a 10 line review... There's\nliterally negligent amount of action in this \"action-drama\". If I'd\ngive the 2nd installment a 6, this one deserves a 1.\n"},
{"review": "\nThis absolute turkey was right on time for Thanksgiving. Do not go to\nsee this, unless you are under 15, or an absolute die hard fan of the\nfranchise. She plays the weakest superhero since Tobey Mcguire in\nSpiderman. This film is painful to sit through. Very, very little\nstory. Although in general I like Jennifer Lawrence, in this film she\nreally missed the mark. She displays little in the way of power,\ndignity, grace, or inspiration. It is very poorly written, the\ncharacters are becoming very tired, and the entire enterprise lacked\ninspiration. I could not more heartily encourage you to avoid seeing\nthis turkey. It was very hard to sit through.\n"},
{"review": "\nThis review will be very short and to the point, if you don't agree\nwith this you're kidding yourself.<br><br>The movie was slow, just like the others. It was boring, just like the\nothers. There was nothing interesting happening at any point in time\nduring the movie, and the fact that it was so long was even worse.This\nmovie was almost like a very long, and expensive trailer, advertising\nthe final movie (which no doubt will also be terrible). The movie was\nalso very predictable, nothing really came unexpected, which made the\nmovie a whole lot worse.<br><br>To sum up, the movie was terrible, slow, predictable and most of all\nboring. 3/10.\n"},
{"review": "\nNo I'll give this movie a 4. I'm just so disappointed. The book is\nsomething totally different...of course they can't make the book to a\nmovie, it would be 1000 hours long but they missed a few good scenes in\nmy opinion. I think Elisabeth Banks really brought the humor into this\nmovie...Jennifer Lawrence played OK, she was quite absent, she could\nhave done the part much better! Liam and Sam was good but it didn't\nwork all the way for me. It's worth to see if you're a reel Hunger\nGames fan and have read the books so you know the story behind it and\nso on...for a real movie lover this is not the one to pay for in your\ncinema!<br><br>I'm a fan of Hunger Games so don't judge to much.This gave me a\nreminder to always read the books before seeing the movies.\n"},
{"review": "\nThe 2 first movies of hunger games were awesome. But this 3 movie was\nreally boring. A movie made for money purpose I think. <br><br>There was no action like the 2 first movies, and the history of the\nmovie was really simple and boring. <br><br>The acting was good though, but its not enough.<br><br>A movie for me is good when I get inter tainted. <br><br>By that I don't mean only laughing, but a range of all the emotions.<br><br>I give it 3 out of 10 stars.<br><br>I gave number 1 7 stars and number 2, 8 stars.<br><br>I think some people like it because they have read the book, and\ntherefore can relate to it.\n"},
{"review": "\nI have read this series and the 3rd book was a let down, seemed the\nauthor was rushed to write it in a week - so disappointing ant\nMockingjay 1 is the same. Any part that could have been exciting they\ndidn't show. So many errors that I could not even believe would happen\nin real life - wont spoil it but anyone intelligent can see the HUGE\nmistake done by the army. This would never happen in true life! Okay I\ngotta say - they rescue Peeta, were able to fly out of city with no\nproblems!! Then they leave Katniss alone with him??? Really?? No red\nflags??? DUH!! Summary - main character cries for more then 75% of\nboring movie!\n"},
{"review": "\nI have to admit that probably never looked more boring blockbuster of\nthis. Stretched to the pain, the enforced acting, empty dialogues, in\ntwo hours absolutely nothing worth mentioning, aside from the great\nJames Howard's song sung by Jennifer Lawrence (The Hanging Tree).\nUnfortunately, I was expecting a lot more after the first two episodes,\nalthough we all should be clear when they changed the original decision\nto extend the trilogy in four parts. The horror of this desperately\npoor screenplay could not be mended nor sound actors. Hollywood seems\nto run out of steam... This garbage was never meant to be taken and\ncompany should pay back the money to people and even compensate them\nfor mental anguish and lost time watching this disaster. Big thumb\ndown! (and ready rotten tomatoes)\n"},
{"review": "\nFirstly, i gotta point out that seeing \"Part 1\" in the title is already\nan upfront (and somewhat prejudgment) letdown. I rarely see and fond of\nthe sequels except for Godfather, animated features AND The Hunger\nGames as the books are so good. Although, i didn't expect they could\nbring the whole book into the screen, i expected it to be AT LEAST able\nto keep it up with the first two. But no, every single scene is\nstretched out to meet the requirement of minimum length for a feature\nfilm. The film is darker than prequels so imagining it's just getting\nlonger and longer without a purpose, its very frustrating.<br><br>3 stars rating is for the acting as the cast has fulfilled their roles\nbeautifully as always. Yet, due to the unnecessary length, somehow it\ngets downgraded. Also, the music is good and getting along very well\nwith the content.\n"},
{"review": "\nThe movie goes so slow you can pretty much skip this one and go\nstraight to Part 2. The whole movie can easily finish in 20 minutes. 15\nminutes into the movie you can tell there is something fishy about the\npace. I like Jennifer Lawrence but this movie warns me from jumping\ninto watching her movie next time. Pretty much all the reviews about\nthe slow pace, set up for pt 2, boring, poor acting are true.<br><br>you can easily tell a few screens repeat for no particular reasons. The\nnumber of exciting screens are very limited. <br><br>I give 6 stars for the movie and minus one star for grossly deferring\ncontent to Part 2.\n"},
{"review": "\nDon't get me wrong. I liked the Hunger games franchise a lot. I\ndefended it even when my buddies criticized certain moments in the last\nmovies. But in this movie I have to draw the line. everyone can clearly\nsee that the separating of the finale in two parts was not necessery.\nThis movie is just a 2 hours trailer for the finale. The only scene\nworth watching is the one that climaxes with Katnis shooting down a\nplane and that can be seen just by watching the trailer. I can think\nonly two reasons they made this Part 1 movie and there is no way there\nis a third. Either to make more money by two separate movies instead of\none, or because they wanted to put all the unessesary melodrama in one\nmovie and keep the action for Part 2. Or both. Either way the 2 minutes\ntrailer was very promising and the 2 hours trailer we watched was very\ndisappointing. I am tempted not to sit down and watch Part 2 just from\nthe fear that it may be half as bad as Part 1. And Part 1 was\nreallyslow and Bad. Dull and Bad. Its BAD!\n"},
{"review": "\nI was in the middle of the movie and suddenly it looked like the matrix\nstory but in an awful way. I closed my eyes few times and was about to\nleave the room. I am not sure why the decision to cut the movie in half\nother than making money. They knew that the story is broken and the\nonly way to make money out of these poor kids is by doing this.<br><br>It was lame, boring and very slow. No action, no romance, no suspense,\nand no story.<br><br>I think what they should have done is to end her role in part I. After\nher web scandal, she lost lots of credibility and her caricature as a\nmodel was destroyed. The upcoming role should be given to her sister,\nand then they might have something to grab on in the upcoming years. It\nwould be hot, challenging and differently tons of suspense.\n"},
{"review": "\nFirst of all I didn't read any of the books. But I liked the first and\nthe second movie. <br><br>The plot is really what's holding the movie back. The acting, the\nscenery and the overall editing are great. The plot is really boring.\nHowever there are some great ideas which aren't really elaborated. In\nmy opinion the movie shouldn't have follow the book so strict. It\ncould've taken some liberties and explore the ideas more adequate. <br><br>Then there are some new characters which aren't really introduces so I\ndidn't feel attached to them. Other characters, I really liked, from\nthe second movie appear only for a couple of minutes and don't add a\nlot to the overall plot. Although they really seemed important in the\nsecond movie. <br><br>Another thing that bugs me, was that every 10 minutes or so someone\nstarted to cry. I get it, it's a tough life but I don't enjoy watching\na movie about crying kids. <br><br>Short: The movie has some good moments but overall it lacks something.\n"},
{"review": "\nThere are a few good actors/actresses in this film, yet their acting is\nincredibly stiff/emotionless. There is no action at all throughout this\nincredibly predictable film. It's very slow and obviously a stretched\nout film to make money, there was a section where they could have done\na nice battle scene, yet all you saw was an emotionless actressess\ngiving calm, pretty obvious orders. <br><br>The plot was incredibly basic, a very poor 3rd film in the story. Why\nthis lastest for 2 hours i don't know, they could have easily cut this\ndown to 15 minutes.<br><br>If you have trouble sleeping, go watch this film.\n"},
{"review": "\nThis is like an audio book on a movie screen. You have a few cursory\neffects here and there but for the most part you have to use your\nimagination. Imagine The Avengers except instead of seeing the Hulk\nsmash things you just watch Robert Downy Jr. tell you about it for 90\nminutes. <br><br>So now, imagine that the bad guys in the capital are flying down to\nbomb district 13! Sounds exciting right? NOW, imagine everyone runs and\nhides in a bomb shelter, and all you see is a few blips on a radar\nscreen and some dust falling from the ceiling. Yes, they literally show\nnothing of the bombing, not even a plane flying overhead! <br><br>BUT, they all crawl out of the hole and find the bombed district, they\ndon't walk around it, they just stand in a crater and look dumbfounded. <br><br>Look, my girlfriend fell asleep and asked me what she missed when we\ndrove home, i said \"nothing\"... no seriously, nothing happened... \"stop\nbeing an ass\" she says. No, really, they lived, peta tried to strangle\nher, it was stupid the end.<br><br>SERIOUSLY THATS IT.<br><br>THE END.\n"},
{"review": "\nHello people,<br><br>I was such a huge fan.even considered getting myself a\ntattoo(mocking-jay) then I watched the movie.Utter disappointment.it\nwas boring,long and lacking action.<br><br>It felt like the others mentioned like watching a long long\ntrailer.When the movie ended everybody was like:''no way.is that\nall?''.<br><br>Don't get me wrong,I truly loved the first 2 movies but this one could\nhave been easily scraped.The whole idea of splitting the movie into 2\nparts backfired.Should have been 1 movie.Disappointing.Let's hope the\nnext part will be better.Peace!\n"},
{"review": "\nNothing happens in this movie. From the very beginning you get the\nclear feeling that you should adore Katniss, or care about her - this\nis ALL that happens in the movie. We get to look at her blank,\nemotionless, stale expressions that only change once through the movie.<br><br>And that's only when she laments over that idiot week-kneed Peeta,\nwhile she avoids Thor's brother, a guy who is WAY WAY WAY better\nlooking and smarter and more common-sensed...<br><br>But what scenario, and what tastes, and what story can we expect from a\nplagiarist? Brainless authors can only generate no-brainers...<br><br>This proved to be worse than Twilight - and that says a lot...\n"},
{"review": "\nAfter watching Hunger Games original and Catching Fire, I honestly had\nhigh hopes for this movie. I must say that I was disappointed greatly\nas the plot was dull and painfully slow to the extent of the movie\nbecoming stale. I felt as if I was paying money to see President Coin\nmake speeches or Katniss getting interviewed by a camera. The plot\nisn't horrible by any means, but the whole movie has a lot of\nunnecessarily long scenes, and yes, I am referring to the speeches and\ninterviews. I felt that will such a painfully slow movie, it would have\nbeen better had they decided to launch Mockingbird as a whole, but\nmoney I guess. The acting is not horrible, don't get me wrong, but a\nreally, really slow and boring watch really doesn't get me rolling over\na movie. If anything, I am not convinced into watching Part 2 when it\ncomes next year.\n"},
{"review": "\nAfter paying $48 for three regular (not even 3D) admissions and $30 at\nthe concession stand, we sat patiently for 2 hours waiting for the\nstory to unfold when the movie suddenly ended. What's going on?!! Did\nyou ever go to a very fancy restaurant that served tinny portions of\nmediocre food? Well, walking out of this movie sort of felt like that:\nan overcharge and a big letdown.<br><br>The whole movie could have been edited into 15 minutes, but the actors\n(all except for Jennifer Lawrence and Woody Haroldson, whose acting is\nunapproachable) intentionally act and speak slowly to stretch the\nrunning time of the movie. Mockingjay Part 1 is just a bad trailer for\nMockingjay Part 2 to be released probably next year, but after seeing\nthe trailer, I'm not sure whether I want to see the real movie.\n"},
{"review": "\nGoodness gracious, Follywood's ripoff dodos are at it again! Will they\never stop?! Just as if stealing the title from the Japanese original,\nBATTLE ROYALE II: REVENGE is not enough, do they have to conform to\ntheir own stale formula-fares each and every time?? The story isn't\nmuch to write about. gruesomely violent, except its been retooled for\nthe PG13 crowd (aka the diaper brigade).<br><br>The only good thing about this movie is that they spent tons of cash on\npromos (thereby making at least their vendors rich). Of course, its the\nlatest Follywood \"thinking\" (?!) -- promote a film to death, recovering\nall the costs before the audience realizes what hit them. Fortunately,\nmultiplex audiences in India, The Middle East and most of Asia nowadays\nare too smart for that.<br><br>And in NJ/NY, the movie tried hard to package itself as a new \"Phormula\nFor An Instant Headache\". But the renowned pharma companies like\nPfizer, Merck and Eli Lilly instantly rejected that idea as old\n'mad'-icine in a new tedium. Tough luck.\n"},
{"review": "\nEven worst than first two movies ! Not what you expect at ALL ! Zero\naction scenes, after all its a sci fi and action movie ! at least some\nnice fighting scenes ! Just lagging scenes, drama drama, bla bla,\nuseless scenes just to fill the time, just like a loooong introduction\nto the part 2 movie !<br><br>Even if considered as a drama and love story, it still lacks lots of\nthing, and acting of Philip and Julianne is bad, it's like they are\n\"acting\". I just wonder how it got some high ratings, don't advice to\nwatch unless u need to know a little what to expect from next part, but\ni doubt u'll need it cause nothing much to get from this movie.\n"},
{"review": "\nHad they told us \"We are going to ruin the series, we don't want it to\nsucceed\", then this movie would have been a blast, it would have\ndelivered.<br><br>I am truly impressed on how they managed to connect the second movie to\nthis one with the fantastic cliffhanger (of the second movie)\ntransitioning to the third part. The third part has no plot relation to\nthe first two movies. None of the important points that were started in\nthe first and second movie are addressed here. I am challenged with\ndescribing everything that is wrong with this movie.<br><br>I truly wanted to review this movie as professionally as possible, but\nthe writing and directing of the movie don't even give me material to\nwork with. If you want to truly understand how disappointing this (bad\nexcuse for a) movie is. Go see for yourselves.\n"},
{"review": "\nBesides Noah, The Hunger Games: Mockingjay - Part 1 was the worst movie\nI have seen from 2014. The repetitive boring nonsense that made up the\nfilm literally put me to sleep. The movie followed this single formula\nfor the entire film: 1. Make Katniss propaganda movie. 2. Show people\nin Districts get mad at Capitol. 3. Capitol gets mad and either attacks\nthe districts, makes Peeta make a propaganda film, or both. 4. Repeat.\nIt is also completely ridiculous how stupid the final attack from\npresident Snow is. How was Peeta going to kill Katniss when he knows\nthere are going to be guards around her? Why didn't he hypnotize all of\nthe other tributes? Why didn't he just say, \"Bring Katniss here or I\nwill kill Peeta.\" Then send videos of Peeta being tortured to District\n13 and drive Katniss crazy? The whole point of \"Hunger Games\" is so\nthere can be actual \"Hunger Games\"! Not some boring political bull\nsh*t. The first movie was entertaining. The Second was an improved\nversion of the first. The third was a boring pile of sh*t.\n"},
{"review": "\nThis film starts out with some simple drama that is not very\ninteresting. The entire first hour of the film could have easily been\nconsolidated to 20 minutes without effecting anything. On top of this\nthe acting in the first half was horrific. I'm not sure if the actors\nare to blame or the director. If I had to do it over, I would wait and\nwatch this on Blu Ray right before the final movie releases next year.\nSave your money and the frustration of sitting through the first half\nof this film. <br><br>The second half picked up nicely and we got some story. The acting\nimproved and things started to seem OK. The problem is that I was\nalready half asleep by the time anything happened so I really didn't\nget absorbed into the movie. I think this is a clear example of how not\nto break up a story and it is obvious they were simply trying to\nstretch things out to accommodate an extra box office release.\n"},
{"review": "\nVery rarely do I agree with the majority however in this case anyone\nwho calls this film a \"triumph of cinema\" or \"fantastic film\" needs a\nslap. $250 million budget across Part 1 and 2, Part 1 having been made\n(I can only assume) with say $30 million of that. So I now expect Part\n2 to have over $200 million worth of quality. I may not even watch Part\n2, like I said in the title I have almost completely lost interest in\nthe franchise due to this film being so utterly boring that only the\ncringing from Lawrence's overacting stopped me from falling asleep in\nthe cinema. <br><br>The entire film centered around Katniss' transformation into the\nMockingjay (something that whether you've read the books or not, KNOW\nis going to happen) So to make it a 2 1/2 hour ordeal is just offensive\nto the viewer. Two and a half hours of Lawrence whimpering (Like the\nleader of a rebellion should?) I'd rather watch Two and a Half Men.\n"},
{"review": "\nThe 2 is for some of the sets. The rest of the film could just barely\nreceive a 1 if I was feeling seriously generous or off my head on coke.\nI suppose that would be a great way to watch this dribble. Made for the\nmindless moron teenagers of America and they got what they deserved.\nWhat a load of total hogwash and bad acting to boot. Lawrence is\npainfully stressing us with her over the top attempts to show pain and\nsolidarity with the poor and downtrodden. Total FAIL! She is just not a\ngreat actress. That is is all one can say. The plot or story or\nwhatever this is, is pathetic and Sutherland is a wasted talent here\nand even he is finding it difficult to portray his role. Someone like\nthe director may have to be blamed for this mess. Anyway, who cares is\nultimately the big question. This stuff should never have been made.\nFor those of you who actually liked this film I suggest a visit to your\nshrink or better yet go out and get seriously plastered and then watch\nit again and maybe you will see how awful this garbage really is.\n"},
{"review": "\nThis movie was very slow and draw out...not as good as the others. It\ntook forever to explain what they were doing and to get to anything of\nexcitement/the action in this movie.<br><br>If this movie had been the 1st hunger games, the entire series would be\nin trouble. With the success of the previous movies, maybe this one had\njust too much to live up to &amp; that didn't happen.<br><br>Nothing about this movie will leave you talking or craving the next\none. Katniss made her name from her survival skills, the movie made us\nyearn more because of the action and neither of these surfaced for the\n1st hour or 2 of this movie.<br><br>Slow and Disappointing. Their plan of setting up a plot for future\nmovies was fine, however they didn't have to make this one so boring to\ndo so.\n"},
{"review": "\n....or not. After 2 movies you would think the main character has\nevolved. Well, she didn't. Constant whining and uselessness push the\nspectator away to the point that you don't care about Katniss. You\nactually get tired of her.<br><br>Spoiler - <br><br>And to top it of, the scene with the cat during the\nevacuation...*facepalm* Why would the director try to add to the\nclichés we can already see elsewhere ?! Why did the director think that\n2 parts were necessary after the first 2 movies ?<br><br>This movie dragged on and on, letting the viewer suffer 2hours\nof...nothing...\n"},
{"review": "\nNo more tough struggles to survive, complicated interpersonal\nrelationships and difficult decisions for loved ones; just hurt, anger\nand worry over and over again. No more flamboyant capital, gloomy\ndistricts and brutal jungles; just repetitious ruins, same underground\nshelter, and similar propaganda commercials boring enough to doze off.\nThe Hunger Games: Mockingjay Part 1 is basically a two-hour trailer for\nthe final movie which advances almost nothing critical. I have to say\nit's the biggest disappointment in film series and I really don't want\nto score it. <br><br>The idea of splitting the final story of a film series into two parts\ndefinitely spoils the film. I see nothing beneficial other than\neconomic gain. The bland plot limits performances of actors and\nactresses. I can only wish to see more Josh Hutcherson in the next\nfilm.\n"},
{"review": "\nThis is a great example of a Hollywood budget that was utterly wasted.\nThe reason you go to a movie like this is not to have the pivotal\naction scenes left up to the imagination. The acting is atrocious. It\nseems to be making fun of itself at times, which is just sad. Is it SNL\nor is it a 15 dollar per ticket Hollywood feature?<br><br>It's odd because this movie cost 125 million dollars and yet it has all\nthe special effects of a made for TV movie...<br><br>I just finished watching \"Maze Runner\" which was surprisingly good for\nwhat it was, and I was shocked to find out that it only had a $34\nmillion budget. Honestly, there was 2-3 times the action and excitement\nin Maze Runner vs Mockingjay. <br><br>I like Hunger Games for a lot of reasons but this movie just dropped\nthe ball big time, it is boring, it adds nothing of real note to the\nstory, and it makes the actors in it look bad.\n"},
{"review": "\nI would like to review this film. In my opinion, it does not deserve\nany review, because the plot is awful, sometimes it feels you watch\ndifferent films at the same time. Acting is bad; especially the main\nrole actress does the 'credit'. I will admit that previous parts\nentertained me to some extent, but this one not only disappointed me.\nIt made me so angry, that I wanted to complain to OFCOM. The trailer\nshowed completely different film. 2.5 hours of boring talking about\nnothing with poor acting! Not a single person on this planet deserves\nthat punishment.<br><br>THE WORST FILM OF THIS DECADE EASILY!!! DO NOT WASTE YOUR TIME!\n"},
{"review": "\nI went to this movie with my friend and well, it was absolute dog crap.\nthe sound effects were bad. It was too predictable. And too much use of\nPeeta being an insane douche. I would literally go and destroy the main\ncopy of this crap. That's how much I hated it. Now District 13 is\nunderground, I thought I was watching a more hi-tech version of the\nhobbits house! BOO! BOO YOU DIRECTOR OF THIS CRAP! Why can't you see\nthat you have just made a p!$$ take of a futuristic war movie and added\nmore propaganda for war and people who need f******g help! For Pete's\nsake, don't make part 2, it will be the worst, most s*****t movie ever!\nPlease! For the love of god, don't go and see it and don't go see part\n2! The only good hunger games is the first!\n"},
{"review": "\nDid I not tell you this was a rip off of Battle Royale years ago?<br><br>Did I not tell you that catching fire was more of the same?<br><br>Did I not share the prophecy of my glorious return? Hear me now, my\nbeloved chimps!<br><br>Suzanne Collins is a FRAUD! You see the proof in the horrible reviews\nof this travesty and the endless comparisons against the superior,\nBattle Royale.<br><br>Stop paying Hollywood for their trash. They feed you sh*t and you eat\nit with a smile on your face! Even one of the actors, Philip Seymour\nHoffman committed suicide to stop working on this film.<br><br>What does that tell you my fellow banana peelers??\n"},
{"review": "\nI am not going to go into details. I will try to keep it short. <br><br>It was as expected, a totally dull movie. <br><br>Looks like it was made for a TV release.<br><br>I can understand that it is a formula movie, where the producers and\ndirectors are cashing on the market for certain type of viewers that\nare really suckers for these Teenage, rebellion, Ohh I am so special,\nwill do things on my own terms type stuff. <br><br>But it was sad to see that they didn't even bothered to make some\neffort and make it more interesting and viewable. <br><br>Saw the whole movie in like 30 min and was still bored to death.<br><br>Good going guys, cant wait to see the next garbage(actual word removed)\nsequel of this franchise.\n"},
{"review": "\nI can tell that really I was so excited about this film getting me\nwatched it on the first day of its showing with my family who are also\na big fan of this movie series. Hmm, but despite of the great acting of\nthe actors, (I do love Jennifer Lawrence), the delivery of the script,\nscenes that are effective/captivating and with good story flow.. I\ndon't know, I'm still bit disappointed that I'm actually waiting for\nsomething that I know the the first 2 movie installations have in it. I\nknow that with some parts I'm still thrilled and amazed but I was\nreally expecting something that really don't happened or i guess\nsomething that I wanted to happen that doesn't then took place. With\nall the lines of the actors, it then become more of a drama than of\nhaving an action-packed film that made me thrilled and hooked with it\nin the first place. But still, I'm gonna watch Mockingjay: Part-2 just\nnot thinking of this Part-1 that kinda made me bit disappointed. Hoping\nthat the 2nd one will have all my expectations that I know will\novercome what then happened with this 1st one.\n"},
{"review": "\nI see there is no point of repeating the bragging on movies that are\ncut into two parts, so here's the quick opinion: I agree with the\nreviews written before me and and as so I have nothing more to\ncontribute to my own review, the movie is boring and it makes me angry\nthat developers profit from the viewership. <br><br>But I assure you to worry no more as it is obvious that people are fast\non disliking this 'cutting into parts' trend and as a result most movie\nmakers will abandon this foolish affair to pursue not viewers'\nimpression but money.<br><br>Just keep rebelling in your reviews and/or comments. Sparkle the\nrevolution! Become the Mockingjay of film industry!\n"},
{"review": "\nthis is the Stupidest movie ever conceived There was nothing to watch.\nI don't know how you can sell a movie by doing some close up shots of\nJennifer Lawrence in leather tights. It was just plain stupidity in\nevery scene. Same old revenge drama with half side shaved heads, war\ntorn buildings and desperate attempts to sell its viewers the idea that\nits a master class. At least should have shown some respect to the book\nfrom which its taken. This movie should be shown at some fashion shows\nduring couture week may be it can get some applause there. The movie\nwas so boring that gradually the whole theater started booing and and\nwalking out of there shaking their heads.i need my money back !!!!!\n"},
{"review": "\nWhy did this have to be two parts? I know it makes people more money,\nbut this would have been a better movie if it was all one piece. There\nis very little action and lots of political propaganda stuff and that\nisn't a bad thing, it's just that it ends so anticlimactically, making\nthe whole movie feel forced and unnecessary. When I left this movie, I\nhad the same opinion I had about Harry Potter and the Deathly Hallows\nPart 1. Just when things are about to go down for real, the credits\nroll, which is really disappointing. If you wait and watch this\ndirectly before Part 2, I imagine you'll enjoy it, but for now, I can't\nreally say it was all that great.\n"},
{"review": "\nI don't know where to start. Being a fan of this franchisee i had so\nmany expectations but the movie is so slow that even if you go out and\ngrab a cup of coffee you will come back to see that the movie has not\ngone anywhere. I admire Jennifer Lawrence but this is probably her\nweakest performance till date. She has sounded screechy and devoid of\nemotions for most parts which is a surprise considering what a fine\nactress she is.The movie is unbelievably stretched out that it gets to\nridiculous proportions as you start praying for the movie to end.<br><br>The Mockingjay should have been a one part movie but as we all know for\ncommercial interests a 45 minutes plot has been dragged out for two\npainful hours. Only Jennifer Lawrence has hogged the lion share of\nscreen time while other actors like Woody Harrelson are criminally\nwasted. The direction lack vision. The editing is probably the weakest\npart of the movie. The story of the movie can be told in 5 lines and\nthey have made a two hours movie out of this. The high rating for this\nmovie is surprising to see.\n"},
{"review": "\nI still don't understand that. Most of the people i know loves this\nmovie saying this is the best movie ever.<br><br>Let's start. I think dividing a movie in two parts is pretty much the\nway to kill a movie, I think that maybe whatever happens in the second\npart could have completed this. now it has no real conclusion. No\naction at all, sometimes the dumbest solution ever (katniss' sister\nrunning for the cat during the bombing). Still like slow movies, but\nthis truly doesn't have any true event happening until second part of\nthe movie. Like the post-apoc. atmosphere though, that \"stalker\" effect\ngiven by bombing sites, but that's the only reason i rated this 5/10.\n"},
{"review": "\nI liked the first film (8/10), thought the second film was very average\n(6/10) and this is a generous 5/10.<br><br>There's no point going into detail but suffice to say that everything\nhere is very weak indeed and I felt sorry for the great Jenny Lawrence\ntrying her best with this appalling non-script that persists in\nsuggesting that her character could have any feelings towards the\npipsqueak Peter character .<br><br>It's just not a believable romantic thread ...<br><br>Jenny and Julianne could both find better work than this. <br><br>Very poor indeed ...\n"},
{"review": "\nFirst off, let me say that the first two movies in the series were very\nwell done. However, I was disappointed to find 'The Hunger Games:\nMockingjay - Part 1' to be shallow and weak. <br><br>If you want to see the movie for the action, don't. There are very few\n'heart-pounding' action scenes. But I get it, the book series matures\ninto a larger statement about oppressive governments and the concept of\nfreedom itself. That said, the movie was neither political nor\nphilosophical. A good example of a stellar film in this category is 'V\nfor Vendetta.' <br><br>The greatest disadvantage this film wrought was its insistence to focus\non Peeta's personal struggle. It was hard to sympathize with Peeta's\nproblems because the film dragged it along for so long. In the end, the\nmovie was boring and sluggish. It was neither romantic, political,\nphilosophical, nor a simple action film. It was a dull combination of\nall of these.\n"},
{"review": "\nThe first two instalments were nice to watch and made me curious about\nthe sequel. They totally lost me with this one. I have to add that I\ndid not read the books.<br><br>The film is very boring and stupid. The characters are becoming boring\nand shallow. The pace in the film is none. The only action is revealed\nand actually seen in the official trailer.<br><br>The characters are totally ruined and Katniss in spite of her previous\nacts of sacrifice, becomes very selfish, ready to let the whole nation\nbleed for her own feeling of satisfaction. The new characters are not\nproperly developed and some old ones have rather random appearance,\nmaking the plot a set of mostly random and unimportant acts and\nmoments.<br><br>The young adult previously fighting for her life (and the lives of\nothers) and prepared to kill now becomes a teenager totally lost in her\nlittle sorrows and feelings. Again and again and again until the film\nis over.<br><br>I had some expectation after the first two instalments and this felt\nlike a let-down.\n"},
{"review": "\nWow, this movie was boring. The first two installment was a alright\nwatch, but this one was boring from start to finish. The constant\nbickering of politics, setting traps and becoming a icon of hope. Was\nso generic and boring to sit through, mainly because of the lack of\ndepth and originality. This third installment really didn't need to\nparts, but it seemed like they really wanted to milk this installment\nfor all it's got. Despite it not having enough good materials to do so.\nIt's like the movie dragged on as long as it can, despite the lack of\nammunition to carry on. Just watch this movie to finish off this\nfranchise, you probably won't miss much by skipping this one though.<br><br>3/10\n"},
{"review": "\nI waited till the end, waiting for the main action to begin! I am so\nglad that I borrowed the DVD from my friend, rather than wasting some\nmoney going to the Cinema last year. <br><br>Amazing location, great cinematography. But hey where is the story??\nThey were filming her in different poses and locations to send message\nto the rebellion which all I found very inappropriate in a science\nfiction thriller movie. And all those rubbish talking about her dress!!\nCome on guys, you are trying to win a war, not going to a fashion\nshow!!! <br><br>I don't recommend this. Pile of s****t.\n"},
{"review": "\nBefore watching this I viewed Catching Fire again in order to compare\nit to Pt.1. Pt.1 stalled in many scenes while Catching Fire progressed\nsmoothly. Pt. failed to capitalize on character development and what\nwas that cat doing in the film? I groaned at that moment the girl was\nlooking for that cat. Why were we supposed to care about the leading\nand supporting characters? Johanna Mason has more charisma than anyone\nelse except Haymitch. Both characters deserve better. The others looked\nlike they were walking through their lines. They acted like they didn't\ncare and who could blame them? The humour and snappy dialogue was gone.\nWho the heck was I supposed to root for? With apathy like that no\nwonder why \"Haymitch\" was desperate for a drink? Prove me wrong in Pt.2\nor this series has already run out of steam.\n"},
{"review": "\nOK Mr Lianpeled.<br><br>I read your review as I was hoping to watch this film, but firstly\nwanted a bit more info. After reading your review I don't know how\nanyone could take any of yours seriously, when you try to imply that\nmovies which are split in to different parts IE PT1, PT2, PT3 etc\ncannot and do not work. If this is the case could please give your\nreviews on a little film which is also filmed in parts known as THE\nGODFATHER!!! You could also try and explain this to the Star Wars Fans\nout there. And while you at it.......LORD OF THE RINGS!!!!!!!!!!!\nUnfortunately for you, your talents as a critic lack total credibility\nfrom your false statement. ANYONE ELSE WITH ME ON THIS GUYS? <br><br>I am still to view this film but I am sure I will judge it on its own\nmerit rather than it being split into 2/3 parts!!! Good day to you sir!\n"},
{"review": "\nToday i had the very unfortunate pleasure of watch this extremely slow\npaced movie, every thing was good except the pace<br><br>I went in with high expectation but ended up napping half way through\nthe movie, <br><br>the movie did every thing what i was not expecting from it,<br><br>I was hoping it to be the movie of the year a cinematic symphony <br><br>but unfortunately it was a cinematic catastrophe. maybe i am being too\nmean, but on the other hand I am trying to figure out what happened to\nthe high budget which was set aside for this sequel lets hope the get\nthe last one rite\n"}
]