[
{"review": "\nWhy do I want to write the 234th comment on The Shawshank Redemption? I\nam not sure - almost everything that could be possibly said about it\nhas been said. But like so many other people who wrote comments, I was\nand am profoundly moved by this simple and eloquent depiction of hope\nand friendship and redemption. <br><br>The only other movie I have ever seen that effects me as strongly is To\nKill a Mockingbird. Both movies leave me feeling cleaner for having\nwatched them.<br><br>I didn't intend to see this movie at all: I do not like prison movies\nand I don't normally watch them. I work at a branch library and one day\nas I was checking The Shawshank Redemption out to one of our older\npatrons, she said to me, \"Whenever I feel down or depressed, I check\nout this movie and watch it and it always makes me feel better.\" At the\ntime, I thought that was very strange. One day there was nothing on TV\nexcept things I absolutely would not watch under any circumstance or\nthings that I had seen too many times already. I remembered what she\nsaid, so I watched it. I have watched it many many times since then and\nit gets better with every showing.<br><br>No action, no special effects - just men in prison uniforms talking to\neach other.<br><br>The Shawshank Redemption and To Kill a Mockingbird are the best movies\nI have ever seen. I do not judge it by it's technical merits - I don't\nreally care about that. I have read that Citizen Kane or The Godfather\nor this or that movie is the best movie ever made. They may have the\nbest technique or be the most influential motion pictures ever made,\nbut not the best. The best movies are ones that touch the soul. It\ntakes a movie like The Shawshank Redemption to touch the soul.\n"},
{"review": "\n\nI have never seen such an amazing film since I saw The Shawshank Redemption.\nShawshank encompasses friendships, hardships, hopes, and dreams.  And what\nis so great about the movie is that it moves you, it gives you hope.  Even\nthough the circumstances between the characters and the viewers are quite\ndifferent, you don't feel that far removed from what the characters are\ngoing through.<br><br>It is a simple film, yet it has an everlasting message.  Frank Darabont\ndidn't need to put any kind of outlandish special effects to get us to love\nthis film, the narration and the acting does that for him.  Why this movie\ndidn't win all seven Oscars is beyond me, but don't let that sway you to not\nsee this film, let its ranking on the IMDb's top 250 list sway you, let your\nfriends recommendation about the movie sway you.<br><br>Set aside a little over two hours tonight and rent this movie.  You will\nfinally understand what everyone is talking about and you will understand\nwhy this is my all time favorite movie.\n"},
{"review": "\nThe reason I became a member of this database is because I finally \r\nfound a movie ranking that recognized the true greatness of this movie. There \r\nis nary a word or scene out of place in the entire thing. Every element \r\ncomes together to form an exquisite story for cinema. \r\n\r\nI believe that one reason that this movie is under-appreciated is that \r\npeople have not seen it multiple times. On first viewing it is the story of \r\nAndy Dufresne and his struggle to maintain hope despite his circumstances. \r\n\r\nHowever, this is really a movie about Red and his struggle to find \r\nmeaning and purpose. The final segment of the movie testifies to the fact that the final resolution of the story comes about only when Red is faced with the same fearful situation as Brooks. Because of Andy, Red can find a\r\ndifferent path-the path of freedom that is lit by hope.\r\n\r\nWho is your Andy Dufresne?\n"},
{"review": "\n\nI believe that this film is the best story ever told on film, and I'm about\nto tell you why.<br><br>Tim Robbins plays Andy Dufresne, a city banker, wrongfully convicted of\nmurdering his wife and her lover. He is sent to Shawshank Prison in 1947\nand\nreceives a double life sentence for the crime. Andy forms an unlikely\nfriendship with \"Red\" (Morgan Freeman), the man who knows how to get\nthings.\nAndy faces many trials in prison, but forms an alliance with the wardens\nbecause he is able to use his banking experience to help the corrupt\nofficials amass personal fortunes. The story unfolds....<br><br>I was so impressed with how every single subplot was given a great deal of\nrespect and attention from the director. The acting was world-class. I have\nnever seen Tim Robbins act as well since, Morgan Freeman maybe (e.g.\nSeven).\nThe twists were unexpected, an although this film had a familiar feel, it\nwasn't even slightly pretentious or cliched, it was original. The\ncinematography was grand and expressive. It gave a real impression of the\nsheer magnitude of this daunting prison.<br><br>But the one thing which makes THE SHAWSHANK REDEMPTION stand above all\nother\nfilms, is the attention given to the story. The film depends on the story\nand the way in which it unravels. It's a powerful, poignant,\nthought-provoking, challenging film like no other. If Andy were to comment\non this film, I think he might say: \"Get busy watching, or get busy dying.\"\nTake his advice.<br><br>Thoroughly recommended.\n"},
{"review": "\n\nOne of my all time favorites. Shawshank Redemption is a very moving story\nabout hope and the power of friendship. The cast is first rate with\neveryone\ngiving a great performance. Tim Robbins and Morgan Freeman carry the movie,\nbut Bob Gunton and Clancy Brown are perfect as the Warden Norton and prison\nguard captain Hadley respectively. And James Whitmore's portrail of an\nelderly inmate Brooks is moving. The screenplay gives almost every actor at\nleast one or more memorable lines through out the film. As well as a very\nsurprising \"twist\" near the end that almost knocked me out of my chair. If\nyou have not seen this movie rent it or better yet buy it. As I bet you'll\nwant to see this one more than once.\n"},
{"review": "\n\nOne of the finest films made in recent years. It's a poignant story\nabout hope. Hope gets me. That's what makes a film like this more than a\nmovie. It tells a lesson about life.\nThose are the films people talk about 50 or even 100 years from you. It's\nalso a story for freedom. Freedom from isolation, \nfrom rule, from bigotry and hate. Freeman and Robbins are\nmajestic in their performances. Each learns from the other.\nTheir relationship is strong and you feel that from the first\nmoment they make contact with one another. There is also a\nwonderful performance from legend James Whitmore as Brooks.<br><br>He shines when it is his time to go back into the world,\nonly\nto find that the world grew up so fast he never even got\na chance to blink. Stephen King's story is brought to the\nscreen with great elegance and excitement. It is an extraordinary motion\nthat people \"will\" be talking about in \n50 or 100 years.  \n"},
{"review": "\nMisery and Stand By Me were the best adaptations up until this one, now\nyou can add Shawshank to that list.<br><br>This is simply one of the best films ever made and I know I am not the\nfirst to say that and I certainly won't be the last. The standing on\nthe IMDb is a true barometer of that. #3 as of this date and I'm sure\nit could be number 1. So I'll just skip all the normal praise of the\nfilm because we all know how great it is. But let me perhaps add that\nwhat I find so fascinating about Shawshank is that Stephen King wrote\nit.<br><br>King is one of the best writers in the world. Books like IT and the\nCastle Rock series are some of the greatest stories ever told. But his\nbest adaptations are always done by the best directors. The Shining was\nbrilliantly interpreted by Kubrick and of course the aforementioned\nMisery and Stand By Me are both by Rob Reiner. Now Frank Darabont comes\nonto the scene and makes arguably the best King film ever. He seems to\nunderstand what King wants to say and he conveys that beautifully. <br><br>What makes this film one of the best ever made is the message it\nconveys. It is one of eternal hope. Andy Dufresne, played by Tim\nRobbins, has been sent to prison for a crime he did not commit. But he\nnever loses hope. He never gives up his quest to become a free man\nagain. His years of tenacity, patience and wits keep him not only sane,\nbut it gives his mind and a spirit a will to live. This film has a\ndifferent feel to it. There has never been anything like it before and\nI don't know if there will again.<br><br>I'm not going to say any more about this film, it has already been\nsaid, but just suffice to say that I am glad that Forrest Gump won best\npicture in 94. I would have been equally glad if Pulp Fiction or\nShawshank would have won. It is that good of a movie and one that will\nbe appreciated for years to come.\n"},
{"review": "\n\nThe Shawshank Redemption is without a doubt one of the most brilliant movies\nI have ever seen. Similar to The Green Mile in many respects (and better\nthan it in almost all of them), these two movies have shown us that Stephen\nKing is a master not only of horror but also of prose that shakes the soul\nand moves the heart. The plot is average, but King did great things with it\nin his novella that are only furthered by the direction, and the acting is\nso top-rate it's almost scary.<br><br>Tim Robbins plays Andy Dufrane, wrongly imprisoned for 20 years for the\nmurder of his wife. The story focuses on Andy's relationship with \"Red\"\nRedding (Morgan Freeman, in probably his best role) and his attempts to\nescape from Shawshank. Bob Gunton is positively evil and frightening as\nWarden Norton, and there are great\nperformances and cameos all around; the most prominent one being Gil Bellows\n(late as Billy of Ally McBeal) as Tommy, a fellow inmate of Andy's who\nsuffers under the iron will of Norton.<br><br>If you haven't seen this movie, GO AND RENT IT NOW. You will not be\ndisappointed. It is positively the best movie of the '90's, and one of my\nTop 3 of all time. This movie is a spectacle to move the mind, soul, and\nheart. 10/10\n"},
{"review": "\nThis movie is not your ordinary Hollywood flick. It has a great and\ndeep message. This movie has a foundation and just kept on being built\non from their and that foundation is hope.<br><br>Other than just the message of this movie the acting was phenomenal.\nTim Robbins gave one of the greatest performances ever. He was\ninspiring, intelligent and most of all positive. His performance just\nmade me smile. Robbins plays Andy Dufresne who was wrongfully convicted\nof murdering his wife and her lover. He is gets to life sentences but\nyet never gives up hope. In he becomes friends with Ellis Boyd \"Red\"\nRedding played by Morgan Freeman. Freeman who gives the finest\nperformance of his career has unlike Robbins lost hope. He is in deep\nregret of the crime that he committed. His way of deflecting the pain\naway is by trying to not feel anything at all. With his friendship with\nAndy he learns that without our hopes and dreams we have nothing. Andy\nalso becomes friends with the rest of Red's group. James Whitmore also\ngave a great performance as Brooks Halten who gets out of prison parole\nbut in the words of Red he has been \"institutionalized\". <br><br>The directing by Frank Darabont was just magnificent. He kept this\nmovie at a great steady pace along with the writing and great\ncinematography. He portrayed prison life in such a horrifying way, but\nnot in terms of the physical pain but the stress and pain that wares\nmentally on the inmates, some of which deserve a second chance. <br><br>Whatever you do, don't listen to the people who say this movie is\noverrated because this is one of the most inspiring and greatest movies\never. It has everything you could possibly want.\n"},
{"review": "\nWe have all see movies, comedies, action and dramas. We all liked ones,\nhated others, got into some other even and felt like part of it. In\nShawshank Redemption; you start slowly, after a while you get attached,\nby the time you reach the middle of the movie you simply totally forget\nabout anything outside the screen and feel a mixed stream of emotions\ngoing through you head before anything else! then comes a last 20\nminutes of heart storming that is surely enough to raise the adrenaline\nto extreme levels even in diabetics! I felt warm, strong, happy and all\nother emotions one can think of, I felt I was the one who won, who got\nout of prison, i was simply fully satisfied.<br><br>This movie must be used as an Anti-depression by therapists! this movie\nproves that Oscars are either money bought gifts! or that who ever in\ncharge of them are so smart that they couldn't give any Oscar to The\nShawshank Redemption knowing that the movie is on different - much\nhigher- rating scale than the Oscars.. it's simply over qualified!\n"},
{"review": "\nProbably yes, acting was good, plot brilliant, I mean Stephen King\nwrote the book, but it can't match the film. When I sow this movie I\nthought \"thats it, this is it, best movie ever\". Sure you can find\npeople who didn't like it, and when I ask \"why\", and try to guess what\nthen happened? They just confused themselves, they can say reason why\nthey don't like this movie... When I try to read comments with 1/10\nstar, I can't find comment with good reasons that could make me\nrealize, that this movie is a bad movie, If there is no reason, then\nthis means, that its the best movie ever made!The only reason people\nare giving 1 star is that they don't like ratio \"9,2\", they want to do\nmore effect by pull this high ratio down, I really hate them :) Sorry\nfor my bad English language, I live in EUrope, my English teacher is\nbig cow with no knowledge...\n"},
{"review": "\nThis touching and heart warming film is the most perfect celebration of the\nhuman spirit I have seen. Andy Dufresne, wrongly convicted of murdering his\nwife and her lover, finds the strength not only to change himself, but to\nbring hope to those around him in Shawshank Prison.  This inspiring story\nis interwoven with a soundtrack which invokes every emotion, from haunting\nand chilling, to stirring and beautiful. When you go to see a movie and it\ntouches you with its poetry, music, and its atmosphere, and leaves you with\na sense of victorious satisfaction, it is a triumph.  Field of Dreams was\nthe first movie which invoked these emotions in me.  Shawshank Redemption\nis even more powerful for its simplicity.  It doesn't pretend to be clean,\nnor could it be called a family movie.  It is brutal and violent at times,\nhorrifying and sickening at others. However the title says it all.\nRedemption is what this story is all about.  And it is not necessarily\nredemption for the actual crimes you might have committed, but it is\nredemption for the way you have lived your life.  What emerges can only be\ncalled a maginificent piece of art.  This is what movies were meant to be.\n\n"},
{"review": "\nI still can't quite get the enormous reputation of this film. I saw it\nagain last night and instead of clearing up the mystery, the mystery\ngot thicker. It is enjoyable film with very good performances by Tim\nRobbins, Morgan Freeman, James Whitmore etc, but...the most highly\nrated film ever? I don't get it. The voice over alone seems to belong\nto a so so film. I love Morgan Freeman's voice but he's telling us what\nwe're seeing. So, the sterling reputation damages the enjoyment of the\nfilm because one is expecting something that never, really, arrives.\nThe most interesting aspect is Tim Robbins's psychological journey.\nCredible or incredible doesn't quite matter, I did go with him without\nasking too many questions. Morgan Freeman's humanity is contagious and\ninspiring, whether credible or not because I bought it. So, a\nmasterpiece? No. Good, even very good? Yes.\n"},
{"review": "\nA friend of mine listed \"The Shawshank Redemption\" as one her all time\nfavorite movies and that brought on my curiosity what Shawshank\nRedemption was, I even thought it was a typo. The next day I went out\nand brought home the 10 years anniversary DVD without knowing I was\ngoing to spend the most worthwhile 2 and a half hours of my life in\nfront of the TV (a melodrama doesn't kill, right?)<br><br>I don't know how to write a good movie review so I guess telling you\nwhat I feel about it may do better. I remembered crying a few times,\nbeing astounded by the plot twist for a moment or two and ending up\nsitting alone, inert and all, just because of the once-in-a-lifetime\nbeauty of Shawshank. Just recall the scene in which Andy locked himself\nin the room and turned the music on, all the cons stood paralyzed on\nthe ground, listening to the magical tune like the song of hope they\nhad never heard before.<br><br>Shawshank is more than a feel good movie, it's about life-changing\nexperiences, about the endless struggle against life's harshness and\nunfairness, about true friends who will stand by you forever... The\nsimple yet hard to convey messages could not be handled more subtly\nthan this.<br><br>Shawshank should have won every Oscar for any categories it was\nnominated, but it's all about struggling against unfairness, time's\nproved its monumental magnitude.<br><br>Shawshank is a lesson of life that you have to learn in just 150\nminutes.\n"},
{"review": "\nI made my account on IMDb Just to Rate this movie. :-) I had heard from\nsomeone that Tim Robins has done a great job in this movie. but when i\nstarted watching this movie, i could not move my ass for 142 Min.<br><br>its not just about Tim Robins or Morgen Freeman.. its the whole\nstoryline,dialogs and cinematography which insist you to watch this\nwhenever you feel low in your life.<br><br>Movie has some great lines. When Andy(Tim Robins) brake the Jail,\nMorgon Freeman says \"I have to remind myself that some birds aren't\nmeant to be caged. Their feathers are just too bright\" This movie has\nentertainment, Feelings, Action, Drama a little comedy. In short\neverything we want to see in a movie.<br><br>I have seen this movie around 100 times and sure will watch more then\n10000 times before i die. 1 of the best movies i have ever seen in my\nlife.. Wish i could see that sort of movie again in my life\n"},
{"review": "\nI first saw this film, like many others, by chance and on DVD. And like\nothers, I have since watched it over and over again. When I feel sad,\nit makes me feel happy, when I need hope, it gives me hope.When I want\nto reaffirm my very belief in life, and all it can offer, this film\ngives me a new sense of purpose that no other film has ever come close\nto doing.It soars above anything any other movie has tried to achieve\nin the way it touches on the true virtues of life itself. The portrayal\nof friendship, the devastation of loss and the maintaining of hope.\nOutstanding performances from the two leads and the most beautiful of\nnarratives are the tip of the iceberg of why this film is so great. The\ncinematography from the very first shots of the prison are stunning and\nthe accompanying soundtrack add to the haunting atmosphere when we\nfirst venture inside the prison walls. Thank you Mr Darabont, Mr Robins\nand Mr Freeman. Thank you to every one else involved. You changed my\nlife\n"},
{"review": "\nLike I did a few years back, you might be hesitating about watching\nthis film. The title didn't appeal to me, and neither did the subject\nmatter, so it was only by chance that I started to watch it.<br><br>I can only say that the film was a revelation for me and has stayed\nwith me ever since. There are so many dark and hopeless films out there\nwhich, whilst they leave an impression, leave the wrong one i.e that\nthere is no hope in life. Watch this film and be uplifted and be\nencouraged by the message...that there is ALWAYS hope....in any\nsituation.<br><br>Please watch this film and the watch it again. It's a great answer to\nall the cynicism that is out there.\n"},
{"review": "\n  This is Tim Robbins best performance ever. It is a compelling heart\n warming drama about an innocent man(Andy Dufresbe) who is sent to prison\n and learns to use his intelligence to make the best of prison life. He\n meets a mentor in Red(Morgan Freeman) and they build a friendship that is\n stronger than the walls that surround them. Andy steadies a relationship\n with the warden that keeps him in the good eyes of the prison. Andy is\n full of surprises and uses his resourcefulness to not only win the\n friendships of his fellow prisoners, but also of the prison guards. Both\n Andy and Red both hold on to their dream of one day enjoying their freedom.\n  They turn their friendship and dreams of freedom into a bond that no\n prison could ever take away.\n"},
{"review": "\nThis is the best movie I have ever seen. In a way I feel I am in a\nprison of life myself. Restricted to doing certain things. Sometimes I\nget frustrated and feel as I should runaway to some place where I could\nfeel free. I hope and dream for it sometime. This movie just reminds me\nof my feelings so much. I love Andy Dufresne most in this movie.\nAlthough critics say Tim Robbins didn't do enough to express the\ncharacter but my personal opinion is that he was made for this role.<br><br>I can go on and say more but I said the most important thing which I\nfeel whenever I watch it.<br><br>I am glad to visit IMDb. I never heard of it before. Some 7 years ago I\nsaw it at no.2 in the rankings and decided to watch it immediately.\nOnly other movie which even comes close to this is Citizen Kane. But\nthat is about past and this one is about hope and freedom.<br><br>I give it 11/10.\n"},
{"review": "\n\nI reviewed this film recently with a specific question in mind. At this\nwriting, this film is ranked by IMDB viewers as the second best film ever\nmade. The SECOND BEST EVER MADE!<br><br>Why? This was my question.<br><br>The acting is good. Robbins and Freeman are quality craftsmen in the Caine\nand Hackman tradition. But these are not truly great actors and in any case,\nthey are only asked to play appealing persons, deliberately less-dimensional\nthan real (as opposed to believably hyper-real which is much\nharder).<br><br>The director is a first-timer, and it shows. There is simple framing and\nstaging here. In fact, there seems to be a deliberate strategy to be as\nplain as possible. And that is the core of where I think people find the\nappeal of this film.<br><br>The story is very tight in the sense of narrative flow. All the chunks are\nthe same size, with no fancy rhythm. There is no distracting backstory. No\nelement has irony, not writing, acting, shooting, even the\nscore.<br><br>Now for me, I expect and demand art in my films -- that's why I register\nthis as plain. But I think it is well liked because it is totally without\npretense. It is straight and honest; people seem hungry for honesty, and\nthis has the appearance of what they need at just the right\ntime.<br><br>Is a film great because it merely fulfills? I hope many people think not,\nand dream that this film moves down the list to be replaced with more\nintelligent efforts.\n"},
{"review": "\nWhen I first saw the Shawshank Redemption, I was in a movie theater on\na week night at around 11pm. I had gotten out of work from working the\nevening shift. I was tired and just wanted a little amusement. This was\nat a time after Shawshank had been released but got little attention. I\nhad heard some Oscar buzz so my curiosity got the better of me. I half\nreluctantly chose to watch it. That night, I was not prepared to be\nblown away. I didn't see a movie, I was transported by a story. I was\ninstantly transcended into realizing why films should be made to begin\nwith. I wasn't just entertained, I was emotionally moved and\nintellectually bamboozled in the most endearing manner. If this film\nremains on IMDb's number one spot for a long time to come, It's well\ndeserves it. To me personally, the Shawshank Redemption is a testament\nas to why the 90's were an interesting decade but more than that, why a\nfilm can become an experience and gain instant classic status. There\nare two simple rules you should follow prior to watching T S R: one, if\nyou haven't seen it, don't let any one who HAS seen it tell you\nanything about its plot, Don't listen to a word caus they might ruin it\nfor you. Two, make arrangements not to be interrupted when watching the\nfilm; no phone calls, no door bells, no other plans. Watch it from\nbeginning to end. You can't over hype this film it's just that good.\nWhat i've written here is just a small fraction of what I can further\nexpress by way of praise for the film. Long live The Shawshank\nRedemption on IMDb !\n"},
{"review": "\nMost of the people here is the best movie in the world to join me.\nWatching very, very impressed. What it might be called the great\nstories of Stephen King anyway. Acting on cues can say is enormous.\nThere's no posturing. Especially when Andy Dufrense incredible music\nthat review still stands wandering on everyone's lips. Finale as you\nlose yourself in it is a movie you are getting into. Finals if he so\nexhilarating you a high-quality music. And finding that deserves really\ndeserve. I watched this film very young age and it has taught me that\nthe magic of cinema in a nice way. This film is one of the reasons I\nhate the Oscars. Will remain as the best film in more than 10 years, I\nbelieve wholeheartedly sites. Definitely my best movie 10/10.\n"},
{"review": "\nA good prison movie whose cult of fans has made it into something so\nmuch more than it is. Greatest movie ever made? Get real. It's not even\nthe greatest prison movie ever made. Hell, it's not even the best movie\nreleased in 1994! It's predictable and borrows heavily from decades of\nprison movie clichés. It's also nowhere near as deep as its staunchest\nadmirers would have you believe. Still, it's an entertaining movie.\nNice direction from Frank Darabont. Morgan Freeman is the highlight\nwith a solid supporting cast. Tim Robbins, however, is borderline\nridiculous at times with his cartoonish facial expressions and silly\n\"stares-off-into-the-distance\" moments. He's so far beneath Freeman as\nan actor it's sad. With a normal movie like this, I would focus more on\nthe positives. I did give it a 7, after all. Unfortunately, it is\neasily the most overrated movie of all time (on IMDb, for sure) and as\nsuch the balance of positive to negative is out of whack.\n"},
{"review": "\n'The Shawshank Redemption' is the best film ever made in the history of\nworld cinema! The Best Hollywood Film Of All-Time! A Masterpiece! A\ncult classic! A legendary Epic! A Film that you moves you, leaves you\nstunned!<br><br>Performances: Tim Robbins is astounding, his careers finest after\nMystic River. Morgan Freeman is masterful, his careers finest after\nMillion Dollar Baby. Others are excellent.<br><br>'The Shawshank Redemption' is cinema at its very best. My salute to\nthis flick! A true Masterpiece! I just love this film! The most\npowerful film of all-time.\n"},
{"review": "\nTo tell the truth, I am speechless. I am a young movie fanatic, in\nfact, this film came out the same year I was born, and therefore I am\nmore used to films incredible special effects, edge-of-your-seat\naction, et cetera. This film has none of that, and yet, it appeals so\nclosely to me. The way Frank Darabont uses the narration of Red to\ndrive on the story, the beauty of the soundtrack used (note the\nharmonica used just before Red's finding of the letter close to the\nend). The entire film, from beginning to end, from actions to sound, is\na beacon of hope, judgement, and redemption. The cast is perfect,\nMorgan Freeman(Red) actually brings about a refreshing feel to the\ntale, and that is exactly what the movie is, what a movie should be.\nHighly recommended for every viewer, no matter your taste(or age-\n!judgement excludes use of language or violence!). I can't say it\ndeserved its nO.1 position, i can't say any movie does, but if any\nmovie should, this one might as well be it. *********\n"},
{"review": "\nIt's times like these that almost tempt me to grab Jigsaw off the\nshelf. It's been almost a month since I saw a film that was flatout\nbad; the worst review I've given in weeks was a 6/10 to Flightplan.\nThis film obviously didn't break my streak.<br><br>I went into it knowing next to nothing, only that IMDb has it ranked as\nthe second best movie of all time, that it was based on a story by\nStephen King, and that it took place in a prison. Needless to say, it\nblew me away. I wont say a thing about the plot, just so that others\nwho've yet to see this film have a chance at the same experience as me.\nI will say this though: It has some of the most subtle and unexpected\ntwists you will ever see. One in particular stands out above the rest.<br><br>Not much can be said about the actors that hasn't been said. Morgan\nFreeman gives one of the best performances of his career, and even\nthough I've only seen 2 or 3 other Tim Robbins movies, I'm sure the\nsame can be said for him.<br><br>Though I don't agree with the multitudes of people that call this the\nbest movie ever made, it was still a very good, very well made, very\nentertaining and almost heartbreaking film.<br><br>9/10\n"},
{"review": "\n\nAt first, before starting the movie, I thought \"Sounds like a typical\nprison\nriot and break-out kind of movie\". At the beginning of the movie, my\nthoughts was even more convincing. A large prison (Which immediately\nreminded me of the movie \"The Last Castle\" from 2001), housing people of\nall\nsorts, having it's guards, warden and of course, the inmates. The typical\ninmate; Roughneck, hard on the outside, broken on the inside. And they all\nclaim their innocence, as an internal joke sort of speak.<br><br>It gets to a point where I started comparing it with others. That proved\nwrong in quite a short while, from the point where a prisoner, framed for\nmurder of his wife and her lover, is being convicted and sentenced to life\nin prison. His name was Andy Dufresne. In short terms, a straight-up bank\nemployee, excellent with numbers and taxes, which he also uses to benefit\nwithin the walls of the prison. His reputation as a numerological genius\nspreads out, and soon all kinds of people, inmates and guards, are coming\nto\nhim for financial advice. He builds up a library, he maintains a strict\nsurface. He has his hobbies, to keep his mind busy (as said in the movie).\nHe carves chess pieces out of stone, using an axe as the tool. Seemingly,\nthis is a nice and lucrative hobby, but underneath it all, he has a\nsecret...<br><br>The movie keeps the viewer thrilled and excited, because in every minute,\nsomething could happen. The dialog is good, Tim Robbins and Morgan\nFreeman,\nboth great actors, shows and outstanding play. The crew really did good\nwork\non the set, the right camera angles, the light, sounds and so on...it was\nalmost like I could smell the prison!<br><br>A brilliant movie. Not too short, not too long. It's worth every minute\nwatching! My highest recommendation for those who like drama, action and\nhumor.\n"},
{"review": "\nThe Shawshank Redemption is a story of life itself. It is not about a\nperson in prison, it is about the soul and the battle it accepts and\ncarries on to deserve the life it has been given by God. I watched the\nmovie for the first time some months ago. That evening I was about to\ngo out with some friends but out meeting was canceled and I had to stay\nhome. Being unhappy about that, I started watching the movie on the TV\njust by chance, not knowing about its existence before that at all. At\nfirst I was skeptic, I admit that. But oh God, at the end of it I was\nscreaming and jumping in my room at 1 AM! It gave me so much emotions\nand so much hope, I had never felt before that. I could hardly believe\nthat a movie could make me feel that way - so excited, so happy about\nmy life, leaving me believing so much in my own self. It is a great\nstory of what the strength of your thoughts can make you do. In The\nShawshank Redemption desire does not make you weak, just the opposite -\ngives you wings to fly away from fear, fly closer and closer to\nfreedom. Morgan Freeman's voice is just another advantage that makes\nthe movie even more impressive. Tim Robbins' act is just beyond\nperfection! I bought the DVD this summer and every time I feel weak or\njust bad about something, I watch the movie. It has become my personal\nshrink, making me feel strong enough anytime I watch it. Can never\nimagine a better movie made anywhere in the world even after 1000\nyears!\n"},
{"review": "\nThis is it, I have always been so careful on not getting carried away\nwhile watching great films and calling it the best. I am talking about\nthe league of The Godfather, Casablanca, The Good The Bad &amp; The Ugly\nand 12 Angry Men. So I always called each of them one of the best. I\nnever believed THE BEST ever existed. It can't be, right? How can\nanything be the best or perfect. Definitely not perfect film. There's\ngot to be something wrong somewhere I just need to look close enough.<br><br>But I was wrong. Although I knew I was all the way. Right from the very\nfirst time I watched The Shawshank Redemption on HBO in 1997 (18 years\nago) and I waited 18 years, 5 thorough viewings, 1 sceptical review\nbefore I wrote my final judgment of this film. <br><br>This is the best film ever made. Spotless. True classic. And it was not\neven directed or acted by the legends we know today. Sure they are true\nlegends. But what Frank Dorabont, Tim Robbins, Morgan Freeman &amp; their\namazing crew did is something extra special. They created the best work\non cinema ever with almost none of those legends working on them. <br><br>This film needs no further description. Ten out of ten in every\ndepartment of film making. Full of incredible moments. Beauty, class\nand intellect in almost every scene. You do not need to know the No.1\nfilm status on IMDb for over a decade to actually believe in the power\nof this genius work of art. This is the best, if there is one. This is\nthe film that reaffirmed my faith in hope, human perseverance and\nfriendship. I'm sure there are many who believe this isn't that great,\nbut I am glad I think otherwise - and believe me, its a great feeling.\nOf having found the best film, being a huge film lover. 10/10 - the\nonly time I ever did or would do this on IMDb or elsewhere.\n"},
{"review": "\nWhy do I want to write the 234th comment on The Shawshank Redemption? I\nam not sure - almost everything that could be possibly said about it\nhas been said. But like so many other people who wrote comments, I was\nand am profoundly moved by this simple and eloquent depiction of hope\nand friendship and redemption. <br><br>The only other movie I have ever seen that effects me as strongly is To\nKill a Mockingbird. Both movies leave me feeling cleaner for having\nwatched them.<br><br>I didn't intend to see this movie at all: I do not like prison movies\nand I don't normally watch them. I work at a branch library and one day\nas I was checking The Shawshank Redemption out to one of our older\npatrons, she said to me, \"Whenever I feel down or depressed, I check\nout this movie and watch it and it always makes me feel better.\" At the\ntime, I thought that was very strange. One day there was nothing on TV\nexcept things I absolutely would not watch under any circumstance or\nthings that I had seen too many times already. I remembered what she\nsaid, so I watched it. I have watched it many many times since then and\nit gets better with every showing.<br><br>No action, no special effects - just men in prison uniforms talking to\neach other.<br><br>The Shawshank Redemption and To Kill a Mockingbird are the best movies\nI have ever seen. I do not judge it by it's technical merits - I don't\nreally care about that. I have read that Citizen Kane or The Godfather\nor this or that movie is the best movie ever made. They may have the\nbest technique or be the most influential motion pictures ever made,\nbut not the best. The best movies are ones that touch the soul. It\ntakes a movie like The Shawshank Redemption to touch the soul\n"},
{"review": "\nThere are only a handful of films that have shaken me to my core and\ncontinued to resonate with me for very long after their first viewing.\nI can happily say that \"The Shawshank Redemption\" has stuck to me since\nI finished watching it for the first time, and instantly rocketed up my\nTop 10 Films list. <br><br>Most great films have one or two obvious flaws that can be easily\npicked out - not so in \"Shawshank\", at least not to me. The hefty run\ntime doesn't put me off because the story and characters are just so\nwell rounded and so easy to return to time and time again. <br><br>\"Shawshank\" is one of those films that I would love to experience for\nthe first time all over again. The thrill of emotions and the highs and\nlows I felt that first time are incomparable to much else. <br><br>In my opinion, \"Forrest Gump\" was not as deserving of the Best Picture\nOscar as this. The timeless feel of a story of friendship in a hopeless\nplace will likely continue to capture generations of people for years\nto come.\n"},
{"review": "\nBy far the best movie ever...<br><br>No Doubt this is the best ever movie you will ever see, It is easily\nthe best movie of my life-time so far.<br><br>Morgan Free is a legend and Rest of the Crew did a marvellous job as\nwell. Well written / narrated and directed movie of all times.<br><br>10 out 10.<br><br>It has been on number one ranking on IMDb and most of the other movie\nrating websites forever now.<br><br>The best past of the movie is narrated voice by Morgan Freeman.<br><br>The character Andy Dufrain is a very well composed and the Warden\ncharacter has lot of punch into it.<br><br>Escape from prison was the best it can ever get.<br><br>Marvellous piece of Art.\n"},
{"review": "\nMaybe I'm writing a review too late for this movie, but I think I must\nwrite something for this.<br><br>Shawshank Redemption is a truly A Class movie that teaches us many\nthings like friendship and never gave up your hope. Unlike other users,\nI think this movie deserves to be in IMDb Top 250 list. Today, IMDb's\nTop 250 List approved and considered by everyone. So, everybody must\nsee that this movie is in top and must watch it to see why IMDb puts\nthis movie on top and not Godfather.<br><br>I really like the role of Red by Morgan Freeman. He really acts like a\nexperienced jail-mate. Andy Dufresne is okay too.<br><br>What I really like is that, I really love the end. Maybe this is the\nbest ending ever. I really like how Red laughs to Andy about pickaxe\nand Andy dig 19 years ( WOW !) to made a hole in the wall, how he\nescape and become a person he made it up for Warden's dirty job, how\nhis dreams come true and lastly after 5 years in jail after Andy\nescaped, how Red not decided to suicide, decided to follow Andy.<br><br>Best Movie Ever...<br><br>10/10\n"},
{"review": "\nI watched this movie for the umpteenth time probably last Sunday and\nhow much I loved it yet again!!! A movie I would never ever get bored\nof and definitely, one of my all time favorites. A simple yet wonderful\nstory about HOPE!!! HOPE \u0096 One word that drives all of us and gives us\nreason to live. We push ourselves through our mundane lives in the hope\nof achieving / finding something that we dream of. In the words of this\nmovie's protagonist \u0096 \"hope is a good thing, maybe the best of things,\nand no good thing ever dies\"!!! Superlative performances by Tim Robbins\nand Morgan Freeman.<br><br>A must watch if you haven't!!!\n"},
{"review": "\nThere are few movies that capture and identify with the American male\nspirit. Shawshank is one of those movies. I don't care what anyone's\ntake is on prison treatment or whether you are conservative or liberal,\nthis movie is moving. There are three movies, in my opinion, that every\nman, or developing man, should watch: Shawshank Redemption, Dancing\nWith Wolves, and Brave Heart. Unless you are a total pansy, these are\nthe movies that will confirm your heterosexuality. Andy Dufrane is the\nperson in us. Red is the person we want to be. Aside from the being in\nprison, the job they have is well apt to the people of this great\nnation.\n"},
{"review": "\n\nAn analysis of prison life--and of what hope can be in a prison--Frank\nDarabont's first film is one of the best ever.  Well-written and\nwell-acted,\nthe story of the development of friendship between Red and Andy is\ncharming,\nendearing, poignant.  Nothing about this movie is overwrought or\nextraneous--it's simply extraordinary drama.\n"},
{"review": "\nA great film and one that I shall be adding to my collection at some\npoint, but #2?<br><br>One user put it very well when they said that the film's essential\nmessage of 'the human spirit conquering all' is very uplifting an'\neverything but sounds too much like a fortune cookie homily.<br><br>There are several films that deliver the same message just as well if\nnot better. Jim Sheridan's \"In the Name of the Father\" springs\nimmediately to mind. That film has a similar theme to this one\n(wrongful imprisonment and the struggle to come to terms with it) but\nis a much better film IMO. What's even more heartening is that it's\nalso true.<br><br>Like I said, I'm not dissing the film. it IS great. From what I can\nremember all the performances are nicely judged (Freeman is excellent,\nbut then what's new?), the direction is perfect because it's so\nunobtrusive to the story, and the film in general is uplifting. I just\nthink it's nothing particularly new and it has been done better. Maybe\nmy viewpoint is borne out by the fact that it only became a huge\nsuccess on video release?<br><br>I gave it an 8. To me, this fact proves that I love the film, just not\nas much as everybody else seems to!<br><br>I think this adaptation is on a par with the short story, which was\nalso excellent. I honestly can't agree with #2 on the top 250 list\nthough. Is it just an American over-reaction to the movie or is every\nother nation as awestruck by it? Please feel free to e-mail me for\ndiscussion on this, or anything else for that matter.<br><br>#2 of 250? I don't think it would make it into my top 50 films.<br><br>Ah well, life's all about opinions...\n"},
{"review": "\n\nOccasionally you go into a cinema and all the films you wanted to see were\nfull. As you've come this far and you're a bit of a film fan you go to see\na\nfilm you've heard nothing about. I did this 6 years ago, with expectations\nlow and a boredom threshold to match I sat and waited to be disappointed. 2\nhours later I walked out of the cinema a different person, before I had not\nbeen moved by a film, I didn't care if : Indiana Jones made it, Sonny\nCorleone got wacked, Fred married Ginger, ET got home. Before, films were\neither plot driven or character driven, they were action or comedy, sad or\nhappy, a few came along that combined a number of facets that I enjoyed,\nrespected  or challenged how I viewed an issue or a person.<br><br>Shawshank was different, there were characters I believed, not just one or\ntwo but virtually all. Throughout the first hour I was gripped the full\nrange of emotions were explored, the second hour building on the characters\nwas even more powerful, some characters came and went but ultimately this\nwas a story of 2 people: Red and Andy. I have never seen a film that so\neloquently and beautifully illustrates friendship and hope.<br><br>This has become the benchmark by which I judge all movies. I am pleased\nthat\nI am not alone in feeling this way. I am glad that it did not win oscars as\nI feel individual endorsement is stronger than any vested interest award\nceremony, I relish telling everyone this is my favourite\nfilm.\nI have seen it many times and will see it many more.<br><br>\n"},
{"review": "\nthis is the first time i am really wand to write something about this<br><br>movie even though i have watched it a hundred times o so,,,, anyone who\nreally wanna know how a movie should b should watch this one,,,<br><br>movies are medium which should make us think and this one surely does\nabout life,,,<br><br>anyone wanna know the meaning of patience determination this one does\nthe trick for u,,,, <br><br>watch it and be inspired,,,<br><br>thats all i can say,,,<br><br>it will change the way u think about things around u,,<br><br>never let it die in u,,,\n"},
{"review": "\nLike a beautifully crafted French wine, this movie keeps getting better\nand better with every passing year. Every time I have viewed it over\nthe past decade (and it must be at least more than 20 times by now), I\nhave found newer shades, subtler indications, and deeper meanings. And\nit has amazed me like very few have.<br><br>* No overacting * Humour in the drab hopeless environs of Shawshank *\nMethod in the madness of running the scams from inside * The complete\nsecrecy maintained for 20 years (not even Red knew!) * The best that a\nhighly-educated intellectual could do inside such a prison * What a\ngreat actor the Warden turned out to be - totally despicable! * What a\nbunch of speakable quotes.. what a bunch! * Totally recommended for any\nyoung person - students especially * HOPE TRULY IS THE BEST OF THINGS -\na message that shines through\n"},
{"review": "\nI have grown up watching Bollywood movies, full of overacting by\noverpaid, overfed 'heroes'. It was in college that i got to see some\nfine Hollywood films and this one was probably the finest of the lot.\nThis film at first appears to be a story about life in prison. It fully\ndescribes every small experience of a person serving a long prison\nsentence. Life is not easy there for a lot of reasons. The screenplay\nis ably supported by Morgan Freeman's brilliant narration offering a\nsecond-person view of life in shawshank. But Tim Robbins steals the\nshow by aptly underplaying the part of a wrongly sentenced, wealthy\nbanker.The last forty minutes of this film, however, help raise it a\ncouple of levels above other cinematic masterpieces. You don't need a\nweapon to fight. It is easy to take away a man's bread, even his\nfreedom, but impossible to take away his hope.\n"},
{"review": "\nThree words: Oh. My. God.<br><br>How am i supposed to describe this absolutely fantastic and\nunbelievable film in words? I don't know. But I'll give it a shot. Here\ngoes.<br><br>This movie is just bloody excellent, brilliant, fantastic,\nunbelievable, not a thing wrong with it, shocking (in a good way),\nheck, pretty much every single good comment word you can think of.<br><br>I mean, for gods sake, its so damn good it takes your breath away! i\nseriously could not speak after it! it instantly took every other film\ni had seen under its shadow, and that's saying something, as i have\nseen some pretty excellent films.<br><br>There's not a single actor or actress in this movie who is crap!!!\nstandouts are Morgan freeman, Tim Robbins, and the dude who plays\nbrooks.<br><br>I could say 1239643609260246704272628xinfinity more things good about\nthis movie, but unfortunately I haven't got that much space, and my\nfingers would get sore.<br><br>An absolute must see for everyone, and I'm positive that ill never see\nanother movie better than this, and this will stay at #1 on my list\nforever.\n"},
{"review": "\ni watched this movie just to pass out some good time... and you know\nwhat.. i had sore and wet eyes at the end.. i don't know why but the\nmovie's end, couldn't stop myself..<br><br>andy's portrayal by tim robbins and red's by morgan freeman was\nabsolutely great..<br><br>i like and love andy's philosophy that \"hope is a good thing..\" .. and\ni have tried to inculcate that in me.. i just loved the movie.. i was\nlike.. whats this, its ended so fast.. i didn't it want to end.. i am\nnot a con and neither i wanna be.. but it has shown even the guys out\nthere in the prisons also can be innocent.. and to prove their\ninnocence they can go to any lengths.. i mean that they also have got\nsomething in them.. their hearts.. the spirit shown by andy was\nabsolutely great.. it shows that when you want to do something, do it\nwith full heart.. i have just finished it..but i'm sure i m gonna watch\nthis very often, and am not going to forget it for a long length of\ntime..\n"},
{"review": "\nIf you simply see this as a straightforward storytelling prison film,\nthen it is excellent (10/10) because it truly gets you involved in its\nmain character. It is an extremely enjoyable and compelling experience\nwith a heartfelt and well-acted buddy-story at its core. It\ndelicately--and sometimes brutally--juxtaposes Andy Dufresne's (Tim\nRobbins) good-natured character with the harshness of prison life,\nprojecting so much heart in doing so.<br><br>However delightful as it is, The Shawshank Redemption has no allegories\nand no statements to make and it brought nothing new to cinema in\neither style or substance. It had no revolutionary ideas or approaches\n- it's only a very safe buddy-story. A damn good one, but still just\nthat. So it can impossibly be a film that will be remembered or\nstudied, because what will it be remembered for? Friendship? Huh, neat.\nI therefore don't think it's entirely deserving of being considered the\n#2 greatest film of all time on IMDb.com.<br><br>But moving on and looking past that, it is possibly one of my all-time\nfavourite films for the feelings it leaves. Sure, it often jerks you\nfor tears just a bit too purposely, but this is forgivable because\nemotion is crucial to a prison story. On top of that, it never falls\nprey to predictable sappiness - probably because of its content which\nis devoid of sentimental romance and instead fills you up with a tragic\nfriendship. It is so well-sewn together by a feel-good narrative by\nMorgon Freeman that it is impossible not to enjoy this film.<br><br>9/10\n"},
{"review": "\nThe Shawshank Redemption is in a league with Casablanca as a movie you\ncan watch over and over, catching different nuances each time and\nbringing your own life experiences each time you watch it. Tim Robbins\ngives the performance of his career and this is the movie for which\nMorgan Freeman should have won an Oscar (a shame he had to wait for\nMillion Dollar Baby.) There are many twists and turns and I defy anyone\nto watch the ending without tears running down their face. In fact, the\nentire last third of movie is filled with marvelous scenes. If there is\nany drawback to this movie, it is that it is a shade too long, meaning\nit's often butchered when it is shown with commercials on TV. Rent\nthis, or better yet, buy it to get the full thrust of it. Definitely on\nmy personal top 10.\n"},
{"review": "\nI have been a fan of this movie for a long time.It seems that ever time\nmy life hits a downward spiral, I can always seem to pop this movie in,\nand come up with a solution to my pending problem. It somehow gives Me\nsense of peace and inner strength.<br><br>So, It wasn't all that strange for me to pop it in when I was going\nthrough a rough patch in my marriage. I found myself identifying with\nmany of the characters in this movie.<br><br>Many of them are trapped in a world of regret and mourning, due to a\nmistake that had been made early on in their lives. <br><br>This film gave me the strength to escape from my world of misery. <br><br>And now I am able to say I, Like Andy broke out of my own personal\nShawshank.<br><br>My Ex isn't too happy about the divorce. But life is much better now.\nAnd I feel saved from a life of unhappiness, Due to a mistake of a\nmarriage to early in life.<br><br>Thank You Frank Durabont.<br><br>Your film saved my life.\n"},
{"review": "\n\nThe Shawshank Redemption is one of the few movies adapted from books that\nturned out to be good .. or in, this case, brilliant.<br><br>Although the movie supposedly takes place somewhen in the 1950's, I can\neasily imagine it being transferred to today's time and standards. The thing\nthat is most fascinating about is is that the directors [and writers, of\ncourse] didn't use extreme clichés - there's no black and white painting,\njust numerous shades of grey. Robbins and Freeman both are perfect for their\nroles, as are all of the supporting actors.<br><br>Finally, I can understand why a certain movies gets a high\nranking.\n"},
{"review": "\n\nAll is perfect : the complexity of the characters, the suspense, the\nprincipals themes like friendship, loneliness, injustice, redemption,\nvengeance, freedom... The most complete movie that i've ever seen. Tim\nRobbins is great, sensitive, brilliant: in one scene, he can feel a thousand\nof feelings. Freeman is very correct and seems to be really \"Red\". Gunton,\nSadler and all the others seemed to have fun playing in this master of\npeace. Titanic is pure entertainment and received 11 oscars. This movie\ndeserves 30 oscars because it shows what is really important in life. No\naction, more realistic, more useful than the other films. It was really a\nBIG BANG in my head the first time i saw it. When i see it again, I think\nand I realize the incredible power that the cinema's industry have. In a\ndifferent way, only Star Wars, Saving Private Ryan and some others have the\nsame impact.\n"},
{"review": "\n\nThis is definitely one of my favorite movies -- it makes me cry and laugh and\nache inside all at once.  Tim Robbins, you make my days a little brighter --\nthank you!\n"},
{"review": "\n\nMy life is forever changed due to this movie.  It is a movie of hope,\n\"redemption\", and friendship.  It shows a deep growing friendship between\ntwo prisoners, Andy and Red.  They each are shown growing through their\ndistinct hardships at Shawshank prison.  As time passes, hope wanes but a\nflame burns bright in Andy.  His hope and unrelentless nature carry over to\nhis friend Red.<br><br>As Red's long stay in prison comes to an end he sees the light at the\nend of the tunnel.  Andy has left it for him to see the way to freedom, and\nhe follows it.<br><br>This film parallels my life and leaves me wondering if my advice will\nhelp somebody see the light.  For some of those people time will tell.  As\nfor now I'll be patient to wait and see.  Don't end up like Brooks, there\nwill always be someone to help you out.  There is someone out there that\ncares for you.  Thank you Andy Dufresne, your hope is the flame of my life.\n\n"},
{"review": "\n\nSince I bought (a lot of years ago) a videotape with two Stephen King's\n short films, one of them \"The Woman In The Room\", directed by Frank\n Darabont, I had the strange sensation that this guy could very well become\n one of the good directors in the filming industry... and here we are, with\n another King's story he managed to do one of the best films in this decade \n(90's), of course, with the help of nonetheless but mr. Freeman and mr.\n Robbins, who could have spoiled it? \n"},
{"review": "\nAlong with Q and Pulp Fiction, Frank Darabont (The Walking Dead\noriginal writer) and his debut film got screwed by the Hollywood\nPowerhouse that is Tom Hanks with this now can be considered an\nAmerican Classic. The fact that this film barely and I emphasize barely\nmade it's money back in US theaters (which is usually a signal for a\nfilm to turn into a DOA when released at home) and it made such a\nsplash, that the film is exceeding what anyone thought a simple 18\nyears ago. This includes some of Hollywood's best critics including\nEW's Owen Gleiberman who originally gave the film a B- back in late\n'94. Yet over time, this story of redemption, like the rise of hope\nthis film gives from beginning to end, grows on you to the point where\nat the very end, you have no choice but to clap (I clapped in my\nbasement in front of my parents and I haven't looked the same since).\nDarabont found a formula that worked and it shows in his future films.\nHe made Robbins human, made Morgan Freeman's voice as American as a Big\nMac and made the late great Rita Hayworth relevant again. The only\nregret that one should have is the fact that if it was released two\nyears later it would've swept away the Oscars (Sorry Ralph Fiennes, The\nEnglish Patient won on a weak year.)\n"},
{"review": "\nI will always remember the night I watched this movie for the first\ntime. I was 16-years-old and my dad and I were pretty bored late on a\nschool night. So naturally I say to my father, \"Dad, I think it's time\nto watch Shawshank\". I almost regret watching it. It is that good. It's\nlike nothing I ever see in my lifetime can ever compare to the\nemotional roller coaster that 'The Shawshank Redemption' takes you on.<br><br>First question I usually ask people when discussing films is, \"So have\nyou seen Shawshank?\". No matter what their reply is I am happy with the\noutcome because if they say no, then they are yet to see the greatest\nmovie of all time. If they say yes, I have something to talk to them\nabout for the next 27 minutes.<br><br>You probably still won't believe me when I tell you that this is the\ngreatest film you will ever see. It's that good that I actually told\none of my friends not to watch it until she was on her deathbed. Then\nshe will see this movie without ever having to compare anything else to\nit. Now when I see a movie all I think is, I've already seen the best.<br><br>Now actually getting onto maybe even reviewing this masterpiece (not\nthat any summary of the plot could ever do it justice). So all I will\nsay is this, I have never heard anyone give this movie a bad review. Do\nyourself a favour and don't even bother to finish reading this. Just go\nand watch it.\n"},
{"review": "\nTHE SHAWSHANK REDEMPTION is a kind of morality tale that is definitely\none of Stephen King's more restrained kind of stories, dealing mostly\nwith a character study of two individuals sharing imprisonment and the\nconsequences that await them when the tale ends.<br><br>TIM ROBBINS is a man wrongly convicted of murder and serving a long\nprison term while MORGAN FREEMAN (who plays the narrator with great\ndignity) describes himself as \"the only guilty man in Shawshank.\" The\nhardships of prison life are captured in brief scenes that make the\nviewer wish that Robbins will find a way of escape. <br><br>Along the way, he is gang raped by prisoners and treated harshly by a\nbrutal warden and some of his spirit seems to vanish. But Robbins is\nquietly effective as a prisoner who makes a good adjustment when he\ntakes charge of the prison library and sees to it that there's a wider\nselection of books than the kind of potboilers that King is noted for\nwriting. A touch of irony here, no? The closing scenes are a bit of a\nstretch and a reminder of just who wrote this prison tale--but still,\nthey make an impact because of all that happens before.<br><br>It's a bittersweet story, a sort of horrific fairy-tale of what might\nhave happened, but the viewer will be caught up in the story because of\nthe tremendously skillful story-telling magic of Stephen King and\ndirector Frank Darabont who also wrote the screenplay.\n"},
{"review": "\n\nShawshank Redemption is without a doubt the most uplifting and touching film\nI have ever seen. It is the only movie I've seen that has made tears of\nhappiness come to my eyes. I would (and do) recommend this film to anyone\nand everyone.  \n"},
{"review": "\n\nNow, I see what everybody was talking about. It took me 4 years to see this,\nin my opinion, masterpiece. If you have not seen this movie rent it anyway\nyou can. The performances delivered by Robbins and Freeman are, to me, the\npinnacle of both their careers. This film cannot help but evoke tactile\nimagery to the fullest capacity. You feel what the main characters are going\nthrough the sensation is uncanny. Robbins (Andy) and Freeman (\"Red\") are a\nbalance of the human spirit. Andy is your freedom-seeking hope side and\n\"Red\" is your rational, pessimistic counterpart. Find your equilibrium in\n\"The Shawshank Redemption.\"\n"},
{"review": "\nBefore watching Shawshank Redemption for the first time, I really\ndidn't think much of it. I thought it had probably wrongfully earned\nthe #1 spot here on IMDb, and couldn't be better than The Godfather for\nexample. A movie that was \"cool\" to like, if you will. I could imagine\nfashion conscious movie-hipsters discussing movies over their glasses\nof Napa Valley Chardonnay, arguing who liked Shawshank Redemption the\nmost, and which movie by Ingmar Bergman had the strongest metaphorical\nmessages. You get the idea.<br><br>I'm sure everything I have to say about the way the movie has been made\nhas been said better in one of the other comments. That said, the\nreason I'm posting this review is because Shawshank Redemption isn't\nonly a hardcore movie freak's wet dream. While it's brilliantly\nwritten, has some of the most fluent acting I have seen and shows the\nfantastic directing skills of Frank Darabont, you really don't have to\nbe an expert of film theory to appreciate it. It appeals to so many\ndifferent groups of people, and so many different human feelings at the\nsame time. The \"weaknesses\" it had as it came out (the idea of a jail\nmovie not being compatible with the female population, and the idea of\na movie about lifelong friendship between two men not being compatible\nwith the male population) is actually the reason Shawshank Redemption\nis loved by nearly all: It offers something for everyone.<br><br>In my opinion rating something 10/10 is a bit too absolute for\nanything, but since this is probably the best movie I remember seeing,\nand my first 10/10, I think I'll let it slide this time.\n"},
{"review": "\nthis an incredible film this movie was make feel the happiness this\nunbelievable 20years dug in the jail without no body know and\nabbreviation this is a great movie and this is form a few great movies\nyou will see it in your life and is to be enough the writer was the\ngreatest writer in the world Stephen king Tim Robinson give all he have\nin this film and Morgan free man he give unforgettable part in his Lief\nand how was believe the bad and strong officer at the end crying and\nthey take him to punshid him above he did and Tim Robinson pushed the\nadministrator of the jail to suicide after he take all his money this\nmovie i will can't forget it for along time he will be in my memory for\never\n"},
{"review": "\nI really liked this movie, which I just recently saw for the first\ntime, strange indeed since it is more than 10 years old. It reminded\nme, naturally I would say, to Papillon, the 70's McQueen/Hoffman\nclassic.<br><br>I like the story, the acting, basically everything, and I definitely\nrecommend it to everybody. But compared to Papillon? There are so many\nsimilarities that one has to think that idea of the movie did not came\nout of the blue. Because of that the movie has to accept to be compared\nwith Papillon. And Papillon is simply even better. It is emotionally\nmuch more touching, and when even Freeman's great performance doesn't\nmatch Hoffman's, there is no doubt that Robbins is not close to McQueen\n- in that role I mean! Tim gave a great performance but his role didn't\ngive him the chance that Steve had.<br><br>Anyway, a joy to watch. But please watch the \"original\" too, it's not\nold-fashioned at all! I can only guess, but I think the huge\ndifferential of 9.1 for SR and 7.9 for Papillon is because most young\npeople have never seen Papillon.\n"},
{"review": "\n\nA film about a Stephen King story? Directed by Frank Darabont.  .  .  Who? \n Starring Tim Robbins.  .  .  Wasn't he the guy from Howard the Duck?  I\n admit, only the sublime acting talents of Morgan Freeman took me along to\n see this movie.  Now the only questions I have to ask are:  Why didn't\n EVERYBODY go to see this movie?  and, Why didn't Morgan Freeman win the\n Oscar?  Tom Hanks is a fine actor but, he should never have beaten Morgan. \n Once again a Stephen King short story translates to film better than his\n horror opus'.  Tim Robbins pulls out his finest performance to date, and,\n Mr Darabont take a bow.  Very rarely are you left with a large smile and\n warm heart at the end of a movie but, I could have danced as the camera\n slowly panned back from the beach.  .  .  Perfect.\n"},
{"review": "\n\nThis movie is one of the best I have ever seen. I first read the book, and I\ndidn't liked it that much, but then I saw the movie. And that's a things\nthat's never happened to me before, the movie was better than the book. It's\nthe other way normally. But in this case, the movie is so much better, I like\nthe end more than in the book.\nWatch the movie, it is great.\n"},
{"review": "\nTim Robbins plays Andy Dufresne, a man convicted of double murder who\nis sent to jail, eventually befriending other lifers including Morgan\nFreeman's Ellis Redding. Exceptionally handsome adaptation of Stephen\nKing's short story \"Rita Hayworth and Shawshank Redemption\" (in the\nfilm version, it's really Raquel Welch, not Rita, who aids in the\nultimate twist). On the surface, it's another prison-genre picture with\nthe usual stereotypes such as a rotten warden, a cruel guard, a few\nhomosexuals, and a quirky old-timer who doesn't want his parole.\nHowever, the film's emotions run surprisingly deep, justice is well\nserved by the conclusion, and several of the cast members carve out\namazing, three-dimensional characterizations. The finale is pure\nfantasy, however it does provide the audience with the release it\nneeds, and Robbins and Freeman are excellent. Long, involved, but\nengrossing and satisfying, \"Shawshank\" was not a big hit at the\nbox-office but found a devoted following on video and cable. **1/2 from\n****\n"},
{"review": "\nI simply fail to understand how this film is so popular... it's quite\nsimply beyond me. The only way I can explain it is that all the fans of\nKing's short story found it very true to the spirit of the book, and\nvoted 10 for that. I really could not find anything worth my time in\nthis film, and apart from a very good monologue from Freeman near the\nend, one or two good lines of dialog and the acting, there's really\nnothing in the whole film worth watching it for. It's about hope... and\nthe director won't let us forget it, so it's repeated until the\naudience mumbles it in our sleep. It's like this short, one-note story\nwas written, and the author just didn't want to end it... so he kept\nwriting... and writing... until someone had the sense to break down the\ndoor and wrestle the pen from him yelling \"for the love of all that is\nholy, stop writing!\" And I thank that faceless man for doing that,\nbecause it is undoubtedly the only reason the film was 142 minutes\nlong, and not 284, or, dare I say it, 568. The film simply drones on\nand on, scene after scene, containing nothing remotely interesting(but\nwith excellent acting, mind you). There's nothing good about this film\nexcept for the acting. Just about all of it is great. I can't really\nthink of anything else to say... I guess my dislike for the film stems\nfrom my hatred of King's writing. I suppose it is possible for someone\nwho is neutral on his works to enjoy this film. I recommend this to\nfans of Stephen King, the actors and possibly Frank Darabont. If you're\nnot a fan of any of these people, I doubt you'd find this enjoyable.\n5/10\n"},
{"review": "\n\nThere is no denying that this is a very good movie. The acting is great and\nit tells a good story. <br><br>Personally, I find it a bit too long and a little too sweet for my taste,\nbut its far from a bad film. <br><br>On the other end of the spectrum I have yet to understand why this film was\nnominated for as many Oscars as it was and why so many people have fallen in\nlove with it. To place it on the same level as The Godfather and several\nhundred other films has to be the result of different tastes.<br><br>This is a film that should be seen because its a good movie, not because its\na great one.\n"},
{"review": "\n\nTHE SHAWSHANK REDEMPTION is very enjoyable, features excellent performances,\nand has won a fanatical following among a lot of people.  I just saw it.  I\nliked it.  But as for becoming fanatically enthusiastic about it, all I can\nsay is, folks, let's not get carried away...<br><br>The story not only is incredibly *simple* (good man unjustly convicted for\nhorrible crime maintains hope in horrible confinement), but is also\nincredibly *simplistic* (the Warden and his men are evil goons, the convicts\nare good).  Complexity is something completely exiled from this\nstory.<br><br>The director, Frank Durabont, offers nothing new in his aesthetic choices --\nSHAWSHANK is stock Hollywood filmmaking, especially of the Spielbergian\nvariety ala THE COLOR PURPLE and AMISTAD.  The soundtrack is overpowering in\nits efforts to imbue the story with \"heartwrenching emotion.\"  The\ncinematography is fine in a sort-of standard-issue, \"seen it before\"\nway.<br><br>Which begs the question:  Is there anything truly *exceptional* about THE\nSHAWSHANK REDEMPTION?  Heck yeah -- Morgan Freeman proves, once again, that\nhe is not only a wonderful actor but also one of the most endearing,\npowerful presences in cinema.  Tim Robbins is fine, along with all of the\nconvicts.<br><br>But overall, I didn't mistake THE SHAWSHANK REDEMPTION for anything\nparticularly new, remarkable, exciting -- in other words, as anything worthy\nof fanatical enthusiasm.  It's a fine Hollywood film that looks, smells,\nsounds and feels like your typical fine Hollywood film.  But nothing\nmore.\n"},
{"review": "\nThe Shawshank Redemption is undoubtedly deserves to be the highest\nrated movie. I watched this movie for the umpteenth time. A movie I\nwould never ever get bored of. Written &amp; directed by Frank Darabont,\nthis prison drama is a simple but profoundly moving tale of hope,\nfriendship &amp; redemption. Cinematography exquisitely captures the\nmonotonous daily life inside prison. The bond that grows between the\ntwo main characters is unforgettable and the score is the best I have\nheard. Morgan Freeman makes us feel the sadness and Tim Robbins, the\nfaith. The more times you watch it, the more you love it, and the more\nyou learn from it Whatever you do, don't listen to the people who say\nthis movie is overrated because this is one of the most inspiring and\ngreatest movies ever. It has everything you could possibly want in a\nmovie. If you don't love Shawshank, chances are you are beyond\nredemption. It is hard to find a more proper word for the film than a\nmasterpiece. It's in my top five movies of all time. I feel so bad\nabout not writing a review of this masterpiece during the late\nnineties.\n"},
{"review": "\nThis movie is a total piece of manipulation. It does have a few\nredeeming features though - Morgan Freeman's narration all through is\npure art!!! This guy acts with his mouth!!! As a piece of fiction it\nhas some merit and I can see why many people would enjoy it. But to be\nclassed as one of the best movies of all time - really? C'mon!!!\nCertainly the portrayal of the brutality of the guards during those\ntimes I would say is fairly realistic.<br><br>The one part of the story where an old timer gets released does ring\ntrue. There are many people like that who are totally institutionalized\nand do not have the skill to survive on the outside without a good\nsupport network in place.<br><br>This is a movie for those people who like everything laid out perfectly\nfor them and doesn't require any thinking. Personally I like a bit more\ndepth and reality.<br><br>I don't want to put people off seeing it - it should be watched once.\nBut for me the flaws outweigh its redeeming features.\n"},
{"review": "\n''The Shawshank Redemption'' is one of the best movies I have ever\nwatched in my life. Tim Robbins is really a good actor and thanks to\nhim this movie is such a success. Also Morgan Freeman is really brought\nme the story. The story is excellent,the time has just flew with this\nmovie. This movie just gets better with every showing. There's no some\nspecial effects and that is just great-just men in prison uniforms\ntalking to each other. Everyone must watch this movie.The Shawshank\nRedemption and To Kill a Mockingbird are the best movies I have ever\nseen. I do not judge it by it's technical merits - I don't really care\nabout that. I have read that Citizen Kane or The Godfather or this or\nthat movie is the best movie ever made. They may have the best\ntechnique or be the most influential motion pictures ever made, but not\nthe best. The best movies are ones that touch the soul. It takes a\nmovie like The Shawshank Redemption to touch the soul.\n"},
{"review": "\nWas a great Movie !! I love the story and the actors were fantastic.\nThere is so much to say about this movie. But look, seriously, look and\nsay it is not a great movie from beginning to end. Of course a good\nsoundtrack also makes a great movie, so the soundtrack also has to be\nmentioned. The Movie Picture is very good. good angles of shooting,\nalways transmitting us the space inside the prison. or rather the space\nthat we have not. And finally, check out this great movie. they\nrepented and were left with a better perspective for life. See the\nmovie, enjoy and learn! To finish just saying that it as a great movie,\noh wait, i already said that, no problem its to highlight the idea.\n"},
{"review": "\nI consider this movie as one of the most fantastic and joyful movie to\nwatch. It touch a social problem that few movie directors and producers\ntook the risk of doing like the institutionalized thing. All of the\nstories developed in this movie even if they are all related of the\nmain character, every own little story is very interesting and full of\nemotions. This movie contains good drama, a different comedy insight. I\nthink I have seen this movie at least 6 times and I just don't get tire\nof watch in it i think every time i watch it i found new things.I\nhighly recommend to spend time enjoying this amazing movie and just a\npiece of advice is take the time to read a little bit the reviw and\nfind no one bad.\n"},
{"review": "\nThe Shawshank Redemption is a movie that creates a sense of mystery and\npower. Tim Robbins and Morgan Freeman carry the movie by displaying\ntheir roles as best friends. After watching that movie for the first\ntime, I remembered clips that are drilled into my mind forever. It is\nbeautifully written and directed. The scene that sticks out to me is at\nthe end of the movie when Andy Dufresne and Ellis Boyd \"Red\" Redding\nreunite at the end of the movie. This promotes the aspect of friendship\nthat will live on forever. Even though these two men have lived in\nprison for years, they eventually got out (well Andy escaped) and they\nstill managed to find one of the most important things in their lives,\neach other. I recommend this movie to all ages. Although this movie may\nbe a complex the first time you watch it, but after several other\ntimes, it still creates a sense of thrill and hope for the viewers. 10\nout of 10!\n"},
{"review": "\nI have been into movies since, well I was 5. But after about 15 years I\nfinally was lucky enough to come across this title. I had a huge\nexpectation when I started watching it.Hey! it ain't number 1 for show\nthat much i can vouch for. Well it took me a few minutes to get into it\nbut well once i got engulfed it was just sheer pleasure and goosebumps.<br><br>The film revolves around the inmates of a prison and a NEW FISH accused\nof homicide joining the faculty.The film depicts How he changed their\nlives and helped them to realize and bring back the greatest gift of\nlife taken away from them . The friendship, the hardship, the simplest\njoy, the tragedies , the yearning for freedom in each breath has been\nbrilliantly acted and directed.The movie makes you feel good.After\nwatching it it makes you smile and strengthens your faith in humanity.I\nam no critic but this movie made me happy, ecstatic and I would love to\nre-watch it again and again. <br><br>so i would say go on watch it at once if you have not. You will love it\nno matter what your taste in films are. Because this film expresses\nhumanity in each way possible. And as a fellow human being you will\nlove the emotions. If you don't then well I will be a bit surprised.<br><br>P.S 1994 was the year of Forrest Gump. It took home all the awards.\nThough it is a great film but in my opinion it remains only great while\nshawshank is one of the greatest if not the greatest movie of all\ntimes. Thank You...\n"},
{"review": "\nThis film is really an amazing movie timeless. <br><br>One of my all time favorites. <br><br>About the long-can write something in a movie. <br><br>Masters said everything I needed There is not yet aware of the movie\nand I watched it for people to watch I would like to invite.<br><br>Than You.<br><br>Shawshank Redemption is a very moving story about hope and the power of\nfriendship. The cast is first rate with everyone giving a great\nperformance. Tim Robbins and Morgan Freeman carry the movie, but Bob\nGunton and Clancy Brown are perfect as the Warden Norton and prison\nguard captain Hadley respectively. And James Whitmore's portrayal of an\nelderly inmate Brooks is moving. The screenplay gives almost every\nactor at least one or more memorable lines through out the film. As\nwell as a very surprising \"twist\" near the end that almost knocked me\nout of my chair. If you have not seen this movie rent it or better yet\nbuy it. As I bet you'll want to see this one more than once.\n"},
{"review": "\nThis film manages to redeem Hollywood in the eyes of people who feared\nit long lost in a dark sea of clichés and predictability. Darabont\nshows us that artists still work in the Hollywood studios and\nproduction facilities. These artists show their capability to produce\nart; real art that inspires you to look at the deeper aspects of life\nand the world around you. The Shawshank Redemption delivers much-needed\nbreath of fresh air for anyone who realizes the capability of film. It\nproves that masters of the craft still live on this earth, and still\nbless us with timeless masterpieces that we will never forget.These\nartists show their capability to produce art; real art that inspires\nyou to look at the deeper aspects of life and the world around you...\n"},
{"review": "\nThis movie is one of my all time favorites. Undoubtedly, one of the\nmost brilliant movies I have ever seen. Story, cast, screenplay all are\ngreat. The directing by Frank Darabont was just magnificent. The\namazing casting of both Morgan Freeman and Tim Robbins is amazing, and\ncouldn't be more accurate. It was narrated by Morgan Freeman, who is\nthe best narrator in Hollywood, I believe. Actually the film depends on\nthe story and the way in which it unravels. It will change the way u\nthink about things around u. Surely, It will teach you one thing that\nit is easy to take away a man's bread, even his freedom, but impossible\nto take away his hope.<br><br>I can say with confidence this is the best movie I have ever seen - or\never will see. If you haven't watch it yet, just GO! Watch it! Now!\n"},
{"review": "\nCould a movie be any more perfect? This movie is just absolutely\nstunning in so many ways. Acting perfect, storyline perfect, soundtrack\nperfect, emotional drama perfect, everything about this movie is\nperfect.<br><br>When this movie first came out it did not reach the expectations that\nmany people expected it to. But as the years went one it was nominated\nfor seven Academy Awards and as it was available for rent everywhere\nmore people started appreciating it and it's popularity grew.\nEventually after many years in the top 5 of IMDb's top 250 movies of\nall time list, it hit number 1 with over one million votes.<br><br>The story is about a well educated vice president of a large bank being\nwrongly accused of murdering his wife and her lover and is sentenced to\nspend life at a large prison in new England called Shawshank prison. As\nthe years go on in his new home he makes friends, enemys and a dramatic\ntwist at the end which became one of the most legendary scenes in movie\nhistory.<br><br>I love this movie. The acting is just so passionate and their\nperformances increases the drama and horror of life in prison. The\nsoundtrack is one of the main reason behind the emotional drama this\nmovie. Many scenes in this movie almost left me in tears mainly because\nof the soundtrack in the background which increases the emotion. <br><br>The cast of this movie include Academy Awards winners Morgan Freeman\nand Tim Robbins. And also William Sadler, Bob Gunton and many other who\nmade this movie what it is.<br><br>Overall it is defiantly the Greatest movie ever made with passionate\nacting, great storyline and plenty of emotional drama about how hope\novercomes fear in a beautifully crafted film about the strength of the\nhuman spirit.\n"},
{"review": "\nWow! what a film this baby is and yes this film is one of the most\nbrilliant films ever written by man and i for one was literally stoked\nfrom the start, so as a future film maker, i hope to one day make a\nfilm like this because if i do i will definitely die a happier man. the\nfilm was just awesome in every sense and i really loved the plot, it\nhad some great cliff hangers and great and classic scenes where the\nmain character became himself more and you just fell in love with him\nso on that basis i would class this film as one of the all time greats\nand if you haven't seen it yet, go out and buy it because you won't be\ndisappointed at all, believe you me.\n"},
{"review": "\nIt's very rare that you find such diversity in a movie now days. I like\nthe story and it's concept.A thumping good ode to friendship, hope,\nwit, wiles and wisdom, brimming with crackling characters and topped\nwith the most twister of twists since \"The Crying Game.\" The Shawshank\nRedemption is a powerful and uplifting, not to mention Oscar-worthy\nfilm. In 2006, it was ranked as the greatest film ever by Empire, a\nfilm magazine. The year it came out it was nominated for 7 academy\nawards but did not win a single one because of a movie you may all\nremember, Forrest Gump. It's the no-bull performances that hold back\nthe flood of banalities. Robbins and Freeman connect with the bruised\nsouls of Andy and Red to create something undeniably powerful and\nmoving. Some of \"The Shawshank Redemption'' comes across as\noutrageously improbable. Yet the film keeps pulling you back with its\nsense of striving humanity slowly turning the tables against evil.\n"},
{"review": "\nAndy Dufresne (Tim Robbins) bides his time during twenty years'\nimprisonment for the murder of his wife in this adaptation of a Stephen\nKing story. And being Stephen King, the setting is once again Maine,\nthough you'll find 'Shawshank State Prison' in Ohio. It's the\nforbiddingly Gothic Mansfield Reformatory, 100 Reformatory Road,\nMansfield, on US Route 30, about 80 miles southwest of Cleveland.<br><br>Built between 1886 and 1910, the reformatory remained in operation\nuntil 1990 and was scheduled for demolition when the film was made. In\nfact, much of the prison yard has now gone to make room for the\nadjacent Richland Correctional Institution, but the striking\nAdministration Building lives on as a tourist attraction. Find it just\nnorth of downtown Mansfield, off South Olivesburg Road.\n"},
{"review": "\nI don't care if there are some poor souls who would like to belittle\nthis film. Just think of these misfits as beyond redemption.<br><br>I saw this film in 1995 and still vividly felt the euphoria of the\nfinal half hour which stayed with me for a couple of weeks.<br><br>I was convinced this was the best film I had ever seen in my life, even\nbetter than Akira Kurosawa's Ran and One flew over the cuckoo's nest,\nwhich was my all time favorite until TSR came along.<br><br>I excitedly contacted my best friend who shared the same passion and he\nconfirmed my thoughts,\"this must be the best film I've ever seen!\" But\nit is sad though that I will probably never see a better film for the\nrest of my life as I have seen the best.<br><br>In music I have heard the best in Rush and Jackson Browne which made\nothers pale in comparison and in movies I have TSR.<br><br>Hail Frank Darabont!\n"},
{"review": "\nAnd I truly mean that. When I first saw this film, I was blown\naway.With superb acting, superb story, perfect emotion and tone, and an\nincredible twist ending that still amazes me, this film is completely\nand utterly perfect. The film speaks of hope, and the film's two main\ncharacters debate throughout the movie about it. One character believes\nthat, in prison, hope is dangerous, and that it should not be used\nbecause it will simply make life tougher. Another character believes\nthat hope is needed, because it helps you to keep pushing for a better\ntomorrow when one does not appear to be in sight. <br><br>While very engaging and immensely entertaining, this film would not be\nheld to such high regards if not for the twist ending, which is one of\nthe greatest movie endings of all time, in my opinion. If the ending is\nmerely average, this film would simply be considered good, possibly\ngreat, but not the masterpiece that it is today. And, watching it\nrepeatedly makes the film even better, because experiencing the events\nthat occur within the story makes the ending even greater. <br><br>I can't speak for everybody, but this is a film that I can watch over\nand over again, and love it more each time I watch it. And, while I\nsimply talked about the ending this entire review, that is not all that\nmakes this film incredible. However, I will not waste any more of your\ntime talking about how wonderful this film is. And please do not waste\nany of your own time. Find a way to see this movie as ASAP. It will be\ntime well spent, and you will certainly see it multiple more times.\n"},
{"review": "\nI have written a few reviews on IMDb and Shawshank is one of my\nfavorite movies of all time. I don't necessarily think this movie was a\n10 but an easy 9 for me. I am giving it a 10 because of the negative\nreviews that I read with saying they gave this movie a 1 just because\nothers had given it a 10. As far I'm concerned it's mine to give, if I\nwant to to give every a movie a 10, (which by the way I don't). I am\njust sick of people telling me that a movie can't be great because it\nwas story driven and not character driven, maybe I like story driven\nmovies, I certainly liked this one. So here's another 10 for you movie\nsnobs will have to eradicate.\n"},
{"review": "\n'The Shawshank Redemption' is perhaps one of, if not the, perfect film.\nEvery other \"great film\", or any film for that matter has it's pros and\ncons. Most motion pictures that are as well received as this have\nplenty going for it, very few against it. While I feel there are films\nout there with better pros; the pro to con ratio of 'The Shawshank\nRedemption' out-stands any other film film ever produced. <br><br>I can't begin to describe every amazing element of this film. Obviously\nthe performances are exquisite, the directing is exceptional and the\nscore is extraordinary. The cinematography, in particular, struck me.\nRoger Deakins is a master with light and framing. <br><br>I will watch this film again and again and remember it as one of the\ngreatest films ever made. This film truly lies within the sweet spot of\ncinema.\n"},
{"review": "\nA very, very, very brilliant film. The acting is superb from Tim\nRobbins and Morgan Freeman, as always. The script was amazing, along\nwith the directing. The film is one of the best films ever made due to\nhow original it is. And the reason it is original is because it is a\nprison film with heart. It makes you care about criminals. The score is\nalso very good.<br><br>It's an enthralling piece of cinema and just... Amazing. I'd recommend\nthis film to anyone due to everyone relating to it. People like films\nwere you are sympathetic towards a criminal, just look at A Clockwork\nOrange.\n"},
{"review": "\nIt is really amazing movie i have ever seen in my lifetime. The cast\nand the story of the movie are really successful. Andy is a passionate\ncharacter, and he is convicted of murdering his wife and her lover\ndespite his claims of innocence. It is so touching to spend almost two\ndecades in the prison. Old-fashioned prisons in the 90s are full of bad\nguy who don't expect anything from the life. And , they don't think how\nwe escape here. However; Andy with his close friend in the prison , Red\n, tries redemption from this prison, by the time , Andy tries to do\nbeneficial things for people in the prison not to attract attention. It\nis unbelievable that they escape from this prison. But , Andy\napproaches to place of exit. It is actually amazing , it is really\nincredible. They go to their dreams to live a peaceful and quiet life.\nAlso; Andy prepares a trap for the chief of the jail. After the\nredemption , they become free anymore. It is really an amazing movie.\nEasily one of the best movies made during the 90s and definitely one of\nthe top 'prison' movies of all-time. Pretty much everything about this\nmovie works and works extremely well!\n"},
{"review": "\nDeservedly ranked at the top of IMDb's all-time best 250 films ever.<br><br>The casting is superb: Morgan Freeman is \"Red,\" a wise observer of\npeople and an entrepreneur inmate who's made \"connections\" so he can\nget contraband to other inmates for a price; he's under a life sentence\nfor murder. Tim Robbins is \"Andy,\" a smart banker and accounting whiz\nwho was sentenced to 2 life terms for killing his wife and her lover\n(which he--like most other inmates, say they're not guilty of). And Bob\nGunton is \"Warden Norton\" who, when we first meet him, is touting the\nvirtues of Bible reading and strict discipline. While, fortunately,\nI've had no first hand experience, \"Shawshank\" certainly gives the feel\nof authenticity of prison life and its society.<br><br>A long movie, most of it takes place inside a semi-corrupt state\npenitentiary in the late 1940s. \"Red,\" in talking his thoughts out loud\nto himself, becomes our narrator for many developments. As the story\nunfolds, increasingly we come to see Andy as a person with strong\npersonal values which he upholds in the most difficult situations. And\nin Andy's work for Warden Norton, we also increasingly find the warden\nas morally his opposite: selfish and fundamentally lacking decent moral\ncharacter--all show and appearance and with no integrity, substance.<br><br>In Roger Ebert's first review (of his two) of this movie, he said:\n\"....the film is an allegory about holding onto a sense of personal\nworth, despite everything....the word redemption is in the title for a\nreason....\" Most viewers will agree.\n"},
{"review": "\nThe Shawshank Redemption is undoubtedly the best best movie ever. The\nOscar's biggest mistake was giving Forrest Gump the awards that\nShawshank deserved. Not to take credit from Forrest Gump which is also\nan amazing movie, but it just can't compare to Shawshank. Morgan\nFreeman arguably delivers his best performance and Tim Robbins gives a\nperformance that I feel is greatly underrated, and also deserved an\nOscar nomination. The films art direction adds to the story's beauty,\nand gives off a feeling that fills you with hope. I remember seeing The\nShawshank Redemption on sale for $5 at Wal-Mart and thinking \"I heard\nthis is good\" so I bought it. Little did I know the film was worth more\nthan gold. I bought the film and put off watching it for a couple\nweeks, not overly anticipating watching it, but finally decided to\nwatch it when I was bored. I am a gigantic movie buff, and have so many\nmovies it's almost pathetic, but The Shawshank Redemption changed my\nentire view of film. Now, every time I watch a movie I can't help but\nthink \"It can't beat Shawshank.\" Some people say that this movie is\noverrated, but that's wrong. Shawshank is an actual work of art, to be\ncompared with works of DaVinci and Picasso. When people say this movie\nmakes them cry, they don't mean to say it's so sad, but that they\ndidn't know that something of such beauty could be conveyed on screen.\nI believe that if everybody see's only one movie during their life, it\nshould be this one. See it now. After that, IMDb will seem like a whole\nnew website because every film will seem like a different movie. It is,\nby the very definition of the word magnificent.\n"},
{"review": "\nthe Shawshank redemption should be played throughout the world in all\nschools to teach people the hard life of prison but the bond between\nfriends and the idea of hope. Morgan freeman is a second to none actor\nhe lays the role perfectly and i could not think what the film would be\nlike without him. all the other actors perform perfectly. this movie is\na movie of inspiration and one of which will get people through harsh\ntimes. this film always restores my faith in mankind i simply love it.\nI first saw this film sitting on my brothers desk and i was intrigued\nby the idea of a film set in prison where hope and other morale values\nwere the storyline instead of violence and havoc, this is a amazing\nfilm which brings pride to the actors and crew who produced it. the\nsetting of the movie is one of perfection the Gothic grounds and the\nstunning facilities astound me i'am finding it hard to put in to words\nhow much this film means to me i would say it is one of the greatest\nfilm's ever made in my time and i love it.\n"},
{"review": "\nIt has a formula that gives you this kick; Darn what a good movie! But\nI need to say this, sometimes it happens.. So WHY do people love this\nmovie and rate it high, when, or WHY isn't the \"smart\" people declare\nit like a a peace of art? Or do they?! Still I think it's darn\ngood...but I bet the producer(s) didn't expect that!<br><br>Like when we vote, for anything, we need to follow our heart. This is a\ntypical movie that is worth every penny, every letter... and it's a\ntypical 90' movie! Oh.. there we have it! Between gone with the wind\nand now, we NEED this! Love me as I am.. says the storyline, in my head\nanyway. And I do, yes I do!\n"},
{"review": "\nIm not going to sit here and go into a deep explanation of what this\nfilm is about, because that has been thoroughly explained in many of\nthe other reviews. What I will say is that The Shawshank Redemption is\nwithout any doubt the most amazing film ever written. The acting is\ntremendous, the story is original, and the movie itself has a deeper\nmeaning to it. This movie is not about the hardships of prison, it is\nabout the importance of friendship and the realization that hope is\nyour greatest aspect. This piece does not focus as much on Andy and his\ngreat escape from Shawshank, but more on Red finding that there is\nalways meaning and a purpose for everything. The story really unfolds\nwhen Brooks, an old timer that Andy and Red had been close friends\nwith, is put on parole and released from prison. After confronting the\noutside world and knowing that he could not cope with it, Brooks finds\nthat he has no purpose outside of life in jail and hangs himself. Later\nin the movie, after Andy makes his great escape from prison, Red is\nfinally released from Shawshank himself, and is put in the same\nsituation as Brooks. Only one reason marks the fact that Red himself\ndidn't commit suicide. That reason is Andy. Red figures out that he\ndoes have a purpose outside of prison which is to see his best friend\nagain and to \"give him a handshake\". And as the movie comes to a\nmarvelous ending, that hope to see Andy becomes a reality.<br><br>Overall the best movie I have ever watched and I am glad to say that I\nwill continue to keep watching it again and again and again.\n"},
{"review": "\nThe 'Shawshank Redemption' undoubtedly deserves to be the highest rated\nmovie. The movie depicts how a four lettered word 'Hope' brings wonders\nto our lives and makes something impossible to possible.<br><br>Though the plot of the movie focuses on how Andy Dufrane, a falsely\nconvicted prisoner gets out of the prison, the beauty of the movie lies\nin the characterization of Andy Dufrane (just amazing) and how he\ninfluences his fellow prisoner 'Red'. The narration by Morgan Freeman\nin the role of 'Red' is perhaps one of the best narrations i have ever\ncome across. This story proves that the king of horrors, Stephen King,\nis equally good at any other genre of 'Story Writing'(Hats off). The\ndialogues towards the end of the movie about hope are truly inspiring.\nThe background score of the movie is excellent. Tom Robbins and Morgan\nFreeman at their best in the roles of Andy Dufrane and Red\nrespectively.<br><br>Didn't watch the movie??...go grab a DVD and watch it as soon as\npossible. Can't miss a movie like this....\n"},
{"review": "\nThis movie I'm not going to call this film the IMDb #1 movie, but I\nreally can't deny that this is fantastic. The cast, the score, the\nwriting, and the power are all here in this film, and filled with\nstrength. It's one of those movies that you will continue to think\nabout even after the film is over. It is about a friendship, a life, an\nevil, and a hope. A hope that is considered in many ways to be bridge\nto insanity inside the prison walls. We see these people as years of\ntime goes by. We see friendships grow, and topics change. It really\nputs you in the prison, and makes you feel what's like to behind those\nbars. You feel the friendship, the hope, the darkness, and the pure\nhorror of it all.<br><br>4 stars out of 4\n"},
{"review": "\nI haven't seen too many movies that I would rate a 10, but I had no\nproblems giving this one top score.<br><br>Movie-making seems to be like golf; for a truly excellent game, ALL the\nelements must come together. Everyone involved must have perfect\n\"form\". Director, Darabont, must have been at the top of his game when\nhe put this gem together. Of course the actors were excellent; Morgan\nFreeman and Tim Robbins seldom disappoint. The thing that makes this\nmovie exceptional is that Darabont coaxed the best performances out of\nthe supporting actors also. Bob Gunton and Clancy Brown were utterly\nbelievable (and bad guys don't come much worse than them).<br><br>The other essential ingredient for a successful movie is simple: It\nmust have a well thought out plot with a perfect beginning, middle and\nend. So many movies fall over by getting at least one of these aspects\nwrong. Not so with Shawshank Redemption. Just like Goldilocks said,\n\"This is just right!\" Buy this one for your home collection because\nyou'll definitely want to see it again.\n"},
{"review": "\nI totally adored the concept of hope in this film. I love how the\ndirector portrays the Shawshank tyrants as corrupt murderers, that's\npretty much what they are and serve as the grounds for the escape of\nAndy. Now Morgan Freeman's got talent, I love that guy he may not be\nthe greatest out there but he is a force to be reckoned with on the\nset. I loved how he gave the story flavor with his descriptions of\ncharacters and perceptions of how life was in lonely jail cells of\nShawshank. You know there's a lot more to say about this movie, it's\ntoo good too be true. Especially the ending which by the way brought\ntears to eyes, the most moving scene!!! Overall it was superb and all\nthanks to Stephen King for putting this in the form of alphabets in the\nfirst place. I'm starting to regret not reading any of his novels. And\nkudos to the director for even coming up with such an idea for a movie.\n"},
{"review": "\nOne of my favorite movies ever,The Shawshank Redemption is a modern day\nclassic as it tells the story of two inmates who become friends and\nfind solace over the years in which this movie takes place.Based on a\nStephen King novel,this movie makes us feel different watching this\nfilm than most others as this is an incredibly realistic film.Tim\nRobbins stars as Andy Dufresne who is convicted of murder and Morgan\nFreeman as Ellis Boyd \"Red\" Redding who is a fellow inmate and close\nfriend of Dufresne and Bob Gunton as Warden Samuel Norton who is the\nWarden of Shawshank State Prison and is a character who has mixed\nfeelings and emotions towards everyone around him and a character who\nis sometimes easy to like and at other times easy to despise.This film\nis easily considered one of the greatest films of all time and I\ndefinitely agree with this fact.It was nominated for seven Academy\nAwards including (Best Picture, Best Actor \u0096 Morgan Freeman, Best\nAdapted Screenplay, Best Cinematography, Best Editing, Best Original\nScore, and Best Sound) but didn't win any due to tough competition from\nthe film Forrest Gump.I personally think that Tim Robbins should have\nbeen nominated for the Best Actor award as he really gave the\nperformance of his career.Bravo to this brilliant modern day classic!\n"},
{"review": "\nWhen i rented the movie, i was doubtful, whether to rent it or not.\nThen i started watching it. From the very 1st moment i was kinda sure,\nit wud be worthy watching this; and worthy it was. The fascinating\nperformance of Morgan Freeman and Tim Robbins, the direction, and\neverything puts you in the place of the actors, making you feel the way\nthey felt. This movie doesn't have any dirty romance or impossible\nactions, rather, it focuses on a greater philosophy - Hope to live when\nthere is no hope, survival -- This is one movie, that will leave you\ntalking about it even many days after watching. I won't say anymore,\nthe rest is up-to you to find out when you see the movie\n"},
{"review": "\nAt the time of writing this comment, IMDb ranks the Shawshank\nRedemption as No. 2 in top 250 best movies of all time. Let me tell you\nthat this is no exaggeration and no small feat given IMDb's strict\nrating criteria. Shawshank is indeed, up there amongst the best, and if\nyou haven't seen it yet, you should make it a point to watch it, at\nleast once sometime in your life. For it is an astonishing tale, of\nendurance, courage, life, and perspective, combined with a stunning\nscore that flows so closely with the highs and lows of emotion that it\ncould make grown men cry. No words can explain how good Shawshank\nreally is, but let the sheer volume of good user reviews made by\ndevotees in this website be proof enough of its greatness.\n"},
{"review": "\nTo be honest, I enjoy reading a good novel more than watching a film.\nYou usually get far more character development than in a movie (e.g.\nPuzo's The Godfather).<br><br>But not with Shawshank. This is the closest thing film has to a perfect\nstory. The characters, pacing, plot, monologues and every other element\ncontribute to an inspirational yarn with a fulfilling ending. <br><br>Brook's suicide is the only film scene that has ever moved me to tears,\nand if you watch just one film in your life - let it be this. Not a\nfilm which others have tried to mimic for a good box office, e.g. LOTR:\nThe Return of the King, The Godfather, but an original, stand-alone\nfilm that, in my opinion, will never be surpassed in quality\n"},
{"review": "\nThis is one of the best movies ever made. Not really because it's\nreally really good but because everyone likes it! I can't think of\nanyone who doesn't like this movies, young, old, male, female and over\nthe entire globe! Good Work! It's a story about a man (Tim Burton) who\nis cent to jail for a crime he didn't commit (the murder of his wife\nand lover). In jail he meets good and bad people like always. One of\nthem is Morgan Freeman. He is the guy who can get you anything you\nwant. Because Tim Burton is innocent and a very intelligent guy he is\ndesperately trying to find a way out of this jail. The relationship\nbetween Tim Burton and the rest of his jail-mates can be touching but\nalso horrible and with some violence. This is a great \"feelgood\" movie\nabout hope, love, hate and freedom!\n"},
{"review": "\nWhen i watched this film i thought now whats this going to be like?\nAfter watching it i thought it was a brilliant film,fantastically acted\nwith greats like Morgan Freeman and Tim Robbins and Bob Gunton. Very\nrealistic and definitely one of my absolute favourites of all time. At\nthe end it made me cry and thought about life. Every time i watch it\nthe film brings a tear to my eye. Fantastic film and worth\nwatching,it's really realistic film and another one of stephen king's\ngreat stories, a story of hope and many people who have watched will\nsay the same thing - if you haven't seen this film already then watch\nit, it is brilliant, just brilliant!!<br><br>be prepared to be moved, it's such a breathtaking journey for the whole\ntwo hours. A truly lovely magical film, my favourite of all time\nfantastic\n"},
{"review": "\n\nThis movie is one of the greatest I have ever seen. Morgan Freeman gives\nan\nunbelievable performance in this work. The direction of it is exquisite\n(and gives much to Tim Robbins character, I know he is a good actor, but\nthe\ndirection gives so much more to him).  The soundrack is unparalleled and\nthe\nstory is exquisite (thanks to Stephen King).  I have seen many greats,\nCitizen Kane, The Godfather, Cuckoo's Nest, The Deer Hunter, Apocalypse\nNow....etc. This movie is fantastic, and the fact it didnt' win (or even\nget\nnominated) for an Oscar is the reason I don't pay attention to the Oscars\nanymore. This movie is fantastic, and an artistic triumph. I have no\nrespect\nfor the Academy for ignoring this flick.\n"},
{"review": "\n\nPeople look for all sorts of things in movies, and you can see it in the\noccasional negative review that pops up for this movie.  Some viewers are\nlooking for gritty realism in everything on the screen.  Others are action\njunkies.  Still others perhaps take film too seriously and reduce\nmoviemaking to nothing more than a game of who can come up with the edgiest\nshot, or the niftiest angle.  For all of these, there is the very real\nchance that they simply will not \"get\" this film, and that's too bad -- they\nare missing out on a classic.<br><br>At its best, film can transcend merely being a series of pictures, no matter\nhow pretty, and can reach down and touch people.  That is where Shawshank\nsucceeds so brilliantly.  It is not the fastest moving movie, not the\nedgiest, not the grittiest, it is filmed in shades of gray.  But this movie\nabsolutely sings with human spirit, and captures an universal human theme as\nwell as any movie has ever done.  And THAT is filmmaking at its finest.  Not\na game, not eye candy -- this movie stays with you long after the credits\nhave rolled.\n"},
{"review": "\n\nIt deserves ten stars. Its beauty lies in its slow pace and genteel wit,\nalthough some may not have the patience for the slowness. But the whole\npremise of life inside a prison cell makes better sense when told in a calm,\nemotion-building, pace such as this. Otherwise, one would never get to know\nTim Robbins's quiet accountant (and what makes him appear alternately shy,\nsnobbish, and suicidal all at the same time); or Morgan Freeman's\ngenial-but-cynical lifer- not to mention how he's \"a man who knows how to\nget things.\" I love what the film doesn't do: it doesn't make an issue of\nits two leads being different races (although one could claim that makes\ntheir friendship all the more marvelous), it doesn't pull any sensational,\nfar-out, action punches (as films with an all-male cast often do), and it\ndoesn't freeze its characters into types. Everyone is real and everyone is\nflawed- from James Whitmore's bird loving veteran to Bob Gunton's\npretentious, icy, warden. But the finish (which really starts around the\nfilm's last twenty minutes) is one of the most powerful and moving things\never committed to film. Get it in either format. \n"},
{"review": "\nWell let me start off by saying I felt compelled to write this review\nto spite the numerous people who give it a 1 out of 10 \"because they\nfeel it should be lower then a 9.3\" and go on to write what they really\nthink, to you people I write this: you should vote it according to what\nyou think the movie should be, i.e. if you think the movie deserves an\n8 out of 10 then you should vote as such, I think this movie deserves a\n10 out of 10 and so I have given it as such.<br><br>As for the movie, I can't tell you how incredible it is in my opinion,\nit is the only movie to date I could watch again and again, and not get\ntired of watching it, the cast was spot on everything was perfect, the\nsubjugation of the prisons by Captain Hadley, all of it was simply spot\non, honestly speaking I don't know how people could watch this and fail\nto see how truly amazing it is, well deserving of its number 1 spot on\nIMDb.<br><br>Also I read that people don't understand how Andy \"pinned\" the pictures\nto his wall, it could be either celotape or bluetac and as you see\nduring the movie, Andy works from under the poster when digging his\nhole so there is no plot hole of \"how he put the poster back up after\nentering the hole\" because the poster never gets taken down.\n"},
{"review": "\nI'd never heard of \"The Shawshank Redemption\" when I tuned in to it\nabout 15 minutes in on one of my satellite channels, sometime around\n1997 or so.<br><br>It mesmerized me, and the last 20 minutes astounded me. The twists, the\nmusical score, the final scene. Amazing.<br><br>I recall doing some searches (in those pre-Google days, probably with\nAlta Vista) to find out if anyone else had ever heard of this film. I\nfound out that they had. It turns out a whole lot of people discovered\nthis film as a \"sleeper,\" on DVD or cable or satellite.<br><br>My favorite movies of around that time, seen in theaters, had been\n\"Pulp Fiction\" and \"Heat.\" I didn't see \"Forrest Gump\" until around\n2000 or so, and didn't care for it much. A good year for films.<br><br>Given the comments in the past half year or so (that I've gone back\nthrough), I suppose \"Shawshank\" will fall below some other films. There\nseems to be a a trend toward making \"Hey, it's not all that!\" (That is,\nit's not all that good, it's lousy, it's overrated, etc.)<br><br>Whatever, it's a great film. And when I happened to see it late one\nnight on my satellite system, I thought I was the first to realize how\ngreat it was. It took several years for me to spot the high ratings on\nIMDb and to read that it had become a cult classic favorite.<br><br>(Ditto for \"The Big Lebowski,\" which for a while I thought I was the\nonly fan of. Now it's a subject of festivals and midnight watchings,\nsort of like \"Rocky Horror\" once was. I saw \"Rocky Horror\" in 1976 at\nthe World Science Fiction Convention in Kansas City and thought it was\nnot very entertaining.)<br><br>For me, the last 20-30 minutes is just the best. One twist after\nanother, all seamlessly done. And a compelling musical score.\nUnforgettable.\n"},
{"review": "\nThere are only a few movies that one will see in their lifetime that\naffects the course of your life. I have loved The Shawshank Redemption\nsince I first saw it, but only recently had its powerful effect shown\nto me. In short order I lost my father to illness, my wife to\nseparation, and my career to anger and dismay. Lost in depression,\nmired in pain, and alone in a large house I watched it again. Between\nBrooks suffering, Red's hatred of hope, and Andy's response to his\nfinal isolation, I stopped feeling alone. It is simple...get busy\nliving or get busy dying. This movie gave me the strength to start\nover. The movie is popular for many reasons, but it has a healing power\nfor people trapped in their own Shawshank.\n"}
]