[
{"review": "\nI was lucky enough to see an advanced screening for this film. I had a\ntoss up between two films to see and I chose this one based on the\ntrailer and generally positive reviews (who likes to waste their time\nwith bad movies). <br><br>Wow.<br><br>This is one of those rare feats in filmmaking. The cinematography is\ngreat, but see this for the acting and the story. Not often has a movie\nmade me cry, laugh, and shout out (aloud mind you) during the films run\ntime. I don't want to spoil much of the story as it becomes obvious\nearly on, what is actually going on. The magnificence of this film is\nin how the director was able to tackle the difficult subject matter in\na way that doesn't leave you feeling like you saw an average\nthriller/horror movie, but really out it in perspective of the child,\nwhich I believe had a humanistic approach. It was amazing. Best movie\nof 2015, by a long shot and they're were great movies this year. (Im\nlooking at you exmachina) <br><br>Not only I, but I feel absolutely everyone who left the theater left a\nbetter person for what they witnessed. Not often do I come out of the\ntheater with people being more polite than they were upon entering.\nTHAT is the power this movie has, I emerged myself in the experience\nand I'm glad I did, because \"No one is strong alone\", certainly not I,\nand I have a more profound idea of appreciation of my own life and\nexistence til death. I will continue on my quest but I know that I will\nnever forget this landmark film, what it taught me, and how it humbled\neveryone in the theater.\n"},
{"review": "\nI know one thing, I will never, ever forget this heartrending,\nunbelievably-acted 'movie' for the rest of my days. I'm just at a loss\nfor words and struggling to describe how truly powerful and\nheart-grabbing this story was. I'll go so far as to say that if you\ndon't cry, shed a tear, or feel the urge to weep profusely after (or\nwhile) watching Room, you don't have a heart. The mother (Brie Larson)\nand her son (Jacob Tremblay, 9 years old!) carry this entire movie. The\nbeauty of Room is in its bare rawness, realness and universally\nrelatable nature. What can I say? It tapped into something deep, deep,\ndeep within me and just ripped my heart to shreds and had me in tears;\nsometimes tears of sadness, and other times tears of heavenly joy. It\nmade me smile at times and even laugh. But most of all, it always had\nmy eyes glued to the screen and my soul enthralled by what I was\nwitnessing. This is one of the best, truly real stories ever told and\none of the best uses of cinema I've ever seen. ...Try not to read\nmuch/anything about it before going in to see it (and yes, definitely\ncatch it in a theater near you ASAP). Go in and be engrossed and moved\n(in ways I can't describe) by this experience. 10/10 *Hands down* the\nbest film of 2015, and the single best thing I've seen in years. :')\n"},
{"review": "\n*Insert all 9 &amp; 10 reviews here* I was in awe during the entire film.\nLenny Abrahamson &amp; the writing team made sure there was not one dull\nmoment. The addition of \"insignificant\" characters and plot twists are\nlater realized to be so significant and influential in keeping the film\nalive throughout its duration. It was the little things that made this\nstory one of the best I've seen in a long time. I experienced an entire\npalette of emotions all at once and was left in a deep level of\ncuriosity and reflection. Very few films have the power to continue to\ninfluence its audience after the credits. Room is endless in the most\nbeautiful way.\n"},
{"review": "\nRoom (2015/I) was directed by Lenny Abrahamson. It stars Jacob Tremblay\nas Jack and Brie Larson as his mother (\"Ma\")<br><br>The situation becomes very clear early in the film. Jack and his mother\nare held captive by a man who has kidnapped her, raped her, impregnated\nher, and uses her as his sexual slave. Jack and his mother have lived\nin a small, locked shed, which they call \"Room.\" Jack's mother has\nlived in \"Room\" since she was abducted seven years earlier. Jack has\nlived there for all of his life--five years.<br><br>By incredible ingenuity, motivated by love, Ma has kept Jack from\nrealizing the horrors of their situation. It's hard to believe that\nanyone could be so motivated and capable, allowing the boy to believe\nthat his situation is normal, but it works in the film and you accept\nit.<br><br>What happens next is pretty well known, but I won't go into it because\nit might decrease your enjoyment of the movie. It's dramatic,\nfrightening, and, heart-wrenching, all at the same time.<br><br>Brie Larson does a wonderful job as the mother, and Jacob Tremblay has\nto be the best child actor we have. He is absolutely brilliant.\nDirector Abrahamson must be an extremely talented man to draw two such\ngreat performances from his actors.<br><br>This is a must-see film, but it's not easy to watch. Even though Room\nwasn't based on any specific incident, we all know of cases of warped\nmen who have kidnapped and enslaved women. It's hard to think about the\nlives of those women without becoming depressed. <br><br>We saw the film at the excellent Little Theatre in Rochester, NY. Given\nthe claustrophobic atmosphere of the movie, it will work on the small\nscreen as well. Seek it out and watch, but prepare yourself mentally\nbefore you begin.\n"},
{"review": "\nBased on the novel of the same name by Emma Donoghue, 'Room' is a\nchallenging, unsettling, harrowing film, that leaves you disturbed. But\nthat is its sheer power. The Incredible Performances only add to the\nfilm's hefty nature.<br><br>'Room' Synopsis: After five-year-old Jack and his mother escape from\nthe enclosed surroundings that Jack has known his entire life, the boy\nmakes a thrilling discovery: the outside world.<br><br>'Room' is a disturbing story about bad things that happen to good\npeople. But its also about hope &amp; fighting back. Its shocking to see\nthe protagonist, a child, discover the world along-with his brave\nmother, who survived a harrowing experience. I was engrossed &amp; often\ndisturbed by the narrative, especially after the son &amp; mother escape.\nThe series of events that follow are so gut-wrenching, I almost broke\ndown.<br><br>'Room' is masterfully penned by Emma Donoghue herself. The Writing is\nconsistently powerful &amp; the dialogue are realistic to the core. Lenny\nAbrahamson's Direction is first-class. He has handled this dramatic,\nunsettling tale with complete flourish. Cinematography is perfectly\nclaustrophobic. Editing is razor-crisp. Art Design is skilfully done.<br><br>Performance-Wise: Brie Larson &amp; Jacob Tremblay deliver incredible\nperformances. Brie is astounding as the tormented, yet brave\nprotagonist, while Jacob steals the show with a flawless performance.\nThe child does wonders &amp; makes 'Room' unforgettable. Of the supporting\ncast, Joan Allen &amp; The Always Solid William H. Macy leave a solid mark.<br><br>On the whole, 'Room' is a must watch! Its certainly unsettling, but its\npower is undeniable.\n"},
{"review": "\nDon't listen to the haters or those that want to chip away at the\noverall brilliance of 'Room'. What film doesn't have small flaws, they\npale into insignificance during the 2 hours of continuous emotional\nmaelstrom that follows. This film wrings every last drop of emotion and\ndrama out of the allotted playtime. Make no mistake, despite short\nbursts of touching serenity, this films starts up full throttle and\ndoesn't let-up. I can only assume reviewers here scoring this film 8 or\nless must be Vulcan by birth, or just terminally insensitive. This is a\nfirst rate drama with stand out performances all round. Especially from\nthe child protagonist. <br><br>**Warning** If you have trouble viewing emotionally charged material of\na sensitive nature about abuse. You would be well advised not to view\nthis film.\n"},
{"review": "\nToo many tears, too much sadness. Story of a teenager Ma kidnapped,\nraped and made a mom. And mom and son Jack locked in a room away from\nthe world. Really sad when Jack said I don't want to be 5 I want to be\n4. Even a 5 year old wants continued happiness in simplicity and in the\narms of his only friend his own mother. He wants to be breast fed , he\nwants to shower with his Ma. He enjoys the only place he knows for his\nfirst 5 yrs of his life. There is no chaos from the real person he\nknows. Ma wants Jack to rescue them from the room. Life outside the\nroom has its' own problems of tears, cries, fights.<br><br>Excellent writing by Emma Donoghue who wrote the novel and the\nscreenplay. Jacob Tremblay as Jack and Brie Larson as his mother Ma are\nterrific. Every scene, every dialogue has sincerity. Oscar worthy\nscreenplay. Oscar worthy acting . Joan Allen as Ma's mom and Jack's\ngrandma is perfect grandma, loving, caring, sensitive and excellent.\nDefinite Oscar nominees. Jacob Tremblay , so young and so perfect in\nevery scene.\n"},
{"review": "\nI haven't seen a genuinely emotional, smart, non-manipulative, heart-\nfelt drama in a loooong time. Brie Larson deservedly won an Oscar for\nher performance in this, but Room should've swept the board in every\ncategory.<br><br>The film centres on a Mother and her five year old son, living inside\njust four walls, and it slowly transpires that she has been held\ncaptive for seven years, and had a child by her kidnapper. She creates\na world for her son within their confines, not telling him the truth\nabout their situation and what's outside until he's old enough to\nunderstand. After failed escape attempts in the past, but now with the\nhelp of her son, she gives freedom another try.<br><br>There were moments in Room that were so intense that I barely breathed.\nIt never feels inauthentic, and thanks to incredible acting, it's\nalways believable. If you want a straight-up thriller of 'bad guy\ncommits crime, bad guy gets comeuppance', you'll be disappointed. This\nis about human resilience, the bond between Mother and child,\nselflessness, and finding your place in the world after having your\nunderstanding of it flipped upside down.\n"},
{"review": "\nThe movie has some issues with pacing (way too slow for me), annoying\nhand-held camera and lack of good score that is ESSENTIAL to carry a\nmovie that is slow paced and takes place in a single room.<br><br>The kid is easily the best part in this movie. He is very good in his\nrole and could have been nominated for a high-ranked award. I also\nliked Tom McCamus. Very nice low-key role. I thought I knew him from\nsomewhere (and not just because he looks like Lou Reed) - He was in\nPOSSIBLE WORLDS (great movie), got pretty old since then.<br><br>The movie is slow and simple. I expected a much smarter plot. The lead\nactress is OK, but I don't think it's Oscar material.\n"},
{"review": "\nUnique story line, moving, and great acting. The kid gives a beautiful\nand very convincing performance, especially during the more emotional\nscenes. But after they escape, it's mostly just melodrama where the\ndaughter accuses the Dad of not caring and the mom says the daughter is\ninconsiderate of her feelings, etc. 2/3 of this film is very\nreminiscent of some sappy ABC Family drama, like The Fosters. If you\nare a fan of The Fosters, you might enjoy Room, as the two are equally\nas boring. I also dislike the way this movie antagonizes journalists\nand portrays them as close-minded vultures. During the interview, the\nreporter seems to victim-blame and provoke Brie Larson's character,\nwhich is something no professional, ethical reporter would do under\nthat context in real life.\n"},
{"review": "\nThe first 45 minutes or so of \"Room\" are awful to sit through. While\nthose minutes are crucial to the rest of the story, seeing how a grown\nwoman and her five-year-old son survive while locked inside a 10ft. by\n10ft. outdoor shed is a tough task for any viewer. Director Lenny\nAbrahamson and screenwriter Emma Donoghue, adapting her own novel, free\nthe captives (and the audience) before too long--and yet, mother and\nson's new life in the suburbs is nearly as uninteresting as life in\nthat shed (I'm not sure this is intentional). Thankfully, Brie Larson's\nOscar-winning performance as the exhausted, anxious (and guilt-ridden)\nsingle mom facing a strange new world is riveting on occasion, while\nthe (not implausible) center of the story--an awakening, if you\nwill--is emotional, if never quite fascinating. As an acting exercise\nfor this cast, the material must have looked like a godsend. Abrahamson\nis careful with his actors; he allows them to think and breathe and\nhurt and heal. But all this drama could take its toll on an impatient\naudience, so personal judgment will have to dictate whether or not the\nmovie is a success. **1/2 from ****\n"},
{"review": "\nI have been waiting to see this movie for months. I read the book one\nholiday and found it gripping and haunting. Sadly, the film did not\nachieve the level of drama that the novel had in abundance. My husband\n(who has not read the book and knew nothing of the story) was in\nagreement. So many missed opportunities to look into the minds and\nemotions of these characters. The acting was fine but far too much of\nwhat made the book so fascinating was skimmed over and I'm not sure\nwhy..... I was particularly disappointed by the characterisation of\n'Old Nick' (mid-cast, I feel, and we see little of his confused and\nconfusing state of mind. Jack's relationship with the objects in the\nhouse is skimmed over and the conflicts of the grandparents were simply\nalluded to rather than properly explored. Perhaps this\noversimplification of a complex and gripping story was an attempt to\nconvey what was happening through Jack's eyes? If so, it didn't work\nfor me.\n"},
{"review": "\n'Room' is a powerful and tense movie that tells the story of a young\nboy who has been confined to a small box shed his whole life after his\nmother was abducted by a man, the boy's father, known only as 'Old\nNick' in the movie.<br><br>The movie centers around their escape and life in the world thereafter.\nAs you would expect, it makes for a tense couple of hours of viewing\nbut the viewer is rewarded in the end. The heartwarming relationship\nbetween mother and son is what makes this movie.<br><br>'Room' is a gripping movie that will take you on a roller-coaster of\nemotions, but it's well worth the ride.\n"},
{"review": "\n\"Room\" shares the innocent perspective of a 5 year old named Jack who\nis led to believe by his mother that life consists of being inside a\ntiny room forever.<br><br>I can relate this movie with \"Life Is Beautiful\" and \"Pan's Labyrinth\"\nbecause in all this titles we see a young human with such an innocent\nperspective and big imagination that somehow softens the cruel reality\nby tricking the mind and distorting what is actually happening.<br><br>\"Room\" also shows the psychology of both of the primary characters\nafter living through a traumatic experience. Jack not being able to\nwalk upstairs since he had never done it before in Room is one example.<br><br>This movie made me feel grateful about my life because you get to see\nJack and his mother happy after all. Torwards the ending of the movie\nJack says \"since Ma and I don't know what we like, we decided we are\ngoing to try everything\". That's my favorite part of the movie because\nit means Jack is finally ready to open himself up and be a part of the\nbig world.\n"},
{"review": "\nThis movie has appeal, mainly to women and feminine types, based only\non emotion.<br><br>The strength and devotion of the mother toward her child is well\nportrayed, however, and the boy does a great job of acting like a\nspoiled and over-protected child. The mother's love in spoiling the\nboy, given the terrible circumstances, is quite loving and appropriate\nthough.<br><br>The movie is boring as would be living in a small room for 5 years\nwithout ever going out. That is the essence of this film.<br><br>Naturally the critics, and those with more emotion than intellect, are\ngushing over it.<br><br>Watch it and find out if I am wrong.\n"},
{"review": "\nNow, I don't think it was bad, thought it was ehh , I just wish the\nfilmmaker had done more. Never while in Room did I get the sense of\nclaustrophobia to emphasize just how tiny the area that the characters\nwere in was (which really makes the fact that they actually filmed in\nthat tiny area pretty pointless), or hopelessness, and imprisonment, to\nhighlight the unbelievable amount of time that they've been there;\nInstead, we are just told this information. In addition, due to not\nreally getting what situation these characters were in, made it really\nunderwhelming when they made their rather fortunate escape; there was\nno feeling of awe at this, seemingly, new and strange environment (like\nin Oldboy, The Hurt Locker,and The Descent), and it's clear with the\nslow-mo, and shots of Jack's (Jacob Tremblay) face that was what they\nwere attempting.<br><br>Aside from what I'd wish they'd done, there were also some questionable\nand unfitting music choices throughout, and two scenes: during and\nimmediately following the escape. The two scenes came off as awkward,\nunrealistic, and contrived; and the acting and characters in these\nscenes were both bad and annoying.<br><br>Besides the already mentioned, the acting in this film was good, with\nBrie Larson being the standout. And though I thought Jacob Tremblay was\ngood, for a kid, I didn't think his performance was amazing or award\nworthy, like I had heard previous to watching Room. Just because his\nperformance was better than most child performances doesn't mean it's\ngreat.<br><br>I appreciated the way they decided to take the story, and I liked the\nway Brie's character's struggles were handled, and to be honest, that's\nit.<br><br>With all this pessimism, it may be hard to believe that I didn't hate\nthis film, but I didn't; I just thought it was meh. Nothing special,\nand I won't be seeing it again, though it is watchable.\n"},
{"review": "\nThere it is the first movie of the award season which I did not think\nmuch of. Don't get me wrong it's a decent but thoroughly average film.\nThe movie starts out promisingly and does a couple of things right,\nmakes no mistakes but does nothing special or extraordinary with the\nsituation. I gave the movie the benefit of the doubt and was hoping the\npsychological aspects of the film would step up in the second half but\nit didn't do so, the second half completely changes the situation for\nworse, there are new problems to deal with and the movie goes about\nthem in it's usual half committed way which was prevalent in first\nhalf. The acting is definitely the strong suit of the film, Brie Larson\nis amazing and I would be OK with her winning the Oscar, though I\ndidn't think much of the film I thought she was great. The kid played\nby Jacob Tremblay showed amazing depth and variety for a young child.\nThe weakness of the film is direction, it does not capitalizes on it's\nsetting, it has no great scenes and does not visually grab you at\nanytime (I am not reading a book I am watching a movie), also sometimes\nBrie Larson's character is quite inconsistent and unrealistic\nsometimes, she shows very few signs of PTSD, it sometimes feels she was\ntrapped in Room for weeks not seven years, not her fault though,\nanother misstep by the director, along with not capitalizing that Jack\nmaybe better off without Joy (it touches so less on the REAL issues\nit's infuriating).\n"},
{"review": "\nIt's too long and it gets very very boring some times. There are a lot\no movies which exploit much better this idea In the beginning of the\nmovie there is not even a clue what is going on but i guess this is a\nmovie trick used by the director.It's not about the fact that they have\nnot escaped in those years. It's about the fact that the movie,after\nthey escape shows a very little preoccupation for the true situation of\nthe characters,of the inside fight. At least it is a better candidate\nfor the Oscar prize, but it is not a movie which deserves a position in\ntop 250 or to be nominated for Oscars. It is good when you put it\nbesides the big short,spotlight,the revenant,bridge of spies, but come\non... I hope Mad max will have a serious chance for winning the prize\n"},
{"review": "\nThe movie has its moving moments, especially the emblematic one with\nthe kid staring in awe at the newly discovered world, but that's about\nit. The story is overly unrealistic and both the psychological drama\nand the physical misery lack depth.<br><br>17-year-old girl is kidnapped with the lure that some sick dog needs\nher attention. This is followed by 7 years of imprisonment in a\nbackyard shed (the so-called \"Room\") and regular raping, which \u0096 in the\nsecond year \u0096 produces a child. The mother accepts the fruit of the\nrelationship (named Jack) without reservations and from that moment on\nher only goal is to keep it safe. A goal in which she succeeds with\nflying colors. And so, no matter his complete isolation, the misery of\nhis existence, and the fact that he is a constant, although\nunconscious, witness of his mother's abuse, at 5 Jack is both mentally\nand physically healthy, even happy child, he has smooth skin and\ncomplex reactions and the only sign of his unusual circumstances is his\nlong hair...<br><br>I didn't even have to use irony \u0096 the whole thing is flat enough on its\nown. Actually, I see it as an insult to anyone who have lived through\n\"the Room trauma\" \u0096 be it real, or more metaphoric. It sets ridiculous\nstandards for the victims while what they truly need is understanding\nand compassion. But yeah, let's say that mother's love conquers it all\nand clap our hands.\n"},
{"review": "\nThe concept was a good one to take on as there have been a number of\nhigh profile abduction cases over the past twenty years or so. But I\nwasn't totally convinced with the script on this one.<br><br>It was a good effort in showing the psychological problems and scars\nthat the victims are left with. For me, the best part of the movie was\nthe last 15 minutes - they were the most realistic. And the final\nnarration by the young lad was well written - but a five year old\nwouldn't be that eloquent. The first half of the story based in the\nroom didn't really work well in my estimation.<br><br>Despite that, all the major players did a fine job, although I wouldn't\nsay Oscar worthy. I wouldn't recommend people to go the movie theater\nto see this one - you can wait till it comes round on streaming or a\nmovie channel - or Red Box.\n"},
{"review": "\nIn a small room, Ma (Brie Larson) is celebrating the fifth birthday of\nher son Jack (Jacob Tremblay). There are no windows except for a\nskylight and no obvious door. Jack's understanding of the outside world\nis limited. It's soon obvious that they are prisoners of a man they\ncalled Old Nick. Ma finally tells Jack that her name is Joy Newsome and\nshe was taken when she was 17 some 7 years ago. Jack angrily\ndisbelieves at first. Joy comes up with a daring gamble to escape back\nto her parents (Joan Allen, William H. Macy).<br><br>This is a star-making role for Brie Larson. Her performance in 'Short\nTerm 12' is amazing but little seen. She once again delivers a\ntop-notch performance. She has inner strength and humanity. Jacob\nTremblay is a wonderful discovery with his squeaky little voice. It's\nan almost perfect little film. I was wondering where this movie was\ngoing at certain points in the middle but I think it ends in the\nperfect place.\n"},
{"review": "\nits a nice movie. shows the love between the mother and her son. the\ntrust between. the social satire of how victims are sometimes just a\nmedia thing. it shows how some decisions changes one life. hats off to\nthe child actor who did a wonderful job. one can feel how much\nterrified he was when being asked by her mother to play dead. the movie\nalso make us learn how to grab happiness from the smallest source\npossible. almost half of the part shot in the room. enjoy the movie. i\nsuggest watch it with your family. when the movie starts its very tough\nto guess about the next scene as initially the story revolves around\nhow the mother do not want her child to get out. its later when the\nfather cameo first we get to know she was been held as a hostage. the\nson wants a birthday cake but don't get what he fancy. anyhow its the\nmother who decides to break the chain. the innocence of child is seen\nwhen one can see how he panic when he is told what happens on t.v. is a\nreal world out there. they plan and eventually get out of that room but\nonly to get trapped in another one. this time a bigger one.\n"},
{"review": "\nRoom has a fairly simple premise. Most people if they've seen the\ntrailer know how the story goes. Woman and her son are locked in a room\nfor several years. Eventually they escape but now have to negotiate a\ndifferent version of reality. But which is realer to Jack who has only\nknown the inside of the same 4 walls for his entire life? Will either\nof them be able to cope?<br><br>This is a surprisingly sweet film given the darkness of what happens in\nit. Perhaps this is because at times our point of view is that of the 5\nyear old boy. His mother has concocted a fantasy world in order to\nprotect him from their harsh reality. And so we don't feel shocked when\nwe hear her routine rape (albeit unresistant) because it is made to be\npart of the normal routine of 'room', for Jack's sake.<br><br>The planning and implementation of Jack's escape is the most harrowing\nand tense part of the film. I was shouting at the TV for him to get the\nhell up and run.<br><br>When they escape things don't get any easier. Real life is new and\nfrightening and the readjustment a shock to the system for both. The\nfilm then shifts from the relative simplicity of room to the much more\ncomplicated real world. <br><br>The acting in the film from the two leads is great but particularly\nfrom the youngster. I know Larson wins the Oscar (and she is good) but\nTremblay's performance is more affecting. I really couldn't tell if he\nwas acting or actually just being himself. <br><br>I'd recommend this to anyone with an open mind who doesn't mind\nsomething a bit different. No explosions in this one, just family\ndrama, human relationships and human nature, all told without pretence\nor sugar coating.\n"},
{"review": "\nFor us adults, our childhood room was a place of great memorabilia:\nwhere we used to study, play and hear stories from our parents before\ngoing to bed. In this Emma Donogue's adaptation, we visualize the ugly\nside of it, where dreams do not exist, and that any kid would like to\nerase from his mind.<br><br>For Jack, 5 years of age, in the shoes of Jack Trembley, the room is\nall there is. His entire childhood contained in four walls, and the\nunconditional love of her \"ma\" (Brie Larson).<br><br>This movie was a complete challenge, in terms of narrative, a humble\nroom, where a mother and her son switch dialogues to tell us a true\nstory. At certain points one might think it goes slowly, but it manages\nto finish in a great way.<br><br>This film was greatly promoted and backed by outstanding supporting\nactors such as William H. Macy (Fargo 1996) and Joan Allen (nominated\nfor three Academy Awards). Highly recommend if you are looking to have\na fine movie afternoon, with great leading performances.\n"},
{"review": "\nHow is capable soul of a man to overcomes all obstacles and to exceed\nall expectations to achieves that is intended?How are we able to return\nto real life following a terrible trauma.How shall the society and the\nfamily sees us following a return \"from the dead\"? Is it possible that\nquiet life to become most difficult than life spent before under\nviolence of someone?I see this film as an expression of love of the\nmother towardsthe child.What is able to make a mother to the best of\nher child? How will exceed when faced with a difficult situation?How\nimportant is the ability to enter into the world of the child?If you\nhave extinguish sentiment towards the atoning sacrifice of the mother\nand want to givelife your feeling towards mother, I recommend this\nfilm.\n"},
{"review": "\nBut that title was already taken. Also Room is pretty accurate and hits\n\"home\" (no pun intended). But while I had no idea what I would get with\nthis (apart from the title and the lead actress I didn't know one piece\nof information), most will go into this knowing what it's about. The\ngeneral idea is explained fairly quickly, though the why of the closed\nspace or rather location and the reason for staying might take a while\nto sink in.<br><br>If you already know some of the whys because of the trailer or reading\nthe story, don't be afraid though. The movie moves forward and it does\nnot stay stagnant at all. That is true regarding the story, but the\ncharacters have some other issues to solve. Talking about solving, you\nwon't get all the answers for this, but this is a pretty good and\nstrong depiction psychologically speaking of what persons go through,\nwithout getting into their heads. Great acting and drama make this a\ngreat movie ... if you like the genre that is of course.\n"},
{"review": "\nWell its January 20th and the games already up. My favourite film of\nthe year has already been watched. At least if it hasn't then this is\nreally going to be a banner year. This is an incredible film with\nfantastic performances from the 2 leads. Brie Larson is, as is always\nthe case, excellent, but is blown away by an unbelievable performance\nfrom young Jacob Tremblay. It can only be because of his tender years\nthat he didn't receive Oscar recognition as I don't believe we will see\na better performance this year. Of course a lot of the credit for this\nmust go down to fantastic direction from Abrahamson. As for the film,\nit is abhorrent, terrifying, warm, emotional, uplifting and life\naffirming, and not necessarily in that order. Your emotions change from\none way to another many times throughout the run time. The genius of\nthe film is that it shows the world from the child's perspective, after\nwatching imagine how it would have looked if it had been showed from\nthe mothers and shiver.\n"},
{"review": "\nI'm compelled to write this review because of the 8 score, which is why\nI watched it. I found it on an all-time list of best films, higher than\nsome timeless masterpieces, and checked with IMDb. Has cinema really\nbecome so bad that this is considered a highlight? The synopsis hinted\nthat the film would address re-assimilation issues which could have\nbeen interesting. But wasn't. They weren't even plausible, which didn't\noccur to me at the time because I was drifting off. A very young boy,\nwho has spent his whole life in a shed and is suddenly thrown into\nsuburban USA, behaves no more traumatised than a shy child meeting\nsomebody for the first time. And as for the escape plan...<br><br>Don't be fooled, this are no deep insights, no personality\ndevelopments, and no twists. There is no drama, no laughs, no tension\nand very little emotion. The tone of the film is just so lifeless. Film\nis supposed to be an art form. Art requires love and passion from the\npeople creating it. There are a couple of genuinely moving moments, so\nI raised the score to a 3, but they stand out simply because the rest\nof the film is so dull. It seems that the reality TV fad has passed\nonto fiction. I recall the early Big Brother series and people watching\nwhile celebrities lay snoring in bed. This is the fictional equivalent.\n"},
{"review": "\nImagine you spend your first five years of life in a small room, you\ndon't know about outside world, you think that the room is the whole\nworld. What do you do when you get out into real world?<br><br>Room is obviously the one of the most touching and inspiring drama I\nhave ever watched. It is a story of five years old Jack and his Mother,\nMa who live together in a room. Young actor Jacob Tremblay played the\nrole of Jack. He was tremendous, he acted like everything a five years\nwould do. He is happy kid, with lots of interests, loves his Ma and\ngets angry sometimes. His Mother told him room is the world and there\nis no outside when he was young. When he became five, she revealed and\ntried to convince him about the existence of world. <br><br>Jack got out and amazed by the outside world. He became attached to his\nGrandma, her friend and their dog. But his mother needed some time to\nadjust with all the changes. Actress Brie Larson did so great in\nportraying Ma character that she won an Oscar award for her role. She\nis the most deserving candidate, the emotion and attachment she showed\nfor her son was impressed.<br><br>The direction, story-lines and acting of all the casts is great, so is\nthe background music and cinematography. A must watch movie for\neveryone.\n"},
{"review": "\nAn amazing story that will make the viewer go through every human\nemotion possible; even more so by connecting through the boy's\nperspective of his journey through life as he knew it.<br><br>Any words will all fall short to describe how worth this movie is. <br><br>It will definitely change something inside of you, and make you\nremember a time in your life when everything was fascinating and\nmeaningful, a beautiful lesson on the relativity of happiness, bravery\nand love of a mother wanting to stay sane through her struggles to help\nhim never learn of the sad truth of their own experience and reality.<br><br>Cinematic masterpiece, strong story and storytelling, powerful and\nrich. it will also raise awareness for terrible crimes that happen\nevery day, but brings hope to the victims and their families.<br><br>Watch the movie it's worth every second of your time.\n"},
{"review": "\nA young boy is raised within the confines of a small shed. Room is one\nof those movies that i almost hated it the first 20 or maybe 25 minutes\nor so bored me to death and seeing a boy with long hair looking like a\ngirl truly made me laugh but as the film goes on i found out that it's\nactually pretty great seeing this mother played by Brie Larson doing\neverything in her power to save her kid Jack played by Jacob Tremblay\nwas really inspiring in a way and if you erase those 20-25 minutes the\nfilm is really great the performances by the 2 leads are really great\nand it's a powerful story as well but also the characters are well\nwritten and interesting and that's why i'm going to give the Room an\n8/10.\n"},
{"review": "\nAn incredibly powerful and hard hitting film about the dark and\nsinister part of life that leaves you pondering the harsh realities of\nhuman evilness and the ability to overcome and heal from terrifying\nordeals.<br><br>This film was a masterpiece in every aspect from unbelievable acting to\nwonderful story telling and directed to the highest standard. Brie\nLarson puts on the performance of her career and truly captivates as a\nyoung woman who was tragically kidnapped, imprisoned and abused by a\ntruly evil man intent on using her for his own sadistic needs. <br><br>This film tells the story perfectly and keeps you thoroughly engrossed\nthroughout, a great feat especially in the second half which shows life\nafter their escape from 'Room'. The grittiness and true courage to make\na film like this is highly commendable and its originality and\nuniqueness will forever stand out among the rest.<br><br>One underrated thing is the performance by Jacob Tremblay who plays\nJack, a scared young boy who struggles to grasp the true scale of life\nand everything in it. He is definitely a person to keep an eye on for\nthe future and I'm sure he will have a successful career in acting\nshould he continue on. <br><br>Overall an simply stunning piece of cinema that is acted perfectly,\ntells a lasting memorable story and is directed/edited wonderfully, a\ndefinite add to the collection and easily one of the best films I've\never seen.\n"},
{"review": "\n\"Room\" is a very brilliant film about a five year old boy name Jack\n(Jacob Tremblay) and his mother who escapes out of a room that Jack has\nonly known his entire life. This film is way better than I thought it\nwas going to be. I thought this was going to be one of those boring\nfilms that got nominated for and grabbed numerous awards. I was wrong.\nI was very impressed at the way this film was played out and was\ndelivered. Imagine being a five year old boy who has only known an\nenclosed room his entire life and then escapes and live through the\naftermath of it. This sets the stage for a brilliant film. At times I\ndid want Ma (Brie Larson) to whip Jack (Jacob Tremblay) during and\nafter the imprisonment and I did find myself getting angry with Ma\n(Brie Larson) after their escape. This shows the immense drama that was\nplayed out throughout this film. This film truly deserved the Oscar win\nand nominations it got.\n"},
{"review": "\nThe movie is one of those \"not only for entertainment\" but also for\nlife changing, the message is really deep and will have an effect to\nthe life of the audience if it was deeply meditated. <br><br>I am not that kind of a person who likes to write much or review, but\nthis is an master piece of art, it so much reminds me of \"Danny the\nDog\" movie with so much differences but with a one real similarity of\nawesomeness. <br><br>I would recommend this movie for everyone who ask about \"Life- changing\nstories\" and how the world, facts, inceptions, truth and life shall be\nimagined. <br><br>This movie is also a need for our time of madness, extremism and all of\nthe terrorism our days are having, since if we all knew and understood\nthe message of that movie; we will always be tolerant and understanding\ndifferences. <br><br>I really will let my two daughter watch this movie over and over again\nonce they can understand it.\n"},
{"review": "\nRoom is a Wonderful movie based on the book by Emma Donoghue. First of\nall, you should avoid watching the trailer of this movie if you really\nwant to experience the movie as it should be.<br><br>The story takes place within ''Room'' , a confined space with only a\nsingle skylight for daylight. The condition of the room is bad, it\nlooks all dirty and not sane at all. You can quickly see what's going\non, within the first minutes of this original Drama film. I don't want\nto say too much, because you just need to experience it yourself during\nthe viewing, and you will quickly understand what's going on. It made\nme cry, it made me smile, it made me have a hell of a good time, that's\nfor sure and also, it made my heart beat so fast during some scenes,\nand really care about this kid and his mom.<br><br>The acting is superb.Brie Larson (Ma) delivers one of the best\nperformance as an actress, if not the best, for this year. Jacob\nTremblay (Jack) is one of the finest young actor I have ever seen in a\nmovie. Normally, young actors bother me, but this young man did a\nreally good job. The movie deserves the Oscar nominations, as Brie\nLarson.<br><br>All in all, i strongly recommend you to buy this movie at full price if\nyou are looking for a good drama movie. Comment Comment | Permalink\n"},
{"review": "\nWhat a film. What an excellent film. It is about a boy who grows up in\na room and it was all he knew until him and his mother finally escaped.\nThis is storytelling at its best. The acting was gripping and\nemotional. I honestly can not believe this movie was so engaging. The\nwriter and director literally thought of everything. I think the reason\nwhy this film works as well as it does is purely because of the\nattention to detail. You feel everything the boy does when he sees and\nunderstands things for the first time. Another thing that the movie\nexcels in is pacing. For the past 5 or more years it seems like most\nmovies have had pacing problems. This one works well and never rushes\nor bores you to death. You can write a book about why this movie is so\ngood. It is thought provoking, entertaining and a breath of fresh air\nin a world full of CGI bullsh!t without plot. I highly recommend this\nwork of art.\n"},
{"review": "\nOMG I'm so excited. Thanks to everyone who has acted,supported or made\nthis beautiful movie. Pure love is what I saw in this epic movie. It\ninspired me to come here,create my IMDb account and make a review.\nWhata wonderful and thrilling movie. Best characters since The\nShawshank Redemption. I feel like I've been waiting for this movie. If\nyou missed this one then you are lucky to watch it now. Anyway I'm\ngonna watch it again. If you don't like it I'm sure something is very\nwrong with you and you are weird and schmuck 😛 just kidding. But you\nwon't regret it. Just go for it. finally I hope you have a great time\nwith your mom or with your son :)\n"},
{"review": "\nEver since Larson won Best Actress for her portrayal in Room, I've\nwanted to see the movie. And now that I've finally got round to seeing\nit: heck, did she deserve that award\u0085<br><br>Room is incredible. The script is raw, honest, unsettling, and brought\nto gut-wrenching life by brilliant performances from Brie Larson and\nJacob Tremblay. Larson and Tremblay embody their characters perfectly\nand both shine equally; Tremblay sorely deserving an award himself for\nproving that child actors, too, can be brilliant at what they do.\nLarson's portrayal of Joy \"Ma\" is incredibly real and moving, and she\nclearly involves herself in the role with everything she's got and\nmore. Her whole heart and body is in the woman she portrays, and her\nchemistry with Tremblay makes them an unforgettable pair. <br><br>Not only is the film well acted, but it has strong, thought- provoking\nmessages throughout, and there is never a dull moment. The people\nbecome real, their struggles become real, and you cannot help but\nsimply appreciate and respect the solid, powerful work of art you are\nwatching. <br><br>With impressive camera work and additional brilliant performances by\nthe ever reliable Joan Allen and William H Macy, Room's domestic\natmosphere and firm establishment in reality makes the film one of the\nbest of 2015. Its real brilliance, however, is due to the stunning work\nby its two leads. Larson and Tremblay portray a mother and son\nrelationship that cannot fail to tug at your heart-strings.\n"},
{"review": "\nAfter God's love for us all, a mother's love for her child is the most\npowerful force in our universe. Never is this inestimable strength more\nexplosively in evidence than in the relentlessly gripping domestic\ndrama \"Room\".<br><br>Brie Larson unequivocally earns her Best Actress Oscar as Ma, a young\nwoman who at 17 is kidnapped by a sick fu-- and held as a sex slave in\na suburban backyard garden shed for the better part of a decade. During\nthis time she bears a son, Jack (Jacob Tremblay in a stunning and\nutterly natural performance). For five years this boy believes the\n\"real world\" consists only of this 11 x 11 foot prison he and his mom\ninhabit. Until the day that Ma stuns him with the declaration that\nthere is a vast and diverse existence beyond the four walls of \"room\".\nAnd she hatches a plan that may just lead to at long last freedom from\nthe sinister oppression of the evil incarnate \"Old Nick\".<br><br>At this point in the story Director Lenny Abrahamson takes us on the\nrocky journey experienced by survivors of unspeakable trauma, both from\nthe perspectives of those who lived through the ordeal and those whose\nlives were devastated in the \"not knowing\". It is here where Larson and\nTremblay, along with the great Joan Allen as Ma's mother, Nancy, and\nTom McCamus as her partner in particular, shine with poignant ferocity\namidst a consumptive crucible of relief, remorse and regret. And never\nis there a false note struck among the emotional carnage.<br><br>As \"Room\" concludes we find Ma and Jack together gaining at least some\nmeasure of closure to the horror that has befallen them. And while it\nis certainly not a happy ending by any standard, it is nonetheless one\nof, while admittedly tenuous, hope for the future. And considering what\nmay have been in this oh so sad chronicle, this represents infinitely\nmore than we as an audience could have hoped for at the outset of this\ndeeply moving examination of the triumph of the human spirit.\n"},
{"review": "\nFirst and foremost, I am not going to bore you by dighting redundant\nsynopses or herrying superficial details, I am just going to cut right\nto the chase and talk about the raw, at times wlatsome, emotion in\nwhich this participial film dabbles and therewith I shall besay to you\nwhy this film is so good.<br><br>It is so good because: \"what it begins with, what things appear or\nhappen in the opening shot, I could not tell you (mainly due to the\nfact that I was awake for about 30 to 35 hours straight at the point in\ntime when I started to watch this film), but despite all of that I can\nstill tell you what I felt, which is incredibly rare. At the beginning\nof this film, I felt claustrophobic, uncomfortable and a little bit\nconfused, and what is more incredible is that I felt the same exact\nthings at the end of this film. From the very ord to the very end, it\nspan me 360 degrees with such emotional might and main that my head\nwouldn't stop spinning for quite a considerable throw thereafter. I\nthink this is the best complement I can pay to a film, in that it is\nsomething new and fresh, something which the most part of men have\nnever laid eyes upon, a thing completely distinct, but more than that\nis that unlike thousands of other movies that I have watched in my\nlifetime this is one of those rare few from which I walked away feeling\nsomething very strong for quite some time and that is worth a lot in my\nhumble opinion.\"\n"},
{"review": "\nThis movie, is one of my best ever! Brie Larson and Jacob Tremblay are\nawesome ! Just perfect !!! Go ahead, you will not regret it !! \"Room\"\nby being inspired by real facts this dirty Austrian affair of which in\nparticular, already had enough to call out(to question) us. One has to\nnote that Lenny Abrahamson was more than as high as this difficult\nstake and One has to note that both main actors Brie(Brie cheese)\nLarson and Jacob Tremblay who embody Joy and Jack are fabulous and give\nwithout concession all that they have to offer! This intelligent movie\nnever overturns into the pathos, but takes place as study and analysis\nof this horrible confinement of 7 years...\n"},
{"review": "\nThis movie starts of strong and really powerful. The maim characters\nbeing in a situation that is completely unimaginable. The actors\npresent this exceptionally well. Jacob Tremblay's performance is\namazing for a kid of his age, I have lost count of how many movies that\nhave such average young actors, but this is an outstanding breakthrough\nfor me.<br><br>This movies is not amazing throughout. Once they are free, it is kind\nof interesting to see that whole transition, but I believe that it is a\nwast of half the movie, it starts to drag on without meaning or a\ndefinite mission/goal. the second part is just pointless.<br><br>Overall, this is a movie well made and worth watching!\n"},
{"review": "\nJoy has been held captive in a tiny garden shed for 7 long years and is\nraped every night by her kidnapper. Jack, her 5 year old son, born in\ncaptivity, has no concept of the real world outside. His only\n\"contacts\" with the external world are a television with often blurred\nsignals and a skylight. Jack is cheerful and finds new ways to amuse\nhimself every day, playing with shadows or a rat that intrudes into\ntheir \"home\". Joy is biding her time, waiting for Jack to grow up so\nthat he can be told the truth. The bond between mother and son in that\nclaustrophobic Room is extraordinary. This is the better half of the\nfilm. <br><br>In the second half, Jack and Joy gain freedom in a rather ingenuous and\ndramatic way. They have to now come to terms with the real harsh world.\nAs they struggle to cope with their newfound lives, so does the film in\nkeeping pace with their struggles. We can see Joy's pain, but cannot\nempathize with her. How does fortitude desert her so quickly? This is\nwhere the film tends to stumble a bit.<br><br>Though Brie Larson's \"Ma\" fetched her an Oscar, it is 10-year old Jacob\nTremblay, who stuns you as the 5-year old Jack. It is a portrayal that\nwill haunt long after you have returned to your rooms.\n"},
{"review": "\nEmma Donoghue has adapted for the screen her Booker Prize-nominated\nnovel - loosely inspired by some real events - which tells the story of\na young woman called (ironically) Joy kidnapped seven years previously\nand held in a garden shed where five years ago sex with her captor\nresulted in the birth of her son Jack. <br><br>It sounds horrific, but in the end it is actually inspiring because it\nis less about detention and more about relationships - not just between\nmother and child but between mother and her parents and between child\nand his grandparents.<br><br>By the time I caught up with the movie, it had been nominated for four\nAcademy Awards and won one, Best Actress for Brie Larson who, most of\nthe time, appears with no make-up and gaunt. But all the performances\nare impressive, not least that of young Jacob Tremblay as Jack. <br><br>The novel is narrated in his words and the film uses his voice-over\nfrom time to time which give added poignancy to this remarkable and\nmoving story. Jack is just five and forms a special relationship with a\ngrandparent and I am grandparent to a little one who is just five, so I\nfound the film especially resonant.<br><br>Irish director Lenny Abrahamson has done brilliantly in conveying the\nphysical confines of the eponymous room and the psychological\nrestraints under which we all operate. I didn't like his previous work\n\"Frank\", which I found too weird, but this is a triumph.\n"},
{"review": "\nTo start this off right I must say that Room (2015) is an amazingly\nwell done film! At first when I saw the trailer for Room I was unsure\nif I'd want to watch it, not that it didn't seem good; I was wondering\nif it were gonna be one of those very slow drawn out films as Hollywood\nseems to push out; this wasn't one of those. In Room 2015 they\ndisplayed perfect acting, a beautiful, yet thrilling story; the concept\nof this film was on point in all ways.<br><br>Room is one of those films that everyone should check out, the way the\nteam put it all together just couldn't have been any better; perfection\nto say the least. Room (2015) is a film in which will be in our tops\nfor a very long time.\n"},
{"review": "\nSo finally here is one cinematic experience of a lifetime.It starts in\na claustrophobic tone, gradually cheers up and finally ends up in an\nintrospective mood.The basic idea of the movie is how we adjust\nourselves in different circumstances.Things can be easy even when the\nexternals are odd.Things can be tough even when everything is a bed of\nroses.It is up to us and how we cope with the change.And only the brave\ncan fight it back to normalcy.This is what you call a layered plot,\ninterwoven with human emotions like joy, sadness, madness,depression\nand sense of freedom.Brie Larson as Joy (Ma) is brilliant.Her\nexpressions,change of tone,hysteria,eyes lit up the character and its\npleasures and agonies.Deservedly she bagged the coveted Academy\nAward.Joan Allen as the sensitive grandmother does a brilliant job.But\nit is the kid Jacod Tremblay who steals the show.He is too brilliant\nactor for a kid of his age.His narration towards the end of the movie\nmakes your eye moist.The other casts do justice to their small\nroles.'Room' is a winner all through.\n"},
{"review": "\nI just love how the world around the two main characters continuously\nexpands during the whole movie. How the director, like a painter on a\ncanvas, keep adding details to their lives.<br><br>From our narrow point of view, we can appreciate and comprehend how\nstrong and clever this girl is, how thoughtful she has been for\nshrinking her son's world to just one Room, protecting him from\nexcruciating reality of her kidnapping and daily rape.<br><br>The movie depicts well the aftermath too, where pressure relief\ndestabilise her mind while the kid, who were none the wiser, can't\nfigure out the reason of his mother's sudden behavioural change.<br><br>So, for crying it out loud, it's a very pleasant movie with a\nwonderfully cured psychological part.<br><br>Enjoy it.\n"},
{"review": "\nI just wanted to add my thoughts here because, as great as some of the\nmovie undeniably was, I felt the balance was all wrong. Once they had\nescaped, with barely half the running time elapsed, all the tension\nwent out of the film. I was sitting there thinking - okay, so what is\ngoing to happen to fill the next fifty minutes? The answer? Pretty much\nnothing, sadly.<br><br>Don't get me wrong, the final scene was very moving, but I still got\nthe feeling that the movie peaked during the escape and then just sort\nof ambled around for the remainder. which is a great shame, because I\nwas really enjoying it up until that point, not least the stunning turn\nfrom the young actor playing the kid.<br><br>I think I understand what the film was trying to achieve in being\nstructured the way that it was, it just didn't work for me personally.\nI'm actually quite a fan of non-linear plots, and maybe that's\nsomething that would have enabled the director to keep building the\ntension to the very end whilst still showing us the aftermath of the\nordeal.\n"},
{"review": "\nI gave this movie a 10/10, because it has your attention the entire\ntime- From the beginning to to the very end! The actors must be\ncommended for their exemplary performance! The movie addresses a\nterrible crime, that unfortunately does go on in the world today, and\nallows us to get a feel of what the victim goes through-the suffering,\nthe pain, and the eventual recovery. For the 2 hours we are Ma'- A kind\nperson who unfortunately goes through so much undeserving torture and\npain!<br><br>In the same breath we appreciate a beautiful world through the eyes of\na pure soul! The director allows us to hate the evil the world has to\noffer, but also appreciate that there is also so much good and beauty,\neven in the small things! One of the best films I have seen; it was\nraw, touching, and painful! Guaranteed to draw emotion out of everyone\nwho sees it! It is definitely a must watch! The videography and music\nplayed was also very well done!\n"},
{"review": "\nFirst off I'd like to point out I am not a professional movie reviewer\nbut I have a passion for movies like no other. So with that being said\nand out of the way, WOW! I have seen this movie five times already and\neach time I see it it's like watching it for the first time. I cry and\nI feel like my whole body feels every emotion Brie Larson conveys\nthrough her portrayal of Joy. As for Jacob Tremblay for such a young\nactor I feel he nails his character Jack on the head perfectly. For\nanyone who has children you will most definitely get chills watching\nthis film. I believe it was written so well and executed beautifully.\nThe way the story is told and how was absolutely genius. I feel as if\nits a hard movie to describe to someone without giving away any aspects\nto the film. Room is a movie that makes you look at things a slight bit\ndifferent. Makes you questions things you might not normally question.\nGives you a contrary perspective on how what may be \"normal\" on the\noutside isn't what it seems.\n"},
{"review": "\n\"Room\" is the rare film that improves on the book on which it's based.<br><br>I had a complicated reaction to the novel. I found the first half\nactually set in the room to be nearly unbearable. I'm a father of young\nboys and trying to imagine the scenario set up in the book made me\nalmost physically ill. I'm not sure I could have read the whole thing\nif the mother and her son had not escaped from their captor, but once\nthey did, I felt like the air went out of the book and everything that\nhappened after was much less compelling.<br><br>The movie spends much less of its time in the room itself, because what\ntakes pages and pages to describe in the book can be conveyed much more\nquickly with a few carefully chosen images. Therefore, more of the film\ntakes place on the outside, but the filmmakers do a better job of\nmaking that the compelling narrative. The movie becomes a tribute to\nthe resilience and adaptability of children, and captures that feeling\nparents experience when the world and all it contains once again\nbecomes a wondrous place because they're seeing it through the eyes of\ntheir children.<br><br>Brie Larson won an Oscar for her performance, and while I certainly\ndon't begrudge her the win, I didn't feel that her performance was\nnecessarily the slam-dunk best of the year that her dominance of the\nawards circuit suggested. The one who amazes in the film is Jacob\nTremblay, playing Jack. He carries the film in a way that many adult\nactors can't manage, and some of the later scenes, especially those\nwith his grandmother (played by a wonderful Joan Allen), quietly\nreduced me to a quivering mess.<br><br>Grade: A\n"},
{"review": "\nBased on a best selling novel, \"Room\" chronicles the story of a lady\nand her son held captive by a kidnapper, who actually is his biological\nfather, in a shed comprising merely a 10 X 10 room. For the boy, the\nroom is the only world he has known. The only medium he can see outside\nis the skylight in the room. The story may sound a nerdy fiction; but\nthe film focuses much on the psychological aspects and discovers the\nstory of desolation and motherhood which comes vividly alive on the\nscreen. There are few scenes in which the boy and the mother have\nscreamed to each other which could have been avoided alas they were\nlike the scenes demanding the Oscars. Nevertheless, the film won an\nOscar for the best performance by an actress. The film avoids big star\ncast or sets; but still the film is rich in emotions, performances, and\nbeauty. The film just beautifully portrays the perspective of a five\nyear old boy who doesn't know the world for real except for what his\nmother has told him or what he has seen in the TV screen. The emotional\nattachment portrayed between the two is awesome. Brie Larson's\nperformance doesn't yet equal the winning Oscar performances from Julia\nRoberts or Hilary Swank, but still she appears stunning and well\nportrays a petrified lady held captive for six years. Few sequences are\npretty familiar, but there are certain moments in the film for which\nyou are drawn to it.<br><br>Rating: 3 stars out of 4\n"},
{"review": "\nI could share all sorts of insights about characters and plot lines and\nnuances and musical score, anon anon. But the truth is, it had me\ncaptivated (no pun intended) from start to finish. I honestly can't\ndescribe it, it's just absolutely breathtaking. I wept in pain for the\nboy, and I wept in pride for the boy, knowing full well this was\nfiction. The actor who played him (to take nothing at all away from\nBrie Larson) was absolutely brilliant in this movie.<br><br>All I can say is what I titled this review: this movie was\nspectacularly, hauntingly, painfully, stunningly beautiful.<br><br>Most will probably not find this review helpful. But I'm fine with\nthat. Find a couple hours that you can give this movie your attention,\nand sit down and immerse yourself. I found it 100% worth it.\n"},
{"review": "\nThe kidnapping, incarceration and rape of children is incredibly\ndifficult to represent authentically on screen. 'Michael' shows how\ndamning the effect can be when genre demands are prioritized over\nauthentic portrayals. The first half of Room offers up a subtly\nplausible account of how a young woman copes with appeasing her captor\nin order to avert his gaze from her son. The performances of Brie\nLarson and an outstanding Jacob Tremblay are crucial here. Jack craves\naffection but also explores revolt, and the parent-child bond is\nutterly convincing. Sean Bridgers as the captor Old Nick takes a\nbanality of evil approach: this could be your cousin, your neighbour,\nyour boss. When Jack escapes and Old Nick makes the decision to abandon\nhim in the street, the way he throws the boy down completely conveys\nthe psychopathic nature of the man. The second half of the film, about\nMa's difficulty in re-adjusting to society, works less well. Her father\nis wheeled in then wheeled off in order to make a point about the\ndifficulty of accepting his grandchild. The A-list casting here did not\nhelp - a more anonymous face in this role would have given it more of\nan everyday dark fear appeal. The ending is low-key, but is in its own\nsmall way triumphant, a full stop placed right where it was needed.\nThese two characters will go on. They will heal. Thoughtful, mature\nfilm-making that stays with you after the curtain closes.\n"},
{"review": "\nWhat a touching movie. I had to force myself to watch it, as the\nthought of going through a story about a mother and her son trapped\ninside a small room for years was too claustrophobic and had too little\nroom (no pun intended) for excitement. But I am glad I watched it. It's\na gripping movie. The story of a girl who gets kidnapped and locked in\na 10 sqm2 room for 7 years. She gets pregnant and has a son who\nbelieves their \"room\" is the only real thing in the world. When he\nturns five, she finally tries to explain to him the reality of their\nlives, and together, they need to find a way to escape. I am not sure\nwhether this movie was anywhere the Oscar nominations or not, but\neither it is a movie that I hope people will watch. It deserves it. Way\nbetter than 90% of the flicks you have out there.\n"},
{"review": "\nIt's not everyday a movie can keep you glued to the screen as such.\nThis was a disturbing yet mesmerizing, sorrowful yet breezy, strange\nyet an innocent tale of a Ma' and Jack that makes you go through a\nwhole expedition of emotions, all in a \"garden shed\". The voice over of\nthe young boy's thoughts narrated his purity more than his infantile. I\nmight even call it Director Lenny Abrahamson best treasure so far. The\ncasting was impeccable and their performances spoke mountains. My only\nconcern with the movie is that Brie Larson was cited as the lead actor\nwhile it was quite eminent of Jacob Tremblay being the lead, hands\ndown. This story testifies how strong hope can be and and how\nunforgiving hopelessness is. It portrays a mere glimpse of the horrors\nthousands held captive go through as we speak, just like Jack and his\nMa'. It was truly a pleasure watching, keep up the good work.\n"},
{"review": "\nI watched this film not expecting to like it. I am drawn to a different\ntype of film. To say that I was blown away by this film is an\nunderstatement. This film is almost indescribable it's so good. This is\nthe kind of film we get when everyone involved is at the top of their\ngame. You can't just credit director Lenny Abrahamson, or screenwriter\nEmma Donoghue, or stars Brie Larson and Jacob Tremblay, or composer\nStephen Rennicks solely. This was a team effort. Brie Larson gives the\nbets acting performance of this decade as Joy/Ma, a mother lost at sea,\nmetaphorically speaking. Jacob Tremblay gives a performance way beyond\nhis years. The Academy made a serious mistake not nominating him for an\naward. Joan Allen, in what little screen time she has, gives one of, if\nnot the most unappreciated performance of the year. Lenny Abrahmson has\nbeen quietly going about his business in Ireland. He certainly shocked\nmost people with this film. His talent is undeniable and the Academy\nAward nomination was just the reward he warranted. Emma Donoghue's\nnovel and script are both outstanding, and I believe that The Big Short\nwas lucky to win the Adapted Screenplay award. Stephen Rennicks is a\ncomplete unknown in the world of film composing. I feel this may\nchange. His work on this film is a revelation. The moment in this film\nwhere all the people named above are at their best is when Ma runs to\nthe police car in which Jack is waiting. The slow-motion running is\nastounding. The music is extremely moving. Brie Larson and Jacob\nTremblay are as good as they were for the rest of the film. I don't\nknow why I waited so long to see this film. I regret waiting to watch\nit and to anyone out there who wants to see the best film of 2015, or\nthe decade, I urge you to stop reading this and go watch it. You will\nbe better for it.\n"},
{"review": "\nBrie Larson gives an outstanding performance in this tale of a girl\nabducted, abused, impregnated, and what she had to overcome to keep her\nson alive. A young woman is abducted and then forced to live in a shed.\nThe shed is soundproof and locked. Her assailant then gets her pregnant\nand she has the baby. The story begins after the child is now about 5\nyears old. The mother and son live in this one room shed. The kidnapper\nonly shows up when he wants his way with the mother or brings food and\nsupplies. They are given just the bare minimum to survive. When the\nabductor starts to see the child as a possible new direction for the\nabuse, she knows it is time to get the child out before it is too late.\nThe script is well written. I believed every minute of what was going\non and how it played out. I hope not to give too much away, but getting\nout of the \"Room\" is only half the movie. The other half is filled with\ndeep emotional variances that take you across a broad spectrum of\nresponse to the situation. As a final note, a special nod of approval\nfor the lady officer in the movie\u0085very smart!\n"},
{"review": "\noh Ma what was that? Brie Larson and lil Jacob - applauds! don't know\nhow to describe my thoughts and feelings about their acting,it was\nreally touching,Brie is expressing the whole drama, exactly what we\nneed to see,her eyes her face clearly says the past and condition of\npresent. i really couldn't imagine how lil boy would manage to run when\nhe didn't even know about world outside the room and i thought that it\nwould be some kind of unreal and untrue scene, but then it surprised\nme! soundtrack is nice and calm, i also liked decoration of room and\nlifestyle of Jackie and Ma in one Room! To be honest the screenplay\nseems like unreal,7 years in room, childbirth in room,no escape\nbefore,no information about old Nick and there many things we can ask\nquestions about, But! the cast,director and whole crew made it REAL\nLIFE TOUCHING DRAMA! and it was getting real and real time by time. i\nalso thought that life after escaping would make me angry but nah! it\nsurprised me again! the integrate to new world for 7 yrs old boy who\ndidn't know anything about it - and the integrate for Ma to 'old world'\nwas exactly how it supposed to be with few illness and whole stuff!<br><br>So the Movie Was Surely best Drama in this and past Year!\n"},
{"review": "\nThe Room got nominated for lots of awards and there were people\nclaiming that it's the best movie of the year. Moving into the movie\nwith this hype, there is almost no way to not get excited.<br><br>In my opinion the plot is separated into two parts. The first part is\nreally interesting and causes you to think about lots of things, and\nthis results into some more expectations. Pretty much every scene makes\nsense, until the part that Ma rolls Jack into the carpet. And then,\neverything goes the opposite way...<br><br>When Jack goes into the truck, the second part begins. I thought the\nmovie was starting to get really exciting and dramatic, but it never\nhappened. I thought the movie can't be that simple. I even thought Jack\nwas in a dream and everything was just the preview of what will happen.\nBut he wasn't dreaming. The police immediately found out Ma, and the\nrest of the second part is pretty much boring.<br><br>Now, i don't know if i'm unemotional or something, but i didn't get the\ndramatic side of it. I didn't feel what they experienced. The movie is\njust not good enough to tell it. Not to mention, there are lots of\nlogical errors such as them not thinking about breaking the window. I\nknow that there is a psychological part of it, and actually that's the\npoint that i'm talking about, the movie just doesn't tell it well\nenough.<br><br>If Jacob Tremblay wouldn't carry the movie by himself with his\nabsolutely amazing acting, i would definitely give this movie a lower\nrating and say that it doesn't deserve an Oscar nomination. But he made\nthe movie acceptable, even though i still think it's really overrated.<br><br>6/10.\n"},
{"review": "\nIt's a movie that is a overrated just a bit, because it isn't a bad\nmovie, rather it just feels like a partially told story. It just ends\nrandomly somewhere near the beginning of the body. It's very\npretentious of the movie to feel as though it doesn't have to tell a\nstory or tie up any loose ends because it alludes that there's some\ndeep underlining theme going on that it's tracking instead, when in all\nactuality it's relatively mundane. Watching/listening to kids act is\npainful enough let alone making a young kid a lead in a movie. Very\nambitious, yet insane to attempt it. At the end of the day you get your\ntypical kid who can't act attempting to act and sound cute. And would\nyou please cut the kids hair already. It was like watching that chick\nwho comes out of the well in the Ring... spoiler - no wonder why the\ndad wouldn't look at the freaky looking kid. Speaking of which, another\nstory line the show buries. Good news though, they cut the kids hair\nwith about 5 minutes to spare.\n"},
{"review": "\nIn 'Room', there are lots of things we don't see. We don't see how the\nlead character, Joy, is raped by her abductor who keeps her imprisoned\nfor more than five years with her little son Jack. We don't see how she\nis liberated by the police, after she manages to let her son escape. We\ndon't see what happens to her abductor and rapist.<br><br>The director doesn't show all these things, because they distract from\nthe theme of this movie: the way mother and son cope with their\nfreedom. The surprising thing about this film is that this freedom\nturns out to be rather problematic in a lot of ways. Even so much so,\nthat Jack starts to long for the intimacy and the routine of life\ninside the shed he called Room.<br><br>The film shows how life in Room is claustrophobic, but also intimate\nand familiar. There are no unexpected developments in Room, but there\nis a lot of love between mother and son. Once they escape Room,\neverything changes. For Jack, who has never known a world outside Room,\nthis is very threatening. He has to share his mother's attention with\nother people, he has to get used to all sorts of impulses, he has to\nlearn how things like a telephone work.<br><br>In this film, there is only one major dramatic event: Jack's escape and\nthe subsequent liberation of his mother Joy. The rest of the film is\nrather uneventful: at first we see Joy and Jack in their daily routine\nin Room, and afterward we see them cope with all sorts of problems in\nthe house of Joy's parents. Still, the film is almost never boring. The\npsychological developments make up for the lack of real action. And\nalthough there quite some emotional scenes, the director didn't make an\noutright tearjerker.\n"},
{"review": "\nThe first hour of this film is as taut and compelling as any\npsychological thriller, you're really in it with the mother and son and\nrooting for them to get out. The writing, direction, and production\ndesign are top notch.<br><br>Once the mother and soon do escape, the filmmakers don't seem to know\nwhat to do with them, and the quality of everything to do with the\nsecond half is a mediocre-at-best, straight to cable melodrama. That\nquality includes the acting, directing, writing, set design (aside from\nhe subtle \"bars\" in the home set.<br><br>This material seems better suited for a TV drama or serial.<br><br>Granted, the lead performances are spectacular.\n"},
{"review": "\nWhen I first saw that a new trailer for a film called 'Room was\nreleased online, i had a shiver cast through my spine, dreading that it\nwasn't a remake, sequel, or re-release of the 2003 monstrosity that was\n'The Room'. How relieved I was to find out it was actually about a\nmother and sons journey of escaping from the single, enclosed room\nwhere they were held captive in and then watching the 5 year-old 'Jack'\nadapt to the huge world we live in.<br><br>The main structure of the film splits down into 2 parts; When they're\ninside 'Room' and when they've escaped. I completely felt for Brie\nLarsons 'Ma' having to raise a child who's only experiences in life\nhave occurred inside 'Room'. Larsons performance was something that\nadded so much emotional depth to her character as she manages to show\nthe psychological damage 'Old Nick' (her kidnapper) has put her\nthrough. The 9 year old Jacob Tremblay added a believable performance\nfrom such a young actor who at times you really feel sorrow for. <br><br>Then, when the riveting escape sequence is over, the film seems moved\nto its second half; The outside world. For me this felt like a complete\nshift in the films pass and tone, which I believe was a great decision\nas it was almost simulating how our protagonists felt when they were\nwelcomed back into society. However, I really feel that, whilst the\ntrailer didn't take anything away from the film for me, it would of\nbeen better not to of shown the fact that they became free of 'Room' <br><br>Great performances from everyone, an deeply emotional tone, and an\noverall great film to watch.<br><br>One of the best 2015 had to offer.\n"},
{"review": "\nA beautifully told story through the eyes of a brilliant 5 year old.\nSuch innocence beautifully portrayed.<br><br>Great performances, a good film. Nothing more.<br><br>I have a few issues with this film<br><br>1) Would the mother trust her child with a man who was willing to keep\nthem captive for so many years? <br><br>2) How lucky, Old Nick put the rug on the right hand side of the truck,\nmeaning Jack could roll out to the left as practiced.<br><br>3) Why would Old Nick just drop Jack like that?<br><br>4) It took all of 30 mins to locate both the room and Old Nick.<br><br>5) Surely wouldn't Jack &amp; Ma have more psychology damage?\n"},
{"review": "\n'ROOM': Four and a Half Stars (Out of Five)<br><br>The critically acclaimed dramatic thriller flick; directed by Lenny\nAbrahamson and written by Emma Donoghue (based on her 2010 novel, of\nthe same name). The film is about a young mother, being held captive in\na locked single-room, with her 5-year-old son. The boy has never known\nlife, outside of the room; so his mother creates a complete alternate\nreality, inside the room for him. It stars Brie Larson and newcomer\nJacob Tremblay, as the kidnapped mother and son. It also costars Sean\nBridgers, Joan Allen and William H. Macy. The film is predicted to be a\nlikely Oscar contender, come awards time, and it's received almost\nunanimously positive reviews, from critics. I liked it.<br><br>Jack (Tremblay) is five-years-old, and he's been locked in a single-\nroom, with his mother Joy (Larson), all of his life. He's never seen\nthe world, outside of the room, and his mother has taught him 'room' is\nall there is. We later learn that Joy was kidnapped when she was 17,\nand her captor impregnated her, with Jack, five-years earlier. As Joy\nbecomes even more desperate, to escape, she finally enlists Jack's\nhelp, in a dangerous plan. <br><br>The film is really dark and depressing, but there's also a slight bit\nof hope (in the darkness). Larson is fantastic in the lead, and\nTremblay is also amazing (especially for an actor so young). The movie\nis very moving, intense and heartbreaking; it's beautifully directed by\nAbrahamson, and brilliantly written by Donoghue. The film is basically\neverything you'd expect from a critical darling 'Oscar hopeful'. It's\npretty hard to watch though, at times, but it's worth it.<br><br>Watch our movie review show 'MOVIE TALK' at:\nhttps://youtu.be/MylbbGyo_MU\n"},
{"review": "\nI do not understand how this would be an Academy Award nominated movie\nfor best picture. This could have been a Lifetime movie of the week. In\nfact, Lifetime did a more interesting version of the story recently.\nThe lead performances are forgettable. At no point in watching these\ncharacters did I feel like I was watching a special performance. The\nmother's performance was muted. There was no emotion in her. I felt the\nlike the son was cookie-cut out of the \"Michelle\" from \"Full House\"\nrole. We are supposed to think to ourselves, \"Oh isn't he cute as a\nbutton,\" \"doesn't he say the funniest things you ever heard\" and \"isn't\nhe so aware of his situation and who he is.\" Suspense never builds. The\nmovie ultimately is long and boring. I cannot recommend this movie to\nanyone.\n"},
{"review": "\nTypically you expect dramatic productions to have some sort of\nresolution, a satisfying denouement or if nothing else at least some\nintriguing moments with characters, dialogue and scenery that capture\nthe imagination.<br><br>Room offers none of that, relying wholly on two main conceits to carry\nthe entire weight of the story. Beyond the first act this film is\ninterminably dull and by the end of it I found myself thinking \"what\nthe f**k was that it\".<br><br>While it avoids being offensively bad, Room is still not an enjoyable\nwatch. Best avoided.\n"},
{"review": "\nI was curious about this film due to many reviews and comments about\nBrie Larson's performance as well as its Oscars nominations. But I was\nvery disappointed. The film left me indifferent. There was no\nconnection to \"Ma\". I expected a genius acting by young actress judging\nby the hype, but it was average... Of course, it is difficult to act if\none did not actually live it through and it is quite understandable.<br><br>The only performance that is worth of nominations, from my point of\nview, is the one of a little boy. So, all in all it is very puzzling\nwhy this film and Brie Larson was even considered for Oscars or any\nother awards..\n"},
{"review": "\nI had never heard about this movie (or the book on which is based)\nuntil I got a call from my cousin inviting me to see it. When I heard\nits name, my first reaction was \"is it a horror movie?\". And she\nexplained that it wasn't and told me briefly the story. I'll try to\ntell as little as I can, because I believe one of the reasons this film\nhad such a huge impact on me was precisely my lack of previous\nknowledge.<br><br>Jack (Jacob Tremblay), a five-year old boy, lives with his mother Joy\n(Brie Larson) in a tiny room in precarious conditions. The boy has very\nlong hair, is still breastfed, and sleeps inside the closet. Soon you\nrealize they are not there by option: Joy was kidnapped 7 years before\nand Jack was born there, inside that room, which he believes to be the\nonly thing that exists in the world. He has absolutely no idea that\nthere is an \"outside\" behind the door.<br><br>I had all the possible emotions while watching Room. I was sad, happy,\nangry, and nervous (almost having a heart attack during an specific\nscene). Even my cousin was on the edge of her seat and she already knew\nwhat was going to happen.<br><br>Everything in this film is great, starting with the cast. Brie Larson\nis so perfect with her portrayal of a young woman who has been through\nsuch a trauma that I strongly believe she has real chances to be\nawarded for this role. Her character is so complex and she's able to\ntransmit to us the sadness due to the situation and the happiness for\nhaving her son with her. And, of course, the boy! Jacob Tremblay is\nperfect and you can't help but feel both sorry and sympathetic towards\nhim. He is so genuinely naïve and oblivious of the bad (and good)\nthings in the world that is impossible not to like him.<br><br>Full review: http://wp.me/p5Rk4c-fB\n"},
{"review": "\nThis is one of those movies that the IMDb rating tricks you into\nbelieving is better than it actually is. The IMDb synopsis also makes\nyou believe that you are being taken on a journey - of the struggles of\nbeing held captive, into the psyche of the captor, of the innocence of\nchildhood, of motherly love that triumphs. You probably imagine some\nsort of \"Life is Beautiful\" unfolding in a room. But NO! Be warned.\nThis movie is about an annoying kid and his annoyed mom stuck in a\nroom. They both manage to escape the room and guess what? They continue\nto be annoying and annoyed. The characters are so completely one\ndimensional, the movie fails to both entertain or be insightful. You\nend up feeling stuck with the characters in this 2 hour long ordeal.\nLike someone dragging a fingernail on a chalkboard. The quickly made TV\ndocumentaries after kidnapped victims are rescued (as in the case of\nElizabeth Smart or Amanda Berry) look like Oscar winning stories in\ncontrast and are actually watchable. This movie is plain painful to\nwatch.\n"},
{"review": "\nLenny Abrahamson directs Emma Donoghue's screenplay and novel\nbrilliantly. An exploration of the senses. After being abducted, raped\nand imprisoned in a small windowless shed, a young woman (Brie Larson)\ngives birth and raises her son, Jack (Jacob Tremblay), in that same\nconfined space. Ma is a dedicated mother, nurturing her son with love\nand warmth with his happiness and safety top priority. After five years\nor telling stories, playing games and singing songs; Jack's Ma begins\nplanning their escape.<br><br>Larson and Tremblay turn in performances that are sentimentally\nelegant. Rounding out the cast: Sean Bridgers, Sandy McMaster, Joan\nAllen, Justin Mader, Matt Gordon and William H. Macy.\n"},
{"review": "\nThe story is really dark, to understand that this girl has been kept\nfor so long and that a child grew up not knowing the outside world,\nreally shows the mental development of humans in captivity and how they\nadapt. The characters are very well portrayed in their behavior. The\nset itself makes it feel as though you are trapped with them, and later\nwhen they return the room looks so small. You try to recall everything\nbut it still sets a strange distortion like you cant believe they lived\nin there. <br><br>But the scene where Jack finally sees the outside and has to escape,\nhad my entire body numb. It gave me the wash of adrenaline like when I\nwas a child and afraid. It absolutely moved me. I held my breath the\nentire scene.\n"},
{"review": "\nI hesitated seeing this film because I feared it would be another one\nof those exploitation films, with scene after scene of threat and pain.\nConsidering a woman and her son have been kept for years in a room in a\nshed by a sociopath, this could have gone down that road, there are\ncertainly elements of this. But this is about survival and hope,\nneither of which comes without agonizing risk. It's also about how\npeople deal with things for which they have no true appreciation. I\nrefer to two characters. The first is the father of the young woman. He\nmust deal with what he sees as the devil's spawn. The second, a\nreporter that begins to malign her because she hasn't done what \"she\"\nsees as heroic. Her interview made me crawl, but I also thought this is\nexactly what we do to people who gain celebrity through pain. There is\na great deal to be learned from this film, but I fear this is an\neternal problem.\n"},
{"review": "\nIn the beginning: I want to say that the film terrific all standards\nfeelings it toward her son felt like it's real, and also Scene to meet\nup with her son in the outside world after they came out of the room\nscene made me cry And also the soundtrack for the movie make you live\nscene like happen to you, not like you're just watching Idea is\nfantastic and you imagine that you discover the world and you have 5\nyears .<br><br>Secondly, evaluate the Actors I see I am a child prodigy Jacob did a\nfantastic role of a child who discovers the world for the first time\nsuperbly like a professional acting for decades. I believe it is\nessential that young children nominated in various movies for their own\nAcademy Award . The magnificent Brie Larson: I see that she played the\nrole of the mother with a wonderful way that a mother who endured years\nof humiliation and insult in order to maintain her son to come timely\nand sacrifice vision for her son that thing make this live , in order\nto get out from this damned room I see that he can not provide the role\nbetter than this way\n"},
{"review": "\nRoom is another film that fell into the graces of the Public and\ncritical, and highly praised , more is another that not liked the\nscript even though interesting, not captivated me , the acting is\nexcellent, Brie Larson this excellent, and the Young Jacob Tremblay is\nexcellent too (he deserved an Oscar nomination in my opinion), the\ndirection is Lenny Abrahamson , and he sends well , the script in my\nopinion is not as complete as a book (more to understand) , the\nsoundtrack I not enjoyed , the picture is good , the film is full of\ngood moments , Room not captivated me , I kinda slow , even with\nexcellent performances , and a good direction , I was disappointed a\nlittle with this film , the more it must be why it is not really my\nkind of movie. Note 6.5\n"},
{"review": "\nROOM much like its title is a perfect self contained story. The acting\nis simply flawless. and the story Chilling. The Kidnap and rape of a 17\nyear old girl held captive for seven years. That isn't the main story.\nIt is but it's the frame work of a a much bigger and better story. Joy\nNewsome was kidnapped seven years ago by a deranged manic called old\nnick. During one of those rapes she became Pregnant. And she gave birth\nto her son Jack. this gives her a reason to go on living. By the time\nJack is five Joy has spun a tale of a universe in Room. There are\ntelevision people magic and Jack doesn't need to want anything. And\nthey Joy plans a dangerous breathtaking escape that frees them. Now the\nreal ordeal begins. coming home. everything has changed. suffering from\nPSTD and Jack isn't too sure of what to make of all of this. but\ntogether they must struggle to find a way out of the darkness and into\nthe light. A stunning film and it hits every rung on the emotional\nladder. And most of the credit must go to Bree Larson. Her acting is\nnothing short of compelling and believing that She really is Joy. A\nfast tight direction. the director kept a tight rein on it and steers\nit to where the story needs to go. this just may be one of the greatest\nfilms Holly wood has done in the last 35 years.\n"},
{"review": "\nIt's hard to know what to write about a movie like \"Room\". On one hand,\nit is certainly one of the must-see movies of 2015, but on the other,\nyou've surely heard the buzz by now, and don't need an IMDb reviewer to\ntell you. Further, it's a movie you ought to know as little about as\npossible before watching.<br><br>I will say that Jacob Tremblay, the actor who played five year old\nJack, deserved an Oscar nod. Being that they are always in such close\nproximity, you can't help but compare the work of Brie Larson with\nTremblay. He should have gotten a nomination at least. I feel that\nthere are many other actresses who could have done what Larson did, but\nnot many more who could have played Jack.\n"},
{"review": "\nWhereas often movies will chronicle the process of being abducted, Room\nimmediately takes us right into the lives of people who are amidst the\nmisery. This is a poignant, harrowing film that offers a detailed\naccount of the human condition. The essentials of human existence -\nlike emotionality - are wholly dissected in this film. Room certainly\nsucceeds in (believably) doing so and thereby avoids falling into a\ndomain of superficiality where other films depicting difficult subject\nmatter have. Seen through the eyes of an innocent child, we are\nreminded of the saying ignorance is bliss.<br><br>Larson was absolutely phenomenal in the lead role, as supported by her\ndeserved Academy Award for Best Actress. She convincingly immersed\nherself into the psyche of a woman with palpable psychological damage\nand did so in such an unpretentious and altruistic manner. The\ntenderness and motherly solicitude she displayed felt extremely genuine\nand almost made you forget it was a film you were experiencing. In what\nwas a profoundly intricate character portrayal, she really delivered on\nthis one.<br><br>This was a film that heavily depended on its acting. There was no\nflashy CGI, no dazzling special effects - just a true-to-life story,\ncredibly depicted. The central performances were superlative and the\nchemistry Larson and Tremblay showed together was remarkable. Both\nincredibly humanistic and exercising a compelling charm that is truly\ntouching and hard to not feel for as you watch them evolve. The acute\ndialogue, the breathtaking cinematography, the excellent supporting\nactors, the moving score - all executed to perfection. A spectacularly\ncrafted, must-see film.\n"},
{"review": "\nRoom is a stellar movie with a very well developed plot and a talented\ncast. It is extremely original, as we follow a kidnapped woman hiding\nthe truth from her son by convincing him that the shed they are trapped\nin is the whole world. We see the movie from young Jack's perspective,\nwhich I think was the right choice, he made the tone more light hearted\nand heartwarming, taking away from the reality of their situation in a\nway that feels peaceful, albeit somewhat surreal, as we experience a\nvery unique view on the world. I did think we could have seen more of\nJoy's father, who is portrayed terrifically by William H. Macy, for\nonly three scenes, they clearly had a complicated relationship and I\nleft wanting to find out more, it is probably established fully in the\nbook. The performances are outstanding, Brie Larson is entirely\nengrossed in her character in a way that would be frightening for most\nactors, but she did it without half measures, and the chemistry between\nher and Jacob Tremblay is absolutely brilliant, it is very tough love,\nwhich makes it real. Heartwarming, thrilling and dramatic, Room will\nleave you experiencing many different emotions, and you will be happy\nthat it did, I would recommend it to anyone looking for a good drama. <br><br>A loving mother convinces her son that the room they are trapped in is\nthe whole world, until he is old enough to help her plan an escape. <br><br>Best Performance: Brie Larson\n"},
{"review": "\nDriven mostly by the initially intriguing concept, this film surprised\nme by resolving this around this mid-point of the film. Not having read\nthe book or really heard anything specific about the film, it did catch\nme off guard in a small way, since I had come into the film with the\nspecifics of the situation in mind. The first half of the film does\nmake it more than this though, because I was drawn into a relationship\nwhich was emotionally raw and compelling. The film uses the limits of\nthe room really well, focusing on the mother/son relationship and\nmaking us care about it while also being horrified by the specifics.<br><br>The second half of the film manages to maintain that engagement, while\nflipping the characters in such a way that made the drama work in a\nmuch different way, and cast a different light on the first half of the\nfilm. It is tough in terms of subject matter, but at the same time it\nis easy to watch because of how well the film draws you into caring\nabout the lead two characters. A big part of this is how well both\nLarson and Tremblay delivery; they are organic and natural\nperformances, and are supported equally well by the likes of Allen and\nMacey. The writing and the performances make it, and in the end the\nfilm is a lot of heart and works as a result of this.\n"},
{"review": "\nFilms are at their best when they uncover a profound truth of humanity.\nLast year, Inside Out demonstrated this with the role of sadness as an\nemotion in the human psyche. The Martian is about the role of human\nresourcefulness in surviving hostile conditions when others have lost\nhope. And here is Room, an absolutely wonderful film about a mother's\nlove for her child and shielding them from the true horror even when in\nthe most awful of predicaments.<br><br>It has to be said from the outset that it is not just a Fritzl film. It\nis not simply an exploitation film though that this clearly there in\nthe background. That is not to say that the first half of the film is\neasy to watch. However, we are shielded from the worst of it much like\nhow Jack is by his mother. For Ma, Room is a living hell but for Jack,\n\"Room\" is his whole world that goes in \"every direction, all the way to\nthe end\".<br><br>As the trailer shows, the entire running time is not dedicated to the\nconfines of the room but how the two- particularly Jack- cope in the\nreal world. We see this strange new place often directly through the\neyes of the young child and being able to hear his internal monologue\nwas just so cute yet incredibly emotional.<br><br>The direction from Lenny Abrahamson is simply outstanding and the two\ncentral performances from Larson and Tremblay were perfect. As\ndisturbing as it is at times, what a life-affirming film Room is.\n"},
{"review": "\nYes I know. It's late. I finally had the opportunity to get this movie\nout of my way, after hearing good reviews online &amp; friends. <br><br>Then the movie started, the whole while, it was very compelling for me\nto fast forward and see what happens. It was slow, slow &amp; slow. But the\nfeeling you get after watching this was really relaxing. And someone\nyou started to form one way or a different connection with the\ncharacters played. <br><br>Love how the movie POV was from the kid only. Brilliant details and\noverall bit drop of suspense. <br><br>I felt, there could have been more to the movie. But I guess that's all\nyou could fit in. <br><br>All in all, good one.\n"},
{"review": "\nI don't know how much I can even tell you about \"Room\". It is one of\nthe most intense movies that I've ever seen. Brie Larson and Jacob\nTremblay put on two of the most harrowing performances. She definitely\ndeserved her Oscar win. This story of a mother and her son confined to\na small space is not like many movies that I've seen before. Surprises\npop up at every step. All that I can say is that I hope to see both\nLarson and Tremblay in more movies, and I hope that Lenny Abrahamson\nturns out more movies like this one. Very good movie.<br><br>\"I'll see you all this comin' fall in the big rock candy mountain.\" -\nHarry McClintock\n"},
{"review": "\nThere are certain movies which leave you spellbound. Movies that make\nyou ponder upon the reality of life. Room falls into that category.<br><br>Frankly, I didn't hear of the movie till it was nominated for the\nOscars. I saw it after that and \"Wow\" was the word that I said. <br><br>So Room is the story of Joy, a girl who was kidnapped at the age of 17\nby a guy whom we just know as \"Old Nick\". During captivity she gets\npregnant and has a baby boy named Jack. So Joy has created this fairy\ntale world for Jack in the room they stay in and anything outside to\nthe room is just Outer space. So when Jack is 5, Joy thinks \"Enough is\nEnough\" and she needs to get out. How she plans to get out, forms the\npre-interval part of the movie and how Jack and Joy survive once they\nare released forms the latter half. <br><br>Bree Larson as Joy has given the performance that would literally give\nyou goosebumps. Her anguish, he jealousy, the disregard for the outside\nworld, each and every emotion is portrayed so brilliantly by Bree that\nyou eventually fall in love with her and empathize with her. <br><br>Jacob Tremblay as Jack is sheer perfection. Playing such a character at\nthis age is really tough and Jacob has just played it brilliantly. I\ncan not think of anyone else who would have played this character to\nthat perfection. <br><br>The story, the direction,cinematography everything is top-notch. Room,\nmakes you think, it makes you cry, it squishes your gut and you feel\neach and every emotion that Bree and Jack experience in the room. With\nlimited background score, Room relies on silence. It's a must watch for\nevery movie goer. I literally took a walk of 2kms after I saw the movie\nto just imbibe everything that I saw. Sheer Brilliance.\n"},
{"review": "\nA mother, Joy (played by Brie Larson), and her five-year old son, Jack\n(Jacob Tremblay), are held captive in a one-room shed. She was abducted\nby a stranger, Nick, and has been there for seven years. Jack was born\nthere and the room is his entire world. Then one day they escape and\nget to live normal lives. For Jack, the world he now is confronted by\nis a very foreign place.<br><br>A wonderful movie: highly original and incredibly emotional. Just the\ninitial plot - a mother and her son imprisoned for several years and\nhow they escape - was original enough but then we have the\npsychological and emotional implications of returning to society (or,\nin Jack's case, joining society for the first time), and this takes the\nplot to another plane. <br><br>Jack being confronted by and adapting to his new world is wonderfully\nand very sensitively told. His mother having to deal with all her\ndoubts regarding Jack adapting, and any residual guilt she feels from\ntheir time in captivity, is a great, and quite natural, story line too.<br><br>Great, emotional ending that perfectly ties up the movie.<br><br>Brie Larson got a Best Actress Oscar for her performance and deserved\nit. Jacob Tremblay, 8/9 years old at the time, is fantastic as Jack,\nshowing acting skills well beyond his age. Solid performances from a\nsupporting cast that includes Joan Allen and William H Macy.<br><br>My favourite movie of 2015.\n"},
{"review": "\nWhen i started watching this film, for the first ten minutes i was not\nsure whether i can watch this film because of so many obvious things\nlike the level of cruelty and where this film might lead towards but as\nthis film entered into its fifteenth minute it gripped my brain\ncompletely and i understood what Brie and Jacob are doing here is not a\nperformance but it's simply magic. They both have captured maximum\nspace of the screen and they both have captured heart of millions. The\ndirectional eye is simply breath taking and the script - so simple yet\nvery powerful. A well deserved Oscar to Brie Larson. <br><br>I believe cinema like this makes this stage very important and\nappreciable. As a movie maker i must say this film is a milestone in\ncinematic achievements of all kind and i can simply congratulate each\nand everyone who were part of the cast &amp; crew of the team and those who\nhave already watched it. <br><br>For those who are planning to watch it - watch it now because its a\nperfect ten pointer for the genre of Drama.\n"},
{"review": "\n'Room\" takes you to a different world which is so innocently brought\nout by the child \"Jack\" who started thinking that everything out of the\nRoom is out of space and not real.The movie tries to connect with you\nand you always try to find reasons and meanings of lives of both the\ncharacters.For me the best part about the movie was not just when both\nthe characters finally got liberated,but it was how difficult it became\nfor them to connect with the real world after being liberated.The part\nthat drove me to write this review was the fact that the mother tried\nto commit suicide.And that really moved me and made me think.The movie\nreally does connect to you and even after movie gets over,it remains\nwith you.\n"},
{"review": "\nActually it's hard to rate this one as in most areas it is beyond\nexcellent but to be really critical you could pick holes in the plot.\nIn the end I've compromised at 9/10. I must admit I tried to avoid this\nmovie as I knew it would be a difficult watch, but ended up seeing it\nas someone else's choice on pay to view TV; I may have lost some of the\nimpact of \"being there\" that I would have got from the big screen. By\nnow thousands have reviewed the wonderful casting of and acting by the\ntwo leads and I concur completely. By five minutes in or less it's\nimpossible to imagine the roles being played by anyone else. And child\nactor Jacob Tremblay is just astonishing as Jack, who was born in\ncaptivity so knows nothing but the claustrophobic world of \"room\". This\nreally matters in the later stages when he has to cope with the wider\nworld and we are truly drawn into his struggle to adapt and understand.\nAs I always do, I have checked out one or two \"hated it\" reviews here\nand worry about some of those critics' ability to empathise, almost to\na psychopathic degree. To me, Joy's behaviour is 100% convincing. After\nso long in captivity and with her child to protect you would absolutely\nexpect her to have constructed a strategy for survival above all else,\neven if that means taking a submissive role with her captor. It's not\nlike it's just her own life that's on the line if she fights back and\nfails.\n"},
{"review": "\nI have seen some great dramas and this one rates good on my scale. I\nimagine the book is much better than the film because the story picks\nup in this one at the end of 7 years of being stuck living in one room.\nWhile references are made in slight bits about how the ordeal for Ma\nand Jack started, there is very little done to explain how this could\nhave happened for so long. Granted, that is not important to the\ndramatic part of this film, but it does make the film a leap that might\nexplain why -Old Nick when he does lose Jack just takes off. I really\nthought he might do something more desperate like go back and harm Ma\nbefore the police free her from the room. <br><br>When I looked at this, the hook is the relationship between Ma and her\nson Jack. Brie Larson as Ma &amp; Jacob Tremblay (Jack) are outstanding in\ntheir roles. Their relationship is key to this drama working. Ma's\nentire world is being kidnapped when she was 17, raped by old Nick\n(Sean Bridgers), having a son and then wrapping her entire life on\nbringing up her son in one room with Old Nick being the jailer and\nprovider for them both. It is an out of whack world which Jack can only\nsee through a skylight for 7 years. <br><br>Ma totally protects Jack from Old Nick like a mother in the wild\nprotects their young. She teaches him to read, and they do get exposure\nto the outside world via a television set. Finally, Ma uses her son to\nfinally escape from the room. Then this film goes into the raw emotions\nand reactions of shock as she and Jack get exposed to the outside\nworld.<br><br>Many times, Jack is narrating the story as it goes along. Jacob\nTremblay's performance is outstanding in all aspects here. Brie Larson\nis very good but it is the child's view which really carries this film\nto make the viewer care. It is the emotion which made me interested in\nthe film. It is not a perfect film, but it does pull the viewer in.\n"},
{"review": "\nI had no idea what this movie was about before I saw it, I just knew\nBrie Larson won an Oscar for it, and there were a lot of raves about\nthis movie so I decided to watch it. <br><br>Since I had no idea what it was about, I was pretty entertained for the\nfirst part of the movie. It had a couple of very intense minutes, but\nthen it got really boring. <br><br>I fell asleep in my couch, and that is saying a lot. I guess I'm not\nthe intended audience. <br><br>Not my kind of movie.<br><br>Also, I think it's more about the kid than the mother.\n"},
{"review": "\nEmma Donoghue adapted her popular novel ROOM for the screen so we are\nassured the concept it contains are the original ones from her story of\na kidnapped young girl sequestered in a shed, birthing a child by her\nabductor, and raising that child to accept his environs as real until\nthe two breakout of the shed and encounter the world.<br><br>Or as the company who created the film states, 'ROOM tells the\nextraordinary story of Jack (Jacob Tremblay), a spirited 5-year-old who\nis looked after by his loving and devoted mother Ma (Brie Larson). Like\nany good mother, Ma dedicates herself to keeping Jack happy and safe,\nnurturing him with warmth and love and doing typical things like\nplaying games and telling stories. Their life, however, is anything but\ntypical-- they are trapped--confined to a 10-by-10-foot space that Ma\nhas euphemistically named Room. Ma has created a whole universe for\nJack within Room, and she will stop at nothing to ensure that, even in\nthis treacherous environment, Jack is able to live a complete and\nfulfilling life. But as Jack's curiosity about their situation grows,\nand Ma's resilience reaches its breaking point, they enact a risky plan\nto escape, ultimately bringing them face-to-face with what may turn out\nto be the scariest thing yet: the real world.<br><br>The star of the film is Jacob Tremblay. Brie Larson does a credible\nturn as Ma and the 'outsiders' \u0096 Ma's parents Joan Allen, William H.\nMacy and her kidnapper Sean Bridges \u0096 carry their weight. The film is\nunnecessarily long and that need for editing diminishes the\nextraordinary impact of Jack as he discovers the real world. If young\nCanadian actor Jacob Tremblay secures the right agent he could become a\nvery important actor in the future. The story concept is excellent and\ncarries many messages to which we should all pay heed.\n"},
{"review": "\nAn unsuspecting 5 year old boy narrates his life as he transitions from\nthe \"room\" in which he grew up to the real world. In all of his\nchildlike curiosities and passions, he manages to bring joy to his\nmother, Joy. And he keeps her alive with his immeasurable, child-like,\nSampson-esque, hopeful strength. At least three times he manages to\nsave his mothers life. All because of the pure, unrefined love that\ncomes of child- bearing and childhood dependence. <br><br>Jack, the protagonist, is my hero. If I could love others the way he\nloves his mother, I would be a man befitting the greatest rewards in\nheaven.\n"},
{"review": "\nThis movie makes me feel bad and I want to kill old nick in real life.\nVery nice story, the kid is so special in acting. He might won the best\nactor in Oscar instead of Leonardo di carpio. Brie Larson is\nspectacular, never thought she is real good. I only have questions, why\ngrandpa cannot look or stare in the eye of jack? its because he can't\naccept that he have a grandchild or he is the father of jack? i just\nconfuse.<br><br>This movie is great one of a kind. Kudos for the writer and the\ndirector you bring different food on the table. This movie would be a\ngame changer in drama category.\n"},
{"review": "\nTo start up, I honestly haven't seen such a good movie as this one for\na longer time. It is so emotional and heartbreaking watching those two,\nfirstly in Room, then in the real world as well. I found interesting\nrealizing the oscillations in getting used to the whole massive change\nbetween a grownup and a child. Freedom is relative, this movie proves\nit. So is space and boundaries. If you don't know what's on the other\nside of the wall and don't even know the other side even exists, you\nfeel safe. You don't doubt your freedom at all. Jack felt like\neverything is happening with a reason, just the way it should be. His\nimagination made him believe that. It was also quite interesting\nwatching how Jack's thoughts broadened up as time was passing by. I was\nsurprised how well he adapted to new surroundings, unlike his poor\nmother. She was questioning herself a lot, every single day, got really\noverwhelmed and I saw her crash coming a few times throughout the\nmovie. It's impossible not to feel sorry for her considering how strong\nand resilient she stayed.\n"},
{"review": "\nWith all the real life stories about women who have been abducted and\nkept prisoner in basement Ariel Castro etc why did they need to make a\nfictional movie about this topic? The true stories are more compelling.\nIt's a depressing story that is slightly relieved when they are\nrescued.<br><br>Brie Larson is competent at acting scared and sad but her performance\nis limited to these emotions. It was not an Oscar worthy performance,\nwhy she won over some better actresses is one of the mistakes of last\nyear's Oscars. The little boy Jacob Tremblay is alright but there isn't\nthat much that he can do.<br><br>After the voyeur in us is satisfied by watching these horrible\nsituations it's just a rather depressing movie.\n"},
{"review": "\nI respect this movie but... \"Phoenix\" was a date movie compared to\nthis.<br><br>Awesome acting, effective, grim.<br><br>I complained to my wife on our way out of the theater and she said:\n\"Oh, the book was darker.\" You've been warned!<br><br>Don't go to a theater near a cliff as you may feel like jumping off.<br><br>I realize neither cinema nor any art form should be all sunshine and\nflowers; I just want to put a warning label on this one.<br><br>The cast was great. The production design and cinematography were very\neffective.<br><br>If you want to scare your daughter out of ever talking to a stranger,\ntake her to this movie.<br><br>Ironically, she might go hide in the basement and refuse to come out.\n"},
{"review": "\nAll I can say about this film is it is brilliant.<br><br>I had never heard of this film or Brie Larson and Jacob Tremblay before\nI got my hands on a screener for this just before Christmas and to be\nhonest wasn't expecting much at all.. But God was I blown away by this\nfilm. <br><br>Larson got the Oscar for best actress but Tremblay should have at least\ngot a nomination for best supporting actor, as together they made the\nperfect pair on screen. Without his performance she would have never\nhave won.. <br><br>When you watch this make sure you have plenty of tissues handy, no\nmatter how hard you think you are, you will need them!! This is the 1st\nfilm I have cried in as much since the Champ when I was about 10!\n"},
{"review": "\nI have never seen such an emotional film with so much sense, feeling\nand so on. I would recommend it for all the people who just want to\nwatch an extremely good drama. The kid's acting is amazing with that\nage. He is acting like a real actor: he cries, he laughs, he feels, he\ncan feel everything and maybe this makes this movie so amazing. The\nfirst hour is really exciting as well and the other part of the film is\njust simply beautiful. Everything is happening in the good direction\nand they needed to be happy after they escaped but it is much more\ndifficult because they have to start the life from the beginning.\nEspecially the Jack has to be known with everything in this real world.\nHe has to know people, pets, plants, seas..\n"},
{"review": "\nI'm just gonna jump straight to it - be ready with tissues, and keep in\nmind that similar events like this actually takes place out in the\nworld. WE need to remember how lucky we are\u0085 just think of that the\nnext time you're complaining about what ever you're complaining about\n(same goes for me, I need to stop complaining about the weather\nsituation..). This is not based on a true story thankfully. It's\nheartbreaking but so good. And the Cast is one of the best I've seen in\na while. Brie and Jacob are just amazing, two really great actors, who\nwere meant for this film. Also kind of glad that they didn't focus on\nshowing us all these horrible experiences the mom (brie) has to go\nthrough, I mean you know that they're happening, but what we get to see\nis this strong mom fighting for her and her sons life and It's more\nfrom Jacobs point of view which makes it more pleasant to watch. If\nthat makes sense\u0085 I can't elevate this film, cast and crew enough. JUST\nGO watch it already! Words to help describe this film: isolation,\nescape, heartbreaking, breathtaking, lego, family.<br><br>I absolutely loved it, a lot because of Brie and Jacob (and who am I\nkidding- also the compelling story of course)<br><br>I give it 10 out of 10\n"},
{"review": "\nA woman and her child are locked in a room. The child is a boy, though\nhis distracting long hair and feminine features suggest otherwise, and\nthe room is his entire world. Room depicts his perspective as his world\nchanges. Although the movie works on an emotional level without feeling\ntoo manipulative, I disliked the scenario and was bothered by the\nquestions it raised. How believable is the main characters' captivity,\nthe extent of their trauma, and their attempts to escape it? I have my\ndoubts, but I think the audience is supposed to be too in awe of their\nmaternal bond to care. I, however, wanted a little more intelligence\nfrom the tantrum-prone duo. The mother is saved by a five-year-old with\na facile understanding of his environment. Ignorance is bliss, I\nsuppose, but let's not pretend it's lovely or enlightening. One could\nargue the mother protects her son's purity, but even this seems a\nmatter of luck given her limited control over the situation. I guess I\ncan't abandon my intellect to appreciate a child's innocence,\nespecially when it could have been more effectively preserved by a\nlittle adult cleverness.<br><br>Rating based on five factors, each worth up to two points: Sound: 1.5;\nActing/Characterization: 2; Script: 1; Visuals: 1; Concept: 0.5<br><br>Total: 6\n"},
{"review": "\nThoroughly engrossing, beautifully scripted and exquisitely acted, this\nmovie delivers on every level. Why on earth the young actor, Jacob\nTremblay wasn't at least nominated for the Oscar is a mystery. He is\nspell-binding and completely believable in this role. And the whole\nmovie pretty much centres on him. Brie Larson is perfect as Ma, and the\nsmall support cast are spot on. <br><br>This is not an action packed movie, and it was clearly shot on a\nshoestring. Not a whole lot happens, but it is perfectly paced. If you\nhave patience, you will be rewarded with a beautiful love story and a\nstunning character study. Well worth it.\n"},
{"review": "\nThe crime of kidnapping and extended captivity is well known through\nmedia exposure that sensationalises the psychological horrors of\nconfinement in claustrophobic spaces. The dependency of some victims on\nan abusive captor or prison is just one of the many strange twists\nfound in captivity stories. But this one is different because it is\nnarrated through the eyes of five- year old Jack who was born in a\nfortified shed with only a small overhead skylight visually connected\nto what is outside his world called Room. His mother was abducted at\nseventeen and has been a captive for seven years, raising Jack as best\nshe can in a co-dependent relationship that shines beautifully in their\nsmall prison. When tormentor Nick loses his job she knows he will not\nkeep them alive, and that's when the slow-paced narrative opens\npredictably towards a fast world full of frighteningly wonderful sights\nand sounds and feelings expressed through the naivety of a newborn\nfive-year old.<br><br>This film would not work without the emotionally intelligent acting of\nJacob Tremblay as Jack. Being almost ten and convincingly presenting as\nhalf his age is nothing short of remarkable. He describes his new world\nthrough wide eyes and lyrical words that capture the exploding space\ninto which he is thrust, and he alone holds this film together. As Ma,\nBrie Larson's acting fixates on maternal dynamics at the cost of a\nconvincing portrayal of captivity trauma. The scene where Jack and Ma\nre-visit Room after Nick is caught has all the nonchalance of strolling\nthrough a museum, as the story winds down from the highs of a taut\npsychological thriller to a modest melodrama. It is after all a film\nthat strives for insight, not entertainment, while remaining true to\nthe book upon which it is based. It does this thoughtfully in the first\nhalf, but slowly loses focus as it drifts aimlessly towards the end.\n"}
]