[
{"review": "\nI am so unbelievably unhappy with this movie! The writer of the script\nhas completely dissed the original most exciting plot from the books to\nsome stupid ridiculous mainstream apocalyptic story.<br><br>None of this happens in the book. None of it makes sense. It's called\n\"The Scorch Trials\" as in trials from wickd. Not some stupid escape\nadventure! I was so excited for this movie and I'm going to be honest,\nI left the cinema fuming with anger. If you're going to create a movie\nbased on a book, actually go by the book plot. Don't make you're own\nand expect everyone to be happy with it. I'm sure the writer of the\nmovies just ticked off an entire fandom.\n"},{"review": "\nIt is as if the concern of the producers and story writers were so\nfocused on the movie's DBOX worthiness that they forgot to include the\nstory line.<br><br>I went to this movie with two friends that have not read the books, as\nI have. Both walked out of the movie confused...\"Where did the virus\ncome from?\" was the first question that they asked. <br><br>The beginning of the movie should have included the reason why\nW.I.C.K.E.D. created the Maze, explained what the Flare is, and\nintroduced both groups of Maze runners. Instead, the audience is lost\nin visual effects without knowing why the action is happening. To add\ninsult to injury, the writers turn the virus infected people into\ninhuman, biologically altered zombies. The immune are now a commodity\nfor a short term fix to the virus problem. So much has been lost by\nthese adaptations that the result is a vague and confusing zombie\nflick. I almost walked out.<br><br>This was a wonderful book that should have been an incredible movie.\n"},{"review": "\n***this review may contain spoilers*** It is undeniable that this movie\nhas its fair share of thrills, stunning CGI scenes and unique yet\nrealistically gory zombies.<br><br>However, there is nothing more to that. It jumps from scene to scene\nwithout enough plot to give the audience a sufficient sense of\nappreciation as to why the characters are doing what they do. I could\nhardly believe it when the movie ended, 2 hours wasted on what could\nhave been time playing \"left 4 dead 2\" and still leaving me with the\nsame feeling - the 'that was thrilling but a complete waste of time'\nfeeling. <br><br>I'm going to keep this a short and simple, almost lazy review. Because\nthat is exactly how I feel about this movie.\n"},{"review": "\nA film with little substance or meaning. Zero plot, zero character\ndevelopment and zero fulfillment after watching. Cardboard actors, poor\nplot line (wasteland zombie survival by inexperienced 'teens' with luck\non their side). I simply cannot understand why Hollywood can continue\nto churn out such condescending and boring films like this which cost a\nfortune to make (wow - must be good if cost $100million!). I can only\nthink that Hollywood marketing overrules common sense of young adults\nwhom Hollywood execs think are easy to hoodwink to pay and watch tripe\nlike this. It's up to you, but if you go and watch this and waste your\nmoney watching the same, then don't blame me for not warning you. Total\ngarbage and about 2 out of 10 from a film lover with 35 years viewing\nexperience.\n"},{"review": "\nThis so called sequel to the Maze Runner is completely a waste of time\nfor anyone who is expecting any similarities to the original Maze\nRunner. It is full of nonsensical fighting, clueless people, zero plot,\na shame to actually be associated with \"The Maze Runner\".<br><br>If possible, take this movie back to the recording studio and delete\neach and every sequence of it and Think and make a sensible adventurous\nmovie. Crappies movie of all times! It's not only misleading from the\nword \"Runner\" but also there is no Maze! Isn't it fantastic? The Scorch\nTrials! What does that even mean and how does the name actually is\nrelevant to this pathetic low standard movie!\n"},{"review": "\nI recommend any and all who have respect for a writers work and/or have\never read the maze runner series, don't watch the second movie. It was\na good movie but it should not have been released under the title\nscorch trials as it had no relevance what's so ever to the second book\nor the trials themselves, which is literally the title. I am very\ndisappointed/Very much irritated. The only resemblance to the book was\nthe character names. This also felt like a very sore excuse for a\nzombie movie instead of having the proper and well thought out story\nline that manipulated the characters like originally intended. Overall,\nI say again the movie would be fine on its own with no relation\nwhatsoever with the series but because it is in fact based off of a\nbook series I am very disappointed to see they threw the whole series\naside and made up their own story. Very disappointed, I cannot say that\nenough times.\n"},{"review": "\nGreetings from Lithuania.<br><br>\"Maze Runner: The Scorch Trials\" (2015) is a bit weaker then it's\npredecessor but still entertaining and enjoyable flick. If you liked\nthe first one (like i though it was highly enjoyable), that doesn't\nmean you will like this as well because plot is totally different in\nthis one (and i read that it is totally different from the book) - it\nis a sequel which expands this universe, and i liked the overall\n\"world\" which is created here, it is a much darker dystopia future then\nlets say \"Divirgent\" series has got. Nevertheless i enjoyed \"The Scorch\nTrials\" for what it is - a very solidly executed entertaining flick\nwhich is best seen with some friends in evening. <br><br>Overall, \"The Scorch Trials\" isn't original by a mile, you can see type\ncast actors from a mile, and if you know their acting backgrounds,\ntheir characters in this movie won't surprise you. This is a well\npaced, executed and crafted intense action / adventure / thriller /\ndystopia future flick.\n"},{"review": "\nThe sequel to the Maze Runner leaves a lot questions unanswered, but it\ndelivers a slightly better film than the first one. Add to that the\nmore characters this film introduces with more gender and race\ndiversity.<br><br>The main pro and con of the sequel are its action and structure of the\nstory. First, there is more action in this film than the first one and\nthat makes the film more entertaining as it keeps the viewers invested\nin it. However, development of story will leave some viewers confused\nand fans unsettle as it feels like it's going from one place to another\nwith few explanations.(Maybe gearing up for the last installment?)<br><br>Overall the M.R: Scorch Trials with its' pros and cons is worth a watch\nfrom fans and non fans alike.\n"},{"review": "\nLets face it. The Maze Runner films are not great. They are good, but\nnot that good. While the film was fun to watch it was full of already\nseen scenes. Not really original. Director did a good job, not that\nbad. Screenplay could have been better. You expect to see some of the\ncool post-apocalyptic cities and landscapes, but you do not get enough\nof that. A lot of cliché moments in the film. Should have been a little\nshorter. Also there are some illogical decision that characters made in\nthe film, cannot really get into it without spoiling something. They\ntried to give it a little twist but it was not that surprising.\nIrritated me a little bit. Acting was good. I actually liked how they\nedited it out, not bad. Cinematography is good. All in all a good, fun\nfilm to watch. Everyone knew it was not going to be a masterpiece.<br><br>Arguably maybe it even deserves 6/10. I was wondering what to give it,\nbut because I like these kind of films it made my decision easier and I\ngave it 7/10.\n"},{"review": "\nWhat was that?! I can't believe that A production can make a D film!\nWhat were they thinking??? This is so bad product and it could have\nbeen a good one. Good cast could not save it. The Maze Runner was good\nfilm. I was hoping that this one would be even better, silly me.\nViolence and apocalyptic scenes aren't enough. Is there anything else\nthere, besides that? This is a mixture of couple of \"hot\" series and is\nobviously made for kids, but can it be enough?! It's a shame if it can!\nSpecial effects, shooting, fighting, zombies, blood, diseases, horror\nworld of tomorrow, of course, saved by teenager, LOL... Where does it\nend? It's getting cheaper and cheaper. What I really don't understand\nis how can big studio make such a rubbish? Do they care for their\nreputation? No? Money is everything? Shame!\n"},{"review": "\nJust minor spoilers here, folks.<br><br>I won't say it's great. But it's not awful either.<br><br>The title says 'Runner'. Of course there are going to be a lot of\nrunnings. What do you expect? Someone out there said running aimlessly.\nPeople chase them. Zombies chase them. Do you think they know where\nexactly in the desert they are running to? I love this one better than\nthe first one. I dunno. The first one was a bit dull. This one is more\nexciting. I guess maybe I love zombies.<br><br>Nothing original. You'll see bits here and there you've seen somewhere\nbefore. But fun, nonetheless.<br><br>Go see it.\n"},{"review": "\nThe first Maze Runner movie I really enjoyed watching and would watch\nagain. This movie did a complete 180 though and just destroyed the\nseries. Instead of taking the good and improving on the first one, this\nmovies is basically just hunger games, trying to get away from the bad\nguys just to get caught type of stuff, and hunger games, these infected\nhuman/zombie like creatures chasing people around. Normally I'd still\ngive a movie a chance but I just couldn't. One main reason is the CGI\nfor this movie, it was just laughable. CGI was used for all of the\ninfected characters chasing the main group around and it just looked\nlike CG from movies and video games from 5 years ago, just terrible.\nThey go so far from the book plot line it's ridiculous too. If you want\nto see it wait until it comes out to online rental or redbox or video\nstore. It's not worth paying to see in theaters. Also warning to adults\ntaking kids, this movie is closer to an R rating than a PG-13, it's a\nreally far stretch that they made it only PG-13.\n"},{"review": "\nI have read the book, and i saw forward to se the movie. But after 10\nminuts i was terrified. Whats next, whats next to ruin? The movie uses\nsome of the book materias, but it all comes out wrong. Please, don't\nuse the title of the book for the next movie, its so wrong. Sorry for\nthe spelling, not from UK or US, but my messege, it this; If you have\nread the book, don't look at this movie, it so wrong, so wrong. The\ndirector have made a completely athoer movie. I have read the book, so\ni compare the movie all the time, thats why my grade i so low. If you\nnot have rad the book, the are so many questions and facts that just\ngoes by.\n"},{"review": "\nThis movie was completely not in line with my expectations. I haven't\nread the books so my expectation was based on the first movie. The\nmovie started quite OK but very fast the story went in a completely\nopposite way from what I was expecting and become another walking\nzombie movie like I have seen so many others. Where the first movie was\nbuild around an original concept this movie is what I would call a\ncheap copy of existing zombie movies. I found it a waste of time and\ncaught me thinking \"what kind of b*llsh*t am I watching\". I checked the\nspoiler flag because what I wrote about the zombies tells more or less\nthe complete story of this movie. Very disappointing.\n"},{"review": "\nI just wasted 2 hours of my life thinking this film may be better than\nthe first but no, giving every film a chance before judging it but no\nagain, it was a shitshow. <br><br>First of all the plot was absolutely terrible! I read the book and even\nthough the book kind of sucked this was seriously 100 times worse.<br><br>Secondly they didn't explain anything, they must've skipped like 2/3 of\nthe book and just took in the \"cool\" parts because it made no sense at\nall. First they ran off to a desert walking for 20 minutes, secondly\nthey found some zombies, third walked somewhere, found some more\nzombies and oops WICKED hates us. Someone dies and poff the end. <br><br>They introduced about a 100 different unimportant characters and pretty\nmuch killed them ofimmediately. Most of them were flat and were just\nplot devices. No character development at all, seriously they stayed\nthe same throughout the whole film.<br><br>The cinematography part was alright, and the music was great. The\nacting wasn't half bad, sure they convinced me. But don't watch it,\nit's not worth your time.\n"},{"review": "\nThe film it self ties in perfectly with the first movie in the series.\nThe first 45 minutes is action filled with new characters introduced\nand the story line continues.<br><br>After that time frame it quickly turned into another zombie movie. They\ndiscover and outside city with rebels and were forced into drinking\nsomething to basically go on a trip through a party/rave and then the\nstory line completely takes too many turns and it was hard to follow to\nthe point I simply turned it off. I'm not saying don't see this\nmovie... but this one you have to really pay attention too as they\nincorporate a few details that don't make sense but lost me half way\nthrough it. <br><br>Maybe one day i'll give it another shot to watch but for now.. not a\nfan.\n"},{"review": "\nThere couldn't possibly be a spoiler here because you already know\nthere's another movie coming, and you can figure this one out after\nabout 90 seconds. This movie is little more than predictable captures,\nescapes, gunfights and explosions. There isn't a single moment of\nacting that exceeds what you'd expect from a middle school play, and\nthat's the highlight of the movie! You suspend more disbelief here than\nwatching the TV show Scorpion, and all in all, it's totally, 100%,\nforgettable. Whatever the next movie brings, you could have gotten\nthere without this one. I give it 5 stars of shame. Do not waste your\ntime.\n"},{"review": "\nIf you are going to make a movie based on a book... READ THE\nBOOK!!!!!!! It would have been easier and cheaper to make the movie\nbased on the plots and content of the actual book. I would say this was\nmaybe 25% book and 75% completely made up. There was no trial\ninvolvedm7n this movie. All that happened should have been a test from\nwckd not them running from wckd. And a big compound where they are\nkilling immunes? What? I don't even know if they'll be able to make a\nthird movie with the reviews they have on this one and if they do can\nthey fix the mistakes they made in this movie? I am just supper\ndisappointed. I was expecting to see something based off the books I\nhave read but that didn't happen.\n"},{"review": "\nI have no problem with artistic license when it comes to book to film\nadaptations, but the only thing this had in common with the book was\nthe name Thomas. I think this franchise was trying to compete with the\nhobbit on how badly you can offend a fandom by commercializing it. But\nat least the hobbit still followed the same arch, it was just heavily\nnourished.you could still recognized the universe. Scorch trials left\nthe galaxy and traveled over to the resident evil universe after\nstopping by Jurassic park and twister galaxies. I won't be seeing the\nthird as this has nothing to do with the franchise I liked.<br><br>I understand that the scorch trials book is a good read but would not\nhave adapted to a good movie, but to turn a science experiment into\nresident evil ruined the whole point of the books, that the kids\ndepended on one another, And never had a clue what was going on.\n"},{"review": "\nI'll start by saying I liked the first instalment, I wasn't crazy about\nit, but it was watchable enough, possibly a little slow. The follow up\nbeats it in pretty much every area, it's more exciting, more action\npacked, boasts better special effects, and is just somehow much more\nwatchable and enjoyable. It has a darker, more adult feel, there are\nsome particularly well done scenes. I did find the attempts at the\ntouching scenes weren't wonderfully delivered, they felt a bit out of\nplace, clunky and overdone. The film is 78% running around, if you can\ndeal with that I think you'll enjoy it.<br><br>Way better then the first, 7/10\n"},{"review": "\nIf I gave a summary of the book, I still wouldn't have to label this as\nhaving spoilers.<br><br>Even if you haven't read the books, how could someone possibly enjoy\nthis garbage? How is this a 'Trial' at all? This is a boring and\nhorribly predictable escape film. Also. the Cranks weren't zombie-like\nfor the most part. In fact, they were buy and large still sentient\npeople that lived in somewhat civilized communities, depending on the\ndegree of their infection. I'm pretty sure that the only similarity\nbetween the book and the movie is that they used the same names of the\ncharacters. That's about it. <br><br>'Awful' does not do this movie justice, it was repulsive. The only\npositive reviews probably come from some stunt-double or an intern on\nset.\n"},{"review": "\nCrank it Up...Movie ended with an unbelievable climax setting up a\ngrand rescue venture in the Sequel..Movie doesn't bore you at any\npoint..Twists and turns are superbly choreographed and the settings are\nawesome..No complaints about the acting of characters ..Barry Pepper's\naddition adds to a thrilling next venture,,Thomas superb as usual Only\ncharacter we miss from prequel will be of Will poulter .. We sure miss\nhis roughness character,,Therasa has a weak role in this movie but\ncertainly an important entity in the climax and the sequel,,, To sum up\n..Its an 2 hour adrenaline adventure drama with twists and turns ..So\nguys do watch it and climax will give you Goosebumps surely,,, Also\nNever believe a girl ..Watch the movie to understand this line Hahaha\n"},{"review": "\nThis film tells the story of a group of young people in a facility\nwhere they are told that they are safe. However, they find out it is\nnot the case. After they escape from the facility, they struggle for\nsurvival from their captors in a world full of zombies.<br><br>I liked the first \"Maze Runner\" because there is much excitement and\nmystery. In \"Maze Runner The Scorch Trials\", there is excitement but\nlittle mystery. We get to know everything twenty minutes into the film,\nso there is little mystery to engage the viewers. The introduction of\nzombies is a bit strange, and I find myself wishing that this\ninstallment has mazes and contraptions like the first \"Maze Runner\".\nThat being said, the film is still entertaining and exciting, it is\njust not what I expected it to be.\n"},{"review": "\nHad to join just so I could write this review, I liked the first Maze\nrunner, Not read the books, but I liked the concept behind the story.<br><br>when i saw the second installment was out, I got exited about seeing\nit, While the film started OK and I thought we where going to get more,\nquickly realized that it was gonna be a zombie flick, which i enjoy,\nbut no then most of the film is the cast running towards a mountain\nhideaway, with them then running towards a smaller hideaway, where they\nare all ambushed, even though it was nighttime and they where with\nrenegades, The enemy managed to sneak up on them with helicopters and\nlights, i actually left the cinema, it was a complete waste of money\nand time, and whoever made this has just spoiled any sequels. Avoid\nsave your money and watch something decent. companies that produce this\nkind of rubbish, should have to give you your money back, as its fraud.\nno maze. no scorch and no trials, just lots of running about.\n"},{"review": "\nThis is one of the worst movies of 2015, perhaps the entire decade. <br><br>Remember when you were young and went to those cheezy haunted houses\nwith poorly made up zombies and scary Uncle Al, jumping out of the\nshadows. Well, that pretty much describes this movie. <br><br>A real shame too. The first one was unique and kept you on the edge of\nyour seat. This one was just a money grab and a bad one at that.<br><br>The whole time I kept thinking, when is the next made up bozo going to\njump out an try to scare me. Around the last 30 minutes or so, I\nstarted reading FB from my phone. I really don't even know what\nhappened at the end and really don't care.\n"},{"review": "\nYeah, I know, sequels suck. Typically true...but this sequel really\ndoes outperform the first film. <br><br>Mind you, that's pretty easy as it's based on a book series. But\nseriously, how many films do you know that created a great world in the\nfirst film, then truly expanded it in the second? THIS FILM ACTUALLY\nHAS THE ZOMBIES TEASED IN THE END OF THE FIRST FILM. That's right. Most\nof them don't have eyes even. THEY CAN SMELL YOU!<br><br>Within the first half hour we have way more action, zombies, more\npeople, and more deaths. That said...the ending can easily be seen\ncoming, however it was still great.<br><br>WCKD IS GOOD.\n"},{"review": "\nHere's the truth. I'm tired of these dystopian movies-especially the\nteenage dystopian movie. Please, I beg of you, give me something new\nand refreshing. Yes, Hunger Games was a smashing success but even that\nbegan to wane as J Law lost her innocent look and her voice morphed\ninto a raspy ever-present cry of \"Pita!\". It also didn't help that I\nhad already forgotten most of what happened in the first Maze Runner.\nI'm watching Scorch Trials saying: \"Who are these guys again?\" \"Where\nare they?\" \"Who are they running from?\" \"Why is everything in ruins?\"\n\"OK, I no longer care.\" <br><br>It is a feature length film of a bunch of guys and one girl running\nfrom one place to another while performing selfless acts of heroism to\nsave one another without the least bit of believability. The\nprotagonist should be nominated as a saint he cares so much about his\ncomrades. And no, I'm not ridiculing his desire to save his friends, I\ncertainly would too--but this guy took being a savior as a personal\nlife goal. There was no life to insignificant to save.\n"},{"review": "\nAs usual I come here to criticise a movie. I rarely bother to praise -\nit's so much more fun criticising.<br><br>re. my title - I was so glad to see this was rated as low 6's.\nPersonally, I think a '4' is about right.<br><br>So what was this 'film' all about? In fact, it's not so much a film as\na TV series glued together and marketed as a film. The actors are the\nsame second rate people you get in a lot of the \"sci-fi\" TV series...\npeople like Giancarlo Esposito from \"Revolution\".<br><br>The plot was so full of holes and stupid camera tricks it became\nannoying. For example, the group is in a pickup that gets held up at a\nroad block. They all get out and are shot at, so they take cover\nalongside the various vehicles. And then -MAGIC- there are three people\nwith rifles just two feet away from them! Did they beam down from the\nenterprise? I wonder if \"The Walking Dead\" crew were involved in this\nfilm? Some of silly tricks were straight out of TWD - completely\nunbelievable nonsense.<br><br>Enough.\n"},{"review": "\nAfter being pleasantly surprised by the first Maze Runner I couldn't\nhave been more let down. All the elements that made the first movie\nunique and interesting are pretty much gone. Instead we get a zombie-\napocalypse style chase movie that's similar to, well, hundreds of other\nzombie-apocalypse chase movies - such as World War Z, Resident Evil, 28\nWeeks Later, 30 Days of Night, The Colony, etc. etc. There's been so\nmany of these movies that the genre has actually spawned some decent\nparodies (I'm thinking Zombieland) It's sad that they're still selling\nit and it's sad how unoriginal it is considering the first Maze Runner\ngave us a puzzle with novel sci-fi elements and mysterious antagonists.\n"},{"review": "\nFirst movie was interesting but this one is;<br><br>Cliché..!!<br><br>Same apocalyptic disease scenario, same walking dead scenes, classic\naction scenes and all clichés are in this movie. I mean desert scene\nand collapsed bridge what a creative idea..! and \"-no this is wrong\ngirl\" Teresa, \"oh my god no water again cause is desert \", \"is this\nguys are good?\" , \"oh no, they wanna use us for themselves like a life\ninsurance\" There is no creative anything I mean \"broken glass scene\"\ncome on guys. finally Teresa's mother story and helicopters are really\ngood night kiss for all watchers. Total Disappointment.\n"},{"review": "\nIf you have read the book Scorch Trails I BEG YOU, DO NOT WATCH THE\nMOVIE!!!!!! The movie adds new character's and misses out on soooooo\nmany details from the book.<br><br>I read the book and wanted to watch the movie really bad. Well right\naway I was mad I did that. I really was looking forward to the end but\nit was nothing....NOTHING like the book.<br><br>I know that books are more likely to be better than movies and this was\na prime example. Just\u0085awful. Sure throw in some of the one liners and\nquotes from the book but they did not follow the plot of the book.<br><br>But the is how it goes, take someone else's idea like a song or book\nand change it so it's different enough were you won't get in trouble\nand make money off it. Right? BOOOOOOOOOO!!!!\n"},{"review": "\nThis movie is way different that the first movie. The first movie\ncentered around the small world of the maze and this one is the large\nworld of the aftermath. It's a teen movie and keeping that in mind will\nmake it more enjoyable.<br><br>Pros: the movie used the landscape as another character which keeps it\ngrounded into a realism feel. It moves into a completely new direction\nand introduces a new set of \"monsters\" creating a completely new feel\nin the same world. It still kept the original \"run to live\" theme as\nthey traveled on. The characters were solid, no terrible acting or wild\nactions.<br><br>Cons: CGI of \"monsters\" was mediocre at best. Some plot items are put\nin to keep them moving/alive. The final battle feel a little short in\nthe realism/plausible and seemed a bit rushed.<br><br>If you keep in mind my first sentences and still want to watch, its\nworth a rental.\n"},{"review": "\nRatings: 6.5/10 from 76,556 users and the fact, that I quite liked the\nfirst part; The Maze Runner (2014) left me no choice, but to check this\none, as well.<br><br>4 minutes - by the way... DO NOT WATCH THE TRAILER~! (if it's still not\ntoo late), it spoils quite a lot... I have watched it a few months ago,\nand unfortunately I can still remember it... It gives out a great\nportion of the story...<br><br>13 minutes - and you don't know much, just like the characters, you\nconstantly try to figure out, what's going on <br><br>26 minutes - a bit lame, but it keeps you entertained <br><br>44 minutes - I appreciate the post-apocalyptic scenery, it really looks\nnice <br><br>1h 9 minutes - I am not really fond of those kids, but the action is\nquite solid <br><br>1h 23 minutes - the film has got so much potential, I am pleasantly\nsurprised most of the time, yet there is something off about it. Maybe\nthe story is just not really interesting, or maybe it is something\nelse, I don't know<br><br>Decent, nothing more... nothing less.<br><br>tgchan rating: 6 /10\n"},{"review": "\nI am sorry IMDb but this movie part value is more than 6.5 or something\n...<br><br>It's a beginning not a individual part. beautifully done with great\ncreativity ! It's my opinion...<br><br>It is just continues first part and boost up the storyline with strong\nscreenplay.<br><br>I know the business side was not so strong but all over it was a good\nmovie yet....<br><br>We are the fan of THE MAZE RUNNER and we are so happy because we was\nthinking next part will done gracefully or not ?<br><br>But yes it is done by again very hard working and thoughtful.<br><br>Thank you for all maze runner TEAM...\n"},{"review": "\nI don't want to spoil this so I am not going to say what happens. I am\njust going to say that in most movies the first is normally better but\nthis one right here I feel is much more entertaining!!! I love it!! And\ncan not wait until the next one comes out in 2017. I have never read\nthe book and not sure I am going to but all I know is the movies are\ndefinitely worth watching. Great job on the action and the suspense in\nthis one. I love all the actors. Ummm why do I have to make this 10\nlines of text.. That I do not much like.. OK so if you are making me do\nthis what else can I say about this movie without spoiling it? No one\nlikes a spoiler right? So my advise is to just WATCH IT!\n"},{"review": "\nI've come to realize that when watching the movie of a book you have to\nexpect things to change. A movie can not be the exact same as a novel,\nthey must manipulate an entire novel to meet the standards of movie\ntiming and still keep it interesting to the viewer. I believe the cast\nand crew of the maze runner did so effectively and although it may not\nbe a play-by-play of the book it will keep you on the edge of your seat\nwondering what's going to happen next. It will have you hooked and\nwaiting for the last movie of the trilogy (The death cure) which may be\ncoming to theatres in 2017. If you do not feel like waiting all that\ntime and have not read the books yet I'd highly recommend you do so.\n"},{"review": "\nThis movie had great acting and gave a great message of the issue of\ntrust. We cannot trust the police. The police are not our friends.<br><br>This movie is a great reminder that the police are simply an organized\nterrorist organization within America that wants to take away your\nrights and put you in a cell.<br><br>America needs more movies like this to show America how they are slaves\nto the government controlled by corporate interests who just want them\nto bow long enough until computerized replacements can take their\nplace. <br><br>Thanks America.\n"},{"review": "\nDespite what the others say, in my opinion this movie was much more\nbetter than the previous one. I read about unrealistic monsters or\nsomething in compare with the first movie... Well, if you consider the\nmechanic spiders-bees more realistic than what you saw in that movie,\nthen I'll leave you in peace. Yes, the first movie had the tone of\nmystery and adventure but this one gives much more than this...This\nmovie is adventurous, has a fast plot combined with action and rebel.\nThey try to take their faith in their hands by pulling their own\nstrings, they show brotherhood, tight friendship, and they also feel\nbetrayed by those who mostly trust. Another distinct part of the movie\nis that the system may be all powerful but it is not more powerful than\nall of as together... Anyway, thats all, hoping that we can overpass\nthe \"zombies\"- infected and see behind that!\n"},{"review": "\nMaze Runner: The Scorch Trials is directed by Wes Ball and stars Dylan\nO'Brien, Rosa Salazar, Aidan Gillen, Kaya Scodelario and Thomas\nBrodie-Sangster. I loved the first Maze Runner I thought the acting was\nsolid and the dialogue was spot on so I was pumped for this movie and I\nwas not disappointed. Dylan O'Brien in the first movie was good as\nThomas but in this movie he shines in his role. and Brenda the new\ncharacter was awesome. in the end the scorch trials was really\nentertaining, most of the new characters were likable, Dylan O'Brien is\nreally impressive, the cinematography was decent, the movie was\ndefinitely fast-paced and the third act was ground-breaking I cant wait\nfor the death cure.\n"},{"review": "\nThere is a line in the book; \"Rose took my nose, I Suppose.\" This was\nwhat I considered to be one of the best, most terrifying scenes of the\nentire series and it was the essence of the cranks. That they are\npeople, ridden with a disease that doesn't make them groaning moaning\ngeneric zombies but instead it takes away their morality, their\nhumanity, their souls. This was the aspect I found most displeasing\nabout the film. Not that it completely disregarded the entire plot line\nof the novels but rather that they turned it into a crappy generic\nCGI'd zombie movie. I barely made it through the entire thing and if I\nwas Dashner, I would be embarrassed by the mockery they made of my\nreally great story.\n"},{"review": "\nNow, the movie has some flaws, but so does any movie! People in this\nreview section nitpick every single thing possible, but they probably\nrated movies such as SAW or Transformers to ten! Lol<br><br>I really liked the first one with my girlfriend, it was a fun watch. If\nyou don't nitpick mistakes PEOPLE make, then it's all good.<br><br>Can you tell me one movie that doesn't make you say \"no don't go there\"\nor \"don't do it\" and so on?<br><br>Either way, a great watch, quality interior and atmospheric world, i\ncan't wait for the 3rd part.<br><br>p.s people who call it another zombie apocalypse are hilariously\nstupid, zombies were a surprise in the movie, but it was hinted on, on\nthe first movie when bites shown severe aggression as a starting\nsymptom.<br><br>I do recommend watching this movie. My review is nothing but a rant of\nhow i felt about the movie, and i really liked it.<br><br>Have fun.\n"},{"review": "\nI really loved the movie, it was way different from the first and had\ndifferent events that was fun to watch. I loved how they don't really\nreveal everything to spoil the story so quickly, they keep you thinking\ngiving just some answers to who, what, where, and why. It's a movie I\nenjoyed and that's what makes it a perfect 10 for me. Thank you for all\nyour hard work guys. So this movie will remind you of other movies like\nHunger Games, but this gives you its own original story of course. It\nwas definitely a step up from the first movie with its story and\naction. You will get attached to this Asian character and not like this\nother girl character who betrayed them, but that's what's great about\nthis movie it will have you on a roller coaster of feelings toward\ncertain people.\n"},{"review": "\nI encourage you not to be swayed by those reviews that state this has\nruined the maze runner film. It really hasn't trust me ... if you want\naction this film has it, the sheer suspense of this film had me and my\nbrother on the edge of our seat. This films brings so many directions\nfor the 3rd film to go on and i really cant wait till its out already.\nDylan O'Brien's performance in this film is excellent, taking on the\nrole of the leader of the \"pack\" him and his loyal friends go through\nmany problems. The shocking twists to this film are absolutely\nbrilliant and i promise you will shouting \"OMG\" in not just one\noccasion <br><br>Definitely one of the best films of the year, so i couldn't recommend\nit more if i tried to anyone watching it.\n"},{"review": "\nThis movie was perfect in my opinion. I really enjoyed the movie from\nbeginning to the end. The movie had perfect scenes and great character\ndeveloping and emotional ties. It totally had a spin to it and a \"I\ndidn't see that coming moment\". I could not believe Theresa betrayed\neveryone and would have never expected that. The thing I hated about\nthe movie was the cliff hanger, and I now have to make assumptions\nabout how good the next movie is going to be. I am very excited for the\nnext movie. Why can't the third movie come on already? I wish I was\napart of the movie myself because the film was fantastic. I really\nappreciated the zombies as well in the movie that was attacking\neverything they saw insight. Whenever the movie comes out on Netflix I\nwill probably watch it five hundred times in one day.\n"},{"review": "\nFor the most part I enjoyed the movie (never read the books). But the\nextensive use of shaky cam rendered what would have been enjoyable\naction scenes almost unwatchable. I don't know why film makers these\ndays have latched on to this fad. I don't get motion sick. Mostly I\nfind the constant shaking just down right annoying. You get shots of\nground or wall or the back of someone's head, instead of an action\nscene that is comprehensible where the audience can see what is taking\nplace. I realize the intent is to give a sense of realism, but let's\nface it; we don't see the world shake and move like this when we\nourselves run around. I would say somewhere around 75% of the action\nwas done in shaky cam. On top of that, some of the scenes where the\ncharacters are just sitting around chatting is also done in shaky cam.\nNext time, advertise the movie as a found footage movie, so I at least\nknow to avoid it. Wes Bell is going on my list with Paul Greenglass as\ndirectors whose movies to avoid.\n"},{"review": "\nThe best film ever! <br><br>It was so good and the actors were paying their roles perfectly..it's\nnot something you expect and everything is like \"what???\" at lot of\ntimes so it's way more interesting! I like everything about it.It has\nsuspense and good sense of humor,too.<br><br>The film has great effects and some high class action.It was a little\nbit scary in some scenes but i don't think it's something to prevent\nsomeone of seeing it,unless they are younger than 16.. <br><br>I surely recommend \"The Scorch Trials\" as an action and sci-fi movie!\n&lt;3\n"},{"review": "\nI really loved the movie. If guys want to watch a action packed film\nwith a really good plot then you should go for this one. it will keep\nyou engrossed throughout.Everything you need the story like\nsuspense,betrayal,action everything you can get in this movie.Specially\nthe teens will definitely love it. It has a amazing action done by the\ncharacters and nail biting scenes. Enjoyed the movie throughout. Must\nwatch for the people who like action,suspense and mystery. This movie\nlike give you feels and is so much interesting to watch. Please be sure\nto watch this movie. Don't leave it or you gonna miss one heck of a\nmovie for sure.\n"},{"review": "\nGiven that this Film has received so much Criticism and Negative\nreviews, Im here with a slight Different opinion.<br><br>If U enjoy Adventure films, combined with Zombies and action you should\ngive this one a Try. I haven't read the books, so this review is not as\na Book fan, but solely Movie fan. <br><br>I thought the Acting and Storyline was pretty good, I loved Brenda she\nreminded me of young Milla Jovovich character Alice, in Resident Evil!<br><br>There were many special effects, and if you're looking for Zombie\nAdventure film, with action story and little romance, then this is for\nU !<br><br>For a Film, without considering the books I think its OK.<br><br>But solely as an Adventure film I enjoyed it :)\n"},{"review": "\nA large portion of theses reviews are from people angry that the story\nhas changed from the book. This review is for the people who have not\nread the books. Personally I have never read the books and had no issue\nwith the film. Its fast, creepy, gorgeous in some scenes. It was a good\nfilm to put on for something to watch. Granted it gets a bit slow two\nthirds of the way through which is why I ranked it down. I understand\nwhy people are angry and rating it poorly, I mean I was fuming at the\nGolden Compass. So if you've not read the books, its a great film, has\na somewhat intriguing story line and looks great. If you have read the\nbooks, Id probably give it a miss.\n"},{"review": "\nI could sum up this movie pretty easily. You have a bunch of super\npowerful teenagers who are saved from an \"evil\" organization named\nWicked by... Wicked. Which I am not sure if that was supposed to be a\nplot twist or not. This movie quite differently from the last film has\nzombies, which fit the cliché roles of screeching at the camera and\nbeing of no threat whatsoever to anyone let along a group of confused\nun armed kids. Bizarre plot stuff happens for two hours that looks like\na blend of 80's apocalypse movies. <br><br>My honest opinion is that the movie appears almost nothing like the\nfirst one to me, so if you enjoyed the first one you will doubtfully\nenjoy this one. It is over loaded with genre clichés, and over all\nseems not very interesting.\n"},{"review": "\nThe first movie had our attention peaked, even though it was abit on\nthe lame side - men the second movie is a horrid adaption of so many\nother movies like it before - story is slow, boring and all you see is\nthe group change from one compound or industry site to the next......\nso much mix bix and twix..... <br><br>Avoid it, it will be a waste of time...<br><br>And everything is so poorly explained, that you never really get\nexcited about anything - just more and more locations shifts.... always\nsomewhere new to go.... <br><br>I think... and i am being honest here that you will get more out of a\ncold shower than this movie.\n"},{"review": "\nI had not read the books, but fairly enjoyed the first movie. This one\nis ridiculous in that there are three consecutive stories that play out\nexactly the same way.<br><br>They get caught. The people catching them turn out to be the exact\nopposite of what they originally think. They escape. Thomas says \"Go,\ngo, go, go, go!\" Someone gets hurt. Someone else says \"Are you OK?\" He\nfeels guilty. He decides he has to go back to rescue someone.<br><br>This plays out in exactly this order three times.<br><br>One would think not to reuse one of the dumbest things in Jurassic Park\n2. Getting up on your hands and knees, and finally just your feet, on\nbreaking glass is the stupidest thing you can do.\n"},{"review": "\nThis movie was just OK,IMO better then the first but there were many\nparts in this movie that annoyed the hell out of me. Just little things\nthat people in this situation probably wouldn't have done. For instance\nduring the escape from the wicked facility Thomas walks towards the\npeople trying to stop their escape only putting more distance between\nhim and the large door he must exit. I also couldn't stand when the\nBrit kid would ask what's your plan or where are we going to Thomas.\nReally? Your in a place you have never been Or no idea where you are\nand your gonna ask questions like this. The list goes on and on with\nstupid things these actors would do. I understand these are supposed to\nbe teens but kids these days are I hope smarter then this.\n"},{"review": "\nSaw the first movie in the plane, was quite entertained. Saw the second\nmovie in the plane a year later - still entertained.<br><br>This might not sound like a glowing review but there is a need for\nquick, easy entertainment. Maze runner is just that and I don't think\nit tries to be anything more...? The actors are definitely not as\ncharismatic as their Hunger Games buddies but some of the characters\nare strong and the new characters are quite good (the guy playing\nGustavo Fring in Breaking bad is here!)<br><br>Some convoluted subplots you've seen a thousand times before, some more\nzombie like creatures etc. Nothing new but an enjoyable 2 hour\nnonetheless if you are not expecting too much\n"},{"review": "\nThe movie can be summarized in six words: they thought they escaped,\nthey didn't.<br><br>The worst of all is how come IMDb give it a rate of 6+? I'm not sure\nwhich one is worse: a bad movie or a bad rate.<br><br>The story of the movie is so simple, it's very hard to keep sitting on\nthe chair in the first half of the movie. It's basically a challenge to\ndo that on the 2nd half. There's no surprise in the story to anyone has\naverage IQ, everything is so estimate-able.<br><br>The characters are blanks. I mean after the movie is finished, I\nchallenge people to name all the main characters of the movie and see\nhow many can do that.<br><br>The music is not detectable, I mean maybe they played something, didn't\nleave a trail after it's finished.<br><br>And there's not much scene to be memorized. Maybe they borrowed a few\nscene from Mad Max to control budget.\n"},{"review": "\nI gave the movie a 5 out of 10, just because of my love to the original\nbook. I've noticed a lot of reviews talk about how absurd it is, with\nzombies, shooting and all of that stuff. In my opinion, yes it may seem\nquite off-topic when you're watching a movie about teens who are trying\nto find out what is happening with the world. However, all these\nfeatures of the Scorch Trials seemed so natural and well written in the\nbook, and not just like ideas which were there because they couldn't\ncome up with anything else. for some reason this movie is missing at\nleast half of the important details and scenes that occurred in the\nbook, which made it much more interesting and mysterious. They decided\nto go with the \"Let's put in less detail, and more action\" approach,\nwhich clearly didn't work out. I doubt I will be watching the 3rd\nmovie, because all these changes will make the 3rd book and movie\ncompletely two different things.\n"},{"review": "\nThe first Maze runner was better. It had a more stable plot than this\npiece of cinematic garbage. The film is very poorly written, and the\nwhole story is just a bunch of teenagers running around in the desert\nlike headless chooks, trying to escape zombie looking things that have\na name, but the name is that bad I can't remember. On the bright side,\nthere are moments that were entertaining (pretty much any scene with\nthe zombies in them). But that's about where the good stuff ends. The\nacting is so terrible I swear it's rather Dylan Obrien was at gunpoint\nto play this role, or he was just slugging it out to the end of the\nweek for his paycheck. But compared to the rest of the Cast, he is an\nacademy award winner. The supporting cast are just awful, and probably\nwouldn't qualify to act on the Disney channel. <br><br>Overall, The Maze Runner 2 lacks the strength of the first Maze Runners\nPlot, and the acting is so bad I suggest you sit and watch this with a\nvomit bag, because you're gonna need it.\n"},{"review": "\nI have never read any of the books and this is just review from a movie\nviewer. This is a huge let down from the first part. The first part\nsets things up nicely and the second part was all set to fire the\nsparks I hoped and it turned out to be a zombie movie with some nice\nparallel background storyline which is what I thought this movie is\ngoing to be (I am not buying technically its not a Zombie crap). <br><br>This movie has portrayed a scorched earth quite well and should have\ntoned down the zombie part but hey probably thats what the book says\nwhich I don't care and gets 5/10. I wish there would be more to it in\nthe 3rd part than the never ending Resident Evil type movies.\n"},{"review": "\nI was looking forward to this movie, I loved Maze Runner. The whole\nconcept of the first movie was amazing, visually stunning, even if it\nstrayed from the book it was a good movie.<br><br>Then we have the sequel, which really isn't a sequel as far as I can\ntell there is no relationship between it and the first, other than they\nshare some characters.<br><br>This one went off the deep end of awful...<br><br>I wanted to give it one star, but the photography was great, and it\neven had some pretty good actors, and even some good acting, which is\nsurprising considering the horrible plot, script, directing....... It\nis so far from the book it is a crime....... Seriously someone should\ngo to jail over this one......<br><br>Don't blame the actors on this one. This is a prime example of good\nacting that can't save a bad plot, story........<br><br>I would not even buy the DVD from the $1 bin.....\n"},{"review": "\nI was so unbelievably exited to watch scorch trials. I'd read the books\nI'd watched maze runner and quite liked it. I watched scorch trials and\nwas infuriated The film doesn't follow the book at all. It is insulting\nto the author and the carefully thought out story of the book. I really\nhope they realise this. This film isn't the scorch trials it is\ncompletely different. I was so disappointed with this poor excuse of a\nfilm. I really hope the script writer of this realises his/her\nmistakes.<br><br>Thank you for reading my view of this I hope you use this information\nwisely. Remember great power becomes great responsibilities.<br><br>P.s I apologies for my shocking grammar and spelling.<br><br>Thanks\n"},{"review": "\nWhen I first watched The Maze Runner (2014), I thought it was an\nunderground sci-fi thriller like The Cube (1997). Turns out it was a\nnew age alternative blockbuster with teenagers fighting for survival in\na dystopian future regime (like the Hunger Games and the Divergent\nseries). Maze Runner: The Scorch Trials is the second entry of what it\nseems will be another teen dystopian trilogy. The first movie was a\nsci-fi/mystery/thriller combination, while this second one focuses\nmainly on action. I like good action films and this one had a lot of\nthat but like in most cases the original first film and idea are\nbetter. Nevertheless this second entry combines the element of urgency\nwith constant running action scenes and is a nice choice to accompany\nyour pop corn with. Direction and sound are nicely executed and the\nyoung actors' performances are solid. Dylan O' Brien will some day\nbecome a star (of course not as big as Jennifer Lawrence). So if you\nlike your sci-fi mixed with simplistic but intense action this one is\nrecommended.<br><br>Grade: C+ (C if you watch it on TV)\n"},{"review": "\nIt's not interesting, the plot makes no sense at all. <br><br>Why create a movie out of a book if you'e going to dismiss the whole\nstory. This movie has nothing to do with the book. <br><br>The screenplay sucks, my guess is that Dashner didn't even read this\nscreenplay before the movie was produced.<br><br>How are they going to spin all the stuff they changed for the third\nmovie? Creating a bunch of mazes, changing Teresa's role in the story\n(in the books her role is highly important), pulling Wiked's plan out\nof the way, and all the other changes.<br><br>I think that they should not even name this movie \"The Scorch Trials\",\nthere was no trial!!!. In the book, this is all a test to see if WIKED\ncan create a cure out of them. THERE IS NO CURE YET!!!!!!!!!!, the\nmovie suggests that their blood helps! (that makes no sense).<br><br>Just a waste of time.\n"},{"review": "\nThis movie does not even seem the sequel of Maze Runner - seems rather\na stand alone zombie movie. I personally didn't like it at all. The\npace is too fast (seems like a Transformer movie...), too action packed\nwhile the screenplay is too thin in my opinion. I would have honestly\npreferred a bit more talking and a bit less chasing. The beginning for\ninstance is way too fast - not even half an hour in the movie and they\ngot rescued, found a way to escape, found that something dodgy is going\non in the place they are, found \"all\" the secrets they needed to know).\nMoreover I feel that there are a lot of gaps and parts where the\nscreenplay is weak (example: the scene where they run away from the\n\"zombies\" at the first encounter - they just hide below a piece of rock\nwith dozens of hunters a few meters away and... just fall asleep.\nReally?)\n"},{"review": "\nGood first movie left you curious to know what was beyond the maze. But\nunfortunately the writers saw fit to turn it into a ridiculous and\ndisgusting zombie apocalypse. Definitely disappointing and not worth\neven half the price of admission. Good first movie left you curious to\nknow what was beyond the maze. But unfortunately the writers saw fit to\nturn it into a ridiculous and disgusting zombie apocalypse. Definitely\ndisappointing and not worth even half the price of admission. Good\nfirst movie left you curious to know what was beyond the maze. But\nunfortunately the writers saw fit to turn it into a ridiculous and\ndisgusting zombie apocalypse. Definitely disappointing and not worth\neven half the price of admission.\n"},{"review": "\nI am not sure why this movie comes as a sequel, in all honesty it is\njust a generic zombie flick, it could be named however and wouldn't\nmake any difference at all . Everything that happens in it is random\nand unrelated to anything from the first movie, and honestly - it is\npretty boring and rather predictable. Not sure how it got 6.7 score ,it\nshouldn't be more than 5 , if you watch it at home it won't even manage\nto keep you awake. Hollywood needs to come up with something new, it\nhas been a lot of sequel and remakes recently , and very few,if any at\nall , have been good. Slapping CGI everywhere without a decent plot or\nstory is a bad trend for movie industry.\n"},{"review": "\nAn awful movie that doesn't match the books. Terrible plot, terrible\nacting. Read the book and stay away from the movies. Another cash out\nseries. Lazy writing, Poor casting, Expensive production, False\nexpectations. It might be possible that other stories from other bad\nmovies have been thrown in as fillers. Hard to say why something this\nsenseless would be made. Its a great travesty for those that paid full\nprice at t theater to watch it. It could be seen as a bad \"B\" movie on\na rainy day with nothing to do. If your a big fan of bad story lines\nand have plenty of time on your hands. This movie is right up your\nally. I love it when a characters says over and over again I have so\nmany questions and doesn't take the time to ask people they run into\nover and over again.\n"},{"review": "\nI don't understand why everyone hate this movie..And i didn't read the\nbook. But we all have to admit the director did a fantastic job..I mean\nwhy do you guys care about the book!!There may not be much in this\nmovie but all the action,horror,ending with with style speech from\nThomas has been Outstanding..This movie made me excited about this Maze\nRunner Trilogy...This movie made me hunger to watch the upcoming 3rd\nmovie on 2017..Its amazing,the bravery of those children and those\npeople fighting against the organization WICKD..I don't care about the\nother IMDb user's review because everything they said was not\nright.This movie is freaking amazing.In the end Teresa betraying her\nfriends and all that and that women of WCKD coming in the end,all of\nthat was a great climax and awesome! I agree this movie made more\nquestions without answers to our mind and they did that because this\nstory is not over!!Wait and Watch the next movie!That's what they are\ntelling us..Believe me this is amazing and that's why I gave it 10\nstars.And everyone is entitled to their own opinion.\n"},{"review": "\nA lot of this film quite generally did not make sense. For example, it\njust is not explained why there was a point in the maze in the first\nmovie if they were just going to harvest all of the children anyway.\nAlso why was WICKED actively working against other groups which were\ntrying to work towards their goal? Also, parts of the film it looked\nlike they'd just stolen it straight out of 'I am Legend'. <br><br>The movie also just seemed a bit tiring of Thomas just being generally\nan annoying character who constantly made radical decisions and\neveryone to just accept. The scene where the lightening strikes were\nbad also, it literally shocked one of the main characters for him to be\nunconscious for only a couple of minutes and to regain consciousness\nand act like nothing happened whatsoever.<br><br>Its things like this that leads this film to just seem like they've\ntried to make what is clearly a filler movie more exciting by adding in\nridiculous scenes. It left me cringing all the way though.\n"},{"review": "\nThis film is dreadful. Apart from some clever special effects that may\nwin over very young viewers, the film is awful. The plot line is so\npredictable, the characters are so stereotypical, the acting is\nmediocre at best, but by far the worst thing about this film, is the\nclichéd lines throughout. Without giving too much away, the amount of\ntimes the main characters are almost killed, however, while the person\nwith the gun makes the classic Hollywood speech, they themselves are\nshot by another 'minor' character who was supposed to be a 'baddie'.\nThe whole 2 and a quarter hours is full of badly-performed, predictable\nplot lines, dialogue and actions. I have never seen the first Maze\nRunner, however, I do not intend to, if it was anything as poor as this\ninstalment. And from the predictable ending, it seems there is to be a\nthird. I strongly recommend not watching this film. A complete waste of\nmy time and money. Not good enough for a film in 2015.\n"},{"review": "\nI was excited to see the scorch trials after watching the first movie\nand being a fan of the books. But i was soon met with disappointment as\ni found out they had changed the entire plot and made it into a generic\nzombie flick. The cranks where changed into mindless cgi zombies,\nterrible cgi i might add. Virtually no character development or any\nreason to even care about the majority of the characters .all the best\nparts from the book where removed like the metal liquid taking off\nheads and the aliens at the end. It wasn't even just bad but incredibly\nboring. I encourage anyone thinking of seeing it to give it a miss and\nread the books instead.\n"},{"review": "\nI was excited to see the scorch trials after watching the first movie\nand being a fan of the books. But i was soon met with disappointment as\ni found out they had changed the entire plot and made it into a generic\nzombie flick. The cranks where changed into mindless cgi zombies,\nterrible cgi i might add. Virtually no character development or any\nreason to even care about the majority of the characters .all the best\nparts from the book where removed like the metal liquid taking off\nheads and the aliens at the end. It wasn't even just bad but incredibly\nboring. I encourage anyone thinking of seeing it to give it a miss and\nread the books instead.\n"},{"review": "\nThe story line is completely different. The books are able to play with\nyour imagination and emotions. This film completely destroys the story\nyou know and love. The first maze runner had some changes however it at\nleast followed most of the story line. This is completely different\nwith loads missing. <br><br>What happened to the epic journey across the scorch, the twist with\naris and Theresa. No weird orange aliens at the end. <br><br>The action sequences are good and the cranks are perfectly taken on\nhowever the interaction with the characters is only to kill. The book\nmade them interact more with the characters \"Rose took my nose, I\nsuppose\".<br><br>The author of the books should be fuming with this adaptation.\n"},{"review": "\nI found the first film interesting and the unknown added to it.<br><br>This film apart from special effects just appears to be a filler. I\nhave not read the books so wasn't expecting particulars. But just from\nthe title Scortch trails coming after the maze trails, you would expect\nsome sort of actual trail, instead the characters are left to do what\nthey please. Throughout the film you are waiting for some actual\nbackbone and link to the trail aspect but it is never forth coming. In\nall respects this could be on its on and not linked to a series and it\nmay be interesting. As part of the trails series overall satisfaction\nis low and i wouldn't dream of going to the cinema to see the next\nfilm.<br><br>I think ill read the book for this and the final book, and skip the\nlast film.\n"},{"review": "\nI thoroughly enjoyed Maze Runner, and was waiting for the sequel with\ngreat anticipation. The Scorch Trials started fine, and I thought we\nwere going to be taken in another challenging trip where physical and\nmental ability are needed to succeed. But not long after the\ninteresting and challenging part started, the zombies appeared. What!\nWhy? My wife and I were going to leave right then, but the zombies\nappeared to have disappeared, so we decided to stay a while longer. <br><br>But alas, not long afterward the mindless, annoying zombies appeared\nagain, so we left the theater. I don't know what happens after that,\nbut I really don't care. We went to see what we thought would be a\nthought provoking movie, albeit with a few sci-fi thrown in, but\nzombies? Thanks, but no thanks!\n"},{"review": "\nSeriously, in the middle of this movie I spent 15 minutes searching\ngoogle on my iPhone to figure out how to write an IMDb review (this is\nmy first). Can't be done through the the app so I am typing this on a\nlittle safari page on my phone. I'm doing this for one reason - to\npossibly save one person like you from wasting their time or money.\nThis movie is awful, just awful. Crappy zombie rip off with the worst\nof the Hunger Games added in. Since IMDb requires ten lines in the\nreview I will add that the directing is the biggest weakness with the\nacting close behind. Trust me, 10 minutes in you might think this is\nokay to watch but it just gets worse from there.\n"},{"review": "\nThere's only one thing you need to know before watching this movie: It\ndoes NOT correlate with the book/true story line whatsoever. I\nunderstand there has to be some difference from written story to movie\nscript, but the creators of this script paid no true homage to the\nactual plot of the book/any of its contents at all. If you haven't read\nthe series I guess it's not as much of a loss. But as a fan of the\nseries, this movie was actually hard to watch and I will not be seeing\nthe third installment. I already know what happens from the books and I\ncan't see any way they could even come back and make it semi-relatable\nto the books now. I love seeing the characters come to life, but some\nof the actor/actress choices in this movie were not even close to how\nthey were described in the book. It was so poorly thought out and\ndisappointing as a fan of the story. I'm not sure if the author had any\nsay in the book to movie translation, but I feel really bad for him and\nhow his story got twisted around. Very, very bad movie to the fan of\nthe books.\n"},{"review": "\nHaven't read the book(s), so pointing that out from the start, because\nI read some really angry reviews by people who have read it. There's\npeople out there who hate the filmmakers/writers of this, because they\nsoiled on the book and made it something they didn't want to see. Can't\ncomment on that only on how the movie felt.<br><br>And it felt kinda freeing (no pun intended) to some regard. Especially\nafter leaving the one location plot from the first movie. A lot of new\ncharacters get introduced and some nice actors join in on the act.\nWhether you like it or not will depend on if you know where this is\ngoing. It's going actually pretty dark and I didn't expect to see those\n\"creatures\" to be honest. The effects are more than decent and the\nmovie has a nice pace to it (15 minutes of outtakes was a bit excessive\nthough, on the disc, but you can tell they had fun making the movie)\n"},{"review": "\n\"Maze Runner: The Scorch Trials\" is the sequel of \"The Maze Runner\" and\nit continues from the point that the Gladers escaped from the maze.\nAfter their escape they face another obstacles and difficulties in a\nvery hostile environment.<br><br>I have to admit that my expectations about this movie was higher than\nthe first one and that was my mistake. Apparently this movie is as I\nwrote in my title just a transitional stage that guides us to the third\nmovie. This movie consists with a lot of new information that makes it\na little bit boring. This has as a result the action scenes of it to\nseem not as good as it is. The direction of this movie was made by Wes\nBall as in the first one. Dylan O'Brien did his best for this movie one\nmore time but this time his interpretation was not enough. <br><br>Lastly I believe that \"Maze Runner: The Scorch Trials\" is not a bad\nmovie but eventually when it is compared with the first one then its\nquality is lower. The best thing that you have to do is to be prepared\nand do not have high expectations from this movie.\n"},{"review": "\nI have just finished the book and I have to say that I like the movie\nmore.Sure many important parts of the story were missing and it was a\nbit confusing and without connecting points sometime but at least it\nwasn't so violent and negative as the book. I did not like how it was\nagainst Thomas all the time, I mean common he was suffering almost\nthroughout the whole book. The only bad points in the movie were that\nthe sick people were zombies without explaining how they got sick and\nwhat are the stages and also that Teresa was not significant at all in\nthe movie but in the book she played quite crucial role of the\nbetrayer. I hope that the director will focus on the story more than on\neffects in the next movie.\n"},{"review": "\nLike the first Maze Runner this one was an average movie...if the last\n30mins did not bore me.. The movie starts off great and goes into\naction real fast, but as the movie progresses it loses its sweetness\nand goes into bad taste and slowly into no taste at all... The end was\nvery nicely put together and makes you really happy for the next one,\nbut again if this one wasn't really good than why should the people\ntrust on the new one.. In the end the movie is watchable and since I\nhave read the book as well I can tell you that the thired one has an\namazing story and even though this one wasn't that good you should\nstill good and watch it.\n"},{"review": "\nI actually enjoyed the first film, it had a lot of suspense, something\ndifferent for a teenage flick, not the love story mixed with different\nin-human characters :) But just as you think this could continue and be\nsomething, the second one is nothing like the first, yes we have the\nsame actors in the same roles and sometimes it is suspenseful. But why\ndo we have to have zombie like \"monsters\" all of a sudden, are they\nzombies, we never really get to know what they are or why or how, we\nget bits and pieces, if they are saving the whole story for a third I\nam not so sure it will work.<br><br>It does have some entertainment value, and we do get more of the story\nand the plot behind it all, but we are missing the creativity and fresh\nfeeling that the first film provided.\n"},{"review": "\nIn the second Maze Runner movie, Thomas and his friends finds out that\nthey haven't been rescued like we saw in the end of the first movie,\nbut WCKD still has them. So they run away to find the resistance and\njoin them. However the road to freedom is spread with zombies. One\nthing you have to keep in mind is the ending of the first film and that\nthe Scorch Trials has nothing to do with the first movie other than\nthat. It's more of a post apocalypse zombie movie. WCKD are the bad\nguys, but someone can't help but ask, what if they aren't? Sure their\nmethods are extreme, but they are trying to find the cure, don't they.\nIs Thomas in the end way too selfish to not want to help find the cure,\nwhen he can easily die at the outside world anyway? The end does help\nput those thoughts at ease and I'm glad that they did. Other than that,\nthe movie was enjoyable, thought it's characters were a little too\nnaive (they walked right into many zombie nests when they could have\neasily walked away from there in the first place!!) So 3 out of 10\n"},{"review": "\nThe only things the film keeps from the book are the main characters\nand the scorch. I loved the books I would give them 9/10, because of\nthis I was very excited when the film came out but this film didn't do\nthe books justice and went completely off on a tangent and ignored some\nvery important things. Very disappointed and won't be bothering with\nthe next film. I would read the books again and again but I won't even\nbe watching this film again.<br><br>If you enjoyed the first film I would recommend the books as there are\na lot more interesting things that happen in the rest of the series.\nThis film however only contained 10% of what happened in the book and\nruined it for me.\n"},{"review": "\nI saw the first movie, and then I thought the second could have a\npotential, but I was wrong. When the first zombies appear, the first\nthing I thought was \"they have got out of original ideas\" and that is a\npity because it could've become a good film to watch just by following\nthe main principles of the first film. <br><br>It just happens that I feel that the zombie concept has been very\nstereotyped and when you see one you have seen all. There are even\nseveral TV series where the main characters are zombies with the same\nbizarre expressions on the face and the perverse convolutions on their\nbodies.<br><br>Another disappointment is the attitude of the main character that in\nmost scenes has the same expression of awe in control. Strangely enough\nthe director has made these scenes with that same expression\nunnecessary long which results making the film to seem boring and slow.<br><br>Thus the genre of the film perhaps should evolve from science fiction\nto horror film.\n"},{"review": "\nIs it really the instalment of next episode of the awesome Maze Runner\nor we were scorched trolled? <br><br>A good start which never finished until the end to keep the audience\nlingering on and on with the expectation of 'something will happen now'\nwhich never happened but only a marathon which Thomas finally decided\nto finish. So this part was dedicated to 'escape' only which they all\nmanaged to do in the beginning and that's all. My two stars go to CGI\nmakers for some nice cinematic.<br><br>Watch this movie if you like trilogies or you have the patience to\nwatch soaps!!!\n"},{"review": "\nI'm i the only one who hate every second of this !@#$ing bullshit movie\ni mean this is !@#$ed up guys its resident evil in teenage style a\n!@#$ing teenage who will save the !@#$ing world and who is that leader\nOH ya its !@#$ing Dylan O'Brien WTF WTF i can't believe it they put him\nas hero \"a leader\" of resisting who will save the world from glades and\nthey put Barry pepper as second command or something !!!!!!! let me\ntell you something its happen guys its really happen they don't care\nanymore they just do what \"most viewer want \" even if the rest of as\ndon't like it \"i mean thous who care about the quality of good movie a\nright character in the right role\" but nothing is change nobody care\nwhat they want is making money that's all what they want in other word\nif you don't like it go !@#$ yourself guys movies are not what we used\nto be everything is change not for good but for worse i don't know if\nI'm the only one who see it this way but i don't know anymore\n"},{"review": "\nThe first sequel, was pretty good.<br><br>I expected this one to be better, but, it was very bad enough to write\nmy first review. <br><br>The graphic was awesome.<br><br>But the way actors were performing is disappointing. there are a lot of\ndelayed reaction in difficult situation, then become witty at others.\nperforming in cliché heroine way.<br><br>when the girl snitched them, the main character kept looking at her for\nawkward time, saying what have you done. instead of running and warning\npeople before they arrive and shoot the place.<br><br>the main character was discovering terrifying place instead of going to\nlight<br><br>I regretted watching it in the cinema. and i am not going to watch any\nlater sequel.\n"},{"review": "\nBetter visual effects and more action but less suspense (unless zombies\nreally scare you) and more predictability than the first one. This\nseems to be one of those movies where the trailer is significantly\nbetter than the movie. A bit of a waste of time unless you are really\ninto zombie movies. Less character development and a more shallow look\ninto the characters than the first one. More like a horror movie with\nsome action. Plot does not include too much intrigue to make the movie\nreally interesting. You will probably want to see it and still enjoy it\nif you have seen the first one but otherwise you may have better\nchoices. I was looking forward to seeing it but I came out somewhat\ndisappointed because I am not really into zombie movies. Yes, that is\npretty much it. A good quality zombie movies with somewhat weak plot\nand significant predictability. Don't hurry to see it but rather wait\nso that you don't spend as much money unless you are a zombie junkie.\n"},{"review": "\nThe movie strayed so far from the book that someone can come out and\nactually make a new movie for this book in the Maze Runner Series.<br><br>There were only 2 groups of kids in the base not many from different\nmazes. And Aris and Teresa get put with their respective genders to\nfight through the Scorch, which is a huge desert wasteland and yes they\ndid head to the mountains but my goodness where is the book and movie\ncross over? Only the characters names basically resemble whats going on\nand the party that Thomas and Brenda go to.<br><br>I don't recommend seeing this movie if you hope it is based of the book\nbut if you want an action packed thriller full of twists and turns then\nsure.\n"},{"review": "\nThe first movie i loved, it did the book justice. Although the book was\na lot better, the movie was good. This sequel totally went off to\nanother place. Its a completely different movie and story from the\nbooks. Disconnected from the first movie. I am sad that this was done,\nif they wanted to adapt the book at least stick to the storyline even\nif they ended up taking out things and changing a bit here and there\nbut to change it completely. I don't normally write reviews but this\nwas a disappointment. I will not watch the third one if it comes out, i\nwill wait for it on DVD just out of curiosity but would not pay to go\nsee it at the theatre.\n"},{"review": "\nThis movie is much worse than first part, first part was interesting\nbecause of solving surrounding world structure living in alienated\nenvironment while this movie had no interesting plot and was very very\ngeneric. I was quite disappointing because I thought we get similar\nvibe,mystery and puzzle solving as first one. We get quite interesting\ncharacter development in first movie but not at all at this one. It's\njust going forward \"scene\", going forward \"scene\" I mean really... dumb\nplot . Of course it was done by the books, probably I would dislike the\nbook same as this movie. Anyway everyone has their own opinion. This\nwas mine\n"},{"review": "\nI really liked the first part and really enjoy YA movies. I was quite a\nbit disappointed by this movie.<br><br>The action was mostly created by weird rocky camera movements, as if\nthey were running with the camera wrapped around them. There was hardly\nany real action.<br><br>Also, if it's the \"Scorch\" trials, where are the trials? They ran a\nbit, they fought a few \"zombies\", but didn't even break into sweat.\nIsn't \"scorch\" supposed to be hot?<br><br>Also, why is Brenda, who plays one of the main roles in the second half\nof the movie not even foreshadowed before. Balance is missing..<br><br>Well, I really hope the next one is better and am now off to read the\nbook, hoping there's some more stuff happening in the book.\n"},{"review": "\n*Spiloer* The first maze runner was kind of boring but I sat through it\nand at the end was actually hooked. I couldn't wait to watch the second\nso I immediately rented it for six bucks. Oh how I wish I had seen\nthese reviews. At the end I was left with a headache from being so\nconfused and tired it was a two hour movie ! Full of poop ! Cgi\nzombies, kids getting drunk or high off some liquid, weird movie just\nstick to the books ! My eyes hurt, I'm tired. I can't believe I watched\nthis still why ? God why ? I hope sleep will make me forget this poop\nof a movie. Horrible movie. Horrible plot. Scattered confused headache.\nSuch a waste of sight just a poop.\n"},{"review": "\nThe Maze Runner book series is one of my absolute favourites n the\nworld.<br><br>I loved the first movie The Maze Runner so much, I was then so excited\nto see The Scorch Trials with my best friend. We were literally\ncounting down the days on my phone till it came out at the cinema. When\nit finally did me and my friends went to see it straight away but\nafterwards I think I was extremely disappointed with it. It was o where\nno as good as the first one all the new actors they had who played\nBrenda and Janson where just awful, I just cringed every time they were\non or had a scene.<br><br>To conclude watch the first movie and not the second!!!!!!!!\n"},{"review": "\nSo many haters on IMDb and I wonder why. I honestly did enjoy Maze\nRunner The Scorch Trials. Like I did enjoy the first one as well. I\nwanted action and science fiction and that's what I got. You can't say\nthere is no action in this movie because that's all there is. Action\nfrom the first second till the last second. The sci-fi is also good\nenough for me to entertain me during more then two hours. I saw way\nworse sci-fi movies then this one. Better ones as well but that's not\nthe point. This movie keeps you entertained and that's what's it all\nabout to me. The actors are not bugging me, not a single one of them,\nand that's rare to me. I am already looking forward to the next Maze\nRunner and I am not a big fan of long series of movies, so that resumes\nit all. To the haters, go watch some stupid movies from Lynch or Von\nTrier, where you waste your time with a movie without a story, and then\nbrag about how great it was shot.\n"},{"review": "\nI just watched the movie, and I have to say that I liked it quite a\nbit. Had me on the edge of my seat and I really liked the actors. I've\nread some other reviews, however, and a lot of people are really upset.<br><br>This is mainly because apparently the movie diverged very far from the\nbook. Well, I can see how that might be really frustrating since a lot\nof people came to see the book brought to the big screen, not some\nother story under the same name.<br><br>However, I thoroughly enjoyed the movie. I didn't read the book, so I\ncan't say if it's better or worse. All I can tell you is that I was\nentertained for all of it. It's not going to be remembered as a\nmasterpiece, but I'll remember it as a really good watch. <br><br>Sometimes, you have to enjoy a movie for what it is, not the book you\nwanted it to be.\n"},{"review": "\nI am one who has never read the books, and so cannot (and do not want\nto) weigh if the movie is true to its source material. But I did watch\nthe first part and was really looking forward to this one. I found the\nmovie quite engaging. 90% of the time there was some action going on\nand it was always an interest in what will go on next.<br><br>The pace of the movie was adequate, even with around a 2 hour run-time\nand the acting was good. One of the few problems I have with the movie\nis that it doesn't really give an insight to its prequel. One has to\nhave watched the previous movie to understand what is going on. They\nalso don't really explain what certain terms e.g. Scorch, mean. This is\nprobably surprising given that they did give quite a lot of answers to\nquestions that were springing up in my brain while watching the movie.<br><br>Overall, I really enjoyed the movie. Having read other people's\nreviews, I feel that the ones who have read the books will be\ndisappointed. So my suggestion is not to expect too much in that regard\n"},{"review": "\ntotally bullshit. i was awful felt for the scriptwriter. Scriptwriter\nwas drunk or something. totally bullshit. i was awful felt for the\nscriptwriter. Scriptwriter was drunk or something. totally bullshit. i\nwas awful felt for the scriptwriter. Scriptwriter was drunk or\nsomething. totally bullshit. i was awful felt for the scriptwriter.\nScriptwriter was drunk or something. totally bullshit. i was awful felt\nfor the scriptwriter. Scriptwriter was drunk or something. totally\nbullshit. i was awful felt for the scriptwriter. Scriptwriter was drunk\nor something. totally bullshit. i was awful felt for the scriptwriter.\nScriptwriter was drunk or something. totally bullshit. i was awful felt\nfor the scriptwriter. Scriptwriter was drunk or something.\n"},{"review": "\nI was eagerly awaiting for this film to come out on screen as I loved\nThe Maze Runner and it's concept. However, I was let down by pretty\nmuch all the film.<br><br>I think the writers just decided that because zombie films/series' are\n'in' at the moment they should introduce them into this film to try and\ninflate the income.<br><br>The reason I loved Maze Runner is that it stood out from most movies\ntoday and felt new, fresh and vibrant.<br><br>The storyline was flat, it didn't feel like a 'trial' and the whole\nmovie felt empty to me, a blank canvass compared to its prequel Mona\nLisa.<br><br>I wish I could get that 2hr 11mins back of my life and invest that time\nbetter, I certainly won't be investing anymore time in future releases\nof this franchise.\n"},{"review": "\nAll the way through this god awful film I questioned every character\naction. Like why not take the gun after Winston shoots himself? Is a\ngun only good for letting Winston commit suicide? Why take so long when\nthe building is collapsing? Why are you staring at the zombies?? RUN!!!\nWhy skate along a board walk whilst holding the handrail? SPRINT!! The\nonly reason I watched this shitty film is because I made the mistake of\nwatching the first one... I don't like leaving movie franchises\nunfinished...<br><br>Do Not Watch This Piece Of *beep*!!! They could have done something\ngreat with this film yet it is riddled with the typical movie error of:\nThat Is Not What Anyone Would Do In That Situation!\n"},{"review": "\nWhat surprised me the most about the Scorch Trials sequence was that\nthe time watching the movie passed so fast that I was surprised when it\nended! Actually I did not expect the ending to be like that - to me,\nkinda abrupt. But I guess it is a good ending for the next sequel.<br><br>So, I guess the movie was really entertaining. It was fast paced and\ninteresting. I had to watch / find the ending of the first part to\nremind myself what was it all about. <br><br>Although it can be seen - in my opinion - as a stand alone movie -\nknowing the first part helps you see the story better.<br><br>For me it was fun fact that there are some actors from the Game of\nThrones series. <br><br>All in all, not bad. I give it a seven as a rating.\n"},{"review": "\nFirst of all, I didn't have very high expectations of this film. Still\nthough it managed to be a shocking disappointment.<br><br>Let me compare it this way - you're buying a bike so you don't expect\nit to be a sports car. Then it turns out to be drawn by a 6yo with\ncrayons on a piece of cardboard. That's pretty much what the new Maze\nRunner is.<br><br>If you're even moderately intelligent, logically thinking person and\nnot a masochist, please do yourself a favor and don't watch this. It's\none of the stupidest films of the year. What they've done is taken\nsomewhat decent storyline material and turner it into an unwatchable\npiece of ****.\n"},{"review": "\nAll through this film I caught myself saying, \"I don't remember this\nbeing in the book...I don't remember this being in the book...I don't\nremember this being in the book...\"<br><br>I was so looking forward to this film after seeing the original Maze\nRunner, but came away sorely disappointed. If I had not stayed until\nthe bitter end, I would've asked for my money back as it bore little\nresemblance to the original story.<br><br>I'm not holding out hope for the third installment if the same people\nresponsible for this bastardization of the story are working on that\none as well.\n"}]
