[
{"review": "\nHe never misses, he is literally unstoppable.... He's got a particular\nset of skills that would make Liam Neeson look like a catholic\npriest... Did I mention he shoots a priest in the leg? This action\nmovie was \"perfect\"..... Is it in the realm of the best subjective\nmovies of all time, Godfather, Shawshank or The Dark Knight? Well no\nbut in terms of the genre it's self? I'm giving it a perfect 5 out of 5\nStars... Hell continuity was even good, the dialog was sound and had\nmoments of humor at every beat, and Keanu actually shows some range...\nYeah you heard that right, raaaaange.... Not only that Mr. Wick even\ntakes time to reload again everything just worked perfectly with this\nmovie... I don't have anything to nitpick... The supporting cast was\neven good, this is a perfect fun action movie.... Dammit I gotta see\nthis again. Remember children when the boogie man goes to sleep, he\nchecks under his bed for John %^$% Wick...\n"},
{"review": "\nBased on the reviews I read in here, I was expecting much more from\nthis movie. Yes the movie is action packed, but very much over done.\nCertainly not a quality movie by any means, with a weak story line. It\nwas like being in an action game where the lead had unlimited\nlives....he is invincible no matter how many times he is shot! There\nare assumptions that we will understand the rules of the \"committee\",\nbut these are never explained and we are left with very few answers the\nend. In light of the over the top and often excessive violence and\nkillings, I must say Keanu Reeves' performance is the only highlight of\nthe film. Overall however, a very weak story with unnecessary and\nexcessive violence, and a plot that is more suited for a PlayStation\ngame.\n"},
{"review": "\nI thought this was one of the worst films of all-time. I only went to\nsee it because it had an 8.3 rating on IMDb. Wow! It is still rated\nover 8.0 as we speak. Holy crapamole Batman! This film was boring,\nlacked ANY character depth, and wasn't amusing or visually interesting.\nI have literally never been so shocked at the poor quality of a movie\nscript or character development.<br><br>Wow. This is the worst film I've seen in many, many years. And I'll\ntell you, it boggles my mind that MOST of you found it enjoyable. Just\nboggles my fracking mind.<br><br>And here is my tenth and final line so that I can post this review,\nwhich most people will dislike but a few random souls will agree with\npassionately.\n"},
{"review": "\nI do not know what a lot of you others are drinking before you watched\nthis attempt at a film but I will not be imbibing, that's for sure.\nThere are comments in some of the reviews here that this will be a new\ncult film, that it is the best action film of the year etc etc etc.\nSorry but 'fail' is the only word that comes to mind. The gratuitous\nand total violence is just pathetic and I might say a serious low point\nin American culture. Keanu has returned! From what? He looks like a\nvery sad has been actor forced to not act so that the film maker can\nget his rocks off on this masturbation or a movie. I hope that the\ndirectors and producers of this garbage are duly banned from ever\nmaking another attempt. Seriously people, if you liked this film then\nyou need to seriously look in the mirror. I mean really! If the mirror\ndon't crack then just be thankful. If I had to find just one redeeming\nfactor I would be very hard pressed. OK - I liked the little dog. YUK!\n"},
{"review": "\nOne-dimensional story: check. One-dimensional characters: check.\nTerrible dialogue: check. Bad acting: check. Uninspired action scenes:\ncheck.<br><br>I checked IMDb before watching this. People talking about how this is\ngoing to be a new cult classic or the revival of Keanu. WTF are you\npeople on crack or something. It was terrible from start to finish! <br><br>This movie is all about the action and even that feels completely\ngeneric and uninspired. The dialogue is just plain painful to watch. I\nactually felt shame for the people 'acting' on screen. <br><br>The story...... what story? It's virtually non-existent. Every random\nperson you find on the street can write something better than this.<br><br>The only thing going for this movie is Keanu looks cool. Even when his\nacting sucks.\n"},
{"review": "\nInteresting action movie. What i really liked about it is that lack or\nnormal exaggerations in the movie continuity. John does NOT shoot 100\nbullets from a handgun without reloading, he does NOT fight for 20\nminutes with the bad guy at the end and he does NOT have superhuman\npowers (like flying through windows, dodge bullets or fall from 50\nmeters without repercussions). Yes, it's a bit brutal (90% of the guys\nget shot in the head), but it's exactly what i would expect in real\nlife if a person like Wick would really exist and would go rogue.\nBesides that, some clichés, some cars miraculously exploding (i think\nthe only thing which was really amateurish made in the script) and the\nnormal lack of story in a bang-bang-shoot-don't-look movie. But, at\nleast Wick goes after the bad guys for killing his dog, not the woman\nhe loved (like in most of the others). <br><br>Overall, 9/10 to watch, 4/10 to watch again.\n"},
{"review": "\nShitty movie. Honestly, after the first 20 minutes, I had to turn if\noff. Really? Killing a dog? Was that necessary? Also, it hurt my ears\nto hear the TERRIBLE Russian being spoken by the \"bad dudes\", and the\nguys who play the gang members aren't even Russian for god sakes. And\nas a Russian, I gotta say I am also incredibly sick of Hollywood\nliterally ALWAYS using Russians as the \"bad guys\". Change it up for\nonce. Keanu Reeves has played the same character- even if different\nmovies- for the last several years. Blah blah, revenge, ex-hit-man,\nblah blah, good guy versus bad guys, blah blah blah. Hollywood movies\nthese days are all identical and lack originality. Save your time and\nwatch something older, like an action movie from the 80s and 90s.\n"},
{"review": "\nNo major spoilers. If you like the action genre done well. Watch John\nWick. Vehicles flying around at high speeds, great gun play and kungfoo\nstuff. This is an action movie! Yes a very violent one and done well.<br><br>Its been a few years since we have had a well made action movie for a\nmature audience that could warrant being a new trilogy. Unlike The\nExpendables. This one is it. But if it dose not happen. Its sure to be\na singular cult classic. Especially with its refusal to be a shoot em\nup style of show, but a shoot em in the face style of show. As well\nthat one of the main plot features, put simply, is that Wick is seeking\nout vengeance because of the murder of his puppy. Any way no more info.\nWatch and enjoy.\n"},
{"review": "\nPut your brain on hold and just sit back and relax for an hour and\nforty five minutes while Keanu Reaves finds a multitude of ways to kill\nmany nasty people. The story is silly, but the action is continuous as\nWick is pursued throughout by men and women with bad intentions. He is\na karate expert and is also skilled with a variety of knives and\nfirearms which are quite useful to our hero. His background is sketchy\nand never really explained but one must just suspend belief and just\ntake the ride as if on a roller coaster. Willem Defoe shows up to fill\nout a decent cast with Reaves carrying most of the load, as he is in\nalmost every scene. It looks good and the New York locations are a good\nchoice. A final 7.5/10.\n"},
{"review": "\nthe scale does not have a 0. despite a whole lot of famous actors and\n2nd role ones, lots of killing, lots of killing, and again.<br><br>k Reeves needs money...<br><br>the whole plot is about a guy that got his car stolen and his dog\nkilled. <br><br>he wants revenge for this... <br><br>and he is gonna kill a couple of hundreds of mob people for that. <br><br>charming. waste of time.<br><br>barely watchable nice costume though<br><br>he wants is fxxx dog back...\n"},
{"review": "\nCannot think of anything to redeem this movie. Fight scenes were boring\nwith baddies unable to find their target at 3 feet. An expert as John\nWick was supposed to be was unable to fight off 2 thugs and an idiot in\nhis own house. He could shoot every other baddie but when it came to\nIosef he kept missing. Why didn't he kill Ms Perkins? What was the\nsignificance of the gold coins, or was I too uninterested to catch what\nit was. Also Willem Dafoe was just a pointless addition, could have put\nanyone in that part who just wanted to collect a cheque for little\ncontribution. Again Keanu fails to impress, and this was 100 minutes of\nmy life I will not get back. Do yourself a big favour and give it a\nmiss, really.\n"},
{"review": "\nIt is B level action movie. You can easily remind of other movies like\nthis. Equillibrium, District 13, The transpoter and many other action\nmovies with handsome, heroic guy. <br><br>Keanu fights usually with guns in this movie. But it brings more body\naction into the shooting scenes, so it becomes more stylish. Great to\nwatch it at home, not boring at all, if you don't expect something like\n007 series with Daniel Craig or Born series. Keanu kept his face and\nbody almost perfect, so he is still handsome and fit, good enough for\nthe film like this. But the enemies have less impression. They are fine\nbut not new, bit similar to villains from 90's action movies. I\nrecommend this movie if you are looking for something easy and fun, and\nyou've already watched every other great action movies like Born\nUltimatium or 007 Casino Royal.\n"},
{"review": "\nThis movie was excellent. There are a lot of new faces in this movie\nwhich would make me feel it's low budget, but the actors have all put\ntheir best in to this film and you can see it.on screen. I have seen so\nmany films that just don't capture the viewers eye, this movie keeps\nthe viewer glued to the screen in till the end. It also ends of a\ncliffhanger which I always find is best. <br><br>Keanu was a great choice for this role, he plays a hit-man with ease,\nbut there is always a little spark which he puts into his acting which\nmakes him stand out from the crowd.<br><br>All in all 9 out of 10. By far better than any other action movie of\nthe past 2 years.\n"},
{"review": "\nThis movie has some of the best quotes I have heard since a Tarantino\nMovie. A past assassin who tries out a new life, of marriage, and\nbliss. When he looses his wife, and someone kills his only thing given\nto him from his wife before she died, he has to dip his feet back in\nthe pond of chaos, and ends up taking out the whole Russian Gang of New\nJersey to kill the bastard son and everyone infected with the curse of\nbeing related or working for the kids father, who is the Russian Mob\nBoss of New Jersey. Great Acting, Great Actors, and I noticed Keanu is\ndoing a lot of his own stunt work in this movie, and had to do a lot of\nClose Combat Training for this movie, and future movies to come. I seen\nhe stars in Knock Knock a recent Sun Dance movie just released, but\nAkira is the movie I am waiting to see him in. This movie is great, and\nkeeps on you on the edge of your seat. Watch it to find out if he gets\nrevenge for the person who took everything from him after he lost the\nonly thing that mattered in his new good life.\n"},
{"review": "\nThis is one of those movies that makes you get out of the theater and\nyou want to kick someone. It's full of action, no excessive drama, no\nbackground history asides from the fact that everyone has to be scared\nof John Wick just by pronouncing his name just like \"The Boogieman\". <br><br>Keanu Reeves is perfect for this role, no expressions, no feelings,\njust a couple of lines and shooting a lot of bullets, very precisely by\nthe way, the real acting is on the hands of Willem Dafoe (sort of).\nAlfie Allen is kind of on the same role as the one in Game Of Throne,\nsorry but I have to say it, I watched him and can't stand thinking\nabout how he's useless here too.<br><br>For an action movie I really like this one... and I'm thinking who's\nbetter John Wick or maybe Bryan Mills?\n"},
{"review": "\nGone are the days when you could trust the internet ratings on\nrotten-tomatoes, IMDb.. hell even Wikipedia entry is so wrong about its\n\"reception and critical acclaim\"..<br><br>This is one of the worst movies ever. It's a shame.. IMDb ratings.\nMovies like these will keep coming out and rigged ratings will keep\nearning them money. Hollywood is losing it.. <br><br>Do yourself a favor, and do not watch this garbage. The positive\nreviews on this website are so clearly made up by the possible\nstakeholders.. Maybe the producers nowadays are hiring marketing teams\nwhose jobs are to make multiple IDs and post as much positive reviews\nand ratings on sites like these to fool the public.. and guess what it\nsells.. some of the positive reviews are so clearly typed by the same\nfingers.. it is a shame.\n"},
{"review": "\nOne of the best action film. It keep you eyes focused on screen the\nwhole time. I was amazed by the sequence and story line Perfect movie\nto watch on holidays and with family.<br><br>The Hotel Rules were amazing <br><br>And the code word use for body disposable service was great<br><br>This movie is really good action in it<br><br>There is a underworld mafia<br><br>Contract killers <br><br>People work for Gold coin instead for case <br><br>Recommended to Friends: YES Action: 8/10 Storyline: 8/10 Acting: 8/10\n"},
{"review": "\nThis is basically a movie about vengeance. Although if someone kills\nyour dog, it does not really justify a body-count of 100s. After the\nfirst 20 minutes, this movie merely offers up set pieces of violence\nand killing set to grungy rock music. The violence reminds me of a FPS\nvideo game, where killing is cool and fun. Indeed, I must confess to\nfast-forwarding briefly during the final fight scene (yawn). A\npredictable and mindless offering. If not for the delightful Ms\nPerkins, then I would have given this movie a zero.<br><br>Don't get me wrong. The production and violence and well executed, on a\ngood budget. If that's what you like, then go for it. But as a Keanu\nReeves fan, I remember great movies like Constantine, The Gift, Matrix.\nAlas, this movie is not great. Just violent mindless drivel set to a\nnoisy soundtrack.\n"},
{"review": "\nAn ex-assassin loses his wife to cancer, her last gift to him is\nprobably the worlds cutest dog. This lasts for maybe a day or two as a\ncouple young punks break into his home, kill his dog and steal his car.\nTurns out the guys who did this too him is the son of his former boss.\nNow you learn throughout the movie that John Wick is known by just\nabout everyone in town. So why this kid didn't know who he was is dumb\nbut its what makes the story take off.<br><br>John Wick is an action film that you need to just sit back, watch and\nenjoy. Don't nitpick at the little things. Such as the dialogue being a\nlittle bit corny, or the many cliché's that occur. This movie has\nfantastic gun fight choreography. In my opinion, its in the top 10 for\ngun fights. I also liked the world they created. The world of contract\nkillers was different from what I had seen in the past.<br><br>The good guy is a likable character and you feel for him. You also\ndespise the bad guys especially the son. Bottom line, its a good time\nand if you like action films, I highly recommend it.\n"},
{"review": "\nNormally I'm not a fan from the one-man-army against a 300 men.<br><br>And i must say i didn't had much hope this to be good. After the first\n10 minutes i was thinking to turn it off,<br><br>But then it actually took off, and didn't stop with good solid action,\nand some unrealistic but very fun to see shootouts.<br><br>Good action movie. definitely worth your 90 minutes of time.<br><br>I'll give it a 7.8 out of 10 Lets hope America makes more of this kind\nof movies in the future (i need to write 10 lines) I'll give it a 7.8 I\nhave nothing more to add, only to make sure i have 10 lines of text so\nIMDb machine is happy\n"},
{"review": "\nIf I could give this piece of crap 0 stars I would. This is easily one\nof the worst movies I've ever seen. Even cheesy 80s action movies like\nCobra had better writing. <br><br>So many other reviewers already pointed out so many of the completely\nterrible plot holes, nonsense, and idiocy that I'll just leave most of\nthat out of this review. <br><br>That being said, there's terrible video games with better stories than\nthis movie. You'd be better off staring at a wall while punching\nyourself in the side of the head for 2 hours than watching this piece\nof crap. <br><br>Skip it.\n"},
{"review": "\nJohn Wick, ex hit-man, comes out of retirement and sets out for revenge\non those who have taken all that he had left - a rather basic plot.\nThis doesn't stop John Wick from being a stylish, action packed movie.<br><br>The action scenes are top notch and are fitted together with an\nexcellent soundtrack. The character John Wick is an intimidating expert\nkiller who throughout the film evokes emotion without compromising the\nseriousness and sharpness of his personality.<br><br>If you are looking for an hour or so of pure entertainment, then this\nis a film worth investing in, it will make you want to re-watch it\npurely because it is a good time. If, however, you are searching for a\ndeep, psychological masterpiece, I suggest look elsewhere. 8/10.\n"},
{"review": "\nJohn Wick is an instant classic action film. It doesn't have a crazy\nplot that makes it easy to get lost its just basic. You don't have to\nwait long for the action to begin and when it starts it goes pretty\nmuch right through to the end. I really hope that this is the beginning\nof a franchise because it certainly looks that way. I hope this film\ngets some attention because I didn't hear much talk about it and its\nrun in the theater went by fairly quietly (although it did make 50\nmillion bucks of profit). It also great to see Keanu Reeves find a role\nthat seems to spark a comeback for him. Keanu has been a huge action\nstar for over 20 years and its nice to see him back on top. John Wick\nmay become one of his significant roles in the future.\n"},
{"review": "\nA lot of video games have been influenced by films - the plots, the\ncharacters, the framing, the cinematography. And increasingly a lot of\nfilms are now influenced back by video games - the plots, the\ncharacters, the framing, the cinematography. And so it is the case with\nJohn Wick.<br><br>It's set in a world where everyone seems to be a gangster or an\nassassin, or a formal part of that world. It's all rather cold and\ndetached. There is the flimsiest of back stories but it mostly consists\nof a very wooden Keanu Reeves shooting people in the face, sometimes\nstabbing them, and of course the obligatory 'throwing people through\nsheets of glass'.<br><br>The whole point of a video game is that you control the character. Even\nif the game consists merely of killing people, the fact that you are\ncontrolling them makes it an immersive experience.<br><br>Just passively watching a wooden game character shooting people in the\nface, sometimes stabbing them, and of course the obligatory 'throwing\npeople through sheets of glass', makes for a rather pointless and\ntedious 101 minutes.\n"},
{"review": "\nThis jerk who wrote this film is unbelievable. I can't believe anyone\nthinks it's okay to kill an innocent puppy in a film.<br><br>YOU SHOULD BE VERY ASHAMED OF YOURSELF, DEREK KOLSTAD.<br><br>It was completely unnecessary for you to kill the puppy in this film.<br><br>Maybe that's the best you could do.<br><br>If I was your mother, I would be completely embarrassed by you.<br><br>I will never see anything that you are associated with again.<br><br>It was a waste of my time and money.<br><br>I've always liked Keanu Reeves, but I'm surprised he would associate\nhimself with someone that would write such crap.<br><br>Shame on you too.<br><br>Very sad.\n"},
{"review": "\nThis is a worse film I had seen in last years and I just do not get HOW\nit comes here to average from 7+ ??? The story is: Guy kills hundreds\nof people because of one dog. Wonderful. And on the top, implementation\ndetract/lacks any logic.. It is so sad to see such a great actor in\nthat kind of crap movie :( So sad. This is a worse film I had seen in\nlast years and I just do not get HOW it comes here to average from 7+\n??? The story is: Guy kills hundreds of people because of one dog.\nWonderful. And on the top, implementation detract/lacks any logic.. It\nis so sad to see such a great actor in that kind of crap movie :( So\nsad. This is a worse film I had seen in last years and I just do not\nget HOW it comes here to average from 7+ ??? The story is: Guy kills\nhundreds of people because of one dog. Wonderful. And on the top,\nimplementation detract/lacks any logic.. It is so sad to see such a\ngreat actor in that kind of crap movie :( So sad.\n"},
{"review": "\nFirst time making a review here and this movie made me to do so. This\nMovie has nothing at all. A guy is shooting dozens of people one by\none. Thats it !<br><br>What I will suggest that start movie, watch for no more than 10 minutes\nby expecting somethings then close your eyes and go deep sleep. Don't\nforget to switch sound at lowest, lots of shooting will bother your\nsleep.<br><br>I have nothing to add for this empty movie, it doesn't deserve to get\nmore to say.<br><br>But IMDb wants me to add more lines.\n"},
{"review": "\nCannot believe how weak and pathetic this movie was. I was expecting at\nleast a plausible story line and gripping action with Keanu Reeves in\nit. But Reeves acting was SO shallow and unbelievable, as was everyone\nelse's. The plot was barely existent and everything in it was just a\nrepeat of so many other movies. The action was stiff and repetitive,\nand absolutely lacking in reality. The story was unbelievable to the\npoint of being ridiculous, and the concept of Reeves being able to do\neven a small portion of what he was pictured to do, was just absurd.\nCan hardly believe actors of Reeve's caliber could even consent to act\nin this B-grade rubbish. It's like a kid's movie - all impossibility\nand fantasy. Nothing gripped me at all, not for a moment. One of the\nworst movies I've ever seen.\n"},
{"review": "\nthis movie is an offense on my IQ - it was 100% predictable from the\nbeginning - complete waste of time so disappointed with IMDb for giving\nthis movie 7.5 - WHY? I am expected to write 10 lines of text about the\nmovie that doesn't even deserve one. I could easily say it was one of\nthe worst movies I've watched recently - give you my word! Actually,\nthe reason I decided to open an account in IMDb was to share my\ndispleasure with the actors, the plot and pretty much everything else.\nThere was a countless number of moments when I literally couldn't\nbelieve the producers managed to get away with such unsophisticated B\nclass stereotypical unengaging movie. So my word of advice is: NO! I\nwatched Whiplash only yesterday and it made me feel like changing from\nForm Mustang to Fiat Punto...\n"},
{"review": "\nBefore I start, I feel I have to state that John Wick is more than just\nanother Popcorn Movie. Its stunning choreography, seamless switching-up\nof fighting styles and without a doubt; its cast, are impeccable.\nReminiscent of other revenge thrillers such as 'Taken,' and 'The Man\nfrom nowhere;' John Wick enthrals the audience with it's visuals while\nkeeping you connected with it's personal performances. Keanu Reeves was\nborn to play the part of John Wick; the nice, quiet guy with a big dark\nsecret. If you're looking for a movie you need to watch twice to fully\ngrasp it's countless layers and subplots; go watch Memento, or Donnie\nDarko. If you're looking for a movie you want to watch twice because\nyou have to show your buddy what a bada** Keanu Reeves' is; then look\nno further. John Wick is as manly as a steak dinner washed down with a\n6-pack of PBR. I thoroughly enjoyed this film and cannot wait for John\nWick 2.\n"},
{"review": "\nlmao.....This movie was so sick that i have renamed it...Its John Sick\nrather..... I have never seen such a crappy flick for ages now...what\nwas it all about? How could he survive all the bullets shot at him, and\nhow come whoever he shot at, got killed? Im disgusted that i ruin my\nweekend for this movie..... Keannu's acting was awful too..he was ind\nof frozen in the whole movie...no expressions at all...i was still\nrecovering from the action scenes from THE EQUALIZER and here we go,\nanother crappy flick.... I still have 4 lines to qualify for the review\nsubmission....I just don't know what to write.... Please do watch it\nonce everyone..... I want you all to go through the same pain i went\nthrough..........................\n"},
{"review": "\nThe filmmakers of John Wick looked at action movies and figured out a\nway to make them better. What if you cut everything that the movie\ndidn't need - the love interest, the convoluted plot, and the\nmoralizing? What's left is a pure action movie without anything it\ndoesn't need. They knew people liked choreographed action sequences and\nthey filled the movie with plenty of them. In subtle ways, it makes\nadvances in the genre. For example, notice how characters react when\nthey hear the name - \"John Wick.\" They're instantly terrified. The one\nthing that I wanted that the film didn't give me was something truly\noriginal. Unlike The Matrix or Inception which really changed action\nmovies, this movie doesn't. But man, if it doesn't change the game, it\nplays the game like a true master.\n"},
{"review": "\nOne of the best revenge movies out. One thing I really like is the\nshootouts. Keanu trained with real tactical trainers using real guns.\nIm a gun guy so seeing movies with guns really turn me off because what\nthey are doing is not practical. There is a Youtube video of Keanu\nshredding at three gun. Thats where you are going through a course\nusing a rifle, handgun, and shotgun. People are comparing it to Taken\nwith Liam Nesson. I think it is a better movie then Taken. There is\ngood acting not only from Keanu but also Alfie Allen (Theon from Game\nof Thrones), Michael Nyqvist, and Willem Dafoe. Below is a link of\nKeanu shooting three gun competition. <br><br>https://www.youtube.com/watch?v=tpr8oqyjKIc\n"},
{"review": "\nWriting a review for the first time and several months after watching\nthis movie, I just wanted to share my feelings about this movie.<br><br>I have to say I never expected Keanu Reeves at this level on an action\nmovie since the first Matrix. Certainly he has had some films out since\nthen but those are not even close to this one. <br><br>I really enjoyed all the action scenes, and the world of darkness in\nwhich all these hit men live. I want to know more of it, more from the\ncharacters, more about the history of 'The Continental' and I'm pretty\nsure everyone wants to see more of 'the Boogeyman'.<br><br>John Wick is a solid movie, with a great argument, great action\nsequences, an understandable motivation and - last but not least-a\ngreat Keanu. I can't wait for the already announced sequel!\n"},
{"review": "\nThe only thing I can say about this movie is: AWESOME The whole buildup\nas to why Wick started to kill in the first place might seem a bit\nstupid but you forget the reason soon after he started. The assassins\ncode, the hotels, the coins. Only when you watch you will get all of\nthis but I have to say, you will be amazed at the wonderful and classy\nworld they have built for the assassins. T There is not much to say\nhonestly, Im not a professional reviewer but Im very hard to please\nwhen it come to action movies, this one is beautiful but also\nactionable. You wont loose anything watching it. And when you watched\nit, for a day or so, you will think and think about the world they\nbuilt up, how amazing it would be to live in that world. The backstory\nthey hint, oh the backstory. They give you hints and tips about Johns\npast which just makes you keep wondering and wondering about everything\nand keeps you wanting a followup to this movie\n"},
{"review": "\nThis movie is the beginning of a franchise. There is so little dialogue\nin this film but the editing, set design, and acting let you know\neverything you need to know. We don't need back story, we don't need\nexposition, we know how bad ass John Wick is in every scene he's in. <br><br>Keanu Reeves shines more than any film he's ever been in. He's more bad\nass than in the Matrix, more likable than in Constantine. This is the\nrole he was born to play. Woah. He's the anti-hero we've all been\nwaiting for him to play and he does it with aplomb. He's an unabashed\nkiller and you will be rooting for him every second of the way. <br><br>John Wick is the boogeyman.\n"},
{"review": "\nI didn't know what I was going to get when I bought this on BR. Sure\nKeanu is cool, some times, and so is Mr Dafoe. But what about the rest?\nWhat about the story? This isn't a sci-fi or fantasy movie where Keanu\nseems to pick good ones.<br><br>So, what is this movie? It's a 2010s version of a 1980s revenge/action\nmovie. It gets bloody soon enough and stays that way till the end. You\nare not going to have much to \"think\" about. In fact the only thing I\nwould constantly do while watching this was smiling with satisfaction\nfor the action I was watching in a movie. <br><br>What was more impressive about it, was that at no point it felt boring,\nas many action movies do even when they have lots of...action. <br><br>Probably unnecessary warning, but, this is not for the young ones. It\ngets VERY violent and graphic, all the time. <br><br>I rarely place a movie in my favorite list, especially if it is an\naction movie, but oh my this is one good solid entertainment piece!\n"},
{"review": "\nJohn Wick is most likely the most realistic, fast paced, bloody and\ninsane action movie ever made. Despite some scenes taking you out of\nthe moment, John Wick was a good surprise with a fantastic pay off. It\nfeels so original and fresh that you instantly get into all the fast\nactions sequences and the story (unlike most in it's genre) is quite\ngreat and easy to follow.<br><br>Whilst John Wick isn't quite perfect, it adds all the ingredients for\nit to be the best action movie ever made. It almost pulls off the\nimpossible, but a few touch ups here and there would have made this\nfilm one for the ages.\n"},
{"review": "\nYep, this is a good action film, kind of simple, but good. The action\nin this film is enough to keep action movie fans happy. It didn't have\nlong boring scenes that would have you sitting around waiting for some\naction to start. It was perfectly done, much like \"Predator\" or \"The\nEqualizer\" or, better yet, \"The Matrix\". In fact, while watching this\nfilm I was reminded of the \"Matrix\" a time or two. No mystery why. The\nacting was done well too. There were a few familiar faces from the\nsmall screen(HBO) as well. All of the characters were convincing and\nbelievable. John Wick(Keanu Reeves) is an ex-hit-man who is forced to\ncome back to work to find the people who took everything from him. Like\nI said, it's simple but it's good. Now it is violent but it is fun to\nwatch and it will keep you interested.\n"},
{"review": "\nHow can this movie rate 7+ in IMDb ? I registered today for another\nreason but I also wanted to rate John Wick. Sorry Sorry Sorry this\nmovie is not good at all. Very bad acting, no good scenario, no good\nlight. Stupid Russian racism (mafia in US is mostly Jewish); So I\nconsider this movie as a gross propaganda like anti Russian Equalizer\nmovie. USA is a fascist empire \" controlled at 80% by Zionists \"\n(statement by the prime minister of Israel Bibi in 2013). Economy is\ndown because ultra liberalism has allowed the most vicious and\nunethical Jewish mafia to rule the world. Now they want people to fight\nand forget who put the world into chaos so they bring war between west\nand east, Russia and Muslims. Its the fight of bad against good. Your\nsociety will collapse because it is based on lies.\n"},
{"review": "\nA basic, straight forward, bare bones plot makes way for what may be\nthe greatest action flick in over a decade. John Wick serves as a\nbreath of fresh air for the action genre. Jam packed with slick and\nstylish gun play, judo, jiu jitsu, highly quotable dialogue, and of\ncourse the seemingly immortal Keanu Reeves himself, now age 50! The\ncinematography is beautiful. The soundtrack is killer. the action\nscenes are allowed room to breathe and unfold in a way that is always\nsatisfying and never cluttered or confusing. As previously stated, the\nstory is bland yet no one cares! The movie is just damn fun! Why should\nit need to be anything other than what it is?\n"},
{"review": "\nOn one level, a kind of cartoony action film for fans of KR.<br><br>On a deeper level, the films asks profound questions about valuable\nskills lost to society when competent people retire.<br><br>On an historical level this film may be an unintended tribute to\ndirector Michael Winner, who died the year it was in production.<br><br>This was exactly and precisely the sort of film that Winner specialized\nin, back in the glory days. Would have starred Charles Bronson (again,\nsadly, no longer with us).<br><br>Haters begone. If JCVD and Segal can keep churning out muck at a age\nwhen they should be in rocking chairs, let's give good old KR a little\nrope .. and then wait to see who he hangs with it.\n"},
{"review": "\nI was concerned this will be another dull same old same old movie.<br><br>But it wasn't.<br><br>This is a great action movie that creates a new superhero assassin. It\npulls you in emotionally and then kicks the holly out of the baddies. I\nlove it! <br><br>There is very few words spoken in the movie, but it achieves something\nincredibly entertaining. The magic of the Continental and the\nsophistication of the secret world combines with the hardcore grip of a\npure action adventure.<br><br>The director and writers should be commended for creating a masterpiece\nthat other recent superhero movies can just aspire to.\n"},
{"review": "\nI like action movies, although fight scenes usually bore me a little.\nMost scenes in this movie however, are very smooth. The men in suits\nmake things look more sophisticated, the magnificent choreography is\nalmost graceful. All in all, the fight scenes are beautiful and\nfascinating to watch.<br><br>The use of Russian is cool, gives the whole thing a rough edge. I love\nthe subtitles, they have put in so much work to get that just right!\nThe accentuated words make you 'hear' what words are stressed, even if\nyou don't speak Russian.<br><br>The music is excellent. Strong, meticulous with a rough edge. Perfect\nfor this movie.<br><br>The story is compelling, from the first second you're drawn in. I'm\nvery curious for the sequel, Chapter 2!\n"},
{"review": "\nJohn Wick did a great job of bringing back a proper action packed\nmovie! Don't be fooled; there is no storyline at all. There is just\nKeanu being awesome. I was entertained through the entire movie!<br><br>This is the best Keanu movie since the Matrix! He goes back to his\nclassic cool demeanor, and is extremely entertaining delivering his\ncheesy lines. He just kicks everyone's backside the entire time, and\ndoes it with ease. He basically takes on an entire army! <br><br>The stunts and effects crew deserves a lot of respect for this. Its a\ngreat action flick, and that can't be done without a great crew. There\nwere long, fantastically choreographed fight sequences. It is all fast\nmoving and extremely entertaining! Non stop ACTION! This is exactly\nwhat you want in an action movie like this.<br><br>John Wick was pure entertainment. Keanu was back to being Keanu, and\nthe fight sequences were awesome. Watch if you are an action lover!\n7/10\n"},
{"review": "\nJohn Wick is one of the best action movies I've come across in recent\nmemory and it's critical acclaim and pure action euphoria is what will\nmake it a classic of the genre in years to come.<br><br>The story is quite simple, John Wick a retired hit-man (Played by\naction star Keanu Reeves) used by the Russian mob soon confronts his\npast when members of the mob kill a dog his wife gave to him on her\ndeathbed. After the incident Wick goes on a rampage to kill the\ngangsters who killed the only thing he had left.<br><br>Good violent action, polished cinematography as well as believable\nacting by Reeves and others is done well. The movie also draws\ninspiration from Japanese Anime, 80s Chinese gun-fu movies, Italian\nwesterns, 1960s-1970s neo-noirs from European cinema. The world is also\nvery gritty and dark for an action film but that just makes it more\nspecial.<br><br>I recommend this to any action fan who enjoys energetic shootout scenes\nand is willing to see Reeves make a comeback\n"},
{"review": "\nThis is a great action movie. The premise is as simple as it is\neffective: John Wick loses everything, and goes on a revenge spree. The\nreason why it works so well, is that the characters and the setting are\nboth very interesting, and the action scenes are very good.<br><br>The movie is set in an almost comic book like world, where there's a\ncommunity of hit men and people in the underworld, with their own set\nof morals and code. They all use certain businesses (or services),\nwhich ties them all together. It's this universe that makes me curious\nfor sequels to John Wick. The characters in this universe are mostly\nquite fun, and a lot of that owes to great casting. The way they\ngradually reveal John Wick's past is interesting, and it leaves you\nwanting to know more about who he once was.<br><br>But, despite all the good things about the movie, it never elevates\nabove its genre.\n"},
{"review": "\nJohn Wick is the kind of action movies which will remind the action\nfilms fans of the movies in late 80s and early 90s. The action scenes\nwere paced well and entertaining. Also this movie must have definitely\ngiven relief to Keanu Reeves as he delivered a hit after long time\nespecially after the disastrous 47 Ronin. I felt that Michael Nyqvist\nas the main antagonist was cool and at the same time menacing along\nwith other secondary villains. Another best part of the movie was that\nthis film was not dragged like other action films in recent times. <br><br>I am definitely waiting for the sequel which is releasing in 2017 and\nwould hope it would develop into a better franchise. <br><br>John Wick is one such movie that should be seen without any logic and\nwould prove to be entertaining on any weekend.\n"},
{"review": "\nKeanu Reeves is the John Wick of the title, a grieving one man army who\ngets tipped over the edge when gangsters kill his dog. Carnage ensues.<br><br>The paying public do like a good revenge flick, there have been plenty\nthis last couple of decades, and they do go down well. Once the set-up\nhas been staged - Wick grieves at the loss of his loved one - gets some\nsmall joy via a pet - only to have that snatched away from him, then\nthe film becomes a joyously unstoppable actioner.<br><br>Wick, in good hands with a moody and beefy Reeves (face fuzz strange,\nthough) strong in presence, cuts a swathe through the gangland eastern\nblockers. And that's pretty much it! Characterisations are thin on the\nground, it's a bit nutty and of course preposterous, but boy is it fun.\nThere you go, a box office winning actioner without pretensions. Enjoy.\n7/10\n"},
{"review": "\nIf you ever want to get lost for a while and forget about your\nimmediate surroundings, John Wick may be the solution for you! The\nmovie is 101 minutes of non-stop action through which the bad guys get\nit in all sorts of captivating ways! There are no twists, no mind\nbenders, no smart was of taking someone out, just one straight shoot\nthem dead sequence after another! The action scene choreography is\nreally well done. Camera work is great so despite all the rapid action\nyou will not miss any details.<br><br>If you do not have the stomach for blood or violence, then skip it.\nOtherwise, get cozy and watch the Boogeyman do his thing!\n"},
{"review": "\nIf you like fast cars, squealing tires, gratuitous violence, shoot-em\nup bang-bangs and a weak plot, then this is the film for you. Don't\nwatch it with a full-stomach; the very essence of the film will make\nyou sick.<br><br>Some top notch actors, but they are miscast. What are Ian McShane and\nWilliam Devane doing in this garbage? I guess times must be tough.<br><br>A dog is killed very early in the film. The plot is very unlikely and\nis tailored for the violence.<br><br>If you are anywhere near civilized, stay away.<br><br>This is not a movie for children. It's not one for adults, either, so\nsave whatever money and time you can by not viewing it.\n"},
{"review": "\nHonor, respect and integrity, virtues sorely lacking in our current\nage. They apply to the everyman as much as they apply to a hired\nassassin.<br><br>We as men, may be considered simple in many ways. You steal my car, you\nkill my dog to boot.. this is personal and it's to the death. Yes, it\nreally is that simple.<br><br>Be that as it may, revenge is something even God himself subscribes to.<br><br>Job 5:7 - Yet man is born unto trouble, as the sparks fly upward.<br><br>....<br><br>....\n"},
{"review": "\nJohn Wick disappointed on several levels. I probably had too high\nexpectations, but the \"one-man-army/revenge\" concept has been done so\nmany times before and done much better than this. The movie is rather\nboring - no real story here, and the characters aren't very\ninteresting. The action scenes are mediocre and too much \"over the\ntop\". The whole thing just gets really tedious after a while.<br><br>The revenge concept needs to generate sympathy from the viewer, and we\nneed to be interested in seeing the revenge getting carried out. This\nmovie didn't manage to do any of that for me. I was surprised to read\nquite a bit of positive reviews of John Wick, and a metascore of 68 was\nalso surprising. I'm normally in line with at least the IMDb score, but\nthis time I can't find much in this movie that warrants more than a 4.0\nrating.\n"},
{"review": "\nThe scenes that are seen in the trailer pale in comparison with what\nthis movie has to offer, action-wise.<br><br>Keanu Reeves is once again proving that he can still be a total bad ass\nwhile also showing grief, anger, sorrow and love in the same movie. <br><br>Basically, the movie is about an ex hit-man who gets crossed by the son\nof an old Russian business partner and the story of said hit-man\ngetting back what's been taken from him...<br><br>We have a good performance delivery by Michael Nyqvist, who, even if\nbeing predictable at times, manages to get on everybody's nerves with\nhis proverbs, including Keanu's character. Nonetheless, the antagonism\nis pretty well built, in my opinion. <br><br>Don't expect too much drama, the story line is very simple and blunt,\nyet, expect plenty of hurting and.... head-shots!\n"},
{"review": "\nPeople might rave on how good action this movie shows. To me it's just\npointless. Even if i swallow the fact that Mr. Wick is doing impossible\nthings during the entire film, the story about an ex hit-man that goes\nback in business for revenge is so thin, that it could have been told\nin 10 minutes instead of two hours. All the movie shows is a thousand\nways how to kill someone, nothing else basically. Although nicely\nfilmed, it's a big pointless yawn in the end. Keanu Reeves does his\nacting job much much better in the Matrix, and The action parts there\nare much more enjoyable. Waste your time on something with brains\nbehind it. This lacks it completely.\n"},
{"review": "\nThis is a stylized action movie that the director describes as \"gunfu\"\nin the DVD extras.<br><br>The plot and story for this movie is very light and superficial, and\nfeels like it has been lifted from a comic book. There are clichéd\nRussian gansters and John Wick is the assassin with seemingly unearthly\nkilling skills. <br><br>I found the movie enjoyable, but I can see why some reviewers hate it.\nIf you are after an interesting story, this is not the movie for you.\nIf you like comic book movies and \"gunfu\" action sequences, you will\nprobably enjoy it.\n"},
{"review": "\nRecently with the Oscar fever I have been watching mostly drama or real\nlife scenario type of movies. I have been wanting to watch John wick\nfor a long while. Hence yesterday I decided I'll give it a go. I was in\nfor a super duper action treat. Mind you the action is mindless. Crazy\nshooting, he pulls a trigger people die, but people will capture him\nand only talk to him. So if you are ready for these kind of logical\nnon-sense, then this is the movie for you. Keanu Reeves seems to have\ngot it right. He looks convincing as the Superhuman, Superpowered,\nSupreme hit-man. The background score of the movie is the highlight.\nClassic stuff for action scenes. Anybody a fan of the 90's action movie\nand leave your brain in the locker and watch this movie. You'll enjoy\nit!!!\n"},
{"review": "\nVery poorly written and executed.<br><br>More importantly, the protagonist is worse than the \"bad guys\".<br><br>A huge body count over a car and a dog.<br><br>I have no sympathy for John Wick. A crazy, evil man, just like the\npeople he goes after.<br><br>The only decent character is the dead wife.<br><br>I could forgive that -- if the film had some other redeeming attribute.\nIt does not. (loved the series Dexter, and movies where the protagonist\nis an awful bad guy but there were excellent scenes of violence etc and\ninteresting characters).<br><br>I am glad I paid nothing to see this movie, but upset I wasted my free\nRedbox movie on it.\n"},
{"review": "\nOh my... Where do i start? Ridiculous script based on the cliché one\nversus entire Russian mafia, painful acting, senseless shooting scenes\none after the other... Sorry to see 2 fine actors from the excellent TV\nseries \"The Wire\" in such poor roles... Keanu Reeves plays a guy so bad\nass, that killed 3 with nothing but a pencil, but was owned in his\nhouse by the 3 stooges that beat him up, killed his dog and stole his\ncar, one of them his former bosses son which was about the only living\nperson that didn't know whom he was... Makes sense right? I gave it 2\nstars because it made me laugh, and i laughed again when i saw its\nscore here on IMDb, but i have to say that it is still a bit better\nthan \"3 days to kill\"...\n"},
{"review": "\nThis movie was a waste of my time. With movies like \"The Equalizer\" and\nthe remake of \"Oldboy\" the idea of the revenge concept is become more\nand more prominent. They have also become extremely exciting, but what\nwas the appeal of those films? The characters were interesting and made\nthe action more fun and promising over just seeing some guy beat up a\nbunch of people. John Wick was that. It as a beat em up revenge movie.\nIt was a pointless movie that dragged on. I mean really. Why do I care?\nI didn't feel a reason too. I didn't care about who John Wick was or\nwhat he wanted and the whole mythes about him. This film gave me no\nreason too. People wanna talk about Transformers: Age of Extinction.\nPfft talk about John Wick's lets just fight movie cause that is all\nthat it was.\n"},
{"review": "\nWhat a great movie, This movie is a non-stop fun roller-coaster ride. I\nlove Keanu Reeves. He is perfect in this film. This is the type of\nmovie people will see over and over again. Waited in a long line to see\nit but it was well worth it. Amazing special effects, great acting,\ngreat everything. Best movie I have seen all year. Keanu Reeves is back\nafter a long break and he is better than ever. This is like a\ncombination of Speed and the Matrix combined. Directors Leitch and\nStahelski have created a beautiful looking action picture, one that is\nlarge enough to deserve the IMAX experience.John Wick is the real deal.\nIt is a amazing action picture, filled with strong performances by a\ncast, along with superb action set-pieces and a genuinely interesting\nworld to boot. Reeves commands the screen and reminds us why he is\nstill a genuine movie star.\n"},
{"review": "\nThis movie is a absolute banger! From the top notch acting all the way\nto the simplistic but greatly executed story - this movie is amazing\nand thrilling in every sense of the word. And not just as a thriller\nbut as a film. It may be \"just\" a revenge angle but you totally get the\nmain characters motives and get behind him quickly. Everybody who wants\na great thriller that is entertaining and stylistic from beginning to\nend.. this is your movie. It's worth it for the fight scenes alone. <br><br>To say more about the look and sound of this movie: It looks\nsuspenseful and fascinating. Kinda like a comic movie. This film also\nhas a great score and some perfectly fitting songs in it like \"Killing\nStrangers\" from Marilyn Manson which fits the story very much. <br><br>So like I said, this is worth your time I think. Enjoy.\n"},
{"review": "\nI do not get tired of watching this movie...the main character has a\nskill set that is powerful and compelling. The action, gunfu, segments\nare flawless and clearly resulted from very professional choreography.\nIf you are into firearms you will want to watch this over and over. The\nsequence that featured the KelTech KSG shotgun made me go out and get\none...it is a compact, powerful and lethal weapon for home defense. The\nunderworld depicted, the Continental, the Red Circle were very\nbelievable although you know that they could not exist and I enjoyed\nseeing what dinner reservations turned into and how they used gold\ncoins as their own private currency...very creative.\n"},
{"review": "\nMy favorite movie of the year<br><br>The truth is that John Wick is just a messy third act away from being a\ncompletely perfect film but I don't think any less of this material,\nnor the intent. And that's all thanks to a group of filmmakers with the\nsimple gusto to actually make a dog revenge movie. But that just\nbecomes our waypoint into a world full of weirdo hit-man hotels,\ntactical double tap-laden action, and a populace filled with nothing\nbut goofy reverence for Keanu's pulp menace (where's he's really at his\nbest).<br><br>So yeah, this one is absolutely awesome.\n"},
{"review": "\nWow. Watching this is so satisfying. A straight to the point film from\nbeginning to end, no moment is wasted and I loved every single second\nof this film. Stylistically, the film is carried out beautifully. The\naction sequences are intense. The idea of this underground world based\nin the Continental, use specific gold coin currency, and their special\nwaste disposal service is as intriguing as John Wick the character\nhimself. What surprised me the most was also how funny the dialogues\nare when you least expects it from Viggo and John Wick. This is easily\nmy favorite action movie of all time. I wish the sequel is about Wick's\nbackstory on how he left Viggo.\n"},
{"review": "\nPretty sure this is how everyone would imagine we would react if\nsomeone messed with our dog. Oh and our wive's as well! <br><br>Okay with that being said this was an excellent movie, the best action\nI have seen Keanu do since the Matrix movies.<br><br>The story is good enough to hold your interest as well.<br><br>I rated it excellent because I had low expectations for this movie and\nthey were blown away. However, if I saw this movie in the theater I am\nnot sure my rating/review would be the same. It is one of those types\nof movies.<br><br>Enjoy then prepare for the sequel.\n"},
{"review": "\nNow, this is an action film ! From the beginning ( well, not actually\nfirst 10 minutes or so, but....) to the end is full of action,\ninteresting plots and scenes and really keeps you entertained!<br><br>I must say that I have not seen in a long time a better action movie!\nKeanu is perfect in the role! All other actors are too. The story is\ngreat. The moving of the film/plot is done perfectly. All those secret\nsociety mafia agents living by the rule are great! There is really\nnothing that you can say is bad about the movie.<br><br>The language they use...I thought it was Romanian almost entire film.\nBut when they mentioned the Russian church, I figured out it must be\nRussian.<br><br>Loved the ending of the film. Most of the films have some kind of a bad\nending and that can ruin all, but this one is perfect!<br><br>My favorite part/scene: when those 'cleaners' come to his house after\nthe first shooting and wrap those dead bodies like mummies ! Man, that\nwas something!<br><br>Nine from me. Don't know exactly why it is not ten, but 9.50 would be\nmore exact.\n"},
{"review": "\nIs there some sort of rule in Hollywood the once you hit 50+ you join\nthe hit-man club? because if there is i have no complaints if they keep\ndishing out movies like these.<br><br>As you know......Keanu Reeves loses his wife and she gives him a dog so\nhe doesn't cope mourning alone, gangsters rob him and kill his dog and\nall hell break's loose! The body count and blood in this movie is\nridiculous.<br><br>Max Payne is what John Wick should of been.....but Keanu Reeves and co\nhave simply made it better, the action and the booming soundtrack is\nfantastic!. Say what you want about Keanu Reeves being wooden but i've\nalways enjoyed his movies....this is more of a resurgence for him as it\nwas for Liam Neeson in Taken.<br><br>Overall Score 8/10\n"},
{"review": "\nKeanu Reeves is an outstanding actor in this movie and i have always\nloved his acting he really is a talented person and i must say this\nmovie is a must watch to everyone out there with an interesting story\ntitle. how he misses his wife after she dies and how he receives a pet\npuppy dog as a present from his dead wife is a really interesting\nstoryline and when the Gang of thugs of a known businessman's son comes\nand takes everything from him. it is the time to unleash the beast in\nhim and for them to pay the price for the damage they did. the\ndirectory and the person who did write the script did a great job. hard\nto find such meaningful movies these days when all these fantasy movies\ncomes out.Great Movie. No more words to describe it.\n"},
{"review": "\nOkay so I finally took the chance in watching John Wick even after all\nof the negative reviews that are everywhere, good thing is those\nnegative reviews are BS. Only thing I can agree with in the negative\nreviews is that Keanu Reeves is not the best actor for this genre but\nhe did do a fair job. Keanu done well in the Matrix but as for action\nfilms he just doesn't fit that part especially a film like John Wick\nwhere he is the top assassin.<br><br>So after watching the film I see it is exactly what anyone would expect\nto see, the story was good and the acting was fair. The film style and\nthe graphics were great, this is a fairly put together film. John Wick\nsheds light for many with the \"what would you do in such a situation\"?\nCheck the film out and stop listening to those BS reviews out there,\nmost of those bad and good reviews are Bought Reviews.\n"},
{"review": "\nFirst, I hesitated to buy the DVD John Wick cause of the so many bloody\nbullets fallen in this thriller. So you are warned. Then, when I read\nthe reviews here I thought to give it a chance. Also my friends who\nwatched it recommended to check it out. In fact I don't regret. It's a\nclear revenge story à la Rambo. I was never bored. The pace is fast and\nthe film has been cut to a perfect running time of 97 minutes. Keanu\nReeves looked cool and credibly in the real fight scenes. <br><br>With John Wick he succeeded no doubt in an unexpected comeback. I hope\nto see him soon in a sequel.<br><br>7/10\n"},
{"review": "\nAfter all these years, though, he's still quintessentially Keanu. He\nradiates a Zen-like calm which makes him simultaneously elusive and\nirresistible, especially in the face of great mayhem. There's still a\nboyish quality to his face but it belies the wisdom of his years. He's\nsmarter than he looks but he's in no great hurry to go out of his way\nto prove it to you\u0096at least, not on screen.<br><br>A character like John Wick is right because it allows him to be coolly,\nalmost mythically confident, yet deliver an amusing, deadpan one-liner\nwith detached precision. But when the time comes\u0096and it comes often in\n\"John Wick\"\u0096he can deliver with a graceful yet powerful physicality.\n"},
{"review": "\nJohn wick is a 21st century gift to viewers who were tired of seeing\naction movies with poor story, shallow plot &amp; CGI. John wick is a grand\npiece of action which has bullets ( like lot of bullets), great dialog,\ncool 80's reference &amp; few funny moments which are missing in today's\naction movies. keanu reeves look was amazing &amp; the fight choreography\nreminds me of movies like collateral &amp; the even the influence of\nmartial art movies are quite visible. The villein is quite strong great\ndialog, good sets &amp; different languages. <br><br>For all the movie action gun battle lovers, John wick is a great piece\nof action which would surly take your adrenaline level to the top.<br><br>P.S- If a John wick prequel is made, it would be great to see how &amp; why\njohn wick is so bad ass. <br><br>5 star for this amazing movie.\n"},
{"review": "\nAs mentioned by many, and as may have been guessed by reading the short\ndescription, the conflict in the movie is very one dimensional.<br><br>You do, however, get a subtle glimpse into a complex world left behind,\nand surprisingly convincing action scenes (well, the whole movie was\nreally just one action scene).<br><br>You can count the bullets fired, and he runs out of bullets as you\nwould expect. He doesn't have super-human abilities, he does well, but\nnot magically. His minor character development presents a person who\nyou would believe could be real and who would respond the way he does\nin the film - though you don't really get to fully understand that\nuntil later.<br><br>Best part (for me) is that consequences of actions are shown. I can't\nreally explain that more without adding spoilers... so I won't, but by\nthe end of the film it should make sense.<br><br>Also, you can see a camera man or stage hand in one of the many many\nmany many fight scenes - which is always a bonus.\n"},
{"review": "\nUncreative, amateurish plot with terrible acting (like most Keanu\nReeve's films). Ridiculous \"shoot-em-up\" action throughout with no\nredeeming moments. I gave up after Reeves had slaughtered his 153rd\nvictim with little more than a few scratches in return. One of Willem\nDafoe's poorest performances and typical of Keanu's high-school acting.\nEven one of my favorite actresses, Bridget Moynahan drowned in the\nmurky waters of this garbage film. The musical score sounded like it\nwas produced by a bad garage-group of teenagers. The cinematography\nsucked and it took an uncommon staying-power and determination to sit\nthrough it 'til the end. This flick is a total waste of time and anyone\nwho gives it more than a 2 has been smoking bad weed.\n"},
{"review": "\nWow! This is one of the worst action movies of all times and I can't\nbelieve it has 7.2 rating as I write. Where do I even begin? <br><br>- No character development. - Awful script, you won't even remember one\nline after the movie. - Sloppy acting, no one in the movie is good. -\nNo story. - Poor ending. - Environment, screenplay and visuals are also\nnot that good. - Action sequences are barely tolerable.<br><br>At the end, I would like to ask those who like this movie: what is\nwrong with you people? Have you not watched any half-decent movie\nrecently? And to those aspiring to watch this movie, I won't say don't\nwatch it. I'd say watch it and come back to IMDb and rate this movie -\nas a service to mankind.\n"},
{"review": "\nwhen I watched john wick trailer I thought the movie will be awesome as\nI was blown by it so I wanted the movie to be good and when I watched\nit I was blown by the movie too!!! The acting and action done by reaves\nwas just quite awesome he looks working hard for this movie and he\nreally did it despite he is fifty years old he has done superb action\nhe looked a real bad ass assassin and he has set a new benchmark in\naction by doing gun-fu.....<br><br>And the other supporting cast were also good at their places and this\nfilm also tells us one thing never mess with a dog otherwise you will\nbe killed and all.....<br><br>overall the film was awesome and a must watch for action lovers and\nalso those who love brutal action like me.... the film is a good treat\nfor us.<br><br>I heard about its sequel is in works definitely going to that one.....\n"},
{"review": "\nI'm a big fan of action movies and especially Keanu Reeves. He often\ngets crap over his acting skills (or lack thereof). I think hes well\nsuited to action movies, where a lot of the time story is told through\nthe action sequences and a bit more nuanced. <br><br>It's hard to find fault with this movie, and I've seen it at least 3-4\ntimes. All the actors supporting or main do a great job. There is a lot\nof action in this movie, and the movie does start out a bit slow, but\nthen picks up very quickly. <br><br>The action, gun fu and stunts are awesome, some of the best I've seen\nin a long time. You can tell they really practiced and tweaked the\nstunts a lot. <br><br>There are often long action segments with a brief intermission of\nstory, which is how I like most of my movies. <br><br>The soundtrack is amazing as well, with Marilyn Manson contributing to\nthe main theme of the movie and the composer for the movie doing a\ngreat job. <br><br>I would have liked to see William Dafoe's character expanded on some\nmore but that may come in the second movie (in flashback sequences).\n"},
{"review": "\nThe Good: This movie is non-stop action! The storyline is explained\nwithin the first twenty minutes of the movie, the rest of it just\nunfolds into nonstop action. You will find yourself rooting and\ncheering for John Wick (Keanu Reeves) to kick more butt. It is finally\nso good to see Mr. Reeves doing his thing once again. He is a superb\nactor and certainly delivers in this action film.<br><br>The Bad (this comment is a spoiler): The only bad thing I have to say\nabout this film is the scenes involving his dog dying, although this\nwas an important factor in his unresolved grief.<br><br>The Ugly: The movie has a lot of violent scenes so if you are unable to\nwatch movies with a lot of killing and bloodshed, then this movie is\nnot for you. The other action scenes cover primarily a mixture of\nmartial arts, fist fights, and a few car chases.<br><br>Overall, I rated this movie a 10 for nonstop action, great acting, and\nfor the love of seeing Keanu Reeves in a great movie once again.\n"},
{"review": "\nKeanu Reeves plays the Liam Neeson role in this slick, sharp, vicious\nlittle bout of revenge fantasy. With support work from a whole mess of\n\"I know that guys\" and a blow-away effects budget, it's a real riot to\nwatch, not to mention one hell of a tech demo for the masterminds\nbehind the fight scenes. Like those Neeson kill-em-alls, though, it's\nas straight as an arrow and shallower than the kiddie pool. In some\nways, it's refreshing to just dispense with all the stereotypical\norigin trappings and get right into the firefights, but at the end of\nthe show it just feels like one long, easy excuse to watch a whole mess\nof cool stuff without any extra justification. Lust-worthy cars,\nferocious weaponry, powerful western-styled physicality,\nstereo-thumping tunes, magnificent cityscapes, the list just goes on\nand on. Escapists delight, for John Wick has come to deliver a dream.\nCinephiles, well\u0085 just sit back and try to let the sheer, celebratory\nbrutality beat your conscience into submission. It won't be too\ndifficult.\n"},
{"review": "\nMuch has been said of late about the rather sorry state of the modern\naction film, and apparently the makers of 'John Wick' were paying close\nattention.<br><br>Eschewing elaborate car chases, shaky-cam action sequences and\nCuisinart editing in favor kinetic but not overly elaborate fight\nscenes, 'John Wick' is the blueprint for how to deliver white knuckle\nthrills without all the phony bologna.<br><br>Also working in its favor is a simple, straightforward plot that's\nsupplemented with some really nice world building. The cast, lead by\nthe ever underrated Keanu Reeves, is exceptional, and really help to\nlift the material to another level.<br><br>'John Wick' may not be art, but it doesn't aspire to be. Like its title\ncharacter, its aim is true. If you're in the mood for action, he's the\nman for the job.\n"},
{"review": "\nWell this isn't Reeve's worst film. It's probably somewhere in the\nmiddle. It reminds me a lot of those mindless 80s action films that\nwere led by Silvester Stallone, Arnold Schwarzenegger and Chuck Norris.<br><br>The plot is simple. No problem. This is an action film and there's\nplenty of it. Think 80s action films but with more gore and intensity.\nIt all looks pretty too. <br><br>This is supposed to be a fun movie. I get it. But it would've been nice\nto see more realistic gun fights that showed John Wick's using his\nentire repertoire of skills to take out dozens of armed gunmen instead\nof just showing his incredible quickness and ridiculous gun shooting\naccuracy. <br><br>I'm not sure how this film got rated above a 7. The film looks pretty\nbut the script is awful and the characters are uninteresting. If you\nwant to watch an action film that's been recently released and are\nsimilar to this I suggest watching either Shooter or Olympus Has\nFallen. These films are just as violent but are more interesting to\nwatch.\n"},
{"review": "\nI bet it would be a great movie but unfortunately I pressed stop after\na couple of minutes. The first scene was about John Wick who loses his\nwife and he is sad and angry. Second scene his dead wife sends him a\npresent which was a puppy for him to take care and love (how sweet and\nsad). Third scene some creepy guys break into his home cause earlier\nthey wanted to buy his car but John did not sale it to them. So because\nthe movie wasn't so tragic and dramatic all ready you probably thought\nthat something was missing. What about killing the puppy? Of course you\nkilled the puppy and you made the movie worth watching now (or not). To\nsum up, a wife dies, he is depressed, violent guys want to kill him for\nhis car and because there is not enough drama already they kill the\npuppy. What a start! I wonder if after that John Wick becomes Hit Man\nand tries to get revenge for his puppy's death driving his car!! Thank\nyou and sorry\n"},
{"review": "\nhad high hopes for this film after seeing good reviews,but it was\nreally bad. After the first ten minutes it turned into a video game\nwith all the bad guys getting shot so easily .Keanu Reeves just grunts\nthe whole way through with most of the other characters acting as if\nthey are from another planet. Maybe next time ill scroll down the page\nto read a few more reviews rather than the headline rating.The penny\ndropped when the credits started to roll and i saw that most of the\ndirection and producers were from Russia so it was made for the Russian\nmarket . Has there ever been a good Russian film. Please don't tell me\nthere is a John Wick 2.\n"},
{"review": "\nThe film is so contrived. You know what's going to happen from the off.\nCharacter development and everything is so basic it's laughable. You\ncould have got a film student to write and direct the entire thing. I'm\nflabbergasted that people actually think this is a great film. What's\nso unique about it that no other film has got. The acting is wooden,\nthe scenes unbelievable and this just a payday for those involved.\nTrust me, you've seen it all before. If you're willing to put all\ncommon sense behind you and take everything at face value then perhaps\nthis film is for you. Oh my god, it's just finishing as I write, and I\ncan't believe the final scene! Now I know this film was rated by kids\nfor kids.\n"},
{"review": "\nIt was one of the most boring action movies that I have ever watched.<br><br>The movie does not have any solid storyline. Why on earth a movie\nwithout solid storyline go to production is beyond me!<br><br>Also the action scenes is not looking like a real action scene. I am\nnot going to spoil the movie for you but the idea that you go kill\nwhole bunch of people because they beat you and killed your dog, seems\ntoo far fetched. <br><br>I am not suggesting there is no one like that with that amount of rage\nand anger but to go on a rampage like what the actor was portraying, is\nhighly unlikely.\n"},
{"review": "\nKeanu Reeves is back. Well it's not like he was gone (though you could\nargue his character was in this one, before being forced to be \"back\"),\nbut this might be his best movie in years. Certainly one he is starring\nin. And I don't mean any disrespect against 47 Ronin (which could've\nbeen a lot better and I'm not talking about the poor CGI at places, but\nin general).<br><br>Wick is kind of an Equalizer, but different. While Denzel is clearly\nthe better actor, this evens everything up with a choreography that\nreally gives you everything it got. Gunkata is a term you might have\nheard a couple of years ago. It's here again and it's no wonder that\nthe two directors have a good relationship with Keanu (since working\nwith him before a couple of times).<br><br>Great \"guest\" appearances and really good cinematography. This looks\ngreat and it has a lot of violence in it. If you're down with that, go\nahead and watch and prepare yourself for the inevitable sequel/prequel\nor whatever comes our way\n"},
{"review": "\nIt has been a long time since I've seen an action/revenge movie as\nenjoyable as John Wick, and those who know me well are aware of just\nhow much I love a good revenge story. It looked like it might be fun to\nwatch, but I had no idea how much I was going to like it...this was\neasily one of the most epic collections of choreographed violent\nepisodes I have seen. Being a dog lover, and an owner of a beagle since\nshe was a little puppy, that only made it all that much better to watch\nsomeone exact the most out of proportion vengeance for the loss of a\ndog. This isn't something you'd want to watch if you're looking for\nsomething intellectually stimulating, but it is something I would\nrecommend anyhow.\n"},
{"review": "\nKeanu Reeves isn't the guy that seems suited for your usual revenge\nflick, but he works fairy well for \"John Wick\". There's an inherent\ndetachment to Reeves for a good portion of the film, but he's also got\nthat quiet brooding that roils beneath the surface.<br><br>Probably the best thing about this movie are the action scenes, which\naren't cut to shreds. They're well-staged and have a nice fluid\nbrutality to them. Simple but effective.<br><br>What was also really nice was the clearly defined (under)world with its\ncoded language, currency ad protocols. It harked back to \"Payback\" and\nthe mob-as-corporate-culture. Also, Wick had modern dress and domestic\nappointments (probably due to his departed wife), but he's using an old\ntouchtone phone and getting around in circa '79s cars. Little touches\nthat add character.<br><br>It's great news that they're planning a sequel. They've already built\nthe world, and I'm in for more.\n"},
{"review": "\nKeanu Reaves is back and this movie its a movie exactly for Keanu\nReaves. Don't expect to see an amazing story or a great photography...\nthis is an action movie quite interested and one or two points above\nthe usual action movies. Its sad, then its funny, then its thrill, and\nlots of action from the beginning to the end. The fights are very well\nconceived, we all know Keanu Reaves skills on martial arts and the\nacting is quite good on almost all the participants. John Wick is a\nretired contract killer passing for a moment of griving, the problem is\nthat a group of Russian's didn't let him griving on his own, and give\nhim a path back to his formal live.<br><br>Finally we know who killed the boogie man. And this create a lot of\nreactions during the movie which is very funny.<br><br>You wont be disappointed with this movie.\n"},
{"review": "\nThis is a sly, swift and stylish action movie that is actually a decent\npopcorn flick. Sure the plot isn't anything grand, but that isn't the\ncore of this movie. A movie such as this needs a spark and how to go\nabout it from there on. It isn't as adrenaline filled entertainment\nlike \"The Raid\" or has a super well blended and enticing story mixed\nwith action like \"The Raid 2\" but it'st still a pretty cool movie. And\nseeing Keanu Reeves kicking ass and taking names is just the bonus.\nLike I said the plot doesn't have anything that really stands out, but\nthe stylish cinematography, choreography with enough cool action\nelements make this one worth at least one watch. Especially if you like\naction movies. However I could see why some audiences would not like\nthis movie and why some people just wouldn't. You could really tell the\ndirectors got their ideas from past action movies, anime and video\ngames. \"Max Payne 3\" really came to mind while watching this.<br><br>7.5/10\n"},
{"review": "\nThe theft of his car and the killing of his dog provide the motivation\nfor an orgy of shootings and beatings. There's even a fight scene with\na hit-woman, so that misogynists can get their jollies. Keanu Reeves\nobviously has bills - or alimony - to pay, which could explain his\nappearance in this schlock. Did Jason Statham and Nicholas Cage turn it\ndown? Willem Dafoe, presumably also in need of a boost to his pension,\nhas an inexplicable supporting role, and Ian McShane makes an\nappearance so brief it can't have paid much more than Extra work.<br><br>The film is shot with pace and style, but the mayhem is endless,\npointless, mindless. I normally avoid movies as bad as this; I should\nhave avoided JOHN WICK.\n"},
{"review": "\nI wish I had the cash and the opportunity to see this one when it was\nin the theater over the summer because this movie was just entertaining\nas hell! <br><br>I have no complaints about \"John Wick\" because it is one of those\nperfect summer blockbuster flashy action flicks! Keanu Reeves is\nawesome as Wick and leads a cast of very talented people to play\ninteresting and fun characters in a story that is simple but extremely\neffective. Add in the exciting action and fight scenes and this movie\nwas awesome from beginning to end and just oozes adrenaline. It's a\ncrime if we don't see more John Wick and this film doesn't spawn\nsequels.\n"},
{"review": "\nFans of Keanu Reeves, rejoice. He actually cries in this movie. Yes,\nthe man is able to show some sort of half-a...d personality in this\nfilm that people just EAT UP. You want a review? Here's a review: this\nis one of the most pathetically cheesy Hollywood films ever made, and\nto top it off, it's all the more reasons for the average low-intellect\nAmerican to absorb the watered down caricature version of \"New Russia.\"\nAs a native Russian speaker, I couldn't even understand any of their\nfake, senseless babbling that they call \"Russian.\" It's all the tacky,\npredictable bull... Hollywood junkies crave. It's all the fighting,\nshooting, fancy cars, explosions and blood, and minimal plot line that\nan anti-intellectual could ever ask to see. Take everything typical and\ncombine it all into one lame Hollywood failure. I can't believe I\nlasted 3/4th of this retarded movie. And it miraculously won awards?\nWow! Дребедень!\n"},
{"review": "\nI hate movies which include dogs, because somewhere along the line that\ndog is going to get killed.<br><br>I guess I'm a sensitive man, but at the beginning of this movie when\nour hero receives a present of a little spaniel dog from his wife who\nhad died of cancer, this film took on heart, but it was all short\nlived, because the dog got killed by thugs who beat up our hero John\nWick and then you hear the dog yelp and then you see the dog from it's\nback, lying dead by John Wick when he wakes up from his beating.<br><br>John Wick the character has heart, he cries at his wife's grave side, I\nlost my own wife to cancer in September last year 2014, so I could\nempathize with the character.<br><br>All in all this was a very good movie with excellently rehearsed fight\nscenes, very cleverly directed. But getting passed the doggy being\nkilled, kind of spoiled it for me.\n"},
{"review": "\nWhen I first heard the movie title I was thinking this movie was going\nto be awful, boy was I wrong! John wick is on of the best action films\nI seen in years. It starts off very touching and you feel a lot of\nsympathy for Mr.Wick, then he turns up the volume until the speakers\npop!!! Keanu Reeves is at his prime in this movie. It makes me wonder\nwhere he's been. So glad he came back in a movie like this one. Don't\nlet people trick you into the thinking this is the Keanu from the\nmatrix, cause it's not! This is the keanu reeves you've been craving to\nsee. This is one man you don't want to mess with, and someone u want on\nyour side. Hope to see more from him. But I really think it's going to\nbe hard to put up another performance like this one. Great movie and it\ndefinitely belongs in your movie collection!! Two thumbs way up!!!\n"},
{"review": "\nKeanu Reeves is absolutely solid, as is everyone else. The action\nscenes are among the best I've ever seen. Stylised, but realistic. John\nWick, the character, is insanely good and insanely tough, but not in an\neffortless way. That makes it seem more real.<br><br>The grittiness of the action scenes also adds to them.<br><br>Choreography is brilliant, cinematography is beautiful. These action\nscenes have a clear \"flow\", i.e. don't degenerate into a collection of\nfast moving extreme close-ups. The storytelling may be simple, but\nextremely well done in a visual way. All exposition scenes are visual\nand most contain little or no dialogue. <br><br>So I liked this one!\n"},
{"review": "\nJohn Wick is easily Keanu''s best film since the original (and only\ngood film in the franchise) matrix. The action slowly builds along with\nthe tension as Wick seeks revenge for the murder of his dog and the\ntheft of his beloved car (great scene in the garage when the thieves\nturn up with Wicks' stolen car and Leguizamo realises who's car it is\nand what is coming next). The bad guys get no sympathy as carnage\nensues and Reeves is great as the relentlessly cold killer. This film\nis the taken sequel that has never happened! Nyqvist gets to play a\nheartless bad guy and mafioso style boss who's son is the primary goal\nof Wick's revenge. I disagree with those who say there is no story to\nthis film (some of the same people liked speed which is, and always has\nbeen, simply awful!) and I think the characters are reasonably well\nthought out and the acting good for a film of this genre. Overall, a\nvery entertaining action thriller.\n"},
{"review": "\nHaven't seen a nice action movie of Keanu Reeves since the Matrix. I\nenjoyed every minute of it!Sure the plot seems a lot like a classic\ncase of \"ex super ultra assassin being a one man army\" but it is well\nstructured and never leaves you bored. The atmosphere is good and gives\nthe feeling of a city that is governed by a crime syndicate. Acting is\nquite good compared to other recent action movies I saw lately. I hope\nKeanu Reeves continues to star in more good movies because he was quite\nunseen during the last decade or so with very few exceptions. At first\nI was sceptical about the rating I saw but after watching the movie I\nthink it deserves it!\n"},
{"review": "\nSo the whole idea of justice and epitome of first-world problems goes\nto the fantastic plot of invincible Kiwi Reeves who starts going all\ncrazy killing everyone in the world over a car which he gets replaced\nfor free and a dog he didn't really like and had around for two days.\nDespite the fact that the dog was a gift from his freshly dead wife, he\nchucked some blankets on the floor and took it off the bed. The same\nman who had no feelings over the dog had no feelings expressed when his\nbest buddy got killed. Are viewers supposed to root for such a spoiled\nrich boy. Are viewers supposed to believe that a hit-man incapable of\nloving can all of a sudden switch to his cell phone video of his wife\nand think about her from time to time? Kiwi's character is full of\ncontradictions like the movie for a 5 year old.\n"}
]