[
{"review": "\nI thoroughly enjoyed Chappie. I usually don't write reviews, but after\nseeing the brutal rating this movie is getting I felt compelled to\nwrite this review.<br><br>Chappie is a funny, entertaining, and surprisingly sentimental movie\nabout a sentient robot being raised by gangsters in Johannesburg. Most\nof the criticisms I've seen about one- dimensional characters and\nillogical character choices are valid, but Chappie's character, the\nCGI, the humor, and the overall aesthetic of the movie more than make\nup for these shortcomings.<br><br>Please go see this movie and make up your own mind. I almost didn't go\nlast night because of the negative reviews, but I'm so happy I did. I'm\nvery excited to see this movie again. You leave this movie feeling like\nyou've become friends with Chappie, and I hope the bad reviews don't\nprevent the sequels from being made.<br><br>If you like Neill Blomkamp's directing and style you will love this\nmovie.\n"},
{"review": "\nDon't let the critics who can't seem to get past comparing Chappie with\nother sci-fi titles put you off of going to see this film. <br><br>This story is about a lot more than just robot police officers it is a\nthought provoking social commentary on many modern day issues and what\nit is like to bring life into the modern world.<br><br>I very much enjoyed District 9 but I would even go as far to say I\nenjoyed Chappie much, much more.<br><br>There were so many aspects to this film that could have went wrong but\nhave been nailed on the head by the director. The effect once again\nvisually striking and a very well paced and intricate development of\ncharacters as well as interesting set design helps keep chappie fresh\nand not just another reboot of any other sci fi film as critics will\nhave you believe.<br><br>I would also say I enjoyed this film much, much more than the likes of\nrobo-cop.\n"},
{"review": "\nThis is not just an excellent and entertaining movie, i found many\nelements as real/istic and present, it is just touched some (maybe)\nfuture elements. Neil pulled the maximum out of this story and made it\nunforgettable as District 9 was.<br><br>How ever, my stomach turns upside down when i see the Metacritic or\nRotten Tomatoes score, these pathetic sites and their brainless people\n(called themselves \"critics\") live amongst us with their nonsense and\nempty headed, braintumored criticism - sure, this movie has no Beverly\nHills and it's \"amazing\" crowd, no lemonade punch as story, no muscle\ncars and no muscle people, no worldwide threat to the USA and such. It\nhas something else to say and this is the core of this amazing movie.<br><br>Afterall, Chappie has Everything that needs for a unique and must-see\nmovie, sure, it is a target for all those (disgusting) critics who\nexpect the everyday boring lemonade with everyday boring actors and\nactress.<br><br>Shame on Metacritic and Rotten Tomatoes, you guys are not more, than\njust rotten and brainless second level scribblers.\n"},
{"review": "\nWhy all the hate for this movie? I understand not liking something, but\neveryone seems to just TRASH it. Did I see the same movie? I saw an\nemotional film about innocence and loss. I REALLY don't understand.\nSure, maybe the film didn't have the best dialogue or the best acting\nin the world, but it hit home for me. The VFX were phenomenal, Chappie\nis the best CGI motion capture I have seen in a long time, the 100%\nelectronic musical score by Hans Zimmer was really unique and fresh,\nand it has a really great ending. I DON'T UNDERSTAND. If you like\nBlomkamp's previous films or are remotely interested, please watch it\nyourself. I think the critics are wrong on this one. I have been\nthinking for a while about why the reviews are so out there. First off,\nthe trailers are AWFUL. The first to come out was this philosophical\n\"What does it mean to be human?\" kinda movie. The TV trailers were\n\"GUNS, EXPLOSIONS, ROBOTS!!!\" and it is neither. Think \"Little Miss\nSunshine\" with a robot, that is a more accurate representation.\nBlomkamp's most underrated film.\n"},
{"review": "\nThis is a great movie definitely in the style of Niell Blomkamp.\nHowever, some people might consider this a fault, as Elysium was a\nlittle off the mark. What is great about the movie is its style. They\nreally went all out with Yolandi and Ninja (the main characters part of\nthe musical group Die Antwoord). Hugh Jackman is pretty hilarious as a\nbloodthirsty war vet, selling his role pretty well. The technology in\nthis movie is fantastic, as usual coming from Blomkamp, leaving plenty\nof ideas for the imagination to wonder about for the future. Of course,\nChappie really makes this movie; taking something so technical and\nrobotic, making it human in action. He really gets the feels going. I\nhaven't laughed like that in a movie theater in a long time. Add to\nthat the oddness of the characters influencing the development of\nChappie, this movie is gangster. <br><br>Still, 9/10, super great movie.\n"},
{"review": "\nI liked District 9 and Elysium, so I was really looking forward to\nChappie, especially for the special effects that I'd seen in those\nprevious films. I felt like Chappie needed to be at least another hour\nlonger to convey the director's message properly. There are way too\nmany holes in the story to lead to such a thought-provoking ending.\nI'll say there was sufficient delivery on the special effects, but the\nstory was not extensive enough. One - there's no explanation as to why\n\"Ninja\" and his mates owe some master criminal millions of dollars; two\n- one minute Chappie's being bullied by thugs and the next we're to\nexpect they're loving foster parents; and three - why would\ntransferring one's \"consciousness\" to another being also carry their\nvoice and accent over? I expect a movie to suspend my beliefs for a\ncouple of hours, but a story that flows well makes for $ better spent.\n"},
{"review": "\nI went into Chappie as a huge fan of the gritty action and social\ncommentary of District 9. I expected that this would be more of the\nsame. Both are still present, but surprisingly, with laughs.<br><br>This is one of the more entertaining movies from every angle that I've\nseen in awhile. I described it as I left as funny, sad, uplifting,\ndark, light, silly, and tense.<br><br>The center of the story is Chappie. He is a hero you want to shelter,\neven though you want him to learn. But even as you love his curiosity,\nyou fear his naiveté. He is the most complex character, and gives a\nfascinating paradigm into how children must receive and process human\nsociety and contradiction. There are some inconsistencies in Chappie's\ncharacter (is he already programmed to raise his voice if he's scared,\nor did he learn that?), but he still succeeds as a dynamic, independent\nbeing.<br><br>Yes, the humans characters are flat. They are merely roles. The Maker.\nThe Villain. Mommy and Daddy. The friend. But as Chappie begins to\nlearn, you see why they have to be flat. They are trying to exert\ninfluence on a (robotic) child. Therefore, they must simplify their own\nmotivations and desires into the most basic explanations possible for\nChappie to understand. This leads to hilarious imitation and\nthought-provoking perspectives.<br><br>Chappie's curiosity was once ours. Chappie's confusion was once ours.\nWatching Chappie is like watching a sped-up version of childhood social\nand moral development, with all of the Hollywood tension, explosions,\nand naughty words to keep you interested, too. There are parts to laugh\nat because it's funny, parts to laugh at because the costuming and set\ndesign is ridiculous, but you still end up thinking seriously the whole\ntime.<br><br>Give it a chance. You might love it. I did.\n"},
{"review": "\nChappie is exuberant, playful, funny and perhaps one of the most human\ncharacters to grace the screen in years. He's an unwilling action hero\nthat one can both identify with and admire. His story is gripping and\nwill keep you on the edge of your seat. Unfortunately some of Chappie's\nbrilliance comes at the expense of the world around him. Plot holes and\nlogical fallacies abound, and although some of it can be written off to\nthe imperfection of humanity (a central theme in the movie) there are\nenough \"Wait, why the would he/she/they do X.\"\" moments to be a\nsignificant distraction.<br><br>Many reviewers have complained that Chappie Cliché. In an era where the\nmajority of box office darlings with &gt;8 star reviews are remakes,\nreboots or result of the Disney/Pixar/Marvel equation the majority of\nthose reviewers are clearly either hypocrites or they don't know what\ncliché means. Chappie is soaked in the Blomkamp style and while that\nstyle was new and fresh with District 9, its unreasonable to expect a\ndirector's primary product to be novelty.<br><br>Overall it's a good movie, certainly more interesting than most of the\nbox-office-safe fare out that's been out there.\n"},
{"review": "\nThe big problem with this movie is that none of the characters are\nlikable. Chappie's \"family\" is made up of criminals who raise him to be\na \"gangsta\" / \"pimp\" complete with bling. I don't know if this was\nsupposed to come off as heartwarming, but it's just stupid and corny as\nhell. I kept hoping they would die the entire movie.<br><br>Chappie himself is like an annoying little kid who does stupid things\nand lacks common sense. The worst part is the accent. I don't know if\nthat's how real South Africans talk, but it just did not fit a robot at\nall and was really obnoxious to listen to. It was like the movie tried\ntoo hard to be cool.<br><br>Combine all this with a plot that is nonsense. For example:<br><br>Chappie's maker is like the next Steve Jobs, yet he works in a cubicle\nin what resembles a run down warehouse.<br><br>The computers look like they came from the 80's, complete with DOS.\nSeriously? Did South Africa not get Windows?<br><br>The gangsters let Chappie's maker go free repeatedly for no apparent\nreason when he could obviously have gone to the police at any point.\nAre these the dumbest criminals in the world?<br><br>These are just a few examples of the idiotic script.<br><br>Another thing is people keep mentioning how great the director is. I\nhonestly don't care what he directed in the past. This movie sucks.\n"},
{"review": "\nI don't usually write reviews on here, but I have to get this off my\nchest. This is more of a warning than a review.<br><br>I saw the high rating on IMDb and gave this movie a shot. The trailer\nlooked decent and reminded me of good action scenes in District 9. I\nwanted to leave while watching the movie so many times. I kept waiting\nfor it to get better, but it never did... I had my hopes up when the\nthugs were teaching Chappie how to stab people that he'd stab them, I'd\nhave a laugh, and we'd move on to some other characters and a better\nmovie! But I was let down on that one. The movie doesn't go anywhere.\nYou just hang out with the obnoxious Die Antwoord members the whole\ntime. Others have mentioned the movie being like Short Circuit and\nRobocop, but the movie even adds a flare of Transcendence towards the\nend -- Chappie figures out how to transfer consciousness to save his\nmaker, himself and even \"mommy.\" Ninja keeps going on about a heist he\nwants Chappie to help him with the whole movie. The heist was my ticket\nprice and 2 hours. I felt frustrated and let down after watching this\nmovie. I don't get how other people seem to like it? Must be Die\nAntwoord fans. I wish I never saw the film.\n"},
{"review": "\nThe trailer of the movie talks about the black sheep, that is being\ndifferent, So I would say this one was the black sheep in the world of\nsci-fi movies.<br><br>The story of a robot, which is being depicted in unbiased manner( not\nrobot-as-a-monster or robot-as-an-angel movie) is quiet refreshing. The\nrobot Chappie not just marvels you but make you emotional at times. So\nbe prepared to get your eyes drenched at times. I think these are some\nof those moments when you feel this is not a sci-fi or action\nstereotype, but that is what makes it wonderful.<br><br>Action cuts are great(very less of them), actor have done wonderful job\n(especially the lady who acts as Chappies \"mommie\")<br><br>Loved it.<br><br>P.S. Don't do on critic reviews, I have no idea why this movie is\nbashed so much\n"},
{"review": "\nI found the movie highly entertaining and thought-provoking, funny and\ndistressing at the same time.<br><br>Couldn't help but think about how true this story is: your child\nassociates with the \"wrong crowd\" and no matter how much you try, what\nyou say, s/he is going down a bad path. All you can hope for is that\nthey'll find their real self before it's too late...<br><br>I usually don't like violent movies, or films about gangsters,\ndruggies, and such. This has all these components in it - however, it\nwas very clear to me, that I would never, ever want to live in a world\nas depicted there. (Not like most other movies with these topics, where\nthat attitude towards life is idolized and glorified...)<br><br>Never mind what the critics say, watch it yourself - what have you got\nto loose? 2 hours of your life. I think, these 2 hours will be much\nbetter spent there, than watching any mainstream TV...\n"},
{"review": "\nJohannesburg Police are using robots called scouts, supplied by\nTetravaal Corporation. Software engineer Deon develops a self-aware\nartificial intelligence which he smuggles into a defunct robot. This\nchildlike \u0096 but learning - being ends up kidnapped by a group of petty\ngangsters who plan to use it for criminal purposes. Meanwhile, back at\nTetravaal, ex-military man Vincent Moore is championing an enormous and\nviciously militaristic robot as the next step in robotic law\nenforcement.<br><br>Chappie is like Robocop crossed with Pinocchio, with a touch of\nTerminator and Pygmalion thrown in, and all run through a pronounced\nSaath Efrikan filter. Much is very good \u0096 lots goes on, performances\nare very good, effects are great (I suspect Chappie himself is a\nmixture of CGI, costume, animatronic and puppetry, but they are all\nmixed together so well that you simply accept his physical reality\nthroughout. It is often very funny, sometimes very touching, and has an\nending \u0096 several endings \u0096 which I didn't see coming, and which I very\nmuch liked.<br><br>Less positively, the strongly South African setting is both\nunderstandable and reasonable, but I found it somewhat distracting, the\nVodacom tower product placement was annoying, the physical appearance\naffected by Yolandi (which, I understand, is part of her schtick) was\nprofoundly irritating, and Moore's descent into psychotic\nbody-shredding scenery-chewing mode was somewhere between improbable\nand unbelievable.<br><br>On the whole, though, this was an enjoyable romp.\n"},
{"review": "\nSaw the great ratings and then was on the verge of bailing for the\nfirst time in years. So the first 'intelligent' robot hangs with dope\ndealing, violent thugs, wears gold chains, swaggers and finally when\nChappie tells them he can not commit a crime they easily convince him\nthat by not using his gun he can stop cars, toss the drivers a hundred\nfeed in the air (which might kill them) and take their cars... all the\nwhile Chappies can not figure out, with all his 'intelligence' that he\nhas become a major felon like the rest of the gang. Before this mess is\nover Chappie never saves even one innocent civilian but does manage to\ndraw blood from an innocent armored car driver as he commits yet\nanother major felony.<br><br>On the sci-fi part of the equation... we know Chappie's creator has\ninvented a program that allows for the first 'thinking' robot.\nSuddenly, out of no where we're seeing the ability to transfer human's\nconscience to a robot. No explanation about how or way that is suddenly\npossible.<br><br>The IMDb description of the film is nonsensical. Chappie, is hunted\nwhen he is seen committing crime and not because he is trying to save\nhumanity. The stars of this film and role model for Chappie are on the\nverge, several times, of executing Chappies creator. They are low life\narmed and dangerous dope dealing thugs.<br><br>Chappies amazing 'intelligence' finds him mindlessly following whomever\nis the latest person talking to him. Reasoning, morality, free will are\nout the window. Tell Chappie evil is good and he'll run with it. <br><br>Finally a gizmo, the size of a flash drive can put the city at peril.\nYet, it seems easy as pie for employees to snatch it and do very dirty\ndeeds. There is way more security on your local bank's safety deposit\nbox. Nonsensical script and a cute named but felony loving, law\nbreaking, dangerous robot. Yes, I was rooting.... for it to END!\n"},
{"review": "\nThere are way too many good sci-fi stories out there for Hollywood to\nbe making garbage like this. A better script could have been written by\na four-year-old retarded monkey on crack. The story is an insult to\ncomputer scientists, security experts, police officials,\nneuroscientists, CEOs, criminals and anyone with even a mild interest\nin sci-fi.<br><br>Suspending disbelief is not the same as turning off your brain\ncompletely. It takes a special kind of mentally challenged individuals\nto accept even one of the following, casually brushed over \"details\": -\nHuman consiousceness in a USB stick. Really? - A revolutionary robotics\n&amp; AI company with worse security than an average grade school. - A CEO\nwith an exceptional military weapon in her hands giving up after\nfailing to sell it to a police force. - An AI \"child\" that learns how\nto speak through 2 days of casual interactions with humans. The child\nsomehow magically categorizes heists and murder as crimes, but violence\nand car-jackings are OK. - A human mind-reading casket works just fine\non a robot. - A SW developer who first tests his AI on a human-like\nrobot, instead of a computer. Whatever!<br><br>The consiouscness BS is also disturbingly shallow, but enough said.\nSome people watch sci-fi films for the CGI and special effects, instead\nof the ideas. If you're one of them, you may like this trash.\nOtherwise, stay away.\n"},
{"review": "\nThe scrip is very illogical in the sense that it lacked common sense. I\nmean, how could Deon not call the police when he had the chance to take\nChappie back? Really? A genius could not think of that? Where's the\nsecurity in Tetravaal? No cameras? How could Deon and Vincent slip away\nwith the key guard? Or whatever they called it. When Deon was shot, why\nwould they not go to the hospital instead of transferring his\nconsciousness? I mean that's where the first place to go.<br><br>As for my review, there are many gaps and out of the context decisions\nby characters in the story. Some may argue that this movie is\nrevolutionary in the sense that it goes away with the \"mainstream\nstories\" and tackles rather \"socio-political issues\". But I've seen a\nlot of movies like that, and they were not mediocre like what Chappie\nmovie shows. The story could have been better. I was expecting more of\n\"what would a human do\" on several scenes rather than \"how stupid can\nhuman be\".<br><br>If the story was about corrupt government and society, well, it failed\nto show it. Although it showed potential in giving a new taste of robot\npolice concept, the story failed it.\n"},
{"review": "\nI take no pleasure in writing a negative review. I'd much rather rave\nabout a movie that pleasantly surprised me.<br><br>In the movie, Tropic Thunder, the term \"full retard\" became a trendy\ncatch-phrase. I don't want to sound like a whiny, semi-literate\nmalcontent, but while sitting through this absolute bomb of a movie,\nthe one recurring phrase that kept passing through my mind was, \"they\nwent full retard.\"<br><br>Chappie, the robot, gains sentience. He can think for himself, though\nhe starts out like a child that must be taught everything. This is the\ncore of the movie. Clearly, the writers meant to create a sweet\nmetaphor about the tribulations of growing up, but what they created\nwas two hours of pure cinematic torture. The acting, plot, and action\nsequences were often cringe inducing, not to mention laughably\nillogical and ridiculous. I seriously can't imagine how anyone could\nenjoy this movie.<br><br>Chappie is taught by Johannesburg gangsters, who talk about as\nauthentically as Keanu Reeves accent in Dracula (read: abominably).\nThis was one of the most irritating parts of the movie, but add to this\nthe cartoonish, buffoonish characters and the whole thing was simply a\nmisguided mess.<br><br>After one hour I didn't think I could last till the end. I literally\ncouldn't even sit still in my seat, but I toughed it out, hoping\nsomething at the end would happen to redeem the movie. Sadly, it did\nnot.<br><br>I won't even bother writing about the plot. It's full of holes. The\nacting is generally so absurd it goes beyond intentional satire. I pity\nthe great actress Sigourney Weaver who somehow got roped into this\nmess.<br><br>But most of all, I pity everyone who sat through this movie.\n"},
{"review": "\nThis movie has so many holes that I cannot even cover them all. I love\nhow movie makers think of Artificial Intelligence as Artificial\nFeeling. It was really ridiculous that the robot immediately started\nacting like a child as soon as it had AI. A machine will act like a\nchild only if it's programmed to behave like one. Not just by giving it\nself awareness. It was also stupid that the movie tried to make heroes\nout of the stupid vicious criminals. And implanting the consciousness\nto new body to achieve immortality, this has been used in the movie The\n6th day with Arnold Schwartzenegger. Implant memory to new cloned body\nto live forever. But is this real immortality? If your body die as soon\nas you transfer your consciousness, it may seem like immortality but\nwhat if your body doesn't die? And this clone with your memory is\nstanding in front of you. Is that clone really you? It's just a copy.\nOverall, this movie tries to deal with few philosophical topics but at\nvery elementary level. And just copied elements from many other movies\nthat are far more interesting and just made it worse. Actings were\nhorrible too.\n"},
{"review": "\nI was going into this movie the other day expecting a quite decent\nsci-fi action movie with a bit of a story but the end result wasn't\npretty. Some of the reasons why this is bad include every time the\nSouth African duo Die Antwoord was on screen, I had never heard of them\nbefore and never hope to hear of them again as I found their acting to\nbe woeful, probably the worst I've bore witness too, the story being\nborderline ridiculous at times, the dialog was at times hard to\nunderstand and the whole gangsta talk really isn't my cup of tea in\nthis sort of movie and hopefully last but not least, Dev Patel as a\nleading man. Patel, in my opinion, could improve as an actor after\ngetting his lucky break in Slumdog Millionaire as it is now two below\npar roles in the one year, after the Second Best Marigold Hotel and is\nin definite need of improvement. One of the only positives I can glean\nfrom this mess of a movie is Hugh Jackman's performance as he tries his\nbest in a villainous type role which I don't think I have seen from him\nbefore. Anyway, all involved must, and should be shaking their heads\nfuriously at what they had done. This is the first Neill Blomkamp film\nI have watched and I will go back and watch his other two but if he\nkeeps making movies like Chappie, his career will be over before it\nbegins. The one thing they should have had in this movie is an amnesia\nray, like in Men In Black, so I could use it to erase this film from my\nmind.\n"},
{"review": "\nI was an hour into this film on Pay-Cable when my wife walked in.<br><br>What are you watching? she asked.<br><br>I told her.<br><br>What is it about? she asked <br><br>Watch it and see. <br><br>So she did for about 5 minutes. <br><br>Then she wanted to know WHY? I was watching it. <br><br>That was a toughie <br><br>Its got Jackman and Weaver. It is by a famous director. Its got strange\naccents. I can't find the remote <br><br>But, and I am being honest with you, the look in her eyes told me that\nshe was having doubts about the man she married.<br><br>So I tried a different tack. <br><br>I am watching because I cannot believe anyone would deliberately make a\nfilm this bad with such a stupid plot and stupid characters and an\nA-list cast. I mean, a character who was carjacked by killers actually\ntells them that he doesn't want a confrontation, this with a shotgun in\nhis face, but he insists on coming back tomorrow to play with his\nrobot.<br><br>She accepted that excuse as reasonable. <br><br>I am hoping you will too\n"},
{"review": "\nI do not write reviews, but felt compelled to add my views on this\nfilm. From the previous reviews, this appears to be a 'Marmite' film.\nI'm not going to go into a long diatribe, I just found it preposterous,\nnot because of the concept of the film which is following a current\ntrend in near future Ai/robot story lines, but because of the almost\ncartoonish acting, and the disjointed implausible plot development from\nstart to finish. I am a Sigourney Weaver fan but I'm afraid this is a\nturkey for her, and I guess the other main actors will list this film\nvery low down on their CV. Anyone that watches this film should then\ncompare it with another recent Ai film; 'Ex Machina', which I consider\nto be a far superior movie on all levels.\n"},
{"review": "\nThe trailer makes this film seem like a really great piece of Sci-Fi.\nHaving a very promising plot by having AI in robots, future police\nbeing robots and grasping the surface of the abstract consciousness;\nit's a pity they let Die Antwoord in on this. Apart from the great AI\nplot properties, the whole film feels like an excuse for Die Antwoord\nto get their crappy music in a movie and for them so play cool and\n\"gansta\" in their old crappy warehouse. The movie could very well have\nleft out these idiots for real actors. The computers used in the movie\nseem very outdated and not capable of dealing with AI in a professional\nway. One would think that, for advanced AI programming; there would\nhave evolved some more advances interfaces to interact with this\nphenomenon.\n"},
{"review": "\nThere seems to be vast polarization amongst film viewers on this one. I\nwent to the theater with an open mind despite seeing reviews from both\ncamps. After viewing the movie to the end, I walked out somewhat\nbaffled by what I'd watched. <br><br>The first impression, ten minutes in, was that the dialog was written\nby a twelve year old child, maybe ten. Characterizations likewise\nseemed so utterly juvenile. Fine. Whatever. So it's a kids movie?\nRight? Wrong! Blood and guts, adult themes, and really immature\ngangsters portrayed as somehow likable. Horrible script! <br><br>What is this? Disney gone wrong? There was such a discordant note\nrunning through this mess. Are film-makers really so desperate for\nrevenue that they stoop to lowly marketing ploys? Are adults dumbed\ndown to the extent of enjoying such ploys? I'm thinking it's decrepit\nmarketing. \"Let's just bandwidth the audience to the lowest common\ndenominator,\"said the executive producers. <br><br>Terri is a much better writer than this...this...train-wreck deserves.\nDistrict 9 had an adult theme and appropriate dialog. This film did not\nmeet both criteria. Now I understand the critical reviews stating this\nfilm as a failure in execution. Insulting to adults, detrimental to\nkids. <br><br>Shame on you Neill Blomkamp. You let us down in many ways. Minus many\nstars for wasting, insulting exceptional talent. 4/10 only for amazing\nproduction values and CGI. Everything else is garbage, including the\nchoice to have Chappie's AI \"learn\" in a totally absurd manner. That's\nall.\n"},
{"review": "\nThe movie reminds me a lot of the movie I, Robot with Will Smith. But\nit's far from being even close to that quality of movie. I would show\nthat movie to some teens though. Chappie is not for anybody under\n18-20. I loved the idea of Artificial Intelligence movies. I want to\nsee more. They basically made Chappie into a thug though. His learning\nprocess as a true A.I. robot makes zero sense. He goes from being a\nchild to having a complex mind within 3-4 days. A.I. does learn but\nthat pace is illogical. Making him a child for 95% of the movie. Then\nsuddenly in the last 30 minutes he's Einstein smart learning how to\nupload the internet to his brain basically. Second the thug characters\nmake this movie worse. The story line of Hippo, Yo-landi, Yankie, and\nNinja among all the others just bring this movie down. The plot of\nChappie, his creator and the creator of the whole U.I. program Deon\nWilson and the villainous character played by Hugh Jackman, Vincent\nMoore. Vincent Moore basically had created his own program of these\ngiant two legged robots which are run by humans controlling them with\nthese helmets that link to their minds. The only confusing part is they\nare run by human mind but he still has to sit in this chair and have\nthis giant joystick to control his robots. If they lest the stupidity\nof the Gangsters and left it to Vincent Moore and his robot vs Deon\nWilson and his robot army and Chappie this movie would be one of the\nbest of all time. Yo-landi is just creepy and can't act period, Ninja\njust can't act and looks like an idiot through the whole movie. They\nmake Ninja look smart by how he controls Chappie but at other times\nthey make him look idiotic which again is illogical. Then Hippo is just\nan angry meathead. I don't see anything good coming from these three\ncharacters and their posse in the whole movie.\n"},
{"review": "\nI've watched some bad movies in my time... heck, I'm a major fan of\nB-Cinema and the like usually. But this film... From it's logic, full\nof holes, to it's acting and more... was just terrible! Never have I so\nhappily been cheering that the main characters get killed. I mean, what\nwere they (the filmmakers) trying to convey? Why did they want you to\ncheer for the thugs? And I mean thugs! Ninja and the group... terrible!\nThis film was just, total trash from beginning to end. And the entire\nconcept was trash. Have you gotten my point yet that I think this film\nwas trash? I couldn't even finish the damn film first time through\nbecause it just lost my interest within the first 30 minutes. I got to\nabout the half way point (about an hour and 10 minutes or so) into the\nfilm, but then had to stop it and watch something else before returning\nto it. The only redeeming factor from the whole film is you feel bad\nfor the robot, Chappie, and the special effects are pretty damn cool.\nBut that's not enough for a film to be watchable or enjoyable. I mean,\neven Hugh Jackman and Sigourney Weaver couldn't save this stink bomb of\na film! So, in short, avoid this film! It quite possibly may lower your\nIQ, or give you cancer. Okay, maybe neither will happen, but you get\nthe point.\n"},
{"review": "\nThere were times in my late teens where I'd go to IMDb.com and search\nfor any movie that got 7.0+ and watch it blindly. The result was always\nin one way or another positive.<br><br>Over the past 5-6 years, the IMDb ratings have been screwed up beyond\nany recognition. 8+ ratings fair at the 2-3/10 range and vice versa.\nEither the audience have become dumbed-out movie-zombies or the\nproducers are hiring bots to vote 10 on their shitty products This\nmovie was riddled with plot holes and shoddy performance. The villains\nare silly comedians who live in a shack and allow a hostage person to\ngo and come as they will. The hostage also happens to give them orders\nat some point and insult them whilst they're all gun-strapped Chappie\nthe robot acts dumb, and whilst the plot ascertains that his brain is\nequivalent to that of a baby, decides to put on a combined South\nAfrican/Asian accent with a shallow jab at being funny. The\n(supposedly) violent villains find him entertaining and funny so they\ndecide to nurture him and hang out whilst the entire focus of the film\nis lost.<br><br>Lastly, the producers couldn't even be bothered with designing Chappie\nand the other droid to walk like a robot with the limit pivotal\nrotations. In fact, they all bounce around, sit with their legs crossed\nand do all sorts of things any advance robot is not capable without\norganic ligaments.<br><br>FAIL\n"},
{"review": "\nIf you think this is a sci-fi movie about a robot then you are\ncompletely wrong. This movie is all about a couple of South African\nrappers. These two talentless wannabe actors couldn't have advertised\nthemselves better if they paid Neill Blomkamp. This is a 2 hour long\nadvertisement of a South African rap duo.It is awful. It makes you\nwanna ask yourself if that's the guy who made District 9 and\nElysium.Those were great movies. Especially District 9 was one of the\nbest sci-fi movies I have ever seen. It was original, it was\nbeautifully shot. Chappie on the other hand feels-to say the least-\ncheap. Story is predictable, acting is wooden and there is nothing, I\nmean nothing special in this movie.So, do yourself a favor. If you\nreally have to see this garbage, wait until it's on TV.\n"},
{"review": "\nBeing a South African and Johannesburger, I wanted to love Chappie.\nBeing a fan of Blomkamp's work on District 9, even more so. But while\nElysium was a tolerable ego trip saved only by Matt Damon's\nperformance, Chappie is the worst film I have seen in two or three\nyears. It's just abominably bad. <br><br>Chappie's only redeeming feature, being a Blomkamp effort, is its\nvisual effects. But, being a Blomkamp effort, is it utterly devoid of\ncharacter development, plot or intrigue. There are such massive, gaping\nplot holes in the already shallow and predictable narrative that I\nfound myself laughing out loud at the absurdity of the assumptions made\non the viewer's (lack of) intelligence.<br><br>12 years ago an animator friend of mine passed me a flash drive with a\n1:20 long clip by a budding SA director (Blomkamp) to watch and I\nremember being floored by it (you can see it here:\nhttps://www.youtube.com/watch?v=VTnxP7e7-YA). That 1:20 clip is a\nbetter film than the entirety of Chappie.<br><br>Sometimes - especially in this case - an artist's greatest work is\nproduced under duress. Blomkamp, much like Shyamalan, will continue to\ndecline rapidly as his resources expand. It's like he doesn't have to\ntry - doesn't have to fight to create something magical - and it shows\nin this film.\n"},
{"review": "\nNot sure why I even gave this two stars. It owes me two stars for\nwasting my time. The actions and the motives of the characters make no\nsense. A tough criminal suddenly suddenly believes she is the mother of\na stupid robot who isn't even cute? The evil criminals let the \"maker\"\nget away more then once? The most profound question asked, by the\nrobot, is \"Why would my maker create me to die?\" Ugh... wonder what\nthat question is supposed to remind us of? The only problem is the\nrobot's creator is not the \"all-powerful\" creator, but took something\nsomeone else made and gave it new abilities. There are so many other\nmovies that ask the question about the cross and connection between AI\nand humanity and the existence of a \"soul\" that are so so so much\nbetter than this ugly, violent and nonsensical trash, take your time\nand go watch those. Her, 2001 A Space Odyssey, Moon, Steven Spielberg's\nAI Artificial Intelligence, was particularly good. If you love ugly\ncharacters, endless violence, shallow and uninteresting plot, bad\nacting, and \"we are trying hard to be profound here\" moments, then you\nwill love this movie.\n"},
{"review": "\nSeriously, this is the worst piece of bad film I have watched in a long\ntime, and I watch a lot of crappy movies (what else is there...). I can\nlive with a half-hearted story, I can bear boring characters that act\nwithout logic to a certain degree, but what was served in Chappie was\nway past anything acceptable. I read some of the newer reviews here,\nand there are an awful lot that say the same thing: don't let the bad\nreviews fool you, it is *much* better than they say. I can only draw\none conclusion from this: that a lot of real people told their real\nopinion of this crap, and the studio thought: oh well, we can't let\nthat stand like this - let's get some good reviews up on the net. And\nthe PR machinery was set in motion. If you are burdened with an IQ over\n90, you will be painfully underwhelmed by the absence of any inner\nlogic to this movie. Everybody, and especially Crappie, is acting\ntotally unbelievable. The story is such a sorry mess of unrelated\npieces of plot, thrown together without any regard to human dignity, it\nreally is tough to explain. But luckily, it isn't worth the effort.<br><br>Do yourself a big favor and don't watch this. It is not even worth a\nfree download. 2/10 for some visuals, but nothing special.\n"},
{"review": "\nNot only this features the re-recycled themes, but the entire plot is\nso ludicrous, the plot holes are so large that the movie starts to fall\napart within the first 30-40 minutes. You could argue that this movie\nis intended for kids, however the copious amounts of violence make this\npoint mute.<br><br>Spoilers below this line<br><br>0) The country apparently has no military force because the company\ndoes not want to market it's large robot capable of shooting down\nplanes to the military. Instead it keeps around a useless robot around\nthat it insists on marketing to the police???? 1) The gangsters are\nsimply caricatures 2) Why steal an inventor of the robot, and then let\nthe inventor go???!! 3) The inventor comes and goes from the gangsters\nas he pleases. 4) The robot has a mentality of a 3 year old and yet is\ncapable of figuring out how to \"extract\" his consciousness using\nsophisticated computer equipment 5) The helmet designed to control the\nlarge robot is for reading human brain signals. How can it work on a\nrobot???\n"},
{"review": "\nI had somewhat high hopes for this movie. I like Neil's work. I loved\nDistrict 9, enjoyed Elysium. But this, oh my god...<br><br>Firstly, Die Antwoord. Why? Just... Why? I don't get it. I'm not even\ngoing to comment on their performance. I would just like to say that I\nthink it is shameful the way got to keep their real names and all the\nself promotion they throw at the viewer being it with their mannerisms,\nwanksta attitude and using Die Antwoord official gear throughout the\nwhole movie. And also their bullshit music always playing turning me\naway from the scene and making me roll my eyes with every \"note\".<br><br>The premise of the movie wasn't bad. It could have been a great\nexperience, even with all the bad actors and stupid background story\nlines. It should have been focused more on the AI vs Human or AI/Human\nvs \"DRONE\", all the ethical implications, military interests, political\nlobbying. But oh well, let's just nurse a robot AI. The maker teaches\nhim how to paint and the \"daddy\" is mad and wants to kill the maker\nbecause he needs the robot to get all \"DEM MILLIONS YO\". Mommy dies,\nmaker and daddy unite forces and kill the big \"DRONE\". And I'm not even\ngoing to start on the fact that a freaking AI uses a neuro-receiver to\ndigitize it's \"soul\". It's digital signature or consciousness if you\nwill. The freaking thing doesn't have a brain man. Come on. It's made\nof boards and circuits and memory and hardware. Please man. And then\nthey use the freaking thing to get Deon's mind/consciousness into a\nfreaking tin can. Man. I'm out. This is too much.<br><br>I can't even comprehend what the hell was going through Neil's mind. I\nthink he was high. Madly high. <br><br>This movie is just bad. I thought i'd love it. I can now say it was one\nof the worst cinematic experiences of my life without a doubt.\n"},
{"review": "\nI loved district 9 but I was bored with Elysium so i was guessing\nChappie would be average. i was wrong, it was brilliant. i couldn't\nhelp thinking about the comparisons to short circuit, a great film.\nthis was short circuit for grown ups who like a good action film. I\nexperienced it at an Imax cinema, which is probably the best way to\nexperience it. the story was great, the action sequences superb and I\ngenuinely became engrossed in seeing the poor little robot develop. it\nreminded me of Frankenstein, a powerful man made thing with the mind of\na child who wanted to be loved and do right by people. it was also\nrefreshing to see Hugh Jackman play against type. The dialogue was\nfunny and engaging and the director once again explored discrimination\nand injustice in the world. You forget that Chappie is created by CGI\nand you genuinely feel for him and want it to end happily for him. I\nwont spoil it for you because you will enjoy going through the roller\ncoaster ride me and my son went through for two very fast hours!<br><br>when you start watching the film, you instantly think of \"I Robot\",\n\"Robocop\", \"Short Circuit\" and \"Frankenstein\" but it goes in a very\noriginal and entertaining direction which you don't expect. me and my\nson did not want it to end. In a nutshell, it is funny, gruesome,\nheartwarming, sad in places, spectacular and gritty. An altogether\ngreat film, well done to all involved. the only downside, Sigourney\nWeaver is underused and pretty irrelevant but that did not spoil the\nenjoyment of the film. Absolutely loved it, highly recommended\n"},
{"review": "\nTrailers can be a taste of things to come or (in the case of Chappie) a\nbad taste that you want to spit out and get your money back. The vulgar\ndialog was annoying to an extreme but worse yet was the countless times\nI couldn't understand much of the Brit slang and dribble. Then there's\nthe storyline that was so ill conceived and often cartoonish while\ncarrying an \"R\" rating. <br><br>Hugh Jackman and Sigourny Weaver should be required to sit through this\nmanure and explain how they justify such a badly scripted film. I don't\nusually trash a film unless it's so bad I feel the need to save others\nand warn them that this film deserves a warning to avid movie goers to\navoid this and save your money.<br><br>Final point here to share is the believability of the scientific scheme\nand plot of this Sci-Fi film. It just makes little if any sense. The\nviewer eventually begins to laugh at the unbelievability of the\nstoryline. This film reminded me of a quality film of similar science\nfiction. It was called \"Short Circuit.\" Chappie, unlike Short Circuit,\nhas no direction, no characters worthy of praise and no valid merit of\nlesson.\n"},
{"review": "\nGot pleasantly surprised that the movie was pretty funny, since we went\nto see Sci-Fi and humor is not usually what you'd expect. At the same\ntime multiple serious things are shown and you wonder... what exactly\nis consciousness... would it fit on a USB stick... what makes a machine\ndifferent than us... anything you wanna do in your life you can do...\nwhy does a robot wipe his nose... that battery... what's the meaning of\nlife... should I buy a Sony laptop... what will happen next... how cool\nis it for a robot to have a tattoo... that soundtrack... be careful who\ndo you fist bump...<br><br>If humanity does not self destroy itself - artificial intelligence will\nbe created. Whether this will happen in our lifetimes or thousands of\nyears from now - it is another story.\n"},
{"review": "\nThat's it, Neill Blomkamp has credits as a director only because of one\ngreat movie..District 9. Following massive and unanimous favorable\nreviews of District 9 (deserved,it's a debut masterpiece) Neill\ncouldn't handle the pressure or didn't have more talent and creativity\nto directing another masterpiece (or just a good movie) and the result\nwas Elysium, a film with great special effects but insipid and\nunexciting. Getting to Chappie, a razzie worthy movie this director\nshows that is no Spielberg, Kubrick or Tarantino, he's just a great one\nmovie director, hardly he will make another masterpiece and even good\nmovies (maybe he can make one or two). I don't even want to write a lot\nabout Chappie, the title is ridiculous, the voice of the robot is\nridiculous,the bad guys (who turn good guys) are all stupid and\ninfantile..Dev Patel is a failure as actor (he's just bad all the way\nin all movies), Sigourney is old and has almost a cameo,Hugh Jackman,\nnot being great can be the less mediocre. <br><br>This remembers those Japanese movies made to be infantile and baffling\nbut with the right and correct doses of humor, drama and horror. Made\nby Blomkamp it's just a ridiculous movie trying to be serious.\n"},
{"review": "\nThere's nothing wrong with the CGI and most of the other VFX. The score\nis wonderful. The story somewhat comical and endearing in places.\nThat's the good.<br><br>The bad is that this movie is the ultimate in form over content. The\nplot has more holes than Swiss cheese, the logic of none of the\ncharacters makes any sense and the childishly superficial character\ntraits are laughable. It's offensively dumb.<br><br>All of this might work if there was somehow a good core to the movie,\nbut sadly it doesn't have what it takes to become a true cult classic\neither. You can tell a story with stereotypes, sure. And perhaps the\nmakers were just going for a movie that was zef. But none of that\nexplains the mess that Chappie is in the end.<br><br>If you want to put a movie on that offers nice visuals, robots running\naround and shooting and some Die Antwoord tracks, Chappie is for you.\nCheck social media and listen to some Spotify while you do it and play\na game on the side - because that's what this movie is for: cinematic\nwallpaper.\n"},
{"review": "\nI wish the author or director put more thought into making this movie.\nI wonder how Hugh accepted to act in this waste of time. The movie does\nbegin with a reasonable beginning..but after a while it feels so\npointless and illogical. There are hundreds of movies on robotics and\nthis movie doesn't cut any thing different from them. Why should the\nrobot think like a child...come on...after all these years you still\ncan't imagine anything different from what a human thinks, how a human\nlooks, how a human acts...! It lacks originality though and there is\nnothing which is kind of or closest to a surprise..you know what is\ngoing to happen...!\n"},
{"review": "\nThere was great atmosphere, talent, CGI and graphics in general. The\nstory could have made sense, it did not. I think the best acting was\nDev Patel and the actor that bought \"Chappie\" alive. High ratings and\nfairly positive IMDb user reviews.. what could be wrong. The ENTIRETY\nof the media this is stored on. Majorly disappointed. Overall I trust\nIMDd contributors and am not usually led astray. I must be missing\nsomething to be so at odds with the majority here. Why the level of\ncelebrity was utilized in such a shockingly bad venture must certainly\nhave been done for the respect they had with a ranking executive,\nsimply for the paycheck or a favor they owed the producer/director for\na past job they've been chosen for. If not, I have no idea why they\nchose this script/project. Chappie isn't a film that a majority of\nparents would allow for very young audience due to violence, language\nand it's visual reference to language throughout. It's somewhat limited\nto an older teen to twenty something audience and this might be why I\ndidn't find it worth the two hours I watched it. Though it does have\nsome comedic value, it's not a comedic film. I have become ever more\ninterested in Sci Fi and this tag might have been what pulled me in.\nThe genre is certainly enjoying a high point lately continuing on the\nlarge screen as well as extremely good programming on the small screen.\n"},
{"review": "\ncan't believe they took good actors and made them do this... the movie\ncould've been really nice if the director had any balls, and didn't\ncast die antwoord, which made it into a movie about them (and their\nreally bad acting). the story, generally, kinda reminds you of \"short\ncircuit\", but with a gangster vibe. the parts about how chappie relates\nto the world are nice, but everything to do with technology in this\nmovie is so far from realistic, it's absurd. if you're in any way\nthinking that this movie is in the level of district 9, i'm here to\ntell you a definite NO! i loved district 9, and this movie is a total\nwaste of time.\n"},
{"review": "\nTo get this out of the way I went in with no idea what this movie was\nabout, I didn't watch a single trailer, read a synopsis or watch any\nprevious Neill Blomkamp so I went in with an open mind and I still\ndidn't care for this movie. The concept is interesting, a robot that\nbegins to think and feel for himself is a great opportunity to ask\nquestions about humanity and consciousness, unfortunately this movie\ndidn't understand what to do with it's potential. None of the\ncharacters felt like actual characters that grow and develop, everyone\nfelt like a convenient plot device walking in to say expository\ndialogue or move the plot forward, the gangster characters were so\nannoying that I was actually cheering to see them die. The pacing and\nstory structure is incredibly awkward and doesn't have a good flow from\nbeginning to end, it doesn't have a good understanding of it's themes\nand therefore they feel undeveloped, the characters are always in\ncontrived situations and are not well developed as an ensemble, besides\nChappie not a single character feels like a protagonist or antagonist,\nI even liked Hugh Jackman's character and he was supposed to be the\nvillain I guess, also Sigourney Weaver is severely underused in the\nfilm. In short Chappie is pretty Crappie. My Grade: D+\n"},
{"review": "\nI don't know how a select group of decent actors sat a table and\nthought, \"wow, this is a great idea. I bet my career will benefit from\nsuch a blockbuster.\" This movie is comically awful. The plot is\nseriously lacking anything riveting or engaging, the dialogue is\nequally as lackluster and the plot is hopeful to reach the caliber of\nEx Machina and the latest Mad Max in the utmost of shortcomings it\ncould've resulted in. IMDb with a 7/10 is greatly misleading and you\nshould do anything but waste your time on this film. I'd rather watch a\nrecent Adam Sandler flick. Wit very little to go on in terms of a plot\nworth investing your thought or energy, quips that fall very flat on\ntheir face, a point of tension that doesn't really have you feeling\nlike the edge of your seat is a place... I just feel like I've been\nhappier wasting my time on far worse and even expecting much less.\n"},
{"review": "\nIn Johannesburg, the police department reduced the high rating of\ncriminality using robots from the Tetravaal Company, designed by the\nengineer Deon Wilson (Dev Patel). The former military Vincent Moore\n(Hugh Jackman) is envious of Deon, since he has developed another\nproject called Moose, but neither Tetravaal nor the police department\nis interested. Deon has just developed an Artificial Intelligence but\nthe Tetravaal's CEO Michelle Bradley (Sigourney Weaver) asks him to\nabort the project. Deon decides to bring the damaged Robot 22 that was\nsent to be crushed to test his A.I. However he is kidnapped by the\ncriminals Ninja (Ninja), Yo-Landi (¥o-Landi Vi$$er) and Amerika (Jose\nPablo Cantillo) that want him to stop the robot cops. When they see the\ndamaged robot in the van, they force Deon to program it to heist banks\nwith them and they call it Chappie. However, Chappie acts like a child\nand need to be trained to learn and grow. Meanwhile Vincent follows\nDeon and plots an evil scheme to activate his robot. <br><br>\"Chappie\" is a flawed but entertaining film with \"robocops\" fighting\nagainst crime. However, Tetravaal is totally unbelievable as a security\ncompany with the easy access of employees to the facility and software.\nConsidering that all Johannesburg is dependable of the robots, it is\nridiculous the lack of protection of the company and how easy Deon\nWilson and Vincent Moore go there during the night and access the\nsystems using only a key. The concern of Chappie with mortality and the\ndiscussion with his creator is taken from \"Blade Runner\". The corny\ndecision of Deon, running after Chappie instead of activating the\nrobots in the chaotic city is also silly. My vote is seven.<br><br>Title (Brazil): \"Chappie\"\n"},
{"review": "\nI always trust IMDb for reviews and went straight here before\npurchasing the movie. Good thing I watched it at home and not at the\ntheater. I went in with medium expectations as the previews seemed to\ndemonstrate a less than stellar production. However, the top review\nmentioned that the movie was awesome. As such, I went in expecting a\nmediocre movie. Boy, was I disappointed! If I would have gone in to the\nmovie thinking it was going to be the worst film ever, I would have\ngiven the movie at least a 3. The acting was the worst I have ever\nseen. To give you an idea of the depth of programming at my house, we\nwatch Spongebob, Dora, etc and I get more from those 30 minute snippets\nthan from this flop. If you have alphabetized your entire pantry and\nare still bored, this will at least kill 2 hours.\n"},
{"review": "\nContrary to many who have left their opinion here, I am not a fan of\nBlomkamp films. However, I am a sci-fi fan and therefore try to give\nfilms like this one a fair opportunity to impress me.<br><br>Aside from some big budget effects used in Blomkemp's films, each one,\nand especially Chappie, have the heart, soul and depth of a B-flick at\nbest. What's most difficult about his films to digest is that all of\nthe characters are barely likable and hardly engaging enough to gain\ninterest. Add to that that all of his films depict a dark and grim\nfuture. And finally, Blonkamp puts the \"trash\" in \"Euro-Trash.\" At the\nvery least, I felt the District 9 and Elysium were pretty much original\nstories. On the other hand, Chappie was little more than a poor\nretelling and fusion of predecessors like Short Circuit and Robo-Cop\nand others. The premise was hardly original.<br><br>Sadly, I knew what I was in for before I had seen the film based on the\npreviews. Yet, I still wanted to give the film a chance. All I can say\nis that I'm glad I waited to view it on DVD. Unlike some of the\npredecessors this film rips off, I won't ever want to see it again.\n"},
{"review": "\nDid you read that? If you did, what you read is correct! The movie\nChappie has failed to answer those questions in the movie correctly.\nThe story and plot didn't get me satisfied at all. And the movie itself\nis boring. The soundtrack playing in the movie was just \"OK\" to me.\nActing was not very good either. It's just a waste of their time in\nacting for the movie. Hugh Jackman, while not the lead character, is\nreally weak in his role. Sigourney Weaver and Dev Patel didn't do for\nme either. But Sharlto Copley who voices the robot Chappie seemed like\nhe's the only one among the entire cast who showed their real talent,\neven if his was only voice acting. The good thing here is the focus on\nthe robot Chappie who has a child- like mind trying to know how to do\nthings. Still, the movie gets boring later on. Unsatisfying story and\nplot, bad acting (excluding Sharlto Copley), and long running time.\nEven the movie itself has failed to answer questions correctly. The\nwhole crew of the movie can do better than this.<br><br>3/10\n"},
{"review": "\nI saw the movie prior to finding so much hate within the reviews. It is\ntrue that the film has 2 or 3 questionable plot-holes, but giving it\nanything less that 5 is clearly hate rating. The film also is not up\nfor more than 8, since there are some very questionable issues with the\ndevelopment of the plot at certain points, and its message is strong,\nbut rather simple.<br><br>\"Shot-Circuit (1986) meets the gansta\" is entertaining, and leaves a\ncouple of things to think about by the end of it, so I think it does\ndeserve its current average of 7.2.<br><br>I liked it more than Elyseum, but a bit less that District 9. I clearly\nrecommend it, but keep your expectations in check just in case.\n"},
{"review": "\nWhat could ruin a movie more than a yellow assault rifle? A bunch of\nhipsters posing as street criminals? Ordering a pizza just to rob the\npizza delivery guy? Using ninja stars as actual weaponry? Motocross\nprotective gear? A sudden maternal instinct to say \"Oh, Chappie\"\nrepeatedly to a microwave just because it can say \"mommie\"? Or a major\nrobotics corporation's blatant disregard for the first and only\nconscious robot created in human history? So why did I watch the movie\nfor 1 hour and 30 minutes before I decided to turn it off? Was it\nbecause I kept feeling like the script was going to improve once every\n15 minutes? I will answer all my questions with \"I just don't know.\"\nBut, what I do know, is that the robot, who was only as intelligent as\na human child, was more intelligent than everyone else in the movie.\n"},
{"review": "\nThis film is just about OK to watch if you have nothing else to see.\nThe plot is thin, the characters inconsistent and totally unbelievable,\nturning from bad guys, to good guys, and back again, loads of slow-mo\nviolence, bullets piercing bodies and more explosive special effects\nthan you can shake a stick at. <br><br>That said some of the characterisations are a tad above the norm with\nthe everywhere man Dev Patel being perhaps the low point on that score.\nSome of the other characters if characters is the right word in a film\nthat bordered on the cartoon at some points, being so outrageous in\ntheir behaviour as to make you hope they get what is surely coming to\nthem and for most of them, it did usually in a hail of bullets. <br><br>All of that aside this film was I suggest never meant to be serious,\nand was intended to be the first in perhaps a franchise of many more.<br><br>The film left it wide open for a Chappie Two with all of the main\ncharacters morphing at the end into something new. The big question is\nwhether you could be bothered to see a sequel, in my case I think not,\neven though this film was one step beyond being a very funny film\nindeed, leaving me not quite sure if I loved it or hated it!\n"},
{"review": "\nAbsolutely Brilliant. I loved every moment of Chappie, who is as\nengaging as Wall E, yet less predictable. Script/Dialogue is superb,\nthe Action and Plot are seamlessly composed....Wow, kudos to Blomkamp\nfor having such a stark, clear vision of the near future and telling it\nso well. Jo'berg didn't fare too good, hopefully this was CGI, which I\nnever felt aware of anywhere in Chappie, and which has been ruining\nSci-Fi for 20+ years. Excessive action for the sake of action,\nconvoluted plots as a substitution for good writing...The latter 2 are\nboth, happily, absent in this superior film, crafted by a director who\nis 'scooting' up beside David Lean in my library of Genius Film Making.\n"},
{"review": "\nCrime in Johannesburg is out of control. The government uses robots\nfrom the Tetravaal Company run by Michelle Bradley (Sigourney Weaver).\nThe Scouts are designed by Deon Wilson (Dev Patel). Ex-military Vincent\nMoore (Hugh Jackman) has his design called Moose but nobody wants it\nwith the Scouts being so successful. Deon develops a revolutionary AI\nand has secretly programmed it into a damaged Scout. Meanwhile,\ncriminals Ninja, Yo-Landi and Amerika need to make one big score to pay\nback crime lord Hippo. They come with an idea to kidnap Deon to get a\nremote for the robots. Instead they also get learning robot Chappie.<br><br>The criminals are really off-putting. They are more like Mad Max\nwannabes than anyone scary. Ninja is way too silly and Yo-Landi is way\ntoo maternal. The first problem comes when they let Deon come and go as\nhe wishes. I don't understand Ninja's logic. He's a horrible kidnapper.\nAlso the company has horrendous security. Neill Blomkamp has something\ncompelling to say but it becomes a mess. Chappie is like a gangster\nJohnny Five with less charm. I never hated Vincent as much as the movie\nwants because I never liked Deon and Chappie that much.\n"},
{"review": "\nNeill Blomkamp is certainly trying to find his voice in the world of\nfilm. After District 9, his work have left much to be desired. That\nstreak continues with Chappie, science fiction film with a lot of\naspirations, but it relegates to just a quilt of other science fiction\nfilms with little to offer.<br><br>Good: I enjoyed the ideas the film brought up about being a living\nbeing and what it means to be considered a person. Those little gems\nwith Dev Patel were good. The effects for Chappie are amazing as they\nare probably one of the most realistic robot effects I've seen in a\nmovie. Sharlto Copley provides some heart as the voice of Chappie.<br><br>Bad: The movie while it strives to tackle themes of mortality, the\nmeaning of being a person, and technology as a whole, it decides to\njust blow things up instead. When it tries to be dramatic, the drama is\nweak thanks to the lack of scenes with Patel and the weak acting\noverall. The group Die Antwoord are not good actors and they are\nunlikable characters so it makes the journey not worthy to follow\nbecause there is not one to attach with aside from Chappie. Jackman\nplays a cartoony villain and Weaver does nothing. <br><br>Overall, it has potential, but Blomkamp takes the ideas and relegates\nit to a simple action movie that doesn't offer much else that we\nhaven't seen before in better movies.\n"},
{"review": "\nIt had been a while since characters failed a movie so badly. <br><br>The title character is not a child, he's just dumb. Even with a fairly\nopen mind and high tolerance for science fiction idiocies, this doesn't\nwork. He (it?) is just an idiot. This makes identification and\nultimately enjoyment of this movie very difficult. Everything from the\nvoice to the 'gangsta' mannerism become increasingly annoying as the\nmovie progresses.<br><br>The rest of the characters range from annoying (the local hoods) to\ndownright disagreeable (chappie's family). What's worst, the famous\nactors are just phoning it in (Weaver's performance is poor, Jackman is\na caricature and again, chappie's family is not only annoying, they're\njust poorly acted.)<br><br>Voila, no real need to write anything else about this movie. It's\nimpossible to get into it because of its characters.\n"},
{"review": "\nI looked this film because I like science fiction and I loved District\n9 from the same director. Elysium was still OK. But this one is so\ninfantile, the story so implausible in every step it is developing. The\nbad gangsters which are getting mellow because now they have to care\nfor a baby (Chappie), the engineers which can come and go in a high\nsecurity area, fetch even arms out of the security area and so on and\nso on. There are maybe some good ideas in the film and sure, the\nspecial effects are well done, but man ... nobody can stand this story.\nThe only good idea comes at the end, but I don't want to spoil, if\nsomebody really wants to loose 2 hours of his live and feel bad\nafterwards, like me now. Really, I am looking a lot of films, and\nnormally I inform myself before, for example en IMDb, but I cannot\nimagine how this film got his 6.9 points. Normally with this rating you\nstill can watch the film, but in this case the voting failed.\n"},
{"review": "\nProbably the most annoying thing about \"Chappie\" is Chappie himself.\nThe robot is annoying and weak. He speaks with a very irritating South\nAfrican hoodlum accent. Did they think this would be cute? It's not\nendearing at all.<br><br>As so many other reviewers have said, the rest of the movie is just a\nmishmash of shamelessly stolen sci-fi movie clichés and product\nplacement.<br><br>(Why on earth does this take place in South Africa? Everything else\nabout the film suggests it should be in Los Angeles.) <br><br>I'm one of the few people who *didn't* like District 9. I found it\ninsulting to my intelligence. (You can read my review for that movie if\nyou like. Just go to my IMDb page.) So I had low expectations for\nChapppie, and it lived down to them.\n"},
{"review": "\nI had watched the first few minutes of this before I realised that this\nwas the work of the director behind District 9. The style, image and\n\"feel\" are all reminiscent of that movie but this one is not as good.<br><br>The CGI, as many other reviewers have said, is breathtaking (there was\nonly one section , as Chappie crosses the rail-yard, where I remembered\nI was looking at some computer artifact) but the story is too rote, the\ncharacters too shallow and the pace of the movie judders. There's not\nenough of any particular ingredient to carry the movie as a whole and\nthe tantalising splinters of interesting ideas only serve to show what\nhas been missed.<br><br>As for casting - the three \"heavy weight\" actors are wasted and\nalthough I admire the cheek of Die Antwoord's musical style they are no\nwhere strong enough actors to fill out the pivotal role their\ncharacters play.<br><br>All in all I'd say that if you haven't seen District 9 - watch that\ninstead. This one is something to watch if you watched that one too\nmany times but want more of that elegant CGI / faux-documentary blend\nof style.\n"},
{"review": "\nThis film has been done to death, and the story here is so borrowed, so\nderivative, there's really no reason to see it done again, this time,\nvery badly.<br><br>The archetypes are dumb and unoriginal. Its actually surprising the\nfilmmakers tried to reel this out as a 'new' film. <br><br>The notion of AI they try to pass off here is sort of what you might\nexpect if you asked a 5-year old to describe how it might work. <br><br>There are so many glaring plot holes its like you're waiting all the\nway through the film just for any one single instance of believability. <br><br>Don't waste your time; Its over-long at 2 hours, and thats time lost\nfrom your life that once spent, you can never get back.<br><br>If you want to see an intelligent film about AI, check out EX MACHINA.<br><br>This one strictly for the youngsters and the not-too-bright.\n"},
{"review": "\nAfter seeing District 9 and Elysium (and enjoying them both) I thought\nthis film couldn't be a bad one. And alas it is actually very good.<br><br>Remember Short Circuit, and more recently I Robot, this film far\nsurpasses these in every way. It has the various things that can make a\ngripping movie, action and violence/threat, emotion and memorable\ncharacters, a storyline that is done as credible as you'd imagine and\nwell written, many humorous moments between the more serious scenes.<br><br>Good acting in it, and when you can actually feel quite sorry/attached\nto a robot on a screen you're watching, you know the producers got it\nright.<br><br>The film does bare minute similarities to District 9, but nothing wrong\nwith a director paying homage to where they're from, especially as it\nmakes a refreshing setting to many other movies. I can't really fault\nanything.<br><br>Overall I'm happy I went to see it, and the 2 people I saw it with also\nloved it. I would recommend it.\n"},
{"review": "\nAbsolutely agree with \"samwturner\" reviewing below; go watch this\nmovie. I absolutely never write reviews, this has been the first time I\never bothered to sign in and write one, but I felt obliged, seeing the\nbad reviews the movie has gotten, which are frankly, bs! I am a writer\nand teach literature, thus have a faint idea about theme, character\ndevelopment and story arch, not that it should matter. I never read\nreviews prior to watching a film because I know that anyone should be\nsmart enough to make up their own mind whether they want to watch\nsomething, would enjoy something or not. Chappie, as Sam said, is a\nlovely movie that tackles the heavy questions of humanity, mortality\nand consciousness with Chappie as a lovable lead. If you find yourself\na nice person who is open-minded and intelligent, you will enjoy this\nmovie made from scratch (writing, directing, etc.) by Blomkamp, which\nitself is a rarity in the profit-driven industry that movie making has\nbecome.\n"},
{"review": "\nChappie is a fun ride. It has it's interesting moments, to say the\nleast. It takes quite a while for everything to get melded into place.\nYou more than likely will not feel the full satisfaction until the end\nof the movie. <br><br>If you liked District 9, you'll like this one too. District 9 had a lot\nmore likable characters and emotional ties. Chappie has too many\nforgettable characters, and a lot of characters that will confuse you. <br><br>Despite any little criticisms I might have, Chappie is much more\nrelatable to District 9 than Elysium, which was a fine movie, but has a\ndifferent feel to it than the other 2. <br><br>The score is from Hans Zimmer. Top quality.<br><br>I would recommend you see it for yourself.\n"},
{"review": "\nHere is my review of #ChappieMovie ...I really really loved it!!! (I\nonly wish I wouldn't take that last seat in the theater which was on\nthe first row!!! My head was ready to explode) so the movie just\ncollected everything -it was funny and it was so sad sometimes ..then\nit was full of action and murders and blood ...lol but really\nentertaining and cool:)) I fell in love with Chappie))) and oh my god\n#DieAntwoord were amazing in the movie:)))) they played so good!!! I'm\ngonna listen to their songs again now:))) I remember I was a big fan of\nthem:)) overall -funny and sad and some drama and full of action:)) I'm\nreading now bad reviews on different websites but I really really liked\nit and the whole theater was applauding at the end!!!:))) #Chappie\n"},
{"review": "\nI wanted to preface this review by saying that I am a Die Antwoord fan.\nThat aside, I really did enjoy this film. This film to me is Neil\nBlomkamp's love-letter to Die Antwoord...with Short Circuit and a\nlittle Robocop mixed in.<br><br>I initially went to see this film with a friend, expecting this film to\nbe absolutely terrible (Come on, Die Antwoord in an action film?). I\nwas actually really pleasantly surprised with how deep some of the\nthemes in this film were, the special effects, and the tear-jerking\nscenes between Chappie, Deon, and Yolandi.<br><br>But unfortunately, there were some plot holes in the film, such as\n(spoiler):<br><br>If consciousness is transferred over to AI, does this include emotion\nas well? Chappie very clearly displayed emotion (such as fear, love,\nanger, etc.)<br><br>It was actually pretty entertaining to see Hugh Jackman playing a\nreligious nut-job, hear Die Antwoord's music as the movie soundtrack,\nand just overall thinking about what makes something \"human\". A really\nthought-provoking movie. Ignore the critics and go see it!\n"},
{"review": "\nSouth African director Neill Blomkamp's debut movie, DISTRICT 9,\nremains a masterpiece, and his follow-up ELYSIUM is a very good piece\nof action spectacle. Sadly, the magic isn't repeated for this, his\nthird film, an odd concoction of rehashes of old material and\ndisappointing new elements.<br><br>The first thing you notice about CHAPPIE is its familiarity. The whole\nrobot cop thing is heavily derived from ROBOCOP and the presence of an\nED-209 style robot makes it even more obvious. Secondly, the idea of a\nsentient, learning robot brings to mind the glory days of the SHORT\nCIRCUIT film in the 1980s; they were childhood favourites of mine. Plus\nthe social milieu and gangster type stuff is familiar from the\ndirector's previous films.<br><br>Sadly, CHAPPIE makes the crucial error of failing to have the\nprotagonist be sympathetic at all. The reliable Sharlto Copley does his\nbest with the voice and mo-cap work, but Chappie is just a mildly\nannoying robot, nothing more. Attempts to turn him into a gangster take\nup much of the running time, but the non-actors who play the gangsters\noveract for the most part and are very annoying.<br><br>It's a pity that this film feels so directionless, because there's good\nstuff here. The CGI effects are exemplary, as you'd expect from a\nBlomkamp movie. There's not much action, but the big set-piece climax\nis very well staged. A supporting turn from Hugh Jackman is one of the\nbest performances in the whole thing, although Sigourney Weaver is\nwasted in an extraneous part. When you sit down and watch CHAPPIE, you\nsee the framework of a part-decent movie buried beneath a lumbering and\nuneven execution, and I think that's a real shame. Let's hope Blomkamp\ncan pick it up again for his forthcoming ALIENS movie...\n"},
{"review": "\nThis isn't from a chain of production - meaning sci-fi, AI-themed or\nnot - I like to follow where so often important conundrums are what is\nexplained of them and otherwise reduced to mechanical gears that move\nforward some grand destiny or battle, but I like this primarily for its\nsmall difference. In a time of Marvel juggernauts and assorted sagas to\nsave the world it manages to stand out ever so slightly.<br><br>I like for example how we start with one of those dystopian near-\nfutures but quickly pare it down to one robot, its maker and a few\ngangsters who kidnap it to be part of a scheme. Or how questions of\nmorals and consciousness don't smack us upside the head, they're\nstirred as we go in a more or less organic way. It's from the maker who\ngave us District 9, it's the same - more or less - organic difference\nof inhabiting a corner of the room while the building shakes.<br><br>I also like to note what drives things, in cinematic terms this is to\nnote the mechanisms that give rise to images. A simple structure here:\nsomething that absorbs and imitates its surroundings, in our case a\nmechanism (a robot) but more pertinently a self, a consciousness in the\nmidst of images. It is enough to think of it with a Dickensian orphan\nin mind to quickly know it is contrived drama but it creates an\nunderstanding of consciousness, not dutiful - solid - reproduction but\nan impromptu jam that capriciously occupies the room set for it.<br><br>And this is what the filmmaker does, he absorbs Robocop complete with\nits world and conundrums, imitates it enough to acknowledge that he\ndoes - in the rival cyborg, in the grueling scene of torment - but\nflies off in his own way. It's decent work that gives off a youthful\nvibe.\n"},
{"review": "\nSadly, a movie that got almost all necessary ingredients of a good\nflick \u0096 nice modern FX, plenty of celebrity actors, hip landscapes\n(South Africa); fails to entertain.<br><br>I would say that the weakest part if the story (plot) \u0096 it just doesn't\nmake any sense. It feels that the movie was made for 14-year old, for\naudience that wouldn't question any episode. <br><br>It's totally fine to make silly movies, but you cannot do it half-way \u0096\nthen it's neither serious, nor hilarious. \"Chappie\" is half-silly,\nhalf-realistic, making it very boring. <br><br>Story lacks creativity, seriously. Almost everything that ever happens\nin the movie \u0096 is borrowed from other movies. <br><br>Don't expect much when you watch this movie, don't repeat my mistake.\n"},
{"review": "\nA genuinely original sci-fi story. I've not been moved this much in a\nlong while. The basic premise may seem tired and overused but you will\nsoon find yourself surprised at how human the story is. Neill, much\nlike he did with District 9, absolutely captures the human condition\nfor those with a heart for outsiders, misfits, and the downtrodden. I\ncan't recommend this film enough. If you're not brought to tears by the\nfinale, I feel sorry for you. Since the ignorant AI of IMDb seems to\ndecide whether a review is complete by the number of lines submitted I\nsubmit for your approval That Chappie Is A Marvel Of cinematic\nstorytelling. I can't wait for Neills Alien.\n"},
{"review": "\nI saw an advanced screening in Atlanta, Ga. Visually Blomkamp is very\nconsistent. his films all capture a grungy side to scifi.. one of the\nbest comparisons to his work could be equated to the visual style of\nthe first \"Alien\" Film. Everything looks functional or appears to have\na purpose even if not used by the cast. The characters are compelling,\nand the over arching message of the film is not lost (as seen in\nElysium). Hopefully this is a commercial and critical success. It is\nvery deserving of a 2nd viewing. I look forward to renting when\nreleased on bluray. first act was engaging and didn't seem slow or\npandering to anyone seeking \"content\". final act of the film keeps you\non the edge of your seat! Sharlto Copley does a great job of making us\nempathize with his character- Chappie is an endearing, and deep\ncharacter. Another mention-able cast member is Yo-landi Visser. She\nbrings a surreal presence through her character. Also, Hans Zimmer's\nscore was righteous!\n"},
{"review": "\nI decided to watch this movie as it had one of my favourite directors\nin it Neill Blomkamp, the director of Elysium and District 9. This\nmovie stars Sharlto Copley as a police robot named Chappie who has been\nprogrammed with a consciousness, Hugh Jackman a jealous and disgruntled\nemployee of Tetra Vaal, Dev Patel as Chappie's 'maker' and the group\nDie Antwoord as Chappie's parents.<br><br>The movie is sweet and does not skimp on the action either with an\neventual face off between AI and another manned Mech. the only dislike\nI had was that there was little in the way of plot outside of Chappie's\ndevelopment (Why Deon was not given permission to do what he did for\nexample? Like instant billionaire creation), but other than that this\nmovie was a must see of 2015.\n"},
{"review": "\nStarted out well but the characters were never developed. Jackman and\nPatel seemed like cameo appearances.The bad guys were a cliché' group\nwith your main ones having a set of morals in a way even though they\nseemed to want to kill Patel with no remorse. I realize for the sake of\ntime we cant get to involved details like SECURITY of a multi-billion\ndollar company ...but cmon. People taking equipment, lock keys, going\nin and out like its a public facility. And the bad guys/good guys (\nhazy line here ) kidnapping Patel then letting him come and go as he\npleased..... And the robot forms a sense of morality with one child's\nbook and an episode of He-Man....REALLY. On the plus side the robot was\nreally good. <br><br>I only finished watching it because I invested 20 min already.\n"},
{"review": "\nAnd also exciting. The way that this movie connects you with their\ncharacters, and how you get so involved that you forgot that we are\ntalking about fiction and you believe it's real, you believe in robots,\nyou believe in criminal with kind heart and in Chappie as you personal\nlittle friend. On the other hand and in a major plus, we have this\namazing musical duo in the middle playing.. well.. just them. The music\nthat they bring to us, gives just the correct amount of perfect\nemotions for each scene (specially at then end, mi personal favorite)\nIf you get angry,laugh, and cry.. all in a single movie.. then you know\nyou have a great product in front of your eyes.\n"},
{"review": "\nSo.. Because of the critics giving this film such a bad write up i have\nsteered clear of this film for a while. Thanks \"critics\" for making me\nwait so long to see a wonderful heartfelt film about a robot who\nbecomes \"conscious\". It is a cross between Robocop and Short Circuit\nand what makes it so great is the human characteristics Chappie learns. <br><br>I hate spoilers so I'm keeping this short and sweet. The acting was\nspot on, it was a well paced film and Hugh Jackman was excellent in a\nsupporting role.<br><br>If you like Sci fi films I highly recommend this. It's gritty, fun and\nat times its quite emotional. An easy 8 stars out of ten from Mr\n"},
{"review": "\nI'd missed this film, but took a chance on it given the names involved\nand was very pleasantly surprised. It is a good film - entertaining,\nclever and just a hint of something to say. I totally fail to\nunderstand why is has had such bad reviews.<br><br>There is a strong feel of District 9 about it - and that was a great\nfilm, and if you liked that you will like this too.<br><br>Yes, the bad guys are stupidly - stereotypically - bad, and the\nbackground story of promising young star being undermined by the\njealousy of the older guy who has been pushed aside is hardly new, but\nits well done and I could point to dozens of \"better\" films which are\nfare more predictable.<br><br>The core story, however, is very neatly done, with some originality,\nhumour and feeling. Overall I was pleased to have spent a bit under a\ncouple of hours with it.\n"},
{"review": "\nAfter reading loads of horrible reviews on this movie and my son's\nopinion after watching it in the theatre I never thought again of\nwatching it, although that I am a fan of Blomkamp's previous work AND\nof Die Antwoord. Still, If i'd think about Ninja and YoLandi acting it\nwould make me cringe.<br><br>Anyhow my wife talked me into watching it just because she wanted to\nsee YoLandi busy making a fool out of herself. so we both started\nwatching expecting it to be utter nonsense and in a way it was, but it\nwas good nonsense ...<br><br>I was entertained throughout the movie and I can see why it get's bad\nreviews. The thing most people don't see is that this movie is a joke,\nit's not meant to be serious. It's a Comedy above all other genre's and\nI thought it was brilliant. The (to be expected) terrible acting of\nNinja and YoLandi made it even more funny.<br><br>On top of all the great humour the shooting and Sci-fi CGI is really\ngood and I did feel sorry for the robot at times, The movie totally\nworked on me and my wife and I think it's worth an 8/10.<br><br>So if you have a weird sense of humour and a keenness toward sci-fi and\nmaybe Die Antwoord you should definitely see it !\n"},
{"review": "\n\"Chappie\": This was actually something I was really looking forward to\nand I'm such an optimist whenever it comes to most movies, maybe that's\nwhy I ended up liking \"Chappie\" when the word of mouth on it has been\npretty bad. I have this weird love/hate relationship with this director\nthough, I will say. With both \"District 9\" and \"Elysium\", they are\nsomehow simultaneously extremely ambitious and have some real original\nideas to them while also being extremely flawed; borrowing from things\ndone before in films, as well as suffering from predictability, the\nsame can be said for \"Chappie\". It is somehow a strange combination of\n\"Short Circuit 2\", when Johnny 5 joins the Los Locos gang, and the\noriginal RoboCop film; the director simply ran with that idea and had a\nreal fun time with it. I thought that the characters, for the most\npart, are very likable. I was actually invested in the Chappie\ncharacter, I wanted him to make it through with his \"family\". The\naction scenes were well choreographed, brutal, and definitely shot much\nbetter than \"Elysium\". There was a moment at the end where the film did\nlose me because it did seem like it was trying to promote a couple of\ntheir leads that have their own music career in Africa right now and\nthat annoyed me a bit. Overall, I thought that this was a pretty fun\nscience fiction flick with a true hard \"R\" rated tone. Unfortunately\ndon't see a whole lot of that nowadays so I have to give the director\nsome recognition for that at least.\n"},
{"review": "\nI saw the high rating on IMDb and gave this movie a shot. The trailer\nlooked decent and reminded me of good action scenes in District 9. I\nwanted to leave while watching the movie so many times. I kept waiting\nfor it to get better, but it never did. Chappie, the crappie, the\nrobot, gains sentience. He can think for himself, though he starts out\nlike a child that must be taught everything. This is the core of the\nmovie. Clearly, the writers meant to create a sweet metaphor about the\ntribulations of growing up, but what they created was two hours of pure\ncinematic torture. The acting, plot, and action sequences were often\ncringe inducing, not to mention laughably illogical and ridiculous. I\nseriously can't imagine how anyone could enjoy this movie. The\nconsciousness BS is also disturbingly shallow, but enough said. Some\npeople watch sci-fi films for the CGI and special effects, instead of\nthe ideas. If you're one of them, you may like this trash. Otherwise,\nstay away. Shame on you Neill Blomkamp. You let us down in many ways.\nMinus many stars for wasting, insulting exceptional talent. 4/10 only\nfor amazing production values and CGI. Everything else is garbage,\nincluding the choice to have Chappie's AI \"learn\" in a totally absurd\nmanner.\n"},
{"review": "\nHis voice, accent, and mannerisms makes him completely unlikable.<br><br>It makes him seem like a complete and utter buffoon. An unintelligent\nclown, almost as cringe worthy as Jar Jar Binks. They intended for him\nto be cute and precocious in a child-like way, and failed miserably.\nHe's annoying as hell and I lost all empathy and connection to the\ncharacter. The fact that he had a muddled and unfocused character arc\ndidn't help matters either.<br><br>I can't think of too many examples of robots/AI in stories that have\nbeen given human qualities or the ability to speak, and NOT care about\nthem. Usually they are endearing.\n"},
{"review": "\nIf I could vote with 20 points I would do it deliberately. This one\nreally got me on the \"right\" food. I mean I was lately disappointed by\nthe sci-fi genre and asking myself \"when will we see again a real good\nsci-fi movie surprise like in the old days, when \"Alien, 1979\" hit the\nscreens by surprise and within a decade (the 80ies) one hit after the\nother followed.<br><br>Well, and then came Chappie!<br><br>Chappie: Starting firstly like a version of the good old robot movie\n\"Short Circuit, 1986\" or its sequel from 1988, good but not yet\nspecial, then suddenly the appearance of world class actors like \"Hugh\nJackman &amp; Sigourney Weaver\" hit the screen, but the director manages to\nkeep them subtle in the back ground so that they don't steal the show\nto the main actors: Namely the robot inventor \"Dev Patel\" and the\nbad-but with a good heart-guy \"Ninja\". The story develops quickly and\nisn't one single minute boring. As it advances it becomes melancholic\ndramatic sad components but never leaves the action and the thrill out\nof sight. And then it even picks up a quite philosophical thematic and\nsolves it brilliantly: namely will our consciousness one day be\ntransferred to machines or robots? <br><br>Deducting the answer from current progress in computer and AI science\nsome of us are convinced that this \"next level\" step will be done, we\njust are at the moment afraid to admit it to ourselves. Not that the\nregular human life form will disappear but a coexistence will be the\ncase. Just like the good old vinyl discs that are still turning on the\ntable. Human &amp; Robots and Robo-Humans will coexist together happily and\nforever thereafter.\n"},
{"review": "\nSet in a future in which police robots are the norm, three criminals\nkidnap one such robot and his inventor, hoping to reprogram the machine\nto work for them in this thriller from 'District 9' director Neill\nBlomkamp. There is, however, a lot more going on in the film than just\nthat; it turns out the inventor has managed to make the robot sentient\nand self-aware. The robot also has a damaged battery that cannot be\nreplaced, so his lifespan is limited. And then there is a rival\nsecurity worker out to sabotage everything. The film undergoes some\nwild changes of tone and mood while juggling these plot threads; we are\npositioned to laugh at Chappie imitating gangster talk and throwing\ninnocent citizens out of their cars, but then the film also begs for\nserious contemplation on artificial intelligence and how environmental\nfactors determine personality! It is an odd mix to say the least, but\nthere are several superb bits, like Chappie's activation where he\nemerges like a frightened animal. There is also something pointed in\nhow the three gangsters are all gradually softened by the robot and\neventually end up treating it like their own child. This agenda is not\nat the forefront of the film as much as it could have been though, and\nas exciting and well coordinated as the action sequences late in the\npiece are, they forgo the complexities of a robot learning to feel\nprotective of his caregivers and vice versa. Whatever the case, the\nfilm has some magnificent motion capture special effects and offers\nample food for thought even if it is not quite all one might hope from\nthe director of 'District 9'.\n"},
{"review": "\nI thought this was a touching and colorful film and in fact I am\nplanning to purchase it. I am amazed by the ugly reviews that came up\nwhen I searched for the title.<br><br>Just because a film is not what one expected or imagined, does not make\nit a bad film. I feel sorry for the people who bias themselves\nimmediately in that way and therefore miss out on things that are\nbrilliant, unique, or noteworthy. <br><br>I was glad to see that so many others said the same. ET was only a\ntimeless classic that I know my kids and their kids and so on will see.\nSo to have had that comparison made isn't so bad.<br><br>I thought it was worth watching more than once\n"},
{"review": "\nI'm a huge fan of Blomkamp as well as Die Antwoord which is why I\nsuffered through this film. <br><br>This is RoboCop. But RoboCop is better. So watch that instead. This\nfilm adds nothing. <br><br>Characters are paper thin. It's story-driven but with a weak story. The\nbits about AI and Chappie getting his own consciousness isn't explored\nenough for it to be interesting.<br><br>The music is good. It's Die Antwoord. So you can't go wrong there. It's\npretty. The locations are cool. And the fight scenes are cool. But\nRoboCop is better. Just watch RoboCop instead.\n"},
{"review": "\nIn my opinion, this movie is disappointing. But, this does not make it\na bad movie.<br><br>Having watched trailers, I created some expectation. The Asimov- esque\npremise had a lot of potential to create deep characters and\ninteractions. These hopes for an enthralling storyline were dashed in\nthe first half hour by almost every characters' clear lack of common\nsense. In the first half hour of movie this reached a point that it\nactually broke my immersion. I'm not sure why, I still kept hope for a\ngood plot, but the movie just defaults to the \"do what is right,\nprotect the ones you love\" cliché.<br><br>So, why watch this? <br><br>Because, despite its flaws, it has strengths. The character \"Chappie\"\nis very much different from what is today's cookie cutter protagonist.\nAnd even if the story is shallow, it feels complete, without any\ncliffhanger meant as hooks for a sequel or plot holes.<br><br>If you are looking for movies with AI, there are better ones out there\n(I, Robot and Ex Machina come to mind), but this movie is still a good\nbet when you want a cinematic \"light snack\".\n"},
{"review": "\nAfter seeing \"District 9\" and absolutely loving it, Neil Blomkamp is a\ndirector I've lent a devoted following to. Unfortunately, due to the\nincessant negativity this film received by critics, I decided (wrongly)\nto give it a miss at the cinema.<br><br>I caught it \"free on demand\" on cable the other day, and was kicking\nmyself that I didn't give it my support at the cinema. It seems all of\nBlomkamp's films have underlying metaphysical, and sociopolitical\nthemes and commentary to them. For me this gives his films far more\ngravitas than the other vacuous tripe Hollywood churns out.<br><br>On the face of it, \"Chappie\" is a great action movie, with elements of\n\"Robocop,\" \"Short-Circuit,\" and \"Blade Runner,\" but it also ponders\ncontemporary issues such as our increasing reliance on Artificial\nIntelligence and robots, corporate corruption, militarization of the\npolice, and the negative influences on our easily impressionable youth.\nIt was a movie about compassion, and the great loss society suffers\nwhen it can't save its children from poisonous familial and social\nenvironments. But it also had loads of awesomely directed action, and a\ngood amount of humor.<br><br>I'm definitely not saying Blomkamp is subtle or overly poetic in his\napproach or style in relaying his philosophical themes, but, for me,\nit's entertaining; close in thudding style to Paul Verhoeven.<br><br>Overall \"Chappie\" is an extremely sweet movie with a ton of heart. I\njust hope it's lack of financial and critical success doesn't\nnegatively affect Blomkamp's career, as I think he's an important\nfilmmaker with a lot to say. And he says it within the framework of\neasily digestible and entertaining sci-fi action flicks, which I love.\n"},
{"review": "\nThe reviews were accurate. This film was all over the place. Never mind\nthe disregard of logic, the unrealistic bad guys, and ideas lifted from\na certain Peter Weller movie, this film simply lacked focus. This film\nhad promise and definitely could've been done better.<br><br>On the plus side, there were some good action scenes and some great\nspecial effects. And the depiction of the computer interface was\nrealistic. It used textual input and output, rather than that slick,\nfar-fetched 3D graphics we saw in the Iron Man films or the recent\nSpider-Man films. Finally, there were some really funny scenes, albeit\nunintentional, but funny nevertheless.\n"},
{"review": "\nWhat happens when robots gain consciousness, and able to interpret\nemotions and behave like the humans, we have seen many movies on the\nrobots in the force and things gets messy when its creator come to know\nthat they are gaining control over them and then there you see the war\nbetween the robots and its maker, this seems so obvious in most of the\nmovies where robots are in the lead but, 2015 release 'Chappie' is\nquite different and truly makes you to like that robot as much as you\nget to know about it in its phase of growing or you can call it as\nevolving/adapting whatever!<br><br>This science fiction is bit out of the box concept that has a good\nsubject to present with, the best part of this flick is the way how\nthat character Chappie is been crafted, as it gains its human cognitive\nabilities by its master and gradually try to get along with human\nbehaviour and try to adapt all those new skills, practices that it is\nexposed to, the designing of Chappie is very much exiting the\nartificial intelligence and consciousness transformation all these\naspects are the relevant subjects in discussions, this movie wins in\nits proper executing of such sophisticated concept in very appealing\nway, plot could had been bit more modified but fine to level.<br><br>Performance wise Dev Patel steals the show with his spellbind acting\nabilities, all the way in the movie he never seems to be weakened, Hugh\nJackman as a bad man, tough guy seems appealing, overall its fun\nChappie makes you laugh, makes you cry and totally holds you in that\nflow.\n"},
{"review": "\nFirst of all spoilers. It was a great movie. But in many ways it\nrepresents to much of the movie \"district 9\" of which are the same\ndirectors as this movie. And not just the City, And highest paid actor\nbut also parts of the story how someone is put in a position where he\ndoes not know or understand anything around him. But all in all it is a\ngreat movie. With a good ending, Although I find that the M.O.O.S.E\nwhich Vincent Moore (Hugh Jackman) tries to promote is a great waste of\ntime. Since the only need for human controlled robots is a step\nbackward from AI robots which can still be remotely controlled by\nhumans except they don't need to control it action by action but only\nthe key commands need to be given. And if the only reason you work in a\ncompany is to do a doomed project which has no hope of being mass\nproduced since it is behind the technology which is already being\nproduced. Either tell the guy to begin a new project or fire him. Stop\ngiving him false hope till he does the crazy things like in the movie.\nBut it is still a good movie which you should watch.\n"},
{"review": "\nWhen I first learned of this movie coming to theaters, I was excited\nabout it, seeing that I had admired director Neil Blomkamp's \"District\n9\". Then the largely negative and brutal reviews came out, and that\ncancelled my plans to see it in theaters or to pay any money to rent it\non video. But when I came across a DVD copy of it at my local library,\nI decided to give it a look, seeing that I would be able to watch it\nfor free.<br><br>After watching it, I am kind of puzzled by why the movie got an\nextremely hostile response. Yes, the movie is not perfect; it has some\nflaws, some severe. The script steals some ideas from other movies,\nmost notably \"Robocop\" but even Blomkamp's \"District 9\". The various\nhuman characters are those that we have seen many times before, from\nthe cold-hearted female executive to the soft-hearted girlfriend of the\nmain criminal character. However, the biggest problem with the movie is\nthe character of the robot Chappie. When he starts to speak and commit\nactions, he often comes across as a robotic version of Jar Jar Binks -\nannoying, in other words. I know that Blomkamp was trying to show\nChappie was a learning and easily manipulative artificial life form,\nbut I think he could have portrayed this in a less sledgehammer style.<br><br>Despite flaws like those, the movie does deliver in some areas. The\nspecial effects are very good for the most part; you'll really feel\nthat Chappie is a true mechanical yet living object. The action\nsequences have some genuine excitement. And while the movie runs two\nhours in length, there are no slow or boring parts; the movie really\nzips along.<br><br>The verdict? Well, as I said, there are some severe flaws in the movie,\nbut I don't think it's downright terrible. I would recommend you wait\nto watch the movie when you are in an uncritical mood and have the\nopportunity to see it for free, as I did.\n"},
{"review": "\nIt came as a little surprise. Obviously I was looking for this film,\nbut not expected to reach at this level. The film was really brilliant\ndespite the influence of plenty of other films. Yes, the ideas were\nborrowed from the movies like 'Short Circuit', 'I, Robot', 'RoboCop',\nReal Steel', \"Bicentennial Man', 'Transcendence', et cetera. But that\ndid not bother me at all. I would call it an inspiration to make a new\nproduct out that already existed.<br><br>It was not completely depended on Dev Patel's role, otherwise woulda\nbeen a disaster. Its the Hugh Jackman, even though his character was\nnot on the frontline, because of his presence, the movie was filled\nwith some exciting and thrilling moment. His role was pretty much same\nto 'Real Steal', but showed in a different shade.<br><br>Silly concept, even dialogues were so stupid. I don't know, maybe\nbecause of the South African accent. But the screenplay was very good.\nFast and gets the point quickly than wasting time for buildups. One of\nthe best robot movie and it will be remembered. Looks like the sequel\nwill be more furious and going to be an action packed item, if there\nwill be one. Worth to watch it at least once.<br><br>7.5/10\n"},
{"review": "\n'C H A P P I E'<br><br>A very weirdly endearing film about robots, artificial intelligence and\nthe consciousness! The last few minutes of the film makes it into a one\nof the most obvious and the most important metaphor ever.<br><br>Your legacy lives in the history through your present and the future!\n'Chappie' becomes a film about a robot whose 'mind' is altered in an\nexperiment and he(it) is given the 'consciousness'.<br><br>The new 'baby'-'learning'-'aware' robot-entity starts to learn and\nfeel. It (he) starts to understand and experience love and affection.\nHe develops a sense of morality and ethics which are ultimately\nchallenged when he is put in a violent situation where he has the break\nthe very same ethics to save the one he has come to love! Later his\nawareness comes to his help when he is about to die. He does something\nso simple and yet so powerful that it moves you!<br><br>'CHAPPIE' - a what a great concept of a film with super performances\nand exceptionally cute and human story! It is ironical that a film\nabout a robot is so humanistic! And this is the 'metaphor' I am talking\nabout. The film has some really, really high class CGI and humor. An\ninherently and violent film in its nature, it ends up being a film\nabout love and 'belonging'.<br><br>BTW the film has some really, really awesome music!<br><br>I would say it is a must watch!<br><br>My ratings: 8/10\n"},
{"review": "\nI don't recommend to come to this movie with hight expectations , hell\nto even not with medium . This movie seem to have it all , great\nDirector for the genre , a couple or three nice actors and almost an\noriginal plot. I saw Elysium and District 9 and was very excited for\nthis movie to come out. After 30 mins in the movie i realized that the\nplot is going nowhere into a typical action flick , Dev Patel Hugh\nJackman and Sigourney Weaver worked very hard to keep me watching but i\njust couldn't take it anymore because of these total bad acting two\nactors that were taken from some musical duo or something . The plot is\nnice but the script is lacking some reasonable information , some\nactions taken by the characters are totally random and stupid . To sum\nup i would say that this is an average action flick that trying to be\nsmart , to be honest i prefer Elysium like 23 times more than this\nmovie.\n"},
{"review": "\nThe acting was pretty all right. Dev Patel looks quite grown up from\nthe last time I saw him - which was in Slumdog Millionaire, and he did\ngreat. His expressions and his delivery was very convincing of someone\ncapable of creating artificial intelligence. Jackman and Weaver did OK;\nthey played characters that they're pretty much used to with Jackman as\nthe tough guy and Weaver as the one in control (though she doesn't get\nmuch screen time). Yo-Landi, Ninja and Jose Pablo Cantillo (who plays\nYankie) played a group of gangster like thugs and I guess they did well\nin their roles.<br><br>On that note, I really do not get the purpose of all the gangster thug\ncharacters. Is this a depiction of what Johannesburg is like? Because\nif so, that is pretty concerning. That was my main issue with the film.\nIt has a lot of violence and aggression and I am not the type of person\nwho likes that kind of thing. I mean they could have made an even\nbetter film with Chappie in a different context. Well I guess the\npolice robot force thing works, but I feel that there need not have\nbeen so much thug life and violence involved.<br><br>Also, the ending was very surprising for me. I wouldn't want to have\nthe same thing happen to me, but the film does raise questions of life\nand living. I am interested in knowing how they continue to live after\nthe end of the film. The only great thing in this film is the\nconnection between Deon and Chappie.<br><br>Overall an intriguing concept with good acting but too much masculinity\nand unnecessary violence.<br><br>Read more movie reviews at: championangels.wordpress.com\n"},
{"review": "\nI'll begin by saying I'm a fan of District 9, it's one of my favourite\nsci-fi movies of this century so you can imagine how excited I was when\nI heard there was another movie out by the same director. I'll admit,\nperhaps my high expectations have somewhat clouded my opinion of\nChappie because District 9 set the bar so high. However, that doesn't\nchange the fact that I had to watch Chappie in bits and pieces over the\ncourse of 2 weeks because every time I decided to give it another\nchance, within a few minutes there was a scene which was so\nimplausible, or badly written, or poorly acted that I was forced to hit\nthe stop button again. <br><br>That pattern continued for the first 1 hour 30 minutes, playing a few\nminutes, stopping, then resuming a few days later. The first three\nquarters are just littered with problems, including mediocre acting,\nimplausible scenarios, poor scripting and questionable casting. The\nrobot CGI is excellent though from start to finish. <br><br>But I was relieved to find that there came a point when the movie\nactually improved significantly. The last 30 minutes we have a pick up\nof pace and the show closes very well indeed so overall it was worth\npersisting and finally reaching the end (although I did ask myself\nseveral times whether I would ever get there). <br><br>Worth watching for the excellent grand finale, just don't expect a\nmovie on the level of District 9.\n"},
{"review": "\nOn the whole Chappie came across as annoying. It really doesn't follow\na true principal of AI - learning should have been exponential rather\nthan the robot just acting like a kid for 90% of the movie.<br><br>This is definitely not District 9 or Elysium, both I enjoyed a lot,\nthis just lacked something. None of the main characters were very\nlikable.... but the nuances of South African gangs might be lost on me\nif this is at all a accurate representation.<br><br>This is a watch if there is nothing better and you're in the mood for a\naction/street gang movie. If you're looking for an AI movie, go watch\nEx Machina if you're looking for a street crime sci-fi Dredd is\nprobably better (imo).\n"},
{"review": "\nChappie (stylized as CHAPPiE) is a 2015 American science fiction film\ndirected by Neill Blomkamp. The screenplay, written by Blomkamp and\nTerri Tatchell, is based on Blomkamp's 2004 short film Tetra Vaal.[5]\nThe film stars Sharlto Copley, Dev Patel, Jose Pablo Cantillo,\nSigourney Weaver, Hugh Jackman, and Watkin Tudor Jones (Ninja) and\nYolandi Visser of the South African zed rap-rave group Die Antwoord.<br><br>The film premiered in New York City on March 4, 2015 and was released\nin U.S. cinemas on March 6, 2015. The film grossed $102 million\nworldwide against a $49 million budget. At the review aggregator,\nRotten Tomatoes rated it 31%, and Metacritic rated it 41/100.<br><br>Spanned / Good recorded / Intriguing story\n"},
{"review": "\nBased on Neill Blomkamp's 2004 short film Tetra Vaal, 'Chappie' is An\nInteresting Idea, Made Into A Decent Film! I loved the concept &amp; also\nsome of its strikingly done graphics, but, the Writing leaves something\nto be desired. Better Writing was needed, to enhance the overall\nimpact!<br><br>'Chappie' Synopsis: In the near future, crime is patrolled by a\nmechanized police force. When one police droid, Chappie, is stolen and\ngiven new programming, he becomes the first robot with the ability to\nthink and feel for himself.<br><br>'Chappie' takes a look at a future, that's bleak but also interesting.\nBlomkamp &amp; Terri Tatchell's Screenplay is superbly innovative &amp; offers\nsome terrific moments. The bonding/rivalry of its human characters with\nthe A.I robots is interesting to watch. I also loved Chappie's\ncharacterization. But, the Writing slips at times. The second-hour, in\nparticular, loses steam &amp; the climax needed to be sharper. The Writing\nisn't as sharp as its concept &amp; that too an extend, disappoints. <br><br>Blomkamp's Direction is impressive. He's handled some of the most\nintense sequences, aptly. Cinematography is perpetually focused.\nEditing is slightly loose, especially in the second-hour. The Graphics\n&amp; The Action-Sequences are mind-blowing. Art &amp; Costume Design are\ndetailed. Hans Zimmer's Score is brilliant.<br><br>Performance-Wise: Sharlto Copley as Chappie, is stupendous, delivering\na strong voice &amp; motion capture performance. Dev Patel is in terrific\nform. He's done very well. Ninja, Yolandi Visser &amp; Jose Pablo Cantillo\nare adequate. Hugh Jackman hams. Sigourney Weaver is wasted. <br><br>On the whole, 'Chappie' has its share of highs of lows. Not Perfect,\nbut Not Bad either!\n"},
{"review": "\nUpfront, I didn't really love it. It's a fairly well-made movie and a\ndecent story, so I expect plenty of people will like it more than I\ndid, but I thought it was a bit lacking in substance. I really liked\ndistrict 9 and expected more. I know an hour and a half isn't much\ntime, but it's development certainly felt rushed to me, even for a\ntheme you've seen in sci-fi 100 times before (\"What is consciousness?\nWhat is it to be human?\") <br><br>Hugh Jackman is an odd choice as the protagonist (and seriously, what\nis that haircut?). The story is very oversimplified, the ending feels\ncontrived, I'm not really sure why Sigourney Weaver is in this movie\nand Dev Patel was better in Slumdog Millionaire. <br><br>Yolandi from Die Antwoord wasn't great, but better than I thought she'd\nbe. Ninja wasn't as good, but did fine. Their compatriot was as good a\nstereotype as any (although the way they folded the band's images,\nlogos and music into their characters was odd and distracting,\nespecially to people who know them from it.)<br><br>Overall, not what I wanted it to be, but some people loved it. Judge\nfor yourself.\n"},
{"review": "\nLOTS OF SPOILER HERE. I'M SERIOUS.<br><br>The plot. I expected more from the plot. It's a Swiss cheese...<br><br>The company is filled with cameras, but with no security department...\nTherefore Sigourney Weaver has no clue whatsoever of what goes under\nher nose. And the feeling you get is that she went out of the city on\nbusiness, because she only gets back at the end of the movie.<br><br>Wolverine puts a gun against Slumdog Millionaire's face and none of\ntheir coworkers denounces the incident to their superiors (not to\nmention that everybody is OK with a guy carrying a gun in an office).<br><br>Chappie is cool from the beginning about being a robot. Self awareness\nis really not an important issue to him (until he gets a Molotov\ncocktail on his back and, later, checks for damage). Chappie's learning\nprogress must have caused lots of laughs to AI, robotics and pedagogy\nstudents.<br><br>Chappie is stolen from Slumdog by Die Antwoord but nobody in the\ncompany misses the device. And neither carrying piled dead bodies nor\nuranium inside the van would matter to the security cabin men from the\ncompany.<br><br>Chappie drains Wikipedia when he goes online before assaulting the\narmored car, but he still has no clue of what happens to the security\nmen stabbed and hit by shurikens. Or about what and why is that red\nliquid oozing from their bodies.<br><br>Wolverine finally brings ED 209 from Robocop back to life. You expect\nthe bulky robot to go berserk and destroy the walls to get out of the\nbuilding, but it takes of through a whole in the ceiling like a feather\nweight fairy.<br><br>Consciousness transfer: Cool!<br><br>Consciousness transfer helmet's electrodes (made for humans) working on\nChappie's head: Not cool! <br><br>It could have been a way better movie if the director had paid\nattention to these details IMHO. The premise is great, Chappie's CGI is\nflawlessly fantastic. <br><br>If it wasn't for those problems, this movie could have been epic...\n"},
{"review": "\nSeeing this movie I thought it would be a mind blowing experience like\nDistrict 9. Since the director made that and Chappie but I got a little\nhesitant because it didn't get a good response on rotten tomatoes. The\naudience seemed to like it though and I thought it was good and had\nsome potential. This pretty much has the same motif of giving machines\nthought and feeling. This time in the movie it takes place in the near\nfuture of South Africa. Where the police force uses these scout droids\nto help them with their work. The guy who made them, Dion, played by\nthe Slumdog Millionaire kid and tries to give one of the scout droids\nthought and feeling. He also gets attacked by some criminals and they\nkeep the robot in some abandoned warehouse. The criminals also give him\nthe name Chappie since he's a friend. There also is the other guy,\nplayed by Hugh Jackman that wants to use his military robot for the\npolice but it's too big and scary. Also looks more like a military\nrobot instead of a police droids. There's also some twist and turns as\nwell as some shocking moments too. I think the director was trying to\nhard for it to be like District 9 at times.\n"},
{"review": "\nSo, f-f-f-folks - I'm seriously asking myself - What, exactly, was\nformer Vancouver Film School student, Neill Blomkamp trying to tell me\nhere with his latest Sci-Fi offering - Chappie? <br><br>Was he trying to tell me that even in South Africa it was the whites,\nnot the blacks, who were the nastiest, most ruthless (and most\nlaughably tattooed and hair-doed) criminals of all? <br><br>And, was he also trying to tell me that he was (in the incarnation of\nChappie) desperately looking for a surrogate \"mommy\" (whether she was\nof flesh and blood, or not)? <br><br>Anyway - I'd say that this brain-dead, Sci-Fi clunker about a robot who\nwas part neurotic child (duh!), part bad-ass crack-head (double duh!),\nand part \"WTF!?\" idiot (triple duh!), literally, scraped the absolute\nbottom of the barrel when it came to its totally tiresome and truly\npredictable storytelling.<br><br>This poorly-conceived, $50 million production was so obviously geared\nto a juvenile mindset (even though it was restricted) that I was\nactually surprised to find out that Disney Studios didn't have their\ngrubby, story-ruining fingers in this messy, little Chappie-pie.\n"},
{"review": "\nI want my two hours back.<br><br>I went into this with an open mind. I hadn't read any negative reviews,\nin fact I hadn't read any reviews before watching. I loved District 9,\nand enjoyed Elysium. Charlie, unfortunately, is nowhere near the\nquality of Neill Blomkamp's earlier outings. The story-line is beyond\nimplausible, some scenes are so bad that it kicked me out of the story\ncompletely, which is never a good thing when watching a movie that\nrequires you to suspend your disbelief. <br><br>Hugh Jackman and Sigourney Weaver are completely wasted in this movie.\nBoth seem to be giving only the bare minimum attempt to breath some\nlife into their one dimensional characters. But the worst moments are\nwhen Watkins Jones (\"Ninja\") is on camera. His scenes play out like a\nSNL parody. <br><br>Two stars for decent effects, but a one star script and cast.\n"},
{"review": "\nThe critics are very wrong about this film. I believe the story is a\nfantastic step into the nature / nature debate, but for Artificial\nIntelligence (AI). The central characters are unusual, but also provide\na pared down view of our social drivers and survival instincts. Daring,\nthis is a film for which I would be keen to see a sequel which\nchallenges our views on sharing our world and what discrimination could\nlook like in the future if we walk towards technological breakthroughs\nwithout our eyes wide open.<br><br>Most AI stories require a maniacal super villain... Here, Chappie has\npeople driven by normal, sometimes immoral, drivers.<br><br>Loved it.\n"},
{"review": "\nThe first time I watched it I missed the first 10 minutes, and halfway\nthrough I really didn't know what I was watching. Sci-fi? Action?\nComedy? By the end I knew that it had affected me, hugely, permanently.\nAnd that it was a masterpiece. Not in the cold way that say, Apocalypse\nNow presents itself as a masterpiece. I mean in its utter humanity.\nIt's so open to giving that it doesn't care at any point if its\n(invisible to me, anyway) flaws are exposed. It bravely expresses\nitself even if it \"could\" be taken differently than intended, and\neasily ridiculed by those indifferent to it. Just like the lead actors\nthemselves and the characters they play - they're beyond committed\nhere. Some of the characters undergo a transformation in the movie,\nsome are a gift to humankind from the get go. I haven't been able to\nget out my head the quality and emotional depth of the performance from\nthe person who plays Mommy. On my second viewing I knew who the\nnew-to-me two leads were, those after the well-known Dev Patel and\nSharlto Copley. Throughout that second viewing some of the set design\nand a bit of the costumes used sometimes were there and could have\nreminded me who those two people were, and taken me out of the movie.\nAnd it didn't matter at all, even if I saw it it didn't distract me\nfrom the movie. Thinking of all the bad reviews this movie gets, I was\ngoing to say something mildly critical about the associated reviewers,\nbut Chappie wouldn't do that, so I won't, either.\n"},
{"review": "\nChappie. Chappie, Chappie, Chappie. What to say about Chappie? I've\nbeen trying to form an opinion since watching the film and so far I'm\nmore up than down (despite it's rough go at the box office and poor\ncritic response). Oh, how rude of me, for those of out there wondering\nwhat in the heck is a Chappie, here's a trailer:\nhttp://www.mockfilmsblog.com/2014/11/chappie-2015.html.<br><br>Director Neill Blomkamp's (District 9 (2009)) latest, tells the story\nof a robotics genius Deon (Patel), who has revolutionized the police\nforce of South Africa with the creation of robot officers. On the verge\nof a bigger breakthrough in Artificial Intelligence tech, Deon steals a\nbot ready for the junk heap, to test out the new software. Enter a\ngroup of hooligans who have bigger plans of using the robot\n(affectionally named Chappie) in a robbery. Finding that the robot's\npersonality is that of a developing child, Chappie is torn between what\nis right and wrong when the conflicting influences of his creator and\nhis captors begin to contradict one another.--<br><br>Continue reading at: www.mockfilmsblog.com/2015/08/chappie-2015-r.html\n"},
{"review": "\nConcerns over the use of drones to kill people and the use of military\nequipment by police make Neill Blomkamp's \"Chappie\" more relevant. The\nuse of an all-robot police force recalls \"RoboCop\", while the concept\nof a droid who has human qualities brings to mind \"Short Circuit\" and\n\"AI: Artificial Intelligence\"*. Although some scenes in the movie come\nacross as silly, I interpreted it as a warning about over-reliance on\ntechnology for law enforcement. The South African setting makes sense:\nfour decades of institutionalized racism gave way to one of the highest\ncrime rates in the developed world.<br><br>In the end, I recommend the movie. It's understood that Chappie simply\nwants to be able to live like everyone else. The plot holes don't drag\nthe movie down at all. Sharlto Copley, Dev Patel (of \"Slumdog\nMillionaire\"), Sigourney Weaver and Hugh Jackman put on fine\nperformances.<br><br>*Another movie focusing on a robot with human qualities is \"Robot &amp;\nFrank\", starring Frank Langella and Susan Sarandon.\n"}
]