[
{"review": "\nMuch like similar teen girl action movie series this one kills itself\nearly on by introducing so many holes that the house of cards that they\nthen try to build has no foundation. <br><br>Before the credits are even over the story makes less than no sense.\nHaving destroyed civilisation in a world war (ok) Chicago survives. The\nsurvivors had enough materials to build a massive wall around the city,\n300ft high, but can barely feed themselves. Now they have split into 5\nfactions (actually 6 because they throw a lot of people out and call\nthem 'factionless') and this somehow magically creates peace. <br><br>So none of that makes sense, and much like Hunger Games, having built a\nnonsensical premise we now follow a teenage girl as she turns into a\nsuper-soldier capable of jumping of buildings fighting off trained\narmies single-handed (using a cheap looking paint-ball gun). All the\nwhile with her buff and perfectly capable new boyfriend doing as little\nas possible to help her. <br><br>Oh and I forgot a quick detour while we ride a pointless zip wire\nthrough some buildings for absolutely no reason than to try and spend\nsome of the left over special effects budget.<br><br>And occasionally Kate Winslet pops up, but is shot from funny angles\nall the time while they try to make her baby look less visible. Not\nthat they need to as her bad blonde hair is distracting enough.<br><br>All in a total waste of 2 hours. Just go and watch Twilight or Hunger\nGames for the same movie done slightly (but not a lot) better.\n"},
{"review": "\nAs I said, the movie was extremely predictable. I knew what was going\nto happen before it did and I honestly felt like I was watching it for\nthe 3rd time! There were no twists, no suspense, no surprises. I could\nnot believe that there would be so many clichés and unrealistic scenes.\nInstead of an \"action/adventure film\" I saw a boring love story. I\ncan't imagine how unbearable it must have been for those who read the\nbook..<br><br>*SPOILER* The following scenes are examples of why the plot was so\nobvious and boring: <br><br>We knew that Tris would not go into the same faction as her family, we\nknew which one she'd choose, we knew that she'd fall in love with Four,\nwe knew that she wouldn't get kicked out of training, we knew that Four\nwould find out that she was a Divergent but wouldn't tell anybody\netc... Moreover, the scene where Tris and Four fight is so unrealistic\nand again, the fact that he started fighting on her side was way too\nPREDICTABLE. <br><br>*END OF SPOILER*<br><br>To me, Divergent looked like a bad version of the Hunger Games and I am\nreally surprised that so many people liked it. Unless you are a teenage\ngirl who finds Theo James hot and unless you have never read any books\nor watched any other movies in your life, I see no reason why you would\nwant to waste 2 and a half hours of your life watching Divergent.\n"},
{"review": "\nThis is perfect storm of bad movie making: a stupid story, bad acting\nand bad directing. Who is ultimately to blame? Money grubbing CEO's.\nWho else? <br><br>Thanks to the mega-success of the Hunger Games and Harry Potter,\nHollywood's scouring young adult books, like some pedophile in a\nplayground, looking for new material to get their greasy hands on. <br><br>Divergent is one of those series. I've not read the books, but in the\nmovie, you belong to one of 5 factions. Our heroine does not - she's\ndivergent - and that apparently frightens the powers that be. <br><br>Why? Because individualism is seen as a threat. In much the way\nindependent film makers are perceived a threat in Hollywood. <br><br>What follows is one inane, dumb, idiotic scene after another. I was\nrolling my eyes most of the time or laughing out loud at some of the\nnonsense I was watching. I almost got up to leave, but it was like\nwatching a train wreck. That would be more entertaining.\n"},
{"review": "\nWhen reading the book, I had concerns about how well it would translate\nto film. It's a book without much action and most of the narrative is\ninternalized to the protagonist. Books like that tend to struggle to\nadapt well and Divergent is no different. The director tried to make\nchanges to the story in order to try and make it work but I honestly\nthink it was futile. It's just not a good story for a 2-hour\ninterpretation. Even at that, I would rather have seen the story stay\ntrue and struggle to adapt than change and struggle. All in all, it was\nset up to fail from the beginning. Shailene Woodley and Theo James gave\nsolid performances and the special effects and action sequences were\ndone well but they made the film watchable and slightly enjoyable at\nbest.\n"},
{"review": "\n...made into a pretty stupid film!<br><br>Where authors(sic) get these unbelievably lame ideas? A world divided\ninto 5 factions? This is ridiculous. <br><br>This is another politically correct tripe. The plot is based on\ncountless Hollywoodian stereotypes. Actors all look like they came out\nof catwalk fashion show. They have as much substance and personality as\nbobble head dolls. The film is tedious, move at a snail's pace and do\nnot even fall into the category \"so bad it is good\"<br><br>It is embarrassing to know that there are those who classify this\nsophomoric attempt at literature as a dystopian science fiction novel.<br><br>Pure waste of time, money.\n"},
{"review": "\nAlthough lacking any real sustained exciting action parts, this would\nprobably appeal to under 16 year old's.<br><br>I really have a problem with the voting, as according to it's current\nevaluation by over 48 thousand viewers it is 7.5 which essentially\nmeans that it should be better these movies which were rated less than\n7.5: Man of Steel (2013); Captain America: The First Avenger (2011);\nX-Men; X-Men 2; X-Men 3; X-Men Wolverine; Iron Man 2; Iron Man 3;\nOblivion; Superman Returns (2006); Independence Day (1996);\nTransformers (2007); and Stargate.<br><br>This movie is just awful; no substance, and worst of all it's set up to\nallow for the making of a sequel.<br><br>The only good thing about a sequel is that they won't have to do too\nmuch to make the sequel better than this.\n"},
{"review": "\nThis movie was terrible. It was awful. And infuriating. It made no\nsense. This movie is the epitome of crap. In fact, instead of watching\nthis near 2 1/2 hour movie, watch a piece of crap. It will have a\nbetter plot than this flick. The first hour and forty-five minutes\n(precisely) are spent on the wrong thing. It makes reference to the\n\"government\" (cough CAPITOL) to being some sort of evil, but rather\nfocuses on Tris becoming part of a cult. It doesn't even make clear\nwhat they do. It gives no reason to why they are in \"factions\". There\nwere so many plot holes I would have thought Tommy Wiseau wrote it. The\nguys name is Four. Four. Apparently the author of the book thought,\n\"Well, anyone who reads this is a moron anyway.\" Four. Why? Why?\nWHY???? I understand that this garbage was only put together to make\nmoney, but did they have to assume everyone is an idiot? Couldn't they\nat least let it make sense? Or shorter? Or less cheesy? Or better\nacted? Or more focused? Or more intelligent? There was a point when\nTris argues with Kate Winslet's character that them choosing isn't a\nmatter of free will. Or at least she almost does. Right when it seems\nlike the movie has any brain they shut it down in a hurry. There is way\ntoo much wrong about this movie. If I continue I will only be hurting\nmyself by spending more than ten minutes thinking about this movie.\n"},
{"review": "\nI read the trilogy (which was nothing special and kept getting more\nannoying each sequel), but at least the first book had some kind of *\nsomething * to it. The movie sucks. It is boring and there is very\nlittle action (and what little there was is over too fast and not very\nthrilling). The violence is sanitized with the only real blood being\nwhen Four nicks Tris's ear with a knife toss. The two most horrifying\nscenes in the book are not even included: the attempted rape of Tris by\nPeter's gang and the transfer girl who jumps from the train and misses\nthe Dauntless rooftop to splat on the street below. Tris doesn't have a\n\"save the cat\" moment early on and provides no real reason to ever like\nher.<br><br>The story takes too long to get going, then the training goes on\nforever, only to have the ending feel rushed. Not once did I feel\nanyone's life was in danger. Not once did I perceive any credible\nromantic chemistry between Tris and Four. Not once did I laugh, cry, or\nfeel anything but bored. And it goes on for two and a half hours! Ugh.\nSure, the production values are high, but who cares if I can't relate\nto any of the characters or the story? It's just a dumb waste of time.\nI didn't hate it (only because I scored a free ticket), but have no\ndesire to watch the sequels.<br><br>However, I'm glad Divergent made a bunch of money opening weekend to\npave the way for other YA books to be adapted into films, but they need\nto do a better job. The reason all the recent YA adaptations tanked at\nthe box office is because they sucked (Vampire Academy, Beautiful\nCreatures, City of Bones). The only decent one I can remember was Warm\nBodies.\n"},
{"review": "\nI was actually pretty excited about watching this movie. My cousin\nthought it was great and better than Hunger games, so I read the books\nbefore I watched the movie. I liked the books, but there were a few\nthings I wasn't satisfied about. The relationship between Tris and Four\nis confusing and spontaneous, completely out of the blue and random. In\nthe movie it is worse. They barely know each other, Tris' ear gets cut\nfrom Four, then Tris is making out with Four topless. They didn't\ninclude a lot of the important characters, like Uriah and Peter's crew.\nThey barely acknowledged the characters they did put into the movie and\nthere seemed to be no importance in them. Al's suicide was a big thing\nin the book and it didn't really make an impact in the movie, there was\nno significance, I wouldn't have felt any emotion if I hadn't read the\nbook. Will, Christina, Tris and Al's friendship is too muted and you\ndon't really get to know any of the characters well, the character\ndevelopment was non-existent, . Four of the characters I couldn't\nreally tell apart from the others, Will, Al, Peter and Drew looked\npretty much identical. Too much is left out and there are too many\nchanges added to the movie that make no sense. In Tris' fear landscape\nit seems that Four is trying to rape her and she has to violently fight\nhim off. In the book it is playful and she ends up laughing it off.\nEdward's knife stabbing in the eye accident is also left out and that\nwas an incredibly important scene.<br><br>This movie just really disappointed me, I never really get disappointed\nwith movies, but this just frustrated me too much.<br><br>The books and movie both had great potential but were just a little bit\noff.\n"},
{"review": "\nOf course this movie is made for a very young female audience so I have\nproblems to identify myself with the targeted audience. The good point\nabout the movie is, that the heroine is not complelty depending on her\nmale counterpart, so its none of the\n\"girls-are-mentaly-and-physically-too-weak-to-exist-without-man\"\nmovies, but thats about it. If you want to watch something about strong\nfemale characters try the legend of Korra. The rest of this movie is\nterrible, especially the huge amount of brain bleeding inducing logic\nerrors.<br><br>SPOILERS!!!!!!!!! For Soldiers knife throwing, jumping from trains and\nexcessive hand-to-hand combat are the most important skills. As well as\nbeing complelty fearless...people throw knifes at you and you aren't\nallowed to be afraid? Yes, thats the stuff marines are made of. Being a\nsoldier has nothing to do with endurence, guns, tactics and unimportant\nstuff like that real life soldiers train.<br><br>Being \"divergent\" not fitting into a faction is something rare...at\nleast thats what the characters say...funny how the rarest thing turns\nout to be a majority.<br><br>The training officer sits at the same table as the rookies, but the\nrookies aren't allowed to talk to him? Yeah, makes sense.<br><br>A rookies says something stupid to a teacher...and they put in into the\nworld wide newspaper...yeah, nothing else interesting happening.<br><br>Oh, I nearly forgot, the actual most important thing for a solider is\nhouse climbing. Know a soldier who hasn't climbed the empire state\nbuilding? He's a noob.<br><br>These are just some of the terrible brain bleeding inducing logic\nerrors in this movie. If you are a 8 year old girl you might be able to\naccept them, but for everybody else this movie isn't watchable.\n"},
{"review": "\n... and not a very good one too (not to say simply boring).<br><br>i even couldn't force myself to watch it all. Maybe im too old for it,\nbu then last week i watched \"the last mimzy\" (children movie) and found\nit pretty good. No, if something is good you'll find it's quality even\nif you're not a lover of a specific movie type.<br><br>Some details: - acting - it's as artificial as the whole script itself\nso i cannot blame the actors - script- look above - the whole concept\nof society being divided to factions, im fine with that, but\nexcluding/killing people who e.g. feel compassion and declared\nthemselves to be soldiers, thats just ridiculous. - oo, and that hand\ncombat technique of holding your front-to-oponent elbow high- try that\nin real life and it wont be a long one.<br><br>To summarize, i agree with critics on this one.\n"},
{"review": "\nIn a post-apocalyptic dystopia, the world is destroyed and only Chicago\nhas survived with a society divided into five factions: Abnegation (the\nselfless), Amity (the peaceful), Candor (the honest), Dauntless (the\nbrave), and Erudite (the intelligent). The teenager Beatrice Prior\n(Shailene Woodley) belongs to the Abnegation that rules the society but\nshe fells outcast and attracted by the Dauntless. When she is sixteen\nyears old, she is submitted to an aptitude test to indicate in which\nfaction she will stay for the rest of her life, but she learns that she\nhas aptitude to be in the Abnegation, Erudite and Dauntless. Further,\nshe learns that she is a Divergent that is destroyed by the government.\nOn the next day, she chooses to join the Dauntless where she changes\nher name to Tris and is trained by Four (Theo James). They fall in love\nwith each other and soon Tris discovers that the Erudite are planning\nto take over the power from the Abnegation and become the ruling\nfaction. <br><br>\"Divergent\" is an adventure movie with a dull and lame story based in a\nstupid and senseless concept of society. The dystopia does not make any\nsense and everything is idiotic in the story: the society, the plot,\nthe romance, the way the Dauntless jump from the train, the conclusion.\nIf there is a faction formed for the most intelligent people, it seems\nto be obvious that they should rule this chaotic society. Tris kills\nmany soldiers but she leaves Jeanine alive in the end. My vote is five.<br><br>Title (Brazil): \"Divergente\" (\"Divergent\")\n"},
{"review": "\nThis movie is a muddled mish-mash of clichés from recent cinema. There\nare some promising ideas in there, but while the director was clearly\naiming to wind up with a hauntingly ambiguous film, what he ended up\nwith was a confusing mess. Lead actor Shalene Woodsley does a fair job\nbut with no central theme it seems as though he doesn't have much to\nwork with. Furthermore, the movie is largely devoid of a coherent\npremise (although, in fairness, there are some creepy moments amid the\ndrudgery).<br><br>*MILD SPOILERS* <br><br>It's rubbish.<br><br>*END SPOILERS* <br><br>Avoid this one. For an excellent psychological, ambiguous dystopian\ntale, check out the Korean film Snowpiercer (2013).\n"},
{"review": "\nI went to see this movie and i must say this is a special kind of\nhorrible. Not one of the subplots made any since and most of the\ncharacters accept the leads were poorly introduced. <br><br>They set up divergence as if it is a special ability but its not. Its\njust a tittle. The main character Trice never really comes off with\nanything that looks like a special ability. The fact that there are no\ncontrasting examples of her special ability make her ability hard to\nsee. She just a girl falling in love. <br><br>The movie is slow as molasses and until you get to say 45mins into the\nmovie you want to fall asleep. The plots are all incomplete and at the\nend you have no summary of what just happened.<br><br>The society they set up in the movie is not realistic in anyway. The\nDauntlets are basically a group of wild side party teens and they act\nlike they are tough when none of then really show a capacity to fight\nor defend. Though the story sets them up as the defender or police of\nthis world.<br><br>There are pointless scenes like a zip-line scene that seems to come out\nof no where and have no relevance to the plot or the development of\ntheir NON-hero Hero. <br><br>The movie is like a mesh of other films like, they use the color look\nof Twilight and try to set the 2 main character up in the same romantic\nway. The world reminds you much of The Hunger Games but has much much\nless action and much less relevance. There is even has a touch of\nMatrix to it accept with all that technology they had no gun that could\nfire in rapid succession. Everyone in the movie pulled guns and most of\nthe time they did not shoot. <br><br>Nothing is cohesive in this movie and I would rather you go see a\nre-airing of Spanglish, Tremors or Judge Dred if you want to see a much\nbetter movie. <br><br>I am a guy so maybe this movie was made for ladies more than men but I\nreally did not like this fragmented, inconclusive, cheesy movie. Any 4\nyear film student could have made it.\n"},
{"review": "\nThe story had potential, but only accomplishes to create a mindless\nmoney grind for Hollywood.<br><br>Divergent, or Different is a highly misleading name for this movie,\nsince it is extremely compliant to the ongoing Hollywood stream of\ncreating all too obvious \"we're going to make # sequels to this movie.\"\nIf the characters were anywhere near emphatic or the actors actually\nhad any acting skills, this could have saved the movie a little bit,\nbut lack of story and well; basically anything worth while makes me\ndraw only one reasonable conclusion.<br><br>Please change to title to: \"Die a virgin!\" So that you give the\naudience an actual reasonable idea of what to expect in the movie; a\ncheap teen movie suited for the lowest common denominator.\n"},
{"review": "\nDivergent is gripping and intelligently brought to life on the big\nscreen from the director who brought us \"Limitless\" and \"The\nIllusionist.\" Are we seeing something of similar essence with the\n\"Hunger Games\" series? Yes. However, my personal take was that the\ncharacters were more engaging and the plot was as well in this film.\nShailene is excellent at the helm, and really brings forth a convincing\nportrayal of a heroine battling in a world where chaos and tragedy\nenvelope the characters. Her graceful emergence from shy personality to\ndominance is done artfully and really speaks to her ability as an\nactress. Theo James is also exceptional in the co-pilot role and almost\neffortlessly seems to pull off the bad boy with standards persona in a\nmanner I haven't seen since Will Smith in his prime. The plot is high\noctane and especially more gritty than I first imagined. The emotion\nraw in intensity and empathic build. As a guy who was just going to\nthis film to act as arm candy and a shoulder to lean on for my highly\nenthused girlfriend, I can write this piece while honestly saying that\nmy eyes were glued to the screen the entirety of the film and was\npleased to see this film do such an excellent job at developing both\nthe plot and characters involved in it. Highly Recommend.\n"},
{"review": "\n**May contain spoilers** <br><br>My partner god bless her loves these books and seeing it was part of\nher birthday week I relented and went with her to see it. To be honest\nfrom what little she had told me (or I had forgotten) this would be one\nof those \"chalk up the brownie points and suffer through deals\".<br><br>I'll try not to knock the book as I haven't read it but from what I've\nseen in this movie and from the reaction of my partner, I may just have\nto read it to see how this went so terribly wrong from the perspective\nof someone who hasn't read the books and the perspective of someone who\nhas.<br><br>First: Where was the lead in? not sure why there was a war or who it\nwas against? but that may help the audience understand the concept of\nthe factions or the actual reason for the story.<br><br>Secondly: Where was the character development or more so the\nrelationship between them, I mean the deaths of the parents in this\nmovie meant less to me than any other movie I've seen, I felt nothing\nand geeze... you could see it coming from a mile away. The father just\nthrew his life away when they could of easily taken out the 5 or so\nguys in the room, especially with a number of them having their backs\nturned, let's not mention he walks into the middle of a hallway with no\ncover...<br><br>And more: So they have to face their fears in the simulation but when\nthey both go in Four doesn't seem afraid bar some sarcastic comments.<br><br>Conclusion: Unless you're some fanatical fan I can't see how you could\nenjoy this movie, this was cringe worthy at best. If it hadn't been for\nmy partners birthday I would of walked out and I'm still upset I\ndidn't... and trust me.. my partner was probably more upset about this\nsteaming pile than I am and she's an avid fan of the books.\n"},
{"review": "\nI've never read the books, so i don't know how it compares to the movie\nyet, but here's my opinion: I think that it was too easy for the main\ncharacters. There was very little conflict, and not too many obstacles\nfor the main characters to overcome. For instance; Tris is told that\nshe's kicked out of the Dauntless group, yet 5 minutes later she\nfollows the group and the very same person who kicks her out has\nnothing against it. Also, the 'limitless ammo', 'bad-shot bad guys' and\n'one shot death' clichés just make the movie a whole lot worse. Also,\nthere's no real explanation to anything. I don't know if they explain\nthe Divergents' invulnerability to the serums and tests in the books,\nbut all of that was completely unclear to me during the film. I have to\nsay, at the end of the day, 5 might be a little bit nice on the\ncritiquing chart, but i think it's appropriate for the amount of money\nand work put into the film.\n"},
{"review": "\nI usually don't write reviews and on occasion when the movie is really\namazing or when movie is really worst, but that movie still end up with\nabove 6 ratings by Critics. So Divergent is one of those movies where\nproducers, directors and production houses instead of spending money\nand time on script, editing, acting and direction decided to spend all\nthe energy on publicity and promotions. More than 90% of users reviews\nare negative and still the movie given as 7.7 stars I mean isn't is the\nbiggest proof that producers well paid the critics too. Well, before\nthe movie release they start promoting movie which is the typical case\nof every big budget movies but they started promoting actress and actor\nof the movie in every magazine and newspapers, basically they wanted to\ncreate a reel life imitating real life scenario between the leading\npair the way it happened with Twilight series and because of that, the\nTwilight series otherwise one of the worse Vampire/Ware-wolf series\nmade lot of money they bank on Kristen and Robert Pattison love\nchemistry, so the production houses tried to bank on Shailene &amp; Theo\nchemistry in real life, but it seems that Shailene is not only pretty\nbut she is smart as well, she has lot of potential and she didn't play\nthat game. SO many comments already written about the flaws in the\nmovie I don't think I need to reiterate them here. Overall very\ndisappointing movie in all departments. The only thing is Shailene\nWoodley and I believe she is promising but still she is no Jennifer\nLawrence and I don't think Divergent would become Hunger Games series.\nAnother bad thing about this movie is unlike Twilight series which has\nlow stars ratings which is justified this movie got 7.7 stars rating is\nridiculous.\n"},
{"review": "\nThis might be the worst movie with a budget that I've ever seen. I love\nsci-fi and foreign films, this should've been perfect. However, nowhere\nis it stated that this is anything than a regular sci-fi movie, but\nit's more like a really crappy comic magazine with a plot that was\ninteresting at first but then turns into something more childish than\nanything I could've imagined. The rest is worse: this is truly a\nHollywood USA film, so you have those barking voices, flashing\nmish-mash fight sequences; and the trandemark, never-ending scenes\nwhere men bulge their eyes and grind their teeth, signifying some sort\nof affect, anger for example, or pain. The movie is awfully dragging\nbecause of this... this nuance seems to be part of the overall\n'twilight' style of this sort of flick. As far as any meaningful drama,\nwell, as you can imagine, there is none. This flick is like a mild\ntoochache, really. The semi-plot is overly complex but also difficult.\nIf you like the Cassern anime or live-action film, you may like this. I\ndid not.\n"},
{"review": "\nAs an introduction to a series it's better than \"The Hunger Games\".\n\"Divergent\" is a nice little coming of age flick that feels bigger\nbecause it features really long, drawn out scenes that move at a\nglacial pace, and Kate Winslet as a baddie. But 'Divergent' falls flat\non it's face largely due to Shailene Woodley's debut as \"Beatrice\" and\nTheo James. Overall, Divergent is familiar fare, but served up by a\ncast that is fiercely dedicated to phoning in the material. Roth's\nnovel imagined a post-Apocalyptic world where survivors created a\nsociety that has a firmly enforced caste system. When Beatrice chose\nthe paramilitaristic faction (called Dauntless) I was prepared for a\nfilm designed to rake in the dumb-down dollars. Instead we mostly\nfollow Beatrice as she makes friends, begins to crush hard and debates\nfamily members. The setup is so tapped into standard youthful fears\n(tests determining who you are, the unknown first sexual experience,\nhaving multiple interests when you are told you should only have one\nstrength) that Divergent is essentially a high school movie. Whether or\nnot that continues in the next film doesn't really concern me, although\nthe likelihood of more booms and swoon is probably strong since the\nenemies are the intellectuals and the heroes are the brawn that ditched\ntheir social service upbringing. Some entertainment value, but this one\ncertainly won't enhance your intelligence.\n"},
{"review": "\nI loved the book, which probably set me up to be disappointed by this\nmovie. To me, it seemed that important parts were missing and random\nthings added. Peter came off as a light hearted jerk instead of a\ndangerous sociopath and Four just happened to suddenly like Tris. These\nwere important things to develop. Instead, time was taken to have a\nshow down with Janine at the end??? It wasn't just the deviation from\nthe book. I saw this movie with a Divergent-virgin and he asked me\nmultiple times if it was almost over. He felt lost and confused. I\nunderstand when movies are changed because the book just doesn't play\nout but that did not appear to be the case.<br><br>This was very disappointing and I frankly expected more with Roth being\npart of the production team.\n"},
{"review": "\nI read the books and anyone who tells you this was a great book to\nmovie adaptation is lying. My guess is they read the back of the book\nand thought that was good enough.<br><br>How this made it to the theater like this is beyond me. They took out\nthe visitation day and REPLACED IT with her mom sneaking into the\nDauntless compound. Not only that, she never mentioned anything about\ngoing to visit Caleb or the serum. <br><br>Little things that had a huge impact on these characters were missed.\nWe never saw Peter stab Edward. Wait, did we even see Edward? Oh yes,\nwe did for a brief moment during capture the flag. Speaking of capture\nthe flag, according to the book I read Christina was the one who held\nthe flag. <br><br>Chances are you won't see me at the second or third movie\u0085 if they make\nthem.\n"},
{"review": "\nSo I went into this movie wanting to be impressed by it. I didn't know\nmuch about it but was hoping for it to be a fun movie. I waited\npatiently for what had to be around 3 hours for the plot to pick up and\nget interesting. I checked my watch and alas only about 30 minutes had\nactually elapsed and to my further dismay the movie never did get\ninteresting and the plot remained rather lack luster.<br><br>I usually love movies set in a dystopia, but this one was on par with\nwatching paint dry. The acting was average and that's being very\ngenerous. The action was weak. The plot was weaker. The romance forced.\nThe characters were flat.<br><br>Also try not to laugh when Tris yells \"stop it\" to the bad guys during\na scene that isn't suppose to be funny yet you can't help but laugh at\nhow ridiculous it is. I kid you not, she basically calls for a time out\nwhile getting shot at... yeah it's a wonderful movie. <br><br>So do yourself a favor and wait for this one to come out on blu-ray and\nthen not buy that either...\n"},
{"review": "\nI couldn't believe how boring Divergent was. There's no plot\nwhatsoever. Nothing happens. It's like a bad episode of Star Trek. What\ndid they spend $85 million on? There's no special effects whatsoever\nunless you consider a computer generated landscape of a futuristic\nChicago a special effect. The acting is weak. The two main characters\nare completely miscast for a romance, it's borderline pedophilic. The\nfilmwork feels like it was shot on a vid-cam. I would have walked out\nabout three quarters of the way thru but didn't want to disturb the\nothers in the theater so I just sat there yawning and rolling my eyes.\nWhat a stupid movie. I guess with this type of trash appealing to the\nTwilight slash Hunger Games crowd I should say, Oh mah gawd gag mah\nwith a spoon.\n"},
{"review": "\nI saw this movie on opening day. This movie was terrible, I didn't go\nin thinking it would be my favorite movie, but was left very bored, and\nready for the movie to end 30 minutes in. <br><br>I watched this movie with my wife, who loves movies based off books,\nand she was not a big fan as well. The guns used in this movie were\nsomething you would find at Toy's R Us. <br><br>Plot line was very boring, and the lead female role was beyond boring,\ndull, and didn't come off as she was supposed to be. For the future\nmovies which I will never see, RE-CAST. She may have done well in other\nmovies, but this is not her cup of tea. I would rather watch the whole\nTwilight saga than watch this movie.\n"},
{"review": "\nIn this movie the main actress did very meh. The actor did very bad\ntoo. i was fighting sleep half the time.I have not read the book\nbecause it never interested me. I was just dragged to see this at a\nscreening. i wish i never was. All this movie did was prove me right.\nthe plot could have been interesting if it was done right. As you can\ntell it was not done right.The actors all with the exception of the\nmain actress did very bad. the visuals were not very impressive. This\nwhole experience of this movie was like being attacked my an angry\nsquirrel. just annoying and still just leaves a empty feeling.I give\nthis a one star because there was just nothing.\n"},
{"review": "\nOH MY GOD, lets talk about this movie, i really wanted to review this\nmovie its actually my 2nd movie that encourage me to make this review\nto describe for you people that this is the most OVERRATED movie will\never be!!! the cast??? KATE WINSLET what the hell she did accept to to\nthis character is it about money?or maybe she's a hidden producer? the\nstory is so ridiculous and full of crap!! i really love science fiction\nmovie but at least to have sense or how can i put this to have at least\na story!! its over slow and i can make this movie in 10 min or 20 max,\ni actually went to watch this movie because of the director cause i\nreally loved the illusionist it was a very nice movie, and clever one,\ni thought maybe as a science fiction it will be smart and unpredictable\nor something like that, buts it very far from that, in two words, i\nwish that the IMDb will have vote from 0 to 10 i will definitely pick\nthe ZERO!!!!\n"},
{"review": "\nI have never walked out of a movie so mad at the cast and writers of a\nmovie in my life. Divergent is my favorite book and I hate to see the\nplot literally slaughtered as I observed at the Thursday night premier.\nI cannot believe this is the book I love so much. Entire chunks of the\nplots were missing- and not subtle ones either. Very KEY EVENTS ARE NO\nWHERE TO BE FOUNS WITHIN THIS FILM. it is a waste of time to go see it\nin theaters. If you must watch it, I suggest just going to redbox or\nanother rental place when it comes time for the movie to be released.\nAnd I am not trying to be that negative person that leaves bad reviews\non anything and everything. Usually it is very easy for me to find the\ngood in something but not in this. The mood of the movie was entirely\ndifferent than it was in the book which disturbed me. The relationship\nbetween Tris and Tobias is very different than it is in the book which\nwas something I could not get over. Along with the fact that the ending\nwas completely changed. <br><br>So basically, they spent a year on this movie to get the title and some\nof the characters names right. And everything else is wrong.\n"},
{"review": "\nI saw this movie with a free theatre ticket I got from work, and still\nfelt screwed over for wasting my time. Can't believe the high IMDb\nstatus. Infantile plot, boring dialogue, predictable and totally\nunconvincing. It's a film I can imagine being aired on a kids TV\nchannel some Sunday afternoon. I struggle to write the minimum 10 lines\nI'm supposed to write to post this review, as there's nothing more\nreally I can say about it. I tried thinking of possible metaphors the\nfilm aimed to suggest, some unconventional take on things, some acting\nspark. Maybe it's just me, but unfortunately I can't find a single\npositive thing to say. Except perhaps that its produced quite OK, but\nwhich movie isn't today. So for lack of anything better to say, I'm\njust gonna finish those ten lines by repeating my second sentence:\nInfantile plot, boring dialogue, predictable and totally unconvincing.\nInfantile plot, boring dialogue, predictable and totally unconvincing.\nInfantile plot, boring dialogue, predictable and totally unconvincing.\n"},
{"review": "\nI have to say that the producers would have to be stupid not to use\nBurger again as the director. He did such a great job with this one. I\nthought I was going to see a film that was mostly aimed at teens.\nHowever the story alone makes this far superior to most teen oriented\nfilms. In fact this didn't feel much like a teen film at all. The\nfantasy story is a great metaphor for our current society, it's simply\na very relevant film. The directing here was spot on. The story as fun\nas it is, does have a few holes, sure, but they are easy to look over\nbecause they are such small holes. The film simply works as a\ncommentary piece on political philosophy, and as an entertaining action\nfilm laced with some romantic tension. In my view this film was far,\nfar superior to the very teen oriented and very one dimensional Hunger\nGames, and it's certainly more unique as well. Woodley is impressive\nhere, clearly showing the ability to play a very layered and complex\ncharacter.<br><br>8/10\n"},
{"review": "\nLast year, book to movie adaptations were very hit and miss. The Mortal\nInstruments City of Bones was an example of an absolute terrible\nadaptation. Completely butchered, over adapted to the point were it's\nlike a parody of the source material. I'm not a purist, but it was\nsimply down right sad. Nothing like the book. Then I saw Catching Fire\nwhich was an example of a near perfect book to movie adaptation.\nCharacters nailed it, not over adapted, and properly paced. This movie\nDivergent however was exactly like The Mortal Instruments movie. As\nsomeone who read the books, this adaptation was an absolute\nembarrassment. <br><br>One: This movie was over adapted! Too many important, meaningful scenes\nand components from the books were cut out, leaving us a Hollywood\nwrecked, cobbled together pretender of the book. <br><br>Two: The evil characters were not evil. Plus an added bonus, most of\nthem were devoid of character development Peter wasn't evil, he barely\ngot any screen time! And his entourage of sociopaths, who oppressed and\ntried to kill Tris in the book were done terribly. Molly had two lines\nduring the entirety of the film, and one was complimenting Tris! Drew\nwas the worst, he was non-existent in the film. No screen time for him.\nAnd Eric, totally a one dimensional character. Lack any emotion or\ncharacter development or even a reason for him to even exist in the\nstory! <br><br>Three: There was little to no conflict in this movie for the\nprotagonist Tris. Without conflict, there is no narrative, no plot\nprogression, and ultimately no entertainment value. Things were\nresolved so easy in the movie it was ridiculous. Tris is told she has\nfailed initiation; which never happened in the books, and she just\nstays against orders of her superiors without complaint. What? Not\nplausible by any means. <br><br>They should just cancel the squeal because there's no talent, evident\nof this movie. <br><br>1/10\n"},
{"review": "\nI felt like the movie deviated too far from the original story. The\nmain plot was the same but the way the book introduces the conflict is\nmuch more interestingly done. In addition the age gap between the main\ncharacters, Tris and Tobias (Four), seems a bit off. Just a few missed\nscenes and minor details, I would have liked a more realistic\ntransition into Tris and Tobias' relationship, as it seemed a bit\nabrupt and confusing. The original book focused a bit more on Tris'\nevolution from her original faction to Dauntless, this gave the\ncharacter more depth in my opinion. I would have also liked to see more\nabout Tris and her friends (maybe an intro to Uriah or some of the\nother dauntless-born initiates would have been nice). For someone who\nhas not read the original novels this is an interesting movie and would\nbe very enjoyable. I would recommend those who have NOT read the books\nto see the movie.\n"},
{"review": "\nI was so excited to see Divergent, but it fell flat. I'm sure if you\nhaven't read the books, you would love it, but the movie was terrible\ncompared to the book. It was more of \"loosely based\" off the book. Many\nscenes were changed in dramatic ways and characters who were fairly\nimportant later on we're not included. There is also a different\nrelationship between Tris and Four in this movie that in the book, and\nI like the book version better. If you haven't read the book, this\nmovie might be confusing, and if you have read the book, you might be\nconfused because it strays so far from the book's plot. This movie does\nnot do justice to the book.\n"},
{"review": "\nThis is my first review on IMDb. This movie was so horrible I felt\nforced to warn people about it.<br><br>I had to go to the dictionary for this one - words to describe this\nmovie: - very unpleasant - detestable - dreadful - appalling - vile -\nrevolting - sickening (you get the point)<br><br>*Spoiler* When the dancing daredevils came jumping from the train - the\nmovie definitely derailed for me.<br><br>The movie was awful, the story was awful. Words cannot explain how\nhorribly awful the movie was.<br><br>*Spoiler* You can only be brave or wise or smart or a gardener. If you\nare brave and wise, or brave and smart, or wise and smart - you will be\nkilled. How stupid can this premise be? You cannot be both smart and\nbrave, smart and wise?<br><br>This is the worst movie I have seen since \"The Postman\". Yes - it is\nalmost that bad.\n"},
{"review": "\nI don't know how often the other reviews watch a good movie but this\nisn't one of them.<br><br>The whole film for me lacked any real goal. There's a good concept\nthere but I always felt like I was waiting for it to get to a point as\nto why she is special.<br><br>She has no ability to do anything that any other person cant do. The\nstory makes out that its going to be like a hunger games type battle\nbut it just fades away.<br><br>This film for me was just life less...I almost left halfway through and\nwas the first out of my seat to leave before the credits started to\nroll.<br><br>If you want to watch something currently out thats predictable but with\nsome action i'd watch Captain America.<br><br>This film has inspired me to write a review on here purely because\npeople hyped it up and I was sorely disappointed\n"},
{"review": "\nFirst off, how the hell did this get approved for a movie!? It is one\nof the worst films I have ever seen in my life and I've seen quite a\nfew. This movie is just plane stupid. The plot doesn't even make sense\nand it's very poor explained. Terrible terrible, people, you have been\nwarned. Go watch if only if you want to waste time and money. I rarely\ndislike a movie but this was too bad to ignore. It was so bad I created\nan IMDb account just to write this. It's my first ever review, it was\nthat bad! Absolutely nothing good to say about this movie. Bad plot,\nbad actors, bad acting...a recipe for disaster. I have no clue how this\nmovie got a 7.5 here. That's the only reason why I went to see it.\nPeople, I know to each his own but please please make good and honest\nreviews. This is pure Hollywood crap.\n"},
{"review": "\nInitially when hearing that the book \"Divergent\" by Veronica Roth was\ngoing to be put into a motion picture I was ecstatic! Roth's books\ncreate such an interesting world with captivating characters and\nadventures that have you picking up the next edition the second you\nfinished the preceding one.<br><br>The movie did not capture the books' unique world or characters.<br><br>What replaced my initial excitement for the movie was disappointment\nalmost immediately after the movie started. The casting/acting, script,\nand quality were all unbearably embarrassing because they failed to\nreach past a superficial level. The creators of this film overdid the\nBattle Royale similarities (executed by less-than-satisfactory acting),\nand didn't illustrate any seriousness within vital characters like Tris\nand 4 as in the book. Luckily, the movie did follow the plot well, but\nthis single positive is overshadowed by the fact that the events felt\nstrung together to reach a \"climax\" which was not supported from rising\nevents within the movie.<br><br>Overall, the production did not live up to the high expectations I had\nheld and was a sad disappointment for a Divergent fan like myself.\n"},
{"review": "\nI wish I could leave -10 for this AWFUL AWFUL MOVIE. Me and my\ngirlfriend who enjoys all sorts of movies, I'm more picky, walked out\non it in the 1st 20 minutes.<br><br>It was as a 12 year old was playing director for the day. Climax music\nfor a random walking scene, with nothing Epic going on? Check. A police\nforce faction who acted like complete a**holes for no reason? Check.\nThey would run everywhere for no apparent reason, act loud and make\nnoise for no reason. Ohh here is the best part, they would climb up to\nthe overhead subway, again for no reason, and the train would not stop\nat stops, it would keep going so they needed to jump into it. <br><br>Wait it gets better, they end up in their headquarters where it looks\nworst than a run down prison, then next scene they decided to get\ntattoos, and they are in a swanky upscale lounge with everyone's hair\ndone. LMFAO. <br><br>That was the point we decided to get up and leave from this complete\ntrash. If you were a fan of the Hunger Games don't get sucked into this\nmovie it's nothing like it, it's the most childish cheesy thing you\ncould ever possibly watch. <br><br>You have been warned.\n"},
{"review": "\nGoodness gravy gracious, I don't even know where to begin berating this\ntrain wreck of a film. I suppose I'll begin by criticizing the fact\nthat the characters had little to no development whatsoever. I mean,\ngood lord, characters that were hastily introduced during the first few\nminutes of the film and scarcely mentioned amid the film were hurriedly\nbrought back with the intention of implementing those typical Hollywood\ncliché \"PLEASE DON'T DIE ON ME, PLEASE!\" scenes. I'm not insinuating\nthat there is anything awry about designing characters to simply exist\nand complete the fictitious paradigm, but rather that the writers\nshould be privy of the fact that the audience could care less if they\ndie later on. The acting was also astoundingly mediocre. Even during\nthe resolution of the film's primary conflict, you can discern an\nincredibly cringe inducing, spurious inflection in the antagonist's\nvoice as she frustratedly reacts to her defeat with irritable overused\nphrases such as \"NO, WHY YOU.\" This film also resorts to \"shocking\" or\n\"plot twist\" scenes roughly every five minutes. I've no antipathy for\nthose personally, though, after the first 20 minutes of consistent \"OH\nNO\" moments, the audience becomes far too exhausted to care anymore.<br><br>I direly wish these were all the caveats I had noticed while viewing\nthis film, but, unfortunately, I could continue raving for an\nadditional 5 unnecessarily long paragraphs if I direly wanted to.\nAlternatively, I'll conclude this review by sufficing to say that I\nwould recommend this film to no one under any circumstances ever. It's\nnothing more than a try hard, egregious attempt at creating an\nedge-of-your-seat experience for the audience and is far more probable\nto leave them anticipating those enrapturing strings of text we call\nthe credits.\n"},
{"review": "\n(My spoiler isn't until the very end) I don't just dislike this movie\nbecause I read the book- I really wanted to like it and was looking\nforward to seeing it. But yes the book was incredibly good and the\nmovie did not do it justice at all. Even if I hadn't read the book, my\nopinion wouldn't change. There was no character development- leaving\nthe audience detached from the characters. They also didn't develop any\nof the characters relationships - not Tris' with her fiends Christina,\nWill, and Al, and especially not with Four. There should have been\ngood, emotional moments in the movie but there just weren't. <br><br>Normally I can get pretty emotional when it comes to movies but I am\nsure that if Tris and Four had just died at any point, I would not have\nbeen upset because there was no attachment thanks to the TOTAL LACK of\ncharacter development. <br><br>I understand that they can't fit everything that happened it the book\nthe way it happened because movies have time limits, but I think they\nvery poorly chose what moments to include. <br><br>All the parts I was looking forward to were either not included or were\ncompletely devoid of emotion and intensity. <br><br>SPOILER: The moment when Tris has to shoot her best fiend Peter should\nbe sad because he's her best friend- but it's not because their\nrelationship never developed so the audience can hardly know how good\nof friends they were. If I hadn't read the book I'm not sure I would've\neven recognized who he was- even if I did it wouldn't have been an\nemotional moment because the audience didn't really get a chance to\nknow his character, or any of the others for that matter.\n"},
{"review": "\nHow on the face of this planet did this movie get 7.7 if you've ever\nread the book you will find the amount of changes that take place\nthroughout the movie compared to the book is nearly unbelievable I\nalmost got up and left the theater in the middle of the movie there was\nso much changed the only resemblance to the book was the most basic\nplot line. Did Veronica Roth not watch the movie before it was released\nbecause what the hell was that if I were her I would be embarrassed to\nclaim that as the movie version of my book. I could screen write a\nbetter version. If you haven't read the book I would suggest that you\ngo see it and tell me I'm wrong because you're just gonna say that\nanyway and talk about how much of a good movie it was and and how I\ncouldn't do better and all this crap or you could be less of a mouth\nbreather and actually read the book before seeing the movie and then\nnot sit through the 2 hour 20 minute monstrosity.\n"},
{"review": "\nI haven't read the book, so I didn't go into the movie hall with a lot\nof expectations (except the IMDb rating of 7.5). I don't see how that\ncould have made a difference though. I'll try to summarize this movie\nin a sentence : \"Its a really low budget book adaptation which could\nonly cater to children as its primary audience, and even they would\nchange the channel if it were on TV\". The Premise I daresay was decent\nenough for an engaging Sci Fi movie, but this falls flat on its face so\nhard it broke its jaw and nose within the first 15 minutes. A good lead\nactress in a shoddy plot/screenplay, crawling along at a horrible pace\nwith no direction whatsoever. Please avoid this movie, even when it\nends up on Cable in a month or so. Im amazed so many people gave it a\ngood rating. This saddens me, because I cannot trust IMDb ratings\nanymore after this movie.\n"},
{"review": "\nIt seems that all these new movies are about SF scenarios, the end of\nthe world, mass destruction and so on. Divergent is a combination of\nThe Hungers and Harry Potter with all the pickings for the right house\nor faction, whatever. The most idiotic part was the parents' death\nscene: cry like hell for the mother, don't even bother for the father.\nOverall, totally not impressed: uninteresting, not original, and\nextremely long . But I don't know what I expected actually. Maybe the\nbooks are interesting, who knows. After seeing the movie I won't read\nthem. I'm sure that they'll make a part 2 that I'm going to see only\nbecause I don't like to leave things unfinished. Other than that, it's\njust a snore...\n"},
{"review": "\nThis movie had so much potential with a fantastic opening. However the\nmovie doesn't really talk as much about divergents as about the\nsoldiers. Two of the main characters are the soldiers who are also\ndivergent, its almost as if soldiers are closest to divergents. Whereas\nall erudite are shown as evil, come on give me a break. Also the\nromantic angle looks completely unnatural and forced. The premise made\none think it wold be all about this lady who does not fit in, however\nsoon you have this lady not just fitting in but being a super human.\nShe fails so many tasks and yet somehow manages to recover from all of\nthem.\n"},
{"review": "\nI haven't read the book, didn't know about it before hand. But I\nwatched the trailer and found it really misleading. If you watch the\ntrailer, it looks like a science fiction movie set in a dystopian\nfuture, where humans created an organized society to protect themselves\nagainst an unknown threat. I was hooked !<br><br>I went to see the movie, and well. It's another Twilight, really. The\npace is really slow, it all centers around an uninteresting love story,\n100% predictable. The dystopian society don't make sense, and is pretty\nridiculous : like hell people would live in 5 groups, mingle everyday,\nand be satisfied with the situation for 100 years.<br><br>WARNING : SPOILER ALERT And come on, who says \"I don't want to go too\nfast\" after their first kiss ?<br><br>Anyway, if you want a predictable movie, with cheesy dialog, really\nslow pace, boring love story and such, this movie is for you.<br><br>I still rated it 3 stars, because to be honest, I laughed a lot trying\nto predict was what gonna happen next, and succeeding all the time.<br><br>(Some people will probably say \"but, it's an adaptation from a book, so\nit's normal\", but then I'd replay : \"there are thousands of books\naround here that deserve a movie adaptation, why pick this one?\"\n"},
{"review": "\nFirst, I didn't read the book. Whatever you will read in this review\ncomes purely from a perspective of a film practitioner and ordinary\nmovie fanatic.<br><br>The wrong choice of actors made the film looks bad. The characters,\nespecially the main characters, were not convincing even Kate Winslet\nand Ashley Judd. The facial reactions, the delivery of the dialogues!\narggghhh!!!<br><br>The story is obviously inspired from Hunger games. Maybe some of the\nviewer's will deny it, but no no no! I think the idea is somehow\nrelated to Hunger games!<br><br>Pacing is good. Somehow it also made me laugh with some scenes but\nmostly I laughed because of, I think, disappointment!!! &gt;:/<br><br>the soundtrack is also not good, even the timing of musical score... it\ndoesn't have rhythm! @_@<br><br>I don't know, maybe if they only have good characters, and a good\nscreenplay...maybe it will separate them from comparing to Hunger\ngames.\n"},
{"review": "\nGranted, I watched this on an International Flight, and was not in a\ngood mood, but this was seriously one of the worst movies that I've\nseen in a long time. From the first seconds, it is obviously trying to\nbe some kind of new Hunger Games franchise. It is incredibly stupid,\nboring, and utterly predictable at every SINGLE turn. I have no idea\nwhy anyone would rate this above a 5, even if they had never seen a\nmovie before in their entire lives.<br><br>I've seen THOUSANDS of movies, and remember not one single redeemable\nmoment of this piece of garbage. I am completely confused by any single\npositive review. I have not checked rotten tomatoes yet, but I'd be\nshocked if it isn't 95% rotten.\n"},
{"review": "\nThis film has two of the most recent actors who have become more\npopular recently and also a long loved actress Kate Winslet. i think\nthis film is one of the best in its category as it not only pushes that\namount of scenes which includes violence and nail biting moments to the\nlimit.<br><br>This film is really the first of its kind it includes all types of\ntechniques from the actors and also the fact about the camera focuses\non the emotions of the characters which emphasises what the film is\nabout and links in still with the main storyline.<br><br>This is a film i would recommend for anyone seeking adventure, drama\nand action in a film also there will be a sequel to this film called\nInsurgent.\n"},
{"review": "\nMy review is not based on reading the book but solely on the movie\nalone. I found the movie very similar to The Hunger Games in the sense\nthat it divides people into groups and focuses on the teenagers. But\nthis movie was 100x better! It had me on the edge of my seat for most\nof the movie. This movie is inspiring and motivational. It is the type\nof movie that shows that accepting people for the flaws and their\nstrengths is important and that everyone is different in their own way\nand that it's okay to be who you are. I think more kids need to see\nthese types of movies and I would recommend it to anyone. P.S. Do not\nwatch this movie before or after The Fault In Our Stars cause it may\nmake things a bit weird haha.\n"},
{"review": "\nBefore watching this movie I looked at the ratings and choose it over\nother ones without second thoughts. 7.6 average, 45+ rated it over 7,\nthe hell of a movie! Didn't expected a mediocre YA movie. The plot is\nnot original, the actors are average, the effects both visual and audio\nbelow average, the action sucks pretty much, why should this movie get\nmore that a 6? Teens choosing a different path from their parents one,\nhow original. Getting tattoos, how daring. Playing capture the flag\nwith some drug- paint-ball weapons... I could go on for long, but not\nas long as the movie did: 140 min of teens doing teens stuff. The movie\nitself could deserve a 4 cause was not really a disaster but I rate it\n2 cause it was the worst movie I ever watched in theater and cause I\nexpect much more from a 7.6 movie. More boring that going to church!\n"},
{"review": "\nIt's a kids' movie. As my wife and I left the theater an 8-year-old\nbehind us said he'd seen it three times. We could barely get through\none showing. It's so bad that we broke into laughter at some of the\nsilly, stereotypical dialog and predictable plot elements. Kate Winslet\nwalks through her part as though she'd been blackmailed into appearing.\nKafka it is not. Not even close. It is obviously derivative of Hunger\nGames and does not even pretend to be the morality play or political\nsatire that some seem to think it represents. The closest it comes to a\n\"genre\" is a Hong Kong martial arts film, but most of those are better.\nNone of the characters act or react like real people. It's not good\nscience fiction, not good fiction of any other kind.\n"},
{"review": "\nI didn't expect much but this movie still managed to underwhelm me. It\ndoesn't contain a single original idea... None at all. Totally boring,\npredictable, dumb, and even the basic premise of the story is\nunconvincing to start with. This system with the 5 castes would not\nensure any greater stability for society than the system we currently\nhave. Even on a theoretical level, it would solve no problems and there\nis no logic behind it. They want people to rigidly adhere to a\none-dimensional category (I'm smart, I'm considerate, I'm fierce, I'm\nhonest, etc.) and they even assign castes for them but then they allow\npeople to choose? You can't have democracy and dictatorship at once,\nyou can't raise sheep but also urge them to have self-determination. So\neven the basic concept of the story is flawed, and no matter how good\nyour structure is, if it isn't built on a good solid foundation, the\nwhole thing will crumble. Take a look at the society in Brave New\nWorld, now that's hard to challenge, it's actually a very solid system\neven if it repulses us as we read.\n"},
{"review": "\nI'm a big fan of the book series, and I went into the theater with high\nexpectations. Veronica Roth pulled a Stephanie Myers (Twilight) when\nshe had no part in helping make this movie. I am one of those people\nwho want the movie to be just like the book and this movie was not like\nthe book! Now I could go through the whole movie pointing out what was\nnot in the book but i think i'll just do a few key components. First of\nall Edward did not get stabbed in the eye with a butter knife because\nof Peter. That was a really big part in the book! How could you cut\nthat out?! And that was not how the movie was supposed to end! They\nwere supposed to destroy the hard drive that contained the program that\nmade all the Dautless act like robots....but they didn't! Guess what\nthat means! It means the the other two movies will be ruined! I could\nsay more by i'll just end by saying, the box office will not be getting\nmy money for the next two movies.\n"},
{"review": "\nMy brain was working on full mode while watching this film. For most of\nthe time was asking myself: What is it about? And why it is so slow?\nAnd why am I watching this? How long it will be? Whan this torture will\nfinish? And my companion and I were trying to figure out through whole\nmovie one question: Why?<br><br>And much more. What war? Who is the bad lady? Who they are fighting\nwith? And much more.<br><br>Viewer is left alone with senseless images, which are esthetically\nnice, but repeating few times. Why I have to see the head of main\nactress 20 times from around? Twice is enough. It seems, that director\nhad nice camera and love to play with it, but it is just a holes filler\n- time consumer.<br><br>Music is so bad, that I wanted to wear headphones with own stuff,\ncompletely tasteless - typical Hollywood pompous style. At last there\nwas no symphonic orchestra like on most of films..<br><br>Actors just running around, lines are corny, the idea is missing. Half\nof the film is dark, and impossible to watch. I didn't read a book, and\nI will probably never do, because of this film - seems swallow like a\ndrop of water, with sentences containing three words in average. <br><br>If You are less than 11 years old, this film is good for you, but I was\nwatching better things that age..\n"},
{"review": "\nI'm a huge fan of the books. The psychological angst and inner fight\nthat Tris has to fight with and against. How she want, but cant,\nconform into the norm of society. How she, a little girl, is hated and\ndespised for something she has no influence over. The books have so\nmany layers of meaning that I sometimes marvel at it. <br><br>Now to the movie. I tried to watch it as a movie, not a adaption, and\nthink I did fairly well. Yet there are a few (or many) things that\nreally bothered me. The lack of chemistry between the lead actors. The\nacting in general wasn't very good except for Kate Winslet and Shailene\nWoodley who delivered with what they got. Yet, I am marveled over how\nplan, dull and one dimensional the film was. I never felt anything\nabout the inner struggle of Tris or the psychological terror that the\nenvironment is filled up with. <br><br>Divergent is a inconsistent tale that some will enjoy for the same\nreasons they enjoy Twilight (which I still haven't figured out how one\ncan). The only reason I'm giving it a 5 instead of a 4 is due to\nWinslet and her performance. Even though her character (that is one of\nthe most complex and sophisticated antagonist I've ever read about)is\nmade into the classical villain with megalomania.\n"},
{"review": "\nWith a 7.6 score at the time of my visit to the movies, I knew I may\nnot see the greatest movie, but certainly not get disappointed either.\nLittle did I know.<br><br>The basic idea of the movie: We live in a post-war world, where people\nare divided into factions, based on virtues. As young adults, they got\nto chose which one they want to join. Surprise surprise, we find\n\"divergents\", people that don't fit into the system and are threatening\nits existence. They are chased and killed in a totalitarian system.\nSounds familiar? I hope so, otherwise you have missed lots of movies in\nthe last decades. The last one I have seen was \"Upside Down\", and it\nwasn't a great movie either, but it is so much better. And it has only\na score of 6.4, I just really don't understand that.<br><br>There's really not much to say about the movie itself. Lots of martial\narts and gunfights, some kind of a love story, political intrigue.\nCharacters without faces, intentions without sense, a movie without a\njustification for existence.\n"},
{"review": "\nDivergent is a sci fi/fantasy type movie that is set in a futuristic\ndystopic society where all the population of the world is divided into\nfive factions that each represent different virtues. Teens who reach\nthe requisite age have to decide if they want to stay in their given\nfaction or switch to another, new faction, and either way that will be\ntheir faction for the rest of their lives. <br><br>Beatrice (Tris) Prior and her fellow faction members have to live\nthrough various challenges in a highly competitive and dangerous\ninitiation process to get the permission to live out the choice they\nhave made. These tests include extreme physical and intense\npsychological challenges which affect them all profoundly. <br><br>Beatrice's deadly secret is that she is \"divergent\", meaning she does\nnot fit into any one particular faction alone. If the wrong people find\nout this terrible secret she will be sentenced to death immediately. As\nshe discovers a growing conspiracy that threatens to unravel the entire\nworld, this secret might come in handy to help her save the people she\nloves, or on the other hand it could destroy the entire world.\n"},
{"review": "\nI always click \"may contain spoilers\" in case I slip, but I try not to\noffer any. And as i write this review, I should admit that I never got\naround to finishing the book, so I can't say how true the film was to\nit. But I can say how true the film was to, well, films in general, and\nthat was this: average. The pacing was poorly assembled. How the world\ncame to be the way that it was was never explained. Why Kate Winslett\nwas in the movie was unfathomable. This may be a spoiler, so stop\nreading if you wish to avoid such, but when our heroine and others are\nbeing trained in hand-to-hand combat, they adopt some sort of weird\n\"I'm hugging a skinny person to my chest\" stance with their hands and\nkeep their legs almost entirely straight. This is guaranteed to have\nthem get the crap kicked out of them. But the good points: the\ncharacters were consistent all the way through. Good point, I guess\nthat was. My advice: Wait for this one to hit the premium channels.\nMore advice: While Divergent was the first in a trilogy, and Hollywood\nhas a way of making a trilogy into four or five or seven movies, don't\nexpect a sequel. This really was that sort of weak.\n"},
{"review": "\nI have known about the books for quite a long time, my friend\nrecommended them to me. So I finally read the book a day before the\nmovie come out to theater. I gotta admit that the books are awesome,\nthe story is intriguing. And I cant wait to watch the movie. And then I\nwent to theater to watch the movie. From the beginning, I have doubt\nabout the cast. Based on the book, Tris' body should not be that big.\nAnd after the movie played, everything was falling into ashes. The\ncasts are awful. I expect that peter would be someone who have an\narrogant face, but instead.. Jainine, Kate winslet is an awful choice.\nJainine should be played by Charlize Teron, or someone who have a\ntypical face like that. And I felt that the casts are lack of\nchemistry. The story. Yeah I get it that it's impossible for a\nbased-on-book-movie to have exactly same story like the book. I didn't\nexpect that it would be this different. They ruined the whole story.\nEverything is changed. Its like I was watching a different movie with\nthe same title. I came with some expectation that the movie wouldn't be\nas good as the book, because it always happened, but I shocked that\nthey could for god's sake made it that awful. They have changed an\nawesome story into pile of crap.\n"},
{"review": "\nThis is my first review on IMDb and I am very much upset to watch this\nmovie. The way they advertised the movie I thought its going to be\nsomething but in real its nothing but a poor try to adopt a very good\nbook. I was wondering all the time what is the big deal of being a\ndivergent than when I came to know there was only one question \"so\nWhat?\".<br><br>Personally I am a big fan of Shailene Woodley, I have already listed\nher as one of my favourite diva but watching this movie I would say she\ngot beauty but no talent. Her expression shows lack of seriousness.\nStill the 5 stars I gave this movie is only because of her.<br><br>I am never gonna recommend anyone to go and watch this movie.\n"},
{"review": "\nDivergent is an entertaining movie to sit and enjoy, that's for damn\nsure, it was actually better than what my expectations preceded.\nShailene Woodley shines in her staring role as Beatrice, and Theo James\nis so perfect for his co staring role as Four. My absolute favorite\nactor here though is hands down Kate Winslet, she is so focused,\ndetermined, and unapologetically devoted to her maniacal plot, and it's\nobvious that she gave it her all the entire way through. The costume\ndesign is wonderfully constructed, especially for the Elite characters\nlike Winslet. And the set direction is awesome to look at, very well\nput together. The action sequences are pretty standard PG-13 action\nmovie material, not meaning that in a bad way, just saying you know\nwhat you're getting when it comes to that specific issue. The plot is\nvery intriguing and it will for sure keep you interested and wanting\nmore. Ashley Judd is great to see on screen here as well, a very noble\naddition to the well rounded cast, she is caring, adventurous and warm\nhearted in her motherly role to Beatrice. I really loved the dialogue\nback and forth between the characters too, very intelligent and witty.\nI cannot wait to sit and watch Insurgent, and then Allegiant, crossing\nmy fingers in hopes they will prove themselves worthy, like this first\ninstallment did. An 8/10 for Divergent!\n"},
{"review": "\nThis movie was astounding. Even though it may not be exactly like the\nbook, the characters, acting, storyline, etc, WERE ON POINT! The actors\ndid a great job as especially the main characters Four (Theo James) and\nTris (Shaliene Woodley) did so good at expressing the actual romance\nfrom the book that people actually wanted them to be together in real\nlife. This movie also has a lot of action, and also was suspenseful as\nsometimes I wouldn't expect people attacking Tris at one point and etc,\netc. I don't know why so many people are hating on this movie when it\nwas so compacted with all the emotions from betrayal, to sadness, to\nanger, to happiness, to romance. But you know haters gonna hate.<br><br>This movie is just hands down very well put together.\n"},
{"review": "\nTo begin with, the movie was horrible as we all expected.The thing is,\nthat horrible movie made some serious money and proved that there is no\nneed for new ideas and good writing for a movie to achieve that kind of\ngross.<br><br>Why invest time and effort on a better movie when we can just modify\nour target audience expectations? That's why every now and then a new\nMtv-like teen actor who's interviews are like audiobooks of what their\nmanagers has given them to read pops up into the movie business.<br><br>The formula is now known. A teen next door who is just so random and\nsocially awkward and can't stand mainsteam fashions and activities is\nglobally cherished as other teens crave for someone to relate to.<br><br>However, that's not a new thing. In fact it's the same thing that macho\nmen and dynamic women represented in the 90s as well as the 80s. The\nthing is that those actors, because of their Hollywood persona,\nactually had a personality. Now teen actors have nothing that would\ndifferentiate them from one another except their face. They are just\nmirrors for teens to put themselves on as they have no characteristic\nthat would not match with any of their own.<br><br>That's why we end with such talentless and without personality actors,\nand a script that supports such characters:<br><br>\"A common teen like any other (THAT COULD BE YOU!) finds him/herself in\na situation of him/her being different of their peers(OMG THAT'S LIKE\nTOTALLY HOW I FEEL!) and achieve greatness being a non conformist in a\nworld full of conformists.\" sounds familiar?<br><br>Please stop paying for such movies. Make them try harder.\n"},
{"review": "\nI didn't watch this when it came out in movie theaters because I\nthought the preview looked stupid and basic. I was partially right. It\nis a basic form of a dystopia fighting to become a utopia. It is very\nsimilar to the hunger games which is why I dropped from 10 to 9 in\nratings. Other than it being too similar to the hunger games, it was a\ngood movie. I was not expecting both of Tris' parents to die. I did\nwish Tris and Four had more scenes together. Maybe in their new series\nthey will explore their relationship further. I was not a fan of how it\nended. Tris and Four just left the dystopia with all the leaders still\nalive. Obviously, they will come back for revenge. Overall, I can watch\nit over and over again because they picked a very good cast. I also\nunderestimated Shailene. I use to watch her \"secret life\" show on ABC\nfamily, so I was expecting her to be an over dramatic character. She\nplayed this part well.\n"},
{"review": "\nTake any C-movie in the SF genre, wash it at 90 degree C until all\ncolors are gone and that is what \"Divergent\" does.<br><br>A silly and unrealistic plot with no other place than maybe in a\nteenager TV series.<br><br>All society divided in factions according to character: kind people,\nbrave people, intelligent people and so on...not even the Japanese TV\ndramas have such a rigid classification of roles for its characters.<br><br>I read somewhere that Kate Winslet took the role because of her empathy\nwith a story again against all-controlling regimes, but....her more\nthan excellent acting skills are definitely wasted here.<br><br>Rent \"Barbarella\", if you are in the mood for an easy SF movie, and\nyou'll have a much better experience.\n"},
{"review": "\nGood screenplay and all - but the actors where stiff, and the trailer\ngave off the idea of some amazing action / sci-fi movie - which turned\nout to be some teenage love story / empowerment to teenage girls. I\nwent in expecting to be kept on the edge of my seat with all the\nexciting things, but when the people started jumping off trains, i\nseriously wanted to start cracking up laughing. I lasted about 20\nminutes into this, then couldn't handle it anymore. I've heard people\ncompare it to hunger games - WRONG. I love hunger games, this was just\nterrible! If i had of honestly known what this movie was going to be\nlike - i wouldn't have even bothered to download it.\n"},
{"review": "\nHo-hum!.... So, ask me if I was at all surprised (even slightly) when\n(guess what?) Divergent's totally, starry-eyed, little tale of the\nfuture was conveniently twisted into yet another full-blown Romeo &amp;\nJuliet story where, this time around, teenage jocks (both male &amp;\nfemale) plunged head-long into serious training to become the coveted\n\"Dauntless Ones\".<br><br>And was I at all surprised to find out that Divergent's futuristic\nsociety was, once again, a nation that blindly preached peace through\ntotal threat and enforcement of violence?.... No. I was not surprised.\nNot in the least.<br><br>If you ask me this utterly pretentious, $85 million production was just\nanother version of \"The Host\", but, of course, this time it was all\ndone on a much grander scale, with definite shades of \"Starship\nTroopers\" thrown in for good measure.<br><br>At 2 hours and 20 minutes, Divergent really pushed the limits when it\ncame to being tolerable entertainment. In general, I thought that most\nof the cookie-cutter characters in the story were just a bunch of\nshallow, two-faced, arrogant snots and I couldn't have given a\nsweet-damn whether they ever triumphed in their goody-goody, little\nmission, or not.<br><br>All-in-all - Divergent was nothing but superficial fluff marketed\nexclusively for a very gullible, non-thinking audience.\n"},
{"review": "\nWhat do you get when a someone who knows literally nothing about\npsychology, sociology, neurobiology, bioengineering, or history tries\nto write a story involving plot points that require an intimate\nunderstanding of ALL those disciplines? Divergent. I have not been this\nannoyed at a movie since...I guess Sucker Punch? 1. Most people would\nbe \"Divergent\". a. Most people have multiple skills b. Most people have\ndifferent thought processes (there are 16 outcomes on Myers-Briggs, not\n5...and even 16 doesn't truly cover every person: and often people get\ndifferent results at different times) c. Δperson/Δtime !=0 (people\nchange) d. Additional reasons are an exercise for the reader 2. Drug\ntouted to be little more than truth serum makes remote control people\npuppets. 3. ASSUMING most people were not divergent, there would be no\nreason not to want them. a. Divergents clearly are willing to follow\nthe rules of society - their multiple talents do not prevent them from\naccepting this path. b. Divergents bring unique skillsets to their\nparticular jobs that would otherwise be unavailable to a given Faction.\nc. etc. 4. Assuming most people were not divergent, what could have\ncaused such a dramatic psychological shift? I _really wanted to like\nthis movie, it was perfect in many ways, but the core concept was so\nflawed I could only hate it. Syfy originals have more meat to them than\nthis garbage.\n"},
{"review": "\nI liked it the first time I saw when it was called The Mortal\nInstruments: City of Bones.<br><br>Without giving spoilers it's still basically youth that knows better\nthan authority, no one understands me. Grown ups are corrupt and don't\nknow anything. It seems like most movies with a young cast will be\nfighting authority or adults. Though in reality I would have to say\nthat when youth is in charge you usually wind up with a Lord of the\nFlys situation or 100 which I like so far. But lately Hollywood keeps\nputting out these repetitive movies. At least Hunger Games, Harry\nPotter, and Ender's Game had interesting twists.\n"},
{"review": "\nThe movie was so bad. It was a good concept from the beginning, so on\nits own it may have seemed great to those who haven't read the book. If\nyou have read the book, however, you would have noticed that more\nthings were left out than kept in, things happened at way different\ntimes than originally, important and thrilling scenes where twisted\nresulting in unimportant and boring parts, and many characters,\nthoughts, and important phrases were almost completely left out. This\nis the first movie that I have ever despised. However, whether you\nbelieve the movie is good or bad, and you haven't read the book, please\nread it for your own good. It is honestly one of the best I have read.\nThings you missed in the movie: The hardcore ship you will have for\nChristina and Will and, obviously Tris and Tobias, so many intimate\nmoments, the fact that Four is not called Four by Tris once she knows\nhis name, how Molly, Peter, and Drew are complete and utter butt holes\nand you will want them dead as much as Tris does, and many more that I\ncan't list because of the word limit. Honestly, just read the book, or\nlisten to it.\n"},
{"review": "\nIf it were not for the few action scenes and the obvious will for the\nunknown part of the cast to finally break trough in Hollywood, this\nrating would have easily been a 2.<br><br>Divergent has been the online hype for the past six months, and there\nis honestly nothing that stands up to whatever buzz it has created. It\nis a demoralizing vulgarization of master pieces like 'A Brave New\nWorld'. Except it has been very unfortunately mixed with 'Twilight',\n'The Hunger Games', and that it now lies somewhere between bad and\nworst.<br><br>To think that experienced and successful actresses like Kate Winslet\nand Ashley Judd signed in to co-star with a whole bunch of TV stars -\nmostly big screen wannabees - on the basis of such a terrible scenario\nis pretty self-explanatory in itself: Divergent has only one objective,\nand that is to create a cash cow like the other recent teenage\nfranchises.<br><br>It could be called sad, but in the end, there is nothing wrong with\ndoing money. The only problem nowadays is that poor writers just loot\ntheir plots from inspiring master pieces from the past. With Divergent,\nHollywood keeps on being Culture's Tomb Raider.<br><br>Actually, it is sad.\n"},
{"review": "\nI understand not keeping things 100% the same in book to film\nadaptations, especially if they're not integral parts to the plot or if\nthey don't translate well to screen, but many of the things that were\nsuspenseful in the book were completely removed or trimmed away to help\nget that pg 13 rating and while sometimes less can be more, it\ncertainly wasn't in this case as much of the gravitas and suspense\nbeing removed and trimmed away as well, there was not even any lack of\nurgency until the film was partly in it's second half.<br><br>I also feel like somethings should have been explained better for those\nwho hadn't read the books. For instance in the film and even the\ntrailer we see the character Tori tell Beatrice that \"you're divergent,\nthe test didn't work on you\" but in no point of the film do they really\nexplain why the initial test didn't pan out, I mean we see how Beatrice\nmanipulates the tests later on even in the trailer (\"this isn't\nreal\"/breaks the glass) but we never get the reasoning why she tested\nfor multiple factions thus being divergent\n"},
{"review": "\nI love films set in the future, but this film had nothing futuristic\nabout it. It may have well have been set in 1940 as thats the level of\ntechnology you see in this world.<br><br>I have not read the book, but this film was boring. For over two hours\nyour watching nameless kids go to school. But nothing happens! There\nare no student rivalries, no interesting characters that set them\napart, no class clown. Every character was EXACTLY the same and none of\nthem did anything unique or memorable.<br><br>If there was a villain, i didn't see him or her in the 100 minutes i\nwatched it before walking out. It was just a bunch of kids attending\nclass! Even the teachers were kids. Adults don't even exist in this\nworld for longer than a few seconds every half hour.<br><br>No explanation was given about the war, the world, the wall. The class\nfactions might have been benefited by a sixth faction called 'builders'\nthat actually tried repairing all the buildings in that city. As it\nstood, there was no-one around to build or repair anything. <br><br>The whole mystery about 'divergent' was barely touched in the time I\nwatched it, and I had given up waiting for answers when I walked out. <br><br>It lacked any likable and interesting characters, any resemblance of a\nplot other than completing high school, it lacked a villain or conflict\nof any kind. Story-telling 101 was ignored completely and the only\nthing that gave the rating an extra star was the cinematography and\npanoramic views of the destroyed city which impresses well for a few\nseconds, before being ruined by the characters getting in the way of\nthe camera and blocking our view.\n"},
{"review": "\nFirst of all sorry for any English mistakes. I watched this movie just\nbecause of a great review that was saying that the movie exceeded the\nexpectations etc, but believe me, this film is full of clichés, don't\nrecommend to watch it on the theater, maybe is better to wait to arrive\non blue-ray, I think the movie was made for the teenage public, because\nof that you are going to see all the peaces that worked in other teen\nmovies on this one, I am just doing this review to alert the people\nthat really likes a well constructed film, with a good script and not\nintended just to win money.<br><br>However there is a good part about this movie, if want to see something\nwith your girlfriend, something that you don't need to pay much\nattention or something that you can take a nap and wake up, this a good\nmovie to do so, I don't need to say much about it, just watch the\ntrailers, if I had watched and just didn't believe in just one review\nof one person I would really chosen another film, bye and good luck!\n"},
{"review": "\nI went to see this movie yesterday with two good friends of mine. One\nof them had read the book with me, while the other one had not. The\nentire movie was brutal to sit through for all of us. Those who had\nread the book were severely angry over the lack of context, events, and\neven characters that Veronica Roth's novel contained. Those who hadn't\nread the book sat there confused at some points, and bored at others.\nThe lack of Tris and Four's developing relationship made it sudden and\nawkward, very far from the book's snowball of romantic events. The\nacting was also extremely bland, and a lot of the characters did not\ndevelop enough to form a connection with the audience.<br><br>I do not foresee any other movies being made from this series. It's\nimpossible! The characters that were not featured in this movie are\nrevolutionary figures in the second, making it impossible to have a\nmovie without them. Do not go see this move, please. Do yourself a\nfavor and read the book, it is much better.\n"},
{"review": "\nSpoiler alert! This series is absolutely amazing. I'm an avid fan of\nscience fiction all the way back to Metropolis to Buck Rogers to Star\nTrek to Barbarella to Star Wars to Avatar. What makes this series so\ncool is the social fiction more than the science fiction. Not to\ndownplay cool science fiction threads and special effects along with\nthe stunts but the future's social structure in this premiere of the\nseries is just absolutely brilliant. Many science fiction stories take\nyou on a journey,adventure,exploration beyond our world but I always\nlike social fiction based upon our existing world and what could be.\nThe thing about movies is being taken away to that larger than life\nessence for a while, Divergent is no exception; except that maybe it\ndoes it more exceptional than most movies do.\n"},
{"review": "\n\"Divergent\" is the first Sci-Fi movie of this trilogy and in this movie\nwe watch a world that is divided into factions and each person has to\nbe a part of one. Unfortunately Tris cannot be a part to any of these\nfactions because she is a divergent. Divergents are considered as the\nmost important and dangerous people and have to be eliminated but why?<br><br>I liked this movie because it has a different kind of plot from other\nSci-Fi movies and that's something that made this movie interesting at\nfirst. The direction which made by Neil Burger was very good with many\ngood action scenes. Also the interpretation of Shailene Woodley who\nplayed as Tris was very good. An equally good interpretation made by\nTheo James who played as Four.<br><br>Finally I have to admit that I did not expect much from \"Divergent\" but\nit was a very nice surprise. This movie made a very good start for this\ntrilogy and I hope to continue like this and even better.\n"},
{"review": "\nNow here's the thing: I've read the book, which means I started the\nmovie knowing what to expect. So the cheesy plot, the seemingly\nnonexistent background, everything was already inherent to Divergent in\nmy mind. To me, it was simply part of the concept that the movie would\ndevelop, so I didn't find it so horrible. In fact, I even thought it\nwas a good adaptation of the book, but then that could have been\nbecause I read it over a year (or maybe even a couple of years) ago. I\ncan't say it was objectively good, though.<br><br>The romance was awful, there seemed to be no chemistry between the\ncharacters in question, they definitely would have been better off as\nfriends. Time seemed to be off too. I mean, I knew quite some time was\nsupposed to have passed between (SPOILER)the choosing ceremony and the\nfinal confrontation(/SPOILER), but the director didn't seem to be able\nto convey the passage of time properly, so hadn't I read the book, I\nthink I'd probably have a sense of timelessness and would see it all as\na bunch of things that happened somewhere at some point with some\nunknown amount of time separating them. <br><br>Not only weren't characters really unique or remarkable, but also the\nfilm lacked emotion and thrill. Most scenes that could have been\nintense seemed to be left unexplored in detriment of more fight scenes\nand, seeing as I'm not really a fan of action (or romance, for that\nmatter), I didn't care much about all that violence. <br><br>Despite all that, I did enjoy myself while watching it. I don't know\nwhy. Maybe seeing images I'd only had in my mind be put into something\nreal and concrete made it special to me, maybe I already knew how bad\nit could be, so whatever good thing came of it was surprising enough...\nIn the end, I'd say this is a movie for you to watch when you don't\nhave much to do and you just want to relax.\n"},
{"review": "\nPicture this: a post-apocalyptic closed society maintains a series of\nsocial strata, but then one young person doesn't conform. Sounds like\n\"The Hunger Games\", doesn't it? Well, \"Divergent\" also uses this story.\nI had never heard of this series before the first movie got released.\nHaving seen the movie, I can only conclude that they simply used the\nidea behind \"The Hunger Games\" and added a bit of Harry Potter (the\nserum-induced psychological test to determine a person's faction\nreminded me of the Sorting Hat).<br><br>So, this franchise doesn't come across as anything original. I wish\nthat someone would film Kim Stanley Robinson's \"Years of Rice and\nSalt\".\n"},
{"review": "\nInception meets Brave New World, but dumbed down for kids. You could\nalso throw in a few other dystopian/post-apocalyptic movies and books\nthat this is derivative of (not that Inception is such a movie, but the\ndreams-within-dreams scenes in Divergent reminded me of that).<br><br>So, derive a plot from these books/movies, then dumb it down for kids.\nHero(ine) is a teen. The good guys are the running, jumping, climbing,\nfighting types, not the intellectuals, or anyone else. (The perpetual\nrunning, jumping and climbing actually made the Dauntless people quite\ncomical, rather than heroic, to me. Their whole shtick just seemed so\nlame). <br><br>Throw in the usual underdog prevails against the odds and ultimately\nbecomes a hero routine, with a bit of romance and an evil conspiracy by\nthe adults/non-action types and you have your common-or-garden teen\naction movie. <br><br>Only positive thing I can say about this is that at least it was better\nthan The Hunger Games (but only marginally so). At least Divergent had\nsome semblance of grit and edginess - Hunger Games is a like a Disney\naction-movie.\n"},
{"review": "\nFor a movie that celebrates critical thinking, it does not really allow\nmuch of it while watching. The futuristic dystopian setting is hard to\naccept, and even if you do, it's difficult to understand the\nmotivations of many of the characters in it.<br><br>It is similar to many other \"young adult\" movies, and it probably hits\nits target audience better than it hits me. But, allowing for some plot\nholes and similar, I wish the setting had been more interesting and\nunderstandable. Maybe this will be more in focus in the later movies?\nWhy the society looks like it does? It is never really awful, though.\nIf you manage to go along with the premise, the movie is easy to\nswallow. Perhaps a bit too long, but mostly the movie kept the story\ngoing throughout.\n"},
{"review": "\nNever thought I would ever write a movie review but this movie was SO\nBAD bad that I felt obligated. If you value movies as an art form then\nyou have no business in giving an money to this movies cause. From the\nacting to the story line the movie had a production level on par with a\nhigh school play. The acting was so laughable it has me convinced that\nto prepare for the movie the cast were all taught at a 3rd grade level\nacting camp. The fact that this movie has a 7/10 indicates that most of\nthe people with any sort of theater knowledge were sick on the day IMDb\nrated it, or they found this movie so hilariously poor that they gave\nit a positive rating to make fun of this production. Please heed my\nwarning and avoid this movie at all costs.\n"},
{"review": "\nBefore start with the analysis, just to give a quick opinion for those\nwho don't wanna spend much time reading: If you older than 13-14, don't\nwaste your time. <br><br>I am not quite sure how long has it been since I've seen such a bad\nfilm, and by bad, I mean bad. This movie has nothing. No photography,\nno costumes, no soundtrack, the direction is at best mediocre, and the\nstoryline does not even exist. 1h45m of static, stuck and non-\nprogressing plot, with the saving part at the end, saving the city in\n10 minutes and that's it. First of all, whoever wrote this should be at\nleast ashamed. A boring, blunt, cliché and repetitive classic storyline\nabout a little girl that can not fit the society and wants to be\ndifferent and not in types?? I mean, what is the target group here? 13\nyears old teenagers? Furthermore, the whole film has absolutely no\nsense. The main problem of the character is that she is not clearly\noriented into a faction because she is intelligent, brave, has\ncompassion and she's kind. What a nonsense. <br><br>Further more into this, the acting is just terrible, like if someone\nwould pick a random person and ask him/her to say these lines. Only\nexception is the death scene with the mother of the heroine where the\nacting is bad/mediocre. All the rest is not even acting. No dialogs, no\nstrong scenes, not even one monologue, nothing. <br><br>2 stars only for the fact that this was not shot in a camcorder, and\nfor casting Winslet (what was she thinking...)\n"},
{"review": "\nThis move was just bad. I really had no interest in see this movie. I\nhave seen so many movies like it I could easily tell what would happen\nnext. The actors where even worse it was a lot like watching a movie\nwith the same actors as zombie apocalypse or 2 headed shark attack...\njust awful. You would think that in 100 years they would have rebuilt\nthat city. It could not be that surprising that there \"system\" would\nhave failed only after only 100 years. They should have started out\nsaying why the everything had fallen. That part is probably for another\nmovie. Let me guess that where will be about 3 movies. First one how\nthey broke the system, Second one how it got like this, and Third is\nlikely to be about more survivors but I hope they don't make more about\nit.\n"},
{"review": "\nQuite possibly the worst film I have ever seen. Whoever wrote this\nsteaming pile of utter drivel should be punished for the pain it\ninflicts on viewers. The 'director' should never be allowed to work\nagain. Awful writing, embarrassingly clichéd, terrible acting.\nHonestly, save your time and sanity and go stare at a wall, it's far\nmore interesting than this crap. I really don't know what's happened to\nHollywood filmmaking of late but it certainly seems they've managed to\nplummet to new depths of drivel. IMDb needs to start a negative rating\nsystem because '1' simply doesn't do something this bad enough justice.\nAvoid this like the plague people or, if you have to choose, take the\nplague. You'll feel better for it!\n"},
{"review": "\nTake a brilliant concept that reflects some possible future scenario -\ninspired by the marvelous Aldous Haxley's 'Brave new world' - add a\ntwisted 'matrixinian, hunger games' wanna be variation from Veronica\nRoth - and finally make a Hollywood film out of it; what do you have?\nAn insult to human intelligence.<br><br>The first 5 minutes of the film, focused on the essence. They where\ngreat. The rest of the long 2 hours where a bad mixture of the hunger\ngames without the hunger, the matrix without mr Anderson, star treck\nwithout the stars, and dumb running, kicking, fighting, agonizing for\nno reason what so ever mambo jumbo. <br><br>Overall quality? No better than a B class TV series. So why 7.4 in\nIMDb? Surely can't tell (paid reviews I presume). So I give a one star\nto balance things out. <br><br>What is the message? In a future where mankind faces serious identity\nissues, where individuality is replaced by casts, where society is a\nthreat to humanity... then what does one do??? Learn karate, pick up a\ngun and shoot the hell out of the bad guys!!! Wooaaoou! Totally mature\nand intelligent! I seriously prefer swangeneger's philoshopy 'Destroy\nda planat and get da hell oder heeer'.<br><br>Hollywood's intention: Insult humans to the degree they begin to like\nit. Make ridiculous films so that every one turns into TV shows. Then\nkeep serving them insulting TV shows... they won't mind... they are\n'brain dead' to quality and originality. Thank's Hollywood, I'll pass\n(next time at least, cause I wasted 2 hours+ watching this crap).\n"},
{"review": "\nDon't get me wrong, I am a huge fan of the Divergent Series. I am\ncurrently reading Insurgent. I was excited when Divergent became a\nmovie. Since the book was amazing I had high expectations. Sadly my\nexpectations were not met. They had skipped many important plot points\nthroughout the film. A few examples are why Tobias is called Four, the\nback story of Tobias (which was only briefly mentioned in his fear\nlandscape), when Tris is caught by Eric after going to the Erudite\ncompound, Peter feeling up and degrading Tris's body when they try to\npush her off into the chasm, for capture the flag they originally use\npaint balls, Christina grabs the flag, Tobias originally is the only\nperson in the control room and he was the one to shut it down, and many\nmore. The ending left out a great deal of conversation between Caleb\nand Tobias. Peter and Molly are made to look less violent and extreme\nin the movie. There were not many fight scenes which was disappointing.\nThey also did not add a lot of scenes where Tobias and Tris start being\nclose. The movie made their romance so sudden. The book is definitely a\n9.5/10 but the movie lacked and strayed from the book thus why I give\nit a 6/10.\n"},
{"review": "\nThis movie sucks and it sucks big time. Believe me, this is the first\nreview of my life for a movie. I simply can not believe that the\naverage rating is 7.5 in IMDb.<br><br>Please save yourself from watching this meaningless piece of crap! I\nwatched this movie along with my 6 friends and none of them knew which\nmovie we are gonna watch, they just went because of me.<br><br>It is just too slow! 140 MINUTES!<br><br>I lost all hope for this movie after 100 minutes were passed and we\nwere thinking of going out of the cinema.<br><br>Interesting storyline made in to sh1t due to crappy performances from\nall of the actors.<br><br>Somewhat similar to Hunger games. However, Hunger games was much much\nmuch better than this poor attempt.\n"},
{"review": "\nOverall, this movie clearly had a targeted audience, teen girls. The\nmovie itself is not a bad movie, but i am not in its target audience so\ni didn't enjoy it that much. The music was teenie, acting was average\nat best, plot was mostly predictable and very easy to follow. The story\nline is stupid...splitting everyone its factions, ya cause we all know\nthat wont cause problems and power struggles. I never read the book,\nbut the movie had major holes and it was almost hard to watch. There\nwas minimal action and comedy and it was mostly about teenage\nproblems:fitting in, hot \"bad guy\" guy and such and such...Unless you\nare a teenage trapped in a adult body, this movie is below average, but\nit could be worse.<br><br>I've seen worse, but I've seen a whole lot better\n"},
{"review": "\nFor a movie with so much hype around it, this was just terrible. I\nhaven't read the book and considering what I saw as the story, will not\nread it. I know this is fiction but the story sounds plain stupid.\nPeople are split into factions? Its as if everybody's brain went\nthrough some mutation and they lost their human nature itself. Don't\ncare how it is explained in the book, but its not explained in the\nmovie at all. <br><br>Very bad story, average acting, full of clichés, very slow.<br><br>Even if the books are not as bad as the movie, the adaptation totally\nfailed. Lord of the Rings was made out of a book. I never read it but\nlook at that movie. That's how you make movies.<br><br>Absolutely not recommended. Sheer waste of time.\n"},
{"review": "\nI wanted to like it. I really did. After reading the book I was looking\nforward to this film and could not make it through without fast\nforwarding. The main problem is the story which is highly narrative\ndoes not translate. Not that it couldn't have. The screen writing is\nterrible and is largely word-for-word from the book. Key elements to\nunderstanding the characters and the story are missing from the film. I\ndon't know how anyone could understand the film without reading the\nbook. Honestly a horrible film and the screenwriter should be\nembarrassed.<br><br>Since the film has lucked into earning a lot of money and therefore\nsequels, hopefully they will take this as an opportunity to bring in\nnew screenwriters and editors.<br><br>Don't waste your money for sure. Only waste your time if you are at\nhome and doing something else at the same time.\n"},
{"review": "\nIt's hard to come up with ten lines about this movie. This \"Hunger\nGames meets Harry Potter\" disaster does not make any sense. It's both\npredictable and insanely boring. But above the lack of cinematic\ninterest it's just dumb. <br><br>I don't get where did the get the inspiration for the Dauntless, but to\nme they are just a bunch of idiots risking their life for no good\nreason. They are supposed to be the military men of this new society,\nbut they do no reflect any traditional military values, they are\nreckless, undisciplined, and their training looks like is only designed\nto injure their own members. <br><br>In the end, beside the poor explanation they give for this \"dystopian\"\nfuture, and the incredibly absurd plot, the movie is just not\nentertaining enough.\n"},
{"review": "\nI'm a fan of near-future films set in dystopian worlds, but this\n'Hunger Games' rip-off never tries to reach beyond its obvious\n16-24-year old demographic. Young adults are assigned to clan-like\ngroups based on their personality type. Those who do not fit any\nprofile, Divergents, are seen as a threat. This flimsy premise is the\nbasis for an incoherent narrative that neither entertains not provokes\nthought. The sole purpose seems to be to show the young, fit cast\nrunning, jumping, climbing, punching, kicking ass and wielding big\nguns. Kate Winslet mugs it up and it would not be a surprise if she\nwinked directly at camera. I wasn't expecting it to be 'Gattaca', but\nthe fact that it is this flat and predictable is disappointing.\n"},
{"review": "\nA 10 year old may enjoy this movie, but for the rest, it sucks. There\nis no reason to like any of the characters. The lead female is not even\nattractive to look at. Whenever a female character is trying to be like\na male, I don't find it attractive in any form or shape, and if the\nface is nothing to look at then it's bad news all over. This movie is\nthe production of a marriage between Harry Potter and The Hunger Games\nwhere the mother (The Hunger Game) drank too much alcohol, smoked too\nmuch cigarettes and used every possible drugs during its pregnancy, and\nguess what, the child comes out completely deformed, mentally deranged,\nhorrible to look at, and unbearable to watch. The CIA should use this\nmovie to get confessions out of the Al Qaeda suspects. It works. My\nex-wife used it on me and I confessed to everything. Bad story, bad\nacting, bad everything. There are better movies to watch.\n"},
{"review": "\nOK, where to begin. Why oh why does this type of crappy, stupid, make\nno sense, dribble, poor excuse for a movie get made? I rolled my eyes\nthru out the movie. So many issues, why this has over a 2 rating is\nbeyond me. The plot was stupid, each scene was so predictable, You knew\nthat Four and Trish were going to get together, they didn't bother with\ntrying to develop why they ended up together, it just spontaneously\nhappened, their 'love' story was completely unbelievable. Why was there\na train running? Who was running the train? What was the purpose of the\ntrain other than something for the actors to jump on and off?! Trish\nbecoming a kick ass fighter was totally unbelievable as well, the\nactress who played her did not pull off becoming 'tough' I laughed at\nthe parts she was supposed to be beating up others, it was soo corny.\nThis movie was boring, dumb, nonexistent plot that made any sense.\nDon't believe the 7.5 rating\n"},
{"review": "\nI am about 35 mins away from finishing this thing and I am still lost!\nI paused the movie and started reading these reviews trying to see if\nit could help me understand what the f is going on.. But I actually\nended up realizing, I should have read first then deleted movie..lol.\nBTW... this movie is miss labeled.. It is certainly NOT scfi.. At least\nnot in the way I thought. I was expecting this \"divergent\" person to\nhave some sort of a super power, super strength, or reality-bending\nmind to change the world with..but..it just turns out, all she is, is\nsomeone who doesn't conform or think they should be labeled one\nparticular class of society. BIG FREAKIN DEAL!!! Who cares.. Thats all\nI got to say about the whole damn thing...lol\n"},
{"review": "\nHonestly was very disappointed by this movie.<br><br>If I hadn't read the book first I'd be totally lost as to what's really\ngoing on. They do not explain anything and to top that off it's not\nnecessarily the same as In the book either, so much left out is really\nneeded to tel the story. There was nothing keeping my attention on the\nscreen.. Boring, predictable, badly written, badly acted and just plain\nblah. I went into watching hunger games thinking the worst and couldn't\ntake my eyes off, but this movie I thought would have the same\nexcitement and falls far short. If they come out with the rest of the\ntrilogy it might be a miracle I can't see spending all that money for\nnothing..\n"},
{"review": "\nWow, this was pretty rough to watch... Honestly,there was nothing good,\nnothing. Bad script, bad acting and plot holes everywhere. Even the\nopening dialogue of the movie contradicts itself... Only a minute in\nand you know this is gonna suck. I would say anyone that gives this\nmovie 5 stars or more is most likely a paid reviewer,scamming you. What\nwas the point of the movie? Why did it even need to get made? I don't\nknow anything about the book, maybe if it went deeper into the history\nor something...even still I just can't see how anyone could enjoy this\nPOS. I wasted my$1.50 at redbox,just glad I didn't see it in the\ntheater, man that would have been painful.\n"},
{"review": "\nDivergent\" is all about identity\u0097about searching your soul and\ndetermining who you are and how you fit in as you emerge from\nadolescence to adulthood. So it's all too appropriate that the film\nversion of the wildly popular young adult novel struggles a bit to\nassert itself as it seeks to appeal to the widest possible audience.<br><br>It's the conundrum so many of these types of books face as they become\npop-culture juggernauts and film franchises: which elements to keep to\nplease the fervent fans and which to toss in the name of maintaining a\nlean, speedy narrative? The \"Harry Potter\" and \"Hunger Games\"\nmovies\u0097which \"Divergent\" resembles in myriad ways\u0097were mostly\nsuccessful in finding that balance.<br><br>In bringing the first novel of Veronica Roth's best-selling trilogy to\nthe screen, director Neil Burger (\"Limitless\") and screenwriters Evan\nDaugherty and Vanessa Taylor have included key moments and images but\ntweaked others to streamline the mythology and move the story along.\nThe results can be thrilling but the film as a whole feels\nsimultaneously overlong and emotionally truncated.\n"},
{"review": "\nIf you're stuck on a long flight with little else to do, then you may\nend up like me stuck watching this terrible movie.<br><br>The post-apocalyptic setting always has potential. But this script and\ndialog are dumbed down to a nauseating level. Delta may need to\nre-stock those vomit bags.<br><br>The cast is star-laden. But Kate Winslet should be ashamed of herself\nfor accepting her role in this movie. The other stars don't do\nthemselves any favors either. Though it's hard to tell if they were\nlimited by the horrendously unimaginative scripted dialog...<br><br>Overall, just a terrible cliché Hollywood movie with a very boring\nending.<br><br>Avoid it.\n"}
]