[
{"review": "\nMy initial reaction is that this film is the best romantic comedy that\nI've seen in years. The genre has been pretty devoid of quality lately.\nSo, I don't know if that plays a part or not and I really don't care at\nthis point. I enjoyed everything about this movie. It has tremendous\nheart and charisma and it's so very easy to get caught up in to the\nlives of these characters. A certain degree of patience is required\nwhile viewing because some secondary characters that feel unnecessary\nto the story are worth getting to know. Steve Carell's character is the\none everyone empathizes with and when the movie shifts away from the\n\"A\" story you wonder why and start to think that the \"B\" story is going\nto be muddled or cliché or one to endure. Well, they're not and\neverything comes together in a wonderful fashion. The entire cast here\nis perfection. The overall message may be one to debate but it doesn't\nmatter because the ride and this film are just so smart and so well\ndone.\n"},
{"review": "\nYou know usually I'm not into romantic comedies, as I find that most of\nthem fall short &amp; are extremely cheesy. I really liked this movie\nthough. One of the great things about it, is the acting is great.\nEveryone plays their part perfectly and you actually kind of feel for\nthem in their individual situations. Usually when I think of Steve\nCarell, I think of a jokester. He was great in his serious scenes\nthough, very believable. And Ryan Gosling, Oh my goodness, Ryan\nGosling. He has always been one of my favorite actors. He plays a\nladies man in this movie, trying to get Carell back on his feet after\nsplitting with his wife. The two of them have great chemistry together\nand provide plenty of laughs, along with touching moments. I just saw\nthis movie yesterday and I already want to see it again. That almost\nnever happens that I want to see a movie again right away. Very cute.\nThis movie has a little bit of everything and I think that most people\nwould enjoy it. 9/10!\n"},
{"review": "\nI saw this expecting an amusing, albeit predictable, movie. Boy was I\npleasantly surprised! <br><br>Steve Carell plays a man, Cal, blindsided by his wife's sudden request\nfor a divorce. While wallowing in self pity at the local bar, Jacob\n(Ryan Gossling) decides to turn him into a project, and introduce him\nto the wonderful world of womanizing.....But you've seen that from the\npreviews right? What comes next is a great look at love, from first\ncrushes to long term marriage.<br><br>This movie is the perfect blend of funny and sweet (the entire theatre\nwas laughing throughout). Great performances from the whole cast,\nincluding a surprisingly refreshing change for Steve Carell. The\nwriting was perfect, the pacing was great.... A perfect date movie! Not\noverly sappy and not typical \"chick flick\" drivel.\n"},
{"review": "\nI will admit from opening bell, that I do enjoy sappy love movies. It\nwas a movie that made you laugh,cry,wonder and cover your eyes. Steve\nkeeps true to his on screen character and his own real life strength\nbut never forgetting to mumble some sort of funny line even in his most\n\"sappy-est\" of moments. I give this movie two thumbs up for its twist\nat the end and keeping it out of viewers sights so well! I do however\nwish that they would have developed a little more back story with\nRyan's character but still, a movie to be enjoyed by all. Emma delivers\nsome nice side humor along with her friend in the movie as well! I\nbelieve Steve may have surpassed expectations of his ability to play\nthat main love role and still maintain his \"funny guy\" image.\n"},
{"review": "\nI wasn't sure if I wanted to see this movie at the theater,but I am\nreally glad I did. The characters are well played out, not very likable\nat first, but after you get to know the cast, you really feel for\neveryone. I thought Julianne Moore &amp; Steve Carrell had great chemistry\nwith their relationship. Super script, nice directing, great casting\nwith Robbie, the son. This movie will surprise you at how good it is. I\nloved how you saw the characters at work, at home, at the bar &amp; with\ntheir friends. This was very well played out &amp; comes together in the\nend extremely well. Ryan Gosling is very hot even when he is sleazy.\nGreat date night movie!!\n"},
{"review": "\nI feel compelled to write as I can't believe the rating this movie has.\nWe've seen it all before many times and this movie brings nothing new.\nOK let me begin, the first 40 minutes are funny, if it ended there it\nwould be 10, Carrell &amp; Gosling give good performances and really gel as\na duo but like so many comedies it loses it's way and the mid section\ndrags only to find that the finale is a big sentimental schmaltz that\nreally shouldn't be present in a comedy. Why do American comedies\nalways do this (Sandler, Carrey)? It's better than Just go with it, it\ncouldn't be any worse!, and the performances are all first rate, it's\njust a pity the project is wanting.\n"},
{"review": "\njust the usual storyline..parents break up in the beginning and get\nback together at the end..but the things that happen in between makes\nthis movie a lot different, a lot better than other movies of same\ngenre.. the positives are the way they have treated this story line,\nthe cast, their acting -steve carell keep this movie going and Ryan\ngosling looks really stunning with his perfect abs..but the screenplay\ncud have been bit better..most of the scenes takes place in the\nbar..those thing make the movie go slower..and also the same old\nclichés like mom cheating over dad, and dad getting back to the family\nin a thought provoking, eye opening speech in the end are bit\ndramatic...but whatever said, if only the pace of the movie was good\nthen this movie could have become one of the best movies in this genre\n"},
{"review": "\nSo who is the movie about - <br><br>1) a 13 year old hung-up on his babysitter who doesn't look at all like\nan athlete but is a soccer star?<br><br>2) The babysitter hung up on 13 year old's dad?<br><br>3) Cal and his wife splitting up and reuniting after having the sex\nflings they never had as young adults?<br><br>or 4) Hannah, Cal's daughter who hooks up with Cal's \"guy\" mentor by\nbreaking down his tough exterior and learns all about his personal life\nwithout ever revealing that her parents are divorcing and their names?<br><br>If this movie was a dog, you would go \"bad dog\" and try to teach to\nwrite better scripts.\n"},
{"review": "\n7.6? Have you all gone mad? This movie sucked. I laughed about 3 times.<br><br>Painful to watch. As with all romantic comedies, once it hits the\ndreaded one hour mark, go away because the \"comedy\" part goes and is\nreplaced by the \"romance\".<br><br>In other words zzzzzzzzzzzzzzzzzzzzzz.<br><br>And the first 50 minutes were no prize either.<br><br>If you are a straight male, do not be convinced by your significant (or\ninsignificant) other to endure this crap.<br><br>If you want to see something funny have haven't seen before, go rent\nSaxondale. Or see The UK version of The Office again.<br><br>Americans make comedy. Britian makes humour.<br><br>The jokes in Crazy, Stupid Love were so obvious and predictable, I was\ncovering my head with a blanket to stop the agony.<br><br>I remember when my baby had an infection and she was pooping all over\nthe place. Cleaning that up was more fun than watching this movie.\nBecause after 20 minutes, you were done. This just kept on going on and\non and on.\n"},
{"review": "\nAbout 3/4 of the way through there's a scene which lasts about 2\nminutes that's actually funny and I think the audience laughed for the\nfirst time.<br><br>The film up to that point plods it's way here, with a creepy sad plot\nand long, long silences to make this moment.<br><br>The last 1/4 of the film is totally and utterly pointless and simply\nattempts to resolve the story in a totally embarrassing and\nnon-humorous way.<br><br>Honestly the people who wrote this film have no clue about what love is\n- it certainly isn't endlessly pursuing and stalking someone who says\nno repeatedly.\n"},
{"review": "\nSo my wife an I were at Blockbuster (yes Blockbuster! haha) and were\nlooking for a good comedy. Saw Steven Carell on the movie box, and said\n\"This should be good, let's go for it\".<br><br>hmmm, my wife fell asleep on minute 30'. I fell asleep on minute 50'.<br><br>If I could sum up the movie in one word I would say... \"cheesy\" The\nwriters of this movie need help. Just having Steve Carell in the movie\ndoesn't make it funny... you need to write funny stuff. It had a lot of\ndrama sequences and some funny skits.. but nothing original.<br><br>Ryan Gosling's character was so corny. He is a good actor, but his\nlines were so false sounding that I thought I was watching a Saturday\nNight Live \"lady's man\" re-run. <br><br>I'm surprised it has a high rating here in IMDb.\n"},
{"review": "\nRomantic comedies aren't usually my kind of thing but I thought this\nfilm was great. The cast is strong (Gosling, Stone, Carell) which is\nthe main reason I chose to watch this film. It is quite a long film but\nthe plot is really clever. There is plenty of different things going on\nin the film and the way it all gets linked together is brilliant and\ncertainly something I did't see coming.<br><br>There are some genuine laugh out loud moments and the film is straight\nto the point. The cast is great and all work together well, the plot is\nfresh and clever and it really was one of the best romantic comedies I\nhave seen (haven't seen many but still) - Would recommend this film to\nanyone. <br><br>8/10\n"},
{"review": "\nThere are some pretty good redeeming qualities to this movie. There are\nsome true to life scenes. Overall the movie descends just under\nexcellent and stands just below the Descendants which was an easy 9\nstar flick.<br><br>Ryan Gosling stands out with an excellent performance as a womanizer\nwith style, class and a hint of humanity in his mentor ship to Carrol's\ncharacter.<br><br>Some scenes seem to not be right for the movie and some seem to be made\nto slide under a cookie cut like movie.<br><br>Overall it is an above the fray movie and stands as a great watch and a\nworthy addition to any DVD collection.<br><br>Definitely not a family movie as I wouldn't watch it with the kids due\nto embarrassing and adult content but I might not be adverse to a teen\nwatching it.<br><br>Enjoy!\n"},
{"review": "\nThere is a moment (or two), where the movie is close to lose its way or\nget off its track. But it's only a momentary thing that will go away\nalmost instantly. It manages to go through the clichés without hurting\nitself. And while women might only be interested in Ryan Gosling (and\nwho can blame them?), there is more to the movie than that. It is rare\nthat a romantic comedy can be as good as this.<br><br>And while other movies try to up the ante on raunchiness, this one\nalmost goes the opposite direction and does a great job in doing so.\nWith Carell, Gosling, Stone, Moore and Tomei you have excellent actors\nwho can convey almost anything, if the material is right. And right it\nis! Even if the end feels a bit like a cheat, it gets away with it. You\nwon't really mind ...\n"},
{"review": "\nOverall this is a terrible romantic comedy. But jokes and acting\ncarries you through.<br><br>The plot is really stupid, and at times very unpleasant. Some will\nobject to the underage sex angle, some to the stalking, some to the\nwomanizing. What I found most grating was the idea of a sex-class\nsystem, where a girl should date someone not on her class level. And\nthe story hinges on a girl dumping a guy for not realizing he is not on\nher level.<br><br>On the plus side though, the acting is mostly solid, and there are a\nlot of really funny moments scattered about. And I do like seeing a\nwomanizer teach another without being a complete Barney Stinson copy.\nThe ending though, Jesus... It is really bad.\n"},
{"review": "\nCrazy, Stupid, Love is a rom-com that gathers all the codes, clichés\nand stereotypes of the genre.<br><br>Yet, the acting is perfect, there is a good chemistry between Gosling\nand Carell, and one can easily empathize or sympathize with one of the\ncharacters. The script relies on a basic story, but well developed,\ndynamic, without overlong passages; the dialogues are well written with\na good dose of humor. The cinematography is also quite good, as dynamic\nas the script.<br><br>All in all, this movie turns out to be enjoyable, without\nrevolutionizing anything.\n"},
{"review": "\nCrazy Stupid Love: Perfect 10\\10. This is how Rom-Coms should be. I had\na whale of a time watching this movie. Steve Carell is such a terrific\nactor. He completely owns this movie, sad to see he dint get any\nrecognition/awards for it. The entire cast is perfect.Ryan Gosling is\nlikable as a womanizer who picks up girls in bars. Steve Carell is a\nman in his mid 40's who has been recently divorced. Ryan Gosling is the\none who helps him out with his midlife crisis and infuses some of his\nskills into him . <br><br>Its a brilliant parody of the American culture.The dialogs are witty ,\nscreenplay is crisp. Its been a long time i had so much fun while\nwatching a movie.You should not miss this out for any reason.<br><br>As i said : 10\\10. Couldn't have asked for anything more or better.\n"},
{"review": "\nSurprisingly good, especially for a romantic-comedy, as the bar is set\nvery low in this genre. It's more the comedy than the romance that\nworks though. Very funny, and at times a parody of rom-coms. Gets a bit\nsilly and contrived at times but thankfully these moments don't last\nlong. Ending is also a bit trite and unprofound, despite seeming to be\nheading for something big.<br><br>Great performances all round. Steve Carell does his usual nerdy guy-\nnext-door thing, Ryan Gosling is perfectly cast as the smooth operator,\nEmma Stone is great as his love interest. Solid work from Julianne\nMoore and good support from Analeigh Tipton, Kevin Bacon, Marisa Tomei\nand Jonah Bobo.\n"},
{"review": "\nThis movie is more like an ensemble piece, in which every couple has to\ndeal with a certain pain to become ready for love. Usually it is\nsugar-coated, these movies. And yes, it is not a deep- layered\nstructure of in-depth character exposition. But somehow, between the\neasy script lines, there is an unusual aspect in all of these people\nthat makes you being surprised. What aspect? Its honesty. Honest\nscript-writing. With that comes an undeniable fun that the actors have,\nwhen portraying their characters. And their love for their character\nradiates on us.<br><br>I have seen this movie many times and i can recommend you to be\nuplifted by it. We all need sometimes to be remembered that love\nexists. But not the fairy tale-version..... What better advise then:\nlove cannot breath without pain...?\n"},
{"review": "\nThis movie is more like an ensemble piece, in which every couple has to\ndeal with a certain pain to become ready for love. Usually it is\nsugar-coated, these movies. And yes, it is not a deep- layered\nstructure of in-depth character exposition. But somehow, between the\neasy script lines, there is an unusual aspect in all of these people\nthat makes you being surprised. What aspect? Its honesty. Honest\nscript-writing. With that comes an undeniable fun that the actors have,\nwhen portraying their characters. And their love for their character\nradiates on us.<br><br>I have seen this movie many times and i can recommend you to be\nuplifted by it. We all need sometimes to be remembered that love\nexists. But not the fairy tale-version..... What better advise then:\nlove cannot breath without pain...?\n"},
{"review": "\nThis movie probably looked good on paper (i.e. the screen play) but it\nlost its way in production with the blame spread around between\ncasting, direction, and perhaps also editing. Mostly, I think what was\nmissing, was creative vision by the director.<br><br>Pros: Some tender moments. Several plot surprises. A few good laughs.\nSeveral commendable supporting role performances, most notably by: Ryan\nGosling; Analeigh Tipton; and Jonah Bobo.<br><br>Cons: Most of the plot was boring, with the entire first half of the\nmovie being painful to sit through. There were far too many contrived\nscenes, some of the more notably being parent teacher night,\ngraduation, and the (cell) phone conversation about re-lighting the\nheater in the basement.<br><br>Mixed: Casting was all over the place, some excellent choices, some not\nso much.\n"},
{"review": "\nI usually cringe through these cheesy and dramatic moments but in this\nmovie I didn't I actually enjoyed many of them and that has to be\nbecause of the great acting and that I like these actors especially\nEmma stone and Steve Carrel. and the story is really well done,\ninteresting and enjoyable with good twists. I had few laughs as well\nthrough the movie so if you like romantic comedies you like this one\nespecially that this is not a typical love story between two persons\nthat you know they will end up together besides the drama is really\nwell done here. A great message is delivered through this movie as well\nthat you will get to you without too much cringing .\n"},
{"review": "\n\"Crazy, Stupid, Love.\" is a very known film for a reason that I don't\nhave any idea of. The characters are somehow interesting, but the cast\nis just as hack as it could be, considering there's just no new actor\nat all. Therefore, as you can imagine, the movie as a whole is just\nanother merchandising for those actors whose performances are almost\nalways the same. Ryan Gosling, on the other hand, is someone I had\nrarely heard of, and even thought he seems to be a copy of David\nArquette. Moreover, there isn't much to be said about this picture,\nsince it didn't stay in my memory due to the uninteresting plot that\nhas been showed. Maybe \"Crazy, Stupid, Love.\" is just another movie\nfrom the Hollywood that we'll hardly remember of.\n"},
{"review": "\nI was disappointed, maybe expectations was too high because of high\nratings. Almost nothing was funny. I find there are very few good\ncomedies from Hollywood during last years, probably there are some\nproblems in this genre. To make a good comedy must be way harder than\nchunks full of special effects. Another one dumb... I can't call it\ncomedy, a romantic film neither. Waste of your time. Nothing in this\nmovie was plausible. A middle aged man, who's wife is vice president in\nsome company, wears dirty running NB shoes matched with too big suit at\nhis office (and restaurant) and when he finds out his wife wants\ndivorce throws himself out of running car. Then comes the Saver and\nhelps to get appropriate dress and the whole trite story begins. Really\nboring.\n"},
{"review": "\nThis is a rom-com that tries to be a little different: so we have no\nless than seven relationships going on here; they involve\ndifferent-aged characters from middle-aged down to juvenile; and most\nof them do not work out. <br><br>Dan Fogelman - who has previously concentrated on screenplays for\nanimated movies - has produced a decent script and his words are\ndelivered by an attractive cast: Steve Carell and Julianne Moore\nplaying a married couple who have broken up, Ryan Gosling and Emma\nStone as young people trying to get it together, and Kevin Bacon and\nMarisa Tomei with smaller parts. <br><br>It doesn't always work and is sometimes silly or schmaltzy, but it has\nheart.\n"},
{"review": "\nSteve Carell plays a man, Cal, blindsided by his wife's sudden request\nfor a divorce. While wallowing in self pity at the local bar, Jacob\n(Ryan Gossling) decides to turn him into a project, and introduce him\nto the wonderful world of womanizing.....But you've seen that from the\npreviews right? What comes next is a great look at love, from first\ncrushes to long term marriage.<br><br>This movie is the perfect blend of funny and sweet (the entire theatre\nwas laughing throughout). Great performances from the whole cast,\nincluding a surprisingly refreshing change for Steve Carell. The\nwriting was perfect, the pacing was great.... A perfect date movie! Not\noverly sappy and not typical \"chick flick\" drivel.\n"},
{"review": "\nThis film actually started out pretty good--Gosling, the ladies man,\ndecides to help out Steve Carell,who is depressed over his wife leaving\nhim- -Gosling helps him improve his appearance and eventually Carell is\nconfident enough to pick up Marisa Tomei.<br><br>But then it goes downhill, and that's putting it mildly--The film fell\napart--One boring scene after another,thought it would never end.<br><br>Not to mention any STD angle, or lack thereof: Gosling picks up every\nwoman in sight, and nerdy loser Carell admits to bagging 8 more women\nafter Tomei--What is this, the 1970's? If you want some scary facts,\nlook up the historical incidence of STD's in the USA--Herpes is one\nexample: check the graph from 1967 to the present, up every single\nyear--There were 15,000 monthly visits to doctors regarding herpes in\n1967--That number is now 350,000!! That's a twenty-fold increase in\nherpes since the late 1960's!<br><br>and the twist ending sure didn't help anything, actually made it\nworse--Avoid this film\n"},
{"review": "\nI did a stupid thing when I bought this movie. I hadn't seen it. Which\nis something I rarely do. I have only bought a handful of movies\nwithout seeing them first, and sadly, there has only been one that I\nreally enjoyed and one that I liked. This was the one I liked. It has a\ngood storyline to it and the cast make it a very enjoyable watch.<br><br>This movie is about a middle-aged man. His life changes dramatically\nwhen his wife, out of nowhere, asks him for a divorce. He tries to\nrediscover his manhood with the help of a new friend. Jacob, is a guy\nwho is very good with woman. He can pick them up so easily. It helps\nthat it's really Ryan Gosling and he's got really nice abs. Anyway,\nJacob tries to help our about-to-be-divorced man, Cal and the results\nare just hilarious.<br><br>Overall, I give this movie a 6 out of 10, which in my ratings book is:\nGood.\n"},
{"review": "\nThis is one of the best romantic comedies I have seen in a long time,\nit has the story, the characters, the jokes and a lot more.<br><br>It is not just funny, it actually deals with a serious subject and\ndeals with it in a very good and mature way, and it delivers very well,\nI was very entertained all the way.<br><br>The two main characters are acted out by Steve Carell and Ryan Gosling\nand they can really act, they both seem very into their character and\nare very convincing. They are really good together and there is a good\nvibe in their acting, but also between the two characters.<br><br>You should watch this, it should be on the 100 comedies to watch before\nyou die list :)\n"},
{"review": "\nCrazy, Stupid Love is one very funny romantic comedy that pokes fun at\nthe dating lifestyle and longtime marriages. Sub-plots involving\nteenage love and jilted lovers create a tangle of funny complications.\nWhile the plot is contrived, the entertainment kept me laughing.\nJulianne Moore, Steve Carrell, and Ryan Gosling delivered in their\nroles as well as Marisa Tomei and Kevin Bacon who get caught up in the\nfamily conflict. Steve Carell, as Cal, was the husband who reacted with\nthe cold, silent treatment when his wife and lifelong love, Emily\n(Julianne Moore), asked for a divorce. He then embarked on a\nfreewheeling lifestyle with advice from Jacob, self-proclaimed dating\nexpert, played by Ryan Gosling. Marital problems lead to outside love\ninterests that overlap families, neighbors and work associates. The\nmiddle of the movie sagged a bit but was redeemed by some very funny\nscenes. All in all, a family situation fraught with a maze of hilarious\ncomplications.\n"},
{"review": "\nThis was really good for a rom-com, just different and edgy enough with\nsome really funny moments via Steve Carell alongside bittersweet true\nlife drama to make it work for me. There's also a great cast of\nsecondary characters and damn Ryan Gosling... \"photo-shopped.\" He plays\nprofessional bachelor Jacob Palmer who helps a newly separated Cal\n(Carell) navigate the singles scene after his wife (Julianne Moore)\nasks for a divorce and his perfect life crumbles.<br><br>I laughed out loud several times here (the wallet while clothes\nshopping) and liked how this ended up being a totally different movie\nthan what it started out as. The last 20 minutes are just hilarious,\nincluding a big twist (I didn't see coming) and the fight. \"Keep it in\nthe family okay?\" 5/19/14\n"},
{"review": "\nThis was a good romantic comedy and a good role for Steve Carrell. It\nis also one of those movies where the cast works well together. It\nstarts off with his wife (Julianne Moore) asking him for a divorce.\nEveryone then hears about her affair with Kevin Bacon's character. Ryan\nGosling overhears everything and proceed to \"coach\" him on approaching\nwomen in bars. Meanwhile, his son has a crush on his older babysitter\nwho has a similar crush on Carrell, and Emma Stone thinks she's getting\nsomewhere with here beau. I especially liked Kevin Bacon's role.<br><br>I think this was funny from start to finish. My favorite scenes were\nthe Scarlet Letter scene in the classroom, the \"scaffold\" scene, and\nthe misunderstanding scene at the end. Overall, this was a really good\ncomedy. You will definitely love this movie if you see it!<br><br>*** out of ****\n"},
{"review": "\nFirst Of All, I Thought It Was Gonna Be Like One Of Those Easy Movie, A\nSlow Mover. But When I Watched It Was Way Better Then I Thought, They\nMixed Love, Crazy, Comedy Etc. It Was Amazing To Watch, And I Love Most\nOf The Actors In It. A Middle-Aged Husband's Life Changes Dramatically\nWhen His Wife Asks Him For A Divorce. He Seeks To Rediscover His\nManhood With The Help Of A Newfound Friend, Jacob, Learning To Pick Up\ngirls At Bars. But He's New Friend Starting Dating And They Find Them\nTogether. And Yes That Was Most From The Desc, But I Forgot Kind Of How\nThe Movie Worked Again.<br><br>' Must Watch Movie ' -Cameron Ruse\n"},
{"review": "\nEmily Weaver (Julianne Moore) had an affair with David Lindhagen (Kevin\nBacon), and she wants a divorce from Cal (Steve Carell). Meanwhile\ntheir babysitter Jessica (Analeigh Tipton) is in love with Cal, and\ntheir son Robbie (Jonah Bobo) is in love with Jessica. Jacob Palmer\n(Ryan Gosling) is a real ladies man, and he takes pity on Cal who's\nbeen whining about his divorce to everybody in the bar. Jacob does a\nmake-over on Cal, but he finds himself falling for the PG-13 Hannah\n(Emma Stone).<br><br>I love everybody and every character in this movie. Carell and Gosling\nhave great comedic chemistry together. I love Gosling insulting Carell.\nI even love Julianne Moore who was cheating. Analeigh Tipton is\nadorable in her infatuation, and Jonah Bobo is even more adorable in\nhis. Ryan Gosling has a great dirty dancing bit with Emma Stone, and\nyes Emma is adorable too. In addition, there is a great scene with\nsupporting actress Marisa Tomei, and Liza Lapira has some great lines\nabout Conan. The only change I would make is to use the alternate\nending in the DVD.\n"},
{"review": "\nCrazy stupid love is a romantic movie. But it is also a comedy. The\nstory : Emily announces to her husband Cal that they must get a\ndivorce. Cal accept it, moves out of the house and every night visits\nthe same bar and speaks of his story. There he will meet Jacob, a rich\nattractive man who will teach Cal how to date women (one night stand\nusually). However Cal is still in love with Emily. The movie has lots\nof twists, giving the audience enough to satisfy them and keep them\nentertained till the end. Very funny and clever dialogs keep the\ninterest high. The actors are great each one at presenting a different\ncharacter quite convincing. All in all a great movie about\nrelationships and love.\n"},
{"review": "\nA huge cast (Steve Carell, Ryan Gosling, Julianne Moore, Emma Stone,\nKevin Bacon, Marisa Tomei) struggles mightily with a glib, pre-fab\nscreenplay by Dan Fogelman, packed with awkward situations that go\nnowhere. Each character seems to be prepared to espouse platitudes with\nthe utmost sincerity any time the script deems them appropriate, even\nif credibility suffers, which it almost always does. With the\nexceptions of the agreeably smooth Gosling and the warm and witty\nStone, everyone has done better work: they seem lost in all the talk;\nCarell, in particular, alters between cowering and manic but always\njust happens to be articulate enough to hammer home the literal points\nFogelman is intent on making. Overlong and unengaging.\n"},
{"review": "\nCrazy, Stupid, Love is one of those movies I can watch over and over\nagain and never get bored of it. Emma Stone and Ryan Gosling have great\non-screen chemistry and it shines through in this movie. Although the\nstory line is somewhat predictable with the bad-boy-\nchanges-his-ways-because-of-a-girl and the typical\nthe-babysitter's-in-love-with-the-father storyline, it's nice to see\nthe development of the characters through their hilarious experiences.\nI'm not the biggest fan of romantic comedies but Crazy, Stupid, Love is\ndefinitely an exception. I always picture Steve Carell to be one of\nthose awkwardly funny comedians because of The 40-Year Old Virgin and\nThe Office, but his role in this movie opened up a new perspective. He\nstill has his Steve Carell charm but brings in a new side of him as a\nman who has been broken by the love of his life. I have a newfound love\nfor him after this movie. There's a lot going on with the plot of the\nstory but it's easy to follow and I was never left uninterested. Good\njob!\n"},
{"review": "\nLike so many other movies I have seen, it started out great but ended\nweak. Gosling was perfect in his role and Carell was hilarious as\nalways. Emma Stone was also very good, and crazy hot. The problem I had\nwas that the situations between everyone became more unbelievable as\nthe movie went on. But those situations, while not great, weren't\nterrible either. The one thing I did have a major issue with was the\nson. Every time I saw him I wanted to slap him and shave his head.\nMaybe that is a little cruel for a child that can't act to save his\nlife and has an absurd haircut, but whatever. Still, if the movie had\nwrapped up nicely it would have all been worth it. But the speech at\nthe end went from dumb to just plain ridiculous. And if what's her\nface's dad was mad before, I wonder how he will react to being the\nfather of a registered sex offender. You know, the polaroid deal. I\nmean, seriously!?!?!\n"},
{"review": "\nReally a dry humor bittersweet film as it shows a great cast and\nwriting along the way.<br><br>Steve Carell plays Cal Weaver, who's wife played by Julianne Moore\ndumps him as he goes to a bar and meets up with Jacob, played by sexy\nRyan Gosling.<br><br>Jacob and Cal begin to hang out as the former teaches the latter how to\npick up clothes, and dates for the soon to be single Cal.<br><br>Meanwhile a lawyer to be played by Emma Stone is frustrated with her\nboyfriend, played by singer-actor Josh Groban in his film debut, who\nhas yet to propose to her. As when he fails to do so, she hangs up with\nJacob whom she meet a few nights before.<br><br>Also Cal and Julianne Moore's older son has developed a crush on the\nbabysitter who only wants to be friends. While the babysitter has a\nhuge crush on Cal.<br><br>So it is indeed crazy, stupid, love. Dry humor to a bittersweet story!\n"},
{"review": "\nWow you can imagine my excitement! That scene where Ryan is just\nlooking over the balcony and it is all in slow motion and he is wearing\nthose tight pants and eating the pizza, i was drooling. (not for the\npizza) WATCH this just because he is in it. And beautiful Emma Stone\n(Nanna/Anna) she is such a joyful actress she is full of life and love\nand I am so glad her and Ryan end up together! The teenage girl on the\nother hand that loves Cal is so gross he awkward face and body creep me\nthe hell out i would have enjoyed the film so much more with out her in\nit! I felt like that was an unnecessary side story. \"do you wanna get\nout of here?\" is the line most girls will want to be said to them by\nthe end of this film because we all want to have 'the time of our\nlife'. Oh stop it, Fiona, with all those cheesy puns. You will\nunderstand if you have watched the film!\n"},
{"review": "\nNormal I don't really like romantic movies. My best friend convinced me\nto watch it and I'm happy she did. This is now one of my favorite\nmovies! <br><br>This movie is not about the 'unrealistic Notebook love'. It's based on\nreal life stuff and problems. Steve Carell as Cal Weaver perfectly fits\nfor this character. And oh my goodness, Ryan Gossling plays the ladies\nmen in the movie and off course he does an excellent job. In the end of\nthe movie, which is super funny and so good, it is clear which message\nthey want to spread to the world; don't ever give up on your soul mate.\nI really loved this about the movie. Age, size, history, it doesn't\nmatter; don't give up on what you love. And that's why I recommend this\nmovie, it is funny, not overdone and sends a great message to the world\n"},
{"review": "\nFirst feeling after watching a movie was that it was overrated. Then\nI've realized: \"Hey, what could one expect from a romantic comedy?\"\nConsidering that I'm not into this genre, this was pretty watchable and\nquality movie. Those who like the genre will certainly love it.<br><br>The acting is great and they really got into characters well,\nespecially Steve. The story is somewhat fresh, although occasionally\nunbelievable and even slightly inappropriate. It isn't quite hilarious,\nbut contains certain amount of subtle and \"smart\" (or \"mute\") humor\nthat I particularly appreciate. On the other hand, some scenes are too\nslow for what they offer, while some others could use more emphasizing.<br><br>All in all, I'm giving this move a 7, which is pretty good from me. :)\n"},
{"review": "\nThis is yet another romcom drama movie. It did not appeal to me much\nalthough the movie has many positive aspects. The movie is based on the\ntheme that there is one true love (soul mate) for everyone and once you\nfind it you never quit on them. You keep on trying no matter whether\nyou are unreasonably out of the way.<br><br>You got nothing to take away from the movie except the message that\nfind your soul mate and stick with them. The slow motion shots just\nmake the movie more cheap. I have seen a lot of Bollywood movies and I\nwonder whether they got inspired from Bollywood.<br><br>On the positive side, you have excellent music score and amazing acting\nwith big names associated with it. Also, what surpasses this movie than\nothers in its own genre is that it has got an element of surprise every\nnow and then to keep you interested. The movie just passes by smoothly\nwithout anything to think about.\n"},
{"review": "\nIt's been a while since I last came across such a good romance-comedy.\nThe movie has interconnected stories, A loves B, B loves C, C loves D,\nand it goes around and around. The relationships between characters\nwere portrayed very subtle, so that whenever realizing something new,\nI'd go \"Oh, so that's it!\". Despite being a romance-comedy, there are\nsome touching moments, one of such was when Emily was calling Cal.<br><br>The movie features a strong cast, albeit not your current hot stars.\nAll managed to give a memorable and empathetic performance.<br><br>Although the story spanned an extended set of characters, the plot line\nremained tight and deep. Highly recommended for in-love couples,\nmarried couples, and all the single out there who is still dreaming\nabout an eternal love.<br><br>For more reviews, please visit http://voicemotion.wordpress.com/\n"},
{"review": "\nIt would be a good movie if it weren't for its indecision between being\na funny movie and a serious sentimental one. But anyway it has enough\nof both features to make it agreeable to watch though on the whole it\nhas too many funny scenes to be considered serious and too many serious\nscenes to be considered funny. But it has some witty dialogues and a\nfew powerful sentimental scenes along with funny ones. The story tells\nus about a few crossed love situations: a 13 year old boy in love with\nhis 17 year old babysitter who is herself in love with the boy's\nfather, a husband and a wife who seem to be on the verge of a divorce\nwhich appears not to be wished by the husband and maybe also not fully\nfor the wife despite of her confessed adultery, a husband who tries to\ntake lessons of seduction from a professional philanderer and a few\nconfusing situations that finish with a great surprise in the end. In\nsum a pleasant but not too ambitious movie.\n"},
{"review": "\nThe major achievement of Crazy, Stupid, Love is to bundle so much fun\nand emotion, without a dull moment, in a basically routine suburban\nfamily crisis setup. You can't say this for a whole lot of movies each\nyear, unfortunately.<br><br>It doesn't start fast, it's rather low key until you get your run\nthrough the whole exposition. But it gathers momentum, scene after\nscene situations become crazier while never spinning out of hand, and\ncharacters are consistent and likable all along.<br><br>With such a nice movie, delivering on all counts, you should be plenty\nhappy. Yet, if you really insist, typecast is Julianne Moore as the\nneurotic suburban wife (but she does it very good and with some nuance\nfrom previous assignments) and typecast is Marisa Tomei as the crazy\nfunny spicy litmus gal. These great actresses are really underused\nhere. For it's more a movie about the guys, understanding them and have\nsome fun with them, but who cares about this bias as long as it works?\n"},
{"review": "\nits been a long time since I saw a true romantic comedy.steve carell\nwas at his very best and this Movie was truly worth the money I paid\nfor it<br><br>I have always admired Steve carell's acting skills. overall this movie\nwas fun and exciting<br><br>to be honest many men in the modern times can relate to steve carell's\nsituation<br><br>spoiler.... i loved how the movie turned out in the end,it was\ncompletely unexpected to see how jacob(ryan goslin) was actually in\nlove with cal's(steve carell)daughter when all along jacob was the one\ntraining cal to amaze women i always love a movie with an unexpected\nending\n"},
{"review": "\nIt's true, the high average review for this movie is somewhat warranted\nI'm happy to report as I enjoyed this movie when it was at it's best,\npulling out the stops and (spoiler) heaping on the surprises. And this\nmovie exceeds at doing that. \"Crazy, Stupid, Love\" is a movie which\npacks in quite a few laughs while managing to mostly veer away from the\ncrude humor, something that in-and-of- itself deserves praise. The\nwhole Steve Carrol and Ryan Gosling character relationship and\ndevelopment was a hoot. This is probably Steve Carrol's best movie to\ndate and thanks in no small part to Gosling. Carrol is more or less in\na reprieve of his usual character, but the script helps uplift him.\nThereare unfortunately the occasional almost forced scenes of\nsentimentality too that feel mis-placed. Especially a lot of the\nDad-to-Son talks, and wife and husband talk - which I patiently waited\nthrough as the heavy-handedness of those scenes would abate. Still let\nme emphasize the occasional nature of those scenes, not enough hurt my\nrecommendation of a rental or check-out.\n"},
{"review": "\nI was very impressed! I have always loved romantic comedies, and was\nvery excited to see Crazy Stupid Love when I saw the preview. Honestly,\nit blew away my expectations! It was full of love, humor, tears, and so\nmuch more! Unlike many romantic comedies, this movie had many surprises\nwhich, many times, had the audience in the theater laughing out loud\nand thinking things over in their heads! The only thing - which is not\nnecessarily a bad thing - is that some parts have the characteristics\nof an R rated film instead of pg13. So just think it over before\nbringing the little ones! But no doubt about it, Crazy Stupid Love is a\nmust see for everyone!!\n"},
{"review": "\nCrazy, Stupid, Love was really a great RomCom. Extremely funny, has the\nheart melting effect and the actors and actresses were perfect for\ntheir roles. Steve Carell never disappoints along with the brilliant\nRyan Gosling who is great with comedies, which we don't regularly see\nhim in sadly. Emma Stone was as always laugh out loud funny and totally\nrelatable towards woman, showing what woman really do think when it\ncomes to guys, and Julianne Moore was fantastic for her depressed mid\nlife crisis cheater, was just hilarious. All of them together plus\namazing supporting cast made this movie a lovable watch. I would\ndefinitely this movie to anyone who is looking to laugh and for some\nfun. I would say that this movie deserves a solid 8/10\n"},
{"review": "\nSo, what do I know? This movie started off very serious with Steve\nCarell jumping out of a car because his wife just made love to another\nman. Depressing start that turned into a romantic movie. Delightfully\nso, it also turned into a \"screwball comedy\" with the introduction of\nthe Marisa Tomei character and I mean character. Carol Lombard I hope\nyou are watching! In the end it all turns out to be a very good\nromantic comedy. Oh, yes! The backyard scene was superb, all of the\nactors and I mean all just pulled it off. Go see it! A very good movie.\nBy the way, even though the cast is star laden it is Steve Carell's\nmovie. And it was not his \"Office\" character, but a blend of Cary\nGrant, James Stewart, a little John Travolta and William Powell. Yes,\nthe screwball comedy elite actors.\n"},
{"review": "\nWell, saw this one last week. I never go to the movies anymore b/c\nthere's nothing out but I love Julie and Steve so I thought I'd give\nthis one a try. Unfortunately, there's not enough Julie and Steve. And\nif you're going to have a romantic comedy, my ONE recommendation is to\nat least have the main characters make out/kiss. I'm so over these\nmovies where they can't even do a decent kiss at the end or no kissing\nat all.<br><br>I'm positive if filmmakers that don't want to have at least one kiss\nwith the stars of the movies, then they can take out the \"romantic\"\ndesignator out. They should have just called this movie \"Crazy,\nStupid\".<br><br>Overall the kids were cute in the movie and there's a great surprise at\nthe climax (of course no \"romantic\" climax - that is. lol). Well\nwritten and of course the acting is well done. Kevin Bacon is tasty\naddition as well.\n"},
{"review": "\nThis is a very funny movie, but it also has serious content. We see two\ncharacters, who represent two kinds of \"crazy, stupid love.\" Jacob is\nconstantly picking up girls at bars, taking them back to his apartment,\nand having sex with them. This is shown as a silly way of living when\nhe finally meets a girl who ridicules his tactics. On the other hand,\nCal has been in a marriage for 25 years and considers himself to have\nfound his soul mate. But there seems to be no basis for why he should\nbe together with his wife - they just reminisce and talk to fill the\nempty space. There are several scenes in the movie where the idea of a\n\"soul mate\" is made to sound incredibly silly. So if both these kinds\nof love are silly, where are we left to go? Is there any kind of love\nthat is not silly? Perhaps the relationship between Jacob and the girl\nwho ridicules him shows some way forward. They both seem to be happy,\nat least. Their secret seems to be that they have found something\nnovel. Is novelty the way forward?\n"},
{"review": "\nI hate to pigeonhole it to the Romantic Comedy genre, but I gotta call\na spade a spade.<br><br>There's a twist though.<br><br>This is no 'boy meets girl' story of magical romance with cheap laughs\nthrown in. Crazy Stupid Love packs a tightly written script along with\nsome great performances. Obviously, there are plenty of 'only in the\nmovies' moments. The quirky parts also tend to miss the authenticity\nmark, but the laughs don't always come when you'd expect either.<br><br>I liked the fighting for love theme. It provides a reminder to all\nthose who watch traditional Ro-Cos and might idealize those stories,\nthat this is a much more likely ending -or rather, that we don't really\nknow the ending nor do we ever find the perfect love, but nonetheless,\nit's still worth fighting for. That was nice to see in a Hollywood\nfilm.<br><br>The gloss is there, but there is something more for those of us who\nlook for that kind of thing in film. It's a well made film and I\nenjoyed it.<br><br>7.5/10\n"},
{"review": "\ni really like Juliana Moore she is pretty and so is Emma stone she is\nso i don't know there is just something about her and then Marissa tome\nis also really pretty. I don't usually like romantic comedies but this\nkind of wasn't it reminded me a little of 40 year virgin only better\nbecause it gave perspective of younger people and the older. if this is\na twist and you haven't watch don't read more i didn't know until it\nhappened in the movie Emma stone is Steve carrels daughter. that scene\nto follow made me laugh it was great. it got me to thinking to about\ndating and stuff and i can kind of relate. maybe you have to connect\nwith the characters or find them attractive i don't know but coming\nfrom a 28 year old male i liked it and would watch it again\n"},
{"review": "\nI love this movie. I've seen it like a dozen times. I've seen selected\nscenes many more. The scene at Jacob's house is fantastic. I'm in love\nwith Hanna Banana. Of course I can do lines. My mother didn't want to\nwatch it because she doesn't care for Steve Carell either but it was on\nwhile we were getting ready to go to the casino. She liked it. I don't\nknow how many times I've listened to \"So you think coffee and sleep\ndon't mix well they do if it's Highpoint it's decaffeinated.\" Coin\nbears indeed! Who are the writers, these people are great. Casting?\nWow! I loved everyone in it. There is so much talent Joey King is lost.\nReminds of the gas station scene from \"Wayne's World.\" Where they\nreplace the guy with Charlton Heston. Huge star with a tiny role. Start\nto finish wonderful. Love the babysitter, Analeigh Tipton. Love the\nAsian friend. Gotta get her name...BRB... Liza Lapira. \"The human\nValium\" David Lindhagen six degrees of Kevin Bacon Putt Put the\n\"Asshole\" scene. This is a great movie. I ran out and bought the DVD.\n"},
{"review": "\nThis is the funniest film I have seen in a long time. It's a strange\nfilm in a way as it's billed as a Rom-Com but is far edgier and much\nfunnier than that. <br><br>I am not a particularly big fan of Steve Carrel but here he excels as a\nman left bewildered when his wife admits to an affair. What follows is\nslightly surreal as he is taken under his wing by the charming Rylan\nGosling and taught about how to woo women. The results are hilarious as\nboth men change the way they think over the course of the following\nmonths. <br><br>An excellent cast featuring great performances from Gosling, Julianne\nMoore and the impressive Emma Stone make the very funny script come to\nlife. This is a Rom-Com that no guy can be ashamed of watching and\nliking and the best of it's kind since Four Weddings and a Funeral.\n"},
{"review": "\nOh my, I love love this movie. Not all of it, though. Parts of it are\npretty disturbing. Like Robbie's admission of masturbating to Jessica,\nand Jessica giving nude photos to Robbie. Not sure that's the message\nI'd want to send to my kids. But besides that, it's fantastic.\nCompletely unpredictable, bizarre and extremely true to life. I was\nfangirling like crazy throughout the entire film, which was a first for\nme. Everyone was perfectly cast. It was a bit lengthy, but only by\nmaybe ten minutes.<br><br>There seems to me more and more movies coming out about sex. I guess\non-screen limits were made to be pushed. Keep 'em coming, Hollywood.\n"},
{"review": "\nI thought this movie was hilarious. It made a bit of a mockery of the\n'PUA' lifestyle, which if you don't know what that is, you wont get\nsome of the jokes. There was a few rude things in there, but it wasn't\nover the top like the disgusting and unfunny movie, 'Ted.' I found\nmyself laughing out loud, Carells sense of humour is like an art, and\nhe is just so natural. I read some people complaining about the story\nline, editing and humour. They claim there's no romance or humour.\nTrust me, there is. If you find certain sexual topics a bit\nuncomfortable to watch with you family, be warned. They aren't graphic\nor disgusting, just a bit awkward. Overall, very funny movie, well\nworth the watch, and not a second of boredom!\n"},
{"review": "\nHonestly, I really liked this movie. It really made sense and really\nstuck to the point that it was trying to make. It shows the ups and\ndowns of love. Plus, it was really funny. There was a cast in this that\nI really enjoyed watch in this and they did an incredible job. (Kevin\nBacon was also a very good edition as well) Emma Stone tries to\nhesitate Ryan Gosling's charm, but when things don't work out with\nanother guy she finds her way with him and I like that. I mean who\ncan't resist Ryan's charm? Don't Know... Steve Carell did a great job\nhimself. He gets advice from Ryan once his wife cheats on him and at\nthe end some weird results go on. Amazing romantic comedy.\n"},
{"review": "\nI never once thought I would give a film such a high rating but this\nfilm truly deserves it! I never once wrote a IMDb review before but\nthis film was too amazing so I just had to write one! <br><br>I love how it has separate story lines but cleverly intertwines towards\nthe end. All the cast were perfect and could not ask for a better one.\nI thought it was a great idea to mix all famous 'in' actors/actresses\nthat usually appear in one particular genre. For example, Emma Stone\nand Steve Carrell usually appear in comedy films whereas Ryan Gosling\nusually appears in more serious films but oh no, the film has\neverything. It's funny, sexy, sassy, smart and really sweet all mixed\ninto one which rarely pulls off but this film truly did pull it off. <br><br>Furthermore, this is a great story, giving a moral message about soul\nmates and love and how age doesn't have to be a limit.<br><br>If you haven't seen this yet, go watch it now! Rosie recommends it for\nyou! If you have seen it and you don't really like it, then you're just\ncrazy, stupid and probably don't believe in love.\n"},
{"review": "\nCrazy, Stupid, Love is definitely on my top 3 Romantic comedies of all\ntimes, with the other two being Love actually, and Kate and Leopold.\n(The first two are much more superior in every way than Kate and\nLeopold but someone had to be third at third place). And this comes\nfrom a person that don't usually watch Romantic comedies but prefer\naction films.<br><br>Crazy, Stupid, Love except from being funny in a sweet way also has a\nteam of interesting characters that makes you wish the movie was 3\nhours long just to see those characters expand more. Its a film that\ngets your attention from the first minute and that surprises you with\nan incredibly funny ending and makes it a movie to watch with any of\nyour family and friends.\n"},
{"review": "\nThis movie at first I thought was going to try too hard to be funny.\nHowever, it was way better than I ever expected. It has the perfect\nblend of comedy, drama, and romance. The best performance would have to\nbe Ryan Gosling playing Jacob. There are no weak links in the movie\nthough. The plot flowed nicely with very few holes. The soundtrack has\na very good mix. The lighting and editing were both top notch. There\nwere a few moments where the acting was over the top but really didn't\ntake away from the movie.The ending wasn't all that great but that's\nthe only reason I really took 1 star away from my rating. This movie is\nperfect for a laugh and a movie that isn't too predictable.\n"},
{"review": "\nFunny and intriguing at the same time is what I have to say about this\nmovie. It's interesting to see how dots connect in a different field of\nour society, where a younger person teaches a middle aged man how to\ndiscover something he is not familiar with.<br><br>Definitely a thumbs up for the comedy which although not always \"laugh\nout loud\" type comedy, but definitely puts a smug grin on your face.\nThe screenplay was vivid with no sense of interruption with aspects\ndiverting away from the point of the story. One is glued really to the\nscreen as it curiosity is raised as to what happens next.<br><br>Casting for the roles could not have been better. With Ryan Gosling\nplaying a more jocund character than normal and Steve Carell being\nhimself, the combination is ecstatic.<br><br>This movie cannot be missed for those comedy aficionados and neither\nfor the fans of these two stars. To put it a better way: This movie\ncannot be missed unless your looking for a horror movie concept to lurk\ninto this movie!\n"},
{"review": "\nI didn't know what to expect when I went to see this film, but I've now\nwatched it three times! The way that it follows a lot of different\nstory lines makes it interesting, and all of the actors made their\ncharacters believable. I especially like the character of 13 year old\nRobbie ( Jonah Bobo) - I think that he plays to his character very\nwell- and it is a very real portrayal of a teenage boy. Steve carell\nshows that he can play serious roles, and Ryan Gosling is the perfect\nchoice for the character of player- Jacob palmer. There are a lot of\nfunny moments, and some more serious but heartwarming scenes. With some\ncute speeches and a theme of 'fighting for your soul-mate', this film\nis a great hit with teens and adults alike, and went down well with my\nwhole family. The characters are relatable to, and it's nice to hear\ntheir individual stories. I would definitely recommend this movie!\n"},
{"review": "\nThis movie is close to perfect, when it comes to a romantic movie,\nwhich also succeeds in being funny and witty at the same time, without\none of them being too much. <br><br>I sat down and watched this with my expectations kind of high, after\nhearing about it, and watching trailers etc.<br><br>The movie starts off fast and you're captured by the very first\nminutes. The story throughout the movie is great, and the plot is funny\nand well-thought. You cannot do anything else than loving this movie\nbecause it has so much heart and personality. <br><br>Sometimes a romantic movie can be too corny or too crazy and too stupid\nto love. Yes, this is \"Crazy, Stupid, Love\" but it has the perfect\namount of each of those things to satisfy someone who's looking for a\nmovie to laugh at, love and enjoy.<br><br>This is without a doubt one of the best romantic comedies in quite a\nwhile, so you should definitely go see it, and if you already have,\nthen watch it again!\n"},
{"review": "\nWatch this if...you are up for a realistic romantic comedy with\nsubstance. It is as good as advertised.<br><br>Acting/Casting: 7* - A really nice job casting the right people for the\nright roles in this movie. It is full of great actors who all do a\ngreat job playing their roles.<br><br>Directing/Cinematography/Technical: 7* - Very well put together and\nmanages to be really entertaining although the content isn't\nnecessarily kind to the fact.<br><br>Plot/Characters: 7* - A recently divorced man cheated on by his wife\nmeets a younger ladies man that helps reinvent himself with women, but\nhe ends up getting more than he bargained for in the end.<br><br>Entertainment Value: 7* - More realistic and serious than your run of\nthe mill romantic comedy, but that is what makes it entertaining and\neasy to identify with. I highly recommend to anyone looking for a good\nromantic comedy with substance.<br><br>My Score: 7+7+7+7 = 28/4 = 7.0<br><br>Email your thoughts to filmwatchinfool@gmail.com\n"},
{"review": "\nThis movie is your basic funny movie about a cheating spouse. This\nmovie draws you in quick with the basic routine lifestyle of a family\nthat gets bored and looks for a spark, even if its from a fling of\ncheating. This movie hits the nail on the head numerous times, but\nfalls short with a few boring scenes, and some of the script writing.\nThe actors seem to do the best they can with what they have to work\nwith or with the characters they are representing. I didn't agree with\nsome of the actor/actress playing some of the characters. Some just\ndidn't seem to fit the role of the characters. But still OK. This could\nbe one of the top 5 funny movies, IF the edges were sharpened some...\n"},
{"review": "\nFirst of all - amazing cast. I knew nothing about this movie, so I was\nsurprised by more great actors popping out every time: Ryan Gosling,\nMarisa Tomei, Kevin Bacon, Emma Stone (who easily becomes a favorite of\nmine), John Carroll Lynch and Julianne Moore. I have nothing against\nSteve Carell, but he's really the weakest link here. Then again, I have\nnothing for him, he's just... Steve Carell, the same character in every\nmovie.<br><br>Gosling, Stone and Tomei (whose screen time is criminally short) are\nreally the highlight of the movie. The three of them are fantastic.\nGosling, a favorite of mine, proves time after time that he's a\nwonderful actor and continues to give excellent performance in every\nmovie.<br><br>The movie itself is really uneven. There are some wonderful scenes and\ndialogs, but other scenes are not that great and the plot... hm... I\ncan't put my hands on it, but it's not constructed well enough.<br><br>Still, some good laughs and the cast is excellent.<br><br>5/10 Recommended\n"},
{"review": "\nThis movie will captivate you from the start, with its unusual story\nand great performance's, it will make you laugh, make you feel good,\nmake u enjoy every second of it, at least that was in my case. Every\npenny that you spent on this movie is more than worth it, trust me, and\nif u like this kind of movies, the only thing you will be sad about is\nthat you CANT WATCH this movie for the first time ever again.. Its that\noriginal and funny, with an epic ending conclusion which will put a\nsmile on your face for a long time, you'll be smiling even on your way\nhome. Actors did a really great job in concluding this masterpiece,\nespecially Steve Carell and Ryan Gosling spicing it up. I wish I had\nAlzheimer's so It gets new every time I watch it ;))) Joking aside,\nreally great cinema experience. 10/10, go and watch it.\n"},
{"review": "\nEverything works in this movie, mostly due to wonderful acting and\ngreat chemistry between the actors. This movie is simply hilarious,\nunexpected at times and a joy to watch. I saw it expecting the typical\ncliché kitsch, hopefully with a couple of giggles, and ended up\nlaughing through most of it while also being moved by the sincere\nfeelings each character conveys. <br><br>The entire cast is absolutely wonderful. I was not surprised at all to\nhear Ryan Gosling say in an interview that he would love to do a sequel\nwith the same cast and directors. <br><br>Highly recommended for a light and fun evening with friends and/or\ndate. Go see! :-)\n"},
{"review": "\nI... I loved it. Guess I can end my review right there. But I'm not\ngoing to.<br><br>I... was mind-blown, literally. I went into the theater all happy\nbecause I was FINALLY gonna get to see \"The new Emma Stone movie\" (I'm\na huge fan), and I came out with a HUGE grin on my face. I literally\nwalked around with my teeth sticking out for about 10 minutes...\nliterally. The movie was... well to quote myself when my friend asked\nme, \"DUUUUUDE, IT WAS SOOOOO F****** AMAZING\".<br><br>Hilarious... a few twists... heart-filled drama (I almost cried,\nALMOST)... and Emma Stone. I give it a 9/10 for awesomeness but a bit\n(A BIT)of a bad script, some of the lines weren't great, I was\nexpecting a few love quotes and also Emma Stone didn't get enough\nscreen time (in my opinion)... but I guess that's what make's this\nmovie so great, it wasn't what I expected.\n"},
{"review": "\nI put off watching this film until this past weekend because I wasn't\nsure if it would be worth my money. I was unduly concerned. The film\nwas worth every penny. I might actually go watch it again. The story\nwas heartfelt, moving, entertaining and very well directed and acted.\nInitially I thought I would be bored by the whole\nstranger-gives-sad-sap-a-makeover-to-make- him-cool bit but it was done\nin a very refreshing way. I thought the chemistry between Ryan Gosling\nand Steve Carell was terrific and they should honestly do another film\ntogether. <br><br>Emma Stone's scenes with Ryan Gosling were very romantic when I least\nexpected them to be. I thought that the romance angle would be the same\nold boring stuff but it really wasn't. All around, this movie surprised\nme. I would definitely recommend people go check it out.\n"},
{"review": "\n**No Worries, No Spoilers** Crazy, Stupid, Love is a perfect title for\nthis movie! It's all about love obviously, and how it can vary between\ngender and ages. In the beginning, I thought it was funny, but was kind\nof wondering where it was going. Well, if you go to watch it, don't\nworry about it, because the end shows all the connections in a\nhilarious way. It has to be one of the best endings to a movie that\nI've seen in a while. Steve Carell is a great actor and shows his\nsofter, sad side, but does it in a quirky, funny way. Ryan Gosling also\nplays his character to perfection! It's a fun, light-hearted movie,\nwith an outstanding cast. I would and have recommended it to friends!\nWorth your money just for the ending and to see Ryan Gosling with out a\nshirt!\n"},
{"review": "\nThis was strangely one of the best films I have seen in recent years. I\nwent into it expecting it to be just another \"chick flick\". I came out\nwith almost completely the opposite feelings. First off, what a stellar\ncast in this movie! Steve Carell, Ryan Gosling, Julianne Moore, Emma\nStone, and Marisa Tomei?! I was expecting it to be very similar to \"Dan\nin Real Life\" (a disappointing watch). Crazy, Stupid, Love incorporated\nall the elements of what a romantic comedy should be. The name itself\nis enough to summarize the story. Ryan Gosling portrayed a very\ndifferent role that we know him to be; an unhappy, rich-boy who has an\nepiphany and meets the right girl. His normal role is one who starts\nout happy or sad, and just dives deeper down the rabbit hole (Stay,\nDrive, U.S. of Leland, etc.). Crazy, Stupid, Love was an incredible\nmovie that evoked numerous emotions out of me (which is hard to do) and\nwould probably everyone else who gives it a shot.\n"},
{"review": "\nMajor let down. I watched this movie enticed by the stellar cast. I\nthought \"how bad can it be?\". Turns out it can be pretty bad. The only\nbright point is some funny moments close to the end of the movie. I\nfind it annoying that it tries to be profound, but actually doesn't say\nanything that hasn't be said before about love, relationships, divorce. <br><br>Ryan Gosling is very convincing in the beginning of the movie and the\nphotoshop line that Emma Stone utters is one of the best I have ever\nheard. The son is pretty good as is the babysitter, but the \"lead\"\nactors, aka the married couple, never convinced me that they were\nstruggling with their marriage.\n"},
{"review": "\nI loved this movie. It was funny, sweet, heartfelt and showed character\ngrowth and maturity. I love Steve Carell and he does an amazing job as\nper usual. Ryan Gosling's character's transformation was amazing.\nJulianne Moore's character did a great job showing the difficulties and\nhow confusing love and marriage can be sometimes. Emma Stone was sweet,\nfunny, cute and did a great job. The young son of Steve Carell was\nheartfelt, adorable and really added to the movie. The ending actually\nsurprised me, not sure if it was just me but I am never usually\nsurprised in romantic comedies. Nothing too sappy, nothing too\ninappropriate or raunchy. The movie was almost 2 hours long but did not\nfeel like it. For a large cast they pulled all the characters together\nvery well. The character's stories are realistic making it a great\nmovie. Not a chick flick just for women, Gosling and Carell's\ncharacter's relationship is funny for all. This is a great movie for\nanyone to watch and portrays how crazy people really are when they are\nin love.\n"},
{"review": "\nWell i saw Crazy, Stupid, Love wasn't expecting much but this movie is\nso funny. I always had liked Steve Carell for his funny acts but in\nthis movie his funny and emotional both and i really like it. Ryan\nGosling at its best. I didn't liked much his Drive movie but in this he\nis awesome, cool and funny too. Emma Stone the cute and cuddly though\nsexy has given good performance. Jonah Bobo as Steve Carell's son in\nthis has his own issues of love.<br><br>This movie is related among some characters who are tit-tat related to\neach other. One of the ending scene is seriously funny.<br><br>You should definitely watch it.......\n"},
{"review": "\nIf you have read the story line - then this looks like another clichéd\nmovie. I saw it only because of its good rating, and boy am I glad.\n:-)..............<br><br>Steve Carell (The Office) is absolutely brilliant. The Office lost its\nsteam once he left, he is someone who can carry an entire cast, he is\nthat good! <br><br>And Ryan Gosling, he was quite good in Drive, and he does it again\nhere. I think we have another huge actor coming up here and we will be\nseeing him in a 'lot' of movies for the next 20 years.<br><br>Emma Stone (Easy A), another excellent performance.<br><br>The entire cast is good.<br><br>This is one heck of a stylish movie, very well directed and\nchoreographed. I just saw captain America and came away disappointed,\nthat had a fantastic story and they spoiled it. Here they had a clichéd\nstory and they have turned it around into something cool and fun.<br><br>Hats off...............<br><br>Go see it, you will not be disappointed.<br><br>Cheers! :-)...............\n"},
{"review": "\nMost of the rave reviews for this movie are WAY over the top which now\nmakes me suspicious. I don't want to be too harsh on the movie (as it\nis what it is). But, the combination of the great reviews and the\nmediocre movie has really made me upset and I wasted $36. Something\nhere is askew. The net result is that made me mad. I should have smelt\na rat... Even my wife felt we were ripped off and she is usually very\nforgiving of romantic comedies. It was a 5.5 all day... I would have\ngone to something else if I had of known.\nhttp://www.stuff.co.nz/business/money/5541618/Businesses-\nspin-a-web-of-deceit\n"},
{"review": "\nI could hardly wait for Hangover 2, it was terrible. Bad Teacher,\nanother disappointment. All the funny lines were ran together for the\npreviews and that was it. Horrible Bosses had potential but the\ncharacters were too dumb to be believable. Crazy, Stupid Love was\nfinally a different story, just a simple, touching comedy. Not roll on\nthe floor, but thoroughly enjoyable to the very end. I would see it\nagain. I happen to think Steve Carell is one of the best comedic actors\nand he proved it again in this movie.The surprise for me was how funny\nRyan Gosling was. I would never have pictured him playing a character\nthat I really liked. And Marisa Tomei was really an extra bonus, she\nwas perfect for her part.\n"},
{"review": "\nCal(Steve Carell), a man in his mid 40's, who has the life most men\nwould envy, he has a good marriage, and great relationship with his\nkids. But Cals good life quickly comes crashing down, when his wife\nEmily(Julianne Moore), asks for a divorce, cause she slept with a\nco-worker(Kevin Bacon). Emily is not proud of it, and feels it is like\na mid life crisis, Cal quickly gives up and moves out, while at a bar,\nand drowning in his sorrows, he gets the attention of Jacob(Ryan\nGosling) a real ladies man, who wants to help Cal, and help him get\nback in the dating game, but that quickly gets tested, when Jacob falls\nfor Hannah(Emma Stone).<br><br>The trailer was so misleading, it made you feel like you where gonna\nroute for just Steve Carell, but when you finally watch you're unsure\nwho to route for, Steve Carell or Juliane Moore. I think they worked\nbeautifully well together, you really believe the feelings the have for\none another. And Ryan Gosling is quite a scene stealer, he has funny\nchemistry with Carell, and Stone. This was an enjoyable comedy/drama.\n"},
{"review": "\nA surprising movie on many levels. Sassy humor mixed with grounding\nreality. The story seems to sprawl a little, in the way it goes all\nover the place at times, and yet it manages to create a fun gem of an\nevening. I haven't laughed so hard in a theater in a long time--and it\nwasn't over the crude humor that so often gets the crowds going (which\nI don't care for). Yes, there is crude humor--it seems to come with the\nterritory in Steve Carell movies--but that is not the basis for what\nmakes this movie great. Nor is it \"great\" in the sense that I expect it\nto land a bunch of award nominations. But if you're looking for a movie\nthat mimics life, but presents it in an entertaining way, you'll\nprobably enjoy this one. The actors portray their characters well, the\nplot twists keep it interesting, and it is really a deeper story than\nthe surface value suggests.\n"},
{"review": "\nI was pleasantly surprised, and really enjoyed seeing this movie at a\npremiere this week.<br><br>I wasn't sure what to expect, so it took me a bit by surprise that it\nwas so funny and touching in a lot of ways.<br><br>It seemed to try to demonstrate that every person in this world has\nunique, loving, characteristics and that they might not be readily\napparent on the surface.<br><br>It reminded me a lot of \"Playing by Heart\", and in some ways the less\nenjoyable \"Love, Actually\".<br><br>Those two movies had similar characteristics but weren't as funny as\nCrazy, Stupid, Love.<br><br>The comedic aspects of this movie will appeal to the guys in the\naudience that don't normally like sappy love stories, so overall this\nis a movie that has something for everyone.<br><br>Highly recommended, and I give it a 10/10 even though its not perfect\n(but what movie is?).\n"},
{"review": "\n...Okay, almost never. But as soon as Crazy, Stupid, Love was over, I\nwanted to see it again. I agree with the first reviewer that this is\none of the best romantic comedies of the decade.<br><br>I couldn't have been more surprised at my reaction. After all, it's a\nSteve Carell movie. I like him well enough, but his movies have usually\nleft me mildly amused. In this film, he shows a depth of emotion that\nhe had only hinted at before.<br><br>But the character who got to me the most was Ryan Gosling. His\nperformance was amazing. Everyone did an excellent job, but his\ncharacter showed a range that I didn't expect.<br><br>This movie was sometimes a little crazy, but definitely not stupid. And\nits heart was pure love.\n"},
{"review": "\nThe overwhelming experience of this tedious drivel is of having dined\nout on a meal of caster sugar and saccharine. But what a cast! How to\nmake sense of these first-rate actors - Moore, Carell, Gosling, Tomei\nand the rest - agreeing to lend their talents to this sort of\nteeth-grindingly irritating dross? It can't be just for the money.<br><br>Did Julianne Moore think it was perhaps another THE KIDS ARE ALRIGHT?\nDid it remind Steve Carell of LITTLE MISS SUNSHINE? Please tell me Ryan\nGosling didn't consider it on a par with LARS AND THE REAL GIRL.\nBelieve me, this movie, so formulaic it's almost geometric, is not in\nthe same class as those three. The only comparable idiocy I've seen in\nthe past decade that sinks to this level is the Jennifer Aniston/Vince\nVaughn vehicle THE BREAK-UP.<br><br>OK, OK, enough venom. I just need to avoid this kind of movie. Maybe\nyou'll like it. For the sake of your cinematic health, though, I hope\nnot.\n"},
{"review": "\nEveryone is well aware that Rom-coms can be garbage. Any film can be\ngarbage for that matter. People argue that Rom-coms can be cheesy and\njust plain silly. Was this film a little cheesy at times: yes. Was it\nsilly? Sure but thats OK. I hate the term a feel-good movie, but it is\nthat. Its funny, its really sweet and cute, and the cast really is\nfantastic.<br><br>Definitely worth seeing with a significant other. Definitely worth\nseeing multiple times. I felt it was one of the best movies of the year\nwhen it came out. Really sweet and good.<br><br>Overall a good movie\n"},
{"review": "\nRealistic in its unpolished perspective towards love and uniquely\nentertaining in its raw, disorganized humor, \"Crazy, Stupid, Love\"\nstrays far from being a regurgitation of all other artificially sweet\nromantic comedies by a considerable amount. As predicted, Steve Carell\nadds his one-of-a-kind, awkwardly amusing touch that goes so well in\npractically any comedy, this one not being an exception. Steve Carell's\ngoofy attractiveness, conjugated with the more gallant and serious mien\ndemonstrated by Ryan Gosling adds a pleasantly balanced overall mood to\nthe film. \"Crazy, Stupid, Love\", unlike most others in its category,\ncenters its focus on both the blissful side and utterly disgruntled and\nhavoc-filled side as well, such an encompassing approach is what yields\nthe positive differential that sets it apart and incorporates an added\nlevel of excitement.\n"},
{"review": "\nA four star comedy, but a three star film; if you get my drift. They\nshould have another Oscar for comedy films.<br><br>A very funny movie throughout. All the characters are wonderful; as is\nthe script. There are a couple of scenes that go on a bit longer than I\nfelt they should; but, no to any serious detriment.<br><br>This interlocking film is the \"Crash\" of comedies - multiple story\nlines, weaving back and forth; finally all coming together at the end\n(well, not quite the end) in one hilarious and somewhat slapstick, yet\nstill poignant scene.<br><br>Not \"Blues Brothers\" funny; but, I'll see it often, over the next few\nyears, I am sure.\n"},
{"review": "\nThis movie will keep you guessing throughout. It's a funny and sweet\nstory of life mixed in with all types of love. Steve Carell plays a\ngreat sullen character (as always) in reaction to his chaotic\nsurroundings. He is mentored by a mysterious, wealthy, and handsome\nyoung man, in which he learns a thing or two about picking up women,\nand fulfilling his inner man self. You're never too old to learn\nsomething new, and you're never too young to love. This movie is filled\nwith surprises, leaving the audience in dumbstruck in some cases. Love\nisn't always clear; sometimes it's crazy, and stupid. The journey of\nlove is always surprising; especially when you re-evaluate your life at\nthe same time.\n"},
{"review": "\nSynopsis; Unique love relationship stories told with a whole bunch of\nfamous acts you already know. It works.<br><br>Awesome; Script, good acting, actually funny at times, tough moral\nlessons learned, great soundtrack, actors enjoyable despite being so\noverused. Both types of fans of comedy should enjoy this. Marisa Tomei\nstill kicking it strong here. Almost reminds me of a Spanish actress.<br><br>Poop; You might not like how it's almost all famous actors, risqué\nscene and situation (I don't personally like this). Could be worst. <br><br>Overall a really great film! I could probably watch this again with\nfriends.\n"},
{"review": "\nCrazy Stupid Love works because it put a lot of focus on characters,\ncasting the right people and pure cynical-ism in the mix. Steve Carell\nis outstanding as the tormented soul turned player/father and Emma\nStone steals scenes like she always does. As for Ryan Gosling, he is\nalmost unrecognisable as a ladies' man. One of the best pick up line\ninvolves responding to a female target with \"boring and impress me\".\nStill, this film isn't about picking up, but rather about life and more\ndefined \u0096 the process of life in general. Unlike most films, the ending\nhere does not really matter, but rather the long process of getting\nthere. A good film with good acting and probably something to say in\nthe process as well\u0085 <br><br>Neo rates it 7.5/10.<br><br>- www.thehkneo.com\n"},
{"review": "\nThe best scene of movie was when at the surprise party \"dad\" finds out\nwho is his daughter's boyfriend. a funny struggle but also complicated\n! Emma stone role and action was amazing. but falling in love for a 13\nyears old kid was not attractive. also movie had a slow rhythm, some\nstereo-type sub-stories that could be more different and attractive by\ninjecting some more creativity into the writer's brain. Adding\nsex-factor and stupid-sudden-coincidences are not a mature-noble way of\nwriting but unfortunately these things always work, people need to be\nentertained without-thinking and just having fun. I laughed loud at\nseveral moments of this movie but that was totally temporary and really\nstupid.\n"},
{"review": "\nCrazy, Stupid, Love<br><br>The key to having a marriage built on trust, respect and love is to tie\nthe knot on your deathbed.<br><br>Unfortunately, the couple in this dramedy decided to get married right\nout of high school.<br><br>Subsequent to an affair with her colleague (Kevin Bacon), Emily\n(Julianne Moore) decides to end her marriage to her high school\nsweetheart Cal (Steve Carell).<br><br>Forced from his home, Cal returns to the dating scene where he meets a\nhip, young, playboy, Jacob (Ryan Gosling), who shows him the ropes.<br><br>But when Hannah (Emma Stone), a feisty fawn he failed to conquer,\nre-enters his life, Jacob begins contemplating settling down.<br><br>All the while Carl and Emily's children learn their own lessons about\nlove.<br><br>A sharp, funny, timely romantic-comedy, Crazy, Stupid, Love cunningly\nweaves an unexpected and unconventional love story.<br><br>Despite the film's optimistic message, however, crazy, stupid, people\nshould still not be allowed to procreate. (Green Light)\n"},
{"review": "\nLet me start by saying I feel like I've watched every single move there\nis known to existence. I was looking for something new to watch, and\ncouldn't find anything...So I went with crazy stupid love. This is\nsomething I wouldn't normally watch but it had gotten good reviews so I\ndecided to check it out. In short, I really liked it. Ryan Gosling does\nan exceptional job with playing this smooth talking ladies man. While\nSteve Carrel plays the complete opposite. A guy that is down on his\nluck, and just trying to get back on the horse. The way the film\nintertwines all the characters, is fun and entertaining. There isn't\nreally any characters I didn't like, and by the end of the film when\nthe credits rolled up I had a smile on my face. I guess that was the\npoint of the movie, so two thumbs up from me!\n"},
{"review": "\nIf you really love someone you have to fight for them till the end\u0085\nthis movie shows us that, it also show us the crazy and stupid things\nwe do for love. Steve Carell, Ryan Gosling, Julianne Moore and Emma\nStone make up the key players in this movie. Steve Carell plays Cal\nWeaver who has a marriage crisis and Ryan Gosling plays Jacob Palmer\nwho sees Cal Weaver in a bar and tries to help him. The move is filled\nwith comedy and emotion, one scene is filled with comedy and the other\nwith emotion overall the movie is good to watch. It's not your usual\nSteve Carell movie with a lot of laughs, it's one of those movies which\nhas some funny scenes and gives a nice message. So if you're expecting\nto laugh your guts out, this is not the movie for you.<br><br>It's a nice movie\u0085 this is one move you watch with some girls, don't\nwatch it with your guy friends.<br><br>Like my reviews, visit my blog: http://nrgmoviereview.blogspot.com\n"},
{"review": "\n'Crazy, Stupid, Love.' is a fun film to watch. It's a well-made,\nentertaining &amp; superbly acted romantic-comedy, that earns itself a\nviewing due to it's true merits. <br><br>'Crazy, Stupid, Love.' Synopsis: A father's life unravels while he\ndeals with a marital crisis and tries to manage his relationship with\nhis children.<br><br>'Crazy, Stupid, Love.' is nicely written &amp; directed. Dan Fogelman's\nScreenplay is light-hearted, funny &amp; at the same time, entertaining.\nGlenn Ficarra and John Requa direct this recent box-office hit, nicely.\nCinematography is perfect. Editing &amp; Art Design, are serviceable. <br><br>Performance-Wise: Steve Carell is in complete form this time. He's\nexceptional from scene A to Z. Julianne Moore is dependable, as\nexpected. Ryan Gosling is extremely likable in his part. Ditto for Emma\nStone. Analeigh Tipton is very sincere. Jonah Bobo shines. Kevin Bacon\n&amp; Marisa Tomei are cheerful in brief roles. <br><br>On the whole, A Light-Hearted, Entertaining, Romantic-Comedy, that is\ndefinitely worth watching.\n"},
{"review": "\nI thought when I sat down to watch this that it would just be another\nsilly film with Steve Carell in it but I couldn't have been more wrong.\nIt's a very well written romantic comedy that looks at the life of\nSteve's character Cal Weaver who has been asked for a divorce by his\nwife and \"soul mate\". Ryan Goslings character Jacob sees that Cal is\ndistraught And offers to help him become a better man and a womanizer\nwith Some funny results. The film also looks at his 13 yr old sons\ncrush on his 17 yr old baby sitter that is also very entertaining. It's\njust a brilliant heart warming film with brilliant acting. Steve Carell\nis brilliant in it as is Ryan Gosling. Enjoyed every minute of it. The\nbest romantic comedy I've seen to date hands down.\n"},
{"review": "\nThis is an exceptionally enjoyable movie for what could typically be\nexpected out of it. First, I am not a fan of Steve Carell, but he does\nvery well. Also, Ryan Gosling is very appropriate for his part.\nHowever, I rated the movie 8, not because of the actors or the somewhat\nenjoyable plot, but because there where some moments that were really\nGOOD. And not 'romantic comedy' good, but truly 'fresh', funny, and\nwell played. Of course, it didn't manage to avoid all the banalities\nwhich we in one or another way see in most romantic comedies, however,\nit did stand out with those small moments that really made me smile.\n\"Crazy.Stupid.Love\" is a bit naive, for sure, but it is also inspiring\nand at some parts truly touching.\n"},
{"review": "\nI should say the ensemble cast are all of high caliber and the twists\njust keep arriving when you least expect them. There is no slow pitch\ngoing on here.<br><br>I did find the babysitter relationship an unnecessary distraction in an\notherwise great film.<br><br>Julianne Moore and Emma Stone are two of the most adorable red-heads in\nHollywood and they can act!<br><br>Ryan Gosling plays a tongue in cheek likable playboy and his lines were\nhistory making.<br><br>You'll laugh and cry at several moments in this film. Go see it you\nwon't regret anything.<br><br>Cheers, www.TheAmerican.IE\n"},
{"review": "\nIt is a movie which has shown love in all forms, that is why the title.\nLove is crazy and stupid. From the middle aged character of Steve\nCarell to the love story of his son of about 13 yr old. The movie has\nmany layers of stories in it. <br><br>Steve Carell gets to know that his wife needs a divorce in the first\nscene of the movie. Then on the movie starts about what he does trying\nto raise two kids alongside. Ryan helps him shred his old style geeky\nlook and helps him to get a makeover. I will not divulge any more\ndetails as it is better you watch the movie without any more pointers\nfrom the reviews.<br><br>The comedy element is kept alive through out the film by its wonderful\nscreenplay,also giving it a heart and touchy feel when needed. The huge\nstar cast of brilliant actors all holding there own in this must watch\nromantic comedy of this year 2011.\n"},
{"review": "\n\"Crazy Stupid Love\" is nice. Possibly the perfect date movie, since it\nexplores relationship pitfalls without getting lost in them.<br><br>Nice performances. Ryan Gosling plays a great \"player\" who decides to\ntake Steve Carrell's character Cal under his wing and help him learn to\ntalk to women about something other than his failed marriage. And Emma\nStone is her usual delightful self.<br><br>Entertaining, funny, and occasionally poignant. Frankly, the level of\ninsight isn't much greater than some sitcoms, but it's still sweet.<br><br>Dating? Or, married and on a \"date night\"? Worth a trip to the theater.\nOtherwise, perfectly worthwhile as a rental later on.\n"}
]