[
{"review": "\nInspiring, intense, reverent, Damien Chazelle's jazz-infused drama is\nan incredibly complex character study that has Miles Teller and J.K.\nSimmons at the top of their game in this brilliant effort. Whilst I was\nfixated by 'Birdman' and found 'Boyhood' a generally entertaining\nwatch, 'Whiplash' is by far the most riveting and sensational drama I\nhave viewed from 2014. J.K. Simmons stars as antihero Terence Fletcher,\na character we look at as the opportunity of Andrew's success, but also\nwe hate for his brutal portrayal. His performance is flawless and\nbreathless, a truly resonant achievement. The final drum solo ends the\nfilm on a high note and keep its audience lingering on the edge of\ntheir seats, it is powerful, it is intense, it is a near-masterpiece!\n"},
{"review": "\nWhiplash is low budget film making at its finest, and surely promises\nbig things from rookie director/writer Damien Chazelle. Seeing this\nfilm in theaters was the first time this year that I have completely\nenraptured (granted, I have not seen all of the top films that have\ncome out so far). Also, I am a succor for quality films about\nmusicians, and Whiplash ranks in my all time favorites in that genre.\nThe tension did not let up from the very first scene, especially as\nsoon as the incredible J.K. Simmons enters. Simmons, along with Miles\nTeller (who's Project X days are now long behind him) have some of the\nbest on screen chemistry I've seen. They're connected; one cannot act\nwithout it affecting the other. The film is almost entirely focused on\nthis relationship, and the simplicity definitely services the film. I\nhope people will go and see it and vote with their pocketbooks for\nexcellent low budget films.\n"},
{"review": "\nI gave it 28 minutes. That was generous, in that I knew it was going to\nbe terrible within about 2.<br><br>I've been to music school. It's not like this. The teachers aren't like\nthis. No one's like this (obviously I'm referring to 'Hollywood idea of\nwhat a hard-ass music teacher might be like in some weird juvenile\nnegative fantasy' Fletcher).<br><br>I switched off when he threw a chair at Andrew the drum prodigy and\nthen slapped him. SLAPPED him. Repeatedly. In front of a whole, cowed\nclass of what, in legal terms, would be called witnesses to an assault,\nfor playing slightly fast, the first time he's ever played to him in a\nband practice.<br><br>I'm sorry, what?! Where does this/would this/has this ever happened? In\na Charles Dickens novel about a jazz drum student, possibly. In\nanything even vaguely purporting to be based on real life now, um...No.<br><br>I'm stunned. Yet another IMDb/Metacritic/Rotten Tomatoes gush-fest that\nis so laughably bad, you have to check the page again to really believe\nit's got such high praise.<br><br>Excruciating nonsense.\n"},
{"review": "\nIt amazes me that a movie that promotes such level of fascistic\nperfectionism gets so much praise. I say fascistic because the sick\nperfectionism of Nazis was one of the main reasons they thought it is\nOK to gas millions of people. If you are not perfect based on our\nstandards you don't deserve to live. <br><br>This movie tells us if you are not Charlie Parker I feel free to\nhumiliate you, insult you, hurt you and abuse you, and it is all\njustified because if you are Charlie Parker you don't mind this level\nof sick manipulation. What a disgusting message. Yes, the actors did a\ngood job playing these sick characters, and the movie was well made,\nwhich makes it even more dangerous.\n"},
{"review": "\nNo need for a long review here. I am disappointed and amazed at the\noverwhelmingly 9 and 10 star reviews for Whiplash from Users and\nCritics alike. I agree that the performances are great, and for them I\ngive some stars. In spite of the acting the film/screenplay ultimately\nglorifies cruelty and abuse to achieve success. I mourn the fact that\nwe have become so insensitive to traumatic, inhuman treatment. <br><br>I might have felt differently if there were rewards for winning over\ncruelty rather than glorification of both<br><br>Sadly submitted,<br><br>Michaellouie\n"},
{"review": "\nI just can not understand how this movie does get so much acclaim. The\nwhole movie is just so unrealistic. I have learned and practiced 2\ninstruments here in Europe and can only say when I watch how this\nShaffer character treats musicians like football players, this would\nnever work. In such an environment any musician would get so tense and\nso full of fear to fail, he would certainly do exactly that. This is\nnot how musicality and technique is teached. Never. Music is not\nsports. What Shaffer does may create a robot band that plays precise\nlike a computer. But the music that comes out that way will sound\nalike. People in music are sensitive. Teaching is a process of mutual\nunderstanding, respecting and elevating between teacher and student.<br><br>Further, a good drum technique with speed is not achieved by such\ntensioned convulsion, it needs the right finger and hand control and\nswing.<br><br>The acting is certainly admirable but the cuts are sometimes worse then\njust distracting.\n"},
{"review": "\nHomophobic and antisemitic insults, psychological and physical torture\npresented as working methods to motivate a teenager! Do I really need\nto write more to express how wrong this movie is, despite all the good\nacting and amazing editing? Since when geniuses and talented artists\nhave all been mentored by a sadistic psychotic maniac that should be\nlocked up straight from the very first slap or insults? it is a SCHOOL.\nS-C-H-O-O-L.<br><br>An insult to all worthy teachers and mentors more successful than this\nFletcher as NONE of their trainees kill themselves and nevertheless do\nreach their best.<br><br>Liking this movie with no restriction at all is being an accomplice of\nteen suicides.\n"},
{"review": "\nThere's only one thing worse than a ludicrous, shallow, artificial\nmovie, and that's a ludicrous, shallow, artificial movie that everybody\nseems to adore.<br><br>Whiplash wants to be about the love of great art, but is actually about\nthe hate of great art. It has JK Simmons - a brilliant actor - playing\na disgraceful character, stitched together from completely unrealistic,\ninconsistent motivations and actions, only conceived to bludgeon the\nviewer into thinking we're watching something profound. It casually\ntosses in assault, depression and suicide in a way that only a\nclueless, opportunistic director could. It has a big finale that would\nbe powerful if only it made some sense for the main characters involved\n- it doesn't.<br><br>Even worse, the finale leaves us with this unmistakable message:\nsadistic leadership is the way to greatness. Don't take your kids to\nsee this.\n"},
{"review": "\nSeems to me the only people who like this movie are people who know\nnothing about music. <br><br>The film tries to get you to buy into some kind of polished, elite\nfantasy world that supports our belief that success comes at great\nsacrifice. Which it sometimes does.. but this movie is absolutely\nridiculous.<br><br>People become musicians out of LOVE for the art. They aren't pushed to\n\"achieve greatness\" by sadistic asshole teachers. Also, Jazz is far\nless rigorous and robotic than this movie would have you believe. Jazz\n(and Blues) have always been about self-expression - play, spontaneity,\ncolour, contrast &amp; emotion. Lots of great jazz players are self- taught\nand never even went to music school (see Django Reinhardt). Many can't\neven read music.<br><br>This (American) movie completely fails to understand one of Americas\nown greatest cultural exports. As a Brit, I appreciate the irony - I\ncan only conclude the writer must be a total dipshit.\n"},
{"review": "\nHaving spent most of my entire life in music playing drums and teaching\nthe art, I can tell you that there are so many things wrong with this\nmovie, it's laughable. <br><br>The absurd, over-the-top, face-slapping scene in the trailer was enough\nfor me to avoid seeing it. But, at the urging of a friend - a\nnon-musician who thought it was \"great\", I caved in to my curiosity.\nHis taste in movies aside, he's still my friend, and I was right in my\ninitial judgement. Watching the entire movie was a waste - I made it\nhalf-way through and ditched.<br><br>\"Whiplash\" is an unadulterated load of crap.\n"},
{"review": "\nI expected from this film much more then I saw. I think music is not\nabout military discipline and swearing, it is just the opposite. How\nimportant is for a drummer to play his drums fast? Not that important.\nI think this film was made more for the actors and music editors then\nfor the music itself. What a disappointment! <br><br>It is also disappointing to see that this film took more Oscars then\nBoyhood. It is sickening! I really would like to add that I really\nexpected more about this film then it delivered to me. <br><br>I am sorry but I would not recommend this film for you to see. It is\njust so disappointing.\n"},
{"review": "\nI laughed my head off at every scene in this movie! It was hilarious!\nThe whole thing reminded me of an SCTV skit. I expected John Candy or\nMartin Short to come out at any second throughout the entire movie. Now\nI know why musicians and music students are making fun of this movie\nall over the US. I was a HS music teacher for more than 15 years, and a\nprofessional musician my entire life, and I've never seen a funnier\nmovie about music in my entire life. The only one that came close to\nthis was Ken Russell's version of \"Tommy\", but Whiplash took itself\nmuch more seriously than Tommy did. People are getting more and more\nbrainless about music every day (especially jazz), so it didn't\nsurprise me that many people thought this was a good movie. I guess I'm\nnot as angry about how bad this piece of garbage was compared to the\nother people that gave it a bad review, because I waited for it to come\nout on DVD, and didn't waste a lot of money seeing it in a theater.\nThis would make a great feature on Mystery Science Theater 3000 it's so\nbad!\n"},
{"review": "\nHard to rate this film because there's so much to like - the\nperformances, the unusual story-line, and the fact that it's about\njazz. Still what stays with me is what I liked the least about the\nmovie - the fact that Fletcher's torturous and reprehensible methods\nseem to be validated in the end. I really wished the kid would have\nsucceeded in spite of Fletcher and showed him that his methods only\ncause irreversible damage and sometimes even death. Abuse is not the\nway to make talent (artistic or otherwise) blossom - McCartney,\nSpielberg, Federer, Bach, Evert, Picasso, Da Vinci - there are\ncountless examples of genius without without abuse. Maybe jazz is\ndifferent? I doubt it.\n"},
{"review": "\nI admired the cinematography and the acting, and at the start, thought\nthis would be a great film. But then the bullying and violence\nstarted... The first episode was shocking but gripping, and I wanted to\nfind out where the film was leading. It turned out to be leading up a\nblind alley. The sadistic teacher was a ridiculous stereotype, the\nbleeding hands were just plain unbelievable, and all the other members\nof the band just sat around watching but not reacting to the appalling\nabuse. This method of 'teaching' wouldn't work; there is a big\ndifference between pushing students to achieve more and violent\nbullying. And the idea that such violence and aggression could lead to\nstudents producing better music of all things, would be laughable if it\nwasn't so sick. <br><br>I was tempted to walk out but watched till the end, hoping for some\nkind of balance or note of realism. Unfortunately, there wasn't one and\nthe final triumphant performance merely seemed to validate the cruelty.\nYes, the cinema audience clapped at the end, and that made my stomach\nturn.\n"},
{"review": "\nOn the face of it this is an over the top unrealistic portrayal of the\nodd subject matter where a coach drives his charge to the limit. But\nthat message gets a little confused as the movie progresses.... is he\njust psycho? Pretty typical of a lot of movies being churned out of the\nUS these days relying an sensational exaggeration and graphic language\nrather than a good story. The drumming was poor and the drummer no Phil\nCollins. The general public in the US must be so gung-ho to accept this\ndrivel.... if all you have to be is a loud mouth abusive jerk to get an\nOscar then I give up. I warn you... if you have any taste at all you\nwill be disappointed!\n"},
{"review": "\nAfter the hype all around, I went in to watch this movie with a lot of\nexpectations. Especially because I haven't seen a movie on drumming, at\nleast not a drummer as the protagonist. I have to admit, I am a little\ndisappointed.<br><br>Drumming is an art. One needs finesse to be a drummer. Here, in the\nmovie, it seems all about 'speed': playing fast tempos. Double time and\ntriple time. To the extent blood oozes out of your body. Is that the\ndefinition of good music? Haven't the makers of the film heard of\n'rests' in music charts. What not to play and when not to play is more\npowerful than what you indeed play.<br><br>And why is it that the Conductor Mr.Fletcher has his eyes set only on\nthe drummer. Not once did we see him interact with the other musicians\nof the ensemble.<br><br>With all that filth and anger from the Conductor, one really wonders if\nany good music would ever flow out from that band? It reminded me of\nthe great movie 'An officer and a gentleman'. The Commanding Trainer in\nthe movie was arrogant and ruthless for a good reason. But not so in\n'Whiplash'.\n"},
{"review": "\nI'll be brief.<br><br>Although the soundtrack is nice (if you like jazz) Both the characters\nand the story are unreliable. For once, a real music teacher with such\ncharacter would have had his ass kicked out of school pretty quickly.<br><br>So, it's kinda like \"Fame\" - only the jazz version that takes itself\nway too seriously!<br><br>Also, J.K. Simmons character is not too far from his previous\n'Schillinger' role. Only this time - he got out of (Oz) jail and\ndecided to turn his anger and neo nazi tendencies into music.<br><br>Bottom line (only because IMDb requires at least ten lines) - much much\noverrated.\n"},
{"review": "\nThe film isn't bad, but nowhere near what I had expected in a movie\nthat won Sundance among many other things. Yes, JK Simmons is\nfantastic, but I want to know who the producer convinced that Simmons\nshould have been nominated in the Best Supporting Actor category rather\nthan Best Actor in this movie. He's in plenty of the picture. Of\ncourse, he couldn't have won Best Actor, but he'd be a shoo-in for Best\nSupporting Actor, which he won in spades.<br><br>Towards the middle and continuing to the end, the plot became\nridiculous. Getting smacked by an oncoming truck where your car flips\nover, and then running to make your concert? Physically attacking your\nteacher? Going back to play drums for the instructor that you despise,\nand then how does he not know a certain song will be played, when\neveryone else does? Didn't he have to practice with them...like ever?\n"},
{"review": "\nThis film tells the story of a young drummer who us accepted into the\nmost prestigious music school in New York. The teacher there is very\nstrict, even abusive physically and psychologically. The story then\ntells how the enmeshed relationship between the two evolve.<br><br>The music in \"Whiplash\" is great. It's like going to a jazz concert,\nespecially the finale performance at the end. For the plot itself,\nhowever, I did not like it at all. The teacher is very abusive, and\ndies everything he could to stir up rivalry and hatred among his\nstudents. The worst thing is that the film gives him time to justify\nhis abuse. Abuse is not right, and the film allows abusers to give\ntwisted reasons to justify something wrong. That really angers me.\nCoupled with the fact that his students keep on receiving the abuse, it\nevoked a lot of anger in me.\n"},
{"review": "\nWhat a wooden film. As a viewer, you cannot really get to know any of\nthese characters. Nothing great comes from an abusive teacher. Hitting\nstudent in the face, really? No. It was unclear what JK Simmons'\ncharacter really was after. Was it perfection? Is the only way to\nachieve perfection by humiliating students with verbal and physical\nabuse? The drumming was excellent. I'm a musician and I've never heard\nof students bleeding all over their drums. It's ridiculous. The only\nthing JK Simmons' character cared about was tempo. Talk about\nunidimensional. He crucified students only if they couldn't determine\nhis tempo after a few beats. What about dynamics? What about\ninteracting with the band? The script was superficial and lacking.\nPeople probably like this film because Simmons was an interesting\ncharacter and the drumming was interesting. You'd think such a\nbrilliant teacher would be a more impressive jazz pianist - another\nboring scene.\n"},
{"review": "\nThis film reminded me of my high school band instructor who brutalized\na number of students. Some had to be hospitalized and developed\nsymptoms that debilitated them for life. One of the trombone players\nlost his front teeth when the instructor threw a metal chair at him,\ncomplaining that he wasn't in tune. Later, he told us he was only\nkidding, and that if the trombonist didn't know he wasn't in tune then\nhe deserved it. Nobody ever thought they were out of tune again because\nthey didn't want their teeth knocked out. One day he threw a cymbal at\none of the alto sax players and cut into his thigh, severing an artery.\nHe was later hospitalized and still has a limp. The instructor said he\ndid it because he heard Charlie Parker was named \"Bird\" because he had\na cymbal thrown at him, which makes no sense to me but what do you\nexpect from a psychotic band instructor? He swore like a sailor too. I\nlater found out he was in rehab for methamphetamine abuse. I'm so glad\nI gave up the trumpet. The heck with a music career, those people are\ncrazy.\n"},
{"review": "\nThe fact that this movie has earned high rating from its audience is\nunderstandable - in the end, a bad sadomasochistic taste of mass\naudience is no longer a secret. What surprises me is critical acclaim -\nit seems that critics aren't gotten far ahead from the public for which\nthey write.<br><br>As for the movie, it is grotesque, stupid sado-masochistic fiction,\nindulging bad taste and low inclinations of its viewers.<br><br>Most sad thing is that someone not to bright might decide that this\ndegenerative movie is actually depicting reality and will try to bring\nsuch kind of decay into the real life. From the other side, actual\nmaniacs and degenerates might see this movie as an indulgence to their\nactions. Well, now I probably understood who those critics with\npositive reviews on this movie are :)<br><br>3 out of 10.\n"},
{"review": "\nThis movie was a terrible, unrealistic, over the top ridiculous waste\nof time. <br><br>The only redeeming part was the great orchestral jazz, but the\ncharacters, story and, well everything really, means this movie should\nnot be getting the positive reviews it has. <br><br>Where in the world would anyone be able to get away with treating\nstudents like this? It's utterly ridiculous cr** and I cannot believe\nthis was even given approval be made in these days of human rights and\nanti bullying. What a disgrace. <br><br>In addition, we found the story so predictable - it was sort of like a\nREALLY bad Rocky but based on music, except Rocky had heart, soul and a\nrelatable endearing underdog story. All the characters in this were\ntotally unlikeable, unrelatable and awful, who cares what happens to\nany of them? <br><br>All in all this is an over-hyped horrible sad attempt at movie making\nand a great opportunity totally missed.\n"},
{"review": "\nFor all of its widespread critical acclaim and multiple award\nnominations and wins, I found Damien Chazelle's 'Whiplash' to be a\nrather thin and clichéd regurgitation of the tired \"Driven artist,\nintense student/mentor relationship\" trope with absolutely nothing\nfresh to say or offer up.<br><br>I believe its reputation is primarily built upon the strong\nperformances of its two leads, Miles Teller and J.K. Simmons. Though\nboth characters are paper thin, each actor absolutely inhabits them in\na way that adds a dimension that isn't on the page. Their impressive\nperformances only make me wish that much more that the material were up\nto their level.\n"},
{"review": "\nIsn't it time to review the rating system on IMDb? The time factor from\nrelease needs to be tweaked to accommodate the fact that newly released\ntitles have tended to become more and more overrated. Otherwise one of\nthe fundamental successes of IMDb will be devalued, and IMDb as a whole\nas well.<br><br>With regards to the movie, I give it a 6 due to the performance of JK\nSimmons. Even if his characters unrealistic behavior is also the factor\npulling down the verdict, he manages to make it less unrealistic in\nsome weird way. Altogether it is a somewhat feel good movie with\nscattered story line and worthy of an average rating.\n"},
{"review": "\nAwful waste of time. The same end result (the amazing drum performance\nby the kid) could have been accomplished a lot faster and effectively\nwith positive reinforcement. They way the bald bastard teacher\nphysically and verbally abuses his students is plain disgusting. A\nclear example of exaggeration to give the story line a greater climax.\nA F#$%ING TRUCK crashes right into his car as he puts his phone down in\nthe car. He shakes of the injuries (bloody arm, head, and face) and\nruns to his class to join Fletcher's performance. <br><br>The acting can't be taken seriously, instead of being pulled into the\nmovie, the Fletcher's bad acting and \"over exaggerated\" teaching style\nmade me close the movie 30 minutes in. <br><br>Please don't waste your time watching this over sensationalized\nrendition of \"true\" events.\n"},
{"review": "\n100 minutes of torture the movie is not good and its point<br><br>is to end the new way of raising teenagers by motivating them to\nreplace motivation by torture , face slapping and throwing them with\nchairs . The movie main role is stop motivations The movie also co-urge\nteens to stop working in teams to hate the success for others in the\nsame field as they may take your place the movie is the very bad\nteaches teens that the only way to success is : -ve energy reverse\npsychology !! I believe that the key of sex is by hard work and lots of\ntraining not making people hate and try to hurt each other and use\ntorture and make the whole team enemies all afraid to lose his place\n"},
{"review": "\nAfter all this time I've finally watched this. And yes, it reminded me\nof Full metal jacket, part one. I guess that Mr. Chazelle drew his\ninspiration from Kubrick and boy, did he make it right! Direction is\nperfect (including editing), fantastic performances by two main\ncharacters and fine choice of music. Beautiful photography also. This\nmovie has everything to make it perfect, however Mr. Chazelle is not\nMr. Kubrick but may probably be one day. If he tries hard enough to\ndevelop his own style. Do not give up now that you set the bar so high.\nAll my compliments to the crew of this movie. Truly a gem. Highly\nrecommended.\n"},
{"review": "\nI accidentally watched the movie (by looking at the cover full of\nawards) and I must say I was very impressed by it.<br><br>I'm really not a music expert by any mean, but the two main actors are\nseriously phenomenal and makes me think they are genuinely who they are\nplaying.<br><br>Everything is just very amazing : -the actors are damn flawless\n(Fletcher is so funny yet passionate - those shoutings!- , Andrew is\ntruly great despite the fact that I don't really like Miles Teller)\n-the directing is also flawless by all means really just like the music\nin the whole movie -the story is sufficiently immersive<br><br>I recommend this movie to everyone who want to see a true masterpiece.\nAlready watched it two times, and will again so the rewatch value is\npretty high.<br><br>So anyways enjoy this epic movie, You 95% sure won't regret watching it\n! :D\n"},
{"review": "\nmost people don't. <br><br>Jazz is dying for that reason. <br><br>As a former drummer, if I had the choice between being the core drummer\nat Lincoln Center or being the drummer in a famous rock band I'd choose\nthe latter.<br><br>Most music fans don't care how fast someone can drum and they don't\ncare for drawn out drum solos.<br><br>Also, if there ever is another Buddy Rich or Charlie Parker, they'll be\nplaying as unknown session musicians...there would be no fame and glory\nor people talking about them after they die..except for friends and\nfamily.<br><br>They had their time and their time has passed.<br><br>Great movie by the way, even though there is a massive plot hole with\nthe JVC concert at the end..(as mentioned in this forum).\n"},
{"review": "\nWhiplash is an astounding piece of modern day cinema. Its a film that\nleaves you physically shaking even after the second watch and with a\ncomplete sensory overload as you try to reconcile every element of that\nfilm that seems to have been seamlessly and passionately crafted. <br><br>All that I hope is that Whiplash is not too overpraised in the sense\nthat future audiences may meet it with harsh expectations and come away\nunderwhelmed. Part of what made the first experience so special was\nthat I had no expectations, I saw a short trailer and it was at a\nconvenient showing time.<br><br>Its excitement may dwindle, like sussing out a roller coaster,\nfollowing its turns and loops from the ground before you even hit the\nqueue. Whiplash is adrenaline cinema and is best met head on.\n"},
{"review": "\nBeing a musician all my life and seeing this film makes me hate the\nmain character. And more the teacher. He practices all wrong and he\nalways has accuses. The best drummer doesn't made from playing fast,\nthat is so stupid. The best drummer doesn't made from playing stiff,\nthis is even more stupid. And the best music teacher surely doesn't\nmade from a tough guy who do not the first thing how to teach, you can\nnot push students like that to make great musicians. The whole point is\nto relax and feel the music. And swing is about feel the beat. You need\nto master the slow tempo so you can then be more accurate at higher\ntempo. What his film try to communicate about practicing and being the\nbest musician is absurd. I stopped half way through the film, I just\ncouldn't watch this non-sense anymore. <br><br>The main character does also looks very dumb as a person and worst as a\nmusician and I believe not many musicians can relate to that. I wish\nthis film deliver the right message about what being the real musician\nis all about. If you get that wrong then everything is wrong.\n"},
{"review": "\nThis is without doubt a brilliant film I normally watch action films\nbut thought I would have a break from action and I was not disappointed\nthis film brings a brand new perspective to phycological abuse as the\nmentor pushes the kid to breaking point and beyond. I felt though at\ntimes especially the very beginning the drum solos were boring dreary\nand unnecessary. The ending was well thought out and planned and the\nplot was good I however wanted to see the farther of the kid meet the\nmentor for a period to see his reaction in front of the mentor. This\nfilm is a must see for anyone who likes something different to the\nnormal films. 8.2/10\n"},
{"review": "\nPredictable Kirate Kid remake at the drum set. Besides some cool\ndrum-lines and jazz performances here and there the storyline is\ninfantile. Can't Hollywood think of an original storyline. I could have\npredicted the ending in the first 10 minutes.<br><br>At various points it just descends into comical farce, but not in a\ngood way.<br><br>It also sends the damaging message to everyone that abuse between\nteacher and student ends up being beneficial, so in the end the film\ndefends and supports that abuse.<br><br>How this film can ever be considered to be in the top 100 movies ever\nmade is beyond me.\n"},
{"review": "\nWow, where to start? <br><br>Well first of all, there are two characters in the film, two! <br><br>The stupid romance thing was unnecessary and very forced.<br><br>And oh my god the teacher throwing chairs at kids and slapping them??\nRidiculous and unrealistic.<br><br>And why didn't the teacher ever yell at anyone else except for Teller's\ncharacter?? He only did it once and that was just to assert his\ndominance to the audience, which was very very very obvious. Why was\nthe teacher just angry at the quiet drummer??<br><br>So so so unrealistic on all aspects and I just wanted this terrible\nproduction to end.<br><br>And what was up with them bleeding after drumming too hard? As a friend\nof a drummer, I know that no matter how hard you played, if you were a\ngood drummer you would never start bleeding.<br><br>Terrible\n"},
{"review": "\nIn fairness, I probably shouldn't write a review or give a rating as I\nwalked out after an hour. After all of the many positive reviews of\nthis film I couldn't wait to see it. This movie is like a twilight\nversion of Glee. The teacher throws a chair at the main character, the\ndrummer... thank God the drummer ducked otherwise he'd be dead. The\nteacher both physically and mentally abuses Andrew. This teacher would\nnever be allowed to teach in the best music school in the country and\nhe has no passion for the music, he's a robot.<br><br>It seems to me that a lot of viewers are equating yelling, swearing and\nviolence with intensity and great movie making.\n"},
{"review": "\nThis film winning all kinds of awards shows what's wrong with this\nworld.<br><br>The grotesque rehearsal situations and even are completely boring, all\nthe violence and the excessive exhibition of power is so over the top I\nhad to giggle sometimes. The sado-masochistic undertone reminds me of\npeople which are stuck in their puberty and are hanging on to\nself-created supervisors to get the punishment they need to feel\nsatisfied. The story line is completely crooked, the characters are\nshallow and all this film does is praise a facistoid masculism.<br><br>This film is basically Hitler and fails even to deliver to his\nself-assigned standards. Not even the music was good.<br><br>1 star.\n"},
{"review": "\nSeeing the kind of ratings Whiplash got I had high expectations for\nthis movie but at the end I'm disappointed. I expected much more from\nthis movie. Maybe it's because of my natural distaste for Jazz music.\nIt's really a genre of music I almost never enjoy. In Whiplash you get\nrepetitive parts of songs that I particularly don't like at all. And\nthen to have to listen to them over and over again is a bit too much\nfor me. On the other hand the acting was good. The battle between\nstudent Miles Teller and teacher J.K. Simmons is interesting to watch.\nI can understand that sometimes you have to push somebody to let him\nreach his best level but in this case it's just bullying. So maybe if\nit was an other genre of music (like Metal or so) that I would have\nliked Whiplash. But it isn't so to me it's just a movie you watch once\nand then forget about it.\n"},
{"review": "\nIf case Whiplash won the Oscar for best film, it would be no absurdity\n, the plot is great, the pacing is excellent , the film fails to be\ngreat , the cast is good, and the performances are great, Miles Teller\nis his best performance career ( good only for telling the truth ) , JK\nSimmons is impeccable , very deserved the Oscar , the soundtrack is\nanother strong point in the film, the picture is good, and the film is\nfull of great moments , most with JK Simmons makes a stressed character\n, the direction is good , even Miles Teller do a good performance ,\nyour character is very boring and bland , and I found super forced the\nscene he suffered a serious car accident and yet out of the car like\nnothing had happened and will try to play yet. Note 8.4\n"},
{"review": "\nWhiplash.<br><br>While definitely being a movie that hid in the shadows for quite a\nwhile, Whiplash is an excellent film that grabs hold of your attention\nand doesn't let go until you've left the theater thirsty for more! JK\nSimmons performance is incredible as he portrays a bully that is too\nbrilliant for his own well-being, while Miles Teller portrays an\nup-and-coming jazz drummer that doesn't see his own potential until his\nanger forces it out. Both are great actors that do this film justice\nand give the audience an exhilarating roller coaster ride of emotions.\nThere are few movies that inspire me to follow in the characters\nfootsteps, but surprisingly after this film I had wished that I could\nplay in such a way as Miles Teller performed.. Nevertheless, this movie\nis a must see whether you have an interest in music or not. 10/10\n"},
{"review": "\nI enjoyed this film on many levels. Being a drummer myself, obviously\nthe subject matter was of great interest to me.<br><br>The acting performances were excellent, especially J K Simmons. This\nguy is like a good wine, he improves with age. I loved him in Juno.\nHowever Whiplash must be his defining role. I was delighted to see this\nwas recognised at the Academy Awards. I was very impressed with Miles\nTeller too. He first came to my attention in the film Rabbit Hole. An\nexcellent young contemporary actor.<br><br>I would recommend this film to anyone who has an interest in music and\nenjoys films with a good dose of gritty realism. And again, look out\nfor J K Simmons in scintillating form. Enjoy!\n"},
{"review": "\nThis movie was HIGHLY recommended by a very good friend of mine, Miles\nTeller and JK Simmons are good actors so I thought, why not give it a\nshot? I kinda regret it now...<br><br>Pro's: Teller and Simmons really did a \"GOOD JOB\" on playing their\nparts, the music (when played in longer sequences) was well-formed, the\ncamera team did an awesome job in capturing the very intense sequences.<br><br>Con's: the amount of swearing....SO unrealistic, WHO talks like that?\nSimmon's Flatcher was SOOOO over the top, WHAT school even pays such a\nteacher!? Also, almost NO plot, two side characters (Teller's\nalmost-gf, his dad) that were absolutely unnecessary to both character\ndevelopment and plot. Additionally, Fletcher seemed like a total\npsychopath with severe schizophrenia to me who even got what he wanted\nin the end by being the biggest dick.<br><br>My Verdict: I had A lot of wtaf-moments, was entertained by the intense\ndrum playing and Miles's acting but I absolutely don't understand the\noverall hype and a rating of 8,5 on IMDb. I wouldn't watch it again.\n"},
{"review": "\nThere are only 2 type of people who will enjoy WHIPLASH. Real Drummers\nand folk close to them, and masochists. How does a musician - any\nmusician, actually - become the best that he can be? Practice, right?\nObvious stuff. Well, that's kind of the theme of this movie. J. K.\nSimmons is a perfectionists band teacher dedicated to getting the best\nhe can out of his college age jazz students. He 'is a DI' in the real\nsense of the term - totally reminded me of Drill Instructor I suffered\nunder in the Marine Corps. His chosen student, Miles Teller, will\nbecome 'the greatest' jazz drummer ever or die trying. And that is JK's\nmission and the story. Add lots of foul language and physical abuse and\nway too much solo drumming and you've got this movie. Not fun too\nwatch, not fun too listen too. Not much of an Academy Award worthy\nmovie, really. And, the ending is not believable either...\n"},
{"review": "\nI have never written a review on this site before. Never. I have been\nand IMDb member since 2012. I felt to need to write a review after\nwatching Whiplash. I sat perplexed when the end credits rolled over my\nscene. I had just seen one of the best films ever created and already a\nclassic of the modern time. Raw emotions, amazing performances by both\nTeller and Simmons great music breathtaking cinematography amazing\nsound editing. I don't think there is going to be a movie like whiplash\nin a long, long time. Even if you don't like jazz, I would recommend\nthis movie to anyone. Cinephiles and casual movie watchers alike are\ngoing to find common ground in whiplash.\n"},
{"review": "\nI loved this but the movie is underrated. <br><br>J.K. Simmons did a good job portraying his role, no doubt he won an\nOscar for this one. Miles Teller also did a good job as a drummer boy.\nToo bad, he wasn't acknowledge by the Academy. Even the movie did not\nget so much attention. Maybe because it was released by the end of the\nyear, I honestly think that this is an Oscar worthy. <br><br>The intensity of the movie is just over the top, literally the emotions\nthat you felt while watching the movie were real. After watching it, I\ncan't stop thinking about it on how wonderful the movie was. We need\nmore like this kind of movies.\n"},
{"review": "\nan extraordinary film about the passion and the dreams anybody can be\ninvolved into. it makes you truly think about how much you are ready to\ndo for what you believe in. it makes you think about the limits of what\nsurrounds you and the ones you create by yourself. how far can you go\nwhen you really want to? how deep is you passion? how deep is your\nwill? this film shows that your dreams always crush against reality,\nthey cannot live in an utopian dimension. do you want to do something?\nthen you have to prove yourself that you can do what you want the pain\nand the suffering are as higher as you push yourself beyond your\npossibilities. the ending is an escalation that just leave you\nbreathless\n"},
{"review": "\nFrantic, this is Whiplash is amazing how Damien Chazelle shows the\nobsession of Andrew Neyman (Miles Teller) .no mellhor style Darren\nAronofsky, the sound mixing in this movie is something great, camera\nangles, dry cuts are phenomenal, the JK Simmons acting is maginifica.\nIt's really cool how the film rehearses develop a more loving\nrelationship with my boyfriend and the father, the more he does, he\nfocuses on the main drama that not the protagonist, that's fantastic,\nWhiplash is a film that has to be seen, final scene is something\nsurreal, spectacular, all of it is amazing, in the end you already\npractically inside the screen, you're already hitting on her knees\nplaying together. The script is simple, because he does not require\nmuch, Whiplash is amazing.\n"},
{"review": "\nThis is a great movie to illustrate the drive that a lot of us have as\ncreative people. All artists struggle with this same issue of wanting\nto be great. We aspire to be like the role models that we look up to\nand attach ourselves to. Not knowing that at times we are just as good\nas them. However, a lot of times our accomplishments are never enough\nto fill our satisfaction. This movie is a great reference to this. It\nis a good reminder that you have to be proud of yourself. One must\nacknowledge what one has accomplished in order to protect one's passion\nand sanity for the arts. Andrew takes us through his journey of this\nsame experience. We are able to observe his determination turned to\nobsession, and hopefully learn from his story in creating our own.\n"},
{"review": "\nThis masterpiece film holds a rare honest view into the cost and need\nfor excellence in millennials' lives.<br><br>My expectations: fairly low. I did not expect the film to be so\npowerful for me as I am not one for jazz bands. Expectations exceeded,\nI think about this film quite often, although I had to be begged to\nwatch it.<br><br>Recommendation: Film lovers and casual cinema goers, I believe will\nenjoy this film.<br><br>Re-watch value: I have watched this film over 6 times since release .<br><br>Memorable: I am still thinking about this film to this day.\n"},
{"review": "\nThis is easily one of the best movies of 2014. Whiplash will be the\nmost intense movies you will ever see. J.K. Simmons is the best part of\nthis fantastic movie. I was surprised how much I was terrified by his\ncharacter. He defiantly earned that Oscar. Miles Teller was also great\nin this film. It has become one my favorite movies of all time. The\nmusic in this movie was also fantastic. Miles Teller is such a talented\ndrummer. To some this movie might not be a easy watch, but I'm going to\nrecommend it to just about any one regardless. I feel like a lot of\npeople will enjoy it. Please check this film out. It has become one of\nmy favorites of all time.\n"},
{"review": "\nWhiplash is a beautiful movie that shows perception and expectations of\na young drummer and an experienced band teacher who is short tempered\nand very strict.Movie is boring in starting but last half hour was\namazing.<br><br>JK Simmons was amazing as a Band teacher and he really deserves that\nOscar for best supporting actor in a Supporting Role.Other cast was\nalso nice.<br><br>Watch this movie if you want to fulfill your dreams no matter how much\nhurdles are there in your life.<br><br>My recommendation is that don't watch this movie with higher\nexpectations.<br><br>Overall I give this movie 8/10.\n"},
{"review": "\n'Whiplash' is the story of two men. One is a young music conservatory\nstudent determined to be as good as his idol, Buddy Rich, on drums. So\nsingle-minded is he in this pursuit that he largely ignores other\naspects of a normal, well-adjusted life, including personal\nrelationships. The other primary character (J.K. Simmons in a\ncareer-defining role) is the most hard-ass music instructor ever. He\ncurses, cajoles, intimidates and physically assaults his students,\nbuffered by the philosophy that if he does not, they will never achieve\ngreatness. Neither lead character will yield, and from that premise and\ntension flows the drama and some incredible jazz music.\n"},
{"review": "\nNever thought I'd like this movie. Really love the drum playing and\nactually i was hoping that Andrew would play it one more time at the\nending, instead he played Caravan. This movie also has a great plot\ntwist. Wow, I should learn human character to anticipate what a person\nlike Fletcher would do when he is felt betrayed. He's never be really\ngood to you. He would revenge. Fletcher is like a male version of\nMiranda Priestly in The Devil Wears Prada, only severer. Can't imagine\nif someone suddenly throws hard object at me.<br><br>Having watched this movie got me thinking that I haven't done enough\nfor my dreams. I feel so small. Somehow I feel Andrew is too obsessed.\nYou should see how hard he practices everyday to impress Fletcher, yet\nit's never enough for his meticulous ears. Luckily it ends happily, so\nthere is good price to his every hard work.\n"},
{"review": "\nAn absolutely riveting movie. <br><br>Terence Fletcher (the crazy good J.K. Simmons) and Andrew Neiman (Miles\nTeller) were both amazing in this, although really, Fletcher took the\ncake. His character embodies that fierce (and sometimes violent) drive\nin each of us, or perhaps some person in our lives that tries to push\nourselves to the limit, which is what makes this movie so personal as\nthis connects with the audience. While on the other hand, Andrew\nrepresents the dreamer in all of us, but is sometimes faced with the\nlimbo between attempting to push harder or to give up. This is what\nmakes this movie so engaging. <br><br>The music in the movie, coupled with the drumming also adds to the\ntension in this roller coaster of a movie.<br><br>The finale was also spectacular and epic. There's basically nothing to\ncriticize this movie for. It elevates the simple idea of diligence and\nsuccess to a whole new level and engages the audience throughout. <br><br>10/10\n"},
{"review": "\nReally an inspiration movie, which felt me like a music student who\nsitting under pressure with J.K. Simmons role, real hard way to hang on\nmusic as hard life, till the end. I think each shot you had perfectly\ndepicted to movie without losing the intensity, special thanks to J.K.\nSimmons. The J.K. Simmons and Miles Teller, characters made this movie\nmore powerful which made audience kept on toss.<br><br>As this is a really story experience and best part is how beautifully\nthe screenplay which made this film stands out from crowd.Electrifying\nmoments which made me felt that I'm student in the band, a fear to play\nthe instrument with proper numbers...<br><br>All the best Damien Chazelle, for your future assignments :) This movie\nwill be one of my best liked movie in recent years.\n"},
{"review": "\nThe main argument of this film is that music is like a sport. You have\nto put yourself to the limit to be a top player. And this is not true\nfor music. Music is all about feeling and soul and touch audience with\nthe performance, not to be able to play at 400 BPM. Being a musician is\nan inner path to lead to a self discover. Virtuousness come with the\npractice and talent, but not being assaulted physical and emotionally.\nMusic is an art, not a competition, so is subject to be interpreted in\nmany ways, so being a best musician is not matter of math or time\nclock. Jazz is a language, not a race. Photography and editing are\nsuperb in the film, that's the only thing I liked.\n"},
{"review": "\nWhat I love about this movie is how it makes you feel exactly what the\ncharacter(s) are feeling. The acting is exceptional. Andrew is a very\nrelatable character, even if you don't do music. And don't even get me\nstarted on how phenomenally good J.K. Simons is in this, he's a\nfreaking master. He's my new favorite actor. Also Miles Teller\nimpressed me. I mean I saw him in Divergent &amp; The Spectacular Now, and\nhe wasn't bad. But damn, he was legit in Whiplash. <br><br>And one particular scene literally gave me the chills (yall who saw the\nmovie know what I'm talking about) like it was unreal. I've never been\nso immersed in a scene that I forget EVERYTHING ELSE except what's\ngoing on in the scene. It's like...this film moves out of the screen\ninto your head and messes around with your emotions and thought\nprocess...crazy stuff<br><br>Just watch it\n"},
{"review": "\nAt first it was not the synopsis of the movie that captured my\nattention but the IMDb score. I thought \"it's just a movie about\ndrumming, how compelling can it be?\". I was an ignorant fool. This\nmovie rocks (or jazzes). From start to end. Your eyes are glued to the\nscreen, you keep guessing what will happen next. I anticipated how the\ncharacters would react to one another, not how the story unfolds. The\nsheer brutality is both refreshing and terrifying. Coming from all\ncharacters. They did a splendid job on building original characters. I\nsalute you. It was also an eye-opener for me and my friend. It was\nenthralling to learn more about the world of orchestras and jazz.\nStill, it was awesome. A thousand out of ten.\n"},
{"review": "\nIt was one of the worst film that I ever seen.Why?Cause in this haul\nmovie,there was nothing that I didn't expect.It was a film with million\nclichés.His mum died early,a dad who don't care about his career and\nlove more his bigger child,a girlfriend that he see all the time,a\npsychopath music teacher,a boy who get insane because of the others,a\ncar accident.Those things,you can see in every movie.And it is really\nsimilar with the film \"Shine\" who came out in the cinema in 1996.But\nwhiplash is not even a real story so they can change the subject,the\ncontains,the events...They had the power for change this.But they\nprefer to make a film who everybody will love,don't take risks.I am not\njust mad at the film but the people who gave awards to.Okay the music\nis good I love that to and I liked the way that film was filming but\nbest writing,3 Oscars.There is so many film that is better than this.I\njust don't get it.Sorr,maybe there is so many people who liked it but\nit doesn't mean that this film was actually good.\n"},
{"review": "\nWhen I went to see this movie I just knew that this one will be a story\nof a music enthusiast trying to make his way up. I had no idea what\n'Jazz' music was and I was unaware of all the jargon used in the band.\nI won't give much of the storyline in this write-up, but it is surely\none of the best movies I was ever watched, ever! I was clentching my\nfist all the while, when the 'perfect' music was demanded by the bald\nheaded music aficionado from his team. This movie has three stages: The\nguts to fight it out, the payback time and the ultimate synergic win! I\njust loved how this movie transpired to be so real yet so alluring at\nthe same time. The acting was as good as it can be. The movie builds up\na tempo and never for a minute bogs down. 106 minutes of pure,\nexhilarating entertainment. It has emotions, anger, despair, revenge\nand yet, it all ends in a supposedly triumphant journey.<br><br>Long story short, Whiplash will blow your mind off! Phew ... genuine\nlegend!\n"},
{"review": "\nAndrew Neimann (Miles Teller) is a first year student at the\nprestigious Shaffer Conservatory. His father Jim (Paul Reiser) is a\nsweet high school teacher. He gets picked by Terence Fletcher (J.K.\nSimmons) to be the backup drummer in his winning Studio band. He gets\nenough confidence to ask out Nicole (Melissa Benoist). Fletcher is a\ncruel manipulative dictatorial teacher.<br><br>J.K. Simmons gets a great juicy part to show his skills that he has\nshown all these years. He fully deserves his Oscar win and it's not a\nsurprise. He's certainly done great work in many TV and movie roles\nbefore over the years. Miles Teller take a great step up. He has done\ngood work but this is something much more. It's a compelling character\nwho develops and changes. He's able to play through it all.\n"},
{"review": "\nIf you don't like Jazz, then this is not for you. As there is loads of\nJazz in this and I am not a fan.<br><br>J.K. Simmons as Fletcher is brilliant as the half man obsessive tyrant\nand Miles Teller as the lead character matches him in being equally as\nobsessive in pushing himself to the very limits in a win at all costs\nmentality to succeed at his chosen profession.<br><br>I have no idea how true to life this would be in the modern age but\nmaybe in the 60s and before.But the way they treat the students here\nwould make Sociologists have a nightmare in the management of human\nbehaviour performance.<br><br>The film plot scope is quite light as at the end I thought there wasn't\nmuch of a story, and not an original story either so you need to love\nJazz. I am not sure if people could be this obsessive over Jazz. <br><br>Main plus in the film (if you don't like Jazz) is the performance of\nthe two leads.\n"},
{"review": "\nOr...The Stanford prison experiment - with drums. <br><br>There is something disturbing about the overall message of this movie.\nThe idea that greatness is justification for abuse and that abuse can\nsomehow inspire students to greatness is just one of messed up ideas\nthat is entertained in this movie. <br><br>Masochist student teacher relationships apparently bring out the best\nin students and oh yes, you are not a serious drummer unless your drums\nend up splattered in blood and sweat.<br><br>Apart from exploring a messed up form of battered person syndrome and\nbattering our credulity with predictable shock tactics, this movie\nreally does not say anything about greatness, music or the kind of\ninspiration which brings the best in human beings. <br><br>As a musical person who has had the privilege of being conducted and\ntaught by great teachers who achieved and inspired great things. There\nis nothing in this movie about what it takes to create and make great\nmusic. Intense dude, seriously intense!!!\n"},
{"review": "\nUndoubtedly one of best movies of 2014 ! It has emotion, passion and\ntragic moments of breathtaking. It basically tells the story of one\nteenager that doesn't look at the means to achieve the purposes, he\nwants to became the best drummer on earth and to do that he will work\nvery hard to reach his dream. I found the story very well entangled\nwith a constant tension that captivates the audience. Although I have\nto recognize that this tension led sometimes to moments of\noverstatement (like the moment when Andrew started bleeding while\ndrumming) and this is why I gave it 8 stars and not 9. The movie\ntransmites a very strong message that I think everyone who saw (or will\nsee) this movie, without taking into account whether liked or not,\nreceived and thought about it for a couple days. When the movie ended\nit was almost 3 am and I was very tired but this didn't stopped me from\nsearch for the original \"Whiplash\" song by Hank Levy. I truly recommend\nfor those who haven't seen this movie yet to run to the cinema and buy\na ticket for \"Whiplash\".\n"},
{"review": "\n3 Oscars is even too little for it ;)<br><br>congrats for J.K. Simmons for Best Performance by an Actor in a\nSupporting Role. He and Miles Teller did one hell of job ,, amazing\nacting .. captivating ,, an amazing plot with unexpected turn of events\n!! i don't know if you guys ever watched him in Whiplash in the year\n2013 but here he elevated with his role so high.<br><br>The Sound Mixing and the soundtrack are genius and electrifying,, i'v\nnever really cared so much for Jazz but the songs in the movie is so\nmagnetizing and engaging.<br><br>The story itself is sensational, really makes you think about yourself\n.. your dreams .. ;)<br><br>I really loved it ,, and it was deserved Oscars wins :)\n"},
{"review": "\nThis is a music school drama about a bunch of spineless kids who cower\nin fear for their music teacher, who routinely pours verbal abuse on\nthem. Not a single one of them has the courage to look him in the eye\nwhile he is doing so. Yet the teacher is hoping that one of these\npersonality-deprived wimps will be the next Charlie Parker. This\npremise just didn't make sense to me, and as it was presented early in\nthe movie, I watched the whole thing with disbelief. Other than this\nthis movie does everything right though. The music is a joy to hear\nthroughout, though jazz isn't my thing. Watching it being taught and\npracticed is interesting. The main actors do a terrific job and are\nperfectly credible. I just couldn't buy into the idea that a music\nteacher would expect any of the personality required to be a genius\nmusician from kids who can't even look him into the eye.\n"},
{"review": "\nWhiplash is the definition of a high tempered film. This film has a\nvery solid and fast opening, with a great introduction to the two main\ncharacters (Neiman and Tanner), where we quickly learn their positions\nin this film.<br><br>With its fast pacing, and its stressful tone created by the almost\nconstant drum-music and the easy to understand story, this film will\nhave your complete attention from the opening, and will have you\nsitting on your seat throughout the whole film all the way to its\nperfectly executed third act.<br><br>Unfortnately there are a few quite predictable points in the plot,\nwhich is why Whiplash is only getting an 8 out of 10, instead of a 9\nout of 10. Whiplash is a masterpiece. A predictable masterpiece, but a\nmasterpiece none the less.\n"},
{"review": "\nIncredible, with myself being a musician I thoroughly enjoyed this\nfilm, although I plead that if you do not play an instrument, you will\nstill find this film extraordinary. Miles Teller did an amazing job\nwith his role as the protagonist, but I think the real person who stole\nthe show was J.K. Simmons. His character was one of the scariest\n'villains' if you could call him that that I've ever seen put to\ncinema. I think it was the fact he was a teacher and this feels\nrelateable to most people, so people can feel the fear, pain and\npressure that comes from his character. He 100% deserved that Oscar. As\nfor the cinematography, it was incredible, really well shot with\nintricate details. Definitely go watch this film, you will not regret\nit, I assure you!\n"},
{"review": "\nWhiplash is a simple idea stretched out to become an epic character\nstudy. Andrew Neiman (Miles Teller) is a jazz student at Schaffer Music\nSchool who meets teacher Terence Fletcher (JK Simmons) an abusive\ntyrant known for his terrifying methods of conducting. As Andrew tries\nharder and harder to please Fletcher he closes off everything else that\nmattered to him and turns his desire to be the greatest into an\nobsession. It's an exhilarating story that doesn't let up from\nbeginning to it's incredible final act. The acting from Simmons is\ngreat and it's really no wonder that he was given an Oscar for his role\nas Fletcher. Teller is also great as Andrew and we really see his\nchange through the movie. Whiplash is epic.\n"},
{"review": "\nFour words: Film of the year. Everything about this film was excellent;\nthe acting, the story, the directing, and even more so the script was\nbrilliant. J.K. Simmons deservedly picked up the Oscar and 'Whiplash'\nwas robbed of Best Picture also. The intensity of this film was\nmaintained throughout and the immense tension felt by Miles Teller was\nsuperbly portrayed. One thing I loved about this film is that it is so\ndifficult to dislike. Even if you have no interest in music or anything\nlike that, you still won't be able to stop thinking about this film.\nAnother great thing about 'Whiplash' is the fact that it did not drag\non at all. It was short, snappy, intense and near-perfectly executed\nwith quality insults from J.K. Simmons throughout. The best film of the\nyear. 8.5-9.0/10\n"},
{"review": "\nThis movie literally killed me. My heart could not stop pounding, my\nfeelings could not stop expressing themselves. I was lying in my bed\nand i literally had to stand up the last 15minutes as i felt like the\nmain character, Neiman. His passion, his forgiveness, his absolute\nmadness and desire of being the best of the best made me applaud and\ncry after the movie ended. Applaud for the author, applaud for the\ndirector and producer, for the actors and for Neiman. Cry because he\nmade it, cry because he lost. Cry because it was all his life which he\nlost many times and found back only once. Cry because I could have\nnever done that. Cry because I would never had made it so far. Cry\nbecause in my point of view it was not worth it. Applaud because\nnevertheless he made it.<br><br>When his instructor caught him in the trap, he fell but stood up. He\nlost the battle but he won the war. He proved himself to be the best\ndrummer in the world. Congratulations to the team making this movie.\nUnreal emotions. Watch it.\n"},
{"review": "\nThe most fascinating thing about movie is that cruel reality that gives\nyou the feeling that you're in the movie. The screenplay is associated\nto the screenplay of life of each of us so everybody can understand the\npoint and the message of the movie. J.K. Simmons was brilliant acting\nFletcher, and I enjoyed in every single move that he made in his role.\nCongrads to Miles Teller! His role was deserved with so much hard work\nand patience which who took him to the perfection. I rated this movie\nwith 9 because I give 10 to the movies that contains complex and\nmysterious screenplay. No matter what, this movie is one of the most\nrealistic movies I saw, and I enjoyed.\n"},
{"review": "\nI had heard great things about this movie and i was certainly not\ndisappointed it kept me on the edge of my chair for the entire 100\nminutes.<br><br>Whiplash is a one of a kind and a fantastic movie, the directing and\nacting is superb and I thoroughly recommend this movie to anyone who\nwants a good watch<br><br>I hope there are more movies like Whiplash in the future because it was\namazing.<br><br>I rate it a 9/10!!!<br><br>Thanks,<br><br>Nick\n"},
{"review": "\nThe story here seems to be classic as is about a talented young person\nthat wants to be in the top of his class.<br><br>Being good for him is not enough, only being the best is acceptable. So\nhe loves what he is doing in a twisted way. He is competitive and so\nupset of being recognized as the best that nothing else really\nmatters... at all.<br><br>So the different view of that story is that the hero is an anti-hero,\n(a true psychopath), but this is the beauty of that film. You don't\nnecessarily have to be a strong or good person to be a great artist.<br><br>Good script, not boring, not predictable, in general it was a nice\nentertainment time for myself.\n"},
{"review": "\nGenius is often attained at the cost of sanity, and/or dignity. Tough\nlove is an outdated concept, but its necessity still lingers for some.\nIn Whiplash, an ambitious, driven young man thinks he has found the\nmentor to take him to the top, but the teacher's methods become\nincreasingly unhinged. Miles Teller and J.K. Simmons give outstanding\nperformances that fuel this high-octane piece. Standards of sanity are\nnever relevant here; it is all about how far you can go, how much you\ncan take. Two strong personalities knock hard against each other with\nno give expected, till a conciliation, or symbiosis, emerges in the\nend. For me, the only plothole was the fact that Fletcher's violence\ncame as a surprise. In every school there is a teacher who is fearsome\nand that earns them a reputation. Fletcher's 'methods' would have been\nthe talk of the campus - for Andrew to finally gain entry to that\nclassroom having heard nothing of Fletcher's violence and vitriol was a\nbeat that badly deflated the narrative. That one gaping wound aside,\nthis is a gripping, visceral ride of a film.\n"},
{"review": "\nThis amazing movie has rightfully moved up to number 41 on the IMDb top\n250. J.K. Simmons is acting at his best in this movie, definitely his\nmost impressive role to date. Deserving of it,he won an Academy Award\nfor Best Supporting Actor in this role. Miles Teller as well delivered\na memorable role, possibly being the jump start to a successful acting\ncareer. Other elements of the film also made the movie a work of art,\nsuch as the sound mixing, cinematography, and the impressive editing.\nThe story shows the struggle of dedication and its reward. Miles Teller\nplays a kid unlike others, that has his heart and hands set on\ndrumming. I won't spoil this movie, mostly because it deserves to be\nwatched by all. In all seriousness, this is a MUST watch movie, one to\nremember as one of the best films of the decade.\n"},
{"review": "\nThis is one of the best movie in 2014. i've seen. The movie is\nunexpected,uptight and looking in one breath.Great acting by\nJ.K.Simmons, he deservedly won Oscar. On the other side is Miles Teller\nwho show us again how he can become a great actor if he continue to\nwork in this way. Great reference to the story of Charlie Parker, i\nlove that guy too. I recommend this movie for all movie maniacs like\nme, and others who understand what's the quality, and for music lovers.\nWhiplash and Caravan are wonderful compositions, love them too. That's\nanother deservedly won Oscar. Soun mixing is awesome. If you ever dream\nto be the best this movie gave the great inspiration for that, and that\nmeans you can't avoid this movie. Really magnificent drama for 21st\ncentury.\n"},
{"review": "\nThis is one of the best films I've seen in a very long time. I did not\nexpect to enjoy it, since I went into it without an appreciation for\nJazz music or how passionate musicians can be. However, Andrew's\njourney was both emotional and psychological, and I was very intrigued\nby how his relationship with Fletcher formed. By the time the film had\nended, I had developed an interest in the Jazz music scene and I had so\nmuch more appreciation for the intensity of performance art and the\nwork that goes into it. I see the pressure that is put on musicians and\nother artists to be perfect, and that even though music is supposed to\nbe a means of expression, sometimes there is no room for error.\n"},
{"review": "\nWhiplash 2014 is a great movie that shows the story of how just the\nright push was needed to reach greatness. This film is an emotional\nroller-coaster performed by an amazing cast. I've read many reviews on\nthis film and agree with a lot of the good and bad reviews for their\nwell made points on what took place in the film; but in all reality\neveryone needs that push to go above and beyond.<br><br>I loved this movie for it's great story line and script, I loved it for\nit's coverage on the points of \"Just how far are you willing to go for\nwhat you want to achieve?\"; this story takes it to the edge. The actors\nperformances in Whiplash were beautifully performed, you could really\nrelate and follow the characters well. All and all this movie is\nperfect and I cannot wait to have it in our personal collection of\nmovies.\n"},
{"review": "\nWhiplash. As someone who's in orchestra and plays sports, this movie is\nlike an overkill supercut of my scariest moments. Although some things\nin this movie you might not get as well if you don't play an\ninstrument, the intensity is still incredible. I've never had a movie\nwhere I've been sweating the entire film, and shoot, the drum solo at\nthe end is surely deserving of a 10 flat. If you enjoyed this review,\nbe sure to check out my YouTube channel Quinn C (the one with the James\nBond emblem). I review films old and new, as well as take in depth\nlooks at the James Bond series. If you like film at all, in particular\nJames Bond, please be sure to check me out on Quinn C (with the James\nBlnd emblem) on YouTube. Thanks\n"},
{"review": "\nTotally engrossing from frame one! Whiplash grabs you by the throat and\ndoesn't let go until the very end. And we are talking about a movie\nfocused on playing the drums. No murder plots, explosions, sex scenes,\netc... simply a tight, well-told story. Fast cuts help move the plot\nalong and it never drags. Surprises and twists make this a phenomenal\nmovie that forces you to go back and analyze everything that happened.\nThe music is great. I think that is really important because the sound\nbecomes a character that helps tell the story. The greatest part is\nthis movie is not a niche movie, it's not limited to \"band geeks\". I'd\nsay it is identifiable to anyone who has worked in any way to be the\nbest at something. Whiplash tells the story of a man who wants to be\nthe best and shows the cost and torture he will endure to seek that\ngoal. The language is vulgar, but even this serves a purpose; is our\nteacher abusive or tough with good intentions?\n"},
{"review": "\nI was recommended the film by a close friend who is a professional\nBlues player...I rolled my eyes as he talked about it, I thought it\nwould just be a promo for his lifestyle.<br><br>I've never been more wrong.<br><br>The movie is full of real world worries and troubles, especially in the\ncases where one pursues passion rather than the dollar. <br><br>The movie give you a whole new appreciation for Jazz and the (not so)\ndying art of live band.<br><br>The characters are fantastic. But what really sets this movie apart\nfrom the others, is that it dosen't care about the 'everything turning\nout just right' that other movies constantly barrage us with. But that\ndosen't mean it ends badly. There are little tones and scenes that\nanyone who has ever thought about giving it all up can relate to.\nWhether it be work or passion, you can feel it.<br><br>Give it a go, I'm glad I did.<br><br>* if you're still not sure, look up the trailer, there's a scene\nbetween Fletcher (the teacher/conductor) and the drummer (protagonist).\nIt sums up the feeling of the film.\n"},
{"review": "\nThe pain. The heart. The struggle. The challenge. The intensity.<br><br>All of those words describe Whiplash at it's core. A visceral,\nstunning, masterfully acted, intense and above all, amazing work of\nart. I apologize if this review is short, but I'm speechless after\nviewing this movie, and that is a definite good thing.<br><br>Miles Teller came with his A game and J.K. Simmons came with... I don't\nknow, but it was something more than an A game because it is now one of\nmy personal favorite performances in any movie to date. Just, simply\nput, incredible. From the story structure, to the direction, to the\nacting and even to the subtlety, this movie has got it and then some.<br><br>Honestly, there is probably a million other things I could say about\nWhiplash, but the most important thing is this... Watch it. That's it.\nWatch this movie and feel like you are being pushed past your\nboundaries without even touching drum sticks. This movie will give you\nan adrenaline rush that fuels your passion, no matter what it is.<br><br>10/10. Just amazing.\n"},
{"review": "\nHaving decided to watch this on a whim, it turned out to be a fantastic\nway to spend just under two hours. I often found myself surprised at\nthe amount of tension and anticipation that was created from a story\nthat was essentially about drumming. It doesn't take a musical\nbackground to tap into the sheer passion that all characters exhibit\nthroughout the whole film. The chemistry between the teacher-student\nduo of Teller and Simmons was incredible and I found both characters\nsurprisingly insightful, with great depth and complexity. In saying\nthat, all of the characters seemed to have some level that it was\npossible to understand, even the parents and girlfriend. It had my\nattention right from the start and it was definitely the best movie\nI've seen in a very long time.\n"},
{"review": "\nThis was a great movie and it totally shocked me. I was like OK maybe\nit will be alright because everyone was saying how great it was and\nwhen I watched it I was shocked. The intensity and the drama was great.\nThe acting was awesome in this movie J.K Simmons is great in everything\nhe does from Oz to the State Farm commercials. The ending was awesome.\nI was excited and intrigued the entire movie it never became dull. I\nsay this or the imitation game should of won best picture. How the hell\ndid bird man beat this movie out that movie was mediocre at best this\nmovie was great. I highly recommend it especially if you play jazz band\nyourself. This is a truly great movie and I was totally shocked how\ngood it was.\n"},
{"review": "\nTo say the least, Whiplash is definitely one of my personal favorites.\nAs a jazz drummer myself, this movie brings the extreme into play and\nit does a very good job doing so. Needless to say, Miles Teller did an\namazing job playing the role of Andrew, a jazz drummer in the school's\ntop orchestra. Fletcher (J.K. Simmons) made sure to push the most out\nof his students and his unfortunate downfall led him to the end of the\nmovie. In this, Andrew &amp; Fletcher work more or less together to create\nan amazing drum solo that brings this movie out and about to top off\nthe cake that this movie was. Truly an incredible show.<br><br>10/10 - Amazing to See.\n"},
{"review": "\nClean the blood off my drum set - brilliant. Don't go past 'Go' do not\ncollect $200 just watch and appreciate. Just don't... whatever you do\ndon't clean the blood off my drum set. Mostly the worst part of this\nmovie is trying to get past the angry angst of a perfectionist with a\ntemper. This review does not employ tactics that require extraordinary\ntalents to appreciate verbosity so I say again clean the blood off my\ndrum kit. If you hated your teacher in grade 4, 3, 7. Well you will\nhate the teacher in this movie. The point is no matter how you hated\nhim/her did you come out the other end better off anyway? Only you can\nanswer that. Check out my 3D games reviews as the only reviewer for 3D\ngame worthiness on IMDb.\n"},
{"review": "\nwatched this movie 5 minutes ago and nothing but good things can i say\nabout Simmons acting, the writing, and direction of the film. This film\nhonestly made me a fan of teller and i don't think anybody else could\nhave played the role better because he really captures that \"i can do\nit\" attitude that keeps you locked into the film. The film really does\nhave this build to it that is almost too brilliant and the\npersonalities show within the actors so very well that it inspires you\nto really examine yourself and your goals and think \"what drives me?\"\nand \"what is my purpose?\". To be honest i chose this film out of random\nand didn't expect much but now it is at the top of my 2015 movies list.\nEvery once in a while you find a movie that is truly great.\n"},
{"review": "\nAndrew Neyman is an ambitious young jazz drummer, single-minded in his\npursuit to rise to the top of his elite east coast music conservatory.\nPlagued by the failed writing career of his father, Andrew hungers day\nand night to become one of the greats. Terence Fletcher, an instructor\nequally known for his teaching talents as for his terrifying methods,\nleads the top jazz ensemble in the school. Fletcher discovers Andrew\nand transfers the aspiring drummer into his band, forever changing the\nyoung man's life. Andrew's passion to achieve perfection quickly\nspirals into obsession, as his ruthless teacher continues to push him\nto the brink of both his ability-and his sanity.\n"},
{"review": "\nOne of the best films out there.<br><br>A well deserved Oscar for J.K. Simmons with a performance that brought\nthe film to life, along with all the the amazing drumming along the\nway.<br><br>This film not only relates to just a small audience of Jazz drummers\nbut also will inspire anyone who wants to really drive for what they\nwant.<br><br>All together the compassion in Andrew (Miles Teller) and Fletcher (J.K\nSimmons) really engages you with the film.<br><br>This film shows the broad lengths that must be taken to get what you\nreally want, showing someone doing this from the ground up<br><br>All in all a 10 from Len.\n"},
{"review": "\nWhiplash is an incredible piece of work that gets better every time I\nwatch it. Not only does it have amazing performances by both JK Simmons\nand Miles Teller, but the script is incredibly well written and the\nmovie itself is entertaining as hell. Intense is a word that doesn't\neven cut it, this movie had me on my toes almost every minute of it. It\nis also very inspiring: NO spoilers but there's a scene where Simmons'\ncharacter is talking to Neiman in a bar, that scene and the chemistry\nof the two on screen is just breathtaking. Great job by everyone that\ntook part in the movie. There are also some shots of the city and of\nbleeding hands that actually really help emphasize the mood and current\nsituation in the film. In the end, Whiplash is an amazing film with\noutstanding performances.\n"},
{"review": "\nThis movie is, in a word, phenomenal. The actors do an amazing job to\nbring the emotions to life. I felt rage one moment, and sadness the\nnext. Culminated by a sense of pure awe. The relationship between\ncharacters rides a line between pure hatred and admiration. One of the\nmost fantastic and breathtaking movies in years. I could re-watch this\nmovie a dozen times and still be utterly blown away. This film is an\nabsolute must see for anyone who is a fan of high strung, emotional\nfilms, or really just a movie lover in general. A roller coaster of\nemotions with a main character you can never stop cheering for.Quite an\nexperience, and one I would highly recommend to anyone who asked.\n"},
{"review": "\nDamien Chazelle's 'Whiplash' (2014) left me suspended in a void of\ntension and suspense throughout the entirety of the film. This was\nthanks to the intelligent construction and development of Andrew, an\naspiring drum student (Miles Teller) and Fletcher (J. K. Simmons, who\ntook the Academy Award and Golden Globe for best performance by an\nactor in a supporting role), his demanding and overbearing mentor.<br><br>To merely call this film a film would be a mistake. Once the curtains\nclosed, I was left thinking about this masterpiece and the impact it\nhad on me emotionally. When a film can have this impact, transcending\nthe medium of mere visual entertainment to enter the realms of\nemotional enlightenment, that is something special. You know how an\nItalian chef kisses his fingers and says something in Italian that\ntranslates to \"A Masterpiece\" after tasting their own dish? That's how\nI feel about this movie.\n"},
{"review": "\nThere has been a lot reviews and comments on the musical and artistic\nintegrity of the film that I am not qualified to comment on. I can only\ntake it for its face value and go from there as I am not a musician or\na jazz expert.<br><br>This movie has a very simplistic plot and story to tell but the acting,\ndirection and camera work was excellent and really drew me into the\nmovie with superb undertones and mood. Plot wise it's a story about a\nboy with a dream and what he does to achieve that dream with possibly\nno understanding or is possibly being mislead into believing what is\nnecessary to obtain that dream. Truth is probably somewhere in-between.<br><br>The acting is great. The scenes between Andrew and Nicole I felt were\nstiff but the ones between Andrew and Fletcher more than made up for it\nwith raw intensity and tension. I highly recommend this film.\n"},
{"review": "\nthe plot less 'plot' (Spoilers I guess): A psychotic music instructor\nscreams at his student calling him a FAGGOT throwing things at him to\nplay faster and faster (not better mind you) eventually makes the kid\nso nervous he gets in an accident, then the kid plays a corny mid-tempo\njazz number the end. <br><br>There ya go. That's the film. Unreal that this is getting such\nattention, even nominated for an Academy Award. Just goes to show how\nvisceral elements such as cinematography and over-the-top acting can\ntrick people into thinking something more is going on than actually is. <br><br>Final Note: Practice makes the master, having an escaped lunatic\nscreaming in your ear while practicing drums will only prolong your\nattempt to get into 'the zone'.\n"},
{"review": "\nThis movie was a very enjoyable movie! the trailer didn't give the film\njustice however ignore the trailer and watch the film! J.K Simmons was\nabsolutely fantastic but Miles Teller's performance was lacking is\ncharisma. I do believe that his performance wasn't entirely his fault\nand that it was a hard role to play but you don't really notice when\nJ.K Simmons is on screen. The story was much better than I thought it\nwould be. when J.K Simmons was on the screen he stole the whole show\nand I believe that without his performance the film wouldn't have stood\nup with Teller's performance. Overall I believe that the film was\ndefinitely worth a watch\n"},
{"review": "\nI thought I wasn't gonna review anymore movie from 2014. But this\nunexpected class has changed my mind. No doubt it's one of the best\nfilm of the year. And JK Simmons probably has his one hand on Oscar\nalready. Can't really question anything about this films. It's a very\ngood entertainment. One of the few films of 2014 I've honestly enjoyed\nwatching. It's plain, it's clever, it's entertaining. <br><br>It's hard to criticize something this good. But one thing is for sure,\nit's not \"the best\". Whiplash lacks two things. Number one, a real\npurpose in the story. Number two, sufficient subplots. I'm not\ncriticizing anything. I'm just saying it's not up to the same class\nwith the greatest evers.<br><br>Final Verdict: 8.5/10. This is one of those films that not many people\nwill find boring.\n"},
{"review": "\nAn excellent film. J.K. Simmons does an outstanding job as Fletcher.<br><br>The story is well done and acted and is reminiscent of the story line\nof An Officer and a Gentleman.<br><br>The question for me is whether Fletcher is a sadist, or if he is really\nthat passionate about instilling excellence in his students. I think\nthat the truth lies somewhere in between as he could have achieved his\ngoals in a more humane way.<br><br>The language in this film is extreme and may seem shocking and\nunnecessary to some audiences, but it is necessary to convey the\nrealism of the characters. I don't know if life in world class music\nschools is this intense, but I am certain that teachers like Fletcher\ndo exist.<br><br>See it, but don't take the kids.\n"},
{"review": "\nI'm out of words for this masterpiece. If you add also that this is a 3\nmillions budget movie, then i'm more than speechless! Big studios with\nyour endless budget movies, just sit down and take notes! You don't\nneed nothing more than an inspiring scenario, great acting and huge\nlove for cinema to succeed! Exactly what Whiplash is. The story is\nengaging and inspiring, the direction is superb and the actors are over\nthe edge with their acting! In my opinion, a \"great movie\" needs\n-except other things- to motivate you. To inspire you. To be better in\nyour life, in your dreams, in anything has to do with your world. To\nthink more spherical. To be better, in any form \"better\" can come. If\nyou're not inspired when this movie finish, then, there's something\nwrong with you. - Academy, give them the Oscar already. This is all i\nhave to say.\n"},
{"review": "\nBreathtaking, intense and exciting are all words to the describe the\nrecent whiplash. A movie about what it takes to become the best is a\nmasterclass of storytelling and a REVELATION on editing. The editing in\nthis movie during the music scenes is flashy and it works extremely\nwell. This allows the movie to extremely exciting to the point where\nyou feel like standing up.<br><br>Miles Teller does his job and JK Simmons steals it. His character had\nmultiple layers and on re watches you can really see how despicable he\nis, even though it doesn't explicitly show us.<br><br>The soundtrack is enough to get any common citizen into jazz, it's that\ncatchy and great. The technical level that went into this movie are\ngreat and it's rare to see a movie like this where everyone did their\nbest and they created a masterpiece.\n"},
{"review": "\nThis modern masterpiece has earned it's place among the greats, with a\nperfect cast and an even more perfect crescendo of tension. This is the\nway story telling should be done, not with one dimensional characters\nor feuds driven by murder but real emotions like jealousy, pride and\nrespect. It is refreshingly original to walk through a characters\nexperiences of hate and disdain, only to arrive at the same feeling of\nvalidation and respect at the end of the film, making Whiplash a truly\ncathartic experience. rightfully referred to as a thriller because it\ndraws on the excitement of the mundane modern life and puts the\naudience through an emotional roller-coaster that is heightened by the\nuse of sound and lighting that creates this visually aesthetic\nmasterpiece.\n"},
{"review": "\nThis review is completely and absolutely personal and I understand that\nmany may not agree, but I was recommended this film by a close friend\nand thought it would definitely not be for me, but I was very impressed\nwith the story line and how engaged in it I felt throughout the film. I\ncouldn't take my eyes off the screen and found myself being hooked. I\nabsolutely loved the film and actors, and I love that there is a\nmessage being passed on here. As unlikable as the teacher is, I loved\nthe perseverance of the student and the fact that he did not give up on\nhis dream until he succeeded. I admire his passion and love for what he\ndoes and find this extremely inspiring. At times I completely forgot\nthat this was just a fictional story and found myself suffering with\nhim. Extremely impressed and will never not recommend.\n"},
{"review": "\nI'm going to keep this review short and sweet ...<br><br>WHIPLASH takes us into the life of Andrew (Miles Teller), who is a\nyoung promising drummer who wants to be great. Now Fletcher (J.K.\nSimmons) has a unique way of teaching his students. He breaks them down\nand hopes that they will rise above his abuse and become great.\nFletcher also has the best line in the film: \"There are no two words in\nthe English language more harmful than 'good job'.\" This line is what I\nlive by and what people who want to be great should believe in.<br><br>After the screen goes black and the credits begin to roll I am left\nwanting more! That's what I great movie should make you feel. I hate\nwriting reviews because I do believe movie opinions vary for every\nperson, but this is my all-time favorite movie and I believe you should\ngive it a shot! In my opinion it should have won Best-Picture over\nBirdman!\n"},
{"review": "\nIf you are drummer or musician, you must see this movie! Even if you\ndon't know much about drumming or Jazz music but Whiplash is still a\nthrill to watch.<br><br>How far are you willing to push yourself to succeed? How far are you\nwilling to push someone else to force them on the path to success?<br><br>Those is the question that we will find out the answer after watched\nthis movie.<br><br>This movie is very good to inspire people for never give up. The way to\nsucceed in something is not easy at all We might think we already tried\nour best and it was reach our limit but actually not. We can across\nover the limit with some way that need some factors to push us so dam\nhard.\n"},
{"review": "\nOkay, maybe I am slightly biased, being a fan of this style of music,\nbut my God was it well executed. JK Simmons gave quite possibly the\nmost intense performance of the year, and in almost all of his scenes I\nwas watching him, not as an actor, but as his character. He was utterly\nconvincing and in many ways stole the show away from Miles Teller, not\nto say Teller was bad at all, but that Simmons was just better.<br><br>However, there are a few scenes in the film that make it drag\nsubstantially, compared to other very well made scenes. One scene in\nparticular (spoilers ahead) where Teller and his family have a dinner\ntogether felt slightly cliché. I won't spoil too much in the hopes that\nyou'll see why yourself; but the film lagged a tad here.<br><br>Other than that, no complaints. The sound mixing was phenomenal, the\nacting was great, the pacing was good. Overall, it was an outstanding\nfilm\n"}
]