[
{"review": "\nI loved the first part. It was fun. So, naturally my expectations for\nthe second movie was high. That, and a metascore of 88 on the first\nday, naturally, I expected a masterpiece. But what i saw was just\nawful. <br><br>The first few scenes have no dialogues, it's all sign language, with a\nbit of monkey sound here and there(60% of the film, actually). That\nputs you to sleep right away. There are no awe inspiring scenes, not\none frame of amazing graphics. The \"emotions\", well, didn't work for\nme.<br><br>Story? Okay. Humans want to repair a dam nearby so that they can get\nelectricity, Caesar allows them to work, and asks other monkeys to\nhelp. Meanwhile, mean monkey Koba goes to Human place and sees a bunch\nof weapons. So, it comes back, attempts to kill Caesar and then starts\na war with the humans. Climax? Meh.<br><br>Sincere advice, don't watch this. Franco and the cute little monkey, in\nthe first part entertained me. This one put me to sleep.\n"},
{"review": "\nI think I just watched an Old Testament epic from the 1950s - so\nearnest and plodding with high ideals and dull dialogue.<br><br>The only interesting character in the film was Coba, when he acted the\nfool in the armory. The rest were just family-values people trying to\nbe good. The lead actor was dull, and why was Oldman cast as a military\ncommander with his squeaky voice - it actually broke like a teenager's\nwhen he was giving commands.<br><br>So much of it was predictable, and you just knew it was going to end\nwith a punch up. Almost gave up half way through.<br><br>I really don't want to say much more. Totally inferior to Rise and a\ngreat disappointment.\n"},
{"review": "\nI love Christopher Nolan, He has simply changed the way\nsuperhuman,extraordinary thrillers are made. Now everyone is just\nfollowing him. Most of the Directors are trying to show the dark and\nmore realistic environment in the movies and MATT REEVES succeeded in\nit.<br><br>It is a extremely well-made and enacted movie. What works is the\nintensity of the characters. Caesar is the character taken straight out\nof the last installment, Rise of the Planet of the apes. He is the\nbrains and the brass together. The movie is entertaining and includes a\nsurprising ending.<br><br>The film has got some amazing graphics. The Apes look real and in every\nway you sympathize with them. I would rate it 9 out of 10 just for\ngraphics,acting and the intensity of the film.<br><br>DO WATCH !!\n"},
{"review": "\nThis film is fun and exciting the whole way through. I'm not gonna lie,\nI was skeptical of this film going in, but just like guardians of the\nGalaxy the way this film makes you feel for the animals is incredible.\nAlthough there is some fantastic acting (thank you Gary old man), it is\nthe animals that you feel for the most. Although this film didn't sweep\nthe Oscars, in 10 years looking back, 'Apes' will be a film to\nremember. If you enjoyed this review, be sure to check out my YouTube\nchannel Quinn C (the one with the James Bond emblem). I review films\nold and new, as well as take in depth looks at the James Bond series.\nIf you like film at all, in particular James Bond, please be sure to\ncheck me out on Quinn C (with the James Blnd emblem) on YouTube. Thanks\n"},
{"review": "\nAfter 'Rise Of The Planet Of The Apes', I wasn't all that interested to\neven see this film. I didn't mind Rise, but to me it was no better than\na 6 out of 10; It was nothing special. With all the good reviews and\npeople raving about this film however, I thought well I'll give this\nfranchise another shot, and boy was it worth it. This film is far\nsuperior to Rise in my view. There are a few parts that could have been\ndone better here; But mainly this film is very solid writing wise and\nvery entertaining. The film develops it's characters, especially many\nof the apes far better than most action films these days as well. The\nlead up to war here is done extremely well for the most part. To me\nthis film is one of the great surprises of the year. 7.5/10\n"},
{"review": "\nThis movie is among the most predictable movies of all times. You could\nsimply predict what is going to happen in every scene right from the\nvery beginning to the end of the movie.<br><br>I wonder who wrote this crappy story. The writer lacks any form of\ninnovation, originality or freshness. When the human crew are first\nintroduced, you right away know what would happen to each of them. Some\nof the things that were gona happen were so obvious that i was saying\nin my head please God, please it shouldn't be that. But the obvious\nhappened nonetheless.<br><br>I thought this was also supposed to be a thriller, but there isn't any\nthrill here. I mean what's the point of watching a movie without\nsuspense or with spoilers.<br><br>A little advice please stay away from this unless you like\nuninteresting, predictable and boring plots.\n"},
{"review": "\nThis movie started with logic flaws, so I did not expect much from it,\nand that it delivered. You can really tell a bad movie from the\nbeginning. They needed a dam to power up a radio emitter, even though\nthey had diesel generators. And from the 1000+ people from the human\nsettlement, for the second expedition they chose the same driver who\nkilled the first ape to begin with. How stupid is that? How UNREALISTIC\nis that. And the rest was just simple, predictable monkey-logic to\nfollow. Did You see the trailer? You saw it all. Don't start watching\nthis if the fast forward button is not in Your hand. Watch the others\nmovies of the series. They are so much better. And they are from a kind\nof storytelling universe where this movie does not belong to.\n"},
{"review": "\nDo not waste your time watching this. One of the worst movies I've ever\nseen. If I didn't have to write ten lines to give you this warning it\nwould be done. The CGI was mildly interesting but the story was\npathetic. If you want a good apes dose watch the Chuck Heston version!\nWhat a waste of money goes into this CGI dribble. I wonder what's going\non in Hollywood. I love movies but it seems that most movies are\nremakes of the stuff I grew up with in the 70's and 80's. Where is the\ncreativity? Obviously if these remakes generate revenue..you have a\nfairly simple formula to make cash... go with what was popular and cast\ntrendy stars. The world is full of creative people. Take risks and\ninvest in the hungry artists! The current state of affairs falls far\nshort of true representation of the artistic and creative talent that\nis everywhere else around us in this privileged world. Wake up\nHollywood!!\n"},
{"review": "\nI was shocked at how bad this was. <br><br>A rating of 8 does nothing for this sites credibility.<br><br>I wanted to enjoy this but I was quickly alienated by its sheer\nstupidly. <br><br>I was particularly impressed with the way the humans left their entire\narsenal guarded by just two idiot drunks. <br><br>There are so many jarring \"what the hell\" moments to mention.<br><br>I couldn't bring myself to sit through the whole film. This is pretty\nunusual for me.<br><br>Yes, this is my first review, inspired by this films high rating and\nhow bad it actually was. <br><br>Please don't waste your time.\n"},
{"review": "\nWhat a Crock! Film makers should be forced (at a minimum) to refund\nviewers their ticket money. Special effects and CGI are not enough to\ncompensate for a horrible interpretation of the story-line, and even\nworse \"acting\".<br><br>Both species, Human, and Ape, speak and behave the same. They don't\nportray any cultural differences. They both sound and behave like brain\nwashed Americans. Even \"Unevolved\" apes would be able to do better than\nthat.<br><br>One can only suspend reality up to a point, and this film goes way\nbeyond that point, you'd need to be completely brain dead to appreciate\nthis tripe.<br><br>Well, that's a couple of hours of my life I'll never get back.\n"},
{"review": "\nGet ready for two hours of second hand embarrassment, everything about\nthis movie is just silly. I know that one is expecting a dose of\njuvenile Hollywood bullshit when choosing this kind of movie, but this\none is of the charts, i mean, i was alone when watching this \"thing\"\nand i still felt embarrassed almost all of the time. There are children\ncartoons that have more mature dialogs and better thought-out\nstoryline. The Ape humanization is an avalanche of, once again,\nsilliness. At one point my thoughts kept pushing me to reexamine my\nlife, i'm not kidding, near the end of the movie, i was repeatedly\nasking myself what was i doing wasting time with this crap. Good luck\nand happy sessions.\n"},
{"review": "\nWhen directors use CGI on their movies and looks like crap they should\ntake a note from this film because this film has the most real special\neffects ever. Andy Serkis is freaking amazing in this movie i mean he\nwas amazing in LOTR and the Hobbit Series and he's amazing in this one\ntoo such an underrated actor. Jason Clarke is also great in this film\nand he's another underrated actor and Toby Kebbell as Koba is another\ngreat thing into this movie too bad that he had to play Dr. Doom in the\nFantastic 4 reboot one year after this movie. Overall Dawn of the\nPlanet of the Apes is an amazing visual film with a great supporting\ncast, idea and an amazing direction and is better than the first film.\nI give it a 10 out of 10.\n"},
{"review": "\nThat's all I can say this movie was fantastic I think it was better\nthan rise because I loved this movie it was great it had amazing visual\neffects great characters and everything is really good I adore this\nmovie well yup. This is definitely a great blockbuster movie of 2014\nand I agree that is the best sumer movie of 2014 I don't understand\nwhat's with the negative reviews in IMDb calling it yawn of the planet\nof the apes it's not hiring or long it was great and this is probably\nthe best movie of 2014 along with captain America 2 the winter soldier\nI loved this movie I thought it was suprsie good and really great.<br><br>MASTERPIECE Go watch this masterpiece right now\n"},
{"review": "\nLet's face it. Technology is amazing. Nowhere is this exemplified more\nthen in Rise/Dawn of the Planet of the Apes. These films use state of\nthe art motion capture tech to make Apes characters. Caesar has grown\nup since the last film. He is now a leader. Some of the old cast of\nApes return. The Apes believe that Humans are wiped out. When Humans\nand Apes meet there is a moment of confusion and conflict. As the\nconflict escalates the dark sides of the characters are revealed. Andy\nSerkis leads a parade of excellent performances as Caesar. Toby Kebbel\ndoes an admirable job as main ape villain Koba. Gary Oldman is a little\ntoo anti-Ape as Dreyfuss. Jason Clarke is soulful as Human scientist\nMalcom. Keri Russell and Kodi Smit-McPhee are underused in what could\nhave been pivotal roles. Overall and excellent action packed film with\nsoulful characters and amazing world building. Thank you for reading,\ngood bye.\n"},
{"review": "\nI have to agree with many of the 1 star reviews, this is totally far\nfetched, totally predictable and quite cheesy in places.<br><br>BUT - I loved watching it. CGI is awesome, the storyline is pretty good\nwith a definite beginning, meaty middle and (predictable but\nsatisfying)ending.<br><br>Did I mention the CGI is good, wow - really good - most of the time it\nfelt like I was watching real apes!<br><br>Loads of tense / exciting scenes - e.g. the bit where Koba tricks the\nhumans to get their gun - really well done.<br><br>This is what a blockbuster should be like - entertaining (unlike that\ncrappy Godzilla I watched recently)!<br><br>I am currently compiling a list of movies I can't wait to watch with my\nSciFi loving son when he is old enough - and this is definitely on that\nlist.\n"},
{"review": "\nI have always been a huge fan of the Planet of the apes franchise and\nit is my belief that this movie ticks all boxes and could be admired by\neveryone. This movie is the perfect sequel to Rise of the planet of the\napes. It believe the story is great as it takes us away nicely from\nRise of the planet of the apes and leaves us on a cliff edge, eagerly\nanticipating the third of the trilogy 'War of the planet of the apes\"\nset for release in 2017. I found the movie gripping and i often delved\ninto a range of different human emotions which I found fascinating as\nthe movie depicts apes with advanced intelligence reminding me how\nclose of a sub species we are to apes. The role of Caesar is\nwonderfully played by Andy Serkis also know for playing the role of\nGolem from Lord of the rings. He obviously put a lot of effort and\nhomework into this role. With a brilliant, captivating story line,\ngreat special effects and CGI this movie is a must see.\n"},
{"review": "\nEver since I heard that a sequel to Rise of the Planet of the Apes was\nconfirmed. I officially waited for the sequel. The best apocalypse film\nmade. <br><br>It takes place ten years after the event of rise and Caesar is\nofficially the new Alpha Ape of the Ape Colony. It shows his great\nleadership and his bond with his son. It shows a surviving human colony\ntoo who struggle to survive until their power goes out. A troop goes\nabout and begs Caesar if they could stay and build fix the generator,\nmeanwhile the Rise of the Ape Tyrant Koba is taking place. It shows how\nthe slavery and oppression of humans began in the Planet of the Apes\nfranchise and from there, the war between Ape and Man begins. <br><br>The ending is just the beginning... of World War III. The Ape/Man War.<br><br>Totally worth watching!!!\n"},
{"review": "\nI am not someone who went to there before this movie ... most of the\nmovies were seen when they premiered on TV .... but the poster really\nintrigued me and my hubby was surprised when I asked ... can we go to\nthe there to watch this!!! I must say I absolutely cherished the movie\nand loved every minute of it ... except for a few glitches ... it was a\ngood movie ... The effects were good and I did not have the heart to\nleave the there when the movie was over ... waiting for the sequel and\nneedless to say, will go to the there for it ... though the movie\npromotes violence and how men kill other species and torment them in\ntheir quest ... it also shows their vulnerability and how they do it\nout of fear too! Though this isn't going to change the way we are ..\nrefreshing to see a movie with changes!!\n"},
{"review": "\nIf there is a must see movie of the summer, it is surely Dawn of the\nPlanet of the Apes. It was simply an amazing movie full of sentiment,\nfamily unity/trust, and the many hardships that basic survival can\narise. In Caesar, you have a complex being full of depth who simply\nwants to exist in peace and provide for his loved ones and community.\nBut as history has shown, life is often one tragic story full of\nviolence, deception, and sorrow. Yet hope, if truly sought and fought\nfor, can also exists behind all that shadow and horror. As Caesar so\nprofoundly put it \"ape started war, but human don't forget\" and these\nwords could not be any more valid, especially during these dark times.\nWith all their complexities, humans still do remain the most violent\nand treacherous of beasts. Go see DoTPoTA. You will not regret it.\n"},
{"review": "\nTruly amazing film! I haven't seen the first one but after going to see\nthis I will definitely be watching the first one now! I was on the edge\nof my seat the entire film, I even felt really emotionally attached to\nthe apes, especially Caesar! Having read other reviews calling this\nmovie predictable and boring has made me question the users taste in\nfilms. I'm not sure whether this a spoiler but although there is a lot\nof fighting in this film it doesn't matter because all the fight scenes\nare created so well! It has you gripped to the screen and hanging on\nevery word the actors say. I admit when my Mam asked me if I wanted to\ngo to the cinema and see this I was a bit reluctant. I've never seen\nthe first one the whole way through but I have seen parts of it,\nhowever I walked out of the room a bit bored by it all, so when I sat\ndown ready to watch the second one I was expecting to feel the same\nway; bored. But I totally felt the opposite! Would recommend this film\nto anyone.\n"},
{"review": "\nI thoroughly recommend watching this film. I watched it on I sense,\nwhich has enhanced Audio and a larger screen in 3D and it really blew\nme away. The Cgi was immense, as was the story line. Really appreciated\nthe way that the film questions your loyalty to the human race, and\nplays on your emotion in this way. Ceasar was played very well. I\npersonally rate this film higher than the batman movies, as I feel it\nhad more strings to its bow. All the action, as well as great visuals,\nand deep meaning! Instant classic, will be watching again!I would\nrecommend watching the first film prior to this, as it helps you\nremember key moments that tie very well to this film. I watched them\nback to back and was not disappointed!\n"},
{"review": "\nThis movie didn't \"transcend\" anything for me. I can't stand when\nmovies make people seem dumb. It's not that they just did unintelligent\nthings. The script: \"...spare me the hippie-dippy sh**...\" Yeah talking\nabout virology is hippie-dippy. The plot was full of holes, the script\nidiotic, even the sets were unbelievable. When I think of how good the\noriginal Planet of the Apes movies are it makes me want to cry. The\npeople did such dumb things like just standing there with their mouth\nagape when the apes come to speak to them; if you haven't been able to\ncontact anyone by radio in ten years why is it an emergency now; why\nwouldn't you move the arms to where you are living; why wouldn't you\nuse solar, wind, or even bicycle power. It seems like they built this\nmovie around a couple of key scenes and let the rest of it rot. Not a\nfan.\n"},
{"review": "\nGeetings from Lithuania.<br><br>\"Dawn of the Planet of the Apes\" (2014) is a hands down one of the best\nsequels ever. This movie has everything to keep you entertained for 2\nhors from start till finish. Good acting, superb storyline, great\nsettings, amazing special effects - it's all there and it all clicks. I\nwas a huge fan of \"Rise of the Planet of the Apes\", and \"Dawn of the\nPlanet of the Apes\" was perfect follow up, it's bigger and better in\nevery possible way. The best moments in this movie are the one without\naction actually, it's when apes (especialy Caesar) and people starts to\ncommunicate. And for Andy Serkis, give this man an Oscar for god sake,\nwe all know he deserves it.<br><br>Overall, if you still haven't see \"Dawn of the Planet of the Apes\" then\ndo yourself a favor and see it ASAP, if you liked the first one, this\none will blow you away.\n"},
{"review": "\nDawn of the Planet of the Apes is a sequel that does what sequels are\nsuppose to do but rarely do and that is surpass the original in every\nway while expanding the story. The film opens 10 years after the first.\nIt's a master class in story telling the film pacing is spot on with\ntensions that sway back and forth with concern for the humans and the\napes. With a somber mood throughout its never without hope and its that\nhope that keeps things from being a monotone affair. The film is great\npure and simply, well crafted with amazing effects and performances.\nSpeaking performances before I finish I have to say the standout is\nAndy Serkis. The 10 years of struggle for Caesar as a leader and father\nis filter so clearly through Andy's performance and not just the \"make\nup\". Come the awards season, give Andy Serkis an award already!\n"},
{"review": "\n*Possible Spoilers* I enjoyed the first one, and expected this sequel\nto be a story about the rise (or dawn whatever) of the apes to global\npower, as the dominant species on the planet, with the humans\nstruggling to find ways to recover control from an intelligent ape\nsociety. Well, maybe they'll get to that in the next one, because this\nwas more about a relatively small group of smart apes, living in\nsolitude for a decade, who soon discover humans still exist, and must\ndecide how to get along with them (if possible), in a remote part of a\nworn down san francisco. Unlike the first movie, the events that take\nplace probably wouldn't effect the world very much, and ultimately\nseem...well rather insignificant. Don't let this take away from the\nfact that this is still an entertaining movie, and well worth the\nwatch. 7/10\n"},
{"review": "\nThis film is not just the best film of the summer, it's probably so far\nthe best movie of the year! <br><br>These are the exact reasons why this film is great: <br><br>1.Amazing visual effects <br><br>2.Great storyline<br><br>3.Awesome action (Apes on horses, apes with shotguns) <br><br>4.Great acting <br><br>5.Andy Serkis is probably the best motion capture actor ever. <br><br>Overall the movie was just spectacular. My advice: don't expect\nanything when you go into this film. It is without a doubt the best\nentry in the planet of the apes franchise. Another thing about the\nspecial effects in the film, in Rise of the Planet of The Apes although\nthat film had great special effects, there were some parts that you\ncould tell were CGI while in Dawn, you couldn't tell if it was motion\ncapture or CGI puppets. You literally feel like you are looking at\napes. Anyways, the story is great, it had some awesome action, this\nfilm didn't disappoint me at all. <br><br>So I will say that Dawn of The Planet of the Apes gets: 10/10 stars\n"},
{"review": "\nDawn of the Planet of the Apes takes place 10 years after the previous\nfilm Rise of the Planet of the Apes. Man has been decimated by a virus\nand the Apes have grown in strength. <br><br>You do have to suspend your belief at times as the plot is pretty lazy\nto be honest especially concerning the predicament Man finds himself\nin. The acting isn't great either, Gary Oldman's character is\nunbelievable and the rest of the human cast though not awful are merely\nOK. On the plus side this movie is visually very impressive and the CGI\nis brilliant. <br><br>For all the flaws in the plot the film roars along at a great pace and\nis full of impressive set pieces which leaves you little time to get\nbored. <br><br>I did enjoy this film but probably not as much as the first which had\nboth superior acting and a better story line. However this is still a\nvery entertaining film and well worth watching if you enjoyed the\nfirst.\n"},
{"review": "\nThis was a good film and I really enjoyed it but to me it wasn't as\ngood as the first one. This one was light on the action and focused\nmore on drama with conflicts igniting within the human world as well as\nthe ape world. Basically it was about united we stand, divided we fall,\nfor both sides. With that in mind I think the more advanced the apes\nget in the films the more like humans they become, and not in a good\nway and I think that is what Ceasar, the leader of the apes, is going\nto start realizing. I think this film is just setting the stage for a\nthird installment of the new \"Planet of the Apes\" motif anyway. So if\nthere is another installment of the \"Planet of the Apes\" theme,\nhopefully there will be lots of action in it, but like I said before,\nthis is a good film it just wasn't as exhilarating as the first.\n"},
{"review": "\nI wish this movie didn't take so long for something to happen. I was\nhalfway through before it started to get interesting. I wanted action\nnot a heartfelt gorilla in the mist storyline. The special effects were\nabsolutely magnificent though and their surrounds were so imaginative. <br><br>What's scarier than the animal kingdom, or specifically our ancestors\nrising up in a war between the species. Probably a lot of things but I\nstill found it quite frightening. I think the scariest thing for me was\nthat the apes began to take on bad human traits. Committing acts for\nsurvival is greatly different from seeking power and revenge. I'm used\nto it with humans but I expect better from animals.<br><br>The one thing I can't get my head around is even after a decade of\nliving in a post apocalyptic wasteland the humans still had a plentiful\nsupply of automatic weapons and ammo. The only thing guns are good for\nis conflict and it's pretty weak for the creators to rely solely on\nthem to instil fear.<br><br>Overall the movie really could have been better.\n"},
{"review": "\nJust when i thought that Rise of the Planet of the Apes laid the\ngroundwork for the reboot of the franchise, Dawn of the Planet of the\nApes moved the boundaries.<br><br>In this movie a good measure of James Bond and Rambo are mixed into the\nPlanet of the Apes universe in order to make it more of an action\nthriller. This mixture proved to be successful at the box office and at\nthe same time made this movie indiscernible from any other contemporary\naction movie.<br><br>There are some very nice moments within the apes' community, but they\nget squandered with the aforementioned mixture.<br><br>So, if you're looking for a \"different\" action movie, you've found what\nyou've been looking for. Otherwise go for Tim Burton's 2001 movie if\nyou wish to see the best of the Planet of the Apes universe.\n"},
{"review": "\nWhat a movie.After watching it i was fully blown away.This is what an\nintelligent post-apocalyptic sci- fi should be.The plot was not very\ngood but is was executed very nicely.But i must say that it was too\npredictable.Still i enjoyed it and felt emotionally attached with the\nstory.Emotional scenes were poignant.If a little more attention had\nbeen paid on the script then it would have gained an instant classic\nstatus.In acting department everybody was OK.The characters of the\nmovie hadn't been developed nicely.The plot also contained some\nloopholes but they can be forgived as the screenplay is very crisp and\nsmooth.Special effects were mindblowing.It could be nominated in Oscars\nfor best special effects.Music was just OK.Nowadays many movies are\ncoming which relies heavily on CGI and has no or very little story.But\nthis movie manages to separate himself from this league by its powerful\nstorytelling,grand visuals and an interesting premise.Overall it was a\ngreat watch... RATING : 7.8 out of 10\n"},
{"review": "\nAs the final credits began to roll I realized how captivated I was from\npossibly one of my favorite films of all time. Suspenseful at nearly\nevery turn and a very unpredictable plot that looks like its going one\nway but makes a miraculous turn of events that creates a truly\nenthralling ride. <br><br>From apes on horses to motion capture at it's absolute best. Gary\nOldman is excellent as usual with an absolutely phenomenal motion\ncapture performance from not just Andy Serkis but from literally\neveryone.<br><br>The only issue is that there is not enough James Franco but that's an\nissue that can be sidestepped for now as this film sets up what looks\nto be a thrilling climax to what has been a fantastic series so far\nwhat's best is I still don't know the path the sequel will take but\nfrom the ending that left me stargazed to the end of the end credits I\ncan just about be sure.<br><br>Rating: A+ Comment: Every world leader needs to watch this film to\nteach them what true leadership is about.\n"},
{"review": "\nDull.<br><br>Starts interestingly enough: apes have taken over the world, but\ndiscover a group of humans still survive, holed up in a city. Peace\ntalks start and are agreed upon and, after some initial trepidation on\nboth sides, things are going well until...<br><br>That's when things unravel. The plot wasn't entirely watertight until\nthen, and it gets worse, and more contrived after that.<br><br>Cue action scenes, shoot-outs between apes and humans, yadda yadda.<br><br>The performances don't help. Jason Clarke is okay in the lead (human)\nrole but Gary Oldman deserves better and, from his listless\nperformance, seems like he thinks so himself. Keri Russell is\nirritating. Supporting cast are so-so.<br><br>It would be tolerable if it were short and sharp. Instead we have a\nlong drawn out movie, complete with empty sentimentality and\nunnecessary detours. Moreover, with the apes as mostly the heroes and\nthe humans as the villains, it all feels like greenie propaganda.\n"},
{"review": "\nIn that image we have \"Rise of the Planet of the Apes\" as Messi and\n\"Dawn of the Planet of the Apes\" as Torres. Now, Torres is a an awesome\nstriker, but he's famous with frustrating misses and Matt Reeves is\nimitating him with this film. Don't get me wrong, \"Dawn\" is a great\nmovie. Andy Serkis keeps pushing the limit on what a human face can do\nand he appears to be the one who uses it best. We're a total waste of\nfaces guys :)<br><br>We also have the emotional depth of multiple apes and not just one like\nin \"Rise\". The human side of the conflict is also very good with great\nperformances from Jason Clarke and Gary Oldman.<br><br>However, the story and plot are old and not original at all like it was\nwith \"Rise\" and the technology, while it carries serious advancement,\nbut I don't feel like it was used to its full potential, especially the\n3D, which we could've totally done without.<br><br>My video review for the movie in Arabic can be watched here:\nhttps://www.youtube.com/watch? v=sSt5M9Pxf6A\n"},
{"review": "\nto be honest i went to see this movie with high expectations thinking\nthis might be a true masterpiece and one of the best movies of my life\n, i was wrong<br><br>even though the movie was entertaining i can't say it didn't had those\nunnecessarily dull moments also the movie was soo clichéd in some\nscenes the end of koba for example , the story and the CGI might be the\nonly things kept me watching the movie but listen<br><br>if 1 : you are watching this as if your about to watch a masterpiece\nand sci fi classic you are seeing the wrong movie<br><br>2 : loved the classic planet of the apes and this movie previous\ninstallment this movie is perfect for you<br><br>3 : want a popcorn flick , not a good movie but you might like it it\nhad a decent action sequences at the end<br><br>overall : the movie was entertaining visually stunning with thrilling\nstory but dull and overrated\n"},
{"review": "\nGot to watch this,Only if They could talk APES It would be awesome,Just\nmakes me want to cover me back with a APE TATTOO 10/10 Hopefully the\nnext 1 Isn't far of ,Like how they done scenery to ,The way its\ncreated.Just think their might be a planet in our solarsystem that has\nApe as a colony.They look awesome on the horses.The hole movie has to\nbe watched,Best way to watch it is surround sound ,Have it full boar so\nif sound hits ya body,Plus watch it at night ,Turn ya phone of lock the\ndoor ,turn all the lights out.Get ya drinks feed what ever,Enjoy\nsitting their glued to it,Nothing better than a good movie ,Plus have a\nnice lady sitting wid ya ,Then Ya can cuddle up to her whilst\nwatching,Don't have to say anymore, Watch it you will realtruth.\n"},
{"review": "\nI really liked the movie. I have to say though that most of it was\npredictable. Unlike the other movie, this one has some moments when I\npredicted what would happen. The action scenes are awesome, but what\nsurprised me the most was the sound editing. The apes' screaming and\nthe shooting from the guns were pretty intense. It made me feel as if i\nwere part of the movie. Caesar is my favorite ever, yet Koba made me\nfeel terrified and curious. I loved him. The story itself is\ninteresting enough to make me love it, and the characters are very\nappealing. It also made me think of something said in the movie: \"we\nare not that different to them\". At the end, we all have trust issues,\nand it doesn't matter who or what you are because that doesn't define\nif you're good or bad but the decisions you make <br><br>I'll be waiting for the next installment. Keep it up. :)\n"},
{"review": "\nI must say, I enjoyed this movie. It is impressive to see a world full\nof cgi environments and cgi animals, almost as good as the real thing.\nTo enjoy this story you will have to accept the premise that apes get\nintelligent, and to also see the developments of struggle for power\nbehind the back of the protagonist. Just like humans, isn't it.\nHowever, the story does not go anywhere. I mean, we know how it starts,\nit is explained in \"Rise of the Planet of the Apes\" and we know how it\nends as explained in \"Planet of the Apes\", so this should be an\nintermediate part of the saga. But the only thing we learn is what we\nalready learned from the previous film, which is that humans and apes\ndon't get along. In the final film of the saga it is shown that humans\nget to be submissive, tamed and exploited by the apes, but this\ntransition is not yet made in this movie. That's a missed opportunity,\nI think. It could have added some spice to the plot.\n"},
{"review": "\nDotPotA is an enjoyable film, with excellent visual effects.\nUnfortunately, the story is hackneyed, predictable and frankly tedious,\nwith an enormous number of holes and rampant stupidity on all sides,\nwhich detracts from any impact it may have had.<br><br>Quite apart from the hammer-to-the-head morality and message, there\nisn't really anything to keep a viewer's attention, besides the action\nsequences. The characters aren't very interesting (though the actors\nplay them very well), the apes are stunningly rendered but equally\nstunningly one-dimensional in personality, the story is so predictable\nas to be laughable and, in the end, it turns into a tension-free,\nsuspense-free, popcorn-munching wait until the violence starts (and\nends, since there's no real interest or depth there, either).<br><br>Very, very disappointing, especially given all the hype and hope for a\ngreat continuation of the series. Popcorn fodder, little else.\n"},
{"review": "\nJust another sequel along the way. The sad thing is this movie had all\nthe potential for a great movie. The previous movie set up a nice story\nline. But instead of following that trail all they have done is another\none of the usual rip off kinda flick. The same old invasion by humans,\nsame old betrayal among the natives, same old lone supporter for the\nminority and Deja Vu of avatar all over again.<br><br>My opinion is if you are into the kind of movies with intelligent and\ntalking animals, go ahead and watch it But you want to watch a movie\nwith a decent plot line or at least if you want a decent sequel this is\nnot for you guys.<br><br>May be it's that something wrong with my taste in movies or may be that\ni had too much expectations. But i asked around my friends and none of\nthem seem to prefer this over the previous one.<br><br>Another summer flick for the children and popcorn lovers.\n"},
{"review": "\nTedious and juvenile... I could hardly wait for the predictable ending.\nI liked watching the credits more than the film itself.<br><br>The acting was stiff.... you might say .. robotic. The plot was\nunbearably predictable. The writing was one cliché piled on another.\nThere was over reliance on cartoonish action scenes.<br><br>I loved the very first Planet of the Apes.. over 40 years ago. It had\nboth social and psychological reveals. How ape-like human society is..\nand how humanity has failed. The present film series coat-tails on the\npopularity and success of the first one. This film has no new reveals\nor insights except for shallow clichés.<br><br>Some of the poorly expressed themes. There are good apes and bad apes,\nthere are good humans and bad ones. Teens often rebel and then grow to\nsee the wisdom of parents. Brains vs brawn .. sometimes one wins,\nsometimes the other.<br><br>Poor acting, poor plot, poor writing... that's OK.. lets blow something\nup.\n"},
{"review": "\nHands down this is the best movie of 2014. It has everything I look for\nin a movie, I hits on the human condition on so many different levels\nand evokes emotion throughout. This movie had me on the edge of my seat\nanticipating every next move. Haven't been so impressed by a movie in a\nwhile. This sequel does a perfect job at telling its own story,\nconnecting to the past and leading to a future film, that I cannot wait\nto see. As far as the effects go the apes are so realistic and the plot\ntruly shows what I truly believe would be a post apocalyptic San\nFrancisco. This is a story of the human race that shows what we all\nhold most dear, security and family are the cores of humanity and this\nmovie depicts that better than I have seen before. <br><br>Do yourself a favor and go see this ASAP.\n"},
{"review": "\nMatt Reeves is an amazing director. Great eye for everything within his\nfilms, and his editing is spot on. A director I wish we saw more films\nfrom. He's terrific. This is an action film with some actual substance,\nit's an actual movie with emotions and feelings. You care about the\ncharacters. It's not just every other action film out there which is a\nmass produced fast food product. This film and The Batman- Dark Knight\nSeries by Christopher Nolan are the only action films that are really\ngreat. Every other action film out there pretty much is pure garbage,\npure fast food. <br><br>Andy Serkis is so good too. I would love to see him in a role without\nhis prosthetic make-up or without him doing a voice over that shows his\ntrue talents. Any film I ever see with Andy Serkis where he's just Andy\nSerkis in the flesh never really shows his true talents such as films\nlike this one or Lord of the Rings. It's kind of shame, he's a great\nactor. <br><br>This is a great movie and one should absolutely see this one, you won't\nbe disappointed.\n"},
{"review": "\nI suppose it was not a complete waste of time. A lot of the images are\namazing, even if some it looked too much like a video game. But CGI is\nruining movies. (And photography in general) How can we ever believe\nphotographic evidence in a court case, for instance? As I had expected\nthis film was a racial allegory, and we were apparently supposed to be\nrooting for the apes. Although the filmmakers did at least add some\ncomplexity, making some of the apes, as well as the humans, venal and\npower-hungry. The acting performances of the human characters were\nadequate but nothing special. As for the apes, you can't really say\nmuch with the actors so covered up. The plot sinks through massive\nholes. For example, weapons in armories are not stored loaded, and\npeople, much less intelligent animals, who are unfamiliar with guns\nwill never figure out how to load them. Cannot recommend this film.\n"},
{"review": "\nI wasn't really familiar with the whole 'Planet of the Apes' franchise.\nThis was my first entry, and it wasn't as disappointing as I feared.\nThough it took me about 30 minutes before I 'believed' the CGI graphics\n(something I did not experience with Avatar, or even Jurassic Park back\nin the day), I admired the ethical and moral questions the movie brings\nup. Without giving away spoilers, the story can easily be seen as a\nmetaphor for certain social and environmental issues.<br><br>Jason Clarke plays a believable character and I loved Gary Oldman (but\non the other hand: can't remember him ever letting down in a role). As\nI said, somehow the apes do not look real or believable to me,\nespecially when they are not in close up or even riding a horse. But\nthe latter is also a part of 'the franchise' I believe.<br><br>The story really saves the day here; it makes this movie stand out\nagainst the deep pool of mediocre crap that is usually thrown at the\nblockbuster audiences.\n"},
{"review": "\nNow THAT was a movie! Finally something to sink your teeth into and try\nand wrap your head around ;) CGI overdose which is fun once in awhile\nand quite frankly with all the stinkers and disappointments in the\nsummer of 2014, This one stands out for me because I was able to enjoy\nthe oft seen cartoon imagery. I highly recommend watching this film on\na 1080P or even I for that matter the photography was nothing short of\nbreathe taking. If you didn't see this one in the theater as I wasn't ,\nDo yourself a favor and pick this up with some spumoni and\npopcorn...Enjoy the ride ;)<br><br>PS, The rating system for IMDb doesn't allow percentage points as this\nfilm would have received a rating of 6.75 IMDb \"I'm a dumb Bell\" :P\n"},
{"review": "\nI really enjoyed this movie. The effects were brilliant and the\nstoryline kept me on the edge of my seat. I watched the first one and\nliked that one too but thought, like with most sequels, they wouldn't\nbe able to do as good a job but they did! I personally would recommend\nit I thought it was worth the cinema ticket which seems to so expensive\nthese days and I feel I have wasted so much money of late watching\nunexciting films that have all the best bits in the trailers! The Apes\nlooked scarily real and you get so immersed in this other world, it's\ndone in a really good way with even some comedic moments thrown in for\ngood measure!\n"},
{"review": "\nI really wanted this movie to be good. I was quite surprised in a good\nway of Rise of the Planet of the Apes and I was really looking forward\nto the movie. But boy was i disappointed. My biggest problem was the\nstory. I sat in the cinema with a friend and I could tell him whats\ngonna happen from the minute I saw all the main characters. It was too\nobvious. So all the suspense flew away. I hoped that I was wrong with\nmy guessing and that the movie will surprise me with a twist or\ncharacter trade I wasn't expecting but nothing like that. The acting\nwas good the cgi and the animation of the apes were astonishing but the\nlack of suspense due to predictability brought this movie down.\n"},
{"review": "\nThis film tells the story of a team of people in a post apocalyptic\nworld, who enters the jungle and encounter a colony of intelligent\napes. They struggle to find the balance between co-existence and\nconflict.<br><br>Maybe I am just not interested in talking apes. I find \"Dawn of the\nPlanet of the Apes\" plain boring and irritating. The team of people who\nventure into the forests try to be nice to the apes, but there is this\none aggressive and impulsive guy who ruins everything. I was so annoyed\nby him, that I wonder how his teammates get along with him.<br><br>Though there is an underlying commentary on how many people treat\nanimals with no respect or love, the message doesn't quite work. Apes\n(especially talking ones) are just not the same as cute little puppies.\nThe plot then descends into a fight between all sides, and I lost\ninterest in it because it is so chaotic. The ending might have been\npoignant, but unfortunately I did not feel the intended emotions.\n"},
{"review": "\nDawn of the Planet of the Apes<br><br>The ironic thing about an ape planet is it'll eventually evolve into a\nhuman planet.<br><br>Mind you, there are humans in this sci-fi film - and that's an issue.<br><br>When a pandemic wipes out San Francisco, a small contingent of\nsurvivors (Jason Clarke, Keri Russell, Kodi Smit-McPhee, Kirk Acevedo)\nheads into the forest in hopes of activating a power generator.<br><br>Standing in their way, however, is the talking ape Caesar (Andy Serkis)\nand his simian army.<br><br>While the groups strike an accord, treachery on both sides results in\nwar within the protected walls of the humans' citadel.<br><br>The follow-up to the 2011 re-imagining of the landmark original, Dawn\nmaintains the themes of its inspiration, while bringing more depth to\nthe human/ape dynamic.<br><br>The impeccable special effects also help elevate this sequel to higher\nlevel of story telling.<br><br>Incidentally, you don't want to know what warring apes fling from their\ncatapults. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nI finished this film, thinking, \"There are people out there suffering\nand I can do something to help them.\" This is a story about a place\nmost people might not be able to conceive: where things are dying,\nwhere people survive off liquor and cigarettes, where those who are\nsupposed to love us drive knives into our backs. There are fisticuffs\nback and forth with those who claim to work for justice and, of course,\ntalking apes. Great performances help to enhance this amazing story of\nfriendship and violence. Truly a gritty, hard movie about gritty hard\npeople (and apes). But the real centerpiece of the film is its acting;\nthree performances in particular stick out.\n"},
{"review": "\nDidn't have super high expectations, but the first surprised me in how\ngood it was and so I hoped this would continue the trend (and seeing\nhow it got even better reviews, I did expect it to). Pretty great\nblockbuster, and as a film, not sure how great it is but it's very\nentertaining and the characterization is pretty spot on. Serkis does\nhis usual brilliant work, as do many of the other supporting ape roles.\nThe detail in the facial expressions is pretty amazing, and it's about\ntime that CGI motion-capture performances start to get some awards\nrecognition, although I know it's hard for people in general. This is\nrecommended.\n"},
{"review": "\nDawn of the Planet of the Apes delivers in this awesome sequel, which\nis hard to do especially when the cast is completely different than the\nfirst movie, other than Andy Serkis. We get to see Ceasar lead the apes\ninto freedom and into a new era where knowledge rules there new\nsociety. It picks up perfectly from Planet of the Apes movie from 2011\nand This movie definitely deserves the ratings it's getting yet I\nwouldn't put it at the number one spot as blockbuster of the summer.\nDefinitely at number two though. I am eager to see the third following\nand what the future beholds for the very little humans left! Watch this\nmovie with an open mind of talking apes, and i guarantee you will love\nit!\n"},
{"review": "\nI thought it was a good movie, one I would happily watch again any\ntime, which is a rarity for me. I watch a film to be entertained\nforemost and this was very entertaining in deed. I've read a few posts\non here knocking the plot line as it was only ten years ago and how it\nlacks any continuity and would not be a reality. Wake up you're talking\nabout a film about talking intelligent apes here, leadership, strength\nin numbers[ another gripe from some] and perhaps man's downfall. What\ndid you expect?<br><br>So for me personally, It was very entertaining and watchable and look\nforward to the next one, next year?\n"},
{"review": "\nKoba: \"Caesar weak\". / Caesar: \"Koba weaker\".<br><br>The two sides come to a fragile peace. But this peace will not last and\nsoon a war arises - one whose outcome will determine which species\nremains the dominant force on the planet. <br><br>2014 summer movies just keeps on getting better, Because this sequel is\non the same level of awesomeness as empires strikes back and the dark\nknight. Andy Serkis needs a freaking Oscar and I know a lot of people\nhave been saying that but it's true. The visual effect's are so realist\nand so well made. Matt Reeves brings something new to the table and he\ndoes it so brilliantly. The story is good and the rest of the human\ncast are great in the movie and overall this movie is by far the most\nnew and the refreshing films yet.\n"},
{"review": "\nNever have I been so stunned by a movie, Andy Serkis is no stranger to\nmonkeys and he portrayed one (Cesare) brilliantly, he got the facials\ngreat, and the movement is just perfect. I never thought the\nperformance of a monkey could affect me as emotionally as it did. I\nloved Gary Oldman in Nolan's Batman Trilogy as James Gordon, and as\nDreyfus, I got the same vibe, broken and his role in leadership\ndeclining. This movie is filled with powerful actors, spectacular CGI\nmotion capture, and a story that is action packed, and emotionally\nstunning.<br><br>I look forward to the next movie, and I hope it can live up to this\nincredible movie, definitely a must see.\n"},
{"review": "\nYes I liked this film, yes it was beautifully made, yes it had\nexcellent Visual effects and Special effects, I really enjoyed it\nwatching it, but again I had a feeling that I saw all that before.<br><br>I really would like that Hollywood comes up with something original and\nnew. I do not know is it possible after all of these films in last\ndecades which chewed successful films over and over again. So please\nsomething new.<br><br>Yes, acting was wonderful and things were so excellent that I really\nset on the edge of my seat, a rare occurrence for me.<br><br>I also want to emphasize that the apes costumes and make up were\nfantastically made and people who worked on that deserve full credit.\n"},
{"review": "\nDown of The Planet of The apes is one of the best movies ever, because\nit as Action , SyFy and Drama in the same Movie. I loved it, I watched\nit Yesterday and I loved it. This Movie is better than the first \" Rise\nof The Planet of The apes\" With James Franco. I give 10/10 because its\nan excellent film and i think everyone should see it. . I think This\nmovie is Great and i think this movie is the best, Planet of The Apes\never. Just Watch the movie, Good Syfy, Good History, Everything is good\nin this film. Im waiting for the third movie. I Hope you enjoy this one\nbecause its a great movie.If you didn't seen the first movie, Watch it\nfirst.\n"},
{"review": "\nNo offense meant, but really! Do you have any other facial expression\nother than \"blank\"? I kept waiting for your expression to change - you\nknow, like when something really dramatic was about to happen... blank.<br><br>Or when something really sweet or funny happened... blank.<br><br>So, Mr. Clarke, have you had your fun trying out how to be an\n\"Actooor\"?. Will you now admit defeat and go back to producing? I guess\nI should've checked which other films you've \"acted\" in and which ones\nyou've produced. But I didn't, as I'm not really that interested.<br><br>So all I want to say is there could have been a dozen or a hundred real\nactors who would've done a much better job in the starring role.<br><br>Someone who could do \"scared\" or \"happy\" or ... you get the idea.\n"},
{"review": "\nDawn takes place 10 years after the first film. Mankind is almost wiped\nout. A human survivor settlement wants to restore a power dam which\nhappens to be also the home and settlement of the apes. The story\nreally is a rather classic one, something we surely all seen before.\nThe biggest draw for this film is the execution. And more specifically\nthe performance of the apes: they squeeze more emotion out of these\ncomputer generated monkeys than Keanu Reeves ever showed in his whole\ncareer. They also look quite real and convincing. The animation is\nsuperb and the rendering almost photo-real. Despite all this praise I\nthink it is a bit overrated. 8,0/10 by 140.000 people on IMDb should\nwarrant an instant classic but for me it's not. I liked it, it's better\nthan the first one, much better than 'Beneath the Planet of the Apes'\nbut it lacked something to make it to my personal favorites list. But\ndon't let that keep you from checking it out.\n"},
{"review": "\nI've been waiting for the sequel since the first film, Rise of the\nPlanet of the Apes, came out which was in 2011. When it was the 11 July\n2014, I was more excited than ever when I went to the theaters. It's a\ngreat story. I loved Toby Kebell's character as Koba. I felt Koba's\ntragic feelings and I actually felt sorry for him when Caesar let him\nfall to his death (Or major injury). Caeser's character was good too. I\nknow what it is like to rather make peace instead of war but it always\nhappens. I thought this was the best apocalypse movie ever made in this\nyear so far. I have always loved Planet of the Apes because apes are\nthe second most intelligent beings on earth and one day if they could\nevolve further enough, the could dominate the planet. I am hoping to\nsee a sequel!\n"},
{"review": "\nOkay, 10/10 might be too high for some people. This is why I love it.\nIt's full of sadness and moving moments and not just all about\nconflict. It's different from what you'd expect it to be. <br><br>The CGI is phenomenal, and is beautifully shot. It has a sense of\nrealism about it, the apes feel just as real as the humans, that's how\ngood the effects are and performance of the actors who play them. <br><br>Don't try and guess the plot either because again, it's deliberately\ndone in a way that you think you know what will happen but there's\nlittle surprises all the way through. I've seen comments saying 'it's\nboring' it really isn't. If you listen to the film, the plot and\nstoryline makes so much sense and keeps you on edge all the time. The\ncinema I went to, people let out gasps and I could hear people sobbing.\nIt defiantly is better than anticipated. The actors are great in it.\nAnd I really can't understand why anyone would even consider this film\nas rubbish, it's literally fantastic.\n"},
{"review": "\ni just came from watching this movie and all i can say is...amazing.\nthis movie made me believe that Apes can talk, ride horses and\nexperience human emotions. Andy Serkis deserves an Oscar for his\nperformance which was just seamless...seriously it is amazing how they\npulled this off...the Ape village, the relationship between the apes\nand there families all perfectly believable. the story is not what i\nwould have expected in relation to how the war would actually\nbegins...i thought they would go in a more clichéd road but they\nsurprised me in a very good way...in the end the movie has less to do\nwith us humans as it actually has to do with Cesar's relationship with\nthe other apes, and his belief on how different and noble the Apes are\nas compared to humans...unfortunately for him, it turns out we are not\nso different after all. this is a must watch...action.. top notch,\nCGI..top notch, story...top notch, and Apes on horses!!...what else can\nwe ask for?\n"},
{"review": "\nPlease be informed that I watched this movie alone and with a lot of\nexpectation. The first movie I have watched with the whole family as\ngift to them. Now I watched this second movie, all I can say is that\nthe movie is alright and nothing more. There was nothing that made the\nexpectations true. Or nothing that surprised me. Although the\ngraphics/screens/cinematics and such were excellent. As well as the\nstory en character development was nothing in comparison with the first\nmovie. Please just watch the movie without expectation. Furthermore,\nthe movie is to long for just to be watched in between. Lastly, I am\ncurious what the next movie will bring.\n"},
{"review": "\nI have been an apes fan since I was a child. The first Apes I saw in\nthe movies was Escape, then a few years later I sat through all Five\n(the Go Ape! Festival). Dawn is a brilliant film. There are no true\nvillains (which is much like the original. The Apes weren't evil, they\nwere afraid of Taylor). This shows how two civilizations, one rising\nand one failing clash. The story is tight, the film itself is\nbeautiful. I recommend this to any movie fan. This is similar in tone,\nto me to Nolan's The Dark Knight. If you took Batman out of it,\nreplaced him with a vigilante, it would still be a great film. It's the\nsame here. The Academy will have to come up with an additional award\nfor actors like Andy Serkis. His Cesar is brilliant. Just a tremendous\nfilm.\n"},
{"review": "\nI voted below mediocre movie. Already seen, \"nothing new\" lemonade.\nThere was no need for me to see this movie, but I found that out after\nI watched it. Why? Because in this dull and simple movie, it is\npossible to predict absolutely everything. In order to retrieve the\ninvested 175mil. the authors didn't risk a thing. They just used\npatterns and templates (or should I say \"template\"). <br><br>Special effects are quite fine, but I didn't spend my money to watch a\ncartoon. Therefore, another minus, since the authors somehow assumed\nI'm eleven. <br><br>Big minus goes also for the technical electrical moments, but I will\nnot say more in order to avoid spoilers.<br><br>Finally, I made up my mind, so I leave the dispute from the summary to\nyou.\n"},
{"review": "\nFirst time I've walked out of a movie. Meaningless plot, clumsy dialog,\nCGI worthy of a 1983 Sega, this is truly the worst film I've ever seen.\nThe plot literally makes no sense whatsoever, none. Every element is\ncounter-rational. The graphics look like what you'd get if you let a\n9-year old use freeware from the web. From the first scene, you're\nscratching your head \"is that supposed to be a bear?\" \"why is there a\nbear?\" Then you spend the next hour thinking \"wait...why'd he do that?\nWhy blow that up? Why are they hurt?\" No part of this movie makes any\nsense whatsoever. You could get better plot and dialog if you just\nasked a couple of 8-year old boys to make up a story about monkeys.\nGary Oldman and Keri Russell need to fire their agents, they're both\nbetter than this stain on their careers. My advice--wait until it's on\nTV, and be sure to avoid it then.\n"},
{"review": "\nGuess I'm a minority, but I thought this was formulaic Hollywood stuff.\nThere were no surprises whatsoever. It's 130 minutes long; after about\n20, you pretty much know how it will turn out. There's the stock\ncharacters for this kind of story: the wise and enlightened leaders of\nthe opposing societies (Malcom and Caesar) and their loving families;\nthe hotheads(Carver and Kobo)who undermine the good intentions of the\nleaders; the scene where the families of the Malcom and Caesar get\ntogether and see that \"we're really not so different after all\" Ugh.\nThen there's the requisite brain- rattling battle scene capped by final\none on one confrontation between the hero and the heavy, which the hero\nof course wins. Haven't we seen this before, like, a million times?\n"},
{"review": "\nBoth of the \"Planet of the Apes\" prequels have political themes. \"Rise\nof the Planet of the Apes\" focuses on the maltreatment of animals in\nlaboratories. \"Dawn of the Planet of the Apes\" poses the question of\nhow people will survive if society collapses, and whether we can find\ncommon humanity or simply have more wars. The differences in the\nattitudes of Caesar (a pacifist) and Koba (a warmonger) reflect those\namong the humans. Caesar has resisted the base impulse towards\nviolence, even though he was the victim of violence perpetrated by\nhumans. He's the Nelson Mandela to Koba's Pol Pot.<br><br>While it's not a masterpiece, I still think that this movie is a good\nallegory. It poses the question: if we band together, is it for a noble\ncause (embodied by Caesar) or is it for evil (embodied by Koba)?\n"},
{"review": "\nI've watched it in 3D and on that part it disappointed me, the 3d isn't\nstunning at all but luckily the effects were stunning. The story itself\nisn't that strong either.<br><br>After the rise of the apes which looked fine I was looking forward to\nsee this flick and yes, Ceasar is back but before the things go awry\nyou have to sit almost an hour through a lot of talking and a story\nthat isn't convincing. It's when one of the apes is going against\nCeasar that this flick starts moving but by then it's a bit too late.\nJust a simple story but as I said the effects do make this flick. Not\nwhat I expected from the dawn...<br><br>Gore 0/5 Nudity 0/5 Effects 4/5 Story 2/5 Comedy 0/5\n"},
{"review": "\nWell I grew up with the early Planet of the Ape movies, which were OK\nat the time. However times moved on and now they feel very dated now so\nit took me a while to buy back into the franchise. Well a few weeks ago\nRise of...was on TV so I gave it a watch. Guess what, I ended up really\nenjoying it. I like the dark undertones that have been added, bit like\nthe Batman franchise. So I was ready to see this latest one and\nabsolutely loved it. Great special effects again, and Andy Serkis as\nCaesar and Toby Kebbell as Koba are just brilliant. Gary Oldmans\ncharacter is a bit vague, seems quite tame at first but completely\nchanges later on. I foresee at least a couple more films in the future.\nIf you like the genre you'll love this film.\n"},
{"review": "\nThis movie does what most sequels fails to accomplish. Dawn of the\nPlanet of the Apes is better than Rise of the Planet of the Apes in\nbasically every way. The CGI and Motion Capture is much better in Dawn\nthen it was in Rise, and Rise had some impressive visual effects. The\nApes in Dawn of the Planet of the Apes are so well realized, that there\nare some scenes in this movie that convince you that there are real\napes on the screen, not just because of the incredible CGI, and the\nfact that this movie is directed beautifully by Matt Reeves, but also\nbecause the actors portraying the apes do such a great job of acting\nlike apes in their motion capture work, especially Andy Serkis and Toby\nKebbell. Dawn of the Planet of the Apes also has a very gripping story,\nand very good acting, not just by the actors playing apes, but the\nactors playing humans as well. Definitely one of my favorite movies\nthis year, of the ones I have seen, if not my favorite. On IMDb I give\nit an 8/10, but my own personal rating would be about an 8.5/10.\n"},
{"review": "\nDawn Of The Planet Of The Apes is an amazing movie if you enjoy action\nmovies then this is a great movie if you like story and tense moments\nthen this is also amazing. I loved the film and think it's possibly the\nbest film of 2014. The moments when bullets are shot it's loud and you\nwill most likely jump the movie is amazing and deserves the 10\n.Nothing, absolutely nothing, in Dawn of the Planet of the Apes falls\nshort of being amazing. An emotionally heavy and truly moving film,\nDawn is an absolute marvel of modern science fiction, building upon the\nstrong and unmovable foundations Rise of the Planet of the Apes had\nleft earlier.\n"},
{"review": "\nIf you have watched a million si-fi movies before, yes, you won't learn\nsomething you didn't know before; but, this movie is special because,\nat least, IT MAKES SENSE! I'm personally weirded out by almost all of\nthe recent big budget movies, with stories which don't even make sense.\nSO many stupid big budget films, which directly insult our\nintelligence, and this is an exception! Amazingly shot and VERY\narchetypical in its approach, makes one at least think for a bit, what\nmight happen IF the Apes of today ONLY learn how to use tools. They\nwill pretty much take over... Love the series and the idea behind! The\nfilm is FUN and makes sense!\n"},
{"review": "\nA commendable and thrilling sequel to the first part. The series\ncontinues to be intelligent, and develops intriguing conflicts between\ncertain lead characters. Through the screenplay is stronger in this\none, it fails to deliver the emotional impact the first part did.<br><br>The CGI effects still never fails to amaze me; the precision to detail\nis incredible. Actors like Andy Serkis (Caesar) and Toby Kebbell (Koba)\nare commendable in their ape characters. Other supporting actors like\nJason Clarke and Gary Oldman are commendable in their roles.<br><br>The character developments are predictable, but intriguing. There are a\nfew plot-holes regarding the humans' stay in city and apes' armed fight\nscenes, but they can be ignored. Overall, the movie is spectacular and\nenjoyable.\n"},
{"review": "\nThis film is a really good, modern day sequel. After thoroughly\nenjoying the first film, this film takes you down a completely\ndifferent path and is quite frankly outstanding. If they had a stand\nout character/actor in this film then I would have given it a 10. But\nquite frankly, the scripting and CGI is simply amazing. I really don't\nwant to give anything away in this film so I am going to keep this\nreview short and brief. It's all about the Monkeys... You almost grow a\ncase of affection for the Orangutan. The ONLY criticism I have about\nthis film is that the Gorilla (I forget his name) does not play a\nbigger role in the film.\n"},
{"review": "\nCan't say much without spoiling but the movie is awesome, absolutely\nloved it. The effects and animation looked very realistic. This is the\nbest \"planet of apes\" movies to the date. All the action, drama and\nCaesar's heroic character had me excited on the edge of my seat. This\nmovie should have at least been nominated for Oscar. The movie truly\ndepicts flaws in human nature, and also warns that \"ebola\" was\npreplanned. The cast of the movie is also amazing and I hope the next\npart also includes them. Thanks for the fun writers and direction,\nalthough the movie could have been even more trail-blazing. But, lets\nexpect that from the next part.\n"},
{"review": "\nI was hooked! The CGI effects were stunning. However, it was rather\ndisconcerting to see apes riding horses. <br><br>There were absolutely brilliant action scenes. Some were particularly\nwell shot like the tank sequence turning round to reveal the battle\nscene. <br><br>This movie makes you think about what it means to be human. It blurs\nthe line between humans and apes that you no longer think of them as\nprimates anymore but rather as non-humans. I had fun in the scenes\ntrying to identify who was actually ape and human based on their\nbehaviour. Each were capable of love and terrible violence, the\nemotional range having already been established in the first movie.\nThat being said, I felt the non-humans had many more and deeper\nemotional scenes than those of the humans. One reason being that given\nthe non-humans limited vocabulary, everything they say came across more\npowerful.<br><br>9/10 rotten bananas.\n"},
{"review": "\nA lot of people will applaud Andy Serkis for his portrayal of Caesar\nbut Toby Kebbell's portrayal of Koba completely steals the show.\nKebbell shows all the hate and rage that Koba holds towards humans and\nproves to a powerful enemy against Caesar. <br><br>Though in the film there are under developed relationships between\nCaesar &amp; his family and there are some characters that you are meant to\nfeel for but in the end you don't because their character is so under\ndeveloped. <br><br>Overall Dawn of the Planet of the Apes is a amazing sequel that opens a\nlot of doors to the franchise. And introduces a brilliant and well\nacted villain. Dawn also shows us the new motion capture technology and\nwith out a doubt creates beautiful looking characters and makes way for\na new form of acting.\n"},
{"review": "\nI saw DAWN OF THE PLANET OF THE APES! For those of you who were blown\naway by it's predecessor, hold on to your jiggly bits because this next\nchapter in the apes saga packs just as hard a punch as the last one,\nmaybe even more. This movie, directed by Cloverfield director Matt\nReeves, is another lesson to Hollywood that teaches that just because a\nmovie's premise is silly, it doesn't mean we are allowed to be lazy.\nDawn has it all! It's got lots of action, Shakespearian style writing,\nnext level special effects and on top of that, dynamite performance by\nJason Clarke, Gary Oldman and CGI acting king Andy Circus. If you're a\nPlanet of the Apes fan, do yourself a service and check this movie out.\nDawn of the Planet of the Apes gets a well deserved 4.5...out of 5.\n"},
{"review": "\nI found the movie dumb and boring. Today's movies mostly have no plot\nand if they do the same old plot type; downtrodden \"monkey\" gets his\nrevenge on Humans.<br><br>I actually thought the \"Planet of the Apes 2001\" was ALLOT better with\na better plot. The end of the movie he goes back through the worm hole\nand crash lands back on earth; but what he finds he didn't expect. Now\na sequel to that movie would have been far far better than this one..\nExcept this version went back to the \"apes\" back to treating \"Humans\"\nas slaves. The movie this time relies way too much on CGI effects and\ngoes in a direction even anyone could not imagine. Example a number of\n\"apes\" about 15-20 push a school bus on its side towards the Bad Humans\non a bridge; a bus that weights around 20-30,000 pounds.....\n"},
{"review": "\nThis is my first review at IMDb and I am damn sure this movie rocks the\nbox office I had got a chance to see this movie in Imax format in\ntheater and iamb feeling proud to say that They had fully paid me off.\nThe story line was awesome The films original work is in its graphics\nKudos to the graphic team I am ready for the next installment This kind\nof movies shall be made every time They had invested in a good attempt\nand in a good project and i have to say that they will make the other\ninstallment as good as this one Surely I will go to that installment\nalso And I hope they will release it as soon as possible and I also\nhope that the next installment will be an another great movie of that\nyear\n"},
{"review": "\nAlthough the apes are well rendered, they're not enough to save this\nplodding film. The film starts slowly, ambling along, until the one\ninteresting twist. After the twist there's a bit of a build-up, but\nit's not that gripping and the rest of the film is fairly unremarkable.<br><br>Thematically, it's standard good-vs-evil fare, with leaders that are\nreasonable and wise and foils that are self-centred and hate- filled.\nThe film's underlying message is trite and has been expressed better in\nother films.<br><br>Aside from the lacklustre plot and banal message, the character\nportrayal is also quite run-of-the-mill.<br><br>All in all, \"Dawn of the Planet of the Apes\" is typical Hollywood fare:\nfamily-friendly mediocrity. Worth a miss.\n"},
{"review": "\nDawn of planet of the apes is action/ post apocalyptic film which has\nas director Matt Reeves. Main actors are Judy Greer ( Cornélia ), Gary\nOldman ( Dreyfus ), Keri Russell ( Ellie ), Jason Clarke ( Malcolm )and\nAndy Serkis as César. Ten years after the beginning of the \" simian flu\n\", most of people are dead. In San Francisco, a group of survivors\nwants to find others survivors around the world. For that, they have to\nreach an hydroelectric factory which is on the apes's estate. Those\nones, with César as leader, are afraid from humans. A war will start..\nIn my opinion, this is a gripping and dazzling film. The post-\napocalyptic atmosphere is perfectly done, the acting and special\neffects are incredible ( For example, we can see the fear into the eyes\nof apes,.. ) In the other hand, when the movie stops ( even if it is\nnot a real end because it's the first film of trilogy ), you just want\nto see it again because the plot is really immersive and taking. I'd\nrecommend it to all people who likes action films or simply the\nprevious planet of the apes saga.\n"},
{"review": "\nOh. My. God. What an amazing movie that was. Back in the day, when Rise\nof the Planet of the Apes was released, I thought \"meh, I won't like\nit, it's a popcorn film, blah, blah, blah.\" However, a friend invited\nme to the cinema to watch it, and I loved it. You see, I'm not familiar\nwith the original series, but as a stand-alone film, Rise was awesome.\nThe problem was, there weren't enough ape scenes.<br><br>But now, Dawn has a lot more apes, a lot more action, which means,\nyou'll have a much better time. The movie is so meticulously detailed,\nit's jaw-dropping. You won't think the apes are actually people acting\nand wearing a strange black costume (until you see a behind the\nscenes), because the special effects are so amazing. I'll be sure to\npick this movie up when it comes out. If you are a fan of the original\nseries or just like action movies, this is an awesome movie for you.\n"},
{"review": "\nWatched it after 2 months of release and I love the way the story is\nbeen explained. People say its predictable but the movie has shown the\ntrue color of human nature. It shows how hatred can bring war and war\ncan bring destruction. The father and son story of Ceasar and his son\nwas heart touching. Its probably the best ape movie ever. I already\nloved the first two parts of the movie. I would recommend it as a\nsensible family entertainment. For me it is the superhero Ceasar I\nwanted to watch. It doesn't show what happens to Ceasar and his Ape\nfamily. The scene which gave me goosebumps is when Koba said \"Ape don't\nkill apes\" just to survive and Ceasar killed him saying \"Ape don't kill\napes, but you are not ape\".\n"},
{"review": "\nDawn of the planet of the Apes is an absolutely fantastic movie that\nreally surprised me. 2011's Rise of the Planet of the Apes surprised me\nbecause I thought it looked like a piece of Hollywood garbage. It\nlooked like they were just trying to redo a classic franchise by\ndigitizing the characters and giving it a horrible reboot. When I\nfinally saw it, I was very pleased by the fantastic screenplay and\nmotion capture work, it was one of the best movies of 2011. If you\nenjoyed Rise of the Planet of the Apes, you will adore Dawn of the\nPlanet of the Apes. Andy Serkis' performance as Caesar is absolutely\nheartbreakingly emotional, the action sequences are very well directed,\nand the script is even better than the first one's. It is a sequel that\nimproves on every single level of it's predecessor. The score is\nbetter, the script is better, the motion capture is better, EVERYTHING\nABOUT THIS MOVIE IS BETTER THAN THE FIRST ONE. DOTPOTA definitely goes\ndown in Hollywood history as one of the best reboot movies of all time.\nI now CANNOT WAIT for the third one.\n"},
{"review": "\nIf you thought that Rise of the Planet of the Apes was amazing, you\nwill be awestruck by this sequel. It has everything a summer\nblockbuster should have, but it is much more than just a mere\nblockbuster. It hits on the human condition on multiple angles,\nsociopolitical issues, and personal motivations such as fear, family,\nfuture for oneself's and/or others, protecting home, mistrust, and\nrevenge.<br><br>Caesar is no doubt the star of this show and Andy Serkis' performance\nas that ape matured into a weary leader of his people improved by many\nsteps from 'Rise'. Koba was also excellent and stole the spotlight in a\ngood way along with Caesar. The chemistry between the two was so\ncompellingly tragic that it is easy to emotionally invest into them.\nThe humans do put up a really good show, but I say that the apes are\nthe more interesting characters here thanks to the improvement in the\nCGI.<br><br>I strongly recommend watching this movie because it will be worth your\nmoney and time!\n"},
{"review": "\nSimply fantastic in every prospect, the CGI was fantastic, acting was\ngreat, Andy Serkis (Caesar) was astonishing, and the rest of the apes\nwere awesome. Even after over 2 hours of film, I was still wanting more\nand was wishing it didn't end. The plot is a little bit different than\nthe trailers, though (which is good). The characters were very strong\nand well thought out. The mixture of emotion and action was perfect.\nThis movie focuses more on the apes rather than the humans which\nexplores the progression of the apes as a civilization. Would I\nrecommend this movie? Definitely. This movie deserves more attention\nthan Transformers 4 which I thought was terrible.\n"},
{"review": "\nFirst of all, it is a good movie. Go watch it.<br><br>Now, it's not that perfect. It lacks any real closure from my POV, it\ntends to get a bit predictable (but in a smart way, not filled with\nclichés) and sometimes you really have to suspend your disbelief.<br><br>Some people will see in it a social commentary. I don't think there is\nany but it is a very good portrayal of two different societies. The\nsavages and the domestic switch sides in this movie.<br><br>So is this a movie about humans fighting against monkeys or monkeys\nfighting against human? Both. In some ways, it reminded me of Jarhead\nand the futility of war and fighting, how there is no real winner.<br><br>Go watch it. It's maybe the best movie seen in the last months. I\nenjoyed the first a bit more but this was a fast paced action - drama.\n"},
{"review": "\nI am not going to write much, after seeing the first part of which was\nleft to me a very nice impression I was expecting something like this,\nI even got through this part much more! I recommend it to anyone who\nlikes science fiction, or maybe .... Apes are well done, it is\ndifficult to see that animated. At one point the film have no more\nfeeling that they are apes looking at them all the way as people,\nbehavior, conversation, contemplation ... It does not take long for\nthis type of story, quite enough. The first part is rounded up one\nwhole second part is also without any exaggeration and delays. <br><br>My rating is 10/10 right after seeing the movie, great impression! I\nrecommend everyone who likes this genre will not regret it!\n"},
{"review": "\nI went ape crazy with entertainment with the \"Dawn of the Planet of the\nApes\" which is set years after hail ape Caesar and his ape peeps\nescaped&amp; attacked the Golden Ape Bridge, I mean Golden Gate Bridge. In\nthis installment, Caesar and his entourage take refuge but it is\nthreatened by a group of human survivors who need electrical power to\nsurvive; the problem is the plant is near Caesar's crib; but Caesar\ninforms them \"I Got the Power\"!!! OK, enough! I highly recommend this\nmovie! Andy Serkis turns yet again another classic Serkis capture\nperformance act as Caesar. Director Matt Reeves' riveting picture is\ndawning and not yawning! ***** Excellent\n"},
{"review": "\nThere are amazing technical achievements to gawp at in this movie, but\nsadly they don't prevent it sinking under the ponderous, cliché-ridden\nscript, which contains scenes so poorly written they made me wince.<br><br>Worst of all, the sexual politics of the piece are insulting to half\nthe world's population, and don't reflect at all well on the other\nhalf.<br><br>Here there's none of the lightness of tone that was such a feature of\nFranklin Schaffner's 1968 movie, which enabled Roddy McDowell, Kim\nHunter and Maurice Evans to be so playful in spite of the restrictions\nimposed on them by their comparatively inflexible make-up. DAWN OF THE\nPLANET OF THE APES rarely rises beyond doom-laden. The overall\nimpression is of people taking themselves far too seriously.\n"},
{"review": "\nSome people have given this 1 out 10 which is downright ridiculous\n(Even Gigli from 2003 got 2/10). I myself thoroughly enjoyed this movie\nand cannot wait for the next installment to come out.<br><br>The action scenes were amazing (I couldn't tell the CGI from the RL),\nthe acting was top notch and the story made sense without any plot\nholes. Cesar is the star of the movie (Think Spanish Monkey version of\nOptimus Prime) and Koba the PTSD (Post Traumatic Stress Disorder)\nmonkey is his co-star. The humans are plot devices that need to be\nthere, and they in no way steal the show. It's a film about a bunch of\nsmart apes just trying to live their lives, and it's great.<br><br>If you are a normal person who likes normal good movies, you will enjoy\nit (Unless you have Pithecophobia - Fear of monkeys). It's strides\nbetter than the first movie and it should be one of the top 5 movies\nyou see this year. If you've already seen Guardians of the Galaxy,\nGOOoooo and watch Apes. 10/10.\n"},
{"review": "\nDawn of the Planet of the Apes is an amazing has a good story.It is a\nthriller movie.<br><br>Caesar, the amazing creation of combination of acting skills of Andy\nSerkis and new age motion capture technology is the heart of the story.\nHe leads, and bleeds for the apes. Apes have become almost human. They\nhave families, the conflicts, the trust issues with humans and the\nrules to govern their wild colony. These tiny details make Dawn a\nunique piece of cinema. All jungle scenes are done so well that they\nmake real footage of National Geographic seem ordinary. All apes and\nhumans characters make you root for them even the evil ones. Caesar's\nelder son's emotional journey is soothing and his younger's son's first\nencounter with humans is heart warming. At the same time, ape Koba's\nencounter with two humans guarding the weapons and his ever rising\nconflict with Caesar is chilling.\n"},
{"review": "\nBy far the best I have watched in 2014! It invoked a lot of emotion in\nme with some parts being exciting and others left me with tears. It was\na really good continuation of the previous movie and I was so excited\nwhen it finally came out! The characters in it (mainly the apes) were\nall the same and I love how it really feels like ape are human. Would\ndefinitely be more impactful if you had watched the prequel as the\nconnection between you and Caesar would still be felt here since the\nprevious movie! The plot is also very good with slight twist at the\nend. All in all I would rate this the best movie I have watched so far\nand would recommend this to my friends and family!\n"},
{"review": "\nNot only is Dawn a great summer blockbuster but it proves to be an\noutstanding movie in general. To start, the question remains: When will\nAndy Serkis be nominated or even win an Oscar. Once again he steals the\nshow in this movie. He not only has the respect and attention of the\napes in the movie, but also of the audience watching. Also a lot of\npraise should be given to Toby Kebbell as Koba. He is another seen\nstealer in this movie. Jason Clarke and the other humans deserve\nhonorable mentions as well. They were very good in the movie. It just\nhappens to be that they are in the shadow of Serkis and Kebbell. Not\nonly are the performances great but the special effects are amazing as\nwell. The apes on screen look as if they are real and the ones acting.\nThere is not a dull moment in this movie at any point. The director\ncaptures the action and tension perfectly. This is the best movie so\nfar this year.\n"},
{"review": "\nI seen all of the planet of the apes movies this is arguably the best\none(and this is extremely hard to do as the original movies were such a\ncultural icon for it's time).<br><br>What's even more surprising is how long it's been since a good planet\nof the apes movie. Yes the prior one was decent but this movie is SOO\nMuch better I'm not going to say much about the plot because that's a\nspoiler but this movie throws you straight into action from the 1st\nminute and doesn't let go.<br><br>The imagery is astounding but just cause the imagery is great doesn't\nmean this movie doesn't have a plot. It does and it feels like a plot\nback when Hollywood didn't over rely on special effects to bring in box\noffice receipts. IE extremely believe characters, real drama, a plot\nyou can't figure out on how it's going to end but just keep you in\nsuspense.<br><br>Bravo! I look forward to seeing the next movie. Highly recommended!\n"},
{"review": "\nAbsolutely enjoyed this movie. It was more sentimental than I expected.\nLoved the story line, special effects, the facial expressions and the\nbodily movements of the apes. But most of all I loved the message of\nthe movie. There are a few messages that the movie tries to impart. The\nmost important message for me was : You have to forget the past. We as\nindividuals and communities must learn to forget the wrongs of the past\nto create a good future. Other lesson is that no community is good or\nbad. It is individuals that are good or bad. Different communities can\nlive together. Also what stands out are the leadership qualities of the\nleader of apes. If every leader would think so much about their people\nand peace at large we would have a different world. <br><br>Overall a very well made movie with mix of great story line, good moral\nlessons, action, CGI etc. Must watch.\n"},
{"review": "\nThe original Planet of the Apes based on the novel by Pierre Boulle,\nwas poignant and allegorical. Shocking! Dawn of the Planet of the Apes\ncaptures the original spirit of the movie by presenting a powerful\nallegory of ethnic conflict. Of us &amp; them. Of how easily diplomacy can\nspiral out of control and spark racial unrest. A very thought provoking\nupdate to the franchise that makes it absolutely 100% relevant to\ntoday. Sci-fi at its best! Not the huge summer blockbuster I was\nanticipating. But still Dawn of the Apes will surely please all with\nsome epic battle sequences and action scenes. In a summer of\nblockbusters with contrives scripts and plot holes Dawn of the Apes is\na relief and a pleasure!\n"},
{"review": "\nWhen I watched the Rise of the Planet of the Apes, I was pleasantly\nsurprised about how good that movie was. It had exemplary display of\nemotions and brilliant cgi with a strong storyline. By the end of the\nmovie, it left a viewer asking for more.<br><br>Almost 3 years later, comes its sequel. This one however does not live\nup to its expectations. The setting is more darker, with the apes now\nliving as a small community under thatched roofs in the redwoods. Their\npeaceful life gets interrupted when humans trespass their home (the\nwoods). <br><br>If the first one was about apes getting intelligent and smarter, with\nCaesar wanting a home for them in the woods, the second one is grim\nwith anger, betrayal, war and bloodshed. As in the first one, Caesar is\nthe center of attraction of the movie. The performance capture and\nmodern technological advances are well used. <br><br>In summary, good for a watch or two; but not as brilliant as the first\none.\n"},
{"review": "\nRidiculously stupid idea. This movie took me to the times when I was a\nkid &amp; watched movies like the power rangers depicting the human race\nlike a- holes who can't do anything at all &amp; there is this evil monster\nwho wants to eat all of them. Half of the movie was OK but then\nsuddenly I see an evil ape riding a horse with two guns laughing like a\nlunatic, seriously, I started to laugh in the cinema, it no longer\nappeared as a serious movie. All I saw humans do was just act like\nzombies, I could just not digest the idea of seeing the human race so\nhelpless far from reality &amp; so far below in intelligence from talking\napes. Its not the 1980s!! A typical 1980s movie where all humans do in\nmovies is run for their lives\n"},
{"review": "\nThe movie briefs the two ways of living with Man and Apes in the first\nhalf. The Apes are isolated themselves in the forest from the humans\ncolonized. The humans in abandoned cities with decreasing resources day\nby day. When it happens when some man happens to enter the forest and\nmake contact to the Apes one shoots down one of the ape in panic. The\nleader of the Ape has family values and peace on top of the rivalry and\nsends them back. <br><br>The story begins there and travels through a series of events involving\ntrust and Anti trust between humans vs apes and also within the same\nspecies.The second half keeps you occupied with the action sequences\nbut there is no suspense element of what will happen next in the movie\nthat will keep the audience in the edge of the seat. With especially\nbetraying clever traitor Koba on the characters it could have been any\nway the story could have been taken but it was taken in a very\npredictable way. There was some intelligence in the climax making path\nfor the sequel .\n"}
]