[
{"review": "\nThe title \"Focus\" had potential among the quantitatively declining Con-\nArtist genre. Although brilliantly centered and set up with a decent\ncast and setting - the execution of intelligent criminal activity was\npoor and often justifying or explaining trickery and illusion as \"he's\njust so good at it.\" - failing to satisfy the audience with an insight\ninto the brilliance that is a con-centered plan. <br><br>I love heist movies. I love intricate con movies. I love crime movies\nand I'm sad to say this doesn't really come close to fitting anywhere\nbetween those genres best and brightest. Instead you're left feeling\nslightly amused, slightly tired, slightly relieved that it's over but\nkind of happy you saw it anyway - I dread to think how badly this movie\nwould have been were it not for will smith.\n"},
{"review": "\nLet this movie serve as a cautionary tale for dummies who want to make\na con artist movie\u0097Don't. You are out of your depth. <br><br>This movie made no sense. The romance in it made no emotional sense and\nwas not set up properly. The twist was obvious, and made no sense. See\ninstead: The Grifters, The Sting, House of Games, Oceans Eleven, The\nSpanish Prisoner, Film Flam Man, Match Stick Men.<br><br>Whoever in New Orleans agreed to have this shot there did not read the\nscript. It portrays New Orleans as the leading American city in which\nto get your valuables jacked.<br><br>If you believe someone could pull your wedding ring off your finger\nwithout you noticing it, you will maybe like this film.<br><br>If you still insist on seeing this, check your logic at the door or be\nprepared to be angry. Don't say you weren't warned.\n"},
{"review": "\nFocus is a con movie and it's at its best when it's trying to con you\ninto believing you know what is going to happen. The plot unfolds at a\nsteady pace and you are left guessing what is going to follow. There\nare many twists and it's hard to keep up, as you would expect. <br><br>The regular cons work best in the first half, when the movie is trying\nto be fun and entertaining. During the second half of the movie the\nplot deepens and works around character development. That's when Will\nSmith and Margot Robbie come to life, they are at their best when they\nare given more to work with and they keep the movie interesting.\nHowever the movie gets caught juggling too many cons which by the end\nof the movie may feel just a bit flat; but still make for an unexpected\nand enjoyable finale. <br><br>Definitely worth watching. PS. The directors did a good job showing the\nimportance of FOCUS in keeping the camera Focused at the right place.\n"},
{"review": "\nI watched the first 40min and was already bored, what was supposed to\nbe a fun introduction was sadly uneventful. The most exciting scenes\nweren't all that exciting. Plot was to say the least confusing. He\nrejects her and gives her the money, she is devastated. Next he sees\nher during a job, she rejects him, he is chasing her, without any\nexplanation, suddenly Nicky is madly in love with her and there was no\nindication of that whatsoever.Also Nickey completely forgets about a\nbig job he is supposed to do. And that only makes sense because he is\nnot good at 'expressing his feelings'. In the end, they are together\nand in love and have forgiven each other everything. Really confusing.\nI found myself forwarding trough some scenes after that first 40min. I\nusually watch every minute of every film i start , even bad ones but\nnot this one. I love Will Smith but this was disappointing. It needs\nmore thrill, action and a plot that makes sense. Not recommending this\nat all.\n"},
{"review": "\nComplete loss of time. Good actors won't save such a bad story. No\nwonder the movie could barely paid production costs, by the way too\nexpensive for what was presented.<br><br>Nothing at all to remember but the scenes with Margot in bikinis.<br><br>Really impressed how movie distributors can go along trying to push\nsome movie like that into the market.<br><br>Will Smith only resembles himself on this movie and Margot does what\nshe can , be a bimbo girl.<br><br>This is a bad film and I do believe your enjoyment hinges even more on\nyour expectations when going into it<br><br>Good actors, not acting that well here and that is all.\n"},
{"review": "\nNot really sure how this film has got some poor reviews. It was clever,\nfunny and overall kept my focus (Pardon the pun).<br><br>Will Smith is fantastic in this film, not being an over-exuberant\ncharacter, which I feel some people were expecting in this film. His on\nscreen relationship with Margot Robbie was very good, and I feel she\nhas not got as much credit for this film as she deserves. <br><br>Some fantastic camera shots, and great locations add a little bit extra\nto this film.<br><br>I would advise not listening to reviews and going to see it for\nyourself and making the decision on your own. Enjoy!\n"},
{"review": "\nOn a Sunday afternoon, me and a couple of friends felt like going to\nthe movies... <br><br>We decided that this movie should be a pretty safe bet.. Will Smith in\na high-budget action movie.. That just cant go wrong?<br><br>Well we were wrong.<br><br>This movie was so bad that we joked about it on our way home to make an\naccount and write a review on IMDb.. AND HERE I AM - DOING IT.<br><br>If you can watch the first 30-40 minutes without feeling like walking\nout, I give you credit. We actually felt awkward for most of the\nmovie..<br><br>The fact that this script got through to Will Smith and he accepted..\nThat is just mindblowingly unbelievable.\n"},
{"review": "\nA con movie, who doesn't like a good con movie, well in this case my\nwife wasn't too thrilled about it, I think it was moving too slow for\nher, in her defense many other movies with the same plot has a way for\nincluding more action and excitement. This film is slowly moving\nforward, giving a lot of room for the plot and story to unfold, but the\npace is not high, there are certain scenes more fast moving, but in\ngeneral it is strolling along, minding its own business and doesn't\nreally care what others think.<br><br>I actually found it entertaining, even though I usually like more\naction and a faster pace, but in its own subtle way it was just a good\ncon story. They try mixing in some romance and that doesn't really work\nfor the story, it does add something to the plot, but it seems a bit\ntoo obvious that it should influence the parts it does.<br><br>All-in-all it is an okay movie, entertaining, funny and well acted, but\nit never gets really exciting, it never gets really up there, it just\nstays at okay good entertainment for a couple of hours.\n"},
{"review": "\nPoorly written, same cliché con movies as others. Poor acting, they\nneeded a better supporting actress, Margot Robbie is eye candy only.\nThis movie is slow, don't waste your time. I wished Will Smith would\nhave passed on this one. Horrible, horrible music set to this movie. If\nyou want a good snooze then this is your movie, so slow it would put an\ninsomniac to sleep. I got in for free and still couldn't sit through it\nand walked out. Wow just when you thought Will Smith couldn't do a\nworse movie than, The pursuit of Happiness, he does this movie. This\nmovie sucks, crap, the writer should be shot. Everything about this\nmovie was poor and I cant reiterate enough on how you should stay away\nfrom this one.\n"},
{"review": "\nI just thought that this attempted to be like \"Oceans\" but was no where\nnear clever enough, I honestly got bored thought the plot was thin, and\nwhilst the leads were both beautiful they had nothing to work with in\nterms of plot or script. The twist isn't really a twist more of a\n'tw..' as it is so painfully obvious...... yea the clothing and\nlocations are good but this film needed to deliver a bit more. I think\nthat the supporting actors were amusing (ish) but there were very few\nactual lol's... I think most people stood up at the end of the movie\nand were like is that it???<br><br>Like both actors, but wouldn't bother with this one.\n"},
{"review": "\nThe cinematography was beautiful. The locations, the sets, the\nwardrobes, <br><br>the sound, the lighting (very Good), the supporting cast...all was very <br><br>good. The story (which should be thee MOST important thing) was very <br><br>average. The Chemistry between the leads was non-existent. It was\nobvious <br><br>that they were trying to create an obvious lack of heat. That killed\nthe <br><br>film. Two usually very good actors, were forced to create an unusually <br><br>strained and uncomfortable relationship, that didn't ring true for a <br><br>second, on the big screen.\n"},
{"review": "\nOrdinarily, I like to take my time writing reviews, looking for at\nleast one interesting element to discuss. Focus won't be getting that\nrespect from me. Its runtime was (mercifully, a little less than) two\nhours I will never get back. <br><br>I don't want to lay the blame with Smith or Robbie, who both do good\nwork here. The issue has to do with construction. Simply put, the\nscript fails to sell us on the movie's central romance, which appears\nto boil down to \"you're fun to hang out with and to screw, so of COURSE\nwe're soulmates.\" Without the foundation of a believable (or even\ncomprehensible) relationship, this movie ends up being empty. In\naddition, the script meanders and doesn't really kick into high gear\nuntil over an hour in.<br><br>Bottom line: The charisma of its leads can't save it. Skip this!\n"},
{"review": "\nAbsolute boredom. This movie tries to be cool so much, it completely\nfreezes after about 3 minutes. Have I ever been left so uninterested by\na film before? I vaguely remember I saw something similarly bland\ncalled The Tourist some time ago... Why bother shooting something so\nunoriginal and cliché??? <br><br>Will Smith just keeps on sinking... I can't even remember if I like him\nanymore. It seems like he doesn't really bother to act anymore. His\nrenditions are so dead and all so much alike. He never seems\nemotionally invested at all, always keeping it cool. How can I relate\nto such inhuman person? <br><br>The rest of the cast doesn't even deserve to be mentioned. I implore\nyou! DO NOT WATCH!\n"},
{"review": "\nFunny. Not meant to be. Shows how a gang of thieves can relieve people\nof their watches/purses/money/the food in their mouths all by amazing\nfeats of sleight of hand. Nobody can do stuff like that. They can in\nthe movie. I stopped watching it after it became nothing more than a\npissing competition between Will Smith's character and some other guy.\nWaste of time. Waste of good actors. Depressing to see such obvious\nerrors dominating the movie-this is the first time I've seen WS in an\noutright bomber. Not even a really cute cutie pie sidekick saved this\none from lining the proverbial birdcage. Sometimes if a movie was bad\nI'd play with my popcorn-maybe you do it too. Lol.\n"},
{"review": "\nWell,this movie is not what I expected. I thought that Will Smith is\ngonna make it spicy but definitely NOT.I was sitting in the cinema and\nasking myself what is happening? Honestly,there are no action,nothing\nthat will make your breath away. Will Smith is good actor that's\ntruth,but this movie does not show his ability to act. Maybe I am wrong\nbut really I was disappointed.There are nice moments when you have to\nuse your brain but that's all.Margot Robbie as actress is good but\npredictable. Her part is really predictable.My sister and I wasn't very\nenthusiastic so,I don't know what to say to people who does not watch\nit. I regretted for watching it,but if you watch it,maybe you will like\nit,it depends on what do you like to watch. I am a girl but this movie\ndoes not satisfy my needs XD\n"},
{"review": "\nI would give the rating zero or even minus if I could, This is a total\nunrealistic dumb movie I have seen. Everything I have seen in this\nmovie is made for people with very primitive mindset, of course but\nthis could be a superb movie ever made for some folks but it depends on\nthe mindset of the viewer. I am not going to point out case by case\nwhere these pathetic unrealistic scenes are because otherwise my review\nwill be flagged as a spoiler, anyway lost the faith and the respect I\nhad for Will Smith, he was a true star back in those days, but not\nanymore. Just ignore this movie, its a total time waste, this is just\nan unsuccessful creation.\n"},
{"review": "\nSophistication, well developed and exciting are just some of the things\nthat you won't get from this film. The premise is far from interesting,\nbelievable nor is it new or done well. It was so easy to see what was\ngoing on from the start with this film. The several attempts to make\nthe audience wonder who was playing who are so evident, that the\nsurprises are more like a delayed plot that the audience has already\nfigured out. The pacing of the film is off by a long way and so the\nfilm lacks any real momentum when it is heading towards the climatic\nscenes. This culminates in yet another poor film from Will Smith and\nanother pointless film from the most uncreative time in cinemas\nhistory. It's films like this, that really turn me away from the US\nfilm industry.\n"},
{"review": "\nAdmittedly, I went into the theater not expecting much...but was hoping\nfor a requiem performance by Smith after \"After Earth\". Unfortunately,\nI was right before going in. He had the same \"I'm Mr. Box Office King\"\nattitude and it was impossible to overlook. As in previous movies, it's\nfelt as if the supporting actors are trying everything in their toolbox\nto pull the thing off...or maybe that's the director sensing a bomb.\nUnfortunately, she doesn't have the experience or presence to pull it\noff...yet. The plot was catchy, the photography was top-notch but it\nstill came across as just another con-movie with the sexual innuendo\nover-played and the box-office value of the star over-anticipated. I'm\nbeing very generous in giving it a 3.\n"},
{"review": "\nIt's hard to describe just how bad 'Focus' is. The wrong star goes\ntopless throughout the movie. The chemistry between Will Smith and\nMargot Robbie is less natural and warm than that between Nancy Pelosi\nand Dick Cheney. He, feeling the cold breath of age, pushes the limits\nof a May/December romance with Ms. Robbie, in more on screen make out\nsessions than a Friday night at the Satellite Drive In back in high\nschool. I looked for a chap stick product placement but may have missed\nit during my nap. The plot is more lifeless than the kind found in a\ncemetery. In general, 'Focus' was so boring that it encouraged the\nconjugation of obscure Latin verbs, and recalling second cousins. Half\nthe audience left after Will's fifth wander about his hotel room in\nsearch of a shirt. I stayed until the bitter end, feeling bitter about\nthe cost in time and money associated with a movie that sails between\ntedium and apathy to steal a line from 'Mr. Roberts'. Oh, and, pay\nattention to the witty back and forth between the romantic leads, and\nif you hear anything remotely witty, do tell.\n"},
{"review": "\nI personally liked the film, almost all the time to the end half of the\nitems were not clear, very confusing, but fortunately everything in\nfinally revealed. The ending left a little unexpected, even Moreover, I\nwould certainly not suggest that everything could get it as happened.\nBut there were moments when the watch was boring and there was no\nsomething interesting on the screen. The father of the protagonist\n\"appeared\" quite unexpectedly, though some might and might assume that\nhe was to appear. The acting became rather not bad, but sometimes feel\na certain banality of the story, even though he proved to be\ninteresting and confusing. (sorry for google translate)\n"},
{"review": "\nFocus is a very well put together movie. The acting is good. The\ncinematography is excellent. The costumes, sound, production etc. are\nall top class. The lead actors are beautiful, and we see enough of both\nof them to satisfy any gender preference.<br><br>The problem is the script. It is just plain ... bad. It's predictable\nand relies on the same clichés throughout. The result is, it's\ndisappointing and the end is, frankly, ridiculous. I'm all about\nsuspending belief while watching a movie, but this is a 'con' movie,\nnot a fantasy movie.<br><br>Overall, I would say that it's reasonable escapism and worth 105mins of\nyour time. But, wait until you can either see it at a 'cheap' cinema or\nthe DVD has been reduced - which probably won't take long.\n"},
{"review": "\nI've seen hundreds of movies from all over the world. There are some\nreally good actors, directors and writers in Hollywood as all know. And\none of them is Will Smith. But this movie is a total shame. You will\nrealize all the movie in first 5 minutes.<br><br>I don't know what the production imagined, may be they just wanted to\nearn money that's all for them. But Will Smith is a well known actor.\nAnd this movie is a total shame for him. Looks like he is doing the\nsame mistakes as Bruce Wills.<br><br>Do not spend your time to watch this..<br><br>Just shame on Will\n"},
{"review": "\nThere's been plenty of good quality con movies, the best I ever seen is\nDirty Rotten Scoundrels with Michael Cain and Steve Martin. The title &amp;\nthe ads for this movie said one thing &amp; we end up something so cheap &amp;\nshort it was unreal. I preferred Steven Segal's action movie Half past\ndead 12 years ago, which a lot of people think that stinks and I'm not\none of them. At least that one had a decent storyline in comparison\nthat followed through.<br><br>Spoiler alert: If you are expecting like the reviews suggest that Jess\nis supposed to turn the tables on her mentor for the most brilliant con\n&amp; those around her, you didn't come to see this movie.\n"},
{"review": "\nIf you are in the mood for a heist/con film with a classy style, I\nrecommend 'The Italian Job'. It is perfect when you want to watch a\ngood film in a relaxed mood. 'Focus' is quite the opposite. It is\noverly-sexualized, and quite frankly, the storyline is completely\nmuddled. Random relationships fly out of nowhere and whilst starting\nquite light-heartedly, it becomes disastrously awkward. The first\nhalf-an-hour of the film is actually promising, but as the relationship\nbetween Margot Robbie and Will Smith develops from nothing at all, the\nfilm loses focus (pun intended :)). This film should only be watched if\nyou leave your brain elsewhere; and even then it is not worth the\nwatch. 3.0/10\n"},
{"review": "\nCatalogued as comedy, crime, drama. Well for one comedy it is for sure\nnot. Didn't laugh once and I am sure you won't either. Crime, yeah\nokay, if you can see it like that, because honestly the way they con\npeople is absolutely not doable. Or you must be a complete idiot, but\nthen again how did you gather that much money if you were an idiot?\nDrama, yes that for sure, a lot of drama about nothing. In other words\nI was expecting a lot more of this movie. It's all much too cliché, the\nplot is not good enough compared to similar movies. Because there are\nway better movies with the same ideas then this one. It's an okay movie\nif you have absolutely nothing else to watch, but otherwise don't waste\nyour time on it.\n"},
{"review": "\nTedious application of music that does not apply to the scenes makes\nthis movie almost unwatchable. We get it, he's a lonely man, we don't\nneed the soulful Sax in every romantic scene, nor the lounge act music\nat every nightclub. Let the movie develop itself instead of forcing it\ndown our throat with these not so subtle nudges. I would have paid\nextra if they filmed Music Coordinator getting fired while that stupid\ncruise ship lounge music played one last time.<br><br>Tries to be too stylistic instead of just telling a story that actually\nhas an interesting plot. Minimal character development outside the two\nmain, even though these supporting characters play a pivotal part.\n"},
{"review": "\nI cannot express in words how horrible this waste of time was/is! We\nkept watching just because we kept hoping it would get better. Hell the\nbar was set low and kept getting lower as the movie went on. You would\nhave thought a movie with Will Smith would have at least been a half\nway good one. But oh no it was beyond bad. Character development was\nvery poor. Come on the whole black man with a white blonde girl - so\nstereotypical! Oh then to top it off it is a black man who was homeless\nand raised by a white man. Can you get anymore Brad and Anjolinaish?\nThe story was riddled with corniness throughout. My eight year old\ncould have written a better script with crayons on a paper napkin. Will\nneeds a better director to help bring out his best. Oh and one more\nthing - this was way too much hitchish as well. If you like Will as a\nknow it all who teaches someone else how to do something, then this is\nthe movie for you. Otherwise keep on walking and spend your money on\nsomething which can leave you feeling good or at least numb your senses\nenough to watch crap like this.\n"},
{"review": "\nFOCUS Excellent Actuations from Will Smith and Margot Robbie. The first\nhour the movie is spectacular, the rest it's just looks like the script\nwas finished in a hurry. This movie could been pure gold, if it would\nhad followed the path it had at the beginning. I was really\ndisappointed at the end. Cinematography is nice, they have some takes\nplaying with reflections which i liked very much. I give this movie a 6\nbecause the actuation and some shots are worth to watch. If you want to\nsee really good actors and 1/2 a shitty script, here you have it. Don't\nWATCH IT EXPECTING SOMETHING. a one time to see movie, And Margot\nRobbie's hotness is worth the ticket.\n"},
{"review": "\nIn the midst of veteran con man Nicky's latest scheme, a woman from his\npast - now an accomplished femme fatale - shows up and throws his plans\nfor a loop. The first time i saw Focus i absolutely hated it but as it\nturned out the 2nd time was the charm the movie was awesome really\nfunny and 2 great leading performances by Will Smith and Margot Robbie\nand it really doesn't surprise me that they worked again in Suicide\nSquad and they had such a great chemistry. This movie has a long\nbackstory it was originally going to star Ben Affleck and Kristen\nStewart but they both dropped out but i think one way or another the\nmovie would be really great. It does have flaws tho with the ending a\nbit that i won't spoil but still a pretty great movie 9/10.\n"},
{"review": "\nNot being a Will Smith fan I put off watching this film for a long\ntime. With nothing else to watch I decided to watch it. It was a fun\nfluff piece. Entertaining with some twists I didn't see coming. Just a\nfun entertaining film. The stunning Margot Robbie is who carried the\nmovie. She is an up and coming rising star who hopefully will not\nthrive on bimbo roles. I think she can carry the heavy loads just as\ngood as Will Smith can. The movie had some good quick wit that Will\nSmith is known for, Margot held up her end perfectly. All in all, a fun\ntwisty ride that you didn't know the ending until it slapped you in the\nface. That's rare these days.\n"},
{"review": "\nI was disappointed with this film. Beautifully shot, the pace was good\nand the clothes and actors pretty to look at. However the plot was\naverage and done many times before, much better. The big scam was\nconfused and unbelievable. The 2 leads , the gorgeous Margot Robbie and\nWill Smith lacked any chemistry. Will' s performance was wooden\nthroughout and his character lacked any credibility. They came across\nmore like cousins than lovers. I think Will let the film down. In a\nnutshell this film was a big yawn<br><br>Margot Robbie acted her heart out and allowed one to keep viewing as\ndid some of the supporting cast. However the premise of the movie was\npoorly executed overall. This is no Oceans 11 A big waste of time.\nDon't bother with it\n"},
{"review": "\nI needed three separate occasions to finish the film. The first part,\nwhen the characters are introduced and the tone of the movie is made\napparent, I could still muster interest to follow even though the lines\nwere quite dull. The gimmicks and heists probably helped keep the\ninterest, but I could never maintain that they are above average in\ncomplexity. Will Smith and Margo Robbie go well together, still they\nonly played their part fairly well. The second part is long and full of\nclichés and if it were not for the great outfits and some comical\nmoments, I would not have made to the last part, which does offer a few\nmoments of surprise. All in all, not a good film, but eventually\nwatchable. What I like most was the playfulness of the story. If it was\nintended to not take itself too seriously than it did a good job.\n"},
{"review": "\nI read the mixed reviews on this one but decided to go ahead and buy\nthe blu-ray anyway because film choice is subjective and I thought this\nlooked like a bit of glossy fun. Unfortunately it's just one of those\nfilms where the magic doesn't happen. I think the basic story is a bit\nmuddled and while the two leads do a good job the material they have to\nwork with just isn't good enough. The characters are not well developed\nand while there are hints of backstory there isn't enough for the\naudience to latch on to and start rooting for them. The con aspects are\na bit far far fetched and seem to hinge on the premise that if you\ncatch someone's attention with some sort of distraction you can\nbasically relieve them of their wallets, watches, rings, contents of\nhandbag etc. All a bit too silly. I love films and I am happy to watch\nanything in the name of entertainment but this one doesn't make the\ncut.\n"},
{"review": "\nThe strongest thing about \"Focus\" and the one thing that made it an\nabsolutely great film is the performances from Will Smith and Margot\nRobbie. Separately they are incredible but when they get together they\nare a force of nature and really make scenes very engaging and\nincredibly addicting to watch. This easily could have made for a great\nfilm but being this film is about con people doing con stuff, you kinda\nneed some conflict and a flashy and neat con to go with it. This film\nachieves this on a case by case basis and has some cool con scenes but\nthe major con, the focal point of the film in the final half, feels\nvery weak and isn't as developed or feathered out as well as some of\nthe minor con scenes that occur earlier in the film. This ends up\ncrafting a weak point of conflict for the characters and it makes for\nan antagonist who barely feels like he's in the story. \"Focus\" is a\ndecent movie with some absolutely awesome acting in it but it fails at\ndoing what films about con men (and women) are suppose to do\u0085and that\nis actually have a cool con going on.\n"},
{"review": "\nFocus the 2015 movie starring will smith and margot robie directed by\nGleen Ficcara and John requa was one of the biggest Box office hits of\n2015 winter movie season. first of all lets talk about this movie\nadvantges . some of the humor worked for me personally the\ncinematography a good soundtrack a pretty good entertaining first\nact.But the movie suffers from trying to be smart and twisted for\nexample for example (spoiler alert spoilers in capital letters)IN THE\nFOOTBALL GAME SCENE WHEN WILL SMITH WAS EXPLAINING HOW DID HE TRICK THE\nGUY WHO WAS BETTING WITH HIM AND ALL ABOUT HOW DID HE SURROUND HIM WITH\nTHE NUMBER 55 THE MOVIE WAS TRYING TO BE SMART BUT FAILS WITH A FAIRLY\nBIG PLOTHOLE.IF THE MOVIE IS TRYING TO BE SMART WHY DID THEY EXPLAIN\nTHIS TRICK JUST AFTER IT HAPPENED WHICH IS A CLUE FOR SOME POOR\nWRITING.At the end the movie falls a lot in its last half failing to be\na smart movie and treating the audience like dumb people.\n"},
{"review": "\nWill Smith as a master con man and the alluring Margot Robbie as his\nprotégée have chemistry and it's quite fun to watch them. It's\ninitially fun to see them pull of their scams and petty thefts. There\nare cute little surprises along the way. The filming is stylish and the\nlocations are nicely used from NYC to New Orleans to Buenos Aires. The\nleads have chemistry together, but who wouldn't have chemistry with\nMargot Robbie? The supporting cast is good too with Gerald McRaney and\nRodrigo Santoro. BD Wong is quite different from usual as a big time\ngambler.<br><br>Unfortunately the ending is just too fantastic to fit into the story\nand is a let down. If things had been more believable it would have\nbeen worth a watch.\n"},
{"review": "\nFirst of all I would like to say that I bought this movie thinking it\nwas a tense thriller but how wrong I was. It was a good movie for\npeople who like those sort of movies. It was alright up to the bit\nwhere they met up again. It is hard to tell who is the actual villain\nas the main character gets shot at the end and then the guy who shot\nhim ended up saving him. I did like the scene where they were at the\nmatch and they started doing some serious bets but that was about the\nonly decent scene for me. The cast was good and Will Smith did\nbrilliant but I didn't quite like the guy he was acting for. It was\nquite clever but if you like action thrillers then this movie it not\nfor you.\n"},
{"review": "\nMaster con-man Nicky 'Mellow' Spurgeon (Will Smith) is intrigued by\namateur thief Jess Barrett (Margot Robbie). He shows her a few moves.\nShe tracks him down later which he expected. She begs him to be her\nmentor and he lets her into his crew running cons in New Orleans.\nHowever at the end, he leaves her behind. Three years later, he's\nrunning a con and is surprised to see Jess again in Buenos Aires.<br><br>This is meant to be a fun caper movie and it is just that at times. I\nreally like Margot Robbie whenever she plays up her fun side. Will\nSmith could smile a little more and have a bit more fun. They seem to\nhave fun flirting but the movie needs more moments of fun. This pairing\nhas potential which is not fully realized.\n"},
{"review": "\nReally awful! Stupid plot, too stupid, but I'm required to write 10\nlines. It starts slow, gets good for the betting part. I can't figure\nout how they could be at Super Bowl 17 in 2014 .... OK Maybe I\nmisunderstood XVII and football. Then the con at the end, is really\nstupid!!! So instead of using fake bullets and a blood pack, they\nactually shoot him, some how between the 3rd and 4th rib! Really, you\nwould have to be an expert shot with a handgun to pull that off. Also,\nhow the lead female character is the must gullible stupid chic in\nmovies. Don't waste your time watching this movie.<br><br>Here is my 10 th line\n"},
{"review": "\nFocus is not a really good movie. It's not a really bad movie either\nthough. If you don't have a problem with Will Smith (and his\nrelationship in this movie), you might be able to enjoy this. There are\na couple of things in here, that are nicely told and shot (like the\nexplanation or \"how-to\" guide).<br><br>We concentrate on Will Smith and the movie tries to keep things\nmysterious which works at times, though the resolution of most of those\nmysteries are mostly disappointing. If you don't care for that, there\nis light fun to be had here. The chemistry sometimes is not what the\nmovie will or would want you it to be, but overall it's a decent con\nmovie\n"},
{"review": "\nAny movie with BD Wong or Rodrigo Santoro is always worth watching. The\nmovie Focus has BOTH Wong AND Santoro, which makes it even more\nirresistible. And as a bonus, the leads are played by Will Smith and\nMargot Robbie, who also deliver engaging performances although their\ntalents are wasted here. The two Oscar nominees are not challenged to\nact other than simply be charming. The writing is sharp and sexy,\nalthough the story is clearly a far-fetched one. This flick is meant to\nbe mere entertainment, so don't bother wracking your mind trying to\nmake too much sense of the plotting. I also wish that the title is a\nstronger and wittier one, like Now You See Me was.\n"},
{"review": "\nSay adios to Will Smith as a blockbusting actor. The movie made\n3.000.000.00 profit on a budget of 50.000.000.00. Not enough to support\nhim. Why So little, you might ask? <br><br>Well the movie is bad. Simply bad.The story is thin. Really thin. I\nstopped the movie on 2/3, and had to push myself later to finish it.\nThere was nothing appealing to it. Not a single thing. OK, might you be\ngay, or female, then Smith without shirt would make you happy. However\nI expect more when something costs 50 million, not a picture of a guy\nwith a trained upper body. I am going to say it: I expect a good story,\nand good actors. In my opinion I could get a more real and interesting\nstory by just going to a bar and ask the biggest fraude there what he\nhas been up to lately. There was no depth to this script, as flat as a\npancake.<br><br>Will, did you not see this script was good for one thing: using it to\nlight up the fire!\n"},
{"review": "\nLet's be honest here--probably six months from now I will have\nforgotten I saw this ( and I only saw it because I was chaperoning a\nschool trip and didn't want to have to endure \"Get Hard\"), but I am a\nsucker for heist films and this does have some clever moments,\nparticularly a set-piece at the Super Bowl featuring the\nmuch-underrated B.D. Wong. In addition, Will Smith does indeed have\nsome acting chops, and he and Margot Robbie do have chemistry. I did\nsee the end coming from a million miles away, though, which is always a\nbummer with heist movies, the good one's having one last twist, Props\nto Gerald McCrenay, though, such a go-to slime ball.\n"},
{"review": "\nMy 1st impression of this movie, 'what's this?\".<br><br>for the 1st part of the movie, I really enjoy it, when Nick, Jess and\nrest of the team in action. Till the part of Li Yuan, it was good, all\nthe character, their act was good.<br><br>BUT, the 2nd part of the movie. I am asking myself, \"am I hoping too\nmuch from this movie?\" the cast act were really disappointing. the cast\nweren't like in their best performance.<br><br>well, beside all of that, I still can laugh from some parts of the\nmovie. but for me it ain't comedy or crime movies, it totally mixed up.\nfor me, it more to TV drama series that somehow pressed into a single\nmovie.<br><br>this is my personal opinion. I have no intention of insult anyone.\n"},
{"review": "\nFirst off , Will Smith absolutely played his course with these playboy\nroles. Im not buying it anymore dude. Secondly Margot is gorgeous but\nshe is too gorgeous to play a believable femme fatale. I felt the\nacting was outstanding for obvious reasons. But the films two stars\nweren't right fits for the parts i feel like. Big names , great faces,\nadd the amazing chemistry and this should have taken off as a great\nmovie. But it hasn't and I think the missing element was the fact that\nWill in unbelievable and so is she. <br><br>If the characters are not believable you do not have a movie. But i\nwill say it was well made, well acted and it wasn't too drawn out. I\nactually really liked it till i realized maybe a Ryan Gosling and a\nMara Rooney could have been a nice mix or a female that has an edgy\nlook mixed with the James Bond look. Idk , this just didn't do it for\nme at the end of the day. <br><br>Great intelligent intellectual story, Above average screenplay,Great\nlocations and filming dynamic-- automatically 7 star movie..\n"},
{"review": "\nThis was an OK film that was worth watching. I love films about cons\nand scams so I enjoyed most of what went on. The pickpocket scenes were\nvery well done and the actors obviously must have put in a lot of time\nto get these right. However the last 2 scams were disappointing.\nPicking a number scam if OK but no one in their right mind would gamble\nso much on what is a pretty flaky scam. And the final twist was way too\nrisky, the Will Smith character could have easily died and his Father\ntaking everything? Really? That said the acting and pace of this film\nwere good especially the Margot Robbie character Jess. Will Smith is as\nusual good enough.<br><br>This could be a TV series except it has already been done in Hustle and\nthe American equivalent that I cannot think of right now.\n"},
{"review": "\nThe film has the feel of a \"Con\" movie that really plays more upon the\nemotions than upon reality. Will Smith's character relies upon rather\ndubious techniques to win big gains. In real life, those \"Cons\" place a\nlot more of the risk upon the played, rather than the player. Even at\nthe very end, at the climax of the final scam, the entire Con depends\nupon a shot from a handgun being placed between the 3rd and the 4th\nrib, or something like that.<br><br>Margot Robbie turns in another stellar performance in this film, not\nlong after \"The Wolf of Wall Street\". It was nice to see Gerald\nMcRaney, in true \"Major Dad\" form, back in action as well.<br><br>All in all, the film was fun to watch, but had a manufactured and\nunbelievable plot.\n"},
{"review": "\nI loved Will Smith and Margot Robbie teaming up together for the first\ntime and Im excited to see them again in the film \"Suicide Squad\". I\nthought the storyline with this was too fast and really not getting to\nthe point of being a conman. Its like we see stealing first, then lying\nand then stealing again. What job were they actually doing?<br><br>I found the characters really, I liked how they were sneaky and smart\nin stealing peoples stuff while talking to them. It was funny when the\ntwo characters kept betting on BD Wong's character with lots of money.\nI would be wondering if that really is real money? I say, the cast will\nbe paid that much for taking part in the movie anyway so they can't\ncomplain! <br><br>Its an alright film, I would not consider this to be the best of their\nwork.\n"},
{"review": "\nThis movie really messed my brain, in a good way. The whole twist plots\ngot me thinking...\"what is it all this, what on earth just happened\"\nand the ironic part is that this kept me focused in the whole movie.\nThe actors did great , all of them, especially will smith and margot\nrobbie. The comical part of the movie was great too, it really got a\nsmile on my face. Don't expect much drama because if there is it wont\nlast too much. Also as many said it lacks a little bit of genre because\nthere is not a clear shot by what they actually want to do. In my\nopinion it could have been better but I didn't really thought it would\nbe that good by watching the trailer, so I really recommend to give it\na watch, you wont regret it.\n"},
{"review": "\nThere is a reason why \"caper\" thriller are so universally popular among\nthe audience. They are like sweets - they must be seriously bad to be\nperceived as bad. While the swindle in real life often viewed as a\ncrime (fully justified), the gentleman crooks and bandits brave\nadrenaline in fiction and sometimes the news harbor respect. The reason\nis clear: we are usually not the victims, we are too smart and / or\npoor for that. Their victims are rich or at least well-off people with\ncharacter flaws: unfaithful husbands, compulsive gamblers, greedy or\nsimply inattentive types. Focus is one such, average to solid \"caper\",\nwhich evokes memories of some of the older movies that is perceived as\nbetter, you might then time for their innovation, perhaps because of\nnostalgic patina.\n"},
{"review": "\nThere is nothing new about con-men and grifters in film, but the\ncasting of Will Smith and Margot Robbie, certainly creates enough\ninterest.<br><br>The premise of Smith's character, creating outcomes in his favor \"by\ndesign\" becomes completely implausible. Whilst the first act in New\nOrleans has some good moments, the final act runs out of steam and\nbecomes a little too far fetched.<br><br>At no stage do you really buy in to the chemistry between Smith and\nRobbie, which in the 2nd half of the film, is pretty much the only\nthing the film is asking you to care about.<br><br>If you want to see a good film about pickpockets, let me recommend\nOliver!\n"},
{"review": "\nWill Smith's latest film is clever, yet leaving you with the feeling of\nwanting more from it. Parts are definitely well told and the actual\n'conning' certainly brought a smile to my face. However, the problem is\nthat at times it doesn't seem to know what it wants to be. Is it a con\nfilm or a love story with stolen watches thrown in? This is where it\ngets bogged down.<br><br>On the plus side, as mentioned before, the scamming is definitely the\nhigh point of the film with a couple of twists and turns that will\neither leave you in shock or leave you sat there laughing.<br><br>The film peaks too early for my liking before finally being dragged to\na decent ending. Not the best film you'll see this year but certainly\nnot the worst. A good concept that should have been told better.\n"},
{"review": "\nI saw Focus a few days ago, after a friend recommended it to me. I\nthought, Will Smith, Margo Robbie, awesome thieves, speed and thrill..\nJust my type of film. And at first i was amazed. The plot is great,\nSmith has a talent of playing a d\"#khead/Mr.Cool. But further into the\nfilm, deeper into the plot i felt that the film started to get a bit\nover dramatic and lost much of the speed and thrill i found in the\nbeginning. <br><br>I give \"Focus\" 5/10, because of the loss of suspense and to much\ndirection change for me. Lastly i apologize for my English, grammar and\nstuff like that. <br><br>Peace!\n"},
{"review": "\nThis film, although far fetched, was kind of entertaining with the\nsuspense and the drama that was displayed through out it. Will Smith\nput on his usual acting charm to play the role of Nicky, a con man\nwho's plans are thwarted by a girl from his past. All of the acting in\nthis film was good but it wasn't enough to make it the film I thought\nit was going to be. There were some things in this film that were a\nlittle too far fetched as far as chance and betting goes. Now I know\nsome readers might say it's just a movie but in a crime drama film I do\nlike a lot of reality to be in place. The relationship between Nicky\n(Will Smith) and Jess (Margot Robbie) in this film was played out well,\nbeing that it was an important part of this film, but again, it still\nwasn't enough to make it the film I thought it was going to be. Now\ndon't get it twisted, it really wasn't all that bad. It is kind of\nentertaining just a little far fetched. I wasn't too disappointed.\n"},
{"review": "\nI am surprised to see IMDb rating it at 6.6. I rate it as at least 7.5.\nWill Smith &amp; Margot Robbie are really very good. There chemistry is\nexcellent. There are lot of surprises and I am sure no will be\ndisappointed with it. I'll not put it as must watch. I am surprised the\nway people are complaining. What you need is entertainment. Our life is\nalready very stressed then why to compare reel life with real life. I\nwas having less expectations from this movie as Will Smith had given 2\nunforgettable movies like After Earth &amp; I am Legend. Who cares for the\nplot just enjoy the movie. Besides that it still has lots of twists,\nturns &amp; bumps to keep you entertained.\n"},
{"review": "\nThis was an entertaining movie with decent acting and a good supporting\ncast. Wong and McRaney seem to shine no matter what roles they play.\nAlthough Robie tends to be marginalized as just a hot body, I found her\nto be convincing and sincere, especially playing off Smith, playing\nSmith yet again.<br><br>Now for the flaws. Why can't screenwriters stick with plausible story\nlines instead of interjecting nonsense? Robles character ostensibly\nshows up in second act to steal a watch and then uses cliché excuses to\navoid becoming intimate with her mark. This just seemed silly and\ninane. Then an evil minion visits a drug store, buys collision supplies\nin order to kidnap Smith and Robie for the tied to the chairs garage\nscene, lame. Lastly, Smiths surrogate father shoots him, shoots him in\norder to seal the scam. Better writing, please.\n"},
{"review": "\nthis was very entertaining, smith is a great actor, and you would\nexpect no less of him to be good. the other cast members were\nreasonably good at portraying the craft as well.<br><br>Script was OK, it certainly wasn't slick or factually consistent, but\nit really didn't need to be, it was pure entertainment, and it achieved\nthat.<br><br>Margot Robbie..... my god, what a beauty. Im sure others actresses\ncould have pulled this off, but having seen her in it, i don't believe\nthey would have done it justice, she was brilliant... believable (and I\ndon't believe Australia's who learn to act in AU can act) so she must\nbe from new zealand, or even tasmania maybe, because she can act....\nand she is smoking hot.... cant wait for her to do more films, she is a\nreal A lister now..... great work, bring more on.... I might even get\nthe old seasons of Neighbours!\n"},
{"review": "\nAfter making us laugh with the unconventional romantic comedy 'Crazy,\nStupid, Love', the Ficarra/Requa pair switch the tape to a comedy-crime\nflick that keeps their game up as well.<br><br>It's your typical love story in not so typical romantic standards, as\ntwo thieves played by Will Smith and Margot Robbie fall in love after\nthe first one teaches the latter how to make a criminal living.<br><br>The story has some very interesting twists that you didn't see coming\nand Will Smith fuels this big time as the cool and smooth Nicky.<br><br>'Focus' never stops pumping. It's pure entertainment with pace, rhythm\nand flair. Somewhere between Guy Ritchie's 'Snatch' and Matthew\nVaughn's 'Layer Cake', less violent, sarcastic or crude. And with a\ntouch of some Hollywood love.<br><br>Oh, and did I mention it features Margot Robbie?\n"},
{"review": "\nA nice romantic thriller by Will Smith, and I must say a good comeback\nespecially after the \"after Earth\" setback. This movie has a good\nmixture of romance, thriller, crime and humor. I personally would not\nrate it in, as a comedy genre. Of course a few humor here and there is\nalways required for a film to be successful and this movie perfectly\ndelivered on it. The movie is very fast paced and kept me engrossed\nthroughout, especially in the first half of the movie. In the first\nhalf, well looking particularly to a scene few references can be drawn\nwith respect to the \"Now You See Me\" movie. But all the cons or theft\nplayed were beautifully scripted and made me wonder \"is this happens in\nreal life to, I should be more careful\". My Verdict: A must watch film,\nwill not be disappointing.\n"},
{"review": "\nFocus<br><br>The best way to catch a pickpocket is to fill your pockets with Krazy\nGlue.<br><br>Unfortunately, the cutpurses in this dramedy are too quick for the\nadhesive properties.<br><br>When a green grifter, Jess (Margot Robbie), fails to swindle a veteran\nconman, Nicky (Will Smith), he takes her under his wing \u0096 and into his\nbed.<br><br>Introduced to his associates, Jess uses her allure to distract marks\nwhile Nicky's crew steals their valuables.<br><br>But when Nicky uses Jess in a con without her knowledge, the pair part\nways. That is until a motorsport scam Nicky is working on reunites\nthem.<br><br>Part love story, part comedy and part caper, Focus has a hard time\nfocusing on what it wants to be.<br><br>And while the dialogue is snappy, the decisive con is painfully obvious\nfrom the get-go.<br><br>Incidentally, if a stranger's hand lingers in your pocket, you're not\nbeing robbed - you're being molested. <br><br>Yellow Light\n"},
{"review": "\nFocus was a movie with out any real plot, except a 'love story' between\na rookie con artist and a master con artist. I'm not sure weather I\nfell asleep or if I'm right about it. None the less it kills time and\nthere are some fun scenes where the crimes are well coordinated. It's\nnot something I would watch again and it's not something that I would\nrecommend if you wanted to see an exiting film, it has very dull bits\nand will smiths character has no charisma. I cant even remember the\nending and I only saw it a couple months ago, it's something about his\ndad working for the corrupt car dealer and then he's in on the con or\nsomething. You could put this film on in the background of what ever\nyou're doing and still have as much a clue of what's going on as if you\nwere really focusing (pardon the pun).<br><br>I rate the film: Meh...\n"},
{"review": "\nFocus is a 2015 American romantic comedy-drama film written and\ndirected by Glenn Ficarra and John Requa. Starring Will Smith, Margot\nRobbie, and Rodrigo Santoro.<br><br>Nicky (Will Smith), a veteran con artist, takes a novice named Jess\n(Margot Robbie) under his wing. While Nicky teaches Jess the tricks of\nthe trade, the pair become romantically involved; but, when Jess gets\nuncomfortably close, Nicky ends their relationship. Three years later,\nNicky is in Buenos Aires working a very dangerous scheme when Jess --\nnow an accomplished femme fatale -- unexpectedly shows up. Her\nappearance throws Nicky for a loop at a time when he cannot afford to\nbe off his game.\n"},
{"review": "\nFocuse<br><br>Great movie<br><br>This movie so great Director and writer took us from the level of A\nparticular focus of the most unexpectedly Not expected Many elements of\nsurprise We didn't expect what will happen No doubt the moment by some\nrepresentatives associated with each other as one family Thank will\nSmith to play the dazzling Everyone was cool We thank the many thought\nwrote the scenario of the great many issues put for fun cinema, are\nalready moving to us this fun, we thank them very much I have also the\nproblem of theft that she treated them talked a lot, and this alert to\nguard against all people, even the people discover new phishing\ntechniques and professional groups in the theft, we make such a great\nfilm\n"},
{"review": "\nA con man meets a young woman who asks him to teach her his tricks.\nAfter a big con business in New Orleans, however, he breaks up with her\nout of the blue. The two of them will meet again, but this time she\nwon't be needing his help. So, the movie was a little odd for me. I\nusually like con movies, like the Italian job, or ocean eleven but this\nis something like the brothers bloom, well, a little better than\nbrothers bloom, but still not as good as the others. The story lacks of\neverything. First of all consistency. When did Nick fell in love with\nher? Why did he abounded her back then? The whole thing is weird. I\nmean, I really didn't get what the movie was about. The cons were\nclever and enjoyable, but that's it. No depth on the characters, no\ninterest and no action. Maybe I've got too picky or the movie was\nsimply not good enough.\n"},
{"review": "\n'Focus' is a good-looking, well-shot film, but eventually, its soulless\n&amp; confused. It works wonders as a Con affair, but falls flat when it\ntries to be a love-story. <br><br>'Focus' Synopsis: In the midst of veteran con man Nicky's latest\nscheme, a woman from his past - now an accomplished femme fatale -\nshows up and throws his plans for a loop.<br><br>'Focus' has 1 ace &amp; that's Margot Robbie. She, besides looking\ngorgeous, delivers a delicious performance, that's both, attractive &amp;\ndeceptive. But, the same can't be said about Will Smith. While sharp\nwhile conning, he's lack luster during romance. To say he's been better\nbefore, would be an understatement.<br><br>'Focus' had the tapping's of becoming a fine film, but its love-story\nis so dull, that even the merits otherwise don't stand out. But Robbie\ndoes. Watch it for her.\n"},
{"review": "\nThe story itself for me is nothing new since it's not as good as other\ncon movies like the Ocean series. The second emphasis on the romance\nfeels little bit thwarted in focus compared to the grift and con crime\nfocus. What makes this movie interesting is instead the live action\ndepiction of the smaller time pickpocket teamwork and the attention\ngrabber scenes. Those really gave this movie a differentiation and set\nthis movie apart from other con artist movies. The acting overall is\njust a decent job. Will Smith did quite okay here, he used his usual\ncharacter as the one in Hitch. Margot Robbie did also quite nice here\nsince her last appearance at Wolf of the Wall Street and About Time.\n"},
{"review": "\nI don't know what I was expecting, maybe something along the lines of\n\"Enemy of the State.\" This movie was slow, Will carried it okay, but it\nwasn't the best script or plot. The girl was a knock-out, but would\nhave liked to have seen a Latino woman, maybe because I could see\nmyself in that role, if I were 30 years younger and 50 pounds thinner\nthat is. LOL It had it's funny moments, but I should have waited to\nwatch it on Netflix rather than going into town. Not worth the theater\nticket, but okay for a boring Saturday afternoon at home. W. Smith\nhasn't really done a good movie for awhile. I think we can add this one\nto his list of bad ones, but I still think he still has some great\nmovies in him.\n"},
{"review": "\n*** May contain strong spoilers ***<br><br>I like Will Smith. He has such a good laugh and presence. \"Focus\" is a\npiece of a professional entertainment playing in the step below the big\nleague. The piece starts off with recognizable topics and characters,\njust to spin off in another direction... or is it? The research of the\ncriminals, the characters, the personalities and the psychological\nissues behind the story is solid. Could have been even more; as it is\nit is good enough. One character in the movie is a big foreigner that\ncomes with the most hysterical \"I am honest and straight forward just\nto confuse you\"- type of guy. Great! The question that comes through\nthe screen and lands in the knee of the observer is as follows; who is\nwho, and who is really who...? <br><br>Summary: A good story with twists and roll-overs. A while, there were\ntoo much of a regular \"rip-off criminal movie\". Will Smith is good, so\nare the other actors. Farhad; laughs!<br><br>6,8 out of 10\n"},
{"review": "\nSurprisingly good! Excellent profanity, and good supporting cast. Hot\nchick, too.<br><br>Farhad does a good turn as best friend and partner. He is adept and\nhighly watchable. <br><br>And where can I binge watch PanAm? I guess that is where they got their\nstarlet. A good reader and very easy to look at. I am going to go back\nwith a microscope for every frame with her in it. Central casting,\nfersher, but man, does she hit all the marks!<br><br>She has the right mix of Audrey Hepburn, Melissa McCarthy, and Charlise\nTheron. Somebody is going to make a lot of money with her.\n"},
{"review": "\nFocus (2015)then begins to jump ahead three years to Buenos Aires,\nwhere Nicky(Will Smith) has been hired to pull off the con of his\ncareer by a rich Grand Prix race car owner (Rodrigo Santoro) and his\ngruff but thorough hired security. And who should show up to disrupt\nhis plans but Jess, causing Nicky to drop his guard and lose focus, as\nhe finds himself in a position of having to choose between the big\npayoff and the woman he can't let go of again. Films about the big con\nand the people who pull them off are seductive and irresistibly\nappealing. Many plot twists which make Focus a great and entertaining\nrecommended watch.\n"},
{"review": "\nFor the first roughly 40 minutes of \"Focus,\" I had high hopes of a con\nfilm on par with \"The Sting\" and \"The Film-Flam Man,\" a\nlargely-forgotten, minor masterpiece with George C. Scott. Then,\n\"Focus\" became as soft and predictable as the \"mallow,\" that is the\nnickname of one of the characters. What really redeems \"Focus\" is the\nchemistry between Will Smith and Margo Robbie. Robbie is a real find;\nand her chemistry with Smith is most convincingly romantic I have seen\nin this century. Unfortunately, the sting (pardon the pun) that takes\nup roughly two-thirds of the movie is utterly predictable and\nunconvincing. Great production values, fun cast, that wonderful\nchemistry, clever opening and little else. I give \"Focus\" a soft \"6\".\n"},
{"review": "\nIt was just a little too familiar as many scenes resembled similar\nfilms. The first half feels wells constructed and holds attention, but\nthen when they try to finish it gets weak and predictable. The poor\nemotional range demonstrated by the female lead takes away a lot of the\nenergy from the second half of the film. The best part of the whole\nexperience is the heavyset supporting actor with several funny moments.\nThe makers would have been well advised to allow more camera time for\nthis guy instead of two mediocre actors that we are supposed to view as\ncool and sexy. I felt compelled to turn this film off three fourths of\nthe way through, but I just had to prove myself right about how \"blah\"\nand predicable the \"unpredictable\" finish would be. This film will be a\nhit with low IQ folks under age 29.\n"},
{"review": "\nThis movie was a pleasure to watch and kept your attention from\nbeginning to end with excellent directing and a brilliant plot which\ntwisted and turned when you least expected it. The movie was also light\nhearted with some great fun moments <br><br>Will Smith and Margot Robbie were brilliant in their roles and had real\nchemistry together on screen.<br><br>This movie did not use loads of special effects or explosions to grab\nand keep your attention but instead used great writing and excellent\nacting and dialogue and was a breath of fresh air.<br><br>Well worth a watch.\n"},
{"review": "\nAny success that follows the release of this glamorous and exceedingly\nsexy thriller surely rides on the back of its first half; Margot and\nWill meet and clash in all the right ways with Margot's fiery and\nnaiive glare melting into Will's aged vibrance and almost playful\nseverity, however as the chemistry between the characters really\nignites, the chemistry between the actors unfortunately flickers out.\nThe \"thieving\" scenes are immensely fun to watch and the performances\nare good, however Focus is a prime example of \"style over substance\"\nand how when a film resolutes as arrogant, its unenjoyable. Margot\nRobie does however a very long career ahead of her, hopefully.\n"},
{"review": "\nI saw the movie last weekend and was pleasantly surprised. Will smith\nwins all in his performance. Seeing will smith conning people with the\nutmost of ease is just awesome. Margot Robbie is just about Okay in the\nmovie but will smith is the mainstay of the movie. The first half is\nbetter than the second half. Second half is darker but it was needed\nthat way. The other cast were just the supporting ones and they were\nalright in their act.I will admit that you can't watch it more than\nonce because the secret of the movie is out. But the movie deserves to\nbe watched at least once. Definitely a one time watch at the very\nleast. My rating - 6.5/10.\n"},
{"review": "\nThe trailer really got me and having Will and the beautiful Margot\nacting together got me to see the movie. The movie itself has an\namazing cinematography, and Margot appears as the most beautiful\nactress at this moment. The thing i loved the most from the movie was\nthe OST, it's really good. Now moving to how the movie develops, i\nfound the movie full of voids, which was really bad, it's just another\ncliché movie that you can see whenever you feel bored and without any\nideas to watch other film. I find a lot of the characters to be stupid\nand only a few to be actually ''funny''. The movie left me hungry for\nmore, i was not expecting amazing things, to be honest i went to see\nthis movie, mostly for Margot and Will's comeback, good acting, as i\nsaid Margot looks amazing but this is just not what you expect from\nWill. 6/10! i'd recommend this movie for everyone just for the OST and\nMargot, but only when it comes on DVD. Thanks for reading my review.\n"},
{"review": "\nYou just have to love a movie with will smith and Margot Robbie. It is\nthe complicated story of 2 con artists that fall in love and of course\nthe point is that is really hard for them to trust each other. The\nmovie is a bit foreseeable at times , but overall it has some really\ngood scenes illustrated through the acting of those 2 enjoyable actors.\nThis is not a movie you watch when you expect something big, it is just\na really fun drama with scents of comedy that doesn't really teach you\nanything, you just have fun watching it. I loved Margot Robbie in this\nmovie, i couldn't imagine anyone else in this role, mostly because her\ncharacter has that something special, that feminine vibe that goes well\nwith her beauty and personality. And will smith... I won't even get\nstarted with him...he is a very very good actor and i like all his\nwork.In conclusion, it is a good movie to watch but don't go to the\ncinema expecting something mind-blowing, it is just good.\n"},
{"review": "\nGreetings from Lithuania.<br><br>95% trough \"Focus\" (2015)i was sure i was going to rate this movie a\n10/10. Last ~ 5 minutes take away 1 point. The ending didn't feel to me\non the same page as the whole movie. Neverheless, \"Focus\" is great\nentertainment.<br><br>Performances by both leads were terrific. Script is very smart,\ninvolving and interesting. Style and pace of this movie were great -\nmovie doesn't drag for a second. And there is a jaw-dropping sequence\nin the middle of the movie at the Super Bowl with a brilliant payoff.\nThat is why the ending of this picture was a bit disappointing with\ndouble crosses just piling up.<br><br>Overall, \"Focus\" is a great movie escapism. It has uniformly good\nperformances, very intriguing and smart script and just big fun to\nwatch it.\n"},
{"review": "\nSo this movie left me breathless. In the moment you think that it is\nabout to become like the average and prospective American movie, you\nget fooled. This movie reminds me of Gone girl - the same tricky story\nwith criminals, women, men, love.. except here - it is even more\ninteresting - cars, money, business. This movie shows a great view from\nthieves eyesight, I think that most of us wouldn't have imagined how\nstealing worked or how it could work. In conclusion, I suggest this\nmovie to everyone who likes brain teasers and maybe magic. Although the\nname of the movie is FOCUS, you should keep focused too. It is like a\nmessage before watching it... which I didn't notice.\n"},
{"review": "\n'Focus' ticks all the boxes you'd expect from a Will Smith movie. He's\nslick. He's charming, He's a wise-ass with a whole box of tricks up his\nsleeve. So far so not-so-Fresh Prince. What makes 'Focus' interesting\nis the screen dynamic with Margot Robbie. There's a chemistry there,\nwhich may prove interesting in their next screen combo \u0096 as Deadshot\nand Harley Quinn in the film of DC's 'Suicide Squad'. The plot itself\nis a greatest hits of con-men and caper flicks, with double-cross and\ndeception so layered that the audience is so sure, twenty minutes into\nthe affair, that there is no point in trying to fathom who's scamming\nwho...some of the inevitable twists are telegraphed with astonishing\nunsubtlety, others subject to double, triple or quadruple bluffs. What\nmakes this cliché-ridden nonsense genuinely entertaining is \u0096 as\nalready noted \u0096 the partnership of Smith and Robbie. They ain't no\nTracy and Hepburn, but their sparring is worth the ticket price.\n"},
{"review": "\nThis film tells the story of a con man who is able to pull almost any\ntrick to earn millions in minutes. He seemingly falls for a woman who\nlearns the trade from him, but nothing is as it seems.<br><br>\"Focus\" certainly keeps me focused for the entire film! The plot twists\nand turns, and there is a constant switch between who is the conman and\nwho is being conned. It makes the story fun. The bets in the American\nfootball stadium is a bit far fetched, but it certainly makes the story\nmore exciting. Margot Robbie plays the seemingly innocent con novice\nwell, and she's attractive too. The ending is unexpected, which is\ngood, but I'm irritated by the fact that the guy walked away without\nany objections being voiced. Surely there's another trick behind it?\n"},
{"review": "\nWill Smith stars in a fantastic, twist taking saga that will leave you\nthrilled as much as confused. I reckon Old Willy had a bit to do with\nthe movie more than just his acting, as seen in his bed romp early in\nthe movie, so early it was the second scene. Get that into ya kiddies!\nI didn't mind much as the female is quite striking. If the movies\nanything like the first five minutes, this could be entertaining I\nthought. Ultimately, however ole Wills role as the liar come truthy\ncome liar and that birds role as the truthy come liar come truthycome\nliar ultimately left me confused. In the end while entertaining I\ncouldn't help but feel someone (my housemate) had played me in perhaps\nthe biggest play of the evening, even on a Tuesday. 2.5 stars\n"},
{"review": "\nHere's a con caper that is easy to watch. Don't expect \"The Sting\" and\nyou won't be disappointed.<br><br>Ignore holes you could drive a race car through and sit back and go for\nthe ride. It has some good twists and some things you see coming a mile\naway. There didn't seem to be much chemistry between the leads. <br><br>Nice blend of comedy and drama. Good use of music.. The language and\nsome not at all funny violence gives this an R rating. While the\ninternational aspects of the movie seemed real, the use of fake\nfootball teams in the \"Big Game\" detracted from the realism.<br><br>The movie looks good on the big screen but not much will be lost on a\nhome platform.\n"},
{"review": "\n'FOCUS' reminds me of 'Now You See Me' because both depend on a sleight\nof hand to distract people from the true goal of their con. Even the\ndeception trick in 'Focus' derives from 'Now You See Me'. And as long\nas the former focuses on tricks, it acquits itself admirably in\nentertaining people.<br><br>However, once it delves into the realm of romance between Will Smith\nand Margot Robbie, things go awry. Robbie is absolutely gorgeous and\nSmith's chiselled body and nipples are worth the admission ticket, but\nI didn't buy their relationship.<br><br>Neither is sure whether the other person is revealing his or her's true\nfeelings, but audiences won't care.<br><br>2 out of 5 stars.<br><br>www.ajeffleemovies.wordpress.com\n"},
{"review": "\nCon film with Will Smith teaching fresh young face Robbie the con ropes\nand then letting her work with the rest of his crew in N'Orleans. I got\nconfused and somehow thought from the trailers I had seen that Samuel\nJackson gets involved as a bad guy, but that was Kingsmen and this\ndoesn't go in that direction. To talk more about the plot would\nconstitute a spoiler so let's just say that Smith is excellent, Robbie\ndoes a nice acting job although her looks are a tad too model-ly for\nme, Martinez does another solid side role as in Secret Life, and it was\nnice to see McRaney again. The movie benefits from the input of ace\nillusionist Apollo Robbins of Brain Games fame. The cinematography is\ngrand and the story keeps you involved until the end - a good not great\nmovie.\n"},
{"review": "\nFocus is full of twists and turns but despite this the film manages to\nstay fairly clear. A movie about con artists is bound to fool you a\nlittle bit and its not riddled with clichés. Will Smith is back and as\ngood as ever. I really think this guy like doesn't age. This movie a\nlittle bit more vulgar than you expect from him because he generally\ndoes films that can be enjoyed by teens and adults. This movie is more\nof an adult film and you hear a lot of cursing form Smith which is a\nrarity. Margot Robbie is also a great accomplice for Smith and the two\nhave great chemistry. They create some humorous moments together. Focus\nblends many genres of film into one great movie. I'd skip fifty shades\nand watch Focus if I were you.\n"},
{"review": "\nIt had a few very smart scenes, like the ones that showed what con\nartists do and the scene in the fancy box seats at a football game.\nNicely done. In a way it seemed to surround great scenes with \"some\nother stuff\" but the great scenes and humor kept me from being sorry I\nshowed up. There is a major plot twist at the end, and it was\ninteresting, just not fully fleshed out; and see what you think but I\nthink it contained an error. Will was enjoyable, very easy-breezy (not\nsilly) and cool and funny. He and Margot had excellent chemistry. It\ncan get tricky when the couple is mixed race if the actors themselves\nappear cautious or nervous about how it will be received. But these two\nwere just a couple in love. I liked that. I really enjoyed Gerald\nMcRaney too. I always wanted more from him and couldn't wait for him to\nshow up again. It wasn't great, but it felt fresh.\n"},
{"review": "\nIt's not my intention to watch this movie. I just being forced coz I'm\nnot the type of person who is into action and stuff. I thought it was a\nwaste of money but I was wrong.<br><br>The story focuses on Will Smith's character being a con-man with his\nwork partner played by Margot Robbie. They separated for years and\naccidentally meet each other together with their own agenda.<br><br>I rate it 90% due to it funny humor and great acting. Margot Robbie is\na piece of perfection from land down under. She is natural and sexy!.\nAnd about the story, the flow was great with no dead scenes at all.\nWell, maybe just 10% of the movie but it was freaking entertaining.<br><br>Must Watch!\n"},
{"review": "\nWatching this movie had me on the edge of my seat threw out the whole\nfilm. The way Will Smith executed the role of Nicky had me scratching\nmy head thinking \"Why wasn't he in the oceans eleven movies.\" He did a\ngreat job and don't let me discredit the supporting roles. All around a\ngreat movie from beginning to end. Definitely one of my favorite films\nfrom will Smith. It's also great to see Margot Robbie in a lead role,\nnot only is she drop dead gorgeous but she can hold her own in a movie\nlike this. Really didn't know what to expect walking into the theater\nto see it. But I definitely don't regret spending the money. I really\nlook forward to see what Will Smith's next movie is going to be like.\nIt's a Must watch film, and perfect for a date night. Two thumbs way\nup!!\n"},
{"review": "\nWatching \"Focus\" is just one of those movies that will entertain with\nthrills it has fantasy and adventure of getting away with scores of\nmoney and guilty pleasures of luck it's like a dream for anyone! Will\nSmith is Nicky a con man who travels and comes away with money and\ndiamonds only his game is changed when a flame enters the game a hot\nsexy lady named Jess(in a sexy performance from Margot Robbie). Thru\nthe film it's a cat and mouse game the two play on travel trips as they\nhustle the goods and merchandise from the bad people all while having\nfun and passion and it was nice seeing Margot in that sexy black bra!\nAnd she even has a damsel in distress scene by getting tied up and\nhaving her mouth duct taped! Overall good little tease movie to see of\nfun and dreams a showcase for the up and coming sexy Margot Robbie.\n"},
{"review": "\nI'm thrilled to see its success and there's good credit about the main\ntwo actors on the film.Will Smith is a guy who will bring much\nattention in terms of appearing funny and charming to the most audience\nso rather enjoy the movie by focusing on how it starts right up to the\nend.Margot Robbie on the other side is a new chick in the flick but has\nattractive talent and I wish I had a girl like her but not all that\nbrings attention it's all about how she puts out the female superiority\namongst lustful men who can't seem to find what she's all about\nalthough Will on the other hand is the one getting caught to be beaten\nup on his master-plans.Good movies like these don't wear-off like blue\njeans in a bucket full of washing powder and water.\n"},
{"review": "\nAfter carrying off a number of successful scams (during which period\nthey also enjoyed a fling), scam empire boss Nicky abandons pickpocket\nhottie Jess. Three years later, their paths cross again. But who is\nscamming who this time? <br><br>I'm sure that if I think too hard about this glossy offering, which has\nstrong elements of both caper movie and romantic comedy in it, it may\nwell crumble to dust. So I'm not going to, because I greatly enjoyed\nit. All the scamming is nicely done, and highly entertaining (albeit\nmorally questionable), and the plotting and romance keeps you guessing\nall the way through. <br><br>Will Smith, as Nicky, is reliable, and Margot Robbie, as Jess, is\nfunny, sexy, and believable. I thought she was good in Wolf Of Wall\nStreet: she is better here. She is already the go-to girl for high\nprofile glamour leading lady work, and I suspect that she will show\ngreater versatility as time goes on.<br><br>Recommended.\n"},
{"review": "\nBased on the trailers for this movie I did not know what to think of\nthis. But after I saw it last night, this exceeded my expectations.\nThis was a stylish, different and a very creative kind of movie. It\ntakes us into the world of con artists and the creative ways they get\naway with crime. This was very entertaining the whole way through and\nhas a cast of very colorful characters. The character of Farhad had me\nlaughing at every scene he was in and the stunningly beautiful Margot\nRobbie gave an excellent performance as she usually does. And of\ncourse, the King of Cool, Will Smith is slick and charming as ever.\nThis is an excellent comeback after the disasters that were After Earth\nand Winter's Tale. So in all this was a very good film and you should\ndefinitely check it out.\n"},
{"review": "\nAfter enduring Will Smiths last outing with the appalling \"After Earth\"\nI must admit I was hesitant to watch this however it definitely proved\nme wrong and was a great film to watch. Will was back to his best and\nthe film was exciting, funny and contained an intriguing plot. Also\nMargot Robbie is proving to be a revelation and excelled again after\nher great performance in \"Wolf of Wall Street\". The chemistry between\nthe two is evident which only improves the film whilst also\nsimultaneously making me excited for the next collaboration between the\ntwo in \"Suicide Squad\". Whilst it might not be the best film of the\nyear, it certainly holds it own compared to some of the films playing\nat the moment. The nature of this is film boils down to the simple fact\nthat you come to watch a movie to be entertained and this film delivers\nso I definitely recommend it.<br><br>Nice to have you back Will :)<br><br>8/10\n"},
{"review": "\nThis was an awesome movie; the chemistry between the actors was\ninevitable! Honestly after watching fifty shades of gray, this movie\nwas a breath of fresh air! It was sexy and the storyline had flow! I\nthink this will be my number one movie this year! The characters had a\nlot of chemistry it was HOT! The storyline was very interesting and the\nwhole movie had a message at the end! I would definitely watch it again\nin the cinema that is for sure. It did remain me of the movie HITCH,\nbut with a much better storyline and much more action! I absolutely\nlove how Will Smith just looks better with age and be still got it!\nWorth every penny.\n"},
{"review": "\namazing movie, could be one of the most brilliant with new idea &amp;\ncontent. perfection is what it is. i actually liked how everything was\nmixed so that the viewer will get confused, at some point you will say\nhow stupid he was about what he was doing or thinking , but explaining\nit later it actually means pure evil. the combination of drama, comedy\n&amp; action is what made it a great movie to watch &amp; never to blink so\nthat you wont miss a shot. great outfits, cars, jewelries &amp; decorations\nadded a great touch &amp; sharpness. the idea itself of making a lot of\nmoney in no time &amp; that easy even so its somehow impossible , but it\ngive you some relief that someday you can too just DO IT !!!\n"},
{"review": "\nDon't let these narcissistic people influence your decision to go watch\nthis movie. This was a great, thrilling movie that keeps you interested\nand entailed till the very end. These \"experts\" try to divulge into\nthis movie so bad trying to nitpick at every crack, that they simply\nforgot the ability to actually \"get into\" a movie. To be with the movie\nwith every scene occurring- occurs within you. This is not a sensation\nlike one from interstellar, (which is definitely in my top movies) but\nthe feeling I get from this is more similar to my feeling with \"Rush.\"\nCompletely different movies- yes, but this movie has the same feeling\nof ecstasy and will *figuratively* be sending you through twists and\nturns. It was a very pleasant watch, and if it wasn't for all these\nidiotic reviews my honest review would probably be a very strong 7-\nmediocre 8. See this one for yourself and you'll be walking out of the\ntheater satisfied shaking your head and balking at how someone could\npossibly give this movie a 2- a 5- a 3. Just a disservice.\n"}
]