[
{"review": "\nStar wars made epic fantasy real. For a generation of people it has\ndefined what the cinema experience is meant to be. Today it is probable\nthat pc games will offer a deeper and more satisfying entertainment\nsolution, but for pure visual and aural pleasure, mixed with basic\nemotional manipulation, there has never and will never be a better\nexample of cinema than when star wars appeared over 25 years ago. When\nyou think of star wars, you must remember what else was happening at\nthe time. In America, the war in Vietnam had been lost. In the U.K\neconomic disaster was occurring(a 3 day working week, and the army\ncollecting rubbish). It was almost like the two most technically\nadvanced countries in the world were going backwards. Star wars let\neverybody escape from that reality and reach for a future that was\nuncertain but ultimately good.\n"},
{"review": "\n\nThere's not much to say about this movie this is *THE* movie that changed it\nall.<br><br>It's my favourite movie, and not only among the quadrilogy, among all\nmovies; it has everything that can be great in a movie, great characters,\ngreat story, great sights, great special effects (they don't show 23 years)\nand a mythological background that made us dream for decades now, and\nthat'll keep us dreaming for a long, long time. Maybe the characters I liked\nmost in this one are Old Obi-Wan Kenobi, wonderfully portrayed by Alec\nGuinness, and Han Solo, Harrison Ford's first important role, they're both\ngreat.<br><br>Not to mention John Williams' wonderful score, without of it, the movie\nwouldn't have been this great it's a perfect mix, that's what it\nis!\n"},
{"review": "\nI can never pick a favorite movie because different movies have\ndifferent effects. Goodfellas is my favorite drama. Face/Off is my\nfavorite actioner. But when it comes to pure amazement, nothing beats\nStar Wars. We are introduced to a whole other universe with different\ncreatures, different lifestyles, and different history. We are dropped\nin the middle of an intergalactic war between an empire and a rebellion\nthat has raged for years and left the universe in ruin. It was the most\nfascinating thing to see when i was eleven, but to this day i am still\na Star Wars nerd.<br><br>The cast of characters includes some of the coolest, funniest, and most\ntragic in film, and the actors who play them fit seamlessly into this\nnew universe. Alec Guiness is flawless as Obi-Wan Kenobi, a Jedi on the\nrun from the evil Empire. Harrison Ford is awesome as Han Solo, a\nsmuggler and thief who helps the gang rescue the princess. But the my\nfavorite character of all time is Darth Vader. Not only is he the\ncoolest bad guy, but we learn in later films why he is evil and start\nto feel sympathetic for him. Not to mention that badass booming voice\nthat can make ordering a pizza sound threatening.<br><br>This was not only the beginning of the best movie series ever, but it\nwas the beginning of my love for movies. George Lucas is a genius for\nbeing able to come up with a great story and an incredible backdrop for\nwhat was supposed to be a flop, but turned into one of the best films\never. <br><br>10/10\n"},
{"review": "\n\nIn respect to the many kids of the seventies. I rated this movie as one of\nthe greatest movies ever made. I was thirteen and enjoyed this fantasy\ngetaway more than I could count. Like many other kids of the seventies you\nleft reality before walking into the theatre and escaped into the adventure\nonce the reels begin rolling. It provided the special effects and excitement\na kid was looking for. Even today when I watch this movie on VHS I recall\nthose times. Whenever I get the chance to watch it I feel like that eager\nthirteen year old over and over again.\nI hope the new movies will meet the same expectations of kids of  this\ndecade and the next.\n\n"},
{"review": "\n\nStar Wars is a movie that has had great social impact, a fact that has often\ngone unnoticed.  A harbinger of a changing mood within the United States,\nStar Wars was one of the few movies rated General that was released in 1977.\nWhere movies had for a decade been depicting ever more dark topics (Taxi\nDriver, The Exorcist) Star Wars was a lighthearted adventure.  While some\nmay decry the move back to swashbuckling from social comment, I for one\ncelebrate the fact that Star Wars made it possible for families to go to\nmovies together once again.\n"},
{"review": "\nThe film turn on the endlessly renewed battle between good and evil,\nthe former represented by the Jedi knights and the mystical Force which\nthey are in touch with, and the latter by the Galactic Empire with its\nNazi-like storm-troopers\u0085 <br><br>Luke Skywalker's simple farming life on a remote planet is dramatically\nchanged when he intercepts a distress call from rebel leader Princess\nLeia Organa\u0085 The message leads him to Ben Obi-Wan Kenobi and with the\ntwo droids C3PO and R2D2, and later Chewbacca and Han Solo, their\njourney to release the princess from the evil Empire begins\u0085 <br><br>Now a quarter of a century old, Lucas' project has benefited from\nimprovements in special effects technology, but his vision has remained\nthe same: a naive, even childlike belief in absolute good and evil, a\npreference for action over character and spectacle over everything\u0085\n"},
{"review": "\nStar Wars is the God of all movies. It is the greatest film to have\never been made, bar none. Nothing can be compared to it, nor should it\nbe. It is definitive to our world, our society. It changed the way\nmovies were made: for the better.<br><br>In the 1970s, there was little unknown director named George Lucas.\nLittle did he know (dispite a nightmarish shoot), that his galactic\nspace opera would literally change the way people lived, worked, played\nand thought. The secret behind his success? His imagination.<br><br>The script, the characters, the events, the locations, the humour, the\nopening, the ending... all perfect. <br><br>Of course, it's not the most well-shot movie of all time, but there's\nno denying that nobody actually cares. Star Wars has become a cult and\na religion, and earned it's place in my heart as the greatest film to\nhave ever been made...<br><br>...Millions will agree.<br><br>Whatever I say cannot reach the real truth behind Star Wars: just watch\nit and you'll know exactly what I mean.<br><br>The force will be with us, always.<br><br>Overall: A definitive masterpiece. Will never be forgotten, and will\nremain in the hearts of young and old for generations. Perfect. (10/10)\n"},
{"review": "\nIt is now 36 years after this movie hit theaters, but it is not too\nlate to write a review! This movie will and already is in the history\nbooks as the movie that changed the world! Star Wars, created by George\nLucas, is the most iconic, awesome, epic and action-packed space opera\never made. This movie contains everything you want to see in a movie,\nfor example: action, adventure, mystery, humor, emotion and, above all,\ncreativity. The great visual and imaginative mind of George Lucas made\nit possible for other filmmakers to get from realistic movies to a\ngeneration of movies containing imagination and fantasy. <br><br>The beginning of the movie is so perfectly written and makes it almost\nimpossible for people not to like it. Firstly, the title scrawl.\nAlthough this scrawl was the same as the Flash Gordon series, in Star\nWars this iconic and epic beginning was made great by the extraordinary\nmusic by John Williams. The music he composed made this movie what it\nis today and what it was then. His epic score for this movie was\ndeservedly rewarded with an Academy Award. <br><br>This great creation by George Lucas has influenced me, the American\npopulation and the rest of the world completely!!!\n"},
{"review": "\nAfter seeing the latest and last Star Wars (Episode 3), I wondered if\nthe first was as good as I remembered it, or had I just gotten tired of\nall things Star Wars. Tonight we watched the DVD of the first one (The\nNew Hope or Episode 4, as its now called). What a contrast! Real\npeople, real feelings and emotions, humor, adventure, The Cantina Bar,\nLuke getting in touch with the Force within, Han Solo's sarcasm,\nObiwan's wisdom...Alec Guiness brings a depth to the role lacking in\nthe recent movies....but then again, all of these elements seem lacking\nin the recent movies. The first one is still a gem! Lucas should have\nstopped here.\n"},
{"review": "\nGeorge Lucas probably did not know at the time he was creating one of\nthe biggest hits not just only of his career but also of all time! As\nthere were rarely movies from space it seemed at the time.<br><br>Mark Hamil as the main protagonist Luke Skywalker who went from being a\nsimple farm boy to being a grown up man and really stronger and tougher\nbut had a sense of morals and values as he was the most developed\ncharacter of all the main characters.<br><br>Carrie Fisher as the feisty yet pretty and tough action gal Princess\nLeia. As she really should had moved on and had the acting chops but\npeople will forever remember her as Princess Leia no matter what.<br><br>Harrison Ford as the tough, dashing, a bit of a jerk but with a heart\nof gold space pirate, Han Solo. Who really began to mellow out and\nproved to his friends that he was not such a macho jerk and really had\na heart of gold.<br><br>Darth Vader who only had twelve minutes of screen time in the first\nmovie. Really began to also develop. As he knew he had good inside of\nhim but was afraid to show it.<br><br>And of course scene stealers like C3P0 and R2-D2. As R2D2 is funny even\nthough we can't hear a word he is saying but only C3PO is the only one\nthat can as C3P0 is the perfect sidekick and straight man for scene\nstealing R2.<br><br>The movie had wit, charm, personality, and special effects! Wished that\nboth Hamil and Fisher would had gone on further in their careers like\nFord did!\n"},
{"review": "\nI've seen \"Star Wars\", I don't know HOW many times and I just never get\nsick of it. It's one of my favorites and one of the greatest movies of\nall time. A movie that's the perfect combination of great special\neffects, a great story and memorable characters. All these movies that\nhave been trying to make another \"Star Wars\" over the past two decades\ngenerally overlook exactly what made this movie so great in the first\nplace. They tend to just focus on the sets and special effects and\noverlook the story and characters. George Lucas took great care on all\nthree. A classic movie that will continue to be loved decades from now.\nUnlike all the Hollywood, big-budget crap coming out these days, this\nwas a low-budget film, but had more magic than all the others put\ntogether.\n"},
{"review": "\nIn a distant galaxy, a long time ago, young Luke Skywalker assembles\nhis motley crew of allies including space rogue Han Solo and two\n\"droids\" -- C3PO and R2D2 -- to rescue Princess Leia, the rebel leader\nof her planet from the clutches of the evil Empire as embodied by its\nenforcer Darth Vader in Star Wars:A New Hope.It is epic space opera\nfilm series created by George Lucas. The first film in the series was\noriginally released on 1977, under the title Star Wars, by 20th Century\nFox, and became a worldwide pop culture phenomenon, followed by two\nsequels, released at three-year intervals. Sixteen years after the\nrelease of the trilogy's final film, the first in a new prequel trilogy\nof films was released. The three films were also released at three-year\nintervals, with the final film released on 2005.<br><br>The Star Wars film series has spawned a media franchise including\nbooks, television series, video games, and comic books. These\nsupplements to the film trilogies comprise the Star Wars Expanded\nUniverse, and have resulted in significant development of the series'\nfictional universe. Obviously,it is a legendarily expansive and\nambitious start to the sci- fi saga, George Lucas opened our eyes to\nthe possibilities of blockbuster filmmaking and things have never been\nthe same.It is a magnificent film.Lucas set out to make the biggest\npossible adventure fantasy out of his memories of serials and older\naction epics, and he succeeded brilliantly.It is a seminal movie that\nbegan a whole cycle of sci-fi works and also launched the careers of\nmany actors and craftsmen.A sweeping epic with classical themes lifted\nfrom the teachings of Joseph Campbell, but it maintains strong central\ncharacters.And most of all,it is one of the most enduring movies of all\ntime.\n"},
{"review": "\nStar Wars is great cinema. One of the great things about it is the\nvisuals, the opening shot where the Star Destroyer flies over while\nchasing the Rebel Blockade Runner is amazing. The music is also\nfantastic, it evokes early epic movie scores by the likes of Erich\nWolfgang Korngold and Miklos Rozsa and also hearkens back to Classical\nmusic in the romantic period, especially to Wagner and Holst. The\ncharacters and story are somewhat basic but that's part of whats great\nabout the movie, it has an archetypal, mythic quality.<br><br>Some have said that the only reason this movie is highly regarded is\nbecause of people who as as children and idolize it for nostalgic\nreasons, well as someone who saw for the first time at the age of 16, I\ncan attest that it's stands on it's own very well.<br><br>It does have a few flaws. The dialogue can be corny at times. Luke's\nremorse over his aunt and uncles death seems rather short lived,\nparticularly compared to his sadness over Ben Kenobi's death. Despite\nthese flaws Star Wars is still an excellent film. Highly recommended!\n"},
{"review": "\nIt's what movies are all about, really - sitting in a seat that's\nalready been worn in by a thousand other tushes, crunching as much\npopcorn under your feet as you crunch in your mouth by handfuls,\nsipping a soda that's three times as big as you would ever really\nneed... and then there's this very quiet little opening line written on\nthe screen, like a new way of saying \"once upon a time...\" and you know\nthe fairy tale is beginning, but before you can even get ready to get\ninterested, that fateful, stirring, uplifting and scary chord throws\nyou deep into your seat, in time with a logo that's too big for the\nscreen... and the rest is just a ride. That's what movies are all about\nand that's what Star Wars gave us.<br><br>If you never saw it in the theater, get yourself a really great audio\nvisual system in your house, pour soft drinks on the floor (prep this a\nday prior to get the proper sticky effect) put too much salt and too\nmuch butter on a bucket of popcorn that's too big, and hit the \"play\"\nbutton on the remote.\n"},
{"review": "\nOf all the movies I've ever seen at the theater, I remember this one\nthe most. Not the actual movie really. I remember coming OUT of the\ntheater. Why? Because we had just seen THE final frontier! We had seen\nspace ships! We had seen other worlds! And not in black and white '50s\nstyle sci-fi. This was full color with incredible computer generated\ngraphics. There were real live BELIEVABLE aliens up on the screen! We\nwere flying at light speed across galaxies and star systems! And then\nthe movie was over, the house lights came up, and we had to WALK on\nCONCRETE to our FOSSIL FUELED vehicles and DRIVE on ASPHALT to get\nhome. How B-O-R-I-N-G. How mundane. I had just seen the future, and\nthen when I left the theater it was all jerked away from me. I'll never\nforget that feeling. The disappointment of \"reality\". I've never\nexperienced it with any other movie since, not even any of the other\nStar Wars episodes. I guess I was just the right age at the right time.<br><br>At the time I hated Han Solo. Now that I'm \"all grown up\" I love\nHarrison Ford and it's Luke and Leiah that make me cringe. But this\nreally was a special movie. The gateway to a whole new wave of movie\nmaking. (for better or worse)\n"},
{"review": "\nStar Wars was my first non-Disney movie that I watched at the ripe old\nage of 8. Immediately I fell into another world, getting caught in a\nnew mythology from a Galaxy far, far away. My siblings and I would play\n\"Star Wars\" in the back yard, saving the galaxy from evil. We would try\nto make my cousin into the \"A New Hope\" version of Princess Leia; my\nsister's hair was too short. My best friend at the time and I would be\nJedi knights - we were 8 so it was okay to do this.<br><br>The best thing I have ever done in my life is watch the Special Edition\nrelease of Star Wars. Sitting in the front row, hearing that surround\nsound and experiencing Star Wars in a way that no one had experienced\nit since the 1970s and 1980s - it was truly magical. The image of\neveryone in the theater standing up and cheering when the Death Star\nblew up sears in my mind forever and was the highlight of my entire\nmovie-going experience. Why can't movies do that sort of thing anymore?\nWhy cant they cause such inspiration for imagination anymore?\n"},
{"review": "\nwhat can you say about his movie.it set the bar by which all movies to\ncome would be judged,and this was 1977.i'm talking about the visual\neffects,which were nothing less than astounding.it still stands up well\nto any movie in that regard.remember,they didn't have the benefit of\nCGI back then,so they relied on miniatures.when you add to that,a\ncompelling story and a soon to be iconic villain(not to mention,the\ncolourful cast of characters)and you have box office gold.sure,the\ndialogue may be wooden and stilted at times,but that is overshadowed by\nthe achievement of the film.Besides,the film was marketed at 12 year\nolds,so they're not gonna care about stupid things like dialogue.The\noriginal \"Star Wars\" or as it is subtitled \"a New Hope,was a landmark\nfilm and single handedly reinvented the science fiction genre.\nObviously 10/10\n"},
{"review": "\nI first saw this film on a warm March Sunday evening in 1978, after\nqueueing for a whole hour to get into the cinema. Oh, the anticipation!\nThe excitement! The magic! And here was a film that changed the whole\nconcept of cinema forever, for no matter how many times I return to it,\nin the flickering dark of the cinema, or the wondrous, glittering DVD\nrelease, or in where the film really scores - at the centre of my\nimagination, that night will live forever in my memory. ANYTHING was\npossible, wonders could be achieved. Miracles in the here and now. And\nhow lucky I was to share in it.<br><br>To the squares that loathe it - I pity you daddyos; you'll never\nexperience what millions of us have felt these past three decades. Go\nand see Henry Jaglom again; I'll stick with Mr. Lucas - he is THE MAN!<br><br>I love this film. Forget what flaws it has - minor they are indeed.\nStar Wars has become a mystic myth and that sorcerer supreme, Jedi\nmaster George Lucas, has given me more pleasure than I can measure. My\nfavourite bit? Almost impossible to choose. Okay, if I must...the\nstunning Tie Fighter battle with the Millennium Falcon, a work or art\nin the editing room. It should be hung on a wall somewhere.<br><br>George, old chap, if you're ever passing my house please knock - and\nI'll make you a cup of tea. You deserve that much at least!\n"},
{"review": "\nFrom a scientific point of view, C3PO is as silly as you can get, from\nthe way he looks and walks to the ridiculous things he says. He goes\nfrom berating his friend, R2D2, to worrying for his safety, from\ncalling him incompetent to saying \"I knew you could do it\" when R2\neventually saves them all. Aside from the incessant whining of Luke,\nwho manages to be funny without having a sense of humor, we relate to\nhim. We feel the frustration he feels when he is stuck on the farm, the\npain he feels from the death of his aunt and uncle and later when he\nloses Ben Kenobi.<br><br>The waving of blasters with flashes of light which are obviously added\nlater, the terrible aim of anyone shooting at our main characters, and\nthe big presentation of awards to our heroes at the end of the movie\nmake me feel retarded for liking this film so much. But the pure\ngoodness of the good guys (except for Han) makes me want them to win\nand makes me glad when they do. They're trying to save us all from the\nevil empire. Star Wars is so popular because most of us want to be the\ngood guys, the ones who risk everything to do the right thing for the\nright reason and be appreciated by the people we save. This is the\nreason Spiderman was so enormously popular. He's just a kid who has\nsome moral goodness, whom we can be proud of. Most of us would love to\nbe Luke Skywalker.\n"},
{"review": "\nWhat else can there be said about this galactic masterpiece which has\nnot already been said? Now in times where the saga is (hopefully)\ncomplete, \"Star Wars\" still stands out as one of the most important\nmovies of the film history.<br><br>Even though some dialogs may be silly (but memorable nevertheless) and\nin spite of several logical mistakes, George Lucas'\nScience-Fiction-film can easily be considered as one of the most\nentertaining works ever. The spectator is introduced in a universe full\nof fantastic concepts and locations and meets there some archetypal\ncharacters, such as the beautiful and innocent princess, the keen,\nnaive hero, the dark, evil villain, the wise, old man, etc. The mixture\nof fairy tale and western elements is extremely fascinating and seems\nalmost perfect. Lucas' direction is so skillful that even the above\nmentioned drawbacks eventually appear as positive characteristics of\nthis space odyssey.<br><br>No matter its meantime rather bad reputation, \"Star Wars\" is and will\nalways remain one of the most magical cinematic experiences you can\nmake. It is one of those movies you would like to talk about hours and\nhours, but which after all cannot be taken into words.<br><br>Rating: 96 <br><br>MarSco\n"},
{"review": "\nThis movie, along with the whole original trilogy, just blows me away!\nIt truly has all the elements a good story needs. The characters have\nsuction cups all over them that glue them to your memory, because\nthey're just so great! The story revolves around young Luke Skywalker,\na farm boy who wants more adventure in his life. Adventure finally\narrives to him in the form of two droids, sent by Princess Leia, a\nbeautiful woman begging someone named Obi-Wan Kenobi for help. Leia is\na huge part of Rebel Alliance, a group of people determined to stop the\nEmpire's reign of terror and evil. When Luke meets up with Obi-Wan,\nthey set out to deliver plans inside the droid to Leia's father, plans\nthat can stop the most destructive weapon ever from destroying any\nplanet that stands up for good. Teaming up with a cocky pilot who is\nmore caring than he lets on named Han Solo and his CoPilot Chewbacca\n(big dog/ape/bigfoot like creature) the heroes are thrust into\nadventure beyond Luke's wildest dreams, complete with a heroine,\nhenchmen, space ships, battles and the most menacing villain a movie\nhas ever seen.<br><br>Star Wars is a movie you won't forget soon after watching it. It's full\nof excitement, humor, romance (more so in the ESB, the sequel), great\ndialogue danger, and a never tiresome fight between good and evil. I\nrecommend the trilogy to anyone and everyone who hasn't seen it (that\nwould be...3 people...don't worry though, I'm a pretty newly converted\nfan too!) Han Solo rocks! May the force be with you all. 10/10\n"},
{"review": "\nNot really. Almost 30 years later, Star Wars is a household name. It\nwould be a challenge to find someone who has never heard of Mr. Lucas's\nlittle adventure story. This highly imaginative story is one that\nalmost anyone could find enjoyable. The weaving of action, adventure,\ndrama, conflict, and a plethora of other genres and literary devices is\nabsolutely remarkable. All of this encased in a theme of science\nfiction is a clear cut example that great writing is just that, great\nwriting. A New Hope along with its sequels, especially the two that\nfollowed, TESB and ROTJ will be remembered for a very very long time,\neven in a galaxy far, far away.\n"},
{"review": "\nSay what you will about this movie, its legions of fans, its prequels\nand sequels. No other set of movies is as well-liked by both \"geek\" and\nnormal cinema lovers than Star Wars. People of all ages, race, and\ngender enjoy the movie, unlike many other cult-ish sci-fi movies (Star\nTrek anyone?) This movie has crossed all culture barriers, with\ncharacters, lines, and creatures all well known from one set of movies.\nYou have to live under a rock to not know some of the story lines,\nstatements and characters from this film. The funny thing is how some\nspecial effects from this movie look BETTER than some effects made in\nthe 2000's (The Rock in Mummy Returns, anyone??) CGI, to someone like\nme, just can't compete with scale models, puppets, and camera tricks. I\nhighly recommend this movie to the five people in the universe that\nhave not seen it yet. 25 years later, and it is still, and will forever\nbe, a classic. 10 of 10\n"},
{"review": "\nThis was it! When I was growing up, this was the best and more\ninfluential movie of my childhood. Classic good versus evil tale. I\nlove watching this even more now that newer episodes have been\nreleasing. Their are a lot of references to what is going on in the new\nmovies. This movie is a classic and ranks as one of my favorite movies.\nI love the story lines and for its time, the visuals were incredible. I\nwatch other movies that came out around the same time as this movie,\nand visually, you cant even compare them. This was a movie that raised\nthe bar. Nothing felt forced even though many movies were going to be\nspun off of this one. One of the greatest heroes and villains in the\nsame movie. Everything about this movie is great, even if it is a\nlittle cheesy.\n"},
{"review": "\n\nNo film can ever top this one when it comes to Sci-Fi. The genre was not\nmuch more than a drive-in movie filled with D&amp;D players as it's only fans.\nThis movie changed it all. This is easily one of the biggest landmarks in\nfilm history. Yes, Mr. Lucas has done some strange things as far as releases\nand changing things go. I won't get in to that except to say that they are\nhis films, and he can do with them as he will. That aside, this film is one\nof those great movies that has just a purely awesome story, is not boring\nfor adults and yet it is MPAA rated such that the young can also enjoy it\nwithout being bombarded by violence or vulgar language. I'm all for films\nwith those elements, but it takes a special film to be successful without\nthem. In closing, I can say that this was one of the great experiences of my\nchildhood, a perfect 10.\n"},
{"review": "\n\nThis movie was the first (and only) movie I ever obsessed about.  I was\n11-years old and it is still the greatest movie experience I ever had.\nNothing has come close.  It was the first cast I ever memorized and I\nstill\nknow the soundtrack like the back of my hand.  I can't explain why.<br><br>It was a combination of the old, Peter Cushing, James Earl Jones, and Alec\nGuiness; and the new, Harrison Ford, Mark Hamil, Carrie\nFisher.\nThe special effects are STILL awesome.  The story is timeless and fresh\nsome\n27 years later.<br><br>It's just such a great movie to get lost in...still.\n\n"},
{"review": "\n\nI don't think I can praise or salute this film any more or any higher than\nthe countless fans who have visited this site and commented on this film\nbefore me. It's the stuff of dreams. Movie making and dramatic storytelling\nat its absolute best. No more, no less.<br><br>Is it a 10? It has to be, the scale doesn't go any higher!\n"},
{"review": "\n\nSome claim that Star Wars is nothing more than a simple morality tale that\nborrowed from classic mythology with good special effects.  Comments have\nbeen made about the film that it has a simple story and that the movie has\nsimple characters.  While all of these claims may have some validity, to say\nthat the film has no depth is unfair.  When one studies how much thought\nreally was put in Lucas' trilogy, they should be amazed.\nWhile the film borrows from mythology, Lucas has made sure that each\nfilm has a major twist from its ancestors.  In the first film for example,\nLuke goes to rescue a princess, but instead she is the one that ends up\nsaving him.\nNot only does the story telling have a twist on classic mythology, it\nhas an underlying theme and many sub-themes that no other movie can match.\nAfter studying the trilogy, redemption is the theme most often explored.\nEvery major \"good\" character in the trilogy at one time falls and then\nredeems himself. The ultimate redemption being Darth Vader who will be the\nmain character in the new trilogy being developed as I\ntype.\nAs for the characters being simple, this seems unfair.  They are\narchtypes.  Characters common throughout all cultures.  Also, all the major\ncharacters have motivation for their actions unlike most good guy/bad guy\nmovies.  The bad guys in the films are bad because of human flaws such as\nthe struggle for power and greed.  They are not simple bad for bad's sake.\nEven the main villain of the trilogy becomes very human by the end of the\ntrilogy when he redeems himself.  The film doesn't show the bad guys only as\nsomething to shoot at, but as human beings that have been lead astray.  The\ntwo trilogies are ultimately about how a human being can become a monster,\nand that a monster is still a human being in the end.\nThe Star Wars trilogy has more depth than at first glance.  Though it\ndoes have spectacular effects, this is only to pull the viewer into the\ngreat story-telling.\n"},
{"review": "\n\nI have seen this movie so many times, I know the script, I collect the\nbooks, ask me any question on Star Wars I could probably answer it.<br><br>Star Wars is the best movie ever made. It has everything - plot, special\neffects, great script, endearing characters, one could go on and on about\nit. It has opened up an entire new universe in a galaxy far, far away. And\nthe best thing about it, it can never end.\nAs I had never seen Star Wars in the cinema it was absolutely AMAZING to see\nthe famous opening line and the prologue disappearing into space. The best\nthing about it is that it is labelled Episode 4 - a promise of things to\ncome.\nOf course everyone has seen this movie and its sequels (if not, you've been\nliving in a long time ago in a galaxy far, far away . . . .) And everyone\nhas to admit that its originality at least makes this one of the best\nmovies of all time. \n"},
{"review": "\nWhen I was 12, I went to see Star Wars in the theater 32 times. This is\nthe film that made me want to make films. Star wars is a classic in my\nmind, full of fun, and campy lines.. The story is about a farm boy\nnamed Luke Skywalker (Mark Hamill) who discovers that the used robot\nrecently purchased by his family plays back a message from one Princess\nLeia (Carrie Fisher), begging for help from Obi-Wan Kenobi. Luke asks\nhis father's friend Ben Kenobi (Alec Guinness) about this, and he\ndiscovers that Ben and Obi-Wan are one and the same. Kenobi tells Luke\nof the battle of the rebels against the ruling Empire and the spiritual\nenergy called \"The Force.\" Soon Luke, Kenobi, and a mercenary named Han\nSolo (Harrison Ford) join forces to rescue Princess Leia from the\nEmpire's mammoth warship, the Death Star, controlled by evil genius\nDarth Vader (David Prowse, with the voice of James Earl Jones).\n"},
{"review": "\nLuke Skywalker is raised by his uncle in planet Totooine. One day, he\nbuys two droids, R2 and C-3PO, to serve him. Accidentally, while\ncleaning R2, he discovers a message coming from princess Leia which has\nto be deleverd to an ex- Jedi, Knight Obi-Wan Kenobi. When Luke finds\nhim and tells him about the message, Obi Wan suggests him to become a\nJedi knight. Luke accepts and these two together meet a pilot called\nHan Solo who is paid so as to fly them to the Death Star where princess\nLeia is kept prisoner by Darth Vader and the evil empire. After they\nrescue her, Luke , Han Solo and princess Leia travel to meet Rebel\nAlliance, princess Leia's team, and hand them the plans which will help\nthem destroy the Death Star. Luke together with Rebel Alliance destroy\nit and escape. The \"Empire strikes back\" and \"Return of the Jedi\" come\nnext and the epic tales continue. Τhe fantasy galaxy George Lucas\ninvented, along with the different languages and technological\ncreations (light saber, droids) are far beyond our imagination, but if\nall these existed, we would definitely die to pay a visit.\n"},
{"review": "\nI've seen this film so many times,in fact I grew up with the Prequel\ntrilogy and still love this one.Actually the only prequel I liked was\nthe Revenge of the Sith,although the Lightsaber duel between Qui-Gon\nJinn,Obi Wan and Darth Maul is very entertaining but the thing I love\nabout the originals is too hard to describe in one word,I love the\nstory,the character,the sets are incredible,the acting is very good,and\nof course.......Darth Vader himself.This was when George Lucas wasn't a\nmoney grabbing idiot,when he actually wanted to make a good film,I just\nbought the Blu-Ray,I'm not exactly keen on the CGI filled changes Lucas\nput in there,but the picture quality and sound makes the experience\neven better.<br><br>A Great movie that will NEVER get old. 10/10\n"},
{"review": "\nStar Wars, now known as Episode IV: A New Hope, is the perfect showcase\nof everything that makes a movie great. It is one of those occasions\nwhere everything in the film seems to of perfectly fell in\nplace(although if you know the story behind the making of it, it wasn't\nso smooth). The acting, directing, writing, production design, special\neffects, and anything else I've forgotten, is simply top-notch. This\nmovie did so many things for film, most notably the special effects,\nbut it also gave us three of the greatest young actors of the late 70s\nand 80s, Mark Hammill, Carrie Fisher, and Harrison Ford. Then the film\nalso created the blockbuster, and is the definition of what a\nblockbuster should be(humor, emotion, action, heart). On the last point\nthe action is probably the most exhilarating and exciting action I've\never seen on film, the Death Star Trench Run is the definite highlight\nof the film. This film is just simply superb and is picture perfect,\nand is definitely one of the greatest and most memorable films of\nall-time. It's hard to believe that this all sprung from one man's\nimagination, George Lucas(writer/director of the film). STAR\nWARS!!!!!!!!! <br><br>Rating: A picture perfect 10 out of 10!!!!!!!\n"},
{"review": "\nStar Wars changed everyone's lives when it came out in 1977, including\nmine. I can still remember the anticipation as a little kid waiting in\nline to see this amazing movie I kept reading about.<br><br>It definitely lived up to every bit of hype I had heard up to that\npoint. I got my popcorn and my soda, sat down with my cousin and we\nwatched in awe at everything we saw on the screen.<br><br>I am definitely a Star Wars kid, and feel very lucky to have actually\nseen the original in the theater, something that today's kids can never\nexperience because all big event films are all children of Star Wars\nafter all. But there will never be anything like this first movie, the\ngreatest film of all time! If you haven't seen it yet, see it!\n"},
{"review": "\nOne word can describe Star Wars...Perfection with a capital P! Star\nWars is so perfectly molded together filled with pieces all so crucial\nyet all so wonderful,John William's A+++ score, or James Earl Jones'\npowerful voice.Really George Lucas' picture should be put next to the\nword Lucky in the dictionary.He had such a bizarre concept,and people\nhad doubts.I mean if he was pitching Star Wars to me I would too.Yet\nthis is the Little Movie that Could so to say.The acting is A+,my\npersonal favorite performance is Alec Guiness as Obi-Wan Kenobi.People\nwould argue about Geogre Lucas not being a great director after the\ninfamous Prequels,that's a load of B.S.Lucas pours his imagination on\nthe screen and the audience is captivated.We have to give a standing\novation to ILM which started in the 70's with Star Wars.The movie is\nstill amazing to look at nearly 30 years later and with C.G.I in the\nmovie making mix.The plot sounds bizarre on paper but it works wonders\non screen and flows quickly,I don't believe I have ever checked my\nwatch while watching Star Wars.I have to applaud Mr.Lucas,Star Wars has\nfueled the imaginations of many and will continue to fuel generations\nto come.One moment can describe the impact of the whole Star Wars\nexperience/impact for me,the scene where Luke looks into the setting\nsuns accompanied by William's brilliant score.It's a very moving\nscene.I really think it tells you to look out for more in your life to\nbecome something so to say.Star Wars can only be surpassed by it's\nsequel Empire Strikes Back but looking back at both I think they are\neven.Empire Stikes Back and Star Wars are in my opinion the best movies\never made<br><br>10/10\n"},
{"review": "\nThis film single-handedly changed modern cinema to what we know it to\nbe today. It is the ultimate modern fairy tale. A young knight runs off\nwith a wise old wizard to save the princess from the clutches of evil.\nOf course, it runs a little deeper than that, and makes the old tale of\ngood versus evil so much more compelling. Setting it long ago in a\ngalaxy far, far away is pure genius and it introduces us to a\nfuturistic galaxy of beautiful style and diversity that leaves us with\na fantastic space opera. Despite its unfamiliar setting, we can relate\nto all the characters. There's the handsome maverick, the beautiful\nheroine, the aspiring young knight, the wise old mentor, and the darkly\nclad villain. Even the droids are characters we can recognise and\nrelate to. What is so special about this film is that the distractions\nof things like politics, geography, and nationality are eliminated to\nleave us with simple humanity. This film has everything you could ever\nwant. The characters are great; the action's great; the story is\nmagnificent, and of course there's philosophy too.... Oh, what am I\ntalking about? I just think lightsabers are cool...\n"},
{"review": "\nI loved this movie. I have always loved this movie. I always will love\nthis movie. It is simply amazing. The actors, Harrison Ford, Mark Hamil\nand Carrie Fisher all did an excellent job. However my favorite\ncharacter was Darth Vader. He is evil with being ugly or digusting. The\nhigh level of quality from a film made in 1977 is astounding. Still\nbeing from the seventies, this film has some pretty interesting hair.\nBut it is THE film that defined how science fiction movies are supposed\nto be. I did my term paper on the affects of Star Wars on the science\nfiction genre and the movie industry itself. Needless to say I didn't\nhave to work that hard, the movies speaks for itself. If you haven't\nseen it, watch it. I love this film.\n"},
{"review": "\nI was four years old when I saw this movie and I remembered the whole\nthing, from beginning to end. It was summer and my family was spending\na month at our camp. One day my sister (2 years old at the time) and I\nhad been fighting all day. My parents sent us off to bed for a nap\nbefore dinner and I grudgingly complied. I was awoken by my father, he\nwas asking me if I wanted to go see a movie. \"It has spaceships, and\nrobots, and lasers, you'll love it!\" I looked at him through swollen\neyes and asked, \"does Jenna get to go to?\" When I heard him say no, I\nknew I was in for a HUGE treat. We arrived at a nearly empty theater,\nand took our seats. When the first jarring chord of the theme hit me,\nand my father began reading the opening story, I was captivated. It was\nthe happiest day of my life. To hell with all your nitpicking. When\nsomething makes that great an impression on a four year old, you know\nit has to be something truly special. By the way, I'm wearing the Boba\nFett t-shirt my son's mother gave me as a gift. And no, I'm not some\ngreasy, Star Wars obsessed dork. Well, not any more...\n"},
{"review": "\nGeorge Lucus stunned audiences with this outer space saga when it was\nreleased and deservingly so. It was a film quite like nothing anyone\nhad seen before a truly visual and cinematic achievement. The story\nbegins on Chapter IV and takes us on an action packed journey filled\nwith aliens, intrigue and adventure. The success of Star Wars is\nultimately due to the wonderful imagination of its director and of\ncourse to the extremely well orchestrated cast. I think George Lucas\nwas riding high with his previous film success 'American Graffiti, but\nthis is far removed from Star Wars, no similarities at all. I was\nsimply captivated the first time I saw this film in the cinema's back\nin '77 and still am\u0085although the big screen does give it more of an\nimpact. Everything about Star Wars will definitely appeal to a vast\naudience from children to adults alike\u0085.it's a 'must see film' in my\nopinion. Then when you're finished watching Star Wars, just think; you\nhave only 5 more chapters to go. 10/10\n"},
{"review": "\nThis was quite possibly the greatest film of all time, I agree the\nacting was somewhat lacking, but the effects were beyond amazing, you\ngot to remember, this was 1977. Lucas' vision was realized to its full\npotential and William's score carried the film to being the most\nsuccessful film ever made, behind the hunk of crap titanic. The story\nwas one the most original I've ever come across and the movie itself\nsparked the career of Harrison Ford, quite possibly one of the biggest\nactors in the 1980's and 90's. Although this was the first and last\noriginal Star Wars film to be directed by Lucas, it was quite possibly\nthe best film to hit the market in the 1970's.\n"},
{"review": "\n\nThis movie came out a few years before i was even born, but somehow one\nof my first memories was seeing this movie. Every kid I knew loved star\nwars boy and girl. So basically if i had to sum up my childhood in two\nwords it would be star wars. From the cantina scene to the death star\nfirst rate special effects. The opening crawl probably still brings a\ntear to my eye. Han solo just rocked and Luke skywalker was just\nadorable. I love the scene in the garbage chute, but my all time\nfavorite scene is when Luke goes outside and looks out to the horizon\n(the famous shot of the two suns) and the classic music cues up. Oh my\ngod it gives me the chills. awesome!\n\n"},
{"review": "\n\nI first saw this movie (or at least as far as I can remember) when i\nwas about 4. It wasn't until I was about 8 that I really got into the\nwhole saga. I have to say #4 isn't my favorite of the films, but it is\nthe one that started the greatest sci fi epic ever. I think for it's\ntime the special effects were magnificent. And the acting was done by\nREAL actors from back in the day. Now a days all I seem to see coming\nup in the thespian ranks are pretty boys and girls with fake boobs.\nWhat happened. Anyways, i think everyone should watch this movie at\nleast once. If your not \"enlightened\" by it you'll at least be\nentertained by a few good humor spots.\n\n"},
{"review": "\nThere is no denying that this film was the start of something big, and\nyou cannot take away from it the fact that it changed the face of the\nsci-fi genre, maybe even the whole film industry, in to what it is\ntoday. For its time, the effects, story, characters and detail in this\nfilm are are beyond exemplary. Most action and sci-fi films aim to be\ncompared to star wars, a feat that is rare and, in my opinion, has only\nbeen achieved by Terminator 1 and 2, the lord of the rings trilogy and\nmarvels: the avengers.<br><br>A new hope works brilliantly as a first chapter to a saga, however, I\nfeel that it works better as a stand alone film. Unlike many films that\nare a 'first part', it has a beginning, middle and end, tells\neverything that needs to be told and leaves the characters in a\nsatisfying place. I feel that having seen the prequels does not\ndiminish anything about this film like it does to episodes five and\nsix.<br><br>The only problem that I have is that the original theatrical release\ndoesn't really exist anymore, you can only really get the version that\nhas been tinkered with by Lucas to put needless CGI extras in. This is\nthe original and best of the star wars saga, however i do feel that\nmany people see this through rose tinted glasses and will not see any\nfaults in any of the three original films, even though they are happy\nto say that the three prequels do not exist as far as they are\nconcerned. Awesome film, great legacy, and now that Disney has the\nrights away from Lucas, a great future too.\n"},
{"review": "\nThere are only a handful of movies I've given a perfect 10 out of 10,\nand Star Wars is in my opinion one of the best movie of all time. It is\na movie with non stop excitement that will make you want to watch it\nover and over. The original Star Wars is an instant classic. If you\nhaven't seen this movie, you have to go find some one who has it, and\nwatch it. The amazing space story has original ideas and now in days I\ncan relate a lot of action scenes back to Star Wars. Remember the\nopening scene of Man of Steel, when Jor-El was fleeing from General\nZod's army. It looked like something straight out of Star Wars. I loved\nMan of Steel as much as the next person, but Star Wars is that original\nsci-fi adventure that you will love for ever. This first part of the\noriginal trilogy will set up two more movies that will lead to one of\nthe greatest trilogies of all time. Please take my word for it and if\nyou haven't seen it already go watch this movie as soon as possible.\nFor the sake of your movication (yes I'm quoting Pitch Perfect) please\nwatch Star Wars you will not be disappointed\n"},
{"review": "\nThere is nothing I can type here that has not been covered by previous\nreviewers so I will just leave it at this: <br><br>For those that haven't watched Star Wars; please remedy that if you're\na Sci-Fi fan or just a fan of films with a rich story. Star Wars was\none of my favourite films as a child and it continues to be a source of\nboth nostalgic wonder and a film that will always hold a special place\nwith a geek/fan girl like me. The reviewer whom stated that Star Wars\nis a \"Kid's Fantasy. An Adult's Memory\" was spot on! I was three years\nfrom being born when the film was released in theatres but I was lucky\nenough to grow up with big brothers who introduced me as soon as I was\nold enough to watch. I cannot thank them enough for that. <br><br>There is nothing better than reliving the epic stories of the Star Wars\nfilms on a rainy weekend!\n"},
{"review": "\nBefore there was a trilogy, before there were prequels, before there\nwas an expanded universe with hundreds of books, comics and video\ngames, before Greedo shot first and before Jar Jar Bink was a speck of\nlight in George Lucas' eye, there was Star Wars. Even if it's not the\nbest film in the series (it's not), Star Wars deserves its own place in\nthe history of cinema, as a work that changed Hollywood forever. It\nbrought back the grandness of the epic cinema of the 30's and 40's and\nmultiplied it, creating a new era of spectacle and excitement.<br><br>Unlike the rest of the films, there's absolutely no need for an\nexpanded universe or a complete saga to appreciate the original Star\nWars by its own right. It's a complete tale, a classic saga that takes\nits queues from historical epics, samurai films and serials, and\ncontains every aspect of the timeless hero's journey. The fact that it\ntakes place 'in a galaxy far, far away' is trivial - though it did help\nthe film have a bigger impact.<br><br>Star Wars has very little to do with science fiction; not much of the\nscience in it makes any sense, it might as well be magic. But that's\nwhat made it so powerful, and what made the prequels - that tried to\nexplain everything away - so disappointing. Luke Skywalker's story is a\nclassic story of the simple farm-boy who leaves his home and becomes a\nhero, and for that reason exactly it's timeless, and resonates with\naudiences even now.<br><br>Now go see The Empire Strikes Back.\n"},
{"review": "\nGeorge Lucas spent four years developing and working on the galactic\nfantasy Star Wars. This was after he directed the dystopian\nscience-fiction film THX 1138 (1971) and the rites-of-passage American\nGraffiti (1973). Star Wars was inspired by the Flash Gordon cartoon\nstrip. It cost $8 million to make in Britain with three little-known\nAmericans in the leading roles, supported by British actors. The story\nis a simple adventure yarn, and Lucas draws on samurai films, Westerns\nand every kind of myth, ancient and modern. The dogfights are based on\na close study of World War II films. Star Wars was an immediate\nsuccess. It became one of the great phenomena of cinematic history. It\nspawned two sequels, three prequels and endless imitators, creating a\ndemand for spectacular blockbusters that has not yet ended. Industrial\nLight and Magic, the special effects unit that served the film, became\na multi-billion dollar organization. Lucas himself also became and has\nremained one of Hollywood's most powerful figures. The film certainly\nstruck a nerve in an America recovering from the humiliations of the\nVietnam war. Ronald Reagan, elected president three years after Star\nWars was made, spoke of the Soviet Union as 'the Evil Empire' and gave\nhis proposed space-defense system the title Star Wars. The original\nStar Wars trilogy contributed to the worldwide renewal of the filmgoing\nhabit, but in creating an appetite for child-like blockbusters that\ndepend on special effects rather than on character and subtle\nnarrative, the film unfortunately played a key role in what was to be\ncalled 'the dumbing down' of America and popular culture.\n"},
{"review": "\nI grew up behind the iron curtain in Hungary. We hardly had the chance\nto see Western movies. I was 8 when I saw it, in 1982. I remember we\nwere late from the movie (I went with my brother and grandmother) and\nwe arrived to our seats when R2D2 was trying to find a way out from the\nicy base of the rebells on Hoth.<br><br>I started to watch the film in awe, as I have never seem anything like\nit in my life. It's difficult to describe what impacts it gave me. Yes,\non first level the special vision complex of the movie, the freedom\nfight against dictatorship, the novel landscapes and then the modern\ntechnology, but also the Asian (Buddhist, New Age) philosophy, that I\nhad never encounter until then.<br><br>I couldn't get out of its spell for several years. (I think I was in\nlove with Han Solo for several years, too.) And with the movie - even\nnow.<br><br>Thanks Gorge Lucas and the Hungarian Distributor, who dared to bring it\nit in!\n"},
{"review": "\nThis was the introductory fanaticism of laser works, as well as a bevy\nof special sound effects, and elaborate sci-fi costuming, which started\na whole new revelation in the cinema world. Steven Spielberg mastered\nthe art of galactic warfare through a limitless use of creative\nweaponry!! The enormous popularity of this film opened the floodgates\nfor copious movies about space battle in the ensuing years ahead!!\nInitially intrigued by the hit television show \"Star Trek\", the\nAmerican public took to the movie \"Star Wars\" because it pinpointed a\nsort of personification of a video arcade wonderland, as a result,\n\"Star Wars\" utterly fascinated the movie audience!! Harrison Ford is\none of the all time box office legends in Hollywood, his big break was\nwith the movie \"Star Wars\",,, Later, of course, he captivated millions\nwith his stellar performance in \"Raiders of the Lost Ark\"!! Movies like\n\"Star Wars\" do not come along very often, when they do, they set a\nprecedent in the film industry!! I found the film \"Star Wars\" to be way\nahead of it's time with regard to the optical gimmickry that they so\nsuperbly effectuated!! The music to \"Star Wars\" is classic in it's\ncharismatic demeanor, and, by and large, it is understandable that the\nmost prominent critics in the film industry rank \"Star Wars\" as one of\nthe greatest movies ever made!! \"Star Wars\" is always chosen as one of\nthe top twenty films in the American movie market by the esoteric and\ndiscriminating critics of AFI!! Endless accolades go out to \"Star Wars\"\nand the incredible ingenuity it possesses to entertain the American\nmovie goer!! WITHOUT QUESTION!! FIVE STARS!!!!\n"},
{"review": "\nWhen Episode IV came out I was not even born. I guess I was too young\nto see Episodes V &amp; VI. So my brother and grew up with it on the TV\nscreen. When The Special Edition was getting released into theaters my\nbrother and I were like \"We HAVE to see them!\" So on opening day my\nbrother and I got in line at Tinseltown 290 in Houston to buy four\ntickets. Standing behind me is a Cinemark employee dressed as Darth\nVader. I don't know why I laughed at that moment. We originally wanted\nthe 10:45pm showing but it was sold out and they added an extra showing\nat 1am. So at 1am myself, my brother, our Dad and our aunt went to see\nit. The lights went out and some guy behind us yelled \"Chewie!\". You\nthose familiar drums then the Fox logo. Then Lucas Film Ltd the people\napplauded. Then \"A long time ago in a galaxy far, far away.\" There was\nsilence for that. Then the \"Star Wars\" came on the screen the theater\napplauded loudly. It was great. My brother and I agree George Lucas is\na genius. Such imagination. He deserved that AFI Life Acchievment Award\nthis year. George Lucas joins the ranks of Steven Spielberg, James\nCameron, Peter Jackson among others as a great director. Way to go\nGeorge!\n"},
{"review": "\nThe definitive sci-fi movie. Totally reshaped the genre where the movies are appropriately regarded as 'before Star Wars' or 'after Star Wars'. \nBest in the original trilogy. The 1997 special edition did not add much content, only effects wizardry.\n\n"},
{"review": "\nI couldn't have asked for anything more. Star Wars: A New Hope had it\nall. If I had to sum it up in one word, superlative would be my answer.\nI saw the film for the first time three months ago and loved it, and\nsince then I have watched all the Star Wars movies. I was disappointed\nwith the prequels (Attack of the Clones was my least favourite), but\nthis, Return of the Jedi and Empire Strikes Back were perfection.<br><br>I have to say that the film looks absolutely amazing even after thirty\nplus years, with highly imaginative sets and dazzling special effects.\nAnd the action sequences were superbly choreographed and brisk, the\nDeath Star climax was a knockout. The music by John Williams is\nabsolutely outstanding, by far one of his more exciting and rousing\nscores. The story is fast-paced, intelligent and has an essence of\nsophistication, and the screenplay is sharp and decisive.<br><br>And the performances were flawless. In the prequels I had problems\nrelating to some of the performers, namely Hayden Christensen as\nAnakin. Here, all the actors played their parts with superlative skill.\nAlec Guiness, one fine actor and will be sorely missed was a standout,\nlikewise with Peter Cushing and Harrison Ford(hilarious here). Carrie\nFisher was a fine Princess Leia, spunky, beautiful and sexy, and Mark\nHamill was a completely likable Luke. And the villain Darth Vader,\nwithout doubt one of the best and in-depth villains in cinematic\nhistory, and James Earl Jones's deep booming voice was perfect for the\ncharacter.<br><br>All in all, a definite sci-fi classic, that blew me away. 10/10 Bethany\nCox\n"},
{"review": "\nFilled with great characters and a fun story, Star Wars is well\ndeserving of its reputation as a classic. John Williams score alone\nmakes this a film worth seeing. The characters are unforgettable and\nthe special effects impressive for its time, but very outdated now. The\ndifferent alien species are one of the best things about the film. The\nCantina scene showing an array of Lucas' creations is particularly fun.<br><br>I give this film a 7/10. Looking at it subjectively, it isn't a really\ngood film. A lot of clichés, bad dialogue, cracker jack philosophy, and\nunimpressive acting. Yet, for some reason, I find it hard to say\nanything bad about this movie. My favorite film as a child, and one I\nstill enjoy, mostly for nostalgia.\n"},
{"review": "\n\n****Spoiler Warning********<br><br>Before I say anything else I need to point out I liked Star Wars.  As a\nmovie by itself it was a good sci-fi flick that opened new vistas in special\neffects and scope of story; quite literally an entire new universe was\nopened before our eyes.<br><br>That said, no other movie did as much to bring the \"blockbuster\" mentality\nto Hollywood, where the moguls realized it was possible to make so much\nmoney on one movie that they could not only retire but buy that island they\nalways had their eye on.  It also brought the idea of movies as franchises\nto the fore, where now the movie came not only with toys but books and games\nand fast food meals.<br><br>Sadly it seems \"Star Wars\" and \"Empire Strikes Back\" were the best of the\nmovies, as we found out first we were starting out in the middle of the\nstory and later we got the prequels that were supposed to expand the plot\nbut instead only muddled it.  (And they were so bad! on top of\nit.)<br><br>Star Wars was a cinematic nuclear bomb for 1977, and brought with it the\nmoneymaking mess we now call Hollywood.\n"},
{"review": "\n\nThis is quite simply a masterpiece.<br><br>By far the film that has progressed the film industry the farthest.\nThis is the breakthrough in films. This film set raised the benchmark\nfor standard of films that is still not being reached by many films\ntoday, almost 30 years on.<br><br>This introduces us to our characters and sets the story for out\ntrilogy. A little slow to get started i grant you. An exciting opening\nscene is followed by what to my mind is a little too much of Threepio\nand Artoo traipsing through the dunes of Tatooine. After that though it\nis a non stop ride of action, adventure, drama and comedy. The\nexcitement of learning about the force will never be surpassed and\nnever has an idea been so gripping.<br><br>Watch this film if you only watch one film in your life. Of course if\nyou are only going to watch one film in your like then after seeing\nthis i am afraid that will drastically be changed into only watching 6\nfilms in your life!!!\n\n"},
{"review": "\nThis movie was a significant part of the childhood of almost every\nAmerican born in the later third of the 20th century. This doesn't\nchange the fact that Mark Hamil's acting is simply terrible and the\naction scenes are simply atrocious. There is no explanation as to why\nthe Storm Troopers cannot aim their guns to save their lives. I don't\nunderstand why Obiwan is considered a crazy hermit, when the uncle knew\nhim to be a Jedi knight. I still don't get the flashing lights and\nbuttons on Darth's chest, why didn't Obiwan just use his force powers\nto switch off the power on the jump suit. Also it is supposed to be\nabout twenty years from episode 3 to episode 4 but Obiwan ages like 40\nyears. Whats up with that? That whole suicide by Vader thing is\nincredibly lame, too. Don't get me wrong parts of the movie were\nabsolutely brilliant (esp. acting by Harrison Ford), but it definitely\nleaves a lot to be desired.\n"},
{"review": "\nI can't see how any adult could sit through this mixed bag of Sesame\nlooking,and Sesame named,characters. I took my kids to see this boring,\nboring, movie in it's debut. 10 min into the movie I realized, this\nmovie is meant for the 10 to 15 year old mentality as are most of\ntoday's movies. Special explosive effects, stupid unpronounceable\ncharacter names is the ticket for the Oscar, no need for a story.\nAlthough,this movie had a story that no kid or adult could understand .\nThen when you start remaking the movie dozens of times over like Jaws\n15, Rocky 85, the Harry Potter series,and even the God Father 3 it\ndestroys the original movie they start to look like all our cable re\nrun movies. All those Star Wars chronicles are just a reminder of\ntoday's adolescent movie mentality. I fell asleep during the first\nmovie and my kids 8 and 12 could not tell me what is was about. I tried\nagain to watch it a few years later but couldn't make to the end it was\nlike I was being put through a KGB torture interrogation. Sorry Star\nWar fans but I'm on to TCM to watch an adult flick I'll leave the Stars\nWar series to the kiddies and the Star Trek fans.\n"},
{"review": "\nStar Wars!A brave hero,a princess,an amazing bad guy,a cool smuggler,2\nfunny robots and of course a green alien!Everything that a perfect\nscience-fiction film needs!In my opinion,Star Wars is and will always\nbe one of the best movies because it combines adventure with drama and\na...lot of fantasy!It is also a nice story about an evil father, his\npowerful son and his courageous daughter,Leia!Moreover it has great\neffects for a film in the 80s and includes amazing characters,an\ninteresting plot and nice fights between evil and good!Star Wars 4 is\ngreat,due to ...everything and especially the begging with Darth Vader\nand the blowing of the Death Star!!!Although, my favourite Star Wars\nfilm is\" The Empire Strikes Back\"because of Yoda,the green alien and of\nthe fight between father and son which is absolutely amazing!I consider\nall Star Wars films epic!Star Wars is a part of my life and of my\nculture and it will always be!May the force be with you!\n"},
{"review": "\nA low budget sci-fi popcorn flick that changed movies and Hollywood\nforever!<br><br>I don't know where to start with this film as it changed the world. We\nhad had some SFX in old fantasy films like Sinbad or Jason and the\nargonauts or space oddessy 2001 but when I sat down I the cinema for\nthe fist time nothing could prepare me for what was about to happen!<br><br>The opening sequence where the camera pans down to the planet followed\nby the rebel ship and then the star destroyer flying over your head. No\none had seen or imagined anything like this was possible let alone\nwatching it right before their eyes! And it kept on getting better!<br><br>it was like having a black &amp;a white TV and then suddenly walking into a\n3D IMAX! You couldn't comprehend what was actually happening. <br><br>There is often a debate about the greatest movie of all time. Some say\nCitizen Kane or Shawshank to name a few but for me it's Star Wars and\nEmpire Strikes Back. <br><br>The score is ahead of its time. To be honest nothing has ever come\nclose. It makes a massive impact on all 3 original films. <br><br>Let's review it by breaking it down:<br><br>Story - classic story which had stood the test of time Special Effect -\nabsolutely amazing Set design - original, faultless and imaginative\nMusical score - absolute classic Pace of the film - spot on<br><br>When I first saw this film I was blown away! I had never seen anything\nlike it and come to think of it I really have. for me it's an all time\nclassic that changed the movie industry for ever.<br><br>If you're sitting at home reading this, rake it out and watch it now.\nIt will put a smile on your face and that's what it's all about.<br><br>For those who haven't given this a 10 I can't understand it. <br><br>The movie that is the definition of 'a movie'\n"},
{"review": "\nThis movie has defined a generation, and spawned a multimedia empire.\nWith its now classic scrolling text, it created a new genre of film -\nthe space opera. Influenced by Joseph Campbell, Lucas created a space\nwestern that hadn't been re-created since in any serious way. Even the\nmuch loved Firefly never had the same cult following. Star Wars'\ntimeless feel resides in its classic archetypes the white hats. black\nhats to boo, and a classic princess to be rescued. It has a John Ford\nfeel, with comedic relief in the twin yin yang feel of the droids R2-D2\nand C3P0, the teacher with Obiwan, the lovable rogue Han Solo, the\nsidekick with a heart of gold Chewie, the student Skywalker and the\nlove interest with a kick Lea. This is one film series that will end up\noutliving us all.\n"},
{"review": "\nI remember when I was 9 years old when this movie was repeated on\nchannel 10 and I found it really enjoyable to watch. The story is very\nstrong for a SCIF movie. The costumes are very good for the aliens and\nthe robots too. The most likable characters are Luke sykerwalker Han\nSolo and C3po and R2D2 But I think its the droids are the ones who\nsteal the comedy in this movie As always the story always go for a part\n2 so their is always a little more more to the story and secrets being\nrevealed latter on in the series. Overall This is another classic\nmasterpiece that is wroth watching. <br><br>10/10\n"},
{"review": "\nWhat really stood out to me after watching The Force Awakens a couple\nof times and coming back to A New Hope was how focused it is. It's\nconfident in the world it's building and it doesn't try to rush\neverything. It's not afraid to be weird. I mean it has robots, who\naren't even the main characters, walking around in the desert for 5\nminutes. Few, if any, blockbusters have that kind of confidence these\ndays.<br><br>I'm amazed at how much the film expects you to accept in just a short\namount of time, but it works because it allows the audience to take in\nthe world. In comparison, TFA has ADHD (not that I hate it).<br><br>Yes, some of the special effects are dated and some of Luke's lines are\ncringe-worthy, but it is full of heart and that can be felt throughout\nthe film.<br><br>People laugh at the poor choreography of Vader and Obi-Wan's final\nduel, but in my opinion it is still one of the best in the series. Not\nbecause of how they are fighting, but because of why they are fighting.\nAlmost every line in that duel is classic.<br><br>Another good thing is that ANH can stand on its own. It's\nself-contained and it tells a relatively complete story. These days, a\nlot of movies that are meant to spawn franchises suffer from\nsequel-baiting. While the possibility of a sequel is hinted at, the\nfilm itself doesn't hinge of having one.<br><br>It's a shame we can't get a proper restoration of the original version,\nbut despite all the additions, ANH still maintains its essence.<br><br>That I've watched it so many times and still haven't gotten bored of it\nis a testament to how good it is. Few films have ever left an\nimpression on me like this one. I don't think it can just be nostalgia.\nMany films that I liked as a child I later realized weren't as good as\nI remembered, but not A New Hope.\n"},
{"review": "\nIn honor of May,the official Star Wars month, I will review all the\nStar Wars movies in chronological order. Now lets start with the New\nHope: It opened on May 1977 and after that the world as a whole changed\nbig time. This movie is even studied as the archetype of the hero\njourney and made the words like ,lightsabers, the Force, Jedi and names\nlike Lya ,Luke , Han Solo and of course Darth Vader known world\nwide.Every science fiction flick or TV series after 1977 is in, one way\nor an order, a child ,godchild or imitator of Star Wars. From Guardians\nof the Galaxy to Rick and Morty and almost anything in between. The\nimpact can be seen in movies or series from totally different genres,\nfor instance due to its success studios decided to invest in the\nsuperhero stories that inspire George Lucas to create this\nunforgettable saga and from that it came Richard Donner's Superman ,Tim\nBurton's Batman and the 1992 X-men series and Batman the animated\nseries ,which are the fathers (spoilers) of the superhero genre ,which\nnow dominates Hollywood. In simple ,no Star Wars, no Superheroes!! If\nyou have not watch it ,I feel sorry for you and go do it now!!\n"},
{"review": "\nè Una Bel film. mi è Paquito favorer Tonto, peon DI quell battle laser\npew pew fig-he, poi c'è ache Ben Kenobi ch poi Si Chaim Obi Wan ma è\nugly perchè Si Chaim Obi Wan Ben Kenobi Neilla version esters. Darth\nFeder (O Dark Vader per glib Ami's) Sabra captive ma in found Si Verde\nch è Una bu-on padre, sprout quanta accede IL Sui maestro. Poi ch dire,\nLeia non ha IL Reggis e Si Verde, Han ha separator per prim, Greedo e\nper ques to mi.. E Luke è Una Rafaello Nell'anon, o almoner ha quell\nambiance e quell utilità. Poi la Morte Negra (oppure DI co lore) fa\nmolt Aura ch con Una Reggi ti incense IL can cello DI Casar. E bast,\nBellini\n"},
{"review": "\nOh, boy. Reviewing a film that so many critics have been writing about\nis so hard, but also deserves a try for sure. The original Star Wars is\nnot that kind of movie you love because it's so well made or so complex\nand deep; you love it because it makes you happy. George Lucas back in\nthe day didn't want to create the perfect sci-fi movie (he says so in a\nRolling Stones review), as that was \"2001: A Space Odyssey\" in his\nopinion; he wanted to make something special in its lightness, a space\nopera not focusing on space (as did its future rival, Star Trek), but\non a very, very simple story of a rescue (and later on in the saga, a\nfamily). Each character is just perfect in his role: Luke, the hero,\nwith his strong sense of duty; Han Solo, the roughneck, a guy whose\nrole in the universe is not yet written but soon will be; Princess\nLeia, a role model for girls at a time when a woman leading a group of\nadventurers was just fantasy. And this is just the main squad. I won't\ndwell on the amazing comedic commentary by the two droids (one of\nwhich, without a single word, became the favorite character of many\nfans!), the ominous figure of the mysterious Darth Vader and the mentor\nObi-Wan Kenobi, with the delicate role of introducing us to the\nmystical side of this world, the Force. No movie is perfect for me, and\nin this case I'll have to state the one, unimportant flaw in the whole\noriginal trilogy: the acting in itself isn't great and some points of\nthe plot are off. That said, the chemistry between the actors is\npalpable and the story is so funny, you don't need to stress every\naspect of it.<br><br>When every single scene in a movie is canon, you know you're watching a\nmasterpiece. 9/10\n"},
{"review": "\nThis is brilliant even though the \"Imperial March\" wasn't composed by\nthe time of it's release. Instead we hear the orchestra playing the\ninfamous \"Imperial Tah-Dah\" as soon as the (not as infamous as the\n\"Imperial Tah-Dah\", but still infamous) Death Star shows up.<br><br>And boy, it is intense. After only like five minutes we finally get to\nmeet the Jawas. And not long thereafter we are introduced to Admiral\nTarkin, one of the greatest villains of all time.<br><br>The only bad thing I can say about this is that it takes almost 100\nminutes before we meet Wedge Antilles, the rebel pilot who leads a\nsquadron of small rebel battleships in the attack against the infamous\nDeath Star. In the latter films we get to know him a lot better though.\nThis is only chapter 4! Don't forget that. And may the force b w/ u<br><br>Best scenes (in chronological order): <br><br>- Opening Crawl (\"It is a period of civil war\" -- do I need to know\nmore than that?) <br><br>- Imperial Cruiser in a jaw-dropping chase sequence. <br><br>- Obi-Wan and Luke having a chat without drinking tea. <br><br>- Han Solo talking with a guy about a malfunction over the phone. <br><br>- The scene where Wedge Antilles squadron gets the work done for the\nday (still one of most jaw-droppiest scenes in any movie)\n"},
{"review": "\nBelieve it or not, I saw this movie at the age of 12, maybe a little\nolder than most kids were when they saw it for the first time. I\nunderstood very little of what was going on because I hadn't seen the\nthree prequels, which I made a mental note to watch after seeing this\none.<br><br>I like the movie because it's a great opening for the second three\nmovies. It starts out with some great comedy from our two robot friends\nC-3PO (voiced wonderfully by Anthony Daniels), and R2-D2. After a\nlittle bit of this, we get to know Luke Skywalker, and the story truly\ntakes off from there.<br><br>I like how the plot clicks along at what I'd call a steady pace. We\nmeet all of the characters in scenes that were set up quite amazingly,\nand it all leads up to the duel at the end, where Obi-Wan Kenobi meets\nhis unfortunate end, which was the saddest part of the movie for me.<br><br>One thing I love about this movie is Darth Vader's voice, provided\nquite magnificently by James Earl Jones. You can feel the tension when\nhis voice is coming out through that mask.<br><br>If you haven't even heard of Star Wars, I recommend you start here if\nyou want to go in production order. However, if you want the entire\nstory, start with Episode I.\n"},
{"review": "\nThis first \"Star Wars\" film(though later sub-titled 'Episode IV') was a\ngroundbreaking, box office shattering breath of fresh air to the\ncinemas, and science fiction in particular, which had gotten bogged\ndown in bleak Dystopian futures. Nothing wrong with that in some cases,\nbut moviegoers craved more, and got it with this extremely exciting\ntale of youth rebellion against an evil galactic empire led by Darth\nVader(I though he was a robot at first viewing as a youngster!) a\nmemorable creation, whose entrances were punctuated by the grand music\nof John Williams, who created an unforgettable score here that kids\nimitated endlessly! Fine cast includes Mark Hamill, Harrison Ford,\nCarrie Fisher, Peter Cushing and Sir Alec Guiness. Climax is truly\nexciting, though film has a few lulls at times, this is still great\nfun.\n"},
{"review": "\n\"Star Wars\" was the start of something new, something different,\nsomething extraordinary for those times. Until today \"Star Wars\"\nconsidered the best Star Wars movie of all times. Personally I liked it\nvery much and I can compare it with the other two movies of the classic\ntrilogy: \"Star Wars: Episode V - The Empire Strikes Back\" and \"Star\nWars: Episode VI - Return of the Jedi\".<br><br>George Lucas makes a great direction (nominated for the Oscar of Best\nDirector in 1978) such the writing and screenplay (nominated for both\nfor the the Oscar of Best Writing, Screenplay Written Directly for the\nScreen) and that great job seemed during the whole movie. Gary Kurtz\nalso did an extremely good job for the Picture of the movie who is also\nnominated for the Oscar of Best Picture.<br><br>The theme of this movie is that Luke Skywalker (Mark Hamill), Han Solo\n(Harrison Ford), C-3PO (Anthony Daniels), R2-D2 (Kenny Baker) and\nChewbacca (Peter Mayhew) are going to save Princess Leia Organa (Carrie\nFisher) from the evil Darth Vader (David Prowse) and they are also want\nto save the universe from the Empire's world-destroying battle-station.\n"},
{"review": "\nThis was the very first movie I was allowed to see on my own. I\nremember that the movie theater I was taken to was one of the finest at\nthe time, which made the experience even better.<br><br>I had the chance to see the action figures even before the movies, so\nby heart, I was a natural fan. I remember all details, from the\nentrance with the scrolling story, the ship pursuit, the first Tatooine\nscene. I just loved everything about it, including the fact that it was\nour very own Tikal that served as scenery for the rebel base in Yavin\nIV.<br><br>Star Wars changed my life, brought to my eyes a world of wonders that I\ndream of, and allowed my child imagination to be transported to what I\nstill consider the best place in the world: fantasy.<br><br>For the time that the movie was made at, the effects were incredible,\nfrom the ships, the blasts, the use of The Force, and the light sabers,\neverything was just amazing, it is a jewel of the cinema history.<br><br>For sure, is a film that I will introduce to anyone I can (and I speak\nof the young-lings) and make sure to keep alive in the tradition we\nkeep with my brother, watching them all every year.<br><br>This is how big of an impact it made on me.\n"},
{"review": "\nI don't even know how to review this. This movie is a timeless classic.\nThe special effects are fantastic. The acting is great. The plot is\ngreat. Nearly everything about this movie is great. I think that\nanybody can enjoy this movie. I give this movie such high praise. This\nmovie isn't my favorite Star Wars movie, but it is close. It is one of\nmy favorite movies of all time. I've seen this movie probably 75 times\nin my life and it never gets old. This movie is a masterpiece. All of\nthe characters are great from Luke Skywalker to Han Solo to Leia to\nDarth Vader to Grand Moff Tarkin to Chewbacca to Wedge Antilles to Ben\nKenobi and so on. I love this movie.\n"},
{"review": "\n1977 was the year that kicked off an iconic batch of stories set a long\ntime ago, in a galaxy far far away. From the dynamic mind of George\nLucas, 'Star Wars' is a monumental piece of sci-fi greatness, in which\nit is a film that all aspiring sci-fi writers and directors have looked\nat for inspiration. With a creative plot and characters that only a\ntrue imaginative mind could've created, a stage was set for much\nbeloved film trilogy.<br><br>The casting was great, I don't think anybody could ever imagine the\ncharacters introduced in this film being, acting or sounding any\ndifferent to how they do here. Leading the way is Mark Hamill as Luke\nSkywalker, closely followed by the other main protagonists Han Solo\n(Harrison Ford) and Princess Leia (Carrie Fisher) which led to a\nstellar cast allowing their chemistry to grow as the movie went on.\nAlso present and profound were Alec Guinness as Obi-Wan Kenobi, Anthony\nDaniels and Kenny Baker playing droids C-3PO and R2-D2 respectively,\nPeter Mayhew as Chewbacca the wookiee, and David Prowse as Darth Vader,\nvoiced by the legendary James Earl Jones.<br><br>But enough about the actors, what really makes this movie special are\nthe visuals, graphics and special effects that nobody had so\nimmaculately achieved at this point in time; the TIE fighters scenes\nand the soaring planetary landscapes must've been so breath-taking, in\nwhich case they still are today. Along with excellence in special\neffects, there is also excellence in original score-writing, in which\nmost will agree that John Williams' best work lies within this movie.<br><br>Dynamic, creative and at times very funny (mostly because of C-3PO),\nStar Wars lives as a real innovative turning-point in cinema, though\nthe emphasis on the effects and visuals almost overshadows the fact\nthat this is one of the greatest and most lovable films of all time.\n"},
{"review": "\nI think that this movie is definitely one that I am sure that at some\npoint in their lives EVERYBODY has seen. When I was a very young child\n(from when I was about 6 or 7 to when I was 11 or 12) I was OBSESSED\nwith this series from these movies (yes including the prequels...\nmoving on) to the video games.<br><br>Now without me being biased to the fact that I adored all things Star\nWars as a child. The Star Wars Universe is one that fans of fantasy or\nSci-fi might be drawn towards (I say \"might\" for a reason that there\nare some people who don't like this). John Williams music score is\nfantastic. The acting is great, especially from James Earl Jones as\nDarth Vader, Harrison Ford as Han Solo and Alec Guiness as Obi-Wan\nKenobi. The other acting ranges from good to decent.<br><br>So this movie is a good one to sit down and watch for an entertaining\nnight. I will rewatch the sequels and the prequels to see if they are\nas good as I remember them (with this one it wasn't but then again I\nwas a kid when I first saw this).\n"},
{"review": "\nI saw this as a kid, and I have to say, this is a great start to the\nStar Wars franchise. Star Wars does a great job of introducing all of\nthe characters that are so important to the Star Wars films. Luke\nSkywalker, Obi Wan Kenobi, Princess Leia, Chewbacca, Darth Vader, and\nHan Solo. They all are great. Also it establishes the main conflict of\nthe film right off the get go. Because of how great they do of\nestablishing characters and conflict it allowed the sequels to succeed\nas well and further continue from this film.<br><br>Also the story is awesome in this film. Luke Sky-walker, a farmer,\nbecoming a Jedi knight and going on an adventure to help rescue the\nprincess. This is a great story about how someone who thought they were\nnothing becomes something that is truly needed.<br><br>The action is legendary. There is plenty of laser fire in this film and\nwho could forget the epic attack of the death star towards the end of\nthis film. Films like this show that you do not need constant action\nthrough the whole film at every part. There is great setting up of\nevents prior to much of the action taking place. This helps establish\nthe conflict and allows for the audience to understand the situation\nand why the action must take place.<br><br>Music is awesome as well. Star Wars always had the best music of any\nfilm. However Star Wars does not have nearly as good of Music as \"The\nEmpire Strikes Back\" and \"Return of the Jedi\". Or even as good of music\nas was in the three new Star Wars films.\n"},
{"review": "\nJust an opinion. Star Wars. The name clearly shows what is seen in the\nmovie, but it's amazing how the saga, or rather the \"universe\" Star\nWars, does not pass the feeling that something is bad, something evil\npeople, the image of Darth Vader with the music who makes perfect sync\nwith him, is not enough to scare anyone. The death of Darth Maul may\nhave been the scene of more thriller saga, and even had blood. I say\nthis tongue in cheek, but of course shocking scenes of thriller genre\nare not part of Star War, and should not do. The complexity of the\nlifestyle of a Jedi is a portrait of a disciplined good nature. The\nStar Wars universe has no doubt, makes sure the existence of force and\nit is proved in all the skills displayed by the knights, it has the\nForce not as a god, but as something that connects everyone and made\nthem everything. The trips are simple in hyperspace! I think George\nLucas portrayed much our world in Star Wars, however left the dark side\nof the force less obscure than ours.\n"},
{"review": "\nReview: <br><br>I was 10 years old when my dad shows me that piece of art. As a kid,\nand when we see star wars for the first time, we discover an other\nworld, we passed nights to dream about it, being the hero of that\nworld, simulating fights with light saber... Of course i'm not from the\nstar wars generation, i grew up with the second trilogy. But that first\ntrilogy and especially this movie got an unique atmosphere. The\ndeterioration of my old VHS copy shows the love i've got for this\nmovie, that we can't see now from digital files.<br><br>Story: 10/10 <br><br>The story is the strength of that one, we find a narrative plan reused\nby many sci-fi movies later.. <br><br>Directing: 7/10 <br><br>The directing is classical, very academic. The development is linear\nand understandable. <br><br>Photography: 10/10 <br><br>Sets are the strong point of this episode. All cult for my taste.\nEditing is good with this innovative transition effect. Obviously,\nspecial effects look aged but they're still convincing. <br><br>Music: 10/10<br><br>Obviously, what would be Star Wars without this perfect music. Each\ncharacter has his own theme that blends extraordinarily well with the\nkind of space opera. <br><br>Cast: 8/10 <br><br>A good casting, including a convincing Mark Hamill.<br><br>Final note: 9/10<br><br>'Sorry for my bad English, i'm french so be kind ;-)'\n"},
{"review": "\nStar Wars is one of the best films ever to be released in modern\ncinematic history. Definitely one of the best movies from the 1970's.\nIt has good use of CGI, special effects and visual effects. They\nactually look very good for a movie released in the 70's. When this\nmovie came out, it was a box office hit. And to this day, it is getting\nmore and more popular. It definitely had a huge impact on modern\ncinema. This movie has a lot of heart and soul. The acting was just out\nof this world. Harrison Ford was awesome as Han Solo. James Earl Jones\ndid an amazing job doing the voice of Darth Vader. While David Prowse\ndid a great job doing Darth Vaders physical movements. Darth Vader is\none of the best movie villains of all time. Star Wars is a true\nmasterpiece.\n"},
{"review": "\nDirector George Lucas brings one of the most fantastic pieces of film\nin cinematic history with the groundbreaking \"Star Wars\". This movie\ncan prove that I am a complete science fiction freak. Farm boy Luke\nSkywalker has been asked to protect Princess Leia from the evil\nclutches of Darth Vader, and the Death Star station. Along the way, he\nis joined by uncle Obi-Wan Kenobi, the greedy Han Solo and his trusted\ncompanion Chewbacca, and two droids named R2-D2 and C3-PO. Throughout\nthe movie, it's a stunning journey that beat the odds of cinema. \"Star\nWars\" is one of those epic science-fiction flicks where you already\nknow that you will enjoy it in the end. Let me just say that once those\nflying credits through the galaxy in the beginning are finished, you\nare in for a treat. I enjoy everything about this spectacular piece of\nwork. The casting of Mark Hamill, Harrison Ford, Alec Guinness, and\nCarrie Fisher was quite excellent. Even the characters of Chewbacca,\nR2-D2, and C3-P0 seem so memorable. George Lucas delivers an incredible\ndirecting job, and brought a lot of his unique imagination to the\nscreen. John William's breathtaking score blew me away, the visual\neffects are astounding and it puts you into the action, the sound is\nsense-tickling, the editing is pure genius, the costumes are well\nunique, and the art direction feels so imaginative. This is one of\nthose movies where it can let you escape the real world, and send you\ninto a world like no other. So, if you are a fan of science fiction,\nand you enjoy watching George Lucas flicks, then \"Star Wars\" is the\nmovie for you! \"Star Wars\", in my review, \"one of the most imaginable\nscience-fiction movies ever made\".\n"},
{"review": "\nThis post is about the original vs. the tweaked remake.<br><br>There is only one decent version of this film and that is the original\none!<br><br>Several scenes are ruined by the inclusion of silly CGI creatures\nrunning around on the remakes, also the remakes include explosions that\nare obviously lifted from Star Trek.<br><br>There are those of us who would rather see stop motion animation than\nCGI because it is actually more realistic \u0096 every fiery explosion (in\nthe background as the hero runs away,) looks identical, also there is\nsomething unreal about CGI footage that is much better done With matt\noverlays.<br><br>Same with King Kong \u0096 give me the original any day.\n"},
{"review": "\nThere is not much to say about the original Star Wars movie which\nhaven't already been said a million times. These movies have been\nanalyzed in multiple levels, but the best way to describe the original\none, in my humble opinion, is: this movie is a celebration. A\ncelebration of movie-making as a visual media, with an endurable and\nmagic story, full of adventure and excitement: that's the lasting\nappeal of Star Wars. Aside of all the hype or pseudo-intellectualism\nsurrounding the criticisms of the movie, the simple fact is that it's\njust a familiar story (\"The peasant rescues the princess and becomes a\nknight\"), told in such a visually creative way and funny mood, that it\nbecomes something entirely fresh and new.<br><br>Leaving aside the criticism George Lucas deserves for some other movies\nhe made before and after \"Star Wars\", it's undeniable that this was his\nfinest hour, and one of the finest moments in cinematic history.<br><br>10/10\n"},
{"review": "\nI was 24 when I saw this when it first came out. I saw it on a really\nbig screen, and it was the first film I had seen with sound so\ncarefully constructed on a system which did justice to it. I couldn't\nbelieve the bass rumble when the Imperial destroyer appeared overhead\nchasing Leias' shuttle-craft, and the stereo \"whuzzh\"ing of the\nlight-sabres across the auditorium - wow! <br><br>And I had been a big fan of the Lensman books in my teens, and this\nmovie was quite obviously cut from the same cloth - this was the first\ntime that space opera had appeared on the screen and been visually\nconvincing. Even now I still taste that magic when I watch episode 4.<br><br>Hindsight shows that the script wasn't that hot, and that the\ncharacters were fairly cardboard. But the movie is so full of great\nmoments that I can forgive it most things.\n"},
{"review": "\nThere really is no way to describe this movie. It changed everything in\nfilm after it. It is one of the top grossing films in history. But what\nmade the movie so great? It was the fantasy. It gave people hope when\nthere was little hope left. It recaptured people's imagination. When it\ncame out in May 1977 America was in bad shape. The Vietnam War had just\nended which took 58,000 young mens' lives. President Nixion had let the\ncountry down. And the hippie movement had swept the country. Then a\nlow-budget movie called Star Wars comes and takes America to a galaxy\nfar, far away.<br><br>The story is powerful. It tells the story of young farm-boy Luke\nSkywalker's journey to heroism, but along the runs into quirky\ncharacters and mishaps. It truly tells the hero's journey from pion to\nvictorian.<br><br>The characters all have there place. Mark Hamill truly delivers the\nrole of Luke Skywalker. Carrie Fisher and Harrison Ford played their\ncharacters of Princess Leigh and Han Solo very well. Princess Leigh\nbroke that princess stereotype that many people knew and Han Solo is\nthe rough-and-tumble space cowboy that you love to hate. And Peter\nMayhew defiantly captures the feat of playing Han Solo's wookiee\nco-pilot Chewbaca. And the best of all is Sir Alec Guiness's portrayal\nof Jedi Master Obi Wan Kenobi. His elegance and sophistication. And who\ncould forget James Earl Johnes and David Prowse as Darth Vader. And\nC-3PO and R2-D2 and comical relief to the situation.<br><br>And John Williams couldn't have done a better score. It adds excitement\nand enchantment to the story.<br><br>And the Special Effects is there to compliment the story. It was truly\nfuturistic and amazing for its time.<br><br>Finally the story reminds us that there is Good and Evil and Evil has\nto be defeated. And Good shall conquer!\n"},
{"review": "\nThis movie might have been the greatest movie of all time.<br><br>Think about it, it was the first movie ever to do so many things, or if\nnot the first, the one that really trademarked the techniques. The\nother day I watched Avatar, and at the end, when the dragon-like\ncreature flies off into the sunset, its wings formed an X and I said,\n\"oh hey, they totally ripped that off star wars.\" The\nsave-someone-by-flying-in-from-above from seemingly nowhere move came\nfrom Star Wars and the Millennium Falcon, the list is endless. The\nwhole idea of \"the force\" has been re-manifested in so many ways,\navatar being a recent example, again. The more I think about it, the\nmore groundbreaking this movie was.<br><br>And I haven't even gotten to the special effects breakthroughs, which\nis what the movie was known for at the time. I'm not really an expert\non that stuff but suffice to say Star Wars had the best special effects\nby far of any movie at the time it came out.<br><br>The Acting was terrific, and though the sequels were almost as\nastounding, they couldn't quite match the first one. A truly special\nfilm that every person should see before they die.\n"},
{"review": "\nAnyone who puts less then 9 stars should be banned. I am sure someone\nwill copy/paste other arguments about the problems with the movie they\nfound at other sad loner fanboy sites that still live at home with\ntheir parents. Yet, the only reason they found said errors is because\nthey watched it a billion times and are trying to be trendy. Most of\nthe errors are not that huge anyway. Face it, this is the greatest\nadventure of all time.<br><br>Words do not do this movie justice. Its Star Wars, if you are one of\nthose uptight snobs who haven't seen then check out it, it will blow\nyour mind and make you feel young again. It will remind you will people\nlove films. Without Star Wars there would be Alien, Terminator, Indiana\nJones, ID4, Matrix, Avatar and about 75% of the movies that are still\npopular today. It is the beginning of the modern age of film making. It\nhas aged well and even though Lucas sorta botched Han shots first, he\ndid a good job of fixing some of the errors of the special effects for\nthe time.\n"},
{"review": "\nWhen George Lucas was writing Star Wars he certainly had the force with\nhim, a truly inspiring force that led to the greatest masterpiece of\nall times. For many this movie may be thought as another good vs evil\nsci fi movie, however this is not the case, Star Wars changed the\ncourse of film history,it gave a whole different meaning to the word\nsci-fi, enchanting visuals, great costumes, great plot and great\nacting. The actors were like they were born to play these roles, Marc\nHamill as Luke Skywalker, the heroic kid that has never met his\nparents, loses his aunt and uncle yet with the help of Obi-Wan, played\namazingly by Alec Guiness, he starts his journey to fight against the\ndark side, together with his friends, Harisson Ford who perfectly fits\ninto the shoes of the arrogant captain Han Solo and Carrie Fisher who\nplays the beautiful and decisive princess Lea. I am 18 and it's really\nashame because i listen to my friends etc talking about star wars and\nconsidering it a piece of crap, it's really ashame because those as\nmany other people judge because of the new trilogy, however the\noriginal sw trilogy deserves everyones respect because we are talking\nabout an epic, people say that the story is nothing new and they have\nseen a similar one many times, however think just think of how original\nthis movie was back in 1977, it was a turning point in history. I\nbelieve that all true movie lovers should watch the original trilogy\nbefore daring to judge this cinematic colossus that has lived its mark\nin the history of movies. We all owe respect and appreciation to Lucas\nand all the people that helped for this movie to be made and for young\npeople like myself and millions of others to be talking for it even\nthree decades later.\n"},
{"review": "\nGood clean fun. This movie didn't ask you to think about any deep and\nweighty subject matter. It was good vs. evil almost literally in black\nand white. And when you left the theater, you didn't have to digest\nwhat you had just seen. To top it off, it reached out and grabbed you\nin the opening scenes with a fantastic shot of two ships in space doing\nbattle. Even the bar scene was believably because the weird characters\nwere not computer generated. They were played by real people in\ncostume, and the viewer knew it and could live with that.<br><br>It was clear at the end that Darth Vader had escaped the destruction of\nthe Death Star, but it was unclear how the small, one-man fighter he\nwas in could have traveled far enough on its own to be rescued.\n"},
{"review": "\nTo this day, all of the original 3 (4 thru 6) still excite me to no\nend. I was surfing the satellite TV selections and came across the\nbeginning of the move. Just hearing the opening music and watching the\nopening scenes brought me back to the time when we went to movie\ntheaters to see films and sat up front to get the total effect of a\nmovie.<br><br>It's sad, and, in a way, good to know that people don't have to go to a\ntheater to get that experience. Granted, if you want to be one of the\nfirst to see a film... you know what I'm getting at.<br><br>Star Wars, and all of it's later incarnations, are masterpieces from\nMr. Lucas that can never be denied in their place of glory in American\ncinema.\n"},
{"review": "\nIt's difficult to look at this film without offering the comparisons of\nEmpire and Jedi. Sure they had much bigger budgets and a more intricate\nplot in the case of Empire. But Star Wars must be viewed for what it\nwas intended as, the opening of a whole new world. As a cynical 33 year\nold I watched Star Wars for the first time in years and thoroughly\nenjoyed it. It's true that some of the dialogue is stupid, the effects\na little shaky and even the acting (Hammil's especially) is wooden in\nplaces. But film is craft and to imagine one mans vision crafted it is\namazing. It could have been terrible, it could have been a stinker but\nhe put a team together that to me, pulled off miracles. The story is\nnot original, it's a composite of every fantasy adventure written but\nit makes for a dazzling spectacle. John Williams, the man who made Jaws\nthe tension filled thriller it is, scores a dramatic, fan fare opening.\nIt's as if he knows how important this film is. I have to love it. More\naccessible than Lord Of The Rings and a pure piece of pop history. Star\nWars is not the greatest film ever made, but it's certainly an\nimportant one\n"},
{"review": "\nI seem to remember that many years ago George Lucas admitted that the\nbasic core idea for the movie was wholly derived from the Seven\nSamurai. Just as the Magnificent Seven had lifted that plot and\nre-located it from Japan into Mexico, so Lucas took the very same idea\nand re-located it into Outer Space. Count the heroes: Obi Wan, Luke\nSkywalker, Han Solo, Princess Leia, Chewbacca, R2D2 and C3PO. Seven,\nright? And they have to take on the whole menacing force threatening a\nnice, peaceful civilisation and restore order and justice. Which of\ncourse they do. OK, that basic plot is hugely embellished and adorned\nwith highly impressive special effects (even now they still look\ngreat), but at the heart of it the original Star Wars film is\nessentially a hi-tech sci-fi re-telling of the Seven Samurai. BTW, I\nstill can't bring myself to think of it as anything other than Star\nWars, \"in brackets the first one\". How can it be Episode IV when it was\nthe first one to be conceived? Is Lucas ashamed to admit he's just\nmilking his cash cow? Or ashamed to admit he's not really done anything\nelse of note outside of the Star Wars franchise? As for earlier\ncomments about this movie having changed the world - or even just the\nworld of cinema - all I can say is get real, get a life and get out\nmore. It's a couple of hours of entertaining fantasy, and not all that\noriginal at that.\n"},
{"review": "\nThis is the first star wars movie that earned ambitious George Lucas an\nOscar nomination, and millions of dollars. This was the launch to\nvarious sequels , toys, games and defined the star wars mythology like\nno other. I have to give it to Lucas, the story is amazing. The\ncreativity is awesome, the excitement is average (because the special\neffects in recent movies have more zest) but nonetheless it will still\nhave it's place in the history of great movies. Luke Skywalker lives\nwith his boring uncle Owen who aspires for Luke to continue the family\ntradition of being a farmer and to take care of their land when he\npasses away. But Ben Kenobi, an old \"hermit\" opens Luke's eyes for\nsomething more adventurous. He helps Luke go on an amazingly stellar\njourney to rescue a tough princess from the bad but likably powerful\nDarth Vader. To get there, he meets the cocky but handsome spaceship\npilot Han Solo and his hairy buddy Chewy. Also, bringing in the humor\nare two smart-ass pieces of machinery, C-3P0 and R2D2.\n"},
{"review": "\nLately, I have been writing reviews on some of my favourite movies when\nI realized I had not reviewed or even seen Star Wars in great some\ntime.<br><br>Star Wars is very fast moving with great acting performances, lines and\nthe feel that the people enjoyed what they were doing. The film is a\ngreat piece of work to the sci-fi genre and is presented cleverly and\nwell written. This is another great example of a movie that has not\nbeen expected to do well in cinemas but has anyway. Out of the few\npeople who have not seen this, or there has been a large gap since your\nlast view, you should immediately go and get your hands on a copy of\nthis fantastic movie.<br><br>Overall, this movie is a service to all great movies. It throughly\ndeserves its rating and goes to show once again you don't need to have\nthe biggest budget, to come out with the best movie. I rate this 83%.\n"},
{"review": "\nThis is the movie that probably changed sci-fi and fantasy films of the\ncinema, full of action, imagination, nostalgia, character development\nand charm. The 4th movie of the Star Wars trilogy, but the first and\noriginal Star Wars movie filmed, it starts with a ship being invaded by\nDarth Vader, who has kidnapped Princess Leia (Carrie Fisher). Later on,\nLuke Skywalker (Mark Hamill) teams up with Han Solo (Harrison Ford),\nChewbacca (Peter Mayhew), Ben Kenobi (Alec Guiness), C-3PO (Anthony\nDaniels) and R2-D2 (Kenny Baker) in an attempt to rescue the Princess\nLeia, who leads a group of rebels to defy the evil empire controlled by\na ruthless Sith Lord and guarded by his trusted servant, Darth Vader.\nThey must also stop the Death Star from destroying the galaxy. The\nresult is one huge mission to save the galaxy, supported by superb\ndirection and story from George Lucas and a memorable music score from\nJohn Williams.<br><br>Each character was given his/her unique purpose in the movie, but all\nare committed to achieving triumph of the dark forces of evil. This\nfast-paced movie gives the audience a break from the reality of the\nproblematic world, and takes you to a journey into an imagination\nbeyond belief. Not to be missed.<br><br>So, may the forces be with you.<br><br>Grade B+\n"},
{"review": "\nWow. When I was ten years old, my dad came home and said \"It's time to\nwatch some REAL movies.\" He brought home Raiders of the Lost Ark,\nKelly's Heroes... and 'A New Hope'. I was astonished. Raiders of the\nLost Ark had the most impact on me, but Star Wars was just as good, if\nnot better - a true epic for all ages.<br><br>It's so good it's influenced many films over the years - Serenity,\nSpaceballs, The Last Starfighter - and some less obvious - Pirates of\nthe Caribbean: The Curse of the Black Pearl (a cocky young rogue teams\nup with an innocent boy to save a princess from an evil supernatural\nwarlord - sound familiar?) - and it really does live up to its\nreputation.<br><br>It's cast of memorable characters - Luke Skywalker, Han Solo, Leia\nOrgana, C-3PO, R2-D2, Chewbacca, Obi-Wan Kenobi, Darth Vader...\nbrilliant. If you look for it, there's even a shot of smoking corpses\non Tattooine. How that got past the censors...<br><br>Anyways, buy some popcorn. Put it in the DVD. Sit on the couch. Immerse\nyourself in the greatest science-fiction film of all time.<br><br>The force will be with you... always\n"},
{"review": "\nI really enjoyed this movie a lot. I am extremely impressed by special\neffects especially for its time (1977). I find it way betterthan the\nnew ones(1,2,3). I have to say that my favourite part is whenHan Solo's\nplane goes into hyper speed because they are trying to go tothe death\nstar to save Leia. That was a really awesome part for me. Thefirst time\nI saw the movie, I was like WOW! what an incredible movie! I enjoyed\nevery single part of the movie, it wasn't boring for me for onebit.\nStar Wars: A New Hope has got to be the top 10 movies of the 70's.I\nrecommend if you like this movie, go see the two other old ones. I rate\nthis movie an 8 out of 10.\n"},
{"review": "\nYes, the original can still stand head and shoulders above the\ncompetition. One of the all-time biggest box office titans, the first\nfilm in the original STAR WARS trilogy is a 24-karat film classic in\nthe same vein of such cinematic masterpieces as The WIZARD OF OZ (1939)\nand CASABLANCE (1942). Even the decades of sequels, lame knock-offs,\nand crass commercial tie-ins cannot dim the sheer brilliance of the\nultimate space opera. When re-watching the film all these years later,\nit remains impossible not to get caught up once again in the film's\nirresistible sense of adventure and excitement.<br><br>Much of what makes the film special (and what director/writer seems to\nhave forgotten when creating his uneven prequel trilogy in the\nlate-nineties/early-2000's) is the relative simplicity of the entire\nproject. This is not to deny the various technical merits of the film,\nas Lucas is a true pioneer in large-scale effects-heavy film-making.\nThe still-impressive special effects designed by Jonh Dysktra and John\nStears set a new standard for film visual effects, and the production\ndesign and Rick Baker's make-up effects are top-notch without being\noverdone. Impressive as the film's technical merits remain, however,\nthe film's true heart lies in good old fashioned story-telling.<br><br>In the end, STAR WARS excels as entertainment simply because it is a\ngreat story told in an fresh and inventive manner. The characters have\nall justifiably become pop culture icons, especially Mark Hamill's\nquintessential put-on hero Luke Skywalker, Harrison Ford's quick-witted\npilot Han Solo, and everyone's favorite bickering robots, C-P3O and\nR2-D2. The perfect amount of sophistication is brought to the\nproceedings by screen legend Alec Guinness, who delivers a performance\nof great nuance and indisputable class. Best of all is the infamous\nDarth Vader (sinisterly voiced by James Earl Jones), who remains one of\nthe silver screen's greatest villains.\n"},
{"review": "\nI can still remember sitting in the theatre at 4 years old watching\nthis movie with my Dad. The movie is great overall, but perhaps one of\nthe best scenes in all of cinema is the great Battle at Yavin where the\nstruggling rebellion destroys the evil Death Star. Luke Skywalker came\nto be a childhood hero for me. The magnificent score by John Williams\nonly hightens it's brilliance. <br><br>This movie for me is the best of the trilogy and I'm sure will stand\nthe test of time as with all great movies. You might say I'm somewhat\npartial to this movie being from the bay area near to where George\nLucas directed some of the movie so I can appreciate his direction and\nhis style of directing.<br><br>I give this movie a 9/10.\n"},
{"review": "\n\nStar Wars is the stuff of legends, mainly because it finds its inspiration\nin countless folk legends and archetypes, but also because it became the\ninspiration of an era. It was probably the first ever cinematic cult\nphenomenon and one can measure its power by the sway it still holds 27 years\nafter its release.<br><br>The story couldn't be simpler frankly so do dwell on this detail would be to\nmiss the point entirely. The backdrop is the main character of the film and\nit is nothing short of miraculous! The alien vistas and locals while\notherworldly have a worn look that makes them unbelievably real (unlike the\noften fake-looking CGI of the prequels). The technology looks real. This\nauthentic look gives the action scenes a power almost transcendental. It\nsurpasses anything we've ever seen because despite it's otherworldlyness it\nall works. So the world Lucas creates more than makes up for the bland\ncharacterizations (these are only archetypes after all so don't expect too\nmuch depth, that's a advantage Empire Strikes Back has over the entire saga)\nand acting, although veterans Alec Guiness, Peter Cushing and James Earl\nJones give this more dignity and weight and there's a very welcome cynical\n\"this can't be real\" look from Ford that means the film doesn't take itself\nall too seriously (something lacking in the prequels).<br><br>This vision of fantasy has it's flaws but it still solidly deserves cult\nstatus for it's gargantuan strengths: a legendary score by John Williams,\nera-defining special effects, a mythology and fantasy that rival anything\never imagined by a film-maker, great action and a pure naive heart that\nmakes it impossible to resist and is seriously lacking in today's\nblockbusters.<br><br>Star Wars is more than a film: it is in itself a reason to love movies. It\nis a testimonial to man's imaginative powers. <br><br>\n"},
{"review": "\n\nA highly entertaining piece of movie making.  It is a unique and \ninteresting film and is one of a kind in its various genres.\nIts a fun film that can become humorous at times but at the same\ntime has a more serious aspect to it.  Its the sort of film you can\nwatch over and over again without getting bored and be thrilled\nevery time.  \nStar wars allows the watcher to travel through an exciting and\nunpredictable journey full of action and adventure.   \nI recommend it to anyone that enjoys science-fiction, fantasy,\naction, adventure,,,,,,,,,,,,,,!  \n\"the force will be with you.... always\"\n"},
{"review": "\n\nThere have been written thousands of reviews concerning \"Star Wars\" and the\nbig problem is what can man add which hasn't been add before? Absolutely\nnothing, perhaps that this blockbuster from 1977 was the start of it all.\nWhen you see it more than 25 years later it might look a bit dated in some\nways but you know that this movie was responsible for oner of the biggest\nimpacts on the silver screen ever that you forget it all. This is the\nultimate wet dream for anyone who like to be blown away by some\nfantasyadventure, hell...every second of this movie has been spoken about,\ntheories were given just like if \"Star Wars\" was the most important thing\never and in our little fantasyworld it perhaps can be...\nA movie to be see over and over and an epic that will arise above all,\npeople still will watch 1000 years later, if only we live...\n"},
{"review": "\n\nThe ancient Greeks had Homer. The middle-aged italians had Dante. The\ncontemporary world has Lucas. A great film that brought the value of\nmythology in science-fiction and continues to show to generations the\npower\nof a good history with images made from several artist.\n"},
{"review": "\nHonestly... what on earth could I say about Star Wars that has not\nalready been said? What could anyone say? <br><br>If you look past all the hype, the thousands upon thousands of weirdos\nwho tape themselves swinging lightsabers on camcorders and the\nlimitless merchandising, you'll find a movie that is, in one word:\nlegendary.<br><br>Star Wars. *cue theme by John Williams*<br><br>There are few films that have made more of an impact in the film\nindustry, let alone our culture. The special-effects that George Lucas\nintroduced were revolutionary for their time, and helped to pave the\nway for the amazing technological advances we have today. Props to\nGeorge.<br><br>And as far as the movie itself? *sighs* It's so easy to fall in love\nwith this movie. Ever since I was a kid, this movie had my heart.\nEverything from the characters to the places you visit to the story. It\ndrags you in to that galaxy far, far, away... and to this day it\nremains both a visionary and cinematic masterpiece.<br><br>(Plus it features a young Harrison Ford... hee hee)<br><br>Forget 10 out of 10. Star Wars is, and will always be, off the charts.\nLOVE IT. *wink and grin*\n"}
]