[
{"review": "\n\"Gladiator\" definitely is a classic film as it combines a simple, but\nmoving, story with beautiful scenery, filming, direction and score \u0096 it\nis truly a \"complete\" movie.<br><br>I am mostly compelled with the beautiful script which in a way reminds\nme of poetry, though it is still everyday language. I love the acting\nportrayed by the late Oliver Reed and also Richard Harris. Russell\nCrowe, Djimon Housou and Joaquin Phoenix are also superb and the parts\nsuit them perfectly. There are also a number of less \"popular\" artists\nwho also deserve a big \"bravo\". Amongst them I have to mention ex-Mr\nUniverse Ralph Moeller who is mostly used as the comic relief of the\nmovie. In Gladiator we can also the beautiful and popular Maltese TV\nStar and actress Ruth Frendo, who although has a small part, she is\ntotally brilliant and outstanding.<br><br>Actually I got to IMDb while I was looking for her name on the\ninternet, in fact on IMDb she has some very stunning photos. I was\nlucky to meet Ruth Frendo whilst she was filming in another Maltese\nproduction. Ruth Frendo is not only a gorgeous and talented actress but\nshe is also amazingly intelligent and very down-to-earth. We will\ndefinitely be seeing more of her work in the future... <br><br>The scenery used for \"Gladiator\" is brilliant \u0096 and the opening battle\nscene is definitely one of my top favorite scenes. The modern camera\ntechnique contrasts sharply to the brutality of the gladiators actions\nand blood shed during the movie; and I love the light contrasts thanks\nto the lenses which most definitely have been used to create a surreal\nfeel to the entire movie.<br><br>\"Gladiator\" deserves all the awards and great reviews it has received,\nand for those of you who still haven't gone and watched it \u0096 I can\nassure you that it will be well worth your time and money. So go on and\nrent it now!\n"},
{"review": "\n\nMost films require that the viewer identifies with the character to truly be\nengrossed with the film. If you can't feel something for the character, than\nthe audience is lost.<br><br>Luckily, in Ridley Scott's case, Russel Crowe is so captivating and\nconvincing as a general loved by his troops and as a slave loved by the\npeople that the movie really works. Possibly one of the greatest actors\ntoday, Crowe carries this epic film on his very capable shoulders.<br><br>Not to say that he is the only reason this works. The supporting cast, most\nnotably Connie Neilsen, buoy the film to new perspectives.<br><br>Jacquin Phoenix definitely captures the egotisitcal persona he should\ndisplay, stealing every scene he's in. Phoenix will surely be put on the map\nwith Gladiator.<br><br>But the real shining star in this film are the incredible action sequences\nwhich jolt the viewer right in with the opening sequences, as Maximus' true\nworth to the Roman Empire is displayed. Scott's camera work within these\ncompleted sequences takes a modern twist that really works for the gruesome\nscenes.<br><br>Crowe will now get the respect he deserves for this collosal performance.\nGladiator makes the most of its 2 and a half hours, marking a triumphant\ncomeback for the long forgotten epics of the classic days of film. ALL HAIL\nMAXIMUS!\n"},
{"review": "\n\nOnce again, Director Ridley Scott proves to be as professional as one can\nbe. The recreation of ancient Rome is splendid, with all its magnificent\nbuildings and atmosphere and he is able to show with all brightness the\ngreatness of the Roman Empire, with its political problems and military\ndiscipline, and love and treason, of hate and jealousy, that still have a\nplace in our world today. But the story has a glow of its own, to which all\nthe beautiful scenery (believe me, it's awesome!!!) and great cinematography\nare just balancing factors. The plot is a rich one, that is as dynamic as it\nis present. He once again, after Blade Runner, 1492, and others helps us\nvisit the depths of the human soul, which remains the same over all our\nhistorical and social experience. Even the fights, are displayed in such a\nway that all the blood is quite discrete, but still, making us feel like\nscreaming and jumping out of our seats. I would also like to point out the\nperformances of the cast, that is surprisingly good. We have some actors and\nactresses, who are not Hollywood icons, but are are greatly able to move the\naudience among screams and tears. All in all, we have guys like Russel\nCrowe, who are coming out to be part of a new and extremely promising\nharvest of people who are making each time more fans around the world. Well,\nyou\nshould see for yourself!\n"},
{"review": "\n\nThis is wonderful storytelling.  The opening Battle Scene simply mesmerizes,\nshowing the brutal nature of combat for Roman conquests.  I went back to see\nthe film again.  The first time I didn't hear anything Crowe said before the\nbattle.  I was just too visually caught-up.  The second time I listened very\nclosely and caught the wise yet succinct line from Maximus \"what we do in\nlife... echoes in eternity.\"  Awesome.<br><br>A simple man v. an emperor.  I just loved the resilience Maximus showed\nthroughout the movie.  I find in most movies, there is an irritatingly slow\nprocess where the character has to \"find himself,\" not so with Gladiator.\nMaximus does what is needed.<br><br>I liked how there were only two or three issues within this film.  One was\nthe afterlife.  Aspects of the afterlife are opened, but not overdone.  Love\nof family is given sizable focus. I liked the theme of love of country that\nwe see as well, although it may not be justly deserved, it is never\nquestioned.<br><br>The visual effects were amazing.  It actually had me wanting to believe\nthat's the way Rome actually looked in all it's glory.  The battle of\nCarthage reenactment was really great.<br><br>The ending is just hypnotic. Intentionally or unintentionally it was simply\nemotional.  The music is wonderfully beautiful as if Maximus' family are\ntelling him...you have arrived.<br><br>Bottom line: magnificent.  Visually and emotionally satisfying.\n\n"},
{"review": "\n\nI love history, and to me, Gladiator is a masterpiece. It is the most\naccurate picture of the Roman Empire Hollywood has ever put out.  People\ndeclare Spartacus a masterpiece, but Gladiator far outdoes Spartacus in\nquality.  The costuming, the acting, the screenplay, the scenery, and the\nfighting styles made me think that I had traveled back to 180 A.D.\nRussell\nCrowe is a true Hollywood tough guy, and he is superb in this movie.\nJoaquin Phoenix is outstanding as a villain, one of the best in movie\nhistory.  He played his character as if it were a psychologist's dream\ncase.\nConnie Nielsen plays one of the strongest female characters that I have\never seen.  The choreographer of the action sequences was brilliant.\nRidley\nScott did an outstanding job in recreating the Empire, including the\nmultitude of ethnic groups within the Empire and accurately depicting\neveryday life.  If you're looking for insight into what the Roman Empire\nwas\nlike, this is a perfect depiction.  \n"},
{"review": "\nAn intense Roman epic, a la \"Ben-Hur\" or \"Spartacus,\" it was nice to\nsee something like this made again. It had been since the 1960s that we\nhad seen a 3-hour extravaganza like this.<br><br>Like Ben-Hur, this is a story of a successful man who loses everything\nthanks to an evil man, and then has to fight his way back up to seek\nrevenge on that man and to obtain his freedom back. It's a\ntried-and-true formula. This movie doesn't go to excess on the violence\nas some of the other more recent epic films did, such as \"Braveheart\"\nor \"The Patriot.\"<br><br>The acting is excellent, beginning with Russell Crowe, who has\nestablished himself as one of the best actors of today. Joaquin Phoenix\nalso put himself \"on the map\" as an actor with his portrayal of the\nevil \"Commodus.\" He's so annoying you want to slap that sucker, which\nmeans he's doing a good job acting. Kudos to the rest of the cast, too.<br><br>Too bad they don't make more of these type of films, as they did in the\n1950s and 1960s.\n"},
{"review": "\nThere is so little to find wanting in this film and not wanting to\nmerely repeat its many deserved praises, all I can do is question a\ncouple of historical points.<br><br>It is unlikely that a Roman general would be sold into slavery and\nforced to fight in the arena. Exiled, yes. Killed maybe. Asked to\ncommit suicide to retain his property, most likely. <br><br>It is unlikely that he would return to find his family crucified, of\nall things. Romans were very specific about who got crucified and why.\nRomans usually avoided it, no matter how cruel the tyrant(?) was.<br><br>Roman legionnaires would NEVER have a tattoo unless they were\nbarbarians who got one BEFORE joining a legion. Marking or mutilating\nthe human body was expressedly anti- Roman. No statue or depiction\nexists of a main-period Roman showing a body-marking. The bonding\nfeature the writer was attempting was an inappropriate borrowing from\nthe 20th century German SS.<br><br>Great entertaining movie nonetheless.\n"},
{"review": "\nThis movie is awesome! I think it's great to be in one of IMDb's top\n250 best movies, because it deserves it. Every time I watch\n'Gladiator'I stay touched by the story and I never get bored of it.<br><br>It's one of the most excellent movies already made in the movie's\nhistory! Russel Crowe is terrific in the role of Maximus and so is\nJoaquim phoenix great as commodus. For people who enjoys\nhistory,specially ancient history,is a chance to see how was Rome many\ncenturies ago, and also know better about the gladiators, the Colosseum\nand how some things worked in that time.<br><br>I will not write about the plot here, because many people already did\nthis; I will only say for people that never watched this movie, that it\ndeserves to be watched and, if you have some money, buy the DVD!\n"},
{"review": "\n\nI saw the movie on video because I was nervous of the gore others had\nmentioned, but the movie was like a poem. You could not have left out one\ndrop of blood, one terrifying character, one disturbing dream, nor could\nyou\nhave added anything at all. Deeply violent, yet not one gratuitous drop of\nblood was shed, not one encounter without reason. A classically made film,\nand a beaut. Don't miss it, whether or not you've seen something that\ndisappointed you, or had a bad day at the arena. Think \"Spartacus\" and\nyou've got it.\n"},
{"review": "\nGladiator is the best epic war film. Gladiator has the best war scenes\nI've ever scene. Better than Troy and much better than Alexander. I\nliked the digital effects in Gladiator. Troy and Alexander are pretty\nfun to watch, but in Alexander, i really want to forward it to exciting\nscenes, like war sequences. Gladiator, I can just sit there and watch\nit, because if you miss a part, you won't get it. The end was great, i\nreally liked it. It was the best fight scene at the end. Every part\nkept me interested and there wasn't one part that bored me. It had one\nof the best endings ever. So if your tired of crappy, imitating war\nmovies go to this one it's the best there is.<br><br>10/10\n"},
{"review": "\n\nFirstly, Romans never referred to the Colloseum as the \"Colloseum\".  It was\ncalled the Flavian Amphitheatre.<br><br>Commodus was an actual emperor who ruled from A.D. 180 to 192.  He did\nindeed fight in the Colloseum against gladiators, and was quite good at it\nbecause he never lost (Maybe he cheated like in the movie).<br><br>His sister, Lucilla, did conspire with his wife Crispina to have him killed.\nThey were caught and banished to an island and later killed.<br><br>His mistress Marcia tried to drug him to death but failed, so they had some\nathlete strangle him to death.  He died on New Year's Eve A.D. 192.<br><br>He was a nut case, and was quite murderous, but that's about the only things\nreal about the movie.<br><br>Other than the historical problems, the story was great.  I liked Maximus\nand really hated Commodus.  It was your basic struggle between good and\nevil.\n"},
{"review": "\nMovie is technically very fine i have watched in theater twice and i\nlike it much as lots of turks but sometime after the reason why we\nloved this movie became clear this was only a western look over an old\nTurkish movie series Tarkan... Maximus was so Turkic that he was\nwearing lamb fur(lamb was introduced by Huns to Europe) instead of\nbright armors of Romans,Like Tarkan he rides along his wolf, his family\nhas been murdered by his foes ... you can claim that these may be\ninspirations of Ridley Scott from Tarkan but there are some scenes\ntaken directly from Tarkan movies...<br><br>1- Maximus fights a big German guy - Tarkan's fight against Giant Orso\nboth are under snow.. 2- After the fight in arena, emperor orders\ndeath- neither Tarkan nor Maximus kill the victims. 3-The scene of\nbirds over Rome 4-The appear order and camera movements in the arena <br><br>at least the final is different, Maximus dies though Tarkan is immortal\n"},
{"review": "\n\nI went to the movie theater to go see a good action filled with fighting\nand\nbloodshed.  Instead, I witnessed a truly awesome story that happened to\nhave\nsome fighting and bloodshed.  From the acting to the directing, and\nespecially to the screenplay, this movie is spectacular!<br><br>Russell Crowe turns in a fine performance.  Many of his critics who feel\nthat he shouldn't have won an Oscar for his performance are taking it one\nstep further and saying that he was downright dull.  I don't know if Crowe\ndeserved the Best Actor Oscar, but I do know that dull he was anything\nbut.\nHe is the only one I know who could have played Maximus and given him any\ndepth and at the same time be convincingly intimidating.  Kudos to the\narguably best actor in showbiz!<br><br>Joaquin Phoenix's work as Commodus was severely underrated.  It didn't\ntake\nbut one minute before I hated Commodus with a deep hatred.  His scenes\nwith\nLucilla (Connie Nelson) are just plain eerie, causing me to hate him more.<br><br>This is easily Ridley Scott's best job as a director.  He gives\n\"Gladiator\"\nan elegance and a darkness that together make the movie quite\nunique.<br><br>This is my all-time favorite movie and I think anyone who doesn't go see\nit\nis losing out!  \n"},
{"review": "\nI have had a great deal of discussions with people about this film. I\nagree it is a good movie. Its entertaining, action packed, worth the\nprice of a ticket. However, I don't think I have ever seen a movie win\nso many awards without questioning the validity. Gladiator, while still\na good film, is hardly deserving of all its accolades. I mean it might\nbe worthy of winning cinematography or production awards or special\neffects but Best picture? Best Actor? I could think of a 100 other\nmovies in the year 2000 more deserving than this movie. Don't\nmisunderstand, I like this movie, but the problem is that movie awards\nlike the Oscars,presumably, are there to honor high quality and High\nachievements in each respected field. Russel Crowe does an adequate\njob, but his acting in his other Oscar nominated films like \"The\nInformant\" or \"A Beautiful Mind\" were light years ahead of his\nperformance in \"Gladiator\". Furthermore, Giving best picture to this\nfilm was mind boggling. I personally feel that the only reason this\nmovie was even in the running at all, was because of the money it made.\nIt was a good action movie and nothing more. Hey, remember that\n\"Couching Tiger, Hidden Dragon\" was also up for best picture that year.\nIn my opinion, It ran circles around \"Gladiator\". Wheras \"Gladiator'\nwas just a good action film. CTHD was a phenomenal action movie and\nlove story and should have won the top prize.\n"},
{"review": "\nGreat action, story and acting. Full marks for being one of the best\nfilms ever made.<br><br>It is not historically accurate with the plot but that's not the point\n(it seems a mash of different events and people who existed at one time\nor another in during the Roman Empire. From what I know of ancient Rome\nthe story is within the realms of possibility.) <br><br>The characters are all great. Pheonix is annoying but intentionally so\n- he acts his character perfectly. The script is kind of poetic at\ntimes - it seems it underwent at least three full scale revisions by\ndifferent masters of script writing.<br><br>There are a number of different accents in the film but then Rome was\nprobably a pretty multicultural place and we're hardly going to wish\nthey had made it in Latin.\n"},
{"review": "\nThere's all you might imagine, a real life situation for an epic.\nRemember that such battles where very common, not to mention the\nthousands of lives lost. Ridley Scott put the viewer into suspense and\ntension during the very first battle we had, not to mention the\ngrandiose strategy Maximus had.<br><br>Shot in Malta: Ricasli and other locations, the arena built had over\n5000 extras. All awaiting for the signal...<br><br>Roar did the crowd when Maximus entered. They loved him, a man of\nhonour, a normal being, a prisoner, a warrior. Their HERO!<br><br>Ridley Scott direction excelled at its best in Gladiator conveying the\nauthenticity of life, our ancestors have lived!\n"},
{"review": "\nPersonally I would say there is no greater movie than this; Gladiator\ndisplays excellence in all aspects of what makes a good movie. Russel\nCrowe (General Maximus) was so well cast for this role and he played it\nperfectly, through his journey to make Rome great again he sacrifices\nhis own life for the greatness of his country in, what I think of, as\nthe most touching and emotional scene in a movie ever. When I watched\nthis movie at age ten I cried when General Maximus died, the moment was\nso perfect I forgot I was on a couch, I was there, inside the coliseum\nwith him and it's that moment which elevates this movie above all\nothers.\n"},
{"review": "\n\nCan you still make a great period movie, which is commercially viable too\nin\nthese days? Apparently you can, as Ridley Scott and Russell Crowe prove\nwith\nthis magnum opus.<br><br>What strikes you most about \"Gladiator\" are not the dazzling sets and\ncostumes - though they contribute to the effect too. Where \"Gladiator\"\ndelivers is in the area of raw human emotions we are so familiar\nwith.<br><br>As somebody said, switching to the other mind-set is half the fun, and\nGladiator takes you right to the midst of Romans' politics, their\npassions,\ntheir dreams and their weaknesses.<br><br>After Ben-Hur, I feel this is the best period movie to have ever emerged\nfrom Hollywood.<br><br>-Murali Chari\n"},
{"review": "\nYou have to watch this movie at least 3 times in your life: <br><br>First time - in puberty for the special effects and epic battles. Like\nthe little Lucius, this movie will likely make you to dream of being a\ngladiator.<br><br>Second time - in your 30's for the love, life choices and loses. This\nis the time when you fight all your battles for yourself and your\nfamily. Like Maximus you will dream to get out of your Colosseum and\nbreak the chains.<br><br>Third time - when you feel your life is close to an end - just to\nremember what you have achieved. Like the old emperor Marcus Aurelius\nyou will have to realize if your name would be remembered or forgotten\nforever. Is your family close to you in your final hours or you are\ngoing to see them in the afterlife. Have you been a good parent?<br><br>I really enjoy this movie every time I watch it.\n"},
{"review": "\n\nThe only thing that could be said about Gladiator, the last Ridley Scott's\nmovie, is good entertainment.  But is not far from the scheme of the\nclassical American action movie: the male protagonist, his revenge to\nobtain, the final duel with the villain.  The initial scene of the night\nbattle promised other and higher emotions...<br><br>By the way I was born in Rome and I live in Rome and the ancient Rome of the\nmovie is not a good representation.\n"},
{"review": "\n\nIt's starts out like any good epic should with a masterfully filmed and\nexecuted exciting battle sequence that sets up the audience for one of\nthose\nrare Hollywoodian confections that are both entertaining and artsy.\nUnfortunately, it all goes downhill from there. It isn't the performers\nfaults since every single one of them give amazing, emotional, even, at\ntimes, riveting performances (the kinds you should find in better movies)\nand who give the whole picture more class than it deserves. It isn't Hanz\nZimmer's nor Lisa Gerrard's fault since they have composed a score that's\nalmost (and I do mean almost) as unforgettable as the Godfather's. And it\ncertainly isn't Ridely Scott's fault since he yet again succeeds in\nimmersing the audience in the world he has created.\nNo, the ones who are to blame are the people who wrote the saccharine,\nclichéd, soap-opery script and who, in the process, have wasted all of\nthis\nincredible talent. They should be fed to the lions.\nIt's an entertaining B-movie that could have been a classic. Just like\nTitanic in a way.<br><br>\n"},
{"review": "\nThis is in my top ten favourite movies of all time, If you like\nhistorical Epics then this is the film for you, The story is well\nthought out, exciting,compelling and interesting, the acting from all\nof the cast is simply fantastic, the special effects such as the\nrecreation of the Colosseum is absolutely amazing, the musical score is\nfantastic, the costumes are authentic and impressive - There is nothing\nabout this film that I can find fault with - Russell Crowe is\noutstanding in the lead role and conveys emotion with such skill, and\nJoaquin Pheonix is the perfect villain (suitably slimy) I cannot\nrecommend this movie enough so stop reading this and watch it now.\n"},
{"review": "\n\nGladiator is terrific.  It is definitely one of my top 5 films of all time.\nI'm sure everyone knows the plot by now. Russell Crowe is one bad a**  MF\nthat kicks major b*tt.  Not to mention he looks so hot as he is decapitating\nand slashing the competition.  But what makes this movie great is the story\nline is heart felt and you feel for Maximus after his family is murdered. \nIt is the ultimate tale of revenge.<br><br>Russell Crowe is a great actor. I never heard of him before Gladiator but\nsince seeing this I have watched a bunch of other films he is in. He's\npretty good in them all. He should have won the oscar for The Insider and\nfor A Beautiful Mind rather than Gladiator though, but just because those\ntwo movies were more \"oscar-like\".<br><br>FINAL VERDICT:  A definite must see. I have this one on tape to watch it\nover and over again.\n"},
{"review": "\n\nThe acting, action sequences and everything make this a great film.\nGladtior\nwas one of the best DVD's of the year 2000. The amazing transfer is one of\nthe best on the market. The sound quailty and picture make you feel as if\nyou're in the theater again. The first disc is the feature and the\ndetailed\ncommentary by Ridley Scott. While the second disc is tv spots, trailers ,\ndocumentary's and my personla favorite delted scenes. The dvd has over\nthirty mintues of delted scenes. This DVD's gives good character\ndevloepment\nand has veyr cool montage.\n"},
{"review": "\n\nWhat can I say?  Gladiator was a great film.  It cunningly blends political\nsatire, acting, action, and fun into to a film, right?\nWRONG.<br><br>Gladiator is more than just a fun-filled, oscar-winning, controversial\naction-fest.  If you look below the surface, Gladiator has many facets of\nitself that makes a step above the rest.<br><br>First, compliments to Russell Crowe and Joaquin Phoenix (who was wrongly\ndenied the Supporting Actor Oscar.)  One of the best examples of why this\nfilm is unusual is because of how varied and developed (or fleshed-out) the\ncharacters are.<br><br>Another important thing to remember is that the film is not necessarily\nmeant to be taken as a pinnacle masterpiece of the ages.  Though the film is\nportrayed quite artistically and has the ability to touch the audience on an\nemotional level, some scenes are just intended for fun (or shock value,\nwhichever suits you best.)<br><br>And so, though I haven't much to say for this one, I enjoyed, and its one\nthat will make a small impression on the American public (emotionally, not\neconomically.)\n"},
{"review": "\n\nGladiator is one of those movies where you just know what's going to happen\nnext.  After returning from war, Maximus (Russell Crowe) is to be given the\ncrown as emperor of Rome, but instead is sent to be executed once the\nEmperor's son (Joaquin Phoenix) kills the emperor and takes it for himself.\nAfter escaping execution and winding up a slave and a gladiator, you just\nknow how the movie is going to go.  While the scenery and battle sequences\nare great, the predictability and general lack of caring about most of the\ncharacters makes this a rather unspectacular movie.  Crowe does a decent,\nbut not Oscar-worthy job of portraying Maximus while Phoenix does an\nequally\ndecent job as portraying the evil, self-centered emperor Commodus.  No one\nelse in the cast is really given all that much for character depth and thus\nI never really cared about most of them. I give the movie 9/10 stars for\nthe\nspecial effects and 7/10 for everything else, averaging an 8/10 for the\nmovie.\n\n"},
{"review": "\n\nGladiator was an excellent example of what action films can be, when the\nwriter and director truly care about the total presentation.  The film is\nmostly accurate with it's portrayal of the time period, and the writing\ngives the viewer a sense of connection with these men.  The violence was\nshown in a manner that did not detract from the story.  Before I saw the\nfilm I had trepidations due to the subject matter, but all the graphic shots\nwere quick and to the point, showing the nature of the combat, but not \"gore\nfor gore's sake\".<br><br>Overall, one of the finest films I have seen.\n"},
{"review": "\n\nGladiator is well-made and sports all the frills of a big budget\nproduction\n-- big sets and lotsa extras in good costumery.  However, let's be blunt,\nit\nis a 10-minute plot stretched out to epic proportions.  And, it is not a\nnew\nplot.  It is not much more than a combination of Braveheart and Last of\nthe\nMohicans, go to Rome -- to name a couple of more recent films. In effect,\nit\nis hero gets done wrong and his loved ones are killed, so he bides his\ntime\nand gets his revenge.\nI think all of the hurrah behind this film is from Hollywood having little\nelse to offer this year at the Oscars (how else could Chocolat get\nnominated\n--$$$). Since Crouching Tiger is not part of the good ole boy Hollywood\nnetwork, Hollywood is working hard to prevent a foreign film from\nupstaging\nthem. In a different year, this film would not get half the recognition it\nis getting. \n"},
{"review": "\n\nAll I can say about this movie is that it is absolutely brilliant. The\nstory\nis strong, the acting (especially Russell Crowe and Joaquin Phoenix) is\nexceptional, the fight scenes are thrilling, and the computer generated\nRome\nis great. This is hands down my favorite movie of the year, when I first\nsaw\nthe previews I immediately was interested, there hasn't been a Roman epic\nin\nHollywood for years, my expectations were high and it delivered!\nEverything\nfrom the incredible cinematography to the powerful score fit the movie\nperfectly, this is a great movie, I give a 10 out of 10.\n"},
{"review": "\n\nWhen I first saw this movie it reminded me of Braveheart.  Then I thought\nto\nmyself that this movie posses a quality that Braveheart does not.  It\npossesses\nthe quality that you get satisfaction at the end of the movie.  In\nBraveheart you do not get satisfaction at the end and it is difficult to\nwatch many times.  I believe that that is the reason why Braveheart didn't\ndo as well as Gladiator did in the box office but did win 5 Oscars.  This\nmovie is a work of art.  The score complements the movie so well. Lisa\nGerrard and Hans Zimmer deliver the movie in music notes rather than\nwords.\nRussell Crowe is great in the movie and reminds me alot of Richard Burton.\nHe is an up and coming star who is destined 2 win an Oscar.  Joaquin\nPhoenix\nalso delivers a great performance worthy of an Oscar.  The late Oliver\nReed\nis outstanding.  Reed seems to steal the scene that he is in from all the\nother actors because of his acting power.  Ridley Scott delivers a classic\nfilm that will remain in our memory and our hearts.  If you haven't seen\nthis movie, please do, you will not regret it.\n"},
{"review": "\n\nWe thought that the star of director Ridley Scott was going to disappear\nthanks to unsuccessful movies like the good  \"Albatross\" or the really weird\n\"G. I. Jane\", but fortunately he is came back with a success like\n\"Gladiator\" and a promising title like \"Hannibal\". Even if doesn't\nabsolutely respect history, this movie is a beautiful work and a great\nwonder for our eyes. Scott directs the battle with great ability, helped by\nthe editing of the great Italian Pietro Scalia (Academy Award winner for\n\"JFK\"): the initial battle in the woods is frenetic and impressive with the\nforce of a thunder and the fights in the arenas are exceptional, a\ndemonstration of what the evolution in movies can do. And also the cast,\nwhich sometimes is sacrificed for the show, shows a very great power:\nRussell Crowe is a suffering but determined Maximus, Joaquin Phoenix an\nevil, weak and complex Commodus, Connie Nielsen is so beautiful than good\nactress and then there is a great english trio formed by Richard Harris,\nDerek Jacobi and Oliver Reed (dead during the shots). Giorgio Cantarini\n(Benigni's son in \"La Vita è Bella\") plays the brief role of Maximus' son.\nWe mustn't also forget the red photography by John Mathieson, the rich art\ndirection of Arthur Max (a name, a program) and the wonderful themes\ncomposed by Hans Zimmer, featuring the splendid vocals of Lisa Gerrard.\nWonderful! \n"},
{"review": "\n\nI think this a Great movie with a great story.  The actors did a superb\nperformance. There is rarely a movie that I can watch over and over but this\nis truly one I can because every time you watch it there is always something\nelse to see.  The scenery is great and the music is wonderful. I think this\nis a must see movie.\n"},
{"review": "\n\n This movie is so well done, that you are overwhelmed. I can frankly say\nthat there is not even a single boring moment during the whole\nlength.\n I will begin my description with the shooting. The movie has such great\nshots, that you will be truly impressed. There wasn't any saving made by the\nproducers with the staging of the scenery. It has been set to resemble\nperfectly the Roman times. The fighting scenes in the gladiator's arena are\nshocking, but tastefully done. Actually, the movie begins with a battle\nbetween a Roman legion and a German tribe's army. Great shots! It is much\nbetter than the fights in Braveheart.\n The other impressive side of the movie is the consistency of the plot. The\nmovie has a coherent plot which sends us a clear picture of the happenings,\nwithout limiting the suspension. You cannot guess the end of the movie at\nall, and neither the next step, but as it happens it is\nlogic.\n The last but not least is Crowe's acting. I have never heard about this\nactor until this movie, but he plays very well. He is manly and sensitive\naltogether. I commend its casting, when other candidates were more\nknown.\nYou just have to see this movie, and you will be convinced that the great\nepic era of the fifties was finally reproduced and surpassed.\n"},
{"review": "\n\nI saw this movie first when it came out on the big screen, but\nunfortunately\nwas not able to fully appreciate it because of the people in the movie\ntheater. Fortunately this Christmas I received the DVD as a gift and was\ndelighted when I watched it. It is just one of those movies that when it\nended I wanted to know more. I HIGHLY recommend this movie to EVERYONE! So\nif you have not seen it yet, please do!\n"},
{"review": "\n\nI was expecting a action flick and to my delight found a\nbeautifully\ncrafted historically accurate and totally engrossing masterpiece.\nWow!\nWho would have thought anything this good could come out in\nthe\nso-called \"New Millennium\"? It harkens back to the great movies\nof\nyesteryear in its honesty, its willingness to treat the viewer as\nan\nintelligent human being. Perhaps there is hope for humans after\nall.\n\n"},
{"review": "\n\nMy daughter bought me the video for Christmas, and we watched it on\nChristmas Day.<br><br>We all flinched, gasped, sighed and cried right to the very end. I fell in\nlove, and my daughter, who is nine and a half and has almost 300 videos,\nsaid it was the best film she had ever seen.<br><br>I am one of those people who watches movies to be entertained, and this\ndid\nit for me.<br><br>10/10<br><br>\n"},
{"review": "\n\nI too was very sceptical of this film. It looked like Braveheart<br><br>which I hated. A Big macho fest that pumped up the killing<br><br>aspect but I was Pleasantly surprised. An interesting \ncharacter piece and I am glad I was proven wrong. I like to<br><br>be proven wrong if it's a good film. Russel Crowe shines<br><br>and Joaquin Pheonix, well what can I say except Wow. He<br><br>is living up to his Brothers name.\nRidley Scott proves once again that he is one of the best<br><br>directors around and one of the most visual.\nSo for all you sceptics, check it out; you might  be \nsurprised.\n\n"},
{"review": "\n\n\"Gladiator\" is a truly outstanding movie.It works on so many levels.Great\ndirection by Ridley Scott,memorable characters and some of the most\nbreath-taking fight scenes ever filmed.This film is surely one of the best\nmovies of the 90's.What can I say more?Go to the nearest cinema,rent it or\nbuy it,because you should watch this modern masterpiece.This violent tale\nabout honor and strength is truly without flaws.Now I am waiting for Ridley\nScott's adaptation of the \"Hannibal\".By the way,one of the Maximus horses is\nnamed Argento.How funny?\n"},
{"review": "\nThe best movie ever made. One of the first to move me to tears at the\nend. Excellent plot, direction and acting. All else pales in\ncomparison. I dare you to watch it because it will blow your mind. And\nfor the losers that think they should nitpick about the historical\naccuracy of it, or the existence of the characters: It's fiction not a\ndocumentary of the gladiatorial lifestyles. The movie paints a\nbeautiful view of Rome, its armies, the leaders and the land. Again,\nthe acting is impeccable. In fact, the movie is so well done, there\nhave been rip offs of it made. For instance, see Troy. A mediocre film\nwith mediocre actors. As well, the direction is so much better. The\nfight scenes in Gladiator are beautiful, yet don't focus on the gore,\nas if to make some cheesy thriller. It's all about the plot, and the\nresults are delicious. The movie never gets old. It is an emotional\nroller-coaster. The beauty, the heartbreak, the fighting, is all so\namazing.\n"},
{"review": "\nEven after seeing it... god knows how many times. I still love this\nmovie. It is my favorite movie anyways, or at least one of my\nfavorites.<br><br>The movie just has a lot in it, from epic action scenes, like the\nopening battle, to really emotional scenes, this also is the only movie\never that made me cry, and i don't cry that easily. The actors in this\nmovie are really skilled anyways (especially Russel Crow, it is one of\nhis best movies in my opinion)<br><br>You also really believe you are there. They really gave it the correct\nfeeling. They even build a colosseum just for shoot this movie (well..\n60% of a colosseum that is)<br><br>If you haven't seen it already, run to the nearest DVD dealer and buy\nit now!\n"},
{"review": "\nI find this movie great from all sides i mean actors music and every\nthing. It can be the best movie talking about this certain period of\ntime. Also being able to convince people of every action the hero makes\nis great. The movie had great sound effects that added more greatness\nto the movie. The hero was general maximus acted by russell crowe who\nmade the best role in his career in this movie. The movie shows\ncorruption and hatred that is being found in human beings in all times\nand vengeance that fills the hearts. The greatest parts in the movie is\nthe parts when the gladiators fight for their live(kill or die). The\nfights where pictured perfectly . Also what made me like that movie was\nthe story as talks about a man who was a general and then became a\nslave the a gladiator and then he challenges Cesar to a fight for death\nthat is amusing and special.\n"},
{"review": "\nThis is a truly amazing story, describing a sad story about a man's\nlife. Gladiator is sad, action-packed, and some history, all in one.\nRussell Crowe does an amazing job portraying Maximus, and I can see why\nhe won a best actor award.<br><br>This next paragraph may contain a *possible* spoiler.<br><br>The story is like no other, about a man who's family was killed by a\nking, and goes to seek revenge as a gladiator. I was able to see this\non TV, after my friend told me about how good it was. I also liked it,\nfor its incredible acting, and unique story.<br><br>I love the characters in this story, especially Maximus and Commodus. I\nknew this story would be pretty good, like all Ridley Scott films. This\nis a must see.\n"},
{"review": "\nMaximus Decimus Meridius a Famed General in the Roman Army had but one\ndesire in life. To see his wife and son again. To live a simple life as\nHusband, Father, and Farmer. He had served his Country to the fullest\nand all He asked was this one request.<br><br>When Marcus Aurelius, the current Emperor asks him to serve his country\neven further, Maximus is torn between Love of Country, and Love of\nFamily.<br><br>Commodus; Marcus Aurelius' Son, assumes he would be the next Emperor.\nWhen he finds his Fathers plan would be to have Maximus Heir to Romes\nfuture, He Shows his own true allegiance is to himself. He Kills his\nown Father, then makes it known to Maximus, his intention to have The\nGenerals Family killed as well as having him executed.<br><br>As fate would have it, Maximus escapes, heads home to save his doomed\nfamily, only to find he is too late. He wishes life could be over and\nhe could then be reunited with his loved ones. His last resolve is to\nlive in this World for Vengeance. Righting the wrong that was done to\nhim. He ends up doing more then this. Righting the wrong that was done\nto all his countrymen. Giving them a chance to save their families as\nwell. <br><br>He uses his fame to Unite, conquer, and destroy a System which has\nturned self absorbed.<br><br>This is a good film for more than one reason. It shows how life wasn't\nmuch different then from now. And also how:<br><br>\"What We Do In Life Echoes In Eternity\"\n"},
{"review": "\nThere's no such thing as a perfect movie and i don't think that\nGladiator is even near that. But this movie takes a could be basic 80's\nstyle action film (like mad max or any steven segal movie)and turns it\ninto a cinematic masterpiece. Ridley Scott is known to make C class\nconcepts into A style movies (Blade Runner) and knows what he's doing\nand how. the Cinematography is perfect and this is a film for almost\neveryone to enjoy. If you like rich dialog and cinematography, then\nthis is your film. If you like action and intense war scene, then this\nis your film. Joaquin Phoenix steals ever scene he is in as he plays\nthe Empire son, who becomes Empire himself. Russell Crowe as much as\neveryone hate always gives his greatest performance ever (even though\nhe is very good in L.A. confidential). Oliver Reed (Goodfellas) also\ngives a humorous but heartfelt performance as Maximus' owner who was\nonce a Gladiator himself, this would also mark the last Oliver Reed\nfilm unfortunately as he died after filming. Dijmon Hounsou (Amastad,\nIn America) also did a good job as well, surprised me for the most as\nhe was only a model prior to this. But this movie overall isn't the\nbest i have seen, but it should be recognized as one of the best. If\nyou haven't seen this movie go and rent it, you won't be disappointed.\n8 out 10\n"},
{"review": "\n(Possible Spoilers)<br><br>Gladiator could be considered the first great movie of the new\nmillennium. It has story, it has history, it has romance, and it has\naction. But above all else, it has action. <br><br>Maximus (Russell Crowe) is the leader of Emperor Marcus Aurelius'\n(Richard Harris) legion in Germany. After a horrific battle to open the\nfilm, the Emperor is murdered by his power-hungry son, Commidus\n(Joaquin Phoenix) and Maximus is sentenced to die. After an amazing\nescape, Maximus returns home to find his family murdered and home\ndestroyed. Next thing you know he's being sold as a slave to Proximo\n(Oliver Reed) a gladiator owner. <br><br>The film is filled with amazing battle sequences held in the arena and\na story of revenge that nearly matches Ben-Hur's (1959). Russell Crowe\ndoes an excellent job as the betrayed servant of Rome and the ability\nJoaquin Phoenix shows as a truly insane emperor is amazing. This film\nhas some of the best acting I have ever seen. <br><br>The film won (If memory serves me right) numerous awards and gratitude\nfrom critique's. The Colliseum is a tad to big compared to its actual\nsize yet the director is still able to show how advance the Roman's\nwere when it came to construction, battle tactics, and government. The\nlook of Roman society is a bit off but it does not matter as that is\nnot the focus of the film.<br><br>Gladiator. Starring: Russell Crowe, Joaquin Phoenix, Connie Nielson,\nand Oliver Reed. 5 out of 5 Stars.\n"},
{"review": "\nMaximus (Russell Crowe) is the commander of Rome's armies and preferred\nchoice as the new Emperor of Rome, this is before Commodus (Joaquin\nPheonix) murders his father Marcus Aurelius (Richard Harris) steals the\nthrone for himself and has Maximus's family killed leaving him for\ndead.<br><br>Set on avenging the loss of his family and his much loved and respected\nEmporer, Maximus fights his way to the Colosseum in hope of confronting\nhis sworn enemy Commodus. An epic tale of power and corruption ensues\nand its very satisfying to witness, the fight scenes are fantastic and\ncontain enough gore to bring realism without going overboard.<br><br>Truly wonderful performances from Crowe Pheonix and Oliver Reed, bring\nthis Ridley Scott masterpiece to life.<br><br>Epic story, powerful drama, top movie 10/10\n"},
{"review": "\n\nI thought this movie a bit of a throwback to the days of the epic film. \nThis had everything movies like Spartacus and Ben Hur had, plus a bit extra\nsince special effects are so much more advanced.  The storylines which were\nwoven together I found compelling.  The sets were majestic, especially\nlooking at old Rome.  This movie obviously had a lot of careful planning and\nhard work, and it paid off beautifully.  It even does well on small screen. \nBut it is much better on the large.\n"},
{"review": "\n\nMay be a spoiler.\nGladiator was a good movie. And no one could have played Maximus' character\nbetter than Crowe. It was the fittest and finest he'd ever looked. I loved\nthe lines at the beginning of the film when he says, \"What we do here today\nechoes in eternity\" or something like that. \nWhat can I critique? Performances by everyone was great. The plot was\nadequate for the epic film and it showed a historical account of men being\nsold into slavery and turned into warriors for entertainment during the\ntimes of Roman rule. \nIt was impressive and I'm not going to pretend like I'm some kind of movie\ncritic. The movie kept me interested in its duration,and it had a moral\nmessage that I appreciate. The script was good. No stupid lines or cliched\nones. The cinematography was great. Did you see that lion scene?Get a load\nof the beginning war scene. Scene after scene got more\ninteresting.\nNow the scene stealer for the moment or the few precious moments it ran is\nDjimon Hounsou's character. Maximus' friend. All I have to say is he was a\ngorgeous sight to view especially when the slave owner slaps his ass. I wish\nI was that guy. Damn what a beautiful specimen of a man. \n\n"},
{"review": "\n\nI'm sick of ppl saying that this film isnt historically accurate!! who\ncares!!! The film makers are in the story-telling business, they're not\nhistory teachers!!! and ppl only say sparticus is better cos Kubrick is dead\nand they are too proud to admit that a new film can beat a classic!! <br><br>The story is entertaining.  The characters are believable.  The computer\ngraphics range from breath-taking to slightly out of synch.  The background\nscore is exceptional and combined with usual Ridley Scott visual style, this\nfilm is a winner!!<br><br>8/10  \n"},
{"review": "\n\nGLADIATOR is a fantastic achievement in modern filmmaking. I never expected\nto ever see another Roman epic, but Ridley Scott has proved it is possible.\nWhat's so great about this movie is that it has a really entertaining and\nenthralling storyline, not just special effects and action (although it has\na lot of that): it knows how to make us care about the people in it and how\nto develop a sense of style and elegance (thanks to director Ridley Scott).\nThe movie is fueled by a number of powerhouse performances: Russell Crowe is\nperfect as the title character, I loved Oliver Reed as Proximo, and Joaquin\nPhoenix made a perfectly hissable villain. I was amazed at how exciting this\nmovie was. Although the opening battle sequence is not very promising, with\nits confusing, chaotic editing, after that it's just uphill: the film will\nsend you on roller-coaster ride of nonstop thrills. The effects are very\nwell done: there is a scene where we see Commodus arrive at Rome as the new\nemperor that's absolutely breathtaking. I also loved the way they recreated\nthe Colosseum. Parts of this movie are truly awe-ispiring. The fights in the\narenas are spectacularly sensational. I must also mention John Mathieson's\nabsolutely beautiful cinematography and Hans Zimmer's perfect music score.\nSome scenes where Mathieson's visuals and Zimmer's music mix are\nundescribably beautiful and breathtaking. The entire film is beautiful: just\nabout any frame of it would make a really good poster to stick on the wall.\nI recommend this film to those who appreciate to finest things in\nlife.<br><br>\n"},
{"review": "\n\nThis is one of the all time great films I've ever seen.\nThe special effects are superb and the role of Maximus (russel\ncrowe)\nis perfectly played.\nThis is a film i could watch over and over again.\n"},
{"review": "\nJoaquin Phoenix is the perfect Roman Emperor for portraying any of the\nRoman Ceasars in a continuation of the mini series \"Rome\" or another\nmovie about Emperor ruled Rome. The viewers loved the series Rome and\nwould embrace seeing Joaquin Phoenix play Ceasar again. His demeanor,\nphysical features, and intensity make him the perfectly credible\nCeasar. Unforgettable, unmistakable regal presence.<br><br>His portrayal of Commodus in The Gladiator proved this. Ceasar is the\nrole that Joaquin Phoenix was born to play. Would be a serious mistake\nif a producer in Hollywood does not recognize this.<br><br>Bring back Rome...and Joaquin Phoenix as Ceasar.\n"},
{"review": "\nProbably one of the best movies I have ever seen.<br><br>Every minute brings forth more intrigue to Gladiator. Non-stop action\nkeeps the adrenaline pumping, the portrayal of the characters makes us\nsee what the director and writer wants us to see, and a story that\nkeeps us coming for more.<br><br>Russell Crowe does an excellent job in his portrayal of Maximus, a man\ncut down from a general to a slave, and then became more powerful than\nthe emperor, exactly as the tag-line says. His despair over the death\nof his family and the future he's denied, his disgust over the games,\nand his quest for vengeance when he finds the man who killed his family\nand his close friend.<br><br>Joaquin Phoenix also does a marvelous job for Commodus. Successfully\nshowing him as a spoiled rich boy lusting for more power, and viewing\nhis as someone not to be feared, but pitied.<br><br>Even though Oliver Reed died before he could shoot some very important\nscenes, they flawlessly brought him back from the dead digitally to say\nhis final words, \"Shadows and Dust,\" from a test shoot earlier making\nthe approach of the climax even more gripping.<br><br>Alien, Blade Runner, and now Gladiator. What ever Ridley Scott does for\nthese movies, he should keep it up and other directors should take\nnotes.\n"},
{"review": "\nPerfection! <br><br>Every single detail: from a perfect cast, to flawless acting, flawless\nscript, the most ascetically amazing and magnificent sets of all time,\ncostume design's are flawless, the directing and editing was absolutely\nbrilliant: you can go frame by frame line by line detail to detail and\nyou will not find any flaws. <br><br>Even the greatest movies of all time have either a minor plot flaw, or\nsomeone does a bad acting job, or their was a casting flaw (someone who\njust stuck out your head that would be better for a certain part),\ntheir is almost always flaws in a certain scene's that could be\nimproved upon or if you could go back in time and change certain things\nyou would. In this movie there is not one single thing in that could be\nimproved upon down to smallest of details. Their is are not any\nscene's, line's, setting, or expressions in the movie that could be\nimproved upon. No other film has ever been this perfect on so many\nlevels. If it was possible to go back in time and re-shoot this movie\nagain and again starting with everything the same everything, the\nchances of everything being executed this perfect again are extremely\nslim for a film of this scale. <br><br>This movie raised the bar as high as it can go and the bar cannot be\nraised any higher. Just like you cannot travel faster than speed of\nlight this movie cannot be surpassed. The best any future movie can do\nis tie and chances of a future movie being this perfect are not very\nlikely. You would have better chances of winning the LOTTO several\ntimes then to see another movie that is executed so perfectly in every\nway.<br><br>You may enjoy another movie more, because of different factors like\nyour favorite genre or you, somehow dislike some part of this movie for\nsome strange reason like you are scarred of a little blood or violence.\nBut no one could logically argue that any other movie has been\ndeveloped and executed this perfectly.\n"},
{"review": "\nTheir are no words to describe this grand historic epic. Gladiator is a\nfilm everybody would enjoy, for it has a great story, great action and\nsuperb acting (no wonder Crowe got an Oscar!) Gladiator recounts the\nstory of one of the greatest Roman generals Maximus, who was forced to\nslavery by the corrupt incestuous heir to the throne Commodus (Phoenix)\nwho killed Marcus Aurelius the emperor for he knew he offered Maximus\npower over his own son. Maximus has then become his worst enemy.\nCommodus having ordered to kill him and his family, Maximus escapes\ndeath and as becomes the general who became a slave, the slave who\nbecame gladiator, and the gladiator who defied an emperor. Gladiator\nhas some of the most beautiful scenery and CGI effects I have ever\nseen. IT really is one of the best \"recent\" films out there. The script\nis also very effective and suiting, and somehow adds a poetic feel to\nit and so does the superb music used. The actors all did very well in\ntheir roles, though Crowe dominated, it is also a memorable performance\nby Phoenix and Nielsen most memorably and also Hounsou and Harris.\nGladiator really does deserve all the awards and nominations it has\nreceived. I can assure you, that if you haven't seen this films yet, it\nshould really be the next on your list!\n"},
{"review": "\nI saw the votes for this movie and i couldn't believe there are people\nto whom it was unpleasant at least and i think they didn't know they\nwere voting against it...or they were uneducated, plain simple and dull\npeople. To be honest i think they were just stupid..there is another\npossibility. They didn't bother to see the movie before voting, they\njust saw the trailer and didn't understand it, so they voted. The\ndirector of this movie is, in my opinion, the best director of all\ntimes, after Charlie Chaplin and anyone who has seen at least 100\nmovies and understood them could easily agree. Thank you.. Anything\nelse is useless to say...\n"},
{"review": "\nThis movie is one of the great true-to-the-human-heart movie. It has a\ngood story and good ending. I enjoyed this movie so much that I\nrecommended this movie to all my friends and even my teachers.\nActually, my World Literature teacher liked it so much that she got\npermission to show it to our class. It has great actors in it as well.\nJoaquin Phoenix is hot and is perfect for the part of Commodus. He has\nthe look and the acting attitude for the evil emperor. Russel Crowe is\nan awesome actor in anything that he is in. He also has his part down\npat. I could not imagine anyone else playing the part of Maximus. I\nalso like what Hans Zimmer did to the music for this film. I love the\ninstruments and the word choices for the film. I am actually listening\nto the second soundtrack to the movie. I love the way the music reminds\nme of the different parts of the movie. I get the shivers just thinking\nabout the ending music especially.\n"},
{"review": "\n\nEven before seeing this movie in the theater I fell in love with the score.\nOnce I saw the movie I knew I had to add it to my collection. This was the\nonly movie I had to see in the theater more than once. As soon as it came\nout on DVD I bought it and watched it over and over again. The plot is\nawesome, the effects are absolutely amazing and the score pulls it all\ntogether magnificently. The added documentaries and features on the DVD set\nare well worth watching again also. I highly recommend this movie for\nanyone's collection and also recommend checking out Hans Zimmer's other\nworks. \n"},
{"review": "\nThe old Roman emperor Marcus Aurelius wanted to give the power to his\nfavorite general Maximus. Due to envy, Commodus killed his father\nMarcus and claimed him as the lawful successor. The misfortune fell on\nMaximus. After he lost his family, he did not want to live anymore.\nHowever life did not go on as he wanted. He was trained as a gladiator.\nIt mattered life and death. If you wanted to survive, you had to kill\nthe opponent.<br><br>The final duel between Maximus and Commodus was the most soul-stirring\nduel I ever watched. Although Maximus was a powerful general, he was a\nkind and generous person. It was his kindness that made him become the\nvictim of insidious Commodus. Maybe he was just fit for leading an\narmy.<br><br>Russell Crowe convincingly played the brave general Maximus. He was\ndeserved to win the best actor (the academy award). It was a pity that\nRidley Scott did not win the best director.<br><br>A movie that can push you forward. 9/10\n"},
{"review": "\nRussell Crowe, complete with designer stubble and an occasional Aussie\naccent, gladiates his way through an overrated melodrama that's so\nboring it had me climbing the walls after ten minutes. <br><br>The convincing visual effects used to bring Ancient Rome to life are\nsurrounded by a sludgily lit and droning epic-by-numbers that includes\nall the requisite battles, close-ups of tortured faces, sweeping shots\nof fields, and dead loved ones, but not a single moment of awe or\npoignancy. Despite the film's tut-tutting about the practice of making\nmen fight tigers for entertainment, the fight sequences are shot like\nthis is a Tony Scott film rather than a Ridley effort, while all the\nunderdog-makes-good plot line needs is Burgess Meredith shouting\n'You're gonna eat lightnin' and crap thunder!' <br><br>All of this has about as much impact as a smack in the face from Mr.\nBurns.\n"},
{"review": "\nI think Gladiator is really the best movie I've ever seen. Everything\nis just perfect, the image, the story and of course the music. The\nfirst time I saw the movie I was really overwhelmed by the movie. Than\nI rented it a dozen times before I could buy it. Since the time the\nmovie came out I've seen him at least 30 times. And now I'm still\noverwhelmed by the feeling the movie gives me. It just the most perfect\nmovie there is!!! <br><br>The movie starts with a great opening, the only bad thing about the\nopening and maybe the whole movie is that when the soldiers fire the\nmissiles you can see very good that this missiles are animated by a\ncomputer, they go to straight to be real. After that the movie starts\nslowly and keeps going faster till the end. Thats another reason why it\nis good. From the beginning till the end you just are watching as if\nyou were there, this is meanly done by the music which fits perfectly\nby the pictures you see. Great work from Hans Zimmer just like the\nlatest movie King Arthur.\n"},
{"review": "\n\nI am usually worried that I'm in for a big let-down when I am looking\nforward to a film as much as I was to this one.  This time however, I was\nvery pleasantly suprised, when Gladiator not only fulfilled but surpassed my\nexpectations.  It's a brilliant film, which (while containing weaknesses\nsuch as a script which wasn't quite as good as it could have been, and one\nclimactic scene which completely changes, and ruins, the ending) manages to\nengage your heart and mind.<br><br>The performances are without exception excellent (although the accents may\ndistract a bit, there is such a wide variety of them).  I must single out\nfor commendation Mr. Phoenix, who despite his youth manages to portray a\ncharacter with such conviction that you never for a moment doubt his\ninterpretation.  His physical performance is as good as his mental one.<br><br>The film rests firmly on the (extremely attractive and capable) shoulders of\none Russell Crowe.  In a tour-de-force performance, he manages to convey a\nman (not a superhuman) with frailties and doubts and fears and heart.  I\ncannot convey to you how brilliant this man's performance was.  If anyone\nelse had been this character, the film would have rated at best a five out\nof ten.<br><br>Kudos to Russell Crowe, and to Ridley Scott, for managing to keep this film\non a level with humanity, rather than one in which the characters become\nkilling machines.<br><br>A must see, five stars out of five.\n"},
{"review": "\nGladiator is one of those movies that will never be outdated. It will\nnever need to be remade or need anything else done to it. It stands on\nits own like few other movies do. Crowe's performance as Maximus (I\nthink I spelled that right) is subtle and stoic, yet perfect. He is the\nperfect hero archetype and it ends fulfilling that archetype perfectly.\nThe story, whether how accurate it is to ancient Rome or not, is\nincredible. Even if we must view it as a fantasy film, the story would\nnot become diluted in any way. If you have not seen Gladiator, you\nshould go buy it at a F.Y.E or Moviestop location (it's very cheap now)\nand if you have seen it then I'm sure you agree with me and if you have\nseen it and don't agree with me, whatever, but you're absolutely wrong.\n"},
{"review": "\nThis is one of the few movies that I watched more than once. The plot,\nthe acting and the direction was just epic. The conspiracy, politics\nand realistic fight scenes add to the quality of viewing. Especially\nhats off to Joaquin, who played Commodus. I personally felt that it was\nunfair that Joaquin didn't get an Oscar for this performance while\nCrowe got it. I felt that Joaquin performed as good if not better than\nCrowe and it was his character that made the movie more interesting. <br><br>The only problem I saw with this movie was that the plot has been\nstretched to 150 minutes while it could have been fitted into 125-130\nminutes. But this is too minor a flaw to reduce my rating.<br><br>I would highly recommend this movie. If you have not watched it before,\nwatch it now. It will blow your mind\n"},
{"review": "\nWARNING: This review may contain spoilers<br><br>Ridley Scott shapes the decade with this masterpiece.It is very rare to\nfind a movie, which is this complete like Gladiator. Russell Crowe is\nembodying the Roman general Maximus Decimus Meridius like he was born\nfor this role. While watching the movie, you can feel the striking and\ncourageous personality of the Spaniard, like they call him in the\nmovie. Joaquin Phoenix was the most perfect antagonist they could've\ntaken for. His underhand and egoistic character made the spectator\nhating him as the role of Commodus - thats why he was nominated as best\nactor in a supporting role at 2001 Oscars. When a Roman general is\nbetrayed and his family murdered by an emperor's corrupt son, he comes\nto Rome as a gladiator to seek revenge. This sentence was written by\nIMDb and in my opinion I can approve this! If you want to watch a\ncomplete movie, where music, scene play, script and pretty everything\nis important - then watch Gladiator that has been distinguished with 5\nOscars.\n"},
{"review": "\nBeing somewhat of a history buff, I've always loved historical movies.\nMy only gripe was that up to the 1990s none of those movies really\nmanaged to convey a sense of authenticity. The sets, the costumes, the\nhairstyles, the battles \u0096 everything was too polished, too artificial.\nI think it was with movies like Dances with Wolves (Kevin Costner,\n1990), Braveheart (Mel Gibson, 1995), Saving Private Ryan (Steven\nSpielberg, 1998) and The Messenger: The Story of Joan of Arc (Luc\nBesson, 1999) that things finally started to change, and historical\nfilms moved towards a more realistic depiction of the various eras \u0096\nnot necessarily in terms of historical facts but the feel. But one\nthing was still missing: a similar movie set in ancient times, that\nwould reinvigorate the sword-and-sandal genre by matching the epic\nvisuals of Ben-Hur with the new, grittier and more believable look and\nfeel.<br><br>Ridley Scott's Gladiator, a wonderfully written, timeless revenge story\nwith gripping performances from Russell Crowe, Richard Harris, and\nOliver Reed (plus Joaquin Phoenix, Djimon Hounsou &amp; Connie Nielsen),\nand accompanied by Hans Zimmer's and Lisa Gerrard's trend-setting,\nhaunting score, was that movie. It truly revived the genre and was\nquickly followed by a string of similar movies (out of which,\nunfortunately, only one - Wolfgang Petersen's Troy \u0096 measured up to the\nhigh standard set by Gladiator). It doesn't really matter that Ridley\nScott's movie is full of inaccuracies. It's thrilling, it's\nheartbreaking, it feels real. I have seen it countless times and it\nnever gets boring.<br><br>Note: The extended cut is even better than the theatrical version.\n"},
{"review": "\nThis has to be my favourite movie of all time. It's a classic. Russell\nCrowe's performance is out of this world and the award for best actor\nin that years Oscar was well deserved. He played the roll of a\nlifetime. What always fascinated me about going to watch this movie was\nI never watched one single trailer prior to going but was gripped from\nthe beginning The other character's are also extremely strong and the\nstoryline and pathway the film takes isn't something that hasn't seen\nbefore but certainly is moving and believable There isn't a great film\nwithout great music and Han Zimmer's score in this is arguably his\ngreatest work. The theme and variations are so strong and the attention\nto detail of the style that was necessary for that period is fantastic.\nIt's been 16 years since it came out and still has the same edge about\nit and that is the mark of a great film. You would happily watch it\nover and over.\n"},
{"review": "\nSo i watched this movie because it was suggested after watching 300\n(which i liked better to be honest) and at the beginning i liked it\nvery much, but the end was very predictable. One big disappointment was\nthe language. Before i watched this movie, i watched Narcos with its\nauthentic Spanish, Braveheart with this awesome Scottish Accent and\nInglourious Basterds with Brad Pitt and his cool Tennessee Accent. I\ndon't want to say that the whole movie should have been in Latin, but\nthis American English destroyed the whole atmosphere. I would not say\nit's a shitty movie, but in my opinion it doesn't deserve an\neight-point-five score.\n"},
{"review": "\nThe plot is a rich one, that is as dynamic as it is present. He once\nagain, after Blade Runner, 1492, and others helps us visit the depths\nof the human soul, which remains the same over all our historical and\nsocial experience. Even the fights, are displayed in such a way that\nall the blood is quite discrete, but still, making us feel like\nscreaming and jumping out of our seats. I would also like to point out\nthe performances of the cast, that is surprisingly good. We have some\nactors and actresses, who are not Hollywood icons, but are are greatly\nable to move the audience among screams and tears. All in all, we have\nguys like Russel Crowe, who are coming out to be part of a new and\nextremely promising harvest of people who are making each time more\nfans around the world.\n"},
{"review": "\nI will start off by declaring that, IMO, this is the best film I've\never seen. <br><br>Why? Well, the reasons are many. First up, the acting is superb. All\nthe major players put in excellent turns, as do the bit-part actors.\nRussell Crowe will never inhabit another character the way he does\nMaximus. He looks like he was born to play this part. He presents us a\nman with immense charisma, authority, bravery, honour and dignity. A\nman prepared to die for what is right. Joaquin Phoenix gives us an\nemperor, Commodus, that is entirely credible: one minute, he's\nreasonable and lucid, the next, he is psychotic. Oliver Reed, in his\nfinal role, is an excellent lanista (director of a gladiator school).\nConnie Nielsen, as Commodus' sister and would-be lover of Maximus, has\nto run the gauntlet of Commodus' psychotic behaviour to preserve her's\nand her son's lives. All in all, top notch acting all-round. They're\ngiven a great story and script to work with, too.<br><br>The cinematography is magnificent. The colours the dust, great camera\nangles, judicious cutting around scenes. It works to create intense\nimages that place the actors firmly in the forefront. The digital\nrecreation of roses is amazing and you have to look very hard to detect\nthe digital effects. Ridley Scott has produced one of his greatest\ndirecting achievements.<br><br>Finally, the music, from Hans Zimmer, is magnificent. It supports the\naction and moods of the scenes expertly, without ever intruding too\nmuch, which is the mark, IMO, of a great score and soundtrack.<br><br>If you have not seen this movie, or bought the Blu-Ray, I have only one\nquestion: why not? This is a MUST WATCH movie. Simple as that.\n"},
{"review": "\nLoved this movie but the best sequence was at the beginning when the\ndisciplined, methodical, Roman Army slaughtered a disorganized German\nhorde in a filmed battle sequence with no equal other than perhaps the\nstorming of Normandy beach from Spielberg's movie Saving Private Ryan!\nTactics will beat brute force every time! The emperor overseeing this\nslaughter was Marcus Aurelius who was the last of the adoptive\nemperors, also referred to as the 'Good Emperors'. It started with\nNerva, who adopted Trajan, who in turn adopted Hadrian, who was\nfollowed by Antoninus Pius who in turn was succeeded by Marcus\nAurelius. During their rule there was a considerable expansion of the\nRoman empire, from northern Britain to Dacia and to Arabia and\nMesopotamia, followed by a consolidation and an attempt to perfect the\nempire's defenses (e.g. Hadrian's Wall in Britain). This all started to\nunravel under Commodus (son of Marcus Aurelius). The period of the\nadoptive emperors started with the assassination of a horrible emperor\n(Domitian) and ended with another horrible emperor (Commodus who also\nwas assassinated). This is all historical fact and that's the end of\nthe movie's factual content everything else is just fiction! But\nenjoyable fiction with the formulaic mistake of turning the main\nprotagonist into something of a superhero and that's why it isn't\ngetting a 10!\n"},
{"review": "\nThis movie is one of my absolute favorites. I loved Maximus, Commodus,\nand Lucilla. The plot was perfect, the violence appropriate for those\ntimes. I think that the character, \"Commodus\" was one we absolutely\nloved to hate. But, he was weak, and really only wanted to love, and be\nloved. I loved the fighting scenes, so realistic. Cicero was another\none of my favorite characters. Always faithful to Maximus to the very\nend. He set things in motion for Maximus, when he contacted Lucilla.\nShe paid him and thanked him. I think she loved Maximus, but it was not\nclear that they could actually be together, if he lived. Which brings\nme to the only part of the movie i would've changed. Maximus, father to\na murdered son, husband to a murdered wife;who will have his vengeance\nin this world or the next, should have lived.<br><br>I rated it 8 out of 10.\n"},
{"review": "\nHard to believe Gladiator is 15 years old now, such a fantastic movie\nthat will never go out of style. Super fun watching this again, it's\njust the classic sword &amp; sandal flick, epic on all counts and the type\nof movie that stays with you for days afterwards. Admittedly the story\nwas also a bit draggy in parts, its almost 3 hours long and at times I\nwas confused as to where it was taking place Morocco? but the location\nissue is just me.<br><br>Russell Crowe is Oscar worthy as he embodies Maximus. Perfect as the\nstrong and silent leader, the type of character you feel for and can't\nhelp but cheer along especially as he's squaring off against the\nawesomely crazy &amp; creepy Joaquin Phoenix \"You will love me and bear me\na pure heir\" -spoken to his sister. Phoenix was just amazing.<br><br>Of course the battle scenes are awesome; exciting, bloody and epic,\nstarting in Germany with Russell as a Roman general leading his men\ninto battle. He soon arouses the rage of the emperors jealous and\nbloodthirsty son when it becomes known that Maximus is to be the\nsuccessor. A bit of murder happens then with Maximus finding himself a\nwidower, beaten, enslaved and forced to become a gladiator. The final\nbattle goes down at the Coliseum in Rome with an ending that I thought\nwas perfect \"Am I not merciful?\" <br><br>Really beautiful music here too, and a top notch extended cast\nincluding a SOA sighting from one Tommy Flanagan. Yes Maximus, I was\nentertained. 4/14/15\n"},
{"review": "\nGladiator is until today one of the best movies i've ever seen.<br><br>The movie has a big impact on the feeling of each viewer. <br><br>I think that they chose the perfect music to underline the drama in the\nmusic.<br><br>I've first watched the movie with 12 years.<br><br>And now ten years later its still one of the best movies, i have in my\ncollection.<br><br>For people who haven't seen this movie I just can say that its a must.<br><br>The rating is in my opinion not good enough.<br><br>The actor did a great job and more the director.<br><br>I have to thank Hollywood for this movie.\n"},
{"review": "\nSummer blockbusters are creatures of their own, aiming to cater to and\nexploit our lowest desires. Ridley perfectly understands this and\nconsciously tries to redefine them when he gets a chance. Unlike many\nothers, he knows what he is doing and approaches the matter with care\ninstead of force. This works only because of him.<br><br>We have a movie about a spectacle, in which we and the mob are one and\nthe same. It's cynical as it bashes the industry and us, yet hopeful\nwith its vision for the future. The visual style is novel and somewhat\ncounterintuitive. Typically, one would expect huge cinematic battles,\nfilled with bloodshed, as well as a very architecturally dimensional\nRome, filled with pride of its history. Here, these are handed very\ndifferently, casually placed in the background. We imagine and deduce\nthem from the eyes of the characters - very subtle, especially for a\nsummer blockbuster. Instead, the focus here is on emotion and tension.\nTension between a \"cheap entertainment thrill\" and \"strength and\nhonor\". Judging by how successful this was, new endeavors should learn\nfrom it, as it shows that the audience expects something more. <br><br>Crowe is utilized well here. Some of his scenes with Joaquin carry and\nproject that tension for us to feed on.<br><br>4/5 - Worth a watch. We've started to demand much more after this.\n"},
{"review": "\none of the best movie i have ever seen. The performance of Russell is\nsplendid. The best part is the background music which gives me goose\nbumps whenever i come to hear it. The story is so well crafted that\nthere is no time of the movie without thrill.The fight sequences are\nalso damn good. The picturisation is great and the camera work\nsplendid. I think the movie is also recommended for family viewing too.\nMy vote for the best scene in the movie is when maximus gives his\nintroduction to the king. Believe me i have seen this movie more than\n25times and yet i never felt any seen as boring. For the people those\nwho havin't watched this movie i have to say u have missed a\nmasterpiece.\n"},
{"review": "\nafter a row of forgettable films Ridley Scott returned to former glory\nwith this glorious adventure straight out of the realms of the 60's\npeplums(which can still be seen every easter and Xmas,full of\nadverts,on TV.it was surely a risk,however, ticket sales,DVD\nsales,critical reviews and a handful of Oscars,showed the production\nteam had got it right.<br><br>what they hadn't got right was historical correctness,the list of\nerrors is longer than the final credits,but who cares,this is a film to\nsit back and enjoy,not improve your knowledge of roman history.<br><br>a visually beautiful movie,with wonderful performances by all\ninvolved,gladiator has something unusual in todays cinema for the\nmasses,Maximo.<br><br>Crowe's interpretation of the general as a family man,loyal comrade is\nfull of fateful exoticism perfect for the times he lived in,and worthy\nof Crowe's place as a great actor'.\n"},
{"review": "\nBeing honest, I was never intended to see Gladiator, thinking it just\nwasn't my type of film, more of a 'boys action movie'. How wrong was I!\nBeing bored last night, it was on TV so I thought I might as well see\nwhat everyone was raving about. As with other epics like it\n(Braveheart, The Last Samurai), I was on the edge of my seat, eyes\nglued to the screen.<br><br>I thought the characters were well written - the complete opposites of\nthe strength and courage of Maximus against Commodus's pathetic coward\nof an emporer. Some of the lines between them have to be amongst the\nbest ever - the 'father to a murdered son...' and 'smile for me now\nbrother' They bring a tear to my eye (and only braveheart and titanic\nhave also done)<br><br>Commodus is such a self-indulgent coward, you just have to hate him,\nand Maximus is a real hero. Their climatic fight is brilliant, I didn't\nknow which way it would go, considering commodus has just stabbed his\nopponent. The ending was sad, but I felt it was fitting with the film,\nand I was glad when I seen Commodus about to die, realising he never\nwould win over the crowd.<br><br>I would recommend this film to everyone, its constantly interesting,\nhas some amazing scenes and dialogue. And most of all, I think I will\nenjoy it even more on my second viewing. I'm going to buy the DVD very\nsoon!\n"},
{"review": "\nGladiator is really an excellent film. In every aspect this film is\nvery good! This film is visually stunning, but also the story and the\ndialogs are good and interesting. Russell Crowe, Joaquin Phoenix and\nthe rest of the cast do a very good job! Director Ridley Scott made an\nexcellent film! Also the music is beautiful, the soundtrack by Hans\nZimmer and Lisa Gerrard is amazing. Also the cinematography is\nexcellent. This is an epic film that is excellent from beginning to\nend! Everyone must see this masterpiece! I've heard there are some\nhistorical mistakes in it, but I certainly didn't notice them, and even\nif there would be inaccuracies, they don't harm the film! A beautiful\nfilm!\n"},
{"review": "\nI remember going to the theater the first time with tempered hopes. I\nended up seeing it fives times in the theater alone. Then I burned a\nhole in my DVD afterward. Ridley Scott proved himself once again to be\none of the greatest directors of all time, and this movie helped me to\ndiscover Hans Zimmer as well. I also think this is Russel Crowe's\ndefinitive role, and Joaquin Phoenix's performance absolutely floored\nme and turned me into a huge fan of his. Just a fantastic movie, with\nan absolute heart break ending. The recreation of Rome gives you the\nfeeling that you are really there. Some of the cinematography, such as\nthe scene where Commodus is looking out over Rome, just before\nscreaming to his sister \"Am I not merciful?!\" is just unforgettable.\nHans Zimmer's score is absolutely unbelievable and I've basically\nburned a hole in the soundtrack CD as well.\n"},
{"review": "\nGladiator is Russell Crowe's best performance ever. This movie was well\ndirected by Ridley Scott. This is one of Ridley Scott's best films. I\nthink Russell Crowe did a good job and Joaquin Phonix did a good job.\nThis movie great acting, great writing, great cinematography, great\nsets and great costumes. This movie had great battle sequences. This\nfilm won an Oscar for Best Picture, Best Actor, Best Sound, Best\nCostume Design, and Best Visual Effects. It got nominated for Best\nSupporting Actor - Joaquin Phonix, Best Art Direction - Arthur Max,\nBest Original Score - Hans Zimmer and Best Cinematography - John\nMathison. I like other Ridley Scott films including Alien, Blade\nRunner, Thelma &amp; Louise and Black Hawk Down.\n"},
{"review": "\nthis is by far the best movie i have ever seen. i love every min of the\nmovie. it was sad entertaining made me jump from my chair and also\nlaugh at times i like the mix of people they had. the crazy weird\nbrother ruler, the lovable sister who was strong. the hero and his gang\nof brothers. on the Lil boy who love excitement and of course the crowd\nof people who cheer for blood death and more blood-Crow does a great\njob in acting in this movie he really made his character come alive. i\nhave watch this movie many times and i still can not get enough of it.\ni try to watch it on TNT when it comes on by i find myself go to get my\nDVD and watch it uncut because there is no other way to watch this\nmovie.10 of 1o!!! excellent\n"},
{"review": "\nI think this movie was really great because the story line was really\nemotional and believable. The locations for the filming were\nimpeccable. The acting and actors were astounding. This movie had it\nall drama, action, romance, comedy. A must see movie. This is the kind\nof movie that anyone (except young children) could enjoy. With all the\nfighting and gore, it would attract the males. With the love and\nromance and all the things Maximus does for love and family it would\nattract the females. I give this movie a 10 out of 10 because it is\njust so awesome. I highly recommend anyone go see this one of a kind\nmovie.\n"},
{"review": "\nWhen I checked out the latest Top 250,I couldn't quite believe that\n'Gladiator' was only ranked at No.138.It just had to be\nhigher,especially when you consider some of the movies that are above\nit.I thought it would be top 20 at the very least.Why is it so\nlow?Beats me,it truly does.<br><br>This is a film that scores in every department.Great\ncinematography,fine acting,excellent story and genuine emotion.It is a\nfilm that has gone on to influence several films since and I dare say\nthat a few movies wouldn't have even got made if it hadn't been for the\nsuccess of this stirring adventure movie.As stated,the acting is fine\nthroughout with Joaquin Phoenix,Connie Nielsen,Oliver Reed and Richard\nHarris all impressive.But this film belongs to Russell Crowe who gives\na powerful performance full of compassion and turmoil.I saw a recent\npoll that listed the most undeserved Oscar winners and Russell Crowe\ncame top for this performance.Now that is totally pathetic and people\nobviously voted for the personality and not the actor.You know and I\nknow that there have been many other performances in recent years that\nhave won the coveted Oscar and shouldn't have.Crowe deserved his award\nwithout any shadow of a doubt and it his role of Maximus for which he\nwill be remembered,a fact that would probably bug the hell out of him.<br><br>This film is gripping from start to finish and is one of the finest\nreleases of recent years.No,it isn't perfect.There are too many gaffes\nfor that.The guy wearing jeans,the gas cylinders on the chariots and\nthe headrest for Maximus' death scene(just look at the long shot!!).But\nit is a cracking movie of a type so rarely seen recently.I know that it\nis in my top 10 movies of all time.\n"},
{"review": "\nIt's a shame Cecil B. DeMille is no longer with us. If he were alive\ntoday he would be gratified to see that the type of movies he loved to\nmake are popular again: \"Gladiator,\" \"Pirates of the Caribbean: Curse\nof the Black Pearl\" and \"The Passion of the Christ\" are all the kinds\nof movies DeMille made; all of them are movies he would have made if\nthe screenplays had been around in his day. \"Gladiator\" is a gloriously\nretro sword-and-sandal epic, a cross-pollination of \"Spartacus,\" \"Ben\nHur,\" and \"The Fall of the Roman Empire\"; director Ridley Scott uses\nmodern CGI technology to make the kind of movie they don't make any\nmore. Although not 100% historically accurate, it's irresistible drama.\nRussell Crowe is one of the few actors today who can pull off this kind\nof heroic role; he has the gravitas despite his bad-boy reputation in\nreal life that blond pretty boys like Brad Pitt and Colin Farrell can\nnever hope to approach. Connie Nielsen is a sensuous presence as\nLucilla; River Phoenix as Commodus is the creepiest villain since Ralph\nFiennes' Amos Goetz in \"Schindler's List\"; and the supporting cast is\nfull of stand out performances. It's good to see \"I Claudius\"'s Derek\nJacobi back in toga; what's an epic without Richard Harris? and of\ncourse Oliver Reed as the lovably irascible slave-trader Proximo, who\nproves not to be such a bad guy after all. The film completely ignores\nthe persecution of Christians under the otherwise humane Marcus\nAurelius; but then, \"Pirates of the Caribbean\" ignores the presence of\nslavery in the eighteenth-century West Indies.\n"},
{"review": "\nyo if you wanna see some BSDs get right punt then this is your movie 10\nstars for pawning, 10 stars for owning, 10 stars for OWNT, 10 stars for\nPWNT and lastly 10 stars for MAXIMUSSSS!<br><br>F***king right this is the movie of our liftime and generation. a\ndefining moment in cinema. a single star in sea of Hollywood black d!ck\nbull Sh!t.<br><br>THIS IS OUR COMMUNITY, GO AHEAD ASK ME IF I CARE! to the max to the max\nto the max to the max.<br><br>when i feel sad, mad or even brisk i watch this movie. It just makes me\nfeel ultimate inside. its like taking a watermelon and smashing it into\nyour face, nothings better then gladiator. Accept no imitations, Russel\nCrowe is the real deal and he owns your mom.<br><br>L8.\n"},
{"review": "\nI absolutely agree with every favorable comment written here. I can\nfind no fault with David Frazoni's story nor Ridley Scott's direction.\nThe cinematography was amazing and colorful; I did not find the CGIs to\nbe intrusive. That the entire production involved so many thousands of\npeople is a testament to filmmakers' ability to produce beautiful,\nthoroughly enjoyable movies, eve today. \"The Gladiator\" serves them all\nup in a gorgeous heap.<br><br>Mention \"gladiator\" and \"Rome\" and a whole plot comes to mind, but this\none certainly combines the necessity of bloodshed, gentility and\nnobility with action in one grand epic. It is sufficiently historically\naccurate, but it really IS the story which is the \"star\" in this film.\nAlthough all of them gave magnificent performances, it isn't necessary\nto list all of the cast here. I've read eleven pages of the huge total;\nI'm sure other readers will read some of them, too. It is, however,\nirreverent not to praise \"bad-boy\" Russell Crowe doing his act here so\neloquently, with principled reverence. Truly, Bravo! Mr. Crowe. AND -\nan early exposure to Djimon Hounsu in a good role.<br><br>With the polyglot that Rome was, one should not be surprised to find a\ncontradiction to \"chris_j_albanese\", who says (I think) there was no\nhomosexuality in \"The Gladiator\". \"Chris\" must have missed the scene\nwhen Roman guards come to the senator's home to drag him off to jail,\nwith the senator shoo-ing his \"painted\" companion away.....<br><br>When I tried to re-wind my VHS-cassette - a home-made gift from a\nfriend - it wouldn't. Therefore, I'll be buying the wonderful DVD in\nthe near future, so that I can continue to put-in a lot of time\nwatching this movie, just as I've been doing for about four years. I\nconsider it to be the best of this genre. It must sound rather like a\nbroken record, but I thank every technician who did anything to bring\nthis gem to the screen. It's good for every emotion - an easy 30....\n"},
{"review": "\nGladiator is an extraordinary film because it is very spectacular and,\nat the same time, powerful, intense, vibrant, with a remarkable\nintrospective analysis and representation.It also gives people a\npositive and edifying message. This film is accompanied by a splendid\nsound track, sometimes strong and intense, sometimes passionate and\ntouching, that increase its value. Some passages of this sound track\nremind the music of Beethoven. In my opinion the film deserved more\nthan five Oscars. In fact given that Gladiator in a very painstaking\njob, it should have deserved many more Oscars. For example I think that\nGladiator is more exciting than Ben Hur which got eleven Oscars. Then I\nwas very much disappointed that a a master as Ridley Scott, one of the\nbest directors of the world, didn't win the Oscar. It's unfair that\nmasters as Alfred Hitchcock or Stanley Kubrik have never won an Oscar.\nEvery time I watch again the film I always think that it should have\nbeen still more memorable with the participation of Marlon Brando, who\nshould have been perfect for the spirit and the style of the film. He\nshould have been an unforgettable old roman senator. As a matter of\nfact in my life I have never seen an actor so able to express power,\nintensity, passion, magnetism, charisma. Just the characteristics of an\nimportant ancient roman personality.\n"},
{"review": "\nI think Gladiator 2000 was one the finest movies of it's kind. Russell\nCrowe deserved the Oscar and I think that Phoenix should have received\nthe best supporting actor Oscar. The battles, the intensity, the\noverall rawness of this movie is right up there with Ben Hur, Sparticus\nor any other movie of it's kind. When ever I want to sit down and watch\na great movie I'll watch Gladiator. Cinematography is excellent. I\ncan't actually find any fault with this movie. Phoenix was so great and\nso genuine as an evil ruler you want to go through the screen and choke\nhim to death. All the fight scenes with gladiators against gladiators,\nand gladiators against with the tiger was outstanding. The friendship\nof the gladiators waiting for there turn to live or die in the arena's\nwas also a big part of this movie.\n"},
{"review": "\nThis movie is one of my absolute favorites. I loved Maximus, Commodus,\nand Lucilla. The plot was perfect, the violence appropriate for those\ntimes. I think that the character, \"Commodus\" was one we absolutely\nloved to hate. But, he was weak, and really only wanted to love, and be\nloved. I loved the fighting scenes, so realistic. Cicero was another\none of my favorite characters. Always faithful to Maximus to the very\nend. He set things in motion for Maximus, when he contacted Lucilla.\nShe paid him and thanked him. I think she loved Maximus, but it was not\nclear that they could actually be together, if he lived. Which brings\nme to the only part of the movie i would've changed. Maximus, father to\na murdered son, husband to a murdered wife;who will have his vengeance\nin this world or the next, should have lived.\n"},
{"review": "\nThis is one of my best movies ever. I've read a lot of great reviews\nand a few bad eggs. Surprisingly to me the good eggs outweight the bad.\nThe movie has an 80%+ acceptance and 20% not. From the 20% who said\nthey didn't like the movie, well their description of the movie was\nquite dry. Pure context without content. They sound like they like blow\nup sheeps. Movies don't have to be real, or actual. Some have high\nexpectations of the movie- boy should they have been directing the\nmovie- we might get a piece of their mind.<br><br>This movie along with, Saving private ryan, top gun, braveheart, etc\nare my favorites.\n"},
{"review": "\nTake one part awesome, one part incredible, and one part inspiring and\nyou have one of the greatest movies of all time. Easily on my top ten\nlist this movie \"defines\" good movie making. With incredible cinematic\ndeftness Mr. Scott has outdone himself, I doubt he will ever be able to\ntop this masterpiece he has created with no little help from incredible\nactors, Crowe, Phoenix, and the rest of the spectacular cast helped to\nbring life to this film in ways I have never seen before. The talent\nbrought on by all creative teams involved is amazing and I can only\nhope that more films will follow in the footsteps of excellence that\nthis fine production has laid out. A true 10 without question.\n"},
{"review": "\nGladiator is an extraordinary classic film. Its one of those that will\nbe watched and talked about 50 years from now. Maximus is a Roman\ngeneral who is framed and betrayed. He ends up as a gladiator fighting\nin the great Colosseum. The whole story is about the fall and rise of\nthe hero, an honourable man who is motivated by a thirst for revenge\nand a promise he once gave to the emperor. I remember when I was in\nschool reading about the element of adventure in Greek plays. Adventure\nis : \"the change from happiness to misery or the opposite\". If this is\nright then this movie is one of the most adventurous movies ever made\nbecause it is based on this description. About the movie now, the\nacting was breathtaking by everyone, the directing was amazing giving\nthe film a live, fast action character. The battle at the start of the\nfilm was exceptionally good in therms of realistic features, sound\neffects and especially music. Later on the graphics used to recreate\nthe Colosseum were the greatest I had seen until that time.<br><br>Cannot be missed\n"},
{"review": "\n\nThis is an exceptional film, and one that I do not tire of viewing. I\nown the DVD and watch it often. The music is amazing and haunting. (In\nfact, Alexsi Yagudin skated to a world title the following year using\nthe Gladiator music for his long program. It was one of the most\ndramatic men's programs I have ever seen.) Gladiator's writing,\ndirection, and cinematography are all fabulous. The film contains\nwonderful and subtle political and social commentary. All actors\ndelivered amazing peformances, and I cannot praise it enough. Russell\nCrowe won the best actor award that year, but Joaquin Phoenix and\nConnie Nielson also deserved supporting awards. Additionally, Oliver\nReed, Richard Harrison, and Derek Jacobi also delivered amazing\nsupporting characters.\n\n"},
{"review": "\n\n\"Gladiator\" is one of the best films of the year. I hesitated to see\nthis film for a long time for many reasons; however, when I saw it the\nother night I was thrilled. <br><br>Also, \"Gladiator\" is laced with great scenery including the Roman\ncoliseum and enriched with the history of Roman culture. Watching this\nmovie was an experience I will never forget because it is like watching\nhistory come alive. The film is rich in history, the writers made it\nfun to watch because we learned about the Roman coliseum, gladiators\nand life in Rome.<br><br>\"Gladiator\" is an energetic, action packed, drama filled thrill ride\nwhich will excite everyone. Two other movies came to mind when I was\nwatching this film; \"The Patriot\" and \"Braveheart\" were very similar to\n\"Gladiator\" because they all contain unique action sequences, will\nbecome classics and all star actors in Mel Gibson and Russell Crowe,\nwho have become major players in Hollywood. <br><br>\"Gladiator\" may not be the best movie, but it will win over the hearts\nof viewers when they rent it at their local video stores. I can't wait\nto let everyone know \"Gladiator\" has become one of my favorite films. I\nhope everyone will enjoy it as I did. \"Gladiator\" is rich in history\nand is a masterpiece with all the trimmings.\n\n"},
{"review": "\n\nGladiator is an underrated movie to say the least. It should be on the\ntop 10, and in my book it's at position 1. <br><br>People tend to think it's bad because it's not 100% historically\naccurate. Guess what, it's not a documentary, it shouldn't be judged as\none.<br><br>The dialogue is strong and the story is the one we all love, and it\nplays out without flaw in Gladiator. The movie sets a new standard for\nthe definition of epic. If you watch Spartacus or Ben-Hur after\nGladiator, you notice how plain and un-epic those movies are in\ncomparison. <br><br>All the actors performed flawlessly, especially Joaquin Phoenix (should\nhave won an Oscar) and Connie Nielsen, I love the \"Am I not merciful\"\nscene, so much emotion with so few words. No single actor could be\nreplaced to make this a better movie, it was a perfect cast.<br><br>The musical score is magnificent, it's so in sync with the action and\nthe emotions on the screen, and so majestically epic, it's in itself\ndestined to become a classic. Too bad Hans Zimmer was robbed of the\nOscar.<br><br>The scenery is phenomenal, the landscapes are perfect, the CGI is top\nnotch. You can FEEL the grandness of Rome. Splendid use of light and\ncolor in every single scene. I especially like the scene where Commodus\nand Maximus are elevated on to the arena, protected by a tortus\nformation of praetorian guards.<br><br>Are you not entertained? ARE you not entertained? YES, yes we ARE.\nMaximus, Maximus, Maximus, Maximus...<br><br>10/10 - A classic.\n\n"},
{"review": "\n\nEven though Russell Crow has gained an awful reputation as a spoiled actor,\nhis delivery in Gladiator erases it all in my mind.  His consistent and\nadmirable work pull you completely into the screen and take you on a really\nfun, sad, and rewarding adventure.<br><br>The art direction in this film is superior. The camera, the script, and the\ndirection are all examples of first class work.  Yet, sadly I see that some\npeople chose to rate it as an awful film...why? Nothing about this film is\ndone badly.  Could it be jealousy? Hatred?  Why can't we just be happy about\ngreat work and celebrate with those who were responsible for making it? \nRussell, keep up the great work.\n"},
{"review": "\n\nRidley Scott is a total legend in film making because of 3 major films\nwhich all started a revolution ALIEN, BLADE RUNNER, GLADIATOR all of\nwhich are brilliant. Gladiator is a superbly directed movie with\nstunning photography and 'OFF THE PLANET ACTING' from RUSSELL CROWE and\nan equally as good JOAQUIN PHOENIX. Both actors worked so hard to make\nthis film happen. This film should have taken best DIRECTOR and BEST\nSUPPORTING ACTOR but of course those Academy Awards ar'nt always right.\nAt least RUSSELL got the Oscar (A WELL DESERVED ONE). The score\ncomposed by HANS ZIMMER is BRILLIANT and massively powerful. Thats\nanother one that 'well' deserved the Oscar........ Gladiator depicts\nthe roman empire as it were all those years ago, 'spot on', no other\nmovie has ever displayed such power before.. HIRE this movie its worth\nIT!!!!!!<br><br>Paul .................\n\n"},
{"review": "\n\nI believe Gladiator to be Ridley Scott's best movie. It is filled with\nExcellent Sets, Beautiful Costumes and good Cinematography. The movie also\nhas a Great Original Score (which should have won) and fantastic Visual\nEffects. Visually, this movie is beautiful.<br><br>Ridley Scott's direction is excellent too. Russell Crowe gives a really good\nperformance, he was deserving of his award. Joaquin Phoenix gives a\nchilling, dark and excellent performance. The rest of the cast delivers good\nperformances too. Overall, 10 out of 10.\n"},
{"review": "\n\nGreat action troughout the film and never tiresome...\nCrowe plays a brillent part,he has some film history's top lines..if i had\nto say one bad thing about this film, it would be that its touch on the\nlong\nside...im glad tho its one of them films that will not have a\nsequal..yipppie!<br><br>Anyway take my advise if you've not seen this monumental\nfilm..\nWATCH IT ASAP!\n"},
{"review": "\n\nI wanted to see this movie so bad when i saw the previews but i didn't see\nit until it came out on video.  This is one of my all time favorite movies. \nI didn't even know who Russell Crowe was before I saw this.  Now he is one\nof my favorite actors.  His performance is beyond great, there are no words\nto describe it.  The entire movie is just so good, there are no cheesy or\nstupid scenes.  it's a movie anyone can love and EVERYONE should see.  And\nthe battle scenes are really good.  They are gory, but if you saw The\nPatriot with Mel Gibson and was okay, you'll be fine in this movie.  I don't\nwant to say much about the plot of the story because it is just so good and\neveryone has to see it for themselves.\n"},
{"review": "\n\nI was very hesitant to watch this movie based on the commercials. I\nthought\nit would be a boring movie about a guy fighting lions. But, the movie is\ngreat!!! It combines an action movie with a love story (love of country).\nIt\ndefinitely ranks in my top 10 of all time. Honestly, this is one of the\nfew\nmovies EVER that made me cry. Great plot, excellent acting and wonderful\nscript. \n"},
{"review": "\n\n   \"Gladiator\" is a film of epic proportion.  Russel Crowe gives his academy\naward performance, the first of a probable long list of awards for this\ntalented superstar.  The DVD is particularly entertaining in that it also\nshows the making of the film and much of what was left on the cutting room\nfloor.\n"},
{"review": "\n\n****<br><br>Starring: Russell Crowe, Joaquin Phoenix, and Connie Nielson.<br><br>A Roman general becomes a slave when he is betrayed.  His wife and son were\nbrutally murdered by the prince.  But when the slave becomes a gladiator, he\nfights his way to get to the prince.<br><br>The battle sequences, in my opinion, were breathtaking.  Especially the\nfight between all the slaves and the other fighters.  This movie is quite\nbloody (That black arrow lady bit the big one), so you better not eat much\nbefore you see this. <br><br>This film is one of the greatest of all time, and it deserved every award it\nwon.\n"},
{"review": "\n\nI don't like the trend modern movies are taking.  Simply put, they kill\neveryone the main character knows, and that forces him into action that will\nforce him to action that involves killing all the bad guys.  Normal \nantagonists aren't enough anymore, the bad guys must be literal psychos. \nIt's depressing. <br><br>This movie handles things a bit differently.  The main character actually\nremembers his wife and kid throughout the entire movie.  Sorry, no more\nspoilers.  In any case, I like the camera movement during the large action\nscenes as it helps to simulate the chaotic action experienced during action\nscenes.\n"},
{"review": "\n\nI like to try to \"switch\" roles in movies; then when the actors/actresses\njust don't measure up the same way the final cast does, then we can see\njust\nhow hard casting directors must work to fulfill this delicate cog of the\nsilver-screen wheel.<br><br>Russell Crowe as Maximus was a role just for that actor. Also the Emperor\nCommodus, played by Joaquin Phoenix, that part was well cast. But the two\nfine actors just cannot be reversed with the roles, can they? Of course\nnot.<br><br>The medium of movies requires tons of man-hours, equipment, then\npost-production, etc., all of this just to tell a story, entertain people\nfor a very short time. Gladiator was that movie that utilized all\navailable\nfacilities and human potential to closely portray this tale of the Roman\nEmpire circa 180 A.D. This movie really did not stray too far from reality\nas a lot of movies do, just for the entertainment value. We do know that\nthe\nColiseum existed, have historical accounts that closely resemble the\nliving\nconditions and daily life of the people of 180 A.D.<br><br>Gladiator has a moral center in which the main characters never waved from\neven when it could be expected to do so under such conditions.<br><br>Maximus drove everything he had to accomplish what he did, against the\ninsurmountable odds, and that makes a great story.\n"},
{"review": "\n\nGladiater is without a doubt the best movie of the new millennium. There are\nalmost no flaws with the filming or acting (aside from the fact the Russell\nCrowe is in real life a loser). Crowe deserved his accademy award for\nacting.                   PLOT. A general in ancient Rome is forced to flee\nthe land after not bowing before the new Emperor ( who killed his own father\nto be Emporer). And so Maximus ( the general) becomes a slave and must\nbattle through Gladiator combat, hoping to avenge the death of the original\nemperor.           The film is packed with pulsating and gruesome violence\nand yet incredible acting abillity. 9.5 out of 10.   PSSSST! if you watch\none of the chariot battles carefully, you can see a gas canister which the\nfilm makers needed to flip over one of the chariots!\n \n"}
]