[
{"review": "\nI was lucky enough to be included in the group to see the advanced\nscreening in Melbourne on the 15th of April, 2012. And, firstly, I need\nto say a big thank-you to Disney and Marvel Studios.<br><br>Now, the film... how can I even begin to explain how I feel about this\nfilm? It is, as the title of this review says a 'comic book triumph'. I\nwent into the film with very, very high expectations and I was not\ndisappointed.<br><br>Seeing Joss Whedon's direction and envisioning of the film come to life\non the big screen is perfect. The script is amazingly detailed and\nlaced with sharp wit a humor. The special effects are literally\nmind-blowing and the action scenes are both hard-hitting and\nbeautifully choreographed.<br><br>While all of these things (script, action, special effects and so on\nand so forth) are important... it's no good having them spot on if you\ndon't have a cast that just isn't right. But fortunately, for fans and\nfor the actors involved, Whedon's cast not only work brilliantly\ntogether but are perfectly comfortable wailing on each other and\nthreatening each other all day and night.<br><br>The actors' performances in \"Marvel's The Avengers\" are simply\ncaptivating and there are many instances where we get a glimpse further\ninto their characters pasts and innermost feelings. Robert Downey Jr.\nwill have you in stitches. Scarlett Johansson will have you staring in\ndisbelief as she winds her way through sticky situations. And Tom\nHiddleston will have you simply shaking in your seat with fear.<br><br>All in all, Marvel's The Avengers is a visual delight and I cannot wait\nto see it again, and again, and again. Marvel fans will not be\ndisappointed, and something tells me that most of you will agree with\nme wholeheartedly.<br><br>The Avengers, assembled and awe-inspiring. Ten out of ten.\n"},
{"review": "\nThis remarkable movie easily fulfilled and then exceeded all\nexpectations. I've been waiting for this movie since Sam Jackson's\ncharacter uttered those famous words after the first Iron Man film...\nStark now knows he's not the only superhero in his world and it's as\nbig a treat for our real world as it gets. Seeing the \"Avenger\nInitiative\" in action is as great as I would ever have hoped! Hell, who\nam I kidding, I've been waiting to see this movie all my life. Who\nwould've thought years ago that ALL these characters could fit in to a\nfilm and all of them be done justice? It delivers greatness from scene\none and has to be considered the best this genre has EVER produced.\nTruthfully, as good as some of the previous work has been from every\nstudio, nothing else has come close. That's not hyperbole; I really\nthink most will agree if they see it with an open mind. I loved this\nmovie's depth, heart, humor, gravitas, action, performances, emotion\nand payoff. I honestly can't wait to see it again with the rest of the\nworld later. Right now, I'm simply basking in the greatness I just\nwitnessed!\n"},
{"review": "\n'Avengers Assemble' ('The Avengers') is a truly enjoyable superhero\nfilm that lives up to its hype and creates a story that allows for four\nof the greatest superheroes to connect in this mega-blockbuster\nextravaganza. Joss Whedon has created one of the most action-packed\nMarvel films to have graced the screen, full of humour, thrills and a\ngreat cast of characters, all of which impel this visual effects-driven\nspectacle. Whilst I had the great opportunity to watch this epic in the\ncinema in 3D, the film is equally as stunning on an average television\nset, with the final battle between the Avengers and Loki's army being\none of the most spectacular scenes in a superhero movie. An impressive\nand remarkable fantastical superhero flick from Whedon.\n"},
{"review": "\nI'm happy to report that everything established in previous movies pays\ndividends in a big way. It's not that anyone needs to see those other\nAvenger solo films before seeing this gem but it certainly adds depth\nand texture to this amazing product. Not having to intro big main\ncharacters deeply allows the action to flow but also allows for better\ndevelopment. This also allows them to probe deeper into the character's\npersonalities. This heightens the tension, so often missing from\ncomic-book movies, and adds real weight to the story as well as the\naction sequences which are thrilling and often mesmerizing. The result\nis a film that's just flat out exceptional.<br><br>Of course all the phenomenal heroes got to shine and the story\naccommodated them all perfectly. What I loved is that Marvel did it\nagain with their main villain. Loki was just so wonderful and complex\nin this amazing movie. Spurned Loki masterfully dances on the fault\nlines of villainy and redemption. He always keep people guessing and.\nAgain, that's just shear perfection coming from the god of mischief. He\nhas such a mixture of emotional psychological complexity. You have\nsomebody who's capable of thinking and strategizing at the speed of\nlight, but underneath that is a deep well of pain that at any moment\nthreatens to boil over and Tom Hiddleston plays it like the master he\nhas become. This is Oscar worthy villain performance good.<br><br>The performances in this movie are as good as any I've ever seen in an\nadventure film. The great actors say that acting akin to playing\ntennis. The rally that they play with a new partner is completely\ndifferent from one to the other. Each of these GREAT actors have such\nspecific talents that it's fun to see them play off each other at\ndifferent times in this movie. I think Whedon realized this as both\ndirector and writer and shuffled things around on purpose to play to\nstrengths. It's just another wonderful aspect of this spectacular movie\nevent.\n"},
{"review": "\nI just loved Marvel's Avengers. I thought it was smart and the\nimpressive cast really delivered! This movie works on so many levels\nand makes you draw on just about all of your emotions. I don't remember\nwhen I enjoyed a movie this much! Such cool fantasy but what makes it\nextra special is following this film after all the other solo efforts\nfrom each character. I enjoyed the others films quite a bit but they\nall delivered something different. Seeing them blend together in\nAvengers and the sparks that resulted was the extra special treat.\nExample: They blended the grounded futurist (Tony Stark) with the Norse\nthunder god and his angry brother in a perfect way. Same could be said\nfor every other character. It all works. In fact, it doesn't just fit,\nit's a symphony and that dyconomy and difference in characters are what\nmakes it truly great. It's why this movie stands so tall above any\nother franchise at the moment. Things like Transformers, GI Joe and\neven Star Trek all operate with monotone restrictions. Avengers covers\nall angles and delivers depth with its fun.<br><br>I haven't enjoyed a movie this much in years if not ever!\n"},
{"review": "\nThis is an OK film. There are some good things, some awful. But this is\nby far the most overrated movie of all time. Characters The characters\nare good. I didn't attach to them even though I had seen lots of the\nother MCU movies. The performances are good but nothing amazing. RDJ is\ngood as Iron Man but I just don't like the character. I didn't care\nabout any of them and Coulsons death was boring and I didn't care for\nthe character.<br><br>Villain Loki was good but not great as a villain. He is by far a good\nvillain but isn't very threatening which is the main point of the\nvillain. He wasn't even a threat until the Chitauri turned up and they\ncould have been taken down by the army. Plot This is the main reason\nthat this is overrated. It has no plot. It is very simple but still has\nplot holes. The main threat of the movie is actually very easy to take\ndown so the Avengrrs aren't needed whatsoever. They could have been\ndefeated but the army and if they were a threat to the world why didn't\nthey even make it past ONE CITY. Most of the time plot holes are\ncreated by us not thinking right and using common sense but these plot\nholes are gigantic. Summary What I liked: characters, villain, effects\nand action What I disliked: plot, music and villains army. Overall this\nis very overrated and so it gets a: 5.4/10\n"},
{"review": "\nThe avengers. One of the most hyped comic book movies of all time.\nAfter years of build-up with solo movies, the avengers is born. Is it\ngood? does it still hold up? the answer is no. I admit, the first time\ni saw this movie in theaters, i was having a blast and enjoying it very\nmuch. However, the film gets worse for me each time i give it a second\nwatch. The film is centered around Loki(played by Tom Hiddleston), who\nwants to take over the world, while the avengers work out their ways to\nstop him. It is as generic and lazy as it sounds. The film barely has\nany story or even character development/interaction. It's nothing but\none liners and action. None of the characters have a defined\npersonality. Tony Stark is a one dimensional clown, Thor is has the\ncharm of a wood that speaks in a Shakespearean way, black widow and\nhawkeye are nearly the same, only their gender are different. Hulk has\nhis moments, and captain America is one of the most boring comic book\ncharacters i have ever seen in this movie. It's basically a Michael Bay\nmovie minus the women objectifying, but same level of obnoxious and out\ndated film making. One of the most overrated trash movies i have ever\nseen. This movie gets 3/10 from me\n"},
{"review": "\nI wonder when people will understand that they are watching the same\nmovies over and over again with only different heroes... Even without\nwatching the movie an 8 year old can write a summary of it and it would\nbe 90% accurate. Bla bla bla good guys come together bla bla bla they\nstart up pretty good bla bla bla they argue bla bla bla they reunite\nand kick the villain's ass. How original(!) And this thing applies for\n99% of the Marvel movies and about 80% for DC. And there are major\nlogic mistakes also like captain America can protect himself from\nenemies with a shield not bigger than a large plate. I know it's a\nsuper hero movie but, really?It's like bad guys are not even trying. No\nneed to talk about Black Widow... Use your minds people!\n"},
{"review": "\n*Spoilers*<br><br>Just when Comic book films were truly starting to enjoy a time of true\nartistic relevance and seemed to be on the verge of officially casting\noff the shackles of stereotypes and bias that have plagued the genre\nfor decades, along comes a film to firmly entrench it in every single\nhackneyed cliché and trope that have been the deservedly derided by the\neducated community.<br><br>The Avengers is, by far, the most uninspired CBM story I've seen from\nthe CBM genre to date, disguised by draping a cheap, easily exploitable\ncrossover gimmick over it, not so dissimilar to the various other\npoorly conceived amalgamations that have been presented to us over the\nyears in various mediums (Cartoon All Stars, AVP, Freddy v Jason, and,\nmost recently, Dawn of Justice).<br><br>Poorly executed, nonsensical characterization (\"i'm Always Angry\",\nbasically the 2012 version of \"Your mother's name is Martha too?\"),\nforced interactions and stock 'argument' dialogue (We're not a team,\nwe're a time bomb.\", subtle.), and a total lack of dramatic heft give a\nvery light (story-wise, not tone), one-note, TV episodic feeling to\nwhat should have been a complex, multi- layered epic.<br><br>Overall, a conglomeration of \"fanboy\" moments vainly stitched together\nto attempt some sort of narrative.\n"},
{"review": "\nTerrible. Complete trash. Brainless tripe. Insulting to anyone who\nisn't an 8 year old fan boy. Im actually pretty disgusted that this\nmovie is making the money it is - what does it say about the people who\nbrainlessly hand over the hard earned cash to be 'entertained' in this\nfashion and then come here to leave a positive 8.8 review?? Oh yes,\nthey are morons. Its the only sensible conclusion to draw. How anyone\ncan rate this movie amongst the pantheon of great titles is beyond me.<br><br>So trying to find something constructive to say about this title is\nhard...I enjoyed Iron Man? Tony Stark is an inspirational character in\nhis own movies but here he is a pale shadow of that...About the only\n'hook' this movie had into me was wondering when and if Iron Man would\nknock Captain America out...Oh how I wished he had :( What were these\nother characters anyways? Useless, bickering idiots who really couldn't\norganise happy times in a brewery. The film was a chaotic mish mash of\naction elements and failed 'set pieces'...<br><br>I found the villain to be quite amusing.<br><br>And now I give up. This movie is not robbing any more of my time but I\nfelt I ought to contribute to restoring the obvious fake rating and\nreviews this movie has been getting on IMDb.\n"},
{"review": "\nI always like comic based movies and this one did not disappoint. Much\naction, which is why I watch these movies. There were plenty of\nHollywood retard thinking (which I wont mention so not to ruin the\npeople that are not bother by it). Many funny moments and again lots of\naction. I would of also like if there had been full movies or some more\nback story on some of the characters but overall the movie was fun to\nwatch. Great use of computer graphics and great sound track. In\naddition, the plot was not rich (which I think is acceptable in action\nmovies).<br><br>Definitely a great movie for anyone that like action flicks.\n"},
{"review": "\nThis is the best superhero movie I have ever seen. Full stop. <br><br>But did you actually read that? Did you get it? This is the best\nsuperhero movie I have ever seen.<br><br>It is about superheroes and it is made with today's technology. Today's\ntechnology allows movie makers to design scenes that were\ntechnologically impossible before. Any other previous superhero movie I\nhave seen was worse.<br><br>If you never got into superhero comics then this is not a movie for\nyou.<br><br>Now back to the summary line. Some (sorry) idiotic reviewers are\ncomparing this movie to: Memento, Blade Runner, Psycho, The Empire\nStrikes Back, The Matrix, etc. And talking about lack of symbolism,\ndepth, twists, etc. \"This movie doesn't deserve this high rating, etc.\"\nAre you people on drugs?<br><br>Possible explanations for these 1 star \"punisher\" reviews are: 1 some\npeople just love to hate or 2 they had a bad day or 3 they want to show\noff their \"expert\" knowledge of \"le cinema\" or 4 they were simply on\ndrugs while watching this movie<br><br>So bad news guys: This movie does not have the hyper-realism of \"The\nBicycle Thief\", the supreme intrigue of \"Citizen Kane\", the old fashion\nromance of \"Casablanca\", or the sublime dialogs of \"12 Angry Men\". This\nis only the best superhero movie I have ever seen.<br><br>I am 50, I have an engineering degree, my favorite pastime is movies,\nmy favorite genre is Sci-Fi, my favorite movie is Blade Runner and THIS\nIS STILL THE BEST SUPERHERO COMIC BOOK ADAPTATION I HAVE EVER SEEN\n(sorry for shouting) and this is why in my review this movie deserves a\n9 (not 10 because it is not art).<br><br>If you want to see an \"artsy\" movie check out \"The Bicycle Thief\" (and\ntake some antidepressants with you). If you want to see what a \"real\"\nsuperhero would do see \"Chronicle\" (highly recommended).<br><br>If you want to see a good comic book adaptation you cannot do any\nbetter than this movie\u0085\n"},
{"review": "\nA couple of chuckles from the one liners, action scenes that went on\ntoo long, and a predictable and inevitable ending. It was okay and easy\nwatching to pass a Friday evening, just don't expect too much from it -\nchallenging and a fine work of art it isn't, a bit of fun it is.\nHiddleston made a fine villain and the other characters performed as\nexpected,i.e. not everyone is going to get an Oscar for best actor no\nmatter how many films they make, some of the hook and line dialogue was\nspoken as if they were bored, perhaps they were. CGI is, well CGI. They\nworst aspect of this film though is the title, if you were expecting\nSteed and Emma Peel, or Purdey and Gambit then you are going to be very\ndisappointed.\n"},
{"review": "\nThe avengers is a classic marvel movie full of action, stunning special\neffects and the odd bit of funny humour. I think Age of Ultron will be\nbetter but this is still a fun and enjoyable film. I love how it\nappeals to everyone not just comic book fans. I can't find any flaws in\nthis movie , it kinda has everything you need in a good movie:action,\ncomedy, cool quotes and stunning special effects. I also love how\nmarvel did movies before this one so the characters could be developed.\nThe casting choices were also great. Everyone fits perfectly as the\ncharacter they were chosen to play. Robert Downey Jr is great as Iron\nMan and Scarlett Johannson is amazing as Black Widow. My favourite is\nSamuel L Jackson as the tough but amazing Nick Fury. All in all WATCH\nTHIS FILM.\n"},
{"review": "\nTHE GOOD- I was truly impressed with how well they pulled this movie\noff. The visual effects were all very clean. The characters were\nportrayed by the actors very well. This movie was loaded with action\nkeeping everyone's attention glued to it. I was so impressed, I went to\nthe theater to see it more than once and recommended it to everyone. I\nwas very happy to see most of the actors return to portray their\ncharacters in this. THE BAD- Most characters.... The hulk was my big\nissue here. Mark Rufflo was good with the Bruce Banner character but\nthe graphics for the hulk just did not meet the level of the movie\nstarring Edward Norton. But it was not so bad that I could not look\npast it and really find enjoyment. I will most definitely go see\nanother installment of Avengers.\n"},
{"review": "\nThe movie is certainly marvel's best till now and has great effects.\nThough little childish at times it is very good. As I expected it was\none of the best films with descent, comedy parts. The acting was above\naverage and the dialogues were really mind-boggling. It was a bit\nlengthy but was touching every single minute. The story was very good\nand the superhero's were described nicely. Bruce Banner very polite\nwhen he was not Hulk, Captain America very serious and all that. It was\ndefiantly worth watching and is one of the best superhero films. I am\nlooking ford for the Avengers 2 and I am searching the whole internet\nfor a little glimpse of it.\n"},
{"review": "\nLoved this movie, even at almost 3 hours long it didn't drag. Joss\nWheddon (Firefly and Buffy) effortlessly out did all of the battle\nscenes in every Transformer movie with the climatic showdown. there are\neven two or three seriously laugh out loud moments, mostly concerning\nThe Hulk, but don't worry the film takes itself fairly seriously so you\ncan escape into the story and immerse yourself.<br><br>Fans of Ironman, Thor and Captain America will not be disappointed.\nEvery one of the superheroes gets their moment in the sun. And of\ncourse, there's Scarlett's character Black Widow. YUM! I'm giving the\nmovie 10/10 (2D HD version) because it's so entertaining and it\nfulfilled all my expectations. You won't be disappointed.<br><br>As far as the format goes though, stick with HD, there wasn't any real\n3D moments. If you are hugely into your 3D experience, think twice\nbefore paying the extra, there wasn't any stand out 3D moments, but\nlots of out of focus backgrounds which kinda wasted the small fortune\nthat must have been spent on production. Go HD you'll get a better\nexperience.\n"},
{"review": "\nI'll admit it, I was extremely doubtful about this film. I've loved\nJoss Whedon's work my entire life and I had enjoyed all the previous\nMarvel films that led up to this one, especially Iron Man. But the fact\nthat they brought together all of these different characters from all\nthese different movies and put them together in 2 1/2 hour film was\nunprecedented and almost seemed impossible. But the optimist in me got\nme to the theater with me expectations shaky. Once the film started I\nwas quickly drawn in and once the title appeared on the screen I knew\nthat Joss Whedon had done it. The Avengers is without a doubt my\nfavorite Marvel film and even my favorite action film ever made. Whedon\ndid a great job writing this masterful, witty script that ingeniously\nput together all these characters and made it flow perfectly. The\nactors did such a great job playing these characters again and it\ndidn't seem like anyone was underutilized and everyone got a chance to\nbe in the spotlight(especially the hulk). Once you see all of the\ncharacters assemble and fight the bad guys you can't help but fill with\nhappiness. The entire movie was such a fun thrill ride from the\nbeginning to the end and the ending battle scene was brilliantly done.\nI am extremely delighted to say that Joss Whedon has done the\nimpossible and made one of the most entertaining movies ever made.\n"},
{"review": "\nYeah, much like everyone else, I friggin' LOVED this movie. This is the\npurest comic book movie I have ever seen, and for that reason alone it\nworks. Everything, from the writing to the action to the humour to the\nchemistry between characters to even the pacing feels like it was\npulled straight from the pages of the lavishly ludicrous, and having\none of the gods of cult sci-fi/fantasy, not to mention a comic book\nwriter, at the helm of this movie was probably the only way this movie\ncould have possibly met with everyone's expectations.<br><br>4-5 years of build-up to this movie, and it more than just pays off; it\nwins the jackpot. I am yet to find a person who didn't like this movie,\nand I can fully understand why. I honestly TRIED to find something\nabout it to even nitpick at, and found nothing. This is the ultimate\ncomic book movie; I highly recommend this to any lover of action,\nsuperhero or sci-fi movies, as well as to any avid comic book readers.\nFor all those who don't fit into these categories, this movie may just\nconvert you.\n"},
{"review": "\nthis movie is the best. I did not expect it to be good. WARNING this\nwill have spoilers if you haven't seen this STOP READING. Loki is back\nand Nick fury is calling the Avengers. Thor,Hulk,Captain America,\nHawkeye,Iron Man,and Black Widow. Iron Man was funny. Robert Downey Jr\nis the best Iron Man. Also The Hulk is funny. one part hulk punches\nThor. If you haven't seen the after credits of Thor And you don't\nunderstand why Lokis back, Go watch the after credits for Thor and it\nwill explain. During the credits Their is a villain that leaves for a\nsequel. Also after the credits its the best seen it show them eating.\nNow Im finished I give this a perfect 10!!!!\n"},
{"review": "\nI had the huge privilege of winning tickets to a preview screening for\nthis movie one week before release in the UK.<br><br>I had enormous expectations for this movie ever since the post credit\nscene of Iron Man in 2008. And all I can say is my expectations weren't\nnearly high enough. <br><br>Every second that passes by in this movie keeps you gripped to the edge\nof your seat, the brilliant chemistry of the cast does the excellent\nwriting and directing of Joss Whedon justice, the spectacular special\neffects, and plot turns throughout really make this a cinematic epic,\nand without any shadow of doubt the greatest super hero blockbuster of\nall time, while the 3D was not 100% necessary it certainly gave this\nmovie an extra punch, as although it was done in post production you\ncould clearly tell that this was intended to be a 3D movie.<br><br>In my opinion the person that stole the show was Tom Hiddleston and his\nexcellent portrayal of Loki, Robert Downey Jr. and Mark Ruffalo were\nalso excellent.<br><br>This movie also packs a huge comedic blow, being a lot funnier than\nmost comedies i have seen at the cinema.<br><br>Every person who had any part in making this movie needs to be\ntremendously proud of themselves.<br><br>This is a truly thrilling experience and the only way for me to finish\nthis review is by saying, bring on Iron Man 3, Thor 2 and The Avengers\n2!\n"},
{"review": "\nThe graphics of the movie are amazing.IT includes many awesome scenes\nsuch as fighting,immense action scenes transforming of tony stark and\nhulk other themes of the movie are the attitude of tony,huge star\ncast,action packed scenes and many more.on the whole you get the\npleasure of watching a nice movie and the time just passes by when you\nwatch this movie.but the starting of the movie is somewhat\ndragging.when the characters come into play one by one the movie gets\ninteresting.it also has some comedy scenes.it is the first movie to\nhave more than 3 marvel characters.if you are a lover of visual effects\nyou must definitely watch this movie!!!!!!!!!\n"},
{"review": "\nEach plot of the movie make us curious of what comes next. The direct\nknow how to manage every superheroes and villains in balance, all of\nthem has unique strange. We keep wondering how Iron Man look so cool\nand why Captain America is a serious patriot. The effect and CGI are\nalso outstanding. And as usual, Marvel will give so many easter eggs\nfor geeks to find out. The success of this movie come up when Iron Man\nfranchise along with Captain America: the first avenger and Thor\nreleased previous years. The Avenger can be main contender for best\nsuperheroes movies against DC's Dark Knight Rise though I prefer Marvel\nmovies. I suggest all Marvel/superheroes movies lover to watch this\nmovie. period.\n"},
{"review": "\nThis film tells the story of a team of superheroes who save the world\nfrom an evil and ambitious extraterrestrial man.<br><br>Being a blockbuster, \"The Avengers\" does have all the elements to\nentertain the crowd. The idea of putting all the superheroes in one\nfilm is a good idea, because viewers get great value for the price of a\nticket. The stellar cast and the constant action is quite amazing. The\nvisual effects are great, especially the finale which lasts for an\nhour! The massive destruction of Manhattan is literally earth\nshattering, I was quite in awe of the aliens flying through the\nskyline, and all the action that goes on. <br><br>I enjoyed the film a lot.\n"},
{"review": "\nSaw the preview at the end of Thor back in 2011... had to wait almost a\nyear to experience the global phenomenon first-hand. The theater\nexperience wasn't something to forget.<br><br>All in all, the title of this review says it all. 'Marvel's The\nAvengers' is quite possibly the greatest superhero movie in history.\nThe combination of hardcore assassins Widow and Hawkeye, reclusive\nBanner, arrogant Iron Man, leader Cap and the Norse brothers Thor and\nLoki mixes itself together into a concoction of personalities and\nsuperpowers which guarantees to impress.<br><br>Marvel has set the bar high for themselves. Since its release, only a\nselect few superhero movies have compared to it. And all of them have\nbeen Marvel!\n"},
{"review": "\n\"The Avengers\" brings together a group of extremely talented actors and\nepic superheroes, to create an action packed movie with hilarious\nbanter laced into countless scenes. Superhero movies give actors a\nchance to play new characters with personalities they have never\nportrayed before. Chris Evans is the extremely passionate and kind\nhearted Captain America, while Robert Downey Jr is the tougher and\nsassier Iron Man. The film is very creative with introducing each\ncharacter and later bringing them together. The villain, Loki\nLaufeyson, played by Tom Hiddleston, even shows his weak spots and is\nalmost seen as part of the Avengers team. The actors have fantastic\nchemistry with each other on and off screen, and they make man- tights\nand capes look more fashionable than ever. The majority of the film is\ndone by special effects, made by an amazing team. They transform New\nYork City into a place for heroes, placing Tony Stark's towering house\nin the middle of the city. Even at the end of the film, the\nunsuspecting Tony Stark is willing to sacrifice himself for the good of\neveryone else. This is a wonderful movie to watch if you want to be\nthoroughly entertained while having your feeling played with at the\nsame time.\n"},
{"review": "\nAs a reviewer, I don't mess up often but, just like the line where\nStark is ribbing Loki, sometimes even an IMDb top reviewer can have\nperformance issues.<br><br>My first view, I was annoyed that so much time was spent on backstory\nand it took an hour to get the ball rolling. Although in fairness once\nthis story starts to move in the second hour, it MOVES.<br><br>By my third viewing I could see the issue. I grew up with these\ncharacters and I had expectations. The expectations were incorrect, I\nnow know, because those expectations were the reason the Marvel library\nwas such a mess before the arrival of the Whedon Bros.<br><br>So what Joss did was analyzed what was not working in past Marvel films\nthen de-constructed the Avengers story, then build a film which could\nact as a base for future sequels, wit ha solid foundation.<br><br>And wrote a script to die for. By the third time around I was actually\nlistening to the film instead of just watching, and boy can that guy\nwrite.<br><br>Like the line I posted as the title of this review. It took me 3\nviewings to catch it. It is sly, it is sexual, and it is totally easy\nto overlook in all the action. But I was on the floor laughing.<br><br>So there you go, it is fun, action packed (last hour), written at an\nOscar level, the characters are perfectly cast (except the Nick Fury I\ngrew up with was Caucasion, but I guess no one remembers) and, to keep\nthe suits happy, not only made a bundle on its own but launched a new\nfranchise.<br><br>So thats a 10\n"},
{"review": "\nIt may be mildly entertaining, but it's still just other very long and\nslow mix of tired battle scenes and some wooden, masturbatory,\nborderline cringe-worthy dialogue, all leading to a predictable ending.\nThere were a couple good laughs but that doesn't really make up for the\nfact that this was over two hours and twenty minutes. Robert Downey,\nJr. was the best part because his sarcasm is great. It's too bad I\ncan't really say much about the rest. And keep in mind, I genuinely\nlike the Iron Man movies and Captain America.<br><br>Here, everyone's already established and undefeatable. What's the point\nof having characters that you can't root for, and therefore you don't\ncare about the outcome? They never hit rock bottom, therefore there's\nno end to the second act, therefore the whole film is completely\nunsatisfying. And again, it's boring. Two and a half hours leading to\nan obligatorily happy and sequel-welcoming ending. Dear Lord, change it\nup.<br><br>Why was The Dark Knight Trilogy good? Because it had human characters\nthat had legitimate weaknesses, therefore carrying on the plot that had\nthe characters grow, and if they died, we felt sad. Why? Because we\ncared for them. Why did we feel bad for James Bond in Casino Royale? We\nbelieved he loved Vesper and the third act was made with an emotional\npunch. Why did we care for Silva in Skyfall? He was a great villain\nbecause he was funny, menacing, fantastically portrayed by Javier\nBardem, and his motives had a believable character background. M\ncaptivated our interest, and it was a well-developed,\nterrifically-acted character that had great mother-son chemistry with\nBond. The Avengers has none of that, just pretty cities that go boom,\nslapstick humor and throwaway lines, all on repeat. The characters\ninteract with each other like annoying small children, and the same\ndialogue constantly put on repeat made me so bored.<br><br>4/10, bad, below average, horrifically overrated, two thumbs down, etc.\n"},
{"review": "\nSo: Get as many superheroes as you can, put them into THE most obvious\ncliché superhero story that ever existed, add some hot girls (including\naunt Robin from that unfunny show that's kind of like Friends) and, of\ncourse, super cool special effect and you can be assured that the 13\nyear old kids on IMDb will make sure it has the same rating as On the\nWaterfront, The Deer Hunter and Pan's Labyrinth.<br><br>Maybe Nolan proved that superhero movies can be much more than a\ndisplay of how much money you put into special effects, but this is\nexactly that. This is as predictable and as unoriginal as it gets. But\nof course, putting a bunch of superheroes together and bringing a bunch\nof fan bases together and making a bunch of money along the way was a\ngenius idea. And pretty much the only one.\n"},
{"review": "\nI really enjoyed the earlier ones but this was really dumbed down.<br><br>With very little effort they could have made this a great movie.<br><br>You cannot defy laws of physics in special effects or it becomes\ncompletely 5 year old cartoon nonsense. That is the problem here. <br><br>Be logical with the scenes instead of being lazy. The graphics\ncapability is there so don't cheapen it my taking short cuts.<br><br>It distracts from the entire movie.<br><br>That, and great effects mixed in with the most primitive of video\noverdubbing. In many scenes you can plainly see the backdrop with\npeople standing in front of it. You'd think you were watching a 1940s\nfilm with overdubbing ... geeesh.<br><br>Come on, do it right or don't do it at all.\n"},
{"review": "\nThis movie is meant for those 8 and up. It is also meant for those who\nlike SciFi Fantasy. The Avengers, a group of single comic book heroes,\nget together to save the world from Lokki. Samuel Jackson, the head of\nthe Earth's protective forces, plays his role well. The characters are\nshallow, but let's face it, it's comic book time. It is fast paced and\ncontains interesting toys and gadgets. It works as a great party movie.\nI loved the sets, the colors, and the characters, all in one film. Thor\neven comes to the rescue. All in all, the movie is very entertaining\nand is well worth its greater than 2 hour booty killer time. Get a bowl\nof pop corn and a group of friends, turn this movie into a SciFi party.\nI give it 5 thumbs up.\n"},
{"review": "\nWith all the positive reviews and word-of-mouth about this movie (not\nto mention the box office receipts) I went into this movie expecting to\nbe wowed. I'm talking wowed along the lines of what I was having left\nthe theater the first time I saw The Dark Knight. I waited and waited\nand waited. I was never wowed.<br><br>Now, this wasn't a bad movie by any means - it just didn't come\nanywhere close to being as good as it was advertised. Iron Man and the\nHulk were scene-stealers, Hawkeye, Capt. America and Black Widow were\nOK and every time Thor had to utter a line, it made me want to cringe\n(his character was so overacted by Chris Hemsworth). But most\ndisappointing of all, the villain was a total wimp - not scary, not\nmenacing and not cool whatsoever. (Not to mention the regurgitated plot\nlines: alien takeover, yeah didn't see that in the final Transformers\ninstallment; Loki being captured, wasn't that part of the Joker's plan\nin TDK?; etc) Overall, not a bad movie - but lower your expectations.\nIt's fun and entertaining, but not a whole lot else.\n"},
{"review": "\nI watched. But I couldn't' t like it very much. This is action movie\nbut i could see action just twenty minutes. Shortly %15 action, %10\nmythology %75 dialog. <br><br>In my opinion; Captain America movie is OK, Hulk movies is OK, Iron man\nmovies OK, S.H.I.E.L.D movie is OK. But hero's team movie avengers is\npoor than others.<br><br>This is movie which you can watch in your spare time. 8.6 rating is too\nmuch for this movie. it can be around 5 average. Also movie action\nscenes look like computer game trailer. Movie story is better than\nmovie digitized action scenes. This movie hasn't got story enough.\n"},
{"review": "\nfirst of all, i didn't watch that many superhero movies, so i sadly\ndon't know much about the different characters and their universes. but\ni like the idea of bringing them all together in a single movie, and\nfor me it works. the whole concept is a great idea, and the story is\nreally good and exciting. i also love the effects, and the different\ncharacters that are thrown together. i also love that it portrays\nsuperheroes with different strengths, but also their weaknesses. they\naren't portrayed as superhuman, as you could expect, they all have many\nthings to learn, and their flaws. so what more can i say, (as a guy\nthat don't know anything about marvels universes), else than it is\nreally recommendable, and it deserves top score.\n"},
{"review": "\nBoy, am I in trouble. Because I thought it was just plain silly.<br><br>Maybe it's because I haven't seen Thor. Because I found Tom Hiddleston\nso ludicrously miscast as Loki that I couldn't maintain suspension of\ndisbelief.<br><br>First, this deity who arrives in an awesome burst of netherworld\nenergy, and carries a scepter capable of slaying whole armies, has to\nescape sitting awkwardly in the back of a pickup truck for God's sake.\nAnd then when he stands up in his silly horned costume and tells a\ncrowd of people to kneel to him, his complete lack of gravitas in the\nrole just set me laughing.<br><br>I couldn't watch it after that.\n"},
{"review": "\nI have never reviewed anything here on IMDb but after watching the\nAvengers for the second time I just felt the need to say something. <br><br>Very well, after watching the Avengers in the cinema you don't reflect\nvery much of the bad things, it's all special effects and 3D stuff\ngoing on. But after watching this alone at home, I just felt it's not\nthat good. The story is cliché as many has mentioned, but I felt that\nthere are a few things that are unclear.<br><br>I just can't figure out how strong are the asgardians, they are\nsupposedly demi-gods. Still the hulk threw Loki around like nothing, I\njust felt that scene was unnecessary. I don't want the bad-guy to look\nso crappy. I just couldn't take Loki seriously he got tossed around a\nlot. Don't get me wrong I enjoy some of the humor added to this film,\nit's just sometimes it's not timed right it just seems wrong to me.<br><br>The most annoying part about The Avengers is that the Bad Guys didn't\nstand a chance. And I didn't like Loki for being a bad guy again.\n"},
{"review": "\nThe danger with every superhero movie is that it will end up either\nhorrifically unrealistic or unappealing to anyone over the age of ten.\nI am pleased to say that 'The Avengers' does not fall into either of\nthese pitholes - in fact, it has to be awarded the title of one of the\nbest films of 2012.<br><br>The actors were all amazingly casted in their respective roles and do\nan amazing job of creating intriguing and lovable characters. Many of\nthem were reprising roles they had taken on in previous films - Captain\nAmerica, Thor or Iron Man, for example - so we already had a good idea\nof how they would perform, but I feel they all exceeded expectations.\nRobert Downey Jr was incredible as the humorous yet conflicted Tony\nStark/ Iron Man, and Chris Evans was brilliant as the confused,\nout-of-time Steve Rogers/ Captain America. Mark Ruffalo, the newbie of\nthe cast, stepped into the role of Bruce Banner/ Hulk with great skill\nand dispersed all doubts as to his suitability. On the other side, Tom\nHiddleston really has to be congratulated for his convincing and\nsomehow relatable performance as the villain Loki, whose wit and tricks\nappealed to fans everywhere.<br><br>The special effects in this movie were undoubtedly excellent, and\ndespite their need to be ostentatious never seemed unnecessarily\nunrealistic. The director Joss Whedon did a fabulous job and has\ncreated a cinematic classic that will be praised for years to come.\n"},
{"review": "\nUK title \"Avengers Assemble\"/ Rest-Of-World \"The Avengers\". Just like\n\"Transformers: Dark of the Moon\", this film was eagerly anticipated by\nfans, such as myself. I could not wait for the film to be released on\n26th April. Unlike \"TF3\" however, this film live up to the hype. It\nsurpassed my expectations (and I expected a lot). It didn't feel forced\nand certainly did not feel like a sequel to one particular lead-up\nfilm. It felt like a well-made sequel to ALL the films.<br><br>The final battle wasn't just an all-out brawl - it seemed integral to\nthe story and characterisation of the film. <br><br>Every character had their \"time to shine\" and they were as you remember\nthem from their \"build-up\" films - Tony Stark was cocky, witty and\nlikable, Steve Rodgers was patriotic, a \"man-out-of-time\" and focused\non the mission and Thor was a demi-god warrior. <br><br>Then there's the Hulk, played by Mark Ruffalo instead of Ed Norton this\ntime around. This Hulk/Banner was perfect. Ruffalo brought a sense of\nhumour to this famously angry character and really helped pull-off the\nHulk where others have either tried and failed (Hulk 2003) or tried and\nonly just failed (The Incredible Hulk 2008). <br><br>We also got a brief look at Black Widow (Scarlett Johanson)'s\nbackground and her relationship with Hawkeye (Jeremy Renner). Even next\nto their super-powered team-mates, these two proved their worth to be\npart of the team.<br><br>Tom Hiddleston as Loki was brilliant, Samuel L Jackson as Nick Fury was\nwhat you'd expect from this actor, Clark Gregg was once again great as\nPhil Coulson and Cobie Smulders as Maria Hill was a good decision and\nwhile her performance was good I feel she was underused. <br><br>This film has and amazing soundtrack, brilliant actors, likable\ncharacters (even Loki), great 3D effects, an enjoyable story and epic\naction. Congratulations and thank you to Director Joss Whedon and the\nrest of the crew for putting together a masterpiece.\n"},
{"review": "\nThe Avengers is one of the best films that I have ever seen. A great\ncombination of all the best super heroes and Marvel have done a great\njob. Before I went to see it, I honestly thought it would be rubbish\nbecause quite a lot of Films that try to combine other characters or\nclever sequels never usually do well, but I think that The Avengers is\nan exception. It also has a great cast of well known actors such as\nRobert Downey Jr, Jeremy Renner and Sammuel L Jackson. My only concern\nis that the end battle against the Aliens went on a bit too long and\nthey could have shortened it by quite a bit. The Special Effects are\nsome of the best I've ever seen. Overall, I think that it is a great\nfilm that I highly recommend.\n"},
{"review": "\nLet's be honest. All the previous Marvel films leading to the Avengers\nwere great - story wise, acting wise, effect wise etc. Iron Man I &amp; II,\nThor, Captain America all turned out to be (surprise) box office hits,\nand one can see the point. So, when at the end of every movie, a post\ncredits scene was shown depicting that there is something even greater\nplanned, the expectations were raised pretty high.<br><br>Joss Whedon (Firefly, Cabin in the Woods) took into account that set\nexpectations, of both comic book fans and non-fans alike, and put\ntogether a superhero flick that'll rest proudly as the conclusion to\nits predecessors. The screenplay writers, the VFX studio, the actors\n(Robert Downey Jr. has always been my favorite) all deserve credit.<br><br>An action packed, blockbuster movie that already has every record\nbroken and every voice cheering, The Avengers is one of the best movies\nthis year. A must watch, even if you're not into this stuff. 10 on 10.\n"},
{"review": "\nI know there's comic book fans that have their favorites. There's also\nthe film fans that have their own favorites. There are also some who\nare so enamored and in love with The Dark Knight that they will pounce\non any film that is considered \"better\". For me, I've never been a big\ncomic book guy but I do enjoy a good film adaptation of them. I can\nlove The Dark Knight AND Iron Man. I don't have a bias. I enjoy several\nof these type of films regardless of the company, brand, or filmmaker. <br><br>For me, I absolutely love The Avengers. It brought out the little kid\nin me. At 33, cynical and disgruntled, that's a major compliment. I\nunderstand that the film is by no means perfect but it was just so much\ndamn fun. It made me want to buy a costume and play make believe in the\nbackyard again. But again, I'm 33, so I mean that figuratively. I just\nreally had a blast with this and this is the best theater experience\nI've had since seeing a Star Wars movie. I loved it and can't wait to\nsee it again. <br><br>So, for those who have hang-ups about how you don't want to hear its\nbetter or more popular than this or that, don't get caught up in that\nnonsense. Who cares where people rank The Avengers or Iron Man or The\nDark Knight or what have you? It doesn't matter. So, just do yourselves\nthe favor of seeing this movie. It is just a boatload of fun.\n"},
{"review": "\n\"Did anybody see Inception? I think that was just about the most\nambitious movie I've ever seen. And then I thought wait a god damn\nsecond\u0085 Marvel\u0085 Studios is going to take all their top superheroes, and\nthey're going to put them all together in The Avengers. That's the most\nambitious movie I've ever seen!\" \u0096 Robert Downey Jr. (Comic Con 2010)<br><br>It may have been the most ambitious movie ever\u0085 but boy did they pull\nit off! There was always a small doubt that The Avengers (2012) may\nhave been a flop for a couple of reasons. The first is the fact that\nthe Captain America (2011) and Iron Man 2 (2010) were slightly lower\nthan the standard of movies Marvel studios had shot out since 2008 when\nThe Incredible Hulk (2008) hit the big screens. Obviously this lower\nstandard must have been due to The Avengers being in production because\nthe film topped my list of favourite films and became number 1, yes, it\ntook over The Dark Knight (2008)!<br><br>To read the full review go here: http://www.teknue.com/reviews/review-\nthe-avengersavengers-assemble-2012/852\n"},
{"review": "\nI can not say anything more about THE AVENGERS; the movie just hit all\nthe right spots and a lot more. It didn't only entertain like how a\nbrainless popcorn movie would; it told a great superhero team story.<br><br>The characters were written perfectly, the action was spectacular and\nbest of all ever character was a joy to watch. The story had the\nperfect balance of comedy, action and drama (yes, there's a bit of that\ntoo and it's good). It's everything a comic book fan would want out of\na comic book adaptation movie.<br><br>Every member of the Avengers line-up (whether super powered or not) got\nthe right amount of screen time; if you were like me and thought that\nIron Man would get accidentally hog the screen because the trailers\nmade the movie look like \"IRON MAN AND FRIENDS,\" your fears will be\nwashed away. Mark Ruffalo also stole the show as Banner/ The Hulk; if\nyou had a few doubts about him playing the character after Edward\nNorton was left behind, fear not since he does the job well. I can go\nas far as saying that Ruffalo is the best incarnation of Banner so far. <br><br>Josh Whedon pulled off the impossible; he wrote and directed a perfect\ncomic book adaptation. He created what I consider the best superhero\nmovie so far. He made THE AVENGERS.<br><br>To say anything more would be a waste of time. Just go and watch it.\n"},
{"review": "\nI'm not going to spoil anything or get very technical here. I don't\nusually write reviews. I did so because this movie took me back to my\nchildhood like no other movie did.<br><br>Sure, it's not intellectually pretentious or groundbreaking from a\ncinematic or storytelling point of view, but it delivers perfectly.<br><br>The wit, conflict, adventure, heart and sense of wonder that I once\nfound in my crazy uncle's attic, slumbering inside those weird looking\nand dusty Marvel Magazines - populated with super-soldiers, handsome\nflying scientists, Norse gods, green monsters and incredibly hot chicks\nin black leather - are here.<br><br>As I grew up, I somehow repressed the idea that there was no such thing\nas fictional happiness. These characters will never exist, and it sure\ntakes suspension of disbelief to watch them run about. But this movie\nreminded me of what they made me feel before girls, party nights,\ncollege,taxes and other complicated, serious things came along. As the\nmovie ended, I felt overwhelmed by the readjustment to reality as I\nknew it in my young adult life.<br><br>I watched this with my 10 year old nephew. I don't know if that makes\nme the crazy uncle, but it sure was great to be back in that attic,\neven for a while. I always knew Hulk smashed. Now I know he always\nwill.\n"},
{"review": "\nNow I'm not a huge fan of superhero flicks, so maybe there's something\nI'm missing here. But walking out of the theater, all I felt was that I\nhad seen 2.5 hours of nothing but action and drama. Maybe that's its\npurpose? Maybe it's just not my cup of tea? For whatever reason, I was\nnot invested. This is hardly an interesting or exciting film, and I see\nno reason for the rave reviews or exceptional $$ it is making.<br><br>I suppose it has something to do with being a \"fan\"; as I said earlier,\nI am in no way a \"fan\" of hero movies but this one got such good\nreviews that I had to check it out. I was disappointed because,\nsurprise surprise, it felt EXACTLY like every other superhero movie\nthat had ever been made. Even more so since its a combination of all of\nthe previous heroes into one film. So really, it's not original, or\ndifferent, or exciting, or moving, or anything. It just IS.\n"},
{"review": "\nBefore I went to the movie I was shopping for Tshirts online and found\none that looks like the NASCAR symbol... You know the one--it looks\nlike the word NASCAR in motion with a bunch of colors coming off the\nleft side like its a car I guess. Anyway, someone made a Tshirt that\nlooks identical but instead of NASCAR it says BORING. Lol.<br><br>Anyway, flash forward to me falling asleep in the movie, butt numb, and\nI keep picturing that Tshirt. Boring. This movie. Really boring.<br><br>I think I fell asleep 3 times, for about 15 minutes total. Its hard to\nsleep too long because every now and then there is an explosion or some\nother loud whammo.<br><br>The Dark Knight was WAY better than this. Spiderman was WAY better than\nthis.<br><br>Is it worthy of 1 star? No. Maybe it should be 3 or 4... But I'm giving\nthe 1 to help offset some of the insane 10s I'm seeing on here.\nSeriously, there are people on IMDb saying its the best movie they have\never seen in their life. Really? Really!? Really. O.o I smell something\nfishy going on around here.<br><br>The movie was completely vapid, boring, convoluted. Nothing about the\nmovie was new or interesting.<br><br>I'm assuming the score has been manipulated by social media, hopefully\nIMDb will do something about it. I look forward to seeing the score\ndrop consistently for years to come, once whoever/whatever is driving\nthis fake voting moves onto a new project.\n"},
{"review": "\nthis is where IMDb needs to react to all those obviously faked reviews.\nif they don't people will just ignore all 'blockbuster'-reviews. which\nwould call for competition that will take action against this kind of\nmanipulation.<br><br>this has never been so obvious than with the avengers. this movie does\nnot deserve a rating above 4. the plot is uninspired and boring, has no\ntwists and everyone knows where it's going. the dialog feels very\nscripted. characters in comic books for 5-year-olds maybe talk like\nthat. superheroes don't. the acting is very unnatural, it feels very\nstaged and no emotion is being transported to the audience. the\ncharacters aren't developed, they just get different punchlines to\nthrow at the audience. the cgi is really bad, not worthy of a movie of\n2012. i think even '2001 - A Space Odyssey' (1968) had better special\neffects.<br><br>it seems that they spent almost all their money on the actors, forgot\nabout the story and just used the cheapest cgi they could get. the rest\nof the money they used for marketing and creating a hype (as i said,\nthis is obvious here on IMDb).<br><br>the whole thing is just cheap. but we will see more of this if people\ncontinue to make this kind of movie profitable. and this will probably\nbe the case, so expect more of these.\n"},
{"review": "\nEver since the beginning of the film, I was so amazed and happy That I\nwas at the premier of the movie. Very good acting from all the main\ncharacters and good acting from the rest. Great Directing and writing\nfrom Joss Whedon too. The cinematography was stunning throughout the\nwhole film.This is a fun action packed film for the whole family to\nenjoy just like the rest of the Marvel movies but better. The special\neffects by far are the best for any Marvel movie. The Hulk Looks so\nmuch more real. By the way The Hulk made the movie even better. Also,\nDO NOT SEE THE AVENGERS IN 3D! See the film because you will not be\ndisappointed even if you are not that interested into superhero movies.\nIt has a lot of humor and love, so again SEE IT!\n"},
{"review": "\nI watched this again recently (2016) after I've already watched all the\nother Marvel and superhero movies that came after it and this is still\nsuperior by a wide WIDE margin. The only superhero movie that eclipses\nthis one is Dark Knight, imo.<br><br>Considering the problems we think DC is encountering, trying to cram up\ntheir heroes into one movie, the Avengers did it. FLAWLESSLY. The\ndialogue isn't exactly Glenn Garry Glenn Ross of course, but 99% of it\nkeep you interested. The transitions to each scene are unbelievably\nfluid; the end of each scene almost always has a witty connection to\nthe next. The objective viewer doesn't struggle at all to ride the wave\nof the movie.<br><br>Try to imagine if you haven't seen this movie but you've seen all the\nothers. Try watching it again. You'll see what I mean.\n"},
{"review": "\nAnd remarkably brilliant. The action is dazzling the whole movie\nthrough. And the story escapes somehow to the usual plot of this kind\nof movies. All goes around the Tesseract, an energy source and who has\ngot it or is trying to. Loki an exiled Norse god takes it and tries to\nuse it to control or even destroy Earth with the help of and\nextra-terrestrial army of evil soldiers. The only solution S,H.I.E.L.D.\n(an agency aiming at Earth protection) envisages is to put together a\nteam of legendary heroes to fight that threat. But these heroes\n(Captain America, The Incredible Hulk, Thor and The Iron Man) are not\nexactly at the beginning very friendly to each other so their conflicts\nmust be first appeased before they enter in action as The Avengers to\nfight Earth's enemy. Then the action develops itself in overwhelming\nfights, collective and individual of astonishing and appalling quality\nuntil the final defeat of the bad ones. Chiefly the final scenes are\nexcellent indeed. This is one of the best movies of this kind ever\nmade.\n"},
{"review": "\nFrom the imagination of director/writer Joss Whedon, a powerful and\nloud action spectacle consumes the screen. Nick Fury (Samuel L.\nJackson) of the global peacekeeping organization S.H.I.E.L.D. summons\nthe services of the diverse and disparate group of heroes Captain\nAmerica (Chris Evans), The Hulk (Mark Ruffalo), Thor (Chris Hemsworth),\nBlack Widow (Scarlett Johnansson), Hawkeye (Jeremy Renner) and the Iron\nMan (Robert Downey Jr.), when the power hungry brother of Thor, Loki\n(Tom Hiddleston), is egotistical and brazen enough to attempt to\ncontrol and rule the earth.<br><br>Outstanding special effects and cinematography. Sound is also a\npriority and contains a soundtrack that features AC/DC, Soundgarden,\nEmile Millar and The Takacs Quartet.<br><br>A myriad of other players in the cast: Clark Gregg, Cobie Smulders,\nStellan Skarsgard, Powers Boothe, Harry Dean Stanton, Jerzy\nSkolimowski, Gwyneth Paltrow, Donald Li, Alexis Denisof and Stan Lee.\n"},
{"review": "\nIt is the first movie in which we will see several superheroes fighting\ntogether against evil forces who attacked earth.<br><br>It feels good when you see several marvel superheroes together on one\nscreen.<br><br>The film is very creative with introducing each character and later\nbringing them together.<br><br>Robert Downey Jr. is best in the role of iron man.<br><br>Other actors have also done a good job.<br><br>This movie contains amazing visual effects.<br><br>Story is simple but movie contains great fight scenes and action.<br><br>This movie cannot be missed by marvel fans.<br><br>Overall,the avengers is an amazing movie which creates a new benchmark\nin Hollywood. I will give this movie 9/10.\n"},
{"review": "\nthis movie is the worst movie ever made, what happened to black widow\nmake his own movie you know? why women can't be not superheroes because\nthey weak, they sexier and they know is how to cook? i hate\nmarvel!!!!!!!! i hate marvel cinematic universe and i hate movies that\ncount women as superheroes, that count when iron man says to captain\nAmerica ¡yo, captain how long are you gonna fart in black widow's face\nbecause she is so sexy! and captain says, ¡Cuba, i am going to Cuba\nwith meeting Fidel Castro and say how long are you gonna fart black\nwidow's face? and enjoying Havana cigars and pee his shoe are you gonna\ntell me about that marvel is enjoying his worst movies ever made, just\nlike superman 4 and batman and robin? and when scarlet Johnson is\nenjoying his farting hot tub, baby!!!!!!!!!!\n"},
{"review": "\nWhen this movie first came out I was somewhat excited. I hadn't seen\nratings like that very often (8.8 right off the bat), and I was fairly\nnew to IMDb at the time too. Unfortunately, it really wasn't anything\nspecial. <br><br>The plot itself is pretty lackluster. It's just an average action movie\nin terms of story. Sure, there's nothing really wrong with that, but\nnevertheless it wasn't very well-done.<br><br>The characters are just the same as the plot: nothing special. Sure, we\nget lots of looks at how well they fight, as well as a little bit of\narguing, but that's about it. The character development wasn't amazing\nin this movie. Sure, they had the other Marvel movies to develop the\ncharacters separately, but that's hardly an excuse not to put effort\ninto this movie. <br><br>The action, which is the only thing The Avengers contains, is all just\nfine. Everyone's just extremely overpowered, human or not, to an\nunrealistic level. Overdone fights aren't really my thing, considering\nhow commonly we see them. <br><br>Overall The Avengers is nothing special. Sure, it was risky for Joss\nWhedon to put all the Marvel characters into one universe, and he\nactually pulled it off, but giving points to this movie for that is\nlike giving it points for it's creation. The character and plot were\nvery average, and the action was rather un-amusing. The Avengers is\nheavily overrated in my opinion, and I personally wouldn't recommend\nit.\n"},
{"review": "\nThis movie revolutionized the way we imagine comic book movies, DC have\na big competition! Although the second one was better this movie this\nwas the original, which in a way means this is better. The villain in\nthis film is of course Loki who was played by Tom Hiddleston who was\noutstanding, but talking of amazing performances Rdj was as usual a\nperfect iron-man. The directing of Joss Whedon was ...well there are no\nwords he is a virtual God walking among mere mortals. To sum up great\nmovie, great acting and great directing it's definitely no wonder how\nit grossed to over 1.5billion! By Roman Torr who is without doubt the\nbiggest marvel fan ever!\n"},
{"review": "\nThe Avengers (2012): Dir: Joss Whedon / Cast: Robert Downey Jr., Chris\nEvans, Chris Hemsworth, Mark Ruffalo, Scarlett Johansson: Here at long\nlast is a combination of comic book superheros brought to the screen to\nthe delight of fans. Hopefully nobody will confuse the title with that\ncrap handed John Steed Emma Peel 1998 film that everyone wanted nothing\nto do with. Perhaps a title change? We have a host of superheros\nincluding Iron Man, Captain America, Thor, The Hulk, Hawkeye, and Black\nWidow. The villain is Loki of the Thor film and he has a world\ndomination scheme that is every bit as corny as any other world\ndomination scheme. That doesn't matter because viewers will attend to\nsee the combination of powers become a reality. Loki is a great villain\nand thankfully he is targeted by all of these heroes thus giving us\ngreat action sequences. His run-in with the Hulk is especially amusing.\nJoss Whedon is the right director to bring this spectacular together\nand the special effects created are explosive. Whedon also gives each\ncast member a good fair share of time. We have Robert Downey Jr as Tony\nStark / Iron Man whose sarcasm is a scene stealer. Chris Evans is\nthawed and ready as Captain America. Chris Hemsworth as Thor sets to\nbring Loki back to his planet for justice. Mark Ruffalo is terrific\nfilling in as the Hulk whose anger is subdued until fans are given the\npayoff in full blown green fury. Scarlett Johansson oozes sexiness as\nBlack Widow, a skilled spy trained by S.H.I.E.L.D. Third act descends\nto action combination of the various talented ensemble that is a\nthrill. Score: 9 / 10\n"},
{"review": "\nThis is truly an incredible movie! The actors were all on point and did\na great job, I did miss Edward Norton in the film but mark ruffalo\ndefinitely won me over and was very pleased with his work in this film.\nI recommend this movie to anyone looking for a action packed film full\nof drama and chaos! Robert Downey Jr. Is probably my favorite actor and\nif not he's very high on my list but the commitment and work put in\nfrom the entire crew of production and filming members is one for the\nbooks. I'm really looking toward to seeing a second part to this movie\nand I'm very confident when I say that I know it will be great! If you\nknow anything about any of these comic book heroes then I'm sure you\ndidn't need to see any movies such as the Iron Man trilogy, Thor,\nCaptain America, or the Hulk to understand this film... But having seen\nall of those leading up to the avengers is what made this movie\nincredible, the investment and work put in by everyone just amazes me.\nKeep up the good work marvel!\n"},
{"review": "\nWatched The Avengers Starring Chris Evans(Push) as Steve Rogers/Captain\nAmerica, Robert Downey(Sherlock Holmes) as Tony Stark/Iron Man, Chris\nHemsworth(Star Trek) as Thor, Mark Ruffalo(Shutter Island)as Bruce\nBanner/The Hulk, Scarlett Johansson (The Prestige) as Natasha\nRomanoff/Black Widow , Jeremy Renner(The Hurt Locker) as Clint Barton,\nThe Lovely Cobie Smulders(How I Met Your Mother) as Agent Hill ,Clark\nGregg(Iron Man)as Agent Phil Coulson , Tom Hiddleston(War Horse) as\nLoki and Samuel L. Jackson(Star Wars) as Nick Fury. one of the most\nmemorable films from the Opening Of The film and to the credits,The\nfilm is laced with high octane action,a bit comedy and some very\nintuitive drama. this is marvel best due to the fact that all the\nactors play up to there parts and no just one of them steals the show\nit is brilliant also amazing Direction from Joss Whedon(Serenity)\ncostume design from Alexandra Byrne(The Phantom Of The Opera) &amp; Amazing\nScore from Alan Silvestri(Back To The Future) this film has stood the\ntest of time even with films film will always be One the best from\nMarvel. 10/10\n"},
{"review": "\nWhen I watched Iron Man 2, Captain America: The first Avenger, Thor, I\nwished I could see them together in a single movie. But to me it seemed\nimpossible at that time until 2012 when I was marveled to see the\ntrailer of the Avengers. As I watched the movie, it was a dream come\ntrue. The reason it seemed impossible to me was that its hard to\naccommodate so many signature heroes in a single 2.5 hour movie, but\nMarvel did a really amazing job. First off all the movie is a sequel to\n4 or 6 movies (Hulk (2003) and Iron man if you want to add),and is\nprequel to 3+ movies plus a TV series. Second Marvel delivered very\nwell. Every hero was at first a sole hero but gradually they ended\nbeing a team. Every hero had his own story plus a part in the team. How\nthe team came together was also so heartwarming and how they helped\neach other. Every hero was greatly portrayed with great graphics, loads\nof action,comedy,thrill, and a great feast for comic fans and non-comic\nfans both.\n"},
{"review": "\nNow that I reviewed all of the movies that tied into The Avengers, I am\nnow going to review the movie. So now, lets get started.<br><br>S.H.I.E.L.D. attempted to control the Tesseract. However, the attempt\nbrings Loki to our world who takes the Tesseract. Loki wants to open up\na portal to lead an alien invasion known as the Chitauri. Director Nick\nFury brings Tony Stark/Iron Man, Dr. Bruce Banner/Hulk, Steve\nRogers/Captain America, Thor Odinson, as well as S.H.I.E.L.D. agents\nNatasha Romanoff/Black Widow and Cliff Barton/Hawkeye all together, in\norder to protect Earth from Loki and the Chitauri.<br><br>The story is very simple and clichéd, but I don't mind that at all,\nbecause I like these characters and I like seeing them talk to each\nother. The actors do great jobs portraying their characters and show\nchemistry. Robert Downey Jr., once again, does a perfect job playing\nTony Stark/Iron Man, who doesn't play well with others, but still\nrelates to them. Mark Ruffalo does a great job playing Bruce\nBanner/Hulk, who is calmer and now wants to help people. Chris Evans\ndoes a great job playing Steve Rogers/Captain America who is trying to\nadapt to the modern world after being frozen for 70 years. Chris\nHemsworth also does a great job playing Thor who is determined to bring\nLoki to justice. Scarlet Johansson does great job as Natasha\nRomanoff/Black Widow. Jeremy Renner is in the same category as Cliff\nBarton/Hawkeye. Tom Hiddleston easily steals the show as Loki.<br><br>The action sequences are really awesome to look at and the effects are\nreally impressive to look at, such as the city destruction at the end.<br><br>Overall, Marvel's The Avengers is one of the greatest superhero films\never made. It has everything that makes a great movie in general. Watch\nthis movie. I don't care how you watch it just do it.<br><br>MY GRADE: A (9.5/10)\n"},
{"review": "\nThe Avengers : As Thor's hammer smashes the ground causing huge ripples\nin the earth, The Avengers' smashing action blows your mind as it\nleaves a deep impact on you, way after the film is over. One of the\nmost awaited films of the year, The Avengers is everything you'd expect\nfrom a awesome superhero- get-together film. After Loki steals the\ninfinitely powerful Tesseract from Nick Fury, the director of\nS.H.I.E.L.D. puts together the group that he's had in the works for\nyears. Gathering Iron Man, The Hulk, Thor, Captain America, Hawkeye and\nBlack Widow, the team of \"The Avengers\" takes on Loki and his army to\nsave the world. The Avengers does not fall short of anything. Stunts,\nstory, performances, humour, just everything in the right proportion.\nHumour is in abundance but no way does it make the film spoof-like. You\nfeel for the characters, which makes the film a roller coaster ride you\ndon't want to miss out on! Do not compare it to The Dark Knight -\nNolan's Batman movies, there is nothing dark or twisted about The\nAvengers, it's a feel-good fun film.\n"},
{"review": "\nMarvel's Avengers Assemble was an absolutely fantastic film. It was\ngreat how they pulled all the different movies and their secrets and\nput them into the one film. Each actor played their part to their best\nand I was gripping my seat at every turn. There was a lot of emotions\nin the movie including humour, sadness and suspense; one minute you\nwould be crying and the next, laughing!<br><br>This is a great movie for the whole family but I would advise that you\nwatch the other superhero movies first, as it would be hard to follow\notherwise.<br><br>11 out of 10 from me, can't wait for Avengers 2!\n"},
{"review": "\nWhen I first watched this, I had never really been that into Marvel\nfilms so I didn't really know what was what. I hadn't previously\nwatched Iron man, Iron man 2, Thor or any hulk movie. So I do suggest\nwatching them first.<br><br>But when I did watch it, I was so totally mind blown by the pure\namazement in how awesome this film was that I became a right Marvel\nnerd...<br><br>Marvel's Avengers Assembel I one of the most amazing films I have ever\nseen in my life and would definitely suggest watching it. This movie\nmakes the most awesome gift and would make anyone smile.\n"},
{"review": "\nThe Phenomenal Avengers<br><br>Today I watched \"The Avengers\" for the first time. The movie itself, I\nbelieve was very well put together. Not knowing who each character is\nand not seeing each one of their movies to get their background. The\nmovie was well put together, that I understood what role each one\nplayed. With the original cast of each character are in this movie,\nexcept they did not use the original actor for the Hulk which is what I\nwas familiar with but the part was very well portrayed by Mark Raffalo\n. The Hulk character keeps the viewers on edge, wondering what or when\nwill he release the rage of The Hulk.<br><br>The movie starts with that main villain Loky, god of mischief, planning\none of his ultimate plans of taking over the world. The original actor,\nTom Hiddleston, from the movie \" Thor\" plays an amazing part both dark\nand evil. Capturing all the characteristics of a grand villain, comes\nto life in the amazing film and Hiddleston plays the part to\nperfection. Other characters in this film include the fantastic\nperformance of Chris Evans as Captain America. With his honor and loyal\ntraits this character is incredibly brought to the screens with a\nperfect actor that does its great justice. <br><br>All the characters in this film are portrayed wonderfully to bring this\nfantasy film to life. This movie also shows the truth of a community in\na tragedy. When all hope is lost in the movie each character mad at\neach other in regular life come together to get through the hard times\nand defeat the powerful Loki. This is film each actor feeds each other\nin this film that all the scenes connect perfectly and even if you have\nnot seen all the individual movies of all the characters one by one.\nThe film is still pretty easy to follow and to catch up on each one and\nthe part they play. All and all I would like to say that Joss Whedon\ndid an amazing job on creating each character and I hope there is more\nto come. Two thumbs up in my book\u0085.ART\n"},
{"review": "\nJust saw the movie, and i've gotta say it was pretty sweet.<br><br>Know the feeling when watching a regular 1½ hour movie, and halfway\nthrough you look at the time in the hopes it's almost over? This was\nreally nicely paced, your attention is on the screen the entire movie,\nand at no point during did i think about time. When the movie was over,\ni was like, did 2.20 hours just pass.<br><br>I didn't expect much humour in this, i knew Stark would be a smart-ass,\nso that was anticipated, but i did not expect The Hulk to be funny,\ntwice!<br><br>All in all, great movie, and a good start to The Avengers\ntrilogy/quadrilogy or whatever this is going to become.\n"},
{"review": "\nWhat can I say about the Avengers that everyone else hasn't already\nsaid? Well, believe the hype! it's great! why? well numerous reasons.\nOne of them is the director they chose for the job of bringing one of\nthe most iconic super teams in comics to life.Joss Whedon has showed\ntime and time again that he knows about both the Marvel Universe (see\nhis run on Astonishing X-men) and Team dynamics(See Firefly or any of\nhis other works)and he works his magic to the max here. another reason\nis the great cast. while all good, two performances really stand out to\nme. The first one is Mark Ruffalo as Bruce Banner/Hulk and the second\none is Tom Hiddleston as Loki. While I enjoyed Ed Norton's Banner, I\nfelt something was missing from him, Likability. Mark Ruffalo had\nLikability. Tom Hiddleston's Loki was a great villain that really had\nthat sinister aura about him and he's better here than he was in Thor.\nAnother Reason is the action. Not only does the final scene have An\nepic battle that rivals Robots trashing Chicago in Transformers 3 (This\nis way cooler) But other great action scenes come throughout the movie.\none of my favorites is the scene at the beginning where Loki steals the\nTesseract/Cosmic Cube and takes down a whole bunch of S.H.I.E.L.D\nagents including Nick Fury and Hawkeye. Also, The plot is fairly\nsimplistic but what really makes this movie shone is the character\ndynamics. So final verdict: possibly the best movie of the summer of\n2012. Assemble and go see it.\n"},
{"review": "\nI have been waiting for an Avengers movie for well over a decade and\nwhen I found out that it was even in the pipeline I was beside myself\nwith excitement. I went to see the movie with somewhat high\nexpectations due to the cast involved and the previous Marvel movies\nbuilding up to this title. I have to say that it completely surpassed\nmy expectations and I was amazed throughout the entire movie. <br><br>I attended the screening in 3D and I honestly have no idea why people\nhad anything bad to say about the 3D in this movie as it was quite\nbrilliant. <br><br>For me, the underrated characters in the movie are Black Widow and\nHawkeye. I felt that these characters were portrayed perfectly by\nScarlett Johansson and Jeremy Renner. I also felt that we have finally\nfound a perfect actor in Mark Ruffalo to play The Hulk. The two actors\nthat have recently played Bruce Banner/The Hulk have been pretty good\nbut both seemed to be lacking in something but I could never put my\nfinger on it. I thoroughly enjoyed seeing Mark Ruffalo as Bruce Banner\nand The Hulk.<br><br>Overall this movie is filled with all the required thrills and spills\nand is a first class action movie. It also has a great mixture of\ncomedic value and a deal of seriousness. <br><br>I can see exactly why there has been a massive explosion of potential\nMarvel movies in the pipeline and I cannot wait to see what the sequel\ncould bring. I feel that Hawkeye and Black Widow could definitely have\ntheir own movies if not a movie where they are working together. I also\nhope that the people at Marvel and Disney have identified Mark\nRuffalo's great ability to play Bruce Banner/The Hulk in such a great\nway and maybe look into rebooting the entire franchise.<br><br>I would highly recommend this movie across all age ranges as there is\nsomething for everyone. I also cannot wait for this movie to come out\non blu-ray.\n"},
{"review": "\nI went into this movie with high expectations being a comic junkie and\nwas not let down. Although it has some major plot holes ( Thors\narrival, Hulk finding his way to the battle, selvick building a safety\nin the portal, etc.) and not the most original plot it still manages to\ncompletely satisfy me. When I go into a movie, I use six main things\nfor rating a movie....... 1.Is it engaging from the start? 2. Are the\ncharacters interesting? 3. Is the acting good. 4. Are the effects\nquality? 5. Is the plot good? 6. How much would I want to watch it\nagain?<br><br>The constant action through the film manages to keep you entertained\nand the good actors and special effects make this movie easy to watch.\nThroughout the movie there is this sense that no (major) character will\ndie, and it brilliantly replaces the feeling that they will all live\nhappily ever after with a fun sense of comedy and a spring in its step.\nThis movie is by no means perfect, but it effectively manages to keep\nyou on your toes and makes you want to watch it again and again. I may\nhave some bias based on my love of superheroes, but I definitely\nrecommend this movie.\n"},
{"review": "\nI am a big fan of science fiction. I have not been such a big fan of\nall movies based on comic books. I am not such a big fan of sequels\neither. The Avengers was a must-see-film for me, for several reasons,\nbut most of all, I enjoyed both Iron Men, Captain America, and a bit of\nThor as well. Hulk did not do the trick to me.<br><br>The Avengers brings all these superheroes together. Their opponent is\nThor's evil half-brother, Loki. His main goal is to get a magical\nstone, or cube, that would open the gateway to another dimension, to\nAsgard, where other, even more evil forces await to be released, and\nfreed to the world of the humans.<br><br>The action in the film, along with the SFX, is great. However, the\nstoryline is not something you have not seen or heard before. Actually,\nthere is very little new to the film. Also the decision to get all the\nsuperheroes or stars together, does not really differ much from\nExpendables, which is somewhat huge phenomenon, even though the script\ncould be written by a 12-year-old.<br><br>The Avengers is a lot better than Expendables, but that does not mean,\nit is a whole lot better, and that it would be better than, lets say\nIron Man. For me Iron Man alone stands above The Avengers. The film\ndoes not come better with bigger explosions, and a lot more heroes,\nthan in the original film. But obviously, with fans of the 80's stars\nin Expendables, it is enough to bring them all on the screen at once.<br><br>What I truly enjoyed in this film was actually a few parts of the\naction. The one with Thor dropping out from the sky, or the parts in\nthe end, with the heroes pretty much destroying most of the city-site.<br><br>All in all, it is certainly a-must-see for the fans of comic stars,\nscience fiction, and action. I enjoyed, but not that much, that I would\nrecommend it to everybody.\n"},
{"review": "\nI can't really say anything that anyone else hasn't said about this\nfilm. Go out and watch it and you'll love it. Best film of the year so\nfar. That's all I really have to say about this movie. <br><br>Basic Details to mention would be that the CGI is pretty good but can\nstill stick out a bit easily. Another thing to mention is that it can\nbe a little long for people under the age of 13. Also I don't care how\nold your kid is or how much they would want to see this film. Do not\ntake them to it or rent it (when it's released on DVD and Blu-ray)\nuntil they're thirteen. I've seen enough people take them to this movie\nignoring the ratings and then getting p*ss*d off that their child is\nonly 8 1/2 years old.\n"},
{"review": "\nOne simple word AMAZING. everything from past MARVEL movies since Iron\nMan have led up to this great crossover movie with great heroes such as\nIron Man, Thor, Captain America, Hulk and others. The story is epic,\nsuspenseful and fun. The action sequences are thrilling and well done\nwith great cg integrated with live action. The characters are great\nabound with great acting from great actors like Robert Downey, Chris\nEvans, Scarlett Johanson, and Samuel Jackson. What else can you expect\nfrom great writer/director Joss Whedon creator of Buffy and Angel. Even\nif you are not a fan of comic books, go see this movie as a excellent\nway to kick off summer vacation. 10 out of 10 stars\n"},
{"review": "\nAmazing! I am completely and utterly obsessed with this film1 It is\nbrilliant! I feel the ratio of humour/action is perfect! I love that it\nhas a good number of jokes because I can't normally stand too much\naction, action, action I need that humour to break it down a bit. This\nis it! Of course it also has the eye candy a gal needs - well for me\nanyhow! - Loki! He's just perfection in every single way. Tom\nHiddleston is my favourite British actor. Since I discovered him in\nThor I have been hooked and checking out all his other movies. He was\nfantastic as Loki! I sure hope he's in the sequel!<br><br>I've watched this film 4 times in my local cinema. For me it never gets\nboring! Can't wait for it to come out on DVD because I will definitely\nbuy it! I just love everything about this film!\n"},
{"review": "\nI was sceptical going into the theatre....However, after two plus hours\nof crash, bang &amp; wallop! I thought I got my money's worth and then\nsome!!<br><br>The main protagonists all deliver top-notch performances....and the\nflick is filled with great comic moments....<br><br>For me, the stand-out performance in the movie was delivered by the\nHulk!....The special effects &amp; 3D were spot-on and the full repertoire\nof the Hulk's destructive power were encapsulated in some great action\nsequences (the battle with Thor, throwing Loki around like a rag-doll\nand the one-punch of the alien being notable highlights of the film)..<br><br>My only criticism would be of the one-dimensional aliens....I think\nwe've already seen enough giant bugs in plenty a movie!!<br><br>It is not on a par with a Chris Nolan 'Batman' movie, nor, was it as\nintelligently crafted as the Watchmen Movie....Also, the storyline was\nfairly predictable from the off-set...<br><br>The only recent comic ensemble that can challenge this movie (imo) was\nthe latest X-Men prequel....<br><br>Well Done Joss Whedon, and the rest of the Avengers team, I hope he can\nimprove on this initial Avengers movie with an even better sequel.... <br><br>In a nutshell...the Avengers Assemble delivers crash, bang and wallop\nin huge extremely satisfying doses!!\n"},
{"review": "\nThe Avengers was very well waited among Marvel comic book fans and\ngeneral superhero fans. When it comes to delving deeply into the minds\nor motivations of the film's other, previously established heroes, he\nabstains all together. And maybe that's for the best. Even with 2 hours\nand 24 minutes to kill, there's precious little time for him to offer\nremedial courses in Marvel mythology. Those who haven't done their\nhomework and watched the previous films still should be able to follow\nthe basics, but they almost certainly will be left scratching their\nheads from time to time. <br><br>In the mix among stars doing battle are Scarlett Johansson, who plays\nthe Black Widow, and Jeremy Renner as archery expert Hawkeye. There\nwere a lot of high expectations for this film and on many levels it\ndelivers, while on few others it disappoints. Since writer-director\nJoss Whedon was dealing with so many big-name stars, like Robert Downey\nJr., who reprises his role as Iron Man, Gwenyth Paltrow as Pepper Potts\nand Mark Ruffalo, who takes over the role of Dr. Bruce Banner a.k.a.\nthe Hulk, there's just not enough screen time to fit everyone\nadequately in.<br><br>For those who have kept up with it, though, The Avengers is a nice\npayoff to a sprawling and ambitious filmmaking strategy, and one whose\nblueprint can be counted on to change the way major studios approach\ntheir superhero franchises for years to come.\n"},
{"review": "\nAll I can say is that I am very unimpressed with this film.<br><br>The action is not too satisfying and very predictable, the acting is\npassable, the dialogue is at a strict minimum and the story is pretty\nmuch non-existent. In short, it's a whole bunch of CGI and explosions\nput together. Similar to Michael Bay's Transformers movies. The only\nstrong point of this movie is the cast, but in my opinion this goes to\nwaste because none of them are really given any interesting\nmaterial/context to work with.<br><br>I suggest you avoid it unless you're a die-hard comic fan or if you\nreally want to see Chris Evans, Chris Hemsworth and RDJ together on\nscreen and fantasize about them.\n"},
{"review": "\nThe Avengers was the first movie I saw in theaters three times, and for\ndarn good reason. It sets the bar so high for comic book movies. DC is\n(was) seriously in a lot of trouble after The Avengers came out. If you\nhave seen each of our hero's individual films, you will easily enjoy\nThe Avengers ten times more. You will be also ten times more excited to\nsee everything played out. <br><br>I also feel like I need to say that I was very, very nervous when I\nheard The Avengers was announced. In film, we like to focus on one\ncharacter, and we like to see that one person change over the course of\nthe movie. It's hard to keep track of multiple characters, which is why\nthe single-hero format works so well. Otherwise we end up with meathead\ncity, like The Expendables. Gross. Luckily, we have The Avengers\ninstead.<br><br>So our unlikely heroes team up together to defeat Thor's brother, Loki.\nLuckily, all of these overpowered world savers are used to having each\nother as company, PSYCHNOTREALLY. They all have pretty big egos, let's\nbe honest, but we don't see just how big their egos are until they all\nshare one movie together. Jump ahead, they have to learn how to cope\nwith one another, and just barely tolerate each other in order to stop\nthe world-destroying threat.<br><br>There is some absolutely wonderful cinematography, put together by\nSeamus McGarvey. Did I mention how clever the script is? Joss Whedon\npoured his fricking essence into the pages of writing, and it pays off\nso very nicely. I don't feel like The Avengers was missing anything\nthat ticked me off. I also have never been so excited for a sequel\nbefore in my life. My only hope is that Disney can buy out Spiderman\nfrom Fox, and we can get some Spiderman action in there\u0085 But I digress.<br><br>The Avengers flat out rocked my socks off. 9/10.\n"},
{"review": "\nI was drawn into watching this movie by the promising graphics more\nthan anything else. I'm not a comic book aficionado in the least, so I\nwent into the movie without any of that background knowledge. Nor did I\nneed it, as I soon found out. There's enough back story inserted to get\nfolks through &amp; the back story of the characters isn't really integral\nto the story, I thought.<br><br>The plot was VERY predictable. There was nothing new or original about\nit. Can easily see where the story is heading and pretty easy to guess\nhow it will end. So, in that regard, I'd give the movie a 1 out of 10.<br><br>Where this film shines -- and is downright amazing -- are the majority\nof the graphics. Fantastically intricate CGI work! From that aspect,\nI'd give the movie a 9 out of 10.<br><br>So, basically, this is a great one if you're looking for mindless\nentertainment as the story line isn't a challenge to follow. Definitely\na feast for the eyes!\n"},
{"review": "\nIt's one of the few movies that worths a Ten star ********** a perfect\n10+ or an A+, i can feel the actor.s feeling and interaction, very well\nrealized and a flawless subject, simply splendid ! Things are getting\nvery well with the Hollywood movies with this part, the action part,\nlike Battleship, Wrath of the titans, Clash of the titans etc. Some\nthings which I don't agree is the soap movies and the blondes, yes the\nblondes, i hate blondes, they should be natural blond at least. The\nhorror movies sux, too much violence and child implication. Anyways, I\nadore this movie and I can watch it over and over again, that's what\nthey say that a good movie you watch it over and over again.\n"},
{"review": "\nI've always watched Marvel films but I've never been the greatest fan\nof them. I find them entertaining but they are often similar and rarely\ndeliver quite such the memorable and action-packed experience that\n'Avengers Assemble' offers. Seriously, whether you are a Marvel fan or\nnot, give this film a chance, it may very well surprise you.<br><br>I can't think of any particularly large faults to this movie that are\nworth mentioning, the plot isn't exactly unique but that's not what I\nsaw as the purpose of the film. The film's plot tied together the\nprevious Marvel films featuring heroes such as Iron Man and Captain\nAmerica very well, it then went on to set up and deliver a roller\ncoaster ride of sci-fi action unlike anything I've ever seen before in\na Marvel film.<br><br>'Avengers Assemble' certainly beats the previous films in terms of CGI,\naction, characters and memorability. From the opinions of friends, I\nknow that the film has even appealed to those that aren't directly a\nfan of sci-fi action. There is certainly something about the film that\nsimply stuns the viewer and impresses them with up-to-date visuals and\na fast-paced storyline. <br><br>A fact worth mentioning is that, unlike previous films, 'Avengers\nAssemble' doesn't take itself too seriously. It's not a comedy, or a\nparody, but it does allow for humorous moments that actually made me\nsmile more than some actual comedies have. This allows you to enjoy the\nfilm further I feel, rather than taking away the more serious elements.<br><br>If you haven't seen the film already, make sure to find the time to\nwatch it, it will entertain you in some way or another and is\ndefinitely worth at least one viewing. Truly one of the better movies\nof the past decade.\n"},
{"review": "\nThe Avengers was a fantastic movie. Yes its been out for a while and I\nsaw it a while ago. But if you have not yet seen it i definitely\nrecommend that you do. The movie's dialogue was fantastic and often\nhilarious (In a good way). The special effects were also great and fit\nthe film well. Personally though what I loved most about the film was\nseeing the Avengers learn to work together as a team. In the beginning\nthere was fighting between them as different people they wanted to do\nthings differently. Near the end when the big battle ensues, you really\nsee them start to care for each other. That care also translates to you\nas you will also start to care for these characters as the film goes\nalong. I loved the movie and I think it's very much worth a watch if\nyou have not already.\n"},
{"review": "\nSo much build up and it all leads to this: And it's awesome! I know I'm\nlate in reviewing this and everything has been said in all kinds of\npraise and this movie deserves it. Just see it. Even if you don't like\ncomic book movies: See it. <br><br>What I find amusing is that Ironman was never really the top billing of\nThe Avengers. It was always Captain America... until now. Robert Downey\nJr. steals every scene that his name is first on the credits.\nSeriously, he's that awesome. I was also surprised with Mark Ruffalo's\nperformance as The Hulk. He was great! His scenes with Robert Downey\nJr. are some of the most memorable. I also haven't seen the Thor flick\nbut the guy who played them was really good and really seemed into\ncharacter. Hawkeye was cool and Scarlett Johanssen is hot. <br><br>Okay, the plot? Bad guy named Loki wants to take over the world and\ndoes a really good General Zod impression (Kneel before me!) and\nAvengers try to stop him. What's funny is that he looks tough in the\nbeginning but then turns into a rag doll at the end. Just ask The Hulk.\nAnd whatever injustice the previous movies had done to The Hulk\ncertainly makes up for it here.<br><br>Just see it! It's a lot of fun and it's what summer movies are supposed\nto be. It's a great beginning to summer movies. I'm glad I went!\n"},
{"review": "\nMost fun I've had in a long, long time. Yes, FUN. Although this movie\nwas just about 2 1/2 hours long, it was so entertaining and engrossing\nfor me that it seemed like about 1 1/2 hours. The character development\nwas good and each character was given a bit of screen time to develop\nthe character. The action was good and not overpowering, it only added\nto rather than being the main part of the movie. The comic level was\nperfect. Not too much goofy stuff said just to try and get laughs.\nEvery line, imo, was perfectly placed (although I'll have to see it\nagain in order to hear some funny lines that I missed due to the\nlaughter in the theater!). By the way, morning matinée was SOLD OUT\nfull. Each character was \"in character\" as we know them...Captain\nAmerica was still the 40's guy; Iron Man was still, well, Iron Man,\nThor...perfect, the Hulk - super good, best depiction I've seen, etc. I\nthoroughly enjoyed this movie because it fulfilled all my \"likes\" for a\nmovie...good vs. evil and good kicking butt; enjoyable fun time and\nescape, good dialog, good looking and PG. I've seen enough violence and\nsex and love the break for some simple ol' good times.\n"},
{"review": "\nUninspired high gloss kiddie comic adaption with acceptable visual\neffects and a screenplay that fits on one sheet of toilet paper...<br><br>It is almost incredible how this Movie could be so highly rated. Must\nbe indebted by the target group which exists from nerd comic-fans and\nteenagers without an clue what makes a good movie...<br><br>The characters are flat and as a result none of the (normaly good)\nactors is capable of convincing.<br><br>What's left is the typical action-loaded special effects spectacle. But\neven in this category nothing is extraordinary or surprising.<br><br>Let's hope, that someone saves us from a sequel, is hard to underbid\nthat...\n"},
{"review": "\nHow can this film be rated 8+. IMHO it was absolutely average. Apart\nfrom Robert Downey's sarcastic/acerbic humour the film's remaining\ncharacters were hampered by a poor plot line and an\ninconsistent/juvenile comic book narrative that's holed below the water\nline by contradictions. Marvel need to look to writers like Garth Ennis\nto see how comics should be done.<br><br>Costumes were embarrassingly bad; Loki's plastic horns and staff,\nCaptain America's camp tights and Thor's spandex.<br><br>Has the IMDb score been artificially inflated, is it a case of the\nEmperor's new clothes, or is it Marvel fan-boys? I don't know, but it\nain't worth more than 5 or 6 on the IMDb Richter scale.\n"},
{"review": "\nI know a lot of critics and fans loved this movie, but unfortunately,\nthis movie just didn't do anything for me. My first biggest problem\nwith this movie: Mark Ruffalo was HORRIBLE as Bruce Banner! It was like\nhe was sleepwalking through the entire movie! Marvel fired Edward\nNorton, and the best replacement they could find was this guy? Did they\njust pick his name out of a hat? Come on! My second biggest problem\nwith this movie: Captain America gets pushed to the side, and most of\nthe focus is on Iron Man. Why?! Here's a crazy idea: Seeing as how\nCaptain America is the LEADER of the Avengers! Why not give him the\nspotlight? Furthermore, Iron Man and Captain America hardly ever get\nalong in this movie. This wasn't at ALL like it was in the comics! In\nthe comics, Tony Stark deeply admired and respected Steve Rogers. In\nFact, Tony Stark's father, Howard helped create the \"Captain America\"\nprogram. My third biggest problem with this movie: It takes FOREVER for\nthe The Avengers to come together and work as a team. Throughout the\nmovie, all they do is fight most of the time, and occasionally throw in\na corny joke. Can someone please tell me what purpose that serves,\nother than to look cool? If you like generic, run of the mill,\nsuperhero movies, then give this a watch. However, don't expect this\nmovie to be deep and meaningful, because you will be sorely\ndisappointed.\n"},
{"review": "\nWhen I first saw the trailer for this movie I thought it looked pretty\ncool, and when the review started coming in I immediately got excited. <br><br>When I finally got to see the movie I realized after the first 20\nminutes that this wasn't the movie I was hoping for. Now let me explain\nwhy.<br><br>I can start off with the script. The script is not good, by adding some\nover-dramatic, cheesy and boring dialogue doesn't make a movie good.\nBut the script isn't terrible, some of the cheesy comments fits with\nthe dialogue and makes you laugh a little. <br><br>But the one thing that is directly terrible with this movie is the\nstory. For those of you who don't know the story, it goes like this;\nThor's evil brother Loki has come to the earth to claim it as his, and\nthen he gets a thing called the Tesseract, and afters that he opens a\nportal so his alien army can enter the earth to take control over it.\nBut then Nick Fury brings together the superhero team called ''The\nAvengers'' to stop him. I don't think it's necessary for me to start\nexplaining why the story is so terrible, most people should understand\nwhy. <br><br>And I know a lot of people have claimed that the film don't need a good\nscript or story because it's so entertaining. Well, I don't agree. The\nfirst 1 and a half hours of the movie is really boring, and I actually\nconsidered leaving the cinema, but then the movie catch up with some\nreally cool and visually stunning scenes. <br><br>Some things in this movie was good, like most of the acting, the CGI\nand some of the dialogue. But overall this is just an average popcorn\nmovie with a superhero flick.\n"},
{"review": "\n...but I didn't.<br><br>Maybe I'm getting too old (33), maybe I expected too much, maybe just\nmaybe, this movie was actually rubbish?<br><br>I feel bad, I really do. Who am I to hate this mega franchise? I\nthought iron man, hulk and Thor were great. Captain America not so\ngreat but nevermind. I took my wife to watch it and she hates these\nkind of flicks. We were about half way through and I asked her \"Do you\nwant to stay or shall we go?\". I cannot remember a time when I have\never asked her such a question, not even for crappy flick. At the end I\nasked her what she thought? she loved it! I was bemused - I actually\ngot bored. Now don't get me wrong, I love movies. Back to the future,\nBrewsters Millions, Shawshank Redemption and Goodfellas are amongst my\nfaves. But this just left me underwhelmed. So I ask the question\nagain... Am I getting old or have I missed something?\n"},
{"review": "\nLuckily I saw this movie before I saw the rating on IMDb, or any other\nrating or review, as a matter of fact. Actually we were not planning to\nsee this movie, but it was the best choice out of other average titles.<br><br>Honestly I would give this movie a 6.5 on a scale of 10. The action is\nsolid, but the story is not nothing to write home about.<br><br>Basically it is your bad guy steals super-weapon, superhero(s) come\ntogether to fight bad guy and with some ups and downs there is the\nexpected grand finale with lots of action story.<br><br>The big problem is that there are a lot of characters in there so not\neveryone gets enough screen time. Personally I would have liked that\nScarlett Johansson's character would have gotten more story.<br><br>The rating at IMDb is thus inflated and should not be taken seriously.\nIt is not though that I didn't enjoy the movie but for example, The\nDark Knight is much better than this.\n"},
{"review": "\nMy fiancé and I have seen this awesome flick twice. I am also putting\nit on my holiday wish list this year so that I can add it to my DVD\ncollection. That is how geeked out I am for this movie. The cast was\nmemorable. Robert Downey Junior was born to play Tony Stark. Mark\nRuffalo excelled as Bruce Banner and even resembled the comic book\nBanner. Scarlet Johansen and Chris Hemsworth made for tasty eye candy\nas Black Widow and Thor respectively. Samuel L. Jackson wows as Nick\nFury. The story was well told by writer/director Joss Whedon. There is\nplenty of humor and action. There is also some tragedy as well in the\nform of the death of S.H.E.I.L.D agent Phil Coulson,played excellently\nby Clark Gregg, at the hands of the villain Loki played chillingly by\nTom Hiddleston. If you have not yet seen this movie run to your local\nmovie theater and see it. If you have seen it already see it again.\n"},
{"review": "\nWhat an utter disappointment. Expected so much more substance from Joss\nWhedon. With so many great characters w/ great stories, you'd think the\nwriters could have put together a good story. But no--that's not what\nobscenely budgeted films with the sole purpose of setting up a\nfranchise care most about. Everyone's already pointed out all the\nridiculous plot problems, so I'll just say that the writers had NO\nexcuse when there's an entire comic series worth of stories to supply\nall they needed to work things out. A waste of some decent actors and\nlots and lots of money. (Pretty clear that the only moment Samuel\nJackson actually enjoyed was when he got to walk out and blow up one of\nthe jets. He looked bored or in pain for every other mediocre line.) I\nenjoyed most of the witty one-liners...and that's about it. <br><br>Shallow on so many levels...who cares how shiny the CG was or how many\nthings got blown up? The studio may have raked in disgusting amounts of\ncash based on the hype (and the promise of a great story), but will\nanything else about this film be memorable? Can't see how Stan Lee\nwould have been pleased...\n"},
{"review": "\nSince that final clip with Nick Fury and Tony Stark in Iron Man, there\nwas hope that maybe Marvel could really be doing an Avengers movie. 4\nyears later and 4 movies later (Iron Man 2, Hulk, Thor, Captain\nAmerica) and we have Joss Wheddon's Avengers. <br><br>What makes The Avengers so Engaging and Intriguing is the dialogue\nbetween the superheroes. Joss Wheddon should be awarded with an Oscar\nfor the writing and directing of The Avengers. Everyone blended in so\nnaturally and their back and fourth banter made for some good comedy.\nEveryone felt equal from Hawkeye to Hulk. It is so difficult to balance\nthese personalities on screen and I don't think any other director\nbesides Joss would've been able to pull it off the way he did.<br><br>The Action scenes in the Avengers is as Epic as it gets. The last hour\nis like a marathon of awesomeness. Every action sequence in this movie\nwas perfectly executed and each character had their significant\nmoments. <br><br>The cast was phenomenal as usual, but the show-stealer is definitely\nMark Ruffalo. His portrayal of the incredible hulk was spot on. He was\nwildly entertaining and I couldn't help but cheer him on when he\nsmashed sh!t. I think what made the Hulk work was because he was used\nsparingly.<br><br>Lo-Ki as the villain was great. I felt he was developed a lot better\nhere than in Thor. He was witty and had an evil aura about him\nespecially when he was interacting with the \"mortals\".<br><br>Never have I enjoyed a movie so much as the Avengers. The 2 hour plus\nruntime flew by easily and I was left wanting more once it ended. Once\nin a while a masterpiece of a film comes along, and after the hilarious\nclosing scene after the credits, it was clear that this was Marvel's\nMasterpiece. Back to the Future and Terminator 2 have always been my\ngo- to favourite movies. After this gem, I believe I can the Avengers\nto that list. <br><br>10/10\n"},
{"review": "\nI've seen Thor, Captain America, and most of the super hero movies.\n(Have you noticed, most of the good ones are about Marvel characters?)\nMost of them are acceptable, some not so much, some more so. This one\nblows all the other hero movies out of the water. It's a perfect blend\nof hero, character development, and teamwork.<br><br>Of course, there had to be the usual squabbling between heroes. But\nthis one did it so well! As soon as this comes out on DVD, I intend to\nown it! You don't get to see a movie this good very often anymore.<br><br>The Hulk was done so much better than than any of the movies. I've made\nit a point not to own any Hulk's. This one showed him in all his glory,\nand unpredictability. <br><br>Thor was watchable, Iron Man more so, Captain America rather boring\nuntil the last half hour, but this one went where they failed.\n"},
{"review": "\nWhen I stood in the long line up, nearly out the door, to buy my ticket\nto see the avengers. I was hoping to be blown away with the action\npacked story line the trailers promised. <br><br>I was nothing short of blown away as the movie progressed! From the\nmain story line/plot, to the underlying story and other messages that\nthe I saw from the story. The plot, from beginning to end, was\nimportant all the way through and must not be missed for the viewer to\nexperience all this movie has to offer.<br><br>I hope that any other future movie viewers find this movie just as\nappealing as I did! I highly recommend this movie for anyone looking\nfor a n action film that is appropriate for children and can still\namuse adults at the same time!\n"},
{"review": "\nI went to see this movie opening day with my uncle, brother, and\nfather. I thought I was just going to leave with the expression \"It was\njust a movie.\" Boy, I was wrong! I left the theater with the biggest\nsmile on my face. The characters, the action, and the special effects\nare what made The Avengers put a smile on my face.<br><br>I have to say my favorite characters were Black Widow, and Hawkeye.\nCaptain America, and Thor came in second, and the Hulk, Iron Man, and\nLoki came in last.<br><br>I'm not going to spoil it. Just see the movie. It'll be worth your\ntime, and money<br><br>10/10\n"},
{"review": "\nWell, to put this incredibly simple, it is THE movie of 2012! Also, it\nis probably the best adventure movie I have seen in a long, long time. <br><br>With superb acting, intense battle scenes, and a surprisingly enjoyable\nstory line and script, this movie differs from many others in the movie\nindustry today. One of the highlights for me was the incredible acting\nof Robert Downey Jr., Chris Evans, and Scarlett Johansson to say the\nleast. To give you a taste of the funny lines, here is a line from\nCaptain America's quarrel with Iron man: Captain America: You are super\nwith that suit on, but take that away and <br><br>what are you? Iron Man: A genius billionaire playboy... <br><br>So as you can see, this is an absolutely amazing movie that i recommend\neveryone to go and see!\n"},
{"review": "\nFinally, Joss Whedon gets the recognition he deserves...<br><br>After creating some of the most compelling, intelligent and\nentertaining TV shows of all time - Buffy, Angel, Firefly, Dollhouse -\nhe brings the same mastery of writing ensemble casts to the big screen,\nand people see what he is capable of.<br><br>Just give the guy a blank cheque, and let him write all the sci-fi and\nfantasy he wants.<br><br>Far from being immature entertainment, his previous masterpieces all\nrespected the intelligence of the audience, and contained characters\nthat were so likable and charismatic, that it was impossible not to\ntune in each week.<br><br>Here, he does what he did in Buffy, Angel and Firefly, but he does it\nwith a massive budget, and some of the most famous superheroes in the\nworld. Who else could have written and directed a film starring Iron\nMan, Thor, The Hulk and Captain America, but doing them all justice?\nNot only that but also doing justice to Nick Fury, Hawkeye and Black\nWidow. His trademark aptitude for writing strong female protagonists\nreally came through with Black Widow.<br><br>Go see it - then watch all of Buffy, Angel and Firefly.\n"},
{"review": "\nThe Avengers is simply a superb movie in every way that matters. Forget\ncomparing it to other films of the genre. I'll save that for a later\ndate because it really isn't important. Judging it as a stand alone\npiece of entertainment, it's the best time I've had in theaters in a\nvery long time. First off, forget what you think you know or expect\nbecause it operates at a higher level then anyone would have guessed.\nThere is very little clichéd about the film. They establish their own\nuniverse by themselves but it is so aided by all the previous solo lead\nin films. If you've seen them all, you're in for a real treat with\nAvengers. If you haven't, you'll enjoy them MORE now watching them\nafter Avengers. They fearlessly take the adventure wire to wire but\nmanage to make you really care about every circumstance, character and\nscene. Every character is believable given the nature of the universe\nthey establish. You really are drawn in to the world and to the each\nand every character right from the first act. That connection makes the\naction more meaningful, just like with the best of movies regardless of\ngenre. The dialog has been called superb by fans and critics alike for\na reason. The conflict and tension present between EVERYONE\n(protagonist, antagonist, friend, and foe) absolutely makes the film.\nThe performances that stem off of that are all remarkable. The charisma\nthis film packs, and there's plenty of it, comes from the flawless\nperformances and the dialog. Also, the supporting cast is utilized\nperfectly. This is as good and as fun of a film that has ever been\nmade. Bold statement, I know. I rarely rely on critics but when nine\nout of ten of them praise this film they are doing so for a reason. It\nmakes you wonder what those few others saw or how much they were paid\nnot to like an instant classic.\n"},
{"review": "\nOne thing that I do not understand is how people could hate on this\nwonderous mash-up in film history. First time it has ever been done on\na comic-book scale like this. The story has a working heart, tons of\naction and a sense of humor all around a basic-comic book story (which\nsome people tend to rebuke). However with the basic plot, it preserves\nthe film's sanity, for with a complex and darker plot, the film would\ncontain that of a messy fashion. Hands down, one of the greatest movies\nI have ever seen, being a DC fanatic and a comic-book reader, I\nacknowledge the greatness that sparks out of this film. Don't listen to\nwhat some mistaken others say, watch this amazing movie and watch it at\nthe proper guidelines expecting a simple, action-packed cinematic\nMARVEL. The main villain Loki provides some of the best villainy I've\nseen following Heath Ledger as Joker.\n"},
{"review": "\nThe best superhero movie ever. Its entertaining, fresh, humorous and\nclever. All the superheros who appear in the film are fantastic, they\nare all included in the film equally so you don't really get the sense\nof a main character which is good.<br><br>Captain America was awesome, he takes leadership of the team during the\nend fight scene which is really cool, we see him really kick some ass\nin this film but I felt his costume looked a little rubbish compared to\nhis original costume in 'Captain America'.<br><br>Thor didn't fail to impress, his costume was awesome but would of liked\nto of seen him wear his helmet in both the avengers and his own film\nlike he does in the comics. His fight scene with Hulk was crazy, so\ngood!!! Iron Man was awesome, he provided witty sarcasm that lightened\nthe mood, he had some incredible action scenes and the special effects\nof his costume attaching itself to him in mid air was incredible.<br><br>I didn't think after watching the film that the Hulk would be my\nfavorite character but he was, the film really changed when the Hulk\nwas unleashed, he was destructive and powerful and was a force to be\nreckoned with in the film. The fight scene between him and Loki was\nhilarious! (well if you call it fighting, it was more like hulk playing\nwith a toy) Black Widow was wicked, had some bad ass fighting moves\nwhich contributed to the film massively. And she was super hot! And had\nsome kick ass fight scenes.<br><br>I didn't really think the movie needed Hawkeye but I was wrong, he was\na really cool addition to the film and featured in the storyline\nmassively and had some awesome action scenes at the end. I didn't think\nthere was ever going to be a superhero movie which rivaled that of 'The\nDark Knight' but there is and its called 'Avengers Assemble'!!!!!\n"},
{"review": "\nAvengers Assemble. As a 21 year old Marvel fan/Comic fan i've been\nlooking forward to this movie since the announcement of its production,\nand i'm happy to report that my excitement wasn't in vain. I've always\nsaid that an epic movie must make you want to immediately see it again,\nand the Avengers has done just that.<br><br>One of the many things that i loved about this movie was that it is\nobvious that the production team has taken time to research Avenger\ncomics and cartoons. I have seen many criticisms made by the general\npublic of a certain character (Hulk) and about how he is different from\nthe last two films. What these people don't realise is that the way the\nHulk is portrayed in the Avengers is the way he was created by Stan Lee\n&amp; CO, if anything the Hulk is proof of the hard work and dedication\nthat the production team has put in to making this movie.<br><br>I could go on and on about the film, but i'm not. I just recommend\neveryone to see it in cinema. Perferably in 2D as 3D suck (in my\nopinion)! Avengers Assemble is the best film i've ever seen. . . so\nfar. Stay tuned for Dark Knight Rises!\n"},
{"review": "\nI went into this movie with very high expectations cause I watched all\nthe trailers about 30 times each. I will say from the very first 10\nminutes of the films I was instantly blown away by the action and the\ncourse of the story. All the characters in this film get an equal\namount of screen time, which is usually the problem in a film where you\ndeal with multiple characters such as in this film. I applaud Joss\nWhedon for making this Marvel Masterpiece, the way everything fits\ntogether in this film is truly amazing and its close to impossible to\nfind any holes in the story. Mr Whedon was the perfect person to have\ndealt with telling this story as he's a comic book fan, he nailed it\n100%. I believe i'm going to see this film again tomorrow, it is just\nthat awesome. Hulk will give you a fun time in this film, watch out!\n"},
{"review": "\nI didn't sleep the day before I went to see avengers...i was so\nexcited...before it started..i said to myself, it better be worth\nit..and it was more.. the avengers is not justa perfect movie, its a\nmasterpiece...i can't believe a action movie can be so funny,\nthroughout the movie there was a smile on my face .Brilliant\ncharacterization, screenplay, acting and action.this is a revolutionary\nmovie as it has raised the bar for upcoming action flicks.take out all\nthe action and its still worth watching.i can guarantee one thing that\nthis movie will expand the fan base of hulk..he is much more believable\nthan the previous ones and no character is prefect...the one amusing\nthought for me was that how can petty humans like hawk eye and black\nwidow can contribute in the arsenal of superheroes..buy I was wrong\nthis is a must see movie for all ages, go see out tonight..\n"}
]