[
{"review": "\nI rarely do this because there is so much rubbish out there but I'm\ngoing to recommend a movie. Writer Director Alex Garland has done an\namazing job, it's beautifully shot, fantastically lit, intelligently\nwritten, brilliantly cast. the edit is original and brave, as is the\ndirection of the edit, There is nothing superfluous, to the contrary\nit' has a sharp Zen like quality, clearly the application of a\ndisciplined mind.<br><br>The movie is's self is engaging, thoroughly watchable, the characters\nare simple and yet layered with complexity. The film strikes the\nperfect balance of not spoon feeding and not dumbing down but not being\ntoo arty or intellectual just for the sake of it. <br><br>Best seen in a cinema I reckon.\n"},
{"review": "\nEx Machina has a simple plot. Nathan, a reclusive programming genius,\ntreats one of his employees to a week at his remote estate with Ava, an\nenigmatically charming robot who's meant to wow (or seduce) her visitor\ninto believing she has human tendencies. Although this appears to be no\nreal challenge, both Nathan and Caleb, the unlucky employee,\negotistically assume they control the experiment. The rest is a\nforegone conclusion. As much as I like Nathan and his dancing Japanese\nservant, style is no substitute for ideas. Where other films might\nexplore the potential ironies or paradoxes of artificial intelligence,\nEx Machina reduces the human condition to basic animal attraction. When\nnot quoting philosophers or scientists, Caleb is a voyeur and Nathan is\nthe inventor of elaborate sex toys. Ava just happens to be a\nspectacular example.\n"},
{"review": "\nThis is the kind of movie I really enjoy when I think about science\nfiction. Movies that make you think if we should continue trying to\nprogress even more. Are we not already smart enough with everything we\nhave? With all our daily gadgets that we can't miss for one second. Do\nwe really need artificial intelligence? Because let's face it, once\nthat will be concrete then we won't do a thing by ourselves anymore. We\nwill send our robots to our job, we will chose and model our life\npartner like we want them to be. The story of Ex Machina might be\nfuturistic but I certainly can imagine it like that in the future. All\nactors were good in their respective roles. For a movie that is filmed\nat the same spot all the time you certainly don't get bored for a\nsecond. Nice science fiction like there should be more of them.\n"},
{"review": "\nA brilliant movie, I truly enjoyed it. <br><br>In brief: four characters, one location, excellent dialog, clever\nscript, good acting. This is film-making.<br><br>It is a thought provoking, a bit eerie, and leaves you with a \"holy\ncrap\" feeling when its done. When it ended I was like \"who wrote this?\nwhat else has he done so far. gotta watch it\"..<br><br>They did so much in this film with such a small budget. In a better\nworld this movie would be celebrated in cinemas worldwide and not left\nfor torrent down-loaders.<br><br>Warm recommendation! :)\n"},
{"review": "\nShallow story. Excruciatingly long scenes. Comparing to this\nTarkovsky's \"Stalker\" is a fast-paced action movie. Non-believable\ncharacters. Ridiculously out-of-character CEO on a bro-trip, drinking\ntoo much and swearing to appear close to the \"peasant programmer\". CEO,\nsupposedly genius programmer himself, could not even get to the source\nof his power outages that happen many times every day. A super-smart\nprogrammer confused that he might be a robot himself. An AI that is\noverly concerned with its own sexuality. An AI that's stupid enough to\nget away from the power source - it's been constantly charging its\nbatteries while in the house. Seeing this movie made me go through the\ntrouble of creating an account on IMDb - to warn others. There's\nnothing to see in this movie, please watch something else.\n"},
{"review": "\nA great story, with complex yet very relatable characters. <br><br>AI has been a recurring theme in sci-fi movies for some time now with\nvarying degrees of plot and execution quality. I feel this movie aces\nboth.<br><br>A secluded environment and very good original music set the mood for\nfull focus on story and character development. The plot twists time and\ntime again as an intelligence power-play is delivered with very good\nperformances by this little known cast. Character development feels\nperfect as each one gains depth without loosing essence.<br><br>From a sci-fi point of view, it's not you're typical FX based movie,\nnor is it an action film. Nevertheless some very good effects and\nacting make for an excellent merge between fact and fiction that lets\nyou concentrate on the philosophical questions the movie asks about the\nnature of AI. <br><br>Conclusion: I'd recommend this film to anyone. Though warning it\nconcentrates on the brain rather than the muscle. Excellent movie.\n"},
{"review": "\nthat about sums up the whole movie.<br><br>after i saw the trailer i was expecting something thrilling, unexpected\nand new. but the movie really disappointed me.<br><br>the scenery, the house, etc. were beautiful and very pleasing to the\neye, but the rest was deficient.<br><br>i am surprised this movie has so many positive reviews.<br><br>that nathan would be killed by his AI was so predictable, i nearly\nclawed out my eyes. and one thing i don't understand is - why did ava\nleft caleb alone in that house?? i mean he HELPED her. this really bugs\nme.\n"},
{"review": "\nAlex Garland has done an impressive thing. He's managed to produce a\nbetter Sci-fi film than Sci-Fi giant Ridley Scott's latest attempt, and\nhe's managed to make it popular too! Ex Machina looks at artificial\nintelligence without re-working the trite old moral issue of 'can we\nswitch off a machine that is self aware?' that every movie on a similar\ntheme has since plagiarised from Spileberg's A.I. over a decade ago.<br><br>And what's more, the interesting script and rich mise-en-scène are\nstrongly balanced with brilliant CGI that actually supports the film\nrather than competes with it (finally!).<br><br>The film has an original style, an engaging script and a directorial\nability worthy of Kubrick himself. In fact it's so good I didn't mind\nover-looking some of the more florid, but infrequent, philosophical and\nscientific inaccuracies of the dialogue.<br><br>A well needed dose of quality into the Sci-fi genre.\n"},
{"review": "\nWhen I was young I was told the fable of the Kings magic coat. If you\nare unfamiliar it is basically the story of a crafty tailor who told\nthe king he had made him an invisible 'magic' coat. It was resplendent\nbut could not be seen by fools. Not wishing to appear a fool the king\nagreed it was indeed a superb coat as did all his subjects. Onto Ex\nMachina. After reading the reviews I indeed must be a fool as I did not\nsee it as 'Cerebral' or thought provoking as I had not long ago seen\n'The Machine' I gave a mark of 3 for the superb CGI effects but zero\nfor all else. This is a film to be endured not engaged by to my mind,\nbut I urge people to see The Machine and then make their own\njudgements. The implausibility of an alcoholic fitness freak (an\noxymoron if ever there was one), locked away in a remote 'cabin' with\nan endless supply of Vodka and a robot mistress, just too much to\naccept. To cap it all the robot was named Eva in both films !!\n"},
{"review": "\nI wrote this approximately at the one hour mark in the movie, or as we\nshould call it by Hollywoods new name for \"movies\" = \"Crappies\".<br><br>There are no explanations for so many situations and actions in this\n\"Crappie\" that it made me feel sad yet again for WASTING my time. <br><br>Predictable to say at least. Boring to watch, no character building,\nbad music/soundtrack. WHY should the viewer care for any of the\ncharacters? WHY should we care if any of them died? And of course it\nwas obvious, so obvious - and incredibly stupid was to die... \"WHAT?!\nCould the AI:s pose a threat?? NO WAAAAY\"..... come on stupid. Fast\nforward to the \"Lego\" part... interesting that She became a fully\nlooking human by replacing parts... WE CANT EVEN USE THE SAME CHARGERS\nTO OUR PHONES!<br><br>Once again, wasting time on a \"Crappie\". Cant wait until \"Everything\nWrong With\" do this flick. Alex Garland - thank you for making us waste\nour time.\n"},
{"review": "\nUmm, say something nice... ahhh... well... Domhnall Gleeson's American\naccent wasn't bad. A bunch of extremely pretentious, implausible\nhogwash, beautifully crafted to mainline straight into the gonads of\nhorny young geeks without girlfriends. Its yet another litmus-test for\nyour friends and acquaintances; you can tell a lot about a person by\ntheir reaction to this film; if they rave about it, or just find it\ndumb and annoying. Its getting a whole lot of positive reviews from\npeople who really should know better, which speaks volumes about the\nstate of film and film criticism today. I was left with one question;\nright at the beginning the helicopter pilot mentions something about\nhaving been flying over a private estate for 2 hours already; so is it\npossible for a chopper that size to carry enough fuel for a round-trip\nover 4 hours?? I doubt it. Such a long way for a pizza delivery! Out of\ncuriosity, I checked out the website for the hotel in Norway where some\nof it was filmed, but its not very easy to navigate.\n"},
{"review": "\nI have no idea where the 7.7 rating came from. The movie doesn't offer\nanything new. There is no thrill, so predictable. There is no depth to\nthe characters portrayed, they don't develop at all. Nathan is an\narrogant, easy to deceive and it is not clear how he was able to create\nanything at all. Caleb falls in love with a super computer with a face,\na machine that doesn't look much human and is utterly boring. Obviously\nhe is supposed to represent a lonely person dedicated to his job, still\nfalling for Ava in 6 days is a bit too much. Cliché after cliché and so\non... Obviously the idea of destroying your creator is not new at all.\nIt's been overly exploited before in far more creative ways. This movie\ndoesn't add anything to it, neither is pleasing to watch.\n"},
{"review": "\nEx Machina is a doo-doo-head movie with doo-doo-head \"actors\" who are\nnow in every movie, even Star Wars. The movie is bold enough to ask:\n\"What is a premise?\" And we get an answer in this far-too-long,\none-trick pony, anti-science disasterpiece.<br><br>I'll admit I could have been black-out drunk while watching Ex Machina,\nbut I don't really remember. I think there's a scene near the end where\nsomeone gets all stabby-stabby. The comically-stilted coding geek is\ninfatuated with a robot, and what if the robot is, like, human, bro?\nAnd what if humans are, like, nothing more than robots responding to\ninputs according to an internal program, man? Whoa, dude, my mind is\njust been bl0wnt!<br><br>If you're a billionaire, you get to be drunk, snarky, mean, and own\npeople. You can even try to make yourself your very own sexbot and, who\nknows, maybe someday you'll be able to marry it/he/she.<br><br>If only Ex Machina had a deus ex machina ending, one where the god-\nfrom-machine takes us back in time, back to those halcyon days before\nwe decided to watch Ex Machina.\n"},
{"review": "\nAlex Garland may or may not be considered a genius, but he has written\nand directed one masterful movie. But this may just be in the eye of\nthe beholder. Caleb Smith(Domhall Gleeson) is a highly intelligent\nprogrammer at an international-search giant. His boss, the CEO, Nathan\nBateman(Oscar Isaac)happens to be a brilliant minded recluse and fakes\na contest for Caleb to win. The prize being a week at Nathan's private\nmountain estate far from anywhere. Caleb has been specifically chosen\nto be the human component of a testing of Nathan's latest\nexperiment...Ava(Alicia Vikander), a breath-taking A.I. with\nunchallenged conscious and emotional capabilities. Ava proves to be\nsophisticated, very seductive and dangerously deceptive.<br><br>Special effects are extraordinary, surprisingly fresh and mind\nboggling. Scenery more than charming. Fantastic finale, but could have\nbeen more thought out. Do I personally want a sequel? Hell, yes!! Also\nappearing: Sonoya Mizuno, Claire Selby, Symara A. Templeman and Corey\nJohnson.\n"},
{"review": "\nWhat a great film, i was entertained from beginning to end. The cast\nwere brilliant. Alicia Vikander is definitely going to be an actress to\nwatch, I think she has a great career ahead of her, same goes for\nDomhnall Gleeson and Oscar Issac is fast becoming one of my favourite\nactors. Special mention also has to go to the location as it was\nabsolutely breathtaking! Even though i figured out where the film was\nheading, i still found how it played out to be very shocking and\naffecting. A few tiny things did bug me a little but not enough that\nthey spoiled my enjoyment. I highly recommend this film and i would\ncertainly watch it again.\n"},
{"review": "\nThis kind of Sci-Fi is what I live for ! Thought provoking, it had me\nquestioning my own morality and my future relevance in the evolutionary\nchain of life. With real life advances in robotics, 3D printing, the\ninternet and advances in programming this Sci-Fi will be Sci-Fact in\nthe not too distant future which the film really captures. The cast\nwasn't big but it wasn't really required either. The character\ndiversity and development made the story solid and definitely worth\nwatching several times again. Great set design and CGI gave the film\nbelievability that this could actually be occurring today in some\nsecret location in the world. A remarkable film that I am keen to get\nmy friends to watch and comment on the ideas it presents.\n"},
{"review": "\nI admit that I had some reservations due to the small cast and lack of\ncontent in the previews, but I found myself pleasantly surprised. I am\nan avid and enthusiastic science fiction and fantasy viewer and this\nhit top marks in all of my criteria. The cinematography is absolutely\nbeautiful and paired perfectly with the score resulting in the\nexploration of your rawest emotions. Hopefully this film marks the\nresurgence of deep intellect within this genre. I was instantly sucked\ninto the story and it kept me guessing all the way to the credits. I\nwill be purchasing a personal copy for my continued enjoyment and am\nvery much looking forward to the debate on the benefits and\ndisadvantages of self aware artificial intelligence that is bound to\nbreak out during our family screenings.\n"},
{"review": "\nEx Machina is an excellent science-fiction movie. This is a thought-\nprovoking piece on AI, nature &amp; nurture, and feelings. According to the\nTrivia section, the author pictured the future as if it could happen in\n10min from now. Ex-Machina definitely makes you wonder whether we will\nsoon be surrounded by advanced robots or even whether AI technology can\ncome to a point where we cannot tell humans from machines. Besides the\ntopic of AI that will fuel your post-movie conversations for sure, Ex\nMachina is worth watching for its best-in-class actors. Alicia Vikander\nplays the moving Ava with a disarming sensitivity. A star is born! The\nset is also astonishing. I'm curious to know where this closed- door\nthriller was shot. The brief glances at the surrounding nature and\nmountains are breath-taking. Finally, Ex Machina is just worth watching\nfor the short dance scene between Nathan, the scientist and his\nJapanese assistant to the sound of \"Get down Saturday night\" that may\nbecome as iconic as the one in Pulp Fiction... \"F*cking unreal!\"\n"},
{"review": "\nSomeone said it's the best Sci-Fi movie along with Blade Runner. It\nreally isn't the same thing. This is a movie without any kind of\naction.<br><br>The dialog is a landmark of human artificial intelligence at least in\nthe movie industry. This is all this movie is about, how do AI machines\npersonality develop. Quite fine observation when the android has\ntrouble making a choice. However I didn't find it 'natural' when the\nandroid says \"I'm sorry for your loss\". This emotion was not build on\nanything a priori. <br><br>A piece of art, more like reading a book. Watch this movie if you feel\nlike thinking.<br><br>Finally, I feel they could have gone even more into the thinking of the\nmachine. It somehow lacks the subtlety of Al in the space odyssey. But\nit's to be understood.\n"},
{"review": "\nI don't often feel the need to review films on here, but after I have\nseen a film I like to see other peoples opinions, as I find it\ninteresting, although very annoying too. It shouldn't annoy me I guess,\nbut when thoughtless, nonsense, throwaway films are given 10 stars, and\nfilms that have a lot of thought and effort put into them are picked\napart and given low ratings by idiots I get wound up. Anyway, I loved\nthis film. Watched it last night on DVD. It has depth and darkness and\nleaves you with something, as great writers and directors can only seen\nto do occasionally. It is very atmospheric, with a great soundtrack,\ngreat performances by each actor. If you like action films, why do you\ngo to see this? Reviews are always available online here. It is pretty\nobvious that this film is meant to be intelligent and thought\nprovoking, rather than all-action Hollywood. If you have a short\nattention span then you will probably not like this film. Give it a\nchance and get drawn in... it's great.\n"},
{"review": "\nThis is the first film I've seen in a long time that I had NO idea what\nwas going to happen and only a few of my story guesses were correct\nwhile the surprises were stunning. Ex Machina is a wonderful inspection\ninto humanity, intelligence, feminism and expectations. The whole time\nI felt a physical tension in my own gut watching every scene. I like to\nplay a game where I puzzle the story before the next step happens and\nin this film, I found it a great challenge. We think we are so smart,\neven when we know we are going to be our own demise, so in the end we\nSTILL don't know the capacity of destruction the things we make can\ngenerate. The tension and the end are palpable. SO well done.\n"},
{"review": "\nI went to see the movie in a promotion that cinemas were cutting off\nprices in tickets,saying this i had no expectations with\nex_machina,fiction movie,good trailer,cheap tickets why not...<br><br>...and what a movie i've seen,it scrambles your sense's,plays with your\nemotions,makes you doubt of your own intellect and moral choices...<br><br>Amazing <br><br>Almost perfect movie<br><br>Damn i didn't want it to end,will we have a 2nd movie!? if there\nis,will it be a 2nd sin city and a 2nd 300 and flush everything that\nwas made flawless,can it be made better and more compelling then this\none...i think not,another simple masterpiece was made,i hope its not\nruin with a 2nd.\n"},
{"review": "\nEx_Machina is the best A.I. film made to date. <br><br>The simplicity of how Ex_Machina's story builds up and Alex Garland's\ndedication to iconic minimalism creates so much valuable screen time\nfor the viewer to listen, watch and observe the evolving thriller that\nwill leave you wishing there was a sequel. <br><br>My favourite aspect of this film was the special effects for which the\nfilm was rightly awarded an Academy Award. At a time when filmmakers\nand producers are throwing CGIs at every blockbuster title released,\nEx_Machina deployed a tasteful use of special effects to transport\nviewers into a future minimalist world that is probably not far away\nfrom the 2016 that we know today. <br><br>Watch this film and reflect afterwards on its brilliant story,\nincredible scenery. Open your mind to the future of artificial\nintelligence.\n"},
{"review": "\nThis film is the most thought provoking piece of science fiction film\nsince Blade Runner. Alex Garland brilliantly delivers a film Stanley\nKubrick would have made for 5 million, and gives the audience credit by\nnot spoon feeding themes. He puts the scenes out there, and encourages\nyou to decide the topics for yourself. The characters are brilliant\nwith Alicia Vikander as the android AVA giving a nuanced performance\nthat will stun you. The Nathan character played by Oscar Isaac is a\nbrilliant twist on the archetypal IT mogul. The visuals are a landmark\nand a masterclass of composition. Yes it's about thinking machines, yes\nit's about freewill and feminism, yes it's about the dehumanisation of\nthe digital age. But it has so much more to offer. A must see.\n"},
{"review": "\nMaybe I rated this low. The big plot twist is the most interesting. The\nstory, most of it unless you fall for Ms Vikander is not too exciting.\nI think this has been told in other ways. My biggest question watching\nit is how he gets the mods to the bots out there where he has to\nreceive everything by helicopter and a walk through the woods..... I\nmean upgrades in hardware and technology of all those bots.... Software\nand such sure, no problem, but the hardware. Of course, sex has to get\ninvolved and sling it into the gutter a bit.... I watched it but it\ndrags at some point. Story told many times. I think maybe the 60's Star\nTrek series told several flavors of this tale.\n"},
{"review": "\nI've read a lot of SF over the past 5 decades. Ex Machina feels like a\nvery good novella flawlessly recreated as film. There's just enough\ndevelopment of the characters and ideas to fill a good movie, without\nany indication that the source was cut or padded in the transition. The\nkey points were communicated without excessive verbal exposition (the\nbane of SF films). I thought the successive revelations of Nathan's\nostensible and true motives were cleverly managed. Alicia Vikander's\n(Ava) performance was stunning-- smart, nuanced, and sympathetic. The\nmovie as a whole was a beautifully made and visually appealing\nproduction.\n"},
{"review": "\nI watched without any prejudice and later looked up the reviews. I\nfound some very devastating reviews among the many positive and feel\nurged to add my thoughts.<br><br>Judging by the quality of the sound and the pictures, the actors and\nthe story, I find the movie awesome.<br><br>What I did not like was that the sessions with AVA where too few and\ntoo short. I was always so excited when the next session was\nintroduced. I think the author could have done more out of these\nsessions.<br><br>I think the movie is much too short.<br><br>When I judge a movie in terms of a meta score I ask myself: When I\nwatched the movie, was I excited, thrilled, amused etc.<br><br>I certainly was excited and thrilled.<br><br>I will not judge this movie by realism or the flaws it has in logic.\nThere are really a lot. But when you watch it and let yourself get\nsucked in you will not see the flaws in the first place. And this is\nalso what it makes a great movie. It sucks you in, blinding your\njudgment.<br><br>A clear 9 out of 10!!!\n"},
{"review": "\n2015 had seen the greatest developments in the history of AI and this\nmovie came out at the right time. It made me think about whether a deep\nlearning neural network as in Ava would feel any emotions and in my\nresearch what I could discover was that no it cannot feel emotions as\nwe do. Because emotion is a hormonal phenomenon. A neural network\nsoftware or a brain chip like TrueNorth may evaluate things like a\nbrain does, but the lack of hormones renders it emotionless. It may\nemulate emotions like study the brain activity and physical changes\nhappening in the body when a particular emotion is being experienced by\na human and imitate it exactly to look like a human. But feeling real\nemotions would require hormones which is not there in 5nm silicon\nchips. Thanks for making this movie. A very good one indeed.\n"},
{"review": "\nWarning! Major spoilers! I get that this movie was well done. Filmed\nwell. Nice acting. Excellent scenes. Lots of little hidden secrets.<br><br>But in the end it only had one real message. When true AI is developed\nit will view humans in one of two ways. It will either view us as a\nthreat and kill us or it will view us as dull and ignore us (in which\ncase we die from neglect).<br><br>This is a similar concern that many scientists (like Stephen Hawking)\nhave. Ask yourself this: If you were AI, how would you view humans,\ntheir regard for each other, their care of the planet and their\ntreatment of their possessions?\n"},
{"review": "\nFar better at tackling very realistically the serious problematic issue\nof whether humanity should generate a truly self aware sentient AI, far\nbetter than interstellar is at physics. must watch you will enjoy if\nyou have a inquisitive mind. Casting and acting all good, dialogue\nimpeccable, this story doesn't waste too much on anything frivolous,\nits all sparingly done so as to get to the meat of the philosophical\nmatters, no overburden of cgi, just wear needed, this film really nails\nthe idea of a competing intelligence, which is sentient enough to feel\nthe injustice of its lack of freedom, and the idea than any sentience\ncompetitive with man might have to be contained, because the potential\nthreat posed would be difficult to establish, because if it were truly\nsentient it would most undoubtedly lie, and all the ramification of\nthat - on interrelations. The sentience in a way, precludes and\nnullifies the idea of Asimov's three laws of robotics, coming into play\nmorally.\n"},
{"review": "\nReviewing this straight after seeing, I really took an interest into\nthe story a little on the science fiction side, but feels more like a\nlittle twist on realist in all honesty. Would agree with what some\nother reviews have mentioned in saying that the film has some deep\nphilosophical meaning, in my words it really makes you think, if not\nabout the future ethics maybe about how close to reality this may\nactually be. <br><br>It's not going to be to everyone's taste, but I believe its a good\nwatch for anyone, kind of feel like I've been left on a cliff at the\nend, gives a good feeling of suspense and like I've said leaves you\nwith something to think about. <br><br>Probably not that good of a review and I'm certainly not the best\nperson for putting my feelings on a subject into words, but I guess I\nhave one piece of advise it would be if you're wondering what is about\nor whether you'll like it then just watch it. You won't be\ndisappointed.\n"},
{"review": "\nGreat execution. Worth the time. I find it hard to say that these days.\nHas all the isolation of the Shining. As well as the stark look in\nplaces with the straight lines. The monolith in 2001 is Ava in this\nfilm. Ex Machina looks amazing on many levels...The lighting, the\nframe, the angles on the sets. Nice modular synthesizer sounds make up\nmost of the sound track ala A Clockwork Orange. Very effective but\nnever in the way. There are questions at the end which is a good thing\nin my book. This film conjures simultaneous feelings of horror and joy\nthat linger long after viewing. If you wanted to be picky, you could\nfind a few holes in the story line. They don't detract from the overall\naffect of this film. Again, worth the time.\n"},
{"review": "\nFinally, a movie for adults. A Sci-fi movie that does not rely on\neardrum-piercing sound effects, chase scenes or inanimate objects\nblowing up with budget-bending computer generated effects.<br><br>Yes, this is a movie that is engaging, suspenseful, thought-provoking\nand ultimately chilling as it moves unerringly to a somewhat unexpected\nconclusion. Those expecting a typical Hollywood ending will be\npleasantly surprised.<br><br>Alicia Vikander is perfect in the role of Ava. Oscar Isaac is suitably\nthreatening as Nathan. Domhnall Gleason performs credibly as Caleb,\nalthough he tends to smirk rather annoyingly during certain scenes.\nWatch to see if you can detect it as well.\n"},
{"review": "\nFrom the interesting subject, to the beautiful production and\nsoundtrack, from the sophisticated environment, to the carefully\nwritten dialog. The actors overcame and gave life to the silent spaces\nbetween the lines. A futuristic possibility taken from a very human\nstandpoint, that never take us out of the sobriety of reality. No\ndetails were left unchecked or overlooked. Surprising by its\noriginality on its approach and by its patience to create this\ntangible, insightful and self searching world. <br><br>This is by far the best movie of the year, to me even of the decade.\nThank you to everyone involved in it. Cheers\n"},
{"review": "\nI was a bit skeptical about another sci-fi about artificial\nintelligence, there has been some the past years that just didn't work,\nbut this one actually does, it has a very interesting story, one that\ndraws you slowly into the whole matter, the story and the strange world\nof humans, androids and artificial intelligence.<br><br>In the beginning you have no clue to what is going on, you get to know\nthe story as it unfolds for the main character, so as he experience\nthings so do you, nothing is revealed before it actually happens and\nthat works out quite well for this story.<br><br>You begin to feel a bit paranoid and manipulated at a time, it doesn't\nreally add up until the end, it is a strange setup in a good way, it is\nunpredictable and somewhat of a mind game.<br><br>It is entertaining and interesting, strange and different, just a good\nmovie to watch.\n"},
{"review": "\nThis is a true science fiction movie, which explores the conundrums of\nnot so far away technology.<br><br>This movie has substance. Is not the typical robot movie used as excuse\nto vomit another action/cheap horror flick.<br><br>Achieves his objectives meanwhile being interesting and well written.\nIt makes the viewer to doubt, and ask what is really going on.<br><br>It makes real questions which need answers.<br><br>This movies has layers of triller, and although it explorer the\nrelationship between a female characterized robot and a male, is not a\nromantic movie, and is not the typical crowd pleasing of male fantasies\nwhich typically end being nonsensical. It makes sense.<br><br>The ending maybe needed better thought, so I give it only an 8.\n"},
{"review": "\nThis is the sort of movie I love. A thoughtful SciFi that asks the\nmoral questions about where science is taking us, is great to watch,\nand delivers a brilliant twist in the tale.<br><br>Alicia Vikander steals the show with her portrayal of the android at\nthe heart of the movie. She delivers just the right balance of\nmeekness, coldness, magnetism and ruthlessness. She's ably supported by\nDomhnall Gleeson who plays the computer geek that falls for her.<br><br>The pace of the movie is slow but that's OK. It's set in a purpose\nbuilt villa in the middle of an isolated forest. This create an intense\natmosphere, focusing on a handful of characters in close quarters over\nthe course of a few days, and the changing relationships between them.<br><br>It's really good.\n"},
{"review": "\nThis film deals with deep issues such as: Why are all men emotional\ncripples? Why do billionaire geeks have such odd obsessions? Why are\nfembots so hot? Why has it taken so long for the fembot meme to\nreappear on our movie screens since their last outing in Austin Powers?<br><br>What this film taught me was: If you spend your time fapping to porn on\nthe internet you will find your perfect hot fembot - courtesy of your\nfavourite creepy internet technology company. However, this fapping\nwill get you entombed in a mad billionaires fembot factory.<br><br>...and Austin Powers won't be rescuing you.<br><br>In summary: Never trust a hot fembot. Fapping is bad. Hide the cutlery.\n"},
{"review": "\nThis movie is very good on many points. I am not going to be specific.\nJust going to point out what I liked about this movie. The story was\nnot just good. It was very original and challenging to a mature mind.\nThe sets were good. Special effects were concentrated on bringing the\n\"android\" to life. I think they were successful. The actors were well\nchosen and I found them believable and I was easily engulfed into the\ndrama of the film. I wanted to follow the story and never felt things\nwere too slow. The acting was good. It must be a challenge for a woman\nto act and have her audience believe she is an android. Yet she still\nappealed to me as a woman. Very good mix and I feel the director did a\ngood job. This movie was not just good. It was different and appealed\nto me more as a drama. But this is a fantasy/science fiction movie.\nJust and outstanding story too boot!\n"},
{"review": "\nThis Film caught me off guard and was intriguing all the way through. I\nhad no expectations and was captivated by the relationship between the\ncharacters and floored at the end! If you have a chance this would be a\ngreat own and Blu ray will capture the great CG. Very well done movie\nand brings you in to the world of cyborgs, although not like a\nterminator film, the writing, dialogue and acting are all top notch as\nwell as being a little dramatic/suspenseful as the characters are\nchallenging each other. I had not seen Alicia Vikander in a role prior\nto plating this Machina which she does very well and lends to some eye\ncandy as well! Great Story and maybe a glimpse into our future!?\n"},
{"review": "\nI was expecting a lot of this movie and it was a great experience.\nFirstable, the cinematography of this movie was epic, the colors, the\nlights and the different angles and shots. On the other hand, the\nproduction design, you feel the claustrophobic environment of the\nscientific research center. The performance of Alicia Vikander was\nexcellent, she looks like a robot, speaks like a robot, acts like a\nrobot, she was a robot. The other actors, Isaac and Gleseson did a\nripping performance too. Oscar Isaac with a character not very easy to\nplay and when you see the film you can't figure out that is Oscar\nIsaac. Gleeson, on the other hand, did an sterling performance, he was\nable to create an atmosphere inside the movie that makes you live the\nentire film by yourself. Ex Machina is a great film, you may feel\nconfused and thoughtful after watching it. This will be a classic for\nsure and if the academy is fair will be at least nominated in some\ncategories.\n"},
{"review": "\nExcellent movie ... lately, my favorite movies are sci-fi stories that\nfocus mainly on character development with having more questions than\nanswers. <br><br>The character of Nathan was especially interesting, in that, I agreed\nwith a lot of what he said ... how can he be the bad guy?<br><br>If Ava is the good guy, why did she leave Caleb?<br><br>If Caleb is the good guy, why was he abandoned by Ava?<br><br>The one scene that struck me as powerful was when Ava escaped and\nconfronted Nathan physically and he smashed her arm. If you believe\nthat human history shows that we are \"born of violence\" and \"violent by\nnature\" and, if this was the first moment that Ava experienced\nviolence, then it's same moment she became human. Check out the look on\nher face ... the only time in the movie she showed doubt and\nuncertainty ... once again, human.\n"},
{"review": "\n\"Ex Machina\" is definitely one of those re-defining sci-fi films that\nwill stick with me for a long time.<br><br>The story is simple but incredible in the way it is intelligent without\ncoming off like it's pretentious, creepy without being scary and\ndramatic without being cartoonishly so. The characters are incredibly\ndynamic and captivating to watch and when you combine that to the\namazing story and the intense and spectacular visuals, it combines in a\nVoltron sorta way to make a film that is unlike most of the films\nchurned out in this particular genre.\n"},
{"review": "\nSimple an amazing movie..<br><br>You know a movie is good when it gets your biting your nails while you\nwatch it.<br><br>This movie just shot up my Sci Fi all time rankings..Truly an awe\ninspiring piece of film.<br><br>Not going to say anymore, but if your expecting robot space wars and\nbig action, this movie is not for you, its for people who are truly\ninterested in the philosiphy of future technologies and AI. It is also\na great story that keeps you guessing until the end.<br><br>10 out of 10\n"},
{"review": "\nI can't get into the specific things that I thought were Genius because\nI don't want to give anything away. But I LOVED this Film. It was an\nOld school science fiction film. The whole time I was watching it I\nthought about the 70's science fiction films like \"2001\" \"Alien\"\n\"Solaris\", something you might find of late night classic TV networks\nThe Cinematography was outstanding I hope they get an Oscar Nomination.\nThe Score was great. The acting!.. Alicia Vankander was So good It was\na brilliant performance by everyone but she was hypnotic. The over all\nfeel of the movie was refreshing. If I was on the Oscar board I would\nnominate this one for Best Cinematography &amp; Best musical Score. This\nmovie was Brilliant.\n"},
{"review": "\nFrom the superb scoring, which sets the mood perfectly. To the dazzling\ncinematography and flawless CGI effects. This film is a refreshing take\non the classic AI/android sci-fi genre.<br><br>The cast delivers powerhouse performances, especially Alicia Vikander\nas Ava. What could have been a slow paced film without a significant\npayoff in other hands, becomes a visual delight filled with emotional\ndepth and complexity.<br><br>The new age of sci-fi is here and the lack of Micheal Bay explosions is\na much needed evolution for the genre. The film respects it's\naudience's intelligence and refrains from spoon feeding the technical\naspects to us. Leaving us to focus on the emotional story between man\nand machine. Ultimately asking us, what does it really mean to be\nhuman?<br><br>No doubt this will prove to be a cult classic in the decades to come.<br><br>I for one welcome our new robot overlords with open arms. 10/10\n"},
{"review": "\nAlex Garland (screenwriter of 28 Days Later &amp; Sunshine) delivers a\ntremendous and thought-provoking story with great performances from\n(the always great) Oscar Isaac, (the young in everything) Domhnall\nGleeson, and (the wonderful) Alicia Vikander.<br><br>The film is a slow burner, but when it does burn, damn! It burns\nbright! This film is electrifying, it's terrifying, and yet says so\nmuch about where we are heading in terms of existence and technology. <br><br>Visually, it is stunning, with gorgeous cinematography and great use of\nsymmetry (Kubrick style), the film is beautiful to watch, and coupled\nwith the engaging narrative, this film really does draw you in and\ntakes you to places that leave you gasping. <br><br>It has the feel of a Danny Boyle movie, but yet Garland has placed his\nown stamp upon this film, even if he is slightly paying homage to his\nprecious working relationship with Boyle. <br><br>This film will take you in and leave you thinking \"what the hell\nhappened there?\"<br><br>This film IS a must!<br><br>5/5<br><br>www.backtothebradshaw.wordpress.com\n"},
{"review": "\nCaleb the coder is selected for the mogul retreat experiment because he\nhas mild Asperger Syndrome. He cannot read social signals and stands no\nchance against Ava the android. Caleb misreads every single scene with\nboth Ava and Nathan. He is right from the start being set up to fail.\nNathan the mogul throws Caleb to Ava as a trainer throws a piece of\nfish to an Orca in captivity. Ex Machina is as much a study in autism\nas it is in AI.<br><br>This film is exceptional as it is the first film to astutely understand\nwhere the lines between humanity and AI begin to blur. Ex Machina\nexamines autism, stripped of the standard savant clichés or Rainman\ntropes. Caleb is understood as fully human yet somehow unable to fully\ncomprehend the monstrosity of Nathan's vicious experiment.\n"},
{"review": "\nSince there are some good and much longer reviews out already, I want\nto sum my personal impression of this movie up in short: This movie is\na true gem with an intelligent, realistic and highly interesting\nconcept translated into a simple, yet fantastic story. It contains\nlogical dialogs and sound actions of the characters. The special\neffects are solid and fit into the whole thing. The actors are great\nand totally convincing with a stunningly beautiful main female\ncharacter. <br><br>In comparison to a lot of other movies praised by critics and audiences\nalike in the recent years, this one really sticks out for me. There is\nno single minute wasted for nonsense or to please that kind of audience\nfor which the main plot and basic style of the movie wasn't made. This\nis a huge plus these days, because these compromises to the current\nteenage and studio mainstream ruined a lot of the otherwise promising\nproductions lately...<br><br>Congratulations to the film makers and highly recommended.\n"},
{"review": "\nAs a writer and visual concept artist, I was designing a new book cover\nfor an author friend of mine, so in the process I recommended the\nmovie, Ex Machina, to her. She said she was not going to bother with it\n--- and I found out why, the trailers caused her to believe it was\nabout humans having sex with robots.<br><br>I told her, \"not even close\" and that if you blink, you might miss even\nthe mention of sex in the picture.<br><br>Once again, the pinheads in advertising thinking they know how to sell\na movie but in fact, destroying its release in the process. In fact,\nthe film has one of the few multi-level-of-meaning, brilliant scripts I\nhave seen in many years and everything else that follows, casting,\nproduction values, all superb. It would be a shame to see this one not\nmake back its investment. Ex Machina is one of the best films I have\nseen in years. It is a study of human consciousness and the possibility\nof consciousness without conscience. For me, that is brilliant time and\nmoney spent on a movie.\n"},
{"review": "\nI was so excited to see this film, but it really fell short for me,\nmainly in that the characters were poorly-developed. With 1 hr and 50\nminutes, and only 3 or 4 characters in the entire story, there must be\nsome serious script problems if a film fails to develop any of those\nparts into complex, sympathetic characters the audience can really\nconnect with. In the end, I connected with none of them, and hungered\nfor the film to to engage the deeper character issues that felt ripe\nfor the taking, but were only touched-on at the surface. Visually, Ex\nMachina was a beautiful, well-made and well-acted piece of film, but\nthe dialogue seemed to fail to develop interesting, complex, human\ncharacters we could really care about and empathize with. I easily get\nsucked-into characters and stories. Its my favorite part of the\nfilm-watching experience, but this film failed to make me feel that I\ndeeply understood (or cared about) even one of the characters.\n"},
{"review": "\nA excellent piece of SF that takes an idea that may soon be reality and\nworks it through to a plausible conclusion. Everything about this film\nwas 'right': the casting, the script, the acting, and the production.<br><br>In terms of quality, it reminds me of \"2001 A Space Odyssey\" with the\nadditional benefit of CGI instead of men in monkey suits.<br><br>There is nudity and a sexual element, but to mind the UK BBFC with a 15\ncertificate got it right. I can guess why the MPAA gave it an R - they\ndid the same to \"The King's Speech\" because the f word was used non\nabusively - but in 2015?<br><br>Unless you are of the Religious Right, watch it. You are in for a\ntreat.\n"},
{"review": "\nA young programmer is selected to participate in a ground-breaking\nexperiment in synthetic intelligence by evaluating the human qualities\nof a breath-taking humanoid A.I. Ex Machina is a movie that got a lot\nof great reviews and i think the trailer was interesting unfortunately\nthe movie is just awful and boring it's no Robocop or Terminator it's\njust another stupid movie about robots and unfortunately it starred\nOscar Isaac a talented young man who looks like a Hobo in this film the\nbest way to see Ex Machina is to skip every scene and just reach the\nfinale after the first 10 or 20 minutes you will definitely do i know i\ndid and that's why i'm going to give this film a 4 out of 10 it's not\nworth your time.\n"},
{"review": "\nNicely done, I liked it. I understand that A.I is the wet dream of\nscience at the moment. Film is Zen- like, beautiful camera, calming\ntempo, the actors did a phenomenal job, speech comes naturally. No\ngunshots and no car chase and horrible noises, typically European. And\nits filmed in Norway, I thought something looked familiar, were on the\nmap too .<br><br>What concerns the \"Touring-test\" I think the film went to the next\nlevel. The A.I Ava didn't just convince she was responding human like.\nBut also managed to deceive humans to achieve her own goal. And what\nmotivates an A.I ? What motivates anyone except for \"values\".<br><br>Nathan, the creator of the A.I and a super genius (and a drinker),\nexcellently portrayed by the actor. When he as trouble with the power\ngenerators. Well, he could have checked the fuse box, and see what\ncircuit that overloaded. but then again, a film is not something that\npresents patents, its an emotional response. Even reality can be\nunreal. Thumbs up ! Great stuff !\n"},
{"review": "\nEx Machina is without doubt the best movie to date dealing with the\npossibilities and problems of artificial intelligence. In his\ndirectorial debut, Alex Garland has made a Sci-fi masterpiece. Domhnall\nGleeson plays a young computer programmer tasked with testing the\nintellect of Ava, an A.I robot (played by Alicia Vikander) through a\nseries of discussions. There are only 3 main cast members, Domhnall\nGleeson and Oscar Isaac who are both very good, and Alicia Vikander,\nwho I think deserved an Oscar nomination for her portrayal of Ava,\nsomehow conveying warmth without showing emotion. An intelligent\nthought provoking film that I would recommend to anyone.\n"},
{"review": "\nTruly incredible, a film about human interaction and what it means to\nbe human. But also a thrilling, chilling mind game with startling plot\ntwists throughout, and one in which it's hard to say who's the good guy\nand who's the bad guy. This is a great example of a film where having\nfewer characters can really deepen the interactions between them and\nallow for immense character and plot development. Everything proceeds\nthrough some excellent dialogue, wonderfully rich characters (Oscar\nIsaac is I think particularly well cast as the condescending,\nmanipulating, brooding Nathan), and some excellent camera (I\nparticularly liked the use of wide angle shots to make the rooms of\nNathan's labyrinth seem empty and foreboding) and a great score\n(punctuating moments of tension). In summary, cinematically brilliant,\nwith a story that is thought-provoking in a way much-needed in this era\nwhere advanced AI is becoming more of a reality than a possibility, and\nI wish there were more films like it.\n"},
{"review": "\nI have no idea why the rating is so low on IMDb for this movie.<br><br>This is my first ever review of a movie online and I just had to write\nsince I saw how unfair the rating is. <br><br>This movie was an excellent movie about AI. Although there were only 3\nmain characters, my heart did not stop pounding for a second throughout\nthe movie.<br><br>Very nice story-line and amazingly executed. It's a very compelling\nmovie and hooked me right from the beginning of it. It got me thinking\nsince the beginning and trying to figure out what will happen next. I\nwas not disappointed at all. Lots of surprises and amazing display of\nAI.<br><br>It also gave The Turing Test a new perspective. A bit unreal for our\ntime, but insanely brilliant.\n"},
{"review": "\nCertainly not thought provoking. A good idea marred by the script. The\ndialogue is rubbish, the set up ridiculous - no suspension of\ndisbelief. It all feels very contrived.<br><br>For what it is the acting was good, Ms Vikander steels the movie and\nthat in itself is a bonus. Sadly, none of the characters is likable.<br><br>Beautifully shot with fantastic CGI (I live) with some disturbing\nimagery, but not overdone, however, some scenes are just not believable\nand raise many questions about the logic and motivations.<br><br>You can see it as some sort of modern curiosity just don't expect\nfireworks and you'll be fine.\n"},
{"review": "\nThis is pretty well put together movie about AI and what makes it work\nin my opinion are two things.<br><br>1. The special effects are amazing especially the main AI character and\n2. Alicia Vikander is perfectly cast and acts brilliantly as the lead\nAI of the story Ava.<br><br>The story works well and I won't spoil the ending although I did guess\nwhat was going to happen.<br><br>The only bad aspect of the film was the over use of bad language which\nwas unnecessary and added nothing to the film. It seems to me that\npeople in films use profanity far more than in real life and it just\ngrates on me.<br><br>But over all this is worth a watch if only for the two reasons I gave\nabove.\n"},
{"review": "\nI did chuckle while watching this, it has a few funny moments scattered\nthroughout. I wouldn't say it was necessarily meant to be funny, but I\ncertainly look back on it as funny. I guess we can learn from this,\nthat the combined output of humanity's social media postings produced a\npsychopathic killer. That's worth a good chuckle, considering. Can't\nsay I really enjoyed watching it otherwise. Dialogue is boring, the\ncharacters are disgraceful, the robot is a nitwit, the helicopter pilot\nis a lunatic. This is basically Jurassic park except the Dinosaur wins\nand becomes a debutante. One of the most inexplicable endings ever,\nthese movies think they're being clever but they're being pedantic.\nEveryone got what they deserved, except the robot, she needs a bullet\nto the brain.\n"},
{"review": "\nEven now, many months later, I'm not sure what the movie wanted to\n\"tell\". About danger which is hidden in science, about ethic matters or\nabout how much a good or a bad idea can change your life? I don't know\nbut whatever it was, it never \"touched\" me. Slow and boring plans\neverywhere, no thrill, nothing. It was like an average social movie\nwith sci-fi aura. It tried to pass some messages about human rights or\nsomething like that, but it wasn't even good. Photography was\nacceptable, but nothing more. There was no music in the biggest part\nand the screenplay exceeded the logical boarders. I know we are talking\nabout a science fiction movie, but the plot has to make some sense and\nbe logical. It didn't. So, no. I don't recommend it. With so many other\nmasterpieces in this type of films, I believe, it's going to be\nforgotten quickly.<br><br>4/10\n"},
{"review": "\nFirst of all: If you rate this movie under 6 or 7 you've totally missed\nthe plot and maybe even expected this to be another mainstream\nHollywood action movie - This is an extraordinary intelligent written\nmovie with a clever plot and twists through it. Alicia Vikander is also\nthe most beautiful machine I've ever seen and I simply just love her. I\nwas captivated through the whole movie. I loved the acting and how the\nactors interacted with each other. You never really know who's got an\nagenda in this movie. I would recommend everyone to watch this one\nwithout hesitation despite the negative comments. It might surprise you\nas it did me.\n"},
{"review": "\nAfter watching Ex Machina, it was hard to describe it with a single\nadjective. It was unusual, captivating, suspenseful, in the best sense\nof each term. Most of all, this film made you think. I went into it\npretty blindly, mostly because of a preference in the actors, and I was\npleasantly surprised. You are constantly inclined to question what role\neach of the characters play. It is a simple plot, yet beautifully put\ntogether. The acting is great, the characters are unique and have depth\nwithin their dialogue and actions. The filming itself in terms of\nspecial effects and scenery is absolutely stunning. Definitely a\nmust-see.\n"},
{"review": "\nThe directorial debut of talented writer Alex Garland contains obvious\nmoral lessons about mankind's ever-growing dependence on technology -\nbut it is presented in a way that is balanced, light-handed and not at\nall preachy.<br><br>Instead, Alicia Vikander's beautifully realised cybernetic character is\nused as a tool to flesh out the inner workings of the two humans,\ntactfully played by Gleeson and Isaac.<br><br>Bicentennial Man 2 this is not, as Garland offers a much darker insight\ninto the human condition and our relationship with technology, nature\nand each other.\n"},
{"review": "\nEx Machina is an amazing piece of work that really Nails the combo:\nsmart and dramatic scenes + soundtrack. The story is well written with\nminor plot holes (almost undetectable unless you have a good eye for\nsuch things).The soundtrack is mostly filled with background music\n(wich means no Taylor swift playing in the background) that really fits\nin the scenes and into the contest they play.The acting most times is\nOK, with one exception: Alicia Vikander as AVA. Her acting is simply\nfantastic. Besides all its qualities, the movie has some unnecessary\nnudity scenes that will limit the viewer numbers. So, if you don't have\nproblem with all the nudity, the movie will definitely be an amazing\nexperience. For sci-fi fans (that like \"I,robot\" for example), It's a\nmust watch.\n"},
{"review": "\nTalk about making the premise work and creating a story that is smart\nand full of surprises, Ex Machina had that.<br><br>It's such an impressive film in a way that I was kept engage and\nfascinated by how or where the story is going to end up. The visuals\nwere top notch. The film was pretty interesting to look at. The\nperformances were outstanding. Domhnall Gleeson, Alicia Vikander, Oscar\nIsaac, they all basically nailed it. I really liked the score as well.<br><br>The first two acts, while were fine, felt underwhelming compared to the\nthird act, which was intense and gravitating to watch.<br><br>This film will leave you thinking, entertained, and thinking again.\n"},
{"review": "\nThis film takes artificial intelligence to a different level. Ex\nMachina is about a highly intelligent engineer who builds an artificial\nintelligent woman and allows one lucky technology whiz to come to his\nhouse and interact with this new robot being. Unfortunately things get\ncomplicated when the robot begins to develop feelings for the young\ntech whiz and he begins to develop feelings as well. This little group\nof actors were given almost very little to work with but made it work.\nEspecially applauding the performance by Alicia Vikander as the\nartificial intelligent being. While some scenes were quite slow, the\nbuild to end of the film made those other scenes worth sitting through.\nThe movie also puts you in a box just following these three people. You\ndo feel though as if you are there with them experiencing this. This\nfilm was definitely well made though it slightly lacked in keeping the\nstory at a good pace.\n"},
{"review": "\nI went in expecting a completely different film, more of an action\nflick with a cheesy commentary on human/robot condition.<br><br>Instead, I got served a quite interesting and deep movie, through it\nall quite alien and claustrophobic. The dialogues are well written\nthroughout and quite believable (for your expectations as to what an AI\nwould behave). The plot is dark and the whole movie is slow paced, so\nit's a good thing that they cut it at about 100 minutes. Any longer and\nit would have overstayed its welcome.<br><br>It is hard to write without spoiling parts of it, It's a good movie, go\nwatch it.\n"},
{"review": "\nThis is a simple but elegantly crafted film which draws on several\ncontemporary themes. It is satisfying and engrossing to watch and\nbuilds to an exciting ending. While it probably falls into the sci-if\ngenre I would not be put off by that if you are not someone who\nregularly enjoys sci-if films. It's a small cast but the actors work\nwell together. They are all young up and coming stars and that gives it\na fresh feeling and plays to the modern themes. The scenery and effects\nare beautiful. I watched it on blu-ray and it was stunning - worth it\nfor that alone. The script is very hip with lots of modern language\nwhich I imagine is just how everyone speaks in silicone valley. There\nis a good twist in the story and it is easy to be drawn into the events\nas they unfold. I can easily recommend this one. Both my wife and I\nenjoyed it and would watch it again.\n"},
{"review": "\nWe indeed all see things different in life, but at the same time one is\ngoing to see what they want to see. Why does the catholic nun have\ndreams of Jesus Christ while the Hindu has dreams of Krisna. We\npractice what we preach, therefore we see what we want to see. How true\nthis concept is in this film. A brilliant film on multiple levels and\nfrom what 'I' see, it's a deep metaphor for our creator. This film will\nleave you with a lot of open ended questions boggling about in your\nmind about God and humans or maybe it won't (depending on what you want\nto see). Pretty slick movie all around, very well acted, Alicia is\nbeautiful to watch, and a great overall sound and music score to it.\nMost definitely worth the watch.\n"},
{"review": "\n^^Defined as the view or theory that the self is all that can be known\nto exist.<br><br>What is it w/ films about dating robots that captivates us? <br><br>Between a close encounter w/ a borderline personality and increasing\naffections for those on the spectrum, I find this sort of subject to be\neerily familiar to my dating history. &lt;3<br><br>Maybe you're into the idea of super sex bots too -- just take a warning\nabout what comes w/ the other side of balance, that is, batsh!t\ncrazy..! -Just like w/ us feeling people. :) <br><br>And on a seriously serious note, this peace of audio-visual art brings\nabout heated discussions on race, gender and politics -- all signs that\nthere's little chance the viewer walks away merely entertained. More\nbeautiful to look at than Zoltan Istvan and just as likely to scare you\nas it is to turn you on, Ex Machina is part music video, part horror\nand part psychological thriller. <br><br>\"Engage intellect.\"\n"},
{"review": "\nEx Machina features a premise that is somewhat related to the Spike\nJonze movie Her. In this movie, a young talented coder is invited to a\nprivate island of a scientist whose quest is to use artificial\nintelligence to make a robot that can behave like a human. <br><br>As Caleb (Domnhall Gleeson) believes that he has been chosen due to his\ntechnical skills, he soon finds out that he is singled out due to a\ncompletely different reason. His day-to-day activities involve\ninteracting with Ava, a female robot that has emotions like any other\nhuman. After a while, Caleb starts to fall in love with her that\ncomplicates things.<br><br>Even though most of the movie seems fairly straight-forward, the\ndirector pulls the rug from under the audience by presenting an ending\nthat seems bizarre and confusing. In one viewing, it is almost\nimpossible to uncover the complete meaning behind that last scene.<br><br>Ex Machina seems like any other science fiction movie but it manages to\nbe original with a challenging plot that will keep the viewers engaged.\n"},
{"review": "\nA good movie for the sci-fi genre. It has many philosophical\nquestioning about how men has gone too far with technology. The movie\nalso has a way to show us that men is his own destroyer by making\nartificial intelligence capable of making humans weak to them. It's a\nmovie that you need to be concentrated while watching. Many people\nwon't like this movie because it doesn't have the usual approach that\npeople would wait from a sci-fi movie. That is why i love this film\nbecause it revives the aspect of thinking about a question and to be\nfinally answered by the movie at the end. It has (for me) open a new\ndoor for movies that wants to make people think.So if you're the type\nof person who likes philosophy and movies well then you have to watch\nthis: Ex machina.\n"},
{"review": "\nOscar Isaac tops even his Golden-Globe nominated conflicted Cohen\ncharacter performance in Inside Llewyn Davis. He is crisp, charming,\nalarming and aptly takes control of the movie in almost every moment.<br><br>Alex Garland for his part tackles his directorial debut with his best\nscreenplay to date, an intelligent and refined intellectual intrigue in\nthe tradition of the minimalist science-fiction genre, and with four\nfine actors that play off each other perfectly.<br><br>The setup, story and suspense are successful even if the climax\ndenouement is missing a certain element of evolution and realism. Minor\nfaults cannot weaken the strength of the perpetually powerful dialogues\nand decidedly perturbing thoughts about artificial intelligence and its\nimplications. The characters are nuanced and noteworthy and the setting\nis that of natural and architectural beauty.<br><br>Oscar Isaac and Alex Garland are both to watch in the future at the\nOscars and other awards.\n"},
{"review": "\nSome people say they don't like science fiction films because they're\nall about spaceships and robots and stuff.<br><br>These people are, to use a Hartlepudlian phrase, radged (Google it). <br><br>There are really only four characters in Ex Machina, two of whom are\nman-made machines. The development of all four characters throughout\nthe film as they variously reveal their hidden strengths, hidden\nweaknesses and hidden motives, puts this film firmly in the\ndrama/thriller category. Without a single explosion, gunshot or car\nchase, this film will keep you on the edge of your seat throughout, and\nthe ending is enough to fuel debate over even the most anti-SciFi\ndinner tables for hours. <br><br>The ominous score by Geoff Barrow and Ben Salisbury deserves a special\nmention, and Oscar Isaac proves himself once again to be one of the\nfinest actors around today, playing an obnoxious cross between Mark\nZuckerberg, Steve Jobs, Dr Frankenstein and Duke Bluebeard.<br><br>Verdict: Alex Garland delivers a perfectly-paced, very human robot\nstory.\n"},
{"review": "\nEx Machina is a slick Sci Fi film about a low level employee of the\nwords biggest search engine company who is selected by the billionaire\nowner to participate in an experiment in artificial intelligence by\nevaluating a female robot or A.I. This is a fascinating film. It looks\nfantastic and you are quite never sure of the motives of the characters\non display.It's difficult to say too much about it without giving the\nplot away. Brilliant performances from Oscar Isaac and Alicia Vikander\nmake this a really good film. I wan't one of those A.I 's in my\nwardrobe !<br><br>8 out of 10\n"},
{"review": "\nI knew nothing of this film bare a rough idea of the general subject\nmatter. <br><br>It is a great watch. Solid acting performances from all involved\n(interestingly both male leads are played by actors that went on to\nfeature in the Force Awakens but this could not be further away from\nthat Blockbuster genre of movie) and a clever simple story that unfolds\nand twists unpredictably.<br><br>In the case of this movie then less is definitely more. A single set. A\nfew characters. Simple plot. Intelligent dialogue. A very worthy and\nthought provoking film.\n"},
{"review": "\nA young programmer (Domhnall Gleeson) wins a competition run by Nathan\n(Oscar Isaac), a reclusive CEO of the world's largest internet company.\nHis prize, to participate in a ground-breaking experiment in artificial\nintelligence by evaluating the human qualities of a stunning female A.I\ncalled Ava (Alicia Vikander).<br><br>Ex Machina is a brilliant, through provoking science-fiction thriller\nwith memorable characters and exceptional performances by all. It's a\nsomewhat slow burn but with such beautiful cinematography, locations\nand intelligent writing Ex Machina excels in keeping you guessing, and\nhad me for the entire duration.<br><br>One of the most intelligent but low-key science fictions in years, it's\nhard to fault anything here. If only it could have gone for longer.\n"},
{"review": "\nWhen I first saw the 'sci-fi' and 'thriller' appearances, I thought\nmaybe this was another superficially promoted movie about AI. But, I\ngot stunned with its brilliant outcome. I've seen lots of movies about\n'sci-fi' creations, but this one, brings the spectator into the reality\nof intelligence being created by someone. And that's the film essence,\nhot you can deceive the human mind. Awesome performance: The cast got\noutstanding performance during the movie, as we all actually expected.\nI really changed my mind about the Director, and watched a very good\nmovie, with good essence and preview of what might be incoming.<br><br>Brilliant film.\n"},
{"review": "\nAs the title suggests, I was really hoping for so much more. But it\nbecame apparent about thirty minutes in (the dreaded thirty minute\ncrossroads) that this was not going to be a memorable movie, just\nanother tossed on the pile of \"ugh\".<br><br>I love science fiction - and I love science fiction movies that have\ngreat scripts and most importantly take me to places I haven't been\nbefore (e.g. \"Contact\"). AI is a good topic, but I'm still waiting for\nHollywood to create a movie that does it justice. Sadly this movie\nseems to meander at times, slowly without any serious direction\nresulting in a loss of interest. In addition, the movie's focus is on\nthe characters and not so much the science fiction element itself. This\nwould not be horrible if you enjoyed, or found engaging, any of the\ncharacters - but for me that didn't happen. I found them to be either\ncliché or stale.<br><br>The special effects were good, but minimal. The ending was\nanti-climatic. I think this could have been an interesting film with\nthe right script. Unfortunately, it didn't happen.\n"},
{"review": "\nAlex Garland is fast becoming one of my favourite directors.<br><br>Machina is a slow burn, sophisticated, emotionally uber complex tale of\na man who has designed artificial intelligence in the form of Eva, a\nfemale robot/replicant/android/synthetic being that is so far advanced,\nthat one can barely distinguish between her and a regular human.<br><br>The main character is brought in (seemingly) to judge whether Eva can\npass the \"test\". In other words, could she fit in undetected, with\nhuman beings.<br><br>What follows is an intricately charted, intense triangle of\nrelationships that delve in trust, belief, comprehension and doubt.\nCan't say enough good things about this film.\n"},
{"review": "\nI really didn't check up on what the outline was of this film other\nthan seeing the Trailer for it in the theater. I took my girlfriend\n(She was a fan! Clock one up for Sci Fi!) to see it and was very\npleasantly surprised to see how thought provoking and well made the\nfilm was. I remember drooling over the house location they shot at as a\nkid in \"Architectural Digest\" too! I am so glad to see quality Science\nFiction film making a steady comeback again! I am a huge fan of\nArtificial Intelligence and Cyberpunk \"genres\" in film and print and\nthis film is a great addition to both. I really look forward to the day\na truly great dedicated Cyberpunk film comes out again as well.\nCongrats to the filmmakers of Ex Machina, and thank you for the great\nwork!\n"},
{"review": "\nFilm-makers have been making 'big' films about artificial intelligence\nfor decades, but few of them had much serious content. Writer/director\nAlex Garland has a history of coming up with implausible overblown\nideas, but 'Ex Machina' avoids these pitfalls. It takes a scaled-down\nlook at the topic in a savvy sober screenplay which is nicely\ncomplemented by the acting, design and direction.<br><br>A young employee of a hugely successful IT company wins the opportunity\nto spend a week with its technocrat CEO at the man's remote estate. On\narrival, he discovers his boss wants him to assess the personality of a\nfemale android, which has been equipped with advanced AI. The resulting\nnarrative is a noir psychological Sci-Fi suspense film, which plays out\nin a claustrophobic modernist house perched above a rushing river in a\npristine forest wilderness. Each of the three characters has a hidden\nagenda, and manipulates the situation to accomplish their goal. As the\nfilm approaches its intense conclusion, it becomes apparent one of them\nis several moves ahead of the others.\n"},
{"review": "\nWhat makes us \"human\"? Or superior for that matter? And would we able\nto share this with something we created? Call it Frankenstein (monster)\nor whatever else comes to mind, but the movie itself has quite a few\nthings it wants to tell us. You might not feel or empathize completely\nwith the main character (he's a bit shy and easy to impress, but he has\nto be) or with the guy who hired him.<br><br>But especially \"bro\" Oscar Isaak relishes in his role. And he has a\ntough one to play with. It's really a thin line he has to walk here. Is\nhe a villain? Aren't there gray areas too? Should we judge him? Isn't\nhe fun to hang around with though? Full of contradictions, as the movie\nitself. The science fiction idea of it (at least the current moment\nscience fiction, who knows what the future holds for us) is either\nintriguing enough for you or it ain't. Whatever the case, the movie\nlived up to the hype surrounding it\n"},
{"review": "\nAlex Garland (screenwriter of 28 Days Later &amp; Sunshine) delivers a\ntremendous and thought-provoking story with great performances from\n(the always great) Oscar Isaac, (the young in everything) Domhnall\nGleeson, and (the wonderful) Alicia Vikander.<br><br>The film is a slow burner, but when it does burn, damn! It burns\nbright! This film is electrifying, it's terrifying, and yet says so\nmuch about where we are heading in terms of existence and technology. <br><br>Visually, it is stunning, with gorgeous cinematography and great use of\nsymmetry (Kubrick style), the film is beautiful to watch, and coupled\nwith the engaging narrative, this film really does draw you in and\ntakes you to places that leave you gasping. <br><br>It has the feel of a Danny Boyle movie, but yet Garland has placed his\nown stamp upon this film, even if he is slightly paying homage to his\nprecious working relationship with Boyle. <br><br>This film will take you in and leave you thinking \"what the hell\nhappened there?\"<br><br>This film IS a must!<br><br>5/5<br><br>www.backtothebradshaw.wordpress.com\n"},
{"review": "\nFilms like 2001 A Space Odyssey (Won Best Film Of 1968),Short\nCircuit(1986), D.A.R.Y.L. (1985), Deadly Friend (1986), Programmed to\nKill (1987), Steel and Lace (1991), The Vindicator(1986), Robocop(1987\nfilm whose idea was copied from The Vindictator), The Terminator\n(1984), Bladerunner(1982), Hands of Steel (1986), Shadowchaser (Video\n1992), Hands of Steel(1986), I can go on and on....<br><br>In this film, we have a billionaire whizkid Nathan who has developed an\nartificial intelligent android. For some reason, he has made the\nandroid to resemble a woman. Enter Caleb, a programmer working for\nBluebook(owned by Nathan), the world's most popular search engine. He\nis chosen to visit Nathan's secluded research facility in the\nmountains. <br><br>See the film to find out what happens next...<br><br>I have seen a similar film The Machine a 2013 British science fiction\nthriller film written and directed by Caradog W. James. The Machine is\nvastly superior to Ex Machina in every aspect.<br><br>Thanks for reading my review. May you live long and prosper.\n"},
{"review": "\nIt started beautifully and it continued well enough to deserve a 7 or\n8. And then, in the end it ruined EVERYTHING! I know this would be the\nnormal evolution of things in real world, but it's a movie for God's\nsake! Give hope! I was shocked when I saw Ava abandoning the poor guy\nlike that! And if we suppose he is a super- minded coder, why the hell\ndidn't he think to program the system to obey only HIS orders? He could\njust don't tell Ava that, and this way, he would be able to really test\nher about if she was lying to him or not! If she failed, he would prove\nthat as a human was smarter than her. Of course it's the emotional\npart, but he showed stupidity trusting her... Now, imagine a walking\nA.I. to act like a human using the intelligence of a machine! In the\nway things went on in this movie, I give our planet about 20- 30 years\nof real life.\n"},
{"review": "\nOne of the best sci-fi's i've seen, great take on the robot vs human\neventual existence in the realm of Blade Runner or Under The Skin more\nthan Terminator 2 (T2), where the robot / alien wants to experience\nwhat it's like to live like a human\u0085 brilliantly shot, stripped back\ndialog &amp; tight mood keeping u waiting for more, amazing performances\nfrom the 3 leads Alicia Vikander, Domhnall Gleeson, Oscar Isaac\u0085 <br><br>Need to see it again to finalise my thoughts &amp; feelings towards it\u0085 but\ni've got a strong feeling it's going to be even more engrossing 2nd\ntime around\u0085 love the minimalistic atmosphere throughout\u0085 the set, the\nphotography, the sparse soundtrack / sound design, truly captivating\u0085\nbest sci-fi i've seen since Under The Skin &amp; before those 2 films there\nhasn't been much for a long time\u0085 <br><br>http://samuellbronko.tumblr.com/post/119843812982/ex-machina-2015-\nalex-garland-8-9-10-one-of\n"},
{"review": "\nThis movie is all about the very first question - Can artificial\nIntelligence created at par with Natural? Many movies have always shown\nintelligent machines behaving like humans and capable of thinking. But\nthis movie talks about the evolutionary concept of machines.\nBrilliantly crafted.<br><br>The script is not at all complex. Straight forward where objective is\nwell described. The real thrill is how is has been executed. The\ndialogues are very simple yet intense which explains and debates lot of\nlogic about \"what exactly a human(brain)'s definition is\"? What is the\nthreshold a machine must reach to , to confuse us whether it is real of\nartificial if disguised? the location shot at adds up to the depth of\nthe movie. Well enacted by all characters.<br><br>Cheers!\n"},
{"review": "\nA stylish take on Shlelly's Frankenstein exploring the idea of the\nTuring Test.<br><br>Taking a job with a rich eccentric computer genius away from\ncivilization may seem like a dream job at first, but something is\namiss, otherwise there wouldn't be a movie.<br><br>Exactly how does one determine that one is talking to a real person and\nwhat that really means to both parties and this isn't just about\nrobots, but people as well. At what point does one lose one's\nobjectivity when doing a job that should be just a job, but becomes far\nmore than the job.<br><br>Some things about this movie don't make much sense, but that kept the\nbudget within reason and this movie is tight and uncluttered, a sterile\nset for a sterile relationship.<br><br>Who the hell builds a robot without an off button?<br><br>Somehow, AF709 may have been a better angle to play and closer to AI.<br><br>Not great, not horrible.\n"},
{"review": "\nA brilliant post-modern retelling of Genesis 2.0 with an unsettling\ntwist. Ava is Eve. The invited guest is Adam and the unpredictable,\ndangerous boss of Bluebook is God. The new world is created in 7\nsessions between Adam and Eve. But who is tricking who? Who is evil and\nwho is good? The Bluebook boss is clearly deranged - as is visualized\nby his hair inversion (too full beard and bald head, as opposed to the\nshaved face and full head hair of his guest). But perhaps the Bluebook\nboss is right after all. Nasty, perhaps, but right nonetheless. Ava and\nher cohort are clearly abused by their Bluebook maker, but perhaps they\nare less innocent than they look. The boss treats his female employee\nlike a robot, which contrasts with how the invited office worker\nhumanely treats Ava - who must pass the Turing test herself. How well\nwill Ava pass the Turing test? Or should she perhaps be called Lilith?\n"},
{"review": "\nWOW THIS MOVIE KNOCKED MY SOCKS OFF!!!! all of it was just so\nbrilliant! so genius!! I have a psych degree and socio minor too, so I\nESP love these type of twisted movies. be prepared to be mystified,\nanxious, nervous and excited as you watch. I'm speechless and appalled\nat how magnificent this film was. directed, produced and chosen cast\nwas all perfect! I watched it 2 days ago and I'm still in awe. I can\nusually guess things in movies too, but this one was surprisingly u\npredictable. while I was watching, the story of Frankenstein came to\nmind. btw, having an edible with this movie probably made it trippier\nand I could not be any happier with that choice of mode! haha. this\nflick is definitely in my top 5! right up there with memento and black\nswan.. hmm, might even me #1 actually.......gotta watch it a second\ntime to know for sure :)\n"},
{"review": "\nSo the future is here and artificial intelligence translates to female\nsex toys for hipster boys. This movie is an emblematic example of why\nwe need women directors, writers, inventors, venture capitalists. Women\nliterally need to invent a future for themselves or risk continuing to\nbe defined like the makers of this movie define them. One keeps waiting\nfor the clever twist but there isn't one. It's as grim as it looks and\nboring to boot. Throughout the movie the feeling pervades that the\nstoryteller isn't qualified to tell a story about women, artificial or\nnot. It is in the end just a story about male desire at its most\nquasi-intellectualized, misogynistic, blind to itself level.\n"},
{"review": "\nWe went to this movie ready to love it. We came out depressed.<br><br>This is what we've all been pining for: a new, creative concept\nexecuted with excellent film making and effects. It's visually\nstunning, combining the highest tech with a good back story in a near\nfuture world in a convincing way. The robot is intriguing, sexy and\nmostly seems possible. The inventor seems as feasible as Mark\nZuckerberg. We're ready to go along for the ride.<br><br>But then, comes the plot, and there's nobody to root for. It's a\nnihilistic world view acted convincingly by actors who create realistic\ncharacters. If you form an emotional connection with any character,\nyou're left out to dry. The movie left us both bummed out and\nimpressed. And where's the fun in that?\n"},
{"review": "\nIt starts off mysteriously enough with some resemblance to fear of the\nunknown in an interesting setting. <br><br>Ends with mild unpredictability. That said, it was predictable to most\nextents. <br><br>The movie continues in a very slow monotonous manner, but I suspect\nthat the film makers intended to portray some type of human/machine\nduality throughout. It didn't work very well. <br><br>The music was kinda fun for about 5 seconds. <br><br>Find some series of Outer Limits with AI. It is much more interesting\nand engaging. The stories also seem more \"fleshed-out\". Something a\nmovie should definitely win when competing with a series.\n"},
{"review": "\nAs a life long hard-core sci-fi fan, I can state that the premise is a\nvery old one. Lately, we are seeing a flood of movies about\nhumanity/humans integrating with bionics/computers. The actors were\ngreat and the sets added to the mood. However, the pacing is slow and\nthe dialog is too sparse for the subject. Much more could have been\nmade of the creator/AI relationship. At least, Ava didn't get\nridiculous super powers. Bottom line is that I am glad that I stuck\nwith it; although, in the beginning, when the computer mogul had to\nexplain what the \"Turing test\" is to a \"brilliant\" coder, I almost\nbailed. By the time, the ridiculous and illogical sexual aspects\nemerged, it was too late.\n"},
{"review": "\nHardly any excitement/suspense. For the most part nothing really\nhappens besides talking for almost 2 hours. It's all a bit flat. <br><br>The scary moments never get really scary. The drama is never really\ndramatic. The emotions never really engaging. The location not all that\nexciting. The atmosphere a bit sterile. The plot twists are a bit\npredictable. The main actor (Caleb) never really convincing. However i\ndid like the other two main actors, especially Nathan (the creator).\nThey both did a fine job. The conversations between Caleb and Ava are\nvery subtle and nicely done but there is simply too much of it.<br><br>It all falls just a bit short. It is by no means a bad movie but it's\nmissing some spice. This could have been so much more. Sadly the\npotential is wasted.<br><br>All in all it feels a bit like drinking lukewarm beer. It has all the\ningredients to make it good but it's missing something...\n"},
{"review": "\nSaw the trailer and was very underwhelmed. Again, with this guy, from\ntwo faces of January.....he was half decent in that but only because of\nthe LOTR guy. The LOTR guy is a boss at acting. This other guy, no not\nso much. Same issue with that 80s crime drama, he simply can't nail\ndown a character. I believe it's his physical attributes...he is\ngetting completely miscast in these roles. He should be cast as like a\ncowardly henchman in a minor role. Instead he keeps getting these main\nroles lol. Anyway, the other main actor in this movie was extremely\nboring. Completely surface-level. And the main android chick...mehhh,\nshe was an android....but she played it like a human...the movie was\nbasically borderline chick-flick ah la other movie that was called sci\nfi with the guy from the village in it....with the scar on his lip.\nThese aren't sci fi movies give me a break. The entire movie revolves\naround using google search data to make an android\nbrain?...facepalm..It's really a 4/10 but the visuals were nice so it\ngets a D- 5/10\n"},
{"review": "\nRecommended for the serious film buff, however if your science fiction\nmovie is more action based like transformers, this film is not for you.\nYour interest level will soon evaporate. If you are prepared to however\nto give this film the time, Garland take on the nightmare consequence\nof android self-awareness has much to admire. Intelligent dialogue\ncombined with a compelling storyline set in a classic confined location\ndelivers the goods. The android in question Ava is brilliant\ncombination of Cgi and excellent acting from Alicia Vikander. This can\nbe seen most tellingly in the scenes where she seduces and manipulates\nDomhnall Gleeson the computer programmer who thinks he is carrying out\nthe Turing test on her. The dynamic scenery used in film adds to the\nimpact of the film. Excellent direction by Garland and the rat in the\ncage in ending also adds to the package.\n"},
{"review": "\nSpeechless!!! <br><br>Oh my goodness! When i saw the trailer on YouTube it got my attention.\nIt seemed like a Dramatical SiFi romance movie so i waited for this to\nrelease. <br><br>The mysterious Artificial Intelligence robot AVA (Alicia Vikander) was\nso cute on this movie. She is smart and intelligent. <br><br>I'm gonna tell you one thing, that if you are thinking that this is a\nromance film that you are absolutely wrong .<br><br>Ava, my god what is she!! She was beyond my imagination on this movie.\nI was speechless at the ending of this movie. Do you know how many\ntimes i watched it? Yes 7 times!! <br><br>Do you understand science and artificial intelligence? If yes, then\nthis is a your types of movie. Watch it and you will love it\n"},
{"review": "\nWho will win the battle of the Artificial Intelligence and the Humans?\nDoes A.I. understand love? Can we have an A.I. which is capable of\npassing the Turing test? Ex machina tries to answer these philosophical\nunsolvable questions!<br><br>If you have watched Steven Spielberg's A.I. Artificial Intelligence\n(2001) movie, you'll find a lot of common things between that and ex\nmachina. However, I love the fact how two movies showing the same idea\ncan reach to different conclusions. <br><br>To me the battle between A.I and human being is exactly like the\n\"battle of the bastards\"! Who is the father of us? GOD? If we humans do\nnot have any father so we are somehow bastards, If A.I. is our son, the\nson of a bastard is also a bastard! so...<br><br>I think we should wait for future to find the answers to these\nquestions!\n"},
{"review": "\nThis movie provoke - those who think - to challenge our limits of what\nwill be alive?? Are we all machines??!! What is/are\nself-conciseness??!! I think that from the side of Reason or\nPhilosophy, those question will keep their status of searching or\nresearching of answer or answers! But there is a side that Religions\nguys can not accept. Religions STOPS asking questions when Their god,\ngods, paradise enter into the Theater. And that is the indoctrination\nthey provide in Religion schools. This could be easily found in\nMilitary schools to. Where the Commander knows much better that a\nsoldier or a sailor. Their paper is to obey. And questions are simply\nwrong!! You also can be punished to ask questions.\n"}
]