[
{"review": "\nOK,it's not that part 1 was good,you actually knew it would suck,but\nthe 2nd really grinds my gears. <br><br>You have in your hands a civil war,the final battle into the heart of\nthe capital,and you spent 2 hours of your life watching your main\ncharacter taking a walk in a war zone. <br><br>And with all that time strolling,you have no character development,for\nnone of them,just a few moments that the movie is like \"Ok,from now\non,that's how things are\". <br><br>I watched this for closure,i wish i hadn't.<br><br>I didn't expected it to be a great movie,just a good action one,and it\nfailed.Miserably. For goodness sake,London has fallen had more\ncharacter development than a book based quadralogy,LOTR had less\nwalking..good riddance to the series.\n"},
{"review": "\nThe Hunger Games: Mockingjay - Part 2 is a film without any artistic\nintegrity. It was purely made to grab as much cash from its audience as\npossible. You can sense this in the film which does not have much of a\nplot, scenes that are purely filler and the story just crawls because\nthe book that it is based on has been split into two which means more\npadding than a model wearing a wonderbra.<br><br>With Panem in chaos Katniss (Jennifer Lawrence) plans to assassinate\nPresident Snow (Donald Sutherland.) Snow meanwhile wishes to spring a\ntrap to finish off the rebels. Peeta (Josh Hutcherson) is volatile as\nhe turns his anger towards Katniss. Alma Coin (Julianne Moore) the\nleader of the rebels who plans to usurp Snow as President has her own\nagenda. You could say she has two sides to the coin.<br><br>Some of the action is humdrum and poorly lit and Katniss's use of the\nbow and arrow is almost laughable in this film. Given the first film in\nthis franchise was a decent film, it has been disappointing to see the\ndecline in quality to the sequels.\n"},
{"review": "\n-- this review may contain spoilers --<br><br>How can a reviewer say \"not the best in the series\" and then give it 10\nstars? 10 stars is perfection, not as good as perfection is not 10\nstars... In my opinion it was far from perfect though not terrible.<br><br>I have loved the Hunger Games franchise but this film let me down. For\nmuch of the film it reminded me of Frodo's (boring) journey to destroy\nthe ring except that Frodo actually does get there in the End. Katniss\nsets off to kill the president and spends most of the film trying to\nget there but then doesn't, in fact she is beaten by the resistance,\nwho managed to get through all of those traps that she could not and\nstill get there quicker. She then wakes up to find the war is over. The\ntwist at the end is so well signposted that it doesn't take much\ninferring leaving the happy ever after.<br><br>Special effects and infinite arrow archery skills ultimately don't make\nup for the lack of story and obvious plot holes. I cannot fault any of\nthe actors, they did the best they could with a bad script.\n"},
{"review": "\nOK, let's get right to it. This is not good story telling. I need more\nlines so, the actors, director, and whatnot can only work with what\nthey are given. And, in this case, they weren't given very much.<br><br>Almost everything in the movie has been done before except better. I\nwas joking to my wife when I said there will probably be some zombies\nor similar types attack them when they were underground, and to my\nsurprise (because I really was just joking) a horde of underground\n\"zombie like\" creatures appeared and of course started trying to kill\nthem.<br><br>This is what you would call an expensive \"chick Flick\". The hero is a\ngirl. The commanders are girls. The only real leader was Snow (Donald\nSutherland), and by the way, I think he did a great job as a villain.<br><br>I guess my main complaint is that this is just a bunch of boring,\nclichéd, yawn-producing crud.<br><br>Also, I just asked my wife her opinion of the movie, which we just\nwatched last night, and she said she doesn't remember what it was\nabout, and she doesn't have Alzheimer's. So, I guess that about sums it\nup.\n"},
{"review": "\nMy main concern before seeing this movie was whether splitting the\nfinal instalment into two movies would actually work or whether it was\njust a monetary decision. The answer is unfortunately the latter. I\nreally like the first movie, which was very personal and emotional.\nCatching Fire upped the spectacle and action brilliantly, but\nMockingjay Part 1 just felt like a waste of time which Part 2 couldn't\nquite reconcile.<br><br>As a conclusion to the series, there were a number of points it needed\nto settle - the battle against the Capitol, Katniss's opposition with\nSnow, and the Peeta/Gale love triangle - and each one was\ndisappointingly resolved. The four movies have been leading up to these\nmoments, and they didn't pay off. Not only are they emotionally\nunsatisfying, but they sometimes feel quite out-of-character and\nunconvincing.<br><br>Having said that, some of the action is terrific (although the trailers\nspoilt most of it). Jennifer Lawrence can do no wrong, and she is\npossibly more uplifting than ever in this film as a strong, young,\nfemale role model. Also it was moving to see Philip Seymour Hoffman's\nfinal performance overshadowing the brilliant Julianne Moore, whose\ncharacter arc was disappointingly predictable.<br><br>Although Francis Lawrence is great at directing big, explosive action\nset pieces, the series is too overstretched and baggy. The characters\nand audience alike feel weary - had Mockingjay just been one concise\nmovie, some of the problems may have been alleviated. Unfortunately the\nfinal product is just a bit long, unconvincing and unsatisfying. Still\nbetter than Part 1 though!<br><br>3/5\n"},
{"review": "\n6.7 /10 from 138,754 users. I would say it is a decent rating for\nsomething that is almost like a mini-serial. There have been so many\nparts I can barely remember what it is all about. Let's see if it will\nbe of any joy.<br><br>7 minutes - it starts like a TV-series not a film. I doubt anyone would\nwatch it without previously seeing the first part, but it starts right\nfrom the moment where it left off <br><br>24 minutes - oh now I remember. This is the film about how propaganda\nworks and how easy is to manipulate masses <br><br>1h 14 minutes - there is nothing to complain about really. It feels\nlike any other film from the series, just decent <br><br>1h 31 minutes - I do not know if the film intends to insult my\nintelligence or just the director is missing some of it <br><br>1h 45 minutes - and it started to intrigue me a little bit <br><br>Meh... the ending was nice, the series and this one in particular not\nso much.<br><br>tgchan's rating: 5 /10\n"},
{"review": "\nAfter having watched three previous \"Hunger Games\" movies and enjoying\nthem very much, I was surprised how much I was ambivalent about this\nfinal installment. After all, I spent all this time waiting...for\nthis?! I think PART of this is natural...a series is over and there's a\nsense of disappointment because of this. However, I think it's deeper\nthan that. In \"Mockingjay: Part 2\" there is tons of action (like the\nprevious films) but little else. I assume so much of this is because\nthe book was split in two--most likely to scrape every last dime out of\nthe franchise. And, as far as the surprises and machinations, I\nexpected pretty much all of them...even though I hadn't read the books.\nAll in all, not a bad film but one with less substance and lots and\nlots and lots and lots of explosions and all...but not much else.\n"},
{"review": "\nAhh, yes, our government, the real world. I love how Hollywood is\nshowing us where our country is heading towards and the people are\nclueless to connect the dots between this movie and the real world.\nWhile our domestic military gets stronger (DHS, Police State, etc.),\nthe middle class starts to die off. A huge gap between the rich and the\nrest of us... and how they control us using the television, just like\nthe movie. And who are these domestic terrorists? Those who believe in\nLiberty, life, and the pursuit of happiness. The ending was expected,\nbut a twist that I cannot wait for in the next movie. And please, when\nyou're watching these Hollywood movies, try and find a connection to\nthe what is happening in the real world.\n"},
{"review": "\nI liked the first, I loved the second, I thought the extended trailer\nwas silly (shoot down high-tech planes with a bow, also called\nMockingjay Part 1), but then I was in for an ice cold shower. I haven't\nfelt like this since listening to Jar Jar Binks.<br><br>The first two Hunger Games movies prepare you for an epic battle\nbetween the rebels of District 13 against the Capitol, which could just\nas well be the Empire of Star Wars, led by an equally cunning\npresident/emperor.<br><br>However, instead of using all the lore that has been carefully built\nup, especially in Mockingjay Part 1, the producers/writer decided to\nkeep the main cast as far away from action as possible. The heroes\nsuddenly become actors instead of the warriors they had been in the\nprevious movies. Everything is fake and nothing they do (or not do) is\nsupposed to affect the story. On purpose! I have no idea what happened\nhere. Did the writer die and someone else had to finish it? Did they\noutsource the production to a galaxy far, far away from the first two\nmovies? I simply cannot believe that this was an accident. There has to\nbe purpose to this letdown and I wish I knew what it is, but either\nway, Mockingjay Part 2 is the biggest disappointment since The Phantom\nMenace.\n"},
{"review": "\nI was at first very disappointed by the last movie (Part 1) because I\ndidn't come to understand how beautiful and accurate this move depicts\nthings. It is unbelievably realistic in its depiction of a character -\nnamely Katniss - the situations, expressions, conflicts and thinking of\nKatniss are not presented on a plate for the viewer, this is new and\nwonderful. <br><br>At first I had problems adapting to this kind of cinematic experience\nand to seriously dive into Katniss' character. After watching half of\nthe movie my mind wrapped around the style and storytelling involved\nhere. It is absolutely amazing and Jennifer Lawrence is the best choice\nfor this movie. She absolutely nailed it. <br><br>I believe that Hollywood has much to learn on how avant-garde a movie\ncan be without breaking the ground rules of cinema and this movie is\nthe best example.<br><br>The amount of realism is first and foremost coming not from special\neffects, but from very expressive, real and living scenes and seemingly\nrealistically troubled characters.<br><br>Hands down for one of the most real scenes where Katniss is crying. It\nis dirty, exhausting and as real and believable it could be because J.\nLawrence is NOT an uncanny beauty, she is not the unrealistic hero, she\nis so much better! She steps on the same step as the audience and then\ndepicts how shattering her experience of loss and the revolution is.<br><br>I loved it!\n"},
{"review": "\nThe Hunger Games series has been a roller-coaster ride of sorts when it\ncomes to quality. The first movie was OK that fell flat in a lot of\nareas, the second movie was a massive improvement, and the third movie\nwas just boring. Now we have the climax to this whole build up and at\nthe end it was rather anticlimactic.<br><br>Good: The action set pieces were pretty good with a lot of money thrown\nin to make them grand in scale. Even the Aliens style sewer scene was\nentertaining as well. I'm glad that the build up paid off in some areas\nsuch as the war in the Capital anchored by Jennifer Lawrence who is\nstill good in the role.<br><br>Bad: The movie felt anti climactic with the events feeling rushed\nespecially developments involving some characters which needed more\ntime to build up. It lacked the emotional impact that the prior three\nmovies was building up to at this point. The subplot involving Peeta\nand Katniss once again just weighed down the movie like the previous\nfilms because I just can't get into it and it drags the scenes when it\nshould be revving up.<br><br>Overall, it lacked the impact needed to be a great finale, but it is\nentertaining enough to watch if you've seen the other films.\n"},
{"review": "\nI thought this was a fitting conclusion to the series. I might not give\nthis a 9/10 normally, but I want to offset the people who give it 0\nbecause it isn't Rambo. Honestly, I think 7.5-8.0 is appropriate for\nthis movie. 6.7 is too low.<br><br>Major Spoilers<br><br>The ending was severely out of place, though. For a series that was as\ndepressing and gritty as this one, a happily ever after in a field of\nwild-flowers felt starkly out of place. <br><br>Personally, I don't think Peeta and Katniss should have both survived.\nThrough the entire series I was begging everyone with a weapon to kill\nPeeta for Katniss's sake. It almost feels like a betrayal that they\nshould end up together.<br><br>Many people have said that Peeta is the worst love interest in all of\nmoviedom, and I would be hard pressed to disagree. He was always a\ncoward and virtually useless from the word go. That a champion of the\npeople should sacrifice so much for a coward that killed her friends\nand tried to kill her repeatedly just didn't make sense. <br><br>I really expected that either Katniss or Peeta would have to sacrifice\nthemselves to save the other, and I think the ending would have been\nbetter that way.<br><br>But aside from that, I thought the movie (and the series) was\nentertaining. Other than the plot holes that are part of every movie\never made, it was tight. There was adequate action, and it never felt\nout of place. There didn't seem to be action for action's sake, in\nother words. <br><br>There were some great story arcs, and some good twists. All-in- all,\nthis would be a 9/10 movie/series if the ending wasn't so out of place.\n"},
{"review": "\nFast paced, emotional and epic, The Hunger Games finale brings the The\nHunger Games series to an awesome end! The Hunger Games: Mockingjay\nPart 2 picks up right after Part 1 and quickly kicks into high gear\nwith everyone gearing up for war. The score, the action, and the\nemotional death scenes really bring the audience to enjoyment. The\naction sequences are quite good but not enough are thrown into what was\nsupposed to be an all out war movie.This is the second best entry in\nThe Hunger Games series, following Catching Fire. In the end, fans like\nmyself who have grown up with this series will find that the games have\ncome to their emotional end. So is this review completely positive? No.\nBut there are much worse reviews to give.\n"},
{"review": "\nSaw the movie today. Expectations were high from this last installment\nof Suzzane Collin's literary sensation : The Hunger Games - Mockingjay\npart- 2. And I must admit I liked it very much. I had liked every part\neven the much criticised Mockingjay part-1. But this was really good,\nreally an epic conclusion. Though all the actors gave their best shot\nbut Jennifer Lawrence was superb! Her expression, way of speaking was\ntoo good. One of the most talented actress I must say! Film was very\nwell directed. It started from where it previous part ended. Knowing\nthe story does prepare you mentally strong for the upcoming\ndevastation, I wish I hadn't known it.If you are looking just for\naction scenes so yes they are there but limited. It's a political drama\nof course. So overall a very nice movie. Happy Hunger Games.\n"},
{"review": "\nSuch a long wait for The Hunger Games: Mockingjay - Part 2 (2015), was\nit worth the waiting? To answer that I'd need to point out a few\nvariables. First of all I do give this film credit for the following\nitems: scenery, acting, and pointing out that most of humanity is\nsheep; that being said let's get the review going.<br><br>We were highly anticipating this film being as where part 1 left off,\nwe had high hopes that part two would at least be as strong as the\nrest; sadly this film plummeted. The Hunger Games: Mockingjay - Part 2\n(2015) is a very slow paced film with 3 actual action scenes; most of\nthe film looks as if it were filmed inside one location of green\nscreens as the cast slowly moved from right to left for scenery\nalignment. The story was the weakest of all the before films, and it\nbasically ended with with almost 18 minutes of credits.<br><br>I'd have to say this film wasn't worth the wait, I feel that the fans\nwere left hanging to see a very slow money grabbing ending.\n"},
{"review": "\nThe best movie out of the series! I wasn't sure how the movie would\nplay out compared to the book but it caught me by surprise. Most\nendings to book made into movies are so horrible but Hunger Games Part\n2 was not a disappointment to me. Everything they did was exactly what\nI wanted them to do. They added on a little extra ending part and\ndidn't have to but I was already completely satisfied by that time that\nit didn't even matter and thought it was kinda cute they even did that.\nIt played with my emotions perfectly and I would recommend it to anyone\nwho is a fan of the series. This final movie really makes me want to go\nout and get the whole collection and have a marathon of all the films\nat home on the weekend :)\n"},
{"review": "\nThe Hunger Games series has finally come to an end with the fourth and\nfinal film in the franchise and serves as a continuation of Mockingjay\n- Part 1. Part 2 makes up for Part 1's lack of action by being the\ndarkest, most violent and grittiest Hunger Games film, even with the\nstandards set by the previous films and succeeds in ending the saga in\na suitably epic fashion. Mockingjay - Part 2 finds Katniss leading the\nrebels to the Capitol aiming to kill President Snow. The Gamemakers\nhave rigged the entire city with lethal traps to make sport of their\ndeaths, making it the most dangerous Hunger Games yet. If Part 1 was\ntoo slow or lacked adequate action, Part 2 is heart-pounding from\nbeginning to end. The action scenes are more violent than anything seen\nin the series yet, making any deaths even more gut-wrenching. Fans of\nthe series will find it hard to watch at times, and if you're like me,\nyou'll be gripping your seat or hiding behind your shirt for a good\nportion of the film. The Hunger Games: Mockingjay - Part 2 ends one of\nthe most exciting and relevant franchises today in a gripping,\nemotional and brutal way, and it might be the feel-bad movie of the\nyear.\n"},
{"review": "\nMokcingjay part 2 has a fantastic, brutal and honest look at the\naffects and harshness of war, coated and enriched with a deep and\nthoughtful exploration of the series' dark and gritty themes. It pushes\nthe 12A certificate it owns to the max and uses it to its advantage.<br><br>The film's action is spectacular. Exciting, and scorchingly intense,\nthey further emphasise the brutality of war. As usual, the special\neffects are handled well and the film is shot in a swift manner. <br><br>The central performances are stellar, with Jennifer Lawrence shining\nonce again both as an actress and as Katniss. Returning cast do an\nexcellent job, Elizabeth Banks, Woody Harrelson, Josh Hutcherson, Liam\nHemsworth, Jena Malone, Philip Seymour Hoffman and the rest of the\ncast. <br><br>The cinematography is great. The film is well filmed, colour graded and\nis given a slicker and darker aesthetic.<br><br>The script is a bit skeletal, with some of the dialogue being more\nfunctional than empowering, but overall the cast really make good use\nof their material.<br><br>The third act is shocking and surprising, elevating this film to new\nheights. <br><br>Overall, fantastic work from Francis Lawrence and all his team; this\nfilm is well acted, well filmed, well paced, intense and refined with\nits dark and gritty drama / social commentary.<br><br>Goodbye Katniss and crew, it's been a fantastic journey.\n"},
{"review": "\nI watched this because I enjoyed the first two. The third was a decline\nfrom the Hunger Games 1 and 2 but so much time invested compelled the\nwatching Mocking Jay 2. I was hoping for a great ending for such an\nanticipated movie and was greatly disappointed.<br><br>The plot was almost non existent and just rode on the waves of the\nother movies. The story line was disjointed and herky jerky. The\ndevelopment of the love story was terrible and did not evoke the\nemotion displayed in the first two. Very let down...<br><br>I did not read the books, but I'm sure that those true fans were\ngreatly let down. I wish they just took out Hoffman altogether than the\nway they pieced him in with 60 seconds of total airtime.\n"},
{"review": "\nFinally we get the final episode of The Hunger Games saga. I did like\nthe first ones better but is that not the case with most of the movies\nthat have continuing parts? I watched this one because I needed to know\nthe end of the saga and I guess it's just okay, no big deal at all. You\nall see it coming from miles away. Jennifer Lawrence is apparently\nimpossible to kill. The action scenes are okay but the movie is again\ntoo long to be interesting all the time. The only really good reason to\nwatch The Mockingjay part two is to watch the last movie where Philip\nSeymour Hoffman appears in before he died. I hope this one was really\nthe last one because you can not milk a story forever.\n"},
{"review": "\nWow. I think this has got to be one of the most disappointing ending\ninstallments to a film series I've ever seen. The previous films build\nthis installment up so much that you actually expect it to be the\nultimate one of the 4-film series, with plenty of action, suspense, and\ndrama, and given the way the previous films unfolded that expectation\nwouldn't be unwarranted. Unfortunately the exact opposite happened and\ninstead of getting a really exciting &amp; thrilling end film, we get a\nvery slow, somewhat dull, melodramatic experience. I mean the first\nmoment of any thrills is about 75 minutes in and yet only lasts for 10\nminutes, and the thing is, those 10 minutes are the most exciting the\nfilm gets.<br><br>I saw a couple of comments from people where they said this is \"Battle\nRoyale II goes all Twilight\" and \"Battle Royale with cheese\" in\ndescribing this film and I think those are two perfect ways to sum this\ninstallment up, especially with the romance line and the way Kayniss\nwent from Peeta to Gale then back again.<br><br>After the completely over-hyped first installment, I found that the\nseries was actually getting better, which was unexpected due to how\nlame the first film was. Catching Fire was MUCH better and blew the\nfirst film out the water. The third installment dipped a wee bit but\nwas still decent enough and I thought it set everything up for a good\nclimactic end film. I thought wrong because instead of a great climax\nit was more of a damp squib. Even the end scenes were about as exciting\nas a wet weekend in Grimsby. The whole film was just one big\ndisappointment, especially given the build up from the previous three\nfilms and the whole \"revenge\" theme that was portrayed.<br><br>If you want thrills you won't get it here. If you want action you'll\nneed to look elsewhere. If you want a boring melodramatic Twilight type\nof film with some cheesy romantic undertones then this is for you.<br><br>This is definitely not the ending I was hoping for.\n"},
{"review": "\nWhen I first went to watch The Hunger Games, I invited my girlfriend to\nwatch it with me. Her response was \"I do not like that kind of movies\".\nShe had no idea. We went and watched it and she said this was one of\nthe best that I have watched in a long time. we were waiting for the\nsecond Hunger games and it was a good film, but couldn't surpass the\nfirst. Now, this is fine with sequels, usually the second one does not\nreach the level of the first (excluding LoTR, Terminator etc.).<br><br>Now both mockingjay movie parts we completely off; Part 1 was a\nmediocre, to say the least, and actually it was watchable because there\nwas part 2 to complete a half-burned pie. Watching part 2, I must say\nthat they took a very very good story and destroyed it.<br><br>Snow was an excellent character (my favourite) since he was a bad guy,\nbut he wasn't making the usual bad guy errors in strategic thinking.\nThe \"interim\" president did not show her vicious side. And all the\nother characters were just wrong.<br><br>It is watchable but it did not cut it\n"},
{"review": "\nBetter writing should have been implemented for the strategies,\ndialogue, and the awkward romance element forced to fit in. <br><br>The first movie was the best of the bunch, this being the finale... to\nsay it was disappointing in its execution would be an understatement.\nToo much focus is spent on special effects while attention to good\nsubstance is lost in this installment. In short, it's as if Michael Bay\noversaw this tragic mess. The acting (If most of the dialogue is\nexcluded) was not bad at all and clearly the costume designer had fun\nwith these well put together looks. Characters were perfectly made up\nto look suitably roughed up. I appreciate that they weren't more\nfocused on glamor in the action scenes than grit. The writing is still\nwhat I have a problem with and that is the meat of any film. The issues\nI have with this film would have turned a much better book worthy of\nthe silver screen into a silly soap opera with guns. As it stands the\nbook even as a y.a. novel needed improvement but the film could've done\nwell what the book did poorly, enhancing it to be even more exciting.\n"},
{"review": "\nThis was OK, not brilliant. Really, nothing will ever capture the\nbrilliance and excitement of the first movie.<br><br>This was so predictable that I kept looking for the 'real' story, but\nit never came. Step by long, long step, the obvious kept on coming and\ncoming and coming. Naturally... the producers and the writers and the\nwhole shebang knew that we'd all come by to definitely see the last\nmovie... and apart from spending lots of money on explosives, they just\nfed us a load of formulaic boo ha.<br><br>Just about all of the actors looked like sleep walkers, the visibility\nwas so dark that sometimes I was just guessing what was going on.<br><br>Only OK. Wish I hadn't bothered, really.\n"},
{"review": "\nThis is definitely better then the 3rd Hunger Games book, but still sad\ncause of what happens to Katniss' sister. It's a good thing though that\nthis movie didn't show herself trying to commit suicide like she was\ndoing in the book. Also the one really evil villain in this movie was\nPresident Coin cause President Snow did those horrible things for\nreasons. It's also very nice seeing Katniss with Peeta and a new\ndaughter of their own after the way the world was when the Hunger Games\nwere around. This is definitely a really good movie here and Katniss is\ndefinitely one of the best movie heroes ever. Enough said here. Enough\nsaid.\n"},
{"review": "\nHunger games is a series that I grew up reading. It was the my Harry\nPotter. Many people might say it is nowhere near Harry Potter in\nquality but that is where I must disagree. We have a society of\nfollowers who once something get popular they all start jumping on the\nband wagon of hate. The Hunger Games series is an incredibly written\nseries with a film full of terrific actors. With strong lead women\n(Jennifer Lawrence) this film helps raise up the role of women in\nHollywood. Also, lets not forget there is a supper cute supporting male\n(Josh Hutcherson) Hunger Games is a series that will never be forgotten\nand that will always be respected and remembered as the film the made\nus hang off the edge of are seats.\n"},
{"review": "\nHaving read the books, I already knew the finish of the movie. I was\nmore or less disappointed after I'd finished the books, but the way\nthis movie is done elevated the story. The ending, which many reviews\nand people didn't like, I found to be very well done. Brilliant\nperformance by Jennifer, Josh and Liam, not to mention the others who\ngave their all into this movie. Finnick's death was probably the most\nsaddening one, but that of Prim and Katniss' breakdown was amazingly\nshot. Jennifer Lawrence gives one of her best performances, and we\nshouldn't expect anything less from her. Josh Hutcherson's character\nPeeta is wonderfully crafted, making him one of the best heroes\n(alongside Katniss). Gale, unlike in the books, actually showed some\nremorse after Prim's death, and that all being thanks to Liam's acting\nskills. That all said, I've found that the entire series was greatly\ndone, and given some deep thought before being transformed into a\nmovie. The choice in actors, in music, effects, directing, production\netc, are sublime.\n"},
{"review": "\nAs I watched this film, I could see how much the 4 movies fit into one\nbig plot. I would not be surprised if a sequel to the original Hunger\nGames trilogy, of a prequel. Overall, I gave this a 9 due to the run on\nthe the movie. In my opinion, the movie should be an attention grabber,\nkeep it tight with suspense and a resolving solution at the end (if\nthere are no cliff hangers). The beginning of the movie got my\nattention when they removed the neck cast from the girl with her neck\npurple (sorry for the spoilers). But then after that, she suddenly\nseems fine. Things like that don't heel that fast. Next time, you\nshould think about what would happen in real life with a neck like\nthat.\n"},
{"review": "\nAll the series of The Hunger Games had a main element which was the\nemotion for \"riots\", \"stand up for what is yours\" while we all, mostly\nme expected the FINAL episode of The Hunger Games this to be the most\nexpressed element they lacked of it a lot. Most of us while watching\nthe the movie will find it boring impatiently waiting for what will\nhappen at the end. It is disappointing to see such an awful final movie\nof the series Mockingjay. If i was the director when i would be seeing\nthe movie for the first time i would not publish and either make a\nwhole new film or not publish it at all. This film is meant for teenage\ngirls which \"fall in love\" deeply in some of the characters and it\ndisappointed all other \"fans\" which were having big expectations for\nthe final film.\n"},
{"review": "\nI heard a lot of bad things for this movie at first that it was boring\nand that it had zero action and the reviews on Rotten Tomatoes started\nwith a very big rating which it was around a 92% but then it kept\ndropping and dropping and now the movie has a 71% which is at least\nbetter than the last movie had which it was a 65% and then the trailers\nkept me entertaining. Last night i went to see the movie and it was\nAMAZING so much great action, suspense and drama the only thing i hated\nit was that Peeta was turned into a some kind of a mutant which we saw\nin the previous film but as the film goes on he starts getting his\nhumanity back. One of my favorite scenes is when they fight those\nmonsters in the sewers. Mockingjay Part 2 is a mix of Harry Potter and\nGame of Thrones since many great characters are dying in this film if\nyou have read the book then you know which of those are going to die if\nyou haven't i won't spoil it for you. Also the original cast of the\nfirst 2 films and Part 1 are also in this one. Donald Sutherland is\nonce more amazing as the bad guy and the movie gives a very touching\nand beautiful ending to the 2 heroes after all the pain and suffering\nthey've been threw. For me this film was so much better than both\nMockingjay Part 1 and the first Hunger Games and it was as good as\nCatching Fire. You definitely need to see this movie.\n"},
{"review": "\nMockingjay Part 2 begins exactly where Part 1 left off. Katniss is\nstill coping with hijacked Peeta and makes the decision to go off into\nthe capitol and assassinate President Snow for herself.<br><br>This chapter is definitely the darkest, yet most intense and scary. It\nshows the audience the consequences of war, yet still remains true to\nthe 'Hunger Games' theme. This being that the Capitol ultimately\nbecomes the arena. Mockingjay Part 2 is without a doubt the most\nemotional of the series as some of the most adored characters are\nkilled off in very very brutal ways. You also get to see Katniss\nstruggling mentally and emotionally, yet being brave and courageous.\nThis is why I believe so many people are inspired by her. Jennifer\nLawrence is absolutely magnificent and really brings out Katniss'\nemotions. I strongly believe that she is the right person to play\nKatniss and I couldn't imagine anybody else playing her.<br><br>Overall, this film is an on edge, intense thrill ride filled with\nemotion, action and tells a story which should inspire a generation.\nThis film gets a 10/10 from me as it ticks all of the boxes that anyone\nwould want to see in a blockbuster to be entertained. The whole Hunger\nGames Franchise is without a doubt the best YA series, and Mockingjay\nPart 2 gives fans a satisfying and thrilling end to a journey which\nshould be remembered for decades.\n"},
{"review": "\nThis last movie had a sweeping scope, emotional impact, and truly\namazing depth. The Hunger Games isn't strictly a Girl vs. Capitol\nadventure, or anti war movie, it really is a tragedy,grim, dark, with\npoignant moments in every one of the four movies. Any who have read the\nbooks shouldn't be surprised by this. The utter cruelty of the Capitol\nis graphically covered, Jennifer's performance captures the sadness and\ndetermination in Katniss, and the pacing of the movie is superb.\nThinking of the great arch of character and story encompassing the 3\nbooks and 4 movies, this forth movie captures the book extremely well\nand is an amazing end to this exceptional series.\n"},
{"review": "\n\"The Games\" ended in the second film of the franchise. In this film the\npropagandas from Mockingjay part 1 end and a new game replaces it - the\nwar!<br><br>The movie starts exactly from the end of Mockingjay part 1, but this\nmovie does not suffer at all of what audiences felt disappointed about\nin the previous film. The movie's plot is hugely faster, almost every\nscene in the film contains action and thrilling moments and the actors\nare playing amazingly! In addition, the movie is very different from\nall the other movies in the series. It is much better in all sorts of\naspects, for example its \"war time,\" the visual-effects are awesome and\nfinally we get to see the Capitol and more of President Snow!<br><br>Finally,if you feel dissatisfied with the previous film you truly need\nto let it go and watch this film that brings the franchise to its\nglorious end that contains action, great acting (especially Jennifer\nLawrence's performance) and amazing visual effects.<br><br>Ido Yam - 10/10\n"},
{"review": "\nHunger games the mocking jay part 2 is a dark emotional roller-coaster.\nThe movie leaves off from where part one ended. Katniss is still\nrecovering from Pete chocking her outcold. In the movie everyone is\npreparing for the final fight against President Snow. This movie is\nfull of dark moments which puts you on the edge of your seat not sure\nwho's going to be killed and what kind of decisions would be\ncatastrophic or the good of everyone. The movie is just full of deaths\nand sadness that Katniss has to overcome in order to free everyone. The\nmovie wasn't too close to how the book ended but it still managed to\nplay it out perfectly. The movie turned out to be better than the book.\nI think that this movie was a perfect ending to this awesome franchise.\n"},
{"review": "\nThe \"Hunger Games\" films just keeps getting better and better.\nMockingjay part 2 is the greatest movie out of the other three. They\nfollowed almost 95% of what happened in the book. We were constantly\nbeing shocked with death or emotional scenes throughout. This is the\nonly movie where i was tearing up every few scenes. Even at the last\nscene of the film, they did not stop making us feel for the characters.\nEverything felt so real. The cinematography was on point too. The\nending in the book was too abrupt, but it worked great as the final\nmovie scene. Would pay to watch this over and over in cinemas.Perfect\nending to the Hunger Games series. Really recommend this movie.\n"},
{"review": "\nSo several years ago I heard about this series and how popular the\nbooks were. I immediately read books one and two (audio booked them\nactually) and really enjoyed both of them. After seeing Jennifer\nLawrence in the first movie, I was so taken with her magnificent\nportrayal of Katniss Everdeen, that I very deliberately decided i would\nnot partake of the final novel in the trilogy, but would instead put\nall of my chips on the last two films. <br><br>All of the first three hunger games movies were very well done and\nquite entertaining. Jennifer Lawrence brought a wonderful authenticity\nto the staring roll and the supporting cast was genuinely entertaining\nand gave top notch performances as well. Which brings us to the final\ninstallment. <br><br>Rare indeed is the story that can cleverly build upon its earlier\nsuccesses. The Matrix couldn't do it, nor could the old Planet of The\nApes franchise or the Jaws films. These series left viewers feeling\nvery disappointed and wistful for what might have been. Happily for\nfans of The Hunger Games series, the final chapter ties the previous\nthree films into an exceptionally satisfying package that really made\nme glad that I had devoted my scarce free time to this film series over\nthe last few years. I will not provide any spoilers to my review,\nsuffice it to say that it unfolds like some unexpectedly beautiful\nflower that will really have you saying \"holy s**t!\" when it is fully\nrevealed. There are absolutely positively NO loose ends by the\nconclusion. That said, I will say that I was truly delighted by the way\nthe story utterly surprised me. I think the last time I was so taken\naback by a plot twist was the movie \"The Sixth Sense.\" So go and see\nthis movie after your Thanksgiving dinner, and you can have two very\nsatisfying experiences!\n"},
{"review": "\nThis movie had a lot of spark in it like Harry Potter.<br><br>Jennifer Lawrence is such a good actor and made the success of the\nwhole film a smooth process. She is such a cute girl.<br><br>I think what really stuck out in this movies was the young children,\nincluding, of course, Primrose. There was a girl with curly white hair,\nwho was probably about 4 years old. She stuck out the most in the\nmovie.<br><br>If you want a clear sign of the times, it's this movie. When I grew up,\nit was Harry Potter, and, as you all know, at the time it seemed to\n\"consume\" everything. Kids today themselves are, however, more spoiled\nthan before. I think I am less bratty than most kids my age were/are,\nhowever. I think maybe movies later when we're older and less\nfresh/interested will start to feature especially aesthetic people like\nthe little girl with curly white hair.<br><br>This movie was a lot of work with good results and deserves my 10/10.\n"},
{"review": "\nI imagine this review will be different than most if not all reviews. I\nam a true 'romantic' when it comes to movies or books. I get enough\nreal life in real life. I felt absolutely dreadful after reading the\nbook series, and still wish I had never read it. I rated the movie a 10\non the merit of them fixing the ending of the book series. If you are a\nclassic romantic as I am, I strongly discourage anyone reading the last\nbook in the series if they have that option, and just see the movie for\nclosure. In this one case, ignorance is bliss. Even so, the movie is\nstill an emotional meat grinder, so be warned. I'll let the other\nreviewers describe the effects, story and whatever else may be\nimportant to them. For myself, I needed the movie, but won't ever need\nto see it again, or waste money on the disk, even though I own\nthousands...literally. I wish to be entertained when I watch movies,\nnot emotionally drained. For those that like that sort of thing, this\nseries is definitely for you.\n"},
{"review": "\nThe final installment of the hunger games brings us an extremely\nsatisfying, exciting, and thrilling finale to the series! The movie was\naction packed, intelligent, well made, very well acted and just had\neverything right! Jennifer Lawrence of course was incredible, so was\njosh hutcherson and Liam hemsworth. Julianne Moore gave a very powerful\nperformance as well. And then there's good old Donald Southerland, who\ngave a very focused and poignant performance. I was so pleased with the\noutcome of this film! The corruption of president Coin, Katniss and\nPeeta ending up together! I do however wish that Finnick O'daire would\nhave made it to see the free Panem. The visual effects are very well\ndone here as well! I cannot think of a single flaw in the final\ninstallment of the hunger games, an overwhelmingly satisfying movie to\nwatch!! 10/10.\n"},
{"review": "\nThis is my first time on IMDb or any other sites similar, simply\nbecause I feel I need to set some things straight. I have no idea why\nthis film has such bad reviews. Having been an avid follower of the\nseries since it began I still went into this movie prepared for the\nworst and ready to be critical if need be (because of the reviews I had\nheard). Start to finish however I don't think I moved once. I genuinely\nthink this is almost the best of the four, beaten only perhaps by the\nfirst for obvious reasons. I thoroughly appreciated the way the\ndirectors have kept the films to the book and Mockingjay PtII was no\nexception. Jennifer Lawrence is absolutely outstanding in this film and\nby all means deserves to be well recognized for her performance. The\nothers also should not be forgotten, Liam Hemsworth really stepped out\nin this film as did many of the other supporting acts. For those\ncomplaining it was slow paced, I am not sure what you wanted. It kept\nme on edge the entire way through and was actually enhanced by the\nmoments of quieter reflection that other \"action\" movies often lack. It\ncontained immense depth, astounding cinematography and visual effects.\nLastly, I think the ending was utterly beautiful. This book, this\nseries, is somber. It's dark, its reflective and it alludes to a number\nof very serious themes. The directors dealt with this incredibly well.\nThe film is a perfect ending to the series, my only disappointment is\nthat it is the last.\n"},
{"review": "\nThis movie was awesome. I read some crap that a critic wrote in the\nlocal paper that I get saying that President Snow was the most bubbly\ncharacter in the film (really he's just evil) and that Jennifer\nLawrence has out grown these films. Also, it states that 4 hours was\nway too long to film one movie. I say no, it's not too long. The book\nMockingjay contains details that are important to the end of the story,\nso obviously you need two parts to explain it all.<br><br>It was one of the best Hunger Games movies. It is very intense. I urge\nyou, if you are going to a movie this weekend, go to Mockingjay Part 2. <br><br>The end is very good. It captures the Epilogue very well. It sets off\nthis movie from in the box office right now. No James Bond movie will\never give you the satisfaction that this one does. It is\nemotional(bring the tissues), intense, full of action, great, and gives\nyour the satisfaction of money well spent.\n"},
{"review": "\n*SPOILERS* The Hunger Games Mockingjay Part 2 starts after the events\nof the previous film, after Peeta unexpectedly strangles Katniss. This\nfilm focuses on the war between the districts and the capitol. <br><br>It is very brutal and extremely horrifying (especially during the\nsewers scene), it just gives you a punch in the gut during the\nemotional moments. Nearly half of the squad team are killed including\nFinnick and Castor :( . My two favorite scenes are the sewers scene and\nthe capitol raid scene with the parachute bombings, it was rather\nterrifying to watch the children get blown up and see their bodies but\nFrancis Lawrence structured it very well, pushing the 12A rating to its\nmaximum highest boundaries. The determination and focus of this film is\njust dazzling and very unexpected, Most people say why Mockingjay was\nsplit into two parts, copying harry potter and twilight. In my own\nopinion, it was such a relief they split it, there was so much\ninformation in Mockingjay that you just can't leave it out, every word,\nevery feeling in both films are just terrifying and life-like. This\nfilm is truly the film you need to see. I loved it so much, I would\nwatch it more than 20 times. Highly recommend this film and ignore the\nnegative comments, this film will shock you with every scene. It's just\nastonishing and mind-blowing. Every scene (if you're a big fan) will\nhit you hard until you drop to the floor, crying and regretting.<br><br>I remember when I first watched The Hunger Games, those times were just\nthe best and now we have come to the conclusion after 3 years of\nwaiting and waiting. Same with catching fire and mockingjay part 1, all\nthe films are intense and stimulating. Probably one of the superlative\nfilm series of the 21st century (especially on young- adult section)<br><br>Mockingjay: Part 2, the film that puts YA films into a serious and\nmaturer tone.\n"},
{"review": "\nI want 2 hours of my life back! It was tedious, linear, uneventful,\npredictable, and dialogues often scrambled. This is not the worst film\nI ever saw, but I've seen lots of films, and this episode is perhaps\nthe 4th worst ever. From top of my head I can name a few more bearable\nthings. Say, IRS. I mentioned drying paint before. Even hangover can be\nmore fun. Or toothache. Walking the streets alone, minding my own\nbusiness is immensely more fun. To spare myself from future torture,\nI'll make sure to check the IMDb comments first, sorting them by the\n\"hated it\" criterion. Why suffer? I just hope my comment will save at\nleast one person from suffering.\n"},
{"review": "\nSo, after watching all the films of the franchise I wonder who was\nKatniss Everdeen? Was she a hero with the capital letter? Nah. Was she\na survivor? Definitely yes. But was it enough to idolize her? This\napathetic girl was always a slave to the circumstances and sequence of\nevents. She was picked up and made a symbol of revolution. Beside her\nthere WERE heroes - Cinna, Finnick, Gale. I think the audience realized\nit by the end of the franchise. The bright side of the review - amazing\nacting of all the cast. I felt like really close to the books\ncharacters.Every one of them deserved standing applause for their\nperformances. So, my '5' expressed the slight disappointment in the\nmovie.\n"},
{"review": "\nBut in this case, it's finally over! When the first one came out, I did\ngo out of my way and read the first book, which was much more contained\nthan the movie and only told from one perspective. I did not read the\nother ones, so I have no idea if they keep that up. What I do know, is\nthat the movies seem to move along with the same pace. And I think most\nof us are glad that it's finally over (apart from cinema owners\nprobably, they made good money with this).<br><br>And while it had it's moments (this one too), it does not really get a\ngrip and the fascination it might be able to get. The potential is\nthere, but apart from the teenage target audience (who get their\ntriangle love story, two boys, one girl), there is something missing.\nEven if the ending tries to go out of its way and shed a bit of a\ndifferent light on things. It kind of succeeds in that, but overall it\nhas the thing fantasy movies these days struggle with: many endings.\n"},
{"review": "\nAlthough I enjoyed all of \"The Hunger Games\" films including this one\nI'm not going to give a long in-depth review for this last installment.\nI read some bad reviews on this last installment of \"The Hunger Games\"\nand I don't see what their problem with this film was. Not that part 1\nwasn't good or anything, I thought this film was a little better than\n\"The Hunger Games: Mockingjay Part 1\" simply because part 1 was just a\nset up for this film. Part 2 was actually better than what I thought it\nwas going to be. This film displayed a great way to end a tetralogy of\nfilms that told the epic story of Katniss Everdeen (Jennifer Lawrence)\nand her fight to kill President Snow (Donald Sutherland). In this last\ninstallment tensions start to rise between Plutarch Heavensbee (Philip\nSeymour Hoffman) and President Alma Coin (Julianne Moore), which makes\nthe plot a little more interesting. Because I'm a fan of action films,\nI think this film could have used a little more action but the way the\nstory unfolded fully compensated for that. I thought it was a great\nfilm that ended the series very well.\n"},
{"review": "\nI actually enjoyed the first movies, but the Mockingjay additions were\nlike watching a bum try to hump a park bench; I just couldn't believe\nor understand what was happening. It's horribly cast as just a knockoff\nof Hitler's Genocide but plagued with propaganda film talk, propaganda\nfilm planing, and the stupid phrase \"prapa film\" basically just all\nbeing used to gang-bang what could have been a good movie. There was no\nneed for a part 1, the entire heap could've been surmised by a 20\nminute section explaining how much they loved making war films, and\nthen tacking on the 10 minute rescue scene. These movies have more\nfiller than Burger King chicken nuggets. Only positive thing I will say\nabout this movie is that Katniss lost weight.\n"},
{"review": "\n*This review may contain spoilers, it depends on how imaginative you\nare, so be warned and do not take the risk because you really need to\nsee this for yourself!*<br><br>I'm still listening to the music at the credits and felt the urge\nstraight away to share how much I loved this story all the way to the\nend. To be honest I expected the last two movies to have gone downhill\nas happens most often with producers losing it to dish up something\neven more exiting than the last box office success. And sure, there was\nsome of that action but especially the ending was very very good ..\nUnpredictable and true to the character of the Mocking Jay: Fierce yet\nfragile and genuine, which makes up her strength. Plus the music at the\nend pleased me entirely. I will give this a ten just for being made so\ntrue and gentle and patient enough to show some emotion, where we're\nusually treated with shallow jokes, punchlines, flashcards and\nsensation to produce a forced smile on our numb faces. Anything to\navoid genuine feelings it seems at times, quick .. make a joke! Never\nthought I would but I loved it .. splendid. The imagery was stunning\nand the details, such as the designs of the Capitol buildings very well\ndone and reminiscent of ominous and grandiose communist regimes as we\nstill know them around the world. I was surprised the last two movies\nreceived a slightly lower rating, they certainly did not disappoint.\nThere's a valuable lesson about what society should do once they spot a\npsychopath in power .. end it on the spot, so we can all enjoy our\nlives in peace\n"},
{"review": "\nKatniss Everdeen (Jennifer Lawrence) is the embodiment of the\nrebellion, the Mockingjay. At the end of the last movie, brainwashed\nPeeta Mellark almost kills Katniss. Alma Coin (Julianne Moore) and\nPlutarch Heavensbee (Philip Seymour Hoffman) continue to use her for\npropaganda. She tries to convince loyalists from District 2 to\nsurrender and is shot. She ignores Coin to join the attack on the\nCapitol. President Snow (Donald Sutherland) has laid deadly traps\nthroughout the city. Coin is leery of Katniss' popularity and sends the\nstill-troubled Peeta to join her. After getting caught in a trap,\nKatniss decides to lead the group on an unapproved mission to\nassassinate Snow.<br><br>There are some good, some bad, but then we're done. I like Lawrence's\nconflicted Katniss and her unrelenting love for Peeta. That gave the\nmovie its emotional heart. The best action is the underground chase.\nThe other action scenes are a mixed bag. The first act needs an\nexciting action scene. There are a few too many speeches which grinds\ndown the pacing. There are interesting political aspects of war which\nis continued well from previous movies. I have no problem with\nsplitting this into two parts other than finding a better place to\nstart the second part. This is good enough and a functional way to end\nthe series.\n"},
{"review": "\nAs Finales go, this was OK. But much of this story involved inaction.\nYou keep rooting for something to happen. Finally when the Rebels\nattack, stuff happens. Some interesting chase scenes, and some good\nCGI.<br><br>The characters are so well oiled in their roles at this point, there\nare no real surprises. Katniss finally gets to show some emotion, and\nJennifer Lawrence turns in her usual strong acting. She has that look\nthat is just hard to not pay attention to. And when she finally can\nshow emotion, she's terrific.<br><br>The story is satisfying. I didn't read the books but I assume the movie\nis faithful to the story. I think they should have combined parts 1/2\ninto one movie, and it would have been much better. part 1 was a dud\nbecause nothing happened. And part 2 really has nothing happen until\nthe 2nd part of the movie. <br><br>Don't believe the picture on the DVD cover - there's really not that\nmuch action until the end. All told, it's just an OK movie.\n"},
{"review": "\nWhat a waste of two hours of my life watching this dull, drawn out\nnonsense. Just about everything about this movie was wrong. Katniss has\nchanged from a strong character to a weak one, it was as if Jennifer\nLawrence was playing an extra rather than a main character.<br><br>But the worst part of this movie is that it is so dull. Basically you\nwatch a long drawn out trek to the capital and apart from a ridiculous\npart of the journey where silly monsters start attacking everyone it\nalmost put me to sleep. (Actually sleep might have been more\ninteresting)<br><br>As for the ending it was a pretty dreary anti-climax.<br><br>In my opinion this movie spoiled the entire series. Mockingjay 1 and 2\ncould have been one movie which might have increased the pace somewhat.<br><br>The first Hunger games movie was good but it all went down hill after\nthat.<br><br>The only thing good I can say about this rubbish is that Donald\nSutherland was consistently good throughout. The rest of the cast\nseemed to be almost as bored as I was.\n"},
{"review": "\n5 out of 10? the mediocrity on display is shockingly average.<br><br>look elsewhere!<br><br>hmmmm.... someone needs to help me come up with more lines for this\nreview, but that, \"roses are red, violets are blue, i'm schizophrenic,\nand so am i\" thing? it's just not gonna work out.<br><br>so perhaps some more pontification regarding towing the mean line. this\nmovie is so forgettable that guy from that show wonders what Jennifer\nLawrence is thinking about the idea of prequels?!?<br><br>remember that part? me neither!<br><br>5 out of 10 - the review this film deserves.\n"},
{"review": "\nJust take a moment to look at Peeta. What do you see? You see a young,\nconfused man who doesn't know how to keep his head straight. Now look\nat Gale. Sweet, sweet Gale. So cool. So selfless and heroic all the\ntime. Just an all around great guy who has always been there for\nKatniss. A man who doesn't shy away from doing what is necessary just\nbecause \"innocents\" might loose their lives. Especially when those\n\"innocents\" are stupid people who risk other peoples lives in order to\nsave a stupid cat. Prim had it coming.<br><br>So why in the world did she go with Peeta instead? It went against\neverything that the previous titles had established. <br><br>Katniss should have gone with Gale. I know I would. Totally immersion-\nbreaking.\n"},
{"review": "\nAfter seeing this movie franchise, I can't see why the lead character\nis the lead.<br><br>After watching this this franchise I can sum up the lead character as a\npretentious, mediocre motivated person with ridiculous arching skill\n(never misses), which makes you hope the lead is a android built by the\ncapital to make this movie less predictable Plus, has godly luck\n(everyone dies but not the lead), at some point you ask yourself is she\ndoing this pleasure (adrenaline junky + masochist) which at the end\ndoes nothing but judge the people who are making a difference, the\ninternet stereotypes these people as vegan or people who get a free pet\nand have the balls to tell other people who did not ask that they\nrescued their pet. In addition to that the lead has quite the funny\nmood swings (The part were she screams at the cat was really funny).<br><br>Besides all that, there are the people surrounding the lead which at\nsome point I have concluded are all able to do what the lead is doing\nbut in some sick joke get some pleasure in let some one who is not so\nokay mentally to do stupid things. The lead goes am going alone to kill\nColonel Sanders when they're at max security and ready to go to war and\nthey all go okay. I don't believe an 80s action character would have\nsurvived this.<br><br>Hollywood really needs to think before writing these scripts, it gets\nannounced that a franchise will have an estimate of movies (3 or more)\nand in the second they end the movie with the lead near death and you\nknow nothing will happen so you hope one of the characters dies in a\nchance that it is not predictable.\n"},
{"review": "\nI went to the theater expecting to be let down, but it was still worse\nthan I expected. If this was just a standalone movie the plot,\ncharacter development and action would all be considered pretty weak.\nBut this was supposed to be a BATTLE ROYALE 2: REQUIEM rip.<br><br>The characters are weak, we are given no insight whatsoever about the\npolitics that are at play, the areana battle fights are few and far\nbetween, and manage to be both underwhelming and completely\nunbelievable. The worst part, however, was that the studio decided it\nwas a good idea to simply recycle the REQUIEM Universe and just make a\nmovie of the poorly conceived plots found there, rather than making\nsomething original.<br><br>The only redeeming part of the movie were some really excellent and\nenjoyable visuals, especially on the cgi stuff. If you really don't\nknow or care that much about BR2 you will probably enjoy this movie.\nAnyone who really likes Battle Royale 2 and cares about it will simply\nbe less disappointed watching the American's attempts at plagiarism.\n"},
{"review": "\nSplitting this film into two halves, especially in this manner, was a\ndetriment to both. This time, the action begins almost mid-scene, like\nwe'd merely broken for a commercial and not held off for a year of\nunrelated pursuits. I felt like I needed a \"Previously on The Hunger\nGames\" refresher, because it's just assumed you're going to remember\neverything and I, with my sliding mid-life memory banks, did not.\nHaving read the books before the first film, those recollections were\nalready weak and I'm still not entirely sure I associated the right\nnames with the corresponding faces. But I'm getting away from the\npoint, and that's this: Part II is, quite literally, an act and a half\nof drama. It's also quite hollow, and maybe one thing has more than a\nlittle to do with the other. Without a third set of titular Games, it\nlacks the sense of adventure and originality that added such color to\nthe first two films and settles in as a drab, depressing war march. A\nshame, since the visuals - a weakness in those early efforts - have\nsuddenly become quite good. The world sprouts with beautifully absurd\ntouches of life (or, at least, there's a sense that it did before the\nlandscape was literally drenched in a viscous black goop) and the\nlarger set pieces have a great sense of magnitude to them. A pity,\nthen, that the main players have all been beaten to the turf and can't\nmuster so much as a smirk, even in their storybook endings. A grim,\ndazing, unhappy concluding chapter that, while technically adept, is\nboth scatterbrained and railroaded to its last breath.\n"},
{"review": "\nSlow-paced, navel-gazing, clock-watching, struggling to stay awake -\ngive me back those 2¼ hrs... Anytime an action sequence started (only a\nfew times) it was quickly curtailed and drowned in a dark/black scene,\nmuch of the movie is introspection / hand-wringing and dark-dark-dark.\nI hate movies with a lot of blackness and you can't see what is\nsupposed to be represented on the screen..<br><br>This was certainly a disappointment following the earlier episodes of\nthe series. Maybe it made sense to keen followers of the books, but\nheaven help someone who wandered in off the street drawn in by fancy\nadvertising featuring a dynamic, sexy Katniss, and expecting an\nengrossing thriller.. {yawn}<br><br>The \"execution\" where Katniss shoots Coin was not entirely unexpected.\nIf I have been Coin I would have been primed to duck, but apparently\nshe was too dumb for that. Nasty way for Snow to die, ripped apart by\nthe Mob, surely Katniss could have dispatched him with a 2nd arrow.. or\nmaybe she had a hidden sadistic streak..<br><br>So Katniss' fate was to be a Mum/housewife but looks like she already\nhad Peeta well trained..\n"},
{"review": "\nIf the single book 'The Hobbit' was extended to three movies, then\nthat's alright, because that was a large concept with hundreds of\nunique characters which can take the stretch in narration. But for this\nseries, lucky to be the first film to get away with a big hit, mainly\nbecause of teen audience.<br><br>Honestly, I liked the 2nd film very much, but the third movie was a\nletdown, especially this one was utterly useless. Because the 80% of\nthe story ended in the previous part and in this, it was a necessary\nfinishing touch with an unnecessary lag.<br><br>Might have been a better film if the 'Mockingjay' was a single movie.\nNowadays there are many strange ways to make money, the art of\nstorytelling in the movies is slowing vanishing while adapting a book\nfor the silver screen by splitting them into two and/or three. This\nculture has to stop, the book fans are enjoying the original\nmasterpiece, while film fanatic like me is suffering a setback. In this\n2 hour long movie there are lots of scenes that simply wastes time to\nbring sufficient runtime.<br><br>Due to the circumstances that I mentioned, the flow was disturbed,\nmainly because of the release gap between the last two films. Emotions\nare not felt, actions were weakened, you could only recognise it\nrushing towards the conclusion. And that section should have been the\nultimatum, what comes later is what we call 'happily ever after or the\nother way' should have been very brief, but in here it was not. Like a\nnew beginning of a new story, it went on too far.<br><br>From the screenwriter's perspective that has to be done. I had seen the\nsplit movies like 'Twilight', 'Harry Potter' and others, but this one\nwas the worst among them. Even if you try all the four movies in a\nsingle sitting, the first two will be the best you can get and the\nfollowed two would surely disappoint you because of the slowness.<br><br>5/10\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"The Hunger Games: Mockingjay - Part 2\" (2015) is probably the weakest\ninstallment in the series. It is not really worth watching in cinema,\nyou can safely do it on a home media. Still, this is not a bad movie by\nany means, it just that it's more or less the same, it doesn't offer\nanything new, it is a repetitive movie, and the conclusion of the saga.<br><br>Acting was OK, nothing special. Special effects were pretty solid,\nalthough there isn't that much of them here. It has couple of nicely\ndone action sequences, but they are far and in between dialogs, which\nwe have heard already before. There isn't anything new this movie can\noffer.<br><br>Overall, \"The Hunger Games: Mockingjay - Part 2\" is a mixed bag/. You\nwill see how the series will end, but it by far not it's strongest\npart. It's just more of the same and not really involving. Not a bad\nmovie, but far from series best.\n"},
{"review": "\nSeems like the movie is ever in search of its identity. A mash up of\nHunger Games (more of mind-games here than the actual games), a\ndystopian future aspiring for an utopian one, a morality take on war,\nemotional bearings - but in the end the movie never seems to get there.<br><br>Viewers expecting a good mix of action in line with the original theme\nwill be disappointed. The pace of the movie is wavering at best, at\ntimes interluded with action &amp; adventurism.<br><br>Of course the dependable JL carries the movie. However it suffers in\nits inability to provide the correct amount of weight-age to other\nperformances - to make the essential emotional connect in-line with the\ndarker tone of the movie. <br><br>All in all not so satisfying end to the series.\n"},
{"review": "\nA disappointing end to the series, to say the least. I haven't been\nthis bored watching a movie in a long time. Everything just seems\nhalf-done and half-explained. Jennifer Lawrence's acting is also\nhorrific in this one; it seems like she either doesn't identify with\nher character, or just does NOT want to be there making this movie.\nThis might be the fault of the writer having no idea how to\nintelligently end this story; but it is all of us who suffered because\nof it. For context, i really enjoyed the first two movies in the series\n- but this one just lacks any kind of excitement, feeling, or sense of\npurpose. I also hate it when writers use children for cheap pathos -\nthis movie was especially offensive in this regard.\n"},
{"review": "\nI must admit when I first heard of the Hunger Games movies I had no\nidea what all the fuss was about. I'd never heard of the books, so\nwasn't that excited about the movies. <br><br>Watched the first one and thought, \"yeah, that wasn't too bad\". <br><br>Fast forward to Mockingjay Part 1, and I had already heard it was a bit\nof a \"filler\" movie, and not a lot happens. \"Fine\", I thought. So I\nsuffered it, thinking part 2 will kick ass. <br><br>Oh, how wrong was I, and so was my wife who, after watching the first\nfilm, read all the books. She warned me that Mockingjay part 2 would be\npretty emotional, and it just wasn't.<br><br>I don't know if it was my imagination but, as with other film series\nlike Harry Potter, it was if the actors were bored of the franchise,\nand just not putting their all into it. I ended up not really caring\nwhat happened to any of the characters. The action was flat and a\nlittle dull. And as with part 1, the pace of the movie was deadly slow.\nSo disappointing. <br><br>As my daughter said after the movie had finished, it seemed like the\nslow sections of the movie needed to be sped up, and the fast sections\nslowed down. As an example, where Katniss's sister, Primrose gets\nkilled, it was like, she's there, dead, move on. There was no big deal\nmade about it, which I understand was quite a big deal in the book. I\nmight be wrong.<br><br>I'm always sorry to bad mouth any movie, because I know how much effort\ngoes into making them. My philosophy has always been, if a movie\nentertains on any level at all, even it it's unintentional, it is a\ngood movie. IE. I'm not a film critic, I'm a film fan.<br><br>But I'm sorry to say, remembering all opinions are objective, but I\nfound this to be a slow, tedious and wasted opportunity. I'm sad it was\none of Philip Seymour Hoffman's last films. It would have nice to have\nended on a high, no irony intended.\n"},
{"review": "\nWhere to begin with this pathetic excuse of a movie. One of the many\nthings that bothered me from this movie is that it did not need to be\ncut into two parts, Mockingjay part 1 and part 2 are one movie. When\nthey did this part 1 was stopped right at the climax leaving you\ndisappointed with an incomplete movie. Part 2 began in the middle of\nthe book which just left the falling action and the boring,\ndisappointing conclusion. This short novel could have easily been made\ninto one 3 hour movie.<br><br>That being said, let's mention why the ending was so disappointing\n(Spoiler). From the beginning of the franchise it consists of this\nRebellion against the capitol. When the Rebellion finally wins and the\ncapital has finally fallen. Nothing. Happens. Everyone literally just\ngoes home. Katniss and Peeta return to I don't even know where because\nDistrict 12 was completely destroyed, to have a family. WHAT!? Is that\nreally the best ending you can come up with. I felt like I was watching\na pro-life commercial. <br><br>\"Yeah kids! Forget everything you just learned about being an\nindependent, strong person and just go have kids. That will fix\neverything!\"\n"},
{"review": "\nThe point of this flick is to kill Snow? Fu*k that and Kill this movie.\nI've had turds that were better than this movie. Peeta was a whiny\nbit*h thru out this entire flick. The special effects sucked, the\ncostumes sucked, the acting sucked... Everything Sucked. I wished they\nall would have taken that suicide pill at the beginning of the movie\nand saved me from having to watch the rest of this bullsh*t. I am\nboycotting any future Hunger Game films since this last film left me\nfeeling hungry for entertainment. So, Julianne Moore's character takes\nover Snow's position and 4 of the remaining survivors vote to have a\n\"Symbolic\" Hunger Games. Instead of killing Snow, Katniss Kills Alma\nCoin. Katniss ends up at her old house and yells at her cat. I don't\nknow or CARE if she is dreaming about her and Peeta being together in a\nwheat field with their 2 kids. Dumbest Movie Ever. The End.\n"},
{"review": "\nContains *SPOILERS*<br><br>The problem with sequels is that I always forget what it was all about.\nOK so I was expecting a SPECTACLE! And all I got was a bed time story.\nThe whole movie was very predictable, and I had a feeling that they had\na limited budget of about 500$ and that's why the camera always stays\non the actors and not on the action.<br><br>What really bothered me was the part where they were trapped, than ran\nacross the yard into the other building and the sisters got killed. And\nNO CAMERA SAW THAT ?! WTF!?!? There were supposed to be cameras\neverywhere but just not there at that time. Come ON! That was a mistake\nmy 4 year old saw!<br><br>And let's not forget the most unlikeable person ever Peeta! Man does\nthis character get on my nerves. They should of killed him in the\nsecond movie!<br><br>I don't get the good reviews, have we all seen the same movie?! I don't\ncare about the books, this was a movie and it should be a good one, as\nthe first one was, but this was something to be deleted from history.<br><br>And something else that bothered me from the first moment of the fist\nmovie! Why is the main character FAT?! OK maybe not fat but she should\nbe SKINNY, because she didn't have enough to eat. I think that Jennifer\nLawrence was NOT the right actor for this role. And in this last movie\nI think she was digitally edited to seem thinner than she really is.<br><br>If you like the Hunger Games you will not like the ending movie. It\njust isn't a good movie.\n"},
{"review": "\nKatniss Everdeen (Jennifer Lawrence) goes with a team to become the\nsymbol of the rebellion and when the team leader dies, she becomes the\nnew leader. She lies to the group telling that Alma Coin (Julianne\nMoore) had secretly asked her to go to the Capital to assassinate\nPresident Snow (Donald Sutherland). Most of the team dies along the\njourney and when they are near to the target, a bomb explodes killing\nmany innocent people including her sister. When Katniss recovers, she\nlearns that the rebels have overthrown President Snow. She has an\nencounter with him and Snow reveals a Machiavellian plan. <br><br>\"The Hunger Games: Mockingjay - Part 2\" is the conclusion of the story\nand despite the long running time, very few things happen. The most\nimportant is Snow's revelation and Katniss attitude toward Coin. Why\nKatniss has not resolved the situation at the round table when Coin\nproposed the new game? Was it necessary to do in front of the cameras?\nMy vote is five.<br><br>Title (Brazil): \"Jogos Vorazes: A Esperança - O Final\" (The Hunger\nGames: The Hope \u0096 The Final\")\n"},
{"review": "\nI am a fan of the hunger games trilogy. But after seeing the Mockingjay\n1, I was disappointed in the cliffhanger of an ending. When part 2 came\nout, i waited until it was out on DVD. I liked the movie and most of\nits actors. What I found a little cringy were some scenes that made no\nsense. They were too \"coincidental \" . Like for example, at the end,\nwhen Peeta simply decided to come \"home\". When was that his home to.\nBegin with? And why is that home in the middle of no where???? Nobody\nelse lives there but Katniss and a cat.this is ridiculous. And all his\nmemory comes back just like that, Puffff!! Except for the awkward, no\nsense making scenes, the rest of the movie is pretty cool. It has\nsuspense, combat scenes and love scenes. Also a small twist plot at the\nend, which I personally loved. Also, it is longer than your average\nmovie, which is perfect !!!\n"},
{"review": "\nThis is a truly horrific piece of cinematography, I watched the first\nfilm because of all the hype. Hated it. Suffered through the next two\nbecause I wanted to see it through. Hated them. Then came the finale.\nHate myself for wasting 2 hours of my staring into space time. <br><br>I actually created an account on here just to warn people to not watch\nthis awful, awful film. I'm a Jennifer Lawrence fan, she's funny and\ncharismatic. In this she is wooden and hard to warm to but\nunfortunately still by far the best performance in this piece of utter\ngarbage. Her boyfriend looks 15 and you are supposed to believe that\nhe's fathered two children with her. I'm surprised if he knows where to\nput it!! <br><br>In summary this is the film equivalent of paying to spend an afternoon\nreading labels on the back of shampoo bottles.\n"},
{"review": "\nSPOILERS AHEAD!¡!¡ In this high paced thriller, Katniss Everdeen and\nher band of Rebels storm the Capitol in pursuit of killing the maniacal\nPresident Snow. During her journey she realizes the side she is\nfighting for may not be better than the ones she's overthrowing. She\nwill face mutts, pods, and even her once- lover, Peeta. She losses many\nin her fight to kill snow, but the death no one saw coming might just\nbe what pushes her to insanity. President snow has gone mad trying to\nkill her, power has corrupted coin, and even gale finally loses Katniss\nin a way no one could've foreseen. In this final journey, you may begin\nto wonder if any characters can be spared. Katniss will sacrifice\neverything for the future of Panem. This blockbuster brings a fitting,\nthrilling, emotional, and epic finale to a beloved series.\n"},
{"review": "\nThe Hunger Games: Mockingjay Part 2 serves as the best movie of 2015!\nIt's action packed, suspense, awesome visual effects and a great\nemotional conclusion to a great series. Francis Lawrence has outdone\nhimself, the visual representation of the book to the movie was on\npoint! Suzanne Collins thank you for creating an idea that became a\nworldwide phenomenon. What I like most about The Hunger Games is that\nit represents what our world is currently going through, how society is\nfalling apart, and how much conflict and war there is in this world.\nThe series is sends out a message towards everyone that no matter who\nyou are or where you came from, the courage of one can change the\nworld. I felt that this movie didn't need to be split into two parts\nbut who cares to be honest. I recommend this movie to everyone who\nlikes action and suspense. Overall, The Hunger Games: Mockingjay Part 2\nis the best movie out of the entire series, the best movie of 2015, and\nthe best ending to an uplifting saga that no one will ever forget.\n**10/10**\n"},
{"review": "\nThe Hunger Games : Mockingjay -Part 2 is a very good film and a fine\nconclusion of the movie saga. The movie is strong, good script, great\ncasting, excellent acting, and over the top directing. A saga that goes\non for 4 films takes you around various walks in life of Katniss\nEverdeen (Jennifer Lawrence). <br><br>I enjoyed watching these movies so much. Jennifer Lawrence did a great\njob in every series of Hunger Games saga. She is the central character\nand the real gem on the movie series, she is astonished in acting and\ngorgeous looks on the movies. Also other characters like Josh\nHucherson, Liam Hemsworth, Woody Harrelson etc did their part very well\non the movie series.<br><br>Cinematography is visually superb and great CGI also. The locations of\nthe movies are outstanding. Some scenes are lagging but overall its a\nvery good movie to watch. The major plus point of the movie is the\nSeries start with where the first part ends.<br><br>All in all the movie is superb conclusion for the Hunger Games Saga\nSeries....\n"},
{"review": "\nOverall very satisfying film it takes time for it to pick up but it\nreally redeem it's self after part 1. But honestly it was no where as\ngood as Catching Fire it's a hard movie to top out of the four films\nmockingjay part 2 is probably the second best movie in the film series.\nIt contained plenty of action,emotion, and great acting it,.Jennifer\nLawrence is amazing and you really feel for her throughout the movie.\nMockingjay part 2 really does a good job on closing out the series. It\nstays true to the boom , making a worthy adaption. Would definitely\nrecommend!!! Will it be more successful then part 1 maybe not since\npart 1 kinda dim the fire of the series.\n"},
{"review": "\nAn incredible finale! It is incredibly difficult to accept that the\nfranchise has come to its end. When the movie had finished, I felt the\nway I did after the final Harry Potter movie ended. The Hunger Games is\na franchise I can keep watching from time to time and in a few years\nwill become nostalgic and remind me of my teenage years. Mockingjay as\na whole is so much different compared to the first two movies but Part\n2 stood out with it's realistic war atmosphere and all the emotions\nevoked with a war. Jennifer Lawrence stood out again in her role as\nKatniss with Josh Hutcherson and Liam Hemsworth giving memorable\nperformances too! There was so much suspense, I was on the edge of my\nseat the whole time. Plenty of action and a gripping story line. Stays\ntrue to the book, I highly recommend this epic finale. After seeing the\nfirst movie in the franchise I was immediately captivated, it is sad to\nthink that it's all over, just like Harry Potter. Outstanding\nperformances from such a wonderful cast and fantastic directing, as\nwell as an amazing music score! I can't decide if this film or Catching\nFire is the best one in the franchise but every film was well-done and\nI consider The Hunger Games to be right up the top there with Harry\nPotter for best franchise!\n"},
{"review": "\nI've read the three books of \"The Hunger Games\" trilogy and that\nsomehow prepares me for this. I realize that this film adapts the third\nsection, \"The Assassin\", of the \"Mockingjay\" book. The concluding movie\nis great! Here's why.<br><br>In \"The Hunger Games:Mockingjay Part 2\" , Katniss leads the thirteen\ndistricts of Panem in the rebellion against the Capitol, and where she\naims to ultimately kill President Snow.<br><br>I love how the characters are explored, with their good and bad sides.\nThey don't come up as the two-dimensional heroes and villains. Their\nacts and emotions flesh them out better. If you're a fan who wants\nevery scene in the book included, well, splitting the book into two\nmovies allows that. Books are longer than movies, so not all parts of\nthe book will be adapted for the film. The pacing is good. It's not\nthis high-octane action film, but a war film that deals with both\nwarring sides: District 13 and the Capitol. Action sequences and\ndramatic scenes blend well. Political themes are perfectly inserted in\nthis sci-fi war film. This is a teen-powered franchise, and it's nice\nthat teens can connect Panem to our real world, especially in countries\nwhere corruption, oppression, and terrorism reign like king.<br><br>I appreciate the ending. It gives me mixed feelings about happiness,\nsadness, frustration, and anger.<br><br>This is a refreshing entry in the sci-fi and YA genres. I highly\nappreciate this.\n"},
{"review": "\nI saw the movie on Thursday night and I LOVED IT!!.I loved that it was\nextremely faithful to the book and if there's anyone that love the\nbooks as much as I did can appreciate that. I loved that the movie had\ngreat action,all the great performances by the entire cast especially\nthose of Jennifer Lawrence(katniss),josh Hutchinson(peeta) and woody\nHarrelson(Haymitch).I also loved the places they picked for the capital\nand district 13. <br><br>I actually thought the pacing was necessary because it gave the same\nimpact like it does in the books. One criticism I will say is the\nending they should have added that it took 10 to 15 years for peeta to\nconvince katniss to have kids.<br><br>All in all I thought it was an epic conclusion to a fantastic book and\nmovie series. <br><br>DEFIANTLY A MUST SEE!!! 10/10\n"},
{"review": "\nThis is by far, and by far i mean THE worst movie i have ever seen in\nmy life. Horrible acting, full of cliché lines, completely out of\ncontext, story-line, you name it...I try to understand fans, try to\nunderstand people that loved the books, but oh lord, how can someone\nrate this with more than average ( at best ) is beyond me.<br><br>Add to it horrible cgi, LOL-what-did-just-happened moments, just a\ntotal mess...<br><br>I tortured my self to watch it to the end, just to be able to see how\nmuch nonsense one can fit into a movie, and oh boy was i not\ndisappointed. I thought Final Destination movies had the most\ntransparent scripts ever - wrong again.\n"},
{"review": "\nI am a Muslim belly dancer and I love watching movies in free time.\nThis is my first comment on IMDb. The Hunger Games:Mocking Jay Part 2\nis an interesting sequel to part 1. It is the story of a strong woman\nrebel Katnis Everdeen fighting against a dictator president. The film\nis entertaining with action.When you see this movie you will feel with\nrebels who have been oppressed and you will come to the feeling that\nevil doers and dictators will sooner or later get destroyed as a result\nof their wickedness.<br><br>This movie has been achieving international success in every country of\nthe world. It is a film for people who love justice and democracy.Me\nand my dear son Muhammad enjoyed this excellent movie and we definitely\nadvise you to see because it is a perfect epic movie.\n"},
{"review": "\nI loved the Hunger Games books, I thought that they were great, so I\nexpected the same from the movies. Instead, I got some pretty mediocre\nmovies, except for \"Mockinjay Part 1\". I loved \"Mockingjay Part 1,\" for\nme it's easily the best of the series, so I expected great things from\n\"Part 2.\" Boy, was I wrong. I spent the first hour or so completely\nbored. It was slow, then, once they reach the Capitol, it completely\nchanges pace. It goes from being very slow to being way too fast. There\nis almost no time to breathe or think about what's going on. Those who\nhadn't read the books kept asking me what was going on. The only\nredeeming thing about the film was how well they nailed the ending.<br><br>So, in recap, uneven pacing and changed way too many things from the\nbook, and a lot of the actors seemed to be phoning it in. Not a good\nmovie in any sense.\n"},
{"review": "\nIn the final film of The Hunger Games series, we see several of the\ncharacters many of us have come to love fighting not just for survival,\nbut as we've seen before for freedom as well. <br><br>However, this time 'The Rebellion' aims to take down the Capitol once\nand for all. Our famous female heroine, Katniss Everdeen, has a goal of\nher own though... assassinate President Snow.<br><br>The fate of Panem rests in the balance. Will they be victorious? Will\nthey survive? I urge any people who have followed the fight to see for\nthemselves. I will say that I believe this to be a fitting end to a\nwonderful series.\n"},
{"review": "\nThis movie was obviously shot without a script and I would not bother\nwith this review if it was not for all the 10/10 reviews which must\nhave been submitted by either hired users or people who just saw their\nfirst movie ever.<br><br>IMDb want me to write at least 10 lines before they accept my review\nand that is a bit ironical since the producers obviously settled with\nless than that from the script writers before signing it off. OK, that\nis eight lines. What more is there to say? I marked this as containing\nspoilers so I'd better add some: There will be a Part 3! Nah, just\nkidding, they squeezed the last drop of blood from this stone in the\nsecond film and they know it.\n"},
{"review": "\nAt many levels this stayed true to the books. The books were telling an\nantiwar story, they were saying that government is complex, and they\nwere warning that the new boss is almost always as bad as the old boss.<br><br>Furthermore the books tell us that you cannot win or even try to win a\nrevolution without suffering great loss. And it warns us that warriors\nare scarred forever. Especially that last comes through terrifically in\nthe movie. I'm glad they didn't pretty up the tragedy that bothers so\nmany teens who read the books because without that we really don't\nlearn the lesson, and that is Katniss's sacrifice really is not worth\nit. Not a personal level. <br><br>But oh my gosh, was this movie slow. 35 minutes and I began hitting the\n\"jump ahead 10 seconds\" button. Three times there were scenes of her\nwalking slowly \u0096 and I mean slowly \u0096 while the camera circled around\nher. I hit the 10 second button 10 times in each case and she was still\nwalking. That's stupid. Cut out all that padding and combine the last\ntwo movies into the one movie it should've been, and this would be far\nbetter.<br><br>instead of a climactic battle, it is more like the mindful walking tour\nof Panem's capital city\n"},
{"review": "\nWell I thought the first part was being so slow because it was building\nup for the second part but after seeing the second part I am very\ndisappointed. This part was just as slow without wow moments, twists or\nsurprising elements. <br><br>The real-life lessons: none. Same as with the first part I can not\nthink of a single topic that this movie made me think about. Very, very\npoor in this area. The only thing that I would say is that I think it\ntried to draw a resembles for the fight of power in the real world as\nwell. Reminds you that some people just have their agendas and you are\na part of that agenda until you have your own idea of what is going on\nor have your own agenda. Coups, that the reason why they are never\ngood. As much as they tell their population they are liberating them\nfrom something, it is always someone else who is after a throne.\nDemocracy and the freedom to choose your representatives should always,\nalways be preserved. Also, something on relationships- no matter how\ngood looking you are or how much you love a person (Gale Hawthorne) you\nwill never win that person over if your ideals, ideas and values don't\nmatch (Katniss Everdeen was against the killing of innocent to win a\nbigger war, Gala was not. He believed some should be sacrifice to serve\na greater purpose). <br><br>Plausibility: extremely implausible. How is it that there is always\nsomeone that is there to save Katniss Everdeen? In real world she would\nhave died a thousand times. <br><br>Acting: a lot of great actors on cast which made the movie quite\nenjoyable but again there is something in Jennifer Lawrence's acting\nthat makes you feel her pain-I loved that, I loved that she and the\nmovie through her could provoke emotions and make you feel with her.\n"},
{"review": "\nI can't say I'm a good movie analyzer, I'm far from it. But The end of\nthe franchise was obvious since the last movie. In Mockingjay Par 1,\nwhere coin gets her speech towards the end, seeing Peeta getting\ntortured by the rebellions (It looked like torturing to me!) gave the\nidea away. I don't know whether it was unintentional or they did it on\npurpose, but seeing coin getting over the tragic scenes so quickly was\nrevealing another tyranny. The good news about the whole franchise is\nthat it doesn't disappoint you in any way. You are expecting Peeta to\nrecover and get on board, he does. You expect that rebellions win the\nwar, they will. You expect Katniss to survive and live a happily ever\nafter with Peeta, she does. You expect that capitol is throwing bombs\non its people instead of souvenirs, they do. You expect that capitol\nwould not do such a stupid thing and it should be coin, it will. And at\nthe end, you expect Katniss to shoot the arrow to Coin, she does. It\nwas really fun to watch the movies. I personally enjoyed them very\nmuch. The acting was very adequate for such a movie. Jennifer Lawrence\nis excellent. If only they could add a little more element of surprise,\nand un- obvious twists, it would have been my favorite quadruplet.\n"},
{"review": "\nThis is my first review here out of thousands movies i have seen which\ni never felt to write a review on, which had a really strong impact on\nme , my ideas and the quality of movies i see in the future.<br><br>But this one for some reasons brought special memories , you know like\nwhen you saw the ending of Harry Porter, it's the childhood memories\ncoming back when you see your favorite character to go off screen in\nthe movies forever. This one was really touching !<br><br>Movie is well done , director has done a great job. <br><br>That scene is the end :') .......<br><br>Loved it !\n"},
{"review": "\n80% of the movie is corny and formulaic. It is filled with poser drama\nwithout substance, which only makes it slow paced in the worst way.<br><br>It looks like somebody said \"We got 5 minutes of action. Make some\nrefill scenes nobody cares about\". And then some generic scenes were\nadded to make 80% of the movie.<br><br>Well, you may think, at least the action may be interesting? Wrong. It\nis generically clichéd. Choose off the shelf air vent or sewer clichés\nand call it a day.<br><br>The rest of the movie is... to call it girly drama is to insult girly\ndramas.<br><br>Of course, the evil characters are uni-dimensional evil characters,\nevil for no reason, and the movie ending is so predictable that you\nfeel impatient and super bored waiting for the obvious scene to be\ndisplayed after a loooong, loooong refiling scenes without any\nsubstance inserted to the purpose of delaying and delaying without\ndoing anything in between.\n"},
{"review": "\nThe epic conclusion to a sci-fi thriller. While Mockingjay Part 1 is\nmore of a pre-war story. Mockingjay Part 2 does not hold back on the\naction that follows with a war. Considering I read the books their were\na few things I felt that the movie was missing/lacking. The director\ndid an excellent job bringing the authors vision to life. A few tears\nwere shed throughout the theater during the most emotional parts, a few\ncharacters death. Not only did this meet my expectations but it also\ngave a little more making you want more! For anybody who hasn't seen\nany of the movies they are a must see! Especially the epic finale that\ngave the audience what they wanted.\n"},
{"review": "\nGreat movie, no doubt. My favorite. Sadly it was the last one. It could\nbe longer, i wish. Jennifer such a great actress. I think they choose\nthe right actress for this movie. A movie completely different from the\nothers, other history, other type of world. they it ends its alright,\nbut i was kinda waiting that everyone would be together. Not everyone,\nbut the main ones. I love the visuals, are great. I didn't read the\nbooks, e see people judging i don't understand why, this movie is so\nunderrated. Dark, emotional, heartbreaking and incredibly satisfying.\nThe themes are socially and politically relevant to our society and I'm\nsure this will keep educating people on the consequences and horrors of\nwar for generations to come. Brilliant movie. The best Hunger Games\nfilm.\n"},
{"review": "\nI had the exact same feeling when I finished reading the book when I\nwatched the ending of this movie. It felt something was missing in\nthere, like it was remote and emotionally detached - an anticlimax\nending to something that should have blown up in your face.<br><br>But somehow I learned to deal with the disappointment, and found out\nthat it was exactly how it should be. <br><br>This is a story about Katniss Everdeen.<br><br>Katniss had been forced to fight. She was used as a tool by two\nopposing political forces. She had not been a fighter before the games,\nit should be natural that she was not on the front line of the war, and\nsaw little actions. It is befitting for her story to end in a personal\nlevel. <br><br>The deaths were written briefly in the books, and they were just as\ndetached as it was in the movie. Perhaps it's just how Katniss'\npersonality deals with it. She didn't look too emotional when it\nhappened, but we know she'll have her scars for the rest of her life.<br><br>If it had been done differently, the movie might have more favorable\nrating out there, but it would lose the feeling of the book.<br><br>And the book was not an action book, it was a bitter,darker reflection\nof our modern society - which is already in the grasps of manipulative\nMedia Empires.\n"},
{"review": "\n**** May contain strong spoilers ****<br><br>This is a review made by StoneDraim... and that means that if you want\nto read a probably different kind of review, keep reading....<br><br>This is my personal experience, my personal point of view/perspective\nand my personal opinion... and my opinion is just one of like 7\nbillions in this world.<br><br>I got the thinking over and over again in the first 20 minutes;\n\"Oh...come on...what is this...! Too forced, too naive, questionable\nacting, bad manuscript...!\" A lot of times I got a emotion of what\nwould happen...and then just minutes later; \"What!? Did they read my\nmind retrospective?!\" I got almost the same emotion as for Jurassic\nWorld; very nice production, too poor actors and the value of\nentertainment is low. And polishing something ugly can be big in the\nend; some people will think that of this motion picture.<br><br>Is Hunger Games a newer version of \"The Running Man\"? In that case,\nthey must have gotten the wrong list of cast. Donald Sutherland...did\nhe run? No, Arnold Schwarzenegger did.<br><br>And now... perspective of moral and messages throughout the movie: take\nsocialism, racism, fascism, suppression, teetotalism, holocaust,\ntwisted righteousness and program them into a computer. Put all the\nparameters for the outcome on \"Truth\". The result: The Hunger Games -\nMockingjay part 2.<br><br>Over to the movie as a product: - The production : high quality and\ngood work. - The actors : They are good. - The story : They\ntried...oh...they tried. Listen to the wisdom of the world history and\nlearn to love each other and value a human being. Great and important\nmoral. - Entertainment : I tried to appreciate it. I really tried. It's\napproved... just approved. - Age : Youth based.<br><br>4,9 out of 10 (Short elucidation for the rating: 5 Approved. 4 Failed.\nLacking in character.)\n"},
{"review": "\nWell as i expected a finale (so bad) to a series that it makes all the\nprevious movies unwatchable so i wasn't surprised. Why the F did they\nend it like this. In summary, fight for your beliefs just to conclude\nthat you were wrong all along. The people that believed in you will all\ndie horribly (including family) and you end up married with kids to the\none person that stalked you from the beginning because every one else\nis dead even though you were never attracted to him. What moral ending\nis this piece of Shite supposed to be telling us.Honestly, i give up.\nWill go back to the movies of the 80's and 90's, at least they new how\nto make classics. Way to go to killing a franchise.\n"},
{"review": "\nThe only thing worth in this movie, is main leads acting, the rest is\nutter bullshit. the way they dropped the plot ball on this one is just\nhumiliating. the best part of the movie is the trailer. it is\nunbelievable that story that began so well, has ended so poorly. I feel\ncheated out of my time and i honestly think that part 1 and part 2 were\ncreated JUST for money. how was it nominated for anything is beyond\nme...<br><br>If you have watched the first episodes, you will no doubt watch this\ntoo, just don't expect anything out of it... you will know what will\nhappen 10 minutes before it happens and if you wont see it coming- then\nthere is a good reason for it. imagine if Frodo would have taken a BMW\nto Mordor... - this is how ridiculous this movie is... I'm sorry i ever\nwatched it, i could have imagined a better ending in my head...\n"},
{"review": "\nBetween this movie series, and the Divergent movie series, my stuff\ngets a little mixed up. However, both have a recurring theme in book\nform which is that they start extremely strong and finish extremely\npoorly. The first books in each respective series were fantastic. The\nlast books were awful. <br><br>In this particular series, I was unsatisfied with the ending that was\nwritten and for that reason, I was uncertain that I would even bother\nto see this movie. Part 1 was a disaster. It was terrible. I hated it.\nIt made certain that I would not be attending the showing of part 2 in\ntheaters. It didn't help when the cheesy posters for this movie started\nbeing released. <br><br>This week, I was able to see the movie for the first time just to cross\nit off of my list of movies that I must watch someday. The first 30\nminutes started to make me feel like it was going to play out exactly\nas expected: awful. As the movie started to go on, however, I began to\nreally appreciate it. <br><br>The acting in the film was good as a whole, the storyline was well cut\nand didn't leave out anything to significant, and the ending was\nbrilliant. I think that Hunger Games fans will be very satisfied with\nthe last 20 minutes of this movie, unlike the book. Overall, I give it\nan 8 out of 10 which is much better than my expectations were for the\nmovie.\n"},
{"review": "\nOK, i've seen a lot of people liking this, but why? I've spent a whole\nweekend watching the complete saga, the first statement was OK, the\nsecond one, was a lot better, talking on tech aspects, because it was\ndirected by other. But what happened to the part 2?<br><br>*SPOILERS AHEAD!* *SPOILERS AHEAD!*<br><br>No characters evolve on the film, poor dialogs. We were talking about a\ncivil war! And we see one squad taking a walk through the capitol,\nthats all. Thats the whole movie! The ending... i don't know if the\nbooks have the same poor ending, it was disappointing, they took the\npower, Katniss managed to kill Coin and Snow was killed too, thats\ngood! But she was forced to go back to the 12 with his father and thats\nhow it ended. She was the main character but his ending wasn't what she\ndeserved. The plot was garbage thanks to that ending. :(\n"},
{"review": "\nSnarky personalities from emotionally indulgent brats speaks to our\nself absorbed millennial natures. These characters have never known the\ndistricts; they have never known hard work or suffering. Their\ncharacters all seem like they were raised in 90's American empire\nsuburbia where their parents told them they were great. Everyone is so\nconcerned about their feelings, forgetting that they are at war. All of\nthe male characters look like they just came from ten hours at the spa.\nA few \"adult\" characters provide a semblance of structure and order,\nbut it seems more like a group of college chaperones with the focus\nquickly diverted back to the emotional concerns of self-obsessed youth. <br><br>The Jennifer as a media tool gets old to the viewer even more than it\nstarts to get old to her character. <br><br>I did like the intrigue of Coin needing to control, and seeing The\nMocking Jay as a threat. That was well portrayed. If only as an excuse\nto have Peter back on the scene which would otherwise be completely\ninconceivable. <br><br>No one has the resources to dump 100,000 gallons of oil into a large\ncourtyard with multiple areas of egress.<br><br>Once they embark on their underground mission, the pace picks up and\nthe so does the realism.\n"},
{"review": "\nWhen I was younger one of my favourite elements of James Bond movies\nwere the gadgets he used.<br><br>This film pushes the envelope - many of them really look real. And I am\nalmost sure that some of them probably are. The effects are and always\nhave been cutting edge. <br><br>Never mind the operatic plot and characters - it isn't supposed to be\nrational or remotely realistic. It is, however amusingly futuristic and\nescapist. Could have used better dialogue perhaps but might be overly\nslavish to the original material which I haven't read so I cant be\nsure. If the dialogue were a bit better and the characters had more\nsubstance and depth than it might be worth more as a franchise because\nof repeat watch ability - it isn't. <br><br>It could have been great - many elements of great film-making were\npresent but I regret its a watch once and forget movie experience and\nthat cuts into lasting entertainment value.\n"},
{"review": "\nYou're more likely to enjoy this movie if either a) you are a fan of\nthe book series, or b) you are a mature viewer. By mature I don't\nnecessarily mean that you've attained a minimal age in years (though I\nwould say that it is unlikely viewers younger than 10 would appreciate\nthe movie). I mean you can equally enjoy not only faster-paced action\nsequences but also slower-paced drama. As with the books and previous\nmovies, this last Hunger Games movie has intense moments of both action\nand drama, but also less intense but still dramatically important\nsequences of people just talking. I suspect this is what less mature or\ninterested viewers have called the \"boring\" parts.<br><br>However if you like movies that are dynamic in pace and emotionally\nengaging rather than just one long special effects sequence, and\nespecially if you are a fan of the books, I think you'll appreciate\nseeing this movie in the theater. Relatively speaking it is a pretty\nfaithful portrayal of the book. The action sequences are brutal and the\ndramatic sequences are tear-jerking. And on occasion, as with the book,\nyou get hit with both at once several times.\n"},
{"review": "\nI MEAN WHAT WERe they thinking when they made this... I mean come on..\njust think of the adventurous and promising start this series took and\nthen there came \"the catching Fire\" igniting an urge to watch the next\nin our heart but then they had to do \"this\" for me it is a complete\ndisappointment. It's hunger games we are talking about. even the title\nis not remotely related to any of the politics and boring drama this\nmovie contained. and don't get me started on the ending what was it.\nthe conclusion of this all is that you take it from me you don't wanna\nbuy this movie its just a waste of money and time and makes you really\nwanna say \"why.. I mean why would someone do such a thing to a\nbeautiful thrilling series\"\n"},
{"review": "\nA close end to a great story, this movies talks direct with teenager\npeople, is a complex politic drama with a beautiful love sophisticated\ntriangle, teach how the entertainment world works and how politics can\nlie to preserve power, the good and the bad one. The movies follows to\na end with bombs in everywhere, including what you think it is the\nright side, of course everything is not what really appear, but in the\nend some real friendship keep the full war, and become a amazing final.\nThis last part don't have the same strong the another ones, with strong\nspeech and beautiful shoots, it isn't the best movie, but it deliver\nwhat we should wait from a final shoot in the heart of all fans of\nKatie's arrow, and it is all, a beautiful shoot to say goodbye, and\nchange the life of all.\n"},
{"review": "\nWe live in an age where many producers take advantage of \"eye candy\"\nand will have movies made that has spectacle over story. Think Michael\nBay. This movie has the reverse problem: it's story is cohesive and\nwell written, but it lacks the pay off. I give it a passing grade\nbecause it's problems aren't what it does bad but what it doesn't do.\nOverall, it's a good movie but is the worst of the series due to its\nlacking climax. SPOILERS When watching a second time, I realized, this\nwouldn't be a hard movie to make good. Their first problem is following\nthe promo videos. I admire that they're following the book-I'd be mad\nif they changed it-but that doesn't mean they can't skip it. By this\npoint all the promo stuff and Peeta stuff is irrelevant. A better\nchoice would to focus on a new group of people taking the front of the\nattack. They could explain it as, \"The capitol has guns hidden\nthroughout the city that we need to destroy before flying in jets.\"\nThis would explain the mission and also make for some cool war action.\nAfter, we can come meet up with Katniss. Her squad dies and they\nimmediately go under ground, again, skipping the slow parts. The next\nchange would be when they're going to Snow's house. This would be a\ndeparture from the book but the book's flaw is Katniss' lack of action\nin the plot. To make her relevant again, maybe she heard Peacekeepers\ntalking of a trap so she and Gale need to take them down. It'd be cool\nto see them work as a team and go bad-ass taking down a whole squad.\nTHEN the rebels attack and more mayhem and Prim dies. Lastly, I like\nhow she kills Coin, but this doesn't seem like a reason to not kill\nSnow. She should've gone over to Snow, whispered, \"This doesn't change\nanything,\" and stab him cold heartedly. These three additions wouldn't\nchange the story but would insert much needed climax into an otherwise\nsolid story.\n"},
{"review": "\nBATTLE ROYALE 2: REQUIEM juxtaposed together with a hot, useless\nactress and a pair of studmuffins. And you get The Hunger Games:\nMockingjay - Part 2.<br><br>I don;t why Wikipedia says it is a quasi-sequel to the 2015 film The\nHunger Games: Mockingjay - Part 1. But, as in this film, the plot is\ntoo cheesy and copied from both of the aforementioned hit films. The\nheroine is lukewarm while the vindictive villain does a very good job.\nOwen Wilson is a waste and no pivotal role to play.<br><br>Overall, performances were appreciative and the song were not very\ngood. Direction is average and cinematography is poor. Lots of plot\nholes and goofs here and there makes this one watchable, NOT! BOTTOM\nLINE: It is yet another Hollywood gimmick and there's no entertainment\nin this. Only plagiarism &amp; stupidity.<br><br>Can be watched with a typical American family? NO! Please do read the\nplot summary of BATTLE ROYALE 2: REQUIEM before you watch this movie\nand you will probably forgive the producer for blatantly trying to copy\nShuaya Nanahara's character from REQUIEM, or for introducing a heroine\nwho is actually not required in the script. You might also forgive the\nhonest media that is full of reviews and promotions but does not hint\nthat this is a copied movie so standards may vary, or fall completely..\n"},
{"review": "\nWTF BRE this ppl writing? There is some critic that say oh yea bad\nmovie bla bla bla but than they give 4 or 5 stars? WTF BRE? And what is\nwith this 10/10 bla bla bla crap? Did they got pay for this?<br><br>I believe so. This movie is waste of time and money. I can not say more\nthan guy explain already \"Yes,they managed to do it.Worse than part 1.<br><br>\"Top comment but again he give 4? 4 for what? story line 1? scenario 2?\nvideo effect 3? Actors 4?. Good explanation but this movie is 0 for me\nand i would give that one but as 1 is the minimum 1 is what they will\nget. 1 seat down. Yea you can waste 2h watching this movie but do not\npay or buy. It is waste of money. The hole movie was totally dump. I\ncould not believe what my eyes watching. Is this was the same movie I\nwas watching from beginning? The story in this movie goes like this: <br><br>\"I am good* who serves to dump people, who help stupid ones to be\nintelligent so they can be more retarded than they are already so they\ncan final beat the imbeciles. Help me BAD\" The end. *meaning is good\nnot god.\n"},
{"review": "\nI can't believe this was the last movie, so crazy. In the beginning I\nwas not a Hunger Games fan, but when I watched Part 1,I was so excited\nto see Part 2. I have all the movies and they are all very good. During\nthe first couple of movies you see Katniss stuck between Gail and\nPeeta. I did not expect for Part 2 to end the way it did. Totally\nShocked me. I am still in awe. I'm still not sure if Katniss chose the\nright person though. I love Gail &amp; Peeta, but I don't know, I thought\nshe would have chose different. Anyway, I am glad it ended semi happy.\nSuper sad Prim dies though. I don't know Hunger Games fans, Did it end\nthe way you wanted? Was it good or kind of blah?\n"},
{"review": "\nin short, this movie felt like a stuffing, they have nothing to do and\nthey said hey lets create a whole movie for 5 mins conclusion, the\nmovie is really bad and boring, has no story in it and the ending is\njust the worst part.<br><br>it doesn't worth your time and money, they should have invested more in\nthe story and gave a proper ending for all characters, also the events\nthat go into this movie are non existent, its pure drama and drifted\nall the away from the original movies, Hunger Games should be stripped\nfrom its title.<br><br>my 2 cents.\n"},
{"review": "\nOkay, so I was looking forward to it thinking it'll be better than part\n1, but no. I basically got so bored during it I played on my phone the\nwhole time. I occasionally looked up to see Katniss doing the exact\nsame thing in ever scene! I cannot believe it took two hours and still\nleft some questions. Like what happened to Gale? What happened to the\ncity? District 13? I kinda liked Catching Fire, and when I saw\nMockingjay part 1 I thought, wow what a terrible sequel to Catching\nFire. The part 2 came out and I am so glad I missed it in the theaters\nnow. All I really saw of the movie is guys crying, and the lead\ncharacter walking through a battlefield. Also I'm sorry, there should\nbe some realistic scenes. Even in a sci-fi movie there's always one\nelement of realism. In other words. Don't watch it. It's not worth two\nhours of your life.\n"},
{"review": "\nI was expecting so much from this sequel, so very, very much more!<br><br>The story was superb, it was just as I expected, the fight, and the\nvictory. Then came the disappointing part. The resistance started to\nkill their own. It was so suddenly, although kind of expected when one\nlooks back, all about politics. They, the resistance, killed children,\nand others, to make it look as though it was Snow behind it. So totally\nunnecessary, as Snow told her, they had all, but surrendered, although\nit gave her all the more reason to kill the betrayer.<br><br>She was betrayed, then played. She took care of the betrayer, it was so\ngreat to watch, although not unexpected, but when it came to the one\nwho played her, she gave up, at least that's what I felt. That's the\npoint where I expected her to return, to gather the masses and raise\nagainst the new leaders, marching to the palace in front of a huge mass\nof people, overturn the government and announce free elections.<br><br>The closing scene should have been her, the victor of the rebellion,\nstanding in front of the masses as their newly elected president, not\nher, playing with her child and looking longingly at her husband. So\ncliché, so, what should I say, degrading to all women, that a woman is\nborn to bear children, not to be strong, to have guts to fight on, to\nbecome someone.<br><br>I gave it 3 stars, because of the last 5-10 minutes, otherwise I would\neasily have given it 10 stars\n"}
]