[
{"review": "\nMy heart is still rolling from the escape to 30's Europe this\nafternoon, and without jet lag. This movie is an inspiration, a dream,\na walk through a painting and a study of humanity. <br><br>Ralph Fiennes﻿ is a phenomenon as M. Gustave. his interactions with\nevery cast member and especially newcomer Tony Revolori are fantastic.\nThe later holds his own weight beyond belief and the entire film is an\namazing adventure with James Bond style chases, a large murder mystery,\nthe best placed cussing and of course the sensational cinematography.\nThe sets, models, angles and even the most nondescript characters come\nto life each on their own and together as a symphony of beauty. It's\nfreaking brilliant; The Grand Budapest Hotel.\n"},
{"review": "\nWes Anderson is one of the most original film makers working today.\nNone of his films can be categorized into any particular genre. His\nlatest, The Grand Budapest Hotel, which opened the Berlin Film\nFestival, continues that trend. It is a tale within a tale within\nanother tale. Whilst every shot has been meticulously arranged as\nthough a work of Art hanging in a museum, story wise Anderson has let\nhis imagination run wild. Though the tale (with Tom Wilkinson as the\nauthor of the story) and the tale within the tale (with Jude Law as the\nyoung author &amp; F Murray Abraham as the mysterious owner of THe Grand\nBudapest Hotel) have straightforward narratives, the tale within the\ntale within the tale, which comprises the bulk of the film and is set\nin the years preceding the Second World War, is a wild uproarious train\nride of story telling. It also boasts the cast of a life time: Ralph\nFiennes, Tilda Swinton, Edward Norton, Adrien Brody, Willem Dafoe,\nHarvey Keitel, Jeff Goldblum, Bill Murray, Owen Wilson &amp; countless\ncameos. It will delight Anderson fans but is more likely destined for\nArt house cinemas as it is too off center for mainstream audiences. The\nproduction design and music are outstanding and even the end credits\nare imaginatively done (and received another ovation from the\naudience).\n"},
{"review": "\nWes Anderson is one of the last directors -auteurs- who's got complete\ncontrol on the film set and has the power to make whatever kind of film\nhe desires. His distinct visual style is apparent since his 1996 debut\nBottle Rcoket. But that was just a start, with every film he made he\nwas perfecting his technique more and more. This marvelous attention to\ndetail, the way he composes his shots( tracking shots, the symmetry,\nthe characters running in slow-motion), chase scenes, love story,\nnostalgia, explanatory montages, the colourful set design and the\nprevalent theme of every one of his films: family. This all adds up to\nthe reason why the audience enjoys Anderson's film so much. This all is\nbrought to perfection in Grandhotel Budapest. <br><br>Through complex narrative framework, which itself is a mockery of all\nthese films that are being narrated by someone and is also being an\nexcuse for not being too realistic, we get to a story of a young lobby\nboy named Zero Moustafa and Gustave H. (Ralph Fiennes)the concierge of\nthe Grandhotel Budapest. Many of the female guests of the hotel mainly\ncome to enjoy Gustave's company. When one of these ladies passes away,\nGustave grabs Zero and boards a train for her mansion. Soon he's blamed\nfor her murder and hunted by police led by Edward Norton and a\ngrim-faced assassin played by Willem Dafoe. There also is a love story\nbetween two young teens - Zero and Agatha (Saoirse Ronan) who has a\nbirthmark in the shape of Mexico.<br><br>I frankly don't understand how can this film be successful in the USA.\nThis film is just so typically European, that I guess some aspects of\nthe film Americans just aren't familiar with. Some of the humor\nreminded of old French, Italian and Czech comedies. <br><br>Wes Anderson remains to be a stand-out filmmaker who never disappoints\nwith any of his creations and is a safe bet to rely on his qualities.\nYou won't want to return to the real world when the credits start to\nroll.\n"},
{"review": "\nAfter seeing the previews several times, I thought I would enjoy a\ndelightful almost-fantasy-like film. But, at age 64, after going to the\nmovies literally hundreds of times in my lifetime, I did something\ntoday that I've only ever done 3 times previously -- I walked out of a\nmovie halfway through the picture. I didn't blame Wes Anderson, because\nclearly his films have a following...but I thought it must be an\nacquired taste...that I had not acquired. I admitted that it was a\nuniquely visually pleasing film, but I wondered why so many fine actors\nagreed to what were rather small parts. At the time I said that this\nfilm bored me even more than \"Moonrise Kingdom\". <br><br>The the other night it was on cable. I thought I would give it another\ntry, but I fully expected to turn it off at home, also. Perhaps it\nhelped that rather than watch it all in one setting, I broke it into\nroughly 30 minute segments with breaks in between. Guess what. This\ntime I liked it. I'm not saying I loved it. But I did like it. What did\nI see this time that I didn't see before. Well, perhaps the\ntongue-in-cheek attitude of the film. The chance to see Ralph Finnes be\ndownright silly instead of his typical dramatic role. The wonderful\nphotography and special effects. The skill of young actor Tony\nRevolori. The pleasure of seeing F. Murray Abraham again. And, this\ntime enjoying the many \"cameo\" shots.<br><br>I still think it dragged on a bit too long (at 100 minutes there are\nstill a few small bits that could have been edited more tightly or even\neliminated). And, I'm still not a raving fan of it. But, this time\naround I did \"like\" it. But it won't end up on my DVD shelf, and I\ndoubt I'll watch it again. But, bravo...good (not great) job!\n"},
{"review": "\n21 March 2014 Film of Choice at The Plaza Tonight - The Grand Budapest\nHotel. I really had no idea what this film was about, having seen only\none trailer which in the event, bore no relation to the plot\nwhatsoever. However, my interest was piqued so this evening found me\nwatching a splendid little film packed to the rafters with stars. This\nwas the tale of Gustave H, the legendary and infamous Concierge of The\nGrand Budapest Hotel, a rather glamorous edifice perched atop a\nmountain and his protégé and most trusted friend Zero, The Lobby Boy.\nThis is a tale of friendship, murder, revenge and deep dark plotting.\nThere were some completely ridiculous moments which were quite\nrefreshing and several, what I like to call Guffaw moments where\nseveral members of the audience emit a loud blast of laughter followed\nby slightly hysterical giggling that you find yourself joining in with.\nAs I said a host of stars in this film ranging from Ralph Fiennes, Jeff\nGoldblum, Jude Law and Bill Murray to Tilda Swinton, Owen Wilson and\nHarvey Keitel to name a few, but one of the outstanding performances\nmust go to Tony Revolori, a relatively unknown young actor who plays\nZero, who is In almost every scene. An entertaining film, worth\nwatching.\n"},
{"review": "\nHaving been to a few of Wes Anderson's films, the twee, absurd\ncaricature, dead-pan precious, lush, scenic, cardboard Tim Burton-esque\ncinematography that many insisted is synonymous with \"intelligent\nhumour\" were all expected. What wasn't is the insufferable, sophomoric\nidiocy of the story, gratuitous characters and shallowness of the plot,\nthe script, the character development, the entire purpose of the making\nof this film. What on earth is it suppose to say?! What deeper layers\nare there to uncover other than it being a madcap caper about\npromiscuous hotel staff carrying on with obscenely rich geriatrics,\nmurderous villains and relatives, an outrageous and unbelievable\njailbreak adventure? What is the point to this wedding cake indulgence\nof a film, exactly? And please don't sniff haughtily with a \"You just\ndon't get its brilliance/genius/subversion/provocation,\nblah..blah...blah...go watch a Tom Cruise flick!\" retort. I honestly\ndon't get much more from this film than its gruel thin plot.\n"},
{"review": "\nA former lobby boy, Zero Moustafaw tells a story to a writer, who tells\nthis tale of a hotel, it's guests and the outstanding concierge\nMonsieur Gustav H to us. It's about (blind) loyalty, duty beyond the\nrequired, greed, stupidity, love for women in any age ... and the power\nof influence when treating persons with the grace of that person's\nbeauty. <br><br>It's (black) comedy at its best. The ridiculous becomes brilliant\nthrough cleverly constructed dialog, impeccable executed timing and\ntimbre change. Many camera shots are little art pieces like in Moonrise\nKingdom, beautifully constructed with cuts that ad to the timing,\nvisually. The production design takes you from the shabby to\nover-the-top kitsch to breath taking wooden interiors and mountains.\nThe CGI reminds me of Monty Python, deliberately unrealistic which is\npart of the humor yet makes it at the same time oddly believable.<br><br>Never thought of Ralph Fiennes as a comedic actor. He convinced me\nhere. Tony Revolori as young Zero Saoirse Ronan as Agatha are\nremarkable. And then there were: F. Murray Abraham, Jude Law, Tilda\nSwinton, Adrien Brody, Willem Defoe, Jeff Goldblum, Edward Norton, Léa\nSeydoux, Harvey Keitel, Tom Wilkinson, Bill Murray, Owen Wilson, (I\nthink I saw George Cloony for 2 sec)... Just to be able to get all\nthese heavy weights to sign up for minor roles, demands respect. To get\nthem all set their mark in a few minutes, is awesome.<br><br>\"He retained the illusion with remarkable grace.\" is one of the last\nlines in the movie. It describes both the main character and also the\nheart of the movie. This is a real 9 - beauty combined with dirt, great\ncinematography with dry jokes and art with silliness. If you like to be\namazed, see something out of the ordinary, are able to go with a flow,\nyou will LOVE this movie.\n"},
{"review": "\nHere we are with Wes Anderson's latest film, The Grand Budapest Hotel,\nwhich once again excels in everything Anderson knows best by delivering\nanother kind of film. This movie combines early comedy slapstick and\nhijinks with that Anderson dry humor and melancholy along with the\nrequisite great cast, performances, and set design to make this one of\nhis best films easily.<br><br>Good: I love the whole cast. Ralph Fiennes as Gustave is amazing and he\nis one of the best lead roles in an Anderson movie to date. Newcomer\nTony Revolori easily keeps up with Fiennes doing a fantastic job.\nEveryone else from Norton to Ronan are fantastic. The set design and\ncinematography are magnificent as usual with great scenery and cool\nchildren book style backgrounds. The comedy hits every time and it even\npacks some surprises to with a great murder mystery that gels with a\nroad film. There's even some sweetness underneath the zaniness giving\nit some surprising depth to it.<br><br>Overall, it's definitely one of my favorites of his movies and further\ncementing him as a great voice in movies today.\n"},
{"review": "\nAn extraordinary cinematic confection and probably Wes Anderson's\ngreatest film. Ralph Fiennes plays the concierge at the Grand Budapest\nHotel in the 1930s, which exists in a fictional European country in the\nAlpine range. He has a habit of keeping some of the old women who stay\nat the hotel company. When one (Tilda Swinton) leaves him the valuable\npainting Boy with Apple, Swinton's evil son (Adrien Brody) frames\nFiennes for the murder. Fiennes' closest companion, the hotel lobby boy\nZero (Tony Revolori), and his girlfriend (Saorsie Ronan) conspire to\nfree Fiennes from prison and sell the painting for loads of money,\nhopefully enabling them to leave the country, which is being overtaken\nby fascists. The story isn't much more than fluff (though there is a\nnice tinge of poignancy), but it's enormously amusing fluff. The highly\namusing trailer did give away many of the film's best gags, but this is\na laugh a minute movie. The visuals are absolutely delightful. Sure,\nit's all nothing you haven't seen before from Anderson, but I found it\nhis most perfect accomplishment. The film is loaded with great cameos\nand little roles (the woman behind me almost had an orgasm when Bill\nMurray appeared), but my favorite was Willem Dafoe as a toothless\nheavy.\n"},
{"review": "\nInteresting sets, beautifully locations, wooden characters. Too much of\nthe story takes places in trains, a prison and the countryside. I\nreally wish more of the plot had taken place in the hotel. Following a\nconfusing beginning (there is a double flashback), the story took off\nwithout any real direction or reason. When the movie ended, many people\nin the audience applauded. My feeling was \"that's it?\" All the\ningredients were there but the cake didn't rise.<br><br>Still, I'm not sorry I saw the movie. It was different and that's\nalways refreshing in a time of cookie-cutter plots.<br><br>At one point I noticed that the movie was no longer being shown in\nwidescreen but more of a television aspect ratio. Once the movie\nreturned to 1985 or the present, it was widescreen. Weird.\n"},
{"review": "\nDon't get me wrong, this is a funny-ish, quirky, alright little movie.\nBut it is just that. Alright.<br><br>How many Oscar nominations did it get? About a billion. While I watched\nit, never, not for a second, did Oscar come to mind. Although, the\nOscars is but a bleak shadow of what it used to be. Moving on. (I did\nnot know about the nominations when I saw it, just for the record)<br><br>This movie is quirky. Kind of strange, got some humor of the Wes\nAnderson-type, it's got a lot of strange characters, and an OK plot.\nBut never is it really fantastic. I think people just expect Wes\nAnderson to be brilliant, and so they think everything he does is.<br><br>As I said, it's mostly entertaining. But it never becomes much more\nthan OK. It has a lot of actors, pretty big names, which is part of the\nreason why I wanted to see it. But to be honest I expected more from\nthe movie it self. <br><br>Yeah, it's visually interesting, but everyone already knows that.\n"},
{"review": "\nI had great hopes for this film, I liked the previous titles of the\ndirector, and mostly, find him imaginative and cheerful. Also, this\nfilm featured a lot of good actors, and even Bill Murray!.<br><br>But it falls short, it's not really funny. There are a lot of dialogs,\nthat try to be fast and brilliant, but they get tiring after a while.\nThere are a bunch of repetitive jokes, that are not funny. I was really\nexpecting to laugh, and you know that feeling when you are trying to\nlaugh on a film, but it doesn't deliver. <br><br>Seems like the visuals, while powerful, were meant to be the main part\nof the comedy. But they don't really add a sense of comedy. Not even\nthe hotel is an important piece of the history. Maybe I was expecting\nit to be a comedy, but that was not the intention of the director?<br><br>And then, the just mere circumstantial appearance of Mr Murray.\n"},
{"review": "\nI don't know that I'd call \"The Grand Budapest Hotel,\" Wes Anderson's\nlatest bit of whimsy, exactly a misfire, but I certainly didn't like it\nas much as some of his other recent films.<br><br>Almost always there's a strong emotional core to Anderson's films that\nanchors the idiosyncratic absurdity that defines his style. But that\nemotional core is missing in this film, leaving us with a slew of\nAnderson creations, cartoonish characters that don't engage us because\nthey're not given time to. His film is stuffed with famous names, some\nof them Anderson regulars, some of them new to his world, but virtually\nall of them are given short shrift. I was excited when, for example,\nJason Schwartzman made his entrance, because he's been given the\nopportunity in previous Anderson movies to make such a comedic\nimpression, but he gets about two minutes of unremarkable screen time\nbefore the story whisks on to the next disposable character. It's the\nfirst Wes Anderson film I can think of that caused me to actually be\nannoyed by his self conscious style, a sure sign that in other respects\nAnderson was off his game.<br><br>I should add, though, that Ralph Fiennes is sensational. His\nperformance is the one thing about the film I can praise without\nreservation.<br><br>Grade: B\n"},
{"review": "\nWhat a waste of time and money. A cartoon type of film. Actor dialogue\nwas rapid pace and hard to follow at times. It appeared to me that\nthere was a lot of models used in lieu of locations. Went with another\ncouple who were really upset since I based my recommendation of seeing\nthis movie on comments made by reviewers. One seldom heard any laughter\nin the theater and when you did, it seemed contrived. The film\nattempted to capture the 1920 film making style but truly missed the\nmark. I saw some reviews liken the film to Around the World but it was\nnot even close in capturing that flavor.<br><br>Better off staying away from this dull piece of work. I think the\nproducers must have paid a lot of folks to submit reviews because I\nreally can't believe so many saw value in this corny flick.\n"},
{"review": "\nNever did i think that i would ever be enough intrigued by the\nawfulness of movie to create an account just to write a review about\nit. I can't possibly understand how some people would ever enjoy such a\nmovie. So boring and lacking an interesting story. Let alone the fact\nthat its not even funny! I felt sorry for the crowd watching the movie\nwith us, i could feel the pain in their eyes and i could hear the\nprayers inside their heads hoping that the movie gets better! I mean\ncome on look at it's high rating! It must be good, i will get better,\nit should! But it never did. I usually appreciate the \"artsy\" side of\nmovies, but this one i couldn't even swallow it. And don't even get me\nstarted with the horrible animated scenes. As an animator, it felt like\npoison to my eyes!\n"},
{"review": "\nWes Anderson must have been high as a kite when making this film. The\nonslaught of colour and the architecturally questionable locations\ncould only have been thought to be a good idea by someone who has just\nconsumed a truckload of industrial strength LSD. Frankly watching the\nmentally unstable characters bounce around the screen was an experience\nI can only compare to being repeatedly hit in the face with a sock full\nof sick. <br><br>The music was only comparable to listening to someone urinate on a cat\nand the script seemed like something that would spring from the mind of\na dog sat at a typewriter.<br><br>Ralph Fiennes was pretty good though.\n"},
{"review": "\nThis movie is annoying, pretentious and so full of \"hey look how clever\nI am\" moments by the director it makes your head hurt. Did Murray,\nFiennes, Kietel and Norton need money this badly?? They brought nothing\nto the movie. This movie was so boring and awkward I was verging on\nfalling asleep within 30 minutes.<br><br>At 55 minutes into the film I left the theater. I thought Brice Willis,\ned Norton, and Bill Murray working together on a film would ensure a\ngreat movie. I guess the producers spent all their money on casting and\njust settled for a poor script and bad direction. I've never seen a\nmovie with so little emotion and character development.<br><br>The film moved at a snail's pace with absolutely no intensity, don't\nwaste your money. This is the first film of the year to which I give\none star for it's reward. I cannot believe the misleading hype by Wes\nAnderson fans and film critics this film is getting. I sat there for 90\nminutes and I did not laugh once, and this was supposed to be a comedy\n(I only noticed about one person laughing in a pretty full theater).\nThe famous actors were cardboard cutouts. They appeared to do one day's\nwork and pick up a fat paycheck. This is the worse acting that Fiennes,\nNorton, Kietel. and Murray have ever done. Their lines never resembled\nanything humans would actually ever say to one another. In short, this\nmovie is for Wes Anderson fans only. Other people best stay far far\naway from this stink bomb!\n"},
{"review": "\n\"The Grand Budapest Hotel\", Wes Anderson's most successful film to\ndate, is visually enthralling, every frame a veritable art museum\npainting (and not just on the level of \"Boy with Apple\"), cleverly\nutilizing glass-paintings and CGI-enhanced locations in Germany and\nPoland actually to the level of picture postcards. That may also be its\nproblem. As interesting as the film would seem to be theoretically, it\nseems as hollow and superficial as a picture postcard. Its\nextraordinary cast members (which includes 11 previous Oscar nominees\nand 5 Oscar winners) posture themselves like mannequins throughout a\nfast-paced exercise that feels no deeper than an elaborate puppet show.\nAdmittedly, I've had a long-term aversion to Anderson's 'style', so\nannoying in its contrived stance of false naiveté. While overwhelmed by\nthe beauty in every sequence, I search in vain for the least empathy\nwith a single character and any emotion beyond the superficial. Many\nswoon over this film, but its adoration to me makes more sense on a\nsociological level in sync with the Twitter and Instagram sound-bite\nage we live in. As I said to a good friend (who's a Wes Anderson fan)\nafter we left the theater, \"How could anyone spend so much money on\nsuch a marvelous cast and such gorgeous images and produce something so\nshallow and emotionless?\" I'm still waiting for the answer.\n"},
{"review": "\nI am probably in a minority when I say that I didn't enjoy this movie,\nI wanted to like it, the idea seemed sound and the cast is a cavalcade\nof top notch actors.<br><br>I am still trying to work out what it was that made me dislike the\nfilm, maybe it was the simple fact that there was no plot to speak of,\na tenuous vehicle to give the actors a chance to show their stuff.\nAdmittedly the sets were grand (as the name implies), the production\ncompany went all out to create this world; and the acting was excellent\nbut there is a problem here too.<br><br>The problem I found with the acting was that each member the ensemble\ncast didn't get a fair crack of the whip when it came to showing their\nstuff. Most of the actors/characters got just a few minutes of time\n(apart from the leads of course), I wanted more interplay between these\nactors, surely there was time for that rather than long rambling scenes\nof inane dialogue.<br><br>When the film ended I was left with a feeling of \"so what\", I didn't\ncare about the outcome of any of the characters. I am sure that some\npeople will enjoy this but I didn't.\n"},
{"review": "\nStrip the harsher bits of the language and a few brief graphics, and\nall you have is a children's story. Add the language and graphics back,\nand you have a film suitable for nobody.<br><br>Visually, it's quite bold, but like the scripting, it suffers from not\nknowing when less is more. I felt like shouting \"shut the frack up\" so\nmany times, there were so many words with so little positive\ncontribution to my experience. Some of the less gaudy imagery, and the\nskillful integration of the music with the visuals, was quite\nGreenaway-ish, but please forget I mentioned a visionary like that in\nthe context of tripe like this.<br><br>Editing was painfully cartoonish. Plot was about as complex as a\ntypical children's cartoon too. Pretentious visual masturbation, not\neven particularly well done, to be honest - you can see the joins. Best\nleft on Wes Anderson's Kleenex, not my wall.<br><br>Oh dear, I've just found out that this was supposed to be a \"comedy\". A\nfew bits of slapstick does not a comedy make. Extreme drugs required in\norder to get any giggles out of this.\n"},
{"review": "\nI don't care for Wes Anderson. Every time trailers give me the\nimpression it's going to be funny, I'm deeply disappointed. For me, Wes\nAnderson's works range from stupid to really stupid. Grand Budapest\nHotel is typically stupid. What makes it a little better is the true\nhumor of the sets and costumes. From the Easter egg candy colored hotel\nwith delightful columns, a grand stair-step tram to raise visitors to\nthe heights of the hotel's entrance, delightful hotel staff costumes\nand villains costumed in traditional black, this Wes Anderson did give\nthis viewer one arena of entertainment that the rest, acting, story\n(what story?), plot (what plot?), characterizations (who cared about\nany of them?) lacked. I did enjoy the stellar cast. I think they do Wes\nAnderson's films because making them must be fun. <br><br>My favorite of the cast? Jeff Goldblum. I liked his character. And his\nwas the only character about whom I had any feeling for care or\nconcern.<br><br>Will I ever watch a Wes Anderson film? Yes, but only for the reason I\ndragged myself through it this time-- it was on the IMDb 250 top films\nlist on the 31st of December. For those who like Wes Anderson, your\nsense of comedy is different from mine, not better, just different. As\nfor me, I think I'll go back to Woody Allen films.\n"},
{"review": "\nI for one haven't recovered from the dissonance between this movie's\nrating on IMDb and my own viewing experience. Maybe my expectations\nwere too high because of the rating? It's one of those things that you\nlike it if you like it (circular argument, but that's exactly my\npoint). Many of the rave reviews I now realize come from Wes Anderson\nconnoiss-fans.<br><br>The positives: it is a feast of visual surrealism; it's a virtual\nfireworks of movie mega-stars that make for a dazzling show. But when\nthe smoke clears, there's not much left. Decent entertainment, but\nneither brilliant comedy nor sophisticated satire. The cast of the\nmovie would have been capable to deliver either in spades, but the\nscript and direction fell short.\n"},
{"review": "\nThis is only for people who are want something special from a movie. I\nwatched it based on IMDb rating and totally disappointed. I was\nextremely bored and it was a torture to watch it till the end. I don't\nhave words to express my anger. This was one of many movies I watched\nbased on IMDb rating and got disappointed. I now understand pretty much\nwhat kind of people come and rate movies in IMDb. Not those with\nsimilar taste as me of course. I sincerely hoped someone to write a\nreview same as mine, so I would have been prepared, but no all popular\nreviews are too positive. This means IMDb ratings are not for everyone,\nits for those who takes movies very seriously, not for people who wants\nsome honest entertainment for a few hours of their busy life. I will\nnever ever believe the ratings here.\n"},
{"review": "\nThird film I see from Mister Anderson... (wait for it... Anderson!!! -\nsorry, couldn't resist.) Anyway, third film I see and second\nconfirmation that the writer/director has nothing to say and no story\nto tell.<br><br>Still, if you like his previous works, you may enjoy this one as well.\nWhich I didn't either. To his credit, he has perfected his visual\ntechnique, and produced a lot of appealing pictures. Unfortunately,\nthat's all there is to see. It plays out as a long succession of\nvignettes, of stills, some of them very much like Flamish paintings.\nAnd the initial appeal gets old pretty quickly. It's not so much a film\nas it is a slide-show. Or at times a cartoon. Not a funny one; the\ncartoonish scenes, like the snow chase, are plain ridiculous.<br><br>Maybe, just maybe, Wes Anderson works hard to emulate some talented\ndirectors he likes, but without the flair and a decent writer. I must\nhowever commend his insistence in treating the mundane and the ugly in\nthe most aesthetic manner. Even desperate cases like Owen Wilson.<br><br>Definitely not my cup of tea. I'll watch another of his directorial\nefforts one day, but I'll wait for one that he doesn't write himself.\n"},
{"review": "\nI came to the cinema like a client promised the most wonderful menu at\na 3 star Michelin restaurant.It was truly an absolutely visual feast\nbut alas as much as I pushed the offering around my plate I found\nnothing by the time the credits rolled..<br><br>From the opening establishing shot of the impossibly located Grand\nHotel Budapest to the self indulgent and utterly pointless dialogue I\nhad to wonder how on earth did wonderful artists become involved in the\nfolly of The Grand Hotel.. What on earth were they doing in this self\nindulgent piece of nonsense.<br><br>Anna Pinnock as the Set Decorator as usual came to the plate and did\nthe most incredible work but I felt like a duck being prepared for the\nPate menu... <br><br>Sorry Mr Anderson and all those reviewers who have been taken in by the\nEmperors' new clothes... Such a waste of great talents from artists to\ndesigners etc..etc..I can only add that like all great artists there\nhas to be a detractor or two and I do not consider this man to be a\ngreat artist just overly self indulgent... <br><br>Imagination ,invention, does not a genius make.If I had felt in need of\nvisual stimulation there are endless museums and galleries I can visit\nbeginning with Tate Modern. <br><br>What a waste of 90 minutes or so .It felt like a lifetime ...<br><br>What a waste of the considerable budget!!\n"},
{"review": "\nI didn't check the spoiler box, because in order to spoil the plot,\nthere would have to be a plot.<br><br>Imagine, if you will, a parody of Wes Anderson films. It's impossible\nbecause that's what he does.<br><br>There's no plot because he doesn't need one and it would be unnecessary\nanyway. There's no character development because the usual suspects are\nalready there and his celebrity cameo players have already established\ntheir characters.<br><br>Yes there are funny parts, but after the first half hour you've seen\nall of them and the rest is just tedious.<br><br>If you are a Wes Anderson fan, you will love this, if not stay away\nbecause this has all been done before.\n"},
{"review": "\nI don't see what all the hype is about. I went into this film with no\nexpectations: --Didn't have a clue what it was about. --Hadn't seen any\ntrailers. --Heard it was a fast paced satirical comedy.<br><br>Really I felt this movie was pointless. Half way through the film I\nkept wishing I had gone to see something else. I chuckled a few times,\nbut overall I was bored. It didn't draw me in. I wasn't emotionally\ninvolved in the story.<br><br>Perhaps the fanfare with all the celebrity appearances is what had a\nparticularly nice appeal to others, but I am not impressed with\ncelebrity faces.<br><br>This is the first time that a film that scored a high IMDb rating has\ndisappointed me. I am puzzled at the disparity.<br><br>I cannot recommend this film. I thought it was a waste of my time and\nmoney.\n"},
{"review": "\nI think some moviegoers wrote positive reviews of this horrid picture\njust to show they belong to some intellectual elite, which they do not.\n(Written by graduate of a \"name\" law school, with an M.A. and Ph.D. in\npolitical science, not to brag, just to show I am not particularly\ndumb.)<br><br>I lost so much interest in this boring debacle that I almost walked\nout--I have, literally, never come close to doing that with any movie\nbefore, and I see at least 10 or so a month.<br><br>In the hands of a Woody Allen, it might have been tolerable, but not so\nhere.<br><br>I am glad it was a box office no-show,despite its appealing name. Thank\nGod some people apparently spread the word of how bad it truly is.\n"},
{"review": "\nFirst, this is billed as a comedy. At the showing we saw, nobody\nlaughed. At all. Nobody. The only reason I did not rate this lower was\nthat there were a lot of fine actors portraying their roles with skill.\nUnfortunately, the characters are two-dimensional, the plot is silly at\nbest, and even the cinematography is frequently cartoonish. There were\nwhole scenes that were amateurishly animated. Many lines that I think\nwere supposed to be shocking just came off dumb. Having funny stuff\ngoing on in the background can be a great device when used with skill,\nsuch as in Police Squad or even Mad Magazine, but then the background\nstuff has to actually be funny. None of this movie was. I'm sorry I\npaid money for this film, but even if it had been free I still resent\nthe waste of time.\n"},
{"review": "\nWhen I came to the theater to watch the movie, I had no preconceived\nexpectations about it. 20 minutes into the movie I realized that it was\nnot a movie made for large audiences, but rather a movie created to\nplease the sensibilities of those that view life in a peculiar way. It\nreminded me of \"The Big Lebowski\" and \"Adaptation,\" which have their\nown cult following.<br><br>The movie does rely on a superb cast of actors that won't disappoint\nany moviegoer; but the problem with the movie is the story itself. In a\nunique way, it rehashes old themes of greed, intolerance, and obsession\nwith the material world. It helps perpetuate the notion that humanity\nis flawed and that life has no ultimate purpose. It seems to reinforce\nthose sensibilities generated or amplified explicitly and implicitly by\nindividualistic life choices and humanistic thoughts within the\nconfines of the human experience.<br><br>Artistically, it lacks the complete range of human emotions necessary\nfor a wholesome movie. Nevertheless, in an uncanny way, it would\ncertainly connect with those that already made up their minds about the\nmeaning of life in a subtle and reaffirming manner.\n"},
{"review": "\nI attended this film with my wife and an absolutely packed theatre of\nmoviegoers. My wife fell asleep (literally) and about two hundred\nothers around us sat in uninterrupted silence as a litany of dreary\nantics and pratfalls ensued. Truthfully, there were no more than a\nhandful of audible giggles throughout the entire length of the film.\nPersonally, I found it mildly humorous at best. One interesting aspect\nwas watching the long list of cameo appearances by so many well-known\nnames, while the story, within a story, within a story narration was\nmildly intriguing. The chase scene in the snow was insufferably long\nand cartoonish. Such a disappointment.\n"},
{"review": "\nThe Grand Budapest Hotel is written and directed by Wes\nAnderson,starring Ralph Fiennes as a concierge who teams up with one of\nhis employees to prove his innocence after he is framed for murder.\nThis is the premise for the movie, but to watch it was boring. The\nmovie is filmed as if you are watching a play inside a dollhouse, if\nthat makes any sense. The so-called comedy is just pretentious and\nsnob. Of course some people find that funny, but for me it didn't do\nit. The entire movie didn't do it... It could have been a wonderful\nadventure, but I found the manner and style it was conceived to be too\nboring and pointless. The acting is excellent and that saved the movie\nfrom being a complete waste of time. This definitely isn't a movie for\nthe masses, and that being said, isn't a movie that an average movie\ngoer will enjoy. For some that's a good thing maybe, but for me this\nwasn't entertaining. Be your own judge.\n"},
{"review": "\nIn contrast to other reviewers, I am quite disappointed of this film.\nIt is a rather weak comedy aimed at a British/American audience with\nlimited knowledge of Central Eastern Europe's cultures and languages -\nand its bare content may therefore appear exotic and hilarious. The\nwhole actually resembles Swedish comedy movies from the 80s, but with\nmodern aesthetics.<br><br>The weakest link is the script and especially the dialog. The film\nstarts of in an extreme tempo, as fashionable nowadays, probably not to\nrisk boring any potential young and inexperienced viewers, maybe to\nappear smart and fresh - with the consequence of the audience losing\nhalf of what is going on. The extraordinarily many famous actors do not\nreach anywhere to potential - instead it seems like squeezing in as\nmany stars as possible in roles that do not offer full scope for their\ntalent.<br><br>The second character, Zero Moustafa, as young played by an\nIndian-looking (apparently Latino) actor, as old by a white Caucasian\n(why?), may ring fresh with current political news for a\nBritish/American audience as he is a refugee who has had to leave his\nhome country due to war - and due to this fact the constant\nnonsense-speaking Gustave excuses himself for a \"racist\" remark. And\nthen they run around lightly clad in the snow together for much of the\nrest of the movie. <br><br>For me, not finding anything funny, the only joy is the great\ncinematography, the photo and the music. The whole show is certainly\nwrapped in luxury paper - it feels like a waste with such weak content.\nBut dollar-wise it might still be a success\n"},
{"review": "\nWes Anderson is undoubtedly one of the finest directors we have working\ntoday, and this is very much evident throughout the span of his latest\nfilm The Grand Budapest Hotel. His choice of adjusting the screen\nformat, his color pallets and sleek cinematography are what save this\nmovie from being a flop. Yes, it is great directing. Yes the\nperformances, especially Ralph Fiennes, are top notch. This is a decent\nmovie, but decent is where it stops. It doesn't have anything to\nseparate itself from previous quirky and dark humor filled films that\nWes Anderson has released, it doesn't have the heart from Moonrise\nKingdom, the charisma of The Fantastic Mr. Fox, or the mystique from\nThe Darjeeling Limited. Yes, every director may have their own styles\nand tweak it differently for each of their works, but Wes Anderson only\nadds some minor plot differences to his films to make them slightly\n\"different,\" yet still far too similar. I have been fine with them in\nthe past, but by The Grand Budapest Hotel, his fourth main entry, the\ngoofy style becomes a little tedious and actually difficult to get\nthrough in some scenes. Many trivial things are presented as important\nmatter in drawn out sequences, making it all the more difficult to\nwatch. Yes, I am harshly bad mouthing this movie, but I did still find\nsome enjoyment in watching the gorgeous film making and the once in\nwhile funny script, but come the third act, all the twists just become\nmuch too predictable, and ultimately unsatisfying. I hope Wes Anderson\nhas something up his sleeve that can add variety into his collection,\nbecause my patience level for this is slowly declining. GRADE: C\n"},
{"review": "\nWes Anderson has great style and wit but THE GRAND BUDAPEST HOTEL is\none more effort from Anderson that is totally satisfied with being\nnothing more than cute. The film looks great, quite amazing in fact,\nbut really is this trite exercise all that this talented filmmaker and\ncast can really accomplish? A little soul, an inkling of depth or\ninsight would be nice. Anderson clearly has it in him to offer more.\nHis earlier films all reached much further. But now the cute factor has\ntaken over.<br><br>Ralph Fiennes totally scores though in a wonderful central role and\nTilda Swinton who is in the film for about 5 minutes leaves a very\nlasting impression in more ways than one.\n"},
{"review": "\nLoved it Loved it. Loved it. Beautiful, funny, smart, silly, sad,\nfantastical. I will probably see this movie at least a dozen more times\nin my lifetime. Can't wait.<br><br>Why is there a minimum of 10 lines required to make a review? Weird.\nAnyway...<br><br>Ralph Fiennes is wonderful. Could end up being a signature role for him\nand one that is remembered for some time - although I keep forgetting\nhis character's name. That's a problem.<br><br>All the usual players show up and their all good to fantastic. Willem\nDefoe is especially fun. Adrian Brody might be the weakest featured\nplayer in the movie. He just doesn't quite seem to match up with the\nrest of what's going on. Same with Ed Norton, although he's less of a\nsore thumb. But they aren't problematic for the whole movie. Just very\nvery minor distractions - for me, anyway.<br><br>I just loved it. So much!\n"},
{"review": "\nHaving lost almost 2 hours of my life watching this pretentious,\nawkward, tedious,repetitive nonsense masquerading as a film, I felt an\nurgent need to warn my fellow movie goers of this stinker of a movie.<br><br>The Great Budapest Hotel is \"in your face\" director's overindulgence in\nexperimenting. It lacks even pretense of trying to tell an entertaining\nstory. Its caleidoscope of disjointed themes crawls, mostly sideways,\nwith the dreadful quality of a nightmare.<br><br>One might fall into a trap of wishing to explore the latest \"oeuvre\" of\na \"cult\" director/screenwriter. For those of you be warned, you'll need\na strong motivation to sit through this indulgent mush of an experiment\nin viewers' goodwill.<br><br>The one star goes for some striking images which \"do not a movie make\".\n"},
{"review": "\nI gather that I was supposed to be thrilled by the \"artful\" use of\ncolor, costumes and props--especially color--in this production. And I\ndid find it pleasant for what it was worth. It was also fun spotting\ncelebrity cameos in nearly every scene. They were everywhere! A sort of\n\"Where's Waldo?\" in film form, with the hidden characters being\nHollywood stars. The budget of this film must have been astronomical.\nBut was it a great work of art?<br><br>I am afraid that I disagree with the reviewers who are raving about The\nGrand Budapest Hotel. It was somewhat fun to watch, but the story, let\nus be frank, was rather banal and a weird mishmash of genres. Some may\ncall that \"high art\" but to me it was more like a big glob of clichés\nfrom all of the different genres mixed together into one big pot. A\nmystery? A comedy? A romance? A drama? A slasher crime film (Dafoe\nplays a psycho professional killer)? <br><br>This creation ended up being a lot of color and good props and an\nexercise in style, but it lacked the overall coherence and brilliance\nof a masterpiece. Star power and style are good, of course, but they do\nnot alone suffice. <br><br>Would I watch this film a second time? Probably not.\n"},
{"review": "\nBefore I say anything negative about the film, I will admit that the\npremise is entertaining and had potential, and that it has a fantastic\ncast. That being said, I couldn't stand watching this movie, which is\ntypical for me when it comes to Wes Anderson. There may be some bias\nthere, but I find this, along with most of his other films, to be\ndesperately trying to catch and keep the viewer's attention with\nrapidly changing colors, plots, and characters. This greatly detracts\nfrom what could have been a very funny movie. It strikes me as\nsomething made for the ADHD people of the world, making sure something\nis constantly distracting the viewer. When you can focus and look past\nthe elaborate sets, you see a very shallow movie with little to offer.\nVery disappointed with that waste of my time.\n"},
{"review": "\nThis movie was one of the movies which was mysteriously interesting.\nEven though a bit of the focus of the story was laid upon the viewers\non the early part of the movie. The movie had me \"gespannt wie ein\nflitzebogen\". This masterpiece was perfectly made with distinctive\nvisual and narrative style. Same as Ronald Dahl's (Fantastic Mr.Fox).\nIt isn't one of those movies which were just twisted plots. It is THAT\nmovie that has twisted plots. After watching this movie i wished there\nwould be more movies with this kind of style. Worth watching. Final\nverdict its just something you should watch to understand.Something\nworth spending time on because for me its just \"That good\". Though\nthere were parts which made me say \"ugh\" or something in disgust or in\nreaction to violence. This movie made a mark on my mind. Made me smile.\nWhich most of the movies in our current gen don't do. 9/10\n"},
{"review": "\nA wonderfully funny fable of the adventures of world's greatest hotel\nconcierge (a brilliant, inventive and hilarious performance by Ralph\nFiennes) and the friendship he strikes up with the hotel's new lobby\nboy (a strong debut by newcomer Tony Revolori). <br><br>The story goes in many unexpected directions, every one entertaining\nand eccentric, and the cast is full of first rate highly comic\nperformances by F. Murray Abraham, Adrien Brody, Willem Dafoe, Jeff\nGoldblum, with terrific cameos by Bill Murray, Harvey Keitel, Edward\nNorton, Tilda Swinton, Jason Schwartzman, Tom Wilkinson, Owen Wilson,\nJude Law and others I feel bad for forgetting here. <br><br>While not Anderson's most profound film, it may be his most joyful. I\ndon't think I stopped smiling from first frame to last, and I laughed\nout loud quite a few times. And yet, as in any good fable, there is\nsome real poignancy as well. A top notch marriage of a lovingly crafted\nart-film and a wacky human comedy, something rarely pulled off with\nsuch panache. Even my friends who don't enjoy Anderson's work in\ngeneral had nothing but good things to say. The sweetest treat of the\nmovie year so far.\n"},
{"review": "\nOrson Welles Famously said something like \"Hollywood has given me the\ngreatest toy set a boy could ever want.\" Wes Anderson is one of the Few\nNew Hollywood Directors that has Embraced that Boyhood Enthusiasm and\nUnleashed it Upon His Body of Work with Joyful Abandon. He doesn't give\na Hoot if it is Commercially Viable, Sellable, Marketable, or even\nUnderstood by the Great Unwashed. This is Anderson at Play take it or\nleave it.<br><br>Most Critics Love His Quirky, Offbeat, Out of the Box take on\nMainstream Movie Making and Relish in His Delivery of Unexpected,\nUntried, Ultra-Realism. His Dialog is not Easily Digested and doesn't\nFit Comfortably in the Ear. His Visuals Overwhelm the Eye and Stimulate\nCortexs that are Not Known to Exist.<br><br>Watching His New Movie it is Obvious that He has Perfected His Craft\nand is so at Ease with His Art that the Complications look Effortless.\nWhat Emerges is an Art Form within an Art Form for the Art-Film\nConnoisseurs and a Vibrant Free for All for Anyone with a Modicum of\nInterest in being Entertained, Albeit, in a Distinctly Unconventional\nMethod.<br><br>No One is Making Films like Wes Anderson and there Probably isn't Room\nin the Multiplexes for Many to Try, and some may be Relieved that He is\na One of a Kind. It is Verbally Futile to Describe the Insanity of the\nPlot and to Try and Review what took place On Screen. It is better to\njust sit back and Watch it All Unfold and be Amazed at its Wonderful\nand Fully Fledged Pretensions.<br><br>Note\u0085If you really must know what it is about then be advised, it is a\nscrewball, slapstick, satire, fantasy, action, romp. The Marx Brothers\nmeet Monty Python. But that hardly begins to describe what it is. It is\nmore, maybe, or less perhaps. Depending.\n"},
{"review": "\nIt's gorgeous to look at, often witty, and has a few brilliant casting\nchoices. But two thirds of the way through, the charm wore off.<br><br>It's not certain now exactly where it started to feel wrong. Maybe it\nwas the nested story within a story within a story; maybe it was the\nway that the older Zero M. didn't match the appearance of the younger\none (the eyes?) Maybe it was the unfortunate things that kept happening\nto M. Gustav, which were unexpected after seeing the trailers and\nposter. Maybe it was the shifting accents of the Americans in the cast;\nJeff Goldblum started talking about \"Mah-dem\", then switched to\n\"Mah-dahm\". Maybe it was the that M. Gustave, who is usually quite\naware of his surroundings and predicament, was sometimes clueless. When\nBill Murray finally made his appearance, nothing special happened.\nWhatever it was or whenever it happened, it was disappointing.\n"},
{"review": "\nI hadn't heard of this film when I and my wife decided to watch it on\nSky a couple of days ago and I was stunned when I heard today it was up\nfor multiple Oscars.<br><br>We couldn't make it past about 40 minutes - it literally did nothing\nfor us at all. It just seemed dull, awkward and a bit too arty at the\nexpense of plot.<br><br>I don't mind films starting slow and laying the foundations for the\ncharacters and the plot. But this film just didn't appear to be\noffering me any incentive to stick with it.<br><br>Maybe we were missing something. Or maybe this is one of those films\nyou're supposed to like even if you don't\n"},
{"review": "\nI am shocked how well this movie has done among IMDb users and critics.\nThe cast is amazing, but the movie is truly terrible. I walked out of\nRushmore and would have done the same here. The characters were\nannoying, the dialog pointless and I was just waiting for it to end.\nBleh.<br><br>I did not understand why any of the characters acted the way the did.\nThe little cuts that Anderson employees so freely for dramatic effect\njust seemed pointless. There was a sequence where there were cuts\nbetween different hotel managers that was funny through two cuts and\nthen just dragged on and on as each manager had to stop what he was\ndoing and put his Boy in charge. That is this movie in a nutshell -- it\ndragged on and on. That could have been interesting to see how a whole\nnetwork of hotel managers could have been activated, but it just ends\nup being pointless.\n"},
{"review": "\nI have given this film 1/10, only because it is not possible to rate it\nzero. <br><br>I don't know why I never learn: ever since Rushmore, a film to which I\nsimply could not warm up, every time I watch one of Wes Anderson's\nfilms, I end up disliking it intensely. That was the case with\nRushmore, then The Royal Tennenbaums, followed by Moonrise Kingdom, and\nnow The Grand Budapest Hotel. <br><br>Two of my good friends, whose judgment in films I trust, told me what a\ngreat film this was. With that in mind, I began watching it, but within\n20 minutes, I realized I would not like the film, just as I had not\nenjoyed watching the other Anderson films before. One reason was the\nmanic pace at which the actors delivered their lines and the musical\nscore rolled; another was how completely indifferent to their\npredicaments the characters left me. <br><br>The Grand Budapest Hotel is a pretentious film, in which visual style\nstifles any substance its talented actors might have brought to the\nstory.\n"},
{"review": "\nSo, here I am again after trusting the IMDb rating only to be\ndisappointed. Does this movie deserve the 1 star rating that I have\ngiven it? No. Does it deserve the bloated hyped 8.4? No. This movie is\na 6. However I feel as though I owe to the IMDb community to help\nbalance the rating.<br><br>I was looking forward to this movie, excitedly anticipating it's\nrelease date. Visually, this movie had it all, which is what you would\nexpect from a Wes Anderson movie, however, it did not have anything\nelse. It was almost as though we are expected to be satisfied by just\nthat. Don't get me wrong, I love and cherish most of his works. I mean\nMoonrise Kingdom has to be one of my all time faves..and Fantastic Mr\nFox's genius screenplay will always be my cussing fave. But this movie\nfelt empty, it lacked something. You cannot churn out the same visual\nbeauty every time and expect the same hype, there needs to be\ninnovation, whether it is visually, via screenplay or plot. This is\nwhat upsets me, there was no innovation. Without innovation there's\nnothing new, the punchlines are few and far in between, the plot was\nboring and character's were not well rounded.<br><br>Maybe the money that should have been spent developing the above was\nspent sending armies of people to bloat this rating. I don't know. I\nwill not jump on this \"It's a Wes Anderson movie so I have to love it\"\nbandwagon. That's my rant over. Until next time!\n"},
{"review": "\nDear Mr Anderson Want to know the secret behind creating The Grand\nBudapest Hotel? Follow the instructions given below to create a \"The\nGrand Budapest Hotel\" yourself.<br><br>1. Imagine yourself as a hybrid of Henry Orient, Chief Inspector\nClouseau and Dr. Fritz Fassbender on his scooter. Train your optimus\nprime to ride on Tightropes across chicago.<br><br>2. Immulate or just ripoff old Blake Edwards movie films you have seen\nand have you cast do the same, but first strip them off any humor thus\nensuring 'quirkiness'.<br><br>3. Some films just shouldn't have been made - and this 'comedy' is one\nof them. It has a starry cast that includes top-flight comedians and\ndistinguished dramatic actors, yet the whole thing just turns into a\nsorry mess.I kept waiting for this film to get funny. With some of my\nall time favorite actors, I figured this would be an knee slapping\nfunny movie - it wasn't. Don't waste your time on this film, watch a\nreal Blake Edwards film if you want action, or one of Sellers' Pink\nPanther films for comedy for this film was sadly lacking in both.\n"},
{"review": "\nI can barely bring myself to write a summery of plot. I gave up paying\nattention after 15 minutes. A hotel employee is framed for the murder\nof one of the frequenters but none of it is actually essential to the\nfilming of a project that most likely appeals to Wes Anderson fans\nonly. <br><br>With a pinch of 30's slapstick here and a steal from Burton there, one\nfinds himself a hostage for 2 hours having already paid the admission\nfee. Familiar faces come and go as the ridiculous and overbearing\nAnderson antics occupy the screen. Repetition is not a problem here.\nThe jokes are funny only when on certain drugs and the story a mere\nvehicle that could have been about a snowflake falling in love with a\ncloud if it would provide the required running time and the opportunity\nto set a handsome decor. Though Fiennes gives us one of his best\nperformances to date, I wouldn't recommend this juvenile exercise in\nself-indulgence to anyone.\n"},
{"review": "\nWatching this movie in theater Concordia in Enschede The Netherlands, I\nhad to laugh, was touched by its irony and the romance of the hotel and\nthe 'Austrian' empire. And of course all those (great) actors playing\nin it. The descent from the ski-piste beginning at the monastery at a\nmodel piste was great. So was the music by Alexandre Desplat.<br><br>The crossed keys society was brilliant found. Does the pope know about\nthis?<br><br>Furthermore the usually aspects of a movie: love, romance, action etc,\nbut all with a twist.<br><br>Just see this movie ;)\n"},
{"review": "\nI avoided this movie when it came out, since the last two films I've\nseen of director Wes Anderson, The Light Aquatic and the Darjeeling\nLimited, were utterly terrible. Only with the recent multiple Oscar\nnominations of this movie, I decide to give this a chance. And guess\nwhat: it is a great movie, his best since the Royal Tennenbaums. Set\nmostly in the 1930s in a fictional Central European state (the film was\nmostly shot in Southern Germany) - though with a nifty introduction\nfrom the 1960s that frames the narrative with Jude Law and F. Murray\nAbraham - the Grand Hotel Budapest tells the story of the said hotel -\none in the classical European style - that is run by the concierge M.\nGustave (Ralph Fiennes) helped by the bellboy Zero (Tony Revolori)<br><br>Fiennes is great as Gustave, a cultured, suave womanizer specialized in\nwooing elderly ladies who sees himself as a beacon of civilization in\nan age of increasing barbarism. When one of his \"customers\" (Tilda\nSwinton) dies and decides to give part of her inheritance to Mustafa,\nher two psycho sons (Adrien Brody and Willem Dafoe) will left no stone\nunturned in trying not to give others what they think is rightfully\ntheirs.<br><br>This movie has an impressive all star cast. Along with those already\nnamed, we also have Edward Norton, Jeff Goldblum, Harvey Keitel,\nSaoirse Ronan, Mathieu Amalric and (in smaller roles), Bill Murray, Lea\nSeydoux, Owen Wilson and Jason Schwartzmann. And Anderson's mannerisms\nand eccentricities are not so off putting here (well, maybe with\nexceptions, like what does the mole with the size of Mexico in Saoirse\nRonan means?). Inspired by the writings of Stefan Zweig.\n"},
{"review": "\nWho would have guessed the ideas for this preposterously hilarious film\ncame form the seeds within Stefan Zweig's mind? Well, Wes Anderson is\nthe man about wild ideas and he surpasses his own impressive credits\n(Moonrise Kingdom, Fantastic Mr. Fox, The Royal Tenebaums, Rushmore,\netc) with this zany and delightful romp.<br><br>GRAND BUDAPEST HOTEL recounts the adventures of Gustave H (Ralf\nFiennes, a legendary concierge at a famous European hotel in the\nfictional Republic of Zubrowka between the wars, and Zero Moustafa\n(Tony Revolori), the lobby boy who becomes his most trusted friend. The\nstory involves the theft and recovery of a priceless Renaissance\npainting and the battle for an enormous family fortune -- all against\nthe backdrop of a suddenly and dramatically changing Continent. The\nbig-time cast includes Mathieu Amalric, F. Murray Abraham, Adrien\nBrody, Willem Dafoe, Jeff Goldblum, Harvey Keitel, Jude Law, Bill\nMurray, Edward Norton, Soarise Ronan, Jason Schwartzman, Tilda Swinton,\nTom Wilkinson, Owen Wilson, Bob Balaban and others. <br><br>Granted, you must be in a good state of mind to get all the innuendos\nand in-jokes that fly through this film, but go along for the ride. It\nis gorgeous to look at, has glorious musical score by Alexandre\nDesplat, and makes of an evening of escapist fun. Grady Harp, December\n14\n"},
{"review": "\nA movie hearkening back to the days between the World Wars, to a time\nwhere properness, good manners and dignity still reigned supreme. All\nin good fun, of course. The Grand Budapest Hotel is the best kind of\ncomedy because it refuses to admit it's one. The events are humorous,\nof course, as are the character, but those characters always act\nseriously, as if the bizarre things happening around them are the norm.\nThere's no winking at the audience, except on a story level.<br><br>The humour is also more intelligent than in most Hollywood comedies. It\ncan play with your expectations and pulls its laughs not from lowbrow\njokes but from absurdity, straight man routines and from developed\ncharacter traits. There's no clowning around, rather adult people are\nmade to look silly when the movie starts pulling apart their everyday\nroutines and revealing the hilarity underneath.<br><br>It's also a gorgeous movie on all levels. The camera work is superb and\nthe whole movie has a fantastical visual style that both strengthens\nthe jokes along with providing a plethora of its own. The talented cast\nalso deserves a special mention. Ralph Fiennes shines as M. Gustave, a\npeculiar hotel owner known for his eccentricities and impeccable\nmanners. Such a delightful character and his sheer poise is the source\nof most of the humour.<br><br>The Grand Budapest Hotel is a must see for all Wes Anderson fans and\nall of those that want to see a comedy with wit, style and finesse.\n"},
{"review": "\nThe Grand Budapest Hotel is an old relic in the eastern European former\nrepublic of Zubrowka. In 1985, the author of the book Grand Budapest\nHotel (Tom Wilkinson) recounts how in 1968 he (Jude Law) got the story\nfrom Mr. Zero Moustafa (F. Murray Abraham). He talks about his early\nlife as Lobby Boy (Tony Revolori) with the original concierge M.\nGustave H. (Ralph Fiennes) in 1932 who was willed a priceless painting\nby Madame Celine Villeneuve Desgoffe und Taxis (Tilda Swinton) setting\noff a battle with the woman's family led by her son Dimitri (Adrien\nBrody) and the violent Jopling (Willem Dafoe). Gustave is arrested for\nMadame D's murder. Agatha (Saoirse Ronan) is the girl of purity who's\nin love with Zero. Kovacs (Jeff Goldblum) is the executor of the will.<br><br>This is a new high for Wes Anderson. He's filled this with his usual\nunique visual style and his quirky characters. In addition, he has used\nit in an exciting thriller with a bit of mystery. There are some really\ndangerous bad guys. There is real tension that isn't always there for a\nWes Anderson film. He always had the quirky, the fascinating and the\nunique. This has so much more than that. It's a pretty fun thrilling\nride.\n"},
{"review": "\nWes Anderson's films are really hard to describe or define. Suffice to\nsay that he is unique in his style--very unique. This uniqueness is\nwhat makes \"The Grand Budapest Hotel\" worth seeing. It's an odd story\nwhere a story is told within a story--and it's filled with famous\nactors making lots of odd cameos. And, like Anderson's other films,\nit's full of odd characters, unusual dialog and brisk-paced editing.\nAnd, not surprisingly, it's NOTHING like other films by other\ndirectors.<br><br>The bottom line is that all these weird factors work together to make a\nfilm that you'll probably enjoy--but, like me, you won't be exactly\nsure why!\n"},
{"review": "\nThe Grand Budapest Hotel is now one of my absolute favorite movies.\nI've never read the book, but the film was fantastic. Some of Wes\nAnderson's other movies(The Royal Tenenbaums, Bottle Rocket, etc) are a\nbit slow paced and lost my attention at times. However, The Grand\nBudapest Hotel held my attention throughout the entire movie. It's\nfast-paced and I fell in love with all of the quirky characters. It's\nsuch a great, feel-good movie and I highly recommend it! Ralph Fiennes\nis wonderful, as are all of the usual actors in Anderson's films. I was\nworried the film would be slow, but it was so endearing and\nentertaining! Every little detail and quirk made it so much better!\n"},
{"review": "\nI am not very experienced when it comes to Wes Anderson. I despise his\nadaptation of 'Fantastic Mr. Fox' and I had not seen another of his\nfilms, until Grand Budapest Hotel (GBH).<br><br>I have now however decided to add GBH to my favourite films list, and\nfor good reason. Firstly the drop dead gorgeous cinematography, which\nis so stylish and clever that it almost becomes a character in its own\nright. The angles used perfectly to emphasis the emotions of the\ncharacters and give personality to the settings (most notably the hotel\nitself).This along with the lavish set design and stunning scenery are\nundoubtedly the film's greatest strength and are amongst the greatest\nexamples of the craft I have ever seen. If the Oscar's fail to\nrecognise these achievements, I shall be horribly disappointed. <br><br>The performances and writing are also great. Ralph Fiennes steals the\nshow with his hilarious, detailed and unique performance in the lead\nrole. Adrein Brody, Tony Revolori, Willem Dafoe and Saoirse Ronan also\ndeserve praise for their enjoyable and distinct efforts in the films\nglorious ensemble cast. All the characters are written beautifully and\nhighly entertainingly, with Anderson injecting his style without\nallowing it to overwhelm the film or consume the characters.<br><br>Finally, I appreciate the film's sharp pacing and tone. It keeps things\nbrisk, light and energetic (I'm amazed so much was squeezed into 90\nmins so effortlessly), however still for slow moments of character and\natmosphere. The film also balances darker character moments and the use\nof the film's primary framing device is integral to it's almost\ndreamlike atmosphere.<br><br>In conclusion, Wes Anderson has won me over with his masterful work. I\nguess you could call me a fan now after all.\n"},
{"review": "\nMost films that are released now are either cheap comedy films, cliché\naction films or superhero movies. Apart from some exceptions. The Grand\nBudapest Hotel is one of those exceptions. With the perfect blend of\ndark humour, a brilliant storyline and fabulous directing this\ncertainly is Wes Anderson's best film yet. Anderson's films are\ndefinitely stylised to say the least and not all people like his style\nof still shots with a vintage look and feel. Personally I love it, he\nis one of this generations best directors. That man is an artist. You\ncan tell the amount of effort from, not just Wes but the cast as well,\nthat went into every shot to make it as good as it can be. The\nsoundtrack matches perfectly to the film and the humour is\nlaugh-out-loud funny. The Grand Budapest Hotel is now one of my all\ntime favourite films and I am proud to say so. I look forward to\nAnderson's films to come and I hope he continues to make fantastically\nbeautiful films for a long time.\n"},
{"review": "\nI have not seen all of Wes Anderson films, but what I have seen I like.\nI have not seen every picture in the museums of Europe and New York,\nbut of the ones I have seen I know which ones I like. I liked this film\nvery much; I like it better than any film I have seen this year. It is\nvisually pleasing, the actors are familiar and magnificent and the\nstory was timeless and incredibly human. It is an original work of art\nthat uses humor to convey the realities of human behavior, including\ngreed, lust, love, brutality and the idea that life, in the end, can be\nwhat we make it. Ralph Fiennes, Tilda Swinton, Edward Norton, Adrien\nBrody, Willem Dafoe, Harvey Keitel, Jeff Goldblum, Bill Murray, Owen\nWilson and others will keep you entertained while Anderson spins this\nhistorical fairy tale. This film might not be for everyone but as\nAnderson says, you can tell he gets it.\n"},
{"review": "\nCamp, pure camp. Wild farce. Nostalgia. Tears, laughter, fear, joy,\nwonder. You must, you simply must, let this film take you on it's\nbizarre journey into Europe's past. Accolades are inadequate. It will\nbe watched over and over. And over. Each character is presented with\nsuch skill that after only two viewings, I can visualize and describe\nat least a dozen of them. The plot elements are secondary and are only\nas the plate is to the wonderful dinner. The story of Old Europe\npassing away as the war rages all around, can only be told as the\npeople who lived it are shown. Anderson shows them, and makes the\nviewer feel that he has comprehended their true nature. It is so sad\nthat they are all gone now. The distant past, known to my grandfather.\nAll faded into the pink mist.\n"},
{"review": "\nArtistically a triumph, cinematographically peaking with experiments\n(variating dimension viewing formats e.g. 16:9, 4:3, 16:10 e.t.c.\nregardless from their cinematic-friendly potentials), and finally some\nscreen writing common sense providing narrative coherence (the\ntechnique of off-narration hadn't been used thus, since the time of\nGood Fellas and Casino)with deliberate and tight pacing of rhythm, that\nmaximizes suspense and leads into a grand finale only to retrieve back\ninto the opening sequences once more.. i'm not commenting on the all -\nstar cast performances, or on the intriguing music score, which were\nmore than adequate and efficient to finally help the filmmaker\nvisualize this wonderful project. At last a clear and undisputed\nnomination for cinematic Brilliance!! If the music band tool ever made\na film this one easily could be it!! A film that many contemporary\ncreators should envy..\n"},
{"review": "\nI just watched the movie and I'm not even sure if I understood all the\nimplications of what I saw: I wonder if the settings, the register of\nthe dialogues, the many and many things that delighted me meant more\nthan what appeared at first sight. If something hidden hit me. I can\nonly say that in the end I was really touched, as if I were in love\nwith what I just watched. I think it was the brilliance of a human mind\nthat struck me so much.<br><br>I never read Stefan Zweig's writings although I'm aware of how great a\nwriter he was. I'm particularly intrigued now by his autobiography,\n'The World of Yesterday', if for no other reason than for the fact that\nhe completed it the day before he took his life. But while watching\nthis film I couldn't help but thinking of the great deal the Author\nowed to Georges Remi's Tin Tin for the relentless action, the\nsilhouettes, the endless running and the overall imagery.<br><br>There are no flaws in this film, I can only state my admiration.\n"},
{"review": "\nI have never been fortunate enough to watch works of the Director Wes\nAnderson but I do not usually connect with the works of a director in\ntoday's movie industry but the satisfaction of laying eyes over the\nimagination and absolute freedom of this director attracted me to write\na review.<br><br>The Grand Budapest Hotel wasn't flawless or a masterpiece in my eyes or\neven what I would categorize as a movie. It was odd even in the oddest\ncategories of films that I have had a chance to watch. It merely gave\naway a confusing vibe, felt cheap at points and it had wrong pacing at\npoints but the fact is that The Grand Budapest Hotel is a movie for\njust about 2 minutes until you are immersed into the words of a book\nfor a matter of minutes and then again into imagination and thoughts of\na fantastic listener who barely lays a word into the story. It is\nconfusing but yet it all feels so cunning and organized that even from\na newbie's perspective of his work it seems that even the confusion and\npacing was so brilliantly placed. I will leave the rest for your eyes\nand imagination. <br><br>As for the rating, I would give this movie a 10/10 because of how much\nfreedom the director took, it made my jaw drop at points and had a\nsincere smile and a few killer laughs at times. I will watch it again\nvery soon for that I already miss the feel of great imaginative\nadventure with a touch of brilliant comedy in this film.\n"},
{"review": "\nAh,Wes. You never cease to amaze me. This is one in a row of many that\ncame before it. I feel like this could only be called a ''little\nbrother'' of a movie,strange as it may sound. In retrospect,I can see\nmyself watching it with a hot cup of tea (or coffee),on a rainy\nday,wearing a big woolly jumper,all wrapped up in my favorite blanket.\nOf course,none of the mentioned was actually put into action. None the\nless,this picture is such a treat. Similar to Agatha's 'Courtesan au\nChocolat',it is a beautifully decorated piece of perfection,hiding a\nchocolate surprise on the inside,and packed in a pretty pink box with a\nsignature blue ribbon. A few things come to mind with such a grand\nslice of cinematography; the guests(ranging from somewhat sane to\ncompletely cuckoo),Mr. Gustave's polished black shoes,and of course -\npink. Pastel pink everywhere. I also take a liking to the hints of\nawkwardness that arise,as well as the tension in the air between the\ncharacters,so thick you could cut it with a butter knife. Or\nperhaps,the 'Throat Slitter'... It is clear,from the very beginning of\nthe movie,that everything had to be done perfectly,or the magic of this\ndivine hotel would be lost. A tiny slip up is all it would take for us\nto lose the smile that'd been lingering on our faces through the whole\nfilm. I can say,with out a doubt,much like the painting 'Boy with\nApple',this quirky movie is a masterpiece!\n"},
{"review": "\nI was very disappointed. At points I thought it could have been a good\nfilm; good actors, good decor, seemingly reasonable budget. With such a\nhigh rating I expected a decent film, however, it is lacking in\nsuspense and excitement, as in my opinion the most intense or\ninteresting parts of the film are made light of, making it rather\nmonotonous. The story and the film in general after the first 45\nminutes or so became rather boring to the extent I would have got up\nand left had I been alone. There is no real connection with the\ncharacters or the plot and the viewer is left indifferent as to the end\nresult. I found to be meaningless and insincere, and found myself\nwanting the film to end just so I could leave.\n"},
{"review": "\nThe trailer in the extra features section really sets the tone, letting\nyou know you are in for an extraordinarily pretentious and\nself-indulgent mess. Most people will hate this, but even if you are\ndrawn to the descriptors avant-garde and quirky you may still be\ndisappointed. The Grand Budapest Hotel embarks on what is supposed to\nbe a surreal, violent, grotesque, mythopoeic, symbol-laden, allegorical\njourney to spiritual enlightenment. Even taken as a series of\nallegorical parables, the experiment is a failure. The imagery is\nrarely interesting, and the symbolism manages to be at once\nheavy-handed and empty of real meaning. Ideas are essentially thrown at\nthe proverbial wall in the hope that some will stick, like a novice\nwriter who overuses Bartletts and Rogets in an attempt to show off.<br><br>Wes appears to lack original ideas and so makes superficial use of\nsymbols he doesn't truly understand in a series of cinematic\nMalapropisms. The film is poorly acted, amateurish, incoherent dreck\nwhich tries to convince the viewer that it is something more. Various\nreviewers have described it as masturbatory, which is accurate.<br><br>The truly great surrealist artists reject conventions as a choice, but\nare capable of folowing them: Breton could render a realistic portrait\nof quality. Many who style themselves as surrealists are people who\nproduce chaotic and shoddy works because they aren't capable of\nanything else. Don't feel like you have to like this to impress your\nfriends. Its crap. And if you must watch one surrealist western\ncentered on religious themes to make your checklist complete, queue up\nGreaser's Palace or El Topo instead. They are superior on many levels.\n"},
{"review": "\nWhile the film was beautiful pictorially, the all-star cast was wasted\non a flimsy script that couldn't decide whether it wanted to be funny\nor serious. The story itself is a good one, and might have been very\ncompelling if it were handled in a serious way but they way it was\nhandled was plain awful. If Anderson wanted to make a comedy if should\nhave had many more laugh lines in the script. The chuckles from the\naudience were few and far between, and in fact, they almost sounded\nsomewhat embarrassing, like we're supposed to laugh at this part. You\nreally wonder whether any of the cast actually read the screenplay\nbeforehand. I'd have to say this was pretty disappointing.\n"},
{"review": "\nI saw this movie this evening with a feeling of anticipation. After\n\"Moonrise Kingdom\" (my own personal Anderson favorite), I was somewhat\nskeptical that he could top my favorite, and my skepticism was\njustified. It was colorful, and had quite a few laughs, but that's\nabout it. A lot of actors were quite simply under-used. Tilda Swinton\nhad so little to do that a simple portrait of her would have sufficed.\nBill Murray with his oh-so-obvious American accent was totally out of\nplace. I suppose if I had read the works of Stefan Zweig, I might have\nenjoyed this movie more than I did. But then there's the possibility\nthat I wouldn't have enjoyed Zweig either. Over the years, I have come\nto judge movies by whether or not I would want to view it more than\nonce, and perhaps purchase a copy of it. I have a copy of \"Moonrise\nKingdom\" which I have viewed a number of times. It is part of small\ncollection that I like to watch on occasion. Sadly, \"The Grand Budapest\nHotel\" will never be part of this collection.\n"},
{"review": "\nIf you go to see Bill Murray, Owen Wilson, Jeff Goldblum, Jude Law,\nTilda Swinton, or Tom Wilkinson then you'll be disappointed. Their\nparts are something less than cameos and really don't give them an\nopportunity to do their thing.<br><br>What was great about The Life Aquatic was its spoof of Jacques Cousteau\nand his milieu, something specific and real to bounce the comedy off\nof. The Grand Budapest Hotel has no real-world anchor and thus it's\njust a silly farcical story. The self-important concierge, M. Gustave\n(Ralph Fiennes) takes himself, his position, and his hotel way too\nseriously. How much funnier it would have been had there been some\nreal-world character to set Gustave against.<br><br>The film is set ambiguously in 1930s Europe, even the Nazi thugs are\nambiguous; their SS insignia looks like the scribble of a lazy physics\nprofessor. The special effects are period too. There's a chase scene on\nskis and sled that is ridiculously low-tech. How much funnier it would\nhave been if there was something real world to measure it against like\nCousteau's 1970s seat-of-the-pants, do-it-yourself science in the hands\nof Bill Murray.<br><br>Then there is the fictional bakery, Mendl's, whose cakes and\nconfections try to be funny, but suffer from the same lack of a\nreal-world counterpoint. It just doesn't carry the comic weight of Bill\nMurray's ship the Belafonte in Life Aquatic because there is no Calypso\nto measure it against. For those of you who don't know, Calypso was\nCousteau's real-world research vessel. The comic jolt comes when you\nrealize that Harry Belafonte was a famous calypso singer back then.\nIt's brilliant little details like that, that made me roar at Life\nAquatic but that are sorely lacking in Budapest.\n"},
{"review": "\nRented on video and nearly switched off. Don't know what the fuss is\nall about. Didn't like Moonrise Kingdom either. Rubbish. How this type\nof film wins a Golden Globe confirms either I am completely out of\ntouch or the awards are. Not seen Birdman but put off by the fact it\nwon a Golden Globe. Saw a useless film starring Brad Pitt called Tree\nof Life or something similar. Waste of money producing. Then again\nShakespeare in Love and Ordinary People won Oscars for best movie. Seem\nto remember Forrest Gump beat Pulp Fiction. Wes Anderson films are not\nfor me. Pretentious drivel. Rather watch Wes Craven and that's saying\nsomething.\n"},
{"review": "\nThe trailer for this film enticed me to see it. The film was, however,\na total let-down and may well be the worst film I have ever seen.<br><br>The plot was almost non-existent. It certainly had no sense nor\ndirection.<br><br>The film rambled through a series of mostly boring events punctuated by\na liberal dose of expletives that added nothing whatsoever to any\naspect of the film except to place it in the smut and filth category.<br><br>The author must have been high on something when he wrote this one.\nUnfortunately whatever high he was on, did nothing to make this film\nworth viewing.\n"},
{"review": "\nThe adventures of Gustave H, a legendary concierge at a famous hotel\nfrom the fictional Republic of Zubrowka between the first and second\nWorld Wars, and Zero Moustafa, the lobby boy who becomes his most\ntrusted friend. The Grand Budapest Hotel is an unfunny, cheesy film\nfull of over the top characters and dialogue and for me a movie with\ngreat actors that have truly hit rock bottom for example Edward Norton\nthey even managed to make Saoirse Ronan really bad. The cast is\nfantastic and talented some of them are and other's not so much but the\nover the top acting and moments can't save an unfunny mess of a movie\nthat this was. I'll give The Grand Budapest Hotel a 3 out of 10 it was\njust awful.\n"},
{"review": "\nThe universe of this movie (in a significant way) presents us an\nSS-like military formation stationing in a building with pink walls. So\nwhy did they removed the pink elephants dancing between the scenes?\nBecause this form over substance picture apparently lacks some clear\ncircus transitions between scenes. Especially as there is this proper\npiece of music for such a dance, that is played when the end titles are\nrolling<br><br>This is nothing more than a pretentious attempt on an art film. A bunch\nof good and great actors had to be somehow mislead into showing up in\nit. Humor has the level of middle school students that have just\ndiscovered Monthy Python. Beautiful sets crafted with details were\ncontaminated with quasi-fantasy approach. The whole unrealistic story\nand behaviors may fit well with the semi-fictional universe, but they\nsure don't help the film itself: the further it goes the more of\ntiresome starts to leak out from the screen onto the viewer<br><br>To be honest, one must admit that there are some good or interesting\nmoments or ideas; that were simply wasted or misused. There are also\nsome masked / reworked events from history of Europe and parallels to\ntoday's problems. But overall, this movie should be re-titled into\nsomething more appropriate, like \"The Grand Cinema Joke\"\n"},
{"review": "\nWes Anderson isn't for everyone, but you have to admit he has a\ncreative mind that only a true artist can possess. Films like \"Moonrise\nKingdom\" and \"Fantastic Mr.Fox\" stand out to me as some of the greatest\nin film history, possessing creativity and talent that few films have\naccomplished. \"The Grand Budapest Hotel\" is different. The adventures\nof Gustave H, a legendary concierge at a famous hotel from the\nfictional Republic of Zubrowka between the first and second World Wars,\nand Zero Moustafa, the lobby boy who becomes his most trusted friend.\nThe plot is too complicated for the level of humor and creativity that\nAnderson is striving for. The film goes way offhand, never finding a\nclear direction on where it wants to go. The cast is powered with\nA-list actors such as Ralph Finnes and Jude Law, but not one actor\ngives a performance that's noteworthy. The film has its moments of\nsubtle little laughs, but it relies heavily on its art-departments such\nas costumes and production design, which hold it back from becoming a\nfilm with an actual level of substance. \"The Grand Budapest Hotel\"\nplays out like a toddler with toys trapped inside a forty year-old's\nbody, and you see that in every scene form its weak begging to its\nlousy end.\n"},
{"review": "\nThis movie reminded me of sitting through Charlie Chaplin or Buster\nKeaton type films for some reason. It clearly wasn't realistic, or\ndesigned to be taken as real, more a stage drama on screen. There were\nscenes in the Alps, for example, where the main characters remained in\ntheir shirtsleeves, impervious to the cold. There was a scene where\ncriminals carried a ladder past the camera and it went on and on and on\nand on and ... Chaplin-esque comedy. The cinematography was amazing.\nThe sets, costumes etc, all really impressive, but it just didn't work\nfor me at all and I couldn't wait for it to end. Ralph Feinnes was\nexceptionally good, however. Almost worth watching for his camp\nperformance.\n"},
{"review": "\nThis film is insanely stupid, dreadful, absolutely meaningless, dull\nand pretentious. It's also extremely boring, superficial, sterile,\npoorly acted, hideously unfunny, and above all, depressing on so many\nlevels.<br><br>There was no coherent plot, no emotion, no character development, no\nnothing. All characters are bland and shallow, and some of them are\nannoying.<br><br>Most of the films sequence looked crappy as hell, especially the\n\"chase\" sequence in the snow. So this is my advice, don't waste your\ntime on this idiotic film and use your time on something else.\n"},
{"review": "\nWell, until this year I really believed and trusted the IMDb top 250,\nhowever the last three years show me that the top changes too much\ndepending on people who look only action and empty films or\nadvertisers. The first sh° to see from the top was Mad Max Fury road.\nMamma mia how awful a movie! And now this one. Yes, this was much\nhigher in quality but all the screenplay was so empty and without\nsense...The only thing for which I can recommend to watch this if you\nreally do not have other choices, is its rather comic scenes. This is\nmy first review so I do not know yet how much spoilers I can write so I\nwill not write none. IMDb, please, put some age limit or something,\notherwise all the old marvelous movies will soon be gone outside the\ntop and new comedies and cartoons will replace them...\n"},
{"review": "\nThe Grand Budapest Hotel can be considered one of the best works of Wes\nAnderson. The story is about the adventures of a legendary concierge,\nMr Gustave (played by Ralph Fiennes) at a very famous hotel during the\ntimes of WWI and WWII. Zero, the lobby boy (played by Tony Revolori)\njoins the hotel and earns himself a trusted friendship of Gustave. This\nwould seem like a typical bollywood movie filled with love, violence,\naction, suspense, drama and so on. Gustave befriends a very rich old\nwoman who suddenly dies bequeathing a very precious painting to\nGustave. This leaves the old women's son Dmitri furious and longing for\nrevenge, and ultimately leading to implicate Gustave for the old\nwoman's murder. Gustave with his loyal lobby boy and the lobby boy's\ngirlfriend (a pretty baker girl) escapes prison to get justice for\nhimself. Gustave's quest for justice is shot in suspense-cum-funny\nsequences and finally the \"boy with apple\" painting hangs happily ever\nafter as GB's most treasured possession.<br><br>The movie is shot on a narrative theme with a flash back style. The\nmovie could have been edited better with few scenes getting elongated\n(like the initial part when narrator meets a young writer). Also, art\ndirection at few places renders the movie a bit childlike (like the\nclosing scene). All said, this comedy drama is a must watch this\nseason.\n"},
{"review": "\nWhen I watch the \"Grand Budapest Hotel\" had not read anything about the\nmovie. I found a work of art, full of intelligent humor that at times\nborders on the absurd. Visually it is an attractive product, the\ncolors, the clothes, the time unfolds ... It has a simple story easy to\nfollow and allows us to keep pace with rapid dialogues between the\ncharacters. The scenes pass quickly, at a rate that requires the\nattention of the audience. This is also why we must be careful not to\nlose the jokes ... some black humor. Is a beautiful hours of film and\ngood humor. Is perceived-that behind this film is a competent technical\nteam of post production. It's a movie not to be missed, but will not be\nguaranteed awarded the Academy Award for Best Film of the Year, given\nthe good quality of the other nominees.\n"},
{"review": "\nAnother drolly twee film from Wes Anderson, better than some of his\nprevious work (\"The Life Aquatic With Steve Zissou\", \"Rushmore\") but\nnot nearly as good as others (\"The Royal Tenenbaums\", \"The Fantastic\nMr. Fox\"). Here, he assembles a mighty cast, with Ralph Fiennes\nstarring as the fastidious and ambiguous manager of a distant eastern\nEuropean hotel (located in the fictitious Republic of Zubrowka; the\naction takes place between world wars), whose care of his guests\nextends beyond the usual service and who gets involved with the\nnefarious family of one of his elderly lovers, led by son Adrian Brody\n(who, by wearing pseudo-Nazi clothing, unthinkably undermines his most\nfamous role, the persecuted Jew of \"The Pianist\"). This being Anderson,\nit's all about cadence: he expends an awful lot of energy synchronizing\nhis actors' responses and the rhythms of the music (a winning score by\nAlexandre Desplat). But really, that's all it's about--the film is\ncompletely inconsequential nonsense. Sure, it's entertaining while\nyou're watching it but you're completely aware that what you're\nwatching has no real substance. All the performers competently perform\nto Anderson's stylized, obsessive/compulsive standards but the true\nstars of the film are Adam Stockhausen's gorgeous production design,\nAnna Pinnock's intricate set decoration and the fun art direction, led\nby Stephan O. Gessler: it's easy to get lost in the dazzling visuals,\nespecially when there's no real need to pay attention to what's going\non in the forefront. Conceivably, it may even be better with no\nsound--certainly, the overall design recalls the era of silent film.\n"},
{"review": "\nI have to start by saying that this is my first Wes Anderson film. The\ntitle piqued my interest so I decided to give it a try. I am not\ndisappointed at all. The actors performed exceptionally well and the\ncharacters in the story came out naturally. Comedy hits you in the face\nand it is there throughout the movie at unexpected places. Even though\nsome jokes were slapstick, it was subtly portrayed. <br><br>The background score gave life to different situations and the music\nwas cheerful throughout the movie. It takes a genius of a writer to\nconvert what seems to be a conventional drama into a murder mystery.<br><br>The settings were lively and the landscapes and scenarios were\nbeautiful. 10 points for Witty dialogs combined with exquisite poetry.\n"},
{"review": "\nWes Anderson has done it again. Grand Budapest Hotel is the best of\n2014. This film shows the genius of Anderson with his quirky, different\nstyle of filmmaking. The writing and filming designs are some of the\nbest and unique in Hollywood today. Grand Budapest Hotel is definitely\nmore of a piece of art than ordinary movie. The cast includes huge\nnames in Ralph Fiennes, F. Murray Abraham, Adrien Brody, Willem Dafoe,\nJeff Goldblum, Jude Law, Etc. Ralph Fiennes gives his best performance\nin years as M. Gustave. He really brings a uniqueness that fits well\nwith the movie. He was rewarded with a Golden Globe nomination. He has\nsome quick humor and energy that keeps the film moving. Wes Anderson\nmainstays Adrien Brody, Bill Murray, Owen Wilson, and Jess Goldblum\ngive Grad Budapest the classic Wes Anderson feel. The storyline takes\nyou on an adventure. It is a story that only Anderson could tell. The\neffects are a bit different than most movies but fit the theme. M.\nGustave (Fiennes) and his story will make you appreciate Anderson in a\nnew way. By far the best of 2014.\n"},
{"review": "\nOK fine, I'm a Wes Anderson fan. I'm starting to gather that's a\nprerequisite for liking some of his movies. I like to think this one\ncrosses over though. <br><br>It's charming! It's wonderful. The characters are quirky but\nbelievable. The story is wacky but somehow holds water. It really feels\nlayered and honest, and the convention of a story-\nwithin-a-story-within-a-story is used to excellent effect. <br><br>If I had any complaints... hm. I can't think of any at the moment. I\nguess maybe I wish it was longer! It really held me captivated, and I\nknow I sound like a gushy fanboy here but honestly I mainly like\nviolent science fiction, so hopefully that lets you know I'm not just a\ntotal softie promoting things without weighing their merits. <br><br>Anyway, if you are at all curious about this movie, I strongly\nrecommend. Great performances by a fantastic cast. Funny.\n"},
{"review": "\nIf you're already a fan of director Wes Anderson going into this film\nyou'll enjoy it without a shadow of a doubt. The Grand Budapest Hotel\nlays on the usual Wes Anderson trademarks that we all love with the\nsymmetrical shots, the old fashioned style of effects, the visually\nbeautiful display of colour, the large A-list cast and the witty\nhumour. This may even arguably be Anderson's BEST work to date.<br><br>Ralph Fiennes' soft-toned and somewhat camp performance as Gustave is\nwhat truly takes this film into being a 'great' above all else. His\ncharacter is such a well-developed personality that combined with\nFiennes' acting makes seeing him such a remarkable watch. His delivery\nof lines, charming personality and chemistry with Tony Revolori, who\nplays his young and trusted friend, create for some absolutely\nhysterical moments constantly throughout. <br><br>Overall this film is worthy as being Anderson's greatest film. With a\nrunning time of 1 hour 40 minutes the film just glides through and\nisn't hard to follow at all so casual film watchers shouldn't have a\nproblem even if you're not too familiar with the director's work. <br><br>One thing that may through people off is the aspect ratio of the\nscreen. At the beginning, it starts off as widescreen but during the\nstorytelling timeline the screen size scales down to just a box. At\nfirst sight it may look difficult to watch but it really isn't and if\nanything adds to the creative style the film holds. <br><br>Definitely going to see this again.\n"},
{"review": "\nA Wes Anderson fanciful farce. Anderson directs, shares story writing\nand is in charge of the screenplay. This is a maniac fantasy that takes\nplace between the world wars in the Republic of Zubrowka. Gustave\nH(Ralph Fiennes) is the eclectic concierge at the prestigious European\nGrand Budapest Hotel, who takes a bellboy named Zero(Tony\nRevolori)under his wing and preps him to become a trusted friend and\nprotégé. Mr. H caters to his guest and even makes clandestine visits to\nsome of the most snooty and wealthiest older ladies. And on occasion\nthe richest of men. Gustave and Zero find themselves embroiled deeply\nin a heated battle for a family fortune. The meticulous concierge is\naccused of art theft and even murder, making for riotously and\nhilarious flight from the authorities. Mr. H and Zero, while on the\nrun, contemplate a logical conclusion. Playful, witty, quirky and near\nimpeccable story telling using a backdrop of flashbacks.<br><br>Packed full of stars for sure: F. Murray Abraham, Willem Dafoe, Adrian\nBrody, Jude Law, Saoirse Ronan, Edward Norton, Harvey Keitel, Jeff\nGoldblum, Bill Murray, Jason Schwartzman, Tom Wilkinson and Tilda\nSwinton.\n"},
{"review": "\nStylishly made fun film that is engrossing every moment.<br><br>It surprises for a good part of the film and that's the best part. From\nthe time we enter the Budapest Hotel, it is an fun ride, the characters\nare interesting and have their own little stories that are comical yet\nemotional and thoughtful.<br><br>The story of lobby boy (Zero Mustafe) or that of Gustave, or of any\ncharacter, they are not very great to say the least but are\ninteresting. They all together shape up this well made set piece that\nis mostly confined to the setting of the Hotel. The acting by Ralph\nFiennes is a treat and Tony Revolori as the lobby boy is a revelation. <br><br>The interesting part of the film I found was the use of varied aspect\nratio. It differentiates the time frames intelligently. Wes Anderson is\na director who oozes out fun in his films. His films are more about fun\nand the camaraderie between the characters. The shots are slick, the\nart direction is generally awesome and the cinematography is superb.\nThe film is very appealing visually and all his films thus far have\nbeen stylish. <br><br>There is enough substance in this fun story There is action, chase,\nfight, enough drama and even suspense. It's all well stitched and made\nthe whole film an engaging experience. Of course, the script is the\nhero followed by superb art direction of the hotel.<br><br>I am not sure, if this was shot on location or whether they erected a\nset, but it was just beautiful. The hotel, interiors, the painting of\nthe exteriors and even the locales. <br><br>This film shall be a 4/5 for the acting and the art direction alone.\nThanks to Wes Anderson for giving us a good time at the movies yet\nagain.\n"},
{"review": "\nWes Anderson produces another charming adventure in The Grand Budapest\nHotel that is full of interesting characters.<br><br>We embark on a splendid adventure within The Grand Budapest Hotel told\nby Mr. Zero Moustafa, the one time lobby-boy and now lofty owner of the\nestablishment. We travel back in time to the 1930's at the hotel's peak\nof grandiosity to meet the beguiling M. Gustave, Zero's one time\npredecessor and mentor. A battle of fortune and theft sets forward a\nmonumental ordeal involving an insurmountable many.<br><br>M. Gustave is a meticulous man with a taste for the finest comforts in\nlife. Ralph Fiennes plays the bourgeois concierge completely straight\nand, yet, is the source of most laughs in this comedy and is wonderful\nto watch. The rest of the film is a who's who of well-known actors in\nfully realized idiosyncratic character performances. Expect to see\nEdward Norton, Willem Dafoe, Jeff Goldblum, Jude Law, Tilda Swinton,\nAdrien Brody, among others we've grown accustomed in a Wes Anderson\nfilm, though I won't ruin the surprise.<br><br>When you look at the film in parts it is masterful. The visuals and\nsets are luxuriously stunning, beyond anything you could imagine and a\ndream. The acting is top notch and characters intriguing. The story is\nentertaining and funny and especially unique. The music by Alexandre\nDesplat is charming and complementary. And yet, I feel as though the\nfilm doesn't come together as Mr. Anderson wished.<br><br>Wes Anderson films tend to be rife with characters and plot lines. The\nGrand Budapest Hotel jumps from each strand without fully completing or\nconnecting at its conclusion, especially in regard to minor characters.<br><br>While thoroughly enjoyable and charming as a film, if more time were\ntaken to develop some subplots, remove others, and intertwine the rest,\nThe Grand Budapest Hotel would easily have been one of Wes Anderson's\nfinest creations.<br><br>More reviews of films new and old can be found at our website!\n"},
{"review": "\nI do not see any drama worthy of praise in this film I'm not a writer\nor a film critic, but I am viewer and me the right question is it worth\nthis film to enter the Oscars? The only thing worth praising the film\nis the soundtrack,<br><br>but photography is very bad and some of the scenes by a stationary,\nstable images do not move where realism in this? Events are listed and\nthe performance was by some representatives of artificiality,<br><br>or in other words, over-representation of the limit.<br><br>In the end, the film does not have a reason to run for Oscar not to\ntake 4 prizes\n"},
{"review": "\nThere have been several reviews panning this excellent film and I think\nI know the problem - people are not truly watching and experiencing\nthis movie. It's an odd-ball sort of movie - def' a little quirky - but\nthe key is to just open your mind and watch and not \"expect\" anything.\nLet things come to you as the director sends them. You must pay\nattention because the images and the dialog come quickly. It is a\nfast-paced movie so if you're attention wanders you will miss things.\nBut I promise you if you have an open mind, an IQ somewhere above\nroom-temperature and any sense of humor at all, you should really enjoy\nthis little gem. We saw this movie on a home TV and I regretted that\nbecause I'll bet this film is absolutely outstanding on a big screen.\nIt's not meant to be anything particularly deep or meaningful, just a\nfun couple of hours. Relax, and enjoy. It is well worth the watching!\n"},
{"review": "\nThe Grand Budapest Hotel is directed by Wes Anderson and has been\nnominated for Best Picture Oscar. It is a story of a man sharing his\nlife's story as he was a protégé of a famous concierge for a grand\nhotel. The ups and downs of life in the hospitality industry is quite\nan adventure. There is even a mystery involving a famous painting in\nthe mix. A marvelous tale from an era when hotels were stately and full\nof wonder. This movie is a bit static at times and long winded. But the\nscenery is full of old school class. The shifting back and forth can be\nconfusing at time. But the relationships are good and the characters\nrich.\n"},
{"review": "\nFirst I've watched this movie two times till now...only because to see\nthe art behind this movie. This is the first movie I've watched of WES\nANDERSEN. And want to see more. Wes Andersen made this fast forward\nmovie very good in 4:4 square movie camera. the story telling of this\nmovie is also very good... the film is very fast forward so not at all\nboring. and <br><br>i think this is total movie. if you want good acting, sound composing,\nand good directing. watch this movie... Ralph Finns made great\nacting....yes \"Voldemort\" from harry potter... <br><br>by this film you see a new genre awaiting and it is called \"ART\".<br><br>and Alexandre Desplate has very good soundtrack... Hope can Win Most of\nthe Oscars..<br><br>This film has combination of Comedy, Emotions, Sadness, and\nsatisfactions, and Smoothness, and at last happiness.\n"},
{"review": "\nWes Anderson's The Grand Budapest Hotel is arguably one of the best\ncomedic films ever made along with Some Like It Hot (1959), The\nProducers (1968), Good, Morning Vietnam (1987), Groundhog Day (1993),\nThe Apartment (1960), Mr. Deeds Goes to Town (1936), Roman Holiday\n(1953), It Happened One Night (1934) and so many more. As the film\nopens we see an author (played by Tom Wilkinson) who talks about his\ndays back then while at the grand Budapest hotel (who is now played by\nJude Law) and sees a man named Zero Moustafa (played by F. Murray\nAbraham) and talks to him about his times with Monsieur Gustave (played\nby Ralph Fiennes) as the lobby boy of the hotel. Out of the 9 Oscar\nnominations that his film received I really think it should win 2 for\nbest costume design, and best production design, the casting to this\nfilm is excellent (besides Fiennes, Abraham, Wilkinson, and Law) it\nalso includes Willem Dafoe as a hit-man, Jeff Goldblum as a lawyer, as\nwell as Wes Anderson regular Bill Murray as a hotel staff member, and\nSaiorse Ronan as the lobby boy's wife Agatha, as well as Adrien Brody\nas Gustave's nemesis Dimitri, and the unrecognizable Tilda Swinton as\nthe old woman who stayed at the hotel for 19 years and was found dead\nin her bed from strychnine poisoning. When I first laid eyes on this\nmovie I literally fell in love with it's humor, it's casting choices,\nit's story, it's set design, and it's costumes. This is one of 2014's\nbest films.\n"},
{"review": "\nWhen I first seen the TV commercials for this film I was very curious\nof what it may hold. Here I am, nearly a year after. After watching the\nfilm I was certainly impressed and satisfied, for what I seen in the\ntrailers was a peachy movie. Now I see it as a perfect comedy/drama\nfilm. This film remains to this day (or the day that this is posted) my\nfavorite movie. Despite its \"perfect\" tone it is truly a amazing film\nand will go down in history (in my opinion) as one of the greatest\nfilms of all time. It was nominated for many awards and if I was to\ndecide, I think that all of them shall be awarded to them. Wes Anderson\nimpressed us all (if not most of us) once again.\n"},
{"review": "\nI decided to watch this movie when I heard about 9 Oscar nods it\nreceived .I initially thought it's going to be some overly-artistic\ndirector's ridiculously imaginative boring movie. But, it was totally,\nabsolutely different from what I expected. This movie turned out quite\nquirky, hilarious and sweet movie.<br><br>Plot was light-hearted and very very simple.One hell of Every element\nis breathtaking, electric. With a continuous ensemble of beautiful\nimages, an imaginative script, cinematography and brilliant comedic\ntiming, there is absolutely no lag. The entire film is beautifully on\npoint. This movie is a treat. For the eyes, for the ears, and also for\nthe heart.<br><br>A must watch feel good movie.\n"},
{"review": "\nWhat I loved most about this film was its quirky nature-it felt almost\nlike I was being read a book and this was what my imagination was\nseeing. The storyline was cleverly put and I loved how it occasionally\nswitched from present day to the main storyline. The poetry was an\ninteresting touch, although I found it remarkably funny how the\nswearing just popped up every now and then, adding an altogether\ndifferent twist to the film. Whilst I don't wish to spoil anything for\nothers reading this review that have yet to watch the film, I think\nthat the combination of mystery, slight romance and fast-pace led to an\naltogether unique experience that I thoroughly enjoyed. A brilliant\nstoryline and a film that I would definitely recommend to anyone.\n"},
{"review": "\nI have not seen any of Wes Anderson's work, but after watching this i\nam keen to watch more of his films. THE GRAND BUDAPEST HOTEL is a story\nabout the concierge of the hotel and its lobby boy's attempt to escape\nfrom a murder framed on Ralph Fiennes(The concierge)by one of the\ncharacters in the film. I am not revealing anything to you , its just\nthe sheer work of absolute brilliant filmmaking and the extraordinary\nidea of creating a mind boggling effect by putting three different\nscreen ratios for three different era's. the screen ratios are perfect\nand have absolutely well blended with the different cinematography and\nproduction design used in this film. Ralph Fiennes' performance was\nwonderful as well as that of F. Murray Abraham's. I would recommend\nevery one of you who is reading my review to watch this splendid movie\nright now, because this is a ride that you should not miss.\n"},
{"review": "\nI've just watched it on Netflix, several hours after the Academy Awards\ngave it 9 nominations. All of them are worthy. All the make-ups,\ncostumes, design, photography, etc., is exceptional. It's beautiful,\nwell-made and all this beauty is useful, serving the story. These\ncraftsmen put all their talents to make this film unforgettable. We\ncould watch it in 30 years, it'll be great forever. Besides, the film\nis a mix of comedy and a breathless thriller. Previous films by Wes\nAnderson were funnier, but the story was losing its interest after an\nhour or so. Here we have a story who's holding it all the way. It's\nimpossible not to laugh even when M. Gustave is in jail. It's well\nwritten. In the end, the most interesting part of the film is the cast.\nEvery member of it is good, and a lot of them are really great. They\nshould have nominated Ralph Fiennes for his portrayal of the concierge\nof this old hotel. He's brilliant and funny and just for him, you have\nto see this movie. The first time I've seen him on a screen was in\n\"Schindler's list\". I've never thought I could watch a film in which\nhe's so different and as good. He's a master.\n"},
{"review": "\nThe acting is good and the story is okay but I'm not a big fan of this\nmovie. Everything is laid out too precisely; everything is made to fit.\nAll the details are handed to the viewer; it's too easy. I never felt I\nhad to think about anything. Some people may like that but I don't.<br><br>I enjoy movies that challenge me; that engage my mind in some way. To\nunderstand, follow, and appreciate them, the viewer has to think. I\ndidn't get that with this movie. I also couldn't relate to any of the\ncharacters; they felt flat and one-dimensional. As a result, I didn't\nfeel invested. I simply did not care about them or their outcomes.<br><br>Really, I'm not trying to bash the movie. I just felt it was too basic,\ntoo simplistic for my taste. This stripped down style of storytelling\nseems to be used often by Wes Anderson. I hadn't realized it but I've\nseen quite a few of his films. I don't remember them all but the most\nrecent I've seen, Moonrise Kingdom and Darjeeling Limited, have a very\nsimilar feel as TGBH. In fact, that's how I realized they were related.\n"},
{"review": "\nFun, is the word I think best describes The Grand Budapest Hotel. From\nbeginning to end this movie will have you grinning like an idiot. Wes\nAnderson has managed to capture a sense of adventure and\nlightheartedness that only he can manage.<br><br>The performances are fantastic with Ralph Fiennes and the relatively\nunknown Tony Revolori standing out from the pack, they're chemistry\nhelps drives the majority of the film and thanks great writing there is\nnever a dull moment between them.<br><br>If you have seen a Wes Anderson movie you know what you are getting\ninto with The Grand Budapest Hotel, if you haven't however, you can\nstill enjoy this movie immensely.<br><br>Easily one of the best movies of 2014 and if you are like me, it may\njust be one of the best of the decade.\n"},
{"review": "\nA simple, straightforward story of people with very human failings of\nlove, greed, compassion, and desire so beautifully told.<br><br>A peaceful, lilting tale of colour, laughter, and more than a hint of\nnostalgia. This movie is most definitely worth a watch no matter what\ngenre you are a fan of.<br><br>Some might feel that a 10 on 10 is overkill, but as the end credits\nwere rolling, I felt a sense of fulfillment, of happiness, and a\nbittersweet feeling. All marks of a movie that is beautifully made.<br><br>To use the most routine of phrases, like Moonrise Kingdon (another of\nmy favourites) this is Wes Anderson crafting a movie with love. If you\ndid like Moonrise Kingdon, you will definitely love this one.\n"},
{"review": "\nI have never been fan of Wes Anderson's films owing to their cartoonish\nand funny sets with weird make-up. However, I was surprised to watch\nThe Grand Budapest Hotel with utmost sincerity in terms of performance,\nstory telling and brilliant direction.<br><br>The Grand Budapest Hotel tells the adventure of Gustave H who is a\nmanager at the The Grand Budapest Hotel along with the lobby boy Zero.<br><br>Wes Anderson had changed my mind and feeling towards his film with\nsheer direction and convincing screenplay. The story is well-told in\nthe flashback mode and narration is simply superb keeping you on your\ntoes right from the beginning till the end. The movie is a thorough\nentertaining and the prison break scene will add extra spice and is\nlike an icing on the cake. Background score is superb along with\nbeautiful cinematography and art direction. Editing is crispy. Ralph\nFiennes gives a memorable performances with wonderful dialogue delivery\nfilled with humor and expression. Tony Revolori gives in an adequate\nsupport and should go a long way.<br><br>Overall, a brilliant cinema to watch out for. Excellent 4.5/5\n"},
{"review": "\nWes Anderson is really consistent with crafting extremely well-made\nfilms. His awesome attention to detail and how he shoots his movies won\nme over with Moonrise and now, with, GBH I'm convinced Wes Anderson is\none of the best, original directors we have today. There's a lot going\non in this movie: A girl is visiting a memorial and reading a book by a\nNameless Author. Meanwhile, the Author narrates this book for us about\na lonely hotel owner who then tells the Author a story about his start\nas a young Lobby Boy being trained by the then hotel concierge. There's\na painting theft, a ski chase, a great and suspenseful museum foot\nchase. This movie is on through the entire time. When it's not giving\nyou a scene filled with great dialog from it's wonderful cast, you're\nadmiring the typically beautiful set design. The script does a great\njob of using each setting in the movie and throwing in some\nsurprisingly intense sequences. That museum scene is my favorite and\nthere's awesomely shot shootout at the end that kind acts as a cherry\non top of the sundae. The dream team cast is near perfect, as with all\nWes Anderson movies. Ralph Feinnes is brilliant and carries the movie\nIMO, any man that can go from the evil Dark Lord to leading a comedy\nand nailing it is aces in my book. There's a lot of cool smaller roles,\nWillem Dafoe and Jeff Goldblum stand out. Again this film is\ntechnically flawless as well. The cinematography and music fit well and\ndirection is perfect. I easily recommend a purchase for Wes Anderson\nand film fans. Casual movie goers might enjoy a rental.\n"},
{"review": "\nA living poster boy for the auteur theory, Wes Anderson makes movies so\nidiosyncratic - the surreal humor, the whimsical/bittersweet tone, the\ndistinctive visual style with pastel color palettes and quick\ncut-aways, an uncanny ability to marry images and music, weird but\nsympathetic father figures - that if you ended up 4000 years in the\nfuture with a time machine and found footage of a two minutes scene\nfrom an unreleased work by him, you'd recognize it at once. Of course,\na deadpan Bill Murray would be in it somewhere.<br><br>A choral story focused on a murder mystery and a mitteleuropean luxury\nhotel, the movie finds its center in the relationship between concierge\nGustave (Ralph Fiennes in a phenomenal comedic performance) and his\nlobby boy/protégé Zero (Tony Revolory). Among the rest of the huge\ncast, Willem Dafoe as an ogre-like hit-man and Saoirse Ronan as a young\nbaker have the most significant roles, plus Jude Law and F. Murray\nAbraham providing the narrative frame as a writer interviewing an adult\nZero. Anderson's aficionados Murray, Wilson and Schwartzman have small\ncameos.<br><br>The director crafts his tableaux with meticulous attention. See how the\nunstoppable determination of Dafoe's killer is conveyed through his\nconstant movement, as he appears to be menacingly propelled towards the\nviewer; how the passage of time at the Grand Budapest is portrayed with\na change in the dominant color palette; how in their scenes together\nmentor Gustave always occupies the left side of the screen and Zero the\nright one, only for this to be reversed with older Zero and the writer.<br><br>The Grand Budapest Hotel is yet more Anderson quirkiness - he has done\nall this before, and better. From another director it would feel like\nstagnation, but since nobody else at the present does what he does,\nit's still quite welcome. To quote the movie, he certainly sustains the\nillusion with marvellous grace.<br><br>7/10\n"},
{"review": "\nOut of a career only of Masterstorkes, Prolific Filmmaker Wes Anderson\nTriumphs Yet Again with his latest offering 'The Grand Budapest Hotel'.\nA Stunning Comedy-Drama Film, that is also blessed with breath-taking\nCinematography, Mesmerizing Art Design &amp; Excellent Performances!<br><br>'The Grand Budapest Hotel' Synopsis: The adventures of Gustave H, a\nlegendary concierge at a famous European hotel between the wars, and\nZero Moustafa, the lobby boy who becomes his most trusted friend.<br><br>'The Grand Budapest Hotel' is truly an adventure ride, that offers\nsplendid humor as well as some dramatic moments. Its a terrific mix of\nhigh-energy &amp; epic-tragedy. Anderson's Screenplay is simply fabulous.\nFrom start to end, the narrative remains crisp &amp; interesting.\nAnderson's Direction is flawless. The Cinematography is breath-taking,\nwhile the Art Design is mesmerizing. Its extremely well-done! Editing\nis perfect. Costume Design is impressive. <br><br>Performance-Wise: Ralph Fiennes is top-notch, but its Jeff Goldblum who\nsteals the show. He's fantastic! Tony Revolori is effective. Saoirse\nRonan is restrained. Willem Dafoe &amp; Adrien Brody are nicely menacing,\nwhile Edward Norton is efficient, as always. Harvey Keitel, Bill\nMurray, Jude Law, Tilda Swinton, Tom Wilkinson &amp; F. Murray Abraham,\nenact their bits well. <br><br>On the whole, 'The Grand Budapest Hotel' is A Winner All The Way.\n"}
]