[
{"review": "\nI will keep the review simple. Although some of the financial jargon\nwent over my head, i would say Adam McKay is a genius, to make a movie\nabout the financial crisis this much entertaining, funny and touching\nthat's a feat only few filmmakers can pull off, and a lot of that has\nto do with the tremendous cast of this movie. The Big Short has a large\nensemble cast but focuses on four major players who benefited in\nvarious ways from betting against the American economy. Steve Carell\ngives one of the best performance of his career, Christian bale\nportrays the awkward lonely genius with ease. Ryan gosling is slick\nover the top and funny in this movie he also makes the whole thing much\nmore interesting. Brad Pitt is kind of a good guy and the moral center.\nThis is a must see, and needs multiple viewings to truly appreciate.\n"},
{"review": "\nDon't know how Adam McKay made deplorable humans, blinding fear,\ngut-boiling outrage and gleeful shaming so much fun to watch. He\nbrought along his bag o' laffs but planted them in such rich soil so we\nhad to hack our way through the thick underbrush of tainted greenbacks\nand marked decks.<br><br>Everyone's in top form. Didn't recognize Brad Pitt for awhile. Ryan\nGosling funniest. Christian Bale let us feel his pain and lonely\ngenius. Steve Carell dug deep and came up with a real mensch.<br><br>Nice to see Marisa Tomei, Hamish Linklater, John Magaro, Rafe Spall,\nFinn Wittrock, Max Greenfield and talented others working at a solid\nlevel.<br><br>I walked out of the Westwood Bruin Theater in awe and mad as hell.\n"},
{"review": "\nNot really an accurate portrayal of the housing bust. The movie makes\nit out like these few people were the only ones who knew there was a\nproblem brewing. Uh, no, zillions of people knew as early as 2004,\nincluding me, and I'm no Einstein. What set these guys apart is that\nthey figured out a good way to profit from the coming collapse,\nalthough it was never made exactly clear just what sort of percentage\nreturn they made.<br><br>The Michael Burry character was portrayed as an annoying mental case\nwhich seemed wrong to me since I've seen videos of the guy giving\nvarious speeches and he never struck me as a nutjob except in this\nmovie.<br><br>Didn't care for the bimbo in the bathtub explaining financial jargon to\nthe viewers. Very contrived.<br><br>No laying of any blame on the people who bought houses they couldn't\nafford. A lot of those people were closer to idiots than victims. The\nvictim was ME, I bailed all you dumbasses out and you'd better believe\nit ain't over yet! Round 2 coming up.\n"},
{"review": "\nAbsolutely same story of the protagonists (Brad Pitt, Christian Bale\nand Steve Carrell). They could have rather avoided making each scene\nfrom all three guys' perspective. It is like same scene repeated twice.\nThe movie which pretends to be informative, is full of errors.\nChristian bale in one scene says loan to value is 5. This makes no\nsense, he probably meant loan to equity. The Jenga tower was made\nwrong. It was showing AAA to be most risky. Most of the speeches were\ncynical with little meat. The key climatic speech by Steve had no logic\nand only rhetoric like \"I have no issues in telling you that you are\nwrong\". But do you also have any reasons why the said person is wrong.\nAvoid, if you possible. Much more interesting documentaries are\navailable on the housing crisis.\n"},
{"review": "\nAccomplished and informative movie from Adam McKay and his team.\nSpecial kudos to Hank Corwin for his fast but never flashy editing.<br><br>Superbly acted, with a nice little part for co-producer Brad Pitt, who\nis always at his best in supporting roles.<br><br>Looking at some of the message board postings about this movie, it's\nevident that the blame game for the financial meltdown of 2007/8\ncontinues, which kind of misses the point of the movie, which is that\nthe whole thing has started up again. Neither governments, nor banks,\nnor the public seem to care enough about the damage of a cycle of boom\nand bust to really do anything about it. They \u0096 we \u0096 smell money.<br><br>Excellent film. Mostly funny. Ultimately bleak.\n"},
{"review": "\nSome good acting (I especially like Bale) and interesting tricks like\nhaving actors talk to the audience and having celebrities explain\ncomplex financial deals.<br><br>Unfortunately it distorts reality to match a Leftist viewpoint, and\nrepeats ad nauseam how evil bankers are. Conveniently left out is the\npressure the government put on banks. Check out the history of the\nCommunity Reinvestment Act, particularly Bill Clinton's \"coup de\nwhiskey\" which forced banks to accept junk housing loans. This is why\nsuch a large percentage of mortgages failed. This was NOT mentioned in\nthe film; how can this not be relevant?<br><br>Also, it was well known that housing loans were in trouble before the\ncrash. I remember a cover article in The Economist predicting disaster\nin housing around 2005. I think the bankers were thinking, yeah, it's\ncrazy, but the government is forcing us to do it so they are going to\ncover these loans in the end so they are secure.<br><br>At least with Michael Moore you know he is lying to you; with this\nmovie a lot of people accept it as fact.\n"},
{"review": "\nI will be quite blunt. And very short. Avoid this item (I would not\ncall it a movie) at any cost! First of all, this is not a feature film.\nThere is a story but annoyingly not adapted through a 'movie\nscreenplay'. Too bad Randolph! I'd rather call it a hybrid of a feature\nand a documentary but a badly mutilated cloning job by Adam McKay.\nActing is generally OK, but Burry's character is really annoying. Worst\nis its infuriatingly hopelessly portrayed by Bale. Pitt is not worth\nhis salt and Steve Carell is the only one worth mentioning. The main\nproblem with this item is the absence of electrifying and captivating\nconnection that is really needed in each frame of the movie on one of\nthe biggest financial scams of our time. Just lame!\n"},
{"review": "\nHaving seen this movie I overheard the reviews calling it hilarious and\nI thought they must be talking about another movie. I found not a\nsingle part of this movie amusing even thinking back on it in a comedic\nlight. <br><br>To me this movie was just an awkward cousin desperately trying to live\nup to the success of The Wolf of Wall Street (the bath description\nscene just makes this even more obvious) If you are interested in the\nworld of finance then I'm sure there are qualities that will be\ninformative but apart from that I don't understand who the focus\naudience of this movie is, apart from simply trying to pull in fans of\nthe listed stars. <br><br>Definitely give this one a miss unless you are looking for a lesson in\neconomics with no benefit at the end.\n"},
{"review": "\nMaybe I just don't get it or maybe you have to be in the banking\nindustry to care but it's very boring. It's literally just guys talking\nto each other and about money the entire length of the film- like a\nradio talk show. The acting is fine and it's not poorly done at all-\nit's just basically nothing to see. I kept waiting for something to\nkick in- story, characters- something! I hate to be a snob about it but\nhonestly I just can't imagine how a film like this actually gets made.\nI mean what was the inspiration?? Who is the intended demographic??\nAgain, maybe it's just me and I'm hung up on films with action,\ninteresting characters and a colorful story and setting, but I can't\neven squeeze hard and push out something cool to say about this film. I\nreally wish I could. It's like expecting a rock concert and getting to\nread a newspaper instead.\n"},
{"review": "\nAs a person who understands how this housing bubble burst (not affected\npersonally) - this is a well told story. The acting is great - the\ninserts of a chef explaining things, and a pop star - very interesting\ntactic. The individual characters are all well acted and developed.\nMany people do not get that the banks play games with the average\nperson - as it says at the end of the movie - they just use different\nwords for their products. The main focus of the bank is to make money -\nnot help the consumer and this was rampant in the 90's. People need a\nplace to live - do not put down your income-or lack of. Leave some of\nthe questions blank - no one will care by the time it gets passed off\nand passed off and passed off and approved. ARM's - to me an automatic\nmoney maker for the mortgage holder and not the homeowner - oh that is\nright the mortgage holder owns the home. This is a movie that more\npeople should see - the acting is great - the story is told well and\nall need to watch what happens in the future.\n"},
{"review": "\nBoth the CDO and the MBS are non-tangible, complex assets. How complex\nare they? Watch this movie to find out. These very \"creatures\" nearly\ntook the stars and stripes off of Ol' Glory. Combine the greed of\nseveral thousand money-hungry loan officers, pile on bankers and bond\ntraders that find out they cannot produce enough crappy debt (read:\nsubprime mortgages) to keep the machine wheels spinning freely enough,\nand viola! You have a perfect storm. I am NOT a Brad Pitt fan, however,\nhe puts in a solid performance. Steven Carrell (sp) is one of my\nfavorites because he brings it. He brought it in The Office (TV), Brad\nAlmighty, Foxcatcher, and now - The Big Short. He carried the movie\nwell. As in all books that I have ever read, the movie is a bit clip of\nthe book, however, it was 2 hours and 2 minutes WELL spent and there\nwas nary an empty seat in the theatre on a Saturday over a holiday\nweekend. Very highly recommended.\n"},
{"review": "\nAn absolutely brilliant adaptation of Michael Lewis' novel. I can't say\nenough about this film. I've watched it countless times and I still get\nsomething from it each time. The script, the cinematography, the\ncasting - all brilliant. Steve Carell is superb as Mark Baum and\nChristian Bale is at the top of his game. He's never been better. Adam\nMcKay has crafted a masterpiece for the ages. He clearly possesses a\nbrilliant mind. What astonishes me is that he wastes his considerable\ntalents on dreck like \"Anchorman\" and \"Talladega Nights\" and \"Step\nBrothers.\" Why? I mean, WHY?!?!?! It just don't add up! The man should\nstick to smart and insightful films like \"The Big Short\" and leave the\njuvenile, unfunny comedies to Kevin Smith and Seth Rogan.\n"},
{"review": "\nThis movie, while based on truth, was impossible to get interested in! <br><br>I knew the circumstances, I knew the reality it was based on, I am\nfascinated by the prospect, and I still couldn't remain interested. It\nwas just too deep in the forest to be able to see the trees.<br><br>And you never do understand why the good guys got screwed.<br><br>Imagine watching 5 brain surgeons discuss the latest subtle nuance of\nmicro brain surgery! This was worse!<br><br>My date fell asleep.<br><br>Not worth the time or money!<br><br>The style ruined what could have been a real eye opening movie!\n"},
{"review": "\n\"The Big Short\" is a good film but also a film that would be tough for\nthe average viewer to enjoy and understand. This is because although\nthe housing bubble's burst was a mess and destroyed a lot of peoples'\nlives, few folks really understand it. Sure, folks know that the banks\nwere foolish as were home buyers (since they couldn't possibly afford\nthese homes)....but that's about as far as their understanding goes.\nAnd, with the film tossing around all sorts of insider jargon, it's\nsure to confuse more than entertain. <br><br>What I would LOVE to see is a pop-up video version of the film with\nexplanatory text appearing on the screen throughout the movie to\nfurther clarify what is happening. I've seen several Japanese import\nfilms like this--and they helped to explain cultural references that\nmost non-Japanese viewers would miss. <br><br>The bottom line is that I am extremely well educated compared to the\naverage person and yet I sometimes felt a bit lost. Enjoyable but best\nwatched with an economics professor sitting in the room to explain it\nall in detail.\n"},
{"review": "\nGreat drama moves you. It excites you. Scares you. Makes you sing.\nMakes you cry.<br><br>The Big Short makes you shake your fist. The Big Short is driven as\nmuch by its Iago as it is its Othello, and deservedly so.<br><br>The events in the story did happen. Many people still don't care. The\nBig Short gives you reason to care. That is what separates this film\nfrom being merely a documentary and turns it into high drama. <br><br>No matter your politics - mark this, like Citizen Kane, as a movie that\nshould be seen at least once. It is not always comfortable to watch.\nAnd that is a good thing - The Big Short is a documentary of a real\nlife horror that unfolds in slow motion, and reminds us that even after\nthe fact - no one is listening. Because truth is like poetry.\n"},
{"review": "\nI gave it a 7, simply because all of the terminologies in the movie are\nhard to understand for regular people.<br><br>After watching the movie several times, I finally was able to\nunderstand the details and appreciate how the creators of the movie are\nable to present a complicated issue with fun and energy. Also realize\nthat the \"complication\" and \"jargons\" are created deliberately by the\nFinancial Industry to keep the common people confused, so that they CAN\npush garbage out and we will buy it.<br><br>Maybe the next \"Big Short Bubble\" is Derivatives? Derivatives are like\nthe same kind of financial players create and play the Bubble Casino\nand use your money to bet on anything. Bubble bust, economy crash, only\nthis time there is no more Bail-Out from governments, only Bail-In from\nMa &amp; Pa life savings.\n"},
{"review": "\nThe big short's director is one the smartest directors in Hollywood\nafter Aronofsky and of course Kubrick. this movie was one the best\nmovies have been made about wall street and stocks. better than wolf of\nWS. I see everyone admire bale for his acting but i think Carell's\ncharacter + his acting was one of the most believable and respectable\nacting complex in whole cinema history.for the people they don't know\nthe story :In 2008, Wall Street guru Michael Burry realizes that a\nnumber of sub prime home loans are in danger of defaulting. Burry bets\nagainst the housing market by throwing more than $1 billion of his\ninvestors' money into credit default swaps. His actions attract the\nattention of banker Jared Vennett (Ryan Gosling), hedge-fund specialist\nMark Baum (Steve Carell) and other greedy opportunists. Together, these\nmen make a fortune by taking full advantage of the impending economic\ncollapse in America.\n"},
{"review": "\nThere have been a few runs at explaining why the financial meltdown\noccurred. No-one thought to frame an event like this with humour,\ntaking down the bean-counting barriers and offering a crash-course in\ngreed, power and money, (in other words, banking).<br><br>The stars were out, in terms of the cast and the cameo's, infuriating\nsome and breaking up the technical jargon for others. A brief cut to\nMargot Robbie to explain technical details, was undeniably the lowest\npoint, a sort of try-hard tactic, which left the audience feeling a\nlittle patronised. Combating this however, was Steve Carell, with quite\na moving performance - grounding the dark humour, and reminding us how\nterrible the situation became when millions lost their jobs, homes and\nlivelihoods.<br><br>Following various parties, from budding entrepreneurs, to high-level\nfinancial traders - people who foresaw the crash, and then bet against\nthe US markets. Creating a hilarious, but disturbing look at one of the\nworst things to happen in recent history.\n"},
{"review": "\nGreetings from Lithuania.<br><br>Although i do not really know this world that the movie takes us into,\nand \"AAA\" didn't rang a bell at the beginning of the movie, \"The Big\nShort\" has such a great acting and electrifying script, that it grabbed\nmy attention from the beginning till the very last end, although there\nwere many moments were i didn't understood how exactly that or that\nworks. Hey, but don't worry, Margot Robbie in a bubble bath and Selena\nGomez will explain some more innovating term to you - hilarious stuff.<br><br>Overall, \"The Big Short\" is just a great movie. Every actor (especially\nSteve Carell and Christian Bale) shines in this movie, and because of\ngreat acting and superbly involving yet not easy script this movie was\na blast. Highly recommended - but not for everyone.\n"},
{"review": "\nI went in with high expectations and I was nicely surprised. This movie\nuses a lot of financial terms that are explained. The cast is amazing,\nfunny but also angry, loved loved loved them. The movie presents such a\ntough subject that many people do not know nor understand very well.\nThe subject is presented through different angles from different\nperspectives. A lot of viewers failed to see through the numbers, down\nto the core of the movie's subject. Brad Pitt makes a remarkable\nappearance, together with Ryan Gosling and my favorite Steve Carell.\nThe whole movie is made remarkable by its actors and the heaviness of\nits subject. Do yourself a favor and go watch this very informative\nmovie and pay extra attention to the ending statement, it's scary!!!\n"},
{"review": "\n\"The Big Short\" is a good film that offers insights into the economic\ncollapse of 2008. The perspective of the film is from a group of wise\ninvestors who recognized the coming collapse and in effect bet against\nthe brokerage firms, banks, and mortgage industry. The dialogue is\ncrisp and lively, and the male-dominated cast handles the pace deftly.<br><br>The theme that emerges from the film is the greed that consumes nearly\nevery character. Even the savvy investors who recognize the fraudulent\npractices are motivated primarily to gain for themselves on the\ncollapse. The most interesting role is Mark, as played by Steve Carell,\nwho comes the closest to a character with a conscience. Due to the\nsuicide of his brother, there is a greater personal dimension to Mark\nthan the other characters, who remain fairly one-dimensional.<br><br>The film goes so far as to suggest that the problems at the heart of\nthe 2007 crash have not been remedied, and the cycle of corruption has\nstarted anew. For this reason alone, the film is worthwhile viewing.\n"},
{"review": "\nVery good movie. Describes everything to do with the housing crash in\n2007/2008 really well. I like how they took an extremely boring topic\n(banking and real-estate)and made an actually interesting movie.<br><br>There are a lot of big time actors in this movie, but it wasn't\noverwhelming. I've seen too many movies before that put far too many A\nlist celebrities, in 2 hours, fighting over screen time for the \"star\"\nrole. It ends up killing the movie. This one however, did a very nice\njob including all of them just the right amount.<br><br>The only issue I have with this film, is what my summary says. Its a\none time watch. I'd rope it together with a movie like \"Castaway\". Good\nmovie. Glad you watched it. Entertaining the 1st time, but not\nsomething you could watch over and over again. Especially due to the\nlack of suspense. After the 1st 15 min of the movie, you already know\nwhat's going to happen the rest of the movie.<br><br>But, if you're looking for a good movie to pass the time, I recommend\nit.\n"},
{"review": "\nHonestly, it' s the one question that popped into my head throughout\nthe movie. I think i have already giving you the clue as to why it is\nnot worth running to the cinema to watch: simply, it is too\ncomplicated. So complicated in fact, that during the movie, the\ndirector stops the telling of events to teach you the things you must\nknow in order to be able to understand what the movie is about. The\nfeeding of economist info is just too much and you quickly find\nyourself looking at your hoping for a quick end. This movie will not\nwatch the Oscar! trust me on that! It's nomination only indicates that\nthe this year cinema's quality has taken a knock.\n"},
{"review": "\nThe Big Short is about the banking crisis in 2008 and how a few\nindividuals predicted what was going to happen and acted accordingly.<br><br>Back in 1993 there was a series of chess matched live on TV between\nBrit , Nigel Short and Russian , Garry Kasparov . Despite not knowing\nthe rules or having ever played a game of chess I was mesmerised by\nthese matches. This film was the same for me. I definitely enjoyed this\nfilm but despite them trying their best to explain what was going on it\nwasn't sinking in . It doesn't matter what you do to jazz it up ,\nbanking is and never will be sexy , even if you do involve Brad Pitt\nand Selena Gomez ! Despite that , this is a fairly entertaining film. I\nthought it might go down the Wolf of Wall Street route and focus on the\nexcesses of the bankers but it concentrates more on their stupidity and\nthen their absolute gall in getting away with what they did. I like the\nquirky way the story was told even if I still didn't understand all of\nit but that probably says more about me than the film.\n"},
{"review": "\nThe Big Short is directed by Adam McKay and stars Steve Carell,\nChristian Bale, Ryan Gosling, and Brad Pitt. First off, for a movie\nabout banking, it would to be boring but it's the exact opposite of\nthat. It was funny at times, they explained the big words of banking in\na great way that I won't spoil and when it needed to be serious, it was\nserious. This was credited to the director Adam McKay. Adam McKay\ndirected this movie is such a different and fun way, which made this\nmovie fun to watch. He past movies were all comedies but he directed\nthis drama great. Worthy of a nomination at the Oscars. All the acting\nwas amazing by everyone. The two stand outs were Steve Carell who can\ndo drama great and Christian Bale who is just always great. Overall The\nBig Short was a fun movie to watch thanks to the acting and Adam McKay\nwho directed it amazing. Definitely check it out in theaters.\n"},
{"review": "\nWhy this is considered a \"comedy\" has me wondering. Was \"Too Big to\nFail\" considered a comedy because it was about the same timeline and\nevents. There were many funny moments to me but neither of these are\ncomedies. A comedy is where I go and expect to laugh out loud, roar and\ntell stories about the jokes. Not chuckle a few times and remember the\nevents and dread of the years in that business. \"The Big Short\" wasn't\nmeant to be a comedy but more like a serious look a foolishness and\ngreed that gets into everyone. <br><br>There are many funny moments but not meant to be considered a comedy\nmovie like \"Trainwreck\" or \"Sisters\". Comparing those movies in the\nsame category is like saying \"Mad Max: Fury Road\" is a musical\ncompeting with \"Pitch Perfect 2\". Both are fun but alike at all. Why\nsome get put into certain categories is silly.<br><br>At any rate. \" The Big Short\" is a great film. I know it because I was\na serious money manager way back when all this happened.\n"},
{"review": "\nYou'll want to be on top of your game because this movie is an\neducation that should be required viewing for anyone in, aspiring to be\nin or have even considered getting themselves and their money in bed\nwith the financial industry.<br><br>Watch and re-watch the trailer a few times while taking notes.\nFamiliarize yourself with some of the terminology because even though\nthis movie does a great job trying to represent some of the more\ncomplex and even incomprehensible, doing a little homework ahead of\ntime will give you a greater insight and appreciation of the depth and\ngravity of this tangled web of deceit.\n"},
{"review": "\nThe Big Short is one of the most important films of 2015, it's a film\nbased on true events which shows the banks and governments frauding the\npeople into a global financial meltdown. This film is loaded to the top\nwith a great lineup of actors, the story is top notch, and I cannot\nstress the importance's of the knowledge it shares.<br><br>Now something that confuses me about the world we live in today is, \"if\nsomeone breaks into your home, isn't someone supposed to suffer the\nconsequence?\" In The Big Short (2015) is shows the banks knowingly\nripping off the people causing millions to lose their homes, jobs, and\nmuch more, though the ending result is 1 person got punished!??? I do\nnot believe that this type of outcome she be, I means an eye for an\neye; right?<br><br>The Big Shorts story shows that there is documentation out there that\npinpoints everyone responsible, and this film is based on true events\nwhich makes this movie perfect for many reasons. This is a great film\nand we highly suggest it.\n"},
{"review": "\n9.75 of 10. For those who have seen American Psycho (2000), there's\nextra beauty in this with Christian Bale portraying a different, but\nnearly as odd if not as sociopathic, type of American Wall Street\noddity. In fact, the film captures the wide variety of borderline\nsociopaths occupying banks and Wall Street.<br><br>While technically a comedic thriller, satire, based on the very true\nand vivid recent history of banks, it would be accurate to call it an\nacted documentary too.<br><br>Besides being amusing and educational on the history of the big\nbailout, it weaves in energetic music, scenery, and well-acted\neccentric characters so that it overcomes all the usual complaints\nabout documentaries and historical re-enactments.<br><br>About the only drawback involves how it decides to dramatize and then\ntell the truth about one particular dramatization when it wasn't really\nnecessary and added some unneeded length to the film. Fortunately, the\nfilm doesn't depend upon it and it is interesting even if somewhat\npointless and detracting from the immersion.\n"},
{"review": "\nAwesome movie. It's been a while that a wall street movie gets a 10\nstars out of me. Not even The Wolf of Wall Street with my favorite\nactor Leonardo DiCaprio made such a strong impression on me. When it\nstarted I doubted that Carrel would deliver, for me he will always be\nconnected to comedy, must be because I am such huge fan of The Office\nand have watched it thousand times. But he is awesome. The acting is\ngreat, the story is interesting. But what really brings the movie to a\n10 stars review is that is educational, which adds social value to it.\nI would even show it to a class and make them write a paper on it.\nExcellent movie! Will definitely watch it a few times more in the\nfuture.\n"},
{"review": "\nI have to admit that I have watched many \"wall street\" movies but none\nfelt so real as this one. The fact that the script is based on a\nMichael's Lewis book obviously contributed significantly to that\ndirection. In addition, the cast in this movie is amazing. I really\nappreciated the performances of Christian Bale and Steve Carell.\nHowever, what truly made this movie shine was the lively description of\nso many different little aspects of the finance industry. From the\nbargaining with clients and the worries of an investment manager that\nhe will face devastating fund outflows to the greed and hubris of the\nbiggest investment bank employees. Yet, despite the fact that there are\nmany things in this movie that you can't understand if you are not\nstrongly familiar with the finance industry, the end and the main\nmessage is unambiguous to anyone. In my opinion, this movie got a\nbimodal distribution of ratings with two means, 9 from people in the\nfinance industry and 8 from the rest.\n"},
{"review": "\nThis is the best movie that I've seen in 2015. It represents a real\nstory with real people. None of them is actually a hero or really a\nvillain and that's what is great about it. The acting is as good as it\ncan be and I am really impressed with the group of actors in the movie.\nI ended up watching it more than once, just to understand the real\nstory behind it and I had more questions that I had answers afterwards.\nThis movie is really a must see, at least so you can understand what\nkind of world we are living in. And as a conclusion to anyone who\ndoesn't like the movie I can honestly say: \"Truth is Like Poetry ...\nand people f***ng hate poetry.\"\n"},
{"review": "\nThe Big Short uses comedy to try to explain the credit default swap\nfiasco which culminated in the mortgage crisis of 2008. Christian Bale\nis excellent as the real life hedge fund manager who besides being a\ndoctor is a wizard of Wall Street. Dr. Berry figured out years before\nthe collapse that the mortgage industry was mostly fraudulent and being\ncovered up by the big banks and the bond rating agencies. He figured\nout a way to bet that the bubble would burst, and he was correct. It\ncan be a bit difficult to follow, but writer-director McKay uses cameos\nby Selena Gomez and a world famous chef to explain some of the esoteric\nfinancial terms. The cast, led by Bale, and reinforced by the always\ngood Steve Carrell and Melissa Leo, is uniformly excellent. The topic\nis interesting and by the end of the movie, you will be infuriated by a\ncompletely corrupt political and financial system.\n"},
{"review": "\nThe Kama Sutra of illustrations of how we were screwed and how blatant\ncapitalism failed due to blatant corruption.<br><br>This hit every note and then some for me. Christian Bale alone was\nbrilliant. Then add in Steve Carell, Ryan Gosling, and an outstanding\nsupporting cast. I knew roughly 70% of what was presented here, but the\ncontextualization of the facts through the eyes of the short sellers\nwas just genius.<br><br>You would have thought that the cover up would have been what failed\nthe perpetrators, instead it almost worked, and quite possibly will\nagain without the always dirty word: Regulation. The depth and clarity\nof the drama and the facts together raises my hopes for humankind.\nBrilliant in inception and execution.\n"},
{"review": "\nThe movie puts in perspective the criminality that takes place within\nthe one percent. Puts it into terms the lay person could understand so\nthey can understand the corruption taking place. The whole time you are\ntelling yourself ( what is this ) ( no way ) a hard pill to swallow as\na working class. The acting is exactly what you expect from the actors\nin it. The film overall was a B+. From the director behalf I felt there\nwere some cuts that didn't make sense to me and made me feel like\nsomething was left out. Although this is a movie that everyone should\nsee it sad to know that it won't get its message across to the audience\nthat needs it.\n"},
{"review": "\nAs a former Realtor I took pride and selling homes and loans as the\nmarket Went up, few of us predicted the collapse\u0085 no one could pf\npredicted betting against mortgages, wish I was one of the few that\ninvested, Anyhow I love this movie, and how detailed it went to teach\nthe common person with little knowledge of the how the market crashed,\nI love how the movie was directed and produced, the cast did a great\njob, I wouldn't change anything except, big players from Morgan\nStanley, JP Morgan and Merrill lynch, aig bedded again the mortgages,\nit should of been exposed more, also it should of depicted the role of\nAlan greenspam and exposed him for the crook him and his partners were,\nhow the clueless president we had and still do, we the people had to\npay for their mistakes, can you believe that no one went to jail for\nthis horrific crimes, 1 + million families lost their home during this\nmortgage frauds\u0085 I recommend everyone to see this movie!! And take\ncontrol of our economy\u0085 Rated this film 9/10 great film\n"},
{"review": "\nThis is an eye opener to every people out there who doesn't care about\nthe world's economy! Everyone should watch this movie!!! This is our\nguide, this is reality, this is what's happening. I'll be planning to\nread the book as well so I can dig in and understand some points that a\nnormal person like me doesn't know. It's my first time writing a movie\nreview, and this movie just got into my nerves! I have no idea I might\nend up writing here! LoL it was just so good! I just saw Ryan Gosling's\nname so I decided to watch ha-ha! and then there's Christian Bayle! of\ncourse Brad Pitt, It's like what the hell is this movie and they're all\nhere? So I tried to look and I was stunned like what am I watching ??\nwhat is this ??? The stars really did a great job in this movie!! So\nyea Congratulations to everyone!\n"},
{"review": "\nWow ! Wow ! Wow !!! Most people do accept that corruption is rampant in\nthe USA, but after seeing this movie you will ask yourself how is this\neven possible. How can people be so irresponsible and unaccountable?\nEveryone needs to see this movie to wake up and start asking questions.\nChristian Bale, Steve Carell are fabulous and the script is awesome.\nWonder where Christian, Steve, Brad, and Ryan are investing their money\nnow. I seriously doubt their money is invested on Wall Street after\nmaking this movie. Wall street is a ponzi scheme. Madoff was peanuts\ncompared to what Wall street is doing. Do not believe what the 6\no'clock news is telling you. Do not believe what politicians are\ntelling you. Do not believe what economist on TV are telling you. All\nthe \"experts\" are in serious conflict of interests because they are\nbeing paid to read a prepared narrative.\n"},
{"review": "\nI wasn't expecting to like this film as much as I did. I have seen lots\nof new articles, interviews and talking heads that like to portray Wall\nStreet and the banks as just these innocent darlings that happened to\nget in over their heads. The general gist is that the are like lambs,\nif you will, swept up by events beyond their control. <br><br>So I was expecting the same white wash, condescending drivel from this\nfilm. Instead I got a humorous, subtle and quite importantly,\nentertaining take on the housing bubble. It is dam hard to recommend\nsomething to friends that is informative unless it passes the\nentertaining and fun quotient. This film passes the mark by miles.\n"},
{"review": "\nAn amazing film... with so much research of what was happening back\nthen but also what its done now! It's a documentary a drama a comedy\nand all that wrapped with the vague notion of reality! <br><br>in the end the audience will be deeply into the thoughts of... this was\na great movie... but wtf is happening if this isn't just a movie and is\na reality... which it is! Are we really that doomed? I believe that\nalthough the cast was top notch in the end nobody will remember the\nsexy chicks or the high class known actors... but the problem itself!\nand that's excellent... especially from a Hollywood movie thats not\nexpected when you have well paid actors... usually they do the work but\nin this movie that's not the case! <br><br>One word that could describe it, B-E-A-U-T-I-F-U-L\n"},
{"review": "\nI just want to say that this movie blew me away. As a person who was\npersonally affected by the housing crash, this was a very poignant\nfilm. I had an advantage going into this movie, because I knew a lot\nabout how sub-prime mortgages were sold in bundles to investors.\nHowever, the film does a wonderful job of breaking down the financial\n\"jargon\" so everyone can understand. In other words, you don't need to\nbe an amateur economist like myself to thoroughly enjoy and grasp the\nstory.<br><br>I think this is an important film that everyone should see. If nothing\nelse, you will get a very in-depth dramatic representation/explanation\nof just exactly what went so terribly wrong in 2007.\n"},
{"review": "\nIt should have been called the Big Rip Off and it shows how absurd the\nwhole thing was. I heard people talking after the show and everyone got\nit. I hope many, many people watch it. The director and the actors'\naccomplishment is not trivial; they get across a complicated mess full\nof arcane words and sordid people in an entertaining two hours. Humor,\nperhaps irony is a better word, is used to make this stuff digestible.\nIn the end the Big Question is who's minding the store. Nobody. Uncle\nSam is too busy looking for a job at a Big Bank. In this case it was\nCousin Samie instead... who ended up in bed with you know who. The\nmovie is full of good metaphors like that. Apparently, of all people,\nonly a young man figured out what was going to happen early on. His\nname is Michael Burry. All the Big Wise Men didn't, or didn't want to.\nWe'll never know. As a footnote, Michael Burry wrote an op-ed in the\nNYT in 2010 asking the Big Question. Within a month he got a visit from\nthe FBI and four audits, probably IRS, SEC, etc. You'd think Uncle Sam\nwould want to hire him instead.\n"},
{"review": "\nUnder zero emotions! The story supposed to be great but it wasn't. That\ndrama was not a drama but just some pieces of stories that this\ndirector tried to joined by force and to give a meaning during its way.\nMost of the biggest troubles was that camera that never stopped shaking\nand zooming in and out and moving up and down with no sense even in the\nmost quiet portrait. There is no need to play with moving camera in\nsenseless way to make the story more dramatic. Big disappointing even\nin some characters there. Not professional. Pretending! I would ask to\nthis director to give me back the time i spent to watch his bullshit\nand maybe to tell to him how he can do this movie in more positive way.\n"},
{"review": "\nA very good movie that explains difficult concepts very well. It also\nentertains in spades. <br><br>All performances are excellent. From the bit players to the majors each\nplay they part with aplomb. The constant breaking through of the fourth\nwall engages the viewer. It gives the movie immediacy. <br><br>Throw in cameos from Margot Robbie, Selena Gomez and Anthony Bourdain\nwho help make sense of things and you have an all round great movie. <br><br>And it is scary because it can happen all over again. And by the end of\nthe movie you realise that there are no winners. Just bodies on the\nfloor. <br><br>Highly recommended. .\n"},
{"review": "\nI didn't think it would be possible to make an entertaining movie about\na financial crisis, but Adam McKay and Charles Randolph have pulled it\noff. There are some really good performances by the stars, Christian\nBale, Ryan Gosling, and Steve Carell. Especially Carell who plays\nagainst his usual type of the complete buffoon who is unaware that he\nis a buffoon. There were no major or meaty roles for women. Some of the\ngimmicks worked very well, such as breaking the fourth wall, or having\nnon-financial celebrities explain financial matters. The film was more\nthan a bit one-sided, blaming private bankers almost exclusively for\nthe collapse, and letting government off the hook entirely. See Derek\nTetlow's comment 8 or 9 down for that. But it kept me engaged\nthroughout.\n"},
{"review": "\nA little before 2008, investors think the subprime market is going to\ncrash so they bet against it. That's it, that's the plot of the movie\nand it's repeated over and over and over again. The result is just as\nboring as it sounds.<br><br>The only thing that raises this movie above a complete BOREFEST is\nhaving lots of A-list actors playing atypical roles, especially\nChristian Bale.<br><br>This movie is just bad. If you want to see a GOOD movie about the 2008\ncrash, watch the excellent MARGIN CALL (2011) and especially Jeremy\nIrons in top shape - excellent acting with excellent dialog.\n"},
{"review": "\nI normally don't enjoy watching movies/shows about politics or\neconomics as I understand very little of those things, especially\nAmerican (I'm Norwegian). But I decided to give this a go, mainly\nbecause of the good cast, but also because of the acclaim from critics\nand high ratings from viewers.<br><br>I was pleasantly surprised! Although it was a bit hard to follow every\nterm and what was happening all the time, I understood what was going\non, and I was almost at the edge of my seat at times, which has NEVER\nhappened for me before watching a movie like this. Of course it also\nhelped that I thought it was very funny! Very entertaining movie with\ngreat performances all around.<br><br>Recommended. 8/10 from me.\n"},
{"review": "\nMore drama and less comedy The Big Short was a pleasant surprise. With\nan expensive cast and a difficult project it helped us understand once\nmore how pathetic can the banks become in order to find profit for\nthemselves and how money, once more, make the world continue to exist.\nGood acting, many message and caustic humour was this movie's recipe.\nAlthough much of what the protagonists said wouldn't make any sense to\nthe common people, they helped us understand them with quite simple\nexamples. Although it was a bit slow at the beginning, it becomes\nbetter as the time passes. True story and sure success, nothing special\nto address. Directing was good and the song of Neil Young gave an\nhonored finale! All movie's music was good and to the point. One\nadvise, don't take this for a comedy like other such as Ted or anything\nlike that. You have to watch it carefully because the plot is full of\ndetails. So, nice try guys!<br><br>6/10\n"},
{"review": "\nTwenty years of my life were spent working in housing finance\neconomics. I got out in the early 90s after the first housing crash\n(when the savings &amp; loan industry also collapsed). The things I saw\nthat inevitably led to that first crash at the end of the 1980s, were\nrepeated on a grander scale and with even more arrogance, greed, and\ncallous criminality than what went before, and led to the economic\ncrash of 2008. This film, while meant as entertainment, is also a\nprimer on what led to the worldwide economic downturn as well as what\nis still wrong with financial markets today since no substantive\nchanges have been made to prevent a recurrence. Nevertheless, it's a\nvery watchable film with terrific performances from the entire cast,\nincluding many who are essentially walk-ons with only a few lines. It's\nneither dry nor dull. In fact, it's very entertaining, depressing as it\ncan be when you realize that almost every bit of it is true.\n"},
{"review": "\n'The Big Short' seems to want to play off the same vibe as 'The Wolf of\nWall Street,' with characters directly addressing the audience and even\nexplaining which scenes are dramatized and which really happened. There\nis even a series of celebrity appearances inserted solely for the\npurpose of explaining the core financial concepts to laymen. Although\ntrying to explain the housing market bubble of 2007/2008 using\nblackjack bet, Jenga tower and seafood cuisine analogies is only\nmarginally successful, the fact that nearly every single scene in this\nmovie involves the various characters discussing, debating, delving\ninto or otherwise taking action related to this bubble basically gets\nthe picture across to the audience. But that, and the fact that it's a\nlong movie and about 95% of it is these same characters waiting for\nsaid bubble to burst, also makes it a rather one-dimensional movie, and\na bit on the dull side at times. Still, it's worth it for the\ninteresting subject matter and a particularly entertaining performance\nby Steve Carrell.\n"},
{"review": "\nWhat everyone else said: brilliant movie, educational, entertaining,\netc.<br><br>But the eye-opener for me was Steve Carell. My respect for him as an\nactor skyrocketed after this movie. Maybe I've been missing something,\nbut I've never seen him in a serious role before. When watching this\nmovie, I immediately latched on to Mark Baum as someone to whom I\nshould be paying attention. I later found out that he was played by\nCarell and I had a tough time reconciling that.<br><br>I think Steve Carell has many great dramatic roles in his future and I\nam very pleased with that because I'm not a huge fan of his comedy. I\nlike his comedy well enough, but his dramatic chops are several steps\nabove. I said what I came to say in the previous paragraph; this\nparagraph is just an attempt to make IMDb's minimum length requirement.\n"},
{"review": "\nClever and accomplished. Well scripted and acted. A story well told.\nBut. If you don't conceive or have an interest in the workings of the\nfinancial markets this might be a long dry watch with heavy subject\nmatter. And if you do conceive the workings of the financial markets\nand have an interest then the subject matter is a tad lightweight.\nNever going beyond \"A beginners guide to ABS...\". So what is the target\naudience. By straddling the fence between documentary and entertainment\nit never succeeds in being a statement for either genre. Well made and,\nsort of entertaining, but this is ultimately a very missable film. No\nmust see here.\n"},
{"review": "\nA more then decent film that tries to explain, without sentimentalism,\none of the biggest economic crisis of our times, a true story that\nstill relevant.<br><br>I watched this behind the contemporary \"99 Homes\", that I suggest as\nwell as it makes sense.<br><br>Apart from a few mistakes on the events, more or less important, the\nmovie manages to gives a enough realistic and understandable idea of\nwhat has happened (and is happening) and why. Surely an informative\nfilm that should be certainly seen just for this reason, especially if\nyou have not already seen documentaries and understood these issues.<br><br>Under the point of view of cinematography instead it leaves much to be\ndesired. The continuous movement of the camera, zoom-in, to give it a\njournalistic style, it is annoying and unnecessary in this movie. The\ndynamic edit tries to be original but the result is not that pleasant.<br><br>\"The Big Short\" is not flawless, but still worth for the raw and bitter\ndenunciation and true facts exposure on the economic crisis and the\nbanks, that we are experiencing.<br><br>8/10\n"},
{"review": "\nsaddest movie that I've seen in the past few years. this movie does not\nend in a \"superhero saves the day\" or a \"wow, we made billions on the\ndownfall of US economy\" tonality, it is a gritty depiction of reality\nand at the end the salary man must pay. the movie itself is good\ndocumented (can't believe it won an Oscar for screenplay), all actors\nfit their roles accordingly, it was really fresh to see them play in\ndifferent roles than the ones we were used them to play in. it is a\ndocumentary with a bit of artistic \"wolf of wall street\" zoom outs and\nfreeze frames. the end of the movie left me a sad feeling, knowing that\nkeeping people dumb via wrong education and focusing them on living a\ndrone life, scavenging to pay for things they do not need, won't change\nthe economics of the future, but instead will push all life into a\nprofits war, were banks create money out of air, and mortals fight as\nslaves on a plantation to keep the \"economy\" going.\n"},
{"review": "\nThe Big Short took boring subjects and made them entertaining to watch.\nThis movie focuses a lot in economy but the director found a way to\nmake this subject easy to understand by constantly breaking the fourth\nwall. Every time you get lost with all the Economy talking, they break\nthe fourth wall and they explain all the things you didn't understand.<br><br>The Performances: Ryan Gosling plays a likable mean funny guy, who just\ncares about winning money. Steve Carell is an angry man who hates\neverything. (He is the best in the movie) Christian Bale is a very\nawkward genius.<br><br>You definitely have to see this movie. You will have a fun time and you\nwill be thinking about it for days.\n"},
{"review": "\nOld radical tradition lives in Hollywood. But is this a radical film?\nDoesn't really matter, regardless of your other opinions, you should be\ninterested in whether capitalism functions or not. It didn't in the\nyears before the crash in 2008.<br><br>We meet moneymakers and wannabe moneymakers, who are not interested in\ninvestments to build things up; just to build their own wealth. That's\nthe problem and they even invest in a future financial breakdown.<br><br>Most cynical of them all is Brad Pitt, who puts up a performance, just\nto show rotten the system is. The problem however is that we still\ndon't understand what he's actually doing, although it is explained to\nus. Otherwise this would have meant a 9 rating.\n"},
{"review": "\nThis film blew me away, the entertainment, the audacity (of trying to\nexplain complex finance), the exuberance, the wonderful directing/\nwriting/ editing/ acting.<br><br>The film simply \"works\".<br><br>The concepts are complex okay and the style is frenetic and modern but\nat its heart is old-fashioned outrage at corruption and dishonesty, in\nthe tradition of Frank Capra. It similarly has a heart, and sympathy\nfor its main characters, showing them warts and all: pain-in-the-ass\nanger in Steve Carrell's characterisation, the Asperger-like Christian\nBale, the slimy, self-defending Ryan Gosling.<br><br>Director and joint writer Adam McKay has done a superb job in making\nthe Financial Crisis both accessible and entertaining. Brad Pitt too\ndeserves credit for producing (and playing a small part in) a film that\nmust have initially met with scepticism in Hollywood. Thank God someone\nstill tries to make films of substance.\n"},
{"review": "\nI like this movie, I watched it yesterday and still I have one\nquestion. So... How to manage my money? I haven't got a lot of, but I\nwould like to know that my money is safe. After all these details I\nrealized that morons are everywhere, I cannot trust anybody. Maybe just\nspend them...no money no tears. Because if all these financial managers\nin the whole country don't understand the situation, so what about me?\nI am just a person without special finance education. I really like how\nChristian Bale acts. Facial expressions and gestures were very\nappropriate. But I don't like how Brad Pitt acts. Whether the role\nitself is not expressive, whether something else.\n"},
{"review": "\nInspired from a book by Michale Lewis who also wrote Moneyball, I\nadored the film. One of the finest piece of writing this year and\ndefinitely worth recognition. Kudos to Adam Mckay's style of narrating\nthe story (very linear) but yet very effective unfolding of events,\ncoming from a director who is known for comical films, this is a big\nleap ahead. Script/ Screenplay: 9/10. You have a tough competition with\nSpotlight. Performance: This film deserved actors and it's an apt\nensemble of the cast the director got. Some films are more about the\nstory and screenplay and not much about the actors. It's one of those\nfilms. Editing: Wow, I mean. Phew. 9/10 Cinematography: 8.5/10. And I\nreally thought the camera was guiding me the entire story, so a JOB\nWELL DONE by Barry Ackroyd. Direction: 9/10.\n"},
{"review": "\nLiberals love to talk about how easy it is to make money on Wall\nStreet. So, as a retired bond salesman (from 1994), I enjoy average\nAmericans seeing actually how hard it is to make money. Those guys were\nin agony as they risked a greater power unwinding their positions\nBEFORE they could make a huge profit. Great movie to show that,\nalthough 99% of moviegoers probably walk out saying they hate banks.<br><br>Note also, the greed of the stripper and other average Americans who\nwanted those hated mortgage loans. If we gonna hate the banks who\npackaged the mortgage backed securities, how's about hating the average\nAmericans who took out those poor quality loans, thinking they were\ngoing to make money?\n"},
{"review": "\nthis is a great movie with terrific performances that show the behind\nthe scenes look at the housing crisis that triggered the housing crisis\nin the USA. all performances less one are on point and poignant I was\nentraptured by the goings on behind the scenes, the questions and the\nresearch and the duplicity of banks, governments and regulation to deny\nthe error of their ways..Christian bale, ryan gosling and mr40 year old\nvirgin are standouts the only character I found off key was brad pitt\nwho had the that stoned looked to his character much like his stoner\nlooking performance in world war Z. I recommend this movie if one wants\na thinking movie .\n"},
{"review": "\nThis film tells the true story of a bunch of people who saw what no one\nelse in Wall Street saw. They trade accordingly, betting against the\nAmerican economy. However, their profits come at a very high price to\nthe American public.<br><br>\"The Big Short\" has three separate story lines, as three different\ngroups of people bet against the banks. I find that slightly confusing\nat first, and that is not helped by the complicated financial jargon.\nFortunately, they do explain the jargon well, using entertaining\ndialogs by cameo actresses. The three separate story lines make the\nfilm very realistic, but I find it less engaging and captivating than\nother financial crisis films. However, it is one of the few financial\ncrisis films that touch on the disastrous impact on the public, which\nis a nice touch.\n"},
{"review": "\nThough intense and passionately filmed, the decidedly speedy pace\ncompromises the merit of both the script and the direction. Rushing\nthrough important details, audience members are given no breathing room\nand no time to process the information launched at them. The star cast\nof the movie is awesome,which made me watch the movie and they didn't\ndisappoint me..Christian bale was awesome i am huge fan of him,the way\nhe gets adapted to his characters is awesome.The movie is a bit lengthy\nthough, it could have been trimmed a bit..overall its an awesome\nmovie,would recommend it to watch at least twice to understand it\ncompletely.. i would rate it 7/10.\n"},
{"review": "\nA movie that keeps your attention on rather dry information through\nunorthodox means. That is somewhat rarely done, since it can be a risk.<br><br>\"Was it interesting?\" Not only was the overall plot engaging, but the\ncharacters were complex as well. The character development was a little\nheavy handed at times but was too detrimental.<br><br>2.5 out of 3.<br><br>\"Was it memorable?\" Some of the performances were astonishing, as well\nas parts of the story. I would have liked the different plot lines to\nmesh a little better though.<br><br>2 out of 3.<br><br>\"Was it entertaining?\" The camera work and the sound at times were not\nenjoyable in the least. The asides for explanation of certain concepts\nby cameos were alright, but the breaking of the fourth wall by the main\ncharacters was unnecessary, especially since there was a narrator.<br><br>1 out of 3.<br><br>Starting with 1 (because that's the way the system works), 1 + 2.5 + 2\n+ 1 = 6.5 I'm rounding to 7 because of Carell and Bale. Their\nperformances won me over.\n"},
{"review": "\nI ummed and ahhed about The Big Short - did I fancy watching this film\nor not? would it be boring? would it be too complicated? could I be\nbothered with a film about finance. I ended up watching it and I am so\npleased I did, what a fabulous movie - it was totally engrossing,\nexciting, easy to follow and the acting from all the main characters\nwas superb, it even has the most unlikeliest people like Margot Robbie,\nAnthony Bourdain and Selena Gomez at hand to explain directly to the\nviewer in layman's terms some of the more complex points about finance.\nI would be truly surprised if the Big Short doesn't at least get\nsomething at the Oscars, I was truly blown away by this movie - do\nyourself a massive favour and watch it at the earliest opportunity you\nhave!\n"},
{"review": "\nI enjoyed every minute of this great movie. It tells the story of those\nwho predicted the 2008 mortgage crisis and the financial disaster that\nwould come afterward.<br><br>Of course, no one believed them. Through their eyes, we see the system\nand the people that were responsible for the house of cards that would\ncome tumbling down. It's a dark, bitter movie that attacks American\ncapitalism in the solar plexus. However, there are light moments, and\neven some humour. <br><br>It's always interesting to see the workings of capitalist America. Such\nhuge amounts of money! It starts to lose all meaning.<br><br>Everyone plays their roles well in this movie, but the one who stood\nout for me is Steve Carell. His character was very believable. The\nmovie goer identifies with his sense of dread and nausea as he realizes\nwhat he's stumbled upon. Christian Bale's portrayal of the eccentric\nMichael Burry was also really interesting. A truly great actor.<br><br>I wouldn't miss this movie if you enjoy learning something while\ngetting entertained.\n"},
{"review": "\nBased on the serious book by author Michael Lewis; director,\nscreenwriter Adam McKay turns a complicated subject on it's head\ncreating a visual stunner of humor and knowledge. The housing collapse\nin 2008 was foreseen by a few very smart people who were completely\nignored by all the other greedy people working in the financial world.\nFor anyone effected by what happened you should be outraged by what was\ndone. It's Steve Carrell who steals the show from the other talented\nactors in this movie. It's one of his best performances. It's easy to\nsee why this movie has been winning awards as its relevance for future\nmarkets and generations to come can't be denied. It's the subject\nmatter few people really want to discuss especially those who cheated\nthe system and got away with it.\n"},
{"review": "\nI think the film is very good because it touches many themes people are\nnot aware of the economic crisis of 2008 .<br><br>The performances were very good and the plot , although they already\nknew that was going to end , it was entertaining and it was not only a\nserious film economy, but they kept the comedy side room for the kind\nof theme that was handled ! In total I highly recommend this movie for\nthose interested in the subject or for people who simply and only They\nmind want to learn something without studying the issue very\nthoroughly.<br><br>I NOT recommend the movie to people who are not interested in the issue\nand that They want to see a movie just for fun !.<br><br>I hope you liked my review, this is my first review and any Please\ncomment having what they are grateful to mail Mandaran that comes up .\n"},
{"review": "\nThe Big Short is a brilliantly filmed movie which explains the economic\ncollapse in a manner that is both didactic and engaging. Documentary,\nmockumentary, drama, thriller . . . whatever genre you want to call\nthis film, it is money.<br><br>The plot of this movie is not actually the important part, and there\nare no spoilers since it already actually happened. The Big Short tells\nthe story of the collapse of the housing market from those who managed\nto profit from it: an investment firm in California, a group linked to\nMorgan Stanley, and two college kids who were clever enough to figure\nout exactly what to invest in. The narrator is actually another\ninvolved party, a trader for Deutsche Bank.<br><br>Christian Bale is brilliantly morose,Steve Carell is amazingly Manic\nBrad Pitt is at his melancholic best PLEASE WATCH\n"},
{"review": "\nTruly masterfully done. If this genre is called mocumentary, which I've\nseen being developed throughout these past few years, then Adam McKay\nis the king of this genre. At first, as you begin to sink into the\nmovie, you as a viewer, are not fully convinced that this mash up works\nor will work. Alas, as you go further, you realize that it is\npractically flawless. Why did Adam McKay use this genre in my opinion?\nBecause with the story and script of the movie, it fits perfectly. The\nproof is that for such a seemingly boring calamity to be portrayed in\nsuch fluidity and class and entertainment, it requires the work of a\nmaster. And not only is Adam McKay the master here, but also the script\nwriters and the actors. Watch it, enjoy it and learn in many ways.\n"},
{"review": "\n\"The Big Short\", based on Michael Lewis's book, is a film that wildly\nfluctuates between comedy and deadly serious criticism of Wall Street.<br><br>The producers, shouting out \"Finance For Dummies\", follow a group of\noutlier financial analysts who predicted and bet on the fall of the\nU.S. housing market. 2011's \"Margin Call\" told a similar story. \"Wolf\nof Wall Street\" also focused on investment banking as one excessive\nparty, with attempts at humor.<br><br>More a powerful expose of the securities market and how Wall Street bet\nagainst the ignorance of the average investor, \"The Big Short\"\nsometimes does entertain the viewer as we laugh at ourselves for our\nguileless trust in those folks who duped us out of billions of dollars\nof our hard-earned money. We feel the horror of understanding that on\nWall Street greed trumps common sense. Read my entire review at:\nwww.unhealedwound.com\n"},
{"review": "\nOn the front of the cover it says 4 names in the top. Although not bad!\nLet's just erase the fourth name \"Brad Pitt\" Cause I don't think he\ndeserves his name there as he is not in the film that much and doesn't\nmake such a impression for me to say good job he was there.<br><br>Again it wasn't bad acting at all or whatever, it's just that\nChristian, Ryan and Steve really elevated this story and film. I think\nthe Christian Bale role could have been more upfront more screen-time\nmore detail, so maybe for an extended cut on the DVD??<br><br>In short it definitely explains some unknowns (to me), and captures a\nlot of, what the f*** did he just say? Did this really happen?<br><br>Steve was brilliant, yes he is more than just a comedian! <br><br>Christian is there something he can't play? And for me to hate and love\nRyan's role in this film proves he's a good actor.\n"},
{"review": "\nThis is a story about the greed centered financial system of the world,\nwith the U.S.A. being at the center. It tells how this greed machine\nworked itself into the depths of a global recession. But unlike other\nmovies that have come out on the 2008 mortgage crisis, this one does\nnot focus on the after effects and the human suffering but rather gives\na very erudite and somewhat esoteric view of the crisis; highlighting\nthe causes, decisions, events that led to the crisis--the absolutely\nshocking, disgusting and lamentable deliberateness of the stake holders\nand apathy of the regulators.<br><br>The cast (Steve Carell, Ryan Gosling, Christian Bale, Brad Pitt among\nothers) is top notch and the movie is interesting and well edited\nalbeit a little complicated if you want to hang on to every word and\nunderstand it. But this comes off as a thoroughly researched and\nresponsible film, which voices its displeasure at the atrocious\nbehavior that caused so much global suffering.<br><br>This is a must watch and surely one of the best movies of the year.\n"},
{"review": "\nFinancial and economy facts related drama will always trigger sleeping\nmode of the audiences but exceptionally, this turns out to be\nsurprisingly fast-paced, entertaining and funny. Adapted from Michael\nLewis' book about 2008 global financial crisis, the screenplay from\ndirector Adam McKay co-writing with Charles Randolph does not broadcast\nthe audiences directly to understand tonnes of financial theories, but\nto engage and enlighten through another creative way by mixing this dry\nlessons with parody and satire. Without a significant hero, the choice\nof the cast is definitely perfect - Bale, Carell, Gosling and Pitt\nperform extremely well, together with the supporting casts to play\naround with mortgage, subprime rates and credit debts. Despite\nillustrating this subject in a triumphant way, it has also successfully\ndelivered self- awareness regarding desperation, political corruptions\nand collateral damages in economy slowdown; leaving an impression of\nskepticism on Wall Street while restoring some faith in Hollywood's\ncapability in making great films.\n"},
{"review": "\nThis is a strange movie - almost documentary-like with actors\nrecreating scenes from the book and that talk to camera/4th wall\ntechnique of stopping the action and talking directly to the audience\nabout scenes, background or complex terms. I have never before seen\nsomething quite like it before with a great ensemble cast of A list\nactors combined with new faces. The whole thing is done with a great\ndeal of humor - in almost every scene - practically to the point of\nsatire. I thought the movie did a good job of explaining a complex\ntopic, suggesting those responsible while still leaving those final\nconclusions up to the viewer.\n"},
{"review": "\nOverall, a pretty great film that manages to work on both a\nstory-telling level and on a character level, despite how busy it all\nis. The problem is in essence how busy it all is when it didn't need\nto. All of the side-explanations, the wink-wink, fourth-wall breaking\nstuff should not have been there. It was all meant for humor more than\nactual explanations, and that's fine in aim. It just wasn't funny and\nfelt both condescending and just really annoying. The screenplay did a\nfine job of really telling this story so all of that was just\ndistracting. I also think the editing at times attempts to show off\njust for the sake of it, but it also was able to provide the story with\na much- needed pace. It's a conflicting editing achievement, no doubt.\nI think both Christian Bale and Steve Carrell provide some fine work,\nthe latter in particular is more convincing here than he was in last\nyear's Foxcatcher. Both are the emotional anchors of the story and they\ndo very well. The entire cast is superb though, and really gives the\nSpotlight cast a run for their money.\n"},
{"review": "\nA huge thank you to opening our eyes to something most of us were not\naware of. Also for the update on the new 2015 shenanigans that seem to\nbe the same scam with a different name. We all need to know what is\nhappening in the world. Good to see someone is willing to make such\nfilms.<br><br>As for the portrayal I am not fond of the 'gimmicks' used in this type\nof movie. If well done then maybe. They were not well inserted into the\ntheme, they were added awkwardly and attached more confusion to what\nalready was a confusing subject to some. Insulting and baby-like\nexplanations that really pulled your thoughts away then your mind had\nto settle back into the main storyline once again. If meant to lighten\nup a heavy subject they did not work. Even if the director thought\nputting Margot Robbie naked in a bathtub, covered only by bubble bath,\nand having her explain Wall Street terms made them more understandable\n- she did not. Otherwise well-done and saved by a great cast.\n"},
{"review": "\nWith such an all-star cast, I had high expectations for this film, and\nit lived up to them! Fast paced and smart, these financial tycoons were\neasy to love and hate! Adam McKay did a wonderful job capturing all the\ndifferent performances in this film as well as explaining what happened\nin 2008 with the housing bubble. It was done in a fun way without it\ngetting confusing and boring! Michael Lewis must be proud that his\nnovel has turned into such a Hollywood hit! And with Brad Pitt behind\nAND in front of the camera, the odds that this movie wasn't going to be\namazing were slim. Loved every aspect of this film and looking forward\nto seeing its cast and crew on the red carpet for a much deserved\nawards season.\n"},
{"review": "\nWhat can i say but wow! We have heard all of the stuff about wall\nstreet but really didn't have a clear explanation that everyone in the\nU.S.A., and the world, could understand. Well, that had now changed.\nThis movie will stop when a new concept is introduced and explain what\nit is with a new character coming into the picture who was just in the\nbackground as an extra and they explain it with fish, another with\ncards, and so on. Simple, but not making you or them look stupid. Even\nthe ones that shorted the market got screwed, so sit back and enjoy.\nThis was a movie more than a documentary, yet would stop and the\ncharacter would talk to the camera and tell you what really happened. I\nhave never seen such good work and i have seen everything. If you are\ninto wanting to know what the heck kicked us in the you know what, then\nthis is the one you have been waiting for. This is such a good\nperformance by Brad Pitt, who is always great.\n"},
{"review": "\nThis is one of the best movies I have ever seen. It uses creative\nfilm-making techniques (film buffs will love it), it is entertaining\nand suspenseful from start to finish, it has a powerful sense of humor,\nit pulls up big emotions in an honest, non-cheesy way -- and most of\nall, it puts the truth about something BIG that's wrong and evil in the\nworld in a plain and blunt way. The director is known for big,\nsatirical comedies like Talladega Nights and Anchorman, and here he\nmakes use of really wicked (good) satire to tell the story of the\nfinancial collapse of 2008 in a way that stays interesting and, for\nmost of the movie, a lot of fun. The fact that the movie is so\nskillfully crafted and so enjoyable to watch only makes the impact of\nthe real tragedy at the end (the financial crash and the fact that most\nof the crooked bankers GOT AWAY WITH IT) that much greater. Just like a\ngood heist movie, the 'heroes' make their score -- but no one is\ncheering. (And, whoa, they got a Led Zeppelin song to run with the\ncredits!!)\n"},
{"review": "\nRemember Alex Gibney's brilliant doc \"Enron: The Smartest Guys in the\nRoom\"? Remember how high that made your blood boil? Now imagine that\nmovie spiced up with some killer humor &amp; some great performances then\nyou get this movie. (\"The Wolf of Wall Street\" confessing its sins.)<br><br>Christian Bale, Steve Carell &amp; Ryan Gosling (who I've always viewed as\nbest seen on a poster in some sorority girl's room i.e. over-rated as\nan actor) all give knock out efforts in this extremely well cast, well\nedited &amp; extremely well written film.<br><br>It is as brainy as my other \"10\" film of the year, \"Ex Machina\". It has\nall of the moral outrage of anything I've seen in quite a while.\nDespite all of the laughs in it --which come at you from all angles &amp;\noften quite unexpectedly-- this is NOT a \"feel good\" movie. It's\nmorally complex because you are rooting for the guys who are betting on\nthe collapse of the American economy.<br><br>There may be (has, see \"Ex Machina\") films as good as this one this\nyear, but there won't be a better one.\n"},
{"review": "\nInsultingly condescending.<br><br>It's like finance 101 for preschoolers\u0085full of cut aways where some\nrandom celebrity holds your hand and spoon feeds you very basic finance\nconcepts like you're an idiot. <br><br>The writers seem to think the audience is COMPLETELY financially\nignorant and uneducated and as a result they spend most of the film\nrepeating the same simple concepts. <br><br>Why they assume everyone watching is an idiot is beyond me and the\nwhole concept of the film is insulting to anyone with even a cursory\nknowledge of finance. <br><br>Really pointless film.\n"},
{"review": "\nThe first time I watched I was confused even with interesting cameos to\nexplain stuff.Then slowly I was interested.The second time I watched I\nreally go into it.I mean wow.<br><br>Christian bale kills it with in the 10 minutes time given to him.The\nfirst encounter he has with a newbie you right away understand this guy\nis socially awkward and genius.I cannot imagine anyone else playing\nthis role.I mean wow.<br><br>Others are fine like you know Brad Pitt is paranoid.Gosling has funny\nlines which is mostly script. Carrell gives this nuanced\nperformance.But bale gave this weird and awesome performance.<br><br>I recommend watching twice and trust me second time you will enjoy a\nlot as you will understand very well.\n"},
{"review": "\nThe Big Short in my opinion is the worst movie of the nominees in\nOscar, found a boring movie with slow pace and moments trying to be\nfunny more does not work ( at least for me ) , the cast is a strong\npoint of the film, Christian Bale , Steve Carell , Ryan Gosling , Brad\nPitt , John Magaro , Karen Gilian , Melissa Leo , Marisa Tomei, and\nhave a rapid participation of Selena Gomes and other Margot Robbie that\nand Fri and very good, the direction of Adam McKay reasonable , I found\nvery similar film with the Wolf Wall Street, the script is good, the\nBig Short in my opinion not work in humor, the performances are even\ngood , plus the pace and slow, the movie is kind of boring with time\nand dull and unnecessary , besides being much like the Wolf Wall Street\n(which is very good) , plus the script of the film is even good, plus\nmy view Adam McKay could not use well the good script had. Note 5.6\n"},
{"review": "\nOK, this bored me to tears. Did folks not know the crash was due to\ncompanies 'propping' the market? Anybody buy a house and offered twice\nas much as they wanted? I was. I told them I live within my means and\nbought a home accordingly. It is the story of 3 levels of folks who\nfigure out the market early,later, and latest from my view. Not\ninteresting. How did they do this? I read the news and know how they\ndid this, the mortgage folks that is. A lot of over characterizations\nbased on one person representation such as the scenes about the rating\nagency. This is a film for those not clueful about this and those who\nare woefully uninformed. I was bored. I did not find Bael's performance\nwas interesting or enlightening in any way. Why is a geek investor\nnoting the numbers interesting?\n"},
{"review": "\nI had no expectations for this movie, but I was enjoying every minute.\nEducational, funny and exiting, this movie is a 9.5. The best thing\nabout this movie is that is shows how the economy is so f...ed up, in\nreal life. The cast for this movie is spot on. Every one of the four\nmain characters are casted perfect for the role. Bale and Bitt are\nlovely to watch as two awkward but genuine guys, and Carell and Gosling\nalso make a perfect match in this movie. Carrel is delivering his best\nmovie performance ever (along with Foxcatcher)! The story is very good,\nand during the movie you learn a lot of things about the economy and\nhow its all put together, to confuse the average citizen. Watch this\nmovie and you will have a good time and learn something in the same\ntime. And... you will also, I hope, think about the mechanics of the\neconomy before you put your signature on something in the future.\n"},
{"review": "\nThe Big Short<br><br>The best part of homeownership in the early-2000s was if your house\never burnt down, you still had two left over.<br><br>While no one saw this as a problem, the suits in this dramedy did\u0085and\nmade millions.<br><br>When rogue hedge fund manager Michael Burry (Christian Bale) uncovers\nwhat will eventually become the housing bubble, he predicts its\neventual collapse and, despite ridicule from every bank he meets with,\nhe bets against it.<br><br>His credit default swap scheme ends up intriguing a trader (Ryan\nGosling), an investor (Finn Wittrock), another hedge fund manager\n(Steve Carell) and an ex-banker (Brad Pitt), all of who want in.<br><br>Clarifying the complexities of the financial crisis and defining the\nconvoluted terminology involved with elucidatory side vignettes, this\nlayperson adaptation of the non-fiction novel is frightening,\nfacetious, and keenly insightful.<br><br>Incidentally, with all those subsequent foreclosures, smart traders\nwould've invested in cans of squatter spray. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nThis movie was surprisingly good with great acting and an interesting\ndepiction of what really happened to help cause the great depression.\nMuch of the story I knew before from reading about the root causes but\nthe movie tied it all together and added nice twists and additional\ndetails. It totally made it understandable to most although some of the\nparts do get financially geeky. The movie touched a nerve with me\nbecause I live near wall street, have friends that work there, have\nfriends that entered the mortgage business at that time, and bought and\nsole a few homes myself at that time. This is how I know the story told\nin the movie to be very accurate. Accurate and true down to the scene\nwith the strippers buying multiple homes and abandoned streets to prove\nit all was going to collapse. I felt the conflicting emotions of the\ncharacters who bet against the system. That is hard to do. I would not\ncall them heroes just keen to another way to make money. The financial\ninstitutions and the government institutions that let this happen\ndeserve all of the blame.\n"},
{"review": "\n... this is actually not bad, they have also spiced it up a bit and\nmade it fact based comedy in a sense and that actually keeps it more\ninteresting. The film moves fast, and if you are a little behind in the\nworld of banking, real estate loans and loans, this is mostly a lot of\npeople talking really fast and using a lot of acronyms (that is\nexplained for us common people, in a funny way). These funny clips,\neither were something is explained or the story teller and actors are\ntalking to the audience, that works out quite well and keeps the story\nup on its beat.<br><br>The actors are good, we are dealing with great people, playing each\ntheir own special character and they really keep the story together,\nkeeps it interesting even though the plot of the film is a bit boring.\nIt is not comedy in any traditional sense, but they do make it fun to\nsee and entertaining all-in-all.<br><br>Location, seating &amp; time: Dagmar, Nordisk Film, Vesterbro, Denmark -\nBio 5, row 8 seat 2 &amp; 4 - 15.02.2016 at 15.00\n"},
{"review": "\nI completely understood everything that was being done with the editing\nthroughout this film. It didn't feel at all like I expected it to. I\nwalked into the theater expecting a cross between Spotlight and Wolf of\nWall Street -which to a point is a fair starting place - but The Big\nShort became much more for me. The way this film tackled an issue that\nso deeply affected the entire country was cleansing in relation to the\nstyle of modern Hollywood. Everything felt real. I felt as if I was\nactually watching real life human people, not big name, a list actors\nplaying the roles of people. Every cut reminded me that this was real,\nit happened, and it wasn't that long ago. The message at the end, and\nthe taste it left in my mouth as I left the theater were refreshing\nwhile still reminding me that \"hey, this is real\". Every single actor's\nperformance was great. I would have liked to have been able to\nunderstand some of the wall street jargon better, but that's a personal\nqualm for me. However, it did take away from the detail of the movie.\nOverall I loved it.\n"},
{"review": "\nThe Big Short is directed by Adam McKay and stars Christian Bale, Steve\nCarell, Ryan Gosling, Brad Pitt and Marisa Tomei.<br><br>I just saw The Big Short today and these are my pros.<br><br>Pros: It was much more serious than I thought it was going to be. Steve\nCarell is excellent. it has a documentary feel. the movie really makes\nyou think.<br><br>now lets talk about the cons.<br><br>it's a little bit slow in the beginning. a lot of the bank talk went\nover my head. <br><br>in the end I really liked The Big Short and I'm gonna give it a 7.8\n"},
{"review": "\nThe thing i liked the most about this movie is the way the story is\ntold. All the resources the director chose tell it and the way it all\ncomes together in a way that the audience with no particular formation\nor even interest in the financial market ends up understanding it all.\nBravo, bravo to this gem from a surprisingly inexperienced director in\nthe gender. It's the story of those few who saw the \"financial bubble\"\nthat the mortgage market was in the US during the last years of the\n90's and decided to \"bet\" against it.Said in those terms sounds like a\npretty boring movie to watch but don't be deceive. With and outstanding\ncast, an incredible story and a new, kind of revolutionary, way of\ntelling it this movie has no way of failing the viewers. My personal\nfavorite to win the Oscar this year...\n"},
{"review": "\nThere is no best lead actor in this film. They all supported each\nother. Bale, however, in a supporting role of acting, well, he was\nquite superb. <br><br>This film, in my opinion, was not the top of filming nor story but it\nwas very well done, ...its execution was accomplished. <br><br>Bales' acting performance was, well again, I am not certain to how I\ncould describe it. I have not the words nor the intellect proper. I can\nonly allude to how I enjoyed it. I, in a word, believed him. I believed\nhis character and how he acted it. I bought the act as a portrayal of\nan actual human being.\n"},
{"review": "\nAm I the only one who feels that this is the most overrated movie of\n2015.<br><br>There are quite a few important omissions that contributed to the\nfinancial crash, plus the movie makes it seem as though the main\ncharacters were the only ones in America who saw it coming.<br><br>The strange Wolf of Wall Street cameos were a nice distraction from the\nintense overload of financial jargon, but failed to add any comedic\nvalue. Whereas the Goodfellas wannabe voice-over is a cheap attempt\nconnecting the viewer.<br><br>All in all, worth watching....but there are other movies I'd rather\nhave invested in.\n"},
{"review": "\n(Plot Synopsis FROM IMDb) Four denizens of the world of high-finance\npredict the credit and housing bubble collapse of the mid-2000s, and\ndecide to take on the big banks for their greed and lack of foresight. <br><br>As the topic is serious as hell but for me, less entertaining, the\ndocumentary-type movie is full of exceptional actors. I liked the\napproach of random celebrities explaining the banking jargons. With\nthat, I was enlightened a little bit. Honestly, I still don't\nunderstand some of what happened in this movie. I guess, I am too young\nfor this or I am not in the perfect place for the setting and theme of\nthe movie. That is my only problem in the movie, I just need more\nMargot Robbie to explain the movie for me.<br><br>I, honestly, didn't enjoy the movie.\n"},
{"review": "\nWow -- you had better either keep up non-stop, or have the remote handy\nfor re-wind, because the story line and editing leave much to be\ndesired in what could have been a better film if not so egotistically\nshot stylistically, rather than in a more linear fashion. To say that\nthere is a terrific ensemble cast is understatement, but some of them\nunderutilized, and some over-utilized (Steve), with some consequence in\nSteve's case with what is most certainly unarguably the worst hairpiece\nin recent cinema. That it distracts is also an understatement. The last\nbemoaning factoid of this otherwise purportedly true story is that it\nblames only Wall Street, which in doing so rather conveniently or\nignorantly skips federal government fault, which at the time had\nDemocrats in charge of both Senate and House of Representatives\nfinancial/banking oversight.\n"},
{"review": "\nThis is an ORIGINAL SOURCE VOLUNTEER FEDERAL WITNESS OF MORTGAGE CRIMES\nANNOUNCEMENT For more free information ON WHAT REALLY HAPPENED, visit\nWethePlaintiffs.com I am is a member of several advocacy groups\ndedicated to uncovering mortgage crimes AND I AM NOT SHY ABOUT SHARING\nWHAT I KNOW. USE YOUR KEY BOARDS AS PADDLE BOARDS AND SPANK THESE\nBANKS!<br><br>If you think the \"Big Short\" was useful, then you are going to love\nthis. As I can ONLY use my own personal case study on this site, I am\ngoing to brief each and every one of you on what you will be needing to\ngo research on your own files. This information is FREE. <br><br>https://www.facebook.com/faith.brashear.5/posts/946663032055997<br><br>Share the LOVE!\n"},
{"review": "\nNow, for those of you (myself included) appreciating a good story in a\nmovie, this film is going to be disappointing. It's the perfect example\nhow you can have a very strong fact and some pretty good characters but\nstill get it wrong. The fast cutting, mixed news and archive footage\nflash-backs simply won't replace the story(telling). I had to fight\nthroughout the entire film with the impression that the director is\ntrying too hard to find a better and more shiny way to tell his story,\nprobably because he felt it was too complicated, too snobby for a wide\naudience. Nevertheless, you can see some very fine acting, especially\nfrom Christian Bale. And, of course, you can get yet another point of\nview for the big financial crisis that we're all still licking our\nwounds from. Worth seeing, but rather on TV or rental, so you can skip\nit if it becomes too annoying.\n"},
{"review": "\nI was looking forward to this movie. So much praise and all those Oscar\nnominations... I was disappointed. Yes, it is well made; yes, it was\nwell acted (Carrel was particularly good, Bale played his usual twisted\ncharacter); but I was bored, even dozed off somewhere through the first\nhalf so I had to rewind and start again. The events in question are\nrecent and are still fresh in our memories, we know how it all ends.\nMore than once I was ready to wrap it up, but it kept twisting and\nstretching. It had its funny moments. I might see it again in the hope\nI can find those treasurable moments other reviews talk about but I'm\nnot holding my breath. There are better things out there at the moment.\n"},
{"review": "\nThe preview made this movie seem a lot more interesting than it\nactually is. If you know nothing about banks and bonds, or just don't\nsimply care about that, this is not the movie for you. The humor is\nvery immature and not funny as nobody in the theater was laughing when\na joke was made. The plot is very convoluted and confusing so much that\nit puts you to sleep because nothing is going on. It was a complete\nwaste of money and we left the theater before the movie finished. While\nthe acting may be good and the actors are popular faces, it's hard to\nget by the bad organization and confusing plot. Anyone who was hoping\nfor an interesting, funny, on the edge type of movie, this is not the\none. The movie is not dramatic at all as nothing was giving a sense of\nurgency. It is like just a bunch of men arguing about bonds and not\ndoing any work. That's about it.\n"},
{"review": "\nThe Big Short tells one story too many and feels jumpy and haphazard\n\u0096 especially since the characters in each storyline never intersect.\nIt's really three movies in one \u0096 and would have been better served by\nbeing two stories well told.<br><br>With a frenetic \"turn five cameras on and let the actors improv\" style,\nthe film's hyperactive chattiness completely strips the emotion from\nevery scene. It's all pretty headache inducing to be honest.<br><br>The film also has 10 minutes of unnecessary exposition done with a\n\"wink wink\" style that makes you not even pay attention to what's being\nsaid. For a second it feels clever until you realize that the content\nreally is superfluous, interrupts the narrative, and pulls you out of\nthe film.<br><br>For me, the Big Short's final nail is the overly-preachy ending where\nthe film revels in its own self-importance.<br><br>The performances are GREAT, however, with Steve Carell destined for an\nOscar nom. Ryan Gosling shows some real talent. Wait for Redbox on this\none.\n"},
{"review": "\nIn Wolf of Wall Street Jordan Belfort tries to explain what he is doing\nand then he says that we are probably not going to get it anyway and\nall that matters is that he is making a lot of money. Well this movie\ntries to explain everything and some things it does and others it\ndoesn't but the whole point of the movie is explaining how the crisis\nhappened and why, it is more of a documentary than a drama. It tries to\nbe a bit like Wolf of Wall Street with the breaking of the fourth wall\nwhich I am OK with. What I am not fine with is the direction which was\na bit sloppy on purpose to give it more of a documentary feel which I\ndidn't like. Also it is very informative but it doesn't have much\nentertainment value, I love dialogue in film but in this one I just\ndidn't understand what they were talking about in some instances. The\nstory could have been presented in a better way but it is still worth\nseeing just to see how we are being used by the banks. Just for the\nmessage and what it exposes I give it a higher grade than I would have\nwhich would probably have been a 5.\n"},
{"review": "\n\"The Big Short\" boasts an impressive cast featuring Ryan Gosling, Steve\nCarell, Christian Bale, Brad Pitt, and a slew of cameos and other brief\nappearances. It is based on a true story and a book written by the same\nauthor as what \"The Blind Side\" was based off of. It is directed by\nAdam Mckay, a man who has a knack for comedy, and is expertly filmed.\nIt basically has Oscar written all over it. There really is no way this\nfilm can fail, right? The problem with \"The Big Short\" is none of the\nitems mentioned above, but in its writing and pacing. The film is\nextremely long, slow, and dull. It is very confusing, even with the\nexplanation of certain terms given by random celebrities playing\nthemselves throughout the film. I heard a comment from someone who said\nthat you basically need a master's degree in business or finance to\nunderstand what's going on.<br><br>For the full review, visit http://thecinemachap.com.\n"},
{"review": "\nOK, so i've watched this in movie hoping to understand the main story\nof '08 crisis. Instead I get a 2h movie full of boring terms and people\nacting like they are smart and \"gtfo attitude\". I've tried so hard to\nmaintain the course of my brain ,to pay attention to the story, but the\nreally annoying terminology and economical jargon kept me away from\nconstructing any bond with an actor or a situation. I am thinking: what\nif a broker watch this movie...what he will think about it ? It will be\ninteresting or probably will say that the movie it's not accurate like\npretty much every movie lately. Seriously, this production don't even\nput Chris bale in a good light... because he is just a \"mad pawn \"\nright there talking about banks and sums. His role don't put him in the\nright place for showing his potential. Crude !\n"},
{"review": "\nJust saw the Big Short today and it was pretty meh i got bored to death\nand it's a subject that we have seen millions of times in movies that\nactually did it much better. The only good thing about this was that\nMargot Robbie cameo which it was excellent and Christian Bale's\nperformance isn't that much for an Oscar the cast did an OK job but the\nfilm moves so slow that it becomes pretty depressing by the end. It's\nnot bad on the writing or the direction but it doesn't deserve the 8\nrating that IMDb gave it and i hope that someone better actually wins\nthe Oscar on February 28th because sorry but no sorry this film wasn't\nreally that great!!\n"}
]