[
{"review": "\nI just saw Shutter Island this evening, just prior to its American\nrelease. I have to say this film was full of intrigue. Prior to viewing\nthis film I had built a preconceived notion of what this thriller was\ngoing to be like because I was fooled yet again by good marketing when\nwatching the trailer. This is probably not the movie for your average\nfilm-goer who wants an easy plot line to follow and little thought\nrequired. This movie does challenge the viewer physchologically and\ndefinitely holds your attention all the way through. For someone who\nwas never much of a Leonardo fan, his performance is brilliant, so much\nrange to his character. In fact all of the acting in this film is\nexcellent. The directing is probably the best quality to this film. I\nalways enjoy watching a film that is as unpredicatable as this film and\nwhere the director has turned the plot line on to his viewer.\n"},
{"review": "\nReally, Scorsese should just give it away for anyone. The man is one of\nthe most brilliant directors of our time. Anyway, let me get to the\nactual movie; I just saw it at a early screening and have to write this\nwhile I'm thinking about how stunning it was. Shutter Island is\ncertainly not a typical film, not even for Scorsese. It is a different\ntake for the director, and he does it, as he does every film,\nperfectly, so much as to be in his own league of film-making. I don't\nwant to give anything away, but I will say this: Shutter Island was\ncompletely unexpected, and a great start to 2010. It had all the\ncomponents of a great film, and then some. The acting is spot on from\nevery character; none of it seems forged or out of place. The script is\nfantastic; it has one of the most intriguing plots I have seen in a\nwhile (exception being Tarantino's Basterds). Everything, down to the\nset's lighting, was perfectly executed. I will say that not everyone\nwill like this; Shutter Island, again, isn't your typical movie. To\nthose, though, who do choose to see this film, be ready for a\ncompelling, gripping, thought-provoking experience, so much so that you\nmight think to see it again for further clarity (I know I will; it was\nso entertaining and my mind was blown!). Don't be surprised if you see\nthis at the next Oscars...\n"},
{"review": "\nI saw this and I knew what to expect going in to the film as I had\nalready read about half of the book but never got the chance to finish\nit. But I was surprised at how faithful the film was to the original\nmaterial.The directing was also masterfully done and pretty cool I saw\nsome cool camera tricks I hadn't seen since Martin Scorsese directed\nBringing Out The Dead, Martin Scorsese did one great job and everyone\nwas top notch especially Ben Kingsley and DiCaprio and I never though I\nwould jump out of fright especially in a Scorsese film but I did. All\nin all a solid thriller with a good story and some great performances\nand for me it's the best film I've seen in 2010 so far.\n"},
{"review": "\nMartin Scorsese has done it again. He pays attention to every detail in\nthis film, making \"Shutter Island\" one of the best suspense thrillers\nof all time.<br><br>Visually intriguing, simplistic and absolutely phenomenal. The story is\nkept simplistic enough so it doesn't get absurd, but allows for an\nending which you probably won't see coming. The film doesn't go for\ncheap thrills, so although you will be on the edge of your seat you\nwon't get needlessly scared.<br><br>The film uses everything at its disposal from breathtaking scenery, to\ndetailed laid-out shots, and to actors at their finest to completely\nengross you in the film. I loved every minute of it and highly\nrecommend it to everyone. Even if you're not a usual fan of the genre,\nthis film has so much more to it.\n"},
{"review": "\nMartin Scorsese returns to film making after winning the academy award\nfor The Departed with his fav star Leonardo DiCaprio.. This time he\nmove to a completely different script which keeps the audience humored\nand thrilled from the first scene till the last! The movie( which i saw\nat the Berlin film festival!) blew away the minds of many people, the\nplot being so strong and thrilling which kept the audiences guessing! <br><br>When it comes to acting Leonardo lets no stone unturned! The supremely\ntalented actor has once again showed that why Martin casts him in his\nevery movie as he is simply superb! He not only fits into the role\nsmoothly but delivers a terrific performance every time! Sir Kingsley\nbeing the head psychiatrist of the asylum has also done a marvelous\njob!<br><br>The film is full of flashbacks and haunting dream sequences that range\nin location from the island itself to the concentration camp at Dachau.\nThe audience is constantly trapped in a world where one questions what\nis reality and what is dream. Don't miss this one!\n"},
{"review": "\nFirst, I know many who read this will not take the time to research\nwhat I'm saying to see that it is true and further, many won't have the\nability to see it even if they did. So, I know this review will be\nthumbed down by those who don't like the hard truths in life but this\nmovie (or should I say novel by Dennis Lehane) was a nice piece of\nplagiarism based upon a 1920 silent film called The Cabinet of Dr.\nCaligari.<br><br>The same basic plot exists in both as well as the exact same twist\nending. The lead character investigates an insane asylum and tries to\nput clues together to figure out the mystery surrounding the place but\nas we near the end, we learn that the lead character isn't there to\ninvestigate anything. He's an inmate there who has invented much of\nwhat he was investigating as part of his coping mechanism.<br><br>Shutter Island would have been a good movie if it hadn't ripped off The\nCabinet of Dr. Caligari so blatantly. Lehane obviously knew that the\nold movie was in the public domain but instead of telling the viewers\nthat it was based on that movie, they just pass it off as his (and/or\nScorseesi's idea). That, my friends, is the definition of plagiarism.<br><br>I don't recommend this whatsoever for this reason. It is a shame and\nLehane should be called on it but who will do it? Too much $ to be made\nreheating the old dishes and calling them made from scratch.<br><br>Watch The Cabinet of Dr. Caligari (it's on y o u t u b e if you want to\ncompare the two and see that what I'm saying is 100% correct).<br><br>I almost never write reviews but this time, I had to.\n"},
{"review": "\nI hate to say this as much anyone else but for me this film had a\nhorribly disappoint ending. First before I delve into that I'd like to\nsay that the acting, the writing, the shooting, the film in general as\nfar as quality goes was very good. But the ending was very\ndisappointing. And no I am no idiot or newbie when it comes to film.\nBut I thought the was very much a cop out. Now granted I know this is\nbased off of a novel, hence there are certain restraints to adhering to\nthis novel somewhat. That being said I found the idea of the medical\nexperimentation, mental hospital, nazi experiments, and astray patients\nmuch more tantalizing, realistic, and more full of potential. The trick\nending where its all in someone's head is done far too often sadly. I\nwas hoping that while it dragged one there at the end it would\nultimately reveal he was playing them or that he would stay true and\nnot give in. But that didn't happen. I guess for me I was just\nexpecting something not so cliché for an ending from the likes of\nScorsese's genius mind. But all things said and done I definitely can't\ngive this movie all negative remarks, wonderfully acted and scripted.\nGreat atmosphere, shooting, photography, etc. But I feel the ending\nshould have been less cliché or not as cheap I guess. Felt like it was\njust an easy way out and not fully developing the tension and intrigue\nthat they had built throughout. But either way its each to their own,\nso maybe you will appreciate the ending more than I. FYI - I do\nunderstand the undertones of the ending and the ambiguity, but I don't\nthink that saves the ending or does the film justice in it's entirety.\n"},
{"review": "\nThis review DOES contain spoilers.<br><br>Right at the beginning of the film it becomes clear that this is\nsupposed to be all spooky and scary. The movie tries too hard at\ncreating an eerie mood, and fails miserably because it is so overdone,\nespecially with the music. There are a few good scenes but most of it\nis repeated so many times it becomes tedious. The observant viewer will\nquickly understand (spoiler here) that the US Marshal actually is a\npatient there, and from there on in you just wait for him to \"get it\",\nand you no longer care about anyone or anything that happens. And the\nshocking twist at the end is no twist, its just a boring \"yeah, yeah,\nwe get it\"-moment. Of course he's on his way to get the lobotomy, yeah\nso he's not cured, maybe he chose not to be cured, blah blah blah, \"the\nending leaves so many questions\" yeah whatever.<br><br>It's too overdone, too obvious, too long and too boring. We are\npromised an exciting story but it does not deliver. This movie will\nprobably be spoken highly of by all the know-it-all's, and if you\ndidn't like it you'll be told that you \"didn't get it\". But yeah, we\ndid get it, because it was way too obvious.<br><br>Spend your money on something else, get a haircut for instance. It's\nless boring and quicker.\n"},
{"review": "\nAfter coming on this usually reliable site and seeing the high rating\nfor Shutter Island, I decided to check the movie out. I was HIGHLY\ndisappointed\u0085 so much so, that it frustrates me to even give it enough\nattention to write this review.<br><br>THE GOOD: The cinematography made this film somewhat tolerable. The\nopening scene was great, but then it went downhill from there\u0085 <br><br>THE BAD: Whoever wrote this film should be ashamed. There was no\noriginality to this plot whatsoever, and the overacting almost made\nthis film unbearable. The ending was so frustrating that I wondered if\nI actually missed something. I kept waiting for the movie to get\nbetter, but it never did. I just kept thinking that this couldn't have\nbeen one of those \"it was all a dream\" clichés, but sadly it was. The\nentire film was so redundant that all I could say at the end of the\nfilm was: \"seriously?\" Do NOT waste your money\u0085 it will leave you angry\nand frustrated.\n"},
{"review": "\nSpoilers ahead, although not really, since none of the movie you watch\nwill be relevant to the ending.<br><br>Let's break it down simply. The whole movie is a two hour long,\ntwilight zone style \"and then he woke up.\" Everything you watch, all of\nthe characters, all of the story, mean nothing. They are erased at the\nending when the protagonist \"comes to\" and realizes that he's just a\nmurderer. But keep in mind, this isn't any normal crime. It is at once\nas cliché and as over the top as possible.<br><br>In the meantime, heir director made no attempt to do any serious\nresearch into psychology at all, even its history. At the end you're\nwatching a literal, rational, \"bargain\" being made between the\npsychologists and the protagonist, despite the fact that at the outset\nof the film they point out that the insane are not so easily \"reasoned\"\nwith, that they don't respond to stimuli in \"rational\" ways.<br><br>In short, the whole movie is a textbook case of failure in the art of\nstory telling. I wish I could be less harsh, but I've been reading IMDb\nfor years now, and this was the first time I felt the need to register\nto expose a film. If you really liked this film, then you don't\nunderstand story telling at all, and you have no taste. You can whine\nabout it all being a matter of opinion if you want, but a story that in\nits climax obliterates the hour and a half you took to get there is no\nstory at all.\n"},
{"review": "\nThe movie starts out really nicely as you settle down into your seat.\nTwo great actors in a very nicely set period piece, beautiful lighting,\ngreat supporting cast...this is going to be good you think to yourself\nand you almost hug yourself in anticipation. But, things quickly start\nto go wrong. Thirty minutes into it...that doesn't make sense...hold\non...surely he's not trying to...but that's been done before...there\nmust be a twist...it's coming...any minute...any minute now. Then it\nslowly dawns on you that it's not coming because there is no\ndouble-double bluff...he's actually trying to sell a story that's been\ndone so many times before but better...Twelve Monkey's...the audience\nis restless because they've got it too and they're waiting...waiting in\nvain! My head is in my hands...What a waste of talent and what a waste\nof time!\n"},
{"review": "\nI watched this in the cinema on a Friday night and expected a horror\nfilm because it was hyped as a horror film. Make no mistake, this is a\nchilling psychological thriller and I can quite see why Scorcese likes\nto work with Leonardo (from 'The Departed') and with Robert Richardson\nfrom the cinematography for 'Inglorious Basterds'.<br><br>As others have commented, Scorcese has borrowed (but not stolen) from\nHitchcock suspense movies and the scary flashbacks remind us of the\nrecent 'Inglorious Basterds' and at times 'Cape Fear'.<br><br>There is nothing to laugh or cry about in this movie and there are no\nreally gory scenes, though some scenes (as in Pans Labrynth) I question\nwhether I can expose my 11 year old Son to see.<br><br>This is a challenging and intelligent movie although for the first 40\nminutes or so, I do wonder if I am watching a comedy as Leonardo as\n(Teddy) spars with Ben Kingsley (as Dr Cawley) in the 'why am I really\nhere?' stakes.<br><br>The film also reminded me 'a touch' of Michael Douglas in'The Game'\nwhere you are never sure what is reality and fantasy. As a movie goer,\nwe have the right to expect the unexpected and we got it for sure in\nthis movie.<br><br>I am not a Scorcese fan and as much as I like the movie overall, I\nunderstand why it is not suitable for Oscar nomination.<br><br>I like the ending of the movie personally and I have never read the\nbook. Hands up who has read every book for every movie out at the\nmoment? The final scene between Leonardo (as Teddy) and his Partner\nChuck linked with the opening scene on the boat perhaps tells the story\nwe want to know while puzzling throughout on everything which happens\nin between.<br><br>Yes definitely see this movie but no need to take the tissues for this\none or hide behind any bedsheets if watching on DVD. Absorbing,\ninteresting and one to reflect upon afterwards.\n"},
{"review": "\nScorsese hit his peak with Raging Bull and it has been downhill ever\nsince. Teaming up with Leo instead of keeping the franchise going with\nDe Niro (OK, he's old but he can still act) was a major mistake. Gangs\nof NY? A snoozer except for Bill the Butcher; the Departed, overrated,\nnow this turkey.<br><br>My wife and I were laughing out loud at Marty's lame attempts to\nemulate the master, Alfred Hitchcock, at trying to ramp up the tension.\nIt was embarrassing -- spiral staircases, gleaming knife, rocky cliffs,\nad nauseum -- never once creating a genuinely believable moment. It was\nas though a modern artist was trying to repaint the Mona Lisa. This was\nall by-the-numbers.<br><br>A few minutes into the movie, we need Teddy was nuts and hallucinating,\nand yet we had to endure two hours of sordid flashbacks, dead\nconcentration camp kids, a dead wife who keeps reappearing throughout\nthe movie saying the same thing over and over, and the usually\noveracting of De Caprio, who can't seem to utter a line without making\na face of some sort. All I can remember is his dancing eyebrows and\nhistrionics through a fake boston accident.<br><br>Leo would have been a bit player in One flew over the Cuckoo's Nest,\nbut here he is the big star that somehow the entire island devotes 2\nyears, entire staff as well, trying to \"cure\" him of his insanity only\nto resort to lobotomy in the end. Now that's realistic. Certainly,\nasylums spent two years on each patient trying to reconstruct their\npersonalities by everyone playing a different role to accommodate the\nneeds of the nutcase. It would have been a lot easier to lock him in a\npadded cell and be done with it, but then there would have been no\nmovie.<br><br>Mr. Hitchcock, if he could, would roll over in his grave at this\nblatant and failed attempt at honorifics. Time for Marty to take his\nmillions and play video games.\n"},
{"review": "\nPredictable - which is the worst thing one can say about a movie.<br><br>The twist at the end is not enough to rescue this move, and Martin\nScorsese has done remarkable work (as usual) in telling a story - but\nit wasn't that good in book form either. The story is set in 1950, and\nwould have been a great and interesting hit if it had been launched in\n1950, but as a 2010 movie it has already been done. I won't say by\nwhich movies because that would spoil the 'surprise'.<br><br>Sorry, but it isn't just me who won't be keeping this DVD in our\ncollection. My wife didn't like it either. And she has great taste!\nPeter\n"},
{"review": "\nThis film is unadulterated rubbish (1) <br><br>The plot is soo predictable - we know Di Caprio's a mental patient from\nabout 10 minutes in (2 &amp; 3).<br><br>This can be the missing bit - like the film's lack of credibility (4)<br><br>Would the staff of the mental institution bother to indulge his\nfantasies to this extent as a means of effecting a cure - probably not\n(5 &amp; 6) <br><br>This film sends itself up by taking itself too seriously (7)<br><br>The supporting characters deliberately make themselves look sinister,\nthe director tries to make the film play out like a modern remake of a\nHitchcock movie - it fails to impress on any all level (8-10) there\ndone it!\n"},
{"review": "\n...one can see the twist in the story miles away.<br><br>SI is slow boring and not as smart as some of the reviewers think it it\nis. This film is one more of those films that question sanity and whose\nmain character (in this case Leonardo di Caprio) is found to be living\nin an alternate reality. <br><br>A person with half a brain would have seen that after the first 15\nminutes. <br><br>Well, all SI does is to jump back and forth from \"the realities\"\nexperienced by Di Caprio's character at the beat of a dreadful and\nannoying musical score (it gave me a head ache...). To make things\nworse it ends in an ambiguous way, another gimmick to make the viewer\nquestion his own reality... not very original.<br><br>SI tries hard to be a horror movie, to create an eerie atmosphere, to\ninvolve the spectator with a mystery and a drama that simply are not\nthere. It fails poorly.<br><br>SI is another example that Hollywood has run out of original ideas.\n"},
{"review": "\nI was set to see this new psychologically thriller, a Martin Scorcese\nmovie and straight into the top 250 in the IMDb list. One question I\nwant to ask is how did this happen?? It was a clever plot line with\ngreat potential but I was sat in the cinema waiting for the big thrill.\nNot once was I sat on the edge of my seat. I scare very easily, I\nalmost contemplated not going because I thought it was going to be so\nscary. So I went expecting what had been conveyed as a psychologically\nthriller, yet I was not thrilled at all. Even when you are expecting a\ncheap scare there was none. Even when you were sat there waiting for a\nbig twist or a scream from the audience or a big thrill from this so\ncalled brilliant movie, I was not once scared, not once thrilled and\nnot once satisfied. It could easily have ended half an hour before it\ndid and honestly I wish it had. A complete disappointment and I hugely\nurge you not to pay money to see this movie, it is not worth it and\ndefinitely do not go if you think it is going to be a good movie, if\nyou go, go expecting it to be bad so that you might actually enjoy it.\n"},
{"review": "\nOooo! it's Scorsese! and The Caprio, and Ben \"Gandhi\" Kingsley. Let's\nstart the praise, the \"masterpiece litany\"!!!! The film is presented\nthis way (the quote is from a review at IMDb's): SHUTTER ISLAND is the\nstory of two U.S. marshals, Teddy Daniels and Chuck Aule, who are\nsummoned to a remote and barren island off the coast of Massachusetts\nto investigate the mysterious disappearance of a murderess from the\nisland's fortress-like hospital for the criminally insane. Try now to\nbelieve it. As the aim of the movie is to deny what you have just read.\nSo what's the point? I can introduce Alice in wonderland like \"it is\nthe story of a Chinese manufacturer who is hired by a mysterious\nunderground tea dealer. Eventually she has to confront the mischievous\nqueen of Tibet to defend a bunch of rabbits\". Shutter Island is a bad\nmovie. Everything is built on a \"twist\" which is clear since the very\nbeginning. In-depth explanation involving fire and water dichotomy\n(some review at IMDb's) must come from patient 64. There are a couple\nof nice shots (nice doesn't necessarily mean \"beautiful\"), but there\nare a lot of flaws in the \"story\", boring clichés, incongruences,\nunexplainable behaviour even for an asylum... and the more you try to\nsum up things, the worst it looks.\n"},
{"review": "\nThe only question is this a floater or a sinker? Everything is so heavy\nfrom Leo's Boston accent to the set design and the score there is no\nquestion it's a sinker. The sets are so over the top at one point Ben\nKingsley blames them on a civil war general. The big twist of the story\nis obvious from the trailer, even from the thirty second TV spot, to\nanyone over the age of twelve, who has seen a mental hospital movie. In\ncase we needed some exposition Leo meets a women in a cave and he\nexclaims \"you're the real...\" in case we couldn't figure it out. Add in\nthe concentration camp flash backs that would make Tarantino cringe and\nfifties paranoia, nothing floats. The movie looks good but Marty get\nyour hearing checked.\n"},
{"review": "\nI am unsure of where all the reviews are coming from, I saw several\npeople in the same screening as mine with the same opinion as mine -\nterrible/waste of money.<br><br>The movie has been absolutely hammered with marketing which in general\nmeans it is a terrible movie. This is certainly the case here. It plays\nout like a D- story written in junior high, ending with, he woke up and\nit was all a dream. The ending didn't flow whatsoever with any of the\nmovie, came across like the director wanted to finish early for his\nsummer vacation.<br><br>I won't even rate the first 90% of the movie as the ending ruins the\nentire thing and I wouldn't recommend seeing this to anyone, PATHETIC.<br><br>Martin Scorsese - Shutter Island Grading - D-\n"},
{"review": "\nI've seen one good film (Departed) and one very good one (Blood\nDiamond) with Leonardo Dicaprio and thought, OK, you can't be wrong if\nyou spend time and money for another one.<br><br>But what Bull... was this? For me it seemed like a bustling Director\nwas trying to pump up an trivial story to a \"big blockbuster\" and did\nnot notice, that this might be just enough stuff for a short story. How\ncan one call this an \"intelligent movie\"? <br><br>Conclusion: Very mainstream, predictable and absolutely boring. What a\nwaste of time and money to film this old chestnut in such a\nfeatherbrained way.\n"},
{"review": "\nI'll start by saying that I did enjoy this film overall but there are a\nlot of really annoying aspects to it. First off is DiCaprio's stubble,\nwhich in 1954 would have made him a vagrant, not a US Marshall. Then\nthere was the ridiculous music that accompanied an inconsequential\nscene of the marshals entering the asylum gates for the first time. It\nbuilt up and built up, then nothing happened. That kind of thing is\nreally annoying. The score overall veered from terrific to grating and\ninappropriate in places. I often found it quite distracting. There were\nmany continuity problems throughout. If it was meant to add another\ndimension to the film, it failed. Instead it was distracting and gave\nthe impression that they ran out of time/budget more than anything\nelse. The plot is largely obvious from early on. If it takes you more\nthan 15 minutes to work out what is going on, there is something wrong\nwith you. OK, the full extent of the revelations at the end is harder\nto divine before it's revealed but the thrust of it is obvious. The\nfilm was, as you'd expect, beautifully shot and the cast was pretty\ngood, although DiCaprio's Boston accent came and went at different\ntimes. The setting was also magnificent, which added to the overall\neffect. As a genre film, Shutter Island doesn't work nearly as well as\nothers. Identity comes to mind as a far better attempt at the same kind\nof story. It's probable that it's strength is that it is not really a\ngenre film and will, therefore, appeal to a broader audience. However,\nit is definitely not one of Scorcese's best. If I had to rank it, it\nwould sit somewhere near Bringing Out the Dead.\n"},
{"review": "\nNazis, House Unamerican Activities Committee, Dachau, man with scar on\nface, Nazi doctor, floating children, scary lighthouse... Martin, what\nin the heck??? I'm sure there was a story in there somewhere. A story\nthat has been done a million times over and much, much better.<br><br>It is impossible to cite specific instances of guffaw-inducing\nmovie-making in Shutter Island--because it was so darn awful\nTHROUGHOUT! The first clue was that inane pounding,\nsilent-film-organ-like music that introduced every scene you in which\nyou were supposed to scream--and not laugh hysterically. If they had\ncut out all that flashback nonsense, which of course I am sure Scorcese\nthought was so wonderfully 'artistic', they could have got the film\ndown to about 90 minutes and could have had, well, certainly not a GOOD\nmovie but one that was definitely not as awful as what was produced.\nReminded me a lot of Gangs of New York, which also started out very\nstrong but then went on for 100 hours. At least that was an interesting\nsubject and prompted me to buy the book it was based on and read it. I\ncertainly don't feel that way about Shutter Island. And did I see the\nsame movie as the positive reviewers saw? <br><br>There's 2-1/2 hours of my life I'll never get back.\n"},
{"review": "\nThere are so many reviews already that I hesitated before deciding to\ngive yet another one, but here it is anyway, one more for the 'this\nmovie was utter crap' brigade.<br><br>AND IT WAS! It tried so hard to be clever, yet it hit you over the head\nwith its stupid 'hints' and 'clues' when we had already guessed the guy\nwas mad anyway (as were we for watching this pile of drivel) L de C\nspent the whole film with a painfully bewildered expression on his face\n(or was he just trying to figure out ways to get his name off the\ncredits?) The acting was wooden sometimes, over the top others. What\nmore can I say?? Please please do not waste your time.\n"},
{"review": "\nI was so looking forward to this movie. The trailer seemed promising.\nThe term \"unsettling\" was used, and it filled me with hope as it's not\na word that I've seen used very often in reviews.<br><br>It is an incredibly boring movie with an obvious plot twist. Although,\ncan it really be called a \"plot twist\" when everyone and their mentally\nill brother can see it coming from a mile away? DiCaprio is a patient\nat the hospital, there I said it, but you knew it.<br><br>Andrew Laeddis (DiCaprio) killed his wife because she killed their\nkids. He's been locked up in Ashecliff Hospital on Shutter Island. So,\nunable to deal with his murdering of his child drowning wife, he\ncreates a new life (now he's named Teddy). Teddy thinks that the\ndoctors are conducting human experiments. He also thinks that Laeddis\n(that jerk)is in the hospital and must find him because he believes\nthat Laeddis killed his wife. Everyone living and working at the\nhospital reinforces his delusion so that he will come to accept his\npast. Read that last sentence again and really let it sink in. So it\nwould seem that the hospital is conducting human experiments, or at\nleast one really dumb one.<br><br>The doctors and other staff have given \"Teddy\" free time on the island.\nHe's all over the damned place. He's scaling rock faces like he's\nSpider-Man. He swims through rough seas, and some how avoids all the\njagged rocks, as though he were Michael Phelps. He throttles another\ninmate. He blows a car to smithereens.<br><br>The acting is really awful. The plot is on par with high school English\nassignments. The production is nothing to write home about either.\nShame!\n"},
{"review": "\nSeriously, this is one of the worst movies I've ever seen, on several\nlevels. The average rating of 8.0 astonishes me. OK, I evidently have\nto say more. Here goes - it starts out reasonable and interesting, then\nit gets weird. with lots of strange evidently psycho stuff going on,\nbut it's just weird, not interesting, not thought provoking, difficult\nto follow, ... stupid you might say. It seems to be an all too\npredictable trap ... but then no, actually, I guess, the guy is crazy\nand it's all part of an elaborate ruse / therapy ... shazam. Wow,\npathetic, not interesting, terrible, awful, tell me you like it\nseriously??? It's almost not possible. There, is my review long enough?\n"},
{"review": "\nI'm glad I got in free when I saw this movie opening day. Seriously,\nthis movie was overrated. I went into the theater and was expecting to\nbe amazed, but I was disappointed. A lot of people keep saying that the\nending \"twist\" was mind-blowing, or that they didn't see it coming at\nall. Just from watching the trailer, it's obvious that LdC was the 67th\nprisoner. No surprise whatsoever.<br><br>The acting was good, the plot development was decent, but it was very\npredictable, even cliché. I didn't hate the movie, but at the same\ntime, I didn't love it. Overall I think that this movie probably\nwouldn't be worth a second look, but of course, to all their own. If\nyou enjoy good acting with cheap, easy, and cliché endings then by all\nmeans, this is the movie for you. If you want something with a better\npayoff, then I suggest you look elsewhere.\n"},
{"review": "\nTedious and boring most of the time, interspersed with gore and\nirritating music. What was the point of this film, really? Was it meant\nto entertain mostly teenagers, because the presentation was so over the\ntop that M. Night Shayamalan will probably blush when he sees it? It\nwas a psychological drama without any psychological depth. Leo was\nagain cast in a role that was not right for him. What was needed was\nsomeone to physically embody the emotional turmoil the character had\nendured. And the flashbacks only make the intelligent viewer ask the\nobvious question, which is, why should we care so much about this one\nperson's troubles when all those people were killed by the Nazis (or\nsurvived with their horrible memories)? That was an idiotic thing to\ninclude in this film, totally undermining it. Scorsese tried to do way\ntoo much here. He could've tried to do a \"modern\" version of \"The\nCabinet of Dr. Caligari,\" for example. Then ending also didn't make\nsense to me, and was almost an endorsement of suicide, though\nconsidering how this impressed me as \"career suicide,\" perhaps it makes\nsome sort of ironic sense.\n"},
{"review": "\nI am disappointed with this movie. When you have Martin Scorsese behind\nthe camera , Leonardo DiCaprio in the starring role and some\ninteresting source material , you would expect an intelligent ,\nthought-provoking film. Unfortunately, the team behind 'Shutter Island'\nhave let this assumption go to their heads and as a result their\n'intricately-woven thriller' (?!?) is in reality too predictable and\ntoo equivocal to be worth watching.<br><br>The story revolves around detective Teddy Daniels (DiCaprio) who is\ncalled to investigate the disappearance of a woman from a mysterious\nIsland prison/asylum - home of the insane. It certainly begins well ,\nwith grim cinematography and ominous music , making the film appear\nvery formidable. Unfortunately , the movie then embarks on a trail of\nmany twists and turns , which were actually rather foreseeable.\nMoreover, the movie over-complicates itself through weird\nhallucinations that aren't necessary to the story. Ben Kingsley is good\nin his role, as are DiCaprio and Ruffalo but they cannot help this\nmovie as they are simply puppets of this mindless screenplay. I\nactually liked the ambiguous ending but honestly it just emphasised how\nunclear the writers were on how to wrap this up.<br><br>The tag line to this movie is 'someone's missing'. That someone is\nclearly a writer with any sense. And in case you have somehow eclipsed\nthe general gist of this review - this movie is seriously lacking in\nthe sense department ( no pun intended ).\n"},
{"review": "\nI'm about as far away from a Scorcese fan as you can get. In my book he\ntargets the lowest common denominator via a combination of foul\nlanguage and violence. True, there have been exceptions. I went to see\nNew York, New York, despite antipathy to the two leads, because it was\nabout Jazz in the immediate post-war years; verdict: ho-hum.<br><br>A little later he made Age Of Innocence and I went because I was almost\ncertain that he would be unable to insert his winning parlay\n(scatological violence) without radically altering Edith Wharton's\nstylistic novel. Verdic: ho-hum.<br><br>I was sold on Shutter Island because I read that 1) it was set in am M.\nNight Shylaman universe which meant the twist is that the victim is\nrevealed to be his own victimizer and 2) considerable footage was\ndevoted to Cinema itself. Scorcese is well-documented as both loving\nand being an expert on movies so it is almost certain that he is\nfamiliar with The Shawshank Syndrome and it is equally certain that he\nhas, to some extent, remade it with a Shylamanesque twist, if you\nrecall, was a catalyst surrounded by sad people who needed 1) a nudge\nto bring them together or 2) some form of healing. DiCappio is also a\ncatalyst surrounded by people who need help getting together - and\nhealing - Ben Kingsley. Viewed in these terms it can be said that both\ncatalysts succeed admirably but, it has to be said, when is a rip-off\nnot a rip-off? possibly when it's a sacred cow doing the ripping-off.<br><br>The 3D is used effectively and Von Snydow supplies the best\nperformance, counteracting the film's worst performance by Ben\nKingsley. Dipccaprio is as mechanical as the interior of Big Ben and by\nfar the best thing on view is the actual vintage footage.\n"},
{"review": "\nOnce director Martin Scorsese attained widespread acceptance from\nmoviegoers (and mainstream critics) with the massive commercial success\nof \"Cape Fear\" in 1991, he quickly turned into a 'blockbuster'\nfilmmaker, one who had his pick of top-rank collaborators. The Scorsese\nname became a brand--like Spielberg's--however, the movies he has\nchosen to work on since do not always echo the interests of the young,\nraw Scorsese. With \"Shutter Island\", an adaptation of a novel by Dennis\nLehane, the stamp of Scorsese becomes interchangeable with that of\nShyamalan, De Palma, Polanski...even the ghost of Stanley Kubrick,\nwhose \"The Shining\" seems to be an inspirational starting point for\nthis thin, shuddery yarn. Leonard DiCaprio plays a U.S. Federal Marshal\nin 1954 investigating the disappearance of a female mental patient from\na locked-down asylum in the Boston Harbor. Elements of other films keep\nturning up in Laeta Kalogridis' poor script, which incorporates (at\nvarious intervals) concentration camp detail with a triple homicide\nthat is both exploitative and distasteful. The large cast is solid, for\nthe most part--Scorsese has retained his uncanny ability to bring out\nthe best in his actors--though I'm not sure how deeply DiCaprio is\nfeeling his role. His frequent scowl doesn't reveal anything but a\npetulant nature, which, coupled with his youthful appearance, doesn't\nlend much conviction to a character who is alternately a soldier, a\nfamily man, and a government employee. DiCaprio is making a career out\nof seeming miscast; since this entire house-of-cards plot rests on the\nstar's shoulders, the final denouement isn't the heart-breaker it\nshould have been. The picture is vividly atmospheric and features\nexcellent technical detail, yet it is a glum undertaking burdened with\noverwrought profanities ill-suited to the era. This is what Martin\nScorsese wants to bide his time with? **1/2 from ****\n"},
{"review": "\nHard to believe the great Scorsese had anything to do with this\nlaughable stinker.<br><br>Even harder to believe the great Thelma Schoonmaker cut it!<br><br>There are many terrible things here: the direction, the acting, the\nmusic. But far, far worse than any of them is the editing.<br><br>The editing is absolutely atrocious. It so overwrought, so desperate to\nmake the scenes succeed, so completely contrived and overdone that it\nalmost defies description. And no, I'm not talking about the jump-cuts\nor continuity breaks. I'm not talking about ANY of that. That I can\ndeal with. Some of it I even liked.<br><br>What I'm talking about is the Academy Award-winner's complete and total\ninability to edit a simple dialogue scene with cuts that tell the\nstory.<br><br>It's as if she's lost every single ounce of talent displayed in\n\"Goodfellas\"... or \"Raging Bull\"... or \"Casino.\" Just about EVERY\nSINGLE CUT is wrong... arbitrary, poorly timed, ill-advised,\nnon-sensical.<br><br>I just watched a 40 year-old episode of \"Night Gallery.\" A 60--minute\nTV show they cranked out once a week. What a wonderful pleasure to see\ngood, effective, unpretentious editing!!!!!! Editing that serves the\nstory. Editing that's almost invisible. Editing that's just about\nunbeatable.<br><br>And that was 1970.<br><br>R.I.P. for now, Thelma. You had it once. You were great.....TRULY\ngreat.. You made Marty's scenes jump to amazing, thrilling, exciting\nlife. There was simply NO better editing on display in 1990 than in\n\"Goodfellas.\" Simply superb.<br><br>Now, alas, the magic is gone. Your cutting in \"Stutter Island\" or\nwhatever the hell it is, kills every bit of dramatic potential this\nhopeless turkey ever once had. Which of course is not saying much!<br><br>Yes, you had it....and now, dear soul, you've lost it. It's gone. I can\nonly hope that maybe, someday, God willing....you'll get it back.\n"},
{"review": "\nwell i must rate this very low- i am not a big fan of Leo D.<br><br>he is not the actor people make him out to be-- there might be 1 or 2\nfilms that he stars in that i like.<br><br>the movie- well not very well written - first thing-- smoking-- to make\nit seem real that had him smoke in the film--i didn't by it- me knowing\nsmokers and how they are- i thought -- \"here is a guy pretending to\nsmoke\"<br><br>well from the beginning i saw this and i knew i was in store for more\nthing to pick out-- back in the 40s and 50s people smoked like chimneys\n- i am not saying it was right-- it is just how they were- especially a\nwar veteran.<br><br>the other thing was the badge on the belt loop-- this is a 90s thing\nmost cops of the 40s and 50s wore their badges behind the jacket\nlapel--<br><br>or inside the jackets pinned about chest high-- all they had to do was\nopen their coat and expose the badge.<br><br>that was the in thing back then, belt loop or jacket-- so this film\nfailed to put me in touch with the era that it took plce in.<br><br>poor acting and poor writing make a poor movie and after seeing these\nthings in the beginning i was bored watching this even when i caught on\nthat it was just a delusion.\n"},
{"review": "\nDid I give it 1/10? Yes I did. Would I give it 0/10 if could? Yes I\nwould.<br><br>I am sorry to say but next time I have a conversation with a guy\nagainst \"piracy\" I can pronounce two words and win the argument:\nShutter Island. A waste of time and money, plain and simple. Even worse\nthan \"Public Enemy\".<br><br>Having in mind Pulp Fiction didn't impress me either I should say that\nmaybe it is that Scorsese fails to impress me in general. But after\nPulp Fiction I wasn't like \"damn, can I return back to three hours\nago?\".<br><br>What I didn't like? That in the last 10 minutes everything that I have\nseen during the last 2+ hours got so not important because it was a\nlie. It wasn't true anymore, just the guy's illusions. That Scorsese\nthinks that all you need to add more mystery in your movie is loud\nmusic. That the twist was so damn predictable after a while.<br><br>I am not going to write any more things, after all I watch every movie\nI want to watch even if everyone is telling me not to do so. And I\nthink it's right that you do so as well. Just don't say you were not\nwarned.\n"},
{"review": "\nI always fear that preconceptions and/or high expectations can cause a\nfilm to do worse than it deserves. For instance, walk in to a movie\nthat you know nothing about, and more often than not it will surprise\nyou. On the other hand, walk into a film directed by Martin Scorsese,\nstarring Leonardo DiCaprio, based on a novel written by Dennis Lehane\n(who wrote \"Gone Baby Gone\" and \"Mystic River\") and a supporting cast\nthat includes Mark Ruffalo, Max Von Sydow, Sir Ben Kingsley and Emily\nMortimer, you are almost certain to be disappointed. However, this may\nhave been true with other films but when it comes to a\nScorsese/DiCaprio collaboration (for example Gangs of New York, The\nDeparted and The Aviator)I expect a little bit more, and I expect the\nfilm to deliver something. This film sadly does not deliver, it does\nnot excite and it does not deserve to be in IMDb's top 250 (which at\nthe time of writing it does). I can only conclude that the masses have\ndecided not to bet against a previously assumed sure thing, and instead\nvote along with everyone else rather than question the latest\nScorsese/DiCaprio collaboration. The film opens on a boat, and within\nminutes we see DiCaprio and Ruffalo standing on the deck talking. It\nwas from this point onwards that I was disappointed and began to expect\nvery little from the rest of the film. Blue screen? Green screen?\nWhatever they use, they used it here and it looked horrible. And if\nnothing else, I have always found that of the Scorsese films I didn't\nnecessarily enjoy in the past I would at least walk out at the end\nsaying how beautiful and authentic everything looked. Well not here.\nSeriously disappointing. Don't waste ya time!\n"},
{"review": "\nFilmed with one of the worst screenplays of the last few years, this\nhas been compared to Hitchcock and to Film Noir, insulting both in the\nprocess. Tag line could have been \"I See Dead People 2\". Leo has grown\non me as an actor, and I think he gives an extraordinary performance,\nbut the script does him no favors. And frankly, I guessed at the\nbeginning of the movie what the twist was, but would have preferred\nbeing wrong. I think it would have been a bigger twist. Max von Sydow\nis wasted and Ben Kingsley plays Ben Kingsley. The flashbacks/dream\nsequences/hallucinations are ludicrous, portentous, and pretentious. I\nhated this movie from beginning to end.\n"},
{"review": "\nI must be crazy to have watched this movie for two and a half hours! I\nfelt as if I was locked up in that penitentiary and couldn't get up\nfrom my seat waiting for the plot to thicken. Why did i stay? I should\nhave ran when I first felt the urge to get out! I think Martin Scorcese\npurposely made this film to make you feel sick and insane and filmed in\na way to make you feel mentally and physically ill. I left with a\nheadache, neck ache and an ulcer. The characters were filmed so close\nup you wanted to press your head back into the chair to get a better\nperspective. You felt as if you were being interrogated. After two and\na half hours of listening to crazy talk and find a shred of rational\nthought......you felt depleted by the end to have realized that you\njust had a bout of temporary insanity for staying in the damn theater\nfor all that nonsense! This movie is not a psychological thriller but a\npsychopathic torture chamber! Don't waste your money and sanity.\n"},
{"review": "\n***********************SPOILERS++++++++++++++++++++++++++++++++++ The\nmovie starts off seeming to be a \"creepy\" thriller about the escape of\nan insane killer from an island fortress, somewhere off the shores of\nBoston. It's standard stuff for the first 45 minutes or so, with the\nusual attempt to make the criminally insane look scary. Mood is\neverything here, but as the movies have been down this path so many\ntimes, and as-in my case-I know that the insane are not particularly\nscary, it's a question of wondering why Scorsese is going down this\ntrite path.<br><br>When he shifts the plot to a \"conspiracy\" plot it gets even triter. And\nthen it shifts ponderously to a \"fooled you\" ending. The story tries to\nconfuse with it's shifts, but underneath it all it's all sturm and very\nlittle drang. When the ultimate plot line is revealed it's a big let\ndown. It's \"spellbound\" rehashed.<br><br>The big problems for me were that it continues to trot out the usual\nmyths about mental illness; it's symptoms, it's causes, and it's cures.\n"},
{"review": "\nOK...i will give Scorsese this, he makes a good looking film and good\ncasting. Thats where my praise ends.<br><br>This was one of the most predictable and obvious movies i had ever\nseen. I must of picked the plot when the first words 'insane asylum'\nwere mentioned. I was hoping that it wasn't going to have that\npredictable twist, but there it was, right on cue. It just seemed like\na lazy screenplay. Maybe the book was written better, i don't know,\nhaven't read it.<br><br>If you were genuinely surprised by the Teddy being the one that was\ninsane and that his partner was his 'primary doctor' then you must be a\nlittle slow.<br><br>I wish i had 4 hands so i could give this 4 thumbs down!!\n"},
{"review": "\nWOW Where should I start? I am a huge fan of this site however I've\nnever felt the need to register until now because I so strongly felt\nthe need to express my opinion about this terrible movie. I thought\nthis movie was wayyy overdone and poorly edited. I am not at all\nsurprised to read the user review stats. Currently 53 out of the 94\nposted user reviews of this movie are under the \"hated it\" category.\nThey ran every single concept into the ground. Many would argue that\npeople don't like this movie cause they don't understand it and that is\nnot true I feel like I knew what was gaunna happen the entire time and\nI just sat there for what seemed like an eternity waiting for a cool\nending that never came. It was so boring! The scenes were choppy and\nredundant. I understand that they were trying to illustrate the movie\nfrom the prospective of a person who sees the world in that way but\nthey didn't have to be THAT redundant in order for the viewer to\nunderstand that concept. The wife didn't need to pop up 13 times and\nsay the exact same thing for us to realize he has reoccurring\nhallucinations. And how bout the previews!? Ummm why was this movie\nportrayed as an exciting dramatic thriller? It was boring!!!! I feel\nrobbed! The worst movie I have ever seen! It is going to aggravate me\nso much if this movie wins awards!\n"},
{"review": "\nWhy on earth did Scorsese get involved with this giant clunker? <br><br>It is a dreadful exercise in movie-making, based on a badly-written,\npoorly- thought-out story line. There is no clever aspect, nothing of\nthe sort that made Hitchcock so great.<br><br>The actors do the best they can -- I guess -- with this film which has\na feeling of decadence and doom about it. The ending is a blessed\nrelief. <br><br>I enjoyed the clothes, the props, the car that was blown up, so I\ncannot rate it zero. One out of ten is the best I can do. <br><br>Give this bomb a miss. Don't be persuaded by anyone that it is an\nintellectual treat: no, it is simply a flop with a few big names in it.\n"},
{"review": "\nScorsese is surely THE most over-rated American director of all time. I\nvowed never to see another of his bombastic travesties, but was lured\ninto this one by the interesting premise. Alas, only to discover I was\nright all along. If Scorsese ever makes another good film, it will be\npurely by accident. He should stick to doing inane commentary on disc\nreleases of other people's films.<br><br>Shutter Island seems fine at first: a 'mystery wrapped in an enigma'\nsort of thing. But it gradually unravels, like all Scorsese's films, as\nhe tries strenuously to demonstrate his genius, rather than simply\ntelling an intelligent story. The ending is a final insult - of the\n\"aren't you sorry you bothered\" variety. It's a silly trick that Rod\nSerling might have used for a half-hour TV diversion, and then only\nwith a much-needed element of self-deprecating irony (a seasoning\nunfamiliar to the self-absorbed Mr. Scorsese).<br><br>Scorsese knows how to move a camera around, and get good performances\nout of his actors. But if you value logic and meaning over surface\ngloss, you need to stay away from this piece of elegant drivel.\n"},
{"review": "\nShutter Island is an absolute breathtaking movie with a tremendous\nstoryline that will keep you interested all the way through and a\nbrilliant cast that all follow through with their performances in an\noverall terrific film once again from the great Martin Scorsese.The\nmovie sounded pretty plain to me,I thought it would be an average\nthriller that I would enjoy but it would be pretty forgettable,but it\ntotally wasn't,the movie had me curious and also confused,and the twist\nwas one of the greatest,most surprising and most shocking twists i've\never seen in a movie,I literally never suspected it,not even once,and\nwhen it did happen I still didn't believe it.Shutter Island is a must\nsee for all fans of Leonardo DiCaprio,Martin Scorsese,thriller and\nmystery.<br><br>Teddy Daniels (Leonardo DiCaprio),a US Marshall,sets out with his\npartner to a mental institution in a quiet island to investigate where\na missing patient could have gone.But there's something suspicious\nabout the island that they didn't bargain for.\n"},
{"review": "\nDicaprio and all the other actors in this movie should be ashamed of\nparticipating in this disaster! Now I understand why some actors insist\non having the right to a say in the direction of the films they appear\nin. This complete waste of 2 hours tries to be a deep psychological\nthriller but the writing is SO-OO bad it only succeeds as a ridiculous\nand pretentious piece of cinema crap. Seriously, I kept expecting to\nsee M. Night Shyamalan take a stroll across the screen in one of his\ncheesy cameo appearances! This is just the kind of awful movie he\npractically patented. Movies with ambiguous endings aren't deep or\nclever; just lazy, stupid, and insulting to the poor viewer.\n"},
{"review": "\nEver head of the Cabinet of Dr. Caligari? Probably not, seeing as its\nan older silent film--the film that first introduced the twist ending\nto viewers and started up the horror genre. I know, it must seem random\nto bring up some old silent film, right?<br><br>Absolutely wrong. Shutter Island is an unimaginitive rip of of the\nprior. When watching this movie, I knew it seemed similar to some other\nmovie, I just didn't know how similar it was. Essentially, the plot of\nCaligari is a horror story of murders which in the end is revealed to\nbe in a patient's head. The bad guy was actually the doctor of the\ninsane asylum at which he lived.<br><br>In Shutter Island the bad guy would seem to be the doctor, and the\ntwist ending (a rather obvious on I guessed before the film) was that\nit was a patient who was imagining the whole thing.<br><br>Seriously, these two are two similar, and a film as important to film\nhistory as Caligari is one that should be held in much higher esteem\nthan this.<br><br>And I didn't even start on the acting, which was just as weak as the\nmovie.\n"},
{"review": "\nA pair of detectives arrive at a fog-bound island where a dangerous\nfemale patient has mysteriously disappeared from her cell in a mental\nasylum. 'Shutter Island' immediately announces its narcissistic\npersonality disorder and grandiose delusions as the soundtrack crudely\nblares the two men are entering a world of mystery and danger.\nUnfortunately it's also signaling the introduction of an absurd\ncollection of generic characters, mundane screen writing, wasted talent\nand melodramatic directing. The plot's big twist is obvious within the\nfirst half hour, after which it plods relentlessly on to the 'surprise'\ndenouement. All suspense having drained away at an early stage -\nsomething of a drawback in a suspense film - there's little to hold an\naudience's interest in either the main character or his struggles, so\nthe film stagnates like a bloated whale adrift on an endless sea.<br><br>Since artists frequently steal ideas from each other, it shouldn't be a\nserious problem that the basic concept has been taken from a much\nearlier German film - only that it has been re-imagined in such a\nprosaic and bombastic manner. The core idea is a clever conceit and\nfull of potential, but it requires subtle handling that seems utterly\nbeyond Scorcese in this form. It's difficult to remember another\nmystery thriller with Shutter Island's rich production values resulting\nin such a desperate state of boredom.\n"},
{"review": "\nWhere do I start with a movie which is so bad from every possible\nangle? What is happening to cinema these days? We have one of the\nsupposedly greatest directors, a bunch of superstar actors and an\nunlimited budget to make a movie. And what comes out is complete\ngarbage, making no sense. To top it all, the movie is on the top 250\nlist in IMDb. Maybe a chunk the money was spent on creating a secret\nnetwork all over the world on people casting a high grade on IMDb, so\nthe movie would not come out with 3 on average. In fact, I am quite\nsure it was done that way. Or maybe I am delirious and should be put\ninto an asylum? At least that is not as bad has having to suffer this\nmovie again.\n"},
{"review": "\nThe trailer for the film gives away far too much and essentially ruins\nwhat would otherwise be an effective twist.<br><br>I've never been too fond of twist endings, save maybe a few of the\ntwists from old Twilight Zone episodes but I felt the twist in this\nfilm really made the film entirely pointless.<br><br>We spend most of the movie engrossed in a detective story with a few\nflashback puzzle pieces and are left to wonder how those fit into the\ntwist we all know is coming. The fact we all the twist from the trailer\nmeans its basically only a matter of time.<br><br>I left the theater feeling hollow and annoyed. What is the point of all\nthis? What are they trying to say about crazy people? In the end Andrew\n(Teddy for most of the movie) is to be lobotomized, so the message is\nabout how sometimes drugs and respecting patients doesn't work so let's\ncarve them open? Rather than creating an expertly crafted detective\nstory we instead get an obvious twist (even to those who turned the\nchannel every time the trailer was on) that halts the story. I cared\nabout Teddy's demons, wanted him to get off the island but you can't\nyank the character around into someone else and expect me to still care\nabout him when everything he's been characterized as and experienced\nhas been one big delusion.<br><br>It was still an okay film... just apparently not my style of film.\n"},
{"review": "\nThe best thing you can say about this film is that it was true to the\nbook--overwrought, predictable and talky. The second best thing you can\nsay is that DiCaprio never dogs it, no matter what stupid mess he shows\nup in--Gangs of New York, anybody? And now this. He always comes to\nfight. The previews really made things look exciting, but ten minutes\ninto the movie and anyone could see where it was leading. DiCaprio\nlooked twitchy and unreliable from the start, and Ruffalo's snide tone\nwhen addressing him was a dead giveaway. So once again, we have the\ndeluded murderer who constructs another life because he can't live with\nwhat he's done--and a whole bunch of histrionics. Plus rats! And Nazis!\nThis is the kind of thing that Alfred Hitchcock and Norman Lloyd would\nhave knocked out in 26 minutes.--In fact, I believe they did. It was\ncalled 'Premonition' and starred John Forsythe. Look it up.\n"},
{"review": "\nI really wish I knew who to ask to get my money back from. This was the\nbiggest waste of time, red vines, popcorn, and human effort. If you\nwait until this movie comes out on cable you will still be upset that\nyou wasted your time watching it. My girlfriend got angry at me for\ntaking her to this awful movie. She was in such a bad mood after we saw\nthis terrible film that we had no sex. It didn't matter though because\nmy sex drive has been killed by looking at dead babies floating in a\nlake, holocaust victims, and bad acting. I have never seen an entire\ncrowd of people exiting a theater more bummed out. If you are thinking\nof going to see this movie, take some money out of your wallet and\nthrow it in the street. It will be more satisfying and take less time.\n"},
{"review": "\nWhile investigating the disappearance of a murderess from a hospital\nfor the criminally insane, US Marshal Teddy Daniels (Leonardo DiCaprio)\ncomes to suspect the staff of using the prisoners for medical\nexperiments.<br><br>Halfway through Martin Scorsese's Shutter Island and two possibilities\ncrossed my mind: the first and most disconcerting was that the film\nwould be a totally incomprehensible piece of self-indulgent\nsurrealistic nonsense; my other concern was that, after two and half\nhours, it might finish with a supposedly clever but actually rather\ntrite explanation for the events that had occurred\u0097like the main\ncharacter being one of the institute's patients, for example. But this\nis Scorsese, I reasoned, he surely wouldn't pull a Lynch or a Nolan on\nme.<br><br>Think again, Brett\u0085 <br><br>After much confusion, Scorsese does indeed wrap up matters by revealing\nthat Leonardo DiCaprio's character is a few sandwiches short of a\npicnic, having lost his marbles after shooting his wife for drowning\ntheir three children. It's far from the most unpredictable of twists,\nbut\u0097and this is a BIG 'but'\u0097Scorsese's masterful direction (there's\ncreepy atmosphere in abundance) and a strong central performance from\nDiCaprio ensure that the film is still a reasonably entertaining ride\ndespite the frustratingly foreseeable denouement.\n"},
{"review": "\nShutter Island is one of the most intriguing film , which I have ever\nseen. When I started to watch it, I thought that is not interesting\nfilm at all because I don't like detective stories about policeman. But\nit amazed me at all .<br><br>This film is based on the novel of the same name by Dennis Lehane . It\nis take place in the mid-1950s where a main character, Teddy Deniels\nand his partner Chuck Aule, are sent to an island where there is a\nsecurity prison for patients with some methods health disorders and\nmany of them are so dangerous for other people. The plot is very\nunusual and unpredictable . You want to watch it and to see what\nhappens at the end of this story.<br><br>This horror film with tons of atmosphere to music ,directions and set\nto a wonderfully story.<br><br>I believe that the main idea of the plot is to find your demons inside\nyour own island in your head. Not only Teddy doing it.<br><br>As for actors, in this film you can see Leonardo DiCaprio who plays\nTeddy Deniels (main character). He gave one of the best performances\nhero and showed a man who has their own «demons» and many strange\nthings inside him. He tried to solve the mystery of the island and this\nsituation was really important for him. I'd recommend this film for\npeople who like detective and mysterious stories with unpredictable\nending.\n"},
{"review": "\nThis is my first film directed by Martin Scorsese. And I am amazed at\nthe script, the actors play, storyline. Undoubtedly, this is one of the\nbest movies I have ever watched. Why I was interested in?<br><br>Firstly, it is the atmosphere of the film. 1954. Many people watch\nfilms like this because they want to plunge into the atmosphere of\nantiquity. So, the spirit of antiquity is shown dynamically. Since the\nbeginning of the film the contrast between the island and the outside\nworld emphasize very clearly. And when the story starts to develop in a\nbad condition for Marshall, you begin to understand the hopelessness of\nthe situation - and this ending seems really confusing and intriguing.<br><br>Secondly, it is an actor's game. DiCaprio. And that's all. Wonderful\nplay, emotions, story comprehension. Mark Ruffalo is able to create a\nperfect image of partner. I especially want to mention the scene in the\nroom when Rachel called her husband Marshall.<br><br>Thirdly, it is a plot. In my opinion, the further the film, the more\npuzzles which keep us in the entire movie screen. And all of the\nsolution - at the end, though all at once. The plot is the most\nimportant. That's why you must to see the movie. You never know what it\nwill end.<br><br>Fourth, this is the place. The island with all its old buildings is\nperfectly suited to the scenario. Weather, fortress, mysterious\nhundreds of rats, ominous cliff ferry with shackles and horror picture,\nlighthouse are created for the brilliant creations Scorsese. I was\nsurprised by the memories of the main hero. Camp Dachau, wind, dead\nbodies, burning by hate DiCaprio or the burning house with his wife.\nEverything is shown to stop the viewer's heart. I recommend this film.\n"},
{"review": "\nShutter Island. I'm going to tell about this interesting film and\nexpress own feelings. First of all, a plot of the picture is so\nthrilled then you feel some fear from beginning to the end. Mystical\nhospital on the island has many puzzles and you begin to ask different\nquestions yourselves. Then, play of the main character is so real and\nhis searching for mystical truth excites all the time. I think that the\nmain part of a good film for people is their interest in it. And you\ncan't fall asleep after watching a Shatter Island. Illness or\nconviction? When I saw it once, I believed that we have a deal with an\nillness weirdo because strange lighthouse prove a simple one without\nany secrets, and awful experiments like he earlier imaged are not\nexist. However for the second watching, I understood that he is\nconvinced. Secret pills, cigarettes, woman's note \"run out\" and a\nfascinating logic intellect can't belong to a crazy man. May be...\nWell, I was surprised after culmination. Who could imagine the end like\nthis? I think none of us. We amazed by this plot, idea and then we\nbegin to adore this film. This is an achievement of a director and\nfantasy which reflect interesting motions in Teddy's head. The secret\nof successful film- surprise, shock and our wish to see it one more\ntime exactly with the same actors. People want to find some new, fresh\nand unusual belong boring and not good movies. And if you a person like\nthis, you need watch Shutter Island. In conclusion, I'd want to say\nthat we must watch films like one in order to being surprised and\nexited about opportunities of our mind. We must have wide open eyes on\nour usual world:)\n"},
{"review": "\nWhatever this movie is about, other than completely confusing the\nviewer, I fail to see it...this has to be about the most convoluted\nmess from Hollywood yet...and I don't buy the introspective \"meaning\"\nthis movie is supposed to portray for 2 seconds...its just a jumbled\nmess of non sequitur scenes all pasted together, with misleading red\nherrings to help confuse it even further...what is the ulterior motive\nof this jumbled mess?...nothing...there is no meaning\nwhatsoever...apparently we are introduced into the mind of a killer\ntrying to escape reality, during which we as viewers are also expected\nto go insane...no thanks...I will hold on to my sanity if you don't\nmind...it's the only thing that allows me to recognize farce and\ndistinguish it from quality, which this movie lacks completely...nice\ntry though\n"},
{"review": "\nI thought this film was fantastic, i wouldn't call it scary or easily\nfrightening, I would call it a mystery thriller masterpiece. As usual\nwith Leonardo DiCapro, he was always excellent at playing the right\nroles. Gee, he had to play two characters - Ted and Andrew which could\nmake you confused to which one is he really acting as. That must be\nreally challenging but i say Leonardo is well able to do any role at\nthe same time!<br><br>I liked the fact this was based on a mental asylum on an island because\nit just gives you the curious feeling of what will happen next. You\nreally don't to skip a minute or two to not see the full movie since\nyou just gotta find out what really is going on. Although be warned,\nyou will just get one jump-scare. Its the scene where Andrew shot his\nwife after she killed their three children and you wouldn't have\nexpected it since it was so fast!<br><br>This is a really great masterpiece of DiCapro's work, I give this movie\n9/10 :)\n"},
{"review": "\nFor me, this is a rare miss for Scorsese. It's not necessarily bad,\nit's just really not good. The performances are all strong, as these\nare heavyweight actors, and they're what saved it for me. The directing\nis good but at times too heavy handed for a mystery thriller, big twist\ntype of movie.<br><br>Without giving anything away, if you haven't figured this movie out in\nthe first half hour (and that's generous) then you're not paying\nattention. Scorsese uses too many \"tricks\" too often too quickly and\nshows you the \"twist\"(if you can call it that) way too early. And the\nridiculous looking green screen shots are just awful.<br><br>While I have the utmost respect for Scorsese and his work, this one\njust feels , to me, like Scorsese trying to do a Shyamalan movie.\nAverage at best. I know I would not anticipate watching another\nScorsese mystery thriller.\n"},
{"review": "\nFascinating tale and terrific performances, but you might want to watch\nit with captions on and sound off, or at least down very low. The\npieces chosen are appropriate to the film, but often cut in\noverweeningly in moments when silence could have been far more\npowerful, and the score is altogether much, MUCH too loud throughout,\nright from the beginning.<br><br>In the first few minutes, I wasn't sure I'd be able to watch it at all,\ndue to the assault on my ears. In several places, the music buries\nspeech! I don't know what Robertson was thinking, or why no one else\nfixed it in post-production. He's a great musician, but please, let him\nnever score a film again. It's particularly a shame since the music\nitself is quite beautiful.<br><br>I'm glad I stuck it out, as the film as a whole is marvelously complex,\nmulti-layered, moving, and, in addition to the spectacular acting,\nbeautifully composed and shot visually. But that overbearing, painfully\nloud soundtrack... well, you've been warned!<br><br>Definitely watch it anyway, but I'm not kidding about considering\ncaptions.\n"},
{"review": "\nOpening with some rather amateur special effects to create a ferry trip\nwas an unusually, off-putting experience, especially from the likes of\nScorsese. But as 'Shutter Island' progressed, I was soon immersed into\nthe mystery of the missing suspect. <br><br>Leonardo Dicaprio played an engrossing detective with an unbridled\ndrive and determination that often clouded his judgement, but with the\nreluctance of Mark Ruffalo was kept sensible. <br><br>The first half never dragged as it introduced new and interesting\ncharacters that added to the curiosity of the island which was also\nhelped with typically Gothic set design. <br><br>Unfortunately the second half became slow and confusing with an\nunambitious push towards the disappointing and predictable ending. <br><br>I would have preferred to watch the first half of the film, stopped it\nand left the ending as a mystery for my imagination.\n"},
{"review": "\nI love the combination Scorcese and DiCaprio. It's like Depp and\nBurton; somehow it's a magical combination. They put together a\nbrilliant thriller at the first sight. Two cops go to an island to\ninvestigate a break-out.<br><br>As the story continues with riddles of which you know you'll get the\nclue somewhere at the end of the movie, you already know Kingsley is\nbehind the whole thing. There is something about Kingsley you know as a\nviewer you can't trust.<br><br>The SS past of DiCaprio is almost well done. I like the fact Scorcese\nmade this aspect a part of the movie, even with Kingsley in it who made\nhis movie about Anne Frank's history. But when there is a line up and\npeople are getting shot, they are shot all together at the same time\nbut they drop on the floor at the time the camera is shooting them.<br><br>The movie is exciting until the end. The end, where the plot\ndrastically and originally changes, is wonderful. But then I got the\nfeeling this movie had some flavor of the movie \"a beautiful mind\". As\nsudden this uniqueness changed into unoriginal.<br><br>The very last ending of the movie was not happy, but very suitable.\n"},
{"review": "\nOK, the atmosphere here was good. I like the idea of a spooky island\nwith a mental institution on it. I also liked the 1950's motif. The\npairing of Dicaprio and Rufalo was also fresh.<br><br>But frankly, I've had one too many intense Leo/Scorcese movies with Leo\nfaking some hard-boiled east coast accent and getting into a lot of\narguments. Give it a rest. Everyone played themselves. Ben Kingsley,\nMark Rufalo. Which is fine sometimes, but not much of a challenge.<br><br>This thing went on forever. There are multiple scenes of bloody dead\nchildren and grotesquely mutilated adults. It flirts with some left\nwing propaganda about anti-Communist witch hunts or brainwashing, and\ndabbles in \"America is just as sinister as other countries\" narrative.<br><br>Why not? The book writer and the movie people involved are probably\nLeftists. I'll give it some credit for a few good lines here and there,\ngood acting by some of the bit players, and great atmosphere.<br><br>But I don't recommend watching this thing in one sitting. You'll be\nlooking at your watch. I like the first half set-up, but like most\nfilms, it fell apart in the second half. Scorcese is so overrated.\n"},
{"review": "\n'Shutter Island' is a Martin Scorsese film about a federal officer,\nplayed by Leonardo DiCaprio, who visits a high-security hospital for\nthe criminally insane, and this facility is located on a remote island.\nThis setting immediately establishes a feeling of bleakness, isolation\nand dystopia, which amplifies greatly as 'Shutter Island' progresses. I\nthink that Scorsese's maintenance of the grim atmosphere is one of the\nstrongest qualities of the film, but this hard exterior belies the\nhollow psychology of 'Shutter Island'. The dark exploration of the mind\ndoesn't hold a candle to 'Taxi Driver', nor do the twists live up to\n'The Departed'. I felt as though the portrayal of insanity in 'Shutter\nIsland' was a little too cartoonlike, seeming to resemble something\nyou'd find in Gotham City. This discredits the film, in my opinion, and\nmakes 'Shutter Island' feel very hollow and superficial at times. There\nare one or two satisfying twists throughout the film, but I don't think\nthat they sufficiently compensate for the tedium of the first half.\nDiCaprio's objectives in the film seem ambiguous at times, and,\ncombined with the barrage of flashbacks and hallucinations, 'Shutter\nIsland' often feels like a video game played inattentively. The film\nisn't a disaster, though, as the editing is very enjoyable at times,\nand Scorsese's creation of the cold, dystopian landscape has to be\ncommended. I just wish that this film was a little more 'One Flew Over\nthe Cuckoo's Nest' or 'The Silence of the Lambs', and a little less\n'Batman: Arkham Asylum'.\n"},
{"review": "\nThe first half of this movie is a fantasy, which gets solved in the\nsecond half by old-fashioned psychological here's-what-really-happened.<br><br>The lead looks too fresh to carry off the tragic role, and some of his\ndelivery of the cartoonish lines is really poor (although may not be\nhis fault). The fantasy part is half-baked with some clumsy clues, and\nthen we get memories of the holocaust to illuminate the hero's past.\nWas that really necessary? I was thinking Jacob's Ladder, but I didn't\nlike that either and it was a better movie than this.<br><br>The figuring-out part is like an '80s Hercules Poirot episode - neither\nscary nor emotive, just flipping over the cards as it suits the dealer.\nOn top of his holocaust experience, the hero also had a mad homicidal\nwife. Bloody hell! The final flashback is awkward, and there's no\neffort to make us hurt for the children. The ending is ... \"led off in\nhandcuffs\". Duh duh duuuuh! <br><br>Way too elaborate for a simple story.\n"},
{"review": "\nThe world would be stupid if this movie is to be considered a very good\npsychological thriller/ twister. Come on, there are so many better\nones.<br><br>Let's compare this with Tarantino's Inglorious Basterds (about the same\ntime), though not exactly categorized as a psychological thriller but\nsimilar to Shutter Island, relies heavily on the suspense/twist factor\nto win the crowd. Inglorious Basterds was successful in that regard, as\nI was not able to predict the next outcome because the sequence of\nevents happened in an almost random manner; even if someone can predict\nit, he would find it difficult to catch up to the quick pace of the\nmovie.<br><br>Shutter Island, regrettably, gave off TOO MANY HINTS from the very\nbeginning. I, at the very least, already foresee the truth during the\n1st quarter of the movie. I know this is based on a novel, but Shutter\nIsland's ending lacks the kick that Inglorious Basterds had, probably\nbecause the desired effect is sure to be tuned down once you figured\nout what was going on. <br><br>If i were to edit this movie, I could easily remove certain 'spoiler\nelements', like firing Michelle Williams for example, and Shutter\nisland would be a whole lot better. Fortunately, the abundant amount of\ntwists (thanks to the convenient use of hallucinations) kept me\nwatching even when I already knew what is going to happen.\n"},
{"review": "\nI'm usually not very good at predicting twist endings, but even I could\nsee this one coming from a mile away. I mean, when Teddy keeps seeing\nvisions of a dead woman, and we are told there is a missing patient, it\ndoesn't take much to put two and two together.<br><br>The gist of the film is 2 federal marshals go to Shutter Island to\ninvestigate the disappearance of a patient from a mental asylum. The\nboss, Teddy, asks a lot of questions, but doesn't get a lot of answers.\nThe story he is told makes it seem impossible for the patient to have\nvanished from her cell. We soon see things aren't what they seem and\nthere is an even more dangerous patient on the lose.<br><br>FINAL VERDICT: It's OK, but it doesn't take a genius to figure out what\nis going on.\n"},
{"review": "\nYou know, while reading this film's reviews you get to think it's the\nbest 2010 movie. But after really watching, you get disappointed.<br><br>The cast does it's job, the director as well. The suspense is well\ncreated, the atmosphere is tense and it's very intriguing. But the\nconclusion of Shutter Island is similar to the end we've already seen\nin a bunch of other movies, such as \"Identity\", \"The Others\" and \"Never\ntalk to strangers\".<br><br>I strongly wished the writers of this film were a little more daring\nand could have had more creativity to make it more original and\namusing. But it's a good watch anyways.\n"},
{"review": "\nI loved the look of this film, but was aware from the beginning that\n\"our hero\" was not what he seemed, when the water made him sick and he\njust met his \"partner\" on the ferry out to the island. As it went along\nI pretty much knew how the story was gonna go, and was proved right.<br><br>Nevertheless, it was an enjoyable film even if it's been done before\nwith different details. Maybe I read too many books, and watch old\nfilms too much, but I find it surprisingly easy to predict the stories\nof these \" Dolly-wood tries to be clever\" films. <br><br>Lovely cast and still a great watch, cinematography great, but all the\nover the top tension building music in the beginning was intensely\nannoying, even though I understood what they were trying to do.<br><br>I'll watch this film every five years or so, worth buying when it's on\nthe eight dollar shelf.\n"},
{"review": "\nI was very surprised to find this film was either loved or hated by\nmost reviewers. Of course, it tends to be an inherent quality of\npublicly posted comments that people with strong opinions will be the\nones who will bother to post, but still... I thought the film was a\ndecent and well-made one. Predictable - yes. Over the top acting - come\non, it's Marty! Too long - again, Marty. However, I must insist that\nthe predictability of the ending was rather a strength of the film: If\none were to follow the \"conspiracy/detective\" plot through 2 hours,\nit's logical that the ending will disappoint - but that's your problem,\ndear viewer! Not only is the insanity plot much more interesting, the\nfilm becomes much more interesting once you watch it from this premise.\nFor example, the warden who drives Teddy back from the cliffs, who\nisn't buying into the doctors' tactics and gives him the \"you're\ndangerous and violent\" comments: great scene, but merely weird if you\nhaven't suspected the context. Flaws: The score was horrible. Horrible.\nDestroyed many scenes, and I'm so glad Marty toned it down toward the\nend. The dead children scenes were redundant and extremely overused;\nthen again, Marty always does that with his favorite \"symbols\": rubbing\nit in, again and again. Some of the dialogue could have been much\nbetter written, but it's a mainstream movie after all. One last note on\nthe history of psychiatry: the struggle between psychosurgery and\nmodern psychiatry devoted to the phenomenology of the patient's\nnarrative - that is a true fact, and it did begin in the fifties.\nFurthermore, going along with a patient's delusion at crtain points of\nthe therapeutic process: I'm appalled that many reviewers found this so\nabsurd. I'm a psychiatrist and it's my line of work. Granted, the film\nis an exaggerated version of that, but it's fiction after all.\n"},
{"review": "\nThis film started off well and I really did expect big things. I had no\nidea what the film was about but I just went for it. The plot seemed\ngood, the 'case' Teddy Daniels was set out to solve seemed like an\ninteresting storyline and I thought it would be great. The first half\nhour or so was good and seemed real, but when the twist came it just\ngot silly and boring, it took so long to get the point across which we\nall knew was coming. This twist ruined the film for me although if I\nhad read about the film I would have expected this.<br><br>Overall it started it off well but then made me lose interest. The set\nlooked great and Leonardo DiCaprio was brilliant but the film just\nwasn't for me.<br><br>5/10\n"},
{"review": "\nI give this four stars because hey, the performances were well done and\nthe cinematography was just lovely, I'm sure most fans of the film can\nagree on that.<br><br>Unfortunately, it was otherwise very disappointing. I read so many rave\nreviews and everybody told me that I had to see this movie, the ending\nwas wild and I'd never ever guess what it was and all that. Sadly,\nwithin the first five minutes I realized it was just an updated version\nof The Cabinet of Dr. Caligari, announced that DiCaprio was insane and\nall that, and infuriated my friends.<br><br>I do understand and respect why many people adore Shutter Island. My\nopinion may be different because I saw Caligari first or it may be\nbecause I'm a fan of silent films, but whatever the reason, I find the\noriginal more exciting to view.\n"},
{"review": "\nIn all honesty I have to say this is probably the best thriller this\nyear at least as far as my opinion goes.It kept me guessing throughout\nand I was left spellbound simply because of the way the story was\ntold.Scorsese just goes on to show us why he is the best at what he\ndoes and his diverse talent in filmmaking.<br><br>Di Caprio delivers a flawless performance and I felt Ruffalo really\nimpressed me as an actor in a while.This movie is stunning not only for\nthe above reasons but also visually brilliant.After a long time I got\ngoosebumps not once but multiple times during a movie.This has got\ngreat rewatch value and it was worth watching every second of it.\n"},
{"review": "\nI watched this movie a couple of months ago and am still baffled by it.\nI had a preconceived notion that it was another horror because of the\ntrailers for it. Leonardo Dicaprio's performance is outstanding from\nstart to finish. His portrayed his character with such immense emotion\nand skill. At the start of the movie you believe that you know the way\nit will end. This could not be further from the truth! The storyline\nwas gripping, controversial and had my attention from start to finish.\nYou will either hate or love the ending as it is not expected. I\npersonally loved it and it was a jaw dropping moment. I highly\nrecommend this movie to all types of people. A must see!\n"},
{"review": "\nI had been wanting to watch this film for a while and when I finally\ngot round to doing so it did not disappoint. Leonardo DiCaprio was\nperfect in the role of the marshal Teddy Daniels and he really brought\nthe whole film to life with his performance. Mark Ruffalo was also\nmemorable for his portrayal of the supporting character and their\nrelationship was a crucial part of the story so it was important that\nthey both played their parts convincingly. <br><br>What I loved about this film was the whole psychological aspect of it\nwhich makes it extremely gripping. It's the type of film which\nconstantly makes you wonder who is telling the truth and it pushes the\nviewers to try and figure out what is really going on. As the film\nprogresses and reaches the final stage there are more and more twists\nrevealed. Even after having seen the big revelation at the end of the\nfilm I still know I could watch this film again in the future as it\nwould be interesting to view taking into account the truth at the end. <br><br>Even though this film is over 2 hours long it certainly didn't feel\nlike it and the thrilling scenes and build up of suspension throughout\nmade it go so quickly. This film is definitely worth a watch and some\npeople may have mistaken it for a horror from some parts of the trailer\nbut it was simply a good psychological thriller.\n"},
{"review": "\n*This review may also spoil the Sixth Sense*<br><br>The main problem with this movie for me was that it was very\npredictable that there would be a twist. When Leonardo Dicaprio's\ncharacter finds out that Shutter Island may be grounds for illegal\nexperimentation, it is painfully obvious that there is going to be a\ntwist since there are still a lot of mysteries. Therefore, there is\nvery little believability to the notion that Shutter Island is carrying\nout such operations and very little tension. While watching I though of\na couple of theories for what the twist might be (thats how sure I was\nof the twist). Of course it was the least original one that I thought\nof: Ted Daniels is an actual patient on the island. While that ending\nis so \"out there,\" I also feel like I've seen it a thousand times.\nScorcese builds the entire movie around this twist, which is a disaster\nbecause the twist is expected and unoriginal. <br><br>A similar movie with a twist, the Sixth Sense, is so much better than\nthis one because it explores a very interesting conflict, but is not so\nmysterious which makes the viewer unsuspecting of any twists. The\ndownfall to Shutter Island was Scorcese overdoing the mystery aspect. I\nwould give this movie a 4, but I feel that this movie has inflated\nratings because no one wants to admit that such a great director\ndisappointed (that's not to say everyone's rating is inflated, but it\nmakes sense to assume that such inflation exists when this painfully\npredictable movie has an 8.1.)\n"},
{"review": "\nFlamboyantly silly and long-winded psychothriller/psychodrama that\ntries hard to say relevant things about mental conditions, memory and\ntrauma, but in fact is nothing more than pulp without the necessary\nentertainment factor.<br><br>Scorsese's lamentable attempt to inject his (admittedly gorgeous)\nvisuals with an unnerving quality falls flat, while DiCaprio has always\nbeen the least successful in striking puzzled and worried poses.<br><br>In the end, all the narrative twists and impressive set-pieces prove to\nbe ineffective due to the lack of sympathy towards the wooden\ncharacters.<br><br>And about that ambiguous story-line: It doesn't matter which version is\ntrue, both are ridiculous.<br><br>4 out of 10 mental breakdowns\n"},
{"review": "\nFrom about 30mins in you realise this will be one of those films that\nhas \"a twist\". Unfortunately the twist is boring and dull.<br><br>This film is a total waste of time. The acting might be good. bu the\nconstant \"Jaws\" music gets rather annoying. As does the overplay on the\nobvious issues the main character has.The film tries to clever and\nmysterious, it ends up muddled and lost. It is trying to be high brow,\nbut really it is pointless. There are a few good moments, but on the\nwhole I wouldn't waste my time and watch it. I am also astonished at\nthe good reviews.<br><br>Don't bother with it, it really is a waste of time.\n"},
{"review": "\nQuestion: which stayed longer in your neighborhood movie theatre,\nShutter Island, or the half-empty popcorn container you left on the\nfloor by your seat? <br><br>Let's start with the beginning of Shutter Island: two U.S. Marshals\n(DiCaprio and Ruffalo) head to shutter island, a prison for the\ncriminally insane, to find an escaped patient. Hey, Ms. Kalogridis, why\ndo you need two US Marshals to find an escaped prisoner on an island\nwhere there is no way on or off except by ferry? And the prison has\ncontrol of the ferry? This is your setup? You're joking, right? <br><br>Ms. Kalogridis is not joking. She's dead serious. She thinks we're\ngoing to park our brains at the door and dig into her blunder. Are\npeople that simple? <br><br>Come on, movie-goers, let's get real. Shutter Island is an insult to\nthe intelligence of the viewer from beginning to end. Just because\nMartin Scorsese turned a blind eye to a poorly written, convoluted\nscript with an ending that doesn't deliver, doesn't mean we should be\nlemmings and follow him off the cliff. Sorry, Marty, all that mood and\ndreariness and fog may set the tone and theme of the movie, but without\na polished script, Shutter Island is a poor collaboration between\ndirector and screenwriter.<br><br>And do not confuse Shutter Island's ending with The Sixth Sense's\nending. The Sixth Sense has an ending that delivers and works.\nWriter/director M. Night Shyamalan went back and proved to us that we\nsaw what we wanted to see. Shyamalan didn't fool us. We fooled\nourselves.<br><br>Kalogridis, on the other hand, serves up a gimmick ending that leaves\nus deflated and unfulfilled.<br><br>Shutter Island needed someone who understands adaptation. Clearly, Ms.\nKalogridis does not. Sometimes adaptation means tossing away most of\nthe story and creating a new original. There's nothing that says you\ncan't use your imagination. Too bad Marty didn't encourage Kalogridis\nto use hers.\n"},
{"review": "\nSeldom have I seen a movie so poorly filmed,acted,( except\nMortimer,Kingsley,Von sydow) or directed. If I didn't know better I\nwould say Scorcese has a teen crush on dicaprio allowing him to be in\nhis films. I even tried to view it as a comedy but couldn't make it\nwork even as that.Come on Scorcese go back to your roots and make a\nreal film again. Forget the pretty glam boys,they will only make you\nhate yourself in the morning. The only way this film works is for the\nardent teenyboppers who would love DiCaprio in a highschool play.Please\nHollywood- spend less on the actors and more on the script.Please\npatrons-spend your money elsewhere and send a badly needed message to\nHollywood.\n"},
{"review": "\nI went to this movie expecting something intelligent and stylishly\nexecuted. I left feeling underwhelmed and disappointed. The story has\nbeen done before, so its not clever anymore and i'm not being arrogant\nwhen i say it was obvious from the start. Its edited very amateurishly\n(I don't agree with those saying it was representative of the main\ncharacters frame of mind) and there is far too much use of CGI on\noutside scenes in cars and both. It seemed to me as well that there\nwere some scenes just thrown into the movie that had no actual purpose.\ne.g the scene in the car with the warden talking about violent. maybe\nit was too intelligent for me...\n"},
{"review": "\nI have no idea how this gets such a high rating, but this movie is\nterrible. Very unrealistic and full of flaws. I would not waste my $ on\nthis one. I would rather keep this short but I have to keep writing in\norder for this to be posted. If you have nothing better to do with you\ntime, and like Leonardo Decaprio, then you may have to watch but have\nsomething else to do while it is on.Not sure what else one can say\nabout this, in order to comply with this sights policy, when a movie is\nbad, its just bad. it goes off in all different direction, not making\nmuch sense. I watch all kind of movies and this one will be on the top\nof my least liked.\n"},
{"review": "\nI really love the movies, but i had to leave this movie before it was\nfinished. It's only the 2nd time i did that. How does Mr. Scorsese dare\nto use images of a concentration camp in his movie like this? In a way\nfor shock effect? It's indecent and immoral. The film hangs to each\nother by cinematographic cliché's; dripping water, people who are\ncasted because they look so scary, it looked like a cheap horror movie.\nAlso the story it selves feels like one big cliché, full with\nunbelievable turns. Also the score was irritating me from the\nbeginning, too much present, while there was no occasion for it. I\nhoped for a well made film, sound, like Scorsese should be able to\nmake, but it was one big disappointment. Yesterday i saw Crazy Love,\nthe contrasts between these 2 movies couldn't be bigger. I hope next\ntime: better time!\n"},
{"review": "\nI don't want to be cast asunder for words of heresy but is Martin\nScorsese losing it? I only ask because Shutter Island is a load of old\nclaptrap. The reviews I've read seem to be unable to make their minds\nup about it and IMDb seems to have lost its marbles a little by\nawarding it 8.1 and a place in the coveted all time Top 250. Surely not\nfor long when common sense kicks in and people review it for what it\nis. A mess.<br><br>The movie really is a tram smash of ideas, styles and plotting. There's\na neat twist in it but the utterly gratuitous Dachau strand to the\nmovie is verging on the disgraceful. Parts of the film, certainly in\nthe first half flashback to Di Capprio's experiences as an American GI\nliberating the Dachau concentration camp would be, you'd have thought,\ncentral to the plot. Not a bit of it. This strand hangs about\nmeaningfully but without meaning. But that's the issue with this whole\nmovie. It seems to want to inject meaning into a genre that really is\njust about entertainment. In doing so it lifts ideas from The Shining\n(some brilliantly), Silence of the Lambs (unconvincingly) and Hitchcock\n(at his worst) but they go nowhere. The cinematography flits about from\nthe stunning, the scene in which DiCapprio and his young bride embrace\nduring a fire is mesmerising, to the laughable - again DiCapprio is\nfeatured driving through a forest as a passenger with the Asylum's head\nwarder in front of a blue-screened background that could have been shot\nin 1954 (the year the movie is set) - I suspect the latter was\ndeliberate. If so it was another misguided idea.<br><br>The grading leaps about from 21st century hi-def to 1950's colour-noir\nand can't seem to decide what it is that it wants to be.<br><br>Dicapprio is unconvincing, so too Rufallo and Sir Ben Kingsley? Well,\nhe is actually lampooning himself. Awful, truly awful.<br><br>Do not waste your money on this rubbish.<br><br>4 out of 10\n"},
{"review": "\nOkay, This movie sucks so much that I had to walk out of the room.\nHORRIBLE MOVIE! I can't believe there are people who watch this super\nboring movie.<br><br>This movie is worser than the Lovely Bones. OMG. I thought the Lovely\nBones movie SUCKED but this one SUCKED everything!!!!<br><br>I wouldn't go to this movie again if you paid me $ 1 million.<br><br>omg, it was super boring and nothing interesting.<br><br>Movie was filmed in total darkest and ugly lighting.<br><br>Don't go this movie.<br><br>If you want to waste your money on this sucky movie then fine.<br><br>you've been warned<br><br>suckiest movie ever\n"},
{"review": "\nGrowing up I used to see Scorsese as magic. And he is only a director\nwho had the chance, and maybe some inspiration, to choose the box\noffice hits from all the projects he received. In the case of Shutter\nIsland, is the script that does the magic. Scorsese just directs people\naccording to the given script. DiCaprio? Well, it would have been much\nbetter if he could act. But, as usual, Leo DiCaprio only moves around\nthe set with a blank expression. Like any puppet he moves around, she\ncan open the mouth and tell the lines and that is about it. Actually,\nthanks to the demigod director, most actors are in the same state and\nunless for the realism, one might think this is an animation project.\nMax von Sydow is the only one acting, but that is maybe because he is\ntoo old to be directed by the mighty Scorsese. And the role is small.<br><br>It is also interesting to see the transformation of Scorsese in the\nlight of his exposure to the Asian film makers. He is trying color\nfilters and enhancers. It would have been nice to have these variations\nback in the days of Goodfellas. Still, it is only an experiment and it\nlooks like one as the color variations are cute, but add nothing to the\nstory itself.<br><br>So I have enjoyed the script and not much else.\n"},
{"review": "\nMartin Scorsese and Leonardo DiCaprio continue their collaboration,\nafter working together on Gangs of New York, The Aviator and The\nDeparted (all three of which were excellent movies). Add in writer\nDennis Lehane (Mystic River) and the acting talents of Ben Kingsley and\nMark Ruffalo and it should equal a good movie.<br><br>Well, kinda. The acting is perfect and the direction spot-on. However,\nthe plot is over-convoluted and filled with so many twists your head\nwill spin.<br><br>I walked away liking the movie, but thinking it could have been a whole\nlot better.\n"},
{"review": "\nThis little gem was worth an immediate Second Viewing, just to pick up\non all of the \"little things\" that I missed the first time.<br><br>It's easy to just throw around the name \"Martin Scorsese\", and assume\nthat the movie is going to be good. But the truth is that...\nsometimes... Scorsese is absolutely brilliant.<br><br>I haven't read the novel upon which this film is based, so all of my\ncomments are based upon Scorsese's interpretation... not the novel, the\nFilm.<br><br>The beauty of \"Shutter Island\" is that there really is no resolution at\nthe end of the film. Was that really a guy deluding himself, trying to\nescape from the horrors of his own life, or was he still trapped inside\nof a drug-induced hallucination? Nobody knows.<br><br>He obviously knew, at the very end of the film, that by speaking to his\n\"partner?\", he was basically telling everyone that he had not been\n\"cured.\" Was that a \"request\" to be lobotomized, so that he would never\nhave to remember the horrors of his life again, or was it an acceptance\nof the fact that he would never escape from the island? Everyone\nassumes the former, but Scorsese leaves the question open.\n"},
{"review": "\nI LOVED this movie.<br><br>I adore everything about this film. I am in love with the actors, I\ncan't think of a better combination than Mark and Leonardo together.\nThe acting was great, and so was the story and how it developed. <br><br>The story really intrigued me and I was curious how all the pieces\nwould fall together. It's something that messes with your brain. You're\ntrying to find aN explanation and to put the pieces together, but at\nthe end, you're just wrong. <br><br>For the people who read books; I can say that looking to this movie is\nkinda like reading a book and wanting to finish it in one night. You\njust want to know what happens next, what is the explanation and how\nwill it end? <br><br>Perfect, just perfect.\n"},
{"review": "\nMartin Scorsese's \"Shutter Island\" is based on the best-selling novel\nof the same name by Dennis Lehane, author of \"Mystic River\" and \"Gone,\nBaby, Gone\", among others. The story revolves around a missing persons\ncase at an isolated hospital for the criminally insane circa 1954.<br><br>Leonardo DiCaprio plays Teddy Daniels, a U.S. Marshall sent to\ninvestigate the disappearance. However, he has already formulated his\nown hypothesis about the incident, one that involves secret government\ntesting. The clues steadily accumulate, often creating more questions\nthan answers, all the while ratcheting up the tension until we reach\nthe final, climactic revelation.<br><br>DiCaprio does a good job of carrying the film in what develops into a\nchallenging, multi-faceted role. He is given strong support from the\nlikes of Mark Ruffalo, Ben Kingsley and Michelle Williams among several\nother notables in smaller roles. All in all, a talented ensemble cast.<br><br>Scorsese's direction is as sharp as ever and he creates a number of\nmemorable scenes. Frequent collaborator Robbie Robertson (of The Band\nfame) supervised the music, selecting existing pieces, some of which\nare quite striking. Multiple Oscar winners Dante Ferretti (production\ndesign) &amp; Robert Richardson (cinematography) were also key contributors\nto the movie's atmosphere &amp; authenticity.<br><br>Having watched \"Shutter Island\" a couple of times now I feel that I\nhave a better appreciation of the film's intricacies. Subtle touches\nthat went unnoticed the first time around now take on new meanings with\nforeknowledge of the mystery's resolution. I have to admit that I was\nslightly disappointed by the story's conclusion on my initial viewing\nbut the fact that the movie stands up to repeated viewings is a\ntestament to the quality of its construction. Ultimately, \"Shutter\nIsland\" certainly deserves to be seen once but I feel that a second\nviewing is key to experiencing everything that the movie has to offer.\n"},
{"review": "\nThis film will twist your mind. It may be a movie that's \"messed up,\"\nbut its the good kind of \"messed up.\" Films that make you think and\ntruly feel the thrill of not knowing which way the characters and/or\nstory will head, are the sorts that are written and directed\nbeautifully. DiCaprio and Ruffalo do an amazing job. Like in most their\nmovies, you feel the characters and go on a literal and mental journey\nwith them. This is a film that may at times appear slow if you do not\nget into it. You must be paying attention to detail and attempting to\nunderstand all the characters are trying to tell you. The thrill and\nmystery will keep you on the edge of your seat, intrigued to grasp the\nfull understand of the mystery the movie hides from you.\n"},
{"review": "\nIt's always a delight to see directors have a variety of genres in\ntheir careers that's one of the reasons a love Shutter Island so much\nit's something completely different from Scorsese. The editing and\ndirecting in this movie is fantastic Scorsese keeps the suspense and\ntension he was able to achieve with The Departed and uses it even\nbetter here adding a lot of mystery leaving the viewer guessing to the\nvery last second. This became apparent in the dream sequences as they\ncould have come across as pretentious and melodramatic but they fit in\nperfectly.This is definitely a movie that's best experienced knowing as\nlittle as possible because this first and foremost is an investigation\nmovie and you want to be able to experience that investigation with the\ncharacters. Leonardo DiCaprio returns for his fourth collaboration with\nMartin Scorsese and he is fantastic in this movie not only is he a\ncharacter the audience can get behind he is also very complex and makes\nsure DiCaprio can give it everything. Mark Ruffalo was also very good\nin this movie he was likable and subtle. Ben Kingsley isn't in the\nmovie much but he definitely makes the most of that screen time. This\nwas one of the best movies of 2010 and Scorsese' most underrated movie.\n96% from me would absolutely recommend this movie.\n"},
{"review": "\nOne of the best Movies by Martin Scorsese. If you are looking to\nmind-blow yourself this is definitely movie for you. Keep attention to\ndetails and you will be highly satisfied. I recommend watching this\nmovie more than once to realize just how great it is 9/10. Not as\nhorrific as trilling. On my opinion the only think that is scary here\nis the story. Leonardo is on top of the game, and supporting roles are\njust perfectly selected as Ben Kingsley(keep an eye on him) performed\nvery well. Shutter island is very underrated, and it will only get more\nappraisals as time goes by. One of the best movies of new millennium. I\nenjoyed watching it, 138 minutes of constant build up of attention.\n"},
{"review": "\nThis film is pretty much flawless. The legendary combination of Leo and\nScorsese is great again, as expected.<br><br>I watch this film when it first cam out, late review.<br><br>Perfect story, great actors. Leo was exceptional. As a massive Leo fan,\nthis has to be one of his best films, if not his best film.<br><br>The suspense and even horror of this film is on point.<br><br>The set is great, everything is.<br><br>Stighly biased as i'm a Leo and martin fan but this is truly a great\nwork of art.<br><br>One of my favorites!\n"},
{"review": "\n\"Shutter Island\" is another brilliant outing from Martin Scorsese. The\nmonth prior to the release I managed to pick up the original book, and\nwas thoroughly looking forward to what direction the production may\ntake.<br><br>U.S. Marshal Edward \"Teddy\" Daniels (DiCaprio), and his partner Chuck\n(Mark Ruffalo), go to Shutter Island on a ferry boat to the home of\nAshecliffe Hospital for the criminally insane. Investigating the\ndisappearance of a patient Rachel Solando (Emily Mortimer), who has\nescaped the hospital and apparently the island despite being in a\nlocked cell under supervision.<br><br>As far as execution goes, \"Shutter Island\" is adapted to a tee. I now\nget the feeling Leonardo DiCaprio is beginning to pick his performances\nmore carefully. He has always been a solid performer, and this role\ndefinitely gives him more of a chance to use every emotion under the\nsun considering the situation. Also it was very pleasant to finally see\nBen Kingsley in a Scorsese picture, and it's a very interesting choice\nfor the role of Dr. Cawley. But as always, Sir Kingsley delivers solid\nwork.<br><br>The island overall looks like a visually perfect adaption from book to\nscreen. The lack of lighting, weird sound effects and constant dream\nsequences all in all make this very exciting and disturbing thriller\nhighly recommended.<br><br>Final Verdict: A very well crafted movie. It's not the best Scorsese\nhas ever done, but decent nevertheless. 8/10.\n"},
{"review": "\nI expected much better for another Scorsese-DiCaprio collaboration.<br><br>The movie starts out well. I was immediately pulled into what seemed\nlike an interesting story where we'd have a super sleuth investigating\na incident and cracking down antagonists one-by-one. <br><br>Instead it turned into a psychological thriller that reminded me all\ntoo much of other recent psychological thrillers, making it\nrun-of-the-mill. <br><br>I thought the movie took far too long to wrap everything up. This\ncould've been done in an hour and forty minutes time. Many of the long\ndream sequences could've been shortened, they weren't effective anyway,\nand fall short when compared with Bernard Hermann music-backed dream\nsequence of Vertigo (which is what Scorsese was going for).<br><br>I think this movie is overrated, and the director and lead actor\ninvolved have done much more impressive things in their careers, both\nrespectively and together.\n"},
{"review": "\nThis is some kind of future movies.Movie which requires a good\nconcentration because there are a lot of details that you have to see\nto understand a movie better. All that I can say is that movie is\nexcellent.Very interesting theme with good actors and great plot.A\nmovie can be a bit arduous but in the end you see that everything was\nplanned excellent.I also have to say that Leonardo Di Caprio is very\ngood actor for movies like is this.<br><br>Lastly,I just want to recommend this movie for all who like \"serious\"\nand heavy movies in which you have to realize what the point of movie\nis and what did the director try to say.<br><br>I also have opinion that this movie deserves a better position on the\nIMDb top 50 scale that it has now.\n"},
{"review": "\nEven to begin explaining details of the plot and how everything comes\nto fruition causes me to feel migraines alike the ones Teddy gets in\nthe movie, therefore I won't ruin anything for you now. Take my honest\nword that if you enjoyed any Scorsese movie in the past or have enjoyed\nmovies that include surrealism, Shutter Island combines the two into an\nintense thriller that boggles the mind and possibly even \"corrode it,\nrusts it\". Also, if you are hesitant to watch this film because the\ntrailer perceives it as a horror film with a lot of \"jumpy\" scenes,\nignore that. I had the same feeling entering it, and there was only one\ntowards the very end, but it was worth the shock. You will miss so much\ndetail trying to cover your eyes for a few minutes sporadically\nthroughout that it's not worth it. Take the risk of jumping out of your\nseat for once, because it was the best scare I could ask for.\n"},
{"review": "\nTwo cops visit a hospital for the criminally insane to investigate a\ndisappearance.<br><br>Starring Leonardo DiCaprio and Mark Ruffalo.<br><br>Written by Laeta Kalogridis ( Screenplay). Dennis Lehane (Novel).<br><br>Directed by Martin Scorsese.<br><br>This is one of the strangest movies I've ever seen.<br><br>At first I didn't like it at all. I couldn't stand the annoyingly loud\nbackground score and the artyfarty dream sequences. And right from the\nbeginning I couldn't take to Mark Ruffalo's character, there was just\nsomething weird about him and his accent that I couldn't put my finger\non.<br><br>But as the movie goes on it builds up to an amazing and shocking\nclimax. I didn't see it coming although I had a feeling something\nwasn't quite right! Looking back, this one is one hell of a cleverly\nconstructed script and I'm guessing we have the original novel to thank\nfor that. What started out as an annoying movie actually turned out to\nbe really good and I want to watch it all over again to (without\nspoiling anything) see what references I missed.<br><br>I still think it was a bit too artyfarty at times and that background\nmusic was too loud and annoying and there was something about the\ncinematography that I didn't quite like, but overall I think it\nactually worked.<br><br>9/10\n"},
{"review": "\nThis might have Spoilers.<br><br>OK, I like this film. It has good dialogue all the way through, a nice\npace and lots of strange things occur. The mystery keeps building and\nbuilding like a puzzle and I like that. Over all I really like the\nconspiracy idea that Leonardo's character comes up with. This I find\nfascinating as it does tie in with covert operations that the Americans\nwere doing in mental hospitals after WW2 and the mind control\nexperiments of the Nazis and the Korean military in real history and\nI'm a sucker for things like that. Love it. For this reason the plot at\nthe beginning is highly plausible and compelling, such as using humans\nas guinepigs as a part of secret government experiments into trying to\ncontrol their brains with mind altering chemicals etc. The sad thing is\nthat the ending was clichéd and disappointing and left me cheated and\nfeeling unfulfilled. I cannot believe that the whole film amounts to\nthe 'it was all a dream' 'or it was all in his head' a bit like the\ncharacters in The Wizard of Oz or Secret Window or a Beautiful mind. It\nmade the film seem like one big goose chase in the end. There was so\nmuch brilliant effort made into making the viewer believe that\nsomething really serious was going on but- there wasn't!! Compelling\nand mysterious film but bad, bad ending.\n"},
{"review": "\nMartin Scorsese's new movie is a tale of sound and fury, signifying \u0085\nwell, not nothing exactly, but a heck of a lot less than it promises,\ngiven the straining intensity of those performances, the glowering\ndarkness of mood, the grand gesture at 20th-century history's grimmest\nnightmares, and the sheer length. This was supposed to be Scorsese's\nexperiment in B-movie thrills, but no mere B-movie director would go on\nfor two hours and 20 minutes. That's an auteur running time we're\ntalking about, and at the end of it, I got a whiff of shaggy dog.<br><br>The silly twist ending is supremely exasperating, and creating the\nnarrative foundation for this final revelatory whiplash has meant\nlaying down some long scenes that at the time look baffling and\nunconvincing. However, I admit everything looks good and fits together,\nand the film packs a fair-sized punch. Shutter Island is based on the\n2003 thriller from Dennis Lehane, the author of Mystic River (filmed by\nClint Eastwood) and Gone Baby Gone (filmed by Ben Affleck). The setting\nis the 1950s, an era when America's fighting men from the second world\nwar would often have found uniformed jobs such as police officers in\ncivilian life. One such is US Marshal Teddy Daniels, played by Leonardo\nDiCaprio in the scowling mode that he presented to the camera in\nScorsese's The Departed, a man in almost constant spiritual pain.\n"},
{"review": "\nAfter only seeing this film once it instantly became my favourite film\nbecause it has such a great mystery revealed. Leonardo Dicaprio and\nMark Ruffalo are a good combo as well (but that may be a bias opinion\nas I love all of their films) Would definitely recommend this film to\nanyone who loves a good thriller! I wouldn't want to say something that\nwould give anything away so all I will say is that it was very\nunexpecting, for me at least. I can't find a fault with this film, it\nwas thought provoking and kept me intrigued through out which can\nsometimes be difficult for longish films. All I want to do now is to\nwatch the film again to see the puzzle piecing together after knowing\nthe final image which I imagine will still be as intriguing.\n"},
{"review": "\nShutter Island is story about investigation to be carried about by Dr.\nDaniels played by Leonardo Dicaprio to find out a woman who has been\nwent missing on an Island. It is so that, these island contains a\nfacility to treat mental patients. One of the woman escapes and U.S\nMarshal Officer Daniels is appointed to inquire the details.<br><br>Officer Daniels has his own past, where he has lost his loved ones,\ntaken lives. His past still haunts him. Various factors come into\nconsideration on given Island. Is it treatment facility or a place\nexperiments are conducted on human beings to grow them into something\nelse.<br><br>There are various versions to the story, but the one I like goes like\nthis. The people on the island want Officer Daniels to be a victim of\ntheir experiments. For their task to be successful they appoint various\npeople even Officer Daniels colleague is not spared. The end heightens\nthe level of movie, when Daniel comments about getting off the island\nto his colleague after giving up. They (people with facility) have been\nlately keeping him on medication that serve their purpose lately, which\nhe (Officer Daniel) won't let succeed. A movie highly recommended.<br><br>Rating:9.0/10\n"},
{"review": "\nShutter Island has been very critically acclaimed but several fans and\ncritics alike. The film by director Scorsese has become a hit as it was\nreleased back in February 2010. Starring Leonardo DiCaprio as the lead\nfor their 4th collaboration (up to that point), Shutter Island does\ntell a very interesting story, however the journey we see does not\nfully equal to what one would expect. As all of Scorsese films, the\nperformances delivered by the leads and supporting actors are top\nnotch, as well as the visuals and scenery. Though one would have\nexpected more. <br><br>By the finale, when the big twist is revealed, it does not feel as one\nis satisfied with everything that has happened, or we simply do not\ncare so much. It was somewhat predictable with everything leading up to\nthe conclusion. Perhaps as many have stated, Shutter Island could use\nmultiple viewings and perhaps one would enjoy it more with another\nviewing. Though as it stands, I do not understand its hype it has\nreceived, as I do not feel it is an IMDb top 250 worthy film.\n"}
]