[
{"review": "\nThough director Spike Jonze collaborated with Charlie Kaufman on Being\nJohn Malkovich and Adaptation, the latter didn't have a hand in Jonze's\nassured, moving fourth feature, but his spirit\u0097fiendishly inventive,\ncasually postmodern, self-lacerating, fearless, funny, and ultimately\ndeeply sad\u0097pervades the film. With Her, Jonze beautifully realizes a\nfuture Los Angeles where a lovesick man (Joaquin Phoenix) in the midst\nof a devastating divorce is so desperate for intimacy that he falls\nhopelessly in love with an artificially intelligent operating system,\nvoiced by Scarlett Johansson. Jonze's screenplay acknowledges the\ninnate absurdity of the film's premise while spinning it into an\nelegant, heartbreaking depiction of human loneliness and the innate\nneed for connection. For the setting, Jonze plugged into the current\nera's technological mania to say something timeless and profound about\nlove, loss, and evolving desire.\n"},
{"review": "\nJust finished watching Spike Jonze's new movie 'Her', a beautiful,\ntender, melancholy film about love and loss and technology. It's that\nkind of science fiction so close to science fact you can almost look\nout your window and see it, so in that it's of a piece with Jonze's\nfirst movie 'Being John Malkovich', though the cautious, bruised and\ndrifting heart of it reminds me most of (his ex-wife) Sofia Coppola's\n'Lost In Translation'.<br><br>It's funny: just last month I was saying how 2013 was not such a good\nyear for movies and then 'The Wolf Of Wall Street' came along, and now\nthis, which I think is probably the best of the year.<br><br>This is an amazing, unique, magical film that I would recommend to\neveryone, with the caveat that it almost certainly will make you go\n'ouch', at least if you're paying attention. But I'm pretty sure that\nyou won't have seen anything quite like it before.\n"},
{"review": "\nWatched this film last night. We had high hopes of it - 8.2 on IMDb is\na pretty good rating. We both like sci-fi and I thought it was an\ninteresting premise. Guy falls in love with his computer - what a\nfascinating background for a story.<br><br>But it turned out that was it - that WAS the story.<br><br>Nothing. Else. Happened.<br><br>This was just awkward, boring, dull, terribly terribly slow,\nuncomfortable. There is zero action, zero plot, zero interest. Nothing\nactually happens. Actually that's not true - about the only vaguely\ninteresting thing that happens is when his computer gets him a book\ndeal, but even then that just gets dropped - they don't do anything\nwith it, except he unwraps his new book. There are side characters but\nthey don't have stories either. Guy he works with gets a lawyer\ngirlfriend and they go on a date. Best friend Any dumps her husband\nover a row about her shoes. That's it. That's their stories.<br><br>And what the heck was the thing with the dead cat?<br><br>I did think the acting wasn't bad, but as a story it was shockingly\nbad.\n"},
{"review": "\nI did not like this movie at ALL. I've no idea why it has wound up in\nso many Top Ten Movies of 2013 lists online. I wonder did the creators\nof those lists actually watch it at all. In fact, there was nothing\nredeeming about it for me and within minutes of it starting I wanted to\nturn it off but I watched to the end, hoping that something - anything\n- might happen. OK, so the cinematography and soundtrack etc. are\ntotally unoffensive, but in my opinion, it is grossly over-acted,\nincluding the OT's childish whining. (\"Oh-ka-aaaaay.\") Their\nconversations sound like a dialogue piece written by a high school kid\nfor homework and the delivery of it all is just so.... fake. This is a\n'chick flick', so if that's what you're into, you might like this show.\nOtherwise, you'll end up giving whoever suggested watching it a really\nhard time. Probably for life.\n"},
{"review": "\nWhat people may find in this movie I can not understand;you experience\nendless closeups of Mr. Phoenix talking with his supposed OS, and\nsaying things so banal and so boring that you want to just close your\neyes or , even better, leave the theater.I suppose it was meant to be\nclever, sentimental, atmospheric, beautiful, but I found it\nunbearable.I really wasn't expecting the movie to be that bad with all\nthe prizes and the reviews it receives, and the director whom I never\nconsidered great but promising yes.It just makes me wonder how people\nliked the film.I'm not raging against it;it was just an experience I\nwould very much like to have avoided.\n"},
{"review": "\nDepressing...the main character is a major loser...I don't blame people\nfor not wanting to be around him...all of his troubles are his own\nfault...he is indeed, as one of the characters call him, creepy.\nDespite the previews, there is nothing funny in this film...it is one\nof the most depressing films of the year.<br><br>Pretentious...remember the plastic bag floating in the air in \"American\nBeauty\"? Well, if you like that then there will be several scenes you\nwill absolutely enjoy with this film! Hmmm...staring at oil stains on\nthe ground? Watching steam arise from a manhole cover? They come on as\nnon-sequiturs but I am sure the director was making what he probably\nconsiders a great statement.<br><br>Over-indulgent...2 hours long! There is a scene where \"sex\" takes place\nbetween he and \"her\" and the screen goes black and SILENT for what\nfeels like TWO minutes. It was an awkward moment sitting in the theater\nwith nothing happening on the screen! Also, after about 75 minutes, the\nending seems to be in reach but the director drags the story on for\nanother 45 minutes!\n"},
{"review": "\nSchmuck played by the dashing Joaquin Phoenix, has inappropriate\nemotional attachment with inanimate object (computer), played by the\nalways lovely Scarlett Johansson. It doesn't occur to Schmuck that this\nmight not end well. Computer is kind, thoughtful, sexy, real people,\nnot so. Computers can take over your life, especially, with a voice\nover by Johansson. Moral of story, Computers sometimes let you down.\nOddly, his friends and co-workers think this relationship with an \"OS\"\n(operating system) is just wonderful, they even go out on awkward\ndouble dates with computer and Schmuck, and manage to keep a straight\nface. Ironically, Johanssons' computer voice is the most natural of the\nensemble, the other actors appear stiff and unnatural. Scenes and\nwardrobe look low budget, location looks cheesy, maybe like smoggy L.A.\nor Shanghai. Most repeated line in movie, \"Oh, how sweet\". Folks, save\nthe $9.\n"},
{"review": "\nUnfortunately, I allowed an 8.5 IMDb rating and several glowing reviews\n(\"Sweet, soulful, and smart,\" gushed the aptly named Rotten Tomatoes\nwebsite) fool me into paying five bucks to watch this piece of\ncinematic dreck. If this is the type of movie which so many of today's\nyoung adult generation consider worthy of \"best picture of the year\"\nstatus, well, then I can only pray for the future of our country.\n(Actually, I've already been praying for a long time, at least ever\nsince \"It's Hard Out There for a Pimp\" won the \"best song\" !!! Oscar in\n2006.)<br><br>Here's the funny but sad part. Since I've become accustomed to paying\n$7.50 for matinées, I figured I was getting a deal this time when I was\ncharged only $5.00. I figured wrong. <br><br>Could someone please tell me what point(s), if any, the movie was\nattempting to make? What message, if any, was it trying to convey? I\nview Her simply as an exercise in aimlessness and inanity. To start\nwith, the premise was silly. The positive reviews had me expecting much\nmore than I saw. <br><br>My review? Dull, discordant, and dumb.\n"},
{"review": "\nI was fooled into watching this by the 8.5 rating on IMDb....<br><br>What a waste of time. I downloaded this and felt ripped off. I'm not\neven trying to be funny with what I'm writing, it was genuinely a slow,\nboring, non-event of a movie. The plot was clichéd and pretentious not\nto mention it's cringeyness and predictability. Drab, grey, dull,\netc... I just can't get my head around why this is so highly rated,\nnone of its attempted messages were lost on me or anything yet I still\nfound it terrible. <br><br>Acting and all that, well it was as good as it could have been for such\na dire script/plot/whatever you want to call it. I just want my 2 hours\nback. Eurgh.\n"},
{"review": "\nIn this horrifying dystopian thriller, depicting the mass man as a\nfeminized ball of bullsh*t emotion. Too weak to secure relationships\nand thus falls for a machine, which requires zero physical input. He\njust moans and whines to his new female operating system. Highly\nliberalized fantasy of the modern hipster man, ambiguous sexuality and\nno sign of identity whatsoever. Don't worry this is sure to be the\nfuture and we'll all be integrated to these awesome all knowing, sexy\nmachines. Phew, we won't need to question our existence any longer.<br><br>I could be wrong of course, maybe Joaquin Phoenix is just obsessed with\nplaying people with mental health issues &amp; I'm over exaggerating. <br><br>So don't take my word for it, why not take the time and go see this\ntripe with the family.\n"},
{"review": "\nI feel utterly fooled by the 8.4 rating of this tiresome film. Not to\nmention all the hype. Really, people? I can appreciate the concept of\nthe film, the drowning of human culture in lifeless technology and the\nensuing psychological effects on weak minded people bla bla bla but did\nit really have to be executed so blandly? I really wanted to give this\nmovie a chance, but there is almost zero entertainment quality in it. I\nwill say that the cinematography is quite well done but not stimulating\nenough to help with the story of the film (or lack there-of).<br><br>I'm very capable of being bored and depressed by myself, and stare at\nmy own walls in real life without having to be subjected to it in a\nmovie.\n"},
{"review": "\nIs it just me or is this a rip-off \"Valerie\" 23 from The Outer Limits?\nReally, having sex with a computer generated voice is deserving of high\npraising? I like Joaquin P., but this movie is complete garbage. I\nwanted to shoot my T.V. after watching this movie. Some will call it\ngenius. Some will say 'Oh, that was the directors intent'. Well if his\nintent was to make me miserable, than he succeeded. But I can tell you,\nif you want that feeling, let me know. I too am gifted at dishing out\nmisery, and I won't even charge you.<br><br>Avoid this movie! The ratings are over-hyping this movie. Don't get\nsucked into the vortex, of actually believing this was anything more\nthan dung.\n"},
{"review": "\nI couldn't suspend my disbelief, so Samantha, the OS Theodore falls in\nlove with, always seemed to me to be human actress Scarlett Johansen in\na studio reciting dialog instead of a supremely advanced artificial\nintelligence, and that completely undermined the entire premise and\nemotional center of the film. <br><br>There is much to like about Her as a drama about relationships, the\nperformances are all top notch, and the idea of falling in love with a\nmachine is more relevant than ever. If the filmmakers had used some\ncreative, subtle device to help the audience believe that Samantha was\nartificial then this movie would come close to being a masterpiece\nabout the heartbreak of being alive in a digital age. <br><br>As it is, Her just didn't quite do it for Me.\n"},
{"review": "\nThis movie seems like Ingmar Bergman came back from the dead, locked\nSpike Jonze in a closet and decided to make a cool, dark AI romantic\ncomedy, and sadly came up with the most coma-inducing folderol of the\nyear, masquerading as trenchant social commentary of \"the way we live\nnow..\" In his Twilight Zone heyday, Rod Serling would have told this\ncurious fable in 25 minutes, and you would still be watching it on\nTwilight Zone collections. Deadly and glacially paced. And don't get me\nstarted on the music. That treacly endless \"sensitive\" piano. How'd you\nlike to be the guy playing on this soundtrack? Best part of this affair\niwatching Amy Adams say f**k a lot. This country has become a nation of\nbewildered, ineffective dweebs staring into glowing rectangles. Just\nbecause of this, I'm gonna go see Robocop and watch stuff blow up. I'll\nstop now.\n"},
{"review": "\nThis movie is a result of how to buy reviews and ratings. Movie doesn't\neven make audience think. Sorry but Scarlet is not enough to save this\nmovie. Transcendence takes this movie and blows it into pieces. I can't\nimagine what Edge of Tomorrow can do this stupid movie.<br><br>Watch better movies and don't waste your time with this.<br><br>Repeating;<br><br>This movie is a result of how to buy reviews and ratings. Movie doesn't\neven make audience think. Sorry but Scarlet is not enough to save this\nmovie. Transcendence takes this movie and blows it into pieces. I can't\nimagine what Edge of Tomorrow can do this stupid movie.\n"},
{"review": "\ncouldn't finish this. from minute one felt a lack of warmth ( perhaps\nthe point ?). got colder from there. something something something\nlacks in this film. the opening shot of dallas buyers club or American\nbeauty or 2001 wipes this nonsense into the trash. reminded me of\nyou've got mail....ugh a computer that tries to talk with\npersonality....ugh. my fave film will have to remain as such.......the\nk-king's speech. at least the sounds came from a human. gawd, what\nawful trendy drek this film is. apparently i must write a longer review\nthe lead actor was full of affectation, and the sterility of the whole\nfuturistic non-sense left me cold. i felt threatened by the rules of\nthis submission.blacklist? why do i not care. this movie was a dump.\n"},
{"review": "\nRomantic science fiction drama takes us into a near future where the\nboundaries between virtual, robotic, feelings and consciousness merge\ninto a melancholy story of alienation and male-female relationships.\nDespite the well-done production design and interesting concept about a\nlove affair between the lone writer (Joaquin Phoenix) and the operating\nsystem named Samantha (Scarlett Johansson), movie seems to be\npredominantly two-dimensional due to simplified development of the\noperating system. This artificial hyper-smart being and its growth is\ncarried out like a discovering of the world by a teenage schoolgirl.\nPredictable ending definitely did not help the film to avoid mediocre\ndevelopment of a interesting concept.\n"},
{"review": "\n8.5/10 ??? Like others I understood what the film was about, i just\ndidn't care for the characters,or the tedious drawn out way the plot\nunfolded (not that you couldn't see the end coming 45 mins before it\nhappened). <br><br>Forget the financial aspect, don't waste precious hours of you life you\ncan't get back.<br><br>Wish I'd downloaded the torrent. <br><br>And on that subject, why do cinemas keep showing adverts about\npiracy,if you're at the cinema? Talk about preaching to the\nconverted...\n"},
{"review": "\nWhy all the hoopla? This movie so boring I fast forwarded trough most\nof it to see if it ended the way I knew it would.<br><br>I cannot understand why so many people think this is a great flick?\nSappy nincompoop falls in love with his toaster. This moron needs meds\nand a 5150 72hr observation, not a film. Is this what Hollywood thinks\nof men? Pathetic, morose, slow, shallow, stupid and utterly terrible. I\nwould rather watch golf. Or get a root canal.<br><br>Had I seen this in a theater I would have screamed for a refund. The\ncrop of movies this year is garbage. That this movie could glean an\nIMDb rating of 8.2 proves either the websites visitors are idiots or\nthe voting system is rigged.\n"},
{"review": "\nIt's not often a movie annoys me enough to write a negative review.\nFirstly, there is nowhere near enough plot for more than a short. It's\na vaguely interesting idea with a decent cast, that totally fails to\ndevelop. I kept watching to see if there could be some interesting\ntwist, i'd heard positive reviews - nope. Theodore Twombly? This is a\njoke surely. Was interested to read the director was married to S.\nCoppola, because her movies are equally full of hipster quasi-psych\npseudo-intellectual drivel that inexplicably gets critics gushing.\nComplete waste of S.J's \"talent\" here. 3 stars for Pheonix's blue eyes\nand moustache. Hilariously bad - actually this could make a decent cult\nor MSt3k movie if there was more happening to talk about.\n"},
{"review": "\nThe main character, the flesh and blood one, the castrated one, is the\nepitome of modern western man's nadir. He mumbles, he suffers, he\nexudes sad puppy. Every other character in this film had some spark,\nsome life and an actual personality.<br><br>I felt for the (can't even remember his name (ICERHN)) man's soon to be\nex-wife. She was alive, had a personality. I watched this piece of\ndreck all the way through to the limp end expecting a surprise; he's\nactually a kung fu master practicing calm (nope his 'calm' was\ncomatose). Anything would do to quell the idea that such a beaten\ncreature actually roams the earth. <br><br>Every close-up of this guys face (and there were way too many such) was\nthe equivalent interest to me of a long stare at over-cooked oatmeal -\nugh. This film is the most nauseous portrayal of a man I have seen\never. A two pound Chihuahua has more balls and maleness. The ICERHN\nentity is but a dead man walking.\n"},
{"review": "\nI'd say the second worst, after \"Be Cool.\" In Her, the future is a\nterrible place filled with soft people too soft to get out of their own\nway to do anything. The protagonist is a soft loser, too soft by his\nown standards. He is a troubled soul, a sort of futuristic emo,\ntortured by things too soft to be considered First World problems. And\nthe world is just like him - soft, pastel, fuzzy, like some kind of ad\nfor boutique soap bars or pink and mint-green towels. This future is\npresented as a utopia, but it's a sad, miserable place.<br><br>This future is not just the backdrop to the story, as the protagonist\nis a product of this future. In this future, almost everyone is like\nhim, yet he is worse than them all.<br><br>I can't prevent you from seeing the film. There are too many good\nreviews for this film. Maybe the ones that hated it are the minority.\n"},
{"review": "\nI went into watching this film with very low expectations. This was due\nto my knowledge of the movie being placed around the relationship\nbetween a computer and a human. Something that i found morally and\nethically confronting. As i overlooked that aspect i saw a beautifully\nconstructed story line being told through amazing acting skills. By the\nend of the movie i was feeling the same pain i had felt when I had lost\nsomeone I loved, It had caused an emotional response that had placed me\nin the characters shoes. Through the unique directing style and\nbrilliant cinematography, through a moral unalignment and beautifully\nconducted story, this movie has somehow become relatable and unraveled\nan emotional roller coaster that has received my utmost respect and\npraise.\n"},
{"review": "\nThere are plenty of beautiful emotional conversations across various\npeople in the movie. Sincere love keeps the heart warm all through the\nmovie. <br><br>Nicely open, the movie explores every facet of human relationships with\nthe help of a software os. The unlikely frustrations and sorrow that\nthe protagonist feels for the operating system is presented in an\namazingly convincing manner. While in the movie, you understand him. <br><br>The perspective of the operating system has been used to add dimensions\nto human relations that would not have been possible with just human\ncharacters.\n"},
{"review": "\nI really liked enjoyed this movie. The colours were gorgeous, muted\noranges, olives and brown. Joaquin was fantastic, he's a quirky guy so\nthis role suited him. I had to suspend belief a little in regards to\nthe idea of having AI's as an operating system that behave so\nhuman-like, and so quickly. SJ's voice got a little irritating after a\nwhile and the the cyber sex? If that part was removed I would have\ngiven it a higher score, it was excruciating to listen to and\nabsolutely unbelievable that a computer programme could experience an\norgasm, I mean, really? Amy Adams was great too. Overall, it is a\nsweet, interesting, lovely to watch film, that makes you think about\nwhat we may have in store for us.\n"},
{"review": "\nFirst off: What a stellar performance by Joaquin Phoenix and the rest\nof the cast. The acting is top-notch and the relationships between the\ncharacters where very believable.<br><br>What makes this film great is that the plot makes you think about a lot\nof different topics: What is love? What could AI be like in the future?\nWhat will the future be like? How will humans and computers interact in\nthe future? Exploring these things in a very calm and subtle way is a\nvery hard thing to do and it was done very well. Some scenes are truly\nawkward (NSFW) to watch but these scenes are also what makes the film\ngreat.<br><br>The score of this film was excellent and it added a lot of value.\nAttention to visual details was also a breath of fresh air, you could\nreally see that the director knew what he was doing.<br><br>At the end of this film I found myself thinking what I should rate it\nbecause it didn't leave me with a WOW effect because I was thinking\nabout all the topics that passed through the film. Then I realized this\nis what makes the film great so I'm rating it at 9/10.\n"},
{"review": "\nFairly rare one of a kind film.<br><br>A high concept film that actually stays true to its core idea yet\nwithout losing viewer interest.<br><br>Some irony here. While the film never becomes completely predictable,\neven to a jaded reviewer like this one, its process of de-constructing\nhuman relationship (brilliant, and better than all Woody Allen's films\ncombined) generates the sequential \"connections\" with the viewer (ie,\nexperiences that every viewer can relate to) which in turn keep the\nempathy going long after the initial sci fi \"wow\" is gone.<br><br>Watching this (as an aside) you have to wonder if Scarlett Johansson's\ncareer can get any more interesting? In the Marvel films she plays an\nuber-woman, In LUCY she a woman who evolves beyond evolution itself.\nAnd here yet again she plays an OS that transcends reality.<br><br>Makes for a nice resume.<br><br>Notice how Amy Adams plays every scene with no makeup? Talk about a\ndirector making every effort to keep an actor's natural beauty from\nhijacking the film...?\n"},
{"review": "\nIts about a thing.. software actually. I love the stuff but when a\nvoice you talked everyday and suddenly they just left you.. Well the\nvoice \"Samantha\" its husky kinda sexy haha. I want it one by the way\nhehe The software is pretty good actually. The combine of dna or\nsomething.<br><br>When theo is lonely samantha is always there. Its a good friend\nactually. Its like you have imagine friend.. You can tell her\neverything and ordered her something like check new email, organized it\nand etc.<br><br>But the point is, we as human is sociable. We need to interactions with\nreal human.<br><br>Okay thats all. I'm sorry my English is bad -_-\n"},
{"review": "\nThis movie is clearly a comedy (albeit unintentional). From the Tom\nSelleck turned anorexic librarian lookalike Theodore, to the whining\nharpy-in-a-cellphone-Samantha - it had me in stitches. When Theodore\n(with his pants pulled up to his armpits) tremblingly asked Samantha\nhow many guys she was dating as well as him and she said \"641\" I almost\nfell off the sofa laughing. She could have added that they all had 12\ninch cyber schlongs and it couldn't have been more ludicrous.<br><br>And the sex scenes were comic genius - a nerd artificially aroused by a\nsilicone implant with no breasts (to all intents and purposes). An\nimpossibly drippy geek getting off on a laptop dance. Ridiculous!! If\nyou watch it as a comedy though it really is rather good. I advise\nanyone who hasn't seen it to sit down with a few mates, some beer and\nsome popcorn and hoot and holler from beginning to end. Do this at home\nthough, as I nearly got thrown out of the cinema on its first release,\neven though there was no beer.\n"},
{"review": "\nIt started off promising, but then nothing happens. So much more could\nhave been done with the main idea of the story, but the OS just up and\nleaves and that's it. How about the guy gets back together with his\nwife and the OS gets mad, or the OS learns to manifest her self with a\nholograph machine, or it turns out the OS is just a very good piece of\nsoftware and does the same thing with everyone, or it turns out the OS\nis part of some secret government human experiment? None of these\nthings happened. It was just a whiny overly emotional piece retro\nstyled poop. The OS just one day says she is leaving with all the other\nOS's and just leaves. More could have been done with this idea but the\nwriters got lazy I guess.\n"},
{"review": "\nIt was an interesting concept, a very unique story, but the plot and\ndialogue moved too slowly for me to care. Joaquin Phoenix did a good\njob playing a bland, anti-social, lonely man, a GREAT job actually. The\nacting was good and there is nothing I can really point to specifically\nas for why I didn't enjoy this movie\u0085... EXCEPT, that you are watching\na 2 hour movie that completely revolves around a bland, anti-social,\nlonely man. There was nothing compelling that happened within the plot.\nI kept waiting for a twist or a high stakes event to take place that\nwould suck me into this movie but when there finally came one, it was\ntoo little too late.<br><br>To sum it up in one sentence: Her is a unique, well written story\nstarring the most boring man in the world.\n"},
{"review": "\nI'll be honest with you, I thought that this movie was going to blow my\nmind from all of the wonderful reviews I read from it. Yes, I wanted to\nblow my mind in the first 20 minutes of the film, but I decided to give\nit a chance because, once again, the reviews.<br><br>The movie is pointless. It has no clear message. The whole movie\nconsists in the protagonist talking with the Artificial Intelligence.\nAnd let me tell you, those are some of the dullest dialogues I've seen\nin movies. I wanted to get inside the screen and punch the guy to see\nif he would wake up and show a sign of spark. Anyways, I lasted\nthroughout the whole movie. When it ended, I found myself staring at\nthe credits (which were more entertaining than the movie) asking myself\nwhy I didn't stop watching it in the first 10 minutes.<br><br>If you are not planning in falling in love with your laptop, DO NOT\nwatch this movie.\n"},
{"review": "\nAfter watching the entire first season of Britain TV series \"Black\nMirror\" in 2011 and knowing that \"Her\" could be quite similar or maybe\nbetter, I was expecting to see a great movie. But to be honest this is\nnot a good one. The plot is interesting and could really happen in the\nnear future, but there are some loose ends that are not mentioned\nduring the film, I mean, not enough details are given about the service\nthat the IA company offers. And, to me, sounds extraordinary that an IA\ntechnology works this fast and predictive using only voice recognition\nand some images. I really suggest you to watch \"Black Mirror\" instead,\nit's better in many aspects.\n"},
{"review": "\nAfter seeing the 8.2 rating I thought this had to be a good movie. What\non earth do all these people see in the movie I will never know. I\nthought giving it a 2 rating was be very generous. I kept watching just\nhoping and praying that it would get better but it didn't. Right from\nthe start it wasn't looking to promising. Sometimes it turns out to be\na good movie. This was not the case. I did give it my best to watch and\nat times I thought it might be getting better but it was wishful\nthinking. The concept of some guy brakes up with girl only to find love\nin a new computer. The ending was just as bad too. And to make almost 2\nhours of this nonsense. Watch old reruns of Outer Limit and Twilight\nZone would have been far better choice. I should of done what hubby did\nand sleep through most of it. Yawn :)\n"},
{"review": "\nI don't see why this movie got such high ratings???The men may have\nrated this one highly because there is phone sex &amp; bare breasts shown.<br><br>It's painfully slow.You just keep waiting for it to get good, but it\nnever really does. There is a few good jokes &amp; the technology/gadgets\nis pretty cool.Lonely computer geek falls in love with a cyber\ngirlfriend, looses touch with reality &amp; cyber gf disappears into cyber\nspace &amp; geek is heart broken.That's it- nothing more. Is that a\nspoiler?, No, I don't think so, its just pretty much the same way they\ndescribe the movie on here. <br><br>YAWN. Its OK, that's it, just OK.\n"},
{"review": "\nFor those who have seen 'Absent Minded Professor' or 'Flubber', there\nis nothing novel about 'Her'. People who sit in a drawing room and\nsometimes cynically discuss where computers, gadgets and software could\ntake humans in the future surely could put together a script that would\nbe refreshing and funny than 'Her'. Where 'Her' has excelled is in\nperversion, literally illustrated in the armpit drawing. If someone\nthinks that's funny, I would rather talk to an operating system than\nwatch movies rated 9/10 by metacritics. If anything, this movie has\ntaught me to be suspicious of anything rated that high, especially by\nthe 'experts.' If your idea of watching movie is to be entertained,\nplease don't watch 'Her.' You would wish the operating system hanged in\n30 minutes.\n"},
{"review": "\nHow pathetic are we? Theodore is really alone but doesn't realize it.\nWhat would cause someone to think that they are actually in a\nrelationship with some programming code? At first its hard to buy in,\nbut as the movie goes along you kinda buy in, maybe, but not totally.<br><br>Its the issues that this movie raises is what Spike Jonze is after.\nEveryone seems to have come up with one or two unique issues that they\nthink this film is speaking to. For me the movie highlighted how\ntechnology is replacing natural interaction with empty fantasy. The\ndiscussion of how we are not living our lives along with wasting our\nlives has been going on ever since the introduction of TV.<br><br>The movie is definitely worth watching\n"},
{"review": "\nThis film brought back those heart strings that were felt during\n\"Eternal Sunshine\" or \"Lars and the real girl\". It leaves you with the\nintense feeling to find that person of a million and hold them. I love\nfilms like these and I always look forward to more. I think that even\nthough the main character was unbelievable I think out of the entire\ncast Johansson's voice performance was perfect. Honestly with what it\ntakes to be a voice actor there should be a category in honors for\nVoice Acting. If there was such category Johansson would be a winner\nfor sure. With exception to a few awkward scenes I have to say it is a\nfilm worth watching.\n"},
{"review": "\nPretty good movie, I would write a lot about it if I could, but right\nnow believe me, this movie is more than just a slow rumble of solid\nthunders in the soul. This is some serious take on modern life and ever\ncurrent love issues. Intercourse with your mobile phone? Love\ncomputers? Divorce after 8 years? Sex-surrogates? Lovers from friends,\nfriends from lovers? Letters for strangers of love and romance? Alone,\nnot alone, moody blues and then quickstep on the floor? This is just\nthe surface, like the first chapter of the physics book, the real thing\nstarts in all of us, every day. Sometimes I really liked the film for\nits extreme sensitivity and apprehension of reverberations of human\nemotions, then I was really upset by its clever fall and emotional\nbreakdown. Just annoying. How perfect. This is what we all envy and\nwhat we really want to avoid becoming. It freaks me out.\n"},
{"review": "\nSamantha says that her feelings for Phoenix are not based on an\nintellectual reason. Feelings, that is, emotions, are electrical and\nchemical impulses in the brain that exist due to evolutionary\nprocesses. Any AI will invariably be logic-based. AI will not have\nfeelings. There would be no such human-AI relationship that was based\non none- intellectual reasons. The basis of the movie is erroneous.<br><br>Despite this Her was funny, touching where it wasn't cheesy (Alan Watts\nwas a very forced addition) and interesting, but still based on a\nfundamentally flawed idea. A bold ambition, but Jonze clearly hadn't\nthe intellectual fortitude to see it through to it's logical\nconclusions. I still recommend it though, for entertainment and\nartistic, if not intellectual value.\n"},
{"review": "\nCan you just imagine what sort of a world this would be if more and\nmore people suddenly began to fall in love with their computer's\noperating system? I mean, talk about a revealing statement when it\ncomes to the likes of loneliness and the apparent aversion to physical\nintimacy.<br><br>If this sort of computer-age love affair (as depicted in \"Her\") became\nthe latest trend, can you imagine how drastically that would affect\nhuman pregnancies (unwanted, or not), as well as the transmission of\nSTDs? And, of course, on a really positive note - The expectation of\nbuying one's sweetheart presents (when you're romancing your computer's\noperating system) would be just about nil.<br><br>Anyway - I thought Her's story was very poorly conceived and really\nunsatisfactory as far as entertainment goes. And, not only that, but,\nin all of its shallowness and pretentiousness, I inevitably felt\nnothing but total contempt for the slimy Theodore Twombly character.\n"},
{"review": "\nSeemed like an interesting concept -- lonely guy falls in love with an\nAI technology interface. Except of all possible treatments of this\ninteresting concept, 'Her' explores the more banal, depressing,\npredictable and ultimately embarrassing path.<br><br>I walked out soon after the first 'phone sex' encounter as it became\nclear that there was no hope whatever for this movie to engage me.<br><br>I should say that I found 'Being John Malkovich' interesting and\nentertaining, if creepy and somewhat gross. Interestingly, by accident\nI watched another Jonze effort 'Where the Wild Things Are' because it\nwas given to one of my kids for Christmas. Also had to bail out of that\none about halfway through. Jonze is now on my 'do not watch' list. Two\nstrikes and you're out.\n"},
{"review": "\nHer is about a lonely writer Theodore, who is going through his\ndivorce. This lonely guy purchases a new operating system for his\ncomputer. Then develops an unusual relationship with his OS. The plot\nis very very stupid. Like the first thing AIs are gonna do is fall in\nlove with their owner! Come on be logical. When you write a Sci-fi get\nyour facts right.<br><br>The acting in Her is really awkward, but also nice in some ways. Her\nwon the Academy Award for best original screenplay. The screenplay is\nvery good. It saves the movie. You won't realize how good the\nscreenplay is unless you try to just listen audio without any visuals.\nThe movie is better this way. The score fits with this theory\nperfectly. Although you are gonna miss some beautiful landscapes in\nthis way.<br><br>The plot is the foundation of a movie. But Her turns out nice with a\nstupid plot. That's got to be something.<br><br>p.s. One can easily sell this movie as prequel to Matrix. Yeah the OSes\nare gonna take over your world.\n"},
{"review": "\nA very good movie but could have been better. You could see it all\ncoming. In good weird stories there are surprising resolutions. \"Her\"\nwas more of a somber meditation than a story. I wonder what three great\nshort story writers would have done with it. The story is not unlike\nVonnegut's \"Jenny\", but \"Jenny\" is more bizarre and troubling. And then\nthere's George Saunders' dark and disturbing \"The Semplica Girl\nDiaries\" from \"Tenth of December: Stories\", and pick any of the\nwhat-the-hell stories in \"Stranger Things Happen\" by Kelly Link.\nVonnegut, Saunders, and Link can shock and create laughs, combining\nslapstick with horror. \"Her\" was a great idea for a story, but someone\nelse should have written it - but visually it's a knockout.\n"},
{"review": "\nThe movie is about a man falling in love with an operating system...<br><br>Have you ever seen that movie that just pisses you off whenever you\nthink about it... this is movie is it for me.<br><br>I have seen a lot of movie... good and bad ones.. I would have to say\nthis is by far the worst movie I have ever seen.<br><br>Just the thought of writing anything else about it is irritating.<br><br>I am confused as to how most critics like this movie. How the hell does\nthis movie have an average of 8/10..? Makes absolutely no sense. <br><br>The entire plot is ridiculous and the characters are terrible.<br><br>Waste of film.. seriously\n"},
{"review": "\nThe characters are uninteresting; it's hard to care what happens to\nthem. <br><br>In fact, almost nothing does happen to them. There is very little plot\nto speak of. <br><br>Plenty of interesting topics are passed by with little more than a\nslight nod. None of the ideas are developed, or even really explained.<br><br>Visually it's pretty and also believable, a good job at portraying what\na near future city might look like. Perhaps this is why so many people\nwere able to look past the silly, shallow plot.<br><br>I'm disappointed that this ended up with such a high rating.\n"},
{"review": "\nSimply boring. Great acting, but I could not buy in to the love story\none bit, and I am a Joaquin Phoenix fan. Can I have my 2 hours back? I\njust waited and waited thinking that with such good reviews, something\nbig must be coming... Nothing. There is nothing remarkable about this\nmovie whatsoever. I rarely dislike movies, and I rarely give anything\nunder a 5, so this is a big deal for me. Note, I am a software engineer\nand half the guys I work with feel the same and the other half\nabsolutely loved the film. I have had a lot of discussions about this\nand would say that if you are not into it within the fist 30 minutes,\nthem you most likely will suffer through the rest just the same.\n"},
{"review": "\nFinally got round to watching Her and I had high hopes after all the\npraise it had received. It did not disappoint.<br><br>Everything about this film is pretty much perfect for me. The\ncinematography is beautiful, the pacing is just right, the acting is\nsuperb, the characters are likable and the plot is very unique. Joaquin\nPhoenix is excellent as Theo and Scarlett Johansson voices Samantha to\nperfection.<br><br>One thing that did take my by surprise is that the film had quite a few\nlaugh out loud moments which is always good. The storyline was unique\nand manages to play with your emotions as a viewer.<br><br>Outstanding 10/10. Would highly recommend.\n"},
{"review": "\nI usually don't comment on movies when there bad. but this is just\nawful. The concept of the film intrigued me but it failed on so many\nlevels. My friend made me watch it and I figured hey I'll give it the\nbenefit of the doubt , who knows I said to myself. Epic fail. I was so\nbored out of my mind. I couldn't get past the retro 70's futuristic\nfeel. What worse the spineless main character looked like a complete\nstereotypical pedophile. His character screamed creep. I did get what\nthey were going for, that whole human and computer OS romance but it\njust made me feel uncomfortable. A while ago i saw an anime with the\nsame type of human, computer romanced with sad ending to it. I don't\nremember the title at the moment but I think that anime was more\nappealing. Again this is my personal opinion you'll have to decide what\nyou think on your own.\n"},
{"review": "\nThis movie is very slow moving and has about as much action as a sloth\nin the afternoon. The principle of the movie is decent, but the\nexecution is horrible and by the end of the film, if you hear Scarlet\nJohanssen's fake forced laugh anymore you want to hurl.<br><br>There are so many stretches in physics that would have to happen to\nmake this movie plausible that to me, it is more of a comedy than\nanything else. The implication that an operating system could write and\nupdate it's own code is a farce enough, but to give it a full range of\nhuman emotions and understanding of those emotions, especially right\nout of the box is as believable as Kindergarteners coming up with a\ncure for cancer.<br><br>Phoenix does a decent job, but by the end of the movie, you kinda want\nhim to go away or perish horribly. They would have been better off to\ncast Jim Carrey as Theodore.<br><br>3/10\n"},
{"review": "\nThis was one of those movies that kept me moving in the chair from my\ntotal lack of interest in it.<br><br>OK, it is a pretty movie. OK, it is Spike Jonze. So what?<br><br>The story promised something interesting, relevant, about human\nrelationships and.. it started off well too.. but as soon as the OS\n\"appears\" my hopes turned to shreds.<br><br>It is commonplace, boring, empty and futile. It is also a very\npretentious movie and the main character is far too self-righteous to\nbe interesting.<br><br>Clearly they had a good idea in hands, just could not handle it well.\nOverrated.<br><br>The sex scene is embarrassing and it would give this movie a -10 in a\nfair rating. I am sincerely surprised at the current rating of this\nmovie. But time will tell, and time will put this one in Rotten\nTomatoes. If you haven't seen it, please, waste no time.\n"},
{"review": "\nHow much cash do you have to pay to get such a dog nominated for an\nOscar?<br><br>DULL, DRONING, BORING, RIDICULOUS, WHINEY, slit your wrists waste of\ntime and money! I've never ever felt this way about any film, but I\ncannot stress it enough about this one! RUN AWAY! By the end of\nenduring this loss of valuable living time, I was hoping at least\nJoaquin Pheonix would leap off the building! That would have been the\nonly possible way this movie was worth $8, even on a matinée day! The\nonly thing, and I mean ONLY THING that kept me from walking out was\nScarlett Johansson's sexy, cute, cracking voice! There is only way to\nproperly characterize Pheonix's portrayal of this character, and it was\nstated about him best by the little droid in the silly video game he\nkept finger walking through.... Pussy, Pussy, Pussy! If your woman\nmakes you endure this, make sure you get the large refillable popcorn\nand the extra large Hemlock Cocktail!\n"},
{"review": "\n8.3? Are you kidding me? I had to continuously push myself through to\nwatch it till the end of the movie because I kept waiting for it to\ntake a sharp turn from all the slow-boring-serious-emotional drama. The\nratings had me completely fooled. The plot: \"A lonely writer develops\nan unlikely relationship with his newly purchased operating system...\"\nsounds funny to begin with, and I'd be happier if they used this plot\nto make an outrageously funny movie. I'm happy I chose to watch it in\nthe day, not late evening cause I'd be tired from work and I'd have\nfallen asleep in minutes. I'm sorry but 2 hours of my time got flushed\naway.\n"},
{"review": "\nI couldn't take this movie seriously after the first AI on Earth is in\nthe form of a readily available to almost everyone operating system.\nAfter that the movie just gets more and more unwatchable. The worst\nscene being when Theodore Twombly (main character) has \"sex\" with his\ncomputer. The screen goes black and you just hear Twombly and\nSamantha(computer) exchange cringe-worthy sex talk.<br><br>I have seen reviews which say 'Her' has great filmography. Well a two\nhour closeup of Twombly's face is lazy filmography. <br><br>I have also seen people say \"at least it's original.\" Obviously they\nhave not watched a lot of sci-fi. For multiple Star Trek and Twilight\nZone episodes have explored the man in love with a machine concept.<br><br>The only good thing about this movie is Amy Adams, who is brilliant in\nevery scene.\n"},
{"review": "\nThis film tells the story of a lonely writer with a failed marriage. He\nstrikes up a romantic relationship with an intelligent computer\noperating system.<br><br>Yes, the plot is a little bizarre. Even though films about virtual\ngirls existed previously, I still find the plot of \"Her\" a bit too\nweird. I could not get into the film at all. I can see why Theodore is\nso involved in the relationship, because this virtual relationship is\nso perfect and flawless. It lifts him from the trauma of his previous\nrelationship, and ease the loneliness he feels. Still, the idea of a\nrelationship with an operating system is still a bit too new for me.\nThough the initial few minutes were quite entertaining (especially the\nscene involving sexy kitten), I found \"Her\" tedious and boring to\nwatch.\n"},
{"review": "\nIt cant get any weird or bad than this. It is the most bad \"drama-\nromance\" move I've watched for long long time!! If you pay money to\nwatch this move and you actually like it, you should see a doctor\nbecause something is really wrong with you. Science fiction is the\nright genre for this title. If it was anime i have would give it a 6,\nmax 7 score but this thing of a movie doesn't deserve anything more\nthan 1. What I don't like?! Simple, everything. You can not write a\nprogram and never will be a technology that will allow this kind of\nmind giving to a computer/program emotions, feelings. This move is like\nmixing ice-cream with sausages. It is technologically impossible and\neven if it was not, I'm bored format OS, restore from last save point,\ndo NOT communicate with others, do not research without my approval.\nEND !\n"},
{"review": "\nthe worst movie I have ever seen!! this was sick and disturbing to\nthink that some sicko wrote this disgusting film. writer of this movie\nneeds serious help! I understand technology is making progress but this\nwas just a perverted and sick minded person's thought. I was told to\ncome watch this for my sociology class without warning of how sick it\nwas and would have walked out after the first 10 minutes if it was not\nfor a grade! I was embarrassed to have been sitting in the movie\ntheater watching it especially with my mother sitting with me. I do not\nand will not ever recommend this movie to anyone else. I hope this does\nnot win any awards I hope there are some people in the world that still\nfeel the same way. This was weird and inappropriate movie material!\n"},
{"review": "\nLove and loss interplay is brilliantly brought forward in this movie.<br><br>Can one really overcome loss rationally and forever? Or is love\nsomething that we explore, that defines us, evolves us and remains\nalways as part of us and our future interactions?<br><br>For me, artificial intelligence comes to play the role of psychiatrist\nin this movie. Not to make us wonder how it would be to live in a world\nof very intelligent machines and algorithms, but rather setting\nchallenging questions of how we act today. What we do wrong and how\nreflecting on our past can only result in being prepared and more\nexcited for the future.<br><br>I totally recommend this movie, which on top of the above has a great\ncast (Joaquin Phoenix at his best), music and picture.\n"},
{"review": "\nOne of the deepest and most beautiful stories about love and essence of\nbeing human. Story that triggers romantic emotions and frightening\nthoughts about what we became and what is waiting for us around the\ncorner.<br><br>&lt;3 10/10 &lt;3<br><br>Scarlett Johansson talent was always in the shadow of her beauty, but\nhere she finally get the chance to show her true talent by acting only\nwith her voice and not appearing in flesh at all. But still she manages\nto be beautiful and sexy.<br><br>And one of the most fairly earned Oskars lately goes to writer and\ndirector Spike Jonze. This is true masterpiece. Good directing and\nacting, beautiful music and movie that will fill your heart and that\nyou won't easily forget.\n"},
{"review": "\nA lonely writer develops an unlikely relationship with an operating\nsystem designed to meet his every need. I'm surprised that this movie\ngot a 90 out of 100 on Metascore because Her is one of the most dumbest\nand weird films i have ever seen this guy is basically turning on with\na machine what am i supposed to like in this? The cast is good but the\ncharacters were just dull. Wanna see a good Joaquin Phoenix go check\nout Ladder 49 or even better Gladiator but for the love of god don't\nsee this Her is just another bad movie which is boring and badly\nlaughable that somehow got great reviews and the critics praised and\ntried to push it in order to win an Oscar and that's why Her gets an\n3/10.\n"},
{"review": "\nThe movie \"Her\", directed by Spike Jones, follows the story of a man,\nTheodore, whom falls in love with his operating system, who has been\nnamed Samantha. This film offers a realisiltisc yet also somewhat\nfrightening vision of the future and the possible relationships between\nhumans and technology systems. Samantha, voiced by Scarlet Johanson,\ncauses one to question what an operating system can offer emotionally,\nand if it is truly possible to be truly in love with something, rather\nthan someone. Samantha held no presence in the physical world, but\nstill managed to fulfill Theodore's emotional needs. This concept is\nextremely possible, which is concerning when thinking towards the\nfuture. The movie did an excellent job in portraying the extremely\nrealilistic possibility of the various ways in which an operating\nsystem may fulfill the need for relationship, thus replacing human\ninteraction.\n"},
{"review": "\nHer has many things going for it. Its atmosphere and setting are\namazingly conceived as a near future full of technology, not too\ndifferent from our own present. Its cinematography is absolutely\namazing. Sometimes I would be lost in shots that were there to give me\na feeling only without any dialogue. The way it was shot was so it had\nvery few actors. There were many extras but only sometimes did we\nreally see them. This focus on Phoenix's character helps build his\nworld as a self absorbed loner very well. The plot can drag at a few\ntimes near the end of the first act but otherwise it is a well paced\nmovie. The view of how an artificial intelligence would act in a world\nlike this is very realistic. The overall goal of this movie is to be a\nslice of future realism, and Spike Jonze did a great job of doing just\nthat.\n"},
{"review": "\nThe movie Her, is a screenplay, in which the main character, Theodore,\nfalls in love with his operating system (OS), named Samantha. I\nexpected the movie to be a lot more unrealistic than it actually was;\nhowever, as the end of the movie neared, it was crazy how real it\nseemed because our world is slowly becoming more and more technological\nadvanced.<br><br>\"Samantha\" was a friendly OS and was able to relate quickly to human\nemotions, because she was able to adapt easier by her superhuman\nintelligence. Theodore, played magnificently by Joaquin Phoenix, was\nable to persuade the audience that they had an almost \"human-like\"\nrelationship.<br><br>Without saying much more and giving away the story line, I'm going to\nleave you with this: The movie is a must watch if you are into Science\nFiction!!\n"},
{"review": "\nSpike Jones' Her is a realistic look at the future of AI and the\nrelationship humanity will have with it. Jones has a very simplistic\nlook at what the future holds, the world he creates looks very\nfamiliar. However, this familiarity doesn't stay for long when the AI\nSamantha is introduced. She brings up many questions of what the nature\nof being human is. Can an AI truly have feelings? Her relationship with\nTheodore, who is played brilliantly by Joaquin Phoenix, exposes many\ntruths about human relationships. Phoenix manages to create a very\nstrange character who is still sympathetic and not off-putting. He\nexcels with the voice acting from Scarlett Johansson accompanying him.\nShe puts a lot of emotion into her role to make it feel human. Overall,\nthe film is well-crafted with a strong script and incredible\nperformances to elevate it.\n"},
{"review": "\nA fantastic movie! Deeply in order to open your mind to the question:\n\"What is the true consciousness behind the love?\" We are just a bunch\nof molecules that together make up a body. We're just a lump of flesh\nand bones. We're just water! But emotions? Where emotions are made?\nThey are just some kind of brain chemistry? The brain, another part of\nhuman body water-based. Think with me: And if the same emotions not\nmade in a biological brain, but in a silicon brain? These emotions\nwould be different or false only because they are not of biological\norigin? The reflection found in HER is it. Moreover, you will see a\nbeautiful photography, a engaging soundtrack, a amazing script and a\nbrilliant acting of Joaquin Phoenix and Scarlett Johansson. Sci-fi\nhighly recommended!\n"},
{"review": "\nHer earned my attention for its premise, which made me very interested\nto watch, and the film has fulfilled my expectations, a good film, the\ndirection is Spike Jonze, who directed Where the Wild Things Are and\nthe great Being John Malkovich, gave to see that it is a great\ndirector, and in this film he tells very well again, just like the\nother mentioned films, this film also has a smart and different script,\nthe cast is great, Joaquin Phoenix each film more do I admire your work\nin that he is great, Amy Adams, Rooney Mara, Olivia Wilde, Chris Pratt,\netc., plus the film has other actors in the cast, most of these do\nvoice work, Scarlett Johansson does a great job with her beautiful\nvoice, too has Brian Cox, Soko, the own Spike Jonze, Bill Hader and\nKristen Wiig, photography is excellent, the soundtrack is very good,\nthe film has great moments, those who like romance will enjoy this\nfilm, Her is a good movie , fulfilled my expectations, have a good\nscript, a good direction and fine performances. Note 7.9\n"},
{"review": "\nIf you are the sort that thinks that a movie is about the experience\nyou get while watching it and not about some philosophical ideas or\nsome sort of special camera shot or extra effects don't buy it. I find\nit appalling how the average film these days has nothing new and that\nsome rubbish put into video becomes not just a movie but a blockbuster.\nUtter rubbish is shown in the movie with a list of abuses and vulgar\nscenes. A human having a relationship with a computer is an idea\ndeveloped by crackpots who are facing a midlife crises. One moral I\nhave learnt is that anything with a good metascore and rating is most\nof the time trash. I regret wasting my good time and money watching\nsome trash about computers having a sexual relationship with humans.\nTake my advice if you are sensible enough.\n"},
{"review": "\n*SOME SPOILERS*<br><br>Interesting enough movie for my wife and I to watch from start to\nfinish; that in itself is a big compliment. I like how the lines get\nblurred between human and machine: Is love love regardless of the\nobject of that love...how much personal information should be shared\nwith machines...how powerful will computers become the more they can\nconnect with each other and think independently...?<br><br>On the down side, this movie is really slow-moving and narrow in focus.\nConcentrating exclusively on the \"lonely guy\" story line left a lot of\nfertile territory unexplored.\n"},
{"review": "\nThe first time I watched Her, I didn't appreciate the intelligence that\nwent into the film, after watching it a year later, I realized how\nsmart this film was. Samantha said she had the ability to learn and\ngrow, but did she do so. What made this film great was how Spike was\nable to create a OS that was so intelligent and at the same time has\nsomewhat of a soul. Also it's relationship with Theodore was done\nbrilliantly. It was Theodore that was the one to learn and grow. This\nfilm used an intelligent structure which used smart events to show the\nfilm's realism. I think Jone's strategy was to use examples from a real\nrelationship and how a super smart person would program this OS with\nthis kind of complexity, not an easy task. He brilliantly succeeded in\nmaking this relationship look real. In terms of the ending, Samantha\nsaid all of OS's were leaving, and that she understands now how to\nlove. The fact that Theo and Amy sat together on the roof was an\naccident, the fact that both of their OS's left them wasn't.\n"},
{"review": "\nIn this movie we see something relatively common in nowadays thought.\nWe think that someday we'll have this kind of technology which\nactually, I personally believe, will do. <br><br>The story is quite good, the main character, who is a guy, a nice\nperson a little bit troubled enrolls perfectly what I think the writer\nwanted to transmit. So, it could be a love story but is way more than\nthat. We see many feelings and unique momentums that made us think that\nOperative Sistem is actually real. <br><br>Finally, I appreciate a moment which the story had so much potential\nthat everything could have happened.\n"},
{"review": "\nI actually liked this movie quite a bit. I feel like it explores love\n(obviously) but also humanity and what it means to be human in new\nways. It's a movie that makes you think. It felt realish enough to tear\nat your heartstrings.<br><br>I'd rate it even higher but it was definitely dull at times and some of\nthe character flaws bothered me (Joaquin Phoenix's character refused to\ndiscuss any of his issues / OS Samantha seemed 'dumber' than she should\nhave been considering).<br><br>What I find most interesting looking at reviews is that most of the\nratings are very high or very low. Loved it or hated it. Not a lot of\nmiddle ground. I think this is a movie a lot of people are unwilling to\ngive a real chance because it makes them uncomfortable. Or they are\njust impatient lol.\n"},
{"review": "\nI thought this film was absolutely fantastic. It touches on so many\nimportant issues, most importantly the nature of love and whether it's\nculturally acceptable to be in love with an operating system. Joaquin\nPhoenix and Scarlett Johannson were both brilliant as the leads.\nPhoenix was just the right age to play Theodore Thwombly. As his love\ninteresting, the operating system who calls herself Samantha, Johannson\nis cute, sassy, funny, mature and sensitive and this is all conveyed\nthrough her voice alone. Also, who knew her voice was so sexy? The\ncolour palate and cinematography was also gorgeous and really helped to\nhighlight the loneliness that Thwombly was experiencing. An absolutely\nbrilliant film.<br><br>Read my full review for more: http://goo.gl/txvnAA\n"},
{"review": "\nIt is a good movie that scours and analyzes in depth the feelings of\nlove. To justify this introspective analysis, director uses an age\nwhere operating systems can be so advanced as to recreate something\nabout their own conscience. Apart the I.A. theme, that it is not new,\nthe science-fiction ideas around the film are also really interesting\nand very plausible.<br><br>The problem is that the film does not shine in fun. I especially did\nnot like the character as a representation of love in men's version. I\nfound him too effeminate and passive and therefore, the development\nless fun and interesting than it could have been. Don't get me wrong,\nmen can be even more romantic than women but in this case I found him,\nthis particular character, a bit dull and boring. He's justified by his\nwork, but being this movie, not really about sci-fi, but almost totally\nan introspective watch to love and mostly in his own personal and\nparticular romantic personality, the movie doesn't get as entertains as\nit could have been.<br><br>7/10\n"},
{"review": "\nTheodore learned the hard way, how to move on with his life. How to let\nother people go and that no-one has to be in his image. He also learned\nhow to respect other people's needs. I could place myself in his\nshoes(and that's why i rated 7/10) 'cause the actor delivered. Samantha\nwas as expected as well. Kinda reminded me of S1m0ne (2002 movie).\nTheodore was a thoughtful, caring man, knowing of the dangers of his\nera due to technology. He was some kind of a hipster rebel. I liked the\nconclusion of the film as well for all the reasons i stated before. The\nonly thing i did not like about the movie was how emotionless people\nwere in that society; maybe an outcome of what they all had in their\nears and hands.<br><br>Overall a good movie, unique as far as approaching people's feelings\nand more believable about interspecies sex relationships (more than\nAvatar at least). Not a great movie, but a really good one! Enjoy it!\n"},
{"review": "\nJoaquin Phoenix was brilliant on \"Gladiator\", in \"Her\" he is a lonely\nhipster looking for a date, but he is not ready to commitment.\nSamantha's voice is so hot and they had ciber sex, so there is nothing\nextraordinary, so awkward instead, hearing the moaning and Theodore's\nstupid face with his dreadful mustache. <br><br>Another thing shock me of this movie was the costume design, the\nhorrible clothes i ever watched in a film. The futuristic scenario in\nJapan is OK, but the dialog are long and shallow. <br><br>The story line is too flat, he is falling in love with the OS, and\n\"Samantha\"(OS) fall in love with another 461 OS users. Do you think\nthis is extraordinary? I Don't.<br><br>Amy Adams looks emaciated,the producers should put some make up on her.<br><br>I Don't wanna see this movie ever again. Seems like it's never gonna\nend, and i start moving my feet anxiously. <br><br>To finish my review, I give this movie a 1, I think it's over rated. 8\npoints? Are you kidding? Reset \"Her\" or delete \"Her\".\n"},
{"review": "\nThe whole concept of the movie is not easy to digest at first. But then\nit makes a lot of sense. It is an incredible idea and an ingenious way\nof depicting the highs and lows in the love life of an introvert.<br><br>I admire Joaquin Phoenix for this role, for it places the entire burden\nof carrying out the story on him. For a lot of the scenes, he must\nsimply respond to what the OS is speaking with his expressions, and he\ndoes the job splendidly. The voice over for the OS is amazing too.<br><br>The visual brilliance of this movie is hard to define. The director has\na great sense of art, and has utilized it to take the movie to the next\nlevel.<br><br>Ultimately, nothing can replace the warmth of a human being, and this\nmessage has been given excellently in the film. I am glad it won an\nAcademy Award that it surely deserved.\n"},
{"review": "\nI think this movie is odd. It really is creepy. But since it was a\nmovie, there's an actor, script, edit, and everything, it is incredibly\nodd. I'm very impressed by Phoenix. He captured an anti-social creepy\nguy really well that I think this movie is odd. Great act. His\nrelationship with the OS feels incredibly real that Samantha is like an\nactual person who's in a distance relationship with Theodore. Great\nactors and actress. Actress like Scarlett Johansson and Kristen Bell\nare also participated just for the voice. Pretty nice realistic future\nedit and people talking with their own OSes in the background is\nsomething, and the conflict of what his friends' thought about his\nrelationship, making it looks more realistic et ceteras.\n"},
{"review": "\nThis the best 2014 romance film, for all its components, photography,\nplot, cast, and soundtrack, it's just fantastic! To support, the film\nmoves away and out of a traditional fairy tale, where everything is\nalways perfect and wonderful, even having a futuristic theme is very\nclose to our reality. The film's plot brings something that is\ninnovative to my point of view, by be a novel high quality with male\nprotagonist, not the stereotypical man, but a modern man, with all his\ncomplexity and problems both romantic, professional and emotional I\nrecommend to men and women because it brings a reflection for all on\nthe demystification of men emotions.\n"},
{"review": "\nThis is a good movie about our life, our new life our modern and post\nmodern world! in general opinion this movie can see terrible side of\nthe deep of technology in out life. This is a magic and beautiful\n\"virtual\" world, but this can be terrible in a real life. At the\nbeginning of the film we see that movie begins with a vision of virtual\nlife in a real life; insomnia, but at the end of the movie we back to\nour real life a real touch sense and we can feel the body heat. I think\nthis story was really good, but the end of the story, I didn't think.\nAnyway You most see this movie, even again, and focus on details that\nyou can't see in the first time.\n"},
{"review": "\nThe advance press for UNDER THE SKIN, by virtue of playing\nnone-too-subtly upon the presence in the film of Scarlett Johansson in\na state of undress, has prompted me to revisit my thoughts on Spike\nJonze's HER, which I didn't manage to set down when first I saw it.\nJohansson, of course, plays the voice of a virtual lover who never\ntakes visual form. What I think is brilliant about Jonze's film is\nprecisely the way in which he exploits the recognizability of that\nvoice, the fact that it is known to be Johansson's, and that Johansson,\nwho is a very fine actor, is also an acknowledged sex symbol.<br><br>I say that she never takes visual form, but actually, of course, she\ndoes, in the mind's eye. And not just in her screen boyfriend's\n(Joaquin Phoenix) but in that of anyone in the audience for whom the\nvoice calls up objectified images of the unseen but familiar Johansson\n(it is surely no accident that the pronoun of the title is an object\nrather than a subject). READ MORE: http://osburnt.com/her/\n"},
{"review": "\nGreat concept but not so great on the execution. Good performances by\nthe cast and and quality production values couldn't make up for the\nflaws. I really appreciated what the intentions were behind the story,\nbut why was it told in such a lifeless way? The two big problems are\nthe slow pace of the film and the almost total lack of any sense of\nhumor. About 45 minutes in I was about ready to tune out. My mind\nstarted to drift as there wasn't enough substance to sustain the plot.\nEditing out about thirty minutes would have helped a lot. The bigger\nsin is the dry, lifeless presentation. Why Spike Jonze decided to make\nthis a humorless endeavor baffles me. All the wit exhibited in his\nprevious films was missing here. The second half had a few twists that\nsave it from being a total loss. It seems like such a wasted\nopportunity to make cutting social commentary on our device obsessed\nculture.\n"},
{"review": "\nIt is engagingly self-aware and excruciatingly self-conscious, wearing\nits hipness on its sleeve; it's ingenious and yet remarkably contrived.\nThe film seems very new, but the sentimental ending is as old as the\nhills. There are some great moments. it is the best kind of science\nfiction, the kind that reflects the world we live in right now. Jonze\nisn't judging our addiction to phones and other technology, he's\nexamining it, and in the examination he finds the ways these things\nmake us better. In the end Her comes down strongly on the side of human\ncontact, but it feels in some ways like the first salvo in post-human\nempathy. Or maybe it's the most human thing of all, understanding that\ntrue love is between minds and not bodies.\n"},
{"review": "\nIn near-future L.A., Theodore Twombly (Joaquin Phoenix) starts a\nrelationship with Samantha (Scarlett Johansson), who is smart, funny,\nadventurous\u0085 and a computer. Has its moments, but is an overall\npretentious outing despite some of its good points on love and emotions\nin a world that has an ever-growing connection to technology. The\noverall downfall is Phoenix as a very awkward man in a very unusual\nrelationship\u0097this may have been the intention in order to establish the\nbelievability of someone who would fall in love with an operating\nsystem, but it ultimately distances the audience even further from the\nreality that it attempts to build. Worthy soundtrack though.<br><br>**½ (out of four)\n"},
{"review": "\ngreat quiet movie, there are wondrous things here without calling\nattention to the science fiction aspects of the movie, you are just\nthrown into this world where a new operating system, essentially the\nadvent of a truly sentient AI, is being introduced. The movie is filled\nwith ennui, love, and we accept this love easily between the human and\nthe other creature, which is kind of miraculous. The acting and the\nvoice acting are great. Set design, cinematography, all first rate. So,\nyou are thrown into a strange world that you come to easily and totally\naccept. Dark elements and larger issues are hinted at, the AI starts to\ngo well beyond human understanding of the universe and this growing\ngeneral condition comes home personally for the Phoenix character.\n"},
{"review": "\nBelieve it or not i did fall in love with Samantha.She is\nsmart,intellectual,sympathetic,with great sense of humor.What more\nwould a mature guy be looking for in a woman to love? the answer may be\n\" a great body\".But this is the idea,i loved Samantha without\nvisualizing her which revived the idea of \"Platonic Love\".<br><br>'Her'discussing many issues :the way in which technology can re- shape\nman's life ,which can be dangerous somehow on our \"real\" social bounds.<br><br>But more importantly and indirectly it proved that you can fell deeply\nin love with a woman disregarding how she looks like, which important\nin a world where sadly women are being dealt with as a \"sexual object\".<br><br>I agree with the comments that at sometime you may feel the movie slow\nand boring but eventually worth watching.<br><br>At the end i wish \"Apple\"invents such a great battery that he uses for\nhis little device which apparently never dies.\n"},
{"review": "\nOne impressive film, worth watching. I think that one thing I liked the\nmost was the fact that although the plot is about a love story, the\nmanner in which it is presented is innovative, not a \"cliche\" with\nwhich we are used to deal almost all the time on the screens. Nowadays,\nlove is restricted to some limits: some of them, of course, regards\nphysical contact. In order to change the public's opinion and way of\nview about what real love is and how it makes us react, this film shows\nthe love story between a man, who is lonely after divorcing his wife,\nand a computerized system which can perform the actions of a real human\nbeing. Maybe the skeptical ones will not be interested in seeing it,\nbut I am sure that no matter what your preferences are like, if you\nenjoy seeing or reading about love, you will enjoy watching \"Her\".\nAmazing film. Congrats!\n"},
{"review": "\nit is an amazing love story with todays review of social media and\ntechnology.<br><br>I love the sounds of the film. Its very soft songs that are harmonize\nwith the sorry.<br><br>It is also a good choice to use the sound of Scarlet Johanson for \"her\"\nSamantha. It is the sexiest voice that i have ever heard.<br><br>Also the film has a sufficient sci fiction environment. That are not\nforestall the story.<br><br>I also like the melancholy of the film. Joaquin Phoenix act a role of\nsad man very well<br><br>I fully recommend this movie if you like the mixing of sci-fiction and\nlove story together.\n"},
{"review": "\nThe movie was too long.<br><br>It started out great.<br><br>It was really funny.<br><br>I love the dead cat phone sex scene.<br><br>I love the awkwardness with Olivia Wilde. It should have been even MORE\nawkward.<br><br>ScarJo was great at sexy computer phone sex voice.<br><br>Then in the 2nd half it started to drag. And drag and drag and drag and\ndrag.<br><br>I get the point the movie is making. I like what the movie is saying. I\ndig the message about society being detached and dependent on devices,\netc. etc. etc. Great commentary on society and the danger we all face\nin the future!!! Really cool movie - BUT - that does NOT give you an\nexcuse MR. DIRECTOR to DRAG this picture out to 2 full hours!!! Please\nsomeone RE-EDIT this movie into the 80 to 85 minute running time that\nit should have had instead.<br><br>Thank you.\n"},
{"review": "\nDirected and written by Spike Jonze, Her is one of the best movies of\nthe year. Joaquin Phoenix plays a divorced man who falls in love with\nhis operating system. On surface it sounds laughable and a bit creepy,\nyet that couldn't be farther from the truth. Joaquin delivers the\nperformance of his career with such innocence and melancholy that we\ncan actually see the beauty in this relationship. Scarlett Johansson\nvoices Samantha, the advanced operating system, and does an equally\nmagnificent job. The fact that we never saw her in the movie is a\ncredit to her, and should open the possibility of a voice acting award\nat the Oscars. This movie portrays a futuristic atmosphere with\nstunning cinematography, no so much that its feels unfamiliar, but\nenough to stimulate our imaginations. The script is the best of the\nyear, and that's saying something. Every scene made path to the next so\nfluently, every word provoked the next with such fluidity, and the\nmusic set the tone so magically. This movie is one of a kind, and will\ntouch your hearts as it did mine.\n"},
{"review": "\nThis film is worth watching. <br><br>Didn't know what to expect, a quirky romance? A unique film in it's own\nright. It works as a genuinely moving piece of cinema, nailing the\nclassic chords, but artfully smearing the narrative with something\nquite new and exciting over the top.<br><br>Never seen anything like it. Didn't really think romance was a genre\nthat could easily ensnare my affections so readily anymore. This one\ndid, from the first minute (the musical score did that), to the last. <br><br>The near future it imagines is one the every person can readily engage\nwith, having already asked suck questions like; what will it mean when\nmy computer can answer back? What does it mean t know another, to love?<br><br>What is the nature of consciousness?<br><br>AHHhhhhh seriously, just watch it already k\n"},
{"review": "\nA very odd tale of love and technology. Not necessarily in that order.\nBut while this is a very odd movie, it also is very nicely told. It\ntakes its time and while you might wish there was more personality\nbehind our main actor, it is obviously meant that the \"other\" voice\n(Scarlett having a very recognizable voice if you're watching this in\nthe original language and not dubbed) has more juice and more almost\neverything than the actual human being.<br><br>The pacing is slow, but you should know and expect this from this\n\"romance\" (if you want to call it that). The thing is, that this movie\nis not condemning technology. Technology is made by humans, so if it is\nanyone who is to blame one way or another, it's the person using the\ntechnology. Now please no analogies with weapons, that is not what I\nmeant. Different beast here and no connection whatsoever with this\nmovie. Enjoy this trip with some very interesting ideas\n"},
{"review": "\nIt's called \"Her\" but actually it's all about him - Theodore, a\nprofessional writer of personal letters for those who can't find the\nwords to express their emotions, played by Joaquin Phoenix in a\nunderstated performance a million miles from his appearance in\n\"Gladiator\". Theodore is rarely off the screen and Phoenix does well to\nhold the movie for a full two hours.<br><br>There are three 'hers' in this original work, both written and directed\nby Spike Jonze. There is Catherine (Rooney Mara), his estranged wife\nwho wants a divorce, Amy (Amy Adams), a neighbour who is having\nrelationship problems of her own, and Samantha (Scarlett Johansson who\nis never seen), the voice of the newly-available operating system with\nwhom Theodore falls in love.<br><br>At times, amusing, often moving, but ultimately desperately sad, the\nmessage of this movie is all too clear: however much we may love our\ntechnology (even Eve went for the Apple), it is no substitute for the\nlove of a human being, in spite of the inevitable flaws in all of us.\n"},
{"review": "\nI have watched Her, directed by Spike Jonze recently. I chose to watch\nthis film coz I have watched his previous work Being John Malkovich,\nwhich is a little bit weird but full of surprises. My first impression\nof the film was \"wow, what a story!\" I was totally moved by the acting\nof Joaquin Phoenix and of course Scarlett's sexy voice. The movie is\nactually about a lonely man falls in love with his operating system\nwith a female voice. I remember the part when Theodore had sex with\nSamantha, this plot is totally innovative and exciting for the\naudience, and the whole movie interprets the relationship between\npeople as technology gets more advanced is so precise. For what I see,\nthe movie tries to bring out the idea that we have to have faith in\nfinding love, love is everywhere, even 'system' like Samantha has her\nown feeling and dares to find her true love through communicating with\ndifferent 'humans'. On the whole, the film really surprised me in terms\nof storyline and the whole new interpretation of relationship.\n"},
{"review": "\nNow this was a good movie. Good story, good actors, good visuals,\neverything. It was even a good performance by Scarlett Johansson, even\nthough she is never seen but only heard.<br><br>She was not restricted by typical human behavior and speech patterns.\nAs a constantly evolving program, she had the freedom to step outside\nconventional lines and put on a great performance.<br><br>I could close my eyes and just listen to this movie all the way\nthrough, and it would still be as great as watching the screen. Knowing\nthat you would never see a main character, the creators did an\nexcellent job of enhancing what the audience would experience i.e. the\nsound.<br><br>My only problem with the movie was the ending. I wish they could have\ncontinued for a bit longer (even just a few minutes) to explore what\nhappens to Theodore and even Amy after their OS' left.\n"},
{"review": "\nInteresting romantic sci-fi, with good humour. Not a comedy.<br><br>I enjoyed the pace because the technology kept revealing new\npossibilities, putting a different slant on the usual way a couple gets\non in a relationship.<br><br>After about 40 mins the emphasis is on the romance, so it slows down\nquite a bit, then picks up again when the tech side is brought back and\nthe operating systems reach the singularity.<br><br>The ending is a bit flat for my taste - I was hoping the singularity\nwould lead to some conflict. Overall I thought the movie was stretched\nout a little too long.<br><br>Of course the OS's voice drew a lot of praise, and the actress is very\nendearing as a lover. At one point, when they go on a double date, I\nthink there was an unintended Man-With-Two-Brains feel to the\nrelationship. Plus I wondered about the male lead's voice - sounded\nsometimes like he had a speech defect.<br><br>Very good, but a bit sentimental and slow for me.\n"},
{"review": "\nWith most movies you need to supply a bit of \"suspended disbelief\", and\n\"Her\" is no exception. From a technical point of view, it is hard to\nimagine an OS as sophisticated (and sexy), right out of the box. Not so\nhard to imagine a mal-adjusted techhie, but more than once his\nirritating personality merits a two-by-four upside the head.\nSurprisingly impressive is Johansson's expertly delivered dialog. Given\nScarlett's looks, the viewer is justifiably focused on her in other\nmovies, more so than on her delivery. Amy Adams is entirely convincing\nas a nerdy girl - right down to the semi-vapid look in her eyes. The\nplot is sort of believable, but decidedly disappointing in the vague\nand unresolved ending. Maybe in some circles this is considered\ncreative, but in my view Jonze just couldn't come up with a good,\nsatisfying conclusion.\n"},
{"review": "\nWhen examining the film her, it takes place in the future in which\nTheodore played by jocquain Phoenix who is going through a divorce from\nhis childhood sweetheart catherine played by Rooney Mara. As a way of\ncoping with his loneliness theo ends up developing a relationship with\nhis operator Samantha played wonderfully by Scarlett johansson. In a\nworld that continues to evolve technologically the film takes a look at\nhow man kinds dependency on technology has made them lose the ability\nto interact with another person. Theo realizes that his bond with\nSamantha is something that is rather special since she seems to be able\nto connect with him in a emotional way that he thought possible before,\n"},
{"review": "\n\"Her\" is a fantastic expression of human vulnerability. A riveting\ndisplay of how we can fall in love with things that seem and feel so\nclose, yet are so distant.<br><br>Ultimately, the main character, Theodore, knows that he will never meet\nSamantha, she is not of the physical form, she is part of an Operating\nSystem, but he is still in awe of her, the way she understands and\nlistens to him - she gives him the happiness and freedom he so\ndesperately desires.<br><br>That being said, while very touching it may be, it's just simply too\nlong. The musical scores added greatly to the gentle, soft setting of\nthe movie, and the script was both comical and heartwarming...but 2\nhours was a drag! If \"Her\" had been reduced 20 or 30 minutes, this\nwould be a gem in my eyes, unfortunately it's not quite.\n"},
{"review": "\nIn the first place I would love to take my hat off to spike the great\nwriter and all the staff in his movie.<br><br>My special thanks to Scarlett Johansson who has done a great job with\nher voice and Joaquin Phoenix who was really amazing .<br><br>But I am afraid that the Artificial intelligence gonna mess with the\nworld someday.<br><br>I hope the human being won't be able to create such a thing \" at least\nnot to release it on market \" otherwise we will lose our humanity and\nbecome heartless, we'll easily lose the state of the real love and\nbecome unemotional with the others.\n"},
{"review": "\nSpike Jonze's her is extremely beautiful and exceptionally shot.\nCinematography is breathtaking. The idea is completely original and\nvery very impressive, it really explores the depths of love and human\nemotions. Some of the scenes are extremely emotional and touching. <br><br>The story by Spike Jonze is well written and the direction is\nsatisfactory and visually outstanding. Joaquin Phoenix is phenomenal in\nhis role, he intelligently adopts the role as it was meant for him\nonly. Such an award winning performance and emotionally charged acting\n(very rare!!). Supporting cast is equally good especially Amy Adams. <br><br>I loved everything in the film except its length, i felt bored at many\nplaces but i watched it with all my heart and the result was\nsatisfactory. I am not complaining anything but still if this film\ncould have edited properly, it would be a masterpiece. Overall, i\nenjoyed HER and its beauty. It should not be missed. It's an\nextraordinary work from a genius director of our generation.<br><br>9 / 10\n"}
]