[
{"review": "\nAfter a brief prologue showing us how Sméagol came to get the ring and\nhow he came to be the pitiful creature we know the film proper starts\nwhere The Two Towers left off; Sméagol is continuing with his plan to\nlure Frodo and Sam to their doom in Shelob's lair and Gandalf, Aragorn,\nLegolas and Gimli are reunited with Merry and Pippin at Isengard.<br><br>When Pippin looks into the palantír, a sort of dark crystal ball, he\nsees the city of Minas Tirith under attack, unfortunately he himself is\nseen by Sauron. Galdalf takes him to Minas Tirith when he rides there\nto warn of the impending attack while the others remain behind to raise\nan army large enough to assist in that coming battle.<br><br>I thought that the battle of Helm's Deep was impressive but it seems a\nmere skirmish compared to the battle of Minas Tirith, here there are\nthousands of Orcs supported by mercenaries mounted on gigantic elephant\nlike creatures that are large enough to crush a man and his horse under\ntheir giant feet. All the time this battle rages Frodo and Sam are\njourneying deeper and deeper into the land of Mordor to Mount Doom in\norder to end Sauron's reign once and for all.<br><br>This is probably the best film of the trilogy, I can see why it raked\nin the awards, the only weakness was the epilogue once the quest was\ncompleted the film could have ended at the crowning of the king rather\nthan going on to their return to the Shire... even though I'm aware\nthat this was in the book. Peter Jackson did a fantastic job bringing\nsuch an epic story to the screen, he was of course assisted by a\nfantastic cast who really brought the characters to life.\n"},
{"review": "\n\"The Lord of the Rings: Return of the King\" is the third and final\ninstallment of Peter Jackson's adaptations of Tolkien's famous fantasy\nnovels. Once again the makers of the film have taken care with the\ncostumes, sets, scenery, models, CGI effects and Howard Shore's epic\nscore to create a convincing depiction of Middle Earth.<br><br>Once again the cast delivers expert performances. John Noble joins the\ncast as Denethor and effectively makes him into a despicable and\nrepugnant character. Three of the performances in the film were\nparticularly memorable for me. Bernard Hill once again brings authority\nto the role of King Theoden and his inspiring presence on the\nbattlefield left me in awe. Miranda Otto brings strength to the role of\nEowyn and makes the character's best moments unforgettable. Ian\nMcKellen once again brought his commanding presence as Gandalf to bear\nas he tried desperately to hold everything together.<br><br>This film follows the familiar format of the first two films in taking\nTolkien's work and streamlining it to create a well-paced film. The\nfamous battle at Minas Tirith is on an unprecedented scale and the best\nfantasy battle ever filmed. As with the first two films, I found the\nadded scenes for the extended addition interesting, but they didn't add\nmuch above and beyond the already great theatre cut.\n"},
{"review": "\nas you see in the title, you can see it was a great film. i have only\nhad the DVD for 2 weeks and i got a 2 disc DVD for £2.99. wow you might\nthink.<br><br>well back to the film, and this is a film whose without its amazing and\nstunning fights/wars, would be a OK film but wouldn't be a classic.\nwhen the battles begin, you can't stop watching- even if your mum asks\nyou to tidy up. the scenes with the horses and their warriors galloping\nis breath taking and makes you want to re enact it as i'm a 13 year old\nboy, this was a film which you want to re enact and talk about. <br><br>it fills you with thrill which is a very special thing to do. when\npeople saw this, people were like, \"wow what an amazing film!\" and\n\"it's so good, i want to see it again and again!\" <br><br>i think this film was done by the right people and acted by the right\npeople you couldn't image anyone for the roles. Such as aragon's\ncharacter, Viggo Mortensen matchs that style and his emotions were\namazing. his fighting style and knowledge makes him a great character\nand Viggo Mortensen should of good a dozen awards. before this film, i\nnever heard of Viggo Mortensen and now after his role, i regard him as\na brilliant actor.<br><br>another character who was amazing was gandalf and without him, this\nfilm would feel empty. sir ian meleken (sorry for the spelling\nmistake), his acting was so believable and amazing. but his secret to\nthis as revealed in a episode of extras, his that he thought of what it\nwould be like to be a wizard and well, that give us the great gandalf\nwe know today! i think this film is the best film i have seen in years\nand it deserved every award. out of ten, i would give this a MASSIVE\nTEN! thank you!\n"},
{"review": "\nLord of the Rings-The Return of the King is surely the greatest movie\never made. <br><br>I consider that is has the most fascinating plot ever written.The\nuniverse of the movie is unique: a fantastic world which includes\nalmost every mythical creature we heard of.\nElves,orcs,trolls,hobbits,all these make up a charming atmosphere.<br><br>The idea of a Ring that can submit the will of it's bearer is surely\nunique is recalls all throughout the movie.Also, the love story between\nAragorn and the immortal Arwen is the most original one seen in the\nentire history of movies. The fate of king Debethor reminds us of Greek\ntragedies and the film contains great moral learnings,most in the words\nof the wizard Gandalf.<br><br>The fantasy and the charming, sublime atmosphere make me consider this\nmovie the greatest work or art ever created by mankind.\n"},
{"review": "\n\nIn Return of the King - which follows the book (that I have not read, though\nheard what is in it that is not in the film) as close if not closer than the\npast two - co-writer/co-producer/director Peter Jackson brings Tolkien's\ngrand tale of the quest to destroy the ring to an end.  The story strands\nfollow along the similar linear paths of the others, and it is done so with\nan equal worth in entertainment.  Frodo, Sam and Gollum's path to Mordor\nunfolds as almost something of a love triangle for the ring; Merry and\nPippen follow their own tales towards the great battle; Gandalf, Aragorn,\nLegolas, Gimli, and all the dwellers of middle earth prepare for the swarm\nof the terrors of Sauron.  <br><br>There is much praise that should be given to Jackson and his crew/cast on\nnot just the worth of Return of the King, but to what is now the entire saga\nof the Lord of the Rings as a whole.  Though the film does carry quite a\nload to it (at three hours and twenty-one minutes it's the longest of the\nthree in theatrical form, and it definitely does go on at least ten to\nfifteen minutes longer than it should), and expands and deflates on the\ndetails of some characters (i.e. Saruman is nowhere in sight in this\nversion, while Arwen gets more than what is from the original work), there\nare plenty of rousing scenes and sequences, terrific battles, and a grasp on\nthe visual effects as a whole that don't let up.  In all, ROTK is on the\nlevel with Fellowship and Two Towers, making the parts as good as the whole.\n This is something that only several other filmmakers can make a claim to,\nthat one film does not bring on a let down from the expectations that\npreceded it.  It's the kind of film I'll want to see again, however it would\nbe very difficult to sit through it in one place.  Grade: A (both as a\npicture in and of itself, and overall on the three epics\ncombined)\n"},
{"review": "\nIt's REALLY good. Every single thing about this movie is cool. It's my\nnumber one favourite movie of all time. ( Well actually, the entire\nTRILOGY together is my favourite number one movie of all time. )\nThere's no swearing or nudity. I still don't recommend it for the\nyounger audience because there are some slightly frightening scenes,\nthough. But anybody over eleven shouldn't be bothered. I don't\nrecommend it for arachnophobia, because it might give them a heart\nattack. Anyways, this movie has an excellent beginning and a wonderful\nending. And everything in the middle is great, too. BY ALL MEANS RENT\nIT, but make sure you watch the two first movies first.\n"},
{"review": "\nTruly a masterpiece. This film was more than worthy of its 11 Oscars.\nThe fellowship was stunning, the two towers was inspiring but the\nreturn of the king was truly the greatest film i have ever seen. The\nthing that is most amazing about the return of the king is that it\nfills the jigsaw of its predeceors and does it with such epic granduer\nemotion, and inspiration that i know very few people who were not\namazed by it. I myself have read the Lord of the Rings by Tolkien and\nin light of this can say that this film has to be one of the\nadaptations in recent times. Peter Jackson, I feel simply could not\nhave done a better job in using the beautiful new zealand landscape to\nportray Tolkien's vision.<br><br>Without a doubt the speech, roars and sheer numbers of the rohirrim at\nthe pellennor charge in the sunset is truly the greatest sequence of\nfilm i have ever seen. People say the ending is too long, I say it was\nperfect as it gave a heart felt and fitting deneaumont, and ended a\ntruly remarkable trilogy that will not be soon forgotten.\n"},
{"review": "\n\nFirst, let me say that I did like \"Return of the King.\" It's a special\neffects masterpiece that is destined to become a classic, along with the\nfirst two installments in the \"Lord of the Rings\" saga.<br><br>But, to me, it was far less enjoyable than the first two films, the second\nof which was the best of the three. <br><br>\"King\" was far too long for what it had to say. And the ending (or should I\nsay endings) really disappointed me. I kept waiting for the film to end, but\nit just kept going on and on. There were at least four times that I thought\nthe film was over, but then the next scene would fade in. It would have been\na much better ending if the film had finished with the resolution of the\nfinal battle, and then showed the denouement as a montage next to the\nclosing credits. It would have removed about 20 minutes from the\noverly-lengthy film and would have made the ending less of a \"cut-and-paste\"\nstyle.<br><br>So I'll give it a solid 7. But to me, it has been seriously over-rated by\nboth fans and critics. I'm surprised that more of the critics, at least,\nhaven't picked up on the weak ending.\n\n"},
{"review": "\n\nHow superb 'The Return of the King' is. It is the ultimate fantasy film\nand\na sure bet for all the film awards this year. Director Peter Jackson has\nachieved the impossible, to make this trilogy and make it so that Tolkien\nfans will be pleased with it in comparison to the book. The special\neffects\nare amazingly good, the actors (Sean Astin who play Samwise Gamgee\nparticularly) are fabulous in their roles and the plot is unflawed,\nrepresenting the book perfectly. There are parts left out but this was\nalways to be expected. Peter Jackson, on first editing the film had a 6\nhour\nlong film that he was happy with. Now, although us Lord of the Rings fans\nmay have been more than happy to sit through that, I don't think others\nwould have been! So inevitably pieces and lines from the book have been\ntaken out. But what we are left with is a film that works perfectly and\nis a\nmasterpiece. Undoubtedly there will be plenty of extra footage on the\nextended DVD and so we'll just have to wait for that to see the film in\nits\nentirety. It's, arguably and in my own opinion, the best of the three\nfilms\nand one that fans and just movie-goers will love. It's got action,\nromance\nand an ending that leaves us satisfied and wanting to see it again and\nagain. Go and see it now!\n"},
{"review": "\nI think that almost everything that can be said about this trilogy has\nbeen said already, but still I will try. There are so many films that\ndestroyed the beauty and perfection of the novels they have been built\nupon, not this one. In front of an amazingly beautiful scenery, Peter\nJackson was able to create a fantasy-movie, which unlike so many others\nbefore did not deal with old clichés and thus is far away from any\ntrash-movie a lot of people had expected it to be beforehand.<br><br>Although I am sure that the cast of this film will soon be forgotten,\nThe \"The Lord of the Rings\"-trilogy will stand the times and be one of\nthe most renowned pictures of the las decade.\n"},
{"review": "\nThe third part in Jackson's trilogy based on the novels of J.R.R\nTolkien, picking up shortly after the second one left off. This\nextraordinary film begins with Frodo(Elijah Wood), Sam(Sean Astin)\nalong with Gollum/Smeagol(Andy Serkis) continuing the travel towards\nMount Doom, the only place where the Ring can be destroyed. Frodo and\nSam care the Ring in order to keep it from falling into the hands of\nits evil creator. Meantime Gondor is invaded by the Orcs of Mordor and\nGandalf(Ian McKellen) and Pippin(Billy Boyd) ride to Minas Tirith.\nThere rules Denethor(John Noble) and father of the deceased\nBoromir(Sean Bean) and Faramir(David Wenham). While Aragorn(Viggo\nMortensen) must to chose among his two lovers, Eowyn(Miranda Otto) and\nArwen(Liv Tyler). Aragorn along with Legolas(Orlando Jones), and\nGimli(John Rhys Davies) travel to the creepy caves inhabited by the\nArmy of the Dead.<br><br>This sensational epic adventure is plenty of action, impressive\nbattles, spectacular drama and is pretty entertaining. Film packs a\nreal sense of wonder and stimulating action set pieces illuminating the\nfull-blown feats of the various protagonists and wind up an overlong\nbattles and a stunning finale. Contains an incredible array of\ntechnical visual effects by Weta Digital and Weta Workship among other\nCia. Sensational cinematography by Andrew Lesnie and spectacular and\nsensible musical score by Howard Shore, winning deserved Academy Award.\nBeautifully realized set design with phenomenal production values. The\nfilm provides enough amusement during the three and half hour and stays\ncloser to the novel than any of the former adaptations-mostly animated\nand low budget- such as the mediocre effort by Ralph Baski. The motion\npicture will like to Tolkien followers as the neophite who didn't have\nseen the previous parts and those unfamiliar with the lengthy literary\nwork. Magnificent direction by Peter Jackson bringing stunningly the\nimaginary world and mythology of Tolkien to life.\n"},
{"review": "\n\nThis movie, the conclusion of Peter Jackson's epic film series based on\nthe\nTolkien novels of the same name, was fairly good on the whole. However,\nhaving read the books beforehand, I was disappointed at several aspects of\nthis movie.<br><br>1. The Pyre of Denethor. This was my favorite scene in the book, but PJ\nmangled it. Instead of having Denethor kneel down on the pyre with his\npalantir, he leaped off of a battlement. This, while hilarious, was\noutrageous also. It was funnier than most parodies, and that's bad. It\nalso\nseemed rushed, whereas in the book, time was taken.<br><br>2. The Wild Men. I don't know why, but this exclusion got my goat. I guess\nI\njust liked the Wild Men, Ghan-Buri-Ghan saying \"Kill gorgun!\" and the fact\nthat they still used a few big words. Maybe I'm just a\npurist.<br><br>3. The Mouth of Sauron. His exclusion irritated me also, and I hear it\nwill\nbe on the EE (Extended Edition), so I guess that's something to look\nforward\nto.<br><br>4. SARUMAN! Why, oh, why cut his scene? Wormtongue as well. Those were two\nof the best characters! 'Nuff said.<br><br>5. Orcs. I was disappointed with the portrayal of the orcs, especially\nShagrat and Gorbag (who are never called by name, along with Grishnakh and\nUgluk from TTT). It seemed as if every orc line was yelled. Can't an orc\nmerely talk? Shagrat and Gorbag were, again, two of the best characters.\nTolkien's orcs were surprisingly sophisticated, and here they are reduced\nto\nyelling, angry simpletons. They even discuss post-war plans in Tolkien.\nTherefore, it was disappointing, except the cockney orc in TTT. \"Why\ncahn't\nwe 'ave some meat?\"<br><br>6. Eowyn and Faramir. The love story is gone, and Eowyn is not as\ndisguised\nas she should be (in the Battle.) Obviously it was filmed but cut, since\nthe\ntwo look at each other at Aragorn's coronation.<br><br>So, it was a good movie with a few flaws.\n"},
{"review": "\nEven after the second installment's grand success, I was still afraid\nthat it will fail. The trailer was brilliant and promised a thousands\nthings to come. And then in the next 3 and a half hours, I was proved\nwrong!<br><br>This was the best conclusion to a great trilogy. I never imagined that\nthey could make it bigger and better than the last two. The previous\nmovies were just picnic. Not only the action sequences but also the\nemotions run high. The battle scenes were really great. But I was more\nconcerned about the people we knew from the last two films who were in\nit. <br><br>You really get that feeling of \"The Return\". Unlike the first two, this\nmovie is stylish. The elements are more elegant, the story more bold,\nthe score more experienced and bold and the dangers more troublesome.\nAs Frodo and Sam march towards Mount Doom, the movie gets more darker\nand hope really seems to fade away. One thing I learned in this movie\nis: Never give up. No matter what happens you have to finish the task\nbecause your cause is important. <br><br>For me and all the LOTR fans, this is not a movie. What we thought of\nas an action movie-of-the-week turned out to be an important lesson on\nhope, friendship, conquering your fears and love. It's a cinematic\nachievement that will never be defeated. This really is the king of all\nmovies and the 11 golden statues prove it. Go for it (Only if you have\nseen the first two movies) <br><br>10/10\n"},
{"review": "\nThe hobbits approach the slopes of Mount Doom, preparing to dispose of\nthe cursed Ring, while the forces of good and evil are rallied in\nanticipation of the ultimate battle. The film won the Academy Award for\nBest Picture, the only time in history a fantasy film has done so.<br><br>The Return Of The King is the longest of the three films, which suffers\nfrom having to cut between disparate story strands, and - in its final\nhalf-hour - stacks up endings one after the other, like jet planes\nwaiting to land, the director visibly reluctant to let these characters\ngo. Most audiences will forgive Peter Jackson for that, for this is a\nfitting conclusion to a series of films made with tremendous artistry\nand affection for their subject; thrilling spectacle is underscored\nwith palpable human drama, and it finally becomes clear why J.R.R.\nTolkien's books continue to ring such bells so loudly in the lives of\nso many.\n"},
{"review": "\nI haven't read anything by Tolkien. It is a great credit to these\nmovies that you can watch all three without needing to have taken in\nthe novels beforehand. This is an excellent end to an incredible\ntrilogy. The plot is engaging from start to finish, and this moves\nrather smoothly, with great pacing. This is funny several times, and\nthere is very little of the annoying(and still easily ignored) comic\nrelief. I am thrilled to see Gollum turn out to be such a richly\ndetailed and thoroughly developed character. The meld of live-action\nand CGI elements is perfect. You forget that not everything you're\nseeing is really there. The effects are impeccable, in general, and the\nimaginative designs, and boundless creativity are amazing. Creepy and\ndark, this isn't actually depressing, in spite of many gloomy moments.\nThe battle sequences are intense, well-choreographed and awesome. This\nhas astonishing editing and cinematography, and has a marvelous look.\nThe acting doesn't let you down at any point. There is a lot of scary\nand disturbing content in this, and it might be too much for children.\nI recommend this to any fan of the fantasy genre, and, really, everyone\nwho enjoys an appreciation for the medium of film. 10/10\n"},
{"review": "\n\nI knew it would be good, but this takes the entire cake.  Peter Jackson\nhas\nabsolutely\noutdone himself with this masterpiece.  True, there are a few tiny holes\nin\nthe plot, but they\nare easily overlooked.  Even if you're not a huge fan of Tolkien, you\nshould\nreally make an\nattempt to see this movie.  I wasn't a fan of the books, but Jackson's\nmovies have inspired\nme to pick them up and give them all a good read.  Can't wait for the DVD.\nLet's see if\nJackson does as good a job with The Hobbit.\n"},
{"review": "\n\nThis movie is the best of everything, the charaters are the best with each\nother and their environment.  You have to love the pros, as well as the\nantags.  This movie as one reviewer once said of this movie, it is the best\nmovie of this generation! The saddest part, it is the last movie.  The only\nthing I have to say that was a downer, it needed more epic battles! So, my\ntop 5 have now changed: 5=Scarface,4=Matrix,3=Lord of the Rings\n3,2=Godfather,1=Citizen Kane.<br><br>\n"},
{"review": "\n\nAn adventure movie to match the great ones of the past, and the one to beat\nfor the future. The culmination of this ambitious trilogy is more than\nfitting; it surpasses the first two films by quite a distance. Almost\nnothing disappointed or bothered me. All parts of the story were equally\ninteresting. It was sweeping, it was involving, it was beautiful. One of the\nfew thing I would complain about is the villain. Sauron is boring and more\nor less unseen. He does not feel very threatening. And his army of orcs has\nbeen dull since the first film. They're just not very interesting creatures.\nFortunately, The Return of the King really makes up for these monsters with\na gallery of better ones. Some of them have been present in the other two\nfilms, trolls and those flying dragons that the ring wraiths ride on.\nThey're more present here, however. Even better, though, those gigantic\nelephants, ten times the size of a normal one. Oh, man, those are cool. Star\nWars fans might grumble that they were too much like the AT-AT walkers from\nEmpire, and they are. One scene where Legolas, the elf, triumphs over one of\nthem feels like a sped up version of Luke Skywalker's attack. But the very\nbest thing is a giant spider. Everyone knows that there was originally a\ngiant spider on skull island in King Kong, cut from the film because it\nreally disturbed a test audience. Seeing the spider in Return of the King is\nlike having that famous piece of lost footage restored. When all three films\nare finally out on their special edition DVDs, I'm going to spend a month\ncombing through them to see whether or not the entire series of films isn't\njust as good as this one, or perhaps as good as many of my younger friends\nhave sworn they were.\n"},
{"review": "\n\nWarning contains spoiler.<br><br>Five years of anticipation and delight are finally over, from the first\nhints of a cinematic version of the Lord of The Rings to the release of\nthe\nReturn of The King and I have been enthralled by it all.<br><br>However, I was amazed that there was no hint of the Houses of the Healing\nepisode or Faramir's romance with Eowyn. Having taken such care to develop\nher character (brought to life so wonderfully by Miranda Otto)in TTT and\nRoTK it seemed criminal to leave her on the battlefield - except for a\nbrief\nglimpse at the end, all smiles next to Faramir as the man she adored\nkisses\nanother woman! My husband (who has not read the books) left the cinema\nproclaiming \"I don't know what she was laughing about, I thought she was\nsuicidal\" leaving me to fill in the missing pieces.<br><br>One or two minutes less of Frodo's doleful expression might have allowed\nfor\na brief glimpse of the two of them together whilst Aragorn et al marched\non\nthe Black Gate or even a shortening of the return to the Shire and journey\nto the Grey Havens - for heaven's sake get on that boat! I can only hope\nthe\nmissing parts are in the extended dvd. \n"},
{"review": "\nI've just re-watched The Lord of the Rings trilogy for the 1000th time\ntonight... nearly 15 years since the Fellowship of the Rings was\nreleased... I still haven't seen a movie that's better, nor close, to\nany of these three films. The casting is perfection as well as the\nincredible acting by everyone in the movie. I can still watch these\nmovies back to back and not get bored. They are a light to this world\nand wouldn't be the same without them.<br><br>I miss the good old LOTR's days. The best movies ever created. The\nReturn of the King was the best way to end a thrilling journey through\nmiddle earth!\n"},
{"review": "\nIf you want a movie which you can watch many time this movie defiantly\nfor you.<br><br>watched this movie plenty of time and never get bored. watched this\nmovie in 2008 First time and get felt on it. my friend not like to\nwatch Hollywood movies but my choice are different from them. often\nlike watching movie. movie have nice story + every character has their\nown important.<br><br>should also watch 300 movie I'm not big big fan of science fiction\nmovies so not much like. friend this was my if you want to watch this\nmovie you will never be disappoint so you should defiantly go for watch\nthis movie this is my personal though.\n"},
{"review": "\nThis movie and the whole trilogy deserves all the praise it has\nreceived.<br><br>I had been worried about seeing it because of how much Peter Jackson\nre-wrote \"Two Towers\" and presented scenes that undermined some of\nTolkien's fundamental ideas. This time, Jackson followed Tolkien more\nclosely and the worst that can be claimed are sins of omission. It's a\nreal shame we didn't get to see Christopher Lee in this move; he\ntotally rocked in the previous films. Telling us to wait for the\n\"extended\" version isn't right. Maybe Jackson should have foregone one\nof the too many endings in ROTK to give Lee some film time. That said,\nall the elements that worked in the previous movies were absolutely\nglorious in this film. The one new thing that I would add to so much\nthat has already been written is that big kudos must go to the great\nTolkien artists Alan Lee and John Howe whose artistry shaped so much of\nthe imagery from the first moments of FOTR to the final scenes of ROTK.\nThis historic trilogy would not have been the same without them. The\nLOTR enterprise has clearly been a great labor of love from all who\nworked on it over the years, and this final installment was a crowning\nachievement.\n"},
{"review": "\nI suppose that someone, sometime, may tell the story more accurately\nbut I doubt very much that it will ever be told better. Nothing could\never replace the books for pure escapism but Peter Jackson has managed\nto evoke both the feel and texture of Tolkien's masterwork without\npandering, too much, to clichéd Hollywood extravagance. The cast are\nsuperb (if Sir Ian Mckellen is remembered for nothing else other than\nGandalf I feel sure he would not complain), the cinematography stunning\nand the pace, even over the 8/9 hours for the whole trilogy is\nmatchless. For those who have read the books (as I have for many years)\nI would suggest watching once to get all of the niggling storyline\nchanges/omissions out of your system then just watch as a pure,\nwonderous, unadulterated piece of epic, EPIC cinema. I'm sure I will\nlove it forever.\n"},
{"review": "\nThe third and final installment of the Lord of the Rings trilogy comes\nto life bigger, and bolder than the first two. Director Peter Jackson\nand company held nothing back when it came to CGI, special effects,\ngorgeous landscapes, and breathtaking cinematography.<br><br>Fans most familiar with Tolkien's famed novels would take note of\nchanges made in the interest of keeping the film short (as with it's\ntwo prior films), but he stuck close enough the main story and brought\nit to its destined conclusion. He didn't water down the scene where\nFrodo finally gets to Mt. Doom in order to get rid of The One Ring once\nand for all\u0097in fact it packs quite the punch. The way that scene was\nintermingled with the battle footage heightened the emotional level of\nthe scene as well as the excitement.<br><br>The actors deserve praise as well. Viggo Mortensen reminds us of what a\nhero truly is, with his performance as Aragorn, the man who would\nbecome King of Gondor. Sir Ian McKellen reprises his role as Gandalf\nthe White, bringing the Wizard to life as if he popped right out of the\npages of Tolkien's novels. Elijah Wood draws us in with his portrayal\nas Frodo\u0097Sorrowful, and weary of his travels and all of the trials he'd\ngone through along the way. Other noteworthy performances include those\nof Liv Tyler, Cate Blanchet, Miranda Otto, Dominic Monaghan, Billy\nBoyd, Hugo Weaving, etc.<br><br>I highly recommend this film (as well as it's predecessors) to anybody,\nregardless of whether or not you've read the novels. Of course the\nbooks are better\u0097they always are\u0097but the movies are an excellent\nadaptation of Tolkien's wonderful tale.<br><br>This film is clearly worthy of the many Oscars it has won.<br><br>I easily give it a 10/10.\n"},
{"review": "\nThe Return of the King is the third and final film in the Lord of the\nRings saga. Peter Jackson's portrayal of the film is a masterpiece in\nan already stunning trilogy. ROTK is an epic tale of sacrifice,\ncourage, and friendship. Frodo and Sam's journey to Mount Doom is scary\nand filled with heart breaking moments of triumph and defeat. Elijah\nWoods once again portrays Frodo wonderfully as well as Sean Astin. The\nrest of the fellowship are very good in all of their scenes, especially\nViggo Mortenson and Ian McKellan as Gandalf. Visually the cities and\nbattles are simply fantastic and very realistic. This has been a long\njourney of film starting with the Fellowship 2 years ago and now it has\nended wonderfully.\n"},
{"review": "\nWhat can I say about this third opus of one of the most memorable\ntrilogy of all time ? Everything, really. I remember seeing this movie\nin the theaters, in 2003 (already, time flies).<br><br>This film hasn't aged a bit. OK maybe a little for the special effects\nbut I'm just quibbling. It's more than that. The Return of the King\nconcludes an epic journey for the Trilogy but also for movies in\ngeneral.<br><br>Peter Jackson's directing is stunning from A to Z. Howard Shore's music\nis just timeless. Everything is synced perfectly. The actors, the\nstory, the action, all those epic battles. Everything put together is\njust a global and magnificent mix.<br><br>This film and this trilogy have literally everything someone would want\nin it.<br><br>I can't enough of The Lord of The Rings. Even 15 years later. It's\nstill my number 1 movie.<br><br>If you are still one of the few people who hasn't yet seen this trilogy\nor this third movie, just go now !\n"},
{"review": "\nbefore i saw ROTK in theaters, i had no idea what the big deal was. i\nremembering seeing the first 2 on VHS years ealier and enjoyed them,\nbut never really GOT into it. however, that all changed when i went\nwith my mom to see ROTK in theaters one day......and i was changed. i\ncried! i laughed! i felt moments of terror, i FREAKED when frodo fell\noff the cliff with gollum....only he didn't fall in! it gripped me like\nno other movie has since! and it instantly made me a fan. now i am a\nrings maniac, all due to this film. i will admit, fellowship has since\nbecome my favorite, but i will never forget the experience of ROTK. the\nbattle scenes were gorgeus and epic, and it was just so GREAT! i\nwaitied for an entire YEAR for the extended version on DVD with baited\nbreath! i read all 3 books that summer (and they were actually like the\nfilms were! talk about faithfulness)! the ending made me and my mom cry\nbuckets! stunning, absolutely stunning.\n"},
{"review": "\nThis movie is magical! I liked the first and the second part a lot, but\nthis was éven bétter! It's one of the best movies ever made! Everything\nabout this movie is excellent: The special effects, the acting, the\nmusic, the cinematography,... Peter Jackson is an excellent director!\nThis movie is a fantasy film that relies heavily on special effects,\nbut you don't notice anything fake. The special effects have been\nexecuted perfectly! But this movie has more to offer than only special\neffects. The music is very good an contributes a lot to the atmosphere\nof the movie. A beautiful scene is when Pippin sings a song! Also the\nacting is very good! This movie is sometimes very moving. The battle\nscenes are very well done and the movie is very exciting a some\nmoments. The direction by Peter Jackson is amazing, he combines amazing\nspecial effects with very good acting, emotions, suspense and beautiful\ncinematography (the scene at Mount Doom is, in my opinion, one of the\nbest scenes in movie history). I don't think I have to say more about\nthis movie. This movie is exquisite! If you haven't seen it, see it as\nsoon as possible! You will be amazed!\n"},
{"review": "\nThis movie has everything the final chapter of a trilogy needs it is\nabsolutely amazing in every single aspect that i am finding it tough to\neven find one fault in it. The acting was astonishing right down to the\nall the bad ugly looking creatures,absolutely amazing special effects\nand Peter Jackson deserves one big round of applause for this filming\nmasterpiece. In this movie Frodo and Sam(Astin and Wood) did amazing\njobs considering to their roles and kept their friendship going and\nmerry and pippin also played their roles amazingly well when they were\nhanded bigger roles in this third and final installment of the\ntrilogy.Bloom,Davies Reprised their roles exceedingly well and there is\nno movie at all without Aragorn(Viggo Mortensen).he did everything\npossible needed of him and he met each and every one of those\nexpectations great job done their. Ian Mckellen also does a very good\njob and there was no movie if it was not for the special effects the\nbattles were astonishing in this movies which makes me want to keep\nwatching the movie over and over again. All said and done this is the\nfinishing touch to an absolute masterpiece and the final block of the\npuzzle to The Lord Of The Rings Trilogy.The acting was made to\nperfection and if i was given the chance i will praise this movie over\nand over again together with the previous two movies. This movie\nprovides entertainment to every person around and it deserves the\ncredit it gets. Overall i will give this movie a 10/10. An\nunforgettable masterpiece in my opinion.\n"},
{"review": "\nI think this movie is the best!!!! It had the best special effects I've\never seen, also the best actors who played their role really well. It\nalso had a great background music which I totally loved. This movie\nreally deserved all the Oscars they have won :) All the scenes in the\nmovie made a great representation of Tolkien's stories. I definitely\nwas captured all the landscapes in the movie, New Zealand rules! If\npeople haven't seen it, they should because its really entertaining. By\nnow, I've seen it like 20 times or so. The dialogue in the movie are\nreally complex, which made me think a little, at least for me, its\ngood. Everyone must at least see one of the 3 because they all are\ngreat.\n"},
{"review": "\nIf there was a rating higher than ten, this is the only movie in the\nworld that deserves it. I say this with all seriousness. I loved this\nmovie. This movie has everything anyone could ever want. Tolkien fans\n{I am one myself} and everyone else, will not be disappointed. For the\nvery few people left by now who haven't seen this movie, DO SO\nIMMEDIATELY! :] Lord of the Rings is a beautiful work of literature,\nand the movie comes near to matching its brilliance. In the short\ndocumentary entitled \"Ringers, Lord of the Fans,\" someone says that the\npower of Lord of The Rings is almost spiritual, and I agree. Pete\nJackson definitely captured the magic of the books, and you don't want\nto miss it.\n"},
{"review": "\nThe Fellowship makes its final path through war and wilderness. The\nstory comes to an 11 academy award winning climax. The movie has a\nstunning power unlike the other two. Peter Jackson uses incredible\ninsight into sstories and themes and character study. The Return of the\nKing culminates its three story lines unimaginably. As the characters\nfinish what is a three year journey you see exactly why Peter Jackson\nmade the fellowship and the two towers because he wanted to arrive at\nthis incredible finale to what is a career trilogy. I enjoyed this film\nfor two main reasons action and intimacy. The action is stunningly\nrealized by weta workshop. But even though the action is great at the\ncenter of it is what is a wonderfully intimate story. As Frodo and Sam\nmake their way to Mount Doom we really get to see them both rise to the\noccasion. We see the real power of friendship as Gollum continues to\ntry to break it. When Aragorn and Gandalf arrive at over 600.000 orcs\nand yet they stand as strong as they were at Helm's Deep. I become more\namazed as the tale goes on we see how difficult and at what price will\neither side win. The feelings of community within us. This is a classic\nand whoever watches will not be disappointed. 10/10\n"},
{"review": "\n\nThe Final Chapter of this great trilogy will just rip your heart out of\nyour\nribs! I don't know how Peter Jackson did it,and perhaps sucha masterpiece\nsuch as this has the right not to be questioned. I loved the first movie,\nits steady pace of adventure is non-stop, the characters are loveable, the\ncostume is nice, the settings are stupendous and the Visual effects is\nJaw-Dropping. And I loved the second even better with the Battle of Helm's\nDeep finally winning over my breaking heart with the Two LOTR Movies\nalready\ngnawing at the bottom, I had to say a final farewell to Star Wars 4 &amp; 5\nand\nwelcome The LLord of the Rings. And with this, my heart is fainally\ncomplete. The MArmaluks are unstoppable and Visually Great!!! No words\ncould\ndescribe the intensity of their presence alone. And the Battle of Pelanor\nFields will get you to want to wish you were there yourself, and not as an\norc (Though Trolls are Cool! Though pales in comparisson with the Mass of\nUndead and, of course, the Oliphaunts.) Gollum is once again as great as\never and The rest of the cast are comendable, with great praises going to\nbe\ndue to Gandalf and most especially Sam! The emotional intensity of the\nfilm\nis a full ten! And after you cry from the movie's story, you'll cry about\nwhy oh why wasn't it any longer!!! And indeed, we must now bid a final\nfarewell to our dearest, The Lord of The Rings Trilogy, the only Trilogy\nto\nhave a complete set of Movies with no equals but each other. Good\nbye........ sorry, I just don't wanna leave it alone....\n"},
{"review": "\n\nI went to the cinema last night...and WOW!<br><br>I've got to read the books again some day (third time). Can't wait for\nthe\ndirectors cut version :-)<br><br>If you haven't seen it yet...then WHAT ARE YOU DOING???\n"},
{"review": "\n\nUsually I don't want to see a movie more than once in a theater let alone\na\nmovie this long.  But I just want to see it again, as well I can't wait\nfor\nthe extended version to come out on DVD.  However i know that it will be\na\nwhile with how good and popular it is. \n"},
{"review": "\n\nA brilliant and stunning movie with special affect used to the\nmaximum.Funny\nhow Frodo is the main character burdened with ring,but Sam turns out to be\nreal hero.I thought the Gollam character brilliant.The way his personality\nchanges.One second sinister and the next all loveable,allbeit\nugly.Generally\nall the characters acting was very good and believable.The battle scenes\nwere slightly prolonged but all in all a excellent movie.\n"},
{"review": "\n\nThe anticipation leading up to this culminating epic only made it that\nmuch\nmore spectacular when this movie delivered on it's amazing hype. This is\nundoubtedly one of the most powerful and well-directed epics I have ever\nseen. I was amazed with the cinematography and the brave journey into the\npsyche of Gollum/Smeagol. Mortensen was a lot better in this movie than\nthe\nother two, and the same can be said about Elijah Wood and Sean Astin. The\ndevelopment of their relationship is particularly moving. The only\ncomplaint\nI have about the movie is the drawn out ending. I'm not familiar with the\nbooks so I'm not exactly sure if this was necessary. Oscar gold should\nfinally come to Lord of the Rings in the major categories (Director &amp;\nPicture) &amp; it should reprise it Cinematography win from 2002. This is an\nabsolute must see.<br><br>-James\n"},
{"review": "\n\nI have enjoyed the LOTR trilogy as much as anyone, but the computer graphics\ngot a bit out of hand for my tastes in this one.  The sets are fantastic,\nbut they could've worked a little harder on the special effects to make them\nseem a bit more real.  Aside from that, I wonder how someone can easily\nbreath sulfur gas, wonder why stories must be so tidy, and remember that\nintermissions are a good thing.  I loved the film, but a few things make it\nless powerful than the first (which I rank the best of the three), but a\nmagnificent film and story, nonetheless.  Bring dinner and a pillow.  8 of\n10\n"},
{"review": "\n\nI have enjoyed the LOTR trilogy as much as anyone, but the computer graphics\ngot a bit out of hand for my tastes in this one.  The sets are fantastic,\nbut they could've worked a little harder on the special effects to make them\nseem a bit more real.  Aside from that, I wonder how someone can easily\nbreath sulfur gas, wonder why stories must be so tidy, and remember that\nintermissions are a good thing.  I loved the film, but a few things make it\nless powerful than the first (which I rank the best of the three), but a\nmagnificent film and story, nonetheless.  Bring dinner and a pillow.  8 of\n10\n"},
{"review": "\n\nAll has been said before but here goes: ROTK is an excellent end to the\ntrilogy. It had several heart-lifting moments, and I found myself holding\nback tears. Magnificent performances (especially Bernard Hill, Sir Ian,\nViggo), perfect and well-blended special effects and true (enough) to the\nbooks screenplay.<br><br>My favorite parts:<br><br>-Aragorn challenging the dead people: he truly showed his kingly nature\nthere.<br><br>-King Theoden's speech to his riders just before they attack and the way\nhe\nrides before them and touches their spears with his sword. Yet another\nking!<br><br>-Gandalf's and Pippin's conversation about death. Overall Merry and\nPippin\nwere great.<br><br>-Amazing ahots of Nazgul flying and attacking people and\nhorses.<br><br>-Sam and Frodo<br><br>-Every time Aragorn or Gandalf pronounce \"Mordor\" or \"Minas Tirith\" -\nthey\npronounce it almost as it would be pronounced in Finnish.<br><br>Minor gripes:<br><br>-Some timing issues: Pippin runs up and down Minas Tirith to reach\nGandalf\nor to serve Denethor. The city is quite high for doing this fast!<br><br>-Sam and Frodo are far from the Mount Doom when Aragorn and the remaining\nsoldiers arrive to the Gates of Mordor.<br><br>-The mumakil-fight: though cool, it still was an unnecessary addition to\nthe\nstory. And it never looks real enough when someone is standing on a\nlarge,\nrunning cgi-beast.<br><br>-The endings... Though I understand and appreciate the effort to close\nthe\nstory properly, I found myself waiting the movie to finally end.<br><br>But to sum things up: Absolutely a fantastic movie of a fantastic book.\nMy\nsecond favorite of the trilogy, FOTR (EE) being the best (as it was the\nbest\nbook also). Waiting for the extended edition!<br><br>Rating 10/10<br><br>Thank you PJ and every one else participating the process!<br><br>\n"},
{"review": "\n\nThe Lord of the Rings trilogy will certainly go down as a masterpiece\noverall.  The third installment picks up where the second left off.  There\nare battle scenes colossal enough to make it a classic.<br><br>Spoilers: Both for the review and the film.<br><br>What I didn't like was the lack of suspense.  It seemed certain throughout\nthe whole movie that Frodo would complete his mission.  Not a single\nheadliner dies.  Frodo loses a finger in a scene and then later we see his\nhand undamaged.  <br><br>Even worse is the slow motion homoerotic scenes with Frodo and his Hobbit\nbuddies lolloping in bed together with Gandalf and the other humans looking\non gleefully.  I almost thought it was some kind of a joke it was so\ngaudy.<br><br>While these flaws dilapidate the movie I can't say they totally ruin it.  If\nI ever see it again I won't stick around for the last drippy\nmoments.\n"},
{"review": "\n\nThis is the best movie I've ever seen in my whole entire life. This is the\nbest movie of the whole trilogy. I loved it. The movie is simply wonderful\nand breathtaking. I love the scenary, special effects, strong acting and\nplot. I loved the battle scenes, those were awesome! I can't wait for the\nextended edition dvd. This movie just rocks. You've got to see it at a\ntheatre NOW! You won't regret it. Don't miss this fine piece of cinema!\n\n"},
{"review": "\n\nThat was one of the best movies I've seen so far... I give it a 10.  Peter\nJackson is a genius.  Some parts were really emotional and almost made me\ncry, especially the end, when I realized it was the last movie of the\nthree.\nIt's kinda sad that it's over.\n"},
{"review": "\n\nThere's only one word which could describe this movie better than any ones\nelse: perfect!\nThe score is perfect, the directing is perfect, the script is perfect, the\nstory is perfect, the actors and the visual effects are\nperfect!!!<br><br>\n"},
{"review": "\n\nThe Return of the King is a magnificent movie, all on its own. Peter Jackson\nis a brilliant director. How he managed to put all of Tolkien's words into\nthe screen is wonderful. <br><br>I actually finished the Lord of the Rings books (including the Hobbit) 3\nyears ago. It was painstakingly difficult to read through intricate\ndescriptions and words but all in all, it was a good (though some parts were\nsnoozeville) read.<br><br>And the movie is even better than the books. Great movie with great\nactors... truly a film to be remembered. Way cool.\n"},
{"review": "\n\nThis movie is so great it's hard to believe anyone didn't like it. But, then\nthere are people who think Jerry Springer is quality television. The movie\nwas long and it probably should have ended when Frodo woke up, but no\nmatter. The movie had quality acting, a great and compelling storyline,\nawesome special effects and some clever directing. When compared to other\nepics and trilogies -- This one is the very best.\n"},
{"review": "\n\nThis film is going to be a classic for years to come.  I don't think I've\never seen a better movie.  The special effects were eye-popping, the\nacting\nwas superb, and the plot was seamless.  I enjoyed the depth they gave to\nGollum's character.  I was stunned by Sean Astin's heart-wrenching\nperformance as Sam.  He did a fantastic job of making the audience feel\nstrongly about this story.  The film deserves every star you can give it.\n\n"},
{"review": "\n\nI cannot say enough about this movie.  I just sat through it, and despite\nsome leg cramps, it is well worth it.  I was completely mesmerized every\nmoment of it.  It is intense and beautiful and funny and flows\neffortlessly\nfrom scene to scene.  And the end ties everything together so you are not\nleft wondering about anything.  The cast was amazing.  They all played\ntheir\nparts to perfection.  I highly recommend this movie.  I really do believe\nit\nis the best movie I've ever seen.\n"},
{"review": "\n\nDefinitely the best film in the Trilogy.<br><br>Like many Tolkien fans though I was disappointed by the details left out\nonly to find that we'll have to wait for the DVD gouge to get them\n(hopefully), but it still an absolutely breathtaking film.<br><br>A friend of mine commented, however, \"Someone shoot that damn violinist\",\nand its so true. Every time the Violin starts its a tear jerking moment\n;)<br><br>\n"},
{"review": "\n\nI absolutely loved this movie. I have already seen it four times. I can't\nbelieve the journey is over. I appreciate everything Jackson &amp; co. has\ndone\nto bring the epic story of the Lord of the Rings to film.<br><br>Everything was excellent - the acting, the landscape, the special effects,\nthe direction. Even though the ending of the movie was totally long, I\nagree\nwith what most of the people have already said, it needed to be long. The\nmovie ending was as close as possible to the way the book\nended.<br><br>The handsome, handsome men in the movie is worth mentioning. Hugs and\nkisses\nto the actors who played Faramir, Aragorn, Legolas, and\nEomer!<br><br>Looking forward to owning the special edition DVD. Would love to see the\nsame makers of this film do \"The Hobbit.\"\n"},
{"review": "\n\nThe Lord of the Rings: The Return of the King was in my 23 years, the most\neagerly anticipated film EVER.  Not only did it deliver, but they succeeded\nin doing something so rarely accomplished in film.  It's so emotional and\npowerful that it brings tears to your eyes.  Don't even bother fighting\nthem.  I saw this movie with my father and I looked over at him and saw them\nin his eyes as well.  It was an amazing moment.  Thank you Peter Jackson,\nNew Line, Weta Digital and all the amazing cast, crew, hobbits, elfs and\norcsies for creating the greatest film achievement of my generation and for\nraising the bar for all fantasy film adventures to come. \n\n"},
{"review": "\n\nSuperlatives are poular in describing the Lord of the Rings Trilogy, both as\nliterature and now as Peter Jackson's films. I've run out of them to\ndescribe The Return of the King movie. Incredible comes to mind. Jackson\nshows he is a master of pacing and drama and now spectacle. Certainly the\nmost incredicble battle sequences I have seen on film. With some exception,\nJackson is in my mind more true to the books in this film than the previous\ntwo. Deviations from the original are more acceptable here for some reason.\nThe acting of the lead cast is increasingly improved, makign me wonder how\nJackson managed to get this from his cast while filming all mixed up all at\nonce...<br><br>Truly, this film is a masterpiece on its own; as a crowning cap of a\ntremendous trilogy of films, it is simply astounding. There is excitment and\nenergy yet so much more emotion and character involvement here. I can't wait\nto see what Jackson has cut out to see just how in depth the movie began its\nlife...I can picture what is not here.\n"},
{"review": "\n\nThis film is so brilliant i wasn't embarassed to cry, the effects are\noutstanding, and by far the most amazing I've ever seen.\nIf people want to say that this film is \"nothing like the book\" then i\nchallenge them to do it any better, the film is the best it can be to stay\ntrue to the book, Ok so bits were in a different order at times but this\nkept it more interesting for those who have read it, the acting quality\nwas\nsuperb! Viggo Mortensen was amazing! and Sir Ian MCkellen was perfectly\ncast, as for Orlando Bloom well he's already made his mark on the\nworld.\n\n"},
{"review": "\n\nThe ending trilogy was intense and compelling but not quite perfect.  A\nreality-based motif would have even brought this imaginative fantasy.  The\neerie, haunting black corridors of Mount Doom and the pervasive evil as well\nas presence of heart-break female roles were missing.  Such magic would have\ncaptured a the Excaliber quality essence of Middle Earth.  The music, the\ndizzying reeling battle scenes, the cinematography were richly transferred\nto the screen.  Yet, the epic nature of Dr. Zhivago was never fully realized\nbut as a fantasy it is the best to come along.  Eight out of ten\nstars.\n"},
{"review": "\n\nI have just returned from my first viewing of Return of the King, and I am\nleft feeling so\nmany emotions you are wrenched between doubt and victory, hope and loss\nbut\nthe\noverriding emotion I feel now I am out of the theatre is one is\nsadness.<br><br>Minor Spoilers for those that have not read the book.<br><br>Sadness because it is all over, that three consecutive Christmas' of great\nfilms are gone,\nbut what a way to end it. The epic battle on the Pelennor Fields against\nthe\npersonal\nstruggle of Frodo and Sam and the treachery of Gollum. Despite being an\nepic\nfilm you\nfeel for the characters, go with them every last step, believe.<br><br>A lot of the book is missing if you are going to be analytical but when\nyou\nsee what you\ndo you will be blown away. This is as good if not better than the\nFellowship\nof the Ring\nand the Two Towers.<br><br>There has been a lot said about cuts but it is as long as it is and it is\na\ngreat film, if you\nwant more wait for the extended edition DVD.<br><br>I confess I am a fan of the book and radioplay and have been since I was a\nwee small\nchild so maybe I am bias but what a film. I am now planning when to see it\nagain.<br><br>May it live long in the hearts of fans, one of the greatest movie\ntrilogies\never made.<br><br>Frodo Lives.\n"},
{"review": "\n\nIt's rare to find a movie that lives-up to the hype made by critics.\n\"Return of the King\" does not disappoint--in fact, it is the first movie I\nhave watched that completely went beyond my expectations.<br><br>Some will say some scenes are dragged out.  But those \"dragged out\" scenes\nmake the other ones so spectacular.<br><br>I won't go into detail about the movie.  I hate reading spoilers.  Do\nyourself a favor:  watch this movie as soon as you can, if you haven't\nalready.  That way you can make your own decision on what you think of\nit.<br><br>10 out of 10\n"},
{"review": "\n\nI don't understand why some people thought this movie wasn't the best. I\ndo\nagree that the beginning was slow but i thought it picked up enough pace\nbecause of all the things that were happening at once. I thought that all\nthe performances were so much better than they were in the other 2. I\ncould\nreally connect with these characters and their pain. My favorite character\nhas to be Aragorn. Viggo Mortenson did such a spectacular job portraying\nthe\nlost king. I really found him believable at the end of the movie. He\nseemed\nlike such the perfect king. And those 4 hobbits, there aren't enough\nwords.\nEach one was so spectacular in their part. To end this review, the movie\nfollowed the book very well and i think that this movie deserves at least\na\nbest picture oscar or a best director oscar for peter jackson. He struck\ngold with this movie.\n"},
{"review": "\n\nLet me start off by saying that this is absolutely the greatest movie I\nhave ever seen ... I will admit I am biased by my love for Tolkiens\nwritten\nwork and Jackson's cinematic epics, but I truly feel that I cannot think\nof\nany single film that can top this film, in any way ...<br><br>I believe that the definition of the word \"bittersweet\" certainly has\nto\ncome with the viewing of this movie. A long-expected conclusion, but\nnonetheless sad goodbye to a film series that has touched the lives, I\ntruly\nbelieve, of millions.<br><br>I think the only proper thing to do, since I really can find no words\nto\ndescribe the perfection of this movie, is to give thanks to everyone\ninvolved in creating them. I don't know if anyone from the films reads\nthese\ncomments, but if you do, I know I speak for millions when I say that you\nhave succeeded beyond any other in bringing so strong a tale to\nlife.<br><br>To the actors and actresses, thank you for bringing life to the\ncharacters and making them beloved in our hearts. To the set artists, your\nvisual masterpieces have been flashed into our memories forever. To the\nmusicians, vocalists, and Howard Shore, your score plays on forever in our\nears. To Peter Jackson, your vision has extended far beyond the borders of\nfilm and into the very hearts and souls of your audiences. To the writers,\nFran Walsh, Phillipa Boyens and Peter Jackson, you have layed the\nfoundation\nof a film series that will conquer the disheartened everywhere. And\nlastly,\nthe greatest of all thanks to J.R.R. Tolkien, the man who deserves no\nlesser\ntitle than the spinner of dreams.<br><br>And if you have not ventured out into the world of Tolkien, it's about\ntime you went there and back again ... \n"},
{"review": "\n\nI don't know what else I can say.  The film is beautiful beyond words, and\nI\nfeel like a better person for having seen it.  I finally feel like I have\nseen the movie...to me, The Lord Of The Rings is one big 11 hour movie\n(Extended Editions) , and it has been incomplete...until now.  An epic\nthat\nwill most likely never be equaled.  Out of sheer respect, the movie\ndeserves\nto win Best Picture, Best Director, Best Supporting Actor (Sean\nAstin...he's\nincredible...one of the better supporting performances ever) , Best\nAdapted\nScreenplay, Best Editing, Best Sound, and more.  Bravo, Peter Jackson.\nAnd\nthank you.\n"},
{"review": "\n... It might be the best movie of this century. I'm writing this\nthe morning\nafter and dreamt about it all night... So it's all a bit messy at the\nmoment. The film is huge. Everyone acted their best and I've always said\nthat I don't think Wood is so good as Frodo as he should be but I'm taking\nit all back now after seeing whole trilogy in a row. He's absolutely\namazing! Anyway, the film is great and I probably have to see it many\ntimes\nthat I can be more critical. The ending is too long but like some critic\nsaid; I don't know what could've been left out?! Go see\nit!\n"},
{"review": "\n\nNever have I seen such a overwhelming movie as this. Beautifull landscapes,\nenormous fighting scenes and great buidling structures. I read the book and\neven in my imagination I could not have dreamed that it would be possible to\nexceed these thoughts. Perfect special effects, impressive visual effects\nand a good mix of emotions in the different scenes.<br><br> To bad, this is the last part.\n"},
{"review": "\n\nThe acting is amazing, the emotion unnerving, and the climax of an entire\ntwo years is here.  I believe the nominations for Best Picture have been\nhints that the final episode of the Lord of the Rings will receive it at\nlast.  This film is a masterpiece, filled with every emotion, from fear to\ncomedy, and everything in between.  Some have said it dwindles.  I\ndisagree,\nif you think of the resolution being too long, just remember that it's the\nresolution for the end of three 3+ hour movies.  It's pretty much expected\nto have a long resolve.  But I do agree that all of these films are a\nwonderful representation of the books, and the Academy should seriously\nconsider this as all of them combined in one film, and just give it an\naward.  Anyone who's casually interested in movies, books, or just fantasy\nin general will enjoy, if not love, this movie.  Highly recommended,\nnotably\nhonored.\n"},
{"review": "\n\nAn unbelievable achievement! I felt that the \"Return of the King\" (ROTK)\ntheatrical release was better than either \"Fellowship of the Ring\" (FOTR)\nor\n\"The Two Towers\" (TTT) theatrical releases. I felt that ROTK stayed pretty\nclose to the book, having re-read the book last week in preparation for\nthe\nmovie. I'm a big Tolkien fan, but I can see where someone who hasn't seen\neither of the first two movies or read any of the books might feel a\nlittle\nleft out. If you haven't seen either FOTR or TTT, I would strongly suggest\nviewing those two films prior to viewing ROTK. Of course, if you're going\nto\nsee ROTK and haven't seen either of the first two films, you must have\nbeen\nliving under a rock.  As for me, the only\nmovie I have left to look forward to is for the extended edition of ROTK,\nor\npossibly \"The Hobbit\" if Peter Jackson is allowed to make\nit.\n\n"},
{"review": "\n\nThere is not one scene in this movie where there isn't a valid reason to\ncry. This movie is a landmark of the movies, and this trilogy is a\ntestament\nto the will to survive and surviving against impossible odds. No one\ncould've made a better live action film adaptation of these incredible\nbooks\nthan Peter Jackson. And no one could possibly improve on this movie -it is\nutterly breathtaking and flawless. It is beautiful, it is dark, it is\nintense, and there are uncountable moments that absolutely astonish you.\nIf\nyou do not like this movie, than you do not know what good filmmaking is,\nor\nyou are hopelessy cynical and I pity you. This movie is magic, it's movie\nmagic, and every frame is wonderful and sweeping and I'm not sure how\nanyone\ncould not like this movie. Even if you're not a fan, you haven't read the\nbooks, and you haven't seen either of the two movies, the sheer visual\nspectacle can't help but amaze you. This movie deserves every tiny bit of\npraise it's getting, and will get, and If you don't go to see this movie,\nyou are missing out on the film of this century, of this milennium, of all\ntime.\n"},
{"review": "\n... It might be the best movie of this century. I'm writing this\nthe morning\nafter and dreamt about it all night... So it's all a bit messy at the\nmoment. The film is huge. Everyone acted their best and I've always said\nthat I don't think Wood is so good as Frodo as he should be but I'm taking\nit all back now after seeing whole trilogy in a row. He's absolutely\namazing! Anyway, the film is great and I probably have to see it many\ntimes\nthat I can be more critical. The ending is too long but like some critic\nsaid; I don't know what could've been left out?! Go see\nit!\n"},
{"review": "\n\nNever have I seen such a overwhelming movie as this. Beautifull landscapes,\nenormous fighting scenes and great buidling structures. I read the book and\neven in my imagination I could not have dreamed that it would be possible to\nexceed these thoughts. Perfect special effects, impressive visual effects\nand a good mix of emotions in the different scenes.<br><br> To bad, this is the last part.\n"},
{"review": "\n\nGreat job on all of the movies in the Trilogy.  I read the books back in\nthe\nsixties and fell in love with them and read them over and over again. Yes\nat\ntimes the movies have differences from the books but I don't think anyone\ncould have done a better job. \n"},
{"review": "\n\nLet me start off by saying that this is absolutely the greatest movie I\nhave ever seen ... I will admit I am biased by my love for Tolkiens\nwritten\nwork and Jackson's cinematic epics, but I truly feel that I cannot think\nof\nany single film that can top this film, in any way ...<br><br>I believe that the definition of the word \"bittersweet\" certainly has\nto\ncome with the viewing of this movie. A long-expected conclusion, but\nnonetheless sad goodbye to a film series that has touched the lives, I\ntruly\nbelieve, of millions.<br><br>I think the only proper thing to do, since I really can find no words\nto\ndescribe the perfection of this movie, is to give thanks to everyone\ninvolved in creating them. I don't know if anyone from the films reads\nthese\ncomments, but if you do, I know I speak for millions when I say that you\nhave succeeded beyond any other in bringing so strong a tale to\nlife.<br><br>To the actors and actresses, thank you for bringing life to the\ncharacters and making them beloved in our hearts. To the set artists, your\nvisual masterpieces have been flashed into our memories forever. To the\nmusicians, vocalists, and Howard Shore, your score plays on forever in our\nears. To Peter Jackson, your vision has extended far beyond the borders of\nfilm and into the very hearts and souls of your audiences. To the writers,\nFran Walsh, Phillipa Boyens and Peter Jackson, you have layed the\nfoundation\nof a film series that will conquer the disheartened everywhere. And\nlastly,\nthe greatest of all thanks to J.R.R. Tolkien, the man who deserves no\nlesser\ntitle than the spinner of dreams.<br><br>And if you have not ventured out into the world of Tolkien, it's about\ntime you went there and back again ... \n"},
{"review": "\n\n(Opening night, post-midnight showing, 5:00am)  Only a very quick set of\nreactions, because I'm really tired: the film was amazing, incredible,\nmind-blowing, and every bit worthy of its hype (and then some).<br><br> Personally I loved the long series of endings that seem to be the sticking\npoint for most casual viewers All that went before redefined the word\n\"spectacular.\"<br><br> I was prepared for the alterations from the book, so I wasn't as annoyed as\nI was by The Two Towers. Would I have made different choices regarding the\nmajor changes Maybe; But then again, I could never have accomplished\n0.000001% of what Jackson &amp; Co. did -- even if I were given twice the\nresources that they were.<br><br> Of course I missed the obvious scenes (EE or unfilmed): the confrontation\nwith Saruman, the Houses of Healing, the Scouring, etc.  Overall, however, I\nwas thrilled with all that was retained.<br><br> For the record, I also love the book and have read it numerous times.\nContrary to extremist dogma, it IS possible to love both the book and the\nfilms.\n"},
{"review": "\n\nDespite the 3 1/2 hour running (my only complaint), this is a great ending\nto the Lord of the Rings trilogy.  This is the final battle between good\nand\nevil in Middle Earth.  I hope this is the year Lord of the Rings wins Best\nPicture and Peter Jackson gets Best Director at the Oscars.  I think this\nyear's competition is weak.  If it doesn't win, it will be a travesty.\nAll\nthree films are a remarkable achievement and should be honored.  Honoring\nthe last of the trilogy would be good.\n"},
{"review": "\n\nThis movie is visually the best of the trilogy. The oliphaunts were even\nmore well done than I could imagine, and the other \"new\" characters were\nall\nexactly as I remember them from the books. Jackson also does a good job\nwrapping up all loose ends, although the very end did not seem to come\nwhen\nI thought it should. But, I must say, I was impressed with the deepness of\nthe story as told by J.R.R. Tolkien through the eyes, cameras, and CGI of\nPeter Jackson and company.\n"},
{"review": "\n\nThe acting is amazing, the emotion unnerving, and the climax of an entire\ntwo years is here.  I believe the nominations for Best Picture have been\nhints that the final episode of the Lord of the Rings will receive it at\nlast.  This film is a masterpiece, filled with every emotion, from fear to\ncomedy, and everything in between.  Some have said it dwindles.  I\ndisagree,\nif you think of the resolution being too long, just remember that it's the\nresolution for the end of three 3+ hour movies.  It's pretty much expected\nto have a long resolve.  But I do agree that all of these films are a\nwonderful representation of the books, and the Academy should seriously\nconsider this as all of them combined in one film, and just give it an\naward.  Anyone who's casually interested in movies, books, or just fantasy\nin general will enjoy, if not love, this movie.  Highly recommended,\nnotably\nhonored.\n"},
{"review": "\n\nAn unbelievable achievement! I felt that the \"Return of the King\" (ROTK)\ntheatrical release was better than either \"Fellowship of the Ring\" (FOTR)\nor\n\"The Two Towers\" (TTT) theatrical releases. I felt that ROTK stayed pretty\nclose to the book, having re-read the book last week in preparation for\nthe\nmovie. I'm a big Tolkien fan, but I can see where someone who hasn't seen\neither of the first two movies or read any of the books might feel a\nlittle\nleft out. If you haven't seen either FOTR or TTT, I would strongly suggest\nviewing those two films prior to viewing ROTK. Of course, if you're going\nto\nsee ROTK and haven't seen either of the first two films, you must have\nbeen\nliving under a rock.  As for me, the only\nmovie I have left to look forward to is for the extended edition of ROTK,\nor\npossibly \"The Hobbit\" if Peter Jackson is allowed to make\nit.\n\n"},
{"review": "\n\nGranted, I didn't read the books, but oh my god, how can people say this\nmovie sucked?  One of the best epics to ever grace the screen, concluding\nthe best trilogy ever to grave the screen.  Unbelievable\nmovie.\n"},
{"review": "\n\nEverything I expected, and more. It was a roller-coaster of emotion -\neverything from the fear in the tunnels to the feeling of glory in the\nbattles, and the sadness at the end. Easily the best of the three\nmovies!\n"},
{"review": "\n\nThere is not one scene in this movie where there isn't a valid reason to\ncry. This movie is a landmark of the movies, and this trilogy is a\ntestament\nto the will to survive and surviving against impossible odds. No one\ncould've made a better live action film adaptation of these incredible\nbooks\nthan Peter Jackson. And no one could possibly improve on this movie -it is\nutterly breathtaking and flawless. It is beautiful, it is dark, it is\nintense, and there are uncountable moments that absolutely astonish you.\nIf\nyou do not like this movie, than you do not know what good filmmaking is,\nor\nyou are hopelessy cynical and I pity you. This movie is magic, it's movie\nmagic, and every frame is wonderful and sweeping and I'm not sure how\nanyone\ncould not like this movie. Even if you're not a fan, you haven't read the\nbooks, and you haven't seen either of the two movies, the sheer visual\nspectacle can't help but amaze you. This movie deserves every tiny bit of\npraise it's getting, and will get, and If you don't go to see this movie,\nyou are missing out on the film of this century, of this milennium, of all\ntime.\n"},
{"review": "\n\nFor those fans of the books who have been watching these films unfold during\nthe past  7 years, it has been a journey of love, labor and a good number of\nsacrifices... but a  great deal more rewards.  For those fans who have only\njust begun to discover Middle  Earth through the films, Tolkien's\nmasterpiece 3-part epic remains intact in its message,  imagery, and\ntimeless virtue.  Here preserved on 35mm film for all to see is the capstone\nto the epic film series that has become an international phenomenon with\ncritics, fans,  and especially the box office.<br><br> The Return of the King is the big payoff.  In a sense the film is just\nthat, the third chapter  to a massive 11+ hour epic film, and certainly the\nmost rewarding film of the series.  But  for being packed with exhilirating\naction, nail-biting suspense, intense dramatic scenes  and heartfelt\nemotional scenes that will make grown men cry - The Return of the King\ntells the final chapter of the Lord of the Rings with surprising patience\nand a very  carefully wrought edge to storytelling.  Here the many strands\nof the story are skillfuly  interwoven throughout the film and eventually\nbrought together in a very momentous  climax which will literally make you\nwant to rise up from your seat and start roaring  battle cries along with\nthe bedraggled warriors on the screen who, in the face of  unstoppable\nhatred, rally together and charge forward nonetheless.<br><br> You will love this movie.  If you have missed seeing the other films then\ngo and watch  them to prep yourself for seeing this one.  You simply cannot\nmiss this while it is in the  theaters, it will knock you down and you will\nlove every minute of it.<br><br> 10/10\n"},
{"review": "\n\n(Opening night, post-midnight showing, 5:00am)  Only a very quick set of\nreactions, because I'm really tired: the film was amazing, incredible,\nmind-blowing, and every bit worthy of its hype (and then some).<br><br> Personally I loved the long series of endings that seem to be the sticking\npoint for most casual viewers All that went before redefined the word\n\"spectacular.\"<br><br> I was prepared for the alterations from the book, so I wasn't as annoyed as\nI was by The Two Towers. Would I have made different choices regarding the\nmajor changes Maybe; But then again, I could never have accomplished\n0.000001% of what Jackson &amp; Co. did -- even if I were given twice the\nresources that they were.<br><br> Of course I missed the obvious scenes (EE or unfilmed): the confrontation\nwith Saruman, the Houses of Healing, the Scouring, etc.  Overall, however, I\nwas thrilled with all that was retained.<br><br> For the record, I also love the book and have read it numerous times.\nContrary to extremist dogma, it IS possible to love both the book and the\nfilms.\n"},
{"review": "\n\nThis movie is visually the best of the trilogy. The oliphaunts were even\nmore well done than I could imagine, and the other \"new\" characters were\nall\nexactly as I remember them from the books. Jackson also does a good job\nwrapping up all loose ends, although the very end did not seem to come\nwhen\nI thought it should. But, I must say, I was impressed with the deepness of\nthe story as told by J.R.R. Tolkien through the eyes, cameras, and CGI of\nPeter Jackson and company.\n"},
{"review": "\n\nI have just returned from my first viewing of Return of the King, and I am\nleft feeling so\nmany emotions you are wrenched between doubt and victory, hope and loss\nbut\nthe\noverriding emotion I feel now I am out of the theatre is one is\nsadness.<br><br>Minor Spoilers for those that have not read the book.<br><br>Sadness because it is all over, that three consecutive Christmas' of great\nfilms are gone,\nbut what a way to end it. The epic battle on the Pelennor Fields against\nthe\npersonal\nstruggle of Frodo and Sam and the treachery of Gollum. Despite being an\nepic\nfilm you\nfeel for the characters, go with them every last step, believe.<br><br>A lot of the book is missing if you are going to be analytical but when\nyou\nsee what you\ndo you will be blown away. This is as good if not better than the\nFellowship\nof the Ring\nand the Two Towers.<br><br>There has been a lot said about cuts but it is as long as it is and it is\na\ngreat film, if you\nwant more wait for the extended edition DVD.<br><br>I confess I am a fan of the book and radioplay and have been since I was a\nwee small\nchild so maybe I am bias but what a film. I am now planning when to see it\nagain.<br><br>May it live long in the hearts of fans, one of the greatest movie\ntrilogies\never made.<br><br>Frodo Lives.\n"},
{"review": "\n\nAn unbelievable achievement! I felt that the \"Return of the King\" (ROTK)\ntheatrical release was better than either \"Fellowship of the Ring\" (FOTR)\nor\n\"The Two Towers\" (TTT) theatrical releases. I felt that ROTK stayed pretty\nclose to the book, having re-read the book last week in preparation for\nthe\nmovie. I'm a big Tolkien fan, but I can see where someone who hasn't seen\neither of the first two movies or read any of the books might feel a\nlittle\nleft out. If you haven't seen either FOTR or TTT, I would strongly suggest\nviewing those two films prior to viewing ROTK. Of course, if you're going\nto\nsee ROTK and haven't seen either of the first two films, you must have\nbeen\nliving under a rock.  As for me, the only\nmovie I have left to look forward to is for the extended edition of ROTK,\nor\npossibly \"The Hobbit\" if Peter Jackson is allowed to make\nit.\n\n"},
{"review": "\n\nI watched the trilogy yesterday at a theatre in Ontario, Canada yesterday\nand it was the most amazing experience. I was on the edge of my seat for\nthe\nentire 'Return of the King' even though I have read the books multiple\ntimes\nand knew the ending it was amazing to watch it brought to life on the\nscreen. If they do not give Jackson and Mortensen the Oscars it will be\ntravesty. I still believe they should create some category where Andy\nSerkis\n(and the developers) could win for his amazing portrayal. I do realize\nthat\nthe developers brought him to the screen, but with Serkis I think Gollum\nmight not have been such an amazing character.<br><br>I just can't believe the waiting is over (until the extended version) it\nis\nsomewhat of a letdown. It's over. It has been done and done well. Who ever\nwould have thought it was possible. Apparently, Jackson. Kudos to you Mr.\nJackson thank you for bringing this to the screen and doing such an\namazing\njob. Viggo Mortensen, thank you so much for bringing my hopes of what\nAragorn would be to the screen. You went above and beyond what ever could\nhave hoped for for the character that I have been love with since I was\neight years old.<br><br>Amazing movie! Amazing trilogy! Can't wait to see all three in a theatre\nagain.\n"},
{"review": "\n\nThis movie was a masterpiece, Peter Jackson did a brilliant job! It was\nvery\ntouching... I knew the end and I still cried! The way he portrayed the\ncharacters and events was fantastic... The movie is definitely the best\none\nof the year!\n"},
{"review": "\n\nAt last it's been released.  The most awaited and most hyped movie in\nrecent\ncinematic history has finally hit the screens.  And it lives up to every\nbit\nof it's expectations.  Mr Jackson managed to excel himself again.  The\nvisual beauty and the emotions of this movie are epic.\nThe actors seemed to hold out their best interpretations for this movie.\nSean Astin is incredible.  And it is certainly one of the better movies of\nElijah Wood.  His critics have definitely been silenced.<br><br>The visual beauty of the movie and the special effects are breath-taking.\nThis time the action has been timed and directed to perfection.  Did you\nsee\nthat spider?  And how the Ringwraiths grow on you?  And the Paths of the\nDead?<br><br>As always WETA have done an excellent job in costumes armoury and other\nprops.<br><br>Well done Peter Jackson\n"},
{"review": "\n\nDespite the 3 1/2 hour running (my only complaint), this is a great ending\nto the Lord of the Rings trilogy.  This is the final battle between good\nand\nevil in Middle Earth.  I hope this is the year Lord of the Rings wins Best\nPicture and Peter Jackson gets Best Director at the Oscars.  I think this\nyear's competition is weak.  If it doesn't win, it will be a travesty.\nAll\nthree films are a remarkable achievement and should be honored.  Honoring\nthe last of the trilogy would be good.\n"},
{"review": "\n\nThe acting is amazing, the emotion unnerving, and the climax of an entire\ntwo years is here.  I believe the nominations for Best Picture have been\nhints that the final episode of the Lord of the Rings will receive it at\nlast.  This film is a masterpiece, filled with every emotion, from fear to\ncomedy, and everything in between.  Some have said it dwindles.  I\ndisagree,\nif you think of the resolution being too long, just remember that it's the\nresolution for the end of three 3+ hour movies.  It's pretty much expected\nto have a long resolve.  But I do agree that all of these films are a\nwonderful representation of the books, and the Academy should seriously\nconsider this as all of them combined in one film, and just give it an\naward.  Anyone who's casually interested in movies, books, or just fantasy\nin general will enjoy, if not love, this movie.  Highly recommended,\nnotably\nhonored.\n"},
{"review": "\n\nThere is not one scene in this movie where there isn't a valid reason to\ncry. This movie is a landmark of the movies, and this trilogy is a\ntestament\nto the will to survive and surviving against impossible odds. No one\ncould've made a better live action film adaptation of these incredible\nbooks\nthan Peter Jackson. And no one could possibly improve on this movie -it is\nutterly breathtaking and flawless. It is beautiful, it is dark, it is\nintense, and there are uncountable moments that absolutely astonish you.\nIf\nyou do not like this movie, than you do not know what good filmmaking is,\nor\nyou are hopelessy cynical and I pity you. This movie is magic, it's movie\nmagic, and every frame is wonderful and sweeping and I'm not sure how\nanyone\ncould not like this movie. Even if you're not a fan, you haven't read the\nbooks, and you haven't seen either of the two movies, the sheer visual\nspectacle can't help but amaze you. This movie deserves every tiny bit of\npraise it's getting, and will get, and If you don't go to see this movie,\nyou are missing out on the film of this century, of this milennium, of all\ntime.\n"},
{"review": "\n\nI have just returned from my first viewing of Return of the King, and I am\nleft feeling so\nmany emotions you are wrenched between doubt and victory, hope and loss\nbut\nthe\noverriding emotion I feel now I am out of the theatre is one is\nsadness.<br><br>Minor Spoilers for those that have not read the book.<br><br>Sadness because it is all over, that three consecutive Christmas' of great\nfilms are gone,\nbut what a way to end it. The epic battle on the Pelennor Fields against\nthe\npersonal\nstruggle of Frodo and Sam and the treachery of Gollum. Despite being an\nepic\nfilm you\nfeel for the characters, go with them every last step, believe.<br><br>A lot of the book is missing if you are going to be analytical but when\nyou\nsee what you\ndo you will be blown away. This is as good if not better than the\nFellowship\nof the Ring\nand the Two Towers.<br><br>There has been a lot said about cuts but it is as long as it is and it is\na\ngreat film, if you\nwant more wait for the extended edition DVD.<br><br>I confess I am a fan of the book and radioplay and have been since I was a\nwee small\nchild so maybe I am bias but what a film. I am now planning when to see it\nagain.<br><br>May it live long in the hearts of fans, one of the greatest movie\ntrilogies\never made.<br><br>Frodo Lives.\n"},
{"review": "\n\nIt's rare to find a movie that lives-up to the hype made by critics.\n\"Return of the King\" does not disappoint--in fact, it is the first movie I\nhave watched that completely went beyond my expectations.<br><br>Some will say some scenes are dragged out.  But those \"dragged out\" scenes\nmake the other ones so spectacular.<br><br>I won't go into detail about the movie.  I hate reading spoilers.  Do\nyourself a favor:  watch this movie as soon as you can, if you haven't\nalready.  That way you can make your own decision on what you think of\nit.<br><br>10 out of 10\n"},
{"review": "\n\nThis movie is awesome... Its some of the best I've ever seen. I've never\nseen a movie as good as this, I couldn't keep my tears back, and so could\nnot 4000 others in the cinema, Oslo Spektrum, at the before-premiere... In\nfive words: As all movies should be!\n"},
{"review": "\n\nSo thats it then. Our journey through Middle Earth has drawn to a Close,\nand\nit´s time to sit back and reflect on what it has left us with. I for one\nhad\nlooked forward to this series, since i heard it was Due, and i must say\nthat\nmy expectations has been met on ALMOST every count.\nI will not go into Details on the plot in this thread, due to the fact\nthat\nso many of you guys havent seen it yet (But you will of course shortly ;-)\n)<br><br>Peter Jackson has achieved a Milestone in Filmmaking, that multiple times\nhas been awarded for its outstanding, and Groundbreaking new Techniches.\nAwards FULLY deserved.<br><br>Of the Cast i would Like to point out Sean Astin. He really grows\nthroughout\nthe movies and fully matures in the last instalment of the\nTrilogy.<br><br>All in All, For RotK: Ten thumbs up. I loved it.\n(Cant Wait for SE)\nAs for the Series: About Bloody Time!! :-)\n"},
{"review": "\n\nI just got back from taking part in Trilogy Tuesday (16 hours at the movie\ntheater) and just want to say Return of the King didn't let me down. Once\nagain the fight scenes are good, there's some good humor, and of course\ngreat acting. The end has some scenes that might make you teary-eyed so\nbring some tissues! Too tired to write more... I just wanted to be the\nfirst!\n"},
{"review": "\n\nI thought the first two films were great and then I saw Return of the\nKing...  somehow this made the first two even better while at the same time\nmaking them pale by comparison.  This movie is beautiful, breathtaking,\nexciting, thrilling, heart-wrenching, awe-inspiring, heart-pounding, and\nhumbling.  The movie stands for itself and words are not fit to descrribe\nit.  This is the film by which all others should be judged!\n"},
{"review": "\n\nHow could anyone put into words a description of this movie? It may sound\nsad but it touched me so much I was in tears for an hour after I saw it.\nIt\nwas the most touching, heartfelt, spectacular, story I have ever seen in\nthe\nCinema that I don't think even the words I used just now do it justice...\nAll I have to say is it is DEFINITELY the best for last, the special\neffects\nand stunt work was beyond this world and just the way everything flowed\nand\nhow true the characters were was just magical to watch! If I had to\nrecommend this, I would say GO AND SEE IT MORE THAN 5 TIMES!!! YOU WILL\nLOVE\nIT!\n"},
{"review": "\n\nI just came home from the midnight-premiere of \"The Return of the King\"\nand\nI was absolutley stunned by the craftmanship led by Peter Jackson in this\nmovie. This is my generation's \"Star Wars\", but ten times the better\nmovie/trilogy.<br><br>The acting is just superb, the sfx are better than the two previous films,\nand there are scenes that moved me to tears, over and over again. More\nflesh\nis added to all the characters, especially Gollum, who we are given the\nbackground to. I can't wait until I can see this on DVD and let myself get\nbrought to tears, over and over again.<br><br>I can only wait until the time comes when my son comes to sit in my lap\nand\nasking me what it was like to be \"there\". Experiencing the premiere and\nall\nthat. \"Well son... it was not bad at all.\"\n"},
{"review": "\n\nIt rocked, it really did. The battle scenes are like no other, they're\nincredible. You can't believe what Peter Jackson has achieved with this\nmovie.<br><br>But what I thought was better than the battle scenes were how sentimental\nthe movie was. The scenes where Sam and Frodo discuss how they will\nachieve\ntheir victory or recalling the days in the Shire is beautiful. Peter\nJackson\nmanages to get you right into the scene, it's great.<br><br>There were a few problems though.... The one liners are terrible and how\nGimli is the comic relief disgusted me. I really hate how Gimli is\nsupposed\nto be the dumb, comical character.<br><br>Howard Shore, once again delivers a flawless score that makes your hair\nstand on end.<br><br>All in all, I give this movie 9.5/10. The movie is beautiful, the\ncinematography is stunning, the graphics mind-numbing and the acting is\ngreat by mainly Gandalf, King Theoden and most of all,\nEowyn.<br><br>You're all in for the ride of your life! If you thought the battle scenes\nfrom Master and Commander, Pirate's of the Caribbean and The Last Samurai\nwere good, as a critic said, they are merely skirmishes compared to what\nReturn of the King has in store.\n"},
{"review": "\n\nSaw a screening of the movie on the 15th, and it was incredible - 3 1/2\nhours of payoff from the first two movies.  It strayed a little from the\nbook (No Scourign of the shire, no faramir and eowyn wedding, frodo sends\nsam away before they get to shelob's, etc.)  but it just felt soo right.\nbasically, if you liked the first two movies, you'll like this more.  if\nyou\nhated the first two movies, you probably won't like this, but you might\nlike\nit a bit better.  it has more and better action, but also more and better\ncharacter development, mainly with eowyn, faramir, the hobbits (sam,\npippin,\nand merry) and gollum.\n"},
{"review": "\n\nwell what can i say, this has to be best movie ever made. the scene peter\njackson changed is very nice done. those \"tolkien purists\" shouldn't even\ncomplain, cause it's SIMPLY impossible to make a movie the same as the\nbook.\nget a life or something.  i've also read everything of tolkien, but why\nwould you hate on a movie just because some detail isn't in the movie!!!!\njust like you(purists)can make a movie like that lol.<br><br>i would rate this movie a 10+\nand the whole triology also a 10+<br><br>\n"},
{"review": "\n\nBeen there - done that!  Over 9h watching Lord of the Rings! Awesome!<br><br>Just arrived at home again from watching the 3 films. Amazing! Really\nfantastic! But it seems to me that the Second Part (The Two Towers) comes up\nwith more fighting scenes and action than the third. In my opinion the third\nfilm can't \"beat\" the second - but he has other advantages. But nevertheless\nthe third part is worth watching it. It`s just about finishing the triology.\nJackson did a very good job - not too much of action, continuing the love\nstory(s) and bringing on the dramas. I'll watch it again on Saturday!...\n\n"},
{"review": "\n\nI can't believe that this fairytale of lifetime could be turned as movie\nlike this, this was much better than my imagination produced when I read\nthe\nbooks. This was unbelievable, so near perfection. Thank you\n:-)\n"},
{"review": "\n\nSo thats it then. Our journey through Middle Earth has drawn to a Close,\nand\nit´s time to sit back and reflect on what it has left us with. I for one\nhad\nlooked forward to this series, since i heard it was Due, and i must say\nthat\nmy expectations has been met on ALMOST every count.\nI will not go into Details on the plot in this thread, due to the fact\nthat\nso many of you guys havent seen it yet (But you will of course shortly ;-)\n)<br><br>Peter Jackson has achieved a Milestone in Filmmaking, that multiple times\nhas been awarded for its outstanding, and Groundbreaking new Techniches.\nAwards FULLY deserved.<br><br>Of the Cast i would Like to point out Sean Astin. He really grows\nthroughout\nthe movies and fully matures in the last instalment of the\nTrilogy.<br><br>All in All, For RotK: Ten thumbs up. I loved it.\n(Cant Wait for SE)\nAs for the Series: About Bloody Time!! :-)\n"},
{"review": "\n\nI just got back from taking part in Trilogy Tuesday (16 hours at the movie\ntheater) and just want to say Return of the King didn't let me down. Once\nagain the fight scenes are good, there's some good humor, and of course\ngreat acting. The end has some scenes that might make you teary-eyed so\nbring some tissues! Too tired to write more... I just wanted to be the\nfirst!\n"},
{"review": "\n\nI thought the first two films were great and then I saw Return of the\nKing...  somehow this made the first two even better while at the same time\nmaking them pale by comparison.  This movie is beautiful, breathtaking,\nexciting, thrilling, heart-wrenching, awe-inspiring, heart-pounding, and\nhumbling.  The movie stands for itself and words are not fit to descrribe\nit.  This is the film by which all others should be judged!\n"},
{"review": "\n\nHow could anyone put into words a description of this movie? It may sound\nsad but it touched me so much I was in tears for an hour after I saw it.\nIt\nwas the most touching, heartfelt, spectacular, story I have ever seen in\nthe\nCinema that I don't think even the words I used just now do it justice...\nAll I have to say is it is DEFINITELY the best for last, the special\neffects\nand stunt work was beyond this world and just the way everything flowed\nand\nhow true the characters were was just magical to watch! If I had to\nrecommend this, I would say GO AND SEE IT MORE THAN 5 TIMES!!! YOU WILL\nLOVE\nIT!\n"}
]