[
{"review": "\nThe film was awful and extremely boring. It was just so depressing and\nsadness was possibly the most annoying character ever conceived...why\nwhy why did she have to keep touching things after she was told over\nand over not to, just irritating. It got to the point where I was\ndreading the character coming on the telly. Animated Disney/pixar films\nshould stick to what they are good at and that's making children (and\nadults) happy. Yes they can have a moral lesson and sad bits but the\ngeneral overtone is happiness not depressing characters inside another\ndepressing character that I couldn't care less about. Should never have\nbeen made, should have saved their money. Im very sad that I can never\nget back the time I wasted on it...I could have watched paint dry.\n"},
{"review": "\ntalk about lack luster in this movie and lack of joy , i had to endure\nwatching this movie which had an awful plot , about some little girl\nwith emotional center something goes screwy and she gets depressed and\nalmost leaves home only to learn crying is good at the end . like how\ndoes that appeal to everyone ? talk about boring .The animated design\nfor the characters was good but seriously pixar get your stuff together\nyou had so many classic movies that would make this look like a piece\nof crap e.g wall-e , Up , incredible , monster inc, monsters university\n, brave, toy story1-3, ratatouille etc . Please bring those kinds of\nmovies with great plot and fire the writers and director who wrote this\nmovie . they should never set foot in the pixar company EVER!!\n"},
{"review": "\nThis movie was built up by the trailers and I was actually excited to\nsee it. The fact of the matter is that this movie is boring and not\nworth seeing. How major movie critics almost unanimously gave this\nmovie positive reviews really makes no sense. Googling reviews for this\nmovie proves to be much more telling than the scores it received on\n\"reputable\" websites. The scores are overblown because people were\nbeing generous with negative scores and way too generous with positive\nreviews by giving perfect scores to this mess of a movie. If you want\nto watch a movie and feel really uncomfortable this is for you. The\nemotions are forced at the viewer and explained by a plot that falls\napart like the memories in the movie. Unfortunately my memory of this\nmovie will remain.\n"},
{"review": "\nI went to see this with my 6 year old and 12 year old and we all left\ndepressed and hating the movie. Disney needs to remember they are in\nthe \"entertainment\" business. This is the second movie they have made\nlately that leaves you feeling worse after you saw it than you were\nbefore viewing it. Inside Out begins with a good story line, but\nsadness (better named depression)is the biggest part of the movie. Yes,\nthere is realism. But, I prefer the \"fantasy\" part of cartoons where\none can escape the bad and enjoy a light-hearted laugh for a bit. In my\nopinion, Disney head's need to see a professional about this depression\nthey feel so compelled to share. I won't waste my money on another\nmovie ticket to a Disney show until can see people laughing when they\ntalk about the new show. I grew up with Disney movies and loved almost\nall of them. Am so sad that my kids can't have that same joy! This\nmovie was such a waste of talent and time!!! Save your money and watch\na DVD at home instead.\n"},
{"review": "\nI'm a kid who I think this meant to appeal to but what happens is\neverything it looks like something good is gonna happen it just ends up\nbeing something completely random like when they get on the train it\njust happened to be to late at the time when they got on the train and\njoy is one of the meanest characters if ever seen in a movie when she\nleaves sadness behind at the end and at the end when she try's to run\naway it's just so depressing the voice acting is terrible I would 100%\nskip if I'm watching it It's such a lazy idea anyone could have come up\nwith the story in five minutes This movie implies we only have five\nemotions which is stupid I don't know why it has such a high rating it\nhas no memorable scenes in it no excitement I'd definitely watch\nsomething else\n"},
{"review": "\nThis movie is terrible and it is for babies. Don't let the ratings fool\nyou. Do not watch this movie it is terrible. I thought is was going to\nbe so good but it turned out terrible.DO NOT WATCH THIS MOVIE. In my\nrecommendation this movie is terrible and like any old movie it has a\nhappy ending. Their solution could have been though of at the beginning\nof the movie. Just fly a cloud there and get back. And stupid joy is\njust selfish. She just grew a brain. That's all that happened in the\nmovie. The only other things were growing more islands and upgrading\ntheir controls. KILL THIS MOVIE! The fact that this movie could have\nbeen less than an hour disappoints me. In conclusion, this movie sucks\n"},
{"review": "\nUsually love Pixar, Toy Story for example, was easy and fun to follow\nup on the big screen but Inside Out is a jumble of fast talking\ncharacters, sudden bursts of sound that'll wake you up when you feel\nyourself drifting off.<br><br>This movie is hard to follow, has a very sophisticated theme and so\nanyone under 10 probably won't sit through this one.<br><br>For example there are about a 1/2 a dozen different characters that\nrepresent \"feelings\" ( anger, sadness, fear etc ) all talking at the\nsame time in some instances. Then there are the complicated\nexplanations of long term/short term memory, REM sleep cycles, I mean,\nIf I were a 5 year old, I wouldn't know what was going on after about\n10 mins, I'd be lost.<br><br>Not to mention that there are long stretches of fast action accompanied\nby loud rather jarring music and shrill voices etc.<br><br>It's a mess of a movie &amp; definitely not for the very young because they\nwon't understand it, believe me.\n"},
{"review": "\nThere is a problem with psychological reality with this movie. The fact\nthat it is presented as entertainment for children is an extreme\nnegative. One of the most important thrusts of human evolution has been\nto free humans from the former mental encumbrances of past centuries.\nIn this Movie the child is depicted as controlled by a number of\nentities, the child is in fact insane but depicted as normal. I am\nconcerned as to the sanity of the person(s) who wrote this script. Such\na movie disserves the bonfire. I am amazed that our Psychologists are\nnot protesting the showing of this movie which demonstrates only the\norigins of western psychology - the cocaine importer and addict Sigmund\nFreud.\n"},
{"review": "\nWell I went to see this movie last night with a friend and I think for\nchildren under 10 the movie is to complex. The main human emotions were\nvery original but the movie never got me in. The story was also not\nthat good. I would not take my daughter to the movie and it is that my\nfriend liked it, otherwise I would not even have finished it. I think\nthis is not what we are used to from Pixar. All the other Pixar movies\nwere watchable for adults and children but to be honest I thought it\nwas pretty awful. The beginning before the movie started made me\nalready feel that it would not be good. I can see why some people like\nit but I think there should have been a better storyline.\n"},
{"review": "\nI don't have a lot of reasons to give. All I can say is that every\nother Pixar movie I have rated a 10. I love animations, and the artwork\nfor this one is top notch. Pixar has been terrific at delivering great\nstories until this one. I even love CARS, which many others found fault\nwith. I wasn't in a bad mood when watching this one. I had great\nexpectations. It's simply sucks. It's made a lot of money and has over\nan 8 rating, so I'm in the minority here. I want to caution someone\nlike me to save their money so please read the other reviews with a 1\nstar rating. Maybe that will help guide you to a different movie to\nwatch.\n"},
{"review": "\nwhat a complete waste of time - read all the wonderful reviews that are\nmisleading, obviously these are the people that go to Disneyland about\n20 times a year - incredibly slow paced, especially after \"JOY\" &amp;\n\"SADNESS\" get sucked into another dimension where they befriend Bing\nBong, Riley's imaginary friend. Wow - it took forever. Bing Bong is the\nfilms JAR JAR BINKS, just so annoying and irritating. This is a\ndefinite G rated film. I did not see any adult themes whatsoever. This\nmovie makes Winnie The Pooh look like a horror film. This is for 12\nyear old girls. Parents are so delusional(thanks for the positive\nreviews Mom &amp; Dad)\n"},
{"review": "\nI'm like various reviewers who consider themselves Pixar fans. In fact,\nI'm an animated film fan and try to see the award winners whenever I\ncan. The beautiful colors and well developed art of Pixar is most often\nworth the cost of admission to me. But Inside Out is so awful it drove\nme and my significant other from the theater. The concept is much too\nheavy and involved to hold the attention of a child. Quickly obvious\nthat this will not be a bit lighthearted and plummets into bleakness.\nInside Out becomes doggedly repetitive, with the emotional balls in the\nair, flailing here and there. The characters in Pixar, have a\nnoticeable sameness of facial features and gestures. \"Joy\" is\nreminiscent of other females from past movies. This time, the female\nlead is so over-the-top that, after a short while, I wanted to shout\n\"shut up and go away!\" I went to be entertained and have a laugh or\ntwo. I came away feeling that I'd been emotionally beaten up yet bored\nto tears. Leaving before the ending was actually with a feeling of\nrelief at having escaped.\n"},
{"review": "\nI know there are lots of good reviews. The trailer looked good. Kids\nwanted to see it. But to be honest found it pretty boring and a waste\nof money. Where to start, well its an American movie. Just watch the\ntrailer, there isn't much more to it than the trailer, intact its best\nparts are in the trailer. It goes round in circles. Honestly for movies\nlike this there should be a warning for parents that it may cause\nsevere boredom. Anyway as cartoons go I suppose its fine.lacks laugh\nout loud humor and its lazy animation is disheartening. Pixar films are\nknown to pack an emotional punch and this doesn't have any of that. All\nit has to offer is a misguided heart that is visually displeasing.\n"},
{"review": "\nThis is an easy one for me as I agree with the other reviewers. I was\nsurprised as all I had heard and read about Inside Out led me to\nbelieve it was wonderful, so it's not me it's Pixar. Fortunately, I did\nnot have to pay extra as it was on the STARZ channel, which is part of\nmy TV package.<br><br>It is beautifully \"drawn\", the speech and lip movements are wonderful.\nBut I found it confusing and depressing. All those different colored\nballs rolling about, and the blue Depression was definitely annoying. I\nfeel sorry for parents who had anticipated being able to take their\nchildren to see \"Inside Out\". There aren't a lot of movies that are\nfamily oriented.<br><br>Pixar has made so many wonderful movies in the past and I know they can\nand have done better. I look forward to their next production.\n"},
{"review": "\nDo not take kids - or anyone to see this. What you will witness is the\nemotional breakdown of a teenager. How is that the subject of a kids\nmovie? <br><br>There is no fun. There is nothing positive. There is nothing to\ncelebrate about this movie. Do not waste your time or money. <br><br>Revisit Monster's Inc, and have fun together at a movie. <br><br>Listen, if a teacher gave your 5 or 6 year old a lesson on how to be a\nmoody, unengaged,depressed teenager, then you'd be after their neck.\nBut, stick a Disney sign on it, and it's entertainment? Are you kidding\nme? <br><br>This is sick stuff people, dreamed up by sick people!<br><br>STAY AWAY FROM IT!!!\n"},
{"review": "\nHorrible! <br><br>A few reasons this movie is nowhere near Toy Story//Nemo/Cars quality:\nTotally unlikeable flat characters, 0 original dialogue, too much\ntalking needed to get the scene/point across, no real laughs, dialogue\ndoesn't feel natural, voice acting never becomes \"real\" but remains\n\"acting\", it's too long/there's not enough content, music is in the way\nnow and then.<br><br>Just because the idea for this movie is \"fresh\" doesn't make it any\ngood. The idea does not count. The movie does.<br><br>Don't waste time with this! Complete crap! (and I love Pixar btw)\n"},
{"review": "\nOkay, let me start off by saying I LOVE Disney. I can honestly say that\nthere is no Disney movie that I dislike... But this movie was terrible.\n(I give it a 3 because it did make me laugh) I can honestly see why\npeople love it, but for me it just made me really annoyed with Sadness.\nFor the majority of the movie I was trying not to scream at the screen.\nFor example....SPOILER....The part when Sadness is touching all of the\nMemories....WHAT WAS SHE THINKING??? Shes like that one person you work\nwith who is miserable and make everyone else miserable. Like I said\nthere were some parts that I did like, but over all I spent the\nmajority of the movie annoyed with one character. <br><br>P.S. Please don't let my review sway you from watching it. This is just\nmy opinion...you have your own. :)\n"},
{"review": "\nInside out is basically your generic Hollywood movie starring your\ngeneric actors and actresses like Jennifer Aniston, except with\nanimation slapped on top of it. I tried watching this movie a year ago\ndue to all the buzz surrounding it, couldn't get past the first 15\nmins. Today I tried watching it again after seeing kung fu panda 3 and\nzootopia (which I loved both btw), couldn't get past the first 30\nminutes, and the additional 15 minutes I watched I was bored out of my\nmind. How it received such high votes is beyond me, but save your time\nthis moving is boring, and will only leave you feeling depressed at the\nend of it.\n"},
{"review": "\nI am sitting here watching this animated nightmare with my niece who\nseems to like the movie. I asked her; \"Is that it?...is that all the\nemotions they are presenting to you? Where is wisdom? Where is faith?\"\nThe film is disturbing as it presents no magic to being a kid. It seems\nto play a lot on getting down in this world and reacting with anger and\nfear. Joy tries to rescue the mind but is being manipulated by outside\nforces trying to be goofy but lost in deception. I am not sure what\nthis film is trying to suggest. I recall as a kid I use to have two\ncharacters in my head, little aliens, one good and one bad. They would\ndo battle but good would win out each time. Yet, the little\nmanipulative one would sometimes disguise himself as good. Yet, wisdom\nwould come into play and I would send both aliens out of my head. Is\nDisney being operated by a cult? Each film dumbs the mind with eye\ncandy tactics. Every time a Disney film ends my mind is left empty and\nmy memory is void of emotion. Use wisdom and stay away from this warped\ngarbage.\n"},
{"review": "\n....voila the heroine, upon arriving in San Francisco, has the GLBT\nseal of approval, aka the 'de rigeur' long-T multi-colored Jessie\nJacksonska 'mo fo' acceptance attire. Even allowing for that it wasn't\nlong before the film meandered into 'Esalen' idiocy and bluntly this\nmess is an agenda driven film.<br><br>Boring - the animation was 'cheap' almost close to the Hanna Barbera\ncrud of some 50 years ago - not well drawn <br><br>Compare it to a great cartoon film 'Wreck It Ralph' - no agenda, no\ncorny 'angst' a great film filled with classic one liners and actors\nthat bring a smile to every single scene.\n"},
{"review": "\nWe had high hopes after reading the reviews but closed the movie down\nnot even halfway in. A respected friend said that it had left him like\na wet dishrag so we were intrigued to learn about how an animated film\nmade for kids could possibly address such complex concepts. And we\nespecially wondered how it could have been such a hit with respected\ncritics and more importantly, young children. Sadly, we were completely\nbored. The animation is super-busy as is the dialogue. It's fun to hear\nthe voices of a superstar cast, and some of the ideas are very\ninsightful. But ultimately, it's a dull, boring movie with a high\nconcept -&gt; too wordy, leads nowhere, not worth hanging in to find out\n\"what happens\".\n"},
{"review": "\nWhile the concept is clever, and it does have some humorous bits,\nespecially in the closing credits, the overall execution of the story\nis poorly done. The story drags slowly, is very disconnected, and does\nnot engage the viewer, ending up with the movie being a totally boring\nwaste of time. I did not enjoy this film at all, even though it had a\nunicorn as a minor character.<br><br>The plot is one dimensional and does not go anywhere interesting. It\nreally needed more time spent in development to really make something\nworthwhile out of the concept. I do not understand why it is doing so\nwell. There is nothing creative in this film as opposed to Tomorrowland\nwhich was amazing and and brilliant! Do not waste your time on this\nfilm. It is not worth it.\n"},
{"review": "\nAll that money spent to make it and the movie misses the most important\npoint entirely! The most important human emotion is LOVE, not the other\nones that play key roles in the movie. And it is LOVE, Mr. Pete Docter,\nnot LAVA, but I guess it is pointless to explain what LOVE is to\nsomeone who does not put much value on it.<br><br>I did not know that children are supposed to scream at parents or throw\ntemper tantrum, or do other crazy things the girl in the movie did when\nshe did not like what her parents did. But according to Pete Docter it\nis perfectly OK and only natural for a 10 year old to do. Slamming\ndoors in parent's face is OK. Giving them silent treatment is OK, too,\naccording to the directors. But what is really bad, according to the\nmovie, is a healthy veggie pizza! What is really Inside Out is the\ndirector's understanding of values and what is good and what is bad.<br><br>Trust me - your child will get a lot of wrong ideas after watching this\npiece of junk. Save your money, go watch something else!\n"},
{"review": "\nWhat is wrong with reviewers these days? Good movies get bad reviews\nand bad ones get good reviews. This movie belonged to the later\ncategory. No where near the all-round quality of a movie with a 8+\nrating. Are the makers of the movie hiring third world reviewers to\ninflate the movie's rating? I think so. Numerous people hated this\nmovie just as I did, but the movie's rating suggests otherwise. There\nwere cute parts in the movie but was annoying and meanders along for\nthe majority of it. No wow factor here. It's just another Hollywood\nPonzi scheme.<br><br>1/10 to deflate rating to a more realistic value.\n"},
{"review": "\nWhat in the hell was that! More importantly, what has happened to\nDisney! The movie is a reflection of a society whose kids (and parents)\nare medicated and going to endless therapy. Do NOT take children to\nthis movie! Walt Disney is surely rolling in his grave watching this\ntripe! Compare Snow White and Cinderella to this thing! Eh gad. Disney\nshould fire whoever created this movie and somehow try to rediscover\nits roots--producing wholesome non-psychotic movies. Worst kids movie\nI've seen since the last minions move, which was likewise offensive and\nmindless. Why child needs to know about subconscious, nightmares, and\nscary clowns? What happened to Dumbo, and the long legacy of Disney\nclassic? Inside Out is a movie with little socially redeeming value.\n"},
{"review": "\nawesome premise, horrible execution.<br><br>in one word describing this movie: misandrist.<br><br>why do you say do i say this movie is anti-men?<br><br>so there are characters for each \"emotion\" all the male characters have\nmale emotions..the females all have female emotions.EXCEPT ANGER..its\nmale only and except FEAR it's a bubbling idiot of a \"man\"<br><br>the man hating comments almost never end.<br><br>i could go through every scene but i simply do not want to put myself\nthrough watching it again.<br><br>when Hollywood stops hating on men maybe they can get an acceptable\nrole in movies representing responsible parts of the family again. <br><br>otherwise expect more and more men going their own way.\n"},
{"review": "\nThere have been plenty of cartoon-movies that, even though they weren't\ngeared toward me, at least had something of interest. 'Inside Out' has\nnothing. Just saw it last night....and not once did anything peak my\ninterest even for a minute. If any man likes this movie, I just\nwouldn't know what to say.<br><br>It's just a bunch of emotion-cartoon-characters chasing emotion-balls\naround inside of the girl's head. Boring, annoying, and extremely\nchildish movie. Sure a very small child might like it. Maybe women like\nthe concept of these battling emotions. But for the average\nguy....trust me, it's of zero interest. It's not clever. It's very\nchildish and intended for children 8 and under.\n"},
{"review": "\nThis movie is Breaking The Waves for kids. An hour and a half of ever\ndeepening misery is not mitigated by a two minute happy ending. Wrap it\nin Christmas paper and call it \"It's a wonderful life Jr.\" Why would\nyou drag yourself over emotional broken glass for this long in the\nhopes of a positive resolution? Do you find joy in hitting yourself on\nthe head with a two by four, because you know that eventually the pain\nwill stop, like when you pass out? We watched this thing and got two,\ncount 'em two laughs. Not belly laughs, not guffaws, just mild\nchuckles. The rest was a harrowing, bewildering slide down into the\ndepths of despair while trying to comfort children who were showing\nmore and more signs of emotional distress. A waste of time and a waste\nof the talents involved.<br><br>It just plain sucks.\n"},
{"review": "\nI have 5 year old twins who saw the movie yesterday. My daughter left\nthe movie crying and cried several times during the film, it was much\nto heavy and sad for young kids. <br><br>What ever happened to happy kids movies that made us laugh and smile?<br><br>Dealing with depression in Big Hero 6 and now this, my kids don't need\nto learn about or try to understand these heavy subject lines.<br><br>I am also a big Pixar fan and as an adult there was no real storey line\nand none of the usual adult humour thrown in to keep it interesting for\neveryone. Although this was disappointing it was outweighed by the\ndepressing overall feeling to the entire movie and the fact that I was\neither explaining to my kids what was happening or consoling them from\ncrying. <br><br>I can't wait to see Minions at least we should get some smiles out of\nthat. I'm tired of leaving the movie theatre feeling worse than when we\nwent in.\n"},
{"review": "\nBecause the complexity of our brain, Inside Out had to add A LOT of\nscenes on \"how our brain works\". Plus, they had to think of how they're\ngoing to draw and make it for kids. There was WAY too much going on in\nthis movie and because of that you can't grasp the feeling of it. One\nscene would be about 5 minutes long and then BAM! you're onto the next\none. Solving problems after problems very quickly. The movie wasn't\nthat great. It was more of a drag movie than anything. The characters\nwere awful mainly because they all looked the same in everyone's head.\nJokes were typical... Wasn't that funny either, I didn't laugh much.\nPlus it's the \"ugh, that character annoys me so much.\" type of movie.\n"},
{"review": "\nInteresting concept but poorly done, expectations of an animated movie\nto entertain children are severely disappointing. <br><br>There is nothing in this film to entertain any young children it is\ndepressing and sad.<br><br>The first part of the film is nothing but fluff and time filler<br><br>The concepts and vocabulary are far beyond the comprehension of young\nchildren.<br><br>The plot line is full of holes and technical goofs.<br><br>A complete waste of time and effort, Pixar dropped the ball on this\none.\n"},
{"review": "\nNice animation, but I was looking for a comedy movie. The trailers made\nit seem funny, and it was a little, but when you constantly hear cry's\nfrom your own child and other children around the theater, it made you\nwant to leave. In fact, my five year old asked to leave twice during\nthe movie. How much sadness can you put into a family movie? There is a\nbig dose of sadness at the beginning. Then things really fall apart\nwhich is sad. Then things vanish which makes you sad. Then something is\nsacrificed and things are sad again. But sadness is OK..., right? No,\nnot when you want to see a comedy. If you want to see a funny movie,\nwatch the Minions, but not this movie.\n"},
{"review": "\nINSIDE OUT is a colorful animated feature that I doubt if Disney and\nPixar realize is probably too complex for the viewers they intend to\nreach. Riley(Kaitlyn Dias)is an 11 year old girl, who is really upset\nwith her mom(Diane Lane)and dad's(Kyle MacLachlan)decision to uproot\nand move the family to San Francisco. Riley is separated from her\nfriends and is just not so happy with dealing with a new house, school\nand city. She would rather be back in Minnesota playing hockey.<br><br>Most of the film takes place inside Riley's young brain where she must\ndeal with five emotions that dwell in Headquarters; there is Joy(Amy\nPoehler), Sadness(Phyllis Smith), Anger(Louis Black), Disgust(Mindy\nKailing) and Fear(Bill Hader)that jostle to and fro trying to dominate\ncontrol. Joy tends to be Riley's most important emotion trying to\nanchor her within a positive attitude.<br><br>Other actors lending their voices: Richard Kind, Bobby Moynihan, Dave\nGoetz, Frank Oz, John Cooley and Paula Pell.\n"},
{"review": "\nThis movie tries to explain the psychological functioning of emotions\nin a person added with wide factors of entertainment and also produces\na sense a philosophical thought. It can be called an informative yet\nattractive one. Especially the process of depicting emotions is very\nbeautifully explained. Every part of the screenplay has been done with\nan utmost care and that reflects when we observe that although many\nsituations are highlighted where entertainment was engaged but still\nthe motive of the movie to rely on subject was not at all disturbed. i\npersonally feel its a must watch for anyone as it help a lot in self\nunderstanding of our self and also gives a great scope for thought\nwhich we should focus on think about.\n"},
{"review": "\nThis is in all seriousness one of the funniest, best-written,\nawe-inspiring, and phenomenal films ever made. Actually my personal\nfavorite. Actually went to see this 3 times in the theater. I watch it\nevery chance I get I watch it on Starz and it never gets old. I just\ndon't understand the sudden hatred for this movie. What's not to like?\nThe cast, animation, script, humor, and direction were stupendous. This\nmovie has such a heart-warming moral. This earned its Academy Award.\nThe only way you couldn't enjoy this movie is to not have feelings.\nWatch it as a family, the kids will love it, I certainly did. It\ndefinitely gets a 10/10 out of me. That's my review of Inside Out.\n"},
{"review": "\nwhy so many people have to rate this movie being a bad one. I loved it,\nmy wife loved it and that result is very rare. The movie doesn't claim\nto explain the whole world in detail, but it is the first movie in a\nlong time which is made for children that tries it in an interesting\nway and for me succeeds in a lot of aspects. Finally not a stupid\ncartoon like, kids are crazy, just be crazy, oh so crazy movie for\nchildren and adults. It has a view on how peoples minds might work, it\nmust not be completely correct but it gives you stuff to think about.\nHow many movies where able to provoke that reaction from you in the\nlast time? I highly recommend it and we had a lot of joy and sadness\nwatching it.\n"},
{"review": "\nA big claim, yes. But for me, personally, I'm not sure I can fault this\nmovie, or think of any better.<br><br>I am 50, and have suffered from depression for as long as I can\nremember. Over the years I have tried all sorts of treatments, and read\na lot about the condition, including actually studying clinical\npsychology, in my quest to better understand the demons that plagued\nme. <br><br>Never have I come across a better depiction or description of the\ndepressive condition as I have experienced it, than is contained in\nthis film. It explains the darkness in a light way that enables me to\nsee the truths it contains without the feeling of horror that I usually\nfeel when encountering any such depiction in fiction, and has a message\nthat is not only hopeful but practical.<br><br>I cannot recommend it too highly for anyone with similar problems, or\nfor people who know depressives and want a bit of insight. It is no\nexaggeration to say that this film has changed, possibly saved, my\nlife. <br><br>I'm not sure if it's really for kids, though.\n"},
{"review": "\nFlaws notwithstanding, Inside Out is a capitalist's perverse dream come\ntrue -- however his dream manifests outside of his subconscious is\ncommendable within itself. It's a highly-anticipated film put out by\nthe biggest animation studio in the world, packed with enough goofy\njokes to satisfy children and enough reliably maudlin manipulation in\nthe form of homogenized adolescence to please adults. The concept\nexplodes with novelty and the animation is brilliant. And best of all,\nits main characters all come in fuzzy, furry, huggable forms that will\nno doubt sell mountains upon mountains of stuffed animals and other\nsuch material detritus until the faces of Joy, Sadness, Anger, Disgust,\nand Fear are plastered by fingerpaint-stained hands onto the pages of\nthe haplessly constructed book of icons and dank memes (\"o sh_t\nwaddup\").<br><br>Inside Out is blatantly artificial. The film is mired in concept and\nmarketability, sacrificing a solid narrative - which Pixar usually\npromises - as a result.\n"},
{"review": "\nInside Out is the story of how emotions work in our minds (in a girl's\nmind to be precise). The emotions, Joy and Sadness, wonder around the\ngirl's mind, aiming to find a way back to the controlling room where\nthey can help her through a big change in her life. The story is\ninteresting, but it gets boring towards the end, as the one twist\nfollows the other. Joy is a control freak, dictating every emotions'\nmove and pretty much dominating the girl's mood. Other than that, and\nthe overjoy-full mood, Inside out is funny and entertaining. The\ncolours are vivid and the action enough to make a good movie. But I\nguess the whole control room, memories, dreams etc etc are kind of\nconfusing, with all the islands and the maze. So 3 out of 10.\n"},
{"review": "\nI believe that this movie good in some aspects but not everything was\ngreat as everyone thinks it is. The movie clearly has screens within it\nthat copy and paste from 2001 osmosis Jones. Don't get wrong Jones was\nan OK movie the animation was great, designs were awesome and it did\nshow some workings of the inner body but way too many bad puns and\nstructural not good story brought the movie down some. Yet I'm\ndefending it the because Disney needs to stop doing taking concepts\nfrom other movies and making it their own. It's OK once in a while but\nthe brakes needs to be pumped because they have to come up with\nsomething original and clearly theirs\n"},
{"review": "\nSimply I will say this movie is great. Pete Docter gave us a\nmasterpiece Up and now this will be an instant classic.The Concept is\nmind blowing , Characters are so common and the way the concept is\nrepresented is so intriguing and so much so much great and the\nexecution is so perfect . I do not want to spoil anything about the\nmovie. Sadness is the best character to go with joy among anger , fear\nand disgust. It has its funny moments and some very sad tear jerking\nmoments. The way the whole childhood is represented is something we\ndon't see quite a lot and the way I mean the true way things that we do\nin our life and their consequences both for a parent and a child is\nshown are so great that it will hit you right in the brains and your\nheart.I know I can write a whole Novel praising this Movie but I don't\nwana spoil it.So DEFINITELY WATCH IT.It's an Experience of a\nlifetime.Classic. Masterpiece.\n"},
{"review": "\nHow does Pixar manage to get it right every single time?!! I've\npondered over it for quite a long time and never found the right\nreason. I guess, thinking about it more would do me no good!<br><br>Talking about the film's positives, the animation and CGI don't\ndisappoint.The color schemes for different characters were spot on. A\nspecial mention should go to the casting. Amy Poehler is the queen of\nplaying optimistic characters and she's proved it yet again with this\ntime. Phyllis Smith and Bill Hader's voice-overs are great too!<br><br>The movie is really hilarious and managed to crack me up several times\nthroughout. <br><br>It builds on themes like importance of core family values and\nfriendship and executes it to perfection.<br><br>I thoroughly enjoyed this movie and is definitely up there with Pixar's\nother classics like The Incredibles, Up, and Finding Nemo.\n"},
{"review": "\nFor the past few years, the Oscars for the best animation went to some\nundeserving ones like frozen, mainly for want of better movies. It is\nwith that apprehension that i watched Inside out. I am glad i took the\nleap of faith.<br><br>I absolutely loved the movie. Especially the way it dealt with tender\nemotions of a child reconciling to a major change in life. I must say\nthat it is not just about a child, but about adults also. I will not be\nable to say if the psychological processes shown in the movie are\nabsolutely correct, but they are very relatable. Most of the figurative\nused in the movie are to a large extent relatable: the imaginary friend\nand the its resigned oblivion; memories getting recycled when not being\nused and memories enriching aspects of a personality.<br><br>As with every children's movie, there is some preachiness. But i guess\nthat much can be tolerated as it is compensated with a profound idea.<br><br>There are funny parts as well in the movie but not very common.\nOverall, i would rate it a very good movie.\n"},
{"review": "\nit is a very good movie but I feel the charters are bad and the story\nseems bland and over made I men it like it a little but I think the\npeople kind make no sense and the story is all over the places and I\nfeel the people and the other charters make no sense the story is not a\ngood one but it need fixing but on the plus side I like the ways the\nstory plays out and the way the charter make4 I little sense but I feel\nthe story may need fixing and they charters seem bland and over used I\nmen when the charters joy and sadness was separated the story bacillus\nforced on and sadness was over use in the end and the movie did not\nmake much sense sorry but I feel that way\n"},
{"review": "\nFirst I'd like to say that as an 18 year old guy I usually don't get\ntoo emotional with movies, but this movie is different.<br><br>I think that this movie is well made, a great metaphor for the way that\nthings work in our mind.<br><br>I personally cried when Riley and her parents broke down together,\nbecause it made me think about my parents that love me and would give\ntheir whole life for me, once again Disney managed to break me down and\nI appreciate them for that!<br><br>So I'd recommend this movie to anyone, doesn't matter your age because\nits just a great movie :D\n"},
{"review": "\nInspiring as it was carefully laid out with amazing story boarding and\ngreat choices as a theme. The movie has made a wonderful approach\ntowards explaining the human emotions and the display of change of\nbehavior. Truly educational and a wonderful movie that fits for all\nviewers for all ages. <br><br>If I were to give a few examples of what made this film memorable is\nthe one with Riley's imaginary friend. I loved the idea on how the act\nof \"sacrifice\" was incorporated into the story and the lesson of taking\nresponsibility for the actions we take as a person. The story generally\nportrays how although simple were indeed the best times of their lives.<br><br>I think that merely writing a review about this story would not really\ngive enough justice for anyone who wishes to understand how surreal\nthis movie can affect the viewer. If it would be best, I would love to\nshare more about it yet, I guess it's one of those movies that would\nreally make the best to watch it.\n"},
{"review": "\nPixar last year made a movie that blew me away compared to the cars\nmovies that suck. No spoilers because you need to see it without seeing\nmuch from people spoiling for you because this is a experience like\nmany great Pixar movies like toy story or the incredibles . This has\nmany things that are just amazing it can make you cry this movies main\nplot is about emotions in a girl named Riley and that's all I will say\nbecause you don't need info on it because there nothing to ruin because\nit's a masterpiece by Pixar and gets a 9 it has its flaws that are\nlittle but overall in. My top 10 Animations of all Time Maybe it's that\ngood. <br><br>I enjoyed the whole movie and one of my favourite movies this decade as\nwell. all the voice actors were excellent in this film and also were\nthe characters in this film they were amazing in this film they make\nthis film so much better. The emotion is for me maybe the most\nemotional Pixar move ever.\n"},
{"review": "\nAfter watching this movie it became one of my favorite. Creators\nmanaged to merge good idea with humor and dramatic moments(for example\nmoment when BingBong sacrifice himself to help Joy escape, i almost\nbursted into tears, but suddenly i remembered that i'm 22). I think\nthat movie contains good lesson for children and adults that all things\nare important and have influence if they exist and we can't just throw\nor forget about them, because they make us those who we are, i mean\nJoy's attitude to Sad, further Joy understood it. Joy also a good\nexample of perseverance and positive thinking that's very important.\nCreators showed our mind from other side and explained how it works in\nvery available way. I watched it in one breath and recommend it to all.\n"},
{"review": "\nThis might be the closest we get, to see inside the heads of the\ncreative minds of Pixar (pun intended). And how wonderful it is in\nthere. The idea itself seems to great that you do wonder how no one has\nmade something as beautiful as this up until now. But Pixar proves\nagain, that even though the idea might be out there, it is able to make\nit work on so many levels with the layers attached.<br><br>Giving feelings a face and make them react a certain way is amazing.\nGiving them a way to grow and learn as if they were humans just adds to\nthat whole thing. There is so much going on here, that it would take\ntoo many words and space to go into detail of it all. But all that and\nthe message is still packed in a movie that is also entertaining and\nfunny. Something Pixar movies have succeeded in doing for quite some\ntime now ...\n"},
{"review": "\nInside Out is a sweet and original flick. It's unique story line\ndefinitely is what has driven people to watch it.<br><br>It is a movie for all ages and although the story line isn't the most\nstimulating and brilliant movie for an adult, it still can be enjoyed\nby one and it is the perfect movie to take your kids too.<br><br>The story line is cute and has a good moral throughout and really takes\non a different edge of the mind of a child and adult that can be quite\nrelatable to both.<br><br>Overall this is a very good movie for kids and a satisfying enough\nmovie for adults.\n"},
{"review": "\nInside Out is a 2015 American 3D computer-animated comedy-drama\nadventure film produced by Pixar Animation Studios and released by Walt\nDisney Pictures. The film was directed by Pete Docter and co-directed\nby Ronnie del Carmen, with a screenplay by Docter, Meg LeFauve and Josh\nCooley from a story by Docter and del Carmen. The film is set in the\nmind of a young girl named Riley Andersen, where five personified\nemotions\u0097Joy, Sadness, Anger, Fear, and Disgust \u0097try to lead her\nthrough life as her parents move from Minnesota to San Francisco and\nshe has to adjust to her new surroundings.<br><br>The film shows a adolescent girl, Riley's emotions. When I watched the\nfilm, I sympathize with Riley. The highlight of the film is that Riley\ngrows up as she experiences many things.\n"},
{"review": "\nWhat a terrific movie for the whole family. It gives very creative\ninsight into emotions and memories. The construct of this movie is very\nclever and insightful. An emotional roller coaster of a film that is\nmost definitely one of the best Disney / Pixar films of all time. This\ncoming from someone who grew up with the Lion King, Pinocchio, Beauty\nand the Beast, Toy Story, etc. Aside from this film being a huge box\noffice success and bringing me to tears multiple times I still find bad\nreviews on this website. The \"critics\" who are saying this movie is\nanything but phenomenal either didn't get enough hugs growing up or are\nsimply here to disregard quality. There are no other movies like this\none. Do not be dissuaded by the ignorance and lack of intelligence\nfound in bad reviews for this movie. Definitely worth 90 minutes of\nyour time!\n"},
{"review": "\nPerhaps the most psychologically complex animated film ever made, this\nis a huge return to form for Pixar. It's also incredibly fast-moving,\nfunny, and yes, deeply touching, although perhaps not as much as \"Toy\nStory 3\". The film also does an incredible job of world-building, so\nmuch so that one wonders if the film is too complicated for kids,\nalthough the gigantic box office would seem to indicate otherwise.\nFully deserving of its critical and financial success, this ranks with\nthe very best of Pixar. The film is cast to type: Amy Poehler as Joy\n(channeling Lesley Nope), Lewis Black as Anger, and they're all superb.\nA must-see.\n"},
{"review": "\nThe movie is kind of cute and I think it Would be a good fit for kids\naged 4-12. The story is very harmless. As an adult i found the story a\nbit slow. Liked some parts and looked at My clock at others.<br><br>If you need a lot going on in movies to find them interesting then this\nis not the movie for you. They could have made the story so mu h\nfunnier or have added a bit of humour in the way the characters\ninteract with each other bit did not. it disappointed but Well, it's\nwatchable.<br><br>It just wont be one of those movies that you watch time after time\nagain.\n"},
{"review": "\nWhat a wonderfully original idea. I can't imagine there having been\nanything like this before. It might have been a motion picture, or a\nshort, or an episode of a television series, or a television\nmini-series, or even a full-blown comedic television series. Who knows?\nIf it had been produced, it might have been on the air between 1991 and\n1994. It might have been a live action series rather than an animated\ncartoon or computer generated imagery animation. It might have been\nabout a male character with people in his head representing his\nthoughts, moods, emotions, or personalities, instead of a female\ncharacter. Just to be sure it would not have been a complete copy, it\nmight have had a completely different title. Like \"Herman's Head\". Just\nto be sure I completely made all of this up, feel free to look that\ntitle up in IMDb.\n"},
{"review": "\nThis is a movie about a basic list of emotions. I guess it is important\nfor kids to know that there is such a list of primary and secondary\nemotions - but there are tertiary emotions as well. It strikes me that\nsomeone was struggling to work this through a committee of some sort -\nit feels like more American self-congratulatory, 'WOW! Aren't we\nclever.' There are too many hands on the tiller of this one. It might\nbe a worthy flick for kids to discuss in class - particularly Psych 101\nor even Writing 101. The list: Love (affection, lust, longing), Joy\n(cheerfulness, zest, contentment, pride, optimism, enthrallment,\nrelief), Surprise (surprise - amazement, astonishment), Anger\n(irritation, exasperation, rage, disgust, envy, torment), Sadness\n(suffering, sadness, disappointment, shame, neglect, sympathy), Fear\n(horror, nervousness). Yes, it is a movie about a list.\n"},
{"review": "\nDo NOT see this movie unless you are either a Psych major, or have\nlived a life that is free from sorrow or emotional trauma. <br><br>As usual Pixar has produced a digital masterpiece, with an inventive\nplot, original characters, and loads of modern scientific content.\nHowever, unfortunately, they chose to depict a young child going\nthrough a deep existential crisis, in which all the bases of her\nemotional world view are shattered, crushed, collapsed, etc. <br><br>I was sobbing much of the way through, and off and on during the night.\nAbout 24 hours later I recovered enough to get back to my normal life\nactivities. In fact it made me want to go back on drugs, to assuage the\npain that it dredged up!<br><br>I advise \"taking a Valium\" beforehand, to minimize the effects of the\ndeep sadness.\n"},
{"review": "\n\"All we need is joy\" what is that kind of mind? We need all the\nfeelings, that makes us be human. The important thing is you have to\nlearn to control your feeling not run away from it. What kind of a life\nthat just full of joy, what a boring life to me then. Now after this\nmovie, people will have more reason and person to blame for their\nfailure. <br><br>Good Job, pixxar.<br><br>I'm gonna rate this movie is the worst movie that Pixxar ever made.<br><br>She just cant play the game because three dumb guys in her head can put\nthe ball to the right place? What the hell is that kind of situation,\nnow kid can have more reason to blame when then fail or doing something\nwrong, right?<br><br>\"Because 3 dumb guys in my head make me like that\"<br><br>Who? your 3 What in your head ?<br><br>Wake up, girl. Time to grow up\n"},
{"review": "\nI'll be short because I already feel like I've wasted enough time even\nseeing this film.<br><br>The main characters are emotions. Sadly the only characters one could\npotentially care about (The humans) are portrayed as robots or puppets\nin which the emotions are the puppeteers.<br><br>The film lags in the middle big time, I just wanted the bad jokes and\nboring middle to come to an end.<br><br>The idea that one is at the mercy of their emotions is very misinformed\nand a terrible message to send to kids.<br><br>Just so it's clear, I love Pixar films. Rarely am I disappointed. But\nthis is trash!\n"},
{"review": "\nSTART OF REVIEW: The idea of internal thoughts and emotions is nice and\nthere were a few moments which made us laugh. But the major part of the\nmovie was boring and depressive. I would say the cartoon is not for\nchildren. It was also annoying as one of the 2 major characters was\nsadness. I think Disney paid some foreign company to be upvoted to 8.6\nand cause me go and see and be disappointed with it. Shame. End of\nreview. I also don't get the need of IMDb to force you to write. a ten\nlines freaking review. if you can communicate the message with just\nfive linesssssssssssssssssssssssssssssssssssssssss!!!!! This is\nabsolute foolishness and i am just writing things up to fill this up\n"},
{"review": "\nI am really torn about this motion picture. I found it to be a very\ncreative premise, and a grand opportunity to showcase the inner\nworkings of the human mind in a very whimsical &amp; imaginative way.<br><br>As has been mentioned elsewhere, It is beautifully animated, and the\nvoice actors do their jobs Commendably. <br><br>Something went amiss, though, because the final Product is lacking in\nmany regards. What disappointed Me, was a noticeable absence of that\nhallmark, Disney humour, It was comical, and occasionally even frenetic\nin spots, but there were long stretches of near monotony and despair,\nnot entirely befitting of most Family entertainment.<br><br>I can't, for the life of me, ascertain who this movie is intended for.\nIt feels a bit Long-winded, a touch confusing and overly complex for\nyounger audiences, and yet a tad too simplistic for most Grown-up\nTastes. <br><br>Don't get me wrong, I didn't hate \"Inside out\", in fact, it had some,\nvery cute and lovely moments, but on the whole, just Wasn't quite up to\nDisney Pixar's, usually top-notch standards.\n"},
{"review": "\nI'd read that this movie is a contender for not only Best Animated\nmovie, but even Best Picture at the Oscars. This is a very different\nfilm to one I've seen from Disney/Pixar tackling a very adult theme in\nhuman emotions. It's clever in the way it portrays the emotions and\ntakes us into the world of the subject's mind. What loses it for me is\nthat the film seems lost between playing out as a psychiatric\nexperiment and being a film to entertain little children. The moral of\nthe story seems lost amongst the confusing adventure within the\nsubject's brain. The concept is certainly original and no doubt will be\nused as a talking forum in biology or human development lessons for\nyears to come...it belongs in educational circles.\n"},
{"review": "\nPixar took a familiar idea, personifying emotions, and decided to tell\na story about them running rampant, tearing a girl's memory apart and\ndestroying her personality. The problem is that emotions don't govern a\nself-conscious person's thoughts, they only inform them. This is only\nthe first of the film's many inconsistencies.<br><br>There are too many moments where a plot device is introduced but\npromptly ignored for convenience of the story they wanted to tell. The\nover-simplified emotions present clumsy and sometimes offensive\nstereotypes of themselves and other characters. The narrative feels\nlike a pasted-together brainstorming session and concludes itself with\na solution that should've been common sense from the beginning.<br><br>It's easy to dismiss these criticisms as being irrelevant in a\nchildren's film, but Pixar doesn't make films exclusively for children.\nThis simply isn't a good movie.\n"},
{"review": "\nOne of the worst movies ever. Yes the movie was animated great and the\nmovie flowed well etc. Technically it was a great movie. <br><br>On the other hand I felt horrible through 99% of this movie. I would\nhave walked out if it wasn't for the fact that it was \"Father's Day\"\nand I was there with my daughter. <br><br>The movie was mainly negative. Sad and depressing things happen\nthroughout the story. <br><br>Didn't hear anyone, parents or children say they wanted to come back\nand watch this movie again. My daughter was depressed for part of the\nday afterwards. Not happy about this movie at all. <br><br>Do not recommend for anyone with children who have depression or\ntroubles in their life.\n"},
{"review": "\nHardly Pixar disappoints , and Inside Out is no different , the story\nis original and excellent, the characters are great , the voice work is\nexcellent, the movie is not as funny, more can get good laughs , the\nfilm is hilarious, Visual animation is beautiful, the soundtrack is\ngood , the film has some characters dull , and a moment that should not\nhave in the movie , the more the rhythm is good , you do not see the\ntime passing , he deserved too the best of Oscar animation, and I dare\nsay that it should be given to the best film, and perhaps win best\noriginal screenplay because it really is very unique history, Inside\nOut is not the best animation of Pixar comes more easily in the Top 5.\nNote 8.8\n"},
{"review": "\nThis movie is a very creative and extraordinary animation about Reley's\nlife, she is eleven years old, she lives with her parents and she is\nvery happy, but her life changes completely when something happens. Her\nmind is controlled by five emotions, happiness, fear, disgust, sadness\nand fury. They guide Reley in her new life, this emotions stay in a\ncontrol room where they can see what happens in her day and create a\nemotional answer. Our opinion is that everybody should watch this movie\nbecause it makes we think about our childhood and value it, so if you\nwant to remember your childhood, watch this movie. This animation is\nnot only for kids because it brings a beautiful message for us.\n"},
{"review": "\nMy favorite animation since The Incredibles. Thank you Pixar! I didn't\nexpect this film to be so funny, touching, and deep. The incredible\nsetting of the mind is creative and fun to explore. I love the physical\nportrayal of the value system, the long-term/short-term memories, the\ntrain of thought, the abstract world, the imagination and so much more.\nThere's a lot of visualization of concepts that I thought was really\nclever. For example, when Riley lost her train of thought, the train to\nbrain control room collapsed in the middle. This film taught me about\nsadness and how we handle emotions more than I realized. We can see the\ncharacters undergo changes as Riley undergo her perfect change. This\nfilm is perfect.\n"},
{"review": "\nHaving going inside someone's mind &amp; depicting it's working is merely a\nbrilliant concept. This movie takes us on a ride inside a new born\ngirl's mind and how her main emotions - joy, anger, disgust, fear,\nsadness tackles with each other as she grows. The movie shows us the\nreal need of every emotion but in right amount at every step of our\nlife. It is hard to find our real personality when even a single\nemotions is been neglected by us.<br><br>The screenplay, the animation, the characterization of each emotion is\npar excellence. The small creative ideas about how our mind works is\ndepicted so wonderfully that one can related to its existence in our\nown mind. The film celebrates the life &amp; the living.<br><br>And yeah, no matter is what situation you are in life, never loose your\npersonality islands, not a single one!\n"},
{"review": "\nI love this movie so much!I went to the movie theater twice because I\nwanted to see it again! Although the movie does have it's sad parts,\nthat doesn't ruin the movie! I cried, laughed and was even a little\nsurprised watching this film. Inside Out was beautifully animated and\nhad great actors/actresses to voice the characters! I give this movie\n9/10 stars and I would totally recommend this movie to anybody over the\nage of 7 years maybe 8 if your kid is sensitive. The only reason why I\ndidn't give this movie 10 out of 10 stars was because some the plot was\nvery sad and Joy said way too much in the film \"We have to get beck to\nheadquarters.\" P.S the end credits are funny too! I would also compare\nthis movie to some of Pete Doctors other great films like Monsters Inc\nand Up!\n"},
{"review": "\nMaybe the best animated movies I've ever seen, 'Inside Out' is very\ncreative and touching at the same time. It makes you think about\neverything that could be going on inside the mind of a child when she's\ngoing through difficult adjustments in her life, and more generally,\nwhat goes on inside all of us. I'm not sure why the film has drawn such\nire from some viewers, maybe it's just one of those love/hate movies,\nor maybe you (or a loved one) have to have gone through a serious\nstruggle to have it resonate. I loved the poignant scenes of leaving\nchildhood memories behind (wow! these were just stunning to me), and\nhow the somewhat unlikely hero turned out to be little Sadness.\n"},
{"review": "\nThis is easily one of the most complex children's films I have ever\nseen, and I simply do not understand the hatred for it. It is in no way\ninappropriate for children, and presents it's complexity in a way\nchildren can completely understand, and people accuse it of teaching\nbad morals, when they completely do not understand. The animation is\nbeautiful, and stunning to look at. I consider it on par with something\nlike spirited away, and it milks all the emotion from every scene. The\nonly emotions themselves are very entertaining. People are accusing Joy\nof being a bully to sadness, not understanding that it's a metaphor for\nthe tone trying to keep the way it is. The film is very emotional and\nalways milks all the drama possible from each scene, but still keeps it\nreasonable. I loved it and everyone I know love it and nobody can take\nthat away.\n"},
{"review": "\nyeah the idea of inside of mind is good and personally i like Pete\ndoctor's movies.but you are trying show the problem of inside mind\ncreatures and effect on her real life but when you start showing\nfoolish and childish things than i starts sleep.yeah there are amazing\nother important contains of a best movie. but the \"story\" the \"soul\" of\nevery movie focus on the problems of the inside mind creatures which\nare non sense.and now people starts talking that inside out is the best\nmovie of the all time but are they really sure. didn't they watch\n\"spirited away\" or the \"grave of the fire flies\" at the end i want to\nsay yeah it is a one of the best movie but not the best.\n"},
{"review": "\nImmediately after watching I was so disappointed and a little\ndepressed. I thought how is this a Disney/Pixar movie? And it is\ndefinitely not for little ones! It should have a 10 and up rating. The\nnext day I was still thinking about this film, it is very thought\nprovoking and it deals with depression in kids today. So on the one\nhand I didn't like it because it was not a feel good Disney movie we\nare used to. But on the other hand if it can let preteens know they are\nnot alone with depression then the movie is a success. Thankfully I\ndon't battle depression but I know many that do. Trying to look at it\nfrom that point of view the movie make sense and if it can help kids\nlearn to talk about their feelings then it was a success! I applaud\nthem for trying to help kids with a very real problem in today's world.\n"},
{"review": "\nThis was a good film. I think it's more for adults than kids. The movie\ncreates personalities in this girl's mind. They are joy, fear, disgust,\nanger, and sadness. And these 4 control her actions and feelings. She\nmoves to San Fransico and is OK with it at first. Then joy and sadness\nget sucked out of the control tower, so without joy, she can no longer\nbe happy. So the middle of the film is about those 2 trying to get back\nand meanwhile the girl is mad because anger takes control. After joy\nand sadness overcome many obstacles to get back, they stop the girl\nfrom running away.<br><br>FINAL VERDICT: It's just a cute film. Check it out.\n"},
{"review": "\nI have to say this film gave me quite a lot of mixed emotions of the\nway the film was done out like I was laughing from the whole beginning\nof it. Then I was getting freaked out when the islands were going down\nand of course sadness came around when they couldn't get back to their\nheadquarters &amp; of course, Bingbong disappearing. Then of course when it\nwas the ending, I became happy again. I'm like jaysus, I never realize\nthat I'm full of emotions when the actual film was very much based on\nhuman emotions!<br><br>You know, Disney nowadays are pretty much keeping their movies so\ninnocent in which I'm glad they are doing this regardless. <br><br>I will show this to kid but there are some scenes intense lemme tell\nyou!\n"},
{"review": "\nFirst off the really low review flabbergast me. I found this movie\nincredibly moving but then I am an adult with no children. This might\nbe an animated feature but it is most definitely not for children. If\nanything I wouldn't recommend it to anyone who hasn't gotten a good\ngrip on their childhood. This is about Riley. Riley is a happy child\nbut then her life suddenly changes when her family moves and a sequence\nof unfortunate events happens. A large part of the story happens\n\"inside her\" and shows her emotions as characters. The character of Joy\nhas always been the one in control until Sadness makes an unfortunate\nerror that puts them both on a journey of discovery inside Riley and\nthey both discover who Riley really is. This is by no means a perfect\nmovie and again not for children but I would recommend it to anyone who\nhas a firm grasp on their past and likes a good animated story. My\noverall takeaway was that all emotions have value.\n"},
{"review": "\nBefore I started this movie I knew that it would be a psychologically\nwell thought movie because it described the human mind so perfectly\nthat it is right now used in Psychotherapy sessions. With that in mind\nI watched through the whole movie and the thought that was put into it\nwas amazing. Everything happened for a reason. I would never say this\nis just a movie for kids. Yes kids will love it but many times the kids\nwont even comprehend the level of detail and thought that was put into\nthe movie. The production is normal though, nothing special about the\neffects more then todays Animation movies but still an amazing script\nand an amazing story which actually is pretty simple but still gives a\nfunny and a new look into a humans mind with a lot of comedy that both\nparents and kids will laugh at.\n"},
{"review": "\nPossibly the deepest Pixar film I've ever seen. It's message is\nimportant and can be applied to every person from all walks of life. I\nviewed it as a mental health metaphor. Sadness is depression, fear is\nanxiety, happiness and anger are the two that form bipolar and disgust\nis the little things that can send people off. It is a really good film\nand not just for kids. <br><br>Perfect in every way. Maybe if it wasn't as focused for children, the\nfilm could have dug further into the mental health side of things and\nmade it more adult like. But realistically, this film has an important\nmessage that everybody should learn.\n"},
{"review": "\nI like animated films but usually if it's PG you get some inside adult\njokes but nothing but childish thoughts here. Stay away if you expect a\nShrek type movie. The acting is good and the story is great for kids\nbut I was disappointed that there is nothing here for adults. If you\nare going to the movies to pay premium prices and expensive candy then\nthe adults should get some enjoyment as well. I think this is the worst\nPixar film to date. Remember Adults pay for the time, money and the\ntime it takes to make the money to go see a movie. Don't waste the\nadults time here. Certain adults I can understand would enjoy this film\nbut mature adults will not enjoy this film in the theater. Wait to get\nit on Blu-Ray and leave the room while your children enjoy this good\nmovie for them.\n"},
{"review": "\nOne thing which fascinates me with the general Pixar output is the\nstreak of melancholy in so many of their films: Woody and Buzz's\nawareness of the ephemeral nature of life, Mr. Incredible's mid-life\ncrisis, Wall-E's post-apocalyptic world, and the loneliness of Carl\nFrederickson quickly spring to mind. Inside Out (2015) continues this\ntradition with its examination of the inherent melancholy in life.<br><br>The commercials and trailers show off the bright colors and sparkling\ncomedy, but there is so much more beneath the candy colored surface.\nThis is a story about the pain and alienation that comes with growing\nup. In a society where we want to push past unpleasant aspects of life\nwithout reflecting, where we want to rush as fast as possible, this\nfilm gives us an important lesson: sadness is necessary, grief is\nessential, and whenever we confront pain in our lives, we must not try\nto brave the path by ourselves. It's extraordinary and moving, proof\nthat Pixar is back on track giving us modern classics and not tripe.\n"},
{"review": "\nI gave it a 5 because it wasn't awful. Maybe a 6 would be more fair,\nbut only just barely. Maybe. The 5 is somewhat of a reaction to the\nalmost 9 overall IMDb score. But i am more comfortable with 5, so I am\nsticking with it.<br><br>Inside Out is a good movie for kids. For adults, it is pretty lame. 5\nemotions? C'mon, only a youngster is going to buy that, 'cause they\ndon't know any better. And about the message, that if you want people\nto help you out, you have to going around moping, so they will see you\nare upset, and maybe help you out. That is a lame message, even for a\ntoddler.<br><br>This movie is a very ordinary cartoon movie. I was really disappointed,\nand only got talked into seeing a kid's movie, because of the 9+\nratings on here at the time I went to see it a week ago.\n"},
{"review": "\nI honestly do not know how this film is being given ratings of 10. <br><br>This is an example of a film which didn't know what it wanted to be.\nFirstly what is the target audience? The style of animation is clearly\naimed at children, but the content simply is not. To make any sort of\nsense out of the unfocused storyline you need an adults understanding\nof the underlying material, which is hopelessly dumbed down, to the\npoint of actually being wrong anyway. You also need a reasonable degree\nof empathy, or to have experienced such feelings, something younger\nchildren typically do not have<br><br>Then there is the question of who is the main character, Joy or Riley?\nBecause what you have are 2 simultaneous plot lines (such that they\nare), linked through metaphor only, blurred by the failed attempt to\ngive the emotions separate personalities<br><br>Ratings of 1 are overly harsh in my opinion, there are far worse films,\nbut once you start thinking about it, it just isn't great.\n"},
{"review": "\nFrom all the hype, I had to see how good the best movie ever was. Tried\nkeeping my expectations reasonable.<br><br>\"Was it interesting?\" It is extremely interesting, which was a bit of a\nproblem. I kept getting distracted by trying to analyze what the\ninternal mechanisms effect had on the outside world.<br><br>2 out of 3.<br><br>\"Was it memorable?\" With great characters and wildly imaginative world,\nthis definitely is one of the best Pixar movies. I did find the outside\ncharacters to be a little flat.<br><br>2 out of 3.<br><br>\"Was it entertaining?\" I always love a good adventure. This one had a\nfew parts that were somewhat formulaic, but overall a great time.<br><br>2 out of 3.<br><br>Starting with 1 (for some reason I seem to forget), 1+2+2+2=7 A solid\nmovie, and for an animated movie made in the US, that is saying\nsomething.\n"},
{"review": "\nAbout three months ago I started to watch this movie and about five\nminutes into it, I decided to switch it off because it did not catch my\nattention and I thought it was going to be boring. I recently decided\nto give it another go and forced my way beyond the five minute barrier\nand I'm really glad I did so. This has got to be one of the cleverest\nand funniest animations ever created. I think there is so much to\nabsorb than meets the eye. I'm convinced that I'm going to have to\nwatch it at least twice through again to understand it fully because\nI'm sure there's loads of detail that I did not pick up on the first\ntime through. One of the funniest scenes was during the end credits\ninvolving a cat. It had me in fits of laughter. I totally recommend\nthis movie.\n"},
{"review": "\nHow are people rating this badly? What is wrong with people?? What, it\nwasn't like Toy Story???? IT ISN'T TOY STORY! It's a pretty excellent\nway for people to associate with the emotions of their child or\nparent... If you couldn't follow it, there's something wrong with you -\nnot the film. If your child can't follow it, talk through it with them\n- because they will have a far better understanding of how to look out\nand help others. <br><br>Sorry for the intensity - but come on! How could you not appreciate\nwhat this film set out to do - AND DID PERFECTLY!??<br><br>The brain is a fragile thing and this film really helps everyone\nappreciate all the emotions that are flying around one's head...<br><br>LOVED THIS LITTLE KIDS FLICK !\n"},
{"review": "\nThis is not the greatest movie ever made.<br><br>But it is, without question, one of the most innovative and creative.<br><br>Early on I wasn't particularly impressed. But as it developed - and it\nmost definitely developed, it didn't just move along - it became truly\ninteresting.<br><br>I can't imagine what a 10 year old child would get out of this movie.<br><br>But as a 64 year old man who sees some of his memories start to vanish\nlike that pink elephant that even joy cannot save, I found its\nmeditation on the importance of core memories - and the problems when\nthey are lost - to be deeply moving.<br><br>One of the very best things about this movie is that the issues are not\ndiscussed to death. Sometimes you just have to draw your own\nconclusions from what happens. The I's are not all dotted and the T's\nare not all crossed. It's really a movie made for intelligent adults.\nIf children enjoy it, so much the better.\n"},
{"review": "\nAs a cartoon movie for kids, I would say it is remarkable. The most\noutstanding thing in this movie is the perspective which is new and\nfresh. It illustrates two lines that are causal but also parallel at\nthe same time and it is like telling a story in two views, which\nimpresses the audience on its topic: Happiness. The meaning is not deep\nbut the way the film tells it bears watching. <br><br>Again, excellent imagination in this cartoon movie, which gives a\nfantastic base to the story. People would feel special and be\nattracted.<br><br>However, as a young adult watching this movie, I am not highly\nrecommending it because I find many jokes in it a bit childish and some\nharshness in some parts of the story.\n"},
{"review": "\nA Pixar movie, like the rest, I had great hopes paying the cinema\nprice, rather than waiting for it on Sky in 12 months, but when you\nhear rave reviews, it usually means hype to compensate. Or bogus posts.<br><br>Sadly for me, a very average film. <br><br>I went to a 3.30pm showing, but was finding my eyes closing after 20\nminutes.<br><br>One emotional part late on, but the rest was just going through the\nmotions. Colourful, nice idea, but everything was a bit drawn out.<br><br>Lots of language young children (U rating) would not understand too -\ne.g \"I rest my case\".<br><br>Monsters University was the same, so come on Pixar, find a gem to get\nback on the horse with.\n"},
{"review": "\nIt's a well-written story, and another Pixar movie well-done. That\nsaid, this is not a movie for very young children because they won't\nappreciate or understand the plots or what adolescents might go\nthrough. As I watched this over the July 4th weekend, there were a\ncouple of families with very young children walking out, which I'm not\ntotally surprised. But it's a story that all parents and grown-ups can\nrelate to, that childhood is not always sunny and rosy. It is thus that\nSadness is as important as the part that Joy plays, that our childhood\nwill always be multi-colored. In time, some of our childhood memory,\nlike Bing Bong, will fade away and disappear, which goes hand in hand\nwith sadness, but they are the foundation that new life and memory will\nbe built on. And our life will grow richer and more complex as a\nresult. If you feel part sad, but mostly happy, the movie has done its\njob. My kids (teens) enjoy the movie as much as I do.\n"},
{"review": "\nI went with high expectations for this film from the feedback it\nreceived. I was not disappointed the film is well written and has an\ninteresting perspective of how the mind works. I left the theater\nthinking of all the different emotions we have and really how they\nwork. The movie is funny and quite sad at some points. Its a feel good\nfamily movie that adults can enjoy with their children. The voices go\nwith each character as well as the different moods. Pixar has stepped\nup their game with this one it is up there with toy story and up. I\nrecommend you see this movie it is fun for children as well as adults.\nSome of the context is set up for adults to understand. It is not a\nwaste of time to take acouple hours out of the heat and see a fun\nheartwarming film.\n"},
{"review": "\nI greatly enjoyed this movie and think it was really well made in terms\nof content and delivery. Sure, you could say that cartoons like this\nare childish but the movie was fun and the content made me thinking. I\nlike the idea of personifying emotions that is prominent in this film\nas it made me think about the human psychology and even my personal way\nof dealing with the different emotions. Nevertheless, some stereotypes\nwere a bit overused and unnecessary for the enjoyment of the film. I\nthink this film is worth watching for anyone but especially for\nreflective people or anyone else who is trying to understand their\nemotions, whatever the age.\n"},
{"review": "\nFinally got to see this movie with the kids a few days ago. A few\nthoughts: 1) We all have nearly impossible expectations for Pixar\nfilms. This one \"seems\" to have lived up to the old standards. There is\nsomething for everyone: slapstick action for kids, thoughtful dialog,\nand mature themes for adults to digest. Finally, tear-jerking moments\nfor those who are affected by the Pixar emotion machine. In other\nwords, this is far above \"Cars\" or \"Cars 2.\" 2) It's not a original\nidea. This is basically animated \"Herman's Head\" which was a fun,\nlittle low-budget TV sitcom. 3) The first 30-40 minutes was pretty\npainful because the movie actually I had two beginnings: first was to\nintroduce the humans, and the second was to introduce the emotions. I\nwas bored. 4) However, the movie really began to \"move\" once Joy and\nSadness got on the train for the first time. 5) The animation is\nawesome as usual. I still see the orbs when I close my eyes.\n"},
{"review": "\nWhat an astounding comeback for Pixar after about 5 years of\ndisappointments they show they haven't lost they're touch. Pixar brings\nus another unique idea with unique characters. The characters that\nstand out are Joy, Sadness, and Anger who are brilliantly casted and\ndid amazing jobs of bringing the characters to life. This is without a\ndoubt Pixar's best film in years. The only negative I can say about it\nis the story is a little overdone and I've seen it many times before.\nBut that is a minor issue barely worth mentioning. In the end I look\nforward to watching this film over and over again. Inside and out. Here\nare the grades I give it. Animation: A Characters: A Story/Plot: B-\nUniqueness: A+ Voice Acting: A- Overall: A\n"},
{"review": "\nI just recently went to see this with a friend, and I loved it!!! I was\na ready to bring out the tissues, just in case, because I read many\nreviews that it was very sad, but it is not as sad as people say it is.\nI do believe that this movie is better for ages 8 and up, just because\nit can be confusing, but the animation is worth it. There are only\nmaybe 3 really emotional scenes, but that varies on your child. I would\nrecommend having a talk with your child after the movie, so they\nunderstand all the emotional content better. There are some sad scenes,\nbut there is a lot of humor as well. It is an excellent movie. The\nyounger kids will probably love the animation most of all. Highly\nrecommend.\n"},
{"review": "\nThe film is one of the best ever movies that Pixar has made. As it\nshows the five emotions...Anger, Joy, Sadness, Fear, and Disgust. As it\ninvolves an eleven-year old girl Riley. <br><br>She has to move from MN to SF as she is sad to move from her own home.\nAs her dad has a job with a start up company. Though Joy the main\nemotion for Riley but Sadness, not treated like an equal, as Sadness on\naccident gives way to the young girl moving. <br><br>Her parents say that she is getting an attitude. But it is really just\nher being sad from moving away from her friends and what she has known. <br><br>As Joy gets sucked out of headquarters along with Sadness as they were\nbutting heads over her emotions over the move. Now both must put aside\ntheir differences and try to work things out and get Riley over her\nemotions and moving.<br><br>Really one of the best Pixar movies ever made. It does show we have\nemotions. Just how we control them or them controlling us.\n"},
{"review": "\nIt has been a while since we saw an animation that well Done, But the\nmost important thing to say about this movie is that they really\nfocused on the story it self. Its full of emotions and everyone can\nrelate to. <br><br>Although the idea is based on something we all thought of, But the\namount of imagination and the focus on details is very impressive.\nTaking ordinary everyday action and providing a whole new perspective\nthat make you want to believe for a second. <br><br>This film is funny, but its humor doesn't extend over to destroy the\npurity of the story that makes it more enjoyable. <br><br>Highly recommend it.\n"},
{"review": "\nAm I the only one who wasn't blown away by Inside Out? I mean, don't\nget me wrong. It wasn't bad. Just... alright. Easily one of Pixar's\nweakest, though. The whole thing felt average and I was wondering if\nthe movie was trying too hard to make people cry. It's hard to explain,\nbut basically it felt more forced than usual.<br><br>Some of the jokes were a bit hit and miss for me, and as each character\nis stuck to one trait pretty much the whole time, the jokes become\nrepetitive. I thought Joy was one of the weakest protagonists we've had\nfrom Pixar since Brave, and Riley felt like a robot to me so I never\nreally cared about her, unfortunately.<br><br>It's their most gimmicky movie as well. They go through different parts\nof the brain just to hope people will be visually pleased enough to\nlook past the weak script and characters. Pixar has been a bit shaky\nthe last three times, as anything not a sequel seems to get an\nundeserved boatload of praise. It was average at best, but seeing\npeople put it as the best Pixar movie, is utterly baffling to me.<br><br>6/10\n"},
{"review": "\nI didn't cry at all here. I hate dramas. I love to just be pleasantly\nentertained. I was worried about this movie, making me feel stuff. I'm\na psychology graduate and this movie was cute. It lightly followed\npsychology but mixed it with fantasy. If you think of it this way, the\nhuman mind can only hold 1,000,000 pieces of information. People have\nsaid this is depressing, because it shows that we forget things about\nour childhood. I've an only child. I know childhood is precious. But\nlet your child grow and learn new things. It's a blessing to have\nchildren grow up before your eyes. Some people don't get that\nopportunity. I don't remember every single memory growing up, but if I\ndid, I would be grossly overwhelmed. The individual memories made me\nwho I am, but ultimately I choose to make me who I am. Along with my\nbrain chemistry. What I do remember is that I have parents who love me,\nand I was subjected to enough dysfunction to make me funny. Let's\nlighten up. Your children are a miracle. Growing up is a gift. Life\nisn't easy. Family and friends are key. :)\n"},
{"review": "\nI was able to see an early screening of this movie and had heard that\ncritics were calling it one of Pixar's best. After watching it, I would\nhave to agree. The animation was great(as usual for Disney movies) and\nthe storytelling was clear and easy to understand. But to me, the thing\nthat would make or break this film is the comedy in it. And in my\nopinion, it was extremely funny. The characters(emotions) in the film\nare funny and memorable. One of my favorite characters is Riley's\nimaginary friend, Bing Bong(my favorite emotion is the hilarious\nAnger.) There are also certainly some touching moments in the movie but\nit is balanced with the comedy so as not to be too sappy. For me the\nonly problem with the film is it's scope(the whole movie takes place in\nSan Francisco except the very beginning) and lack of adventure (outside\nof the mind), but it makes up for it with creativity, comedy, and great\nstorytelling and characters. I would rank this as one of Pixar's top\nfive.<br><br>8.5/10\n"},
{"review": "\nInside out is certainly in line with Toy Story trilogy, up, and Wall-E.\nGreat concept difficult to handle with real humans or may be animation\ngave more option to express required emotion. Of course Pixar animation\noften exceeds human equals. Sure this movie can be recommended as a\npart of Psychology 101for school kids. It would be helpful if a brief\nintroduction was included for the benefit of younger kids. Again Pixar\nmagic.Well researched movie. Certainly will help kids and parents\nremember and appreciate the importance of family, friends and moral\nvalues. Sad reminder of how the society is moving away from the basics\nof life. Hope we learn and rewind.\n"},
{"review": "\nWe love kids movies, and though sometimes they have sad moments,\ngenerally speaking they aren't entirely sad. This one is close. I'd say\nabout 80% of it was just sad.<br><br>We took our two boys, ages 9 and 11, and we all four came out not\nimpressed, and a bit down.<br><br>It didn't have the typical 'adult humor' that many kids movies do, and\nthe boys didn't enjoy it all.<br><br>Contrary to what others are saying, we felt perhaps it was geared\ntowards a much younger audience.<br><br>My wife was VERY unhappy that I talked her into attending this one and\nneither of us understood the overwhelmingly positive reviews.\n"},
{"review": "\nMust see if you ask me. This movie shows how emotions work in your\nmind. They took an example of how the emotions work in the brain of a\ngirl until her teenage years. It will teach you that every emotion is\nimportant, even sadness. Because it is OK to feel sad sometimes, get it\nall out. You have to have a balance. The fact that it is an animation\nmovie does not mean its (only) for children. But I think that this can\nbe a beautiful way to teach children (and everyone really) about\nemotions! I think it was about time that they dare to make a animation\nmovie like this. With a deeper message. It is a big surprise to me that\nsome people don't like it. Probably because they didn't expect an\nanimation film to be this educated. <br><br>Really beautiful and fun movie!\n"},
{"review": "\nFantastic movie to make children and adults aware of the many things\nthat go on inside the mind and how it relates to behavior. It was quite\ndaring to try represent the human mind with all its complexities.\nAlthough they made a great job, easy for children and non- expert\nadults, they missed very fundamental areas of the mind as executive\ncontrol and volition, including our capacity to regulate emotions!...\nThey might have left it for a possible second part, but this capacity\ngrows from much earlier than the age of Riley in the actual movie. In\nany case, is a must see movie, funny and smart, certainly provoking\nmany trains of thoughts!! ;)\n"}
]