[
{"review": "\nEven though I had read a number of critical articles about Noah, I went\nanyway on opening day. I thought I'd give it the benefit of the doubt.\nEven giving it that benefit, it was one of the worst movies I have\nseen. I was not expecting a completely Biblical account of the Noah\nstory, and knew that additions to the story would have to be added,\nsince the Bible version is quite brief. However, who would have thought\nthat would mean weird talking Rock creatures, which looked like they\ncame from a Transformer movie. And the area where Noah lived was\ntotally barren rock....until he planted the seed Methuzalah gave him,\nand immediately an entire forest shoots up out of the ground, to supply\nwood to build the ark. When the \"flood\" came, instead of it starting to\nrain, huge columns of water were shooting up from the ground. What's\nwith that?<br><br>I was especially looking forward to the animal scenes, since the Humane\nSociety commended the director for not using any real animals in the\nfilming. Well, that was more than obvious! Computer animation has come\na long way over the years, but this movie apparently used one of the\nearliest versions of CG. It looked totally fake, and all occurred in\nabout a minute. <br><br>The acting was terrible, including Russell Crowe. And the script was\neven worse. After a very climactic scene, where he almost killed the\ntwin babies in a state of rage, he explains that \"All I saw was love.\"\nI almost left at that point!<br><br>If one reads all the reader reviews, I think it will become apparent\nthat most of the viewers agree with my comments. At the end of the\nmovie, our audience spontaneously let out an audible groan. I have\nnever heard such negative comments as people were walking up the aisle.<br><br>Save your money!\n"},
{"review": "\nWhat an utter waste of time.<br><br>I am by no means a die hard advocate of direct adaptation of a book to\nthe screen. So I entered the cinema expecting an enjoyable movie with\nsolid cinematography, great storyline and good acting - to be expected\nwith the director. Boy was I mistaken - granted the movie is extremely\nfar fetched (next to no authenticity in relation to the book of the\nbible), what killed it for me was the serious inconsistencies with the\ncharacter profiling, poor storyline and execution that made me want to\nleave the cinema midway. For example - Noah is portrayed as an earth\nloving greenie, protecting plants and life - point understood, but he\neasily kills people to protect another life? Further, later in the\nstory he is battling internal turmoil as they hear the screams of the\npeople of the earth? If his resolve lead him to kill humans without\nhesitation, why is his suddenly so challenged?<br><br>There was no clear cut message, no point to the movie and it seemed to\ndrag on. If the director intended to slide off in a tangent, at least\nmake it exciting to watch. Let me save you the waste of time and advise\nagainst watching it. Save your precious pennies and watching some worth\nyour time.\n"},
{"review": "\nWhen putting on Noah I had heard a lot of negativity about this movie.\nI do not know if it is Christians not supporting this adaptation, or if\nit is atheists thinking it is way to much Christian propaganda. I am a\natheist, and I like good stories on the screen. What I liked about this\nmovie was that feeling of adventure the likes of LOTR and Star Wars, a\nmovie adaptation of a biblical story that is up there with other\nscience fiction and adventure films. It didn't make the story about\nNoah more plausible, but it was a great story, set in timeless\nenvironments. I have read the genesis story even though I'm not a\nChristian, and in my opinion this adaptation is quite accurate and true\nto the biblical story, with some tweaking here and there. A little\ngnostic view points here and there, but all in all something fresh made\nfrom a old and boring book, made a little bit more interesting. Have an\nopen mind, and don't watch it with an preconceived notion. Watch it\nlike you would with any other story made for the screen.\n"},
{"review": "\nJust watched this on Pay-Per-View having missed a chance to see in\ntheaters (dithered over whether or not to see it due to wildly mixed\nreviews). It was visually engaging enough to keep me watching till the\nend but as the credits began to roll, I found myself feeling\ndissatisfied. <br><br>Some of the scenery and shots featuring animals were really cool, I\nfound myself wishing for more (that is, more time spent on\nanimals...and a closer look at different species as imagined by the\ncreators of this film).<br><br>Ray Winstone is a distinguished actor but I found his portrayal at\ntimes creepy, at times laughable, overall weak (how much of this was\ndue to direction and/or other factors...not sure, when it comes to this\nfilm I didn't get a sense either way). Emma Watson and Jennifer\nConnelly impressed me, I got a sense of quiet strength from their\ncharacters.<br><br>Russell Crowe, also one of my favorite actors (I thought his Robin Hood\nwas masterful, a fresh new take), disappointed. Without giving anything\naway, there were some parts of this film that called for a more\ndramatic narrative...his timing and (at times) rushed speech took away\nfrom the grandeur of what was meant to be an epic film. You find\nyourself wishing he would deliver certain lines a bit more\ntheatrically, like David Wenham in 300 or one of the greats of classic\nfilm (Charlton Heston, perhaps).<br><br>I didn't realize when I started watching that Anthony Hopkins was also\nin the film. When he popped up on screen I laughed and thought: 'Of\ncourse...can't make an epic film without Anthony Hopkins!' Probably\njust me but it seemed a bit tired as far as casting goes. <br><br>I might have enjoyed it more on the big screen but don't regret\nwatching at home on my TV. Bottom line, entertaining enough to\nwatch...just a bit of a let-down.\n"},
{"review": "\nI found this movie absolutely stunning. Beautiful cinematography,\noutstanding acting, and astounding special effects. <br><br>Of course, there are a few things that fellow believers need to be\naware of. The movie, 'Noah', is not told from an ultra-conservative\npoint of view. There are multiple parts that can clash with your own\nbeliefs. When creation is explained in the movie, it is portrayed in\nthe fashion that God, or The Creator as He is referred to throughout\nthe movie, used the Big Bang as His tool for the creation of the\nuniverse, and evolution for His creation of animals and of Man.\nAlthough I do not personally believe that is how He created everything,\nthe movie tells creation beautifully and with God as the Creator,\ntherefore I do not find it offensive.<br><br>One piece of information that will be helpful when seeing this movie is\nthe background and origin of the Watchers. The Watchers are originally\nmentioned in the Book of Enoch, an ancient non-canonical book of the\nJewish religion. The Watchers are, as stated in the movie, fallen\nangels, but after that, the production team took their creative\nlicense. Since it is in neither the Jewish Tanakh nor the Christian\nBible, most viewers will think that the producers simply made up the\nWatchers.<br><br>Also, there are many gruesome and gut-wrenching scenes, for this movie\nreveals just how corrupt Mankind had become. There is no happy parade\nof animals arriving two-by-two, and Noah is not a happy old man with a\nlong flowing beard In this film, Noah tries to follow exactly what the\nCreator commanded of him, taking himself past his breaking point. In\nthis film, Mankind is scrambling for survival, taking what it wants and\nnot caring for anyone else. In this film, the story of Noah is\nportrayed realistically.<br><br>I implore you to go see this movie, but you must watch it with an open\nmind.\n"},
{"review": "\nWell I'm an atheist... but this movie made me pray on my knees to God\nto please stop my suffering and make me blind.<br><br>So Noah has visions, pretty short ones in my opinion and suddenly he\nknow's what's going to happen?<br><br>Movie makers tried to add elements to the movie to add action, drama,\nromance, etc. Only to make a really crappy plot.<br><br>So Noah had an paranoid schizophrenia episode he must have been\nsnorting \"crocodile\". ABSURD and then he goes sweet to the bottle?<br><br>Please don't waste your life or money on this movie.<br><br>Not even Emma Watson can save you from fleeing the theater.\n"},
{"review": "\nHaving watched the trailers, I was so looking forward to this film, and\neven took my friends. As the Bible account of Noah can fit into a page\nof A4, obviously the film makers had to add a lot of plot to fill it\nout to a feature length film. Indeed there is a lot of scope to do\nthis: Noah's wife and his three daughters-in-law are hardly mentioned\nin the Bible, not even being named, so the film-makers had to develop\ntheir characters, and could create interesting sub-plots around the\nvarious relationships. In the film Noah has a series of dreams about\nthe flood; now this is not mentioned in the Bible, but it is certainly\none of the methods God uses to communicate with men, so it is an\naddition rather than a distortion, and adds a bit of excitement and\ngives them a chance to show off their skills with CGI.<br><br>But to call the film \"Noah\" surely requires that they leave the basic\nstory-line intact. But they didn't. The angels who came to earth\nbecause they fancied the women were turned into bizarre stone men (very\nuncomfortable for the women, but they didn't go into that); as a\nconsequence the Bible description of what happened to their offspring\nhad to be abandoned. Instead of taking three daughters-in-law onto the\nark, they took one girl-friend, who Noah thought was infertile. One of\nNoah's enemies managed to sneak onto the ark without Noah's knowledge.\nPerhaps the worst thing, in my opinion, was that God was left on the\nside-lines, and couldn't even make the decision himself to preserve\nhumans or not, so left that decision to Noah.<br><br>So whether or not we agree with the personality they decided to give\nNoah is a matter of individual taste. Drugging the animals so they\ndidn't interfere with the film may have been a cop-out, but we could\nhave gone along with that. But playing fast-and-loose with the story\njust seems unnecessary. Who is the film aimed at?<br><br>All in all, very disappointing. Bring back Cecil B. DeMille!\n"},
{"review": "\nAm I compromised? Is this review tainted because I'm a Catholic\ncinephile? If you've seen my star rating than you probably figured you\ncan rule that out. I was excited, A film from Darren Aronofsky is an\nevent for me akin to the Olympics. That is, many years pass between his\nfilms, and when they arrive, they're freaking awesome. <br><br>Within the first few minutes, all my pent-up affection leaked away.\nDespite Noah's fervent source material (and that's as religious as I'll\nget in this review, pipe down) the narrative is extraordinarily weak,\nand the plot feels empty, despite the 138 minute runtime. The acting is\nterrible, especially from Emma Watson. (it's time we stop considering\nher an actress and call her what she is; a model) Even the brilliant\nJennifer Connelly uncomfortably shifts between hammy underacting and\ncringe-inducing overacting. There is no progression or cohesiveness,\nNoah is corrupted by a jumpiness that completely disconnects you from\nthe film. And it uses it's largely, if 100%, CGI landscape as a crutch\ninstead of a supplement.<br><br>But the real kicker, the REAL kicker, is that there is no evidence\nDarren Aronofsky had any part in this film. His trademark deep darkness\nisn't there, his infinitely interpretable script isn't there, and his\nquick-cut, close-up camera isn't there. You could've told me f*****g\nBrett Ratner directed this and I would've believed you.<br><br>It probably would've been more efficient for me to layout this review\nwith bullet points. Noah's whole ethos counters what I stand for. It's\nthe sort of blinged up executive express that takes a brilliant story\nin vain, and tries to pass as profound. I have nothing but contempt for\nthis movie.\n"},
{"review": "\nThis may well be the worst film I've ever seen at a cinema. It will\nsweep the board when it comes to the Razzies, I have no doubt about\nthat. Russell Crowe and Emma Watson are slightly above average but the\nrest of the cast may as well have been washed away in the flood. Even\nAnthony Hopkins's cameo as Obiwan Methuselah (use the seed, Noah) can't\nrescue this piece of celluloid crap. Some of the special effects are so\nbad I found myself rolling my eyes and the animal shots at the end must\nhave been nicked from a Walt Disney documentary from the 60s or 70s, so\npoor was the quality. The eco-warrior message of this movie overwhelms\nall else. Yes, we get it, we're all bad people for driving cars and\nowning gadgets. The cast and crew could've done their bit for the\nenvironment by not making this tosh. In hindsight, perhaps they wish\nthey had.\n"},
{"review": "\nI was stunned. There was no real reason to use the title \"Noah.\" I\nexpected this movie to be an attempt to make a new and edgy adaptation\nof the biblical story of Noah that reflects current social conflicts.\nIts not that. Its just a CGI action movie with all the standard\ntrappings and devices you expect in a recent-vintage CGI action movie.\nNothing more. This movie is so typical I was embarrassed for the\ndirector. Noah has been reduced to just another GI Joe Ninja Fighter.\nFurther, the premises are ridiculous and the continuity is\nhighly-questionable. Supposedly Cain's descendants created an\n\"industrial\" (The movie's word)civilization and ravaged the earth. The\nlandscapes are utterly barren. Then suddenly when its time to board the\nArk, there are millions of creatures. No explanation. There are a few\nattempts at insight, but these have very little relevance to the Bible\nstory. A waste of money and time.\n"},
{"review": "\nI can't believe this movie missed on so many levels. Forget about being\na true adaptation to the account in Genesis, but even being a viable\nfilm sustaining itself and just being decent. There are so many missed\nopportunities, wrong roads traveled, plot holes, weird plot devices,\netc. Arnofsky is a strange guy. If you've seen \"Black Swan\", or \"The\nFountain\" you know he is no stranger to trippy adventures with his own\nstyle and dynamic. I personally am not a fan of this style. At one\npoint he was attached to \"The Wolverine\" sequel, and luckily he didn't\nstay attached because I feel that would have been a blow Marvel may not\nhave recovered from unless they maintained enough production control.\nThe producers kept their hands in this movie as well which is why you\ncan at least recognize the story and maybe they are to blame for the\nlameness or weird decisions. Crowe salvaged this for me from being a\ncomplete and utter disaster. The end result is just\u0085pathetic.\n"},
{"review": "\nThis movie is so far removed from the Biblical Story of Noah that it\nhas no resemblance to it. The only facts they got right was that there\nwas a man named Noah and his wife, and that he had three sons and he\nwas spared from the flood in an ark. The rest of the movie is pure\nfiction. I was very disappointed and feel I got ripped off. The makers\ncould have taken the Biblical story and taken some liberty with it, but\nto have these stone angels called watchers, God wanting to kill off ALL\nhumans, no wives for Noah's sons, Noah wanting to kill his\ngrandchildren because God instructed him to, when they show the\ncreation event they show it in an evolutionary form and etc. are so far\nremoved from the Biblical account. I also felt that the movie had\nsomewhat of a New Age view about it.\n"},
{"review": "\nI remember all the controversy while this movie was being made and then\npublicized. I'm sure many Bible fundamentalists were highly agitated,\nbut as the disclaimer at the end states, the movie is a fictional story\nwith fictional characters. Yet that too will upset all of us who\nbelieve Noah and Old Testament characters really did live.<br><br>But none of that upset me, I fully expected it to be a big movie with\nfictional elements and lots of special effects. So, how did it do,\nregarding what it tried to do?<br><br>I have to say very well. It was a costly venture, and likely will only\nrecover its costs with after-release DVD and BD sales, rentals, and\neventual TV revenue. But if you take it for what it is you get an\nentertaining movie.<br><br>Perhaps the most glaring departure are the large rock-like creatures\nthat eventually protect Noah, his family, and the Ark as the bad people\nattempt to overrun it. And the volumes of water spouting from the\nground which, along with rain, caused the great flood.<br><br>But the end has a tone of hope, that the surviving people will build a\nbetter mankind. Russell Crowe is always good and here he is good as\nNoah. He was paired again with Jennifer Connelly who was his wife\nNaameh. And Ray Winston was good as the villain Tubal-cain who managed\nto get aboard the Ark as it sailed, and who tried to kill off Noah.\n"},
{"review": "\nWhen you go to the movies to expect a cool adaptation of the world's\nmost common Bible story, you expect I guess a Passion of the Christ\n(version of the story of Jesus's crucifixion), although don't even\nexpect that---unless you are a fan of giant rock monsters (angels)\nbuilding the ark (or long box boat) with a deranged Noah. <br><br>At first you are like (okay okay so they are giving a dramatic\ninterpretation I will let this slide) this attitude I kept up until the\nfollowing things occurred: A) A psychopathic Noah is \"God?\" inspired to\nprotect God's creation from man (translation: he is willing to kill\nanyone (anyone includes the people on the ark--yes his family) who\ngives mankind a surviving chance after the flood. The movie does TRY to\ntouch on God's mercy, but God's mercy is not even a thing to notice\nwhen the characters are either crying out to God to listen to them or\ntalking about being forsaken. B) Darren Aronofsky forsakes basic\nbiblical information such as all of Noah's sons having wives, but\nAronofsky gives only one of Noah's sons a wife, while the rest don't\nhave time to \"fetch\" some before the flood strikes, which abandoned\nanother aspect that this movie was trying to put across before\ncontradicting that too: God will provide. <br><br>This is literally the weirdest movie adaptation I have ever laid eyes\non. It is not a 'blasphemy' it's just plain ludicrous. This movie is\ntrue to its real meaning: There Is No God.\n"},
{"review": "\nI went to see this movie with expectations that were not to be\nrealised. There were so many 'literary licenses' taken with Holy\nScriptures it defied belief. Now I'm not naive enough to have expected\na scripturally correct version of events and I'm a happy watcher of\nsome of the older stories such as \"The Ten Commandments\", \"Jesus of\nNazareth\" and even \"The Passion of Christ\", which took plenty of\nliberties but at least stayed within the context and atmosphere of the\nstory. This movie did none of those things.<br><br>Some of the additions to the story were: <br><br>- It made mention of \"watchers\", supernatural beings (angels) who\nwatched over Noah and his family. No such beings are mentioned in\nGenesis.<br><br>- These supernatural beings apparently sinned and were clad in stone as\na punishment They then came to life and helped Noah and his family to\nbuild the ark! (Terminator meets the Great Flood!) <br><br>- There was much made of the sons being discontent because they\nwouldn't be able to have wives and children and therefore be 'men' and\nNoah told them the reason for this was that mankind was to be\nexterminated too. But in Genesis (6:18)it says \"you will enter the ark;\nyou and your sons and your wife and your sons' wives with you\" <br><br>- The ark was also afloat long enough for Shem's wife to conceive and\ngive birth to twin daughters. In Genesis (8:14) it says that \"By the\ntwenty-seventh day of the second month the earth was completely dry\". <br><br>- the first born of Shem were Cain and Abel not as depicted in the\nmovie (I won't spoil it any more for you by explaining that!)<br><br>Very disappointing all round.\n"},
{"review": "\nNOAH (2014) **1/2 Russell Crowe, Jennifer Connelly, Ray Winstone,\nAnthony Hopkins, Emma Watson, Logan Lerman, Douglas Booth (voices of\nNick Nolte &amp; Frank Langella) Epic and grand undertaking by filmmaker\nDarren Aronofsky (who collaborated on the adaptation with Ari Handel\ntaking many liberties with its source) depicting the final days of\nEarth before the biblical 'great flood' laying waste to mankind except\nfor chosen titular peaceful farmer (Crowe very good and somewhat\nlow-key humble) and his family to build an ark and rescue only the\nplanet's animals for a new world to populate. While the CGI f/x are\nclearly the stars of the production Aronofsky manages to pay credence\nto the short passage of Genesis yet imbibing in some fool-hardy\nHollywood big-guns (i.e. giants ala THOR's ice giants meets Tolkein's\nEnts and pyrotechniques and fireballs) to appease the masses. Fine\ncamera work by longtime colleague Matthew Libatique and a few amazing\nsequences edited by Andrew Weisblum keep things in perspective: man\ntruly is an island unto himself.\n"},
{"review": "\nI have read a sea of ignorant reviews and cannot take it anymore.\nPeople talk about this movie's \"lack of realism\" and difference from\nthe \"source material\".... If you truly believe one man built a boat and\nput a pair OF EVERY KIND OF ANIMAL on it while god flooded the entire\nworld(something impossible even today, much less thousands of years\nago) then yes this movie is not for you. If you have half a brain then\ngive this movie a shot. The CGI and acting is very well done and with a\ntop notch director at the helm. This movie actually treats the bible\nwith more respect than it deserves and for those with an open mind this\nis about the best possible telling of the nonsensical Noah story.\n"},
{"review": "\nI don't understand why people hate this movie. I understand how it's\npretty stupid but it still manages to entertain the viewer as well\nbuild a great amount of suspense in the 3rd act. Also props to Russell\nCrowe and Emma Watson for delivering great performance. Everyone\nelse... Meh! The story is about Noah and how he is shown by god that a\nflood would be arriving soon due to how badly humankind has evolved.\nNoah and his family then go and visit Methuselah,played wonderfully by\nAnthony Hopkins who gives Noah his insight to building an ark. On the\nway Noah finds Ila who is injured badly and is unable to conceive. From\nthere his family takes care of her and one of Noah's sons falls in love\nwith her. 15 or so years later when Noah has almost finished building\nthe ark a king comes and threatens him. Then the flood hits and chaos\nensues with a great 3rd act and a suspenseful battle. The animals in\nthe film looked quite unrealistic but the scene where the flood hits is\noutstanding and awesome. You are also introduced to these rock\ntransformers who look cool but awfully unnecessary for a biblical film.\nThere is also a great battle which includes them in it. The film is\nalso enjoyable but quite slow in parts. The story is very nice and\nentertaining but has trouble in the 1st act by being way too slow. The\n3rd act was awesome though. The script is pretty clichéd and stupid but\nif you endure these things you can have a good time with this film. The\nacting is also good but I still think that Logan Lerman is forced and\ntoo shy but he was good in the 1st Percy Jackson film. in this he\ndidn't suit the role\n"},
{"review": "\nDarren Aronofsky directed and wrote a story he wanted to tell. A drama\nabout the biblical Noah created with free creative license to tell the\nstory in a way that he felt would be compelling and entertaining. This\nis not the strict, or loose retelling of the traditional biblical\nNoah's Ark, nor is it a total fantasy, it takes elements from the\ntraditional story and uses them to create a watchable drama. If the\nflood story ever really had any truth to it, who knows for certain what\nthat truth was, unless of course you take whatever version of the bible\nyou read literally word for word. From the perspective of not knowing\nwhat happened for certain, Aronofsky creates a convincing story of\ncreation, man's wickedness, Noah's piety, and the flood. It's a fantasy\ndrama that makes for a very good movie. Unfortunately , this movie will\nupset devout Judeo/Christian/Muslims, because the story uses so much\ncreative license and strays so far from the biblical accounts. It even\nstrays far from older Babylonian flood myths. This movie will also\nupset atheists, because although it is a myth/fantasy/drama, it also\nhas a real sense of spirituality to it that will get under the skin of\nmost devout atheists. Additionally this movie will also irk any science\nfiction fans as it is much close to fantasy than any attempt at\nscientific explanation. Who's left to enjoy the film? Just folks like\nme that are not very religious, or atheist, who enjoy a good story with\nsome fantastic elements and a touch of humanity.\n"},
{"review": "\nI agree for some \"historic\" modifications to make good movie$. In the\nthe 2014 Aronofsky film Noah, it starts with: \"In the beginning, there\nwas nothing'' A bit flat compare to the bible real text which is: \"In\nthe beginning God created heaven and the earth...And the Spirit of God\nmoved upon the face of the waters\", quite different from \"nothing\"\ndon't you think ? I already had a bad feeling after 60 sec. The\n\"alterations\" that Paramount made, upset Aronofsky: uninspired and\ninartistic. Not surprise that it has been banned from many\ncountries...for religious and sense disintegration (surmise by\n\"nothing\", + the Transformers bug).<br><br>Noah \"transform\" himself from a wise patriarch to some kind of a robot\nwith a Neanderthal IQ (determined to kill the baby if Ila gives birth\nto a girl, and ready to kill his whole family for that).<br><br>I got out of the theatre when the Ark aground... too bored to ask for a\nrefund. I'll ''Watch IMDb'' + closely before going to another Paramount\nmovie. <br><br>By the way, I think that there was 3 versions of the film, one of them\nconcern a werewolf who stowaway in the ark and bite Noah and... (just\nkidding).\n"},
{"review": "\nDidn't like it.More like the Hobbit meets Transformers,i mean walking\nrock creatures and men battling each other as if on the cliffs of\nMordor.I was waiting for Gandalf to appear,but instead settled for\nRussel Crowe.You cannot tell me this is one of Russel Crows stellar\nperformances.While the movie does have a good cast much is left to be\ndesired.That being said it was not so much the actors fault as much as\nthe script itself digital effects and just a bad script.If your\nwatching for any historical biblical facts this is not the movie\neither.I don't believe the bible mentioning anything about cannibalism\nand famine during the time the ark was built.If its battle sequences\nyour after stick with Gladiator the script to that movie was more\nrealistic than the story of Noah.If its talking rocks and battle scenes\nthat depict the end of the world then this might be the movie for you.\n"},
{"review": "\nAs soon as I saw \"In the beginning there was nothing...\" I despaired.\nIt looked like it had been made by a 12 year old using Windows Movie\nMaker. Overall a very disappointing (and overly long) film. It takes\nitself way to seriously, I had to stop myself from bursting out\nlaughing at some points. I mean come on, giant rock beasts as fallen\nangels? Seriously?<br><br>The reason I give it five stars is the mainly the visuals, some of\nwhich were pretty specular and gave me chills. And, if I'm being\nhonest, the film was going smoothly enough (if you ignore the rock\ntransformers) until after boarding the ark where it just went all\ndownhill. Did they seriously think they could make a family boat trip\nall that interesting. Maybe we should just leave the bible as it is, it\nclearly was not written for the big screen.<br><br>I was surprised after seeing this film at the good reviews it got on\nvarious sites from critics. I guess Rotten Tomatoes proves that the\ncustomer is always right.\n"},
{"review": "\nThis movie does not stay true to the Biblical event of Noah and the\nArc. Keep that in mind if you go and watch it. Many times I almost left\nthe theatre because I felt it was disrespecting God. I heard that it\nwas an atheist that wrote it, that would explain Noah quoting lines\nthat God said, only three things that actually matched the bible, and\nGod not showing up at any point in this movie.<br><br>If you go see this movie, think of it as an action movie and not as a\nBiblical event. If you are a Christian and plan on watching this film\nas a Biblical film, don't go watch it. I am very disappointed in this\nfilm.\n"},
{"review": "\n\"What were they trying to get at?\" \"Interesting?\" \"I couldn't follow\nit.\" These were the kinds of responses we used to get to some\n'experimental films\". I'd say the same about Noah. But the thing that\nmy wife said when she leaned over about 45 minutes into the film seemed\nto sum it up for me: \"This is pretty bad.\" Confused as to purpose.\nTedious and often boring in its pacing. The dialog is flat to silly.\nAnthony Hopkins has three minutes, and he's terrific. Russell Crowe\ndoes an excellent Russell Crowe, but we probably were expecting Noah.\nJennifer Connelly is lovely. Emma Watson always looks like a proper\nEnglish girl - same here. The CGI figures are borderline silly - on\nsecond thought, they are actually silly. During a three-day period, we\nsaw Noah, Muppets Most Wanted and Divergent. For what's in the theater\nhere, now, I'd recommend either of the others over Noah. Noah simply\nisn't a very good movie. An \"experimental film\" maybe, but not a very\ngood movie.\n"},
{"review": "\nFirst off, you should not plan to see Noah because it is a biblical\nepic, nor should you plan to skip Noah precisely because it is a\nbiblical epic. You should however, see Noah because it is an amazing\nfilm, using the basic story of Noah's ark to deliver a fantasy\naction/adventure and a psychological horror story and deliver a very\nrelevant ecological message that's subtle. The visuals are out of this\nworld, particularly one scene depicting the creation of the universe\nfrom the big bang to a scientifically accurate representation of what\nDarwinian evolution would look like sped up about a million times, the\nwhole scene would feel right at home in an episode of Cosmos. (Yes, you\nread that right.) Special mention must be made to Russel Crowe, who\ndelivers the complicated picture of a man that both saves the world but\nis also supposed to let it die, and all of the weight one must feel\nabout it. I can't praise this movie enough, it's basically perfect, if\nyou are even the least bit curious about going, do so! You won't regret\nit.\n"},
{"review": "\nTen minutes. That's how long I could stand watching it for. The opening\nscenes with a fake looking snake head appearing (maybe it stuck out in\n3D?) looked extremely cheap, nasty and unreal. Then it started off like\nthe old Bible epics of past with text telling us about the beginning.\nBut even though it supposedly is a Bible epic (let me declare my\nagnosticism now), with a Biblical title and a Biblical text, it\nimmediately deviates into fantasy, talking about a race of evil Angels\nand industrial cities? This makes Jacksons rabid rewriting of the\nHobbit pale into insignificance. We are then introduced to Russell\nCrowes character teaching the children to respect the life of plants as\nhe then becomes a martial artist and deftly disposes of four hunters.\nIt was about then I checked the time remaining, and being just under 3\nhours, I could take no more. This is truly an epic, an epic fail.\n"},
{"review": "\nWhere has Darren Aronofsky been the last 4 years? Noah, that's where. A\nbizarre world of slightly off CGI creatures, talking rock monsters and\noverblown melodrama. If The Wrestler and Black Swan are comparable in\nstyle, then this is closest to The Fountain, another polarising venture\nthat took years to get off the ground. However, this one doesn't work\nquite as well, not having that thought-provoking existential angle that\nmakes The Fountain a profound experience. Not to say that Aronofsky is\nslacking here on the technical side, Noah still has his abrasive and\ncaptivating style with quick cuts and breath-taking cinematography,\nthough its production suffers from its concept. It's better to just\ntreat it like a fantasy film. Like the overly serious parts of Lord of\nthe Rings meets Jim Henson's campy 80s movies.<br><br>It results in a film that's really difficult to embrace but kind of\nenjoyable in a silly way. There are some great scenes, but they're\nadmirable for their boldness rather than their finesse. Its melodrama\nis hard to take seriously, especially when it tries too hard to make\nRussell Crowe's Noah a dark figure, giving him very unsympathetic\nchoices and obvious moral dilemmas. Otherwise the performances are\nquite committed and impressive, but suffer from the lack of character\ndepth, especially Jennifer Connelly. It has a lot to thank Clint\nMansell's exhilarating score for holding it all together but as a whole\nit just doesn't work. There's just too many bits that you don't\nbelieve, especially since many people take the Bible quite literally.\nNoah often leaves you awe-struck in what you're watching but not in a\ngood way. It is worth watching, at least, if just out of morbid\ncuriosity. Hopefully he'll bounce back with something down to Earth.<br><br>6/10\n"},
{"review": "\nI guess I didn't know that Noah was such a raging psychopath trying to\nkill everything in his path when he was supposed to be saving mankind. <br><br>To me the movie could've been great but it was just really weird to me\nfor the most part, and left me with a lot more questions than answers.<br><br>There was plenty of drama, but most of it just seemed extremely\nunnecessary. <br><br>The one good thing about this movie is that it showed just how\ndangerous religion has proved to be throughout it's history. People\nhave always given themselves the power to do whatever they think god\nwants whether it makes any sense or not, because whether there is a god\nor not who knows, but what I do know is that nobody has any more idea\nthan I do what god might or might not want, so to consider doing the\nunthinkable like murdering your two beautiful innocent newborn twin\ngranddaughters for no good reason might be something you might like to\nreconsider just in case you might be wrong. <br><br>But that's just me.\n"},
{"review": "\nEveryone knows the basic story of Noah and his ark. He built an ark to\nshelter the animals from the flood. So this film being a remake should\nhave done more with the story, or better yet, left it alone. The cast\nin this is pretty big and it was cool to see familiar faces, but it was\nnot enough to save this film.<br><br>Honestly, I'm not a religious person at all, and I guess from watching\nthis I learned a bit of the background of how Noah came to build his\nark, but it got pretty boring towards the end. Throughout the film it\nwas just kind of flat. There were one or two suspenseful moments, but\nit just felt like the film cut from here to there too much.<br><br>OK a bit of a spoiler. Fallen Angels came to Earth to help mankind, but\nturned into moving rock structures. What in the world. Hell no! What is\nthis? A religious myth mixed with what transformers would have been\nlike before cars? *Sigh. I feel like I wasted money on this. For sure. <br><br>They had fighting scenes as well but it was a bit too gruesome. Lots of\nblood\u0096 also where deaths of the animals were concerned. (I'm definitely\non my way to becoming a vegetarian)<br><br>One thing that was good; the visuals of nature. There was this scene\nwith a time-lapse/stop-motion of a river growing and that was really\nnicely done. Also, some other scenes had beautiful landscapes, which\nwas cool, but that's about the only thing that was good about this\nfilm. The first half wasn't so bad I guess, but the second half was\nreally going nowhere.<br><br>Well I guess another thing that was good, was the acting. Not\nincredible, but from Emma Watson and Logan Lerman it was pretty good. I\ndidn't see them as Hermione or Percy. And I could feel the chemistry\nbetween the other characters as well.<br><br>Read the full review at championangels.wordpress.com\n"},
{"review": "\nNoah (2014) Director: Darren Aronofsky<br><br>Considering that the Noah's Ark story is a fairly popular one and\nconcise in its narration, I was quite interested in what Aronofsky was\ngoing to spin.<br><br>Honestly, this movie didn't work for me. The amount of artistic license\ntaken is plenty and the movie pretty much ended up being a fairy tale.\nThe Watchers (fallen angels who didn't figure in any Noah Ark story\ntill date), the tyranny of Tubal-Cain (never reference him in any other\nNoah Ark story) and the absence of the wives of Ham and Japheth (as per\nthe accepted various ancient versions of this biblical story where 8\nhumans traveled the Ark) really didn't work for me. <br><br>The casting was pretty good. Crowe, Connelly, Winstone Hopkins and\nWatson were top notch. The son's of Noah were too young \u0096 Logan Lerman\nfrom the Percy movie is miscast here and Douglas Booth as Shem was\nbaffling. With all the liberties Aronofsky was taking I was rooting for\nthem to die in the movie.<br><br>Good special effects were the saving grace of this movie and overall\nthe movie is over-rated. If you haven't watched it, then save your time\nfor something else.<br><br>Rating: 4 on 10\n"},
{"review": "\nWhile acting is alright, I did hope for a more middle age like setting,\ninstead of this mythical one. What I hate about this movie is that we\ncome to like Noah, and in the end all you want to do is smash his head\nin with a brick.<br><br>Noah becomes more and more fundamental in his beliefs, and the length\nhe goes to makes me wonder how his family would ever be able to truly\nforgive him again. I mean, even if he was given a choice, not to do\nevil, he was extremely slow and crossed way over the line.<br><br>The torment he has already put his family through, makes him the most\nevil of all the characters in the story, especially the coldness in\nwhich he portraits his religious mental illness.<br><br>It could have been a good movie, but was ruined by a religious idea of\nselfrightiousness, that whatever evil you have done, you are alright in\nthe end, if you start to do right. Bullshit.<br><br>Noah is a mental patient, just like all the other lunatics running\naround blowing themselves up. He should have died on that beach, a\ndrunkard and familyless, that would have been just.\n"},
{"review": "\nARE YOU KIDDING ME? i will not discuss that its far away from the bible\nas a biblical and symbolical story, i will speak as a movie well\ncustomized, as a story 1) its so slow and there is a lot of Crap scenes\n, it has to be shorter maybe 1 hour and a 20 min it will be okay, but\nsilent scenes and waste of time, 2)as a 3D its REALLY REALLY BAD, its\nmaybe \"1D\" 3) Directing: the director with this story made something\ngood, even story is really bad, if someone entered suddenly to watch in\nthe middle he will think that he's watching Transformers or some\nHollywood action science fiction crap , but again the visual effects\nwas OK and the sound effects was OK, but the picture is so dark and the\n3d make it darker and worse. 4) Music: i really liked the MUSIC, it was\nthe most successful thing in this movie.. 5)Casting: i would definitely\nvote Zero not Three if the casting was awful but i cannot deny that\nRussel Crowe and Jennifer Connelly did a lot for this movie, and they\nare always compatible(remember beautiful mind) as a whole, i didn't\nlike this movie its not a B its a C..\n"},
{"review": "\nI came into this movie without any foreknowledge of how the story would\nbe presented so I was quite surprised that it turned out to be a movie\nabout environmentalism rather than religious sin or anything like that.\nOn the contrary while the movie does highlight what is good about\nreligion, at the end Russel Crowe's Noah goes into a state that warns\nof the dangers of religious fundamentalism and what such people are\ncapable of doing. All the same I think this film has a good chance of\nreaching those who need to get the message about climate change and\nanimal rights the most. Noah presents us with an earth that is dying\nand will be flooded. Just like some scientists predict that the ice\ncaps may melt and flood coastal areas. Just as in our world, Noah's\nworld has naysayers as well. The film asks us to consider what a good\nperson is and why bad people act the way they do. With the level of\nsenseless violence that modern society is plagued by these are\ncertainly valid questions. Russel Crowe does a job of playing the sober\nNoah who is tasked with doing a job for God rescuing the innocent\nanimals. When he finally does display an outburst of emotion it is all\nthe more dramatic because he is so steady throughout the earlier\nportions of the movie and leaves a lasting impression with us when we\nleave the theatre. My only complaint is that the film runs a little\nlong drawing down.\n"},
{"review": "\nIt's disappointing that this movie is so polarizing and that the\nnegative opinions are those of people who claim to be religious. For\nthose who are reading their comments, please look at them with\nskepticism and understand that they are complaining that Noah is not\nthe fairy-tale account that they expected. Their arguments are overly\nsimplistic: Noah was not dark, this is a movie about environmentalism,\nthere were no rock creatures, God was not silent...<br><br>All of this is driven by a belief that they must 'warn' people about\nthis movie. <br><br>So please. Do not lump all Christians into the same basket and think\nthat they cannot find truth or beauty in this work. Aronofsky explores\nbeautiful truths and builds on them with this movie.\n"},
{"review": "\nI saw Noah a couple nights ago and was so impressed. It took a story\nand asked some difficult questions about humanity all the while asking\nourselves to decide which version of it we prefer to live out in our\nown lives. It's genius! I came online here expecting other people to\nhave similar reactions. Perhaps not surprisingly, however, there are\nmany extremely (!) negative reviews. I have read a few and sincerely\nbelieve some of these people did not see the movie, but are religious\nextremists with some kind of agenda. It is sad to imagine that people\nare trying to rip a movie that intelligently and entertainingly engages\nus in asking tough questions about hope and love and what we really\nare.. But then some of these people are the same kind represented in\nthe movie as the barbaric, selfish hordes who are only think of\nthemselves and have little logic on which to base their opinions.\nBottom line, don't listen to the religious fanatics, go see this great\nmovie! By the way, in case this is of any interest, I am a Christian.\nMy father is a pastor and I was raised reading the stories of Genesis\nsince I was a youth. I hope people of all faiths, atheists, Christians,\netc., will see this film because it inspires us to look at each other\nwith compassion. It inspires us to want to choose to support a world\nwhere we embrace each other, not hate each other. It's amazing (and\nthen again, maybe not so much) that many people fail to understand this\nmovie and what might be its message as they also fail to understand the\nBible and what might be its message: \"Beloved, let us love one another.\nFor love is of God, and everyone who loves is born of God, and knows\nGod. He who loves not, knows not God, for God is love.\" 1 John 4:7,8\n"},
{"review": "\nI don't understand all the hate that \"Noah\" (the movie) is getting.\nPersonally, I think it is a GREAT movie. But maybe it's because I'm an\nartist, so I understand what art is and isn't supposed to be. Seems as\nif a lot of people -especially Christians\u0096 thought they were going to\nsee a documentary or a theological disputation. I actually think it\nsticks very well to the Biblical account. Maybe people don't know their\nBible as well as they think they do. --- If you don't like the story,\nhow's that the movie's fault? Fallen angels, giants, genocide, etc. is\nall in the Bible. --- Yes, I'm talking about the actual Bible, not the\nversion you were taught in Sunday school, when you were five years old. <br><br>Anyway, if you are at all philosophically inclined and don't mind\nmovies that make you think about serious and even existential\nquestions, ignore the haters; Go see \"Noah\"!<br><br>I haven't been so emotionally moved and intellectually stimulated from\na movie for quite a while. It's not for the weak of heart. After all,\nit's a story about genocide. But it is beautifully made. And, in my\nopinion, stays true to the Biblical account.\n"},
{"review": "\nSlow, boring, inconsistent and lame.<br><br>I just finished watching Noah and wish I hadn't wasted the time or\nmoney. We know the story, so we should enjoy the setup. Instead, we get\na bizarre, and slow paced psychological romp through the mind of Noah\nwho struggles with the message he received from God. <br><br>The visuals would be beautiful, but they don't add to the story. They\njust provide an odd background that seems as other worldly as the Ark,\nthe flood, and the whole plot. More specifically, the CGI is not\nrealistic and just seems a little off. I want to watch the film, not\nlook with wry amusement at stiff computer graphics.<br><br>If we need Noah to save us, i'd rather drown.\n"},
{"review": "\nI was brought up a catholic and to pass the mind numbing boredom of the\ncatholic mass I use to read the bible to pass the time. I am now an\natheist and realise the bible is utter tosh, so I am not particularly\nbothered that they sex up the Noah story which was a rehash of the\nflood of Gilgamesh. To say sex up I actually mean make it up as they go\nalong in a pretty weird way, The Watchers, did they stumble by accident\nfrom a transformer movie? The closest they get to the bible was that\nthe god of the old testament was a vindictive old sod and what was with\nthe politically correct 'creator' instead of god.<br><br>So when my wife asked \"did it mention...\" no just watch it. This is\nsimply a made up science fiction movie. With a movie the question is\nwere you entertained? actually yes, it moved with decent pace and Ray\nWinstone was thrown in doing a East End biblical gangster, which was\nenjoyable. At the end of the movie there must have been some serious\ninbreeding to get the race going again.\n"},
{"review": "\nI find it funny that people are criticizing this movie as a confusing\ninterpretation when the original Genesis story is so implausible and\nunscientific.<br><br>There's still no evidence for a global flood, only distant memories of\none that may have occurred near the Black Sea when people thought that\nregion encompassed the whole planet.<br><br>I was glad to see the old Bible fable distorted a bit, especially in\nthis age when science-denial is becoming a crime and Creationism has no\nplace in public policy.<br><br>I gave this a 5 because it wasn't quite as ridiculous as the original\nGenesis myth.\n"},
{"review": "\nThis story re-writes the Bible and typifies today's movies. The\ncharacters and script are formula driven. It has Transformers in it. It\nhas Darth Vader (in the role of (Tubal-cain). It has Obie Won Kenobi\n(in the role of Methuselah). Noah is sort of a confused Luke. We know\nwhat's going to happen before it happens, because we've seen it over\nand over and over again in movie after movie.<br><br>It's always amazing how the characters, living on bare subsistence in\nthe wilderness, manage to wear make-up, have nice haircuts, and stay\nhealthy and beautiful.<br><br>I know it's a movie, but a touch of realism would be good.<br><br>All that said, if you don't mind the same grind over again, this movie\non Blu-Ray on a Saturday night with some good snacks and drink can be\nokeydokey entertainment. Just turn off your brain, open a bag of chips,\nand absorb the action and emotion, and fantasy.\n"},
{"review": "\nI'm a Christian and I thought this movie was GREAT!! A couple of times\nI thought it went off the rails but that's what makes entertainment and\nmovies so much fun....if you know the story 100% it's kinda\nboring...reasons why I've never watched Titanic....but you know,\nthere's a lot left out of the Biblical record so I find it thrilling\nsometimes to see what others think. I thought the writers did some\ninteresting interpretations on many things, all points to make me want\nto go back and re-read through Genesis and the Old Testament in general\nto see how they could come to that possible interpretation. In an\nenvironmental ethics class once we had to read through parts of Genesis\nthen have an open discussions on the direction and topic of 'dominion';\nwe were split there too.....I think the fundamental critical points of\nBiblical history and the reasons for the Flood are in the movie...I\nalso found it fascinating that they shared Enoch's vision as well,\nmaybe to ponder for our future final judgement? I think Christians\nshould like this movie because it will inspire people to read the Bible\nin want to understand it better for themselves...but maybe I'm too\noptimistic for humanity? :D Again, I thought it was a Great Movie!!!\nThe acting and actors were awesome, the location and sets were\namazing....great job by all, thank you for making it.....and yes, I\nbought a copy.\n"},
{"review": "\nI watched this movie with my wife and we both enjoyed in enormously. It\nwas a very interesting retelling of the Noah story that brought home\nsome of the anguish of all those involved in this tragic tale of\ndestruction. We were very engaged with the story from the start, which\nwas told sensitively and emotionally, especially towards the end. <br><br>I loved Noah's version of the Bible creation story and I found all the\nactors well chosen for their parts. Russell Crowe gives an outstanding\nperformance as Noah. Emma Watson breaks free of her Harry Potter chains\nto give a credible performance as Ila. One of the most touching scenes\ntowards the end of the film involves these two actors. <br><br>The film is slow paced, which I love, and the storytelling by Darren\nAronofsky is just my cup of tea. <br><br>I cautiously watched this film on Amazon Prime because I wasn't sure if\nI would like it. Now that I've seen the film then I will definitely buy\nit on Blu-ray and it will be added to my special reserve of top-notch\nfilms that I will love to watch again in years to come.<br><br>My enjoyment of this film was only marred by having read so many\nnegative reviews. As I watched it then I kept thinking of some of the\ncomments I had read. I simply cannot fathom how this film has created\nso much negative criticism. I feel so sorry for the director and all\nthe actors and technicians who put so much effort into making this film\nthe success that it really is. <br><br>This film more than any other proves to me that I cannot accept the\njudgement of others when evaluating a film; I am so glad I ignored the\nreviews and experienced the film for myself.\n"},
{"review": "\nBased loosely on the story of Noah's Ark, Darren Aronofsky's 'Noah' is\nA Solid Effort! Though not perfection, it still is a well-made,\nvisually striking film, that also offers terrific performances from its\ntalented cast. Surely, among the better films from 2014, yet!<br><br>'Noah' Synopsis: A man is chosen by his world's creator to undertake a\nmomentous mission before an apocalyptic flood cleanses the world.<br><br>'Noah' has a rocking first-hour, with each sequence unfolding superbly.\nThe second-hour takes a slight dip, but the finale is satisfactory, if\nnot epic. Noah's world famous tale comes alive on-screen &amp; although i'm\nnot sure if this biblical flick would entertain all the religious\npeople out there, it certainly worked for me. <br><br>Aronofsky &amp; Ari Handel's Screenplay focuses on many themes, but keeps\nthe commercial entertainer quotient in-tact. Aronofsky's Direction is\nabsolutely stunning, as always. Cinematography is breath-taking. Each\nmoment has been captured with brilliance. Editing is perfect.\nAction-Sequences &amp; Graphics are astounding. Make-Up is well-done, as\nwell.<br><br>Performance-Wise: Russell Crowe delivers a phenomenal performance as\nNoah. The Oscar-Winning Actor is in top form. Jennifer Connelly as\nNaameh, is remarkable. Her emotional breakdowns are simply amazing.\nEmma Watson as Ila, springs a pleasant surprise. She handles her part\nwith utmost conviction &amp; is commendable all through. Logan Lerman as\nHam, is good. Douglas Booth as Shem, is very sincere. Sir Anthony\nHopkins as Methuselah, is efficient. Ray Winstone as Tubal-Cain, is\nfabulously evil. Among Vocal Performances, Nick Nolte as Samyaza, is\npowerful.<br><br>On the whole, 'Noah' may not be Aronofsky's best, but yet its an effort\nto reckon with. Recommended!\n"},
{"review": "\nOrdinarily, you could not get me within 20 feet of a Biblical epic, but\nI just had to see what Darren Aronofsky would do with one of the most\nfamous and revered of all Biblical stories.<br><br>What he does with it is make a hot mess that spends most of its running\ntime teetering on the brink between original and stupid, tipping\nfinally into the latter category. But hey, kudos to the guy for trying\nto do something other than make one more stodgy, literal and dull\nadaptation of a story that's been told to death.<br><br>Aronfosky takes the story of Noah as a jumping off point and makes a\nfantasy film out of it, complete with giant rock monsters and battle\nscenes that look lifted directly out of \"Lord of the Rings.\" Bible\npurists will no doubt be horrified with what he does to Noah's story,\nbut I thought this approach was refreshing. Because let's face it --\nthe lessons contained within the Bible may be valid, but the stories\nthemselves are pure fantasy, our culture's version of Greek mythology.\nBut Aronofsky lets his imagination run a little too wild, introducing a\nvillain stowaway story that becomes tedious very quickly. What he does\nwith Noah himself is interesting to a point -- in his piousness and\ndevotion to God, Noah becomes a villain in his own right, taking his\ninterpretation of God's commands to extremes without considering any\nalternatives, clearly a comment on religious zealotry and the lengths\nto which people will go to justify horrible actions and thoughts by\nsaying that they're following God's design. This message in the movie\nis somewhat diluted by the fact that one of the characters at the end\nsummarizes it for the audience, something I didn't need the movie to do\nbecause the point had already been made clearly. <br><br>Ultimately, the silliness and messiness of \"Noah\" outweighs its merits,\nbut it's not a total loss of a movie, and Aronofsky has successfully\nkept me interested in seeing what he does next.<br><br>Grade: B-\n"},
{"review": "\nA mixture between a good CGI film and Hollywood elements! For better or\nworse that's up to the viewer to see. Personally, though I do not find\nthe film to be a great adaptation, there are some very impressive\nfeatures about the film.<br><br>Russell Crowe was fantastic as Noah, what I liked about it (which was\njust as much to do with the writing as Crowe's performance) was the\nmorale dilemma that this man was forced to suffer. You can clearly see\nthat though he thinks he his doing the right thing, Noah is forced to\nmake some very tough decisions such as potentially killing his own\ngrandchildren. The rest of Noah's family (Watson, Connelly etc.) they\nwere all wonderful. Another strong aspect of the film where some of the\nawesome angles and shots that Aronofsky got of the landscape as well as\nthe CGI.<br><br>However, where the film fell short was in some of the Hollywood Clichés\nand strange adaptations. For example, though I am a fan of Ray Winstone\nI do not believe that he was right for the part of Tubal-Cain, his\ncockney mannerisms just hindered me from seeing a character, all I saw\nwas Ray Winstone! I could have seen Liam Neeson, Gerard Butler or\nBrendan Gleeson pulling of the role better. Also the use of the\n\"watchers\" put me off, both in terms of their design and the fact that\nthey did not contribute hugely to the story and I feel they could have\nbeen written out and the film could still have been as affective, if\nnot more.<br><br>Overall, I did enjoy Noah, despite its flaws and it's not for everyone.\nI'm glad I saw it and will probably see it again.\n"},
{"review": "\nOn the bright side, you get great performance by Russell Crowe,\nJennifer Connelly, Ray Winstone (always a great actor), Emma Watson,\nand the rest of the cast.<br><br>Now all you need is a great story to tie it all down. Not to change it.\nAt least not that much!<br><br>At some point in the movie you try to understand if this movie as any\ngood.<br><br>Well, if you forget the fact that this is the story of Noah, then maybe\nyou can accept it that Noah is a fierce fighter, and the ancient\nTree-ant sort of whatchamacallit thing.<br><br>Over all, it had some nice moments, but as a whole movie, it was\nconfusing, and seems that the director tried to bring too many object\nfrom successful movies into this.<br><br>Sorry, Didn't work...\n"},
{"review": "\nI am not a bible nut so have no particular issue with the subject\nmatter. The approach though was just zany and I just wondered quite\nwhat point the whole 'epic' was trying to make. Perhaps the biggest\nsurprise was the appearance of the ents from Lord of the Rings (perhaps\nseeking useful employment post-Trilogy?). That might at least be worth\none extra mark for originality. <br><br>Probably not quite the worst movie I've seen (though I am to be honest\nstruggling to think of a worse one). I am struggling also to think of\nany redeeming features. Acting to be honest is pretty wooden and\nuninspiring in most parts. Definitely won't be looking out for the\nDVD... Make up your own minds but I won't be watching again.\n"},
{"review": "\nSo according to legend, God made the world from nothing. Other legends\nsay God made the world from chaos.<br><br>This movie has done the opposite in taking an old story and turning it\ninto chaos that means nothing.<br><br>It is simply drek with highly paid actors and expensive special\neffects.<br><br>It's incoherent.<br><br>I'm not saying we have to have Sunday School in our from-the-bible\nstories. I'm not worried about that.<br><br>This is just a big bag o' mess of a story. Portentious music at times\nwhen it is meaningless. The weirdest lighting. Emotions that make no\nsense.<br><br>And the ark - it's made of wood. It's bound up with ropes and tar. It's\nmuch longer than it is wide. But it doesn't flex, not at all. It's like\na big hollow box of ebony.\n"},
{"review": "\nHollywood blockbusters in recent years were quite often saved by\nspectacular special effects, serving as distraction from poor story and\nwooden acting. 'Noah' is rather the opposite: monumental performances\nby most of the actors, a story which is at least an interesting\ninterpretation of the deluge because it is fortunately not strictly by\nthe Book - but poor effects damage the whole fun considerably. Where\nshall I start: with the stumbling trolls, the fluttering doves, the\nDisney snakes or the Disco rainbow? <br><br>No, instead of discussing the ridiculous effects, I'd rather praise the\nperformances of Russell Crowe (his Noah is a tormented man, survival is\nnot so desirable to him after all), Jennifer Connelly (as Noah's wife,\nin her best scene she warns him that all whom he loves will hate him),\nRay Winstone (as descendant of Cain, he is not a simple villain, but a\nman who believes firmly in his right to fight for his life) and Emma\nWatson (as Ila, she has to suffer a lot and makes us believe she really\ndoes). I did not include Anthony Hopkins here, because he doesn't take\nthe movie seriously, always a twinkle in his eye, but on the other\nhand: what else can you do except enjoying your time when you're old\nenough to be offered the part of Methuselah? <br><br>An excellent choice of location was Iceland, probably a tough place to\nshoot a film, but the photography puts the landscape to great use.\n'Noah' could have been a good movie if they had cut some of the silly\nstuff - the picture of the happy little creek flowing through the\nbarren land and turning it green comes to my mind. Let's just say it's\na mixed bag in the end.\n"},
{"review": "\nThis cinematic effort is noteworthy for its scope and effort. The\nspecial effects are not top of the line, but still effective in my\nview. Those who created this barely Biblical nonsense obviously did not\nset out to make an entertainment product that would appeal to the\nBiblical believer, but only to the drug-using millenial populace.<br><br>I submit that for the cave dwellers who have never had exposure to\nScripture in an orthodox venue, this movie is simply a Ray Harryhausen\nfantasy Sinbad movie with a better level of special effects.<br><br>This movie rates a four for its cinematic quality, general production\nvalue and qualified actors. The plot is of LSD quality and those who\nwould seek this film out should watch it under the influence of a legal\nrecreational pharmaceutical.\n"},
{"review": "\nI don't consider this a spoiler necessarily, but I just want to say\nthat it is not wise to take a story that has already been around for a\ncouple thousand years (even if it isn't true and just mythology) and\ncreate unrelated details which crescendo into a pointless, vague\noutline and conclusion of sci-fi, environmentalism, vegetarianism, and\napocalyptic philosophy.<br><br>This movie was very disappointing. I will give it a 3 or 4 (out of\n10)at best for special effects and characters, but even some of the\neffects were cheap in my opinion and the storyline was predictable and\nlacking in so many areas.<br><br>Sorry :/... Maybe try again in a couple of years?\n"},
{"review": "\nWhen I first saw \"the watchers\" in the film, I admit I had to start\nlaughing. They reminded me of the rock monster in the comedy film,\n\"Galaxy Quest.\" While I'm not now a Judeo-Christian, I was raised as a\nMethodist. And while the watchers are mentioned in some apocryphal\n(ie., non-canonical) Jewish texts, there is no physical description of\nthem. Enter Hollywood (sigh).<br><br>Anyway, I've always thought of the Noah story as a bit too fanciful to\nbe true. As I understand it, the continental shift that landlocked\nAustralia from the rest of the world was already in place. Even if, by\nsome miracle, God created a landbridge between Australia and the land\nof Noah, two kangaroos would have had to hop mighty fast to reach him.\nAnd koalas (who sleep between 18-22 hours every day) would have to be\nstrung out on methamphetamines to make the same journey in a timely\nmanner.<br><br>My favorite high-fantasy film remains Cecil B. DeMille's \"The Ten\nCommandments.\" \"Noah\" doesn't even come close to being as good.\n"},
{"review": "\nReview: What a epic movie! Personally, I thought that the film was way\ntoo long and it missed to key elements: animals and how he made the\nark. I loved the watchers and when they were fighting of the humans but\nfor some unknown reason, it really did drag. The son who was helping\nRay Winstone was annoying because he was willing to risk everything for\na girl that he only knew for 5 minutes. A thong Hopkins was brilliant\nand I was impressed with Emma Watson and Ray Winstone. The director\ndidn't really spend that much time on explaining the whole point of the\nark. He spent most of his time explaining how humans were destroying\nearth which could have been toned down a bit. At the end of the day, I\nwas expecting a much better movie to portray such a story but it is\nwatchable and enjoyable in parts. <br><br>Round-Up: Russell Crowe hasn't really hit his peak as he did in\nGladiator, for some time. He's had plenty of chances to prove himself\nin movies like Robin Hood, Man Of Steel and Les Miserables, which\nwasn't that good in my eyes. I would put it down to bad choices more\nthan his performance, except for Robin Hood were he didn't know what to\ndo with his accent. Anyway, his performance isn't that bad in this\nmovie but the storyline could have done with some tweaking. Anthony\nHopkins can't do anything wrong. He's not really in this movie that\nmuch, but he stole the screen in every one of his scenes. After playing\nHermione in the Harry Potter franchise, Emily Watson shows a different\nside to her acting skills by bringing intensity and emotion to her\nrole. Basically, I did fall asleep whilst watching this movie because\nit was taking ages to get to the point and I couldn't believe that they\njust let one of the sons go off on his own without any argument but\nit's worth a watch.<br><br>Budget: $125million Worldwide Gross: $359.2million<br><br>I recommend this movie to people who are into there epic movie about\nNoah trying to save earth from destruction. 4/10\n"},
{"review": "\nIf you were looking for a modestly faithful telling of the Christian\nBible's account of Noah and things surrounding his life, this movie is\nnot it. That's the bad. The good is that it is a fun story. If I must\nbe kind, this movie certainly takes quite a few artistic licenses:\nWatchers? Excuse me, where does the Christian Bible mention Watchers? A\nbattle with Tubal-Cain and his people? well okay, I can accept that the\npeople who did not get on the Ark didn't want to just lay down and die,\nso I won't really pick that fight; there is a heavy Hollywood\nenvironmentalist spin with many examples in this movie. I do believe I\nsaw quite a few subtly and not so subtly injected Illuminati symbols.\nhonest. But seriously, they're in almost every high-budget Hollywood\nmovie anyway.... there are some pretty creepy \"historical revisionist\"\ntwists in this movie's overall design, script and visual presentation,\nbut I guess if this movie interests anyone in reading the real story...\nI suppose that's good; I would have had no complaints if it were named\n\"Fred the Boat Guy Battles the Man with the First Firearm in History.\"\n"},
{"review": "\nIf you're expecting the Bible verbatim, this is the wrong movie. If\nyou're even expecting a close interpretation ... nope. This is the\n\"Noah\" Bible story the way \"West Side Story\" is \"Romeo and Juliet\": the\nlater one began with the skeleton of the first story, but fleshed it\nout a whole 'nuther way. Once you accept that this is at best a distant\nrelative of the Biblical Noah, then you can enjoy the movie the way\nyou'd enjoy any other imaginative special effects movie. The story\nflowed well, the effects were cool, the acting was good. I thought\neveryone in it did a good job. The only thing that really gave me pause\nwas that Noah's younger sons had no wives, and when the oldest\nbrother's wife gave birth to twin girls, Noah's wife joyfully said that\nthese girls would fill that role when they grew up. (\"He has given us\nwhat we needed!\") That's just creepy. (Especially since Noah could have\nsaved Ham's girlfriend earlier on in the movie.) But all in all, I\nenjoyed the movie. Inspirational? Not really. But fun? Yes.\n"},
{"review": "\nI don't really care for religious films. I liked \"Jesu of Nazareth\",\nbut mostly because the acting was great. I am also a big aronofsy fan.\nI was intrigued to watch \"Noah\" mostly because I have faith in Darren\ndoing a good movie.<br><br>Most people are familiar with Noah's story, at least the basic. That\ngives the movie a head start on the narrative so to not explain\neverything. This however is what I didn't like in the movie, cause if I\nhad no idea about Noah I would be kind of lost. It is a little\ndifficult to be attached with the characters cause there ids not much\ntime spent in understand them. My other problem is that I was expecting\nthe movie to be more metaphorical, taking the story we all know and\nmake it something else. I can't buy that someone takes orders from an\ninvisible master who however does not speak and does not question\nauthority. The whole concept of masters and slaves who only do their\nmaster'd biding seems silly to me. I would prefer if there was a more\nobvious question if there is a god giving orders or if Noah is just\ncrazy. I have only see this movie once and I think I must watch it\nagain. However I was not really impressed, nor I disliked it. I think\nit's the one so far I like less from Darren's work. However do not fool\nyourself, it's a good movie dealing with survival's guilt,\nenvironmentalism and spirituality. It just does not really fit well\nwith my beliefs, but I enjoy watching it.\n"},
{"review": "\nWhether one is religious or not, the flood story in the Bible remains\none of the most significant in world literature. When you decide to\nmake a movie about this narrative, why on earth would you disregard the\nstory and 'creatively recreate it'. Had they made Noah living in the\ncontemporary world, it would have been a different consideration\naltogether.<br><br>Noah appears as an obsessive maniac, a control freak who is assisted by\nlava robots in building an ark and of course during this process we\nobserve his children's sexual frustrations as well as an unwanted\nintruder in the ark. The story needs no further commentary to signify\nhow appallingly poor it was.<br><br>Strong foundational story, A-list cast and high budget but you decide\nto mess with a much loved story and you have an absolute flop. Some of\nthe flood scenes were impressive but highly insufficient to alter this\nutterly hollow experience.\n"},
{"review": "\nI watched this film despite scepticism and can confirm it is NOT as bad\nas every atheist that uses IMDb would have you believe. What may help\nmy judgement is a belief that people can believe whatever they want (I\npersonally don't care if someone is religious). A well directed film\nwith a relatively strong cast that only really lacks a stronger script.\nAt times the narrative is enjoyable and can occasionally be thought\nprovoking but as a whole is probably the only thing that I felt let\nthis film down... That and Ray Winstone. (And I'm English). Crowe is\ngood, Emma Watson is better. The only other thing i want to touch on is\nthe CGI. I personally didn't think it was bad or dated. Arinofsky has\ncreated a beautiful visual film as a whole. The 'watchers' don't look\nnice but I really don't think they are meant to. After all they are\nsupposedly fallen angels that melted the earth and are now covered in\nsoil and rock. He based the look on swans covered in oil.... (You'll\nunderstand when you see them) The arc looks fantastic and is meant to\nhave been built 2000 years ago so anyone expecting a beautiful vessel\nwill be disappointed. Finally the animals... We see bears, and goats,\nand monkeys that all look odd. That is because they aren't bears, or\ngoats, or monkeys. They are meant to look similar but evolution may\nhave altered them in the last 2000 or so years. Watch it with an open\nmind, you are bound to enjoy :)\n"},
{"review": "\nDue to all the negative reviews, I have chosen to bypass this title for\nnow but I feel: Even though this movie is declared biased by other\nreviews, there could be some real entertainment here. I believe most\nnegative reviews are basically those who are jealous or would prefer to\ndespise another persons thoughts, perception and hard work to create\nsomething that they feel is extraordinary. So even though I probably\nagree with the negative reviewers, please take some time to look again\nas there might be some reality here as well. However after reading the\nnegatives verse the positives, I feel this movie my be to biased to\npurchase and share with my friends. I will wait for now and hope to see\nit free or rent it first. Than I might post my own opinion. To other\nreviewers: I am sure I actually agree with you but: Maybe it is real\nbad but maybe you are so opinionated that you are posting negatives\nbased on your own opinion. That by the way happens to be as biased as\nthe producers. Try opening your eyes as even the worst biased opinion\nhas a real reason why they feel as they do. This means that even the\ntown clown knows something that you do not.\n"},
{"review": "\nAn epic movie of biblical proportions. Darren Aronofsky took Noah's\nstory and added some of his own fictional/fantasy elements to deliver a\ngreat and immense visual experience.<br><br>It is very apparent from the name that the story is based on Noah. But\nif you go in watching this movie religiously or something similar, you\nwill surely be disappointed. The immense amount of hate this movie got\nwas mostly from extreme religious people or atheists from what I have\nseen. Regardless, watching it with an open mind is the only way to go.\nI liked the first half more, mainly because of its more EPIC nature,\nwhereas the second half was more tense and psychotic I should say. <br><br>The movie had a stellar cast. Russel Crowe was great as Noah. Then you\nhad other characters played by Jennifer Connelly, Anthony Hopkins, Emma\nWatson, Logan lerman etc. I will say though that acting wasn't good all\nround, there were some inconsistencies here and there, even by the main\ncast but overall it was pretty good. <br><br>The cinematography was great. The movie had countless amazing shots,\nbeautifully rendered in CGI. Amazing overhead shots. A visual treat.\nSoundtrack was also really great, especially the epic pieces played\nduring, of course, epic scenes. :p<br><br>Overall, I really enjoyed this movie. Gave a clear main message and can\nbe interpreted for many others. <br><br>8/10\n"},
{"review": "\nPeople are putting too much stock into a fairy tale. <br><br>If they had produced the story of Santa Claus and added alien\nintervention and lasers and transformer ice giants, would you really\ncare? <br><br>Or would that taint your impression of story that had you brainwashed\nsince the age of 5<br><br>How can a make believe story be not accurate. This is biblical nonsense\nnot the JFK assassination. <br><br>You need to suspend your disbelief even further.<br><br>I went to this movie to kill time on an afternoon where the ticket\nprice was only $5 and for what its worth, I thought it was good as any\nother movie\n"},
{"review": "\nWow. I could not believe the pages and pages of bad reviews for this\nmovie. Then it occurred to me that people aren't reviewing the movie\nbased on its entertainment merit, but instead, are rating it poorly\nbecause the movie offended them as it did not exactly align with their\nbelief system. Folks, movies are primarily for the purpose of\nentertainment. This movie isn't intended to be an exact portrayal of\nthe story in the Bible. It is intended to be an entertaining movie that\nhappens to be based on a familiar story from the Bible, and to that\ngoal, I say job well done. The acting by Russell Crowe, Jennifer\nConnelly, and Anthony Hopkins is superb. The plot and setting is\nintriguing. There is character development, conflict, and the movie has\nan appealing style. So my advice is to recognize that the volumes of\npages of 1 and 2 star reviews reflect not the true merit of the movie,\nbut instead the desired portrayal of the movie by congregation leaders\naround the world. If you feel that the movie might offend you based on\nyour faith, then don't see it. If you're looking to see a well-done,\nentertaining movie, then don't let the inaccurate reviews persuade you\nto miss it.\n"},
{"review": "\nBeing an agnostic, this was on of the most anticipated movie of the\nyear for me. It seems Darren Aronofsky had to work with one line of\nscript and dragged it forever...! Typical Hollywood cliché...! Come on,\nmaking a movie slow and dark doesn't make it a classic movie...!<br><br>I'm not sure if this was the original story in the Bible but a lot of\nit doesn't make any sense...! I believe the glimpse of Big Bang theory\nand Evolution was put in to please the non-religious but it ended up\ncontradicting the whole plot. The result was that the movie did not fit\nany class of viewers. I had this feeling that the original fantasy plot\nof the Noah's biblical story was going to let the movie down but it was\nthe execution and direction that did the trick.<br><br>The fact is, the movie fails as a fantasy movie as well as a\nbiblical/religious movie. The last hour was too slow that I was wishing\nthe ark would sink and everyone dies. If I had a dollar for every\nminute between dialogues, I would have become very very rich. <br><br>Well it looks as if Evan Almighty was way better...!\n"},
{"review": "\nSo many negative reviews about this film.... I ask why? Because it's a\nlittle off from the bible point of view? Come on people, being a\nChristian doesn't mean you go around telling negative stuff about\neverything that's not perfectly biblical. For people who haven't seen\nthis film I highly recommend every single person to go watch this\nbeautiful film, but with an open mind not as a closed minded stubborn\nperson. Every aspect of this film was perfect, cinematography, the\nediting, the acting (Jennifer Connelly &amp; Emma Watson in particular),\ndirection, screenplay, visuals all were top notch. The only thing that\ndisappointed me a bit were \"The Watchers\" but as I think about it more\nand more I think bringing The Watchers added a little sense to the\nfilm. Darren Amazing job!! Hats off to you!\n"},
{"review": "\nI've heard a lot about why Christians hate this movie. Being an\natheist, I can see why both sides would hate it. As someone who was\naware it was based on the bible story but didn't really want to see a\nfilm where the heavy focus was on religion, I feel I was misled by the\ntrailer- which only shows the action parts of the film- which take up\nabout 10% of the actual movie. So Christians will hate it because it's\nunfaithful to the bible, and atheists will hate it because they were\nconned into seeing a heavily religious movie. (Before you say it- yes I\nKNOW it's based on a religious story. But it's far more heavily laid on\nthan in the trailer, which is more like an epic action film trailer.)\nMost of the screen time is taken up with pointless things that are\nnever explained, like magic snake skins and glowing rocks that can\napparentley create fire and guns. Oh, also there appears to be an\nabandoned mine with industrial revolution level technology which nobody\nin the film seems to possess- as rightly they shouldn't in biblical\ntimes. Also, Noah is basically a massive dick who is apparentley a\nvegan (nobody gets that built on a vegan diet) who cares about the\nsanctity of life, but casually kills people and leaves a girl to be\ntrampled to death without a second thought. The production values on\nthe film are bad- the credits and ending sequence looks like it was\nmade in the 90s- I can only assume this was on purpose? The last third\nof the film is taken up with a moral dilemma of whether to kill two\nbaby girls or keep them so they can have incest babies with their\nuncles. Nice. I wouldn't recommend anyone of any faith watching this\nmovie. It says something to me that it has a high critics rating but a\nterrible audience one.\n"},
{"review": "\nThis surprised me by growing considerably in my estimation on a second\nviewing. -- a second viewing I almost didn't like it enough the first\ntime around to even give it. (Although I've found almost all of\nAronofsky's films have grown on me with time and re-visiting.)<br><br>Russell Crowe's tortured performance of Noah as half prophet, half\nmadman felt more honest, affecting and deeper seeing it again. A lot of\nthe family drama that felt a bit forced on first try, was moving and\ninvolving on the second. In particular, there's a deeply moving and\nmemorable 'human' scene, when Jennifer Connolly finally stands up to\nNoah's determination to wipe out mankind. Her emotional power and fury\noverwhelm even Noah's (and Crowe's) strength.<br><br>That said, many of the film's best bits are it's visions and 'non-plot'\nsections, as when Noah tells his children the story of genesis while we\nwatch a super speeded up flow of the evolution of the universe, then\nearth, and then life evolving, finding a sort of connection between\nDarwin, science, and still having a spiritual feeling about the world.\nPowerful too, the few second montage of man going from ape to 20th\ncentury man in silhouette, while showing his violence in each step,\njust a few frames long.<br><br>On the other hand, there are still \u0096 for me \u0096 sizable flaws, from\nannoying lapses in logic (some the fault of the original story, not\njust Aronofsky Like, if there are only 2 of each animal, how did we\navoid a world of doomed inbreeding?). And there are forced 'Hollywood'\nplot twists. Like the villainous stowaway on the arc who also just\nhappens to be Noah's mortal enemy and the man who killed his father.<br><br>There's no denying that Aronofsky is bold, intelligent, and capable of\nbeing a visionary film- maker, even if he can be infuriatingly uneven,\nand fall prey at key moments to being showy rather than deep. It's why\nI always look forward to seeing his films, and feel they are due a\nsecond viewing.\n"},
{"review": "\n...And just what are the giant rock creatures supposed to be???<br><br>I actually thought it pretty cool that this movie was being shown on TV\nso soon...until I started watching it. I found it about an hour after\nit started, so I gave it a few minutes to grab me...<br><br>It didn't happen. I like Russel Crowe, but he did not save this movie\nby being in it...and five minutes in I saw the rock creatures...if I\nstarted to give it a fair try, the rock guys did me in.I simply cannot\nsay something nice where there is nothing nice about it...<br><br>The acting is subdued, at least, and utterly boring at best. For having\nsome high ranked actors in it, the delivery of just about all\ncharacters was just lost. Even Anthony Hopkins was mediocre, and I love\nall his other movies.<br><br>So the bottom line is, why tell a Bible story as something else?\n"},
{"review": "\nI lost 2 hours watching this film, because I didn't read any review\nbefore. I though I'd give it a try, and always again, hoped that the\nstory would come back on the track. But it did not. <br><br>Fortunately I didn't go to the cinema to see the film, but watched it\nwith my family on TV. So before the end, I reached to my laptop and\nstarted to search for reviews ... and a lot confirm my point of view<br><br>It's often so, that film writer \"need\" to change the story enough \"to\nmake it more interesting\". But sorry, I didn't find it more\ninteresting. It was always more and more bizarre. <br><br>So please phone to a friend, read a good book or go to the restaurant.\nYou'll have more from your time.\n"},
{"review": "\nPrior to watching this movie I figured that there would be some\ndiscrepancies with the story compared to the Biblical outline. Needless\nto say, I was proved right as the film mixed in parts of the Book of\nEnoch along with the Genesis account and then turned it over to the\nimagination of the writers to take it from there. Throw in some good\nactors, uneven special effects along with plenty of action and the end\nresult was nothing resembling the Biblical narrative. But the shame of\nit all is that this movie would have probably been much better had the\nwriters not strayed too far from the ancient script because it became\nquite apparent that these modern, highly-educated writers weren't\nnearly as capable as their predecessors over 6000 years ago. Think\nabout it\u0097they had all of the resources of the modern world at their\ndisposal and the end result wasn't nearly as good as the original story\nwritten thousands of years earlier. But then that's Hollywood I\nsuppose. Be that as it may, if a person can disassociate the movie from\nthe original Genesis account then it's possible that there may be some\nredemptive entertainment value to be gathered from it all. Both Russell\nCrowe (as \"Noah\") and Jennifer Connelly (\"Naameh\") put in fine\nperformances and the special effects involving the flood was also\npretty good. Unfortunately, the special effects pertaining to \"the\nWatchers\" needed significant improvement and certainly didn't help this\npicture in any way. In short, although it wasn't a terribly bad film, I\nbelieve this movie could have been much better and I have rated it\naccordingly. Slightly below average.\n"},
{"review": "\nwhat a disappoint this movie was.i don't even know where to begin.i\nsuppose the story is as good a place as any to begin.boring-is one word\nfor it.and I know it isn't a documentary,but if you are religious and\nbelieve the bible story,you will likely hate this movie ,because it\nthrows anything remotely biblical out the window.or maybe that won't\nbother you.just be warned that almost all of the biblical storyline is\nmissing as far as I can tell.and as much as I generally like Russel\nCrowe,i feel his talent is wasted on this awful piece of of work.this\nis one of the worst movies I have seen in a long time,although it is\nnot the worst movie I have ever seen,so based on that,i give Noah a\n2(just barely)/10.\n"},
{"review": "\nI rate movies on how they compare to Eat Pray Love. EPL stands as the\nabsolute worst piece of crap ever made. Never have I felt like I wasted\ntime as much as I did after watching EatPrayLove! How does Noah\ncompare? Barely more worthwhile. Barely! If you wish to save yourself\nmore than 2 hours, skip watching this garbage. It doesn't just NOT\nfollow the story of Noah at all, the story line is garbage. I thought\nperhaps with Russel in the movie it could have SOME redeeming quality.\nI was so wrong. Does this movie deserve credit for anything? NO! SOME\nof the scenery was good. But not not enough to make the rest of it\nworth wasting time on. If any review says this movie MIGHT be worth\nwatching, be wary. They probably like The Princess Bride also. Or\nperhaps they liked Napolean Dynamite. Your time is better spent with\nNapolean than this garbage. (EatPrayLove isn't worth anything from\nyou!)\n"},
{"review": "\nGotta say, this movie was pretty darn corny. From the first title\nsequence I knew something was off and that I may potentially feel let\ndown at the end of this movie. Now I'm not really religious but the\nwhole thing felt like I was sitting in a bible study class or\nsomething. I still don't really understand what the heck the creation\nof the earth has to do with Noah and his ark anyway. The movie just\ncomes off as spiteful and a bit \"do as your told or i'll smite you\".\nIt's all too confusing and unbelievable to me as no matter how many\ntimes the earth has been cleansed the sinners keep returning.<br><br>Even though it wasn't particularly well executed it wasn't too bad. I\nstill found it entertaining and in some parts comical, even if it\nwasn't meant to be. The one thing that was truly unforgivable were the\nspecial effects. They were absolutely terrible. I'm pretty sure about\nninety percent of this movie was filmed in front of a green screen and\nit really shows. So it's bad but watchable.\n"},
{"review": "\nI wasn't really expecting much of this movie having seen the general\nconsensus of reviews but I decided to give it a go for myself. I really\nenjoyed the visuals of the movie and a lot of the cinematography - I\nthink this is what kept me engaged enough to watch it until the end.\nUnfortunately there just wasn't enough depth to the movie to make it a\nmemorable experience. Crowe's Noah changed too drastically during the\nstory and it just had too much of an unbelievable quality. I know\nmovies are not always meant to be believable and if the story line is\nfar fetched the quality has to match in order for the viewer to accept\nthe experience. I don't feel that they got it totally right here. The\nwalking, talking rock creatures were totally unnecessary and laughable\nin hindsight. I wouldn't say that it was a terrible movie. I've given\nit 6 out of ten for visuals - which are enjoyable, and some of the\nacting is OK - but I just get the feeling that none of them totally\nbelieved in it. One last point - what happened to the humongous cargo\nof animals on board when they get on the island at the end of the\nmovie? You don't see a single one!\n"},
{"review": "\nIt can be said that the movie is not that bad as the people say.As the\nmovie started it seems to good going but as it goes on, there seems to\nbe that it just another usual movie. <br><br>The plot is just seems to be lacking ,even though the movie's cast are\nvery good ,all other stuffs are just usual to that of other movie. <br><br>sincerely , I love Russell Crowe and his acting , but that doesn't\nprove favorable to the movie. So , don't expect much from it as people\nare curious to watch the movie from old era and it not entertaining but\ncan just watchable.<br><br>This is the movie to watch at home not in multiplexes.\n"},
{"review": "\nI found the first half of the picture to be quite good - some of the\ncinematography was excellent. A few scenes, in subdued light, were\nmemorable and the acting decent. Both Noah and The King were very good,\nbut Noah's wife was miscast. A much physically stronger looking wife\n(with inferior dental work) would have been more convincing. The worst\nmember of the cast was the \"barren\" girl who gets repaired by\nMethuselah. I suppose the ancient man's fixation on berries was a hint\nat his power? A number of the scenes weren't sufficiently elaborated on\nand were lost CG entertainment opportunities - the animal loading\nscenes needed more and the scenes with Man defiling everything in\nsight, just before the flood, probably suffered from too much editing.\nThe \"Watchers\" or were they transformers, were completely unnecessary,\nalthough they added credence to the survival of Noah's family. A much\nmore interesting sequence allowing our heroes to escape attack needed\nto be penned. As with so many scripts and stories, the writers didn't\nknow how to end this epic. And I sympathize... how do you hint at the\nrenewed beginnings of mankind from six closely related people? Thank\nheavens they made Noah utterly God-fearing/obeying but didn't try to\nsprinkle, retroactively, the story with religions of The Book.\n"},
{"review": "\nPut aside the religious bent and you have a pretty good story here with\nsome decent acting. The Bible tells the story of Noah, who is told by\nGod to build an ark and take a bunch of animals to save because God is\ngoing to flood the earth. No spoilers there.<br><br>From that premise, this story does a nice job of telling you the\nbackground of Noah, his family, and his personal struggles to follow\nGod's directions regardless of the impact on his family.<br><br>In the end, if you look at it as Noah's struggle to do right and try to\nmake sense out of his lot in life, it's a fascinating story. Russell\nCrowe is terrific as Noah. Jennifer Connelly is fine as his wife, and\nthen there's my fave, Anthony Hopkins as grandpa. Ya gotta love him\nstill. <br><br>The CGI plays a big role, but the acting is really good, and the story\nentertaining, and tightly enough woven to not be too slow.<br><br>I recommend viewing this if you like good acting, and are curious for a\ndeeper theatrical take on this biblical event.\n"},
{"review": "\nThis movie didn't really do it for me really. It didn't make any\nenormous mistakes and you could end up enjoying it actually. The whole\nfilm was just so boring to me. Trying to stretch a story that can be\nwritten in one or two pages has its problems. There just wasn't enough\nsource material for this to work. I mean God tells this guy Noah to\nbuild a boat. He does it. There's a flood. The end. Really doesn't work\nwith a nearly two and a half hour runtime. Noah was a real asshole as\nwell, which annoyed the hell out of me the whole movie. It's not all\nbad though. The special effects are nicely done and it is competently\nmade. It isn't poorly acted or directed, so it isn't unwatchable. The\nbig issue is the boredom. I can see people going either way with this\nfilm. Didn't do it for me though. I still say give it a shot. You may\nend up enjoying it.\n"},
{"review": "\nI just finished watching \"Noah\", and I am glad I didn't have to pay for\nit! Granted, the Biblical account of the Flood is sketchy, but this is\njust....well, all over the place! It may the writing, but it just seems\nto be a mish-mash of ideas, Russell Crowe's characterization of Noah\ndoes not make him character easy to like. He's brooding and\nsingle-minded in his drive to build the Ark, but his treatment of his\nfamily seems to be loving one moment, then very harsh the next.\nJennifer Connelly is wonderful as usual as Noah's wife, and really\nbrings considerable depth to the portrayal. Kudoes to the CGI team, but\nt doesn't save this film from being too long and too much of downer!\n"},
{"review": "\nI hate to sit here and just go on an endless rant about where this\nmovie missed the mark, but it's hard to give it much applause in any\none area. I will say, the film makers went out on a limb here and took\nsome chances, so for THAT I applaud their efforts. Unfortunately, they\nfell flat.<br><br>This is a story about Noah's Ark, twisted into a kind of SyFy Dystopian\nwith rock monsters. While the animation of the rock monsters is pretty\ncool, their back story and involvement into this world feels very\nforced and a bit hokey.<br><br>But these are surface issues, really. The real reason this movie didn't\nwork is because it was all over the place. It tried to be epic, but the\nstoryline kept bouncing around. The main character of Noah was\nimpossible to sympathize with, even before the very weird turn where he\n(spoiler alert) made the decision to do without humans in the new\nworld. Why? Because he was just so flat. When you're making a movie\nabout a story everyone already knows, you have to include a twist on\nthe characters, not just overlay it with a science fiction element. But\neven if this weren't the case, within the very challenge of building\nand ark and accepting the awesome responsibility of the survival of the\nworld's creatures, Noah doesn't really seem to be struggling. I don't\nreally think this is Russell Crowe's fault either. There just wasn't\nmuch in the writing to bring the audience into some of his world.<br><br>And then when the floods hit, things got really weird and out of place.\nIt's like they writers were operating under two messages/themes\nthroughout and tried to bring it together to one in the end. Sadly,\nthis just made it feel more like a convenient gimmick than a strong\nmessage.<br><br>There's enough intrigue with the SyFy elements to hook you in, but the\nmovie falls flat on its face. Not one I'd ever recommend to anyone,\nunfortunately.\n"},
{"review": "\nDarren Aronofsky's Noah is a visionary retelling of the classic Bible\nstory regarding Noah and the Great Flood. The movie definitely does not\nstay true to its source, but I could use a fantasy retelling without\nsacrificing the main themes, and that is exactly what we got. Of course\nthere are no talking rock monsters or volcanoes in the real story, but\nit added a Lord of the Rings style to the movie. The visuals are\nimpressive, and that is evident during the scenes where the animals are\nmoving towards the ark. <br><br>Aronofsky's film is about Noah and his creation of an arc for him and\nhis family due to God's displeasure at mankind by creating a flood.\nNoah must battle with himself and other mankind if he wants to\nsuccessfully be a part of God's vision. <br><br>The film is well-acted and features magnificent performances from\neveryone. Russell Crowe does a very fine job as Noah and his acting\nskills are at its peak during his inner fights when he has to make very\ndifficult choices. Jennifer Connelly did a great job as his wife. Ray\nWinstone delivers a delicious performance as Noah's manly nemesis. Emma\nWatson and Logan Lerman deliver great performances. Finally, Anthony\nHopkins makes a surprising, but good cameo as Noah's grandfather. <br><br>Overall, this was a fantastic action/adventure film. The story is a new\nspin on the classic Bible tale and I really enjoyed it. It's funny to\nsee how many people wanted a true, faithful adaptation. I just wanted\nentertainment and this film does its job very masterfully. It Makes\ngood use of the CGI and I was impressed with the rock people. Noah is\nnot an action hero in reality, but he made a good one here. One of the\nbest films of early 2014, and it seems I'm one of the few partaking in\nthat thought. <br><br>My Grade: A+\n"},
{"review": "\nThis is not true to the \"Bible\" story that we have seen on screens in\nthe past. The direction is strange and unsettling because it does\ndepart from that typical story we all already know. For the average\naudience member I think this might be a bit of a stretch with things\nsuch as the provocative rock monsters, which I actually found to be\nvery bizarre. I did think Russel Crowe was excellent in his role as\n\"Noah\" and some of the CGI was incredible with other parts looking a\nbit Naff. I think the film may be a little too religious for the\nsecular public but a little too secular for the religious. Masterpiece\nof flop, I think will depend which side of the pew you sit on.\n"},
{"review": "\nI was waiting with great anticipation for this movie, a great story\nline and one of my favorite actors \"Russell Crowe\". What a\ndisappointment it turned out to be. It wasn't that Crowe's acting was\nthat bad it's the just the storyline was awful and he wasn't given much\nto work with. In what should have been a great biblical tale it turned\ninto some kind of weird indescribable neo-fantasy where the director\njust kind of rewrote that chapter of the bible. And it was a horrible\nrewrite. I'm confident after reading about and watching the trailer for\nRussell Crowe's directorial debut in \"The Water Diviner\" that his next\nmovie should be epic. Redemption? I hope so.\n"},
{"review": "\nI have to say that I was partially disappointed when I saw the movie,\nNoah. What I liked was that the story matched many theories about the\nflood that people have suggested, including the water coming put of the\nground and not just rain. And many historians have shown that an ark\nwas more likely built in the shape as it was shown in this movie, than\nthe middle age interpretations that most of us recognize today as\nNoah's ark, which resembles middle age boat architecture. The part that\nmade some sense to me was the portrayal of real human behavior. Put\ninto the same situation, most humans would behave and be as barbaric as\nthey (the wicked) were shown in this movie. Put into less of a\nsituation, many humans still act that way. Anyone that has been at the\nopening of a Black Friday sale would know what I mean.<br><br>I feel that the angel characters weakened the movie. While many\nreviewers were reminded of transformers, I was reminded of the the Rock\nBiter in the \"Never Ending Story\". They even sounded like the Rock\nBiter. The graphics were not as strong as most movies these days, but\nwe got the point. So, if the angels were left out, I feel that the\nmovie would had went a lot better.\n"},
{"review": "\nFor those who are fond of films based on the Bible, some may find this\nobjectionable, and possibly even blasphemous. Russell Crowe does a\nfairly good job as Noah, but the rest of his family make one wonder why\nGod bothered to save them from the flood at all. Noah didn't seem to do\nany collecting of the pairs of animals required for the Ark; they just\nembarked like passengers going on a cruise. The whole atmosphere of the\nmovie is gloomy and sombre, and even though the weather was obviously\nbad during the rains, the beginning of the film is no different. The\ndialogue is slow and laboured, and really does nothing to give the\nstory a nice and even flow. The 'watchers' - quite a big joke really,\nthey look exactly like transformers made out of rocks. If you like 'The\nTen Commandments' and 'King of Kings', don't watch this, it just isn't\nthe same.\n"},
{"review": "\nWho... thought this movie would every be any good? It had to look as\nbad on paper as it does in film.<br><br>What... were the writers, directors and most of all the producers\nTHINKING? If they needed to loose money for tax reasons or something,\nall they needed to do was make a half decent movie with even more\nspecial effects. They still would have lost money but it wouldn't have\nbeen as painful for me to watch.<br><br>When... will Hollywood stop making biblical movies by people who don't\nhave any relationship with the bible or with God? <br><br>Where... are the people who fact checked the script or even read the\nbible for any real reference to the story told there? <br><br>How... did they every convince anyone to give them money for this\ngarbage? I would like their sales person to help me sell a bridge I\nhave been trying to unload.<br><br>Why... did they waste time and money making this movie? Was there a bet\ninvolved and the film makers lost?\n"},
{"review": "\nI am not sure what pleasure the writer director may have gotten by\nspending millions of dollars to produce a movie from a poem he wrote\nwhen he was 9 years old. The movie was a total waste of time and it was\nan affront to the Holy Bible and several other religious books. I don't\nknow why would someone wish to insult so many people who grew up on one\nof the few stories told by every ancient tribe in the world. The story\nwas not too bad but it is a shame they had to soil a biblical hero in\nthe process. The acting was good and the special effect were special.\nRussell Crowe did as much as he could with the role. Ray Winstone also\nstood out. I just wish they could have stuck with the story of old.\n"},
{"review": "\nNoah (2014): Dir: Darren Aronofsky / Cast: Russell Crowe, Jennifer\nConnelly, Anthony Hopkins, Emma Watson, Ray Winstone: Perhaps the worst\nexcuse for a Biblical movie ever made. Darren Aronofsky has directed\nsuch great visual films as Requiem for a Dream and Black Swan but here\nhe presents a pathetic charade that barely scratches the surface on the\naccount in Genesis where Noah is given visions from God to build an ark\nfor he and his family as well as two of every animal because God was\nset to destroy the earth via flood due to man's rebellious nature. We\nhave giant rock creatures that were apparently fallen angels. We have\nrebellious attitudes from Noah's son Ham in regards to mating, which\ngoes against the fact that Genesis states that Noah's children were on\nboard with their wives. Russell Crowe plays Noah as a barbaric nut case\nwho battles enemies including an ark stowaway that results in a brutal\nfight. Jennifer Connelly plays his wife. Anthony Hopkins is totally\nover the top as Noah's father who lives in the mountains. Emma Watson\nplays a young female found who could not bare children and is touched\nby Hopkins and given the ability. Then she bangs one of Noah's sons and\nhas twins, which Noah nearly daggers. Finally we have a useless\nappearance by Ray Winstone as the film's villain. He apparently stows\naway and gets into a fist fight with Noah. Christians are at opposites\nends with this film and despite it getting some folks looking at\nscripture for themselves, it doesn't change the fact that the story is\nmoderated to action, violence, and a visual world that doesn't fit.\nThis film should be flushed down a toilet. Score: 1 / 10\n"},
{"review": "\nI really loved this movie, but the first half hour was a bit slow and\ncame across as a B movie. I came so very close to ejecting this movie\nfrom the DVD player but could not wrap my head around the idea Russel\nCrowe did a bad movie! I don't take the words of the bible word for\nword so as far as any expectations and the bible I was not\ndisappointed, nor did I have any expectations. I was just sure it would\nbe a good movie. Like I said the first half hour of the movie was very\nslow and quite boring. So glad I hung onto the idea that Russell Crowe\nwould deliver! Once this movie gets going it's almost impossible to\nturn away. Had me feeling sadness(crying), disgust, happiness, love,\nand anticipation all within a 2 hour time frame. Noah will make you see\nand feel the beauty of life. Of course there is a twist with Noah and\nthe bible but the message was clear. Why anybody gave a bad comment is\nbeyond me. this was a story...just like other \"stories\". It's a message\nwell written! I loved it!\n"},
{"review": "\nWhen a film company decides to make a film about themes very much about\nthe Bible than that is a tricky thing to do. You have to be not only as\nfilm company but most certainly as Director sure about where you are\nbeginning with. It is very controversial; many people will like it as a\nmovie but some people will not like it because they are not an atheist.<br><br>Personally I believe in God, but I also am a movie addict, and a huge\nfan of Harry Potter. First of all I think it must be possible to like\nwhat you want without other saying it can't because...Also I went to\nthis film because it was an interesting theme to see on screen. I\ndidn't watch it so I could say : \"Oh this didn't happen in the bible\".\nI can't agree more with the Director to add these giants in the film.\nAs a filmmaker part of your job is that audience will see the whole\nfilm. It must continually be interesting. And that was the reason of\nthe giants and it was a great choice.<br><br>I think the storyline was well written there were good relationships\nbetween those characters and there was done a great job on telling the\nstory. Which is something very important in not only a movie but\ncertainly in a movie like this. The audience must get this connection\nthis special moment when they watch a film. Looking at the storyline it\nworked. I liked the moments of the snake and the apple Etc. they solved\nthat \"problem\" on a good way.<br><br>Russell Crowe and Jennifer Connelly has done a wonderful performance in\nthis film. The whole casting really did their best to deliver a job\nthat would deliver a sort of truth to the story. They respected the\nstory and it was great to see their amazing performance.<br><br>I rate this film 6/10 because of the great performance of the actors.\n"},
{"review": "\nI like Russell Crowe and think he can always bring something to a movie\neven if the script isn't very good. My God (it is a biblical epic) he\nhad to work hard in this film. It was all special effects and no story.\nThe story from the bible is quite well known so why they had to dress\nit up like an episode of Lord of the Rings I am not sure. Russell made\nno attempt to hide his Ozzie/New Zealand accent and as for Ray Winstone\nwhenever he said 'WIV' I thought I was watching Eastenders. I am\nconstantly amazed that he gets cast in Hollywood movies. When Emma\nWatson turned up we were waiting for some Harry Potter magic to save\nthe world. We'd forgotten what we were watching, it could have been\nTransformers as these giant stone men kept striding about. When we had\nthe big build up for Noah interpreting Gods' will that only the people\non the ark could survive ( in one scene some animals were killed- so\nthat was one species that would have died out) he suddenly became all\ncuddly and warm. I wonder if he saw the script before he signed up.\n"},
{"review": "\nI sat down to watch the movie having heard the worst critics from my\nfriends, but since this is Aronofsky and I'm a big fan of his movies,I\nfelt I should have an opinion of my own. Well, let me tell you if this\nmovie is one thing, sure isn't Aronofski...It is not also a religious\nmovie.Any similarity with known names and persons is purely\ncoincidental, I would rather say. So, I thought myself \"ok, cool down,\nmaybe Aronofski wants to explore other ways of cinematography and make\na turn to the blockbuster kind\", but still he is very far away from\nthis kind, since neither the graphics nor the idea of them is something\nso pioneer and spectacular (with some small exceptions during the first\nscenes of the flood). I did watch the whole movie though, until the\nlast torturous second, in honor of the actors, who are great and do the\nbest they can. I suppose Mr Crowe must have imagined that he would play\na role for the Oscars, when he first red the script, another Gladiator\nof older times maybe, so it is really a pity that the director did not\nmake a movie strictly with profound characters and lack of so much\nuseless blood and moving/speaking rocks (even if they are supposed to\nbe fallen Angels)! Mrs Connelly is as always adorable and touching, Ema\nWatson and Logan Lerman are included in the promising actors of next\ngeneration, Ray Winstone always puts a little something with his role\nand Antony Hopkins was just with a bad make-up! To conclude it is a\ngreat pity to have this cast, a story from the Bible that could be\ntransformed into Aronofski's hands into divine scenario and instead of\npure magic, you get this.It is truly disappointing and I really hope\nthat the director goes back to lower budget movies through which we all\nloved &amp; appreciated him.\n"},
{"review": "\nI was hesitant to watch this because I feared some super-contrived\nChristian story line. Instead, I was right to fear it because it is\nsuch a contrived, over-the-top action wannabe. I really wish I could\nunsee it, but what is seen cannot be unseen. What a piece of rubbish. I\ncould go on and trash this piece by piece, but it's not even worth that\nmuch effort. GARBAGE. Seriously IMDb will not let me go without typing\n10 lines of text? What is this? Why should I be forced to rant and rant\nabout this bad movie just to fill a line requirement? <br><br>It's a shame that so much went into the staging of this story, some\ngreat special effects, but totally worthless story.\n"},
{"review": "\nI went to see Noah not knowing what to expect,my overall feeling after\nleaving the cinema was that i had enjoyed a good movie. It wasn't great\nbut its definitely not as bad as some folk are saying. If you want to\nbe entertained and to see a good spectacle its worth having a peek.\nDon't go if your expecting a biblical essay on Genesis 5:32-10:1 or if\nyou take your films too seriously. Its a sort of biblical \"Braveheart\",\nentertaining and not in any way an accurate portrayal of the real\nstory. For example the fallen angels turned into stone are something\neven a pure atheist would agree on is pure Hollywood having not read a\nword of the oldest story. They reminded me very much of the Ent's\nscenes in the Lord of the Rings, a wee bit Plagiarism going on but who\ncares-they were perhaps some of the best scenes in the film pre-flood.\nRussell Crowe is always watchable, maybe not at his best but he didn't\nlook bad for a guy who was supposed to be over 500 years old.\n"},
{"review": "\nThere is no denying that this is a big budget bible story made for the\nbig screen, which takes massive liberties with the 'subject material'.\nYou can therefore, in my opinion, view this as either Biblical\nPropaganda, or actually a half decent Fantasy movie with the solid\nactors. Personally I approached this movie that the latter approach.\nFor me its a work of pure fiction and as I have no strong religious\nbeliefs, I have none to offend and so found a good little movie. The\ncast is solid, with Crowe, being Crowe frankly. All the support players\nact well enough, but there's not one performance that makes you think,\nwow! The film looks and sounds good and is clearly well made. So in a\nnutshell; If you approach this in the same way you would The Hobbit, I\nthink you'll enjoy it, but if you think you're expecting 'god' to show\nup on screen and heal the world, you'll hate it\n"},
{"review": "\nI wholeheartedly enjoyed this movie and am actually sad I did not catch\nit on the big screen but instead on my tiny little laptop. <br><br>of course one of the main reasons I wanted to watch 'Noah' was cause i\nsimply love historical dramas. that, plus, of course the infamous flood\nscene (which sadly is very very poorly done). the story line, does seem\nterribly exaggerated (i might have to get on to Wiki now to understand\nthe actual story of Noah's ark). <br><br>talking about the movie in itself, Emma Watson does herself justice.\nShe is a brilliant actress and portrays her role of Ila to perfection.\nWatching her in action is a joy like no other even when her eyebrows\nraise weirdly when she tries to make her point. <br><br>The direction wasn't up to the mark and the story line okay-ish.\nOverall, this is a serious movie with a lot of blood, gore and\nemotions. Definitely not for the faint hearted and definitely a movie\nthat leaves you thinking for days to come. <br><br>Bottom line - Not a 'must watch'. but definitely a 'could watch'.\n"},
{"review": "\nbefore the appearance of the angels refereed to as the \"watchers\" which\nare pretty awesome. You will become painfully aware of the sort of take\nthey are going for on what is in the bible when you hear Noah refer to\nGOD only as \"the creator\".<br><br>Though at one part it seemed sort of like Emma Watson had been laughing\ntoo much to properly play her role, the acting/ characters played were\npretty nice.<br><br>Keeping in mind the Bible has very interesting descriptions of Angles\nif taken literally: (His body was like topaz, his face like lightning,\nhis eyes like flaming torches, his arms and legs like the gleam of\nburnished bronze, and his voice like the sound of a multitude)-- only\ndescription of one angle with other bits saying angels aren't all the\nsame.<br><br>so if you know about this stuff, nothing is wholly contradictory in\nthis movie. Though it does get a bit too ridiculous/hilarious.\n"},
{"review": "\nThe bible is a wonderful book...possibly the best ever written. To me\nthe story of Noah and the Ark is, like many, if not all, \"stories\" in\nthe bible, a metaphor. Jesus the Christ used parables to illustrate and\nhelp educate his follower's. I do not believe they were all meant to be\ntaken literally...and this movie was most definitely not meant to be\ntaken literally. It is, after all, merely an entertainment at best, and\nquite entertaining it was. I wasn't looking for a literal rendering of\nthe story of Noah. This is a great movie that is well acted with great\nactor's and a great deal of \"literary license\" was taken. Then again,\nwhat \"stories in the bible aren't? CGI is used to great effect as were\nthe computer generated effect's in \"The Lord of the Ring's\" film's. If\nyou want to be given a \"sermon\", go to church. If you want to be a\ncredible \"reviewer\", take a film critique class in college. Just enjoy\nthe show. It's amazing (maybe not) how much vitriol is leveled at any\nmovie, book etc. that is based on a biblical story. There is a\ndisclaimer at the the end of the movie; apparently some people found it\nnot to conform with their version of the Noah story of the bible. These\npeople need to lighten up. It's just a movie, after all.\n"},
{"review": "\nThis film was not perfect by any means but it certainly does not\nwarrant a 1 out of 10. It had some really emotional, touching moments\nin it and had some great effects. Who cares if it was not biblically\naccurate (well apparently a lot of people) - it's entertaining.<br><br>Not a fan of Ray Winstone and his confused accent which I find\ndistracting. I also found it irritating how easy it was for the bad guy\nto manipulate the child of Noah. And then the business of Noah\nconvincing himself he had to murder the new born babies. <br><br>But I liked the relationship between Noah's family and the effects when\nthe animals all arrived at the arc. The battle scene with the giant\nrock men was thoroughly entertaining. And I thought the film took me on\na nice journey into a fictional world. <br><br>I loved The Fountain, Black Swan and Requiem For A Dream, and Noah in\nmy opinion was not as good as any of them, but it might have been\nbecause started watching with high expectations. Not Aranofsky's best,\nbut good nevertheless.\n"},
{"review": "\nNoah<br><br>A good prank to play on God would've been for Noah to load the Ark with\nonly same-sex animals.<br><br>Unfortunately, there are few practical jokes to be found in this drama.<br><br>Fed up with how corrupt humans have become, The Creator decides to\ncleanse Earth with a fatal flood.<br><br>Sharing this with Noah (Russell Crowe) in a dream, The Creator\ninstructs him to build a large vessel for him, his family (Jennifer\nConnelly, Emma Watson, Douglas Booth, Logan Lerman, Leo McHugh Carroll)\nand Earth's fauna to dwell in during the deluge. <br><br>Standing in their way, however, is an army of the forsaken lead by the\nson of Cain (Ray Winstone).<br><br>Loosely based on the biblical account, this visually striking\nre-imagining establishes its otherworldliness early on with angelic\nrock giants, but later balances it with earthbound quandaries\nconcerning Noah's extremist views.<br><br>In addition to animals, paddle boarders also survived the flood. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nThe movie \"Noah 2014,\" was made according to the word and vision of\nDarren Aronofsky and Ari Handel...both Jewish writers. It is through\ntheir minds that this particular biblical story of Noah is told. Many\nstories written in the St. James version of the bible are so fantastic\nand events so miraculous one must gather together all of ones faith in\nGod if any of the events are to be believed. The story of a man and his\nfamily building a floating barge and sheltering animals in it to\nsurvive a great flood is not one of those stories...it is totally\nbelievable and probably true. Unfortunately, Aronofsky and Handel,\nover-fabricated events for the enjoyment and entertainment of the\nmoviegoers, and in doing so changed the believability of the film. To\nhave rock-men with glowing eyes help build the great ark was a bit too\nmuch to ask of me. I simply did not believe it. Even Anthony Hopkins\nwho plays Noah's grandfather, \"Methuselah,\" manages to become a\nunbelievable, mythical character. In the bible, Methuselah was a wise\nman and lived to be 969 years old, according to scripture...but the\ndirector changed him into a \"Oddo-like\" character who cowards in the\nshadows asking for red berries to eat. The momentum of the scenes and\nstory plots were a bit \"slow,\" at times, and movie sets dark and\nsometimes \"colorless,\" but the direction and editing by Aronofsky was\ncrisp and refreshingly different. I expected to see a warm,\ncompassionate and very religious Noah...but the director showed us that\nNoah could also be cold and heartless and prone to a drunken state.\nRussell Crowe, as Noah, did what the directors asked him to do...play a\ncomplex, fallible man. In turn, this made the story of Noah more\nbelievable, and more life-like, but also a bit unlikable and unnerving.\nWhat the audience was expecting was the sanitized, Hollywood version of\nwho Noah was...and what they got probably was the true character of\nNoah...a religious, but imperfect man.\n"},
{"review": "\nIf you watch this film and begin to question why the clothes on the\ncharacters look so modern or how they could survive without any trees\nor vegetation, then, you might not like it. This is a film of messages\nin the form of pictures. When watching, try to forget logic, and just\nlook at it as a form of art. If you go into it with that mind-frame,\nthe you'll appreciate it more.<br><br>Noah is a very powerful film, that will make you take a closer look at\nyourself after the end credits roll. It's not really the action film\nit's being made out to be. It's a very thought provoking, beautifully\nshot film with some memorable sequences--despite several flaws. I found\nthat there were a few predictable moments and the end lacked a climatic\npunch--on both plot and character driven levels.<br><br>I can't give this film a review without mentioning Aronofsky and his\nwonderful vision. For those who don't like the film due to its\nunfaithfulness to the source material, then, think again. This is a\nfilm that people of all different faiths would enjoy. Aronofsky leaves\neverything open to interpretation, including the idea of God, who/which\nis never shown in this film or never even mentioned.<br><br>To top all of this off, Russell Crowe and Jennifer Connolly absolutely\nput everything into these roles--which add urgency to what is otherwise\na very mellow-dramatic plot, but powerful nevertheless--for all of it's\nmetaphorical and spiritual conveyances.<br><br>7/10\n"},
{"review": "\nReviewing movies is not one of my favorite things, but when a movie\ntook 2 hours of your time, starring Russell Crowe, Jennifer Connelly\nand Anthony Hopkins, and at the end of the movie, you will just stand\nsilently with your eyes wide open and ask yourself, what the heck I\njust watched??!! then you should write a review.<br><br>Unfortunately to say, this is one of the awful movies I ever watched, I\nrecommend everyone, don't bother yourselves, and waste your times\nwatching it, only if you want to see how lame it is :p. There is no\nlogical reason, why its rating is above 6. I don't see it, it's like\npeople watched another version than the one I just watched. I gave it\n3, just because I felt pity on the different stars acting in it,\nnothing other than this.<br><br>It is Noah's story man, it could be an artwork, it could be something\nreally attractive, but I don't understand why the director decided to\nput it this way. The story is so lame, so weak, so unattractive, the\nthing that affected the performance of some of the best actors in the\nworld, like Russell Crowe, you will see him in an unpleasant,\nunconvincing, and unsatisfying performance, and this was never the case\nwith him. The same for Jennifer Connelly and the others.<br><br>Before watching it, you need to know that it's a little bit far from\nthe story we know. Personally, I don't have any single problem with the\nchanging, but at least, if someone decided to change a great story like\nthis, then change it in a logical, and beautiful way. If the main\ncharacter of the movie is someone who has psychological problems, and a\nsplit in his personality, then maybe I would give the movie a higher\nrating:p.<br><br>I will wait to see the story of Jesus from this director's\nperspective:p\n"}
]