[
{"review": "\n\nThe Empire Strikes Back is the best film in the original Star Wars trilogy.\nIt has all the great qualities that the original Star Wars has: great\neffects (at the time of its release), appealing characters, and lots of\nspellbinding action.  It also has eliminated some of the problems that\nplagued the first: the storyline is tighter, and goes much deeper into\ncharacter development.  The performances are terrific, especially by\nHarrison Ford as Han Solo, and Billy Dee Williams as Lando Calrissian.\nGeorge Lucas has also remembered to include a spellbinding battle sequence\nwith the snowspeeder sequence near the beginning of the film.  The\nconclusion, with a lightsaber duel between Darth Vader and Luke Skywalker,\nis truly one of the most suspenseful and dramatic scenes in the entire\nseries.  This is a truly wondrous film, and serves as a constant reminder\nthat just because a movie is expensive and a blockbuster doesn't mean that\nit has to be shallow and two dimensional.  This film will undoubtedly\nentertain viewers of all ages from start to finish. \n"},
{"review": "\n\nMy five children were all pre-teens when 'The Empire Strikes Back' came\nto the theater. While there had been other Sci-Fi movies with a theme\nof conflict in outer space, the 'Star Wars' trilogy filled our\nimaginations like no other movies before them. The fantastic, strange\nworlds were presented almost like we were there too. Aliens sitting\naround a tavern, enjoying drinks and speaking in all sorts of\nlanguages. Nothing before had approached the sheer size of the space\nships depicted here, huge cities traveling all over the galaxy. And how\nabout the jump to hyper speed, then disappearing from the screen as the\nspeed exceeds light speed! And the light sabres of the Jedi Knights.\nThe Jedi Knights, a striking parallel to the Japanese Samurai.<br><br>It is fruitless trying to argue 'which is best' in a trilogy, because\nthe first one, in this case 'Star Wars', starts it all and has to be\nthe 'father'. However, an argument can be made that 'The Empire Strikes\nBack' (now on DVD called Episode V) is overall a better-made movie\nwhich has more excitement, and grabs your imagination,than the other\ntwo original installments (now called parts IV and VI). The DVDs\nfinally came out last month, and they are near perfect, as we should\nexpect from Lucas Films and THX. The bit rate is high, and the picture\nis nothing short of superb. As is the Dolby EX surround track. <br><br>My wife and I watched all three of the movies on DVD this week -- Star\nWars, Empire Strikes Back, and Return of the Jedi -- compliments of our\nlocal public library. It was an appropriate reminder how good these\nmovies are, and still ahead of their time. Nothing else has been made\nto compare to them.\n\n"},
{"review": "\nAn excellent sequel to Star Wars, this is easily the darkest and most\nserious out of all the Star Wars films, at least until Revenge of the\nSith comes out. This movie benefits from the introduction of Yoda, a\ndiminutive yet wise Jedi master who helps Luke prepare for his showdown\nwith Darth Vader. It also introduces Lando Calrissian, Han's old\ngambling and smuggling buddy played very well by Billy Dee Williams.\nEmpire is more character driven than the original and relies more on\ncomic relief to help lighten the mood, but it doesn't go overboard with\nthe humor. The story is more refined and the acting is better as well.\nDespite all of this I can't really say that I enjoyed Empire more than\nthe original. The original Star Wars has a certain charm to it that\nnone of the sequels (or prequels) have captured. I'd say that it is at\nleast on par with the original though and is a fitting follow up in\nwhat is probably the greatest series of movies in the history of\ncinema.\n"},
{"review": "\n\nThe sequel to Star Wars is argueably the best of all the Star Wars\nfilms.This is much darker than the 1st one.Look for the Super Star\nDestroyer,it is a awesome ship.Boba Fett makes his fist appearence here.The\nchase scene the M.Falcon is being chased down by the Star Destroyers and Tie\nFighters is really a cool scene.I f you like the 1st Star Wars then you will\nlove this one!<br><br>Note: The special edition has added scenes,special effects,sounds,and\ncreatures. To ME the highlight of this special edition is seeing the Wampa\nmonster!\n"},
{"review": "\nI cannot believe some people out there didn't like this film, yet claim\nto have enjoyed Episode One. No comparison whatsoever. \"The Empire\nStrike Back\" is George Lucas' best contribution to human history, and\nit will be remembered long after most other science fiction films have\ngone the way of the Do-Do Bird. The optical effects still stand the\ntest of time, and the acting is superb. Harrison Ford, Mark Hamil and\nCarrie Fisher are all better than they we in the original Star Wars,\nhaving fully developed and grown into their characters, and the story\njust keeps going and going, from asteroid fields to swamp planets to\ncities in the sky, everything in this film works. So ignore anyone who\nclaims to dislike it, and see it for yourself if you haven't already\ndone so. 20 out of 10!!<br><br>Oh, and Han Solo shot first! =)\n"},
{"review": "\n\nWhile the Titanic made all the rich people (with the exception of Molly\nBrown and Rose) automatically uncaring, snobby, and thoughtless just\nbecause\nthey were rich and needed a couple of villains for the story, The Empire\nStrikes Back did not portray \"the villain\" in a completely evil light.\nSympathy is induced when we see the back of Darth Vader's scarred and\npasty\nhead.  When he tells Luke of their blood relationship, some feeling is\nallowed to creep in, telling us that he is not just some maniacal killing\nmachine, but a human, fallen from grace, yet able to retain some sense of\nlove, however twisted it may be.\n"},
{"review": "\nI literally watched this movie about twenty times when I first got it,\nVHS , a box-set of the original three. But this one is best! It was the\nmost exciting, it kept you on the edge of your seat and your mind the\nwhole way through. Although, I have to say, Lucas has become very lazy\nin the Star Wars saga since the Phantom Menace, which was quite poor.\nThis is vintage Lucas and this your vintage space movie. Star Wars (any\nof the original 3 and Episode 3) is a must see! It includes many\nhousehold names. Some, though, hate Star Wars with a vengeance. Those\npeople lack in creativity and are subject to boring, lack-luster films.\nAll I can say is have fun because I know you won't for missing out on\nthis 5-star, one of a kind classic. Must see, it's too great for a 10\nout of 10 rating. It was way ahead of its time. It's a film of the ages\nand has caliber modern films dream to re-create!\n"},
{"review": "\nI am A Star Wars fan, always have been. The difference was the\ndirection in this film there were standards set. The Imperial Theme is\none of the most well known themes and has been repeatedly parodied\nalthough it has kept respectable as time wears on. Darth Vader is given\nmore than barking orders in \"A new Hope\" Boba Fett the most feared and\nuniversally loved Bounty Hunter even though he had only one line in the\nfirst three series makes his debut but actions speak louder than words.\nDavid Prowses body Language as the dark lord mixed with James Earl\nJones voice is iconic. The budding romance between Han and Leia was a\nsurprise when I first saw this. I thought for sure Luke would get it on\nwith her, but Lucas had other plans which I was really happy about.<br><br>The suspense is really built and when I was seven years old watching\nthis film I hung on every word. I still do. The real difference is the\ndirection and the attention to detail. The asteroid scene was new. John\nWilliams thematics set the cornerstone of the film and a relentless\nchase through the stars for Luke Skywalker by a driven Dark lord is\nanswered at the climax. The screenplay is more mature than the original\nand any of the others following. It is what is left unsaid that carries\nthis film and makes it highly re-watchable.<br><br>I'm going to give this film a nine it still excites me and is the real\nbeginning of the story and for all it's worth I appreciate the prelude\nto it as well. This film delivers the emotional punch that has captured\nfans for decades and cemented a niche in the industry. Enjoy\n"},
{"review": "\nThe second installment of the original Star Wars trilogy benefits from\ncoming from a time when there were very few films that could be called\nthat. If it was made and released now it would be lost in a sea of big\nbudget battles of good and evil aimed at making big money for a week or\ntwo and then disappearing.<br><br>Thankfully it's from a time when it became one of the biggest films of\nthe year or even the decade and it went on to inspire what the film\nindustry is today. Without Star Wars and its army of nerds leading the\nway, there is no Marvel attempt to take over films and no comic-con and\nyou would be looking at a very different world.<br><br>This film has great moment and legendary quotes or misquotes and of\ncourse it has its flaws but what blockbuster doesn't and in the end it\nis a Star Wars film so it's worth watching.<br><br>Featured on Episode 69 of The Emerald Reprobates Podcast.\n"},
{"review": "\nThe rebels' new base is hidden in the icy planet Hoth and Princess Leia\n(Carrie Fisher) commands a unit with Luke Skywalker (Mark Hamill), Han\nSolo (Harrison Ford) and Chewbacca (Peter Mayhew). During the\ninvestigation of a meteor crash, Luke is wounded and captured by a\ncreature but succeeds to escape. While dying on the snow, he has a\nvision of Obi-Wan Kenobi telling him to go to the Dagobah system to be\ntrained by the Jedi Master Yoda. Later he is saved by Han and they are\nrescued in the morning by the rebels. Meanwhile Darth Vader (David\nProwse) sends probe droids through the galaxy to find the location of\nthe base. The rebels are located and they need to leave the planet\nunder the attack of the Imperial Fleet. However Luke heads to Dagobah\nto find Yoda while Leia, Han, Chewbacca and C-3PO travel to the planet\nBespin to meet his friend Lando Calrissian (Billy Dee Williams) and\nrepair the Millennium Falcon. However, they are betrayed by Lando and\ncaptured by Darth Vader. Meanwhile Luke has a premonition with his\nfriends in danger and he decides to interrupt his training with Yoda to\nsave them, despite the warning of Obi-Wan and Yoda. Will Luke be ready\nto face Darth Vader and save his friends? <br><br>\"The Empire Strikes Back\", later retitled \"Star Wars: Episode V - The\nEmpire Strikes Back\" is a fantastic sequel of Star Wars, with a great\nstory. The plot has adventure, romance, comedy and betrayal and is\nengaging until the very end. The characters now are more experienced\nand bonded. The mannerisms of C-3PO recalls Dr. Smith, from \"Lost in\nSpace\". This is the type of sequel that keeps the high quality of the\noriginal film. My vote is ten.<br><br>Title (Brazil): \"O Império Contra-Ataca\" (\"The Empire Strikes Back\")\n"},
{"review": "\nThis film is the continuation of the story of the first. The war\nbetween the rebels and the Empire continues, while Darth Vader Luke\ndemand throughout the galaxy. Directed by Irvin Kershner and written by\nLeigh Brackett and Lawrence Kasdan, this film has the participation of\nthe same actors from the first film.<br><br>The film inherits most of the qualities of his predecessor. It has a\ncarefully chosen cast and consistent performances, with some emphasis\non the work of Harrison Ford, actor who was already highlighted in the\nfirst film and now consolidates his success. Action scenes are\nexcellent, thought of meticulous way and the fight scenes with\nlightsaber remind us some great duels of piracy and swashbuckling\nfilms. The special visual and sound effects are the best that existed\nat the time and fulfill their role with great merit. The only\ndifference between this film and the latest films of the saga is, in\nfact, this technical issue, given the huge advance that, in a few\ndecades, the techniques and special effects achieved. The soundtrack\nwas again in charge of John Williams, which continues the excellent\nwork started in the first film of the saga. In fact, the first main\ntheme of the chords of the saga became one of the songs that\ninstinctively comes to mind of people when they think of film music,\nthe same way as the \"March of Darth Vader\" has become one of most songs\ninstinctively associated with the image of any movie villain. The point\nof greatest merit of this movie is the script. It is a deeper script,\nmore psychological and intense than the script of the first film, and\nthis contributed decisively to the success of it, and the franchise\nitself. Oscar winner for Best Sound, is one of the most popular films\nof the saga in the present day.\n"},
{"review": "\nI really loved all star wars movies. I must say that music is excellent\nand that Dart wader theme is just great. The Cloud City, the most\nawesome of any of the Star Wars arenas, is a beautiful exterior with a\ndark heart. The film culminates in a whirl of emotional intensity and\nthe infernal machine of the carbon freezing chamber. With John\nWilliams' breathtaking score and the dark red hellish lighting, the\nwhole feel is of a Wagnerian opera: dark and epic.<br><br>Magnificently visualized, the dizzying vertiginous terror of the moment\nencapsulating Luke's disorientation and horror at Vader's revelation of\npaternalism.\n"},
{"review": "\nI think that \"Star Wars Episode V: The Empire Strikes Back\" is the best\nout of all the Star Wars films, and also the best motion picture of all\ntime! It has action, romance, tragedy, and lots of good movie traits!\nEpisode V explores the nature of the Force more than the prequel\ntrilogy. The shock that viewers got when they found of that\n*CLASSIFIED* was Luke's father! It's amazing that this film got made.\nIt would have been a disaster if Lucas had ended the saga on the first\nmovie. I love the battle scenes, betrayal, and the special effects of\nthis episode. Many of the planets amaze me because of their stunning\nrealism. Anyways, \"Star Wars Episode V: The Empire Strikes Back\" is the\nbest movie ever made!\n"},
{"review": "\nI always loved watching Star-wars and all kinds of Fantasy, Fiction and\nSci-Fi genres TV-shows and Movies.<br><br>Well, coming to Empire Strikes Back, it sure did gave me goosebumps\nwhile watching. cant ignore rest of the parts! they are much Awesome\nand most entertaining as always.<br><br>Loved how the Plot twists and turns, always leaving Fans in suspense.\nAlso, conflict between the brave but out-gunned Rebel Alliance and the\nmighty Galactic Empire Spices things up. it all comes back to the myth\nof the hero's destiny.<br><br>\"Star Wars will do very nicely for those lucky enough to be children or\nunlucky enough never to have grown up\" You all know what i mean. :)\n"},
{"review": "\nYou know a movie has had a real effect on you if you start using it's\nlines to answer people during your day-to-day routines:<br><br>\"I'll try and be home on time.\" Me: \"Do or do not. There is no try.\"<br><br>\"I love you\" Me: \"I know.\"<br><br>\"Did you hear they are making a live-action Dragonball film?\" Me:\n\"Nooooooooooooo...\"<br><br>Me: *walks over and pets the cat* *cat takes a swipe at me* Me: \"Laugh\nit up fuzzball.\"<br><br>If my brain has chosen to repeat these words then I obviously have a\nconnection with it. Why fight it? ^_^\n"},
{"review": "\nThis film is incredible. I am so thankful for George Lucas and his\nboldness in writing it. I have watched quite a few documentaries on the\nStar Wars series and each documentary gives me more and more\nappreciation for the three films that came out in the 70's. Lucas took\nquite a risk with the Star Wars franchise and it (obviously) paid off\nfor him. If you haven't, I would definitely suggest looking up some of\nthese documentaries in order to see what the project was actually like\nwhen it was first made. The crew and cast describes it as a lot of\nchaos and self-doubt until its first debut when it gained its cult\nfollowing. The way that Lucas wrote and directed these films is a\ntribute to his true genius and success.\n"},
{"review": "\nThe Empire Strikes Back is one of the few movies I call pitch perfect.\nEverything is flawless- the action? Edge of your seat! The drama?\nHeart-wrenching and powerful! The comedy? Frequently clever and\nhysterical! The special effects? Better than A New Hope, and then some!\nAs for the 2004 DVD version, it still has the original flavor of the\ntheatrical cut, the touches are few, and still has most shots from the\noriginal version. Also, may I add that all of the characters are\nperfectly developed and lovable, villain or hero. Han Solo is a great\ncharacter in this, all because of his charming and awesome performance\nby Harrison Ford. My favorite character from Star Wars is Chewbacca,\nand there is no exception here. The stop motion animation done with the\nAT-ATs and the Taun-Tauns still are amazing today, and the wonders of\nthe ship battles are just as beautiful. Overall, Empire is my favorite\nStar Wars, and one of my favorite movies. It has everything- heart,\nhumor, action, drama, suspense. I highly recommend you see this one(if\nyou haven't seen it already).\n"},
{"review": "\nThe Empire Strikes back is the best of the original trilogy, as well as\nbeing the best of the entire series. Its so good that it is on my top\nten films of all time. It manages to switch between the cheery space\nopera tone of the original film with added darkness and despair.<br><br>The characters this time around are given much more screen time to grow\nand develop, being ever more three-dimensional. This depth of character\nis what adds to the first film and makes it so much better than the\nrest of the series. It shows the good and the evil, the greed and\ncorruption and the tyranny that grows within the corners of the of the\nStar Wars universe.<br><br>The cinematography, score and special effects remain quite consistent,\nmoving on from those that were present in the first film. The only\nexception of this is the special effects, which have been slightly\nspruced up since the first film.<br><br>The story itself has become a lot more brutal and unforgiving, without\nmoving into spoilers, it fully embraces the dark side of the force and\nfully explores the darkest corners of its plot.<br><br>It is because of the emotions stirred in Empire that the entire series\ntakes on a mythic quality that resonates back to the first and ahead to\nthe third.This is the heart of the franchise, this is the peak.\nEverything that has been added and built upon from the first film is\nfantastic, there are no conceivable downsides to this space epic.<br><br>More Reviews at: http://12yearsacinephile.tumblr.com/\n"},
{"review": "\n**Warning! Spoiler Information Inside!**<br><br>After Star Wars (1977) changed film history , the movie of the year was\ngiven to Woody Allen for Annie Hall (1977). Go Figure. Undaunted ,by\nthe clear resistance to change Hollywood insiders posed , George Lucas\npushed forward and released The Empire Strikes Back (1980).<br><br>After the swift destruction of the Death Star , the Empire is in full\npursuit ,after discovering the rebels new base the fight is on. Our\nhero,Luke Skywalker is now an essential component to the rebellion ,\nhowever he remains unaware how key he is to his movement. Much is at\nstake as Skywalker (Mark Hamill),faces the ultimate evil in Darth Vader\nand learns the horrible truth.<br><br>Fantastic direction (Irvin Kershner) and dramatic writing are further\nenhanced by the increased acting chops of returner Harrison Ford (Han\nSolo), and support from newcomers Billy Dee Williams (Lando\nCalrissian)and Kenneth Colley (Capt./Adm. Piett). It goes with out much\nstatement that the effects are top notch. The flow is sheer perfection\n,the framing paced at speeds appropriate for almost every scenario.\nThere are a few obvious goofs but they hardly detract from the heavy\nengrossment the storyline causes the willing viewer.<br><br>Of the six (more to come) that have been released , I rate Empire as\nthe franchises top entry , almost flawless as film , almost. The Empire\nStrikes back was also the first film I ever saw.<br><br>Worth watching. Over and Over.<br><br>Four Stars(of 5.)\n"},
{"review": "\ni wanted to briefly state that this is how films and sequels should me\nmade, i know i am not stating new ground here but the sophistication of\nthis film makes me wonder why the template hasn't been used more. it\ndoesn't pick up where we left off, we aren't treated as morons with\nconstant plot explaining, it ends with hope lost. can we have more of\nthis, i don't like happy endings, never seems real in a movie. Han solo\nbeing froze is my favourite thing. the twist is a classic move, lando\ncomes in and is instantly a great character, the universe becomes more\nexpanded. the effects look better, i don't know why this isn't higher\nthan 12th at the time of writing, i just wanted to state i love this\nfilm\n"},
{"review": "\nWhy is The Empire Strikes Back (1980) such a beloved movie? Star Wars\n(1977) is more fun, but Empire marks the point where the story gained\nmore emotional depth and the matinée serial black-and-white morality of\nthe original becomes less defined.<br><br>Howard Hawks once said a great movie has a few great scenes and no bad\nones. If that is the case, then Empire is without doubt a great film,\nas one cannot find a bad scene in the bunch. As for great scenes, just\ntake your pick: the battle on Hoth, Luke's training in Dagobah, the\nX-wing rising from the swampy muck, Lando's reluctant betrayal, Han and\nLeia's poignant farewell in the carbon chamber.<br><br>Undoubtedly, the most iconic moment in this film is the climactic\nconfrontation between Luke and Darth Vader, when our hero discovers his\nmuch-idealized father is a fallen Jedi who has lost much of his\nconscience and humanity. Though Luke's reaction to this reveal is often\nmocked and even I cannot help but chuckle sometimes, I think it's\nentirely appropriate. Hamill's big \"noooo\" is not forced or phony; the\nway his face contorts and his voice cracks makes it feel raw and\nheartbreaking.<br><br>This is one of few films that gets better every time you watch it. It\nalso makes me keenly aware how the series declined in quality afterward\n(Return of the Jedi is okay, but it feels a bit too derivative of the\nfirst and a bit too juvenile for an epic conclusion). Out of all the SW\nfilms, this one is the closest to perfection.\n"},
{"review": "\nThis movie is my all-time favorite. From the massive battles, to the\nsurprising twist that even this day I get tingle from. I can't stress\nthis enough that Empire Strikes Back is one of the greatest movies to\nbe released. I remember first watching this when I was not older than 3\nyears of age, and gasping during the biggest reveal in movie history.\nIf people say they hate Star Wars, then they obviously: <br><br>A. Only saw the prequels (or)<br><br>B. Are hiding the fact that this movie is a masterpiece.<br><br>If you go any longer without watching the greatest trilogy of all time,\nthen you are missing out.\n"},
{"review": "\nI remember to see this movie with my father(R.I.P)in theaters and in\nthat time you don't know nothing about the movie is not like this times\nthat you have magazinez and web to know everything about the movie so i\nwas in 0 when i got to see it.<br><br>Of course i see STAR WARS about 7 u 8 times and i was amazing when i\nsee this movie i was open mouth..so dark so mysterius so thriller so\ntragic i mean everything in this movie was perfect.<br><br>I can't believe that is almost 35 years of this movie and still looks\ngreat with new effects o not look's great!!!.<br><br>That's why all the fans of SW knows that this is the best movie of the\nsaga and simply one of the best sequels ever make in movie story!!!.\n"},
{"review": "\nIt's a great movie but episode four was the best. This one continues on\nwhere episode four left off. Now Luke begins his training as a Jedi\nKnight with master Yoda. Yoda messes with him in the beginning by not\nbeing Yoda but Luke figures it out. I love Yoda and think that he is a\ngreat character. I don't know what Star Wars would be without him.<br><br>Then Luke has to rescue his kidnapped friends from Darth Vadar. The\nmovie is awesome and it still stands up as a great movie even to this\nday. Near the end there is a great twist that really throws the\naudience off the plank. If you haven't see this movie please see it but\nsee episode four first and then this one. Strike back and see this\nmovie. The force wants you to!\n"},
{"review": "\nIt took many years and many viewings before I could say that I liked\nthis film better than A New Hope. But careful examination tells all -\nby every conceivable measure this is a better picture. The characters\nare more fully developed, Vader is even more evil, the score gives us\nthe chilling Vader theme and the story is more interesting. Now that\nthe six films are complete, The Empire Strikes Back is even more\ncompelling and interesting than it was before we knew its Big Secret.<br><br>All great heroes are flawed, and Luke Skywalker is no exception. Empire\nreveals to us in full that the inner battle he will have to fight is\nworse than any enemy he will face. As we meet for the first time Yoda,\nthe wise Jedi master (we find out in Sith why he is on this jungle\nplanet), we learn what a Jedi is, what his responsibility is and just\nhow difficult that life will be. Luke, however, wants immediate\ngratification - he wants to help and wants revenge.<br><br>The film cuts back and forth between Han Solo and Leia's pursuit by\nVader and Luke's training and ultimately leads to the greatest scene of\nthe six films, the epic light saber battle between Luke and Vader. And,\nif you are one of the 12 people on the planet who do not know the\noutcome, the less said the better.<br><br>Empire rightly holds a place in the IMDb top 10, combining\nAction-Adventure, space opera and even the best elements of a\nsuper-hero film, into an infinitely watchable, entertaining movie. ****\nout of ****.\n"},
{"review": "\nOut with Clive Revile and in with Ian McDiarmid. George Lucas has once\nagain retouched this movie, but with little fanfare this time. In the\nnew Star Wars Trilogy DVD 3 pack, (episodes 4,5, and 6) The scene with\nDarth Vader and Emperor Palpatine has been redone. Clive Revile has\nbeen entirely cut out, and an improved holographic projection of Ian\nhas been added along with expanded dialog. And I have to say this is\nprobably the only scene George added to the original trilogy that\nactually made the movie better. But I think George could take a lesson\nfrom the great painting artists, the painting always looks the best\nwhen incomplete, otherwise it has no ability to stimulate our\nimagination.\n"},
{"review": "\nThe rebels have had their brief victory over the Imperial Forces;\ndestroying the Death Star. But the rebels are on the run, hiding on the\nremote planet Hoth. Though hidden for now, it doesn't last long. The\nEmpire have found the rebels base and are going to wipe them out. When\nthe rebels escape, Luke goes to find Yoda, to begin his training to\nbecome a Jedi. Han, Chewbacca, Leia and C3PO are having more trouble.\nThey are being run down by the Imperial Force fleet; trouble is the\nMillennium Falcon is falling apart, making their escape all the harder.\nFinally escaping they head to the cloud city to take refuge with Han's\nold friend, Lando. But Lando is stuck in a bind. He is being used as a\npawn by Darth Vader, to set a trap for Luke.<br><br>This can easily be said to be one of only a few sequels that has\nsurpassed the original. The Empire Strikes Back is darker, deeper\nplotting, much better dialog and incorporates more action without\nrelying upon it. T.E.S.B. expand the story even further, creating some\nstartling revelations. I still remember the first time i heard Vader's\nmind boggling truth to Luke. This also perfectly sets up for the third\nsequel, ending on such a note of anticipation.<br><br>The acting is also better. Here all the actor have fitted comfortably\ninto their characters. As the dialog is better, they seem a lot more\ncomfortable; Lucas's writing in the first Star Wars at times seemed\nreally basic and childish, but its more intellectual here.<br><br>The special effects are just great. They make the action sequences so\nmuch better. The fight between the rebels and the Imperial Walkers is\nso amazing. The fight between Luke and Vader is so intense and\nemotionally charged; it stays with you that fight.<br><br>A step forward in the Star Wars movies. One of the best sequels to any\nmovie.\n"},
{"review": "\nESB is one of the best science fiction movies of all time. In most\ncircles, there tend to be a division between 'regular' movies and\nscience fiction ones, but the Empire Strikes Back not only wrote the\nimportance of the previously establish Star Wars saga into history, but\nborough the Joneses and Kims and N'Danou's and Guptas and everyone else\nfrom all over the world a re-lived curiosity about a genre that often\nis exclusively reserved to geeks, gamers, and goblins. The first star\nwars movie was a feat in special effects and something quite new. The\nEmpire Strikes back, however, drew us into a new world with an amazing\nconviction. We were all so very much standing next to Luke and Han, so\nthat they have almost helped share their world with us, but also\ninfluence popular culture today in a somewhat surrealistic concept,\nwhere the actors/actresses step out of the TV/silver screen and dictate\nthe 'real' world, using their 'fantasy' world to justify for their\ncandor - in an almost 'emperor's new clothes' fashion. Only the\ngreatest movies have the ability to enmesh reality and the fiction on\nthe screen. Lord of the Rings did it, Hitchcock did it, and Lucas did\nit! Lucas made us believe in a world far away, long long time ago,\nwhich any other creator would have made seem like another Star Trek or\nStargate episode (like the prequels).\n"},
{"review": "\nThis film changed my life....i fell in love with Star Wars when it was\nre-released on video in the early 90's.I was a small boy that would\nobsess over things like Batman &amp; Nickelodien.After i saw the trilogy, i\nwent and bought everything i could get my hands on.Children of nerds\nshould be given this at birth.This film is,in my opinion,is the\ngreatest of all the Star Wars films.I think that it has a fantastic\nending,cool characters (Boba Fett,Yoda,Lando) and great acting.I\nrecommend this film for every Sci-Fi fan (even the Trekkies).I also\nmust say that this is just a great film all around(not just for a\nspace-fantasy).\n"},
{"review": "\nAs great as the original Star Wars may be, The Empire Strikes Back\nremains the best film in the series. As the years pass, the real\nachievement of Empire only grows. While the original film has grown\nsomewhat dated in appearance, and Return of the Jedi feels a bit silly\nnow, Empire has maintained remarkable staying power. The effects in the\nfilm feel as fresh now as they did in 1980, and as importantly the\nstory and tone of the film still hold an ominous feel and lend the\nseries the grandeur that made it so lasting. Without Empire, Star Wars\nwould have been remembered but not nearly in the same way. Everything\nthat was begun in Star Wars was expanded and improved upon here, right\ndown to the score Remember, this was the movie that introduced the\nnow-famous and ridiculously overplayed Imperial March composed by John\nWilliams. And virtually every scene is now iconic--the Imperial Walkers\nin the snow, Luke's training in the swamp, the asteroid field chase of\nthe Millennium Falcon, the Cloud City, Luke's lightsaber battle with\nVader. When I think of \"Star Wars\", most of the images that come to\nmind first are from Empire. The colors and textures of the film are so\nsharp and rich.<br><br>A truly majestic film. One of the great visual statements in the\nhistory of movies, and one of the most successful realizations of a\nmovie vision we will ever see.\n"},
{"review": "\nIt's very rare when a sequel outshines the film that came before\nit,\"The Empire Strikes Back\" manages to do that in many ways. \"Star\nWars\" always will be considered an all time classic,but \"Empire\" is a\ngreat follow up.<br><br>According to George Lucas,It's \"Episode V\" in his space opera. In my\nopinion it's the best in the series.<br><br>The characters are more fleshed out this time,and the plot is more\ncomplex and darker then the previous installment. The F/X is\noutstanding.<br><br>The film stands on it's own as a great cinematic achievement and should\nbe recognized as more than a sequel,It's a continuation of great epic\nand all around excellent film.\n"},
{"review": "\nFrom it's opening scenes on the bleak ice-ball that is the planet Hoth,\nto its exciting finale on the cloud city of Bespin, The Empire Strikes\nback is a worthy sequel to the magnificent Star Wars. Taking over the\ndirectorial reins from George Lucas, Irvin Kershner steers the movie\ninto darker territory to deliver a more mature movie than its\npredecessor.<br><br>The Empire is still licking its wounds after the destruction of the\nDeath Star, and evil Darth Vader is intent on finding the rebels\nresponsible for destroying his new toy. Luke's aim, meanwhile, is to\nbecome a fully fledged Jedi knight, whilst Han sets himself a more\ndifficult target: he plans on getting into Leia's knickers.<br><br>With more incredible FX packed action scenes than you can shake a\nlight-sabre at (highlights include the fantastic battle on Hoth, a\nchase scene through an asteroid field, and the Luke/Darth light-sabre\nduel), and THAT moment where we learn the truth about Luke's father,\nit's no surprise to find that this episode is often said to be the best\nof the series. Personally, A New Hope will always be my favourite (for\nsentimental reasons), but The Empire Strikes Back is a very close\nsecond.\n"},
{"review": "\nThis is one of my favorite movies, and one of the best movies that has\never been made.Star Wars was a great movie, and a sequel being better\nthen it seemed impossible, but empire strikes back is a better movie\nwith a lot of good stuff.The special effects are still good today and\nthe story is pretty good, i love a lot things that this movie has that\nstar wars didn't.Like a lot better fight scenes, and they show a lot\nmore of places and planets then the 1st one.I was very pleased with\nthis movie and think it is a great film for a true movie fan to watch,\ni disagree with a lot of people who say it is the best star wars\nmovie.But i can understand why they say it, empire has a lot of things\nto it that are just well done and impressive.I think this movie is\nworth owning and is a movie you can watch many times.\n"},
{"review": "\nIf the first Star Wars (1977) was groundbreaking, this one is\nbreathtaking! According to me at least - the best picture in film\nhistory! A culminated crown-jewel after a decade of excellent drama\nproductions, such as The Godfather I &amp; II, one flew over the cuckoo's\nnest etc, etc. Everything is there.. skillful focus on the\ncharacter-arch.. a relaxed and charming love story.. fantastic action\nand heroism.. and above all- George Lucas story! What is going on\ninside that man.. \"A modern age Genius\". How does he come up with all\nthat weird but super-cool stuff! And John Williams music..!! The themes\nand their crafted development to the story context.. wow.. Why he\ndidn't get the academy award, still remains one of the biggest\nmysteries to me, up to this day.. If you find yourself crying, getting\ngoosebumps and laughing at the same time when viewing this piece, don't\nworry- You're not alone...The force is strong with this one!!\n"},
{"review": "\nI usually watch this show every two years to keep a fresh perspective\non it. This is the first real film experience I ever had, and it\nremains the strongest influence on me. The thing that amazes me about\nthis, time and again, is the ingenuity of the pacing, the\norchestration, and the motion of the vehicles and ships.<br><br>This is a triumph of editing.<br><br>The motion control work is so artfully done, it puts CGI to shame.\nWatch how the ships move. They dance alongside the camera, swooping\ntoward and away from us. Look at the terrain whiz by in the snowspeeder\nsearch. No CGI can convince like that. This is basically helicopter\nfootage on fast-forward, through the cockpit of a prop ship, but it\nworks. The amount of activity going on screen at any given time is\nfrenetic.<br><br>And then we have Frank Oz. Forget that we live in a world where there\nare Yoda pajamas, animal crackers, dolls, etc., and just focus on this\nwonderful character in this one film. He is more lifelike than many of\nthe actors we have working today. When he is on screen, I believe he\nexists. That is pure movie magic. Mark Hamill is given a tough job with\nthis. Whenever you have a multi-million dollar film that hinges on the\nperformance of one person and a sock puppet, there's pressure. People\nhave blasted him for years over his acting, but it works. He pulls his\nshare of the work and sells every scene.<br><br>From the opening crawl onward, this never lets up. The music is simply\nbeautiful. This is why I go to the movies.\n"},
{"review": "\nAnd damn if it didn't deliver the goods and a helluvalot more. It is so\ndark in theme it almost enters horror flick territory and that is\nbrilliance in and of itself to go from one extreme to the other so\nfluidly and poetically. It worked in a way that The Temple of Doom just\ndidn't with moviegoers. I suppose that was due in part to the cool\nsuspenseful plot developments, particularly Yoda, Han and Leia's\nbudding romance, but largely due to the Earth-shattering \"the world is\nnot flat it's round\" surprise ending. I would bet when George Lucas\nwrote that scene down on paper he must have been either laughing\nmaniacally and saying \"Nobody could ever have seen that coming in two\nbillion light years!\" or crying with joy all the while with the one\nidea that \"This will be so golden that it will be remembered til the\nend of time and even after that.\" As Hamill said so eloquently, \"In the\nEmpire Strikes Back, everyone has problems. Luke has problems, Leia has\nproblems, they turned Han into a coffee table!\" I must also include\nSilent Bob's quote \"She says 'I love you.' and like a pimp he says 'I\nknow'.\" It was the equivalent of dropping burning napalm on the\naudience. They must have been more stunned than people leaving the\ntheaters after seeing the Exorcist for the first time. It was pure 100%\nmovie magic and worthy of the original in every aspect.\n"},
{"review": "\nMany feel The Empire Strikes Back is even better than Star Wars. Is\nthis true? I really don't know, as Star Wars is probably the greatest\nfilm ever made, but many say ESB is as well.<br><br>In many ways, Empire does surpass Star Wars as we get to know the\ncharacters even better and see their further adventures unfold. And the\nspecial effects - incredible. Much better than today's computer images.\nIt is hard to believe scenes such as the Hoth Battle and the asteroid\nchase were filmed almost thirty years ago! Empire, if it is or isn't\nbetter than Star Wars, has to be one of the most perfect films ever\nmade, to say the least. A timeless classic.\n"},
{"review": "\nThis, is one of those times where it's great when the bad guys win. I\nhad grown up watching old westerns and kiddie movies, where it was all\ngood guys win at the end. And when I first saw this when the Original\n(Best) Trilogy reopened in theaters, my parents rushed me to the\nnearest cinema. I was astounded. Great acting. Even better directing,\nit's the greatest space movie pretty much ever made.<br><br>It's only better because \"Star Wars\" set this one up perfectly. And it\nallowed a suspenseful \"Return of the Jedi\", which needed all it could\nget, because it was the worst of the Original's, but still pretty darn\ngood. Overall even though it was made in the 80's it was still\ncaptivating to a boy used to computer graphics. The absolute best part\nwas the final lightsaber battle between Vader and Luke where... well, I\nwon't spoil it for those who haven't heard the line.\n"},
{"review": "\nThe best of the Star Wars series? Without a doubt. What makes this\nmovie so great is the fact that it is not like other movies, leaving\nyou with all the hope you need at the end. In this film, however, the\nonly hope is that all of the main characters are still alive at the\nend.<br><br>Another thing that places it above the others is its ending. The \"I am\nyour father\" scene is no doubt the most famous single scene in film\nhistory, as well as one of the most shocking twists in any film ever\nmade. Jones' delivery during the scene, as well as Hammil's reaction to\nit, only makes the scene better.<br><br>And, of course, we can't forget the introduction of everyone's favorite\nJedi master, Yoda. The jump he makes from strangely hilarious (\"MINE!\nMINE!\") to calm and serious is very believable, unlike most films,\nwhere major jumps in personality are not believable at all. His unique\nspeech is also interesting.<br><br>In closing, one of the best films ever made. Thank you, George Lucas\nand Irvin Kershner, for bringing one of the best movies of all time.\n"},
{"review": "\nAlthough called \"Episode V,\" this was second movie in the Star Wars\n6-part installment and I've always thought one of the better entries in\nthe series.<br><br>If you watch the first Star Wars and then this one, you'll immediately\nsee a vast improvement in the special-effects department. There is a\nmuch more polished look to this one, and improved sound In fact, the\nDVD transfer is outstanding considering the age of this film.<br><br>While the first Star Wars was a bit subdued, this one picks up the\naction right from the start, although lulls are really appreciated\nbecause the first 40 minutes are pretty hectic. The most notable of\nthose scenes are the gigantic robots which were awesome when this film\nfirst came out, and are still pretty good. The movie calms down after\nthat opening land war but retains the viewer's interest with other\nthings.<br><br>The second half of the movie features two stories going on at once: the\nbattle in space with most of the cast involved, and \"Luke Skywalker\n(Mark Hamill) in a swampland involved in his training sessions with the\nMaster Yoda.<br><br>Some of the movie's dialog is still corny, especially between Han Solo\n(Harrison Ford) and Princess Leia (Carrie Fisher) with their love-hate\nrelationship, but it's not overdone. What is overdone is constant\nbleating noises emanating from \"Chewbacca,\" the wookie. That\nsheep-in-heat noise can get annoying after awhile. The \"Rambo\" action\ncontinues as it did in the first film, with the villains firing\neverything at our heroes and never hitting them. Ludicrous, but part of\nthe deal. Those things you just put up with as the film, overall,\ndelivers another interesting adventure, far more than the first Star\nWars and leading up to the next one, which was even better.\n"},
{"review": "\nStar Wars Episode 5 The Empire Strikes Back tells the story of the evil\ngalactic empire attacking the hopeless rebellion after the destruction\nof the Death Star. One thing that I feel is worth noting right off the\nbat is that I don't think this film surpasses A New Hope but is ratter\non the same level in terms of substance as well as quality.<br><br>What makes this film good is that it is able to keep its focus on the\ncharacters in a universe that is so interesting as well as vast. That\nis something that makes the original trilogy better in my opinion\nbecause in the prequels it was focused on showing us heavily C.G.I.\nvisuals ratter then on the characters. This is one of many factors that\nmake the original trilogy by far the superior films. The plot is also\nmore complex then the first of this trilogy which shows that the people\ninvolved with this project were taking risks. The characters were all\nlikable and interesting. And the fact that they filmed at real\nlocations shows dedication from the director Irvin Kershner.<br><br>The cons of this picture though are not minimal which leads me to\nfeeling as though it is grossly overrated. The acting and dialogue is\nstill hooky, the effects are showing age, the action is underwhelming,\nand unfortunately the fan base that surrounds Star Wars has made it\ndifficult to watch Empire as it was intended. The story although\ncomplex is occasionally driven forward by plot convinces. And although\nI did not see this infamous twist coming, I also was not all that\nwowed.<br><br>In conclusion The Empire Strikes Back is complex and has relatable\ncharacters which is able to drive this picture forward as well as be\nentertaining. And I'm giving this one a 6/10.\n"},
{"review": "\nBy far my favorite Star Wars movie. Contains the iconic parts of the\nsaga, for example the reveal of Darth Vader. The settings for the\nentire movie are outstanding from Hoth to Cloud City. As always the\nscore from John Williams was on point more so than ever in my opinion.\nThe movie is set between episodes 4 and 6 doing a perfect job of not\nonly carrying through the success of the first movie and surpassing it\nin my opinion but also does an amazing job of setting up episode 6 to\nconclude the trilogy without leaving an annoying cliffhanger at the\nlast minute. The characters really establish themselves with more\nfamous moments such as Han Solo's \"I know\" line towards the end of the\nmovie and we get to see Luke's agony as he hangs from cloud city.\n"},
{"review": "\nThe Empire Strikes Back is a 1980 epic space opera/space fantasy film\ndirected by George Lucas and direct sequel to Star Wars. As a brief\nsummary, The Empire Strikes Back is a classic example of a movie that\nthe critics of the time got very wrong. Initially receiving mixed\nreviews and being slammed by some is nowadays considered to be one of\nthe greatest movies of all time and the best Star Wars film\noverall...and its not hard to see why! The Empire Strikes Back\ncontinues on from the events of Star Wars revisiting the characters of\nLuke Skywalker, Princess Leia and Han Solo. The Empire Strikes Back is\nknown to be the much darker sequel, with much more character depth,\nvulnerability and emotion. Lucas continues to develop his beloved\ncharacters in all the right ways with the Han-Leia relationship, the\nmore powerful feeling of friendship and of course the biggest, most\nshocking twist in cinematic history with Vader and Luke in the final\nact of the film. The Empire Strikes Back also continues to evolve the\nworld introducing us to new places, new characters such as the\nlegendary Jedi master, Yoda, improving the special effects and an even\nmore beautiful soundtrack, provided by John Williams. The Empire\nStrikes Back is a perfect example of a sequel done right, equal and at\ntimes even better than the original. Epic battles, intense space\nchases, powerful emotional character development, shocking twists,\nthought-provoking ideas, themes and messages and finally groundbreaking\nsequences and special effects. In terms of flaws The Empire Strikes\nBack virtually has none whatsoever, other than an unfortunate twist\nwhich has had a negative response later on in the franchise, a few\nunnecessarily long scenes of Luke's training, and in my opinion a\nslightly weaker general plot than the original story. These however\nbarely affect this near perfect masterpiece of a movie. 9/10\n"},
{"review": "\nI think that it went beyond Star Wars. You got to know the characters a\nlittle better, you had some humour. I thought of The Empire Strikes\nBack as the second movement of a symphony. That is why you see some of\nthe things slower. And it ends in a way you cannot wait to see to hear\nthe vivace, the next movie, the allegretto. Episode V didn't have a\nclimax at the end. It had an emotional climax. There were something\nabout Empire that immediately just clicked when I saw it. I did not\nknow how all the romance between Solo and Leia were going work and the\nadventure and were it too serious, and all this sort of stuff. But it\nreally came together. Until its premiere, cases of lighting striking\ntwice were rare in Hollywood. Sequels were nearly always a letdown. But\nin the Star Wars universe, different laws applied.\n"},
{"review": "\nWhat a Shocker...I think this one is everyone's favourite as nearly\nevery single fan will say \"This is the Best Star Wars Movie of All\nTime\" and I agree with them, but that's not the main reason why I love\nit.<br><br>It's always hard to make a sequel better than the first installment,\nand this was more successful. Unlike the first one, they made it darker\nand they explored the series.<br><br>We got to see more worlds and we got to know more about the Jedi and\nhow the Force works, the Lightsaber duel in this is really intense,\nmuch quicker and precise.<br><br>Another reason why I love this one is because the Bad Guys win, which\nis surprisingly rare, we get Han Solo captured by Boba Fett the Bounty\nHunter, Vader wins the fight and the heroes still don't want to give\nup. <br><br>And also this was the film that gave us the greatest plot twist of all.<br><br>Also, Yoda is awesome.\n"},
{"review": "\nBest movie of the series, including the latest effort.<br><br>I love everything about this movie, the music is amazing and I love the\nsettings.<br><br>The characters are really well developed in this movie. Original and\nmature film making. It fleshes out the characters and makes you care\nfor them even more.<br><br>I first saw this movie when I was 9 years old and I thought it was\nmagical then and I still do. <br><br>I have watched both the remastered edition and the original version and\nthey are both beautiful but I think Bespin looks even better in the\nremastered copy.\n"},
{"review": "\nJust when you thought it couldn't get any better, this movie paints\nitself across your screen. Opening with the famous Hoth battle you gasp\nin awe as the famous Imperial AT-AT's march to crush the rebellion, and\nwatch as your favorite heroes try desperately to stay 2 steps ahead of\nthe empire. Be introduced for the first time to Yoda, and journey to\nBespin where you see Boba Fett, an incredible bounty Hunter. Just when\nyou thought it couldn't get any better Darth Vader faces off with his\nson, and let me just say it is cinema gold. Jump up and down in your\nseat and gasp as you hear Vader say, \"No. I am your father.\" Mutter the\nwords, \"Never tell me the odds,\" and \"Do... or do not. There is no\ntry,\" as you sadly drag yourself away from the movie as you remembering\nHan Solos fate and the Lose of Lukes hand. I give this a 10/10. \"Why,\nyou stuck up, half-witted, scruffy-looking Nerf herder.\"\n"},
{"review": "\nI grew up on Star Wars, because my oldest brother made me watch it (and\nI was never mad at him for that) Episode V starts out so strong it\nmakes you wonder how is the film going to become better and the answer\nis: everything the film progressively gets better throughout the\nduration and it has an incredibly amazing beginning and it truly in a\nspectacle on how the film gets better through out. The entire Star Wars\ntrilogy is amazing as itself and with ionic lines such as \"NO, I am\nyour father\" and Han Solo preparing to be frozen in carbonite, kisses\nLeia with the lines of dialogue \"I love you\" \"I know\" it truly is an\nicon in American cinema and I thoroughly recommend that if you have not\nseen the original trilogy, that you go out and buy it and binge watch\nthem all in one day. in my opinion i believe Episode V is the strongest\nof the 3 and easily the one that shows the most character development\nthrough out. Thank you for reading and I hope i helped you\n"},
{"review": "\n'Star Wars: Episode V - The Empire Strikes Back' is the second part of\nthe original Star Wars trilogy and was released back in 1980, three\nyears after the release of 'Star Wars: Episode IV - A New Hope'. The\nmovie continues the story of young Luke Skywalker and the galactic\ncivil war between the Rebels and the Empire, while also introducing\nviewers to new aspects of George Lucas' universe, such as the deeper\nmeanings of the Force and much more.<br><br>It is, by far, the best movie in the Star Wars saga, as well as the\noverall greatest movie ever made. The movie deepens the main\ncharacters' relations to each other, making us as viewers care even\nmore for them as human beings. Another great aspect of the movie is the\ncharacter of Yoda, portrayed by Frank Oz. Without spoiling anything for\nthe uninitiated, this characters is one of the best things in the\nmovie, due to Oz's ability to make the character feel like a real\nliving being. However, no movie is perfect and while this movie is\nalmost perfect, there is a couple of lines of dialogue that feel a\nlittle bit forced when spoken by the actors during the film's running\ntime.<br><br>In the end, 'Star Wars: Episode V - The Empire Strikes Back' is my\nfavourite movie of all time, as well as the greatest movie ever put\nonto the silver screen. If you have not seen it, or the other parts of\nthe trilogy yet, you must do it as soon as possible, so that you will\nnot miss out on one of Hollywood's greatest cinematic adventures of all\ntime.\n"},
{"review": "\nThe Empire Strikes Back is the most suspenseful, well-paced and most\nemotional entry of the Star Wars saga. It's the greatest of movie\nsequels and as far as it goes, it is everything a sequel to a great\nmovie is supposed to be: a darker tone, more development with the\ncharacters, universe expanding with some new and greater additions and\nfeatures.<br><br>The perfect adventure telling story that continues from where it left\noff from and delved deeper into the characters we all know and love\ntoday and introduced bigger places in the galaxy far far away that\nGeorge Lucas originally introduced to us. The action is stunning, the\nvisuals still look ground-breaking today. Empire overall, is just the\nbest movie sequel ever and I don't know if I can call it the best of\nthe original trilogy because its a tough choice between the three of\nthem, to me.<br><br>But I still love The Empire Strikes Back so 10/10.\n"},
{"review": "\nEmpire is by far my favorite of all the Star Wars movies. It's darker,\nhas so much going on, has fantastic locations and introduces some epic\ncharacters. I love the scenes when it's in Hoth. And Cloud City, too. I\nthink from the moment it starts to the moment it ends is brilliant. The\nentire movie is fantastic and it's definitely in my top ten favorite\nmovies list. The ending to the movie is so awesome. I don't know if I\ncan choose a favorite in this particular Star Wars movie, but if I had\nto I'd maybe choose Luke or Han (whereas in IV it was definitely Han,\nand in Jedi it's definitely Han.) Star Wars Episode V: The Empire\nStrikes Back, in some cases, isn't just a movie - it's a landmark! A\npiece of cinematic history that strongly surpasses most sci-fi movies,\nand most movies in general, in terms of how great it really is.....\n"},
{"review": "\nMany people will give kudos to George Lucas for this movie but I won't.\nIt isn't really his movie and you can tell which movies George Lucas\ndid vs. the ones he didn't because the ones he had too much control\nover sucked. This movie did not suck.<br><br>OK. I'm not a fan boy. I saw this movie like a billion times back in\n1980. I own the original copies of the VHS and refuse to own the DVD or\nBlueray copies. George Lucas is brain dead for making the changes that\nhe did and Han Solo shot first.<br><br>This movie is a great classic. It goes down and one of my top ten\nmovies of all time. It has all the aspects of a great story even if\nthere are a ton of bugs through out the script and special effects. I\ndon't care, it rocks.<br><br>Rebels vs. Goliath. Outerspace. The Force. Lightsabers. Aliens. Cool\nstuff!<br><br>Why can't they make more movies like this? Because directors are\nconstantly trying to please those who want profit over art.<br><br>10/10 stars is not enough for this movie.\n"},
{"review": "\nI gotta admit I never always like Star Wars episode 5 the empire\nStrikes back. I use to think that it was boring and had too much\ntalking and Information but I grew older and now I study films and\nnotice Why certain things happen and how they make a film better. I\nwill not deny that I am tired of hearing certain scenes but that\ndoesn't happen Often. Honestly if you haven't seen this you must. The\nonly problem I can think Off is the battle between vader and Luke. I\nwant to know why vader didn't kill Luke and what happened to R2. Why\ndid he get dragged down at dagobha What was the point of that scene.\nThe film has a great beginning and a good Ending. Overall as a trilogy\nit is better than the prequels\n"},
{"review": "\nIn cinema, there is two categories, movies and films. Movies are the\nsimple ones, such as Transformers, The Avengers, and The Hunger Games.\nFilms are the ones that transcends and push the borders, such as 2001:\nA Space Odyssey, The Godfather, and Pulp Fiction. The Empire Strikes\nBack is a film. It set the bar for ALL movie sequels to come and pushed\nthe borders of how a sequel should be. This is a rare sequel that\nimproves on it's predecessor. For starters, the characters change. Luke\nmatures, Han Solo and Princess Leia start a relationship, and Darth\nVadar becomes more evil in his actions. The story here puts our heroes\nat their lowest point. The tone throughout the movie is very bleak and\ndepressing. You feel bad for our heroes and all the bad crap they have\nto endure throughout the movie. So DON'T expect this film to be a\nrehash of the first movie like Age of Ultron was to The Avengers. Like\nStar Wars, the only bad thing about this film is the Special Edition.\nLuckily, this is the Star Wars film with the least changes in it. If\nyou are a proud cinephile, like I am, and want to see a masterpiece in\ncinema, this is it.\n"},
{"review": "\nStar Wars: Episode 5- The Empire Strikes Back (1980): Dir: Irwin\nKershner / Cast: Mark Hamill, Carrie Fisher, Harrison Ford, Billy Dee\nWilliams, David Prowse: Blindsiding visual wonder recalling the threat\nto Rebel forces whom are hiding on the ice planet Hoth. Luke Skywalker\nis instructed to seek Jedi training from Yoda. An attack by Imperial\nforces leaves the Rebel base in ruins but Han Solo, Princess Leia and\ncompany narrowly escape in the Millennium Falcon. They venture to Cloud\nCity where Lando Calrissian betrays them thus setting a trap for\nSkywalker. Cliffhanger ending hinders it in standing on its own but\ndirector Irwin Kershner explores darker aspects. Mark Hamill returns as\nLuke who learns endurance, concentration, priorities, friendship, and\nvery hard truths that leave him literally dangling for survival.\nHarrison Ford as Han learns to put the needs of others ahead of his own\nparticularly when sacrifices arise. Carrie Fisher return as Leia who\nstrengthens her leadership. Billy Dee Williams as Lando realizes his\nmistakes and hopes correction is possible. David Prowse dons the suit\nand presents the intimidating presence of Darth Vader who presents\nthose ever famous hard hitting words to Luke. Special effects are just\nas electrifying with the appearance of Yoda among other creatures and\nlandscapes. The film serves as a follow up to Star Wars with intriguing\nsuspense and imagination. Score: 7 / 10\n"},
{"review": "\nSTAR WARS:Empire strikes back,The second installment in original\ntrilogy and i must say it is best in the series and perhaps greatest\nsci-fi flicks ever made . Irvin Kershner and George Lucas comes\ntogether to make this iconic film which is shot beautifully,even though\nit was made nearly 35 years ago the visuals still hold up and will for\nages to come.More than visuals it is the depth of the story that makes\nthis a masterpiece.<br><br>The movie starts off from the end of episode 4,where rebels are pursed\nby the empire after destruction of death star.Rebels are forced to\nestablish a secret base on ice planet hoth.After the imperial AT-AT\nwalkers attack their secret base,princess Leia,Han solo ,chewbacca and\nC-3PO escape in millennium falcon while Luke and R2-D2 go to the\ndagobah system to receive training from master Yoda and become a\nJedi.Luke must decide whether to complete his training or go save his\nfriend who are now captured by evil Darth Vader.The final fight between\nVader and Luke will surely blow your mind .And finally breathtaking\nmusic by john Williams.<br><br>Empire strikes back is best trilogy even though New hope and return of\nthe Jedi are perfect.Forget the disastrous prequels and go watch the\noriginal trilogy when Lucas was at his best.\n"},
{"review": "\nFor the 1977 film, see Star Wars (film). For other uses, see Star Wars\n(disambiguation). Star Wars is an American epic space opera franchise\ncentered on a film series created by George Lucas. The film series,\nconsisting of two trilogies (and an upcoming third), has spawned an\nextensive media franchise called the Expanded Universe including books,\ntelevision series, computer and video games, and comic books. These\nsupplements to the franchise resulted in significant development of the\nseries' fictional universe, keeping the franchise active in the 16-\nyear interim between the two film trilogies. The franchise depicts a\ngalaxy described as \"far, far away\" in the distant past, and commonly\nportrays Jedi as a representation of good, in conflict with the Sith,\ntheir evil counterpart. Their weapon of choice, the lightsaber, is\ncommonly recognized in popular culture. The franchise's story lines\ncontain many themes, with strong influences from philosophy and\nreligion. <br><br>author: http://www.internetvietnam.net/<br><br>Have a nice day.\n"},
{"review": "\nI have to admit, I never read the novel this is based on. But I'm\nguessing the people who don't like the movie at all (which is fine),\neither haven't read the book or don't like the book. I'm saying this,\nbecause what you are getting here, is very close to adult films.\nSomething people in Germany (censors that is), do not have a problem\nwith (the movie is rated 16+).<br><br>I can only guess the movie will be NC-17 (if they rate it) in America.\nThere are explicit images of male genitalia, a lot bare breasts (though\nmostly of our main female lead). With all that said, I went into the\nmovie with the impression I wouldn't like it at all.\n"},
{"review": "\nIn my opinion this is not only better than the first film or the fourth\nwhatever but it is the best in the entire franchise. I loved it from\nthe first minute until the last, I love star wars even since I was\nabout 4 years old and I used to hate this movie but when I watch it now\nit's just amazing. Also in this film great Star Wars characters make\ntheir debut with the likes of Yoda and Orlnado Calrizion (if that is\nhow you spell it and I can't remember if it is Orlando and Lando so\nexcuse me if I got it wrong.)<br><br>This film starred Mark Hamill, Harrison Ford &amp; Carrie Fisher<br><br>I highly recommend this film to all you sci-fi fans<br><br>****/***** not outstanding but very good\n"},
{"review": "\nTop of the line for a majority of Star Wars geeks, and for good reason.\nIt's the ideal melting pot of George Lucas's vast, quirky imagination,\nhis influences' knack for dark, large-scale epics, and his key\ncontributors' determined efforts to retain a central humanism amidst\nall the creatures, effects and operatic indulgences. A wildly ambitious\npicture, it's genuinely amazing just how much territory is covered over\nthe course of two hours. Lucas and company manage to leap from the Hoth\nbattle to Yoda on Dagobah, the asteroid field to Lando and Cloud City,\nbefore finally climaxing with the classic Luke / Vader showdown and\nrevelation. That's an awful lot of set pieces, not to mention some\nseriously powerful plot points, but smooth talking and a few\noutstanding performances keep the film from feeling over-stuffed or\nunder-explored. The cast, too, grows on an individual basis almost\nuniversally, with Luke wrapping himself in the wisdom of the Jedi, Han\nand Leia developing genuine chemistry and Darth Vader, in a surprise\ntwist that should never have been so effective, actually showing some\nsigns of humanity. Although it can be hammy from time to time, those\nmoments are balanced expertly by a wonderful series of mountains and\nvalleys, to the point that they stop being seen as negatives and\ninstead contribute to the picture's eccentricity. A legendary effort\nthat's just as monumental, entrancing and electric thirty years later,\nit's damn near perfect.\n"},
{"review": "\nAfter having watched A New Hope, I watched the next installment to the\noriginal trilogy before the prequel trilogy \"The Empire Strikes Back\"\nand I personally agree that this is a great follow-up to it's\npredecessor since it defined the meaning of a Hollywood classic.<br><br>The directing from Irvin Kershner is brilliantly focused and adds a\ngreat atmosphere to the movie, making it a lot darker than the previous\nfilm. The story is very original and has a lot of exciting moments and\na touching scene where Leia says, \"I love you\" and Han Solo says, \"I\nknow.\" in the carbonate scene especially the lightsaber fight scenes\nbetween Luke and Darth Vader. In fact, the characters are likable as\nthey were in A New Hope. Mark Hamill did great as Luke as a now\ndetermined warrior to find out about his father from Yoda played\nbrilliantly by Frank Oz along with Alec Guiness as the ghost Obi-Wan.\nCarrie Fisher and Harrison Ford did great with their love and chemistry\nas Princess Leia and Han Solo. The only character who steals the show,\nhowever, goes to Darth Vader thanks to James Earl Jones' dark and\nintimidating voice. The music from John Williams is excellent and gives\nan epic scope to the movie and the pacing moves along quite well. Even\nthe visuals are magnificent.<br><br>Overall, a great follow-up to A New Hope and is always worth watching\njust like that film.\n"},
{"review": "\nIt is not always possible for a sequel to re-capture the peculiar magic\nof an original film. 'The Empire Strikes Back' manages to do so by\nbeing less of a sequel than it is a new film on its own. The story\nbegun in 'Star Wars' is advanced, the characters &amp; their relationships\nwith one another are deepened and the film itself abandons much of the\neasy spirit of the first film in favour of a darker and more uncertain\ntone. If the first film was largely about heroism, the second is\nlargely concerned with struggle. The main characters are soundly tested\nin this film and for the most part, they come up short.<br><br>This is also the film that transforms Darth Vader into one of the\nscreen's great villains. Vader was interesting in 'Star Wars,' but he\nis iconic in 'The Empire Strikes Back' and he rightfully takes his\nplace as not only a great villain, but a great character. In spite of\nthe despair that runs through the film, the visuals and imagination so\napparent in 'Star Wars' returns here, as well. The film is littered\nwith awesome action sequences and more than enough 'coolness' to\nmeasure up to its predecessor.<br><br>Again, the original (1980) version is the one to see - if given the\noption - although the enhancements made to this film are somewhat less\ninvasive than those applied to 'Star Wars.' Still, the film is more\ncharming and more polished its original release. It is considerably\nless delightful than its predecessor, but it is every bit as good of a\nfilm, if not even slightly superior to 'Star Wars.'\n"},
{"review": "\nMost of the time, sequels are a bit of a disappointment, because of\nlame story and poor special effects. The Empire Strikes Back on the\nother hand is one of the best sequels I've ever seen in my life.\nEverything in this film is marvelous. The story is great, and the\ncharacter development is far more dark and gruesome than in the first\nfilm. The new characters, such as Yoda and Lando Calrissian really add\nsomething to the Star Wars saga.<br><br>And what would an Empire Strikes Back review be without mentioning one\nof the most famous lines of all time: No, I am your father.<br><br>Truly a shocker, perhaps one of the greatest move climaxes of all time.\nIn conclusion, The Empire Strikes Back (Episode V: The Empire Strikes\nBack) is outstanding, and meets all the standards that movie sequels\nshould. I never get tired of watching it.\n"},
{"review": "\nI saw this movie in the theater in 1980 multiple times and many times\nsince. It is a great film and tasty \"meat between the sandwich\" sitting\nin between A New Hope and Return of the Jedi. This film has it all from\na battle in the snow with mechanical walking beasts, a trip to a swamp\nplanet to introduce the legendary Jedi master, a beautiful city in the\nclouds that houses the climatic end to the film. This film is darker\nand more menacing than the other 2 films including a more evil Darth\nVader and introductions to the mysterious Bounty Hunters including Boba\nFett. Excellent effects, beautiful locations, top character development\nand Masterful directing. Go rent it out, you wont be disappointed.\n"},
{"review": "\n\nOne of my seven 10s (of my about 200 rated movies) are given to this\nmovie.\nAnd when I first wanted to vote for it, I had just seen it, yet again\nexperienced the class, the acts, the dialogue, the action, the characters,\nthe amazing adventures of Han, Luke and the rest. And let's just say that\nI\nhadn't seen it in years just before I voted. And a 10 sounded so, well,\nunreal, especially when you should actually presume that it's the original\nStar Wars which deserves a 10. If one of the movies should have one. But\nit\nwas this one I found right. I still do. I am sure that this is the\nabsolutely greatest adventure movie of all time. Of all Star Wars movies.\nOf\nthe Indiana Jones movies. And of the Lord Of The Rings movies. Of every\nadventure movie I have seen, this one is the very best. Why, you will\nprobably ask. Most people I know either prefer Star Wars IV or VI to this\none. But I think they forget to take acquintance to the amazing chemistry\nthere is between all the cast in this movie. And the classic scenes, there\nare many more than in the other movies. Luke meeting Yoda, and Yoda's\namazing wisdom for such a small, little green alien. Vader confronts Luke.\nThe truth revealed. Han and Leia's first kiss, and C-3POs interference.\nThe\nintroduction of Lando. Boba Fett. Admiral Piett's absurd rise to great\nImperial stature. The battle of Hoth. Han frozen into carbonite. Just\nabout\neverything of the dialogue, acting, everything of it is so classic, so\nclimatic, so absolutely real. The Empire Strikes Back is the absolutely\nfinest film in the entire Star Wars series. It's so intense, its plot and\nsubplots are perfectly intertwined, just about everything in the film is\nperfectly fit for its genre. This is why this movie deserves a 10.\n\n"},
{"review": "\n\nEmpire Strikes Back is not only a great sequel to one of the best science\nFiction movies ever made but its probably one of the best sequels ever\nmade.\nA movie that not only blows away the first film in terms of scoop and\nmagnitude but in story telling as well. This is the second of the entire\nStar Wars series of movies and in no doubt, the best. Not even the movies\nthat come after were able to capture the landscape of this great cinematic\nachievement.<br><br>Don't dare call yourself a Star Wars fan if you have not seen it.<br><br>\n"},
{"review": "\n\nThis is how sequels should always be done.  Higher budget.  Preplanned story\narc.  And memorable dialogue.  The best sequel ever made hands down.  In\nmany ways this film is even better than its predecessor.  But,\nunfortunately, because it doesn't stand so well on its own, it will always\nbe considered the second best Star Wars movie.\n"},
{"review": "\n\nFor me, The Empire Strikes Back is one of the best films I have seen. It\nis\nthe best of the five Star Wars films, though perhaps that is down to\ndirector Irvin Kershner who tweaked George Lucas's original vision into\nsomething darker than the original and infinitely bleaker than the\nfollow-up\nReturn of the Jedi. Lucas reportedly hated 'Empire' upon seeing what\nKershner had done to his film and put together another cut that he later\nconceded was inferior, and Kershner's vision made it to screens around the\nworld.<br><br>***SPOILERS***<br><br>The Empire Strikes Back serves as an interesting bridge between A New Hope\nand 'Jedi', introducing Force masters Yoda and the Emperor (the latter not\nyet played by the magnificent Ian McDiarmid who took on the role in Return\nof the Jedi three years later), while at the same time taking the original\ngang of characters and splitting them up in different directions, a\nscenario\ncopied to the point of tedium by the Expanded Universe books.<br><br>Based upon the 'classic trilogy', Darth Vader is one of cinema's greatest\nvillains and perhaps it will take until the release of the sixth film in\n2005 to be sure what effect the prequels will have had on that image. In\n'A\nNew Hope' we are introduced to a near-merciless killer  and his evil\nnature\nseems to have grown by the time of 'Empire'. One by one, incompetent\nunderlings make their way to the Super Star Destroyer morgue as the Sith\nLord searches for his prize. It isn't until 'Jedi' that we feel Vader to\nbe\nhuman at all, despite the famous cliffhanger end to this film.<br><br>It's hard to define what this film means to me, other than alot. Hopefully\nthe DVD is not be lightyears away. 10/10\n\n"},
{"review": "\nWhen I first saw The Empire Strikes Back I didn't really care for it. I\nwasn't really into the darkness that covered the movie. Now, I'm a\nlittle older and can appreciate this movie. This is the best Star Wars\nmovie hands down. Not my favorite, but the greatest. <br><br>This takes the Star Wars saga to a whole new level with the\nintroduction of Yoda and the fleshing out of Darth Vader. Every\nreturning character from A New Hope is given so much more to work with\nand it shows. We learn more about Han's past, Luke's past, and Luke's\nfuture. The visual feel of the movie is incredible. From Bespin, the\ncloud city to Dagobah, the lonely hideout for Master Yoda, each one of\nthe locations presented support the turmoiled, chill of space feel that\ndominates the movie.<br><br>The climax of the movie is the most memorable climax of all time. It's\nbeen alluded to more times than can be counted. It also takes the\nbattle between good and evil from a back and white area to a shade of\ngray. The fact that the innocence of Luke can come from the pure evil\nof Darth Vader is perhaps the biggest revelation. <br><br>This is one of the best sequels of all time. Check it out.<br><br>**** out of ****\n"},
{"review": "\n\nWhen The Empire Strikes Back was released for the first time, I didn't\nthink\nit would be as good as the very first Star Wars that was released because\nusually a sequel isn't as good as a prequel. But boy was I ever wrong!!!\nIn\nmy opinion, I think that this is not only the best sequel, but the best\nmovie ever made.<br><br>Everthing about this movie is excellent, from the battle that's taken\nplace\non Hoth, to the climatic battle between Darth Vader and Luke Skwalker,\nwhere\nLuke finds out about his secret destiny.....<br><br>This movie also introduces a new character named Yoda {who is about the\nsize\nof a dachshund when it stands on 2 legs}. If you were to see Star Wars:\nEpisode II: Attack of The Clones, you would find out why people in the\nStar\nWars universe call him \"master\". I like the way he sounds like say fozzie\nbear from the muppet babies and his backwards spelling like, \"Powerful\njedi,\nwas he.\"<br><br>As I said with another review about \"Return Of The Jedi\", I owe it all to\nGeorge Lucas. Without him, Star Wars wouldn't have been created. Thanks\nGeorge Lucas!\n"},
{"review": "\nWhat can I say about The Empire Strikes Back that hasn't already been\nsaid? That's a genuine question. Star Wars V is one of the best movies\nto ever be made in cinema history, and I'm not just saying that as a\nStar Wars fan. It has action sequences you feel when you see it for the\nfirst time or if you haven't seen it in a long time. And it has one of\nthe most quoted movie lines ever, \"No, I am your father.\" Another good\nthing is that out of the original trilogy episode V has the least\nspecial edition changes so you can experience the original movie with\njust a few changes. Overall if you haven't seen this movie in a while\nthen you should blow the dust off your VHS player and watch some good\nold Star Wars.\n"},
{"review": "\nThe best film out of the saga. A great twists and turns and an epic\ncliff hanger ending! Wont go into detail but the fight scene between\nLuke and Darth Vader was the biggest shock a young 7 year old me had in\nmy experience in going to the cinema! The character development too is\ngreat! It shows how mature the young characters have become since their\nlast run-in with the Empire in Episode IV. Some say the special effects\nare dated, to me they are way better than the prequel trilogy! Whilst\nthe prequel trilogy looks like a cartoon, the special effects and model\nshorts in Episodes IV, V &amp; VI look and feels more realistic and\nconvincing on the eyes. 10/10 Death Stars for this one!\n"},
{"review": "\nIn cinema, there are two categories: movies and films. Movies are the\nmainstream and average ones, such as The Avengers, The Hunger Games,\nand Transformers. Films are ones that transcend and push the envelope,\nin how movies should be made, such as 2001: A Space Odyssey, The\nGodfather, and Pulp Fiction. The Empire Strikes Back is a FILM. This is\na film that pushes the limits in how a sequel should be made and sets\nthe bar for movie sequels to come. This improves everything about Star\nWars, such as the story and cast. The story here puts our heroes at\ntheir lowest point. Our heroes are divided and are separated throughout\nmost of the film. Luke Skywalker and R2-D2 are training with Jedi\nMaster Yoda, while Han Solo, Princess Leia, and C-3PO are relentless\npursued across the galaxy by Darth Vadar. The tone during the whole\nfilm is bleak and depressing. You feel bad for the characters for going\nthrough all the bad crap in the film. The cast here get more fleshed\nout. Luke, who was a farmer boy in the last movie, matures, Han Solo\nand Princess Leia develop romantic feelings for one another, and Darth\nVadar becomes more evil and cruel in his actions.The only bad thing\nabout this movie is the Special Edition. Luckily, out of all the movies\nin the original trilogy, this one has the least changes in it. This is\na perfect film and it's almost flawless. This is cinema's greatest\nachievements and continues to be so.\n"},
{"review": "\nThis film is for SciFi fans. The film is for everyone 7 and older who\nlove SciFi. The film has plenty of action to keep you in your seats.\nLuke Skywalker undergoes both Jedi training and we see his character\ndevelop from the rash young man he was in Star Wars IV. We also begin\nto see a hint into Darth Vader. I fell in love with Yoda in this movie.\nAll the main characters from Star Wars IV are here. However, it is Luke\nand Yoda who steal the show. However, the movie did make me feel like I\nwas between episodes and want more. I also felt that it really didn't\nhave a true ending, just a closing of a chapter. However, it is very\nenjoyable and keeps the Star Wars saga going. Not only do I want more,\na continuing story; but I want a beginning. Little did I know that all\nI had to do was wait a few years. If your are a Star Wars fan, be sure\nto include this one in your collection.\n"},
{"review": "\nThe Empire Strikes Back is an example of how well done a sequel can be,\nit takes the series to a whole new level and is an improvement over A\nNew Hope. The amazing thing is that this time Lucas wasn't the\ndirector. That doesn't change anything, he guided Irvin and ESB is\nstill his creation. <br><br>This time everything is on a larger scale. The battles aren't puny and\nmeaningless, they are actual battles. The movie starts with the battle\nfor the icy world Hoth. From there the plot splits in 2, one being with\nLuke and one with the rest: Leia, Han, Chewie, 3PO and R2.<br><br>We are explained in more detail how the Force works and we see how\ntruly powerful the Empire is. Thanks to the money Lucas earned from A\nNew Hope, The Empire Strikes Back has better special effects and some\nsplendid locations, including Hoth and Bespin.<br><br>But it's not all about battles, the love story part of the series is\nalso developed, Luke's struggle to understand the Force and use it\ncontinues, while Vader is more determined than ever.<br><br>Star Wars: The Empire Strikes Back is a remarkable chapter of the Star\nWars saga.<br><br>Final Score: 5/5 or 10/10\n"},
{"review": "\nI'm not sure which part I liked more - this one or the original. But\nthis part sure is better in some terms. Like special effects, which\nwere really better than in the first part (probobly because of the\nbigger budged). It's also better in terms of action. The sword fights\nwere much more impressive than in first part. The starship battles were\nalso very impressive and pretty realistic. Many new colorful and very\nimportant characters appeared in this part. What else did I liked was\nDarth Vader's position in this part. Here he looked more dangerous and\nindependent than in the first part. It's a really entertaining movie\nand it's worth watching.\n"},
{"review": "\nSTAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning\n** Sunday Night * Monday Morning <br><br>After George Lucas's Star Wars had wowed the world in 1977, the same\nworld eagerly waited the big sequel that followed three years later,\nthat was loved just as much, in some cases slightly more so, than the\nfirst film. It no doubt took twice as much effort to make, and drew in\na huger box office crowd, and in doing so The Empire Strikes Back\nestablished itself as the film that rivalled the film it followed on\nfrom.<br><br>All the main characters from the first film are back, including Luke\nSkywalker (Mark Hamill), Han Solo (Harrison Ford), Princess Leia\n(Carrie Fisher), Obi-Wan Kenobi (Alec Guiness) and lovable non humans\nChewbacca, R2-D2 and C-3PO, along with new addition Lando (a\ncharismatic turn by Billy Dee Williams) a rogue pal of Han's who's now\nthe head of his own establishment, as well of course as Yoda, the tiny\ngreen martian with wisdom who guides Luke on his way. The story's a bit\ntoo lost in names of special planets, spaceships and character names\nthat only the most ardent sci-fi nerd is going to follow intently, but\nonce again, the sheer spectacle and grandeur of Lucas's work\nover-shadows everything, a remarkable vision that still hasn't dated or\nstaled over 25 years on.<br><br>So sit back, relax and prepare to witness the sheer scale of escapist\nentertainment. *****\n"},
{"review": "\nStar Wars and the Empire Strikes Back is the best of the Star Wars\nmovies in my opinion. At the end when Boba Fett was with Darth Vader in\nthat little freezing chamber he was just standing there like a bad ass\nin case anything went down. when Darth Vader was fighting Luke and did\nhis little shpeel at the end of the fight it gave my chills. These\nmovies were cutting edge of the time that they came out. The way they\nmade the lightsabers had never been thought of before. the space laser\nguns and the damage they did to walls and armor of the storm troopers\nwas perfect that is what i think of when i see that and same for the\nlightsabers for that matter. The way they can slice through anything is\ngreat\n"},
{"review": "\nIt is my best film ever, it tops of course the the two first Madonna\nmovies (Seeking Susan and Who is that girl in 1985/1987). Where to\nbegin, the actors play well, they are charismatic, they assume what\nthey are doing. It is a mixture of drama,love, passion, adventure and\nDarth Vador. He is the main antagonist of this episode of Star wars.\nThe empire strikes back is a good title for this movie, as the rebels\nare in deep trouble. Luke is training to become a Jedi. I can spoil\nonly one thing, that there is going to so much emotion in Bespin City\n(the cloud city). There is a two minute scenes which captures really\nwell the spirit of the movie. So I would give it a rate of twenty out\nof ten. Eventough it is not possible.\n"},
{"review": "\nThe second movie in the series.<br><br>I fine film however I always liked the first 1977 flick the most.<br><br>In my childhood I never liked Yoda as he always seemed to be exactly\nwhat he is: a muppet who can't stop talking! And the romance between\nthe main characters sometimes seemed corny.<br><br>But all the space battles are outstanding, all the stuff with Darth\nVader is a knockout and John Williams does some of his best motion\npicture music ever!<br><br>A must-see movie, however the next film, Return Of The Jedi, is very\nhit and miss.\n"},
{"review": "\nI'm continuing to watch all the Star Wars movies in preparation for\n\"The Force Awakens\". I've made it up to \"Episode V: The Empire Strikes\nBack\". <br><br>This is the one that I always think I'm going to love, and then don't.\nMaybe that's because I think things are going to happen in it that\nactually evidently happen in \"Return of the Jedi\" (Palpatine makes no\nappearance in \"Empire\", despite his being...the Emperor). Maybe it's\nbecause I find Yoda to be less endearing in this movie than I did when\nI was five years old. Who knows.<br><br>Whatever the case, I'm giving \"Empire\" 7/10 stars. Yes, it does\ncontinue on the story of \"A New Hope\" relatively seamlessly. Yes, the\ncharacters are iconic, and yes it is a fun movie overall. Yes, Luke and\nVader have a memorable showdown with a memorable line. But it just\nwasn't as enjoyable for me as \"A New Hope\". The story seemed to bend\nand sway a bit (Luke's visit to Dagobah, for example. The dream\nsequence encounter with Vader also is a little weak).<br><br>A long story short, I like this movie, but not enough to give it an 8\nor above. Good movie. Fun. But not one of my faves.\n"},
{"review": "\nIn 1980 I was 8 years old... I still have vague memories of standing\noutside the movie theater waiting to get in to the (then) new film. I\nwas so excited I could hardly stand still. Once inside the theater I\nsaw what was to become my favorite movie in the Star Wars Saga! <br><br>The plot thickens in this sci-fi saga as we learn more about the young\nLuke Skywalker and the vile Darth Vader as well a budding romance\nbetween Leia Organa and Han Solo. The movie also revels a little more\nabout Han Solo's past with the introduction of new characters Lando\nCalrissian, Lobot and the Bounty Hunters (in particular Boba Fett). We\nare also introduced to the wise Jedi master Yoda.<br><br>I will not say more due to the fact I do not want to spoil the film for\nany first time viewers. All I can say it find a copy, watch and enjoy\none of the most exciting and historical science fiction films ever\nmade.<br><br>10/10\n"},
{"review": "\nBack in 1977 I really enjoyed the first film in the franchise, but the\nhype was so enormous when this came out I decided to avoid it for a\nbit. I finally caught up with it in 1997 by which time Time had sadly\ncaught up with it too and wreaked its usual damage. Then it was a case\nof Roll Over Harryhausen, tell Jim Henson the news.<br><br>Story has imaginative intergalactic politics and battles amidst a\nplethora of gormless soap and stereotypes. To a kid it would be\nmarvellous stuff to watch and as an adult to revel in through\nrose-tinted glasses, but coming at it as an adult I see it through the\nEmpire's, sorry, Emperor's New Clothes and in the Altogether. It's\nrelentlessly inventive but not in my top 1000 films of all time.\nFavourite bits: Luke yakking to Kermit about the Force; the flying city\nwhere expense or common sense is no object; the love affair between the\nPrincess and the Scoundrel; the remarkably obvious pay-off, hyped at\nthe time as something groundbreaking.<br><br>The first cut is nearly always the deepest - long live the brash first\nfilm, this sequel is entertaining and nonsensical, an eminent\ntime-passer. The first was a monument to Luck, the second a monument to\nHype; I love fantasy movies of all eras and genres but mainly those not\nsurrounded by heaps of hype swallowed by millions of people, it's a\nreal barrier to my complete enjoyment of anything. This is a watchable\nmovie but only a must-watch movie to see for what digital cgi\ncartoonery has done to the movies, and to us. Modern cgi is usually\ncold and soulless but usually not jerky and laughable, cgi has spoilt\nus all and there's no going back. However, now to watch Jason &amp; The\nArgonauts and curse Roger Rabbit.\n"},
{"review": "\nNow I must say there are other films that come close but the Empire\nStrikes Back is my favourite and the best movie I have ever seen. This\nfilm has everything a sequel should do the same fantastic performances\nas the first, the stakes raised and also added struggles and\nrevelations for the characters. The 2nd film in the star wars franchise\nkicks off a few months after the original with the Empire and Darth\nVader tracking the rebels and eventually finding them from there Luke\ngoes to Dagobah to learn from Jedi master Yoda while Han, Leia,\nChewbacca and C-3PO attempt to avoid the empire. This film takes the\nbold move of splitting the characters up to two stories providing more\nsubstance to this film than the previous film even though that is great\ntoo. This film is truly when Darth Vader comes into the forefront he is\nnow in full charge of the imperial forces and is awesome and evil at\nthe same time. This film has exciting action, heartfelt moments and one\nheck of a tense climax with possibly the biggest revelation in film\nindustry. If you haven't seen the original you will be lost at the\nbeginning but what are you doing if you haven't seen the original star\nwars. Go watch them now!\n"},
{"review": "\nThis movie was a true film making classic. Any story that can take\nplace in 3 unique environments and space while telling thee classic\ngood versus evil (with a twist Vader as the dad)is worthy of a movie\nthis good. It is a reminder on an era of movie making when film makers\ntook a risk with using more elaborate special effects in their shots.\nThis movie started a flood of great 80's films that allowed you to get\nlost in a new world of far away people. Empire Strikes Back stands out\nas the best of the stories in the original trilogy as there is simply\nmore story and more characters involved. This movie is a great family\nas well and is a great way to spend a family night in.\n"},
{"review": "\nI was 13 years old, 3 years have passed since Episode IV The New Hope.\nAfter initial scare, I have recovered. I was explained that it is all\nmake belief, and Darth Vader was not going to come and eat me for\nbreakfast. I started expecting Episode V with great eagerness. What was\nit all going to be about? In our little Star Wars club in Sarajevo we\nobtained information that Episodes I, II and III will be made in a long\ndistance future, and we obtained some short synopsis of what they were\nall going to be.<br><br>After Episode V finally came out, we came to the cinema Dubrovnik and\nmade a party while watching it. It was my first great teen excitement.\nAfter watching the film we talked at length about all of it and what we\nliked and did not like. I told my gang that I was sorry that the Empire\ndid not catch all of the rebels and did away with them. Everybody\nlooked at me with amazement. Why was I for the Dark Side? I do not\nknow, they were just so sexy! So dark and total. To remind you we still\nlived in the what-was-left of Tito*s Yugoslavia and we had totalitarian\nminds. I wanted it to be all livada (use google translator)! Peace in\nthe galaxy, for ever! Others were for the rebels, they were after all\ngood kids of Tito*s partisans, antifascists! Later I went with them. I\nsaw the light, rebels were the good guys, I guess.<br><br>All in all as the good clone army we went the next day and watched the\nmovie again. And again. And again. Numerous more times.<br><br>That how it was long, long time ago in a galaxy far, far away...\n"},
{"review": "\nThe Empire Strikes Back is one of the all time classic movies that\neveryone should see.<br><br>Obviously you must watch the Star Wars Trilogy (and I am of course\nreferring to the original Star Wars Trilogy since we are talking about\nEpisode V: The Empire Strikes Back right here) in order to fully\nappreciate how great the movies are and to understand that story that\nis going in on this movie, which is the second installment of the\nfranchise. (It was called Episode V to indicate that there would be a\nprequel trilogy, with the original Star Wars later re-released as\n\"Episode IV\" of the series.)<br><br>I was not a big fan of the prequel trilogy but the original movies all\nstack up nicely even to this day. Though dated the effects are still\nnice and the original releases have awesome models and puppetry that\nfrankly are better than the CGI employed in the various re-issues.\nCheck it out!\n"},
{"review": "\nThis is it my favorite movie of all time, now I'm not saying it's the\nbest, because that honor belongs to The Godfather, this is more my\nopinion than anything else. So why do I like it so much, well nostalgia\nis a key factor, I was 8 when this came out, and it was even better\nthan the first one, the stakes were higher, it was darker, and it had\none of the greatest twists ever (beaten only by The Usual Suspects, and\nThe Sixth Sense). It was just great, like the first one, while adding\ngreat new things to the tables. It is my favorite movie of all time,\nand it is without a doubt a timeless classic.<br><br>it is a 10/10.\n"},
{"review": "\nThis is my favorite out of the original Star Wars movies, and for good\nreason. There's action, there's drama, and there's Yoda (because who\ndoesn't love the little green guy?). Not to mention the fact that\nHarrison Ford is in it, and he's a brilliant actor. Mark Hamill does a\ngreat job playing Luke Skywalker, and Carrie Fischer is a convincing\nLeia as well. I'm personally not a fan of Lando, but he's not terrible.\nThe special effects aren't perfect, but it IS an older movie, so it's\nforgivable. Lightsabers: I really wish they were real. Also, it\nshouldn't be a surprise to know, but the stormtroopers still can't hit\nanything. I love all six of the movies, but this one is truly\nspectacular.\n"},
{"review": "\nYou've gotta admire George Lucas' moxie. It was bold enough that he\nsought out to self-finance \"The Empire Strikes Back\", but the movie has\nto be a downer on top of it. Make matters worse, he ends on one\nhumdinger of a cliffhanger that people had to wait 3 years for\nresolution. That's sheer balls. <br><br>But what a terrific movie it is. For one, it surpasses the original,\nwhich is rare in the sequel department. But it also takes its time to\nlet the story unfold, characters get fleshed out, and the whole thing's\na stirring mix of humor, drama and action. <br><br>Yoda's scenes are some of my favorite of the trilogy. Frank Oz was able\nto lend that puppet such a personality that it simply becomes a wizened\nold Jedi master and not a special effect. <br><br>And Darth Vader's presence in this movie makes him one of the all0time\ngreat movie villains. He's unhinged, choking out underlings left and\nright, and pursuing Luke with reckless abandon. Badass seems kind of\ntrite, but it fits here. <br><br>\"The Empires Strikes Back\" is a movie that just fires on every last\ncylinder. Great dialogue, suspense, set pieces and production values.\nFor my money, it's John Williams' finest score, and the movie continues\nto be one of my absolute favorites (not to mention the best of the\ntrilogy). <br><br>10/10\n"},
{"review": "\nEmpire Strikes Back is said to be the best Star Wars film and many\nwould be correct. For me it isn't but it doesn't mean I don't love it.\nThis film starts off in Planet Hoth, the Ice planet where I wish I\ncould live. This film I think I have only seen twice, and both times I\nseemingly enjoyed it. For a film made in 1980, a not so famous year\nthis film is Excellent. Many fans of A New Hope came to see this and\nwere stunned greatly. The sheer greatness of this film is nothing any\nother film can compete with. Though this isn't about greatness, its\nabout placing out how good it really is. I'd rate it a 8.3 probably\nbecause 8.8 is a little too much. Attack of the Clones is better for\nme, and I know you readers might not like that but hey! We all gotta\nhave an opinion.\n"},
{"review": "\nThe fifth installment to one of the greatest film franchises on the\nplanet. Not only just an all around great movie but home to one of the\ngreatest moments in film history when Darth Vader, after battling Luke,\ninforms him that he is his father. The film has many classic moments\npeople know by heart some who haven't even seen the full saga. It's\namazing how certain moments are known by people worldwide without even\nseeing the full movie. Just another look at George Lucas's brilliance\nin film making. Although he is no longer in the making of the next few\nfilms set to come out over the next few years, after seeing the great\nremakes of star trek i'm confident J.J. Abrams will do a good job in\nkeeping not only the classic feeling there but also adding more to an\nalready fantastic franchise.\n"},
{"review": "\nI think this movie is the best Star Wars movie ever.The story of the\nmovie and character selection is very good.The effects of the movie is\ngood for this years.There are some errors in the film, but they can be\nignored.<br><br>The musics in the movie is great.I think Imperial March is the best\nmovie music.It reflects dark side very well.Also I love the sound of\nlight-saber.<br><br>Need to be tied to violate the laws of physics in order to facilitate\nexpression. Because the planet of the Star Wars like The Arabian Nights\ntale. Lucas doesn't conform to the realities of his own creation\nuniverse, but it is sinking me this moments.<br><br>You absolutely watch this film.\n"},
{"review": "\nThe best Star wars movie ever! Great story, Great acting and Great\naction. Even the music in this film was amazing. Usually when a great\nfilm comes out the sequel sucks. Not in this case. The Empire Strikes\nBack did not follow the crappy sequel line. The reason it might be so\ngood is because George Lucas did not direct it. The only problem I have\nis the ending. Why is Lando Wearing Hans clothes? does Han have a\ncloset full of the same clothes that fit Lando? who knows... The Empire\nStrikes back is a film that you can watch over and over and never get\nbored. I have seen this film over 100 times and I still love watching\nit.\n"},
{"review": "\nThis brilliant film wastes no time telling it's elaborate story. I was\n9 years young when my father took me to see this in the theater. Back\nthen you had to stand in line to see the soonest showing because it\nonly showed once at a time, but boy was it ever worth it. What can\npossibly be said about this movie that hasn't already been said? How\nmany other movies can you think of where the sequel is just as good, if\nnot better, than the first? I can think of only three; The Godfather\nPart II, Terminator 2 and Superman 2. It's hard to believe that this\nfilm wasn't even nominated, considering The Return Of The King was not\nonly nominated but won best picture; different times I guess. At the\ntime there were a few scenes that shocked me; Han's freezing and the\nlook of him, Luke losing half his arm and right after that learning\nthat Vader is his father. Wow! I recall the scene where Luke goes into\nthat tunnel and light sabers Vader's head off to reveal his own face,\nscaring the crap out of me. Another thing that was big back then was\nthe merchandising. Lucas got a ton of money from my parents because of\nthis franchise. I had everything that ever came out from trading cards,\naction figures to even bed sheets. God I wish I had it all still and in\nit's original packaging. And having just watched this, probably for the\n2nd dozenth time, I can tell you that it still holds the test of time.\nSo watch it again, preferably the original version in surround sound at\na good loud level for the 2 hours and 4 minutes of it's running time\nand enjoy and American sci-fi classic.\n"},
{"review": "\nYes! That is it! It was my first VHS movie since 1990''s, I can\nremember that very well! What can I say? It's nothing! It's\nsuper-action science- fiction film for that year and still popular\nthrough many fans and collectors! George Lucas started his saga so many\nyears ago...., but the time is infinite for him! He creates something\ncreative, something brilliant, something wonderful, that I cant explain\nin full words! The saga will be sound again, again and again in our\nears, in our hearts and in our mind forever! I just would like to say\none important thing! To wish THE BEST REGARDS from us to this\n\"favourite master\" of his own \"genre\"!!!!! The SAGA will be with us\nAlways!\n"},
{"review": "\nI, like so many others of my generation, grew up with this movie. I\nremember watching it on a scruffy VHS and being in awe the whole time.\nThere are so many magical moments - how Luke escapes from the lair of\nthe hairy beast, how Han realizes he flew inside a space monster's maw,\nhow Darth Vader suffocates the admirals who keep failing him, how Yoda\nraises the X-Wing from the bog, how Han is frozen in carbonite, and of\ncourse the ending's Big Reveal of cinema history.<br><br>Though I love all the old Star Wars movies, this one really takes the\ncake. It has a perfect balance of whimsical adventure and darker\nmoments (battles, betrayals, even torture). The dialog is really\niconic, featuring the famous Yoda-speech and the quips between Han and\nLeia.<br><br>The remastered edition is absolutely gorgeous. The film is colorful and\nsharp and the special effects look fine, never really distracting you\nfrom the experience. I wish they used more of these practical effects\n(models, animatronics, costumes) nowadays.\n"},
{"review": "\nIt was an incredible movie and probably one of the best in the series.\nI would not mind seeing it again, Star Wars Episode V was one of the\nmost ingenious movies I have ever seen. I can't wait to see any future\nones. George Lucas is a real genius of Sci Fi movies. I wonder what\nmight be in store for the future. We will just need to see. Also Chewie\nis really funny and this is a great film. I wonder what new threat will\narise. Star wars Forever Amen. I also wonder what new planets our\nheroes will visit. I bet the droids will be even funnier. Disney will\nhopefully make Star Wars even better. Also I think Princess Leia will\nbe even more beautiful in the future movies.\n"},
{"review": "\nThe movie is completely an excellent work of art.I love this movie as\nit has a very close place in my heart.No,I have not seen this movie a\nhundred times just like the person next door,I have only seen this\nbrilliant masterpiece a merely 3 times,I was not born n the 90s and\ndefinitely did not see it when it was first launched as I was born in\n2001.It has only been a half a year since I saw this movie and I was\njust so sad on the fact that I was not born earlier.<br><br>Although the storyline may seem a little bit not as good as the earlier\none (Ep.4 A New Hope) but it lived up to its hype,and then some(believe\nme,that some is a lot.).Extremely brilliant,The Imperial March is my\ncellphone's ring-tone now,although it gets a little weird\nsometimes.Frank Oz as Yoda is amazing.The entire cast is brilliant,this\nis my favorite movie of the entire franchise.<br><br>Now All we can do is re-watch these movies and just wait for the next\nsequel trilogy (containing ep.7,8 and 9.)and see how Star Wars results\nwhen it is put under direction by Disney and passed on to the next\ngeneration(which is supposed to be mine ?) under J.J Abrams. May the\nForce be with you!\n"},
{"review": "\nThis by far is my favorite movie of all time. Of Course I saw the\noriginal Star Wars when it first came out in theaters in 1977 which\nblew my mind and took me on the adventure of a lifetime. But Empire is\nthe best of the three original films. It's ability to connect the\ncharacters in a more personal way and to reveal how deeply each\ncharacter affects the progression of the story.<br><br>Each scene and sequence moves the viewer closer and closer to a pivotal\npoint where the characters are also paired as an influential unit\nrelevant to a particular plot. Darth Vader and Luke Skywalker, Princess\nLea and Han Solo, which interconnect with the other pairs Han Solo/Luke\nSkywalker and Vader/Lea. The flow of dialog from these characters help\ncreate a malleable cohesion as to help support the type of character in\nwhich they each portray; hero, villain, damsel in distress and rouge\nsmuggler.<br><br>Besides all that this space and time adventure brought the audience\ninto the story and helped create a new mythical journey. I have since\nwatched this movie hundreds of times over the years, will always be the\none movie that influence my imagination and will continue to watch it\neven more.\n"},
{"review": "\nThis movie was awesome! <br><br>I loved the characters (Vader was my favourite).<br><br>I loved the story (Including the plot twist with Darth Vader the father\nof Luke Skywalker).<br><br>And I loved the visuals (For a 1980 movie, the effects are brilliant).<br><br>And it's kinda funny this movie wasn't directed by George Lucas\n(Instead it's directed by Irvin Kershner while George was the executive\nproducer).<br><br>My favourite scene in this movie would have to be The Battle of Hoth\nbecause the soundtrack, visuals and acting were all spot on.<br><br>Speaking of the soundtrack, John Williams must've had a wonderful time\ncreating the pieces of music in this film.<br><br>I would highly recommend you see this movie (Either on TV or a DVD),\nyou'll have a wonderful time.\n"},
{"review": "\nEpisode V is the finest entry of the first two trilogies, since it is\nthe best written(really strong dialogue, situations, and realistic\nevolution of the returning characters) phenomenal direction by Irvin\nKirshner(exciting and breathless, always something going on of\ninterest) and equally spectacular F/X, which still hold up(did not need\nmuch tweaking for the Special Editions) Story has the Empire striking\nback(of course!) against the rebellion(despite the loss of the Death\nStar) and our heroes' attempts to survive and enact their next plan of\nattack, only to become captured by an unwitting betrayal of old friend\nLando(Billy Dee Williams, quite smooth but appealing). Climactic battle\nbetween Luke and Darth Vader is legendary, and breathtaking.\nCliffhanger ending sets up the next chapter nicely.<br><br>A classic.\n"},
{"review": "\nI remember going to the movie theater to watch the premiere of Star\nWars... This experience totally blew my mind!!! I had never experienced\nanything quite as powerful before. I felt like similar adventures may\nactually be happening in other galaxies, far, far away and we think we\nare alone on our little planet... I obviously ran to the theater one\nmore time as soon as The Empire Strikes Back hit the silver screen.\nThen that was it. From the first images, I was like in command of a\nSnowspeeder! This visuals were simply mesmerizing, should I say\nStriking! From this day, I knew I wanted to be part of something like\nthat... one day. I am not there yet, but I am now a CG artist, working\nvery hard at perfecting my art, looking at every detail that can make\neach of my model more realistic, more believable. I am also writing and\nproducing a sci-fi movie: Apostone 'resurrection'. A mix of CG\nanimation and acting. I am realizing my dream since I met Star Wars the\nsandman.\n"},
{"review": "\nThis movie is so amazing for so many reasons but the one thing I have\nto say is the greatest is that the bad guys are winning the entire\ntime. Lucas had to capture his audience in the first film and no one\nlikes a film where the bad guys wins. However once he had established\nthe rebellion and set up the characters he was free to do some good guy\nbashing.<br><br>You know who the good guys and bad guys are, you know how these types\nof stories typically end (with the good guys winning) so you know that\nno matter what happens in the middle movie, it has to end well. With\nthat in mind, why not make the rebels lose, cut off Luke's hand, and\nfreeze Han in carbonite. It keeps the watching at the edge of his seat\nwanting to know whats going to happen.\n"},
{"review": "\nWell I have to say that I am a fan of the old and classic movies of the\ncinema and not the new ones. Star Wars is not just a movie, is the\nbeginning of a new era, it's the beginning and the peak of movies with\nspace and its defense.<br><br>When I saw the \"Star Wars: Episode V - The Empire Strikes Back\" I was\nreally amazed not because of the graphics of this movie but because\nthat was something different, something that it's a landmark of the\ncinema and for all the people.<br><br>It's a movie with which comes the end of this trilogy. With this movie\ncomes the end of the adventures, the agony and the expectation of what\nit's going to happen. <br><br>In this movie everything ends with only one winner and who is going to\nbe? Luke Skywalker or the Dark Lord? If you want to now the end of this\nmovie you have to see it...\n"}
]