[
{"review": "\nAn effective thriller with a good twist in the ending. Not since The\nSixth Sense has a movie given me such a surprise at its ending. Liam\nNieson keeps your attention fixed on the action throughout the movie,\nalthough some of his lines did not match the scenes or his character.\nIf someone is trying to kill you, maybe some emotion would be shown.\nThe car accident at the beginning is very realistic and makes Liams\namnesia credible. The car chase scenes in the movie will also keep the\naction buffs happy, although the black car driven by the assassin is a\nbit too corny to believe . Bruno Ganz as an aging former Stasi agent\ngives a stand-out performance and Diane Kruger supports Nieson without\nthe usual Hollywood theme of girl following for hero. Maybe its because\nNieson is old enough to be her father. This film is no masterpiece but\nif your looking for a couple of hours entertainment with an interesting\nending this will fit the bill.\n"},
{"review": "\nIt's one thing to be told not to think too hard about what you're about\nto see, it's another to be helped enormously in that task by a skilled\ndirector employing equally skilled actors. All the principals here are\nin top notch form and, though I enjoy trying to measure how much\nlicense was taken by a screenplay, this film never once made me feel\ncheated or resentful.<br><br>Is it a brilliant film? Probably not, but it's devilishly entertaining.\nThe action scenes here are matched by the quiet drama scenes and that's\nunusual. I don't really think either sex can really claim it entirely.<br><br>The director's done a very good job of creating the right mood and\ntelling the story in such a way that the actors can do their work,\nunimpeded by unrealistic run ups to their scenes. This movie made me\nfeel as if I've just visited Berlin much more effectively than any\nother European based movie I can think of and that alone is worth the\nprice of admission.\n"},
{"review": "\nThe movie sounds intriguing since from the beginning and keeps its\nsense of mystery and intrigue till the end: this is a good quality,\nonce reminding Hitchcock's thrillers, with the difference that in\n\"Unknown\" the thrilling aspect cannot be separated from the frenzy\ntypical of action movies. The result is an entertaining, involving pic,\nnever losing its strong and quick rhythm and letting the viewer staying\nattached to the screen till the end. Set in a depressing Berlin covered\nby snow, always marked by the sad signs of a more or less distant past,\na good photography gets to capture the overall gloomy atmosphere of the\nstory and the mystery of a character whose vicissitudes seem as much\nincomprehensible as much needing some resolution, and an effective\nfinal twist as well. Liam Neeson plays skillfully, although not always\nsufficiently expressive, he gets to convey the sense of void of someone\nlooking for some identity. A stand-out performance is offered by Bruno\nGanz and also Diane Kruger supports Neeson quite well. Certainly not a\nmasterpiece, but worth the ticket.\n"},
{"review": "\nGood movie. The plot seemed similar to Arnold Schwarzenegger's 1990\nscience - fiction action movie, Total Recall. If you were to change\nsci-fi action thriller to foreign intrigued mystery action thriller,\nchange locations, Mars to Berlin, change Ronny Cox to Frank Langella,\nchange free oxygen for all on Mars to lower cost corn development on\nEarth and change revolutionary hero, Quato to revolutionary scientist,\nDr. Bessler. Total Recall was made nearly 20 years ago, many people may\nnever have seen it or forgot about it. Retelling a story in Hollywood\nis nothing new in order to gain a contemporary audience. Maybe I'm\nwrong about the similarities, yet on it's own, Unknown is a very good\naction movie thriller and Liam Neeson has successfully step into action\nadventure characters with vengeance.\n"},
{"review": "\nUnknown is good, but not great. It's worth a go at the theatre, but if\nyou're expecting Taken, prepare for disappointment.<br><br>Liam Neeson is on top, giving a spotless performance. He is becoming\nmore iconic and, therefore, his characters are starting to look the\nsame. Not a bad thing if you're an actor (because you'll get more work\nand more money), but it can get tiresome for the audience. Fortunately,\nI'm not one of them. I enjoy Neeson in just about everything I see him\nin. Good for me and good for him as I'm sure the majority of\nmovie-goers would agree.<br><br>Unknown is all three Bourne movies tied up in one. It's great for those\nthat don't have the patience for a long wrap-up. There is a lot of\ndetective work and very little action; however, when there is action,\nit is good, including a hair-raising car chase. The ending is weak, but\nhey, it's Hollywood. When was the last time you saw a great ending?\nUnknown is worth 8-9 bucks. Just be glad there isn't a 3D version for\nyou to pay $15 for.\n"},
{"review": "\nAnyone who has watched Liam Neeson's movies have grown accustom to a\ncharacter that is always thrown into absurd situations but can still\nsomehow use wit, power and skills to get himself out. Unknown offers\nthe same formula but it still works. This movie caught my attention\nfrom the get go. I enjoy how Liam is believable in these roles and you\nforget that he's getting up there in age, if anything, he makes it seem\nlike this is what any man his age is capable of. He is awaken from a\ncoma to discover that his identity has been taken by someone else.\nWorst yet, his wife doesn't seem to recognize him. With the help of the\nwoman that saved his life, in a country that is not his home, Liam\nseeks about to prove himself. This movie is action packed and keeps you\non the edge while you try to figure out what is going on. And I feel\nthe ending does not disappoint. Enjoyable, entertaining, action packed\nand thrilling!\n"},
{"review": "\nOne of the most embarrassing, painful and boring movies within the last\ndecade. Zero suspense. Awful script. Talking heads with dialogue making\nno sense at all (Gretchen: He's finding people). It starts with the\nquestion: how can a super-killer-agent be stupid enough to forget his\nsuitcase at the airport? and it ends with the question: how can a\ndirector and his producers be brainless enough to expect that people\nhaven't seen Total Recall and Bourne Identity to make this movie as\npredictable as a Mickey-Mouse-comic. Don't believe whatever good\nreviews you might have read. You'll want your money back after having\nwasted the first ten minutes with this terrible mistake.\n"},
{"review": "\nI wanted to love this film, as I'm a big fan of Liam Neeson.<br><br>This was a pretty good movie. It was overall enjoyable to watch, and it\nhad good twists to the story. It was action packed, and as such Neeson\ndelivers. January Jones is, unfortunately, a terribly cold actress and\nis the same character as all of her other films. I do like Diane Kruger\nthough, and she was fairly charming in this.<br><br>I enjoyed watching it. It's a good weekend, sit-down-and-enjoy thrill\nmovie, as one would expect from its description. It is by no means a\nmovie I'd recommend for its artistic merit, but it definitely delivers\nin the traditional thrill-seeker movie. The plot is pretty good as\nwell, and well executed.\n"},
{"review": "\nThis movie would have felt more original before Jason Bourne hit the\nscreen, but we already have one black-op operative with amnesia out\nthere. I truly wonder if anyone mentioned the similarities when this\nbeing proposed. Granted, there is a good plot twist when he is told who\nand what he is, but smart people would have noticed something wrong\nwhen he drives like a professional, and fights as if he'd been trained\nto. Just like Bourne. I did not find very many original concepts in\nthis movie, and once I make the comparison to JB (sorry, I mean Bourne,\nnot James Bond or Jack Bauer ... JB is just a good set of initials for\nthis sort of thing I guess!) - I kept thinking that there was more\ningenuity in the Bourne movies, and a lot more investment in character\ndevelopment. This movie is watchable. ... Barely. And I have no desire\nto watch it again.\n"},
{"review": "\nAs far as the movie goes, it was OK, we have Diane Kruger with a\nRussian accent, we have Liam Neeson being Liam Neeson. But this idea\nhas been done before way better. Anyone remember 'Total Recall'? This\nmovie was like that, but lamer. I gave this movie such a poor rating\nbecause by the half of it I knew, as well as my boyfriend, what was\ngoing to happen. So, if the plot doesn't hold any surprises, plus it\nrecycles an old idea hopping that no one will remember and the action\nscenes are pretty weak(not to mention few, all involving taxis), then I\nsay it is not worth watching...at the cinema anyway. And I also have a\nproblem with the unnecessary killing of bystanders, which most of the\ntimes simply doesn't make sense(the bed guys kill anyone they meet but\nsomehow they hesitate when it comes to Diane Kruger's character).\n"},
{"review": "\nBig Agriculture hires an assassin to kill a scientist who wants to give\neverybody food for free forever so that hunger will become obsolete.\nThe scientist is humbly called a progressive. He brings progress in\nthis world and science is an unmitigated good...<br><br>There is an Arab sheik who pays disinterestedly for this discovery,\nrisking his life left and right for years on end, for the sake of\nmankind. He is also somewhat handsome.<br><br>Then our assassin becomes so saintly that he persuades a defenseless\ngirl in a bad situation to risk her life for his sake for the better\npart of 90 minutes. She even kills for him, whereas he keeps his hands\nrather clean...<br><br>The location, Berlin, is striking, but not beautiful, because we do not\nsee nearly enough of it...<br><br>Whoever thinks this is a likely story deserves to watch it.\n"},
{"review": "\nThis century has seen Liam Neeson in real leading roles, when his\ncharacter \"permeates\" the whole movie and is strong and quick-witted.\nTaken 1 and 2 are best known, Unknown has - for some reason or another\n- remained in their shadow. In my opinion, the script of the latter is\nmuch stronger, has more twists-turns and unpredictable moments - me\nbeing a fan and active viewer of crime thrillers could not guess what\nkind of background could Neeson's character Dr. Martin Harris really\nhave. Sequence of the events is logical and chases are visually\nenjoyable. The ending in general is predictable, apart from the very\nlast scene.<br><br>Well, all the cast is excellent, not only Liam Neeson; Diane Kruger and\nBruno Ganz are the supporting actors more time on screen and they are\nreally good. In short, Unknown is really worth watching - especially if\nyou have not read spoilers :)\n"},
{"review": "\nThis may be a spoiler for you, so read no further unless you have seen\nthe film and can understand what I am talking about. Typically, a\npatient with a head injury and memory loss has primarily short-term\nmemory loss, while retaining long-term (which is how he knows him name,\nfor instance, and whether he is actually married). This man's memory\nloss is the opposite - he knows his (phony) name, insists that he is\nmarried to his fellow spy, which he is not, but does not remember what\nhis real occupation is and the bad things he has done in the past.\nWorks for the plot, but is medically inaccurate. I also question why\nhis journal, which must have been in his pocket when he went into the\nriver, looks only slightly water-damaged, and the ink isn't smudged at\nall. Please!\n"},
{"review": "\nHaving seen an advance screening of this movie I really loved it. It\nwas slow to start but the 2nd act really picked it up and the 3rd act\nwas amazing. But I did notice the word OZ showing up in the background\nat my last count 6 times probably more. Anyone know why? The theater\nwas packed and people really seemed to react positively to to the\nmovie. It was as usual fun to watch the so-called bad people get what\nwas coming to them. A great story of redemption and at asking the\nquestion do we ever really know who we are deep down inside or is it\nall a trick of the mind. I would highly recommend this movie to anyone\nwho loved \"Taken\" or the \"Bourne\" movies. The car escape scenes were\nsome of the best I have seen in a long time and worth the price of\nadmission alone.\n"},
{"review": "\nhere you go i am saying it from the beginning that Liam neeson was\nfantastic &amp; what i liked in this film was the good suspense buildup but\nat some points in the film you can guess the whole plot &amp; climax now\nwhats that popular word everyone uses .its predictable.yes it was but\nnot entirely at the end of the day it depends on the viewer that how he\nlooks at it.<br><br>unknown is about a biochemist who comes to Berlin with his wife but\nthings don't go as they should.he later gets into an accident &amp; goes\ninto coma.<br><br>the writing &amp; execution was so fine here.the cast January Jones &amp; Diane\nKruger i am not a fan of them but they did some nice acting.but i felt\nclimax should have been a little longer but it as satisfying for me\nbecause i had no expectations from this film.<br><br>i don't like it when a critic likes or hates a film.i watched it so ill\ndecide it.films are for people not for critics.<br><br>fans of Liam neeson will like this film.overall unknown 2011 is a good\nwatch.as the movie was shot it Germany it looked cool as ice.my rating\nis 6/10\n"},
{"review": "\njust got back in town yesterday and decided to watch unknown. looks\ngood and i really enjoyed taken. after watching it my mind quickly\nchanged and unknown is added to my blacklist.for everyone thinking of\nseeing this be warned this is a Bourne clone. it follows the same\npremise. a man in Europe loses his memory and forgets he's a spy.\nthroughout the movie he finds clues that piece his memory together. at\nthe end he figures out he's a spy and has a change of heart and stop's\nthe bad guys from completing their mission which was he's mission in\nthe first place. save yourself from UN originally and just rent the\nBourne identity. what makes it worst is that Matt Damon is young and is\nmuch more believable as a world class assassin then Liam nelson is.\n"},
{"review": "\nUnknown really is a great thriller/action packed type movie. I was\nlooking for one when I started watching the movie and I got it and much\nmore! From the starts out a bit slow but once you get into the jist of\nthe movie you will not be able to stop until you find out what happens.\nI won't reveal too much of what happens I will say it will be a\nsurprise either way. I really liked the way the movie ended up being\nand was very enjoyable movie. I really liked the way the characters\ndeveloped throughout the movie especially the main character the movie\ntends to draw you in throughout and that's how I got drawn into this\nparticular movie . There are many twists and turns to hold you in until\nthe end. Very fun/enjoyable movie.\n"},
{"review": "\n'Unknown' has almost everything which you can expect from a legit\n'popcorn' film: a dull script, cool cinematography and lots of freaking\nillogic action scenes. Not the best of the genre, obviously because\neven popcorn flicks have a very high level of competition nowadays.<br><br>But if you want to be aware about this film, here i give a few examples\nof the badness in it: dumb dialogues, ridiculous and somewhat\nunintentionally comic situations, embarrassingly cliché(yes, the last\nhalf-hour is just pathetic) a super-predictable twist, and Liam Neeson<br><br>may not deliver exactly the kind of quality in his acting which you<br><br>are familiar with. But who cares? This film was born to be bad. Nothing\n'good' added to it would make a difference either. So, if you want to\nwatch it,watch it for your own risk.<br><br>5.5/10\n"},
{"review": "\n'Unknown' is a solid espionage thriller with a very good cast and\nexcellent locations in Berlin, directed by Jaume Collet-Serra, and\npreceded by the Spaniard's third film 'Orphan'. Liam is a rock (not The\nRock) in the lead, now thoroughly established as a main man in the\naction movie business, and he has excellent support from Frank\nLangella, Diane Kruger and January Jones, but it is Bruno Ganz who\nsteals the show in terms of acting chops as a former Stasi officer,\nindeed the short scene that he shares with Langella is the film's most\ntense and poignant, superb acting. There's something of the feel of\nRoman Polanski's 'Frantic' in the perilous pursuit through a European\ncapital, although this is a grittier affair and probably the better for\nit. Not to be confused with 'Taken' which is a completely different\nanimal.\n"},
{"review": "\nIt is not an easy task to write a review about this thriller. Thriller\nby it's definition needs to get you involved swiftly, grab you by the\nthroat and hold, till the amazing and unforgettable finish. So by that\nmeasure this a very successful flick. There are car chases, people\njumping back and forth, quite a number of dead people etc... Of course\nnone of this makes any sense whatsoever. You could poke thousand holes\nper minute if you were so inclined. But, to what purpose? The\nfilmmakers didn't lie nor misrepresent themselves. It is what it is.\nLiam Neeson, a very talented actor, suffers from the same ailment that\nany reluctant action hero does. Too busy running and ducking to act.\nFortunately we have marvelous veterans Frank Langella and even more\nBruno Ganz. Smart director knows that he needs little meat on this\nmovie's bones.\n"},
{"review": "\nUnknown is one of those movies that takes you in one direction for a\nlong time only to completely throw you off track near the end. I was\nworried at first because I thought this movie was a ripoff of \"Lady\nVanishing\". But this film takes the mystery of the main character to\nanother level.<br><br>While this movie has an interesting plot and keeps you on the edge of\nyour seat, it isn't flawless. What keeps this movie from getting a 9 or\n10 for a score is that it does have some moments that are quite\nunrealistic. This isn't always a big deal in thrillers like Unknown,\nbut this movie actually has a sense of realism that is spoiled now and\nthen.<br><br>What helps to carry this movie is the strong acting and resulting\nstrong character of Ernst Jurgen (played by the great Bruno Ganz). His\nperformance stands out and helps carry this film.<br><br>Unknown is a thriller with enough turns to keep you intrigued while\nhelping you forget any of the movie's deficiencies.\n"},
{"review": "\nAn ingenious script that echoes concepts, plotting, pace and intrigue\nfrom mysteries such as Nowhere Man, Frantic and The Bourne Identity.\nOnce again, Liam Neeson shows his prowess in choosing projects of high\ninterest and executes a performance that connects well with his\naudience.<br><br>To put this in context, mystery thrillers are very hard to pull off\nanymore. Filmmakers must create layers of mysteries that the audience\ncannot easily second guess, peel them back one by one to reveal answers\nthat themselves sometimes turn into mysteries later, and resolve all of\nthem in 2 hours without seeming contrived or obvious. To make it more\nchallenging, the characters must be empathetic, the action sequences\nsatisfying, the pace agreeable, the dialog convincing, and the setting\ncompelling.<br><br>Director Jaume Collet-Serra has pulled it off again, following on the\nheels of another successful thriller, Orphan. This director is a rising\nstar.\n"},
{"review": "\n'Unknown' is a decent enough thriller that keeps you interested and\nguessing until the end. The story has potential but is ultimately let\ndown by some far-fetched scenarios and plot holes.<br><br>In the opening few scenes alone there's one coincidence too many - Dr.\nHarris forgets his suitcase, crashes into a river on his way to\nretrieve it (after a container falls off the vehicle in front), and is\nthen saved by a taxi driver who goes on to risk her own life (again) to\nhelp him find out who he is.<br><br>I can't say that I didn't enjoy 'Unknown', it was a good 2 hours of\nentertainment, but it would have been a damn sight more enjoyable if it\nwas believable too.\n"},
{"review": "\nI decided to watch this movie because it had Liam, the Harrison ford of\nthe second millennium, the cute Kruger and a change of locations with\nBerlin. In addition, the story sounded like a mystery. Now, the result\nis average, not totally awful but not worthy of a second watch. I have\nnever went there and maybe it's due to winter time but this Berlin\nlooks a cold, industrial city that surely don't have the beauty of\nParis or London\u0085 Then, i didn't understand why Kruger doesn't play a\nGerman girl ?? About the plot, it's a sort of reboot of « frantic » :\nsame professor, same hunt in a foreign country, same companies game,\nsame help from a young woman, same little flat\u0085 Maybe the difference is\nthe twist but there, there is a lot of inspiration from « XIII ». The\naction sequences are maybe well orchestrated but they are totally\nunbelievable, especially the car chase ! At the end, my last question\nis why it's a french movie when everything and everyone aren't not\nfrench ???\n"},
{"review": "\nJudging by the poster and the plot synopsis this movie seemed like a\ncash-in on the success of \"Taken\" (even more so than \"Taken 2\"), but I\nwas surprised by the different style and the fact that Neeson is\nslightly less implausibly bad-ass. He's just an average guy that tries\nto prove everybody is framing him, he doesn't do much fighting but it\nisn't required to keep the compelling plot interesting. The story is\ngenuinely well-crafted and gives you a conclusion that you don't see\ncoming from miles away (unless you're amazing at that type of thing).\nOh, and Bruno \"hey, isn't that Hitler from Der Untergang?\" Ganz is in\nthis, a highly underrated actor that effortlessly adds a bit of class\nto any movie he's in. In the end things may get a bit unbelievable, but\nthe movie's twist is such a great find that I doubt you'll mind the\nlack of realism.\n"},
{"review": "\nI've seen this movie a few times and enjoyed it each time. That's a\nsign of both the plot being excellent and the story well told.<br><br>The first part is better tough, in my humble opinion. Still, the movie\nas a whole is definitely worth watching. It keeps you interested until\nthe end. <br><br>The soundtrack fitted well, but not memorable for me. The acting was\nalright. So was the background.<br><br>After having watched thousands of films since my childhood (not very\nproud of that 'achievement'), I often predict the plot/ending, and\nmostly I'm right. However, I couldn't have predicted the ending of this\nmovie. It surprised me. Well done.\n"},
{"review": "\nNot a bad flick.<br><br>It's an old formula, along the lines of The Bourne Identity-type\namnesia and spy stories, but this has an extra little twist on it that\nI thought was quite clever.<br><br>The performances are fine, and it's always nice to see Bruno Ganz in\nanything. I now know from 3 different films that the guy speaks German,\nFrench and English - but then most Europeans (in fact most people in\nthe world), speak at least 2 languages.<br><br>I enjoyed too seeing the major landmarks of Berlin, in the snow,\nincluding the shopping centre where I bought my fave pair of jeans!<br><br>I've taken a couple of stars off:<br><br>1 star - it was formula, and even though it was good I'm just sick of\nthe old-world Hollywood, they need to grow or die.<br><br>2 stars - there is some absolutely ridiculous hollywoodism later in the\nfilm, some real far-fetchedness (can't go into details without ticking\nthe Spoiler box). But, I don't think it wrecks the experience.<br><br>All in all, if I'd seen this at the cinema I would not have felt\nripped-off.\n"},
{"review": "\nAll of a sudden I'm seeing Liam Neeson everywhere so I decided to look\nup his filmography. Well, apparently I'd been seeing him for a while\nand never noticed. Along with being Qui-Gon Jinn in Star Wars Ep 1 he\nwas Darkman in 1990, yet if you had asked me who played either role I\nwould not have been able to tell you. After seeing Taken and now\nUnknown, I don't think I'll ever forget Neeson.<br><br>Unknown was a fantastic thriller. Neeson plays Martin Harris who is in\nGermany for a conference with his wife. He gets into an accident, bumps\nhis head and loses his memory. All the drama and action begins when his\nwife no longer recognizes him and another Martin Harris is in his\nplace.<br><br>It is an edge of your seat roller coaster as you follow Martin Harris\naround finding clues to prove his existence. The movie has a lot of\ntwists and turns right down to the end. A very good movie helping to\nsolidify Neeson as a top billed actor.\n"},
{"review": "\nUnknown is a great movie with a very well developed storyline and a\ngreat cast.The movie is a great thriller that keeps you at the edge of\nyour seat as you follow Liam Neeson as he tries to find out what is\ngoing on and why no one remembers who he is.The movie is certainly\nexciting and action packed but it does have its flaws,mainly the\ndialogue was my problem,at times the dialogue was just very lazily\nwritten and you could tell from the way the actors said it that they\ndidn't like the line either.Unknown is a very exciting movie that I\nwould recommend to anyone looking for a good thriller.<br><br>After Martin Harris (Liam Neeson) wakes up from a coma after a car\ncrash,no one renders who he is and discovers a man has stolen his\nidentity and has even convinced his wife.He tries to find out what is\ngoing on and out a stop to this. <br><br>Best Performance: Liam Neeson Worst Performance: Aidan Quinn<br><br>If you have any recommendations on films/TV series I should watch or\nreview,or any questions to ask me,just tweet me @DillonTheHarris\n"},
{"review": "\nOkay, another Liam Neeson action thinking man movie. If you've seen\nTaken then this is nothing much different to that vein of film.<br><br>We have our main actor playing a role little different to what he has\ndone before, and has to get himself out of some crazy situation. He's\nlost his memory and with the help of a local living lady in Berlin, he\nis ducking &amp; diving from some assassins out to kill him for a reason he\ndoesn't understand.<br><br>What's going on? It doesn't matter really. There's actually not too bad\na story here, and compared to many other action films of late, it's\nwatchable.<br><br>It's enjoyable enough and will pass an evening's viewing. Nothing much\nmore than that.\n"},
{"review": "\nDespite being out since early 2011, the movie is not very well known.\nDifficult to say much about the movie without giving something away,\nand therein lies the movie's main appeal, i.e., guessing how it will\nall end.<br><br>Usual Liam Neeson action bill of fare, which means it's very\nchallenging to follow, with attractive younger women begging to be with\nhim. If you like mystery plots that are not totally unbelievable,\nyou'll love this one.<br><br>Currently available in Time Warner's $2 movies, a bargain by any\nstandard.\n"},
{"review": "\nDr Martin Harris (Liam Neeson) and his wife Elizabeth Harris (January\nJones) get into a car accident. Martin survives but when he wakes up,\nhis wife no longer recognizes him and someone else (Aidan Quinn) has\ntaken his place. The world becomes a place of paranoia, and the only\nperson who helps him is the waitress Gina (Diane Kruger).<br><br>It's an unusual head scratching premise. It's a mystery as to what the\ntrue story is. Is it all in his head? Or is it reality? The pace could\nbe faster in the first half. I wish they didn't push the color spectrum\nso far to the the blueish green. It's obvious and distracting. Also\nthey need to pair up Kruger and Neeson a lot sooner.<br><br>As it stands, the movie is split in two. The first is a slow meditating\nparanoid interior film. The second half becomes a Bourne Identity film.\nIt'd probably improve to concentrate the first half more.\n"},
{"review": "\nIt's true that some - only a few - of the twists have been seen before,\nin other places under different circumstances, with other actors and\nplots. I suppose, given those immense variables, that a few critics\nmight find it derivative. Most films that hit the market are much more\nderivative but it's the way the film is handled that counts, along with\nLiam Neeson, of course.<br><br>The plot is beautifully handled and fluid, the characters - the two\nmain ones - engage our sympathy, the music is quite good and the\ncutting textbook perfect. I knew fairly well what might be going on and\nyet there were many surprises, particularly at the end. It had my\ncomplete attention from beginning to end and seeing it was time well\nspent.<br><br>Curtis Stotlar\n"},
{"review": "\nMoments of slight suspense broken up by intense deja vu. Sure there\nwere fight scenes and a car chase and lots of, \"Wait, what's going on?\"\nmeant to elicit intrigue - but for far too long I was left with no idea\nas to what was happening and I found myself not really caring either.\nDiane Kruger's performance was flat and Liam Neeson was his usual\nsquinty eyed man-on-a-mission. Before I was keyed in to what was\nactually going on, all I could think about was Sandra Bullock's 1995\nmovie, The Net. Since the moment I was finally clued in to what the\nreal story was, I've been plagued by the idea that I've seen this exact\nstory line before but I can't for the life of me remember if it was\nanother movie, a TV show, or even a book I read once. All in all, I\nfelt like I'd seen the whole thing before and the weak twist at the end\nwasn't enough.<br><br>Bottom line: I'd watch it if I didn't have anything else to do and it\nwas on TV.\n"},
{"review": "\nThe theme in this movie is amazing, and I think it would be much\ninterested with a different casting and different director, 'cause full\npotential of this theme is far by used...Neeson is not convincing at\nall, I think this is one of his poorer performances and I can say same\nfor Kruger...effects in the movie are also poor, they are not\ncontributing properly to the main action...only light spot for me in\nthis film is January Jones, 'cause her acting is so natural, opposite\nto others...it's really a shame, 'cause with this brilliant theme some\nother people could made a great movie...but this one is just slice over\nthe average!\n"},
{"review": "\nThere are some similarities between Neeson's characters in Unknown and\nTaken but the plots are quite different.<br><br>I was taken by the sheer horror that one would feel if you lost your\nidentity, wife, money etc. Some might say this is silly but for much of\nthe film it works. We know something is going on but what, and why? As\nthe movie nears its end it starts to unravel a bit and becomes\ntransparent a little to early. The settings in Berlin are terrific, and\nthe atmosphere suitably chilly.<br><br>This is a popcorn muncher but it is very well done, certainly way\nbetter than Taken. And there are no brain dead teenage girls in it.<br><br>Recommended.\n"},
{"review": "\nHaving seen the awful TAKEN, I thought this had been written / produced\nby the same team.<br><br>The so-called plot has more holes than Bruce Willis' t-shirt at the end\nof a Die Hard movie.<br><br>Where were the Berlin cops during / after the silly car chase? Come to\nthink of it, where was the usual Berlin traffic? Poor Neeson is getting\nmore and more wooden as the years go by. They could have had Steven\nSeagal in that role.<br><br>So, we have this highly trained team of assassins who can find our hero\nanytime and anywhere but apparently didn't know he was in hospital for\n4 days! Such a spectacular accident would have made the news on TV and\nnewspapers, no? He turns up at the hotel, and rather than taking him\nquietly aside, the fake wife and spare \"husband\" make a huge fuss, cops\nare called etc. Exactly what you want when you don't wish to attract\nattention to your team of terrorists, eh? Awful. No other word for this\nmess. 1/10\n"},
{"review": "\nIt has seriously been well over 5 years since I wrote a review here on\nIMDb.com. I felt compelled to write one after seeing this movie. It's\nnot your \"typical\" thriller. It's a very intelligent, slick, cool\nmovie. <br><br>IT has SO many twists, SO many turns,....it really does keep you\nguessing up until the end of the movie. It's not predictable at all and\nthat's a good thing.<br><br>I saw it on blu-ray and it was great fun. Good actors, good plot, it's\ngot everything.<br><br>It sure made my Saturday night a good one!\n"},
{"review": "\nA lazy Saturday afternoon and I picked this movie up to catch up as\nLiam Neeson is one of my favorite actors. From the word go, it had my\nfull attention, he looked mature and attractive and the accident broke\nthe ice for the drama that was going to unfold. Frankly I don't like\nJanuary Jones, who plays Liam's wife as Mrs Harris I didn't trust her\nwhen she calls out to him from the airport taxi, I knew something was\nwrong. Liam is playing Dr Harris or was supposed to- I will let you\nwatch and figure out but it was a gripping plot to the end. He comes\nacross Gina who is played by Diane Kruger, I saw her in Inglorious\nBastards. Gina helps Dr Harris unfold his true identity as she was the\ntaxi driver when the accident happened. After a long time, it was a\ngood action flick for me with an investigative story. If even half of\nthe biotech controversy is true then this planet is going to face many\nchallenges from Man who will fight to conquer nature.\n"},
{"review": "\nThis movie had an interesting premise and even more-interesting first\nhalf to it, but got a little carried away in the second half. That's\nnot rare in movies today, but it's always disappointing when it\nhappens. Some people loved the ending of this movie; I did not.<br><br>I did enjoying watching Liam Neeson do what he does best - play a man\non a mission. Here, he's trying to find his identity which has been\nstolen. The storyline you can read here on the title page on IMDb, but\nyou just want to know whether this is worth a few bucks to plunk down\nat the video store. I would \"yes,\" because it's entertaining. It's just\nnot as \"smart\" as it looks like it's going to be.<br><br>At the very worst, we get a good tour of Berlin and overall, a \"7\" is a\ndecent rating.\n"},
{"review": "\nBefore watching this film you should take a look at Neesons previous\nfilm \"Taken\". Then have a look at the last two Bourne films. You'll see\nthe same type of production with dark, moody filming, wobbly \"hand held\nshots\" with a documentary feeling. They even stole some Inception ideas\nwith the slow motion car crashing off the bridge. Berlin looks good in\nthese sort of films as the city has a backdrop of a bygone era that\nstill exists within it's architecture.<br><br>Neeson takes his role seriously and is very convincing post crash. He\nis not as sharp as his role in Taken but he is nether the less good\nwith his gritty voice and dialogue. I suspect Neeson was held back some\nby dubious support acting and he makes the most of what he has to play\nwith.<br><br>There is something for everyone but I can gauge how good a film is if I\ndecide to buy it on DVD or Blu-Ray. Taken I bought the Blu-Ray, this,\ni'll buy the DVD.\n"},
{"review": "\nI enjoyed this movie a lot. The acting was rich and professional. The\nstory was entertaining with lots of twists and surprises. The car chase\nwas amazing and Berlin gave a lot of charm to the movie. The visual\neffects are amazing especially the bomb at the hotel. I loved that this\nstory can show how Mafia and terrorists think.it's a mix of Love,\ngrudge, suspense and surprises. Liam Neeson did an excellent job with\ngreat performance. Ur heart will break to see all those Mercedes cars\ndestroyed :) but it's Germany where cabs are Mercedes.Violence is\naccepted in this movie as it's not so bloody and disgusting and same\nfor sex, it's just right. This movie kept me entertained from minute 1\nuntil the last 113 minute\n"},
{"review": "\nUnknown<br><br>The best thing about suffering amnesia while visiting a European city\nis that you won't remember the size of North American bathrooms.<br><br>Unfortunately, the diminutive dimensions of the loo are the last thing\non the mind of the memory loss sufferer in this mystery.<br><br>Arriving at a hotel in Berlin, Dr. Harris (Liam Neeson) suddenly\nrealizes that he forgot his briefcase at the airport.<br><br>Abandoning his wife Liz (January Jones) in the lobby, Harris hails a\ncab. En route, the taxi plunges into the river.<br><br>Revived in hospital with no memory, Harris retraces his steps beginning\nwith the cab driver (Diane Kruger).<br><br>When he is finally reunited with his wife, Harris' stunned to find her\nwith another man claiming to be Dr. Harris (Aidan Quinn).<br><br>With its scenic setting, intense acting and tolerable twists, Unknown\nis a capable whodunit.<br><br>As for travel related amnesia, I think baggage handlers have it.\n(Yellow Light)\n"},
{"review": "\nBest tittle, for this story. Liam Neeson is always at his best in these\nkind of roles. Movie has a lot of action, and interesting moments where\nyour mind goes puzzled, like what is going on!!!!!. As the movie\nproceed, you also starts predicting the story, like this should be the\ncase, but all your predictions goes wrong in the end. Movie is clearly\ndescribed in the end, and you will have all answers to your questions.\nMovie has a lot of suspense and twist and turns which make a movie more\ninteresting. There are also few chase sequence. Direction of the movie\nis good with all thrill and suspense. You find this story similar to\nBourne series, but as the movie proceed you find it with a entirely\ndifferent plot. if you really like watching thriller and suspense kind\nof movie, then you are going right. I must recommend you to watch this\nmovie.\n"},
{"review": "\nBest Movie ever watched.I have watched many Hollywood movies But when I\ncame to watch\"UNKNOWN\" I was out of words to praise my favorite actor\n\"LIAM NEESON\" AND THE WHOLE CAST ....I would just say that {Must watch\nthis awesome movie} Love u \"LIAM NEESON\" And keep it up\n{DIRECTOR,WRITER and to all \"UNKNOWN\" team.And the whole story of movie\nwas very very interesting.And it was very good show of acting from\n{DIANE KRUGER}.SHE JUST MADE ME MORE CRAZY ABOUT WATCHING IT WITH MORE\nINTEREST.It was just an awesome movie and we are expecting same type of\nsuperb movies with the same cast in future (THANK U)<br><br>With Regards<br><br>{KASHIF MEHMOOD FROM Pakistan} KASHIFUNDERSCORE@HOTMAIL.COM\n"},
{"review": "\nIt is no doubt exciting and intense, and Liam Neeson is as fantastic as\never in the spy-kick butt-ery role. The twist is nifty but after that\nis spoiled it feels like there isn't much left to the audience to make\nthem wonder what could happen next. <br><br>Despite that, I love the noire film style and the gritty Berlin\nexterior, and the action scenes are crazy and brutal. <br><br>This is a smart thriller with shades of very good film making thrown\nin. <br><br>It's not the best thriller, but kudos for finally making and darned fun\nand entertaining one.\n"},
{"review": "\nUnknown is a pretty captivating action thriller staring Liam Neeson.\nThe premise is quite fantastic, but until the end, when we realize what\nhas happened, it is quite interesting. Follow Dr. Martin Harris as he\nruns against the clock to find out who stole his identity.<br><br>The movie is not as action packed as Taken, for instance, leaving time\nto develop the characters and the plot. I can imagine this would have\nbeen a film for Harrison Ford, if done a decade or more ago.<br><br>In all, I found the movie involving, but not very memorable. The ending\nsolves all mysteries and feels a bit rushed, so that is probably what\ndrags down an otherwise above average film.\n"},
{"review": "\nokay so you can expect the victim of a car accident not to think too\nrationally but Unknown pushes this idea too far. Once Neeson is unable\nto prove his identity, having been rational enough to go to his hotel,\nsurely the next place to go in a developed capital city (like in the\nBourne Identity for example) would be his countries embassy <br><br>Had Neeson made this realistic character action or attempted to then I\nwould've been able to suspend my disbelief for any kind of fantastical\nplot that they fed me, but it doesn't and it bugged me throughout <br><br>Had it happened then Unknown's plot would have needed to be more\nwatertight and maybe wider in scope than it is, perhaps taking place in\na lesser developed country a long way from a capital city would've been\nenough.. quite simple really <br><br>Instead we're left with a movie with a weak story which otherwise\ncould've been pretty good\n"},
{"review": "\nLiam neeson:whenever this name is in the star cast you are forced to\nsee the movie;at least I am.Though most of his movies has the same\nplot(him being thrown in absurd situations) yet all his movies keep you\nat the bay till the end.In this movie his character of Dr.Martin harris\ngrasp your sympathy within first 10 minutes.You keep on thinking what\nmust have happened that he is in this situation until the end when your\nmind goes off burst.Nice thriller yet flawed a bit in the middle.Still\nworth watching.Liam Neeson is impressive again.Diane kruger also is\ngood.This time there is more of acting than beauty.Nice work by a new\ndirector.the location in the movie are also and add to the thrill of\nthe plot.The chase scene in the middle is nicely done and keeps you at\nthe bay.Overall A nice movie and worth watching for all thriller fans.\n"},
{"review": "\nA very satisfying thriller with a brilliant script full of misdirection\ntaking us along for the ride noticing little inconsistencies and\noddities and then at the end a total surprise ending makes all those\nquestions fall neatly into place. For me it was the script that put it\nway above the normal fare and then all the elements were well executed.\nAnd it's always fun with a thriller for an audience to be taken to a\nforeign locale and in this case seeing much of the city of Berlin from\nthe heights to the depths. Our total sympathies lie with the Liam\nNeeson character who is trying to establish his identity and the very\npeople he knows so well refuse to acknowledge that they know him. And\nthe ending managed to work out to everyone's satisfaction, most of all\nthe audience. A good example of the thriller genre with the complexity\nmodern audiences demand. A much more interesting movie than TAKEN which\nwas a linear recover my daughter story.\n"},
{"review": "\nFirst of all this is my first review and i don't know why i have chose\nthis movie to do it on but thats what happened. Its my simple review in\njust a couple of words : this movie is simply a bit a rip off from\n''salt'' movie .. a guy (girl) no memory of before , begins to remember\nafter certain actions .<br><br>The main 2 differences is : 1)Unknown is much better done and wrote\n2)each movie has a different ending<br><br>the acting is not really good although i really liked Diane Kruger\nacting. also some scientific info weren't really correct .<br><br>Something wasn't really obvious is why would Ernst Jürgen kill himself\nwith cyanide while he knew that Rodney Cole was paying him a visit and\nhe might have prepared himself against him which was a bit lame for me.<br><br>a movie worth watching but could have been much better\n"},
{"review": "\nThis is a short and sweet review. Unknown is a great movie.<br><br>I did basically \"solve\" the mystery of the movie halfway through, but\nkeeping with it to see if I was right was part of the fun. Great\nperformances and though I never say this - great locations. I don't\nknow why, they just fit the story perfectly.<br><br>It was a movie with a taste of Bourne Identity to it, but better.<br><br>In the end, it left me with only one question, one that I can only wave\noff as, \"Well, there wouldn't have been a movie if that hadn't\nhappened.\"<br><br>Rent, buy or otherwise see this movie, you'll love it.\n"},
{"review": "\nWhile i'd hardly leap out of my seat to see much of Jaume\nCollet-Serra's back catalogue (Goal II, House Of Wax remake), i have to\nsay he has turned in a highly functional, and always engaging modern\nday thriller with 'Unknown'. Liam Neeson seems to now find himself at\nhome as the '50 something' action hero, and his performance is suitably\n'Frantic' which is another film that springs immediately to mind in the\nearly stages. Neeson is supported well by an impressive cast featuring\nDiane Kruger,January Jones and two heavyweight actors in the shape of\nBruno Ganz and Frank Langella. While you never quite feel the\ngoosebumps brought on by 'Taken', there's still enough thrills,spills\nand twists to fill up the running time, and things never at any point\ndrag.\n"},
{"review": "\nMy expectations were met completely. The story is very intelligent\nwritten. The cast as Liam Neeson, Diane Krüger and Bruno Ganz played\ntheir roles very cool. There are many puzzles to solve and many turns\nand twists. I love it when there is suspense. There were a few slow\npaced sequences but it didn't stop the dynamic countdown. The car chase\nwere really top mixed with some product placements. The action scenes\nhave also been executed on a very high level. The cinematography seemed\ntoo much displaced and could have been better. Anyway, congratulations\nto all the stuff. This is another example how thrillers of nowadays\nshould be made. I could really feel the atmosphere of Berlin and it is\na nice city to visit once. 6,5/10 Don't miss TAKEN.\n"},
{"review": "\nMy wife and I very much enjoyed this film. We we're hoping it would\nentertain us as much as Liam Neeson's earlier movie called \"Taken.\" In\nfact, I thought this is a better movie than Taken. There was nothing\npredictable about it. The movie leaves you hanging on the edge of your\nseat from beginning to end. It didn't seem like a cheap action flick\neither. It seemed well made, like a high budget film. I think Neeson\nplays these roles very well. The strong, mysterious, sophisticated\ncharacters. Much like the type of roles that Harrison Ford played in\nhis hay day. Will definitely be on the lookout for a next Neeson film\nbecause we truly enjoyed this.\n"},
{"review": "\nComparisons with Taken, Liam Neeson's action tour de force, are both\napt and improper. This is much more of a thriller, where a doctor wakes\nfrom a coma to find that only he believes who he is. Thanks to how the\nfilm start, so does the audience and the script smartly makes you doubt\nthe main character after a while.<br><br>But this is not a mystery film and it soon cranks up the dials,\nconverting into a pseudo-action movie that is just on the border of\nbelievable. A lot of this goes to Neeson, whose worst talent as an\nactor is to fake an American accent. His best, though, is his screen\npresence and ability to take the audience along. Give him a well-paced\nscript and he does brilliantly. And here he does brilliantly. Even if\nyou see the twist coming, you'll enjoy the ride.\n"},
{"review": "\nThirty minutes into the movie and it'll be almost impossible not to\nstart thinking about how it might end, like with most conspiracy\ntheorists everyone will think they know the answer but most will be\nwrong. <br><br>Yes, the movie might be similar in many ways to many others because of\nthe winter European atmosphere and the \"guy against the world\" feeling,\nbut it keeps a good balance between the unrealistic things that you\nnormally watch in an action movie and a plot that is both interesting\nand believable. <br><br>If you add a great leading actor and two stunning actresses to the\nstory, it makes perfect sense that the difference between the gross and\nthe budget is of more than 100 million dollars.\n"},
{"review": "\nThere are very few suspense thriller movies that impress these days and\nUnknown was one of them. Extremely well plotted and directed,this movie\nmakes your savor every moment of the 113 minutes running time.<br><br>Liam Neeson seems to have carried on from where he left taken but has\ntaken his performance a notch higher by being more than just a woody\naction hero. Diane Kruger once again proved that she does not have to\nrely only on her looks to make an impression and impression she did\nmake. Elizabeth Jones also did justice with her character but an actor\nof the class of Adrian Quinn was really wasted.<br><br>The way every thing is bound together till the end make this a must\nwatch. Just try and ignore some of the lengthy action sequences and you\nll feel satisfied at the end of this roller coaster ride.\n"},
{"review": "\nI am a great fan of Action/ Thriller movies and hence I rented this\nmovie. I had earlier watched A- Team and Taken of Liam Neeson and hence\nlot of expectations from this movie. I am totally impressed with the\nstart and sped in which movie movies. Here I really wants to give\ncredit to writer and Director and I really find this title a fast\nthriller. I want to place this movie in my all time favorite thrillers.\nAs this is the first good thriller movie after many years where there\nis no usage of sci-fi thing. I don't want spoil anyone interest by\ndiscussing the story. But thing I want to say never miss this one, its\nreally amazing. ACting wise no doubt Liam is best and sometimes movie\nlooks like Taken 2. Diana and Aidan are also good in their role. I will\ngive this 9/10.\n"},
{"review": "\nWhat is it with Hollywood thrillers in Europe? Is it really that hard\nto make a movie that doesn't ignore so many gaping plot holes that a\ncheese grater appears waterproof in comparison?<br><br>This movie has good actors, some very good actors, giving it their all\nin a movie whose plot appears so contrived and broken that the final\nfeeling is one of sheer disbelief that they managed to get as much\nstuff wrong as they did.<br><br>*Spoilers below*<br><br>The hero sees a nurse being killed in a hospital but instead of calling\nthe police runs outside and flees? A good friend of the nurse then\nshows no great dismay when the hero tells him that the nurse is now\ndead?<br><br>I'm sorry. That's just a part of the failure of the scriptwriters. It's\njust painful to watch.<br><br>Would have given it fewer points but the actors really do try hard.\n"},
{"review": "\nA man wakes from a coma only to find that there is another man leading\nhis life in his place.Even his wife denies ever seeing him...<br><br>What should he believe?? Broken pieces of his own memory that he\nhimself is not sure enough to trust or his surroundings which in every\nway is proving him to be delusional???<br><br>Starting with his fragments of memory and well shot action scenes\npunctuated by quite drama in between, the movie takes us to the very\nstreets of Berlin,, and u begin to empathize with Dr. Martin Harris\n(Liam Neeson)....<br><br>Liam Neeson has done a really good job making this movie immensely\nentertaining....\n"},
{"review": "\nGood movie, well made and almost credible if you can put away reality\nfor a while. Also, the basic plot of waking up to \"who you really\nwere\", with info left from your former self to remember, and turning\nfrom bad guy to good guy, is 100% outta the Sci-Fi classic \"Total\nRecall\".<br><br>This lines are gibberish since IMDb HAS to have 10 lines of info but\nI've got nothing more to say. This lines are gibberish since IMDb HAS\nto have 10 lines of info but I've got nothing more to say.This lines\nare gibberish since IMDb HAS to have 10 lines of info but I've got\nnothing more to say.\n"},
{"review": "\nNot quite as memorable as Taken but Liam Neeson's presence lifts this\nfilm out of the ordinary. Liam convinces the viewer for most of the\nfilm that he's a devoted husband until he learns, and we learn, the\nshocking truth that he's, in fact, an assassin. Somehow, partial memory\nloss, from a car accident reverses his true nature. Once happy to\neliminate a top bio-technologist he later attempts to save him so that\nthe world can benefit from a drought and pest resistant corn. However,\nthe fighting skills he had as an assassin are also partially lost with\nthe partial memory loss. Several times he manages to escape attempts on\nhis life by his former colleagues who want to eliminate him in case he\njeopardizes the plot to kill the bio-technologist. He befriends a\nyoung, female illegal immigrant taxi-driver who saves him from drowning\nin the taxi-crash and twice saves him again as the story unfolds.\nDespite the usual deviations from reality that thrillers seem to\ncontain it's primary purpose to entertain is not diminished.\n"},
{"review": "\nA rip-off of the story line of Total Recall. An agent believes his\ncover is real. The people who hired him try to kill him and he doesn't\nknow why. He works to prevent a terrible tragedy with the aid of a\nbeautiful woman. He finally meets his boss who is ultimately killed.\nThe acting is a little week and the action scenes are kind of lame. At\nthe beginning he can't punch his way out of a wet paper bag but by the\nend of the movie he transforms into Chuck Norris. They should have\ngotten somebody a little younger to play Martin Harris. Liam Neeson is\nwhat...pushing 60? And that was a lousy hair piece or dye job he had in\nthe movie. This movie is a testament to the fact that Hollywood is has\nrun out of ideas....\n"},
{"review": "\nI won't go into the fact that it doesn't make any sense (the plot that\nis), because many action/thrillers have that in common. But even while\nit does go by the handbook (and checks every little available thing in\nthere) it never fully reaches anything that should be able to touch\nyou. The streets of Berlin may never have looked better, the actors in\nit, probably have though.<br><br>There might be a surprise or two hidden somewhere in the very\nridiculous plot, but the cardboard cutouts (also called characters) may\ngive you a had time caring. I still gave it 5 points, because it is\nafter all decent. I have seen worse, but I have also seen a lot better.\n"},
{"review": "\nThe title of my review says it all as far as i am concerned. The memory\nloss, the trained-to-kill thing, the hero being hunted by the\norganization he was trained by, even the illegal girl: It looks and\nfeels just like the Bourne trilogy but is by far not as well made. It's\nquite a ridiculous ripoff. Just that there are good actors in this\nflick doesn't make it a good film. There are too many incredible\nmistakes made by a lot of characters. And most of the script is just\nnot credible at all. I mean, irl nobody waits with killing an enemy,\nespecially when he is considered extremely dangerous. then why here?\nAnd why an exploding car when we all know they don't explode from\nfalling a long way? those kinds of indiana jones/a-team-effects should\nhave been kept far from a film like this.\n"},
{"review": "\nNeeson as always, gives us a good performance - supporting characters\nare average to good with some thugs being B film quality. The\nphotography is pretty bad, dark places designed to give you a feeling\nof suffocation or claustrophobia, blurred action designed to give you a\nfeel of movement but all combines for just poor cinematography (imo)\nGets draggy and boring in the earlier stages of the film but the action\npicks up midway with some scenes being longer than needed to make a\npoint. Chases and fights too long but good action otherwise.<br><br>Good mystery line that I thought could have been played on much much\nbetter with better screen writing but overall, a good way to kill a few\nhours if you have absolutely nothing better to do - certainly not a\nwaste of time if you've already watched everything else on your \"need\nto see\" list. I love the plot twist -\n"},
{"review": "\nI don't understand why so many people are complaining and giving it so\nless rating. I mean, this is true that the movie had so many flaws and\nmany concepts were implausible. Still, it had many plus points.<br><br>The best thing about the movie is that it is fast paced, and it keeps\nyour interest intact. While watching it, you are always attached with\nthe mystery the movie is creating. Even the climax is good.<br><br>Now, the problem happens is when you finish the movie. After the climax\nis revealed, many viewers start asking lots of questions to themselves,\njoining the puzzles (many of which don't make much sense). They start\nhaving negative impressions. Come on! I don't get why people get so\nnegatively. I'm sure that you might have enjoyed it while watching it.\nDoesn't it matter? I will highly recommend this movie to anyone who\nlike fast-paced Action-Thriller. The movie handles it very well, and\nwill provide you lot of entertaining stuff.\n"},
{"review": "\nThis movie was very interesting to me because it should how one minute\nLiam nelsions character has a family and a good wife and then the next\nmoment its all gone. To see him struggle and cope with that was hard to\nwatch and you start to feel for him and at first your not sure whether\nits real or not. As you watch it you start to want him to find out the\ntruth and succeed. But this movie does a few thing really well: it\nmakes you think that you must be carefull who you trust, and that not\neverything is what it seems.<br><br>This movie is a real mind bender because you don't know whats real or\nnot. But this movie is unrealistic in some aspectic because the\npossibility that your family not knowing who you are is not possible.\nBut the fear that turns into anger is what drives this movie forward.\nAll in all Its a rush to watch and a real mind twister and packs a hard\npunch and locks you in.\n"},
{"review": "\nI watched the movie last night and I can tell it is not a very bad\nmovie. However the ending is not shocking! It is absolutely out of\nlogic! I can not explain more about the storyline because it can smash\nthe movie and I think that this movie has this value to be seen. So I\njust put simply these questions: 1. How a man who was in coma lost all\nof his abilities and his power? 2. Usually people who can not remember\ntheir past very well, can find something about it by visiting the last\nplaces they were or even by passing the time, they remember more about\nthemselves! How the main character remember passwords, numbers,,\ndetails but can not remember anything else about his past like his\naddress in America for proving who really he is? 3. We live in society!\nWe have many ways to prove who really we are! Why the main character\ndoes not visit the embassy? Usually this is the first place we go in\ntroubles on board! Free from these questions, I can tell if you Liam's\nmovies (like me), it is not as good as \"Taken\" but it worths to be\nwatched.\n"},
{"review": "\nThere's not a lot one can say about this without giving away the plot\nsurprises. It started out reminding me of other Hitchcock 'hommages'\nlike FRANTIC or Liam Neeson's own TAKEN. The fact that Neeson's\ncharacter here loses his memory in a near-drowning inevitably recalls\nTHE BOURNE IDENTITY, and the parallels with the Bourne movies were soon\ncoming thick and fast: urban car chases (good stunt work or CGI?), the\ngirl (Diane Kruger) who saves our hero more than once, the treacherous\npeople supposedly on Neeson's side. And Neeson's character develops\nalong similar lines to Jason B.<br><br>This is one of those films that you find yourself picking holes in as\nsoon as you're out of the cinema. \"Why didn't he/she do/say that?\" The\nanswer tends to be: \"Because the movie would have only lasted 10/20/30\nminutes.\" So: pacey and twisting, yes. But also, contrived and\nderivative. Entertaining enough while you're watching it, but really no\nmore \"meat content\" than a Jean-Claude Van Damme vehicle. Not in the\nsame class as the Bourne Trilogy: Matt Damon retains his title.\n"},
{"review": "\n(I made up the above quote by the way)<br><br>This is a preposterous movie and I have never seen one more-so. It is\nthat way by design, with the sole purpose to exasperate the viewer for\nmuch of its run-time, then wipe the confusion and anger away with late\nreveal. And upon learning the \"twist\", the viewer is supposed to feel\nthe relief of understanding. <br><br>All well and good, but if you view the film a second time, in full\nknowledge of the twist, you will still be shocked at the series of\noutrageous events and strange coincidences that drive the premise.<br><br>I just can't abide a movie, based nominally in the \"real world\", that\nrequires so much suspension of disbelief. I will close this mini-review\nwith the most minor example: Liam Neeson explains to a scientist\n(paraphrasing from memory), \"When I was 10 years, I told my father I\nwanted to be a botanist.\" That is not an example of a plot hole,\nbecause it inconsequential to the plot. But it is the least plausible\nsentence ever uttered on film.\n"},
{"review": "\nI rated it 2 cause it was fun watching, yet when it finished i couldn't\nbelieve the loads of absurdity this movie encompassed. seriously a very\nnice idea that has been tarnished by stupid plot and subplots. for\nexample: a) a highly qualified and ruthless assassins that killed\nDian's friend just as they bumped into him on the stairs. . . why\ndidn't they kill her when pinned her to the floor B) while killings\nwere left and right why didn't they just kill Liam when they had\nmillion chances, why that guy in particular should be killed in an\naccident-like murder, he was the only one who was \"nobody\" C) This\nmovie is a cheap replica of The Bourne Identity, and not believable\ntoo, yet has the same ingredients: multiple passport, a girl that gets\npaid in excess, lost identity, a murder attempt, highly qualified\nassassination unit. . etc all there only presented poorly.bottom line\nDO NOT WATCH ITS SUCH A WASTE OF TIME\n"},
{"review": "\nNeeson plays Martin Harris who is visiting Berlin for a convention.\nAfter waking up from a coma resulting from a car crash, someone else\nseems to have taken his identity. 'Unknown' suffers terribly from a\nmost clumsily written screenplay and appallingly wooden acting from\njust about everyone in the film. The story itself is utterly ridiculous\nand presents itself through the use of computer generated turns of plot\nwith a car chase here and a fist fight there exactly on queue. The fact\nthat Harris finds an attractive young female to aid his quest to find\nout what is happening to him, redefines this particular movie cliché. I\nhope someone finds the time to reprogram the software responsible for\nthis nonsense or to decompile it altogether.\n"},
{"review": "\nSo this movie was by far the worst this year. It is so poorly written\nwith plot holes galore. The idea was good though ripped off from other\nmovies but the actions taken from the actors to achieve their goals\nwere ridiculous and made it so when the mystery was revealed i was so\ntaken out of the movie that I didn't care. It seemed like twenty\nminutes to long and by the end (which was so bad and made no sense why\nit happened that way)Not worth the money I spent and I really wish i\nwaited until it came DVD so i could of paid a dollar at the red box for\nit. Save yourself the trip and the money and hopefully Liam picks a\nbetter project next time.\n"},
{"review": "\nI asked 11 people to watch this movie and pause it after 45 minutes and\ntry to think of a scenario to explain what has happened. Not one person\ncould do it. I couldn't either. In the last 30 minutes of the movie you\nare given a perfect explanation to describe the events. This movie is\nextremely clever and very well done. I thought it was one of the 5 best\nmovies of the year. If you think you are good at analyzing movies and\nforeseeing endings, I challenge you to figure out where this movie is\nheading. The ending is unpredictable and very rewarding. If you are a\nfan of Liam Neeson, this movie is a must see. I've watched it six times\nand I am still pulled into on each viewing.\n"},
{"review": "\nBerlin, aaaaaaa. What a place! And what a set to put a movie in!\nEverything about this film is good, I really liked it! Liam Neeson is\ngreat and Bruno Ganz like always! And to put them together, what an\nidea! The plot is interesting and the whole film is fast paced, it is\nfull of ideas and dynamic twists and turns.<br><br>They blew hotel Adlon where Fuhrer liked to stay, and where I used to\ndrink beverages with my children! Shame on you! Just kidding! <br><br>Three months I spent in that city were probably the best months of my\nlife!<br><br>BERLIN! A place to be! I strongly recommend that you see this film!\n"},
{"review": "\nVery well made with some very slick editing keeping the pace pretty\nhigh all the way through. It did feel a little like a travelogue in\nparts, giving us all the iconic views of Berlin whenever the plot\nbrings the action outside. To be fair though, there are a few seedier\nparts of the city shown as well. All the main cast played their parts\nwell with Liam Neeson and Diane Kruger standing out. I also enjoyed the\nperformance of Bruno Ganz as the ageing former Stazi agent and it was\nnice to see Frank Langella as Martin's old colleague, Rodney Cole. Over\nall, a decent watch that doesn't really break any new ground but does\nwhat it says on the tin (and I can't knock it for that).<br><br>SteelMonster's verdict: RECOMMENDED<br><br>My score: 7.0/10.<br><br>You can find an expanded version of this review on my blog: Thoughts of\na SteelMonster.\n"},
{"review": "\nScreenwriter - There's this assassin who gets injured on a foreign\nmission and ends up with amnesia. He doesn't know who he is and\nbefriends an attractive but destitute girl, who's looking for a visa to\nhelp him.<br><br>Studio Exec - Like Bourne Identity? <br><br>Screenwriter - I've not seen that, is it any good? Also, I thought Moby\nwould be good to do the soundtrack!<br><br>Studio Exec - Lets call the lawyers!<br><br>Lawyers - Leave out Moby and can you pinch the scene from Frantic where\nHarrison Ford is stuck on a ledge outside the girls apartment and the\nvehicle over the bridge scene from Inception....the one with the slow\nmo! Also, can we add some pseudo science about crops - that will be\ninteresting!!<br><br>Studio Exec - We're good to go then....lets use Liam Neeson from the\nfilm Taken.<br><br>Screenwriter - Not seen that one...is it any good? I was thinking\nJeremy Renner<br><br>Studio Exec - I think he's busy!<br><br>'---------------------<br><br>Sarcasm aside, Bruno Ganz was excellent. His story would have been far\nmore interesting!\n"},
{"review": "\na man meets an accident. when he gets up from the coma he finds that a\nstranger has taken his place and no body is ready to believe him. He\nsets on the task of reclaiming his identity. The story is initially\nintriguing. Why would someone take a random man's place? Why would even\nthe wife of this random person reject his claim and not identify him?\nThe movie raises the expectations of the audience but the payoff is\ncrap. The mystery resolves itself in a manner which is a copy\nof/inspiration from the Bourne movies among many others. When you look\nback at the 105 minutes they seem like a complete waste because overall\nthe movie does not offer anything new and treads on the old, tested\nlandscape. 2 out of 5 for this disappointment.\n"},
{"review": "\nVery exciting film. I am particularly fond of 'european' touch and\natmosphere presented, being living in the eastern Europe, film looked\nvery domestic and familiar. Instead of skyscrapers, you find miniature\nflats with \"carton walls\" and modest middle-class cars on the street;\nhearing authentic language and behaving dialogs on the glimpse; the set\nis ready, turn-on the camera, please. The story was original up to a\nfair point, and kept all of my attention throughout entire film. The\nacting of a lead actor is natural as always, and supporting characters\nare also good, although pushed into a second plan; with no artificial\nkindness of any sort in between (Gina: \"Why did you have to be in my\nTaxi!?\"; or Ernst:\"The Money!\").<br><br>The 4-day vacuum, gloomy outlook for the lead and general suspense were\ndominant feelings for less then 2 hours of a great adventure. This is a\nperfect thriller for me and I absolutely recommend it to anyone who\nlikes this genre. 10/10\n"},
{"review": "\nQuite an amazing script this one... The movie starts intriguing, but\nwhile the movies moves on, the script becomes more and more\nunbelievable. In the end it is about a corn formula that will save the\nworld from starvation. And this is of course bad for the bad guys. So\nthe professor who invented it has to die. He keeps his formula only on\nhis laptop, so this laptop needs to be destroyed... a world saving\nformula is stored only on a laptop, and not on a server or in the\ncloud, amazing, isn't it? But there are some nice special effects, and\nthe cast is quite good, but in fact the acting is pretty bad\n(especially Neeson). Only the German professor (yes, the same one as in\nZwartboek) was acting naturally, but he did not get that many lines.\nSorry, but this movie was a disappointment for me. If the script is not\nbelievable, the movie falls apart in my view.\n"},
{"review": "\nUnknown is not the worst film i have seen this year but certainly not\nthe best.To be honest the endless comparisons with 'Taken' were very\nmisleading going into the film.The only thing i found similar between\nthe two films were its European setting.Its not original in the\nslightest,man loses memory,runs around a bit,gets paranoid,forgets how\nto act etc. I like Neeson but he seems bored in this film.Frank\nLangella is wasted once again in what could have been a great role,a\nscene where he confronts an East German spy with riddled dialogue is\nplain boring. <br><br>I was expecting a fast-paced suspenseful thriller but was left\ndisappointed,only because of the misleading one word reviews on the DVD\ncase. My fault i guess.\n"},
{"review": "\nLet me tell you, I love Liam Neeson. he is a fantastic actor,\nespecially with action films. i mean, i loved the A-Team, but\napparently, my favorite of his work goes to Love Actually. But this was\ndamn well done. The way that Unknown is directed is very well paced,\nand the acting is amazingly well done. The way that the character Liam\nNeeson plays of trying to find out who he really is, has an interesting\nvibe to it that keeps you on the edge of your seat, wondering what's\ngoing to happen next. Plus, the action scenes they show is well shot,\nand gives you that adrenalin rush that good actions films give us. Not\nto mention, the twist at the end, is purely amazing, and it explains\nthe confusion that anyone who sees this film gets. So, if you like Liam\nNeeson and/or action dramas, this movie is for you.\n"},
{"review": "\nExciting and harrowing as the picture starts. Unfortunately, towards\nthe end is goes steadily downhill. You stop and think: \"What's going on\nhere?\"<br><br>We've seen pictures where people lose their identities, but in those\nfilms the victim is usually the good guy. What exactly is going on with\nLiam Neeson?<br><br>The film is set in Berlin where one character states that we were once\nNazis and now Communism has collapsed. That's basically the problem\nwith this picture: Good plot, but too confusing, especially at the end.<br><br>Go know that our cab driver gal was there not on purpose; but rather to\npick up a fare. What a rude awakening for her.\n"},
{"review": "\nThere is only one word to describe this film, 'fantastic'. It would be\nhard to make this film any better then it is except for more action and\nviolence. By putting away those points, the good points are exciting,\nentertaining, horrific and above all chilling and thrilling. The main\nplot seems innocent and straight forward, but as conflict rises you\nbegin to doubt the movies actual plot and you feel like you are in this\nmovie. Without giving any spoilers away, you don't want the movie to\nend and you don't want the end to be true! Overall the acting is\nfantastic. Liam Neeson has not lost his touch at all. The filming is\ngreat. Whoever filmed this is a legend at hand and should be commended.\nThe writing and directing is also great and just will blow you out of\nthe water.<br><br>Make sure you put this movie on your \"Must Watch\" List because you will\nbe sorry if you missed it.<br><br>Michael N. Radny - 9/10\n"},
{"review": "\nThis film is about a scientist who has a car accident after arriving in\nBerlin for a scientific conference. When he wakes up, he finds that his\nidentity is stolen by another man.<br><br>\"Unknown\" has a great story, and just a few minutes into the film we\nare already treated with much action, suspense and mystery. The\nsuspense is well kept throughout the film, until there is an unexpected\ntwist which marvels me to say the least. The twist is well planned and\nthought out, as I see no loose ends or plot holes. \"Unknown\" takes Liam\nNeeson as a action thriller actor to new heights. I am thoroughly\nentertained by \"Unknown\".\n"},
{"review": "\nLiam Neeson is preforming many Harrison Ford style of serious action,\nand drama roles. Liam Neeson, I believe is replacing Harrison Ford as\nFord gets older. The Unknown is another Harrison Ford style\naction/drama film. However, even Liam Neeson could not save \"Unknown\".\n\"Unknown\" has a good story, and well acted. There is a but here and the\nbut is the film seemed to be made in a rush and gave a disjointed feel.\nI was tired when I saw the film, which could affect my view on the\nfilm. \"Unknown\" could be a film I need to view more than once to\nappreciate it. I give Unknown a 6 or maybe a 7 out of 10. My wife liked\nthe movie more than I did.\n"},
{"review": "\nIf you have visited Berlin, the choice of location on the\n\"Oberbaumbrücke\" for the accident should be questionable but only\nlogically. If you go to seek directions from Google maps for Hotel\nAdlon to Tegel Airport there are indeed two river crossings. Go to\nstreet view and you end up with two rather ordinary looking bridges,\nneither of which are the scene of the taxi accident. Type in\n\"Oberbaumbrücke\" on Google maps and note the location in relation to\nthe route between Hotel Adlon and Tegel Airport. Go to street view and\nthere's the scene of the accident. Now that's a nice bridge with some\nhistory, and a spectacular backdrop for the scene of the accident.\n"},
{"review": "\nI like Liam. I think he has some Personal Power. And I like the German\ngirl Diane. She is so beautiful. But her acting is just so-so in this\nmovie.<br><br>Regard to the story, it's good. At first I thought the ending would be\nlike another movie Stay, but I'm wrong. It's an unexpected ending. I\nlike this kind of movies very much. And the story is very exciting.It\nnearly has no junk scene.<br><br>But there is one thing I cannot imagine why. That is what made him\nchanged from a bad guy to a good guy? The story didn't told us clearly.<br><br>At last I think it worth the price.\n"},
{"review": "\nIt is one of the most wonderful movies I have seen this year, come to\nthink about it, it is the best. Usually I am able to predict the end\nbut not in this movie which shocked me as it will shock you. The\ncharacters are very well set and the suspense is escalating till the\nend. Usually this kind of movies bore me but in this movie you see the\nfacts as a person who lost some of his memory in an accident and you\nsee the plot as his memory is gradually coming back. Simply it is one\nof the best movies of this year. I am wondering why a 7 out of 10. This\nmovie deserves an average of 8 and above. What more could someone want\nfrom a movie of this kind...\n"},
{"review": "\nHollywood can still make good movies, and this is an example of a very\ngood one. It kept my wife and I rooted to the screen all the way\nthrough. It is interesting, suspenseful, and entertaining with enough\ngood, believable action to keep you on the edge of your seat.<br><br>One thing that makes it a movie to be seen is that it isn't completely\nludicrous like so many movies today that are full of plots that seem to\ncome from a ten year old.<br><br>It's true that you have to stretch a little but not to much so that you\ncan imagine something like this possibly happening. In other words,\nit's all possible. There isn't anything that actually couldn't be done\nin real life.<br><br>It's a good movie.\n"},
{"review": "\nUnknown is probably one of of the worst plot-twist driven movies : you\nknow, this whole spawn of movies where, supposedly, a sudden plot-twist\nbrings a new perspective to the events and the characters... <br><br>The scenario has been frankensteined from dozens other such movies, the\nacting is bland at best (Liam Neeson. Enough said. ) and the plot-twist\nis, well, just a plot twist : neither clever nor convincing, it only\nadds to the general feeling of implausibility.<br><br>A perfect example of what happens when lazy studios mix up \"suspension\nof disbelief\" for \"scenario based on holes\", this whole movie is an\ninsult.\n"},
{"review": "\nVery simple really. Why did I click on possible spoilers? Because If\nyou've seen \"Total Recall\" with Arnold Schwarzenegger then you've seen\nthis film. Change it from Science fiction to action, change the setting\nfrom Mars to Berlin and replace Sharon Stone with January Jones and\nit's the same thing.<br><br>Why did I give it 5 stars? Because it kept me guessing until just the\nsame spot that \"Total Recall\" did. When he finds out that he's not\nreally who he thinks he is, you pretty much know where it's going to go\nfrom there. I found myself fast forwarding just a little bit at a time\nand nodding to myself. It was still entertaining.\n"},
{"review": "\nI thought this movie would have a big 'twist' but having seen the whole\nBourne trilogy plus the original Bourne Identity, as well as Nowhere\nMan, this movie seemed incredibly derivative. It's pretty much just a\nbig long chase, with a little twist which you totally see coming if\nyou've seen anything along this line before, and maybe even if you\nhaven't. Lots and lots of long drawn out car chasing. Villains always\non their heels. Lots of fighting. It also kind of reminded me of\nanother movie of Leeson - i.e., Taken, which is also one big long\nchase. So between the plot being so derivative, and the similarities\nwith Taken, this just didn't have much new or interesting for me. Also,\nwhile the lost/stolen identity plot worked well in earlier works along\nthese lines, it really seemed out of touch with current information\ntechnology, which made it even easier to figure out the 'twist' than it\nwould otherwise have been.\n"},
{"review": "\nWell where do I start, the story had potential but got too muddled up\ntowards the end, hard to see where the character \"Martin\" actually\nstood, good or bad? Predictability was also another issue, instantly\nseeing where the story was going when Martin arrived back to the Hotel\nafter his accident. Constantly during the story I also felt that I had\nseen this before, quite similar in my opinion to \"The Bourne Trilogy\"\nwith a mix of \"Taken\" in there, the originality just wasn't there in\nsome parts.<br><br>Liam Neeson as the character \"Martin\" in my opinion couldn't have gone\nto a better actor, very convincing and excellent as always during\nfight/action scenes.<br><br>As for cinematography, some really great shots and angles within this\nfilm, much respect for DP Flavio Labiano. Sound I believe was flawless\nand editing was remarkable with the cross cutting of scenes from\nMartin's past.<br><br>All in all a good film but the final conclusion to the story really\nbrought it down.\n"},
{"review": "\nLiam Neeson is awesome, he's my idol and my hero Like Taken it has that\nsame story of being \"Taken\" except it was Neeson's turn to be taken.<br><br>Many people have complained that its starts off slow but it doesn't it\nstarts off right there, from getting off a plane to being sent into the\nriver Liam neeson goes into a coma not remembering what happened when\nhe crashed into the river.<br><br>Later he gets his identity stolen, gets chased by bad guys, then later\nthe story keeps being told like a book, the story is really good, from\nbeing a coma victim trying to remember it tricks you into thinking that\nhe's a good guy but he isn't.<br><br>he finds out who he is by himself and foils his own plans for the\nbetter of it, the ending is beautiful.<br><br>I Loved it, you will be blown away, and put on your seat like if some\npowerful force of Exhilaration is holding you till the mind twisting\nend.<br><br>Liam Neeson is the new Clint Eastwood.\n"},
{"review": "\nThat does it. This being basketball tournament season, I am calling a\ntechnical foul on the 'Unknown' bench for creating a confusing and\nconvoluted screenplay designed to befuddle audiences and that is too\nclever by half. A scientist (but he's not) checks into a hotel with his\nwife (but she's not), gets into a car crash and becomes nobody. Got it\nso far? Didn't think so. From there on it gets confusing.<br><br>Before we get even farther afield, let's just say that the picture is\nsaved by the charismatic presence of Liam Neeson, who plays his part\nwith two of his best assets, his sincerity and his earnestness. He is\naided in his earnest sincerity by two excellent performers, Bruno Ganz\nas a dying psychiatrist and by Frank Langella as the 'heavy'.<br><br>I guess it is worth seeing, and maybe you are quicker on the uptake\nthan I am (I think it all started to come together on the way to the\nparking lot).There was just so much contrivance and improbability for a\nhigher rating - but they at least had the right cast.\n"},
{"review": "\nI walked into the dark cinema room today, skeptical about this film,\nread some of the reviews and checked out the trailer - I wasn't\nconvinced but I watched it anyway.<br><br>At first this film was getting a little boring, dragging along. I\nthought it was going to end soon. The story seemed weird and I just\ndidn't understand it.<br><br>But then... with an interesting plot twist, the movie picks up and it\nreally gets exciting. I actually jumped a couple of times.<br><br>Liam Neeson gives us an incredible performance.<br><br>You really just need to watch this film to see how good it is.\n"},
{"review": "\nThis is a very well done thriller. It's good to know there still are\ngood stories out there to be made. Great on location European feel. The\ncast is all superb. Its a bit like 'Frantic' but more action based\nalthough not as over the top action as 'Taken'. The always earnest Liam\nNeeson is a good central figure. Diane Kruger is really getting to be a\nvery good actress - totally believable and with just the right amount\nof European accent to be understandable. January Jones is the ideal\nbeautiful good icy Hitchcock blonde. Good to see Aidan Quinn in a big\nmovie again. Good satisfying storyline that doesn't confuse or have\nsilly red herrings. The German supporting cast is good too. Berlin\nlooks pretty miserable in the winter though. A must see for 2011.\n"}
]