[
{"review": "\nThis superb sequel surpasses the excellent original in every department\nand quite simply you won't see a better action film. Set 15 years after\nthe original Arnie may return as the good Terminator trying to protect\nJohn Connor but he's a redundant piece of scrap metal compared to the\nT-1000.<br><br>The opening hour and the last half hour is absolutely breathtaking with\naction sequences that still remain unsurpassed. Their's also a\nwonderful piece of storytelling 3/4 of the way through where Dyson\nrelises the terrifying consequences of the project he's neglecting his\nfamily for.<br><br>The performances are memorable particularly Linda Hamilton's Sara\nConnor and simply put, they'll never make a better action film.\n"},
{"review": "\n\nTerminator 2 is the best film I have ever seen hands down. It surpasses the\noriginal in almost every way except the first film had a darker moodier\natmosphere. But Terminator 2 has much much more, more character development,\nbetter acting strong direction, and THE most amazing visual effects ever!!!\nCameron's and Schwarzenegger's best movie. A true classic.\nThe Best!!!\n"},
{"review": "\n\nWhat can I say about \"Terminator 2: Judgment Day\" that hasn't been\nbetter said already? All I can say is that when I first saw the movie\n(at only 9 years of age) it had an effect on me. It blew me away! It\nopened up my eyes, and even at the tender age of 9, made me realize\nwhat I wanted to do with my life: I wanted to make movies, and I wanted\nto make movies like \"T2\". <br><br>As I'm watching the film, I glance over at another patron and this\nwoman, her eyes wide, was gripping the arms of her chair so tightly I\nthought they were going to break. When I saw that reaction, that\nmind-numbing, adrenaline rush of pure excitement, knowing that that\nmovie had them completely, that is when I knew I wanted to make movies\nand give people that same reaction.<br><br>And now, over 10 years later, \"T2\" is still my favorite film of all\ntime and I watch it religiously. I have written several scripts and\ntreatments all because of \"T2\" and I have tried to match that exquisite\nbalance of wonderful story/interesting characters/jaw-dropping\neffects/non-stop action.<br><br>\"T2\" was the sole-guiding factor in my life - because of it, I KNEW I\nwanted to make movies in any way, shape or form.<br><br>If you'll excuse me, I seem to be running out of air. Gotta watch \"T2\"\na little bit more...\n\n"},
{"review": "\n\nI am not a big fan of sequels,as most of them disappoint,but\nT2\ncertainly does not.In fact,it's a rare case,at least in my\nopinion,\nof a sequel actually surpassing the original film in terms\nof\ngreatness.As in 99.9% of his films,Arnold Schwarzenegger is\nthe\ngood guy once again,but you don't mind once you witness\nthe\nincredible villain performance of Robert Patrick.This film is\nnothing\nshort of a beginning to end thrill ride.Let us not forget\nthe\ntalents of Linda Hamilton and Edward Furlong,who gave great\nsupporting efforts.Thumbs up!\n"},
{"review": "\nGreetings from Lithuania.<br><br>WOW! The best word that describes this movie is \"wow\"! Not only to say\nthat this is the best Action movie of all time, this is probably one of\nthe greatest movies ever made . The people in my country watched this\nfilm when there where limited VHS cassettes at all. And again, my\nfavorite Director did an timeless epic-masterpiece. Yes, an epic. Every\nscene in this movie is beyond the perfection. The timeless plot.\nGroundbreaking effects. Unforgettable \"Hasta la vista, baby.\" .<br><br>Perfect direction for a sci-fix action film. When the action starts,\nyou're in for the ride of your life. There never be the same movie like\nT2. What else I can say about this film? A Must see for everyone.\n"},
{"review": "\nI adore this movie. I could never stand action movies, but T2 is so\nintelligent and moving that it stands apart from everything else.<br><br>First, the story - brilliant, smoothly making the necessary transition\nfrom T1. The dialogue runs the gamut from hilarious to heartbreaking,\nbut always strikes exactly the right chord.<br><br>The cinematography and effects are stunning, especially the scenes\nfilmed during \"magic hour\", when the pale gold of sunset casts a\nmeaningful and lovely effect on the scene. Being the first $100 million\nmovie naturally the effects are remarkable for their time, but they\nhold up wonderfully against anything made today.<br><br>It's the actors, however, who steal the show. Linda Hamilton can play\ninsanity and despair like nobody's business, and she gave her all here.\nRobert Patrick was wonderful in the demanding role of the T-1000,\ncreepy and threatening even during the funny finger-wagging moment.\nArnold Schwarzenegger balances non-stop action with a machine's\nemerging humanity; frankly this movie cancels out every dumb action\nflick he ever made. New-comer Edward Furlong carried the film with\nseeming ease, giving an astonishing performance for his age and lack of\nexperience; the \"We're not gonna make it, are we?\" scene is hauntingly\nperfect.<br><br>James Cameron and his team have given us a classic that has something\nfor everyone. You'd never know that this is the guy who made Titanic.\n"},
{"review": "\n15 years on and still Terminator 2 remains a turning point in cinematic\nhistory introducing the world to photo-realistic computer generated 3D\nrendering. To this day, this is still an astounding achievement,\nhowever (ironically) these are the things that re-watching the film\nnow, you notice as not being to the standard we now expect films to be.<br><br>As a result of this, you're then forced to look beyond the graphics in\nsearch of other quality. When I last watched it (about 3 weeks ago),\nsomething stood out to me that never did before because of no longer\nbeing mesmerised by the graphics.<br><br>This was the interactions between characters who are gritting, no\nnonsense, hard edged people, but those who care deeply for one another.\nIn particular, I'm referring to Sarah and John Connor, but also to the\ninhuman T-101 in all it's programming trying to humanise itself (at the\ndemand if John).<br><br>Though these might sound like day to day interactions (pardoning the\nwhole terminator and robotic elements here), but to put them onto film\nand not have them feel forced or contrived is quite a feat, and all of\nthese were achieved far above the expectation of one watching an\n\"action\" movie. You truly believe that John is devastated to have to\nlose T-101. You can tell he's fearful about Sarah going off to kill the\nman who would kill the world, unwittingly.<br><br>I urge you all to sit down and watch this film again. You will remember\nthings you've long since forgotten, and maybe appreciate something you\nnever even noticed was there before.\n"},
{"review": "\nAfter failing to kill Sarah Conner, the Machines are now trying again,\nonly this time their after John Conner himself, as a boy. Sarah Conner\nis labelled insane after trying to burn down Cyberdyne Systems, the\ncompany that hid the remains of the first terminator she destroyed, and\nshe is committed to a mental institute. John Resents his mother for the\nway he was brought up, and now lives with his foster parents.<br><br>Again the machines send a Terminator the T-1000, but the resistance\nhave one of their own. Sent back to protect John, Arnie is the same\nmake and model, but has a new mission, this time he's on our side.<br><br>Is Arnie a match for the new T-1000, a liquid metal terminator that can\nmorph into anything it samples by physical conduct. Groundbreaking\nspecial effects and non stop action sequences ensue as the war between\nTerminator's boils into one of the finest action movies of all time.<br><br>Simply Brilliant in every way.<br><br>10/10\n"},
{"review": "\nThis movie is perfect...seriously. That's a dangerous thing for a\nreviewer to say, but there it is. The effects are great (maybe not as\nground breaking as they were back in the day, but they work, and they\naren't overused). The story is gripping and original. The acting is\nspot on, and ABSOLUTELY EVERYTHING MAKES SENSE. There are no \"why would\nhe do that\" or \"why is she so ripped?\". This movie is so tightly\nconstructed that the audience can suspend their belief and get\nthoroughly enraptured in it.<br><br>Edward Furlong deserves the \"Christian Bale Child Actor of the Year\"\naward. His portrayal of John Connor is vulnerable, intelligent and\nlovable. Linda Hamilton becomes her character utterly, body (0% body\nfat) and soul. And Arnold Schwarzenneger appears in the role he was\nborn to play. He is remarkably engaging and (dare I say it?) comedic,\nfor a man playing a machine. His performance is utterly believable.\nRobert Patrick (who doesn't have much charisma) is perfectly cast as\nthe stone cold killing machine who looks like an everyman.<br><br>This movie is thoughtful, exciting and epically good. See it.\n"},
{"review": "\nGood Stuff! This movie is perfect. What else can I say? Arnold is back\nas the Terminator and this time his mission is to protect John Connor\nfrom another terminator, the T-1000 played by Robert Patrick\n(awesome!).<br><br>At first I was afraid that John Connor would ruin the movie as the\nannoying kid we see in many movies. I was wrong. As the focus lies on\nthe chase between the two cyborgs and by the way, Arnold has never been\nthis cool!(taking movies as Predator, Conan, Commando and T1 under\nconsideration) <br><br>Having him on his Harley with the shotgun is priceless! Every aspect of\nthis movie is awesome and this is my number 1 movie of all time. There\nisn't a single lame scene which gives you a ride you will never forget.<br><br>10/10 is an understatement...\n"},
{"review": "\n\"T2: Terminator 2\" or \"Terminator 2: Judgement Day\" is truly an example\nof how sequels can be better than the original.Here we are given more\naction, more special effects, more interesting characters, and a better\nterminator.It is truly a special and crowning achievement for\ndirector/producer/writer James Cameron.It's a film that knows how to\nmake action sequences exciting and how to add some humor into\nthem.That's something you don't get very often.I'll admit that the\nfirst movie was great, but it's mediocre compared to the greatness of\n\"T2\".The movie's key success is Arnold Schwarzenegger.Never will there\nbe an actor who will do a better job as the terminator, for Arnold does\nit so perfectly that you think of him as a machine and not just an\nactor.I'll also admit that the villain is also a key role in the\nmovie.Robert Patrick plays his role with lots of potential and you\nactually care that he's in the movie, even though he's a\nvillain.There's also Linda Hamilton.She returns to her same old role as\nin the first movie, Sarah Connor.In the first movie, she just seemed\nlike an ordinary person who's being chased by a killer machine.Here,\nshe's a tough and smart character that never bores you and always keeps\nyou interested when she's on the screen.Then there's the action and\nspecial effects.Outstanding, just outstanding.The film was made in the\nearly 90's, and the effects are really this good?It just amazes me how\nCameron knows how to put these great characters in these exciting\naction sequences.<br><br>To put it in a couple of words, this is a GREAT movie.\n"},
{"review": "\nWithout a doubt, \"Terminator 2\" is one of the best movies ever made and\nperhaps the very best action film bar none.<br><br>The concept is absolutely superb and the execution could not have been\nbetter. It is indeed a sequel, but it can be watched without seeing the\noriginal because it really plays out as a stand alone movie. <br><br>The Terminator is a great character and the way that John interacts\nwith it is really beautiful. The cast is all wonderful and could not\nhave done a better job with their roles. Linda Hamlton is great as a\ntough, strong woman, Arnold is great as the machine that has a hard\ntime understanding humans, Edward Furlong is great as the wide-eyed\nteen who is fighting for his life, and Robert Patrick is great as an\nemotionless killing machine. Everything is just so right.<br><br>Another thing that I must mention is the special effects. They were\nabsolutely astonishing for the time. We had never seen anything quite\nlike it in a movie before. Even today the effects are great. <br><br>Individual scenes are all so memorable with this movie. From the\nmotorcycle chase, to the hospital escape, to the liquid metal scenes,\nto the introduction of the Terminator, to the final battle and\ndestruction of the terminators, everything is so perfect and memorable.<br><br>The end is so great as well. I'm pretty sure I shed a tear when I first\nsaw it and when the credits began to roll with the road in the\nbackground after Linda Hamlton's monologue, I couldn't take my eyes off\nthe screen. It is that moving.<br><br>If you have not seen this, everything else should be put on hold and\nthis should be priority number one.\n"},
{"review": "\nThis is a real piece of work. You cannot imagine a more excellent\nscenario and directing than these. The whole atmosphere and the\ncombination of steel and blue color really keeps you at the edge.<br><br>Cameron proves once more that he is a real genius with the camera as\nhis work really moves you deeply.<br><br>The casting selections seems to be very strict and finally very\naccurate. If Cameron could work on the sequels, I believe we would\nwatch a trilogy better than \"The Lord of the Rings\".<br><br>I must have seen this movie over 70 times :P. I believe is one of the\nbest of its kind.\n"},
{"review": "\nThis is one of the best action movies ever made. The story line isn't\nanything revolutionary, it's practically the same as the first\nTerminator. The only difference is how it is told. This is one of the\nbest examples of how powerful a good director can be. It was the most\nexpensive film ever made at the time, and well worth it. It received\nacross the board thumbs up and broke box office records. The next most\nexpensive movie ever made in chronological order was Water World - a\nturd. You know how some movies are good but you have to try really hard\nto pay attention for the first 30 minutes? full review at\nhttp://classiccinemaguide.com/terminator2\n"},
{"review": "\nTerminator 2 is by far better than the first. But what really makes T2\na stand out is the important message behind it: \"If a machine can learn\nthe value of human life, maybe we can too.\" T2 shows the horrors of a\nnuclear bomb, and what we can do to each other. Even though a lot of\nscenes are action packed, some are surprisingly touching, such as the\nlast scene with Terminator, Sarah, and especially John. All of the\nperformances were dead on, and the action is relentless. The special\neffects are damn good, even to this day. Some memorable quotes, like\nthe one about human life, and of course, \"hasta la vista, baby\" help T2\nstand the test of time; it's hard to believe it's already been 15 years\nsince this was first released.<br><br>10/10. An astounding action movie.\n"},
{"review": "\n\nThis is many Terminator fans' favorite installment, but I don't believe it\ntopped the original.  Maybe I just liked seeing Arnold as the bad guy for a\nchange in that movie, but it just seemed funner.<br><br>T2 soars on many levels.  Special effects to knock your socks off, but\nsometimes less is more.  Arnie in the original I thought was more menacing\nthan the T-1000.  It could be Arnold's mere appearance to\nhowever.<br><br>The chase scenes in this movie are awesome, as is the exciting\nclimax.<br><br>***/****\n"},
{"review": "\nTerminator 2: Judgment Day surpasses The Terminator on every level. It\nhas cool action scenes, great acting, and some of the best special\neffects I have ever seen in a film. The T-1000 is one of the best\ncharacters I have ever seen, because the special effects on the\ncharacters are so incredible, it makes it seem like it was done in real\nlife, not in a computer.<br><br>Arnold is great, and better than he was in Terminator. I also enjoyed\nthe actor who played John Conner, Edward Furlong. Little did we know\nthat Christian Bale would be playing him nearly 17 years later. I also\nlike Linda Hamilton as Sarah Conner, and Robert Patrick as the T-1000.<br><br>Overall,Judgment Day is one of the best sci-fi thriller I have ever\nseen, and would go on to become one of the best movie sequels of all\ntime.\n"},
{"review": "\nThis is probably the best Action film of all time. It has all the\ningredients for being considered the best of the best.<br><br>First of all, back in 1991, this was the \"ultimate\" movie with\nspectacular f/x and action sequences. Nowadays, the movie does not look\ndated and still manages to shock me with it's surreal nightmarish\npost-apocalytic settings and monstruous robot action.<br><br>The f/x are great, great but that's not the best thing about the movie;\n\"Terminator 2\" spends a lot of effort on the fantastic plot and\ncharacter development. There's no need of extreme use of f/x because\nthe characters have interesting backgrounds and you really get into\nthem. The plot is simply great. It's a futuristic tale involving the\nend of the world at the hands of technology and at the same time, a war\nbetween humans and machines.<br><br>The action is non-stop and lets you wanting for more. I couldn't have\nenough of Arnold and co., spectacular guns, amazing explosions, and\nmemorable chasing sequences on the freeway, motorcycle, etc. This movie\nranks high on the fun factor and entertaining factors.<br><br>Arnold Schwarzenegger delivers a kickass performance. Every time he\nsays \"Hasta la Vista Baby!\", \"No Problema\", and the other trademark\nlines my skin crawls. It's part of pop culture and fits perfect for the\nmovie's feeling. Linda Hamilton who is sexy as hell delivers a brave\nand solid performance. Special mention for Edward Furlong who delivers\na great performance. But Robert Patrick steals the show as the villain.\nHe was impressive.<br><br>James Cameron created one of the best movies of all time and brings us\nthe best possible action ever seen on movies. Also, there's room for\nglorious gore and non stop violence.<br><br>Not else much to say but, I truly recommend it for everyone. It's one\nof those movies that will change your point of view towards cinema.\n"},
{"review": "\nWhat a movie! I have seen it so many times on VHS,CD,DVD.But for couple\nof years,I have been disappointed.I have noticed that when I watched\nthe movie on a CD,there was a scene where Linda Hamilton opened the\nprocessor from inside Arnold's head and Arnold was dead temporarily.But\nsince then I have seen the movie on so many channels and on DVD,but\nthat scene was not shown . Was the scene deleted from the movie?I think\nit is a very important scene.Because at that time Linda could destroy\nthe terminator.But she kept him alive(John helped her)since they need\nhim or it to be alive.But this very important scene is vanished.I don't\nknow why it happened,there may be some reasons.I am steel searching the\nscene.<br><br>I am mad about T2.Please please tell me where is that scene? How can I\nget that scene? Is there any DVD where this scene is included?<br><br>Please please help me.I am crying.please E-mail me. kosto8376@yahoo.com\n"},
{"review": "\nThere are many people who call T2 the best sequel to date, others claim\nit is the best SciFi flick they've ever watched, but I would like to\nsay: I never felt as privileged to be shown a movie as with this one.\nThere are of course the more obvious fields in which this film excels,\nlike mind-blowing special effects (especially for the time when it came\nout) and acting at its best (thanks Linda!), but there is so much more\nto it! A unique, original and very becoming soundtrack, cinematography\nthat makes every still a picture to be hung in a living room and James\nCamerons virtually unmatched direction. All these factors combined\nwould make a fantastic movie alone, but this one's got more: Heart,\nlove and an unforgettable story. To see that so much emotion, reason\nand art can be expressed through a movie of the SciFi/Action genre that\nis stunning and entertaining at the same time - this is the ultimate\njoy of being into the movies.\n"},
{"review": "\nThis a true masterpiece, a real piece of gem. The action is top-class,\nthe plot is engaging. The tension and thrill builds to such an amazing\nlevel that one gets totally engaged to what happens to the characters.\nThe spectacular special affect adds to the story and the action. There\nare very few movies where the special affect takes the action to the\nnext level and this is one such movie. I have watched this movie\nseveral times and every-time I have enjoyed it to the fullest. It is\none of my most favorite movie. A must see for any action movie fan. <br><br>If you have not seen it, go and do yourself a favor...Watch it. I\nhighly recommend this movie.\n"},
{"review": "\nTerminator 2 is an amazing action packed movie from writer / director\nJames Cameron. Arnold Schwarzenegger is at the top of his game\nreturning to play the cyborg the T-800, his most famous movie role.\nJames Cameron's love of Science Fiction and action coupled with the\nlatest film making technology pushed the boundaries in 1991 to their\nlimit. James Cameron uses classical action shots that allow the viewer\nto see what is going on at all times, something newer film makers/\neditors should pay attention to. The reason this film works so well is\ndown to the story itself and the concepts it deals with, James Cameron\nalways writes interesting stories for us to think about but were he\ndiffers to 99% of other directors is he merges this with jaw dropping\nset pieces filmed with energy, often a moving camera shot he totally\nunderstands that this is an entertainment medium, he never forgets\nabout his characters though and this why his films always have heart.\nTerminator 2 is one of the best action / science fiction films of all\ntime, James Cameron is the best action director of all time and\nTerminator 2 is proof of that.\n"},
{"review": "\n'Terminator 2: Judgment Day' is THE Best Action Film Ever. I've seen\nthis film numerous times, and it gets better each time I revisit it.\nJames Cameron &amp; Arnold Schwarzenegger have NEVER Been this Good! <br><br>'Terminator 2: Judgment Day' Synopsis: The cyborg who once tried to\nkill Sarah Connor must now protect her teenage son, John Connor, from\nan even more powerful and advanced Terminator.<br><br>'Terminator 2: Judgment Day' is Superb ENTERTAINMENT. Its so good, that\neverything works on its advantage. Be it the Script, Direction,\nProduction-Value, Performances, Action/Stunts, Editing, Graphics or\neven the Music, everything is so darn good. Its truly amongst THE\nFinest Films of all-times.<br><br>James Cameron &amp; William Wisher, Jr.'s Screenplay is Awesome. Cameron's\nDirection is Masterful. Graphics are Terrific. Editing, Cinematography,\nProduction-Value, Music, everything is just Perfect. <br><br>Schwarzenegger is impeccable the Terminator, playing the unbeatable\nhero to the hilt. Robert Patrick as the T-1000, the villain, is\nbrilliant. Linda Hamilton as Sarah Connor, is impressive. Edward\nFurlong as John Connor, is lovable. <br><br>On the whole, 'Terminator 2: Judgment Day' Rocks! Its a Knock-Out!\n"},
{"review": "\nAfter watching every Terminator movie, I can honestly say this one is\nthe best: a sequel that surpasses the original, the landmark that\nsequels are compared to. The plot is tight, logical and constantly\nsurprises you (compare to the plot problems in Terminator Salvation).\nT2 can even be seen before all others as I did many years ago as it\nstands by itself. The cinematography and camera shots are beautiful.\nNotice the color schemes particularly in the asylum (blue-gray) and the\nfoundry (orange-red). The \"visions\" scenes are very inspired and\nmemorable. The action is intense, engrossing and escalating as it\nshould be. The visual effects are very impressive and were\nrevolutionary back then, especially anything involving the T-1000. The\nactors are top-notch particularly Linda Hamilton who shines in the\nstrong yet fragile, tough yet conflicted Sarah Connor, the role of her\nlife.<br><br>The terminators, supposed to be unemotional, are quite cool, menacing\nand relentless yet fascinating. The interactions between John Connor\nand the terminator are wonderful and add depth to both characters.\nAfter seeing T2 for the first time, I was so awed by Robert Patrick's\nperformance that I kept looking for him in other movies. Everything is\nin the physicality and the deliberate movements with no small nod to\nthe talents of the director. Compare the T-1000 to the terminatrix in\nT3 who for some reason was much less memorable. The music is much\nbetter and grandiose than the first (such a good percussive theme) and\nthe sound effects are so good they won 2 academy awards. Let's finish\nby mentioning the powerful unforgettable ending that is not only moving\nbut ties up neatly the loose ends. There's actually something big that\ndoes not make sense (darn time travel paradoxes) but even after seeing\nT2 more than once, it just doesn't bug you when you actually watch the\nfilm. It's definitely worth buying but be careful with the different\nDVD editions. <br><br>Rating: 9 out of 10\n"},
{"review": "\nReview based on the Special Edition cut: <br><br>In 1984 young director James Cameron took us into a new world with 'The\nTerminator,' a film that was a great success. Two years later he would\ndazzle us again with 'Aliens.' He had proved he was no one hit wonder,\nbut the 1980s would soon be over and one burning question remained:\nWill there ever be a 'The Terminator 2'? Fortunately for those of us\nwho cherish the original that day came 7 years after that films release\nand the world would never be the same. This sequel, the first of a few,\nturned out to be bigger and took the concept farther, which is exactly\nwhat a sequel to a Science Fiction classic should do.<br><br>Pros: Excellent work done by the cast. Compelling score. Dazzling\nspecial, mechanical, and visual effects. Beautifully photographed.\nMoves at a good pace. Like the original this film has some real heart\nand intelligence in it. Successfully builds on the mythology started in\nthe original. Some solid action sequences and set pieces. Good humorous\nbits. Director/co-writer Cameron once again impresses and has a great\nhandle on the action and drama.<br><br>Cons: You really have to suspend your disbelief at times. Not many, but\nsome effects don't measure up, especially the dummy used for Arnold\nSchwarzenegger.<br><br>Final thoughts: Fans of the 1984 original had to wait quite a while for\nthe story to continue and I think we were greatly rewarded. It's lucky\nthat the original creator returned to continue this and that the studio\ncared about the quality of the film. This film could have been just an\nattempt to make lots of money, which it did, but unlike so many\nblockbusters it's more than just big explosions and mind-blowing\neffects.<br><br>My rating: 4.5/5\n"},
{"review": "\nI am a 11 year old fan of the first 2 Terminator films(I hated T3).\nEven though these films are Rated R, I am allowed to watch these\nfilms(One of the few R rated film series I am allowed to watch). It is\na fact that is this is the best of the series. And I agree with that\nfact. Terminator 2 is the second best time travel movie. The only time\ntravel movie that is better then this is Back To The Future. This is\nalso the second best sequel. The only sequel that is better then this\nis THe Empire Strikes Back. This is better then Terminator 1. Yep you\nheard me. This is better then the original and thats a fact. It has\nsome humor. It is not as violent as the first one. It is more of a\nSci-Fi picture then the first one mainly because of the T-1000. This is\nmy 5th favorite film ever. John Connor is a cool 10 year old kid in\nthis film. Arnold Schwarzenegger's best picture. MPAA Rating:R. My MPAA\nRating:PG-13. I love this film because of it's plot, it's humor, and\nArnold. Some people on the internet bash this film because of Eddie\nFurlong. He is not annoying. Great movie.\n"},
{"review": "\nThis is my favourite film of all time. I am 25 years old. I clearly\nremember when I saw it when I was 10 years old and the thing that\nimmediately struck me even though I was only 10 years old was how\nartistic and brilliantly directed it was. The main reason James Cameron\nmade this masterpiece was not because he only wanted to make money. All\nthe greatest movies of all time deal with an important issue about\nhumanity and T2 is no exception. It deals with how humanity has a\ntendency to destroy itself. This is a very important universal issue\nand it affects each of us when we turn on the TV and hear news about\nvarious wars happening around the world. This masterpiece works on so\nmany levels that it's truly amazing. It contains some of the best\nvisual effects and action scenes ever put on film. It is a thrill ride\nfrom beginning to end and the great character interaction and drama\nnever stops. During each action scene you always feel that the\ncharacters are fighting for the fate of humanity. By far James\nCameron's best film and that is saying a lot. It's much more emotional\nand dramatic than Cameron's overrated and disappointing Titanic. T2\nclearly shows that James Cameron is most creative and artistic when he\nis making an Action/Sci-fi film. Anybody no matter what age will\nconsider this a great film. It only gets better with time and I love it\nnow even more than when I was 10 years old. Should be in top 10\ngreatest films list. A timeless masterpiece.\n"},
{"review": "\n\nTerminator 2 is not only a mind blowing movie with spectacular special\neffects and unbeleivable action, but cultural phenomenon akin to capturing\nlightening in a bottle.<br><br>Never will such a perfect action/sci fi movie ever be made in the history\nof\nfilmdom.<br><br>The casting of Arnold is perfect beyond belief.  He was born only to play\nthe role of The Terminator.  His minimal dialogue enhances the roles\nmechanical robotic qualities.<br><br>James Cameron is certainly a dedicated filmaker who cares about his work\nand\nthe expectations of the audience.  The only other film that comes close to\nT2 is Aliens, also directed by Cameron.  His use of computer effects to\naugment and supplment the storyline is rarely ever used in todays\noverblown\nblockbusters.  In fact the special effects in T2 are so good that today's\neffects PALE in comparison.<br><br>Robert Patrick is perfect as the predatory T-1000, and will be forever be\nremebered as the guy who gave Arnold a run for his money, as he definately\nattempts to steal the movie in some scenes.<br><br>I am appalled that a T3 has been made without James Cameron.  T3 may be a\ndecent action flick, but it looks embarrasingly juvenille from the\ntrailers\nand TV spots.  Whats with all the sunlight???  Arnold even stated a few\nyears ago he would not do T3 without Cameron.  After Arnolds diasasters\nsuch\nas End of Days (not bad flick) he needed a hit\nand the only way was to bring the Terminator out of retirement, with or\nwithout Cameron.  Thats Loyalty for you.<br><br>T2 is the best action movie ever made, and if you have not seen it yet,\nyou\nhave probably seen paradies, ripoffs, and copies of the movie.<br><br>But watching the original will give an appreciation as to how this movie\nshaped future action movies, as it is groundbreaking.<br><br>I wished James Cameron had made T3, but I doubt he could have topped the\nperfection of T2, and that may be one of the reasons he decided to opt out\nof T3.  \n"},
{"review": "\n\nThis movie is a visual stunner,mate,especially for 1991, To me it's best\nsci-fi film since, since ever, the story is great, the effects are great,\narnold is great, hell everythings great, so get yourself into the car and\nget T2:Judgment Day the ultimate edition on DvD today!\n"},
{"review": "\n\nT2 is a great film but in my view not as good as the original sure the\neffects are better but it loses the dark and brutal look of The\nTerminator.<br><br>The plot is simple\nJohn Connor has been born and is now 10 (I think)\nArnie is a good guy (reprogrammed)\nSarah Connor has gone mental (who wouldn't?)\nT-1000 is the new guy (and he is kind of hard to kill)\nMiles Dyson is the guy who invented Skynet (Although T3 will prove that to\nbe wrong!)<br><br>While running from the T-1000 they decide to stop the war from ever\nhappening.  Although now this was pointless considering that T3 will be\ncoming out in 2002 its still good to see Arnie in all his bad ass gear\ngiving them hell and saying 'I'll be back' to John and Sarah.  but hey its\nstill a great film and the effects still look brilliant ten years\nlater.<br><br>\n"},
{"review": "\nA+ Following the first film came a rare sequel indeed. It is beyond\nrare to find a sequel that takes it predecessor and expands it, deepens\nit, and ultimately surpasses it tenfold. And \"Terminator\" was a good\nmovie all its own. \"T2\" does that in almost every way imaginable.<br><br>With \"T1\" we were left with a lot of unanswered questions, but here we\nget those and more. We have a very good cast rolled out here for\naudiences to enjoy, among them obviously Arnold and Linda Hamilton as a\ntougher Sarah Conner. Edward furlong is the legendary John Connor, a\nrole that I doubt few of that time could fill. I won't drag this on any\nlonger than I have to seeing as everybody's' seen the film by now. The\nthing that sets this film apart from many films is the characters and a\nwell driven story. Most action films are easily forgettable with\ncharacters I could care less about. You're just there for the big\nexplosions. But Cameron develops his quite well. And as the movie nears\nits end, we are left with a very good interpretation of who they were\nand why they did what they did. The terminator undergoes a complete\ntransformation from the first film as a silent and menacing killer to a\nbeing we know is definitely not human but we care for it just the same.\nExuberantly well done. That role is replaced by the T-1000, played by\nRobert Patrick. Even more menacing as than the first one really.<br><br>The action is obviously well played, fresh and VERY intense. Unlike\ntoday's CGI over laden, over the top antics. An unrivaled achievement\nof film history and a legacy that lives to this day.\n"},
{"review": "\nI consider this movie to be a classic, and for good reason. The CGI is\namazing, even for today's standards, and this was released back in '91!\nThe action is explosive, the directing is superb, and the acting was\nvery good, at least believable! Action movies don't require a lot of\nacting, heck even a coherent plot, but this movie delivers both big\ntime thanks to film master, James Cameron. The plot sets back in '91,\nwhere we see the famous \"Ahhnold!\" teleported back in time, not to kill\nSarah Conner or even her son, but to protect them, from the vicious,\nmore advanced T-1000! The plot change is enough to make fan excited,\nbecause now you know your in a whole new better adventure, and not just\nmore of the same. It's actually very touching to see \"The Terminator\"\ndevelop a relationship with young John Conner within the movie as it\nprogresses. I'll admit, I wept a little bit in the end when \"the\nterminator\" sacrificed himself for the good of man kind, and as he's\ndrowning in the pool of lava, he gives a thumbs up to John for a\nmission accomplished, seeming that \"the terminator\" actually has a\nconscience, if not a heart. For me though, I give this movie two thumbs\nway up! The effects are awesome, especially from the T-1000 aka liquid\nmetal, it has the most memorable action/chase scene I can remember in a\nmovie when T-1000 is chasing little John Conner with a big mack truck.\nBottom line, this movie has it all. It's not just a terrific action\nfilm, it's a terrific film period!!\n"},
{"review": "\nT2 is an excellent over the top action packed, insane visuals, amazing\nstoryline, some emotional moments, in other words it had\neverything.Arnold was made for a movie like this, john conner was a\nreally good actor for his age, also Sarah conner his mum, and the\nT-1000, man for a 1991 movie the effects were stunning, all the shape\nshifting and other kinds of stuff he can do were amazing.Nothing to do\nwith terminator 3 or salvation which really where disappointing. It\nalso gives out a message to us humans.And a powerful one to. i don't\nrecommend renting this movie. BUY IT. its worth every single penny. And\ntreasure it for it is really a true gem.\n"},
{"review": "\nnow not many sequels surpass there originals but this one did in my\neyes and in everyone else's eyes for that matter. this movie has gotta\nbe the greatest science fiction film ever made, if not its very close.\ni'm so glad the first film is in the top 250 films of all time, i think\nits around 170. but whats even better is this second instalment of the\nterminator series is at around number 50 in the top 250..... well done,\nit deserves it.<br><br>i'm also really chuffed that this classic won 4 academy awards. goes to\nshow that some action films can grab that many. <br><br>so Arnold Schwarzenegger is back as the terminator which he plays\nbeautifully. this time hes the good guy that has been sent back to the\nmid nineties by the future John Conner to protect himself as he is only\na child in these times. the reason for John sending back the terminator\nthe protect himself is because a very hi tech liquid metal machine\nposing as a human has been sent back to kill John so the resistance\nwould be shattered in the future. the mother of John, Sarah conner is\nin this one too who teams up with the terminator and John Conner to\nkill the liquid metal assassin.<br><br>the first of these films is brilliant but this one exceeds to the next\nlevel and really shows how fantastic this story is and can get for the\nfuture films<br><br>among the cast are Arnold Schwarzenegger (terminator, predator) Linda\nHamilton (terminator) Edward Furlong (american history x) and Robert\nPatrick (cop land, die hard 2) they all play brilliant parts in this\nfantastic sequel<br><br>be sure to watch the first one before watching this because you'll ruin\nthe story. i would recommend anyone to watch this because its not just\na science fiction film...... its a well planned out science fiction\nclassic. just look at the top 250 and you'll see why you need to see\nthis.......... 10/10........j.d Seaton\n"},
{"review": "\nIt seems that James Cameron only knows how to make epics, with films\nlike Terminator, Titanic, True Lies, Aliens, and The Abyss it is no\nsurprise that T2 is considered one of the best action films ever made.\nThe special effects are phenomenal and still hold up today, of course\nyou can see more of the flaws but they don't take you out of the film.\nArnold is just Arnold but he does give more vulnerability to the role\nthan he did in the original and yet he remains bad ass. Then there is\nthe phenomenal performance of Linda Hamilton as Sarah Connor watching\nit again recently I realized how good of a performance she gives in\nthis not just emotionally but how much she really became the character\nphysically. There are so many good action scenes in this that I can't\njust mention one that stands out, but one of my favorites is the\ncauseway chase at the beginning. Last but not least I want to mention\nEdward Furlong's performance this was his first film and you can tell\nthat sometimes he is unsure but the performance grows on me every time\nI watch the movie. If you haven't already seen this masterwork\ndefinitely check it out, and to James Cameron keep the action coming.\n"},
{"review": "\nthis movie was probably the best in the terminator trilogy. it made me\njump up at certain scenes. arnold should win an Oscar. this film showed\nme more about how the terminator really is. i didn't think he would\nprotect anyone but himself. but, in t2 he proved me wrong. this movie\nhad the best action scenes. when the terminator attacked the t-1000\nwith his shotgun i knew who was gonna win. whenever the t-1000 was shot\nwith a powerful weapon in the head it would regenerate. i found it cool\nbut upsetting that the terminator couldn't do that. i also loved the\nway the movie ended because it showed that the terminator also had a\ncaring side to him. i screamed yeah! when the t-1000 was thrown into\nthe lava. when arnold went into the lava i was upset but i knew there\nwould be a sequel. overall everyone in this movie was terrific. catch\nme at my next review.\n"},
{"review": "\nWell the movie is mind blowing,its mind boggling,it is riveting,it is\none of the best movies made by one of the best directors James Cameron.<br><br>Well This time Arnie is the good guy a slomo types terminator who comes\nto protect john Connor from the future and machines send there\nterminator to finish john Connor,Simple story mighty effective.<br><br>Great action sequences lovely direction,get you involved\nstraightaways.man Arnold looked dashing.the other guys acting is quite\ngood<br><br>Linda Hamilton is great too,very powerful,very intriguing,though some\nof the scenes are violent so advice parents not allowing kids to watch\nthis,if you have not watched the movie you must for a single reason\nthat YOU JUST DON'T WANT TO MISS the best action Movie of the decade.<br><br>There's drama,passion.action,humor what else you want.. Rent it and\ncome here to write a review!!trust is God's second name!if not who\ncares but watch it\n"},
{"review": "\nIt is no doubt that T2 is one of my favorite movies and I'm still so\nexciting when i see the toys the DVDs the pictures all about T2 even\nnowadays. When I first touched the Extreme Edition DVD collection, I\nforgot how to breath... What a great masterpiece!<br><br>We can tell lots of reasons to explain why so many people love T2: the\nvisual effects, the acting, the direction and many many other ones. I'm\nvery agree with all of them. We can say that that's just the every part\nof T2 is perfect makes the whole movie so extremely perfect. Because of\nthis, there is no need for me to write all. But I still want to mention\none point, every time I see T-800 drowning down and disappear in the\nend, every time I cannot help being deeply touched. And that's the most\nsuccessful part of the movie I think. It gives machine a heart, a kind\nof sensation. The machine is not only to live for a mission. He becomes\na human's friend, a woman's protector and a kid's father. Although he\ncan never cry.<br><br>When John full of tears, the tear's flowing in my body too.\n"},
{"review": "\nAD 2017--The world is devastated and dominated by machines-with Skynet\nas its dictator. The human resistance fights back under the leadership\nof John Connor.<br><br>However, the machines send a Terminator--a T - 1000--back to when\nConnor is 10 years old; the resistance sends an older model of\nterminators- T - 800--back in time to protect John...<br><br>Present day--Sarah and the T800 now have to protect John from the T\n1000--immensely powerful and relentless.<br><br>The brilliance behind T2 is not just its action--its the story;\ncharacters are well-developed and the T 800 is \"humanized\" in the film,\nlearning to appreciate life as the plot progresses.<br><br>It plays on themes surrounding cloning and life; perhaps a large part\nof the story's aura comes from creating an alternate \"what if\" future\nwhich would have made Phllip K Dick proud.<br><br>If you have enjoyed Blade Runner from the 1980s, T2's story is just as\ngreat and packed with more action !\n"},
{"review": "\n\"Terminator 2: Judgment Day\" is an extremely good sequel to the sci-fi\nclassic \"The Terminator\". Although I like the first movie much better,\nI think the second movie was pretty good for a sequel.<br><br>Arnold Schwarzenegger returns in this film as the Terminator himself,\nexcept this time he is one of the heroes (which made him a big\nHollywood star). Linda Hamilton also returns as Sarah Connor, one of\nthe heroes, and she is much stronger than in the first movie. And Earl\nBoen returns as Dr. Silberman, possibly the most hated character in the\nfirst movie (and in my opinion, even more hated in this second film).<br><br>The new characters introduced are the menacing T-1000 (played by Robert\nPatrick) who is a menacing evil Terminator model, John Connor (Edward\nFurlong) who is Sarah Connor's son, and Miles Dyson (Joe Morton) who is\nthe person responsible for the future war between the humans &amp; the\nmachines.<br><br>This sequel brilliantly focuses on all the main characters very well\n(although not as much as in the first film). A special bond is created\nbetween John Connor and the Terminator towards the end, and Sarah\ndevelops a special bond to her son.<br><br>The special effects in \"Terminator 2\" have improved greatly over the\nfirst film (although I like the first movie's special effects better\nfor some reason). There were some spectacular explosions, and the\nT-1000's \"liquid metal\" effects were awesome and will remind\nhardcore-movie-fans of the watery creature in \"The Abyss\".<br><br>To sum up, there are many great things about \"Terminator 2\".\nNevertheless, it lacks originality in some areas despite some new ideas\n&amp; modern special effects. The original movie \"The Terminator\" was a\nmore original film and was such a classic for its time in the 1980's.\nBut still, the 2nd movie was pretty good for a sequel and it was very\ngood.<br><br>I give this film a 10/10.\n"},
{"review": "\nProbably the greatest science fiction / action film ever Terminator 2\nis almost the greatest sequel ever. That goes to Camerons other opus\nAliens. In fact Cameron is so good at sequels Titanic 2 would probably\nbe something to look forward too rather then fear. Unlike another\nAmityville Horror film.<br><br>T2 takes place several years after the original. Sarah Connor has had\nher child - the young John Connor. Unfortunately she also came off as\nslightly nuts while raving about robots taking over the world and so\nshe is locked up in a mental hospital. While this is happening another\nTerminator has been dispatched, this time to kill John himself. The T\n1000 is a liquid metal Terminator capable of reforming into different\nshapes. Thankfully to combat our meltable foe Arnie returns, this time\nas the good guy to protect John and his mother.<br><br>Its hard to review Terminator 2. Its just far too good for words. The\nvillain played by Robert Patrick is probably the most villainous of all\nvillains, the action is probably the most action packed of all action\nsequences. Plus it will also make you cry at the end. An action film.\nSeriously. OK just me then. Still a kind of bizarre situation where you\nfind yourself close to shedding tears for a toaster with legs. But\nTerminator 2 manages it. In fact you feel Terminator 2 could do\nanything and get away with it. A bit like a woman in that respect.<br><br>I don't know how Cameron created my two favourite films of all time.\nI'm sure God had something to do with it. Id like to thank him but I'm\nfar too bust watching this film to pray.\n"},
{"review": "\n\nAfter the release of \"Terminator 2: Judgment Day\", we all knew James Cameron\nwas the best director for sequels. He had already proved that a sequel could\nsurpass the original with \"Aliens\", but with this one, he took it to a whole\nnew level. The story of the 1984 hit thriller \"The Terminator\" is about a\ncyborg machine sent back through time to kill the future-mother of a\nmilitary leader who will supposedly, take mankind to victory against the\nmachines in an upcoming war. \"Terminator 2: Judgment Day\" takes us about 13\nyears later. Sarah Connor is now in a mental institution after trying to\nblow up Cyberdyne. Her now-born-son, John Connor lives with his foster\nparents. But when a terminator called T-1000 comes to kill John, his only\nhope lies with the same terminator that once tried to kill his mother.\nTogether, they will help Sarah to escape from the mental institution,\ndestroy Cyberdyne to avoid judgment day and fight a metal-liquid made\nterminator, that seems invincible. \nWhat is so great with this movie is two things: the special effects and the\nscript. James Cameron truly wrote a script superior to the original ad added\nmore depth to the story. The special effects by Stan Winston are truly\nremarkable. They introduced CGI Animation to the world, long before <br><br>\"Jurassic Park\" or \"The Matrix\", to create some of the most impressive\nstunts and effects ever made with a movie. If James Cameron hadn't\ndone\"Titanic\" a few years after that, \"Terminator 2: Judgment Day\" would've\nbeen his masterpiece. Arnold Schwarzenegger gives his best performance in\ncareer as the good terminator to battle the invincible T-1000, played\nremarkably by Robert Patrick. \n\"Terminator 2: Judgment Day\" came out on July 3rd, 1991, and took in more\nthan $500 million worldwide, including $204 million in the U.S. alone. It\nwasn't only a movie, it was a phenomenon. I give \"Terminator 2: Judgment\nDay\" a very good 9.5/10      \n"},
{"review": "\nI will always enjoy watching this film for all sorts of reasons. I\nreally cannot find fault with the result, granted a lot of money was\nspent making it but for a pleasant change the money was well spent. It\ndoes help to see the first film first but in my opinion it stands on\nits own as a great film therefore it is not crucial. The quality starts\nat the beginning and continues throughout its 2 hours 20 minutes. I\nseem to recall Terminator 2 getting a cool welcome and mixed reviews at\nthe time of its release in England. Fortunately the vast majority of\npeople who have seen this film rate it very highly. This film has\neverything anyone might want from it, everything for me just feels\nright. I have read a lot of the reviews of this film and most of them\nare very eloquent about its contents and wax lyrical about this or that\nor all of the bits that make it up. I simply look at the whole and it\nis greater than the sum of its parts which I know isn't logical but it\nreally is extremely enjoyable to watch. Like all great films the viewer\nneeds to pay attention to the detail, it is well worth the effort,\nbecause it is clear that a great deal of time and effort went into the\nmaking of this film and all of the team that were responsible for the\noutcome should be satisfied on a job well done. I highly recommend\nanyone watch this film and you will probably find yourself watching it\nover and over again. The quality doesn't dissipate through repeated\nwatching, for me a sign of a quality product.\n"},
{"review": "\nLet me start by saying what everybody has already said, the acting is\ngreat, the story great, the effects awesome, the characters believable,\nthe action brilliant. I don't know a soul who doesn't like this film.\nMe personally, I though this would just be another shame to the\noriginal, make lots of money, and throw in some effects just to make a\ngood profit. But I was wrong in every sense of the word. James Cameron\nhas come over and beyond, not just mine, but everyone's expectations\nand has put together a film that doesn't just focus on action or\neffects, but focuses on the characters as well. Which is why I like\nolder movies better than newer movies. The thing about older movies is\nthat since back in those days, there was no such thing as CGI, so\ninstead of making the monsters or whatever look real and convincing,\nthey made they characters convincing as well. Now, we could make a\nmovie that is entirely CGI, and the problem with that is, that instead\nof focusing on the characters, they focus more on making the monster or\nwhatever as real as possible, but they forget about making the\ncharacters real. I like this film because it's the on in a million that\nhas good effects, and good characters.\n"},
{"review": "\nTerminator 2: Judgement Day, just the name brings goosebumps to me.\nThis is without any speculation the best movie ever made. I never get\ntired watching this amazing film time after time. This is one of my\nmost favourite films. Schwarzenegger made the character,'terminator'\none of the most memorable characters in film history. His action timing\nand the quote-'Astala Vistala baby' will haunt u for years.Furlong and\nHamilton also did a fairly good job but still Arnold was undoubtedly\nthe main attraction. Robert Patrick's character may even be called the\ngreatest villain of all time because T-1000 was as deadly as an atom\nbomb. And last of all James Cameron took the terminator franchise to a\nmilestone after the fairly good part 1(The Terminator in 1984). The\naction is mind-boggling along with a lot of emotions and a very good\nplot line.This movie surpasses every GR8 movie including Godfather,Dark\nKnight,Star Wars etc. A must see picture for people of all ages. The\nGreatest movie ever.\n"},
{"review": "\nThe movie of my childhood! What else to add? .. It turns out that there\nis. I can not say that he was, so to say, \"grown\" in this movie. Net.\nBut I remember perfectly, as requested by his or her parents to allow\nme to see him. As they agreed, but only on condition that I have a good\nnight's rest day because the film was shown late at night. Remember, as\nI discuss every minute detail of this film. What's surprising is the\nsame, and I can say about the second part of the film. Therefore, do\nnot be surprised to find exactly the same comment. Well, what else to\nadd? That this film was good and challenging? So it is and so everybody\nknows. What he is the originator of \"downsizing brains\" whole\ngeneration. It is already known to me. To that ... that ... that ... it\nis endless. But it's best to describe the movie will be like: a Movie,\nwith a capital letter. This film aware of the existence of which should\nbe educated to all people of our planet. More nothing to add.\n"},
{"review": "\nTerminator 2 is no doubt the Greatest Schwarznegger movie of his\ncareer. Arnie has given us great movies before like Commando, Predator\nand Total Recall. Arnie will always be Popular for his role as the\nTerminator. Terminator One was a great Movie and a Great Start the made\nArnie a Star. Terminator 2 went 10 steps ahead to make one of the Best\nSci Fi Movies of all time. Over 2 hours of non stop entertainment. I\nremember when i saw T2 when it first came out in 1992. At that time,\nthe graphics in T2 were out of this world. Everybody wondered how did\nthey do that with the T1000. If you see this movie just recently, you\nwont be so surprised. It was the movie everybody was talking about in\nschool. T1000 was a great Villain, its a shame the creaters on T3\ncouldn't compete with it. T3 was the worst out of the trilogy. Arnie\nwas like a side kick in T3. T2 is one of the finest films ever made.\nMust See\n"},
{"review": "\nEven after fifteen years since the film came out, the special effects,\nand intensity still roar and excite to this day.<br><br>Arnold Swartzenagger leads the cast in a brilliant tale of futuristic\ncyborgs, and robots sent from the future to terminate in the past.<br><br>If you've seen the first film, then you'll be able to follow the sequel\nmuch better, but to be honest, you don't really need to see either the\nfirst or third to follow this one. And, quite frankly this is the best\nof the three. I'm not really much for science fiction, but this is one\nof the few that I really do enjoy. Robert Patrick gives a chilling\nperformance as the 'bad' robot sent to destroy John Connor (Edward\nFurlong), and terminate T-1000 (Swarzenagger), who is ironically there\nto protect the son of the woman he was sent to kill in the last film.<br><br>The whole film is almost non-stop intense, and there are times when\nyou're heart will jump out of your chest, because it gets so nerve\nracking.<br><br>Edward Furlong, in his debut role, gives an amazing performance as the\nson of Sarah Connor, and the leader of the future.<br><br>I would give it a 10, however, there are times when the movie tends to\nslow down, for long periods of time and can get a bit boring. However,\nthe rest of the time it's nothing but thrills and nerves at your\ndoorstep, for an entertaining ride in the future, past and present. A\ngreat sci-fi film, that will never let you down.\n"},
{"review": "\nI know, whatever I say about this movie it falls short. But when I\nthink about the scenes such as the T-1000's passing through the\nguardrails in the hospital, same T-1000's rising from the ground,\nTerminator's (T-101) voice imitation of John Connor on the phone, once\nagain freezing of T-1000 and of course ... \"astala vista baby\". And so\non...<br><br>These were the unforgettable scenes and subsequently there has been no\nmovie to excess it. This is such a movie combines action and thriller\nunprecedentedly. What a great success. I don't remember how many times\nI saw. <br><br>Congratulations and lots of thanks for making this movie.\n"},
{"review": "\nThis is one of the best action movies ever made. Director James Cameron\nhits the right combination of action and emotion. He proves that there\nis still room in an action movie for some feeling. It expertly switches\nto hard boiled action movie, to making you feel about the characters.<br><br>The Terminator is both killing machine and father figure, the father\nJohn never had. He is always lit in a cold steely blue, which gives him\na hard sculptured look. The sunglasses cover his eyes, giving him no\nemotion. He throws people out his way like rag dolls, they are helpless\nto stop him. Yet, he is helpful to John, his protector.<br><br>We really believe that the T-1000 is an unstoppable killing machine. He\nblends in like a chameleon, unlike the Terminators hulk. It seems that\nthere is no way to stop him. He can change to the form of any person he\nkills. His outward appearance is that of a normal human being.<br><br>Sarah has become a hardened, prepared for the nightmare of the future.\nShe is trapped in a mental institution for trying to blow up a computer\nfactory, for the horrible truth only she believes. She is tortured to\nthe point of appearing insane.<br><br>The cinematography contrasts a hard blue with an orange red, fire and\nice. It sets the mood very well. There is blue light for danger and\nfear and red for love and family.<br><br>The music is like the Terminator's mechanical heartbeat, a pulsing\nrhythmic beat. It uses sampled strings and percussion. It also pauses\nfor an emotional moment.<br><br>The movie is fast pace and pulse rising, but also dramatic and careful.\nOne of the best, an action classic!\n"},
{"review": "\nI write this comment after watching T3 : Rise of the Machines for the\n4th time and it just makes me think that Cameron's movie was not just\ngreat, it was phenomenal in every aspect.<br><br>Discount Arnold's wooden (yet perfect for the part) acting and some\nminor goof ups with the dates (in the present and the future), you have\na movie that not only makes you stay and watch for 2 hours, it also\nmakes you think about war and all its fallouts.<br><br>The very strong woman character in all of Cameron's movies, Linda\nHamilton, in this case is a fine example of how a great director can\ndraw some really good performances from mediocre actors.<br><br>The sound and the SFX in the movie are far too ahead of their times and\nare comparable to some on the movies I see today. All in all, an\nenjoyable film that I promise you will not regret seeing.<br><br>9 stars out of 10\n"},
{"review": "\nI have enjoyed watching the entire Terminator series, I think Arnold\nshould have waited for Jim Cameron to finish filming his Titanic thing.\nAnyway I am in the printing industry and have trained eye for catching\n\"typos\", so when I was reading the back of the box I noticed typo right\naway. I would like to know who to contact so that the next 50 million\nthat get made get made right. I can only imagine the butt chewing the\ntypesetter/proofreader is going to get over this. How many do you think\nthey have made wrong ? 100 million maybe 200 million! I also thought\nthey should have used the same actor from terminator 2 for John\nConnor.The correct line is \"No fate but what we make\", the case says\n\"no feat but what we ma\n"},
{"review": "\nTerminator 2: Judgment Day Is One Of The Best Movie Sequels Ever\nCreated.<br><br>Reason's Why: Characters. The character's are just incredible, They all\nact very well. it seems as if i'm watching something that's really\nhappening. 5/5<br><br>Action: The action is some of the best i've ever seen! lots of\nexplosions lots of action. if your a action fan this is the movie for\nyou. 5/5<br><br>Special Effects: The special Effects are Where incredible for the time\nand still are. its a good way to use CGI instead of spreading it all\nover the screen. now i don't hate CG i just think it's used to often.\nAnd the special effects are not what the films all about. its the\nacting and the characters. 5/5<br><br>Dialog: The dialog was very well done it was never cheesy/corny. if you\nare picky about bad dialog you won't be picking around! 5/5<br><br>Plot: <br><br>In 1994, a cyborg (Arnold Schwarzenegger) is sent back in time to\nprotect John Connor (Edward Furlong), the future leader of humanity in\na 21st century war against machines. A competing machine (Robert\nPatrick), the T-1000, is sent back to kill John. With the aid of John's\nmother Sarah (Linda Hamilton), the cyborg manages to destroy the T-1000\nat a confrontation at a steel mill. However, the cyborg must then\ndestroy itself in order to eliminate its chance of being used to help\nfuel the future war with the machines. Sarah helps the cyborg destroy\nitself, but not before the cyborg consoles John, quietly assuring him\nthat everything will be okay. Sarah then notes that if a machine can\nlearn the value of human life, perhaps people can, too.<br><br>The plot is fantastic, the best i have ever seen! 5/5<br><br>Overall Terminator 2 is the best film ever made in my opinion.<br><br>its a A++ Film its much better then the first but thats not saying the\nfirst its bad its one of my favorite films.<br><br>5/5 for terminator 2<br><br>Thank You For Reading This.<br><br>-Addison The Movie Reviewer\n"},
{"review": "\nIn the iron foundry the Terminator gets his left arm ripped off in a\ncogwheel. He leaves it there. This means that it is NOT destroyed along\nwith the laboratory arm and micro chip after the destruction of the\nT1000, and thus, when the Terminator is lowered into the molten iron,\nthere is STILL a robot arm in existence. The arm is bound to be found\nby scientists like Dyson who will eventually replicate it. This just\nshows that you can't change the future by changing the past. World War\nIII is bound to happen but hopefully only in the Terminator universe. I\ndon't know if this has been commented on before but going through the\ngoofs I couldn't find any comments relating to this.\n"},
{"review": "\nthis and 2 fast 2 furious are the only films to surpass their original,\nthat i know of. this is just a awesome movie, action packed, and james\ncameron's best film ever. edward furlong gives his best performance\nalong with arnold schwarzenegger and linda hamilton. it is about a\ncyborg sent back from the future to kill edward furlong because he is\nto be this great war leader when he grows up. then arnold, the\nprotector is sent, and it is a matter of who gets to him first. this is\nby far the best action film of all time, right there with the matrix\nand bad boys 2. so just sit back and watch this film and prepare to be\namazed. great movie, 10/10\n"},
{"review": "\nWhen it comes to action movies T2 has it made. With groundbreaking\nspecial effects, an all star cast &amp; crew and a story line that can make\nyou crap your pants and then cry T2 is like the terminator itself\nUNSTOPABLE. Now I could elaborate here but there's no need, this movie\nspeaks for itself. You see the beautiful thing about is that you can\nwatch it whether you 7 or your 70 it doesn't matter movies like this\ncome once in a lifetime and is a big reason why I'm in film school\nright now this thing that Cameron created is a bloody inspiration.\nAlright I only got a few more lines left so I'm gonna make this short\nand sweet, forget everything you think you know about action movies,\naction heroes and the whole frigging genre this film blows any\ncompetitor out of the water. Making any other film TERMINATED -Ishay-\n"},
{"review": "\nIt's worth gushing about. The fact that Ahhnold is now the Governor of\nmy California state simply adds facets to its viewing. It makes him\nlook good, rather than the other way around. It adds laughs. T2 is, as\nyou know, a great great film. Fans of this film have testosterone,\nsmiles and admiration every time we talk about this film. When we think\nabout this film - the \"time out!!\", the T1000's brilliant, silvery,\nrelentless fearless tactics, Sarah's ice-blooded cause(\"Men like\nyou...\"), and that damn tow truck, that damn Liquid gas transport...\n(\"Hasta la...) we have seen a film that has no scenes anywhere that\nsuck. None. How many films can you say that about??<br><br>If you think the perfect film is one you can bring your girl to, you\ndon't enjoy movies enough.\n"},
{"review": "\nIn my opinion, Terminator 2: Judgment Day is one of the best sequels of\nall times. Considering 90s cinematography technologies, James Cameron\ndid an outstanding job. Every detail of this cult movie, from the plot\nto the music was awesome. <br><br>In the first movie, the terminator was the bad guy. With a tremendous\nbody like Greek gods and his robot-like accent, Arnold Schwarzenegger\nwas a perfect fit to the Terminator character. He was sent back from\nfuture to kill Sarah Connor (Linda Hamilton), the mother of an unborn\nchild who will become the leader of a resistance against the machines.\nWe all know the story. But in T2, he came back to protect the son of\nSarah Connor which I believe was a very good twist. Arnold did his part\nvery well again as the cyborg of our dreams. What surprised me was the\ntransformation of Linda Hamilton's character. I honestly didn't see\nthat coming. Sarah Connor was a vulnerable young girl in the first\nmovie. But she turned into a bad-ass woman who has lots and lots of\nguns. I was really impressed. <br><br>I have watched this movie so many times over the years and it never\ngets old or boring. Just watch it.\n"},
{"review": "\nThis movie is one of the very best ones!.. It contains not a single\nirrelevant scene, and there are all scenes brief and to the point. And\nthe choice of not adding any distractive music as the movie go along is\nvery important and well done. About the star Arnold Schwarzenegger, I\nmust say that he is the one that no one'd replace for this movie. He\nreally makes us believe that he is a terminator and not a human,\nalthough he is trying to be one very well. And about Edward Furlong, I\nmust say that he plays the role of the smart and innocent kid real\ngood. Impressive!.. The tears in his eyes, while he struggles for the\nlife of humans... Well done! About the script, I say it is very humane\nafter all. You see, we build machines and kill each other from the\nbeginning of history. And we never stop shedding blood. And in this\nmovie, James Cameron did the best to prove that we hold the most value\nas human being and we should never ever hurt ourselves, with or without\nthe hopeless inventions. I should say that James Cameron and his stuff\ndid great. Bravo!.. (Here is the one of perfect themes:\n\"https://www.youtube.com/watch?v=DhWs3DVk-FU\")\n"},
{"review": "\nWhen I saw the first movie,I was surprised what an amazing movie James\nCameron was able to create with such a small budget.When I went to see\n\"Judgment Day\",I was curious to see how Cameron would use a much bigger\nbudget.He uses it to it's full extent.The result is a truly unique\nmovie.<br><br>This film focuses more on the characters-The T-101,Sarah and John\nConnor and they're all likable.I especially liked how the Terminator\ndiscovers the value of life,but eventually sacrifices himself in the\nend.That was one of the most powerful scenes I have seen in a movie.We\nalso have a more intimidating villain-the T-1000.Don't get me\nwrong,Arnold was still very Intimidating in the first movie,but you can\nnever see the T- 1000 coming,it can change into everything and uses\ncunning instead of smashing as it's primary tool.<br><br>This is probably the most entertaining and fun-to-watch movie I have\never seen.In my review for the first film I mentioned,that you will not\nfeel bored for a single minute while watching,well,you wont feel bored\nfor a single second while watching \"Terminator 2: Judgment\nDay\".Sure,the movie has some cheesy moments here and there,but I think\nthat's what gives it it's distinct terminatorness,what makes it so\nenjoyable.\n"},
{"review": "\nAfter watching the first terminator film, it was no surprise that\ndirector James Cameron came back for another shot. But what did\nsurprise me was how well this sequel was made. And it didn't take a few\nsequels in between to make it this good either. It was directly after\nthe first.<br><br>Arnold Schwarzenegger is back as the Terminator (T-800) but this time\nhe's on the good side. The whole idea of having the terminator switch\nroles was an interesting take. Because the terminator is on the good\nside now, there is so much room for character development and writer\nJames Cameron and William Wisher Jr. made sure this occurred throughout\nthe movie. To actually see a machine learn to be more human is always\nlife changing and Schwarzenegger does it perfectly.<br><br>Linda Hamilton's character, Sarah Connor has changed a lot too. We saw\na glimpse of what her character had become. Here we see her doing much\nmore: cursing up a storm, stabbing people and firing shotguns. Nothing\nlike the Sarah from The Terminator (1984). Edward Furlong plays John\nConnor, Sarah's son who are on the run from a new terminator, the T-\n1000. Robert Patrick plays this terminator and he's got a knack for it\ntoo. Patrick's eyes and face make a very menacing looking callous\nkilling machine.<br><br>The action sequences are also well staged, from scale models to live-\naction. All of it is believable and commendable. The special effects\nare the most amazing though, especially for 1991. This is beginning of\nCGI. The music by Brad Fiedel is also great too. It still sounds like\nthe first and that's very much appreciated. Cameron has done it again.<br><br>T2 is more involving and retains every element from the first film.\nIt's a sequel that is just as good as its predecessor.\n"},
{"review": "\nOne of the best action movies ever made and one of the best movies ever\nmade in general.The acting, the action, the story, the directing, the\nmusic, the special effects is all amazing and gives the audience an\namazing experience to enjoy. <br><br>The T-1000 is one of the best villains in cinematic history and Arnold\ndoes a great job as the terminator! Linda Hamilton is also great as the\nparanoid Sarah Connor and Edward Furlong is pretty good as a young John\nConnor!! <br><br>If you are a fan of sci-fi or action or both don't miss this one! James\nCameron directs his best film and it's simply fantastic. Far superior\nto Avatar and Titanic!\n"},
{"review": "\n7 years after the movie that we all call one of the best movies ever\nmade James Camerons Terminator 2 - Judgement Day were released, i\nweren't born then so i don't know if people were extremely happy about\nit but i guess that everyone were extremely happy.<br><br>After the events in the first movie Sarah Connor has been admitted to a\nmental hospital and her son John Connor has been placed in foster care.\nFrom the future sent two cyborgs a T-1000 with a mission to kill John\nand a reprogrammed T-800 Series models 101 to protect him. While they\nhave to defend themselves, they must also find the man who is guilty of\nskynet declares war against humanity.<br><br>The plot to this movie are a step better than the previous movie, and\nlike the first movie the cast are very good, this movie are with no\ndoubt one of the best sequels of all time. Everything is this movie are\nstunning, the sound, acting, directing and also the effects are\nincredibly impressing. With no doubt a epic masterpiece..\n"},
{"review": "\nThis was the best movie of the decade. In fact, I have not seen any\nmovies that have surpassed it. This was arnold's best movie although he\nhas had other movies that good. The same goes for Cameron. Titanic and\navatar might have been decent movies that made tons more money but I\nwould still choose T2 over them. Some of the fx are a bit dated but the\nt1000 effects still match up to modern movies. This movie was vastly\nsuperior to T3 and T4. The last two terminator movies were all style\nand very little substance whereas T2 had the right blend of action and\nwit. T2 had a heart and brain in there somewhere. T2 does have a few\nminor flaws. I thought that edward furlong was a bit wooden in places\n(only slightly) but then again this was his first time to act. The\nstory also slumped a slight bit in the middle. Definitely a movie to be\nrecommended\n"},
{"review": "\nI remember watching Terminator 2: Judgement Day at an early age and it\nhas been my favourite then and it is now I then saw The Terminator and\nthen Rise of the machines and finally Salvation and this is definitely\nthe best out of the quadrilodgy (The Terminator is excellent as well,\nan \"edgy 80s sci-fi thriller\" and its only downside is how amazing T2\nis), this is Schwarzenegger's best performance and he was born to play\nthe terminator, the movie is filled with action, sci-fi, and even some\ndrama, and great performances all around by Edward furlong, Robert\nPatrick and Linda Hamilton. The movie never has a dull moment and will\nkeep you're attention throughout with dazzling special effects, the cg\nis really something special (James Cameron used the technology when it\nwas new) even for todays standards, and the storyline is awesome,the\nonly downside the movie had to end, if you haven't seen T2, then stop\nreading this and get a copy and watch :D\n"},
{"review": "\nTerminator 2 is a worthy sequel to the first one. I think I like this\nfilm more than the original. With these films, James Cameron proved\nhimself to be an adept director. He made the top two grossing films all\ntime in America and three films that defined science fiction/action for\nages to come.<br><br>The Terminator returns this time not as a bad guy but as the good guy.\nHis mission is to protect the son of Sarah Connor, John. Together they\nmust rescue Sarah from the mental hospital and save the lives of three\nbillion people.<br><br>It's nice to see Arnold return. He knows how to kick butt. Robert\nPatrick is quite the villain. I hated his guts.<br><br>Overall, this is one of the best movies from the 1990's. It also broke\nnew ground visually. I rate this film 9/10. Hasta la Vista, Baby!\n"},
{"review": "\nThis is one of the rare occasion where the sequel far surpassed the\noriginal. I would argue that a large part of that has to do with the\ndrastic change in our media culture. For example, these days, if a\ncommercial film is very successful, a studio will almost immediately\ngreen light and rush a sequel to the screen. In doing so, it is willing\nto sacrifice all quality just to take advantage of a hot item and to\nmake money. <br><br>The difference here was that because of a legal rights issue, the\nsequel did not come out until seven years after the original (1984,\n1991). Also, James Cameron was behind it and it was his creation to\nbegin with. He wasn't just a gun for hire. James Cameron would never\nattach his name to something that wasn't of the highest caliber and\nsense this movie has such extensive visual effects work (Cameron's\nstrong point), the film far surpassed anyone's expectations. It's no\nwonder that the franchise has fallen apart ever sense he has departed\nand moved on to other works.\n"},
{"review": "\nMovie of the century. I have watched more than 30 times. Every time I\nwas amazed. Emotionally motivating as well as thrilling action.\nArnold's best movie ever seen. Robert Patrick was good as well. Thanks\nto the producer and director. Terminator 2 is the best of its sequels.\nTerminator 3 didn't have the originality which Terminator 2 has.\nTerminator 1 didn't have proper animation for robotic action.\nTerminator 4 has number of inconsistence as well as poor storyline.\nHope to see these type of movie in the future. The ATM hacking scene\nwas funny. I still remember one of Arnold'd dialog \"Astala Vista Baby\".\nI miss Arnold's movie a lot. I know he has more responsibility than\never but It would be wonderful if he comes with another sequel of\nTerminator.\n"},
{"review": "\n3 billion lives ended on August 29th, 1997. the survivors only lived to\nface a new nightmare, possibly one of the best movies ever.<br><br>Set 10 years after the original Terminator, Sarah Connor's (Linda\nHamilton) Personal demons have landed her in a mental institution,\nunder the care of Dr. Silberman (Earl Boen) With this she has had to\ngive up her son to foster care. And with a lot of Foster kids, John\nConnor (Edward Furlong) becomes a young criminal, but at the same time,\nhe's developing survival skills and bravery for the future.<br><br>One day, 2 terminators are sent back, one is a T-1000 (Robert Patrick)\na liquid metal cyborg whose job is to kill John Connor, and a T-800\n(Arnold Shwarzenegger) whose job is to protect John Connor. The 2 of\nthem will stop at nothing to complete their task, which makes a great\naction flick that even today impresses old and new fans of the series.<br><br>Where this film really impresses is not the story, but the Special\neffects, more so the beginnings of computer graphics. Millions of\ndollars were spent on them, and they proved just how far they could go\nfor 1991. even today it's amazing to watch how realistic a T-1000 looks\nturning into liquid metal and moving through metal bars.<br><br>Bottom line, I Strongly suggest you check this movie out. It will have\nyou on the edge of your seat begging for more.<br><br>10/10\n"},
{"review": "\nThis superb sequel surpasses the excellent original in every department\nand quite simply you won't see a better action film. Set 15 years after\nthe original Arnie may return as the good Terminator trying to protect\nJohn Connor but he's a redundant piece of scrap metal compared to the\nT-1000.<br><br>The opening hour and the last half hour is absolutely breathtaking with\naction sequences that still remain unsurpassed. Their's also a\nwonderful piece of storytelling 3/4 of the way through where Dyson\nrelishes the terrifying consequences of the project he's neglecting his\nfamily for.<br><br>The performances are memorable particularly Linda Hamilton's Sara\nConnor and simply put, they'll never make a better action film.\n"},
{"review": "\nEver since the 1984's The Terminator came out, it was a low budget\nfilm, but met with positive/mixed reviews. But after Cameron's other\nfilm, The Abyss, he made this fantastic sequel that surpasses the first\none by many reviewers.<br><br>It stars Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, Edward\nFurlong, etc.<br><br>In the last movie, a cyborg (Arnold Schwarzenegger) was sent from the\nfuture to kill Sarah Connor (Linda Hamilton), but he failed. Now a much\nmore powerful one sent from the future to kill Sarah's son - John\nConnor (Edward Furlong), the leader of the future rebels. A terminator\nwas send from the future once more, but this time to protect Connor.\nThe only problem is that the terminator who was send to kill Connor is\nmuch more powerful and clever than the one who was send to protect him.\nMoreover, none can help Connor, since they do not believe in robots.\nNow Connor and his protector has no choice but to survive on their own.<br><br>Before there was Avatar, Titanic, and True Lies, there was this one, an\naction packed film with everything it had.<br><br>So far this movie has been made into special editions to make the film\na little bit longer, the original time for the movie was 139 min., but\nin the Extreme, and Ultimate Collectors editions made it only 152 min.<br><br>Overall, the movie was amazing.<br><br>Terminator II: Judgment Day gets 10 stars.\n"},
{"review": "\nArnold was a cyborg who was programmed to kill Sarah Connor in the\nfirst flick of Terminator.But Arnold is back to protect Sarah from a\nmore advanced cyborg.Arnold gives a damn tremendous performance as the\nterminator.Linda Hamilton &amp; Edward Furlong are terrific.Linda Hamilton\nalso deserves credit for the success of this movie.She has just acted\nbrilliantly.The direction by James Cameroon is stupendous.What begins\nin the movie is a cat-mouse chase between Sarah Connor &amp; T-1000\ncyborg.Only Terminator stands in their way.The action scenes are quite\nterrific.The bike scenes are pretty cool.The shooting at the Cyborg\nUniversity by Arnold by a massive machine gun is impressive.The\nportrayal of Arnold looks pretty real.Only concern comes out as the\npowers possessed by T-1000.Massive advancements it seems for the new\ncyborg.The ending is pretty good &amp; very much touching as the fate of\nthe terminator is decided on the Judgement Day.This is better than both\nits prequel &amp; its sequel.This is Arnold at its very best.Judgement Day\narrives with a nuclear blast through out the world in the movie.And\nhere behind the screen the blast can be heard with a bang.Your ears\nbecome addicted to the dialog 'ASTA LAVISTA BABY'.Judgement Day has\narrived for you.\n"},
{"review": "\nThe concept and visual work in and of itself makes this a masterpiece\nand a piece of history forever immortalized in record. All credit MUST\nbe due to James Cameron because he is a groundbreaking and genius\nfilmmaker. AND this was the highest budgeted movie to date...as we\ncontinue to look back at JC's record, he tends to demand these\noutlandish requirements and backing and yet always pulls it off. Since\nI have recently seen Avatar (also created by the master), I was\nfortunate enough to read an article that stated, in short, that Cameron\nspent the better part of 2 months in a hotel across from the Twentieth\nCentury Fox lot in preparation for the Avatar opening and that Fox\nbasically just handed him the keys as he was there day and night in\ngenius mode. This brings to mind Leonardo DiCaprio's depiction of\nHoward Hughes when he was making Hell's Angels. <br><br>Arnold was perfectly cast as a machine as no one was interested in his\nacting ability (none really required here) but he was the perfect\naction star at the time. In addition, we have some of the most\ngroundbreaking explosions, visual effects, effects make-up, and\nadrenaline pumping action sequences recorded on film to date. PLUS, for\nall those who don't appreciate any of the technical aspects and major\nsacrifices that go into the making of a film, it was just plain\nhardcore fun and entertainment.\n"},
{"review": "\nThe original Terminator was a masterpiece, and a great example on how\nto make a great action movie with great special effects without a big\nbudget. So when you make a sequel and get a much bigger budget, you can\neither make it bigger and better than the original, or bigger and not\nnearly as good as the original. Thankfully Terminator two is actually\nbetter, or at least just as good, but more entertaining than it's\npredecessor.<br><br>Of course near the end we get the big plot hole with if they do mangage\nto stop the machine uprising, than John would never be born, and then a\nhuge paradox would happen. Also John is a bit of an a##hole in the\nbeginning, but he redeems himself. There are other problems of course\nbut it's mostly nitpicking.<br><br>The action scenes are fantastic, with some of the best practical and\nCGI effects ever. The pacing is perfect, that was one of the problems\nthe first movie had, it was too slow at points, but this movie give you\nan action scene in just the right place so you don't become bored, nor\ndoes it seem like it's just a mindless action movie. The character's\nare likable, and at times actually pretty funny. And it does bring up\ngood questions about weather you would kill one innocent man if that\nmeant saving millions of other innocent lives.<br><br>There are of course other good things in the movie, but I won't spoil\nanything, if you haven't seen the movie, just go watch it.\n"},
{"review": "\nI was absolutely amazed when I saw this extraordinary piece of work.\nAll the actors are amazing, it's funny, yet riveting and thrilling. And\nhas a great and very important message for humanity today. I had never\nreally been interested in the terminator films, but this film just blew\nme away, the special effects were just mind boggling for the time. It\nhas such amazing character development and a great story. I just\nrecommend everyone to see this film. It captivates you from beginning,\nall the way to the end, which is very hopeful and beautiful. Thank you\nJames Cameron for giving us such an amazing sci fi epic. And thank you\nto all the cast for terrific performances. John Connor is one the best\nand the most human heroes of all time.\n"},
{"review": "\nThe differences between this and the first one are just night and day.\nThe first one was good; very good, even, but this is just a whole other\nlevel of badassery. I'm going to have to divide this review into\nfactions to explain it:<br><br>The Action: The biggest feature here that everyone seems to talk about\nis the Liquid Terminator, or T1000, and goddamn if I'm not going to\nagree with them, because he is truly awesome. The action here is a lot\nof the time just proportionate to how create whatever the T1000 is\ndoing is, with all of his metamorphic features. But there are still\nenough cool explosions here to satisfy me, too.<br><br>The Story: A quite archetypal (and brilliantly told) tale of warning of\napocalypse and action heroics, T2 also possesses an interesting moral\nqualm partially through involving human life and the intricacy within.\nT2 packs a little of just about everything, from action to science\nfiction to romance to drama, and it ties it all together in an\nexplosive package that nobody should miss. There are a lot of cool\nlittle themes here too, like how the kid teaches Arnold things - and\nhow the \"no killing people\" thing is carried through with such style -\nor the evolution of Sarah Connor's character from the first movie to\nthis one, and all of this interspersed with the high-octane action\nmakes for a hugely gratifying experience.<br><br>The epic scope, vision and dynamics of this movie are just incredible.\nIt does so much and yet never manages to lose the viewers at all like\nsome other movies might. Terminator 2 is a superlative movie and\ndefinitely one of, if not THE, best sequels ever made. See it if you\nhaven't already, and remember, you CAN change your destiny.\n"},
{"review": "\nIn my book, Terminator 2: Judegement Day was one of those rare flashes\nof genius Hollywood bumps into every once in a while. From the\nbreathtaking visuals (that still hold well after 18 years) to the\nmaverick storytelling (kudos to legendary director James Cameron for\nthat) and genuine performances by the cast members (not just\nSchwarzenegger's Terminator, but also Linda Hamilton as one of the best\nfemale heroines ever, as well as Robert Patrick as the ruthless killer\nT-1000) - T2: Judgement Day was (and still is) a roller-coaster of\nmovie making at its finest. <br><br>Plot-wise, it advanced the series' cannon story of the apocalyptic\nfuture where robots rule the world and human resistance is strong yet\noutnumbered. This time around, the robots send the shape-shifting\nT-1000 to destroy Sarah Connor's future-leader-of-the-resistance, John\nConnor, at the tender age of 10. But their attempts to destroy the\nhuman defiance is met with a precocious John Cononor, his mother Sarah\n(who has since the fist installment) has turned into a lean, mean,\nkilling-machine) and the aforementioned Terminator (the one and only\nSchwarzenegger), this time being on the right side of the resistance.<br><br>When this movie was first released back in 1991, I was a mere 10 year\nold child (just like John). I remember watching it twice at the movie\ntheater and being blown away over and over again each time. If there\nwas anything I was ever close to idolizing as a kid, it was T2\n(especially Arnold Schwarzenegger). I remember later dressing up as The\nTerminator for Purim and hanging a very big poster of the film over my\nbed. Those were good times, and i'm sure current-day viewers will have\na positive experience watching this as well.<br><br>P.S. - I also liked T3, but it was less loyal to the first two, which\nmarked it a lesser film in my book (although it did include one of my\nfavorite endings ever).\n"},
{"review": "\nThis is my first time writing a review so i'll make it short I have\nwatched this movie over 30 times and still could watch it again. The\nreason for this is that this movie has everything, action, drama,\ncomedy, and some breath taking scenes. This is the movie when Arnold\nput his name on the top list. Even though he didn't do much acting (for\nbeing a \"robot\" and all) he managed to pull his character, would i say\nperfectly If you haven't seen this yet i highly recommend it to\neveryone (but not little children off course). After you've seen this\nyour life will have a new light toward movies. I really thank Arnold\nfor making this movie. It will be remembered for a very long time.\n"},
{"review": "\nThe Terminator was a lower budget, fun action movie. The movie was only\nheld back by the lack of budget and nothing else really. Terminator 2\ndidn't have that same problem.<br><br>Terminator 2 is one of the best action movies of the 90's and is, to\nme; a 90's icon. You can not bring up the 90's without thinking about\ngrunge rock, Seinfeld, pogs, \"No Fear\" clothes, Pokemon, X-Files, and\nTerminator 2.<br><br>Aside from the impact it has had on popular culture, Terminator 2 is\njust one of those movies you can find almost nothing wrong with. Its\nnearly impossible to not like one thing about it or another.<br><br>Anyway, back to the movie itself. The plot: A terminator (Robert\nPatrick) called the T-1000 is sent back to the present/past only this\ntime its after John Connor (Edward Furlong), not Sarah (Linda\nHamilton). The Terminator is also FAR more advanced here. Oddly enough,\nan older Terminator (Arnold), a recommissioned T-800 called the T-101\nhas been reprogrammed and sent back to protect John.<br><br>The acting was all perfect, and the effects were top-notch. I loved the\nchase scenes and the future scenes. The movie had a little of\neverything to enjoy. Highly recommended for fans of the first.<br><br>10/10.\n"},
{"review": "\nTo say that Terminator 2 has held up well over these last 18 years is a\nvast understatement the movie still looks amazing and you are still\nthrowing your fists in the air every time Arnoldo blows a hole in the\nT-1000 the scenes where the T-1000 turns into liquid metal looks so\ngood even by today's standards I was watching the film yesterday and i\nby now submission ended up watching a good thirty to forty five minutes\nof the film. James Cameron has given us at least two of th greatest\naction movies this gem and Aliens. Also look at the fact that both of\nthese are sequels to very well liked almost horror movies. Cameron\nknows where to put the camera and knows how to make the action work.\nNow without even touching the surface look at the acting Arnold who\nalso did the first Terminator in 84 and has aged amazingly well hell\neven looks better and they have flipped the script to turn what Sara\nconner fears most into what she needs to stay alive. To make your\ngreatest threat your greatest ally is a true mark of a great\nstoryteller.\n"},
{"review": "\nTerminator 2: Judgment Day (1991, Dir. James Cameron) <br><br>Before John Conner (Furlong) was born, Sarah Conner (Hamilton) had\ndefeated the 'indestructible' Terminator (Schwarzenegger). Now John\nConner has grown up, and the Terminator has once again returned from\nthe future, but this time, he is here to protect Conner's life. This\ntime, the Conner's are the target of the T-1000 (Patrick), a more\nadvanced Terminator model.<br><br>Fantastic sequel which returns all the wonderful cast and crew of the\noriginal, as well as making it better with Patrick and Furlong. Nothing\nis sacrificed as both story and action are balanced out evenly, with\nsome truly memorable sequences.<br><br>This severe routine is getting old. You're acting like such a geek. \u0096\nJohn Conner (Edward Furlong)\n"},
{"review": "\nI am a very enthusiastic and dedicated movie fan and reviewer. I want\nit known that this movie is without a doubt the best and most complete\nmovie I have seen in my 26 year existence.<br><br>Between the brilliant music, casting, directing, cinematography, and\nplot I have adamantly defended this movie again and again to the\nnegligent and the educated. It is simply perfect in every respect. I\nhave gone into movies the last 16 years waiting for something to beat\nthis title but nothing has. When something does surpass this title one\nday I will stand and applaud. This is quite simply the best movie ever\nmade!\n"},
{"review": "\nBeing a Terminator 2 fan for some years now I think it finally deserves\na comment. From the first time I witnessed the fast paced action, high\npowered weaponry and the the T-1000 emerging from explosions and\nfloors, I was immediately hooked. I don't think there's any aspect of\nthis film that I don't like, it really has a great feel of humanity's\nstruggle against the creation of Skynet which will be responsible for\nthe loss of so much life.<br><br>It's hard to pick out the best performance here, with Linda Hamilton\nportraying such a cold character (almost like a Terminator herself), to\nRobert Patrick's excellent performance as the new Terminator, the\nT-1000. Even young Edward Furlong is fantastic in this picture being\njust 9 years of age as the young John Connor. And of course you have\nSchwartzenegger, who is playing the role he was born to play, unlike\nthe cliché he turns into in Rise of the Machines.<br><br>I would highly recommend film to anyone. From a distance it might just\nlook like your mindless science-fiction action movie with robots and\nexplosions, but it really is just so much more than that. The\nproduction value is phenomenal with great chase scenes and fantastic\nspecial effects, even by todays standards. And as I mentioned the\nperformances by the actors are fantastic. But more than all that I\nthink is the whole feel of the movie, which contrasts good over evil\nbrilliantly.<br><br>10/10, your not going to find a better action movie than this, buy it\non special edition if you haven't already..\n"},
{"review": "\nWith nearly 650 reviews at this point, I haven't read them all so I may\nbe repeating something which has been said elsewhere (although I\nhaven't spotted it among the pages I've sampled).<br><br>I liked the way Cameron didn't so much repeat the first film as echo it\n- there were many places where something from the original showed up\nagain, but in a different context, making a different point, driving\nthe plot forward.<br><br>I liked the way that the gradual role reversal from the first film\n(Reese strong and supportive, Sarah weak and helpless at the start,\nexactly reversed by the end) was echoed in the relationship between\nSarah and John.<br><br>Which is why I was particularly surprised at the garage scene with the\nlearning chip being cut from the release print - not only does it\nilluminate several points which follow it and which don't make sense\notherwise, it is also the pivotal moment when John assumes the dominant\nrole in his relationship with his mother which, in turn, echoes the\nmoment in the first film when Sarah starts protecting Kyle rather than\nvice versa.<br><br>And another vote in favour of the groundbreaking effects, particularly\nthe way they served the story rather than becoming the reason for it.\n"},
{"review": "\nI adore this movie. I could never stand action movies, but T2 is so\nintelligent and moving that it stands apart from everything else.<br><br>First, the story - brilliant, smoothly making the necessary transition\nfrom T1. The dialogue runs the gamut from hilarious to heartbreaking,\nbut always strikes exactly the right chord.<br><br>The cinematography and effects are stunning, especially the scenes\nfilmed during \"magic hour\", when the pale gold of sunset casts a\nmeaningful and lovely effect on the scene. Being the first $100 million\nmovie naturally the effects are remarkable for their time, but they\nhold up wonderfully against anything made today.<br><br>It's the actors, however, who steal the show. Linda Hamilton can play\ninsanity and despair like nobody's business, and she gave her all here.\nRobert Patrick was wonderful in the demanding role of the T-1000,\ncreepy and threatening even during the funny finger-wagging moment.\nArnold Schwarzenegger balances non-stop action with a machine's\nemerging humanity; frankly this movie cancels out every dumb action\nflick he ever made. New-comer Edward Furlong carried the film with\nseeming ease, giving an astonishing performance for his age and lack of\nexperience; the \"We're not gonna make it, are we?\" scene is hauntingly\nperfect.<br><br>James Cameron and his team have given us a classic that has something\nfor everyone. You'd never know that this is the guy who made Titanic.<br><br>Rated R for Extreme Graphic Violence, Strong Action and Profanity.\n"},
{"review": "\nI'm not even going to bother with a real review of this film, because\nit has like 4000 other reviews and most people know what it is even if\nthey haven't seen it. Sarah Conner's in an insane asylum, and a robot\nfrom the future has come to kill her son. But don't worry, because her\nson (in the future) sent his own robot back to kill the other robot and\nsave the son (himself). Yeah, it might not make sense from a time\ntravel point of view, but just deal with it.<br><br>What to say? Arnold is great, as usual (though this is no \"Commando\").\nEdward Furlong is young, but does a fine job. I don't have the crush on\nhim some people do, but he's cool. Robert Patrick is also awesome, even\nif he has creepy weird ears. And this is more action than you'll get in\nmost films, which is probably what you want if you're watching this.<br><br>There, that was my little review. Maybe next time i see the film, I'll\nexpand it to something with substance. But for now, this is good\nenough... read the other reviews instead. (Yes, you can vote this to\nthe very bottom of \"helpful\" reviews.)\n"},
{"review": "\nTERMINATOR 2: JUDGMENT DAY, in my opinion, is an excellent,\nnail-biting, edge-of-your-seat thriller that's sure to make you feel\ngood and take your breath away. If you ask me, Arnold and Linda\nHamilton deliver electrifying performances that are out of this world.\nIf you ask me, the liquid metal and special effects were fantastic.\nWhen Sarah (Linda Hamilton) and John (Edward Furlong) were being\npursued by T-1000 (Robert Patrick), I was on the edge of my seat the\nentire time. In conclusion, if you like thrillers that will blow you\naway or are a fan of Arnold or Linda Hamilton, I strongly recommend\nthis excellent, nail-biting, edge-of-your-seat thriller that's sure to\nmake you feel good and take your breath away.\n"},
{"review": "\n\nSuperior to the first episode in every single way. In this episode a\ncyborg\n(T-800) is sent back in time to protect a 10-year old boy named John\nConnor.\nHe will be the future leader of humanity that tries to resist the\nrelentless\nkilling machines. This action/sci-fi masterpiece is extremely cool but\nmost\nimportantly very smart. It is also very emotional and artistic. The words\nartistic and emotional don't apply to any other action movie but only to\nthis timeless James Cameron masterpiece.\n"},
{"review": "\n\nThis movie blew me away when I saw it in the theatre - as much for the\nthoughtful ending as for the FX, story, characterization. There are very\nfew\nmovies I would give a 'ten', this being one of them, despite the time\ntravel\nstory, which I normally don't like in SF. There are only a handful of SF\nmovies that equal this one, (2001, Contact, Star Wars:Empire Strikes Back)\nnone really exceed it; it's THAT good. Overall best action SF movie out\nthere - a must own.\n"},
{"review": "\n\nAnd really, this is what T2 is.  Giving Arnold the Kyle Resse role the time\naround to promote Schwarzenegger's then newer \"good guy\" image.  But\ndownplaying that, this film definitely keeps the entertainment and wow\nfactor.<br><br>It's T-800 versus the shape-shifting T-1000 in another battle for the future\nand the fate of John Connor.  A more buff version of Linda Hamilton.  A\nsupporting role from Sam of \"Diff'rent Stokes\" as John's punk friend.  Lots\nof explosions, gun fights and chases.  And still remarkably good special\neffects even by today's standards.  Schwarzenegger has charisma.  His acting\nrange is best in two areas, acting and comedy, and this film allows him to\ndo both.  His cyborg persona's attempt to understand humanity ranges from\nfunny to surprisingly touching.  The plot is a retelling of the original\nfilm, but it's a secondary point for the sheer entertainment value that's\ndelivered from this film. <br><br>There's not much that truly can be said about this film ten years after its\nrelease.  It's a landmark film in the sci-fi genre, especially for its\ntechnical advances with CG effects.  The \"Ultimate Edition\" DVD released\nlast year is a \"must get\" as it adds deleted scenes to the film (The\nTerminator learning to smile is well worth the price of admission), as well\nas the \"extras\" book and all the \"Behind the Scenes\" information.  And the\naudio quality is nothing to sneeze at, either.  An excellent demonstration\nof any sound system.<br><br>Terminator 2: Judgement Day remains a remarkable film.  Go in expecting lots\nof action and a classic Arnold performance, and there will be little to be\ndisappointed with.  With a \"T3\" in the works, it seems that not only the\nfuture of humanity is uncertain, but of this franchise as well.  Hopefully\nthey'll be able to one-up the standards of sci-fi again, and not be out just\nto make a quick buck.\n"},
{"review": "\n\nThis was a great, awesome movie!  This movie is definitely one of the best\naction movies ever made, and is in my opinion the best movie ever made!\nArnold, Linda Hamilton, Edward Furlong, and Robert Patrick did great jobs\nin\nthis movie!  This is Arnold's best movie, out of many great movies!  I\njust\nbought the Ultimate Edition DVD, and it is amazing.  It costs $30, and it\nis\nworth ever dollar!  If you haven't seen this movie, shame on you!  This is\nthe Best Movie ever made!\n"},
{"review": "\n\nArnold´s Best Movie...<br><br>If You never seen Terminator 2 do it now!!!!!!\nIf you have seen Terminator and was not impressed\nYOU WILL BE IMPRESSED OF TERMINATOR 2..<br><br>Trust Me.................\n"},
{"review": "\n\nJames Cameron is a God.  He has to be.  There are so few directors that\ncan\nmake films the way he can.  In fact I would go out on a limb here and say\nthat besides Spielberg ( who himself is a God ) no one can make films the\nway he can.  Terminator was a great film.  But T2 is really heads and\nshoulders above it.  Sequels don't usually surpass the original, but this\none sure did.<br><br>T2 explores so many of the same issues as the first one but it goes deeper\ninto them.  It gives us more visuals of what a desolate future would be\nlike\nafter a nuclear war.  And it gives more reason to be pessimistic towards\nour\nown species.  \" We're not going to make it, are we? \" John asks the\nTerminator.  \" It's in your nature to desroy yourselves. \"  How chilling\nis\nthat?  And how true?  As a sci-fi/action movie, this is one of the best.\nBut this could also be taken on the same level as a horror film.  Just an\nincredibly expensive and well made horror film.<br><br>What an idea to add to the first films paranoia by not just having Arnold\ncome back to play a good Terminator, but to have the seemingly invincible\nT-1000 become the enemy added a whole new dimension to the\nfilm.<br><br>This film has a bigger budget and it had higher expectations but it did\nnot\ncease from being dark and intelligent enough to make us think.  It also\nhas\nsome great humour.  And Arnold doesn't disappoint, he utter the famous\nline\n\" I'll be back! \"<br><br>T2 is a movie miracle.  It is so well made and enteraining while having a\nmessage that it is quite simply one of the best films ever made.  I love\nwhat James Cameron does when he is behind a camera and I loved this movie.\nIt is a true work of art.  And one hell of an entertaining\nfilm.\n"},
{"review": "\n\nThis One's a seriously moving picture. Don't get me wrong,\nit's\naction packed and is full of enough shrapnel to de-bark a\nforest,\nbut the underlying message and subversive tones of whatever you can find\nwrong with the future of the world within the story is to impress about\nmore.\n"},
{"review": "\nThere is a saying that sequels never surpass the original. Well, this\none does, and can I say, BIG TIME! Besides the special effects, and\nthey are great, is the sheer terror and hopelessness the main\ncharacters are in. How do you stop a relentless, ruthless killing\nmachine? Linda Hamilton was superb in T2.(I fell in love with that\nbody!) She was almost as unstoppable as the machine in her pursuit of\nsaving her son and mankind. I'm not a fan of your basic Sci-fi special\neffects. Snarling aliens drooling slime all over their victims, and\ngross mutant alien-babies popping out of humans don't thrill me. But it\nT2, Cameron does it best, it's more believable. With technology these\nthings could happen. I was blown out of my seat with the EXTREME\nspecial effects, and chase scenes. This is the best action movie I have\never seen, BY FAR! If this movie doesn't blow you away, you better\ncheck your pulse rate. My recommendations? See it on a big screen and\ncrank up the volume.\n"},
{"review": "\nThis movie is one of James Cameron's best to date. It is also Arnold\nSchwarzenegger's best. I liked this movie better than the first\nTerminator film, but I thought the first film was good though. This\nmovie has awesome special effects and visual effects, top notch acting\nand a very good storyline. In this film, the Terminator is sent back to\nprotect John Connor and Sarah Connor from a more advanced more powerful\nterminator, the T-1000. I liked Robert Patrick's portrayal as the\nT-1000 in this movie. This is Robert Patrick's best film role to date\nso far. Sarah Connor is more psycho and more stronger in this film than\nshe was in the first one. Like I said, I think this film is better than\nthe first one. This movie is the breakthrough movie with the use of CG.\nCreating the first computer animated villain and a partially computer\nanimated main character. This movie is definitely worth a watch and\ntime well spent.\n"},
{"review": "\nThis is the BEST sequel ever made to a movie! Terminator was a great\nmovie but T2 made the whole thing one of the best movie franchises\never. I mean who wouldn't know the quote \"Hasta la vista Baby\" One more\nthing about this masterpiece. It has the best use of CGI i've ever\nseen. The CGIs looks great (not for just its time i find it appealing\neven now the t1000 looks great) but the great thing is that CGI is not\noverused like in films nowadays. All together i think this movie got it\nall right, great story, great action scenes, lots of explosions, great\ncgi so yes it is one of the best movies ever and i still think this is\nthe best sequel!\n"},
{"review": "\nI was 13 when this movie came out and as a 13 year old lad I loved this\nmovie. I hadn't seen it in years and just watched it again. I have to\nsay it just keeps getting better. The visual effects still look\nimpressive all these years later and the soundtrack is amazing. The\nT-1000 is probably one of the best baddies in a movie ever. It is\ntotally relentless in it's attempts to kill John Connor and it's up to\nthe older model Terminator (Arnie) to protect John at all costs.\nThere's nothing about the movie I don't like and that's all thanks to\nJames Cameron. I think it's amazing that Arnie was able to go from\nuber-villain in the original Terminator to uber-hero in the sequel\nwhilst playing exactly the same character basically. I realise that\nhe's a robot but I don't think anyone else could've played that part\nand Arnie excels here. As a now 32 year old man I know I'm supposed to\nbe all tough and hardened but the ending ALWAYS makes me cry and I'm\nnot ashamed about it. Totally amazing.\n"},
{"review": "\nTerminator 2: Judgement Day is a perfection. The action and sci-fi\nelements go together like bread and butter. It also contains some of\nthe greatest action sequences in film history, but that doesn't stop it\nfrom having a deep storyline. The characters go through changes, the\ndialogue is razor sharp, and the acting is wonderful. Arnold gives the\nbest performance in his career. The jokes are often funny. Moments with\nThe Terminator talking to John Conner are just as good at times as the\nbig action sequences. The effects were groundbreaking at the time. The\nscore is fantastic. I think that the score is easily the greatest ever.\nI could watch this film so many times and still love it. It has no\nflaws.<br><br>4 stars out of 4\n"},
{"review": "\nWritten and directed of course by James Cameron, the 1991 sequel to The\nTerminator takes place eleven years on from its predecessor. In the\naftermath of the 'Judgement Day' nuclear war, the self-aware computer\ngiant Skynet initiates a paradoxical effort to once again attempt to\neliminate the leader of the human resistance, John Connor.<br><br>Well where do you begin? I personally find it impossible to look at\nCameron's sequel as a 'film' to critique because it's simply so much\ngreater than the confines of the silver screen. I'm currently sat with\na tepid coffee, trying my best to conjure the brilliance of this epic\nand even with the worlds most extensive thesaurus I'd fail to do it\njustice.<br><br>Casting aside the sheer admiration I have for Cameron's ability to\nintertwine science fiction, action and romance so poetically, it's the\noverwhelming character the film has to offer that I feel sets it so far\nabove the rest. Whether it's Cameron's off-hue blue-lit depiction of\nLA, Brad Fiedel's tragically heart-warming score, Robert Patrick's icy\ndemeanour, Arnie's stoical charm or the final brutally touching words\nof Linda Hamilton, Terminator 2 simply oozes with a unique and\nunmatchable style, character and timelessness.<br><br>-10/10\n"},
{"review": "\nTerminator 2: Judgment Day is perfect in every sense. When I watched\nTerminator 2 for the first time, I didn't understand anything, because\nI was new to English, but after re-watching it, I was completely amazed\nby what I missed out on. Terminator 2 is 50x better than it's\npredecessor even though that is good, but still it could not beat\nTerminator 2.<br><br>An evil terminator (Robert Patrick) is sent back from the future to\nterminate John Connor (Edward Furlong), who will later rise an uprising\nagainst the machines, and the terminator will do anything to stop John\nfrom living. Along with his powers he quickly reaches John but then he\nrealizes that a lower class terminator (Arnold Schwarznegger) is sent\nback from the future to protect John from the forces of the bad\nterminator.<br><br>The acting from Schwarznegger, Patrick, Furlong, and Hamilton are\nabsolutely fantastic, I can see that they are very comfortable in their\nroles. Now, I am going to talk about the action. The chase scenes, and\nthe gunfights along with the other violent scenes can not bee seen in\nany other movie except Terminator 2. They action scenes are truly\nmagnificent and if any of you haven't watched this, you must be living\non mars and watching Sesame Street, because you are missing out on the\nMOST IMPORTANT ACTION MOVIE OF ALL TIME! <br><br>Final Thoughts: I really love the CGI and again Cameron has impressed\nus with his new work along with some others. Terminator 2 is nothing\nshort of what you call a SUPER-MASTERPIECE! ****/****\n"},
{"review": "\nI'm 29 now.I still remember when i have witnessed this movie at the\ntheater with my dad,mom and sister.After the flick we went to a\nrestaurant and all we did was talking about terminator 2 and how\nawesome it's was.My father who was not a film enthusiast liked it very\nmuch.<br><br>I think i've seen this flick well over 200 time.Around 100 time the\nfirst years and 100 more time until now.My uncle kept me for 1 week at\nsome point and he had to throw me outside because all i was doing was\nwatching terminator 2.It's was my *movie* .<br><br>So why there's no more movie like this one?Well after all those years i\nrealized why.Because the action and the story aren't trying to link\nthemselves to much.You never know what's going to happens because they\ndon't elaborate anything.They don't make a plan to how they should take\nover Cyberdine.John don't think about what he should do when the\nterminator attack him.<br><br>We're always amazed because they don't strategies 10 minutes before\ndoing it.They just do it and it's flow so well.It's does not impact the\nstory line and it's give plenty of time for it while leaving the action\napart from the rest.<br><br>So each action scene just link together and all you can do it WOOO\nAMAZING,AWESOME.Even after so many years .. the action scene never get\nhold.Because you don't have to go through anything before it.They're\njust here and it's give a real atmosphere to the movie has a whole.<br><br>Just like when Sarah try to escape.She don't think the how of the\nwhen.She just want to get the hell out of there.<br><br>Action flick today try to hard with all the strategy etc.So it's become\nstagnant and you're just waiting for what you expect.It's become\nboring.<br><br>Not many movie equal terminator 2.It's my favorite movie of all time\nfor that simple reason.Because the action and the story .. are just 2\nmovie in 1.\n"}
]