[
{"review": "\nWell, I just saw Avatar this morning, one of the press premieres which\nare running on these days. My opinion: you've seen this story a hundred\ntimes, but never like this. Finally 3D is what it's supposed to be, an\ninstrument at the service of the movie. You'll enjoy the visual\nexperience, no doubt.<br><br>As for the story, some of the \"inspirations\" are so huge and so obvious\nthat mentioning two or three of them would REALLY ruin the movie for\nyou, and I'm not willing to do that. Lots of mysticism and ecology, if\nyou like that stuff. If you're 15 or so, you'll have a great time\nthinking that it's the first time somebody makes something like this.\nIf you're an experienced movie watcher, better leave your skepticism at\nthe door, bring lots of pop corn and enjoy with the usual\naction-flick-with-moral-and-loads-of-clichés.<br><br>I liked it, however: \"the movie that re-invents movies\"??? No way.\n"},
{"review": "\nI had the rather intense privilege to view James Cameron's much\nanticipated $400 million budget return to the directing scene, Avatar,\nat the Empire Leicester Square in London.<br><br>Where to begin! The visuals in this pieces was groundbreaking. He did\nit with the Terminator series and then Titanic, so one would expect\nCameron to deliver... and HE DID! The visual are by far some of the\nsharpest CGI I have seen. You could almost say that there is a disquiet\nthat follows Cameron's soul, as there is no other possibility of this\nstrong and intensified quality. Its production design and visual\neffects are both noteworthy and it will get its praise upon official\nrelease.<br><br>What it was lacking that really should have shaped the movie is its\ncharacter/story. I was expecting a complex and believable plot, but was\nleft with a movie with mostly strong visuals. What most sci-fi lovers\ndesire is mind-bending philosophies, fantasy and exploration and\nlimitations of our or outer species. If it was not for this factor, I\nwould give this a 9.5 vote.<br><br>Avatar will be a success, not only because of Cameron's legacy, but by\nvery intelligent and viral marketing. Avatar have had a powerful\nmarketing technique that assembles other successful blockbusters, such\nas The Blair Witch project (you all remember it), The Dark Knight\n(Joker invades the world) and also, the current production The Artifice\n(the-artifice.com) that is intelligently targeting the market.<br><br>Kudos to Cameron, Avatar is one of the (if not The) movie of the year.\nI could get in trouble for sharing this with you guys so early, so\nplease click Yes on \"Was the above comment useful to you?\" as a thank\nyou. ;)\n"},
{"review": "\nI saw this epic last night at the Empire Leicester Sq in London, which\nis a superb venue in which to view this film. Huge screen, excellent\nsound and an extraordinary Dolby, 3 dimensional image. The whole effect\nis mind blowing.<br><br>This is a 'Must see' movie, innovative, and extraordinary. I think it\nwill be regarded by most cinema goers as another milestone in the\nhistory of the art. The level of realism achieved is remarkable, and\nalthough the film is relatively long in real time, it retains it's\nexcitement and holds the audience's attention to the end.<br><br>Performances are good, but this is not the sort of film that dwells on\nbig star value for the actors, although Sigorney Weaver does shine and\ndelivers a very convincing performance, as do the rest of the cast. But\nas there is so much entertainment and action value on screen the human\nelement does not dominate in the usual way.<br><br>As Writer/Director, James Cameron deserves high praise for this\ncreation and in my opinion it will break box office records. I\nthoroughly enjoyed this film.\n"},
{"review": "\nA film with the scope of James Cameron's Avatar was always going to be\na risk both artistically and financially, especially in today's\neconomic climate. Whether it will pay off monetarily is a question only\ntime can answer, but this viewer can at the very least attest to it\nbeing an artistic triumph.<br><br>Avatar brings us as close as cinema ever has to actually visiting an\nalien world. The beautiful environs, the exotic creatures and\nincredibly lifelike natives of Pandora arrest the senses, visually,\naurally and emotionally. The world in Avatar is the true star of the\nshow. The amount of detail and work that has gone into bringing this\nnew world alive is seriously impressive, and it will be a while before\nwe see anything that overtakes it in scope and quality. WETA Workshop\nand ILM have truly outdone themselves.<br><br>Relative newcomer, Aussie Sam Worthington provides a solid human heart\namongst all the science-fiction/fantasy beauty and Zoe Saldana gives an\nimpressive performance as the 8 foot tall Na'vi, Neytiri. Even though\nthe characters they both play are blue, giant, catlike aliens, they\nmanaged to evoke a chemistry and likability that pierces through the\nspecial effects.<br><br>That's not to say that everything is perfect. The story is basic and\ndare I say, clichéd and predictable. We have seen it plenty of times in\nall forms of media. The bad guys are cartoonishly evil, and sadly paper\nthin. The love story, while charming, is also clichéd despite being\nbetween man and alien. But in the face of these shortcomings, Avatar is\na success because its storytelling lies in the brilliant visuals.<br><br>Avatar is a beautiful piece of film and a true event. It does exactly\nwhat cinema was always intended to - it takes us away from our problems\nand worries for a few hours and gives us memorable images which will\nundoubtedly and deservedly enter into the cultural lexicon to stay for\nthe foreseeable future.<br><br>9.5/10\n"},
{"review": "\nI have never been so close to leave the movie theater, as i was when\nseeing Avatar. Sure, it's very beautiful to look at, but, if you've\nseen the trailer, then you've seen the movie! It's basically every\nmovie clichés put together in one horrible and so unoriginal movie.\nit's a mix of the \"last samurai\" meets \"Pocahontas\" meets \"Atlantis\"!\nit's by far the most horrible storyline since Ed Woods' \"plan 9 from\nouter space\".<br><br>Not once are you surprised by the turn of events in this movie, and\nthere's so many bad movie clichés in it, and so many things that just\ndoesn't make any sense at all (even in their universe). for example,\nthe last fight scene with the giant robot and the Avatar. It really\ndoesn't make any sense at all, that the robot is carrying a 8-foot-1\nhunting knife, just in case he loses his gun (which could easily have\nbeen attach to the robot!), and that the robot tells the avatar, what\nhe's about to do, instead of just doing it (A good example of a bad\ncliché).<br><br>If you want to see this movie, i recommend you either see the trailer (\nas that is enough for you, to litterily, call every scene in the movie)\nor you go out and buy Atlantis and just Imagine it with smurfs instead\nof underwater people.\n"},
{"review": "\nI realize I am probably going to get flames galore for this comment,\nand you all have the right to your opinion about my opinion, but hey,\nI'm entitled to my opinion too. Avatar is grade A crap. That's right,\nit's crap. I say this for one simple reason: Without the special\neffects this movie would never, ever captivate and take a hold of\naudiences like it has in the past week. Ask yourself this one question:\nIf it didn't have the effects, the Navi plugging their hair into the\ntrees like it's a damn broadband jack, mech suits(just like the ones in\nMatrix Revolutions) and barely futuristic ospreys, would you care about\nthis movie at all? It's a truism when they say this movie is nothing\nmore than Dances with Wolves in space. Some people may argue back that\nStar Wars borrowed from Hidden fortress, but at least it had enough\ncompelling plot points to make it look different, such as I don't\nknow... the force? The Death Star? Outer space? A location that has\nNOTHING at all to do with Earth? This important set of points clearly\ndifferentiates Star Wars and Hidden Fortress. But The difference\nbetween Avatar and Dances with wolves is... CGI. This CGI may be pretty\nbut it cannot ever substitute for story and plot development. Speaking\nof, the characters save but a few are either very bland or stereotypes.\nThe worst part is the story and the movie gives us no reason to care\nabout the characters. You know what? I'll go one step further and say\nthat the only difference between Avatar and a Star Wars prequel is\nthis: Avatar has an environmental story that we can relate to. That's\nit. True, the action scenes in Avatar are well done, but hell, the\naction scenes in the Star Wars prequels were also arguably well-done.\nStill, there's that nagging lack of story development. Avatar is a huge\nlet-down and doesn't belong on the best-of list of anybody with common\nsense.\n"},
{"review": "\nI am sure my comment will be lost in a sea of blue but anyways here\ngoes...<br><br>Just attended the Advanced Screening at my local \"Event Cinema\" BCC in\n3D<br><br>Now this movies graphics are gorgeous, everything is so real, the 3D\njust adds to the effect beautifully without distracting you.<br><br>From a technical standpoint this movie is amazing, just the detail on\nthe Navi's faces are amazing, they feel more real then their real life\ncounterparts!<br><br>Without giving anything away about the story, the plot itself is very\nsolid, very character driven and perfectly executed by Jim, safe to say\nthis is his best original story since \"The Terminator\" and \"Terminator\n2\" and is definitely one of his best movies, so good it ties with T2\nwhich is my most favorite movie of all time...<br><br>So for those of you who have not seen this yet... WHAT ARE YOU WAITING\nFOR?!<br><br>5/5\n"},
{"review": "\nAt the risk of repeating what countless others have said, this movie is\nblatant plagiarism. If a film student submitted the Avatar screenplay\nto an instructor, he/she would have been given an F. Colleges expel\nstudents for less obvious ripoffs than this. If you've watched\nPocahontas or Dances With Wolves, you know the drill. The only\ndifference is the ending, which has the pretty blue humanoids escorting\nhumans to their Earth-bound ships at gunpoint, which I freely admit is\na rather neat sight since my ancestors were American Indian, Irish, and\nScot. As a result, I am perhaps overly sensitive to the plight of a\ncivilization driven from their homeland and/or oppressed by a\nconquering nation - er, planet.<br><br>However, originality is not James Cameron's strong suit, so my\ndisappointment is directed more at WETA. Yes, my beloved WETA, who\nimpressed me throughout the years but completely stole my heart after\nthe masterful rendering of all things Tolkien in the Lord of the Rings\nTrilogy. I had two reasons for seeing this film. One was a 13-year-old\nboy, the other was my anticipation over what wonders WETA would lay at\nmy feet.<br><br>Now, had the budget not been nearly half a billion dollars, I'd have\nunderstood the cartoonish creations, but as it stands there's no good\nreason for the results. Viewers are praising this film as\nrevolutionary. I call \"horsesh!t\". This was nowhere near the caliber of\nWETA's LOTR work, their King Kong work, or their X-Men work. In fact,\nit wasn't even up to snuff with their Narnia production. The quantity\nof work was greater, not the quality.<br><br>I've never reviewed a film in my life. I actually registered here for\nthe sole purpose of expressing my resentment at having wasted $20 bucks\nand 3 hours on such nonsense. Booooooo.\n"},
{"review": "\nFirst I didn't want to go watch Avatar because when I heard Cameron\ntook 3 weeks to write the plot I said to myself there is no hope for\ncinema anymore. And somehow people are showing me that I was right. I\nwent to watch this piece of .... because I have been told it s\nunbelievable.<br><br>Storywise, there is no story at all. It's the typical good vs bad\nscenario shaped out of cowboys against indians in space mixing it with\na yogi everything connects us to the world impression plus a goddamn\nplanet called Pandora and looks like f...in' paradise. Lot's of shiny\ncolours and huge monsters who eat flesh are your best friends. Come on.\nYou gotta be kidding me.<br><br>Maybe I might be the only one here, cause all reviews I've seen got\ngreat score, but that is not what a movie is supposed to be. I was very\nunimpressed by the CGI and the artistic development because I might be\nused to computer games such as Final Fantasy series which has been the\nshaper of such incredible stories, only that these games have a very\nstrong story to tell and and you feel totally involved.<br><br>It impresses me that people give this such a high rating because of\nit's visuals. I mean it was clear that sooner or later a movie would\nappear with such incredible CGI. If it wouldn't have been Avatar\nanother would have been the winner.<br><br>I am sad that nowadays cinema is ail centered only about violence, good\nlooks and a huge lack of brain.<br><br>3 out of ten only for the cgi which I thought is not the center of a\nmovie otherwise I would have rated it beneath 0.\n"},
{"review": "\nThis film has nothing worthy of the box office receipts is has\ngarnered. Any third grader can predict the outcome after the first ten\nminutes. The plot, characters, and themes are either one dimensional or\nblatant rip offs of earlier tales. Even those parts of the movie that\nare rehashing some of the great movies of history are delivered without\nany depth or structure. Consider the poorly constructed moral and it\ncan be seen that it could have been stolen from \"Dances with Wolves\"\nand others before it, but taken without the bones to support it.<br><br>Special effects were interesting, but again lacking in any thought to\ncharacter development. Creatures of this other world were clearly\ndeveloped in an attempt to make them look \"cool\" without any thought to\nthe evolutionary challenges that may have helped to shape them.<br><br>It is possible that there is an intended message relating to the\ntension between science and religion, but it is hardly worth trying to\nevaluate the directors message. There is so little substance to this\nmovie that the only possible conclusion that one could come to is that\nthe analysis was not worth the effort.\n"},
{"review": "\nYeah this movie took several steps forward in terms of cinematography\nand filming technology, but that is all that can really be said to be\nwhat makes this film worth seeing. Everything else that makes a film\ngreat is totally lack luster.<br><br>There is no deep character development. Why does Jake Sully really want\nto become a part of the Navi? What was life on Earth like? What really\nmakes him want to break away from his roots there? Is it just the\nability to walk? I mean are there no more Native Americans or Buddhists\nleft on Earth (which is clearly who the Navi were based off of) to give\nhim that spiritual satisfaction? How does he feel about filling his\nbrother's shoes? Twin relationship? The conflict between scientists and\nthe military is not developed. Every supporting character was a stock\ncharacter. Michelle Rodriguez somehow manages to have a place in\nHollywood after literally playing the same type of character in every\nfilm she is in (Fast and the Furious, SWAT, Blue Crush...yeah just put\nher in a futuristic helicopter and thats her in this one). Was\nSigourney Weaver supposed to be a mother figure? How did the bad guy\nfrom the Last of the Mohicans feel about faking a Native American\nlanguage? The plot was totally predictable, and the dialogue was crap.\nIt was like James Cameron turned in his dialogue assignment a day late.<br><br>This movie deserves no award nominations at all outside of those in\ntechnical categories.\n"},
{"review": "\nI had high expectations going into Avatar. Now I admit, it's probably\nstupid to go into any movie with expectations that are too high, lest\nthey be crushed. However, even without high expectations, Avatar\nimpresses only on a technical level, and on that level only. The story\nis very predictable, and as I watched this movie I was overcome with a\nfeeling as if I had seen this all before in something in a made for TV\nmovie on SyFy. This is pretty bad considering this is the same guy who\nmade The Abyss and Terminator. I can only say that if you go see this\nmovie, expect beautiful visuals... and a standard humdrum story that\nyou've seen before if you follow any number of science fiction TV shows\nor just sci-fi in general. Oh, and if this is the 22nd century, why are\nthey still using manually propelled wheelchairs?\n"},
{"review": "\nOK, so I walked in to movie theater excited for what most have claimed\nto be an awesome movie. I walk out, however, brooding over certain\naspects of the movie that made it terrible. For instance, the idea is\nthat of Pocahontas, The last Samurai, and HUNDREDS of other movies and\nstories already out there. Beyond lacking originality, the screenplay\nsucked. Character development was even worse in this movie, as EVERY\nSINGLE character in this movie is flat,not a single one qualifies as a\nround character. Many parts of the movie were corny, some of the\nsupernatural aspects were really lame and stupid, and overall the movie\nhad the inability to move or effect the viewer. i must admit the CGI\nwas cool, but otherwise, this was a failure.\n"},
{"review": "\nWith a budget like this you would think that, at the very least, basic\nelements of a decent film should not be lacking. Well written story,\npassable dialog, above par actors, etc...<br><br>Well, welcome to Hollywood!!! Those things have been relegated to the\npast! No more worrying about where that clever plot twist will lead, or\nthat enigmatic character, or those subtle hints and tics in the dialog\nthat aren't in-your-face obvious. Avatar blazes a new trail to where\nMoney and Technology apparently rut for days, then pop out a bouncing\nbaby masterpiece!!! Rad! Where to begin? Stream of\nconsciousness/associative thinking might get it over with quickest.\nFern Gully in Space (minus Tim Curry's voice), Dances with Wolves only\nworse, and Smurfs without believable characters like Gargamel and his\ncat come immediately to the fore. Pastel overdose.<br><br>UNOBTAINIUM!!!\n"},
{"review": "\nIt was Terminator in the 1980's and then Titanic in the '90s and it's\ndefinitely Avatar in the 2000s!! <br><br>James Cameron is my most favourite director and he has once again\nbroken all boundaries and created a visual extravaganza.<br><br>Avatar is Cameron's latest magnum opus is probably one of the most\nanticipated movies since Titanic and now it seems that the visionary\ndirector has indeed created a film that'll revolutionise the world of\ncinema.<br><br>The movie is set in the year 2154 and is about a man called Jake who\ncan't walk and he is selected in the Avatar program where he has to go\nto Pandora jungle which is not a planet but it is one of the three\ngiant gasses that is about 4 light years away from earth. On Pandora\nthere are life forms such as the navis that are about 10 feet tall have\nsparkly blue skin, big eyes and tails. The humans have genetically bred\nhuman-navi hybrids known as Avatars. Jake is able to walk but falls in\nlove with a female navi and now he has to choose the side between\nhumans or the navis.<br><br>The film was absolutely fascinating, interesting, entertaining and\nemotional. I loved the look on the Pandora jungle and it must be the\nbest scenery in film history and the navis are definitely the best\ndigital characters since Gollum from The Lord of the Rings. The special\neffects are so amazing that Pandora looks like a real location and you\ncan mistake the navis as real characters. Avatar was almost 3 hours but\nit didn't seem that long. <br><br>Avatar already makes it on my top 5 favourite movies and I intend to\nsee it again and I am already waiting for it to release on Blu Ray\nbecause I'm sure that it will be one of the best Blu Ray titles.\n"},
{"review": "\nOf cause I already voted 1 to it, but I still wish IMDb allows me to\nvote -100. Avatar is the lamest movie I'v ever watched. If you watched\nDancing With Wolves, which is my favorite movie by the way, you know\nwhat I am saying. Avatar is just a sci-fi version of Dancing With\nWolves, and of cause a much worse version of that. The story is weak,\nthe characters are weak, the idea is weak. After 5 minutes you already\nknow what is going on in this stupid movie, and you don't need to be a\nhardcore movie fan to predict the ending of this movie. Other negative\nreviews already mentioned the every detail about why this movie is\noverrated, so it is not necessary to say that again in this review. I\njust want to share my disappointment. Actually what makes me really\ndisappoint is not the movie itself, since there are lousy movie all the\ntime, but the high rating on this movie. IMDb indicates people's favor.\nAnd I think Cameron fooled people once again. He leads movie this great\nart to a lower level not higher. It is so sad. Actually I have to say,\nas a thief (he stolen whole story from other movie), Mr. Cameron used\npeople, wasted people's time, and even worse he made young director\nfrustrated by the Hollywood movie law--high costs equals great movie.\nUnarguably, movie is visual art, it has to be beautiful. So it is\nobviously correct that more technics should be used in movie to make it\nmore visually beautiful. But if the visual beauty is the only thing\nleft in a movie, I have to say, it is not a movie, it becomes a screen\nsaver. So what is the point of a hollow beauty? It is just so sad that\nmost people are cheated by this hollow beauty.\n"},
{"review": "\nSorry to not be with the masses on this one, but I would classify\nmyself as being a little bit of a film buff in the sense that I've\nwatched so many movies, even if I don't like them and know I won't,\nI'll still watch it out of interest. And this film actually made me LOL\nat my own criticisms as it was too easy to criticize. Story = humans\nwant precious metal (or whatever), aliens occupy the area with said\nmineral, humans (americans actually) infiltrate in order to get,\ninfiltrator betrays humans. uh-huh. Writing = absolutely trash, who\nwrote this again, oh, I'm sorry, I didn't look for his (camerons) name\nat the end because I can safely say it'll be the last of his films I'll\nwatch. Honestly people, take a slight step back when watching this and\nyou realize that he is writing for the uneducated adolescents who need\nstupid sentences to understand, or, hhhmm a three minute running scene\nto show \"how emotional it must have been for him to reuse his legs\",\ncome on, as soon as he stood up I got it, BUT NO, 3 mins, corny\nheartwarming music, camera angles of his legs, then his smile, then his\nfeet, then smile, then legs all the time with somebody shouting after\nhim,n \"stop, you're not ready to run yet\". I mean, does this drivel\nreally constitute as a 8.5 out of 10. Actually, I'm getting too annoyed\nnow. Watch this film and imagine that it wasn't full of 1990's intro\ngraphics from good PC games, imagine them as people acting, and\nhopefully you'll see some sense. I found one good idea in the film,\nthat's the aliens can join up with the other animals/trees blah blah,\nbut other than that, not one other original idea, I mean, even the\nfemale aliens, look just like the alien equivalent of human females,\ncome on imaginations, where are you. Sorry James Cameron, I'm sorry\nthat you made Terminator (which I find is great) and you've slowly gone\ndownhill where you sell into the masses (who shoot in all probability,\nbe shot) rather than trying to make a good film.\n"},
{"review": "\nWhat a waste of money, energy, creativity and intelligence. Never\nbefore in the history of mankind, were we presented with such an\nenormous pile of dong disguised as a beautiful and lovely rose. And\nmost people, or sheep, bought it! Have people here lost their minds?\nBest movie of 2010? Don't we need a story to really feel a movie? To\nconnect to the characters being presented? To stimulate our brain, our\nintelligence? This \"story\" was a complete rip off of better movies,\nwith better stories and i feel insulted as a moviegoer. Gimme my money\nback...<br><br>There, just had to crap :) Feel better now\n"},
{"review": "\nThe plot is stolen from many different movies, there was only 3 good\nactors, the characters are either bland or stereotypical, and yet it\nmade almost 3 billion. When I think a film is overrated I usually like\nit. I don't think of it as Oscar worthy, but I like it. Then there is\nAvatar a film I not only think is the most overrated film in history,\nbut also on its own without the hype a terrible movie. It didn't have\nany effort put into the story at all. Star Wars took the ideas of many\nmovies together to create something epic, but Avatar takes instead of\nbeing inspired by these things is just being lazy by stealing the\nideas. It is an awful movie, but people and critics liked it. Why is\nthat? Well that is due to the effects. Few watching, or reviewing cared\nabout what the story was. All they cared about was the effects. Yes the\neffects and 3-D are great, but without the substance of a well written\nstory it fails. I don't care if the effects are the best ever. Giving\nthis film a good review based of the effects is like walking to your\ncomputer, and staring at the screensaver. You think it looks cool so\nyou look at it. Next time you look up it is 3 hours later. Would\nconsider that a good way to spend your time. No you would not, but you\nthink that Avatar is worth your time. This a movie that is destroying\nfilmmaking.<br><br>1 star out of 4\n"},
{"review": "\nI'm speechless... utterly speechless! This movie has earned how much\nworldwide - over 1 billion dollars? Why? They say there are only 5\nscripts in Hollywood and this surely confirms it. Throughout the entire\ntime I'm thinking Pocahontas and believe it or not - Fern Gully. The\nvisuals are pretty to look at with the forest being the leader. The\nforest during the day that is... because at night the forest turns into\na Disney style show of corny ultraviolet foliage and grass that glows\nwhen you step on it (a la the video of Michael Jackson singing Billie\nJean). Each animal is obviously based on an earth animal, only they\nhave more legs or extra eyes \u0096 apparently this is what passes for\nimagination these days. And the floating mountains - Miyazaki pulled it\noff years ago in Laputa:Castle in the Sky, in this film they're just\nplain out of place. The love story is predictably obvious and boring.\nAnd hold off on the popcorn as large portions of dialogue about the\nback-story are forced down your throat in the most unintelligent and\nobvious way. As for the culture of the tribe... well it seems to be a\nmix of almost every stereotypical African and South American tribe,\never... rolled into one big ball of naf unbelievable tripe. In short\nthis movie was really a waste of my time and money. And too paraphrase\na review I once heard in relation to another disappointing film in\nrecent years - With a budget $240 million this film really needs to be\neither a cure for cancer, or bloody entertaining; sadly it fails on\nboth fronts. James Cameron \u0096 disappearing for another 12 years would be\na true godsend!\n"},
{"review": "\nEveryone told me that this film was great, so i went out of my way &amp;\ninto the cinema ready for some great entertainment. Got a nice ice\ncream, got a great comfy seat up the back of the cinema and sat through\nthe trailers ready for the much raved about Avatar experience. Put the\n3d specs on &amp; soon realized that i had better things to be doing with\nmy time, &amp; walked out. I handed the specs back to the cinema dude, he\nlooked at me as if to say 'you don't like it\"? I smiled a reassuring\nsmile thinking to myself that James Cameron deserves to be hung drawn &amp;\nquartered, and vowed to never trust the common public again. Sitting\nthrough this American schmaltz was too much to handle. Avoid at all\ncosts!!\n"},
{"review": "\nI've never done this before... Even if I am absolutely aware of my poor\nlevel of English, I simply had to register. Just to be able express my\nfeelings and to leave my vote here.<br><br>This movie is something I didn't expect. After all those \"blockbusters\"\nI have seen in the last time, no one could convince me about the fact,\nthat this flick will be something different. Entering the cinema, I was\nreally skeptic and awaited just another boring shooter with some\nexpensive computer animations.<br><br>Well.. But then it happened. After just few minutes, I was completely\nsucked into the world of Pandora, I was there, breathed the air,\nenjoyed the extraordinary nature. I fell in love with the Na'vi and\nwith their lifestyle, their world.<br><br>For those 166 minutes, I completely forgot everything else, my work,\ntroubles, everything. This was the best experience, the best feeling I\nhad from a movie ever! Actually the movie was too short for me, even\nafter those almost 3 hours I still wanted more of it, can't describe my\nfeelings.<br><br>Leaving the cinema, I had tears in my eyes... couldn't stop them. I was\njust sad that I have to return back to Earth... Pandora was well... go\nand see it people and maybe you will feel the same I felt!\n"},
{"review": "\nThis movie actually blew my mind! I have to admit that it's quite easy\nto impress me, but when i left the cinema I was just amazed by the\nfeelings this film left. First of all to say is that the visual effects\nand the whole setting of this movie is absolutely unique yet and will\nbe for a few years still, I think. The Sorrounding on \"Pandora\" doesn't\nlet you breathe for several minutes in which you just cannot close your\nmouth. But this is NOT what makes this movie unique and so awesome! The\nstory is really a great part of it, and gives the film its spirit. OK,\nit IS predictable, but many tiny parts that are unexpected just give it\nthe suspense it needs. This is no \"switch off your brain\"-movie!!!<br><br>In my opinion this film is worth 9-10 stars, I'm giving 10 for the\ngoose-flesh it still gives me every time I see the trailer or hear the\nsoundtrack. This evening I'm gonna watch it again :-)<br><br>PS: Sorry for my bad English, I'm from Germany...\n"},
{"review": "\nThere's a lot of gushing going on for this film, and rightly so. After\na Summer of lackluster crap, along comes this magnificent film. For\nonce the hype was actually deserved. I won't talk about the plot, this\nfilm is best seen with as little information as possible. I will say\nthat I wasn't prepared for the experience, even as a jaded film-goer I\nwas transported and yes, moved. I didn't expect the emotional impact,\nbut Cameron is a master at pushing all the right buttons, and he does\nso here masterfully.<br><br>Some of the criticism lies in the \"surface\" quality of the plot, but\nagain, Cameron has never made deep, cerebral films. Cameron is an\nentertainer, and thank God for it. This film is pure, futuristic, ahead\nof it's time escapism. I was absolutely floored.\n"},
{"review": "\nI want to start this review with the note that this is my first review\never,i did not write one until now because i am a critical person and i\nhave not met a movie yet which moved me so deeply that i felt the need\nto write a review. <br><br>I saw today Avatar in 3d with some friends,i went to the movie knowing\nit has nice effects and visuals but with no big expectations, i do not\nknow if i have ever been more surprised in my entire life , this movie\nhas absolutely incredible breathtaking visuals.And here is the good\npart,it does not only deliver images which you could watch for days\nwithout a break,but the story is also intense and well written.When\nJake Sully takes control of hes avatar for the first time i almost\ncried, if you are a sickly person like i am,never been able to do\nsports or enjoy runs, then those moments will deeply move you,he\ndevelops so much joy and fun running around ,breathing deep, feeling\nthe nature ,it takes you in ,and makes you want a new body. Throughout\nthe movie i cried ( and i am 22 years old), i laughed ,i had shivers\nrunning down my spine,i had so much anger i nearly stood up and punched\nsomebody,and at some scenes my heart even skipped a few beats,which\nnever happened watching another movie before.This movie just overwhelms\nyou with emotions.<br><br>The outcome of the movie makes you seriously think about us people\n,about our lives and how we treat the nature and animals,about our\nbehavior as mankind,we enjoy killing and destruction instead of\nrespecting ourselves and others and the world that surrounds us. I\nrecommend this movie to anybody,especially those people who can\nunderstand the deeper meaning,it is very likely that this movie will\nstay with you for the rest of your life,and its sure that this is one\nof the best movies ever made.\n"},
{"review": "\nYou put your glasses on and you're in. A feast for the eyes at least\nfor the first hour. The brain, however, remains asleep. How strange\nthat such an ambitious enterprise could ignore its most important\naspect, the story. A rehash of other things with dialogues from a high\nschool play. Also, very self referential. The bitch! from Aliens truly\nomnipresent. I was surprised Sam Worthington didn't say \"I think I've\nseen an iceberg\" or maybe he did say it while I conceded myself a\nlittle nap - after the second hour - So here we are, facing a film\nfuture in 3D\" I will, still, long for characters in movies, people I\ncan, not just relate, but be inspired by, thought provoking and all the\nrest that goes with it. So, Cameron did it again and if money is at the\ncenter of the world, he remains \"king of the world\"\n"},
{"review": "\nAvatar was probably the greatest movie i have ever seen in my life. The\nspecial effects were jaw-dropping, and i didn't even see the movie in\n3-D. But i will go see it for the 3rd time this week, in Imax 3-D.<br><br>The emotions displayed on the characters faces were incredibly\ndetailed, especially Neytiri. It all looked so real. If i didn't know\nbetter, i would of said that they just went to a distant planet and\nfilmed aliens. It looked so real... This was probably the first movie\nthat i actually was disappointed that it ended. i really wanted it to\nnever end. The flying scenes were incredible, and the scenes when the\nhumans interact with the Na'Vi were flawless.\n"},
{"review": "\nwelcome back, James Cameron, One thing is Sure Avatar will break\nprevious ,the all-time box-office Titanic ...The special effects in the\nmovie is Byond Imagination, and Cameron showed us how to use them. Many\nof them he invented himself! The love story of Jake and Neytiri also\nreally touching one,plot which featured the conflict between two\nspecies, namely the Na'vi of Pandora ..<br><br>Humans tendency is exploit everything ...its resembles Spanish settlers\nEuropean atrocities against red Indian's Native Americans comparison\nbetween human vs navi .<br><br>Avatar's origins, however, come from the Sanskrit language Oldest\nLanguage in the World in sacred Hindu texts, and Avatar it's a term for\ndivine beings sent to restore goodness to Earth.<br><br>It is believed that these deities sent avatars \u0097 incarnations of\nthemselves in human form \u0097 to perform \"dharma,\" or righteous duty, to\nright wrongs or to restore peace and goodness.<br><br>And James Cameroon used Blue color which is similar to Hindu god Vishu\nand avatar Ram,Lord Krsna ! Star Wars,Matrix Trilogy all those Sci-Fi\nMovies where based on Eastern Philosophy Hinduism &amp; Metaphysics .<br><br>'Avatar' i epic adventure Above all its fun to watch along with a crowd\nin theater and not at home .!! <br><br>It was outstanding,unique,superb,unparalleled and keeps the audience\nspell-bound even after movie ends.<br><br>Avatar is a cinematic experience and an event, not a mere film it is\nMagic only James Cameroon can deliver.\n"},
{"review": "\nI don't understand how some people could criticize this outstanding\nwork of art, i never in my life felt so good watching a movie at the\ntheaters and i didn't even watch it in 3d.I liked all of Cameron's\nwork, especially aliens and terminator 2,titanic was OK but nothing to\nrage about,but this goes on to a whole different level, the scenes in\nthis movie are incredible,the imagination a person has to have to\ncreate a movie like this have to be beyond description,not even\ndistrict 9 comes close to some of the visuals in this movie, the\nstoryline amazing, what else can you ask for. I've read some comments\nstating that avatar does not belong in the top 250 movies on IMDb, as\nits numbered 26th i think,well not only should it belong there i\npersonally think it deserves to take first or second place on IMDb's\nlist for the pure genuine pleasure, and Cameron is ahead of time, he\nproved it in 1991 with T2 JUDJMENT DAY and he proved it again with\nAVATAR.\n"},
{"review": "\nSimple as that :-) This movie is more than most of you think. It has\nthe message. Cameron has certainly done his homework.<br><br>Have you ever heard of Gaia theory - living spirit of the planet (so it\nis not some dead rock as some of you may think) Or what about the\ntheory of the Akashi field? You have it here. If your soul is evolved\nsufficiently, you'll feel this movie.<br><br>What i find absolutely brilliant are not just the spellbinding effects\nor the depths of the story but the SIMPLICITY that is ingenious.<br><br>The most simple thing done in the right way can have the deepest effect\non you and Cameron did that with this movie (and just the line \"I see\nyou\" in the movie is a proof how brilliant and ingenious this movie is)<br><br>A milestone of the movie-making - and the message for the grabbing\nhands among us\n"},
{"review": "\nAvatar makes the best out of CGI in this live-action, emotional,\nputting you on the edge of your seat film of extraordinary proportions.<br><br>Just like James Cameron has done in the past he has brought something\nnew to cinema. He has directed some of the most influential and amazing\nfilms of the last twenty years some examples being The Terminator and\nTitanic. Avatar has now come to take it's place in such high rankings.<br><br>Watching Avatar is like being on a roller-coaster ride that you just do\nnot want to get off of. When you see it you'll know what I'm talking\nabout. With all of the action, sorrow, romance, and the fight to just\nbe there is absolutely no way that you can't enjoy this movie.<br><br>Avatar tells the story about a man named Jake that lost his legs while\non duty in the military. Now he travels to the world Pandora on a\nmission that could help him get his legs back. He is on a mining world\nwhere what they are digging up is worth a lot of money. However, the\nnatives of Pandora are called the Na'vi and their home is on the site\nof where they're trying to mine and that is where Jake comes in. His\nmission was to get them to relocate but in time that starts to change.\nHe uses an avatar (a body that looks like him and Na'vi as well) he\nuses this body to communicate with the Navi. While he is under their\ncare he falls for the princess of the Na'vi. As he feels more at home\nwith them the sooner he realizes that he must make a choice to side\nwith the humans or the Na'vi and find his true place in life.<br><br>Avatar is probably the most amazing film of not just the year but the\ndecade. This is a film that you would love to see over and over again.\n"},
{"review": "\nWell, I'm going to have to give this movie a full rating because it\nreally lived up to my expectations.<br><br>We have here a science-fiction epic set on an alien world. It's a\nclassic story of a \"good-guy\" hero who must overcome a battle within\nhimself to do what is right.<br><br>Although the movie doesn't exactly have the biggest twists, turns, or\nsurprises, it simply sets out to do what movies like \"Star Wars\" (the\nones in the 70s, and 80s, that is) did... to stun us a little with the\nlatest in special FX, give us a classic \"Romanesque\" story, and enchant\nus with a very creative world. This movie did what it set out to do,\nperfectly... and maybe even a little better than perfect.<br><br>The world is so detailed, and rich. Every animal looks as if it is\nreal... and everything just matches and seems convincing. The\n\"humanoid\" race that inhabits this world is very interesting, and the\nway the world works \"together\" is amazing. This may be one of the few\nsci-fi adventure movies where the computer animation actually works in\nfavor of the storyline. Animals and beings do not look like animations.\nThis realism, this pushing of the limits, is what science fiction is\nall about.<br><br>But you obviously cannot have just a beautiful movie without no\nstoryline or character to back it up. There is a lot of character in\nthis movie. All of our human characters, the alien race, and the\navatars all equally have great character. And the storyline, although\nnothing extraordinarily original, is chiseled from \"classic\"\nstorytelling. Good versus evil... doing what is right... all spun\nneatly together.<br><br>What a wonderful escape this was! It was dazzling, and even got me\nthinking a little about what life is really out there on the various\nbillions of stars that make up our galaxy, and the other billions of\ngalaxies out there.<br><br>And that's what movies like this should do.\n"},
{"review": "\nI just saw 'Avatar' from sridar,our dear theatre.I was astonished by\nthis movie.James cameron is the most futuristic director ever born in\nthis world &amp; Avatar is the most advanced movie you'll ever come\nacross.I cant think of a world beyond Avatar.It shows you the farthest\nlimit of human imagination.The story &amp; screenplay is so superb that\nyou'll scream out after the movie saying 'I am blessed to see\nAvatar'.Its a masterpiece in movie-making. Don't compare it with\nclassic dramas.Because all the action in Avatar is happening out of\nthis world.So change the way you think.You'll love this\nmovie.Everything goes well in this movie.The Highlight being the\nspecial effects.The world 'Pandora' is amazingly beautiful.Sam\nworthington cements himself to the big league.Joe zaldana was also the\npick out.Nice background music thanks again to James horner.All i have\nto say is three words, Hip Hip Hurray........ 10/10........\n"},
{"review": "\nI just came home 5 minutes ago from seeing an early morning showing in\n3D. My expectations were pretty high in seeing this movie as lets face\nit, it's James Cameron. James has consistently made great films through\nhis career and he's tried to better himself every time, but still\nmaintaining to entertain the audience. This time round he have excelled\nin every aspect of film-making.<br><br>Right, down to the film. All the backlash from the first teasers were\nforgot within the first 30 minutes of viewing, and I'll never listen to\ncritics in the future ever again. How wrong they were. Sure there were\nelements of other films like Dances with Wolves, but I saw greater\nconnections with the Final Fantasy VII game. I'm not even prepared to\nsay that the comparisons are a bad thing, as this film (in my opinion)\nis greater than anything it will be compared to. A bold statement I\nknow.<br><br>Now Pandora is a world needed to be seen in 3D, I'm sure the 2D version\nwill be a great movie, but you won't feel like you are actually there.\nThe realism in the visuals is far greater than anything I have ever\nseen, the CG characters make Gollum look like Roger Rabbit. The world\nappears real like our own and you connect and feel for the place and\nits inhabitants towards the end. I really wanted it to be as real as it\nseemed.<br><br>If you are familiar with the plot, you will be please to know that any\npolitical statement made, its not one forced upon us throughout, its\nsubtle, but the message is clear. As the audience, you are allowed to\nforget about our own world troubles and be part of an amazing adventure\nthat will stay in your mind for a long time. Bravo James Cameron.\n"},
{"review": "\nFirst of all I would like to place upon my sincere thanks towards Mr\nJames Cameroon for taking his valuable five years of his life for\nmaking a movie no one except him could have ever imagined.. Being under\npressure of humongous amount of money stake he carried the expectations\nwith ease and expertise.. This is not just a movie.. Its a rich\nexperience which may eventually blow of your mind.. All in a future\nhigh-tech metaphora, of enormous weaponry and spaceships and a\nprimitive jungle world that's both weird but also so familiar...<br><br>Hats off to James for his thinking and imagination..(He even created a\nlanguage for the creatures living on the James-made-Planet).. For\nperformance I would love to take two names: Sam Worthington and\nMichelle Rodriguez.. Both were superb in their roles.. Sam's simplicity\ninitially will take you as a surprise and watch out for his performance\nduring the fight sequence as a Na'vi.. He will surely walk away with\nloads of accolades.. Cinematography is pragmatic and enigmatic.. VFX\nand Graphics used are marvelous.. James' Direction is humongous superb\nand breath taking.. After allowing the likes of Michael Bay and Roland\nEmmerich to try and direct large action films he returns to show them\nhow a master does it..<br><br>My advice: \"Take out 3 hrs of time out of your lives(even if you are\nnot a movie buff) to enjoy an experience nobody ever imagined.. Just\nbuy a tub of popcorn and a soft drink and enjoy\"<br><br>My Rating: 9.5/10<br><br>Thanks &amp; Regards\n"},
{"review": "\nThis film is simply extradionary. nothing compares to it, Cameron has\ncreated an entire new world, with new creatures and even a new\nlanguage.<br><br>The story keeps you intrigued, you don't notice the 2 and a half hours\nand the battle scenes are simply sublime.<br><br>i read a guardian review before seeing the film that gave it 2/5 and\nlikened it to aliens but he should be fired from his job, really cant\nunderstand how anyone can not like this movie, even my gf who said it\nlooked crap and they were smurfs ended up loving it and has agreed to\nsee it again next week with me. The 3D doesn't go for the gimmicky pop\nout of the screen at you but instead just adds to the experience in a\nsubtle way.<br><br>A lot of people are jumping on the bandwagon saying how amazing Cameron\nis cause they have seen titanic, i loved Cameron's movies before i knew\nthey were his. By the time i was 12, T2 and Aliens were my 2 favourite\nmovies of all time before i even knew anything about directors etc, now\navatar adds to that list.<br><br>Quite simply see this movie, it is most definitely one that you will\nneed to see on the big screen preferable in 3D for the full experience\nand if you don't have a blu ray player by the time this is released on\nDVD? GO GET ONE!\n"},
{"review": "\nI've seen over 5000 movies and stopped counting a long time ago. This\nmovie is absolutely one of the most amazing movies I have ever seen. I\nusually don't like to use clichés, but this movie is breathtaking. I\nfelt like I wanted to be there and not here (planet earth).<br><br>Anyone who has read enough and seen enough eventually realizes there\nisn't much new being presented in the world. So, it comes down to how\nsomething is presented to the audience. That can change and be new.\nAvatar, although incorporating some ideas from other sources, is still\nin itself a completely original movie. The last movie that had an\nimpact on me like this was Star Wars.<br><br>Strangely enough, if you look at reviews for such movies such as Star\nWars, Lord of the Rings, and even Casablanca, Lassie-Come Home, and\nSinging in the Rain you will find that there are pooh-poohers and\nnaysayers out there who generally want to rain on everyone's parade for\nvarious reasons that don't have anything to do with reality. I imagine\nthese same people hate Christmas too, and maybe they hate themselves\ntoo.<br><br>This movie is great and James Cameron has done an outstanding job in\nbringing this extraordinary creation to the screen so regular people\nlike me can have an amazing adventure. This world needs more people\nlike James Cameron whose focus is on giving the best possible quality\nand more to all the rest of us.\n"},
{"review": "\nI actually feel like I've just seen the most beautiful painting ever\npainted, allowed entry into it and that I've stayed there for 2 and a\nhalf hours. I feel like I became part of this world and now, at home, I\nkind of miss the scenery, the animals, the people and the nature of the\nplanet.<br><br>This movie is more groundbreaking than Jurassic Park, Star Wars and all\nthe other historical movies that you've read about. Though the story\nand the plot is not very original, like a mixture of Dances With\nWolves, Pocahontas and, well, The Matrix, it doesn't really matter. The\nmovie is not about changing your perspective on anything, imprinting\nsome morals or shaking your beliefs, it's just about entertainment.<br><br>Thank you James Cameron. I actually am one of the few who didn't like\nTitanic, I thought it was too mushy and story-lacking... but this, man,\nthis is something else. I won't be able to watch another movie for\nweeks because, why bother?\n"},
{"review": "\nI was expecting a lot and I did get a lot in the movie. So much so that\nVatican felt threatened and made a statement on nature worship and\nNeoPaganism as they have monopoly on any GOD about some themes in the\nmovie. Graphics is best in class and actually I had motion sickness,\npersonally I may not see more 3D movies because I cannot take it. Let\nyour self roll with the movie and wander where the movie want to take\nyou. Race is shown little bit but usually very abstract themes don't\ndrive home a major point without some simple analogy and analogies are\nlogically related in the sense not in totality, hence futility of\npeople finding race question here. There are some scenes of hanging\nrocks and holographic screens which I think are for entertainment\npurpose vs enlightenment of young minds and are truly quite original\nthough journey to the center of earth did introduce the concept.\nNa'vi's speaking English makes me wonder what point we are making there\nbut let us not hang on that theme because you will loose the effort\nspent in getting Na' vian language up to speed. Na'vi people are not so\nrealistic but just think that movie is a super hit without that because\nMadagascar has a better eye coordination with mode and dialogues. One\nmore point, Avatar is an Indian word meaning reincarnated self of\nusually God or superhuman being and quite well chosen like Yoda\n(another Indian word meaning warrior from Star Wars). All in all buckle\nup and get ready for pretty fantastic future like Wall.E, it may be a\nmatter of choice in future to have or not have and struggle.\n"},
{"review": "\nJames Cameron once more shows that he knows what he is doing. I finally\nget to watch it yesterday in 3D after waiting so long, and it was worth\nall the reviews and even better. I am still in shock from what I\nexperienced. The visual effects and the 3D experience in the movie- you\nhave to watch it with your own eyes to feel the magic James Cameron has\ncaptured with this masterpiece. Acting is excellent, you can't ask for\nanything more than the actors gave from science fiction. Whoever said\nno love or passion in the movie is mistaking big time, it has something\nfor everyone starting from astonishing score (bravo! James Horner) and\nlove story, big epic, awesome war episode and a unrepeatable beauty of\nPandora- WOW. If you didn't like the movie at any point, you seriously\nneed to see your doctor. After coming out of the cinema, all I could\nthink about was to go back in, so that's what I am doing today and\nprobably tomorrow as well. Thank you, James Cameron for the best\nexperience of my life!\n"},
{"review": "\nHow can people always find something to complain about even for the\nbest of the best, always amuses me. <br><br>What's wrong with the Storyline? Ya, it is something that we have seen\nbefore.. No.. I am not referring to the past movies with similar story\nlines.. I am talking about those Natives in America, Aborigines in\nAustralia, the natives of Africa, the countries oppressed by Colonial\nEngland, the oppression of communist China.. The greed of corporates\nand governments that killed millions of people because they were the\ndominant ones at that point in History! Yes, where we have seen this\nstory before is in our History as humans!<br><br>Well, when someone is making the most expensive film of the century and\npours all his passion and imagination into it, I am proud of James\nCameron that he chose this Storyline and not some silly Military story\nthat glorifies war or a meaningless rambling about the significance of\nan old and irrelevant book! He knew his movie was going to be watched\nwith passion the world over... What better message can he convey to the\nworld with his movie than saying, men and women of the future! you\nbetter see this movie.. Remember all the sins your forefathers\ncommitted in this world.. Be compassionate and don't ever do it again!<br><br>I would say this to the haters who complain about the lack of\noriginality or the lack of emotional strength. The movie does move you\nif you are prepared to be moved. The movie conveys a message if you\nwant to listen to it! If you think there is no message or that you are\nnot moved, then it is because you do not have the heart to understand.\nI am sure there are such people in this world. If everyone in this\nworld was compassionate enough to understand this message, why were\nthose sins against humanity committed in the first place!\n"},
{"review": "\nI've seen a great many movies in five decades of life in this \"age of\nmedia\", and I've seen quite a pile of IMAX 3D features as well. Within\nthe latter domain, this movie is really nothing special. I mean, yeah,\nit's VERY cool if you've never seen live-action IMAX 3D before. All\naround me during the screening I could hear the new initiates in the\naudience experiencing the giddy delight that strikes so many of us on\nour \"first time.\" But what was very apparent to me as a seasoned IMAX\naficionado was the difference between the live-action scenes and\ncomputer-generated ones. Though still spectacular by virtue of the\nsheer screen size, CGI 3D still has a long way to go to rival what IMAX\ncameras can do.<br><br>That said, the tale itself is simply wonderful. Yes, as other reviewers\nhave remarked, it's an old and well-worn storyline. But then, as many\nfilm reviewers have pointed out time and again, there are really only a\ncouple of dozen different basic story lines in existence to begin with,\nso if you've been around the block a few times as I have, they all look\npretty familiar in one way or another. However, what sets Avatar apart\nis that it an essential parable for our times . . . and if you are\nTRULY willing to look and listen, you will find it resonating within\nyou at a level that goes far, far beyond the messaging of messaging of\neven the best of Hollywood's standard film-fare. Cameron has a way of\nreaching to an emotional depth in the sapient viewer's soul that nobody\nelse in cinema comes close to. And upon this power he overlays a subtle\nyet vital message to which we simply must pay attention. For that\nreason alone, Avatar is an absolute must-see for all.\n"},
{"review": "\nI went today with my husband and two sons simply because I didn't want\nto be left out. After all, I thought it was just a bunch of blue aliens\njumping and flying around. I also do not enjoy wearing the 3-D glasses\nas they give me a headache. Then I saw that it was 2 hours and 40\nminutes of wearing those glasses and watching blue aliens. Needless to\nsay, I had extremely low expectations. I'm not one of the people that\nhas been following and anticipating this movie for years.<br><br>As it so happened, I absolutely was mesmerized by this movie. I loved\nthe plot. I'm sitting there thinking someone had to have been on crack\nto come up with the world of Pandora due to how creative it was. I\nreally want to go there and fly on those dragon-like things. I thought\nthe transformation of Jake was so cool. The 3-D effects were amazing,\nbut I would have definitely enjoyed this movie without it.<br><br>In fact, I have only seen one other movie more than once in the theatre\nand it was Titanic...another James Cameron movie. I can tell you that I\nwill see this one again and I can hardly wait to buy the Blue-Ray disk\nand see all the extras on how they made the movie. That will be\nawesome!\n"},
{"review": "\nWow is really the only word to describe this movie. I haven't felt like\nthis after a movie...ever. I left that theater and was disappointed\nthat Pandora wasn't a real place. The land scape is utterly breath\ntaking in every way, it is everything your imagination can imagine and\nmore, amazing in a sense I can't relay to you. I don't care what you\nhave planned or how you can't afford it. Cancel what you have to and\nfind the money! People are saying that the plot is mediocre, trust me,\nthat's not what this film is about. I wish there was more! Even in the\n2 and a half hours I was there I felt like I experienced a completely\ndifferent life/world. Absolutely a must see for anyone with an\nimagination. SEE THIS IN 3D!!! You HAVE to see it in 3D, everything\ncomes alive, you become a part of the surroundings. Most amazing movie\nI have seen to date.\n"},
{"review": "\nWatch everything in your life you'd have ever wanted to appreciate,\nbefore you watch the AVATAR , there won't be anything you could ever\npraise but AVATAR , once you'd seen it! There's no guessing game and\nnot too much of the plotting, it was objective and smart with its\nclichés ,it keeps you glued and pays you many times more to you than\nyou paid with every second.<br><br>A complete lovable heartfelt connection of man with an alien, an\ninstinct to survive and the way of life , a journey from the underdog\nto the leader , a journey from pandora to earth! I loved it for its\nbeauty, i love it because it surpassed my imagination, this was my\nlife's greatest spectacle after 80 days around the world!\n"},
{"review": "\nIt's movies like this that are a reminder that story should always be\nthe number one priority when making a movie. The amount of clichés at\nmultiple phases in the movie is unbelievable. It would be too easy to\npoint out obvious and rather blatant rip offs that occur throughout\n(going into a misunderstood tribal group, sacred trees, being in tune\nwith nature). After all I was almost shocked I didn't see the writers\nof the Disney version of Pocahontas credited as assistant writers.<br><br>After saying this, I have to give credit where credit is due. James\nCameron's vision for film making is unmatched by anyone. The visuals\nare outstanding; entertaining and saved me from regretting laying down\nthe extra two dollars to see this film in 3-D (it's not worth it to see\nthe regular version). It is obvious that Cameron has unparallel\ndedication and drive to make a film that people will want to see. This\nsame dedication and drive made him want to handle writing this one\nhimself. Few posses the power to demand the type of budget that Cameron\ncan and it's obvious this film could not have been made without a\nsubstantial budget. If you would have combined this new ground breaking\nand visually stunning technology, with an equally moving and unique\nscript then that's the movie I want to see.<br><br>Am I disappointed I invested 162 minutes and $10.50 into this movie?\nNo. The visual themselves are worth the price. But at points you will\nbe nauseated, you will roll your eyes, and will ask the question: Why\ndoes Hollywood not think we can handle a good story anymore?\n"},
{"review": "\nMy fiancé and I bought this while on vacation for something to watch in\nour hotel room, figuring after all the rave reviews that it would be a\nsolid choice. By the end, the two of us were slack-jawed - not by the\neffects, which, granted, were very visually attractive, but by how a\nmovie so formulaic, so full of ridiculous clichéd one-dimensional\ncharacters and simplistic dialogue, could be the talk of the world.\nJames Cameron has an amazing eye for aesthetics, but he seriously need\nto find someone with a gift for writing scripts, specifically engaging\ndialogue. Everything about the plot, from Sigourney Weaver essentially\nreprising a watered down version of her role in Gorillas in the Mist to\nan evil army commander who reminded me of a sad caricature of every\n'ignorant, war hungry army guy' ever made, the characters just... don't\nmatter. It's saddening that this movie is sliding by on its visuals to\nsuch a high rating. If you want to watch the exact same story, only\nwith more moving dialogue and far less bloat, rent Fern Gully: The Last\nRainforest. Cameron pretty much ripped off the entire plot from it,\nanyway. I dread the sequels...\n"},
{"review": "\nBeyond the storyline there is something very valuable. This Film really\ndemonstrates to me the importance of recognizing beauty in the world.\nLets all wake up and see the beauty in our own world, in our\nrelationships, in our daily tasks. Lets make life sacred again. Lets\nlive through our fears and not reside in comfort. Embrace life and fill\nourselves with love until it overflows into the world. Lets create\nheaven on earth! <br><br>I know there are people who would not agree with my views; however, its\nall in the eye of the beholder. Obviously this film has flaws, maybe\nthe story is not very original, or the script for that matter. To me\nthis film didn't need to be perfect. I feel it is a timely work of art\nthat represents where we are as a species. We are at a place where the\nway we are living isn't working anymore. Disconnected from the earth,\ndisconnected from each other, we are starving for a more raw genuine\nway of life. A world where giving is as important as receiving, and we\nunderstand the connection we have with our environment. If we all think\nof the earth as a being, or an organism, then we the people are like\nthe bacteria. Some bacteria are helpful and some are harmful. Just like\nin our own bodies, when there is a harmful bacteria the body attacks\nit! Think about natural disasters or disease! The earth needs our love.\nIf we treat it well..it will treat us well. No movie has ever addressed\nthis issue so masterfully.\n"},
{"review": "\nAt first, I was rather skeptical of the movie, I heard Avatar and\nthought 'The Last Airbender'. Then I saw a trailer and became enamored\nwith the movie. Then, when I went to see the film, it lived up to my\nexpectations and them some. Granted, the plot is not the strongest\nfeature of the movie, but it is there and it makes everything flow\nalong nicely. The important characters get plenty of screen time and\nare all pretty likable, especially the main antagonist, Colonel\nQuartich. Okay, maybe likable isn't the right word, but he's cool. And\nextremely BA, because who would kick out an airlock to shoot at people?\nOr barely reacts to being on fire? Anyways, none of those people are\nthe real star of the show. The world, Pandora steals that title. It's a\nrich, alien world that will be a feast for the eyes. The wildlife is\nfamiliar in concept, but completely alien. Also, one last thought.\nWhile the wildlife looks absolutely amazing, so does everything else in\nthis movie. The machines, the Na'vi, the world, the people. All of it\nlooks fantastic. And, shell out the extra money to see this in 3d,\nignore the headache, and prepare to be amazed.\n"},
{"review": "\nAfter seeing this movie Friday night, I don't see how anyone could walk\nout of the theater having watched this movie and not be impressed --\nespecially if it was seen in 3D. I saw this movie in Digital 3D and it\nwas truly the most incredible cinematic experience I've ever had. I\nplan to re-watch it in IMAX 3D later on. What Cameron and his team\ncreated was more than a movie -- they created an experience, one that\nshouldn't be missed. If you miss out on this movie, you miss out on\ncinematic history. The world that Cameron and his team created is one\nyou may never want to leave. I didn't feel the nearly 3 hour length of\nthis experience -- to me, it breezed by. It's unforgettable.<br><br>Granted, its familiar story has been told numerous times, but Avatar\nsucceeds in making it feel fresh with new ideas and absolutely gorgeous\nbeauty. The familiar story doesn't diminish the experience in any way.\nIt's chalk-full of memorable moments and the final battle alone is\nworth the price of admission.<br><br>See it. Really. I don't say this as a fan of this film, I say this as a\nfan of film in general.\n"},
{"review": "\nI want to say for one, that this movie was EXTRAORDINARY! And for what\nit's worth comes everything you can't possible imagine of what Cameron\nhad in store for the audience. It was mesmerizing to see that the 3-D\nlived up to its hype and and wowed everybody in my theater. Like only 2\npeople used the bathroom within a 2 and half hour period!? That is the\nmark it left with audiences when it first appeared on screen. Nobody\nknew what to expect, and in the following, everyone got what they\ndidn't expect which was lush colorful movie with some great CGI that\nwas perfectly complimented with a great story... Some will beg to\ndiffer, but the real star is the 3-D. Yes, the 3-D! Wow, It has as of\ntoday changed the way will see our entertainment and how we view it. So\nladies and guys I would prefer everyone to see this cause it is only\nworth the time on the big screen while still in 3-D format. 20/10..\n"},
{"review": "\nI'll make this short and sweet... (Though if I could, I would write a\nBOOK about how much I loved this movie! I am too sick to do so, so it\nwill have to do with a short review!) I was so incredibly TOUCHED by\nthis movie! It was SO beautiful on so many levels, so realistic, so\nincredibly huge, over the top, and utterly mind-blowing in all\naspects!! I saw the 3D version and just sat there in awe, even all\nthrough the ending credits... I could NOT close my mouth! My jaw was\nall the way down there, right there, on the floor of the movie theater.<br><br>Dear James Cameron: I want to LIVE on Pandora. To me, it was, and still\nis, very much real! The characters were so real and GOOD that I like\nthem better than most people I've met! Sigh... Two lives.. What an\nidea.. I wish I could wake up as a Na'vi one day! Avatar made me cry\nseveral times though the movie. I am a 31 year old male, FYI. The first\nthat I cried when watching Avatar was when I realized how beautiful\nPandora was. Then again when I understood how good, innocent and pure\nthe Na'vi were. Neytiri is probably the most beautiful personality I've\never seen anywhere, in movies and in real life, and I absolutely fell\nin love with her soul. I cried when I saw Neytiri and Jake Sully kiss.\nIt was such a beautiful moment. Then I cried when I just understood how\namazing this movie really is - The whole meaning of it. It was just...\nToo much!!! There was just so much LOVE in this movie! Mr. Cameron,\nyou're a Genius! Best movie of the year, and probably the best movie I\never saw. . .<br><br>Thomas in Norway\n"},
{"review": "\nYes, the special effects were impressive - but they just went on too\nlong. The first segment, where she was teaching him about Pandora, had\nsome magnificent effects, but I really did not need 20 minutes to get\nthe point. Then, the first \"war\" although horrible enough in its\nunreasonable ferocity of modern war power against the natives with only\narrows and spears was followed up with another one, even more horrible,\npurely for the sake of the special effects. I was holding my ears and\nclosing my eyes, the mass destruction of these wonderful people was all\ntoo close to the American destruction of the native American Indians,\nwith all its destructiveness. There was no character development, the\nacting was so simplistic, the plot formulaic, the dialog trite and\nsimple.<br><br>I wanted to like this film, but was ready to leave about half way\nthough - and if Cameron had held to a disciplined directing mode it\nwould only have been half as long and a much better picture.\n"},
{"review": "\nThe only thing this movie did for me was make me soooo bored I actually\nstarted remembering the plot of FernGully. Which I hadn't seen in like\n18 years. I couldn't even remember its name. When I arrived home I\nfuriously searched the internet for this mystery movie that I had\nforgotten and that Avatar somehow reminded me of.<br><br>Then I found it and realized that it's exactly the same plot, except\nthat it's a movie for children - which incidentally AVATAR also is,\nit's just that it cost 500$ billion, or whatever, to make so they had\nto pretend like it was for adults, but it really isn't. It's a kid's\nmovie, and a 2 hours too long one at that.<br><br>Frankly, what surprised me most about it was that it gets such good\nreviews... from almost everyone. I'm going to sit and wonder why for a\nwhile.\n"},
{"review": "\nLet me start by clearing a few things up. Avatar is the kind of film\nyou have to see in the cinema to enjoy it fully ( and in 3D if\npossible). I was lucky enough to stumble upon the film a few months ago\nand foolishly dismissed it. Then two days ago me and a few of my\nfriends were on our way to see 2012 and got stuck buying food and so\nwere very late. We decided to skip 2012 and go see Avatar instead.<br><br>A full 165 minutes later I walked out of there fully convinced of that\nJames Cameron is a certified genius. The amount of detail in the world\nthat he has created for the Na vi (the blue people) is astounding. The\nlevel of colour and detail draws you in like nothing I have ever\nexperienced and the 3D really is incredible.<br><br>Now the main point the critics of the film focus on the storytelling\nand its slow pace towards the beginning . Now not only is this an\nunjust and misleading comment but it is a total lie. The film sets up a\nbeautifully crafted story that demonstrates the power of human emotion\nand what happens when we loose site of it. There was not a single\nmoment in the film where I was wondering what was happening or why and\nI doubt that any director could fit such a breathtaking story into\nanything less that 2 hours 30 minutes. It once again proves Cameron\ncreative genius and gives us a terrifying insight into the path that\nhumanity is taking and what we will become. He has always tried to\nhighlight this in his past films with Carter Burke in Aliens and\nCaledon Hockley in Titanic, both portraying the bastard capitalists.<br><br>There are very few things that can be leveled against this film but I\ndo not believe that I can think of any. In my view Avatar is not just\nthe best film I have ever seen but the best cinematic experience I have\nhad in my 15 years in this world.\n"},
{"review": "\nI only have four words to say really<br><br>OH MY F**ING GOD!<br><br>oh and the 3d is just the final touch to complement the experience just\nas a beautiful and sexy lingerie complements a divine body...<br><br>HOLY MOTHER OF MOSES! AND ALL THE BIBLICAL CHARACTERS AND DEITIES EVER\nIMPROVISED BY HUMANS!<br><br>Don't expect to read any plot summaries here. That would be pointless.\nThis is a classical story taken a step further. Just stop reading silly\nreviews and go watch it fool!<br><br>P.S. Apparently there is a longer version waiting to be released on\nBlu-ray. I can't wait...\n"},
{"review": "\nTerminator, Titanic, these are the names everyone have heard of. What\ndo they have in common with Avatar? An avangard director by the name of\nJames Cameron. This was my first IMAX 3D experience and this turned out\nto be a visual extravaganza. In recent past, Hollywood has produced\nsome stunning movies in the genre, and we knew something great is\ncoming, and this movie shows how far we have come; this is what we had\nbeen waiting for. This is the benchmark of the 21st century\naction-adventure-sci-fi experience. The movie is about Jake Sully (Sam\nWorthington), a paraplegic marine, who travels 4.4 light years to come\nto Pandora, under the banner of Avatar program. Pandora a lush green,\nlow gravity moon of Polyphemus, inhabited by hominoid race called\nNa'vi. A Na'vi is nine feet tall, have bones reinforced by naturally\noccurring carbon fibre, have bioluminescent blue skin, big eyes, small\nears and a tail. They live in harmony with nature and worship a mother\ngoddess called Eywa. Members of Avatar program have successfully\ngenetically engineered human-na'vi hybrid knows \"Avatar\", that can be\nremotely controlled. Jake's mission is to infiltrate the Na'vi camp,\ngather Intel and reconcile a treaty with them to move their camp, which\nhappen to be resting on large deposit of \"unobtanium\", the reason for\nhumans to come to Pandora. Failing to convince the Na'vi's and\nsimultaneously falling in love with them, their culture and a Na'vi\nname Neytiri (Zoë Saldaña). When Colonel Miles Quaritch (Stephen Lang),\ndecides to go all weapons free on Na'vi population, Jake sides with\nNa'vi's to give them an edge in the \"battle of bows and arrows against\ngunships\". The visual effects in the movie are truly groundbreaking.\nThe movie is interesting, entertaining, emotional, and action packed;\nan overall awesome performance. Animation, characterization of Na'vi\nand other Pandora creatures are by far the best I have seen. A must\nwatch. Treat yourself by watching it in IMAX 3D.\n"},
{"review": "\nAVATAR is the Jurassic Park of this generation, with no doubt is it a\nfamily film, but it is also a hybrid of everything good in Cameron.<br><br>Firstly, The highly-talked about visuals have given me, and the\naudience a true experience, if that is counted by the number of gasps,\nclaps and heartbeats of every audience member, I seriously didn't get\nthat in Transformers or 2012, people literally gasped when Jake\nexplored the Bio-Luminescence nightlife of Pandora, now that is\nsomething you don't usually get in films! But this film isn't just\nabout visuals, it's about the magic of film-making. And that is\nsomething rarely achieved in such absolute beauty, beauty that leaves\nyou walking away from the theater, wanting to return the next day, and\nthe day after that. I have never felt so good after watching a movie, a\nmovie that holds such beautiful magic, since the original star-wars\ntrilogy came out back in the 70's and 80's.<br><br>The film ends leaving you wanting more, it starts by slowly enticing\nyou, then gradually building up into one heck of an adventure, rolling\nat such a speed that you'd never think it would end, but films end\neventually, and I just hope that we are given more in the future, so\nseriously, enjoy the power of seeing it for the first-time, watch it\nwith a fresh-mind, an empty bowl and zero distractions because the\nworld of Pandora awaits, the trip of a lifetime to an alien world\nbeyond your imagination!\n"},
{"review": "\nI went with my two kids, one is 16 years old and my daughter 9 years\nold. Afterwards by the buss stop, we looked at each other, and in\nunison we knew and agreed, we had experienced something extraordinary\nat many different levels, an once in a lifetime moment. This is truly\nby far the movies of all movies. The only bad thing that I can say\nabout this movie is I never wanted it to end, all from the jaw dropping\nscenery to the emotional computer graphics. I takes a hold of you as I\nnever experienced it in the theaters before.<br><br>I feel blessed and grateful, really honored by the makers of Avatar,\nfor letting us share this beautiful adventure, it is truly a milestone\nin motion picture history !\n"},
{"review": "\nI was lucky enough to get tickets to see this in 3D yesterday - and\nboy, am I glad I did. AVATAR was...simply amazing. I can't think of a\nword good enough to give it the credit it deserves. <br><br>What I thought was extraordinarily brilliant about this film was the\nway it made me genuinely dislike the race of human beings. The humans\nassume they know better, assume they are superior, and ultimately play\nthe part of well, human beings, exactly right.<br><br>There are scenes within AVATAR that depict a destruction of a beautiful\nworld, and I literally had to hold my hand to my mouth for some of them\nin horror. In fact, a number of times I surfaced from my stupor and\nfound my mouth gaping, along with my sister and all the rows of people\nnext to me. The CGI effects of some of these scenes were incredibly\nwell done, which meant that the scenes of destruction were especially\nshocking to the eyes.<br><br>Indeed, I even found myself approaching tears a number of times\nthroughout, which felt strange because I'm usually very hardy. However,\nthe experience was so vivid and so intense that I just couldn't help\nbut get completely sucked into the fictional world of Pandora. Even the\nNa'vi themselves - these huge, blue, glowing humanoids - the more I\nwatched them, the less alien they seemed and the more...'human' they\nbecame. The transition the film takes to turn your opinion is just\namazing. Rooting for the Na'Vi? You bet.<br><br>\"There's no green there. They killed their Mother...\" For those who are\na fan of nature, of films like Fern Gully, this is for you. Just\nbecause AVATAR is of the fantasy genre, it doesn't mean it doesn't\ninvolve a very real, very relatable message for us all to pay attention\nto.<br><br>This isn't just a film, this is an experience. You just have to see it.\nBeautiful, breathtaking, and nothing like you've seen before.\n"},
{"review": "\nI must admit I had my doubts about this movie when I saw it in previews\na couple months ago. I really didn't know what to think of the movie\nthen. I saw this movie twice, the first time in regular 2d and the\nsecond in 3d. I have to say I was simply astonished at the visuals in\nthis movie. Some scenes do tend to \"pop\" out a little more than others,\nbut I was simply transfixed and awestruck not only at the incredible\nlook of the movie but of the storyline itself. This movie really makes\none think about life and how we might not be the only ones in the\nuniverse. Science fiction usually brings about thoughts on this, but we\ndo have the \"Kepler probe\" already out there looking for another\nhabitable planet, that isn't science fiction but is a reality. This\nmovie also brings up another incredible aspect humans have struggled\nwith. Humor me and go along with me for a minute - If a hundred or so\nyears from now the human race had actually found another habitable\nplanet and there was a less-advanced civilization living on it. Could\nour race be civil and humanitarian on the ways we try to establish\ncontact? Would establishing contact really be the best thing to do?\nThis movie might also seem quite similar to the early colonizers coming\noverseas from Europe to North America. Where the humans symbolize the\nprospecting company and the natives symbolize the Navi. This movie\nreally does have a lot more going for it than just stunning visuals. I\nmyself think this movie is the best sci-fi yet. I might even be bold\nenough to say that this could be the new \"Star Wars\" of our generation.\n"},
{"review": "\nThis movie has no equal.. Incredible effects, totally mind blowing\nenvironment. I just did not want the movie to end.<br><br>I read some comments saying it has so and so, and that is why they give\n8 or 7 for rating. Movies are to entertain and this movie is by far the\nBEST entertainment i got. <br><br>Dear James Cameron, why did you make the movie so short?? Even if it\nwas almost three hours it was not enough for me. I need Avatar 2. Start\nmaking it please !!!!!!!!!!! And make it a little longer ........<br><br>Hey you people who are reading this, why are you waiting for ?? Go to a\n3D theater and watch this. You will not regret it.\n"},
{"review": "\nNormally i wouldn't even bother vote/comment movies. But this movies\nchange that...<br><br>I went on a date with my wife, we eat at a fine restaurant, good food,\nand then we went to the cinema.... We picked this movie - Avatar - we\nhaven't heard of it before and we didn't event knew that it was the\npremiere evening in Denmark. It was an extreme movie experience. a more\nbeautiful and glorious movie cant be found. It is the most intensive\nexperience we both ever had with a movie, i can surely recommend it to\neveryone. And I'm hoping to see/read more about that world again. The\nstory is good and trustworthy, and we did believe it all the way.<br><br>Thanks a lot to the makers of this beautiful movie!\n"},
{"review": "\nI cannot believe the praise this film has been getting! Sure it looks\npretty, but, will that really hold the test of time? Video games will\nlook this good in a few years. How did James Cameron's depiction of\naliens degrade so much since the 80's? If you're gonna spend this much\nmoney to make a movie hire someone to write a non-laughable and at\nleast reasonably original script? Or why bother, because plenty of\npeople seemed to eat it up...Unobtainium? really? You couldn't think of\na made up name for your space metal that you had to call it\nunobtainium? Whats worst of all, I have to wake up each day and come to\nterms that I live in a world where complete and utter crap like this is\npassed off as a good movie.\n"},
{"review": "\nAvatar is an awful movie.<br><br>Avatar isn't 'mind numbing' - that is the wrong expression. It's\nexasperatingly, walk-out predictable. It's the same feeling you get\nwatching a nice-looking person you just KNOW is going to do something\nstupid. Again and again. We have all done that, and after watching for\na while you just despair and walk away ..<br><br>But a review should be constructive. So I have had a think and have\nworked out what could have saved Avatar from all the bad reviews. The\nhero of Avatar, played by Sam Worthington, should have been played by\nStephen Hawking.<br><br>Now THAT would have been a movie, won some worthwhile Oscars and made\neveryone who sees it happy.<br><br>Ideas like these don't come cheap, and this one is too late so it's\nfree. But I suggest - if you are making a movie - you contact me BEFORE\nthe casting and the script is finished. You never know what a\ndirector's Oscar could do for your career ..\n"},
{"review": "\nWatch Pocahontas and think blue... there you go saved your ass a big\ndisappointment. Watch Pocahontas and think blue... there you go saved\nyour ass a big disappointment. Watch Pocahontas and think blue... there\nyou go saved your ass a big disappointment.<br><br>Watch Pocahontas and think blue... there you go saved your ass a big\ndisappointment. Watch Pocahontas and think blue... there you go saved\nyour ass a big disappointment. Watch Pocahontas and think blue... there\nyou go saved your ass a big disappointment. Watch Pocahontas and think\nblue... there you go saved your ass a big disappointment. Watch\nPocahontas and think blue... there you go saved your ass a big\ndisappointment.\n"},
{"review": "\nWatching on my computer, I realize that the direction and the way the\nstory unfolds is really really terrible. The characters are very\nshallow, and there are a lot of inconsistencies in the storyline.<br><br>The people of Pandora are shown to be stupid. Initially termed as very\nviolent, why do they let humans on their planet in the first place.\nWhen Jake goes to them first, everybody wants a piece of him. But when\nthey are getting attacked, no one wants to retaliate. Instead, all they\ndo is gather around defenseless and pray ?? And the way they pray is\nworse than what humans do.<br><br>Graphics of the movie might be great, but it lacks on the basic\nbuilding blocks of a good action / thriller. Watching the character of\nJake and the general for 5 minutes, you can easily predict that its\ngoing to come down to a duel between them. And thats the main fight ???<br><br>Once again, I wish to bring to your attention that the storyline and\ndirection sucked.\n"},
{"review": "\nI've just returned from this amazing cinematic experience, and agree\nwith all the raves about the technical expertise and effects that make\nthis film stunning, the music which truly makes the spirit soar, and\nthe amazing acting, from every single actor stretching their limits.\nBut the clear messages that were being presented and sometimes\nbombarded at the audience were what really blew me away. As I sat and\nallowed myself to be entrenched in this fantasy world, it was as if I\nwas hearing the voices and cries of thousands of generations of peoples\nand thousands more of animal and plant species that have been wiped off\nthe face of the earth. \"We will fight terror with terror!\" the\ncharacter of Stephen Lang shouts before attacking the natives, in a\nblatantly satirical \"kill all the hostiles - ie women, children, and\npeople generally defending their homes\" scene. What a genius way of\nsumming up the untold violence and stupidity of Western war mongers. It\nmakes sense that Cameron is Canadian born. (says a fellow Canadian!)Any\nfilm which can convey such commendable messages without being didactic\nand be so utterly entertaining and visually beautiful deserves my ten.\n"},
{"review": "\nI have registered only because this AMAZING movie and even my poor\nEnglish I have decided to write short review.<br><br>I expected something special but what I saw in the cinema completely\nsucked me up there...with wonderful feelings and tears in my eyes.\nPerformance, story, acting and music...all fit perfectly. We can not\neven name it a movie...it is more than it...<br><br>Mr.Cameron made the dreams come true...I have been in the world I\nalways wanted to be in and I want to come back... And that is why I go\nto see it again..and again.. <br><br>Absolutely extraordinary!!!!\n"},
{"review": "\nHi everybody and best Greetings from Germany / Cologne ! To make it\nsimple: AVATAR deserves a very \"high-end-IMDb-score\",- because it's one\nof those movies you will always remember or in other words will never\nforget,- and that's because of the \"Aha!!-WoW!-Effect\" !<br><br>Do you remember \"STAR WARS - The Lightsaber\" ? Do you remember\n\"JURASSIC PARC I - The Dinosaurs\" ? Do you remember \"THE ABYSS - The\nWater-CGI-Aliens\" ? Do you remember \"TERMINATOR 2 - T1000\nLiquidmetal-Appearance\" ? Do you remember \"Lord of the Rings - Gollum\"\n? Do you remember \"PREDATOR - Predator as itself\" ? Do you remember\n\"TRANSFORMERS 1 + 2 - CGI\" ? Do you remember \"Disrict 9 -\nRobofight-End-Scene\" ?<br><br>Yes ? <br><br>Oh!...then,- it's simple....,- you wont forget \"AVATAR\" ( watch it in\n3D ). And even if you don't like the story....your brain,- once seen\nthis film,- wont let you forget it.<br><br>HA!! Simple !! <br><br>10/10\n"},
{"review": "\nI have seen the movie in 3D last night and I am really really exited.\nThis movie was fun to watch and I enjoyed nearly every minute (161\nmin). The storyline is not as bad as some people say. The visual\neffects are ground breaking and you will flow with the 3D effects, the\ncolors, the atmosphere. When I left the theater, I was unable to put my\nopinion in words, it was just awesome. The last time I was blown away\nby a movie like this was 1999 with \"The matrix\". Just convince yourself\nand ignore the complaining critics. Watch it in 3D, otherwise you will\nmiss a lot. In the times of huge flat screen TV's, cinema is back with\nan experience you can not copy at home. THIS is the right answer to\nillegal copies. The storyline is simple, but it works great. Just do\nnot expect a deep philosophical statement and enjoy the experience.\nDefinitely 10 out of 10. The best movie 2009 and a lot of\nentertainment.\n"},
{"review": "\nI just saw Avatar earlier this night and though I am still drunk off of\nits glory, my opinion of this movie will not change when I sober up.\nAlso, it should be noted the theater I went to attempted to butcher my\nexperience with the screen glitching half way through the movie and\nthen about a minute of a blank screen and silence following- and yet\nstill it could not kill the buzz that is Avatar.<br><br>I went into the movie with great expectations and not surprisingly, it\nsurpassed them. This movie is more than just watching a film, it is an\nexperience. Avatar has it all: action, suspense, love, comedy, beauty,\nand digital 3d. I thought the plot was great, the acting great, and\nobviously the cgi is borderline unholy. The film also has some great\nmessages weaved throughout the story, reflecting many different issues\npast and present.<br><br>As much as I love watching and talking about movies, I have yet been\nthis compelled to comment/review a movie on IMDb- I literally just\nregistered to type this drivel.<br><br>This movie took a fat budget to be created but by definition you can't\nput a price on a piece of priceless art.<br><br>Bottom line...this is a must see and a must see in the movie theater in\n3d.<br><br>3/28/10 edit: Not so great. Still great, just not an emphatic great. I\ndrop my rating by one star for a 9 out of 10. And I do not support the\nclicking of the box \"Yes\" to the question \"Was the above review useful\nto you?\" in regards to my above statement concerning Avatar.\n"},
{"review": "\nI watched this film awhile back in December. Before watching it, my\nbrother told me (even though he hasn't seen the movie yet) that it was\ngoing to be bad. When I watched the trailer, I wasn't really captivated\nby it. I originally thought it was only a bunch of CGI's and no heart\nin the movie. After watching it, I was totally surprised.<br><br>This movie is a feast to the human eyes. There are things in the movie\nthat you haven't seen before in your life. It's probably the most\nbeautiful movie you will ever see. The visuals are great; it's like you\nare actually part of the Avatar world. Aside from the visuals, there's\na heart in this movie. You can relate to the characters the pain, the\nlove, and the suffering they're experiencing the plot even though most\nof the characters are motion-captured! James Cameron, not only gives us\na beautiful movie but a beautiful experience as well. It feels like\nbeing a kid again. This movie will go into the classics and the best\nfilm-making as one of the most beautiful film ever made. A must see in\nIMAX 3D but even without that, the journey never loses its excitement!\nGo watch Avatar and feast your eyes with delight! 10/10\n"},
{"review": "\nBEST MOVIE IN YEARS<br><br>i was blown away by how good this was and have now seen it 3 times at\nthe cinema, this is a MUST see movie for everyone. It runs for around\n2.40mins but i would have loved it to be longer. Everything in the\nmovie is perfect from the acting to the story to the special effects!\nWhen the film first starts you will be thrown straight into the story.\nand from there its a wild ride in a perfect world for the next few\nhours. James Cameron really did think about everything in this movie,\n(SPOILERS ALERT) about mid way through the movie there will be an EPIC\nscene which will make you connect to the Na'vi and will (if you haven't\nalready) fall in love with this film. it really was clever how James\nCameron did this and one of the most emotional moments in a Sc-fi film\ni have ever scene! its beyond me how he made you connect so well to\nsomething that is not real but made you want to believe it was\n(SPOILERS OVER).<br><br>If you are on the fence about seeing this film, its time to jump over\nit....MUST SEE 10/10\n"},
{"review": "\nThis movie is perhaps one of the most spectacular I have ever seen.\nThroughout all three hours or so, I was held spellbound by the scenery,\naction, and storyline of James Cameron's dream. I do not think I\nglanced at my watch once throughout it, and I can honestly say that I\ndidn't want it to end.<br><br>First: the visual effects were absolutely stunning. James Cameron did\nnot just create a world; he created an entire ecosystem that could be\nplausible if we didn't know better. The first time the Na'vi were seen,\nthe person I was with leaned over and asked me if they were costumes or\nspecial effects, they were that real. The Hallelujah Mountains looked\namazing, and the wildlife, although it would be frightening in real\nlife, was just stunning.<br><br>Second: the themes were great. Although stone-hearted critics (like the\nones on here who gave it a 1/10) may argue that it was unoriginal and a\ndirect copy of other movies, there are very few movies coming out\nnowadays that you couldn't say that about. I noted themes in this from\nseveral different movies, the most prominent being Dances with Wolves,\nbut that wasn't the only one. It also took a theme out of real life:\npeople destroying the environment for such petty things as money. The\nreality of it is one of the most disturbing things in that film.<br><br>Third: the storyline was great. It does have similarities to Dances\nwith Wolves, but there was so much more to it than that that you really\ncould not say they were the same thing. Dances with Wolves did not go\ninto the training nearly as much as this did. There are several others,\nbut I won't name them all.<br><br>Basically, this film is about as epic as you can get, and shame on all\nof you who think it was bad because it took themes from other movies\nand enhanced them. You will never find a movie that doesn't.\n"},
{"review": "\nI went to this movie when it was out in theaters after hearing how\n\"amazing\" and \"compelling\" it allegedly was. Normally I like any movie,\nbut 20 minutes in I felt my back side starting to fall asleep. This\nonly happens when my ... is trying to worn me to get out of the theater\nas fast as possible. I kept wishing that this movie would turn out to\nbe good, but then I soon realized how predictable it really was. I\nfigured out what would happen within the first hour. I couldn't even\nsit through this movie again even if I was getting paid to do it. Blue\ncat people? Really? They connect to things with their hair? What kind\nof stuff was this director smoking and how do I get it, because this\nwas pure crap wrapped up in some pretty wrapping paper with a nice bow\nthat smelled like bile. How come, half way through we hear nothing of\nthis rare rock crap that the government is hunting for? They discard a\nlot of things in this movie pretty quick and then it becomes some\ndramatic romance between some crippled guy and a blue cat lady. I still\nwish I could get my money back and I didn't pay to get into this movie.\nThanks a lot Avatar for killing some of my brain cells and stealing\nprecious hours of my life that I will never get back. Don't watch this.\nDon't even rent it. Don't even look up pictures of it on the internet.\nI swear, your IQ will drop.\n"},
{"review": "\nThat a film so overwhelmingly lacking in originality, thought and\nintelligence could become such a blockbuster is perhaps the most\ndamning indictment of humanity since the holocaust. The fact that I\nwatched this in 3D does little to ease the pain of sitting through what\nseemed like an eternity of despair. I can quite honestly say that I no\nlonger fear the concept of spending an eternity in hell because after\nwatching Avatar it would seem like a holiday.<br><br>Avatar is a terrible film that quite honestly should insult the\nintelligence of everyone. To call it heavy-handed, bloated and mindless\nwould be a compliment. If Avatar were a twelve-part documentary series\nabout special effects hosted by a CGI George Lucas and directed by Jar\nJar Binks it could not be any more about special effects. If it were an\nencyclopedia of horrible clichéd stock characters it could not contain\nany more horrible clichéd stock characters.<br><br>As for a synopsis, a wheelie alcoholic super crip comes to a gay forest\nplanet to help out in robbing the native population of noble savages of\na substance known as unobtainium. But, like a middle aged woman with no\nlife watching Oprah, he develops a boner for their pseudo-spiritual\nmumbo jumbo and decides to help them against the big bad earth marines\nwho seek to plunder the environment mercilessly for their own gain.\nAlso, occasionally spacetwigs look like they are slightly closer to you\nthan they should because of the amazing 3D effects! I give Avater a\nrating of 1/10 because quite frankly I cannot go into negative numbers\nand I guess that rating can be justified by the one and only original\nelement Avatar provided. Michelle Rodriguez wearing sleeves and somehow\nlooking more like a semi-retarded, bloat-throated bulldyke than usual.\n"},
{"review": "\nMy review is going to be short and sweet. I got out of the theatre 30\nminutes ago and Im still in a stupor about the movie I have just seen.<br><br>This movie connects with the audience in a way that no other movie has.\nNear the middle and end of the movie I felt an emotional connection\nwith the characters. That has NEVER happened to me with any movie I\nhave ever seen. <br><br>All I can say about this movie is that it is a must see and a must\nhave. I know that as soon as it is released I will be buying a copy and\nwatching it a couple times over.<br><br>I know that my review was short but I hope it gets a couple more people\nto see the movie because it is worth the money.\n"},
{"review": "\nStunning Visuals, movie making at its finest and a milestone for cinema\nhistory, Avatar is the first block of a new generation of movies. <br><br>The world Cameron created, will dazzle you, leave you wondering about\nthe amount of creativity, the attention to details, the flawless of\nmixing acting and graphics, in a truly wonderful, remarkable\nexperience. <br><br>Its a movie everyone in my family, Friends have enjoyed, the storyline\nis predictable, but still deep enough to engage you, the environmental\nand culture messages can not be ignored, and are vividly weaved into\nthe story.<br><br>The possibilities of movies that will be made after Avatar, is just\nastonishing, well done Mr.Cameron, you've deserved the headline.\n"},
{"review": "\nAfter Titanic in 1997, many wondered how James Cameron would ever try\nto top that spectacle. Well, its taken 12 years, but he most certainly\nhas, and then some.<br><br>The basic plot is certainly nothing that hasn't been done before, but\nso what, almost any movie has a plot that's a retread of another plot\nbefore it. But what really sets this movie apart from anything I've\never seen is the amazing visuals.<br><br>Seen in 3-D, the astounding special effects seem even more visceral.\nThe hanging mountains, the mysterious and abundant creatures (some\ntruly nasty animals that were conjured up from imagination) and even\nthe indigenous Na'Vi tribe... all marvels of CGI.<br><br>The movie is almost 3 hours long, but it's so exciting and\naction-packed and a delight on the senses that it's never noticeable.\nThe acting was more than adequate, with Sigourney Weaver, Zoe Saldanha\nand Stephen Lang probably the standouts.<br><br>The final battle scene is exciting and a sight to behold. And James\nCameron has once again proved himself to be the \"King Of The World\"!\n"},
{"review": "\nTo be honest, I didn't really know what to expect of Avatar, thinking\nI'd get along to it sometime and not knowing much about it, but got\npulled to the cinema by my kids. Well, I was absolutely blown away. My\nfirst words after it finished were: \"Great, fantastic and quite\npossibly the best sci-fi movie of all time.\" It really is that good and\nthat technically advanced that it raises the bar - not by increments\nbut a whole lot.<br><br>I might get to a more detailed review and Cameron's use of themes he's\nused in his past sci-fi like Aliens and The Abyss, his cipher\ncharacterisation, but that's just nit-picking detail. This is a\ncomplete tour-de-force and there's been nothing like it for its\nrichness and complexity of detail. Go see it in the cinema for the 3D\nbecause I don't think the flat screen can do it justice. It's utterly,\nutterly amazing.\n"},
{"review": "\nJames Cameron, herewith referred to as JC, has done it again.<br><br>Oh, how I feared that Avatar would be a cringe-worthy snooze-fest but\nall the reservations have been unwarranted. JC has boasted that this\nmovie would be a game-changer and I would say that on some levels this\nis definitely the case. The attention to detail of the visuals and the\nhandling of the sound, which are all perfect on all counts, make this a\nmovie experience beyond compare. The 3D does add a little to the\nexperience but not as much as I expected.<br><br>All in all you are submersed in a world beyond description, a love\nstory which is a little corny but heart-felt, and an experience that\nmakes you forget your worries and woes for a few hours. That is what\ngoing to the movies is all about. Needless to say, I loved it.\n"},
{"review": "\nI went into the theater not knowing what to expect on this one. I\ndidn't have high expectations in the slightest. I COULD NOT HAVE BEEN\nMORE WRONG! This movie took number 1 on my movie list by leaps and\nbounds. From the plot, character development, CGI effects, everything!\nThis movie is legit and I would gladly go see it again if opportunity\narose! The best part i think was the character development and the high\namount of emotion in this film. I don't want to spoil anything for\nanyone but i definitely suggest to go see this movie--now. The language\nisn't perfect, but it's cleaner than most movies nowadays and it flows\ninto the movie very nicely and is kind-of a must have in the areas it\nis placed. Definitely 10 stars and more if I could give them. Props on\nthis one! Fantastic movie!\n"},
{"review": "\nThe first 10 rating I've given to a movie. Plot? Characters? maybe an 8\nor so.. but still not weak enough to detract from the overall result.\nIf you add action 10/10, CGI 13/10, imagination 13/10 I think it adds\nup to a perfect score. <br><br>All I can say is that the CGI is so amazing in this movie that there\nwere a LOT of FIRSTS for me: <br><br>1. found myself just staring at random parts of the screen to notice\nthe amazing attention to detail. <br><br>2. found myself trying to figure out if some of the CGI were real\ncamera shots blended in - it was so good it looked like a picture. <br><br>3. found myself thinking - this is the first CGI dominated film in\nwhich the CGI scenes trump the live actor scenes. I was slightly\ndisappointed when Jake would leave his avatar and return to real life. <br><br>4. found myself not noticing an emotional difference between the real\nactors and the CGI characters. the movements, emotions, textures, and\neverything are superb! groundbreaking! <br><br>5. found myself attracted to a completely CGI character - Neytiri\n(mm...mmmmm!) <br><br>To me this film is a first - it shows that we can now take the full\nextent of ones imagination and put it on film. Creativity + technology\nin the right hands has led to an amazing accomplishment.<br><br>Go see it.\n"},
{"review": "\nThis movie is without a single doubt the best movie I've seen in a long\ntime, and that even with stiff competition from a whole array of big\nmovies that went up this year. Everything was so wonderfully made that\nit almost felt as if it could be a real world. He really brought to\nfocus the best and the worst of man. He tries to show us that we need\nto be more tolerant, patient, curious and kind. And that we need to\nlook after one and other and the environment which surrounds us. There\nis no plan B. This is a movie experience that will follow me for a long\ntime I think, and the message that Cameron gives us is more important\nnow than ever before.\n"},
{"review": "\nAvatar is a movie about two races, usually covering both the human and\nanother race on another planet. Its simply outstanding, it has a plot,\nit has a structure, it has effects that are done so excellently, you'd\ndefinitely imagine yourself in the movie. Learning how to talk,\nlearning how to feel nature, learning how to fly and heroic love, all\nof these are all present.Loved it, loved it, simply loved it.<br><br>The cast is simply mixed but appropriate. The lady from aliens plus\nsome new talents add to the already excellent finished product.<br><br>The musical score is simply beholding. You get into the music and it\nrocks the whole time you are in the theater.<br><br>Overall, and for all of the above facts, I give it a 10 vote!\n"},
{"review": "\nWithout a doubt, this was the single most amazing display of movie\nmaking that I or my family have ever watched. For all of you out there\ncriticizing this movie because of the cartoonish characitures, or the\nsimplistic plot, or the liberal pontification; you are completely\nmissing the boat. You literally cannot see the forest for the trees.<br><br>I will admit, entering the movie I was trepidatious over the reported 3\nhour running time, but the movie flew by quicker than many 90 minute\nyawners. We will be going to see it again in a couple of weeks.<br><br>The cool factor was off the charts. The visual stimulation from seeing\nit in 3D was something I'd never experienced at the movies before. The\nmovie enveloped me and washed over me. I felt as though I was on\nPandora. Incredible.<br><br>Yes the imperialists were cartoonish, but they often are in real life\ntoo. The plot was simple, but that simplicity enable the viewer to\nfocus on everything else that was going on.<br><br>The word I kept repeating for hours afterwards was \"Amazing\". This is\nthe first movie that I've given a \"10\" rating on my vote.<br><br>My wife and my 11 year old son agree, you absolutely owe it to yourself\nto go see this movie. You won't be sorry you did.\n"},
{"review": "\nI was not sure I would like this film. I really did not like Titanic,\nmainly because it's not my kind of film, so I wasn't sure if I'd like\nAvatar. I went to see it because people were saying that it had the\nbetter CGI than any other film, and it had five-star reviews all over\nthe papers.<br><br>I loved it! The film was action packed from start to finish! I do admit\nthat only the very smart will get the plot at first, but everyone will\nhave it by at least the middle. I hardly even noticed that the film was\nalmost three hours!<br><br>The planet Pandora is visually stunning. The plants are incredible,\nthey light up, they move, some near the beginning even shrink! The\nNawis, the natives to Pandora, are very life-like, I never even knew\nthat they were computer generated!<br><br>The action scenes (not giving any spoilers) are just fantastic!\nEverything is so realistic, the planes are realistic, the floating\nmountains are realistic, and the sound literally blows you away.<br><br>The actors are very good, especially Sigourney Weaver. But if you have\na young child, do not allow them to watch this. There is a minor bit of\nswearing, tons of blood violence and very loud sound. Overall, the film\nis just fantastic! You have to see this movie, as it is by far the most\nstunning film of the decade!\n"},
{"review": "\nI was a bit hesitant to write a review after my first viewing of\nAvatar. But now after my third viewing, I am not shy in declaring that\nthis movie will become a classic and remembered for its groundbreaking\nvista for as long time. We have become used to \"production\" movies\ncoming out of assembly lines from Hollywood, Bollywood, Asian and\nEuropean movie houses that we almost forgot how wonderful a cinematic\nexperience can be. Sure, there may have been other movies this year\nwith \"more quirky\", \"more original\" stories but as a whole, Avatar is\nby far the best movie this year and in the top ten of best movie this\ndecade. A classic is by definition something that you can enjoy as much\nif not more in the second, third, fourth viewing, and Avatar is\ndefinitely it. I don't understand the critic that this film lack story\nand emotion because it has all of it, even if a bit on the cliché side.\n"},
{"review": "\nJust go! The people who made this movie, most of which are just average\nworking people making a normal salary deserve it for what they have\ncreated. This movie accomplishes what most people go to movies for. To\nescape from reality for a little while.<br><br>Not only is this what I consider a milestone in the evolution of state\nof the art movie making, it's a good story with a simple message.<br><br>A bit annoyed at some of the criticisms. I don't see anything political\nin the metaphorical message this movie presents. If Republicans hate\nthe idea that getting close to nature is good and war is bad then too\nbad so sad for them! There is only 1 directly political reference to\nBush. That is when the military offensive is referred to as a \"shock\nand awe\" campaign. If people are going to get their panties in a bunch\nover that then again, sucks to be them! <br><br>Also don't understand the criticisms about the similarity to Dances\nwith Wolves. Dances with Wolves was not a unique idea. Modern society\nhas been screwing over aboriginals for centuries. What is so bad in\npointing that out once in awhile in a way that most people can relate\nto? By seeing it through the eyes of someone from this modern world.<br><br>I loved every minute of this movie. There were a couple tiny teeny\nlittle things in the dialog I would have done differently but no matter\nhow you slice it, this is a masterpiece!\n"},
{"review": "\nAvatar, the movie that turns into a world !<br><br>I Would like to share the joy I have watching this movie over and over\n(twice in 2D and once in 3D).<br><br>Avatar is really hitting the brain, it makes you feeling so good, but\nunfortunately, so sad after quiting the theater, you just want to stick\nnext to the Na'vi on Pandora.<br><br>I think that everyone that has an heart will be affected by this movie,\nand will feel very sad on earth after this !<br><br>Enjoy the one of the best movie ever !!!<br><br>The actors are playing very well, the music is epic, the tears will\njust flow on your face during the movie !<br><br>ney-tiri@live.com\n"},
{"review": "\nI watch movies for a living and feel as though most movies are just\nrehashes of movies that have already been made. Avatar is different.\nCameron has created a new world that I felt I became a part of while\nwatching. The detail is absolutely amazing. All I could think about\nwhen watching this movie is how the Native Americans must have felt\nwhen the white man came to town. The idea that everything is connected\ntouched home with me. The natives felt such a connection with every\nthing on their planet. It was so original to have the natives literally\nconnect with the other species on the planet. I must admit that parts\nof it were predictable but it was so worth the ride.\n"},
{"review": "\nThe story is one of the most unoriginal i've ever seen. The CGI is as\ngood as they say but who cares? The best CGI in the world can't save a\nmovie this bad. The acting is sub-par. I didn't find a single character\nto be one I could be sympathetic with. There are basically two sides,\nthe tree hugging hippie natives and the Hitler-esquire humans who just\nwanna kill anyone who doesn't agree with them. The action is almost all\nat the end and even then its not very good. As you have probably heard\nthe story is basically the same as Pocahontas. This is 100% true. As I\ntouched on earlier the acting is not good. I wanted to strangle pretty\nmuch every single character throughout the entire movie. It's almost\nlike they were trying to be unlikeable.\n"},
{"review": "\nFor the first time in my life as a writer, I won't be writing a lengthy\nparagraph.<br><br>When I saw the movie, I cried for two reasons. One, because I am also\nan artist, and the sheer beauty of its digital imagery stunned me to\ntears. Second, with a lesson in environmental concern, the simple story\nof a lost tribe and their survival moved me so much. I fell in love\nwith such imaginary, admirable characters (both human and Navi). I fell\nfor a sci-fi story with a heart.<br><br>So allow me this reluctance to elaborate further. You just have to see\nit to believe it. Believe that you are in Pandora even for two fleeting\nhours, and it will be more than worth the trip.<br><br>Thank you, James Cameron. Once again, you are king of the world.\n"},
{"review": "\nI've been waiting for Avatar for a really long time, During the long\nwait my expectations changes a lot, at first, I thought it would be a\nmasterpiece on all levels, but then after the first trailer was\nreleased and all the negative attitude towards it, I became skeptical\nand thought maybe the long wait was for nothing, I am glad I was wrong,\nAvatar was truly groundbreaking and here is why:<br><br>An enthralling environment is set up, with amazing attention to\ndetails, Some scenes are truly hypnotizing, Although the plot is not\nthe most original and sort of predictable, it's still very interesting.\nEmotionally engaging, you care about the characters, I have never felt\nso much empathy towards aliens living on a distant planet, that is the\ngenius of the movie to put you in the aliens' shoes even when they\ndon't wear any shoes :) I don't really know what to say about the\ncinematography and CGI, It's bound for an Oscar, no words can describe\nit, you'd have to see it for yourself. Although Avatar is a little\nunder 3 hours , it leaves you wanting more, I hope we don't have to\nwait so much for the sequel, and also I expect it to have a more\noriginal plot.\n"},
{"review": "\nI was beyond impressed, this movie was good in so many ways that it is\nhard to know where to start... So I guess it will be with the CG -\nThese were by far the best effects I have seen in an movie, the\nintegration of both live action and animation was seamless, I recommend\nit to be seen in 3D, because I caught myself swatting at what was 3D\nbugs flying around. The storyline was long but kept me involved so as\nnot to become bored, and though I was warned it was kind of a \"Tree\nHugger movie\" I did not get that, there was much more to the story than\nthat, and should wake people up to how we should treat each other. My\nnest step is to see it again in IMAX-3D.\n"},
{"review": "\nI saw the trailer for avatar several times before I saw the actual\nmovie. The trailer gave me the impression that the movie would be about\nthe typical Humans: Good guys, Aliens: Bad guys hindering good guys.\nTherefore the full movie blew my mind. How Jake actually becomes one of\nthem was unpredicted. Although what did disappoint me was that the\nnatives did not accept Jake after the destruction of their home tree,\nbut I later realized it was an important event to unfolding the plot.\nThe $400 Million was put to good use I must say. The 3D effects and CGI\nwas mind blowing. I was not surprised that James Cameron would produce\nsuch an amazing film. The trailer's effect of falsely convincing\nviewers that they understand the plot was ingenious. I was definitely\nsurprised on how the plot unfolded. I've seen the movie twice and can't\nwait for the third. Just one recommendation; See it at the IMAX. The 3D\nexperience is incredible. I usually don't get pop-corn at movies, I\njust buy a large drink and have to go to the bathroom in the middle.\nLets just say I almost peed my pants because I could not leave that\nscreen. Avatar: 10/10\n"},
{"review": "\nI have seen Avatar three times, tonight being my 3rd viewing. I saw it\nin 2D the first two times because I felt like the 3D would be horrible\nand unwatchable/blurry/etc.<br><br>I was wrong, the 3D version literally places you in the amazing world\nof Pandora...I left the theater after seeing this movie and just looked\nin amazement at Earth, how simple and almost disgusting it looked\ncompared to the beautiful Pandora. (yes the plants in Pandora glow at\nnight)<br><br>I can't even describe how good this movie is...yes I was one of the\nmillions of people who thought it looked stupid because it was blue\naliens running around screaming...I couldn't have been more wrong about\nmy expectations for this movie, within the first 5 min my opinion on it\nchanged.<br><br>I believe it will be many years before I see a movie as incredible as\nthis, just when you think Hollywood has run out of gas, James Cameron\nspends half a billion on the most epic movie ever created in Hollywood\nhistory. What else could he possibly have in store for us? Titanic,\nTerminator, Aliens...guy just doesn't stop cranking out the masterpiece\nfilms.\n"},
{"review": "\nThe movie is simply mind blowing. Director James Cameron has sculpted\nthis epic with his heart and mind together. <br><br>The main reason why the movie is worth a watch is because the movie is\ncomplete and has all the ingredients. The movie is full of CGI. But not\nonce do you notice that and its never irritating to the eye. The movie\nhas a good feel for the movie-goer. With all the previews/ promos\ntalking gadgets, I expected a Sci-Fi flick. But the movie has all\nemotions in it - love, vengeance, sacrifice, humor, sober, valor,\npride... you name it and you have it.<br><br>The plot is simple. Hence it has a greater reach. The way it is told is\nexcellent. The movie binds the sentiments with science. The way the\ncharacters see the movie is excellently portrayed. When the scientists\nsee, they see samples. When the power hungry humans see, they see\nmoney. When the Navis see, they see life and its simplicity. When the\navatars see, they see the difference in lifestyles. And its an\nexcellent work from the director that we see all these in the movie.<br><br>Its not an edge-of-the-seat thriller but its not a sit-back-relax-watch\nmovie either. The story is simple, the screenplay riveting and the\nbackground score simply spell-binding. What else you need for 150\nminutes of entertainment? <br><br>This is a visual treat one ought not miss and will be talked about for\nlong. Its worth the wait for 11 years and I will surely wait another 11\nfor a Cameron movie. <br><br>In the sky, if movies become stars, this movie will be the moon (I\nprefer it to be Pandora) to the human eye. Don't miss it.\n"},
{"review": "\nFirst off, this was more than just a movie. \"Avatar\" will be known as\nthe event that changed how we experience films from now on. Yeah, the\n3D was amazing but the action, vivid colors, mind-blowing scenery, and\nsheer sense of reality was overwhelming. I easily rate this movie a 10,\none I hope to watch soon in Imax 3D. Now comes the interesting part.\nWhile I watched the movie I had an odd sense of deja vue, like I'd seen\nthis plot before. On the way out of the theater I asked my girlfriend\nhow she liked it. She said it reminded her of \"Ferngully\". For those of\nyou not familiar with that film, it was a cute, animated good vs. evil\nkinda movie from the early 80's where this human guy shrinks to the\nsize of a fairy and meets up in this forest where all these other\nlittle folk live and whose environment is threatened by an evil,\npossessed logging machine. And there's many other parallels. I'm\nwondering how much of \"Avatar\" was really imagined by Mr. Cameron and\nhow much may have been influenced by this kid flick from almost 30\nyears ago. So if you have a lazy afternoon, get ahold a copy of\n\"Ferngully\" and THEN go see \"Avatar\". The similarities will make you\nlaugh.\n"}
]