[
{"review": "\nMaybe I'm growing out of horror movies, but this just doesn't do it for\nme anymore. If you're going to go for realistic, then go for realistic.\nIf you're going for supernatural, go for supernatural. But don't try to\nmix the two, unless you do it more tastefully like the first two\nParanormal Activity shows.<br><br>I didn't like the lighting (or lack of). Obviously this is to be\nexpected in a dark house of a blind guy. Maybe that's why we need less\nhorror movies that take place in dark houses. I'm sure the underlying\nmotive is to make the scenery relatable to the average person, but come\non. Oh, and he turns out to be a crazy pervert, what are the odds?\nMaybe it's just so we feel bad for the idiotic kids who thought it was\na good idea to rob a house in a ghost town. <br><br>I heard this movie was good and was thoroughly disappointed. Maybe I'm\nhaving a rough day and am not in the business of being scared by\nanything - not even a turkey-baster-wielding blind guy.\n"},
{"review": "\nAfter Evil Dead's well-made remake, a lot of us felt that Fede Alvarez\nwas a director to watch. With Don't Breathe, he definitely became a\ndirector I'm very excited to see future projects from.<br><br>I admire his knack to generate tension. After the film kicks off, there\nis really no stopping. It became almost unbearable at the end, nearly\nreaching the point of overkill. When you have a thriller filled with so\nmuch tension throughout its running time, there's only so much you can\ndo before you start yelling \"you gotta be kidding me\" at the screen.<br><br>The cinematography was beautiful and moody and the performances were\nfine, except maybe Jane Levy, who I felt was too wooden, making her\ncharacter a little bit unlikable.<br><br>Don't Breathe was a solid effort and a great addition to the home\ninvasion genre with a little twist.\n"},
{"review": "\nDon't Breathe. Excellent title for movie directed by Fede Alvarez.\nAfter watching preview, this movie was on my must see list. Extremely\nwell directed. The blind man, played superbly by Stephen Lang, lives\nalone with his ferocious looking, big , black dog in a shabby\nneighborhood house in Michigan. 3 young people, Jane Levy as Rocky, her\nboyfriend Daniel Zovatto as Money and Dylan Minnette as Alex want to\nget rich the quick way - by robbing. The blind man , a war veteran,\ncame into lot of money after his daughter's death in a car accident.\nThe 3 potential robbers go to the blind man's house for the money and\nthen come to know about his blindness. Expecting no fight, the three\nenter his house and from then on, starts the horrible night events. The\nblind man knows how to live his lonely life despite daughter's accident\nand knows how to have a happy future. The blind man believes in life\nfor life. Terrific movie. Extremely well directed. Terrific acting by\nStephen Lang and Jane Levy. I am not a dog lover and the dog in the\nmovie did a good , ferocious, vicious animal role part very well.\nexcellent cinematography. Good Editing. Overall , a very good scary\nmovie. Do not underestimate a war vet. I enjoyed every scene in the\nmovie. Highly recommended.\n"},
{"review": "\nI would certainly classify this as more of a thriller than a horror\nfilm. Horror films can get away with stretching the imagination more\nthan most films and since this was more of a thriller, in my opinion,\nthere were too many such \"stretches\". Some plot elements were\nadequately covered early in the film. For instance, Rocky wants the\nmoney so she can escape to the west coast...check. The antagonist can\ndrag a person down the middle of the street because it was established\nvia GoPro camera that there is no traffic in that neighborhood...check.\nHe keeps the girl in the cellar to give birth to a new\ndaughter...check. But the bad points outweigh the good...1 - Why is it\nassumed that the guy has a huge amount of cash in his house just\nbecause he got a settlement for his daughter's death? Oh, he's weird so\nhe doesn't have a bank account? The cash in his home should have been\nbased on a better premise. 2 - The guy is in the same room with two of\nthe kids that break into his home and even passes by them in the hall,\nbut can't smell them. However, he walks into the kitchen and discovers\nthey're there by smelling their shoes...ridiculous. 3 - In most of the\nfilm the guy is feeling the walls and stumbling around the house as a\nblind person would normally have to, but he appears out of nowhere\nfairly quickly to corner the thieves...whatever. 4 - The guy has a\nperson trapped in his basement, yet he has an alarm to trigger the\npolice in case of a break-in...good Lord. 5 - Despite the lack of\nsterilization and proper obgyn attention, he impregnates this girl with\na basting syringe and sperm he keeps in a basement fridge...come on. I\ncould name more, but I'll stop there. Yeah...yeah...yeah, it wouldn't\nbe a thriller without those elements, you say? Nonsense. These are\nimplausible twisting of facts, yet most accept this as good, if not\ngreat, filmmaking. Please.\n"},
{"review": "\nA super intense thriller which kept me hidden behind my popcorn for the\nmajority of the second half. So many moments lead you to believe the\nkids escape the blind man's home.. then BLAM, he comes back in some\nform. <br><br>Although I struggle to sit calmly through 'jumpy' films, the excitement\nthis one created through moments of tension defined its quality as a\nbelievable action thriller. <br><br>I very much enjoyed the film and recommend to others. The $9 million\nbudget production of a $120 million grossing film is mighty impressive.<br><br>8 STARS.\n"},
{"review": "\nDon't Breathe is a different kind of movie in the home invasion genre\nbecause it actually follows those who invaded in the first place\ngetting hunted. I have yet to see a movie like that so I found the\nbeginning very enjoyable and was almost rooting for the \"Blind Guy.\"\nThat changed pretty quickly.<br><br>The movie is very intense and the editing in the movie is very well\ndone. The way scenes/shots are set up are freaking great in my opinion.\nThere were many moments I went back to watch the last few seconds again\nbecause it was such a well set up scene. Definitely the best thing\nabout the movie.<br><br>Without getting into spoilers or anything, a lot is made clear towards\nthe end of the movie but it still tries to stay relatively realistic\neven though the last 1/3rd of the movie doesn't feel like anything\nspecial.<br><br>Overall the movie as a whole is still very good with certain parts of\nit feeling perfect and then other parts, like the flow of scenes\ntowards the end, lose the appeal and tension of the beginning by\nthrowing in typical tropes.\n"},
{"review": "\nI was so stoked to see this movie. All the horror websites I visit all\nsaid it was awesome, can't miss it, must see, best\nhorror/suspense/thriller in years. Well I'll give them credit, it was\nsuspenseful. But not because of the acting, or the plot, or the\nsetting. It was suspenseful because you never knew what stupid thing\nthe main characters were going to do next. I was on the edge of my seat\nwaiting to see the next mistake. This movie was a joke. I have never\nbeen so disappointed with a movie I was so excited to see. After the\ngirl escaped the house and was pinned in the car by Cujo, you knew the\nBlind Man was going to get her again. I was amazed at how much trouble\nthese three people had with an old blind man. It doesn't matter that it\nwas in his environment. Who cares. It was an old blind man for gods\nsake. Once he killed the first guy all bets are off. You attack him.\nYou find something heavy, wait around a corner, set him up by making a\nlittle noise and BAM!!! hit him in the head. Get what u came for, and\nleave. They made this guy seem like Daredevil and Rambo rolled into\none, with a little bit of The People Under The Stairs thrown in there.\nI understand movies are not real life, they are stories. But this movie\nwas about something that could happen. This could be a real life\nscenario. But there were just too many stupid moments to take it\nseriously. You knew this was all make believe. You knew it was fake,\njust a story, just another movie. It was just a movie, and not a very\ngood one. If you want to get frustrated while watching something, then\nthis is the movie for you. If that doesn't sound like your idea of a\ngood time, to me it doesn't, I recommend skipping this flick. You're\nnot missing anything, unlike if you watch it, because then you'll miss\nabout 90 minutes of your life.\n"},
{"review": "\nDon't Breathe is certainly no Hitchcock or even a Guillermo del Toro\nfilm. The plot is implausible and far-fetched. It started out okay, but\nthen anyone who pays attention to details will notice its many flaws\nand goofs. Several of them have already been listed in the IMDb, but\nthe biggest flaw, I think, is about the dog. When the trio first comes\nto the house, the dog is chained. They drug the dog and he slumbers in\nhis dog house. Later, all of the sudden the dog is in the house. How\ndid he get rid of the chain and how did he get into the house? No doggy\ndoor, bars on the window, etc. Towards the end of the movie, when the\ngirl traps the dog in her car and tries to escape, the blind guy\ncatches her and drags her by the hair back to the house. He leaves his\ndog behind in the car? Obviously, the dog must have been barking. And\nwhen the girl finally does escape, there's no mentioning of the car or\nthe dog. The other plot twist I had a problem with is that the blind\nguy kidnaps the woman that supposedly killed his daughter in a car\naccident, impregnates her and thus wanting to replace his dead child.\nIt's ludicrous to think that a blind man could take of an infant. Even\nif the woman could have carried the child to term, how was she going to\ngive birth with a blind man as a midwife, in a cellar? The only\nexplanation for this part of the movie is that the blind guy was\nderanged. Oh, and yes, even though he was hit with a sledge hammer, he\nwas hardly injured. I don't understand the big hype about this\nso-called thriller. To me it's a bunch of crap. If you want to waste\nyour time and money, go see it and judge for yourself. You'd be better\nof watching a real thriller by Guillermo del Toro or one from the\nmaster himself, Alfred Hitchcock.\n"},
{"review": "\nI was looking forward to watching this film, but after the first 20\nminutes or so, I found myself shouting at the screen because of the\nridiculousness of it all. After the break in, and initially being HEARD\nby the blind guy, they spent half the time stood around like lemons and\nsneaking around. I must have counted 8 opportunity's for them to grab\nsomething and knock the guy<br><br>out, but did they, no. They proceeded to sneak around while be stalked\nby this guy who couldn't see. It took them until the last 15 minutes to\nactually find the brains to actually grab a weapon and hit him with it.\nIt was so comically unrealistic that it ruined the rest of the film for\nme, because it actually got better half way through once they got\ncaught. If you don't like unrealistic and cliché films I would\nrecommend avoiding this one.\n"},
{"review": "\nDon't Breathe<br><br>The most dangerous aspect of a blind person's house is their\nchaotically arranged furniture.<br><br>Which is why the burglars in this thriller shouldn't walk around in the\ndark.<br><br>Hard up for cash after a deal goes south, Detroit hoods Rocky (Jane\nLevy), Money (Daniel Zovatto) and Alex (Dylan Minnette) decide to break\ninto the residence of a blind vet (Stephen Lang) who has a large legal\nsettlement stowed away inside.<br><br>However, the home invasion turns into murder when the sightless\noccupant begins offing the intruders to keep them from discovering what\nhe has confined in his basement.<br><br>Enriched by a number of narrative twists, Don't Breathe does a decent\njob of keeping up the tension and delivering the thrills. While some\nscenes can be construed as comical, the end result is a satisfying\nnail-biter.<br><br>Incidentally, blind people think that someone is in their house every\ntime the TV is on. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nGreetings from Lithuania.<br><br>To be honest, for the most running time of \"Don't Breathe\" (2016) i was\nkinda rooting for Stephen Lang's character. And why not? He is a a bit\nold blind man whose house is being robed by three thieves. Should I've\nbeen rooting for thieves? No way. Then the movie showed a bit more lets\njust say \"awkward\" side of this blind man, which made him kinda\nvillain. <br><br>Overall, as there isn't really much to say about this flick i only will\nsay that i was entertained during the whole 1 h 20 min. Its very good\npaced flick which is entertaining if you can leave your brains for a\nrest for a while while watching this flick. A pretty good flick.\n"},
{"review": "\nIn my opinion, Don't Breath was the best movie of the summer. I went\nand seen it with some friends and at the end I wanted to replay the\nmovie. When I first seen the preview, I thought I was going to be\nscary. Turns out it's really not. Most of the parts in the movie that\nmade the audience scream and jump were just unexpected things that\npopped onto the screen quickly. I was impressed with the story line. I\nhad never heard of a movie even remotely similar and it took a lot of\ncreativity to create the story line they did. <br><br>Some things that I didn't really like where the killing of the\ncharacter \"Alex\" and the ending. The death of Alex was sad and made the\nentire movie theater upset. He was a good kid that was drawn to the\nwrong crowd by love. He went out defending the one he loved so I guess\nthat was a plus. At the end of the movie, the man ends up surviving and\nthe director sets the scenes up to let viewers believe there could be a\nsequel. The movie was already, there's no need to drag it on with a\nwhole new movie. <br><br>Some significant cinematography include but are not limited to:\nno-diegetic music, long Dutch angles and short clips that keep the\nviewers glued. In one scene, I enjoyed the actor's style. the blind man\nwas trying to find the kids in the dark. I think its cool that the\ndirector threw this in there.( he evened the playing field)the look and\nexpressions on the actors faces are priceless and could was interesting\nto see. <br><br>Overall, I enjoyed this movie. I would pay to watch it again. I don't\nfeel the need to mention specifics but the director had very effective\nways of making sure his film was remembered. go check it out !!!\n"},
{"review": "\nI went into this movie with some hope, as the idea was original, even\nif a bit hateful towards blind people. This movie starts out great and\nrapidly devolves into unbelievable land, with unstoppable killer dog,\ncheck, unstoppable indestructible psycho killer, check, continuous\nlethal wounds that seem to do no real damage, to the psycho or the\nkids, check.<br><br>Another factor is you really don't know who to root for in this movie.\nDo I really care that some criminal break in punks are getting their\ncomeuppance? No, kill them all. So the movie suddenly realises this 3/4\nof the way in and has to solve it, by somehow making the blind guy\nsuper evil. They do this with a disgusting sexual sidebar that makes\nyou literally want to vomit. This movie is all over the map. It wants\nto be a standard teen slasher movie, but it didn't bring enough\ndisposable teens to be murdered, so it makes them indestructible\ninstead, except for the first token kill. It wants to be a creepy\nsexual abduction movie, but we don't even get a hint of this direction\nuntil the movie is nearly over. I left greatly disappointed and very\nnauseated.\n"},
{"review": "\nAfter reading the reviews and ratings I decided to watch this. Worst\nmistake ever. I am deeply disturbed by the fact that this crime movie\nhave to somehow be made into a sex crime related movie that is not only\ngrossly disturbing and try to ruin people's lives. At one point of the\nmovie I am pretty sure everyone in the theater was grossed out and just\nwant to walk out and throw up. Don't watch this. This is not even a\ngood crime movie, it's a movie that would do anything to a stretch to\njust try to gross you out. The story line is ridiculous and the blind\nman somehow become as good as daredevil. Total waste of money, time and\nlife.\n"},
{"review": "\nPlease do not watch this movie. The directing was decent and the\npremise was interesting, acting wasn't very bad either, but the plot\nwas the biggest pile of convoluted garbage I have ever seen. They set\nup no character development for the main bad guy, or any of the\ncharacters. A blind guy with a gun? That isn't even remotely scary. At\nleast give us a reason to give a damn about the main characters to get\ninvested in them. The characters decisions also made no sense, even for\na horror movie. And even the jump scares were terrible and\nnonsensically. I would rather eat a syringe full of splooge than watch\nthis movie again.\n"},
{"review": "\n\"It's kind of messed up to rob a blind guy, isn't it?\" Rocky (Levy) and\nher friends want to get out of Detroit and are willing to do anything\nthey can to make this happen. After robbing houses for very little\nmoney they decide to go for broke. Their mark is an old veteran\n(Lange)who has $300,000 in his house. When they find out he is blind\nthey think it will be easy, but this is no ordinary blind man. This is\na movie that could have gone two ways. Super cheesy and cliché, or\ntense and original. For me, this was the latter. This is not a typical\nhorror movie in the way that it is not full of random jump scares or\npossessions. This is also, thankfully, not a \"found- footage\" or Saw\ntype horror where it relies on gore to scare you. This is movie a more\ntense Purge-like movie. 4 people are trapped inside a house where being\nthe last one standing is the only way out. This movie does add more and\nmore suspense and, surprises to keep it feeling fresh. The best part of\nthis movie though it that, unlike most recent horror, there is an\nactual story and character development. That aspect makes you question\nand wonder who you should root for. That extra layer really makes this\nmovie work and is one of the better horror movies I have seen in the\nlast few years. Overall, a horror movie with a story and characters you\nactually care about. That is rare these days. I surprisingly give this\na B+.\n"},
{"review": "\nTerryfing, thrilling, suspenseful and I basically crapped my pants so\noften I should have been wearing adult diapers to make it a bit\ncleaner.<br><br>All the actors are really good. How small and self contained the movie\nis really helps add to the tension.<br><br>If you're familiar with the Daredevil Netflix series, then imagine\nStick going ham on some kids but way angrier.<br><br>The sound design is excellent. Stephen Lang is excellent. The dumb kids\nare excellent.<br><br>Its unsure who you're really rooting for almost the entire time. The\nKids are turdballs that break and enter with intent to burglar. I think\nits something that makes the movie so compelling. You're equally like\n\"go Blind man!\" and \"RUN KIDS RUN!\"<br><br>There is a twist prior to the climax which makes you re-adjust your\nrooting interests. Some more stuff happens. And then the end is also a\ngreat example of moral ambiguity. Top notch.<br><br>Full review: http://wp.me/p3Ww9J-ly :)\n"},
{"review": "\nI'll be honest, I was uber stoked when I first saw Stephen Lang and his\nnormal badassery on the trailer for Don't Breathe, however I remained\nskeptical about the full movie, because the story has been done a ton\nof times and a tun more after the first ones. Fede Alvarez and the cast\nall worked some seriously impressive magic to not only make me feel\nsilly about my initial assumption, but to go hard as they managed to\nwork that same magic throughout the full 128 minutes <br><br>Not only did the home invaders(Levy, Minnette, and Zovatto) all do\nimpeccable jobs at actually portraying that they were being terrorized,\nStephen Lang blew my mind with his role as he transformed into a\nseemingly innocent blind man who just so happened to end up becoming\nthe target of a robbery at the hands of three hoodlums, into a\nseriously bad ass butt kicking blind man that as it turns out might end\nup being the source of a much bigger problem, himself! The movie is\nexactly what one would expect coming from a director/writer who has\nprobably been sitting on this movie ever since the release of the Evil\nDead remake that he had also directed. I tip my hat to the whole cast\nand crew of Don't Breathe, but I have to pay a much greater respect to\nboth Fede Alvarez for the brilliant job he did with putting such a\nlegit psychological thriller onto the big screen, and to Stephen Lang\nfor being able to give me a horror movie character that's not a monster\nthat actually freaked me out.\n"},
{"review": "\nTerrible acting check, awful script check, nasty 3rd rate unlikable\nactors check, bad camera work check. Yep this has it all - All wrong\nthat is. Zero suspense and god awful acting make this more comedy than\nhorror. Strange that it has so many good reviews. I love horror and\ngood Ines should scare the pants off of you. This sadly will just make\nyou want to hit the make lead. In the face. A lot. Yes he's THAT\nannoying. All in all I'm just annoyed I wasted my time . Pathetic, all\ninvolved should change career. There is absolutely NO story to this\nfilm and no character intro. Very lazy screenplay! If they can't be\nbothered why should we.\n"},
{"review": "\nThis is what low budget film making is all about! (Although the\nestimated budget wasn't relatively all that low)<br><br>By the above sentence, I mean by taking just a handful of actors /\nactresses, placing them in just one setting and creating a suspenseful\nthriller. No special effects and all that jazz, just good acting and\ndirecting all around.<br><br>Whilst I do critique every film and always think that the majority of\nthem could have been made better, I do think that they did a very good\njob here. Although I wouldn't say that this is a film full of plot\ntwists, I won't give too much away and suggest you watch it for\nyourself.<br><br>I was a little sceptical beforehand as I could only find good review\nafter good review and hundreds of them too. I thought surely these must\nbe paid for reviews as they were consistently 7s, 8s, 9s and 10s.\nWhilst I wouldn't go as far as to say a 9 or 10 / 10, I do think that\nthese reviews are justified.\n"},
{"review": "\nSPOILERS<br><br>this movie sucked. <br><br>I say this, not only because it did, but because someone should mention\nthis to you. <br><br>The ending was a joke- OK, so the moral of the story?<br><br>White trash chick who probably got pregnant when she was 12 (she has\nlike an 8 or 9 year old daughter when she herself is some teenager)-\nanyhow, white trash chick will do anything she can to ruin your life,\nincluding getting her boyfriend murdered (she is the one who got them\ninside the house) and also getting a guy who fawned over her killed\ntoo. <br><br>So in essence, white trash chick will ruin your life- for money.<br><br>The movie had massive plot holes. Massive. No place in America has a\nSINGLE person living in a house in a community of houses where NO OTHER\nSINGLE PERSON LIVES for miles- you telling me mail gets delivered\nthere? How does this guy get groceries? How were plants growing in\nbasement? What were plants doing there? It wasn't cannabis so wtf was\nhe growing in the basement????<br><br>WHY?<br><br>WEIRD house design- made for like what? a family of 10? There was an\nupstairs with like, endless doors...<br><br>What?<br><br>Movie stank.\n"},
{"review": "\nReviewers are being paid to lie about bad films, to say they are good.\nI'm really tired of the coming on IMDb.com, and reading reviews that\nsay terrible movies are good. For instance, I read the praised reviews\non Lights Out, thinking that,that movie was really gonna be good, only\nto watch a horrible film and waste time in doing so. Again, this was\nbecause the reviews on that film were blown up by people who are being\npaid to write lies about about films to get you to theater. Once again\nI was deceived by these lying treacherous parasites saying how good,\nDon't Breathe was, only to be duped out of time by wasting it, watching\nan even more horrible film. I'm not even going to comment on this film\nother than to tell you that it was just awful, awful and more awful.\nThe story, plot, cast all stupid and nowhere believable. But my real\ngrievance is with IMDb reviewers who are purposely lying about these\nfilms, saying the are good knowing full well this film sucked major\nass. I will never trust another review on IMDb.\n"},
{"review": "\nA rating higher than 2 for a film like this one either means that <br><br>a) The average IQ of the population dropped below 70 b) The review are\nfake or submitted by family members of the people involved with this\npiece of junk.<br><br>In which planet, dimension, galaxy three healthy individuals are\noverpowered by one blind guy?<br><br>And the girl in the basement subplot was an imbecilic attempt of\npadding the film with extra violence porn. <br><br>The whole film is a succession of stupider and stupider decisions by\nthe main protagonists, that is all there is to it.<br><br>It is disappointing to realize what passes as entertainment these\ndays...\n"},
{"review": "\nA Dark Mystery/Thriller From the mind of Sam Raimi (Spiderman, Drag Me\nto Hell, Evil Dead etc). The amount of mystery, thrill, irony;\ncomprised with compelling sound design, camera-work, editing, pacing,\nacting (with almost perfect character development) &amp; a \"90 min running\ntime\" (which can be very hit or miss in the genre) that feels more like\n100, an awesome marketing campaign, and a 3rd act that does more than\njust balance out the first 2 acts, all stirs up into a well made,\noriginal masterpiece. By far one of his best films. Forget what you saw\nin the trailer, and go see it at your local theater playing it in the\ndeluxe DOLBY ATMOS theater;GO SEE IT YOU WON'T BE DISAPPOINTED.\n"},
{"review": "\nIt must be very difficult for a filmmaker to get a good script with a\ngood story. It is unbelievable that so many effort, which has to go\ninto the making of a movie is done on the base of such lousy scripts. A\nblind man hunts a girl and a boy through his house. That is not much of\na story. So the writer had to add a twist that didn't do anything good\nto the movie, but ruined the remaining suspension. Be at least prepared\nfor this: this is not a horror movie, but a thriller with the old story\nof hunting and running til the end. I want better writers for the film\nindustry! IMDb could start to give a tool for praising good writers.\nAdd some sort of rating for the writer alone on the movie pages.\n"},
{"review": "\nI really don't understand where all the good reviews come from.<br><br>The film is so full of plot holes and stupidity, it's just another\nslasher that should have gone straight to DVD release.<br><br>Without giving any spoilers, I just want to say the director should\nhave learnt a bit more about blind people before just making one up.\nGreat sense of smell... shoes...Not cigarettes/weed though?! Great\nsense of hearing...but Not the barking of the dog nor noises outside?\nThe dog's behaviour is very strange. Does he fall asleep every few\nseconds just to randomly disappear and reappear when the director runs\nout of ideas?<br><br>And the kids..the stupidity and predictable behaviour is so frustrating\nyou wish them all to die to make this disaster of the film end sooner.\nAbsolute rubbish.\n"},
{"review": "\nThis movie started off pretty interesting. A group of burglars robbing\na rich family's house. Why you ask? The audience doesn't know.But we\nare treated to a bodily fluid screen shot that should have been cut\nfrom the film.Right then the movie goes into the gutter.I never seen a\ngroup of robbers talk so loud and use guns to open doors and safes in a\nhome invasion. And to top all this off, I've never seen a main\ncharacter get beaten ,stabbed and shot _ in the same movie_ and still\nhave enough energy to run and fight the villain.This movie was a good\nconcept but ended up being plain stupid.This movie should serve the\npurpose of how Not to make a horror movie.\n"},
{"review": "\nWhat started off as a great idea( Check out the 1967 Wait Until Dark as\nthat was what this movie wanted to be..without the silliness) Ended up\nas just a mess of plot holes and silliness.<br><br>Ridiculous ideas thrown in to bring tension but fell flat..a lot of the\naudience were laughing at the scene where he tries to ,,,trying not to\nspoil it,,,let's say \"Impress\" her.<br><br>Tension is OK ..but it's like a kid shouting boo at you all day..you\nget fed up very quickly.<br><br>\"No Escape\" from last year was the same..tried to overdo the tension\nand spoiled it.<br><br>I think anybody aged 15 or so may have enjoyed it but anybody with a\nbit of common sense will just sit and watch till it goes off.\n"},
{"review": "\nI just got back from a premiere screening and here are my thoughts.<br><br>DON'T READ REVIEWS FOR THIS FILM!!! <br><br>Avoid trailers and movie clips too. Avoid anything that could be a\nspoiler.<br><br>The less you know the better the film will be.<br><br>If you're a horror/thriller fan GO SEE THIS RIGHT NOW. You will be very\nglad you did. <br><br>The film was exhilarating, tense, eerie, and exhausting, with an\namazing score.<br><br>Thank you Alvarez. <br><br>Now to try to sleep...\n"},
{"review": "\nIt's a great comeback for the director after his first film, 'Evil\nDead' remake had got a mixed response. This film might feel very\nfamiliar to you if you have got a good knowledge of the B movies. It\nwas still a very refreshing and very thrilling. The film was short,\nbecause there were none segments wasted, it comes to the point quickly.\nI mean the event, because the story was a one liner, but the event was\nwhat this film based on.<br><br>Three youngsters who rob the houses when the people are out, mark their\nnew target on a blind war veteran. But when it does not go as they have\nplanned, they find trapped inside his house. Struggling to escape from\nthere, they also get so close to what they had come for. Though it\nbecomes a suicidal, and left without any option, what's next for them\nand the result of their attempt is what becomes the film's conclusion.<br><br>Really a great effort. Almost a one night based theme with the limited\ncast. The title is not just what the film revolves, it also for us to\nhold breath while watching it and most probably sitting on the edge of\nour seat throughout. But I'm very disappointed with many flaws, or\nmaybe you can say those unexplained stuffs. Like the end seems very\nsilly, because there were lots of evidence to prove the film character\nhad committed a crime, but easily got out. Likewise there are many\nmore, but the film does not explain and I believe there are sure\nreasons behind them.<br><br>The writers did not care to waste time on those, because they wanted\nonly a thriller, a non-stop one and they got one. Now it is going to be\nremade in Kollywood and also a sequel was announced. I expected that\nwhen I saw the ending. Maybe, a prequel, though sequel seems more\ninteresting idea after what happened in this. Surely one of the best\nthriller of the year, so make sure you watch it soon.<br><br>7/10\n"},
{"review": "\nThe ironic twist in the movie \"Don't Breathe\" is how it fails as a\nhorror film but still makes the same dramatic impact as \"The Silence of\nthe Lambs.\" Director Fede Alveraz, who also co-wrote the script, brings\na new villain to the screen. Steven Lang (Avatar) plays a blind,\nmilitary veteran who lives alone in an old, decrepit home and like\nHannibal Lecter, has no regard for human life. The vet also has a\nhorrifying secret in his basement which three young thieves (Jane Levy,\nDylan Minnette, and Daniel Zovatto) stumble upon while trying to steal\nthe old man's hush money. Although there is enough blood, ghastly shed,\nby the vengeful, ex-military man, the plot is so well written that our\ninterest shifts away from the gore to the intriguing story and the\nchills running up and down our spine disappear. The IMDb rating seems\nspot on but in my books, this movie deserves critical acclaim; I give\nit 9 out of 10.\n"},
{"review": "\nWhen i saw the trailer for this movie it definitely didn't leave me\nwith the feeling that i needed to watch it immediately. But boy, was i\nwrong. From the first 10 minutes of the movie you can tell that it's\ngoing to keep you on edge until the end. For me it definitely did the\njob of keeping me in suspense throughout the whole movie. I can say\nit's one of the best scary movies i've seen in a really long time and i\nthink i've seen pretty much all of them. No scary ghosts or haunted\nhouses in this one, just a very realistic, dark situation that doesn't\nrequire the paranormal to make it scary and even a little bit creepy\nand dark. Both Fede Alvarez and Jane Levy smashed it three years ago\nwith Evil Dead and they did it again in this movie. For me Jane Levy\nit's an actress to keep your eyes on especially in the suspense, horror\nscene because she definitely has a clear talent for those roles. I\ntotally recommend this movie to all horror/suspense fans because you\nare definitely not going to be disappointed.\n"},
{"review": "\nI went to the cinema with my best friend to see this movie and I was\nreally disappointed. First, I don't think that we can call this an\n\"horror\" film: it wasn't scary at all. According to the scenario and\nthe trailer, I expected to feel oppress because of the ambiance and\nbecause of the fact that there is a blind and really dangerous old\nmilitary who tries to kill the thieves. However, the manner to film the\n« frightening » scenes doesn't make you feel \"in danger\" and it is\nquite sad for a horror and thriller movie. Second, I found the main\naction a little bit too long. The girl escapes and finally not and then\nshe escapes again,\u0085 It is always the same and, at the end, it is\nboring. Despite of that, I have to admit that the character of Rocky\n(Jane Levy) is really lovable. The fact that she steels money to go\naway from her alcoholic mother with her sister makes you love this girl\nand you really want to help her. In addition, there are a lot of new\nand unexpected elements which are added during the film and that is\nvery interesting because you know more about the blind man and you\nrealize that he is completely crazy. In conclusion, the general theme\nand the screenplay are quite good but I find the production\ndisappointing. I don't recommend you to go to the cinema to see it but\nit is a good entertainment to watch at home.\n"},
{"review": "\nMovie shows us this guys that are robbing people and decide to rob a\nman that supposedly owns a great deal of money but as they are doing it\nthings don't go as planned and you get the best horror movie of the\nyear so far, maybe even of the decade. It starts slowly building\ntension with every minute and throws a couple of mysteries on your way\nto keep you aware that you don't know everything that is going on. Then\nin just one moment you get thrown on your seat in horror not knowingly\nwhat is going to happen and with blind man just showing his rage on one\nof our burglars. Eventually killing him left pure horror and fear for\nthe other two, girl that is seems terrified to death and guy that is\ncoming back to house without even realizing what will happen to him.\nMovie just keeps going and as they are trying to escape with stolen\nmoney in basement things show off and you are left in disbelief with\nwhat you see. After moment you are left to watch how blind man is\nhaunting those two guys all over basement without any lights. You feel\nlike there could be end to the movie and as blind man haunted them you\nget to final scene in the house where you feel like every hope for girl\nis lost comes the guy that should be dead and saves her. Throughout\nmovie there's this sense of unknown and tension buildup that tends to\ngrown into some chase scene and just keeping you in terror. Directing\nof the movie is absolutely incredible with some of the amazing shoots\ntaken inside the movie with one shot scenes. Lang is absolutely\nterrifying and you can feel his grief, pain and sadness but at the same\ntime he goes into crazy killing mode. Magnificent, terrifying, tense,\nincredible. 9.3/10\n"},
{"review": "\nThis film had a lot of mixed reviews which i don't understand why,\ndon't breath is one of the best suspense films out there!!<br><br>A group of kids who go round robbing houses learn of a house that has a\nlarge amount of money inside it, the only problem is someone lives\nthere but to their surprise they learn the man who lives there is\nblind.<br><br>A house full of money, a blind man what could go wrong??? Turns out a\nlot as he is not as vulnerable as they first thought and this job turns\ninto a fight for survival.<br><br>Don't breath is a brilliant suspense thriller that is well acted with\nsome amazing edge of your seat scenes, this is how a suspense thriller\nis meant to be and shows that the vulnerable one is not the one who is\nblind.\n"},
{"review": "\nDon't Breathe is a horror film directed by Fede Alvarez and stars Jane\nLevy, Dylan Minnette, Daniel Zovatto and Stephen Lang. This is one of\nthe best horror and intense movies to come out in a long time. It has a\nbasic simple story which works so well in favor of the movie itself.\nThe acting is great all around, with Jane Levy on the main role and the\n\"evil\" presence on the film Stephen Lang who gives a terrific\nperformance as a blind bad-ass old man. The music works so well with\nthe intense sequences that the movie is presenting to us throughout,\nand despite it taking a while to start it has what you could consider\nas a perfect ending to this kind of movie. It is one of the best films\nof 2016 so far and certainly one of the better horrors to come in a\nwhile.\n"},
{"review": "\nI loved the Evil Dead remake, so I must confess I was looking forward\nfor this new project of Fede Alvarez. In the beginning of the movie,\nthe watcher meets 3 Detroit's robbers and the personal life problems of\nsome of them, they plan the big heist that is to steal a lot of money\nfrom a blind man's house, however nothing happened as they planned and\na thrilling nightmare begins. I'm a thriller lover, so I definitely\nenjoyed each second of Don't Breathe, the movie's atmosphere is so\nintense, good, full of great twists and the director changed the home\ninvasion sub-genre. I won't give spoilers but everything changes when\nyou think you know what's going on.<br><br>The run-time is good, the film never bothers you, it's full of great\nthriller moments, intense scenes and acting is good. If you didn't see,\nI must advertise, this isn't a horror movie, it's a good thriller with\nsome horror elements.<br><br>And now, let's wait for Evil Dead 2!\n"},
{"review": "\nDon't Breathe is a great thriller/horror movie about three buglers who\nbreak into the house of a blind man who is not as helpless as seems at\nfirst. This is 1.5 hours of non stop suspense and you are on the edge\nof your seat the whole time. It is incredibly entertaining, however,\nthis movie confuses you as to who you should root for at first, but\nshows a clear antagonist in the end. It is beautifully shot, very well\ndirected and makes for an extremely entertaining focused watch. At\ntimes it is similar to panic room but it works off of that pretty well\nand the title is very justified, many-a-times indeed. This movie has a\ngreat story line, almost genius on second thought, it is a must see\nmovie, one of the best of the year. B+\n"},
{"review": "\nI've seen some films similar before like panic room etc however this\nwill be a classic in yes to come. Firstly that dog (rottweiler) is a\nbeast and to have that chasing you he'll no. Some great twists to the\nfilm it's good to see how the blind ex marine messes the right up the\nfilms intense and jeeps you on the edge of your seat and the basement\nscene is ace don't want to say to much because I'll spoil it for you\nbut believe me it's a seriously good film. So we've had a blind man in\nthis and a death women in HUSH it's good to see the boundaries being\npushed with issues of disability big thumbs up. This is on the boarder\nof a horror film. But it's something more very cleaver\n"},
{"review": "\nPuh I am truly astonished. After the 15 obligatory waiting minutes this\nmovie didn't cease to be thrilling until the very last minute.\nIncredible the twists and turns the story took. Once again it was\nproved, that you do not need known actors, nor an expensive set, but\ninstead a dam good story, professional actors, a producer and a\ndirector who know what they do. Why isn't not more of this kind of\nmovies being produced, no matter what genre, it is about the value that\nyou get for your attention. Usually I am forced to push the fast\nforward button a lot, this time I wasn't at all. Don't miss this one if\nyou love horror, action, thrillers.\n"},
{"review": "\ni liked the movie, and i think that it had the good parts and the\nunrealistic parts. It has really given major thrillers a run for their\nmoney, but it is a great movie, definitely a must watch but not with\nreally big expectations for the hardest critique. The fact that\nteenagers that are so desperate to rob a blind man and think that\nnothing will go wrong brings chills to some people. The blind character\nseems to be the innocent and defenseless man who in fact turns out to\nbe much more than that. we have all watched a movie and wish we could\nhave a different ending so it is a movie that will make someone scream\nin a movie theatre at all the jump scares.\n"},
{"review": "\nDon't breathe kept me entertained from beginning to end. The creators\nare able to put a spin on this overdone genre that gives this movie an\noriginal feel to it.<br><br>The plot goes like this - A group of petty thieves learn about an old\nhouse in an abandoned neighborhood, owned by an old man is full of cash\nof the taking. They break into his heavily protected home and make an\nattempt robbing him. Not everything goes as they've planned and they\nend up fighting just to make it out of the house alive.<br><br>Nothing comes easy for the main heroes in this story. Most of the time\nthey have to try two or three different things before they get the\nresult they are looking for. This made the movie seem a lot more\nrealistic to me. <br><br>Besides plot, The direction of this movie was very well done. The\ntension builds nicely and keeps you at the edge of your seat. <br><br>I would recommend this movie to anyone looking to escape reality for a\nfew hours, and enjoy a well made thriller/horror film.\n"},
{"review": "\nThis movie is more a Thriller than a Horror film. We have a lot of\nsuspense and scary moments where we need the kids to escape the house\nof the evil blind veteran. Or isn't he evil? We ask that question many\ntimes, because it looks like this man is protecting his house and money\nfrom burglars. Although there are more locks on the door than seem to\nbe necessary, and some you don't want to open. <br><br>We had a fun time in the cinema, I love watching these kind of movies\nin a crowd because it gives a feeling of sharing the same fears and\nscares all together, which make it fun instead of troubling. Some films\nyou just shouldn't watch alone. With this one that would be perfectly\nfine, it's not that scary, there is no gore apart from a little blood\nand a shot wound here and there. <br><br>The acting is good, good enough for this movie. The blind man doesn't\ntalk for most part of the movie and when he does more than just a\nsentence, it's a little distracting because it feels late to introduce\nthat with one of the main characters. <br><br>The setting is good, although I must say that the basement must be\nprobably 6 times bigger than the whole house. Does it spread under the\nwhole neighborhood? <br><br>It ended rather abruptly. After wanting to finish several times (but\ndelaying the ending) we suddenly have the end titles. Funny enough it\nwas an interesting and exciting movie, but by dragging it a little too\nlong at times we were a little bit bored.\n"},
{"review": "\nDon't Breath is a great movie with a very well developed plot and a\nstellar cast. It is an absolute thrill ride, from the moment we enter\nthis man's house there is a tension that does not go away, it never\nbecomes tiring. It had me at the edge of my seat from start to finish,\nas we quickly gain support for these thieves as they get caught up in a\nbad situation. <br><br>It did, on the other hand, make some cliché plot developments. There\nare some moments that were so typical they took me away from a movie\nthat was clearly trying to stand out, but was clearly forced by the\nstudio to have some predictable plot points. <br><br>The cast is phenomenal and their chemistry with one another added to\nthe suspense. Jane Levy and Dylan Minnette were very believable as down\non their luck teenagers. The star of the show, however, is without a\ndoubt Stephen Lang, a completely engrossing performance of a ruthless\nman with no soul, I believe it will go down as the highlight of his\ncareer. <br><br>The intimacy of the film is the main thing that makes it so fresh and\ninteresting as a thriller, if it was taking place around a city or in a\ntown it would not be half as suspenseful as having it all take place in\na house. An intense adventure, Don't Breathe is a refreshing movie that\ncertainly stands out from the crowd, I would recommend it to anyone\nlooking for a good thriller. <br><br>A group of teenagers break in to a blind man's home in order to rob his\npossessions, however, they soon realise he is far smarter than they\nthought. <br><br>Best Performance: Stephen Lang\n"},
{"review": "\nThe first half of the film was extremely tense and genuinely\nuncomfortable to watch, exactly what a thriller should accomplish. The\nstory was brought to life and it made a top class horror (first half).\nBut just like every other modern day thriller it got a bit silly. I was\nvery disappointed with some of the routes the story took as going of\nthe first half it had the opportunity to be a brilliant film\nthroughout. It reminds me of what a lot of people thought of 10\nCloverfield Lane, brilliant story, brilliant actors, brilliant\nexecution but ruined by being silly. However I don't think the\nsilliness could've been a lot worse. Stephen Lang honestly made the\nfilm, a genuinely frightening character, I would definitely recommend\nthis film, 3.5/5. Definitely would've been 5/5 if it had carried on\nwhat it achieved in its first half with the sophisticated story lines\nand execution.\n"},
{"review": "\nThe way this movie plays with the silence is amazing. The audience\nfocus on each and every breathe the characters take, each step they\ntake. This movie certainly stands out as a benchmark for all the\nthriller but slightly horror movies out there. All the actors did a\nfantastic job and we get to see the best of all expressions, which is\nfear, on their face. The story line is great but I think I found out\nfew loopholes, which I am totally going to neglect because overall it\nwas an excellent experience. The characters were all very witty, not at\nall dumb like they are in similar kind of movies as we have seen in the\npast. So, I would totally suggest you watch it in theaters. The\nsound(or I should say silence) creates the atmosphere as if you are in\nthe same situation, in the same house. Also, some of the scenes were,\nyes, breathtaking.\n"},
{"review": "\nLike a lot of films of this class, Don't Breathe gets a slight less\nexciting as it continues to its predictable conclusion, replacing\ntension with shock value, but it works so well up to that point that\nyour heart will likely be beating too firm to care. I was guessing this\nmovie to be just another crappy horror movie that would be amusing to\nsee with my friends, but it ended up being quite a fascinating\nthriller. I wouldn't see it again, but I don't regret seeing it the\nfirst time.<br><br>I have now started finding better movies though www.flickstree.com. It\nnot only suggests great movies to watch, It also tells where you can\nwatch the movies online. Highly Recommended.\n"},
{"review": "\nA 7.6 rating on IMDb is incredibly high for a horror film. So when I\nsaw 'Dont Breathe' contained such a rating before going to see it, I\nsuspected I was in for something pretty special. Director Fede Alvarez'\none previous film, the 2013 remake of 'Evil Dead', was a very fine\nfilm. It was intense, scary and brutal. A new director stamping his\nmark on the genre from the outset. Could he live up to it a second time\nthough? I think you'd have to say he did. This time he takes on an\noriginal story (a breathe of fresh air in the horror genre) that he has\nwritten himself. It's an intriguing premise. A blind man being robbed,\nwho is more capable than first perceived and chooses to fight back.\nThen add in some extra twists and turns along the way and you have\nyourself a lot of potential. But we know that in this beloved genre of\nours potential doesn't always equal results.<br><br>Luckily Alvarez clearly has the filmmaking talents to pull it off. It's\na very different type of story to 'Evil Dead' and yet still captures\nthe same levels of intensity and brutality. One thing I didn't like was\nthe opening scene showing a man dragging a character down the road. I\nlove opening scenes that give a sneak preview into something that will\noccur later in the film when they are done right, but this simply\nwasn't. That type of a snippet should give the audience a \"Huh?\"\nfeeling or a \"How the hell are they going to make sense of that?\"\nthought. This one achieved neither of those. Other than that though\nthere really isn't a lot to criticise here. The acting is good, the\ndirecting is good and the whole experience is pretty damn enjoyable.\n7.6 to me implies it should be one of the best horror movies ever made.\nTo me it certainly didn't live up to that kind of level, but make no\nmistake, Alvarez is a director to take note of in the future.\n"},
{"review": "\nDon't Breathe is a surprise ,its really a surprise.Movie is low budget\nbut have some great thrilling moments.Its having a dark setup ,\nreasonable great story ,and yeah awesome acting from all characters.<br><br>Director and Screenplay is good and thing with this movie is it will\nalways have your attention while watching ..you never gonna get bored<br><br>I am not gonna spoil you much about this movie because the less you\nknow about it the more you gonna enjoy it.so please please don't read\ntoo much review or watch clips and trailer,it will only spoil this\nmovie for you<br><br>So if you are looking for a great thriller with some dark background\n..GO FOR IT...\n"},
{"review": "\nDon't Breathe is a well put together film and excels in many areas\nwhere many horror/thriller films fail.<br><br>This film puts together and extremely tense mood with twists and turns.\nThere are a variety of setups and payoffs throughout the plot that make\nit fun to watch, but the movie is never really *predictable*, which is\never so important!<br><br>Horror fans will be pleased that a mainstream thriller/horror has been\ndelivered to theatres that doesn't just rely on jump-scares and\nviolence, and certainly is not a \"laugh along\" film.<br><br>Having said all that, I believe the wrap up of this film is its weakest\npoint. It's not that it is in any way a let down or poorly done\u0097it's\njust a bit too bland and average whereas the rest of the film certainly\nisn't.<br><br>Overall, this is one of the best horror/thriller films I have seen in a\nlong while.<br><br>Some may be wondering why I don't rate it 10/10 then\u0097and that's because\nthose ratings are saved for films like City of God :)<br><br>But as far as horror/thriller films go, and for that this film was\ntrying to accomplish, it certainly did succeed and it is a top notch\nfilm.\n"},
{"review": "\nthis is not my usual fare, but I heard good things about it, so I went\non a Saturday afternoon and a good time was had by all. basic\npremise-three morons break into houses to steal stuff and sell same to\na fence for peanuts. the fence tells \"money\" about a big score for cash\nand off we go. the hitch is that the house money, rocky and alex break\ninto is owned by a blind man, who turns the tables on them by turning\noff the lights. he also has a gun. I know, I know. but it worked for\nme. Stephen lang as the blind man is very intense, and the young woman\nplaying rocky is more of a man than either of her robbing partners. I\ndon't remember a horror movie where the woman is a strong character, at\nthe expense of the men. kudos. go. you'll have a good time.\n"},
{"review": "\nSpoiler: this movie is the equivalent of gargling dirty toilet water.\nI'm so tired of the same stupid back and forth, predictable as always,\nflaming garbage bag fire movies. I've never left a review and had to\nset up an account to do this. That is how stupid this movie is. I would\nrather watch a movie of someone peeling an orange with the fire alarm\ngoing off for 2 hours then ever watch this movie again. Seriously,\ndon't waste your time. Read a book, watch literally anything else,\nstart a fight club with your neighbors in your back yard. Go to the\nstore and buy 12 pizzas, some pizza rolls and make 47 tacos and sit\noutside and watch the grass grow. It will be far less annoying and more\nentertaining than watching this. You would have more fun power washing\nyour small intestines.\n"},
{"review": "\nDon't breathe, its preposterous, dumb and uninteresting, there is no\none to root for, there's nothing to care about.<br><br>The film has some good elements to it, like the music, the acting, the\ncinematography, there are some genuine intense moments in the film, but\neverything else falls in absurdity.<br><br>We are suppose to root for three characters but they gave us nothing to\nattach to, the characters are dumb, uninteresting, cliché, annoying and\nbland.<br><br>The plot its interesting, but still absurd, the best part its really\njust Stephen Lang, who isn't that great, but hes better than the other\ncharacters.<br><br>The film has a lot of unintentionally comedic scenes, because of how\nabsurd it is, so maybe if you enjoy this kinda of thing you could like\nit ironically.<br><br>There's also some very obnoxious foreshadowing all through the film,\nthat doesn't really amount to anything, because of how bland it is.<br><br>Its very well directed, it has some good scenes that are good because\nof how well directed they are, some very good use of the camera and\ngreat shots, but it doesn't last long enough to make it a better film.<br><br>It also has a horrible ending that will leave with a bad taste, but the\nrest of the film its pretty bad, so its not like if it isn't\nconsistent.\n"},
{"review": "\nThe movie is scary, I'll give it that. The scenes where people are\nsilently trying to avoid the old man literally made me hold my breath\nin suspense. But those scenes don't last very long. The movie suddenly\nthrows in all these crazy things that seem impossible, and take out the\nmoral dilemma of who you should be rooting for. It drags on like crazy,\ntoo.I thought the move was gonna end about six or seven times before it\nactually ended. All the acting is pretty good. The plot just really\ngets out of hand and ruins the movie. Plus, nothing is scary on your\nsecond watch. The scenes that had me holding breath the first time\naround, quickly left me sighing and checking the clock. Not a bad\nhorror flick, but not really a good movie.\n"},
{"review": "\nWe all have seen many breaking into house films but this one will be a\nclassic in the genre.From the start only tension is build up and it\nonly gets worse from then.As the events proceed shots are fired, hide\nand seek begins. Once some truths are revealed you will be confused to\nroot for the old blind man or the teenagers looking to change their\nlives after robbing him. Even the dark scenes are intense and will make\nyou nervous. It's an edge of seat experience. In my view I support the\nblind man as whatever he did he did right as against the injustice done\nagainst him and I am clearly against robbing a person especially\nretired old blind man. I was happy that the blind man strength was not\nsuperhuman but just little more than normal which is indeed required\nfor a soldier. Cast has done a great job especially Stephen Lang and I\nlove all the tension building scenes whenever anyone was in front of\nthe blind man. The reveal near the end of the film is little creepy but\nit also shouts justice. All the scenes involving conflict and use of\nweapons kept me at edge of my seat. Final Word -This Movie does not\nwaste any second to give you what it promise i.e. An Intense terrifying\n, thrilling ride filled with some horror for 1 and half hours. Easily\nbest thriller of the year and among best thrillers of 2010s\n"},
{"review": "\nWell, the story-line is brilliant, and that is half the work done on\nthis horror/slash/thriller type of film. I was told it was less\npredictable than most. That's right, but it does not take a surprising\nturn like The Others does, or The Village. Just compared to Hammer\nHouse Horror maybe. It's a mix of horror and psychopath violence, and\nit tries to satisfy all audiences, except the ones who like a joke now\nand then. Too much bashing and thrashing to my mind, we would all be\ndead after one blow. And therein lies my objection to this otherwise\nwell made movie: I need to believe it could be true, and I do not. Not\nafter all those knives,pistols,garden tools and what-not. Less would\nhave been be more, to my mind. The producer should have trusted the\nscript more, and the acting, instead of relying on all that violence.\n"},
{"review": "\n'Don't Breathe' is an amazing and very entertaining horror film. A home\ninvasion story that is artfully terrifying, atmospheric and\nclaustrophobic. There are enough surprises and scares to keep everyone\nuncomfortable, and that's a very good thing. The movie is a nerve-\nracking thriller that doesn't stop coming at you until its final gasps.\nThe director shows with this film his capacity of keeping up the\nexcitement and suspense. If you're looking for a movie that will keep\nyou on the edge of the seat biting your nails, this is the one. The\ntruth is that \"Don't Breathe\" gives a new breath to this season's\nhorror movies and if you like the horror genre, this is for you. Oh,\nand... expect a sequel.\n"},
{"review": "\nIt's tension everywhere. Don't breathe delivers effective scares and\nthrills with a simple story and last-minute twists.<br><br>The plot is nothing new in the home-invasion genre, but the story,\ncharacters and antagonist help to make a it pretty welcomed addition.\nThere isn't much character development or background, but the precise\ninformation given about the protagonists and other flaws are more than\ncompensated by the heavy atmosphere of the flick.<br><br>A wickedly written and perfectly casted villain makes this movie a\nsatisfying journey. Stephen Lang is perfect in the role (for real, wait\nfor \"The Blind Man\" disguises in Halloween). What attracted me most\nabout the character is the fact that he isn't a psychopath, not a mad\nman, not a degenerate, he is a normal person (well, a very strong and\nmeticulous ex soldier). He is a father who suffered, and takes justice\ninto his own hands, without getting into traumatizing or pervert\nactions. One thing is for sure, if he must be a mean son of a @#$%&amp;, he\nwill be the worst mean son of a @#$%&amp;.<br><br>Something remarkable is the end of the movie (don't worry I won't spoil\nit), but I'll only say this: You will finish thirsty for a second part,\nsaying \"Daaamn!!\". Asking yourself: \"What if...?\" \"Do you think\nthat...?\" \"Holly @#$%&amp;, will he...?\"\n"},
{"review": "\n3 burglars one blind man and a dog making a thriller with a small cast\nis a very difficult thing but I give hats off to director for making\nsuch a wonderful thriller with a small Budget and a small cast the\nviolence was not that much unlike some movies like saw and hostel but\nnot for small children still it was disturbing and scary the blind man\nrole done by Steven Lang did an excellent job the story is small yet\ncomplex it is not about something who is wrong or right we feel\nsympathy both the characters it is something about who will win at last\nthere some places we feel the filim is dragging we feel that why these\npeople are struggling so much they could have killed that blind man in\ncertain point but still making such a fine thriller with a small cast\nis a very excellent job.\n"},
{"review": "\nI seldom venture out to the theatre to see films anymore, not because I\ndon't enjoy going but because there's seldom anything on I want to see.\nI'm not interested in films for children, chick flicks or films that\nhave to go BOOM every two minutes. I used to enjoy superhero films but\nlately they are just an excuse for loud pointless fights and bad CGI.<br><br>The only reason I went to the cinema is that my wife had friends\nvisiting and I wanted to keep out of their way (in the nicest possible\nway.) Don't Breathe was the only film showing at any of the local\ncinemas that was remotely of interest to me. I had no great\nexpectations but I was pleasantly surprised.<br><br>This is not a big budget movie and it depends heavily on the skill of\nthe actors to engage the audience and on the skill of the film crew to\nmake the most of claustrophobic spaces in the house where most of the\naction takes place. The plot is pretty thin but serves its purpose. The\nscore is never overpowering and the effects do not look like they\nneeded a Cray supercomputer (do they still exist?) to render crude\nvisuals that take you out of the action. Oh yes, and at 88 minutes you\ncan be assured the time is used to good effect and not just to add\nbloat.<br><br>A good efficient thriller with strong horror elements. Tense enough to\nkeep you gripped and short enough not to let you dwell on the plot\nholes. Give me this any day over the tedious blockbusters that\ncurrently monopolise the cinemas.\n"},
{"review": "\nA movie that when stripped down to its core is pure horror even when\nnothing about the premise indicate that it is. The movie utilizes\natmospherics and camera techniques to perfection! As we keep iterating,\nhorror is not defined by supernatural phenomenon or sudden loud noises.\nThere were some surprises in the movie, some plot twists which made the\nmovie really amusing. The essence of horror lies in a pervading sense\nof unsettling abnormality in the most normal of situations. It's\ncrafted thriller movie, disguised as horror flick. Thanx to\nflickstree.com which gives personalized suggestion like i got one for\ndon't breathe. They even allow you to watch movies online when you are\nrunning low on your pocket or getting bored at home. Its a really good\noption for movie buffs out there to get entertainment while sitting at\nhome. Flickstree.com is a must try.!! Enjoy\n"},
{"review": "\nI had heard some good things about Don't Breathe and decided to check\nit out. Overall, I think its a good popcorn flick. There were some good\ntension and a good twist but it was also wrought with clichés and a\nstupid ending. One of the things I specifically liked was the\ndirection. I liked how the camera moved around the house and focused on\ndifferent items. For instance showing the audience early on where the\ngun was being hidden. It definitely added on another layer of tension\nbecause you would keep thinking things like \"Who's gonna get to the gun\nfirst?\". I think the movie also did a good job of making the main\ncharacters likable and wanting to root for them even though they are\ndoing something bad in the first place (robbery). The cast did well\nwith their roles. If I had to pick a standout I would go with Jane\nLevy. Now on to the stuff I didn't like. The \"aww shucks\" nice guy\nbeing in love with the main girl and she doesn't know it cliché. It's\nso overdone. And with Rocky's (Jane Levy) broken/abusive home life, I\nget its to bring sympathy to her character but it also feels contrived.\nKind of like the lazy, easy way of getting sympathy. And then the\nending\u0085.oh boy. I don't want to go in too much detail cause I'm trying\nto keep this as spoiler free as possible but, it just seemed to ignore\na lot of details that happened earlier and therefore didn't make a\nwhole of sense. If you're looking for a film that's going to flip the\nhorror genre on its head, this isn't it. If you're looking for a quick\nthrill ride, then this would be up alley\n"},
{"review": "\nI saw 'Don't Breathe' today with two of my friends, both of whom were\nseeing a 'horror' movie in a cinema for the first time. If they were\nlooking to not be terrified out their minds, then they most likely\nfound what they were (desperately) hoping for. Although the film\nindulges in some jump-scares, some of which get rather repetitive,\nthere was nothing of the 'Conjuring' or 'Sinister' ilk. Instead, the\nchilling moments in the film come from moments when the story strips\nback the ostensibly creepy atmosphere and exposes the bare brutality of\nthe blind man in his attempts to very punitively reprehend a trio of\nthieves who break in to his house. One scene stands out particularly\njarringly in that respect. The basic premise of the film was one which\nI believed held significant potential prior to viewing and I felt\nsufficiently rewarded for my presumptive belief. <br><br>Set in the urban desolation of Detroit, Michigan - coincidentally the\nbackdrop of what I consider to not be just one of the finest horror\nmovies of all time, but one of the best films in recent memory, 'It\nFollows' - one suspects that there is a real tale of moral and physical\ndecay at the heart of 'Don't Breathe'. Where 'Don't Breathe' falls far\nshort in comparison with 'It Follows' is a lack of exploration of this\nvery interesting theme; for too long, the film focuses on scaring you\nwith its admittedly spooky set pieces, and thus neglects a fully\nfledged characterisation of its protagonists and antagonist, both of\nwhom we gather to be victims of the stagnant economic and\ninfrastructural landscape of Detroit. There is rather forceful\nshoehorning in of some half-assed side-plots, but they are too much of\na side-show to have any relevance to the plot or poignance to the\naudience. <br><br>If what you seek is certainly an entertaining, thrilling view with some\nminor food for thought, then 'Don't Breathe' is the film for you.\n"},
{"review": "\nI didn't expect much about this movie when I first saw the trailer. I\nthought it will just be a fine movie but I made a huge mistake. Don't\nBreathe gives you all the chills and nerve and built a great tension\nall throughout. It was all in the title and they did live up to that.\nGreat job to all the cast and crews. I was literally barely breathing\nthe whole time, together with my friend we were frustrated lol. It has\na great cinematography and jump scares. I have a one minor problem\nabout the ending. The ending was nearly perfect but somehow they just\nshowed another minutes of not really gonna \"add up\" something to the\nstory but all in all It's worth your time.\n"},
{"review": "\nFirst rate drama crime thriller.<br><br>The director and production team as do the cast deserve congratulations\nfor an excellent film.<br><br>A blind ex serviceman lives alone in a house and 3 robbers decide that\nhe will be their next victim: ...... as it turns out roles are\nreversed...<br><br>The magic of this movie is that the director is able to make virtually\nevery scene focused and intense and weave the story together in such a\nway as to keep the viewer engrossed.<br><br>Or to put it another way: the director by being so good steals the\nshow.<br><br>8/10\n"},
{"review": "\nVery good horror movie. The story is thrilling. The film tense humor.\nThe film is so exciting that I can not breathe a whole movie.\nUnexpected how the outcome occurred. Character acting is also quite\ngood. Video sound production is quite good. My friend and I are rate\nthe video highly. We all love it. Want to see such a good video again.\nIt's hard to care much what happens to any of the highly unsympathetic\ncast. Suffocatingly tense for most of its taut 88-minute running time,\nhome-invasion thriller Don't Breathe should, in the interest of the\nviewer's health, be re-titled: Don't Forget to Breathe. If you're\nlooking for a movie that will keep you on the edge of the seat biting\nyour nails, this is the one.\n"},
{"review": "\nFede Alvarez's 2016 thriller film \"Don't Breathe\" is a simple but\neffective film that is void on dialogue but makes up for this with\nextremely well shot scenes and sound design that leads to a slow roll\nof dread for both the viewer and characters. The film has an extremely\nsmall cast consisting of about 5 characters, the highlights being\nStephen Lang who plays the blind man in the film, films like these rely\non the villain to be nerve racking and scary and Lang knocks this right\nout of the park with his depiction of the military vet turned harden\nblind man after his daughter is hit and killed by a car in an accident.\nThe other characters in the film Jane Levy (Rocky), Dylan Minnette\n(Alex) and Daniel Zovatto (Money also play their characters well with\nthe highlight being Rocky, Levy plays Rocky well as a strong\nindependent woman who don't need no man who can take care and think for\nself, although she does rely on Alex several times throughout the film.\nThe film does suffer in some area's such as in the lighting where\nduring the scenes filmed in the dark there are many gun shot flashes\nthat instantly hurt your eyes. The Film also steers away from greatness\nwhen you realise their is a very weak plot holding the movie together,\nthe plot was mainly just there to give a reason for the blind man to\nhunt down teenagers. All in all I think the positives thoroughly out\nweigh the positives that's why i'm giving Don't Breathe a 8/10 and my\nown frozen semen seal of approval.\n"},
{"review": "\nDon't breathe is a tense thrill ride of a film. It has been a long time\nsince I have watched a thriller as good as Don't Breathe. Fede\nAlvarez's direction is inspired and also very watchable. Many films\nhave patches of action followed by sections were nothing really\nhappens, but Don't Breathe is a (if you pardon the pun) breath of fresh\nair. Throughout the entire film, I was on the edge of my seat desperate\nto see what happens next. Something I particularly noticed during the\nfilm was how silence is effectively used to create tension. This\ntechnique really helps this movie stand out as a great example of its\ngenre. <br><br>Jane Levy's acting is superb as her utter fear is translated extremely\nwell on screen. Stephen Lang delivers a hauntingly believable\nperformance that will send shivers down your spine. <br><br>Overall, I think Don't Breathe deserves 8 out of 10 as it is a truly\ngreat film that goes back to the basics of cinema.\n"},
{"review": "\nIt's been a long time since I've watched a movie that actually made me\njump, and not because of cheap jump scares, although there were a\ncouple of those too. As soon as the three friends entered the house,\nthe tension did not let up. The theater I went to didn't have a huge\naudience, maybe 15 people, but it was so quiet in there, that you could\ntell they were also feeling the tension.<br><br>Besides the tension, the violence was pretty hard core too. People were\nnot afraid to use guns, hammers, their fists, or anything else close by\nwhen it came to trying to defend themselves and get out of the house.\nSome movies go lighter on the violence when it comes to women, but this\nfilm didn't hold anything back. And normally when there is brutality\ntowards an animal I close my eyes, cover my ears and hum to myself.\nAlthough I did do it once, the other times I was so engrossed in the\nmovie I didn't have time to do those things, wanting to see what would\nhappen next.<br><br>There were quite a few problems with the plot, especially towards the\nend, but I'm not even going to get into them, the rest of the movie was\njust so good. That problems were the reason this movie got four stars\ninstead of five. Even with them, I highly recommend this movie. It\nwasn't as disturbing to me as the remake of The Hills Have Eyes remake,\nbut it is one that with definitely stick in my mind.\n"},
{"review": "\nThis was movie which me and my friends did a sudden plan to watch for\nweekend. it was very long time since we watched horror movie on big\nscreen. this movie was not too good nor that bad. It had lot of jump\nscares. All the actors are a bit new , but they have done a good job.\nStory was bit okay and small one. That old man has acted good and that\ncharacter is good and scary. there is this one disgusting scene but\nthat seems necessary to make movie bit horrifying. Well if you are\nexpecting a great horror movie with high expectation, you will be\ndisappointed. overall it is fun to watch once. there is this dog in\nthis movie, it gets on your nerves sometimes. rest of the movie is\noverall good. i give 7 ratings. this is my honest opinion.\n"},
{"review": "\nDon't Breath is the summer movie surprise, so far, this year. Don't\nBreath started out weak. What did not work with Don't breath, at the\nbegging was all the characters where scummy and unlikable. The other\npart of the beginning which I found hard to fathom is how the blind guy\nsurvive an attack by three people? Surprisingly, the movie improves\nwhen the blind man turns the light out in his house. The blind man has\nthe advantage in the dark. In the dark, the viewer finds out how\nderanged the old blind man is. A instinctive primal fear of the dark\nsets in for rest of the film. As the robbers try to escape the house\nthey find out what the blind man is hiding and will never let the\nrobbers live. As the story unfolds, there is disturbing images and\nscenes. The ending is cold as the decaying as Detroit neighborhood\nsurroundings. 7 stars. The makers leave room for part 2.\n"},
{"review": "\nDon't breathe quickly sets the environment and characters and we are\nintroduced to main story.Trio of thieves decides to rob the old blind\nman and thrill ride starts.Things don't go as they have planned and\nmany secrets are revealed as they story pace forward. There are some\ngenuine scares that literally holds our breathe.\nCinematography,background score add more charms to the movie.Even\nthough there weren't many dialogues in the film acting of each cast\nmember is great. I hope Fede Alvarez comes up with more such\ninteresting horror movies.<br><br>Overall, great thriller.A must watch.\n"},
{"review": "\nalso entertaining and silly to the point of being funny in parts<br><br>Pretty over-hyped and Spoilers Steven Langs Character sustained enough\nblunt head trauma to give anyone brain damage yet is perfectly fine, i\njust cant get past it took me out of the movie its just too much.<br><br>The movie its fine until about 3/4 of the way in then it loses the plot\nit just got a bit stupid. <br><br>That said the turkey baster scene was hilarious especially when he had\nit shoved back down his mouth bahahahahah. <br><br>As for the whole feminist angle i mean its a bit silly realistically\nJane Levys character would be dead as soon as he woke up would have\nheard/smelt her (does he facking randomly get his sense of smell back)? <br><br>I know girls like to wear strong perfume i am surprised they didn't\nbring that angle into it. <br><br>Movie is sort of predictable but at least it looks nice and sounds\ngreat. <br><br>It does enough right to set it apart from a lot of other movies. <br><br>7/10 <br><br>+Jane Levy +Gore +Fun +Doge Rottwhilers are awesome +Tense +So stupid\nits fun in parts +Acting from Lange and Levy is great <br><br>-Predictable in parts -Silly ending -Turn your brain off in parts\n"},
{"review": "\nI admired the pacing, the surprises and general flow of action, all\ntied up at the end with a pretty ribbon. But the movie somehow left me\nflat.<br><br>Thinking back to classics like Vertigo and North by Northwest, I\nrealized that character does matter even in a Boo movie. At first I\nliked the idea that we jumped right into the action without a lot of\nbuildup, but then the characters started to feel 2-D.<br><br>The girl Rocky wasn't convincing as an abused teen turned bad. She had\nGood Girl, not Bad Girl, makeup and hair. Alex was a Good Guy with no\npersonality whatsoever. The blind guy was great, though.<br><br>The other problem was basic lack of plot. Yes, we don't get Wuthering\nHeights at a screamfest, but the repetition, albeit with twists, as one\ncritic pointed out, was like a dance. Wham! Wham! Scuttle scuttle\nscuttle. Wham! Wham! Scuttle scuttle scuttle. It reminded me of a Punch\nand Judy show.<br><br>In spite of the adroit direction, there were odd lapses. SPOILER! In\none scene the blind guy is standing over Alex with giant garden shears\n- then dives for his belly. In a scene not longer afterward, Alex hugs\nhis belly briefly, then gets up and walks around as usual - no hole in\ngut.<br><br>Rocky falls on her head down a steep ventilation shaft but has no\nbroken bones. Not even a concussion. These are hardy teens! Don't\nBreathe is worth the admission but not worth all the hype.\n"},
{"review": "\nThis movie is absolutely relentless. It quickly sets up its characters\nand then jumps straight into the plot. What this film does best is it\ncarefully crafts an atmosphere that feels paper thin. It continuously\nbuilds this tension, and you yourself begin to feel unnerved. I\nattribute a lot of this to the directing. Fede Alvarez does a masterful\njob of maneuvering his way through this movie, making a small\nenvironment such as a house feel like an entire world. I really enjoy\ncontained movies, where the characters are locked in a house or a\nbuilding and they have to make do with the things surrounding them. And\nthat's what Don't Breathe does. Our characters have to think and act\nusing only the things they can find in this house...\n"},
{"review": "\nMorally this film disturbed movie. The more ethical young man in the\nfilm goes through hell while trying to save the female lead and makes\nsmart moves until her lack of judgment in a crisis inevitably costs him\nhis life. <br><br>The female lead is a complete narcissist, as if her childhood trauma\njustifies her behavior and she ends up making selfish choices, gets her\nfriends killed, and seemingly gets away with robbery and attempted\nmurder. <br><br>The scene which probably is emblematic of this day and age is when he\ntries to artificially inseminate her and she completely freaks out...\nHer reaction to this was way worse than seeing her friends die. Oh no\nMs. Narcissist, you won't be able to selfishly spend all that money you\njust stole if you're a young mother. If that director wants to\naccurately depict a rape of sorts than just have her walk around alone\nin France, Germany, or in dearborn Michigan. <br><br>Anyway, there were no morals or positive message of the film. It's\nalmost as if the criminals were glorified and despite the \"killer\"\nhaving a girl kidnapped in the basement, his only crime was wanting to\nhave another child and to be left alone.\n"},
{"review": "\nNice little thriller. For the first hour or so, at least.<br><br>I went in knowing very little about it with low expectations and was\npleased. Very tense. Believable acting. Flawed, but not completely\nunsympathetic characters kept me engaged. Good cinematography. Editing\nwasn't distracting. Neither was the music. Nice running time, too; they\ndidn't stretch the movie out to two hours and overstay it's welcome.<br><br>Third act had me cringing more from storytelling choices than from the\nstory itself. (Particularly, *Spoiler?, the implication at one point\nthat atheism necessarily leads to immorality. Ugh. My SJW blood\npressure started pumping.)<br><br>Enjoyable, original flick, though.\n"},
{"review": "\nI am not a film critic. I do not pretend to be. Nor do I care. When I\nwatch a movie I expect either entertainment or an interesting original\nartistic view into the human soul or mankind's history. Bottom line: it\nhas to be fun or memorable to be worth watching. Otherwise it is a\nwaste of time at best and poison the mind at worst.<br><br>This film is neither fun, nor memorable. It is a waste of time and a\nbitter pill.<br><br>This film is a tortured effort for a deep drama-thriller and is a\nmassive fail. Its attempt to create some form of a moral is ludicrous.\nPeople with unhinged and nasty fantasies wrote it and put it together.\nNo offense to Alvarez but I have no respect for his work. While keeping\nup with the secrets of the trade the characters are unrealistic,\nunsympathetic, and the \"glamorous\" ending, which contains a twist, does\nnot make sense. You will be on the edge of your seat not because of\nsuspense but because of disgust. As in all ridiculous contemporary\nfilms out of Hollywood, which makes 95% of them vulgar and deprave\nsexuality seems to be the way to entertain.<br><br>There were no good guys -- all bunch of criminal scumbags. The chick's\ncheesy dream to go surfing in California with her sister is just too\ncliché and ridiculous. I just could not sympathize with any of the\ncharacters. Art is the ability to compress in two hours a story which\nwill show you life and will make you ponder. Forget about it with this\nflick. You'll be happy that it's over and sorry that you started it.<br><br>If you want to watch a film of high artistic quality, totally\nunpretentious, based on true events, watch Gruz 200 (Cargo 200, 2007,\ndirector Alexei Balabanov). No Hollywood gimmicks and an absolute\nhorror. With absolutely minimalist use of gore. Watch and compare.\n"},
{"review": "\nFrankly, I'm surprised this movie got such a good review. It has MAJOR\nproblems, which basically require you to stop thinking logically in\norder to enjoy it. So allow me to sum up some of the problems with this\nmovie(WARNING,MAJOR SPOILERS AHEAD): 1- The blind guy isn't the\nsuperhuman warrior he's made out to be. I've met blind people who know\nwhere I am just by sensing my body heat. Contrary to what the title\nsuggests, this guy can't even tell where these kids are from their\nheavy breathing and even when he does sense them his aim is terrible.\n2- Those kids had literally a hundred opportunities to whack this guy\non the head. For heavens sake, they stumble by a workbench with tools\ndozens of times and yet it takes an hour for one of them get the bright\nidea of taking the hammer. 3- How the heck was this guy not found out\nby the police? So a woman kills some guy's daughter, and is found not\nguilty. Then suddenly she goes missing. If you were a police officer,\nwho is the first person you're going to investigate? 4- And how the\nheck was he STILL not found out, at the end of the movie when the cops\ncame to clear up the bodies and searched the house? Surely they\ncouldn't have failed to notice the SEX DUNGEON, the sperm bank and the\ndead pregnant woman who had gone missing almost a year ago wearing a\nparachute harness with chains and padlocks?\n"},
{"review": "\nFew horror movies can keep you on the edge of your seat from beginning\nto end. This one does.<br><br>Thanks to the well-written story, the never-stopping pace and the very\ncredible acting, the thriller will take you within the house of a blind\nman, defending himself against three ordinary burglars.<br><br>The characters have excellent depth. Stephen Lang (Avatar) does a\nterrific job as the blind ex-military, his lesser-known fellow actors\nare very authentic and have stories going of their own.<br><br>Clichés are avoided. Expect to be surprised many times. The typical\nsilence before the surprise or action is very misleading, adding up to\nthe tension as well as the creative story development.<br><br>If there's one remark to be made, it's the color in the movie. In some\nparts appropriate, in some parts a bit annoying.<br><br>Every few years, there's a really good thriller/horror movie made.\nDon't Breathe is one of them, even good for non-fans of the genre.\n"},
{"review": "\nWe thought the cinematography, casting and acting were exceptional, and\nworth seeing. The story, however, has too many flaws. The dog would\nhave awakened the man and put him on guard. How on earth would a blind\nman track down, capture, and enslave in a block and tackle harness, the\nwoman who killed his daughter in an accident? Without being seen? How\ncould any man survive multiple brutal attacks, including several\nswinging sledge hammer blows to the head? The police would have\nidentified the blood spatter DNA from both the captive woman and the\nescaped woman (Jane Levy), seen the block and tackle harness, and not\nsimply closed the case as a blind hero successfully dealing with only\ntwo robbers; they would have pursued those leads, even in Mayberry!\nWith a little more work on those issues, this could have been a real\nclassic.\n"},
{"review": "\nDespite the unanimous acclaim received by Don't Breathe, my\nexpectations before watching it were low, because I knew beforehand\nthat it belonged to the \"home invasion\" sub- genre, which I generally\ndon't like due to its repetitive structure and forced twists to prove\nthat \"things aren't what they seem\". However, Don't Breathe ended up\nbeing a very competent film, and much better than most of the movies\nbelonging to this sub-genre. The first act of Don't Breathe takes the\nnecessary time to introduce the characters and establish their nature\nand relationships with each other. Unlike other \"home invasions\", the\ncharacters aren't assigned easy roles of heroes and villains; on the\nopposite, our perception changes as new details get revealed, until\nreaching a logical and satisfactory ending... with a small touch of\nbitterness to remind us that life rarely has absolute levels of good\nand bad people. The characters evolve sometimes brusquely and sometimes\ngradually, generating quite a suspense and achieving an exciting and\nvery entertaining experience. Don't Breathe doesn't have the slightest\ntrace of dramatic filler; every scene tells us something, and every\nmovement is carefully planned for us not to lose the sense of time and\nspace in the claustrophobic house. I wouldn't consider it an excellent\nfilm, but I liked Don't Breathe pretty much, and I definitely consider\nit worthy of a recommendation. The previous (and first) film of\ndirector Fede Álvarez (the remake of Evil Dead) had been moderately\nentertaining, but mediocre; however, he displays much more potential\nwith Don't Breathe, and I will definitely will be expecting his future\nfilms with interest.\n"},
{"review": "\nDon't Breath is a quality terror flick that is guaranteed to keep you\nsitting with sweaty palms from the opening credits to the last.<br><br>The classic medley of an Old House, paranoia and the Dark lock you in\nto the feeling of Chlostrophobia and panic..... watching this at the\nCinema with the benefit of surround sound sets you to believing that it\nmay not just be the cast who may struggle to stay alive, yes I was\nlooking over my shoulder by the end.<br><br>With an excellent blend of casting and the constant shift of who to\nroot for throughout you should go and see this little scary gem!<br><br>Yes there are plenty of twists and turns but I will leave you the\nviewer to find out for yourself!<br><br>Enjoy\n"},
{"review": "\nHoping to walk away with a massive fortune, a trio of thieves break\ninto the house of a blind man who isn't as helpless as he seems. Don't\nBreathe has a lot of tension and 2 really good performances by Jane\nLevy and Stephen Lang but that's all the good i can say about this film\nthe rest of the movie is over the top in many scenes (Spoilers): like\nfor instance he can smell their shoes but at times he can't smell them?\nOr the fact that he holds down in his basement the girl who killed his\ndaughter and he puts sperm inside her in order to give birth into a\nchild and 9 months later he would let he leave. It's a good intense\nhome invasion movie but it's nothing that you haven't seen before it\nbasically looks like Panic Room most of the time. But the plot holes\nand all those same old same old mistakes that every single one of those\nhorror movies do get repeated all over again in this film as well for\nexample they hit him with a hammer and he gets up but when they hit him\nwith the crowbar he stays down? Or the fact that he found the girl on\nthe middle of the day? how did that happen? If you want to see a\nPsychopath blind old guy go check out Season 1 and Season 2 of Marvel's\nDaredevil i'm sure it has one. Don't Breathe is a fun film when it\nwants to but pretty lame when it doesn't 5.5/10\n"},
{"review": "\nNot without flaws, this is a taut, tense movie. I enjoy movies with a\ngray area as to whom to vote for. Everyone in this film has good and\nbad. They all have a particular goal and they all are ruthless toward\nachieving it.<br><br>The basic premise is a blind man gets a huge settlement after his\ndaughter is killed in a vehicular manslaughter situation. Three thieves\nare privy to this and want to steal his money. One of them has a father\nwho works in security and has keys to all the security systems in the\narea and with information. He wants to help the girl who desperately\nwants out of her situation (and needs money) because he loves her. Her\nboyfriend is all talk about getting things done and a bit of a douche\nbut has a heart in there too. It was also for me a bit like a\nmillennial vs. old school. The blind man is a war vet who was blinded\nin the war and the thieves are millennials in that they feel entitled\nto someone else's stuff but there is still a gray area in this section\nTHANKFULLY. You will see. <br><br>You switch off more than once about who to feel sympathetic for or\nwhether to root for anyone. One thing for sure is you will be tense and\non the edge of your seat. There are also plenty of twists here and\nthere to keep you interested. This is better than the other horror\nmovies you can go see right now I bet. Stephen Lang (as the blind man)\ndoes a great job. The more I think about it after, the more I like it.\nPS Don't watch the trailer.\n"},
{"review": "\nthis movie was seen by me as a result of Fede Alvarez's earlier works\nsuch as evil dead where i was gripped on by the plot of this where in\nmy case it was 'WAIT UNTIL DARK MEETS PANIC ROOM' but the director made\nme surprised when he didn't look for cheap thrills and clichés of\nhorror and tension movies and went on with a real story of a person in\nany of the side where he/she can be caught on with such circumstances\nand results. this film was about celebrating horror films that have\nfrayed hard on to be noticed and now resulting in new box office\nresults. if tension and suspense are you looking for and horrors have\nbeen tasted by you then this is the dessert you should be licking this\nweek.\n"},
{"review": "\nIn an interview about 'Aliens', James Cameron stated that as he didn't\nhave enough time to go into the backstory of all the marines, the\nquickest way to make an audience care about a character is to make them\nfunny. How a little humour would've gone a long way in 'Don't Breathe'.<br><br>Fede Alvarez knows there's no getting around the central problem of his\nthree protagonists - they're criminals; so he tries to elicit sympathy\nby portraying their home lives as less than idyllic. Well, sorry, but\nthat just doesn't cut it. He's wasting his time trying to justify their\nactions, because there's no justification, so he should've at least\nmade them lovable rogues, by having them be witty. Unfortunately, wit\nis something this film doesn't possess. An 'X Factor' style sob story\njust doesn't do the trick.<br><br>If you look at other teen horrors like 'A Nightmare on Elm\nStreet','Scream', 'Final Destination', etc, they were frequently funny\ndue to the teens remarks about the situation, which makes you warm to\nthe characters. If you don't care, you don't scare.<br><br>Having said that, 'Don't Breathe'is very well directed, Alvarez has\nsome camera moves that would make David Fincher proud. It's just a\nshame not as much thought was invested into making the audience care\nwhat happens.\n"},
{"review": "\nDon't Breathe (2016): Dir: Fede Alvarez / Cast: Stephen Lang, Jane\nLevy, Dylan Minnette, Daniel Zovatto, Jane Graves: Shocking horror film\nwith a title that brings light to the nearness of evil. Jane Levy,\nDylan Minnette and Daniel Zovatto play Rocky, Alex and Money\nrespectably. They are aiming to blow town for California and rob houses\nfor priceless items to pond off. They target a house in an abandoned\nneighborhood that is owned by Norman Nordstrom, a blind army veteran.\nThe three thieves aim to steal a fortune he has stashed but get more\nthan they bargained for. After putting his attack dog to sleep they\nsearch for the money only to awaken Norman. After killing Money, Alex\nand Rocky struggle to survive a brutal set of events that lead them\ninto the basement where further dire discoveries are made that address\nthe vengeful nature of Norman. He is played by Stephen Lang whose lack\nof sight allows for keen hearing and a decent aim. His daughter was\nkilled by a drunk driver and the guilty was set free due to wealth. The\nresult of this brings frightening insight into his mental stability and\nhis raging desire to restore what is lost. Director Fede Alvarez\npreviously made the gruesome remake to Evil Dead. Here the violence is\nalso extreme but not nearly as graphic. It contains a strong theme\npresenting one's desire for riches and the consequences for coveting.\nLang is menacing as Norman whose skill has limitations. Levy discovers\nher mistakes way to late and their impact upon others resulting in her\nbeing dragged by the hair down the vacant street reflecting how she got\nthere in the first place. Score: 9 / 10\n"},
{"review": "\nAs many people told already, the least you know about the movie, the\nmore you end up enjoying it. I for one went in knowing absolutely\nnothing but the name, and while I'm not a big fan of the genre, I found\nthis title to be superb. To give as few information as possible, the\nstory begins when three amateur thieves attempt a robbery inside a\nhouse inhabited by a blind man and his lovely dog, thinking it'd be an\neasy target, but then things start going awfully wrong for them.<br><br>Truth be told, it's pleasant to see titles not going over supernatural\nbased-on-real-facts-yet-truly-unbelievable kind of stuff (yes, I'm\nlooking at you The Conjuring) for a change. A great film worth watching\nand with very few flaws.\n"},
{"review": "\nDon't Breathe is not an easy movie to watch, nor is it a pleasant one.\nThese attributes do not hurt the movies quality or take away from Fede\nAlvarez's talent.<br><br>The director first emerged with his mainstream debut, a remake of Evil\nDead, which succeeded in being different than the original and still a\nfantastic movie. His next step was Don't Breathe a movie that centers\naround three teen robbers that break into an old blind man's house as\none last job before they leave the run down Detroit. This all goes\nhorribly wrong when the Old Man is more powerful then he appears to be\nand a deadly game of Cat and Mouse is played.<br><br>Just like with Evil Dead, Fede has directed a movie that can be viewed\nin both ways that any Good horror movie can be viewed. An experience\nthat scares and also encourages you to cheer on the likable characters\nas they dodge the deadly killer. The movie is claustrophobic and has\nsome of the best jump scares ever seen in film. This is not a movie\nthat relies on loud organs and screams to fright as the movie makes you\nfeel as trapped and hurt as the main characters. <br><br>Now to the last twenty minutes of the movie which is sure to be water-\ncooler talk for the next week. The movie has one of the most tense\nscenes ever in a film. It is a very provocative scene and will make\nsome uncomfortable to the point of walking out of the theater. The high\noctane scene also makes the climax of the movie a little weak by\ncomparison and it goes out on a whimper instead of a bang. <br><br>Don't Breathe is worth a watch, even if you might have to step out of\nthe theater for certain parts. This is a movie for fans of Green Room,\nEvil Dead, or any good slasher flick.\n"},
{"review": "\nThis movie is great if you have a strong stomach and love a good\nsuspenseful movie with action, and jump scares. This movie is\ndefinitely worth seeing,however turns from suspenseful,and scary to\nGrose, which may turn off a lot of viewers. This movie is probably one\nof the most suspenseful I've witnessed in the last few years, but one\nof the grossest as well. Bottom line if you can handle Grose and\nsuspenseful jump scares this is the movie for you. Overall I thought\nDon't Breath was a great story,and intense almost all the way through.\nThe movie starts off slow, and then slowly gets more interesting,and\nintense by the minute. Don't Breathe starts off with Teenagers thinking\nthey have a good shot of Robing this blind old man, when little do they\nknow this guy is the wrong twisted guy to mess with. Midway through the\nmovie it seems like the old man is useless, but that isn't the case.\nDon't Breathe is one of the best horror movies I've saw all year, and\ngrossest. So if you like Grose and scary go see this movie! Why is this\nmovie so interesting? The story line, and the suspense with it. Why is\nthis movie not in some areas? Well that's easy! It can get really\nunpleasant in some spots of the movie near the end. If the movie wasn't\ntwisted I think this would hands down be the best horror movie of the\nyear because it includes every aspect of an awesome horror movie.\n"},
{"review": "\nI knew basically nothing other than hearing it was a \"home invasion\"\nhorror film. I intentionally didn't read anything on it or watch any\ntrailers, and thank goodness. It safely continues the trend of great\nhorror this year. Wickedly brutal, bonkers crazy, and so, so\nridiculous. That last thing is said with absolute love and glee though.\nLike 10 Cloverfield Lane earlier this year, it knows it's basically a\nB-flick in every sense of the word and Fede Alvarez runs away with it.\nThe film never actually turns into a comedy horror film because it's\nnever that obvious, and yet you can sense the filmmakers laughing with\nglee while making it. The filming and directing itself is really well\ndone. Although it doesn't hit the the genre highs that Green Room (a\nfilm that is also similar in its frenzied and feverish pacing and\nnarrative) hit, it still does so much justice to this genre. The acting\nitself is also pretty good, with Jane Levy continuing to be the MVP and\ncontinuing her talent from Evil Dead. She and Alvarez make a great\nteam.\n"},
{"review": "\nThis movie generated a lot of hype in it's early screenings, and the\ntrailer seemed to promise a tense and violent romp. It definitely\ndelivered lots of nerve-wrackingly tense moments that had the theater\njumping without necessarily using the classic \"jump scare\" tactic. The\nacting was good, and all of the characters were well- written enough to\nhave a lot of likable and unlikable moments, which was a nice break\nfrom usual horror stereotypes. I can see how people would be praising\nit as a horror masterpiece because it definitely was scary without\nbeing cliché. It was a lot of fun to watch in theaters.<br><br>So if I have so much positive feedback, why give it a six instead of\nsomething higher? The reason is there were at least two very obvious\nplot holes to me while watching that were never resolved. The beginning\nof the movie made me somewhat dislike the main characters, who seemed\nto lack any real intelligence until they're actually trying to survive\nin the house. The ending was about three scenes too long, and the whole\n\"evil guy never dies and is also able to be everywhere at once\"\nmechanic begins to wear a little thin by the end of the movie.<br><br>Also, there is THAT one scene. Get ready for it. Do not make the same\nmistake I did and think that the popularity of the movie meant there\nwould not be one extremely weird and disturbing moment that would make\nyou regret bringing your mother along with you. I personally love the\nweird and slightly obscene in horror movies, but this one does nothing\nto prepare you for what is to come. Maybe if I had walked into the\ntheater with a different mindset, this movie would have been more\nsuccessful for me.\n"},
{"review": "\nHorror movies continue to impress as Don't Breathe arrives to finish\noff late summer at the movies. This thriller follows three criminals\nwho break into houses until they break into the wrong one. Rocky (Jane\nLevy) just wants to escape crumbling Detroit to a life in California,\nbut she needs one more score to have enough cash to leave. Her\nboyfriend, Money (Daniel Zovatto) hears about a blind veteran who\nreceived a large sum of money from a settlement after his daughter died\nin a car accident. Alex (Dylan Minnette) uses his dad's security guard\nkeys to gain access to houses though this particular location proves\nmore difficult with a vicious dog and an inordinate amount of locks.<br><br>Stephen Lang is ferocious as the blind man with dark secrets of his\nown. Lang stalks through the house creating a horrifying villain\nwithout any supernatural help.The acting was great from the three main\nactors. Dylan Minnette has graduated from the young Goosebumps film to\na more adult horror and I hope he continues work in the genre. Jane\nLevy has shown promise with her appearance in Evil Dead and looks to\nhave a bright future as a young actress. Fede Alvarez directs the film\nbrilliantly with amazing cinematography to enhance the terror.<br><br>Check out more of this review and others at swilliky.com\n"},
{"review": "\nI will say the idea of a blind man getting robbed is appalling and sad\nbut i will say for the purposes of the film, it seems to work. The\nstory deals with a trio of robbers Alex, rocky, and money steal items\nfrom peoples homes and selling them. Rocky wants to take her sister\naway from their neglectful mother. The trio discover a blind war\nveteran who won a wrongful death settlement as a result of his\ndaughters death. The trio think it might be an easy score but little do\nthey now the blind man is not as helpless as he appears and are forced\nin a battle of survival. I will say while some parts were predictable\nand laughable but it was a decent film for what it was\n"},
{"review": "\nI went in to this film not expecting to feel scared or frightened, but\noh was I wrong. This film manages to frighten you with just the dead\nsilence. Another thing that this film does well is conflict your\nallegiance with the three main characters. At first, all three of the\nmain characters come off as inconsiderate punks who have no regard for\nthe people they steal from, but as the story progresses when they rob\nthe blind man, you sort of hope they make it out alive when you see how\nmonstrous the blind man can be.<br><br>Only drawbacks to this film are some basic logical fallacies.\nAdditionally, I thought the film makers may have over-exaggerated the\nblind man's abilities. Other than that, I recommend watching this film.\nIt is definitely better than the average horror movie these days.\n"},
{"review": "\nI was really excited about this film but it was the most predictable,\nstupid and cringe worthy film I've seen in a long time.Its your typical\ncrap slasher movie, like of course its the woman alive at the end and\nthe guy practically sacrifices himself for her. HE'S BLIND FOR GOD\nSAKE, there was so many times they could have just walked up to him and\nsmacked him with a plank of wood or something, and why did the gas not\nknock him out? AND THE DOG!!! don't get me started - that thing turns\nup every now and again when it suits the director and apparently can't\nrun faster than a beat up man or woman. The ending was pathetic on the\npolice report saying an innocent old man was attacked in his home, SO\nWHAT ABOUT HIS DUNGEON AND THE MESSED UP SWING TRAP IN THE BASEMENT???\nThey miss that did they? Way too many holes in the story and frankly\nlaughable scenes.\n"},
{"review": "\nSaw this last Sunday with my dad n son in theatre. It was on my\nwatchlist for a very long time. It is a tense thriller. It is really\nintense, terrifying and with plenty of twists and turns. The script is\nbrilliant and provided a perfect ingredient for a fast paced thriller.\nActing was decent. Jane Levy and Dylan Minnette was great to watch. The\nfrustration, anger, fear and desperation was portrayed well by these\nactors. Stephen Lang did a fantastic job as a blind army veteran which\nwent well with his muscular body and heavy voice. Direction was\nawesome. Fede Alvarez did an awesome job. The idea of showing certain\nthings which would play a key role later in the movie as the burglars\nenter the house was great. Some scenes were very well shot inspite of\nbeing in dark. U can feel that it's dark but as audience u know what's\ngoing on. The cinematography was very good by Pedro Luque. The\nbackground score by Roque Banos is one of the highlight. The editing\nwas top notch. Eric L. Beason, Louise Ford n Gardner Gould did a\nfantastic job. It grossed over $90 million against a $9.9 million\nbudget. Wow. Speaks volume. Movies which audience may find similar-\nPanic room, Wait until dark, The Collector, Livid. Sam Raimi n Fede\nAlvarez did a wonderful job of satisfying thriller fans.\n"},
{"review": "\nOne of the fascinating thriller movie of the decade.The film gives you\ngoosebumps and makes you sit at the edge of the seat,the whole time.A\nfilm worth watching. A desperate movie for thriller lovers. At the end\nf the day, a movie you would love to talk about with your spouse or\nfriends. The short story is, a group of three people, skillful in\nburglary activities loot only the gadgets and widgets from the house.\nAfter few occasional thefts, they longe for more money and the rest\nwhat happens is the plot, which would be best when you discover it by\nwatching it.<br><br>I have now started finding better movies through www.flickstree.com. It\nnot only suggests great movies to watch, it also tells where can you\nwatch the movie online.\n"},
{"review": "\nEnding the summer season in horror style, Don't Breathe is about three\nteenagers robbing houses where they come across a blind army veteran\nwho has quite a lot of money, but not all as it seems because this\nblind man...is Stephen Lang. The same Stephen Lang who tried to destroy\nPandora in Avatar...you just know what you are getting yourself\ninvolved in. Right from the opening scene, the tension is building and\nthroughout the 88 minute runtime the suspense just does not stop. This\nis simply edge of your seat cinema, less horror but more thriller. The\nperformances were great, obviously Stephen Lang is a badass (I mean\nwhat were the teenagers thinking!? Don't mess with him!) but the\nrobbers themselves played understated performances, each character with\ntheir own backstory which were developed enough. The direction from\nFede Alvarez just oozed confidence, he knew exactly what he wanted to\ndo and he did it. Excellent camera work (a nice long shot near the\nbeginning of the film, I was impressed!), great lighting to create the\natmosphere and good editing to create those jump scares. Speaking of\njump scares, there are a few of them however I would not class this\nfilm as a horror, it is more a thriller. I was not scared (and to be\nhonest, no one in my cinema was either) but we were all on the edge of\nour seats. Whilst some might find that a flaw, if anything it is just a\nmisrepresentation of the movie. One flaw that this film does have is\nthat all the characters are bad people and therefore not likable, which\nmeans it is difficult to become attached to them. Overall, Don't\nBreathe was a great suspenseful thriller with sublime technical aspects\nand brilliant performances albeit if the characters are not likable.<br><br>- Review at: http://www.themoviediorama.com\n"},
{"review": "\nI don't understand where the high rating is coming from. How can a\nhorror movie fan enjoy basically a self-defense shooting movie so much?\nThere's no likable characters here, and the potential source of fear is\na very regular although strong human being. Yes, he is off in his idea\nof revenge, but he measures his cruelty which is unlikely for thriller,\nisn't it? What is \"horror\" about it? Sheldon Cooper's problems were\nmore \"horror\" than this. I think one reviewer here said it best: \"Don't\nBreathe is a grisly, unpleasant exploitation film about characters that\nyou don't like going up against a man who is at first somewhat\nsympathetic and then turns out to be a ridiculous mess of a (human)\nmonster, and it's directed with some skill.\"\n"},
{"review": "\nI'm not sure why 'Don't Breathe' is praised so much. This movie is\nnothing special really if you're familiar with the genre. It doesn't\nhave anything to offer that wasn't done before and often done better.\nEven though the movie is entertaining, it is far from groundbreaking.\nIt's not even very thrilling and there's hardly any horror in it. It's\njust an average genre movie with an average plot and average acting. So\nwhat's the deal with the exuberantly positive ratings?<br><br>I'm pretty disappointed because Fede Alvarez's previous movie, 'Evil\nDead' (2013), is one of my all-time favorite horror movies and one of\nthe greatest horror remakes ever made if you ask me. I see little of\nthat excellent filmmaking Alvarez displayed in 'Evil Dead' in this\nmovie. It's really a shame and I hope that I will enjoy Alvarez's next\nmovie more than 'Don't Breathe.'\n"},
{"review": "\nDon't Breathe has a very simple premise: three burglars attempt to\nescape with their stolen money from a supposedly helpless victim living\nin a house, only to find themselves trapped and accidentally managed to\nuncover something dark hidden inside the house.<br><br>With so many horror movies on the rise this year alone, Don't Breathe\nmanaged to score a sweet spot in one of the best. The movie\nsuccessfully creates a tension that ran thick throughout the whole\nmovie. It doesn't rely on cheap jumpscares and convoluted backstories,\nit relies on effective delivery of horror.<br><br>The problem is, with a movie this simple, the flaws are apparent. There\nare no character development whatsoever, the tension might overstayed\nits welcome, and all of the actors delivered a subpar performance.<br><br>Overall, this movie provided good entertainment and continues to break\nthe boundaries of the usual horror movie tropes.\n"},
{"review": "\nA trio of hobbyist-robbers decide to break into a blind man's house, to\nsteal a money-stash he's sitting on. a) He's blind. b) These guys know\ntheir stuff.<br><br>Should be pretty easy, right?<br><br>One could not be more mistaken. <br><br>Turns out, this blind guy is a war-veteran, whose killer instincts are\nremarkably well-oiled for his age. Did I mention his bloodthirsty dog?\nOh, he also has a dark, dark secret in his basement, which he'll go any\nlengths to protect. And the desolate neighbourhood helps in drowning\nall the gunshots. <br><br>So what turned out as a simple, (cliched) one-last-time in-and-out\nheist, quickly escalates into a brutal case wherein the robbers are\ndesperately trying to get out of the godforsaken hellhole that they got\nthemselves into.<br><br>\"Don't Breathe\" was a fresh infusion into my love for Horror movies,\nafter the massive disappoint that \"The Conjuring 2\" was.<br><br>The storyline is brutally realistic, with no supernatural elements\nwhatsoever. Some brilliant shooting accompanied with an eerie\nbackground score makes this an exceptional movie. The best part, you\nhold your breathe till the very end. :)\n"}
]