[
{"review": "\nRaised by a family of wolves since birth, Mowgli (Neel Sethi) must\nleave the only home he's ever known when the fearsome tiger Shere Khan\n(Idris Elba) unleashes his mighty roar. Guided by a no-nonsense panther\n(Ben Kingsley) and a free-spirited bear (Bill Murray), the young boy\nmeets an array of jungle animals, including a slithery python and a\nsmooth-talking ape. Along the way, Mowgli learns valuable life lessons\nas his epic journey of self-discovery leads to fun and adventure.<br><br>Disney Picture is the best company in making top and number 1 family\nmovies.<br><br>Everything is excellent about this movie.<br><br>I guarantee you this top movie will win too many Oscars.\n"},
{"review": "\nA great remake that will definitely enchant kids and adults. The CGI\ncharacters are excellent and there is an entertaining atmosphere of\nhumor, adventure and suspense. <br><br>Mogwli is a Lost boy in the Jungle,but has been grown up the animals -\nBagera(Panther), Rakhsha(Wolf mother), Baloo (Bear). Soon Mogwli\nrealizes that since he is human he needs to live with humans.Yet,he can\nnot abandon his loyal Animals who have already taken care of him since\nhe was a baby.<br><br>\"The Jungle Book\" 2016 has a different,but an amazing ending than \"The\nJungle Book\" 1967.I can guarantee that you will see a perfect movie\nwith Great Graphics IMAX Effect and The Best 3D I Have Ever Seen.<br><br>I really estimate Disney for their support of Lesbian and Gays.Disney\nis Simply The Best.\n"},
{"review": "\nWhen I went to see this movie I kept thinking about how great was the\ncartoon movie with all its extravagant and funny characters: Balu, the\nelephants, even evil characters like Kaa (the snake) were fun to watch.\nHow could I even forget a minor character like the vultures, and their\njokes on Shere Khan? Their humor was great in contrast with the tiger's\nego. I thought I would revive all those memories watching this movie. I\nwas wrong.<br><br>This movie is lacking of various things. First, a good plot. Second,\ngood characters with relevant appearances. Third, humour (nonexistent\nif we ignore Balu) and a good atmosphere for songs (is this supposed to\nbe a musical?). And fifth but not least, WHAT IS KING KONG DOING IN\nKING LOUI'S TEMPLE?? What they have done to that poor monkey is\nunbearable.<br><br>MY SUMMARY(SPOILERS):<br><br>King Loui doesn't dance. Shere Kahn doesn't bother to chase Mogli\nthrough the jungle. Why would him anyway? He already knows the plot.\nKaa's appearance in the movie is what in Spanish we call \"postureo\". He\nappears once. He narrates Mowgli's origins to the spectator (how plot\nconvenient...). He tries to eat the kid with no success and fades away\nto live happily ever after. The rest can be summarized in: f*ck logic.\nI have been walking for two days to get to the human village, and now I\ncan just run away for 10 minutes with a torch in hand to get just where\nthe movie started. Hi, my name is Mowgly and I like to burn down\njungles in my free time (appaluse). AH AND THE VULTURES DON'T EVEN\nSPEAK IN THE WHOLE MOVIE, SAME AS THE ELEPHANTS which are considered\ngods among the other animals (wtf) and magically appear in the last\nscene to save the day.<br><br>Please re watch the old movie instead of wasting your money in this\nthing. Why Loui?... Why?...\n"},
{"review": "\nThe Jungle Book is a live-action/CGI fantasy film that retells the\nstory of Mowgli, an orphaned human boy who, guided by his animal\nguardians, sets out on a journey of self-discovery while evading the\nthreatening Shere Khan. Neel Sethi plays the main character, Mowgli in\nthe movie. He is the only human being on screen and as his first ever\nrole, this kid actor is truly magnificent. He is as good as any kid\nactor has ever been, even favorably compared to Haley Joel Osment in\nThe Sixth Sense. The computer generated imagery is brilliant all\nthroughout, definitely some of the best ever and the 3D is just mind\nblowing. In every single scene I kept getting surprised and thrilled at\njust how amazing the CGI and 3D were. I think the main reason as to why\nthis movie worked it's because it also has a very good story line\nthat's mixed in with the amazing visuals. Also, the voice actors are\nall perfectly cast. Especially Idris Elba as Shere Khan, who is truly\nhaunting in every scene he's in. That was one well made and scary\nvillain that Mowgli had to face. Jon Favreau did a fantastic work with\nthis movie, cause really this story has been told many times before,\nand yet this movie feels fresh and interesting nonetheless. I'm glad\nthat it's doing so well in Box Office because it completely deserves\nit. Movies like this must be appreciated so that they can inspire more\ngreat work, and maybe one day, even erase movies like Transformers.\n"},
{"review": "\nafter seeing this could not believe the reviews, the film was bad, bad\nand bad. the kid playing mowgli has to be the worst child actor i have\never seen, terrible voice, one gormless expression throughout the film,\nhe could not convey joy, sadness or fear. the film looked fuzzy and\nwashed out all the way through. all the voices were flat and un\nemotional, great actors as bill murray and christopher walken sounded\nlike they were on valium. not a patch on the animated version or the\nkorda version and not remotely close to Disney's own previous live\naction retelling of the story that stephen somers directed with an\nolder mowgli brilliantly played by jason scott lee. the film had no\ndepth, emotion or character to it. the script was cliché after cliché.\nthere was no life in any part of it, no pace just seemed to go through\ntired set ups. as for it having an ecological message, we could not see\nor find it anyway or anytime during the film.\n"},
{"review": "\nIf there is one thing that Hollywood is good at is ruining our favorite\nchildhood films, but not with this film. So The jungle book focuses on\na boy named Mowgli that is raised by a pack of wolves in the jungle.\nBut when a tiger named Shere khan learns of his presence, he must flee\nthe jungle in search for the man village. Helping him get there is a\npanther named Bagheera and a bear named Baloo that must protect him\nuntil they reach they reach their final destination. First the pros.\nThe special effects are amazing! I've never seen cgi animals look so\nrealistic on screen before. Neel Sethi does a good job at playing\nMowgli. Considering that this kid had to work with nothing, then he is\ndoes an excellent job. The characters are very likable. Whether they\nare good guys or villains. The story seems kinda simple, but when it is\ndirected in a way that makes it entertaining, then your going to find\nyourself liking this film. To be completely honest i didn't see any\ncons to this movie. Overall i really enjoyed the jungle book. It was\nfun, visually dazzling, action packed, and funny at times. One things\nfor sure when it is on DVD, I am going to buy it.\n"},
{"review": "\nIt is mediocre attempt to try to fit the fictional anachronistic\noriginal \"jungle book\" to a more realistic context. The visual effects\nin the movie are very nice, but that's it because the story lacks\nsubstance. There is a sense of emptiness in the movie that makes you\nwish for more without getting it. The story is not good for children 5\n- 10, given the violence, nor for adults given the lack of\nplausibility. Something that bothered me was that the in the movie,\nproducers made a lot of effort in presenting the animals realistically\nbut their roughness and strong presence contrasted so much with the\nvery delicate and unrealistic nature of the boy actor. That didn't add\nup. <br><br>I was sorry to rent this movie.\n"},
{"review": "\nI was able to keep my eyes on the screen from start to end.<br><br>What i don't like is why this movie end. because i was fill my self in\nthat world.<br><br>Graphics and Visual Effects Was Just Awesome Nothing else.<br><br>I can tell that this is Disney best Creativity Animated Film.<br><br>Just Awesome Graphics IMAX Effect and 3D i ever Seen.<br><br>Like to see this movie more and more.<br><br>I think this Will Oscar Winning Movie for 100% Sure Its Enjoyable for\nAdults and kids.<br><br>Recommanded to see Once in Theatre at costly seat.\n"},
{"review": "\n17 April 2016 Film of Choice Tonight at The Plaza Dorchester - The\nJungle Book. Apart from films set in space this has to be one of the\nmost amazing uses of CGI I have seen to date. What a visual assault we\nwere treated to. The jungle in all its glory, never sleeping, never\nquiet, and always with a surprise around the corner. This latest Disney\noffering, a live action (mostly CGI) remake of its 1967 story of\nRudyard Kipling's jungle book was epic. It took the tale of Mowgli, the\nman cub and presented it to us in a whole new format. The animals were\nall very realistic, yet very true to the animated versions we know and\nlove. There were many moments I recognised yet many new ones slotted in\neffortlessly to the story. A line up of huge talent provided the\nvoices, from Scarlett Johansson as Kaa the snake, Ben Kingsley as\nBagheera the panther, Idris Elba as Shere Khan the tiger and Baloo the\nbear was voiced wonderfully by Bill Murray. Although there were a few\ntense moments which made me jump this is a great film for all the\nfamily to enjoy.\n"},
{"review": "\nWhile I prefer the older animation (8), this is still worth your time.\nThe CGI is impressive &amp; Mowgli interacts well with the animals. It is\nmore serious in tone, making the lighter moments and obligatory songs\nout of place. I was pleased that the wolves and Shere Khan got more\nscreen time. The cubs and the baby elephant are adorable. I wasn't keen\non the re-imagined Baloo and King Louie. (Although, Phil Harris &amp; Louis\nPrima would be impossible to impersonate.) The elephants, monkeys and\nvultures don't have speaking roles. Bagheera and Shere Khan are the\nstrongest characters. Kaa is now female and she is given a significant\nscene. The ending is different. Mowgli is given a more active role.\nSome nods to The Lion King. It might not be suitable for\nyounger/sensitive children. I liked that they included some of the\ninstrumentals from the classic. A good, alternative version.\n"},
{"review": "\nI'm a sucker for animal stories and The Jungle Book is one of the best.\nWhat kid doesn't want run with the wolves and sleep in a tree? <br><br>I won't go into detail about the story as it's already so ingrained in\nour collective consciousness but I have to pay respects to the\nproduction design, art and music - and every element that makes a great\npicture.<br><br>First, the music is so right (SPOILER ALERT!!) When Baloo and Bagheera\nstand at the edge of the jungle and watch Mowgli save a baby elephant\nto the tune of The Bare Necessities, the familiar song floats on a\nsweet and somber note. They know he's becoming a man - and the tender\nversion of the tune compliments what we're seeing on screen; We see the\nbittersweet realization (and the pride) in the faces of the animals.\nThis is sublime perfection; a perfect marriage of music and the\nartists' emotional brushstrokes.<br><br>That scene alone is worthy of a five-hanky movie status - but the\ncreators of this version of The Jungle Book treat every scene with\ngreat affection and respect. Each shot is beautifully framed. Any given\nframe is a glorious masterpiece in color and composition. In the book\nworld we would give a Caldecott Award to such artistic achievement. I\nonly hope the Academy of Motion Picture Arts &amp; Sciences will recognize\nthis beautiful piece of work when it's time to nominate the Oscar\nfilms.<br><br>Finally, the direction skillfully weaves the beauty and wonder of the\njungle world and the humor of growing up - while also sending us on a\nheart-pounding tale of revenge.<br><br>Director/Producer Jon Favreau and his team got it right. <br><br>Bravo.\n"},
{"review": "\nIn the age of tigers getting extinct, it was not the time for a simple\npicturizing of the Kipling story. Too bad for all the effort Disney put\nin the animation but, unlike many old stories out there, this one\nneeded badly a re-editing.<br><br>The movie? - the animation is very good, considering other movies so\nfar - the high level story is unchanged - Disney funny \"flowers\"\npresent: jokes, songs, lines, characters, etc. - drama present, too<br><br>If the first three points prepare a stage for kids, the last one\nbrutally denies it.<br><br>Coming back to reality, Mowgli will probably not have to worry about\nSharekan anymore soon.\n"},
{"review": "\nI guess this will be a spoiler because I found the story line to be so\nfar from the original, I feel I had to tell you before you wasted your\ntime and money to see it.<br><br>I don't know what story this director was trying to copy, but it wasn't\nThe Jungle Book that I know. The only resemblance to the original story\nare the character names.<br><br>There's some stupid part that the elephants created everything, and\nthey had to bow to them to show respect?? What?<br><br>And, he never sees the little girl! As far as we know he stays in the\njungle??<br><br>No where near the original story line. Disappointed that this guy felt\nhe had to re-do the entire story to conform to his stupid theology.<br><br>NOTE: the animation and graphics were really cool, but that's not an\nexcuse to change the entire story. It would have been a super movie IF\nhe would have stayed with the story line.<br><br>This guy obviously likes himself a little too much to think he has a\nright to make Jungle Book any way he wants and still call it \"Jungle\nBook\".\n"},
{"review": "\nCGI. A source used to hide props or things in sets, not a good source\nfor characters. My mind is off that statement know changed thanks to\nthe work of Jon Favreau and cast/team. This movie FYI has fantastic\nCGI, never in this movie I thought that those creatures were CGI. The\nvoice/real acting from all cast was fantastic, even from kid actor,\nNeel Sethi. And also from the fearsome character, Shere Khan. Voiced by\nIdris Elba. The story and directing runs smoothly with the visuals and\ncomedic acts animals and human do. This movie is an amazing one from\nthe visual acting and the acting, it deserves a lot of money from the\nbox office, see this movie in theaters or rent it if you can, almost\nperfect.\n"},
{"review": "\nIn this movie, a boy is found by a panther in the middle of a jungle,\nand raised by wolves until he is a bigger boy. He isn't quite big yet,\nbut is already threatened by the tiger Shere Khan. So he runs away, but\nthen realizes that the jungle is his home and decides to stay there by\nscaring all the animals with fire and killing the tiger. This is a\ntypical child-hero movie for children to watch. The child seems too\nsmall to do anything that he does in the movie, but as it is \"just a\nmovie\", it doesn't really matter. <br><br>I actually expected something much better when I watched the trailer,\nsomething more imaginative and visually pleasing. But what I found was\nsomething predictable and ordinary. The story starts off pretty well,\nand the scenes with the bear and some other animals are fun and cute.\nBut like all the other movies just like this one, the child-hero\nrealizes that he can somehow \"protect\" himself and his friends and\nfamily from the evil tiger. He uses the thing that animals are most\nafraid of- the fire. With it, he succeeds in scaring and showing off to\nall the animals and killing the tiger.<br><br>The visual effects of the movie was of course good quality, but it\ndidn't really catch my eyes. The thing that I liked the most about the\nmovie were the scenes where the bear would sing- it was actually\nentertaining. But overall, it felt like the story was lacking detail,\nand just focused on getting to the victory at the end, and there were\nlittle creative aspects in any way in the movie.\n"},
{"review": "\nI would make a confession that I have never read the Jungle Book as a\nkid and the only memories of Jungle Book I had was seeing the cartoon\nin India in Hindi. And may be due to this, I was never attracted to the\nstory of the man cub in the jungle. Also, the only story of Kipling I\nread in school was Kim which I felt was touching.<br><br>Technically, Jungle Book is a brilliant film. Amazing visuals and its\nhard to believe that all the animals are CGI generated. And I won't be\nsurprised if the movies wins a few Oscars for the technical aspects.<br><br>However, when I did go to see the movie in 3D and I saw lots of kids\naround, I was surprised that Favreau had made a film targeting a more\nmature audience. Seriously, Shere Khan and Kaa are pretty scary to see\non screen, menacing and dangerous and the climax is not for the faint\nhearted. There is a lot of blood and gore in this film.<br><br>Also, Favreau's interpretation of the story is a bit strange. He\nprojects the movie as sort of revenge drama between Shere Khan and\nMowgli. I never realised Jungle Book was a revenge story. Puzzling.<br><br>Watch it for the CGI and visuals.\n"},
{"review": "\nThis film tells the story of a boy who lives in the jungle, and is\nbrought up by wolves. One day, a fierce tiger comes to threaten his\nsafety, and he embarks on a journey in order to save his life. Along\nthe way, he makes friends with different animals, and together they all\nfight against the fierce tiger.<br><br>\"The Jungle Book\" is clearly targeted at younger children, as scenes\nare clean and dialogues are simple. I don't think there was even an\nadult in sight, which makes it reminiscent of \"The Nightmare Before\nChristmas\". The story is straightforward and simple, animals are all\nfriendly to each other, except the fierce tiger who is the big bully.\nAs I am way older than the target audience, I find it a little plain\nand not very captivating. Perhaps it is because I do not like talking\nanimals!\n"},
{"review": "\nThe movie may have shown a lot of similarities to the old cartoon,but\nit didn't show enough info or relationship with Mowgli and the wolves.\nSure they did the story good with Mowgli and Baloo's relationship,but\nwhat it also rushed through was the ending,and plus I didn't like it\nwhen Mowgli went to the man village. The fight with the tiger in the\ncartoon wasn't bad,but the movie just made it 10 times better. The 1967\none was classic,but the movie just made it into the best thrilling and\nemotional story that even I enjoyed. I mean yes I wouldn't really make\nreviews for kids movies,but the director was the man who made Iron man\nand I love marvel. So I checked out this movie,I watched it and I was\nlike \"oh my god...this was amazing.\" So it was just in my\nopinion,better than the original. The original is in my second place.\n"},
{"review": "\nI've never been a fan of the original Jungle Book movie, but I did grow\nup watching it, and I did like it. This remake is (in my opinion)\nDisney's best remake so far.<br><br>The animation and the scenery is basically a new age in CGI. Not only\nare there CGI characters and creatures now, but locations too. The\nentire jungle looks absolutely real, yet it's not, and that's the great\nthing about it.<br><br>The characters themselves were pretty cool. I didn't care for Mowgli in\nthe original movie, but this movie got me liking him. He's brave, not\nas bratty, and he's pretty inventive. Bagheera is as stern and careful\nas ever except that he's also got the action his book counterpart had\nhad. And I like Baloo's character here, having a bit more of a\nself-serving trait his older counterparts never had but eventually\nbecoming a nice guy. And that's the main characters. The wolves got\nmore screen time, Kaa got a lot more dangerous (though she doesn't have\nas much screen time, which is my only complaint in this movie), King\nLouie is more sinister and less comical, and Shere Khan is a flat-out\nbeast.<br><br>I'm also glad that they brought back three songs I enjoyed as a kid. I\nreally liked Bare Necessities, and I've also started singing this\nversion of I Wanna Be Like You. Trust In Me made me feel like Kaa was\nin a spy movie.<br><br>So on a scale from one to ten, I'd give it a perfect score: 10/10. It's\nan epic movie, and I highly recommend seeing this movie.\n"},
{"review": "\nThis movie will blow you away. Although it is 99% computer generated,\nit really is a stunningly beautiful movie. The reason I gave it 9/10\ninstead of 10/10 is because of this...I can't tell if it's based on the\nbook or the Disney Cartoon. The film works and flows beautifully but\nthe scene with King Louie would have worked so much better had he not\nsung 'I wanna be like you'. Why did that happen? No other part of the\nmovie was musical, apart from 'The Bear Necessities' but that was not\nsung in the same way, they sung it like they sing it every day, it's\nwhat they do. The movie would have been absoulte perfection without\nKing Louie's song. Mowgli was perfectly cast as the only living human\nin the movie. Bill Murray was perfect as Baloo, Shere kahn was totally\nmenacing and the computer effects on King Louie were total perfection.\nThis really is an amazing movie and I would urge anyone to watch it.\nDon't turn off the credits because Scarlett Johansson's version of\n'Trust In Me' is fantastic.\n"},
{"review": "\nMy wife and I watched this at home on DVD from our public library. In\nrecent years I have been growing tired of animated movies so I went in\nwithout much expectation.<br><br>The movie is done with a combination of reality, in shooting real\ncountryside, plus the actor who plays Mowgli. Then shooting on green\nscreen allowed them to put in the animation. It works really seamlessly\nand well.<br><br>Neel Sethi is Mowgli who was raised by wolves after his parents were\nkilled by a dangerous Tiger, Shere Kahn. As he grows it becomes time\nfor him to seek a human community, he no longer fits in with the\nanimals. But Kahn doesn't view his job as done until he also kills\nMowgli.<br><br>Great actors are voicing the animations. Bill Murray is Baloo, a bear\nthat befriends Mowgli and helps lead him to safety. Ben Kingsley is\nBagheera, the leopard that also helps protect Mowgli. The evil Tiger is\nIdris Elba as Shere Khan. And Scarlett Johansson is the very large\njungle snake Kaa. And finally Christopher Walken is just super as the\ngiant Orangutan living in ancient ruins, King Louie.<br><br>While this is not a musical per se, the characters voiced by Murray,\nJohansson, and Walken each have a song, and each actor sings their own\nsongs. I especially enjoyed Walken's vocal performance, both the acting\nand the singing.<br><br>Very enjoyable, somewhat better than I expected.\n"},
{"review": "\nArguably the best Disney Movie to come in years.Well its short , fast\npaced and simple story nothing complicated. Script ,Characters ,\nCinematography and The CGI effects are great. Its unusual that I\nenjoyed around 130 ,ins of CGI . The characters are human like and\nthat's what best.I felt at some point that few thing were kept out from\nfilm and some were forced in to make this a sequel potential. Still the\nstory's simple , effects and characters great.Visually stunning but not\nenough moving.I find very little for that adults than for the children\nbut we watch watch few movies that nothing but simple and this is one\nof them.I don't think that songs were required. Still Sethi is great\nbut I felt more for Baloo and Bagheera as they were the best ones. Sher\nKhan was a normal villain nothing else much great.All voices were\ncarefully chosen and were up to the point.No wonder is this film\ngarners a Best Picture Nomination at Academy awards. Finally it's a\npart of our childhood drawn out exceptionally well on the big screens\nthat we will love and cherish for its simplicity and loveliness\n"},
{"review": "\nThis seems to be one of those movies you either loved or hated, based\non what I read on the reviews. I liked it. It featured outstanding\nvisual effects and a great voice cast, including the great songs like\nThe Bare Necessities. My favorite scenes were where they were in King\nLouie's temple, the elephant scene, and the showdown scene with the\ntiger. Christopher Walken, Ben Kingsley, Bill Murray, and Idris Elba\nwere great in their parts. Whether you're familiar with the classic\nstory or new to it, you will enjoy this movie. I liked the kid as\nMowgli. Kids might like it more than adults though.<br><br>** 1/2 out of ****\n"},
{"review": "\nAnyone who was a Mogli fan back in 90's would not have given a second\nthought on whether to watch the movie or not. There were more of adults\nthan kids in IMAX and the directors left no stone unturned in\nfulfilling their dreams. The best part was the acting of this kid who\nplayed Mogli. Such a perfection in such a tender age is something not\neveryone's cup of tea. The VFX and animation was no doubt flawless and\nthe story of our loving Mogli has always been perfect. Though at times\nthe movie went boring but the adventure was revived every now and then.\nWatching it in 3d was an added bonus. Anyone who has ever been a Mogli\nfan must, for sure, watch this movie. I have now started finding better\nmovies through www.flickstree.com. It not only suggests great movies to\nwatch, it also tells where you can watch movie online.. Highly\nrecommended.\n"},
{"review": "\nThe Jungle Book<br><br>The worst part about being raised by wolves is listening to them brag\nabout all the fables that they're featured in.<br><br>Fortunately, they're only a fraction of the jungle beasts found in this\naction-adventure. <br><br>Forced to flee his wolf pack when the Bengal tiger (Idris Elba) that\nkilled his human father comes looking for man-cub meat, Mowgli (Neel\nSethi) must make it out on his own.<br><br>Along the way he encounters a menagerie of rainforest inhabitants (Ben\nKingsley, Bill Murray, Scarlett Johansson, Christopher Walken) who\neither want to help or hinder him on his journey of self-discovery, and\nin his epic showdown with his striped stalker.<br><br>Although this collected work of Rudyard Kipling stories has been\nadapted ad nauseam, this Jon Favreau directed version finally gets it\nright: eye-popping imagery, solid voice acting and a timeless\nnarrative. <br><br>Moreover, Mowgli will make a great human/animal ambassador for the\nforthcoming logging companies. <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nI must say I was amazed by this movie. To begin with I think they had\npreserved \"the history\" of it in a fantastic manner, not the least\nhaving Christopher Walken singing the much loved King Louie song. To\nhear him as King Louie was overall a fantastic experience. The rest of\nthe old songs were there too \u0096 equally well preserved with a loving\ntouch. And the story.. wow.. It was the old \"Jungle Book\" but still new\nand modern. <br><br>The Tiger \u0096 Shere Khan \u0096 was pure Evil. Amazingly well done! Bill\nMurray, Ben Kingsley did great voices, also. And of course Scarlett\nJohansson, who's voice I would not have minded hearing more of.<br><br>To say something on the negative side is that I could have done without\nthe \"cute\" animals, such as the wolf cubs and whatnot. I would have\nenjoyed this film even more if it was darker. And wasn't King Louie a\nbit oversized? He was bigger than the elephants =)\n"},
{"review": "\nThe movie really brought out the childhood memories of Mougli, Sher\nKhan and Bageera. Wish I could watch this in Hindi as I still remember\nthe dialogues and songs in Hindi.<br><br>The movie's visuals were spectacular and it was so real that it looked\nlike a human was living in the midst of Animal Planet. <br><br>Sher Khan is waiting to get hold of Mougli, kills Akela(wolf father)\nand how Mougli gets back his revenge is all the movie is about. Well we\nall know the story but it was real fun watching it in the big screen of\nthese favourite characters.<br><br>Though Mougli seems to be younger than television version, he's really\nenjoyable and fun. The missing element is the heroic Akela in the\ntelevision series while he is brought to death in the movie without a\nfight as well as the love for Mougli by his wolf father. I also wonder\nwhat happened to the Boomerang which Mougli possessed in the\ntelevisions series. It retained the original essence otherwise. The\nmovie has successfully brought the chemistry between Mougli, the ever\nguiding Bageera, friendly Baloo and most importantly the ferocious Sher\nKhan. Amazing scenes includes Sher Khan chasing Mougli and King Louie\nchasing Mougli etc.<br><br>90 minutes of movie was not enough for me and I would suggest go for it\nfor reliving the memories as well as the stunning visuals of human and\nanimals together.\n"},
{"review": "\nI was excited, but skeptical about this film. I love the jungle book,\nbut live action films have had a pretty poor past. This film came out\nand delivered! Everything about this film was gorgeous, from the CGI to\nhow the jungle looked, it was all great. The action in this movie was\nvery climatic and kept you on the edge of your seat the whole\nmovie.Mowgli's character played by Neel Sethi, is a little annoying at\ntimes, but in the grand scheme of things it's not that bad. The voice-\nover's in this movie are fantastic. Idris Elba as Shere Kahn was great,\nhe gave Kahn a very intimidating presence. Bill Murray gave us that fun\nand lazy Baloo that we all love. Scarlett Johansson as Kaa was good,\nbut she had a small part like Kaa in the original. In my opinion, Ben\nKingsley as Bagheera was the best voice-over in the whole film. He\nabsolutely nailed it and his voice-over felt just like the original\nfilm, which I loved. I thought this film would really remind me of how\nI felt, watching this as a kid. In some aspects it did, but this film\nwas actually pretty dark and mature. This film is very fast paced and\nhas a lot going on in it. Because of this, at times it felt like it was\ntrying to cram things in to the movie. Overall this film had a lot of\nthings going for it and is definitely worth your time.\n"},
{"review": "\nI won't lie when I say I went into this movie with such high\nexpectations. I loved the original Jungle Book movie and the trailers\nhad me really pumped up. The best part is that most of my expectations\nwere met. <br><br>The CGI was so beautifully done it slipped my mind that there weren't\nreal animals in that movie and that it was effects. All the voice\nacting did amazing, with Bill Murray making Baloo the bear we all love,\nBen Kingsley turning Bagheera into a fierce and fantastic panther, and\nIdris Elba turning the rather cocky and posh-like tiger into a true\nvillain that stands your hair on end. The plot, although slow to start,\nnot only takes elements from the 1967 original, but adds in new\nmaterial to prevent the movie from being a modern copy. Despite King\nLouie and Kaa's roles being dimmed down a bit, it's all for good\nreason.<br><br>There were few things that bothered me in the movie. For one, Bare\nNecessities was done very well and I couldn't stop smiling the entire\ntime, but King Louie singing I Want To Be Like You didn't fit with the\nmonkey that was portrayed in this film. Another was Baloo's and\nMowgli's relationship. It went from being reluctant to best friend so\nfast, I didn't have time to think. The bear almost took the kid\ninstantly, yet a few minutes earlier it seemed like he was just using\nhim This all fades away once we see how good they are for each other,\nand how much the bear cares for the kid.<br><br>All in all, this is an amazing remake, which is quite rare in the film\nbusiness, and it doesn't matter if you've read the book, seen the 1967\nanimated original, done both or neither. You will enjoy watching this\nmovie.\n"},
{"review": "\nI saw Jungle Book as a child 40 years ago and although I remember\nliking it I don't remember being as entertained as I was for this one.\nBrought my 10 year old son to this one. We both thoroughly enjoyed the\nfilm. The kid that played Mowgli was very well cast. A few scary\nmoments for kids 6 and under. Not a strong story but the\ncharacters..mainly Mowgli, Baloo the bear, and Bagheera the black\npanther were very likable. My only criticism is the same criticism I\nhave for most animated films...and that is, do we really need\ncelebrities as voices in EVERY single film? I just don't understand why\nthis is necessary. Maz Kanata and Gustavo Fring as a wolf and Peter\nVenkman as a bear? It really doesn't add anything to the film.\n"},
{"review": "\nThe first one you'll note is that of Sir Ben Kingsley. Even through the\namber eyes of the panther, you can easily imagine the bald face of Ben\nstaring at you. Neel Sethi (Mowgli) in just his second movie, As for\nthe performances, the ensemble vocal cast is at their A-game, with the\naddition of Christopher Walken as King Louie and Scarlett Johansson as\nKaa. these sorts of visual extravaganzas can let you down when it comes\nto the actual substance of the movie, but The Jungle Book excels in\nthat area too.<br><br>The movie has shown, and has always shown a very subtle politics,The\nkids in the auditorium seemed to love it as well. So, it's a must watch\nfor all Mowgli lovers\n"},
{"review": "\nThe Jungle Book is a marvel to behold. The special effects are\nwonderful and the animals look fantastic.<br><br>There are positives and negatives to the movie though: it will scare\nchildren - there is no doubt about that. It is more frightening to\nwatch someone that looks life-like in a battle over watching cartoon\ncharacters. The story is a bit boring at times and makes the movie feel\nlonger than it actually is.<br><br>Ben Kingsley is wonderful as Bagheera and he actually breathes more\nlife into the character than the original cartoon. Idris Elba is\nmenacing as Shere Khan and I felt that he made Khan more of a villain\nthan the cartoon had done. Christopher Walken just steals the show -\nhis King Louie has that same impact that was in the original movie.\nWalken was marvelous as Louie and his character was the best part of\nthe entire movie.<br><br>Neel Sethi was a bit wooden as Mowgli, but he is acceptable in the role\nand does not bring the movie down - he also is not interesting enough\nto make you care about his character as you should to have the full\nimpact. Bill Murray is alright as Baloo, but he misses the charm and\nfun that Phil Harris brought to the character. I felt that the movie\ndid not flesh Baloo out enough and allow his playfulness that made his\nso likable and unforgettable in the cartoon. Scarlet Johansson is\nwasted in the role of Kaa. Kaa (Sterling Holloway) had such a presence\nin the cartoon that this version missed. There was so much more that\nthey could have done with Kaa, but it felt like that part of the film\nwas either edited or rushed.<br><br>Overall it was a good film and entertaining to fans of the Jungle Book.\n"},
{"review": "\nSeriously this movie is all about bashing on Khan. Even Kaa doesn't\nseem to get this much attention. By the way, Kaa is cheap made and his\npart is uninspiring. Maybe he didn't had enough connections. He looks\nlike some cheap Chinese toy that you get from a store full with pink\nplastic toys that make noise.<br><br>Baloo. Argh, why did they scraped his character too? He is a central\ncharacter, but his fur looks ugly, his face is bland, and his amusing\ntemper from the book sounds here like a soaked chicken.<br><br>And.. the countdown arrives to Louie. Like what? Never seen this\ngigababoon before. What is he eating anyway? Maybe a couple of fellow\nchimps a day? Cause he's surely not on a Kellogs cornflakes diet. The\nthing is scary and his face looks as animated as a 15 plastic surgery\n50 years old model.<br><br>By the way, check out about going with 5 years old kids. There are 3-4\ndark, scary scenes, not much to do with the cartoons we all know.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"The Jungle Book\" (2016) is definitely the most visually stunning movie\ni've seen in a while, very long while. The story is simple yet good,\nscript is very good, but the true star of this movie was in its\ncraftsmanship. What a feast for the eyes! Can't believe it was shoot at\nthe studio, not in the jungle. Back in 2012 we were stunned by the\ntiger in \"Life of Pi\" - the jaw dropping creation of special effects\nteam. In \"The Jungle Book\" you will see the same level special effects\nin almost every scene - these animal are as stunningly real as it gets.\nThis is by far the best looking film of 2016. If this one won't win\nOscar for best special effects, where won't be justice. <br><br>Jon Favreau's direction is superb - at running time 1 h 40 min. this\nmovie never drags and is a joy for all its running time. Voice\nperformances were absolutely top notch by single everyone of them,\nespecially by Bill Murray who kills it as Baloo. <br><br>Overall, \"The Jungle Book\" is by far one of the best entertainments of\n2016 so far. So many disappointing big summer movies, but leave it to\nJon Favreau and special effects wizards to create something marvelous,\nwhat \"The Jungle Book\" truly is.\n"},
{"review": "\nThe Jungle Book is a live action adaptation based on the animation that\nwas made nearly five decades ago. Mowgli is a young boy who has been\nleft out in the jungle to fend for himself, As Shere Khan is on a\nvendetta to kill our self proclaimed hero. As Mowgli runs for his life\ntowards what he hopes will be his safe haven,treacherous obstacles\nawait him, including bears,chimps and snakes. After I witnessed this\nbreathtaking adventure, my prospective on nature will forever be\nchanged, although it is a fairy tale, Favreau's attention to details\nand his impeccable storytelling makes this a journey I won't soon\nforget. Finally, want to mention the voice cast was picked to\nperfection, I found myself stunned(the lack of a better term) by the\nrealism that was put into this film. With the help of his firm pen\nJustin Marks he proves that creativity isn't lost in Hollywood and that\nis all a director can hope for.\n"},
{"review": "\nDoesn't really matter if you walk in already seen the animated classic,\nyou are going to be entertained none the less.<br><br>Star wars success suggests that staying true to the original is going\nto bring you praise. But in this case the original was animated, and\nmeant primarily for younger audiences. If his this movie had to bring\nin the bucks and become popular with more age groups then it had to\ngrow on the original framework. This goal was achieved superbly.<br><br>The plot and the sequences are derived from the classic but are given a\nmuch grander feel. The concept of the red flower, the cycle of the dead\ntree, staying true to one self (tricks), the majestic elephants; hats\noff to the writers.<br><br>The casting for the voice overs is another success point. The\ncontribution to the character's personality by the voice was huge.\nEspecially with Bill Murray and Christopher Walken.<br><br>Another treat was the music. A great decision to use \"Bare Necessities\n\". I belong to the generation that grew up with this tune lodged\npermanently in my subconsciousness. When Baloo break's into this\nnumber, it brings back so many memories.<br><br>The special effects were spot on, so were the 3D effects.\n"},
{"review": "\nJon Favreau did an amazing job. I'll be honest I thought this movie was\ngoing to hell, telling myself, this movie was going to be boring.\nThankfully I was wrong on almost all accounts. <br><br>First of all, its animation is top notch; you practically forget that\nnot just the animals, but the entire environment itself was\ncomputer-generated. That is a milestone to be applauded itself.<br><br>Action sequences were intense and and there are many fun moments that\nwill induce laughter. The background music added a lot to the\nexperience of Mowgli's adventure.<br><br>Neel Seethi (the only live action character), did a great job, showing\nhis innocence, curiosity and energy that is expected of Mowgli,\nalthough at times it seems rather stiff. Its his first movie after all.\nKudos to the kid.<br><br>As for the voice actors, all were splendid. Idris Elba made Shere Khan\nvery menacing and real and will probably scare a couple of kids\n(parents beware). Nyong'o Lupita did a great job with Raksha. Ben\nKingsley and Bill Murray were awesome together, their characters\ncomplementing each other perfectly. I hoped for Kaa (voiced by Scarlett\nJohansson) and Akela (voiced by Giancarlo Esposito) to have more screen\ntime though. You'll feel like you really connect with all the\ncharacters. <br><br>One issue I had with the movie was the remake of the songs. Only the 2\nbest were used, which was understandable, but in my humble opinion, the\nmovie could have done without it. The songs were somewhat out of place\nand did not feel as right as it did in the animated classic of 1967.\nPerhaps it is due to the loss of the levity to make way for a slightly\nmore action packed flick. <br><br>All in all, it was a great movie and I'd encourage anyone to watch it.\nThank you Jon Favreau and his team for this (almost fully) animated\nmasterpiece. <br><br>9/10\n"},
{"review": "\nMy initial reaction was this trailer looks incredible, and after seeing\nthe film, I couldn't have been more impressed by what I saw, an\nadventure story with plenty of action, heart, and fun. The actors gave\nincredible vocal performances, and here was a world fashioned from\nscratch, using CGI to render creatures that look absolutely real, and\nwhen coupled with the fantastic acting by some of the best actors in\nthe world, we are in for a treat.<br><br>It's a children's story, so well written, developed, and acted, full of\nvisual wonders and terrific action pieces. There's great chemistry\nbetween the different characters, and all of actors involved cement\ntheir reputation as some of the best in the business, treating each\ncharacter with respect and giving them their best. The only \"real\"\nperformer is a surprise because he worked with green screens and other\ntechnology to create this piece, so along with Favreau and his team,\nthey have created a gem.<br><br>Also, the 3D in this film is breathtaking and doesn't feel like a\ngimmick.You will most likely be dodging an animal that appears to be\ncoming at you, but it's unexpected, and it feels natural. Some of the\nsettings are enhanced by the technology. Overall, I couldn't be having\na better time.<br><br>One final note is the outstanding work by Johansson as the malevolent\nserpent, another incredible performance by this talented actress. Stick\naround to hear her beautiful singing, another one of the unexpected\nsurprises in this film.<br><br>***** out *****\n"},
{"review": "\nI have almost no reviews of movies, but this movie warrants. It is the\nbest animated films I've seen, so wonderful. Also mixes a spectacular\nwork with puppets. One of the things that I celebrate to Disney, is\nthat not modify or adapt the stories. Practically the recounts as they\nare. The work of John Favreau in the overall direction is fabulous, and\nthe art direction, sure to be nominated for an Oscar. It is a film that\nwill teach many things to our small people, it that can be enjoyed with\nfamily and deserves our attention and recognition. Bill Murray's work\ndeserves a separate review.Tthe cast is lovely, nothing could be\nbetter. but I think the child Neel Sethi steals the movie with his\nperformance, it's really great. Whereas practically acts only with CGI\ncharacters or puppets. You must see it, with the family.\n"},
{"review": "\nI normally am not a fan of CGI, mainly because it can be overdone and\nrushed; however, this was done perfectly. The character that plays\nMowglie did an outstanding job considering he is the only physical\nperson on the set having to act around imaginative characters and\nscenery. Acting, directing, cinematography and writing were all superb.\nIf I were to have one criticism, it was the one song that was played in\nthe movie. I won't say what it was but it just kind of out of place and\nfelt a little off putting when I watched the movie. But that's a very\nsmall negative point that is overshadowed by an overall well done film.\nI will piggy back off my first sentence of this review, the CGI looks\nreal.\n"},
{"review": "\nSo, generally it's an entertaining movie with cool looking animals and\nscenarios. Watching Baloo sing \"Bare necessities\" again was pretty\ncool.<br><br>Now, I'm giving it a 6 because of the animals. Some animals look quite\nrealistic, but some other don't. Why would they do that? Baloo doesn't\nlook like a realistic bear at all, not saying that's bad, he looks\npretty cool actually and has good acting. On the other side we have\nBagheera and Shere Khan, now those two look realistic and without any\nsort of personality, the only good thing about them are the voices. But\nthey look terrible next to Baloo. <br><br>Then we have some other characters like Raksha and Gray that look\ngood-ish, not as good as Baloo, not as bad as Bagheera. And other\nsecondary characters that look well. Then we have King Louie, they\nchanged this character completely from the original one, that's not\nnecessarily a bad thing. But he looks like a really huge though and\nangry animal that somehow starts to sing a happy song for a very short\nperiod of time, it's simply weird. The way he acts doesn't make a lot\nof sense.<br><br>And the elephants... they are simply elephants. Not a single thing is\ninteresting about them.<br><br>Now, the problem with this is that some animals look very realistic,\nothers don't, the ones that don't look that realistic look way better\nand are great to watch. It's a pretty terrible contrast in my opinion.\n"},
{"review": "\nMy mother had taken me to see the Jungle Book, when I was a small\nchild. We saw it in a drive in theater and especially the snake \"Kaa\"\nhypnotized me in the dark night. And of course, Balou the bear. Later\nwe got lost in one of these medieval round villages on the way home.\nWatching a Disney premiere at the \"El Capitan Theatre\" on the Hollywood\nWalk of Fame is so much fun, especially with the Organ Music. Neel\nSethi does an amazing job, what a charming Actor he already is.\nChristopher Walken does his \"Thing\" beautifully as always, one expects\nFat Boy Slim to come up any moment. Bill Murray is the perfect Balou,\nif you ask me. Love the live Action and Music in the Film, some of it\nreminds of the \"English Patient\". I have been a fan of Jon Favreau\nsince \"Swingers\" and Jon did a magical job with this piece. Favreau\ndelivers more than than \"The Bare Necessities\". If you happen to be in\nCannes this year, please check out the \"Lost Dutchman\". If you like\nbreathtaking vistas.\n"},
{"review": "\nThis movie stinks. Scares the hell out of kids. Characters are way too\nscary for little ones. And its just no way near the fun the original\nwas. Awful singing by Christopher Walken, mediocre acting at best or I\nguess voice over. Just lousy. Maybe some adults who have never seen the\noriginal may care for this, but OMG this is just trash. The Director\nhas no idea what a Disney movie is. Disney is rolling over in his grave\nafter this one was released. Again, if you have kids under 10, they\nwill be scared the way the characters are portrayed. Don't waster your\ntime or dollars. Disney is now relying or remakes of classics that are\nall garbage to make money. Just buy the original ones when the movies\nwere good.\n"},
{"review": "\nI read almost everything (Joseph) Rudyard Kipling wrote. Part when I\nwas a kid, part when I was fully grown. And since I heartily despise\npolitics whereas I really love talent, I always hugely admired him.<br><br>'The Jungle Book' is one of the greatest books he wrote: truly\noriginal, inspiring and uplifting, it's the perfect tale for any young\nman.<br><br>But he didn't have music. He didn't have sound, colors, (motion)\npictures or speaking voices. All kind of stuff that our brain can come\nup with while we read, but only in a rudimental way. Things thanks to\nwhich Jon Favreau and Justin Marks (and their indisputable talent) were\nable to make this movie: best 'Jungle Book's' version ever. Better than\nthe book.\n"},
{"review": "\nFavreau's Jungle Book is a marvel. With a Spielbergian sense of magical\nawe and reverent fear, it's a children's epic that not only stands-up\nto its legacy, but surpasses it. Giant snakeskins, intense animal\nbattles, and daring escapes from ape kingdoms give the film a scope\nbeyond the animated musical, all while keeping intact its persistent\njoy. Funny, jaw-dropping, thrilling, grand, and fun, it's an\nall-cylinders-go cinematic experience on every level. The story of a\nyoung man-cub raised by wolves and living amongst the animals of the\njungle hasn't changed much, down to the talking beasts. Much like last\nyear's Cinderella, they utilize nostalgia of the beloved product to\ndive deeper into the story without cynically dismissing it. On top of\nimmersing us into the wilderness through meticulous attention to the\nsmallest of details, the characters are drawn with much more depth. The\nbratty and paper-thin Mowgli of yesteryear is replaced by a boy with\nbrains and motivation. Played with wide-eyed confidence by newcomer\nSethi, we emotionally engage with his adventure. And he's not alone;\nall characters are given loving attention, specifically the foreboding\npresence of scary-cool bruiser Sheer Khan. The technical feat of\ncreating photo-realistic animals that convincingly speak and emote is\nso impressive it feels like a benchmark in CGI. It wouldn't be an\noverstatement to say this is as groundbreaking and beautiful as any\nvisual effects in years. Favreau and co. manage intense attention to\naccuracy without shoving it down our throats or overshadowing the\nstory. At the end of the day, under all the computer data, there is a\nsoulful and entertaining tale about life's bare necessity:\nindividuality within community.\n"},
{"review": "\nIf you're a child of the 90s then you will definitely adore this film.\nI strongly urge you to go see it in IMAX 3D to receive the ultimate\nexperience of being transported deep into the Indian jungle.\nAesthetically pleasing and phenomenal CGI work, you'll enjoy the\nclassic book and Disney movie come to life. <br><br>The plot merges the jungle book stories with the Disney classic and\ndelivers a fantastic adaption. I don't know where they found Neel Sethi\nbut his portrayal of Mowgli was outstanding. They cast the characters\nbeautifully and I really couldn't get over how real the animals looked,\nall the details that went in to every paw and claw and piece of fur\nbeing blown by the wind. The music is great and I enjoyed that they\nincluded some original songs. <br><br>A heart-warming portrayal of the relationship between man and beast,\nthis movie is a gem destined to be treasured by all for years to come!\n"},
{"review": "\nJust got back from taking my 3 year old to this, she absolutely loved\nit, mesmerised by the scenery and the talking animals which are\nincredibility photo realistic. From her point of view it was a pretty\ngreat film.<br><br>However she's also a fan of the original animated version of the film,\nas am I and I am sad to say the new version although great with live\naction is sort of a disappointment.<br><br>It's like they try to make it a little truer to the original story at\nthe expense of the light-heartedness of the original. It doesn't quite\nwork as well as it should. They took King Louie and made him into an\nintimidating monster which is a shame because his character in the\ncartoon was one of the best.<br><br>Hats off to Jon Faverau for giving it a shot and not completely messing\nit up which would have been easy to do; maybe the Disney committee got\nin the way and skewed it the wrong way slightly.\n"},
{"review": "\nUsually, live action remakes of animated movies or TV shows are total\nletdowns. Not this one. It was so good I didn't want it to end! The boy\nwho played Mowgli had a truckload of talent for one so young. And the\nactors who voiced the animals performed well, too.<br><br>I was able to keep my eyes on the screen from beginning to end. The\nvisuals were stunning.<br><br>Best of all, I saw it at an IMAX theater. Can't beat that.<br><br>Adults and kids will love it.<br><br>I was almost tempted to head across town, and see it again later today\nat another theater.<br><br>I seriously doubt there'll be a better movie this year.<br><br>In fact, if it were humanly possibly, I'd give it two toes up, as well\nas two thumbs.<br><br>Great film all the way.<br><br>So I recommend it highly.\n"},
{"review": "\nThe Jungle Book was something I could not wait to see. The trailer was\ngreat, the movie is not exactly a bad movie, it passes, it just didn't\nseem to have the same aura as it's name provides. <br><br>The cast did a great job with the voice over &amp; the animation was quite\ngood. The story was well different and pretty average. I was actually\nsurprised as a kids film it seemed more M rated then any other Disney\nfilm so if you have children some scenes are quite scary. As I say not\na bad movie but not a great movie either. <br><br>I'm looking forward to Zootopia, hoping Disney came out of the blocks\nand gave us something better with that.<br><br>Won't be revisiting this one unless the kids pull it out in future.\n"},
{"review": "\nIf we're judging CGI, this is a 10 for 10 movie. The animals are just\ngreat and I'll go further to say the bear is even better. So an 11 for\nthe bear - at least. I also give the actor credit for playing what I\nsuppose was mostly against green screens so he spent a good deal of the\ntime talking to himself. <br><br>The movie falls apart for me as a story. Yes, the tiger is beyond scary\neven knowing it's a cartoon tiger and the other animals are as you'd\nexpect them to be - good or bad as their species dictates in our\nculture. <br><br>The issue I had is with the relationship between the animals and the\nhuman. Time and time again the animals risk themselves to help the boy\nand for the life of me, I can't see why other than some sort of Kipling\nera species centric view of animals existing to serve the needs of\nhumans. Worse, the human is unpleasant, petulant and loud. <br><br>Were I any of the animals, I'd have dropped him on his head at his\nfirst whiny outbreak but they stick and due to that, I felt the story\nline was quite poor. So while I admired and enjoyed the tech aspects of\nthe flick, the movie itself flopped for me.\n"},
{"review": "\nThe 1967 film was vastly different from Kipling's original work and so\nis this one. So let us leave the story-line out of it.<br><br>Lemme say that I am a huge fan of the old movie. I watch it again and\nagain with my little girl. We sing along with Baloo, Col. Hathi and\nKing Louie. That movie is all fun.<br><br>Now in 2016 they have made a marvelous piece of visual experience. And\nthey have taken out all the fun and innocent childishness out of the\nmovie. The movie is OK for a grown up, or even a teen. But for god's\nsake, the makers have made sure that a kid won't enjoy it.<br><br>It's sad. Really sad.<br><br>The Jungle book is one of those stories which will mesmerize kids when\nyou put them to sleep. It gives them a world so vibrant and indulging,\nthat the visuals take place in their mind while they listen. The\nvisuals this movie present to the kids will twist their imagined world\nof Mowgli into something beyond recognition.<br><br>Go, see the movie. It's not bad. But prepare the kids for something\nthey might not enjoy, if they know the story of Mowgli beforehand.\n"},
{"review": "\nMy father read the books to me as a child, I read them again and again\nover the years and I've read them to my own children. You could say I'm\na fan. But of course I also love the original Disney version which is\nprobably still my favourite classically animated film. Now we got an\nunbelievably realistically rendered CG version which kind of wants to\nbe like the animated film - or at least exploit its most beloved\nmoments - but also wants to be really impressive. It feels wrong the\nmoment the \"real\" animals start to talk. (I should note that I saw the\ndubbed German version; I'm pretty sure the original voice cast is much\nbetter but that won't make the fundamental flaws disappear.) The\nanimals look and move incredibly real but they talk like humans. The\nvoices convey human emotions but because of the attempted realism we\ngot no matching facial expressions. The animation doesn't want to\nanthropomorph but the voices (and the script) do. More: Despite being\nsuch a visual film the narrative is done mostly by dialogue. And the\ndialogue isn't written very well. It doesn't have the light, witty tone\nof the Disney classic (when attempted it fails because of the reasons\nmentioned above) and it doesn't live up to the deep (but earned) pathos\nof Kipling. It's just so-so - a typical Hollywood script that doesn't\ntake any chances but throws in a Balu who talks like a \"cool dad\",\nbecause...? And what was this terrible, terrible version of King Louie?\nToo big, too scary but then... SINGING? This would have been an awesome\nfilm if they had let go of the Disney version as a blueprint and made a\nserious adventure film after the books with a lot less talking and a\nlot more showing. (And please finally the real Kaa, Mowgli's wise\nfriend who is probably the most awesome character of the books...) But\nof course this is Disney. They got the money, they got the tools but\nthey also gotta do the family version.\n"},
{"review": "\nThis movie got High Rating by critics, a lots of them put it as number\none in 2016 (https://www.rottentomatoes.com/m/the_jungle_book_2016) so\nI expected nothing but perfect, Unfortunately it was disappointing. <br><br>At first, the voices did not fit with the movement of the characters,\nexcept Bill Mary as Baloo. <br><br>The CGI was good, but it was too much , throughout the film It did not\nfelt that i am in the Jungle , it was like i am inside a computer game,\nnothing naturally was there except the child. <br><br>Then, we have the kid Neel Sethi who Was Terrible, no feelings, no a\nspirit of Mowgli, the kid was lost between the computer graphics. <br><br>And The story, I expected it more depth , something new , Unfortunately\nthere was no any addition at all, in fact it was more short version of\nthe story. <br><br>I did not feel the spirit of Mowgli (fun and smart kid), I did not feel\nthe crazy jungle, no atmosphere of this beautiful story, just A LOTS of\nComputer-generated imagery (CGI).\n"},
{"review": "\nTake a look into the life of Mowgli - Raised by wolves - friends with a\nPanther - When evil takes the form of Sher Khan (A tiger) - Mowgli is\nforced to escape the forest and go back with \"His kind\". With an\namazing voice over cast - and some singing surprises - Never have you\nseen a version of this movie more enjoyable and surprising - With\nplenty of action and amazing CGI - this movie will bring out the Bare\nNecessities in you - Take a walk down memory lane with all of the\ncharacters from the original - and then you will be rushing to IMDb to\ngive it 10/10 stars - Even if you don't love the story of the Jungle\nBook - this movie can enchant the smallest heart.\n"},
{"review": "\nJust awful...<br><br>This joyless stinker is an abomination.<br><br>Annoying American schoolboy speaking annoying schoolboy slang in the\njungle? Give me a break. Yeah, he's a kid but his range just about\nreaches Kevin Costner heights! They should have used real animals and\ncomputerized the annoying child.<br><br>The CGI animals simply look freakish and absurd. The story makes no\nsense and keeps changing direction. The 'A' list talent end up looking\nstupid or lazy and some of them manage both!<br><br>I don't imagine anyone with an IQ over about 80 is gonna stay awake\nlong enough to see this through to the end. I managed about 30 minutes\nbefore I got so annoyed I had to pause it. It never got better!<br><br>Get the cartoon version. It's fantastic and won't ever be beaten. This\ninsulting pile of poo won't ever be remembered for anything of value.\n"},
{"review": "\nI previewed this to see whether it was suitable for our 5-year-old\ngrandson Henry. Answer: no way. Too scary. Otherwise, critics have been\npointing, rightly, to truly superb computer graphics, and praising it\nfor improving on the many earlier versions. Not having seen the others,\nI can't comment. I can comment to the extent of saying that this\nversion is very good 'of its kind.' By that I mean the kind that takes\na classic and subjects it to all of the latest gadgetry; replaces all\nof the original language with hipper, up-to- date dialogue; adds\n'catchy' songs; and takes many liberties with the original. Yes, it\ndoes all that very well, and that's the problem. In short, there's\nhardly any Kipling here. Kipling is one of the greatest storytellers in\nthe English language, and he appeals powerfully to the imagination.\nHollywood's version just smacks you in the face with all its glitz and\nglitter, plus a couple of awful songs. It appears that the producers\nnever quite made up their minds about whether this was to be a musical\nversion or not. As a result, the crummy songs come jarringly out of\nnowhere.\n"},
{"review": "\nI am both an enthusiast of the 1967 Disney animated Jungle Book and\nRudyard Kipling's novel. Upon viewing this new rendition of this movie,\nI was not impressed. I was very much hoping it would be closer to\nKipling's Jungle Book (the source material)with perhaps a few nostalgic\nnods to the 1967 animated film. While I did see hints of Kipling's dark\nand intricate story line, they were glimpses-nods at best that were\nplaced at odds parts of the story and/or entirely upside down. The\nAkela death scene, scene with Mowgli carrying the torch, the cattle\nstamped scene, (all important story arks) etc are examples of attempts\nto remain close to the source material, but Disney choose to to distort\nthese major scenes to fit better with their new take on it for this\ngeneration. Doing so killed the potential in this movie as it was\nsoften and dulled and severally lacking entertainment other than\nvisuals &amp; the two beloved songs that made the cut.\n"},
{"review": "\nI doubt I'll ever watch or even remember this movie again because of\nits lack of emotion/depth/creativity. Really it leaves us with nothing\nat the end, not even a little bit of warmth. Terrible story line that\nhad me only focus on how beautiful the forest was looking since it\nfailed to deliver neither laughter nor message. Not a single moment of\n\"oh I'm glad I'm watching this movie\". It was more like \"I just hope\nthe next part will be good\" through out the whole movie. <br><br>First the acting from main character was so bad he had a same type of\nface expression every scene. Even the voices from other animals were\ncompletely emotionless I could not relate to any of the character's\nfeelings. <br><br>Second there was nothing new or unseen in this new jungle book. I did\nnot mind the slightly different story line from the original since I\nwas expecting something more innovative from the start. However, It was\nthe same old \"man stuck in a jungle\" type of story that anyone could\ncome up with, I feel like the popularity it is able to gain right now\nis fully due to its graphics. <br><br>Most of the movies that do not have a very good plot at least give me a\nfew chuckles on their way. This movie even failed to do that, which is\nwhy I felt scammed by the current reviews out here and bothered to\nactually create an account, make an honest review.\n"},
{"review": "\nThe Jungle Book is still achieving record highs in International movie\nbox office. Disney is truly the best children movie company in the\nwhole world.<br><br>Mogwli is a Little Indian boy living in the Jungle . He has been grown\nup by wild, but friendly animals who have been taking great care of\nhim.<br><br>Mogwli is innocent and yet smart. He decided one day to leave the kind\nanimals who have done him a favor and suddenly decides to say goodbye\nto the jungle animals in search of his own identity.<br><br>Will he succeed in his mission or fail?. The answer is clearly revealed\nat the end of this remarkable Disney movie.<br><br>The Jungle movie is a film that will really captivate you in every\nmagical Disney way from the beginning till the end.\n"},
{"review": "\nDirected by Jon Favreau (Iron Man), based on Rudyard Kipling's timeless\nstories and inspired by Disney's classic animated film, The Jungle Book\nis an all-new live-action epic adventure about Mowgli (newcomer Neel\nSethi), a man-cub who's been raised by a family of wolves. But Mowgli\nfinds he is no longer welcome in the jungle when fearsome tiger Shere\nKhan (voice of Idris Elba), who bears the scars of Man, promises to\neliminate what he sees as a threat. Urged to abandon the only home he's\never known, Mowgli embarks on a captivating journey of self-discovery,\nguided by panther-turned-stern mentor Bagheera (voice of Ben Kingsley),\nand the free-spirited bear Baloo (voice of Bill Murray). Along the way,\nMowgli encounters jungle creatures who don't exactly have his best\ninterests at heart, including Kaa (voice of Scarlett Johansson), a\npython whose seductive voice and gaze hypnotizes the man-cub, and the\nsmooth-talking King Louie (voice of Christopher Walken), who tries to\ncoerce Mowgli into giving up the secret to the elusive and deadly red\nflower: fire.<br><br>This is a terrific must see movie. No wonder it has been achieving\nunprecedented massive success everywhere.\n"},
{"review": "\nYou must have heard it by now. The movie was shot entirely in a\nwarehouse in LA. And it boggles the mind every time I saw a wide\npanning shot of the jungle. Reminiscent of the kind of the Special\neffects that produced the sweeping vistas of Pandora in Avatar. But\nmuch like Avatar, Jungle book is lacking in almost every other\ndepartment. After hearing rave reviews about the lead actor, I had high\nhopes since the movie hinges on this one performance. He's OK. Bill\nMurray as Baloo was one of the bright spots. He has the funniest\nmoments and is truly every bit the bear from the original cartoon\nmovie. Idris Elba's turn as Shere Khan is a revelation. A very\nterrifying villain, his voice commands your attention. The story\nhowever, nothing much new. It hops from one nostalgic moment to the\nnext executed with some odd creative choices. Some of the dialogue was\nuninspired and pacing was a bit off. A live action version should have\nenabled them to explore some of the other characters in more depth but\nhere they have as many dimensions as they had in the cartoon movie or\nworse. At least the cartoon was more entertaining with it's dance\nnumbers and colorful characters. The way this one ended it was clearly\nleaving it open for a sequel. I would have preferred a solid ending\nwhich wrapped everything up neatly. This movie was clearly made for\nkids. The trailer gave me the impression we would get something more\ncomplex and mature. I was wrong. Warner Brothers also has it's live\naction Jungle Book movie coming out albeit 2 years away. Andy Serkis's\nJungle Book movie may deliver after all.\n"},
{"review": "\nMowgli is a man-cub found in the jungle by black panther Bagheera (Ben\nKingsley), and raised by Raksha and the wolf pack. During the dry\nseason, peace is declared but tiger Shere Khan (Idris Elba) threatens\nthe pack for protecting Mowgli. Mowgli decides to leave and Bagheera\ndirects him to the man-village. Shere Khan is angered by his escape and\nkills pack leader Akela. Lazy bear Baloo (Bill Murray) rescues him from\nKaa the python. They harvest honey. There's also giant orangutan King\nLouie (Christopher Walken) who wants Mowgli to give him fire.<br><br>The visual effects are amazing. This is as close to reality as these\nCGI have done so far. The animals are all visually compelling. The kid\ndoes well. There are three especially great voice work. Elba is\nthreatening and Kingsley has gravitas. The surprising standout is Bill\nMurray. It's undeniably his voice and his character fits his comic\nsensibilities. The story works well although King Louie feels\nextraneous. By that point, I'm waiting for Mowgli to take on Shere\nKhan. The comedic break with Baloo is great but after Akela's death is\nrevealed to Mowgli, the movie needs to push on with the confrontation\nwith Shere Khan.\n"},
{"review": "\nDisney's remake of their take of the Rudyard Kipling books (which they\ndid for the first time in the 1960s) was a big hit at the box office.\nTo a degree I can see why - the locations are colorful and attractive\nto the eye, the special effects are first rate, and there are a few\ngood action sequences. Yet despite stuff like this to be found in the\nmovie, I thought the overall package was unsatisfying. To be truthful,\nit was hard for me to pin down what went wrong here, in part because\nthe movie isn't really awful. I think it's a bunch of little things.\nOne mistake the filmmakers made that's evident in the original movie is\nthat for the longest time in the middle of the movie, you don't really\nfeel much of a threat to the young protagonist - the movie almost\nforgets the threat. Another problem I found was the sometimes juvenile\ntone. While the original movie had that, it was a hand drawn animated\nmovie, so you could accept the goofiness. This live action remake,\nthough containing computer generated animation, looks \"real\", so it's\nhard to accept the goofiness at times. A third problem is that the\nmovie lazily takes chunks of the original movie (like the songs) and\ndoesn't do enough to put their own spin on the material. As I said, the\nmovie is not awful, and I admit that kids will almost certainly enjoy\nit a lot. But adults with pleasant memories of the original movie may\nfind the same problems that I did.\n"},
{"review": "\nMost movie remakes are never as good as the original, yet the Jungle\nBook, not only manages to include much of the animated movie with\namazing special effects and CGi, but also puts its own spin on the\nclassic. With the newly revised ending, an important lesson can be\nlearned between all of the action and thrills of the movie. Mowgli the\n\"man cub\" is a young boy who was raised in the wolf pack by Bagheera is\nliving peacefully in the jungle. However, after Shere Khan arrives and\nthreatens to kill him, he is forced to adventure through the jungle.\nAlong the way, he meets many new friends like Baloo the bear, but also\nencounters challenges like Kaa the hypnotic snake. In the end, Mowlgi\nrealizes that his place isn't with mankind but in the jungle with all\nof his friends. Although a fictional story about a boy trying to find\nout where he belongs in the forest, The Jungle Book teaches viewers\nthat family isn't always blood related.<br><br>Many of the animals are wary of a \"man cub\" in the forest and feel that\nMowgli does not belong in the jungle. Shere Khan, a human hating tiger\nwho was burned by fire, says, \"A man cub becomes a man, and man is\nforbidden.\" Exemplifying the feelings of mankind being banned in the\njungle. Due to this and the fact that Shere Khan has threatened to kill\nhis family the wolves, Mowgli feels that he should set out to find\nhuman civilization, which he thinks is where he truly belongs. Yet,\nwhen he gets to the village, with the help of a few of his friends, he\nrealizes that he doesn't belong in civilization as he is more suited in\nthe wilderness of the jungle. During his final showdown with Shere\nKhan, Mowgli says, \"But this is my home.\" Showing that he has realized\nthat the jungle is his home and the wolves are his family, even if he\nmay not be a wolf physically, he is a wolf in soul. Thus teaching the\naudience that family is not always blood and is why you should watch\nthis movie.\n"},
{"review": "\nThis is a remarkable movie. Jon Favreau is one of my favourite\nactor/directors in Hollywood at this time. This film really is an\nanimated film with only one live actor in which the technology of CGI\nand motion capture have been used to its ultimate best. The blue ray\nincludes some of the massive effort that went into this film and it may\nbe some time before we see something yet again as good as this. My only\ncriticisms of it is the 3D which was under utilized and unnecessary.\nThe music and songs that were worked in worked very well but the melody\nwas at times lost during the singers performances that were selected.\nChristopher Walken was a great King Louie,Bill Murray very recognizable\nas Baloo the bear and Scarlett Johansson an excellent choice for Kaa\nthe snake. May take best animated film come Oscar time if allowed in\nthat category.\n"},
{"review": "\nFirst off let me say that I am a big fan of the book and of the\noriginal cartoon as well. That being said, this movie was not bad, nor\nwas it really that good, It was just OK. The CGI was amazing to say the\nleast, and the animals and cinematography were great, but there were\nmany scenes and crucial characters that fell short of their potential,\nespecially Baloo. He did not add his carefree element that made him so\nfun loving in the cartoon, and the new version of my favorite song \"The\nBare Necessities\" was a hard pill to swallow. I'd rather they left it\nout all together. Baghera was well played as was Shere Khan and King\nLouis, but a few minor characters like Kaa, and Raksha could have been\nbetter. Overall it was worth seeing at least once, my kids loved it,\nbut I would not go see it again and will probably not buy it.\n"},
{"review": "\nI assume (probably incorrectly) that everybody knows the story of\nlittle Mowgli lost in the jungle and raised by wolves.<br><br>Like most people my age I grew up on the Disney cartoon my dad even had\nthe sound track on vinyl.<br><br>I wasn't looking forward to this as I can do without another remake in\nmy life.<br><br>This film is very different to the animation. It is grittier, more\ndramatic and has much, much more action.<br><br>I was surprised at how the director had picked up the material and\nsprinted off wit it and created a very capable adventure movie.<br><br>The only problem I have with this film is self inflicted. The ghost of\nthe animated version still lurks in the background. <br><br>With Jungle Book on the cover I was expecting to hear \"King of the\nSwingers\" etc. So some of the old songs have been begrudgingly squeezed\nin. These songs- that I grew up loving - jarred with the rest of the\nfilm and ruined the scenes they are injected in to.<br><br>A very good film, stands on its own. Only distantly related to the\nanimation so watch it with a clear slate - if you can.\n"},
{"review": "\nMowgli (Neel Sethi) having been raised by wolves must now go to the Man\nVillage and live out his life there because the Jungle is now too\ndangerous for him. The Tiger Shere Khan (Idiris Elba) vows to kill\nMowgli. The Panther Bagheera (Ben Kingsley) and the Bear Baloo (Bill\nMurray) accompany Mowgli on his journey. <br><br>I had seen the original Jungle Book back in the day when it was all an\nanimated cartoon and that was a great show with Phil Harris as the\nvoice of Balloo. Now with CGI technology it has become even better. How\nthey did this is unbelievable as they have a human, Neel Sethi,\ninteracting seamlessly with animated cartoon animals and this is simply\nmagical. I cannot explain it any other way. It was more than\nexceptional. Kudos. <br><br>Mowgli has a few adventures on his way to the Man Village and we see\nhim almost come under a hypnotic spell by the woman Python snake Kaa\n(Scarlett Johansson), being stung by bees to help Baloo get his honey,\nhelping a small elephant get out of a hole, and being captured by\nmonkeys who bring him to King Louie (Christopher Walken) a massive\norangutan who wants to rule the jungle with him. <br><br>To be sure there is a confrontation between Mowgli and Shere Khan near\nthe end. (Whaaaat? Isn't this a mismatch?)<br><br>Bill Murray as Baloo was very good, but most Kudos must go to\nChristopher Walken as King Louie. Both sang songs that were real toe\ntappers, but Walken is the clear winner. When the credits roll we hear\nWalken again singing. Simply great. <br><br>Other notable Voices: Mogli's wolf mother Raksha: Lupita Nyong'o; Wolf\nleader Akela: Giancario Esposito; Ikki, a wolf cub: Gary Shandling. <br><br>Parents should be warned that very small children may be frightened by\nthe animal battles as they are fierce. <br><br>All in all a very enjoyable movie. Great job on this updated version.\n(10/10)<br><br>Violence: Yes: Sex: No. Nudity: No. Language: No.\n"},
{"review": "\nDisney's original jungle book, is by far my favourite of all the Disney\nfilms. And this new \"live action\" version is a loving tribute to that\nmovie. As with all the recent Disney live action remakes, each would be\nnothing with out the animated original. As such they all behave as\ncompanion pieces, or tributes. There are some great moments in this.\nThe great nods to the original. Great nerdy film<br><br>Jokes.<br><br>But what it lacks is heart. There are moments in the original that\nstill pull on my heart strings. And this one just didn't quite make it.<br><br>Lovely film. But not as great as it's animated fore bearer.\n"},
{"review": "\nThe Jungle Book was excellent! I worked with a musician/producer named\nPaul Sabu who is the son of the original actor and character, Sabu, who\nplayed the boy in the original version of the Jungle Book story. The\noriginal version was made in 1942. The new version and story is\nbeautiful and fun. The effects are spectacular. The plot is fabulous.\nThe animal characters are absolutely charming. This is a great film for\nboth children and adults and for anyone in between. Teens would\nprobably enjoy the film immensely. Leave your problems behind, buy some\npopcorn, a soda, bring your favorite person or people and expect\nsomething great! I guarantee you. Not a good film to make out in,\nbecause the film is too good to miss!\n"},
{"review": "\nI sat and watched this with my husband and two young children. It's\ncertainly not a too young audience film. With more of a dark twist on\nJungle Book I was shockingly surprised. The cast portrayed the\ncharacters superbly and Idris Elba plays the best role in the entire\nfilm. Not being one to stray too far from originals, I felt a little\ndisappointed at the length of time some characters appear for. It was\nmore like a Casting Call audition role to me. Other than that I can't\nfault the film. Fantastically written and greatly portrayed with fab\ncgi effects! Very rarely could you tell that the majority of the film\nwas cgi. All in all I was thoroughly impressed with the film and will\ndefinitively be watching it again and again.\n"},
{"review": "\nWell the 1967 Disney cartoon film was,and still is, up there with the\nfilm classics - how could anyone NOT enjoy this thoroughly enjoyable\nfilm for all ages with the catchy songs which we can all still remember\nthe lyrics of 40+ years down the line! So Disney brings out a new 2016\nversion, and so what's not to like about this one too? For me, the\nscenery and action were great; my knowledge isn't good enough to\ncomment on the shortfalls of the high tech animation and special\neffects but it looked good to me. Bill Murray's Baloo was excellent and\nBen Kingsley's Bagheera and Scarlett Johansson's Kaa were great too. I\nhad to look up the cast list to figure out whose voice was King Louie's\nand when I found out it was Christopher Walken - was I pleasantly\nsurprised - his voice was fantastic for the role. My main critic would\nbe that the dialogue, unlike the original cartoon version, had a\ndefinite American twist to it, although there's nothing wrong with\nthat, but.... So the bottom line is, it's difficult not to compare the\nnew film with the original 1967 version but DON'T or you'll lose out.\nBoth versions have their merits, so enjoy both - I know I did.\n"},
{"review": "\nThe Jungle Book already called the attention by the great actors who do\nvoice work of the characters, Bill Murray (Baloo), Idris Elba (Shere\nKhan), Scarlett Johansson (Kaa), Christopher Walken (King Louie),\nLupita Nyong'o (Rakcha), are excellent actors all do an amazing job,\nNeel Sethi is the only actor in the film that makes a human character,\nand he convinces as Mowgli, has future the young actor, the direction\nis Jon Favreau (Iron Man 1 and 2) its direction is good, the picture is\nexcellent, all done in CGI, the film's CGI is spectacular, the animals\nare very well done, the soundtrack is good, the script is a bit\nproblematic, has very weak dialogues and unnecessary, the pace of the\nfilm is good, the movie is not long, it is even too short, it hurts a\nbit the script, should have about 15 more minutes to the viewer have\nmore knowledge of the characters, the scenes of persecutions are good\nand the mood of the film is very dark, and it works well, the Jungle\nBook is a good movie, is pretty cool moments, the script is a bit fast,\nthe voice work is impeccable, and persecutions scenes is the point more\npositive. Note 7.9\n"},
{"review": "\nIt's not often that a remake \u0096 let alone a CGI-heavy remake \u0096 of many\nof our favourite childhood films is successful, but The Jungle Book has\ncertainly surpassed all of our expectations on that front. With equal\nmeasures of action and comedy, Favreau directs this already enjoyable\nstory with real style.<br><br>The CGI effects really are some of the best in recent years of film,\nand as a film that is primarily about a young boy talking to animals,\nthe photorealistic animation looks flawless. Combined with a truly\nexquisite voice cast, this film is a treat for both the eyes and ears,\nand will undoubtedly fill you with joy on many levels.<br><br>Whilst I wouldn't say that the film improves on its predecessor\n(because, in my eyes, you can't beat the Disney classic), there are\ncertainly a few things that this adaptation does better. For one thing,\nit better portrays Shere Khan's character, highlighting his limp and\nscarred face, turning him into the truly scary beast that he is. The\nfilm also betters shows the wolves' relationship with Mowgli, and gives\neach of the characters an incredibly strong and unique personality.<br><br>That being said, this latest adaptation is very much a re-imagining of\nthe Disney film and not a new adaptation of Kipling's book. This new\nfilm does include a few original scenes from the book which the Disney\nfilm didn't show, and even has a much darker edge to it, as Kipling's\nstory was, but there's still much that the film changes or misses out\non at the same time.<br><br>Whilst it is very much a family film, there are quite a few jumpy\nmoments which only adds to the thrilling adventure that this film takes\nyou on. But, with the inclusion of the brilliant Disney songs we all\nknow and love, each with their own unique twist on them, this film will\nleave audiences of all ages with a huge smile on their face.\n"},
{"review": "\ni love the movie and song as when i was kids. and i think this movie\nwas well made. the Giant snakeskins, intense animal battles, and daring\nescapes from ape kingdoms give the film a scope beyond the animated\nmusical, all while keeping intact its persistent joy. Funny,\njaw-dropping, thrilling, grand, and fun, it's an all-cylinders-go\ncinematic experience on every level. The story of a young man-cub\nraised by wolves and living amongst the animals of the jungle hasn't\nchanged much, down to the talking beasts. and the thought of him\nleaving the mother wolf was sad. love baloo the most of all he taught\nwagli so much . the movie is very movie was very moving would go to see\nit again\n"},
{"review": "\nthe movie is a good remake to the 1967 the jungle book(animation) but\nit fails when it comes to charismatics characters and the emphasis of\nmain events. the amazing cast of voice actors made a terrific job, and\nthe cgi of the movie is on point. mainly, its a good movie, but still i\ngot a feeling that it could be done better. The moral of the history\nits a recurring question on todays world: do our origins affect our\nlives or its our choices that do so? and, of course, how love has no\nlimits, not even between species. the jungle book its a classic, and\nthis movie do not fall behind in its legacy. voice actors: 9; cgi:8 ;\nplot and script:6;<br><br>overall:7.7;\n"},
{"review": "\nDue to the success of recent successful animated Disney films that were\ngiven the live action treatment like maleficent, Alice in wonderland,\nSnow White, and Cinderella, I guess it was felt it was only a matter of\ntime before another Disney animated feature would get the live action\ntreatment. While it has been quite some time since I saw the classic\nanimated film from 1967, but I will admit the film was rather well\ndone. The animals look rather convincing despite the cgi used in the\nfilm. Idris Elba does a splendid job playing the villain shere khan the\nBengal tiger who wants revenge against the protagonist mogwli for his\ndisfigurement. Bill Murray is a rather interesting as baloo the\nfriendly bear.\n"},
{"review": "\nAn excellent movie. If you've seen the 1967 animated classic, this\nmovie won't disappoint you, although its tone is a bit different and is\nslightly faster-paced. Jon Favreau does a wonderful job of staying true\nto the story, while giving the audience things they may not have\notherwise expected. Mowgli, the young boy who is central to the\nstoryline, is on a journey of self-discovery who happens to entangle\nhimself with all manner of animal creatures along the way, and\nultimately finds himself in a battle to prove who he really is.<br><br>The CGI (computer effects) in this movie is nothing short of fantastic.\nPractically all of it was shot indoors on a soundstage, and yet the\nmovie looks so real that you feel like you're in the middle of a lush\njungle. The real trophy are the animals themselves, who also look\nextremely real, and can openly talk- although they still retain their\n'animal' feel while doing so. The voice casting is stellar, as the\nactors lend real feeling to their animals.<br><br>This is one of those summer 'must see' family movies; although, it is a\nbit darker at times, so younger children may be a little scared. There\nare two villainous animals, in particular, that are intimidatingly\nperformed and may put kids on edge a bit. The final sequence is equally\na bit dark (though very exciting). The ending is also one you may not\nexpect, as it is different than the cartoon version. Overall, this is a\nwonderful movie- go and watch it! 9/10.\n"},
{"review": "\nWhat a jewel of a movie. Faithful to the book and the first Disney\nfilm, this modern version of the Jungle Book is technically excellent,\ninteresting, intelligent and colourful. I have no history with this\nfranchise, but I went with a friend who grew up with the Jungle Book\nand and I noticed that he was transfixed by this film. As was I. This\nmovie will rip away the varnish, cynicism and years for most of us.<br><br>Jon Favreau is such a hot director. Every movie he makes turns out to\nbe really great. When I heard he had directed this movie, I knew I had\nto see it.<br><br>The heart of the movie is young Mowgli, played by young Indian-American\nNeel Seethi. He absolutely shines in this movie. I cannot remember a\nchild actor doing such a terrific job. His anguish when he heard about\nwhat had happened to the wolf pack seemed as real as can be.<br><br>I read a review saying that the movie is essentially a series of set\npieces, without much coherence. Perhaps that's right, but I didn't have\nthe feeling that this distracted from the film.<br><br>Many of the people I've talked too about the film enjoyed knowing who\nthe famous voices were behind the various animal characters. But I went\nin there blind, and I think it added to the enjoyment of the film. It\nwould have interfered with my viewing to know, for example, that it was\nBill Murray playing Baloo. To each his own, though.<br><br>It all seemed a little too American. But now I'm quibbling. Looking for\nthings to criticize, when really there is was not a single thing that\nwas wrong with the movie. I'm giving it 9/10.\n"},
{"review": "\nDisney has yet again done the magic! Offering a blend of live-action\nand photo-realistic computer-generated effects, this action-packed 3D\nadventure is for movie lovers of all ages. The Story of Mowgli (the\norphan man-cub raised as a wolf and hated by the ferocious Bengal tiger\nShere Khan) is a tale that has captured the world's collective\nimagination since Kipling wrote it in 1894. The best way to enjoy this\nmovie is to watch it in 3D. Visually stunning and expertly acted, with\nsome heart-stopping thrills and action sequences, The Jungle Book has\nyoung Neel Sethi as Mowgli, a toddler raised by wolfs and panther.\nSethi (Mowgli) is remarkable for an actor his age, especially\nconsidering the fact that he had to act with puppets on the set as all\nthe co-stars (the animals) were computer-generated. Shere Khan is the\nvillain and the character that comes across as the most impressive and\npowerful. He hates Mowgli with a vengeance - because the boy is a\nman-cub and he believes that man is the destroyer of the jungle. Shere\nKhan is right in his own way but he doesn't realize or bother about the\nfact that Mowgli loves the jungle and wants to live with his wolf\nfamily and animal friends. Thus, to protect his own family and himself,\nMowgli flees and find help in shape of adorable sloth bear, Baloo. But\nthis is not the end of Mowgli's troubles and I will not disclose more\nof the story line for those who didn't know the famous jungle tale.\nThankfully, Disney doesn't give us an overdose of songs or it would\nhave disturbed the story-telling. The Jungle Book effortlessly merges\ncomedy, action, drama and gives us a Disney masterpiece to behold.\n"},
{"review": "\nI walked out of the cinema with a smile.<br><br>This movie has emotional moments, action and much more. The CGI in this\nfilm is simply stunning. Disney always surprises me again. The way the\nadapt new movies from the old classics is impressive.<br><br>The acting of Neel Sethi (as Mowgli) could be better, but for a boy his\nage it is definitely good. You can watch this film with your friends,\nbut with your family too. The film could be a bit scary for younger\nkids, but it's really entertaining for old and young.<br><br>I really love that they brought pieces of the original Jungle Book\nmovie. Like the characters and even some songs, this brings amazing\nchildhood memories back to me. <br><br>I think this movie is a must-see and was totally worth the money.\n"},
{"review": "\nYou may prefer the old, cartoon one, or this one. It's a matter of\ntaste. But, this is fine.<br><br>Bill Murray as Baloo and Ben Kingsley as Bagheera are superbly cast for\ntheir roles. They evoke memories to some of their finest performances.\nThe same goes for Chris Walken and his cameo as King Louis, bringing\ninstant flashbacks to \"King of New York\".<br><br>It's fun and funny, has a heart, nice rhythm. Very few things don't\nwork here.<br><br>Essentially, the culmination / the showdown with Shere-Khan doesn't\nwork well. The idea is clear, but somehow it's not on par with the rest\nof the movie. Other stuff that doesn't work also doesn't have nearly as\nmuch impact.<br><br>So, sing along the classic \"Bare (or is it Bear) Necessities\" with Bill\nMurray - he doesn't do it very well, but that's kind of the idea, you\ncan do just as bad a job, but you can enjoy doing it.\n"},
{"review": "\nRudyard Kipling's great story returns to the screen in this Walt Disney\nPictures production from director Jon Favreau. This new adaptation,\nmakes full use of the technological advances of the time to become a\ncaptivating, fresh and beautiful film, with awesome action and also a\ncast of fine star vocalists. If you are a fan of the original Disney\nclassic from 1967 or a fan of Disney films in general, this film is\ndefinitely for you. The movie of course lacks the book's heart and\nsoul, but in general \"The Jungle Book\" is a visually impressive\nadventure, a new masterpiece of artful visual effects, that cannot be\nmissed on the big screen.\n"},
{"review": "\nThe only other movie version of The Jungle Book that I've seen was the\n1967 animated version that was the last one personally supervised by\nWalt Disney. This latest one from his studio follows many of the\nsequences from that version including the use of songs like \"The Bare\nNecessities\" and \"I Wanna Be Like You\". Well, actually the ending is a\nbit different which I won't reveal here. Anyway, this was a quite\nenjoyable version of Rudyard Kipling's tale of a man-cub raised in the\njungle being befriend by the various animals with the exception of a\ntiger named Shere Khan. I especially liked Bill Murray voicing Baloo\nthe Bear, previously done by Phil Harris in the animated version. So on\nthat note, that's a recommendation of this version of The Jungle Book.\n"},
{"review": "\nI didn't watch the original Disney animation as a kid much, nor did I\nread the book. I knew the story of course, the songs --- but it wasn't\nmy favorite ( say, compared to the Lion King ). Though the trailers\nlooked good, I still wasn't sure if I would actually enjoy it.<br><br>And, honestly? I did. I really enjoyed it, in fact. It was exciting,\nfunny, and comes with a lot of heart. I teared up more than once thanks\nto Lupita Nyong'o ( who voices Raksha, Mowgli's wolf mother ) --- she\ndid a really excellent job providing genuine, heartfelt emotion in her\nvoice, in particular. That said, I think the entire cast has a very\ndistinctive voice, and gave excellent performances. Idris Elba was\ncertainly another stand-out as Shere Khan, and Scarlett Johansson was a\nhypnotizing Kaa with her husky vocals. I could definitely go on all\nday, but I won't.<br><br>If you like the Jungle Book, you should probably see this movie. If you\nlike a good movie, you should probably see this movie. I won't say its\nperfect, or that everyone will like it ---- but it's worth giving it a\ngo if you like a good story being told.\n"},
{"review": "\nFavreau, should I say, was an underrated director. After knowing what\nhe did to iron man franchise, I feel unconvincing about The Jungle\nBook. When the movie hits it, well, it was magnificent. To me, It was\none kind of movie that perfectly using the maximum potential of CGI.\nThe panoramic, lightning, set-place, colors, they were all above\naverage. It's so different when Favreau doing the Iron Man franchise.\nIt was empty, blunt, and just a mediocre superhero movie. In Jungle\nBook, I see the things what Favreau can do, maximizing and intensify\nthe use of CGI. Yeah, that's it.<br><br>I wonder, those beautiful visualization in The Jungle Book could be\nimplemented more into upcoming Disney's. I just hope so.<br><br>It's been a long time, maybe i forgot when the last time i watch this\nkind of magnificent family-adventure film. The plot that Favreau used\nto TJB was interesting. Yeah, journey typical, supported with\npanoramic, pride, and friendship. Mogwli met so many other creature as\nthe duration goes on. These creature even have it's interesting things.\nBear, panther, wolfs, pigs, monkeys, orangutans, snake, tiger, and so\non. They all are a character, Favreau successfully put an exact\nduration to develop their character in the film. Most of the time, the\nway the story goes on seems unpredictable, it's a good things. That's\nwhat made TJB so strong in rating. The journey always give the audience\nsomething new, even if it was a creature, place, panorama, legend, etc.<br><br>Good job Favreau. You successfully made a new standard for CGI use. TJB\nis an incredible movie. I was amazed by Mowgli's journey. I recommend\neverybody from all age range to watch this. It's really worth to watch.\n"},
{"review": "\n. . . than actual Tigers left alive in the Wild, what better story for\nDisney to recycle than one about a Crusade to cremate one of the last\nfew Tigers left? It seems that when Tarzan was a boy, he went by the\nhandle of \"Mowgli.\" Sort of a one-kid wrecking crew in the jungle,\nMowgli specialized in vandalizing honeycombs, destroying Monkey\nTemples, and setting the jungle on fire--that is, when he wasn't tied\nup in hunting Tigers to extinction. Though the special effects of THE\nJUNGLE BOOK are pretty stunning, its message seems more appropriate to\nthe Last Ice Age, when a few thoughtless bozos wiped out the Wooly\nMammoths and dodo birds. While Disney Nature pays lip service to the\nConservation Cause every spring, these yawners make peanuts compared to\nsomething such as THE JUNGLE BOOK. But the Disney Megacorp. seems\nunwilling to put a sizable chunk of its money where its mouth appears\nto be.\n"},
{"review": "\nI went into this movie curious what way Jon Favreau was going to go\nwith this movie. Was he going to base it off of the 1967 animated movie\nwhere Mowgli was a boy in the jungle or the 1994 movie where Mowgli was\nan adult man that had a realistic feel to it.<br><br>He based it off of the animated movie. He gave human-like personalities\nto the characters, but they still kept the characters are very similar\nto the animated version. For example, King Louis was like a jazz artist\nin the animated version but is more of a mob boss in this one.<br><br>I really enjoyed Neel Sethi as Mowgli. His interactions with the\ndifferent personalities in the animals. He also did great being the\nsmart \"human\" but yet doesn't have a clue what he can do even though he\ndoes them.\n"},
{"review": "\nWatched The Jungle Book With Newcomer Neel Sethi(Dwali )as Mowgli The\nman cub. Also Starred Sir Ben Kingsley(Ender's Game) as Bagheera ,\nGiancarlo Esposito(The Usual Suspects) as Akela, Scarlett\nJohansson(Avengers Age Of Ultron ) Kaa. Also Featuring Christopher\nWalken(Seven Psychopaths) as King Louie .Oscar Winner Lupita\nNyong'o(Star Wars:The Force Awakens) as Raksha, Bill Murray(The Grand\nBudapest Hotel) as Baloo Also Starring Idris Elba(Pacific Rim) as Shere\nKhan. The Film was Brilliant featuring A Great cast also it was\ndifferent from the Animated it was great also Disney is Two For Two in\nthere live action remakes. Amazing Visual Effects by Weta Digital &amp;\nLegacy Effects ,Music By John Debney(Broken Horses) Costume Design by\nLaura Jean Shannon (Blade Trinity),Cinematography By Bill Pope(The\nMatrix) and Amazing Direction from Jon Favreau(Iron Man) .The Live\nAction Remake Streak Continues for Disney 9/10\n"},
{"review": "\nThis movie is absolutely fantastic. The special effects are\nunbelievable, the acting is wonderful, and it is just a lot of fun. The\nonly thing I can say is that kids below nine might not want to see it.\nThis movie is equally great for kids and adults. There is a nice nod to\nChristopher Walken's famous \"needs more cowbell\" sketch to look out\nfor. Over all, other than one awkward line and some speech from Kaa\nthat looked a little off, this movie is wonderful and my personal\nfavorite in a very long time. I cannot recommend this film enough, even\npeople who hated the 1967 animated version. This film is sometimes\nhappy, sometimes sad, sometimes funny, and sometimes it has a lot to\nsay. All I can say is that you should go and see it because I promise\nyou won't be disappointed.\n"},
{"review": "\nThe Jungle Book's environments and most of its characters were created\nin computers. However, not one moment during this film did I think what\nI was seeing wasn't real. All the animals, especially the wolves, are\nincredibly detailed and have fluid movement. and the jungle environment\nreally does pop off the screen in the best way. <br><br>The story is also well done; there a few changes here and there from\nthe animated 1967 version and of course from the original book, but\nthey all serve this film well by making it quite a bit more intense.\nThis isn't just a movie for kids or adults; teenagers will definitely\nenjoy it too. There's plenty of animal action and epic set pieces.<br><br>The voice actors all do great, especially Bill Murray and Lupita\nNyong'o. Both have some surprisingly emotional moments that have not\nbeen given away in the trailer. Of course, the movie is carried by\nMowgli and the little boy who plays him turns in an excellent child\nperformance, one of the best in a while. (Which is especially\nimpressive given that he acted to a green screen most of the time.)\nOverall, The Jungle Book is a great family movie with very high\nproduction value. See it no matter your age.\n"},
{"review": "\nI am a huge fan of Disney's animated movies, I own most of the classics\non Blu-Ray that I find joy in watching over and over again. I was\nreally excited to see The Jungle Book, because after seeing the\ntrailer, it was making me wonder about the fond memories I've as a\nchild of a classic and how did they all manage to interpret in the live\nadaption of it.<br><br>The first half of the movie was quite amazing and went by really fast,\nthe second dragged a bit longer, especially the part with King Louie,\nbut then I thought to myself, if they didn't include most of the\nbeloved characters in the movie, the movie would get disliked pretty\nfast.<br><br>All in all, it was a joy to watch it, for someone who was born in the\n80's it was a absolute joy to watch the Disneys animated movie of the\nJungle Book and it still to this day is very close to my heart because\nit was the movie that I saw in my childhood, with the same principal,\nevery child that is going to see this movie and especially if it's\nfirst time watching a Jungle Book movie or hearing about it, is gonna\nsay that this is the best movie of their childhood from Disney.<br><br>Overall I was pleased with the movie, it has some pacing issues and\nsome things dragged on a little bit too long, but its a minor complain\nif you look at the movie as a whole, it was quite entreating. The\nvisuals were spectacular, the CGI was done extremely well.<br><br>I think both parents and children would have a good time watching this\nmovie, I would give this a 7 out of 10.\n"},
{"review": "\nI saw \"The Jungle Book\", starring Neel Sethi-in his first movie and the\nvoices of Bill Murray-Aloha, Lost in Translation; Idris Elba-Luther_tv,\nNo Good Deed; Scarlett Johansson-Lucy, Lost in Translation; Ben\nKingsley-The Walk, Iron Man 3 and Christopher Walken-Jersey Boys, Joe\nDirt.<br><br>This is a live-action adaptation of the 1967 Disney animated movie, The\nJungle Book. Jon Favreau is the director. You might know some of his\nprevious movies that he directed; Cowboys &amp; Aliens, Iron Man 1 &amp; 2,\nElf. Neel plays Mowgli with Bill voicing Baloo, Idris voicing Shere\nKhan, Scarlett voicing Kaa, Ben voicing Bagheera and Christopher\nvoicing King Louie. Neel is raised by wolves in the jungle. All the\nanimals talk in English. All the animals like Neel except Idris, the\ntiger, who wants to kill him. Ben decides it would be best if he took\nNeel to be with other humans and leads him into the jungle on a journey\nto reunite with his kinfolk. Along the way, they run into Bill,\nScarlett and Christopher. There are lots to keep both adults and\nchildren entertained-I particularly liked the scene when Neel is about\nto meet Christopher and comes across a cowbell. There are a few songs\nthat you might recognize; I remember hearing The Bear Necessities, I\nWanna Be Like You and Trust In Me. This movie is good family\nentertainment. It's rated \"PG\" for some scary action and peril and has\na running time of 1 hour &amp; 45 minutes. I enjoyed it enough that I would\nbuy it on DVD.\n"},
{"review": "\nThe Jungle Book is directed by Jon Favreau and is another version of\nthe classic story. And this is a fantastic film with so much to love.\nThe entire film is CGI and I honestly don't understand how because the\nfilm looks so real. The animals, the jungle, everything looks so real.\nThe voice work is also phenomenal. My favorites were Bill Murray as\nBaloo and Idris Elba as Shere Khan. Baloo is the comic relief while\nShere Khan is the fierce and extremely menacing villain. Neel Sethi is\nin his first movie here as Mowgli and he's terrific. He is able to show\ngreat emotion throughout when he's not even looking at real people or\nthings, which is remarkable.<br><br>Other voices include Ben Kingsley, Lupita Nyong'o, and Christopher\nWalken, and everyone is really good. The story is pretty straight\nforward and it moves at a pretty quick rate. There are barely any dull\nmoments in the film, but when there are, they're really emotionally\ncaptivating. This brings me to my ONE problem with the movie. The scene\nwith Mowgli and Kaa, the snake, kind of comes out of nowhere and\ncompletely slows the movie's momentum that was being built before. It\nwas cool to watch but it felt a little misplaced in the movie. Other\nthan that, this is an excellent film. The best aspect about The Jungle\nBook is its characters since they're so likable and the villain Shere\nKhan is very well realized and his motivations are clear.<br><br>Overall, The Jungle Book is an excellent adaption of the source\nmaterial. It's witty, funny, entertaining, and emotional to make for an\nenjoyable film for audiences of all ages. The Jungle Book gets an A.\n"},
{"review": "\nIt's a great movie in terms of 3D, sound effects, and pace of the\nstory, though I didn't see the original version of the movie.<br><br>The 3D is breathtaking because each animal acts naturally. For example,\nI really like the scene that the boy and the bear are swimming and\nsinging in the river together because it lets me feel I am in the\njungle as well. For the sound effect, it helps to create the mysterious\natmosphere of the jungles. I like the casting of the snake most. The\npace of the story flows, though the story is a bit simple for me. I\nmean it would be better for kids who believe there are only the good\nand the bad in the world.<br><br>Overall, it's still a great movie.\n"},
{"review": "\nThe 1967 Jungle Book is a timeless classic and that can never be\nchanged or scribbled over, but they have challenged that title with\nthis film. In the build up to the film, there have been lots of doubts\nabout this movie, the doubts were wrong. It was fantastic and a serious\nspin on the family film. The way it is done with the effects works\nbrilliantly with the young Neel Seethi, who delivers a role that\ncaptures the brilliance and love in the first Mowgli. The Bare\nNecessities was used fantastically and Bill Murray is amazing, but is\nthe second song well used? It is in a serious moment in the movie and\nKing Louie has a great presence, but he suddenly breaks out into song,\nstrange! Idris Elba, Scarlett Johanson, Ben Kingsley, Neel Sethi and\nBill Murray are just some of the names that make this movie, their\nacting is phenomenal and they are at their best. The film leaves it off\nwell, preparing for the Second Jungle Book. The Film does the 1967 Film\nJustice, go to see it in cinemas now!\n"},
{"review": "\nIt is a good movie definitely a family entertainer . Everyone was great\nin the movie and VFX is really good in this movie . I used to watch The\nJungle Book cartoon in my childhood and seeing it live action was very\nhappy moment for me and I really had a great time . Neel Sethi did a\ngood job playing Mowgli but I felt that he was little less emotional\nbut c'mon he is just a kid and he will learn but he was great . Baloo\nis the best part of The Jungle Book and in the movie also he brings\nsome really good laughing moments . There is not much to say about this\nmovie really but you should definitely see it once . Jungle Jungle baat\nchali hai pata chala hai are chaddi pehen k phool khila hai phool khila\nhai . :P :)\n"},
{"review": "\nI finally watched the movie!!! Yay!!! This movie has turned into a\nblockbuster, do you have any doubt that it wouldn't?<br><br>India has gone crazy already, this movie has already become extremely\npopular because of the fan following of the Hindi TV series and\nsecondly because the movie is based out of India, it's about India's\nson.<br><br>Those that have seen the TV show or watched the movie, I must say this\nmovie is one that has done justice to all of them. The CG has not got\nin the way of the story at all. Let me tell you at one point you get so\nmuch engrossed in the story, you will forget that the animals are CG.\nYeah, get it, the story is so darn interesting and well directed.<br><br>And the Bare Necessities simply stole my heart. Damn!!! It's so cute.<br><br>About the Acting: Neel Sethi has done an amazing job as Mowgli. This\nkid did all the acting with puppets and he is extremely expressive.\nSimply brilliant! And let's not forget the Chef who directed Iron Man\nand went on to direct this great blockbuster. Jon Favreau has given his\nbest as a director to the movie and it shows. All the actors were\nawesome in their roles. <br><br>About the CG: Mowgli is real, rest is not. That's the beauty. You will\nfind yourself in awe of many scenes in the movie and still pay\nattention to the story. That's the beauty.<br><br>Verdict: Love It, will watch it again. If you haven't seen it, do\nyourself a favor too, go watch it!!!\n"},
{"review": "\nThe Jungle Book is a breathtakingly fresh new imagining of a classic\nstory that most everyone holds dear. Jon Favreau does an amazing job of\nbringing the animated classic to life, and having everything seem as\nreal as possible without removing the childish and whimsical aspects of\nthe Disney classic. My only complaints are few, Neel Sethi can't act to\nsave his life, not every song fit quite as well as I would've hoped.\nBut the movie is astoundingly beautiful in every way, the CGI creatures\nare so lifelike it's almost mesmerizing, and to that extent, the voice\nacting flows well with that all, not being as weird as one might think.\nThis is another great family movie, and one this year desperately\nneeded. I highly recommend everyone check this out, I certainly enjoyed\nmyself and I'm certain you will too.\n"},
{"review": "\nThe Jungle Book was a classic. Usually when a review starts off this\nway, it means that the the remake did not live up to the original. This\nmovie did. Rudyard Kipling's classic story, once retold by one of the\nworld's most inspiring men, has now been retold once again in this epic\nCGI sculpted world. From the music, composed by John Debney, to the\nstory, retold by Justin Marks, this film was a born-again classic. Who\nsays you can't mess with the original? While the acting fell a bit\nflat, the story and the visual effects did not. This movie had,\nundoubtedly, the BEST visual effects I think I have ever seen in a film\nthus far. Never have I seen a film with such an impeccable and lively\nplot either. I truly loved that Kaa, played by Scarlett Johansson, was\nable to deliver Mowgli's back story. I also loved that the writer\nincorporated the music that we so dearly loved from the original Disney\nclassic into this new-age classic. I must also mention the outstanding\nattention to detail when alluding to the original film. At some points,\nI may or may not have teared up thinking about the man that put this\nstory on screen for the first time. I guess that's what great\nstoryteller's do. They inspire and pay tribute to those that have\ninspired them as well. Thank you so much to everyone behind this film.\nYou have truly made me a happy man and a proud fan of Walt Disney\nStudios.\n"},
{"review": "\nFirst, you must know this is my first time to watch jungle book movie\nand know the whole story. So, I wouldn't compare this movie with the\nother version. In My Opinion this is a good movie. I love the\nanimation, the animal and all the environment. the Audio itself made me\nfeel like I'm in a forest. It's perfect. The acting of Neel (mowgli)\nwas very good, He is smart, active and \"childis\". the story was good\ntoo, It don't bring many surprises, but it would be very good for your\nfamily movie. the animal's character, the moral, the cute etc. They\nwill entertaint you. So, don't hesitate to watch this with your family.\nGo to the theater, enjoy the \"forest\" and smile.\n"},
{"review": "\nThis Rudyard Kipling classic was a big task for Jon Favreau with the\nworld watching to see if he would do the story justice. Starting with\nthe aspect of vocal performance, this movie packed an all star cast of\nwhich would make any movie buff overly excited. Bill Murray as a\nfriendly bear, Ben Kingsley as a wise panther, Idris Elba as an\ncunning, evil and strong tiger, Scarlett Johansson as a seductive\nsnake, and Christopher Walken as a greedy singing orangutan. In regards\nto voice acting this movie deserves applause. although the main (and\npretty well only actual actor) Neel Sethi, who plays Mowgli, has a week\narray of acting skills but I wouldn't expect much more from a child his\nage. My first thoughts after watching this movie had to do with the\nobvious message about the relationship between humanity and nature.\nHumans are viewed as a destructive force that brings destruction\nwherever they are. This is the fundamental reason Elbas Tiger wants\nMowgli dead. The music and songs really emphasised the feel of each\nscene. Although some would argue that the lack of sound and music\ncreated a empty unfulfilling space. I feel as though the 'lack'\nactually created a more exciting feel. This movie fulfilled every\naspect of cinema extraordinaire that i would expect from an adventure\nfilm. Favreau has fulfilled this amazing display of a great work and\nhas succeeded in taken audiences on a adventure journey filled with\ncomedy, action and suspense.\n"},
{"review": "\nI was eagerly waiting from the day I saw the trailer. It was exiting,\nlike revisiting my childhood. The movie starts in a simple fashion, 3d\neffects kick in. The sets are and the effects blend in. Neel Sethi as\nMowgli as done a great job and having Ben Kingsley as Bagheera was the\nbest choice. Story stays simple, but interesting characters are bought\nin at perfect interval. Voices of Scarlett Johansson as Kaa, and Bill\nMurray as Baloo do grab attention. <br><br>The thing that left me wanting for more was the run time, they could\neasily have added another 15-20 min. The important character in Jungle\nbook is Shere Khan and Idris Elba's voice strikes fear. The Shere Khan\ncharacter is one which fearsome and really takes center stage as a\nmedium of danger and wildness of the jungle. Why I don't understand for\nsome reason the character in the movie is more dark, fearful but kind\nof ugly too. Shere is show too weak, old and made me a bit resistivity\nthat what I had experienced in book. The songs are situational and\ngood, but are not that fine- tuned as any other Disney movies.<br><br>Being down all of these, it's still a good movie for kids and adults\nalike. Stunning visuals, some great chases and neatly done effects\nleaves us much to cheer for. The adaption is justified and Rudyard\nKipling's writing are neatly pictured on screen. So drop into theater's\nto enjoy the adventures of Mowgli and the difficulties he and animals\nfaces on being in jungle.\n"},
{"review": "\nMowgli is back in the jungle! I loved this movie!<br><br>The Jungle Book is a mind blowing film. It is the most gorgeous movie,\nI have ever seen. What's extremely fascinating is that, the whole\nenvironment in the film is CGI. The animals are also CGI &amp; yet, they\nlook extremely lifelike. The forest the movie is set in, looks\nbreathtaking. Director Jon Favreau &amp; the rest of the crew, have\nmaintained the soul of the 1967 animated movie of the same name. Kudos\nto the visual effects team, for making a live-action adaptation of a\nmovie like The Jungle Book. Don't worry. This film is not a carbon copy\nof the Disney animated original. Favreau adds many new elements to the\nfilm, that will keep you guessing right till the end. The set pieces of\nthe movie, are its highlight.\n"},
{"review": "\nI am not saying that this is bad movie. It has some good elements to\nkeep you engaged. But it certainly lacks the innocence which we\nexperienced in cartoon animated version. I do have entire episodes DVD\nand I still watch it with pleasure. <br><br>When I saw the trailer of this movie, I instantly liked it, may be out\nof sheer nostalgia and sweet childhood memories which we always look\nback with rose tinted glasses. So I went to theater with huge\nexpectations. What I saw was just, a splendid and spectacular graphical\nrepresentation of forest, animals and fight sequences. Overall ambiance\nand sound effect was cherry on top. Undoubtedly one of the finest CGI I\nhave ever saw. With 3d glasses it made me feel like I am living life of\nMowgli in Jungle. <br><br>Alas.... It does lack content. Innocence of Mowgli and his friendship\nwith other animals was missing except relation of Bhaloo and Mowgli.\nThat was beautifully shot and that is what I was expecting throughout\nmovie. Instead it was heavy graphical bombardment. I didn't understand\nthe need of surprise sound effects during fight sequence or middle of\nthe dialogue like suspense or horror movies. By being an adult I was\nterrified in 3-4 scenes, No wonder Indian Censor Board gave it U/A\ncertificate considering scenes might be violent for under age kids. <br><br>As far as Hindi dubbing is considered, Voices were chosen wisely I\nguess. Full marks to Hindi dubbing. Nana Patekar for Sherkhan - Super\nIrrfan Khan for Bhaloo - Super Om Puri for Baghira - Super <br><br>Only 1 actor is in movie to judge. And we can say that Neel Sethi\nnailed it as Mowgli with his body language and expressions. <br><br>If you are going with the expectation to experience Jungle book which\nwe saw in animated cartoon version then you may face disappointment but\nif you want to experience 3D, CGI and good sound effect then go for it.\n"}
]