[
{"review": "\n\nThis movie is way to be good to be labelled a sequel to The Godfather .\nRather it is more of a companion piece to the original and the two perfectly\ncompliment each other . IT is both a sequel and prequel showing the rise of\nthe young vito and moral decline of Micheal . Both characters are brought to\nlife with uncanny ability by Robert  DeNiro and Al Pacino . To say that\nthese two are good actors is like saying that a nuclear bomb makes a loud\nnoise and in this movie they prove why they are at the top of their\nrespective crafts .<br><br>Al Pacino is the standout in the ensemble cast and its amazing how his eyes\nhave changed from the first part . They are now cold , ruthless and\nunemotional and betray the price which Micheal Corleone has paid for power .<br><br>Watch this movie and learn why it is the greatest gangster film of all time.\n\n"},
{"review": "\n\nYou can count on one hand the movie sequels that measure up to the\noriginal; GODFATHER II makes the cut. This movie is just as fine as\nGODFATHER I. Here the director goes back and forth between the early\ndays of the young Vito Corleone, played by Robert De Niro, and the\nfamily after the action in GODFATHER I in the 1950's just before Castro\ncame to power. Michael Corleone (Al Pacino) has moved the family and\nmost of his business to Nevada. Once again the acting is flawless.\nDiane Keaton as Michael's wife who quickly becomes disillusioned with\nher life with him and the lies he continues to tell her, assuring her\nthat he is going legitimate soon; Robert Duvall as Michael's adopted\nbrother and adviser; and Lee Strasberg as Hyman Roth all give\noutstanding performances; but the film really is Al Pacino's. We see\nhim become a ruthless, cold-blooded killer who alienates himself from\nhis family in ways his father would never have done. He has come so far\nfrom the idealistic young man in \"GODFATHER I, who joined the Marines\nin World War I to serve his country and die for it if necessary, to a\nlonely, paranoid tragic man. There are many poignant scenes concerning\nhis wife and children-- the drawing his son leaves for him in his\nbedroom, the gift that Tom buys the child because Michael is too busy,\nhis wife Kay's being kept a virtual prisoner at his orders in the\nfamily compound, etc.<br><br>Once again many acts of violence are interwoven with religion:\nMichael's son's first communion, the religious parade in New York,\nFredo's repeating the Rosary in order to catch a fish, for example. <br><br>The cinematography is stunning; the footage from Sicily and New York\naround the turn of the century and the snow scenes from the American\nWest are beautiful and rich in detail. Mr. Coppola has directed yet\nanother masterpiece.\n\n"},
{"review": "\n\nThe Godfather Part 2 is the finest sequel ever made and is arguably a finer\nfilm than the original Godfather. The film is divided into two main parts -\nthe story of a young Vito Corleone (flawlessly acted by Robert De Niro and a\nworthy Oscar winner) and the rise to power of Michael as the head of the\nfamily. Francis Coppola recollaborated with many of the crew members of the\nfirst film and again achieves a quite superb period piece thanks to the\ncinematography of Gordon Willis and set design of Dean Tavoularis. The\nacting performances are outstanding, hence three supporting oscar\nnominations for acting guru Lee Strasberg (Hyman Roth), Michael Gazzo (Frank\nPentangeli) and Robert De Niro (young Vito Corleone). Duvall, Keaton, Cazale\nand Shire all provided first rate performances but it is the performance of\nAl Pacino which steals the show, expertly portraying Michael as a cool,\ncalculating, suspicious Don Corleone. The film expands upon the original\nmovie and brings us into the family's activities in Nevada, Florida and\nHavana. Arguably the finest movie of the 70s, a cinematic masterpiece with\nthe greatest ensemble acting you will probably see.   \n"},
{"review": "\nThe Godfather Part II (1974)<br><br>Number 1 - 1974<br><br>Top 3 - 1970s<br><br>\"My father taught me many things. Keep your friends close but keep your\nenemies closer\"<br><br>\"The Godfather Part II is truly a masterpiece. Timeless, Classic,\nBeautiful and endlessly watchable\"<br><br>The second part of Francis Ford Coppola's Epic and violent Gangster\nTrilogy, follows the reign of Don Michael Corleone as the head of the\nCorleone family. As well the film shows us the early years of Vito\nCorleone (Marlon Brando) played flawlessly by Academy Award Winner\nRobert De Niro, and how he created his empire of money, gambling and\nrespect. Beautifully directed by Francis Ford Coppola, Godfather Part\nII exceeds every expectation with outstanding performances from Academy\nAward winners Al Pacino,Diane Keaton, Robert Duvall and Robert De Niro.\nThe second part of this unforgettable trilogy is one of the finest\nfilms ever made. <br><br>This is cinematic art. A treasure of film history. The finest sequel\never made. A faultless, flawless gripping drama; Coppola's second part\nof his crime saga is in my opinion one of the top 5 films of all time\nand perhaps towering over the first part. <br><br>\"As close to perfection as movies get\"<br><br>\"Pacino at his best\"<br><br>-10/10-\n"},
{"review": "\n\nAfter seeing The Godfather and improving it as one of my favorite\nfilms, I wanted to get more into The Godfather so I rented this. Words\ncan't describe how great this sequel was. The acting once again was\namazing and the story and how the movie went on just never got me\nbored. Everything in this movie was clearly beautiful. The ending by\nfar was my favorite when there all sitting at the table talking. There\nwere so many great scenes like Vito when he was younger, Fredo at the\nlake, and many many more. You have to see this movie because it's just\nbrilliant filmaking. It's not better than it's first film but still an\nextremely worth sequel.<br><br>10/10\n\n"},
{"review": "\nThe Godfather Part Two is possibly the best film ever made, every part\nof this film is amazing, it is even better than the original, I was\nvery surprised by this. The story is amazing, everything makes perfect\nsense. The Oscar winning screenplay is amazing, the dialogue is some of\nthe most original, and realistic ever putt on screen, the characters\nare flawless, and it's in every way perfectly written. The acting is\njust as fantastic, I can't believe Al Pacino lost the Oscar, and for\nonce Robert De Niro was even better, he was truly amazing, and\ninterestingly he fails to say a single word in English. The direction\nis also amazing, Francis Ford Coppola even does a better job than he\ndid in The Godfather, and Apocalypse Now. The visual effects are so\nmuch better than the amazing one's in the original Godfather. One of\nthe best films ever, a must see. Flawless.\n"},
{"review": "\n\nFrancis Coppola and Mario Puzo continue their epic saga into the lives of\nthe infamous Corleone family, which is headed by Michael Corleone (Al\nPacino).  It is a film which does better than its predessor, \"The\nGodfather\".  The film flip-flops graciously and beautifully between\nMichael's struggle over the family business and the life of young Vito\nCorleone (Robert De Niro, in a brilliant, Oscar-winning performance) in his\nrise to power as well.  Robert Duvall, Diane Keaton, Lee Strassberg, and\nJohn Cazale give excellent supporting performances.  Carmine Coppola's and\nNino Rota's score is a masterpiece of music.  The movie is expertly filmed\nand the cinematography is superb. \n"},
{"review": "\n\n\"The Godfather, Part II\" is excellent just like its predecessor. While the\nfirst is arguably the greatest film ever made, the second installment is\neasily the best sequel produced hands down. The film is split between the\nstories of Michael Corleone (Al Pacino, Oscar-nominated) and a young Vito\nCorleone (Robert De Niro, in his star-making, first Oscar-winning\nperformance). In the 1950s, Michael is trying to expand his crime empire to\nlocales such as Las Vegas, Hollywood, and even turbulent Cuba. However,\nthere are numerous problems as older brother Fredo (John Cazale) may have\ndouble-crossed the family. Also two prominent crime bosses pose a\nconsiderable threat as well (Lee Strasberg and Michael V. Gazzo, both\nOscar-nominated). Younger sister Connie (Oscar nominee Talia Shire) is still\nreeling from her husband's murder and her father's death at the conclusion\nof the original film. Michael is also distancing himself from his wife\n(Diane Keaton) and some of his most trusted friends (Robert Duvall). While\nall this is occurring we get glimpses into the early life of Michael's\nfather (De Niro). We learn that his parents and older brother have been\nkilled in early-1900s Sicily and that he has immigrated to New York. Vito\npays his dues and learns the tricks of the trade, buying his time, before\ndeciding to create his own small empire which would of course grow and\nbecome what we saw in the original. It would seem that the film would be\nconfusing by jumping back and forth between Michael and his father, but that\nis not so. Coppola gives you just enough information to keep the audience\nintrigued through each segment. The film is very well-made and runs very\nsmoothly even though it lasts over 200 minutes. Many think that this\ninstallment is the best of the series. Even though I still think that the\noriginal is the best, I cannot totally disagree with this assertion as this\nis the definitive sequel. 5 stars out of 5.   \n"},
{"review": "\nThe Godfather Part II is a consummation of the saga of the Corleone\nCrime family. Regarded by many as the best sequel ever, the Godfather\nPart II is equally brilliant as its precursor and good enough to stand\non its own. The movie juxtaposes, the early life of Vito Corleone (from\nhis orphaned childhood to his rise in power in New York), with the life\nof his son, Michael (after Vito's death to Michael becoming the most\npowerful Mafia head). Al Pacino picks up from where he left in the\nfirst part, consummating Michael's journey to the dark side and in the\nprocess, presenting him as the greatest anti-hero, the western cinema\never embodied. The movie gave Pacino his third consecutive Oscar\nnomination and a perpetual stardom that catapulted him above the ruck,\nlaying the foundations of his illustrious career. Just like in part I,\nhis performance in this movie is absolutely worthy of an Oscar, but the\nAcademy once again robbed him of the glory.<br><br>Robert De Niro in his Oscar winning portrayal of Vito Corleone, gives a\ngreat performance without uttering a single word in English. The\nsynergy imparted by the brilliance of these two outstanding performers,\nmakes the movie, a treat to watch. Robert Duvall reprises his role of\nTom Hagen with a desired degree of subtlety and equanimity, reminding\nthe viewer of Brando's portrayal in Godfather part I. The entire cast\nis brilliant with special mention of John Cazole as Fredo, Lee\nStrasberg as Hyman Roth and Michael V.Gazzo as Frankie Pentageli, who\nare outstanding, to say the least. Cuppola's brilliant and innovative\ndirection gives Puzo's masterful story, an incredible impetus, which is\nwell complemented by Nino Rota's poignant score and Gordon Willis'\nvivid cinematography. In a nutshell, the movie, though sanguinary and\nlengthy than its precursor, is an equally brilliant work of cinema, a\nprofound and a deeply engrossing master piece.<br><br>http://www.apotpourriofvestiges.com/\n"},
{"review": "\nThis isn't quite as powerful as the first Godfather, done two years\nearlier, but it isn't far behind. It's another magnificently filmed\neffort, wonderfully acted and a hard film to stop once you've put it in\nyour tape or DVD player.<br><br>What makes this a notch below the first Godfather is the absence of\nMarlon Brando and a little too much disjointedness with flashbacks.\nAlso missing from this film was the volatile James Caan. He was shown\nin a flashback scene near the end, and that was it.<br><br>One thing was just as good if not better than the first film, and that\nwas the cinematography. The browns, blacks, greens and yellows are just\ngreat treats for the eyes. I especially love the Italian houses and\nscenery. Why this was not even nominated for an Academy Award in\ncinematography is mind-boggling.<br><br>The story centers around the brutal vengeance of youngest brother\nMichael (Al Pacino). It also gives a good demonstration of how the\ngangster lifestyle may look attractive on the outside but really is an\nunhappy one despite the wealth.<br><br>There are some excellent supporting performances in this film, too. I\nespecially would cite the roles played by Michael Gazzo and Lee\nStrassburg.\n"},
{"review": "\nI have been forced to watch the Godfather trilogy by a friend of mine\nwho thinks, as do most people, that they are the best thing since\nsliced bread. I found \"The Godfather\" just about watchable, but no more\n- I would have given up if my friend hadn't been there, but this was\ncompletely intolerable. I couldn't follow who the people were (and\ndidn't care) I couldn't relate it to the previous film. I couldn't\nrelate the 1930s stuff to the 1950s stuff. There is no excitement no\ntension, no nothing. A complete waste of an evening. And it's so\ninterminably long too. I'm having trouble filling out my ten lines for\nthe review, because the film left almost no impression on me - except\nthat feeling that I used to get at school when I was forced to sit\nthrough the most boring lesson in the world. And God help me, I'm going\nto have to watch the third one. Like taking cod-liver oil. Ugh.\n"},
{"review": "\nGodfather Two is Coppola's movie---and he had no instincts for the\nmafia. The Godfather author, Mario Puzo, objected to having Michael\nkill his own brother, but finally gave in to keep his share of the\nHollywood millions.<br><br>Godfather Two has lightweights as heavies: the drunken New York mob guy\nand Hyman Roth can't compare to Barzini, Sollozo, and the other\nheavyweight bad guys of the original Godfather written by Puzo.<br><br>Godfather Two loses the atmosphere of the mob while it meanders\nlengthily into Cuba.<br><br>The main point that makes Godfather Two inferior is that it does not\ncontain a single sympathetic character.The endless scenes in the Lake\nTahoe home of Michael's are tiresome, dreary after a while, and lack\ninterest as compared to the original Puzo story.<br><br>This movie shows a deterioration from the original, just as the mob has\ndeteriorated in recent years.<br><br>Coppola had no right to think he could write his own Godfather, and his\ninferiority to Puzo when it comes to dealing with the mob shows up here\nin technicolor.<br><br>Meanwhile, poor Mario Puzo watched his story being degraded by the\ninstinctless Coppola, objected at first, and then gave in. Pathetic.<br><br>The only scenes that actually ring true here are from the original Puzo\nbook (the earlier life of Vito Corleone).<br><br>The contrast between the dreary Coppola script of Godfather Two and its\ndreary characters is brought home strongly by the final (flashback)\nscene where Sonny Corleone and the others are around the table. As soon\nas Sonny appears, everything comes to life.\n"},
{"review": "\nWell I watched the first Godfather film and wasn't impressed what so\never, completely overrated. However Part II is one of those films that\npeople always go on about being a better sequel than the\nfirst...unfortunately it is even more boring and slow than the first.<br><br>Again its incredibly long, and literally nothing happens in this film!\nOnly one 'big' event happens (Michael's home being shot up), which\nisn't that exciting, and the whole film slowly develops around this.\nThere is also the De Niro 'becoming' Don Vito side story which I don't\nthink adds anything to the story at all. He goes from being a normal\nguy to then shooting the main boss in the town then instantly somehow\nbecomes The Don..with no retaliation what so ever, and it doesn't even\nshow you him becoming The Don. The next time it cuts to his story he is\nalready The Don. Maybe I missed a part (which is possible as I ended up\nmessing around on the internet while watching as it was that boring)\n"},
{"review": "\nThis is Coppola's epic tale of first generation Italian Americans\nmaking their way in the glamorous, criminal underworld of the 1920s and\n1950s. The span is vast and ambitious. It cuts between the emerging\ncriminal stronghold of Michael Corleone and the early life of his\nfather, Vito Corleone.<br><br>The unfolding narrative of Michael Corleone's life, dynamics of the\nfamilial relations, and the way in which he legitimises his criminal\ninfra-structures were well presented. It is possible to understand the\nprotagonist's moves and motives, his character has integrity in that\nregard.<br><br>However, frequently and without warning, the flow ended in a crescendo\nof chaos. The material needed to be ordered and handled more\nsensitively. Good film but not as cleverly arranged as the first.\n"},
{"review": "\nWow. This thing is almost three and a half hours long and yet it is not\nboring for a second. Not one moment. From the very first scenes up\nuntil the tragic and forlorn ending, this film seizes hold of the\nviewer's consciousness and does not ever loosen its grip, even when the\ncredits roll. I walked away from the movie with what felt like a deep\nresonance inside me. It is at once heart-wrenchingly sad and stunningly\nbeautiful.<br><br>Thematically, it actually shares much in common with later films such\nas American Beauty and Fight Club. The Godfather Part 2 is the story of\na man who seems to have it all - but the only things he ends up not\nhaving are the only things that truly matter to him. Michael's\ncharacter arc continues on from the first film, creating a great, epic\ntragedy and what I think is one of the saddest and yet most majestic\nendings in film.<br><br>I haven't even talked about the more technical aspects yet. This is\nbecause I don't have to - everything is perfect. Not just great, but\nperfect, as in there seems to be no way that they could be improved on.\nActing, direction, cinematography, script and story. Everything.<br><br>The one thing, though, that clinches it for me is that the plot doesn't\nreally matter. This is a movie about themes and ideas. The plot is\nquite thick, so don't worry if you don't get it - you don't have to. As\nlong as you understand what the film is really about... you will walk\naway knowing that you have witnessed something almost life-changing.\n"},
{"review": "\nI personally think that this film surpassed the glory of The Godfather\nI. you will have to watch it time and again in order to understand the\nnuances of it's brilliant film-making. the characterizations are\nexceptional: 1. Micheal Corleone (as the new don torn between family &amp;\nbusiness) 2. Hyman Roth (as the scheming old villain) 3. Kay Adams\nCorleone (as the worried wife) 4. Robert Duvall (as the loyal lawyer)\n5. John Cazale (as the betraying brother) 6. Robert DeNiro (as young\nVito) etc. etc.... It's just Brilliant!!! Speaking about the\nfilm-making the parallel narration of two different but interlinked\nstories is a fresh new lease of screenplay. the cinematography is\noutstanding. the indoors are lit up beautifully with overhead lighting\nwhich puts a shadow over the characters' eyes making it impossible to\nsay what they're thinking. But unlike the first part where they had\nbroken all the rules (the characters are established first before the\nplace and time) in this film they've come back to the rules (the\nlocations are established before the characters) Francis Ford Coppola\nshould definitely be given another chance to make a sequel to the\ntrio-logy so that the present generation can also experience the 'Magic\nof the Movie' and for anyone who's not seen this film, I bet they're\nsurely missing something in life...\n"},
{"review": "\n\nI have to agree with Robert Towne when he said this\nfilm\nis one of the greatest achievements in the history of\nscreenwriting. When the camera follows DeNiro as he moves \nfrom rooftop to rooftop, falling into the abyss filled with crime and\ncorrpution, it will affect him and his family forever. DeNiro is slick and\nsmooth as the young Vito Corleone. The rise of Michael Corleone's power is\nsuperbly\ncaptured by Coppola and delivered with cold hearted villainy\nby Al Pacino, in his finest performance. Strasberg is also\nsolid in his performance of Hyman Roth. It's nice to see\nhim put that \"method\" to work. The only one who feels out of it here is\nDuvall who seems to be simply going through motions. It may have been that\nTom's character is also given limited depth within the script. It is a\nsuperb sequel, argued by many to be\nsuperior to the original. \n"},
{"review": "\n\nAfter the success of 'The Godfather' and having been turned down for a part\nin the first film, Robert De Niro follows hot on the heels of Al Pacino by\nbeing cast as the younger version of Vito (Marlon Brando). In it, we see a\n30 year old Robert De Niro being taken from being a clean cut young man,\nprobably not as striking as Pacino with his large brown eyes and dark hair,\nbut interesting to look at none the less. Although not innocent looking, De\nNiro goes from being clean cut to being the gangster that we have come to\nknow and love in the 80's and 90's at the guiding hand of Francis Ford\nCoppola. No wonder he won the award for 'Best Supporting Actor' to Pacino's\nleading role.\nAs a whole, the film wasn't as cinematic as the first one, the range of\ncharacters that dominated the predecessor was not there is this follow up.\nHowever, the film was dominated by Robert De Niro, and it's almost a pity\nthat De Niro and Pacino didn't meet. They would have to wait until 22 years\nlater when they would team up in 'Heat'.\n"},
{"review": "\nThe Godfather Part II is one of those rare sequels that is regarded by\nmany to be as good as, if not better than, the original. I'm guessing\nthat much of its popularity lies in the fact that it is not just a\nsequel, following Michael Corleone (Al Pacino) as he continues to\nexpand his family's 'business', but also a prequel, charting Vito\nCorleone's life from a child in Sicily at the turn of the 20th century\nto powerful New York mafia don. Two films for the price of one!<br><br>Unfortunately, as far as I'm concerned, only half of this 'double-bill'\nis really worth the time and effort. The flashbacks are great, with\nRobert De Niro superb as the young adult Vito, rising from shop\nassistant to mob boss; these parts reminded me of the excellent Once\nUpon A Time In America, which also charted the early lives of young\ngangsters (and which also starred De Niro). In contrast, the scenes\nfeaturing Michael's continuing underworld activities in the '50s are\nfar too convoluted and slow for their own good, making keeping up with\nthe Corleones more of a chore than a pleasure.<br><br>8/10 for the flashbacks; 4/10 for the rest. That's a disappointing\naverage of 6/10.\n"},
{"review": "\n\nBy the end of this classic sequel to \"The Godfather\", I absolutely felt\nnothing but hatred for Michael Chorleone.  Even though he waited until his\nmother faded off to kill Fredo, I still couldn't feel anything for Mike. \nBut when you see the last shot of the film, you realize that he is going to\nregret it for as long as he lives and will fall into a deep depression for\nthe next decade or so.  How could he be so mad at Fredo for being tricked by\nthose two rats, Hyman Roth and Johnny Ola. That wasn't exactly all Fredo's\nfault. But, you not only do you feel the neglect from Michael to Fredo, but\nyou feel the neglect from Michael to his family and household.  That was one\nof the really haunting parts of the film.  Michael's neglect is what causes\nhim to fall into the deep depression by the end of the film and into the\nthird installment of the trilogy.  Francis Ford Coppola has a true gift in\nfilm making and to this day remains one of the best directors in the\nbusiness. The best of the trilogy.<br><br>10/10 The best film ever made. *****/*****\n"},
{"review": "\nAs far as sequels go this isn't awful. A lot of money went into this\nand the acting is excellent by everyone. <br><br>The sparkle and grit and realism that appears in almost every frame of\nThe Godfather just isn't here. Some of this seemed forced and contrived\nand overall the story is quite grim and depressing. Even in The\nGodfather there were a few scenes here and there that were light and\nslightly amusing. You get none of that here. Everything here is black.<br><br>I also think that this a little bit too long. I think it could have\nmoved faster. <br><br>All in all it isn't something I would watch a second time. Not like the\noriginal, which is a product of it's time.\n"},
{"review": "\nAnd that is saying a lot.Probably the most fantastic and well made\nsequel of all time.Some consider it to be even slightly better than the\noriginal but for me the first Godfather is still the best mainly\nbecause of Marlon Brando.Despite of that The Godfather part 2 is a\nflawless movie,a timeless masterpiece with countless qualities that\ncrabs the viewer and never ceases to impress.Al Pacino delivers simply\na stunning performance and deserved an Oscar for best actor.Here he\nisn't the fragile,insecure young man he was in the original film.Here\nhe is wiser and more respectful.Perfect Michael Corleone.The rest of\nthe cast is amazing too.Robert Duvall as Tom Hagen and John Cazale as\nFredo shine once again.Cazale as the treacherous Fredo has a bigger\nrole and makes an even greater impact on the audience.But a lot of the\ncredit has to go to the brilliantly cast Robert De Niro who indeed\ndeserved to win the Oscar for best supporting role.His portrayal of the\nyoung Vito Corleone and his rise to power is simply stunning.Excellent\nwork.Director Francis Ford Coppola is simply one of the greatest\ndirectors not only of his time but of all times and shows once again\nthat he is the biggest fan of the novel and shows great respect both\ntowards Mario Puzo and his work.\n"},
{"review": "\nThe Godfather Part 2 is easily better than part 1 for several reasons.<br><br>1. The telling of Con Coleones rise in power with Robert De Niro is\nvery exciting and De Niro is amazing.<br><br>2. The scene where Micheals brother Fredo is killed is the best scene\nin the film.<br><br>3. I felt there was a bit more action but there was still time for\nstory and character development.<br><br>4. The last scene with Micheal sitting on the bench is also very good.<br><br>5. The score is just as in Part 1 superb.<br><br>So all in all Part 2 is better than Part 1 which didn't really believe\ncould be possible.\n"},
{"review": "\nThe Godfather Part II, is just as good as the first film. Al Pacino was\nabsolutely awesome in this film. His performance in this film is one of\nmy personal favorites, and probably one of his best performances of all\ntime. This film was so good because it continues the story of Don\nMichael Corleone's rise to the top, and then slowly to the bottom at\nthe end. Plus another cool thing about the movie, is that it has\nseveral flash backs on the life of younge Vito Corleone, played by\nRobert DeNiro (who also gave a great performance). Again the directing,\nand story telling, and the acting were great in this movie. It is truly\nthe greatest sequel of all time.\n"},
{"review": "\nThe Godfather Part II has excellent writing, plotting, editing is even\nbrilliant, acting, and overall quality to watch over again and again.\nYou can never get sick of watching this film. I miss John Cazale. He\nwas truly a gifted actor and I miss him. He played my favorite Corleone\nbrother. Sure Alfredo was never brilliant or vicious but he was sweet,\ngentle, and warm most of the time. He had a conscience and I despise\nMichael for killing his own brother. I think he killed him out of\njealousy. Alfredo spent more time with Michael's son, Anthony, than he\ndid and he resented him for it. Alfredo could have been spared. Four\nyears after Godfather Part II, John Cazale died of cancer after filming\nthe Deer Hunter. He never won an Oscar or made too many films but he\nmade every role memorable. Rest in Peace, John. I miss you.\n"},
{"review": "\nIt's rare for a sequel to match its predecessor, but the follow-up to\nFrancis Ford Coppola's monumental mob family drama does more than\nsimply continue the same story, expanding on themes only suggested in\nPart One to present an ambitious overview of organized crime in 20th\ncentury America. The Corleone family tree is divided here into parallel\nhistories, with young Vito (Robert De Niro) arriving in the New World\nto begin a family, and a family empire, which a generation later his\nbitter and lonely son Michael (Al Pacino) would consolidate, destroying\nin the process everything he holds dear. The sudden displays of\ngangland violence are no longer placed in ironic juxtaposition to the\nunlikely richness of Corleone family values, being used instead to\nmeasure the corruption of il padrone's immigrant idealism: murder to\nyoung Vito is strictly a matter of honor, but to Michael it's only an\nextension of his absolute power. The crosscutting between two stories\nsacrifices a consistent narrative flow in favor of complexity and\ndepth, but it's a fair trade, and seen together with Part One (Part Two\nshould not be seen without the introduction provided by the earlier\nfilm) is a rich experience not soon forgotten.\n"},
{"review": "\nWhat else can be said about The Godfather series? One small gripe: The\nstoryline shows young Vito Corleone (Robert Deniro) murder the local\nboss, then basically take control of the neighborhood. Historically,\nthere would have been a dozen other guys in line to take the boss's\nspot -- young Vito, with no real connections outside of his petty thief\nneighbor, would have been disposed of immediately. In real life, bosses\nwere bred into the position or it was taken hostilely from the inside.\nBy the era that this movie portrays, Sicilian black handers and\nNeapolitan Camorra (among others) were fairly organized -- But, hey,\nits a (great) movie :)\n"},
{"review": "\nThere are bound to be comparisons to 'The Godfather',but it definitely\ncomes close to surpass its predecessor but to no avail.But that doesn't\ntake away any credit from another gem from Francis Ford Coppola.There\nwould have definitely been immense pressure on Coppola to deliver the\nsecond time after the first one was a huge hit.<br><br>Robert De Niro was outstanding as the young Don Vito Corleone and truly\ndeserved his Oscar.John Cazale delivers on getting more screen\nspace.But I was disappointed to see that Al Pacino as Michael Corleone\nafter having overshadowed his previous work in the first and having\nreached greater heights in this one, did not get an Academy award.<br><br>The film does not disappoint and matches the original in every\naspect.Truly outstanding cinema.\n"},
{"review": "\nIf the Godfather is a masterpiece then this is a \"grand-masterpiece\".\nHow often do you see a work of perfection in movies? After watching\nthis movie,you can (at least) answer \"once\". The movie is the sequel\nand prequel to The Godfather as you all must know and shows the rise of\nVito and Michael Corleone in two separate story lines. In this movie we\nsee the rise of Vito Corleone to become The Godfather and how Michael\nCorleone expands his family business but we also see his moral\ndegradation.In the Godfather we see Vito Corleone has no regrets for\nhis deeds because he had maintained his virtues but in this movie\nMichael regrets his deeds very much because he has morally\ndegraded(which we see at the end).This is a fair depiction of \"changing\ntimes\". If you want to see a movie that leaves you with doubts about\nright and wrong ,justice and injustice ,hero and villain ;do watch this\nmovie.\n"},
{"review": "\n\"The Godfather\" is basically the bridge that connects to stories in\nthis movie.This movie takes you to the origins of Don Corleone and gave\nyou an idea of how he rose to power and how respected he was in\nSicily.While \"The Godfather\" is a work of art, this is a\nmasterpiece.Everything you saw in the original movie plus more.A lot of\ncharacter development, strong performances from all actors and great\nstorytelling exist in this Dark Drama.Al Pacino, Robert De Niro, Robert\nDuvall and the rest are all excellent in their respected roles.With a\nmovie this good, who knew the third one would not be as good as the\nfirst one at least? Highly recommended.<br><br>My rating: 10/10\n"},
{"review": "\nSeven years after the first film, Michael Corelone (Al Pacino)\ncontinues his family's quest to become legitimate. Also, more on his\nfather's growing up in Sicily and coming to America. With Vito being\nplayed not by Marlon Brando, but Robert DeNiro.) If you liked the first\nfilm, you will like this film. If you didn't, you won't. It's really\nthat simple, since you have all the same great people coming together\nfor this film with just as solid a script and acting as you did the\nfirst time. You lose Marlon Brando, but you get Robert DeNiro. I\nconsider that a fair trade.<br><br>This film has two things going for it: it has the early years of Don\nCorleone, which really fills in the missing mythos around the family.\nWithout this, the film would appear to show the Corelones were always\npowerful, which is far from the truth. It does not explain how Don\nCorelone grew to talk in such a mumbled voice, though.<br><br>Also, I really enjoyed the entire Cuba sequence, because it put the\nfilm in a historical time frame (and I like Cuba). I was never fully\nsure when the first film was taking place, but this one made sure I\nknew the years when Don Coreleone was growing up and that the present\nday was not 1974, but rather in roughly 1958-1959. That changed my\nperspective on things completely.<br><br>If you have invested three hours in the first film, invest three more\nin this one. Why only get half the story of Vito Corleone? I cannot\nmake any suggestions for part three, though, one way or the other.\n"},
{"review": "\nCritics to be better than the original artistically at least. I am\nstill not sure myself but they may be right. It continues the legacy of\nthe Corleone Family and digs into the roots of their criminal empire.\nThere are a series of flashbacks and that could be confusing to some\nand to be honest I'm not sure that was positive for the flow of the\npicture but who am I to criticize that. There is more violence here\nthan in the first Godfather and several scenes, like the original,\nfeature real life events. I personally like the first one better\nprobably because of Brando but I will watch both without reservation.\nPacino shines here as brightly as in the first one and DeNiro gives it\nsome much needed weight to replace or more accurately continue Brando's\ncharacter. It is also much sadder than the first in my opinion and\nshows the misery and depravity of young Vito's life and why he was what\nhe was. It is a true masterpiece.\n"},
{"review": "\n\nI hate being the lone voice of searing ridicule in a throng of glowing\nadulation, but I must say that I found the Godfather: Part II to be dull,\npredictable and pointless.  The Godfather is a wonderful film with a\ncompelling story arch of a good American war hero being pulled into the\ndepths of organized crime due to his loyalty to family.\nWhile Part II makes an attempt to elaborate and deepen this theme it\ndoes\nvery little to bring anything new to it.  Michael's loss of his family and\nthe fate of his brother Fredo is obvious by the end of the first reel.\nSuch\na predictable plot undermines what would otherwise be an interesting\nsequel\nto a great film.\nOnly the flashback scenes with Robert DeNiro as a young Vito Corleone\nhas\nany of the emotion and energy of the original Godfather.  If only the rest\nof the film was written and directed with such flair.\nI was so disappointed by The Godfather:  Part II that I haven't even\nbothered to see Part III and I have little interest in Coppola's other\nwork\nto this day.   \n"},
{"review": "\n\"It's not easy to be a son, Fredo. It's not easy.\" Is undeniably the\nbest sequel ever made and one of the best films ever made. First off,\nRobert De Niro's performance as the young Don Corleone completely owns.\nPure genius, pure craft.<br><br>Secondly, well it's Pacino, all Pacino. One pure example, at its best\nis when Diane Keaton's character confesses to him ' it wasn't a\nmiscarriage'' revealing that instead she had an abortion, so that she\nwouldn't bring him anymore sons into the world. Watch Pacino's face\nduring this entire scene!!!!!!!! Or the last flashback scene where\nMichael reveals that he has joined the Marines to the disgust of his\nfamily and such, at this time he had his own ' dreams' now, we simply\nwatch the price which Michael Corleone has paid himself for power.\n"},
{"review": "\nAbout six months ago I watched the Godfather Part I and to tell you the\ntruth I thoroughly enjoyed, It had good cast, good story but still not\nworth number two on IMDb's top 250 and technically every top 100 film\nlist on the web but still I must give it some credit. However today\n15.7.12 I layed my eyes upon the masterpiece of terrible films I mean\nit truly is shockingly boring. I kept waiting for something to happen\nand nothing ever did. <br><br>Robert De Niro's role: My second favourite actor of all time after Jack\nNicholson who does proud in practically ever film I've seen with De\nNiro in until today. I mean what in Gods holy name did he win an Oscar\nfor this pile of **beep** he wasn't even in half the film. Thoroughly\ndisappointed, no wonder he didn't appear at the Academy Awards because\nhe probably thought what the hell I am I doing winning an Oscar for the\nworlds most boring films ever. He probably felt embarrassed. <br><br>How people and watch that film and actually enjoy it is beyond me. I\ndon't think I am exaggerating either to be completely honest I only\nwatched the film to the end to see if Michael Corleone died to boy was\nhe getting on my nerves. <br><br>I sorry if I have offended anyones opinion but if you want to sit and\nenjoy a film watch Pulp Fiction which by the way on paper if one worse\nthat The Godfather Part II.\n"},
{"review": "\n\n\"The Godfather: Part II\" is one of the best sequels ever made, because it's\nso unlike other sequels.  It not only tells the ongoing story of Michael\nCorleone, but it also tells the story of his father's rise to being the\nGodfather.  Al Pacino superbly reprises his role of Michael, and Robert De\nNiro is, in one word, perfect as Vito Corleone.  Imagine not only learning\nyour lines, but learning them in Italian, and all the while trying to sound\nlike Marlon Brando.  If you can't imagine any one else besides Brando as Don\nVito, just check out De Niro's brilliant, Oscar-winning performance.  This\nis a must-see for any film fan, and especially any fan of the first\n\"Godfather.\"  I actually know people who prefer this sequel to the already\nfantastic original.  I can't say enough about this movie.  My one piece of\nadvice is see \"The Godfather: Part II.\"\n"},
{"review": "\nPathetic attempt, like other sequels, with all driven by greed.\nCompared to the original, this is totally disjointed, made for the\nmasses that heard of the original at the Oscars, and in the end\nunappealing, unmoving, stupid, and lacking in all atmosphere\nappropriately constructed in #1. I cant believe anymore was awarded by\ntheir fellow academy members for this trash. I cant believe Pathetic\nattempt, like other sequels, with all driven by greed. Compared to the\noriginal, this is totally disjointed, made for the masses that heard of\nthe original at the Oscars, and in the end unappealing, unmoving,\nstupid, and lacking in all atmosphere appropriately constructed in #1.\nI cant believe anymore was awarded by their fellow academy members for\nnever get back this tthis trash.\n"},
{"review": "\nOne of the best sequels of all time and the only Best Picture winner to\nbe the sequel to a previous one, this film improves on its absolutely\nbrilliant predecessor in every respect. Al Pacino is mesmerising as\nMichael Corleone and Robert De Niro gives a fantastic performance as\nhis father Vito Corleone in the prequel storyline, which won him his\nfirst Oscar. The character was very recognisable as a younger version\nof the Godfather from the first film but De Niro still managed to put\nhis own stamp on the role. Incidentally, Pacino is one of only two\nactors to be nominated for both Best Actor and Best Supporting Actor\nfor playing the same character, the other being Barry Fitzgerald who\nwas nominated for both awards for playing Father Fitzgibbon in \"Going\nMy Way\". The writing and direction are once again of an extremely high\nquality.<br><br>I've watched nine films which ran 3+ hours long so far this year and\nthis is one of the best structured of those. There is a not a minute\nthat drags. The two story lines are excellent and I loved the depiction\nof Michael's moral decay. My favourite scene in the film is the\nextremely powerful one where Kay tells Michael that she is leaving him\nand she aborted their child when she discovered that it was a boy as\nshe did not want to perpetuate the next generation of Corleones. I\nthink that Diane Keaton deserved a Best Actress nomination for the\nfilm. I was surprised that Talia Shire got a Best Supporting Actress\none as, while she is excellent as Connie, she has such little screen\ntime. Besides De Niro, the two strongest newcomers were Lee Strasberg -\nthe legendary acting teacher who taught Pacino, De Niro, James Dean and\nMarilyn Monroe, among many others - and Michael V. Gazzo. Both of them\nwere nominated for Best Supporting Actor but lost to De Niro. I thought\nthat Robert Duvall deserved one too as his performance was even better\nthan in the first film but I suppose that they needed to let other\nfilms get a look in!\n"},
{"review": "\nI had already seen this movie 2 times, but last weekend I could watch\nit in a cinema, and it was awesome. The movie is perfect in all\nsubjects, with incredible performances and a catching story.<br><br>It's nice to see how Coppola make us hate Michael for all the things he\ndoes, mainly the situation with Fredo. In this aspect, it's a opposite\nsituation if we compare with The Godfather: Part I. In the first movie\nwe love and respect Michael, and of course Vito, but in this film we\ncan't. It's sad to see how Michael forgot what was the most important\nthing for Vito, the family.<br><br>It's a masterpiece even without the first part. In fact, it's a movie\nthat make you feel a lot, even more than the first.<br><br>If in a strange moment of your life, you can have the opportunity of\nwatch it in a cinema, don't doubt.<br><br>PD: Sorry for my English, it's not my native language.\n"},
{"review": "\nThe first sequel to win the Best Picture Oscar, and deservingly so,\nwords cannot begin to describe how amazing this film is. Unlike the\nfirst (I'll admit, I'm not the biggest fan of the first film) which had\nseveral slow spots, GFII had me riveted from beginning to end. Pacino\nand Cazale turn in the performance of their careers, while Francis Ford\nCoppola, who co- wrote this with Mario Puzo, directs with such\nprecision. This film is truly a gift of cinema by all the talent\ninvolved. Everybody, even the smallest supporting actor, give terrific\nperformances. The pace is fantastic. The writing is brilliant. The last\nscene at the lake...chills! Watch this masterpiece NOW!<br><br>4/4\n"},
{"review": "\nI love this movie for of the very interesting scenario. I also consider\nthe actors playing, certainly amongst the best of their generation.\nDecors, costumes are also part of the reason I love it.<br><br>The fact it is about European immigrants in the US, makes it also\nbetter for European to watch, without it being one 100% US culture\nmovie. Also some points are true story, that makes it quite remarkable.<br><br>Overall, I can say that this movie is truly violent, but not as per\n2015 understanding. The violence can come in many ways. However, and\ndespite this aspect, this is quite one remarkable movie which deserves\nto stay up and high in the IMDb ratings.<br><br>The second part is maybe the best, but is actually really close from\nthe first episode, which in my eyes is actually on the same level.\n"},
{"review": "\nThe problem with Godfather II is that it goes a bit too far for the\nsake of false drama. It is like a kid who gets hit by a parent, cries\nand as he is crying he keeps thinking about how sad his life is and how\neveryone would feel sorry once he is dead, and the kid keeps getting a\nkick out of this self-made drama.<br><br>Without spoiling much, the main protagonist, crime boss Michael\nCorleone, eventually starts making moves that feel unnecessary, unless\nyou view them as a means by the writers of the story to create more\ncrime drama.<br><br>The story of Godfather II has some weak and some strong points. If you\nretrace the steps of the storyline after you finish watching the film,\nthey are not necessarily illogical but they do sit kind of loose in the\nplot. These plot points feel more like vehicles for specific dramatic\nscenes than a natural story. On the other hand, the story does provide\nsome great historical perspective on the history of the mafia and also\ngeneral commentary on certain social aspects of life.<br><br>Everything else about this film was pretty good. It is understandable\nhow this film reached its position as one of the top films of the last\ncentury.<br><br>The acting is top notch. In fact, it is what serves as the main course\nand the desert. You do not go to Godfather movies for action; you go to\nthem for the interaction between all these great actors. These shots\nare up close and personal, with strong dramatic shadows on characters'\nfaces. The experience is sort of like eating a good steak, no salt or\npepper needed.\n"},
{"review": "\nI enjoyed this movie tremendously. It gracefully blends two times: the\nfather's, who rises to power through his own forces, and the sons' who\ntakes care of his father legacy and increases his influence.Vito and\nMichael are to wonderful written characters, with both qualities and\nflaws. Also, the action is very captivating and i loved seeing Vito put\nthe New York's scum in their place ;) and revenge his father! Michael\nis very intense and, just like his father, does everything for the good\nof the family. Overall, this movie is definitely worth seeing and\ncompletes the first film perfectly. As Coppola wanted, they should have\nstopped here because the 3rd film isn't even close to the masterpieces\nthe 1st and 2nd ones are.\n"},
{"review": "\nWhat is there to be said about the sequel to what many consider to be\nthe greatest film of all time? \"The Godfather: Part II\" is a film\nunlike any other. From the seedy casinos of Nevada, to the revolution\nin Cuba, \"The Godfather: Part II\" chronicles the reign of Michael\nCorleone, acted to perfection by Al Pacino, over a massive criminal\nempire. Corleone's dealings with the manipulative and ruthless, but\nailing, Hyman Roth, depicted by the masterful Lee Strasberg, are some\nof the best scenes captured on cinema. Roth is a weary, weathered old\nman, but he more than holds his own against the young, ambitious\nMichael Corleone. And how does one describe the character of Michael\nCorleone? Is he an evil killer that cares only about power, and will do\nanything to achieve it? Or is he a reluctant son, trying desperately to\nget out from under the enormous shadow of his father, but assailed on\nall fronts by enemies old and new? Perhaps both. The story of Michael\nCorleone in this film is a tragic one, without doubt. But his is not\nthe only tale told in this masterpiece of cinema. The story of Vito\nCorleone, portrayed entirely in Sicilian by Robert De Niro, is\ninterwoven with that of his son, and it is arguably as potent. A young\nSicilian lad, orphaned by a violent Mafioso, Vito is smuggled off the\nisland and to America. There, Vito is met with oppositions and\nstruggles, and he overcomes them all to become the original Godfather.\nIt is truly a journey, and shows the adversity that crafted a giant of\na man.<br><br>\"The Godfather: Part II\" beats the odds, and somehow, in my opinion,\nmanages to be a greater film than its predecessor. It is a massive,\ncomplex, dark, tragic, ambitious film, and it succeeds in everything it\ndoes. 10/10\n"},
{"review": "\nPlease do yourself a favor, and don't watch this movie. It was long and\nvery boring, in fact I only got to the part with the kid singing to\nhimself before I had to turn it off. This movie was awful, which is\nsurprising considering the leads were Al Capachino, and John Calzone,\nboth highly regarded actors. But they couldn't save this crap movie.I\nthen woke up to the part with Boby Nero talking about a Roman empire\nwhich I found funny, bc Nero was an emperor. Overall this movie was a\ncomplete waste of time, and I was jealous of Frank Panini, in the tub\nkilling himself, because that was what I wanted to do during this\nmovie. I thought that the killing of Ross was stupid, as there was no\nway Rocco could've escaped Horrible 1/10\n"},
{"review": "\nThe Godfather: Part II (1974, Dir. Francis Ford Coppola) <br><br>It's the 1920's and young Vito Corleone (De Niro) moves to New York to\nhis life and new crime career, whilst in the future, his son Don\nMichael Corleone (Pacino) continues to further his father's legacy.<br><br>Francis Ford Coppola pulls off another epic classic which this time\nfocuses' on two different story lines. Al Pacino is just wonderful as\nalways to watch, but Robert De Niro gets a mention for his amazing\nperformance. The story remains at a steady pace and never goes off the\ntracks, making this a truly great film.<br><br>I trust these men with my life, Senator. To ask them to leave would be\nan insult. \u0096 Michael Corleone (Al Pacino)\n"},
{"review": "\nPart II in 'The Godfather' saga carries on in much the same vein though\nMarlon Brando is sorely missed. The plot has Al Pacino exerting\ncomplete dominance as mafia boss in the fifties. The film also depicts\nyoung Vito Corleone's (Robert De Niro) early years. This segment is\nslightly nostalgic but superbly acted by De Niro who won a Best\nSupporting Actor Oscar. As a result of the film moving both backwards\nand forwards in time, it feels more convoluted than the first part.\nRobert Duvall and Diane Keaton both impress. The shocking climax (MINOR\nSPOILERS) mirrors the ending of the first film. Highly recommended.<br><br>Overall 9/10\n"},
{"review": "\nUsually, a sequel is not as strong a film as the original. This one is\nevery bit as good. I am thankful to have just viewed the Coppola 2007\nrestoration of this film.<br><br>At well over 3 hours, it is longer than the original. What is does is\ndeftly fill in 2 stories that we saw small parts of in the first film.\nWe find out how the Don, Vito Cordleone got his name, what his real\nname is, and the history that made him who he was in the first film.<br><br>The second story fills in more about his kids, particularly Michael,\nand how he took over in the late 1950's and his battles with one of his\ndads enemies. The back drop moves from Nevada to Sicily, and then to\nHavana. Michael faces down a series of folks including a Congressional\nHearing about his life.<br><br>While this has no Brando, it has an excellent cast from the first film\nwith some additional folks added. James Caan makes a brief cameo at the\nend of the movie. Talia Shire &amp; Diane Keaton head up to female cast\nthough these films seems to have a cast of 100's because there are so\nmany parties &amp; events.<br><br>The film keeps with the same strength as the first film, strong\nstorytelling which brings you in and peeks your interest enough to keep\nyou going. When you watch this, your always wondering what is going to\nhappen next and who will get theirs.\n"},
{"review": "\nThe accepted wisdom about sequels is that they tend to be less good\nthan their predecessor as there is no story left to tell. The second\nGodfather is an embarrassment of riches in as much as there are two\nstories; the back-story of Vito Corleone's arrival in America and that\nof Michael making good his grip on the inherited business.<br><br>All the fine film-making that made the first so rich has been\nreplicated and improved in this most handsome movie. Again we begin\nwith a great set-piece (a Catholic confirmation) as a swarming\nexpository melange of character and situation but which takes its\nrather more sober tone from the film's prologue, telling of Vito's\nflight to America. The familial infections that poison this particular,\nwarped Italin-American dream are doubly intense given that Michael is\nnow the capo - where the threats of the first came from without, now\nthere is danger within.<br><br>Pacino's performance is first-class, never once resting on the laurels\nof his previous Oscar nomination. He is matched across the board by the\nrest of ensemble; Diane Keaton, Duvall and the twitchy Cazale are fine,\nand I've always been a fan of Talia Shire whose performance as the\nMichael's widowed sister is a magnificent, discreet study in\nintractable sororial bitterness and love. A deeply sad and violent\nmovie but one which never rules out the possibility of sympathy or\nredemption. An awesome achievement. 9/10\n"},
{"review": "\nThis, perhaps the greatest sequel ever, tells the parallel stories of\nMichael's struggles as the new Godfather and the rise of the legendary\nVito Corleone. The presentation of Vito's story is particularly\nimpressive, with DeNiro in a fine performance. Michael's story tends to\nbog down at times but never fails to be compelling. Pacino is terrific,\nas are Duvall, Cazale, and Strasberg. The cinematography is beautiful\nand Rota builds on his memorable score from the first film. Coppola\npushes all the right buttons, letting the stories unfold majestically.\nHaving made the two Godfather films by age 35, the talented director\nhad nowhere to go but down.\n"},
{"review": "\nthis is something. if you thought The Godfather was special, brace\nyourselves, because The Godfather Part 2 is the greatest. Everything\nabout this movie is perfect. the directing is brilliant. the way\nCoppola was able to weave two tales using only flashbacks was just\ngroundbreaking. the acting, well it speaks for itself. De Niro won an\nOscar for-this, and was richly deserved, but Pacino puts in the\nperformance of his career, Duvall features much more and is marvelous.\nCazale is picture perfect as the shaky Fredo. Bruno Kirby was my\nfavourite as the straight talking Clemenza. All I'm saying is that this\nmovie can do now wrong. the simple message of this movie is that of a\nman who has a firm grip on his job. but is losing his grip on his life\n"},
{"review": "\nMaybe the greatest difficulty may have been to follow up a movie like\nThe Godfather, possibly the greatest movie ever, and Francis Ford\nCoppola did an excellent job, most pretty good originals have a poor\nsequel, but how do you make a sequel to an almost perfect original.\nWithout Marlon Brando, Al Pacino fills the big shoes as the Don in this\nmovie, along with Robert Duvall, and flashbacks to a young Vito played\nnone other than by Robert De Niro. This movie shows the rise of Vito\nand how he became so powerful, and gives you background on his\nupbringing and family. It also shows you how much different times are\nand how Michael handles current situations. I read somewhere that they\nasked Marlon Brando to come back for the second even though he passed\nin the first he probably would have done some flashbacks and It upsets\nme that he didn't do that, but then again who knows how it would have\nturned out, If that happened maybe they wouldn't have cast De Niro and\nwould never have had the career hes had. So i guess everything happens\nfor a reason. The Godfather Pt II is a great film and falls so close to\nthe original.\n"},
{"review": "\nI remember saying in my review of \"The Godfather\" that i was going to\nreview this film a week later, that was more than one week ago that's\nfor sure. I did actually start watching \"The Godfather Part II\" the\nnext Friday, though i stopped watching after an hour because i wasn't\nreally in the mood for it! So i decided that today, with nothing else\nto do, i'd give it another try and i wasn't disappointed! It was a\ngreat film, lots of talking but it's still great fun to watch. <br><br>I only have one criticism, the length. It was extremely long, about 3\nand a half hours! But that's my only criticism, everything else was\nspot on! Hopefully i'll be watching \"The Godfather Part III\" soon and\nas soon as i do, i'll post my opinion right here! <br><br>So overall, \"The Godfather Part II\" is just as good as the original\nGodfather If you haven't seen this film yet, watch it now!<br><br>9/10\n"},
{"review": "\nIt's only a sequel because of the Part II thing. This simply fills in\nthe spaces with one of the greatest characters of all time. Remember,\nthe two were put together in an incredible sage, putting things in\nchronological order. Talk about your psychological studies. Inside the\nhead of Michael Corleone is a sense of power at all costs. Yet, he sees\nhimself as a moral man. I wonder if one could look at organized\ncriminals like one might look at a mideast country, because they have\ntheir own principalities, their own history, almost their own religion.\nThey have parceled out their land and protect against invaders. They\nfear and react to threats from the outside, from \"non-family\"\nmembers.The product they sell is terror. Of course, all participants\nlive on the edge. Their human failings are dismissed and magnified as\nweakness and disloyalty. Brothers kill brothers. <br><br>I haven't a lot to add because I am not a film expert. As uncomfortable\nas this film makes me (like the first one), I continue to watch. And in\nmy heart of hearts I wonder if I were cast into this setting, could I\nstand up to the expectations of my culture?\n"},
{"review": "\n...are included in Part II. This movie gives you the backstory of Vito\nCorleone's rise to power, from the time his father is murdered in\nSicily until he \"makes his bones\" and creates his own empire in the\nUnited States. Robert DeNiro is very convincing as young Vito Corleone\nin what was, if memory serves correctly, is his big screen debut. I was\nalmost convinced he was somehow related to Marlon Brando, he had the\nvoice, the looks, the mannerisms, everything. Couple this with another\nstory not included in the book of betrayal within the family while\nMichael tries to make a move in pre-Castro Cuba and you have a sequel\nthat is every bit as good as the original. Michael has been stripped of\nall his humanity in this story, and he comes across as being a cold and\nheartless human being, one who would even have his own brother killed\nto preserve his nefarious empire. The ending is heartbreaking because\nhe realizes that he lost his family trying to save it. And the\nsoundtrack in this movie is even better than the original GODFATHER\nsoundtrack. For the third time, I'm going to give a perfect 10 to this\nmovie.\n"},
{"review": "\nI got the privilege to watch this film for the first last a few days\nago. This has to be my favorite film of all time, along with one of the\nbest films that I have ever seen.<br><br>The movie does very well in shown two different two stories in one\nmovie. You have Michael's story of which shows his struggle in\ncontrolling one of the most powerful crime families in the United\nStates. The second story is Vito Corleone's struggle as young boy in\nSicily growing up and coming to America, and his start of the Corleone\ncrime family.<br><br>This is a long film to watch, it took me a few days to watch it, as I\nwatched about 30 to 40 minutes at a time.<br><br>All of the actor and actresses preformed there roles very well, and the\nactors and actresses who got Oscars for their roles in this movie were\nVERY WELL deserved. Robert De Niro does one of the best acting jobs I\nhave ever seen in film, in my opinion one of the best actor's in 1974.<br><br>The script is well written and for the most part is easy to follow.<br><br>If you seen the first film, which is a must to understand this film,\nthen you will like the second one, which is one of the best films of\n"},
{"review": "\nThe Godfather II, in my opinion, is just as good as the first. So rare\nis it for a sequel to be as gripping and as well-made as this movie is.\nFirst off, I have to mention the excellent musical score. It gives the\nfilm a sort of dark, moody atmosphere, and I think it was a very good\nidea to use the same score as in part I. Secondly, the idea of inter\nwining the story of Michael Corleone and of his early father Vito was\nbrilliant and makes this sequel stand out from the first part. This\nidea of showing two stories in one film could have been quite risky and\nconfusing but Coppola did a fantastic job at it. Both stories are very\nclear to follow and show the contrast between Vito and his son's way of\nhandling the family business.<br><br>Of course, I cannot comment on this movie without mentioning Al\nPacino's awesome performance. He definitely should have won the best\nactor's Oscar for that role. He has unbelievable screen presence and\nplays incredibly well the ruthless, suspicious Michael Corleone. The\nmost poignant scene of the film, in my opinion, is definitely the one\nwhere Michael finds out at the party that his brother Fredo betrayed\nhim.\n"},
{"review": "\nThe Godfather part II is a fantastic sequel and a great follow up to\nthe original. Most sequels are not as good as the original, some are\nplain rubbish. But The Godfather part II is rare because it is just as\ngood as the original (some reviewers say it is better than the first\nbut i don't think so). The performances are brilliant just like in the\nfirst. Robert de Niro plays a young Vito Corleone. showing the young\nlife of Vito in the 1920's While Michael tries to extend the family\nbusiness in the 1950's. The godfather part II is a must see for fans of\nthe original,what a must buy for fans of the original. fans of the\noriginal will love 10/10 definitive crime film. Thanks for reading.\n"},
{"review": "\n\nThis movie accomplishes what very few sequels ever do, it rivals its\npredecessor in quality.  This film doesn't hit a wrong note at any point. \nAll performances are excellent and there isn't any problem switching back\nand forth between the early 1900's and the mid 1900's.  It flowed so well. \nI can't argue with the top 3 rating given by IMDb users.\n\n"},
{"review": "\n\nOften seen as possibly a greater film than even \"The Godfather\" this film\nis\ntruly remarkable. Part of the film is a pre-quel, with Robert De Nero\nplaying a young Marlon Brando (is that a dream casting or not?) partly\nit's\nthe story of Michael Corleone as he grows into the role of Godfather.\nAgain\nbrilliantly filmed, great acting, a great story of love revenge etc. but\nin\nsome ways it's harder to sympathise with Michael as he slips further into\na\nhell of revenge and murder. Like watching a car-crash.\n\n"},
{"review": "\n\nI was compelled by the storyline &amp; performances therein but at the end of\nthe movie I just didn't get it. It was to much a misch-masch of stuff &amp; I\njust didn't get much out of it.<br><br>Godfather 1 is the definition of a film, a true classic. This is a sequel\nwith mixed-bag emotions. I think it's something of a let-down. Not a huge\none, but yeah. It is a let-down.\n"},
{"review": "\n\nsomeone made the comment that he didn't understand why the flashbacks to\ndon\ncorleone's rise to power (with de niro as don vito) were included, that it\nromanticized the Mob.  i think the reason that we have the 2 stories is\nthat\nthey parallel each other.  while we are seeing how michael corleone is\ndeveloping as a mob boss and as a man, and what forces are shaping him, we\nalso see the same things in his father's early life - how don vito reacted\nto events, how he made plans and how he became the man he was.  although\nboth men lived a life of crime the difference in the two is striking and\nreal - don vito worked his way out of poverty and immigration and tried to\nhelp his fellow italians in a way that seemed to work for him.  don vito\nnever lost his sense of caring for people in general and that they depended\non him.he never lost his love for his family.  he never lost the common\ntouch, the things that would endear a man to a community and win their\nloyalty.  when we look at michael in his criminal growth we see he becomes\na\ncompletely different man - cold, ruthless, uncaring and increasingly\nisolated both from his family and from the greater community.  don vito\nactually served, however wrongfully, a purpose in his community and did\nsome\ngood - he provided political and financial assistance, and a basic justice\nto many people who would have been denied it otherwise.  michael corleone\nhowever is just a nasty, vicious, unfeeling, opportunist who does not have\nthe same human touch his father did. and i think that is the main\nrevelation\nof the 2 movies and why we have the flashbacks.  frankly i prefer the first\nmovie, and the flashbacks in the 2nd movie - don vito was a better\nman.\n"},
{"review": "\nThis is the weak middle part of a not so hot trilogy. \"The Godfather\"\nwas great, this one was okay and \"Part 3\" was bad. \"Part 2\" is too long\nand often uninteresting. The scenes between Michael and Kay drag the\nmovie to a halt. The storyline between Michael and brother Fredo plays\nout in an unbelievable way. Despite all the famous lines, the scenes\ndon't ring true. Michael hates Fredo inside at the ball but wants to\nsave him minutes later on the street. Only to hate him again when they\nget home. And they constantly refer to Marlon Brando. They must say\n\"Papa\" or \"Pop\" 40 times. Constantly reminding the audience that the\nfirst movie was better is not a good move. When I was a kid I wanted\n\"The Towering Inferno\" to win Best Picture because I thought it was a\nbetter movie. I still do. \"Chinatown\" should have won that year.\nCoppola's own \"The Conversation\" is also a lot better than \"Part 2\" and\nwas a worthy candidate for the award.\n"},
{"review": "\nFrancis Ford Coppola directs the sequel of \"The Godfather\" the \"The\nGodfather: Part II\". \"The Godfather: Part II\" is a movie that show us\nthe history of Corleone family and also show us how Vito Corleone\nattempts to expand the family business into Las Vegas, Hollywood and\nCuba.<br><br>In this movie you will see an another perfect performance by Al Pacino\nas Michael Corleone (nominated for Oscar as Best Actor in a Leading\nRole) and Robert De Niro as Vito Corleone (won the Oscar for Best Actor\nin a Supporting Role). An another good performance made by Robert\nDuvall as Tom Hagen. <br><br>\"The Godfather: Part II\" is a really good movie but is a little lower\nthan the first movie that explains my title \"Touching perfection...\",\nbut it continues to be the best sequel of all times.\n"},
{"review": "\nIt's difficult to imagine that \"Godfather II\" could trade punches with\nthe original and still remain standing, but this is one brilliant film.\nMasterfully tracing the history of the Corleone Family from Vito's\narrival at Ellis Island in 1901 to the Lake Tahoe empire of 1958, the\nstory is a decades spanning saga that makes you wonder how almost three\nand a half hours can blow by so quickly. The picture's numerous\nflashback scenes work well to establish the beginnings of Don\nCorleone's rise to power, and Robert de Niro's portrayal of the young\nVito effectively allow us to forget about asking why Marlon Brando\ndidn't show up even once. Pacino is no longer the fresh faced kid home\nfrom the military who takes up the family business, but the brooding,\nbrutal leader of a crime syndicate with a chessboard strategy of\nstaying two and three steps ahead of his enemies at all times.<br><br>If you haven't seen the movie in a long time, you might be surprised\nlike I was while watching today. It's easy to recall the highlights\nlike Frank Pentangeli's courtroom scene and subsequent suicide, and the\nway Fredo met his timely demise. What I had long forgotten was the way\nthe picture opens with the Sicilian back story, and the way the New\nYork neighborhood flashback thread literally runs throughout the entire\npicture. It's funny how I recall those scenes as a single sequence\nleading up to the murder of Don Fanucci, but it just goes to show you\nhow faulty memory can be.<br><br>You know, it's hard to believe that the first two Godfather movies are\nnearing the forty year mark since their original release. They've\nbecome American classics that have well withstood the test of time, and\nwill continue maintain their appeal. It's fair to say that seeing both\nof these iconic films are a must for the true cinema fan.\n"},
{"review": "\nYou're not allowed to dislike this film either. This is a massive\nachievement in every possible sense. Indeed, there is little that\nrivals these two films in opulence or production scale.<br><br>Coppola doesn't shy away from trying new things. Michael Corleone's\nstory-arc is more realistic, more ambitious than anything in the first\nfilm. The scale of crime is upgraded. And I had never expected to see\nthat scene between Michael &amp; Kay, where she tells him of her departure,\n\"because of this 2000-year-old Sicilian thing.\" Vito Corleone's\nbackstory follows the earlier, more conventional combination of style\nand myth. Actually, Coppola makes Vito's arc too obvious, as though\nhe's following a checklist. But again its very tastefully done, so you\nenjoy it.<br><br>I guess what this film lacks is a simpler plot and the phenomenal\npacing of the first film. Also missing is the magisterial presence of a\ncertain Marlon Brando. It is easier to appreciate this film when you\nplace it together with the first, as one single epic of the rise of one\nMafia generation, followed by the decline of another.\n"},
{"review": "\nIn my opinion this is the finest of the crime genre ever made. It is\nthoroughly compelling from start to finish and the fastest three hours\ni can remember spending. Every aspect of the film is virtually\nflawless; plot, cinematography and in particular the acting. Pacino and\nDe Niro are amazing in their respective roles and one can only look on\nin awe at the levels of believability in the characters that they\nattain. Although i would not consider De Niro's performance to be the\ngreatest of his career as i think he achieved even more in his\nportrayals of Travis Bickle in Taxi Driver and Jake La Motta in Raging\nBull; for me this is Pacino at his best. The camera work in the\nflashback sequences chronicling the early life of Vito is stunning and\nwould make you think you are looking at a picture from the twenties.\nThere is obviously a lot of debate as to which is the better film, this\nor its predecessor, but i consider this to be superior as it holds the\nviewers attention more. An absolute Classic. 10/10\n"},
{"review": "\n\nAn excellent follow up to the original, The Godfather Part II continues\nwhere the first film left off and explores the rise of Vito Corleone in a\nseries of flashbacks that, for the most part, correlate with what is\npresently happening to Michael Corleone (Pacino) his son and successor. \nThis is a beautifully produced piece of film, and while I still prefer the\nfirst installment, simply because of the story content, it is every bit as\ngood.  This film is best when watched together with the first film \u0096 if your\nbody can stand it.  Even better, watch the third one as well for a little\nclosure and so you can argue over whether it's a good film or not.  (I\nmyself personally like the third film, but not as much as the first\ntwo.)<br><br>--Shelly\n"},
{"review": "\nThe Godfather part 2 gets very close to the title for best sequel ever\nmade, but not quite. Even so, I would rank this among the superior\nfilms to follow up on another and still be as strong and appealing and\ndramatically satisfying as the former. The structure of the film is\nalso very important as it jumps back and forth between two stories of\nCorleone's without any disconnected feelings for the audience. Both\ncould work as perfect single films on their own; together it's like a\ndouble album of the dark side of crime and the perilous nature of\nrising up in America as an immigrant. It's spectacular in many ways,\nmasterpiece in fact, and has become as important as the first one (it\nis the only sequel to win an Oscar for best picture in those terms) and\nthe acting all around is well-knit (even the pioneer himself Lee\nStrasberg is on hand as Roth), the score is possibly better in some\nways to the first film, and most of the scene work is fantastic. <br><br>One thing that attracted me to this film is also what I believe is one\nof the all-time great breakthrough performances in any film, as Robert\nDe Niro as Vito Corleone has all of that confidence as an actor without\nchanneling too much Brando. If there would be one reason to see the\nfilm and recommend it it would be because of him, as he gives one of\nhis tour de force career turns in that streak of one after another in\nthe 70s. Pacino is practically as good with enough lines that are\nrealistically grounded but also highly quotable at times (the \"in my\nhome\" bit is priceless). John Cazale, by the way, is also an element to\nmake the film work as one of two performances that he'll be remembered\nfor twenty years down the line (the other being Dog Day Afternoon). In\nshort, it's just a very well done picture.\n"},
{"review": "\nTo those who say The Godfather glorifies the mob, I say watch both Part\nI and II in tandem. Observe where Michael Corleone begins and where he\nends: he begins as the idealistic war hero, refusing to get involved in\nthe family business, but he is quickly engulfed by circumstance and\nslowly transforms into a cold and ruthless underworld boss. The\nrecurring theme of solitude is persistent throughout the film. Michael\ntrusts nobody, and his instinct is ultimately proved correct when he\nlearns Fredo has betrayed him. In the end, he is completely alone. He\nhas destroyed his marriage, he has alienated his consiglierie, and he\nhas murdered his brother. From this perspective, the story of the\nGodfather is a classic tragedy. The final shot solidifies this notion,\nshowing Michael sitting alone, reflecting on his life. By trying to\nprotect his family, Michael has destroyed it.\n"},
{"review": "\nI am not lying when I say this is the best movie ever seen. Just as the\nother movie, everything is excellent, a piece of art; the directing,\nthe acting, the screenplay, the soundtrack, the production, the costume\ndesign, the script, the film editing, etc. But, what makes this movie\ndifferent from the other one? that made me like this one even more..\nSimple, that beautiful constant flashback; of when it all started, of\nhow Vito achieve that much power to have the last name Corleone so\npopular along anyone who is involved in the mafia; and then it takes\nyou back to the present, with Al Pacino's awesome performance of\nMichael as the new Godfather; that incredible screenplay was what catch\nme, it made me fall in love with this movie. A classic that is worth\nwatching every minute of it, because each single part of this movie is\nexcellent.\n"},
{"review": "\nAll of this makes the movie great and infinitely watchable. But it's\nwhat's deeper inside this film ... what it is really about ... that is\nits true genius.<br><br>The Godfather Part II is not really a movie about the mafia, it is a\nmovie about a man's life long struggle. Michael controls a vast empire\nthat is constantly slipping out of his hands. He grows increasingly\ndistrustful and paranoid, and even shows signs that he hates his own\nlife. Michael almost seems to resent the fact that he is a natural born\ncrime lord, a man who puts the family business ahead of everything.<br><br>The great Don Michael Corleone can never come to terms with one simple\nfact.... his father's empire was built on love and respect, Michael's\nempire is built on fear and violent treachery.<br><br>See this movie. It's three-and-a-half hours very well spent.\n"},
{"review": "\nThis movie made me want to be an actor in my middle age. I saw the film\nyears ago but never in the same light as I did a few years ago. Al\nPacino and Marlon Brando are superior to all others in this film. And\nRobert Duval is timeless. If you can take time to notice the camera\nangles and shots. Perfect! Filming in NYC! The best! I always wondered\nwhy there not more killing scenes as they were deadly.<br><br>The director Francis Ford Coppola is incredible! <br><br>This is what film making is all about!<br><br>Cant wait until my turn!<br><br>It is NEVER TOO LATE TO START!<br><br>I am 48 y/o and Salina P is my first movie! <br><br>I promise you will see more!\n"},
{"review": "\nWith the perfection of the first Godfather film it would seem\nimpossible that the sequel could match up. But such is the genius of\nFrancis Ford Coppolla that it is considered by many as the greatest\nsequel of all time and many of those same people even consider it to be\nbetter than the first.<br><br>I for one do not agree, at least not about it being better then the\noriginal, however I find it difficult to dispute the claim that it's\nthe best sequel of all time. The impossible job of proceeding Marlon\nBrando as the Godfather fell on the shoulders of Robert De Niro. He\nlater went on to win best supporting actor, proving the impossible to\nbe quite possible for someone of De Niro's talents. Brando and De Niro\nbecame the first actors to win Oscars for performances of the same\ncharacter. De Niro's performance as a young Vito Corleone was the\nhighlight of the sequel and it was genius from Copolla to move the\nstory backwards as a pose to moving in a linear fashion.<br><br>Another masterstroke from Copolla was the rise of Michael who becomes\nthe Don of the family. We see Michael become a man and bypass all his\nbrothers straight to the top of the family. It's almost a romantic\ntwist in an otherwise pretty gritty and dark story.<br><br>I would put the first and second Godfather films right up there with\nthe best of all time, perhaps even in first and second place. You\nsimply can't call yourself a film buff and not watch these films. 10/10\n"},
{"review": "\n\nIt doesn't happen very often, but now and then a sequel - if you can call\nthis film such a thing - ends up improving upon the themes and dramas of the\nfirst film. In this second slice of Corleone murder, intrigue and family\nties, one misses Brando for about five minutes, and then Pacino takes the\nscreen in what must surely be the finest piece of acting he has ever done.\nAn Oscar for Scent Of A Woman? Typical blindness on the part of Academy\nvoters, because Pacino blows everyone else away with just a look of hatred\nand coldness from his eyes, and by the way he reacts on the screen. By the\nend of the film he looks like a 20th century Richard III, complete with a\nblood-red shirt and a pale, almost lifeless face. Coppola, already scoring\npoints that year for his excellent conspiracy drama, The Conversation,\ndelivers what is, in my opinion, the best ever film made between the years\n1970- 1979. In short, from start to finish, this film is totally\nmesmerising. DeNiro steps into Brando's shoes as the younger Don in a\nwonderfully evocative recreation of New York in the early part of the\ncentury, and yet come his last scene you will have no problem in believing\nthat this will be the man who, in twenty years time, would grow up to be\nMarlon Brando in The Godfather. Twenty-eight years of meatier gangster\nflicks (Goodfellas, Once Upon A Time In America) have failed to erode its\npower and undeniable genius. This is because The Godfather part two is like\nevery other classic work of cinematic art - it never ages and its power will\nnever fade. Alas, a third part helped to remove some of its shine, but only\na tiny part. A third chapter wasn't really nessecary - The story of Michael\nCorleone ends right there - on Lake Tahoe.<br><br>Movies like this come round once every decade, so do yourselves all a big\nfavour and sit down for 200 minutes and indulge in a brilliant movie\nexperience. You'll thank me later!<br><br>10/10!<br><br>\n"},
{"review": "\n\nIn these days when Lord of the Rings (FOTR) hit the box office and\nfantasy cinema is having its second peak after Star Wars, the best thing\nthat a person who hate fantasy should do is watching this movie.<br><br>Godfather part II shines with the actors. De Niro and Pacino are on\ntop\nof their undeniable talents.\nThe most striking two things about the movie except great directing\nand\nacting, are the story of a father and son simultaneously (showing them\nnearly at the same age) and the great story that includes shocking moments\nlike murder of Don Corleone (DeNiro) or his revenge after coming back to\nhis\nhometown after years.\nWhat can I say, it worths every minute you spend and it is better than\nGodfather Part I...\n"},
{"review": "\n\nOnce again Al Pacino plays his character very strong.\nAlso the rest of the cast, like Robert DeNiro and \nRobert Duvall, playing their roles beautiful. \nNot as good like the first part, but still a great film. 9 out of 10.\n\n"},
{"review": "\n\none of the best movies i have ever seen.from start to finish it proved the\nperfect follow up to the original.francis ford coppola proves once again\nwhat an amazing director he is.\nthe only problem i had was i became more interested in the rise of don\nvito\nsuch was the performance of  de niro.\n"},
{"review": "\n\nWhat makes this movie phenomenal is the performance by pacino . Famously\nhospitalized for exhaustion after this movie . His Micheal Corleone is a\nmasterpiece fo characterization and undoubtedly the greatest performance\never . Do yourself a favor and watch this movie SOON !\n\n"},
{"review": "\n\nWith THE GODFATHER, director Francis Ford Coppola gave us perfection. How\ncan that be topped??? THE GODFATHER PART II is actually two stories in one:\nthe story of young Vito Corleone and his rise to power and the continuing\nsaga of Michael Corleone's (Vito's son) rule over the Corleone\nfamily.<br><br>The film begins in Sicily at the turn of the century showing how the\nnine-year old Vito Andolenni (soon to be Corleone) is sent to New York. The\nfilm then switches to the extravegant party for Michael and Kay's son, Tony.\nAt the party, we learn of the dealings between Michael and his prospective\nbusiness partner, Hyman Roth (Lee Strassburg), who had done business with\nhis father. <br><br>The cool thing about THE GODFATHER PART II is the fact that they are telling\ntwo stories in one. It never gets confusing and both stories keep your\nattention. It is a much more darker film than the original with an extremely\nshocking ending. Normally, sequels do not equal the first movie with the\nexception of THE EMPIRE STRIKES BACK, SUPERMAN II and THE GODFATHER PART II.\nThis is a can't miss film, which was worthy of the numerous Oscars it\nreceived.<br><br>My recommendation for anyone who has not seen THE GODFATHER or THE GODFATHER\nPART II is to watch THE GODFATHER: THE COMPLETE EPIC, which tells the story\nin chronological order. Do yourselves a favor though and bypass THE\nGODFATHER PART III. The Godfather Saga ends with Part II.<br><br>\n"},
{"review": "\n\nEasily Francis Ford Coppola's 2nd best movie (OK maybe rivaled for that\nhonor by \"The Conversation\") and #1 IS NOT the Godfather.  \"Apocalypse Now\"\nforever of course. BUT Godfather II delivers on all the promises made by\npart one and then some.  The film offers standout performances. sumptuous\nsets that span almost a century and two continents. The sweep of the story\nis fantastical the acting is in depth the structure a balanced homage to the\nprinciples of part one but far more polished. Get with the program. sure,\npart one is a great action movie, but this is pure cinema\ngold.\n\n"},
{"review": "\n\nImpossible to believe that the second movie could be as engaging as the\nfirst. The casting of young Don Vito was outstanding, with DeNiro\nportraying\nthe mannerisms to a magnificent performance.<br><br>One of the outstanding movies of our lifetime.<br><br>\n"},
{"review": "\n\nWe all know that this is an incredible movie adn the greatest sequel but\nthis movie also has the greatest performance of all time in Al PAcino's\nMicheal . I have never seen any actor use his eyes to such devastating\neffect the way PAcino does and i have yet to see Pacino ( or any other actor\n) better this performance . \n"},
{"review": "\n\nPersonally I think that this is the best movie Francis Ford Coppola has\never\nmade. But I personally see the Godfather triology as ONE masterpiece. And\nI\ncan honestly say that this is the best movie ever made when it comes to\ndrama films. I mean this is the reason why I started to watch movies in\nthe\nfirst place!<br><br>The ONLY grade you can give this movie is 10/10!!! Anything under that is\nan\nact of war against REAL movie lovers.<br><br>Sign: ZooR\n"},
{"review": "\n\nI am in love with all the Godfather movies and think Francis Ford Coppola\ndid a fantastic job. One of the unique characteristics of this movie that\nseparates it from the other two is the fact that is switches from Don's\nchildhood to his adulthood. Robert DeNiro is awesome as well as Al Pacino.\n\n"},
{"review": "\n\nThe Godfather Part II surpasses the original (no mean feat!). DeNiro is a\nrevelation as the young Vito and how fitting that he should be the one to\nportray Vito and take up the baton from Brando. Symbolism anyone? Two of\nthe\nfinest actors of their respective generations and Al Pacino giving a\nperformance he has yet to better. What more do you want? The scenes shot\nin\nSicily look sumptuous and the period scenes are also extraordinary (check\nout young Vito going across the rooftops to take out the local Godfather\non\nthe stairs)Fine, fine support from John Cazale as Fredo, Diane Keaton as\nKay\nand Talia Shire as Connie deserves a special mention. This film is a\nclassic\nand if you haven't seen it yet you'd better have a good excuse. Why is it\nonly rated 8.9??!! \n"},
{"review": "\n\nIn this sequel &amp; partial prequel to the 1972 masterpiece,Michael Corleone\nslips deeper &amp; deeper into the mafia.Pacino gives a masterful\nperformance,while De Niro won a oscar for playing a younger Vito.Brilliantly\nfilmed,it won multiple oscars.Lee Strasberg plays the head of a rival\nfamily.<br><br>Rating:***** (Out of five)\n"},
{"review": "\n\nThe first godfather was one of the most special films ever produced, but\nthe\nsecond is a sequel and a prequel mixed into one spellbinding three hour\nmovie event.  The fact that Robert de Niro played a young Marlon Brando is\nironic as the young de Niro was fast claiming the crown as one of the best\nactors of that or any other generation.  The detail in the locations and\nset\ndesign is immense and well worth a closer look.  The acting is amongst the\nfinest ever seen on the screen and the direction is simply out of this\nworld.  Overall, one of the greatest films ever made, with an ensemble\ncast\nand script to match.\n"},
{"review": "\n\nI am completely amazed by this movie, it is about as perfect as a movie can\nbe in my opinion. The acting is first rate, the story is compelling and the\ncharacters are unforgettable. This movie to me is better than \"The\nGodfather\" and can stand alone as an individual feature. Also the music is\nsome of the best in cinema history. All in all one of the cinematic\nlandmarks in American history. I can't wait to see it on DVD!!! 11 out of 10\nstars\n"},
{"review": "\n\nThe movie is so captivating you are entrenced from beginning to end. The\nfilm chronicals the young life of Don Vito Corleone(Robert De Niro)and the\nassension of the mafia empire in the 1950's by his Michel(Al Pacino)The\nfilm\nis just as captivating as the original and gives you a stroll through\nLittle\nItaly at the turn of the century.In all the greatest Mob/Drama of all\ntime.\n"},
{"review": "\n\nWhen you compare The Godfather to The Godfather, Part II, the only\ndifference between the two films is the cast.  There is no James Caan and\nMarlon Brando. Now, that doesn't make the movie worse, as most people would\nthink.  The storyline is interesting, yet very sad, although this movie is\nexcellent, it is very sad.  The Godfather, however, is inspiring due to\nMarlon Brando's beautiful and incouraging acting.  Therefore, Al Pacino has\nto act twice as hard, and he's a great actor.  He does a fantastic job. \nEvery scene he acts he acts with passion and courage.  Vito Corleone's\nchildhood is also great, although the adaptation in the 1970's of The\nGodfather and The Godfather Part II, was called, The Godfather, A Novel of a\nmovie, (I think).  I watched that and it was the two Godfather's combined\ntogether.  Vito Corleone's childhood from Part II is combined at the\nbeginning of the movie.  Amazing and terrific.  Definetly worth\nwatching.\n"},
{"review": "\n\nThe Godfather II is regarded as the only sequel to be as good as its\npredecessor. My opinion is that it is far better.<br><br>The story focuses on Michael Corleone, the new Godfather, and flashes back\nto tell the tale of his father Vito as a young man. These two characters\nare\nportrayed brilliantly by Al Pacino and Robert De Niro.<br><br>The performances are great on all accounts, as is the direction.<br><br>With this film I found I couldn't take my eyes off the screen. The story\nseems overly complicated at face value, but I found I understood more than\nI\nthought I did. And it was great.<br><br>I thought I'd not enjoy the film a second time round, but no I still loved\nit.<br><br>This chapter in the Corleone saga is better than its predecessor and Part\nIII because of so many reasons. Part I I feel was not as interesting, and\nthat Marlon Brando's Vito (many will disagree) was not as intriguing a\ncharacter as Michael, or even De Niro's Vito.\nPart III was a decline in the trilogy while still a worthy end (in other\nwords it fell short of Return of the Jedi as 'best final episode of a\ntrilogy'. So much had happened between II and III that wasn't explained in\ndetail and seems that it may have been pivotal - even Robert Duvall's\nexcellent Tom Hagen character was just implied as dead, and no more so.\nWhere's the 'closure' you US folk are on about (no offence)?<br><br>Anyway I think the three films are all amazing, but II stands proud among\nthem all as the best of the lot, and the best film of all\ntime.\n"},
{"review": "\n\nIf you want to see the most intense actor in cinematic history give the most\nintense performance in cinematic history look no further than this movie .\nPacino is absoulutely magnificent as a tightly coiled don and creates the\ngreatest character ever portrayed by any actor ever . Watch this movie\n!\n"},
{"review": "\n\nThis is one of the few sequels that is considered equal or better than the\noriginal.  The Godfather part 2 is the only sequel to win an Academy Award\nfor best picture!  This comes in a close second in my books for best movie\nright behind part 1! Part 2 lacks Marlon Brando, James Caan, and the\nenemies\nof part 1.  This companion piece jumps between the rise of Vito during\nprohibition and Michael running the family in the 50's.  There are many\nbeautiful scenes in part 2.  The most beautiful scene in my opinion is at\nthe wake for Michael's mother and when Connie begs Michael to see his\nbrother Fredo begging him to forgive him and when Michael walks through the\nhouse to Fredo and they hug each other.  That scene has brought me to\ntears.\nUndoubtedly the best sequel of all time!<br><br>10/10\n"},
{"review": "\n\nAlthough I feel The Godfather is the better movie (only slightly, I might\nadd), I actually prefer this to the original. Not only is this the greatest\nsequel ever, but one of the greatest movies ever. The Godfather II is more\nentertaining and more compelling in my opinion. What really makes this great\nhowever are the parallel story lines following Michael Corleone and a young\nVito Corleone, played flawlessly by Robert DeNiro. As with the first\nGodfather, the ensemble acting is superb, especially from Pacino and the\naforementioned DeNiro. This is simply put about as good as movie\nentertainment gets. 10/10\n"},
{"review": "\n\nFABULOUS!  I've never seen Al Pacino or Robert DeNiro portrayed\nin this way before - they were absolutely magnificent.  I\nstill\ncan't get over the fact that Godfather:  Part II is indeed\nmuch\nBETTER than the original!  :)  Watch it!\n"},
{"review": "\n\nI've lost count of the number of times I've watched this film in awe\nrewinding the vcr to catch scenes again.  It is one of the few films\never to have made an indelible mark on popular culture with it's\nscript even being referenced in the tv mafia drama \"The\nSopranos\".\nAl Pacino's performance is unbelievable emanating the coldness\nof death that is alluded to in the novel.  Pacino is able to build upon\nthe script to make Michael Corleone one of the greatest characters\never seen on celluloid.  His performance alone is worth watching\nby itself.  Michael's ascent to the top of the mafia in America and\nhis descent in his family is the essence of this film.  Robert De\nNiro and Robert Duvall are excellent with John Cazale giving notice\nof his immense talent which was tragically never fully realised due\nto his premature death through illness.  The script is itself\nmagnificent particularly where Michael and Fredo are together in\nthe family home, Hyman Roth's (Lee Strasberg) speech on \"who\ngave the order\" and Vito Corleone's (Robert De Niro) apparent first\nuse of \"make him an offer he can't refuse\".  The script helps to\nmake this film the natural completion of the \"Godfather\" saga.  The\nthird film is an irrelevance in the company of two of the greatest\nfilm's ever made as it is only average.  There may never be a better\nfilm made or story written as \"The Godfather Part II\".\n"},
{"review": "\n\nOkay, here's the scenario:\nYou've just written and directed one of the most popular movies of its time.\n You win three Oscars including the Best Picture Oscar.  Your film is being\nhailed as ground breaking and will probably be on a lot of top 100 movies\nlists in years to come.  How in the hell do you make a sequal to\nthat?<br><br>At least that's what would be going through my mind if I had been Francis\nFord Coppala coming off the heals of The Godfather.  But somehow, he\nactually managed to achieve one of the most astounding events in cinematic\nhistory.  He made a sequal to his masterpiece which was considered better\nthan its predecessor!  Godfather Part 2 also won twice as many Oscars and is\nunquestionably the best sequel in the history of film!<br><br>It really is amazing that when a film, especially a sequal, is this popular,\nwe tend to forget just how brilliant a film like this is.  It is a flawless\ncharacter study of Michael Corleone (Al Pacino)while comparing him to his\nfather Vito (Robert De Niro, replacing Brando in a performance that won him\nhis first Oscar) in the early days of the Corleone crime family.  It is an\namazing contrast and the film is full of stellar performances, a hauntingly\nsubtle soundtrack, great characters, fantastic stories and a haunting\nconclusion.  The Godfather Part 2 is worthy of all of its acclaim and is\ndefinately better than the original. \n"},
{"review": "\n\n\"The Godfather\" is simply wonderful, and \"the Godfather - part II\" couldn't\nbe less good! It's the best sequel ever made.<br><br>It's wonderful to see 2 great actors as Al Pacino and DeNiro: I don't know\nwho could be the best in this film, both are fantastic!\n"},
{"review": "\n\nThe Godfather was incredible, but this one is even better. Pacino is even\ncooler then in the first part, and DeNiro shows everybody how to become a\nDon. A arguable downside in the first part could possibly be the fact that\nBrando was a gentleman, not a Don. DeNiro does this a lot better. Of course\nthe quote \"I'm gonna make him an offer he don't refuse\" is used again, and\na\nlot have been added, like \"keep your friends close, but your enemies\ncloser\". Pacino is better in the second part because here he plays a Don\nall\nthe time. He's a cold-blooded killer, exceeding his father. He ditches his\nsister, brother and wife and becomes the most powerful man in the US.\nEverytime a Pacino scene ends, you don't want it to end, and the same\nhappens when a DeNiro scene ends. Connie Corleone is incredibly annoying,\nFredo Corleone is incredibly pathetic and Michael and Vito are incredible.\nProbably an underrated actor in part I and II is Robert Duvall. You never\nsee him mentioned but he acts great. Frank Pentangeli is very funny. Don\nFanucci is a \"Chazzer\", and if you don't know what a Chazzer is,  you ought\nto watch Scarface. 2 downsides are: No Santino (James Caan), and the fact\nthat Pacino and DeNiro never play a scene together.\n"},
{"review": "\n\nThe lives of Vito Corleone and his son are told here with brio. The family\nhas to face different kind of problems with traitors and\njustice.\nThe reaction of the family is a fair to the reputation of of mafia gangs.\nIt's very difficult to distinguish Robert de Niro from Al Pacino, so don't\nget lost with the different times and scenes ! A very good\nmovie.\n"},
{"review": "\n\nYou could make a list that would reach Saturn and back, of all the films you\ncould watch, that serve as on-screen primers on how NOT to make a movie. The\nlist of those films that are the perfect examples of HOW to do it is\nlamentably shorter; those that instruct how to make a perfect sequel even\nmore brief. At the top of that particular list stands THE GODFATHER, PART\nII. <br><br>People are often quick and harsh in their assessment of all the things that\nwere wrong with the third sequel, and they are especially hard on Sofia\nCoppola. But even if she had turned in an Oscar-worthy performance, think\nabout it...did Francis have a snowball's chance in hell of topping the\nPerfect Sequel?<br><br>First of all, we get a two-fer: not only do we get the magnificent\nperformance from Al Pacino as Michael, the reluctant new Don Corleone, who\nhas come full circle and has assumed the very mantle he had always hoped to\navoid, as well as everything that goes with it, but we get Robert De Niro's\nbreakout portrayal as young Vito in the old country. We get to see how the\nFamily got started, and that the spiritual, moral and financial dilemmas\nthat father and son had to face, spanning nearly a century, were not as\ndifferent as either one of them might have thought. <br><br>The continuation of a story that deepens the situations and our insight into\nthe characters; Gordon Willis' peerless photography; Dean Tavoularis'\namazing sets and Theodora Van Runkle's costumes; the Nino Rota/Carmine\nCoppola themes that are so familiar to us now that they're almost\nsubliminal, and that note-perfect casting of all the supporting players,\neven the appearance of some faces you may have forgotten were associated\nwith the series, especially people like THE SOPRANO'S Dominic Chianese and\nCITY SLICKERS' Bruno Kirby. <br><br>Part Three never stood a chance.\n"}
]