[
{"review": "\n\nTo think that this movie did not win Best Picture is a crime. Director\nSteven Spielberg uses all of his talent and resources to give to the world\nthe greatest war film ever made.<br><br>Though it's true that this is not the type of movie you want to sit down\nwith the family and eat popcorn, the emotional drive of the picture, the\nstory's poignant messages, and the fantastic acting of the cast draws you\ninto a world that is both dangerous and unpredictable.<br><br>Spielberg is able to take you into action and make you feel as if you are a\nparticipant in the movie and not just a viewer. This is Tom Hanks' best\nmovie he ever did. Forget his performances in Philadelphia and Forrest Gump\n(though they were also good); he should have received another Oscar for the\nrole of Capt. John Miller, a leader who must act strong in front of his\nmen,\nbut must also hide his emotions from them.  It would have been\nwell-deserved\nif he won again.<br><br>I give this movie my highest recommendation. Saving Private Ryan is a movie\nthat makes you realize how life is precious and how honor and duty, though\nthey are deep philosophical concepts that are praised in war, can put you\nin\njeopardy of losing your life for something you may not believe\nin.\n"},
{"review": "\nIt gives a million reason why no one should go to war and one very powerful reason to go to war. It is a soul numbing realistic depiction of what \nour grandfathers, fathers, uncles, brothers and sons have faced in humanities darkest moments. Not just in WWII but in any war. No one can see this movies \nwithout being altered in some way. No one should miss it with the EXCEPTION of those war veterans that have already been there. The surround sound puts the \naudience in the middle of the battle. <br><br>Steven Spielberg has out done himself and effectively held up a mirror to civilization for events to which we should all be ashamed of, rather than \nappalled at the movie for its real life depictions. I suggest that this movie be made standard view for congress as well as the President each and every \ntime the question of war comes up. This movie would not stop future wars but I would hope the objectives would be much more clearly defined. I say this \nas a US Marine.\n"},
{"review": "\n\nI have never been affected by a movie the way Saving Private Ryan affected\nme.  That movie really took me out of my seat in the movie theater and\npractically had me believing I was really in the battle with John Miller.\nWhen somebody was dying in that movie, it felt as if you could almost feel\ntheir pain.  Speilberg did an unbelievable job of putting realism into this\nmovie with the camera-work and everything else.  Simply amazing.  An all\ntime great.   \n"},
{"review": "\n\nThe opening beach assault sequences were the most violent, realistic, and\nupsetting filming I've ever seen; looked as though the thing was actual\ncombat footage. The shushing noises of rounds cutting through the air was\nthe most chilling part of all. Perfect portrayal of the insane stupidity of\nwar and the anguish of all who enter this most foolish of enterprises. A\nmust see.\n"},
{"review": "\nSteven Spielberg makes a unique motion picture in regards to the D-Day\ninvasion of World War II just in the gritty reality of the detail\u0085 For\nmore than twenty minutes he revives for us the landing at Omaha beach\u0085\nNo one was prepared for how horrific it really was\u0085 No one understood\nwhat was going on: The terror, the chaos, the maelstrom of bullets, the\nnear-deafening explosions\u0085You really got a sense of what these guys had\nto go through\u0085 <br><br>Within that perplexity, the focus settles on six soldiers under the\ncommand of Capt. Miller (Tom Hanks) after they've survived their\nterrible hours breaking through the first line of German defense,\nthey're given a strange perilous mission, to find one man, Pvt. Ryan\n(Matt Damon), a paratrooper who's somewhere behind German lines\u0085 For\nthem, it's an abstruse order, but they have to get it done\u0085<br><br>Throughout the film, Spielberg's attention to detail is amazing\u0085 For\nme, the most chilling scene in the movie is the death of an American\nofficer\u0085 It's one of the most intimate\u0085 It's also a slightly confusing\nmoment because two German characters resemble each other so greatly\u0085<br><br>Toward the middle, a German soldier called \"Steamboat Willie\" is\nintroduced\u0085 By the end of the film, he has become the 'bad' German\u0085\nLater in the movie, another German is involved in the final fight\u0085 He\ntakes part in an exceedingly painful scene of hand-to-hand combat with\nthe American soldier\u0085 The two German soldiers have similar short\nhaircuts and black uniforms\u0085 Because they looked so much alike, many of\nus have believed that they're one character\u0085 They're not, and the\ndistinction of the two is very significant\u0085\n"},
{"review": "\n\nAn amazing and compelling insight to warfare. Umbelievable camera\nshots/angles bring World War 2 to life especially for the US troops on\nD-Day.\nThe use of flash bullets, and color saturation just add to the effect of a\nkilling ground that not many people survive to come back\nfrom.\n\n"},
{"review": "\n\n  I was hoping for an accurate war film for a change (take\n a look at the Battle of the Bulge for a really bad example).\nWhat Spielberg shows us in his Omaha Beach scenes makes me wonder<br><br>which Omaha Beach assault he is trying to portray. Those who\nknow\nlittle about the battle (that's almost everyone who's in the\ntheater)\nprobably now have the idea that every other soldier who landed on the beach\nbefore noon was either blown to smithereens or badly wounded.<br><br>Believe me, the 1st and 29th Divisions would have been annihilated if it<br><br>were as bad as it's portrayed and would never have been able to scale the\ncliffs and rout the enemy by early afternoon, which they did. I wonder, for\nexample, how wide most viewers think Omaha beach actually was. In the film\nit looks about a couple hundred yards. It was, in actuality, almost ten\nmiles wide. The timing was also inaccurate - Hanks goes up the cliffs at\nwhat appears to be 8AM. Nobody made it before 11AM.\n   Another historical error is the implication that the events at\nOmaha\nwere similar to those on the other four assualt beaches (Juno,\nSword,\nGold and Utah). That's totally incorrect. Utah Beach, for example, the other\nUS assault beach, took about a dozen casualties - many of those due to\naccidents during the landing rather than from enemy action.\n   But the worst part of the movie was the completely idiotic\nscript.\nHere we have the US Army sending a squad(a squad!!!) to march straight thru\nthe entire German 7th Army (something two Divisions, with total air\nsuperiority couldn't do for weeks), waltz around an area of 300 square\nmiles, and expect to find a guy named Ryan. If they wanted to do any of this\nnonsense, the Army would have sent them in on the gliders that flew into the\narea the very next morning. \"Gliders, what gliders\"?  said Spielberg. That's\nwhat happens when you have a scriptwriter who doesn't\nknow very much about his subject.  A stupid, stupid film. What a\nwaste\nof $100M or so. \n"},
{"review": "\n\nVisually, the best WW2 movie.\nIn other ways, far from the best.\nThe movie is loaded with errors and falls into demonizing\nthe German soldier and praising the American.\nA few examples, far from the reality the combat scenes show the Germans\nacting like cattle without ANY strategy at all\nthey just run and shout,\none funny part is the behavior of the German tankers,\nthey drive in a ruined village in a VERY narrow street,\nlike\nthey have never heard of ambush!\n-One starts to think if the script writer has ever heard of<br><br>the capabilities of the German panzer crews,\nSS-Captain Michael Wittmann attacked and destroyed 48\narmored fighting vehicles alone in a single action!\nThe most absurd part is the -\"Macgyver/Rambo scene\"-when Capt. Miller and\nfriends start to throw the mortar grenades\nslaughtering a few dozen Germans.\nThe most unforgivable error is that there were NO\nSS-units with Tiger tanks operational in Normandy at this\npoint of time.\nThis movie is way overestimated.\n"},
{"review": "\n\nThe opening of the film is visually stunning and really hits you in the\nface. But when Tom Hanks and his buddies have made it through the first\nenemy line this film turns in to a Hollywood war movie in which good and bad\nare clearly divided between the  Americans (according to Spielberg, there\nwere only white American teenagers and Tom Hanks participating in D-Day) and\nthe Germans. The way in which he portays the reallity of battle also is not\nvery objective(as history should be portrayed) whenever an American soldier\ngets shot, the audience is manipulated in feeling his pain and when a German\nsoldier gets shot the audience is made to feel the excitement of victory. We\nare also made to belief that the German soldiers really liked it there\nkilling Americans, while on the other hand the Americans are righteous\nbelievers in God and really have a lot of problems when they have to kill\nsome one.\nWell Spielberg marketed this all as an important history lesson he had to\ntell, well he really must hate Germans depicting them in a way as he does in\nSaving Private Ryan\n"},
{"review": "\n\nWar movies have often been one of Steven Spielberg' specialities. This one\nachieved a huge public and critic success. What drew the attention in this\nwar movie are fight sequences. They're extremely violent and bloody. We have\nbeen rarely so far in the reality of fights. It's difficult to forget the\nfirst half an hour of the movie during the Normandy landings. Spielberg's\nsober and showy directing increases the phenomenon.<br><br>However, you must admit it, the movie is based on a trite, plain even\nconventional story. You could use this last word to describe the famous Ryan\nsoldier. Indeed, he's told that he can go home because all his brothers have\nbeen killed. Instead, he wants to keep on fighting.<br><br>Apart from this and in spite of a few weaknesses, \"saving private Ryan\" is a\nthrilling war movie.   \n"},
{"review": "\n\nVery good film - the landing sequence at the start was phenomenal. The\nacting was of a uniformly high standard. A couple of things spoiled the film\na bit for me.<br><br>The Germans are treated as 'Nazis', even when most Wermacht soldiers were\njust serving their country like everybody else. Also they seemed to be\ntargets that got mown down in droves and were generally portrayed as less\nthan human. I thought that went out in cinema a few years after the war\nended.<br><br>Finally the only mention of the other allies is one disparaging comment\nabout Montgomery's failure in front of Caen. Firstly he was facing most of\nthe German armour that was dug into strongpoints, and secondly on D-Day and\nfor a period after the British and Canadian troops out numbered the\nAmericans. I wouldn't normally bother but Americans seem to view these films\nas historically accurate representations.<br><br>With the release of U571 this trend is getting even worse. The capture of\nthe Enigma machine was carried out by a British destroyer crew - before\nAmerica even entered the war!<br><br>The new Colditz movie is following this path. There were very few American\nPOW's held there, and none of those escaped by the war's end.\n"},
{"review": "\n\nThis is one of the single worst films I have ever seen.  Spielberg\nwas, once again, intoxicated by his own sense of patriotic\nsplendour.\nThe first major flaw in this film struck me the first time I saw it.  I\nwas in the theater and began to ask myself, \"How could Ryan\nremember the D-Day invasion when in fact he was never there?\"<br><br>Now, honestly, how did Spielberg expect to get away with that one?\nIt was never explained or followed up in any way.\nSecondly, how did he expect to get away with portraying the\nGermans as mindless, blood-thirsty grunts?  \"Well they were,\nweren't they?\" says the blindly patriotic american.  This aspect of\nthe film is a disgrace to Germans and more importantly to the\nbrain-washed americans.\nFinally, I would just like to point out the fact that this was not a\nwar to rescue individual men in order to preserve their family line.\nThis film makes a mockery of WWII by completely misrepresenting\nit.  The only aspect that was accurately portrayed was the violence,\nwhich sadly enough drew many people to the film.\nTwo thumbs down!<br><br>\n"},
{"review": "\n\nEspecially that Joe guy below. There is a big difference between an\nordinary\nGerman soldier and a Nazi. Ordinary soldiers fought for their country, just\nlike the Americans. They thought it and their lives were in danger, just\nlike the Americans. Many Americans found out their enemy was just like\nthem.<br><br>Now, people the belonged to the Nazi party, and their own personal\nmilitary,\nthe SS, were the ones who killed the countless number of\nJews.<br><br>Anyway, this movie was much overrated. It really does demonize the Germans.\nI mean, my father was one of those men and they suffered as well. All he\nwanted was for Hitler to die and for the war to end.\n"},
{"review": "\nI will just start off with saying that this is an excellent movie. Tom\nHanks' character is superb as he again proves that he is one of the\nbest actors still going today.The direction is magnificent, bravo\nSteven Spielberg who shows that war is absolutely not glamorous.\nSpielberg can enthrall audiences like no other.The battle on Omaha\nbeach was powerful ,extraordinary stuff.<br><br>We start this movie with the attack on Omaha beach, D-day 1944.Captain\nJohn.H.Miller(Tom Hanks)leads his regiment up on to the sands meanwhile\nbeing bombarded by Nazi gunmen.<br><br>When Omaha Beach is seized by the American and British forces John is\nasked to embark on a mission to save a soldier who's three brothers had\njust died and who now has a ticket home to his grieving mother.John\nagrees and begins the task of saving Private Ryan all the while his\nregiment wonder why they must risk their lives to save one man.<br><br>This is a great movie but very intense and powerful.The battle scenes\nare superb.A definite must see for any lover of great movies.Go watch\nthis movie one of the best in its genre. 10/10 - Unmissable\n"},
{"review": "\n\nSaving Private Ryan is an example of a genre of film making that should have\ndied out long ago. Far from being anti war, it is a glorification of war.\nWhile the Americans are righteous, the Germans are evil, and Spielberg\ninvites us to enjoy the spectacle of their death. German prisoners should be\nmurdered, (or else they will come back and kill you, so do it to them\nfirst).\n"},
{"review": "\n\nIt's the World War II era ... and nobody smokes.<br><br>There's only one person in this movie who opposes war .... his\n\"cowardice\"\nwinds up costing lives.<br><br>For a moment, it seems there's ONE nice person in the nation of Germany.\nThe merciful American soldiers let him go.  This turns out to be a huge\nmistake, as he returns, days later, with a group of his friends to kill\nthem\nall.  Lesson learned - there is not even ONE reasonably nice\nGerman.<br><br>The movie ends with a salute to the American flag and blasting, inspiring\nmusic.<br><br>Was this movie made for two-year-olds?<br><br>When it comes to subject matter as complex as war, I think simple-minded\nmovies like this do more harm than good.  I'd recommend a movie written\nat a\nmore grown-up level.  \n"},
{"review": "\nWhen I saw this movie in 1998 (in England), it was a big disappointment\nfor me in many ways. As not mentioned here for the first time, the\nfirst 20 min of the film are technically impressive. What follows then,\nis just stupid, one-sided and is - at least from the viewpoint of a\nGerman - invidious. I cannot understand that a man with over 50 years\nof life experience (Steven Spielberg) can make such a stupid film about\nsecond world war in 1998, or my explanation is that this man has no\ncharacter. The second disappointment, perhaps the bigger one, were the\nreports that in the United States this movie was received with\noverwhelming applause and ecstatic feelings of patriotism. This is only\na film, but it also tells you something about what people really think.\nBefore that, I had thought the Americans were (at least since 50 years)\nour friends. After this film and especially the reception of the film\nby the broader audience in the USA (as I had read about it in\nnewspapers and magazines), I thought: they may be our collaborators in\nmany ways, but they are not our friends.\n"},
{"review": "\n\n\"  SAVING PRIVATE RYAN   \"<br><br>I thought that this Movie was going to be a masterpiece. Topping those\ngreat Anti-War films of \"Apocalypse Now\" \"The Boat\" and \"All quiet on the\nWestern Front\"<br><br>But alas!  What am I to expect from America?  The Truth?\nNEVER!<br><br>Yet another great, expensive war film, where the Germans fight like\nItalians,  TOTALLY arrogant to anyone else.  I mean HONESTLY an American flag\nat the start and at the end.  Showing the American and French flags.  The\nENGLISH and CANADIANS DID land on Normandy too.  The only reference to anyone\nelse is an insulting comment about Monty.<br><br>The Germans may have suffered a bit more on the eastern front than the\nAmericans in France, but that doesn't matter because they were on the wicked\nside.<br><br>This is the kind of film simply made to win another Oscar for Speilbergs\nalready crowded shelf.  Not a ground breacker, not a truthful film. NOT even\nhistorically correct!!<br><br>1.  Radar was a TOTAL secret.  No American privates or captains would have\nANY idea of what Radar was.<br><br>2.  Germans, especially those of the SS, would NEVER be stupid enough to\nattack a ruined village with Tanks first. It was common military knowledge\nfor both sides.<br><br>3. The P-51 D mustang, which blows up the Tiger Tanks on the bridge,  were\nNEVER tank destroyers, they were only used as long range bomber escorts\nduring the invasion.  The only Tank destroyers being employed at that time\nwere BRITISH.  NOT AMERICAN. So of course the Americans would take out this\nimperfect feature.<br><br>Frankly, if you're American, you can go get your gun an' feel patriotic once\nagain, as you have done with \"The dirty Dozen\" \"Where Eagles Dare\". <br><br>If you're not American, avoid this, and stick to \"The Boat\" for your WWII\nviewing.  <br><br>\n"},
{"review": "\nThis is for those, who think SPR is realistic.<br><br>DDay happened on 20m-s and under 15 minutes! Oh yeah! The US government\nis so kind that they risk 8 guys for only one. This 8 breaks trough\nGerman defense lines. Every German soldier, who fought in the war were\nan evil Nazi, who couldn't aim, and ran into every single American\nbullet! The only one, they let to go is a bad Nazi SS Soldat who is\nhungry for revenge! Medics are used in frontal attacks against an MG!\nAmericans are able to shoot into Tiger Tanks and throw grenades into\nthem. SS surrenders to a small little guy who couldn't even hold his\nweapon properly! <br><br>This movie is truly over-hyped made for the Americans as a propaganda!\nIf I would be an American i would rate this movie 10/10! But i'm not...\nBeautiful photographics though, but this won't save the movie.<br><br>10/1\n"},
{"review": "\n\nI remember when the hype when SPR was first released: \" Gawd it`s so\nrealistic , it shows the true face of war , it`s like being there man\" I\nalso remember that these claims were made by civilians with no experience\nof\nthe military or combat ( Maybe the next time a film audience wants to\nexperience the horrors of war, the cinema might like to stick a sniper\nbehind the screen to pick off sundry filmgoers. That would be realistic )\nTo\nthis day I haven`t heard a single D-Day survivor comment on the realism of\nthis film.<br><br>Yes I agree that the opening 20 minutes of SPR are outstanding as is the\nfinal battle at the end but the outstanding visuals fail to disguise the\nvery average script that is no different from a John Wayne or Errol Flynn\nstar vehicle. There`s very little depth to the story which seems at odds\nwith the anti war visuals.<br><br>I will defend the film slightly from the allegation of pro American bias.\nIt`s an American film , made by Americans , with American money for a\nprimarily American public. For a more subjective view on the Normandy\nlandings see THE LONGEST DAY , or better still read the book. But the\ncomment on Monty was uncalled for , Bernard Law Montgomery spent 4 years\non\nthe western front ( 1914-18 ) he was disgusted by the slaughter he saw\nthere\nand made needless casualties his main concern. I bet the red army wished\nfor\na general like that on the Eastern front. Oh and Monty won the battle of\nEl\nAlamein , thought I`d just mention it.<br><br>So just to sum up SPR has some graphic battle scenes overcoming a flawed\nscript. It`s a good film but nowhere near being a masterpiece. Maybe if\nit`d\nbeen set during the Korean war and been a lot more cynical it`d might have\nbeen a true classic. But as it is it`s a case of a B movie script saved by\na\nbrilliant director\n"},
{"review": "\n\nThe more I think about this film and read differing reviews about it the\nmore I feel it wasn't meant for me. I'm a Finn, not American. I don't know\nif Spielberg meant this film as a last hoorah for the G.I.:s, but to me\nthat\nis what he made. All right the film does have something to tell for\neveryone: in the insane theatre of war one should try to do the right\nthing,\nhave courage to do it, that your actions have consequences, war as a whole\ncreates nothing but bad feelings and probably something else too but\nnothing\nthat has not been told earlier.<br><br>And I suppose that isn't so bad, I mean there have certainly been worse\nfilms. But what does bother me is that Spielberg set out to do a film\nabout\nwhat war is really like and to me, he failed. Yes I have seen the opening\nscene and to me it was more about exploitation and action film then about\nanything else and not even very memorable action. Even if one would skip\nall\nthe omissions and strange things about the film (in the landing scene no\nnaval artillery support, no air force support and the illogical German\ntactics in the final battlescenes) to me the main plot is a strange\ncuriosity that only serves to illustrate that the average soldier wasn't\nthat interesting or important. Apparently with some links to reality the\nmain plot remains distant and odd to me.<br><br>With Oscar, block-buster, critically acclaimed material as ww2 with all\nthe\ngore how could Spielberg go wrong? First of all the acting. Well I could\nnot\nstop wishing there would have been some lesser known actors used, maybe\neven\namateurs. A lot has been made out of the cinematography and yes, it is\ngood.\nAlthough to me it is not so effective when there is apparently too much\nmoney to make a film and then the camera work tries to make it look more\nrealistic. As ww2 films go this film is a far cry from \"Come and See\". Yes\nI\ndo admit that flag waving is a common problem among ww2 movies, I just\nwished that Spielberg could have avoided it.\n"},
{"review": "\n\nI don't think anyone is ever going to argue how great that opening landing\nsequence is \u0096 just the shear chaos in which those men were consumed \u0096 I\nfound the chaos comparable to the scene in `Platoon' where they assault the\nV.C. bunker\u0085however, it does not (any part of the movie, in my mind) match\nup the finale of Platoon, in which one is so confused, your heart pounds,\nand it is in the end more horrifying than any of the combat sequences in\nPrivate Ryan.<br><br>What really got to me about this film, were several things though\u0085first and\nforemost, is the `dumb German' syndrome, which leaves me with a bias\nfeeling.  Why in the end, did Miller, Ryan, and Sarge have know problem\nmowing down the by passing Germans, then survive the same gauntlet, with\nalmost twenty German's firing at them?<br><br>Another thing, is I couldn't help but notice how far people flew through the\nair whenever hit by a mortar, or stepped on a land mine\u0085or hit by a\ngrenade\u0085so on, so on.  I won't pretend to be a war-vet, or someone who's\nwitnessed this, but it seems unlikely to me.  However, I'll stress my own\nignorance, and say `don't take my word for it.'<br><br>All in all, I found it to be a worthy action flick \u0096 comparable, in my mind,\nto `The Big Red one.'  It has sad moments, and moments of brutality, but in\nthe end, just left me with impressed memories of some of the combat\nsequences.<br><br>As a sidenote, I think that the best ww2 films ever made are \"The Thin Red\nLine\" and \"Bridge on the River Kwai\" two films that don't deal heaviliy with\ncombat (TTRL more so).  Saving Private Ryan tried just a little to hard to\nforce feed it.  I recomend all of these films, but for your knowledge, those\nare to me, the best.\n"},
{"review": "\n\nBefore I start let me say that this movie was extremely well crafted,\npushing the envelope in the technical aspect of filmmaking.<br><br>This movie was really good if looked at in parts. The opening D-DAY\nsequence\nwas beautiful. The final battle was also great. There were moments that\nreally grabbed you (the Giovanni Ribisi monologue especially) but the film\nas a whole makes no sense.<br><br>It said nothing. It simply contradicted itself over and over agian. The\ngreat D-DAY sequence tells us about the insanity of war, and how awful and\nseemingly pointless it all is. But after two hours of walking around to\nfurther build on the whole insanity of war thing, the movie goes full\ncircle\nright into hollywood. The ending attempts to justify all the madness, by\nsaying that it's all worth it because you are fighting for matt damon and\nof course your country (as we fade out on the american flag). Mr.\nSpeilberg\nand company, What exactly are you trying to tell us?<br><br>NOTE: This movie pales in comparison to Terrance Malick's THE THIN RED\nLINE.<br><br>Although I must say, if it came down to this movie and Shakespeare in love\n(perhaps the worst movie to ever win an oscar... oh wait thats titanic), I\nwould have to go with this one.\n"},
{"review": "\n\nHere we have another in the series of Spielberg formula drek.  Mr. S. has\nstumbled on a great gimmick...  he makes films that may not be disliked\nbecause of some taboo or other.  To dislike Schindler's List is to not be\nsympathetic with the Jews who were killed by Nazis.  To dislike Forrest Gump\nis to not be properly respectful of retarded people.  Give me a break.  Now\nwe're all supposed to like Saving Private Ryan because if we don't it means\nwe don't understand that war is bad or appreciate the sacrifice made by all\nthe people who died during WW II?  Spare me.<br><br>Without all the emotional baggage, SPR is an awful movie.  The plot is\ntrite.  The writing labored and formulaic and it in no way justifies the\nemotional bludgeoning delivered by the opening sequence.<br><br>I will admit that the opening sequences is probably the most powerful half\nhour of film ever to be projected on a movie screen.  Spielberg know all the\nemotional buttons we have and how to push them.  He was a brilliantly\nmanipulative filmmaker 25 years ago and he's only gotten better.  That being\nsaid, did Mr. Spielberg forget to actually add a story?  Lots of movies deal\nwith the ugly side of humanity.  The Shawshank Redemption is a perfect\nexample of how to show these things in the context of a riveting story.  I\nguess the most disappointing aspect of this is that we all know that\nSpielberg can do better.  He has done better.  He has made some of the\ngreatest American films of all time.  He, of all people, should remember\nthat and remember that every time he makes one of these ponderous\nabominations he is desecrating the memory of films like Duel and Jaws... and\neven The Lost World.  It was a far better movie than this.<br><br>On a scale of 1 to 10.  I gave it a 1 only because there was no zero which\nwas what it really deserved.\n"},
{"review": "\n\nI think this film is terrible.  The war scenes are gimmicky, especially\nthe\nflanging, shakey camera work.  Some scenes are outrageously unrealistic,\nsuch as when those American soldiers shot the Germans using the mirror.\nAlso, studies have been done showing that only about 1/3 of American\ntroops\nlanding during D-Day fired their rifles.  Not all of these soldiers were\nhardcore killers like the movie makes them out to be.  It's laughable that\npeople call this film \"realistic.\"<br><br>The audience is given very little credit.  The dialogue sounds like it is\ncut out of newspaper articles which editorialize the mission.  It's as\nthough Spielberg thought his audience was so stupid that the moral dilemma\nof the film had to be spelled out for them in detail.<br><br>It also overused action sequences.  Those in creative control of the film\ntried to make up for the lack of depth with gritty, excessive scenes of\nviolence.  All in all, this is one of the worst films that I have ever\nseen.\n"},
{"review": "\nThis is tiresome Hollywood propaganda that more and more people simply\ncannot swallow any more: the myth of the 'good war', the 'necessary\nwar', the war for 'freedom', in which the 'good' and the 'bad' side\ncouldn't be more easy to discern...<br><br>This is a worldview (((Steven Spielberg))) would love to impress upon\nus. But the narrative this film is based upon is rapidly being\ndemolished, as more and more people want the truth, not myths about\nthis horrible war that cost us so many dead people.<br><br>When will the likes of Spielberg address the real root causes of the\nwar? When will they make a film about the Bolshevik murderers who\nkilled many millions of innocent people in the USSR? The answer is\nnever.<br><br>I have to say I have zero interest in Spielberg's propaganda. I hate\nthis film.\n"},
{"review": "\nThis film is an absolute masterpiece. It shows that war isn't always\nglamorous. Steven Spielberg won a Best Directing Oscar for his work on\nthis film and the film went on to win four others. It is gritty and\nbloody and it shows that wars aren't won by weapons but by soldiers.\nThe cast shine as the group of soldiers tasked with finding Private\nRyan. Along the way they encounter the harsh truth and real meaning of\nwar. It boasts impressive battle sequences and the stylish\ncinematography makes the film truly beautiful. The opening beach\nsequence is possibly the greatest opening scenes in movies. Tom Hanks\nis spell binding as the commander who has no idea about the harsh truth\nof war. Overall a truly amazing film.\n"},
{"review": "\nIf it weren't for the group of people with a personal hatred of America\nand our military, this movie would have a higher overall rating on\nIMDb. This movie is phenomenal. From the horrific depiction of D-Day in\nNormandy to the final battle, this movie keeps you entertained and\nworried for the safety of the main characters. This movie will tug at\nyour heartstrings if you have a heart. The acting really draws you in\nand the plot, while a little out there, is very engaging and creates\nfor an amazing journey behind enemy lines.<br><br>This movie will forever be the greatest war movie ever made. The brutal\nrealism and gore are hard to watch at times but is necessary to fully\nshow the horrors of war.<br><br>All I can say about this movie is don't expect your favorite characters\nto make it out alive. I was pretty upset originally when my two\nfavorite characters in the movie died, but that just adds to the\nrealism of the movie. People died. Your friends died. Heroes died. War\nis Hell, and full of heroic sacrifices. This movie is a must see for\nany American, though I believe foreigners should enjoy this movie as\nwell. An excellent 10/10 from me.\n"},
{"review": "\nConsidered by many to be a fantastic film, I feel I must have missed\nsomething. This film is certainly a good film by any standards. (The\ncamera work is well done, backdrops are excellent and the opening scene\non the beaches of Normandy is one of the most memorable in cinema\nhistory) But the film does suffer from a couple of failings.<br><br>Firstly, it is strongly and unapologetically patriotic. The film beings\nand ends with the American flag, and the in fact, the Americans appear\nto be the only people in the film. The only appearances from other\nnationalities are the Germans, and the only character seen is a\nback-stabbing monster. In contrast, the American soldiers are all rough\ndiamonds, and each death scene for an American character is a\ntear-jerking moment of sadness.<br><br>Secondly, the plot. After the initial scene, the plot becomes somewhat\nsilly, going increasingly downhill until the surviving half dozen\ncharacters end the movie fighting a battalion of soldiers and a squad\nof tanks. I really don't understand how anyone can watch the end of\nthis film with any seriousness.<br><br>In conclusion, I'd say that the only way this movie deserves the high\nregard it seems to have is if after watching the opening half hour, the\nmovie was switched off. None the less, I would recommend viewing this\nfilm, as its qualities do outshine the flaws.\n"},
{"review": "\nI would have given \"Saving Private Ryan\" a higher score had it looked\nat more issues abundant during WWII (they could have focused on the\nvarious roles that each country specifically played in the war). But\ndon't get me wrong: watching the movie, you can literally feel the\nbullets hitting you. Tom Hanks commands as strong a performance as we\ncan expect him to, and the rest of the cast also does quite well.<br><br>I guess that if the movie has any problems, it's in the characters\nthemselves. Aside from the fact that the movie pretty much makes all\nAmericans out to be good and all Germans out to be bad, the Americans\nare basically clichés. They're all wholesome, hard-working guys out to\nmake something of themselves. Moreover, there's the wise-guy New Yorker\nand the cowpoke Southerner, and Pvt. Ryan comes from Iowa (read:\nAmerica's heartland).<br><br>But otherwise, it's a very good movie, and it goes to show what an\nincredible director Steven Spielberg is (although I still wouldn't have\ngiven the movie Best Picture; I would have given that to \"Life is\nBeautiful\"). Also starring Tom Sizemore, Edward Burns, Barry Pepper,\nAdam Goldberg, Vin Diesel, Giovanni Ribisi, Jeremy Davies, Matt Damon,\nTed Danson, Paul Giamatti and Dennis Farina.\n"},
{"review": "\ni first saw this movie on T.V. one night with my father, but only saw\nbits and pieces. I decided to rent it one night and watched the whole\nthing in my basement. From the start to the finish i thoroughly enjoyed\nthe movie.i had seen a couple other world war two movies, but none of\nthem compared to this. it was interesting how Spielberg made everything\nlook like it was back then, with the costumes, weapons and scenery!!!\noverall, this movie seemed like one of the best out there, and i\npersonally think it's spielbergs best. If you haven't seen it yet, then\ni HIGHLY recommend you go out and rent it some time. It's a great movie\nand definitely worth watching!\n"},
{"review": "\nI can not understand those who view it as an 'America win the War'\nmovie. That is not the point of most of the war movies out there. Yes,\nthey may use American actors and show American fighting, but look past\nthat and see the terrifying experiences of war and the fear of the\npeople back home who suffer the emotional trauma. 'Saving Private Ryan'\nI felt gave a visual look at war, it gave the best feeling of what war\nwould be like that any movies have given, but I don't think that any\nmovie ever will be able to to give the exact fear that is within the\npeople when they are in the middle of a battlefield.<br><br>An excellent movie, dignified, moving and intelligent (not a word used\nwith many Hollywood movies) acting with a director that has shown\neveryone how it SHOULD be done.\n"},
{"review": "\nUp until this day, there had never been a time where I was awestruck or\nshocked or amazed after seeing a movie. Never. Then, I saw Saving\nPrivate Ryan. This movie, without a doubt, is the best movie I have\never seen.<br><br>Saving Private Ryan is a very accurate presentation of World War 2. In\na lot of the parts, I felt like I was actually there. It was all thanks\nto Spielburg's camera-work, which showed some scenes of the movie from\nthe view of a soldier. I felt like I was running along the beaches of\nNormandy. I felt like I was with them in the final battle (won't reveal\nspecifics). That's how good it was! Now, even though this movie is\nreally good, it is not for the faint of heart. The first scene of this\nmovie (D-Day) contains gratuitous amounts of violence and gore. They do\nnot hold back on the violence. So, unless you think you can handle it,\nI would not recommend seeing this movie, because it does have some very\ndisturbing moments. Another thing they do not hold back on is swearing.\nIf soldiers shouting out the f-word constantly doesn't appeal to you,\nthen you might want to skip this movie.<br><br>Besides all of that, this is a great film! I can't think of anything\nwrong with it at all. I would definitely recommend this movie (if you\ncan handle the gore and language).\n"},
{"review": "\n\nI really liked this movie !\nthe realism was extreme, what is, I think a good thing.\nI do not like Spielberg (since i was 14-15 yrs old anyway).\nI think this guy would be better in doing commercials for TV than making\nmovie - just my humble opinion.\nBut if we forget some flaws the movie is pretty good !\nT. Hanks was also very good in it ! he got my respect.<br><br>now, some stuff was bothering :<br><br>- near the beginning, why spielberg was making the little french girl say\n\"\ni don't like those american soldiers ! -sob- \"\nAre those US dudes will stop one day to think that the french are\ngenetically antiamerican ? that's ridiculous !\nI hate set ideas !<br><br>- The german soldiers look dumb and wanting very eagerly take some US slug\nin the map !\nCome on, guys ! The germans are just there to be shooted, they act\nstupidly\nwhat cost them their life, they have no survivng instinct ... i don't buy\nit\n!<br><br>- The landing scene seemed ended a little too fast and easily to match the\nreality i think (IMHO)<br><br>Of course, there may be a little too much US patriotism for the average\neuropean viewer, we are not used to it anymore in our countries\n(self-glorification, i mean) but after all it's an american movie and they\ndid change the fate of Europe and the world, so ...\nlet them do it.<br><br>anyway good movie, i give it a 8/10.<br><br>= you should at least see it once ! &gt; \n"},
{"review": "\n\nThe action scenes in this film are superb - gritty, realistic and plain\nnasty.\nHowever, it remains a source of irritation that such good film making is\nwashed down with an unhealthy dose of flag-waving patriotism.\nWhat is the message of this film? That occasionally you find SOMETHING worth\nfighting and dying for or that it's glorious to die for your country (read\nOwen for further comments on this)<br><br>Something else it has led to is a number of American reviewers giving the\n\"We died to save your a$$es\" speach. \nThis itself is both stupid and untrue - the people who wrote those messages\ndid nothing. America got involved only when it was directly threatened by\nthe Nazis, and not before.<br><br>I am glad, however, that such views are in a minority from the American\npostings - It's a pity that the many are tarred by the\nfew.<br><br>Millions of normal Europeans died in this war - from bombings, shootings,\ntorture, starvation, disease and the Holocaust.\nThis film made only a token attempt to reference this - nothing more.<br><br>The thin red line was a much better, less commercial film with that very\nneccessary ingredient - a message - this one remains a catalogue of missed\nopportunities and a formulaic start and end.<br><br>\n"},
{"review": "\nThis movie is so powerful. I couldn't watch it without crying, jumping,\ngasping, screaming, laughing, and cringing. It brought you through a\nwhole array of emotion.<br><br>I couldn't help but give my entire being over to each character as a\nstunning performance was drawn by each actor. Simply amazing. I can't\ndescribe it any other way.<br><br>Easily the best war film I've seen. None was more realistic... Amazing\namazing amazing.<br><br>Recommended to anyone who enjoys historical fiction.<br><br>LOVED IT!\n"},
{"review": "\nD-Day. Operation Overlord. What we say here cannot do justice to what\nthey did on that day. Tom Hanks and his patrol must recover Private\nJames Ryan before his mother gets her fourth flag delivered by an Army\nchaplain. It all makes perfect, illogical sense to kill many to save\none. <br><br>After surviving the Normandy landing, Hanks is volunteered to put his\nmen in the line of fire again and again. Just to save one man. <br><br>Or is it?<br><br>A bridge is saved, a town is secured, a bigger battle is won..All\nbecause Hanks saved one shoe for one horse...<br><br>Beautifully realistic to make the atrocities of war invade, assault,\nand overpower all five senses. You feel the bullets whizzing past your\nhead. You see the man looking for his arm after it was blown off is\nshoulder. You smell the burning hatred for the Nazis as one US soldier\nyells to his comrades \"Don't shoot them..let them burn.\" <br><br>It is too much to watch..but you have to see it.\n"},
{"review": "\nDirector Steven Spielberg's usual homey touch (which infiltrated even\n\"Schlinder's List\" in its final act) is thankfully in slight evidence\nhere, as WWII soldiers attempt to locate one particular man whose\nsiblings have all been killed in combat. The set-up for the plot is a\nbit formulaic (and layered with Spielberg's need for romanticism), but\nthe very fine performances and exhaustingly exact scenes of violence\nremain haunting and memorable. Vivid cinematography and frenetic\nediting won Oscars, as did Spielberg (who deserved it). I was rather\nsurprised by how powerful this movie is, given the feel-good\nreputations by many of the principals involved. I'm not a lover of this\nparticular movie genre, but the film pulls no punches in detailing many\nunrelenting scenes of battle. *** from ****\n"},
{"review": "\n\nI'm afraid that I hated every moment of this film. Spielburg overused\nemotional hokum to try to give his film wieght when we actually didn't care\nwhether Private Ryan lived or died. The first twenty minutes, I accept are\nexcellent, but they are just a rip off of someone else's hard work - and\nfrankly I would rather see the original footage from the Second World War\nrather than the director's interpretation of it. Although it tried to be\nrealistic and historical, it was neither. The history is faulty and the\nemotions of the rangers are not realistic. (I imagine that if it happened\nfor real they would complain about having to rescue this mummie's boy and\nhide out somewhere safe until it was safe to go back to base.) I'd rather\nwatch the notoriously bad, Objective Burma anyday. At least it doesn't\npretend to be true. \n"},
{"review": "\n\n\"Best war movie of all time\", \"one of my favorites\" and so\non...please!<br><br>The beginning is awesome with amazing action scenes but then what..? It's\nthe usual \"USA saves the world\" with who-would-have-guessed-it heroes and\nnauseating flag waving and other clichés. I just can't believe that this\nmovie is considered to be the 14th best (or 12th or whatever it is right\nnow...) of all time!?!<br><br>What's most surprising about Saving Private Ryan is that all the Americans\nwho watched it could get out from the theaters with their big heads. They\ncan't honestly say that this is how they thought WWII was, can they?? All\nAmericans and not a Brit, Frenchman or anyone of another nationality in\nsight.<br><br>This movie was made for an American crowd and to make money at the box\noffice. Not to make a believable story about D-day.<br><br>It's supposed to be really emotional when an American gets killed or\ninjured\nbut the Germans are shot down indiscriminately. This is sickening to me!\nIs\nan American life worth more than a German? Spielberg seems to think it\nis...<br><br>\n"},
{"review": "\n\nI can't be the only person who thinks this is Starship Troopers with the\nEvil Nazi Scourge standing in for the Bugs.<br><br>For one, the combat scenes are no more war-is-hell realistic and bloody than\nStarship Troopers.  It's nice to see protagonists who aren't superhuman, but\nthis is only a (moderately) original take for big budget blockbusters, it's\nhardly ground breaking cinema.<br><br>Just as in Starship Troopers, the characters barely qualify as one\ndimensional, and I can't be the only one who found them so irritatingly\nstereotypical that SPR almost qualifies as a parody.<br><br>A particular point of interest is that Mr Spielberg's Evil Nazi Scourge are\nportrayed only slightly more sympathetically than the Bugs in Starship\nTroopers.  If you get your knowledge of history from Hollywood (which a lot\nof people do), then you'd be forgiven for thinking that every single German\nwas a soulless Nazi who deserved to die, and that WWII was just USA vs Japan\nand Germany.  I do have a fair amount of sympathy for Spielberg's stance,\nbut it's interesting to compare his sweeping generalisations with 1930's\nNazi anti-Jewish, anti-Romany propaganda.  It's sad but not really\nsurprising that Spielberg's audience accepts his skewed message just as\nunquestioningly as the German moviegoers did in the 1930's.<br><br>The idea for SPR is actually sound, but the implementation is just so\noverdone that I really can't bring myself to care about any of it, other\nthan to feel contempt for the brutal liberties it takes with history.  If\nI'm going to watch good-vs-bad fantasy, I'd prefer to stick with Starship\nTroopers which at least doesn't try to pass itself off as something\nsignificant and profound.\n"},
{"review": "\n\nLame, revisionist crap. What the hell kind of squad does no recon, talks out\nloud, and stays bunched together? Also, many of the weapons (esp. the German\nM 60)are improperly, and fantastically used. How can you use a sniper scope\nout of the box, with no sighting in? Idiotic. Spielbergs enthusiastic\nportrayal of the murder of German prisoners is disturbing in the extreme.\n\n"},
{"review": "\n\nOOOOH! Steven Spielberg and Tom Hanks!  It has to be good!\nAnd that is why so many fools actually think this movie is worth something;\nthey were told it was before they ever saw it.  Tom Hanks playing the same\ncharacter he has in every movie since \"Philidelphia\" sans \"Forrest Gump.\"\nSpielberg trying to make us think this movie is as realistic as they get.\nLots of bullets, blood, and heads blowing apart does not mean it qualifies\nas real.  It can't be real.  We've seen all of these characters in a\nhundred\nother movies.  Tough, tobacco chewing sergeant.  Cynical, mouthy private.\nEven the sniper getting shot through the scope.  Spielberg is ripping of a\nschlock tom berringer joint.  But look at all the people dying and the\nyoung\nman calling for his mother, this is a good movie.  Yeah right.  Do yourself\na favor and rent \"Hell is for Heroes.\"  A good movie, although it might be\ntough for some of you because it is in B&amp;W. \n"},
{"review": "\n\n Spielberg set out to make a realistic depiction of the Omaha Beach landings\nto kick off  his film, which is about a fictional mission\nof a squad to rescue one Pvt Ryan, of the airborne, dropped inland behind\nthe beaches. One glaring idiocy of the film is why they would dispatch\nsoldiers from the Omaha sector to rescue someone dropped<br><br>behind the Utah sector, especially when 4th Infantry Div soldiers are<br><br>already in contact with a large portion of the airborne troops. The answer\nis, of course, because that gives Spielberg his opportunity\nto\ndisplay the Omaha landings rather than the Utah beach landings next door,\nwhich were too easy and lacked any bloody combat. If the only thing anyone\nknows about the V Corps landings at Omaha came from this\nfilm, then they would have been better off skipping the film, or at least\nthe opening scenes of battle. Read a book and learn what happened at Omaha.\nYou'll find that it wasn't anywhere near as bloody as Spielberg's film leads\none to believe. Omaha Beach was considered bloody only because of comparison\nwith landings at the other 4 beaches,\nwhich were virtually walkovers. The rest of the movie is not much to see,\nwith many errors in the combat sequences, especially with respect to tactics\nthat would have been used. Spielberg's film is badly flawed as history, and\nthe story is downright unbelievable - why not radio the 101st  and order\nRyan off the line? Why send a few guys to walk thru the entire German 7th\nArmy and search in a 400 square mile area for some guy named Ryan? The US\nArmy wasn't always the most efficient, but they would never have sent off a\nsquad on such a cockamamie mision.\n"},
{"review": "\nYou have to love a war movie, which just like 'Goonies' is based around\na serious of characters, all of which have one defining characteristic,\nand go on a quest, finding out who they are along the way.<br><br>As 'Goonies' had the fat kid, the Asian genius, the smart-arse; 'Ryan'\nhas the religious guy, the cowardly guy, and smart-arse, among others.\nAs the 'Goonies' fought impossible odds, so too do the American\nsoldiers of the 'Ryan' cast.<br><br>And WWII is seen as it really happened, with the Heroic American's\nfighting for the cause of good single-handedly, against those crazy\nGermans! Canadian's, British, French, and even Commonwealth soldiers\ndon't feature on this Western front. And nor would they, with this\nbeing an American film starring Tom Hanks, they should be neglected\nfrom such \"history\". There's only room for the central character's and\nthere quest for flag waving glory!<br><br>When this film was first released it was sold as being so accurate it\nwas a history lesson within a piece of entertainment. But blood and\nguts don't make for accuracy. And American's, for whom this was meant\nonly saw war as a glorious celebration of the stars-n-stripes. To this\nday, America has used WWII not as a warning, but as a starting point.\nLost in this film was the supposed anti-war message, with nationalism\nthe resounding lesson that this filth passed onto it's American\nviewers. George W. Bush must surely love this piece of violent film\nmaking at it's worst.<br><br>Forget about this Goonies rip, and just check out the original, it's\nfar less offensive, and a lot more entertaining.\n"},
{"review": "\nSaving Private Ryan is a heart pounding drama that shows World War 2\nvery realistically. The battle scenes, while horrific, are done to\nperfection. It shows us the horrors of war from the POV of our main\ncharacter Captain John H Miller (Tom Hanks) and the platoon he\ncommands. Captain Miller's platoon has landed on Normandy beach, and\nhas now been assigned to a rescue mission. To locate and save Private\nJames Francis Ryan (Matt Damon) a US paratrooper whose brothers have\nbeen killed in action. As the group goes through France to find one\nman, they ask themselves why one man should be as important as the\neight looking for him. As I've already stated the battle scenes are\namazing. The acting also is top notch. It's really an incredible movie.\nThe last 27 minutes is just gripping. It's impossible to ignore.\n"},
{"review": "\nThis movie truly deserves a spot on the top 10 best war movies. No\nwords can express the feelings you get while watching this movie.<br><br>Right at the start you're being thrown right into the heat of the\nbattle, the starting 27 minutes are absolutely amazing, in the way that\nSteven Spielberg (the director) did tremendously good job at making his\nvision come true. The scenes were \"extraordinary\" sort to say, in the\nway that he tried to recreate that WW2 \"Battlefield Cameraman\"\naesthetic. If you watch any footage from WW2 you can see the hand- held\ncamera is shaky and when an explosion or something else happens nearby,\nthe camera goes everywhere and the footage gets interrupted. Steven\nused this and made the movie feel chaotic. The scenes looked so real\nand felt so chaotic up to the point that REAL D-Day veterans who\nwatched this movie had relived the horror of Omaha beach because of\ntheir PTSD, and when this movie was released they setup a hotlink for\nanyone who had received these horrible \"flash backs\". That is such a\nterrible thing, and my heart goes out to the veterans who had to relive\nthis chaos all over again. Then again... as terrible as this sounds,\nthis is quite the achievement for Spielberg in the way that he made it\nlook so real, that it was too real.<br><br>Never the less, the rest of the movie had you on edge, i'm not telling\nyou how. You should know, if you don't. Then go watch it.\n"},
{"review": "\nFrom the invasions on Omaha Beach (D-Day), to the final battle in\nRamelle, this movie was as action packed and graphic as possible.\nAnytime Spielberg and Hanks team up, it's pure gold. Especially this\ntime. Personally, I was on the edge of my seat during the entire\nduration of this movie. If you're a war movie fan, I guarantee you that\nthis will make the top of your list. This is as real as war can get on\na TV screen. War movies completely changed after this film was released\nin 1998. It has influenced the film industry as much as any other movie\nout there. In my opinion, this is Spielberg's best work ever, as well\nas Hanks. There are so many realistic parts of this movie, it's insane.\nAfter all, it is based on a true story. People said that the D-Day\nscene was so accurate, it might as well had been real. When it comes\ndown to it, this film is one of the most iconic films ever, and\narguably the best war movie ever created.\n"},
{"review": "\n\nIn \"Saving Private ryan\" the characters are so stereotyped(\"the\nbrave\";\n\"the cute\";\"the rebel\";the timid\")that the critics and audience should be\nashamed of.Why we should forgive the director's mistakes just\nbecause\nhe is \"Steven Spielberg\"?even some of the gruesome scenes of the\nfilm\nseem stolen from a real war documentary,SPR is a lot more inferior\nthan\nthe deep\"The thin red line\" and to give every award of the planet to\nSpielberg is just ridiculous and childish,you just make him more spoiled and\nrich!.\n\n"},
{"review": "\nThis film is a fantastic production with a quality cast. You sure will\nnot be disappointed watching this gripping film that is based on a true\nstory. Many war films have been made but this is by far the best I have\nwatched in a long time. Such a emotional film in which Tom Hanks could\nnot be replaced by any actor. If you like well made war films which are\nbased on a true story and made to give viewers a lasting impression and\nsomething to think about than this Film should be your choice. Also if\nyou are a emotional person, tears will fall. The cast for this film has\nbeen well selected and suit their characters.You will experience a\nauthentic view into the life of soldiers who have fought during the\nD-Day landing in the Normandy France.\n"},
{"review": "\nThis film gives you everything you could want in war film. Well\nchoreographed battle sequences and some real human emotion. Everybody\nwho has seen at least the first 10 minutes of this film then you know\nit deserved some kind of award just for that great depiction of the\nbattle on Omaha beach. <br><br>Sure there's still 2 hours and 30 minutes left after that but it only\nmakes the film better. After the battle tom hanks and several men are\nassigned to a mission to retrieve Private Ryan un harmed and return him\nhome due to his two other brothers being killed leaving him the last\nson alive. So now there is a good story for a war film and plenty of\nmovie left for various battles, subplots, and all sorts of things.<br><br>The film even without the battle sequences would probably still work\nthanks to the great emotional and raw scenes but it just wouldn't be a\n10. This as you already know is definitely a film everybody needs to\ncheck out at one point, your response to the film might be completely\ndifferent from mine so you make a review and express your opinion\nyou've acquired from watching the film. Thanks for reading my review\nand be sure to check this film out.\n"},
{"review": "\nAs the name suggests this a war-movie in which an agent named Capt.\nMiller(Tom Hanks) is sent on a mission to save a soldier named Pvt.\nJames Ryan. Ryan's mother has already lost her three children in the\nsame war against the Germans. <br><br>Movie starts with an approx. 25 minutes of a thriller action sequence\nwhere the American forces are fighting against German forces at Omaha\nBeach. Director Steven Spielberg has made this scene one of the most\nepic real war sequence I have ever seen in a movie. Thousands of\nsoldiers died in this horrifying, dreadful sequence. Special effects by\ncinematographer(Janusz Kaminski, also in Schindler's list) has made\nthis a perfect sequence. <br><br>Protagonist Capt Miller survived this war, assembles a group of\nsoldiers to invade German troops and find Ryan. Movie depicts the\nstruggle of Miller and his team to complete their mission. Movie\nbecomes a little bit slow during the mission but still must be able to\nhold the audience together.<br><br>Intense emotion scenes, like when Ryan's mother is informed about the\ntragic death of her three sons might make viewers cry and arouse\npatriotic feeling in them. Movie showcase some good strategies,\nteamwork, breakdowns and courage. All these things together complete\nthis movie and makes it much more interesting than any other fiction\nmovie.<br><br>Tom Hanks's acting has raised the bar of expectations further high.\nSteven Spielberg has done one of the greatest job you will ever see.\nRealism in this movie makes it a must watch.\n"},
{"review": "\nA true classic. And honestly my favorite Spielberg and movie of all\ntime.<br><br>STORYLINE: The storyline starts during Omaha Beach. Were we somewhat\nmeet are hero's. Around 30 minutes in the actual story comes into play.\nPrivate James Ryan's (Matt Damon) 3 brothers are all killed in the line\nof duty. So Captain John Miller (Tom Hanks) and all of his crew are set\nto find him and bring him back home.<br><br>CHARACTERS AND ACTING: The movie itself is powerful. The characters are\nsmartly written. Because they question the mission. Why would 8 guys go\nover and save 1 man? Tom Hanks is as powerful as he ever is. He\nportrays his character of a man who has suffered during times of war.\nAnd his \"That's my mission\" speech always moved me. In short everyone\ndoes a great job.<br><br>OTHER: This movie is powerful. And after watching it you want to take a\nshower and sing \"The Star Spangled Banner\" Because it is patriotic and\nit makes you feel proud. And of course the first 25 minutes of the\nmovie is so incredibly well done that it makes shaky-cam look like a\nmasterpiece! And this film is a masterpiece!\n"},
{"review": "\nFrom Stephen E. Ambrose's book, 'Band of Brothers,' written in 1992. In\nChapter Six, 'Move Out,' Fritz Niland -- a member of Easy Company,\n506th Parachute Infantry Regiment, 101st Airborne Division, U.S. Army,\nlost his brother Bob Niland, who was killed on D-Day. A second brother\nhad been killed on Utah Beach on D-Day. And a third brother was killed,\na pilot in the China-Burma-India theater that same week. His mother\nreceived all three telegrams on the same day. However, in \"real life\"\nFritz was never lost, was immediately located by a Father Sampson,\nescorted to Utah Beach, and was flown to London, and then back to the\nStates.\n"},
{"review": "\n\nAs of three years ago, I have made a point of watching this film on\nJune 6th every year, so that the true meaning of this historic date\nwill never be lost. I know it sounds trite, but with holidays such as\nMemorial Day quickly becoming an excuse for cookouts, I feel the need\nto reinforce the terrible and awesome sacrifices that have shaped the\ncourse of history. This movie does just that. For all of it's character\ndevelopment shortcomings, it still ranks as simply the most powerful\ncinematic depiction of war I have ever seen. <br><br>And as a side note, the whole character development issue almost seems\nmoot, considering the context in which most of these men knew each\nother. Ready to die for their brothers, many ironically knew very\nlittle of each other's personal lives, except for snippets learned\nduring the calm interludes, when the soldier would share stories or\nletters from a world far away. <br><br>That is why the betting on what Hank's character does as a civilian\nmakes so much sense. To many, life at home was a carefully guarded\ntreasure that served as a very personal and private link to sanity and\nhope. If you haven't seen this film, make it a point to do so. You will\nfind a whole new appreciation for the ability of the common man who,\nfaced with impossible odds and true terror, is somehow able to\naccomplish the extroardinary. It will renew your faith in mankind,\nwhile simultaneously horrifying you at man's folly.\n\n"},
{"review": "\n\nBeing still a teenager, I realize that I am still relatively young and may\nnot fully comprehend the true impact of war, if ever.  I know that many\nhave\ncriticized this movie for not truly giving the sense of war or\nwhatnot.<br><br>In my view, this was not the purpose of the movie.  Instead, I believe\nthat\nthis movie was made as a tribute for those lives lost in the war and to\ngive\nthe audience a more graphic taste of the battlefield.  The viewer may only\nbegin to get a sense of the horror felt by those involved, but I hope that\nmost will never have to know such feelings.<br><br>Movie-wise, its terrific.  Superb acting, exciting and twisting plot,\nemotional moments, and edge-of-your-seat action.  I came away speechless\nwith a better view of the true loss of war.<br><br>While the feelings conveyed are not as realistic as some would like, this\nmovie is also not exactly a light-hearted take on war.  I feel that\nHollywood has a responsibility to accurately reproduce the historical\nsubject being represented to the best of their ability, and this is\nachieved.  The costumes, special effects, sounds, and sets are virtually\ngenuine.<br><br>The bottom line:  While unable to truly portray the experience of war, the\nviewer still comes away feeling solemn and respectful with a true sense of\nloss for those involved.  The excellent production values are only a\nbonus.\n"},
{"review": "\n\nTake away the gratuitously gory opening scenes, and what you have is an\naverage war movie. Yes, war is hell, but just being explicit about what a\nbullet or shell can do to a human body isn't going to turn you against\nwar.\nPersonally I found this movie exploitative.<br><br>If you want to see what the effects of the Second World War were really\nlike, then ignore the movies. Instead check out the classic seventies\nseries\n'The World at War'. Far more shocking and sickening than any Hollywood\nblockbuster.\n"},
{"review": "\n\nso overrated. this film relies is saved by its gore and superb performances\nfrom tom hanks and tom sizemore. i dont see what the deal is all about.\noutside of jaws, and the indiana jones trilogy he hasnt made an excellent\nmovie in his entire career. this movie is made cheesy by its use of a\nflashback to frame the story. not only that, it drags in parts by adding\nhumor and trite dialogue where it should be focusing on the action. i think\nmost of the credit to this film should go to the director of photography,\nthe effect and make-up crew and tom hanks and tom sizemore. too bad that\nstalker never made it all the way to spielberg.\n"},
{"review": "\n\nIt's just Hollywood after the beginning. Other movies are much better, when\nit comes to the manuscript. This one lack something.\nLike a story you can believe in. Sure, for all americans it's great.\nRisking\nmany people to save one in order to not let one mother loose ALL her\nchildren. But the other 8-12 americans who die? What about their parents,\nwifes, girlfriends and children?<br><br>Please! It's has realistic battle and death scenes. That's\nall.\n"},
{"review": "\nAMAZING MOVIE EVER!!The first time that I watched this movie was in\nschool and I knew that I HAD to get it for myself! I love the way they\nhad the affects of guns and grenades. I can't wait for my son to be old\nenough to sit and watch it with me :) I don't think any other movie\nabout war would even come close to Saving Private Ryan. Tom Hanks and\nMatt Damon were a good pair, and would be good to pair up again! I\nrecommend this movie to A LOT of my friends. They come back and tell me\nthat it was remarkable, then they tell other people to watch it. I wish\nthat I could shake Spielberg's hand to say Thank You for making an\nAWESOME movie and that I'm going to wear out my disc very soon.\n"},
{"review": "\nI wish I could view this movie like the average moviegoer. In that\ncase, I would probably have given it higher marks. However, I was in\nthe Army and know that dialogue such as is in this film would be highly\nunlikely, no, impossible, to have been said in real life.<br><br>The hierarchy in the service is very clear: privates do not contradict,\ninterrupt, defy, or in any way address their superiors as is depicted\nin this film. I found a number of scenes to be pure Spielberg fantasy.\nThe scene in which Hanks doesn't provide the full name of the 'Ryan' he\nis searching for, which results in Hanks delivering the wrong\ninformation to the wrong 'Ryan', is hard to swallow. The scene with\nMatt Damon protesting when told he is being taken off the front lines\nis also hard to believe.<br><br>The scene where Oppem (or whatever his name was) protests against\nshooting the POW is absurd. No way that would have ever happened. Some\nof the other unlikely aspects of the film: Tom Sizemore throws his .45\ncaliber pistol at the German; four soldiers pull the pins on their\ngrenades and drop them in the tank turret, yet none of them detonate.\nThe scene at the end when Tom Hanks starts firing at the tank with his\n.45. In real life, he would have been dead by then after being shot in\nthe back with what amounts to a high powered rifle. <br><br>The scenes after the Germans bring their 20 mm. cannon into action also\ndidn't get very far past the GI's first encounter with the fearsome\nweapon. After it annihilates about six or seven GIs from one short\nvolley, one wonders why the Germans didn't make quick work of the rest\nof the GIs after that.<br><br>The dialogue was also a bit too pristine for my tastes. In reality, GIs\ncurse up a storm. These guys were a wee bit too polite and wholesome.\nPlatoon gave a much more accurate account of how GIs actually behave.<br><br>These criticisms aside, the action scenes are well staged and evoke a\nhealthy pulse pounding for the viewer.\n"},
{"review": "\n\nInstead of me picking this the best war film ever, I choose it as the\nmost\noverrated film of all time.  An entire squadron would not be sent into\nuncertain territory just to bring back one man who really had no purpose\nto\nbe saved.  There were several others out there just like him, I'm sure.\nAll\nof the people who didn't deserve to survive did. This movie was just a\nload\nof it.  Definetly not Spielberg's best and not Hank's best role.  Anyone\nwho\npicks this as one of the best movies ever needs therapy.\n"},
{"review": "\nAll in all this isn't a bad war flick, its got a good story that flows\nwell and i enjoyed it for the most part, there were a few moments that\nwere dull and slow moving but on the whole it moved well and kept me\ninterested. However the dialogue is not up to scratch in some areas\nparticularly when the band of soldiers first set out to find Ryan, its\nvery banal. A major problem i had with the film (and it is a fairly big\none) is the nauseating patriotism that emanates from it. This seems to\nbe a problem with others here as well, it's just irritating and spoils\nthe whole movie for me, it's hard to ignore it because it is felt\nthroughout the movie, in some parts more than in others, especially at\nthe end there where the American planes bomb the German positions and\nthe viewer once again has America to thank for saving the day. I just\ncan't stomach that really.\n"},
{"review": "\n\nWhen it came out, Saving Private Ryan was lauded for it's \"realistic\ndepiction of war,\" and for its \"attention and sensitivity to the common man\ncaught up in the sway of forces far beyond his control.\" It was supposed to\nbe a story about the men more than a story about the war.<br><br>Unfortunately, it was none of these things.<br><br>The message of this movie seems to be that war is a very deeply affecting\nand moving experience, as long as you're an American. Common everyday plain\nold American Teachers, as shown by Tom Hanks' character, are sent into the\nfray and forced to become fighting men. We are shown, however, that the\nhumanity of that Teacher is still there, even as he is fighting the \"Evil\nBloodthirsy Germans.\"<br><br>And this is where my problem lies. How can a movie that uses cookie cutter\nNazis, that treats German soldiers as simply \"the enemy,\" even make the\nclaim that it is a realistic depiction of war? Somehow, only the Americans\nin Saving Private Ryan have a human component, the Germans conveniently\nhaving lost theirs. Compare this with the Japanese soldiers shown in The\nThin Red Line and you'll see that Saving Private Ryan's praise for being an\nunderstanding and sensitive picture of that war is little more than a\njoke.<br><br>Now, I'm not saying i do not understand why the Germans are depicted as so\nflat. If I were Jewish and had family members who had been in concentration\ncamps, I probably wouldn't be able to depict Germans in anything but a\ndehumanized capacity either. Having said that, however, the dehumanizing of\nthe enemy, the labeling of a people and the flattening of their character\nand humanity, is what allowed the Germans to kill so many Jews.<br><br>This movie is anything but a realistic depiction of the Second World\nWar.\n\n"},
{"review": "\n\nTogether with \"Schindler's List (1993) and \"Platoon\" (1986), \"Saving Private\nRyan\" ranks as one of the greatest war movies of all time. Like \"Platoon\" it\ngives the viewer an \"in the trenches\" experience.<br><br>Spielberg has hit another home run with this one. The battle scenes are so\nrealistic and gut wrenching that the viewer is left with the impression of\nwhat the real battles were actually like. Spielberg conveys the uselessness\nand futility of war as we follow Tom Hanks and his squad in their search for\nPrivate Ryan following a devastating battle on D-Day.<br><br>Spielberg's two World War II masterpieces, Schindler's List and Saving\nPrivate Ryan should be required viewing at the high school level in order to\ninstill in our youth a sense of the sacrifices that were made over a half a\ncentury ago in order to preserve our freedom.\n\n"},
{"review": "\n\nWinning 5 Academy Awards Saving Private Ryan is without doubt one of the\ngreatest war movies of all time. Director Steven Spielberg does an\nexcellent\njob with this film. The choreography,  film editing, sound, and directing\nare superb. Specially the D-Day scene, which veterans called a precise\nre-creation of the real landing on Normandy. Along is the powerful cast of\nTom Hanks, Matt Damon, Tom Sizemore, Edward Burns, Giovanni Ribisi, Jeremy\nDavies, Barry Pepper, Adam Goldberg and Vin Diesel which makes the movie\neven better. The greatest war film of all time and one of the best films\nover all.\n"},
{"review": "\n\nCut off the intro and the epilogue bits -- start with the landing craft\nheaded for the beach and end with the scene in the street, and you'd have\na\npretty good movie.  I just resent it when Spielberg pulls out some kind of\nemotional 2x4 to repeatedly hit me over the head, saying \"feel this way,\"\n\"ok now this way.\"  Lacks subtlety.  I feel like I'm being very\npurposefully\nyanked around rather than being allowed my own reaction to the words and\nimages.\n"},
{"review": "\n\nIn the late 1980's, there was the Vietnam War backlash (\"Platoon,\"\n\"Hamburger Hill,\" \"Full Metal Jacket,\" etcetera, those of which were quite\ngood). And now in the late 1990's/2000-2002, there is the World War II\nbacklash (\"Thin Red Line,\" \"Band Of Brothers,\" \"Pearl Harbor,\"\netcetera)...only what it produces is not near as high quality as the Vietnam\nbacklash. The 'epic' \"Saving Private Ryan\" is no exception; the usually\ngreat Tom Hanks gives a sour performance, as does just about everyone else.\nYet another bitter installment in the WWII backlash fad.\n--Bud Sturguess, Texas\n"},
{"review": "\nThe story happened in the Second World War. Private Ryan's three elder\nbrothers were killed in battles. The US army decided to send Ryan back\nto home to alleviate his mother's pain. Captain Miller accepted the\ntask, though he was not satisfied with it including other members. It\nwas said that Ryan was in German-dominated-France-area. Every team\nmember knew its hardship.<br><br>The opening battle that happened in Omaha beach was fierce and\nunforgettable. The similar scenes also occurred in wonderful TV series\nBand Brothers. When Miller led seven people to execute the mission,\nthat reminded me of The lord of the rings. Of cause the task in TLOTR\nwas more difficult.<br><br>Life is precious. However a war can easily kill many people. The war is\nruthless so that you must be cold-blooded or get killed in battlefield.\nPeace is really what we should cherish.<br><br>An excellent thought-provoking war drama. 9/10\n"},
{"review": "\nSaving Private Ryan is a top WWII film and I've seen it a dozen times.\nAs the film starts we are presented with a hundred or so ships coming\nacross the sea. Suddenly violence erupts and soldiers are slaughtered\non the D-Day Assualt. In the assualt, Captain Miller (Tom Hanks) leads\nhis platoon up and around the German lines for a flank attack. <br><br>Across the ocean, a mother receives three KIA letters in the same day\nbut is promised that her youngest son, Private Ryan (Matt Damon) will\nbe found in France and sent home. On the Normandy beach, Captain Miller\nand his platoon will be sent on a suicide mission across France to find\nPrivate Ryan and battle across the German lines. Through the whole\nmission the soldiers are pushed to the limit with the death of comrades\nand questioning of the mission.<br><br>Steven Spielberg works his magic again with the presentation of one of\nthe most honored war movies in film history. Tom Hanks is strong, smart\nand above all good as Captain Miller. There is also a surprise with one\nof Vin Diesel's first roles as Private Caparzo. The violence is brutal,\nbloody, and well crafted. Each character is interesting and their fears\nand weaknesses are each expressed in the film.<br><br>Saving Private Ryan. Starring: Tom Hanks, Tom Sizemore, Edwards Burns,\nBarry Pepper, Vin Diesel, and Matt Damon.<br><br>4 1/2 out of 5 Stars\n"},
{"review": "\nI give this movie a four out of ten because the cinematography was\ngood. Other then that it was crap. The acting is terrible especially by\nVin Diesel, how the heck did he get that role anyway? The plot was\nridiculous and boring, the script was very poorly written and over all\nI am disappointed in both Tom Hanks and Mr. Spielberg. Now I know\nSpielberg loves to make movies about that era, of course he was too\nyoung for that war and too old for the next one, but hey, he's richer\nthen god, he can exploit anything he wants. The movie follows soldiers\nin the 75th ranger regiment as they land on the beaches of Normandy.\n(best scene in the movie). Tom Hanks is then given an assignment to\nrescue Matt Damon and bring him home because all of his other brothers\nwere killed in combat. So almost every man from Hanks' squad dies but\neventually Ryan gets saved. The Germans, of course are all incredibly\nunnattractive brutish men. In reality the war was fought by a bunch of\ntwenty-somethings on all sides who had no idea what they were getting\ninto. But the Hanks-Spielberg team completely redeemed themselves with\nband of brothers. So do yourself a favor, skip renting this, pay a\ncouple bucks more and pick up all ten episodes of B of B. It's a true\nstory based on real heroes of WWII, and the acting is not bad. Thats\nall. Save your money if you want to see saving private ryan, wait for\nit to come on ABC.\n"},
{"review": "\n\nI finally made time to see this film, expecting a visceral, emotional\nexperience.  Instead I was (in order) bored, angry, sleepy, and bewildered. \nIs this the groundbreaking film that everyone was gushing over last year? \nFrom all the talk I expected a head-on assault at the beginning of the\nmovie.  What I did see was a heavy-handed and frankly uninteresting battle\nscene.  From there the movie only got worse.  I didn't care a bit for any of\nthe characters, least of all the Tom Hanks lead and the obnoxious Matt\nDamon.  While the film looked spectacular, that's all it was: surface. \nThere was no depth whatsoever to any of the characters or situations.  I\nfeel like maybe there is something wrong with me that I don't see what all\nthe orgasmic gushing over this film is about.  Plain old\nboring.\n"},
{"review": "\nSo many people loved this film, that I actually rented the DVD to\nre-watch it. I had originally seen it in a movie theater, during its\ninitial release, and I hated it. The second time was certainly not a\ncharm. Possessing the knowledge of what was to come, made for an even\nmore boring movie experience. This film's much talked about opening,\nlends nothing to the paltry narrative that is the rest of the film. The\nmovie meanders about, aimlessly, for what seems an eternity, and almost\nnothing happens. When something does happen, it isn't anything that you\nhaven't seen, done by the same old characters that you've seen before,\nin countless other (and better) WWII films. Even the dialog is old\nHollywood corny. Then, after being about virtually nothing for hours,\nit ends with a hokey gimmick of the realization of who the old Vet is.\nMeant to tug at our heartstrings (nothing wrong with that); but only\nelicited a groan and a roll of the eyes from me. Tedious, with\nvirtually no character development. Not Recommended.\n"},
{"review": "\nDespite me giving this movie a 10/10(which I totally think it deserves\nby the way), and it being in my opinion one of the best war movies in\nrecent times if not of all time. I couldn't take Tom Hanks that\nseriously, I mean his acting was great, one of his best movies he has\never acted in. I couldn't take him seriously because he is the voice of\nWoody from Toy Story. I kept picturing Woody in the situations Tom\nHanks were talking through, which slightly annoyed me. This is more of\na nitpick as a person who has only seen all 3 Toy Story Movies before\nSaving Private Ryan. But I couldn't let that ruin the whole movie and I\nappreciated its very indulging yet graphic scenes and it really gave me\nan idea of what it was really like to be in WWII and what it was like\nto be a survivor of this immensely devastating War.\n"},
{"review": "\nJust reading the public comments on Saving Private Ryan on this sight\nmade tears come to my eyes. This movie captured my respect as a history\nlover in that it gave you just what is to be expected during an\namphibious landing in WWII. Saving Private Ryan held no punches on war\nbeing ugly, sicking and horrific. The only thing that was missing was\nthe smell of battle. The audio visual aspect was, it seems to me,\nbeyond perfect that I was really there on D-Day extremely scared while\ntrying to get off the beach. I recommend this movie to be seen by every\nU.S. president, senator, representative before taking office. I was\ntold that this war epic was so influential it made potential cadets who\nviewed it, turn down their West Point appointments. Even thinking about\nthis production will cause emotions to get the best of me.\n"},
{"review": "\n\nSaving Private Ryan is a war classic with the likes of Platoon, Apocalypse\nnow, Black Hawk Down, Hamburger Hill, etc. I really liked how as soon as the\nmovie starts it jumps right into the action!  This one was very graphic and\nintense, the acting was superb I personally got a real kick out of Barry\nPepper as the sniper with a clear consicence - I LOVED IT... also Edward\nBurns is in this w/ Giovanni Ribisi, Vin Diesel, Matt Damon, Tom Sizemore\nand of course the leader of the group Tom Hanks...<br><br>\n"},
{"review": "\n\nIf there was one thing that allowed the Nazis to almost take over the world,\nit was there revolutionary tank strategy - masses of tanks working in\nperfect co-ordination.  In this film, single Panzer tanks just go wandering\naround the countryside at will, till they bump in to something.<br><br>This film is formulaic in extremis - every scene you've seen before, only\nbetter.  You know the scene from a hundred films where a character is in the\nthick of tumultuous action, then ducks under water and it all goes silent,\nrepeated 3-4 times?  Well yes, that's here, only when the guy pops up all we\nget is a few popping and spluttering machine guns.  The sound throughout\nthis film is the worst ever in any war movie.  Even the crumbiest soap\noperas today  have the background hum in group scenes, bars, etc.  Not here,\nyou mostly just here the character in focus, the troop of soldiers standing\naround are silent.  The claim to reality made by some must be down to ten\ndollars worth of offal spread around the bodies.<br><br>Even dialogue is without any conviction - people did use the f-word then of\ncourse but not in the repetitive way which has become the fashion now.  In\nfact, the french referred to GIs as 'La Beetch' after the phrase which all\nGIs used all day long - \"Son of a bitch\".  I didn't hear that used once in\nthe whole film.<br><br>It is sad that such a ridiculously unrealistic and unbelievable film should\nbe given so much ill-deserved credit.  I would recommend \"Cross of Iron\",\n\"The Victors\" or \"The Train\" instead\n\n"},
{"review": "\n\nThis is one of the best movies I´ve seen in my whole life! Tom Hanks is\nbrilliant, Janusz Kaminski´s cinematography is absolutley great, John\nWilliams music is (as usual) very, very good and Spielberg´s directing is\ntotally brilliant! The movie is very realistic and shaking, but I think\nthat\nthose who hasn´t seen this masterpiece should do it, even if they can´t\nstand bloody scenes. I strongly recommend Saving private\nRyan!\n"},
{"review": "\n\nIt seems that those that are critical of SPR, they are all hypercritical for\ntheir own personal reasons.  Let's back up and look at this movie as a film-\nbecause that's all that it is, a film.  For those of you that see a\nrepresentation of the Americans as the good ol' boys and the Germans as the\nbad guys, let's remember the scenes where the Germans were brutally shot at\npoint blank range with their hands in the air to surrender.  Anyone who\nmisses the point that the Germans were just as human as the Americans were,\nmisses the point all together as I see it.<br><br>I don't see where Spielberg makes them look any better or worse than we or\nany other soldier was in the war.<br><br>As far as steering from the truth, anyone that has followed ANY historical\nmovie knows that there are certain artistic licenses taken to embellish the\ndepiction.  If historic films were depicted one hundred percent as they\nactually happened they would ALL fall under the documentary category.  This\nis NOT a documentary and shouldn't be judged as such.<br><br>I purposely don't/haven't watched war films because I abhor violence and the\nuse of violence as an ends to ANY means.  However I saw this film because I\nhad heard that it is one of the best representations of what happened on\nOmaha Beach and the tragedies of war.  Never had I been so moved and truly\nfelt how horrible it must have been to be there  or in any war.<br><br>It is a film, and just that, a film.  An interpretation by Spielberg of what\nhappened.  Be critical of what the film meant to you and how you feel, not\nof what was in the film.   \n"},
{"review": "\nIn reading through the comments made on this page, I realize that people had\nseveral interpretations and opinions of what this movie was supposed to be \n(as people often do).  However, here's how I feel the movie was intended,\nand why I say that this is by far the greatest war movie, and one of the\ngreatest movies of any genre.\nThe prevailing comments among nay-sayers is that the characters were too\nstereo-typical, and that a plot of one man being important enough to risk\nthe lives of 8 was unbelievable.\n \nThat's exactly what Spielberg wanted.\n \nFirst, the characters.  They were _intended_ to be stereotypical.  How could\nyou represent every man that ever fought in this, and other, wars without\nbeing stereotypical?  Unless, of course you wanted to have a cast of\nseveral million people.  The point was to show the trevails that every man\nwent through in the war, NOT to give a unique face to each.\nAnd it seems he did this with his usual mastery.<br><br>Second, the plot.  The mistake that most are making is that they're thinking\nof Private Ryan as one man.  He wasn't.  He was everyone.  Every person\nthat was sitting in that theater.  Every person that has ever been a part\nof this country.  \n \nWhen he tells Ryan to \"Earn this\", he is talking to YOU. He is saying that\nwe're not here today by accident.  It took normal men (a school-teacher,\nfor instance) to make sure that we could someday go on IMDB after seeing a\nmovie and spout our opinions. He is telling you not to waste the precious\nlife you've been given.\n \nSo, yes, this is perhaps the greatest movie of all time, shaky camera or\nnot.  And they fought so that I could sit here on my soapbox and give my\nopinion.\n \nThank God.\n"},
{"review": "\nSimply the best recreation of the most harrowing battle in the history\nof 20th Century warfare. June 6th, 1944 - France. Epic, jaw dropping,\neerie, disturbing and engrossing. That is just the first 20 minutes.\nUnbeatable storytelling, cast and performances. A must see for all! Tom\nHanks at his best. It contains all the elements of noble storytelling\nwhich is representational of all nations who fought on D-Day. This\nmovie captures the fear and terror as can only be imagined by those\nwhom were not there. I myself got a true taste of that fear while\nstrapped into a Chinnok Helo over Afghanistan in 2011 when we were shot\nat. To be trapped in a bus with no way out but forward through the hail\nof maelstrom is an experience I will. Never forget, and I am eerily\nreminded about during the opening scenes.\n"},
{"review": "\nThis is one of my favorite movie. I really enjoyed the story line and\nthe action in this film. I am a fan of military movies because they are\nempowering to see how we must stick together. I really like how the\ncolor correction put me in the action along with them. The camera\nmovement was on point. I would love to work on a film like this. I\ncould relate to this movie because my father use to be in the military.\nWhat really got my attention was the sniper scene where they were\ntrying to save that little kid and family stuck on a roof top in the\nrain was deep. Then the sniper begins to shoot one of the soldiers.\nThat sound of a broken piano was kind of shocking. This movie is a\ngreat film and I recommend it to everyone.\n"},
{"review": "\nThis movie hit me hard with emotion with just the first 15 minutes. The\ninfamous opening scene is something you can never truly prepare for.\nSure, gore isn't the worst for many. However, I remember when I first\nsaw it at a young age I cried because I knew that ever injury you see\nhappened to a real person at one point in our history. The thing I\nappreciated most about this movie is that there was not sugar coating\nanything. The people in this movie are mirroring true events, meaning\nthat people do die and people suffer. You go back and forth on the\nreasoning behind the plot, which is sending a group of men to save just\none life. It really plays with your mind. A group of men are worth more\nthan just one, right? But what about that one man's mother who already\nlost three of her four sons? There is no right answer in a situation\nlike that. Someone has to suffer. And that's what happened in the war\nto so many real people. This movie is a great reminder to appreciate\nwhere we are now. There are people out there to this day who are still\nsuffering because of this war, while we live our everyday lives. I\ndefinitely recommend this movie to anyone (maybe not the younger ones\nout there considering the gore) because it is a great portrayal of\nhistory.\n"},
{"review": "\nThis movies opening scene is one of the most brutal, horrific, yet\naccurate representations of war I have seen. This scene sets the mood\nfor the whole movie. While the rest of the movie is not quite as\nintense, it quickly involves you in the characters and you sympathize\nwith them because of what they have endured. You truly care for them\nand are interested in their well being. The realization that what they\nhave experienced is only the beginning of the story is a grim one\nindeed. The war is not over, and thus it is not finished shaping the\nmen in focus. They will be molded and formed in innumerable ways as the\nwar takes a hold of their psyche and their lives. In conclusion, I\nbelieve this is the best war movie of all time and one of if not Steven\nSpielberg's best films.\n"},
{"review": "\nThe best film I have ever watched. It includes action and drama. And\nthese are combined with a proper way. Every one should watch this film\nwith a good surround and vision system. So that it influences you more\nlike me :) Of course it will be best to watch this in cinema but not\npossible right now I suppose. Especially some scenes are really\nunforgettable. By watching this film you can understand how bad a war\nis especially when it is a World War. I still couldn't understand how\nSaving Private Ryan couldn't win the best Picture award in 1999.\nAmerican Beauty isn't as impressive as Saving Private Ryan. This film\ndeserves to be in top 10 in IMDb. Please watch and decide yourself.\n"},
{"review": "\nOne of the best Army based movies iv ever seen ! Beautifully shot ! So\nRealistic at that time ! Great Cast and Full Effort !<br><br>Emotional and energetic movie ! The Movie Is Awesome &lt;3 <br><br>I watch this movie many times but every time there is a Joy!<br><br>Any movie which is based on true story is always close to my heart but\nthis movie takes the lead :)<br><br>Ap log is movie KO watch Karna :p<br><br>Marvelous acting ... Love to see V. Diesel in Army suit ! <br><br>Tom Hanks was awesome ! <br><br>Matt (Y)\n"},
{"review": "\nIt's a very well made movie, I especially enjoyed the part where they\nare enjoying the beach together. Even though the weather is bad.<br><br>The movie starts with buddy army guys getting on a boat to travel to\nFrance together and enjoy a lovely summer. Although the beach in France\nis already occupied by angry German visitors that polluted the beach\nwith their junk.<br><br>Its the army their task to clean the mess up and tell the president of\nGermany that their country tourists are pigs and need to clean up their\nmess.<br><br>It could be a summers best if they left out the angry Germans. But\nwithout them it would be a silly movie.\n"},
{"review": "\nAfter the most amazing recreation of a war epos in one shot (or how to\ncompress a wonder movie like The Longest Day in 20 minutes), Tom Hanks\ngraces us with a personal travel through Normandy based in personal\nweakness and group strengths. How a literature teacher, with experience\nin summer basket teams, can cope with the horrors and unsensical\nsituations of a total war? Just following the logic of the situation:\nfield manual up to the core and thinking that every life lost\nrepresents ten saved. \"Angels on our shoulders\" will grant us the\npossibility to earn a full life. Do we deserve it? Only a row of\nmarbled crosses will be able to answer... Why then not a 10? Simple...\nI have seen German War graveyards... where each cross is shared by 3\npersons per side. With people from early 50's to those that barely\nreached 18. War is hell for all... not only for Private Ryan.\n"},
{"review": "\nThis movie is (in my opinion) Spielberg's best, and when it comes to\nwar movies, a strong contender for the best war movie ever. The\nstoryline makes you question the mission and the sacrifice of lives in\nwar throughout the whole movie. The story is touching and made me angry\nat the same time. The great cinematography and equally great special\neffects emerge you in the story. The cast is great, and works great as\nan ensemble. Typical for a Spielberg movie, John Williams made the\nmusic, and didn't disappoint. It brings war and all its terrors to\nscreen in a more emerging way than any other movie (e.g. the opening D-\nDay scene). An absolute must see movie, especially for war movie fans.\n"},
{"review": "\nBest War movie out there. Although Band of Brothers is better but that\nisn't a movie but I highly recommended that to anyone. This is\nHollywood best film that portrays war to date! This movie doesn't show\nglory of war. <br><br>I'm a huge WW2 buff and my Grandfather(on my mother's side) served with\n691st Tank Destroyer Battalion during the European campaign with the\nU.S. I also had family member, who was a U.S Marine that died on the\nU.S.S California during the Attack on Pearl Harbor.<br><br>In the end this a well made film fore every film lover because it is an\nexcellent war drama that puts you in the war with really develop\ncharacters who are not portrayed as heroes.\n"},
{"review": "\n\"Saving Private Ryan\" is the best WW2 film out there. It starts off\nwith a memorable 25 minute opening sequence which is arguably the best\nscene in a Spielberg movie. It is highly realistic for its time and\nit's tense from beginning to end. At the end of the sequence, it shows\nyou a dead soldier from the \"Ryan\" family. Later we find out that 3 of\nthe 4 members of his family died and Capt. John Miller (Tom Hanks) and\na group of 7 soldiers are sent to bring the remaining brother back to\nhis family before he dies as well. With an unforgettable story, the\nplot is quite moving even just thinking about it. The movie was also\nexpertly shot and acted. Every action scene is realistic as it is\nbloody. After soldiers are killed off, it makes the soldiers question\nif the mission is worth it and it often creates conflict with them. The\nfinal battle has a big buildup and carries on for just the right\nlength.The ending is tragic and it gets me every time but its emotional\nresonance sticks with the viewer after watching it. This is one of the\nbest films of the 90's due to its impact on the viewer.\n"},
{"review": "\nOne of the most important movies of the 1990s and a triumph for Steven\nSpielberg, helping to keep alive the story of the Greatest Generation\nand remind us of the sacrifice of war.<br><br>Spielberg takes time to introduce us to a small band of soldiers,\ngetting to see the end of World War 2 through their eyes. The movie\nfollows the last days of the European war, as the American forces push\ninto France against a Nazi army that is not yet ready to give up. To\nsay much more would be giving away major plot developments, but the\nplot features several major surprises and gripping battle scenes.<br><br>\"Saving Private Ryan\" also features an incredible cast, including Tom\nHanks, Matt Damon, and many cameo appearances from Nathan Fillion, Ted\nDanson and others.\n"},
{"review": "\nThis film is lauded as one of the greatest films of all time and I do\nbelieve this film is fantastic, but I believe that it is not a ten out\nof ten film for a few reasons that I will explain. This film is based\nin ww2 and the start of the film is the invasion of Normandy better\nknown as d-day. After the battle a group of 8 soldiers are sent on an\nimportant mission to rescue a private who's other brothers have been\nkilled recently. Now tom thanks is now established as one of the best\nactors ever and it is films like this that is why. His performance as\nthe commander felt real it felt like he knew his duty but he was\nrelatable to us because of the way he acted in certain situations. This\nman is a superstar and he truly encapsulates everything that this\ncommander has to go through. The supporting cast all also do a really\ngood job, this film is not a character study film but everything the\ncharacters go through make you feel for them and empathise with the\ncharacters. Now the story is where I actually think this film slightly\nmisses, I do believe it plays up the war part of the story well and\nalso the social issues that are explored should be applauded and are\nvery good. However, towards the middle of this film it just felt like\n30-40 mins could have been cut out because nothing relevant to the\nstory happens and it could have been done in a better way. The script\nis really good with the dialogue feeling natural among war buddies and\nit also makes you feel like you are in battle with them. The style is\ngreat I applaud Spielberg for making this film more realistic with the\nbrutality because that was how war really was. A lot of directors try\nto pc it but not a top director and it adds to the realistic gritty\nfeeling that this film possesses. This is a heavy film and it can be\nhard to watch sometimes but it is a fantastic film that truly delivers\non its message and does indeed deserve a lot of praise.\n"},
{"review": "\nGripping, horrific first-person experiences in the thick of World War\nII, as you're already, no doubt, keenly aware. It's held up\nexceptionally well over time, most likely due to the great lengths\ntaken by Spielberg and company to stamp it down in a specific era and\nremain steadfastly historical. The Normandy beach landing that opens\nthe action is still as powerful and haunting as ever, an effects\nshowcase like none other that puts us right down in the middle of hell\nitself. I couldn't help but pontificate about the futility of ground\nwarfare here, faced with row after row of doe-eyed teenagers,\nunceremoniously mowed down before taking so much as a single step on\nenemy territory. Which is part of its message, no doubt - though that's\nsomewhat countered by the tales of bravado, camaraderie and character\nthat sprawl out over the next two hours. A richly rounded war story, it\nenjoys a mess of acting performances even stronger than the work of the\neffects team. Tom Hanks is at the top of the mountain as Captain\nMiller, a demanding role that he owns from moment one. Supporting faces\npop out of the woodwork at every corner; most of us remember Vin Diesel\nand Adam Goldberg in early roles, but quick shots from Paul Giamatti,\nTed Danson, Bryan Cranston and more left my jaw agape. How did I miss\nspotting these guys the last time? A true epic, profound and moving,\nwith plenty of action but just as much character-building and adventure\nalso in the mix. One of Spielberg's - and Hanks's - best.\n"},
{"review": "\nThis movie maybe is not in first ten or twenty movies on Top 250 list,\nbut it's worth to be watched like many best rated movies. It's just my\nopinion... Great drama, very realistic war scenes, it is enough for me\nto be one of my best watched movies ever! I watched this movie much\ntime ago, and I think that all time later there is no movie which leave\nsuch strong impression on me like Saving Private Ryan. Movie won five\nOscars, absolutely justified, and #34 on Top 250 - all that is\nsufficient recommendation to be watched. Tom Hanks play the role like\nalways - brilliant! Also, and complete film crew deserve all the\npraise... World War 2 thematic with all these realistic photages\ninsight you in all misery and suffering of this war.\n"},
{"review": "\nGreetings from Lithuania.<br><br>I can not really say anything about \"Saving Private Ryan\" (1998) that\nwas not said before countless of times. I'm just going to praise it one\nmore time. <br><br>\"Saving Private Ryan\" is a masterpiece of movie-making, it's true.\nAlmost no other war film can't take you to the place like this picture\ndoes. \"Apocalypse Now\" and \"Saving Private Ryan\" are the best war\nmovies ever. Very different, yet very similar on the note of anti-war\nideas. Now back to \"Saving Private Ryan\". The opening scene is ...\nwell, you all know, it's a jaw dropping experience, and i mean,\nexperience - for a 20 min you can partly feel what is war and how it\nwas to a soldiers on that day. This scene alone is a excruciating\nmasterpiece. The film settles then in to a journey through hell\npicture, it still remains unforgettable. No matter how many times you\nare watching \"Saving Private Ryan\", it grabs you from the opening scene\nand does not let go this the very last image. As i don't think there\nare people who never saw this film, i can just say, watch it again.\nIt'a a film to remember, and to learn. It'a a masterpiece on all\nlevels.\n"},
{"review": "\nThis is my favorite war movie. I like it except the final battle. Our\ntroops totally got ripped to shreds. Cpl Upham, he is a coward. I know\nhe isn't used to this combat, but he is essential to all the other\ntroops. He is carrying the extra ammo. He was too scared to help that\nprivate fight that enemy troop and was to scared to give the troops\nmore ammo to the MG. If I was him, I would've been scared too, but I\nwould've done it anyway for my brothers. Also, in the beginning, when\nthey opened the door to get off the landing craft, you are already\ndead. I think that's crazy. Plus, when they confronted the real Private\nRyan, he refused to go home. Isn't that a rule in which if all your\nbrothers die, you are supposed to go home?\n"},
{"review": "\nThis movie was an immense gathering of suspenseful, action-based,\ndramatized scenes. I saw this film when it came out but I was just a\nkid. I saw it again and again for years to come only to like it more\nevery time. The rawness and originality in the art of the battle scenes\nis just amazing; the gore, the sadness, the cinematography, it's all\nthere. I'm not even a big fan of Spielberg's work and aside from\nSchindler's List, this is the only other film that I love by Spielberg.\nI give it a 9 for its long driven awesome plot with WELL developed\ncharacters(main, supportive, etc.) and gruesome battle scenes. The use\nof foreign languages when needed was also there. An overall well\nwritten work of art.\n"},
{"review": "\nI've never been in the military, let alone been in any type of real\ncombat situation. Despite this, I feel like I have a semi-realistic\nidea of what it would be like; and that is absolutely horrible. I can't\nsee any good that a soldier can take away from combat and this film\ndoes a remarkable job of depicting the ugly truths of this, in a way\nthat almost anyone over the age of 12 can appreciate. If you are\nattempting to shield your child from the ugly truths of life on this\nearth and specifically American history and war, then don't show them\nthis film. When watching this film, I can actually feel the pain of the\nprotagonist as he fights his way towards his objective. Obviously, this\npain is nowhere near the level of what the soldier whom this film was\nbased off of and all others directly involved actually felt, but I feel\nit is as close as you can get without being involved. This film\nincorporates fantastic writing, CGI, cinematography, set-building,\nacting and basically every other level of production to create the most\nrealistic World War II Normandy depiction I have ever seen. The only\nreason I would not rate this movie any higher is because that would\nmake it a 10 and I believe perfection is impossible in the art of film\nproduction, but it's about as close as it gets without 3D or any other\nrealism enhancing technologies. Watch this film and gain a better\nunderstanding of what many of America's young men were experiencing at\nthe time of the second world war and also how they were mentally and\nphysically effected from the horrific events which ensued.\n"},
{"review": "\nIs the mission worth the man? This question must be answered by Captain\nJohn Miller, as he takes his fellow platoon of soldiers deep behind\nGerman fortifications in occupied France. Following the infamous D-Day\ninvasion Captain Miller and his men must traverse the dangerous Nazi\ninfested countryside to find Private James Ryan, so that he may return\nhome among the chaos that is war.<br><br>Not only one of the finest war movies ever crafted, but one of the\nfinest human dramas ever filmed. Through the backdrop of World War II,\nSpielberg delivers us right into the action, suspense and heart felt\ndrama. Filmed in a guerrilla style like approach helps to enhance the\nrealism of this film. Perfectly acted by Hanks and company, one will\nfind themselves immersed and truly caring for these characters as the\nfilm plays on. Said to have made veterans weep during its release and\nduring its intense first thirty mins, as its depiction of the events of\nD-Day upon the beaches of Normandy to be the most realistic and finest\never captured on film. The world of war torn Europe and the brave men\nwho fought there is brought to life with not only the masterful\ndirection of Spielberg, but with the haunting and heroic score by John\nWilliams. Hanks delivers one of his finest performances, and this movie\nis one of the finest to ever have been made.\n"}
]