[
{"review": "\nThis is one of the most terrible movie I've ever seen. A torture. I\ncould barely stay still on my sit. I almost left the room 1 hour before\nthe end. But I stayed, hoping for something good to happen. But\nsomething good never happened and the ending is even worst that my\nworst expectations.<br><br>The trailer was such a lie. I was expecting something dark, mysterious\nand brainy. Something like The Dark Knight. Instead it's only military\ncrap, dinosaurs fight and worthless American patriotism. Makes me sick.\nThe movie dies with Bryan Cranston. The only problem is that his part\ndoesn't last half an hour.<br><br>Godzilla wasn't an earthquake. It wasn't a typhoon. It was just sh*t.\n"},
{"review": "\nFirst I need to tell that I am from Central Europe. I am not writing\nreviews but I can't be silent. This was terrible. This was 1st time\nwhen after movie everybody was talking how bad it was. And everybody I\nmean whole cinema.<br><br>First 20-30 minutes were watchable. It was looking to be a solid movie,\nbut after that everything goes wrong. And I mean everything... Bad\ndialog's; good music in very bad moments and several styles of it; main\ncharacter immortal; American happy ending style; no logic in this movie\nanywhere; many mistakes noticeable for everyone...<br><br>If a Uwe Boll have more money, he will make this movie better. When I\nwas watching Sharknado, I was less shocked by stupidity like in this\nmovie. It is waste of your time and money and watch it only when you\nwant to punish yourself.\n"},
{"review": "\nWorse film ever! save your money and don't go. Godzilla is only in the\nfilm for a maximum of 10 minutes, the rest of the 90 minutes or so,\nthat I lost of my life, is filled with mediocre acting that was about\nas exciting as treading on an upturned plug with no shoes on. I got the\nimpression that the majority of the budget was spent on the sets and\nactors, leaving the effects for Godzilla until last, which resulted in\nhim having minimal time in the film. Literally, up until the 70 minute\nmark, you only saw a tail and a few spines from his back. When a\nheadshot finally materialised, it was only for a matter of seconds. I\ngenuinely feel short changed and would strongly recommend that anyone\nplanning to see the film should wait for it to come out on DVD.\n"},
{"review": "\nI wasn't sure if I should have gone to see this movie, but then my\nfriends asked me to go and see it with them, so I did. After seeing the\nmovie I thought that paying for seeing this movie was a mistake. I have\ngenerally somewhat liked movies like Godzilla, but this one was a\nbitter disappointment for me. I can't point out a single reason for why\nI disliked the movie, because there were many things that made the\nmovie unenjoyable. To begin with, I think that the story and plot felt\nunfinished and unwieldy, with no surprises at all. Another sin for the\nmovie were the paper-thin and indifferent characters, who stayed\nirksomely distant for the whole two-hour length of the film. In fact,\nthe characters felt so distant and glued-on-top, that I could have\nwatched the entire film without seeing any of them. Finally, the last\nstraw was the way too long and unsurprising ending battle. All in all,\nthis movie was sadly not worth watching in my opinion.\n"},
{"review": "\nFinally sat down to watch this movie today. After all the hype it had\nhad it's fair share of great moments but in the end felt something was\nmissing. I'll agree with many that Godzilla wasn't shown as much as he\nshould have and maybe that was what missing or maybe it wasn't.\nNeedless to say even though Godzilla doesn't make many appearances in\nthis movie it still is a rather good movie with a an interesting story\nline. The best way to go into this movie is to not buy into Hollywood's\nhype because if you go into it like that you will be disappointed\ngreatly. Overall I was satisfied with Godzilla. Great story, special\neffects, and even the acting was pretty solid. Worth the 2 hours for\nsure. Sit back, grab some popcorn and beverage and enjoy!\n"},
{"review": "\nThis film couldn't decide what it was, they wanted to put action into\nit but this is primarily a drama. Godzilla is meant to be an action\nfilm, it should be action packed. Any time it got to action it would\nchange scene onto a character I couldn't give two shits about. <br><br>Also why is it that Godzilla and the MUTO's have the ability to be\ninvisible? how is it that nobody could see these 100ft monsters until\nthey were right in front of them? how comes Godzilla's footsteps don't\ncause mini earthquakes in the train scene he should have shattered all\nthat glass with him stamping like that. this is 2014 they had enough\nmoney CGI is advanced enough.<br><br>Godzilla looked freaking awesome the few times we actually got to see\nit more Godzilla in a film could Godzilla would be nice.\n"},
{"review": "\nI LOVED this film. The sounds and special effects and editing of it was\njust amazing. Godzilla was teased and then revealed extremely well. A\nlot of people complain that they didn't like the short amount of screen\ntime he got, but i think it was great directing and writing! It wasn't\ntoo 'destroy everything' but it wasn't too much drama. All bad reviews\nof this film I've seen have been mainly because (spoiler) Bryan's\ncharacter died early on which wasn't forbade in the trailer. I think\nthe surprise of it was very good and really change up the film with\nthat person 'who was right in the end'. I think this film was\nphenomenal and i wouldn't be surprised if it wins an Oscar for best\nspecial effects.\n"},
{"review": "\nOld memories never die. I was living in Tokyo in 1954 the year that\nGodzilla first appeared and destroyed most of the City. It is something\nthat I have never forgotten to this day. OK I know this guy is nuts. I\nwas not even alive in 1954. I saw the Movie when it came out Thursday\nNight and had to sleep on it. After absorbing it all in I think I can\nsay that I really liked the Movie and think that most Movie goers\nespecially hard core Godzilla fans will like this Movie. Give it a shot\nand see what you think. I have seen every Godzilla Movie that I can get\nmy hands on and think that this may be my favourite. Now we will have\nto wait and see if they will recycle any of the other Japanese\nMonsters. Gamera, Mothra or any others.\n"},
{"review": "\nIt is my first review..I waited this movie since announcement.Since\nmovie's release i checked RT score and metacritic.Some were\ndisappointed.Maybe they are not monster kind person. First in IMDb it\nwas 9.3 ,when i checked.After that it started decreasing. In 16th of my\ni immediately bought a ticket and went to watch it.Unfortunately in my\ncity there is no IMAX 3d theater ,so i handled real 3d. When movie\nstarted first part was kinda drama. Bryan Cranston acted\nperfectly.Maybe he will be nominated for best actor in supporting\nrole.Emotional part describes history of Godzilla and arising new\nMUTOS.After first break action part was just stunning.I was amazed by\nCGI and sound effects. Roar of Godzilla and other monsters makes you\nthrill.In movie i think i saw Godzilla just about 20-30 minutes, but\nwhen i saw ,it was cool.That few minutes was enough for my\nexpectations..(sorry for my English mistakes)\n"},
{"review": "\nPeople who didn't like it should go and check their eyes.<br><br>Visual ? 10/10. Audio ? Maybe 9/10. Doesn't matter, 10/10. Story ? I\nwould SERIOUSLY give it only a 6/10, but the message is clear: Nuclear\n= bad. So 10/10. Actors ? Like, seriously ? Aaron-epic. Bryan-epic.\nElizabeth... I didn't heard of her before but she's darn cute and\ntalented. They all played very well. You can tell is kinda hard to send\nthese emotions while watching a green screen, because that's what they\nwere doing while shooting this movie. They were watching a green screen\nwhere Godzilla or MUTO should had been, and they must look surprised\nand scared. And... they did a great job.<br><br>Plus, you have a couple of epic moments with Atomic Breath. When\nGodzillas spine started to turn blue I lost my s*it. Roars... ? They're\nthere. Oh God, yes they are. 3D IMAX was beautiful. Go and watch it. <br><br>And I hope these guys are gonna make another Godzilla movie. It\nseriously made me become obsessed with the movie and the character\nitself Godzilla.\n"},
{"review": "\nLet's just be short and blunt. This movie is worth the watch. Its\nnothing like the embarrassing 1998 film based in new York and the \"worm\nguy\" its not campy nor a let down this is getting Godzilla back to its\nroots as king of the monsters. Love it.let's also say this movie earns\nmy rating for the fact it doesn't have one, not two but three freaking\ntitans (Godzilla included in this count) The actors did amazing there\nparts where very believable which us nice. The CG is simply amazing.\nThis movie keeps you at the edge of your sit straight from the\nbeginning. I'm am happy to be a part of being a viewer of this movie.\nSome will not agree with me but that's OK in my opinion. Thanks for\nreading and keep it robot friendly.\n"},
{"review": "\nTo all the people who complain there wasn't enough Godzilla in this\nmovie: Have you ever seen the original Gojira (1954)? Or ever heard of\na thing called 'tension-building'? Surely not.<br><br>This film was everything I hoped it would be and then some! The\ncharacters were all great, there isn't a single bad performance -\neveryone treats this with respect and add an appropriately serious tone\nto the film. Ford Brody is my favorite as his strict code of Honor and\nmorals was put to the test by malevolent creatures, which created some\nbrilliant dilemmas and great duo scenes with his father (played\nbrilliantly by Bryan Cranston). Themes were perfectly adapted from the\noriginal Gojira, which makes this 10x more dark and gritty!\n"},
{"review": "\nGodzilla was absolutely amazing. The graphics, storyline, and\ncharacters all created a positive attribute to the movie. The director\ndid a great job in reincarnating the movie in 2014. The graphics were\nmore than I expected as detail was put to Godzilla, which at first\ngoing into the movie I thought would be different. Then there are the\nMUTO monsters who were also detailed. Moving on to the storyline, it\nwas easy to follow and understand what was happening compared to other\nrecent movies I have watched. The characters or the actors nailed each\nrole which helped the movie become better. I would also like to note\nthe soundtracks used for the movie were awesome. Overall the movie was\nexcellent and I recommend that you watch it.\n"},
{"review": "\nSPOILER ALERT<br><br>The movie is absolutely terrible and I will give you ten reasons not to\nsee it:<br><br>1. You sit through a two hour Godzilla movie and don't see Godzilla for\nover an hour into the show and even then you only see him for about 20\nminutes.<br><br>2. The digital art and video graphics are not of high quality.<br><br>3, There is no character development and I found myself not caring what\nhappens to any of the main characters.<br><br>4. The movie starts out with Brian Cranston which is cool but he is\ngone after a very short time leaving viewers confused<br><br>5. The plot made no sense at all<br><br>6. The movie is shot in very dark colors to hide the fact the digital\neffects are poor<br><br>7. It is boring - I was waiting for something to happen and it never\ndoes<br><br>8. It is terrible<br><br>9. It is bad<br><br>10. You will be glad when it is over and you never have to watch\nanother second\n"},
{"review": "\nI have loved Godzilla since I was knee high to a grasshopper. I have to\nsay this is the worst one ever, and yes I include the Matthew Broderick\nversion in the running. The \"star\" of the movie seemed to be the\nnuclear bomb. It felt like the bomb got more screen time than Godzilla\ndid. This movie felt more like an anti nuclear power protest than it\ndid a movie about Godzilla.<br><br>I watch Godzilla movies so I can see the namesake of the movie, come\nout of the ocean, destroy a major metropolitan city or two, possibly\nfight off some other major monster in a titan monsters MMA grudge\nmatch, then cheer as he escapes back into the ocean until the next\ntime. <br><br>Frankly, this bomb should have been called, \"The Bomb,\" guest starring\nGodzilla.\n"},
{"review": "\nAre we really that gullible as consumers? The movie magicians\nhocus-pocused us into spending $12 to see this unforgivable trash. The\ndialogue is long and tedious, the monsters clear rip-offs of\nCloverfield, and the three and a half minutes of actual Godzilla scenes\nvery disappointing. I enjoyed the Matthew Broderick mess of a Godzilla\nfilm much better than this. And I could actually see the action. This\nmovie is dark and difficult to watch. Everything about the 2014 version\nsmells of a $$$ making opportunity with us being the real victims. <br><br>Give me the actual Japanese version of Godzilla any day. This movie\nflat-out stunk. Stink....stank....stunk!\n"},
{"review": "\nDefinitely the best Godzilla ever--Although I was also a fan of the\n1996 film, this version blew me away.<br><br>The CGI Special Effects were the best ever. This was an unusual film in\nthat you see most of the action from a spectators point of view,in the\ndistance, with many incredible and shocking scenes.<br><br>The last half of the film is definitely more exciting than the first\nhalf, with almost non-stop action and spectacular special effects.<br><br>This film was a huge hit, grossing 200 million dollars in the USA\nalone. Don't miss it.<br><br>I'm hoping there will be a sequel\n"},
{"review": "\nI thought that this movie is the best Godzilla movie that we have in\nyears. Godzilla is back and better than ever with a cool looking design\nand of course atomic breath! This is my favorite movie of 2014 and\nwe're glad to see the return of the king of the monsters on the big\nscreen. The MUTO's (Massive Unidentified Terrestrial Organism) are a\nthreat and that's not a bad thing cause they look great. They sure know\nhow to give Godzilla a challenge in the final fight. Some people don't\nlike the movie mainly cause of the screen time of Godzilla. But does\nthat stop me from liking the film? No, of course it won't. If you're a\nhuge Godzilla fan like i am, definitely go see it. You will not be\ndisappointed when you see it.\n"},
{"review": "\nI hate it when the people say there wasn't much action. The original\nGodzilla focused on the humans, and Godzilla was the result of nuclear\nactivity and taught a very valued lesson about the environment.\nGodzilla has only had limited amount of screen time through out the\nmovies by TOHO, the creators. The Godzilla from 1998 was a disgrace and\nwasn't even Godzilla, because TOHO made a movie after that, that kicked\n1998's butt. TOHO watched 2014 Godzilla and said it was a fantastic\nmovie, but that wasn't why I went to see it. The movie was great, it\nhad beautiful camera work, and it was suspenseful. The movie kept you\non the edge of the seat, and the initial roar from the God himself\nmakes the theater rumble. I'm sure everyone's inner child was\nsatisfied. If you haven't seen the movie, you should. TOHO loves the\nmovie, why shouldn't you? All and all, this movie is a great addition\nto the Godzilla franchise and I cannot wait for the sequel.\n"},
{"review": "\nOK, first off I am kind of angry with some of the critics. Don't go\ninto a GODZILLA based movie with monsters and expect this awesome plot\nthat will blow your mind. What you should expect is great cgi,\nmonsters, and things freaking blowing the hell up. They delivered with\nflying colors on that note. There were parts in the movie that my mouth\ndropped with excitement. They went all out on the cgi effects. It was a\nlot of fun to watch. Go into this movie with action and monsters in\nmind PLEASE! Best quote for this movie: \"Damn nature; You scary!\"<br><br>\"Godzilla\"<br><br>With a purposeful grimace and a terrible sound He pulls the spitting\nhigh tension wires down<br><br>Helpless people on a subway train Scream bug-eyed as he looks in on\nthem<br><br>He picks up a bus and he throws it back down As he wades through the\nbuildings toward the center of town<br><br>Oh no, they say he's got to go go go Godzilla Oh no, there goes Tokyo\ngo go Godzilla<br><br>History shows again and again How nature points up the folly of men\n"},
{"review": "\nIn terms of sheer awesomeness, hardly any other monster movie can touch\nthis film. Everything about it is massive, and feels massive. This is\nwhat all serious monster movies want to be.<br><br>I had very few complaints when watching the movie. None of the ones I\nusually had were in the film at all, like the military being completely\nincompetent or people getting killed by the monster by doing dumb\nthings. It felt very realistic and everything had weight to it. Seeing\nit in IMAX only helped with this, the depth was fantastic.<br><br>Godzilla was faithful to the original monster, and felt respected as\nGodzilla instead of just a big dumb monster. The designs of the MUTO's\ndid seem a little out of place, but they did look great as well. A few\nscenes were very striking when they stood in full form, same with\nGodzilla.<br><br>This was the first movie in a very long time to give me chills. I can't\nstress enough how massive everything felt. I recommend IMAX if\npossible.<br><br>Even if you aren't a fan of the original Godzilla, you can still find\nthings to love in this.\n"},
{"review": "\nNever ever ever thought someone would put this to 1 or 2 star raiting,\ni mean, i was watching this film at the cinema, and i was super excited\nand entertained, i mean the trailer dint showed anything that will be\nin the film, i cant rate this film less than 10, because the threill,\nand the excitement was just more and more then i expected. I cant\nbelieve people saying its crap, i mean its just bullshit. I never evr\nexpected this godzilla be so massive real and with this realistic\nstory, it just dint apear from nowhere, it came to do what it should\ndo, with a story behind it. I really cant tell you how i wait the next\nfilm of godzilla, cuz for me, this is the best film of 2014.\n"},
{"review": "\nI don't care if this is a remake of the original 1954 classic, a way to\ncompensate for 1998, or if this was an attempt by Warner Bros. and\nLegendary to outshine and washout the legacy of Toho Co., Ltd. I went\nto see this movie in 3D-Imax, not like a regular movie broadcast, and I\ndid whatever I could to keep my eyes on the whole screen. And I do not\nhave a single solitary complaint about this movie. I was blown away by\nthe historical details as well as the graphics. I grew up on Godzilla\nmovies from Toho; from \"King of the Monsters\" to \"Godzilla 1985\". It\nwasn't until 1994 that I found some newer movies that were setup to be\nlike after 1985. I'll leave my opinions of them to myself and to their\nrespective pages. As for this, my only problem is going to be whether\nto buy this on DVD or wait until it airs on TV and record it myself.\nFor right now, I only have one thing to say......LONG LIVE THE KING!\n"},
{"review": "\nThe story is about a a gigantic beast looking to wreak havoc on mankind\n- and he may not be alone. <br><br>This movie has one of the best visual effect's of the year by far, The\nfight scenes at the end are so epic and amazing I also cried with joy.\nAnd some critics have said the characters are boring but I didn't mind\nthem. My favorite scene has to be the sky driving part and yeah I know\nit only lasted only 2 minutes but the music was scary and chilling and\nthe cinematography was beautiful to look at. Godzilla looked awesome in\nthe movie and the final fight at the end was so bad-ass and so much\nbetter then pacific Rim fight scenes. Godzilla's roar in this movie was\nloud and scary. a lot of people said Godzilla didn't do anything in\nthis movie and I didn't know what there where talking about, Godzilla\nwalked around a couple of times and kicked ass at the end.\n"},
{"review": "\nI give 10, because this is the real Godzilla, not the 1998 movie. The\n1998 movie is an outsider from the franchise - this is what i call a\ngood Godzilla movie. People who have seen only the 1998 movie, should\nnot complain, rather watch the original films.<br><br>The CGI of the Godzilla is excellent, brutal, and is very similar to\nthe original film with 2014 technique.<br><br>For me the 1998 film was just an outsider movie,good movie - but that\nwas not Godzilla, just a Disney style movie.<br><br>GREAT MOVIE!!! Waiting for Godzilla 2 and for 2018, and i wish there\nwill be many many other Movies, like MechaGodzilla, and the other parts\nas well. GO GODZILLA!!!!!!!\n"},
{"review": "\nI just sat there in my theater chair: coca cola in one hand, my SO's\nhand in the other. I smiled throughout whole the movie. Goosebumps of\nhis roar. I just loved it so much!! My mouth was wide of awestruck and\nwonder. It - is - Briljant!<br><br>I saw it in IMax 3D in The Hague. I loved the fact that the movie let\nyou wait for the marvelous fight of Godzilla in the demolished city.\nThere were even some winks from the director I guess: there were scenes\nGodzilla was about to fight, but the shot was in an angle you could\nalmost see it happen, but not quite. And that happened a few times\nthough. But, hey, if it was only a movie about Godzilla fighting some\nmonsters, it would be a short one without a great storyline. There is a\nconstant foreplay until the battle splashes into you face.<br><br>Man, if you're just a little bit of a geek as I am, please, allow\nyourself to be thrilled, amazed and awed by this movie!\n"},
{"review": "\nLet me spare your time and tell you what this movie is about. <br><br>Great start, Bryan Cranston looking for a mystery, tension building up,\nmystery found, its monsters, Cranston dies and the movie dies with him,\nirrelevant US soldier becomes the protagonist, military bullshit,\nirrelevant wife waiting for him at home, military bullshit again,\npeople looking at smth and freaking out, cities getting destroyed,\nworried wife working at the hospital, US soldiers preparing for smth,\nmilitary bullshit, irrelevant characters getting screen time, more\nmilitary bullshit, monster glimpse, cliché family moments, appearances\nof godzilla fighting monsters in the background, wife running around,\nmilitary bullshit, glimpse of the monsters in the background, US\nsoldiers running around and enjoying the show, godzilla kills the\nmonsters, corny family reunion, godzilla is the savior. and thats your\nmovie.\n"},
{"review": "\nThis movie was just awful. So, Godzilla came to protect us! From these\n\"monsters\" (MUTOs) that eat nukes for what? Because they need\nradiation? Stupid! Godzilla was good designed, but barely appeared and\nwas too slow. The MUTOs were awfully designed. Were very ugly. Not cool\nat all.<br><br>The characters were not interesting. There actors were not good either.\nExcept Bryan Cranston, who died in the beginning. Even the kid, that\nhad couple of lines, was acting bad.<br><br>And the ending? Goodbye Godzilla. Thank you for coming to save us. Now\ngo back to the ocean. See you next time a monster comes out. Such a\ngood pet!\n"},
{"review": "\nWith its predictable PG-13 rating - Godzilla was yet another humdrum,\nHollywood production that used the lame excuse of a rampaging,\nover-sized monster in order to grind \"family values\" into the viewer's\nface, non-stop.<br><br>If you ask me - All that this $160 million movie amounted to was just a\nsickening family soap opera where big, brave daddy (your typical combat\nhero/G.I. Joe type) goes to the most ridiculous lengths imaginable in\norder to rescue his darling, little wifey and his precious, little\nsonny-boy. And, believe me, it was all pretty revolting stuff. Yep. It\nsure was.<br><br>And, speaking about Godzilla's role in this disappointing movie -\nPersonally, I found the monster battle scenes (which were always filmed\nin near-darkness) to be so badly staged (and downright clumsy at times)\nthat they actually came across like slapstick comedy, rather than their\nintended \"dead-serious\".<br><br>All-in-all - Godzilla was nothing but pure, recycled family fluff, from\nstart to finish.\n"},
{"review": "\nI know a lot of people hated the 1998 version of Godzilla and everyone\nthinks this movie is amazing. Well, I don't. I personally think it's a\nbit of a waste of time. I don't regret watching it, but I don't think\nthat everyone needs to see it. It's no Rambo, Die Hard, Terminator or\nBack To The Future. Nothing will ever top those in my book. I think the\nmain reason I didn't like this movie a lot is because the main\ncharacter dies after about thirty minutes and Godzilla isn't the main\ncharacter. He's not even the main villain. He turns out to be a good\nguy and help the humans. What?! That's not who Godzilla is. Godzilla is\na big killing machine, not a helping machine. It's just backwards.<br><br>In this movie, Godzilla is pitted against another kind of lizard\ncreature, who just wants to find its mate and have babies. But we can't\nlet that happen. In the end, Godzilla wins and floats back into the\nocean.<br><br>Overall, I give this movie a 4 out of 10, which in my ratings book is:\nKinda Sucks.\n"},
{"review": "\nThe trailer for the 2014 version of Godzilla looked very promising,\nhowever the end result was average at best. The cast was good,\nespecially Bryan Cranston and Ken Watanabe and I also liked Aaron\nTaylor-Johnson as the lead who certainly has come a long way from\nKick-Ass. The special effects looked really good, but the story itself\nwas disappointing which let the whole movie down, and the ending was\nterrible. I will not put in any spoilers except to say that the ending\nwas rushed and goes against the spirit of Godzilla. It was as if the\nmovie had run out of ideas. Unless Godzilla is rebooted, I won't care\nfor a sequel.<br><br>At least the 1998 version of Godzilla directed by Ronald Emmerich was\nslightly more enjoyable, despite the fact it received a mauling by\ncritics.<br><br>5/10\n"},
{"review": "\nI read some of these reviews and just slap my head.<br><br>I don't know that you could have asked for anything more.<br><br>You can honestly tell me you go watch a Gozilla movie for the frellin\n\"story\"? .... Really? This is a wonderful homage to the 1954 version.<br><br>...and the story wasn't bad either.<br><br>It was FRELLIN AWESOME!!!! One of the things I really enjoyed was you\ndidn't get all the monsters 5 seconds into the movie. They made you\nwant for the 3rd act and it was more than worth the wait.<br><br>The monster fights were out of this world!! And the best part was you\ncould actually see them!! Unlike Pacific Rim which I had a hard time\nmaking things out.<br><br>Godzilla was back to kicking ass like he's supposed to be. MUTO was\nAWESOME as well!! The EMP twist was interesting.<br><br>Just a thoroughly enjoyable summer (spring) popcorn flick.<br><br>ENJOY IT!!!\n"},
{"review": "\nOh my god.... one of my favourites. Everything was excellent The CGI\nwere top class. Maybe the best I have seen. I understand why Godzilla\nhad a limited screen time. The expense was too high.... his screen time\nthough is ideal. He doesn't need more. He needs 10 or 20 or 30 minutes\nto conquer his film. His roar.... damn.... chills...... the mutos were\nreally nice.... sympathetic and pretty strong enemies. The atomic\nbreath was perfect.... they nailed it... the glow... and the breath\nitself. The acting was nice, the one who excelled was Bryan Cranston.\nWow... to be honest I didn't know him, but he was astonishing. His\nacting almost brought me to tears 3 times. Amazing. A perfect movie to\nspend your afternoon. I recommend it 100% 10/10 by me for an excellent\nmovie\n"},
{"review": "\nthis movie is not pacific rim (not mindless action) ,this movie is\nabout the humans and one hero who fought for us, non Godzilla fans will\nnever like this movie but Gareth Edwards did an spectacular job for the\nfans,letting animals be like animals , i hope they wont make a sequel\nbecause for me this movie was perfect and if the do they will kill\nGodzilla ,the movies teasing wasn't the best tho i wish they teased by\nshowing the monster fights from a distance that would be great.I loved\nall the human characters ,Bryan Cranston,Aron Taylor's,Ken Watanabe,\nEvery one i loved them. and Gareth showed something new about Godzilla\n, is that Godzilla's emotional side, of course he is an animal,he\nsuppose to have one but when he was dying to protect Ford and the rest\nof the humans , I was crying for Godzilla, i have never done that\nbefore in the previous movies,i left the movie with tears of joy that's\nwhy i say this movie is of the hook.\n"},
{"review": "\nGodzilla is back! Sure Roland Emmerich may have tried to resurrect the\nKing of Monsters back in '98, but his efforts failed, and his lack of\nsupport from Toho may have been the cause. But Toho learned from their\nmistakes this time around, and it shoes. This blockbuster reminds us of\nwhy we love the Godzilla movies so much. Asides from Godzilla, there\nare also some well developed human characters, who (unlike the '98\nfilm) we actually care about, thanks in part to wonderful performances\nby great actors, especially Bryan Cranston. What really makes this film\nworthwhile is the fact that Godzilla is not the only monster in it.\nThat's right, two others appear, and we get a classic monster brawl\nmuch like in older Godzilla movies. If your a fan of Toho movies, check\nit out. It does not disappoint. I can definitely see a new franchise\nstarting out with this film, and I can't wait to see where they go with\nfuture sequels. *insert Godzilla roar*\n"},
{"review": "\n(No Spoilers) in my review.<br><br>Godzilla (2014) Where to I start... The whole movie was awesome.<br><br>CGI was the best I have ever seen since Avatar and the look of Godzilla\nand the 2 other monsters was amazing and its a million times better\nthan the poorly done 1998 version. <br><br>looks more like the classic versions with more attitude. <br><br>I highly recommend this film for any action, thriller, monster movie,\nor Godzilla fan. <br><br>Simply Awesome, Amazing, take your breath away action.<br><br>This movie Is one of the best if not the best Movie of 2014.\n"},
{"review": "\nI love it when a film like this comes out and generates that wave of\nIMDb walls of text full of mockery and bitterness, but then turns out\nto be one of the greatest film viewing experiences of my life. The\nsubtext and allegory is what puts people into that panic as far as I\ncan tell, and in that context this films delivers, with sledgehammers.\nOnce those initial false plot devices are deconstructed and we as\nviewers are welcomed into the film as participants (around the time the\ncrazy old fart is validated), this film shines. I do not trust the\nsincerity of some of the negative reviews posted here, because its as\nif those reviewers either have the perception and discernment of a\nstone, or perhaps they having simply been frightened...\n"},
{"review": "\nIt's hard to believe It's been 60 years since Godzilla first appeared\non the big screen. Now after the awful attempt by Sony Pictures back in\n1999 from Roland Emmerich, we final have Godzilla done right. A movie\nthat will help G-Fans relieve their childhood. Director Gareth Edwards\nand writer Max Borenstein pull out all the stops in this CGI monster\nromp. Like many have said, the cgi in this film just blows my mind.\nGodzilla looks great and is a perfect mesh of old and new. Last Years\nPacific Rim came close, but Godzilla is the perfect way to spend your\ntime at the movies. Is the story perfect? no, but it hits the right\nnotes and Edwards taking his play book from Spielberg and Jaws teases\nus just right until the big showdown at the end. Actor Bryan Cranston\nhelps the material shine even more with his appearance at the\nbeginning. I wished he had more screen time, but Ken Watanabe is also\nthere to help out. Not a perfect film, but one filled with action,\nexcitement, thrills and plenty of Godzilla screen time to release the\ninner kid in anyone. This is a must watch.\n"},
{"review": "\nA waste of $160,000,000, yes the special effects were good, but the\nmonsters fighting Godzilla were unconvincing and had no real\nmenace,apart from their sheer size and ability to wipe out the national\ngrid and crush everything. Godzilla was co-star to the CGI and the\nhuman actors were bland, two dimensional with less empathy than the\nmonsters! <br><br>What a pointless use of the lovely and talented Juliette Binoche, also\nKen Watanabe must have been told by the director 'just look grim and\ndepressed, but don't act or you will show up Aaron Taylor Johnston and\nthe rest of the cast!<br><br>And so depressing, no light, humorous relief or depth of relationship\ndevelopment; which made the 1998 version so much fun and allowed the\ntense bits to be more gripping and scary. The direction, music and\nacting created very little tension or atmosphere apart from the huge\namount of dust and smoke that obscured the monsters in the action\nsequences. Where did the blue flame come from? , It was so effective,\nwhy didn't Godzilla use it earlier? Big budget, small outcome.\n"},
{"review": "\nAverage creature-horror movie.<br><br>You get pretty much what you expect with this one. One-dimensional\nplot, lacking in originality or creativity, but good action scenes and\nspecial effects. Really nothing new here, but the production values are\nvery good.<br><br>Performances are reasonably good for such a schlocky movie. Aaron\nTaylor-Johnson plays the action hero fairly well. Good support from\nElizabeth Olsen.<br><br>Bryan Cranston, Ken Watanabe, Juliette Binoche and David Strathairn\n(especially) are there to give the movie credibility - all of them can\ndo a lot better.\n"},
{"review": "\nI am a Godzilla fan, of course. This film is, though, basically a\nfiction dealing with an imaginary creature, isn't it? Forgetting this\nfact, the director seems too eager to make the story look real to keep\nthe balance between fantasy and reality.<br><br>In other words, he took too much care over the destruction of the power\nplant, or what Muto is like, or how the armed forces should carry\nmissiles to destroy those gigantic creatures.<br><br>I was too bored with his scrupulous attitude, waiting for the\nappearance of Godzilla! And he appeared ! After that, however, how few\nminutes we saw him ! When the film was over, I gasped with too much\nfrustration! I am sorry to conclude that it was a failure.\n"},
{"review": "\nPro's *AWESOME special effects *Great creature designs *Amazing\nsoundtrack *Great directing by Gareth Edwards *Bryan Cranston's\nperformance *Heart-felt 1st act *Badass 3rd act with Godzilla vs MUTO's\n*Ken Wantanabe's performance *Cinematography *Respect and honor to the\nsource material <br><br>Con's *ATJ's kinda dull and generic after Bryan Cranston dies *Small\namount of Godzilla *Godzilla not being the primary focus of the film\n*Bryan Cranston being killed off in the first 45 minutes *Underwritten\nscript *Thinly developed script<br><br>Conclusion: It has its flaws, even some BIG flaws, but it's still a\ngreat movie! Godzilla is back, and he is GLORIOUS! If anyone also likes\nthis movie, congratulations! If you don't, let's just agree to\ndisagree.\n"},
{"review": "\nI was really excited to see this movie and it was a good build up but\nhonestly I was a bit disappointed by it. It was not exciting, it did\nnot keep me on the edge of my seat. I actually stopped it about half\nway through because I wasn't interested in it anymore. One of the only\nreasons I gave it a 6 was because the film looked great and the\nanimations of Godzilla were great and I loved Bryan Cranston being in\nit since I love Breaking Bad. It think I was being generous giving it a\n6. Other than Bryan Cranston the acting was a bit cheesy and made me\nlaugh at some points. The movie never really pulled me in. I found\nmyself reaching for the remote to change to a different movie after the\nfirst quarter of the movie. It was kind of boring and nothing really\nexciting happened. Even if something happened at the very end that was\nexiting it wasn't good enough to keep me watching it that long. If you\nare a lifelong Godzilla fan you might like this movie more than I did\nbut overall it's not a must see movie.\n"},
{"review": "\nBoy looking at the other IMDb reviews, this seems to have really\nannoyed an awful lot of people.<br><br>Two comments: * I have argued here in the IMDb that the 1998 version\nwith Broderick was under-rated. Vindication at last. As you slog\nthrough this version, you cannot help but recall how the 1998 film\nactually held interest from scene to scene, and seemed to want to go\nsomewhere.<br><br>* a cautionary tale on the importance of -- who knew? -- a script. The\nreally strange thing is that the production standards, the effects, the\ncinematography, are all pretty solid. All dressed up and nowhere to go.\nThe exec who greenlighted this script clearly did not have English as a\nfirst language. It was beyond terrible, it was strange and odd and\nseemed to be missing pages.\n"},
{"review": "\nThe Godzilla remake is here, and, well... Let's just say it wasn't\nworthy of my money, which is sad, because I was hopeful for this\nmovie...<br><br>Bryan Cranston stars as Joe Brody, a scientist who discovers the\nexistence of Godzilla, as usual they don't believe in him, 15 years\npass and is now up to his son Ford Brody as played by Aaron\nTaylor-Johnson to protect his family in a monster breakout.<br><br>The screenplay by Max Borenstein is, without a doubt, the problem with\nthis movie, the movie is too long for it's own sake, and there is too\nlittle of Godzilla, he appears in the climax, and by then you're\nalready bored of the movie, trying to build some emotion in Ford's\ncharacter, but it fails completely on the degree that I was falling\nasleep...<br><br>To give the movie credit, the ending battle scene is indeed really\nawesome, but was it wasn't worth watching it all the way to it.\n"},
{"review": "\nThis is what I get for reading the reviews for this movie on here.\nLooks like every single user review has no clue how good this movie is.\nClearly everyone has been spoon fed crappy Syfy movies, so what if\nGodzilla didn't have a lot of screen time. Did everyone on here forget\nJaws? how the shark was finally shown in the end?? It's called\nsuspense!<br><br>Nobody was complaining about Sheriff Brody talking to Hooper over\ndinner, or Quint's story about the USS Indianapolis.<br><br>It just goes to show that people will overly judge a movie, this is why\nI take reviews from actual movie critics serious. Not some random\nperson on here.\n"},
{"review": "\nThe problem with this movie is similar to many big budget monster\nmovies in that it fails to recognise that the monster is the real star\nattraction, instead this movie decided to concentrate on the human\naspect , it fails miserably as the characters excluding cranston and\nwatanabe aren't appealing in the slightest. In regards to the action it\nalso fails. The monsters in my opinion look incredible and wish there\nwas more of it, unfortunately as soon as it starts to build up it cuts\nto the humans again and completely kills the tension. I don't hate this\nmovie, it is watchable, but don't watch pacific rim and think you are\ngoing to get more of the same, the flip side is if you hated pacific\nrim you may like this.on another note this movie is leaps and bounds\nabove the previous godzilla film and there are signs the filmmakers are\nfans of godzilla (atomic breath is awesome)\n"},
{"review": "\nIm bemused at those who give this a 1 star. It really isn't as bad as\nthat, in fact it's very watchable with enough action and dialogue to\nsatisfy most movie goers. All films are easy to criticise, and if I put\nmy mind to it I could do the same here. But could I watch this more\nthan once? Yes, and I have. Is it well acted, yes. Is the story good,\nwell it's OK, not mind blowing, but above average. There has been\ncriticism that Godzilla isn't seen enough. I don't quite understand\nthat as I think they got it just right. It stops it suffering from\noverkill which I am sure would induce criticism in other ways! So , no,\nit isn't an Oscar winner, but neither is it dross, enjoy it for what it\nis.\n"},
{"review": "\nGodzilla was a fairly decent film but it had so much unfulfilled\npotential. The first flaw in the film is that the protagonist of the\nfilm was a miserable fail because Aaron Taylor-Johnson simply cannot\nact. Sure, he did great in Kick-Ass but the reality is that those films\nare more silly in nature. Godzilla required him to deliver a few scenes\nthat were more serious and emotional and he simply couldn't do it.\nMaking his lack of acting chops even more apparent was the incredible\nacting of Bryan Cranston and Elizabeth Olsen. The other fail in the\nfilm was that they tried to artificially manufacture drama in order to\nadd intrigue. All those things did was take away from the film.\nHonestly, I feel that this movie would've been so much better if it was\nabout 30 minutes shorter. Johnson's lack of acting ability wouldn't\nhave been so pronounced and the ridiculousness of the unrealistic drama\nwouldn't have existed. Those two adjustments and now we have a\nlegitimately awesome Godzilla film.\n"},
{"review": "\nI love monster movies, I love disaster movies. What I do not care for\nis the bait and switch as Godzilla turned out to be. I'm not a fan of\nspoilers so I didn't \"research\" this movie and went to see it just\nbased off the media blitz, previews and honestly the fact that it was\nGodzilla! BUT, this movie is not about Bryan Cranston being a scientist\nagainst a radioactive monster. This story isn't about Godzilla\nattacking Tokyo. This movie has nothing to do with the previews. This\nmovie is a pseudo love story that constantly takes you away from the\naction to watch a less interesting love story between unremarkable\ncharacters that the movie creators didn't deem important enough to be\nin the majority of trailers. This movie wasn't about a monster or the\nactors I expected. The graphics are top notch, the cinematography is on\npoint but even the awesome monster scenes (which are fine) cant redeem\nthis bait and switch tale. I gave it a 6 in honor of the history of the\nmonster, the back story and graphics.\n"},
{"review": "\nGodzilla 2014, probably is a film with, at most, a rating of 4 to 6, or\na \"fair\" rating. Most Everything about the film is OK to sub-par, but\nthis film is mostly made in the dark. How can we see any action when\nmost, but not all, is in darkness? The acting is poor to fair. The\nTitle \"GODZILLA\" leaves much to be desired, as Godzilla is only seen\nfor a total of 19 minutes in a film that is 123 minutes long. And some\nof those 19 minutes is in the dark or only seen by his scales.<br><br>Most of the film is gutted with people, soldiers, scientists, a \"Bomb\"\nand children. If Godzilla was a real entity, He would file a lawsuit\nfor using his name in a TITLE when he is almost an invisible fixture on\nthe wall.<br><br>Daniel James Tyler, The WaltersJudsonGroup\n"},
{"review": "\nAfter ten long years Godzilla the one true king of the monsters is back\nand better then ever!! Simply put this is a great Godzilla Movie!!!\nwhat a way to bring back the iconic King of the monsters!! There are a\nlot of nods to the original 1954 Godzilla film but the film is still\ngreat even not knowing the references. While Godzilla does takes a\nlittle while to make it onto the screen when he does it is totally\nworth it!! He looks Good and I feel the Mutos are a great match like\nsome of Godzilla's foes of old! and when Godzilla breaths fire for the\nfirst time I literally got goosebumps it was one of the most amazing\nthings in m a movie ever!! The shots are awesome and the story is very\nhuman based! the acting is incredible!! I can't wait for the next one!!\n"},
{"review": "\nBest movie of the year! Godzilla and mutos fights are epic even if they\nare not on to much but the humans are great to! Without them the film\nwould be nowhere! It is so intense and fun to watch the destruction and\nkaiju battles going on with great human characters as well. The plot is\ngreat as well as the fight scenes. People complain about not enough\nmonster action but there is more monster action than movies like alien\nor cloverfield. Bryan Cranston is great even if he dies early on but\nAaron Taylor Johnson makes up for that as the main character in the\nfilm. There are themes of drama, family, apocalypse, and some suspense\nand horror. But it makes you wonder, what if this was really\nhappening... But overall it's a amazing film you should buy it because\nyou won't want to watch it just once!\n"},
{"review": "\nIf you are expecting to see a lot of Godzilla in a movie titled\n\"Godzilla\", this is not the movie for you. Who knew that wanting to see\nthe monster Godzilla in a movie named after the monster himself would\nbe too much to ask. A more accurate title of the movie would be called\n\"MUTO (NOT Mothra)and Ford\" because those are what the movie centered\naround. For a movie whose previews and trailers looked so awesome and\nshowed just enough of Godzilla to make viewers want to watch the movie,\nyet left them hanging as to what happens to Godzilla, the actual movie\nwas extremely disappointing. Also, since when does Godzilla become a\ngood guy. He is supposed to wreck havoc upon the town and try to eat\npeople. Ugh, this movie does not deserve to even be called \"Godzilla\".\n"},
{"review": "\nGodzilla has been one of my favourite cinematic characters since I was\na little kid, so getting the chance to see him rebooted properly for a\nmainstream audience was exciting. The film may not be perfect (pacing\nissues being it biggest flaw) and it's true that the human element\nleaves a bit to be desired, but the creatures themselves are wonderful\nand Alexandre Desplat's score is fantastic, sounding very much like an\nupdated version of a 50's B- movie theme. It was also nice that the\nfilm treated itself very much like a traditional Godzilla adventure, as\nopposed to an overly serious Nolan- esque dull-fest.<br><br>Overall, not the best Godzilla flick, but a fun one for sure and that's\nall I really wanted from it. No more, no less.\n"},
{"review": "\nThis movie was the most anticipated movies of 2014 but it did not live\nup to the hype. This was interesting at first but then it started to\nsuffer from transformer syndrome with it thinking that only visuals can\ninterest a viewer. Also the acting is excellent especially the father\nof the main character who was marketed as the main character but dies\nnot even half way though the movie leaving his son to save the day.\nGodzilla appearers looking as cool as possible. Due to a nuclear bomb\ntest this creature appearers from the ground. Even though the\ngovernment tries to keep the monster under wraps. The specials effects\nare great but this movie is just an average\n"},
{"review": "\nHI all..I went to see the cinema release of this movie (Godzilla) back\nin May this year when it was first released....and have been sort of\nwaiting for the DVD release...well...I picked one up the other day and\nhave just watched the disc....all I can say is, to me, it doesn't seem\nthe same movie! I'm sure it's been re-edited...and feel that some of\nthe action sequences described on the board/review here are missing\ni.e. some of the, quote;'gorier'(?) parts where Godzilla fights the\nMOTU(?) and I don't remember it being so dark for so long too!! I note\nalso that the original release (cinema) was at least 'PG' or something\nsimilar(?) And the DVD I have is rated '12'....WTF??? I don't buy\nmovies for 'kids'...I'm a grown up !!! I feel distinctly 'cheated'\nsomehow and it seems very dis-jointed somehow, compared to the movie we\nsaw in May; it's a waste of money after seeing the original\nrelease....be nice to know if anyone finds the same things?? Regards JD\nx (Torbay, UK).\n"},
{"review": "\nGodzilla is a 2014 American science fiction monster film directed by\nGareth Edwards. It is a reboot of the Godzilla film franchise and\nretells the origins of Godzilla in contemporary times as a \"terrifying\nforce of nature\".[5] The film is set in the present day, fifteen years\nafter the unearthing of two chrysalises in a mine in the Philippines.\nFrom the pods come two giant radiation-eating creatures, known as\n\"MUTOs\", which cause great damage in Japan, Hawaii and the western\nUnited States. Their awakening also stirs a much larger, destructive,\nancient alpha predator known as \"Godzilla\", whose existence has been\nkept secret by the U.S. government since 1954. It stars Aaron Taylor-\nJohnson, Ken Watanabe, Elizabeth Olsen, Juliette Binoche, Sally\nHawkins, David Strathairn, and Bryan Cranston. The screenplay is\ncredited to Max Borenstein but includes contributions from David\nCallaham, David S. Goyer, Drew Pearce, and Frank Darabont.\n"},
{"review": "\nNot bad at all considering the fact Godzilla only appears after an\nhour! Wish we could see him longer. I didn't care about the human\ncharacters. They either die too quickly or don't do much throughout the\nfilm. David Strathairn was good as the Navy skipper though (he reminded\nme Sam Elliott minus the mustache). But when the monsters show up, hell\nyeah! It's a wild ride and Godzilla really kicks butts. I like the fact\nthat the two MUTO look like rejects from Cloverfield and it's sweet to\nsee Godzilla showing them who's the real boss. Because let's face it,\nGodzilla is like John Wayne. There can be only one! Forget about the\nversion made by Rolland Emmerich.\n"},
{"review": "\nI usually find user reviews a little harsh as they tend to be\novercritical about a film, but, putting aside artistic value, I must\nsay I was disappointed in Godzilla as entertainment. In fact, I found\nthe much-criticized 1998 version much more entertaining. Some of the\nreviews here were spot on regarding plot and terror level. Too much of\nthe film was made in the dark and there was nothing of special effects\nthat raised my excitement level. I watched Godzilla on DVD, which came\nwith a special features disc and watched some of that to gain some\ninsight. After watching it, I still wondered why the movie was made the\nway it was, or even better, why bother making it in the first place. As\nfar as monster movies goes, it falls well below the terror level of\nJurassic Park and even the 2005 King Kong, which I found to be a\nbeautiful love story. I judge how much I like a movie based on my\ndesire to see it again. Alas, I have no such desire at this point, and\ndon't see it coming in the near future.\n"},
{"review": "\nGreat effects, if only I were allowed to see them in action.... and not\nthe acting of this main character who throughout the whole movie was\nunable to make me feel interested in his part of the story as well as\nhis family. Then for the monsters who were hardly ever shown and if\nthey were they were shown in action in the dead of night where you\ncould hardly even make out what was going on. The dad character at the\nbeginning was the only character worth getting interested about and\nthey end of killing him off a quarter way into the movie even though\nthe trailer leads with him for some reason, my guess being hes such a\nwell known actor compared to most of the rest of the cast. So with the\npoor use of good actors and great special effects as well as the bad\nscripting, I'm gonna have to go with a 6/10; and that's only because\nI'm a Godzilla fan boy.\n"},
{"review": "\nI liked how Godzilla kill the female monster, but I wish there were\nmore fight scenes between Godzilla and the other monsters.<br><br>The start of the movie is good but the us navy is out of place, I don't\ncare what the us navy wants do, in the end they don't do anything, just\nshoot to the monster that is helping them, the movie could have been a\ngreat hit without them, the same problem as transformers, if someone\npays a movie ticket to see a movie of a Japanese story, they expect to\nsee something like the original story, not a us military forces themed\nmovie.<br><br>Godzilla itself is good, it looks like Godzilla. In the end it's a OK\nmovie\n"},
{"review": "\nSo in this Godzilla I can safely say, nothing ever happens. Some\nmonsters awaken, the monsters fight and then the winner goes to sleep.\nThe humans in this film do nothing, they had no affect on anything, in\nfact if you think about it, if the humans had done nothing the death\ntoll and radiation toll would be smaller. But that isn't why I didn't\nlike the film. I didn't care about the humans, I had no feelings for\nthese characters that never say anything, the entire film is heavy\nbreathing guy, scared girl, kid, open-mouthed Japanese man, and\nexplaining girl. The only two characters you like, whose dialogue\ncombined equals more than the rest of the film, both die before the 40\nminute mark. Oh how boring. But I guess if all you want to see is\nspecial effects and big monsters fighting then this is the film for\nyou. The 1998 Godzilla may have been awful but as least it was funny\nand had Jean Reno which is more than I can say for this film, in this\nfilm the french actor lasts 6 minutes.\n"},
{"review": "\nLong Story Short \u0096 The Cast - Ken Watanabe, Bryan Cranston, Aaron\nTaylor- Johnson, Elizabeth Olsen, and Co. do well with what there are\ngiven. There is a personal story of their characters, to go along with\nthe Main Godzilla Crisis. Godzilla and the other creatures look\nconvincing enough. <br><br>My Qualm \u0096 Not enough Godzilla. You wanted to see more of him, and more\nof him fighting. The Directors and Writers no doubt tried to create the\nold time feel of the earlier Gozdilla movies, with the music, pace,\netc. Just No Enough of the Monster himself!<br><br>If there is a Sequel \u0096 Here is hoping that Ken Watanabe's probably most\nmemorable line will be foreshadowed more - \"Let Them Fight\". Not Bad \u0096\nJust could have been a lot better \u0096 2 ½ out of 4 Stars.\n"},
{"review": "\nGodzilla (3D) (U/A) English New movie Reviews and lots more Hot news\n.... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie\nReview by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview<br><br>Godzilla (3D) (U/A) English ------- my Rating : ★★★ ONE TIME WATCH<br><br>STRENGTHS :- * Graphics was OK.... * Story was good... * Sound effects\nwere excellent as if godzilla in the theatre...<br><br>WEAKNESSES :- * Worst 3D effects.... * Too many Godzillas..... *\nScreenplay drags in first half...<br><br>FINAL VERDICT :- * Overall.. this part sucks ... First part was awesome\n.... but kids enjoyed this flick more than us .....<br><br>An epic rebirth to Toho's iconic Godzilla, this spectacular adventure\npits the world's most famous monster against malevolent creatures who,\nbolstered by humanity's scientific arrogance, threaten our very\nexistence.\n"},
{"review": "\nGozilla is monster movie masterpiece. In the middle of all destruction\nis a valid story to tell. Monsters have feelings and that makes them\nmore charismatic than average movie monster. You can feel sympathy for\nthe huge monster. They have a story to tell in middle of all effect\nrumble and humanity's nothingness against natures forces is well told.\nGozilla is shown as a hero whose destiny is to survive human kind.\nAaron-Taylor Johnson is quite vacant as a human hero, but survives his\nrole as a father and soldier quite well after all. 3D works, but it is\nquite vain because they don't use it more cinematic. Plain 3D landscape\nis not enough, that is why I drop one point from five to four. After\nall Gozilla is a great summer movie and even I enjoyed watch it.<br><br>http://tinovalkki.blogaaja.fi/\n"},
{"review": "\nIt was about 17 years ago when I saw a huge 30 story poster of Godzilla\ngracing a building in San Francisco. So much money was spent on that\nmovie and it went on to bomb.<br><br>17 years later, with much fanfare less the 30 story poster, Godzilla is\nrevisited. This time San Francisco would have a role in the movie, not\njust a role in publicizing the movie.<br><br>Godzilla 2014 definitely was more dramatic and more intense. Of course\nwe all paid our money to see Godzilla do what Godzilla does best:\nbreathe fire and destroy cities. We were treated to that and we got to\nsee Godzilla more akin to the original other than the muscular slimmed\ndown '98 version.<br><br>Godzilla was much like a video game I saw years ago. It may have been a\nSims game in which the backdrop was a city and two monsters slugged it\nout laying waste to the city. In this movie the backdrops are Japan (of\ncourse), Hawaii and San Francisco. If anyone is pleased by the\ndestruction of San Francisco then he would be very delighted to see\nthis movie.\n"},
{"review": "\nFirst of all the special effects and graphics are INSANE! They look so\nrealistic! Godzilla was such a boss in this movie! His roar is so\nawesome, so good job guys in the sound department! Also I want to say\nthat the cast in this movie did a great job. Aaron Taylor-Johnson and\nElizabeth Olsen were BRILLIANT in this film. Also Alexandre Desplat did\nan OUTSTANDING job on the soundtrack. Gareth Edwards did a great job\ndirecting this movie! The only problem I have with the movie is that I\nwish we saw more monster vs monster action instead of Godzilla vs the\nwhole army. Overall a great movie that keeps you on the edge of your\nseat! I recommend this movie to every action movie lover!\n"},
{"review": "\nI don't give 10 out of 10 because i wanted more of Heisenberg!!!! Other\nthan that the movie was amazing. many people said that Godzilla wasn't\nshow enough. For me i saw a lot of Godzilla and the special effects\nwere, again... Amazing! It was a good way to start a franchise all over\nagain. I hope they make a second one, but they can take their time\nstudying it, just because the first one made some money, doesn't mean\nthe second one its gonna happen again. maybe it will but the movie may\nsuck. Aaron Taylor-Johnson was good, looking forward to see him in\navengers 2. But i would've give him more lines in the film to see more\nacting. He was good in savages, so he has potential. Overall, the movie\nwas awesome!\n"},
{"review": "\nThe film Godzilla was a lot better than I thought as I thought it would\nbe a complete copy of the last one but it wasn't, it had a great\nstoryline with a twist and an amazing cast who worked well together\nespecially the actor Bryan Cranston who played his part perfectly as\nyou could see and feel all of the emotions that he felt as the\ncharacter. The special effects were amazing as it demonstrates the\npassion and enthusiasm of Godzilla and also his strength, as I feel as\nthough it could have completely ruined the whole film if they had\nshocking special effects. Unfortunately I didn't have the chance to see\nthe movie in 3D so I wouldn't know if it was any better. But all in all\nit was a great film and I would highly recommend it to anyone as it has\nI little bit of everything in it e.g. action, adventure and a tiny bit\nof romance.\n"},
{"review": "\nThe plot and characters may feel familiar or overused but Gareth\nEdwards is able take the traditional and transcend it into something\npowerful, special, and a freaking good time! Cranston brings his all to\nthe table with an emotionally driven performance and adds another notch\nto his improving list of admirable roles. It is also nice to see\nElizabeth Olsen back on the screen where she belongs, as she is one of\nthe characters that reminds the audience that the story is as much\nabout humanity as it is about anything else. Which brings me to the\nKing of Monsters himself and I only have one word for that: epic. From\nthe design to his role as both a savior and a destroyer, Edward infuses\nlife into Godzilla like we have never seen it before. So do yourself a\nfavor and check it out!\n"},
{"review": "\nThe Godzilla film is very people oriented! I wanted to see Godzilla. If\nthe Movie poster showed a closeup of the young guy and have Godzilla in\nthe background, I would not have been disappointed.<br><br>I already read that you wouldn't see Godzilla until the 1 hour mark.\n'Jaws' did that and was a masterpiece. I thought this would be\nsuspenseful and have a good buildup. I was wrong. Just as you start to\n'get into it', it cuts and goes to another scene. The actors all did a\ngood job, but the film should have made them secondary and not primary.\nIt is not a bad movie though. It just does not live up to the trailers\nor even that funny car commercial that are strangely more entertaining\nthan the film itself?\n"},
{"review": "\nIt has been one of the big challenges for 'Hollywood' in recent decades\nto make a truly epic 'Godzilla' movie. They can make huge disaster\nmovies, with multi-million dollar budgets and an all star cast yet when\nit comes to this Japanese legend, nothing seems to work. The previous\nattempt in 1998, was heavily criticised yet was a decent movie with a\ngood cast. Now we have this modern day hugely hyped up monster movie\nwhich only offers more of the same. The film seems to follow an over\ncomplicated story line which fails to convince and as you wait for\n'Him' to finally appear, it's lost in overly long action sequences and\npoor dialogue. The only plus is 'Elisabeth Olsen' who like most female\nleads in disaster movies, is under used. I never go into a movie\nbelieving the hype or buying into a pre-conceived idea of what it is\ngoing to be. I just watch it as a movie comparing it to my expectations\nbased on the genre. Sadly what we have here is no more than an over\nglamorised B-rate movie with a big budget and a legend it fails to live\nupto!!!!\n"},
{"review": "\nI am really happy to see movies which do justice to their original\nmanuscripts. Been a fan of \"Tomoyuki Tanaka\" for as long as I\nremember!I can't be more happy to see movies which follow the story\nline while keeping viewers gripped to their seats. The usage of CG has\nbeen excellent and visualizations are terrific! Do not wanna give away\nthe story.All I can say is that this movie is a must watch!<br><br>I am really happy to see movies which do justice to their original\nmanuscripts. Been a fan of \"Tomoyuki Tanaka\" for as long as I\nremember!I can't be more happy to see movies which follow the story\nline while keeping viewers gripped to their seats. The usage of CG has\nbeen excellent and visualizations are terrific! Do not wanna give away\nthe story.All I can say is that this movie is a must watch!\n"},
{"review": "\nThe movie starts out with an interesting opening credits and Godzilla\ntheme. Already, my Godzilla hype had begun. The heartbreaking opening\nwas an interesting direction for a movie that had seemed to ignore that\nstoryline completely, and a little waste of Cranston if you ask me.\nHowever the movie picked up quickly, and boy was it a fun ride! The\nvisuals were just amazing to watch. The 3D isn't necessary but if you\nhave a few bucks, go ahead. The human element as read by previous\nreviews, did indeed lack. The biggest peeve I had about the movie was\nthat the big man himself (Godzilla) didn't show up until the last about\nhalf an hour and the teasings of him only made it excruciating to wait.\nWhen Godzilla came, my mind was blown by awesomeness. It made my\ninsides into that of a 5-year old. Anyway in the end I give it a 8/10\nand I would recommend you to watch it and if you can, in Imax 3D.\n"},
{"review": "\nGodzilla is clearly the main character of this movie, which is a\nwelcome change from 1990s Godzilla version. Although you don't see much\nof Godzilla, there is a big payoff with the climax. The movie had a\nmuch darker atmosphere that was reminiscent of War of the Worlds with a\nlot of ash and grey skies. The Halo jump scene had a gritty sense of\nrealism that was one of the standout scenes. I also liked how the movie\ndidn't mimic King Kong in one of the major scenes, when it could have\neasily done so. Rather it handled that scene in a much more enjoyable\nmanner. A minor criticism of this movie was that the rest of the acting\nwas not up to par of Cranston. Other parts of it, like the train scene,\nfelt very reminiscent of Battle LA.\n"},
{"review": "\nA fun ride through and through. A clear improvement on the American\nfranchise of Godzilla. The plot is very well outlined with not only our\ngiant lizard friend, but also tell the story of a Naval Bomb Disposer,\nand his journey to get back to his family. The acting, while not the\ngreatest ever seen, was well portrayed.<br><br>It was quite the wait through the first thirty minutes of the movie. It\nwas very well worth the wait. The suspense is built up until the\nbursting point, and it was paid off with a show that could only be\ndescribed as devastating in a wonderful way. Godzilla is a commanding\npresence as he should be. This time, they got his character design\ncorrect, as well as his character as a whole. <br><br>While their sequencing can lack here and there, the movie does very\nwell in its payoff. The human tale is very gripping entertainment, but\nit is augmented by the presence of a true King of the Monsters.\nDefinitely a great start, now on to the next!\n"},
{"review": "\nWow this film is by far the best Godzilla film ever made. It had a\nclassic look along with some really great action and creativity.<br><br>I really loved the whole mixture of Japanese culture mixed with some\ngood old fashion USA movie making. <br><br>The creatures were very unique, and loved the locations. Definitely\nmuch better than the '86 version which had Mathew Broderick in it. This\none seems way more authentic.<br><br>It almost feels like the reviews on here are generated by haters rather\nthan fans. Cause it seems like this movie deserves more.<br><br>This movie gives you everything you would want from an action/fantasy\nfilm: explosions and great effects.\n"},
{"review": "\nI thoroughly enjoyed the movie. Now I grew up watching the Godzilla TV\nshow. I saw some of the B movies too! It was fun. I am ashamed to say\nit was not until adulthood that I learned from my older brother there\nwas an original movie Godzilla the Japanese made in the 1950s. Well,\nlow and behold the AFI theater in town showed the original with\nsubtitles this spring and I saw it! I was surprised how serious it was\nand also how GOOD! I so enjoyed it. I really don't think I would have\nreceived all the punches of the new Godzilla movie if I had not seen\nthe old one, I feel like almost a prerequisite. I was frantic the whole\nmovie which I love being breathless! LOL! I only wish I had seen it at\nthe theater!\n"},
{"review": "\nWe all know Godzilla right? An icon of Japan. so when Edwards make a\nmovie that respects the legacy, people hate it because the wanted a\nterrible movie with tons o action instead of a great movie with a\nbuild-up and an amazing final battle.<br><br>Godzilla is supposed to be a dark and gritty film. People are to stupid\nto understand why Gareth went the route he did. he wanted to make\npeople go on the edge of the seat through out the entire movie. I have\nbeen a fan of Godzilla back in 2004, and this movie proved to me that\nwe can make a good Godzilla movie. Even TOHO, the very people who made\nthe creature, loved the film.<br><br>But no, the only people that can't appreciate this film's glory are\nstupid kids and teens the need explosions and action every 2 minutes.\nIt's sad that the world has been over run by childish annoying brats.<br><br>If you want a terrible movie with tons of action, go watch Transformers\nand leave an actual good movie alone.\n"},
{"review": "\nThis was an excellent reintroduction of the Godzilla character, and an\nexcellent movie in general. It was definitely a lot different compared\nto what I was expecting. That's for sure. But, in my opinion, the movie\nthat we got (with Godzilla as the semi-heroic monster battling against\nthe antagonistic M.U.T.O.'s) is preferable to the movie I had predicted\n(with an antagonistic Godzilla wrecking things all the way through the\nmovie). This is my new favorite incarnation of Godzilla: a dark\nguardian protecting the balance of nature, no matter the cost. The\nspecial effects are fantastic. The acting is good. The story is great.\nI have been a Godzilla fan for years, and this is all that I could ask\nfor from a Godzilla movie. I left the theater with a smile on my face,\nand I would definitely recommend watching this movie.\n"},
{"review": "\nI think this new version of Godzilla, really is just first movie about\nGodzilla. Japan is the origin of story, and many close circumstances. I\nthink the monster is fantastic.<br><br>The story is good, It could be better. The cast was good. The music is\nregular. It should be a mix between American pop music and traditional\nAsian music. The visual effects are good. The sets are fantastic, I\nwould like see bigger sets. <br><br>Costume design and make up are enough. Sound it's incredible, specially\nGodzilla \"voice\".<br><br>It's not a children movie, It's for adults that watch \"Godzilla\" when\nthey were children.\n"},
{"review": "\nNow, don't get me wrong, Godzilla (2014) was a good movie. It did what\nit was suppose to do BUT, I do have some issues with it starting with\nBryan Cranston's lack of screen time. The trailers would have made you\nbelieve Bryan Cranston plays a very big role in the movie but, he\ndoesn't. He had the least screen time out of all the other actors.<br><br>Also, for a movie called \"Godzilla\", you really don't see Godzilla a\nwhole lot. I take it back, Bryan Cranston had more screen time than\nGodzilla. Nonetheless, Godzilla (2014) was AMAZINGLY better than the\n1998 adaptation. And I have to give credit, where credit is due, Gareth\nEdwards managed to bring back an iconic feature from the old Godzilla\nfilms, something the '98 disaster failed horribly to do. <br><br>Overall, good entertaining movie. I didn't really feel worried for the\ncharacters in the film, for they didn't really leave an impact on the\nmovie.\n"},
{"review": "\nI read a review (before going to see the film) that brought up the\npoint that this is a film about Godzilla and not a Godzilla film. If\nyou can decipher that, then you are on the right track on what to\nexpect. I read another review on here that the ending was unexpected\nthat Godzilla swims away. I had to laugh, did he/she not watch any\nGodzilla shows in the 70's? lol. Well, it was the perfect ending as it\nwas just like the films of old.<br><br>I think the film starts out kind of slow.I do understand the need for\nsome of the back story, but I think they could have cut out some of it.\nBut, once the action started up again, it got very exciting.<br><br>One person said Godzilla was badass in this film. I disagree with his\nassessment. He kind of reminded me of Rocky. But he is the good guy and\nhe won in the end. I wanted him to be more of a badass than he was, but\nhopefully the sequel will bring him back stronger than ever.<br><br>All in all, if you are a lifelong Godzilla fan, this movie is for you!!\nAnd also if you can, see it in 3D!\n"},
{"review": "\nThis movie was simply amazing and epic. I didn't go to school for this\nmovie. Not too much and not too little action. It was a perfect Sci-Fi\nmovie. If i have the chance i will go again to the cinema to watch it.\nIt was best movie of the year 2014. I don't know if there will be a\nbetter movie. At first i didn't know that Godzilla would fight to\ndefend the Earth. Simply amazing and epic. I hope that there will be a\nsequel or a prequel. But it's not going to happen. If it happens than I\nthink that Godzilla will destroy the Earth. Those creatures made it\nmore amazing to watch the movie. I knew that they would be beaten by\nthe King Of Monsters, Godzilla. This movie simply rocks.\n"},
{"review": "\nIt is good to see Godzilla back on the big screen. the larger than life\nking of monsters returns to do battle with two new monsters, the acting\nwas not that great- the beginning was long and drawn out-- but once\nGodzilla makes his appearance i thought it was worth the wait. I really\ndidn't know any of the actors in this movie, other than Elizabeth\nOlsen.. I thought there could of been more smashing actions from the\nmonsters-- but seeing Godzilla destroy both of the MUTO monsters was\ngreat.. especially the last one killed- i don't want to give away the\nplot that much.. but it was awesome..<br><br>the 3d was not that great , the acting wasn't even fair, but it is\nworth watching\n"},
{"review": "\n1.Tried overly too hard to bring feeling and connection to characters,\nbut it never worked.<br><br>2. Cranston, the ONLY good actor in the movie, dies in the first ten\nminutes....i sooo wanted just one \"im doing this for my family!!\" lol\n3. I figured since the acting was not good,the monster fights would be\ngood, mehhh...the duckbill v trex fight in J Park 3 was just as good as\nany in this movie, and that fight was lame!...oh , the King Kong vs\ntrex's fight in King Kong totally DOMINATES any monster fighting in\nthis film...dominates...destroys...makes it look more like care bears\nfrowning at each other 4. at the end, a TV news broadcast says\n\"Godzilla, king of the monsters? Savior of our\ncity?\"....cmon...Godzilla isn't Batman....if they make Godzilla 2, and\na crazy clown monster wins an academy award for his performance im\ngoing to screammmmmmmmmmmmmmmm lol\n"},
{"review": "\n2014 is a year rich, so far, with good movies but Godzilla is the best\nof the crop.<br><br>The monsters are great looking and their interaction with the\nenvironment was awesomely made.<br><br>Bryan Cranston is amazingly talented and plays a realistic, deep\ncharacter with gusto.<br><br>The first third of the movie is filled with suspense and drama showing\nthe director has full control of his craft.<br><br>The second third is not as good but it has many moments of greatness\nand spectacle.<br><br>The third act is a visual, dramatic and fulfilling spectacle for the\neyes and mind.<br><br>Godzilla 2014 is a gift to us from people who really love this universe\nand their craft.\n"},
{"review": "\nI've seen a lot of Godzilla films in the past, Godzilla 1954, Godzilla\nvs King Ghidorah, Godzilla Final Wars, etc. Godzilla 2014 got my number\n1 favorite Godzilla movie along with my list of favorite movies of all\ntime list. It is that EPIC. You'll love this film as I loved this film.\nI will beg to Gareth Edward to make another Godzilla film. If he does\nmake another Godzilla film, I hope that the next film will have some of\nGodzilla's classic adversaries like Gigan, Megalon, King Ghidorah,\nMecha Godzilla! The future looks bright for for Godzilla. This movie is\nthe movie of the year. The King of the Monsters is back and I hope that\nhe will continue his legacy of destruction and awesomeness.\n"},
{"review": "\nThis movie could have been really fun. The first 25 minutes were\nwonderful to behold and throughout there were many instances of eerily\nbeautiful imagery. The fundamental ridiculousness of Godzilla is the\nmain issue. A warder of the planet destroying ancient entities that\nharm the planet...needs another form. The film was so full of\npretentious cinematic clichés, over indulgent militarism (are you\nreally going to semi-auto weapons to hurt a monster 10 stories tall?),\nand battle scenes so poorly designed (one would think of an old sci-fi\nflick 'The Deadly Mantis'), that the start may have been the best part\nof this ride. The absurdity is in why these creatures exist and how\ntheir interaction with us mortals takes place. Nothing makes much\nrational sense after the first 25 minutes.<br><br>Bottom Line. Go at your own risk!!!\n"},
{"review": "\nToo much irrelevant dialogue/drama. There are shows/movies that have\ngood dialogue &amp; drama, but those are actually relevant to the theme of\nthose shows/movies. Irrelevant drama = fillers. Some of them could have\nbeen cut shorter.. for example, the scene where the main character's\nmom died could have been 1 or 2 minutes shorter, or better yet, it\nshould have just been left out and instead just present it as a short\nanecdote. They tried to make it look so dramatic how she died, even\nthough it was just a few minutes into the movie... that's just\nunnecessary and silly.<br><br>As for the action scenes... Too few &amp; too brief. The only memorable\nscene was the atomic breath scene. Without that scene, I would have\nprobably given this movie a 2/10 or maybe even a 1.<br><br>This movie has a 7.1 IMDb rating because of the atomic breath scene and\nthe hype from all the fans. If the Godzilla franchise didn't exist\nprior to this movie, then the ratings would have been much lower.<br><br>This is just one of many movies that's mediocre but has 1 memorable\nscene.\n"},
{"review": "\nI feel bad for the people who enjoyed this movie. I can not believe\nthat I was tricked into contributing to another horrible Godzilla\nmovie. If you have to see this movie, please wait until you can watch\nit for cheap/free at home. It makes me sick to think that people are\nmaking money from this movie.<br><br>The storyline was awful. Randomly pieced together scenes with randomly\npatched together cinematography. It reminded me of watching a play\nwritten by elementary school children. Unnecessary, halfway-thought out\nsubplots are scattered throughout, like the movie makers are trying to\ntrick the viewer into thinking the story is more dynamic than it is.\nNothing was relatable, everything was conveniently resolved, and\nnothing really made any connection to the viewer or the rest of the\nmovie.<br><br>I didn't know much about this movie going in, but I was sure that Bryan\nCranston wouldn't sign up for a bad movie after his huge television\nsuccess. I was wrong. Although maybe he had something to do with\nexiting the movie ASAP.\n"},
{"review": "\nOh, the trailers looked so good. I had hope, and, for the most part, my\nonly criterion was that it be better than Pacific Rim, Hollywood's\nattempt at the kaiju genre last year. I liked that one, but was\ndisappointed (with Guillermo del Toro, I expected something with a\nlittle more meat). Godzilla does not clear that hurdle. It has the same\nmajor problem that all these kinds of films do: the human element is\nlacking. Severely here. And what a fantastic cast to waste! Bryan\nCranston, Juliette Binoche, Sally Hawkins, David Strathairn, Elizabeth\nOlsen, Ken Watanabe! Every single one of them utterly wasted. Hopefully\nthey all got a big check. We have all these people, but instead we're\nsaddled with charisma black hole Aaron Taylor-Johnson (of Kick-Ass\nfame), who isn't even adequate. Thankfully, the big monster fights\ndeliver, for the most part. There could maybe be more monster action,\nbut when it's there, it's a lot of fun. I also thank the filmmakers for\nrestraining themselves and keeping the film at only two hours (it runs\na tad over that if you stay through the credits).\n"},
{"review": "\nI don't post movie reviews, but this one...holy wow, it's BAD, you only\nget like 3 4 second looks at the real Godzilla til the very end. The\nacting is atrocious. It wasn't exciting, most of the movie was quite\ndark, as in I CAN'T SEE THE DETAILS OF THE MOVIE, and it was\njust...really...BAD. I had higher hopes, and was very disappointed. I\nexpected more monster action and less idiot human bad-actor action. I\nloved most all Godzilla movies but this one. Didn't even get to see a\nmonster til over 30 minutes in? The mechanoid things were horribly\nbuilt, they looked like...well I don't know what. There were so many\nshots of a leg crashing down without a picture of an actual monster\nthat my mind is blown.\n"},
{"review": "\n90% of the film happens at night why? this a mockery! can not see<br><br>anything but some shadows and flashes. the film is hopeless carries on<br><br>without end boredom boredom and boredom again.<br><br>previous verse there are<br><br>a thousand times better. film for garbage only suited. the producers<br><br>ran out of money! lowest class of this type of production. worse than\nthat it is only in<br><br>India! I was hoping for something more than a black screen and flashes\nevery few minutes. big flap piece of junk and everything can be spoil\nthis movie has been done. Producers great shame shame!\n"},
{"review": "\nI'm gonna use the minimum requirement for writing a review on this\nmovie because frankly, there isn't really much to say about this boring\nmovie. I give this Godzilla the three B's: bland, boring, and bullsh*t.\nWhen the action scenes happened, it was hard to tell what was going on\nbecause it was so dark. The story was so slow, waiting at the DMV seems\nmore entertaining and action packed. Actually waiting at the DMV is\npretty entertaining. I do it when I don't have to. People watching is\nso fun at the DMV. Anywho, back to this review. Acting was predictable\nand uninspiring. The ending made you say, \"I actually paid to see this\nmovie?\" Matthew Broderick should've returned to save this one.\n"},
{"review": "\nI saw this movie last year and really liked it. Quite different than\nany Godzilla movies I watched as a kid. There's much more of a story\ntold from the character's viewpoint and the final battle scene was\nworth watching the entire movie. I found Elizabeth Olson's character\nand that of her son's character to be essential worthless. That's not a\nknock on the actors, just a knock on their roles. They don't really add\nanything except a love/family angle to the story. That's been overdone\nin blockbuster movies and less of that, more of the scientists\ninteracting and discussing Godzilla's origin/nature would have been\nbetter. Taylor's soldier/son/husband character could have used a bit\nmore depth as well. He's just kind of running in place with his role\nthroughout. Overall, it's a fun movie and the giant monster battle\nscenes are good. I give it a 6 out of 10. Not a great movie but a good\none.\n"},
{"review": "\nGodzilla is the King of Monsters, and this movie is absolute in how it\nportrays him and is extremely respectful of his importance as being the\nsavior of humanity. His atomic breath at the end makes everything\nperfect. One of the best films ever. EVER. Forget Transformers. Forget\nFast and the Furious. Forget Jurassic World(Remember Jurassic Park).\nForget Harry Potter. Forget Batman and any other superhero. He is\nGodzilla. A God. For all intensive purposes. And please just give the\nmovie another look. Gareth Edwards perfectly took the time to introduce\nhim and setup such a climactic ending, that also sets up why he is so\nimportant to humanity. The more you watch, the more you see how\nincredible it truly is!\n"},
{"review": "\nThis film got me obsessed with Godzilla, people say that they hate that\nGodzilla isn't in the film all to much and i kind of understand that\nbut to be honest if they gave Godzilla 70 minutes of screen time and\nfocused on him for the entire duration of the film then it would have\nbecome a boring monster movie and Godzilla would get boring to watch.\nIn this film when you see Godzilla, however rare it might be is awe\ninspiring, the shots of him really make you think, \"Oh god that is\nabsolutely huge\" and its always epic when he is on screen. The acting\nwas mostly great although at times Aaron Taylor Johnson was a bit dull,\nhe portrayed a soldier fairly well, easily the best performance was by\nBrian Cranston who was so entertaining to watch, in the first few\nminutes we watch him In a nuclear meltdown in a power plant in Japan.\nI'm not going to spoil it but that scene is very emotional. The Cgi in\nthis film was superb, the animals movements were smooth and lifelike,\nand the roar. its not like anything you have ever heard before and its\nawesome.\n"},
{"review": "\nMy hubby and I like watching old Godzilla movies -- the cheese is just\nwonderful and the monsters so silly. I can't say whether or not this\nmovie is very cheesy or the monsters silly because at least half the\nmovie is in darkness! What few glimpses of the monsters we had seemed\nin line with the old films, silly and huge. The attempt to make an\ninteresting human story underneath the entire monster fight scenes felt\ncontrived; the humans could have been removed from the movie and it\nwould have only made a shorter film. The acting wasn't bad but it was\npointless because in all honesty, there isn't anything a mere human or\nhuman military could do against such creatures if they aren't making a\npersonal connection with them. I have never checked my clock as often\nwith any other Godzilla movie. Bored out of our minds.\n"},
{"review": "\nThe 1998 film was a rehash of the original 1954 film whereas this 2014\nfilm gets its inspiration from the later Godzilla vs X films of the 70s\nby which time the monster had become a good guy.<br><br>The acting is pretty good and the special effects are nice though it\ncould have done with double the $160m budget. The story of the main\ncharacters does nicely develop over the course of the two hours.<br><br>There is a nice plot build up and lots of action and adventure. The\ncast is huge. There are lots of little nods to events in other Godzilla\nstories.<br><br>The bad stuff: No humour. It's mostly filmed in the dark (possibly to\nmake the SFX cheaper) and on a small screen you will often struggle to\nsee what's going on. Not much destruction, you mostly only see the\nafter effects of city bashing. Not much monster vs monster though what\nis shown is good.<br><br>Add a point if you can see it on a large screen with the lights off.\n"}
]