[
{"review": "\nIf you want to see a painfully unoriginal and unengaging story of\npaint-by-number characters getting at it in the green room for 90% of\nthe time, go see this movie.<br><br>The most deplorable thing about this movie - aside from the plot being\nan incoherent mess - is the way the villains are portrayed as\ncaricatures, and the good guys as saints who can do no wrong. I don't\nknow about you, but when the villains are portrayed as sadistic\npsychopaths with no real motive or character, I lose interest in the\nstory.<br><br>tl;dr lots of CG, completely two-dimensional characters and a plot that\ncould've been auto-generated with a smartphone app.\n"},
{"review": "\nIt's simple. If what you want is a live-action version of the Disney\ncartoon, or a remake of those old \"Me Tarzan, you Jane\" camp fests,\nthis isn't the film for you. If you don't like the character to begin\nwith, this isn't the film for you. The vast majority of critics who\nthus far have given the movie unfavorable reviews fall into one or both\nof these two categories. It's disheartening, and it's so obvious they\ndon't really know anything about the character and don't care enough to\nlearn.<br><br>If, however, you have yearned for the day in cinema when Edgar Rice\nBurroughs' epic hero is treated with the gravitas and respect he\ndeserves, and if you enjoy epic jungle adventure with a heart, by all\nmeans GO SEE THIS MOVIE! It is phenomenally good! Think of it like you\nwould a dish of food. Let's say spiced curry. If you don't like spiced\ncurry, you won't like it no matter how well it is prepared. This movie\nis for those who enjoy spiced curry. For those who love it, this is the\nmost delicious dish you're ever likely to taste.\n"},
{"review": "\nThis movie started off quite well, for a movie I had quite mediocre\nexpectations it caught my interest when it introduces some interesting\ncharacters with mixed motives, unfortunately that and a few good\ncinematic shots is where the praise ends for this movie.<br><br>This movie had potential which only makes it even more\ndisappointing,we're first introduced to Tarzan as a British politician\nand is then forced to rediscover his wildness but lacks any real\ncharacter and only comes across one dimensional with the traits of an\nangsty teen who's marriage we're supposed to care about but I'm not\nsure why<br><br>This movie tries to incorporate way to many elements, the overall plot\nabout the enslaving the Congo and getting rich from a mythical city\nfull of jewels that we're not even allowed to see at any point combined\nwith fueds with passed foes that don't really come to any settlement a\ntribe leader that had his son killed by Tarzan that wants revenge,\ngorilla brother that wants him dead, trying for a baby and flashbacks\nof a potentially better film we could have had, they rush through these\nvery quickly without really developing or keeping your interest <br><br>Some really awful scenes, Samuel Jackson who I'm not sure needed to be\nin this movie jumps off cliffs only to land unscathed on a branch,\ncombined with a very predictably unsatisfying ending that couldn't of\ncome fast enough and causally wrapped up with all the bad guys\ndefeated, they may as well have froze in the air jumping to the\nbackdrop of a sunset, with the joy of sweet release as the credits\nrolled to only leave me with a face like a bulldog eating a wasp and\nannoyed and frustrated that I have wasted time and money sitting\nthrough another failed sequel that is sure to fade into obscurity <br><br>Overall this movie lacks any fun or adventure, poorly directed as this\nmovie lacks any identify, wouldn't recommend this film to anyone other\nthan my worst enemy, all round disappointment\n"},
{"review": "\nI am really surprised at the mediocre reviews so far of this film.\nHonestly when I first heard about the film I had little interest in\nseeing it, but the trailer was better than I expected, and when has\nChristoph Waltz been anything short of terrific in every role he has\nplayed, but particularly when he is a bad guy. (Come to think of it has\nhe ever been a good guy?) The whole cast is solid, and I really liked\nthe historical setting concerning the Belgian King Leopold and his\nexploitation of the Congo. <br><br>I found all the animals and the CGI to be surprisingly cheesy.\nUndoubtedly the weakest link in the film, but that factor did not\nsubtract much from a constantly entertaining and solid story. Besides\nthe cheesy CGI the rest of the film looked terrific. I would recommend\nto see it on the big screen. It will probably lose a lot on smaller\nscreens. Good summer popcorn film.\n"},
{"review": "\nI'm not sure what I've just watched, and trust me, only the freezing\ncold NZ winter day could have kept me inside watching this dross. Oh,\nand Alexander Skarsgard's chest. I admit that. Where do I start? I get\nthat we've moved into a world where everything white and male is bad,\nand everything black and female is good, but seriously? Trying to\nsqueeze the Tarzan legend into that narrative as well? Why not write\nyour own damn stories and leave ones like this in the past. So, we have\nevery single non-white person heroic; every single white person\npsychopathic (except Tarzan, of course. Even Hollywood can't write the\nnarrative which puts Samuel L Jackson into the actual Tarzan role.\nYet). I resent having to pay for this ludicrous propaganda. I studied\nAfrican history for my degree. Where do you think the slave trade\noriginated? Who stopped it? Yeah, go do some research and answer those\nquestions for yourself. I think at the end of this movie (I don't care\nif there are spoilers ahead; this film is THAT bad) Tarzan and Jane\nhave opted to stay in a squalid African hut to have their baby because,\nya know, who'd want a huge manor house in England with servants and\nhygiene? I give up. This film makes me want to stop watching movies.\n"},
{"review": "\nThey finally portrayed the Tarzan character more like Burroughs wrote\nhim! This is the best Tarzan movie I have ever seen. The acting is\nsuperb, and the settings are beautiful. The movie was so good that it\nseemed like I wanted it to last longer. It was sheer entertainment!<br><br>The stars of the film were really excellent in their roles, and I\nthought the two main characters perfectly played their roles. The rest\nof the cast were excellent also. <br><br>The story moves along briskly, and the plot is very effective. <br><br>I believe people will enjoy it, even if they know nothing about Tarzan.\nThis is a very enjoyable movie, and I recommend it. We are going to see\nit again this weekend and bring our family and friends!\n"},
{"review": "\nReally one of the top ten worst films I've seen in my life. The plot\nwas paper thin, if there was a plot at all. I knew going into this that\nit was going to be mostly about the digital gorillas, the babe, and the\nhunk. What I didn't expect was the flimsy dialogue, scenes unconnected\nto the \"plot\" and such miserable drivel coming out of the mouths of the\nactors. I was also surprised by the pseudo environmentalist doctrine\nthey weave into the plot. The babe is being taken away by the bad guys\nto her death and the only thing she can say is, \"Promise me you wont\nhurt the animals.\" Really? The best line in the movie is when the black\nguy says, \"Can we just stop this?\" My sentiments exactly. The overly\nsensitive, crying, cannibal warlord was a bit too much.\n"},
{"review": "\nI wasn't sure what to expect with Tarzan. I thought it might be cheesy\nor the special effects would look ridiculous, but surprisingly a\nmajority of the time, it looked really good! Do you have to suspend\ndisbelief sometimes? Absolutely. But it's a story about a man who\ncontrols jungle animals and swings from vines, so its going to look\nunbelievable at points. However, I found a good chunk (about 85% IMO)\nrelied on realistic scenery, makeup and special effects. I mean...\nthey're not going to use real gorillas or lions with the actors, but\nthe CGI ones looked really good and will have you mesmerized by the\ndetail. Personally found the movie very enjoyable, action packed and\nbeautiful to watch. The director and actors did a phenomenal job. I\nfound myself glued to the screen for a majority of the film.\n"},
{"review": "\nWho are these people who think this was a good movie. This is just a\nfashion show, plus showing nothing but a ridiculous plot and terrible\nclothing choices. The sensitive lollipop kids got this movie so\npolitically correct, it is a horrible and painful movie to watch. As\nfor Tarzan, he even looks laughable in those pants swinging from vines.\nFor over 100 years Tarzan wore a loin cloth. Not this time, the\nlollipop kids saw to that. A horrible movie on so many levels.What the\nheck are these positive reviews for.Terrible terrible plot as\nwell.Tarzan is the king of the jungle. Who really cares if he is the\nhope and ruler of the people in the jungle. I don't. Those animals\ndon't look real. They looked unreal.\n"},
{"review": "\nThe core Tarzan story is not only iconic, it speaks to something deep\nwithin us. It is at the same time the ultimate Romance and the ultimate\nAction tale. It is no coincidence that, almost a century ago, when\nyoung Hollywood looked to find a franchise for its new \"talkie\" motion\npictures, they turned to the Tarzan tale, and spawned a franchise so\nsuccessful that it literally outlived the shelf life of its star.<br><br>In my lifetime I have seen well over a dozen versions, retellings and\nre-imaginings of the Tarzan story. I have no doubt that after I am\ngone, producers and writers will continue to be attracted to it and\ncontinue to \"make their bones\" by bending it to their unique style.<br><br>That said, this one is not especially good. After a great opening\nscene, there is the filmic equivalent of \"dead air\" for about 35\nminutes and when the script does finally get in gear it stumbles and\nfalls, subject to a wildly disjointed narrative and equally bizarre\nediting.<br><br>Alexander Skarsgård has been impressive in other films (a race driver,\na superhero) and I think with different material and a different\ndirector he could have connected. Christoph Waltz and Sam Jackson\nremain two of the most over-exposed stars in Hollywood and, good as\nthey are, they are running out of clever ways to play the same\ncharacter over and over. And over. And over.\n"},
{"review": "\n\"The Legend of Tarzan\" is joyous.<br><br>Since childhood, this is the Tarzan I've wanted to see on screen,\nfaithful in spirit to the Burroughs novels. The jungle is raw. The\ndangers are \"real.\" The villains are badder than bad. The historical\nperiod may not fully satisfy the Tarzan chronologists, but it's close\nenough and serves the exciting story it wants to tell. The gorillas are\ngorillas-plus (mangani). We even get a glimpse of the gates of Opar.<br><br>But most important, the portrayals of Tarzan and Jane are spot-on. You\nbelieve this couple from start to finish.<br><br>Is the movie perfect? Probably not, but it comes so damn close that I\ndon't care.\n"},
{"review": "\nMaybe the trailers for this film big'd it up too much , but 10 min's in\nI had to check that I am watching the right movie and not some spoof ,\nor maybe a TV low budget Tarzan with cheep effects cheep actors and\neven cheep'er writers ... But no that's Samuel l Jackson sure enough .\nIt pains me how bad this is and worse that there are so many good\nreviews for it !!! The flash backs are random and pointless, there's no\nreal set up or relationship with any of the characters, the story line\npredictable Samuel Jackson thought it was a comedy Tarzan and Jane\nthought it was the next transformers. The bad guy wasn't The natives\nneed to lay off the steroids The cgi man last worked in the 90s, man in\na gorilla suite would of been better reviews for it !!!! 100% worth a\nwatch just for cringe and wince factor , just as I did. 60s Tarzan\nmovie would show this up\n"},
{"review": "\nThe Legend of Tarzan was really fun to watch. Much more fun than the\nmarketing made it look. <br><br>There was some romance to be sure but it is much more a bromance\nbetween Tarzan and George Washington Williams. Skarsgard and Jackson\nwere marvelous to watch and their scenes together snapped and sparked.\nSkarsgard is a superb Tarzan and plays the role with restrained abandon\nif that makes sense. <br><br>The action/fight scenes were absolutely fantastic. I wish there had\nbeen more of them. The final action sequence is one of the best I've\never seen. <br><br>The cinematic beauty of the movie is astounding. An crucial aspect of\nthe overall character of the movie.\n"},
{"review": "\nLet me start this review by saying that I have never read Tarzan, nor\nseen any film adaption of him before, cartoon or live-action. I went in\nwith a blank slate and no expectations to the theater hoping to see a\nfun adventure movie. Boy was I disappointed. A great adventure movie\nstarts with memorable characters. Tarzan is neither a Jack T. Colton,\nnor an Indiana Jones. He has neither charm, wit or any other adventure\nmovie admirable qualities. Jane is also no Joan Wilder or a Willie\nScott, even if she is more interesting than Tarzan. The first part is\ndreadfully slow paced with about the same passion and emotions as a\ndead fish. Then suddenly it feels like the scriptwriter got tired of\nhis own script and just wanted it to end. Queue Deus Ex Machina, then\nthe movie is finally over. Worst movie I have seen this year, only a TV\nrerun of Hale Berrys Catwoman comes close.\n"},
{"review": "\nI can probable sum it up in one word, but let me give it a try.<br><br>Wasn't expecting much going in this movie, but I was hoping to be\nsurprised. Unfortunately...This is without a doubt the worst movie from\n2016. The acting: Horrible. Not even Oscar winner Christopher Waltz,\nwho was once again typecast to play the same role he always does. Dito\nfor Samuel. And Skarsgard? Sorry to say he's the male equivalent of\nKristen Stewart. If he would've had fangs he could've easily been Eric\nNorthman 200 years prior to True Blood. Margot Robbie was probable the\nbest thing about this movie....Or maybe the baby elephant, that's still\nup for debate<br><br>The movie wasn't even visually stunning, tons of CGI, which is\nunderstandable to some degree, but this was just ridiculous. I didn't\ncount one real-life animal, and this including a butterfly.<br><br>The whole plot felt (and was) rushed and important moments where\nbrushed aside as filler. There was absolutely no emotion what so ever\nbetween any of the characters, nothing memorable about the entire\nmovie, except maybe for the poorly executed finale which I will only\nremember as a good laugh.<br><br>And that's about it...\n"},
{"review": "\nThe iconic character created by Edgar Rice Burroughs in 1912 is brought\nback to the silver screen in this epic drama, skillfully mixing both\ntraditional and new cinematic techniques.<br><br>Both wild and romantic at the same time, it tells a struggle for life\nand freedom, for dignity and liberty.<br><br>Last but not least, it is not often that we are offered such an\naccurate portrayal of the ravages of imperialism and colonialism\nconducted by the Western power elites on the African continent in the\nXIXth century.<br><br>A movie with a Heart and a Soul. One of the best films of the year.<br><br>Rating: 11.5 (out of 12), 96%\n"},
{"review": "\nNow I know this is a made up story, but the storyline is weak at best,\ncoupled with some terrible acting and CGI. The whole reason for Tarzan\ngoing back is quickly forgotten, also skipped over is how he has been\nable to grasp English so quickly! There is hardly any chemistry between\nTarzan and Jane, which isn't helped by fairly wooden acting. Jackson\nand Waltz try to pull the film up, but both are below par in this\nremake. There are lots of CGI shots, which may be good in 3D, but don't\nreally work on a normal screen. The story jumps around, and you never\nreally get caught by it. The ending is particularly poor, with animals\nable to identify the bad people, and and impossible survival of an\nexplosion. I can only think, once again, that when a film is invested\nin so much they throw money at getting false ratings.\n"},
{"review": "\nI don't remember ever being introduced to Tarzan of the Apes. Seems\nthat I've known him all my life, probably from watching the old movies\non TV and looking at my older brothers' comics long before I could\nread. Tarzan has always been there. When I discovered the novels by\nEdgar Rice Burroughs at age 13, I encountered a more complex, far more\nfascinating hero than was ever shown in the comic pages or on the\nscreen.<br><br>Until now.<br><br>Warner's THE LEGEND OF TARZAN presents the truest portrayal of Tarzan\never depicted by Hollywood. He's intelligent, charismatic, and savage.\nBurroughs would be very satisfied, I think, and members of his family\nhave told me that they are delighted with the new film. Its elegant,\ndangerous atmosphere and thrilling special effects are absolutely\nmesmerizing (the Mangani apes, especially Tarzan's foster mother Kala,\nare wonderfully realized and purposely described as *not* being\ngorillas). This is not only a lavishly produced action-epic, but also a\nsentimental adventure as Tarzan and Jane return to the jungle to face a\nrelentless evil.<br><br>As a Tarzan writer, and as a lifelong fan, I absolutely loved it. This\nis the best Tarzan movie ever made, by far. Five Stars. Highly\nrecommended.\n"},
{"review": "\nDon't believe the critics, even my wife liked it. Lighthearted and fun\nwith enough drama and emotional connection to make this a great summer\nmovie. I had heard that the CGI was bad, saw no real evidence of this\nin the movie. On the contrary it was well done. I think that this\nTarzan is much closer to what Burroughs had in mind. The critics cannot\nseem to see beyond the 1912 creation of this character and seem to\nfocus on the relevancy and point of the movie. My wife asked me why\nevery movie has to have a point so that the critics would like it. The\npoint in this movie seems to be a thoughtful handling of an iconic\ncharacter that arguably spawned almost every other superhero that we\nhave today. Would definitely see this again!\n"},
{"review": "\nHave you ever wondered why there are so many versions of Tarzan? I read\nthe original Edgar Rice Burroughs book a decade ago because I wanted to\nknow what the real version was. The book was a Penny Dreadful that was\nfun as heck, silly as all get out, and pretty skewed from reality\n(Tarzan teaches himself to read from a book he found in his dead\nparents tree house and he can do that because he's of Nobel birth) LOL<br><br>This new version of Tarzan not only tries to make it as realistic as it\ncan be in the circumstances (it is a super hero jungle guy), it also\nincorporates history of the time (turn of the 19th Century) by having\nthe villains be the Belgians in the Congo. The Legend of Tarzan takes\nthe legend and makes it a better story.<br><br>The stars of the movie are all fantastic in their roles. Alexander\nSkarsgard is beyond buff, beautiful and an amazing Tarzan. Margot\nRobbie is sweet and tough as nails as Jane. Samuel L. Jackson is always\ngood but this part would be less without him. Christoph Waltz was very\nvillainy and believable.<br><br>Thank you to all the people who made this movie, for thinking we needed\nyet another Tarzan. Now I want a sequel.\n"},
{"review": "\nIn the Nineteenth Century, John Clayton (Alexander Skarsgård) is\nmarried with Jane Clayton (Margot Robbie) and fully adapted to the life\nin London. He is invited by King Leopold from Belgian to visit Africa\nbut he refuses. However the American Dr. George Washington Williams\n(Samuel L. Jackson) convinces him to go since he wants to prove that\nthere is slavery in the Belgian lands. Jane also goes with them and out\nof the blue, the village where they are lodged is attacked by the\nmercenaries commanded by the evil Leon Rom (Christoph Waltz) that works\nto Leopold. He wants to capture Tarzan to deliver him to Chief Mbonga\n(Djimon Hounsou), who is seeking revenge since Tarzan has killed his\nonly son. In return, Rom will receive a chest of diamonds that Rom will\nuse to pay mercenaries to invade Congo. However Washington saves Tarzan\nand Rom kidnaps Jane, expecting to be followed by Tarzan that crosses\nthe jungle with Washington to rescue Jane. Will they succeed in their\njourney?<br><br>\"The Legend of Tarzan\" is a great adventure of the ape man. Alexander\nSkarsgård is an excellent Tarzan and the Hollywood's darling Margot\nRobbie is great in the role of Jane. Christoph Waltz performs an evil\nvillain and the efficient Samuel L. Jackson completes the good cast.\nThe CGI is impressive, with the gorillas and Tarzan climbing the\nlianas. My vote is seven.<br><br>Title (Brazil): \"A Lenda de Tarzan\" (\"The Legend of Tarzan\")\n"},
{"review": "\nThe Legend of Tarzan is another cinematographic reincarnation of a\nwell-known character, who is supposed to be the hero of children around\nthe world. Like most recent summer flicks, the movie lacks\nauthenticity, character development, and hopeful excitement that most\nwould like to see in a good-feel movie. In return, the moviegoer gets\npoorly weaved flashback scenes and basically forced to watch a plainly\nchaotic film. Furthermore, the characters seem to have come out of a\nsitcom or reality TV show, with no interest for dramatic structure.\nMoreover, the level of violence is simply too much for small children\nto watch.<br><br>Here is the bottom line: This is not a good family movie, but rather an\naction one with plenty of special effects that many will still enjoy.\n"},
{"review": "\nOkay before I start this review I must point out that my feelings about\nthis movie have nothing to do with if I think Santa Claus wears funny\nshoes or not. Point being as too many reviews on movies have went up\nbased on what they thought about something that had nothing to do with\nthe movie, example people didn't like Suicide Squad because they didn't\nlike Batman vs Super so this is my disclaimer for the ignorant people\nthat post reviews on films based on their dislikes in chocolate.<br><br>So to start out, I had High expectations for this movie, the cast\nseemed to be on point and of course the story isn't a new one so where\non Earth did this movie go so wrong? Well let's start with the green\nscreens and the never ending length of the vine when Tarzan swings from\none. Now I do remember the old Tarzan shows when of course the vine\nseemed to be a few thousand miles long as 1 vine could make that swing\nacross the country while he posed; come on guys we have better\ntechnology now. The acting was of very low quality and the back story\nwas shot in the foot from the start. I had watched the cartoon version\nof this film a few weeks before and it was better in story, graphics,\nand voice overs fit the characters. In this movie featuring real people\nplaying the roles everything that could've gone wrong did, we almost\nwalked out as it was so bad.<br><br>The Legend of Tarzan (2016) was the let down of films this year and had\nso much potential; though not one part of it was attempted to make it\nan entertaining film; it was more like paying to be laughed at for\nspending the money. I didn't even want to write this review but our\nfollowing had asked so much that we wanted the clarity known to them.\n"},
{"review": "\nI have read all the Tarzan books and have never found one movie that\ncame so close to the books as this one did. I thoroughly enjoyed it.\nWas glad to see they got the Mangani right for a change. Even if you\nknow nothing of Burroughs books I think you would enjoy this movie. The\nactor portrayed Tarzan as he should be portrayed. Not some stupid\ngrunting idiot but a Lord in his own right in London as well as in the\njungle. The closest any movie before this came to portraying him as he\nshould be was Greystoke. This movie far surpasses it. The animals were\nvery believable as were the natives. The jungle scenes were\nbreathtaking and I was so glad to see Jane as feisty as she was in the\nbooks. Jane is no simple damsel in distress. She is Lady Greystoke, and\nmate to Tarzan.\n"},
{"review": "\nWhat movie have you guys seen. For sure not the same as me. It's Tarzan\nking of the jungle . . . the thing that as little boy I was dreaming\nabout . . . what power what agility what a superhuman . . . But wait\nTHIS Tarzan get beaten by almost everybody an he doesn't feel\ncomfortable without his tights.<br><br>Action packed? We have a girl that we have to take with us or there is\nno conflict in the movie. She can run away but she wants to spare the\nGorillas that were just about to bash her and she comes back. Gorillas\ndon't care about the other guy (he is the bad man and he has to die at\nthe end. My 5 years son would write a scenario that can't be that bad\nas this one. Pity of the actors. They are good but they have some lines\nthat sometime I was wandering if they changed the tapes when I was\nyawning.<br><br>Hopefully after all family members write the reviews some ordinary\npeople like me can say a word. DON\"T bother... From beginning to end I\nwas asking myself one single question.... is it really possible to make\na movie that bad? I give it a 3 for the actors... not for the acting\nbecause no matter how great an actor is he can not act with such lines.\nSamuel is like a fish on a freeway. Tarzan is a struggle between a\nCount and thief, being actually none. Margot is just pretty but that\ndidn't help either . . . . What a bad bad bad movie? PEOPLE assuming\nyou are NOT member of the families . .. now really... what movie are\nyou talking about? Not Tarzan because I am sure I didn't sleep it\ntrough as I was curios how bad this movie could be... I couldn't even\nfall asleep.\n"},
{"review": "\nWow, this is an action packed movie featuring one of the most popular\nfictional characters of all-time! This is not a re-make of Disney's\nTarzan, but one of the closest adaptations of the original Edgar Rice\nBurroughs stories ever made. The visuals are stunning and the story\nline is epic. Legend Of Tarzan brings Lord Greystoke back to his\nbeloved Africa. Of course no Tarzan movie would work with out the love\nof his life, Jane. There is also some historical content added to give\nthe movie even more depth. Samuel Jackson is perfectly cast in his role\nas the real life George Washington Williams. If you have been a fan of\nany of the dozens of movies, books, TV shows or comics featuring\nTarzan, you will love this movie. Great movie, highly recommended.\n"},
{"review": "\nI saw this movie at 915pm at the Potomac Mills Mall, IMAX theater in\nWoodbridge, VA. June 30th, Thursday.<br><br>The acting was excellent. The story is not the original but close\nenough. Tarzan is Tarzan with a varied story line but it's good. I\nthought the overall movie was good to very good. Entertaining\nthroughout.<br><br>The movie is a love story and about Tarzan and Jane...duh! lol. The\nanimation or whatever they used for the animals was excellent, There\nis, of course, deaths, and lots of action. <br><br>It's worth the money to see. IMHO Jim\n"},
{"review": "\nI just saw The Legend of Tarzan on an IMAX screen in 3D and was blown\naway. It is a beautiful movie, with incredible action and powerful\nscenes such as Kala's death that are very moving.<br><br>Where it touches on Tarzan's origins in a series of flashbacks, it is\nalways respectful of the origin material but tweaks the story here and\nthere for the movie. <br><br>My only complaint would be the fight scenes. As others have mentioned,\nthe way they are filmed leaves a bit to be desired.<br><br>This is the best Tarzan movie ever, and it is hard to see how anyone\ncould do a better one. If you are a Tarzan fan, an Edgar Rice Burroughs\nfan, or just love a great adventure movie, this is for you.\n"},
{"review": "\nSaw \"The Legend of Tarzan\" today and really enjoyed it! This is so much\nmore true to the books than we have previously seen so don't expect the\n\"Me Tarzan, you Jane\" garbage that has erroneously been most of the\ntheatrical history of this larger than life character. The story is\nwell crafted and you will enjoy the scenic views and locations. I have\nheard from other reviews that there is too much CGI but I do not agree\nwith that opinion. There is not too much CGI and what is there is done\nvery well. It is nice to have a capable villain with whom you can\nreally loathe. Christoph Waltz does a fantastic job as the villain!\nThis make me hopeful for a whole line of Tarzan movies being as there\nis so much untapped potential and material for them to easily make\nmore. Do yourself a favor and take your family and enjoy!!\n"},
{"review": "\nI've been a Burroughs / Tarzan fan for over 50 years, and have seen all\nthe existing authorized Tarzan films. I've enjoyed them to varying\ndegrees, but few have been truly faithful to Burroughs' character of\nTarzan. Until now. This film does by far the best job of capturing the\nspirit of Burroughs' Tarzan of any film to date, particularly the idea\nof nature (English nobleman) vs. nurture (his jungle upbringing). <br><br>More importantly, The Legend of Tarzan is a terrific, engaging story,\nwith great characters and pacing and plenty of action, but not so much\nthat it seems like overkill. The story's focus and presentation has\nbeen updated from Burroughs' first 104-year-old story, as has been\nstated in write-ups and interviews. But note that the issue that draws\nTarzan back to the jungle in this film is essentially the same one that\noriginally brought his parents there, as described in the first two\npages of that first novel. <br><br>Yates and company have done a superb job of crafting a good\nold-fashioned adventure, retaining the look and feel of the Africa of a\ncentury ago, and combining it with a plot and theme that is relevant\ntoday, aided greatly by the addition of real life character George\nWashington Williams. The scenery and special effects are first rate. As\nnoted above, the spirit of Burroughs' Tarzan is beautifully captured.\nThe few detail changes from Tarzan's backstory are minor and serve to\nsupport the story. For example, Jane is more feisty than we are used to\nin previous films and in the earlier books, but in my opinion that\nmerely improves the story. A must see!\n"},
{"review": "\nSometimes you just have to watch a movie for the sheer entertainment\nvalue which in a world of critics seems to be lost. I loved this movie.\nI am not a huge superhero fan, or for that matter a Tarzan fan but this\nmovie kept me engrossed. I am looking for a couple of hours escape from\nreality, while watching a half naked, and might I say a fine specimen,\nsave his beautiful woman from the evil clutches of a villain. I don't\nknow much about character development, and all that goes into making a\ncritically acclaimed movie, but usually those are pretty boring. This\nmovie, on the other hand, viewed by someone who loves a bit of a love\nstory, a heartthrob or two, a couple of bad guys, some amazing animals\nscenes and things that make the blood go pumping, was flipping great!\nIf drama is what you seek, then by all means watch your critically\nacclaimed Oscar winners, but if entertainment is really what you want,\nwell by George! Here it is with Tarzan :-) Fabulous movie with a\nfantastic cast and great music. Enjoy!\n"},
{"review": "\nThis is literally everything you want from a movie about the iconic\ncharacter Tarzan. There are a lot of impressive action sequences, all\nof which are packed with their own thrills. These action sequences\nreally make this a true Tarzan film. The cgi is so good. It looks\nincredibly realistic thanks to technological advances. It makes the\nanimals look so cool, and realistic it makes it hard to tell it is cgi.\nThere are a lot of brief flashbacks in this film, all of which help to\nput the story together so that everything that has happened makes\nsense. These are all quite exciting and really help the move the story\nfurther. These were a good idea for the film and I am glad they were\nadded in in different places throughout the film. The only flaw is that\nthe plot goes a bit slow at first, but it picks up quite quickly and\nall the good stuff happens. So overall, I enjoyed this film, it is a\nvery exciting, action packed adventure that you should definitely see\nbefore it is too late.\n"},
{"review": "\nCorny and Stupid. Ridiculous story line. Bad CGI Graphics. Cheesy, fake\nlooking animals. Not realistic what so ever. Bad Casting. Why do you\nalways have to have an American person in it. This suppose to take\nplace in the late 1800's and there is a corny priest joke. Bad Casting.\nAfricans don't look like real africans. Bad Costumes. If you don't want\nto be entertained watch this movie. Like, I said... Corny and Stupid.\nRidiculous story line. Bad CGI Graphics. Cheesy, fake looking animals.\nNot realistic what so ever. Bad Casting. Why do you always have to have\nan American person in it. This suppose to take place in the late 1800's\nand there is a corny priest joke. Bad Casting. Africans don't look like\nreal africans. Bad Costumes. If you don't want to be entertained watch\nthis movie.\n"},
{"review": "\nI was really disappointed to see such an absolute waste of a good idea.\nThe premise was okay. \"A Tarzan remake? SURE, (everyone's doing a s**t\ntons of remakes anyway) sounds awesome, let's join the bandwagon!\", and\nthen, people flock to it like the nostalgia hungry things they are.\nThis is not the problem. (Although remakes, s***ty horror movies,\nsequels, and movies based off books seems to be all there is anymore.)\nThe problem is that they turned this idea into very poor excuse of a\nmovie.<br><br>Visuals: Visuals were great. Nothing wrong there. Scenes had good\natmosphere, lighting, and effects. Some of these beautiful scenes were\na little unnecessary but I guess they needed the run-time. <br><br>Story: Boring. Boring boring BORING. The beginning before the title of\nthe movie was shown was exciting and full of mystery in a way, but\nafter the title, things went down hill. The story started becoming more\nbland, boring, and confusing. It was hard to keep myself from falling\nasleep or sighing whenever I expected something exciting to happen but\nnothing did. Coincidences and clichés appeared very often and just left\nme sighing and cringing.<br><br>Characters: Ugh. Tarzan is the cliché brooding hero. Jane is just an\nannoying character. Washington Carver didn't really seem relevant? The\nothers I guess were...\"okay\"? I just wasn't feeling any joy or interest\nwatching any of these people. I don't know if that was what the writers\nwere looking for but I didn't like it. <br><br>I know this review is very broad, but I like short reviews that are to\nthe point. The point being, I just couldn't stand this movie. It felt\nlike a really confusing boring cash grab with good visuals and decent\nactors. If you want to see it, go ahead, but I highly recommend you\ndon't.\n"},
{"review": "\nThe legend of Tarzan isn't the movie we were all expecting it to be. It\nis a boring film filled with way too many flashbacks and some dialog\nthat just makes no sense. My major complaint coming out of this movie\nwas it tries to be a new version of Tarzan but tries to input the\norigin of Tarzan into the film. Another major complaint is that the CGI\ncompletely sucks. The gorillas don't look real they look as if they're\nstraight out of a ps4 video game. There are two good things and that is\nMargot Robbe as Jane, now of course she is a damsel in distress but out\nof all the characters in the film she had the most well written dialog\nand another good thing is the Sam L.Jackson character. They are the two\npositive things about this film. All and All this movie is stupid and\nnot interesting by the end of the year this will be in my top 5 worst\nof the year. It sucks because I was really looking forward to this film\nand I was let down they should have put more effort in the script. I'll\ngive it two out of ten.\n"},
{"review": "\nI'm usually a fairly easy going viewer but damn does this movie look\nfake. The constant low quality CGI characters are gruesome. I remember\nthe part when the buffaloes are going towards the port they seem like\nthey've been copy-pasted. All the gorillas look fake. All the sequences\nlook like they've been shot on a Disney world ride. The plot is\nsooooooooooo predictable and sooo boring. They basically make a joke of\nactual African tribes too. To me this movie is just bad bad bad. I'll\nmake sure I don't watch another David Yates movie again. This is a\ntotal waste of good actors, time, money and people's attention. I'm\ntempted to give it an award: worst movie I've ever seen but it would be\ngiving it to much credit.\n"},
{"review": "\nThis fun ride of a film seems to encompass \"The Beasts of Tarzan\" and\n\"Tarzan the Terrible\" with a bit of a time shift. If you are new to\nTarzan - it won't matter. We get a heroic Tarzan and Jane hellbent on\nhelping their closest African friends, we get tremendous Mangani as\ngraceful as colobi leaping through the upper terraces. Revenge,\nredemption, and retribution play out in a fast paced cinematic treat. <br><br>We has a true to life evil villain doing horribly bad things, we had an\nequally good historic witness interact with Tarzan and Jane to stop it.\nFilmgoers see Tarzan and Jane as a believable couple in love with each\nother. Their good natured friends are equal to the tasks chosen. And\neven though the animals are CGI - I was happy as I could watch this\nadventure without worrying if animal actors were harmed in any way. <br><br>I like how Tarzan communicated with \"friendly\" animals. I was happy to\nsuspend disbelief as we saw lions and elephants visit. One has to\nappreciate submission posture for these gorilla like \"pan sapiens\nrobusti\" that the Mangani must be. I was curious if these \"Apes\" were\nswimmers. Maybe we'll see that in the sequels. I think this film works\non all levels. When the grandson of Edgar Rice Burroughs says this\nmovie is a winner - I'm going to agree wholeheartedly. <br><br>I'm going to endorse this as the Summer movie you must see at least\ntwice.\n"},
{"review": "\nI saw this Movie by accident just now. Please learn from my mistake,\ndon't repeat history! The plot was so unengaging, and could not decide\nwas it was about, I cared so very Little about what was going on.<br><br>Riddled with Flashbacks that don't contribute to the story or the\ncharacters, the characters will tell you Everything anyway, and i wish\nthey would not, at least I laughed out loud a few times over how bad\nthe dialogue was.<br><br>And the CGI, don't get me started, was I watching an old Tarzan\nTV-series from the nighties? The shot-compositions and framing was so\nconfusing, in some dialogues the camera was spinning round and round\nfor no reason at all except making me fell nauseous.<br><br>The editing, confusing as hell, a character is over there, now it's\nover here, a weirdly timed close up, suddenly two new characters appear\nfrom nowhere.<br><br>Oh god the animals looked horrible, HORRIBLE! Tarzan turned to\nrubber-plastic-cgi as soon as he was swinging from the lianas, at one\nPoint he swings on one that seems like it's 300 meters long.<br><br>The finale is at least so terrible you have to be amused by the\nawfulness of it all.\n"},
{"review": "\nI read through a bunch of the 10-stars reviews here glorifying this\nmovie as the bets Tarzan there is. I really had to get into me asking\nmyself if I am so wrong with my verdict. Well, I stick with it. This is\none of the worst Tarzan movies I have seen.<br><br>Let me elaborate a bit. It is not the movie itself that I don't like.\nThe cinematographic craftsmanship is great. Camera, lighting, cut,\nscenery and great supporting acting (Christoph Waltz is excellent\nagain) speak for the movie. But that is not the reason why I went to\nsee it.<br><br>I went to the theatre to get a great Tarzan experience. And this movie\nfails badly. Since a kid I am a Tarzan fan. I saw so many movies\nincluding the early ones with Johnny Weissmueller and Lex Barker. They\nhad what I call a Tarzan charisma. Something that Alexander Skarsgard\ndoes not have at all. Nope, he is no Tarzan, has nothing of him. A good\nactor but surely no Tarzan.<br><br>The story line is very disappointing. I felt fooled. It is so trivial\nand easy to predict. It is not ERB's Tarzan tale filled with some\nadditions here and there, it is a stereotype action story filled with\nsome Tarzan tale pieces here and there.<br><br>No, this movie fails badly as a Tarzan movie. There is no \"Tarzan\" in\nit and no \"Tarzan tale\" either.\n"},
{"review": "\nThe Legend of Tarzan! . . . Where to begin? . . . which is apparently\nthe same question Roland Emmerich was asking himself before, during and\nafter the film was over. The first hour of the film is a constant and\ntiring reminder that there used to be a Tarzan etc etc etc and to be\nfair, Tarzan was never really that interesting a story.<br><br>It's difficult to say whether or not there's any spoiler alerts in this\nquick review because there isn't anything to spoil. In short, the one -\nstar review is basically for the appearance of Margot Robbie's face,\neven if she is billed FIFTH on IMDb behind five male actors, three of\nwhom are playing the same character.<br><br>As for the film itself, Christoph Waltz is in it . . . so he's the\nvillain then . . . Alexander Skarsgard is in it cause . . . well . . .\nsomeone needs to do be Thor &amp; casting a Hemsworth would probably be a\nbit on the nose . . . Margot's in it obviously . . . cause you know,\nwhy not? . . . and Sam Jackson's in it cause it's a movie.<br><br>Djimon Hounsou does an admirable job, acting as if his role isn't\ncompletely beneath him and for a film that seems to admire the\nenvironment so much, the fact that there are no real animals in it,\nbeing worn as some kind of badge of honor in the p.r drive, speaks\nvolumes about the overall quality of the production.<br><br>I could arguably give the film two stars because of Sam Jackson's\npresence but that's just not enough to qualify this plot less,\npointless, piece of boring nonsense as anything other than a complete\nwaste of billions of dollars and anybody's viewing time.<br><br>So obviously expect the sequel sometime in the next . . . zzzz . . .\nzzzzzz . . . zzzzzz.\n"},
{"review": "\nDo NOT judge this film by Hollywood's past mistakes. For the first time\nTarzan is presented on the big screen as he was meant to be. This is a\nstory of a man who has straddled two worlds finally settling in\ncivilization but called back to investigate atrocities in his native\njungle.<br><br>Exactly who is the more civilized? The she-ape who rescues an orphaned\ninfant or the King who authorizes slavery and conquest.<br><br>This film has adventure, beauty, death, and award winning special\neffects. It provides laughter, amazement, drama, and questions to\nponder.<br><br>The cast is strong with characters that you care about. Alexander\nSkarsgard pushes endurance to the limit - a hero who overcomes his\nprimal urge. Margot Robbie is feisty and strong - a mate worthy of a\nhero. Samuel Jackson provides light moments with thought provoking\nquestions.<br><br>There is a little Tarzan in us all. Have you beat on your chest today?\n"},
{"review": "\nHere's The Lowedown on \"The Legend of Tarzan\" (PG-13 - Theatrical -\nUS)...LIKED IT!!!<br><br>Genre: Fantasy/Action<br><br>My Score: 8.0<br><br>Cast=9 Acting=8 Plot=7 Ending=8 Story=7<br><br>CAPES=7.8 Pace=7 Develop=8 CGI=10 Action=7 Adventure=9<br><br>I didn't expect this story to start at this point, but I'm glad it did.\nIt dispensed with all the 'ooooh I'm Tarzan, I was raised by apes, I\nhave to adapt to society, oooooh\". Instead, it picks up with him going\nback to the farm after he's seen Paris (See \"Congo\" when you get the\nchance). Margot Robbie shows shades of Harley Quinn as \"Jane\" and\nChristoph Waltz is his usual greatness!! \"Your husband's wildness\ndisturbs me more than I can easily express.\" Express that for yourself,\nwhen you see it on DVD...or digital HD.\n"},
{"review": "\nThe Legend Of Tarzan, well really kept my eyes on the screen,I wasn't\nbored or falling asleep, I was fully enjoying another Tarzan movie\nwhich is miles better than the 2014's cartoon one. This Tarzan movie\nhas better action, drama and humour, it has a good story-line. <br><br>it's a surprise that this one is live action, as the other 2 originals\nincluding the 2014 one are cartoon. what's the point in-that, I still\nliked this one better as it is live action and when it comes to live\naction the action and drama is always better. the way this movie went,\nwell surprisingly it was catchy gripping and not expected. <br><br>The violence was pretty intense not too bloody but what would u expect\nas it is set in the jungle which can be very dangerous. <br><br>The Legend Of Tarzan, is a one to watch its enjoyable, and highly\nrecommended for those who want the action somewhere else, than just on\nthe streets.<br><br>I give this movie a 7/10 because I do feel like it could of been a\nlittle better with the action and it was looking back at flashbacks\nmostly.<br><br>anyways The Legend Of Tarzan, keeps you on the edge of your seat and\nwill not disappoint you.\n"},
{"review": "\nThis film tells the story of an English aristocratic son who is raised\nby animals in the forests of Congo. He grows up and goes back to\nEngland, only to go back to Africa to help the people who are getting\nenslaved by the Belgian king.<br><br>\"The Legend of Tarzan\" is so much better than the trailer. It has very\nlittle scenes of Tarzan growing up in the wild, and concentrates on his\ncivilised adult life. He maintains a deep connection with the nature\nand the animals, which is a beautiful message that can be translated to\neveryone being friendlier to the environment. The story is engaging and\nat the end beautifully poignant. The two leads Alexander Skarsgard and\nMargot Robbie are both very visually pleasing, which adds to the charm\nof the film. I enjoyed it.\n"},
{"review": "\nDirector David Yates, who inherited the beloved Harry Potter characters\nand brought that series home in its final four entries, makes the wise\ndecision to direct Tarzan remake, however The Legend of Tarzan ends up\nbeing a garbled, clunky production that tries to please everyone and\nends up pleasing no one. Alexander Skarsgard is more abs than actor as\nthe ape man. In the end, though, it's really just some pretty pictures,\nand some computer- generated animals. It was a huge disappointment and\nwill bomb at the box office due to no extraordinary responses from\nviewers. I would go with 2/5 for this poorly remade movie of a famous\ncharacter in our early childhood.\n"},
{"review": "\nIt is my first review on IMDb . I went to this movie with high\nexpectations like full of action scenes with animals and friendship\nwith them but it fails in all elements . The whole movie is a one line\nstory (Tarzan kills the tribe head brother so the tribe head wants\nTarzan to be killed but he fails) . A Silly one line story.But comedy\nworks well with the Samuel. The one best scene in this movie is the\nclimax scene where all animals will attack the fireman it is the one of\nthe best one and the other scene I liked is talking to lion with sighs\nis very funny . The movie is very slow and boring . <br><br>Finally who loves Tarzan can watch this movie without any\nexpectations.My Rating is 2 out of 5 :(\n"},
{"review": "\nI was surprised from the bad rating on the movie after watching it\nwhich was denying me from watching it for long time.<br><br>Really very good movie. The scenes, story, graphics, sound effect are\nreally good.<br><br>The appearance of animals and jungle in the movie scenes was very close\nto reality and the interactions of these animals was well structured\nand added a lot to the movie.<br><br>May be there is some unreality from real history of the story and its\ntiming, but that didn't affect the film quality.<br><br>I recommend this movie and I hope there is many others with same\nquality of it.<br><br>Thanx for everyone who worked on it.\n"},
{"review": "\nThe Legend of Tarzan is a mediocre movie with a mostly well developed\nplot and a decent cast. It certainly has some great moments, such as\nTarzan's brawl with the apes, Alexander Skarsgård suited the role\nnicely, Samuel L. Jackson delivers a performance different to anything\nhe has done before, and plenty of tense scenes from Christoph Waltz,\nwho steals the show as villain Leon Rom, truly bringing him to life. <br><br>It never managed to feel necessary, it's the first Tarzan movie in\nyears and yet there is nothing that tells us \"this is why we needed\nanother Tarzan\" there is nothing special about it, nothing you would\nnot see in any other film with this character.<br><br>As well as that, the CGI is everywhere, making it come across as lazy,\nthe production felt rushed, they should have taken the time to find\nreal landscapes, develop real sets and hire real animals, this would\nhave given the movie a more authentic feel, it clearly relied far too\nmuch on green screen and special effects, which did not help in making\nit any bit more compelling. Not without its moments of greatness, The\nLegend of Tarzan falls flat as a result of not being any bit unique, it\noffers nothing new to this franchise and is a forgetful affair, better\noff giving it a miss. <br><br>Tarzan must return to his jungle life to save his people from a\nruthless tycoon. <br><br>Best Performance: Christoph Waltz / Worst Performance: Djimon Hounsou\n"},
{"review": "\nSo I am going to start this review off by saying I clearly do not\nremember the Disney animated movie, if I even did see it, because The\nLegend of Tarzan was not at all what I was expecting. I enjoyed the\naction scenes but in terms of the plot I did not really care for it. <br><br>Starting from the beginning I was thoroughly confused as to what was\nhappening, who the characters were, and what time period the movie was\ntaking place. As the movie progressed I was able to appreciate the\ncharacters a bit more but I still didn't care for the plot line. It\nwasn't until about 75% of the way through the movie I understood what\nwas going on. The action scenes throughout the movie were intense and\nwere able to keep me entertained but I definitely would not go see this\nmovie again. <br><br>What I enjoyed most about this movie was how realistic the animals\nwere. Being that this movie was not animated I did appreciate that the\nanimals did not talk but were, actually, frightening at times. It took\nthe childlike tale of Tarzan and turned it into something that was more\nvicious. <br><br>However, overall I would not recommend this movie to go see unless you\nclearly familiar with the \"Tale of Tarzan\".\n"},
{"review": "\nBecause who doesn't love a little eight-packed ripped abs on a\nsix-foot-four handsome giant? Though, as my husband claimed, they could\nhave been digitally enhanced. I doubt it, though.<br><br>All my favorite tropes combined in this film to make one of my favorite\nmovies I've seen this year: wide-screen action, amazing CGI, a\nlove-to-hate bad-guy, cinematic beauty with beautiful jungle, river,\nand savanna-scapes, and some really hot romance. What's not to love?\nI've grown up a fan of the Tarzan/Jane love story. I watched the Johnny\nWeismuller versions as a girl, and enjoyed the cartoon Disney with my\nkids. But I admit to always hoping for a well-done cinematic\nmodern-take on the story, and this one delivered quite well. The\non-screen chemistry between the two leads sizzles, Nick Fury (because\nhe's not really Samuel L. Jackson to some of us) follows through a\nbelievable hero, and the back-story of Tarzan's growing-up years was\nwell-placed and smoothly worked in to the overall story.<br><br>Loved it.\n"},
{"review": "\nThis is without a doubt the worst remake of this classic. They totally\ndestroyed it and I feel for the kids of today who have this to look at\nas \"Tarzan\" for their generation. The CGI is so over the top it spoils\nwhat could of been a good movie into a waste of time. Sorry but it gets\ntwo thumbs down from me.<br><br>The guy they chose to be Tarzan was built like a weed compared to what\nyou would expect. The camera angles used to hide this got lost in\ntranslation. The real Tarzan would of snapped this modern day version\ninto two. The only thing missing from this Tarzan was his pink\numbrella. (No offence to the actor - the director is to blame)<br><br>This classic deserves far better than what this version has thrown at\nus. FAIL\n"},
{"review": "\nImo the pace of the story is too slow. a typical contemporary Hollywood\nadventure movie - no surprise here, no risk taking. Compared to Indiana\nJones movies (at least the three first ones) this is at most a mediocre\nflick. In short: I would prefer ANY Tarzan movie with Johnny\nWeissmuller over this, the only interesting character plays Christoph\nWaltz again, but compared to his great roles like in Inglorious\nBasterds and The Hateful Eight or Unchained even he looks a little \"too\nprofessional done\". This meal misses spice, lots of. A rating of 4 is\nenough for this endeavor - taken the potential the character and story\nof Tarzan provides this is a rather weak flick. cinematics and stuff\nare pro, CGI meh.\n"},
{"review": "\nI just saw \"The Legend of Tarzan\" this afternoon. Overall I'd say it\nwas a pretty good film. It was reverent in the right places, with\nprobably the best live-action depiction of Tarzan, one that is closer\nin tone to ERB's literary work than any other iteration. You can sense\nthe backstory in Tarzan's brooding silences, his pensive soul, his\nconcern for Jane, and his maturing acceptance of civilization's\ncapacity for greed and violence. <br><br>The director treats us with lush African landscapes, sultry jungle\nambiance, ambitious tracking shots, majestic animals and fantastic\ncharacter animation - all in reverence to ER Burrough's source\nmaterial. When combined with the sensitive portrayal of Tarzan by\nAlexander Skarsgård, this film hits a new cinematic benchmark for\nTarzan. Go and enjoy the trip!\n"},
{"review": "\nSo Hollywood have officially run out of ideas. With the exception of a\ncouple of films, this summer has been one of the worst I've known in\nalmost sixteen years. And films like this, only add insult to the\ninjury...<br><br>Years after leaving the jungle and settling down with his wife Jane in\nLondon, Tarzan is forced to return to the Congo in order to act as a\ntrade representative for England. <br><br>However, he soon clashes with a greedy Belgian captain who has sinister\nplans for his old home......<br><br>Of all the reboots that Tarzan has gone through, this is by far the\nmost expensive, and the most puerile version I've ever seen. And I'm\nincluding that turgid CG monstrosity from a few years ago, and even\nTarzan in Manhatten.<br><br>Skarsgård may have the monopoly on small screen vampires, but when it\ncomes to the big screen, he has no presence, and here, he just seems to\nlet his six pack do all the work. Honestly, his CG swinging counterpart\nhas more life than anything he does in this.<br><br>Waltz is on bad guy autopilot, and as much as I think he's a wonderful\nactor, he needs to stay away from big budget dreck like this, or his\nreputation will become tainted.<br><br>Jackson, well he does what he always does, steals any scene he's in\nwith anyone, but puts very little effort into it, as his character is\nonly in it so Tarzan can get to the big fight at the end.<br><br>The CG animals are okay, but we only saw that a couple of months\nprevious with the phenomenal Jungle Book, so you'll keep referring back\nto that film whenever you see an animal. And believe me, it happens a\nlot.<br><br>So all in all, it's a worthless, cold hollow shell of a film, that will\nbe forgotten in no time.<br><br>Wretched.\n"},
{"review": "\nThat star Johnny being my countryman Johnny Weissmuller, born in\nTimisoara, Romania, the leading character in \"Tarzan the Ape\nMan\"(1932), \"Tarzan and His Mate\"(1934), \"Tarzan Escapes\"(1936),\n\"Tarzan Finds a Son!\"(1939), \"Tarzan's Secret Treasure\"(1941),\n\"Tarzan's New York Adventure\"(1942), \"Tarzan Triumphs\"(1943), \"Tarzan's\nDesert Mystery\"(1943), \"Tarzan and the Amazons\"(1945), \"Tarzan and the\nLeopard Woman\"(1946), \"Tarzan and the Huntress\"(1947), \"Tarzan and the\nMermaids\"(1948), THAT'S THE REAL TARZAN, not this no salt and no pepper\nAlexander Skarsgård. The whole film is vapid, flavorless and inane.\nMr.Christoph Waltz as Leon Rom, does not prove being a major actor in\nthis role, anyone could have been in his place. Mr. Samuel L. Jackson\nis the same in all the movies, eating the bread to thousands of other\nplayers definitely more talented than him(I had enough to see him in\nalmost all the movies). Even \"Greystoke: The Legend of Tarzan, Lord of\nthe Apes\"(1984), directed by Hugh Hudson with Christopher Lambert and\nAndie MacDowell is much better. And because it is about writing reviews\nhere, somebody from IMDb or other serious writers of reviews, nobody\ndoesn't notices and to tell to those who do nothing than to narrate the\nfilm, that doesn't mean writing a review ???????\n"},
{"review": "\nThe movie gave me a chance to see how the book looked like in action.\nThe actions,fighting with the great Apes, how powerful a man Tarzan is,\nand Africa. Giving life to the books that I have read as a child.\nInter-actions with the animals is good.<br><br>As for the actors Skaarsgard and Robie portrayed Tarzan and Jane very\nwell. Hounsou, Jackson and Waltz are great pieces too. They made Tarzan\nthe legendary APE-MAN that he is. <br><br>Hope to get a better adventure/story line next time. Although, the plot\nis not far away on how ERB tells Tarzan.<br><br>All in all I am giving 8/10 because the movie made me excited, as if I\nwas a boy again reading his adventures.\n"},
{"review": "\nAmazing how 180 million dollar budget for the movie can bring you a\nmovie that one can compare with vomit. This one will go down in history\nof film making as an insult to all the great actors participating in\nit. Christoph Waltz, Samuel L. Jackson, Alexander Skarsgård, Margot\nRobbie. And the fact that people gave this movie a 10 is very\nsuspicious. In my opinion you have to miss some chromosomes in order to\ngive this movie a high rating after watching it in the first place, and\nsecond, write a 2 pages review explaining how great it is. Again, this\nis as empty as an empty dumpster. I regret the time spent watching this\nand would not recommend it to anyone. Period.\n"},
{"review": "\nAh, yes, this is why we go to the movies. Entertaining, inspiring, an\nescape, thrilling and wildly imaginative, \"The Legend of Tarzan\" would\nmake Edgar Rice Burroughs proud. And I think he'd enjoy the updating of\nthe story by using as a backdrop the horrifying, true story of the many\natrocities committed by Belgian King Leopold in the Congo. This movie\nis likely to go unappreciated by \"serious\" film critics just as\nBurroughs was neglected by serious literary critics. Although In a\n\"Paris Review\" interview, Ray Bradbury said of him that \"Edgar Rice\nBurroughs never would have looked upon himself as a social mover and\nshaker with social obligations. But as it turns out \u0096 and I love to say\nit because it upsets everyone terribly \u0096 Burroughs is probably the most\ninfluential writer in the entire history of the world...\" Bradbury\ncontinued - \"...by giving romance and adventure to a whole generation\nof boys, Burroughs caused them to go out and decide to become special.\"\nThis movie couldn't be more true to Burroughs' portrayal of Tarzan,\nJane, and the Mangani, the fictional species of great apes that foster\nand raise Tarzan.\n"},
{"review": "\nThis movie is NOT the same old Tarzan. It's the next chapter. Sure we\nget the origin story through flashbacks that tell enough to update\nthose truly oblivious to Tarzan's story but this is Tarzan on a quest.\nA mission to save not only his wife but his home and his families (both\nhuman and mangani).<br><br>A breath of fresh air to watch. Action with a purpose and well muscled\neye candy swinging on a vine to boot. Plus Jane has gotten a major\nupdating and is not a damsel in distress but a true partner to this\nLord of the Jungle. Additionally we've got Samuel L. Jackson to aid in\nexposition and comedy.\n"},
{"review": "\nThe Legend of Tarzan, was an amazing movie. I was engaged from the very\nbeginning. There wash't one time when I was caught off guard or\nconfused. The movie had great detail and contained a great story line.\nThe graphics were amazing, I felt like I was part of the movie, and I\nbelieved it was realistic. Tarzan was always one of my favorite\nchildhood movies, and this movie is one of my favorite as of right now.\nI would suggest to people to watch this movie. I also loved how they\nchanged the original story and added some more interesting detail to\nit. It wasn't boring and also was a change to what I grew up with. If\nyou don't like action movies, I wouldn't suggest watching this because\nit has a lot of action and has a lot to keep up with.\n"},
{"review": "\nTo think that this film is scored very close to say, \"Greystoke:The\nLegend of Tarzan\", is absolutely comical. I do believe we'll see a\ngigantic fall- off after about a month of DVD release. It should settle\nat about 5.7-5.9 in the near future. I do recommend watching that\nearlier film. <br><br>\"The Legend of Tarzan\" has an interesting chronological take on the\nTarzan legend, and some of the film without the frantic action-CGI\nstuff actually looks pretty good, but that's where the interest ends.<br><br>Much of the film is riddled with ridiculously over-the-top CGI. The\ndialog is severely under-written, and the acting isn't much better.\nThere's absolutely nothing here to draw-us in and care about any of\nthese characters. And where the time-jumping helps in certain areas, it\nhurts in others. <br><br>Christolph Waltz is a fantastic actor, but not even he can do anything\nwith this dreadful script. I've only seen about 20 films from 2016, but\nthis is the early front-runner for the worst film of the year - that\nI'll see anyway. Watching the last hour was like sitting at the airport\nduring 4-5 flight delays. Just get me outta here.<br><br>If you like surfing wildebeasts it might be your bag. Margo Robbie is\ngorgeous, but her efforts here are even more futile than Megan Fox's in\nJonah Hex. Yes, even Jonah Hex is better than this Tarzan film. <br><br>I hope that saves you some time. <br><br>Tons of little problems, but the big problem is the dialog, which is\nbare as the desert, and dumb as a rock.<br><br>I would defo pass on this.<br><br>You might like this if you LOVED: peter jackson's KIng Kong,\nTranformer's Revenge of the Fallen, or Indian Jones and the Kingdom of\nCrystal Skull. And this would be the worst among those.\n"},
{"review": "\nWe bought the DVD, watched it, didn't think much of it, put it on\nAmazon to sell as soon as we had watched it, and sold it the same\nnight....I thought the Tarzan character was one dimensional and he was\nuseless, he got into one scrape after another, some hero! and Jane was\na pain.... feisty!? Or stupid? it all seemed very predictable. I did\nlike Christopher Waltz, who played his part well, even if the character\nwas just too unbelievable. Samuel L Jackson did we even need his\ncharacter in the film at all? He added nothing to it, and I do like him\nas an actor. CGI was good. But I just found the whole film, boring and\npredictable with a rubbish story line, it was a sort of non film,\nnothing much going on, Tarzan had just the one look, he had no\nexpressions whatsoever. In fact I can hardly remember the film and only\nwatched it 4 days ago...\n"},
{"review": "\nGoing into this movie, I had a good idea of what I was going to\nexperience, but I must say, this movie felt incredibly flat, and now\nthat I look back on it, I feel like there is not much good to be said\nabout this movie.<br><br>I actually thought that the premise of the movie was quite interesting.\nThe story focuses on Tarzan after having left the jungle and taken up\nmore of a civilized human lifestyle. He finds his way back due to\ncertain events and has to save his people from greedy Beligish\ncolonizers.<br><br>I liked how the story focuses on a more worldly Tarzan who is not the\nape-man he once was. I think that, given to the right people, this\nmovie could really have been something really great, but unfortunately,\nthe movie goes astray and loses it's direction. What we end up with is\na very generic adventure film. <br><br>Everything from the writing to the acting to the score feel like they\nwere done in a very short span of time. There are moments in this film\nthat are so cliché that you wonder what these film-makers were\nthinking. It just felt lazy.<br><br>The animation of the animals is decent at times, but ultimately fails,\nbecause we see through it ashamedly often.<br><br>This movie is a flop, and it could have been a lot better in many ways.\nIt seems like Hollywood has been getting this a lot lately, Warner\nBrothers even more so. The Legend of Tarzen will deliver an interesting\ntake on the story of Tarzen, but it doesn't go very far at all.\n"},
{"review": "\nI can characterize this movie as a pretty typical adventure film. There\nwas too much CGI for me in showing the nature, animals and movements on\nthe vines \u0096 as for the rest the visual aspect it was OK. <br><br>I can actually say neither super bad nor anything good about the\nactors' play, except for Christoph Waltz who was pretty good as always\nalthough he did not seem showing us anything new and fresh that we\nhadn't seen in his previous roles. Samuel L. Jackson plays an ardent\nfighter against slavery and racial prejudice, but the script itself\ndoesn't depict this hero clearly and profoundly, and therefore his\ncharacter does not cause much delight.<br><br>In general, there're two main things that make me give the film only 6\npoints. Firstly, all the characters are poorly depicted from the very\nbeginning. And secondly, the movie that can be called a continuation of\nthe famous Disney animated cartoon could have had some sharper humour\nin my opinion. <br><br>For me personally \u0096 this film is to be watched only once.\n"},
{"review": "\nTarzan...This sounds like it might be worth watching, I didn't have\nhigh hopes considering the amount of trash we get fed these days, but I\ndigress, sitting down comfortably on my sofa, popcorn in my hand, I\nsoon became aware of a smelly ponk, this movies is a stinker, after 15\nmins my eyes started to close due to the utter boredom, nothing\nhappens, it's just utterly mind numbingly boring, I fell\nasleep.....zzzzzz, sadly I woke up, watched a bit more, well I tried\nbut my mind started wandering, dreaming of watching paint dry far more\nexciting and dramatic than watching this non event, and don't get me\nstarted on the tacky CGI, it is woeful, laughable, horrendous, yep it's\nthat bad.<br><br>Now I'm lost for words because I fell asleep again, because it's so\nfreakishly boring and drab, there was more colour and life in my box of\npopcorn, I could have stared at my popcorn for 2 hours and had more fun\nthan watching Tarzan, bore of the jungle. Sadly I fell asleep yet again\nand turned it of after 1 hour because it's just so god damn dull and\nboring.\n"},
{"review": "\nI can't claim to have had any particular interest in \"The Legend of\nTarzan\" and actually only watched it because my wife wanted to. And\nhaving seen the old black and white Tarzan movies starring Johnny\nWeissmuller, then I had essentially seen enough of Tarzan to last me a\nlifetime.<br><br>Sure, \"The Legend of Tarzan\" was a beautiful movie visually, but\nentertainment wise, not so much. This was a very mediocre movie if you\nlook at it for the entertainment value.<br><br>The story was not a particular thrilling one, nor was it a story that\nreally brought anything overly new to this iconic character.<br><br>The special effects in the movie were quite good, and the CGI animated\nanimals were quite impressive and very life-like. That was essentially\nwhat kept the movie afloat.<br><br>As for the acting, well I can't really say that Alexander Skarsgård put\non a particular memorable performance as Tarzan / John Clayton. He was\npractically just a walking set of muscles, and I think that they should\nhave cast someone else for this role. Normally I do think that Samuel\nL. Jackson (playing George Washington Williams) is fairly good, but he\ndidn't really excel in this movie. It was, in fact, Christoph Waltz\n(playing Leon Rom) who were the driving acting talent in this movie,\nand he really did so with flying colors.<br><br>The iconic Tarzan call was there as well, as it should be. But it was a\nweird mutation on what you are used to, especially if you grew up with\nthe Johnny Weissmuller movies. But for a new audience, I guess this\n2016 sound is adequate. But for us older audience, not so much.<br><br>\"The Legend of Tarzan\" was a very mediocre movie experience. And for\nme, this was a movie that came and went without leaving a lasting\nimpression. And it is also the type of movie that you will watch once,\nthen never again.\n"},
{"review": "\nThere were 25 books written about Tarzan, and I've read them all\nseveral times. He's one of the great fictional characters of the 20th\ncentury, and many later characters were created using the basic\nframework created by Burroughs; every time you see one lone man face\nimpossible odds and win, (Bond, Eastwood westerns, Die Hard, etc.)\nyou're seeing the hero type Burroughs created. This movie is by far,\nthe best Tarzan movie ever made, and the first to depict the hero as\nBurroughs invented him. Several \"reviewers\" try to dismiss Tarzan and\nthis movie as \"racist\"; clearly, they know little or nothing about the\noriginal character. If a fictional character survives long enough, they\noften become lampooned and reduced to comic status; this doesn't mean\nthat the original character isn't great; sadly, we seem to delight in\nmarginalizing our heroes. If you want to see a well made and\nentertaining film that depicts the character as his inventor intended,\nthis is a movie you should see. And while you're at it, watch another\nrecent Burroughs movie done well, \"John Carter\". ~DL\n"},
{"review": "\nWell, the critics were wrong about this one. I'm not saying this is the\ngreatest movie of all time or anything. But it does just what it should\ndo for an action adventure. However what I like the most about this\nmovie is how it feels like an established franchise right out of the\ngate. Tarzan is established and we get just enough of an origin story,\nwithout being bored to death. The acting in the film is solid all\naround. In what has been one of the most disappointing years when it\ncomes to movies in resent memory (thanks to the DCU, they need to\nreboot it ASAP), Tarzan is a very much welcomed adventure. Final score,\n7.3 out of 10.\n"},
{"review": "\nI am not saying i didn't enjoy the movie. Yes sir, I did enjoy the\nmovie the first 30-40 minutes. From there, I don't know how but someway\nthe director lost the sense of direction. Growing up, we learned the\nlegend of Tarzan as someone who is special to the jungle not politics.\nSomeway, i can understand director's choice of bringing an American\nblack fellow into the mix of slavery. But, if you are going to make him\ncentral, give him strong content. With this i come to Tarzan, GIVE\nTARZAN SOME STRONG CONTENT. All i saw was a person mixed in a lot of\nstories, had no clue about other characters, was trying to be part of a\nlot of clan/tribe/family. This, this movie right here is a disrespect\nto the legend of Tarzan. And this comes from a fan of both Yates and\nTarzan.\n"},
{"review": "\nBland is the only real word to describe The Legend of Tarzan. Alexander\nSkarsgard certainly looks the part and has some charisma as Tarzan but\nhe is consistently undercut by a half-cooked script. The same goes for\nMargot Robbie as Jane who's only purpose in this film is being the\ndamsel in distress. Samuel L. Jackson and Christoph Waltz are also hung\nout to dry with their one dimensional characterizations as the comic\nrelief/sidekick and mustache twirling villain, respectively. <br><br>The film is also very unfocused as it constantly shifts to flashbacks\nand present day. This can be an effective technique however in this\nfilm the flashbacks bring any momentum the film manages to get to a\nscreeching halt. The pacing of this film is the biggest issue that this\nfilm has. I was a huge fan of director David Yates' Harry Potter films,\nbut with this movie he seems unsure with the kind of movie that he\nwanted to make. To move on to a more positive note, the cinematography\nis simply gorgeous. The lush landscape of the jungle makes for some\ngreat visual moments. However at the end of the day besides the\ncinematography and Skarsgard's performance, there is not much to\nrecommend in this one.\n"},
{"review": "\nSome of the online photo-stills make \"The Legend of Tarzan\" look pretty\nhokey, so I was a little hesitant about paying to sit through it in the\ntheater. Having now taken the chance, I can happily say that this film\nis definitely not another feeble disappointment like 1984's\n\"Greystoke.\" Though purists may dislike the fact that it's not directly\nbased on any one of Burroughs's novels, there is still basic loyalty to\nhis Tarzan mythos, and the way it incorporates some true history\u0097King\nLeopold's exploitation of the Congo Free State, poaching of its game,\nand horrible enslavement of its natives for profit\u0097adds a great deal of\nrelevance for a modern audience.<br><br>While it's obviously intended mainly as plain old entertainment, \"The\nLegend of Tarzan\" meshes humor and heartbreak very well, and the many\naction sequences are riveting without going too far in asking us to\nsuspend disbelief. No, it doesn't all make perfect sense, but perfect\nsense can hardly be expected of a fantasy of this kind. The visuals and\nanimation are quite arresting; most of the animals look real, the one\nglaring exception being the Mangani apes. But then again, this film\nreminds us that the Manganis are NOT gorillas or chimps. As in\nBurroughs, they are a separate legendary species--a missing link of\nsome kind, perhaps? The script is generally decent even though many of\nthe lines sound more 21st than 19th century. Good acting by all the\nmajor players, but those who play the native Africans steal the show.<br><br>Some budget constraints are evident, and it's an ambitious storyline to\npack into two hours: The whole pace of the film is a bit hurried.\nRegardless, anyone who's interested in seeing another Tarzan film in\nthe first place should not be disappointed and may really love \"The\nLegend of Tarzan.\"\n"},
{"review": "\nThe story of Tarzan is more a tragedy in today's world. It is a sad\ntime where we rape nature, destroy balance and revel in our\ndestruction. When I used to read ERB's books, it did transport me to\nfantasy land. A land where everything was in harmony. In balance. In\nsync. Where the circle of life was complete. This movie, did remind me\nof our rapacious nature. It signaled the unstoppable nature of human\nappetite for destruction. But as a standalone move, it could have been\nbetter.<br><br>I read somewhere in trivia that Tarzan was a superhero. Well, not\nexactly with super powers, but definitely super human. He was supposed\nto have these extraordinary capabilities. He had been able to even\ndefeat the great apes. The story teller or the director may have wanted\nto show the vulnerable or weaker side of him, but to me that was not\nTarzan. For him to be defeated physically, his foe would have had to\nalso been subject to character development. Tarzan is a character that\nis meant to challenge our physicality. If it were intelligence, I would\ngo for, off the top of my head, 12 Angry Men, JRRT's LOTR and Peter\nJackson for imagination, Star Wars for effects. I would have really\nliked to see Tarzan fighting and winning physical fights. <br><br>At the end of the day, Tarzan won. Simply because of his brute force in\nthe sensitive universe of Africa. Not politicking. I hope the next\nstory stays in the glorious fantasy world of ERB and brings out the\nphysicality of Tarzan with a poignant touch. We don't really need\nrealism here, but brutality. I want to see magnificent fighting. I want\na contrast of nature with our modernity. I want the star of the movie\nto be Nature, her beauty and what might have been. <br><br>PS. It may have been interesting to see why Tarzan transitioned from\nnudity to loin cloth/pants!\n"},
{"review": "\n7/10. In a different take on Tarzan, he is lured back to the jungle\nafter he has settled back into normal society. I was thinking that\nTarzan has been done to death, but I was surprised and really enjoyed\nthis. In the safe hands of Director David Yates I found myself drawn\ninto the Tarzan world and didn't find any low points, it was well paced\nand kept me interested. Alexander Skarsgård who normally plays small\nroles in films, does a decent job as the lead actor. Christoph Waltz is\ngreat as usual, and Margot Robbie as Jane also is good, it has been a\nbig year for this up and coming Australian actor. So definitely check\nthis one out, it's a solid fun action flick. Legend of Tarzan\n#legendoftarzan\n"},
{"review": "\nI enjoyed the new version of the ape man , Tarzan . all the stories and\nfilms that had seen so far portrayed the origins of Tarzan and stories\nof this jungle . This film deserves a big applause for being one Tarzan\nreturn to its origins . I love the detail of the figure female again to\nscrew it up. No Jane , there was film. :) The most negative points are\nthe special effects in fighting with animals and excessive conduct of\nTarzan , while English earl . Clayton expected a well dressed but with\nsome animal behaviors , typical of their origins . I enjoyed knowing\nthat the villain was Rom based on a villain even existed and terrorized\nhumanity .\n"},
{"review": "\nOverall I liked the movie because I like the Story of Tarzan and any\nopportunity to get exposed to it in the big screen is a good day.<br><br>This time around, the visuals the acting the sets, the story the\nintrigue and the animal undertone lurking were all there. So very good\nin that Regard!<br><br>Where this movie loses is I believe in the editing part again, it seems\nsome bureaucratic force decided to chop the movie in order to fit some\narbitrary and non artistic format. Which is disappointing. Was it done\nto fit the movie within a certain time frame or because they wanted to\ntry to have the \"Action\" be more intense it its delivery we may never\nknow but it causes holes in the story and there were many moments I was\nwonder \"what has happened here?\" and \"how did A lead to C, where is\nB?\". At times it felt dry and without Spirit without Magic.<br><br>And I am hoping this chopping of movies will stop.<br><br>What was not very poignant too was the music score, I do not remember\nit at all, and maybe this is also a contributor to the lack of magic,\nthere was no score causing that heart pounding feeling. <br><br>Other than this, I think the movie makes for an entertaining afternoon\nand a nice new iteration to the story of Tarzan and his Legend :)\n"},
{"review": "\nSeriously!? <br><br>No Really!?<br><br>This has got to be a joke!? The worst film I've ever seen. I cannot\nbelieve I wasted my time watching this - I kept telling myself it was\ngoing to - no wait - it HAD to get better. But it didn't.<br><br>Don't say I didn't warn you! <br><br>How on earth did this absolute nonsense get a 6 on IMDb?<br><br>Christopher lamberts 1984 a version of Greystoke was a far superior\nmovie. And if you remember that film. Stick with your happy memories\nand don't watch this one.<br><br>Sadly - You cannot unsee this movie.\n"},
{"review": "\nI read some of the reviews and found three that do sum up the truth\nmore than the others. fortheloveofcinema and James Smith from Australia\nand stanleyprunty from Bristol I've seen the film and every day I think\nless of it. Story was not filled with energy. the people boring, SJ\nshould not have been there as a useless character. And after re-reading\nthe 24 Tarzan books by ERB, I'm really annoyed by a Tarzan making (bad)\njokes an laughing his head of. TAZAN DON'T DO THAT! And, like lord\ngreystoke, the aristocrat, could build a hut, way up in the trees..\nYeah, right.... IT'S NOT BUILD IN A TREE!!! The Tarzan film before this\none that I went to with my (at that time not yet) my wife was the\n\"Greystoke\". That one was way and way better...<br><br>I did want this to be a good new Tarzan-movie. I hope some day some one\nwill make the Original story into a good movie...\n"},
{"review": "\nTarzan, having acclimated to life in London, is called back to his\nformer home in the jungle to investigate the activities at a mining\nencampment. The Legend of Tarzan is probably one of the better reboots\nthis year the film has great amount of cgi mostly in the animals and\nlocations that i think it really works not 100% all the time but the\nCGI at least 90% of it looks really good especially the fight scene\nwith Tarzan and his Ape brother. The humor of the film is kinda the\nsame with the Raimi Spider-Man movies it works always and most of the\nfunny lines comes from Samuel L. Jackson who has a bigger amount of\nscreen time than any of the Marvel Movies, Alexander Skarsgård except\nthat his big as hell the man understands the character and he gave a\nreally great performance the same goes for Margot Robbie as Jane and\nChristoph Waltz as the big villain of the film. I'm glad that they\ndidn't go and did the origins again and again instead they showed\nTarzan being a human and doing his thing swinging from tree to tree and\nconnecting with animals or even the flashback scenes with Jane when he\nmeet her it reminded me a lot of the 1999 Animated Movie Tarzan which\nis amazing also i loved the connection that he had with his Ape mother\nand his friends. Make sure you check this film out cause it's not as\nbad as many people said the movie got a 36% on Rotten Tomatoes and\npretty much said that the film has a generic plot although a bad movie\nsuch as Ghostbusters got a 73% and it was fun for them? Tarzan has more\nclever jokes and action than Ghostbusters 2016 had and it's a fact that\nthe cast did an amazing job, the cgi was great and the film has many\nbeautiful locations and cinematography i give The Legend of Tarzan an\nA+ and a 10 out of 10.\n"},
{"review": "\nThis movie is so bad I think the only reason I gave it a 3 star rating\nother than my charitable nature is that I actually managed to sit\nthrough it.<br><br>I love Tarzan and almost every movie I've seen related to the story but\nnot this one. You get the feeling that the director confuses Tarzan\nwith superman or spider-man. The characters are one dimensional and the\nactors didn't do the production any favors with their mediocre\nsometimes child-like performances. I love Samuel L. Jackson and his was\nthe only acceptable performance (though definitely not his best, yet\nstill passable). What's really sad is that the movie did have\npotential, but I guess they had so many different ideas that they got\ndistracted and ended up with events that were disconnected and all-over\nthe place<br><br>It was a waste of money and time\n"},
{"review": "\nI wasn't sure what to expect...I went to see it with my father-in-law\nand we both thought it was spectacular. Alexander Skarsgard was\nchilling, relentless and breathtaking. It was obvious he trained hard\nto be in tremendous physical condition for this role. Jane was\nbeautifully played by the stunning Australian actress Margot Robbie.\nThe chemistry between the two was undeniable. In addition to Tarzan's\nrole to help determine the impact on the Congo of the Belgian presence,\nhis \"side-kick\" Dr. George Williams (superbly played by Samuel L.\nJackson) lent even more credibility to the evidence they gathered. They\nsaw first hand how ruthless the Belgians were to not only try to gain\nfull control of the Congo and enslave thousands of natives in the\nprocess, but how greedy they were to get their hands on the diamonds.\nThe scenes with Tarzan and his animal friends were stunning.\nChristopher Waltz was tremendous as the villain Rom...any time an actor\ncan make you \"hate\" them, they've done their job very well. Overall, we\nwere truly taken by this film. I hope there will be more in the future.\n"},
{"review": "\nI've seen lots of Tarzan movies, serials and television shows. This\nmovie is another one that the critics have been overly harsh on.<br><br>I consider this latest effort to be up there with Christopher Lambert's\nmid 80's opus GREYSTOKE. Indeed, I think this does better by matching\nthe deconstruction of Lambert's effort, this movie goes one better by\ngiving us a adventure romp.<br><br>The movie further gives the apes and the native Congolese a much richer\nperspective.<br><br>The narrative was so well put together that there is hardly a wasted\nshot in the movie - everything contributes to both the plot and the\ncharacter arcs of the major parties.<br><br>Overall, a great movie, VERY entertaining.\n"},
{"review": "\nI must say that this movie was awful in every regard. story line was\nconfused and muddled which led to the whole movie going experience in\ntatters. fail. I went with a friend as a last minute whim and boy did\nwe regret it, she was constantly in and out of consciousness and I\nfound myself patting myself down looking for match sticks to prop open\nmy eyes. seriously bad. The movie opens with Tarzan being in London\nwearing a suit. need I say more! I have never been one to walk out of a\nmovie but dang it did this push me close to the edge and knowing the\nrunning time also didn't help because I was looking at my watch for\nwhat seems an eternity for this miserable flop to end.\n"},
{"review": "\nTHE LEGEND OF TARZAN (2016) *** Alexander Skarsgard, Samuel L. Jackson,\nMargot Robbie, Christoph Waltz, Djimon Hounsou, Jim Broadbent. Well\ndone origin story of Edgar Rice Burroughs' iconic jungle tale with a\nwell-buffed Skarsgard as John Clayton, Lord Greystoke cum Lord of the\nApes facing a 19th century European takeover of his primate sanctuary\nand enslavement of its natives with help from Jackson as George\nWashington Williams versus Waltz' Snidely Whiplash villain Leon Rom who\nhas abducted Clayton's wife, Jane (the ethereal Robbie) in pursuit of\nthe vine-swinging nobleman for devious reasons aside. Well directed by\nDavid Yates with a strong screenplay by Adam Cozad and Craig Brewer and\nenhanced with amazing CGI visuals of the populace of creatures and\nanimals at the beck and call are further embellished by the lush\ncinematography by Henry Braham. See it on the big screen to take in its\nepic scope.\n"},
{"review": "\nWell, actually its a really great concept to think about it. \"Life\nafter Tarzan get married\" sure many people want to see that. its also\nhave a great cast such as Christoph Waltz and Samuel L Jackson (they\nkick it). And that's where the problem begin, i think the film think\nabout the cast so much they forgot about the plot and the movie\natmosphere.<br><br>the movie is boring AF, i feel no connection between Alexander\nSkarsgård and Margot Robbie, what emotion and connection they want to\nemphasize? they went emphasize everything and come out very dull. <br><br>The ending is a big MEH and the atmosphere? this is where i annoyed the\nmost, i don't feel being drag to a jungle but a big studio with a lot\nof green props, at the first time Jane meet Tarzan, the lighting not\nreally make it because it hit at the area where emphasize its was a\nstudio<br><br>and the cgi really? that digital animal just bad, really bad (specially\nthe crocodile one gosh), its like i have been brought back to 00's.\n"},
{"review": "\nAlthough I rated this a 10, I thought that this movie was very good,\nbut needed more character development and more longer scenes with\nTarzan in the jungle. I enjoyed the movie a ton, however, so if you are\nin the mood for loads of fun, I think it would be wise to see this at\nthe cinema. The CGI has been criticized for being cheesy, which I\npersonally disagree with myself. I really liked the CGI of the animals,\nand it was good to see it on the big screen. If that was not detailed\nenough, well keep reading!<br><br>None of the England scenes should of been removed or shortened,\nhowever, I still felt like it needed more Tarzan In The Jungle scenes.\nInstead of flashbacks, the movie's first seventy minutes should of been\nTarzan growing up in the jungle and not just skipping straight to the\nmain story. Then, when they finish with the seventy minutes with Tarzan\ngrowing up with the apes, they can then spend another two hours with\nthe story of the slaves (this film's main story) with three minutes\nmore character development and eight minutes of more Tarzan in the\njungle with Samuel L. Jackson. But apart from that, this film was\namazing and thrilling. Even my grandmother liked the movie when she saw\nit with me! So, overall, apart from the movie being too short I have to\nsay that this is amazing, and it deserves a 7.6/10!\n"},
{"review": "\nHonestly I went into the cinema for the cast, mainly Christoph Waltz\nand Alexander Skarsgard, but found that the whole cast had lived up to\nexpectations I didn't know I had. Visually, regardless of peoples\nexpectation of special effects, I found that the animals were all\nincredibly realistic and meshed perfectly into their surroundings.\nSurroundings that up until seeing the film, I had assumed were too\ngreen-tinted, it was only while watching that i realized just how well\nthe colour scheme actually worked. I ended up leaving the cinema\nthinking that Alexander Skarsgard's accent was much better than I\nthought it would be and that Margot's wasn't at all half bad. I feel\nthat there should be no reason to say just how good Christoph Waltz was\nas a psychological villain. Even Alexander Skarsgard, who would have to\nbe my favourite actors at the moment, was out shined in certain scenes\nby Djimon Hounsou. That man(Djimon)is one of the most heartfelt and\nunderrated actors I've ever seen, he can move from so many emotions so\nquickly and can make you feel for his characters with the smallest\nchange. (See Blood Diamond) To conclude, it's easy to assume that by\nreviews from critics that this film might be a flop, but without\ngetting your hopes up I can safely say that it has a solid story line\nand has no direct relation to the 1999 cartoon, but rather the Edgar\nRice Burroughs novels. In the end it's up to you to go see it, but my\npersonal opinion is that you should go into the cinema thinking it may\nnot be the best, but definitely worth the watch, and you might be\nsurprised by what you see, You may even laugh. Especially when Samuel\nL. Jackson's on the screen, need I add it. My favourite thing about it,\nwas how they incorporated real historic people into the story line\n(Leon Rom and King Leopold etc.)\n"},
{"review": "\n'The Legend of Tarzan' is not as bad as many people have put it out to\nbe, directed by 'Harry Potter' veteran David Yates, is actually a very\nrespectable re-adaptation of Edgar Rice Burroughs classic character(s).\nWhile it's really an original story not borrowed from any books, I'll\nsay for one this film is a accurate in a sense to stand on it's own as\nwell as acting on fidelity of it's source material. I also love the way\nit defies most the usual conventions of previous Tarzan iterations, and\nreally bring out the big essence of the African landscape as well as\nthe well drawn out nature of it's characters. There's no denying the\nfact the film is gorgeous to look at especially with such a huge\nspectacle at play. Though while it's plot may be far from original,\nthat doesn't deteriorate the film from being fun and exciting even when\nit gets dark, suspenseful and energetically adventurous. The pacing\nwasn't all too much of a problem for me, as the flashbacks used were to\nre-establish some of the well known details about the character (How is\nit any different to the way it was used for Batman or Superman for that\nmatter). The only thing I found to be off-putting was the overuse of\nCGI for almost 'all of the animals' present in the film, and don't\ndeteriorate from the entertainment factor of this film. For one it's\ndefinitely one of the better 'Tarzan' films made to date, a little more\nrespectable adaptation of the character than Disney's 1999 film, John\nDerek's horrible 1981 film and that 2013 motion capture crapfest for\nthat matter. Finally, the performances from the cast are great,\ndefinitely couldn't of picked a better cast for such a picture. If\nyou'd like to take a different look at the character of Tarzan and are\ncurious to see an entertaining and adventurous re- rendition of the\ncharacter, this film will definitely be worth your time.\n"},
{"review": "\nI had to tell you all about one of the surprise fantastic films of the\nsummer. I must agree that \"The Legend of Tarzan\" was an action-packed,\nscenic epic with great character actors and a dramatic musical score.\nThe story has Tarzan (portrayed by an amazingly swelt, Alexander\nSkarsgard - AKA Eric from TrueBlood) Margot Robbie is a spitfire Jane,\nand Christoph Waltz is fantastic as the bad guy. The film starts with a\ncivilized Tarzan, already a part of high society, who is asked by\nSamuel L Jackson (also a great addition to the cast) to return to the\njungle for a special mission. The mission is exciting, and the animal\nspecial effects are the best I've seen. (and yes - animals and humans\nmeet their demise, but neither are innocent of wrongdoing and all are\ncreated by CGI) Now this was a great summer movie! (as apposed to the\ndisappointing Independence Day -Resurgence)In fact, I thought it was\none of the best epic films in many years.\n"},
{"review": "\nThe plot of the classic adventure tale has been reconfigured and \"The\nLegend of Tarzan\" is unexpectedly entertaining. The story is simple\nenough as the Tarzan fights slave traders to rescue his kidnapped wife,\nin a full of special effects jungle adventure. Unfortunately David\nYates with the mix between present day and flashbacks, can easily\ndisorientate the viewer, but the fans of \"The Jungle Book\" should enjoy\n\"The Legend of Tarzan\". It has the same type of computer generated\nanimals and a dark, exotic jungle that makes boys act like men.\nAlexander Skarsgard is uninteresting as Tarzan and altogether, \"The\nLegend of Tarzan\"may look great and try to take itself seriously, but\nit's really just a popcorn movie. Treated as such, it's plenty of fun.\nnikisreviews.com\n"},
{"review": "\nAn excruciating attack against common sense. <br><br>Stupid plot, boring dialogues, clichés everywhere; was there anything\ngood in this movie that I have missed?<br><br>Did the director lost his minds or something? Did they all smoke pot\nwhile creating this? Did anyone watch this movie before releasing it?<br><br>The purpose of art is to help viewers to experience their emotions:\n\"Tarzan\" showed me how embarrassment really feels.<br><br>Do yourself an favor: when someone lures you into seeing this file,\njust run and never look back. <br><br>I still wonder who have it 10/10? Were they paid for this? Should't\nIMDb check whether they are legit?\n"},
{"review": "\nIt took me a couple of minutes to realize \u0096 this is one of the movies I\nwill tell my children to not spill their time on. I cannot place it in\na category- it is not a historical movie- it is not near by fantasy\u0097\nSci\u0096fi? No way- but I could live with that- What it is killing my joy\nis a terrible script and a poor acting- there is no bloody reason for\nan admitted aristocrat to go back to the place he will never belonged\nto! And the accent and the love story????? ! I am not a huge fun of\nTarzan at all, but I have expected at least something better than a\nDisney interpretation. It is way worth. The script is lame. I feel\nnothing between the main actors or any figures of the movie at all. BAD\nBAD movie.\n"},
{"review": "\nThe Legend of Tarzan is the epic version of Burroughs' story. Many\nscenes are similar to the opening scene in \"King Kong\", with mist and\namazing scenery and savage tribes to bring back a mysterious past of\nlittle known areas of our planet. The movie makes justice to the raw\nbeauty of the African continent. The script cleverly weaves in\nhistorical facts little known about the destructive control of the\nEuropean imperial powers over the African continent. Even though at\ntimes the computer generated imagery and action becomes obvious, if you\nlet yourself carried on by the story you will end up with a wonderful\nsensory experience rich in amazing imagery and epic music.\n"},
{"review": "\nI have been a fan of Tarzan since childhood when I read the stories in\nthose Whitman Book editions. While I was a big fan of the Ron Ely TV\nseries, I never felt that the Tarzan movies ever captured the essence\nof the iconic character created by Edgar Rice Burroughs.<br><br>Until now!<br><br>What a wonderful film filled with adventure, romance, and morality that\nworks on so many levels.<br><br>Kudos to director David Yates and his team for doing such a marvelous\njob of distilling ERB's vision in such an exciting and entertaining\nway. <br><br>Alexander Skarsgård reminds me of Ron Ely and Margot Robbie joins\nMaureen O'Sullivan as the ultimate Jane. Samuel L. Jackson and\nChristoph Waltz provide outstanding support.<br><br>I cannot praise this film enough.\n"},
{"review": "\nGood story, backed by appealing visual effects, impressive direction\nand solid performance - what more did you expect from \"The Legend of\nTarzan\"..and guys, you are missing the point, the 1st half of the story\nportrayed a civilized John Clayton who initially refused to go back to\nthe wild as Tarzan. As the story unfolded, John did visit Congo on an\ninvitation (from King Solomon) orchestrated by a mercenary (Capt Leon\nRom) hired by King Solomon who was exploiting the Congolese people and\nthe rich mineral resources of Congo. The true intention was to trade\nTarzan off to an enemy Tribal leader (his son was killed by Tarzan) and\nget precious diamonds in return, to fund the King's Army. Tarzan\nhowever believed in his instinct and went to Congo to see for himself,\nthe wrath brought upon by King Solomon on his tribesmen and Congolese\npeople. The story takes an interesting turn when Capt Leon abducts\nTarzan's wife Zane as a compensation (also as a hostage) after his\nfutile attempt to capture John aka Tarzan. The rest of the movie\nreveals how John Clayton transforms himself into his wild avatar Tarzan\nand rescues his wife and eventually saves Congo from slavery and\ntyranny imposed by King Solomon. A must watch !!\n"},
{"review": "\nI loved it. The story line was well done. The Chemistry between the\nactors was dead on. Samuel L Jackson brought his quirky quick wit to\nhis role which as usual was awesome. Christoph Waltz doesn't matter\nwhat role he plays he is always awesome in it. Margot Robbie was not\njust beautiful but gave her role a real personality that the role of\nJane has not had in past movies. Alexander Skarsgard, being a fan of\nTrue Blood whom I was in love with the character Eric Northman, fell in\nlove with him even more he did a fantastic job as giving Tarzan a more\nreal like personality. The Chemistry between Robbie and Skarsgard was\nscorching. I was very impressed. Great movie it is a must see!\n"},
{"review": "\nDefinitely worth seeing on the big screen. <br><br>Special effects were believable and the acting was very good. Alexander\nSkarsgård was a perfect choice for Tarzan! His range of being an\narticulate English Lord to a fighting powerhouse of fury was totally\nbelievable. Margot Robbie did well as Jane, but I think a lot of\nactresses could have played that part with equal skill. Christoph Waltz\nis so good at playing the evil villain because I think that is the only\nrole he ever plays. And of course Samuel L. Jackson (who is always\nterrific) as George Washington Williams (who was a real life person\ntrue to the character in the movie). The story was different than the\nnormal Tarzan stories so that was a plus too. I would highly recommend\nwatching it.\n"},
{"review": "\nTarzan was flawless in breathtaking IMAX 3D. The acting was spot on\nthis was one of the best action films I have seen the whole year so\nfar. If you are going to see this movie you will need to see this in\nIMAX 3D. Your family will enjoy this new take on a legend of all time\nbeing. Jane was as gorgeous as ever and she will also be Harleyquin in\nSuicide Squad. This was the best Tarzan since the original actor back\nthen this movie was flawless I loved ever second of this triumph movie\nthat will be a classic in the IMAX 3D vult the IMAX 3D team should be\nproud of how the results came in the IMAX 3D format. IMAX 3D rocks the\nmovies and it shows in this movie it was great I loved it and I hope u\nlike it as much as j did the best part of this movie was the acting\nyour kids will love the action acting and expect ally the IMAX 3D\n"},
{"review": "\nTarzan is not as bad as some critics/reviewers would make you believe\nin their writings.<br><br>Tarzan (like Jungle Book) is a very good action/adventure movie that\nyou could take the family to see. Today's critics raze it because there\nis no F-bombs floating around, no nudity, no excessive blood and no\ncussing. It is refreshing to see an action movie that holds to the\nideals of the movies of my younger years.<br><br>The good: the scenery is fantastic. The jungle comes alive and it does\nnot overshadow the film or the performances. The CGI animals look\nwonderful and the interactions with Tarzan are very well done. The\naction is filmed nicely and the film has very good action scenes\nwithout having to utilize ridiculous feats of prowess.<br><br>The bad: there is not much that would be considered bad in this film.\nThe beginning is a bit bland, but it sets up the story. The acting is\nnot top notch, but it is sufficient to the film and to the setting. I\nactually thought that the film could have been longer and had more\ncharacterization in it, but that is the only negative that I had seen.<br><br>I have seen so many Tarzan movies and most were complete bombs. I had\nexpected this movie to be as bad as Greystoke, but I was pleasantly\nsurprised. I was very entertained and will be adding this movie to my\ncollection when it comes to Bluray.<br><br>Recommended.\n"},
{"review": "\nWe just saw The Legend of Tarzan in Imax 3d. Both the story and the\nproduction are amazing. The sound is very detailed without being\nobtrusive, especially the gorilla vocals, and the Tarzan yell is\nawesome. The 3d picture is the clearest and most realistic 3d I have\never seen. Having seen all the Tarzan movies going back to the old\nJohnny Weismuller Tarzan movies - I can say that this new version takes\nthe story into a much deeper and darker zone than ever before. I can't\ngo into more detail without dropping a spoiler. Alexander Skarsgard is\na great brooding Tarzan with attitude. Chris Weitz is truly evil.\nMargot Robbie is gorgeous. And the African animals are awesome. Check\nit out.\n"},
{"review": "\nThis was fantastic. I was shocked with some of the scenes because they\nwere so real to life. Although I saw Tarzan as a child in the 50's on\nT.V. with Johnny Wiesmuller and Jock Mahoney, this was so clear and so\nreal it looked like a million megapixels because of the clarity. I did\nnot like the character in the white suit. I wanted to put my fist in\nhis face myself. Saw him before with Brad Pitt in WW-II movie as an SS\ncolonel (\"Inglorious Bastards\" and I hated him there too. Jane was\nbeautiful and next to Tarzan they would make a nice couple in real\nlife. Loved the movie and it was so real and beautiful that I intend to\nbuy the DVD for my collection. Highly Recommended. 10 stars!!!!!!\n"}
]