[
{"review": "\nI usually don't feel compelled writing a review, but when reading most\nreviews already posted I needed to add the following: People complained\nabout the movie being raunchy and containing too much dirty jokes, what\nelse did you expect.. it literally has the word \"dirty\" in the title.\nIt is not some French romantic love story, nor is it pretending to be.\nIt is a funny road trip story filled with a lot of \"fucks\" and childish\n(hilarious) jokes which if you like these kind of movies will\ndefinitely keep you entertained until the end. And, ultimately it even\nhas a small underlying message to teach you.<br><br>If you are looking for something more serious, then please don't go and\nthen complain after, maybe try checking out something else.\n"},
{"review": "\nIt's a real low for De Niro and Efron and I can not in my wildest\ndreams understand why this movie got green light... I can laugh at\nfunny sexual jokes, but this was at a level of 5 year old's. Complete\nwaste of money and the actor's and my time... unless the actors\nactually found it funny, and in that case I must admit I am a bit\nsurprised and disappointed. Besides the large amount of bad jokes,\nstupid, unfunny characters, an appalling backstory and completely flat\nnon-engaging character developments, the writing is also completely\nworthless. There is nothing really wrong with the actors performances,\nmaybe even better that one would expect considering the material they\nhad to work with. Maybe they all had a good time making the movie and\ngetting a few laughs at work, but the result was no laughing matter, I\nam sorry to say.\n"},
{"review": "\nThis might be a great movie for some audiences, obviously there are\nenough people who like such things, considering that they keep making\nthem and they become box-office hits. This movie relies on the typical\nAmerican exclusive sensation, on its dirtiness and dark humour. I'm a\nperson who is able to take a joke and understands dark humour, but this\nmovie is purely dirty, banal and unfunny. Many of the actors are\noveracting in their characters' dirtiness. It is pretty much a messed\nup commercial sh*t like Ted 2, except that at least there is not a\nliving teddy bear married to a slutty drug addict (thank God). It's\nlame how they mix up the banal sentimental moments with the tasteless\nhumour and the totally disgusting dirty moments which are supposed to\nbe entertaining. It's full of movies like this that have banal plots\nplus random dumb moments filled with massive drug use. Other than that,\nit's well-shot. At least this we could expect to be nice. It's not too\nbad if we take the fact I watched it at home and managed to watch until\nthe end.\n"},
{"review": "\nThe wife and I absolutely loved this movie and can't wait for it to\ncome out on bluray! Sure it has a crude sense of humor in it, but\nnowadays that is pretty common.Sure it is not Deniro's type of movie\nthat he normally does, but I think he did a great job in playing his\npart. All my friends that went to see this absolutely loved the movie\nas well. Funny to me from the beginning to the end. Maybe a lot of the\nolder crowd went to see this and found it too offensive or something?\nNot sure? I mean, it is not a movie that you want to watch with your\nkids, but I highly recommend this one if you are not easily offended\nand have a sense of humor like I do! Come on people! One star? Really?\nThis movie was great!\n"},
{"review": "\nJason Kelly (Zac Efron) is a straight-laced corporate lawyer engaged to\nMeredith Goldstein (Julianne Hough). He attends his grandmother's\nfuneral and gives his foul-mouthed, wild, estranged, Army-veteran\ngrandfather Dick (Robert De Niro) a ride to Boca Raton, Florida. They\nencounter Shadia (Zoey Deutch), gay Bradley, and Lenore (Aubrey Plaza)\nat a road side diner. Lenore needs Dick as a professor to complete her\nsexual trifecta. Jason recognizes Shadia from his photography class.\nDick is on the prowl and Jason is horrified.<br><br>Robert De Niro as Andrew Dice Clay may be a funny idea on the page. It\ndoesn't come off as funny on the screen. It is a simple exercise in\nagainst-type casting but that's not enough to be funny. I try to\nimagine another actor in De Niro's role and it's still not funny. I can\nsee some improvements but De Niro's persona is not the only problem.\nThis type of movies needs heart. This one has none and suffers for it.\nThe movie probably knows the problem since it keeps bringing up\ngrandma. It's the same note over and over again. There is no likability\nin any of the relationships. The inappropriate humor has limited fun\nbut I don't care about any of these characters.\n"},
{"review": "\nThis has got to be the worst De Niro film I have ever watched, so De\nNiro fans beware! I really don't know why great actors can succumb to\nbeing part of such rubbish.<br><br>Well this is supposed to be a comedy so let's get straight to that.\nTotally crass and crude humour all the way through, with plenty of\nmisdirected and overstated use of the 'F' word thrown in.<br><br>I couldn't help feeling insulted whilst watching this film because the\nwriter and director must think we are idiots that will find absolutely\nanything funny.<br><br>It shocks me that this movie has got a rating of 6! Maybe the writer\nand director will have the last laugh after all.<br><br>For those of us that are discerning and look for more substance in what\nthey watch, I would advise you to leave well alone.\n"},
{"review": "\nI never reviewed a movie before, but this movie deserves reviewing ...\nwell, negative one!.<br><br>It is super bad movie, and simply it's not funny at all !!!. It's all\nabout sex and some silly jokes. In addition, this movie was very racial\nin term of genders, races, religions, etc.<br><br>I wanted to stop watching it half-an-hour after it stared, but I said\nlet's continue watching, and finally it was just a time-wasting movie.\nPlease, Don't waste two hours of your life watching this film.<br><br>In fact, I regret that I watched this movie and I would give it 0/10\nrating if possible :(\n"},
{"review": "\nDirty Grandpa isn't just a awful movie, it's a horribly awful movie.\nI'm far from being a feminist but I found this movie denigrating and\nembarrassing to all women. When satire fails to be funny, its just\ncrude and vulgar contempt. It was torturous and embarrassing for me to\nwatch a legendary Hollywood icon conscientiously degrade himself in\nsuch a way. Was it an insatiable desire for money or an insatiable\ndesire to express his outdated 1960s counter-cultural views that\ninspired Robert De Niro to lend his namesake to this awful movie? Its a\nlow-point for everyone involved, especially for movie fans. Dirty\nGrandpa is one of the worst movies I've seen and it will likely end up\nnear the top of my list of all-time worst movies.\n"},
{"review": "\nThis movie isn't actually that bad; it certainly doesn't deserve the\nendless line of 1-star reviews. I went to see it with very, very low\nexpectations, after reading a negative review of it, and ended up\nenjoying quite a bit of it.<br><br>Even from the trailer you can tell this is a silly, childish comedy\nwith plenty of toilet and/or sexual humor. I don't know what people\ncame to expect from it - this certainly doesn't attempt to be anything\nelse besides that. Maybe many people aren't used to seeing De Niro in\nsuch a role, but hey, he's done other silly comedies already. Not all\nthe jokes are that great, but it was good fun nevertheless. <br><br>So, definitely childish, definitely silly, but also definitely funny in\nmy book. I even ended up feeling for De Niro's character - hey, it's\nhis last stand after all. So, if you don't expect much and aren't\neasily offended by jokes that sometimes are a bit too silly / gross\n/etc, you might even enjoy this!\n"},
{"review": "\nCongratulations to all the ones making this movie. It was absolutely a\nblast, and I laughed from start to finish. <br><br>Its a new take on a old road trip/trapped in a relationship plot that\nworks really well with the actors. Funny, raw and a bit childish humor\nthat Robert takes to the next level. The other cast was also pretty\ngood, from the guy who sells beach towels for 50 dollars, sunscreen for\n10 dollars and METH to the controlling soon too be wife. (See the\nmovie, and you will get the line)<br><br>Every critic in the media is going to give this 1s and 2s. And that\nalone is a reason for us \"regular joes\" to realize this is an instant\nhit. <br><br>I hope to see Robert and Zac doing more work in the future. As I said\nbefore. This was the funniest movie in a long time.\n"},
{"review": "\nThis is movie full with cliché jokes and annoying acts. I barely\nmanaged to watch till the end - not really sure for what age group this\nmovies is created. My deepest condolences go to Robert De Niro. Why\nwould such great actor take part in this kind of movie? Is it really\nthat tight in show business these days? Also Zack Efron - actor with\nlooks and talent to dance and sing got to waste his talent in film like\nthis. Recent movies seems that he plays always the same person - hot\nand self-obsessed dumb party guy. We are Your Friends, Neighbors (1 &amp;\n2), Mike and Dave Need Wedding Dates - all the same. Also one of main\ncharacter gets in the crossroads, trip with crazy grandpa makes him\ndoubt his life choices - work, marriage, which is soon to come. Of\ncourse he realizes that he need take on old talent as photographer and\nmeets girl he falls in love with. At weddings he takes decision to not\nmarry his fiancé, who of course turns out to be crazy cheating lady.\nNothing new, nothing surprising.\n"},
{"review": "\nI am not a big fan of DeNiro, but still the fame of the overall casting\ntogether with the 6 IMDb ranking, convinced me that I should check this\nout. Unfortunately this was the worst idea of this year. In order to\nsave my Saturday night I had to ran away of this after huge effort\nstaying for halfway through. I'm 42 and far from being a puritan, but\nsuch movies are American cinema's decadence. Comedy is the most\ndifficult genre. It is easy to write and make a drama, but what is\ndifficult is to make a real comedy with real humor. Only English and a\nbit the French are still able to do this. American comedy has become a\ncompilation of disgusting things including drugs and sexual fluids\ninnuendos and raw images that could make you throw up. I'm sorry but\nseeing a 73y.o. person masturbating, even if he is the greatest actor\nof all time, or innuendos of pedophilia cannot make me laugh. Even if\nyou can tolerate such jokes still the plot, characters and development\nis as dumb and shallow as it can be. An insult to the audience and to\nthe cinematic art. I wish there could be negative stars to give 10.\n"},
{"review": "\nI was quite keen to watch this movie, thinking De Niro and Efron would\nbe in a good movie. Unfortunately I only found around 30% of the movie\nfunny. The rest was quite forced and some of the scenes like the jail\nscene was just too long and drawn out and you just feel like fast\nforwarding cos it was just so silly. <br><br>One thing that didn't work for me also was how there was a lack of\nchemistry overall for all the characters. Efron didn't manage to come\nacross as someone you'd empathize with. De Niro was an oddball. The\nrelationship Efron cultivated didn't stand out either. <br><br>My boyfriend laughed at a few scenes but after this movie he said \"I\nthink I lost some brain cells\". Most of it was slapstick comedy I\nthink. One of those movies you'd watch once and probably never again.\n"},
{"review": "\nI wanted to see this film for it's premise - a Grandfather attempting\nto rekindle his relationship with his grandson. Something that seemed\nfairly distinct from most other films coming out recently. This film,\nhowever, delivered nothing that hasn't been attempted a hundred times\nbefore - ambitious adult jokes, continual usage of toilet humour that\nwasn't even funny to begin with, and a script that not only degrades\nthe actors, but made me uncomfortable with how abrupt and forced the\nhumour was. Aubrey Plaza, an actor whom I admire greatly from Parks and\nRecreation, I am sad to say has stooped low enough from her unique\ncharacter April Ludgate, to portray a character who talks more about\nhuman sex organs than she does anything else, to a nauseating extent.\nRobert De Niro, whom I admire from all of the films he is known for,\nhas likewise adapted a character that presents the viewer with such\nforced humour that it begs the question of how the film was given the\ngreen light in the first place. I would not recommend this film to\nanyone who enjoyed any of its actors' work in the past. Very\ndisappointing.\n"},
{"review": "\nI was waiting for watching Robert De Niro and Zac Efron in this movie.\nDirty Grandpa, I thought with such a good actors it was impossible to\nhave a bad film come out. Until I saw the Worst movie of the year, the\njokes are so foreseeable and stupid,and the acting is not even that\ngood. You do not stand up and leave the theater for mercy. There is a\nboring, boring, boring movie. So sad I have to watch such good actors\nin such a horrible film. Zac Efron it's probably in one of the worst\nmovies of his biography, and Robert De Niro is ridiculous, not even\nfunny. Absolute a waste of time. There is not one of the members of the\ncast you will remember their performance after you just see the movie.\nYou will only remember, how bad in their interpretation were Robert De\nNiro and Zack Efron.\n"},
{"review": "\nDirty Grandpa (Dick Kelly) played by Robert De Niro is the 'also story'\nin this limp wet attempt at comedy. The plot is more about Jason Kelly,\nplayed by Zac Efron, tuning into his wild side while being well\nentrenched into the American lawyer corporate image lifestyle. So\ngrandpa is mostly in the background being 'old age naughty' while Mr.\nEfron gets to run around 'butt nekkid' strung out on booze and drugs.\n(Do you think this little 'used tissue' of a flick was made just to\nshow off Zac's fabo body?) YES!<br><br>The movie is unfunny start to finish. I've had better laughs visiting\npatients in the Alzheimer's wing in nursing homes!<br><br>We've seen this set-up so many times - college kids on break being\ndrunk and partying 24-7! Dirty Grandpa wants to spread is old stale\noats with young chicks now that he's a 'widower'. And the grandson or\nson acting the uptight straight forward role trying to keep the\nsalacious &amp; swaggering old man from misbehaving. The attempt here is\ncompletely lost in the sophomoric attempt at potty-mouth humor.<br><br>Forget this flick!\n"},
{"review": "\nWhere do I start this movie is just careless, it's just watching an old\nman trying to have sex with a younger lady and making a bunch of gay\njokes and just ridiculous jokes in general. At first just watching I\nknew it was bad because of the repetitive jokes, the crude humor and\nnaive Zac Efron but I gave it a chance and in the middle of movie it\ngot worse, it just became a bunch of nonsense, it was annoying and\nstupid. Pass the one hour mark I just hated everything about this\nmovie. Even a dick couldn't save this movie, there's a scene where Zac\nEfron had to sleep with a naked Robert De Niro. I can believe the\nmakers thought this was gonna be funny it isn't funny at all, why did\nDe Niro even make this film. It's just plain out unbearable to watch\nwith cringe worthy scenes and a plot that gets dumber as it goes on.\nThe worst thing about this movie is that it tried so hard to be funny.\nOverall this movies terrible I don't recommend it to anyone and I\nreally think I'm just being generous giving it a two but I deserves all\nthe bad reviews it's getting.\n"},
{"review": "\nA friend of mine wanted to watch this film and stupidly I went along\nwith the suggestion. I know De Niro likes to do comedy but\nunfortunately this isn't one unless you find the word \"Vagina\" repeated\nendlessly the height of comedy.<br><br>Basically there is very little plot with a lot of unbelievable and\nfrankly unlike-able characters. It does not know whether it wants to be\na comedy or have some deeper meaning but tries to chuck everything at\nthe wall in the hope something may stick. You have to ask how somebody\nlike De-Niro can read a script like this and still agree to do the\nmovie. The smell of poop must have been coming of the pages from day\none.<br><br>Don't waste one hour forty two minutes of your life watching this film.\nDo something more pleasurable instead like baking your head in an oven.\n"},
{"review": "\nThis is yet another miserable movie that would like to be a comedy, but\nthis comedy was missing the most important thing - the intellect. All\njokes in recent American so-called comedies are based on nudity, sex,\nvulgarity, perversions and drugs (Hangover, Ted etc.). But, while there\nare intelligent and provocative comedies (I can not remember any\nAmerican in the last 10 years), this is not one of them. I'm sorry to\nsee big star like De Niro smearing his good name in the garbage like\nthis. The film \"Dirty Grandpa\" is simply - moronic. Even that is an\ninsult for jerks because this can watch only critics who must and/or\ntotally deranged people. The last: the scene in which a child bites\nstuffed animal on Zac Efron's penis is so moronic, disturbed and\nillegal that deserves immediate ban and jail for the director, producer\nand screenwriter. And one question: Why parents allowed them to do it\nwith their child? Sale kid for money? Yuck. Generally - and without\nthat dumb scene this movie is totally moronic disaster. Unfunny.\n"},
{"review": "\nThis is the first time I walked out of the theater within 15 minutes\nafter the movie started. We went to see it because of Robert De Niro\nbecause I really liked him in The Intern. In that movie he was a decent\ngentleman with nice taste and style. However this time he let me down\nbig time! He totally ruined his good image by taking part in this\nhorrible movie. The language was so rude in this movie. You hear the F\nword and the S word literally Every two seconds. Is that even\nnecessary?! I understand people curse when they're really mad, but I\nreally hate it When they talk like that Every freaking minute in Every\nfreaking sentence. If the movie makers think that's funny or cool, I'm\ngonna tell them they're wrong! That's the reason why there was nobody\nin the theater for this movie when we walked in, because people simply\njust don't like this! I wanted to see what happened next, but I just\ncouldn't stand the language. If I had a pair of ear plugs I might\nconsider staying more.\n"},
{"review": "\nNot much worse to a film fan than shelling out $12 dollars to go see a\ndecent actor waste his skills on low information trash like this. I\nknow that the same class of stoners who think Adam Sandler's latest\nouting in The Ridiculous 6 is funny will also find this disgusting\nwaste of screen time funny. I for one do not and as I write this I long\nfor IMDb to do the right thing and enable a zero rating for movies as\nthat is the true first number and this is another in a long series of\nHollywood efforts that deserves that true first number the zero. To say\nthat Robert De Niro has sunk to this low in cinema just to increase his\nbank account by what ever amount they paid him is a shame, as he\ncertainly could not have taken on this schlock in order to increase his\nrange of acting expression. He could have simply hit his thumb with a\nhammer and the resulting dialog would not have been any worse, perhaps\nit would have been better. As he did not do so we will never know.\n"},
{"review": "\nWhat has De Niro done? What has happened to the guy to just embarrass\nhimself like that on screen? Remember Goodfellas and The Godfather, to\nname but a few that he had a cool screen presence in. I think he's just\nmaking crap movies now just for the money. Remember when he made great\nmovies over the nineties. Its fair to say De Niro has lost it all now\nafter this dreadful film.I used to think Robert De Niro was a true icon\nof cinema but he really has let his guard down here. Does he really\nwant to be remembered for this movie or other terrible films like Meet\nThe Fockers where he makes a complete idiot of himself and none of it\nwas funny to me just completely embarrassing for the actor to is known\nto be one of the greats but I'm not so sure I can call him one of my\nfavourite actors now after seeing him in a few flicks over the past 10\nyears which have been pretty bad.\n"},
{"review": "\nIt's not unlike De Niro, no matter how great of an actor he is, to be\npart of such movies. I recently saw \"The Intern\" in which he was\namazing although a somewhat \"soft\" and \"cheesy\" movie. I actually\nenjoyed this a lot. On the other hand, doing movies like this one is\nreally beneath him, from my point of view. <br><br>The movie was dirty and really provocative for the most part. It was.\nAnd it's OK sometimes. I am not the one to fluster with the jokes made\nin the movie or the lines heard. I actually liked many of them. But\nhaving said that, it seemed that the movie was tasteless at times, far\nfrom reality and just too sloppy. <br><br>I mean, even if you accept that having such a grandpa is possible,\nthere are so many things around that don't fit, that it's really\nannoying at times. I don't want to spoil it for the rest, so I won't go\ninto any details on that. <br><br>My feeling is that the concept and idea of the movie was really good,\nbut the execution sucked. Having De Niro and getting him to act as he\ndid, providing little if any depth to the role, is just stupid. Did not\nappreciate the ending as well, as it was too far fetched. <br><br>A confused movie that will get some laughs out of you. It offers\nnothing more than the presence of De Niro and the chance to see Efron\nnaked, or almost naked, which seems to be the only talent this guy has,\nafter all. Waste of time.\n"},
{"review": "\nGood Things:<br><br>1) Robert Deniro is a great actor 2) It had some funny parts 3) Was\ncrazy enough to keep my attention (whether I liked it or not)<br><br>Bad Things:<br><br>1) Terrible humor (Disgusting humor) 2) Offensive 3) Not one of\nDeniro's better movies 4) Very sexual and not in a normal way 5)\nCouldn't watch this with a 17 year old<br><br>So of course I watched the entire movie, even though I was offended not\n10 minutes into the movie. The humor is not intelligent humor - yes\nthere have been times when I liked this sort of humor - but I am\ngetting older and I felt so uncomfortable watching this with my\ngrandparents - and not because of them not liking it - they laughed and\nliked it - I couldn't completely hate it - but the humor was a bit much\nfor me - There are some moments where Deniro and Efron made me smirk -\nbut the script was written as though some senior in high school who did\na lot of drugs wrote it - I wouldn't waste my money on it - but if\nsomeone else has it - hey, honk that horn - I really didn't like it.\n"},
{"review": "\nDirty Grandpa (2016) is a raunchy comedy film that tries too hard. I\nwent into this movie expecting it to be utter garbage. While it wasn't\ncompletely horrible, the film was very frustrating. The best part of\nthe movie was definitely Robert De Niro. Zac Efron was remarkably\nunfunny and I found him to be extremely annoying. Aubrey Plaza was also\nvery disappointing and she didn't bring much to the film. But for me\npersonally, I found the character played by Jason Mantzoukas to be the\nmost irritating person throughout the movie. His character was\nstale,repetitive, and every line of dialogue he said fell flat. The\nplot was nothing special, and it was fairly standard. The same story\nstructure has been done before, and this film did nothing to improve\nupon it. The biggest detriment to this film is that it goes out of the\nway to make dirty jokes. I have no problem with dirty jokes, it's just\nthat film is making these dirty jokes just to be raunchy. The jokes\nhave no real set up, and they are essentially vulgar for the sake of\nbeing vulgar. Many of the jokes will be forgotten within a few\nhours.'Dirty Grandpa' isn't the worst comedy of the year, it is just\nvery underwhelming.\n"},
{"review": "\nPeople really need to grow!! seriously!! I have no idea what's all the\nhate about. Some say it wasn't up to what they expected some say it's\ndownright ridiculous, I mean really???? This movie is comedy, period!\nGet that in your thick skulls, not drama, not history, not a love story\nbut a very cute story about a boy who hardly met his grand dad but then\ngets to spend the time of his life with him. in fact, he actually\nbecomes a man after the lessons taught by his grandpa through a series\nof events. It's downright humour at it's best. I laughed my butt out\nfor crying out loud!<br><br>Stop throwing in ridiculous comments that make no sense and just watch\nthe movie for the way it is. Hilarious, cute, heart warming and just\nmemorable. I will be buying a DVD to save a copy! 10/10 without a\nshadow of doubt!\n"},
{"review": "\nWhen I heard Dirty Grandpa I thought something similar to Bad Grandpa.\nI was not prepared for what I was about to witness. Robert De Niro's\ncharacter was the complete opposite from the work we've seen from him\nbefore. He changes from the over protected parent in \"Meet the Parents\"\nto the wild old man without a filter. To younger viewers this movie\nmight be exactly what they are looking for to get a good laugh.But to\nthe more conservative viewers this movie might be too obscene due to\nthe curse words and lewd remarks De Niro makes throughout the movie .On\nthe other hand I found this movie entertaining,I like that De Niro took\na step away from his normal roles and played something more risky. It\nwas a shock but I enjoyed his performance.He perfectly depicted a dirty\ngrandpa.\n"},
{"review": "\nThis movie is absolutely hilarious! I didn't know much about it going\nin, but was so pleasantly surprised. Every actor/comedian in the film\nknocks it out of the park &amp; the script is great. Sure, it's low-brow\ncomedy, but it's very creative &amp; compelling. Lots of next level shiznit\nin this one. I'm telling you the truth- I really didn't want it to end.\nOf course I know DeNiro, &amp; love his work, but I didn't know how adept\nZac Efron &amp; Aubrey Plaza were at nuanced comedy. Aubrey Plaza's\ncharacter; a sexy, nutty, amorous type, had me laughing out loud. Her\njocular delivery was so deadpan - I honestly think she wanted to have\nsex with Robery DeNiro haha. Also, you gotta give Zac Efron props; the\ndude is fearless &amp; will do whatever it takes to make the audience\nlaugh. The other girl, I think the actress's name is Zoey, was\nhilarious &amp; nuanced as well. Not only is she gorgeous, she holds her\nown with these three established movie stars. If they made a sequel,\nI'd be one of the first ones in line. Cheers, mates\n"},
{"review": "\nA grandfather that calls a spade a spade teaches his prude grandson to\nlive a little. Its a predictable and cliché plot so forget the big\npicture. The individual scenes however had me in stitches. This is one\nof the funniest movies I've seen in a long time. I thought about giving\nit 10 as is. It's so funny they could have made it with no-name actors.\nInstead, they landed the big guns that delivered a great chemistry. I'd\nlove to see the outtakes for this movie. They must have been laughing\nfor months. Is there anything Di Niro can't do? Wickedly inappropriate,\nimmature humor done right. Aubrey Plaza nearly steals the show with her\nwild raunchy performance. Zac Efron totally committed to using all his\nassets to make the scenes work (words, face, body). I'm going to watch\nout for his movies from now on. Zoey Deutch was the gorgeous damsel.\nAlthough she did this to perfection, she wasn't given as many of the\noutrageously inappropriate lines that the others were (to be expected).\nIn Di Niro I've discovered the paradigm of the grandfather I want to be\nwhen I grow up. My children and their children can relax when I'm gone.\n"},
{"review": "\nEverything I wrote was just my personal opinion, definitely not\nintended to offend anybody. This should have been one of the best\ncomedies of the year, but now it belongs to one of the worst. I\nrecommend 'Grandma' instead this which I felt a much better comedy.<br><br>At this age, Robert De Niro was unbelievably awesome, though his\ncharacter needed a good support from another and that's where as usual\nZac failed to deliver his part. I would have preferred someone like\nTaylor Lautner who's desperate for a breakthrough than the Zac who\nruins always.<br><br>The screenplay was from the 'blacklist', knowing this they should have\nbeen more careful while casting for it. The story was okay, because it\nwas not meant for one of the greatest films of all time. It was sort of\na weekend getaway or the bachelor party theme, but the film gives its\noriginal reason and then those developed plots were too familiar if you\nhave seen plenty of teen films, in the party theme.<br><br>It's supposed to make us laugh, but there are lots of outdated humours\ntried in the unusual route to narrate them. The grandfather-grandson\ncombo was an excellent idea, the main plot revolves around them and it\nshould have remained that way, but the undetermined romance was an\ninterruption. Or they should have developed a decent romance track for\na better balance in the genre.<br><br>At least it would have been all right if it was a teen film. Many of\nthose who appeared in it were actually too old to represent the roles\ngiven to them. That's fine too, because films are fake, everything is\nmake-up and performance, but none were at their best except De Niro and\nAubrey Plaza. It is definitely a film to skip, that's my opinion, but\nthey're a few who are defending it, so be careful that I'm not always\nright and they're not always wrong if you want to choose it.<br><br>3/10\n"},
{"review": "\nAwful, awful comedy, but I love some of the actors in it so I had a\nmorbid curiosity. Honestly, the script just plain sucks. I have no clue\nwhy Robert De Niro (whom I didn't watch it for, by the way - his\njudgement has been so bad for the past 20+ years you can just assume\nhis movies are going to suck) would sign onto this. You have to admire\nhis commitment, but the whole old-person-has-potty-mouth act was old\ndecades ago. Plus, it's not just that he's dirty, he's mostly\nunlikable. The biggest problem with the film is that it's saddled with\nthe hoary \"dude is marrying a bitch\" trope, which is always lame and\nfairly sexist. Funny thing is, the other girl Zac Efron falls for in\nthe film, Zoey Deutch (the cutey from Everybody Wants Some!!), is every\nbit as boring as the girl he's engaged to (Julianna Hough). Efron\nhimself isn't too bad as the straight man, but he works better in\ngoofier roles. I saw this mainly for Aubrey Plaza. She's hot as Hell in\nthis movie, and has some funny line readings, but I'm just too squicked\nout by her lust for Robert De Niro. I almost threw up in my mouth a\ncouple of times. So yeah, almost everything here sucks, but there are\ntwo big exceptions: Jason Mantzoukas and Adam Pally. Mantzoukas plays a\nnutty drug dealer named Pam (\"it's a nickname. It's short for Pamela\")\nand he brings a lot of life to the picture whenever he pops up. Pally\n(Happy Endings, The Mindy Project) doesn't get as much to do, but he\ngets a laugh even with the smallest line, and he has the movie's best\ngag as he has to act as a messenger between Efron and Hough at their\nwedding. I'd almost say it's worth watching just for Mantzoukas and\nPally if you're a fan of either of them. The rest of it is bad, but\nI've seen far worse.\n"},
{"review": "\nSeriously, I've seen gore movies that where less shocking that this\none. I am not the type of person that gets offended by a lot of things\nbut this movie made me cringe.<br><br>Creeping racism, homophobic jokes, hard drug usage (crack), promotion\nof unprotected sexual activities involving old senior guy with\nteenagers, making like if cheating in a long term relationship was okay\nand even more crap values like these are omnipresent in this sh**ty\nmovie­.<br><br>Saw this movie last evening with my girlfriend and we just couldn't\nstill believe this morning what we saw in this movie. What is even more\nimpressive is that Mr. De Niro accepted to play in that movie that was\nbeyond all movies I've seen, the crappiest of them all.<br><br>Do NOT watch this movie with your kids. Actually, do not watch this\nmovie at all, it is not even worth a 1 out of 10... Give me my precious\ntime back please.\n"},
{"review": "\nIn more recent years, I've never seen a more repugnant, nasty film. I\nneeded several shots of alcohol to get through this and I still\ncouldn't make it though to the end. <br><br>It's line after line of rape jokes, child molestation jokes, homophobic\njokes and misogynistic abuse. Why on earth do people think that stuff\nis funny? <br><br>It's so disheartening to watch Robert DeNiro deliver one disgusting\nline after another to Zac Efron. He plays a recently widowed lustful\nsenior citizen on the lookout for sex accompanied by his conservative\ngrandson. <br><br>All the while, I wondering: What was he thinking?<br><br>None of the stuff that happens make any sense! The language and the way\npeople speak to each other on screen is so over the top and\nunrealistic. If anyone said any of those lines to me on the street, I\nwould punch their lights out. <br><br>Simply put, it's absolutely un-watchable. It's so dumb and horribly\nstupid, you can't even call it entertaining.\n"},
{"review": "\nI was sorely disappointed to see De Niro take such a cheesy, deplorable\nrole. I can't believe movies like this are still being made- absolutely\ndegrading to women. Movies like this perpetuate violence towards women.\nCollege girls are not objects to f*ck. The use of profanity seemed\nunnecessary to the plot. There are some bad potty-humor movies out\nthere but this one takes the cake. If De Niro hadn't taken this role, I\ndoubt anyone would pay attention enough to watch this movie. Every\nsingle character in this movie is shallow and poorly developed. I\nlaughed once while watching this entire movie and I found myself not\ncaring what happened to any of the characters. Save your time and watch\nsomething else.\n"},
{"review": "\nRobert De Niro's comedies are usually okay from funny to moderately\nentertaining. I've always found him more versatile than Al Pacino in\nthat he can do comedy well. But this movie is just terrible. I know\nmost of the comedies aimed at young audiences have crude sex humor or\nthey won't succeed. I also realize actors often have to take what roles\nthey get even established ones or they won't be on screen. But\nsomewhere along the line someone must have realized this was bad. Even\nZac Efron looked uncomfortable in this exploitative nonsense.<br><br>The premise about a grandpa dragging his proper uptight grandson for\nspring break has potential. With all the generation gap jokes they\ncould have made this one funny. But this movie has hardly any funny\nparts. It's just crude and painful.<br><br>The saddest thing is this was a box office smash. Reflects badly on\npopular taste in comedy.\n"},
{"review": "\nIt shocks me that this movie has got a rating of 6! Maybe the writer\nand director will have the last laugh after all.<br><br>The plot is simple: A man by the name of Jason Kelly is about to get\nmarried, and unfortunately for him his Grandfather, Dick Kelly has\nasked him to give him a lift to Florida. Jason thought his Grandfather\nwas doing it for business, but little did he know he's doing this for a\nSpring Break. He has not had sex win fifteen years and he wants to\n\"F*ck* F*ck *F*ck F*ck!\" The whole script was just laughable, and not\nin a good way. The writing was horrible the acting was horrible\n(especially from Zac Efron.) Whenever Efron was acting it felt like I\nwas watching High School Musical again. Except this was twice as bad.\nDeniro was about the only thing that made this movie watchable, and\neven he could not save this horrible movie! The characters are all\nunlikable, they either just nonstop cuss or just get high. There's no\ncharacter development what so ever. There's no reason for us to care\nabout anybody in the film.<br><br>I don't recommend anyone to watch this film, unless you really love\nwatching people cuss, watching people get high and watching Zac Efron\ntake his shirt off to reveal his \"steriod\" body while Deniro lifts him\nup in the air! Horrible.\n"},
{"review": "\nComedies used to be funny, but all the witers must have lost their\nsense of humour lately. Crude sexual jokes are the only things featured\nin comedy movies these days. Feels like all the comedies are written by\nsome one who does not ever come out from his distorted world in the\nvillage new york city. I do not understand how the sexual joke on the\nbeach with a child is funny for a normal person unless you are a\npervert could not tell right from wrong, appropriate from\nunappropriate. Child molectation is very real and sickening in this\ncountry. It is not funny to joke about it like that. How it is funny to\nuse \"lesbian daughter\" in place of the politically incorrect term\n\"gay\"? It is a total time wasting garbage with heckened plot and awful\njokes\". Movies can be raunchy and funny, but this movie is poitlessly\nraunchy and not funny at all\n"},
{"review": "\nWhat you call a low budget, boring, lousy, pointless and senseless\nmovie. I really didn't laugh in a single moment of the movie. I felt\nfrom beginning that, I am wasting my time in this, but still I tried\nwatching this crap and felt really exhausted the whole time, thinking\nwhen this going to end. I am not a negative reviewer, but after\nwatching this I felt writing what I felt after watching this crap. This\nis the worst movie of Robert Dinero. I will not give a single star but\nthe option is there so I give 1 star. Will not watch this kind of\nmovies again. I hardly see comedy movies but this was worst of all.\nOther movies made by good directors are still good but this was worst\nof all movies.\n"},
{"review": "\nI never spend any time in writing reviews. But this pile of s#1t??? De\nNiro has lost a fan! I felt as my 2.5 brain cells that I have left,\nwanting to escape my brain as I was punishing the by watching this pile\nof s#!t. Couldn't watch more than 10 minutes. It is a retarded piece of\ns#!t!!! I never spend any time in writing reviews. But this pile of\ns#!t??? De Niro has lost a fan! I felt as my 2.5 brain cells that I\nhave left, wanting to escape my brain as I was punishing the by\nwatching this pile of s#!t. Couldn't watch more than 10 minutes. It is\na retarded piece of s#!t!!! I never spend any time in writing reviews.\nBut this pile of s#!t??? De Niro has lost a fan! I felt as my 2.5 brain\ncells that I have left, wanting to escape my brain as I was punishing\nthe by watching this pile of s#!t. Couldn't watch more than 10 minutes.\nIt is a retarded piece of s#!t!!!\n"},
{"review": "\nI do not blame De Niro at all. A good actor simply plays everything.\nLike Nicholas Cage. Sometimes that can work, sometimes not. In this\nmovie De Niro got the chance to give a surprise wonder by changing a\nvery bad plot and a very bad directing into a good movie. De Niro could\nhave tried to make the impossible true and lead this really\nconservative plot (hundred times seen student trash movie) with his\nacting over the edge. But it seems to me, he did not even try to give\nhis best. He just played the main character without adding anything\nmeaningful. And so, the viewer has nothing on the screen except boring\ndialogs, boring jokes, boring story, boring camera, boring everything.\n"},
{"review": "\nExtremely offensive. This wasn't entertainment, this was torture. I\nhope De Niro gives public apologies for acting in this movie.<br><br>I would give 0 if I could, hell I would ask for my money back if it was\nworth the effort. This is basically a light-porn movie, can't believe I\nwatched this with my family. It's disgusting in every way.<br><br>Extremely offensive. This wasn't entertainment, this was torture.\nExtremely offensive. This wasn't entertainment, this was torture.\nExtremely offensive. This wasn't entertainment, this was torture.<br><br>The guys who made this should be sorry. The guys who made this should\nbe sorry. The guys who made this should be sorry. The guys who made\nthis should be sorry.\n"},
{"review": "\n1. I wonder if they broke Big Lebowski's record for using the F word?\n2. I only watched because I'm a fan of Aubrey Plaza. 3. I'm very glad I\ndidn't pay to see this movie. 4. I don't need 10 lines of text to\nreview this movie. 5. There were only a couple of funny lines. 6. I\nreally wonder why DeNiro would even do a movie like this. 7. There's\nabsolutely no reason to watch this movie. 8. I kept waiting for\nsomething to be funny but it never happened. 9. I always wondered why\nthe reviewers went on and on. 10. To IMDb more is not always better.\n11. This will be my last review, as I never have this much to say about\nany movie.\n"},
{"review": "\nThis movie without a doubt has really funny moments but the ending is\nso predictable. The main characters story line is like every other\ncomedy or romantic comedy ending. Guy is about to get married to a\ngirl, the girl is uptight and controlling. He goes on some adventure\nand meets some \"hot free spirited strong independent women\". They are\njust friends but the are so in sync with each other. Guy starts to have\nfeelings for her, feels guilty and is about to tell her that he is\nabout to get married. She finds out some way gets angry tells him \"I\nnever want to see you again\" right before she is going to go on some\nlong term gig far away. Guy goes back to his life but is unhappy. At\nthe last second he tells the girl that he doesn't love her and leaves.\nThen goes on some hurry up and wait mission to try and get her back.\nRight as she is leaving to go one her far far away long term (fill in\nthe blank).Some messed up accident happens they talk all is good and\nthen he leaves everything behind to be with her and they live happily\never after the end. Oh and Miss Perfect has a crazy sex crazed best\nfriend that goes for his friend. This is the exact same story line in\nalmost every movie now and this movie was no different. So very\ndisappointing movies need to start coming up with a different story\nline cause this one is in EVERY movie. It would be nice to watch a\nmovie and not know what's going to happen about 20 min in.\n"},
{"review": "\nI don't write many reviews but after being subjected to what I can only\ndescribe as sheer torture I felt I had to. Honestly I would rather be\ndropped into the set of Saw 3, or go head to head with Leatherface than\ngo through this hell again! This movie was the most unfunny, poorly\nwritten, tacky piece of junk I've ever wasted 75 minutes on, I say 75\nminutes because I couldn't watch another minute of it, let alone make\nit to the end. I'm a huge De Niro fan, he's one of the most talented\nactors of the last 50 years, but seriously, why did he take this movie?\nDo yourself a big favour and give this one a wide berth, unless you're\n16 years old and like your humour full of the worst sexual innuendos\nyou're ever likely to hear.<br><br>A very generous 1 out of 10!\n"},
{"review": "\nSimilarly and much more earlier was Johnny Knoxville and friends' Bad\nGrandpa which featured the same toilet humor, yet with creative\npracticality. Having watched the aforementioned piece, I was rather\nbored seeing another movie portraying a recently-widowed grandfather\npursuing fulfillment of his newly revived sexuality on a haphazard road\ntrip with his ill-fated grandson. Furthermore, Dirty Grandpa was only\nable to beckon the first audible chuckle from this viewer after 52\nminutes of routine cinematic shenanigans with the second one occurring\nat 1:21. <br><br>Also, Zac Efron continues to solidify his on-screen legacy as a\nfoul-mouthed Ken doll college carouser who inevitably winds up\nshirtless, at best, for the camera. Additionally, this was a blow to\nRobert De Niro. Sure, he's a living legend, but that credibility does\nnot merit him with invincibility to criticism. <br><br>This selection was not a complete bust, however. Props to the producers\nfor featuring music from Handsome Boy Modeling School. But\nunfortunately good music does little to redeem the quality of\nhorrendous cinematics.\n"},
{"review": "\nI expected more from Robert De Niro, I already knew that this movie is\n100% trash but still maybe something could be good about the movie, but\nI was wrong. De Niro has really gone to a really low level with this\nmovie, from Godfather to dirty grandpa. This review might be a bit\npersonal but I'm gonna try to make it to a non- personal review. It\ncontains very crude language and I can handle crude language like 21\njump street or Casino or pulp fiction, but this one is a little bit too\nmuch. The sex is also a bit too much, i mean who comes up with this\ntrash ideas where the main problem is about sex and partys and a\ngrandpa who needs to have sex. I mean i like the Goodfellas and now you\nprobably think that I'm a action guy, not a sex guy but NO. Goodfellas\nfocus on their lives, not their violent problems, but this movie focus\non the main problem the whole time and it's really annoying. The movie\ngoes like this, grandpas (robert de niro) wife said to him on her\ndeathbed that he should go live his life and he does. So he search for\nsomeone to have intercourse with and in the end he did have it and he\ngot a baby, that was suppose to be fun ending but NO. This movie is\nterrible in every way. I don't recommend it to anyone.\n"},
{"review": "\nRecently widowed and set on living life to its fullest, a\nseptuagenarian tricks his grandson into driving him across the country\nin this lowbrow comedy starring Robert De Niro and Zac Efron. The plot\nis strikingly similar to 'The Intern' with its elderly protagonist\nwishing to find purpose after his wife's death, however, whereas some\ncommented that 'The Intern' was \"too sweet\", 'Dirty Grandpa' is the\npolar opposite. The gags are mostly vulgar, with more than a couple\ncoming off as existing simply for shock value (who would ever think\nthat we would watch De Niro pleasure himself one day?). Some of the\ncrude parts are admittedly very funny though, such as an angry parent\non the beach. The chemistry between De Niro and Efron comes off as very\nreal too, give or take their tendency to converse in expletives. In any\ncase, biggest drawback here is the predictability of the story rather\nthan its humour. Efron (of course) reevaluates his decision to marry so\nyoung while on the road trip and (of course) he meets an attractive\nalternative girlfriend who he (of course) loses and has to win back. It\nis a pretty generic storyline done countless times before. The presence\nof De Niro renders the film somewhat more unique though and to his\ncredit, he truly embraces the role and runs with it. And with De Niro\nradiating such energy, it is a shame that the script rarely rises above\ngross-out humour level.\n"},
{"review": "\nI was expecting this to be a bit better to be honest. However, I was\nable to get through the movie and found some of the material to be\nfunny and somewhat entertaining. Robert Deniro does well in a comedy\nand he is great here, the rest of the cast, not so much. Dirty Grandpa\nis a barrage of dirty, sexual humor. Some of it is funny, a lot of it\nisn't. This is a case of quantity over quality, less jokes and better\ncharacter development would have made this much better. It also would\nhave played better if it had a darker take on the material. Overall, I\nagree with people that Dirty Grandpa is pretty dumb and will most\nappeal to the lowest common denominator. But, hey it is a comedy and\nfor modern comedy it is pretty average. However, you could do a lot\nworst for an evenings entertainment, but I doubt I will watch this\nagain and if I want to watch something like this, I think I will watch\nBack To School instead.\n"},
{"review": "\nYou know the movie \"Bad Grandpa\"? Well it's kind of like that to a\nslight degree except with a actual narrative. And it's not a crude and\nobnoxious. As a matter of fact the Bad Grandpa had just the right line\nof crossing the line and just living the life and having fun. This\nmovie is basically a wake up call for youngsters and a existential\nmovie for the older people. As a matter of fact the Robert De Niro\nplayed a fairly cool Bad Grandpa. From the trailer I thought this would\nbe a crude movie with a old guy trying to party with the youngsters in\nDaytona beach. But there was somewhat of a heart in it that worked for\nthe movie as a whole. I guess I am now sort of numb to movies like this\nbecause it just all comes off as overly formulaic and predictable. I\nstill give this movie a 6 out of 10.<br><br>6/10\n"},
{"review": "\nRound-Up: It's really has been some time since De Niro, 72, has made a\ndecent movie but he still is a highly rated actor, due to the success\nand amazing performances of his previous movies. He can afford to make\nsome mediocre movies, because he has proved that he is truly a bankable\nstar but it hurts to see him make a fool out of himself on the big\nscreen. The masturbating scene near the beginning of the movie, along\nwith the uncomfortable sex scene towards the end, just didn't look\nright and I'm getting a bit fed up with seeing Efron parading his body\nin his movies. Anyway, this film was directed by Dan Maze, 44, who also\nbrought you I Give It A Year and 6 episodes of Ali G in da USA!!!. He\ncertainly pushed De Niro to the limit in this film but I don't think\nthat he brought out the best of the leading stars. I can't see them\nbringing out a sequel but at least it made a hefty profit for this\ndirectors first major project.<br><br>Budget: $11million Worldwide Gross: $100million<br><br>I recommend this movie to people who are into their comedies starring\nRobert De Niro, Zac Efron, Zoey Deutch, Aubrey Plaza, Jason Mantzoukas,\nDermot Mulroney, Julianne Hough and Danny Glover. 4/10\n"},
{"review": "\nDirty Grandpa is a comedy film directed by Dan Mazer and written by\nJohn Philips. The film stars Robert De Niro, Zac Efron, Zoey Deutch and\nAubrey Plaza. After Jason's grandmother dies and just before his\nmarriage, his grandfather asks him to go on a road trip to Daytona\nBeach, Fla., and there's where Jason learns a couple of lessons from\nhis \"dirty grandpa\". I found this movie really funny most of the time\nand I couldn't stop laughing at a lot of the jokes. I suppose that a\nlot of these negative reviews for this movie are from people who think\nthat this movie is against their \"morals\". But it doesn't really\nmatter, cause Dirty Grandpa has been a box office success and a lot of\npeople liked it, including me. Zac Efron is really funny, he has shown\nthat he's got comedic guts over and over again. I am becoming a fan of\nas I keep on seeing him in these kind of movies . Robert De Niro is\nalso awesome on the role all throughout. I also really liked the\nsupporting characters, especially Jason Mantzoukas as a drug dealer who\nhad me laughing every time he was on screen. Sure this movie isn't\nnowhere near a comedic masterpiece and nor is it trying to be. It is a\nfun ride from beginning to end, and despite all the clichés, the jokes\nare what make this ride worth it.\n"},
{"review": "\nI thought this will be a bad movie... De Niro is awesome as always,he\nlifted the move like he always does. yeah maybe the scenario is a\ncliché but is worth watching. I don't thing I ever saw Robert De Niro\nin a comedy film, especially a comedy like this one.I am pleased with\nwhat I saw and recommend this movie if you want to laugh(not to death)\nbut you'll get some laugh now and there for sure. Also the film has\nsome life lessons which is very good beside the comedy and fun. I think\nthis is one of the best movies of Zec Efron.Beside De Niro is\ncompletely different.Conclusion:A good movie,worth your time believe me\nit will.\n"},
{"review": "\nIf you haven't seen this movie then do yourself a favour and ignore the\nreviewers on here that are complaining that the hate towards this film\nis motivated by political correctness. In reality, that doesn't even\ncome into it at all. I absolutely despise political correctness and yet\nI hated this film.<br><br>If there was an Oscar award for a film having no redeeming qualities\nwhatsoever then this would be a VERY strong candidate. Absolutely\nnothing clever or funny whatsoever, just vulgarity for vulgarity's\nsake. I get that some people enjoy really crude humour but I don't see\nanything worthwhile in it and the film had nothing else to offer\nwhatsoever, hence the one star review.I can't see this as anything\nother than a cash grab. At this rate, it's competing with the\nGhostbusters 2016 remake for my least favourite movie of the year.\n"},
{"review": "\nI watched Dirty Grandpa at first in the cinema. When it became\navailable to watch at home i found myself watching the same scenes\nagain and again, yes it is dirty and it's fun too. All the actors are\ngreat, the lines are great. I was keen to watch a couple of the actors;\nin other films this year such as Zac Efron in Bad Neighbours 2 and\ntogether again with Aubrey Plaza in Mike and Dave Need Wedding Dates. i\nwatched both of those stone faced which proves to me the writing really\ndoes matter, and i believed that the characters have a life beyond this\nmovie,which to me is always a sign of good writing &amp; acting. Watch this\nmovie with a dirty mind and you need cheering up, you won't go far\nwrong.\n"},
{"review": "\nThis movie was a shameful experience. Robert De Niro has made some bad\nmovies and so did Zac Efron. However, those two can showcase talent\nstill especially De Niro who is still a legend today. However, this was\njust embarrassing. Another crude comedy that thinks that some stupid\ninsults and just simply cursing is funny as it is.<br><br>Good: Aubrey plaza and Zoey Deutch in a bikini. Shallow, but hey that's\nall this movie gave me that was worth anything. Well, Zac Efron naked\ndoing the Macarena was pretty funny.<br><br>Bad: It's terrible. There's nothing worse than a comedy that absolutely\nfails in its intentions. It is literally De Niro taking words and\nadding curse words to them and the movie pauses for laughter which\nnever comes. He's just slumming it big time here and I'm sure only did\nit just to act crazy and have Aubrey Plaza grind up on him. Efron also\nsuffers as the script has no good material to work with which the\nusually dependable Efron can do if given the chance. The jokes are all\nsimple cursing or insults involving obvious curse words thrown in there\nthat gets old after the first two minutes. There is just nothing here.\nIt's like watching a fourteen year old curse wildly because you let him\ndo it for the first time. The movie just thinks its so edgy and cool\nwhen it is just lazy and terribly unfunny.<br><br>Overall, it's terrible. That simple. Don't watch it. There are so many\nraunchy comedies out there that actually have a point and are funny.\n"},
{"review": "\nI have to confess that modern comedies of this vein (filled with\nexplicit raunch) are usually not my cup of tea. It isn't that I'm a\nprude, but because the attitude of these movies is usually that \"shock\"\nhumor is automatically funny. Often these movies are so determined to\nshock, they don't take the time to add real cleverness or wit to these\nmoments. So my hopes weren't up when I sat down to watch \"Dirty\nGrandpa\". But I have to admit that it was somewhat better than I\nexpected. Here and there were some moments that made me smile or even\nlaugh out loud. And the movie certainly is pulled off with the energy\nand slam-bang attitude a comedy such as this needs. It's too bad that\nmost of the movie I simply didn't find to be humorous. I wasn't bored,\nnor was I squirming in my seat. I just didn't laugh enough to give the\nmovie a recommendation. If you like these modern day raunchy comedies,\nyou might like it. But if you're like me and don't particularly care\nfor this certain genre, I would say avoid it.\n"},
{"review": "\nMissed the first half hour of the film as I got hungry and had to nip\ndown to Macy DS for a meal but when I got back my lass easily said what\nwas going on. Easily got back into the script and DE Nero is great?\nExactly like my grandpa which is slightly embarrassing!!!!!! He was in\nthe gulf war so he had so many stories and doesn't care either:p get\noff my right nipple Vikki am lactating!!!!n e ways when they got off\nthe bus and the cop has a phallus on his forehead I chuckled and even\nmy dog noticed how hard I laughed. Great film, one of the few comedy\nfilms this last couple of years that made me laugh!!!! Well I've got to\nmake to make 10 lines which I've blatantly done but I think it's wrong\nthat the granpa had a kid at 72!! Obviously the film isn't real but\nwhen then the kid is 18 he's 80 and in the school I went to I would of\ngot bullied to bits plus my dad would be dead in a few years... not\nnormal!!\n"},
{"review": "\nDirty Grandpa had lots of funny parts to it, and you'll laugh many\ntimes, but for me it was just a little too far fetched. If you're a\nhigh school kid or a dope smoking college kid, you'll probably love\nthis movie. I'm a huge De Niro fan, and I think it was a little\ndifficult seeing him portrayed as an obscene dope smoking, drunk, sex\ncrazed and crude grandpa. I just feel like they could've dialed It back\na notch with him. Cursing doesn't offend me at all, but there was just\nso many F-bombs coming from his mouth that it was just annoying. I was\nenjoying the movie until it got down to the wedding scene at the end\nwhen he's trying to tell his fiancé that he can't marry her, and he's\nusing his cousin to relay the message, and he uses a guy with throat\ncancer and another one who can't speak to do it. That scene was just\nsilly and unnecessary, and probably should've been redone.\n"},
{"review": "\nDid somebody loss a bet?<br><br>This was the worst Robert Di Niro movie ever!<br><br>Did the writers go to the story pantry and pull some characters off the\nshelf, mix in some predictable story line and then fill half a script\nwith the \"F\" word? SURE THEY DID! <br><br>Now, if you find non-stop cursing, no real plot, and knowing what is\ngoing to happen 10 minutes before it happens, this is the movie for\nyou.<br><br>Now I did like scenery! But I've been to Daytona Beach many times and\nmost of the those bikinis are filled with senior citizens.<br><br>Also, there seems to be a time line issue. <br><br>Here is the only spoiler alert you need to know. This movie sucked!\n"},
{"review": "\n\"Most grandpa's just want toffee.\" Jason (Efron) is about to get\nmarried and start his new life as an impressive lawyer. At the funeral\nof his grandmother he reconnects with his grandpa Dick (De Niro). When\nhe asks Jason to drive him down to Florida Jason thinks it will be a\nquick trip, then he shows up at his grandpa's house and everything\nchanges. This is a movie I was extremely curious about. Sex comedies\nlike this are usually funny and entertaining to watch, but this one had\nDe Niro which seemed very odd to me. I have to admit, he was very very\nfunny in this and brought something that most characters in movies like\nthis don't. Believability in the serious aspects. The jokes are really\nnothing new, but De Niro delivering them make them that much funnier\nand I laughed a lot through out, hard. All of the actors had great\ntiming in this, Efron and De Niro had good chemistry but Aubrey Plaza\nreally shines and if not for De Niro would have stolen the movie. This\nis nothing all that original but it feels new and fresh with the\naddition of De Niro and is very much worth seeing for that reason.\nOverall, De Niro really shows his range; from Godfather 2 to Raging\nBull to Goodfellas to this one...and he again shows why he is one of\nthe greatest actors of all time. I give this a B.\n"},
{"review": "\nDirty Grandpa is good fun to watch. I was hesitant to bother with it as\nI saw quite a lot of negative reviews towards it but I'm glad that I\ndid. It is a pretty basic comedy. Raucous, outrageous and vulgar. Some\nof the dialogue is really quite good and made me laugh out loud and\nsome of it is a bit too try hard and almost cringe worthy. Some of the\nbetter dialogue reminded me of Superbad. Yes, there are a lot of\nmoments of Zac Efron with his shirt off. But he is in great shape - so\nfair play to him. He actually comes across as genuinely good fun in\nthis movie and him and De Niro actually strike up a pretty good\npartnership as they play off of one another and you can sense a genuine\naffection between them. This is what makes the movie enjoyable for me.\nIt will never be considered as a great comedy movie but it has the feel\ngood factor and is fun to watch throughout. It's definitely better than\nit's given credit for.\n"},
{"review": "\nFirst of all, I'd like to emphasize that this is a subjective review.\nI'm saying this because I've been called hater or without sense of\nhumor because I didn't like it. But, I just don't see what is funny\nabout it. I didn't like trailer and I rejected invite to go see it in\nthe cinema. But few of my good friends told me that it's \"the funniest\nmovie they've seen in a long time\" so I decided to give it a try. Worst\nspent 45 minutes of my life (yup, I didn't manage to watch it whole).\nDon't get me wrong, I'm not a nun, but this was awful. Humor based on\nthe exaggerated use of words like f*ck, sh&amp;t, di%k, pu#@y, brings me to\nthe time of first years in high school, when biology teacher said\n\"pe#is\" and a bunch of teenagers burst into laugh. I wasn't expecting a\nromantic movie, but also didn't expecting this so called humor based on\ncompilation of swearing and insulting. And Robert De Niro in the role\nof old man who lost his wife, and the first thing he does is trying to\nlaid a girl who could be his granddaughter (by the age, not blood) -\njust no. Only reason I gave it 3* is because of the Effron's and De\nNiro's ability to make the best with what was given to them, which, in\nthis case, wasn't too much. Anyhow, if you're in doubt should you watch\nit or not, I'm sure there are far better choices than this.\n"},
{"review": "\nThe film is just superb, It was my type of film, I laughed from start\nto finish, it was similar to Old School which remains my favorite\nComedy film of all time. It has lots of swearing it is crude but it is\nHilarious, it has lots of hot women. De Niro was just perfect for the\nWar Vet/dirty old man role and played it to perfection If you like\nAmerican Pie/Old School,The Hangover,Hall Pass which are all brilliant\nin my opinion then you will love this. Ignore all the haters they\nhaven't got a clue, what did you expect to see with the title Dirty\nGrandpa? great job guys made my evening, I wasn't expecting it to be as\ngood as it was I was very surprised my wife even came in from the front\nroom when she heard me laughing to investigate and sat through the\nremainder of the film laughing too.\n"},
{"review": "\nSo me and my boyfriend went to see this movie, because of the actors in\nit. I've had very low expectations for this movie and surprise it dived\nbeneath the bar I've set. <br><br>The humor in this movie is so shallow you just laugh because it's so\nbad you have to to get through that movie. I was sitting there,\nsuffering through a never ending dick joke this movie is and listened\nto my boyfriend going every three minutes or so : omg this is so bad. <br><br>This movie is incredibly predictable and you can't feel with any of the\ncharacters. First you might laugh at the sex jokes and 'dirty grandpa'\nbut hell it's tiresome. <br><br>So nope. Let's scratch this movie from both main actor's filmography\nand my memory. We went to get a drink afterwards and that is what I\nwould recommend to you as well if you really want to suffer through\nthis mess of a movie. <br><br>PS: I'm giving this 3 stars and not 1 because I don't hate it. It\ndidn't get me angry, just like: yaay another dick joke..uuuhuh..oh well\njust finish watching it.\n"},
{"review": "\nPeople give a lot of crap over this movie because of its humor. Yes it\nis a bit childish but its also fun (In my opinion at least). The story\nis a bit standard, I give you that, but that doesn't give away the fun\nof the movie.<br><br>Also people say that this movie is bad for Robert De Niro because of\nhow bad the movie is, but that isn't true at all. This is a pretty good\nmovie and he plays his persona very well. Same goes for Zac Efron. He\nplays his silly character very good.<br><br>In my opinion it was just a very fun movie to watch and i would\nrecommend it to everyone who wants to give it a try!\n"},
{"review": "\nDirty Grandpa is a crude and over the top adult comedy featuring solid\nperformances from Zac Efron and Robert De Niro who both manage to bring\na charisma that somehow makes it work despite an uneven script and some\ntruly twisted humour that definitely won't appeal to everyone. It isn't\nparticularly clever but I have to admit I found some of it really\nfunny. It's too long but the chemistry between Efron and De Niro kept\nit entertaining. I can understand why some people don't like it but if\nyou enjoy outrageous irreverent humour it's worth a watch. The\nstoryline isn't exceptional but I did think the dialogue was often\nfunny and the supporting cast did a good job at going along with the\nsilly tone of the film. It drags a little bit in the middle and the\nending is very clichéd but overall it is both fun and funny enough to\nplease its target audience and, while not amazing, certainly not as bad\nas the critics are saying.\n"},
{"review": "\nA very successful comedy, that made me laugh out loud, as I have not\nlaughed in a long film. Robert De Niro and Zac Efron plays flawlessly,\nyou have nothing to reproach them, comical phases are a lot, not the\nkind of comedy with just a few scenes, but one that hearty laugh, I can\nsay that is worth seeing. But now depends on the type of humor that we\neach agree, this movie has many moments and perverse aftershocks,\npeople who do not have liked movies like American Pie, do not recommend\nthis film because it is similar. Otherwise the film worth seeing. By\nfar the best comedy seen in the last many, many years! I recommend !! I\nlove De Niro and gives earned the right to play and-not that kind of\nfilm that you see it's OK, if not, it's not a loss, but I think it was\na lot of fun. So if you want to relax and not beat your head ...\ndeserves.\n"},
{"review": "\nWell to tell you the truth, I've enjoyed a lot that movie... I had a\ngrandpa once, and I had a lot of fun with him... He was in the Us Air\nforce, has an instructor. And most of the second world war vets, are as\nmuch as fun as Deniro script... It's a comedy, not a serious movie. But\nit reveal the real connection that is being build between every grand\nson and grand father. All of the people are easy to criticize the work\nof famous writer... So easy, when most of those people are not able to\nhandle a pen for more than 10 minutes... <br><br>For the people like me, that had or still have a chance to have a grand\nfather. Go head even if Deniro is not the same as your's, i'm sure you\nwill find some similar character point... Getting old, Getting wilder.\nAnd the the grand son is always ashamed... I was, and i wish i wasn't.<br><br>Enjoy.\n"},
{"review": "\nI like stupid funny. I like Pineapple Express and movies that are\noffensive and make crazy jokes that insult people. Movies are meant to\nbe different. It's not for everyone which is OK. But if you like\noffensive humor, you like Pineapple Express or Bad Grandpa or jack ass\nthen you will like this movie. If you don't like those movies then find\na documentary or a Emmy award movie because this movie isn't for you.<br><br>Robert De Niro showed that he could do any type of movie. No job is too\nsmall. I liked that he did this movie. <br><br>I'm not shocked that there are a lot of complaints. These days there\nare no boundaries of how far is too far when it comes to humor. Its a\ndifferent age of movies we live in. Those Brady Bunch days are over. <br><br>Be ready to be laughing over offensive material and to see a new\nDeNiro. I enjoyed it 😊\n"},
{"review": "\nSo comedies are a sensitive subject to the general population and\nespecially in this day and age, you have to watch what is said because\nEVERYONE is suddenly so sensitive. Well, to start this section off, I\nwill genuinely say that if you do not appreciate vulgar R-Rated\ncomedies, do not see this movie. On another note, I thought this movie\nwas absolutely hilarious. Dirty Grandpa presents Robert De Niro in a\nway mostly never seen before. He rips out insults and jokes like he is\na freshly turned 21-year-old in a 72- year-old body. Zac presents\nhimself as a very uptight and by-the- book lawyer that has a\nfree-spirited past that he has since lost due to the strictness of his\nfather yet as soon as that uptight side is broken, this film is a wild\nride as the two tear apart the beaches of Florida. This movie is purely\na joke film, the story is forced in for the sake of film but it still\nworks, kind of. Nonetheless, if you want to watch a very vulgar comedy\nand want to watch a 72-year- old like never seen before, this is the\ncomedy to watch to start off your year. Raunchy inappropriateness at\nits finest.\n"},
{"review": "\nI sat in for this knowing it is all rude humor about sex and urinating.\nYou know those have their places, and can be done well. Lot of movies\ndid it in multiply ways, including the American Pie series, Ted,\nJackass, Bavis&amp;Butthead, Team America, Meet the Parents and so on.<br><br>Holy moly, the jokes are even good most of the times. That's why I went\nwatching the movie you know. I don't even blame DeNiro. Why should I?\nBecause this is not \"Godfather\"? I don't care. Because he's overplaying\n24/7? That was his character's role, his way pushing Efron's character.<br><br>The way to do well in this suburb is to go over the limit not just by\nthe jokes, but by the visuals. Need a lot of people in it. Need them do\nobscenity. Outrageous things. On screen. Eat dog-dung filled cakes.\nDrink beer with sperm. Vomit like a dog for minutes and eat it. Without\nthat this type of humour does not work. It'll become action movie\nwithout action, romantic movie without romance.<br><br>What we get is a very limited number of characters: there's the bride,\nthe groom, grandpa, and 4 random youngster who we are stuck with until\nthe end of the film. There's only 1 sex-scene, between the grandpa who\nisn't supposed to, as he is supposedly pretending to beat life into\nEfron (at least I thought so), and one of the random chick from the two\n(aside the bride). And they aren't even nude. And I don't mean they are\nunder blanket even - no, they do all-American style: in undergarment! I\nstart to wonder: people in the USA evolved into a new race? That's how\nyou look like people?<br><br>I don't know who to blame. the censors and the company trying to force\nthis movie in the PG-rating? Or it was supposed to become the next\nSomething's Gotta Give (the Jack Nicholson&amp;Diane Keaton movie)?<br><br>Either way it is a major disaster, also likely the shameful ending for\na respected career.\n"},
{"review": "\nThis movie was offensive to all: genders, races, religions, sexual\norientations, etc. It is not worth the money and I can't believe I\nactually gave money to this group. I lost so much respect for everyone\nwho is in or made this movie. I cannot believe that Robert De Niro\nactually took this job. If someone had never seen a Robert De Niro film\nbefore this and then saw this, his whole career would be looked at as a\njoke. To comment on Zac Efron, he kind of sold out. He seems to be\ntrying to stay away from his High School Musical days so much that he\nis choosing the farthest thing from it. He struggled with addiction and\nnow he is in a movie that is all about what he said was the darkest\npart of his life. I hope that no one else has to suffer through this\nhorrible movie because it honestly is a waste of time. This is so sad\nbecause I really like a lot of the actors within this film.\n"},
{"review": "\nAn absolutely horrible movie tha was so far beneath what one would\nthink itwould take to get an actor like Robert DeNiro involved. His\nfirst scene; masturbating to porn that he calls his \"number three\", and\nit doesn't get any better from there. He spends the entire rest of the\nmovie saying \"pussy\" over and over trying to sleep with a college girl\nwhich he ultimately does. There is a scene where he and Zac Efron are\nsleeping together and he places his penis on his grandson's pillow.\nThen we have Zac Efron smoking crack, full frontal and rear nudity, oh,\nand being mounted by a dog while he is passed out on the beach. I could\ngo on but just lets say if you're old enough to remember Porky's from\nthe 80's, it was like Shakespeare compared to this garbage. Don't waste\nyour money and your time.\n"},
{"review": "\nI can't even begin to describe this. I mean, De Niro must be in heavy\ndebt or something like that to agree to do this movie. <br><br>Nothing about this movie is funny, just nothing. Same old cliché jokes\nand situations that you can see coming from a mile away.<br><br>I don't know if they tried to do a teen comedy or a movie that sends\nsome kind of message, which no one gets what it may be, but they don't\nget to do any of those.<br><br>They guy selling drugs ? I mean, again and again and again they try to\nmake it so funny that the police will let him sell drugs..and the guy\nrepeats that a hundred times ... I mean everything seems so forced, so\nunnatural. And the comment about people in Florida ? I live in Florida\nand I don't really understand where the hell do they get that idea that\npeople don't count or that you can shoot people around or something\nlike that.. The guy shoots up his own store and goes: \"well, this is\nFlorida\" and I am thinking : yes???? so ??? ... what do you mean by\nthat ? <br><br>And What's with the finger up the ass joke and that dick that shows up\nin the middle of the movie . I mean, I am no prude, but this is\ncompletely unnecessary ..it is not even funny . And how many times must\nthey show Efron's ass? at least if there would have been some nice\ngirls naked (this takes place in spring break after all, right? ) but\nno , not even that, we get to see Zac Efron's ass a hundred times and\none unnecessary dick.. <br><br>I think that sums it all up.. good night , just don't go to watch this\nmovie , do yourself a favor and don't go..stay home staring at the\nceiling if you must,,it will be time better spent\n"},
{"review": "\nAfter his HSM career ended, Zac took on many more serious roles in some\nGREAT indie movies. He was truly someone I believed would've been a\nnext legendary actor, hell, I thought he was the only one from the HSM\nfranchise who would've had an actual place in Hollywood and shed the\nstigma of teeny bopper that he got from playing Troy Bolton. While he\nis the only one of the HSM cast to still be relevant, the movies he is\ntaking that makes him relevant is plain crap.<br><br>After a few great movies, his career took a turn in 2013 where he\nstarted acting in absolute GARBAGE. It's like rubbish after rubbish\nafter rubbish. It leads to me wonder if there is anything he would not\ndo for a check.<br><br>He needs a new team that would bring him better movies to act in\nbecause he does have talent.\n"},
{"review": "\nDirty Grandpa could possibly be the worst film of the year, and even up\nfor worst film ever seen. This is due to several aspects, the biggest\nof these and hardest to comprehend is Robert De Niro stooping very low\ninto toilet humour. His distinguished career, which includes Raging\nBull, The Godfather: Part II and Heat, is tainted by this monstrosity.\nDirty Grandpa is full of jokes about farts, sex, drugs and general\nstupidity. De Niro's unbearably crass and homophobic. He spends all his\ntime jamming his thumb up his grandson's behind and swooning over young\ntot Aubrey Plaza, and just a day after laying his wife to rest. <br><br>Maybe I'm getting too old for this kind of humour. All I know is Dirty\nGrandpa is shamefully racist and misogynistic, and probably without\nknowing. The black people in this movie are either gangster or\nhomosexual. Hugely insulting. What's even weirder was most people were\nlaughing at the screening I went to. It must be me.\n"},
{"review": "\nUnfortunately IMDb does not allow negative or zero stars as this piece\nof rubbish deserves it! I couldn't make it past half way, it is the\nworst piece of rubbish I have had the unfortunate chance to watch in a\nlong time.<br><br>It is nothing but FILTH, foul language crude jokes of which none of\nthem are remotely funny.<br><br>De Niro should be ashamed for even reading what pathetic script there\neven is - How he agreed to appear in this garbage is beyond me, maybe\nhe needs the money? Sadly, this movie will tarnish his name as a\npreviously great actor, do yourselves a favour and give this one a wide\nberth, it is toxic crap!\n"},
{"review": "\nThis is as bad as it gets. I do believe, this is the first time we've\nhad a 1/5 star movie on the Autistic Reviewers page. It was just\nunbearable.<br><br>The plot is simple: A man by the name of Jason Kelly is about to get\nmarried, and unfortunately for him his Grandfather, Dick Kelly has\nasked him to give him a lift to Florida. Jason thought his Grandfather\nwas doing it for business, but little did he know he's doing this for a\nSpring Break. He has not had sex win fifteen years and he wants to\n\"F*ck* F*ck *F*ck F*ck!\" The whole script was just laughable, and not\nin a good way. The writing was horrible the acting was horrible\n(especially from Zac Efron.) Whenever Efron was acting it felt like I\nwas watching High School Musical again. Except this was twice as bad.\nDeniro was about the only thing that made this movie watchable, and\neven he could not save this horrible movie! The characters are all\nunlikeable, they either just nonstop cuss or just get high. There's no\ncharacter development what so ever. There's no reason for us to care\nabout anybody in the film.<br><br>I don't recommend anyone to watch this film, unless you really love\nwatching people cuss, watching people get high and watching Zac Efron\ntake his shirt off to reveal his \"steriod\" body while Deniro lifts him\nup in the air! Horrible. Sorry folks, but this movie gets a 1/5 stars\nfrom the Autistic Reviewers.\n"},
{"review": "\nIf I could give this 0 stars I would. Don't waste your time or money on\nthis garbage. It will offend you no matter what gender, race, sexual\norientation, religion, etc. you are. I wish I could have my time and\nmoney back because it was not worth either in the slightest. I made an\naccount only to review this movie to try to save people from watching\nit. Horrible acting, horrible writing, and absolutely no plot. I am so\ndisgusted with the whole movie. Whoever wrote it, the actors/actresses\nwho agreed to it, and anyone affiliated with it. I am so upset that I\ngave these people my money. This is not humorous at all. Please save\nyour time and money and don't see this movie! Don't pay them anymore\nmoney!\n"},
{"review": "\nI would say this was the worst movie I had ever seen, but that would be\nBurnt. But be aware that this is in the top 5 worst movies I have ever\nseen. I hadn't had high hopes for this movies. I had gone to see Zach\nEfron shirtless. But not even Zach Efron strutting around his abs\nshirtless is worth sitting through the insufferable script of that\nmovie. It was just absolutely disgusting wise-crack overly sexual joke\nafter another. <br><br>I would suggest bringing some bottles of Pepto Max with you, because\nthe people sitting in front of you will thank you for not vomiting on\ntheir heads as you watch the scene where senior citizen Robert De Niro\njerks off in front of his grandson and then precedes to clean the semen\nmess. (I am drinking Pepto as I write this).<br><br>I would say the worst part of the movie was when they decided to make\njokes of Zach Efron being a pedophile, but I guess that would be a\nbiased opinion considering that was about the time I walked out of the\ntheatre.<br><br>Thankfully, Cineplex refunded me for that garbage.\n"},
{"review": "\nDirty Grandpa could possibly be the worst film of the year, and even up\nfor worst film ever seen. This is due to several aspects, the biggest\nof these and hardest to comprehend is Robert De Niro stooping very low\ninto toilet humour. His distinguished career, which includes Raging\nBull, The Godfather: Part II and Heat, is tainted by this monstrosity.\nDirty Grandpa is full of jokes about farts, sex, drugs and general\nstupidity. De Niro's unbearably crass and homophobic. He spends all his\ntime jamming his thumb up his grandson's behind and swooning over young\ntot Aubrey Plaza, and just a day after laying his wife to rest. <br><br>Maybe I'm getting too old for this kind of humour. All I know is Dirty\nGrandpa is shamefully racist and misogynistic, and probably without\nknowing. The black people in this movie are either gangster or\nhomosexual. Hugely insulting. What's even weirder was most people were\nlaughing at the screening I went to. It must be me.\n"},
{"review": "\nWhat has happened to this guy? Biggest fan since Meanstreets, and have\nto say that these unfunny comedies are ruining a great legacy. Surely\nto have agreed to this he must be totally unaware of Bad Grandpa.<br><br>I wish him to go back to what he does like no other. Dear Hunter,\nRaging Bull, Goodfellas, Casino, King of Comedy, Cape Fear &amp; so on.<br><br>I have to admit that I managed only thirty minutes of this dreary\ndreadfully unfunny business, every punchline has been done to death.\nEven the premise is old hat. De Niro's is in it, must be different\nright? Couldn't be more wrong, just formulae Benny Hill 'comedy' with\nadded embarrassing dialogue.<br><br>Very sad to see, the best of De Niro is long gone. It doesn't have to\nend this pitiful way\n"},
{"review": "\nYou know the sad thing is that the main characters were good for the\nmost part and even much of the journey. The dialogue and jokes were\npainfully bad. <br><br>I think most of us can laugh out loud at a good dirty joke but whoever\nwrote this seemed to think that just being dirty automatically meant\nfunny. <br><br>Had someone gone over the script and rewrote the dialogue without\nhaving to change a lot of the plot this film could have been raised\nseveral notches. <br><br>Zac Efron is not really considered as a serious contender in movies so\ntaking whatever gigs he can get while he can is understandable. DiNero\non the other hand, what was he thinking? <br><br>The romance with the nice girl was not actually developed. That was\nodd, a couple of pics and almost a kiss and no actual relationship\ndevelopment and she is supposed to be the one. <br><br>Also they went with black and white characters for the baddies. Zoe's\nfriends were dicks to Efron but why could they not have simply been\ngood guys so taken up in their own lingo that as each tried to\ncommunicate to the other it just got weirder rather than make the\nfriends jerks. <br><br>Also why to give Efron an out of his engagement did his fiancé have to\nhave slept with someone else? Why could she not be a decent person who\nhe was not in love with. <br><br>It cost millions to make films, even cheap one. Getting a professional\nto look over a script and tighten it up cost thousands so there is\nreally no excuse for this to have even been made.\n"},
{"review": "\nI've an open mind, but some of the things I've seen in the film takes\nthe cake. I'm a Robert De Niro fan since his The Godfather Part 2 days.\nSince then, I have seen all of his best films: Taxi Driver (1976), The\nDeer Hunter (1978), Raging Bull (1980), Once Upon a Time in America\n(1984), The Mission (1986), Goodfellas (1990), Awakenings (1990), Cape\nFear (1991), Heat (1995), Sleepers (1996), Red Lights (2012). He has\nstarred in a lot more films than I can write here. These above are a\ngood guide.<br><br>Now the other actor Zac Effron, I know nothing about him. His acting is\nokay he is able to handle the many embarrassing encounters and events\nin the film. He plays the grandson of Dick Kelly an Army veteran. After\nattending the funeral of his grandmother, Dick personally requests that\nJason drive him from his home in Georgia to Boca Raton, Florida.<br><br>Watch the film to find out what happens next...<br><br>I should warn you that this film is not like Meet The Parents(2000).\nThis film is more R rated. At age 72 years Robert De Niro still has an\nawesome physique. He does some pull-ups in the film to prove the point.\nWe have three very pretty actresses in the film: Julianne Hough, Zoey\nDeutch and Aubrey Plaza.<br><br>First time director Dan Mazer has co-wrote and co-produced the films\nAli G Indahouse (2002), Borat: Cultural Learnings of America for Make\nBenefit Glorious Nation of Kazakhstan (2006) and Brüno (2009).\n"},
{"review": "\nI sure did think it that way. De Niro in a pervert grandpa role? I\ndidn't think he'd go that far, especially after the wise and\nexperienced senior citizen in The Intern just last year. But really he\nnailed the part very well. Zac Efron nicely balanced the duo that the\nstory flowed naturally. It's worth a mention that even though the\nmovie's plot is dependent solely n the perverted jokes, I think that it\nexecuted them in a decent way that it didn't feel disgusting like most\ndirty comedies do. The acting in overall is not a really good one,\nmainly due to the fact that it's only Efron and De Niro who's cranking\nup the real performances, while the rest of the cast are only there for\nshow.\n"},
{"review": "\nI'm going to go out on a limb and assume a lot of the people who gave\nthis poor reviews were expecting a more serious De Niro like his prior\nroles and this movie is the complete opposite. I almost peed my pants I\nlaughed so hard. The humor is crude and not politically correct but\npersonally, I don't watch comedies for their political correctness, I\nwatch them to laugh. I thought the acting was great too, it was\nbelievable to say the least. I'm still kind of perplexed about the\nawful reviews but to each his own I guess. I would totally recommend\nthis movie if dirty jokes and foul language don't bother you. Don't let\nthe other reviews scare you.\n"},
{"review": "\nJason Kelly (Zac Efron - Neighbors / 17 Again), is tricked into\nconsoling Dick Kelly (Robert De Niro - The Intern / Meet the Parents);\nthe grandfather he's been distanced from for many years, after the\nfuneral of his grandmother.<br><br>Dick Kelly wants nothing more than to f*ck someone young and free after\na lifetime of marriage, and gets Jason into heaps of trouble to reach\nhis goal.<br><br>All Jason wants is to deliver his granddad Dick to his destination and\nbe rid of him to get back home and marry Meredith (Julianne Hough),\nwho's wedding was set within two weeks of the funeral.<br><br>Dreading he won't make it in time, Jason frets around, getting\nincreasingly agitated by his granddad to just go where they were meant\nto go, and get the h*ll out. Dick realises his grandson is too uptight\nand getting ready to marry the wrong girl, making him do whatever it\ntakes to stop the wedding without Jason realising it.<br><br>This comedy is a fun watch, something to laugh at while there's nothing\nbetter on TV. The plot isn't that original though, and the profanities\ncould've been a LOT less! A film doesn't need a swearword a minute to\nbe funny. But to be fair, it's all relative. While I didn't enjoy this\nfilm as much as I thought I would, my OH was rolling on the floor\nlaughing!\n"},
{"review": "\nWhat a great movie, yeah it's pretty crude but I like that kind of\nhumor, it was funny to see Aubrey Plaza play an R18 version of her\ncharacter from \"Parks and Recreation\". All in all a very entertaining\nmovie it has plenty of interesting characters and keeps the laughs\ngoing from start to finish. I like De Niro in this kind of role, he was\nvery relaxed and quite believable as the sex mad Octogenarian, I think\nit would be awesome to have him as your granddad. I also like Zac\nEfron's character it suits him quite well and although similar to the\nrole he played on \"Bad Neighbours\" think that there was a bit more\ndepth to this character. What can you say about Zoey Deutch, what a\nstunning creature, so beautiful, so natural. I think she is destined\nfor great things.\n"},
{"review": "\nDon't let the political correctness douche kits who find inspirational\nquotes on the back of period pads tell you this movie is bad. <br><br>This movie is highly inappropriate and hilarious. De Niro is legend and\nno this movie doesn't change that, if anything, adds to the man's\nportfolio of amazing talent. If you don't take life too seriously and\ncan laugh at some stupid, yet clever and funny, stuff, give it a watch.\nNot the biggest Zac fan, but hell, even he played his role great.\nReading through reviews I think a lot of people are in crappy jobs they\ndon't want and never chased that younger dream. Watch this great comedy\nand you'll know what I mean.<br><br>Make the most of it before they ban swearing in adult comedy...\n"},
{"review": "\nWhy do film reviewers expect every movie to be art-house cinema?\nSeriously. This is a movie, whose sole purpose is to make people laugh\nat stupid stuff not make them ponder the hidden meanings of life and\ncharacter development. Robert DeNiro is past the stage of his life\nwhere he has to impress anyone. And Zac Efron seems like a good sport\nto take on a role that makes him go from uptight college boy to regular\nguy with some total humiliation along the way. Was it tasteless, crude\nand vulgar? You bet it was! Some of the lines were jaw dropping-ly\noutrageous...and great! I laughed out loud a couple of times with a\nmixture of shock and disbelief. I loved it. If Robert Deniro has no\nproblem swearing like a NY cabbie and Zac Efron is not camera shy- who\nare we to complain?\n"},
{"review": "\nThe only nice thing about this movie is Zac Efron not wearing lots of\nclothes on some occasions.<br><br>Every cliché that you can think of - you'll find it in this movie,\nincluding sexist jokes, \"dirty\" words, classic anal moments (yay\nbuttholes are hilarious).<br><br>I suppose some actors really needed the money, I cannot think of any\nother reason they participated.<br><br>Did I say the nice stuff? Oh right, Efron's butt. Piece of art,\nunfortunately not worth watching the whole movie. <br><br>Review is over.\n"},
{"review": "\nGiven the fact that Robert De Niro was one of the main characters in\nthis film, I began watching with the misguided impression that this\nwould be a clever and comical movie...offering at least some of the fun\nhumour presented in previous films such as Meet the Fockers, Last Vegas\netc.<br><br>How wrong I was! I can only assume that this film is some sort of\npunishment for De Niro issued by the parasitic overlords of\nholly-wood...maybe in response to his involvement in the controversial\n'Vaxxed' film. Or, it could just be some kind of inside the industry\n'hazing' type of thing...where the actors are forced to take on roles\nin crappy sub standard movies, to keep their position in the feculant\nand terminally diseased hierarchical system that is holly-wood.<br><br>If you want to waste a couple of hours of your valuable time, then pull\nup a chair, grab a glass of fluoride infused water, and watch it in\nyour yard...whilst you breathe in deep those lovely toxins from the\nchemtrails filling the sky above your head. This would be the target\naudience for this piece of low level drivel.<br><br>Clearly, De Niro and Efron are being the well behaved little puppets\nthat their overlords require...enjoy the pay check boys, you sure\nearned it by humiliating yourselves in this piece of mind dumbing\ngarbage. I want my money back!\n"},
{"review": "\nJust logged in to write a review.<br><br>I understand that the movie might appeal to some, if you liked Hangover\nor TED and if you laugh at lines like \"I want to f*ck\" this might be a\ngood show for you.<br><br>Otherwise don't waste your time, the movie is total garbage. It's\nbeyond my why an actor like Robert DeNiro signs up for stuff like this.\nIn all honesty as much as I like him, I think he was pretty bad in the\nmovie, sort of in-line with it I guess.<br><br>And what was that scene at the end where the bride couldn't hear the\ngroom and they were relaying the message across the room, it was\ncompletely retarded, it would make a 5 year old laugh maybe?<br><br>I knew it was going to be a raunchy road-trip comedy, but still it was\na huge disappointment, don't waste your time and money.\n"},
{"review": "\nDirty Grandpa is a film overflowing with crude humor and swearing that\nmanaged to actually be occasionally funny (occasionally being the\noperative word). The plot is almost unforgivably cliché but hey, its a\ncomedy, and no one came here for the plot. I love De Niro and am very\nfond of Efron as actors and their performances weren't bad at all, they\njust seem wasted on such a truly uninspiring script. The supporting\ncharacters had their moments but the so called comic relief character\nhad more development than the ones who were supposed to be moving the\n\"plot\" forward. <br><br>So should you watch Dirty Grandpa? If you like dick jokes and swearing,\nsure why not.\n"},
{"review": "\nGosh! I watched it about a half hour ago and I still can't get out of\nthis movie's shock. Well, the idea of the story is not that bad. Jason\n(Zac Efron) plans his wedding with an annoying woman, and his grandpa\n(Robert DeNiro) wants to ruin the wedding. They are having a road trip,\nand the grandpa's only aim is having sex with a college girl. Yeah,\nweird. And the whole story is full of obscene words, there are no 5\nminutes without someone saying f*ck or something. But all of this could\nbe bearable, if there weren't be the most sick ending. So, if you want\nto watch this film after my opinion too, watch it online, so you won't\nthrow your money to a dust bane.\n"},
{"review": "\nIn a film filled with one liners and name calling, Dirty Grandpa fails\nto capture your attention and affection during the 102 minute film. Di\nNiro's character \"Dick Kelly\" and Zac Efron's character \"Jason Kelly\"\nseem forced through most of the film, leaving you to wonder if anyone\ncould have possibly pulled off the story line with this sad attempt at\nwriting comedy. The only real shining moments come from the supporting\ncast mostly being the Drug and Goodtime dealing Pam played by Jason\nMantzoukas, and the Daytona Beach police Mo Collins and Henry\nZebrowski. Overall Dirty Grandpa struggles to find its identity, and\nfails to provide the high profile actors with any chance of a\nsuccessful comedy classic.\n"},
{"review": "\nI have to confess something\u0085 I quite like Zac Efron. Now that may be a\nsurprise and even though he plays the cheesiest roles out there I find\nhim great to watch and he is a decent actor, watch him over the years\nand he could become something really good. But I digress, this film\nalso stars Robert De Niro and it was ultimately the trailer that made\nthis film look a fun watch.<br><br>Well fun it may have been, but oh dear the film on the whole was\nappallingly bad! Save for quite a few \"laugh out loud\" moments the\nstoryline was weak, the script shockingly bad and the rest of the cast\npretty poor. I was shocked at quite how vulgar this actually was, yes\nit's pitched as Dirty Grandpa but this was more like Filthy Grandpa and\nto say the filth was excessive would be an understatement. It's only\nwatchable due to De Niro being the one saying it, otherwise honestly we\nwould have walked out of this one.<br><br>So, whilst I still like and respect Efron and De Niro this film just\nisn't worth seeing in any shape or form\u0085 maybe in the afternoon on ITV2\nin a few years' time, but don't waste money on it!\n"},
{"review": "\nTruly wish I could get this time back in my life...<br><br>I'm going to keep this short, but to this day I can still not\ncomprehend what the actual point of this movie was. There was no real\nplot outline nor plot to it. There was a lot of talk about penis' and\nall that as well as crude behavior. The closest movie I can relate this\ntoo is the Wedding Ringer except that movie was a lot better in the\nsense there was a point it. My recommendation is to save your money and\nRed Box this or wait for it on Netflix. If your tripping on acid or\nsomething of the sort you might get what this movie is about and I\nstill can not believe that De Niro is in something like this. I was\nleft in utter confusion and frustration. Lets hope there will not be a\nsecond cause honestly I have no idea how or why...\n"},
{"review": "\nSo while this is a formula movie as I understand them, it was so\ncleverly done and completely inappropriate that its was completely\nenjoyable. The vocabulary of foul abusive and socially unacceptable\nlanguage is more complete than anything that I have experienced. I\nlaughed so hard that I was actually in physical discomfort by the end\nof the movie. The plot is not really worth mentioning since it was just\nthe vehicle for a continuous barrage of innovative and explicit\nprofanity. DeNiro as the vehicle of this profanity gave it credibility\nif that were actually possible. Its a pretty big IF but he does have a\ngift for this sort of irreverence. This movie wants you to step out of\nthe line of sedated idiots waiting to jump off a cliff and take a hard\nlook at the world that we have allowed to happen. If insane\nentertainment needs any other reason to exist beyond making you\nhappier, that is it. I would probably avoid a crowded theater as you\nwill likely miss too much of the show due to laughter and crowd noise.\n"},
{"review": "\nThis movie was a waste of time, money, and Robert DeNiro's acting\nchops. There were few people watching this particular matinée time and\nsome actually walked out. We found it extremely profane and vulgar. If\nwe could rate it zero, we would. No more movies EVER with Zac Efron or\nSeth Rogen. We weren't exactly thrilled Regal has raised the price on\ntheir Tuesday movie special - $5 tickets rose to $5.10. We don't really\nmind that but ARE offended by the Tuesday increase of a small popcorn\nfrom $2 to $3.30, especially when the theater is making so much money\non their popcorn sales already. Regal is evidently changing their point\nsystem. The more movies you see, the more points you can accumulate. If\nonly there were more quality movies to see!\n"},
{"review": "\nThis is really the funniest movie I've ever seen. It literally gave me\nthe chills from the beginning until the very end. And this is not just\nmy opinion the whole cinema was laughing so hard sometimes I couldn't\nhear the lines so I had to read them. I think the scriptwriter did a\nfantastic job. The cast was also absolutely amazing. The mix with Zac\nEfron's talent and Robert De Niro's experience worked out great. They\nreally had chemistry between them. I think everything about this movie\nworked grade from the title to to very credits. Future project that\ninclude Zac Efron will definitely be top material. It also seems that\nRobert De Niro did not lost his touch when it comes to comedy.\n"},
{"review": "\nThis is the worst movie I have ever seen. It was so bad that we ended\nup leaving 30 min after it started. Thought that since Robert De Niro\nwas in it would be good. WRONG. I can handle the bad language but every\ntime De Niro spoke he said F---- and F---king. Went with my\nmother-in-law and we couldn't believe how bad it was and there is no\nplot or story line. De Niro and Efron should be ashamed of making this\nmovie. There is not even one good comment I can type into this review\nbecause there were none.<br><br>I would never recommend this movie to anyone. Very disappointed and was\nextremely embarrassed.\n"},
{"review": "\nI went to see a movie to kill some time while waiting for my kids at\nthe mall, and I was delighted at my good fortune that there was a\nRobert De Niro movie playing. However, this was one of the grossest,\nmost unfunny movies I have ever seen. Had I not been just killing time,\nI would have walked out about ten minutes in, when De Niro is caught\njerking off by his grandson while watching a porno. It only gets\n\"better\" as he then spends the remainder of the film belittling his\ngrandson, playing grab ass with someone 50 years younger than him, and\nbeing one of the crudest, grossest, most unappealing characters I have\never had the misfortune of witnessing. Ick.\n"},
{"review": "\nThis film revolves around a grandpa who was just had tragedy struck\ninto his life, and as a result wants nothing other than sex. Sounds\nlike this could be kind of interesting right? Like perhaps a solid 4/10\nfilm, that would get a few cheap laughs and soon be forgotten about?\nWrong.<br><br>Dirty Grandpa (starring Robert De Nero, just let that sink in) was an\nunfunny mess of a film, with horrible jokes that could only be possibly\nviewed as any form of humour by middle-schoolers, and a plot line that\nmade very little sense, with characters who make stupid choices along\nthe way. The \"humour\" in the film pretty much consists of \"jokes\"\ninvolving sex, drugs, making fun of a gay person, or blurting out\nrandom sexual words together in a form of an insult. Oh, and Robert De\nNero sticking his thumb up his grandsons butt.<br><br>This film is horrible. It is not worth seeing. At all.\n"},
{"review": "\nThere have been quite a few disastrous films made recently and this is\nnot one of them. I have not laughed this much in a very long time.\nRobert Deniro and Zac Efron are two of my favorite actors and their\nchemistry in this film is fantastic. I don't know why this movie got so\nmany bad reviews, people must have lost their sense of humor or are\njust plain prudes!!! I wasn't offended by anything, i actually thought\nfrom start to finish it was hilarious and is now one of my favorite\nfilms. Trust me, don't listen to the other critics and give this movie\na shot, you wont regret it. I will definitely be recommending it to my\nfriends!\n"},
{"review": "\nor at least my Top 3 of all time.<br><br>\"Dirty grandpa\" with Bobby De Niro.... I cannot recall in recent memory\nwhere I have seen such unbelievably bad writing. If you watch it, you\nwill see from the gitgo how horrific it was.<br><br>The humor was not even \"stupid funny\" ( which I like). It was just\nbizarrely stupid.<br><br>The Movie's attempt at gross humor or crude humor failed at every\nlevel.<br><br>The delivery of the jokes were totally disorganized , the timing and\ncontext of them were way off, and it was very forced and just all over\nthe place, like a 12 year old boy going through puberty would write.<br><br>I cannot believe that De Niro would stake his incredible Rep on a movie\nlike this.<br><br>A complete train wreck\n"},
{"review": "\nIt's awful movie. They're making bad things look okay and making the\npurpose of life silly and stupid. Drugs, sex, partying are the whole\npoint of this movie. There are trying to get to people minds with a\ncomedian way so they can convince you to believe they're right. I\npersonally didn't like the movie at all. It was boring, I was just\nwaiting to it to end. They're making cheating looks okay as well, if\nyou find a better person you can just leave. I mean what kind of\ngrandpa would encourage his grandson to cheat on his fiancé! And out of\nthe sudden, the grandson's feelings has totally changed when he met the\nnew girl! Like WTF! I expected something better. It has some funny\nstuffs but most of all are really awful in a sexual way. <br><br>Doesn't worth watching at all. Waste of time.\n"}
]