[
{"review": "\nHow can so many people get this this movie wrong, especially the\ncritics? The high point of the film is the performance by Emelia\nClarke. She is hair-brained, and scatty, completely adorable and\nwonderful.The camera-work is gorgeous and the soundtrack is second to\nnone.<br><br>Lou (Emilia Clarke) gets a job as a carer to a man (William) who is\nparalyzed more or less from the neck down. A budding friendship/romance\ndevelops; and this is 90% a feel good movie.<br><br>The criticism of the movie that it depicts a life with profound\ndisability as almost worthless is completely mistaken. The movie\ndepicts William's life as worthwhile and precious. It is William's own\njudgment that his life cannot go on as it is, and that he would prefer\nto die.<br><br>With regard to this, the movie does tend to downplay the pain and\nsuffering that William experiences. Instead it focuses on the good\ntimes and precious moments he spends will Lou. And as already stated,\nthe character of Lou is completely adorable. I am in love.\n"},
{"review": "\nThis film is getting mixed reviews, but I really enjoyed it. A very\nbittersweet film that will leave you feeling happy and sad at the same\ntime. I never read the book that which this film is based on. But\nsometimes movies are never has detailed has the books they are based\non.<br><br>A beautifully well made story, it about Louisa(Emilia Clarke) a 26 year\nold who finds a job taking care of Will(Sam Claflin) a young\nbillionaire who is permanently confined to wheel chair after an\naccident two years earlier, the use of his arms and legs are gone. At\nfirst Will does not want Louisia there, and she does her best to put up\nwith him. But soon the form quite a friendship, she teaches him to\nenjoy life again, and he shows her to be adventurous in life. But the\nquestion is will this last? <br><br>I like the chemistry between Claflin and Clarke, at no point it feels\nforced. I really bought the affection they feel for one another. At\ntimes Clarkes performance feels overly cartoonish, but still good in\nmost of it. Claflin is believable, and the question is how would you\nfeel if you where in his shoes. I don't care what the critics say, this\nwas a perfectly well made bittersweet film.\n"},
{"review": "\nI admit that I have read the book and so when the movie came out, I\njust HAD to go see it. So I drag my poor husband and we went to watch a\nlate show that was relatively full. I didn't tell him anything about\nthe movie and I watched him watching it. He actually really enjoyed it.\nThe movie was lovely. The movie itself was beautiful. The scenery was\nset somewhere is rural England. There are green pastures, a castle and\nbeautiful stone walkways. <br><br>We first meet Lou, a beautiful,charming, bubbly girly girl who is a\nstrong character but maybe a little too comfortable with her current\nlife and then we have Will. Dashing Will! Sarcastic, funny, a little\nmean at first. They are world apart but through fate ( and Will\ndisabilities) they met and slowly realize what one possessed, the other\nneeds. Even if they never really knew it. <br><br>As the movie progress, they falls for each other and we all fall for\nthem. I loved Emily as Lou and Sam as Will. They played their roles\nperfectly and the chemistry between then was undeniable. I think\neveryone should go and watch this movie if you love romantic comedy. It\nis hilarious at times and yet sweet. I assure you that you'll feel\nevery emotion out there with this movie. It's so beautiful. <br><br>Go watch it and judge yourself. For me, this is an amazingly beautiful\nlove story.\n"},
{"review": "\nThe movie really was adorable! I knew exactly what to expect since I\nread the book, but I loved the adaptation. <br><br>What helps the movie most is that the novelist, Jojo Moyees, wrote her\nown screenplay. She did a great job transitioning the story from paper\nto screen. Little things that were left out of the novel weren't really\nneeded to move the story along. <br><br>Both Emilia Clarke and Sam Clafin were excellent. Her facial\nexpressions were amazing and her insane eyebrows deserve some type of\naward all on their own. <br><br>I thoroughly enjoyed the soundtrack as well.<br><br>Don't listen to critics and go see this movie.\n"},
{"review": "\nEmelia Clarke's work on Game of Thrones is the only reason I watched\nthis movie in the first place. She is occasionally transcendent in that\nrole, where she must keep her eyebrows restrained, and I wanted to see\nwhat would happen if her amazingly mobile brows were set free ... free\nas her dragons.<br><br>There are a lot of solid things about this movie. The story (of a young\nwoman who cares for a quadriplegic young man) is strong, the direction\nand cinematography good though not exceptional, the screen writing also\ngood-not-exceptional, the supporting cast (especially Janet McTeer and\nCharles Dance)and leading man (Sam C.) quite good, and the emotional\nnotes it hits, though all predictable and often a bit overwrought (cue\nswelling, heartwarming music...), ring true enough for an unabashed\nromance.<br><br>So, not really my type of movie. But I am happy to say that I was\n(almost) completely taken by Clarke's performance. Her character here\nis nothing like her GoT role, but is in many ways an equally\nfantasy-based role (but with clumsy shyness and striped leggings\ninstead of fireproof skin and dragons) -- and Clarke manages to pull\nthis character out of romantic fantasy into believability as\neffectively as she brings to life her role as Mother of Dragons. She\nhas the combination of charisma, physical beauty, character-acting\nchops, and inner luminosity to pull a fairly nice, 7-of-10 heartwarmer\nup to a 9-of-10 charmer.\n"},
{"review": "\nDon't get me wrong. I like a weepy, romantic chick-flick as much as the\nnext guy. But this one is so manipulative and over-the-top that I felt\nmyself getting hostile about a third the way through. It took\nself-control not to make rude comments at the screen.<br><br>Part of the problem is Emilia Clarke. He character is modeled after the\nBrigit Jones style of self-consciously, klutzy, heart on her sleeve\nheroine that holds appeal to many viewers. Clarke's acting is filled\nwith so many facial tics it almost becomes unintentionally comic. If\nyou shaved Ms. Clarke's eyebrows, she'd convey no emotional range. But\nwith them, she'd be a natural silent movie actress. Her eyebrows\nliterally stole every scene they were in.<br><br>The music, especially the segments used between scenes goes beyond\nintrusive. It is downright offensive. If a character is about to die\nand is falling in love, do we really need an overwrought vocalist\nsinging \"Oh poor me, I'm falling in love, yet I'm about to die.\" This\nis like a Greek chorus with one eye on the AM playlist. I'm\nexaggerating here, but the point is real. We don't need treacly vocal\nmusic to mimic what we've just seen. Most of us got it the first time.\nYou need a break between scenes? Instrumental segues would work just\nfine, thank you.<br><br>I've given this a \"2\" out of 10. In every way this big budget film\ndeserves a rock bottom \"1\" for its manipulative and overdone approach.\nI've given it the extra point for the lovely location shooting. At\nleast the castles don't have eyebrows.\n"},
{"review": "\nI loved this movie. It stayed very true to the book and I love the\nbook. I think Emilia Clarke was born to play her. I feel like she was\njust playing herself cause she has a personality like that in real\nlife. It was pure joy to watch her play Lou. The expressions she makes,\nthe way she talks and most of all, her amazing clothes! I loved every\nsingle outfit she wore. This film made me laugh and it made me very\nemotional, just like the book. I think Sam Claflin was also born to\nplay Will. They had an amazing chemistry throughout the entire film and\nthe rest of the cast is also spot on. There are of course some parts\nfrom the book that were left out but nonetheless, this film was still\namazing. I also want to point out that the soundtrack of the movie is\namazing as well.\n"},
{"review": "\nSPOILER WARNING The acting was all outstanding, give them a 10. The\nstory missed, give the writers a zero. Will has every thing going for\nhim, a great job, a fantastic girlfriend and a rich family. His life\nchanges in a fraction of a second. He becomes bitter and reclusive\nturning away his girlfriend until she leaves him for his best friend.\nWill is a wimp of unbelievable proportions. \"Oh poor me, I'm rich, have\ntwo living and supportive parents, a job to return to and a girlfriend\n(Louisa) as hot as they come, who loves me unconditionally. I'm not the\nman I once was. My only option is to kill myself.\" Oh, give me a break.\nWho is the same person they use to be? This movie had an opportunity to\nhave Will realize what he had to offer his family, friends and Louisa.\nWhere was the creative people and writer on this one. I will close with\none word, Stephen Hawking.\n"},
{"review": "\nAt times I feel that humanity has forgotten, or never really knew, what\nit is to really love someone. Jojo Moyes obviously isn't one of those\npeople. Love isn't the lust we feel at the beginning of a relationship.\nIt's not the thoughtful vision we compile of what the future could be\nlike or how compatible we are. It's not about how financially\nsuccessful a prospective partner is. It's certainly not all about sex,\nalthough it would be hard to come to this conclusion when the media\ngenerally plays strongly to that idea. It's the undeniable,\noverwhelming pull from our hearts that grows only when we really let\nourselves care about someone unselfishly. <br><br>Thank you Jojo for playing this out so beautifully. Thank you Emelia\nand Sam for either knowing this experience or fabulously, convincingly\nportraying it on screen. This movie is a treat to watch and a glimpse\nof what it feels like to be a person who lives their life with a moral\nconscience, an open mind, a respect for beliefs that are different than\nyours and a desire to see the best in the world. <br><br>I feel absolutely cleansed of negativity after watching this and my\nhope for the world is renewed. A glorious experience!\n"},
{"review": "\nOnce again, Emilia Clarke does not disappoint. The acting truly was\nbrilliant. Both on her part and on Sam Claflins part. The film reminded\nme of The Untouchables a bit. It was a very pleasant sight to the eye\nto see the bond forming between Will and Lou. Decent amount of humor as\nwell, found myself laughing quite often in fact. It is nice to\nsometimes be able to empathize with the characters as well. I can't\nreally think of anything negative at this point either. Maybe that most\nof the movie was kind of predictable. The ending, however, might not\nhave been as predictable. I didn't want to go to this movie myself, but\nwas asked to see it. In hindsight I'm glad I tagged along, because I\ndid really enjoy watching it.\n"},
{"review": "\nthe art of Movies should give people hope, instead; this movie is a\nhope killer. this movie is saying \"live Boldly\", unless you are are\nwith disability !! what about real people with real disability who will\nwatch this movie? the movie makers are telling them that it's better to\ndie than to struggle in life !!<br><br>We have many incredible examples for people with disability like (for\nexample) stephen hawking, whose disability was even greater than\n\"will\", hawking couldn't even speak or move his head. but he he is one\nof the greatest scientists in the world. <br><br>Many moments in the movie are cheerful &amp; touching, specially Lou who is\nhilarious funny &amp; very innocent; however, the message the movie\ndelivering is terrible.\n"},
{"review": "\nI liked this movie. I like the dialogue its quite charming and the\ncomedy bits work really well .I was pleasantly surprised that there\nwere not cliché moments and the flow of the story came naturally . The\n2 main characters have great chemistry and Emilia Clark is simply\nadorable .Its a simple story told well.<br><br>The director of the film did a good job overall however there was 1\nproblem with this movie and that was the soundtrack they used . Except\nthe 2 bits of classic music the rest of it was simply abysmal and it\nreally hurt the movie . It gave that cheesy soapy feel of a telenovela\nepisode.<br><br>But getting past that i really enjoyed this movie more then i thought i\nwould and i would recommend watching this . Have fun!\n"},
{"review": "\nI have never read the book so did not know the ending of this story\n(which I will not give away). I suggest however, that nobody watch this\nfilm without at least reading the synopsis so they know how it ends -\nit may change your mind about watching it in the first place or at\nleast prepare you for one of the most tasteless endings in a film ever.\nThe problem is that the movie is so sweet and monotoned that the\ndepressing ending both assaults you and offends. It is not giving\nanything away to say that the male character is contemplating Dignatas'\nservices. With no judgement whatsoever on this it is important to note\nthat this is a compassionate organisation, but according to all media\nfar from luxurious. The book may have dealt in detail with the realty\nof disability so deadly or degrading that the sufferer feels deeply\nthey need release. However, this movie treats the illnesses associated\nwith the male character's disability as intermittent blips in an\notherwise improving quality of life. It leaves such a bitter taste in\nthe mouth because the conclusion is that a valuable life must be\nexpansive and in an able body! Being close to parents, loving\nunconditionally, life unexpected are failures. It is a shame as the\nperformances are great - if the movie was a real romcom with a joyful\nending or a serious drama with a tragic twist this story could have\nworked - unfortunately, it was neither; rather it was an amusing film\nthat meandered off the side of a cliff with a thud...\n"},
{"review": "\nThis is a sweet combination of all factors in the movie; the actors,\nthe actresses, the choices of the places, the story plot, even the\nsoundtrack. I love every single of it. Expect to feel warm and\nheartbroken at the same time in the movie. It's been says after\nwatching it, I still cant stop thinking about this movie. You'd better\nwatch it with someone who could provide a shoulder to cry on for you...\n:)) My favorite (which seems to be everyone's favorite as well) is\nduring the wedding ceremony where Will seemed so alive again. My most\nheart-breaking scene is when Will said \"will you be here?\" on the last\nscene. That is when I burst into tears a lot. like A lot.\n"},
{"review": "\nOne of the most romantic films I have seen for some time. Of course its\na weepy, and how I blubbed, though I have previous in this regard, but\nit also swells the heart and leaves you with a beautiful warm glow.\nThis should make real stars of the two main players with Claffin\nexcellent as someone who's life has been destroyed by an accident\nleaving him not just paralysed, but also without the will to carry on.\nBut the true stand out is Clarke, who's unquenchable cheerfulness and\nsunny outlook on life in the face of his depressed hostility has to be\nseen to be believed and maybe starts to turn him around? A lovely film\nwith a beautiful ending.\n"},
{"review": "\nI was expecting the usual American love story, but that's not what this\nis. I have neither seen nor heard of these actors prior to seeing this\nfilm. That said, I usually don't go to see films like this.<br><br>What a wonderful movie! The acting was so well done. My heart broke\nwhere it needed to break, and it laughed where it needed to laugh. <br><br>For those who need help working on their empathy, or the opening of the\nmind, this is a very good movie to see!<br><br>It's very thought provoking and I would even suggest to professors\n(philosophy,english,cultural perspectives in science, sociology) that\nthey have their students write a paper on this. There are so many\nissues involved here. Great for discussion!\n"},
{"review": "\nI have already read the book, so I decided to most definitely see the\nmovie. I think that they did very well on a book to movie adaptation,\nbecause they didn't change too much from the book. The movie was\nbeautifully made, and fit just what I and others who have read it in my\ncity had pictured for the movie.<br><br>The casting was brilliant, as with the portrayal of Louisa and Will.\nBoth characters were charismatic, and enjoyable, and matched the\ndialogue of the book, which I thought was great.<br><br>The movie itself was heartbreaking, hilarious at points, and just and\nlovable. The story itself is well thought out and great. One of the\nbest things about this, is it is not just your usual love story. The\nreal love doesn't take over the whole plot. It isn't fully made to feel\nintimate, but just to feel real.<br><br>So I say: Go see it. If you are a boy or girl, it doesn't matter. This\nmovie is memorable for everyone.\n"},
{"review": "\nMe Before You is an outstanding adaptation of Jojo Moyes' novel about\nLouisa taking care of the moody and pretentious Will Traynor. The book\nitself is very detailed and gives you all the specifics about their\nrelationship and this is also seen throughout the movie. I had waited a\nlong time after reading the book to find out that the movie is coming\nout featuring Sam Claflin and Emilia Clarke. What more could be better\nthan Finnick from the Hunger Games and Daenerys from Game of Thrones?\nTheir chemistry for one another is astounding. Even though some may see\nthis as a cliché movie where Louisa finds Will love and expresses it\nthroughout the movie whilst adding a lot of humour, it's the ending of\nthis movie which changes a lot of views and perspectives. For me\nespecially, I found it very emotional as did many who watched it\nbecause you expect there to be a happy ending. Even though the ending\nwas still very good, I feel as if the movie is very rushed and you'd\nexpect there to be more. I feel like a whole lot from the book could\nhave been added to give the audience more awareness as some things were\nconfusing and you'd have to read the book to understand. Nevertheless,\nthe movie was amazing and heartbreaking to say the least and I do think\nit is a special thing for everyone to watch.\n"},
{"review": "\nMe Before You was great, but the main attraction was Emilia Clarke she\nis beautiful. The movie would have been terrible without her. I loved\never single second of this movie it was by far a triumph. You have to\nsee this movie to believe it is a great masterpiece.<br><br>Parents this is a British love story so there might be some things you\nmay not want your little ones to see but they will probably see it\nanyway. It was stupendous you will fall in love with Emilia Clarke. She\nis wonderful.<br><br>I have seen a lot of love stories but never one this good before it is\njust mind blowing thanks to Emilia Clarke. She will just wipe you off\nyour feet she has a gift and that gift is to act.<br><br>You and your family will love this masterpiece\n"},
{"review": "\ni have watched very little of the movies which were based on any\nROMANTIC BOOKS like \"The Fault in Our Stars\", but this movie is and\nwill be one of the Greatest and one of the Best Romantic Movie I would\nhave ever watched.<br><br>I have watched Emilia Clarke, playing the role of Lou Clark, in some\ngreat movies and of course Game of Thrones, it was good to see change\nin the type of Role she played in this Movie. I and many audience has\nmade an image of Emilia Clarke as a strong and Bold Character playing\nactress( well according to me only) as she had the recent movie of\nTerminator: Genisys, and the famous Khaleesi/ Mother of Dragons.<br><br>Sam Claffin on the other hand did a tremendous job, he did his Homework\nvery well, according to me he painted the perfect portrait of Will\nTraynor as a person who was full of life and how his life suddenly\nchanges because of the Accident. He also acted well as we can certainly\nsee how a person gets Cranky when something he had lost in his life\nwhich he cherished and loved.\n"},
{"review": "\nMe Before You is a romantic drama film directed by Thea Sharrock based\non the novel by Jojo Moyes with the same name. The film stars Emilia\nClarke, Sam Claflin, Jenna Coleman, Charles Dance, Matthew Lewis, Ben\nLloyd-Hughes and Janet McTeer. The movie is about a girl named Lou\nClark who is desperate for a job and so the goes on to take care of a\nrecently paralyzed man from a rich family, who she slowly creates a\nbond with. This is a well made movie with amazing performances all\naround, especially by the amazing Emilia Clarke who gives a wonderful\nperformance on the leading role. By her side is Sam Claflin who plays\nWill Traynor, and he does a very good job too. It is a movie filled\nwith heart breaking emotional scenes, very good cinematography and a\nbrilliant score by Craig Armstrong that makes Me Before You as a whole\none of the best romances there are. Sure it has some problems, and the\nending will leave some people confused and angry but overall this movie\nworks on so many levels that those flaws are hardly even noticeable as\nthe good outweighs the bad by a lot.\n"},
{"review": "\nThe story is exceptionally moving and made me empathize Will and Lou\nvery much. After watching a film one question has torture me: how is it\nliving full life and then all of a sudden become enabled? All your life\nis separated into two parts \u0096 before and after. How do the relatives\nand friends feel when they see that person suffers every single day?\nIt's awful and scary. Really, really scary\u0085<br><br>Undoubtedly, the movie is mawkish, though there exists a clear line\nbetween soppy drama and sweet girlish melodrama. Of course, there are\nlots of ridiculous moments and stupid dialogues, strange behavior, but\neverything is so harmonious that you may forgive all the flaws. <br><br>Sam Claflin was brilliant. He coped with role easily. The actor managed\nto convey all the difficulties faced by the paralyzed people. Both\nmoral and physical. Emilia Clarke was too eccentric. I realize that it\nwas so according to the script in order to show her the immediacy and\nease. However, as for me she looks far too sweet.<br><br>In general, the movie turned out bright and pleasant. I think I will\nreconsider this story more than once and get a maximum of emotion the\nsame I had in the dark cinema hall.\n"},
{"review": "\nOne of the best Romantic movies lately.. I am very taken with Emilia\nClark's performance and smile. She was amazing and breathtaking. The\nmusic is well chosen and the acting is good and there were some very\ntouching moments that will make the audience who didn't watch yet cry.\nLou is a funny young woman who wants to live a simple life, who wants\nto wear clothes and be fashionable in her own way. The paralyzed man is\na damaged cause looking for hope. Both these characters are very\ndifferent, yes they pick things from each other and they put smiles on\neach others faces. A couple that wouldn't get bored giving and taking\nto their souls.. Maybe, when it comes to believing in love\nunconditionally, Faith is hope then. Live the life as it faces you\nthen. In health and sickness. In the sweetest moments and bitterest\nones. Just live your life No matter what happens to you. Always get\nback and fight to survive and be alive. That is what this movie is all\nabout...\n"},
{"review": "\nAll movies can be scrutinized for faults, as some reviewers have done,\nbut if the movie makes a mark, then those faults really don't matter,\ndo they? I found the \"angry\" Will Traynor not completely believable,\nnot like the anti-social Jack Nicholson in As Good As It Gets, but Sam\nClafin did well with his transformation. Emilia Clarke was absolutely\nwonderful and I will be on the lookout for other roles she has taken\nand will undertake in the future. Kudos also to the characters who\nplayed Will's parents, Janet McTeer and Charles Dance. Two thumbs up\nfor the movie. Am seriously considering whether the movie ought to bump\nanother movie off my favorite 50 relationship movie list.\n"},
{"review": "\nYou know when you actually feel GRATITUDE to Hollywood and incredible\ntalent? This is it. <br><br>After laughing and crying, this film left me feeling like I'd actually\nexperienced something for a change. Emilia Clark is an absolute\ndelight! Sam Claflin was perfect. I can't remember the last time I've\nseen such a movie that left me feeling so emotionally drained - in a\ngood way. Emilia is so animated and she is now one of my favourites.\nThe script is amazingly well written -- one of those that makes you\nforget there even IS one, the actors deliver the story so well. From\nthe production to the directing to the editing - I can't see how they\ncould've done a better job. A must-see for sure.\n"},
{"review": "\nI get it that the rating isn't THAT great. I get that the movie did not\nreceive a lot of appreciation.<br><br>I was even hesitant to watch it, but I thought of giving it a try.<br><br>And I was amazed. What a MOVIE! The happiness she propagates.<br><br>The sadness she faces when she fails to do what she wants to.<br><br>She, wearing the yellow-black socks. Wow! And Longbottom looks very\ncool, in the \"Jealous Boyfriend\" look.<br><br>There is no way any other actress could be cuter than Emelia Clarke.<br><br>Brilliant movie.<br><br>A must watch. :)\n"},
{"review": "\nA question that often goes around is \"What is art?\". And looking,\nthroughout history, what was considered \"art\" it seems we are far away\nfrom the consensus on this question. But most people would agree around\na general notion that art is something that makes you feel, that makes\nyou think, that sparks a fire inside you, that transforms you. And this\nmovie, in my humble opinion, does all of that, therefore deserving to\nbe called \"a piece of art\". In the age of information overload where we\nusually forget what we had for lunch two days ago, this movie will stay\nwith you for a long time after you leave the cinema. And that's the\nbest recommendation I can give.\n"},
{"review": "\nWell, sure it is a sweet loving and touching story but I was totally\nsurprised by Clarke's performance. I found her giving a lot of effort\nto be a sweet/innocent/naive little girl/woman. During the film, she\nnever stops smiling (sometimes it gets really awkward), her\nrelationship with that other guy is far away from any other 7year old\nrelationship according to her choices and generally how she deals with\nit.<br><br>Claflin is wandering from scene to scene and I truly found it difficult\nto feel his situation. He is also - oh yeah - smiling inexcusably\nthroughout this film and I overall thing that this movie came to an end\nwith a really immature way in a point that the film really\nunderestimated any viewer's sense of logic.<br><br>Just give it a try on a Sunday evening but in my opinion it's\ninevitable for you to attach yourselves with these characters, feel any\nsympathy or a feeling for cry. Just a blunt mediocre film. Pity for\nClarke. I was expecting far more from her.\n"},
{"review": "\nThis film tells the story of a young woman from a socially\ndisadvantaged family, who gets a job as a carer for a wealthy young man\nwho suffers from quadriplegia after a traffic accident. They develop an\nunlikely bond, until things take a terrible turn.<br><br>\"Me Before You\" is rather strange because the main character, Clarke,\nis rather strange. She has a very unusual fashion sense, yet she wants\nto study fashion. Fortunately, the guy, Will, is very amicable and\nlikable. Their acquaintance and the subsequent bond is actually quite\nconvincing and engaging. It has a touching plot, and it made my eyes\nwell up. I enjoyed watching it.\n"},
{"review": "\nAdapted by Jojo Moyes from her 2012 novel of the same name, 'Me Before\nYou' is a moving love-story, that touches your heart. Its got its\nemotional moments, but its the film's lighthearted tone, that makes it\nwork.<br><br>'Me Before You' Synopsis: A girl (Emilia Clarke) in a small town forms\nan unlikely bond with a recently-paralyzed man (Sam Claflin) she's\ntaking care of.<br><br>'Me Before You' is about living life &amp; how love, can actually make\nthings better. Over here, our leading-man is paralyzed, but he finds\nsome hope when our leading-lady offers some hope &amp; also love as their\njourney progresses. Even though the happiness doesn't change the\nleading-man's decision to eventually leave the world, he beautifully\nquotes to his love \"live well &amp; consider your possibilities in life as\nluxuries\". Now, isn't that beautiful &amp; so true. <br><br>Jojo Moyes's nicely adapts from her own novel &amp; delivers a genuinely\naffecting tale about love &amp; loss. Thea Sharrock's Direction is\nrestrained. Cinematography is top-notch. Editing is decently done. Art\n&amp; Costume Design are fabulous. Craig Armstrong's Score is top-notch.<br><br>Performance-Wise: Emilia Clarke &amp; Sam Claflin are the life &amp; soul of\n'Me Before You'. Both deliver heartwarming performances. Sam makes you\nfeel his pain &amp; how life has done him wrong, while Clarke steals the\nshow as the innocent &amp; kind-hearted young girl. Their on-screen\nchemistry, also, is quite good. Janet McTeer &amp; Charles Dance are\nremarkable as Sam's parents. Matthew Lewis is superb as Clarke's\ndim-witted boyfriend. Steve Peacocke lends wonderful support as Sam's\ncare-taker.<br><br>On the whole, 'Me Before You' is definitely worth watching. It makes\nyou smile as well as makes you cry.\n"},
{"review": "\nJudging by the trailer for Me Before You, you already know the kind of\nride you're in for. It's a tear-jerker about a quirky girl who takes up\na job looking after a cynical paraplegic. It's not long before they\nfall in love with one another, despite their differences, and it either\nends happily ever after or in tragedy.<br><br>I won't reveal which of these endings are true, however I must say that\ndespite the predictability of this film, there are certain themes in\nthe movie that I wasn't expecting to delve into. Without exposing too\nmuch, the issue of euthanasia crops up and whilst it's a polarising\ntopic, I think the film deals with it in a very fair and two-sided way.\nBoth sides of the coin are justified and it's a very complex theme that\ndoesn't have a simple answer.<br><br>The acting is effortless and real between the two main characters. Lou\nClark is played by GOT's mother of dragons Emilia Clarke and Sam\nClaflin plays Will Traynor, who you might recognise from The Hunger\nGames franchise and Love, Rosie. The film is actually based on a New\nYork Times bestseller by Jojo Moyes who also wrote the screenplay. I'm\na big fan of novelists writing their own screenplay adaptations as I\nbelieve that no one knows their own story and vision like the person\nwho wrote the original text.<br><br>This isn't a film that you can expect big things from, but it tells a\nsweet story that's funny, sad and inspiring in some ways too with many\na lesson to be learned.<br><br>motherofpopcorn.wordpress.com\n"},
{"review": "\nWarning!!! The film deals with heavy themes that may contrast with your\nreligious or personal views, or be personal triggers, such as: suicide,\nassisted suicide, emotional and physical disabilities, and the\ninability of coping with said disabilities. It's bound to rankle\nfeathers.<br><br>The film is charming, quirky, and depressing. It's definitely a film to\nwatch with the girls, the beau was only mildly interested. Like many\nromances, Me Before You follows the basic formula, but hits the right\nnotes to sucker punch you in the feels. Rich boy meets quirky/normal\ngirl, girl attempts to \"fix\" boy, they fall in love. But there's a\ntwist, girl can't \"fix\" the crippling pain and massive amounts of\nself-loathing boy experiences.<br><br>Verdict: \"Glass of wine, tissues, and a girl's night in\" kind of movie,\nnothing more.\n"},
{"review": "\nLouisa Clark is played by Emilia Clark of Game of Thorns as a funny and\nfun loving free spirited who lost her waitress job and has to find the\nmoney fast. As her father is unemployed and encouraging sister going\nback to school.<br><br>Plus stuck with an controlling boyfriend very health conscious named\nPatrick. But her life and the man she is suppose to take care of named\nWill Trainor played by Hunger Games Sam Clafin who used to live an\nactive athletic life.<br><br>Now is paralyzed over a road accident and is bitter and angry at the\nvegetation state he is in. At first working for him and his rich family\nget off to a very tough start.<br><br>But she manages to win him and his parents over with her positive\nattitude. As he slowly yet surely begins to open up. As both fall in\nlove, they have to face lots of hurdles and something that Will wants\nthat neither his parents nor Louisa does not want for him. <br><br>Really a love story and a tear jerker. Go see it.\n"},
{"review": "\n-Me Before You is a 2016 American-British romantic drama film directed\nby Thea Sharrock and adapted by Jojo Moyes from her 2012 novel of the\nsame name. The film stars Emilia Clarke, Sam Claflin, Jenna Coleman,\nCharles Dance, Matthew Lewis, Ben Lloyd-Hughes and Janet McTeer. The\nfilm was released on June 3, 2016 in the United States, received mixed\nreviews and has grossed over $72 million.<br><br>--Critical response: -Me Before You has received mixed reviews from\ncritics. On Rotten Tomatoes the film has a rating of 57%, based on 118\nreviews, with an average rating is 5.6/10. The site's critical\nconsensus reads, \"Me Before You benefits from Emilia Clarke and Sam\nClaflin's alluring chemistry, although it isn't enough to compensate\nfor its clumsy treatment of a sensitive subject.\" On Metacritic the\nfilm has a score of 51 out of 100, based on 36 critics, indicating\n\"mixed or average reviews\". On CinemaScore, audiences gave the film an\naverage grade of \"A\" on an A+ to F scale.<br><br>--Controversy: -The film has suffered a backlash from many people in\nthe disabled community due to what they perceive as an underlying\nmessage that people with disabilities are a burden on their families\nand careers, and claim the film promotes the view that people are\nbetter off dead than disabled. They view the film as advocating suicide\nso that their loved ones can \"live boldly\". The #MeBeforeEuthanasia\nbacklash has been led by celebrities with disabilities such as Liz\nCarr, Penny Pepper, and Cherylee Houston.\n"},
{"review": "\nBefore commenting on this movie I would like to comment on IMDb. Anyone\nnoticed how the majority of the reviews in the first pages are written\nlike paid professionals praising all the aspects of the movie? <br><br>It almost look like you have to start reading from the ending page of\nreviews to get a real review. I will be very curious to see if this\nreview will even see the light of day and if not then I will never\ntrust or even come to IMDb for movie reviews.<br><br>As for the movie... I had great expectations after seeing the trailer\nbut was such a disappointment. First... there is no love story in this\nmovie. The whole movie is about a rich paraplegic man who is so\nimmersed in self pity about loosing his \"tremendous\" past life that is\nincapable of any emotions for the people around him. OK... and a girl\nwho gets attached to him... but settles for some money reward for her\nbroken heart. The movie is predictable, pathetic, has no real drama or\nmessage. The actors have potential but are not believable due to the\nlack of a true love story in the script. What a missed opportunity, I\ncould close my eyes and imagine how this movie could have been written\nto be one of the best, a real dramatic struggle between love and\nphysical pain, rich and poor, life and death.\n"},
{"review": "\nAMAZING MOVIE!! From start to end, the Movie was absolutely awesome.\nEmilia's style was adorable and those heels were stunning. The\nchemistry between the two main actors is absolutely dreamy. SAM Claflin\nis so beautiful and Emilia is a great girl. the movie's non-sexual\nattributes make it even more deserving to watch. I mean, one can watch\nthis Movie With Family members, and even children. The Movie did\njustice to Our culture and traditions too, the praying part before the\nmeal on Emilia's birthday was beautiful. It has become really hard to\nfind wholesome Movies to watch With loved ones nowadays, We truly need\nmore Movies like this one. Great Job and I truly hope more Movies like\nthis are going to be released soon.\n"},
{"review": "\nreally good movie first one to made me cry great performances from\neveryone. Emilia and Sam have a good chemistry. People are saying that\nhe should not have done it, but i think it was is choice, and everyone\nshould respect it, but however he should have give it a harder try. In\nconclusion is a great great movie, well casted and beautiful\nenvironments too. I cant possibly imagine what people whom are disabled\ngo trough. Sam gives a solid performance as a disabled person, in the\nbegging is a smart-ass but then he becomes really cool, which means\nthat Sam is a good actor, and Emilia is great with that goofy look on\nher face and always chating and smiling,\n"},
{"review": "\n23 June 2016 Film of Choice at The Plaza Dorchester Tonight - Me Before\nYou. When quirky Lou Clark loses her job in a tea shop she is left\ndesperate to get a new one to help support her family. Along comes the\nTraynor family. Will Traynor, a quadriplegic needs a carer although he\ndoesn't think he wants one, at this point Lou comes into his world and\nturns it upside down. Will is set on ending his life, Lou discovers\nthis and embarks on a scheme to make him change his mind. Adapted from\na book (which I haven't read yet) we are introduced to two very\ndifferent kinds of people, Will who yearns for the old life he lost and\nsees every day as an empty glass, and Lou who's bubbly personality and\ninfectious smile lead her glass to not only be full, but positively\noverflowing. This is a story of hardship, and of hope and also\nintroduces us to the ethical and very personal struggles of people not\nonly considering assisted suicide but also the family and friends who\nhave no say in the matter but want very much to get involved. It was a\nvery emotional journey, there were many light hearted moments and a\nvery fitting soundtrack. One more point, I noticed I the credits that\nthe producers assistant was Peregrine Kitchener-Fellowes, son of\nDownton Abbey Writer, Julian Fellows.\n"},
{"review": "\nThe first thing I had in mind after watched this movie is that money\ncan buy love. I'm not sure this one is made by Hollywood or not. Cos if\nit's made by Hollywood then I need questioning them how they can make\nthis creepy movie like this. The story line was just so standard, it\njust remind me of soap opera from South America. the actors and actress\njust have bad performance the dialogue was so standard, no words that\nshow the feeling of loss, hope or joy the only thing that good was just\nthe soundtrack. It so wasting my time, I really don't understand how so\nmany say that's a great movie. If I would have known it would end the\nway it did I would never of watched it.\n"},
{"review": "\nFirst time I have written a review but just too say a movie has never\nmade me cry so much that I started to laugh and every time I kept\nlooking at the screen I would start balling again,I'm a 47 year old\nmale who loves action movies and yet this film hit me like a grenade. I\ngave the film a 10 purely on how the movie made me feel. Emilia Clark\nwas a joy to watch throughout the film,you were so believable to the\npoint that when you cried I couldn't stop myself...if a movie can make\nsomeone react in this way,the film has done its job with entertaining\nan audience. I never read the book as I don't read books,so I saw this\nmovie without any knowledge on what to expect.:)\n"},
{"review": "\nMe before you is the best movie of 2016, I'm not kidding!!! I've waited\nso long for this movie after the trailer was out and I'm glad to say\nthat it was way high up my expectations!!! I've watched this movie 2\ntimes in the cinema first time with my friend, second time with my\nfamily and they all loved it. Not a single dry eye out from the cinema\nI swear. It's so touching, funny and all in all it was awesome and the\nbest movie I've seen in 2016, no, best movie in terms of romance,\ntouching-ness after The Fault In Our Stars. Seriously, this movie\nreached the deepest place in my heart.<br><br>The cast, the sceneries and also the storyline just blew my mind. There\nare beyond words on how great the performance of Sam and Emilia was,\nreally. <br><br>If you haven't watched it, I strongly recommend you bring your love\nones (and also a box of tissues) to the cinema and watch it, it won't\ndisappoint I swear!!!\n"},
{"review": "\nMy wife and I were very impressed at the beginning of this movie, and\nthrough the middle. We grew a bit uncomfortable when the young girl\nfinds out the fellow in the wheelchair has decided to kill himself\n(through assisted suicide). At the end of the movie we both felt very\nlet down. Not only did she not succeed in changing his mind, she\nactually becomes happy about it as if life is only lived for moments\nwhen you can really experience something.<br><br>Sad, sad, commentary on life, and very narrow minded. First, I know a\ncouple people who have been injured and confined to wheelchair,\nquadriplegic or otherwise. They took the time to adjust, and one has\nbeen that way for near 40 years and has a wonderful life. He did not\nquit or give up on life, just because his life before the accident was\nso \"Tremendous\" or whatever it was the wimpy dude said in this movie.<br><br>If you want to make a movie about someone with redemption or about\novercoming adversity, then you had best not have the person quit at the\nend, like a whiny cry-baby and try to convince everyone out there that\n\"The world is better off without me because I hate my life now, but\nloved it before...\" That's a cop out, totally and completely. It's not\nan ad for assisted suicide, it's just a dramatic interpretation of a\ndude who gave up, and let everyone down.<br><br>We gave it 8/10 for acting. But, the overall movie is a 2 since the\npremise and the interpretation are so wrong. So, it gets a total score\nof 4/10 compromise from us.\n"},
{"review": "\nAs an aspiring movie producer/director, I was amazed by this film! Yes,\n10/10 is very presumptuous of me and may be a slight exaggeration, but\npersonally I loved every second of the movie and was anxiously dying to\nwatch it all over again the second it ended! This movie makes you think\nin different ways and to think in their shoes, which I LOVE. I also\nmight love this so much because I can relate due to my brother having a\nborn disease where he cannot walk. When people see this film, some of\nWill's ways of thinking are very unorthodox to some and viewers may\nthink the character is crazy, but understanding the life that\nhandicapped people live, I thought it was perfectly executed. This film\nwas a fantastic movie! The location, the actors, the music scorer, etc.\nIt all blew me away and I loved it!!!!! 10/10 would recommend.\n"},
{"review": "\nMe before you stars Emilia Clarke and Sam Claflin and its the story of\na woman (Emilia Clarke) and her story of how she falls in love with a\nman that cannot move either his legs and his arms. Emilia Clarke is\namazing as her character, she completely became her character. I cannot\nthink of another actress that will portray her character, well Daisy\nRidley can because Emilia Clarke's performance did remained me of her.\nSam Claflin was serviceable, he can easily be replaced. The story is\nreally what drives this movie to the top. The relationship between Lou\nand Will is great, you really believe that they are in love. The music\nis used appropriately, only one time it annoyed me but it was once and\nit did not take me out of the film. The cinematography was great as\nwell as the production design. The biggest problem i have with this\nfilm its is 3 act. It is really cheesy and makes the cliché that one\nperson gets mad with one another, and you know they're gonna get back\ntogether and its just lazy writing. Its not awful but it ain't good\neither. Also since Emilia Clarke is so fantastic as her character, its\nreally distracting when she is not in a scene, and you kind off get\nlost in the story. Other than that, I found that Me Before You was a\ngreat film about love, relationships and letting go. Beautiful visuals\nand an unique script made this film the best love story of 2016 (so\nfar). 8/10\n"},
{"review": "\nI loved this movie \u0097 so much so, that I've watched it five times so\nfar!<br><br>I am usually very critical of movies, but not this one. It is a bit\nformulaic at times, but I think the director also shows a great deal of\nrestraint. For example, Will Traynor's mother and father (Janet McTeer\nand Charles Dance) start out as caricatures of British aristocrats \u0097\nstuffy, aloof, unfeeling, even a bit mean. But as the movie progresses,\nyou see them more and more as human beings with deep feelings, and you\nsee that they love each other and their son very much, and that they\nstruggle to do the right thing by their son. They are also very kind to\nLouisa, and despite the class difference, they never betray the kind of\nsnobbery you might expect to see in a less sophisticated treatment. <br><br>There seems to be some criticism of Louisa Clarke (Emilia Clarke) as a\nBridget Jones-type character \u0097 kind of silly, offbeat, \"chatty,\" and so\non. I find her utterly charming. (But then I also find Bridget Jones\nutterly charming.) Louisa is a believable character and not one\ndimensional.<br><br>I love the chemistry between Lou and Will Traynor (Sam Claflin). Will's\ntransformation is not sudden. He actually is intrigued by Louisa from\nthe get-go but doesn't realize it \u0097 he's too busy putting on his act\nand being sullen and angry and self-absorbed \u0097 so it's only when she\nsnaps at him, that he begins to be pulled outside of his emotional\nbubble. It's actually shocking for him to see this other side of Lou \u0097\nthat she's not rigidly upbeat but is capable of anger \u0097 and so this\nmoment triggers the start of a deeper connection. <br><br>I think all the characters are well done, and the only character I\nfound a bit cartoonish is the boyfriend, Patrick (Matthew Lewis). <br><br>It's a beautiful movie, and I highly recommend it. Bring lots of\ntissues, and ignore the naysayers.\n"},
{"review": "\nI thought it was beautifully produced and it was an excellent film.<br><br>I cannot help, but think that we all of us see things differently. This\nis obvious when I read some of the reviews.<br><br>I am really glad I watched the film and I found it uplifting and\ninspiring.<br><br>Emilia Clarke reminded me a little bit of a Bridget Jones type\ncharacter and I will definitely look out for more things she is in.<br><br>There were some notable other performances but Emilia Clarke really\nstood out.<br><br>I will be recommending this film to my friends.\n"},
{"review": "\nNo disclosure of the ending/spoiler, but just to say I think some\npeople (like me) will probably have problems with what is the essential\nunderlying message of this film (which is what brings my rating down\nfrom a 7 or 8). These ratings would be justified purely on the basis of\nthe acting (particularly the female lead who easily 'steals the show')\n(while the other main roles are also occupied well too) and the\ngorgeous location filming plus great sound track. If you want to enjoy\nthese aspects and view a classic modern 'weepie' (without going too\nmuch into what the ending of the film seems to me really to imply),\nthen this is definitely one you will enjoy.\n"},
{"review": "\nLouisa \"Lou\" Clark (Emilia Clarke) makes a cup of tea to solve every\nproblem. She's 26, living at home with her mother, unemployed father,\nsenile grandpa, sister Treena (Jenna Coleman), and Treena's son Tom.\nShe loses her waitress job and the family needs her to get another job.\nHer boyfriend Patrick is more interested in running than interested in\nher. The Traynors are the rich family in town and the former lords of\nthe castle. Camilla Traynor (Janet McTeer) hires her for six months to\nassist her paralyzed son Will Traynor (Sam Claflin) who was run over by\na motorcycle two years ago. Will is bitter at losing his globe-trotting\noutgoing lifestyle with his girlfriend Alicia and high-finance friends.\nHe is cold to the quirky Lou at first. Alicia announces that she's\ngetting married to his former best friend. Then Lou overhears Camilla\narguing with her husband Stephen (Charles Dance) about Will's plan to\nget euthanized in Switzerland in six months. Lou struggles to give Will\na reason for living as male nurse Nathan helps her to understand his\npain.<br><br>This is a sappy romance. There's nothing wrong with that but it's\nreally uninspired in its execution. The best thing in this movie is\nEmilia Clarke being allowed to be her natural goofy-grin self. This\nversion of her is really charming and winning. The infuriating part is\nWill's refusal to live his new life. Nathan explains that Will really\ntried the first year and that he's hiding his painful existence from\nLou. The movie does not do a good job portraying that idea and\ntherefore leaves Will's reasoning bare-thread. They need a scene where\nWill is actively trying to hide his pain. His reason cannot be a lack\nof a James Bond lifestyle.\n"},
{"review": "\nIf you want to watch a story about love, but in a way that make your\ntears come up - that is your movie.<br><br>The story is simple. Rich guy with lost soul and a poor girl with a\nfull hearth met and helps each other to find what was lost in their\nlives until now.<br><br>Everything was going on tracks until the moment when the reality took\nplace and the strong said word had the final dot. But as we all know\nnothing ends and anything keeps living even after dead.<br><br>Simple movie, but with a lot of drama. You will like it for sure! And\nif you don't please watch it again and take the deeper meaning. Enjoy!\n"},
{"review": "\nRecently released out , Me before you , film adaptation by Thea\nSharrock of Jojo Moyes book became really popular these last few\nmonths. At first sight, the cast seemed interesting, and the trailer\nlooked like a typical dramatic love story we are all used to see.\nHopefully, I was wrong about that because it was really different and I\nrecommend you to go watch it if you haven't done it yet. <br><br>The story takes place in England in a small and peaceful town. Louisa\nClarke, 26 years old, works at the coffee shop to help her parents\nfinancially but when she looses her job, she needs to find a new one as\nsoon as possible. After going to the job center, she is proposed to\nwork for the Traynor's quadriplegic son, William Traynor. A job she\nstruggles with because of his bad temper. The situation gets better\nwhen they learn to know each other, and the colorful Louisa becomes the\nonly thing he lives for. But...a big decision changes everything.<br><br>Sam Claffin and Emilia Clarke, both well know for big roles have been\nwell chosen to embody the mains characters. I seriously couldn't\nimagine it could be someone else instead of them. They convey so much\nemotion I couldn't stop watching and I felt like if I was with them in\nthe film. During the whole film, they made me laugh, because it's not\nonly a drama like I thought, they have a really funny relationship.<br><br>The landscapes and decors in the film are really impressing. I\nparticularly liked the scenery around the castle and also the island\nwhere they spent their holidays. <br><br>If you like romance and funny movies, I recommend you to watch the\nfilm. It's sure, you will cry but it's so beautiful, it's worth it.\n"},
{"review": "\n. . . we were delayed in the bank parking lot (so MUCH that we MISSED\nthe first three previews!) by a young chick walking S-L-O-W-L-Y in the\nmiddle of the road in front of us (right next to a perfectly good\nsidewalk) yakking on her cell phone, TOTALLY oblivious to the extreme\ndanger caused by her Solipcistic Sociopathic Behavior. (Naturally, we\ndid not beep her with our car horn, since it was impossible to predict\nwhether such a highly warranted caution would elicit a psychotic\nepisode of Phone Rage on her part, perhaps involving her launching\nherself into our car, causing hundreds or thousands in damages by an\nuninsured pedestrian). Warner Bros. has released ME to warn America\nthat maybe cell phones were fun while they lasted, but they MUST be\noutlawed immediately! Fortunately for us, it wasn't raining this\nafternoon. The motorcyclist who gets traumatized, and totals his bike\nin the drizzle against cell phone-toting \"Will Trayner\" as ME begins\nwas NOT so lucky! (Some women may go through a box of Kleenex during\nME, but most guys will see through this flick as a case of FIFTY SHADES\nOF GIMP meets EYEBROWS WRITHING LIKE SNAKES).\n"},
{"review": "\nThe movie talks loud about the subtle love we feel with each other's\ncompany, the way we get close to someone in no time and we end up with\nthe fondness of the person. Well, the film reminds me of Guzaarish, a\nBollywood film starred by Aishwariya Rai and Hrithik Roshan. The movie\nis based on similar plot. Me Before You is a film about a quadraplegic\nman-Will traynor, a successful, young rich man meeting with an accident\nand losing the ability to move again ends up, being terminally\nparalyzed. Lou Clark, who takes up this job of taking care of Will and\nserving and spending time with him. She is chatty, funny and shabbily\ndressed yet quite simple, sweet and adorable. They both find affection\nfor each other but they cannot continue it. The climax is arguably\npractical where Will takes a decision about his life according to what\nhe had told his parents. Can't say the ending was perfect, but there is\none thing to learn-No matter how small or big, how ugly or beautiful,\npoor or rich-if you spend time with someone and feel for him/her and\nthe other person reciprocates feeling the same, you certainly weave few\nthings into each others heart. Spending time with the one you love is\nthe best thing one can do! be it few months, few weeks, few days or few\nhours, those are the Moments!\n"},
{"review": "\nA girl in a small town forms an unlikely bond with a recently-\nparalyzed man she's taking care of. Me Before you benefits from 2 great\nand sweet performances by Emilia Clarke and Sam Claflin also it's great\nto see Charles Dance in an actual role his screen time is not as big as\ni wanted it to be but still it was really effective and the whole cast\ndid a really good job although some characters don't get enough\nbackstory such as Patrick which is Clark's boyfriend the movie doesn't\nalways count on the dramatic moments which i found it to be really\nsmart because it was really funny and it was so sweet what Lou did for\nWill i'm not a big fan of this kind of films because sometimes they get\nkinda boring or really awful but damn this one was one of the better\nones and all this people that judge the film about Will's choice and\njust find something to brag about such as Emilia's eyebrows they really\nneed to stop with all this besides the film is based upon an actual\nbook so i don't understand what some people expected and the reviews\nfor the film were pretty mixed like a 58% on Rotten Tomatoes. Me Before\nYou it's not something that you haven't seen before but Emilia Clarke's\ncharm and Sam Claflin's very sad and sweet performance as a paralyzed\nman really sells the movie a lot.\n"},
{"review": "\nI saw \"Me before You\" a few days ago and it was just amazing !! I adore\nwatching love stories,with people who fall in love but their love is\nimpossible... Emilia Clarke,in the movie : Louise or Lou is a\nyoung,beautiful woman and really scatty ! And then there is Will,he has\nbeen disabled since his last holidays.He don't laugh,smile but thanks\nto Lou,he discover what's love. I really love this movie,I'm really\nscatty too so I can see myself in the story as the main character Lou.\nI won't say the end of the movie but if you don't like crying don't\nwatch..!Everyone want a wonderful and amazing love story with a good\nhusband,flowers,sparkles in the eyes, butterflies in the stomach.When I\nwas watching this movie I had a lot of emotions. It's incredible how\nmovies can affect people. I love a lot of movies especially horror\nmovie but \"Me Before You\" made me feel sad and happy at the same time !\n"},
{"review": "\nIn a beautiful Welsh town complete with a castle and moat, a young\nwaitress becomes caregiver to a wealthy handsome young man who has\nbecome a quadriplegic due to a traffic accident. He wants to end it and\nshe comes to care for him more than just as a patient.<br><br>Things are kept restrained and light hearted for most of the movie so\nthat when more dramatic parts arrive it is much more effective. During\nthe wedding of his ex girlfriend his pain is quite moving. The\nemotional climax in their tropical getaway is one of the more effective\nscenes in recent tear jerkers.<br><br>Emilia Clarke gives an effervescent likable performance with her quirky\ncostumes. Her character is likable and one that could easily have been\nannoying but she avoids that. Sam Claflin does a good job. Considering\nhe can only move from the neck up for most of the movie he manages to\nconvey all his character is going through. The relationship between the\ntwo is believable and not over sentimental. Charles Dance and Janet\nMcTeer plays his parents. Liked the contrast with her working class\nfamily and their simple pleasures.<br><br>If you can remember the Julia Roberts movie 'Dying Young', 'Me Before\nYou' shows how to take a theme that has been done before but do it\nbetter.<br><br>The issue about assisted suicide is handled well. It doesn't preach but\nyou feel alright with his choice at the end.<br><br>This movie deserved to be a success. Worth watching.\n"},
{"review": "\nWell I don't have pretty much to say, just that *Hats off, well done* I\ngot to know about this movie from my teacher at school (german school),\nwe talk about this theme and she suggest me read the book! I didn't got\ntime for the book, and today I just found on Facebook's page the\nthriller and said to myself *Let's look for this movie on google*, by\nmy surprise I found it online (HD) and straight away look on it! Was\nmesmerizing, outstanding, couldn't keep my tears to not fall down! It's\nreally a lesson of life, and still can't believe it about the end of\nthis story! ... I wish was a happy end, but like real life sometimes we\ndon't get all painted in rose! Thank you for this opportunity guys! And\nGod bless you.\n"},
{"review": "\nMe Before You says the truth about life events Romantic love movies\ntend to end with \"happily ever after's\", but this movie was far from\nthat saying. Me Before you is a well written tragic-love movie from its\ncharacters to the director Thea Sharrock. Sam Claflin plays the role of\nWilliam Traynor a rich 35 year-old, who is paralyzed after an accident\nyears before. William decides after another six months he will commit\nsuicide by Dignities. His newly preppy caregiver Louisa Clarke played\nby Emilia Clarke, tries to understand wills wishes to die, but instead\ntakes him on a journey to understand life's worth living for. Over the\nperiod of their six-month journey Louisa and William fall in love. The\nmovie ends with the tragedy of William deciding to die and leaving\nLouisa sad and alone. Sharrock decided to give the audience the real\ntruth about life. We would want to hope for the best and think that\nthere are such things as happily ever after's; but truthfully that\nisn't the case. Typically, in a romantic movie we are left to believe\nlove can conquer all, but truly it's all false hope. Many critics would\nsay this movie is terrible from its, false hope, and the sad ending. I\nbeg to differ saying this movie is brilliant. In some point in life we\nmust realize happily ever afters aren't real. Thea Sharrock presented a\ngreat film deserving 5 out of 5 stars for the idea of a romantic movie\nwith the truth of reality.\n"},
{"review": "\nThis is one of the most beautiful film I've ever seen. I've had read\nthe book before seeing the movie so I was expecting a lot from the\nadaptation and I can say that Thea Sharrock (the director of this\nmovie) have done an outstanding job! The cast is really good and\nmatches perfectly. We can notice a connection between the main actors\nthat provides more credibility the the story. In addition, Emilia\nClarke and Sam Claflin give us a moving performance during the whole\nfilm. The plot is something that I had never seen before and it's\nsomething very serious. I think that one of the best part of this movie\nis the amazing soundtrack. The crew have chosen indeed the best songs\nto express the atmosphere and the emotion that gives this movie. One\nthing is clear, you can not be untouched after having seen this movie!\n"},
{"review": "\nThis film is another of my favourite films I have watched. I love the\nstory between these two characters. They are so romantic with each\nother. There are lots of emotions in this story. Love, Loss, Happiness,\nSadness. In this story, some parts of so upsetting that I started to\ncry and I don't normally cry at movies. Other parts of the movie were\nfilled with happiness they made you smile and wish that you were in\nthat film. I think that Emilia Clarke and Sam Claflin were perfect\ntogether in this film and so great chemistry. That's why the film was\nso good. People that didn't like this film must have a cold heart. Film\ncritics are always writing about the film so they can't get into the\nfilm and follow the beautiful story line that has been created.\n"},
{"review": "\nI completely disappointed by the movie. I am really crazy about these\ntypes of movies with a heartbreaking love story. But as a fan of\nromantic movies, the message of this movie is so negative. There are\ntwo bad messages in the movie. <br><br>First, the movie is saying to people with real disability that it's\nbetter to die than to struggle in life problems and their disability!!!\nThere are many examples of successful people such as Stephen Hawking\nand Paralympic winners even with a worse disability which proved the\nworld that disability is not a limitation for them. I can't believe how\nthey showed that a disabled person with a great love and very good\nsocial situation killed himself!!! <br><br>Second, another bad message is that money can buy love! They fall in\nlove when they used lots of money and I think it is not reasonable as a\npure love.<br><br>On the other hand, as a positive point, I can mention that the movie is\nwell acted. Specially Emilia Clarke and her facial expressions were\nexcellent and amazing.\n"},
{"review": "\njust saw this, didn't like it that much. it was odd, i don't know. none\nof the characters felt realistic, will was super monotonous throughout\nthe whole film, louis was so cheerful it felt overdone and fake,\nlouis's boyfriend felt like a kids TV show kind of guy. It tried to be\ntouching, but it wasn't whatsoever. and the soundtrack was bad, i love\ned sheeran, but using such popular songs kind of ruins it, and\n''photograph''didn't fit in that scene at all, and that romantic comedy\ntype of music didn't help. Some of the camera work felt odd as well. It\nleft me feeling kind of empty, this could have been a really good\nmovie. it just wasn't moving.<br><br>and doing some research i found out there was a huge backlash against\nthis movie, i mean, people actually protested with placards, because\nthe message and blah blah blah. why would you protest against a movie,\nseriously. And, i don't think the movie delivered the message of being\nbetter off dead, some people just cant overcome their disability. It\ndoesn't mean all disabled people are like Will.\n"},
{"review": "\nMany times we have seen this in the past: A successful author teams up\nwith inexperienced director, add some well-known faces and you are in\nfor a insignificant piece of film making. The story for this one, I\nbeen told, is much more believable and interesting on the pages of the\nbest seller book by the same author that wrote the script. And that's a\nbit confusing as why would a successful piece of literature would turn\ninto a very sloppy, cheesy, inconsequential film. The main problem I\nhave with it is, however, the amount of clichés that keep coming one\nafter other. I found myself guessing all the time which cliché would be\nthe next, which scene would show that this film was no more that a\ncollage of clichés that murder the narrative. The scene when Luisa's\nboyfriend tells her about his plans for a holiday that include all his\nfriends just sums it up. And then there's the characters - small town\ngirl from working class parents that talks with a public school accent\nan has an infinite wardrobe. When I look at the characters I can only\nsee the actors, and that's not good. In fact some of them (Charles\nDance, Jenna Coleman, Joanna Lumley and Diane Morgan) seem to have been\nsigned up only to add well known faces to the cast list - they add no\nvalue as actors to the film. And there's more that I could add that can\nexplain the disappointment of watching these 109 minutes without\nfeeling that you are wasting your time, but I leave it here. In summary\n- Sloppy story telling, questionable casting, poor acting, clichés,\nclichés and clichés. Avoid.\n"},
{"review": "\nBased on the novel of the same name, directed by a new lady filmmaker.\nThis British film has two young sensation Sam Claflin and Emilia Clarke\nin the important roles. The story of a young man who was paralysed\nrecently meets his new caretaker. Initially they both won't fit for\neach other, but after some time everything changes when they together\ndo some outdoor activities. While the film progress, it only gets more\nemotional. Besides, it's fun watching the first two acts, particularly\nthe performances from both the lead strikes strongly.<br><br>After a very long time I watched a good tearjerker, but not that\nstrong. It is a simple story, there's no big adventure or romance in\nit. That's right, it is not a romance film and if you decide to watch\nexpecting one, you will be definitely disappointed. Also slightly it\ndelivers a bad message like the negativity for being one seriously ill\nand alive. This issue is only on the humanity ground, but afterall\neveryone entitled to do what they want, because it's their life.<br><br>Anyway, the film avoids the usual cliché. Like there's no scene that\nyou had seen in other similar theme repeats here. Deliberately avoided\nto make it a fresh piece. Basically, if you observe closely the both\ntwo lead characters, they had a different agenda about their life.\nParticularly the caretaker never ever tried anything seriously to\naccomplish her undertaking.<br><br>On the other hand, those parts were very realistic, but still gives us\na cinematic experience due to the fancy screen presentation. Surely a\ngood watch, I think everyone should watch it, because there's no drugs,\nsexes or nudes or even the strong kissing scenes. Only the main theme\nis something disturbing, particularly for the tender-hearted people.\nOther than that, I hope you watch it if you haven't yet.<br><br>7/10\n"},
{"review": "\nI had high hopes for this film. Whilst reading the book, a friend had\ntried to get me to watch the film as she said it was fantastic! I\nrefused and continued with the book. I grew to love the characters (and\nhate some of them - Patrick for one). And I cried at points throughout.\nWhen I'd finished, I sat down to watch the film. I know, I\nknow....films are never as good as the books....but WoW! This was\nshocking! There are lots that can't be put into a film that are in a\nbook, but if you're going to go to the trouble and the expense to make\na film, do the author justice. So much was left out of the film. Lou's\nsister played a large part in the books, but she was hardly present.\nPatrick, as annoying as he was in the books, was a complete arse in the\nfilm and it felt like that was done on purpose....I have no idea\nwhy...to make Will seem more likable? Bizarre! Large parts of the film\nwould not have made sense without having read the book - .e.g the\nholiday of a lifetime that Lou had to cancel. There was NO mention of\nit at all! I felt really let down with this movie. I LOVED the book and\nam about to read the sequel. Read the book and really don't bother with\nthis. As a side note, Emilia Clarke's eyebrows must have had their own\nscript! Lordy! They put me off a lot of it. And I love her in GOT!\n"},
{"review": "\n\"Me Before You\" includes lush cinematography and a variety of exciting\nlocales for a well-photographed romantic film. The story is about a\npair of star-crossed lovers who sadly met at the wrong time.<br><br>Will Traynor, played stoically by Sam Claflin, is a wealthy playboy,\nwho was paralyzed when struck by a motor bike. His well-intentioned\nparents hire a young woman to help care for Will, hoping that he will\nnot choose to end his life with an assisted death.<br><br>Louisa Clark is the helper, who desperately needs the job to support\nher unemployed parents. Of course, money is no longer the issue when it\nbecomes clear that Will and Louisa are falling deeply in love. The\nmajor dramatic question is whether that bonding will be enough to\nrestore the life force in Will.<br><br>The actress who plays Louisa is a perky performer named Emilia Clarke.\nWhile there may be moments that are over-the-top in exuberance, the\nactress nonetheless conveys a bubbly, brimming-over-with-life quality\nthat makes her a scene stealer throughout the film. If her ebullience\nis not enough, there are jaw-dropping, quirky costumes worn by Louisa\nthat add to her colorful character.<br><br>The scripting of \"Me Before You\" was somewhat bland without truly\nscintillating dialogue. It was the standout performance of Emilia\nClarke that made the film special. It would be difficult to imagine any\nother performer in this memorable role.\n"},
{"review": "\nThis is the best movie I have ever seen, and believe me, I have seen\nhundreds of movies, but nothing is compared to this one.<br><br>Everything about it is perfect from acting to the story line and the\nsoundtracks. Ed Sheeran part, kills me every time I watch it. X\nAmbassadors 'Unsteady' is breathtaking as well. <br><br>I have watched it three times and I feel like it gets better and better\neach time! I hope there will be a second movie, just like there is a\nsecond book 'After You'.<br><br>I have to mention that the trailer is also one of the best ones out\nthere. I literally know EVERY SINGLE word and line they say in the\ntrailer. I just love everything about it!\n"},
{"review": "\nThis movie benefited by the \"halo effect\" of \"Game of Thrones\" (Clarke)\nand \"Hunger Games\" (Clafin) because it is not really a good movie. IMDb\nreaders rated it a 7.5 but I don't understand why, so I assume it is\nbecause everyone loves \"Game of Thrones\" and \"Hunger Games\" and the\nactors in them (except for me). Ms Clarke is annoying; the movie is\noverly long, it is predictable, and I have little sympathy for any of\nthe characters. Clarke does not stand up to her unemployed father and\nsister who wants Clarke to work to support the family so the sister can\nescape. And although Clafin is horribly injured and one should\nempathize with his plight, it is not easy to forget that he got injured\nsoon after leaving his girl friend's bed and was hit by a motorcycle\nwhile absorbed by his smart phone while crossing the street. Moreover,\nhe and his family have more money than Trump.<br><br>The story is an old one. Quirky young woman cares for person with\nphysical problems. It was done much better in \"Dying Young,\" \"You're\nNot You\" and \"Passion Fish.\" I recommend these three, especially the\nlatter two and forget \"Me Before You.\"\n"},
{"review": "\nThis was shaping up to be a realistic and powerful story, especially\nwhen Louisa told Will that killing himself was selfish. She was right.\nThen the film veered into the realm of fantasy, where Will was\nportrayed as finding peace in an act of utter selfishness. He threw\naway the gift of life and love. There can be no peace in that. There\ncan be no peace for those who witness that. I am reminded of the young\nwoman who wanted to kill herself because her mother had never loved her\nbecause she was a girl instead of a boy. Those who were so caught up in\nthe culture of death though it was such a wonderful thing that she\ncould be free to end her life. All that this woman needed was someone\nto affirm that her life was worth living. This film distorts reality\nand is a symptom of a narcissistic and individualistic culture that\nsummed up in the title of this film: \"Me before you.\"\n"},
{"review": "\nI always look for movies that have everything a romantic movie should\nhave. <br><br>The romantic and chemistry,between the cast. The touch to the\nviewers,making us feel we are with them. The comedy, to make us laugh\nand smile. And the most important part,the big moment.When we feel the\nlove between them and we get all the smiles out of us with our hairs\ngoing up making us feel everything for them and wishing that this love\nis real that we could all once feel it with someone else, the part\nwhere they show you its possible for everyone to find their special\none, the moment when you look at them and just say smile with hope,\nhoping that they stay together forever<br><br>From all of this i am saying that this movie is one of the best\nromantic movies out there having everything in it and that watching\nwill not disappointing.\n"},
{"review": "\nI urge anyone who has or knows someone who has suffered spinal cord\ninjury to not watch this movie. It is accurate maybe 30 years ago but\nnot today. Though true that spinal cord injury does not have a cure it\nis NOT a death sentence for everyone and would not have been for a man\nof WillTraynors injury or income. The one factual thing in the movie\nwas made a joke and that is Clarks boyfriend recommending exercise and\nrehab. It's not funny I'm worried folks with injuries will see this and\nrelate to his negative attitude and that's unfortunate. It's hard but\nnot impossible or even boring to live with spinal cord injury. And you\ncan have a family the movie doesn't rule this out directly but hints at\nits impossibilities which is wrong wrong wrong.\n"},
{"review": "\nSuch a strong cast Clarke, Claflin and Dance and they did an amazing\njob. Throughout whole movie you have cheerful and funny scenes. As\nLouisa and Will get to know each other they start to feel very\ncomfortable and tend to have a great time together, opposite at the\nbeginning when Will treated her like sh*t. Then Louisa find out truth\nthat he is only going to live certain period of time and then decided\nto take his life out. She keeps trying and loves him even more despite\nall that but his foolishness and selfishness is beyond every limit. We\nare humans and we tend to life no matter how hard it will be there so\nno human with right mind to kill himself because he can't do something\nand doesn't feel valuable anymore. And that is just unacceptable and\nprobably all people need to agree with this and see that there is a\nproblem with taking your own life. Only thing that will happen you will\nbring pain to other people. Twisted and disturbed thinking of\nindividual like Will should not be accepted as right. Despite all that\nending was somehow peaceful with mixed feeling that were tending to\nhappiness. 6.4/10\n"},
{"review": "\nSo Me Before You consists of a very sensitive subject and for that, has\nreceived a lot of criticism. Putting my own views aside, this film is\nso charming and touching - really, one of the most moving films I have\never watched (can't remember one as emotional as this). <br><br>Lou, the main girl, is Daenaryus (spelling?) from Game of Thrones and\nher role couldn't be more opposite but I'm glad that it is - she is a\ntotal nerd, quirky yet witty and lovable all at the same time.\n*Spoiler* One of my favorite scenes was when she opened her birthday\ngift from Will and was absolutely shaking with excitement at the bumble\nbee tights he gave her. Her reaction was seriously heartwarming and\nhilarious and not to mention the beautiful smile it gave Will was\nenjoyable.<br><br>Will, the main guy, is so believable - from his depressed, bitter and\nsarcastic attitude in the beginning to the inspiring and witty man he\nbecomes after meeting Lou. He doesn't smile often due to his\nunfortunate circumstances but when he does, boy, it lights up an entire\nroom honestly. Love that guy!<br><br>I bawled my eyes out in the end, almost sobbing uncontrollably it was\nso moving. This film has stayed with me long after I'd first seen it\nand will continue to long after I move on. I only discovered it last\nweek and have watched it three times already. Of course, this is my\nfavorite genre and so it's very appealing to me. I also just got my\neyelash extensions done and have had to be very careful in how much I\ncry. <br><br>Lovers of the romantic/comedy drama will not be disappointed and will\nabsolutely fall in love with this film!\n"},
{"review": "\nI never thought I'd watch a movie and laugh and cry at the same time. I\ndon't know how the actors were selected but I must say the combination\nis a miracle. I wish I knew Emilia Clarke (Lou) personality to figure\nout the gap between the real her and the character she played in this\nmovie. After watching this movie, I became so emotional. I felt love\nand loved. I watched it alone and wish I did with my girlfriend.\nAlthough the ending got me nervous, it was cool. I couldn't think of\nsomething better. Big thumbs up for the whole Me Before You crew. You\nguys did it. I wasn't a big fan of love stories but now, that's where\nI'm heading.\n"},
{"review": "\nI'm a guy, and by definition I will act as one, meaning: no movies\nabout complicated love ever... But if you have to watch one, watch this\none (that's what I did and I don't regret it for a single second).<br><br>Why? I'll tell you why: Emilia Clarke's portrayal of \"Clark\" is\namazing; she's sweet, caring and above all: she makes you feel\npeaceful. Her role as Daenerys Targaryen in Game of Thrones prepared me\nto anything but not to this. You laugh with her, cry with her and most\nimportantly: live with her. Her eccentric dresses, her smile and\nespecially her eyebrows radiate so much sincerity that it makes my\nheart ache with happiness. <br><br>Pace by pace, step by step, you follow her difficult journey through\nher life as the caretaker of a young, rancorous, disabled young man who\njust wants to stop living. She's able to give him a taste of what life\ngood be and what good it still could bring. <br><br>This movie moved me with tears, but the good kind; the kind that leaves\nyou wanting more of those movies, the kind that takes your breath\naway,, the kind that will make me watch all of the next Emila Clarke's\nmovies.<br><br>I sincerely hope you'll enjoy this movie as much as I did, because it\nwas magical and unique.\n"},
{"review": "\nThis is not my first choice for cinema type of movie, but it was end of\nthe month and had to spend last movie club ticket or losing it. I went\nout shocked about casting because I was used to see him as Finnick and\nshe was something like -I've seen her before but not sure where...,\nwon't tell you exactly because she has a great looked change after her\nprevious work, specially her colorful role in this movie. The story\nitself, it's well a known one, with some modern notes that brings it\nclose to our reality and I meant it because her boyfriend style of man,\nany similarity with someone you know it's on purpose, how she reacts to\nthat leaves room for discussion undoubtedly. The sister paper is key to\nher decision making process, kind of a fairy role. Landscape and\nsituations spots are a must have for the story as usual requirement of\na love comedy, also completely covered the steps of such an illness and\ncharacter reactions to it, technology is also a fundamental key on this\npart. I proudly say, I almost cried at some point, despite I knew I\nwould and resisted to, and that's exactly why I recommend this movie.\n"},
{"review": "\nI was totally ready to get into this story and enjoy it. I'm afraid\nthis movie is terrible.<br><br>The first thing is Emilia Clarke which did a terrible terrible acting\njob. She always had the same smirk on her face in any situation, sad,\nhappy, annoyed. The director did a terrible job of directing her.<br><br>I also did not buy for a single second their supposed love story. The\nthird act is not working at all. You don't understand her motivations,\nher feelings and it just didn't work. You don't understand why she does\nthe things she does. <br><br>Actually the movie progressed in a way for the first 3/4 of the movie\nthat I could not see them fall in love in anyway. And it was not clear\nif she fell in love and if yes why etc etc..<br><br>Very disappointing movie.\n"},
{"review": "\nI watched the movie first, then read the novel and watched the movie\nagain as I was about to finish reading the novel. I really love the\nauthor, Jojo Moyes. I love her writings and it is a great combination\nof humor, romance and life lessons. There are many scenes that would\njust make me burst into laughter. I love the casts! Sam Claflin and\nEmilia Clarke is a wonderful match. They look so great in this film. I\nthink one important part in the novel that shouldn't be left out in the\nmovie is when Lou decided to move in with Patrick. I think that's quite\na big point where we could see Will wasn't able to hide his feelings\nanymore. I think it can build more tensions b/w the characters. And the\ntattoo part probably should be in the film as well. It's really\nadorable. Anyway, really enjoy the movie!\n"},
{"review": "\nI loved this film.I've seen it twice in one day.It's just amazing.I\nstill crying after 2 days.I cry even with the song \"Photograph\".I\nrecommend this movie to everyone.I learnt so much from this movie.I\nabsolutely loved it!It has been my favourite movie!Emilia Clarke and\nSam Claflin were just amazing.I believe it is a film which has very\nmuch to teach.And another important thing is that it is very\nrealistic.The end is just amazing.I confess that I didn't wait this\nend.BTW I don't think that I could see a similar movie again.It's just\nsomething rare and special.I loved every moment.There aren't words to\ndescribe it.I just love it.I must say congratulations to the cast and\nfirstly to Jojo Moyes for this excellent plot.\n"},
{"review": "\nI loved every second of this film. I cried and I smiled and I laughed -\njust the way I like romantic films. I will recommend this movie to\neveryone I meet. The story caught me and I think the actors in it was\namazing! I loved the character Lou Clark; and Emilie Clarke was\nstunning in this role. She played so well, the expressions she made and\nthe fancy clothes. I especially love the way Lou fancied bumblebee\ntights. It was not only serious, I liked the way they made fun of each\nother. And the music was amazing! So many good songs in this movie! I\nalso liked the way the debate about assisted suicide is portrayed, it\ngives you something to think about. A must watch for everyone who loves\nromantic movies.\n"},
{"review": "\nIm not much for romance, but so many people complained they didn't like\nthe ending and Emilia seemed charming enough to watch. Yes, it suffers\na few clichés, but i enjoyed it. You might say the pain was downplayed\nbut we saw the story from Lous perspective and not Wills. And as\nsomeone who has recently struggled with severe depression I connected\nto it. I connected to that strange feeling of enjoying some of your\ntime, laughing, enjoying a person you love and at the same time feel\nhorrible. I saw my boyfriends reactions and pain in Clarkes reactions\nto his pain. I felt this movie. On the other hand, Sams performance was\na revelation. I vaguely remember him from The Hunger Games, found him\nvery boring and bland in it. But here, he shined. I believed him in his\nblank stares, happiness, pain. Not many actors pull that off for me.\nAnd of course Emilia's and Sam's relationship is great, they worked\nwonderfully together.<br><br>It has problems of typical romance films, but the story that looms\nbehind it, and pops out is very strong, and well done. We are taken off\ninto the charming romp com world only to be snapped back to the reality\nof his disability and pain he is in.\n"},
{"review": "\n*** MAJOR SPOILERS *** I thought the acting was great. I adore Emilia\nClarke and Sam Claflin. My objection is it seemed to me to be promoting\nthe assisted suicide movement. I am strongly opposed to that way of\nthinking. People have the right to make movies about it, I just didn't\nagree with it.<br><br>I was hoping for an uplifting message of true, lasting love overcoming\nall of life's possible challenges. This had the potential to be full of\ninspiration. I loved the relationships with family and other characters\nand how their lives unfolded.<br><br>I hope to never have to be a part of anything remotely near to Will's\nsituation. I am vehemently against taking ones own life. God brought us\ninto this world and we must rely and depend on him in all situations to\nthe very end. If Will had faith in his heart, the outcome would have\nbeen different and he and Louisa could have led a live filled with\nlove.\n"},
{"review": "\nEmilia Clarke was amazing in her acting , she showed all the potential\nshe have and took me by a storm<br><br>the writing was astonishing and the director relies very much on\nclose-ups and reaction shots in witch Emilia excelled with her facial\nexpressions,her smile and her tilted gaze always seems to want to say\nsomething <br><br>the British touch in the movie was clear and distinct<br><br>in the other hand it wasn't good enough for a romantic movie and not an\nemotional tearjerker<br><br>I give this movie a 8/10 because of its good actors, story line, the\nsettings and of course, giving you a great amount of emotions!\n"},
{"review": "\nA film is a work of art. An author's expression, the director's\ncreativity, the performer's charisma and the captivating music can\nembrace a person and touch some of those primal feelings, hidden deep\nwithin vaults in our heart. <br><br>At its base is a very simple story requiring some astounding\nperformances to make it come to life. The film focuses on the feelings\nof innocence, simplicity, commitment, loyalty and love. How true are\nyou with the people around you? Will you stick around at a trying time\nof another's life? <br><br>The film makes you dwell on the unpredictability of life. In a moment,\neverything can change and maybe in a way which is not possible for us\nto bear.<br><br>A truly magnificent piece of cinema.\n"},
{"review": "\nMe Before You <br><br>They're called wheelchair ramps but you rarely see people doing jumps\noff them.<br><br>Hopefully, the paralyzed person in this romance gives it ago after\ntheir melancholy.<br><br>Years after a road accident left him wheelchair-bound, ex-financier\nWill (Sam Claflin) continues to suffer from depression over the loss of\nhis former lifestyle.<br><br>Lou (Emilia Clarke) is an unemployed waitress who agrees to become the\nprimary caregiver to the posh playboy.<br><br>Although her pep and his self-pity don't mix, when she learns of his\nsuicide pact, she plans to dissuade him by showing him the beauty of\nlife with or without mobility.<br><br>While the leads have enough chemistry to pull of the love/hate angle of\nthis adaptation of the British bestseller, it comes off as craven and\ninsensitive when faced with the touchy issue of euthanasia. <br><br>Nonetheless, it's still hard to tell if someone's dating a handicapped\nperson just for the parking privileges. <br><br>Red Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nWell..It was a very cute and pretty movie..and need not to mention\namazing performances by actors But since i have already seen a 2010\nBollywood movie Guzaarish (www.imdb.com/title/tt1438298/),,the Me\nBefore You didn't appeal to me that much.. Since both movies have a\nquadriplegic lead and a caretaker , a hospital appointed nurse in case\nof guzaarish ..both asking for euthanasia..and budding romance between\nthem.. they are almost similar.. But guzaarish is very beautifully shot\nand romance actually feels very real and other character are also well\nestablished and there is no way u won't cry 3 or 4 during this movie..\nso after watching Guzaarish it wasn't a very money worthy experience\nfor me since i kept on comparing both movies and me before u wasn't\nbetter even though it has 6 more years of advancement in filmmaking..\n"},
{"review": "\nWhen you start watching the film you can't help but let this beautiful\ncastle and its greener than green lawn get into your eyes. It's an\niconic image of Wales, as legendary as the man who made it build:\nWilliam Marshal, 'the best knight that ever lived' (if you are not\nfamiliar with UK history I strongly suggest you go and check on him\nbecause I'm sure you won't be disappointed).<br><br>Besides that, the movie was for kids but nice, with many gentle\nfeminine touches: Lou's clothes, Lou's feelings, Mrs Traynor's maternal\nlove, Mrs Clark's maternal wisdom, Clark family's attitude towards\njobs, luxury and unemployment\u0085<br><br>Director Thea Sharrock and screenwriter Jojo Moyes (a female Author:\nnot the Jojo from Tucson, Arizona...) did a good job: they walked too\nclose to the edge of self hedonism for my tastes, but they didn't\nplummet down and I liked it.\n"},
{"review": "\n...there are a bunch try and get it done using this formula and don't\ncome anywhere near close to succeeding. What makes this production work\nare a couple of terrific performances from it's leads, and a very\ndecent job on all other levels of production. We all know where it\nshould go, but in other hands we have to realize it might not get\nhandled in the same manner. So many other similar films just do not\ncome off with the level of care this one does. It's only 110 minutes\nlong but plays longer, but none of it seems forced or protracted. It's\njust a charming little film, with a great bunch of actors, with a very\nbasic and well developed screenplay.\n"},
{"review": "\nSo at first I thought it was going to be another pretty predictable\nmovie and I was only watching it because I love Emilia Clarke. But I\nwas actually pleasantly surprised. The movie was not predictable at all\nand really was special for a lot of reasons. <br><br>Also the acting performances were very good. Emilia Clarke did a great\njob at playing an adorable, clumsy, sweet girl and Sam Claflin too did\na great performance as a disabled young man. <br><br>The movie did really hit me right in the feels cause it could really\ntake you away and the actors had a great chemistry on screen. The music\nwas good but not the best soundtrack I've heard and would personally\nhave made a completely original soundtrack for a movie like this.\n"},
{"review": "\nI do not care what anybody says, this movie was life changing. I saw\nthis movie on a rainy Tuesday with my good friend, and I was expecting\nto see any other \"chick flick\" but Me Before You took my breath away. I\ndidn't feel like I was at the movies I felt like I was apart of the\nstory. I could not tear my eyes away from the screen (okay maybe I did\nonce to wipe the tears that were streaming down my face like a\nwaterfall). The actors did an amazing job with their characters and the\nproducers and director did an amazing job with the film. I think\neveryone should see this movie because it makes you not only appreciate\nlife but it also makes you feel like you are apart of an even bigger\nworld and makes you see things in a different light. I would recommend\nthis movie to every and anyone. Without a doubt my new favorite film.\n"},
{"review": "\nI went for an unplanned movie in the cinema's yesterday and chose Me\nBefore You because the trailer looked good and I wanted to see Emilia\nClarke star a whole different role at least once. Since everyone,\nincluding me, knows her from the Game of Thrones series on TV, playing\na real war-chick, it's hard to imagine her playing something so\ndelicate. In the first 30 minutes of the movie, I already saw this was\ngoing to be great. Emilia can show so many emotions in her face without\neven trying, which makes it clear why they chose her. The way she lived\nLou in the movie was just amazing, real and definitely sincere.<br><br>This is a must-see movie, not only today, but tomorrow, next year and\nin 10 years as well.<br><br>Rating : 10/10 for sure!\n"},
{"review": "\nI don't usually go for this type of film, I'm a superhero film type of\nguy. But because the beautiful Emilia Clarke starred in it, I forced it\nonto my screen and boy I'm glad I did! Some people say bad things about\nEmilia Clarke and her acting, but yet again, unsurprisingly she was\nperfect. Through my heightened sense of empathy, I could imagine how a\nparalysed man would feel, and Sam Clafin performed the role to\nperfection. For a soppy romance movie, this was great. 8/10, it's\nmissing two for the silly reason that it is a romance film, I rated The\nFlash a 10, so rating this 10 would go against my core values. In\nconclusion, even is this movie is not something you'd usually watch\nbecause of its genre, I'd give it a chance anyway, because...Emilia\nClarke, even in her dorky dresses was absolutely sublime, and it's\nworth watching just because of her, well, it was my reason anyway.\n"},
{"review": "\nI don't care what anyone says I loved this movie. The movies always\nmiss things out when they are based from books so I will defiantly be\nbuying the books too.<br><br>The cast where the perfect pick I don't think anyone else could have\nplayed the roles to well, the soundtrack also was really nice defiantly\non my download list.<br><br>I personally thought the movie was amazing and utterly heart breaking\nat the same time I was an emotional wreck close to the end. Its a movie\neveryone can relate to in same way or another and at the same time was\nvery thought provoking. It has humour, romance and everything you could\nwant form a tear jerker<br><br>Officially one of my favorite movies of all time.\n"},
{"review": "\nI have to say this is one of the best films I have seen in a long time,\nignore the critics and see this film. I cannot express how good it is\nand how heartwarming the story is. I have seen some heartbreaking films\nin my time like Beaches for instance, but this film from the beginning\nto the end was truly pulling at the heartstrings, top notch\nperformances from everyone, this film is definitely a must see, if you\nwant a Sunday afternoon tear jerk-er look no further than this film, I\nwould give it more than 10 if I could. Sam Claflin was by far fantastic\nin this film along with Emilia Clarke, the soundtrack goes great, I\ndon't want to say anything about the film or spoilers, but see for\nyourself how amazing this film is, you will agree it is really a top\nnotch film for 2016.\n"},
{"review": "\nThis movie is a copy / remake of French movie 'The Intouchables'\nreleased in 2011, which was also remade in Tamil language as'Thozha' in\nMarch 2016. Correct me if I am wrong. I will remove my comment /\nreview.<br><br>The Tamil movie had Nagarjuna, the Telugu super star in the lead role\nas a rich disabled man. Kathik, the leading hero from Tamil as being a\nconvict of petty cases in the province of Tamil Nadu being a care giver\nby chance. He falls in love with the lady who is managing the affairs\nof the billionaire. Then the story spins around how, the rich finds his\nemail companion and the care giver finds his love realised and blessed\nby the rich. This movie resembles the same. Let me k ow, whether, my\nstatement is true\n"},
{"review": "\nOkay, let me start with the positives. This firm is well acted and is,\non one level, a reasonable, weepy romance. However, the relationship\nbetween the leading couple seems unrealistically intense because the\nactors are not given sufficient screen time or dialogue to develop it.\nThat said, my biggest problem with this movie is it's message.<br><br>At this point I should briefly explain that I was born disabled and I\nam unable to walk. I will remain this way for the rest of my life. I\ncope with this in one very simple way, I focus on what I can do and not\nwhat I can't, what I have got, not what I have am without. So, I found\nthe fact that the leading man in this film decided to take his own life\ndue to a paralysing accident hard to accept. He had so much to live\nfor, a supportive family, a great house that had been adapted to suit\nhis needs, a specially adapted vehicle and loads of money! However,\nthis was clearly not enough as he is still really unhappy and has a\nmassive chip on his shoulder, as he waits, counting the days until he\ncan end his own life! Then this gorgeous, kind, lovely young lady comes\ninto his life, they fall in love, she practically begs him not to go\nthrough with it but to no avail. <br><br>This is such a negative message, which is offensive to people living\nhappy lives with disabilities. It also serves to reinforce negative\nstereotypes surrounding disabilities. I wanted to see the ending in\nwhich she made him realise his life was worth living. Now that would\nhave been living boldly!\n"},
{"review": "\nI watched this film and really enjoyed it, which is strange for me and\nit being a \"chick flick\", and it wasn't until the end that I realised\nshe was Daenerys Targaryen in Game of Thrones because she is so\ndifferent in the roles.<br><br>Great script with lots of both funny moments with the humour and\nserious moments with the story behind it. It was well put together,\nbrilliantly cast and beautifully filmed in all the various lovely\nsettings.<br><br>I might not be Oscar material but nonetheless it totally captivated me\nand entertained me which is why I watch a film in the first place.\n"},
{"review": "\nWhat would you do if your life wouldn't be the same? If you shall be\ntotally depending on another person? This is the tragedy that the\nprotagonist has to face when his life is devastated by an accident.\nMovie with good rhythm, deeply sad. I couldn't hold back the tears... I\ndidn't read the trailer, and for the first 30 minutes you don't really\nhave a clue of where the story if going eventually. Incredible\nexpressiveness for Emilia Clarke. She can really make the difference\nwith her touch, even if her character is a bit too emphasized and her\nstory isn't thorough in the end. Eventually we all should be glad of\nwhat we have in our life.\n"},
{"review": "\nA fairly good story by Jojo Moyes gets deep-sixed by awful, awful,\nmusic cuts and transitions infesting scene shift after scene in what\ncould've been a good albeit maudlin script of \"Me Before You\". Fault\nlies mostly with editors and director Thea Sharrock for completely\nover-indulging singing music cuts. Sorry Sharrock, in editing with film\nwhen it comes to music and audio, less is more. Kumbaya might be OK for\ncampfires, but not for stories of paraplegics or cinema. MTV is its own\ncategory. There's a time and a place for it, but not in supposedly\nserious subject matter. Clarke and Claflin are not at fault and do a\ngood job in this movie. Too bad directors and editors cannot fathom or\nrecognize their own tacky and poor soundtrack editing. 5/10 cannot\nrecommend.\n"},
{"review": "\nThe book wasn't great,but i liked it anyway (shame on me :D ) and so\nwanted to check out the movie. The movie is disgustingly bad... The\npacing feels unnatural and rushed,the love story somehow feels forced,\nthe use of music is so sooooo bland and tasteless, the acting of both\nmain characters is embarrassing, especially Emilia Clarke's.I kind of\nthought she would be a good actress since she's on Game of Thrones, but\nshe was atrocious in this movie! Trying to make big puppy eyes, smiling\nbig and raising her eyebrows to oblivion did not make her adorable, it\nmade her punch-able.<br><br>I will never recommend it to anyone, will never re-watch it,bad movie,\nwill forget it in....yep, already forgot.\n"},
{"review": "\nEmilia Clarke is awful in this. Not real acting here...who else agrees\nwith me on this? <br><br>Her eyebrows are crazy and so are her facial expressions. Very amateur\nfake-ish acting, couldn't even watch the movie. Tried watching it right\nafter I read the book, tried watching it again on the plane today. Just\ncould not finish it. There is also no real chemistry or good portrayal\nof some sort of chemistry between them. All the other actors are okay-\nish....not too interesting. <br><br>She cannot play innocent and docile. Much better as the mother of\ndragons in GOT...\n"},
{"review": "\nThis movie was decent - definitely a big tear jerker.<br><br>Will, his parents and his carer were all very good characters - so well\nacted but Lou? To me she just seemed wet and a constant pushover. I\nwasn't a fan of her or her family. It bugged me how she couldn't just\ntell her boyfriend why she was doing all the things with Will she was\ndoing.<br><br>A lot of people say this is a feel good movie - to be honest I just\nfinished watching and I feel kinda depressed by it - he wanted to die\nand nothing was changing his mind, that's it really. Nothing feel good\nabout that ...<br><br>Still, if you want a good cry - watch it...it'll do the job there.\n"}
]