[
{"review": "\n\nI honestly don't think I have ever seen a better movie than American History\nX in my entire life! I may only be 14, but I have seen a lot of movies. I am\nan avid fan of them, and this one just takes the cake. Edward Norton is just\nunbelievable. He is the most talented actor I've ever laid eyes on. His\nperformance in the movie is phenomenal. He delves so deep into his character\nthat he can convince the whole audience easily of his neo-nazi role. The\nlook on his face as he walks back from killing one man in the first seen is\npurely horrifying. The entire move was dramatic, intriguing, and powerful.\nIt really is moving and emotional as well as scary. It is so true to life,\nand provides the viewer with such insight into the life and events that\ncreate a monster such as Derek Vinyard. It answers many questions I have\nlong awaited an answer to such as what could possibly make someone act as\nDerek did in this movie, yet left open-ended many others that people such as\nmyself may have. Almost every single scene in the movie was extremely\ncaptivating. I can't even go on to say more about the acting, other than if\nEdward Norton does not win best actor this year, I will go absolutely nuts.\nIt's bad enough he lost it to Cuba Gooding Jr. when he was in Primal Fear,\nwhich was yet another incredible performance by him. Edward Furlong, the\nlittle kid from T2 is astounding as the confused brother of Derek. I was\nstunned walking out of the theater after seeing American History X, and I\ndon't think I will ever have the benefit of seeing another movie as good as\nthis one as long as I live. I recommend anyone with a good tolerance for\nviolent and graphic depictions go see this movie. I am bewildered as to why\ndirector Tony Kaye would ever want out of this success. If I were to rate\nthis movie, as I often do for others in reviewing them for school, I would\ngive it an A+ with all of my heart.\n"},
{"review": "\n\nA good friend of mine suggested this film, and I really didnt know what to\nexpect going in, but after this film was over, I sat in stunned silence. I\nknew that racism was horrible, but I found through this film that it does\nnot come without a terrible price..the loss of love, friends, family...and\nthe realization that everything that you believed to be true isnt always\nthe\nway things are. Edward Norton's performance takes the viewer through this\njourney, and its not a pretty one. He goes from an bright young man, to a\nvengeful bigot, to a remorseful excon with a brothers life in jeopardy, and\nyou feel as though you are looking in on someones life in the course of 2\nhrs. All of the acting in this film is first rate, and the ending wasnt\nquite as predictable as others might have you believe...it is quite\nshocking, as is much of the film. It causes quite a debate on the way\npeople\nview others whos skin color is not the same. As Dr. King said, judge me not\non the color of my skin, but on the content of my character. I live with\nracism, because I am a black man living in America...it exists, but if we\neducate ourselves like the main character in AHX, it wont stay around for\nmuch longer. Hopefully it wont be too late, as it was for him. Peace and\nLove, JB33  Rating 5 stars\n"},
{"review": "\nI was expecting a kind of a moralistic movie with an overly present,\nalmost preaching like message. The movie however turned out to be\nextremely powerful mainly due to the professionalism it was made with.<br><br>The movie its story is told 'beautifuly' in black &amp; white and color.\nThe quite original directing from Tony Kaye gives the movie a nice\nvisual style and certain atmosphere. The story itself isn't that\ncomplicated or extremely original on its own and perhaps at most points\neven predictable but the way the story is told is phenomenal. This is\nnot a movie with an happy ending or a movie that provides a solution to\nthe racial discrimination problems. It shows what is NOT the solution\nto the problems and that everything that is occurring is like a vicious\ncircle. The movie does not give a hopeful message but instead shows the\ndangers and pain you're causing to yourself and your close environment\nwhen you're thinking as a white supremacist.<br><br>As an anti Neo-Nazi movie this movie works really powerful. I think\nthat its a really good and important thing that this movie is often\nshown in classrooms.<br><br>Edward Norton is truly fantastic in his role. He is very well\nbelievable as a Neo-Nazi as well as the reformed person he later turns\ninto in the movie. It's almost like he's playing 2 different characters\nand he does that so extremely well. Also really good was Edward Furlong\nwho we all long had not seen in a big production. Furlong and Norton\nare both acting well together in their scene's are highly believable as\ntwo brothers.<br><br>Also surprising good was the musical score by Anne Dudley who had\nalready won an Oscar for \"The Full Monty\", the year before.<br><br>This was a movie that surprisingly impressed me. As a movie its\nextremely powerful and important.<br><br>10/10<br><br>http://bobafett1138.blogspot.com/\n"},
{"review": "\n\nAmerican History X is one of the most powerful movies released in years. Not\nsince Schindler's List has the subject of racism been so potently presented.\nThe use of black and white cinematography to portray painful flashbacks is\namazing, and the settings, while not necessarily pretty, fit the story\nflawlessly. <br><br>Derek Vineyard's (Edward Norton) transition from a white supremacy leader's\nprotege to a gang leader himself to a changed man is shown mainly through a\nseries of flashbacks to the time before he was sent to prison. The character\ndevelopment and story are amazingly well done, and this is largely a factor\nof the high quality of the acting. Edward Norton especially, but also Edward\nFurlong, Beverly D'Angelo, and all of the rest of the cast down to Avery\nBrooks as Bob Sweeney, the African American high school teacher who comes up\nwith the term American History X, and Stacy Keach as the wonderfully\nhateable Cameron Alexander. Keach, by the way, would have been the perfect\nchoice to play Francis Dolarhyde in Manhunter, the film the precedes The\nSilence of the Lambs, but oh well. <br><br>Unfortunately, despite the fact that American History X is one of the best\nfilms in years, it is horribly underrated. Much like Norton's last film,\nPrimal Fear, which was also a great movie, this movie did not get nearly the\nrecognition that it deserves. \n"},
{"review": "\n\nPowerful portrayal of Neo-Nazi movement in America. Told in series of\nflashbacks. Flawless acting by Edward Norton. Does its best to make the\npoint that no one is ever right aand no one is ever wrong. I have a friend\nwho was a Nazi and a racist. But upon walking out of the theater after this\nmovie he hung his head in shame. This is why the film industry\nbegan.\n\n"},
{"review": "\nI have been wanting to see this movie for a long time, since my English\nteacher mentioned it in our class in grade ten. Gosh I wished I\nwouldn't have waited all this time to finally watch it, although maybe\nit's a good thing cause I would have probably been a little bit more\ntraumatized at 14... This movie is exceptional!!! Makes u think, makes\nyou frustrated, makes you wanna scream and even makes you cry! Edward\nNorton is just phenomenal playing the role of a freak skin head and\neven more so playing this skin head who finally realizes how stupid he\nwas and tries to protect his younger brother. Edward Furlong also does\nan amazing job!!! This film is moving in so many ways...I can't even\ndescribe how real and heartfelt it felt. I definitely think Edward\nNorton should have won the Oscar for his performance, cause he was\nabsolutely terrific! I can't get why they didn't gave it to him... This\nmovie will surely stay on my mind for a while now... just thinking that\nsome place in the world things like that still happen...it crushes my\nheart. This is a wonderful movie that every single person should see at\nleast once in his life... Watch American History X, it totally worth\nit!\n"},
{"review": "\nThis is a fantastic movie because no matter what side you're on in\nlife, this movie shows them all, good and bad, right or wrong. I also\nagree with the point in the movie that proves that people can change\nfor the better and straighten things out in their head to do the right\nthings in life. Yes, things in our world have changed, some for the\ngood, some for the bad, but just because you might not agree with some\nof it, doesn't mean you can play God and try to make things \"your way\"\nand this shows exactly what happens when you try. This movie talks\nabout all walks of life and the struggles we all have in what beliefs\nare right and wrong. Yes this movie is brutal and violent, but also\ntruthful to the past and unfortunately still sometimes the present.\nThis movie is about race, but not only 1 race is singled out and fed to\nthe dogs, they all are. So, go into this movie with an open mind and\nyour mind will come out full.\n"},
{"review": "\n\nWhen I first heard of \"American History X,\" I thought it was going to be\n\"just another movie.\" Man, was I wrong! The first time I watched it, I sat\nthere as it ended, and I was just completely in a state of shock. This\nmovie, more than any other movie I had seen on the subject of racism,\nreally\nmade me think twice about how I treated people of a different race. The way\nthat Derek Vinyard's family was almost completely split apart and destroyed\ndue to his racist beliefs should be a wake-up call to those people who have\nany racist beliefs whatsoever. I believe that this movie was a whole lot\nmore than just a ground-breaking, controversial drama; it was a portrayal\nof\nexactly how much damage can be done to a family and a nation\nsimply because of the hate for a person or people of a different color, for\nalmost no reason at all. The Bible says that \"God created man in his own\nimage.\" It also says to, \"Love your neighbor as yourself,\" which, right\nthere, implies that racism is not something people should even consider. I\nwouldn't recommend that anyone under the age of 16 see this movie due to\nits\ngraphic content and language; however, I believe that everyone who is over\nthe age of 16, should see this movie at least once. This way, more people\nwill get a chance to see the true consequences of racism, and how it can\neasily tear apart a family.\n"},
{"review": "\nEdward Norton plays Derek Vinyard, a violent but also intelligent\nneo-nazi. After brutally killing two black people who tried to break\ninto his car, Derek is sent down for a couple of years. Meanwhile, his\nyounger brother Danny (Edward Furlong) is busy following in his\nbrother's footsteps. After certain incidents in prison gives him time\nto thing, Derek decides to reform on his way out. Once out, he realises\nhow quickly in number his old gang of nazi thugs has grown and wonders\nif he can save his brother.<br><br>This is a brilliant film. Perhaps what disturbs me the most is the way\nthat Edward Norton looks so brutal, yet sounds so intellectual\nthroughout the film.<br><br>Although the film contains a constant strong theme of violence, it is\nalways justified in portraying a picture of racial tension. Neither\nblack nor white people are \"judged\" in the film, it's primary focus\nbeing to outline that it's people's brutality that causes a racial\ndivide, not race itself.\n"},
{"review": "\nThis movie, got to me! I mean got under my skin got to me. It is so\neffective, the performances were just perfect. We have Edward Norton\nand Edward Furlong, two fine actors, they play two skin head Nazi\nracist brothers who are very violent. We start off at a very disturbing\nscene where we see how Edward Norton's character is put in jail for\nkilling an African American very violently. When he comes back, he has\njust learned so much that no school, no white man could ever teach him:\nself respect, respect for others, respect for life, for his family, and\nknowing that \"We can't live our lives p*ssed off\". He is touched when\nhe learns that his brother's teacher is asking him to write a paper\nabout racism and how it effects today's society called \"American\nHistory X\". But when Eddie just gives a wrong look to the black kid in\nschool, some things go terribly wrong.<br><br>First off, Ed Norton's old \"friends\" turn on him because he wishes not\nto be part of their very racist gang. Even his own brother who followed\nhis footsteps hates him for turning on the gang. But Ed Norton takes\nEddie and tells him his passionate and harrowing experience in prison.\nEddie seems to start to see the light, but there is an extremely\npowerful ending that will make even the toughest guy shed a tear. I\nhighly, very much highly, recommend this movie for everyone. Even for\nthe kids, though you might want to turn them away for a few scenes, but\nthat's how powerful this movie is. Trust me, this movie should not be\nmissed and it sends a message.<br><br>10/10\n"},
{"review": "\n\nIn just a short career, Edward Norton has emerged as the best actor of his\ngeneration. 5 films, 2 oscar nominations, and the best performance I have\never seen turned in by a modern actor. In this film, Norton plays a skin\nhead who goes to Prison for brutally murdering two black men who are\nattempting to steal his car and comes out reformed only to find that his\nbrother (Edward Furlong, turning in a fine performance) is headed right down\nthat same route.<br><br>Yes, the \"hate is bad\" message is overplayed and by the end of the film\nyou've been hit over the head with it. The scenes, as well as the story, are\nminimal and the \"shocking ending\" is predictable, but it all doesn't matter.\nIt's all more of an actor's piece than any one else's and Edward Norton\nturns in the  most amazing performance I have ever seen captured on film. No\nlonger, the sweet innocent psychopath he was in Primal Fear, Norton bulked\nup considerably for this role and it pays off.<br><br>It is, hands down, the most powerful American film in decades. I'd give it a\n12 out of 10 if I could. \n"},
{"review": "\n\nConsider this: an ultra-low-budget movie on the subject of racism, with no\nCGI and few special effects of any kind, with all of the action taking place\non two or three sets, the plotline basically consisting of two or three\npeople talking at a time punctuated by occasional outbursts of\nno-holds-barred violence, a massive downer of an ending, and not starring\nthe usual assortment of Hollywood stars. Sounds like an indie for sure,\nright? But it's not. It was a Hollywood film, although for the life of me I\ncan't imagine how any major studio got behind it. AHX is one of the best\nfilms of the decade if not of all time. Norton, who was just kicking off his\ncareer, is absolutely mesmerizing as a repentant skinhead and Furlong, known\nprimarily for his role in T2 (and whose career has sort of sputtered out),\nis right up there with him as the confused younger brother. A must-see for\neveryone, although not the kiddies. An amazing film, right up and through\nthe incredibly sad ending. \n"},
{"review": "\nAmerican History X really opened my eyes to the world of racism and how\ncruel human beings can be sometimes. This story follows a violent\nextreme skin-head (Norton) that spends three years in jail for killing\ntwo black people and how he changed through jail. He then tries to help\nhis younger brother, who idolizes him, not to go down the same path he\ndid. You really can't find a more powerful movie than this. This movie\nforces you to open your eyes through harsh realism and although some\nthings are disturbing, it makes you take notice. Everything about this\nmovie is so incredible I can't even find words for it. All I can say is\nthat if you have not seen this movie, it really is a must to see\nbecause it teaches you something and is really powerful.<br><br>Norton's best performance and a must for everyone.\n"},
{"review": "\n''American History X''is one of the most amazing movies I watched in my\nlife! My dad gave me the tape to watch, and after almost 2 weeks of\nlaziness to watch this movie, I finally watched it 2 times! First, I\nneed to say that both Edwards( Norton and Furlong)are great! Edward\nNorton specially REALLY looks a skinhead, showing all his anger and\nawesome body in this movie.<br><br>I like the end of this movie (who is very sad by the way, since I liked\nthe character Danny very much)showing how hate and violence only makes\neven more hate and violence, in a effect like a snowball.The other\nending that never was filmed, in which Derek shaves his head again in\nthe school bathroom,would not help very much with a good message, but\nit could have some sense, showing that the prejudice and the racism\nwill continue no matter what we try to solve it. (But it is too\npessimistic!)<br><br>I don't think this movie is racist like many people are saying. It is\nagainst racism, since the moral of the story was to show how the\nprejudice of all races and ethnicities only can make problems and anger\nfor everybody.<br><br>It's funny to see how many goofs we have in this movie. I didn't pay\nattention to any of them, since the story itself makes you not bother\nwith errors.\n"},
{"review": "\nMy 9/10 rating is because \"American History X\" is very well done in\nevery way, except that it seems that when Derek Vinyard (Edward Norton)\nstarted spouting out the anti-Semitic diatribe, they should have asked\nhim what became of his humanity. Then again, maybe they wouldn't know\nwhat to say in such a situation.<br><br>But other than that, the movie is quite good. Portraying a reformed\nDerek trying to prevent his younger brother Danny (Edward Furlong) from\nbecoming a white supremacist, we get to see various issues. For\nexample, when Derek is in jail and gets to know a black man for the\nfirst time, his anger starts to ebb. Good support from Beverly\nD'Angelo, Elliott Gould, Stacy Keach and Fairuza Balk make this a very\ngood movie, even if they didn't develop it as far as they could.\n"},
{"review": "\n\nSpoilers herein.<br><br>I found Ed Norton to be a plausible foil in `Fight Club,' but a simple\nmugger in `The Score.' I sought this out to discover whether he should be on\na list to watch or not -- this being a picture he influenced\nheavily.<br><br>It is a mess. It is a mess because the director was too callow to have and\nimpose a vision. So we get lots of different visions depending on the\ncomposition of the moment and the elements involved. One of those elements\nis Norton himself. I continue to maintain that the actor should never be in\ncharge of the vision: he just has an entirely different set of concerns. One\ncan see the scenes that Norton rips away from the director and sets up as\nbillboards for himself.<br><br>There are times when this can work. Scorsese seems to have explored more\nthan all of them. It doesn't work here. This material demands that it be\ncentered in large numbers of `ordinary' people. The impact is that this\ncould be widespread, not just isolated to one movieland character. But\nNorton sucks all the attention out of the story.<br><br>The material demands ambiguity. But the center is an unwaveringly decent\nblack schoolteacher, as artificial a character as Norton's.<br><br>The material attempts some sort of reflection through the term paper/diary\nreflections of the brother. But this is clumsily written and ends up as\nsimple narration, usually the sign of poor visual storytelling.<br><br>There is self-reference of sorts between Norton and his character. The\ncharacter is playing a role that allows for one-dimensional excess. This\nrole is widely respected because of the matter he preaches. So too with\nNorton himself. \n\n"},
{"review": "\nIt's a bit tough for me to review this one. Some of my friends said\nit's one of the best movies out there, a true classic. So I gave it a\ntry and in the end it left me a little unimpressed.<br><br>I don't have much to say about it because it failed to truly captivate\nme with its story and characters. The main theme is racism, but I\ndidn't feel this movie explored it in a completely satisfying way, or\nat least in a way I haven't seen before. The story was pretty simple:\nthe guy is a delinquent (Neo-Nazi), we see his life, he goes to prison,\ngets some kind of a realization after bonding with a black man, decides\nthat his past lifestyle was wrong and becomes a better man after he's\nreleased from prison.<br><br>At some points of the movie, I felt that the actions by some characters\nweren't appropriate or literally came out of nowhere with no build up\nlike Derek murdering people in the middle of the street. And the moment\nat which film didn't do well was the most important one - the scene in\nwhich Derek realizes the consequences of his actions, how bad of a\nperson he was and how little he devoted himself to his family. It just\nleft me unsatisfied. It wasn't captured very well. The events that were\nsupposed to lead him to this point lacked a bit in the execution\ndepartment. The script left much to be desired here.<br><br>With that said, this is not a bad movie. There are some great\nperformances here. Norton and Furlong did a particularly great job.\nDanny's tragic fate also offers something to think about. However, the\nshortcomings of script and execution prevent it from being truly great.\nAs it stands, it's just an OK film with an obvious message - racism is\nbad, don't be a delinquent.\n"},
{"review": "\nThere are a lot to say about this film..I found all the words that\nexpresses all my feelings about the world we are living in.I cried\nmyself to sleep.everyday i'm seeing a lot of things that i have no\nwords to explain even to myself \"why\"? Unfortunately we are living in a\nworld there everybody obsessed about something but mostly the outside\nof our silly bodies. Most of us hates someone, some religion or a color\nwithout any reason.This great movie that tells us hate is a hunchback\nthat keeps us away from the sun.We should throw our prejudice and take\no second look to everything around! us.Then i believe there wont be any\nfears but just friendship. Like Edward says \" Life is too short to be\nangry! all the time..\"\n"},
{"review": "\n\nAMERICAN HISTORY X (1998)\nRating: 10/10<br><br>I could not applaud this film more. What really make this movie are 2\npeople. First is Tony Kaye, you have done a breathtaking directing job in\nturning what potentially could've been a replay of all the racist movies\nover the past years into a film that I will never forget. Whenever something\ncomes up on the news about Nazis, skinheads, African-American fights etc\nI'll remember this film. Second person and probably the person who deserves\nit most is Edward Norton. Edward, your performance has changed my life. I\nhave never seen a male give what is such an effortlessly amazing and truly\nmasterpiece of a performance. Were you really acting, Ed, or was Tony Kaye\njust following you around for a few years? Kudos also to script-writers,\nEdward Furlong, other supporting characters and good cinematography and\ndesign which flips from black-and-white to colour cleverly. This movie is\ntotally violent, has a lot of coarse language and is extremely graphic about\nall its subjects. This is what they should really be teaching kids in\nschool, all about what really happens in America. I don't live in America\nmyself but I thought it gave a very apt description of skinheads who live\nthere. Totally amazing stuff, American History X earns a place on my top 10\nfilms of all time, making it not only the best movie of 1998 but the third\nbest of the decade, following American Beauty (it is obviously good to have\nAmerican as the first word for your film title \u0096 all the movies that start\nwith the country are fantastic \u0096 American Beauty, this film, American Pie,\nAmerican Psycho, so on and so on) and The Shawshank Redemption. Truly\nunforgettable cinema.\n\n"},
{"review": "\nI left viewing this film quite confused. Sequences of rationally\ntwisted proto-Nazi racism are intercut with scenes that seemingly\njustify this sort of thing with sympathy. There are sequences of\n'inverted' racism, black kids turning on white. This confusion becomes\nunmitigated chaos when Norton's white/Nazi murderer looks to\nconsolidate his 'identity' in the white sub-set of a jail's inmates; it\nall seems so simple until all the rules he'd assumed pall against the\nimperative of his own survival.<br><br>Emerging, he goes to be with the one unit that he can co-exist with\ndespite the fluctuations in his identity and his own very human\nconfusion. This film is about being a young man growing up in a normal\nmiddle class American family. It's told using racial tension as a rich\nsource of metaphor for the different loves and hates that, whisked up\nby desire and ignorance, rise up and merge into an incomprehensible\nimpetus which is called being a(n American) teenager.<br><br>Norton is admirable, giving three strong characterisations within the\none nominal role. Edward Furlong is equally outstanding in a fine\ncentral cast as his doe-eyed but strong younger brother. Whoever\nsanctioned the final cut, the movie remains strong (and, perhaps,\ndangerously open to misinterpretation). It's not a date flick but it's\na fine mainstream movie which always stays the right side of dogmatic\nand patronising. 7/10\n"},
{"review": "\nAmerican History X is a 1998 American crime drama film directed by Tony\nKaye and written by David McKenna. It stars Edward Norton and Edward\nFurlong, and co-stars Fairuza Balk, Stacy Keach, Elliott Gould, Avery\nBrooks, Ethan Suplee and Beverly D'Angelo.<br><br>In a shocking opening scene, teen Danny Vinyard (Edward Furlong) races\nto tell his older brother, neo-Nazi Derek (Edward Norton), about the\nyoung blacks breaking into his car in front of the house, whereupon\nDerek gets his gun and with no forethought shoots the youths in their\ntracks. Tried and convicted, Derek is sent away for three years in\nprison, where he acquires a different outlook as he contrasts\nwhite-power prisoners with black Lamont (Guy Torry), his prison laundry\nco-worker and eventual pal. Meanwhile, Danny, with a shaved head and a\nrebellious attitude, seems destined to follow in his big brother's\nfootsteps. After Danny writes a favorable review of Hitler's Mein\nKampf, black high-school principal Sweeney (Avery Brooks) puts Danny in\nhis private \"American History X\" course and assigns him to do a paper\nabout his older brother, who was a former student of Sweeney's. This\nserves to introduce flashbacks, with the film backtracking to\nillustrate Danny's account of Derek's life prior to the night of the\nshooting. Monochrome sequences of Derek leading a Venice, California\ngang are inter cut with color footage of the mature Derek ending his\npast neo-Nazi associations and attempting to detour Danny away from the\ngroup led by white supremacist, Cameron (Stacy Keach), who once\ninfluenced Derek\n"},
{"review": "\nThe story is about the brothers Derek and Danny who are both smart and\ntrying to questions things like in the society. When their father who's\na firefighter goes into a black neighborhood trying to extinguish a\nfire he's shoot down by a drug dealer who happen to be a black person.\nBefore this happened the father had told Derek about his racial\nopinions while they were eating one time. After the murder of his\nfather Derek seeks to join a skinhead gang to avenge his father's\ndeath. one time later 3 black guys tries to jack his father's car from\ntheir front yard one night , Derek catches them and shoots one of them\nand brutally stomps on one the other guy's head killing him. Derek is\nconvicted of manslaughter and will serve 3 years in prison.<br><br>After the 3 years in jail Derek is a changed man. He has grown back his\nhair and become a loving and caring person , tolerating different\npeople. Because of all the horrible things that happened in the prison.<br><br>When he comes out he discovers that his little brother is going down\nthe same path as him. And he desperately tries to save him.<br><br>Why I like this movie is because that its shows us that hate only leads\nto suffering and despair. After his father is murdered, it's like it is\nhis duty to stand up against the blacks in society. He joins up with\nCameron and starts a skinhead gang, telling people to join because of\nthe black and Mexican gangs who bully people. He seeks identification,\nhe joins a side. But this is the a dead end I mean. <br><br>Really good movie! top's notch!\n"},
{"review": "\nThis movie is supposed to be realistic, yet fails on a number of\noccasions, and that alone should be enough to bump it out of a top 250\nlist.<br><br>When Norton split from his gang in prison, the opposing gang would've\nat least beat him. In reality, his laundry room friend not only\nwouldn't have been able to help him, but he wouldn't have ever\nassociated with Norton in the first place.<br><br>When Norton's ex-gang was chasing him and his brother, they would have\ninevitably caught up to them and at least beat them, yet a shoddy\ndecision was made to make the crowd simply vanish at the flick of a\nframe. Very lame, and very obvious.<br><br>When a game of basketball is played between the skinheads and the\nblacks to stake claim over some territory, and the blacks lose, they\nsimply walk away angrily as if something is really stopping them.\nHokey.<br><br>The kid shoots the other kid in a school restroom because he blew smoke\nin his face. Not only does he decide to do this in the middle of a\nschool day, in school, but he just stands there after he shoots him. I\nunderstand why, but again, very unrealistic.<br><br>There are all sorts of unrealisms like that throughout the movie. The\nlist is quite long. Aside from that, Norton's acting was good, but most\nof the rest of the acting in the movie was done by actors who just\ncouldn't handle it.<br><br>This movie has probably gotten such praise because of the subject\nmatter, combined with: lots of drama and tragedy and hope this and\nreformation that, plus Edward Norton, who is himself a good actor, but\nstill highly over-rated.<br><br>To sum this up, American History X was an oversimplification and\nconsistently unrealistic.\n"},
{"review": "\nOne of the reasons I like the film is that the racism isn't shoved down\nyour throat. It's subtle and believable. There's no characters standing\naround screaming about \"Those goddamn Mexicans, I don't want THEM\nchanging my locks so THEY can rob the place with their little essays!\",\nright in front of them. <br><br>The acting is great all around, and Edward Norton gives one of the best\nperformances of all time. I can't believe he didn't win best actor.\nWhile I haven't seen Benji's performance, I doubt he was half as good\nas Norton. The film is also highly inspirational and moving. <br><br>How is it that this wasn't even nominated for best picture, while Crash\nwas AND won? Crazy.<br><br>This should be shown in schools.\n"},
{"review": "\n\nI was curious to see what other people thought of this movie, and am\ngenuinely surprised to see this ranked so highly in IMDb polls.<br><br>What are the sins of American History X? First of all, the narrative\nstructure is confused, to no good purpose. By showing Edward Norton's\njail-stay in flashback, when we already know he's grew disillusioned\nwith the movement, all dramatic interest is removed from the scenes.\nAnd the method of his conversion was so trite as to be laughable. While\nhis prison scenes should have been the most powerful part of the movie,\nthey just felt like a waste of time (and using B&amp;W for the past is such\nan embarrassingly Hollywood device).<br><br>Secondly, the script is just terrible. You feel embarrassed for the\nactors as they're forced to talk entirely in polemic. Characters just\ndidn't talk or relate to each other in a way similar to how people talk\nor relate to each other. And I felt American History X's take on\nviolence was too cartoonish, where it should have felt genuine. The\nscenes felt adapted from action movies, whether the scene was\nsufficiently brutal or not doesn't make it better or worse.<br><br>You have to review artwork based on what the artist was trying to do,\nand how well he did it. The movie was trying to provide insight in the\nneo-Nazi mentality, while providing insight into the real cause of the\nracial violence. However, the unrealistic characters and the\nHollywood-ish take on violence left the movie flat in both regards.\n\n"},
{"review": "\nThis film began with such promise and toward center somehow lost its\nmomentum and started to preach.<br><br>The film had potential to move and defend without attempting to show\nhow wrong rascism is. I ofcoure feel its wrong, but hardly needed a\nfilm like this to show me.<br><br>The drama should just have unfolded without the Neo Nazi suddenly\ngetting religion. Why not let the pieces fall where they will.<br><br>It could have been a strong and powerful film, but turned into just\nanother we want to show you why and please don't do this.<br><br>It struck an almost condescending and proselytizing level. That why I\ngave it a six. Good, but hardly great.\n"},
{"review": "\n\"American History X\" is not a weak, fluffy, cutely wrapped after school\nspecial on racism, life in the 'hood, life in prison, and breaking the\ncycle. \"American History X\" is powerful and hits like an anvil. Edward\nNorton does an excellent job as Derek Vinyard, a venomous, hateful\nleader of a local gang of skinheads.<br><br>The movie takes a singular look at a young man who is entrenched in the\nWhite Supremist movement, then how he emerged from that life, and even\nhow he started down that path to begin with. Of course most people\ndon't like racist bigots and the movie shows the very ugly nature of\nthe skinheads/Arian Brotherhood. But the movie also shows the\ninteraction between the Whites and Blacks in the 'hoods of L.A. There\nwas by no means an angelic depiction of the African-Americans in this\nfilm. A few of the blacks shown were thugs who in part helped shape the\nviews that Derek and his brother Danny (Edward Furlong) held as White\nSupremists, but there were also a couple of key African-American\ncharacters that helped to reshape the views of Derek and Danny.<br><br>\"American History X\" made sure to do it right and make it true to life.\nThe life Derek had before prison, the life inside of prison with the\nsegregation and the gangs, and his life after prison as a changed man.\nThis was no \"Mississippi Burning\" or \"Rosewood\" detailing events of the\npast, rather this was a movie showing the present, the good and bad in\nboth parties, and the different ways people can be reformed.\n"},
{"review": "\n\nThere is only one reason for the high user ratings this movie receives. \nBecause of its subject matter, people like it because they think they\nSHOULD.  To dislike it might cause one to be perceived as being insensitive\nto racial issues, but anyone looking at this film with a critical eye will\nfind that its shortcomings make it practically laughable.  The basketball\nscene itself is so silly, it single-handedly destroys any credibility this\nfilm might have had.  Others have already noted the unbelievable dinner and\nprison scenes as well.  A lifetime of hate - instant contrition.  How can\nanyone possibly take this thing seriously?  There are far greater movies on\nracial injustice, \"Mississippi Burning\" being one that comes to mind\nquickly.  AHX should be closer to the bottom 250 than it is to the top.\n\n"},
{"review": "\nPast and present collage of a youthful neo-Nazi skinhead in Venice\nBeach, California, his life going into a tailspin after the\ngang-related murder of his father. After killing some neighborhood\nthugs, the skinhead serves jail time and is eventually paroled (and\nreformed), yet he can't seem to straighten out his erratic family,\nparticularly his younger brother who seems intent on following down the\nsame ugly path. Director Tony Kaye puts the squeeze on us right from\nthe start, staging a blacks vs. whites basketball game as if it were\nEpic Human Drama (photographed in black-and-white, with slow-motion\neffects and a heavenly choir). The superlative performances nearly\ncarry the picture, yet screenwriter David McKenna lays on the\nbe-true-to-yourself rhetoric with a trowel (and yet lets the opposite\nside get their licks in too, whittling the film down to a battle of\nspeeches ladled with words like 'empowerment'). The jailhouse scenes\nare the strongest, but the family drama and the sidebars with the\npolice (who also get to make speeches) are uncomfortably contrived. **\nfrom ****\n"},
{"review": "\nAHX pretends to be some kind of social reflection on today's US\nrelations between blacks and whites. It also reminds that neonazi still\nexists. Well it falls far behind its objectives. The \"redemption\" part\nis so stupid and expected. The line is not straight with many\ninterrogations. Why? In the end, the movie is too simplistic to be a\nsocial masterpiece and too ambitious to be a good action movie. Norton,\nwell, we saw him in better conditions than this piece of lost time. The\nonly interesting part is the direction. But again difficult to be\ntotally satisfied. Too many slow parts. The b&amp;w / color idea is so\nblatant. I just want to praise the photography that is extraordinary\nand makes me willing to see this guy's other movies. As a conclusion, I\nam shocked to see that Americans consider this movie as controversial\nand a good thinking about their racial issues.\n"},
{"review": "\nDerek Vinyard (Edward Norton) returns from prison to discover that his\nyounger brother, Danny (Edward Furlong), has been following in his\nfootsteps, living the neo-Nazi life of racism and violence that landed\nDerek in prison. However upon Dereks return from prison, his fellow\nHitler-worshippers notice a change in his behaviour and realise that\nDerek is free from the hatred he harboured for the people 'invading'\nhis neighbourhood. The task that lies before Derek is to convince Danny\nto see the errors of his ways before it is too late. An awesome movie\ndelivered by an excellent cast, a definite classic. There is quite a\nlot of violence... a lot of people object to the curb scene, but it is\nnot particularly shocking, and not a film to miss because of it. This\nmovie has one of the best endings you will ever see, it will bring you\nclose to tears!\n"},
{"review": "\n\nPierrot-10 in California said it best.\nAt best, this film belongs in a High School Sociology class. Sure Edward\nNorton gave an interesting and visually arresting performance. (His shaven\nhead and general \"look\" are rather what I perceive a skinhead to look like)\nHis transformation in prison at the hands of the other in-mates and his\ncongenial laundry-mate was completely unbelievable. An easier over-night\ntransformation could not be envisioned by Hollywoodland. Even the black dude\nwho befriends him in the laundry laid it on too thick. What was the Director\nthinking? Probably what the rest of 'em in Hollywood thinks (quite rightly):\nThat the North American Movie Watching Public is a Mindless Sap of Pap\nDrinkers who will Readily Swill Anything.<br><br>4/10\n"},
{"review": "\n\nWhat a bunch of self-righteous, self-serving, pretentious psychobabble! I\nam\nnot sure where to begin attacking this film for the farce it is, but I\nguess\nI should start by saying that this has very little if anything to do with\nwhite pride or racialism, in this country or elsewhere. Believe me I've\nseen\na load of unbelievable farces in my time, but they all seemed entertaining\nsomehow, except this, I don't know perhaps it's my experience with the\nreal-life racialist movement here.<br><br>I really did like the way, that Derek got three years for blasting away a\ncouple of thugs who were threatening his life by breaking into his home,\nand\nwhen he's released it tries to make you feel guilty when the cool,\nrighteous, and enlightened negro isn't getting out anytime soon, since he\ncommitted crimes that obviously weren't in the name of self-defense.<br><br>Also, I'm surprised that Derek's incarceration in the joint, led to his\nultimate rehabilitation as a racist. In reality, it probably would've\naffirmed his previous views tenfold.<br><br>Another thing I liked was the attack on the family. The writers portray\nDerek's father, for instance, as some workaholic, redneck cop w/ a Marlon\nBrando attitude towards blacks and the system. The emotion of this scene,\nis\nalmost enough, to make one feel ashamed for harboring a rational, sound\nopinion or belief on a critical issue such as that. It's revolting.<br><br>There are probably a few points I could rag on, but one thing that really\ncaught my eye, which I found disturbing were the others' reviews. Almost\nno\none here spoted the political agenda of this film, as another propaganda\nfilm, against White America, and that's truly shocking. When will people\nwake up around here, and smell the coffee?<br><br>This review may not be too popular, but I could care less, after all,\nopinions are only opinions.  \n"},
{"review": "\nI remember discovering this amazing and thought provoking movie back in\nthe day when I started high school. It is and still to this day is\nEdward Norton's best acting where he transforms fully and you don't see\nthe actor anymore but instead an intense real life character going\nthrough all the range of emotion and then growing from his mistakes and\ntrying to get his life, friends, and family back on track. Plus who can\nforget that moment early on in the movie where he stomps.OMFG! That was\nthe most gangsta move ever depicted in a movie at the time! The sad\nthing is that I don't think a movie has come out that was this\nrevolutionary since.\n"},
{"review": "\nOne of the best movie in 1998 and definitely the best performance from\nEdward Norton. Absolutely brilliant acting. After his nerd memorable\ncharacter in \"Fight Club\", I guess everybody would never across their\nmind that Edward Norton will be able to play a rough skinhead post\nNazi. Well, he is a cute little guy that look like innocent and\nuntouchable.<br><br>Well, It's called life transformation. And Edward Norton done it very\nwell.<br><br>So was here, in \"American History X\". His character's life\ntransformation (Derek Vinyard) really catching every breath. He played\nit very well. One of the best part when He argue with his father about\nhis Neo Nazi ideology. Almost, I gold my breath as long as it takes.<br><br>Prison definitely taught him so much good things. And his turn out life\nbegins. But, as a ex-con, many people want to try to recruit him again.\nBut, he's wisely said no and back to his family.<br><br>But, the last scene really tragedy that none of people can control.\nLife lesson sometimes hard and sometimes we have to pay price what we\nhad done. But, apart of it, there are always ways to apologize.\n"},
{"review": "\nWith this title i will summarize the main idea of the film. Hard\nlessons through difficult paths and how our choices affect the lives of\nother people.Two very powerful scenes is that with the arrest of \"Derek\nVinyard\" and the other as contrast, with the hero in front of the\nmirror trying to hide with his hand the tattoo. Wonderful performance\nby Edward Norton.Film presents in real and at the same time realistic\nway the life of a family who live through the racist motive of the\nfather. His belief affect in a negative way the two boys of the\nfamily.Mother tries to unite her sons.The amazing with the movie is how\nall this anger and hate replaced with love. The pain of loss is still\nand life gives lessons in hard way most of the times. The final scene\nleave us with a bittersweet feeling.\n"},
{"review": "\nI'm so happy that our teacher made us watch this in school otherwise I\nwould probably never have watched this movie!<br><br>It's a really powerful movie that shows how it works in a lot of places\naround the world. You get to see the seriousness of racism and it\nthrows you back a bit when you realize the truth. <br><br>After watching this movie I was stunned and the entire move was\ndramatic, intriguing, and beautiful. The actors were amazing and I\nabsolutely recommend this movie to EVERYONE!<br><br>As an anti Neo-Nazi movie this movie works really powerful. I think\nthat its a really good thing that this movie is often shown in\nclassrooms.\n"},
{"review": "\nEdward Norton is one of the greatest actors there is, and American\nHistory X is his greatest performance. His actions, as well as those of\nEdward Furlong, Avery Brooks and especially Guy Torry, are flawless.<br><br>It's the story of how a bright kid, Derek Vinyard (Norton), with wrong\nideas gets in to a skinhead-gang because of a cunning leader who uses\nhim for his own purposes, to establish nazism in America. Its\nfrightening to see how much Dereks racistic opinions makes sense when\nhes arguing for them, I almost found myself agreeing with Derek(!), and\nits easy to understand how some people have gone so bad because of\ngroup mentality.<br><br>Then, when we watch Dereks life in prison, it feels like i'm being\nredempted myself. He befriends a black guy (Torry), learns how he got\nmore years there for stealing a TV than Derek got for his double\nmurder, and he is astounded. He (we) suddenly see through his clever\narguing, and discover how stupid his ideas really is.<br><br>This is a hands down MIGHTY movie, and one of the best you will ever\nsee. A solid 10/10\n"},
{"review": "\nThe one reason to watch this movie is for the acting - it is intense -\nesp. concerning the lead character.<br><br>The lead character is immediately interesting because he has a good\nmind - he is bright, clever, consistent and intense. He is\nimpressionable yet searching for his own answers.<br><br>From this character, we see how it is possible to uncover deep\nunderstandings - not about others, but about one's own self. Watching\nthe lead character go through this process is what makes this movie so\ninteresting.<br><br>The rest of the movie doesn't quite match the interest level of the\nlead character, but it is still good. Because it involves racial\ntensions and Nazi references, it's easy to get drawn into the story\nquickly. Overall, I recommend watching the movie.\n"},
{"review": "\n\nAmerican History X grabbed my attention off the bat.  It's an intriguing to\nlook into the world of young, alienated white supremacists.  However,\nmidstream it bogs down into a cliched, sentimental and predictable story.\nHopefully someone will do better justice to this topic in the\nfuture.\n"},
{"review": "\nHands down the most disturbing film I have ever seen. American History\nX is simply outstanding.<br><br>One of the film's great strengths is the great all round performance by\nthe cast. Empire Magazine claimed that Edward Norton did not win an\nOscar for his performance one of the greatest Oscar injustices of all\ntime. And I completely agree. Some of Norton's racist monologues were\nso convincing they bordered on being scary. The rest of the cast did\ngreat as well. I do think, however, that they could have selected a\nbetter actor to play the younger brother, Danny, but that is a nit\npick, the actor in the film did fine but I just think someone could\nhave given a more compelling dramatic performance.<br><br>Overall, what I loved most about the film was the fact that it shows\nracism for what it is, something that is taught, how naïve people can\nbe led to believe anything if their circumstances call for it. The\ndisturbing scenes where very disturbing and encapsulated the sheer lack\nof humanity that comes with such racist cults, such as, in this case,\nthe Neo-Nazi's. Ultimately, American History X is not for the squeamish\nbut it is one of the best films I have ever seen.\n"},
{"review": "\nEdward Norton's compelling and powerful performance of a highly\nmisguided neo-nazi convict is a gripping and highly convincing one, and\nalongside Edward Furlong, this is an unmissable but hauntingly true\ninterpretation by Tony Kaye that really brings home a message that's\nstuck with me forever.<br><br>Whether it was just a cleverly written script, a good director or an\nexcellent cast, I'll never know but what ever it is, it works and it\nworks very well.<br><br>Both Edward's reflect their prime ability to act with their portrayal\nof a fractured background and how it's influenced their behaviours and\nattitudes. It's an emotion evoking display from all the cast and a\nclassic, classic film.\n"},
{"review": "\n\nThe problem with \"American History X\" has nothing to do with the acting. \nEdward Norton and Edward Furlong are both convincing and terrific, despite\nthe fact that Norton's character seems more like a misguided youth than a\nevil neo-nazi (the brutality of his crimes seemed to exist only to mask this\nimpression).  The fact is that it tries to cram too much into too little. \nIdeas and characters are presented that are never followed up on and thus\nthe film seems disjointed.  Despite the fact that Norton's character broke\nthrough a lot of the typical characteristics that typify the neo nazi, the\nprison scenes contain characters that exemplify many these stereotypes.  The\nwell rounded characters (such as Guy Torry as the laundry guy in prison) are\ncanceled out by poorly developed ones (Faruiza Balk and Ethan Suplee as a\ncouple of dunce nazi followers).  The flashbacks really aren't that well\nplaced in my opinion.  The opening scene presented  Norton's character with\nsimply too much brutality, and seemed designed to do nothing more than shock\nthe audience.  The scenes that supposedly develop the background of the\nNorton character are really pointless and do not at all indicate the  nature\nof his beliefs.  His dad telling him that affirmative action is wrong is not\nthe reason he became a crazed nazi.  Tony Kaye clearly wasn't thrilled with\nthe final product, as evidenced by his bizarre \"Humpty Dumpty\" scandal.  He\njust didn't get all of what he wanted on to the screen.  The overrated\nreaction to this movie is hard to explain.  Emotionally, the film is fairly\npowerful and contains a great ending, though it is a bit too preachy.  The\n\"hate is bad\" message was really an elementary conclusion that was drawn to\na sprawling movie that really should have aimed higher.\n"},
{"review": "\nEvocative and controversial film deals with a neo-Nazi (Norton) whose\nlife spirals out of control when he's incarcerated for his crimes, and\ndiscovers that the road to redemption is not going to be without\ncollisions, irrespective of his contrition and new found respect.\nFurlong, as his kid brother, idolises Norton and follows him into the\nfalse promise of hatred, only to find he's been led astray and faces an\neven more arduous return from the brink, if he gets that opportunity.<br><br>Some interesting commentary concerning the seemingly innocuous origins\nof racism, how it incubates through adversity and is then practiced by\nnaivety; a condition to be pitied rather than to fuel reverse hatred.\nNorton is perhaps too accomplished for the material he's given, because\ndespite the film's sombre tone, it's still clichéd and pretty\nsimplistic in its resolutions. <br><br>There's plenty of shock value in the beatings and sodomy on offer, but\nin my opinion, these are milestones in a weak plot that's only vying\nfor conventional pathos. Not strictly the same angle, but I thought\n\"Romper Stomper\" was a more atmospheric and seemingly realistic\nportrayal of the neo-Nazi lifestyle in modern society, sans the\nHollywood gloss.\n"},
{"review": "\nBrazilian's synopsis made me have a wrong idea about this film. Based\non that, one expects it to be a deeply analysis of a prisoner's life.\nSadly, this film is situated in jail for only some few minutes, I\nbelieve less than half an hour, which frustrated me. The whole concept\nis very interesting, a neo-nazi skinhead realizes all the prejudices he\nbelieved in are completely junk. I thought Derek (Edward Norton) would\nbecome good friends with some black guys and understand they're all the\nsame, but he just shares a laugh or two with one black guy and that's\nit, no big thing. Also, I found Norton's acting to be kinda weak,\nspecially when he's \"crying\" in the last minutes. He \"cries\" and not a\nsingle tear falls from his eyes.<br><br>All in all, I believe this is a good concept with a not so rich\nexecution. If you want to see a strong film about prejudice and racism,\nwatch \"A Time To Kill\".\n"},
{"review": "\nAmerican History X attempts to do what many would consider unthinkable;\nto take a vile, disgusting neo-Nazi and portray him into a hero. How\nexactly does it go about doing that? By showing us his human side.\nDerek Vinyard's (Ed Norton,)father is killed by a group of black kids.\nFilled with rage, he becomes prey for Cameron Alexander (Stacey Keach,)\nleader of the local Aryan Brotherhood. Derek makes a name for\nhimself,and it's not long before he lands himself in the clink. To his\nown surprise, he befriends an African-American convict (Guy Torry,) who\nends up saving his life when Derek's skinhead buddies turn against him.\nUpon his release, he is disturbed to see his younger brother, Danny\n(Edward Furlong) following in Big Brother's footsteps.<br><br>I first rented this film out of curiosity, thinking it would portray\nracism in the typical Hollywood, sugar-coated fashion. Oh, how wrong I\nwas. It was easily one of the most brutal films ever. Norton gives an\noutstanding performance, at once terrifying and yet uncomfortably\nhuman. Edward Fulong is also solid as the young, confused Danny.\nBeverly D'Angelo (as their mother,) Elliot Gould and Avery Brooks as\nteachers at their school, and Fairuza Balk as Derek's Nazi girlfriend\nall lend strong support, but, ultimately, it is Norton's show, and he\nruns with it.\n"},
{"review": "\nSome people say that \"Fight Club\" is the born of Edward Norton but this\nmeans that they haven't seen this movie yet. Every time you watch the\nmovie you take the same taste as the first time maybe even better. The\nfirst scene starts with a man making love with his girlfriend that\nmakes you shocked at the first minutes but then the story takes you to\na terrible prison, neo-nazi people defending the racialism so hardly, a\nfamily so close to fall into pieces and so on. The players are chosen\nvery carefully and I think Norton fits to his character very very much.\nThe friendship between Derek and the laundry man Lamont is so similar\nto the one between Andy Dufresne and Ellis \"Red\" Redding in Shawshank\nRedemption movie. This is a movie that everyone must put in his\narchives.\n"},
{"review": "\nThis may contain spoilers! I saw this film for the first time about 6\nyears ago when I was at the beach with my family. My cousin decided to\nrent the film, and told me that he watched it when he was in drug\nrehab. <br><br>The movie is about a neo Nazi Derek Vinyard(Norton) who goes to jail\nfor killing two African American men outside his house. He younger\nbrother Danny Vinyard (Furlong) saw this, but did not testify, saving\nhis brother from a life sentence. Derek gets out of jail 3 years later\nwhen his sentence is up, and finds out that his younger brother is on\nthe same path of destruction. Derek tells Danny about changing his\nways, and explains to what happened to him in jail in hopes that Danny\ndoes not go to jail either.<br><br>This is a very powerful movie that is central theme is about\nanti-racism. The plot is a fairly generic one, someone telling someone\nclose to them to change their ways so that they do not follow a similar\nfate.<br><br>The acting is well done for all of the characters and you can see the\nemotion that Edward Norton has the end of the movie. The movie also has\na unique way of tell the story. For any evens that have occurs in the\npast, black and white film is used, and when it's for the present color\nfilm is used. <br><br>This film is NOT for everyone. If you are offended by racial slurs,\nacts of violence and hate against minorities, strong profanity (mainly\nthe F word), rape, and or nudity, then do NOT watch this film. This\nfilm has all I have listed in the previous sentence in it, and then\nsome. This is the one of the best films that I have ever seen, and I\ndon't think any of the films that were made in the last 6 years even\ncome close to the greatness this film has.<br><br>So if you are not offended by any of the stuff I have listed above,\nthen buy this film and watch it. It's one of th best films of the 90's.\n"},
{"review": "\nI don't want to give too much away to reader's who may not have seen\nthe film, so I won't say much...but if I had to use one word to sum up\nAmerican History X, it would be \"powerful\". This is the kind of film\nthat is missing in the current film environment that is usually based\nmore around flash than substance, ie special effects and a physically\nattractive cast are commonly used to win over audiences as opposed to a\nsolid plot containing powerful messages that actually might make you\nthink. I saw this movie last night and it is a fascinating insight into\nthe insecurity of young people and their desire to belong to something,\nto feel accepted. I believe this theme is equally as prevalent as the\ndenunciation of racism throughout the film. Another thing I liked is\nthat the cast is portrayed as being incredibly human... nobody in this\nfilm is \"perfect\", as we frequently see in other films. From the\nprotagonist to his young brother to the wise English teacher, they have\nall had their share of problems in the past, as well as in the present.\nI think it is a testament to the director and cast that we actually end\nthe film sympathising with a convicted murderer. The moral of the film\nis that hate is baggage, and we reap what we sew in life. We need to\nask ourselves that one question when our lives are veering off course\n\"Has anything I've done made my life better?\". For the protagonist in\nAmerican History X, this simple advice is enough to turn around his\nlife from that point on... but it is too late to undo the consequences\nof his wide-reaching influences, hurting him in the most painful place\nhe ever could have imagined. So once again, this film is sheer power.\nCertainly it is disturbing in parts, and probably not for young\nchildren or the overly sensitive. Nevertheless, it is a fantastic film,\ntruly one of the best of all time. I give it 9 out of 10 stars.\n"},
{"review": "\nThis movie really blew me away! Everything in this movie is good, the\nacting, the cinematography, the music,... Director Tony Kaye did an\nexcellent job directing this film. Its nicely done with the black &amp;\nwhite and colour scenes. Edward Furlong does an excellent job, but it's\nEdward Norton who gives this film so much power. His acting is amazing.\nAfter seeing this movie, I think Edward Norton is one of the best\nactors in the world. The cinematography is also excellent! Also the\nmusic is very good. The film stays in your head for a while after you\nsaw it, because its a pretty harsh, raw movie. If you're looking for a\nmovie that will give you a happy feeling afterwords, don't watch it!\nThis film is a must-see! Its really amazing!\n"},
{"review": "\nI've always been meaning to watch this film, after hearing so much\nabout it. Now that I have, I see what people like about the film, but\nat the same time, find some issues with it. Nevertheless, I really like\nthe film still.<br><br>It's easy to point out the good in the film: good performances, daring\nto handle a tough topic, even direction. So on and so forth. It's a\nmostly solid film. But it has its weaknesses too.<br><br>Here are some of the issues: The story pushes a little too hard for the\nthings that happen in the film.<br><br>Spoilers follow Having the protagonist bond with the laundry guy was a\nlittle too convenient and a little too easy. Not that I don't believe\nit could happen, but based on the protagonist's character, it's asking\na lot for the relationship have so little conflict. Also, the\nprotagonist is supposed to be smart and a rallier of his peers. When\nhe's in prison, he seems to lose his smarts, or they get put under his\n\"ideals\", which wasn't immediately convincing. His moral dilemma is\nalso a tough sell, because we don't get to spend enough time with him\ngetting confused.<br><br>End spoilers In that sense, the film asks the viewers to make some\nlarge leaps of faith and I wasn't entirely convinced. The other issue\nis the ending of the film. The film goes on too long and the end-drama\ndoesn't seem necessary and even goes to the point of being a little\nover-the-top. A little more editing would've helped the ending be less\nmelodramatic.<br><br>Nonethelss, it's good enough to merit watching. And I liked it despite\nmy small frustrations. 8/10\n"},
{"review": "\n\"American History X\" starts with a bang and ends with one as well. When\nthis film was first being released in theatres, there was a storm of\ncontroversy surrounding it due the violent and graphic content;\nhowever, \"American History X\" turned out to become even less violent\nthan one of the most violent films of the 1990's \"Natural Born\nKillers.\" Edward Norton gives the performance of his career as a\nreformed Neo-Nazi determined to deter his brother, Edward Furlong, from\nthe life he once held. Norton is Derek Vinyard a skinhead sent to\nprison for murdering two black boys in front of his home for trying to\nsteal his truck. Norton's performance in \"American History X\" reminds\nme of an earlier film called \"Primal Fear.\" Edward Furlong plays\nDerek's younger brother, Danny. Danny, who has always looked up to\nDerek enters the life his brother Derek led. Derek leaves prison with\nthe knowledge that Danny is in the hateful life he once led and he\nmakes it his mission to get him and his family out of the life.<br><br>\"American History X\" has a lot of detailed scenes of violence, and\nlanguage that opened my eyes to this awful lifestyle. I thought to\nmyself, How could people be so ignorant as to hate others because of\ntheir skin.<br><br>This is one of the best movies of 1998. Everybody who watches this film\nis in for a real treat because there is a twist at the end, which is\nneeded to make the story come complete circle. \"American History X\" is\na film of the journey that travels from the deepest depths of darkness\nto peak of doing what is right.\n"},
{"review": "\nThis movie definitely deserves a spot in the top 250. I gave it an 8\nout of ten, but I can easily see why other posters would give it a ten.\nI could not give this movie a ten because it is not one of those\nclassics that I can watch over and over. The movie is a roller coaster\nride that I felt should have ended on a high note. Sure, I am not a fan\nof the cliché \"perfect Hollywood ending\". However, this is one film\nthat I felt should not have ended in the most depressing way\nimaginable. <br><br>I have read some comments on IMDb.com about the director having\nproblems with the ending. He even went so far as trying to have his\nname taken off the credits and replaced with \"Humpty Dumpty\". I must\nsay that I agree with him. Since I know that the younger brother will\ndie in the end it prevents me from watching this movie very often as it\nis just too depressing. I think a good alternative ending would have\nNorton's character held back for the rest of his life by his record. He\nis way too intelligent to enjoy life while having to work as some sort\nof laborer for the rest of his life. The irony would have been \"an eye\nfor an eye\" as he ruined lives by committing manslaughter and there is\nnothing worse for an extremely smart person to dig ditches for a\nliving. This is something I can definitely relate to. However, his\nyounger brother often supports him financially in the future as a\npayback for saving him from a life of \"naziism\". Norton's character is\npunished for his sins, yet there is some redemption for turning his\nback on the nazi's which regarded him as a hero. <br><br>That is how I would have ended the movie if I was given the script.\nThis alternate ending would be far from your stock \"Hollywood happy\nending\", without being so depressing.\n"},
{"review": "\nThis was a great movie that shows how people change how once you open\nyour mind to feelings and listen to other people you realize that your\nnot always right. the only problem that i had with the film is that\nthey only show the Nazi skins which for people who don't have a clue\nabout skinheads and believe that there are only racist skins is very\nbad because there are 3 types the racist are called boneheads the anti\nracist skins are called SHARPS and the third are called trad skins or\ntraditional skins which is about helping the working class who ever\nthey are. movies like this are great but because they are so great they\nhave very persuasive powers and when there's only one side of certain\nthings shown it can affects people greatly. I'm a trad skin and because\nof American history x several people have wanted to beat me up just\nbecause they don't know the whole truth. this is a good movie but\ndoesn't show everything plus the fat Nazi in the movie has an ANTIHERO\ntattoo and antihero is an awesome band and the movie used there tattoo\nwithout permission which affects them cause there not racist.\n"},
{"review": "\nI watched this movie for the first time this year (2006) when a friend\nof mine lent me this,. I had heard about it and wondered but had no\nidea of what to expect. It is the most powerful movie I have ever seen\nin my forty nine years. I had recently returned from Los Angeles and\nthe beach area after having experienced real life gangs there and was\nworking on a novel following up on these experiences. I don't know if\nwe can ever really solve the underlying racial attitudes that prevail\nin this country. I also saw much of the 'white backlash' recently when\nI was out there and saw all of the characters as believable (both white\nand black) portraying the different gangs and why they hate each other\nand are ready to take it to the death. I feel this movie will help\nyoung people try and realize the consequences of racial escalation. I\nunfortunately feel that this country will never solve this and\nunderstandably the movie leads us to believe this also. The best lesson\nis it takes the consequence of violence to either change or manipulate\nbehavior. As shown, it can go from one extreme to the other without\nresolve. Be prepared with this movie as it leaves no judgement with\neither white nor black...\n"},
{"review": "\nThis is one of those movies everyone needs to see. The reality in it is\nnot beautiful. It can't be wrapped up in a pretty pink box. It's the\nkind of unbearable truth that should make you see that you are exactly\nthe same as Danny or Derek, even if you say in your head, \"I'm not that\nawful.\" It's painful because it has to be. <br><br>I think this is the film that has the capacity to revolutionize our\nflawed society, if only to promote discussion and change some minds. <br><br>Ignorance only spawns further ignorance, so see it; hear the message. I\nrecommend seeing it with children old enough to tolerate violence and\nlook beyond it. Talk about the themes of the movie with kids, as, in my\nopinion, this film was created to spark conversation about the issues\nof hate, prejudice and defining one's self. I suggest this film for\nanyone who plans on living realistically in this \"quick to judge\" era.\n"},
{"review": "\nThis movie blew me away. I had heard of it a while ago but never got\nround to watching it. I cant tell you how glad i am that i did. First\noff, Ed Norton - already one of my favourite actors - is absolutely\nflawless in his portrayal of a Neo-Nazi (Derek) who gets locked up for\nmurdering two black thieves. When he comes out he realises what he has\ndone to himself and his family, which includes a superb Edward Furlong\nof Terminater 2 fame. Told through his eyes the story flashes back to\nthe incidents that lead Dereks incarceration and the impact it has on\nhim. Also featuring excellent performances from Ethan Suplee and\nFairuza Balk this film is the cream of the crop. If you haven't seen i\nsuggest you do - quick. But be sure you can handle plenty of profanity\n(the word f**k is used 205 times) and some disturbing and brutal\nviolence.\n"},
{"review": "\nThis movie will shatter your idea about race relations in the United\nStates. Unlike the hot new Oscar Winning movie about race \"Crash\" which\nwas much more contrived and star-studded, \"American History X\" features\nthe gritty and realistic side of racism instead.<br><br>Filmed both in Black and White (with the scenes involving the past\nevents) and color (with the present tense) the film moved at a pace\nwhich totally envelopes the viewer. Even though some scenes are\nextremely graphic and often hard to watch, the violence and gore in the\nmovie is not gratouitous or without meaning. Each time there is a gun\nor a fist in this movie it is to make a serious point, and or a display\nof power from different characters.<br><br>Actors Edward Norton and Edward Furlong offer the performances of both\nof there lifetimes as the closely knit brothers Danny and Derek.\nNorton, as Derek, is especially chilling as a Neo-Nazi turned\nRedemption Seeker in the story.<br><br>This is an extremely important and very timely movie. See it with your\nfamily members and with people who may not fully understand the\nimportance of race relations in the United States.\n"},
{"review": "\nA truly brilliant piece of film making, it is seen through the eyes of\nDanny who's brother, Derek got 3 years in prison for the murder of\nthree black car jackers, Derek was a neo-Nazi skinhead, you see his\ntime in prison in a series of flashback style shots, when Derek gets\nout of jail he is a changed man, he has left behind his racist past,\nbut when he gets out of jail he finds that Danny has gone down the same\nevil, racist road that he had. It all happens over a 24 hour period as\nDerek tries desperately to save his brother from the same hate fuelled\nbigotry that consumed his life and got him jailed, you find that it was\nthe friendship of a black inmate that made Derek change his views. He\nmanages to change his brothers views but is it too late to protect\nDanny from his earlier mistakes? There are fantastic performances from\nboth Norton and Furlong and I would find it almost impossible to not\ngive this film 10 out of 10. The film is a compelling tribute to the\nunrelenting human spirit and its ability to overcome the intolerable.\nLike Danny did in the film i will end this review with a couple of\nquotes that i think fit well with this film: 'those who can make you\nbelieve absurdities can make you commit atrocities', 'The world is a\ndangerous place, not because of those who do evil but because of those\nwho look on and do nothing.' PROMOTE THE PEACE.\n"},
{"review": "\nQuite possibly the best movie I have ever seen. This movie not only has\nan amazing story, but the artistic value is tremendous. The stark\ncontrast between the black and white scenes versus the color adds so\nmuch to the film. I can't remember another movie that I've seen that\nimpressed me so much artistically.<br><br>Norton embodies his character so well, as does Furlong. They go beyond\ncharacters on a screen to create a relationship between them and the\nviewer. By the end of the movie it's as if you've known them and been a\npart of their struggle.<br><br>If you've not seen this movie, you should make it a priority.\n"},
{"review": "\nAt the start of this film, I didn't know what to make of it. I found\nthe music quite irritating, but I think thats just my opinion, I just\nprefer things to be less obvious , so I don't like too much music\ntrying to explain situations for me, but once I had adjusted, I really\ndid enjoy this film. <br><br>Edward Norton gives a very good, believable performance, and the rest\nof the acting is also very good- there are moments when you can look\ninto the actors' eyes and see the characters' madness, their fear,\ntheir sorrow, but don't be put off by this- it is morbid, but it isn't\ncompletely depressing. It makes some very good points and has some very\nstrong scenes. The timing is also often perfect, with perfect reactions\nfrom the actors' which makes the chaos seem realistic. It's also not\ntoo predictable which is good, and the way it is set out allows it to\nbe cleverly unravelled<br><br>Very good, I recommend it.\n"},
{"review": "\nI have just finished watching this film for the 3rd time and it still\nshocks me. Without doubt it is one of the most controversial films ever\nto be produced.<br><br>The first thing that strikes me as a viewer is the direction and\ncinematography which is apparent from the opening scenes. ALthough it\nis cliché to say that black and white is 'powerful' i believe it is the\nlighting in these scenes that make it so. The shadowy look of the room\nDerek and Stacy are in highlights the darkness surrounding the period\nof time that the scene takes place. Throughout the film the cut scenes,\nflash backs and numerous slow-mo close ups are seamlessly directed and\nprovide the intensity needed for a film based on such an important and\nrage-filled subject.<br><br>The subject is something that the viewer will be aware of before\nwatching the film but when it is explored by Tony Kaye, this is where\nis enthrals me. This could so easily have been a mediocre film about\nrace without the intelligence shown in the script. For instance the\nargument between Derek and Murray and more specifically Dereks speech\nat the dinner table brings to light the political awareness of David\nMcKenna. This way of at least showing that some of the base views\nshrouded by racism are actually logical is something that makes the\nfilm engrossing.<br><br>Perhaps the most engrossing factor of the film is the plot and\ncharacterisation. The 'bad boy turned good' plot is initially not\nparticularly original but the way Edward Norton and Edward Furlong\nportray this is fantastic. How Norton captures the emotions of a man in\nturmoil is exceptional and will always be one of the most memorable\nperformances i have witnessed in film.<br><br>American History X has been widely critically acclaimed and so it\nshould be. It is brilliantly directed and expertly written so much so\nthat a person who watches this film will not only be shocked but\nabsorbed into the political aspects of it.\n"},
{"review": "\nAmerican History X shows an excellent transition from hate to\nunderstanding through friendship and family ties. As a teacher in a\ntreatment facility I see these types of behaviors daily. My job is to\nhelp the residents keep up with school as long as they are in the\nfacility for treatment. Whether they are in for emotional issues or\nchemical dependency issues, they all have behaviors that they feel are\nnecessary for survival. Ed's character - Derek - undergoes a life\naltering behavior/attitude change that is surprising as well as\nbelievable. The writing and acting teams did an exceptional job\nportraying the changes necessary to make the movie complete and\nmemorable. This is a movie that I will buy.\n"},
{"review": "\nOf all the thought provoking and absorbing movies I've seen, American\nHistory X is placed right at the top. A superb plot combined with\nmagnificent acting makes this one of the all time greats. From the\nfilms opening scenes to its gripping, knife-edge conclusion, the film\npowefully portrays one man's struggle to assimilate back into society\nafter serving a prison sentence for race related crimes. The film\nweaves ingeniously between the flashbacks and the present state of\nEdward Norton's character, Derek Vinyard, a one time neo-Nazi, who's\nviolent hatred of America's multi-cultural society culminates in the\nbrutal murder of two men. Derek's imprisonment proves to be a\nlife-changing experience, as upon his release he appears to his adoring\nfamily and friends as a reformed man, who's appearance, beliefs &amp;\nideology have drastically changed. With a clean slate, Derek now faces\nthe gruelling challenge of rescuing his brother from following the same\ndoomed path which resulted in his own incarceration. I was genuinely\nabsorbed with this film from start to finish and although fictional, I\nfelt it fully demonstrated the dangers and damaging consequences of\nracism. Norton's tremendous acting complements a clever storyline,\nwhich still leaves me in suspense every time.\n"},
{"review": "\nI first saw American History X when i was 12, my brother told me that i\nNEEDED to watch this movie and learn from it. If you have seen the\nmovie you know that it is very graphic especially for a 12 year old but\nthe moment i started to watch it i was hooked!!! After that i bought it\nand watch it repeatedly and now being 14 i still watch it every week.\nThe first time i watched it i learned Derek's speech\nimmediately.....Which i cant say because it contains prohibited\nwords.The whole movie is a lesson that it true and is right. And i cant\nbelieve Danny died i cried for hours over that! I believe that Derek\nwas right and that people can change like that but you have to go\nthrough the pain and be in that situation to truly learn. I hate to say\nthat but it is TRUE.<br><br>&lt;3\n"},
{"review": "\nNot a film that I really rushed to see but one that I've now seen again\nand again. Without wanting to give any spoilers, if you thought Edward\nNorton's performance in Fight Club was half decent... see this film. In\nmy opinion career best performances from both Ed Norton and Ed Furlong,\nwith great performances from the rest of the cast. A story of hate,\nhypocrisy and manipulation. A superb script and excellent direction\nmake a film that is emotionally gripping, politically powerful and\nentertaining. Anyone who is not moved by this film is not human ;o) I\nreally can't say anymore aside from this... Stop whatever you're doing\nand go watch it NOW!!!\n"},
{"review": "\nI've seen a lot of Ed Norton's films and he's one of my list of actors\nwhose films I'd watch initially without bothering to read who thought\nwhat of it etc. He was completely scary in this film great acting but\nscary! I do wonder why he didn't get an Oscar or nomination for this\nrather than Primal Fear. He was good in Primal Fear but much better in\nX. It was a little like seeing Sean Penn in Dead Man Walking, totally\nconvincing performance. Also made me think how frightening it is when\nyou are faced with those who are so narrow minded as were a lot his\nfriends in the film, and proof of how much peer pressure is a strong\ninfluence on not just the young but on us all.\n"},
{"review": "\nWhen i started to watch this movie I thought is was just be another\ncrappy documentary about the Neo-Nazis and their uprising. I have seen\na lot of them on the History Channel and they all suck! But as I\nwatched the movie further and further I realized it was more emotional\nthan I first perceived. The movie gave you true to life scenes of what\nit is to be a modern white Skinhead. All the parts were played\nperfectly, Edward Nortons' acting is superb. He plays the role so\nstrongly that sometimes you believe that he REALLY is a Nazi (althought\nhe is not). The drama in this movie is so realistic and very violent\ntoo. For example there is a scene is this movie where Derek Vinyard\n(Edward Norton) is in prison and gets raped by his fellow Skinheads\nbecause Derek believed they did not convey the views of the Aryan\n(Neo-Nazi) brotherhood like they were supposed to. Furthermore, after\nhe is raped, one of his old history teacher in high school talks to him\nabout his brother Daniel Vinyard (Edward Furlong: T2 actor). Daniel is\nDerek's older brother and he is killed at the end of the movie because\nhe was a skinhead. Overall this movie is so true to life that it seems\nlike a documentary but it is a movie. A must watch. ( NOT FOR THE KIDS\nTHOUGH!!!)\n"},
{"review": "\nThis movie was a very well put together movie, although it might offend\na lot of people who watched it, i found it quite interesting, i found\nout a lot about the activities and reactions of \"Skin heads\" and how\nthey coped with society, it was well put together and i liked how they\nkept it in black and white, kinda shows how depressing it was to see\nwhat they did back then and how it still goes on today, i hope they\nmake more movies like this one. Although i would not suggest watching\nmovies like this if you do not like violence, racism, or harsh words.\nI'm not saying I'm a racist or anything like that but i really did like\nthis movie\n"},
{"review": "\nThe movie definitely brought a new perspective of society to my\nknowledge. Before seeing this movie a couple of years ago, I wasn't\naware that there were skinheads in modern day. Even though the movie is\nquite controversial, it brings out a moral which everyone should\nrespect. I love how the movie defined society and the influence of a\nperson's environment, family, and upbringing. American History X was an\nexcellent movie and it is also a great movie to tell others about.\nThere are plenty of uneducated people out there that need to understand\nhow their actions may be wrong. I think that this movie should be\ntaught in school, or at least segments of it. It is a great movie and\nit will definitely pertain to modern society in 5, 10, 20 years because\nthese issues still haven't stopped. Edward Norton perfectly portrayed\nDerek Vinyard, there is no doubt about that. For all the times that I\nhave watched this movie over and over, it still shocks me and it never\nfeels old. It is absolutely incredible.\n"},
{"review": "\nWell,i believe that's how one should make a movie...No doubt , this is\nthe best film i watched last month and probably one of the best i've\nseen so far.Edward Norton's remarkable play,( as we are all already\naccustomed, since many know his Fight Club,25th Hour roles ), as well\nas the script and the direction make it a great movie which makes one\nseriously meditate upon the racial problems. It is just one of those\nmovies , which , after you've seen them , make you feel you're a new\nman:trying to think and question the inertia of social behavior and the\ncruel attitude people have towards some of their somehow different\npeers, let's say of different race or religion. Trying to be myself\nmore open , twice thinking of the facts i hear about and the real value\nof the man next to me - this is the effect this good film had upon me.\nThe story is sad and it makes me hate the way people cause terrible\nlosses with their selfish and ignorant attitude. The Soundtrack is very\ngood. Enjoy it!\n"},
{"review": "\nOK this was a GREAT movie I would give it a 10 out of 10. It is one of\nmy favorite movies. i recommend you should and watch it. The moral of\nthe story is wonderful. And a big plus is that the brothers in it are\ngorgeous lol. I like the part when he gets caught by the cops when he\nmakes him bite the curb. i as well like the part when Danny is writing\nhis story about the his brother Derek. its such a wonderful movie. i\ncried at the end of the movie. so overall the movie was spectacular and\ni recommend it to anyone. so go buy it and you will love it to.or rent\nit hahahahahaha :]. so yea idk what else to write but i have to take up\n10 lines so I'm writing whatever k I'm done bye &lt;333\n"},
{"review": "\nI used to be a skinhead myself, so seeing AHX was a personal one for\nme. Course I'm nothing like that now, but this movie reminds me of my\nold life and gang. Its a 90's hit.<br><br>Trivia - 1. OK so i heard ever since the movie's release in November of\n1998, it was reported that Edward Norton went back and secretly re\nedited the movie to show more scenes with him in it. Course he denies\nall that, but that why did director Tony Kaye file a law suit and\ncomplaint against Norton.<br><br>2. I read in a magazine interview that Arnold Schwarzenegger( one of my\nheros )saw the movie, than called Norton and asked what he did and\nasked if he took steroids. Norton said many times that he \"just ate\nlike a horse and trained hard\", isn't that what they all say? <br><br>3. There is a continuing rumor that in the movie script there is an\nalternate ending. After Derek's brother Danny gets shot at the end, he\ngoes back and shaves his head, which results in him becoming a skinhead\nagain. VERY CHILLING, if they had filmed that scene and put in.<br><br>whoever said this movie is underrated has not talked to enough people.\nThe young generation has embraced this movie ever since it was released\non DVD and home video. Everyone i talk to is so impressed with it. Its\npretty good I'm my opinion, but not great. A lot of scenes are too\nconvenient to the story. But its still a movie to own :)\n"},
{"review": "\nThe entire cast and film have my absolute respect. Edward Norton is\noutstanding. This was truly one of the finest examples art and talent I\nhave seen. I was on the edge of my seat through the whole picture. I\ncommend all involved in presenting us with such a raw and stunning\nportrait of human nature. It was a combination of beauty and atrocity,\npower and weakness, love and hate. It is the perfect reflection of an\nimperfect world. Edward Norton proves that he is Oscar worthy in one of\nthe most powerful roles I have ever seen. This film portrays very harsh\nrealities and still manages to shine. A standing ovation to the entire\ncast. I do have to say how ever, they should fire whoever it was that\ndidn't promote this film.\n"},
{"review": "\nThis is a totally powerful film. The actors did a great job and the\nstory was not only moving but a very strong one. This movie teaches all\nabout what hate can do to many people because it gets you nowhere.<br><br>The movie's ending had a message saying that hate is not the right way\nto solve things. There is good and bad in every race no matter what to\ntell the truth.<br><br>Edward Norton did a great job in playing the role of a reformed\nskinhead and showing his Neo Nazi brother (Edward Furlong) the error of\nhis ways.<br><br>Neo Nazis still exist today in America and many parts of the world.\nThis movie was meant to reduce the Neo Nazism, but according to some\npeople it did more harm than good. But to many people it did more good\nthan harm according to a friend I was talking to in college.<br><br>The ending is sad, but it is neither good nor bad in which says \"hate\nis baggage, life's too short to be angry the whole time\".<br><br>This movie gets a 10 out of 10\n"},
{"review": "\nThis movie is absolutely a classic. If you can watch this movie and\nstill be a racist afterward, then there is no changing you. It is a gut\nwrenching tale of a racist man learning the hard way about true\nequality. Ed Norton's performance is incredible. The use of black and\nwhite and color is great. The black and white lets you know that they\nare reflecting on things in the past, but also is metaphorical for a\ntime when Ed Norton looked at everything as either black or white and\nthe color parts reflect the times where he had changed and saw everyone\nas the same color. It is a very well directed movie and should be\nconsidered at a top 10 of all time.\n"},
{"review": "\nOK. I got this movie out from the library, and was watching it and feel\nasleep just after the black guys got killed and the film changed to\ncolor. It just looked like another one of those crazy American youth\ntype films. I saw the comments on this site, however, and thought I'd\nbetter have another look as I still had it out.<br><br>On watching it a second (first?) time, I overlooked the lecturing\n(American style) and bad language, and got through to the end. I also\nfound out why the color was being switched on and off. The here and now\nwas in color and the past events in black and white. <br><br>The film actually got better as it went on. It has an important message\nof forgiving your enemies and that race hatred doesn't pay. It is also\nbest to get along with everyone if possible, and not try to annoy\nothers.<br><br>The film also acts as a sort of documentary of American city life, and\nthe problems that young people have. I guess that racism is alive and\nwell in most places.<br><br>Unfortunately things don't turn out as expected, but they never do in\nreal life anyway. I think it is a good film for people to watch, but it\nmay have limited appeal for women due to the extreme violence,\ncontinual shouting, and bad language. I can see now why it is so highly\nrated, and it is a very good film. 9/10\n"},
{"review": "\nAmerican History X is very well down, with amazing acting (as usual) on\nthe part of Ed Norton, in particular. I was also particularly pleased\nwith Avery Brooks' performance. Ed Norton excels in playing dynamic\ncharacters, and this performance is in-line with his acting in Fight\nClub and The People vs. Larry Flint -- his performance is an honest and\nbelievable portrayal of self-recognition and redemption<br><br>The camera work and direction are well-designed and artistic. If\nthere's one thing this movie lacks, however, the writing is not on the\nsame par as the rest of the movie -- the overall screenplay makes a\nclassic, but the individual lines fall flat and some of the mechanics\nused for exposition fall pretty flat.\n"},
{"review": "\nThis is one of my favourite films, and I feel one of Edward Norton's\ngreatest accomplishments. He gave an outstanding performance, and was\nmagnificent. This movie is an excellent written movie and acting in it\nis fantastic. The acting by Edward Furlong is also brilliant, he gave a\ngreat performance and was so convincing as the troubled teenager. The\ntransformation of Derek after coming out of Prison is amazing. I was\njust really touched by this movie. Edward Norton is my favourite actor\nand every film he does is great to me, but I felt that this film was\nbrilliant. All the acting in this film was great and all of the actors\nand actresses in this film accomplished a lot in this film and they all\nseemed to have been really dedicated to this movie.\n"},
{"review": "\nAmericam History X,is a very good movie. I saw it when it first came\nout in the theaters, and I was directly changed on some of my point of\nviews, that I had before the movie. Edward Norton, which gained about\n30 pounds of muscle for this movie was astonishingly, with his roll and\nhow he played it. Edward Furlong also played a good role. Here is a\nreview of the movie. The story follows an intelligent young man named\nDerek Vinyard (Edward Norton) and his decline into the world of\ndisillusion and hate known as White Supremacy. Derek Vinyard (Edward\nNorton) buffed up to 190 pounds, with a shaved head, swastika tattoo,\nbiker goatee and a feral, angry gaze, he is one scary image. Once a\nthoughtful and easy-going teen, he soon begins his change when his\ncasually racist firefighter father is killed while trying to put out a\nfire in a black neighborhood. Falling under the wind of a neo-Nazi\n(Stacy Keach), Derek becomes a recruiting agent for local white kids.\nWhile the local movement grows, Derek gets deeper and deeper in,\npolluted more and more by hate. This all comes together when Derek\nkills two black gang members who tried to steal his truck. He is caught\nand sent to jail, where he is shown the error of his ways. The hard\nway. With the help of one of his former teachers (Avery Brooks), Derek\nbegins to reform. However, it may be too little too late. While Derek\nwas in prison, his younger brother Danny (Edward Furlong) is starting\nto head down the same path. Now, aside from trying to leave the world\nhe created he has to save his little brother from it too. I had do to a\nmovie review for my English class so I watched the movie again, and I\nwas not nearly as pleased as the first time. The movie seemed kind of\nall fake and so played out. You knew what was going to happen next. So\nI guess if I was you I would only see it once, and I would definitely\nnot buy the DVD unless you collect movies, because this would be a very\ngood movie to add to your collection.\n"},
{"review": "\nThis movie is by far one of the most powerful movies I have ever seen.\nI love how everything that occurs in the past is in black and white and\neverything in the present is in colour. Edward Norton does an amazing\njob as Derick. The music choice is perfect. The camera angles are\noriginal. I recommend it to everyone, young and old. The director\nportrays the issue of neo-nazi's and rasism from the white supremist's\npoint of view. By the end of the movie you are sympathizing with Derick\nand his brother Danny, despite what they have done to blacks and other\nminorities. It shows how rasism starts and how usually starts at home.\nParents have a huge influence on how their kids view the world, and the\ndirector acknowleges this. What I also like about this movie is that it\nshows how people can change, but sometimes it is too late.\n"},
{"review": "\nEdward Norton and Edward Furlong give a flawless and incredible\nperformance. American History x is a phenomenally written movie that is\nTERRIBLY UNDERRATED. Perhaps it was the controversy surrounding this\nfilm that caused it to be silenced in the media, I only got to watch it\nbecause of \"chance\" (luckily I heard it from a website). Anyways, it's\nabout a man named Derek whose life is presented out in pieces\nthroughout the film on his Neo-Nazi beliefs, and the progression of his\nrecovery in prison to discover his beliefs and anger have only\ndestroyed him throughout the years. He then must prevent his brother\nDaniel from pursuing the same path. This movie is beyond words. It is\ndefinitely in the Top 10 movies I have ever seen. There are just no\nwords to describe how moved I felt when the film was done. I recommend\nit to anyone who is in the mood for watching a fantastic movie. To be\nmore accurate, I would give this movie 9.9/10, not a perfect score\nbecause the ending was too sad.\n"},
{"review": "\nThis movie is directly related to Spike Lee's \"Malcolm X,\" where both\ncharacters experience the metamorphoses of: 1) Self-hate 2) Extreme\nhate of viewed opponents and oppressors 3) A balance and realization<br><br>I've learned a lot from these two movies. They speak directly of the\nbalance that exists everywhere, which is inevitable and everlasting.\nBalance always exists, but the process by which it is achieved can be\ndrastic and violent sometimes. (Derek kills two black men; later, his\nbrother is killed by a black teenager.) So, extremity can sometimes be\nthe only way to go about solving things, but it ultimately needs to\nbalanced out with logic. White supremacy in slavery leads to black\nsupremacy in the civil rights movement, which leads to white supremacy\nimmediately after. I used to think it was weak to be balanced in my\nviewpoints of the world. While it is okay to be angry and believe\nthings are unfair, finding balance is the ultimate outcome. Well,\neither you find balance for yourself, or balance finds you, and\nsometimes it isn't the most pleasurable lesson.<br><br>After birth comes death, and from death comes birth.\n"},
{"review": "\nDowngraded from an 11 out of 10 because of the graphic violence;\nhowever, the real reason for the excellent review is that without the\nviolence, the story would have been worth an 11 out of 10. Having seen\nthis movie the viewer will see bigotry portrayed as naked\ndiscrimination and the deceitful mask of warmongers mimicking great\npeaceful demonstrators hiding the excuses for war in other leaders\nsuccesses. This warns that seeking the same fame without the same\ndetermination and honor makes for the revelation of false motives. This\nmovie is a landmark in the industry. A must see for those who believe\nthat they have to hate someone. Neo-Nazi skin-heads are seen by the\nparents of the neighborhoods and find themselves reacting to the anger\nof a suppressed nation of black youths. They seek solace in the act of\nforming their own gangs, believing that there is safety in numbers. The\nstory unfolds to tell a very rich story that makes people realize why\nthere was such an attraction to hating another people for the lie of\nunifying themselves for a common cause, finding themselves divided.\n"},
{"review": "\none fine film. Many great points with suburb acting and camera work.\nOne finds the back and forth action handling to be just on target.\nGreat direction with some fine acting. One can quickly find many\nparallels to the present day world. Even though the \"f\" word is used\n204 times it somehow fits and doesn't feel to me overused as when Red\nFox does it. See the movie. Study the movie. Have your college\nprofessors use it in a film class. GREAT!!The dinner scene is one to be\nremembered with your own dinner scenes. The fact that a black man\ndefended him in prison was well used to point out that the Nazi's hated\nothers not like them. The hatred of others was shown to be foolish,\nfalse and just plain dumb.The younger brother was so easily taken in by\nthe older brother shows how easy we are lead by others and others\nideas. Fine film for discussion and to see at least six times.\n"},
{"review": "\nOne of my top 3 movies if not my favorite. Edward Norton and Edward\nFurlong give flawless performances and are very believable. I like how\nthey portrayed Norton as a white supremacist. Not as a redneck but as a\nnormal guy whose life is changed by a dramatic event, which leads him\nto join a skinhead group and later challenges his beliefs. Although the\nmovie is brutal and very graphic, It goes along with the plot unlike\nsome slasher movie just about gore. There is a reason to the violence\nand it shows during the course of the movie. This movie is not for the\neasily offended but I would recommend it to anyone that appreciates\ngood cinema and enjoys films that make you think.\n"},
{"review": "\nAmerican History X is THE best film I have ever seen in my life. The\nfilm is completely breathtaking with two immense performances. Edward\nNortons spell bounding performance receives so much praise and\nadmiration that I think Ed Furlongs performance is overshadowed. This\nis a complete shame as Furlong as absolutely spectacular in the role of\nDanny and portrays the \"young, angry white boy\" superbly. The film has\nno rest bite whatsoever and continuously amazes throughout. With most\nfilms there is a peak that you reach mid way through and then you can\nlook away and breathe, but American History X permanently shocks and\nsteals your breath. It is truly brilliant and Tony Kaye has definitely\nnever directed a film as good as this, and he is extremely unlikely to.\nIf you haven't seen it shame on you. If you have and you aren't in love\nwith it shame on you too. WAY WAY WAY BETTER than the Godfather, Pulp\nFiction, Lord Of The Rings and anything else you can show me.\n"},
{"review": "\nJesus, that was a wonderful film.From beginning to end,this movie is a\nwild mechanical bull ride.It begins sadly, and it ends yet worse. It\nwas really an emotional roller-coaster, at least it should be if you\nhave empathy towards other human beings.It is beautifully directed, i\nenjoyed the way in which the screen would turn black and white during\nflash backs, Edward Norton looked more impressive that way, and in slow\nmotion.I am not a Neo Nazi or Skin Head, but that tattoo which Norton's\ncharacter bore on his chest was simply amazing. He was a sort of\nFuhrer, for the twenty-first century, somebody who we could relate to\nbetter than we could Hitler, as gangs in the slums are something which\nis common today, and quite out of control.<br><br>Tony Kaye was an amazing director in this film, he delivered it quite\nrealistically, and it was hard not to be touched by such a dramatic\nseries of unfortunate events. This is not to mention Edward Norton's\nacting, which was even better than on the set of Fight Club. If you\nhave failed to see this movie yet, and you are a big movie fan, then\nyou are wasting your time by reading this. See it my friend...witness\nthe beauty American History X.\n"},
{"review": "\nTo me this powerful film shows Ed Norton as one of our most impressive\nand gifted actors of a generation. His excellent portrayal of Derek, a\nbrutal Nazi loving thug who through his life changing experiences in\nprison slowly realises the error of his ways. Supported by a fine\nperformance by Edward Furlong who plays his idolising, yet astute\nyounger brother Danny the film rolls a emotional ride of hate for\nblack, Jewish, Asian, if fact anyone who does not fit with Derek's view\nof a normal American to the love for his brother and other members of\nhis family. Extremely violent scenes in the film are not only justified\nto establish the utter ruthlessness of Derek but probably a true\nreflection of how these people live and think.\n"},
{"review": "\nDerek was a crazy racist before he was sent into the prison. His action\nalso affected greatly his younger brother Danny. Even Danny took him as\nhis model. But Derek got the most important lesson for him in the\nprison. After leaving the prison, he was not a racist anymore. Although\nhe tried to persuade Danny to abandon racial discrimination, Danny was\nstill killed by his black classmate.<br><br>At present racial discrimination not only happens in America, it is\nalso a headache for other countries. As advanced animal, the human\nbeing cannot live in harmony. That absolutely is shameful for the\nmankind. We have to learn much from the natural world. People are born\nto be equal, but we cannot respect each other. Only RD is eradicated,\nthe earth is just a good place to live for the mankind.<br><br>If Edward Norton won the Oscar award for this role, I will not be\nsurprised. He also had wonderful performance in Primal fear, Fight\nclub. He has the ability to play any role.<br><br>A movie worth everybody to watch and think. 9/10\n"},
{"review": "\nAmerican History X is a very important movie. It delivers its point\n(the effects and seeds of racism in middle-class America) unabashedly.\nAt points the film is grotesque (I won't say what, but I was trying to\ntell a friend about one scene and I couldn't even say it, it was so\ndisturbing!!!) and sickening. Even just the mindset of Derek (played\nMASTERFULLY by Edward Norton) at certain points in the movie was\nhorrifying. However, racism itself is a horrifying, electric issue that\nshould not be handled lightly. A movie to compare American History X\nwith is Crash, which tackles the issue of racism, but with a lot less\nsubtlety and sincerity. And though it bears an R rating, the film feels\nso restrained, like the actors made it just to have something\nactivist-ish on their resumes. American History X, however, shies away\nfrom no subject, and in its honesty delivers an uplifting message and a\ndire warning. The script and cinematography are excellent, but what\nstands out most is Edward Norton's performance. He is my favorite actor\n(and I don't take that title lightly), and gives a good reason why in\nAmerican History X. Such complex, wildly different emotions (his\napparent satisfaction killing some black men who were attempting to\nsteal his car, his turnaround, guilt, and utterly moving explosion of\ngrief at the end!!!!!!!!!!!!!!!!!!!!!! Overall, an incredible movie.\n"},
{"review": "\nI haven't seen a movie in a long time that can come even close to\ntopping this one. The acting in this movie is phenomenal, the plot is\ngreat and the director did an amazing job. This is by far the best\nmovie made in the last ten years. there is something about this movie\nthat makes me want to keep watching it over and over. the actual story\nline is amazing and holds this picture together perfectly. i would give\nthis movie a ten on any scale that you can give me. this is one of the\nbest movies that i have ever seen, and i am very hard to please when it\ncomes to movies. movies have been going down an a quality scale for 20\nyears now and this movie is one of the only reasons that good movies\nare back.\n"},
{"review": "\nThis movie was a very touching movie, and I really enjoyed it. I had\nheard about it in the past, but I didn't seem too interested by just\nlooking at it's DVD cover. I heard from a friend that it is a really\ngood movie, and knowing that my friend and I are very similar in what\nwe enjoy for leisure, I figured I'd give it a try. I watched the movie\nand really enjoyed it. So much relation to reality and suspenseful\nalso. I really liked this movie, but I shouldn't ramble on and keep\ntelling you all that I enjoyed it. You should all just go see it, rent\nit, or buy it. I would buy it, because it is very worthwhile. The\nending is hardcore and it ends very sharply, but it makes complete\nsense if you watch the whole movie through. I give this movie a PERFECT\n10 for EXCELLENT storyline, plot, characters, and the outline of how it\nrelates to reality. GO SEE IT NOW IF YOU HAVEN'T SEEN IT!\n"},
{"review": "\nI have seen American History X several times and now own the DVD. This\nis a superb film, with focus on Edward Norton's character, \"Derek\nVineyard.\" Derek is a neo-Nazi growing up in Venice Beach, CA. The film\nis very moving and a realistic account of race relations in Southern\nCalifornia, and also of the inner workings of prison life. The ending\nof the film was a bit sad, and was probably the weakest part of the\nfilm, in my opinion. The film moves along superbly, however, after\nDerek is released from Prison, he is a changed person, and in my\nopinion, I'm not so sure he would have done a complete 180 like that,\nhowever, it makes sense for the films sake. All in all, this is very\nwatchable. Certainly a rated R movie, very graphic and strong language.\n"},
{"review": "\nI don't know what it took me so long to see this movie, but i finally\ngot the chance to. This is one of the most greatest movies i have ever\nseen. I highly recommend that everyone watches it. Although that it may\nbe a little controversial and a little racist, it only depicts the\nlives of others and how people lived at the time. Although the ending\nwas a little upsetting, the way the movie was made was totally\nspectacular. For those of you who haven't seen it, you really have to.\nIt's a real must see. Everything in the movie is amazing how's they\nshow the sequence of events and everything. Great actors, great story,\ngreat movie. 10/10.\n"},
{"review": "\nAn absolutely strong story. Although some exaggeration of the\ncharacters and bad language used, the film fulfills its original\npurpose: to shake consciences and thoughts. I teach ESL in a High\nSchool in San Bernardo Chile and I have used this picture as part of\nthe English class- Fourth Grade - My students have done some previous\nactivities,watched this film and discussed after watching. They've\nalways been very interested and impressed with the plot and Now, one of\ntheir assignments is to post some short comments about American History\nX here in this section or in the Message Boards. greetings,from Chile\nCmact.\n"},
{"review": "\nWithout a doubt one of the hardest films I've hard ever seen and I can\nsay honestly that it narrates a reality that unfortunately existed and\nthat increases every day. The interpretation of Edward Norton left me\ndumb, that glance that directed to camera when he was arrested\ntransmitted the true rage to me that feels this people inside them. I\nrecommend this film to everyone who is interested on knowing that the\nnew Nazi movements are not something to take as a joke, that reality is\nin the streets and this history shows the horrors that this people\ncommit. In my opinion the only failure that it has is that the\npersonality of the small brother is not too much worked. In addition I\nwant to say that the last lines that are read in the film have a\nmessage of which all we would have to learn: the life is too short to\nspend it being always upset. Sorry for my bad English...\n"},
{"review": "\nA seven is not a rating that I give freely. It takes a lot to impress\nand this movie has done that. Another perfect performance by Edward\nNorton his character shows the most depth of any on-screen. The film\nspeaks volumes about racism and prejudice in general. I loved the idea\nof doing all the flashbacks in black and white. Although I realize that\nthis is done in a lot of \"flashback\" type films, given the whole theme\nof the film I found it especially fitting. The characters in the movie\nsteal your heart, you spend half the movie hating them, and the other\nhalf feeling immensely sorry for their closed minded views.<br><br>The only reason that this movie didn't get an 8 or 9 rating is the\nending. I found it dead depressing, and left the movie feeling betrayed\nand deceived. But overall I loved it. One of the best movies I've ever\nseen.\n"},
{"review": "\nLife's greatest lessons don't often come in little convenient packages\nand this movie is one that will teach you one aspect of American Life\nyou don't want to miss. We all know hate is bad, that society is full\nof angry factions blaming each other for whatever pain and suffering or\nthe dwindling American dream that used to shine with glory. But times\nare different now. Maybe America wasn't meant to be the way it is now;\nmaybe the framers of this nation had in mind a different vision of what\na free land should've been. But, then again, if history has taught us\none thing, it is that we can not change history. We can change our\ndestiny. We can change the present if we set our minds to it. But we\ngotta act. This movie doesn't merely teach us that hate is bad, the\nmore important lesson is that, to make a difference in the world, we\nhave to use our words and actions.\n"},
{"review": "\n\nAmerican History X has been by far one of the best movies I've ever\nviewed. It shows you the different conflicts about how people are\ndealing with racial issues and how this guy (Derek) didn't want his son\nto make the same mistakes as he did when he was younger. This movie is\nvery surreal and helps you depict the different views of the issues\ngoing on in this movie. I think the most emotional part of this movie\nwas the very end. I'm not going to ruin it but by the way the movie is\ntold. It's like everything just builds itself up to that very last\nscene. Everything the characters experienced was sent to a halt and was\ngiven a true glimpse of the cruel reality we live in.\n\n"},
{"review": "\nA man put in prison for murder and racism is freed and wants to make\nsure his little brother doesn't go down the same treacherous path as he\ndid.... Derek Vinyard (Edward Norton) used to be the kind of man that\ncould be described in no other words than \"racist\" and the shadow of\nHitler. And only after he lived his days in prison, did he realize how\nwrong he was about everything. When he was freed, he left that\nlife...but that life continued around him. His little brother, Danny\nVinyard (Edward Furlong), was taught the same things he was taught, but\nDerek didn't want it that way. He told his brother of what happened on\nthose many days in prison, how he became friends with an Af/Am and was\nbeaten up by a gang of Caucasians because of it. Soon their family sort\nof \"patched up\" and was like new again....until a twisted ending.<br><br>I loved this movie. Not only was it moving and dramatic, but also\nbecause of how great and talented all of the actors were. I've never\nthought so much of how we should appreciate the fact that we're all\ndifferent. I couldn't believe that human-kind could be so hurtful to\nother people, our brother and sisters. The ending (which I won't speak\nof) was completely surprising. I gave it a 10 because of the lesson it\ntaught me and the lesson it could teach others.\n"},
{"review": "\n\nThis film is easily the best performance of Ed Norton's great career\nthusfar. He shows his blue collar side that will work hard to perfect\nhimself for any role. <br><br>The problem here is that the rest of the film lags behind his talent.\nHe has little help from the supporting cast, a poor director, and a\nvery soft script in some areas. My biggest problem with the film is\nthat the story was told with flashbacks. We miss out on a great\nopportunity to grow and change with Derek. The prison scenes are all\nbut pointless, since we already know he comes out reformed and\nnon-violent. Why should we bother watching the middle of the movie? I\nwould have liked this movie a lot more if it was done in linear\nfashion. <br><br>The movie also builds itself on shockingly violent and strong scenes.\nThese are done very well (the rape, the curb incident, the rant by\nDerek on the news after his father is killed, etc.) However, when we\naren't watching one of these scenes, the movie doesn't have much to\noffer.<br><br>The only member of the cast who does well in her role besides Norton is\nBeverly D'Angelo as the troubled mom. The Nazi influences in Derek and\nDanny's lives are all clichéd characters that add nothing to the film\n(Ethan Suplee, Faruiza Balk, Stacey Keach). Ed Furlong didn't sell me on\nhis character being a potentially violent skinhead. Also the attempts\nat building up the fraternal bond between Derek and Danny failed. It\nseemed like Norton was carrying Furlong through the whole scene at the\ndiner. <br><br>Overall i still gave the movie an 8. It seems like I've bashed it here,\nbut Norton was good enough to wow me, and part of me thinks we had no\nmore character development BECAUSE the director wanted Norton to carry\nthe movie.<br><br>Not a bad idea in the least. I was also a fan of the ending, the\nmessage was a simple one, but one that I happen to agree with\n\n"}
]