[
{"review": "\nDon't be fooled by the title. Make sure you know what you're getting\nyourself into when you watch this film. Bridge of Spies is literally\nabout the Cold War Bridge of Spies, where Soviet/US spies were\nexchanged through negotiations. This is nothing like \"The Americans\"\n(FX TV drama - for some high unrealistic and over-sexualized espionage\naction - redirect here) and the most action-packed scene you will see\nis Francis Gary Powers getting shot out of his U2 plane during his\nmission. <br><br>Bridge of Spies is really a historical/legal drama. And based on my\npreliminary research, they seem to be getting most of their facts\nright. Obviously a little bit embellished for Hollywood's sake, Bridge\nof Spies does a fine job as a historical docudrama. There is a lot of\ntalking, but it's meaningful talking. At times, the film can be a\nlittle slow {opening scene, especially}, but give it a chance and you\nmight enjoy it. History buffs like myself will definitely enjoy it. But\nthrill-seekers, you're better off to see the new James Bond movie\ninstead.\n"},
{"review": "\nThis movie hit me really strangely.<br><br>I was expecting a political drama about the cold war, and while indeed\nit was that, I was not expecting to have so much fun and for Bridge of\nSpies to be so humorous. <br><br>The Coen brothers writing a movie Steven Spielberg would direct just\nsounds like a winning combination and it really was. Sealing the deal,\nwas a great performance by Tom Hanks.<br><br>Tom Hanks does what he does best, by playing an everyday man in an\naverage life. James Donovan was just an insurance lawyer who gets\ncaught up in the middle of the Cold War. Bridge of Spies, starts him\noff so normal and then turns his life into quite an adventure.<br><br>And I do mean adventure. In the hands of Spielberg, the movie's visuals\nwere large and epic. I was expecting this movie to feel more like his\nlast flick, Lincoln. Instead it feels more like Indiana Jones, as James\nDonovan travels to Berlin at the time when the wall was being\ncompleted. <br><br>Watching Hanks play Donovan who is just swept into an overwhelming\nsituation and just keeps his cool and his charm is just highly\nenjoyable. <br><br>Totally loved Bridge of Spies, It's one of the best team ups between\nHanks and Spielberg and even though Lincoln was a great movie, Bridge\nof Spies is everything Spielberg is capable of. So entertaining.\n"},
{"review": "\nBridge Of Spies is a historical drama film starring Tom Hanks,\nco-written by the Coen brothers, and directed by Steven Spielberg. Even\nthough its subject matter of the Cold War is something I know very\nlittle about, I thoroughly enjoyed it and I am now more interested than\never to learn more about it. I rank it among the best of Spielberg's\nmost recent movies.<br><br>In 1957, tensions between the United States and the Soviet Union during\nthe Cold War are at their peak. Spies from both the American CIA and\nSoviet KGB are a major threat to the security of both world powers and\neach side often resorts to hasty measures to stop any classified\ninformation from being leaked. In Brooklyn, New York, Rudolf Abel is\narrested under the suspicion of being a spy. James B. Donovan (Tom\nHanks) is assigned as Abel's defence lawyer. However the idea of\ndefending a potential Soviet spy proves to be an unpopular and\ndifficult task for Donovan. Meanwhile, over in the Soviet Union, an\nAmerican spy plane pilot Francis Gary Powers is shot down and captured\nby the KGB. As a means to ease tension between the two warring\ncountries, Donovan proposes a swap between the two prisoners of war,\nAbel for Powers.<br><br>Despite containing barely any action scenes and being almost entirely\nmade up of talking, the film never feels boring or slow paced. This is\nmost likely due to the Coen brothers' clever screenplay and Steven\nSpielberg's creative direction. There were many suspenseful moments\nwhere it felt like the prisoner negotiations would go horribly wrong\nand that kept me on the edge of my seat. Tom Hanks also gives another\nmemorable performance as James B. Donovan, once again proving his\nversatility as an actor.<br><br>I rate it 8.5/10.\n"},
{"review": "\n\"Everyone deserves a defense. Everyone matters.\" James B. Donovan (Tom\nHanks)<br><br>In Bridge of Spies, Steven Spielberg once again masterfully goes to the\nhistorical drama with a righteous man's theme (think Schindler and\nLincoln for starters). This time lawyer James B. Donovan is asked to\ndefend an accused Soviet spy, Rudolf Able (Mark Rylance, superb), in\norder to show the world the American justice system is democratic. <br><br>The story is \"inspired by true events\" with the outline of the exchange\nof Able for U-2 downed pilot Gary Powers historically accurate. As\nusual, Spielberg recreates the times with the atmosphere, cars, and\nfilm noir aspect of a spy thriller in the figurative and literal Cold\nWar. He said, \"I always wanted to tell the stories that really\ninterested me in my personal life\u0097which are stories about things that\nactually happened.\"<br><br>Hanks is central to Spielberg's vision of the lone hero defying the\nodds and supporting the highest ideals of the American Constitution and\nthe individually virtuous man. Never does Hanks overplay the good-guy\ncard; he's just very adept at playing an everyman not always right but\nalways righteous. <br><br>The dialogue is crisp, a no fooling around typical of Spielberg and\nHanks but a charming bad guy as well: James Donovan: \"Aren't you\nworried?\" Rudolf Abel: \"Would it help?\" As producer Kristie Macosko\nKrieger commented about Spielberg, \"He's got a childlike sense of\nwonder. He never gets tired of hearing stories . . . . \" Bridge of\nSpies is vintage Spielberg with a Lincoln-like atmosphere, righteous\nhero, and intriguing multi-plot, an entertaining spy story brimming\nwith humanity. <br><br>As the director says, \"This is more about very smart people in\nconversation with each other, and the sword of Damocles hanging over\ntheir heads is that, if they make the wrong decisions, it's the end of\nthe world.\"\n"},
{"review": "\nBridge Of Spies is a well acted, thrilling, smart Cold War drama that\nfeatures a Oscar worthy performance from Tom hanks. Bridge of Spies\ntells the true story of a Cold War spy swap, during the height of\ntension between the U.S. and Russia. The time period was so tense that\nwhen films can capture that tone it's usually special, that being said\nthe film doesn't quite capture that tone, but it comes close. Tom Hanks\nperformance, and Spielberg's seasoned direction manage to save the\nfilm. When the film could have been slow, they save it by using either\nhumor, or great acting, Acting that will most likely get Hanks an Oscar\nnomination. In the end Bridge of Spies isn't as good as it could have\nbeen, but is still admittedly a great film that will undoubtedly get\nplenty of recognition at the 2015 Academy Awards.\n"},
{"review": "\nIn 1957, during the Cold War, the insurance lawyer James B. Donovan\n(Tom Hanks) is assigned by the Bar association to defend in court the\nSoviet spy Rudolf Abel (Mark Rylance), who was captured by the FBI.\nDonovan is successful and Rudolf is sentenced to life imprisonment\ninstead of death penalty. Meanwhile the American pilot and spy Francis\nGary Powers (Austin Stowell) is arrested by the Soviet government while\ntaking photos from a spy plane that crashed. The CIA summons Donovan to\nhelp in the negotiation to exchange the two spies. When Donovan learns\nthat the American student Frederic Pryor (Will Rogers) was arrested in\nthe border of East Berlin while trying to bring his German girlfriend\nto the West Berlin, he decides to include the student in the\nnegotiation. However his proposal is not supported by the CIA that is\ninterested in Powers only. Further, Powers is prisoner of the soviet\ngovernment and Pryor is prisoner of the GDR (German Democratic\nRepublic). Will Donovan succeed in his intent?<br><br>\"Bridge of Spies\" is a great spy thriller based on a true story in the\nperiod of the Cold War. The plot is engaging and the cinematography,\ncostume design and art direction are amazing. It is unnecessary to\ncomment the direction of Steven Spielberg and the performance of Tom\nHanks, perfect as usual, but it is impressive the capacity of\nnegotiation of James B. Donovan. This American lawyer is shown as an\nimpressive negotiator, having cold blood to make tough decisions. The\ncredits informs that Donovan has been also successful negotiating later\nin Cuba the release of prisoners. My vote is eight.<br><br>Title (Brazil): \"Ponte dos Espiões\" (\"Bridge of Spies\")\n"},
{"review": "\nMark Rylance stands out as the best reason to watch this movie. And, I\nfeel tempted to say, the only reason to do so. His lines take the cream\nof the screenplay. I am quite a fan of spy movies. That is exactly why\nI find this to be extremely disappointing as a movie. Seeing Steven\nSpielberg's name come up at the final credits was a sort of cherry on\nthe funeral cake. The direction and the editing are the two most\ndisappointing elements of this production. Then parts of the story. It\nis all so predictable, so cliché, so déjà-vu. I happened to watch this\nfilm in the weeks in which the BBC broadcast a brilliant 5-part series\nentitled \"London Spy\". That is everything a spy-film fan can wish for.\n\"Bridge of Spies\" is everything but that. Underwhelming at best...\n"},
{"review": "\nHanks, Alda, Spielberg, the Coen brothers. What can go wrong?\nApparently, quite a lot.<br><br>Strengths first: the meticulous recreation of the 60's across two\ncountries is breathtaking. The streets look 60's, the people look and\ntalk 60's, the atmosphere is 60's. It's immersing and awe-inspiring.<br><br>Now the weaknesses: 1) Lots and lots of exposition. I understand that\nthe millenials are expected to not know the history from 50 years ago,\nbut come on - if someone doesn't know/love history they aren't going to\nsee this movie in the first place. Stop wasting our time with\nexposition. 2) Poor acting. This must be the weakest performance from\nTom Hanks I've seen in years. The guy is sleep-walking through the\nrole, and everyone else is wooden and not worth mentioning, except for\nAlan Alda who steals every scene he's in. Amy Ryan is just awful I'm\nsorry to say. 3) Too long. Way too long. Should've ended with the\nexchange taking place. We don't need the \"happy end\" through\nvindication - it's completely implausible too. 4) Not focused. The\npilot's story is completely surplus to requirements and insignificant -\nit doesn't add anything to the narrative. We don't really need to see\nthe pilot until his first scene in captivity. Instead, the time should\nbe spent on character development of which there is absolutely none. 5)\nPredictable. Yes, the story is well known and we all know how it ends,\nbut this means that the unpredictability needs to be in the nuances.\nThe little things that aren't part of the written history. But\neverything is predictable, nothing is captivating. 6) The treatment of\nthe story. The script is by the Coen brothers but it has John Le Carre\nwritten all over it. It's a classic Le Carre-like spy thriller\n(thriller, not action). There have been fantastic film adaptations of\nLe Carre, so we know it can be done. Sadly, on this occasion Spielberg\nfails to deliver.<br><br>4/10\n"},
{"review": "\nIt was opening night, the theater was packed and I was expecting\ngreatness. After all, this story is right in Spielberg's wheelhouse.\nThe time period, cold war, Tom Hanks, the stars were aligned. I will\nstart with this notion, Spielberg's movies are always well acted,\nalways well shot and always beautifully scored. Bridge of Spies does\nnot fail this standard. There are clearly some remarkable acting\nperformances. It wouldn't be a surprise to see some trophies handed out\nfor this work. The director got what he needed, superb acting. The\nactors did not get what they need, superb story telling. It is the only\nthing missing here but it's a biggie. <br><br>If you know anything about the real life story of James Donovan you\ncould easily imagine a truly exciting movie. The opening credit\nsequence included this line...Based on Real Events. This disclaimer\ngives license to the director to \"Hollywood up\" the story. So basically\nthere are no excuses. In Munich, the director pealed your sole with\ngreat story telling, tension and acting. Bridge of Spies had that\npotential, at least, that's what I was expecting. Tension was left out\nof this movie for some reason. I theorize Spielberg did this\nintensionally. Why? Somebody should ask him.\n"},
{"review": "\nIf you expect to see much spying or bridges in this movie you will be\nsorely disappointed. The plot is about ace lawyer Tom Hanks (his screen\nname does not really matter, since the movie is just star performance)\nwho is going to prove how good he is, both to the Russians and the\nEast-Germans.<br><br>A rather puffy-faced Hanks is in most scenes, playing a smug and\narrogant lawyer, who always gets the last word and whatever he wants.\nHis performance as a the lawyer is rather overbearing and even slightly\nunpleasant, but the public still liked him a lot and laughed at all his\none-liners (again, star performance, rather than good plot or script).<br><br>The spies or would-be spies featured in the movie are: 1) a sour little\nman, who speaks with what sounded to me an Irish accents and who was\nsupposed to be funny with his unflappability. He repeats \"Would it help\nif I worry?\" countless times, every time getting a laugh 2) a rather\ndumb American pilot and 3) another sort of heroic American student,\ngetting mixed up with foreign politics, when he'd better stayed at\nhome. They all seem to be just props to give Hanks a chance to shine.<br><br>The moral of the story should be that all countries should be better\noff minding their own business. However, this sound unrealistic, so the\nmoral is that American heroes (especially Tom Hanks) always save the\nday. Mind the overbearing soundtrack that seems to come straight out\n\"Saving private Ryan\"\n"},
{"review": "\nTom Hanks and Mark Rylance lead the way here and give superlative\nperformances in this cerebral and powerful Cold War drama. Another\nmasterful movie from director Steven Spielberg, with a most solid\nscreenplay from Matt Charman and the Coen Brothers, Ethan and Joel.<br><br>The films all centers around the initial defense of accused Soviet spy\nRudolf Abel (Rylance) by attorney James B.Donovan (Hanks), which made\nDonovan a most unpopular man in America, especially when he appealed\nAbel's conviction all the way to the U.S. Supreme Court, which upheld\nthe conviction by a 5-4 vote.<br><br>Meanwhile, in 1960, a U.S. U-2 pilot, Francis Gary Powers was captured\nby the Soviets, after his spy plane was shot down over Soviet\nterritory. Subsequently, the American State Dept. would ask Donovan to\npossibly negotiate an exchange of Abel and Powers, since Donovan had\nbeen contacted by the Soviets through the East Germans that this might\nbe possible.<br><br>Based on true events, there's plenty of intrigue here as Donovan,\nthrough intense and difficult negotiations, tries to acquire the\nrelease of the two prisoners, along with a third prisoner the American\nstudent Frederic Pryor (Will Rogers), being held on \"spy\" charges by\nthe East Germans. It will all culminate in some amazing and tense\nscenes on the German Glienicke Bridge.<br><br>All in all, I found this to be a first class movie, that despite it's\nlength of 2 hrs. and 21 min., had me absorbed throughout.\n"},
{"review": "\nThis movie is long, stagy, pretentious and boring. The acting is hammy,\nand the characters are drab and inspire little interest. The tension\nshould have been gripping. Instead it is absent. The ending of movie is\nalready known and is anti-climatic. The movie seems to suggest that\nAbel was not treated fairly and downplays the seriousness of his crimes\nand the sinister nature of his work. The treatment of Francis Gary\nPowers is completely superficial, which makes the story even weaker.\nFor an audience not familiar with the history surrounding Abel and\nPowers, this movie will not make any sense at all. This movie contains\nno heroes, heroines, no damsels in distress, none of the stock\ncharacters and situations usually employed to give a story some\nsubstance. Instead, the movie just plods along to its foregone\nconclusion. Why would any movie maker find such bland characters worthy\nof a movie? The real story is how the Soviets managed to shoot down an\nAmerican spy plane flying at 70,000 feet. How the Soviets were able to\ndetect and target a U2 flying at that altitude is not explained, nor is\nthe huge political fallout caused by the Powers debacle even mentioned.\nIndeed, the names of Eisenhower and Khrushchev are absent, yet in the\nactual event they were the key players, and by leaving them out,\nthere's no story.\n"},
{"review": "\nI am a big fan of Spielberg and really had high expectations for this\nfilm. However, it was so slow moving that if it was not for the\ndirector name and Tom Hanks I would have walked out of it. Yes, you\nread that correctly. There was really nothing moving about the movie\nand the over saturated directing made it even worse. The main few\nevents were played over and over so much that the end of the story felt\nblaise. Great material and wonderful that it is a true story but it was\nthe most shallow slow moving boring docudrama and I love history but I\nwould not recommend or waste any money on this movie. I give it a 1\nstar and the worst movie Spielberg has made.\n"},
{"review": "\nBridge of spies is not your typical movie, it almost seems like it\nwould be boring, except it isn't. This film is like a tree that you\ndrive by on your way to work. Nothing special, quite ordinary; and then\none day you see it from a different angle, and the way the dew\nglistening off of its leaves catches the sunlight, just takes your\nbreath away. <br><br>As I mentioned before, bridge of spies is different, it doesn't have a\nparticularly memorable score, or poetic dialogue, every character is\nportrayed as a \"regular guy/gal\". The credit must go to the Coen\nbrothers here. The actors lines, particularly the exchanges between\nHanks' and Rylance's characters are stirring in their simplicity. The\nstory unfolds similarly, everything sort of just happens, and at the\nend, it all fits together perfectly.<br><br>Nobody knows, what makes Spielberg so great, is it his groundbreaking\ncamera work? or perhaps his implementation of cutting edge visual\neffects? In my humble opinion it is his enigmatic ability to take what\nwould likely be dull and uninteresting in the hands of any other\ndirector, and turn it into a thing of wonder. This movie plays out\nnaturally, with moments of subtle heroism, and true human emotion, it\nis so very downplayed, that one simply cannot pull their eyes away.\nBridge of Spies is truly an Organic Wonder.\n"},
{"review": "\nThere are theories that the Francis Gary Powers shoot down by USSR had\nsomething to do with JFK's eventual death. This movie stays away from\nthat and instead the focus is on how the US made a deal to get Powers\nback. Based on a true story this movie tries to recreate the drama\nbehind all these events.<br><br>It does so without sinking to the depths of action sequences which\ndirector Spielberg often directs. He is proving to be a capable drama\ndirector as Lincoln proved that just a short time ago. Somehow he\nbrought the Coen's in to write this drama along with Matt Charman. The\nresult is a quite functional drama replete with the feeling of the cold\nwar.<br><br>The history lesson here is of value and this film is done totally from\nthe US perspective. This makes sense as the other side was not\nconsulted on this one. The film might even be a little too careful on\nhow it is presented. Tom Hanks is always good though in this film there\nis not a lot of character development other than Hanks and the Russian\nSpy (Mark Rylance) Rudolph Abel who is excellent. Hanks wife gets\nlittle bits of stuff but not much and even Hank's assistant Doug -\nBilly Magnussen gets but one or two scenes. <br><br>This film is a 2 figure drama, and the main draw back is while they\nexplain how great this accomplishment was, there is very little of why\nthe reasons the negotiations were so successful. This is a timely\nreminder about a Cold War which is now often forgotten, now that there\nare hot wars going in several countries today.<br><br>This is when diplomacy was practiced and refined so as to achieve\npositive results. It is solid and well done.\n"},
{"review": "\nYes, it had an interesting story and kept my interest \u0096 though the end\n\"true story\" statements from a Cuba negotiation sounded more heroic,\nbut Argo, it was not. And I wasn't even the biggest fan of Argo.<br><br>So, why all the Oscar buzz? Oh, I guess they still love historical,\n\"based on a true rescue,\" Hanks/Spielberg movies. These nominations,\nyear after year, are making me sadder. They consistently snub GREAT\nfilms for mediocre homages. Was this a great film? Hell no. Was it very\ngood? Nope. It falls in the \"good\" category with some good dialogue and\nperformances. Mercifully, it won't win any Oscars, but damn, those\nvoters really wanted you to remember they love these guys no matter\nwhat they accomplish.<br><br>Picture it, U.S.A., Brooklyn 1950s \u0096 the other Best Pic nominated movie\nset in that timeframe. Reluctant lawyer defends a publicly convicted\nSoviet spy and through negotiations, he helps to remind us what America\nis all about.<br><br>That is as basic as I will be with the synopsis. The rest of the story\nyou can see unravel as Hanks is used as a puppet that pushes back to do\nthe right thing. Again, it's interesting enough for the movie. Worth\nalmost 2½ hours? Nope, but maaaybe if you're a cold-war buff who can't\nget enough of the Hanks/Spielberg combo.\n"},
{"review": "\nThis is the story of James Donovan, who during the Cold War became a\nsort of secret negotiator for the American government in the trade off\nof Russian spy Rudolph Abel and American pilot Gary Powers.<br><br>The portrayal of America during the Cold War is absolutely wonderful.<br><br>Hanks's performance is excellent, as one has come to expect from the\nman. He is utterly believable, despite his fame.<br><br>It helped that much of the movie takes place in Berlin, a city I love.\nSpielberg does a terrific job in showing Cold War Berlin and\nparticularly the horror of the city getting divided.<br><br>Don't believe those who are saying that the movie is too jingoistic.\nIt's not. Spielberg and Coen don't avoid controversial issues. The\nmovie-goer is jarred with a few thought-provoking comparisons and some\ngentle reminders of the difficulties of life and hypocrisies of that\nera. Much of the movie deals with the legal issues involved. Donovan,\noriginally an insurance litigator, is the lawyer for the Russian spy.<br><br>I have to give this movie 9/10 because I can't think of a single thing\nwrong with it. (OK, there is one thing: I can't say the movie really\nmoved me that much.) This is movie-making at its best. Look at who is\ninvolved: Spielberg, Hanks, the Coen brothers, and so on. Don't miss\nthis one.\n"},
{"review": "\nI am a Cold War child, born in a country which did have common borders\nwith a Warsaw Pact member but was never a target of thermonuclear\ndestruction. I was still at primary school when I came across a couple\nof serialized excerpts from Powers' memoir. He really caught my\nimagination. I saw \"The Spy Who Came in from the Cold\" and \"Across the\nBridge\" (with Rod Steiger), films in which the bridge is both the\npassage and the frontier, a no-man's land in which destinies can be\ndecided in a split second of hesitation or bad luck.<br><br>Bridge of Spies was a great disappointment. Cars and costumes were fine\nbut the spirit and the people of the era was absent. I don't understand\nwhy, when I think of \"Munich\" or \"Schindler's List\", when there are so\nmany novels to consult for the atmosphere and so many memoirs to\nconsult for the facts. Why was Powers pictured with such unkind\nshallowness? Why were CIA men and DDR functionaries such caricatures?\nNo matter how great Mark Rylance was, where was the motivation and the\nideology of the Soviet spy? Where were the political leaders of the two\nsuperpowers? How did the little lawyer from the Bronx become such a\ncool operative behind the lines, from one day to the other, without\nexperiencing any fear or trepidation?<br><br>There is nothing wrong with high morals or nostalgia in cinema but when\na film tries to portray an episode from a complex political and\nideological conflict serving only these ingredients, then I can only be\ndisappointed at the waste of means and opportunities. Pity.\n"},
{"review": "\nHere's a bloated lack of action full of talk from the Director of some\nreally great movies. If you know the story you know the outcome. If you\ndon't know the story you know nothing bad will happen to Tom Hanks.\nMaybe a John Williams score could have helped this but he didn't get\nthe job. <br><br>The movie is too long. It takes a long time getting going and you'll be\nlooking at your watch wondering when is something going to happen.<br><br>If you like 1956 and 1957 Chevrolets this movie is for you. The car is\neverywhere including East Berlin and even at the bridge in the title.\nIt looks like the same 1956 car appears in different locations in the\nfirst sequence. You know a movie is not captivating if you are looking\nfor product placement or movie cars.<br><br>A couple of good performances make this bearable. There is a scene near\nthe end where the kids call their mother into the room to watch the\nnews story. Seems odd that they knew what was coming and laughable they\nwould call in their parents.<br><br>The Janusz Kaminski Cinematography looks good on the big screen. Maybe\nif you lower your expectations you won't be too disappointed. Looking\nfor a great Spielberg movie skip this and watch \"Jaws\" \"Munich\"\n\"Schindler's List\" \"Raiders\" or almost anything but \"Lincoln\".\n"},
{"review": "\n... but not necessarily a very entertaining one.<br><br>First -- and this is the key to my review --- semi-biographical films\ndocumenting real events do not have to be dull, or tedious, or dark, or\nlack connection with the viewer.<br><br>Look at PAWN SACRIFICE, for example, recently reviewed by this reviewer\nand still very much top of mind.<br><br>And then we have BRIDGE OF SPIES, a two-plus hour opus that one\nsuspects never would have been greenlighted without you-know-who as the\ndirector and you-know-who playing the lead.<br><br>Presumably we are meant to honor the main character's humanity as he\nstruggles against a corrupt (or possibly insane) system to do the right\nthing...? If this was the intent, then even a yeoman effort from Hanks\nfails to make this character connect with the viewer, to resonate. In\nspite of it all, he comes across as a wildcard pick in a game which he\nnever really understood.<br><br>And if the events of the last few years are any indication -- this\nwritten in 2015 -- it was a game the rest of us never understood\neither.\n"},
{"review": "\nSo its a movie featuring The Tom Hanks. Do I need to say more?? This\nguy can turn any movie into a blockbuster. A movie based on true\nincidents that took place during the cold war times and a New York\nattorney(hanks)is in the middle of everything. Could it be any better?\nJames Donavan(hanks) plays the the perfect joker in the negotiations\nand his bluffs do pay off at the end. Mr. Hanks played the character\namazingly well and the story being a real one will give chills about\nwhat it was to live back then in the East/west Germany. Having said so,\nthe direction seemed pretty average. For a man like Spielberg,I expect\nmore. But,then again, maybe there lies the charm. Overall, it's a nice\nmovie to watch.I have now started finding better movies through\nwww.flickstree.com. It not only suggests great movies to watch, it also\ntells where you can watch the movie online.. Highly recommended.\n"},
{"review": "\nSteven Spielberg is getting awfully stately. He's always been\nfamily-friendly, but there used to be an energy, a bit of sass about\nhim. Now the challenge to authority is no more than Tom Hanks being a\nbit smarter than the Government men, and the whole thing is played at\nan unchanging ceremonial pace at least as reverential as Lincoln.<br><br>This is Cold War thriller become costume drama. Despite the genuinely\ntense storyline, and some normally bullet-proof anxiety scenes\n(crossing the wall! waiting on the bridge!), not once does the pulse\nget above what you'd get from watching the documentary.<br><br>It's an extraordinary true story with the extraordinary taken out. And\nthe interesting: there's some potentially really thoughtful stuff about\nHank's relationship with Rylance, and where patriotism might be when\nAmerican interests clash with American values, and what he's inflicting\non his family by his stubbornness - but none of it comes to anything.\nHanks attracts danger (more in America than in Germany) and shame, but\nthen his family gets to see him on TV so it's all OK.<br><br>https://thescripthack.wordpress.com\n"},
{"review": "\nI just watched this with my wife, and my eyes were glued to the TV\nthroughout the entire film. but i was waiting for something exciting to\nhappen but it never did. Its just one of those movies where, when the\nmovie is finished, you ask yourself, why did i watch this? Not an AWFUL\nmovie, the acting was superb, but why would anybody decide to make a\nmovie about a trade-off, with absolutely nothing happening?! I add a\nexclamation mark because i feel i wasted 2 hours of my life watching\nthis, AND i absolutely love Tom Hanks. Usually i would appreciate a\nmovie for what it is, and yes, this was a true story, but again, very\ndisappointing, and boring once all is said and done. I know you can't\nchange what really happened, but if i was a director and decided to\nmake a movie i would think of a better idea than this. Now i understand\nwhy this movie didn't do so good in the cinema. The truth is (And\neveryone knows it) this movie deserves nothing more than a 5. if not,\nless. Rant done!\n"},
{"review": "\nBridge of Spies was nominated at the Oscars in 6 category, including\nBest Film, Best Actor Coadjvante ( Mark Rylance who won this category)\n, the cast is good, it has the Tom Hanks that rarely disappoints , and\nthis film even not being one of its best work, he's fine, Mark Rylance\nthis very well, and also has a other good actors , the direction is the\nIncrivel Steven Spielberg , that even not being his best film , not\nenter or in your top 10 in my opinion he sends right here, some of its\nfeatures ta present in this film, the script is good, the soundtrack is\ngood too, Bridge of Spies is an average movie , have a good time , a\ngood end , has a good cast , and direction of the Great Spielberg. Note\n6.6\n"},
{"review": "\nBridge of Spies is a stellar movie with a very well developed plot and\na magnificent cast. We are almost immediately taken in to the drama and\nintensity of this true story from the very beginning, as we follow an\ninsurance lawyer who is tasked with defending a Soviet spy who has\nbetrayed his country. We manage to gain support from the spy as we see\nhis point of view, beautifully captured by the great Steven Spielberg. <br><br>On the other hand, I did feel that it did not give us enough insight on\nthe seriousness of the Cold War. There is a scene where Donovan views a\nbunch of people being shot down while travelling on a train, I would\nlike to to have seen more of this, to emphasise the struggles this\nmovie is dealing with. <br><br>The performances are the highlight of it all, Tom Hanks is breathtaking\nas the lead role, James Donovan, perfectly conveying the transformation\nof an everyday lawyer turned hero, and Mark Rylance delivers a well\ndeserved Oscar win as Rudolf Abel, a flawed, conflicted character who\nwe can not help but support as a result of Rylance's charm. Terrificly\nacted, superb direction and a great script, Bridge of Spies is\ncertainly worth the watch for anyone looking for a good drama. <br><br>An insurance lawyer is tasked with defending a Soviet spy, a job that\nends up stretching far beyond the courtroom. <br><br>Best Performance: Tom Hanks / Worst Performance: Alan Alda\n"},
{"review": "\nSo this is a talking movie, with a LOT of talking going around without\nmuch action. Actually there is almost no action at all. So if you are\nlooking forward to watching a action movie with spies going on\nespionage and trying to assassinate people, this isn't that kind of\nmovie. When it comes to talking movies, the story, the dialogue and the\nperformances has to take center stage. And this movie has all three of\nthose elements without it going to a very convoluted and overly\npolitical direction. So most mainstream audiences will understand what\nis going on, on screen. However for me, what made this movie really\nwork is Steven Spielberg classic direction. Where the premise is\nuplifting while having a sense of humanity. The cinematography really\ndoes have the tenacity to keep audiences like me focused for the most\npart. This is a historical film that is based on a true story. So the\nplot is about James B. Donovan played by Tom Hanks who is a lawyer that\ntakes on the task of defending a soviet spy. And the negotiation and\nwhat goes behind the scenes of the American and Soviet politics. It\ndelves into humanity and the will power to stand up for what is right,\nalthough a lot of people will resent you for it. Although this isn't a\nmovie I would sit through the whole thing again, it was well worth the\nwatch.<br><br>8/10\n"},
{"review": "\nThis is a compelling character study set amid the espionage and drama\nof the Cold War between America and the Soviets. What really got my\nattention was when part of James Donovan's (Tom Hanks) argument against\nthe death penalty for Russian spy Rudolf Abel (Mark Rylance) relied\nlargely on foreseeing the day when an American might be arrested on\nsimilar charges, and a live prisoner might be the key to an exchange.\nCold War paranoia is more than evident in the early part of the story,\nDonovan's own son asks him, \"You're not a Communist, so why are you\ndefending one\"? <br><br>It's not made clear how much Donovan's pressure impacted the judge in\nsentencing Abel, who early on insisted this was an open and shut case,\nwith Donovan's court strategy merely window dressing. I was surprised\nhow little time was offered for Francis Gary Powers' (Austin Stowell)\nrole in the film, but that apparently was not the emphasis of the\nstory. I was only six years old when these events unfolded but somehow\n(amazingly) can recall Powers' name in headlines of the day.<br><br>There's always a question about historical accuracy with films like\nthis, but that shouldn't sway one's interest in seeing the picture. The\nstory is gripping and does a good job in demonstrating Donovan's\nresolve to protect his client's rights while remaining faithful to the\nprinciples of the Constitution. His reaction to East Germans being shot\nat the Berlin Wall attempting to escape was an unsubtle reminder that\neven though the events depicted occurred over a half century ago, they\nstill resonate strongly with viewers who were alive at the time.\n"},
{"review": "\nThe bar association asks insurance lawyer James B. Donovan to defend a\nsuspected Russian spy arrested on American soil. When an American spy\nis captured Donovan becomes a negotiator for two of the world powers to\nagree the prisoners release.<br><br>With the film based on real-life events writers Matt Charman, Joel and\nEthan Coen turns a secret prisoner exchange between the CIA and the KGB\ninto a tense and often humorous cat-and-mouse game. Suffering with a\ncold, quick thinking breifcase touting Tom Hanks' law-abiding lead\ncharacter Donovan is gripping as he is used as a go between by his own\ngovernment with German and Russian officials. Hanks brings an everyday\nman vulnerability, akin to Michael Caines' Harry Palmer to the role. <br><br>Steven Spielberg offers a finely crafted Cold War espionage thriller,\nwonderfully recreating the Cold War era thanks to clever special\neffects. The stakes are high, you witness the Berlin Wall being built,\nit's an appealing diplomatic film. There are tense moments littered\nthroughout, notably when Donovan is tasked in defending a Russian spy\nin a court of law, the backlash from his community and the danger he\nputs his family carries an impact.<br><br>Its a fine production. Bridge of Spies is interesting throughout and it\nsurprisingly captures some old fashion Hollywood magic.\n"},
{"review": "\nI finally watched this Steven Spielberg-directed drama starring Tom\nHanks on Netflix disc with my mom just now. We were both enthralled by\nthis based on a true story of Hanks' James Donovan-an insurance lawyer\nwho previously was involved in the Nuremberg trials-and his attempt to\nfirst defend Soviet spy Rudolf Abel (Mark Rylance who gave a\nperformance worthy of his Oscar win) and then fostering an exchange\nwith Russia and East Germany to trade Abel for pilot Francis Gary\nPowers and student Frederic Pryor, respectively. It was fascinating\nfinding out later how much of the movie was historically accurate,\nturns out quite a bit. Some scenes would be considered shocking but\nthis was mostly carried by compelling dialogue of which much of it was\nby Joel and Ethan Coen. So on that note, me and Mom highly recommend\nBridge of Spies.\n"},
{"review": "\nBut it's either a very big gap or a very big bridge (or maybe both). So\nto some this may feel too long. What it definitely is true, is the fact\nthat the movie takes its time to tell the (true) story behind it all.\nWhile Spielberg probably took some liberties (as almost every filmmaker\ndoes when they tackle a true life story/incident), this is very\ninteresting and tense stuff.<br><br>Though you wouldn't know when looking at the main character (besides\nthe one Tom Hanks is playing), because of him underplaying everything.\nWas the real person like that? Haven't read much about that, but the\nmovie may take a couple of people to take a look into that. And for\nthat, the movie achieved what it wanted: Putting a spotlight on\nsomething not many are aware of. Spielberg and Kaminsky always deliver\nwhen it comes to settings/camera of course, acting is great too, so\nit's kind of a \"no-brainer\"\n"},
{"review": "\nBridge of Spies states that it is based on true events. It depicts the\nstory of a Mr Abel (Mark Rylance), captured and accused of being a spy\nduring he 1950's at the heart of the cold war between the US and\nRussia. Tom Hanks plays the Lawyer Jack Donovan who is offered the task\nof defending Mr Abel.<br><br>Hanks does more than that, delivering a heartwarming portrayal of a\ngood man who just wants to do good. After defending Abel and fighting\nfor his survival, the US continues it's spying actions over Russia. <br><br>Hanks is eventually asked to take a role that will challenge his\nnerves, his family, and his belief in all he believes in. Will he\nsucceed in this role, or will he suffer the same horrible fate as so\nmany East Germans?<br><br>I really liked Bridge of Spies. The direction by Spielberg was\nexcellent. The costume and scenery were great - really authentic. Hanks\nwas terrific, and Rylance was good, though I think Rocky in Creed\nshould have won the Academy Award. Through to the end, you wonder how\nthis thriller will turn out. <br><br>Watch Bridge of Spies to learn for yourself. It's a good, taut, few\nhours - and worth your while. Enjoy.\n"},
{"review": "\nI like films about spies, especially those are based on actual events.\nThis film is one of the greatest. It tells the story very clear and\nfantastic. It draws me back to that special period of the cold war. The\ntwo campaigns hate each other, they send spies and hunt for them. I\nthink the lawyer Donawin is magnificent and he really changes the\nworld. The exchange is successful, and his fame improves. I hope that I\ncan watch more espionage films like that, such films can take us inside\nthe secretive, interesting, amazing world of spies. I admire the\ndirector Steven Spielburg, I have also seen his films including the\nJurassic Park series and the Schindler's list. I really appreciate his\nfilm style.\n"},
{"review": "\nI should start by saying that this movie really moved me - in a way\nthat I truly didn't expect it to. As the end credits rolled I found\nmyself in soft tears, something I almost never do. <br><br>Maybe it's the setting, I was expecting a spy movie packed with intense\ndialogue or maybe even chases here and there... I was so wrong and for\nthe better of it.<br><br>Tom Hanks is a brilliant actor and he plays the role of a simple lawyer\nbeing dragged into an unfamiliar situation with a huge amount of\nconfidence and bravery. He fights for what he believes is right and\nplays both sides ( the Germans and the Russians) perfectly. I love his\nline in the end \"It doesn't matter what people think, you know what you\ndid.\" Make no mistake, this is a human drama with all the best elements\nof a spy story.<br><br>The acting by both Hanks and Rylance is great, Mr. Mark is a pleasure\nto watch and I don't think that anyone could have played the role of\nthe soviet spy better than he did. There is something in his eyes and\nthe way he talks, it just pins you down and you just have to focus on\nhim. Of course, the camera work in the movie is excellent and it really\nputs you right inside the action - especially in the second part of the\nmovie.\n"},
{"review": "\n\"We little men, we just do our jobs.\" <br><br>#BridgeOfSpies #Short_Review<br><br>Something innocuous, yet so distinct that it can't be ignored. Rather\nits valued; perhaps, one of the important outcomes of watching this\ndrama-caper.<br><br>Based on the negotiations for American-Soviet spy exchange of \"Powers\nfor Abel\", and the craftsmanship of American insurance lawyer, James\nDonovan.<br><br>Only when one started to think that it would be a regular, even a\nlittle banal-looking account of some Cold War events, it came out to be\nnot just different but a lot better than imagined. Surprisingly\ncomical, this politically paced drama-thriller keeps one hooked for\nmore than usual reasons - which has now become a typical attribute of a\nSteven Spielberg film, and doesn't stop surprising.<br><br>Tom Hanks, with his effortless portrayal of Donovan, and the\n\"staggeringly sharp\" Mark Rylance as the Russian Spy Rudolf Abel -\nremarkably contribute in the film's subtle nod to the spirit of\nresilience and men of courage. As aptly stated in a Russian phrase for\n\"Standing Man\" - of virtue, of missions, of patriotism and of the\nfamilies.<br><br>Watchable, enjoyable, and likable! <br><br>Clear 8/10\n"},
{"review": "\nThis Cold War thriller confirms two things about director Steven\nSpielberg.<br><br>One: he is among the greatest storytellers in the history of cinema.\nIt's amazing how he makes every sequence visually interesting, fluid\nand well-paced, from dialogue scenes (which represent the bulk of\nBridge of Spies) to action set-pieces (here just a brief plane crash\nsequence). He gets strong performances from his actors, here Tom Hanks,\nAmy Ryan and Mark Rylance, the latter in an Award-winning turn as a\nmild-mannered Soviet spy. The director's efficiency on set is legendary\n- Bridge of Spies looks great in spite of a slim (for Hollywood\nstandards!) forty millions budget. Spielberg was just born to narrate\nstories.<br><br>And that's why his films, even those I don't particularly like or\nflat-out detest (The Lost World), usually still have *something* worth\nrecommending.<br><br>Two: Spielberg's movies have diabetes. Sugar is often sprinkled\neverywhere, but it peaks with a sappy, on-the-nose ending. Bridge of\nSpies would be greatly improved by excising (or radically altering) the\nlast five-ten minutes, much like War of the Worlds, AI, Saving Private\nRyan, Schindler's List, Minority Report. Looking back at it, it's\nsurprising the director delivered in Raiders of the Lost Ark one of the\nmost memorably ironic epilogues ever.<br><br>And that's why I prefer Spielberg's more lighthearted fare, like Jaws\nor Jurassic Park; in serious movies, his fluffy endings are more\ngrating and inappropriate.<br><br>Overall, Bridge of Spies is a solid effort. The Coen brothers co-wrote\nthe script, their touch shining through in several absurdist, humorous\nmoments.<br><br>7,5/10\n"},
{"review": "\nHanks and Spielberg tackle a Cold War spy-exchange against the backdrop\nof a freshly-constructed Berlin Wall. As one might expect from these\nold masters, it's expertly-crafted and loaded with gravitas; a warm,\nmotivated take on a surprisingly under-explored chapter of recent\nhistory. It does a great job of delicately re-evaluating popular\nsentiment and the bullish nature of post-war international relations,\ntoo, painting heroes and victims on both sides of the dispute. The plot\nis very linear, though, moving on a predictable set of rails from start\nto finish, and that can make it feel preachy when a few of the more\nheavy-handed themes briefly overstay their welcome. A\nfoundationally-strong, workmanlike offering, it's 50%\ndesperately-uphill legal drama and 50% high stakes poker with a set of\ncaptive American souls as the ante.\n"},
{"review": "\nMark Rylance is really really good. I can't believe he hasn't been in\nany big movies before and wish to see him again. As for the movie, well\nit isn't a Schindler's List and won't feature in Spielberg's top 10.\nNor is it a Tom Hank's top ten. It's a regular cold war time movie that\nis biographical and based on the life of James Donovan who was\ninstrumental in prisoner exchange during the cold war and the Bay of\nPigs invasion. It's an interesting story giving an important\nperspective on the cold war. I enjoyed watching the movie, but it could\nhave fleshed out the characters of Pryor and Powers some more. Both of\nthem were unknown actors (seemed like) and their roles totally\nforgettable. The folks from Russia and East Germany also were\nforgettable to say the least. The movie started out well but could have\nended more powerfully in my opinion. Anyhoo, this is worth a watch, but\nI wouldn't peg it to win an Oscar.\n"},
{"review": "\nBridge of Spies is the fourth collaboration between Steven Spielberg\nand Tom Hanks. This particular one is much more focused on persuasive\nand intense dialogues and not on big action scenes, but due to the\nbeauty and consistency of the conversations, the film doesn't become\nboring.It has a captivating and inspiring plot and is based on a true\nstory that took place during the Cold War. As presume, the direction is\nspectacular, Steven Spielberg once again proves to be one of the best.\nWith the help of Janusz Kaminski, movie cinematographer, they manage\ncapture the minutiae and subtleties in each scene, making the picture\nhaving an amazing aesthetic, besides the setting and scenery being very\nwell-constructed and provide a higher truthfulness to the movie.\nConsidering the portrayed event and troubled time that happened, the\nfilm could have brought a higher tension, the lack is mostly felt\naround Tom Hanks' character, James B. Donovan, as he's doing something\nso outrageous in the Americans' perspective. The hostility is\nthere,it's perceptible but it's not high as it might be. A aspect which\ncould help fulfill this need is the soundtrack, which didn't show up as\nexpected, instead was restrained and discreet. <br><br>Tom Hanks is the highlight among the cast, he delivers a great\nperformance. The character is fantastic, his power of rhetoric and\npersuasion are astonishing as a result his speeches are just\njaw-dropping. Another good acting was Mark Rylance being Rudolf Abel.\nHe transmits such serenity and wisdom due to his personality, and when\nhe and Tom Hanks are in the same scene, you just sit back and enjoy\ntheir chemistry creating some impressive discussions.\n"},
{"review": "\nWith the masterful Steven Spielberg behind the lens, this movie was\ndestined to be amazing. Tom Hanks gave an incredible performance as the\nnon-fictional character, James B. Donovan. I really enjoyed this film\nbecause of that aspect; that it really happened. It was such an eye\nopening film to a true story I never really knew about it. Hanks was an\nextremely powerful and convincing lawyer and it was very interesting to\nsee how his mind worked when it came to dealing with the character\nRudolf Abel, played by Mark Rylance. Rylance also delivered a wonderful\nperformance. Overall, this film was an interesting insight to events\nduring the Cold War and a story that definitely needed to be told.\n"},
{"review": "\nI saw Bridge Of Spies with friends last night. It's a Spielberg film,\nso outstanding cinematography is a given.<br><br>The plot isn't 100% historically accurate (as are most, if not all\n\"based on a true story\" films), but it is still very good. Every\nAmerican, every citizen of the former East Germany and West Germany,\nevery citizen of Russia or any former republic of the Soviet Union,\nsuch as Lithuania, Kyrgyzstan, Estonia; every citizen of a former\nWarsaw Pact country such as Romania, Poland, the former Czechoslovakia,\nAlbania; MUST SEE this movie, especially those who weren't old enough\nduring the Cold War. Life in our countries was very different during\nthe Cold War. Many people, young and old alike, didn't live long enough\nto see the end of the Cold War, or the demolition of the Berlin Wall,\nbecause they were killed. Many families were separated or forced to\nrelocate during the Cold War. Some of us served in the armed forces\nthen and are known as \"Cold Warriors\". Some of these people might've\nbeen your relatives or friends of your family.<br><br>The film depicts a part of the life and the negotiations of an American\nattorney during the Cold War and how tense things used to be. I felt\nthe tension as Tom Hanks' character did his assigned and delegated jobs\nin the film. I have a better appreciation of life today as compared to\nthe Cold War because of this film.\n"},
{"review": "\nI personally felt this film was not to my taste. I went in expecting a\nnice meaty courtroom drama. Turned out it was something else entirely.\nSomething bereft of any drama at all, really. This film is about a man\nwho faces numerous obstacles that he needs to overcome in order to do\nthe right thing. The problem is that each time he comes across an\nobstacle turns out all he has to do is simply ask someone to remove it\nfor him! And for some reason they do it for him! Every single time! He\ndoes this over and over again throughout the film. It's ridiculous. If\nhe can simply ask for whatever wants then there is nothing at stake.\nThere is never any tension. <br><br>I wish I had not wasted my money. And I wish I had instead sat at home\nwatching a tin of beans heat up in a microwave. And because everyone\nknows you can't put metal things in a microwave, it would have at least\nprovided more drama and more tension than the entirety of this very\nlong and very boring film.\n"},
{"review": "\n1. The best thing in this movie I gotta say was the acting quality.\nEveryone was great, spot on! Specially Tom Hanks and Mark Rylance! They\nhad 2 hard roles and they did amazing. They were the reason why my\nrating was hijacked a bit more. 2. I was very glad with the way the\nstory was told. The way the emotions were distributed along the movie.\nRight amount of everything on the right moment. At any moment I felt\nthat we were being given high drama to pull for our emotions just to\nlike the movie ore. No. Everything was honest and sincere. The story\nwas very well told. 3. The sets, costume and make-up were all very well\ndone. I definitely recommend to watch it!\n"},
{"review": "\nSo little was needed to make this a fantastic movie. The story itself\nis great, the insurance lawyer ending up way over his head, but\napproaching it with perfect calm. The mysterious spy. THe tension of\nthe cold war. And the people involved in making this movie are also\nfantastic. From the Coens, to Hanks, Spielberg and so on. The movie\nlooks good, and the actors do a good job.<br><br>It seems like they tried to make a movie that is a bit more nuanced\nthan good versus evil, where the characters aren't just black or white,\nbut complex moral beings. But it doesn't really succeed. I like the way\nthey explore the act all of the nations has to put up, and how all of\nthem blunders, but do try to avoid war. But at the same time, the movie\ndoes not take the time to show the East Germans and the Russians as\nmore than narrow minded. It was a terrible situation, and it should not\nbe excused, but even a big movie like this should try to do justice to\nthe (very real) people who lived back then, on all sides of the\nconflict. Much like Donovan does, in the movie.<br><br>The movie is somewhat split into two, and the first part is definitely\nthe best.\n"},
{"review": "\nThe movie is entertaining but with a very foreseeable sequence. When\nSpielberg films about Germans he has become a cliché, to the point that\nit seems that in real life he has strong feeling against them.<br><br>Spielberg exalts the American values (not something that is bad) at the\nexpense of creating a very black-and-white reality point of view. Once\nagain, the movie is nice because of several factors (performance, the\ncreated atmosphere, etc.), but it is not intelligent enough to motivate\ndeeper reflection. <br><br>While the \"good guys\" have richer shades of grey, Spielberg almost\nalways portraits cartoonish \"bad guys\".<br><br>The good thing about this movie, is that as a Walt Disney movie, it has\na high motivational value that with a happy ending, help people to\nenjoy the time.\n"},
{"review": "\nIts a very sensitive issue in any country. It is very well dealt in\nthis movie. Movie depicts the other side of the coin which many does\nnot prefer to think. Director took lot of care to make every scene\nimportant. As usual Tom Hanks acting is good along with Mark Rylance.\nIt would be good to watch the movie as a commoner but not as a\nhistorian or defense employee. Character represented by Tom Hanks is an\nasset to the country along with Mark Rylance. Scenes representing\nactual conditions in Germany, America may defer but costume designer\ntook lot of care for the main characters. Expression of the Tom Hanks\nwife at the last but one scene is very good representing the real\nbehavior.\n"},
{"review": "\n(Spoiler in the last paragraph) Inspired by true events, the film turns\nthe events in a nice story. An insurance lawyer first defends a caught\nSoviet spy, and then helps to arrange an exchange with an US spy in the\nmiddle of the cold war.<br><br>The main achievement of the movie is that it turned the events into a\ncredible, substantial and enjoyable story. It's easy to feel involved\ninto the different players. The subplots all have a decent ending.\nScreenplay is good, light and sound convincing. Tension is always\nplaying in the background, until the very end.<br><br>Another strong point is the depiction of the beginning of the cold war.\nFor example, the scenes at the wall dividing Berlin show well a part of\nhistory that is easily forgotten. Also, how society was organised in\nthe early 1960s. In certain scenes, you wonder: was it really like\nthat? The research team made a really good effort there.<br><br>The actors act at different levels: Mark Rylance plays the soviet spy,\nwith an outstanding performance rewarded with an Oscar. Tom Hanks has\nhis strong moments, but the CIA agent was a little disappointing, just\nlike some other supporting actors.<br><br>The good, easy-to-understand story sometimes reveals its weaknesses: a\nlack of depth, a focus on story instead of history, and occasional\ncorniness.<br><br>However, it's still a good movie to watch and to be entertained with. <br><br>Spoiler alert: One questions still remains. At the end, when they're\nwaiting for the signal that the economics student is released, the CIA\nagent on the phone might have faked that the student was released. So\nthe lawyer would agree to swap only the Soviet spy for the American,\nsince the student wasn't important for the CIA.\n"},
{"review": "\nAlthough very good to look at and mostly continually interesting (while\nmaybe a little over length) this bridge may not hold as much weight as\nit could have. I suppose we should know what we can expect with\nSpielberg at the helm. While I agree this is one of his better movies,\nit still offers the usual over exaggerated bits just to liven up the\naction - while some facts get overlooked for the sake of\n'entertainment'.<br><br>We don't get to know anything about the character the whole show is\nbuilt around - not even what his bit of folded paper was all about, so\nhave to assume this was perhaps mocked-up to hold our interest. Mr\nHank's wife is just a bit too difficult to believe - especially her\nreaction after their home and family get shot up!- then again, with\nthat whole segment being a fabricated beat-up (this looks like Cohen\nBros stuff) I guess it also fits in with the way Hollywood saw 50's\nwomen. <br><br>It's mostly good based on fact dramatic entertainment with an element\nof fanciful trimmings - what more could be expected of a\nSpielberg/Cohen partnership?. Another positive comes in the way Award\nwinner Marc Rylance as Abel (the spy) and Tom Hanks as his defense,\nperfectly bounce words and glances off each other.\n"},
{"review": "\nDuring the Cold War, an American lawyer is recruited to defend an\narrested Soviet spy in court, and then help the CIA facilitate an\nexchange of the spy for the Soviet captured American U2 spy plane\npilot, Francis Gary Powers. I never thought that i would ever watch a\nSteven Spielberg and Tom Hanks movie and get so goddamn bored i really\nlost my interest after 30 minutes and Mark Rylance? He wasn't even that\ngreat to begin with and it amazes me how he even won that Oscar instead\nof Stallone who was magnificent in Creed. Tom Hanks is as great as\nalways but the boring pacing it just ruins the whole movie and the\naudience's experience and to be honest i had more fun with Indiana\nJones 4 than this.\n"},
{"review": "\nPredictable stuff from Hollywood - shallow and very disappointing.\nSpielberg doing a kids version of a spy story. Poor Tom Hanks goes to\nBerlin to save the world from communism, and rescues the youth of\nAmerica. And all he gets is the sniffles. Violins on the bridge, before\ndawn, for goodness sake. Given the accolades, I was hoping for\nsomething more suited for an adult audience. Rylance is a good actor,\nbut that doesn't make it a good film, just watchable when he is in the\nscene. And those poor kids of Hank's - subject to such hatred because\nbig daddy stood up for justice and the American flag. It isn't even\ninteresting from the historic recreation of New York - just a\ndemonstration of how much money can be spent on a movie that really\ndoesn't tell much of a story. There could have been more depth, and\nless devotion to period drama. And the script was pretty dire at many\npoints - dialogue when no words were needed at all.\n"},
{"review": "\nAfter watching Sully, I went back to see some movies with Tom Hanks\nthat I had skipped. Bridge of Spies was brilliant. The way in which a\ncivilian, although a lawyer, was dragged into this whole thing and the\nway in which he handled it, was amazing and thrilling to watch. <br><br>Mark Rylance was also breathtaking in his role as Rudolf Abel. The\nmovie had a really nice plot behind it, amazing scenery and photography\nin general, and it did keep you at the edge of your seat. It was quite\nlong, but still I felt like it could have used some extra time towards\nthe end. <br><br>My favorite moments were of course towards the end of the movie, when\nall loose ends are tied up one way or the other. Overall it was a\nperformance by all actors but also by Tom Hanks in particular that was\nup there with all the major roles he has portrayed so far.\n"},
{"review": "\nI can't write much if I don't want to spoil it, so I am only going to\nsay that this movie should have been a 6 chapter serial, the main\ncharacter and his story is perfectly developed, one can understand why\nhe does what he does, it doesn't feel forced or anything, but the rest\nof the people involved are more of a mystery, to the point where you\nask yourself \"Why did they do such thing?\" Other than that is a great\nmovie and very entertaining for a two hour feature with people talking\nall the time, it may seem like a boring political movie, but in fact\nhas a nice pace (slow at times) with some light jokes to ease the mood,\nand Mr Hanks never disappointing what he has to show his acting skills,\njust don't expect many spies in this movie.\n"},
{"review": "\nAs of fan of movies such as Raiders of the Lost Ark and Forest Gump, my\nsummary/title is very bold, but true.<br><br>Everyone cast in this film hit the right notes and Spielberg seemed to\ntreat every scene with perfection.<br><br>Overall this is my all time favorite Cold War film, and the best 2015\nhad to offer. Oddly enough Hank's wasn't nominated for an Oscar, but it\nclearly deserved a nod at least. On the bright side Mark Rylance did\nget a nod AND win for the film at the Oscars. <br><br>Had I been the judge of \"best picture\" this would have won, and it is\nsad more young people don't go out and watch films like these at this\npoint in time. I suppose things without explosions just aren't\nentertaining to most.<br><br>GO see it if you haven't already!!\n"},
{"review": "\nThe film is a historical drama set in 1957, the period of the Cold War.\nIt was a time where spies were used extensively by US and the Soviets.\nThough I don't claim to be an expert about the Cold War and it's\nhistory, I thought that the story is presented with utmost honesty.\nThis is one of those films which would inspire one to learn more about\nsuch historical events. The film turns out to be quite a thriller.<br><br>Rudolf Abel is arrested by FBI on charges of being a Soviet Spy. A\nlawyer is provided, in order to ensure that justice is seen to be done.\nThe lawyer, James Donovan, ignoring the fact that he was employed just\nfor a formality, works with utmost sincerity in presenting Abel's case.\nHe faces a lot of heat from public, family and his own firm. After some\ntime, Francis Gary Powers who is a US pilot is captured by soviets.\nCIA, afraid that Powers might leak secrets, employees Donovan in\nhelping them trade Powers with Abel. At the same time. Frederic Pryor,\nan American Student is unjustly held by Germans in suspicion of being a\nUS spy. It turns into quite an adventure for Donovan as he tries to get\nboth Pryer and Power for Abel.<br><br>The story is quite close to the true course of events. Powerful\nperformances by Tom Hank and Mark Rylance are some of the main features\nof this film. Spielberg does a wonderful job in presenting the\ncharacters. For a plot so rich and dense, I thought the film moves a\nbit slow and covers less ground. Having said that, the film is\nsuccessful in binding audience's attention and is kept interesting\nthroughout.\n"},
{"review": "\nBridge of Spies is a good picture in general. It issues the most severe\nera of cold war. Even if you're not interested in political history, (i\nstudy history of politics that's why i especially liked it) i believe\nit'll take your interest as well. It also adapts the era's historical\nevents into the script in a good way. In my opinion, all those\nhistorical events are so significant that all we have to be at least\nfamiliar with. I also want to specifically mention about Mark Rylance.\nHe shows a brilliant acting even tough he doesn't show up throughout\nall the movie. He definitely proves that why he deserves the Oscar.<br><br>Beside all these good aspects of the movie, of course there are some\nbad sides too. Spielberg is using some 'unnecessary' tricks to\ndemonstrate the events in another way unlike the real events.\nUnfortunately, these things overshadow the movie and he is making an\nobvious propaganda again. I also suggest you to read the history after\nwatching it. <br><br>In overall, it is a nice movie that you will not regret.\n"},
{"review": "\nI'm not sure what caused me to pick up \"Bridge of Spies\" when I found a\nBlu-ray copy of it at my library, since its length and the fact that it\nhad Tom Hanks (an actor who usually gives me annoyance) seemed to be\nobstacles. But I'm glad I did. While the movie is long (140 minutes),\ncredit director Steven Spielberg for making the package chug along\nfairly briskly, while at the same time showing that the world of\nespionage in real life is often a lot of work and not flashy business.\nThe acting is also pretty good; even I had to admit that Tom Hanks does\na pretty good job here, giving his character a kind of everyman feel\nthat gives him sympathy.<br><br>The only real flaw that the movie has is that it doesn't go into depth\nenough with some key details - namely the backstory of both Soviet spy\nRudolf Abel and American pilot Francis Gary Powers. Now, I actually\nknew a lot about their real life stories before watching the movie, so\nI was able to fill in the blanks. But I suspect most viewers will know\nlittle to nothing about both men before watching the movie, so they may\nbe scratching their heads every so often. However, I will admit\ndevoting more time to these real life individuals may have made the\nmovie overlong. So you may want to research both individuals before\nwatching this movie.\n"},
{"review": "\nWhen I first heard about Tom Hanks in the movie I prepared to watch\nirrespective of the content. But the story is very much like a magnet\nyou just cant stop anywhere. The story line and characters are far from\njust OK they are remarkable.<br><br>The cold war era may have passed but the people involved remind who we\nare in this world. A very astonishing movie by none other than Stephen\nSpielberg.<br><br>The wall of Germany and other parts were accurately filmed and shown.\nThe law system in US is much to be respected and admired. There are\nsome Americans who not only drives their country but also the world for\nwhich this movie is a tribute.\n"},
{"review": "\nWe were vacationing in Germany only last week. But as soon as my wife\nand I returned home, everyone who had seen this movie strongly\nrecommended that we see it. Turns out that we were standing in each and\nevery location shown in the movie including the outside of the Russian\nand US embassy as well as the streets, bridges and historic sites shown\nin the movie.<br><br>So, not only is this movie strongly tied to the real locations but also\nthe U2 spy plane news story that I personally recall seeing in the news\nyears ago....<br><br>The best part of the movie is the accurate portrayal of the exceptional\nmain character..... and there are some wonderful surprises as well.\n"},
{"review": "\nTom Hanks, the main actor, and Mark Rylance play amazing characters in\nthis masterpiece. Their acting is right on point. <br><br>I loved this movie from start to ending. It kept me on the edge of my\nseat.i had to watch it twice just to get all the details. It is a very\ninteresting portrait of how things were back then. <br><br>The plot, the actors and the place of action are amazing and very deep.\nThe movie is over 2 hours long, but I could have stayed and watched it\nfor longer. <br><br>It also has an emotional side, but not too soapy. I really enjoyed how\nit is no too extremist and also giggle more than a few times. Tom Hanks\nmanages to portray a very serious character, but also a funny one.\n"},
{"review": "\nSpielberg and Hanks; is that enough of a drawing card? Steven Spielberg\nre-investigates a decades old historical event. Fact-based and\nliberties taken in this fact-bound story. Thrill and suspense driven\nalmost documentary-style drama that takes place during the height of\nthe Cold War in 1960. An American U-2 spy plane pilot Francis Gary\npowers is downed by the Soviets. And a KGB mole Rudolf Abel is captured\nin New York in 1957.<br><br>Hanks plays James Donovan, a Brooklyn insurance claims lawyer that just\nhappens to be a former Nuremburg trial prosecutor is picked to\nnegotiate a trade with the USSR. The transfer of spies is to be made on\nthe Glienicke Bridege that links West Berlin with Potsdam. If things\naren't exactly trustworthy at first, Donovan on his own initiative\nwants to pull in a third man into the swap. An American med student,\nFrederic Pryor, has been detained on the hostile side of the Berlin\nWall. Now the trade appears lopsided...two Americans for Abel.<br><br>This movie moves to its own rhythm and suspense proves to be the\nsubstance to propel the tricky trade. Mark Rylance as Abel may just be\nthe real star; not that Hanks doesn't dig deep. Also in the cast: Alan\nAlda, Amy Ryan, Mark Fichera, Brian Hutchison, Domenick Lombardozzi,\nJoshua Harto and Victor Verhaeghe.\n"},
{"review": "\nA well acted movie with catchy dialog. Too often though, it sounds like\npunch lines being delivered. \"I'm not afraid to die....Then the\npunchline...but it wouldn't be my first choice.\" Unfortunately it was\nmeant to please not give the story any depth. At the end of the film\nyou know nothing about, nor care about, the characters other than what\nwas minimally needed to move the story. Just for the record, all the\nwomen are minor characters. You really don't have an idea about the\nrelationship between the Tom Hanks character and his wife.\nRefreshingly, there no guns, girls or chase scenes and yet the movie is\nengaging. Tom Hanks is the anti James Bond.\n"},
{"review": "\nWatched it on DVD from our local public library.<br><br>This movie has special significance to me, I was a teenager during the\napproximate 5-year period this movie is set, about 1957 through about\n1962. I remember the news when Powers was shot down in the U2 spy plane\nover Russia and the cold war propaganda it generated.<br><br>In this Spielberg movie, \"inspired\" by true events, Tom Hanks is\ninsurance lawyer James B. Donovan. There is an arrest of a suspected\nRussian spy and the government asks Donovan to be his defense lawyer,\nallegedly to show the world that even a suspected spy would get proper\ndue process. But it was clear (at least the way this script is written)\nthat all that was wanted was a quick conviction.<br><br>A critical move was to talk the judge into giving the spy a life\nsentence instead of death, he reasoned that maybe the spy would\neventually talk, but even if he didn't maybe there would be a future\nopportunity to use him in an exchange.<br><br>That opportunity came in the early 1960s when Powers was flying a high-\naltitude U2 photo mission over Russia but was shot down. After that the\ngovernment asks Donovan to try to negotiate a prisoner swap, to get\nPowers back. This required him to travel to East Germany as the Berlin\nwall was being constructed. <br><br>There is a lot of tension and close calls but the mission is\naccomplished, also with the release of a young 25-yr-old student who\ndid nothing wrong but was studying Economics in Germany.<br><br>Surely there are some things fabricated but overall it is a nicely\nentertaining movie based on real people and real events.\n"},
{"review": "\nThrown directly into the height of the Cold War you begin to grasp the\nhardships seen and the high tensions of nations. The movie tells the\ntrue story of a captured man believed to be a Russian spy and his\nexchange for an American soldier and an American student held captive.\nJames Donovan, an insurance lawyer, is given the role of defending the\nbelieved Russian spy in the court of law. Can he save both of the\nAmericans and is the Russian truly a spy or just a man trying to go\nhome? <br><br>The movie gives the audience the feeling of being tense and put in a\nperiod of where super nations are on the brink of war. You are never\nable to really trust anyone while watching this movie and that is\nsomething enjoyable to many. The suspense of never knowing who to trust\nand what may set off World War III.<br><br>Overall, I thought Spielberg and Hanks did an excellent job of\nextracting raw emotions from the audience in this movie. It was not was\nI was expecting in the movie, but that did not change the enjoyment.\nThey did an excellent job of telling the story of a man caught up in\ndangerous territory and his ability to never back down.\n"},
{"review": "\nI love how Spielberg is able to tell such a complex historical event in\nsuch a humane way. Having the Cohen brothers as accomplices I'm sure\nsolidified the success of this movie which easily could have faded into\nthe piles of forgotten spy/Cold War predecessors.<br><br>Barring the language at times, this would be such a great film for\nolder students to watch, study, and hopefully inspire. There are so\nmany great lessons to be learned about character, standing for what is\nright regardless of the disdain of others, and most of all courage of\nplayers in the world who each in their own country or manner believe in\nwhat they are doing is right.<br><br>Appreciated also is the that Donavan did not discard one single human\nlife at stake in the exchange, regardless of the government's disdain\nfor his choice! I mean, WOW!<br><br>Ass Donavan (Hanks) summarizes, each person is acting as a soldier in\ntheir respective vocations. While we often and rightly react negatively\nand succinctly towards spies against our country, we also are doing the\nsame in other countries of the world.\n"},
{"review": "\nBridge of Spies is an excellent movie. It is based on a true story and\nshowcases the tumultuous political intricacies that are involved in\nespionage. Although it is based in the past and espionage has no doubt\nundergone massive change the political aspects of espionage always\nremain extremely delicate. There is no doubt that situations can be\nresolved or escalate depending on the actions of a few men. Tom Hanks\nis truly excellent as the 'standing man'. He is a straight down the\nmiddle man who believes in his country's constitution and believes in\njustice. He is prepared to stand up for it at any cost. He is the\nmovie's hero and is wisely understated as so rather than over\ncelebrated. His performance should have stole the show however Mark\nRylance (who I had never encountered before) gives a truly memorable\nperformance as Rudolf Abel. He is indifferent in the face of danger and\nresigned to playing his part as a pawn in a bigger game. Every moment\nhe is on screen is true acting brilliance, and mesmerizing to watch. As\nin many espionage thrillers there are a few twists and turns right up\nuntil the end. This movie makes you think about the real life people\nwho have put everything on the line for something bigger. People who\nknow how it could end but carry on regardless in service of their\ncountry. People who carry out the dirty work of bigger powers and may\nnever have been remembered for it. If a movie can make you think like\nthat then it has done it's job and then some.\n"},
{"review": "\nSteven Spielberg is among the few legendary film makers who have made\ntheir prominence for the versatility in the subjects they bring through\ntheir films. On one hand, Spielberg had made a touching children drama\n\"E.T THe Extra Terristrial\" and on the other side gave \"Schindler's\nList\" documenting history, making it appear larger than life. His\nversatility continues even today with a touching movie like \"War Horse\"\nbased on the children's novel or a historical movie like \"Bridge of\nSpies.\" May that be 'Empire of the Sun,\" \"Saving Private Ryan,\" or\n\"Jurassic Park,\" he always had the clarity in story telling and with\n\"Bridge of Spies\" it seems he is still unbeatable in terms of story\ntelling.<br><br>\"Bridge of Spies,\" as has been narrated, is said to be inspired by true\nevents depicting the cold war of 60s between the United States and the\nSoviet, during which an American attorney opts to negotiate an exchange\nbetween a Soviet Spy and an American pilot and a student. In a way, the\nfilm retells a segment of history which we haven't read yet. Whatever\nthe film shows come very strongly and just touches you. An attorney who\nreceives hate from the Americans becomes a negotiator for the US\npresident explains a lot of our central character. in the role, Tom\nHanks as usual gives a tremendous performance, which sadly went not\nnominated this time at the Oscars. But a face that catches your\nattention the most is Mark Rylance as a Soviet Spy, who won an Oscar\nfor his performance. Even with the minimal dialogues he was given, he\nmakes a prominent presence in the film, for which he deserved the\naward.<br><br>Overall, just watch this film to know a part of history, or feel the\nextraordinary power of Spielberg's story telling, or simply if you're\nan admirer of Tom Hank's brilliant performance.<br><br>Rating: 3 stars out of 4\n"},
{"review": "\n*Spoiler/plot- Bridge of Spies 2015. During the 1950's Cold War, a\nRussian spy is caught and convicted. An American insurance lawyer is\nasked to protect the Russian criminal during his court proceedings and\nre-repatriation (Spy swap) back to the Soviets for an American shot\ndown U2 spy plane pilot and a American student.<br><br>*Special Stars- Tom Hanks, Mark Rylance. DIR Steven Spielberg.<br><br>*Theme- Espionage is a dirty and changeable business.<br><br>*Trivia/location/goofs- B &amp; W European. Shot in Berlin Germany. Based\non true historical facts. Oscar nominated and won for best supporting\nmale actor that portrayed the Soveit spy. Be sure to watch the film\nepilogue that also connects the principle people useful in the Cuban\n'Bay of Pigs' disaster and prisoner swap.<br><br>*Emotion- More of an enjoyable 'who-done-it' with some spy overtones.\nSome great character acting to make the roles very believable and\ninteresting. The film scenes are lush and draws the viewer into the\ntime, intrigue, and foreign places. Simple and colorful humor in the\ndialog banter makes these roles human. A wonderful epic with a message\nabout international relations.<br><br>*Based On- True story events of the Francis Gary Powers spy plane shoot\ndown in the 50's between USA and Soviets countries.\n"},
{"review": "\nCold war feelings still apply today it seems.<br><br>\"Was it interesting?\" Not a problem there. The negotiation and\npolitical maneuvering was well done. My only criticism would be that\nthere wasn't as much courtroom scenes as I would have likes.<br><br>2.5 out of 3.<br><br>\"Was it memorable?\" The cinematography was as good as I expected from a\nSpielberg movie. It did seem to have a lack of impact on the world. His\nactions seemed to help a few people, but didn't seem to much negative\nconsequences from failure.<br><br>2 out of 3.<br><br>\"Was it entertaining?\" The acting was well done. Subtle and nuanced.\nThe problem here is that it was rather procedural for me. I'm not sure\nexactly what I was hoping for, but it still felt a little lacking.<br><br>1.5 out of 3.<br><br>Starting with 1 (because), 1 + 2.5 + 2 + 1.5 = 7 A thoroughly enjoyable\nmovie that a few years from now wouldn't mind seeing again, but I'm not\nin much of a hurry. The end text sounds great for a sequel though.\n"},
{"review": "\nWhen Spielberg and the Coen Brothers create something together, the\nresult should/could be at least solid and versatile, even if the topic\nis controversial and/or not bespeaking wide audiences. This was my\nbenchmark when I decided to spend almost 2.5 hours in front of screen;\nI had some vacillations as the Americans tend to approach European\nevents and characters in a different manner we are used to. Luckily, it\nwas not the case here - European venues seemed authentic, German\ncharacters spoke/were German, there was no black-and-white approach\nregarding \"us vs. them\", etc. And as the plot is based on true\ncharacters and events, then realism prevails, and artistic\nexaggerations just ensure more spirited and dynamic course of events,\ndiminishing aridity usually so characteristic to Cold War spy movies.\nThus, the main ideas of justice vs. fairness and legality vs. humanity\nwere skilfully moved to the surface. <br><br>As for performances, they are good as well, particularly Tom Hanks as\nJames B. Donovan and Mark Rylance as Rudolf Abel; unlike many other\nmovies with Hanks' starring, he does not dominate here, he is not\nevidently \"better\" (= so more famous) than his co-stars. And just\ntoday, Mark Rylance obtained his first Academy Award. Congratulations!<br><br>PS Only last fall, my country experienced a similar event:\nhttps://en.wikipedia.org/wiki/Aleksei_Dressen\n"},
{"review": "\nI gave this movie an 8 for how it showed simply a good cold war\nthriller. It had the cold war tension between the US and USSR, played\nout in the divided Berlin, both East and West. Beautifully filmed as a\nBritish costume drama, I also liked how Tom Hanks's character provided\nsome inner tension in how his look on justice for all, even for spies,\nhad consequences for both himself as his family. What is surprising\nthough is that Spielberg confirmed in a BBC interview he had no\npolitical message in this one. That is curious to say the least, with\nall the abundant contemporary parallels like Snowden for Abel in the\nstory, or drones for the U2 back then. His reply was 'it is just a\nbloody good story'. Sure, but a story that makes America look good, in\n2015, a time when he could have made a political thriller that could\nhave given us a much more balanced view of reality we see today, with\nthe US spying on everyone. The result would then have been much more\npowerful and less preachy. His choice is all the more peculiar, since\nhe did not shy away showing us uncompromising battle scenes in Saving\nPrivate Ryan, but perhaps it was also helping us realize that was\nindeed a deserved accolade for what America has done for the world.\nSpielberg is, as IMDb says, indeed one of the most influential figures\nof cinema, and he deserves this for his many film making qualities as\nalso this movie shows us again. I just wish with aging he would also\nhave the guts to be like Shakespeare, to allow the arguable greatness\nof the US to shine through all the flaws it surely has like any\ncountry. But, to stick with Spielberg, if you just go for the story\nalone, and you don't mind the propaganda of the US being the ultimate\nexample of the Good of the Free World, then this beautifully adapted\nfilm is entertaining enough.\n"},
{"review": "\nIt's 1957 Brooklyn. Rudolf Abel (Mark Rylance) is arrested for being a\nSoviet spy. Insurance lawyer James B. Donovan (Tom Hanks) is pushed to\ndefend him. Despite popular pressure, Donovan fights to prevent Abel's\nexecution. When U-2 pilot Francis Gary Powers is shoot down over the\nSoviet Union, CIA director Allen Dulles recruits Donovan to test out\nthe prisoner exchange idea as a private citizen. American student\nFrederic Pryor gets imprisoned on the wrong side of the Berlin wall.\nDonovan decides to hold out for both Americans' release.<br><br>Director Steven Spielberg delivers a well-made movie. However, there is\na lack of tension for most of the movie. Spielberg needs to ramp up the\ndanger to Donovan. He needs to gin up more danger to his job and to his\nfamily. The shooting into his house is fine. I expected a scene of his\nwife getting confronted. Having said that, other scenes seem too\nheavy-handed especially the last few scenes back home. Spielberg is\nalso putting in too much of a glare which gives the movie a dreamy\nquality. Instead, it needs a darker, harsher, and scarier tone. Tom\nHanks is a bit too calm. He needs to be scared in more times. The time\nhe's confronted by the street youths in East Berlin is a prime example.\nIt needs to be shocking and it needs to come out of nowhere. Instead,\nit's laid out before it happens and it's a source of comedy afterward.\nThe tension is never too high. It could have been a darker, scarier\nscene.\n"},
{"review": "\nBridge of Spies is the true story of an American lawyer named James B.\nDonavan (Tom Hanks), who recruited to represented a Soviet spy and help\nnegotiate with the Russians in order to get back an American pilot. Now\nright off the bat, I can say this is a really well- made movie. Tom\nHanks and Mark Rylance (who plays the Soviet spy) are excellent in this\nmovie. They both give Oscar-worthy performances and make you actually\ncare for the characters. Also, the writing is excellent. Most of the\nmovie is people talking and negotiating so it could've been boring.\nFortunately, the writing keeps the story really interesting and\nengaging. The direction and musical score were also fantastic. My only\nproblems with the movie is that it is a little slow, mainly in the\nfirst half. Also, it doesn't have that re-watchability so I can't\nreally see myself watching it again. But in the end, this is a great\nmovie that does a great job at doing what it set out to do. I give this\nan 7 out of 10.\n"},
{"review": "\nSteven Spielberg made it again, an historic film that is pretty well\nmade, it was an excellent film and a surprise as well. I had no idea\nthe Coen Bros worked on the screenplay until I saw the credits.<br><br>The first hour was a bit slow, it get much better in the second one.\nThe events in the second half were pivotal and the political\ncomplexities Tom Hanks found himself mired in were essential to the\nplot, the film was starting to get my interest.<br><br>It is a terrific Spielberg picture, there were some great performances\nby both actors leading and supporting, i hope that Mark Rylance gets\nthe Oscar, i would've like to see Tom Hanks get a nomination as well\nbut it is what it is.\n"},
{"review": "\n\"Bridge of Spies\" is a Drama movie which tells the story of lawyer\nJames B. Donovan who is entrusted to negotiate the release of an\nAmerican pilot from Soviet Union in exchange a captive Soviet KGB spy\nwho is held by the United States.<br><br>I liked this movie a lot due to the fact that first of all is based on\nsomething that happened in reality and secondly because of the plot of\nit. In addition to this the cast of this movie was selected very nice\nwith Tom Hanks who played as the lawyer James B. Donovan to make a very\ngood interpretation. Another good interpretation that has to be\nmentioned was made by Mark Rylance who played as Rudolf Abel the Soviet\nspy. The direction of Steven Spielberg for one more time was\nexceptional and this can be seen very easily in the whole duration of\nthe movie.<br><br>Finally I believe that \"Bridge of Spies\" is a very good movie to watch\nand is a lesson for everyone because it represents and shows the\ndifficulty of the job that this lawyer took over and how the choices\nthat he made affect him but his family too.\n"},
{"review": "\nWhen you see the name Spielberg expectations go up. Add in Tom Hanks\nand expectations go even higher. <br><br>Fortunately this film does not disappoint. In many films you will have\n\"a best bit\" or \"the first half was slow but then it got better\" type\ncomments.<br><br>Bridge of spy's is consistent throughout, like a cinematic Rolls Royce.\nIt looks good. It sounds good. The ride is smooth and comfortable and\nit doesn't need any tacky gimmicks to liven things up. Because it is\nwell engineered class.<br><br>This is an excellent story of Cold War espionage and intrigue. Tom\nHanks gives his usual great performance but he is almost outshone by\nthe captured Russian agent. You even get some genuine humour as a\nbonus. <br><br>I very much enjoyed the film and wouldn't mind seeing it again sometime\n"},
{"review": "\nI have to confess to knowing very little about Bridge of Spies before\nthe opening credits rolled. Going from the title and Tom Hanks presence\nwas expecting a thriller, but it's actually a docu drama. The film\ntells the tale of events from the cold war. Like most docu dramas it\nsuffers from the need to spice up a few of the real life events, but\njudging from other comments on the web most of the main plot lines are\ntrue.<br><br>Hanks plays James B Donovan who is a lawyer hired to defend a Russian\nspy Rudolf Abel (Mark Rylance). The film is always at it's best with\nthe interplay between Donovan and Abel. A few of the scenes could\nprobably have been dealt with a little more harshly in editing. As ever\nHanks is always very watchable though, so it's certainly well worth a\nwatch and gives a sense of what life was like during the cold war.\n"},
{"review": "\nI put off seeing this film since I knew the true story too well and\nexpected to be annoyed by various changes made necessary to get the\nwhole spy saga into two hours. <br><br>The movie, for instance, begins with Col. Abel's arrest, thus skipping\nover what people like me go to a spy movie for--tense scenes of\nespionage and spy craft. The character of Abel is made to be world\nweary, but without evidence of his cleverness as a spy it's less\ninteresting as a Cold War tale.<br><br>I learned a lot about the Colonel writing a NY Times story about his\nlife posing in Brooklyn as an artist, and then I requested his\ninterrogation transcripts from the FBI, which they sent me in several\nboxes running to 3,000 pages. None of this was available to previous\nauthors. <br><br>If fans of the movie would like further background on Col. Abel's\ndouble life in America, I have written a Kindle ebook, THE AMATEUR: The\nCold War Life of Rudolf Abel, Artist &amp; KGB Spy.\n"},
{"review": "\n...Spielberg's films do.<br><br>Even allowing for the time (1957/62) difference (2014), the scenes\nreminded me of a 'stage set' - faux walls, sky etc.. In addition the\naward to Rylance wasn't warranted. His script was nearly a monotone and\nalways let Spielberg make a bolshevik/red 'human'.<br><br>The historic accuracy re. the second 'captive' 'Pryor', was false -\nanother 'trick' by Spielberg to 'add' some human/family hook.<br><br>A far better script would have added after successfully negotiating the\nexchange for Francis Gary Powers, Donovan's negotiated the freedom of\ninitially 1,103 but expanded to 9,703 Cuban anti-Castro men women and\nchildren.<br><br>With Spielberg, as with all Hollywood leftists, there is always the kid\nglove treatment of the horror of the reds, even allowing for the\ncallous machine gunning of the fleeing East Germans over the wall. In\nSchindler's List, Spielberg made sure he got his anti-gun message in\nthe final scene when the Jews are surrounded by the German SS guards\nand tell them (the Germans) to go. In the movie no one has firearms in\nreality the Jews did and had them pointed at the Germans.\n"},
{"review": "\nBridge of Spies is directed by Steven Spielberg and stars Tom Hanks,\nwhich is the best director-actor duo in history in my opinion. Once\nagain, Tom Hanks is so good as a lawyer who has to defend a Soviet spy\nduring the Cold War. But probably the best performance was Mark\nRylance, the man who played the Soviet spy, and he certainly deserves\nan Oscar nomination. The cinematography is so beautiful and Spielberg\nperfectly captures the world in 1957.<br><br>Most of this movie is conversations between Hanks and others during\nnegotiations or court room scenes. A lot of people can be turned off by\nthis, claiming it's \"too boring.\" But if you like drama with a lot of\nintrigue about history, you will be engrossed in Bridge of Spies. It is\na slow and long movie, so you have to be patient while watching.\nHowever, there is a fantastic scene with an airplane that brings energy\ninto the movie.<br><br>Bridge of Spies is certainly not one of Spielberg's masterpieces, but\nit is still a great movie on its own. Bridge of Spies gets an A.\n"},
{"review": "\nAt the height of the Cold War, insurance lawyer Jim Donovan is chosen\nby his peers to defend a Soviet spy captured by the U.S. Donovan faces\nsuspicion and animosity from practically everyone, but is determined\nthe spy get a fair trial.<br><br>A few years later, when the Soviets capture an important American\nspy,Donovan is tapped to arrange a swap. Plans are complicated by the\nconstruction of the Berlin Wall, as Donovan must negotiate traveling\nbetween East and West Berlin for the exchange to work.<br><br>The film does an excellent job of conveying the realities of the Cold\nWar on both sides, both the physical backdrop of Berlin and the\nemotional world inhabited by Americans, Soviets, and East Germans. As\nSpielberg so often does, Bridge of Spies focuses on the difference a\nperson of conscience and humanity can make in a fraught situation. It\ndoes not disappoint. I particularly enjoyed the rich detail: Donovan's\nkids learning to \"duck and cover\" at school, East Berlin's bombed- out\nbuildings and gangs, Donovan's wife asking him to bring home some\nmarmalade.<br><br>If you want to watch a movie that both explores the challenges and\ncomplexity of Cold War history and also leaves you feeling hopeful\nabout humanity, I recommend Bridge of Spies.\n"},
{"review": "\nAfter a long time, I was able to see and witness a captivating prisoner\nswap drama sequel from the declassified archives of American CIA. <br><br>Steven Spielberg is all praise for his professionally meticulous\ndirection, perfectly taking the audience to the austere world of late\n50s, when the Cold War was taking its surreptitious twists and turns.\nAll the set frames including location shooting in Germany and USA were\ntoo close to reality. The entire story, script, screenplay and dialogs\nwere so well fed and uttered with skillful craftiness by Hanks and the\nsoviet convict spy played by Rylance, which made viable sense and were\nbred with the thrill that ensures the viewer to stick to the end. <br><br>It is a must see spy thriller for mature audience taking them back in\ntime to all those moments of glory unfold from enigmatic and\nsuggestively nerve raking espionage taking place in the classic world\nof late 50s. Well done Tom Hanks and Mark Rylance for superb\ncharacterization of their respective roles, skillful film editing by\nMichael Kahn and top of the line direction by the old timer - Steven\nSpielberg.\n"},
{"review": "\nActor Tom Hanks and Director Steven Spielberg once again teams up to\nmake a historical Cold War drama thriller about an American lawyer who\nwas asked to negotiate the release of an American spy whose U-S plane\nwas shot down in the Soviet Union.The result of the tandem's 6th\npartnership is Bridge Of Spies.<br><br>James B. Donovan is an insurance lawyer who was asked to defend an\naccused spy Rudolf Abel,who was caught in some illegal activities in\nthe United States.The prosecutors were thinking that he will not take\nthe case seriously amidst the Cold War.But apparently he did.Despite of\nbeing proved guilty,he avoided the death penalty for his\nclient.Also,Donovan tried his best to defend Abel up to appealing his\ncase in the Supreme Court.<br><br>Years after,Donovan was asked to negotiate for the release of Francis\nGary Powers,an American spy was caught in the USSR after the U2 pilot\nplane was shot down.They did this through an exchange of spies with the\nUnited States releasing Abel and the Soviets releasing Powers.Aside\nfrom that,Donovan also worked for the release of Frederic Pryor,an\nAmerican economics graduate student,who was visiting his German\ngirlfriend in East Berlin. <br><br>The film was interesting.No question about it.While the film had an\nunderstated impact,the unpredictability of the characters kept the\nmovie interesting from beginning to end.It was nice to see a something\nwherein friendship is developed among people who wouldn't trust each\nother.As for the performances,Tom Hanks could be considered superb.But\nMark Rylance definitely deserves an Academy Award nomination for being\ngreat as the Soviet spy Abel.As for Spielberg,he still remains the best\ndirector when it comes using visual images in telling the story.This\ndeserves the highest rating.\n"},
{"review": "\nName every aspect involving making a film and thumbs go up with this\none.The master speaks, uses his skills to the sublime. No one doubts.\nSpielberg at his best. Right?<br><br>Yes, but...<br><br>1/3 courtroom, 2/3 cold war suspense. Thats a rough outline of the\nscrips structure. The latter would be deeply satisfying for it's\nexiting, sentimentally old- fashion, home- cooked cold-war-spy-movie\ngrandeur. But it is not satisfying to me. Why? Because there is a 1/3\ncourtroom part that is so much more, so much more promising, so much\nmore layered, with so many exiting set-ups, that i miss - i miss him\nmore often these days - good old Clint Eatwood to bring all that\ncomplexity to a satisfying end. The first part is not about cold war,\nnot about a spy and not about court. The fist part is about.....us. Us\npeople in modern days turmoil , caught in the middle of international\nterrorist fear. In the middle of fear for Muslims, in the middle of\nfear for 'the other' human being, in the middle of group pressure,\nconsensus, media hysteria, etc..... The first part is showing a hero\nwho thinks for himself, who is not giving in to group- thinking, who\ndares to stand alone, who uses reason in the right way, who is a hero\nbecause he keeps his brain sound and clear, his private property, not\nowned by Apple, Google or God knows who..... All in the setting of the\n50s. This 1/3 part promises a movie that uses a cold war concept to dig\ndeeper into the psychology of group thinking and the harmful\nconsequences of it.<br><br>Instead, we turn to a good old spy movie, Spielberg forgets his\nmillion-dollar worth set-ups, leaves us alone with the moral\nexpectations we developed and gives us goodies and baddies....with a\ntwist, sure, but......<br><br>Americans that think, act straight and...... Eurpoeans that act weird\nand confused.<br><br>Great movie to watch, because it is nothing more than great popcorn. My\nfavorite is white ceddar cheese btw...\n"},
{"review": "\n\"What's the next move when you don't know what the game is.\" James B.\nDonovan (Hanks) is an insurance lawyer who has been chosen to defend a\nRussian accused of being a spy. He manages to make the entire country,\nincluding his firm, upset with him by the time the trial is over. After\na US pilot is captured the US wants to facilitate an exchange of\nprisoners. Once again Donovan is enlisted to help, but his plans are\ndifferent than what the government wants. First thing, this is a great\nmovie. I really enjoyed this and was entertained by it the entire time.\nI will say there isn't a lot of action in this and the movie really had\nthe feel of Lincoln. To me that's not a bad thing but just a heads up.\nHanks is good as usual and really brings compassion to this role. The\nfact that this is based on true events makes the movie that much more\nexciting and tense. This is a movie that I highly recommend, but again\nmay not be for everyone. Overall, Hanks and Spielberg hit another home\nrun. For a history buff like me this was one of the best movies of the\nyear. I give this a B+.\n"},
{"review": "\nWhen Spielberg is behind the cameras you know you're going to watch a\nmovie which is at least correct. Luckily, Bridge of Spies is more than\ncorrect: it's a remarkable film from start to finish.<br><br>Its strenghts are the great staging, the dark and cold photography and\nthe rock-solid acting. There is nothing more to be said about Tom\nHanks, he is able to make crappy films like Da Vinci Code entertaining,\nso in a good movie like this one, it's obvious he nails it. I've loved\nthe other main character, Mark Rylance as the Russian spy. He transmits\ncomposure no matter what is going around him. The ties that bind his\ncharacter to Hanks' one trascend the main plot and send a bright\nmessage: people have essentially the same values, and if we are\nconfronted is just because of the part of the board we started from\nwhen we were born.<br><br>Its weaknesses, well... no risks taken. The plot is predictable and\nbased in values overused in cinema like friendship, loyalty and\nhonesty. Even the cinematography: after so many movies Spielberg knows\nhimself too well, and his way of managing the resources seems obvious.\nDon't get me wrong, that is great because with an interesting story we\nhave an interesting movie, but far from that feeling of novelty that\nmakes a film special. To be precise: there are shots which feel like\ncopy-paste from other of his movies (those scenes with headlights in\nbacklighting, those slow chases, those cars moving and braking to stop\nin front of the camera...) and the pace is sometimes quite slow (there\nare scenes in which Spielberg shows the exact same thing from different\nangles, adding really nothing to the movie but redundant information).\nBut anyway, it's an enjoyable movie. In fact the best from Spielberg\nlately.\n"},
{"review": "\nSteven Spielberg is one of the best directors of all time with his\nmassive and mostly amazing filmography this was one of my most\nanticipated movies of 2015 and it lived up to most expectations. Tom\nhanks is fantastic in this movie he is instantly likable as he is set\nup from the first scene as an honourable and hard working man. But my\ngod Mark Rylance was outstanding in this movie, he stole every scene he\nwas in and his \"Standing Man\" speech is one of the best monologues of\nthe year. The era of the Cold War was very well done as it was clear\nhow many people hated the soviets in this movie and also made for a lot\nof very intense moments and gave the impression that things could fall\napart at any moment. Like most of Spielberg films Bridge of Spies is\nsuperbly directed with most of the scenes are long cuts, tracking shots\nand close ups. It could have been very easy in a dialogue driven film\nlike to cut a lot but Spielberg doesn't fall for it. This film is not\nwithout its flaws, for one Powers' are in this movie was slow and\nhonestly unnecessary as looking back at Savung Private Ryan the person\nthey were trying to save in that movie didn't even make an appearance\nuntil 2/3 of the way through and that type of decision would also have\nworked very well for this movie. The film also suffers from a slow\npaced second half. With certain obstacles becoming a bit silly and\ndrawn out and being a bit repetitive after a while. The ending however\nwas just perfect for what it needed to be. Not without its flaws but\nstill a great movie and another Spielberg classic. <br><br>8.5/10 A-\n"},
{"review": "\nI recall a time when SS would push the boundaries of film making. That\nwas then.<br><br>Whilst being a very good and well scripted affair it's not what you\nmight call a thriller...no particular tension to speak of as even\nwithout a history lesson you know the outcome .<br><br>All cast do a brilliant job and direction and production is top\nnotch...I don't think I have ever seen a movie with more of a cold war\nfeel about it...especially set direction..one would think it was filmed\nvia a time capsule.<br><br>Lot of talk of American propaganda but that's a lot of\nrubbish..everybody was scared at the time and were cautious.<br><br>Just a word about tom Hanks...he seems to have found a director who\nknows how to get the best out of him...never rated him much till SS got\nhim to act his soul out in \" Saving Private Ryan\".<br><br>Mark Rylance runs the whole show with his beyond excellent portrayal of\na paper soldier in a non contact war of mis-guided hatred and was a\npleasure to watch.Not since Micheal Keaton in \"Birdman\" have I enjoyed\nsuch a performance.<br><br>The only down is the direction was very safe and never gave the\naudience any real feel of threat or tension.<br><br>All in all not a SS classic but well above average.\n"},
{"review": "\nIt has been a while since we have been blessed with something from the\nlegendary Steven Spielberg and Bridge of Spies certainly does not\ndisappoint. I do not think this is one of Spielberg's greatest films\n(It's kind of hard to become of those), however I do believer this film\nis surely high on the list. Bridge of Spies brings light on the Cold\nWar, an event that most audiences do not know much about. The Cold War\ndid not have much action associated with it and neither does Bridge of\nSpies. Nonetheless, this film was highly entertaining and had me glued\nto my seat. Everything flowed together perfectly. These days actors are\nperform at a high level and most films have moving performances from\neveryone they cast. Bridges of Spies was no exception to this. Tom\nHanks has yet to let me down in a film and Mark Rylance looks like he\nneeds to be cast in a lot more films. The only thing negative I have to\nsay about the film is that it is very predictable. But with great\ndirecting, superb on screen performances, and well written dialogues,\nBridge of Spies is among the best films of 2015.\n"},
{"review": "\nHanks plays lawyer and former counsel for the OSS who represents Soviet\nspy Rudolph Abel on espionage charges, and is then asked to broker a\ndeal permitting Abel to return to Russia for the release of Francis\nGary Powers, captured U-2 spy plane pilot. I have a natural distrust of\nSpielberg, most recently from the fictional War Horse, for being overly\nmanipulative with his audiences. I have checked the basic facts behind\nthis movie and they appear legit. If the movie was confirmed on a few\nother points I would give this a 10 without reservation. Sorry, for me\nhistorical movies (and particularly Biblical movies) need to be\naccurate - subtle deviations from the truth can (to me) create false\nimpressions. As it is Hanks and Rylance (as Abel) are just superb,\nHanks seems made for Spielberg's sort of movies. The period work is\nvery impressive and cinematography superb. The story starts slowly but\nonce things get going it moves along very well. This has the feel of\nOscar work, just an impressive movie.\n"},
{"review": "\nYou know and expect cinematic brilliance when it's a Tom Hanks‬ and\n‪Steven Spielberg‬ movie, and that is exactly what ‪‎Bridges Of Spies‬\ndelivers. Be it the story, acting, screenplay, dialogs, casting,\nediting or the background music score, it is all spot on! Tom Hanks is\nas always brilliant but watch out for Mark Rylance, who will leave you\nmesmerized with his very real performance of Rudolf Abel. Spielberg\ntreats each frame with such care that you are just amazed at the\nauthenticity and reality of it! If you do watch movies with a keen eye,\nyou will notice how easily and almost perfectly, Spielberg transitions\nbetween story lines. Go watch it if you genuinely enjoy brilliant\nmovies! This is a movie for people who truly appreciate the art of\nclassic cinema, but with entertainment.\n"},
{"review": "\n'Bridge Of Spies' is a really cool drama movie with intriguing\nscreenplay.Bridge of Spies tells the true story of a Cold War spy swap,\nduring the height of tension between the U.S. and Russia.The movie is\nvery realistic. Spielberg directed it so well and it may lead him to\nOscars for his direction. The writers Matt and coen brothers was really\ndid a splendid job. Tom Hanks nailed his role as James.B.Donovan. He\nliterally lived in the character and made it alive on the screen. The\nway Mark Rylance portray Rudolf Able is commendable. Background score\nis good. Rest of the actors played their role well. It is unlike to see\nsuch kind of spy cold war drama movie.\n"},
{"review": "\nI prepared myself for the slow and steady spy-craft of Steven\nSpielberg's Bridge of Spies and got to watch another strong performance\nfrom Tom Hanks.<br><br>I was not familiar with this piece of history but apparently this\ninsurance lawyer, James B. Donovan, had quite an effect on U.S. foreign\nnegotiations during the Cold War. I can't help thinking there were some\nother stories to tell and should do some research on why Spielberg\nchose this particular story to adapt into a motion picture. There was\ncertainly historical significance to the events depicted and I alway\nlike to be made to think and to learn. <br><br>It looked beautiful, shots, scenery, costumes, but I did notice it was\njust a bunch of white guys for the most part and a few minor roles for\nwoman. I have been reading Hollywood has a problem with that but it's\nnot like this movie set out to change that and I guess they were just\ndisplaying the times. <br><br>There were also some great supporting performances by Mark Rylance, as\nRussian spy Rudolf Abel, and Amy Ryan, who played Donovan's wife and\nwas also the mother in the recent Goosebumps movie. Someone should give\nher a leading role. I liked her all the way back in The Wire. Scott\nShepherd was also good as a CIA agent.<br><br>This movie hinges on Hanks performance and I had no doubt he would\ndeliver. He especially excels in the final climactic scenes. I liked\nthis movie but it was also a bit slow and doesn't necessarily need to\nbe seen in theaters. This is the fourth collaboration between Tom Hanks\nand Steven Spielberg after Saving Private Ryan (one of the greatest war\nmovies ever), The Terminal (forgettable), and Catch Me If You Can\n(another great movie). Read more of my review at swilliky.com\n"},
{"review": "\nSet in the Cold War era, in Brooklyn, Bridge of Spies is a story about\na successful insurance prosecutor, James B Donovan (Tom Hanks) who is\ngiven a case to defend a Russian spy, Rudolf Abel (Mark Rylance). A\ntrue nationalist and yet an idealist lawyer, James draw a lot of flak\nfrom his men for his earnest and professional efforts in the case. But\nsoon, his ideology leads him to a precarious task of rescuing an\nAmerican pilot, a task gravely sensitive for the two conflicting\nnations. The movie is not a nail biting thriller which the title or the\ntrailer or Saving Private Ryan might have suggested. This is a very\nevenly paced drama, predictable for most of the time but boasts of\nmeticulous details, a hallmark of Mr Spielberg. The story is inherently\na little weak, yet Mr Spielberg manages to spin off a decent movie out\nof it. James and Rudolf really hit it off and it is fun to watch them\ntogether. Tom Hanks is at his usual best and Mark Rylance befits the\ncharacter of an extraordinarily wise, artistic and resolute Russian\nsoldier. Other characters are not of much significance and a couple of\nthem actually seem needless. The movie follows a depiction of the event\nas it happened and doesn't display any deliberate dramatization.\nConsequently, it doesn't evoke any strong emotions while watching which\nsome people might actually prefer. Personally, I believe a better\nconnect and impact would have made this movie far more memorable. This\ndefinitely is a decent, American film which scores completely on\nactors, cinematography (involving 1960 Brooklyn) and direction. But\nconsidering what Mr Spielberg and Mr Hanks have done before, I had\nstomach for more.\n"},
{"review": "\nCan somebody explain why is 2 for the life of one? Cause I didn't get\nany justifiable reason, nor Donovan was the greatest negotiator (if he\nwas they don't show it!) this side of the wall.<br><br>All the gibberish, indecision, etc. of DDR's people are not well\nexplained.<br><br>And please don't get me started with those cheesiedumblowbow moments:\nthe catchphrase of Abel, Standing Talls, the jump over the wall/fence,\nthe paper on the train,\"then I f**k it all up\", get back home then in\nthe news I'm so tired, oh my god! America should stop being so\nethnocentric and think that foreign people also buy tickets, and know a\ncouple of things of politics &amp; history, don't underestimate us, please!<br><br>And it's sad cause after that \"we're American cause the constitution\",\nthe trial (even though the synchrony of the events should be delivered\na little bit better, just saying')the movie completely got me, but\nafter the eurotrip, for me at least, it went downhill.\n"},
{"review": "\nEven though I am not American I found many interesting movies about\nhistory and biographical, but not this one. I went to this movie with\ngreat expectation of Steven Spielberg and Tom Hanks and the rating\ngiven for the movie, but the movie was below my expectation. I don't\nfind ,much mystery,twist,thriller or interesting drama. <br><br>The movie was just going on towards successful deal. The opposite\nparties involved in the negotiation with Tom Hanks are approving for\nall his demands after every second attempt. All looks very less\ncomplicated negotiations.Over hyped may be because of entities shown in\nthe film are big or because of I already read about the incident\ndepicted in the movie. But still there are many movies you will tend to\nwatch again and again even though you read the story and watched\nalready, this one not up to that level. The role given for Tom Hanks is\njust a piece of cake for him.<br><br>Movie may be interesting to the audience who obsessed with that true\nevents. Not for me.. sorry!!\n"},
{"review": "\nOK, Bridge Of Spies. Long (141 mins) and boring spy thriller with the\nusual performance from Tom Hanks (James Donovan) who's face throughout\nthe middle of the movie looks like a carrot due to the the bad makeup\nand in the other half has the usual-suspect- grimace if he is having a\npoo because of too much effort trying to convince us with his tricks in\na particular scene. The story is ...hm \"based on a true story\" which\ncan't save it from superficiality. Mark Rylance who plays Rudolf Abel\nis much more interesting/convincing as an actor but also struggle in\nthe adapted screenplay so whoever did it better not do it again.The\nIron Curtain/Berlin Wall is very much Hollywood and you have seen it in\nmany other movies so you are already prepared for it and will not\nsurprise you. At all. It's all a happy ending at the end so everyone's\nhappy apart from me cause it was a waste of time.\n"},
{"review": "\nBridge of Spies had an amazing display of sincere and authentic care\nfor your enemies. The display of love for your enemies in this movie is\na great example of who we are supposed to be in Christ when we struggle\nto do the right thing against our sin nature. For when we love our\nenemies, our friends may hate us for it, but we can be assured in who\nwe are in Christ by not backing down in our character and convictions\neven if the crowd demands our head. In the Bible in Matthew 5:43-45 it\nsays, \"You have heard that it was said, 'Love your neighbor and hate\nyour enemy.' But I tell you, love your enemies and pray for those who\npersecute you, that you may be children of your Father in heaven.\"\nCharacter is also greatly displayed in Donovan's character throughout\nthe movie. For example when the American government asks Donovan to\nviolate attorney client privilege defending an accused Russian spy on\nAmerican soil, Donovan refuses quoting the constitution and stays true\nto his client and character. Bridge of Spies is a great movie filled\nwith true patriotism.\n"},
{"review": "\nTo start off, Tom Hank's acting was spot on. He played the character\nJames Donovan well, and the film as a whole allows us to root for him\nand to feel what he feels, even though everyone looks down on him for\nhis ideals. Mark Rylance's character (Rudolf Abel) was dry in my\nopinion, although there were small moments where he shined. <br><br>The plot as a whole was interesting, but the movie's progress felt\nsomewhat slow. Was it to build up tension? I'd guess so, though I\ndidn't feel it and I was always waiting for more to happen (to no\navail, until the finale). The movie could have been shortened to an\nhour an a half, in my humble opinion. Perhaps it is somewhat due to the\nrelatively simple and short main plot. <br><br>Not an absolute must watch in my opinion. I'm sorry but I expected so\nmuch more. <br><br>6/10\n"},
{"review": "\nThis is worth watching for the acting. Hanks and especially Rylance\nwere masterful. Their characters carried the film. I kept wanting more,\nto hear how these honorable men, in opposite enemy camps planning to\nblow up the World, each doing their duty for beliefs and country, learn\nto know and like each other. Alas, this film hinted at the depth of\ntheir relationship but could have showed so much more.<br><br>Rather, like a parasitic over-the-top twin, the movie within a movie\ninterrupted the story. The U-2 pilot was more Millennium Falcon than\nAir Force, the U-2 special effects more \"Gravity\" than realistic high\naltitude ejection, and the U-2 training--OJT rather than classroom,\nmade me laugh when humor was not intended.<br><br>Some of the plot points felt gimmicky so I read up on the history after\nwatching, and the film did take some literary license with several of\nthe historical details. Although some were clearly worth the payoff to\nmaintain tension, some struck me as more distracting than dramatic. The\nsense of place and feeling of the Cold War comes through, but don't\nwatch this film to prep for a history test.<br><br>Overall, the storytelling, pacing, and acting -- especially the two\nlead characters, make this well worth watching.\n"},
{"review": "\nSo, more than a Decade after \"The Patriot Act\" and every Non Neo-Con in\nthe Country weighed in with Loud and Convincing Arguments about \"The\nConstitution\", \"The Bill of Rights\", and the foundation of the\nCountry's \"American Values\" at Risk, what with Torture now being called\n\"Enhanced Interrogation Techniques\", and so forth, Spielberg and His\n\"Band of Brothers\" have made a Film with the same Arguments.<br><br>Everyone falling all over Themselves about this \"High Moral Ground\"\nMovie, where have you been? Tom Hanks, the Coen Brothers, and others\nContribute to this A-List Film and all should be Commended for Their\nContribution. Mark Rylance as Abel, the Soviet Spy (true story)\nDeserves His Oscar Credit.<br><br>But the Nomination for Best Film of the Year by the Oscars. Hardly. The\nFilm is Peppered with Spicy Scenes that Intrigue but Interest Wanes now\nand then with the Lethargic Pace and Dry Composition. The Message is\nObvious but why Deliver it in such a Matter of Fact, Drawn Out, Lengthy\nStory that Sputters at times.<br><br>This is one of those that the Parts are much Better than the Whole\nThing and this Thing is surely Professional Artisism at its Highest\nLevel, but as a Profound Picture with a Heavy Political and Topical\nMessage. Not so much.<br><br>It Misses the Mark and that is to Package the Content in a Gripping and\nUnforgettable Film that can not be Overlooked by the Masses. The Method\nthat the Director and His Team chose, will Alienate Half the Audience\nand most likely will Never get the Encrypted Memo.\n"},
{"review": "\nGreat movie. It left me wanting to learn how to say \"Standing Man\" in\nRussian. I hope that \"James Donovan\" the main character is accurately\nrepresented by Tom Hanks. An amazing man who stood for what is right\neven against his own government. However did you spot the mistake with\nthe pilots uniforms. In the movie the pilots are wearing tan uniforms\nas used to be worn by the Army Air Force. By the end of 1952 all US air\nforce personnel were required to wear blue uniforms so that the period\nof 1957-60 would not have seen the uniforms that props issued to the\nactors playing the pilots. In-spite of that i like the way that the\nparanoia of the time about the soviets and the bomb were represented.\nIt really reminded me of our modern equivalent of being paranoid about\nanyone who comes from a Muslim country.\n"}
]