[
{"review": "\nFirstly I would like to state that it is completely hilarious reading\nreviews with One Star because the movie had \"Foul Language\" and \"Sex\nScenes\" or that someone had no idea that the movie was inappropriate\nfor their 9 year old kid. Dead Pool is rated R and with 3 minutes of\nresearch you could have determined if this movie was for you or not\nWith that being said I will not delve into the plot but the acting and\nwriting were fantastic. Ryan Reynolds nailed this role. If you are\neasily offended by violence, language, or nudity this is not the movie\nfor you but if you have a sense of humor and want to be entertained for\n2 straight hours you will love this movie.\n"},
{"review": "\nAt first glance, Deadpool seems like a typical superhero movie due to\nit being made by Marvel. But once those hilarious intro credits show\nup, you know you are in for one of the most creative films in recent\nyears. <br><br>The first thing that is unique about this film is the characters. In\ntypical superhero films the characters are stiff and super serious, in\nDeadpool the characters are filled with personality and can range from\nthe serious Francis to the silly Deadpool giving this a parody like\nfeel, in a good way.<br><br>Also what is different is that this is a story of revenge rather then\nsaving the city/world/universe that is seen in every single superhero\nfilm. Also the tone of film is more comic then dark thanks to the\nfantastic humor of all kinds from slapstick to dirty to just plain\nsilly, this film just does not stop the laughs (I laughed 20- 30 times\nin my SECOND watch). <br><br>As for being an origin story, I can say that the backstory placements\nwere well done, equally as funny, and explains only what is important\nin understanding the story. Final rating 10/10 this is a great nominee\nfor movie of the year and one of the greatest comedies ever made\n"},
{"review": "\nLet me say at the very beginning of this review, I loathe super hero\nmovies. I can not stress that point enough. For me, watching anyone of\nthe countless driveling movies which have been pumped out by studios in\nthe name of entertainment over the past decade is, for me, akin to\nhaving teeth pulled. Painful to say the least. My friends however are\naddicted to every single bombastic franchise, and through sufferance,\nI've endured countless hours of mind numbing boredom watching yet more\nLycra-clad numpties saving the earth from ridiculous threat (there are\nof course exceptions to the above; 'The Dark Knight', the original\n'X-Men)<br><br>I was once again convinced that spending an evening with chums watching\nDeadpool would be an excellent waste of my time. I envisaged 15 minutes\nof feigned interest, followed by an hour 45 of updating my email and\nsome cheeky online shopping. Well that new Morphy Richards kettle and\ntoaster are still waiting for me to purchase as low and behold, shock\nof all shocks, this film is bloody marvellous!! Bloody, hold your\nknickers cause they are about to get blown off, marvellous!<br><br>The dialogue is witty, sincere, and delivered by every single actor\nwith a naturalism which seems more like improvised off the cuff genius,\nthan drab scripted nonsense.<br><br>The pacing of the movie is excellent. It held my interest through its\nentirety.<br><br>The actions scenes directed with the skill of a more seasoned director.<br><br>I was so pleased that for once, I was being forced to watch a movie\nthat treated me like an adult, with adult humour and themes, made for\nadults. Not for grown children masquerading as adults.<br><br>This film is a perfect storm! Just everything is right! I look forward,\nto my great surprise to any squeals!\n"},
{"review": "\nLet me just say off the bat that I liked this movie overall. The action\nand the humor were both very good, and Ryan Reynolds nailed the role of\nDeadpool.<br><br>With that said, Deadpool, the infamous anti-hero known for constantly\nbreaking the 4th wall and just overall being unconventional, is stuck\nin a way too conventional movie that doesn't take enough risks.\nDeadpool in this film is very much himself, and there's plenty of\nR-rated humor the usual PG-13 Marvel film tries to avoid, but in the\nend, the film gets bogged down by a typical 3rd act finale (the weakest\npoint of the film), another forgettable Marvel villain in Ajax\n(possibly the worst),plus the typical supporting characters like the\nlove interest and goofy sidekick. It's all a little too conventional\nfor such an unconventional character in Deadpool, and the movie\nsuffers.\n"},
{"review": "\nI am aware that to many people (especially those unfamiliar with\nDeadpool comic or Marvel comics at all) this movie would seem too gory,\nunnecessary brutal and excessively violent. But this movie is a comedy,\nwhere its main protagonist, Deadpool, should be perceived as a\ncomedian, and Ryan Reynolds did an excellent job representing this\ncharacter.<br><br>The story of Deadpool isn't complex or profound - and it wasn't meant\nto be. This movie is all about fun and entertainment, abundant with\naction, jokes, blood and foul language. Therefore, it is not suitable\nfor children. I grew tired of people thinking that movies based on\ncomics are intended for children only.<br><br>Related to that, I believe that many Marvel movies could have been far\nmore successful if they didn't refrain from gory scenes. I am sorry,\nbut if you want to make a serious combat-based movie and you make it\nwithout blood, than that movie will be all but serious.<br><br>That is why I see Deadpool as a refreshment. Nowadays many writers and\ndirectors are too worried about political correctness in their movies.\nThat really stifles creativity and that is why today we have so many\nmovies with great ideas but poor realization.<br><br>Thus, to me, Deadpool was a very pleasant surprise, I had fun watching\nit, and I intend to watch it again some time soon.\n"},
{"review": "\nDeadpool, 2016 <br><br>*Spoiler/plot- An off-beat superhero mercenary belongs to a private\nsaloon club that has a 'deadpool' lottery established for all members.\nThe mercenary finds out he has in-operable final stage cancer. He is\nrecruited by some shady medical scientists that make him a mutant under\nthe guise of curing his cancers to save him for his girlfriend.<br><br>*Special Stars- Ryan 'Deadpool' Reynolds, Karan 'Dopinder' Soni, Ed\n'Ajax' Skrein, Michael 'Warlord' Benyaer, Stefan 'Colossus' Kapicic,\nBrianna 'Negasonic Teenage Warhead' Hildebrand.<br><br>*Theme- Common people can be daily heroes to society.<br><br>*Trivia/location/goofs- Rated 'R' for graphic violence and sex. Look\nfor Stan Lee's obligatory film cameo as the strip club music DJ.<br><br>*Emotion- A kooky and fun film (almost a parody) of the Marvel comic\nbook franchise. Very watchable, but too confusing if taken too\nseriously for the audience.<br><br>*Based On- Marvel comics\n"},
{"review": "\nIf you enjoy sitting in on conversations that are typical of young and\nfoolish teenage boys this is the movie for you. Every other line\ncontains the F word and for some reason the director thought penis\njokes are the funniest around.<br><br>The story is about as hollow as the humor. It's a cheap and bland story\nabout revenge and invincibility painted with a veneer of \"love\" that is\nas misguided as the character's personality.The movie is littered with\nsarcasm and cynicism that just becomes depressing after a while.<br><br>Ryan Reynolds acts like a 13 year old boy throughout the movie, cursing\nand making penis jokes and then talking to the audience thinking he is\nvery funny. <br><br>This is the most overrated movie I've seen. Most of these reviews on\nIMDb had to have been paid for. Hollywood had to have paid for this\nhype or people these days have really low standards. This is a low brow\nfilm like no other.<br><br>Save 2 hours of your life and do not watch this movie.\n"},
{"review": "\nI have to admit that I am a huge fan of Deadpool. After reading the\ncomics and trades, I was excited when Marvel announced that they were\nfinally going to make a Deadpool movie.<br><br>I had liked Ryan Reynolds as Green Lantern but when I found out that he\nwas cast to play Wade Wilson, the merc with a mouth, I was one happy\nfangirl, and I have to say, he did not disappoint.<br><br>Marvel had fun with this film, all the characters were perfectly cast.\nIt was fun watching Negasonic Teenage Warhead (Brianna Hildebrand)\ninteracting with Deadpool, trading snark for snark while Colossus\n(Stefan Kapičić as the voice of Colossus,) is trying in vain to appeal\nto Deadpool's (better, saner?) side without success. Ajax and Angel\nDust (Ed Skrein and Gina Carano) were good strong villains but it was\nLeslie Uggams as Blind Al that really stole the movie.<br><br>The rest of the supporting cast played their roles well and created a\ngood strong background for the main cast.<br><br>It was also nice to see that Marvel finally got Deadpool's character\nright for a change and I loved the fact that Deadpool's constantly\nbreaking the fourth wall was included and a brief glimpse of Bob popped\nup to the delight of the audience.<br><br>The movie was filled with chaotic images and kept up a frantic pace\nthat suited the movie perfectly. The constant tongue-in-cheek\nreferences and humour kept the movie from becoming too dark.<br><br>All in all, Deadpool was a winner and I am looking forward to the\nsequel.\n"},
{"review": "\nOr maybe you like it even more for not being part of the other Marvel\nmovies. Even if it refers to some of the characters (especially the\nX-Men, since this is mostly owned by 20th Century Fox). I never read\nthe comics, but did have the pleasure of playing the game on my\nPlaystation. And I did think it was hilarious.<br><br>The \"wink wink\" humor of it, is not everybody's taste of course, but if\nyou like movies breaking the fourth wall (beginning with the opening\ntitles), than Deadpool is speaking directly to you - kind of literally.\nHe also is as offensive as possible and still very likable. Which is a\ntestament to the lead actor. Reynolds seems a perfect fit for this,\nleaving behind the \"shame\" of being \"green\" (another Superhero he\nplayed, not as successful, if you even can remember that).<br><br>Even if you saw the trailer, there are so many jokes in here, you will\nfind many things to like. Unless you are more of straight kind of jokes\nguy/gal ... no pun intended. But then you better steer clear of this\nanyway ...\n"},
{"review": "\nI walked into this movie with the hopes that Fox/Marvel would make this\nmovie not be like the trash fire that was Baraka from mortal combat\n(you all know what I am talking about). I walked out with a huge grin\non my face because I couldn't stop laughing the entire time. This was\nthe best way I could have seen Fox/Marvel apologize for their last\nattempt at the titular anti-hero. Firstly, Ryan Reynolds was terrific\nin the role, we all knew he would be, but this time he actually showed\nus that we were right about it. The costume was also great as well, the\nmain thing I liked about it was his eyes, and how they actually showed\nsome expressions and feelings while he was wearing it. The story\nhowever was very simple. While I am not trying to complain about it,\nfor it probably would have taken away from the movie if it was more\ncomplicated, but it was a very simplistic story with the same thing as\nyou would see in most movies these days. However, you will be\ncompletely distracted from that with really cool action scenes and\nhilarious scenes. This movie really is hilarious and you won't stop\nlaughing throughout the entire film. The action scenes are also really\nclever. This movie isn't just chop chop here, shoot shoot there, but it\nactually goes about how Deadpool would actually handle it. There is a\nscene in the movie where he chops off a guy's head and kicks it like a\nsoccer ball into another guy, now that is really cool. Overall, this\nmovie while it has its faults, you don't ever notice them because of\nthe humor, action scenes, and the amazing performance by Ryan Reynolds.\n"},
{"review": "\nI have seen a lot of marvel movies,but I'm going to be honest,I have\nnever seen a marvel movie that was rated r and I was actually pretty\nshocked.I saw the trailer,I never knew what dead pool was before. Then\nI saw the movie and i was dying laughing from the entire film. It was\nway beyond any type of marvel movie. However,it was funny and action\npacked;only this time,it had that adult touch to it.There was lots of\nthings a marvel movie shouldn't have:it had sex,nudity,lots of\nlanguage,graphic and bloody violence,and just basically any adult movie\nwould have. While I was watching the film,I learned a lot of what dead\npool was before I even read the comics. I learned that he was,at first\na cancer patient,then he went to some secret facility to cure his\ncancer,but instead,they were tortured him until he couldn't feel any\npain. Although,he has done more than avoid pain:he basically became\nimmortal. He couldn't feel pain,like literally nothing at all. He was\nan ugly disfigure who just wanted to be normal,so that's why he wears\nthe red suit(which he made).He wanted his face fixed and his woman\nback,but some bad guys take his girl and now he faces them,he gets his\ngirl back,but they don't fix his face. So he lives the life as a person\nwho doesn't care about anyone,but kills the people that mess with him\nand his woman.I also learned that he is part of the x-men movies,even\nthough he doesn't join the x-men in his movie. HE is also a loud\nmouth,which makes his enemies mad. So yeah,I learned a lot,I had a lot\nof laughs from the inappropriate humor and also the bloody\naction,because I just love action when people are fighting and I just\nlove this movie and it was a really great start up for a 2016 marvel\nfilm\n"},
{"review": "\nI've waited for this movie for a long time, and went to see it in\ncinema when it came. I'm SO in love with it!! I've watched it few days\nago at home again, and I felt like watching it for the first time. It's\nfunny, most of the jokes I'll not forget for as long as I live because\nthey were hilarious and unique. Ryan Reynolds is perfect for the role\n(if anybody else was in this role, the movie would be no good). Did I\nmention amazing soundtrack? I can't wait for Deadpool 2! Ryan you look\namazing in the suit &lt;3&lt;3&lt;3 Deadpool is definitely most unique and\nfunniest character I've ever seen, and he'll forever be my favorite\none.\n"},
{"review": "\nThis is perhaps the only film during which I laughed from beginning to\nend, when I first saw it. I think I annoyed quite lot of people in the\ncinema with that. So many surprises and easter eggs. The film is out\nfor one year and I think I've seen it more times than Pulm Fiction!<br><br>It's original, it was made with love by the filmmakers who wasn't\nafraid to take risks. I am looking forward to see something new, not\nlike most blockbusters copying old scheme of films that just makes\nmoney..<br><br>Ryan Reynolds nailed this role. He is simply Deadpool and nobody else\ncan it be! With that he deserve more recognition, because the film was\nwas quite possibly made thanks to him.<br><br>If you are easily offended by violence, language, or nudity this is not\nthe movie for you but if you have a sense of humor and want to be\nentertained for 2 straight hours you will love this movie.\n"},
{"review": "\nThe opening credits are very funny! It's an unusual Marvel movie with\nswears and more! It is definitely different. It has intense blood.\nSure, there are some sexual parts that I didn't watch because I'm\npretty young, but other than that it is very cool, different, and very\nfunny. I just saw it for the first time a few nights ago, and I sure\ndid like it! And as I said, the opening credits are so funny! \"Starring\nGod's perfect idiot, a hot chick.\" Gosh! Get's me every time. I was\nlaughing on the inside while I was writing this! Anyways, the movie was\nintense and funny all at the same time! I liked it very much! Swears,\nblood, that's everything I like!!! Thank you, Marvel, for making this\nmovie!\n"},
{"review": "\nSo Deadpool , a character which was butchered in X-Men Origins but here\nhe is again taking the stage all by himself.Its so funny ,explicit,\nhumorous and hit all the right chords of an R Rated Comedy about a hero\nwho definitely kills more than villains. Firstly this movie works\nbecause of the freedom it received and without any intervention from\nanyone it does what it should do, it makes you laugh filled with\nwierdly funny jokes and amazing action sequences.And Ryan Reylonds is\nabsolutely amazingly fantastic. Where was he all those years ago? His\nportrayal deserves him an Oscar but academy.This film from stating the\nfilm's cast and title till the end credtis roll is a full on laughter\nride.I mean this is the film that makes fun of the x men timeline and\nstates that's confusing.This is the one that points out that the\nXavier's mansion blows up in every x men movie.I will not go further on\nthe story though since you should watch it and be surprised but I can\ntell you every thing u loved or hated about a superhero movie is being\nlaughed at in this flick.go and watch\n"},
{"review": "\nThe idea of making an R-rated superhero movie is good and I think it\nshould be a trend but this movie is not a very good example.<br><br>A few scenes did make me laugh. I liked the action scenes.<br><br>However, one problem I have with this movie was that it was trying too\nhard to be funny. Some of the humor was just ridiculous and very bad\ntaste. Examples would be the scene where Ryan Reynolds farts and the\nscene close to the ending where Ryan Reynolds was lying next to his\nlover Vanessa as he was still fighting Ajax, he made a hole with his\nfingers and stuck a finger in the hole as a sex joke. Also the scene\nclose to the beginning of the film where Ryan Reynolds had a hole right\nin the center of his ass on his suit was just childish.<br><br>Another problem I had with this movie was that Ajax was just not an\ninteresting villain. He tortured Deadpool, fought him, kidnapped\nVanessa, fought Deadpool again, and then got shot in the head at the\nend. For a supervillain, Ajax didn't do much. And the movie never\nexplained how Ajax got his super strength.<br><br>My last issue with this movie is the fact that Deadpool was played by\nRyan Reynolds. He is like Jackie Chan, Danny Trejo, or Adam Sandler,\nyou can't take those guys seriously, especially after Ryan Reynolds was\nin that horrible Green Lantern film in 2011.<br><br>Hopefully, the sequel will have better humor and villains.\n"},
{"review": "\nA lot of superhero movies favor special effects over character (I'm\nlooking at you, Avengers), but perhaps because Deadpool had a\nrelatively low budget for this sort of thing - something I only know\nbecause I read it on wikipedia - this movie is full of character. The\nprotagonist is a vengeance seeking madman constantly breaking the forth\nwall, his best friend is a hipster bartender who gambles on his brief\nlongevity, and he and his girlfriend (the ridiculously attractive\nMorena Baccarin) engage in the dark clever banter you'll love if you're\na fan of the series You're the Worst).<br><br>Deadpool proves that giving your characters personality does not mean\nyou can't also have great action scenes, such as the crazed one that\nbegins the movie (and clarifies the funny and perplexing title\nsequence). I found the action in this movie far more exhilarating than\nthe bigger-is-better approach of some movies (I'm looking at you again,\nAvengers).<br><br>Overall, this is as fun and funny as Guardians of the Galaxy and has\naction as memorable as that in X-Men: First Class. Ryan Reynolds\nbeautifully plays Deadpool as a psychotic version of Spider-Man, and\nreally, the whole cast is excellent.<br><br>This is a sort of tangential X-Men movie, but it still exhibits a lot\nof what makes that series the best of the Marvel universe.\n"},
{"review": "\nOut of all Marvel movies made, Deadpool was the worst. The main\ncharacter talks too much it became very annoying after 5 minutes. The\njokes were not funny. The scene transition between flashbacks and\npresent conditions were not well done.<br><br>They tried to put in 2 X-Men character in the worst possible way. It\nreally shows that the studio had no budget for many characters, but\ninstead they invested a lot in the slow-motion special effect, which\nwas cool.<br><br>In terms of story-line, there's no story. There's no character building\nas well. For about 2 hours, all you can do is endure the horrible\nblabber mouth of the main character. Not funny and irritate the ear.<br><br>I wonder how many people did the studio pay to write in good reviews in\nthis website...<br><br>Worst Marvel Movie Ever.\n"},
{"review": "\nOne word describes this movie - pointless.<br><br>Wow, this film was incredibly boring. People are hyping this movie over\nnothing. The story is so simple and boring. It didn't even feel like I\nwas watching a thought-provoking movie, more like a short and simple TV\nseries with an unfunny, forced and pointless main character on his\npointless adventure to fight forgettable and pointless villains. <br><br>The X-men were pointless as well. They didn't add anything to the\nstory. They only assisted Deadpool with fighting the villains when\ntheir original goal was to have deadpool work for them. They happily\naccepted Deadpool as a murderer and wished a murderer to join them. <br><br>The only okay point in this movie was the action. However, the action\nstill could have been better as it felt very rushed at times, and at\nother times very short and at times it lacked in good choreography. It\ndidn't feel intense at all, more like you know the villains are going\nto fail very easily.<br><br>I also hated the use of childish words being used quite a bit to\nexplain the purpose of the weapon x program e.g. \"superheroes\",\n\"superslaves\" etc. What are these villains even doing? There was\nnothing deep and meaningful behind the program and these villains. The\nstory was lacking in too many ways. The world felt very empty and\nhollow.<br><br>Looks like people are very cheap and easy nowadays that they would\nenjoy anything just because it is r-rated. That is the truth, that is\nthe only reason this movie has such a high rating because of the use of\n\"F\" words and other vulgar words, it has sex and nude scenes and it is\ngory and violent. None of this is new. Again, the Story and Characters\nare terrible.\n"},
{"review": "\nDeadpool is an outbreak in superhero film industry. When talking\nsuperhero movies, you expect movies stuffed with senseless action and\nviolence, an out-of-reach love story, or unnecessary vulgar language.\nDeadpool serves these aspects in a fine ratio, none outweighing the\nother.<br><br>The movie is a smart mix of explicit comedy, romance/drama, good\nstorytelling, directing, cast performance, visual effects and\nscreenplay. Watching the movie, hardly a scene went-by without\nlaughing; even the vulgar language comes into context. The love story,\nalthough unlikely, but attractive. The story-line is smooth and light-\nhearted, not confusing or ridiculously prolonged. Visual effects were\nappealing, not sloppy.<br><br>So if you're willing to a watch movie with this \"recipe\", Deadpool will\nrather do the trick.\n"},
{"review": "\nThe last time we saw \"the Merc with the mouth\" it was in X-Men Origins:\nWolverine. He laid at the bottom of a pile of rubble, mouth-less,\ndisgraced and his character bastardized for the sake of name\nrecognition. Fans everywhere shed a tear believing that their one and\nonly chance to see Deadpool in all his snarky, cartoonish, meta,\nmurderous, mayhem were gone forever. In the time since that debacle of\n2009, the world is a different place. Women have gained the right to\nvote, we've had two Popes and Chris Hemsworth redefined the word\n\"sploosh\" for women everywhere. Most importantly though, Deadpool has\ngone from largely unknown cult comic character to the Che Guevara of\nMarvel's underground appearing in Marvel's animated movies, his own\nvideo game and growing an enormous fan base. A fan base so large in\nfact that 20th Century Fox was convinced (albeit begrudgingly) to green\nlight Ryan Reynolds, perhaps the film's biggest supporter, to take\nanother shot at creating more true to character version of Deadpool.<br><br>So what's the verdict on this movie? IT'S PERFECT! Everything that\nmakes Deadpool the dark comedy king of Marvel is here! He's cocky,\nhyper violent, self referential, clearly a little pissy about having to\ndrag Fox kicking and screaming into making this movie and is as nutty\nas an old school Bugs Bunny cartoon, you know, the good ones with all\nthe lovable racism. The action scenes are stellar with over the top\nviolence and believe it or not, the love story that drives the whole\nthing is genuine and heartfelt with Morena Baccarin playing against\nRyan Reynolds with an equally dark sense of humor.<br><br>So if you're looking for a good both a good Valentine's Day movie to\ntake a loved one to this weekend, and a movie that will make you howl\nwith laughter one second and then shout \"EWW\" and \"awe\" within that\nsame second. Check this flick out! You'll be glad you did! Deadpool\ngets a PERFECT 5... out of 5.\n"},
{"review": "\nRyan Reynolds cast in this movie as an unusual super hero is a perfect\nmatch. Ryan's comedic performance was exciting and captivating. You\nnever know what will happen next, much less how Deadpool will resolve\nthe dangerous situation. <br><br>Conflict and humor make for an unusually entertaining mix in this\nmovie. Deadpool always has a fun but morbid comeback for every\nantagonist in the movie. The love affair with a girl who is as twisted\nas he is makes the characters a prefect match as a couple. The end of\nthe movie proves that even more. <br><br>I loved that way it was written, directed and performed. I am looking\nforward to Deadpool's next film.\n"},
{"review": "\nI loved this movie so much. I am a huge Deadpool fan and I love the\ncomics. And I gotta say, as a Deadpool fan, I was completely satisfied.\nI haven't had that much fun in a movie theater in a long time. It was\nfaithful to the source material, the casting was perfect, it was\nhilarious, and all around just a perfect movie. I've already watched it\nthree times and it never gets old. Easily one of my new favorite\nmarvel/comic book movies and movies in general. I you haven't seen it\nyet, watch it now!I promise it will not disappoint and if your a fan of\ncomic book movies or movies in general, this is one of the better ones\nthat have come out his year\n"},
{"review": "\nMarvel has repeatedly toyed with ways to riff on their overblown\nantics. They had Ant Man last year where he shrunk and all that and the\nall important fight to save the world took place among toys. They had\nTony Stark in the last Iron Man as screwy actor struggling with\nsuperhero machinery that blew up in his face. The first Thor of course,\nwith the savior hero washing down in 'real life' from his astral world\nabove and shown to be a big jock.<br><br>That's what they do here, a superhero narrator plowing his way through\nthe superhero plot while commenting on the absurdity of tropes. It's\nmostly matter of engineering gags from that point. He's hideous\nlooking, rides to the big showdown in a taxi. He has only 12 bullets,\nmisses a few times in close range then gets a miraculous shot. He's\nonly incidentally fighting against evil and would rather chew his own\nhand out of a bear trap than join the goody-two-shoe X-Men. He's\nbasically this snarky dude who was plopped inside a Marvel movie and is\nfighting his way out of being a superhero (but meanwhile enjoys the\nmischief possible with playing the part).<br><br>Far from novel but they decided to keep the kids out this time so we\nhave a bit of personality, a stoner imagination. His flatmate slash\nsidekick is an old lady and they get to toke together. Unlike an\nAvengers Walmart, you don't get the sense that it's corporate wash\naimed at everyone and no one in particular. <br><br>My favorite bit was probably the relationship with the girlfriend. Love\nas unabashedly chasing each other outside norms. It's not as easy to\nseduce that twinkle in the eye out of actors as it looks.\n"},
{"review": "\nThis movie is by far the worse of anything that anyone can put out. The\nplot was full of holes. The characters far from believable and the\nacting overall is what makes actors in the adult industry believe they\ncan actually cross over in to mainstream Hollywood. The jokes in this\nare funny at first, but after hearing the same lame topics for awhile\nit gets tiring unless you are a teenager going through puberty with\nhormones all out of whack. Actually they would get tired of the jokes.\nThe only people who would not are the really weird people that live in\ntheir mom's basement at 40 plus years. <br><br>The movie is more violent and has more profanity than other Marvel\nmovies, which does nothing to help or hinder the movie. It is the\nacting and writing that destroys this movie. Overall if you have not\nseen this movie consider yourself lucky, if you have like I have, and\nare divorced, like me, then be thankful for the movie. Watching it was\nthe worse decision and not my taste in women.\n"},
{"review": "\nI didn't really find it funny, the humor seemed very gimmicky after a\nwhile since a lot of the jokes are 4th wall bending. I didn't find it\nreally that clever. They put Deadpool through a lot in this movie and\nthey like to show his pain because I guess that would make the audience\nfeel sympathetic towards our main character. However it doesn't really\nfeel uncomfortable for the viewer at any point. I would've liked it if\nthey added some actual anguish, and not just Deadpool saying \"this is\nterrible but I joke about it\". <br><br>Facing losing your life to cancer is hard enough in itself. I felt like\nthe film tried to get it more powerful and effective by piling more and\nmore things on to their character, but it's really how the characters\nreact to a certain situation, not the severity of the situation itself.\nFor the character they built and the amount of tragedy there supposedly\nis, there is really not that much emotional reaction that they are able\nto actually get out. It doesn't go very deep into the world that they\nare in either, I didn't really get a fullness feeling out of it, so\nfourth wall breaks don't feel very outrageous at all.\n"},
{"review": "\nTotal waste of time. This movie was so bad that it's even difficult to\ncomment or think of where to begin.<br><br>The description is also a bit misleading, it should say, <br><br>A trash-talking, 2nd rate wannabe mercenary who thinks vulgarity is\nhumorous is subjected to a rogue experiment that leaves him with\naccelerated healing powers and a quest for revenge due to a facial\ndeformation side effect.<br><br>Constant unnecessary foul language and vulgar nonsense pre-teen type\ncomments from this empty headed non-hero loser is mostly responsible\nfor turning a potentially decent move into nothing more than a trashy\npre-teen / teen film that teens aren't even supposed to watch, but\nmaybe that was the whole purpose of this waste of resources to begin\nwith, but then again even a pre-teen would find this movie \"lame\"!\n"},
{"review": "\nI'm reminded of Wil Smith in Hancock (2008) which was more of a\nsuperhero crime drama than a superhero dark comedy action as Deadpool.\nNevertheless, perhaps its the contemporary times of change and\nloosening of societal morals that the gutter talk of sex and swearing\nlike young boys and late night comics within a superhero movie was\ninevitable. While the dark humor is creative and at times refreshing,\nit really seems more like a stand up comic night with a lot of R-rated\none-liners. Even Deadpool noted the absence of a lot of superheroes in\nthis movie. The fusion of comedy, action, and then a severe transitions\nto romantic drama, along with the constant cynicism much better\npresented in Hancock, made for a jarring experience with a movie\nwithout a consistent tone. Along with a lot of Kill Bill death-dealing\nand death-defying action, this movie seems more like a testosterone\naction entertainment thriller for boys rather than anything really\nseriously award winning. The one redeeming element of the movie was\nRyan Reynold's delicate and remarkable performance.\n"},
{"review": "\nThis movie was not funny, it was not exciting, and the plot was so bad\nthat you could just say it was plot less. This is easily the worst\nmovie i have seen so far this year out of about fifth-teen movies in\ntotal. I'd say that is more than enough to warrant the rating of a one.\nThe jokes completely lacked creativity. They were just crude and very\njuvenile. It was like a twelve year old trying to be as offensive as\npossible. Yeah, they're saying some stupid and offensive stuff, but\nthey're still only 12 years old so they're not very good at it. Any any\non stage comedian i've ever heard is about twenty times more creative\nand offensive.\n"},
{"review": "\nThe image I had of dead-pool before the movie (from what I've heard and\nseen from friends and internet; never read the comics) was a rather\ngood one. The movie completely ruined this image.<br><br>The dead-pool in the movie is very annoying and trying way too hard to\nbe funny. 95% of the jokes are simply bad and not funny. I don't mind\ndumb, simple, stupid or dirty jokes. I love enough shows like that,\ne.g. South Park. But in this movie, the jokes can mostly be only\nenjoyed if you're 10 years old or so. It was just bad.<br><br>Apart from the horrible humor, the story was... well, interesting\nenough to follow. Nothing special, but also nothing much worse than any\nother superhero movie story.<br><br>Conclusion: Don't watch this. Better read the comics (and I really hope\nthat the comics are better than this).\n"},
{"review": "\nI wish I could have those 108 minutes back. This was just bad. Written\nby two terrible writers. Directed by an animation/titles guy. Acted by\na grown man pretending to be 12. Costarring a female him. How is this\nconsidered entertaining? Everyone sounds exactly the same. Tons of time\njumps to dress up the bad storyline. It's like a cross between Van\nWilder, Kill Bill, and Striptease. If this is at all a reflection of\nwhat comic book fans want to see, I'm truly disappointed. How this\npossibly made over 10 to 1 in box office is unreal. Is this the end\nresult of the internet vs reading real books? Zero imagination. Zero\ndelivery. Zero quality. Worse than Thor 2.\n"},
{"review": "\nIts an overrated movie with curses written by some 12 year old. No\nstory, no real plot, the film could have done without the villain. This\nfilm deserves a 5 or 6 stars at the highest. The reason I am giving it\na 1 is due to its over rating. The film mainly attract audiences of\n16-25 years. Just a cash grab film. Simply marvel's worst. And there's\nthe feminism there. The heroine always has to save the hero now. Ryan's\nacting was good in this movie. It suited him. The cgi wasn't bad. But\nif this movie were to come out before the Iron man then it would've got\n4-5 stars. There are some marvel films which deserve higher rating\ninstead of this movie .\n"},
{"review": "\nI was really looking forward to Deadpool as I'm a Ryan Reynolds fan and\nit's rated R.<br><br>However the humor is toilet humor. It's about farts, jerking off and\ncomments about actors, including Reynolds himself and other movies.<br><br>The plot is that Wade Wilson gets terminal cancer and in order to save\nhis life he agrees to undergo an experiment that will give him the\npower to heal. However Ajax, the man that turn people into mutants and\nsometimes just kill them, can't be trusted. And Ajax, who is the\nvillain is played by the awful Ed Skrein from the awful reboot of\nTransporter. Ajax tortures Wade and the lab explodes (I can't remember\nwhy) and Wade has become scarred and takes the new identity as\nDeadpool. He starts to kill a lot of people looking for Ajax. But even\nthough the movie is rated R, some scenes where he tortures badguys are\nactually not shown. Ajax in a desperate attempt to stop Wade kidnaps\nWades boney girlfriend and Wade has to get help from the two most\nannoying X-men characters I have ever seen. Some lesbian looking\nteenage girl with a shaved head and a cgi-Russian guy made out of\nmetal.<br><br>The violence is awesome and a welcome change from the bloodless Marvel\nviolence. However all the violence can be seen in the red band trailer\nand the rest is crap. So if you've seen the trailer, I recommend not\nwatching the movie as you will be really disappointed.<br><br>Bringing X-men into the movie is annoying as hell as I've always hated\nthe X-men. And Wade talking to the camera gets really annoying after a\nwhile.<br><br>On top of that the action itself is disappointing as this is clearly a\nlow budget movie.<br><br>Avoid this and watch the first Kickass movie (not the second one!!!) if\nyou like violent superhero movies.\n"},
{"review": "\nDeadpool is a hugely entertaining motion picture. I admit that the\ncomic universe is not something I'm completely familiar with and I knew\nnothing about the character before I saw the movie but that didn't\nmatter because plain and simple, I can tell you it's beyond awesome.\nEven the opening credits are pretty darn brilliant, great action and\nlots of humor, with some meta-laugh out loud moments, it kept me hooked\nright up to the end. Even the scene after the end of the credits is\nhilarious. <br><br>Behind the humor, this movie is a dark, violent flick with a sadistic\nheart. If your looking for a great family movie to see, look somewhere\nelse because Deadpool is not for kids. It's about a ex-special forces\nsoldier who is now an underworld mercenary. He finds a screwed-up\ngirlfriend and they have lots of kinky sex. When he discovers he has\ncancer, he accepts a shady offer from a weirdo who says he can help.<br><br>The movie is all about Ryan Reynolds. It stands or falls on him.\nLuckily for us, this was the role that Ryan Reynolds was born to play,\nhe nailed it. Can't wait for the sequel.\n"},
{"review": "\nDon't expect this movie to be like spiderman or batman !!! This is a\nhumour film !!! A complete entertainer !!! Laughs guaranteed !!!\nDialogs were so funny !!! Story is simple but was carried out good !!!\nThe taxi driver character was cool !!! A simple movie but executed well\n!!! I like it that this is not a usual super hero film where things go\nserious and with terrifying villains !!! A new type of superhero film\n!!! Overall , a great entertainer !!! Just watch it without any\nexpectations !!! I have now started finding better movies through\nwww.flickstree.com . It not only suggests great movies to watch , it\nalso tells where you can watch the movie online.. Highly recommended.\n"},
{"review": "\nI'll admit. I may be biased because I can NOT stand Ryan Reynolds. I\ndon't know who thought that he would ever be a good actor. There are a\nnumber of \"actors\" who have no sense of characterization. They are the\nsame in every single movie. RR is always dishing out the same poorly\ndelivered attempt at dead-pan sarcasm. One film....OK. Two films...get\na clue. Third film and casting personnel should be fired for even\nconsidering one-trick-pony \"talent.\" I should have known better going\ninto this, but I wanted to give it a fair shot. As expected, his\n\"acting\" got old in the first five minutes.<br><br>As for the movie itself.... The plot was acceptable. I like the idea of\na rogue lab. However, the storytelling is completely disrupted by the\nconstant stream of flashback sequences. It's as if they did it\nintentionally in an attempt to set a Guinness record. RR's narration\nand incessant \"breaking the 4th wall\" is just annoying. And the subplot\nof bringing in the two X Men is too weak to even be considered\n\"contrived.\" I have no desire to revisit this title.\n"},
{"review": "\nIf you are easily offended than you are probably one of the people that\nhave said this is the worst Marvel movie ever. If you don't actually\nknow anything about Deadpool or even Marvel in general, then you are\nprobably one of the people that gave this movie a one star rating. If\nyour sense of humor is lacking then you won't enjoy this movie. <br><br>I see so many people talking about how Deadpool acted like a 13 year\nold throughout the entire movie. But what is funny to me is the fact\nthat in today's society, 13 year olds are the quickest to be offended\nby everything. And every negative review brought up the use of the \"f\nword\" in this movie. Seriously people, do you not know what an R rating\nis? Have you not ever seen a Tarantino movie? <br><br>In my opinion, if you didn't like this movie, then you know nothing\nabout Deadpool or you decided to hate it before watching it because it\nwas too popular. It's a great movie. Can't think of one flaw.<br><br>Bottom line is it's just a hilarious and action packed movie and Ryan\nReynolds is great. There are so many \"Marvel\" fans out there now. Most\nof which have never picked up a comic book. Not everything out there\nMarvel related is Captain America and Iron Man. And in case you missed\nit Deadpool is not a hero. Do more research on what you're about to be\nwatching because if you're a cringer, you should just stick to the\ncookie-cutter comic book characters. Go get offended by something\nthat's actually offensive...\n"},
{"review": "\ni think dead pool is a great movie and i would rate it 10 out of 10. i\nsay this because it has tons of humorous action in this film, but also\nit shows you what different acts people can make towards trying to make\nits viewers laugh.Even though it may not be for younger audiences, it\nshows you how life can turn from very good... to crap, but just because\nsome medical things happen, doesn't stop you from trying to change the\nworld before your gone.I think that if you enjoy comic book humor, and\nkind of dirty minded films, this is exactly for someone like you. I\nEnjoy it myself because it is kind of perverted yes, but it has so much\nhumor, and it shows you how bad life can really be for some people.\nthese are some reasons of why i would rate Deadpool a 10 out of 10\nmovie.\n"},
{"review": "\nI'm not a fan of comic books but I do like some of the films that are\nproduced from them like Iron Man, Captain America, and X-Men. I've\nnever heard of \"Deadpool until I started seeing the trailers for the\nfilm. I didn't even know it was a Marvel comic. After seeing the\ntrailer for this film and the 8.5 rating it got on IMDb I thought I was\ngoing to see one of those films I could kick back and watch the good\nparts over and over again. That wasn't the case. \"Deadpool\" wasn't bad\nbut it wasn't as good as I hoped it would be. In the opening scene the\naction was intense and riveting. I was hoping it remained like that all\nthroughout the film. Between the decent action scenes Deadpool (Ryan\nReynolds) was just saying a lot of sarcastic and witty remarks, which\nwas good for the film because I guess that's Deadpool's (Ryan Reynolds)\npersonality, but it should have had some more hard hitting action to\naccompany the sarcastic and witty remarks. Unlike other Marvel comic\nfilms \"Deadpool\" isn't for the whole family. It's crude, raunchy,\nviolent, and full of sexual innuendos. So don't bring the kids to see\nthis one. As I said before it wasn't as good as I hoped it would be,\ncomparing it to other Marvel comic films, but I'm not regretting the\nfact that I saw it either.\n"},
{"review": "\nI was honestly expecting the worst with this. I found the trailers\nsupremely annoying and a whole movie like that was going to drive me up\nthe wall. It still kind of is, but I was able to get into it. The story\nis as generic as they come, but hey, it's a small, intimate story that\ndoesn't try to be anything more than it is. I can appreciate that.<br><br>It's funny how this is structured. It really doesn't need to do the\nwhole flashback thing, because they catch up to that point midway\nthrough rather than at the end, but they wanted to start with an action\nscene to grab you. I suppose it works.<br><br>I'm finding it difficult to really write down what I think of this.\nIt's certainly smugly satisfied with itself, but it's also charming in\na weird way regarding the love story. About 10% of the jokes and\nreferences are worth a smirk, but when there's a handful of jokes or\nreferences every minute, that's a pretty high number of smirks, even a\nfew laughs.<br><br>But I can't fully get on board with this at the end. It's too standard\nand basic. The simplicity of the story can be boring. Pointing out\nflaws in other superhero movies doesn't negate the fact that your own\nmovie succumbs to those flaws in an even more egregious fashion.<br><br>I do need to give credit to Reynolds and the production team. They\ndeserve props for bringing this to the screen and pleasing the die-\nhard fans.\n"},
{"review": "\nI think Deadpool didn't choose what sort of film it would like to be.\nIt lacks enthusiasm and sounds moree like a TV SERIES allowing me to\ncut in between and watch. it the next day. 4 weeks in a row in box\noffice weekend rates made me expect greatness. The love story that\nfaced unreal problems, the non-scary hunting process, the 'never\nhappening' sacrifices he made, the characters who lacked identities,\n... and so on, was lame. I could say it was a from a high school kid's\nimagination who is looking for the love of his life. The story says\n'..after he had accelerated healing power, he decided to hunt who man\nwho destroyed his life'. 'Healing power' was not over whelming and\nsimply 'hunting' the man who made me look like the worst thing on earth\nwasn't a great idea. After all, it was a successful business. 'A' for\nthe talent of Ryan Reynolds and his sense of humor.\n"},
{"review": "\nA highly enjoyable balls to the wall comedy action flick that knows\nexactly what it is and never takes itself too seriously. For me Marvel\ncomics has created many of the best and most watchable blockbusters on\nthe market right now and this does not disappoint. <br><br>Extremely sarcastic and willing to poke fun at other Marvel characters\nand even the actors who play them which makes for a superb look at\ndeadpool and his anti-hero mentality. Ryan Reynolds is absolutely\nperfect for this role and simply no other actor could play this part\nwith such ease and confidence the way Ryan does. <br><br>Jokes land and are laugh out loud, the action sequences are excellently\ndone with comedy even thrown in and the story keeps you thoroughly\nentertained throughout.<br><br>Overall a completely unique and refreshing look at the 'hero' genre and\na mixture of original comedy, action and good old bad ass fun.\n"},
{"review": "\nWe saw this at home on DVD from our public library. I am not familiar\nwith the source comic book. The movie is rated R for a good reason, the\nmain character has a very filthy potty mouth, but it fits his\ncharacter. Plus a few shots of bare-chested women.<br><br>This is an origin story. Ryan Reynolds is Wade, always a bit of a loose\ncanon. At his favorite bar is a list on a chalkboard, a \"dead pool\",\npredicting who will be the next to get killed. <br><br>Wade is with his girlfriend when he collapses, at the clinic his doctor\ninforms him he has cancer, but in three places he doesn't need - his\nbrain, his lungs, and his prostate.<br><br>He meets a man who says he can \"fix\" him, Wade has no choice and\nsubmits. He ends up being tortured in various ways, it is an attempt to\nmake the hidden beast in him come out. When he finally escapes he is\ndisfigured but has gained some pretty impressive strength and fighting\nskills, plus his cancer is gone. He can't go openly as Wade anymore, so\ntakes the name 'Deadpool.'<br><br>His nemesis is Ed Skrein as Ajax, and his girlfriend is Morena Baccarin\nas Vanessa. Can he defeat Ajax and get his girl back?<br><br>The action is impressive, including the opening ultra slo-mo shot of\nDeadpool and others in a roll-over car accident on a bridge. And, where\nappropriate the deep bass worked over my subwoofer and rattled the\nwalls.<br><br>Overall a very entertaining movie, for those who can get past the\nconstant filthy language. Reynolds is very good in what amounts to a\ndark comedy.\n"},
{"review": "\nlet's say what it isn't...<br><br>1. intelligent 2. articulate 3. moving 4. rib tickling funny 5.\nhilarious 6. deep and meaningful 7. philosophical 8. the meaning of\nlife 9. the meaning of anything<br><br>it is a...<br><br>1. comic book of a 'superhero' ? antihero ? misogynist 2. written for\nthose that want a laugh 3. an escape from any reality 4. anything\nserious 5. to avoid a blizzard outside 6. totally away from any\n'serious' comic scifi such as x-men. 7. a bit tedious after a while.<br><br>personally i watched 3/4 of it and gave up. it's juvenile humour\ndressed up in a veneer of adult satire. I found it boring and gave up.<br><br>you may love it. it's like marmite.\n"},
{"review": "\nA wise-cracking gun for hire finds love in the underworld, but cancer\nrobs him of his bliss - until he strikes a devilish bargain with a\ngene-mutating doctor.<br><br>Stuffed with gags about the movie process, gets tiring, and a couple of\nsuperhero characters are thrown in because ... the IP rights were\ngranted by the studio. Don't have to look far for the problem: written\nand produced by the same guys responsible for the overworked wordfest\nthat was Zombieland. And again they chose a whining, self-satisfied\nlead actor.<br><br>The intro is interesting, action pacy, but the formula keeps repeating\nuntil the editing runs out of imagination and a giant sigh of boredom\nis released at about the hour mark.<br><br>Music is standard, with the worrying fact that a teen movie keeps\nharping back to stuff from 30 years ago. And the unfunniest post\ncredits gag ever. Yes, you will gag.<br><br>Surprised they didn't include a midget in a clown suit and an ugly pet.\nPlus the boob cover up was pure, \"How much can't we get away with -\nhehehe!\" <br><br>Overall: Lots of energy, but tiresome. Like Saturday Night Live.\n"},
{"review": "\nThis was super fun. Made of low budget and they said that in the movie\ntoo. You have to have a little idea of other X-Men movies prior to\nwatching it. The jokes were awesome. The trademark Marvel post-credit\nis even better. If you want to have a good laugh then this movie is for\nyou. Ryan has done well after the debacle of his previous super-hero\nmovie Green Lantern. Oh, there is a joke on this too. You can find if\nyou listen every dialog carefully. You might not have seen an anti-hero\nwith such sense of humor. Ryan is the perfect cast for the role. His\ncomic timings are great. You might get disappointed with the action\nscenes as those were not as par with other X-Men movies. But he is\nDeadpool and he fights on his own unique way. The content is for\nadults, so watch it with friends and colleagues; not with your family\nunless you have a cool family :P\n"},
{"review": "\nDeadpool is an amazing film. In fact is my favourite movie along with\nThe Terminator and Beverly Hills Cop.<br><br>This is a superhero movie. But not any old superhero movie, it is a\nfull on comedy/action. And this is why it is so great. For example, in\none bit he cuts off his own hand (it grows back due to his healing\nabilities), normally this would be disgusting (which it kinda is), but\nthis time it's HILARIOUS! Also the main character (Deadpool) always\nbreaks the fourth-wall. This just adds even more comedy to the film.<br><br>The plot is pretty good, I'm not gonna spoil anything. It's not amazing\nlike in The Matrix or The Da Vinci Code but it's a fun idea of Deadpool\ntrying to get his body returned to normal (because the main villain,\nAjax/Francis, kinda f*cked it up.<br><br>Overall, the characters are all hilarious, the action is bloody and\nbrutal and the film is rude AF.<br><br>A definite 10/10 or 5 stars\n"},
{"review": "\nI was hoping to see a really good comedy that has a superhero. In other\nwords, I was hoping for something as good as the first quarter of\nHancock. Instead, I saw an X-men movie in which the comedy bits were\nwritten by oversexed undergraduates. In other words, it was both boring\nand inappropriate. <br><br>To fill the ten lines requirement, without giving spoilers, I'm going\nto say that the main characters behave like people who have just broken\nonto the bar scene. The movie does a decent job at introducing them,\nbut it's just that they aren't interesting enough to make this comedy\nfun. The other characters are much worse. Actually, nothing much could\nbe said about them because they are so forgettable they could have been\nreplaced with stuffed animals.\n"},
{"review": "\nKing ace movie, I watched it again... twice...<br><br>This review is a rush job, I am waiting for the VHS to rewind so I can\nview movie again.<br><br>Much action and comedy, kept me entertained.<br><br>My brain liked it, my scoring 9 / 10 stars proves that.<br><br>Spoiler - no guns or cars were harmed in the making of this film.<br><br>I did this review just so my profile can be completed.<br><br>Costumes were outstanding.<br><br>Tops intro, that in itself could be movie.<br><br>Marvell fans will enjoy.\n"},
{"review": "\nDeadpool was a long time coming with all these talks of a solo movie,\nReynolds promoting himself to get the role, and the disaster that was\nX-Men Origins: Wolverine. Add the leaked test footage and it seemed to\nbe close to becoming reality. Now we have Deadpool which goes for a\ncomedic spoof of superhero films while maintaining its own superhero\nfilm. The result of all the wait was an entertaining movie with a great\nturn from Ryan Reynolds despite the hype blossoming a film a bit more\nthan it deserves in my opinion.<br><br>Good: Ryan Reynolds is the glue that holds this movie together. He is\nfunny and goes all in for the character of Deadpool. He delivers the\nmeta humor and is a great lead. His relationship with Morena Baccarin\nis funny and provides enough character development for both. The humor\nis of the fourth wall breaking variety and it works for the most art.\nThere are plenty of clever jabs at superhero movies and the business\nbehind making them. The action is also pretty cool.<br><br>Bad: The main drawback is just the story is nothing special. Despite a\ngreat turn from Reynolds and the humor, there is nothing here that can\nbe seen as that special. The basic story is the typical hero has to\nsave the girl and while it was done to poke fun at it, it is still the\nsame plot line and it hurts the movie a bit.<br><br>Overall, it is a really fun movie that does give the superhero genre a\nmuch needed jolt although it doesn't cross over to great for me.\n"},
{"review": "\nWhen a friend of mine first invited me to see Deadpool my expectations\nwere quite low: I had known nothing about Deadpool and expected to see\na classical super hero movie suitable for all ages which I usually\ndon't enjoy. Little did I know Deadpool was a full blown comedy super\nhero movie made for mature audiences.<br><br>Watching Deadpool 4DX was amazing experience. A scene where Deadpool\njumps from bridge into a car was one of the most entertaining movie\nexperience I've ever had! If only the rest of the movie was this\ngood... if you're still somehow able to see it 4DX, don't miss the\nchance.<br><br>Deadpol is very bloody with a lot of violence and mayhem. Language used\nis too obscene for my taste. Many conversations and scenes are very\nchildish. The whole movie is very immature. Deadpool is going to\nstrongly entertain younger audiences. So yes, Deadpool is pretty bold\nand quaint experiment: you have brutal violence combined with childish\nhumor. For it's authors audacity I give it a seven. Objectively, it's\nmore of a six.<br><br>Still, Deadpool's delivery is pretty homogeneous. All the violence and\nmayhem fit nicely within the context fostered by Deadpool's character.\nRyan Reynolds is the guy! He delivered much, much better performance\nthan in Self/less. Morena Baccarin played Vanessa, Deadpool's\ngirlfriend. And when I say she's Deadpool's girlfriend, I mean she IS\nDeadpool's girlfriend. If you've seen the movie you know what I mean.\nLet me mention that soundtrack plays a somewhat important role\n(Deadpool loves good music!) - producers picked good hits which\ncontribute to milieu. Wham! <br><br>If you're in for some non sensible crude humor and brutal violence,\nyou'll surely have fun. Just don't forget not to bring your kids with\nyou! \"Witness the beginning of a happy ending\".\n"},
{"review": "\nNot for the weak of heart and definitely not for the sound of mind.\nThis movie is basically the ultimate combination of humor and violence\nthat every movie should be.<br><br>Most people who dislike this movie have a more tamed sense of humor,\nbut that's okay. Leave it to people like me to enjoy it. Every now and\nthen, we get tired of these conservative movies. Deadpool stays true to\nits comic roots. It's a great treat of ardent Marvel/Deadpool fans. I\nwould urge some of the negative reviewers to reconsider. However, to\nnew fans, read the comic books before you watch this movie. You'll\nunderstand the humor much better to appreciate the movie.\n"},
{"review": "\nMy teenage son encouraged me to watch Deadpool - theoretically an R-\nrated love story. Wow, what a different kind of film. Self-deprecating,\nwitty, different, funny, all these apply to Deadpool. I guess you could\nloosely call it a love story. There are some sex scenes, and lots lots\nof blood and violence. <br><br>The story constantly pokes fun at Marvel, Ryan, previous flics, future\nfilms, but mostly continually at itself. This self-humorous approach,\nroughly similar to Ant-Man, hits the mark. Deadpool is a pretty cool,\ninnovative story. <br><br>Ryan plays the role of Wade who eventually becomes Deadpool. The story\npokes fun at him over and over, especially around his love for sex and\nhis lover. The editor had a ball with stop action film sequences where\nDeadpool stops to tell us what is going to happen, pulling himself out\nof the scene, then diving back in. It works.<br><br>The movie does slow down a bit in the middle - it was impossible to\nkeep up the non-stop level of witty repartee that introduces the film,\nstarting with the introductory credits - just watch - you'll\nunderstand.<br><br>The end was somewhat predictable, good guy against bad guy. There also\nis the tie-in with X-men, so I expect that will continue. I understand\nthere's already a Deadpool 2 en route, so buckle up for more fun.<br><br>I loved Deadpool, and you will too, if you don't mind the\nblood/violence. Enjoy.\n"},
{"review": "\nyeah, deadpool, you think he is an anarcho punk with lots of cool\njokes. well think again. the story in the film is quite lame. hero gets\nhurt by villain. hero seeks revenge. villain takes the girlfriend of\nthe hero. hero saves her and the live prosper for the rest of their\nlives. this could come from Disney, so conservative is the plot. and\nthe most funny jokes you've already seen in the trailer. and when the\nhero will heal himself every time, there is no place for suspense nor\ndrama. the mediocre rap music cant help it either<br><br>not as funny as \"super\" or \"kick ass\", and highly overrated. no good\nsidekicks or villains, boring and slow in the middle, expected much\nmore.\n"},
{"review": "\nThis movie is definitely for the 20's crowd. It is a comic book story\nwhich appeals to the young, but the lewd scenes and language is not for\nteenagers (it's rated R) and definitely not for the morally faint, and\nthe body count gore is not for the faint-hearted. I gave it a 7 because\nit is overall fun, funny, and entertaining; but the plot is simple\nrevenge, with a side note of shallow romance, with a few snide remarks\nin psychological therapy. It's an experiment in the anti-hero where the\nprotagonist character traits are worse than ever, looking villainous. A\nfew scenes don't make sense, such as what the villain was trying to\naccomplish, how the hero escaped the rebar, and a few others, that left\nme wondering how to fill in the blanks. Finally, some lame explanations\nwere made for a few puzzling scenes.\n"},
{"review": "\nI don't know what genre this movie is. It may be comedy. It may be\naction. It is hard to say because this movie tries to be a little bit\nof both. But the humor in this movie is toilet humor. There is simply\ntoo much of it. When I watched the action scenes, the attempt at humor\nis very distracting. So first, yall made a movie that is not funny, and\nthen you have diluted action scenes. It's really bad, there is too much\ndistraction in the movie. Do it like the Avengers with short funny\nlines after the action scenes. But I think this movie is better than\nBatman vs Superman because at least something happened in this movie.\nIt's just that they try to insert toilet humor each chance they get.\nWatch the movie and you'll see what I mean. It is just not funny!\n"},
{"review": "\nThe scale here is 1-10, that should mean that a 10 should have almost\neverything you would want in a movie and a 1 virtually nothing to\noffer. So how can people score this 1 or 10?<br><br>Yes this movie is \"bad\" both in the good \"cool\" way and in the bad\n\"immoral\" kind of way. They action sequences are great, its a non-stop\naction-thrill with a lot of blood, gore, violence, bad-language,\nnudity, toilet humour and virtually everything a hate-loving psychopath\ncould want. Great! It was fun and entertaining at times and if you\nnever get tired of constant violence, gore and cheesy humour and have\nnothing better to live for. Then I am sure you would love this movie,\nwhich takes movies like Sin-City, Kill Bill and Spawn and upgrades it,\nand makes super-hero movies like Spider-man and Bat-man look like a\nvegan dinner. So whats not to love?<br><br>A lot actually. To anyone who likes to eat anything other than extra\nspicy Bean Burritoes for breakfast, lunch and dinner the constant\nrepeat of same lame childish jokes combined with endless of pointless\nviolence gets pretty boring after awhile. There is virtually nothing\nnew or original for this movie to offer which has not been done many\ntimes before. Its definitely not a movie to with kids or anyone with a\nsensitivity level above that of a street thug, and I would not\nrecommend if for that reason. <br><br>Its the kind of movie which not only has the \"hero\" act and kill before\nthinking or asking questions, but it seems the movie makers and\neveryone involved with the movie did too. On a positive its kind of\nwhat you would expect looking at the trailer and don't disappoint in\nthat, but on the negative it doesn't offer anything more.<br><br>A well-done non-stop action movies for those who don't wish to think,\nfeel, create, change anything for the better or be surprised. For\nanyone else, this will likely seem like a Waste of time, where there\nare many more movies out there to chill to with far more to offer.\n"},
{"review": "\n\"Deadpool\" is a tiresomely unfunny stab at making both a superhero\nmovie and a parody of superhero movies that succeeds at neither. For a\nhuge budget superhero flick, the plot and scenarios are just way too\nuninspired and boring. It has a pretty good opening action scene, but\nafter that it has absolutely nothing you won't have seen before in any\nother recent comic book movie. For a parody, it isn't funny, and all\nthe nudge nudge wink wink moments get old in the first scene, and then\ncontinue all the way up to the inevitable after-credits-scene, which is\njust as unfunny as everything we've seen before it.<br><br>The movie seems to think that name dropping everything pop-culture\nrelated is funny by default. You leave, probably unable to remember an\nactual gag, but maybe some of the relentless name dropping is still\nwith you, by virtue of the law of averages. Reynolds, as Deadpool, even\nname-drops himself at one point, and not even that got a laugh.\n"},
{"review": "\nFirst of all I understand that almost everyone loves this movie. With\nthat being said, I personally was very disappointed and do not\nunderstand the hype. I had been excited for years waiting for this\nmovie and it was not what i had hoped for. The story (or what the\nwriters pretend was a story) was terrible. I was honestly so\nuninterested in the protagonists that I did not care who won. I know\nthat deadpool is a funny character, but i was still hoping for grounded\nstoryline. The plot was all over the place and not intriguing\nwhatsoever. Some of the jokes were mildly funny; however, I found the\nmajority of the jokes too immature and frantic to be of any real\ncomedic value. They felt very forced. Furthermore, the humor was\noverall too childish and crass. I got tired of most of the jokes very\nquickly. Based on how this movie turned out, I would have preferred a\nPg-13 version similar to other x-men movies. It is a shame to me that\nthe worst X-men movie (In my opinion) became the most popular and\nhighest grossing.\n"},
{"review": "\nWow this movie really shows what Hollywood celebrity, a great marketing\nmachine and money can achieve. This was the saddest excuse for a movie\nthat I have had the misfortune of watching in a while.What a childish\nload of drivel. After all the hype it was a huge disappointment. There\nwas nothing really funny about it - the best I can say is there were\none or two mildly amusing moments and a couple of semi-decent action\nscenes but for the most part I found it more irritating than anything\nelse. I can see what they were going for but it fell way short of the\ntarget.<br><br>It amazes me that this would appeal to the masses at all. It is\nbasically an indictment of and an insult to viewers intelligence\n"},
{"review": "\nMaybe it's the fact that I never read any of the Deadpool comics.Or\nthat I'm simply too old, to find D*ck and f*rt jokes funny. Whatever it\nis,deadpool just don't do it for me.<br><br>The fact that it works to break the fourth wall in comics,doesn't mean\nit work well translated to the big screen. I found the characters\nboring and unimaginative. But since the die-hard fans claim the movie\nis very close to the comics, I'll take their word for it.And guess I\nwon't like the comic either. But I think deadpool would've worked\nbetter as a cartoon. They portray colossus as the stereotype Russian\nfrom the cold war,but to give it some positive words. Some of the\nfights scenes was pretty good,though a bit too much wire stunts for my\nliking.<br><br>All in all.This may be a really good movie for some,but for me it was\njust boring\n"},
{"review": "\nI'm so glad to see that there are actually other people on the planet\nwho think this film was terrible. Everyone is losing their minds over\nthe film on social media billing it as the best film they've ever seen\never. I think its got something to do with 'breaking the fourth wall'\n(something Malcolm in the Middle did expertly), making jokes only funny\nin a 13 year-old boy's changing rooms, unnecessary graphic violence and\nnudity which is absolutely unnecessary... that is until you realise\nthat this film has been written by/for people who still think farts are\nfunny. The humour in this film isn't even as sophisticated as White\nChicks or Scary Movie. It's not a parody either. As an example, the guy\nbehind the bar delivers his lines like he's reading them for the first\ntime. No comic timing, no life, no urgency. That may be his character\nbut whatever comedy is supposed to be in his dialogue goes missing\nimmediately. They also take jokes too far. Sometimes, just leading a\nviewer into the realm of a joke is fine, leave them there, let them get\nit themselves - not Deadpool. It's like they knew people with the sense\nof humour of a 9 year old would be relishing every pointlessly gory\nbanal second and they not only explain the joke, but they keep talking\na good minute after the joke has been, gone and not been laughed at;\nstill telling the same joke. <br><br>In short - no, this is not the best film you've ever seen ever. For\nthat (in a comic book adaptation), go watch The Dark Knight or The\nAvengers. This film's storyline, jokes and content have all been either\nwritten by or for adolescent boys who still think 'boobies' are things\nto snigger behind your hand at at the back of a biology lesson.\nEveryone involved in this film needs to grow up and so do the people\nleaving 10 star reviews. I'm sure if they watched Postman Pat the movie\nand he swore, they'd give that 10 stars too.\n"},
{"review": "\nPoor childish jokes, hundreds of sexual assault scenes where it was\nsupposed to be empowering and quite frankly idiotic levels of feminist\nnonsense where you knew the female villains were going to beat up the\nmale ones regardless of realism.<br><br>Its one of those films that if you are 11 years old you might enjoy but\nconsidering the rest of the content you would never let your 11 year\nold watch it. Thus it massively missed its mark.<br><br>Punching people in the groin is not funny, it stopped being funny back\nin 1990 when I was 11 when will Hollywood realise that. And if you are\ngoing to do things like that at least have some gender balance and have\nit happen to women as well.\n"},
{"review": "\nThe first question i want to give to everyone here: how this got more,\nthan Three colors, Grand Hotel Budapest or more than English Patient?\nHere is NO any director's work, here is NO actor play it is just\nextremely boring and defective movie for kids, not for an adult person.<br><br>I can get that many people like comics films, OK, but so huge amount of\ntoilet humor, so huge amount of vulgar in bad sense of this word, it is\nnot really comics film, it is just some kind of mix cheap comedy,\nthriller and a superhero film. <br><br>I literally felt myself ashamed during watching this, like someone can\nsee me watching this and get bad opinion about me.<br><br>If my review will be publicated, person who a reading this and deciding\nto watch or no, please, spend you're time during watching one of those\nfilms, that i listed before, not watching this.\n"},
{"review": "\nI'm seriously considering ranking this movie a 1 out of 10, just\nbecause how of pornographic it seemed. Honestly, the movie is very fun\nand could have been a great time for everyone if the producers of the\nfilm didn't decide to cater to the manchild virgins out there. Without\nall the raunchy crap, I would rank the movie around an 8 or 9. A few\npeople did walk out with their children during the film for\nunderstandable reasons and that is what pisses me off the most. The\npeople who made this movie know Deadpool inside and out so it stands to\nreason that they should know what demographic reads Deadpool comics.\nJust thinking about it pisses me off. F*&amp;k it. I'm giving this film a\none out of ten. The filmmakers should know better. There was literally\nno reason why they had to put out a \"hard R\" film. They could have even\nmade the movie PG-13 if they wanted. I don't mind a graphic movie but I\ndo mind a graphic movie targeted at children. If the sequel does the\nsame thing, I'm not going to spend a penny on it.\n"},
{"review": "\nThe level of content is for the first graders, except peppered with\nobscenities and curse words all over, this is what makes it rated R. I\nguess that's the only difference these days between the mature audience\nand children. I can't understand how in the world people would rate it\n10 with an average of 8+. I can't rely on average rating as a measure\nof movie quality anymore. Seriously, this is the worst experience in a\nlong long time. Spider-man is a much better movie, although I am not\nfond of childish superhero movies either, but at least they would give\nyou some positive charge, improve your mood. This one teaches you\nnothing. waste of time and money.\n"},
{"review": "\nWe live in a time where super hero movies are all the rage. Who doesn't\nlove a good super hero throw down, cool origin stories, and awesome\nvillains? While decent hero flicks are easy enough to find,\noccasionally a masterpiece, like \"The Dark Knight\", will come along and\nin the process wow the critics and audiences alike.<br><br>And then we get Deadpool. Where to start with this one? To give it some\ncomparison, it makes \"Batman and Robin\" look like an Academy\nAward-winner by comparison. How is that? Quite simply put, the movie is\nterrible in every sense of the word.<br><br>Deadpool is untrue to its source material and to the very character\nhimself. The character is known for his violence and humor throughout\nhis comic book, TV show, and video game appearances. The filmmakers, in\ntheir apparent efforts to make the character more \"edgy\" and appeal\nmore to adults, have stripped him of this, instead replacing the comedy\nand fun with crude dialogue, sex, sex, more sex, and more foul words\nthan possibly all of Eminem and Lil Wayne's albums combined, and all of\nthis without any of the substance that have made Wade Wilson's\nadventures and misadventures alike over the years so memorable,\nexciting, and laugh-out-loud funny. <br><br>No wit, and no soul. It insults the intelligence of its audience, and\nthen expects them to pay. We've come a long way in terms of the quality\nof super hero films; to call this a step back could potentially be the\nbiggest understatement of the year.<br><br>For those who have been waiting for a good Deadpool film, this\nunfortunately is not it. Perhaps the best on-screen appearance to- date\ncan be found in the animated short \"Hulk v.s. Wolverine\", but for the\ntime being we're still going to have to wait for our favorite \"Merc\nwith the Mouth\" to get the big-screen sensation that he deserves.\n"},
{"review": "\ni expected an epic out of this but i rather got boring and juvenile\nstory.<br><br>This movie is full of unparliamentary dialougues and nothing inspiring\nabout.<br><br>Is this what we give to our friends and family to watch ? btw ryan\nrenolds did excellent job in the movie.<br><br>i didn't get why wolverine was in the movie<br><br>is he there to get kicked by deadpool<br><br>The film's biggest weakness, if it has one, is in its supporting\ncharacters \u0097 there's just not a lot for them to do. Deadpool's fellow\nsuperpowered beings \u0097 Colossus (Stefan Kapicic), Negasonic Teenage\nWarhead (Brianna Hildebrand), and Angel Dust (Gina Carano) \u0097 mostly\njust stay out of his way, though Colossus and Negasonic each have their\nmoments. T.J. Miller is effective as Deadpool/Wade Wilson's BFF Weasel,\nbut he feels like he was just ported over from HBO's Silicon Valley,\nwhere he plays a startup bro. Ajax, the movie's main villain, is\nsinister (and good-looking), but his mutant ability \u0097 not being able to\nfeel pain \u0097 doesn't make him feel like much of a threat.\n"},
{"review": "\nToo overrated, i think the jokes that are included in the movie are\ninteresting, but to be honest the plot is kinda boring and made me\nbored while i'm watching this.<br><br>for me the plot is the vital point of movies, if this movie were more\nfocused on the plot than the jokes, i think it'll be better and more\nexciting. This movie was like bunch of jokes with some plot, not a plot\nfilled with bunch of jokes. i'd give this movie high rating if they\nbuilt more plot.<br><br>this movie are overrated and i don't want to watch a sequel as boring\nas this\n"},
{"review": "\nWhere do I start. This movie seems to be scripted by 3 17year old boys.\nThe Gay sex and masturbation inuendo as boring. It was bad from start\nto finish. Here is the review for those you fine tactless sex seems\nboring like myself. I'm not saying there should not be sex in movies,\nbut this just makes the whole thing a farse. it was awful, no wonder it\nhas a 16 rating. Don't bother wasting your money, just wait for it to\nappear in Nexflix in 6 months. It was a failed xmen movie or a paridy\non the xmen? if they want to show playboy in the cinema they should\njust say so and I would avoid it. Apart from the failed script, there\nis the failed actors in the movie (in my opinion). There are no\nredeeming features to the movie. I'm sure some will love it, I didn't.\n"},
{"review": "\nThe film is made out of Ryan Reynolds, throwing lame jokes to the\ncamera. In between there are bullets and knifes. No surprises. No\nideas. The story is simple and silly and boring. Man sleeps with woman\nlong in different scenes (Teens hello! Better watch porn, there are\nmore details!) Man go's to basement to become special. (Teens like to\nbe special) Man becomes special and kills all bad guys around him. THE\nEND<br><br>The jokes are not only lame, they are old. For example the joke with\nthe red shirt and brown trousers I heard from my grandpa.<br><br>Don't waste your time with this film. Marvell tries to squeeze out last\ncents out of the theme. Bad films will follow.\n"},
{"review": "\nOK so \"Deadpool\" is an assassin at the start, he meets a disgusting\nprostitute and falls in love of course, over details of them both being\nmolested as kids! There's a scene where the prostitute grabs a man's\nballs and squeezes them- to show how strong and empowered this cheap ho\nis.<br><br>Guy comes down with cancer, he does nothing to help himself but drink\nalcohol and avoid treatments. His reason: \"dealing with my cancer will\nupset the former prostitute\". Disposable men, don't want to upset that\nlow value female!! Guy joins a scheme to cure his cancer finally and\ngets tortured to activate his mutant gene, which unfortunately makes\nhim unkillable. He escapes and plots revenge, badly. Later he\nencourages a taxi guy to kill the guy his girlfriend is interested in.\nHow cute! Well he screws up his revenge, and his girlfriend prostitute\ngets kidnapped, and in his final revenge scene, SHE SAVES HIM. This\nliberal garbage HAS TO STOP. Iron Man 2 or 3, Pepper Pots saves Tony\nStark, Batman 3, catwoman, the fem idiot, fighting in high heels, with\nNO back story, saves batman. The latest Mad Max, Max is a pathetic side\ncharacter whose only value is saving women like the \"badass\" Furiosa.<br><br>And thats when I switched off the movie. I will no longer tolerate this\n\"gender don't matter, yet super men desperately need women to save\nthem\" GARBAGE.\n"},
{"review": "\nThis is a great action comedy.<br><br>The action scenes are great and also very funny. The 4th wall breaks\nare amazing, just like you would expect from Deadpool. <br><br>I never read or watch anything about Deadpool before, but after\nwatching this movie I learned the most important things about him in a\nfunny and exciting way.<br><br>The movie begins off great. The first action scene is well made and it\nhas some good jokes in it. Deadpool is able to make you laugh while you\nare caught up in the action and actually paying a lot of attention to\nthe movie.\n"},
{"review": "\nDeadpool is a classic. One of the highest grossing movies ever, it will\nbe one for the ages. Telling the origin story of Wade W. Wilson, a\nmercenary turned anti-hero, who uses his raunchy and off-color humor\nalong with his fourth-wall breaking.If there's an R-Rated movie that's\nhilarious and action packed than you should definitely watch it.It's\nalso sort-off a love story too because Deadpool has to safe his fiancé,\nVanessa. From the evil scientist Francis \"Ajax\", who tortured Wade\nWilson in the Weapon X Program to cure is Cancer. Wade gets rid of his\nCancer but he becomes horribly disfigured causing him to wear the red\ncostume, and dub the name Deadpool.\n"},
{"review": "\nGreat movie and plot, a lot of fun to watch. I have to admit its funny\nto read the other reviews on here about how vulgar this movie is. Of\ncourse it is ! that's what makes it so great.<br><br>Its gory , profane, and hilarious which is what is making everything\ngreat. part of what makes this movie so great is how they pushed the\naction together with stupid jokes. from the start of this movie till\nthe end i was laughing, Reynolds was the best pic for this movie by\nfar.with Reynolds playing dead pool you can tell that he was able to be\nhimself.The gore and gun play is great in this movie as well it never\ngets dull and you never see the same kill twice. so far this arguably\nthe best marvel out there.\n"},
{"review": "\nDeadpool tells the story of Wade Wilson who upon being diagnosed with\nterminal cancer then goes to a shady place with shady people ran by\nantagonist Ajax. After being cured but disfigured Wade goes after Ajax\nin order to fix his face.<br><br>Let me start out by saying that I had a blast watching this movie. I\nthought the action was outstanding, and found myself laughing at the\nfilms crude and sadistic hummer through out the whole runtime. The\nmovie was also incredibly fun. If I was rating this movie purely on how\nmuch I enjoyed my self during it I would be giving this movie a perfect\n10/10. But upon analyzing it I can only recommend it as good.<br><br>My reason for only calling it good is because the movie relies mostly\non its sense of hummer. And upon analyzing it what I found is that if\nyou find Deadpools hummer chuckle worthy at best you will probably not\nlike this movie nearly as much. Also the plot as well as antagonist are\nonly unique when compared to other marvel movies. Where as if you look\nat as just a movie it is cookie cutter.<br><br>In conclusion I had a blast at this movie and any one else with that\nsense of hummer will. But if you don't share Deadpools sense of hummer\nyou will find it only has action scenes to offer after that. And when\nmore then half of the movie is not an action scene you will be\ndisappointed. And I'm giving this one a 6/10.\n"},
{"review": "\nI went into Deadpool with seemingly high expectations. The video game\nseries was great, so i set my standards high for the movie. And well, I\nwasn't exactly 'disappointed' but I wasn't exactly pleased. Now look, I\nread the original comics, but I'm not gonna act like a butt hurt fan\nboy about this. The humor was 'meh' and pretty crude for the sake of\nbeing crude. (the scene with the ring pop was kinda funny). And it had\nits fair share of boring moments, and i'm not gonna lie, but the scenes\nwhere they tortured him to unlock his 'powers' kinda felt like some\nweird torture porn seen straight out of a Japanese hentai. But overall\ni still enjoyed it, Ryan Reynolds was a great cast for Deadpool in all\nhonesty, i looove him as an actor. Some of the side characters were\npretty meh (i loved the blind old lady to death), but his wife and\nFrancis (was that his name i forgot) were pretty forgettable. But I\nstill enjoyed it none the less, (still kinda hated how the chick saved\nhim in the end, his wife or whatever, kinda forgot her name). But the\ncostume looked fantastic, like it was ripped right out of the comics! i\ngive this movie a 6/10 because it wasn't awful, but it wasn't good,\n"},
{"review": "\nIf you like your movies violent and vulgar, then Deadpool is right for\nyou. Based on the Marvel Comics character, Deadpool is about Wade\nWilson aka Deadpool, a masked merc with a mouth who is on a mission to\nfind the jerks who physically scarred him, and that's about the whole\nmovie right there. Deadpool is essentially one long chase movie with\nflashbacks thrown in to give the chase context. Ultimately, how much\nyou enjoy the movie simply boils down to how funny you find Ryan\nReynold's filthy-mouthed portrayal of Deadpool. Don't be fooled into\nthinking this is a fun superhero movie for the whole family, this movie\nhas a hard R-rating, and deservedly so. While I personally found a lot\nof the violence, nudity, and language unnecessary, we live in a\nday-and-age where so many are desensitized to these things, I know I'm\nin the minority. Bottom line, if you enjoy movies that are as rude,\ncrude, and socially unacceptable as possible, Deadpool is right for\nyou.<br><br>I give Deadpool a 5 out of 10!\n"},
{"review": "\nThere rarely exists a time when i actually like a superhero movie. But\nDeadpool is an exception, in the way that it's different from most\nsuperhero movies.<br><br>Now, i tried not to join the hype train in fear of disappointment. But\nfortunately, i was not disappointed in the slightest.<br><br>Apart from that, Deadpool has lived up to everyone's expectations. And\nmost definitely has surpassed mine. At first i thought it was going to\nbe another bland superhero movie with little to no backstory of the\nmain character. But boy was i wrong. Surprisingly there was a enough of\nthe story to make me feel emotionally attached to this character.<br><br>And of course, there are things being exploded, balls being busted, and\nabove all awesomeness.<br><br>If your like potty jokes and awesomeness in general, than what are you\nwaiting for? Go watch it!\n"},
{"review": "\nThis movie is so funny with many easy-to-catch one liners and a re-\noccurring theme of the 4th wall being broken down. Ryan Reynolds is the\nperfect actor for the dirty and funny superhero. The story is based off\na love story and how important looks are when a gambler gets terminal\ncancer and wants to be cured for the love of his life. When he is cured\nhis face gets deformed and he gets powers ad uses them to avenge his\nface and look normal again. He goes out to find this man and when he\nfinally does he is stopped by other superheros, who use their powers\nonly for good. As Deadpool goes out to find his nemesis he learns many\nthings about how looks aren't anything in love and if you love someone\nenough appearances wont matter.\n"},
{"review": "\nThe funniest, non-cliché and superior superhero movie I've ever seen...\nAs a character, Deadpool is unlike any \"hero\" you've ever seen.He has\nno qualms with blowing a bad guys head off with his pair of nine-\nmillimeter pistols or cutting them off with his twin katanas, he's\nmixing it up with both the on-screen baddies and the audience.A\nsuperhero film is only as good as the actor playing him and, if ever an\nactor was meant to play Deadpool, it is Ryan Reynolds.Ryan Reynolds,\nthe king of charming smartness, hits the big time.But it's undeniably\ntrue that I'm in the minority here, as Reynolds has never been able to\nbreak through with audiences in a real or enduring way. Every effort to\nturn him into a legit action star has been met with stony silence, if\nnot open contempt.\n"},
{"review": "\nI give this a 10 outta 10 because Ryan Reynolds and this was the best\nrole for him. I enjoy Deadpool, I can't wait for a sequel. I hope it's\njust as good as this one. I don't care about anyone else's review of\nthis movie. I have the video game, and the movie was just as good as\nthe game. I love Marvel comics. I wish I was as cool as Deadpool. He's\nprobably the coolest and laid back superhero in the world. I absolutely\nwas entertained by his backstory. His backstory was the best. I don't\nwant to spoil it for everyone, but this movie has comedy, action and\neverything. I need his costume, because I think it's really rad. And I\nlove the color red.\n"},
{"review": "\nThis movie proved that you don't need hundreds of millions of dollars\nto make a enjoyable and great movie. After it final hit the cinemas\nexcitement about this was huge. Deadpool is the funniest and most\nentertaining strip character. Movie had some holes in it but it was\nnothing to care about. Everything how we get to know him before and\nafter was well edited and put together. Jokes aren't the smartest but\nthey are just the one when you hear them you feel entertained. Deadpool\nas character is funny as hell but at the same time so loving and\nsarcastic but most of all violent. Movie just portrayed his power and\ncapabilities. Reynolds was perfect choice for the role as he is very\nfunny and tends to joke all the time but in the same time looks strong.\nThen his girl get kidnapped and he must get to her and save her while\ntaking everybody that made him like that and showing who is the boss.\nIt classic story of battle between two guys only that they are both in\nkind of way bad. Two characters that helped him get to her are well\nplayed. Granny and Deadpool are perfect, you just love them. Movie was\nfunny, violent, entertaining, well acted and GCI is amazing just\namazing. Despite all that waiting and finally making the movie that had\nmedium budget it was a great hit. 9.8/10\n"},
{"review": "\nFirst, let's talk about the good: Deadpool himself is portrayed exactly\nthe way he is in the comics. Most of the jokes are hilarious.\nAdmittedly, there are a few bad jokes, but I forgave it. Some awesome\ncomic book moments: Deadpool threatening the pizza delivery man. Only\ndifference is in the comics, Deadpool kills the pizza man. The action\nsequences are perfectly executed. The final showdown is epic! And the\nbad? Well, screw it. There is no bad. Barely, if any. Either that or I\njust didn't pay attention to those parts because I enjoyed the rest so\ndamn much! Colossus looks great. Angel Dust, well, she has a nice rack,\nand knows how to fight. Vanessa, Deadpool's girlfriend, is cute as a\nbutton and is also kinda bad ass. The villain, Ajax, I guess could've\nbeen a little better. And the post credit scene implies a sequel with\nCable in it! Yes!!!! Bring it on, Deadpool 2! One more thing, is\nWeasel, Deadpool's friend at the bar, is so funny, especially when he\nfinds out what Dead looks like.\n"},
{"review": "\nRyan Reynolds is indeed the perfect anarchic, motor-mouthed, regular\nguy turned vigilante crime-fighter. The constant gags, humor and\nreferential jabs are just as over-the-top as is the brutal action and\nviolence. Putting these writers together with this director made a\nmovie that will be mentioned forever. By far one of the superhero movie\nI have seen. Even my wife, who is not a superhero fan, laughed,\ncringed, sighed so much that this has converted her to a superhero fan.\nDefinitely not a kids movie, although they would love it too. Can't say\nit enough, awesome from the beginning to the end. Keeping and eye for a\nsequel to this outrageous movie.\n"},
{"review": "\nAs a huge fan of the comic books Deadpool, this movie was amazing to\nme. The people who have reviewed this movie 1 star etc then they\nhaven't read the comics to understand the character. Some reviews say\nhe talks too much, weird giving his nickname is 'Merc with a mouth'<br><br>To anyone who is a fan of the comics this movie is for you, it delves\ninto the back story of how he came about to have the powers he does\nalong with the humour you would expect from Deadpool.<br><br>I really hope this turns into a huge movie franchise as the stories\nthat have already been made through the comics and any situation you\ncan put Deadpool in are endless.<br><br>I also like how they threw Bob into the movie for a split second(anyone\nwho reads the comics will know Bob)<br><br>So for such a short budget this movie gets an 8/10 from me. Im sure the\nnext one will be even better!\n"},
{"review": "\nI didn't expect anything before I saw this film. I know nothing about\noriginal comic books. I was surprised in a good way while I saw this\nfilm.<br><br>I saw a Super Hero who is completely not a typical one. Swearing,\nmurdering, impolite and rude, stupid, childish, nasty. You barely think\nhe looks like a Super Hero. But actually he is. Only he doesn't\nrecognize it and he is crazy indeed. If you observe deeply, you may\nfind he still has his principle and boundary.<br><br>It really refresh me after I saw so many typical Super Hero movies. I\ntotally agree with his opinion. If being a super hero means let bad guy\nlive and keep hurting more innocent people, I'd rather being just\nsuper.<br><br>Also I like the romantic story between Wade &amp; Vanessa. They both carry\nheavy burden and very lucky to find each other. There is not just sex!<br><br>The way Ryan talk to the 4th wall to make fun of X-men series, Movie\ncompany and even himself is just funny.<br><br>Most people may dislike this movie because the R rate expression and I\nagree too that this movie is definitely not for children or teenagers.\nIt still can't change the fact of \"Deadpool\" is a well making, ironic,\nentertainment movie.\n"},
{"review": "\nRyan Reynolds finally plays a comic book character that we was meant\nfor. After the disaster of Green Lantern, years ago, Ryan got his\nchance to play a role he was destined for.<br><br>As an R-rated film, and highly discussed by many about how \"this is not\na kid's movie\" the film is kind of tame in its uses of adult subject\nmatter. <br><br>It's a good story, about the vigilante / anti-hero Deadpool. It has\nstrong comedy elements, it plays out realistically, and it really works\nwell as a romance too. It hardly even feels like a comic book movie.\nI'm hoping the atmosphere of Deadpool 2 is similar. <br><br>Morena Baccarin was wonderful in the role and fits really well with\nRyan. Supporting characters of Colossus and Negasonic seemed forced,\nhowever, due to limited budget of licensing for more X-Men characters. <br><br>Most of the action sequences are fun but some people may not be able to\nhandle them very well due to the gore. Humor is very active in the\naction scenes and the film's R-rated content keeps light hearted. Aside\nfrom some of the kills in the film, the laidback feeling makes me feel\nthat the film is suitable for some kids (depending on age).<br><br>This was definitely the first must-see of 2016. Deadpool is a great\nfilm all around and should be seen by everyone, even if you're not a\ncomic book person.\n"},
{"review": "\nI understand it could of done better however, loads of people rated\nthis 1 star out of 10. Have you frigging seen the opening credits. That\nwas awesome. I mean \"starring God's Perfect Idiot\". That is awesome.\nThe cast was amazing, the flashbacks were good and this film had some\nfunny jokes. If you are over the age of 15 and have not seen DEADPOOL,\ni assure you, go and watch it. This film was awesome. Tim Miller, Ryan\nReynolds and much more help from loads of people made this film for a\nlong time. IT WAS WORTH IT. Colossus was amazing in this. Negasonic\nTeenage Warhead was brilliant. And the damn British VILLAIN was\noutstanding. I don't understand how anyone can really hate this. This\nwas a good success!\n"},
{"review": "\nI have to admit, I did chuckle a number of times during the movie's\nonslaught of nonstop jokes. However, that's really all the movie has\ngoing for it. The fight scenes are not involving (mainly because\nDeadpool is invincible and has a lackluster villain). The love story\ndoesn't really work either for such a violent character nor does the\nback story. Fox probably shoehorned all these elements that really drag\nthe movie down--the superhero movie clichés--because even though they\nwere taking a risk in making this R-rated movie, they didn't want to go\nall out with it. All those clichés really stand out against all the\nparts that do work because they are so lackluster. It felt like no\neffort was put into any of those areas mentioned above compared to the\neffort put into making the character as good as he was.<br><br>The potential is there to make a good movie in the future with Deadpool\nthough and given the massive box-office success the film was, I'm sure\nthe sequel will be better able to focus on giving us a plot worth\ncaring about and more innovative action sequences.<br><br>Add-on: Some of the jokes are very rape-y and off-putting.\n"},
{"review": "\nThis title knows what it's about. Unlike other marvel movies, this\nmovie keeps it low-scale, the plot is not over the top, and it keeps to\nits material. It is not too ambitious, and stays within reason.<br><br>The acting is quite good, the actor that plays Deadpool is so good at\nthe act, that it feels like they are almost the materialisation of the\ncharacter of the comics. The humour is on point, it does not feel\nforced, and it captures very well the kind of humour that the comic\nbook character has. And I am also a fan of how the Deadpool character\nrecognises that he can not be a hero, which makes him feel a lot more\nhuman, unlike a lot of superheroes that just jumps into this large\nresponsibility by the fact that they're powerful in itself.<br><br>The action and choreography is quite good, and the action scenes all\nwere appropriate. However I must warn for all viewers that the movie is\nquite bloody and contains a lot of sex scenes, and even involves\ndecapitation and depicts characters being shot.<br><br>My only complaint is that I am confused as to the role of this movie,\nand how it might play into the other marvel universes.<br><br>I would recommend it, as it is good for what it is, and deviates from\nthe typical comic book movie genre.\n"},
{"review": "\nDeadpool was an okay movie. It was definitely not great, as many would\nsuggest. It was very funny, but that is literally all that it had going\nfor it. The film was extremely anticlimactic - I found myself bored,\nmidway through. Also, the X-Men reference was so forced, I laughed at\nit. Deadpool was a filler movie - something to entertain superhero film\nfans, while they wait for the next blockbuster. I am a bit disappointed\nin myself for spending $4.99 renting it, On-Demand. The film felt like\nsomething you rent while hung-over, and - even then - that's not\nhelpful, because you still wake up, wondering why you have a boring\nmovie in your line-up. I would highly suggest that anyone looking for\nsuperhero fun go see X-Men: Apocalypse, which is an awesome film.\n"},
{"review": "\nDeadpool(2016) Starring: Ryan Reynolds, Morena Baccarin, Gina Carano,\nT.J. Miller, Ed Skrein, Brianna Hildebrand, Jed Ress, and Karan Soni\nDirected By: Tim Miller Review You know I didn't think I was going to\nsee this movie because while I may be eighteen I have no I.D but\nluckily my father took me. Man I'm glad cause this is one of the best\nsuperhero films! Just not the best R-Rated one. Based upon Marvel\nComics' most unconventional anti-hero, DEADPOOL tells the origin story\nof former Special Forces operative turned mercenary Wade Wilson, who\nafter being subjected to a rogue experiment that leaves him with\naccelerated healing powers, adopts the alter ego Deadpool. Armed with\nhis new abilities and a dark, twisted sense of humor, Deadpool hunts\ndown the man who nearly destroyed his life. This is a comic book that\ndoes not acknowledge itself but damn as heck feels like one with his\nballs out their humor and crazy costumed hero. This movie was trying to\nget off the ground for years by Ryan Reynolds who felt he owed it to\nfans of the character to give them the Deadpool they wanted after\nrelentless backlash for both X-Men:Origins Wolverine and his Green\nLantern movie. He damn well did owe us and he delivered. It may be the\nmost fun I have had in a comic book movie but that doesn't\nautomatically make it the best, but it's one of the best, not better\nthan two films I could mention but the point is that you will fall in\nlove with Deadpool.\n"},
{"review": "\nThe new age of superhero movies shows how meta references and involving\nan expanding world of superheroes can create an entertaining flick.<br><br>Deadpool isn't an average hero who has noble intentions or wants to\nsave the world for the right reasons. <br><br>Deadpool is in it for the revenge and to make something out of his\nworthless life. I saw bravery and true potential from him in the start\nwhen he was willing to risk his life for a girl who's boyfriend\nwouldn't leave her alone. Most wouldn't care or get involved.<br><br>He undergoes experiments to transform his body into a super mutant, but\ninstead is betrayed by the mad scientist to become a slave. <br><br>While in not usually a fan of self aware films that pretend to be\nintelligent or witty yet this turned out to be a hidden gem.<br><br>Ryan Reynolds has come along way from being a pretty face and a one\nnote actor to be a leading man. He brought heart and conviction to this\nrole.<br><br>The xmen extras felt a little phony and not true to form of the\ncharacters we seen portrayed in the xmen series. Yet I found a certain\nappeal in their willfulness to risk livelihood and loved ones for the\ngreater good.<br><br>The leading lady willing to over look psychical beauty for the man\ninside was touching. She didn't care what anyone thought or how strange\nthey looked in public. You don't get depth like that in super hero\nmovie or kick-ass.<br><br>Still it leaves the question on if Deadpool is gay, straight or bi\nsince some of the action or phases he sprouts are questionable about\nhis sexuality.<br><br>The final fight scene was magnificent and kept you guessing. Will he\nsave the girl or let her go to save mankind. It was heartbreaking,\nfunny and touching.<br><br>It earned all ten stars. Don't be put off commercials that don't do It\njustice.\n"},
{"review": "\nI honestly think that if it wasn't for Ryan Reynolds, this movie would\nnot have received the high average rating it got on here. Ladies, (and\ngents), let's face it: if Deadpool was played by some average schmuck\nwould you really be giving this movie 10 stars, keeping in mind that he\ndelivers the same lines the same way? <br><br>Yes, this is a snarky movie and it's supposedly true to the original\nseries, but as a movie on its own it's just cringe-worthy. The jokes\nare funny-ish, the beginning is loaded with unnecessary sex scenes and\nshots of Reynolds' a**, and towards the middle I was falling asleep\nbecause it just seemed like the movie was all over the place and not\nreally going anywhere. <br><br>One of the most over-hyped movies this year. If you want a semi-love\nstory, action, snarky remarks and cheesy one liners, and of course\nbrief glimpses of Ryan Reynolds doing the nasty with a hot girl, yes go\nahead and watch this.\n"},
{"review": "\nWow! This movie really blew me up! I was not expecting this at all.\nHaving a life and not being a nerd I had no clue about this character.\nI love him! Finally someone that is not a product of the Hollywood\ncrappy world of Illuminati.<br><br>This \"anti-hero\" is exactly what I would be if in a similar situation.\nI might actually be even more crazy. This guy is simply not accepting\nthe weak-ways of the Batman, Superman and all the \"man\" series that\nfollow the laws so that the criminal can still get out and make more\nlawyers work. (Hey, even losers need money, the fact they use a\ndishonest job to get it is only part of the horror but then again, they\nare stupid humans!)<br><br>Deadpool, to me, is the REAL hero of Earth. When he gets a criminal,\nthat criminal will not do evil again. With Batman and Superman he would\nbe back out on the streets within 2 weeks, they use the \"law\", you know\nthat thing for some losers to make a salary...<br><br>There is plenty of action, laugh (in my case at least), and yes,\nviolence. If you don't want violence watch the smurfs or Tinkerbell.\nThe comments from Deadpool made me laugh the whole movie, I like his\ndisrespect of the \"caped boy scouts\" which I agree with. (I loved the\n\"vulverine\" ones, it took me 5 minutes to stop laughing, it is so true!\nBig knives instead of fingers but cannot even scratch a villain! Wimp!\nFreddy Krueger was scarier and more efficient than Vulverine.)<br><br>To the people that did not like the movie I can say; stick with your\nTwilight crap! For the real movie amateurs this is a must, it will show\nyou that you can be a bitch and a hero!\n"},
{"review": "\nFirstly I would like to state that it is completely hilarious reading\nreviews with One Star because the movie had \"Foul Language\" and \"Sex\nScenes\" or that someone had no idea that the movie was inappropriate\nfor their 9 year old kid. Dead Pool is rated R and with 3 minutes of\nresearch you could have determined if this movie was for you or not\nWith that being said I will not delve into the plot but the acting and\nwriting were fantastic. Ryan Reynolds nailed this role. If you are\neasily offended by violence, language, or nudity this is not the movie\nfor you but if you have a sense of humor and want to be entertained for\n2 straight hours you will love this movie.\n"},
{"review": "\nIf you compare this to other DC and Marvel films Deadpool is not an\noutstanding film yes it does have some scenes that are Offinece and\nrude and Racist but its not that bad of for an anti hero film here are\nsome of the things that I did and did not like about this film. 1. some\nscenes are rather inaporepet at times which could of been cut out of\nthe film and be an bonus feather on the DVD and Blu ray release. 2. I\nthink the film is a bit overrated giving it an 8.2 on IMDb I think at\nleast give it an 7.3 instead just because some of the sexual scenes are\na bit too much. <br><br>I do like this movie as it is one of my favorite SCIF but The sex\nscenes where a bit too much <br><br>overall its a great film if you don't take it too seriously 7/10\n"},
{"review": "\nThough this movie was good, and I gave it a 8 doesn't mean I fully\nliked it. As a lot of people have mentioned \"deadpool\" is going to be\nthe most(badass) movie coming and it will be so hilarious\". Regardless\nof the nasty sexual humor in the movie, I think it still missed some\nspice to be a \"great\" movie. I actually liked how it was built to be a\ncliché with the bad guys with bad guys versus good guys that might not\nbe that good after all.<br><br>In a nutshell, a nice movie with too much hype. The music in the movie\nadded a really nice input since it was planned well with the scenes :).\nThe movie was easy to watch and it was something that I didn't really\nneed to fully pay attention to. I actually multi tasked while watching\nand I still stayed aware of what happened.<br><br>I recommend you to watch the movie though if you haven't yet. It's\nnowadays a good thing to know what the movie was like because after all\nit is quite popular!\n"},
{"review": "\nDeadpool is easily the most fan service of comic characters, so it\nmakes sense that his big screen spotlight is a movie that feels a fan\nservice movie. The \"merc with a mouth\" is a character that doesn't take\nhimself seriously and neither does his big screen adventure, which is\nthe biggest appeal of an otherwise standard super hero formula hiding\nunder waves of winking irony, crass humour, and gleefully bloody\nviolent mayhem.I'm pretty sure this is my new favourite Marvel movie\n(alongside 'The Avengers')Whether or not you are a fan of this style of\nhumour is one thing, but this film as a whole, is fantastic.The concept\nof superhero fatigue only exists when films begin to bleed into one\nanother, without even a modicum of originality or creativity. Deadpool\nis the outsider the genre desperately needed -- a hysterical exercise\nin separating itself from the pack with no 4th wall in sight and a\ntitular character that offers more heart than anyone would have\nanticipated.\n"},
{"review": "\nWas A pretty good movie. Just wish the studios would make up their\nminds about how they want the characters to look like and keep it they\nway and at the same time keep it close to the original comic character\nas possible. First The had him in Wolverine with swords as arms, too\nfunny. I mean when did Colossus become Russian? And think they could\nhave picked a better known x-men other than \"Negasonic\" to be in it. I\nhope they get it right in the squeal. But over all was a decent movie.\nJust sucks that its rated R for people with kids who like X-Men. And\nWolverine 3 is supposed to be rated R also. Kids are gonna be\ndisappointed again.And they need to stop messing around and make a\nmovie about Gambit!!!\n"},
{"review": "\nThis is probably the funniest marvel movie to watch Dead pool is great\nfun and Ryan Reynolds finally pulled of a great superhero movie after\nso long he finally did it. Dead pool was probably the best role Ryan\nReynolds could have if he wanted to play a superhero funny witty and\nfun to watch. The movie had great fourth wall breaking and the why the\nstory was told was excellent.<br><br>The plot follows Wade Wilson who's wife gets kidnapped and he goes to\ntry and find her from a villain known as Ajax who gave Dead pool his\npowers. Dead pool has the help of two other mutants one of them being\nColossus who was great by the way.<br><br>The movie was perfectly self aware and was great and fun to watch and\neasily the funniest marvel movie.\n"}
]