[
{"review": "\nI'm not a fan of Tom Cruise as a person and that sometimes influences\nmy opinion on a film. Even with this point in the back of my mind I\nmust say that Tom Cruise still got it. He's a fantastic actor who\ndoesn't even chose to have a stunt double in MI4. I couldn't even think\nof trying some of these. Now to the main film. You may think it's going\nto be just like all the other action movies and all the other Mission:\nImpossible parts. But with every new part of the series it gets even\nmore spectacular: the equipment is beyond imagination, the locations\nare mind blowing, the secret plans are super clever, the characters are\ncool and smart. Also the trailer was that good that I just wanted to\nsee this at the movies and couldn't wait for it to be released. I\nhaven't seen any MI film at the movies and this was definitely a great\ndecision. The best action film in years.<br><br>I'm giving it a 10/10 because there was nothing I didn't like about\nthis movie and it was worth every cent!\n"},
{"review": "\nThis was a fun movie to watch; much better than I anticipated. Usually\nsequels have totally run their course by the fourth time, but not so\nhere. In fact, this might even be the best of the Mission Impossible\nfilms.<br><br>It has a good mixture of interesting action scenes, suspense, drama,\nhumor, great scenery of Venice, Italy, and fine acting. Nothing is\noverdone to the point of being too much and, as most MI films go, it\nhas the normal espionage-type intrigue to figure out.<br><br>It's just plain entertaining. Kudos to all: the director, the actors\nand the special-effects and cameraman. A superb job done all around.\n"},
{"review": "\nIn the way of movies - MI4 Ghost Protocol is another in a long line of\nlet's fill up the screen with as much crap as we can . Busy does not\nmean good - it's boring. The same jump off a rooftop, car chases,\ncrashes , fights , etc etc etc. MI4 tries so hard to take itself\nseriously but instead ends up one long car chase so to speak. Tom\nCruise does his usual look at me I'm trying to be cool act which is\nabout the same thing he does in every one of his movies. His team of\nagents also does the we look cool so watch us do these cool things .\nThe plot if there is one about the Kremlin being blown up is boring - I\nfell asleep halfway through and wanted to just go home. The backers of\nthis series are beating a dead horse trying to milk whatever else they\ncan get out of it no matter how bad the script is or how long in the\ntooth Cruise gets . Sad thing is ,this movie will make money because\nCruise's name is attached to it. Too many fanboys out there who don't\ncare if a movie sucks as long as their boy or girl is in it will plunk\ndown the bucks to see it over and over. 1/10 -Bomb\n"},
{"review": "\nWell... Where do we start...? The biggest thing I'd like to know, is\nwhose idea was it to make the Mission Impossible franchise into a cheap\nslapstick comedy?<br><br>Cruise does not seem to sit well with the role of Ethan Hunt this time,\nin this format. He just never looks comfortable with the amateur comedy\nroutines with his fellow cast-mates. It's just a bad, cheesy film. It\nlacks sophistication; no charisma; the action is B-movie-ish from start\nto end and style makes all the gadgets seem rather pathetic. There's\njust no depth to it at all.<br><br>After the smooth style of the third instalment, this one drops the\nbaton spectacularly. It feels dis-jointed and never finds a flow which\ncould pull it all together. Even the music doesn't seem to work. You're\njust left not caring whether this new band of jokers fail/succeed, live\nor die.<br><br>Very poor attempt.\n"},
{"review": "\nI think this movie was a big mistake and destroyed the cult of the\nMission Impossible franchise.<br><br>Every movie in this series has unbelievable moments. Thats right, we\nlike this movies for this moments. But in the first 3 movie this was\nOK. In Ghost Protocol we have a big mistake.<br><br>In the first minutes of the film we know the terrorists have the\nnuclear launch codes. Everybody know in the IMF. HEY??? Why don't they\ncall the Russian president, and say: Hey mr president, change the\nlaunch codes, because stolen the originals... bing bang bung end of\nstory, the crisis is over, the stolen codes are useless and everybody\nhappy...<br><br>But don't. they risk global nuclear war, send some men to death,\ninstead of a call for the president.<br><br>Phatetic.\n"},
{"review": "\nGlamor, unbelievably expensive cars and special effects are all stars\nof the movie, if any. The story is enough entertaining for the video\ngame if you are below 6 years of age. The plot sadly exists but is so\nbanal and shallow that it might fit in one sentence: kill the\nterrorist, save the world and prove that Americans rule and are\nalmighty! And they so much are since walking into Kremlin is a peace of\ncake, gathering data there is easier than getting a hot dog on the\nlocal kiosk while people from time to time are becoming cats and\nwalking on the outside wall of the tallest building in the world. The\nsame heroes are walking into the worst sand storm and walking out in\nthe most expensive model of BMW. Wow! If we skip all the money invested\nin the movie and very solid film crew along with the actors, it looks\nlike the core idea for the movie has been written by a very small\nchild. Don't get me wrong, I love fairy tales but even they have to\nfollow some logic and style. Frankly, the only thing that amazes me in\nthis movie is Tom Cruz, this guy looks the same in last 25 years.\n"},
{"review": "\nDialogue was god awful, couldn't make it past the first 30 minutes. I\nknow movies are supposed to have a bit of a leeway when it comes to\nbeing believable but this was just so ridiculous. We are just supposed\nto believe all this insane technology exists and its really this easy\nto break out of a prison. Come on! No way! It would happen way more\nthen, at least make it seem difficult. I saw the IMDb reviews and I was\nlike oh its rated 7.7 this should be better than I think its going to\nbe. How is it rated this high? It's like a child wrote it. Walked out\nand got a refund. Not worth the price of a ticket. Don't waste your\nmoney. Wait until it comes out see it for free.\n"},
{"review": "\nI'd say, this is a very poor effort to save the franchise. I think,\nthat even MI3 was better. For god sake, in the first part of the\ninstallment they've sticked a flying helicopter in a train tunnel! Was\nthere anything THAT special or extraordinary in this movie except CGI\nKremlin explosion (which was shown in the trailer) and the Burj-Dubai\nscene (you can find some videos of base-jumpers making jumps from it on\nthe net, so there's nothing that surprised me)? NO. Absolutely nothing.\nThey've even tried to make two people chasing the slow-riding train\nlook exciting and funny! How retarded is that for a Mission Impossible\nmovie? OK, I'll admit, I loved that \"holographic-corridor\" thing, but\nthat's about it... And how weird it is to read all the positive reviews\nabout this movie and people praising it as a quality come-back.\nPersonally, I think this movie is very mediocre and even worse than\nsome of the lower- budget and promotion action movies that been out\nlately.\n"},
{"review": "\nThe first half of the movie is probably the best action movie of the\nlast 20 years. It is intense, well shot, engaging and absolutely\nstunning visually. The stunts and action set in Budapest, Moscow and\nDubai and are absolutely fantastic and make the movie. Unfortunately\nthe movie slows down greatly in the second half of the movie (or is it\ntwo thirds/one third?) in Mumbai and loses itself in some common genre\ntraps: too much explaining stuff that doesn't make sense and some\nfairly 'average' action. It's a small gripe, probably half explained by\nthe fantastic beginning of the movie. The cast is the best of the\nseries: Jeremy Renner is a good addition, Lea Seydoux is a pretty cool\nvillain and the female lead whose name escapes me is somebody I wish I\nwould have seen in another movie? And Cruise is Cruise, he's the man in\nthis saga. A great movie overall, well done Brad Bird!\n"},
{"review": "\nI've been watching all of the Tom Cruise \"Mission Impossible\" movies in\npreparation for \"Rogue Nation\", and I must say that \"Ghost Protocol\" is\nthe best film of the franchise so far (having not seen \"Rogue Nation\"\nyet).<br><br>I'll admit that I am a fan of these movies and always have been.\nEpisode 2 is the lone let down in the series, with the first and third\nmovies both being fantastic. But \"Ghost Protocol\" just takes the series\nto a new level. This one really has some dynamic special effects, and\nit emulates the style of the third movie but manages to have an even\nmore engaging and thrilling plot (although the script of Episode 3 is\nhard to beat).<br><br>That said, you really can't go wrong with \"Ghost Protocol\". Give it a\nshot if you haven't seen it!\n"},
{"review": "\nMi4 is at least one act too long. But, that doesn't matter, something\nis bound to explode and wake you up. There was some snoring going on\nfrom the audience. I knew when it was a meeting scene with the\ncharacters, I could take my bathroom break. When I returned, they'd be\nstarting the next mission. Predictable and way over the top - But then\nagain it's TC, so...he's got to do inhuman acts and look cool doing so.\nOh, and the missile to destroy the world with .0001 seconds on the\nclock, been done about a thousand times. Lazy. TC also goes with the\nhoodie, yep he's like 50! Mi4, like a lot of other big budget movies,\nis like a running infomercial, ie, Apple products everywhere...H-wood\ndoesn't like old people and they sure as He** don't dig MS, HP and\nother technology that just isn't hip.\n"},
{"review": "\nThis film is boring right from the pathetic title sequence and never\nresembles the original TV series ever. Apart from a couple of nice IMAX\nscenes of Dubai, it is so not worth the additional price to see it at\nIMAX, or any theater. Definitely wait for a video rental on this one.\nAlso, I actually sorta liked the 2nd and 3rd one but this film has an\nalmost non-existent plot. Come to think about it, what were the other\ntwo films even about, do you remember? You will forget this film except\nfor one or two silly scenes involving weather and high places. I would\nhave been more excited by character development and an actual story but\nI guess that's just an impossible mission to pull off these days when\nmoviegoers seem to be entertained by special effects and glitz. By the\nway, I kept expecting Daniel Craig to show up and introduce himself as\n007. This film is Bond VERY light!\n"},
{"review": "\nThis movie is a shame. PLease people look for the honest reviews here.\nPaid reviews have been plaguing IMDb for some time now but this trumps\nit all ... this movie deserves 3 stars MAX!!! Anything over that is a\nreview by a 5 year old easily impressed child, or a paid review. Count\nthe 10 star reviews here!!! It's incredible?! Who gives this crap 10\nstars? Djeez ... Please take my advice and just stay away from this.\nDon't even watch it on cable unless you need to watch something to kill\ntime with while your overdose kicks in or something. In any other\nsituation this movie is not worth the time. I would give it a 0, or a\nnegative score if IMDb would allow it.<br><br>You know what : -27/10. There, that's my honest opinion. Seriously.\n"},
{"review": "\nWatched MI4 in theatre oh wow this movie has blown my mind seriously\nthis movie was awesome than its predecessor and I am well sure it will\nlift up the MI series to a huge franchises this movie was awesome at\nmany things I mean action and action sequence was cool but again I\nwould like to talk what I love most in this franchise GADGETS.<br><br>Again like its predecessor this movie's gadgets are awesome and wicked\ncool and also the action sequences were awesome I heard that\nthis.movies director Brad bird has taken a first time chance for making\na live action movie so I thought i t would not be cool.<br><br>But like JJ Abrams he also proved that he is a good and worthy director\nfor this big Franchise so I am now speculating that the next film must\nbe cool than this the 3 and 4 th installments were awesome now I want\nmore action and gadgets in the 5th installment I will praise the\ndirectors and a whole crew for entertaining us.<br><br>MI 4 is the best film in MI series yet I hope the 5th one will exceed\nit.\n"},
{"review": "\nWhat's really surprising about \"Ghost Protocol\" is that Brad Bird, its\nman at the helm, made the jump entirely from animated fare - and he's\nremarkably capable with action movie staging and direction. Color me\nimpressed. <br><br>The disbanding of IMF is a novel approach to changing up the franchise.\nWithout support, these superspies are forced to improvise to the nth\ndegree, giving this movie an unpredictable edge. The core group of\nactors gel together pretty well (with Cruise continuing his unique\nbrand of age-defying ass-kickery; man, that guy is nuts), and it's a\nteam I'd see again in a future installment. That stuff with Ethan's\nwife at the end was a little much, but his walk into the vapors more\nthan made up for it. <br><br>This series still has some kick left in it. A great collection of\npopcorn action movie talents.<br><br>8/10<br><br>Also: my god, Paula Patton is unnervingly good-looking.\n"},
{"review": "\nOh my !! This movie is so impressive and should be watch and it is a\nmust . I loved all the part in this movie . It showed the globalization\nof technology useful nowdays and their powerful abilities of using it.\nIts inspired me of ideas of some part in the movie . It also add\nluxurious places and setting which i find it very comfortable . The\ntheme in this movie are remarkable outstanding . And two thumbs up\nwhile standing solute it . I just love it . The best part in this movie\nwhere they go Dubai at burj the world highest man made building ever .\nI then research about the scene in burj khalifa i find it , that Mr\ncruise actually risk his own life while acting using a real rope\nclimbing skill and real expose to the height . I mean it is not\ngraphics editing or camera tricks , i mean come on nowdays movie is\nboring using the green graphics generator cover not that realistic .\nMost of the scene in this movie using a real hacker skill which i love\nto watch . I love technologies and this movie has made it sparkle. Nice\n! Great and i watch this movie over and over again .\n"},
{"review": "\nThis is why I enjoy movies so much. When a masterpiece like this is\nshown on the big screen you can't help it to not get carried away. The\nactors was amazing, the storyline was amazing, the special effects was\namazing and the characters was amazing. Tom Cruise has not let us down.\nFor the fourth time in this franchise, Cruise has shown extraordinary\nacting skills as playing the fearless Ethan Hunt, and of course not\njust him. Simon Pegg as the not intentionally funny, British hacker\nBenji, Jeremy Renner as William Brandt and the beautiful Paula Patton\nas Jane Carter. <br><br>What i love about the movie is that it got some funny scenes in it as\nwell. It's not just action in it, comedy also. But that doesn't mean\nthat it's a action-comedy movie. Trust me, this movie is full on\naction! <br><br>This movie was just a blast. Filled with action, a little humor and\nspecial effects that you can't imagine. The best \"Mission Impossible\"\nmovie so far. There is a reason I rated it 10 stars!\n"},
{"review": "\nI'd rank this movie better than MI2 and just hair better than MI3. If\nthey continue with this franchise, i'd like for them to go back to the\ncomplexity of the first MI movie. MI4 is more a step in this direction\nfrom 2 and 3. I think what I liked most about the movies was that the\nvillain was not someone who was in the IMF. The whole bad guy from\nwithin routine was fine in the 1st movie, but felt repetitive in the\n2nd and 3rd. Also, Ving is and excellent actor and it's a shame his\ncharacter feels like and after thought in this film. They need more of\nhim. <br><br>I look forward to more movies in this series with either Cruise or\nRenner in the lead.\n"},
{"review": "\nThis is the third of four Mission: Impossible films starring Tom Cruise\nthat I managed to watch (I only missed the second one directed by John\nWoo). I enjoyed each one despite not always knowing what was going on\nand this was no different. Still, with those awesome stunts and those\nspecial effects one still gets entertained and doesn't think too much\nabout the plot until they get to the exposition which always provide\nsomewhat of a reasonable explanation of why things happen. And, really,\nCruise still has the charisma to sell it in a believable enough way.\nAnd the woman playing Agent Carter is sure hot enough, isn't she? So on\nthat note, Mission: Impossible - Ghost Protocol gets a high\nrecommendation from me.\n"},
{"review": "\nI loved the editing and the direction of this movie. The movie kept\nmoving and didn't got boring at any point. Tom Cruise clearly shows\nwrinkles now but his acting is getting better with his age. It was nice\nto see Josh Holloway in the movie and Jeremy Renner is very good\naddition in the Hunt team, Did miss Michelle Monaghan though. The\naction sequences are done brilliantly, except 1 scene on the highway,\nthey made me jump out of the seat at couple of points. All in All its a\nvery good action movie. I wasn't expecting it to be this good after\nwatching the first trailer of this movie but this franchise is\ndefinitely not over.\n"},
{"review": "\nMI4 is right up there with the first Mission Impossible film. The MI\nseries has turned out to be one of the better action film series in the\nlast decade or so. What's missing in MI4 is the lack of the one, main\nvillain; but it doesn't detract too much. Known for big, elaborate set\npieces, this one delivers a couple of the more memorable ones. Decent\nacting all around, the addition of Jeremy Renner is a welcome one,\nmaybe they will stick with his character going forward, the way they\ndid with Ving Rhames. Enjoyable; I'd be eager for the next one.<br><br>P.S. Props to Brad Bird; there was now way I could imagine the director\nof 'The Incredibles' being able to handle this kind of material; it\nsays a lot about his talent. Lets hope they get another worthy director\nfor the next film; he did a very good job.<br><br>8/10\n"},
{"review": "\nMy husband, teenage son and I saw this movie at IMAX, and really\nenjoyed it. It's a classic James Bond-type flick, with an over-the-top\nbad guy, a gorgeous girl, a lovable sidekick and a hunky, ripped hero\nwith amazing athletic ability. The climbing scene alone was enough\nreason to see this on the über-large IMAX screen. I was on that glass\nwith Tom, and - boy - what a ride.<br><br>Tom Cruise: Even more gorgeous now than when he was a boy. Love the man\nhe is becoming, and how gracefully he is aging.<br><br>Paula Patton: Gorgeous woman, and I was surprised by her athleticism.<br><br>Jeremy Renner: As always, a great actor.<br><br>Simon Pegg: Endearingly funny and cute. He's rapidly becoming one of my\nfavorite British actors.<br><br>Michael Nyqvist: I was pleased to see this Swedish hunk in another\nmovie, but why did they make him look so bad? Looks like he had fun\nwith the role.<br><br>All in all, it made for an entertaining night at the movies.\n"},
{"review": "\nGreat film. The plot makes sense, the dialog is real and funny, the\ncharacters are believable even though their exploits are not. Isn't\nthis a good recipe for a two-hour action entertainment? <br><br>The stunts are amazing especially the one of Tom Cruise cruising along\nthe glass windows of the tallest building in the world. There are some\nreally funny lines and when hit the characters actually hurt (unlike\nAngelina Jolie movies where she is wounded but remains unscathed even\nwhen hundreds of elite forces attack her). Mission Impossible: Ghost\nProtocol is over two hours of action that will keep you at the end of\nyour seat, biting your nails. <br><br>If Tom Cruise was trying to compete with, let's say, the Bond\nfranchise, his Ethan Hunt wins by far.<br><br>Funny, Cruise's Russian is better than the one of his Russian friend in\nthe movie, acted by a Serbian actor.\n"},
{"review": "\nThe story is fairly typical for a Bond movie - Evil Megalomaniac wants\nto blow up the world with a Nuclear Bomb - and immediately gets down to\nwork with action scenes in Budapest, Moscow, Dubai and Mumbai. The cast\nis very effective and the action scenes all deliver. Credit should be\ngiven to Brad Bird. He uses excellent timing, makes sure we know that\nis Tom up there on the side of the building and gives us a few\nsurprises during the scenes. But at the end of the day, this movie\nworks because Tom Cruise sells each scene. He is casual about the\naction when he needs to be, he is intense when it requires it and he is\na truly likable action good guy. If they had half stars I would give\nthis an 8.5. The movie is what it advertises to be, nothing more,\nnothing less. Fast paced action that flies through to the finish.\n"},
{"review": "\nWe went for the movie on 3 consecutive days and it was sold out. Even\nthen i did not have much expectations from the movie. Still it\ndisappoints. Pros: 1. The entire scene of Burj Kalifa (just the\nbuilding) scene is worth watching.<br><br>--thats it---- Cons: 1. No proper storyline at all 2. Nuclear war is\nshown as a joke, looks like its some secret game played by high school\nkids. 3. No solid performance from any of the actors 4. I know its not\na very \"logical\" movie, but even otherwise its too stupid. Some super\ngizmos appear in the first half of the movie, but as the movie\nprogresses they seem to disappear 5. And wooow, activating and\ndeactivating a nuclear weapon is a childs play ( neither of the\ncountries involved even have a clue!!!)\n"},
{"review": "\nMovie is really good, i am really upset on seeing people complaining\nabout scientology and other crap about tom cruise as a reason to not\nsee mission impossible ghost protocol. I really wish they empathise\nwith that man who said whatever he thought not out of malice but\nthinking that ritalin is indeed a street drug and many other\npsychiatric abuses are prevalent in our society. He is not going to\nmake you do anything you don't want ,you people should decide what is\nbest for you. As for the movie,it was a top notch action thriller with\ngreat direction, cinematography, cool stunts and overall a complete\npackage . The 30 minutes of IMAX shot in this movie was surreal and\nsomething to behold, that itself justifies the extra imax price, Go see\nthe movie because it's really worth it (IMAX recommended for complete\nexperience)\n"},
{"review": "\nI saw this with lowball intentions, the whole series was just funny\naction flicks. This one is soo intense, impossible and in lack of a\nbelievable story, it is no joy to watch.<br><br>A constant stream of product placement - cars, computers, travel\ndestinations - is making this even worse to follow.<br><br>The acting is strangely weak, it seems they were in a rush making this\nmovie. Seems like a schoolplay with the actors having troubles not to\nsmile foolishly all the time. My only positive comment is on the\nHollywoodish finish - good special effects (apart from the initial\nKremlin blowup) and access to a lot of money.\n"},
{"review": "\nGranted I haven't seen the second one, but from what I hear that's the\nweakest of the series. Now I did enjoy the first Mission Impossible, it\nwas a little confusing but still pretty fun. The third was better,\nmaking the plot simple but not meant for babies. However the fourth\nmovie, Ghost Protocol was extremely well done.<br><br>The action scenes were really well done, especially the scene where Tom\nCruise was scaling the building, damn to I wish I saw that in Imax. The\nacting was great, and it didn't take itself to seriously, I laughed\nquite a bit in the theater.<br><br>And there are several twists and turns that keep your mind working,\nthis isn't a movie for little kids. There really isn't much else to\nsay. Brad Bird, you have made the transition from animation to live\naction perfectly.\n"},
{"review": "\nAnother American who save's the world, isn't a bit transparent??? I\nmean, every movie more or less from the south coast \"over there\" is all\nabout saving the world, quire boring for the rest of us living in the\nreal world... Ever tried to kill the heroic and childish thinking???\nBruce Willis played this role well in the late -80'is and it worked\nflawlessly but now like twenty years later it seams absurd... Travel\nthe world next time you writing a film, get close to reality! Like they\ndid with the \"Bourne identity\", close to earth and very well done. I\nmean, how hard can it be as long as your not stationed in the same\nplace with the same circle of friends?\n"},
{"review": "\nHere we go again, another spy thriller action movie that looks like it\nwas half made for the car, cellphone and tourism companies, and half\nmade for the superstars to generate talk in the celebrity shows and\nmagazines about how athletic they are, how cool they are, how funny\nthey are. What it certainly doesn't seem to be made for is an\ninteresting plot or a story or anything resembling an opinion. The plot\nis so generic and predictable that I doubt anyone will remember any of\nit in a few month's time. It's a bean counter's action movie, utterly\npredictable and by the numbers, designed for star-power and product\nplacement. It's more of an insult to the movie goer than entertainment.<br><br>If you enjoyed the other Mission Impossible movies, you'll probably\nenjoy it too. If you didn't like the older mission impossible movies,\ndon't go to this movie thinking that this one's different or you'll be\nsorely disappointed.\n"},
{"review": "\nI did like the movie. The acting was spot on. I do have some quick\nquestions. One is when tom is in his cell he is throwing a ball against\na wall that comes back to him. However when he puts this item in the\nwall hole it looks like putty. Putty does not bounce back to you like a\ntennis ball. Also, when he is in the hospital the bad guy plays a tape\nplayer. Is that michael caine's voice on the tape? It sounds like him.\nIf you want to get hold of me here is my address: wkozak221@gmail.com.\nI found the film to be fun to watch but I really do not like cgi. Even\nif it well done you can still it is cgi. Why can't directors use less?\nConsidering how much actors and actresses get paid they should do most\nof their stunts, (within reason), of course.\n"},
{"review": "\nThis what the spy-action genre is supposed to be like. There is not one\nwasted frame in this film. The photography is beautiful. The locations\nare visually interesting. But, mainly, it's the story, the story, and\nthe story that drives it. The actors gives believable\nperformances...every one of them...particularly the foreign-born. I\nguess that equals effective casting. The musical score is great. I\napplaud especially the orchestrator for a fine job enhancing the film\nmusically. I am positive that the next installment will be on my list\nas well. Unlike some other franchises, I have no fear of\ndisappointment. The Mission may seem Impossible but great movies can\nstill be made. This one proves it! Good Job!\n"},
{"review": "\nAre you a Mission Impossible fan and do you like other espionage films?\nThen this is the movie for you.<br><br>This is a great action packed film.<br><br>The introduction to the film was very good. It is entertaining from the\nbeginning to the end.<br><br>Each actor in the film performed their role very well. Tom Cruise was\nexcellent again as Ethan Hunt. I thought Simon Pegg's character was\nhilarious and really enjoyed him in the film. It was great to see\nJeremy Renner introduced in the Mission Impossible movie. Every actor\nin the movie was great.<br><br>The special effects were outstanding and the movie had a great plot.<br><br>It kept me at the edge of my seat. I really enjoyed this movie.<br><br>I'm huge fan of espionage movies.<br><br>I'd highly recommend this movie. See it if you have a chance!\n"},
{"review": "\nI'm a huge fan of the Mission Impossible movie franchise and I have\nseen all of them. In this fourth installment of the successful series,\nagent Ethan Hunt and his team are disavowed after a rogue terrorist\nknown as Cobalt bombs the Kremlin and frames them for it. Ethan and his\nteammates have to prove their innocence and prevent Cobalt from using\nnuclear launch codes to start a deadly war between the United States\nand Russia in a game of cat and mouse from Moscow to Dubai and Mumbai.\nIn this movie, Tom Cruise did one of the most risky daredevil stunts in\nhis amazing film career by dangling from the tallest building in the\nworld, the Burj Khalifa which left me at the edge of my seat. He's\nwithout any doubt a sophisticated actor and stuntman always putting his\nheart and soul in every movie he works on. I'm also looking forward to\nsee Mission : Impossible 5 in the future. <br><br>Mission Impossible : Ghost Protocol deserves 10 stars!\n"},
{"review": "\nThis is both funny and full of action from all the characters. Renner\nis great and he could have done even more action, unfortunately his\ncharacter for much of the film did not call for that. He is introduced\nas an analyst, however as the film progresses you learn what burdens\nhis mind. Patton is fantastic, especially during her action sequence\nwith a certain bad girl in the film! <br><br>Comedic relief comes from both Pegg and Renner. I think it's these to\nactors that make me watch this franchise, so if more Mission\nImpossibles are made, they must be in them! Major props to all the\ncoordinators and stunt work! The actors I'm sure did a lot of their own\nstunts, but all the people that did it first and put it all together\nearn major major props!\n"},
{"review": "\nA film that takes the audience from Budapest to Moscow to Dubai to\nIndia and maybe a few other international destinations in-between!\nThere is some spectacular looking stunt work and some cracking effects;\nhats off to those guys! All the performances were very good with Tom\nCruise playing Ethan Hunt with his usual aplomb. It was nice to see a\nlittle comic relief provided by the inclusion of Simon Pegg; the\ncomedic two- and-fro between him and Jeremy Renner was particularly\namusing. Maybe the plot might have been a little over-complicated, but\nover all I found it a pretty enjoyable watch.<br><br>SteelMonster's verdict: RECOMMENDED<br><br>My score: 7.5/10<br><br>You can find an expanded version of this review on my blog: Thoughts of\na SteelMonster.\n"},
{"review": "\nIs it me or at the beginning of the movie when agent Hanaway(Josh\nHolloway)jumps off the roof and turns around to shoot the bad guys, as\nhe is flying backwards he looks a lot(too much) like Tom Cruise? Slow\nit down and see for yourself. Also, did anyone notice that in his last\nmovies, Cruise always finds an occasion for showing us how fast he\nruns? Great movie for fun, don't go looking for great acting. Even\nthough, let us hope that they continue putting money in entertaining\nmovies like this one... and maybe throw some good acting also. Why\ndidn't they put Ving Rhames only for a couple of seconds? Bye guys,\nthanks for the attention.\n"},
{"review": "\nI saw this movie twice and it was the best movie I have seen in years!\nI am not into action movies, However, this was the exception. It was so\namazing that I had to see it twice! I didn't see the other three films\nbut now that I have seen this one I really want to. However, you do not\nneed to see the other three films to enjoy this film. Tom Cruise is one\nof my favorite actors, and as usual I was not disappointed by his\nperformance in the film. I thought Simon Pegg also did a really amazing\njob as Tom Cruise's side kick. I enjoyed the part of the movie when Tom\nwas climbing the side of the hotel in Dubai. It was so cool that this\npart was incorporated in the film. It was exciting, exhilarating and\nnerve racking. I could watch this movie 5 million times and still enjoy\nit.\n"},
{"review": "\nbest mission yet. this movie is the best out of the mission impossible\nseries with spectacular effects on the edge of action and really\nsophisticated humour. this is without doubt one of the most exciting\nfilms of mission impossible i have ever seen.<br><br>the plot seemed a bit complicating but after a second viewing i got the\nstoryline straight away. for me the film felt a bit too quick because i\nreally enjoyed it. the scene in which cruise is climbing up the\nbuilding and the one in which the kremlin blows up i thought was\namazing. i would watch this film loads of times because i thought it\nwas brilliant.<br><br>i would recommend this to everyone because its a must see movie and is\nsurely one of my most favourite anticipated movies.\n"},
{"review": "\ncaught it at a special screening in Australia.....I would like to thank\nIGN for proving me the golden opprtunity.....this movie is directed in\na great style and it's screenplay is so fast paced that you won't feel\nbore for a second, it is in no ways a contender for this year's Oscar\nbut if there was an Oscar for the most entertaining film then it would\nbe up for it....I won't tell you it's story because I will like you to\ngo to theaters and get shocked by it's story.....the question may arise\nif this film is better than previous MI movies let me tell u sth this\nis the best of the series. Here are some reasons u why want to catch\nthis: 1.Entertaining simon pegg 2.Tom cruise 3. brad bird's stylish\ndirecton 4.unpredictable plot 5.for being entertained 6.for a good\naction flick 7.Jeremy renner 8.Anil kapoor 9.for a film that makes\nsense 10.because it is a part of mission impossible franchise Don't\nexpect it to be a ground breaking film and you sure won't be\ndisappointed\n"},
{"review": "\nThis film tells a team of secret agent on a secret mission to stop a\nRussian maniac detonating a nuclear bomb in USA. To achieve this, they\nhave to do a series of almost impossible tasks spanning several\ncountries.<br><br>\"Mission: Impossible - Ghost Protocol\" is an action packed thriller. It\nhas certainly gone a long way from the first one to this fourth\ninstallment. The Kremlin scene involving a screen looks a bit too high\ntech for the job, but that is the spirit of Mission Impossible I guess.\nThen the Dubai job is the highlight for me. The scenes involving\nheights really made my palms sweat! I was really on edge, wow - the\nstunts team really did an astonishing job. I enjoyed watching this\nfilm.\n"},
{"review": "\nHighly enjoyable flick, with a bundle of action interleaved with some\nlightening humour and some angst-ridden character motivation.\nPersonally, I thought it the best of the MI film series to date\n(followed by 3, 1, and of course 2 last). Belief had to be lightly\ndangled rather than completely suspended.<br><br>An MI team with a pleasingly diverse background and character is backed\nup by a very well-crafted and engaging supporting cast (the assassin,\narms-dealer, Russian crook, Russian cop). Anish Kapoor and his party is\nsomething of a forgivable comic turn. The villain perhaps does not get\nenough development or screen time; in almost all sequences he seems to\nbe trying to make a rapid getaway (you probably see more of his coat\nthan his face).<br><br>Mercifully the only appearance of masks was when one went wrong! OK, a\nprosthetic arm had a major role, and that nose definitely looked fake.\n"},
{"review": "\n\"Mission: Impossible - Ghost Protocol\" is the fourth movie of the\nMission Impossible series and in this one we have Ethan Hunt and his\nnew team who wants to clear the name of IMF because of a bombing in the\nKremlin.<br><br>I liked very much this movie because of the plot and the storyline, and\nI believe that suspense and action were in the most out in this Mission\nImpossible movie. I also liked the interpretation of Tom Cruise and his\nnew team especially Jeremy Renner's who was magnificent and Simon\nPegg's who was hilarious in some moments.<br><br>Finally I have to tell you that I strongly recommend this movie because\nit's really worth seeing and you will not regret it.\n"},
{"review": "\nThis is a awesome movie. Mr. Hunt is so tactful in this movie. By this\nmovie, Mr. Director try to introduced viewer about varieties culture of\ndifferent countries. And that's also focus-able, the world residence\nare in the nucleolus bombing threat. This is a massage about nuclear\nweapons security issue. And the adventure of this movie so much bravo.\nTom Cruise is out to demonstrate a touch. When is he not? Of all\ncontemporary movie stars, he may be the one most eager for constant\nvalidation, as if he'd curl up and die if we ever thought he was past\nit, or merely coasting. See, he can play funny and bald (Tropic\nThunder), mean and murderous (Collateral), or a Nazi (Valkyrie), if\nrequired. Today, Cruise must prove that there's fresh life in the\nMission: Impossible franchise, though, in fairness, the commercially\nunder-performing third one was pretty solid. How better to do it than\njump, in person, off the tallest building in the world? Technological\nuse are shown perfectly. In a word this is a awesome Directive story.\n"},
{"review": "\nNow I'm a fan of all four MI movies, least of all being the second, but\nI enjoy all of them for them not just being fun action movies, but for\nhaving a lot more depth than the average super spy flick. The movie is\nstill written with the same formula which made the original a success\nbut with some amazing dialogue, back-story and innovative tech.<br><br>Packed with dense scriptwriting, intense action scenes, perfectly timed\ncomedic moments (mostly thanks to Simon Cowell) and amazing sets and\ndirection. I honestly did not expect this movie to be as good as it\nwas. Having a generic plot of Nuclear codes falling into the wrong\nhands, this movie still makes still original and enjoyable and worth\nwhile. <br><br>This movie surely has it's moments. 8.5/10\n"},
{"review": "\nTo say that the special effects in this are outstanding would be a\nmassive understatement. This movie is nothing short of stunning\nthroughout many of the scenes. However, unfortunately, and I would\nguess due to Tom Cruise's monstrous ego, there are many many close-up's\nof his face throughout the film. Anywhere there is even a remote\nopportunity to move in on his face they do. It's like, is this mission\nimpossible or mission show Tom Cruise's face? Look, I like Tom Cruise.\nReally. I don't like him enough to look at his face close-up over and\nover for an hour and a half. I gave this one a 6, mainly because it's\nso stunning, but definitely marred by the repeated unnecessary use of\nTom Cruise close-ups.\n"},
{"review": "\nI like Tom Cruise as a film actor, he can go from that despair look of\n\"the world is about to end\" to intense determination in a split second.\nThe music helps too, and through-out the movie the music is a real\nblood pumper. The only thing I can think of that could make someone\nthink that the movie is not so great, is the plot which is contrived\nand nothing new. Its Mission Impossible, however, and no other\ntelevision franchise has been able to pull off as successful a\nfollowing (outside of Star Trek) as this one. Sometimes it is hard to\nget over the \"Tom Cruise is a nut case\" thoughts, but what actor is not\na nut case ? If you let yourself get into the picture it moves at a\nvery rapid base till the last scene which moves very slowly till the\nfinal moments before the credit roll. Mr Cruise also acts as producer\nof the film and that means he will be pulling in the dollars...and\nthats a good thing for the soon to be ex Mrs Cruise and Scientology\ntoo..\n"},
{"review": "\nI am a very fair judge of movies. I don't just say I like it or hate it\nout of bias. But I must say, Ghost Protocal was a pretty good movie. It\nis enjoyable for anyone over the age of 13. It had a little bit of\neverything in it. That is what I like to see in a movie. If it is an\naction movie, I want to see more that just action. Can I see a little\ncomedy, and drama in it as well? This is kind of how Ghost Protocal\nwent. Not going to give anything away, but it had some great scenes in\nthe movie. It's not really a \"Must Watch\" movie, but if you ever find\nyourself bored, give a try. Whoever did the cast was good. The actors\ndid a fantastic job and actually fit the part. I can't always say that\nfor some movies. Well done.\n"},
{"review": "\nthat actually made sense and wasn't too ridiculous. I was pleasantly\nsurprised with this sequel. I thought it was much better than the last\nMI. There were still some outrageous silly stunts, but not as many, and\nI could get past them to enjoy the film. This time agent Ethan Hunt is\nafter a criminal that blew up the Kremlin and stole nuclear launch\ncodes. Him and his team track him down without the President's\napproval, hence the title, ghost protocol. The plot was easy to follow\nand not filled with holes. There was still some BS stunts, like Hunt\nflinging himself on a tall building, releasing his rope, and landing\nwhere the missing window was and being pulled to safety. There was also\nthe trickery in the hallway in the Kremlin. I can't believe that would\nreally be possible.<br><br>FINAL VERDICT: Worth checking out for an action flick.\n"},
{"review": "\nTom Cruise's career has been down almost every road it seems, and yet\nthe best road he has ever gone down is the action picture road, and his\nmost successful has been the Mission: Impossible franchise. While I\nhaven't seen any of the other films, I was very impressed by this one.\nThe film has everything you need: comedy, action, suspense, a good\nplot, and well done performances, which is actually rare for an action\nfilm. The only complaint I have is the villain. Not only do we get\nmaybe five minutes of screen time with him, but his motives seem a\nlittle questionable and he overall comes off as extremely weak. But the\npositive of that: we get to know the four team members very well and\nlike each of them and hope they all accept their next mission, which I\ndefinitely will.\n"},
{"review": "\nThis movie was great. Tom Cruise is back in action once again! This is\ndefinitely the best Mission Impossible yet. Tom Cruise acted really\nwell in this film and director Brad Bird just directed his best\nproduction. This movie acted like the real thing that happens in real\nlife. It was very realistic, even though the IMF agency doesn't even\nexist. I could tell that the people in this movie did a really good\njob. Now, this movie might seem average, with the bombing of the\nKremlin, the IMF being disavowed, and Ethan Hunt going to save the IMF.\nNot average. This movie went down into the unexpected, with assassins,\nsmugglers and the U.S. government. Everyone did really good job in\nmaking this film. And the soundtrack was just amazing. I am going to\ndownload it to my Mp3 player as soon as possible. I am going to buy\nthis on DVD, and I hope that Tom Cruise will come back to act in a\nsequel to Mission Impossible-Ghost Protocol.\n"},
{"review": "\nI was pleasantly surprised by this movie. It was about two thirds of an\nexcellent movie. The action scenes and set pieces were spectacular and\nthe comedic moments cracked me up. Where the film lost me was whenever\nit tried to take itself too seriously by adding unnecessary dramatic\nelements. Let's face it the MI franchise has been and always will be\nthe ugly step child of the Bond Franchise. If they would just stick to\nwhat works with the series rather than trying to be something they are\nnot the films would be better for it.<br><br>I wanted to hate on Tom Cruise but he was rock solid in this film.\nSimon Pegg tickled my funny bone quite a few times as well.<br><br>check out our full review at 3guys1movie.com\n"},
{"review": "\nThis movie to my opinion is the best in the series, i expected nothing\nseeing the movies before (which to my opinion were poorly made), but\nwas very pleasantly surprised. I must point out that from all the\nprevious movies, i am glad to say that finally there was some kind of\nplot i could follow and enjoy, not some dubious scenes poorly cut and\nconnected together. like in the movies before. This movie is full of\nbeautiful scenic shots and great special effects, And as always tom\ncruise does a great job of acting, giving a feeling of a modern James\nbond. to make it short, I really liked it very much and hope to see\nmore of the sort.\n"},
{"review": "\nWhat was there not to like? There was the action, the gadgets, the\ncars, the stunts not to mention sarcastic amusement from Simon Pegg.\nSure, we've seen it all before, whether it be in the Mission Impossible\nseries itself, James Bond or the Bourne series, but this particular\ntake had a real slickness and refined edge towards it. Cruise's\nconsistency as Ethan Hunt doesn't detract from the character's relative\nlack of development though, although, there was more screen time and\nattention given to the rest of the crew this time, a welcome change\nfrom the film's predecessors. Plausability: Definitely Deniable.\nEntertainment Value: Impossibly unlikeable\n"},
{"review": "\nI'm a fan of the series, I loved the 1st one, 2nd one (with awesome\nsoundtrack by the way) and third one<br><br>However I'd love to see IMF working as a super team as it is supposed\nto be and not hunting Ethan Hunt (again)<br><br>Movie 1.- He's hunted because someone set him up Movie 2.- this one is\nOK Movie 3.- He's set up again and hunted by other guys from IMF Movie\n4.- Someone sets up the entire IMF (agaaaaain)<br><br>Can't we just have a movie where we have this big bad and powerful guy\nthat is impossible to take down instead of thinking on new ways to set\nup the same poor guy again?<br><br>Also, the gadgets failing the entire movie was just too much, I got\ntired of them failing over and over Seriously guys, where do IMF buy\ntheir stuff? from ACME just as the coyote did?\n"},
{"review": "\nAll pretty predictable but an enjoyable way to kill a couple of hours.\nIt's not a film I will ever watch again unless stuck on a plane.<br><br>The acting is perfect for the genre, the direction and effects very\ngood. However, there is nothing that inspires and allows the\nimagination to work. I can only assume Simon Pegg was cast to provide\nlight relief but his character, whilst well played, is out of place and\nbelongs in a Johnny English film.<br><br>If you really want to buy it, wait a couple of years as it will be\nheavily discounted in the supermarkets. Let's hope there are no more\nIMF films as the franchise has run it's course.\n"},
{"review": "\nI usually rate average movies with a 7, but this one felt under that\nbar. Of course, it has to do with expectations. People have told me\nthat this fourth part of the Mission Impossible franchise was better\nthan all the others and I expected something nice. But, since I haven't\nseen any of the others for reasons of suspension of disbelief, or lack\nthere of, for me it was a big step to just watch this one.<br><br>Well, fancy action scenes abound, with cool gadgets James Bond would\ndie of envy for, but that defy the laws of physics and common sense.\nAgents that look beautiful and smart, but they are almost neither. Tom\nCruise does a lot to save the film, but the wooden dialogues and silly\nscript overwhelm him.<br><br>Bottom line: Like an old hooker with lots of expensive makeup, it is\njust not worth it.\n"},
{"review": "\nGreat. I love this movie. Overblown yet precise. Extremities in the\nlength that the set-pieces of MISSION IMPOSSIBLE: GHOST PROTOCOL are\nwilling to reach is what gives this impressive feature a wow-factor,\nbut it is the careful eye to detail and playfulness with cinematic\ntraditions that make it truly stand-out. The latest in the American\nespionage series sees the ambition of adrenaline reach new highs, with\nstunts and concepts that are as insane as they are exciting. Which is\nvery.Tom Cruise never disappoint! Well...keep Vanilla Sky out of the\npicture. Since MI3 I though to myself, well, it was a good movie but\nthe series is going from good to worst. But MI4...OMG. I saw it in 4DX\nand I loved the story. My favorite was MI2. Not any more. info at\nbatdongsan.biz\n"},
{"review": "\nWell, I have noticed others have given this movie a high rating. To the\ncontrary I expected way more from this movie. I even watched in Ultra\nAVX. I always considered Mission Impossible movies to be James Bond\nknockoffs, and where Tom Cruise gets all the credit. Regardless, the\nmovie had a mediocre plot but had a nice flow. However, parts of the\nmovie were just outright unrealistic, and half the time Tom cruise came\nout unscathed. I know that he performed all the stunts himself, but\nthere should at least be tidbit of realism in action movies which make\nthem just a bit more enjoyable.<br><br>I wish this movie had more visual effects and was in 3D that would be\nhave been awesome.\n"},
{"review": "\nTom Cruise is still good when it comes to action.. he fits the role of\na top agent.. this sequel have a good script and was only divulged in\nthe later part of the movie when it was found out that indeed it was\nHunt who was protecting his wife all along. All of the actors played\ntheir part accordingly, got lots of laugh too.. nice work Mr. Pegg.. ha\nha.. Jeremy Renner's role is mysterious and we hope to see more of his\ncharacter in another sequel.. Paula Patton looks hot in the movie too..\nTo top it all I like the \"live action scenes\" - no doubles equals much\nrespect to the actors and stunt crew.. there are a lot of challenging\nscenes featured in the film like the part where Cruise have to climb up\nthe hotel in Dubai.. nice locations too.. very scenic.. a good movie\nindeed.\n"},
{"review": "\nThis movie is one of the best action entertainer of the year. I watched\nthe movie on IMAX screen and thrilled by the action episodes. It was\nvery thrilling to watch Tom Cruise jumping from \"Burj Kahlifa\" and\nrunning on it(Tom did these scenes with out a dupe and they are superb\non big screen). The characters played by Simon Pegg, Jeremy Runner and\nPaula Patton are fun to watch. The action sequences especially, chase\nscenes in Sand Storm are amazing to watch. I didn't watch any Brad\nBird(Director)past movies but after watching this movie I felt that we\ncan expect some good action entertainers from him. Everyone in the cast\nand crew excelled. <br><br>Don't miss this fun, action entertainer and Please watch this movie on\nIMAX screen. One word I can say is \"Ethan Hunt is back\".\n"},
{"review": "\nThe whole series of mission impossibles have been very exaggerated, and\nthis amongst all was the one which last pleased, sequences of filming\nwere over exaggerated and random, things that are impossible to\nestimate are shown like its a piece of pie, right from the start the\nmovie shows things that are beyond impossible - thus making it mission\nimpossible. If you are a person who watched with all attention, if you\nare following the story with concentration, the story depicts\nimpossibility in every way, the action sequencing is terrible, the\nstoryline line is very childish, things don't connect to one one\nanother correctly, its displayed in very confusing manners,everything\nis way too exaggerated and artificial. The movie is just packed up with\nloads action sequences just to keep customer busy and in the meanwhile\nthe story going nowhere at all. To me it was a way to senseless movie.\n"},
{"review": "\nI hate when I watch a movie that I can guess what happens next.<br><br>Way to many unbelievable parts. You can go out of this world but it\nstill has to be believable. (Star Trek) Its as if they pieced together\nevery other great action sequence and cliché scene, statement,\ncharacter and built a story around it. Too too much action. Give it a\nbreak and make a story, not have to have one of the characters be\ncontinually telling us whats happening, whats going to happen. We\nsurvived it though. Wont ever see it again despite all the\nextraordinary places it took us to. The best MI movie remains the\nsecond one. A perfect balance of action and a great story.\n"},
{"review": "\nHonestly, I don't know why they chose to make another MI movie. <br><br>The plot is boring, it does not really go anywhere. I did not care\nabout any of the characters. I would even say that the Ethan Hunt in\nthis movie is completely different character compared to the older\nflicks. No chemistry between the actors whatsoever. The jokes were not\nfunny.<br><br>Many people say MI 2 sucks, but it is a masterpiece compared to this\nlatest installment. <br><br>If you still wanna watch it, wait for the Blu-Ray version and watch it\nwhile fast-forwarding.<br><br>I rarely write reviews, but I had to warn you.\n"},
{"review": "\nAmerica's another futile attempt to have its own James Bond. While Bond\ngets better and better (with Mr. Craig), MI gets worse and worse. Just\nanother ego-trip of Mr. Cruise. The panegyrics below seem even more\ninsulting to the intelligence of an average viewer (not to mention more\ndemanding ones). This serial is nothing but SFX, bad acting (although\nthe cast is good), routine directing and childish plot desperately\nseeking \"missions\" that are \"more impossible\" than previous ones. The\nfirs movie in the series was quite OK, but this one... Jesus! I mean,\neven The Saint (with Mr. Kilmer) was more watchable, and it was awfully\nstupid. <br><br>I'm recommending this movie only if you really have nothing better to\ndo (which I seriously doubt) and even then think twice. It is not\n\"light entertainment\", but with absolutely no mass at all.\n"},
{"review": "\nApparently the previous mission impossible was so ridiculous the new\nfilm had to make fun of itself. The impossible missions of perfect\ntiming, incredible feats of bravery and incredibly accurate reflex's\nhave been replaced with a trial of errors, making things up as they go\nalong.<br><br>It almost manages to redeem itself with the brilliantly clever gadgets\nand ocean's 11 style scenarios but is let down again by the massive\ninconsistencies. <br><br>It's a real shame they went the typical Hollywood route of bigger,\nlouder and more explosive, I used to be a fan. I hope the franchise\ndies with this film and comes back again in a decade with a new spin,\nreminiscent of the original.\n"},
{"review": "\nFirstly, those going to watch this film will probably have watched\nMI1/2/3. If you watched them, this one will be just what you are\nexpecting. High octane action, thrilling chases and nail biting\nsequences.<br><br>The storyline is a bit thin, and the twists don't leave your jaw in the\ndropped position, but having said that, it is a great watch. It is hard\nto take your eyes off the screen, with one particular sequence shot\nhigh up on the Dubai Tower that took me back to my 'hiding behind the\nsofa' Dr Who days! Seriously thrilling and flawless special effects.<br><br>Simon Pegg brings an element to the film previously missing from the\nfirst 3, a light hearted relief. What with all the action, it is a good\nrelease valve. Of all the MI films, this was the one I enjoyed the\nmost, though to my mind they are all pretty good value for money.\n"},
{"review": "\nImpossible to get in to if you are expecting anything as intriguing as\nthe Bourne movies or even the first installment of this long going\nfranchise. Though enjoyable if you switch of the better part of your\nbrain for the duration of it.<br><br>The action is solid and keeps coming in by the truck loads, the\ncharacters are entertaining , and there's enough eye candy to keep the\nboys smiling.<br><br>All in all MI4 (let's just call it for what it is) is everything you\nshould expect from a big budget action movie. It's a full on\nroller-coaster ride that only gives you a few instances to catch your\nbreath or think for that matter.<br><br>If you want something with more substance give the Bourne trilogy\nanother go.\n"},
{"review": "\nBest action flick of the year!<br><br>The awesome cinematography just helps the case. I would have loved to\nhear better use of the MI theme though. It's a lil boring in parts, but\nyou're too engaged to notice these flaws. Its without doubt the best\nfilm of the series so far.<br><br>Watch it for sure, and if you do, watch it on IMAX. I've never seen the\naudience clap without any particular reason, but they did today for the\nspectacular sequences shot using the IMAX camera. They left me\nspellbound. I am definitely going to watch it again. Normally, sequels\nare not that good, but MI3 was better than MI1 which itself was a\nclassic. MI4 has exceeded all of them. I am extremely eager to watch\nthe next movie whenever it is made.\n"},
{"review": "\nWhat should i say about this movie. THis is excellent movie in the\nfranchise yet. Excellent Acting, Nice Photography, Cool action\nsequences. Good Humour. Kremlin Scenes and the Dubai scenes are simply\nout of the world and breathtaking. Simon is good in his role, Paula\nfits in properly but the show stealer is Tom cruise.. Anil Kapoor is\nwaste , They could have taken some wannabe Indian Junior artist from\nHollywood or SRK for that lame role. The plot is straight forward\nnothing new about it just saving the world from Nuclear warfare, What i\nmissed in this movie was the twists and turns that has been the\nspeciality of Mission Impossible movies but still it is a Best action\nmovie of the year . there is also a reference of Sequel in the movie\ntowards the end. Will just have to wait and Watch Just go for it ....\nWorth the wait\n"},
{"review": "\nThe plot belongs in the mid-80's and the acting was just horrendous.\nWhen will Hollywood move on from the \"Russian nuclear threat\" scenario? <br><br>If I was 16 and had never seen a good action movie (Bourne or the new\nBond movies) I might have actually enjoyed this. I thought that Cruise\nover-acted every scene and the only bright performance came from Simon\nPegg. <br><br>However, my partner and I are both in our mid-40's and if we had seen\nthis in a theater we would have walked out by the mid-point. Since we\nordered it on pay-per-view we watched until the end and only wasted $6.\nThis franchise was strong in the first 2 installments, but III was a\nweak story and 4 shouldn't have even been made. I just can't understand\nall the positive reviews this is receiving.<br><br>Life is a precious commodity so don't waste 2 hours of it on this.\nHopefully we don't see Cruise continue to flog this dead horse with an\nMI5!\n"},
{"review": "\nThe fourth installment of Mission Impossible has hit the right spot.\nTom Cruise &amp; Brad Bird delivers the best with highly adrenaline pumped\nedge of the seat thriller with amazing stunt sequences &amp; excellent\ncinematography.The Burj Khalifa sequence were awesome. I watched the\nmovie in IMAX, most of the audiences were screaming at that time\n(especially ladies). Wow!!! what an amazing treat!!!! Jeremy Renner\ndelivered some good performances, but Cruise topped with great\nperformances. I would say, introducing Jeremy renner instead of\nJonathan Rhys Meyers to the film was totally a good idea. Coz, Jeremy\nhas got the screen presence apart from JRM. <br><br>A perfect choice for the Fall movie.. Majority of stunt sequences are\ninteresting, appealing and thrilling.<br><br>This is one of the top movie of Tom Cruise. And i will give 9 out of 10\n"},
{"review": "\nI only give this movie 5/10 since it is supposed to be so high class\nand a lot of money was spent making it.<br><br>Apart from that it is the worst installment in the Mission Impossible\nsaga. It has by far the worst script so far, the worst dialogue, the\nleast believable action scenes, etc.<br><br>I had a bad feeling about the movie the moment I saw the director's\nname. The guy is amazing when he makes cartoons, but MI:4 proves that\ncartoons and films with live actors are two different things.\nEverything here feels fake and typical cartoonish dialogue and \"funny\"\nmoments simply do not work.<br><br>It is also the first time when Tom has gone wrong when green-lighting a\nproject, and I hope this does not turn into a trait of his.<br><br>It is very regrettable that a script so full of stereotypes (like the\nages-old stereotype of Russia and Russians that Hollywood has been\nfeeding us with), the stereotype of the Arab world, etc. have been so\neasily and readily adopted by a director as smart as this one.<br><br>I am really sorry they made this film, and really sorry I watched it.\n"},
{"review": "\nThe movie did have a lot of thrilling moments and there were some\nstunning views of Burj Khalifa, Saint Basil's Cathedral, and Kremlin.\nBut there was an absolute lack of intriguing drama. One felt comedy was\nill-timed and not at all hilarious. MI 4 makers failed in their\nresearch on India. The emerging nation was cast as a land of humongous\npopulation of brainless people - far from truth. Elite hotels in India\nare not at all overcrowded. Let me assure Anil Kapoor can speak better\nEnglish than that and he is a much better actor. Why he chose this\nsuicidal role beats me. All in all, you won't miss anything if you\navoid it.\n"},
{"review": "\nI was expecting a slick, cutting edge movie. But it was more like the\nfailing gadgets/tape destruction littered throughout it. It didn't take\nus anywhere we hadn't been before. The plot was pedestrian, and when\nyou see a comic actor (Simon Pegg) cast, you know they've gone down the\nwrong route. <br><br>Tom Cruise was solid as usual, but was let down by the script. Ethan\nHunt is meant to have an answer for everything, instead of\nbrainstorming with his team and arguing over tactics.<br><br>It could have been a great end to 2011, but with the disappointing\nImmortals and then this, it just fizzled out.\n"},
{"review": "\nawful and atrocious, abominable, awful, dreadful, painful, terrible,\nunspeakable, dirty, filthy, lousy, hateful, mean! I don't know any more\nwords but you get it, right? If you like it, you are a child, and a\nchild don't know better! The sentences in this movie are so dreadful, I\ndon't know if i shall cry or laugh. I am scared because that many\npeople like it. It is a shallow movie and sums up what is wrong with\nbig spending movies nowadays, there is absolutely NO moral attached to\nit, no charm, nothing but a sofa jumping self centered guy who has lost\nthe human touch. Is it a comedy, action or drama? because emotionally\nit is a bad roller coaster ride. the movie made me jump 4 times during\nthe movie and that is when Tom changes the scene, probably for waking\nme up. Stop making these movies Tom, I beg you. I work with kids and\nall they do is pretending to be agent Hunt and kill each other in\nplayground. I want my money back!\n"},
{"review": "\nI was reminded of latter Roger Moore Bond films: tepid trading on a\nprevious relationship, humour to distract from the worn-bald plot, the\nageing principal going through old motions. This is harsh on Cruise\nactually, who looks pretty good and still carries the action well.\nNonetheless, he occupies set pieces rather than galvanises them.<br><br>Brad Bird has some good ideas, principally the sandstorm which has\ngreat cinematic potential. I like the truncated excitement of the prior\nepisode in Dubai as well, although the composition of the drama is a\nlittle uneven - it lacks a natural flow, like mediocre music.<br><br>Patton is wooden, over-earnest, and Renner is caught as he clearly just\nwants to have some fun whilst required to be something straighter,\ndarker. Thankfully Simon Pegg relishes his comic role, most effectively\nwhen explicitly required to joke in the script. I was intermittently\nbored 4/10\n"},
{"review": "\nWhile there were several set pieces in this movie, it was totally\nlacking any narrative drive. Also, several indulgent scenes at the end\nshould have been edited out. Just a slack, pointless exercise in\nexecute vanity. A waste of two hours that I wish I had not seen.<br><br>The presence of Jeremy Renner didn't gel because he was cast against\nhis type as a passive analyst who had field skills not commensurate\nwith his job title.<br><br>There was too much amateur standing around talking about what we're\ngoing to do that was unnecessary and should have been displayed to us\nvia the dramatic exposition--the stuff that happens--not by having Tom\nCruise yack on about what he plans to do.\n"},
{"review": "\nYes, Tom is back for a forth outing and saving the world from an\nassortment of baddies in the process. MI4 definitely follows on from\nparts 2-3, as it's more action orientated and has a plot that you can\nactually follow (I've seen the first one three times and I'm still\nconfused at who was double-crossing who!).<br><br>Plus, Tom takes Brit actor Simon 'Shaun of the Dead' Pegg along for the\nride, which adds an acceptable dose of humour into the mix. There are\nstunts, shootouts, car chases - everything you'd expect from a MI film\n(or Bond movie) and it's all held together nicely.<br><br>It's a solid action film with enough gadgets to keep old-school Bond\nfans happy. If you liked parts 2 and 3, give it a go - it's good silly\nfun.<br><br>It looks like there will be plenty more 'Impossible' missions for Tom\nto prove otherwise. No bad thing if they all end up like this one.\n"},
{"review": "\nMission: Impossible-Ghost Protocol is a brilliant movie with a very\nwell developed storyline and an outstanding cast.The movie is,in my\nopinion,without a doubt the best movie in the Mission: Impossible\nseries so far.I think what really helped improve this one from the\nprevious three was that Ethan Hunt had a team,as much as I love Tom\nCruise,I think it was better seeing him working with other great actors\nsuch as Jeremy Renner,Paula Patton and Simon Pegg,there was great\nchemistry between the four actors.The movie is of course action packed\nfrom start to finish and also very thrilling,the scene were Ethan is\nclimbing up the Burj Khalifa tower is so intense and hard to watch,\nimpressively directed by the great Brad Bird.Mission: Impossible-Ghost\nProtocol is a great movie that I would recommend to anyone looking for\na great action or thriller. <br><br>When their organisation is presumed to have bombed the Kremlin,Ethan\nHunt (Tom Cruise) and his new team must work together to clear their\nname. <br><br>Best Performance: Tom Cruise\n"},
{"review": "\nWow, what a ride. My expectations were more than met. I couldn't\nimagine that this would be a nonstop action movie with full of\nexplosive details and adrenaline. I've got never and never bored. I had\nlot of entertaining moments. Thumbs up for Tom Cruise and the staff.\nAlright, there are some scenes which I already knew from James Bond\nfilms for example. But there were some really cool sequences I have\nnever seen before. The story is told simply and it's not complicated.\nIn the same time all is packed in a fast paced thriller.<br><br>I highly recommend you to watch it, you won't regret. I am very curious\nwhat comes next. Thank you Tom Cruise for all you do for Hollywood.\nFinal vote: solid 7/10\n"},
{"review": "\nI saw all 4 Mission Impossible's, but this one was the best. Tom Cruise\ndid an amazing job as well as the others, but the first second I heard\nthe Mission, it's obvious that you know what will happen. Just like\nsuperman, he saves the day! I would have rated it higher, but all I\nwould add is more clues that lead up to who the person is. It would\nkeep you hanging, and I love that. So in a sentence, Mission Impossible\nGhost Protocol is a very intelligent action, adventure movie that is\nvery predictable. I hope you agree, but if you think different, than\nthat is your opinion, and I am fine with that. But, this is my review,\nand I hope you respect it.\n"},
{"review": "\nWhat really made this movie work is the lack of the super villain like\nin MI3, I thought Philip Seymour Hoffman ruined MI3 with his cheesy\nrole and thankfully the villain in MI4 is part of the story but not the\ncentral focus.<br><br>I also like the fact that they got the Ethan Hunt character back on\ntrack as a solo, single spy instead of a married spy like in MI3.\nHopefully they will keep the franchise going in the right direction\nespecially now that they've introduced the Syndicate as a group that\nHunt will be going up against in future movies.<br><br>Even though he's pushing 50, Cruise still proves that he can bring an A\nList action film to the big screen. Hopefully he will keep the MI\nfranchise going over the next 10 years as grows older. He can easily\nturn his character to a Jim Phelps character and be the team leader\ninstead of always being in the middle of all the action and stunts.\n"},
{"review": "\nMission Impossible: Ghost Protocol <br><br>Due to economic uncertainty, while out on their globetrotting\nassignments, many secret agents have now begun freelancing as\npaparazzi. <br><br>Fortunately, the itinerant spy in this action movie has not been\nreduced to such shameful acts.<br><br>Failing to abate nuclear launch codes from getting into the hands of a\nRussian madman, Cobalt (Michael Nyqvist), IMF frees operative Ethan\nHunt (Tom Cruise) from prison in order to prevent engagement of said\nnukes. <br><br>But when he and his team (Jeremy Renner, Simon Pegg, Paula Patton) are\nframed for an attack on the Kremlin, Ghost Protocol is enacted, and the\nteam goes deep undercover as known terrorists. <br><br>The fourth installment of the franchise, Ghost Protocol follows the\nprotocol of the 60s' television series: heavy team involvement, cutting\nedge cloak-and-dagger, and Cold War rancor. <br><br>However, any animosity between the two former super powers is best\nsaved for the women's figure skating event at Sochi 2014. (Green Light)<br><br>http://vidiotreviews.blogspot.ca/\n"},
{"review": "\nIt is no great or original story. It is quite straight forward with no\nreal surprises or hidden agendas.<br><br>It is, though, a great action movie ... and lots of that. Once in a\nwhile it has a little but good natural humor to it. The action scenes\nare beautifully filmed and some made me sit with tension at the edge of\nmy seat. The characters are well played by the actors, realistic,\nvulnerable and by no means invincible which just makes it all more\nexciting.<br><br>As said, there is nothing special to the story but that does not make\nit bad. It is an action movie and in that category it definitely is one\nof the best ones I've seen for some time.\n"},
{"review": "\nLike many action movie sequels, not much changes between movies except\nfor the intensity of the action and a different story to continue the\naction from. Unfortunately, this means that most do not really have a\ngreat deal of originality in them.<br><br>Some parts of the movie were actually able to surprise me but the rest\nof the movie was quite easy to predict. I did enjoy the action scenes\nand the all those fights and explosions but honestly, you see such\nthings in almost every action movie made.<br><br>In the entire movie, only one scene really astonished me because i\nnever expected it. Other than that, the only differences are the tools\nthey use and how they use them. <br><br>Characteristically like every other action movie however, there are\ncertain parts of the movie that are totally unrealistic and just absurd\nbut that absurdity is what attracts us to such movies. This is a sort\nof movie that I would simply watch for the excitement of the action and\nalso to \"kill time\".\n"},
{"review": "\nI watched M.I. on TV when I was younger,and I loved all of the\naction.The hot guys didn't hurt either. But the TV show was not as good\nas the movies are.Tom Cruise is by far the best Ethan Hunt yet.How ever\nI could never do the stunts he does,because Iam, deathly afraid of high\nplaces. That is my mom's opinion on the hit action movie! My opinion is\nI never watched the original series , but I have seen the movies all 3.\nAnd I can honestly say I loved them. Although I am not quite as\nadventurous as Tom is, some of the stunts are pretty risky . I guess\nthat is what makes him such a good action good hero especially for\nwomen! To sum it up we haven't it yet seen this latest addition to the\nM.I. series. But from what we saw in the trailers it looks pretty\nawesome!\n"},
{"review": "\nNot to be taken for granted; your expectations are amped as Tom Cruise\nreturns as IMF Agent Ethan Hunt in this fourth installment of the\nMission:Impossible franchise. Notable Brad Bird directs this\naction/adventure with vigor. \"Ghost Protocol\" goes into effect after\nthe agency is blamed for a terrorist bombing of the Kremlin. Hunt is\nleft out in the cold and must gather a new team consisting of Jeremy\nRenner, Paula Patton and Simon Pegg to clear the name of the Agency.\nHunt suspects members of the new team may have individual agendas; but\nthe group must trust each other to complete a mission with practically\nno resources or backup. Exceptional scenery and special effects; and\nbecoming the norm, Cruise does his own stunts. But then this project\nhappens to be the highest-grossing film of Mr. Cruise's career. Kudos\nto cinematographer Robert Elswit. The cast also features: Samuli\nEdelmann, Michael Nyquist, Lea Seydoux, Josh Holloway and Goran\nNavojec. You can't accuse this movie of being bland...just pure\nadrenaline...on steroids.\n"},
{"review": "\nMission Impossible: Ghost Protocol is the most preposterous, insane and\nillogical film you'll see this year. Yet it's also probably the most\nentertaining and exhilarating, with nearly every action sequence\nbringing something new to the now well worn formula. Brad Bird, the\ndirector behind The Incredibles and Ratatouille, really knows his way\naround a story. The clever script constantly surprises and Bird never\nmisses a beat while following the action. The story literally does not\nmatter(which is lucky because you've seen it before) when the action is\nthis fun. This high octane adventure will grip you from the first\nminute to the last. Just let yourself go and revel in 120 minutes of\npure, unadulterated fun.\n"},
{"review": "\nThis movie owes a lot of its shining value to Tom Cruise. He is getting\naged but his soul is backtracking when he shot the first MI. When I\nheard he did not accept using any stunt and did the action for himself,\nI could really enjoy his scene at the Dubai Burj Khalifa. But frankly\nspeaking, Ghost protocol is another MI, meaning nothing that special. I\nthink Mission Impossible attraction is on its unpredictable story and\nbrilliant and intelligent chase. High technique such as mask disguise\nand gum bomb reminded me of classic 007 movie, which I liked. But part\n4 Ghost protocol is going way too far. I can't understand all the\nmagics that the IMF agents are using. Well, people are aware of what is\nMI like already, so that's why I felt boring about those skills.\nNevertheless, with only one stunt scene at Burj Khalifa, this movies\nbecomes one of the best action movie in history.\n"},
{"review": "\nAfter a short hiatus, the Mission Impossiblr franchise is back. And\nyes, it's still a blast. <br><br>Mission Impossible: Ghost Protocol is the best pure action flick I've\nseen in quite a while. There were quite a few \"wow\" moments where all I\ncould do was stare at what was happening on the screen in amazement.\nIt's just a fun movie, through and through. <br><br>Any Mission Impossible fan will be pleased, and seeing it on the\nbiggest screen possible is a must. It may not can quite match the\nbrutally personal story and ruthless villainous performance of Philip\nSeymour Hoffman that propelled the third (and still best) movie (both\nplot and villain are fairly generic, here), but Ghost Protocol tops it\nas far as the action is concerned and proves that the franchise (and\nCruise himself) has lots of gas still left in the tank. I'd love for\nthis cast to stick around and continue the series. \n"},
{"review": "\nI'm writing this review because I'm tired of seeing self-styled\n\"reviewers\" who clearly haven't been paying attention ask questions\nthat were clearly explained in the film itself. <br><br>MI4 is a beautifully made action adventure thriller that ramps up the\ntension and showcases some stunning action sequences. All of the\nperformances are fine, there is not one weak member of the cast. The\nhumour is enjoyable and evolves naturally from the character dynamics\nwithin the team.<br><br>To set the record straight (spoilers beyond this point ) the opponent\nin the climax of the film is a formidable fighter because he's a\nSwedish former special forces commando. Not Russian. Swedish.<br><br>Watch the movie if you're trying to pretend your reviews are worth a\ndamn.\n"},
{"review": "\nThis is an absolutely thrilling and engaging movie from start to\nfinish. It's intelligent and well structured and although wild, not so\nmuch so as to make it unbelievable or cartoon-like. For me, this is the\nbest Mission Impossible movie of the four in the franchise. How many\nfranchises can you say that about and mean it? I'm not a big fan of\nreal life Tom Cruise but putting that aside, he proved that he still\nhas the action chops with this late year gem. The nods to the previous\nfilm were well done and added depth to the overall experience. It's a\nvery enjoyable thrill ride and one of my favorites of the year. I\nreally didn't see that coming at all.\n"},
{"review": "\nWhat can I say? It's a fast paced, over the top action film with rapid\nediting and information thrown at you just as fast as Tom Cruise can\nrun and fly through the air.<br><br>It's got everything you would expect. It also has good acting, good\ndialogue, humor, great sets and stunts, breathtaking photography and of\ncourse, a cool car near the end. <br><br>It isn't something I would watch again. Films like this throw a lot of\ninformation at you and after a while I personally didn't even try to\nkeep up with the story or the details. I just watched the film and\nenjoyed it. It is enjoyable. Just not something to sit through twice\nunless you need almost 3 hours of mind numbing action. <br><br>It sounds so uncool to say this but sometimes I wish they could pull in\nthe reigns just a bit. Just a bit less information, a bit less action\nand of course, the actors can survive any injury and still go on. A bit\noverdone but still fun.\n"},
{"review": "\nMI 4 GhostProtocol.. I watched this movie on the second day after\nrelease with normal expectations as for as a MI movie I would say it\nwas a good movie with the needed ingredients for a MI movie.<br><br>With solid performances from Tom Cruise the movie gears up and goes\nfrom Russia to Dubai then to India and finally to United states with\nlots of surprises and adventures filled ride.<br><br>I recently read in a newspaper that Tom has said \"what people expect\nfrom me is entertainment and thats what I am giving \" true sir the\nmovie was an entertainer so watch MI fans don't see so much logics you\nwill surely enjoy it.<br><br>Bottomline: Burj Dubai scenes was cherry over the ice-cream.<br><br>I am giving 8/10 for a solid entertainer\n"},
{"review": "\nThis is simply the worst Mission Impossible movie I have ever seen, and\nis among the worst Cruise had acted in. Looks like the production team\nhas run out of ideas to introduce new action scenes and so many things\nseems dysfunctional. Cruise should stop the franchise, as it is taking\naway the good memory of earlier MI movies. The movie is bad in action,\ndoesn't seem any thrill in the movie at all and the characters it feels\nwere given the movie script on the day movie scenes were supposed to be\nshot. Maybe just like some other series like James Bond or The Bourne\nseries Cruise should be replaced, which seems not possible. I really\nthink Cruise is loosing his charm and his age is catching up to him\n"},
{"review": "\nMI-4 is another irritating action movie that thinks its cool because it\nhas Tom Cruise climbing on a building and concept cars. This movie\nlacked any type of plausible story. Of course it makes it's adversaries\nlook like idiots and has a really annoying comic relief electronics\nman. I really hate when script writers think that making everything go\nwrong builds tension. Tension is built by having smart characters do\nsmart things and still the hero comes out on top. This movie makes it\nlook like spies go into the field with lots of faulty equipment. These\nitems would be throw away by Bond's Q. I guess it's just par for the\ncourse for these movies, the first one was the only one that carried\nany weight in the spy genre.\n"},
{"review": "\nSo,I'm not a well educated movie critic,or writer. I saw this movie a\ncouple of days ago,and must say it was probably the best action movie\nreleased in a while. Tom Cruise did again a great job,as well as the\nother solid actors. The settings in Moscow,Dubai,Budapest,Mumbai were\nsuperb,almost breathtaking. Of course as all \"spy - agent\" movies there\nwere a bit of cliché and unrealistic scenes.<br><br>To be short I would recommend this movie to anyone who likes\naction,thrilling locations and of course special agents.<br><br>I'd give it a solid 8 in it's genre category,and I would give a good 9\nfor acting.\n"},
{"review": "\nMission Impossible - Ghost Protocol delivers, as promised, a burst of\naction in a plethora of locations. Here's what KIDS FIRST! Film Critic,\n15-year-old Gabriella Chu has to say about it: <br><br>The IMF is blamed for the bombing of Kremlin, so Ethan Hunt and his\nteam try to get back their reputation by preventing a nuclear missile\nfrom killing everyone on Earth. Can the team undertake this impossible\nmission? <br><br>Mission Impossible: Ghost Protocol is a quick-witted picture fast on\nits feet. From the beginning, I was on the edge of my seat. Scene after\nscene, Hunt and his team are on the move. There are so many cool and\ninventive high tech gadgets in the movie combined with breath-taking\nvisuals, making it even more intense. <br><br>I recommend this film to teens 13 and up. Mission Impossible: Ghost\nProtocol is a wonderful cinematic experience filled with action, and I\nthink almost everyone will enjoy its fast pace. <br><br>Video review available here: http://www.youtube.com/watch?v=pvBJgxq5pU0\n"},
{"review": "\nI know it's so lame to watch 4th part. I didn't even watch 2nd and 3rd.\nBut i had to see something thrilling after a disappointment with boring\nHugo... Hey, who are you to judge me? lol A lot of you will say it's\njust another James bond or Bourne identity movie and i'll say you are\nright. However, Mission impossible has great acting, great gadget and\nsome new \"magic tricks\" by undercover agents... It's a safe bet for\nthose of us hungry for a good movie theater night...And the film does\nsurprise us with the sub-story where agents are also humans and friends\nand not just cold-blooded brain-washed contract killers... You will\nremember the ending...\n"}
]