[
{"review": "\nIGNORE THE TRAILER: GO SEE IT!<br><br>I saw this movie tonight with a friend and it was spectacular. Going\nin, I was excited as a life-long Disney fan but also expecting a\nsomewhat cheesy good-vs-evil type of movie based on what I had seen in\nthe trailer. I couldn't have been more wrong! Angelina Jolie delivers\nan amazing performance and makes a well-known, previously rather one-\ndimensional Disney villain relate-able and more sympathetic, while also\nmanaging to look like a convincing, gorgeous, magical creature.<br><br>The CGI is a tad heavy and a little freaky at times (such as the three\ncoloured pixies/Aunts) but was used, in combination with some amazing\nsets, to create a fantastic world and creatures which were reminiscent\nof the beautiful and imaginative work in movies such as \"Hellboy 2\" and\n\"Pan's Labyrinth\". The effort by the art team here really helps to draw\nyou into Maleficent's world at the beginning of the movie and makes you\nwish you were a kid growing up with this movie as fodder for your\nimagination.<br><br>Although Maleficent's character has been humanised in this re-telling,\nthe story really emphasises that she isn't human at all, and explores\nthe ins and outs of her life and how she relates to the humans she\nencounters.<br><br>The plot for this movie really fits into the current trend of exploring\nthe anti-hero (Breaking Bad, Hannibal...) and shows that Disney is\ntrying to break with its past depiction of characters being black and\nwhite, good or evil, etc.<br><br>I feel like I am gushing over this film, but as a Disney classic lover\nI have been truly impressed by what is sure to be a new favourite with\nkids and adults equally. I do expect some controversy over parts of the\nfilm but I won't discuss those here.\n"},
{"review": "\nThis film is a TRUE fairy tale. It's dark. It's raw. And it's written\nfrom the dark, raw experience of women. <br><br>Maleficent is about what happens when your Prince turns into a Frog.\nIt's the personal, inner journey to recover from a physical trauma and\nemotional betrayal by those who are closest to us and who we trust the\nmost. It's about how to survive that type of horrific evil without\nbecoming evil yourself. It's message is that profound.<br><br>The critics complaining about this film want \"fairy tales\" to stay in\nthe same \"one-love-fits-all\" mode where people are either good or evil\nand that all one needs is to find \"romantic\" love and marry a \"good\"\nPrince or Princess, and you will live \"happily ever after,\" safe from\nany pain or sorrow. But real life is a lot messier than that.<br><br>It's actually evidence of how rare it is to see women's unfiltered\nsubjective emotional landscape portrayed on film that it seems many of\nthe critics cannot even wrap their brains around it! <br><br>No matter. This film is so sensually visually stunning and viscerally\nemotionally cathartic that sheer word of mouth enthusiasm is going to\nmake this a blockbuster, no matter what the critics say.<br><br>And it's equally rare to see a protagonist whose inner landscape is\nmore complex than simply extracting revenge, destroying their enemies\nand...roll credits. People are more complicated than THAT fairy tale we\nare sold in every other \"action\" and \"adventure\" film that only serves\nto reinforce the psychopathic values of revenge and bravado.<br><br>Sometimes a film is so ahead of its time that the critics are behind\nand so philosophically deep that it's message is incomprehensible to\nthe more superficial among us. This is one such film.<br><br>Woolverton and Jolie have crafted a masterpiece.<br><br>Don't miss it.\n"},
{"review": "\nEvery true fan of the original Sleeping Beauty (1959) was skeptical\nabout this and how much it had to deviate from the actual movie, and as\nmore of the movie was revealed, it was only proving to be another\nfemale empowerment, victimized villain kind of a movie. But I'm glad I\nwas wrong, for I'm sure only by watching the whole movie can we truly\nappreciate and understand the very convincing back story and\ndevelopment the character was subject to. Of course with very liberal\nchanges to the original plot, the key elements that you'd look for are\nintact. Need I mention the perfect casting of Angelina Jolie,\nMaleficent truly comes to life in full form by Angelina's stunning\nskills and presence. A twist that's not cliché, sentiments that are\ndeep, humor that's ever so natural and action that always keeps you at\nthe edge of your seat! Maleficent in this movie is not exactly as we\nknow of her from the few minutes we got to see her in the original\nmovie, but let me tell you she's every bit deliciously evil. It was\namusing to see Angelina play a role that requires a lot of nuances to\npull of this character with a lot of depth as opposed to the\none-dimensional character from the movie. Never letting off the grip,\nshe carried the movie on her shoulders. Nothing to take away from the\nbeauty of the rest of the movie which takes breath with excellent\ndirection and visual effects that will truly transport you to another\nworld, and the amazing work by all the 'supporting' actors. Yes, the\nother characters weren't as fleshed out as Maleficent, but I see that\nas good thing, given the title and theme. A spectacular balance. I'd\nalso like to bring light on the enchanting score, thanks to James\nNewton Howard, this maestro is underrated.<br><br>A comprehensive movie, there's a little something for audiences of all\nages, truly a masterpiece.\n"},
{"review": "\nMaleficent is magnificent. The story is sophisticated enough to delight\nadult audiences with a brilliant take on the beloved tale with a\ndelightful twist including the meaning of true love. The characters are\nsympathetic and there is enough excitement.<br><br>The art direction and cinematography are beautiful. The fairy land\nscenes resemble a pre Raphaelite painting. The castle was a bit generic\nCGI. The right blend of human faces with CGI so it didn't look too\nanimated. The director Stromberg who did Oz the Great and Powerful did\nan even better job here.<br><br>Angelina Jolie's expressive face is the perfect showcase for the\ncharacter - it is the role of her lifetime. Like the way they did her\ncheekbones to make it like the Disney cartoon. Sam Riley as her\nsidekick morphs into many fairy tale creatures crow, dragon horse. The\ncreatures are well done not awkward in movement and not overwhelming.\nElle Fanning is sweet and picture perfect for the role of Aurora and\nBrenton Thwaites plays her prince. The fairies including Juno Temple\nand Imelda Staunton are cute too.<br><br>Liked this more than the Snow White movies 'Mirror Mirror' and 'Snow\nWhite and the Hunstman'. The first was fun but a bit silly and the\nsecond was too grim. Maleficent is the perfect blend of excitement and\nfairy tale. Most enjoyable film of the year.\n"},
{"review": "\nI have waited a long time for this film and it did not disappoint!<br><br>The film is very entertaining with stunning visuals and impressive\naction scenes. This is definitely Angelina's film and she is incredible\nas Maleficent.<br><br>Supporting cast are also impressive and Elle was perfect casting for\nAurora. The 3d was also good and really did enhance many scenes. The\nscore by James Newton Howard really blew me away and adds magic to the\nfilm.<br><br>My screening was all made up of adults which surprised me. The trailers\nfor the film really give the film a dark tone, however the actual film\nhas many light Disney moments. <br><br>I highly recommend this film and the 3d is worth paying a bit extra!\n"},
{"review": "\nLet me start by saying that Maleficent has been a personal favorite of\nmine when it comes to Disney villains. Throughout her many\ninterpretations, she has simply been Evil (yes, with a capital E). So\nforgive me if this review is a bit of a rant.<br><br>In this adaptation, she is reinterpreted as a good fairy (because she's\napparently not a human sorceress anymore?) that simply has a hissyfit.\nShe is certainly not evil - just angry for a little while. She even\nends up becoming a Godmother??<br><br>Even King Stephen's character is butchered. Why does he go insane over\nher? If he were really the bad guy, why wouldn't he have killed\nMaleficent when he had the chance? What possible reason does he have\nfor being indifferent about the welfare of his daughter?<br><br>Speaking of Aurora, it's worth mentioning that she is relatively\nalright, but still not too close to her original character. A petty\naesthetic thing about her is that her hair and eyebrows are not the\nsame color, which is really distracting. <br><br>Additionally, they rehash the concept from Frozen, which is that 'True\nLove' doesn't have to be from some man. If this trend continues from\nDisney, all we'll see is sisterly/Godmotherly/family love movies where\nRomance is thrown out the window because it apparently doesn't end with\na \"happily ever after\" anymore.<br><br>Overall, this film was simply horrible if you respected Maleficent as a\nvillain. If you did like Maleficent as she was, I don't recommend\nseeing this movie. Even if you like the idea of there being no such\nthing as Evil, I urge you not to see this movie. Don't support the\npeople who made it.\n"},
{"review": "\nIf you like fairy tales and believe in love then you'll hate this film.\nIt's beautifully filmed and well acted by Angelina Jolie, but the story\nis so over the top with the male hatred it becomes ludicrous.<br><br>By the end of the film I just started laughing at how insane it was.\nMade me think the writer just had to be a woman and she must have\nsuffered the worst break up in history, or else she just really hated\nmen.<br><br>I was looking forward to seeing this film ever since it was teased in\ntheaters. Now I wish I had my money back.<br><br>Some may say this film is like Frozen. That's only if we discovered\nChristoff was actually in league with the evil Prince and Olaf was\ntheir spy.\n"},
{"review": "\nWent to the theater, expecting to experience the dark side of Angelina\nJolie who plays a vengeful fairy with lofty wings and left the theater\nfeeling astonished by how beautifully the movie has changed my\nperspective towards the antagonist.<br><br>The remake of the classic Disney movie, \"Sleeping Beauty\" timely and\nsoundly pans out by wonderfully depicting both beautiful and gloomy\nsides of fairy land of Maleficent that feud with selfish humans. The\nVisual effects and acting are so magnificent that mysterious creatures\nand the cast look totally in sync. The plot naturally goes along with\ncoherent and succinct narrations that add an in-depth storytelling. Not\nto mention a good composition that captures significant moments without\nboredom. <br><br>There are a lot more to feel, enjoy, and learn from what I would call,\n\"One of the most underrated movies of the year\" based on how the score\nis given. Not a Disney movie fan? Doesn't like a female protagonist? I\ndon't think it will matter because once you start watching, you will be\nmesmerized by the imposing world and the ambivalent emotion of\nMaleficent.\n"},
{"review": "\nThe movie is not worth, keep your kids from seeing this movie unless\nyour want them to be disappointed and very confuse. Is a terrible\nchange of something that was a beautiful master piece. Incredible to\nsee and believe that the own owner of the Sleeping Beauty (Disney) is\ndestroying what everybody has come to love for generations. <br><br>I was very looking forward to see the movie since Disney has a good\nrecord on movies, although some of the last one has not been very good,\nincluding this one. But for example if you saw Frozen you though Disney\nis back to creativity and beautiful long lasting history that passed\nthru time. <br><br>This movie Maleficent is not one of them, you won't be attract to even\nrepeat it nor less read it to your daughters as a bed time story Maybe\nif Disney Management could use the imagination so much they promote to\nyoung ones they could it come up with a new history no one has ever\nheard before and could sell it. But for what reason will Disney\nCorporation will destroy what is already a proving time after time\nyears after years mom to girl, princess to princess beautiful story,\nwhere the Prince rescue the Princess, The King Father and Queen Mother\nlove and protect their daughter and the bad witch lose and is destroy\nby the goodness. <br><br>And them the Prince and Princes Leave Happily Ever After. <br><br>If only Mr. Walt Disney were alive to see of what His Disney World has\nbecome.\n"},
{"review": "\nI had my doubts before, but now I am sure if it.<br><br>Disney has sold out. <br><br>Recently Disney has been releasing films that, whether the public\nchooses to acknowledge it or not, have been paint-by-numbers at best.\nFilms like The Lone Ranger, Thor The Dark World, and Frozen. Yes,\nFrozen. It's the same Disney crap you've seen over and over, people.\nDon't get me wrong, I LOVE Disney. But not THIS Disney... one that\nwould butcher one of its own beloved fairy tales to make a quick buck.\nYes, you heard right. Disney did stoop that low. I should have known\nthat this film would be garbage from the get-go when they hired Alice\nin Wonderland writer Melissa Woolverton to pen the screenplay and Alice\nin Wonderland production designer Robert Stromberg to direct (Are you\nsensing a pattern here?) Let's touch on that for a moment-- The Mouse\nHouse, in its infinite wisdom, got a PRODUCTION DESIGNER/VFX SUPERVISOR\nWHO HAD NEVER DIRECTED ANYTHING TO DIRECT THEIR $200 MILLION\nBLOCKBUSTER. As a result, Maleficent's beautiful visuals carry no\nweight, and the actors for the most part seem utterly lost. Because\nwhat the hell would a set designer know about directing actors? Even\nAngelina Jolie can't pull off her real emotional scenes because she is\nleft to direct herself. What really sank this movie for me was Disney\nblatantly ripping themselves off and using the \"true love\" twist from\nFrozen. Literally THE EXACT SAME TWIST. I have no problem with Disney\ncreating a strong independent heroine... but if you're going to do\nthat, Don't have your heroine wear a skintight leather black cat suit\nin the climax of your movie! In short, Disney has definitely lost its\nmagic, and it's going to be tough to get it back. Don't listen to the\npositive reviews. Remember how glowing Alice in Wonderland's were when\nit first came out? You have been warned.\n"},
{"review": "\nThis movie is a complete joke, the only thing going for it is the\nvisual effects, In the 1959 Disney classic Maleficent is the mistress\nof evil and she was perfect in that role but in this nonsense movie she\nis a good person? her name does not seem good at all!<br><br>Also I want to write in some details why I did not like this movie and\nwhy the story was very weak in my opinion. First why is King Stefan\nevil? why did he send Aurora to live with the three fairies until she\nis 16? is he crazy? the curse stated that she will go into a sleep like\ndeath when she is 16 so why the hell will he send his daughter away all\nthose years and never even visit her? he could have made her live with\nthem until she is 16 and protected her in the castle or told the\nfairies to come and protect her on that day.<br><br>and coming to the fairies they portray them as idiots! the good fairies\nare idiots? and Prince Philip is not the true love of Aurora? what\nnonsense! finally the motherly kiss of Maleficent lifts the curse? she\nput it on in the first place!<br><br>and finally Maleficent kills Stefan (Aurora's father) and Aurora is\nhappy about that? what the hell?<br><br>Really a silly movie, I gave it 2/10 just because of the CGI which\nHollywood seem to think that this will save all movies not good writing\nand casting!\n"},
{"review": "\nI am very mixed about this film. Firstly, as many critics have singled\nout, I must praise Angelica's acting, mainly as the first good, then\nevil Maleficent. Now, while I could feel a little sorry for her being\nunable to bring this curse off Aurora, having to see, one of my best\nvillains, Maleficent turn back into good is just unnatural. It ends up\nlooking like a beloved Disney film that has been changed for the sake\nof young girls, who is only a little part of the audience, avoiding\nsimple but effective scares and risks, basically throwing out what many\nDisney fans remember about Sleeping Beauty. Parts of the film echoes\nparts of Wicked and Frozen. Of course, most people don't rush into\nromantic relationships but seeing Disney seemingly apologise for making\ntraditional relationships in past films happen, even though this is\nwhat happened in the era the film is set, is just horrid. I mean no\noffence to Frozen at all, since it is one of my most favourite Disney\nfilms of all time. But stealing the concept of real \"true love\" from\nFrozen is pathetic. If it wasn't for Disney with its stupid audience\nresearch, it could have easily looked even further into the darkness of\nMaleficent, which is almost no such thing in this film.\n"},
{"review": "\nReview: I really thought that this was going to be a typical Disney\nmovie about fairies and magic dust, but I really enjoyed it. Although\nthe storyline is based around Sleeping Beauty, I found it quite dark\nwith some adult content. The CGI throughout the movie looked impressive\nand Angelina Jolie played her part extremely well. After being betrayed\nby her loved one, she turns quite evil and full of hate, but once\nAurora comes into the picture, you get to see an inner sweetness which\nmade her character entertaining and a joy to watch. Pieced together\nwith Sharlto Copley playing the villain, this movie really did have\nevery aspect covered and I'm not surprised that it made so much money\nat the box office. A Great Watch!<br><br>Round-Up: Angelina Jolie really doesn't make that many movies anymore,\nbut when she comes out of the woodwork, she really does come out with\nsome good movies. From Changeling to the action packed Wanted, she\nreally does have a versatile acting ethic and with all of her\ncharitable work and her hectic family life, I'm not surprised that\nmaking movies is low down on her priority list. I liked the chemistry\nbetween her character and Sam Riley, who played the crow, and the\naction scenes were very well thought out by the director. Personally, I\ndon't think that it's a movie for the young ones because there are some\nscenes that will give them nightmares, but there are some scenes they\nwill enjoy, like her magical land and the amazing creatures. In all,\nI'm surprised that I enjoyed the movie because I really wasn't\nexpecting something so dark.<br><br>Budget: $180million Worldwide Gross: $757million (WOW!)<br><br>I recommend this movie to people who are into there Disney movies which\nare based on the concept of Cinderella. 7/10\n"},
{"review": "\nDidn't expect a masterpiece going in, but exited realizing \"Maleficent\"\nis one of the best, most beautiful films I've ever experienced.<br><br>It is superlative in every way; executed with meticulous care by\nexperts at every level: screen writing, casting, art direction,\ncinematography, production design, producing, lighting design, CGI,\nstunt coordination, acting and directing.<br><br>Shot after stunningly lit and composed shot, the film is a visual\nclassic from opening to fadeout. If you know even a few basics of how\nthings are done, there are moments where your jaw drops open - and\nstays there - in amazed appreciation for what this team accomplishes.<br><br>It veers delicately, sometimes like lightning, from warmth to laughs to\nconcern to sorrow to tears to majesty and back again; building,\nbuilding to one moment (just before the magnificent climax) that you\nsuddenly know / hope is coming - about ten seconds before it does -\nwhich makes it even more magical and earns your gratitude for what\nthey've done with this timeless fairy tale.<br><br>Every inch of the huge 3D screen displays an unbelievably rich\ncollaboration in the joys of virtuoso film making destined to last as\nlong as Disney's original, delivered by artists at the top of their\ncrafts.<br><br>Above them all: the remarkable Angelina Jolie (who also co-executive\nproduced).<br><br>A milestone in its genre!\n"},
{"review": "\nThe Good: 1. Angelina- she was great. 2. Elle fanning was a very cute\nAurora. 3. Sam Riley was great as Diaval. 4. Brenton Thwaites as the\nyoung Prince Philip. SORRY FEMINISTS, BUT ROMANTIC LOVE IS THERE AND\nTHE AURORA/PHILIP RELATIONSHIP IS TREATED LIKE TWO HIGH SCHOOL KIDS\nASKING OUT THE PERSON THEY HAVE A CRUSH ON FOR THE FIRST TIME! <br><br>The BAD: <br><br>Oh my goodness, the people's motivation for trying to kill Maleficent\nand raid the Moor land is not convincing. Why was treasure so important\nto them that they did not care for anything else? Why did Stefan value\nbeing king over Maleficent? He has to be the worst Disney villain ever!\nSometimes, you are made to think that he wasn't an all out evil bad\nguy, but the script writers seem to ignore that. <br><br>Another thing. I think this movie would have been better if Maleficent\nhad been a dark sort of character at the beginning rather than a sweet\nlittle girl. Someone who was redeemable but still had the potential to\nbe the \"mistress of ALL EVIL!!!!!\" we all knew from the first film. <br><br>Can Once Upon a Time cast Angelina as Maleficent and do a better job at\nwriting her backstory???? Please, it was bad writing until the\nchristening scene that hurt the film. After that, the movie got good.<br><br>P.S. Where was King Hubert?????\n"},
{"review": "\nMaleficent is Disney successfully cashing in on popular characters it\nhas the rights to along with Angelina Jolie's star power (she plays the\ntile character). Making an artistically valid film is secondary. On the\npositive side, occasionally the production design is inspired, and the\ncostume design is nominated for an Oscar. However, the writing is\nincredibly lazy, and the plot has no consistency or logic. For\ninstance, Maleficent's constantly changing motives make very little\nsense, and her relationship with Aurora is pretty ridiculous. Also, her\npowers make absolutely no sense. Lastly, the crow/changeling character\nis pretty pointless.\n"},
{"review": "\nWhile it may be hard for younger readers to imagine, the Disney Studio\nhas not always been God-like, there were times when it seemed they had\nexhausted their creativity.<br><br>That was then. This is now. An influx of talent, inspiration, and a few\nwell-chosen corporate takeovers have put Disney back at the top of the\nheap. And this film is not merely entertainment but a flexing of those\ncorporate muscles, especially after the worldwide success of Frozen.<br><br>Note the quiet arrogance in re-imagining a story which the studio\nitself had made archetypal. Try pulling that off in film class.<br><br>And if they don't create an Oscar category for best cheekbones, they\nshould. Many actresses in Hollywood will tell you that they could look\nthat good with prosthetics. They lie. To look that good you have to\nSTART with the best face in Hollywood.<br><br>In deference to critics, the second Act of the film simply does not\nmaintain the wonder and innovation of the start; and Elle Fanning, a\nfuture actress of great promise, seems slightly lost in an\nunder-written part.<br><br>Still, this film is a major achievement and destined to delight\nchildren for generations to come.\n"},
{"review": "\nAs a man who prefers science fiction to fantasy, I was pleasantly\nsurprised by this superb film. It is a re-imagining of the classic\nfairy tale 'sleeping beauty' (at least I think so, as I have never read\nthe original tale in the original language, and it may be that the\nDisney version with which we are all familiar is, in fact a\nre-imagining). The film is superbly directed; finely scripted, well\nacted, and is a joy to watch. The special effects are excellent, but\nare not overused. They are there when needed, and are spectacular,\ncreating a magical world we can all appreciate. However, the thrust of\nthe film is the changing relationships between the main characters,\nwhich are sometimes surprising and key to the story. Preconceptions\nfrom the accepted version of this story are overturned, and the altered\nrelationships between the core characters provide a satisfying basis\nfor a reappraisal of the whole concept of the story. This is a film\nthat everyone should see, because I believe that almost everyone will\nenjoy it. I have no hesitation in recommending this to all viewers, of\nall ages.\n"},
{"review": "\nLiterally the worst movie I have ever watched in a theatre, I was\ntempted to walk out.<br><br>The writing in this movie was God awful, and that's not even just the\ndialogue. The plot is inconsistent and lacks all sorts of background.<br><br>Iron burns fairies, but why? It allows Stefan to easily remove her\nwings, burns her a couple times, but then an iron net is thrown on her\nand it no longer burns her, it acts like kryptonite and simply weakens\nher. Then she gets her wings back and the chain is thrown around her\nankle and it's neither burning her foot off, or weakening her. Her\nwings? are they the source of her power? because it's never said.<br><br>Character writing is horrible, aside from Maleficient, Diavel and\nAurora, every character is a complete idiot. Nobody is able care for a\nchild, the three pixies are CONSTANTLY ignoring this child, gone for 18\nhours at a time and they don't even notice. On that note, WHY did\nStefan put Aurora in their care? They were flung aside as if they\nweren't even there when Maleficent walked in to curse Aurora, obviously\nthey were absolutely useless when it came to protecting her, and they\nliterally just met these creatures, better trust them right? Stefan was\nstill sane at this point, but apparently has no fatherly emotion.<br><br>\"Sleeping Beauty\" was asleep for about 3 hours, tops. The girl had a\nshort power nap and was labelled as Sleeping Beauty? Absolutely absurd.<br><br>Angelina Jolie tried her best to make this movie passable, but she just\ncouldn't do it. The writing was some of the worst I've ever seen and\neven with 100% star studded cast this movie still would've been\ngarbage.<br><br>2/10. Do not watch.\n"},
{"review": "\nJust had the pleasure of watching this. I was quite skeptical to begin\nwith, I thought it would be the stereotypical story about an evil queen\nwho'd taken over all the land to be defeated by some kind of hero\nbecause I'd never heard much about Maleficent's character before this. <br><br>And I had a feeling there'd also be a typical la-Dee-da love story too\n(due to the whole sleeping beauty story) but I was so pleasantly\nsurprised and warmed when the twists came.<br><br>It is such a beautiful film, with a good feel/heartwarming ending. <br><br>And I was so over joyed that there's going to be a sequel. Roller\ncoaster of emotions. Must watch.\n"},
{"review": "\nYou know, when our treacherous lover-boy, Stephan cut off Maleficent's\nmassive wings (which was certainly no small undertaking), I sure wish\nthat he had also hacked off those damn annoying antlers... I mean,\nhorns of hers, as well. Those 2 blasted things protruding out of her\nhead really began to bug me, big-time.<br><br>Yeah. I sure wish that someone in the story had done us all a big\nfavour and snapped those stupid horns off, right at their base. I\nreally do.<br><br>And, while I'm thinking about it - Do you suppose that the casting of\n\"plain-Jane\" Elle Fanning as the cute (but definitely not beautiful)\nPrincess Aurora was intentional? I think this was deliberately done so\nas not to allow a real stunningly gorgeous, young actress play the\nAurora part and thus cast a dark shadow over Jolie's cold-as-ice\nbeauty.<br><br>Yeah. I think there's more to this whole side of things than meets the\neye. Don't you? <br><br>Anyway - I thought this atrocious $180 million production was one of\nthe most irksome, petty and truly demented stories of revenge ever\ntold. It really was.<br><br>Yeah. And, speaking about Angelina Jolie - After all of these years as\nan actress, Jolie (now 40) still only comes across to me like some sort\nof a bumbling, second-rate amateur, and nothing more.\n"},
{"review": "\nI absolutely loved this film and the fairytale scenes. Plus I'm a huge\nAngelina Jolie fan. She made a gorgeous evil Fairy Godmother. I loved\nthat this film gave a character that is supposed to be evil a new\ninsight in to why she became wicked. Not only did the film give a\nreason of why she went from being peaceful to evil it gave Maleficent a\nchance to redeem herself. Not many films or even in life are people\ngiven that opportunity. I heard some bad comments on this film and so I\nthought film was not going to be as good as I imagined it to be. But to\nmy surprise the film was excellent. It had many unexpected plot twists,\na lot of action, and showed a different take on the definition of true\nlove. Both young and mature audiences will appreciate this story\nbrought to life via film. Great views on greed and great references on\nhow society can and should live together in harmonious relationships.\n"},
{"review": "\nWife took me to see this just now on father's day. This is a cinematic\nmasterpiece of storytelling. A film of visual beauty and fantasy. Takes\nyou to that place The Hobbit and Lord of the Rings does with it's\ncinematography and music score. Angelina Jolie is magnificent and is\nstill one of the top 10 greatest actresses in film. She delivers a\ngrabbing emotional edge of both good and evil. I can't say anything\nmore or it will be a spoiler but this movie will take you places few\ndare to take on chance on. This movie does not follow the standard\npredictable formula and it's nice to see a story that reinvents itself\nin a classic way. I will say this to all of the critics bashing this\nfilm \"retire and do us all a favor\". We need more films like this and\nDisney is blowing the lid off the honey pot and proving that we want\nmore films like this with both story and visual effects. Steven\nSpielberg and other filmmaking legends should be so proud they are\nbecoming more involved to set the industry back on track the way it\nshould be. So much \"trash\" coming out to make studio money and leaving\naudiences simply drained of hollow storytelling. Bravo Disney and you\nguys keep doing them all like this and I promise you the money will\ncome as a reward for it. This movie is right up there with Oz the Great\nand Powerful, Lord of the Rings, and other classic fantasy films. I\nwill definitely be adding the director along with Angelina to my list\nof favorite producers and directors. This is exactly how you do it\nfolks. This is filmmaking at it's absolute best. Malificient is a\nmoving, gutsy, imaginative, visually stunning piece of priceless art.\nAnything lower than 10 stars feels like madness to me. Thank you for\nthis film. ~ S A Storyteller\n"},
{"review": "\nAs a 9 year old child watching Disney's animated Sleeping Beauty I saw\nMaleficent as an extremely beautiful villain despite her evil nature. I\nlove how this movie, combining live action with CGI, completely re-\ninvented the Sleeping Beauty story allowing Maleficent's character to\nchange throughout the movie giving her more depth as well as portraying\nthe male characters differently from the original fairy tale. I do not\nwish to put too many details in my review that might spoil it for those\nwho haven't seen it yet but I wholeheartedly recommend this movie to\nanyone who has fond memories of the original 1950s animated version. I\ntruly believe you will find this movie most interesting at the very\nleast.\n"},
{"review": "\nPros: The change of Story -<br><br>This film is great as it approaches the take on Maleficent in a more\nrealistic way compared to the Disney Animation movie Sleeping Beauty.\nIt was interesting to show Maleficent as the hero in the end and that\nshe delivered true love's kiss to Anora and not the prince.It would\nhave been stupid to show the prince kiss her and let that be true love,\nbecause its unrealistic as he didn't know her and therefore is not true\nlove. The story showed what true love is - Maleficent cared about Anora\nand understood her. So, that was interesting and well done. <br><br>Cons: <br><br>1. Well the story did good on the change but it felt fast paced and\nunstructured, and more could have been shown in there. <br><br>2. The world felt small and restricted the people involved. For\ninstance, the prince came from another kingdom which was never shown. <br><br>3. The action scenes were boring, especially the last scene with the\ndragon. In the Disney Animation the dragon scene was made to feel epic\nand huge but here it felt small and really rushed. There was no\nsuspense in the scene.<br><br>Overall:<br><br>I liked it! It was Great, could have been better though.\n"},
{"review": "\nInteresting and a fantastic film, because different visual effects. It\nshows different tales and the wicked witch by shows. In fact,there is\nno villains in the movie.Have the results of past mistakes. Angelina\nwas different from the classic film. I think it was really good movie.\nThe end of the film was different and creative. It was a film that\nexcites me. Maleficent's wings are very realistic. Horns made her\ndifferent, but the film should slightly improve.Angelina Jolie's acting\nis very good. Costumes were very successful. It worked carefully on\nthis issue. A family film that should be followed. I would definitely\nrecommend this film.\n"},
{"review": "\nFirst; I would like to complement the photography and CGI effects.\nSimply stunning - even if I only saw it in flat format. I am sure 3D\nwas magical. Second; Angelina is superb as the betrayed angst ridden\nrevengeful elf-witch which redeems herself. Her body and face are\n'naturally' made up to be other-worldly looking. Bravo. The\nsuperlatives earn the 'deux points'. It is all downhill from here.\nAurora is portrayed as a plain village idiot with an age of 6 though\napproaching her 16th birthday. She is soppy as cold soup and zaps away\nany magic from the movie . I understand nobody wanted to play second\nfiddle to Angelina - but there seems to have been a stampede. The king\nis just plain incompetent at being a father, king, warrior, and at\ndestroying spindles and wings. He is incompetent at being evil - just\ncontemptibly irritating. His choice of baby sitters proves the point.\nThe fairies are beyond dumb, dumber and dumbest to be funny. The\nsidekick raven-man is a non-starter as a character. The prince Charming\nfizzled as a footnote to the story. Without character interaction, no\nstory holds any interest whatsoever - ask my grandma. A timeless tale\nwas savagely pruned to the trunk. Finally; just who was this movie\naimed at?? It is too violent for kids.(PG my foot) It is too boring for\nadults. The 'twist' on the story could be seen a mile off. I was left\nwith a bad feeling that this movie was a poorly disguised feminist\nvehicle.\n"},
{"review": "\nDoes anyone realize that this is an alternative (false) story for\nSatan's history with God? It is an excellent piece of fiction, and\nsuperbly produced and well-acted. But the embedded message is laden\nwith blasphemy (or simply subtle mockery of the entity that some people\nknow as God), and sympathy with the entity that some people know as\nSatan and empathy with Satan's claims about God.<br><br>Angelina Jolie represents Satan. I leave the rest for smart people to\ndecipher and recognize.<br><br>By the way, these comments have nothing to do with a specific religion\nand the writer is not even a Christian. Even an atheist who heard the\nfew stories told about what happened between God and Satan can still\nunderstand what I'm talking about, and in the end, all versions can be\nfiction to him or her; understanding that this is a \"version of Satan's\nstory\", an alternative version to empathize with the entity, is enough.\n"},
{"review": "\nI don't hate this film, but the idea of giving Maleficent a background\nstory is absurd, she is one of Disney s most iconic villains her name\nis Maleficent it means doing evil simple as that, theirs no need to\nstretch a story around it,the movie wants to make it a misjudge\ncharacter that she was good at the beginning and that events that fold\nmade her evil, all the time her name is Maleficent,when she was a kid\nher name was beneficent and she changed it when she became ¨evil¨ as\nthe movie wants us to believe i would have bought it, Angelina Jolie is\nperfect for the role as she actually looks scary and intimidating but i\nwould have expected more from her and actually respecting the source\nmaterial,the faeries were awful as stupid comic relief,other than that\nmost characters were OK, the visuals were pretty good but coming from\nDisney they could do a hole lot better, this movie is a hit and miss.\n"},
{"review": "\nMAY HAVE STORY LINE SPOILERS. <br><br>Growing up, Sleeping Beauty was always my favorite. Being able to\nremember the original Sleeping Beauty story will make this movie even\nbetter for you. I wasn't quite sure how this movie would turn out,\nbeing from the villains point of view. But WOWZA!!!!!! I'm in LOVE with\nthis story!!!! Absolutely NOTHING I EXPECTED. The way the writers\ntwisted the original Sleeping Beauty story line was genius!!! Very well\nmade, acting never falters. And speaking of acting. Angelina Jolie,\nwhether you love or hate her- she was phenomenal in this portrayal of\nMaleficent! I don't think any actress out there could've done it\nbetter. I stated there may be spoilers but I don't want to give to much\nbecause I want the element of surprise but from beginning to end- it\nwas so well done!!! I laughed, I cried, I felt these characters pain\nand laughter: go see it! It's worth watching!!!!!\n"},
{"review": "\nI have to say that I really enjoyed this movie and I am glad to see\nAngelina Jolie in this role. She was pretty amazing. I haven't been\nimpressed with Jolie's recent work and this was definitely a breath of\nfresh air. <br><br>I loved the way they told the back story of Maleficent. I wouldn't have\nloved it as much if they didn't do such a great job at explaining\nMaleficent's change to evil. Had it been all based on jealousy - i.e.\nStefan didn't marry her and became king and married someone else\ninstead - I think it wouldn't have had as much depth as it did here.\nMaleficent was a kind fairy. Even though Stefan and her dated for what\nit appears to be several years and Stefan left and didn't come back for\na long time, Maleficent still forgave Stefan and talked with him all\nnight when he did return. Her evil heart did not stem from some lost\nlove, rather, it was the betrayal of her love to Stefan plus his\nheinous act of cutting off her wings. Who wouldn't be angry at that?! I\ndon't blame her!<br><br>Aurora was also well written. She was not just some doormat princess\ncharacter like in Sleeping Beauty. It was such a sweet setup of how\nMaleficent came to truly love and care for Aurora. Maleficent watched\nover Aurora all her life (as opposed to some one off meeting that\nMaleficent had with Aurora like Aurora saved her life or something lame\nlike that and changed Maleficent's mind). I loved the nickname of\n\"beastie\" so much! it was so fitting and so cute! You can feel the\ngenuine love between Aurora and Maleficent and it just made it so much\nspecial when Maleficent's kiss woke Aurora. <br><br>I truly loved that the movie did not focus on Maleficent being an evil\nperson. Amazing movie! Much better than expected!\n"},
{"review": "\nI was enchanted within the first 3 minutes - and was avidly captivated\nuntil the very end of the movie. I rarely find such a treasure these\ndays, but it's got everything you could want, in a safe-for-all viewers\ninspiring, family movie. Full of enchantment, magic, myth and legend,\nthis tale of Sleeping Beauty offers a pleasant surprise of a plot, a\nstrong moral, the battle of good vs evil, superior acting (Jolie is\nastounding!), empathy with the characters, and an overall dreamy\nhappiness with the whole movie.<br><br>I'd not even heard of this movie - saw it on Amazon Instant Video, and\nwatched the trailer. I stopped the trailer after 15 seconds to BUY the\nmovie. Sure to be a favorite in almost every family!\n"},
{"review": "\nThis had a lot going for it. A charismatic, willing star who could\nreally carry off a fantastic character, a juicy betrayal to get the\ntale going, and a lot of great special effects. But unfortunately, you\ncan't stop there. Story, pacing, supporting cast, winning characters?\nOops \u0097 we blew the budget with AJ's wings and the CGI, so.....<br><br>So -- is it a spoiler to say that the plot pretty much goes nowhere and\nthat by the end you are so dying for it to be over you don't even care\nwhat happens?? If good conflict is what drives a good narrative, does\nthe absence of any good conflict --- very much the case with this\nplodding, slackly handled drear-a-thon -- make a bad one? The worst\nthing about this, which leaves quite a bad taste in your mouth, is that\nin redeeming the character of Maleficent they decide to depict that she\nwasn't a mean old spinster, she was a deeply loving maternal figure who\nwas just bitter cuz she got royally screwed over by a guy she trusted.\nIt's so schmaltzy it's kitsch. I'm a guy and this stuff offends MY\npaltry feminism. Considering some of the take-no-prisoners characters\nthat AJ plays (and plays well), I am surprised she even took this part,\nbut I suspect it was doing a screen test with the kudu horns on. I\nmight have even taken the part just to wear those.<br><br>Oh, and this movie (at press time) had a 7.1 rating. I mean, come on. I\nknow this is more or less a kid's movie, but a good kid's movie is\ngood, so we can just go ahead and say that a bad kid's movie is bad.\nJust take a similar movie: Enchanted -- which had great songs, a\nfantastic cast, a charming, funny, sweet and complex story. It is rated\nat 7.2.\n"},
{"review": "\nThis is more of an adult version of sleeping beauty with an added twist\nthat makes it more interesting to watch. Angelina Jolie is an actress\nwho can say so much and convey so much emotion with just a look. For\nme, it's one of the best Disney films ever made. It had much more depth\nand emotion than the original version. I feel that the movie as well as\nthe acting was very much underrated. So many people that I have spoken\nto feel the same way about this movie. There is a message in this movie\nthat I haven't heard mentioned by anybody. It is, to be careful of what\nyou say or do out of anger or hatefulness, because you can't take some\nthings back.\n"},
{"review": "\nFor those who claim that they don't understand king Stephen, I'll tell\nyou: He was an orphan and lived in a BARN all his childhood! I don't\nthink Stephen had anyone caring for him or loving him, maybe it was\ncontrary - people was cruel and humiliated him. As it often happens in\nreal life, those who was treated badly in childhood and did not have\nany parent figure at all, just random people passing by, grow up to be\nsociopaths with attachment and bonding problems. Stephen could not love\nanybody, only thing he knew was how to use people to get his way. He\nmarried princess not for love but for ambitions, so, maybe Stephen DID\nconsider his daughter as a valuable property you can later use in\npolitical games (as all the kings in medieval times felt about their\ndaughters). Maleficient humiliated king when she forced him to beg on\nhis knees, also she was a threat to his kingdom - good motivation for\nwanting to kill her. <br><br>I loved the true loves kiss - (god) mothers love is as true as it\ncomes! It is much better than the concept of a cute stranger with whom\nyou have spoken once suddenly being your true love.<br><br>To those who miss villain Maleficient - have you met really, really\nevil people in your everyday life? Mostly we meet people we are tempted\nto consider evil because it's easier for us. I don't care about the old\ncartoon, this new version moved me!\n"},
{"review": "\nThis movie was exactly what I thought it would be\u0096 Great! It had just\nthe right amount of mystery, action and magic! From the very trailer I\nknew that I would be satisfied. The writers are \"fan-tab-u-lous\"! I\nmust say Angelina Jolie, over and over again you rock... I was\nenthralled by your performance and that of your co-stars as well. As if\nyour performances were not enough, wardrobe completely nailed it with\nthe marrying of the performers personalities to their surroundings.\n(especially Angelina Jolies'). On top of all of these goodies, the\nmusic department did an outstanding job captivating me from 00:00:01\nuntil the end. This is hands down an amazing film \"Team Maleficent\".\nGood fairy tales are hard to come by. This one fits the bill. With such\nincredible artistic direction I had no choice but to feel inspired once\nagain by the magic of a great production/story. We all have one to\ntell...\n"},
{"review": "\nI absolutely LOVE this movie! I saw it in theaters on my 30th day and I\nwanted to see it again but never got around to doing so. I based\neverything solely on the commercials so I was very surprised by a lot\nof the twists in the movie. It shows how she was BEFORE she became the\n\"evil\" Maleficent.<br><br>There were also a lot of scenes in the film that cracked me up, like\nwhen she would put the sleeping spell on people who annoyed her...that\nwas hilarious just how the people would slowly begin floating away as\nthey slept.<br><br>Anyway, great movie and I would recommend it to anyone. I cannot wait\nto own it! :-)\n"},
{"review": "\nOkay, enjoyed a couple of movies last weekend. Maleficent and Edge of\nTomorrow\u0085 both movies were outstanding, both were a \"must see!\" First\nMaleficent, a well-made move showing the audience the so-called\n\"Villain's\" side of the story. I gotta say, Well done Disney for even\ncoming up with an alternative view of the Sleeping Beauty Story.\nAngelina Jolie, was Magnificent as Maleficent. That woman has a face\nyou want to follow and when you put some glow-in-the-dark eyes on her,\nWell, it's all over. This movie I believe was how the pros at Disney\nwould have done it... with big and bigger name stars back in the day.\nUnfortunately it was a kids movie so I'd give it 9 for kids and 8 for\nadults.\n"},
{"review": "\nI refuse to believe that there would be anybody alive who is not aware\nof this Angelina Jolie movie unless you have been cast away in a far\naway island and have been spending days cutting your hair and beard\nwith blunt rocks.<br><br>Maleficent is undoubtedly one of the best performances by Angelina.\nWell of course there are so many other movies that shows her brilliance\nbut Maleficent will stand out for so many reasons. First of all the\nwhole look of the character and then the performance, the nuisances of\nthe character and the quirky and the wicked evil act everything just\nwas hundred fold in effect.<br><br>If you watch the movie, you will not stray anywhere from Angelina\nJolie. Her screen presence is so much powerful that everything else\nactually fades away in comparison.<br><br>Well having said lets discuss other aspects of the movie, Plot is\nbrilliantly developed only to be enhanced with performances by the\nactors present including Vivienne Jolie-Pitt (Angelina's real life\ndaughter, even if it was for 5 minutes). The visual effects are\nabsolutely breathtaking and dream like and making this movie one of a\nkind experience.<br><br>A truly must watch Disney Experience.\n"},
{"review": "\nFirst of all, the story surprised me a bit: Maleficent's chick bones.\nThe fact she's not a witch, she's a fairy. The villain &amp; hero twist.\nThe prince's kiss didn't work, but a mother's true love kiss bring\nAurora's back from her death sleep. After Aurora's waking up and\nMaleficent got her wings back, the war still going. Why? The king went\nmad¡¡¡¡ The prince role was very insignificant in this new version, but\nI like it anyway. Also the king's character was small,a girl grown up\naway from her parents 16 years and she didn't troubled at all when her\nfather died. Aurora smiles all the time, she's a happy girl and never\nfall into sadness because a fairy cast spell on her. But SHE SMILES A\nLOT, I WANTED HER TO SLEEP FOREVER¡¡¡¡ For many people this film was\ndisappointing, NOT FOR ME. I enjoyed very much. The visual effects was\nstunning, the music,and the credit'song \"Once Upon A Dream\" by Lana Del\nRey sounded creepy. So much talk about this movie. I challenged myself\nto watch it. I really liked. Angelina Jolie re-defined herself as super\nstar status. A Villain Diva of this times imitated by many fairies.\n"},
{"review": "\nWell this was another case of the previews being nothing like the\nmovie. The previews made it seem like this was going to be a dark and\nmore mature version of the Disney movie sleeping beauty. The previews\nmade it seem like this version of sleeping beauty would be like Chris\nNolan's version of batman. Well sadly it was not. It was the typical\nmovie that you could expect from Disney. It was the usual Disney movie\nwith the pony puff princess flair, very juvenile and not meant for the\nviewing of anyone above age 10.<br><br>Jolie is no doubt a force to be reckoned with. She's beautiful and\ncommands attention, but she hardly had any lines. I wish they had given\nher more lines! I was also excited to see Copley under the direction of\nsomeone besides Bloomkamp, but he came off the same way he did in his\nprevious 2 movies. I liked the premise that true love can come from\nsomeone other than a handsome prince and Jolie looked amazing in her\nmakeup and costume and Fanning did a great job playing the naïve\nprincess. Overall I thought it was an average movie\n"},
{"review": "\nBreathtaking - Beautiful! Everything from the costuming, to the sets,\nto the script and acting --- it's all breathtaking. There is no overuse\nor misuse of CGI effects in this film. The entire film is done in very\ngood taste and style. Outstanding performances by the entire cast -\nJolie is at her finest in this film. This movie quickly became a\nfavorite fantasy film for me.<br><br>It has a slight twist to the classic fairytale - which made the movie\neven better (IMO) and is perfect for fans of the villainess/heroin\nMaleficent.<br><br>Maleficent (2014) is good film the entire family can enjoy and would\nmake a great Halloween family film.<br><br>9.5/10\n"},
{"review": "\nHaving squeezed even the last commercial drop of the \"princesses\", the\nexecutives from Disney now focus their attention on the villains. And,\nundoubtedly inspired by the success of the musical play Wicked (a\nret-con prequel of The Wizard of Oz), they now bring us the story of\nMaleficient, in which her motivation for becoming the villain of the\ntale (and the movie, of course) Sleeping Beauty is revealed. The result\nis a hollow and tedious film with failed epic aspirations and lacking\nof the necessary emotion or drama in order to bring sense to its\ncloying digital aesthetic. Every frame of Maleficient is over-designed\nto the point of saturation, something which might leave the spectators\nwho only want to see spectacular landscapes and bizarre creatures\nsatisfied. That's a pity because, after all, the villains from Disney\nhave always been more interesting than the heroes or princesses, and I\nthink that Maleficient had the potential of being an interesting\ncharacter study with touches of dark fantasy. Unfortunately,\nscreenwriter Linda Woolverton doesn't show the slightest interest in\nbringing dramatic relevance to the story, and as a result, the special\neffects end up replacing the narrative, throwing as many pixels to the\nscreen as necessary in order to simulate the fact that important and\ninteresting things are happening. On the positive side, Maleficient\noffers solid performances from Angelina Jolie, Elle Fanning, Lesley\nManville, Imelda Staunton and Juno Temple. Unfortunately, despite their\nperformances, this film bored me very much, and I can't recommend it.\n"},
{"review": "\nUnfortunately this movie was a big disappointment for me and even worst\nthan I had expected it to be. I wouldn't have minded additions and even\nchanges to the story, but they went over the line with everything and\nkilled the whole concept with clichés. The visuals of the movie seemed\nto be more important than the actual plot, which was very generic and\nboring. To my huge surprise even Angelina Jolie disappointed me in this\nmovie. I think she's a great actor, but for me her performance was flat\nand I was not at impressed with her acting in this one.<br><br>Before I saw the teasers I thought the new take on this classic story\nmight be interesting and could have great potential. After seeing the\nfull trailer, I wasn't expecting much, but somehow this movie was even\nworse than I had feared it to be. None of my friends liked it either,\nso it wasn't just me. I guess I had just pictured this movie going in a\nwhole different direction than it ended up taking. I will give this\nmovie 5/10 because it wasn't absolutely horrible, it was just boring\nand totally predictable. For me it was watchable, but honestly I wish I\nhadn't spend my money to go see it.\n"},
{"review": "\nThis movie seemed to not know if it was Arthur or Martha. The trailer\npromised us a dark movie which was evident in some scenes but did not\nmix well with the light hearted Disney spin in many other scenes.<br><br>The pace of the movie was way too fast while Auora was growing up and\nthe story line was just wrong for this movie.<br><br>The movie looked great but it lacked substance from a story line\nperspective, almost like a report which presents well with binding and\nlaminated pages but with utter crap inside.<br><br>If it wasn't for Angelina I probably would have walked out.<br><br>The target market for this movie (16+) was just wrong and should have\nbeen for children.\n"},
{"review": "\nFantastic in its orchestration, this film tells a story full of raw\nemotion and characters with terrible inner strength and immense\nconvictions. It's a story which starts with compassion and innocent\ncamaraderie, extends into jealousy and betrayal, culminating in\nredemption and peace. The characters are multifaceted and in the end,\nevery personage can be identified with. I originally saw the betrayal\nas a way of long term protection from imminent murder, and in the end,\nthe sway of intense emotions to lead to an inevitable fate. Every\naction in the movie had a reason and those could be derived from\ninference and careful thought. This is not a movie about good versus\nevil. It's a movie about the good evil complex present in all of us as\nsoon as we discover the horrors of human passion.\n"},
{"review": "\n\"Angelina, stand over there and stare to my left, OK, now stand over\nthere and stare to my right, great! Now stand there and just open your\neyes really wide, wider, wiiiider, perfect!\" Hello I'm \"Maleficent\" (of\nor pertaining to evil) but I'm the GOOD fairy! Hey I found this plastic\njewelry in a bin at Costumes R' Us, let's decorate our sad cast with\nit.<br><br>Did they cut off her wings like they cut off her breasts? Was that the\ndraw, the deep connection? Hey everyone, we found a bunch of unused\ndigital characters that were too lame for other movies sitting on a\nhard drive somewhere, they're 50% off! what do u think Disney execs\nshould we cut huge corners to save a trivial amount of money??? But OF\nCOURSE! THATS MONEY IN THE BANK FRIENDS! -Disney exec who went to\nHarvard business school.<br><br>Did Michael Bay advise on this movie? Because it's literally *that*\ngood.<br><br>My take, if they wanted to make a cheap cartoon with an unusual or\nquestionable message largely inspired by incompetence, they should have\nmade a cheap cartoon. But they hired Angelina Jolie to star in what\namounts to a cheap cartoon. Mistake.\n"},
{"review": "\nI mean, this movie may look visually good on the big-screen and in HD.\nBut, I'm just not a fan of what kind of a direction that this movie was\ngoing for. It doesn't really feel like I'm watching a remake, or a\nprequel to the original or a \"mid-quel\". It' just feels like I'm\nwatching a bad fan-fictional retelling of Disney's \"Frozen\" with the\ncharacters of Sleeping Beauty on the big-screen. Now are there any good\nthings to say about this movie?! Well, I will say that Angelina Jolie's\nperformance as Maleficent was actually pretty good. But, that's it. I\ndidn't really feel any other connections with Princess Aurora in this\nmovie, nor did I actually understood why they need to make King Stefan\ninto a villain or why they need to make the three good fairies into the\n\"three stooges\", or why Maleficent's pet raven is turned into a dragon\nand not her. That's basically the one thing that I liked about\nMaleficent's character from the original. She's evil, and can turn into\na dragon. But, nope!! Not in this movie.<br><br>Overall, I didn't think that this was one of Disney's best live- action\nmovies at all. If you really want to introduce little kids or newcomers\nto the story of Sleeping Beauty and the real character of Maleficent,\nthen just stick with the original 1959 animated film, instead. Don't\nbother watching this movie, period.\n"},
{"review": "\nFairy tales, the story of our childhood, the story of the good princess\nbeating the bad witch . How many times have we gone to sleep to\nthis???? Yet did you ever wounder why the witch was bad??? Maleficent\nportrays the story from the perspective of the adversary, depicting her\nconflicted relationship with the princess and king of a corrupt\nkingdom. Maleficent fall in love with a boy whose love for her is\novershadowed by his ambition to become a king. Human's greed turns a\ngood innocent soul in to an evil thing who want to take revenge against\nher enemies. But then also deep inside there existed a good side of her\nwho loves and care for others. Even though she hated and cursed the\nchild of new king Maleficent begins to have motherly feelings for the\ngirl.Maleficent tells a tale of how people are portrayed in a bad light\nbecome bad. It is the story of our childhood with a new twist that\nexplains why bad things happen to good people. I found this fabulous\nmovie in Flickstree, in their suggested list of movies.\n"},
{"review": "\nA nice movie to watch on a Sunday summer evening. Disney's\nsort-of-prequel live-action feature is big on production values and\ncertainly on Angelina Jolie, who keeps Sleeping Beauty off-camera for\nabout half the movie. In this re-telling of the fairy story, we get to\nsee the motivation behind the not-so-wicked witch's curse on the young\nprincess, so much so that you end up almost rooting for her to have her\nevil way, so badly is she treated by her one-time young boyfriend, now\nthe grown-up paranoid King, the oddly Scottish-accented Stefan (see\nwhat you started Mike Myers?).<br><br>Of course, being Disney, the cute factors are raised to the factor\ntriple-x as witness the three pixies charged with protecting the baby\ngirl in her youth, a humanised raven which becomes Maleficent's\nconscience and a mop-haired prince who in a neat twist doesn't do what\nhe ought, according to the legend.<br><br>Jolie it must be said is very good in the title role, her jet-black\nhair and razor-sharp cheekbones to the fore. The effects are excellent\ntoo, especially the depictions of a fairy grotto with brightly-coloured\nfairies lighting up the place, the forest of thorns and Diaval's\ntransformation into a fire-breathing dragon at the conclusion. I also\nliked the twist as Aurora is wakened from her sleep at the second time\nof asking and the exciting SFX finale between Maleficent and Stefan.<br><br>I would carp at one or two modern-phrases which wincingly crept into\nthe dialogue (one pixie criticises another for \"having a go at her\")\nbut you'd have to have the heart of a fairytale malevolent King not to\nenjoy this lovingly made film which well complements I its animated\npredecessor from over 60 years ago.\n"},
{"review": "\nMaleficent is one of the best beautiful and unexpected movies I've ever\nseen. Maleficent has really warm heart, so in this tale we can't think\nactions of Maleficent as just the revenge. This is unexpected content.\nThe country where Maleficent and other strange creatures live is so\nmaic world and the soundtrack is so nice. So, girls definitely are\nattracted with a view of the world. This film shows the processes of\nfeelings like adorable and anxiety, so people who watch Maleficent can\nunderstand how people love someone. The expressions of actors have deep\nmeanings and skill, so I enjoy watching Maleficent. The time watch this\nfilm will be something special, so I recommend this heart warming\nmovie.\n"},
{"review": "\nThe film is very entertaining with stunning visuals and impressive\naction scenes. This is definitely Angelina's film and she is incredible\nas Maleficent.<br><br>The story is sophisticated enough to delight adult audiences with a\nbrilliant take on the beloved tale with a delightful twist including\nthe meaning of true love. The character are sympathetic and there is\nenough excitement.<br><br>The art direction and cinematography are beautiful. The right blend of\nhuman faces with CGI so it does not look like animated. Moreover,\nAngelina's expressive face is the perfect snow case for the character.\n"},
{"review": "\nI pray that the little 5-year-olds dragged to this Disney Mess have\nrecovered by now. Too mean and cruel in several ways and there are not\nenough words to describe the whole scary movie in detail. It opens all\nsweet and beautiful. A 5-year-old fairy queen with oversized dark wings\nand horrendous horns fails in love with Prince Stephen. She grows up\nhating him, as he spurns her for a human princess and the power of the\nkingdom, like a medieval Darth Vader. She turns the cute little gnomes\ninto cute little trolls. Creates matchstick men out of dead trees and\nbecomes a genuinely \"Gloomy Glenda\". So predictable that I couldn't sit\nthrough the middle of the DVD. I resumed it when she \"cursed\" little\nPrincess Aurora. The 3 good fairies then hide her in the woods for 15\nyears. Several twists and turns here. She befriends \"Aurora\" and has to\nreverse her own curse after the teenage girl finds a room of broken\nspinning wheels. She is drawn to them like a magnet. Maleficent breaks\nher own curse by kissing Aurora, who she now loves like her own\ndaughter. King Stephan is driven mad and someone else becomes the\ndragon. Several knights become dragon-toast and Aurora becomes the\nhuman queen who unites with the fairy Queendom, overseen by the \"new\"\nMaleficent. (Yes, Aurora finally gets her \"Prince\"). Maleficent flies\noff into the sunset (really) with her winged sidekick and everybody\n(left alive) lives happily ever after. Dakota Fanning's sister \"Elle\"\nis so young and adorable as \"Sleeping Beauty\". Angelina Jolie plays\n\"Maleficent\" magnificently. The sexiest fairy with creepy giant wings\nand horns that you have ever seen! Should be rated PG-13. This will\ngive really little kids nightmares for years! Just as \"Pinocchio\" (the\n1950's re-release) bothered me for years: cigar smoking \"Lampwick\"\n\"morphs\" into a donkey and Pinocchio \"dies\" briefly after being\nswallowed by \"Monstro\" the Whale.\n"},
{"review": "\nThis is one of those, \"You've heard this story before, but let me tell\nyou how it really happened\" films. It's a retelling/re-imagining of the\nclassic Sleeping Beauty Disney film. You have to realize that and be\nable to accept it going in, otherwise the changes may make you angry\nlike they have for some who stand firmly by the original. This isn't a\nremake of Sleeping Beauty, it's Maleficent's version of the story, so\nas you can imagine it's going to be pretty different. Personally I am\ntotally okay with that and enjoyed seeing a new version of the classic\nfairytale. Classics are classics and they will always be wonderful, but\nit can be fun to mix things up a bit.<br><br>You come to understand why Maleficent is so full of anger and why she\nwanted to target the royal family. I actually found her back story, as\nwell as the remaining storyline, pretty interesting, even if the\nexecution was a bit lacking. <br><br>Angelina Jolie definitely grew on me as the movie went on and by the\nend I was very satisfied with her as Maleficent. Also, her look is\ngreat. A lot of the other cast members I felt could have been better\n(and their characters could have been given more depth), but Jolie\nbrought enough to the film that they were forgivable. Most of the\nscreen time is hers anyway. <br><br>The visuals are very nice and help bring that Disney element to the\nmore modern film. Personified animals, imaginative creatures and\nlandscapes, visible magic spells, etc.<br><br>Like I said, it's cute and entertaining. Definitely enjoyable if you're\nopen to it, but don't expect to be absolutely blown away with\nlife-changing dialogue and deep, complicated themes. Just respect it\nfor what it is and you should have a good time!<br><br>Apparently there is a sequel set for 2017, with Jolie returning to her\nrole as Maleficent, and I'm looking forward to it. I think they can\nimprove on what is already an enjoyable film and really deliver.\n"},
{"review": "\na new vision about Maleficent needs courage. but Angelina Jolie gives\nthe inspired manner to her character to be almost credible. the\nmemories about Disney version are not easy to ignore them. but the\natmosphere, the strange parts, the evil who has new ingredients and the\ndrops of fairy tale from old fashion genre are good points for a large\npublic. part of a new perspective about classic values, reflecting\nambitious equality of chances, it is a nice exercise to transform an\nold subject. not in perfect manner but with a kind of seduction who\nseems be almost dangerous. because it reflects relativization of\nvalues. but, in essence, a nice film. and that could be only real\nimportant thing.\n"},
{"review": "\n\"Maleficent\"<br><br>Angelina Jolie is Maleficent, but she is no longer the nasty and\nsophisticated demon that was considered to be one of the best villains\nthat Disney ever made, but she is now a misunderstood fairy who had\nbeen robbed of her wings and shoved into the battle that man brought\nupon her. But, it turns out that, when she curses the Princess Aurora\non the day of her birth, she grows to like Aurora (Played by Elle\nFanning) over the 16 years that she watches her. The three fairies are\nconsidered to be too thick to look after her and so Maleficent looks\nafter the girl and even raises her. Okay, this is one of my biggest\nissues with the film, couldn't there be another way around Maleficent\nlooking after Aurora than just having the fairies be thick? Couldn't\nshe just talk to her or look after her when the fairies let her walk\naround the place, like in the original? There are so many ways around\nthis topic, but they went the silly route. Negatives aside, I quite\nlike the film. Angelina Jolie is not an actress that I'm familiar with,\nbut she enlightened me in this movie. She looks the part and sounds the\npart, but the sympathetic approach can turn some people off when the\noriginal Maleficent is taken into account. No doubt, I love the\noriginal, but the new is also very good for me to see. I guess I like\nboth original and new. Princess Aurora is considered to be one of the\nworst aspects of the original Sleeping Beauty, but I have been an\nAurora fan since day one. I loved how she was portrayed here and it\nkept true to the original while giving something new. If you don't like\nnew twists on old tales, then this ain't for you, but if you're open to\nsome new ideas, then look no further.\n"},
{"review": "\nMaleficent isn't a sequel, a prequel, a remake or even a retelling but\nMaleficent's story before, during and after Aurora's infamous finger\nprick.<br><br>I didn't mind this movie, though there were some points were it was a\nbit crappy.<br><br>The costume was amazing but I didn't really like the mega-defined\ncheekbones (reminds me of Lady Gaga's 'Born This Way' album cover).<br><br>There are points in the movie were the colours and moods are bright,\nvibrant and colourful and then others dark, it also looks like a great\nmajority of the movie has been green screened when they could have\neasily done location shots, which I think always takes something away\nfrom any film.<br><br>Rather than Maleficent being evil like in Sleeping Beauty, you start to\nfeel sorry for her and you actually start to hate King Stefan in this\nfilm.<br><br>I love the Disney's Sleeping Beauty and especially the 3 fairy\ngodmothers but in this film, I couldn't stand them. In Sleeping Beauty\nthey are happy and playfully banter with each other while in\nMaleficent, their 'playful' banter at most points is actually mean and\nthere doesn't seem to be any fondness towards each other.<br><br>It was on okay film. Worth a watch at least once or twice but I\nprobably wouldn't own it.\n"},
{"review": "\nAngelina Jolie makes an excellent performance in this version of\nSleeping Beauty. This is a whole new look at the original Disney tale.\nNot only is Maleficent is a villain in this she's also a hero. Of\ncourse the real villain in this version of Sleeping Beauty is King\nSteffon. He fell in love with her as a kid and when he grew up he broke\nMaleficent's heart and took her wings. This makes sense since\nMaleficent is actually a fairy who had her wings stolen and it would've\nmade a whole lot more sense if it was actually shown in the original\nanimated version. Also it was Maleficent's love for Aurora to wake her\nup from the spell and not Prince Phillips. Also King Steffon got what\nhe deserved in the end. All in all this is a great version of the\noriginal Disney classic. Definitely 10 out of 10 for this.\n"},
{"review": "\nWe finally saw 'Maleficent' the other day. I absolutely loved it ! It's\nthe best twist on a favorite fairy tail I've ever seen. Angelina was\nperfect in the title role, she made the same character sympathetic,\nscary and later heartwarming at different times in the story. The\nactress could express a wide range of emotions with just her eyes and\nexpressions. I anticipated what would awaken Aurora and I was not\ndisappointed. The final resolution to the story was very satisfying\ntoo. It's rare lately that a movie leaves me with a big grin at the end\nas the credits start. I haven't enjoyed a fantasy film this much in a\nlong time, with the exception of 'Oz the Great and Powerful' which I\nalso enjoyed to a slightly lesser degree. I want the 'Maleficent'\nblue-ray now for my collection. Plus I just read that there are rumors\nof a sequel ! I'm hoping that's true. I give it 9 out of 10 stars.\n"},
{"review": "\nI was so disappointed with this film. Angelina Jolie of course was\namazing but seriously the acting in this was terrible. Elle Fanning is\nusually so great but this seriously had me guffawing. Especially the\nline from the Prince \"I'm looking for a girl.\" It was really, really\nbad. Parts of it are exquisite \u0096 the wings scene with Angelina Jolie is\nbreathtaking but the fairies drove me nuts and the CGI went from\nclearly real to clearly unreal. I thought the producers could have done\nsuch a better job with this. The King who had previously starred in\nDistrict 9 was laughable with his Scottish accent. So, so disappointed.\nIt is not as good as other Disney films the huntsmen and mirror mirror.\nUnfortunately the trailer is a bit of a trap in this one. Me and my\ndaughters were bored - too long and indulgent.\n"},
{"review": "\nThis movie seemed a bit out of the ordinary, with eccentric behavior.\nWas pleasant and enjoyable and had good energy towards the film. The\ndelivery of supernatural powers forced upon the good, whist Malaficent\nseemed to have a versatile approach to good and evil, almost making her\nlook bi-polar with hidden anger. Angelia Jolie seemed quite selfish\nthroughout the movie and her decision making kept me guessing.<br><br>A mysterious world with a battlefield of civilization with great\ngraphical features.<br><br>Malificent seemed to always be the outcast in her world and never\nseemed to fit in anywhere but appreciated the company of respect and\ncould tolerate and forgive making her not look so evil after all.\n"},
{"review": "\nThe younger me would not have liked this, because I never liked remakes\nthat changed the story. But the older me likes it quite a bit. Even\nmore so that I'm reading the \"original unedited 1st edition\" Grimm\nFairy Tales (in English) while I still read the lighter and newer\nversions of the same tales to my kids. So I get it now in more ways\nthan one that there can be many versions of one story. Some of the old\nfairy tales don't really teach nice things to kids, so the stories get\nchanged in modern day prints. Not only that, but even back in the\n1800's when the Grimm brothers were writing the stories down after\ntraveling around and gathering the verbally handed down stories, there\nare often two (or more) versions of the same story at that time\nfloating around! So there is no perfectly \"correct\" version that exists\nthat anyone can put a finger on to begin with.<br><br>This movie aims to approach a fairytale, a story that is obviously\nfabricated or exaggerated to the point of not being realistic, in a\nmore realistic manner. Realistic in the sense of motivation, humanity,\nand plot I mean to say. It is still very much a fairy tale about magic\nand literal fairies, but it's something to watch and think about from a\nnew angle. If you loved the first one, and I did as a very small child,\nthen see this one not as a remake but as a completely different version\nof the same story. A \"what if\". Great stuff.\n"},
{"review": "\nI am not a Disney aficionado and knew almost nothing about the\nMalificent character within the Disney lore. I knew the sleeping beauty\nstory (sleeping princess awakened by a handsome prince), but actually\nthought Malificent was a new character invented for this movie (not a\ncharacter with a Disney pedigree). I mention all of the above because I\ncannot wrap my head around all the criticism and disappointment\nexpressed on these forums.<br><br>From my vantage, the movie was wonderfully crafted and acted. It was\nessentially a character study of a single character - Maleficent - with\nplot serving a supporting role. The ending twist (though I had seen it\ncoming midway through) was lovely, and the movie's overall pacing and\nproduction values of high quality. <br><br>As for the acting, Jolie's performance was fantastic (I am hardly a\nJolie fan): she gave the main character gravitas and sympathy. It was\noverall a complex, subtle character to feature in a Disney production -\nand commendably novel and refreshing for this reason alone. <br><br>Recommended.\n"},
{"review": "\nMost of us know the story of the Disney version of the Brothers\nGrimm/Charles Pereault story 'Sleeping Beauty'. The evil witch who cast\nthe spell on the princess Aurora (referred to as Sleeping Beauty) is\nMaleficent and is supposedly done away with in the Disney story.<br><br>However, Disney decided that the story could use a different\nperspective and offered us a version of the events from the witch's\npoint of view. Angeline Jolie in her first movie in 4 years plays the\ndark fairy Maleficent and the story develops on how her estranged\nfriendship with the neighboring prince turns her from a fairy (pure\nheart) to a so called witch (heart of stone). Some of the original\nplots remain in the story but what is interesting here is the expansion\nof Maleficent's world and how she changes with time. The portrayal by\nthe various actors playing Aurora comes off well and not very cheesy as\nin the case with these kinds of movies. The animation and special\neffects are very slick and blend well in the proceedings.<br><br>Jolie does an exceptionally great job as the tortured fairy and this\nrole looks like it has been waiting in the wings for her. I can't think\nof any of the modern actress who could have done this role any better.\nElle Fanning as Aurora brings in a deep sense of innocence to her\ncharacter. Sharlto Copley on the other hand looked a bit out of place\nin the film. Brenton Thwaites who plays the prince who supposedly has\nto wake the sleeping princess from her curse looked like he dropped in\nfrom 1600s. Apart from these 4 characters, we have 3 fairies, Sam Riley\nas Maleficent's sidekick and some animated troll like creatures who\ncontribute to the proceedings.<br><br>This is an interesting movie for adults and kids alike.\n"},
{"review": "\nSleeping Beauty, known as one of the greatest Disney classics ever, was\none of my favorite Disney classics as a child. I remember glimpses of\nmy childhood. I remember watching it with my aunt while my parents were\nat work. I liked it. The characters, the cinematography, the theme, the\nmusic, and most importantly the villain. The character, Maleficent, was\nvery interesting to me when I was a child. As a kid, I thought that she\nwas just doing what bad guys do those days, do something evil without\nany valid reason. Years passed by and I heard that there was going to\nbe a film based and focusing on Maleficent herself. I was very\ninterested with the concept of the summary. Maleficent, a character\nwith great power, was getting her own live-action film. When I saw the\ntrailers, I was fairly satisfied.<br><br>Robert Stromberg, the director of this film, did an amazing job\nbringing Maleficent to life. I liked the way the movie was presented.\nIt gave a somewhat Tim Burton feel to it when watching the trailers but\nI was quite amazed with what it was. The CGI was very pleasing and\nsatisfying. The cast was exceptionally good. Angelina Jolie as\nMaleficent was the perfect role for the actress after her break. It\nmade her comeback seem very different. Elle Fanning was also a very\npleasing Princess Aurora. With Sharlto Copley I wouldn't say his\nperformance was great but fairly good enough. I am not sure if this is\nconsidered a spoiler or whatever but I loved the twist in this\nfairytale. The story and history between Maleficent and Stefan was\nwell- thought out.<br><br>Overall, a satisfying fantasy based around true love with an incredible\ntwist.\n"},
{"review": "\nOkay, so, like many, I grew up on the animated Disney film, 'Sleeping\nBeauty,' so I flatter myself that I know the story pretty well. I was\nsceptical about how well dragging out the 'villian's' side of the tale\nwould translate into a full length live-action movie, but I was\npleasantly surprised.<br><br>For a start it had a big advantage with Angelia Jolie in the lead role.\nShe does seem born to play the titular evil fairy, Maleficent.\nObviously, the story does follow Sleeping Beauty for the most part and\nI actually got a little bored, technically just watching a live-action\nversion of the classic fairytale. However, when it changes, it changes.<br><br>I won't go into too much detail, but the film-makers use a fair amount\nof creative liberties to stray from the story we know so well. Let's\njust say if you think you know the story, then you'll probably be\nsurprised by what transpired.<br><br>Of course it's not perfect, but then my main gripes came from the\nexcessive use of computer-generated scenery. I always get a bee in my\nbonnet when I watch a fantasy film (think Tim Burton's Alice in\nWonderland, or Oz: The Great and the Powerful). I think I'm too old to\nallow myself to let go and just enjoy the story. All I can see is\n*technically* Playstation 3 graphics talking on screen next to the odd\nreal actor or actress. Plus the three 'good' fairies just looked weird\n(in my humble opinion).<br><br>But the film does its job at breathing new life into an old (and\nwell-known) tale. It should be enjoyed mainly by children, but it\nshouldn't be beyond finding its way into the hearts of adults, too.\n"},
{"review": "\nI really enjoyed this movie. I loved how they didn't follow the exact\nfairy tail and thus giving you no idea how the ending will be and if it\nwill be a good or a bad ending. Of course, as usual, the acting of\nAngelina Jolie was simply sublime. I think the thing I loved most was\nthe characters that you don't really meet, but still have their own\nstory, even though it's not being told. Also a thing I really enjoyed\nwas the special effects. It just looked so real and there was literally\nno doubt in my mind that there was put a lot of time in it. Although I\ndid expect a little more action. But I suppose it's not that kind of\nmovie, and I guess it wouldn't really fit the movie either if it were\nfilled with battles etcetera. To just recap, I'm pretty sure I will\nwatch this movie again in a few months. Simply because I enjoyed it\nthat much.\n"},
{"review": "\nThis movie is a fairy tail about broken love. I can say that it's nice\nrelaxing movie where you can bring you kids and enjoy it with them. I\nwent to see this movie because of Angelina Jolie. As always great play\nand great suit! She did great job in this movie. Lot's of interesting\nmoments, but creators used the same old idea. So, once you watching it,\nyou know what's gonna happen next and etc. But again, it's for kids in\ngeneral, so - for kids would be great. They will like it. For Adults -\nif you have experienced broken love and hate someone for that - go ad\nrelax your soul it may help you too. It's not 10 points for sure, but\nI'll say 7 (better 7,5).\n"},
{"review": "\nI'm still not convinced that this movie needs to exist. It's a new take\non the beloved Disney classic, which in turn is inspired by a tale of\nthe same name by The Brothers Grimm. So yes, it's an adaptation based\non an adaptation, but it's not really good or new enough to fully\nwarrant its existence. That being said, it's not a bad film, actually,\nand I had fun watching it.<br><br>The best thing about this film, by far, is the performance and sheer\ncharisma of Angelina Jolie. She's the perfect fit for the role of\nMaleficent and in every scene you can see that she's having a blast\nwith it. Pretty much the only scenes she doesn't absolutely sell are\nthe ones where she has to be really loud and bombastic, but the rest\nare pure gold.<br><br>The rest of the cast is good, though nothing special. Elle Fanning as\nAurora is a fitting casting, though for a princess blessed with beauty\nbeyond all measure she's perhaps a tad plain. But that's me nitpicking,\nand she's a pretty girl by any measure. Sharlto Copley is also a great\ndeal of fun as King Stefan. Some people have complained that his accent\nis distracting, but I didn't really mind.<br><br>The film also looks amazing. Some of the CGI looks a bit rubbery,\nespecially in closeups, but most of it is very impressive and\nespecially the backgrounds are breathtaking - fitting, because the\noriginal Sleeping Beauty by Disney was also known for its background\nart.<br><br>Maleficent has its good sides. Jolie's performance is a joy to witness\nand the story, while a bit naivé and predictable, will keep you\nentertained. The characters aren't the film's strongest point, but none\nof them are offensively bad. It also looks great. Recommended if you're\na fan of Jolie or are just looking for a good popcorn fairytale.\n"},
{"review": "\nI laughed, I cried.<br><br>No good place to start here. why its groundbreaking? first of all the 2\nworlds the mores and the land of the filthy humans. it perfectly\npersonifies greedy American capitalism but in a cool medieval setting.\nand the fairies are good hippies.<br><br>if i could sum up the movie in 1 word it would be love. I've always\nenjoyed fantasy stories by women more than men. this movie is\ndefinitely very feminist but in a good way. every single male character\nis portrayed as a bumbling moron.<br><br>what really puts this film over the top tho is Angelina and her\ncostume. my gad she just looked spot on and the special effects\ncompliment her appearance even more. this fairy tale doesn't quite\nfollow traditional formula. some dislike this, i don't i actually\ncried.<br><br>I've heard rumours of a sequel, but honestly they set the bar much too\nhigh on this first film. by far the best fantasy movie every made.\n"},
{"review": "\nI definitely wanted to see this movie, as I am a HUGE fan of the Disney\nversion of Sleeping Beauty, but I was still cautious. Being a fan\nhelped me to enjoy and appreciate what they were trying to do with this\nmovie. After viewing Maleficent, I ended up LOVING the movie. The\nacting, the costumes and sets, the story, the emotion, the\nhumor....everything was superb! I especially loved Angelina Jolie!\nHonestly, no one could have done a better job. If I had one criticism,\nit would be that, compared to the Disney cartoon, Aurora in Maleficent\nwas not pretty enough. Elle Fanning is OK looking. Maybe sort of\npretty. Aurora in Sleeping Beauty? Gorgeous. By far the the prettiest\nDisney Princess of all, in my honest, and biased, opinion. All in all,\na great movie that only the trolliest of trolls would nitpick. See it!\n"},
{"review": "\nI watched the DVD \"Maleficent\". It is a stunning movie and shows that\nCGI is drawing near perfection. <br><br>The main actors do a superb job. I did not realize who the actress\nMaleficent was until the end and without giving her name away, she\ndeserves an Oscar. \"Aurora\" is the sleeping beauty and she certainly\nconvinced me. <br><br>The storyline is a retelling of the story of Sleeping Beauty. The movie\nbegins with, 'Let me tell you how it REALLY happened...'<br><br>The colorful sceneries are very realistic and may make one think it\nactually exists somewhere on earth.<br><br>In my opinion, it is the next best thing to the Wizard of Oz in the\nfantasy category.\n"},
{"review": "\nI was both touched and happy at the ending! It was so good... :) -- It\nwas a good script, and the acting was good! Even though Angelina Jolie\nis not going to act anymore and continue being a producer (which is\nwhat i think), she was and always will be a star in my heart. I hope\nshe will always be happy with her family.<br><br>To me the movie was a good one! It had a good script, and the\nactors/actresses were doing very well acting. I was quite surprised\nthat it wasn't like the stories we were told about, like Maleficent was\nalways the villain and never had a good heart. But in this one it was\nchanged, and i have to say it was by far one of the best movies i have\never seen.<br><br>In my opinion i think it was better than the original movie. There were\nsome touching scenes to me, but that is because i sometimes cry easily!\nAnd the acting was done very well!<br><br>I am giving this a 10/10. This movie was very amazing! Angelina J.\nnever ceases to amaze me!\n"},
{"review": "\nI really liked this film. It was exactly as my title says: beautiful,\ndark, and happy all at once! The acting by Jolie was absolutely\nstunning, the CGI and makeup was excellent for all of the faerie\nkingdom, and the story completely believable. The soundtrack is also\nexcellent - with emphasis on the closing song: Once Upon a Dream by\nLana Del Ray. <br><br>SPOILERS:<br><br>The story wraps up nicely, with the pain of Maleficent losing her wings\nbeing redeemed by the girl returning them to her, the evil man who\nstole them from her dies, and the girl - not Maleficent - becomes the\nqueen of the faerie kingdom. I couldn't have come up with a more\nperfect ending to this film.\n"},
{"review": "\nA great new take on \"sleeping beauty\", this is also and foremost\nevidence that Angelina Jolie is not a superstar for nothing, but\nactually a really great actress. Given there are over 500 reviews\nonline, mine will be brief:<br><br>Having just watched this show at a club re-run, I was shocked to find\nsuch a good show receiving only 7.1 average- so shocked that I\nregistered with IMDb to give a better rating, for whatever my vote is\nworth. <br><br>Why is this show so good? Well, it surprises the spectator. Firstly,\nthis is much darker and cynically witty than one would expect from a\nDisney movie. There is a sharp contrast between cartoonish, slapstick\n(literally) acting and quoting of imagery from older, \"classic\" Disney\ninterpretation and Angelina Jolie's look. Secondly, the old tale is\npresented with a twist that will surely appeal to anybody who enjoyed\n\"Wicked\". And then there is Angelina Jolie, most of her acting reduced\nto facial expressions, and subtle looks.<br><br>Who should watch? From teenage on, anybody who enjoys fantastic\nstories, is able to bear mild violence and is happy to see old stories\ntold in new ways.\n"},
{"review": "\nIt's amazing how some people think. This movie is so awesome it has\neverything you need. You want a love story, it's there. You want\nrevenge, it's got you covered. They took an old classic and gave it a\nnice twist. They brought the story to life and gave it flare. The movie\nis not dull at all. Seeing how Stephan's love turns to hate was great.\nHow they showed him become the monster was classic. Angelina Jolie\nacting was on point. She played the part of the scorned fairy so well.\nYou emphasized with her story. I wanted her to get revenge against\nStephan. The girl who played snow white fit the ideal character. Her\nsmile and demeanor showed caring and wonder. You believed the fairy\nland was real. I have nothing negative to say about this movie. It's a\nnice take on an old story.\n"},
{"review": "\nI don't usually write reviews but this movie blew me away. It was\namazing in so many ways. The animation for one was beautiful and\nintense, watching Maleficent fly was emotional and inspiring. I\ncouldn't help but think how amazing this movie must have been in the\ntheater!<br><br>This movie was humorous in it's own special way, Maleficent's\npersonality was both emotional and hilarious at times. I found myself\nlaughing a lot, and really feeling all of her emotions throughout the\nmovie.<br><br>This is a great movie for everyone. <br><br>I can't say enough how well done this movie was, it had every element I\nenjoy, and the characters/character growth was well done!<br><br>This movie kept me anticipating what was to come next the entire time.\n"},
{"review": "\nI just went to see it tonight. I have an even greater admiration for\nAngelina and her unique talent as an actress. I could somehow feel the\npain and hurt from the betrayal of Stefan. Yet, I wondered if there\nmight ever be a revelation that he stole her wings because he loved her\nand didn't want to kill her - he thought this would be a win win! I\ndon't understand how she could turn one man into anything she wanted,\nbut could not do this to herself or to anyone else. When her follower\nbecame trapped as a dragon, that would have been perfect timing to turn\nhim into a worm and then he would have been free from the chains! She\ncould have made him back into an even fiercer dragon after that. I\nwondered if her newly softened heart might have been able to soften\nthat of Stefan and the two of them become loving parents to the young\ngirl they love, but I guess not. I would have liked to see the look on\nhis face from knowing that his precious daughter betrayed him by\ngetting the wings back to Maleficent. Instead the battle continues\nuntil his eventual death. I really loved the special effects. I am an\neven bigger fan of Angelina than ever before!\n"},
{"review": "\nThis is actually the strangest version of the fairy tale \"Sleeping\nBeauty\". The whole plot gets complicated and constantly I've been\nasking myself during the movie: \"who is the villain and who is the good\none\"? Here it seems everything messes up. The three fairies who were\nsupposed to raise Aurora properly and protect her from the curse seem\nto not do their job at all but quarrel and not know even how to feed a\nbaby. Moreover, Aurora seems free to wander into the woods whenever she\nwants, so obviously there isn't any effort from the fairies to take a\ngood care of her. I think that makes no sense at all. The main issue in\nthis tale is the \"Maleficient\" as a notion. Surely I liked the twist of\nthe tale when the evil fairy wants to break the curse because she\nbegins to like her victim. I mean, this happens, and it gives a good\nmessage in a certain point, however, there isn't a distinctive line or\ngap between the good and the evil. There are many turning points like\nwhen Stefan harms Maleficient (Stefan now is the bad guy), when\nMaleficient takes revenge (and Stefan becomes the victim of his own\nambition), and when she protects Aurora more than the three dumb and\nirresponsible fairies. Being a man doesn't mean you're definitely good,\nand being a fairy with black wings and horns doesn't mean you're bad.\nThat seems to be the moral of the story, which I find it very\ncontroversial and ambiguous.\n"},
{"review": "\nOverall I'd say it is a nice movie, but at the same time it suffers\nfrom it's own premise to put a different spin on the story. It ended up\nbeing to 2/3 a typical fairy tale story and to 1/3 an attempt of a\ncharacter study around a well known villain. However, they make the\nsame mistake as so many other studios/directors and underestimate the\nkids ability to understand a story with depth. Overall it simplifies\nthe new angle of Maleficent too much, which takes away quite a bit of\nthe intriguing idea to make the villain the protagonist with a\nredemption arc. Besides the flaws with the concept, the visuals are\ngreat and the acting around Jolie is decent. It's not a must-see movie\nbut still quite entertaining for the whole family if your kids are a\nbit older.\n"},
{"review": "\nI recommend people go to see this spectacular 3D film. I really enjoyed\nthe film because of the acting of Angelina Jolie, the main actor, the\nstar power Ms Jolie has as well as the visual beauty. Ms Jolie has the\nvery strong star power since she stars the vengeful fairy who helps the\ngirl. In her real life, Ms Jolie is an UN Ambassador as well as she has\nbeen trying to protect girls and women around the world from crimes\nagainst them. The film also makes spectators realize the fact that\nthere are different kinds of love in the world. I believe that people\nin any generations will enjoy the film because of the good acting of Ms\nJolie as well as the great nature.\n"},
{"review": "\nA little self-serving on Jolie's part, but still worth watching.\nInteresting take on the original version. Lovely cinematography.\nEnjoyable characters. Nice costumes. Decent special effects. A dragon.\nYou know, all the stuff that makes a good movie experience nowadays. <br><br>Although there is some serious content, this is still good family fare.\nThis is not your mamma's Sleeping Beauty however, so if you are looking\nfor the traditional, Disney story, you may be disappointed. This is all\nMaleficent. Some content may be a bit much for younger viewers.<br><br>I enjoyed the background experiences of the characters and was okay\nwith the \"re-telling\" or just plain fabrication of the story. It served\nit's purpose to \"fill in the blanks.\"\n"},
{"review": "\nThe movie was beautiful, Angleina Jolie's cheekbones are magnificent,\nher horns are envy worthy and I am really enjoying how Disney is\nstarting to show the Villains side of the story. Oh and not to mention\nMaleficent's leather outfit at the end. I mean... If anything is a\n\"must see\" in the movie, it is that outfit.<br><br>Maleficent is about a fairy (named Maleficent) who, as a child, meets a\nhuman boy (Stefan). They spend a lot of time together while growing up\nand learn to trust each other. When Stefan is grown, he stops coming to\nvisit her. The next time he sees her is in a battle, years later, when\nthe corrupt King tries to invade the beautiful land that she and the\nrest of the magical creatures live in. During the battle, Maleficent\ndefeats the King and before he dies he claims \"Whoever kills Maleficent\nwill be my successor.\" Well, Stefan  knows he can regain her trust and\nkill her to become King.  He then drugs her and attempts to kill her\nbut cannot. His solution to still be the Kings successor? Take her\nwings from her and offer them to the King.<br><br>So from there, they fight. And this is where the story of Sleeping\nBeauty comes in. Idk - it was good, the interactions between Aurora and\nMaleficent are funny and sweet. But it felt very rushed and almost too\n\"Disney\". There's a really intense scene where Maleficent is choking\nsomeone and there is a really long pause for effect and she says \"IT'S.\nOVER.\" Now, I would typically expect some sort of profanity or a\nstronger line than that, but that's what they went with. So.<br><br>Oh. And the crow is hilarious. <br><br>Moral of the story: don't cast a spell that \"nothing on earth can\nbreak\" and there's always two sides to a story.<br><br>If you like Disney, go see it. If there are other movies you want to\nsee (Chef, 22 Jump Street, How to Train Your Dragon 2, A million Ways\nto Die in the West, Million Dollar Arm, Jersey Boys, Neighbors,\nBlended, Spider Man, The Other Woman...) Go see that instead.\n"},
{"review": "\nEnter the darkly magical world of Maleficent, a beautiful, exciting\ntwist on the original 'Sleeping Beauty'. The story is complex, with\ninteresting and well thought out characters, whilst remaining\nunderstandable for the younger audience.<br><br>The scenery in the film is beautiful, with both dark and bright visuals\ncomplimenting each other perfectly and unusual and amazing, glowing\ncreatures and beings throughout the film completed the fantasy world.<br><br>Angelina Jolie plays an outstanding villain. She portrays Maleficent as\npowerful and dangerous whilst still remaining graceful. Her acting is\nperfect for the role. Diaval is a brilliant secondary character\nthroughout movie and is well portrayed by Sam Riley. <br><br>Although, there were certain characters which caused the movie to fall\nshort of wonderful. Princess Aurora, a main character during the film,\nwas quite two dimensional and bland, making it difficult to sympathize\nwith her. <br><br>The fairies that looked after the princess as she grew, although\nextremely irritating, were adored by the children in the audience and\ngot quite a few laughs out of them.<br><br>All in all, Maleficent was a brilliant film for the family to see. An\ninteresting story, supported by good acting and complex characters earn\nthis movie an 8/10.\n"},
{"review": "\nFirst off, the graphics and twist on the story are absolutely\nastonishing. Who would think to turn Maleficent into a misunderstood,\nscorned fairy warrior? Well, Disney, of course! Angelina is by far the\nbest woman ever to play the role, live-action or voice-over. Elle is\ngood as Aurora, but her sister Dakota could have possibly played it\nbetter. All in all, the story is still amazing.<br><br>Sharlto Copley can play as good a bad guy as the best of them, even\nwhen he's the opposite in real life. But all other facts aside, the\nplot, execution, and storyline twists are out of this world, making a\nlovable version of Maleficent that the whole family will enjoy. This is\nby far one of Disney's greatest live-action accomplishments, right up\nthere with Pirates of the Caribbean and National Treasure.\n"},
{"review": "\nWhen I turned on the movie, I was expecting another cheesy version of a\nfairytale or a twist on the fairytale all together. I enjoy watching\nthe original Sleeping Beauty and didn't want this to ruin it for me. I\nwas hooked the second the screen lit up with the first scene. It shows\nthe background behind what made Maleficent the way she is. It shows\nwhat made her want to put the spell on Aurora when she was born. After\nthe spell is placed, Maleficent watched Aurora from a distance. The\ndirector does a great job of showing the mystery of Maleficent by\nkeeping her in the shadows and having her wear the dark closes to show\nthe evil side of her. Maleficent interacts with Aurora off and on\nthroughout the movie. I like that Maleficent doesn't interact with\nAurora as if she was the girl that she put the spell on. Instead, she\nis more of a motherly figure and the warm in the character is\ncomforting to the person watching the movie as well as to the other\ncharacters. I like that in the end Maleficent comes out of the\ndarkness. Also, instead of falling back into the concept of a prince\nsaving the princess, the love of Maleficent is what brings Aurora out\nof her sleep. The movie overall was very enjoyable and I suggest to\nanyone that is contemplating watching it to do so. It was definitely\nworth the time.\n"},
{"review": "\nViewing the story of Sleeping Beauty through the eyes of the villain,\nwas a unique twist on the traditional fairytale where the wicked witch\nwas the true victim in this tale. The movie was compelling,\nheart-wrenching, and had me on the edge of my seat the entire time. I\nwas forced through a roller-coaster of emotions, finding myself wanting\nto cry out to the TV as if the characters could hear me if I did. The\nmovie pulls away from the traditional idea of \"true love\" the Grimm\nBrothers originated in stories such as Cinderella, Snow White, and of\ncourse Sleeping Beauty. The movie teaches us there is more to \"true\nlove\" than good looks and a heart stopping kiss between a prince and a\nprincess. Maleficent is capturing movie that anyone can find enjoyment\nout of.\n"},
{"review": "\nI liked this movie. I wouldn't say that this was Angelina Jolie's best\nperformance, it was like watching Lara Croft with wings, however, the\nstory was fantastic, a very good adaptation. Despite the lack of depth\nin Angelina Jolie's interpretation, the movie will keep you awake and\ninterested all the time. It is not easy to turn a hero into a villain\nand a villain into a hero at the same time, but they did it in this\nmovie. It was nice to see Imelda Stauton again after Harry Potter,\nhowever, it was like watching Dolores Umbridge again. They created a\nbeautiful fairy world with extraordinary creatures and visuals. Does\nreal love exist? Well, watch this movie and find that out. The message\nis clear. And I agree.\n"},
{"review": "\nMAY HAVE STORY LINE SPOILERS. <br><br>Growing up, Sleeping Beauty was always my favorite. Being able to\nremember the original Sleeping Beauty story will make this movie even\nbetter for you. I wasn't quite sure how this movie would turn out,\nbeing from the villains point of view. But WOWZA!!!!!! I'm in LOVE with\nthis story!!!! Absolutely NOTHING I EXPECTED. The way the writers\ntwisted the original Sleeping Beauty story line was genius!!! Very well\nmade, acting never falters. And speaking of acting. Angelina Jolie,\nwhether you love or hate her- she was phenomenal in this portrayal of\nMaleficent! I don't think any actress out there could've done it\nbetter. I stated there may be spoilers but I don't want to give to much\nbecause I want the element of surprise but from beginning to end- it\nwas so well done!!! I laughed, I cried, I felt these characters pain\nand laughter: go see it! It's worth watching!!!!!\n"},
{"review": "\n\"Maleficent\" is a live-action re-imaging of \"Sleeping Beauty\", that\nlike the Broadway Musical, \"Wicked\" based on \"The Wizard of Oz,\" tells\nthe story from the perspective of the villain or antagonist \u0096 in this\ncase Maleficent, played by Angelina Jolie. Without going into detail,\nthe first 1/3rd of the movie chronicles the character of Maleficent's\nbackground, and how she came into contact with Stefan, played by\nShartlo Copley, who goes onto to father of Sleeping Beauty herself,\nAurora, played by Ellen Fanning. That portion of the movie shows what\ndrives Maleficent to act in the manner in which she does, and in\ntelling it from the perspective of her background, empathy is created\nfor her. Overall, I enjoyed the movie very much, and found it very\ncharming. Angelia Jolie plays the character very well, and the rest of\nthe cast pretty much follows suit. The Visuals Effects while not always\nperfect, for the most part of well done. It is not outstanding, but for\nfans of the story, and if you have any affinity for fantasy in general\n\u0096 It's a nice movie. 3 ¼ out of 4 Stars.\n"},
{"review": "\nI like it when the whole fairy tale characters and the environment were\nmade real in the film. Angelina was so believable and carried on the\nrole with glamour and fierce at the same time. But what really got me\nis how the story was re-told in a completely different point of view:\nthe villain's, which I think made the story possess some sense of\ndepth. Although this kind of approach is already familiar to some such\nas, the TV series 'One Upon A Time' wherein the writers give a\ncompletely different approach in retelling the story of each fairy tale\ncharacter.<br><br>And I think, emphasizing on what really behind the story we've all been\ntold as kids is what's really capturing and refreshing to the mind of\nthe viewers. <br><br>Eg., how a 'true love's kiss' could break the spell (who possessed the\ncurse-breaking kiss) and who is the real sleeping beauty in a\nmetaphorical sense.<br><br>I was never a fan of sleeping beauty. But now, I am..\n"},
{"review": "\nThis film tells the story of a fairy who cast a spell out of revenge on\nthe king's daughter, who will fall into eternal asleep on her sixteenth\nbirthday.<br><br>\"Maleficent\" has beautiful visuals. The fairy land scenes are\nbeautiful, and the characters are beautifully designed too.\nMaleficent's look is cold and fierce, yet somewhat noble and not too\nscary for kids. I like the way the teenage Aurora bonds with\nMaleficent, it shows that there's good in everyone. Just trust and love\nthe people around you, and the world will be a better place. It is an\nenjoyable story.\n"},
{"review": "\nThe best thing in this film is the performance of Angelina Jolie as\nMaleficent, it has been incredible. No doubt about it.<br><br>Other thing that makes the film so beautiful and good is the atmosphere\nand the sceneries. All of them are perfect and it help us to get\ninvolved in the film. <br><br>Moreover,the story about the Disney princess's is different, it is a\nnew vision of the classic tale. But in my opinion, in some scenes\nMaleficent should be more evil than she is yet.<br><br>So, in general I liked the film. I have been able to enjoy it and\nAngelina Jolie has been perfect.\n"},
{"review": "\nIt is heartening to see Disney finally on par with its creative and\nresourceful counterparts (Pixar and Dreamworks, to name but two) and\nstarting to produce new adaptations of well-known fairy tales. This\ntrend can be seen from some of the more recent animations like Tangled\nand the must-see Frozen - the \"twist-in-the-tale\" aside, the message\nand moral of these tales are appropriately adjusted to target the\naudience of the modern age. Gone are the long wait for Prince Charming\nto save the damsel in distress and save the day, and princesses must\nlearn to fend for themselves (I can't help wondering if this type of\nself-reliant princess is based on Princess Fiona in Shrek). Angelina\nJolie excels herself in the role of Maleficient and lends a dark evil\nsensual side to this traditional villain; rendering her extreme angst\nand vindictive actions understandable - in fact, all her vengeful\nmalice should be condoned, considering it was humans wronging her in\nthe first place. Though I doubt if this movie is appropriate for\nchildren with its poignant take-home messages, this is also the down\nside to this new genre of \"rewritten fairy tales\".\n"},
{"review": "\nI, like many I suspect, only went to see this movie because Angelina\nJolie was the star actraction. But not even the lovely Angelina could\nsave this movie. Again, I chose to ignore the critics and go see it.\nWhile I can say that I still enjoyed it. I have a serious thing about\nmovies that make things too \"convenient\" you'll learn what I mean if\nyou choose to go see it. The story was flat, but the visuals were\nexcellent. I'm just sad that I chose not to see it in 3D. It is\ncompletely possible to find onesself asleep during this flick as the\nstory is simple and meanders along slowly towards it's predictable, and\ninevitable conclusion. Anyone who doesn't see it coming should be\nreintroduced to every movie ever made. Still Angelina deserves at least\na 5.\n"},
{"review": "\nHave you seen Maleficent? It's really good. I honestly thought Angelina\nJolie was done, but she was amazing. Have you seen Maleficent? It's\nreally good. I honestly thought Angelina Jolie was done, but she was\namazing.Have you seen Maleficent? It's really good. I honestly thought\nAngelina Jolie was done, but she was amazing.Have you seen Maleficent?\nIt's really good. I honestly thought Angelina Jolie was done, but she\nwas amazing.Have you seen Maleficent? It's really good. I honestly\nthought Angelina Jolie was done, but she was amazing.Have you seen\nMaleficent? It's really good. I honestly thought Angelina Jolie was\ndone, but she was amazing.Have you seen Maleficent? It's really good. I\nhonestly thought Angelina Jolie was done, but she was amazing.Have you\nseen Maleficent? It's really good. I honestly thought Angelina Jolie\nwas done, but she was amazing.Have you seen Maleficent? It's really\ngood. I honestly thought Angelina Jolie was done, but she was\namazing.Have you seen Maleficent? It's really good. I honestly thought\nAngelina Jolie was done, but she was amazing.\n"},
{"review": "\nI love this movie! Excellent acting by Angelina! It is worth watching\nit!!!!!! This is a movie that all our children would love to tell their\nchildren in the future. Firstly, I thought this is just a movie of a\nfairy because of the introduction at the very beginning with the little\nmaleficent but later on, it turned in to a giant picture which can\nstole our hearts by the storyline. The things I wish I could change in\nthis movie are, firstly I wish the dragon had more muscle power in it\nwhen the solders trapped it down and at that scene, Angelina was\nwearing a tight black trouser that we can not imagine a fairy would\nwear. Secondly, I wish King Stefan could see how Maleficent loves his\ndaughter before he dies. But, overall, excellent directing! Excellent\nacting! That's all I can say.\n"},
{"review": "\nIt seems every film Angelina Jolie is in, they get progressively\nbetter.<br><br>Angelina played the part with such a beautifully placid air, the\nhesitancy to smile as a wronged soul, then the ever-so slight curl of a\nsmile breaking the corner of her lips as she watched Aurora's mud\nfight, brings much more joy to the viewer than had she broken out in\nraucous laughter. Brilliantly acted.<br><br>The rest of the film is impeccably done, the 3d, CGI, the set and\ncostume design, the fantasy figures, some beautiful, some goofy and\nhumorous.<br><br>The acting was good enough to have you believing what you were\nwatching, and that is the important part. You find yourself moving\nthrough moments of tears, moments of joy. Thoroughly enjoyed the film.<br><br>Well done Roth Films and Kudos to Disney for their usual great taste in\nfun.\n"},
{"review": "\nIt looks as though Maleficent is another of those movies that sits\nunder the Disney banner, yet is far from a children's only movie.\nThere's death, destruction, duplicity and derring do in equal measure.<br><br>Yes, despite the fact that there are fairies, nymphs and other mythical\ncreatures that might inhabit the usual children's story, this would\nprobably sit more comfortably with the original Grimm stories than\nDisney's animated version from 1959.<br><br>The fact is though, after the Pirates of the Caribbean series, we are\nfast becoming used to a more adult story line in Disney's live action\nmovies and in my opinion, they're all the better for it.<br><br>Maleficent appears to follow the same course as Sleeping Beauty, but is\nfar less predictable and has a large number of twists and turns, seeing\nthe story from a refreshing viewpoint: that of the so-called, \"Wicked\nWitch\" - who this time, isn't a witch at all.<br><br>The stereotypes that usually accompany Disney films with this kind of\nstory premise are still there, but this time, are somehow more real.\nMaleficent presents us with a very believable plot - despite and\nincluding the fairies - and strong characters with very real\nmotivation.<br><br>The approach used in this movie was enough to keep us glued to the\nscreen from beginning to end, with Jolie in brilliant form in the lead\nrole. The story was riveting, keeping us guessing right up until the\nend.\n"},
{"review": "\nThis film had so much energy! The way Angelina aced her STRONG AMAZING\nperformance did this film's justice. She pushed herself to build a\nrelationship with Maleficent. Although critics were skeptical , The\nfilm itself has made $745 Million, most likely for Jolie's performance.\nI loved her in this film, she is the only reason I choose to see this\nfilm again and again! Oscar Nomiantion is for sure worthy for her role!\nElle Fanning gave a sweet yet stunning performance also, she gave\nAurora what she needed. For fans who have not yet seen this film, if\nyou are expecting the orinal , you will be let down. This is showing\nthe film from a new point of view.\n"},
{"review": "\nWell, again.. Angelina gave an outstanding performance! Throughout the\nmovie I feel her bitterness, and how hard it is to be betrayed. Until\nnow I can't think of any other actresses who can possibly do better\nthan what she did. Now, with regards to the story I'm quite pleased and\nI enjoyed it a lot! I think what made some people feel disappointed is\nthe fact that they did not see who Maleficient is, and how she was\nportrayed in Sleeping Beauty's classic story before. Probably the the\nonly missed is they weren't able to convince me that she is a villain,\nhowever, it still did not bother me, maybe it just get to prove that\nvillains have goodness in them. If I were to give criticism, probably\nit is the movie being a little bit rushed I think, there were some\npoints that must have been emphasized, like how this happened or that..\nEtc. but then I am not disappointed, the graphics, effects, and acting\nis superb! It is really not a boring movie at all. I recommend this!\n"}
]