[
{"review": "\nI know many of you, out there will disagree with me, when I say that\nSchindler's List is one of the greatest film that there has ever been.\nIt does sound that I'm extremely overrating it, but I truly believe\nthat Schindler's List is up there with The Godfather and Citizen Kane I\nmean everything about is so good, that its close to perfection.<br><br>The acting is brilliant, every actor does an amazing job. Liam Neeson\nas Schindler is incredible, no doubt about it. He should of won an\nOscar for Best Actor. Ralph Fiennes is the one, who truly is the best\nactor in the film. He plays his antagonist role as Amon Goeth, so well\nthat it is a travesty, he didn't win an Oscar for Best Supporting\nActor.<br><br>I'm happy though, that the Academy chose this film for Best Picture, it\nwas one of the best decisions they ever made. Because if this film\nwasn't considered Best Picture by the Academy, I don't know which film\nwould be, expect maybe for The Godfather.<br><br>Steven Spielberg certainly deserved an Oscar for Best Director. It was\na smart idea for Steven Spielberg to make this film in black-white\nbecause it made the movie more bleak, emotional, hopelessness. But you\nsee small patches of color -- A candle and a child's coat bringing the\nevilness of the tragedy into a agonizing focus.<br><br>There's no doubt about it, this film will be a classic in decades, even\nhundreds of years to come in cinema. This film is without a doubt, the\nBest film that Spielberg has ever made. With many other Steven\nSpielberg's classics like Jurassic Park,Jaws,E.T, Raider of the Lost\nArk, Saving Private Ryan, etc. Schindler's List will always be Steven\nSpielberg's most finest, important film. He blends his humanism to the\ntragic horror of the Holocaust to create an emotional masterpiece.<br><br>10/10 Absolutely Recommended!\n"},
{"review": "\n\nMany movies come out each year and we applaud them for their screen play,\norginality and whatever else we can say about a movie. But only once in a\nlong while does one come out and you say all those nice things, but one you\nwill also never forget. This movie is more than just something for us to\nwatch for 3 hours and 17 minutes, it is something for us to never forget,\nto\nteach us a lesson and to remember those who died needlessly along with\nthose\nwho tried to help those same people survive. \n"},
{"review": "\n\nSchindler's List is not only a pure masterpiece but, for me, it is one of\nthe greatest films ever made in the world.<br><br>The film starts off to reveal a womanizing, Nazi business man who profited\noff of slave labor.  The Nazi business man is of course Oskar Schindler.\nOskar is just like most men.  He has a love for good wine, beautiful\nwomen,\nand pursues happiness through the success of his business.  But on his\njourney to a successful business, millions of Jews were being killed\nduring\na time which most label as one of the darkest periods of human history.\nAs\nOskar made money, innocent people were being murdered.  That's when the\nself-centered, often money hungry Oskar steps in and gives up his goal of\nhaving a successful business to save the lives of over 1,000\nJews.<br><br>This film is about redemption and was beautifully photographed in black\nand\nwhite by Janusz Kaminski (cinematographer).  At the helm is no one other\nthan Steven Spielberg, who brilliantly called non-pretentious shots and\nbrought back to life a time and period most want to forget, but shouldn't.\nThis film is a must see by me.  I give the film an \"A+\" (wishing I could\ngive it a higher grade than that) and a 10 out of 10...\n\n"},
{"review": "\n\nThe first (and last) time I viewed this masterpiece in a theater, I could\nnot help but notice the reaction of the audience upon their leaving. Some\nwere crying or trying to hold back tears, some were stunned, some had\ncompletely blank faces, some showed signs of anger; but the overall\natmosphere was one of utter silence. Never in the history of motion\npictures\nhas a film had such an emotional impact upon its constituents.\n\n"},
{"review": "\n\n     This is the best war film about the Holocaust I have ever seen. It\ndepicts the horrors of the Holocaust and war, the tragedy of Jewish nation,\nand I know, this film could be directed by a Jew, who keeps these horrible\ntimes and crimes against humanity in his heart. The tagline says \"Whoever\nsaves one life, saves the world entire\". And this film shows us that no\nhuman life can be replaced by another one, and that there is nothing more\nvaluable than HUMAN LIFE. I have not seen a film of such a power in my life.\nSuperbly directed by Steven Spielberg, magnificently photographed in\nblack-and-white by Janusz Kaminski (one of the best directors of photography\nin modern Hollywood, so to say), perfect performances by Liam Neeson and Ben\nKingsley, and, especially, John Williams' beautiful, brilliant score, brings\nthe whole horror and tragedy, cruelty of Nazism, Holocaust and War. This is\nSpielberg's Triumph. Congratulations!\n"},
{"review": "\n\nJust watched this for the second time - what a movie<br><br>No film has ever had the impact on me that this has had - even more so\nsecond time around.  Hard at times to watch and I had to switch it off for\na\nwhile.<br><br>Last scene is unforgettable.<br><br>Must be close to best film ever made and we can't forget\nit.\n\n"},
{"review": "\n\nSchindler's List is a long and tough movie to watch.  But it pays\ndividends.<br><br>We're all pretty familiar with the story - a German businessman enlists\nJews\nto work in his factory.  At first, I believe, as an opportunist, for the\nJews are cheap, readily available labour.  He does, however, become\ngradually aware that his factory means the difference between life and\ndeath.<br><br>And so his 'list' is born.  A list of Jews that he requires to 'work' for\nhim.  It is, in reality, a list of life and Schindler knows\nit.<br><br>Liam Neeson fills Schindler's boots well.  You soon forget he is Neeson at\nall.  Ben Kingsley is, ofcourse, his ever-reliable brilliant self.  And\nRalph Fiennes easily creates one of the screens most hateful villians\n(sadly, a villian who actually existed).<br><br>There are some tough scenes (most notably, the liquidation of the ghetto,\nGoeth's (Fiennes) brutality in the camp) and it's all filmed in beautiful\nblack &amp; white - except for the highlighted girl in the red dress, which has\na brilliant symbolic meaning later in the film.<br><br>A terrible chapter in humanity's history but one told so well by Spielberg\nand co.<br><br>It has a powerful and lasting effect - just as it should.\n\n"},
{"review": "\nSteven Spielberg makes one of (if not the one) his greatest movies of\nall time. Liam Neeson gives a great performance as Schindler and the\nwhole film is just powerful, amazing and sad but it doesn't matter\nbecause the movie is so good. Ralph Fiennes makes an even better\nperformance as Goeth, a man who made everyone stare into the screen\nwith anger and sadness and that is just what a movie is supposed to\ndo-make you feel sad, happy, angry or effect you in some way. I read\nthat someone thought it was overrated and bad, but I think it's a\nclassic and it'll never go away. So if you want to see one of the\ngreatest historical films ever made, then go see Schindler's List.<br><br>EDIT: I wrote this when I was 12 or 13, and I'm so sorry about my AWFUL\nEnglish... Ah, well just have that in mind when you read this. =)\n"},
{"review": "\n\nTo sum up Spielberg's masterwork in one word is a nearly impossible task,\nbut I have come to the conclusion that Schindler's List is perfect. Liam\nNeeson as Oskar Schindler is truly great in recreating the role of a\nmodern\nday Moses. Making this film all the more compelling is John Williams'\nperfectly composed original musical score. This film deserves all the\nawards\nbestowed upon it, especially best picture by the National Board of Review\nand the Academy and the Academy Award for best director Steven Spielberg.\nIt\ndeserves all these awards and more. Schindler's List is a film that\neveryone\nshould see and appreciate to its fullest extent. Spielberg will remain an\nimmortal filmmaker through the work he put into this film.\n\n"},
{"review": "\nWhen I first saw that Spielberg was behind the movie, I had my doubts\nsince his earlier work doesn't really fall into this category, but I\nheld faith and I have not been disappointed! From the beginning it is\nsuch a powerful and moving film and it brought tears to my eyes more\nthen once. It is completely set in Black &amp; White, except for the Red\nCoat Girl which is pure genius, since it really helps develop the time\nperiod it was portrayed in.<br><br>The Actors too were completely fantastic! Every single actor and extra\nseemed to be doing their very best and really lived their roles,\nespecially Ralph Fiennes, who was brilliant as the twisted Nazi Amon\nGoeth. Not just anyone could make that character real and get away with\nit. All of the characters in the film have depth and substance and the\nbest thing was that you actually see a few of the Jewish people\nthroughout the entire film so we can sympathize with their tale more.<br><br>It's a film to watch if you enjoy depth and meaning. 9 Stars, Excellent\nFilm!\n"},
{"review": "\n\n\" I....pardon you.\"<br><br>These words spoken by Amon Goethe (Ralph Fiennes) during the film can be\naptly used to signify the themes of this film: power and\nforgiveness.<br><br>I am part of the post war generation who has been lucky enough not to\nexperience any major war. And after watching this film, I have deep respect\nand feelings for those who suffered during these times, be it the Holocaust\nor the Nam war. This film was just waiting to be made and I'm glad it was\nthe right man who dared to take up the challenge. Any other person would\nnot\nhave done it justice.<br><br>The film focuses on how a German named Oskar Schindler saved the lives of\nthousands of Jews by employing them to work in his factory during WWII.\nHowever, I feel the film's primary aim is not to show us Schindler's\nkindness but the horrors of war. There are some of the most true and\ngraphic\nscenes here ever captured on celluloid. People being shot for no particular\nreason, hiding in fear, stripped and gased, abused......so much so that\nviewers watching it for the 1st time will be deeply affected. We have never\ngot to see this \"flip side\" of the war in many Hollywood productions which\nonly focuses on action and their unrealistic \"gung-ho\" heroes. ( Another\nexcellent film would be \"Saving Pte Ryan\" by Spielberg again ) War and its\nhorrors are finally and faithfully recreated for the audience.<br><br>Like the film Raging Bull, its shot beautifully in black and white to\nreflect the era and tone of the film. Liam Neeson and Ralph Fiennes are\nexcellent, esp the latter for his frightening protrayal of Amon Goethe. The\nscene where they discuss about power is a classic and the subsequent one\nwhere Amon 'pardons' a young jew remains as one of my many\nfavs!<br><br>\n"},
{"review": "\nThe most amazing thing about this film is that it was not made to be an\nepic or an acclaimed film. Spielberg made it as a personal film for\nhimself and other Jews affected by the Holocaust. There is nothing\nflashy about the film except for Neeson's bravura performance.\nSpielberg's usual style is invisible, and the cinematography and\nediting, although excellent, are not shown off to make a spectacle of\nthe film or give it an epic feel. Yet it is still a compulsive,\ninvolving, and utterly heart-wrenchingly moving filming of a part of\nhistory that should not be forgotten. The screenplay is one of the best\never written: it captures the stories of so many Holocaust survivors\nbut without distracting from the main story at hand. The black and\nwhite photography and editing is perfect, and John Williams provides a\nperfectly subtle but nice music score. The acting is simply brilliant,\nwith Liam Neeson towering as Oskar Schindler, and Ralph Fiennes\nbringing out the Nazi character Amon Goeth into full flesh. And Ben\nKingsley and Embeth Davidtz give off excellent performances too. The\nfilm also has a lot to say about absolute power corrupting and\nspiraling out of control, and such a message of the film can be applied\nto any time and crisis, not just the Holocaust. This is not just one of\nthe the ten best films ever produced, but it shall remain so for years\nto come, because its messages in terms of power and racism are\napplicable in any age.\n"},
{"review": "\n\nAh, Spielberg's favourite theme: every single Germans pre 1950 was utterly\nevil and/or calculating and self serving.  Still, at least after being\nbludgeoned around the head with this one note message for the best part of 3\nhours, I had stopped noticing that the acting consists of just reading lines\nand not tripping over the furniture.<br><br>The cinematography is admittedly impressive, but the sound is either\noverbearing or cynically manipulative, and the emotional crecendo at the end\nis so overdone as to be positively irritating.<br><br>And lastly, while the history is substantially correct, there are enough\nerrors or omissions to shove a stick in the spokes of any claim to\nauthenticity.  This isn't entertainment, and it's not accurate enough to be\ndocumentary, so what does that leave?  Sadly, propaganda.\n"},
{"review": "\n\nAs a (Jewish) professor of mine once said, \"Spielberg doesn't have a\nglimmer\nof what it would take to do this material right.\" Don't be suckered by the\nsubject matter--it's still schlockified for mass consumption. And worse\nstill, it's likely the reason why every year since then we have to put up\nwith some sappy Spielberg backed Holocaust movie or documentary winning\nanother Oscar. Is this really how we want to respond emotionally,\nintellectually and otherwise? \n"},
{"review": "\n\nHere is Barbara's List of all the reasons why Schindler's List is the most\nannoyingly overpraised film of all time.\n1.Overlong\n2.Spielberg's most self-indulgent film, which is pretty pathetic,\nconsidering that he also made Saving Private Ryan\n3.self-consciously arty\n4.overabundance of cheesy filmmaking gimmicks.<br><br>If I had more time, I could go on forever....\n"},
{"review": "\n\n Spielberg is now the Numero Uno director of schmaltzy cinema. I thought\nSaving Private Ryan was the ultimate good guys save the poor soul, but this\none outdoes Ryan in every conceivable heart-tugging,\nnoble humanity fashion. Don't view this film as accurate history, if<br><br>Private Ryan is any guide. Historical accuracy is not a\nSpielberg\ncharacteristic. It's the heartstrings he keeps tugging. I next expect a new\nPollyanna by Spielberg any day now. The problem with Spielberg's\ncharacterizations is that people are either black or white, no inbetweens\nare allowed. But even  old Adolph can be presented in a way that makes him\nthe human being that he was, regardless. This is what makes Shakespeare such\na genius in his plays - he never failed to see all sides of a personality.\nSpielberg's characterizations are cartoons.\nThis could have been a really good movie, if it had acknowledged the<br><br>humanity in every person and been realistic. \n"},
{"review": "\nThe Nazis in Schindler's List are portrayed as evil heartless demons\nwho seem to lack any kind of soul (well, Amon Goeth was pretty evil),\nwhile Schindler and other \"goodies\" are portrayed as saints with hearts\nof butter; It's time to wake up people! My grandfather who is now 85\nserved in the war verses the Germans. I've had many talks with him and\nhis war buddys and I can promise you that what you see in this film\n(and many others that are \"based on truth\") is purely fictional and\nshouldn't be allowed to even claim it is based on truth. And if it must\nit should have to give us a percentage of truth that it is based on,\neg: based on 6% truth. Honestly, just take a look at the war on Iraq to\nsee a current example of how the victors completely turn the truth on\nits head and sell it to the masses; who readily accept it as fact. <br><br>Schindler at the end of the film is seen giving away his watch and a\nfew rings (last of his possessions) as to save a few more Jews. Well,\ntruth is Schindler made off with A LOT of money in reality. He profited\nfrom the Jews slave labor just as much as they profited off his\nhumanity. I'm not saying that Schindler wasn't a good man for saving\nthe many Jews that he did, I'm just saying lets not go overboard with\nthe exaggeration. And this is just one of the many liberties the\ndirector took with this story to spice it up a bit. Some of the scenes\nwhich were designed to shock the audience with brutality from the Nazis\ntowards the Jews were so over dramatized and fake they made me want to\nblow chunks in my popcorn. I don't mind fantasy but for gods sake don't\nmix it with truth, especially when you have an audience which sadly\nseem to often refer to this film when they are in a debate about world\nwar 2 or the holocaust, as if it was some kind of historical reference\nwith any credibility.<br><br>PS: For a good film about world war 2 and the Nazis, check out\n\"DownFall\", a German film which is very, very well made.\n"},
{"review": "\n\nFirst I have to say that being born in Poland, I knew about holocaust since\nbefore I was 10. I guess only in Israel people are more aware of it. It is a\nvery sensitive topic, and making a movie about how millions of people were\nexterminated in death camps seems like trivialising the topic. On the other\nhand criticizing the movie for it's factual faults is even more slippery\nnontheless. The movie itself is very good indeed, with great acting,\nmemorable scenes, and overall very impressive. I remember that when the end\ncredits started rolling people in the theater were very quiet, and didn't\nmove. Many were shocked by the realism of this movie. It surely is one of\nthe greatest movies ever, but Steven Spielberg intended it to be much more\nthan just a movie. This is where I stop admiring his work.<br><br>Many will take this film's version of history as a fact. I'm talking about\nthe way Poles were shown in SL. Mr. Spielberg presents us as hateful\nantisemitic creatures, and he does it so convincingly that if I didn't know\nany better I would surely believe it. The second issue is the gas chamber\nscene - in reality, none of the people who would enter the so called \"shower\nroom\" would survive. And as for Oskar Schindler - he didn't consider himself\nas a man on the mission, not concerned about his profits at all. To sum it\noff - If you didn't see this movie, go see it.<br><br>But don't stop there, find some real live accounts of holocaust\nsurvivors.<br><br>\n"},
{"review": "\nwhen i say overrated, really i mean it..<br><br>i just watched this movie and i found it boring 3 hours for nothing\nthis movie is just to make people feel sorry about the Jewish i want to\nsay we must feel sorry about any human .. Jewish have made many\nholocaust in Palestine and no one said a word.<br><br>and why they screen it in black and white i don't know i think there is\nbetter movies about war and Nazis or Jews i wonder why this movie have\nthis high rating i think Liam neeson and Ralph fiennes acting was very\ngood specially for ralph but there is many actors in the movie they not\ngood .\n"},
{"review": "\nThis is honestly one of the most overrated films of all time. Stephen\nSpielberg (one of the most overrated directors of all time, who has not\nmade ONE honestly good film (yes, even including \"Jaws\")) knew that\nnobody could objectively criticize this movie, and basically exploited\nthe memory of the Holocaust in order to guarantee himself a\n\"masterpiece\".<br><br>I am rating this movie as 1(awful), because of all the undeserved\npraise. If this film were being judged solely on it's own merits, I\nwould probably rate it a 2 or 3 at best, for being exploitative,\ndishonestly emotionally manipulative, historically inaccurate, and\nartistically bankrupt.\n"},
{"review": "\n\nfor gods sake this movies is not THAT good, of course no one will say that\nbecause to say anything that isn't \"best movie of blah blah\" would be\nantisemitic and the words of a nazi.  This movies does not deserve to be\nso\nhighly ranked.  I could direct a claymation nazi death camp movie with a\nbudget of $7 and probably get on the top 250.  I write this in hope when\nyou\ngo to vote for this movie you remember that NO ONE IS WATCHING feel free\nto\nactually vote your thoughts on the movie not the events it\nshows.\n"},
{"review": "\nWhat can be said other than that one word...powerful.<br><br>Stephen Spielberg has done what others have tried before, but failed.\nHe has brought the horrors of the holocaust to the masses.<br><br>I just watched this again for the first time in ten years or however\nlong it's been. Not only is it relevant, but it's hard hitting and\ndifficult to pull your eyes away from.<br><br>Fiennes, Neeson and Kingsley - how often do you get that group of\nactors? I urge everyone, no matter how young or how old to watch this.\nThough it's painful, it's a necessary reminder of what happened.<br><br>This is an excellent film in every way.\n"},
{"review": "\n\nOnly Stephen Spielberg could make a film about the holocaust where the\npoint\nis that none of the major characters do NOT die.  To me the message is\nlost\nbecause of this and the film becomes a glorification of one man surrounded\nby the deaths of millions.  Oscar Schindler was a Nazi embroiled in the\nholocaust and the second world war.  He managed to save his friends, yet\nprofited from concentration camps.  Ok, so he wasn't an anti-semite bent\non\ndestruction, but he only saved people he was connected to, and their\nfamilies.<br><br>And the evil Nazis in this film are all slightly comical.  Where is the\nevil?  Where is the horror?  Where is all the death and torture and\nmisery.<br><br>Scrape the surface of this film and you find a gratuitous \"entertainment\"\nmovie.  If you want to know about the holocaust watch Shoah.\n"},
{"review": "\nI am from India. I am interested to see path breaking movies in any\nlanguage. I watched many Hollywood movies in my laptop. After I\nsaw/heard good review about this movie. I got this movie from one of my\nfriend and I copied to my personal laptop, its been around 7 years I\nkept this movie in my laptop without watching it. I apologize for that.\nwhenever I open this movie, the beginning scenes were not fascinating\nto me, that why I turned off and switch to other movies. 2 days before\nI decided to watch this movie without any distraction. I started\nwatching at midnight 1 o clock. and I finished it around 5 o clock. I\nfelt very guilty for not watching this movie for 7 years. But actually\nit was 22 years if I calculate from the year movie released. <br><br>What a movie !! I never felt this much emotional for any foreign\nlanguage movie. But this movie touched my soul. I could not control\ntears rolling out of my eyes. <br><br>This is not a movie. This is lesson to everybody. And it shows what one\nrich man can do this to the world. We wont find any rich man like Oskar\nSchindler in todays world. He was rich at his heart. The moment\nSchindler started to realize the urge to help the Jews are really\nwonderful, only god like human can do it to them. I personally believe\nGods are living in the world in form of men like Schindler. <br><br>About Spielberg, only Spielberg could create this much of emotional as\nhe is Jew. <br><br>At last, movies like these are essential to make our world better.\nAfter watching Schindler's List I started feeling all the entertainment\nmovies are crap.<br><br>If we deliver more number of movies like Schindler's List, our world\nwould become full of wonderful people. <br><br>Finally, I prayed to God for Schindler's family for having person like\nthis in their family. I bow down my head and thank to Oskar Schindler\nfor this bravery to save mankind. And thanks to Spielberg to made this\nmovie.\n"},
{"review": "\nThe Film which's plot is Hitler's Germany exhibits very well the\ntortures on Jews. The film locks audience to screen which's plot is\nplayed by Oskar Schindler. Oskar Schindler who spends too much money\nand effort to become a rich business man succeeds. At these times hate\nfor Jews grows. Jews exile from some districts. İn a short time\nthousands of Jewish people were killed and thousands lose their homes\nand children. German officers took those children to educate them like\nGermans. Oskar Schindler was letting Jews to work in his factory. He\nwas spending his power - who gained this power with his money from high\ndegree people - to save Jews. At last Germans understands Oskar\nSchindler's workings for Jewish people and he has to escape from his\ncountry.<br><br>Watch this film and if you like these type of films I can suggest you\nThe Pianist and La Vita e Bella.\n"},
{"review": "\nbest movie of Nazi persecution and one of the best films I saw in my\nlife. both the reality and the players play the role of a film can be\ncalled perfect. In many scenes you can just look at the screen\nstaying.According to my personal opinion; better than that made ​​a\nfilm about Nazi persecution yet. Sounds to me like a long time can not\nbe too. If there is no tracking who should watch. according to the\nstandards of the film a long time, yes. You do not understand how time\npasses, and finally the \"good of the pursued,\" you say. Make sure a\nmovie is definitely not wasted.I probably twenty times and each time\nI've seen something I've been watching the same enthusiasm.\n"},
{"review": "\nwhile watching i kept moved by this movie .<br><br>.Few American movies since the silent era have had anything approaching\nthis picture's narrative boldness, visual audacity, and emotional\ndirectness.The French author Flaubert once wrote that he disliked Uncle\nTom's Cabin because the author was constantly preaching against\nslavery. \"Does one have to make observations about slavery?\" he asked.\n\"Depict it; that's enough.\" And then he added, \"An author in his book\nmust be like God in the universe, present everywhere and visible\nnowhere.\" That would describe Spielberg, the author of this film. He\ndepicts the evil of the Holocaust, and he tells an incredible story of\nhow it was robbed of some of its intended victims. He does so without\nthe tricks of his trade, the directorial and dramatic contrivances that\nwould inspire the usual melodramatic payoffs. Spielberg is not visible\nin this film. But his restraint and passion are present in every shot.\n"},
{"review": "\nI am probably still too young to understand the real reasons why SL is\nhailed as one of the greatest films ever made. It was mostly shot in\nblack and white while virtually all other movies in the decades before\nand since are in colour, adding even more of a sense of realism to the\nfilm. Schindler's List is a story of a man's change of heart and\nattitude alongside themes of survival, hope, brutality (mostly served\nby Ralph Fiennes' murderous Amon Goth)and countless other situations\nfor hundreds of Jews. In black and white, the bloody, graphic summary\nexecutions of Jews throughout the film were overwhelming, the images\nfreezing me in my seat and imprinting themselves in my mind to this\nday, but they justifiably implied to you the horrors of the Holocaust\nlike no other movie. The girl in the red coat seems to symbolise, as\nher fate suggests, that there is no escape from the dominant force. The\nacting is spotless. Liam Neeson should have won an Oscar for portraying\nSchindler (I must admit, I am yet to see Tom Hanks in Philadelphia)\nwith an emotional tone, the performance launching him into\nsuper-stardom once and for all. Ben Kingsley and Ralph Fiennes also\nplayed their parts with the right touch, especially Fiennes whose\ncharacter also seems to change within, halfway through the film, but\nonly slightly, his insanity still alive as in one scene he randomly\nsnipes numerous Jewish workers from his bedroom. But the star is\ndirector Steven Spielberg, who in 1993 made maybe not his most famous\nmovie, other projects such as E.T., Saving Private Ryan, CEOTTK, the\nIndiana Jones saga also rising forward. But without question, maybe\nwith the exception of Saving Private Ryan, Schindler's List is\nSpielberg's finest work.\n"},
{"review": "\nThe Holocaust during World War II forms the backbone of the plot in\nthis highly-acclaimed, heart-touching movie. Oskar Schindler is\nintroduced as an opportunistic and avaricious businessman, who hires\nJews as workers merely because they constitute cheap labor. But, soon\nenough, his greed is subdued by his attachment to them and he plans to\nsave them from Hitler's persecution, even if he has to throw away his\nhard-earned savings as bribes to the Nazi officers. A very commendable\njob by the writers makes the character come alive very convincingly.\nLiam Neeson cannot be given any less credit for portraying the\nprotagonist and Ben Kingsley as Stern adds a cherry to the cake. But,\nthe portrayal of the setup actually used by Nazis to slaughter the\nJews, makes the audience shiver with fear and disbelief. The detailing\nand hard-work put by Spielberg is quite evident in the scene where the\nJewish children try to elude the Nazi soldiers by hiding in places\ninconceivable to any ordinary man. Another such instance is when the\nJews are transported in trains, huddled like cattle without enough\nspace to take even a whiff of air. <br><br>An unbiased judge may opine that there were quite a few instances where\nthe protagonist may have been idealized in order to make the people\nreally adore him. This can be defended by accepting that the real Oskar\nSchindler acted only as a source of inspiration for the role, and the\nrest had to be cooked up as per the appetite of the audience. All in\nall, the movie stands today as a masterpiece made once in a lifetime.\n"},
{"review": "\nIt took a long time I decided to see that movie. My grandpa was\nmurdered in Auschwitz. Now I got a different view to history of the\nholocaust. That movie helps me to understand the helplessness of the\nJews in the Nazi regime. It is a monument for my grandpa. And for all\ngood people in Germany. Thank you, Mr. Spielberg. This movie is a clear\nview to the inhumanity of the \"Third Empire\". The colors black and\nwhite stay for the death in the Nazi regime. The color red for example\nis exclusive for life in form of the red dress of the little girl. The\natmosphere mirrors the darkest time in German history. The cinema was\nfull of depressing silence after that movie. This is the best a movie\nmaker can earn.\n"},
{"review": "\nMovie Review - Schindler's List<br><br>Schindler's List is captivating because the story it tells, the\ncharacters it portrays and the way it was shot feels very real to the\naudience. Why the Nazis had persecuted the Jews was not explained,\nhowever, throughout the movie, the audience are reminded how the Jews\nare not considered as people but inferior beings. All the Nazis\nbelieved this, with the exception of Schindler, he befriended his\nJewish accountant; he showed empathy towards his workers; he even\nkissed a Jewish girl. Schindler saw the Jews as people and as his\npeers, to all the others they were an inferior life form, to be\nexterminated.<br><br>The movie was mainly shot in black and white, conveying a mood of\nbleakness and hopelessness. The most memorable use of color is the red\ncoat worn by a little girl, seen by Schindler during the evacuation to\nthe camps and again seen by him in a pile of burning corpses.<br><br>The main characters were developed in depth and detail. Schindler's\ncharacter changed from a greedy businessman to someone who spent all\nhis money bribing the 'list makers' to save as many Jews as possible.\nThe mood intensifies as the Jews realizes that they are being\nsystematically killed, and, that the Nazis are slowly loosing their\ngrasp on their humanity as they indiscriminately kill all the\nprisoners. In the end, the audience are reminded that although\nunbelievable, these events are real and that real people are depicted\nin the movie.\n"},
{"review": "\nSchindler's list gave me some insight on how Jews were treated out of\nconcentration camps in Nazi Germany. This film is about Oskar\nSchindler, a German businessman who starts a company making silverware\nusing unpaid Jewish labor during the Nazi regime. Overtime as Schindler\ndevelops empathy towards his workers. Schindler moves his factory and\nhis workers back to his hometown in Czechoslovakia and waits till the\nwar blows over. During the process of aiding the Jewish people,\nSchindler spent millions of Reich marks in order to feed and save 1100\nJews. This movie The Nazi soldiers would abuse Jews by cutting their\nhair, push them around, or even killing them. Jews were forced to wear\na Star of David and were obliged by law to inform German men that they\nare Jewish. This film shows us how Jews were forced to change their\nusual practices in daily life. This is depicted in the scene where\nSchindler tells the Rabbi that he should be preparing for the Sabbath\nsince it is Friday evening. This is also seen when the Jews are\ncelebrating and they break the glass. Overall I believe that this was a\nfantastic film that was very educational about the Holocaust and the\nJewish faith, and also an inspiring humanitarian.\n"},
{"review": "\nSteven Spielberg's Schindler's List tells what the holocaust was really\nlike from the perspective of the Jewish people when they got sent into\nthe concentration camps until a man named Oskar Schindler saves them\nfrom the concentration camps. Schindler is played by Liam Neeson who\ngives the best performance of his career as a true real life hero for\nthe German people even though he was a member of the Nazi party in real\nlife. What Spielberg tries to prove with this movie is that he is not\nonly capable of making swashbuckling epics like Raiders of the Lost\nArk, or Science fiction classics like E.T, Minority Report, Close\nEncounter of the Third Kind, or Hitchcockian thrillers like Jaws, but\nwhat he did with this movie is that he set a new movie genre to his\nmovie-making vocabulary that got Oscar buzz as soon as it came out into\ntheaters and was a total smash at the box office. Also not only Liam\nNeeson gives the best performance of his career, but so does Ralph\nFiennes who plays a Nazi soldier named Amon Goeth a soldier who five no\nmercy at all. In order for Schindler to save the Jews from getting\npersecuted what he does is that the talks to his accountant named\nItzhak Stern (played by Ben Kingsley) into making a list of the names\nof the 1200 Jewish people that he has to save. This was a remarkable\nmovie that will stay in my memory for as long as i live and what a\nmasterpiece Spielberg has created.\n"},
{"review": "\nSchindler's List remains one of the most powerful movies that I have\nEVER seen. There isn't a 100% accurate-to-history track record when it\ncome to some elements that may (or may not) help sell a movie.\nSchindler's List does is able to nearly eliminate this problem\nentirely, and the historical imagery along with no fear of exposing the\ntruth make this an incredibly powerful film.<br><br>It's availability on Blu-Ray certainly ups the picture quality on the\nmovie itself and provides additional tidbits to learn even more about\nthe film. Schindler's List is also an obvious choice for anyone\ninterested in checking out Hollywood's portrayal of such a brutal time.\n"},
{"review": "\nThis movie is made from a real story! The holocaust DID happen! NEVER\nFOGET.<br><br>Few films ever made get the distinct honor of being one of the best\nfilm ever made., and this is one. When I saw the film in a packed\ntheatre in Burbank, CA, most everyone remained quite as the credits\nrolled at the end, but a few. When I composed myself enough to make it\nto the car, I balled and couldn't stop crying for some time.<br><br>I'm Jewish, but never knew much about my heritage and the holocaust. My\ngrandfather escaped the Warsaw ghetto, but died shortly after I was\nborn. My father, who was older than my mother, in part, grew up in a\nJapanese prison camp, and was stamped in Dutch, where he grew up. So\nwhen I saw all this come together and knew my relatives died in such\nhorrible way, I realized what I lost and how I lost them, Regardless of\nheritage, this film must be seen by everyone so we can see man's\nhorrific side. Sadly, I want to say so it will never happen gain, but\nit happening right now in North Korea. The tragedy continues.<br><br>Over all, this is an excellent film that teaches what can happen when\nhate mixes with power mixes with a country remaining silent!\n"},
{"review": "\nOne of the best movies in history, Schindler's List is a movie about\nhumanity , sympathy , what the war bring to us , how shame to kill\nsomeone because of his religion is ...<br><br>This movie is Complete! there is no wrong with it Directing was awesome\n, Cinematography &amp; Photography are perfect!<br><br>Acting was amazing , especially from Ben Kingsley which i really was\nshocked why the Academy didn't nominate him for Oscar ! <br><br>Anyway , this movie has a very very strong message ; that WHOEVER SAVES\nONE LIFE SAVES THE WORLD ENTIRE , by this legendary quote u can realize\nhow strong was this movie ..<br><br>And yes I said i'm Muslim and give it 10/10 because i think there are\nJews or others think that we R the Muslims will hate the movie before\nwe watch it !! no that's wrong! the movie is perfect , it's about\nRisking your life to save the ones around you. it's about SACRIFICE why\ndon't we love it ! plz guys kill this wrong idea in ur head !<br><br>FROM AN ANSWER FROM YAHOO I QUOTE : \" the final scene when he looks at\nthe car and says that the money spent on the car could have saved a\ndozen more and then looks at the watch and says that watch could have\nsaved one more. he starts to cry. That scene always gets me.\" <br><br>The only one thing that bothered me was when Soviet soldier in the\nending pointed the Jews to go west ! which mean go Occupy Palestine !\nthat really was un-necessary at all from Spielberg!!<br><br>But still great movie that shows how good is to be a human and shows\nwhat does the word PERSON mean , there is no difference between human\nbeings no matter what is their religion .. don't want to spoil the\nmovie .. but I guarantee to u that this's the best movie from\nSpielberg!<br><br>Now I'm done , thanks for reading.\n"},
{"review": "\nI watched this movie because of my teacher's recommendation and it\nbecame one of the best movies I love all time. Black and white, mono\ntones, heavy atmosphere. Start with scene where you see memorial event\nand followed by black and white film, smoke, ring, a list of people's\nname. right away you are questioning what it's going on. This is a\nheavy story but a light in tragedy, despair. I am amazed how Steve can\ndepict Schindler so well and so engaging. The story is very touching\nand sad. I couldn't help crying when Schindler was moaning at the end.\nI really think this movies carries story intensity so well. This is the\nmovie I want to watch and feel over and over again.\n"},
{"review": "\nOkay, what can I say about this movie that hasn't been said or isn't\nthat obvious. This movie is the most heart-wrenching movie that I have\never experienced. I have always been a fan of Steven Spielberg. I would\njust about watch anything that he would direct. This is by far his\nbiggest accomplishment...EVER. Everything is perfectly acted and\nperfectly shot. It is wonderfully scripted by Steven Zaillian, who in\nmy opinion should keep continuing to write screenplays because he did a\nbeautiful job. God a master piece that will let your tears go out, when\ni saw this film in my home i was surprised that a director had created\nsuch a motion picture not the best film ever but it gets to your heart,\na film that is long but its worth watching the whole thing, i don't\nthink that is the greatest film ever but yes is good, other films that\nshow a great story is The Pianist which is one of my all time favorite\nfilms, you should watch that one its pretty good to.\n"},
{"review": "\nSchindler's List \u0096 CATCH IT (A+) Schindler's List is a 1993 film about\nOskar Schindler, a German businessman who saved the lives of more than\na thousand mostly Polish-Jewish refugees during the Holocaust by\nemploying them in his factories. (Wiki) Three hours long black &amp; white\nmovie is remarkable in itself. As the whole time you feel like you're\nin that time zone and not watching a movie but a history in told in the\nmost brutal natural formal way. I was completely surprised when read on\nend credits that it's direct by Steven Spielberg. The director who\nmostly directs big fantasy movies from years. Liam Neeson portrayal of\nOskar Schindler as the cunning but sweet hearted man is magnificent.\nThis proves why this man is so well respected and maybe now he has\nmoved to Action (decent) genre we all know what exactly he is capable\nof. Ralph Fiennes as egoistic Nazi is as despicable as despicable his\nactions were. In other words he was Incredible. Ben Kingsley is a\nlegend. Overall, even though its 2012, when I finally saw this great\nOscar winning movie it's totally worth your three hours.\n"},
{"review": "\nThis movie is about ordinary people showing the best of humanity or\nunfortunately the worse. As my favorite writer, PKD, said holocaust\nwasn't only Hitler and his pals but began foremost with those thousands\nof anonymous Germans, Polish, Ukrainians, French that operated the\ncamps, the trains, opened the doors and close them, brought the lethal\ngas and so on. Everyone would contribute even small in the process was\nas guilty as their original planners. Shoah is about individual morals\nand value and it was up to every one to choose the path to be a killer\nor a righteous. The movie is brilliant for that because you see that\nthousands of anonymous killers and one brave soul who repents. Sure,\nit's greed that leads Oskar to those families but it's their suffering\nthat makes him change. From that point of view, i don't think that the\ngirl who wore red is an error as other people think because she\nsymbolizes his borderline. From this moment, Oskar is touched and is on\nduty: Liam becomes really irresistible of empathy and courage. Next,\nsome french media consider a bigger flaw that the women's convoy is\nonly lead to shower and not death chambers. Well, that's the proof that\nthey haven't understood Spielberg's sensibility: he doesn't direct a\ndocumentary but as always, a movie about hope, about this little flame\nthat still burns in the darkest hours. So he didn't have to show those\nwoman dying as well as he could mix a lot of atrocities that surely\nhasn't all happened in the real Schindler's story but happens really\nduring the war: killing disabled, killing for fun, etc... In that way,\nFiennes and Liam delivers unforgettable performances, the one as an\nunforgettable pit of darkness and the other as a force of life. That's\nwhy my eyes were full of tears at the end because to see this strong\noak finally crumble was too much. <br><br>Pairing: \"Empire of the sun\": another war, another tragedy, another\nhope....\n"},
{"review": "\nSchindler's List is one of THE all time classics in the history of\nmodern cinema.<br><br>The film depicts the lives of Oscar Schindler and his wife, Ishtak\nStern, Amon Goerth, and the survivors of the Holocaust. The movie, to\nmy knowledge, is historically accurate. It touched me in a way that few\nmovies have ever done. My favorite scenes are when Olek has to hide\nwith Danka and the other children in the toilet, when the survivors\nplace the rocks on Oscar's grave, and when Oscar cries \"I could've\nsaved one more. That truly showed the passion of the man to save lives.\nLiam Neeson,Raiff Fiennes, and Ben Kingsley make their best\nperformances, and all deserved Academy Awards. Schindler's List is a\nmust-see for any movie fan.\n"},
{"review": "\nThis amazing story is, in my humble opinion, the epitome of Spielberg's\nwork. To bring a story like this to the screen is nothing short of\nmagnificent. It would be difficult to single out a particular actor for\ntheir contributions, since the film is so cohesive and unified. You are\nimmediately drawn into the action, you are watching the events unfold\nas if you were there. Liam Neeson's performance as Schindler is dynamic\nand compelling. At first he appears the opportunist and war profiteer,\nbut his growth through the film lets you feel his compassion. Ben\nKingsley's quiet and steady demeanor throughout the film compliments\nNeeson's. Ralph Fiennes is the quintessential Nazi camp commandant,\nunhappy to be where he is, ruthless in his orders, and totally without\ncompassion. He is a soulless man who cannot feel love or hate, simply\ndisdain for the Jews, as if they were cattle. There are so many scenes\nin this film that speak to your soul, but perhaps the most important\nline in the film occurs near the end. \"If you save one life, in time\nyou save the world.\" The violence and cruelty of the film make it\nunsuitable for those under 14, and between 14 and 17, I would use sound\njudgment. A definite collectors item, and if they haven't shown this to\nyour teens in high school, they ought to. This is a reminder of the\ninhumanity man can reach if he has nothing to stop him.\n"},
{"review": "\nThank God for Steven Spielberg! Oh my God! this is one of the deepest\nmovies you can see, I know that Spielberg is Jewish, so you can tell\nthat every detail of the film is personal for him. I can't watch this\nmovie again, I suffered though the entire film, and cried my guts out\nfrom minute 10. <br><br>The casting... It was the right choice not to cast famous actors, it\nwould have taken the seriousness from the film, Liam Neeson gives a\nstrong performance through the film, I mean, he helps the Jewish, but\nhe still sees them as an inferior race, but at the end, when he breaks\ndown in tears after they give him the ring, he recognizes them as\npeople, not workers, people. One of the best scenes ever, I loved the\ntransition of the character. Ralph Fiennes is an excellent villain, I\nlove the inner fight that he has when he \"falls in love\" with Helen,\nhis performance gives you goose bumps. <br><br>The symbolism, how it is all in black and white, except for the girl in\nthe red coat, the innocence of a kid walking around corpses, the death\nof innocence, for me. Gives me chills<br><br>I mean, you hear about the Holocaust in History class, but you can't\nimagine how cruel that was, at least I had no idea, and when the movie\nended, I spent some minutes crying, wondering how was that possible, to\ntreat people worse than animals. One thing is clear Holocaust must\nNEVER happen again.<br><br>An the music is breathtaking is sadness translated into a score...<br><br>This a breathtaking movie. It is art.<br><br>It really touches your heart, you suffer and cry with the Jewish\npeople.<br><br>PURE ART\n"},
{"review": "\nSchindler's List is undoubtedly the best Holocaust film ever made.\nThere just isn't anything like this film. Films like The Pianist, Life\nis Beautiful, The Boy in the Striped Pajamas n various others have all\ntried to show the true horrors of the Holocaust, but none of them\nsucceeded the way that Schindler's List did. Schindler's List is a\ndifficult film to watch. When you see the true atrocities of the\nHolocaust, your jaw drops. When you see the pain that all of the\ninnocent people were going through, the only thing you can do is cry.\nThe true goal of all Holocaust films is to make you feel sorrowful, and\nSchindler's List did that to me. If you want to see the best depiction\nof the Holocaust, make your way towards Schindler's List. Direction is\ntop notch. Cinematography was great. Editing was a bit lame. Found it a\nbit long. Screenplay was awesome. Acting was excellent.\n"},
{"review": "\nThis film is a very solid offering from a not so solid director,\nSpielberg, who made some solid films, such as E.T. and Raiders of the\nLost Ark, but never managed to attain greatness, until this film.\nEasily the best film he ever made, Spielberg showed that he is also\nable to direct serious stuff besides escapist adventure films. I would\nput this film among my top 50 favorite films.<br><br>This film is technically flawless and shows how sophisticated Hollywood\nfilmaking had become by the early 1990's. Though I would question the\nuse of black and white in the film: color is good and the Pianist\nshowed it can be used in a WW2 tragedy film. However, this film is not\nthe best WW2 film ever made either, Grave of the Fireflies, by Isao\nTakahata, a film detailing the suffering of two children to survive in\nJapan in the final months of WW2, is easily superior to this one and if\nyou think this film is sad, thy watching Takahata's masterpiece.\n"},
{"review": "\nSchindler's List is almost too painful to watch - a remarkably subdued\nbut traumatically powerful account of the greatest evil ever\nperpetrated by mankind. I can't watch it without weeping, not just\ncrying, but every time, I just weep. <br><br>Spielberg sets aside all sense of melodrama and instead gives us not\nonly remarkable characterization in Oskar Schindler, Amon Goeth, and\nItzak Stern, but also brings an enormous sense of humanity and dignity\nto an almost impossible subject. <br><br>I cannot begin to say what it was like to see this for the first time\nin the cinema the week it was released - it was simply the greatest\nfilm I had seen - it truly captures something about human dignity and\nhope as well as evil and complacency that go beyond words.<br><br>I could write about the magnificent production, and filming, grading,\nediting and care - but above and beyond this there is just the power of\nthe true story - that one man did make a difference is almost\nimpossible to comprehend given the odds and given the circumstances.<br><br>Cinema at its very very best can capture both the reality and the\nhyper-reality in a way that no other art form can - Schindler's List\ndoes - and it remains a living testament and the most powerful reminder\nthat we all can and must choose good over evil. <br><br>Schindler's List remains for me one of the greatest, if not the\ngreatest, film I have seen and I always knew it would be my 500th\nreview. Thank you Steven Spielberg, and I hope it will serve always as\na reminder why courage and good really matter.\n"},
{"review": "\nOne of the finest productions ever put on film; also one of the most\ndifficult films to watch that you will ever experience.<br><br>It pulls no punches; therefore, it conveys just what a horrifying evil\nWorld War II's Nazi Germany really was. The reality of just what hatred\nand bigotry can influence one person to do to another is shown as ugly\nas it really is, and it's truly painful to see. The atrocities of this\nperverse dictatorship could easily be dismissed as a fluke of a violent\nera, but this film's underlying theme warns it could happen again.<br><br>Spielberg outdid himself in this brilliant work. The hopelessness that\nmust have been experienced by the victims of this vile time are\ncaptured so well on every level. The acting is superb: the psychotic\nNazi colonel was a standout. Liam Neeson is memorable as the guilt\nridden German businessman Schindler who endeavors to rescue political\nprisoners right out from under the Nazis' noses. The many Jewish people\ntargeted and viciously abused in concentration camps are ably portrayed\nby the cast with strong conviction.<br><br>Explicit scenes of ruthless killing and other abhorrent violence are\nnot withheld, and this film is a rare case where such brutal honesty is\nappropriate and effective. There were scenes where I had to look away;\nI could almost feel the kick, the punch, the spit, the bullet. It was\npainful empathy for the terror of those in peril, and witnessing the\nmany disgusting indignities they endured.<br><br>It's a guarantee this is not a pleasant watch; some of the imagery may\nhorrify you, especially with the realization that these things depicted\nactually took place. You will see the lowest and most detestable\nbehavior by people imaginable, and it will stick with you. However, it\nis a necessary precautionary message. This was Spielberg's finest hour.\n"},
{"review": "\nEveryone needs a slap in the face once in awhile to jar their\nsenses...and this movie was that slap for me. I needed to be jarred\nawake from my apathy over the events of the Holocaust. In 1993 I got\nthat awakening thanks to this film by Spielberg.<br><br>This is probably one of the most graphic and compelling accounts from a\nNazi death camp, juxtaposed to more modern fare, say \"The Boy in\nStriped Pajamas\" which left me very disappointed and unmoved.<br><br>Schindler was very moving. It made me cry. At times the images shocked\nme enough to want to look away, but I did not. I couldn't take my eyes\noff the screen. I loved the use of black and white film, except where\nthe color red was splashed in (i.e. the little girls coat at the\nbeginning).<br><br>I've made it an annual ritual to rent this film and watch it. And when\nmy daughters get old enough, they'll join me in this important ritual.\nNever again will I get apathetic towards the horrors of the Holocaust.<br><br>chris http://holokauston.wordpress.com\n"},
{"review": "\nBoth of my entire families were killed by the Nazis. My mother who is\nnow 88 years old is still alive. She saw her entire family murdered.\nThis film is my roots. It shows just a taste of the reality that was\nthe Holocaust. Mr. Spielberg applied his immense talents in this\nmasterpiece and recognized his Jewish heritage, after establishing\nhimself with other nice movies, but none of this importance. My mother\nwas interviewed for the foundation he created after making this film.\nHer story has been documented along with many other in his Shoah\nproject. This is a difficult movie for me to watch, but an essential\none, for it is my heritage, my roots. I thank Mr. Spielberg for making\nit.\n"},
{"review": "\nThe connection between the people in the film and the audience is\nalmost incomparable with any other film. Even the people who are not\nregulars, you feel that you know who they are, that you've experienced\nwhat they have been through but also realising that how bad this film\nportrays the war the experience of the Jews will never be displayed to\nits full effect on the people involved. Spanning through the workers at\nthe end brings to light what a good job Spielberg has done with this\nconnection.<br><br>In my opinion this film has more in common with inception then any\nother . in that there is the possibility that one simple idea can\nchange your life and the lives around you. In the case of Schindler it\nwas the red coat of the young girl who provoked an idea to grow and i\nbelieve this is the reason for this film to be black and white. To make\nsure the audience got the poignancy of that scene, that something so\nbeautiful cannot help but stand out against the rest of the world and\neffect the people involve more so.<br><br>Ralph Fiennes brings a brilliant typically perceived German into the\npicture, ruthless and cold blooded in the way he unnecessarily kills\nthe workers for fun almost but eventually shows heart. One of the\nhardest rolls in the film well played.<br><br>The ending of the film is perfect as you feel that it has already\nclimaxed with 20 minutes to go and in ways of personal actions changing\nthe storyline drastically it has but in drama it has certainly not . An\nunbelievable performance by Liam Neeson in its last moments is what\npushes this film to 10/10\n"},
{"review": "\nThis movie is one of the greatest movie that I have ever watched. The\ndirector is one of my favorite. It talk about a man who has no work but\nused his work in saving the Jews. The director has used different\ncolors and different shots. it also shows us and tries to remember us\nthe holocaust day. The acting of the actors where great and they did\ntheir best. Liam Neeson and Ben Kingsley acted very nicely.The director\ntries to use colors to show us some pity towards the characters. I\ndon't know about the research that they did, but it sounded as if true.\nwhen i saw Spielberg(director)in one shot I also felt that how nice\nwould it be when we get freedom\n"},
{"review": "\n\"Schindler's List\" is the kind of movie that, because of its historical\naccuracy, could be used as a documentary. But it also gives us a deep\nstory, and a performance by Liam Neeson, that is among the best of all\ntime.<br><br>The movie tells the story of Oskar Schindler (Neeson), a vain, glorious\nand greedy German businessman who becomes unlikely humanitarian amid\nthe barbaric Nazi reign when he feels compelled to turn his factory\ninto a refuge for Jews. Based on the true story of Oskar Schindler who\nmanaged to save about 1100 Jews from being gassed at the Auschwitz\nconcentration camp.<br><br>Steven Spielberg has a technical talent like no one else has. His\nframes are so elegant and objective, that you know what is going on,\nand where (in the last battle of \"Saving Private Ryan\" you can notice\nthis qualities better), which makes us feel that we are living the\nmovie. The massacres and killing scenes are distressing, because it\nlooks like it's happening to you. And the idea of making this movie\nblack and white gives a tone of reality, that looks like the movie was\nshot during WWII.<br><br>The plot, beyond giving us a history lesson, shows the amazing story of\nOrkar Schindler, whose personality and turns are probably the best\nthing in the movie, and powered by Liam Neeson's incredible and\ncontained performance, that is just one of the best. And other great\ncharacters, Ben Kingsley as Stern, as the smart, but quiet Jew, Fiennes\nas Goeth, the obsessed with power German (Although I thought it was\nexaggerated sometimes, like when he wakes up, and shoot Jews with a\nrifle, just for fun). And the construction of the characters is very\nwell made, which makes the ending even more powerful, being one of the\nmost moving scenes in the history of cinema.<br><br>Verdict: Probably Spieberg's best work, with a moving and accurate\nstory, and a mesmerizing performance by Liam Neeson, this movie is\nsimply, one of the best.\n"},
{"review": "\nSchindler's list is the one of few flicks you would never forget.If you\nsee this movie then truly you will feel empty in the end.It will leave\nyou heavy hearted.Ready to cry &amp; to feel the horrors Jews faced during\nholocaust.Spielberg is class.He makes your emotions to linger thanks to\nmemorable performance by Liam Neeson as Oscar Schindler.Ben\nKingsley(Itzhak Stern) deserved an Oscar for this &amp; also Ralph\nFinees(Goeth).His performance as Goeth would stand out for the most\nnefarious performance you would see in a long time.Truly the\ncinematography is vivid &amp; the black-white version takes you back to the\n1940's again in the evil of holocaust.This movie can't be\nemulated.Itzhak Stern said that \"Whoever saves one life saves the world\nentire.\".So if you haven't seen this yet then buy a DVD and see for\nyourself,relive those moments where the true Oscar Schindler saved\nmany.True hats off to the real Schindler.I just want to go back in time\nwhere Oscar would say \"If I could save one more life\".True emotional\nexperience.\n"},
{"review": "\nThis movie is brilliant.<br><br>Everything, EVERYTHING was portrayed so well. The settings, the\ncharacters, the emotions were all so solid and spot on to the time\nperiod.<br><br>Spielberg did an excellent job in his take on the Holocaust and Poland\nduring World War II. The cinematography was more than amazing. I cannot\nget over Ralph Fiennes and Liam Neeson's performances in this movie.\nBoth of them won me over, I hated and loved them. They made their\ncharacters so believable and REAL.<br><br>It's shocking how real everything was in this movie. It's almost safe\nto say that this is not a movie. Schindler's List will capture you from\nstart to finish, and guaranteed, you will be changed at least a little\nbit by the end of the film. Definitely one of the best.\n"},
{"review": "\nBefore I saw it, Schindler's List seemed to me to be spinach cinema;\nit's good for you, but you don't like it. I planned to watch it out of\na sense of moral obligation rather than keen expectation. I knew its\nreputation and felt its importance bearing down on me heavily. I got\nthe DVD. I put it in the player. I settled down. Within a few minutes\nsomething truly remarkable had happened: the movie had started working.\nIt drew me in and held me there. I was solemn, but not depressed. I was\nabsorbed, but not entertained. I was taught, but not preached to. This\nis not a conventional movie in any way. It does nothing you expect and\nmany things you don't, but in the end exceeds all expectations.\n"},
{"review": "\nSchindler's List is easily one of Spielberg's finest efforts as a\nfilmmaker, the horrors of the holocaust are portrayed in full\nunrelenting detail guided by Spielberg's visionary directorial hand and\nthis film most definitely deserved the 7 Oscars it received.\nPerformances by Neeson, Fiennes and Kingsly are fantastic and memorable\nbut I think Fiennes delivered the best performance of his career as the\nheartless, psychotic nazi officer Amon Goeth, his scenes steal the\nscreen and are the ones you won't soon forget after the credits roll.\nSchindler's List is the work of master and is masterfully crafted on\nall counts, this is an unforgettable, iconic film that simply cannot be\nmissed.\n"},
{"review": "\nI must admit I was stunned! With so many bad movies, with no substance\nat all, it's wonderful to know that those kind of movies like\n\"Schindler's List\" prove to us that masterpieces are still possible.\nCongrats, Steven Spielberg!!! The movie presents an apparently vain\ncharacter who wants to gain profit with his business, by employing only\nHebrew people, because they are paid less( they aren't paid at all,\nonly the taxes for them are paid). Through the movie we are given the\nchance to see some great and very very moving frames of the\nHolocaust...women and old people are being killed in front of our eyes,\nhumiliation and cruelty is being presented as if it would happen right\nnow...it is a lesson to learn and it is history relieved in a traumatic\nway. The movie is tragic, but the fact that Schindler acts in such a\nhumanitarian way is reassuring for us to know that...after so many\ncrimes and so much evil, there still is GOOD in us. This movie is a\nMUST if you wanna watch an unforgettable movie!\n"},
{"review": "\nSchindler's List is directed by Steven Spielberg, is based on the book\nby Thomas Keneally, has music by John Williams and stars Liam Neeson,\nRalph Fiennes, Ben Kingsley, Embeth Davidtz and Caroline Goodall.<br><br>The film is shot in black and white with just a couple of colour\nsequences, the little girl in the red coat and a lighted candle.This\nreally adds to the bleakness of the films story.<br><br>The film tells the remarkable true story of how wealthy factory owner\nOskar Schindler(Liam Neeson)saved over one thousand Jews,during the\nhorrific events of the Holocaust.He deceived the Nazi's into believing\nhe was on their side but instead he helped many Jewish people get work\nand therefore life in his factory.<br><br>Spielberg does not flinch away from showing us the full horrors of the\nNazi atrocities and that makes the film all the more real and\npowerful.Liam gives one of his best performances as the who found the\ncourage to do the right thing.<br><br>He is supported by equally magnificent performances from Ben Kingsley\nas his friend and right hand man Itzhak Stern,Caroline Goodall as\nSchindler's wife Emilie and Embeth Davidtz as a young camp inmate who\nis chosen to be the lover of Amon Goeth.<br><br>The highest praise though has to go to Ralph Fiennes for his chilling\nperformance as the sadistic Concentration Camp Commander Amon Goeth.He\ngives one of his best performances and should have won the best\nsupporting actor Oscar.<br><br>A haunting look at human weakness,strength and some of the most evil\nacts ever committed on this earth.The most moving bit for me is always\nthe end,where the real Schindler survivors and the actors who played\nthem visit Schindler's grave.Although obviously very upsetting and at\ntimes sickening this is never the less a film that has to be watched at\nleast once.\n"},
{"review": "\n\nSteven Spielberg directed a lot of the best films in history, such\nas:\nE.T,Close Encounters Of The 3rd Kind,Jaws,Jurassic Park,Saving Private\nRyan,Poltergeist,The Color Purple,Raiders of the Lost Ark,Minority\nReport.....and the list just goes on and on....<br><br>But in my opinion \"Schindler's List\" is the most important masterpiece\nSpielberg ever made(and it's not because i am israeli..).\nThe acting is breathtaking(especially from Ralph Fiennes as Amon Goeth)and\nthe black &amp; white motive is outstanding...\nBut the real issue here is the true horrible story of the jews in europe\nof\nthe 1940's..\nU can see in this film the true horror and humiliation that the jews had\nsuffered.<br><br>Truly Spielberg's best work with a very important lesson..\n10/10\n"},
{"review": "\nSome films i feel you can watch and just think there is something wrong\nand you don't really feel anything from it. There is nothing that\nshocks you whether it be the story or the acting. Schindlers list is\none of those films like a lot of other Spielberg greats (Saving Private\nRyan,Jaws)really grips you.This is probably the most powerful epic of\nany historical event ever made. Everything about it is perfection for a\ngood movie. From the incredible performances by Liam Neeson as Oskar\nwho i felt had deserved an academy award more than any actor alive for\nhis performance and also for Ralph Feinnes as a terrifying Nazi and Ben\nKingsleyalso gives another memorable performance as Jewish factory\nworker Izthak Stern right to the dazzling cinematography (the film was\nshot in an amazing black and white style to give it a more historical\nand realistic look). I think my favourite scene of the film has to be\nat the beginning when you see the all the Jews being evacuated and\nterrorised by German soldiers and then suddenly a little girl appears\nin a red dress which is the only coloured part of the film. That to me\nis shot that will go down in movie history.Many people believe that\nSpielberg is the kind of guy who is always going to be remembered for\nmasterpieces like E.T,Jaws and the Indy trilogy. In my opinion this is\nthe film where we knew that Spielberg was right next to Martin Scorsese\nand Spike Lee was one of todays greatest living directors.\n"},
{"review": "\n\nAs possibly the world's most influential film-maker, Spielberg has a\nresponsibility. And that responsibility entails NOT using his cheesy,\nshallow sensibilities to turn one of the most profoundly horrible parts of\nhuman history into a soap opera-style piece of fluff. This film is more than\njust a bad film, it is a downright dangerously bad film that will be watched\nby millions of impressionable people who might have had few other sources to\nbase their knowledge of the Holocaust on. Most of us agree that the worst\nthing to do about something like the Holocaust is to forget it, lest it\nhappen again. The next worst thing is to trivialise it to the point where it\nresembles so many other Hollywood pieces of trash.<br><br>What possesses a man who has become rich and powerful in the film industry\nsolely through the making of shallow, transparent films for children to\nthink that he is talented and wise enough to present to the masses a subject\nwhich should only be touched by the most careful and socially responsible\nhands? A Mid-life crisis, and an over-inflated ego, most likely, not that it\nmatters though.<br><br>Only someone with many years of study may be a doctor; only an experienced\nengineer may build a bridge, and even the guy who fixes your toilet must be\na qualified plumber. Yet this fool, whose only previous qualifications have\nbeen cheap, shallow, movies made strictly for entertainment, thinks he is in\na rightful position to educate our children. Because, unfortunately, many\npeople have a frighteningly limited amount of knowledge about the second\nworld war, and Schindler's List will be for many of them their main source\nof information. Showing it to them in as cheesy and hollow a fashion as\nalmost only Spielberg can, is simply a crime.<br><br>\n"},
{"review": "\nAn incredibly insightful film concerning the Holocaust. Spielberg\nrecreates the story of German businessman Oskar Schindler - a man that\nwould not typically be associated with savings the lives of people, as\nfar as the Nazis were concerned, considered to be enemies of the State.\nSuch a contrast makes the film so moving combining the horrors of what\nwas experienced by the ethnic minorities under Nazi persecution with\ninsight as to the atrocities that occurred in the gas chambers and\nghettos to the generous, gentle nature of respected German businessman\nOskar Schindler.<br><br>A tribute that will remain to be one of the most encapsulating films\nbased around a remarkable man saving thousands of lives amongst one of\nthe most devastating regimes witnessed by human history. A film that is\nto never be forgotten just as the Holocaust never will be.\n"},
{"review": "\nSchindler's List is not only a pure masterpiece but, for me, it is one\nof the greatest films ever made in the world.<br><br>The film starts off to reveal a womanizing, Nazi business man who\nprofited off of slave labor. The Nazi business man is of course Oskar\nSchindler. Oskar is just like most men. He has a love for good wine,\nbeautiful women, and pursues happiness through the success of his\nbusiness. But on his journey to a successful business, millions of Jews\nwere being killed during a time which most label as one of the darkest\nperiods of human history. As Oskar made money, innocent people were\nbeing murdered. That's when the self-centered, often money hungry Oskar\nsteps in and gives up his goal of having a successful business to save\nthe lives of over 1,000 Jews.<br><br>This film is about redemption and was beautifully photographed in black\nand white by Janusz Kaminski (cinematographer). At the helm is no one\nother than Steven Spielberg, who brilliantly called non-pretentious\nshots and brought back to life a time and period most want to forget,\nbut shouldn't. This film is a must see by me. I give the film an \"A+\"\n(wishing I could give it a higher grade than that) and a 10 out of\n10... Best movie\n"},
{"review": "\na gripping story, with beautiful shots, and a direction of master\nhimself. a story that takes you to the lane of past and force you to\nfeel that pain and go through their journey. that's the beauty of\ncinema.. loved it. everything was looking so good, whether acting,\nmusic, sound, cinematography, editing. everything was so fantastic.\nspecially the colors,and how they use the contrast of that red blazer,\nto show the authenticity and pain of those people, the helplessness of\nthose. There are some of the most true and graphic scenes here ever\ncaptured on celluloid. People being shot for no particular reason,\nhiding in fear, stripped and gased, abused......so much so that viewers\nwatching it for the 1st time will be deeply affected.\n"},
{"review": "\nHeart wrenching, haunting, and beautifully mastered. This movie has\npassed all time tests and landed as a modern classic of cinema. It\nplays sublimely the life of Oskar Schindler. Furthermore, it presents\nthe best acting of Ralph Fiennes and Liam Neeson. The music played by\nJohn Williams is without a doubt one of his best compositions. With\nviolins from Iztak Perlman it is an impressive modern composition. The\nmovie last considerably long. Yet the flow of the movie is intense and\nmoves from action to action with all due moments of silence and quiet.\nThis movie will haunt and enrage whilst at the same time drip in\ncompassion and love. One of a kind.\n"},
{"review": "\nKubrick said that the holocaust was about six million who died,\nSchindler's List was about six thousand who didn't. That perfectly\nencapsulates the brilliance of this film. The Holocaust was the most\nhorrific event man ever caused, nothing comes close. Somehow, Spielberg\nfound a story of hope in the pitch black evil. That is not to say this\nmovie is for the faint of heart. Nothing about Schindler's List is\neasy, it will break you but in the end the tears you shed--and you will\ncry--are not elicited by horror but by beauty. It is the story of a\nman, by no means a saint, who finds it in himself to stand up against\nthe horrors of his day. I could write on about the acting, writing or\ndirecting, and it is all superb, but to do so would miss the point.\nSchindler's List excels because it has the all important fourth factor,\nthe right stuff. I am too young to have seen it in theaters and I envy\nthose who shared this experiences with strangers, but every time I\nwatch this film I am left speechless. I do feel the need to right about\nthe ending. Realizing that the evil presented in this film is of a\ndegree we cannot fathom, Spielberg brilliantly reconnected us to\nreality. It was on my third viewing when it occurred to me that the\nlittle boy, the grandson of a Schindler Jew, was no more then eight\nyears old. This would mean that he was born after Schindler died yet\nowes his entire existence to the man. This is the beautiful part of the\nstory, this is what brings me to tears every damn time. Schindler's\ninfluence stretches beyond the grave. This movie was over twenty years\nago, that boy is now a man, probably married, maybe with children.\nSchindler gave the girl a husband, the boy a father, and they never\nshared time on earth. This is one of the twentieth centuries most\nextraordinary films about one of its most extraordinary men and if it\nwasn't for the film, we wouldn't even know the name Oskar Schindler.\n"},
{"review": "\nHello everybody ! I'm going to write about a film called \" La liste de\nSchindler \" and I advise you to watch this deeply moving film! It's a\nreal story about the genocide of the Jews. This documentary is\ninteresting and easy to understand for people who don't know a lot\nabout the second world war. Furthermore , actors are stunning. The\nleading role is played by Liam Neeson ( one of my favourite actors\nafter Tom hanks ). I think it's not easy to act this role for him\nbecause it's such a bad and sad story but he really succeed it. This\nmovie is for me a life lesson to remember... You have to watch it if\nyou don't already have done it. See you soon !\n"},
{"review": "\nI watched Schindler's List for the first time a couple of nights ago. I\ncan't really put into words how great it was. <br><br>At first I thought wow that's amazing and horrifying. I'm so glad I\nhave now seen it and never want to watch it again...<br><br>But it's still playing in my brain and I actually can see myself\nwatching it again now quite easily. Not that it would be easy to watch,\nit could never be that. I cried and cried and was shaking with anger\nand fear and pure horror at it (especially scenes like the liquidation\nof the Krakow ghetto). But I can see myself wanting to see it because\nof just how brilliantly made it is.<br><br>The performances were fantastic and not just the two leads of Liam\nNeeson as Schindler (I hadn't realised he was such a flawed protagonist\nand had built him into this thing of perfection in my head because\nwithout seeing the film and knowing the story i couldn't realise that\nto do what he did you needed to be sneaky as hell and have that edge to\nyou) and Ralph Fiennes as the truly wicked and evil Amon Goeth. I keep\non forgetting, and did so in the film too, that it was Ben Kingsley\nplaying Schindler's \"clever accountant\". He was so good in the role\nthat he disappeared into it.<br><br>The score was brilliant too and also stayed hidden and didn't get in\nthe way if the part it was playing in the film as a whole. (I loved\nreading this in the trivia of the film \"When Steven Spielberg first\nshowed John Williams a cut of the film, Williams was so moved he had to\ntake a walk outside for several minutes to collect himself. Upon his\nreturn, Williams told Spielberg he deserved a better composer.\nSpielberg replied, \"I know, but they're all dead.\"\")<br><br>It can't not get a 10/10 from me. I will watch it again, and be utterly\nheartbroken again.\n"},
{"review": "\nThis film tells the story of Oskar Schindler (Liam Neeson), a Polish\nindustrialist who collaborated with the German war effort, after the\ninvasion of his country, by keeping working in his plant many Jewish\nprisoners. Aware that keep them working was to save their lives,\nSchindler hires as much as he can, going against his own interests and\neven raising suspicions among the Nazis. Directed by Steven Spielberg,\nthis film also has the participation of Ben Kingsley and Ralph Fiennes.\nBased on a true story, the film screenplay is from Steven Zaillian.<br><br>There are some movies that are so good and symbolic that ultimately\novercome the art of cinema itself and become part of the heritage and\nmemory of Humanity. This is one of those movies. There isn't any\nnegative note to do: the cast exceeded expectations, the script is\nexcellent, the costumes and scenarios are historically accurate. The\ncinematography deserves special positive note, with interesting camera\nangles and a very clever use of black and white. In recognition of this\nmerit, the film won seven Oscars (best film, best director, best\nadapted screenplay, best cinematography, best art direction, best\nediting and best original soundtrack) and was nominated for another\nfive statuettes (Best Actor, Best supporting actor, best costume, best\nsound and best characterization).<br><br>The story told in this film is the living testimony of a sad page in\nworld history, but that doesn't end in the past. The Holocaust ended\ndecades ago but there's still genocide and ethnic cleansing in other\nparts of the World. If this film brings a message of compassion and\nhumanity, this isn't only for some people, but transcends the issue of\nJews or Germans to reach all those in this World are persecuted for\ntheir faith, ethnic or other perverse motivations.\n"},
{"review": "\nThis movie is difficult to watch as it, in detail, expresses the sheer\nhorror and grisliness of the Holocaust. From the forced relocation of\nthe Jews toward the ghettos to the terrors of Auschwitz, the\npersecution of the Jews is a centerpiece of this film and it will\nresonate in your mind long after this movie is over. <br><br>This movie also centers around the life of Oskar Schindler, played\nbrilliantly by Liam Neeson, as a money-hungry German businessman who\nemploys Jews to work in his factory, but ultimately grows concerned for\nthe well-being of the Jews as he witnesses their merciless persecution\nby the Nazis. His mission in turning his factory into a salvation for\nthe Jews throughout WWII becomes a driving force for the plot and\nbuilds up the suspense and tension, making you eager to find out what\nthe aftermath is by the film's end.<br><br>Ben Kingsley gave a great performance of Itzhak Stern, the Jew who ends\nup being Schindler's trusted assistant and right-hand man, and Ralph\nFiennes gave a haunting portrayal of the evil and sadistic Amon Goeth -\nan ultimate villain you would love to hate. And, all the supporting\nactors and extras who portrayed the Jews gave a heartfelt performance;\neven as actors, you really sympathize with them as they gave such a\nrealistic and heart wrenching portrayal.<br><br>Janusz Kaminski did a good job on the cinematography, capturing the\naura and tension of World War II; John Williams gave a stirring music\nscore with a beautiful violin solo by Izak Perlman; and Steven\nSpielberg did a nice job directing a well-paced film.<br><br>It's true that some people criticizes the accuracy and historical facts\nof the film and the overly intensiveness of the plot elements, but, it\nis no doubt an impactful film about the Holocaust and the courageous\ndeeds of a man who sought to save many.<br><br>Grade B+\n"},
{"review": "\nTo begin with, I'd like to mention that I had no interest in this\nmovie, Schindler's List. I had heard about it, but did not feel like\nwatching it. You know, every week there are at least twenty-five new\nmovies being released just in the U.S.. Thus, on the list of the\nbillions of movies I could watch, this movie was not even in top\n10,000.<br><br>I accidentally ended up watching it. I was at home sick and they were\nshowing it on TV. Bored and with nothing to do, I said watching this\nmovie can't really hurt or anything.<br><br>The first ten minutes were weird and I did not get much from it. I was\nalready reluctant about watching, but in the end, I kept going. Truth\nbe told, I did not even know what it really was about.<br><br>But as the story kept going, I fell in love. I fell in love with the\nfantastic directing, of the one and only Steven Spielberg. I fell in\nlove with the realistic and award-worthy performances of Liam Neeson,\nBen Kingsley, Embeth Davidtz and, especially, Ralph Fiennes. While I\nhave already respected Neeson and Kingsley, knowing them as brilliant\nactors, it was not until this movie that I started liking Fiennes's\nperformance. Until then, I'd known him from the Potter movies, in which\nhis performance couldn't connect much with me. And to end this list, I\nfell in love with every single detail this movie had.<br><br>Outstanding and brilliant are ant-sized words in comparison to what\nSchindler's List's true adjectives sound like. I am not really capable\nof naming at least one.<br><br>And to end this review, there is absolutely no wonder why this movie is\namong the best of all times. It is my favorite ever and, for sure, it\ndeserves to be #6 on IMDb 250 Movies.\n"},
{"review": "\nIf I had only one sentence to describe this movie, it would be this;\nThe tempo and rhythm of this movie follows a waltz written with a tear\nand a smile. <br><br>The organization is perfect, we meet a savvy business man who sees\nopportunity in misery only to find himself lost in his own humanity.\nHis evolution is incredible, Liam Neeson's hallmark performance.<br><br>This movie symbolizes hope in humanity, I love watching it at least\nonce a year because it is so perfect that even in black and white you\ncan appreciate the metaphors and hidden symbols that indulge the\nwatcher in a roller coaster of emotions through pure art.\n"},
{"review": "\nThis movie is real! The holocaust did happen! Watching it in a theatre\nfor the for first time, the audience was completely silent as the\ncredits rolled at the end with only a few leaving. When I composed\nmyself enough to get to the car, I burst out crying. My grandfather\nescaped the Warsaw ghetto (he died shortly after I was born). My father\nwho was older than my mother, grew up, in part, in a Japanese prison\ncamp and was stamped (he went away when I was 10). So while you'd think\nI'd know more about my heritage and all my family killed in Poland by\nthe Germans, I do not. I only heard bits and pieces. So when I saw it\ncome together in a way that only Stephen Spielberg can do, it hit\nme--hard. My family endured this and only a few survived. I believe\nregardless of heritage, that everyone should see this film to know what\ncould happen in the future-again. The fact is, it is happening today in\nNorth Korea where daily acts of unspeakable cruelty happen. It's a must\nsee film for the acting, the authenticity and the truth. NEVER FORGET!\n"},
{"review": "\nThe best film ever ~ a terrible time in World History that we never\nnever ever forget! The millions of fates touches me to tears every time\nI see the movie and listens to the Soundtrack-01 Theme by John Williams\nfrom Schindler's List. Liam Neeson,Ben Kingsley,Embeth Davidtz and all\nthe other Actor's performanc is just outstanding! The Schindler's List\nSoundtrack-08 Auschwitz-Birkenau by Ellijah De Leon gives me the\nshiver, because while listening to this, I can feel the agony and\ntorture of the Jews that never deserved to suffer so horribly ~ without\nthe World doing enough. So~I can not say it enough ~ Always Always\nremember and honor the millions because their fate deserves to be told!\n\"He who saves one life saves the world entire!\" Talmud!\n"},
{"review": "\nThis movie explains what happened to so many of the Jews during World\nWar II. It takes an inside look at what really happened while they were\nin the camps. Also, how disrespect to any German soldier or any one\nthat was loyal to Hitler resulted in extreme punishment. Extreme\npunishments such as death were not uncommon. Schindler, in the\nbeginning, was only trying to make money. As the war went on he\nrealized what was really going on in the factor. As he grew closer to\nhis workers in his factory, he didn't want to make money anymore, he\njust wanted to save them from the death of the war. He began to spend\nthe money he had to buy the workers back from the camps and tried to\nsave as many as possible, he became broke by the end of the war. Before\nleaving his workers at he end of the war, he cried because he felt\nguilty because he felt like if he sold his car and some of his\nbelongings, he cold have saved even more lives. Oscar Schindler, was\nknown as a savior to the Jews during and long after the war.\n"},
{"review": "\nPrecious little to say about this masterpiece. It depicts everything\nwith raw, meticulous, explicit simplicity -- the unthinkable suffering\nof the Jewish people, the inhuman cruelty of their oppressors, the\nheroism of some and cowardice of others... It is the perfect\njuxtaposition of the very depths atrocity and the light of kindness and\nempathy and altruism and hope. \"I could have saved one more.\" Gets me\nevery time. Liam Neeson did Schindler justice. We see the compassion\ndevelop in his face and it is amazing. In short, you cannot die without\nwatching this film. P.S. Itzhak Perlman is my idol and to have John\nWilliams come up with the music for him was sheer magic.\n"},
{"review": "\nAlthough I had heard and read some of the best reviews for this movie,\nI have to admit that, initially, the first hour of this film seemed\nboring to me. Then I realized that the facts on that part of the film\nhad to be referred so that we can understand and connect right the\nfacts of the entire story. The interpretation of the main characters\nwas of course astonishing. The murders and executions of the German\nNazi were just as they had to be, not fake or incorrect. The finishing\nof the film was one of the best parts or scenes as the reality meets\nthe directed. It is surely one of the greatest films in the history of\nthe cinema and everyone should watch this because humanity, honesty and\njustice are honored.\n"},
{"review": "\nSpielberg has oft been criticised for sugary and formulaic Movies-this\nis no different except it's an offering for adults.<br><br>Yes,its overlong and boring in parts..in fact it doesn't come to life\nuntil the appearance of Mr Fiennes as the psychotic camp commandant.<br><br>But from then,its a superb film and the end scene breaks hearts and\nlives in your memory forever.<br><br>The haunting musical score,especially the lead tune played on the\nviolin fits perfectly.<br><br>Watch this and forget authenticity,the real Schindler was nothing like\nNeeson's portrayal.\n"},
{"review": "\nI can't believe I waited until the age of 29 years old to finally watch\na movie I had been planning to view for years but never got around to.\nI knew that the story would exert an emotional toll on me but I finally\nfound my chance to watch it through last week and it was worth the\nwait. This is magnificent and emotional viewing. Based on an inspiring\ntrue story that is enough to restore one's faith in mankind. The acting\nall round is incredible. Neeson is understated - although I have read\nthat he wasn't entirely happy with his performance in hindsight.\nKingsley was even more understated. Ralph Fiennes was simply\nincredible. Totally twisted, believably merciless - he portrays exactly\nwhat you would expect of a debauched, unapologetic and excessive Nazi.\nThe overall mood is extremely sad. Some of the scenes that depicted\nactual events that happened in our world, by human beings - are utterly\ngut wrenching, heartless and terrifying. The horror of the mass shower\nscene was an unforgettable experience - by not showing what you\nexpected to see - it seemed to create even more empathy with the\nhelpless fear of the situation. To tackle such historical atrocity is a\nmonumental task indeed. Schindler's list shows us every side to the\nevents that shook, and still continue to shake the world. The horror,\nthe senselessness, the bravery, the hope, the fear, the courage, the\nevil. The greatest purpose of all that this exceptional movie serves -\nwe must never forget what happened. There are some things that can\nnever be forgotten or forgiven. And there are some people, like Oskar\nSchindler, whose actions carry a weight that will never be forgotten by\nall of those who's lives were saved. A remarkable movie about an\ninspirational man.\n"},
{"review": "\nIn Schindler's List, children - Steven Spielberg's long-favored\nvehicles for expressions of hope and sunny confidence about humanity's\nfuture - rush toward an ominous line of waiting trucks.<br><br>In their exuberant innocence, the youngsters wave a farewell whose\nfinality they cannot know as their parents stand helpless, paralyzed by\nthe horror of what awaits their offspring. Like many scenes in\nSchindler's List, this parting becomes more than an indelible,\nwrenching moment of shared pain. It is rendered with a restraint and a\nprodigious film making technique that transform an image into an act of\nscarcely bearable communion for the audience. The empty uplift seems\ncontrived after the devastating power of what precedes it. But this\ncoda does not detract from a testament in which a man finds redemption\nin saving others, and a director at the height of his art preserves the\npast with magisterial authority and conviction.\n"},
{"review": "\nThis movie explains the most i.e. Humanity expects something in real\nsense. Only words or showing emotions are not enough. one has to give\none,s 100% to save humanity. This is shown in this movie. How a person\nhad given in a war situation. This is the example for peoples who\nthinks to prefer the War over and above anything in the World. The\nscript, story , visuals, scenes are looking real and heart taking. This\nis the best movies ever I have seen in War category. Thanks all Actors,\nProducer and Director. Story of a real person who became unlikely\nhumanitarian amid the barbaric Nazi reign and managed to save about\n1100 Human from being gassed at the Auschwitz concentration camp, it is\na testament for the good in all of us.\n"},
{"review": "\nSchindler's list is undoubtedly a great movie of all times. It depicts\nthe most inhumane crimes of human history, the holocaust. The movie has\neverything you want to see in a good one. brilliant acting,stunning\ncinematography,Excellent direction and above all a real life story. I\nhad watched this movie when i was 15. This movie had lasting effect on\nmy mind and the scenes kept on moving in my mind for many days\nparticularly the seen in which amon shoots the workers from his terrace\nlike animals. The scene itself was so disturbing to watch as a kid. The\nfilm is a must watch for who looks for a movie with difference but its\nalso a worth watching. Its one of the best Spielberg movie.\n"},
{"review": "\nThis is one of the best films ever made, for so many reasons.<br><br>It's not just an epic historical drama. It is a statement for so much\nmore. Anti-war, selflessness, love, sacrifice, family, friendship.\nAlmost everything is in it.<br><br>The cast and acting is beyond any possible criticism. The direction\nsuperb and the music a masterpiece.<br><br>Some scholars of the holocaust disagree about its authenticity, but if\nthe intention was to make a statement against war and touch a wider\naudience.<br><br>Overall don't miss it. And prepare for a unique emotional ride.\n"},
{"review": "\nThis movie is compelling. Everyone who ever walked out of the room of\nwhere they watched this movie has been moved, me too. It's a timeless\nclassic displaying the true heartbreak and absolute devastation of the\nJewish people and all the other unlucky victims who fell into Hitler's\nvicious cycle. This gave me new insight on the Holocaust and I am so\nglad to have seen this masterpiece. Liam Neeson doing his best work.\nEverything fit in this movie. The fact that this movie made me feel sad\nand pity for these people says a lot about the potential and power this\nmovie brings to it's viewers. Steven Spielberg is a genius for what he\nbrought to this movie. Real life accounts, real situations, back story,\nreal people who were involved in this dark period of time. Brilliant.\n"},
{"review": "\nif you're planning on watching this film id say know the history behind\nit before you do as you will understand and appreciate it more all in\nall its a classic, well written and story is fluent and well told\nthroughout the film you really get a good understanding of what went on\nin real life and how people were treated and how they must of felt, i\nwould say anyone who has or known someone who was present when this was\ngoing on agree that its true through out and not maid for entertainment\nvalue as such, so if you haven't seen it yet id say do go watch it\nleast you may learn a bit about the history even if you don't like /\nenjoy the film\n"},
{"review": "\nSchindler's List (1993) is one of Spielberg's most creative, and\ndramatic films ever, and one of the most powerful films ever released.\nEveryone should watch it and experience the historical true event.\nWhoever has not seen this film is definitely missing out. <br><br>Liam Neeson fit the leading role perfectly, making the film entirely\nbelievable. You truly experience the darkness, and the light in this\nmoment of persecution in our history. There are very few films this\ngood about Jewish persecution. Another must watch film similar to this\none is the The Pianist (2002).<br><br>Another reason to watch this film is because history repeats itself.\nPersecution is still happening today.\n"},
{"review": "\nIt was not surprising when a name like Steven Spielberg is printed on a\nfilm cover to be so sensational and mind-blowing. The film could be\ncalled a masterpiece which is compelling due to fabulous acting of Liam\nNeeson at his best. Not to mention that the whole concept of the film\nonly came to realize when Ralph Fiennes force you to comprehend the\nabstract meaning of humanitarianism.Apart from the actors and their\nglorious plays the storyline was sad and drama but worth even ten\nvisits.When a conceited businessman gradually changes during his war\nlife and decide to help his workers to survive you can feel the true\nstory that lies behind the movie. Thus if you have not seen the film\nyet I strongly recommend watching it as soon as possible.\n"},
{"review": "\nI watched this film and instantly was fixed it is an extremely sesertiv \r\nfilm played so well by its cast eye opening for all to see a glimpse of \r\nwhat was going on in the death camps and our world war 2 battle agains \r\nevil Hitler and a beautiful story of a man trying to save he's fellow \r\nman and women from death every life saved was not enough it's hard to \r\ngrasp some parts but very captivating and yet so upsetting to remember \r\nall the treacherous deaths of so many innocent people sent to the gas \r\nchambers and Schindler was buying the Jews to save them from death it's \r\na must watch film and lovely in some way even tho there is so much \r\nupset it's a balance just rite it's not easily forgotten but much \r\nneeded as this is real in life this should be a good film for lots to \r\nlearn\r\n\n"},
{"review": "\nI watched Schindler's list for three reasons: 1) It is one of THE best\nmovies of the past half a century 2) The theme song is amazing. 3) Come\non!! Its a Steven Spielberg movie As a violinist, I have always loved\nthe theme song and the sad melancholic melody, so it was only fitting\nto watch the movie to try and bring more life to the music when I\nplayed it. And it worked.Schindler's list is an amazing movie, If you\nhaven't watched it, you really need to. Steven Spielberg is a genius\nand having only the little girl in color somehow added a even greater\ndepth of sadness and melancholy to the movie. I admit, I did cry a lot\nduring the film.\n"},
{"review": "\n\"Schindler's List\" tells the story of Oskar Schindler, a nazi at WWII\nthat decides to save jews from a concentration camp. At first, he did\nnot intend to save them, he was only interested in money, to buy jews\nto work in his factory, and make him money. But lately, we see Oskar\nchange his mind, and secretly, saving the most people as he can. It\nwouldn't be bad if Martin Scorsese had accepted the offer to direct\nthis feature, but Steven Spielberg shows the story in a magnificent\ndirecting, cinematography, screenplay, score and performances. With 7\nAcademy Awards, \"Schindler's List\" is considered a classic of movies\nand keeps touching all kind of people's heart.\n"},
{"review": "\nProbably one of the best film ever made. Of course it's Steven\nSpielberg, but considering the actors portraying their characters most\nespecially Liam Neeson as Oskar Shindler, he performed it excellently.\nThe plot which happened in 1939 which started the World War II showed\ninformation to those who are not well versed with what really happened\nat that time.<br><br>As a 1980's baby, I never knew what life was with the Jews until I\nwatched this film. It is more than an entertainment film for me. It is\nvery informative and adds knowledge to the naive. <br><br>And I was very impress with the casting. the fact that Neeson\nauditioned for the film while we all know he's a good actor then and\nnow.<br><br>Cinematography, wow I like the idea of Spielberg of making it\ndocumentary-like kind of film. He used black and white to make it feel\nlike real documentary from the 1930's. It surely gave an edge of the\nfilm. Spielberg is a genius.<br><br>Overall, I love it.\n"},
{"review": "\nOskar Schindler (Liam Neeson) is a social climbing opportunistic\nwomanizing German businessman. He charms important Nazis, and gets\naccess to limitless Jewish labor. He gets Itzhak Stern (Ben Kingsley)\nas his right hand man, and Jewish money to pay for his business. He\nprovides the front. Using black market deals and advantageous\nconnections, he becomes rich and powerful. Stern works tirelessly to\nsave people. Even as the Jews are rounded up to Plaszow labor camp\nunder the command of unstable Amon Goeth (Ralph Fiennes), Schindler is\nable to befriend the mad commander.<br><br>This is probably the most important movie of director Steven\nSpielberg's career. At least it's the most important for him. Based on\nthe true story, Spielberg uses all his movie making skills to create\nthis iconic movie. The black and white provides starkness and\nthankfully a little bit of distance from the horrible events. Liam\nNeeson and Ben Kingsley are the perfect duo. Ralph Fiennes gives a\ncomplex performance as the mad commander. The shock of the horrors of\nthe Holocaust is expertly done. When I first saw it in the theater, I\ncouldn't help sob a little when Schindler breaks down at the end.\n"},
{"review": "\nVisually, this film is fantastic. It is very well directed, and easily\ndeserved the acclaim for its cinematography and its direction. However,\nbeyond that, there is really nothing spectacular. <br><br>If I'm being honest, this film felt kind of desperate to me. I watched\nit feeling as if I was watching a film designed to win Oscars and to\ncash in on a tragic event like this, and I think the fact that it's in\nEnglish as opposed to Polish and German (which would be more authentic)\nprove this. Spielberg has made a very commercial film, and I feel like\nit loses a lot of its power due to this. I feel like The Pianist, by\ncontrast, is more real, it feels very raw and fresh, whereas this\nalmost felt gimmicky. I felt like it was trying too hard, and got lost.<br><br>Finally, Liam Neeson really ruined this film. His acting was laughable,\nit was actually embarrassing seeing him fluctuate between an Irish and\n'German' accent. Ralph Fiennes was great as always, but Neeson was a\njoke.<br><br>This is a pretty good film, it's not bad, but it's certainly not worthy\nof a place in the top 100, let alone top 10.\n"},
{"review": "\nFantastic movie. Epic drama about determination, courage and more.\nMaybe Steven Spielberg's very best films (subjectively) Spielberg has\nmanaged to create a film that will reverberate far into the future\ngenerations.<br><br>It is so nice, beautiful and sad true to totally goes with it.<br><br>It contains some of the most powerful scenes I've seen, with\nmasterfully beautiful spectacle that is rarely seen better.<br><br>This film is a masterpiece and my favorite movies. the film will be\nshown in black and white, only a few places are colors. the black and\nwhite give the film the last thing to the tragic events. masterpiece.\n"},
{"review": "\nThis is pretty much Steven Spielberg's cinematic coming of age. It hits\nevery element perfectly and it's a masterpiece. The movie is not afraid\nto be highly brutal and it does an amazing job showing us the ugliness\nof the concentration camps. All movies of this genre should not be\nafraid to have this element of brutality and Schindler's List does it\nperfectly. It does a great job making us care for Schindler and I can\ntell that Spielberg really cared for him and his actions. It's a very\npowerful film and the fact that this was based on a true story only\nstrengthens the emotional power. The fact that it was shot in black and\nwhite undoubtedly gives it more power and emotion. Saying this movie\nwas expertly shot would be an understatement. I've never seen a film\nshot better then this. This is a one of a kind film and we may never\nsee it duplicated. It hits all the elements perfectly and succeeds in\nevery way. This is one of the best movies of all time and it must be\nwatched.\n"},
{"review": "\nI thought this movie was going to be slow and boring... instead I ended\nup giving it a 10 hands down! This movie had tons of emotion and each\ncharacter did a phenomenal job. I would say it was a tad slow in the\nbeginning but it's the only way they were able to create the story\nbuild up so I looked past that. No movie has ever really grabbed my\nheart like this one. The way it was produced allows you to grow with\nthe characters and feel what they feel. I was also shocked when Liam\nNeeson was in this! I thought this was a really old movie and was\npositive it was a look-a-like or a relative but I was wrong! He is one\nof my favorite actors so it made the movie THAT much better. Overall a\nclassic, excellent movie and a MUST SEE!!!\n"},
{"review": "\nMASTERPIECE. By far, my favorite Holocaust movie so far. It depicts the\nhorrors of the war and the Jewish nation's suffering and tragedy. It\nperfectly shows that there is nothing more valuable than human life,\npowerful and touching. Spielberg directed this movie superbly, and the\nwork done by Janusz Kaminsky (director of photography) was magnificent.\nI must admit that I don't always pay attention to these details, but\nwhat was done in Schindler's List, captures your attention and is hard\nto ignore any detail. The performances are also pretty amazing, Liam\nNeeson's Oskar Schindler is perfectly interpreted. Every expression\nbuilds a man, who starts as an ambitious business owner, and\neventually, turns into a compassionate man. Yet, my favorite\nperformance was Ralph Fiennes as the cruel Nazi officer, Amon Goeth;\ntwisted, cruel and believable. He creates a perfect villain. Great\nmovie, shocking and heart-shifting.\n"},
{"review": "\nBased on a true story, Steven Spielberg's Schindler's List stars Liam\nNeeson as Oskar Schindler, a German businessman in Poland who sees an\nopportunity to make money from the Nazis' rise to power. He starts a\ncompany to make cookware and utensils, using flattery and bribes to win\nmilitary contracts, and brings in accountant and financier Itzhak Stern\n(Ben Kingsley) to help run the factory. By staffing his plant with Jews\nwho've been herded into Krakow's ghetto by Nazi troops, Schindler has a\ndependable unpaid labor force. For Stern, a job in a war-related plant\ncould mean survival for himself and the other Jews working for\nSchindler. However, in 1942, all of Krakow's Jews are assigned to the\nPlaszow Forced Labor Camp, overseen by Commandant Amon Goeth (Ralph\nFiennes), an embittered alcoholic who occasionally shoots prisoners\nfrom his balcony. Schindler arranges to continue using Polish Jews in\nhis plant, but, as he sees what is happening to his employees, he\nbegins to develop a conscience. He realizes that his factory (now\nrefitted to manufacture ammunition) is the only thing preventing his\nstaff from being shipped to the death camps. Soon Schindler demands\nmore workers and starts bribing Nazi leaders to keep Jews on his\nemployee lists and out of the camps. By the time Germany falls to the\nallies, Schindler has lost his entire fortune -- and saved 1,100 people\nfrom likely death. Schindler's List was nominated for 12 Academy Awards\nand won seven, including Best Picture and a long-coveted Best Director\nfor Spielberg, and it quickly gained praise as one of the finest\nAmerican movies about the Holocaust.\n"},
{"review": "\nGreetings from Lithuania.<br><br>To call \"Schindler's List\" a great movie would be a huge\nunderestimating. This is simply one of the best motion pictures of all\ntime. I know it sounds banal but truth is simple - \"Schindler's List\"\nis a masterpiece. No matter what are your believes, not matter what is\nyour life experience or anything else - this is a monumental movie\nexperience. Probably no other movie in my life grabbed my so hard,\ndelivered me to the place and made me experience events so purely as\n\"Schindler's List\" did. <br><br>This is a movie making at it's very best. Everything in this movie\nworks on highest level for some simple reasons - to get the knowledge\nand to learn. Learn from our past, learn from our unforgivable mistakes\nand to witness a descent humanity in the most ruthless places of our\ntimes. <br><br>I won't going to start to admire this movie craftsmanship. It's\nbrilliant. Everything here combines to a one excruciating masterpiece.\nOne who will experience \"Schindler's List\" won't going to ever forget\nit. This is a timeless masterpiece. And one of the most sticking things\nthat ever haunted me was that this picture was created in Hollywoood,\nby Steven Spielberg who at the time was mostly known for mainstream\nblockbuster experiences. How could they come up with such an idea and\nmost important how could they created this kind of a movie, which\ndoesn't represent popular teams and tones is still beyond me. I guess,\ntrue art find it's way, and for this motion picture Steven Spielberg\nwill be remembered forever.<br><br>Overall, if you haven't experienced \"Schindler's List\" by now, do your\nself a favor and witness this masterpiece ASAP. I'm writing this review\nfrom a country which is neighboring country to Poland. I'm so grateful\nto a simple luck that i wasn't born and wasn't there when these\nunthinkable events have happened. And my honest sympathy for those whom\nit has ever affected.\n"},
{"review": "\nSchindler's List is the most significant and the most touching movie I\nsaw. We recall the hell of war ... Liam Nesson is absolutely masterful.\nI personally saw this movie only once, a few years ago, I wanted to\nshare my experience with my darling praising the film, but the horror\nof war 39-45 is a life event Co does not support that it was impossible\nto make him agree to watch this movie, despite my many attempts.\nProbably she lived a bad experience in a previous life. It is true that\nthese events are really remarkable, the sensitive souls will have a\nhard time cashing them. Moreover it is not colorized version, it is\nabsolutely plunged in the heart of the story. It will be understood in\nmy comment that I loved this film is simply because in leaving the\nmovie theater, the film belongs to those who marked me ... a movie to\nwatch absolutely.\n"},
{"review": "\nWhen I was in grade 10 we gad to watch this in English class. I heard\nthe name and thought it was going to be lame, I was wrong. Even though\nthis movie is black and white it has character and heart. This movie is\nby far one of my favourite movies ever! It made me realize even though\nall the hate and suffering in the world there are good people who will\ndo good things, the movie does not go away from the bad that happened,\nit wants you to know how bad it was for Jewish people. This is based on\na real man back in WWII and I one day want to see his grave and pay my\nrespects to an incredible man. If you have not seen this movie I would\nhighly recommend it to anyone!\n"},
{"review": "\nThis would be one of the best movies I've ever seen, and I never get\ntired of it. It's such a sad story but the movie has paid so much\nrespect to it, which is extremely well done. I also love how the movie\nis in black and white except for the little girl in the red dress - it\nfeels like she signals hope and when he finds her in the human pile, it\nseems like all hope is lost - which we see it of course isn't. Although\nthere's so many great actresses in this movie, Liam Neeson truly steals\nthe spotlight with one of his best performances of all time! It's\namazing how he had the ability to play such different role in 1\ncharacter and still have empathy in such hard times. It's a movie I can\nonly recommend and remember not to forget the tissues! :-)\n"},
{"review": "\nSteven Spielberg and Steven Zaillian produced a film which is both\nexciting and a work of art. The characters come alive, the\nrelationships evolve and devolve, the manner in which the holocaust is\ndepicted, from the sometimes beautiful, sometimes grotesque nudity to\nthe extremely honest and direct depiction of the holocaust is done with\na fearless tastefulness that will stay with me for the rest of my life.\nThe greatest experience of art I've ever had. Quite simply, this is a\nmasterpiece that rivals the likes of Beethoven and Shakespeare, if you\nhaven't seen this movie you have yet to experience a piece of the\ngenius humankind are capable of. Thank you Steven Spielberg for giving\nthis film your soul. <br><br>I give this film infinity/10! It just doesn't get any better!\n"},
{"review": "\nSchindler's list showed the Jews would rather die than abandon their\nfaith in God. This is shown when they are forced to leave their homes\nin the beginning of the movie, only allowed to take what they can\ncarry, and leave all other belongings. Some men are seen praying or\nholding prayer beads. As they are gathered on the street, there is many\nanti-Jewish graffiti seen on the walls and windows of shops and so on.\nThey are then moved to the Ghetto, where they are forced to work and\nkept inside the community. They still prayed to God that things would\nbe just again, and still retained faith. When out of no where, the Nazi\nauthority gathers people on the streets and shoots them if they don't\nget on a train to a labor camp. Many are seen paying respects to a\nsmall shrine in their homes, or praying. Even when they are put in a\nlabor camp, an old lady performs the rituals of a Bar Mitzvah for a\nboy. Then they leave the labor camp for Schindler's factory, which is\nwhere there is peace for them. <br><br>Through all these hardships, the Jews that survived still held on to\nthese traditions and belief in God, and those who didn't survive died\nwith their beliefs.\n"},
{"review": "\nThoughtful, perfectly executed and respectful to the subject matter.\nSpielberg is directing from the heart here and delivers his most\naccomplished film. Schindlers List is punctuated by exceptional\nperformances all round from an ensemble cast including career best\nperformances from Neeson, Kingsley and Fiennes. The latter is on\nparticularly fine form as the unremittingly evil Camp Commandant Amon\nGoeth. A powerfully important film - Spielberg's camera never flinches\naway from the horrors unfolding in front of our eyes. But it is never\ngratuitous. Polish Director of Photography Janusz Kaminski delivers\nbeautiful and haunting black and white visuals which will stay with you\nlong after the film is over.<br><br>10/10\n"},
{"review": "\nI first saw this movie in school for my trip to Auschwitz. The movie\nshowed the Holocaust really realistic. The black and white touch gives\nit a some kind of historical flair, which I really like and it goes\nwell with the movie. This is the story of Oskar Schindler who kept over\n1,000 people alive during the Nazi reign. Liam Neeson is phenomenal in\nhis role as Schindler. What I like it the faded splash of faint color\nin the little girls red coat; the rest of the movie is black and white,\nwhich only adds to the impact of the total emotion of this fantastic\nfilm. Schindlers List is such an emotionally shattering and gripping\nmovie that no words can even describe it.\n"}
]