[
{"review": "\nbeing a huge Marvel fan, and also Josh Whedon fan I was super excited\nfor him to come back and do another Avengers movie. The first film was\npretty brilliant. But with this film, Whedon wasn't given much air to\nbreathe, with constant Studio interference and orders of certain shots\nto be re- done, or scrapped if not worse. Put in.<br><br>So, you thinking why is this film so bad, if you are a fan, you should\nlove it. Well the film changes pace, very quickly and abruptly, which\nis a poor sign of movie making. The Characters do not act like they\nwould usually act in the same scenario, the progression of the story is\nall over the place, Scene's that just have no weight or meaning to the\nfilm, but in there because it looks cool or is setting up another\nindependent super hero movie, the Villain that is so smart, but doesn't\nuse the internet and his ability to control everything just to wipe out\neverybody, but rather has this ridiculously stupid plan. The Hero's\nthat are suppose to be smart, intelligent and some what Spanish do not\nsee all of the stupid plot hole that get infiltrated. <br><br>The fighting was also a problem for me, it was the same. Once you saw\nit in the first Avengers, you see exact same thing in the second one\ntoo, and it doesn't even change a little.<br><br>Overall, this film is bunched up due to the constant interference by\nStudio as Josh has stated so many times now.\n"},
{"review": "\nIt's quite an achievement to make a boring Superhero Movie so well done\nto all involved.<br><br>Remember the first average at best Avengers Movie? A baddie in control\nof the Tesseract uses it and an alien army to try and take over the\nplanet. Whilst this is happening the Avengers are brought together\nwhere there are a few internal issues involving having their minds\ncontrolled &amp;/or beating each other up, before joining forces to beat\nthe alien threat.<br><br>Well.... <br><br>This movie is about a baddie who was in control of the Tesseract which\nthen becomes the catalyst for a new robot baddie and it's robot army\ntrying to destroy the planet. This again creates a few internal issues\ninvolving the Avengers having their minds controlled &amp;/or beating each\nother up, before joining forces to beat the robot threat. <br><br>It's just the same movie repackaged (again) which tries to be\nintelligent but comes across as dull. <br><br>Some of the Avengers presence have little or no no point in being in\nthe movie (Hawkeye just being there for example to offer the others a\nweekend retreat to go to).<br><br>But as with the first movie and the upcoming Captain America: Civil War\nit seems as long as the movie is crammed full of as many Superheroes as\npossible and they all kick off at some point during the movie, then\nthis is enough to keep an audience happy.<br><br>Stick with the X-Men at least they make an effort!\n"},
{"review": "\n...Phase 2 of the Marvel movies had been batting .500 for me. I did not\nenjoy Iron Man 3 or Thor: Dark World, but really dug Guardians of the\nGalaxy and Captain America: Winter Soldier (Cap 2 is probably the best\nfilm in the entire Marvel series!)<br><br>Based on that, I don't think I am surprised that I came out of Age of\nUltron with mixed feelings. Overall it is a solid entry, but it is by\nno means flawless. <br><br>The good:<br><br>Really liked the intro of Scarlet Witch and Quicksilver. I liked the\nhorror-movie tropes tied to Scarlet Witch (she is a Witch afterall!)\nand Aaron Taylor-Johnson's Quicksilver had a lot of personality.<br><br>The action, of course, was great. And Hawkeye actually had something to\ndo in this film. <br><br>The Vision: They did such an incredible job building mystique around\nthis character.<br><br>The Bad:<br><br>Wasn't a fan of that extended scene at the Farm. That stopped the movie\ncold. I know some people say \"It was necessary for character\ndevelopment\", but the previous films had done such a poor job of giving\nHawkeye any character that seeing him on the Farm did absolutely\nnothing for me.<br><br>The romance: Ugh. Talk about forced. I like Ruffalo's Banner. I really\ndo. I was surprised how much i did in the first Avengers, cause i'm\nusually not a Ruffalo fan. But I just did not see any chemistry between\nRuffalo and Scar-Jo. And where was the build-up to this? Last time we\nsaw these 2 together Hulk was trying to smash Black Widow. <br><br>Marvel needs to work on their female-story lines.<br><br>Ultron was kind of a lame villain. I don't think there was enough\nbuild-up for him. He just sorta showed up and was evil.<br><br>Overall: Is it worth seeing in the theatre? Yes of course it is. But it\nis not without its flaws, and sure doesn't top Cap 2.\n"},
{"review": "\nThis movie takes a long time to gain any steam, with a lot of all talk\nand no action in the first half of the movie. There is also little\nsuspense and intrigue - just the superheroes pondering and conjuring\ntheir next mission, with Tony Stark and Bruce Banner creating a project\ncalled Ultron to act as a peacekeeping program serving as the movie's\nbackdrop.<br><br>The Ultron project goes horribly wrong and the machine takes a mind of\nits own, threatening to rid the world of humans in attempts to \"save\nthe world\" - something we've heard before.<br><br>We get to see action slowly trickle in during the second half of the\nmovie slowly - lots of crazy CGI action during the rumbling climax.\nThis film's plot sets the story for the next film, Captain America:\nCivil War, in motion. However, I thought this film overall lacked the\nentertainment value due to its extremely slow plot and lackluster\nstory.<br><br>Grade D\n"},
{"review": "\nDisappointing, it summarizes Avengers: Age of Ultron, the film is not\nbad, it's cool just cool, it is frustrating because all the world\nexpected to be better than the first Avengers Ultron which is one of\nthe best villains of the Marvel Comics he is simply poorly executed in\nthis movie, really the film beginning excited about the action scenes,\nthe effects are excellent, the CGI movie is hardly exaggerated, Mercury\nand another character very badly used, as the scarlet witch for a\nfuture in this universe Marvel, the film is unnecessary scenes, the\njokes are always in the wrong time it breaks the film's climax, and the\nend where the Hulk flees the ship hope to explain in the Civil War\nfilm, now the worst thing in the movie, Hawkeye it has more space than\nowed it gets to be ridiculous, he can tip the witch and the mercury\nthat was really ridiculous, the final scene of the movie was good most\nnot enough to thrill, Avengers: Age of Ultron is not even bad, far from\nit, more we expected so that was better than the first to disappoint.\nNote 6.9\n"},
{"review": "\nI expected Age of Ultron to be a worthy sequel to the glorious\nAvengers.When I went to the cinema I expected to see something\nimpressive and innovative.I was completely wrong.The movie is a\ncomplete mess, with pointless filler scenes.Right from the beginning of\nthe movie they showed a combat scene out of nowhere and without ANY\nexplanations whatsoever.They showed Tony using his Iron Man suit when\nin Iron Man 3 he destroyed all of them.How did Lokis scepter fall into\nbad guys's hands ? In order to understand it you need to watch the\nseries ''Agents of SHIELD'', witch is completely unacceptable as far as\ni'm concerned.Later on they show Ultron,Vision, and Scarlet witch whose\nabilities didn't even explain ! How did they come up with that idea ?\nNot all people read comics neither watch the series.Take me for\nexample, during the movie i felt so empty which was the last feeling i\nexpected from the movie.Even the finale witch was supposed to be\n''epic'' was so anti-climatic and strange.Don't get me wrong, i LOVED\nthe first Avengers movie, however. this one is just a waste of time and\nmoney.It is by far the worst movie of 2015 and the worst sequel i have\never watched.\n"},
{"review": "\nLong story short--way too much destruction that was often difficult to\nfollow at times. And who ends up paying for all that destruction?\nStark? The government? Or both? Without question, the cast was awesome\nas usual, including the voice of Ultron, James Spader. The slow-mo\nscenes of everyone fighting was very cool for sure. But the scene where\nthe Hulk goes berserk was way too long. I would have cut the time in\nhalf on that part. I was getting somewhat bored after a while.<br><br>The characters were great; the story was good and I loved the\nstate-of-the-art technology. Enjoyed seeing Paul Bettany (Jarvis), and\nnow that he's an Avenger, hopefully, we'll see more of him. Aaron\nTaylor-Johnson and Elizabeth Olsen were wonderful additions to the\ncast. Too bad Pietro gets killed but at least Wanda was spared.<br><br>The trance scene with Thor, that is, the background scene, was too\nvague, too quick. The camera shots on the whole, in my opinion, were\nspotty. It was hard trying to make out some of the scenes--on the whole\nit was a bit too busy! Sorry! Special effects were great, though.<br><br>I have ambivalent feelings about this movie. The whole movie seemed a\nbit choppy to me. I'm rating it 6 stars.\n"},
{"review": "\nI felt that there was a disconnection with the other parts. For\nexample, Thor's return is never shown not in this and not in Thor's\nmovies. We learn that he has seen Jane after coming but we are not\nshown that, seems as parts are missing. Also we are not shown how the\navengers got contacted and got together. We learn from the Winter\nSolder movie that they have to destroy the centres of Hydra but that\nwas just Steve and Natasha, they never mentioned that they will call\nthe others or keep the avengers alive. This is also feels like a part\nmissing. Their get together. <br><br>I am not gonna talk about life lessons or plausibility because its a\nsuper hero movie and those are pretty obvious how they are in these\nmovies. I must say however that this part was more concerned with\ncharacters dilemmas, their fears. It is an attempt to develop them, let\nthe audience understand them better. A missed target here because\nfirstly, as I said its an super hero movie, the characters are super\nheroes and no matter their dilemmas because of that they will always\ncome back to the same ending and secondly, they did it poorly and\nshortly and it just took a lot of movies time without making any\nimpact. <br><br>The story line is impressive however and that's what a movie like this\nshould have, more wow moments and twists and surprises than character's\ndilemmas. They story is well told with action scenes and fast\ndevelopment and the feeling that you don't know if they all are gonna\nmake it which was new. What I like most about the story is how the\nstory keeps developing through all these series and you can sense that\nit is going to build into something quite exciting. Makes you more\ncurious about the other parts.\n"},
{"review": "\nI have to say, I watched this movie several times but not for the\nreasons you might think. I got an absolute kick out of the cynical,\nsnarky, hilarious, egotistical, fun that James Spader had with Ultron.\nWhen I found out that he was the voice behind it, I kept watching and\nlistening to the way that he totally immersed himself and embodied the\nrole. It was genius. I got no strings to hold me down. <br><br>The only comic books I ever read growing up were Archie. Gasp, choke,\ngasp. No Superman, Spiderman, Iron Man, etc. So for me, the characters\nare larger than life. And since I have no point of reference to compare\nthem to or to critique them against, their personalities are formed and\nintroduced to me on the screen. I learn their backgrounds and history\nfrom watching the movie. <br><br>Realizing that all of the characters in these movies are comic book\ncharacters, should make you also realize that you can't take these\nmovies too seriously. While I learned a lot about our heroes in this\nmovie and there is much more to any of them than meets the eye, they\nare still 2 dimensional for me.There is not enough information to flesh\nthem out so to speak, but I'm sure that will come in future\nmovies.However, Stan Lee and his cameos are always nice to see. <br><br>The next thing is to just enjoy the fun and the dialog. Plot?? Who\ncares. Acting?? Meh. For me, it's fun, it's cool, it's entertaining,\nand frankly worth the money I paid to buy the DVD. I am collecting all\nin the Marvel Universe and will continue watching until I am old and\ngray. Well, older and grayer than I am now. <br><br>For this movie, I do not believe that I wasted 2 hours of my life.\n"},
{"review": "\nWell,Avengers 2 was probably more awaited than the first one,but\nunfortunately,it doesn't quite live up to my expectations.Of course it\nis good to see our heroes go at it again,but the villain is\ninsignificant and is beat at the drop of a hat.Another baseless\narmy,this time,with bots! Sound exciting? The playful tone of the movie\nmake for some fun moments,but stop the movie from having any sort of\nmystery or suspense.The CGI is top notch,and the destruction effects\nseem realistic.The new cast members are nice,particularly Johnson and\nOlsen.James Spader voices Ultron brilliantly,but sadly,the villain is\njust weak.This movie is good.Overall it is enjoyable,but I expect\nbetter from Marvel.\n"},
{"review": "\nAvengers: Age of Ultron is my favorite movie, it has incredible action\nthat blew my mind away. The movie had many surprises having Vision as a\npowerful and peaceful avenger and the hulk-buster that was a awesome\nand epic. I thought that Ultron was a dark, complicated, and emotional\nvillain that made me think of him as my favorite villain. Ultron was\nextremely powerful with unique abilities that would make him one of the\navengers dangerous threats. The beginning was fantastic with the movie\nsetting the plot and then ending with tons of action and excitement\nleaving me with wanting to see more. Scarlet Witch and QuickSilver were\namazing, each having formidable abilities and a tragic story. Captain\nAmerica was heroic and brave and we got to see and know more about\nHawkeye and it made me think how awesome he is. Black Widow and the\nHulk showed a big love interest that made the movie better. Avengers:\nAge of Ultron is my favorite movie.\n"},
{"review": "\nThis movie has its flaws as with any superhero movie. I however enjoyed\nthis one more so than Avengers (2012). The action was tighter and more\nswift. The story however was nothing new, but very engaging dealing\nwith an AI that goes rogue and watching the seeds of disassembling take\nroot among the Avengers. The characterization is some of the best I\nhave seen of any superhero movie.<br><br>Now the bone I have with this movie is that it doesn't take the risk in\nshowing the reality that failure can happen. The ending for this movie\npresented the Avengers with an impossible situation that involved\neither saving the human race at the expense of a failed state or allow\nthe extinction of humanity. This was a pivotal moment in superhero era\nwhere the superhero will have to face a disastrous situation the\nAvengers and the world would never recover from. Instead we get a\ngeneric ending and the Avengers once again saving the day. We could\nhave gotten a movie where the superheroes fail. That's what I was\nhoping to see as that would not only change the dynamics of the\nAvengers, but the dynamics of superhero movies to come.<br><br>Ultron was great but I was hoping for more use out of him in how he\naffects the world structure. When it says Age of Ultron I thought\nUltron was going to revolutionize the world. I was hoping for world\nimplications of his existence nothing short of economic catastrophe,\ninternet shutdown, launch of nuclear weapons codes, wars, massive human\nloss, and of course the murder of the human race at the hands of Ultron\na la robotic army.<br><br>AOU is worth the time and is still a fun ride. Just hoped that the\nAvengers failed this time around.\n"},
{"review": "\nGood: Action scenes were great, along with the stunning visual effects.\nFor a Marvel movie, there's no surprise there.<br><br>Bad: Some of the action was repetitive and kinda dumb. A bunch of\nminions fighting the Avengers led by a big mastermind? Where have we\nseen that before? Banal might be too strong of a word (that was just\nfor the sake of alliteration) but it sure approaches it. The character\ndevelopment is obviously lacking, and so is depth. Humor is a bit\ncheesy, and while I did laugh along with the audience it just doesn't\nfit. There is not a sense of seriousness to the fight, which is why I\ntend to prefer DC movies.<br><br>Verdict: I did enjoy the movie. Not saying I didn't. But it is just not\ngripping at all. If you haven't watched it yet I would recommend you\nsee it but I'm not gonna watch it more than once.\n"},
{"review": "\nAge of Ultron is a worthy follow up to the first Avengers, though it\nultimately is bogged down, ever so slightly, by its inconsistent tone\nand muddled stakes.<br><br>Marvel movies have become almost their own genre at this point. They\nall follow a similar rhythm, yet somehow still seem to retain their own\nvoice. It seems to me that the best, thus far, have been the original\nAvengers and the 2nd Captain America, both of which are considerably\nbetter than this. Though Ultron offers somewhat compelling moral\nphilosophy and the usual excellent choreography, the tone of Ultron as\na villain is ultimately too comical to succeed. Furthermore, though the\nelimination of humanity is certainly high stakes, this movie\ninexplicably takes place in a small, out of the way Eastern European\ncountry that we don't care about, partially because it doesn't exist.\nBeyond this, given Tony Stark's seemingly endless resources, we are\nleft to wonder what actually matters.<br><br>What works here, though, is the usual stuff that works for Marvel. The\ninterplay between the Avengers. The fight choreography is top notch as\nalways. Jess Whedon directs clear and concise battles; it is always\nevident who is fighting who, and how much progress is being made. James\nSpader mostly works as Ultron; the man is a natural talent. His voice\nis haunting, and his talent possesses a tangible texture that is miles\nahead of the other actors here. To be fair, James Spader is miles ahead\nof MOST actors. The hero aptly named Vision is another standout, as are\nthe twins Quicksilver and Scarlet Witch.<br><br>At the end of the day, though, even if this is less than you wanted\nfrom an Avengers sequel, it's still a quite good movie. It's still\nextremely palatable, even if it does go down a little easier than you'd\nlike. More significantly, it's still miles better than anything DC has\ndone with Superman or Batman. <br><br>7 out of 10.\n"},
{"review": "\nAvengers: Age of Ultron (2015) <br><br>*** (out of 4) <br><br>Tony (Robert Downey, Jr.) and Bruce (Mark Ruffalo) are nearing\ncompletion of Ultron in hopes of bringing world peace but something\ngoes wrong and soon what seems like an unstoppable force has the\nAvengers on the brink of ending.<br><br>AVENGERS: AGE OF ULTRON wasn't nearly as good as the first film in the\nseries but there's still plenty to enjoy here as director Joss Whedon\nmanages to keep the action scenes full of energy and there are enough\nbits of comedy to make the film enjoyable to watch. With that said, I'd\nbe lying if I said the story itself was anything overly special and at\ntimes the extended running time seems to be going on for too long.<br><br>There's still enough great action here to make the film worth sitting\nthrough. This includes the non-stop action scenes all of which seem to\nget bigger and better than the previous one. The ending is something I\nwon't spoil but it contains quite a bit of imagination and it really\ncomes to life. As I've said before, it's really amazing how far CGI has\ncome over the past decade. Whereas at one time you could always tell\nwhat's fake that's not the case any more. The CGI flawlessly blends in\nwith the live action to where it blends perfectly together.<br><br>Another major plus for the film is that the casting is simply perfect.\nBy this point in the series you know that Downey is just flawless as\nTony Stark/Iron Man but the rounding cast is also terrific. Chris\nHemsworth, Ruffalo, Chris Evans, Scarlett Johansson, Jeremy Renner,\nSamuel L. Jackson, Don Cheadle and Elizabeth Olsen are all very good\nand certainly help bring these characters to life.\n"},
{"review": "\nI tend to enjoy the Marvel movies and animated movies / TV series when\nI can catch them. Unfortunately I caught Next Avengers: Heroes of\nTomorrow on TV once, and that, coupled with the name Age of Ultron, led\nme to expect something like that animated movie or Days of Future Past:\nthat Ultron takes over and there's a desperate struggle to overthrow\nhim. One early trailer I saw also seemed to enforce such an impression.<br><br>Unfortunately Ultron turned out to be a rather impotent villain. He's\nfull of potential danger, but doesn't manage to realise any of that\npotential. The trailers made the movie look like the threat is a lot\nbigger than it was. Pretty much every danger in this movie is short\nterm and thwarted without too much problem. I kept waiting for\nsomething truly dramatic to happen, but it never did. There's no Age of\nUltron in this movie, not even a glimpse of it, and for me that was\ndisappointing enough that I didn't enjoy the movie much.<br><br>There's decent action, drama and humour, it's not a badly made movie,\nbut the villain is weak, and even the ultimate danger, the death of the\nhuman race, is less dramatic than potential subjugation, which is what\nmost villains go for.\n"},
{"review": "\nI liked this movie better than the first Avengers film. The topic of\nsingularity makes the story more interesting than the first one. The\naction was very fast and well done, it kept the movie upbeat and\nthrilling. Yet the action still overshadows the story way too much,\nthere isn't enough time left for any character development (but still\nmore character development than in the first movie). After all the\nMarvel movies i've watched i still don't feel like I really know the\ncharacters as well as I should. Out of all the Avengers i think i enjoy\nThor the most, because Chris Hemsworth looks like a God, he looks\nroyal, best casting ever.<br><br>I thought 'Avengers: Age Of Ultron' was enjoyable and fun, but not\nreally life-changing or original. Maybe i'm just not enough of an\naction fan to be in love with the Avengers movies.\n"},
{"review": "\nIf there were not an audience for Marvel comic heroes than clearly\nthese films would not be made, to answer one other reviewer although I\nsympathize with him somewhat. The world is indeed an infinitely more\ncomplex place than the world of Marvel comics with clearly identifiable\nheroes and villains. But I get the feeling that from Robert Downey, Jr.\non down the organizer and prime mover as Iron Man behind the Avengers\nthese players do love doing these roles because it's a lot of fun. If\nthey didn't show that spirit of fun to the audience than these films\nwould never be made.<br><br>So in that spirit of fun Avengers: Age Of Ultron comes before us and\neveryone looks like they're having a good time saving the world. A\ncomputer program got loose and took form in this dimension named Ultron\nand James Spader who is completely unrecognizable is running amuck in\nthe earth. No doubt Star Trek fans took notice that this guy's mission\nis to cleanse the earth much like that old earth probe NOMAD which got\nits programming mixed up in that classic Star Trek prime story. Wouldst\nCaptain James T. Kirk of the Enterprise had a crew like Downey has at\nhis command.<br><br>My favorite is always Chris Evans because of the whole cast he best\ngets into the spirit of being a superhero. Of all of them, he's already\nplayed two superheroes, Captain America and Johnny Storm the Human\nTorch. I'll be before he's done Evans will play a couple of more as\nlong as the money's good and he enjoys it.<br><br>Pretend you're a kid again and enjoy, don't take it so seriously.\n"},
{"review": "\nI think most of us can agree that the first Avengers movie was awesome,\nso I was expecting Marvel to knock it out of the park again. Right?<br><br>Wrong. So wrong.<br><br>The storyline makes it appear as if two conflicting scriptwriters tried\nto piece their work together. Ultron (the robot) comes across as crazy\n(which I'm sure was the intention) but not entertaining- crazy, more\nhead-shake crazy. We take an entirely random (and lengthy) detour past\nHawkeye's home, where it appears he has a secret family. Big whoop. The\noccasionally funny scenes (such as where everyone has a go at trying to\npick up Thor's hammer) are just overwhelmed by the sheer volume of fail\nwhich comprises most of the movie.<br><br>Come on Marvel, you've proved in the past that you can do so much\nbetter than this.\n"},
{"review": "\nThis film was good I was a fan of the marvel cinematic universe I\nenjoyed every movie of marvel cinematic universe except for Thor the\ndark world , captain America the first avenger and iron man ( they were\nforgettable)<br><br>Now we have age of ultron well is it good you bet it's fantastic I\nenjoyed it more like the 1th one.<br><br>Now the effects of this amazing brilliant movie is that this movie is\nincredible every fight scene in it is awesome and the new hulk buster\nsuit it's incredible oh yeah.<br><br>Now this movie is not in the cinema anymore so I recommend you check\nout the film in DVD because it's worth watching keep it real.\n"},
{"review": "\nAlthough there are imperfections, Age of Ultron is a worthy successor\nto Avengers Assemble. It gives us all the first movie did and more.\nSome action fans might be disappointed by the heroes' downtime but it\nwas time for valuable character development, particularly for Black\nWidow and Hawkeye, two of the more interesting characters in the\nfranchise. There were a few bizarre changes of direction in\ncharacterisation - this reviewer was not entirely convinced by the out\nof left field romance storyline for the Widow and the Hulk - but\nnevertheless to see our heroes more vulnerable and human was a welcome\nchange. There were still wisecracks aplenty and lots of action, enough\nto please everyone in my opinion, but the development of the backstory\nwas very welcome. The new characters were also well-received;\nparticularly Scarlet Witch, and it's nice to see another female added\nto an ensemble cast which is incredibly male-heavy. Sad to see one of\nthe other new characters not used to his full potential; but his\nsacrifice was a necessary part of the plot. All in all, an improvement\non the original.\n"},
{"review": "\nAgainst the excellent previous Avengers film I mean. Seen this four\ntimes now over the last few months so it seems to be a film I enjoy for\none reason or another. It definitely helps that when I was a kid I\nbriefly got into superhero comic book adventures, then left it for\nother things but think I still understand the genre\u0085and even a few of\nthe plots. Marvel will worry about alienating people who can't keep up,\nas they first started to in the '70's; but ultimately no one can keep\nup, including their scriptwriters. However, they're by far the best\nones to do their stories.<br><br>More or less superhuman Goodies vs Baddies led by a violent peacekeeper\nUltron in a breathless bone crunching nail biting 2 hours, mixing\nmayhem and wise-cracking comedy effortlessly. It's pointless describing\nanything in more detail even if I understood it: the plot's\ndeliberately barmy but engrossing, with cgi cartoonery used as it was\nalways meant to be used - with many variations we've seen it all before\nand with many more variations being presently dreamed up expect to\nagain and again. As with the first film there are many iconic comic\nbooky scenes for posterising. Ultron cynically sings I've Got No\nStrings from Pinocchio occasionally, but the original Thunderbirds were\njust as realistic to me. Worthy of note is the almost Shakespearean\nscene on the train between baddie Ultron and Scarlet Witch after her\nbrother's surprising demise.<br><br>Highly enjoyable and recommended non-essential viewing by this\nnon-expert non-purist, the running time whizzes by every time I see it.\nAt this rate I may understand it all in about a year's time too. Do\nMarvel include Howard The Duck in their Cinematic Universe?\n"},
{"review": "\nNow let me just say, this is a very good movie, much darker from the\nfirst but still very good. Here we see Ultron against the Avengers with\na back story very different from the comics, but possibly a necessary\naddition for his introduction. The threat level doesn't seem as high in\nthis one as previous movies but overall it is still very good. Ultron\nis perfectly voiced by James Spader to bring the menacing character to\nlife and truly move you to fear what his intentions may be. Once again\nas it was in the first movie, the pacing is very good, the characters\nare well fleshed out, the story is well presented and all in all the\npiece is thoroughly executed. The fights between Ultron and the\nAvengers are very exciting to watch and once again the slow panning of\nthe heroes around the battlefields is well utilized from scene to\nscene. Included in this is also a very strong ending to a fairly well\ncreated piece of cinema. I give this a 10 out of 10 and am happy I was\nable to experience this. \"I was designed to save the world. People\nwould look to the sky, and see hope\u0085 I'll take that from them first!\"\n\u0096Ultron.\n"},
{"review": "\nThis is by far one of my favorite movies from the MCU. The introduction\nof new Characters both good and bad also makes the movie more exciting.\ngiving the characters more of a back story can also help audiences\nrelate more to different characters better, and it connects a bond\nbetween the audience and actors or characters. Having seen the movie\nthree times does not bother me here as it is as thrilling and exciting\nevery time I am watching it. In other words, the movie is by far better\nthan previous movies (and I do love everything Marvel), the plotting is\nsplendid (they really do out do themselves in each film, there are no\nproblems watching it more than once.\n"},
{"review": "\nUnwatchable. Looks like a no-content pop video, but it lasts for 130\nminutes... No atmosphere. No music. No character development. i would\nREALLY prefer to watch the care-bears from 1990 for excitement.<br><br>i counted 27 different cameras edited into in 7 seconds in a small\nsection in the middle where i decided to count the focal time spent on\nscenes.<br><br>The average scene in this movie is probably about 0.6 second long, with\na small few scenes lasting more than 5 seconds, and about 100000 scenes\nthat last 0.1 seconds long. <br><br>It was abominable from a human standpoint. how much information do\npeople exchange when they are interacting for 1 second at a time and\nthen cutting to console-game animations. <br><br>The special effects were not amazing at all. I have only contempt for\nthis cinematic style. Clearly you have to have been playing sonic the\nhedgehog and watching super-fast cartoons since the age of 2 years old,\nALL DAY, to have a concentration that disrupted so that you can make\nsense of this movie. <br><br>I am sorry that i trusted IMDb reviews on this. I could write a these\non how bad it is and how similar no scenery, no acting, no scenes, no\nmusic, frenzy, frenetic, zoom-around, no focal time, shaking, zooming,\nnauseating camera work with bad special effects, are wasting good\nHollywood budgets and resources.<br><br>I would say that i twitched, recoiled, was perplexed.\n"},
{"review": "\nThe Avengers Age of Ultron (if you can even call this \"movie\" such\nwithout putting prefix \"Fail\" somewhere in the title) is one of, if not\nthe most overrated, lackluster, contentless, and uninspiring superhero\nsequels that for the past ten years. (Still not as bad and\nunintelligibly insulting as Iron Man 2. But close.)<br><br>Mainly because this movie does not deserves anything from what was\nascribed to it. Many claim that it's better than the original. Which,\nto be fair, doesn't say much, considering that I thought the original\nAvengers was an okay movie.(And that comes from a die-hard comic book\nfanboy whose been reading Avengers titles since late 90s) But this\nmovie, even despite the fact that I don't love the first movie, is way\nbelow the first movie. The Avengers Age of Ultron has a poorly scripted\nand poorly thought-out plot that gives no investigation to the actual\nstory. It has poorly written while decently acted characters. Captain\nAmerica is the most uninteresting and uninspiring character in the\nwhole film, even considering the fact that he is supposed to be a\nleader and the core of the group. <br><br>But it doesn't say much, since every character in this film was bland\nand uninspiring. It relied way too much on the overused and formulaic\nhumor that most of the time feels out of the place. And, of course,\nsince it's Marvel Studios, we have YET another bland, uninteresting\nvillain with weak motives (which is a standard for any MCU movie at\nthis point). List goes on and on. And there is no excuse for this movie\nto be they way it is, like, for example, \"This movie was meant to be\nfun. It's not supposed to be taken seriously\". <br><br>Well, in this sense, I'm taking seriously the fact that most people\noveracting and overpraising dull and uninspiring movies like this.<br><br>Overall, not worth it. I guess I will stick reading old reprints of\nKurt Busiek's Avengers run to restore my love for these characters\nafter I saw the movie.\n"},
{"review": "\nAvengers:Age of Ultron is one of the final movies in marvel phase 2 and\nwhile not as great as the first one,this movie is still very good. The\naction in this movie is truly spectacular and the visual effects are\nreally good and believable throughout.This movie is filled with\nfighting sequences from the very beginning until the end.And I love all\nof them especially the end battle where the stakes are really high and\na few emotional moments. Quicksilver and Scarlet Witch are some of the\nnew additions and they are very awesome and well done.I honestly\nthought that Quicksilver is not going to be good after what I saw on\nX-Men DOFP but he is great here too,and so is the actor who portrays\nhim. I love the group talks,seeing them get mad at each other and\nhating/loving is just so much fun and interesting.Also this movie is\nfilled with laughs and comedic moments everywhere,which I truly\nappreciate. As about the main villain,Ultron,in my opinion,he was very\nwell done.I really liked him,and his sarcastic jokes.which I found\nfunny every single time.He is mesmerizing and not forgettable at\nall.His intentions very understandable and the only problem with him\nwas his creation,which felt rushed but besides that he is a very good\nvillain. There are some things that don't quiet work here,and other\nthings that they did which just feel like they are setting up for the\nnext movies to come in the marvel universe,but these are small flaws\nand passable ones because this movie overall is very well done and\ninteresting until the very end.\n"},
{"review": "\nAge of Ultron is a tiresome flick. The characters are the same as\nexpected but Iron Man has become more snobbish and self centered. The\ncharacter has gone over the top with his abilities to the point where\nthe writers of the script give him carte blanche which makes Tony Stark\nin to an annoying 4 yr old.<br><br>The Hulk is better CG, which is a good thing, but now he isn't the same\nBruce Banner who has uncontrolled rage and then forgets every thing he\ndid while as The Hulk. The writers have had to change his character\nbecause, uncontrolled, he becomes a loose canon. You can't give him any\nreal dialog. Which ruins the character for me because I grew up with\nhim being this blind rage of power going off to smash puny bad guys\nwhile saving good people who are scared of him.<br><br>Marvel has become this lack luster pile of poop which is pushing out\ncrappy movie after crappy movie to cash in on the popularity of comic\nbook characters. This has caused movies like Age of Ultron to stink.<br><br>There are some serious plot holes in the script but I'm not going to\ndwell on it. With out them the movie is still sub-par. The supporting\ncast is pushed through the movie like a scrap meat being put through a\ngrinder.<br><br>Captain America is flat. Barton is a worthless character. Black Widow\nis only eye candy. Thor is Thor, I honestly don't think they could\nscrew him up. Nick Fury is... terrible. This Vision is too limited. <br><br>The creators of these movies keep trying to cram too much in to the\nstory when it took dozens of issues to build up just one character. Too\nmuch is lost on The Vision and his backstory by shoving him in to the\nfinal ten minutes of the movie as a escape for the writers.<br><br>I watched Age of Ultron on Amazon and it took less than five minutes of\nthe movie to make me want to start fast forwarding. I'm glad I didn't\npay top dollar to see this in the theater. It wouldn't have been worth\nthe money.\n"},
{"review": "\nWhen I first saw this in the theatre, I thought it was too busy and\nSpader was a little cartoony. But on first viewing you're always\ncomparing it to the original, so you need a time to step back. Now, I\nsee how well written it is and how the humor really fits perfectly,\nconsidering Ultron is Stark's alter ego. I also never really thought\nmuch of Scarlett as an actor, but her scene at the beginning with the\nlullaby really showed an incredible range of emotions in just a small\nscene with great subtly. All of this is a result of great writing, both\nin story line and dialog, along with everyone of the actors being first\nrate. I'm glad to finally see comic book movies reaching the\nintelligence of their source material. I'm not a comic book geek but a\nmovie lover, so I don't have any of the preconceived prejudices. I\ncould go on and on about all the subtle inferences to modern day\nterrorism and America's role as the world's bully and hated cop, but I\njust wanted to give it the positive review it deserves.\n"},
{"review": "\nAvengers: The Age of Ultron is the sequel to the fourth highest\ngrossing movie of all time. At the risk of over-hyping it any more, I\ncan say it's probably the best Marvel movie to date. It manages to be\naction-packed, dramatic and even very funny in all the right places.<br><br>After the Avengers lead a successful raid against a Hydra outpost, Tony\nStark (Robert Downey Jr) revives his secret peacekeeping program Ultron\n(voiced by James Spader) to help safeguard the planet from evil.\nHowever, Ultron interprets the idea of keeping Earth safe as a need to\neradicate humankind from existence. Ultron shortly escapes from Stark's\nlaboratory to act out its mission and it's up to the Avengers, along\nwith their new allies, the twins Quicksilver (Aaron Taylor-Johnson) and\nScarlet Witch (Elizabeth Olsen) to stop Ultron from carrying out this\ngenocidal act.<br><br>Even though it is darker than the first film, Avengers: The Age of\nUltron is still able to capture the charm and humour from its main\ncharacters that we have grown to love over the years. Tony Stark is\nstill as witty as ever, delivering his trademark hilarious one-liners\nand Hawkeye's (Jeremy Renner) scenes have some of the most poignant\nmoments in any Marvel film. But perhaps the biggest surprise were the\ntwins Quicksilver and Scarlet Witch, who played a much more important\nrole than I thought they would. There's rarely a dull moment.<br><br>I rate it 9/10, a bit higher than its predecessor, which I rated\n8.5/10.\n"},
{"review": "\nThis movie did not disappoint! Extremely well done! You are totally\nbeen sent to different place where That's what a movie should be all\nabout! I seriously cant wait to see more of avengers.. I never really\nlike avengers before but MAN I become a fan now! Shrieks<br><br>The plot is well made, Everything about the story line and the\nassociation of each characters and the actions itself is totally\nbreathtaking. <br><br>One of the most, exciting movie i have ever seen thus far. And I am so\nhoping to see more!<br><br>Furthermore, I don't even get why these people does not appreciate a\ngood story telling and visual impact of the movie! This movie rocks! I\ncant wait to see scarlet witch improve! And the other, avenger\ncharacters! <br><br>WHOHOHO!!!\n"},
{"review": "\nBad sequel to the fantastic 2012 \"The Avengers\". Tony Stark/Iron Man\n(Robert Downey Jr.) and Bruce Banner/Hulk (Mark Ruffalo) attempt to\njumpstart a system to keep peace all over the Earth. Things go wrong\nand they create a being called Ultron (voiced by James Spader) who sets\nout to destroy all humans. It's up to the Avengers to stop them but\nhe's helped by the Scarlet Witch (Elizabeth Olson) and Quicksilver\n(Aaron Taylor-Johnson).<br><br>This sequel is just terrible. The script is kind of vague in specifics\nabout why Ultron hates humans and the Avengers so much. Also the\ndialogue here is TERRIBLE! No actor could put over the lines these\npeople are given. So, understandably, almost all the acting is bad.\nOnly Scarlett Johansson (as Black Widow), Mark Ruffalo and Jeremy\nRenner (as Hawkeye) give good performances. Worst of all the three new\nsuperheroes--Scarlet Witch, Quicksilver and The Vision--are very badly\nintroduced and poorly used. Also the movie is far too long at almost\n150 minutes and is more boring than exciting. Yes the special effects\nare flawless and there are a few very exciting and long action\nsequences but they can't save the movie. At the end the movie takes a\ndisastrous turn and turns in a Transformers like movie! Boring and\npointless with bad acting and dialogue. I give it a 5 for the effects\nand action.\n"},
{"review": "\nI went to see the new Avengers movie the opening weekend. There was a\npacked theater and you could feel the excitement. I heard many Ooos and\nAHss during the movie as well as laughter during the funny moments. I\nliked the movie not only for the obvious content but also for the many\nsurprises and \"Easter eggs\" spread around for the comic book fans. I\nwas very happy that the X-Mens Magnetos children, Scarlet Witch and\nQuicksilver were in it. Marvel was not allowed to call them mutants in\nthe movie by agreement with Fox studios. Their first appearance in the\ncomic books were in the Uncanny X-Men #4 back in 1963.I felt this was a\nfantastic move in the right direction for the marvel universe. Fans\neven got to see the high rise building under construction that was used\non the cover of the Fantastic Four # 26 when the FF teamed up with the\nAvengers to fight the Hulk. So, those seemingly small things put in by\nmarvel put in throughout the movie is the reason some critics rated the\nmovie average as opposed to those who rated it great; many people\nsimply did not understand what was going on in the plot or in the\nbackground, hence causing confusion and in some cases even\ndisappointment. Why does marvel do this? Because they are confident\ntelling their stories in their own way. And marvel of course, set up\nthe next Avengers movie by showing a villain a few minutes into the\nfinal credits. In closing, I recommend seeing this movie at the theater\nas soon as possible and maybe even watching it again at a later date to\nabsorb it all.\n"},
{"review": "\nfirst I will say that the \"avengers age of ultron\" is a fantastic film\nof marvel yet.<br><br>I also watched and liked the first one back in 2012 and I liked this\none also the acting was very good and the director joss whedon proved\nhimself once again by making such a great sequel of a great film.<br><br>I became a marvel movie fan since \"iron man 3\" and all of the marvel\nfilms I watched after it was just awesome and in fact prior to iron man\n3 the other marvel movies was also good a their places respectively.<br><br>\"iron man 3\" ,\"winter soldier\" and \"guardians of the galaxy\" are the\nbest works done by marvel yet and now age of ultron. the action scenes\nwere good as I expected and the story was also good overall it was a\nfantastic sequel and lives like a king as the first avengers did.<br><br>\"AN EPIC FOLLOW UP TO A GREAT FILM OF 2012\" HAIL\nMARVEL................................................ ............\n"},
{"review": "\nLet's first start with how epic this movie is. As soon as the movie\nstarts, we are already in the middle of a battle. The movie didn't\nwaste anytime getting into full swing. After the battle we get\nintroduced to the one and only Ulton voiced by the amazing James Spader\nwho did an amazing job with the character making him menacing and\nintimidating. My favorite hero in this movie had to be Scarlet Witch\nwho's powers were amazing to watch especially in 3D. The movie was\ndefinitely darker toned than the last Avengers which made it even more\nenjoyable to see something different in a Marvel movie. Part of me\nwishes we were able to see the flacon in the final battle. Speaking of\nthe final battle, I loved what they did with the final battle stage. It\nwas definitely different than most final battle stages in a Marvel\nmovie.\n"},
{"review": "\nThis is a movie I've been waiting months to see. I'm a big Marvel\nComics and movie fan. This is one well crafted, superhero and super\nfun..<br><br>As for the characters and cast , All the returning cast are as good as\nthey have been in previous installments.Aaron Taylor-Johnson as Pietro\nMaximoff/Quicksilver his acting is as expected personally I find him to\nbe a good actor.Then we have Elizabeth Olsen as Wanda Maximoff/Scarlett\nWitch, another extremely talented actress in my opinion, she was\nbrilliant in this too..<br><br>The runtime does seem long however, there is enough going on at every\nturn that you kind of forget how long you have been watching and that\nis a good thing.<br><br>All in all its a best Marvels movie, and if you're a fan of Marvel,\nSuperheros or action films in general, you have to see this. :)\n"},
{"review": "\nNothing more, nothing less.<br><br>Hollywood was out of idead, until Marvel became company with Disney and\ncreated a masterplan for a saga containing some of the greatest stories\nin comicbook-history onto celluloid...a few years ago everyone would\nhave said: \"Impossible to do\".<br><br>Now the Infinity-Gauntlet-story gets more and more real, including the\nCivil-Wars, Ragnarök and more of the most complex comicbook- sagas into\nONE big masterplan.<br><br>Every other studio tries no to create it's own universe, it revoluted\nblockbuster-history, and I dare to say it saved cinema for a long time.<br><br>AoU is no exception: (I want to exclude spoilers) So many big names,\ncharacters and story are meanwhile puzzled to one highly anticipated\nclimax, which becomes reality in a few years.<br><br>I'm deeply impressed and say one thing to the Americans, who will see\nAoU from next week on: The first Avengers was a small French comedy\ncompared to AoU.<br><br>It's spectacular, overloaded and FULLY comic-related.<br><br>Of course there are plot holes, logical errors etc., that's cinema. But\nthe way HOW the story evolves to a common sense, the way it was planned\nbefore, the way fresh characters continue hooking on the\nSaga-train...there is no comparable example to this.<br><br>The MCU and the Infinity-Gauntlet-story has it's place in Cinema-\nhistory already.<br><br>Of course DC can make it better, there is still improvement-space left.\nBut Marvel started it all...many thanks to Kevin Feige and his ideas!\n"},
{"review": "\nWith a mountain of expectations this movie went to the floors and\npulled off something very few movies are able to. In fact, IMHO, none\nof the movies so far, has done it as brilliantly as Avengers AOU.<br><br>One thing which I liked the most about the movie was that it involved a\nbit of story to every single thing happening and was narrated in\nbeautiful as well as very convincing manner. Nothing was defying logic\nor didn't make sense. Although Hollywood writers have a very good hand\nat developing a convincing plot to their story, Avengers AOU took it to\nanother level. <br><br>Visually the movie scores more than 10 on 10. Some really great\ngraphics work has been accomplished at Marvel Studios last year and\nearly this year. You can see this in the 141 minute entertainer. The\nScarlett Johansson bike scene distinctly reminds you of Carrie-Anne\nMoss Ducati chase of Matrix Reloaded. <br><br>The acting has been beyond expectations and none of the actors\ndisappoint, irrespective of the screen time they get. Like the earlier\nversion, the movie is able to give justice to each and every super\nhero, be it in terms of importance given in the story or the screen\ntime. As some of the leaked reports would have already told, the epic\nbattle between Iron Man and Hulk is worth waiting for and is\nspectacular. <br><br>At the end, ,just like Fast and Furious 6 left everyone waiting for\nFF7, Avengers - AOU keeps you waiting for Avengers 3. Just hope it\ndoesn't disappoint like FF7 did, because the standards set by AOU is\nvery very high.\n"},
{"review": "\nThe Avengers raid a Hydra base in Sokovia commanded by Strucker and\nthey retrieve Loki's scepter. They also discover that Strucker had been\nconducting experiments with the orphan twins Pietro Maximoff (Aaron\nTaylor-Johnson), who has super speed, and Wanda Maximoff (Elizabeth\nOlsen), who can control minds and project energy. Tony Stark (Robert\nDowney Jr.) discovers an Artificial Intelligence in the scepter and\nconvinces Bruce Banner (Mark Ruffalo) to secretly help him to transfer\nthe A.I. to his Ultron defense system. However, the Ultron understands\nthat is necessary to annihilate mankind to save the planet, attacks the\nAvengers and flees to Sokovia with the scepter. He builds an armature\nfor self-protection and robots for his army and teams up with the\ntwins. The Avengers go to Clinton Barton's house to recover, but out of\nthe blue, Nick Fury (Samuel L. Jackson) arrives and convinces them to\nfight against Ultron. Will they succeed? <br><br>\"Avengers: Age of Ultron\" is an entertaining adventure with impressive\nspecial effects and cast. The storyline might be better, since most of\nthe characters do not show any chemistry. However, it is worthwhile\nwatching this film since the amazing special effects are not possible\nto be described in words. Why Pietro has to die is also not possible to\nbe explained. My vote is eight.<br><br>Title (Brazil): \"Vingadores: Era de Ultron\" (\"Avengers: Age of Ultron\")\n"},
{"review": "\nI was reading some of the post and seemed very surprised at the few low\nratings , I know you can't please everyone. All of the fighting scenes\nwere spectacular I never got bored , even through the slower parts I\nenjoyed the whole movie. I think that the humor in it was great , and\nrealistic . You get that much testosterone in a group everyone will try\nto one up everyone else, In real life as well. I saw it in iMax(the\nhuge screens) 3D , so that definitely added to the excitement , I don't\ngo see movies any more in regular screen ever since imax 3D. I strongly\nrecommend going to see it like that ! It is an unforgettable\nexperience. Also on a side note guys that get disappointed I don't feel\nbad for because just like with everything in life if you expect\nsomething a certain way and it doesn't meet your expectations you are\ngoing to get let down ! But if you have none or at the very least lower\nyour expectations you will see how much of a difference it is . Go in\nwith an open mind , don't be so closed minded people. Just saying !\n"},
{"review": "\nWell, I watched it last night and I am still amazed and thinking about\nit! Truly one of the greatest marvel movies. I read some of the\nnegative reviews from other users and I have to say that I don't\nunderstand them. Sometimes it feels like they paid a ticket to see a\nmarvel movie, and then they expected some kind of Oscar winning\nperformance and some deep and meaningful life-inspiring story. No.\nThat's not it. If you expect that, look for another movie. <br><br>For me, this kind of movies is like having single-flavor smoothies,\nlike lemon or orange or strawberry, and then, one day a guy comes and\nsays, \"do you want them all in one?\". That's actually it. Iron man,\nThor, Hulk and Captain America, some very successful characters,\nall-in-one! What more can you ask for? <br><br>I really liked the depiction of the different characters and how they\nall blended and interact with one another. It's really nice how each\ncharacter keeps its own uniqueness and how they also blend together,\ncreating some amazing moments. I really appreciated the humor of the\nmovie which was really useful to break the tension in many points\nduring the story. <br><br>The Ultron was AMAZING as a villain as well as the Vision. The movie\nwas packed with action and had an amazing flow that made you think you\nwere already 1h30m into the movie, when it was actually only 45\nminutes. Scenes that were too much even for such a movie were\nsignificantly less than the first movie. I really liked the way some\nparallel stories evolve and I was really happy to see in the end how\nthe movie leaves room for another one.\n"},
{"review": "\nAvengers: Age Of Ultron is the squeal to the avengers(2012). Age Of\nUltron is about when Tony Stark tries to make a robot called Ultron.\nIt's meant to save the world but things go wrong and now they have to\nget every avenger and more people to stop Ultron. First off, Age Of\nUltron was amazing and blew the first avengers out of the water.\nEverything was more fun, and raised the stakes to a whole another\nlevel. Now, there are some parts of the movie that felt not needed for\nthis movie but you know that it will become a bigger piece in the MCU.\nWhat makes age of Ultron great as the first one is seeing all the\navengers together. The old cast is great as before and with the\naddition of the new characters, it's just better. Quicksilver and\nScarlet Witch were great additions to the MCU. The one person who stole\nthe whole movie was Hawkeye. He had a lot more screen time and much\nmore character development. Overall Avengers: Age Of Ultron was an\namazing movie, much smarter and fun than any other marvel movie yet. A\nmust watch In the theaters. Great start to the summer movies of 2015.\n"},
{"review": "\nAvengers Age of Ultron is an excellent sequel and a worthy MCU title!\nThere are a lot of good and one thing that feels off in my opinion. <br><br>THE GOOD:<br><br>First off the action in this movie is amazing, to buildings crumbling,\nto evil blue eyed robots tearing stuff up, this movie has the action\nperfectly handled. And with that action comes visuals. The visuals are\nreally good, even though you can see clearly where they are through the\nmovie, but that doesn't detract from the experience. While all the CGI\nglory is taking place, there are lovable characters that are in the\nmix. First off the original characters, Iron Man, Captain America,\nThor, Hulk, Black Widow, and Hawkeye, are just as brilliant as they are\nalways. And Joss Whedon fixed my main problem in the first Avengers by\nputting in more Hawkeye and him more fleshed out. Then there is the new\nAvengers, Quicksilver, Scarletwich, and Vision, they are pretty cool in\nmy opinion. Vision in particular is pretty amazing in all his scenes.<br><br>THE BAD:<br><br>The beginning of the film it's fine until towards the second act and\nthere is when it starts to feel a little rushed. Also I do feel like\nthere are scenes missing but there was talk of an extended version on\nBlu-Ray so that's cool.\n"},
{"review": "\nThis movie is my most anticipated film of 2015 and it lived up to the\nhype. It is one of the best action films that has been released in the\nlast 5 years and one of the best comedies in the last 3 years.<br><br>This movie is like Marvels Empire Strikes Back because it is a lot\ndarker then the original movie with the Avenger not being torn apart on\nthe outside by Ultron but being torn apart from the inside with\nfighting between the group.<br><br>This movie took some risks with adding in characters like Quicksilver,\nScarlett Witch and Vision and they all fit in perfectly, I would even\nsay that Aaron Taylor Johnson's Quicksilver was as good as Even Peters.\nThey also had a good explanation of how Quicksilver and Scarlett Witch\nactually happened.<br><br>Now probably the strongest part of the movie Ultron he was an even\nbetter villain then Loki was in the original because not only does he\nhave the ability to test the Avengers but he is also delivering some of\nthe best one liners in the whole film. He also had some great\nphilosophical views and you understood why he was doing what he was\ndoing. Also James Spaders voice worked perfectly for this villain.<br><br>So if you haven't guessed by now I loved this film and I think that you\nshould go see it know.\n"},
{"review": "\nNow, before you question me about the title compared to my rating, let\nme clarify. This movie is absolutely fantastic; it's witty, it's action\npacked, and even emotional. But before you see it, you have to put\naside all the hype that you have been building up for the past couple\nmonths.<br><br>I think the main reason people are disappointed about this movie is the\nfact that they bought into the unimaginable, unobtainable hype. This\nmovie is hands down, better than the original Avengers, yet people are\nrating it worse. The only reason I can think of, is the fact that they\nwatched the trailers, and believed that would be the beginning level of\nthe movie. News flash, they put some of the greatest parts in the\ntrailer to get you interested in it.<br><br>If you enjoy movies on a big scale, have great acting, great chemistry,\nsome easter eggs for the next movie, and solid jokes, you will like\nthis movie. If you are expecting this movie to be something like the\nsecond coming of Jesus, then you will be disappointed.\n"},
{"review": "\nJumping right in to the action, this is one heck of a thrill ride only\nslowing the pace for a few moments to give a little back story to\nseveral characters that have not had their own film, and the new\ncharacters. I enjoyed the fight scenes immensely, with one in\nparticular that had me grinning like the Cheshire cat.<br><br>Fans of the Marvel movies will already know what to expect from Thor,\nIron man and Captain America, and the real delight for me came from the\nnew arrivals, especially Paul Bettany as Vision.<br><br>The Real highlight for me was the villain Ultron. The way he looks and\nmoves combined with the amazing voice from James Spader gives Ultron\nreal screen presence and a great sense of menace that sets it apart\nfrom other robots in film.<br><br>The only thing I would have changed in this movie was to give Anthony\nMackie a bigger part in it because i really enjoyed his performance in\nCaptain America: the Wintrr Soldier, and was disappointed not to have\nhim alongside Chris Evans again where he seemed to fit perfectly in his\nprevious appearance. Vastly enjoyable film for all except the art\ncrowd.\n"},
{"review": "\nOK. So let me start off by saying that action movies are not my\nabsolute favorite genre in the world, I do enjoy action but I dislike\nwhen a scene of action goes on so long that you forget exactly why they\nare fighting in the first place. Well. Avengers Return of Ultron was\naction packed AWESOMENESS. They knew exactly how to break up all the\naction with GENUINE humor (not groan worthy puns. I'm looking at you\nFurious Seven) and class. This movie is the whole package for EVERYONE.\nYou have action, romance and humor. This is SURPRISINGLY better than\nthe first one! The story line that they put together was genius and the\ncinematography of the final battle scene sincerely took my breath away.\nThis is a must see for fans of action, the Avengers, but also movies!\nIt's what action movies in the 21st century should be like! The WHOLE\npackage.\n"},
{"review": "\nI really should keep up on Superhero movies . But there's a reason I\ndon't - I simply don't like them . They personify everything I dislike\nabout modern Hollywood blockbusters , lots of explosions , lots of\nstunts and lots of CGI . It's less like watching a film and more like\nlogging on to youtube and watching gameplay of the latest state of the\nart computer game <br><br>AVENGERS AGE OF ULTRON gets off to the exact start I'm talking about .\nMost of the iconic Marvel Superheroes - and the audience are thrust in\nto an opening action sequence . It's very vague what this mission is ,\nsomething about East European baddies in league with Hydra working on\nsome artificial intelligence . Ignore the narrative because the opening\ninvolves lots of stunts , ramping and explosions with the occasional\none liner thrown in . You want action you've got it . You want\nintelligent , stimulating storytelling ? Go and read a book . I can\nunderstand what the producers are pandering to but I found this\npre-title sequence rather uninvolving and the rest of the film\ncontinues in the same way <br><br>One thing the film does try and do is merge high concept action with\ncharacter driven moments . On paper it does have a relatively good cast\nand it'd be a pity to waste it on overblown action but it's not really\nan actors type of film and while the production team deserves some\ncredit for trying to concentrate on character but it's not developed\nenough to be entirely successful and comes across as rather shallow <br><br>Despite this short review I'm big enough to stick up my hand and say\nthis movie isn't produced for grumpy , middle aged men like myself ,\nit's produced for younger people who can't get enough superhero movies\nand for this market the prospective audience will probably love it so\nmuch so that that'll be a contender for biggest grossing film of 2015\nand we'll be getting more Marvel movies for the foreseeable future\n"},
{"review": "\nIn the first AVENGERS, the villain was Thor's personal albatross, and\nnow Tony Stark's invention is out to save the world by destroying it,\nor something like that\u0085 And while it took over half the original movie\nfor the eclectic group to warm up to each other, now we begin with so\nmuch bantering camaraderie it's like hanging out with the popular kids\nafter prom\u0085 <br><br>And there are about five jokes per minute, as if Robert Downey Jr's\nquick-witted sarcasm was infected onto everyone else \u0096 even Ultron,\nTony's dominating Artificial Intelligence Robot, who's full of wry\nwisdom: His nefarious motivation to do very bad things but unlike Loki,\nwith an entire THOR film to catapult his dastardly menace, the titular\nheavy's purpose is completely forced and thoroughly confusing. Making\nthe few good action sequences\u0085 like Hulk and Iron Man squaring off\u0085\nimpressive eye candy that lacks any rhyme or reason.<br><br>With such an immense fan base, it's pretty dangerous to not like THE\nAVENGERS. They are perfectly cast, and proved themselves a\nbeyond-worthy franchise. The problem with AGE OF ULTRON is that the\nplot's as dull as the lame newcomers\u0085 including a mind-reading witch\ngirl giving everyone trippy hallucinations; a blond-haired Russian boy\nwho runs really fast; and a red-faced crusader as strong as Thor,\ndeleting the big guy's main asset. And with so much excruciating\ndowntime this time around, you would think the gang was saving up their\nenergy\u0085 but for what, exactly? With all the jesting, where's the\ndanger? The urgency?\n"},
{"review": "\nWhat's the old saying? \"Talent hits a target no one else can hit;\nGenius hits a target no one else can see.\" Well, Joss Whedon is\nofficially a genius and the talent of this cast was evident in every\nscene. They all hit it out of the park. Yes, I just love Avengers Age\nof Ultron. This movie works on so many levels and makes you draw on\nabsolutely all of your emotions. The last time I enjoyed a movie this\nmuch was the last time these characters assembled. Again, they managed\nto deliver a remarkable cool factor. What makes it extra special is\nfollowing this film after all the other solo efforts from each\ncharacter. I enjoyed the others films quite a bit but they all\ndelivered something different. Winter Soldier delivered conspiracy\nthrills. The Iron Man trilogy factored in Tony Stark's complete\ndramatic arc, character flaws and all. The Dark World was pure sci-fi\nfantasy. Seeing them blend together in Avengers and the sparks that\nresulted is an extra special treat. <br><br>It all works so well and is grounded enough to carry the story and the\naudience through an unbelievable ride. In fact, it doesn't just fit,\nit's an exciting symphony and that dichotomy and difference in\ncharacters and how they interact are what makes this movie truly great.\nIt's why Avengers stands so tall above any other franchise at the\nmoment. Things like Transformers, Fast/Furious, and even Star Wars or\nStar Trek all operate with monotone restrictions. Avengers covers all\nangles and even multiple genres all by itself. It delivers depth of\ncharacter with its fun and amazing action sequences. There's a reason\nwhy these movies make as much money as they do. They deliver a lot of\neverything and do so at a high quality.<br><br>Right from the beginning of the movie, where we get the all in one\ntracking shot, through the epic final globe smashing conclusion,\neverything is on go and everything delivers superb intensity and\nspectacle. This is going to be many many people's favorite film of\n2015.\n"},
{"review": "\nI can't understand the distaste people have for this. The Avengers were\ngrowing more comfortable with one another, a fact made clear in the\nscript. In the first film we saw them learning to be a team, in Ultron\nwe saw them acting as a team.<br><br>The script was fine, the acting was fine, in fact Spade stood out. Not\nonly that but it raised a few questions as to what was coming next. It\ndeveloped the characters better.<br><br>Some of it was a little over-the-top but you are watching a movie based\non comic books.<br><br>The little romance may have stood out as forced &amp; unnecessary, but,\nwell that's only a reason to take away 1 star, not 9.<br><br>You get to see new characters, you get to laugh &amp; you get to gobble up\npopcorn in &amp; suck down sodas in the typical action/sci-fi induced\nhypnosis.<br><br>I honestly can't see all why it has so many negative reviews.\n"},
{"review": "\nI was disappointed by the original Avengers. After hearing it lauded as\nthe most awesome movie ever, what I got was empty spectacle, a movie\nthat summed up everything I don't like about films that sacrifice\ncharacter development in favor of big battles you never really care\nabout.<br><br>Still, as empty spectacles go, The Avengers was pretty fun, so\neventually, about a year after it came out, I equipped my low\nexpectations and watched Ultron.<br><br>Ultron surprised me though, because it has what the last one lacked;\npersonality. This movie has far more interest in its characters and\nideas. It even has some angsty and rather touching romance.<br><br>Even better, the movie has a really great villain, beautifully voiced\nby James Spader to be both dangerously psychopathic and quite funny. <br><br>This movie has somewhat less action than the previous one, as it takes\ntime out to get to know its people, but that action is put in context\nthis time, so I actually care about what's going on. The final action\nscene is a bit overlong, but overall the action is great.<br><br>There are some issues with the special effects though, particularly in\nthe case of the Hulk. It's something I noticed in the first sequence,\nwhich looked, especially in long shots, rather fake; it looked like\nsomething from a video game. It's not terrible, but it's not always\nbelievable.<br><br>Overall though this was one of the better Marvel movies.\n"},
{"review": "\nI liked this sequel more than the original.as usual there is a ton of\nintense action sequences.it's also a very funny movie and once again\nthe acting is as good as or better than in the original.there are also\na few more marvel characters dropped into the mix.but the one thing\nthat makes this film superior to the first(in my opinion,anyway)is the\nvillain Ultron.this is one of the best villains to come along in the\nlast few years.he is certainly a worthy adversary to the Avengers.Havin\nJames Spader voice the character was a stroke of genius,in my mind.his\nvoice just fits the character so well.overall,an excellent film.so\nfar,Marvel is winning the superhero sweepstakes against DC,for two very\nimportant reasons.firstly,humour,second a relatively lighter tone.DC\nfilms tend to be dark and bleak.until DC figures this out,they will\ncontinue to lose ground to Marvel.this is just my opinion of\ncourse.anyway,for me Avengers: Age of Ultron is a 9/10\n"},
{"review": "\nThere are no strings on me! Aha, yes Avengers: Age of Ultron managed to\naccomplish many different things after It got released, including\nvarious Pinocchio parallels as well as divided opinions from Comic Book\nfans and also a brilliant use of James Spader's wonderfully cold and\nsarcastically toned voice. But I actually really liked It. Okay so they\nchanged Ultron's origins and force fed a love story between Bruce\nBanner and Black Widow, but other than that I thought It was pretty\ncool. We get to see the avengers individually fleshed out more, we get\nto see Quicksilver and Scarlet Witch thrown into the group as well as\nAndy Serkis without his motion capture suit for once and of course we\nat long last get to see James Spader play a brilliantly diabolical and\neven somewhat sickening villain as Ultron. And with all of that and\nbrilliantly created scenes like the Hulkbuster battle, Ultron's birth\nand Scarlet Witch's mind alterations, Avengers: Age of Ultron really\ncomes together as yet another enjoyable Marvel movie.\n"},
{"review": "\nThe whole Antagonist bent on world destruction/domination is becoming a\nvery tired story(Attn Hollywood). At no point in the whole movie was it\nbelievable that the Ultron alone challenged the power of the avengers.\nA comic book movie is only as good as its main antagonist relationship\nto the hero. When the antagonist can challenge a heroes moral code and\nforce them into difficult choices we see their true character revealed.\nUltron had potential to be action driven as well as an intellectually\ncompelling story, unfortunately due to poor writing and voice overs the\nlatter never came to fruition. I am personally more interested in\nseeing a story about morality, which the dark knight does so well.\nUnfortunately original story telling has taken a back seat to corporate\ngreed in the entertainment industry. Now all we are left with is\nrecycled material, lots of explosion and a watered down villain which\nis supposed to appeal to mass audience's? Some people are perfectly\nhappy with that structure. I implore fans to demand more...\n"},
{"review": "\nI originally gave this movie 9/10, thinking it wasn't perfect, but it\nwas pretty f@#$ing close! I watched it again last night for the third\ntime... and realized I was a petty a$$hole denying it a perfect score\nwhen it is really the biggest and most ambitious epic ensemble movie in\nhuman history.<br><br>It is the combination of over 10 movies of mythology, the casts of\nThor, Cap and Iron Man movies and the best portrayal of the Hulk on any\nscreen big or small, animated or skin painted.<br><br>Spader gives such a smart, yet sinister performance, I almost want to\nsee an Ultron movie every few years, like the comic character that\nkeeps returning and evolving constantly.<br><br>New Avengers- Scarlett Witch, Quicksilver and Vision are scene\nstealers, and cameos from Falcon (Anthony Mackie from 'Winter\nSoldier')and War Machine ('Iron Man' series) add another level to the\nextended universe. <br><br>The relationships and characters of all are deepened and enhanced by\nthis continuing story, giving them a richness that you can't have with\na single blockbuster like 'Dawn of Justice' tried to do.<br><br>Avengers has done what has failed in almost all superhero movies-\ncreated a REAL UNIVERSE, something Spider-Man, Fantastic Four and DC\nMovies have never achieved(though Sin City, Hellboy, Blade, X-Men and\nDC TV know how to do it). <br><br>The Marvel Cinematic universe seems like a place where anything, will\nand can happen. Absolute gold movie, I love it and appreciate more with\nevery viewing. I can't wait for each and EVERY Avengers/Marvel movie as\nit comes out!\n"},
{"review": "\nThe first and second times I watched this film I loved it and I thought\nit was better than the first one. But the third time I watched it for\nsome reason it disappointed me, like that it was nowhere near as good\nas the original first one. But I watched it again a few days ago (it\nhad been about 3 or 4 months since I had seen it) and I absolutely\nloved it. Idk why I was disappointed when I watched it a third time\n(maybe I had a bad day, lol. I don't remember). I love this movie! Is\nit as good as the first one? No. Is it close to the original? Yes! I\nthink this movie is a ton of fun. While the plot is nothing special,\nthe movie is just plain entertaining! The characters are what makes\nthese movies so good! My favorite characters are: Captain America,\nThor, and Hawkeye. I loved the new characters, especially Vision.\nScarlet Witch and Quicksilver were alright, but Scarlet Witch was much\nbetter in Civil War, and I guess we'll never see if Quicksilver\nimproved since he died sadly. Now, I have no clue why people were\ndisappointed by the villain Ultron! He is the best MCU villain besides\nLoki in my opinion. All the actors are great in the film. Robert Downey\nJr. as Iron Man/Tony Stark, Chris Evans as Captain America/Steve\nRodgers, Chris Hemsworth as Thor, Scarlet Johansson as Black\nWidow/Natasha Romanoff, Jeremy Renner as Hawkeye/Clint Barton, Mark\nRuffalo as Hulk/Bruce Banner, etc. All the actors are fantastic. This\nmovie is just such a thrill ride, that I don't see how anybody could\ndislike/hate this movie!<br><br>Overall, I absolutely love this movie. This is one of the best MCU\nfilms. It is great! I'd give it a 10/10!\n"},
{"review": "\nI am not a comic fan and neither have the Idea what heroes there are.\nFirst,the movie before is much better than this one! There are not\nthese funny moments when the bad guy says something mad and suddenly\nHulk knocks him ultra fast and unexpected....I mean when I was watching\na movie I almost knew what would happen certain scenes and with that\nthe Film lose on the quality cuz If I'm sure what's gonna happen in a\nmovie..then I have to say this movie don't deserve the name\n\"Blockbuster\" or anything like this. Oh...and again as we all know,Hulk\nis the Greatest hero,strongrst and bulletproof so in theory he can beat\nANYBODY!<br><br>all in all another great action movie.\n"},
{"review": "\nGreat special-effects but not an ounce of originality in the whole\nthing. We have come a long way from the shoddy special effects in the\nDC Comic Universe movies of years gone by. As usual, Iron Man and Tony\nStarks' robots and gadgets are just amazing. \"Natasha\" (The Black\nWidow?) continues to be very charismatic. She must have a bit of\nRussian \"Black Cat\" serum in her because she appears indestructible and\nhas the perfect gymnast abilities of a Spiderwoman. Everybody else is\nperfectly predictable, especially Thor and the Hulk. I wish I had a\ndollar for every superhero action movie where the heroes or villains\nare aliens or mad (or nice) computers. In all the Universe(s) what\nmakes Earth so special that every thing wants to conquer, destroy, or\neat the entire planet? I guess I am getting too old for this type of\nmovie? I have seen too much and I haven't been a teenager in decades.\n"},
{"review": "\nWhen people rant about how bad Batman V Superman is, my rebuttal is\nasking them what made The Age of Ultron good in comparison to BvS and\nthe room goes silent. This movie is painfully mediocre, it will not\nbore you to death, but it definitely isn't good or even near decent, it\nis just an average movie. The plot is nonsensical,the villain again\ncomes off generic and the comedy bits are painfully corny. I mean\nCaptain America says \"language\" after a team mate says a curse word;\nreally?! Another thing that just pisses me off is the forced romance\nbetween black widow and the Hulk. What happened to Betty?! How is it\nthat any woman now can calm down the Hulk because that instantly\ndestroys the uniqueness of Betty's relationship with Banner.\nSeriously,WTF! This is what you guys defend as good comic-book movie?!\nI want to leave this goddamn planet!\n"},
{"review": "\n\"Ultron\" comes and delivers most of what the trailers promised: a\ndarker, more complex vision of what the superheroes must confront in\norder to keep this planet going. Maybe it was too ambitious to begin\nwith because after all, we have technology, mythology, and a dash of\nromance in there. If you care to make it more complicated, we can a bit\nof disfunctionality and the issue of artificial intelligence overriding\nthe intent of its creators.<br><br>\"Ultron\" is more of what we got the last time out, but it might be a\nlittle more than we should have. There are big explosions, close calls,\nsacrifices, and the development of some very interesting relationships\nbetween humans, Gods, and machines. The fluidity of how can transform\ninto another is one of the film's highlights, and rarely we get to see\nthe flaws in these beings, and we see plenty here.<br><br>Of course, we see monumental displays of technological destruction, and\nUltron is one of the best villains we have seen in a while, beautifully\nrendered by the latest wonders of CGI and perfectly brought to life by\nJames Spader who can make wonders happen with in the unlikeliest of\ncharacters. He makes us admire and hate Ultron. He's after fighting for\nwhat humans want: a perfect life, and if this requires the destruction\nof those flawed humans, well, let it be.<br><br>I have seen a few negative comments here, and that might be because\nonce again, we have been given food for thought, and that's a bit of\ntask for those who just want to see mindless fun (another 2015\nblockbuster) come to mind. There's plenty of admiration for Science\nFiction/Fantasy that explores issues and situations which have a\nfoothold in reality. I keep thinking about those communicators in \"Star\nTrek\", the allusions to soul, life, and artificial intelligence\nexplored in \"TNG\". <br><br>Go and have a little fun, and dare to ponder along the way.\n"},
{"review": "\nBest movie I've ever seen. The main antagonist is my favorite villain\nso far in the MCU, and Ultron was made even better by the fact he was\nvoiced by James Spader, an actor who didn't even change his voice for\nthe role. This was a movie that kept you guessing, and not even I could\nprepare for the climax. No wonder this series keeps moving in the place\nof where others have failed. Iron Man remains the best Avenger, and\nVision, Quicksilver, and Scarlet Witch are very welcome additions to\nthe cast of characters. This is a must-see for those wanting a good\nmovie (or one that leaves you on the edge of your seat), and one for\nthose who love comic books.\n"},
{"review": "\nIn the first act of the movie when Ultron is created and they say he is\nin the internet. Because in this age if a robots has its own mind like\nhumans. Then Ultron can pretty much destroy the whole world because\nhumans are so in electrons and Ultron can do anything with his power to\nchange the internet. I would like that the movie has Ultron taking over\nthe world and mostly destroyed and humanity his on it own for a few\nyears before one of the avengers goes into the past and stop Stark from\nusing Loki's scepter. That would make an interesting movie that the\npoint of the movie is Stark using the scepter. However there would not\nbe any Vision so that would be hard to create him without the research.\nAnyways this movie has good action scenes, characters are good, and\nlots of character development with Hawkeye and the Black Widow. There\nare bits of the movie that made me laugh. However it lack the story\nlogic and pacing like the first avengers is. After watching this film I\nhighly watch \"how it should have ended videos\" of this film because\nit's worth it.\n"},
{"review": "\nAs expected this is an action packed spectacle. Entertaining all the\nway, this installment of the Marvel Universe doesn't disappoint. I like\nhow the series lets the storyline jump between the Avenger series and\nthe characters own Movies. It makes the story bigger than what would be\npossible to create with a single movie.<br><br>However, maybe they have added to many characters this time. It is a\ndifficult task to balance the screen time of that many main characters\nwithout compromising the story. And this time the movie struggles with\nit. A few of the Avengers, like Thor, is absent long stretches (not\nspeaking of the more and more strained explanations for Jane not being\nwith him - if this was the real world I would be very worried for their\nrelationship) and the chemistry between the characters is not as good\nas in previous installments (that is a part of the story though, but\nstill unfortunate). The dialog, ripe with tongue in cheek jokes,\ndoesn't flow as well as it has. And, surprisingly, I wasn't as\nimpressed with the CGI as I have been. Some scenes, especially the\nintro, looked more like a computer game than a movie.<br><br>Still. It is a entertaining movie. A good pace without being too one\ndimensional acting. A good cast, with a stellar choice of James Spader\nas the villain. His voice gives Ultron an unexpected dimension. Small\njokes and a quick dialog. It is hard no to like.<br><br>7/10\n"},
{"review": "\nI read a couple of negative reviews of this film. It's not bad, it's\nnot bad at all. I'm not even a fan of comic books and comic book heroes\nbut these \"Avenger\" films, I think, are good. Although this film is a\nlittle flawed in it's over the toppness it's still a good film. There's\nplenty of action without a lot of in between dry dialog. We can think\nTony Sparks (Robert Downey Jr.) and Ultron (James Spader) for that.\nTheir witty remarks and jokes did add some good humor to this film. If\nyou liked \"The Avengers\" you'll like this one as well. You won't be\ndisappointed. Hopefully they're planning on making a third installment\nof this film. With the same director and writers going in the same\ndirection as this one it will be a good one as well.\n"},
{"review": "\nWell\u0085 The Ratings: 7.8/10 from 285,083 users and the fact that I have\nbeen missing a good action flick for some time, surely make me excited\nout of my socks~! I hope it will be decent, because you know how it is\nwith those ratings nowadays\u0085 Fear not~! Dr tgchan is here to examine\nthis baby thoroughly~!<br><br>2 minutes \u0096 starts with high explosive action, right off the bat\u0085 and\nunfortunately looks like a cartoon <br><br>19 minutes \u0096 it's surprisingly interesting, nice and pleasant to watch <br><br>42 minutes \u0096 the dialogues are very well written, acting is good and\nthe film doesn't bore you at all<br><br>57 minutes \u0096 it's funny when needed, the action is great and CGI\neffects are really good. I am pleasantly surprised <br><br>1h 22minutes \u0096 I don't know what they have changed later on (after the\nopening scene), but it definitely doesn't look like a cartoon; top\nnotch special effects <br><br>1h 48minutes \u0096 camera angles are amazing, one-liners makes you smile,\naction looks very very good to say the least, and you really have no\nreason not to like the film. Saving the world\u0085 again. This would be my\nonly complain, bu hey\u0085 it is a super hero movie, so what did you\nexpect?<br><br>It was really a decent film, I knew what to expect and I wasn't\ndisappointed with it. Make sure you watch a short scene after the end\ncredits.<br><br>tgchan's rating: 7.5 /10\n"},
{"review": "\nTo be honest I walked into this film with my expectation being that i'm\ngoing to get a modern marvel movie... which is what I got. The\ncharacters were a bit more developed in this, but that only applies for\na select few of them. The action scenes were well-done for a modern\nmarvel film. That's really all I have to say. I don't want to go too in\ndepth so i can keep this in the non-spoiler territory. Overall nothing\ngroundbreaking but definitely see it if you liked the first Avengers.\nIn the long run though, all this film really does is set up the next\navengers and \"Marvel Cinematic Universe\" movies. <br><br>I give this film 3 stars out of 5 or a 6/10 whichever rating system you\nprefer.\n"},
{"review": "\nWasn't really impressed by this age of ultron sequel. first of all, the\nscript doesn't really follow what the marvel universe has put down,\nHank Pym created ultron not Tony stark. So if you're a marvel comics\nlover, you're going to be a tad disappointed. the CGI was okay and the\nfight scenes were a little bit under part, didn't really see hulk smash\nenough compared to the first avengers film. to be honest? this sequel\nhad a little bit more drama with black widow catching feelings and\nstuff. the new characters scarlet witch and quicksilver were grossly\nunderplayed, and at least we should have been given a hint about their\norigin(well everyone that reads the comics already knows, so I'll let\nthat slip). and one more thing, vision was awful. definitely definitely\nneeds a character revamp.\n"},
{"review": "\nA strong 7, although it was a bit too esoteric erring on the\nChristopher Nolan Batman side.<br><br>Some very good and strong action vs. the first. A lot less hand-held\ncamera. I could actually see what was going on. The opening was very\nfluid although the actual characters looked very much animated. Like a\nvideo game. I was consistently engaged with the action.<br><br>A big film, too which was, at times, juxtaposed with being very small\n(the finale in the small building and the bridge). Even the farmhouse\nfelt cinematic. The other locations not so much.<br><br>But the story was familiar. Bad guy wants to end the world. They were\nstretching Ultron's lapsed logic from birth but it still worked. Jarvis\nto Vision was fine. Hulk and Black Widow romance seemed by-the-numbers\nand familiar. <br><br>I know I'm going to be a broken record but Spader stood out. OK acting\nfrom everyone else, even Johansson (which is a big improvement for\nher). <br><br>The big problem I had was The Avengers put an end to Hydra's work at\nthe castle. But then they left it completely unguarded. Sure, there was\nno movie without some place for Ultron to escape to and build his army.\nBut it was impossible to ignore. <br><br>Also, it sure seemed that Ultron's army was very poorly constructed. <br><br>All in all entertaining due to very high production values. But nothing\nthat captured the imagination. Winter Soldier was a better film.<br><br>(But really? Hawkeye? Why? He never runs out of arrows and, well, his\nweapon is arrows. Arrows?)\n"},
{"review": "\nAvengers: Age of Ultron was a great sequel and a great addition to the\nMarvel movies. There seemed to be a good balance between action scenes\nand getting to know the characters on a more personal level. I thought\nit was interesting to see Black Widow and Bruce Banner \"toe the line,\"\nif you would, on a personal relationship and professional one. I also\nlike the way she was able to calm The Hulk down when his services were\nno longer needed. I don't want to sound sappy, but I'd like to see if\ntheir relationship goes further in the next movie, assuming that The\nHulk is just MIA at the movie's end, nothing more. It's too bad that\nthe X-men and Fantastic Four movies are produced by 20th Century Fox,\nand Spiderman is through Columbia. It'd be great to see all three\nseries cross over. Maybe since Disney owns all the Marvel characters\nwe'll see one.\n"},
{"review": "\nTony Stark wants to invent something that benefits mankind but instead\nturns out to be the one responsible for the creation of this dangerous\nself thinking robot, Ultron. The Avengers must assemble once again to\nfight this menace that wants to kill all the humans on this planet. But\nUltron is powerful and the way he is presented makes you wonder how our\nheroes can defeat him. Just you wait and see...<br><br>What I liked best about Age of Ultron was the fact that all our\nfavorite heroes get equal screen time to show of what they can do.\nAlthough the action scenes are great (Iron Man in the Hulkbuster versus\nHulk!) the thing that really makes this movie work is the interaction\nbetween all the people involved. Stark and Banner, Banner and Black\nWidow, Hawkeye and Black Widow, Thor and Captain America... like in\nreal life you can see with whom each of them get along best. It's also\nnice to see that Hawkeye gets a lot of screen time. He even gets the\nmost interesting background story of the bunch. Quicksilver and Scarlet\nWitch make a great addition to the team (sort of) and there are a lot\nmore cameos in the movie (although I don't think anybody spotted Lou\nFerrigno!).<br><br>The movie runs about two and a half hours and that's pretty long. It\ncould have been a little bit shorter, but overall I didn't mind. With\ngreat action scenes (pay attention to the opening action sequence in\nwhich he introduces the Avengers in one mighty shot!), nice humor, a\nlot of cameos and a satisfying finale writer/director Joss Whedon has\neverything under control and that pays of.<br><br>This year (2015) The Avengers Age of Ultron will shatter all box office\nrecords and that will be a fitting reward for giving most Marvel fans\nand 'normal' moviegoers this big treat. Even Pixar slipped (with Cars 2\nand Brave) so everybody's waiting for Marvel to produce a real stinker.\nAlthough that day may come, The Avengers part 2 is not the movie that\nwill be responsible for that!<br><br>8,5 / 10\n"},
{"review": "\none of the best movies I have seen in along time,great ending great\nposture and great cheese acting when it came down to action and\nfighting. when the Hulk and Iron man fights one another. to captain\nAmerica telling iron man to what his mouth by saying \"laungue\" and then\ngetting teased for it through out the movie. I can't wait for the next\none to come out. I even gone and seen it 3 or 4 times already and just\ncan't stop laughing, how ever Ultorn seems like he looks familiar form\nanother movie. I can't exactly put my fingers on it. however in the\ncomics Spider-man was in the cast as well I am surprised he wasn't in\nthis film. I Suppose Spider-man will be in the next one. if not that is\nfine, either way, the Marvel movies are still one of my favorite movies\nthat is made these days.\n"},
{"review": "\nSingularity experts may like this movie. The computer program which\npowers the Iron Man suits becomes the centerpiece in a struggle between\ngood and evil. Wills are tested and heros even a heroine are born.\nScenes throughout this fantasy action movie reveal the consequences of\nmankind's decadence. A Slavic proletariat serves as the terrorists'\nbase which the Avengers must save. Tension and distrust amongst\nfactions of the Avengers grows to the point of Bruce Banner and Tony\nStark's coupe d'etat. Uncertainty in purpose troubles Thor and romantic\nissues pang Bruce Branner. The good guys win this one yet the costs are\ntaking a toll on team dynamics. Fate hinges on conflict resolution and\nteam work in the next battle.\n"},
{"review": "\nMy dad, my sister and I really enjoy comic books and movie\ninterpretations of the comic books.<br><br>This movie was a must see considering we saw the 1st one like 4 times.\nI always try to keep an open mind whenever I walk into a movie theatre\nand this time was no different.<br><br>Throughout the movie there was enough humor to balance out the action\nand vice versa. Through the movie you were either laughing or cheering\non the Avengers, sometimes you were freaked out by the \"no strings on\nme remake.\"<br><br>By the end of the movie everyone was clapping or cheering.\n"},
{"review": "\nI'm writing a review about Avengers: Age of Ultron because it is one of\nthe best superhero movies I've watched. Let started with how the movie\nwas started.After the movie started, this was a fight scene already to\nget everyone pumped up for this movie. The fight scene was well made\nand all the character were introduced.I also love the plot twist in\nthis movie because you'll never know want going to happen next.The\nstory is getting more interesting from one second to another.<br><br>Now, let move on to how I thought about this movie. My favorite\ncharacter is Hulk because has incredible power and strength and able to\nsolve any problem by smashing everything.Hulk feels like one of my\nfriends because when he goes mad, he smash everything.My favorite scene\nin the movie is when Hulk buster fights with Hulk.When I saw it in the\ntrailer, I know it's going to be great and when I watched in the movie,\nit's even better.There is also a story about Hawkeye since he didn't\nhave a movie. This movie makes me feel intense because you'll never\nknow when there a fight scene and someone could have die at any moment.\nThere are a few parts that I don't like about this movie.First off,\nthere are too many jokes. They also tell jokes in the middle in the\nfight scene which make it less interesting. Second, Ultron appears out\nof nowhere and he goes destroy everything. Also, how can he have a\nfacial expression since he an AI.Everything else except these two is\ngreat.<br><br>Finally, I think this is a well make movie and I would recommended to\nall of the superhero fans out there.If you like explosion,epic fight\nscene superhero, robot, you are going to love it. I rate this 8/10.\n"},
{"review": "\nDid somebody hide a Zucchini in the Vibranium and this was how Ultron's\nAI is born? What was up with that dreadful plot, well at least it has\nmanaged to build into a trilogy? Although the only really funny part\nwas Checkov dying, he didn't see the chaingun firing, you must be\njoking? Mass produce Ironman 3 bots, now Hulk smash them over and over\nand over and over again, presto the result of the film. Thankfully\nPepper Pots didn't join in. All because these Ultron bots had the most\nannoying Atom (Watchmen) accents ever. The dialogue was boring, the\nplot was totally screwed, the action was utterly repetitive.<br><br>Yawn! Apart from some of the better action sequences, there was nothing\nthere, no nothing at all. The actors mostly looked like they went\nthrough some motions mostly of something else somersault to go out and\nget paid. They just didn't jive.<br><br>The first film was epic, this second film is such a lame comparison.\n"},
{"review": "\nThe main complaint about this film in all of it's negative reviews is\nthat it isn't \"dark enough\". I was actually pleasantly surprised to\nfind out that this movie blended humor and fun with the darker elements\nbecause I was turned off by the teaser trailer. I don't want the new\nMarvel superhero movies to try to be edgier than everyone else. I\nthought the darker and lighter elements blended well in the movie. With\nthe exclusion of Quicksilver I liked the new additions. I didn't\ndislike Quicksilver though, but I did prefer the X-Men version over\nthis one. I thought Ultron was a pretty great villain. He was not as\ngood as Loki or the Ultron marketed in the trailers, but he was still a\ngood enough villain. The movie did seem a bit rushed and Thor's side\nquest was kind of dumb, but over all I was satisfied with this movie.\n"},
{"review": "\nEarth's Mightiest heroes reunite once again to save the world from\nUltron (voiced by James Spader), a self conscious A.I. hell bent on\neradicating humanity.<br><br>Scarlet Witch (Elizabeth Olsen), Quicksilver (Aaron Taylor-Johnson) and\nVision (Paul Bettany) have been added to the already existing superhero\nroster, adding some much needed firepower to take down Ultron.<br><br>The action sequences are quite spectacular, especially the one with an\nout of control Hulk and Iron Man (with his Hulkbuster suit), enough to\nleave the fan boys thrilled. The ending of course is literally out of\nthis world as the Avengers have to contend with a falling Sokovia\nplummeting Earth as well as Ultron and his countless robot minions.<br><br>Hawkeye gets some character development introducing the audience to his\nfamily living in a remote cabin in the woods (get it). Banner and Black\nwidow have a few scenes opening up to each other filling, some\nemotional depth of the movie.<br><br>The movie however does have a few plot holes that were left\nunexplained. At the end of Iron Man3 Tony Stark decides to quit being\nIron Man, yet here he is in all his glory. A few jokes could have also\nbeen left out as it desensitized any tension or suspense.<br><br>Joss Whedon does an admirable job in making a consistent summer\nblockbuster. Cool CGI, fun one-liners, good performances and average\nplot is become somewhat of a template that most Hollywood movies seem\nto follow. I feel that Marvel should have tried to do something\ndifferent as I was left wanting something a bit more. Age of Ultron is\nstill an enjoyable film and will definitely entertain those who are\njust in for a good time.\n"},
{"review": "\nThe Avengers was a fun popcorn film helped that it had fiendishly fun\nvillain in Loki.<br><br>Age of Ultron begins in the middle of an action sequence with all the\nAvengers assembled and its the first of several prolonged action scenes\nin the film. It reminded me of Man of Steel, a lot of wanton\ndestruction in one film which just becomes dull after a while.<br><br>The plot, Tony Stark uses Loki's sceptre to kick-start an artificial\nintelligence peacekeeping programme that he has tried to develop for\nsome time. Even though Bruce Banner warns him several times not to mess\naround with the power of the sceptre, each time Banner then helps\nStark.The end result is the formation of Ultron who decides that it is\nthe human race that needs to be destroyed and kick-start a new earth\nthat would be peaceful.<br><br>So in between the wisecracks including an ill judged Latin gag its Iron\nMan's recklessness that causes the chaos. Captain America is still an\novergrown boy scout, there is a bolt out of the blue growing love\naffair between the Black Widow and Bruce Banner which comes across as\nunconvincing as the scenes where they tried to hide Scarlett\nJohansson's bump as she was pregnant in real life at the time of the\nshooting, hence why she is the bar woman for the night in that party\nscene. Its Hawkeye who is more fleshed out in this film and delivers a\nmore human dimension to the plot.<br><br>Of course along with the main plot we have a whole host of subplots\nthrown into the mix including more superheroes and villains amongst the\nmix. So we have the Falcon dropping by, Quicksilver and the Scarlet\nWitch and the formation of the new Avengers by the end of it.<br><br>The film tries to do too much and looks like a film made by committee\nand lacks the personal vision which elevated Captain America: The\nWinter Soldier last year.\n"},
{"review": "\nin a vacuum, this is a pretty good action movie, but being a sequel to\n\"the avengers\" means it will always invite comparisons to the original\nand be judged at a higher standard. Unfortunately, \"age of ultron\"\ndoesn't live up to it's predecessor. The action and humor is still\nthere. Joss Whedon excels at crafting these fluid elaborate action\nscenes where the camera pans between multiple characters kicking ass in\ntheir own way and then occasional teaming up to take down some bad\nguys. It's pretty impressive to see considering the size of the\nAvengers roster and the extreme differences in each superhero's powers.\nHumor-wise, we have typical Whedon jokes, but I'd argue that there's a\nbit too many going around in the midst of all the fighting this time.\nSome jokes felt forced, with characters spewing one-liners every time\nthey got any screen time during an action scene.<br><br>Plot-wise, the writing is less focused than the first one. There's a\nscene where Thor goes into a cave somewhere, submerges himself in\nwater, and starts having dream-like visions of the future, and this\ndoesn't make much sense or seem necessary. Quicksilver and Scarlet\nWitch are woefully underdeveloped, with a boring backstory and bad\nclichéd Eastern European accents. With all the details packed into this\nfilm, it seems like Marvel's trying too hard to connect the dots\nbetween all their properties and set things up for the future, and this\ncomes at the expense of the movie as a whole.<br><br>One of the bright spots is James Spader's portrayal of Ultron. Instead\nof being this stereotypical cold, calculated, terminator-like villain,\nhis personality is that of a spoiled, petulant, mischievous child, and\nit works pretty well.\n"},
{"review": "\nI feel people are being unnecessarily harsh with this movie. While it's\nnot perfect, it still has everything a summer blockbuster movies should\nhave, sadly with a little extra baggage.<br><br>The story and setup is simple enough to follow along and has some ideas\nand themes that are fun to think about. It's nothing really deep, but\nit adds some meat whereas another blockbuster franchise, Transformers,\nhas nothing like it. Every action sequence was fun, and they all felt\nas though they belonged and didn't feel too random or out of place. <br><br>Most of the characters are still just as great, and Hawkeye was\ndeveloped even more since he got the short end in the first movie. The\nonly major stumbling blocks are the romance between the Hulk and Black\nWidow, and Thor's side-quest. The former felt unearned and it was\nconfusing since she had more chemistry with other characters. The\nlatter felt like padding. Ultron was actually snide and funny, which is\ndifferent than the solely-menacing villain in the trailers. That's not\na bad thing but it was unexpected and he still was quite menacing. <br><br>The humor was mostly spot on, and I think that helps because with a\ncharacter that looks like the Vision, this film should not take itself\ntoo seriously. There are two running gags that start at the beginning\nand get funnier as the film goes on, both ending with a good pay-off. <br><br>This isn't as good as the first, but it's still well-worth watching.\nThis is what audiences really want when they're only looking for a\nsimple story, engaging characters, fun action and spectacle. It's pure\nescapism and entertainment.<br><br>**SPOILERS** **SPOILERS** **SPOILERS**<br><br>Another thing that really bugged me was there was a character who was\nmostly introduced in this film, and he dies at the end. Sure he's given\nopportunities to be heroic, but his brief appearance hindered the\nimpact. It feels like a waste. <br><br>**END SPOILERS**\n"},
{"review": "\nI liked Age of Ultron overall after I thought about it for a while.\nComing out of the theater, it felt like a disappointment, and I think\nthat's because people hoped it would be better than the first. It's\nnot, but it has some great sequences. I liked the new characters a lot.\nI'm very interested in what Scarlet Witch and The Vision can do in the\nnext movie. I liked the character they created for Ultron, but he never\nreally did anything interesting or memorable. Some aspects of the movie\nthat should have been more clear were things that you had to put\ntogether for yourself, which shouldn't be a bad thing, but in this kind\nof movie, it is. Ultron's motivation, for example, is the main aspect\ndriving the plot, and you really have to work it out of the subtext.\nFor a superhero movie aimed at a wide audience, I don't think that was\neffective. Loki's true purpose only gets a passing mention in the first\nAvengers, but it was also backed up by the first Thor movie. Everything\nin that movie seemed to work; Ultron had me thinking, \"Well, I guess I\ncan see that, if you look at it that way...\" So while it was miles\nabove the average action adventure film, high expectations clouded my\njudgment.\n"},
{"review": "\nThe Avengers films are always interesting, the first one being the\nepitome of the Superhero genre. It was and still is perfect, and\ninteresting to compare the Marvel films entirely (not matter which\nstudio) to the darker DC Universe of Batman (Nolan) and the Superman\nreboots. Probably only Superman 1 and 2 compare to the Marvel films for\nmind bending fun. <br><br>The various Marvel sub-genres, Thor, Ironman, Captain America, are all\nexpertly produced and mounted entertainment, solid and well crafted. <br><br>But Ultron is, well, different. Watched it last night and after the 1st\nviewing in Imax 3D - essential - I was struck by the length of the film\nand the mindless fighting scenes. The lovely Safe House sequence dead\ncenter is a rest from the chaos surrounding the fights with Ultron and\njust about everybody else. <br><br>Film editing is an art, not a science, but I could have cut perhaps 20\nminutes out easily by trimming down the endless battle sequences. After\na while, SOMEBODY has to get hurt and the Avengers get hurt soooooo\nrarely. Natasha is human through and through - never a scratch. Tony\nStark out of armor is just a human too. Never really hurt. And yet the\nchaos begs incredulity. Cutting it back would make it more believable.<br><br>And yes, it is still a boatload of fun.\n"},
{"review": "\nAge of Ultron is probably the most freshest movies we have seen in a\nwhile. Its awesome special effects, plot, and superheroes make this one\ntruly worth the money. I was also impressed with how they added a wider\nvariety of heroes to the roster. Ultron himself also was impressive,\nwith his own fair share of humor in the mix.<br><br>That was probably why I liked the movie. It just didn't feel good about\nhow quick the introduction all went and how the whole Ultron thing\nwent. I didn't understand Ultron to be honest, I knew he was this evil\nrobot, but I didn't get the whole origin of his AI type of thing came\ninto place. Its a quicksilver shift to phase 3 and the humor and action\ndoesn't mask any of it. I firmly believe that if this continues to\nhappen in the movies, them I'm going to have to give them a 6 or 7 from\nnow on.\n"},
{"review": "\nI can't love Age of Ultron like I loved the first film. Some of the\nappeal of seeing our heroes together for the first time has left. The\njump cut action is a bit unsatisfactory this time around. The narrative\nhas lost its streamlined perfection and yet feels incomplete. This film\nis filled with misfires in characterization, tone, action, and\nstorytelling. And yet while a flawed film, it is worth a ticket price.\nAge of Ultron still has plenty to offer. It gives us several new\ncharacters like Ultron and Scarlet Witch that add new life to the\ncinematic universe, and Josh Whedon continues to avoid overwhelming the\naudience with his massive assemble. In the end, this is a fun, big\naction film with plenty of likable characters and moments. However, it\nalso suffers heavily from unevenness of the execution. As such the\nsequel failed to outdo the much slicker original film.\n"},
{"review": "\nI saw this Thursday night before May 1st in a jam packed IMAX theater\nwith some of my friends and it was honestly one of the best movie\ntheater going experiences I've ever had! That being said, the film\nitself has essentially the same overall plot as the first film but what\nwe got was pretty cool. The action was very, very well done and the\ncinematography is up there with The Dark Knight films and Man of Steel\n(those having the best film work out of the superhero films, imo). The\nscript was amazing and the dialogue was perfect, encompassing who these\ncharacters are at heart.<br><br>Where this film faults is its very thin narrative and pacing. The\nnearly two and a half hour film flies by without notice and there is\nliterally never a boring moment BUT there are many subplots that aren't\nfully developed (which will more than likely be solved in the bluray\nextended release).<br><br>Overall, while extremely enjoyable, the film suffers from the same\nexact problems the first film had. You know exactly how it will end and\nthe narrative really just isn't that interesting.<br><br>That opening tracking shot though...the ticket is worth the price just\nfor that scene alone! 7.5/10\n"},
{"review": "\nthat any film Adject Almmthelen famous will be very beautiful and\neveryone adore<br><br>The source of power is the choice of any film stars that people love\nher<br><br>As in the fact that people these days love action films And increase\nthe proportion of follow-up every day Unfortunately, all this effort in\nvain Because, as is well known electronic sites to download movies and\ndisplayed directly or downloaded The idea of the film is the idea of an\neasy-to-collect all the legendary figures that the world loved and\ncollected in one film I normalize lovers of this film with the\nknowledge that I go to the movies every other day to see the new film\n(Thank you to all for read my article) Hehehehe I apologize Iraqi\npeople. We all know what is going through the country from wars And\nkill and destroy and even sometimes I feel we are in a cinema only\nproduces action films\n"},
{"review": "\nIt is never easy to save the world. It takes a great cast in familiar\nroles. Each super hero is given enough time to do his thing. <br><br>The most interesting character belongs to Mark Ruffalo who reminds us\nit's not easy to be green. With all the chaos and destruction there are\ntimes when Scarlett Johansson and Ruffalo are in their own can I bring\nhim home to meet my parents love story. It is not clear what\nJohansson's super power is except motor cycle.driving with the help of\na stunt person, and seduction where she needs no help.<br><br>The movie deliveries just what you are expecting from the franchise.\nThe only thing missing was Pepper Potts. The are an abundance of fights\nbetween good and evil even if some times you aren't sure which is\nwhich.<br><br>It's a big movie and the budget is on the screen. See it in a theater.\nThe bigger the screen and the louder the sound the better. The success\nof this movie means the crew will be back to fight more evil and save\nthe world again soon.\n"},
{"review": "\nIts obvious to compare between the first installment and the second. I\nfound this movie visually confusing while the plot was plain and boring\nwithout much twist which you expect when Loki is there. The villain\nhere is the AI Ultron whose algorithm is set at destroying the earth\nfor instilling peace. That is confusing in itself. We have seen such\nmovies where a robot or AI has gone bad a zillion times. The problem is\nthe predictability of the story. <br><br>While it was nice to have a complicated little love story between The\nHulk and Black Widow and an unexpected discovery of family of one of\nthe Avengers. It seemed as if this movie was just a bridge between the\nupcoming movies. The fight sequences reminded me of I, Robot. So many\nthings could have been possible with such powerful AI getting into the\nworld wide web... He could have played God, he could have commanded the\nearth population. Instead he wants to delete earth from the face of the\nsolar system. <br><br>The Avengers seemed like a bunch of high school students...party\nfreaks, unsure, broken hearted and angry. There were too many things\npacked in each shot and it was difficult to focus on the characters..\nlike when two characters are talking there are 2-3 non participating\nlead actors strolling around or conversing amongst themselves or\nsomething non important is happening in the background. The background\nscore is also changed. The new one is unimpressive. They should have\nstuck with the original score to maintain continuity. <br><br>All in all its a one time watch\n"},
{"review": "\nWhat's good: (1) the pace - the movie moves at a fast pace, but not too\nfast; (2) the characters -there are so many characters that most fans\nwill likely see (at least a cameo of) their favorite Avengers (3) the\ncasting is good; (4) their is diversity in casting; (5) this movie\nintroduces many of the characters who will be Avengers in future films.<br><br>What is not so good: (A) The tone: it is too comedic -too much comedy;\nthe overall comedic tone is not appropriate when our superheroes have\nto do serious things i.e. save the planet; it's OK to have jokes, even\na lot of jokes, but the whole movie should not be a joke when our\nheroes have to put their lives on the line; (B) The story: the story\ndid not make sense entirely; it was a little difficult to follow at\ntimes; there was an over- reliance on the MacGuffin theatrical device\n(our heroes go searching for something with little or no explanation as\nto why the object being sought is important ); someone needed to go\nover the script carefully and just make sure that it would make sense\nto the audience; (C) Serious deviations from source material -i.e. in\nthe comic books the Scarlet Witch has no telepathic ability, no mind\ncontrol powers, but in this movie she does have these powers; (D)\nUnnecessary death:- one of the important characters dies. In the comic\nbooks which, have been in existence for 60 years this character is\nstill alive (or he lives for several decades after the \"Age of\nUltron\"). The death seems almost pointless. Due to the comedic tone of\nthe movie, it is almost impossible to feel the emotional impact of this\ndeath. What a waste of a good character.<br><br>And like I said, the tone of the movie is such that no one will feel\nsad, or shed a tear, when this character dies.\n"},
{"review": "\nI'm not sure what all the whining is about. It's true the opening CGI\nscenes were pretty awful (like in almost stop-motion unrealistic), and\nI was like \"Aw, Man!\", but once past that it shaped up pretty nicely.\nI've also heard complaints about too much comedy and one liners--which\nthere were quite a few, but frankly I thought they were pretty funny\nand not over done. The main thing the first Avengers had over this one\nis that the first was \"surprisingly\" good and the second is good but\nwe've already had the surprisingly. It would have had to have been\nsomething really special to out-do the first. Considering what a\ndisaster a lot of sequels are--we should be grateful. My only other\ncomplaint was that the CGI fight scenes suffered from\nTransformerization--where they apparently run the action really fast so\nthey don't have to do a lot of really time consuming, realistic detail.\nMaybe they could just make them shorter, slower and more clear. Huh?\nAnyway I recommend it with 8 stars.\n"},
{"review": "\nI did like how the Avengers were together from the beginning, and a lot\nthroughout the film. They don't always get along, and all of the scenes\nwith them assembled are not amazing, but this is more of what you\nexpect with a team. Some of the scenes I enjoyed the most were scenes\nwhere they resembled normal folk. Scenes where they are partying or\nhanging out, or even in an old farmhouse with Hawkeye's (Renner)\nfamily; moments that focused on their humanity. Because for the most\npart, there isn't a lot of humanity shown otherwise. Part of the\nproblem with superhero movies is finding an adequate challenge, and\nputting the main character in danger. In many popular comic book\nmovies, \"Iron Man\", \"Wolverine\", and \"Thor\", all of these characters\nare stripped of the powers and they have to figure things out as a\nsomewhat normal individual. In Avengers 2, there is no imminent threat\nfelt, even though it is implied. While it's not a bad movie by any\nmeans, the Avengers seem to be overstaying their welcome at the moment.\nIt's up to the Russo brothers (Captain America 2, and currently\ndirecting Captain America 3, and then both Avengers sequels) to get\nthings back on track. Russo brothers, assemble.\n"},
{"review": "\n\"Ultron\" comes and delivers most of what the trailers promised: a\ndarker, more complex vision of what the superheroes must confront in\norder to keep this planet going. Maybe it was too ambitious to begin\nwith because after all, we have technology, mythology, and a dash of\nromance in there. If you care to make it more complicated, we can a bit\nof disfunctionality and the issue of artificial intelligence overriding\nthe intent of its creators.<br><br>\"Ultron\" is more of what we got the last time out, but it might be a\nlittle more than we should have. There are big explosions, close calls,\nsacrifices, and the development of some very interesting relationships\nbetween humans, Gods, and machines. The fluidity of how can transform\ninto another is one of the film's highlights, and rarely we get to see\nthe flaws in these beings, and we see plenty here.<br><br>Of course, we see monumental displays of technological destruction, and\nUltron is one of the best villains we have seen in a while, beautifully\nrendered by the latest wonders of CGI and perfectly brought to life by\nJames Spader who can make wonders happen with in the unlikeliest of\ncharacters. He makes us admire and hate Ultron. He's after fighting for\nwhat humans want: a perfect life, and if this requires the destruction\nof those flawed humans, well, let it be.<br><br>I have seen a few negative comments here, and that might be because\nonce again, we have been given food for thought, and that's a bit of\ntask for those who just want to see mindless fun (another 2015\nblockbuster) come to mind. There's plenty of admiration for Science\nFiction/Fantasy that explores issues and situations which have a\nfoothold in reality. I keep thinking about those communicators in \"Star\nTrek\", the allusions to soul, life, and artificial intelligence\nexplored in \"TNG\". <br><br>Go and have a little fun, and dare to ponder along the way.\n"},
{"review": "\nthis film is expected to be one of the best marvel films of all time\nbut turns out its not. definitely not the best but still worth it.\nalthough what i mean is \"Not that good\" its because it feels bland and\nlack of excitement unlike the other marvel studio films like winter\nsoldier,GOTG and IronMan1.but really worth the shot especially the\naction sequences. gotta admit captain America's moves is the best!\nbetter than the last avengers this one really got the super soldier\nmoves and not to mention his tag team with Thor now thats freaking\nawesome cant wait to see more of them. but the rest somethings really\nwrong or not right at all. i felt like less iron-man in it,ultron not\nreally that strong and threatening,the black widow and banner\nrelationship(doesn't make sense at all) and the quicksilver,scarlet\nwitch, vision underdeveloped characters,but the rest they're still\ngreat and as a hardcore marvel fanboy i'd give this film a 7/10 looking\nforward to civil war and MORE!\n"},
{"review": "\nThe Age Of Ultron. As Interstellar would have it... Love transcends all\ndimensions but Nick Fury re-imagined it a little better, its trouble\nthat creates the rubble and finds it way everywhere and eventually to\nlegendary face-offs- \"all of me\u0085.all of you\". No no Mr Legend spoke of\nlove, here the resounding WAM! BAM! BOOM! CLANK! KA-POW! Of metal\nagainst flesh is the reigning emotion in DA house. You might have sat\nwith a checklist, striking off as the movie escalated to points where\nbreathing had to be induced voluntarily (Hulkbuster sequence and\nScarlet Witch's) Joss Whedon marvelously enthralls (usual stuff) and\nyou go Yyayy! As the array of secret doors open simultaneously to the\nInfinity universe (introducing the Mind stone) letting awesomeness do\nits thing. This got some damn bad-ass action moments son! (Trying to\nwatch the language cap!) And the Mjoinir jokes, whoa! Consequential\ntestimony of bro- romance. The evil AI automaton/ robot Ultron, with\nhis chiseled build has some riveting poetic lines (the semi- soliloquy,\nwhen the dust settles\u0085. All will remain\u0085metal\u0085\u0085) voiced by James\nSpader, setting the fear of god in you. An amazing must watch with\nThanos beginning an end to MCU-II we walk out of the door an Avenger!\n"},
{"review": "\nI saw it on the opening day, and may I say that just for the Vision\n(Paul Bettany) alone, I might even decide to watch Age of Ultron a\nsecond time :)<br><br>Now here's the thing:<br><br>I'm so glad Whedon chose to give this movie a much \"darker\" tone\ncompared to the first movie, which to me was full of roll-eye moments\nand basically, a joke of a movie.<br><br>Age of Ultron, on the other hand, actually has some heart and soul to\nconnect with the audience on a deeper level. Why do I say this? The\nanswer is simple.<br><br>In the first movie, all the good guys were pretty much overpowered and\nso you didn't feel the \"need\" to root for them. What's worse, the movie\nwas so full of \"Look at me, I'm so f***king cool!!!\" moments, that the\neffect it had turned out quite the opposite - A big Yawn.<br><br>However, in Age of Ultron, the superheroes were made to suffer greater\nphysically and psychologically (for example, due to Scarlet's haunting\nmind games). They were portrayed to be a lot more vulnerable, hence the\n\"darker\" tone of the movie. But that's also why I could, and perhaps\nyou will, get more emotionally involved with the characters, which is\nwhy I enjoyed this movie much more than the first.<br><br>It's not even close.<br><br>The action? It's mind-blowingly awesome. Seriously. In fact, it would\nprobably take multiple viewings just to fully appreciate some of those\nsequences and moments (like when Thor hammer-struck the city into\ndust). It was OMG... so good.<br><br>If there are any flaws to Age of Ultron, I would say it's mostly in the\nsubpar dialogue and over-use of cheesy one-liners. But I guess that was\nto expected.<br><br>Overall, I highly recommend watching this movie because unlike the\nfirst, this actually has heart. Plus CRAZY good action aside, you might\neven decide to watch this movie again like I'm going to if you can't\nget enough of certain characters.<br><br>Heck, the Vision was, by far, the best part of the movie.\n"},
{"review": "\nI don't really have complaints but it is funny that they forced to give\nsome responsibilities to Hawkeye where I never saw his values in all\nMarvel movies since Avengers. Then in this movie, they made him like\nmanaging this team, in which he actually played nothing other than\ngiving more trouble to the team to take care of. I laughed when he said\n\"yeah, they are my mess\". I meant no disrespect to the actor of it, but\njust that I see much more values played as widow than this Hawkeye. I\ntried to watch Avengers and Avengers 2 over and over again but I still\ncould not find his value. I actually think Agent Colson had more values\nthan Hawkeye but then again I have no complaints to Marvel movies so\nfar, just my 2 cents though.\n"},
{"review": "\nThis was... entertaining at least, but Age of Ultron features a lot of\nthe Hollywood toxins that plague several big budget productions today,\nfrom pointless comedic quips that add nothing to the story or\ncharacters, overuse of CGI that isn't the prettiest thing to look at,\nand a story so overloaded that it feels empty compared to what came\nbefore.<br><br>Age of Ultron wasn't Guardians of the Galaxy, certainly wasn't Marvel's\nDaredevil (the Netflix TV show), and didn't have nearly the same level\nof excitement as Captain America: The Winter Soldier let-alone the same\nprecise direction.<br><br>I do love the superhero genre in film, but Age of Ultron has all the\nclichés we've come to expect from it and doesn't take nearly as many\nrisks as the first Iron Man film did. There was just no danger, nothing\nthat stood out from what we've already seen in the Marvel Cinematic\nUniverse. <br><br>Entertaining, but not substantial as a standalone film. I'd recommend\ngoing onto Netflix and watching Marvel's Daredevil.\n"},
{"review": "\nFormulaic or not, it's undeniable what cultural impact The Avengers has\nhad on the youngest generation of movie goers. Kids who were born in\nthe Summer of '12 now claim the Avengers to be their favourite thing\n(source: my girlfriend's 3 year old nephew and his Hulk\nimpersonations). I almost envy them for having such a planned web of\nmovies to be nostalgic about in their teens. The closest thing I have\nis the long but more contained Harry Potter franchise, though I do pity\ntheir parents wallets when it comes to the eventual bulky boxsets. As\nthe Marvel Cinematic Universe gets more and more crowded, so do their\nmovies. Avengers: Age of Ultron has little room to breathe and is\nmore-or-less a big stitched-together mess. A fun mess for the most\npart, but one that emits a consistent buzz of CGI, action sequences and\nfan service to the point where it's far too easy to become numb to the\nstakes as it goes along. <br><br>I really enjoyed the first Avengers, by about a million times more than\nany other Marvel movie, but I think the novelty of the group hit its\nlimit there. The most efficient part of Age of Ultron is Robert Downey\nJr's sharp witted one-liners, the best his humour's been yet, and one\nthat will almost definitely go over the heads of the film's young fans.\nI knew the Iron Man series hinged on his charisma, but this film is\nhanging firmly by that rope now. I don't know what they're going to do\nwhen he signs off. Meanwhile, Scarlet Witch and Quicksilver are very\npoor additions to the clan and while I get the ideas behind Ultron, I\ncould never get behind him to take him or his tried-and-tested plan\nseriously. If Whedon struggles to get enthused about this one, I don't\nsee how I can be either. Easily beats Winter Soldier though. It's like\na broken stained glass art with some shards I liked, some shards\nmissing and some shards unpolished.<br><br>6/10\n"},
{"review": "\nLet's start with the good. 1. Unintentional Taylor Swift easter eggs.\nDialogue feature Captain America saying: \"So we're just supposed to\nSHAKE IT OFF?\" And then \"run and hide...\". And finally, Black Widow\nsays \"Nothing lasts forever\". And then Captain says \"except for TROUBLE\nTROUBLE\". 2. Cool characters like the twins. But weird that they kept\non saying \"enhanced\" instead of \"mutant\". The bad. 1. WHY?! did Black\nWidow like Hulk? Since when?! I thought she and Hawkeye were a thing!\nAnd suddenly Hawkeye is out of the picture with a family? And I can't\nbelieve Black Widow would be so vulnerable about her feelings, or care\nthat she can't have children. She's tough, it's such a 180. 2. No Loki.\nThe villain Ultron was lame and not a threat. He's just a machine. 3.\nLess funny from Iron Man, who seems like a douche. Overall, I feel that\nonly Captain America and Thor acted as expected. It's OK but too long,\ntoo action.\n"},
{"review": "\nIn my opinion, The Avengers (2012) was one of the best movies ever. If\nyou disagree with me, you are an idiot.<br><br>I watched The Avengers (2012) while on a plane and deeply regretted not\nwatching it in a cinema instead, because it was so focking awesome.\nAfter landing, I got a digital copy of it (through entirely legal means\nof course) and watched it about 10 times within a two- week span. I\nALSO proceeded to watch ALL the previous MCU movies, none of which came\nclose to being as awesome as The Avengers, although some (such as the\nvery first Iron Man) were very damn good.<br><br>I vowed that I would pay to watch ALL sequels to The Avengers in a\nproper cinema. I also forecast that the series of Avengers movies would\nbe the best/greatest/awesomest trilogy (or quadrilogy) of all time.<br><br>So imagine my disappointment when, three years later (i.e. today), I\nhad to sit through 2+ hours of an utterly pedestrian superhero movie. I\nfelt like crying when, after random things blew up and rocks flew\naround and they went to \"The New Avengers Facility\", I realized the\nmovie was coming to an end. <br><br>Because you deeply value my opinion, here are my rankings for the 11\nMCU movies released so far (as of May/June 2015):<br><br>#1 Avengers 1 A++ One of the best movies ever #2 Iron Man A+ #3 Captain\nAmerica 2 A #4 Guardians of the Galaxy A #5 Iron Man 2 A (unlike most,\nI actually liked this) #6 Thor 2 A-<br><br>#7-#10 B+ (Run-of-the-mill, predictable superhero movies) The\nIncredible Hulk Thor 1 Captain America 1 Avengers 2<br><br>#11 Iron Man 3 B- Total Scheiβe (compared to most of the other MCU\nmovies). I hated this particularly bad.\n"}
]