[
{"review": "\n\nAh, the Usual Suspects. My personal favorite movie of all time. Don't\nlet my bias be a fool. Perhaps it's not THE best movie ever, but it's\none that I never get tired of.<br><br>If you like flash and bikinis and breath-taking camera angles, you\nwon't find them here. Usual Suspects is not an \"epic,\" and it doesn't\npretend to be. It's a modestly-budgeted piece by a fresh director (who\nlater went on to do the X-Men movies, a FAR departure).<br><br>A great, gritty script, beautifully-acted characters, and what many\nhave called the greatest movie ending of all time, are some of the\nshining qualities that make the Usual Suspects an object worthy of\npraise above its humble-looking shell.<br><br>The casting is very unusual but somehow fits perfectly. Gabriel Byrne\nis convincing as the ex-con trying to build a new life when he gets\ndrawn back into his old life. Stephen Baldwin has the role of his\ncareer as the smart-mouthed and cocky professional. Kevin Pollak takes\na big departure from his usual good comedy self to take a more dramatic\nrole. Benicio del Toro literally takes a one-dimensional character with\nabsolutely nothing in the script to give him character, and he fleshes\nit out with brilliant mannerisms and memorable mumbling to show\nincredible acting creativity. Kevin Spacey as we know him was born from\nthis movie. His manners and fast-talking yet shy gimp nature are a\ntreat to listen to throughout the flick.<br><br>Without giving away the plot, the best and most genius parts of the\nmovie are the subtleties. After you see the ending, and the truth hits\nyou like a ton of bricks, you have to watch it again. On the second\ntime through, you'll jump up and point at the screen whenever you spot\na clue you missed the first time. It's even possible to watch the movie\nmultiple times and see something new with every viewing. It's that\nattention to detail that make the deceptively innocent-looking Usual\nSuspects one of the greatest movies of all time.\n\n"},
{"review": "\n\n'The Usual Suspects' has received a lot of comment for its killer twist\nending, which while by no means the first in movie history, has proved to be\nenormously influential (stand up Messrs. Fincher and Shyamalan...). But this\nmovie is so much more than a surprise ending! It is a meticulously scripted,\nfaultlessly acted masterpiece that stands up to repeated viewings. Every\nsingle time I watch it I notice some new detail, or get more enjoyment out\nof a performance or scene.<br><br> This movie really put  Kevin Spacey on the map, but everyone in the\nensemble cast is outstanding, even Stephen Baldwin(!), who has never\nappeared in a movie this good before, or since.  I also got a kick out of\nthe Paul Bartel ( 'Death Race 2000', 'Eating Raoul') cameo, and the\nultra-cool Peter Greene's ('Laws Of Gravity', 'Pulp Fiction') all too brief\nappearance. Bartel is sorely missed, and Greene one day (mark my words!)\nwill become the star he deserves to be.<br><br>Director Bryan Singer has yet to live up to the promise shown here with his\nsubsequent movies, the average 'Apt Pupil' and the disappointing 'X-Men'.\nFor all the acclaim he and the (admittedly superb) cast have received, the\nreal star of 'The Usual Suspects' is Christopher McQuarrie's sensational\nscript, one of the finest of the modern era, and one that genuinely deserved\nit's Oscar.<br><br>It really doesn't get any better than this!! One of the greatest movies ever\nmade, any time, any where. A truly unforgettable experience.\n"},
{"review": "\n\nSuch films like this should be enshrined \nin museums, simply due to the fact it \ndestroyed the entire genre of mystery films. \nWhile this film was unique and captivating, \nno other mystery will ever accomplish this \nsort of cult status, single handedly shaping \na genre. While most mysteries try to shock \nyou too often with twists and even more \ntwists, it turns out to be overkill. This film \nencompassed such ideas with flair and \noriginality, which is probably the reason \nBrian Singer is sticking to sci-fi action films. \nOnly Memento and The Game are the \nonly recent mystery movies worthy \nenough to stand beside this film. Sadly, \nSinger has somewhat sold out by doing \nthe X-Men movies, but I guess trying to \nmake films like this would be too taxing. \nThis film will always bring a smile to \nmy face when I watch it with someone \nwho hasn't seen this movie. A good \nviewing every time I watch it, the new \nspecial edition DVD is awesome.\n"},
{"review": "\n\nAlthough the film is perhaps a little slow in fully developing, the\nconsequent results are astounding. Spacey's performance is captivating and\nwill only be fully appreciated once the viewing is complete. The supporting\ncast, including Gabriel Byrne, provide the basis for a convincing drama\nwhich will change the way you perceive crime thrillers in the future.<br><br>One is required to discover the identity of the elusive Keyser Soze\nthroughout the film and if it were not for the well thought-out script and\nprofessional dramatic acting then the viewer would feel a sense of\nanti-climax. However, this is not the case; you shall be left speechless and\nwondering how the film achieved its goal.\n"},
{"review": "\n\n\"The Usual Suspects\" is a complicated puzzle of a movie that I bet you can't\nwatch just once.  The film deals with five career crooks who have big plans\nafter they are all brought together in a police lineup.  However, their\nmayhem is interrupted by a mysterious character named Kaiser Sose who plans\nto eliminate all five of the crooks after they all crossed him in various\nways during their checkered pasts.  An amazing original screenplay and tight\ndirection keep up a substantial amount of tension throughout.  Gabriel\nByrne, Stephen Baldwin, Benicio Del Toro, Kevin Pollak, Pete Postlethwaite,\nand Chazz Palminteri all give top-notch performances.  But it is Kevin\nSpacey (in an Oscar-winning part) that makes \"The Usual Suspects\" work on\nall levels.  This part put him in a higher class of actors and can be\ncompared to Robert DeNiro's star-making job in \"The Godfather, Part II\".  5\nstars out of 5.   \n"},
{"review": "\n\nIf plagiarism were a crime in film techniques, director Bryan Singer would\n be imprisoned for life. Screenwriter Christopher McQuarrie would be serving\n a similar sentence. However, since it is not, Singer and MacQuarrie (who\n have joined forces again after the not-so-successful PUBLIC ACCESS) took\n advantage and duplicated nothing but the best. From CASABLANCA to PULP\n FICTION, and even a version of a line (intentionally or otherwise) from\n BUTCH CASSIDY AND THE SUNDANCE KID.<br><br>Many people oppose watching a film with a twist a second time. I disagree.\n By watching it again you can observe how the director and the screenwriter\n have hidden and revealed clues, how they have tried to steer the audience\n away from the ending. First time is for entertainment. Second time is for\n art. This film is certainly worthwhile to see again. To date, I have\n watched it five times. (Two of those five times I thought, 'well, I'll just\n watch about half-an-hour,' but ended up watching the entire film because it\n is so entertaining.) I'm not exactly a noir fan, so it is assured that this\n particular crime film appeals to a wider audience.<br><br>THE USUAL SUSPECTS has a skilled director, an engrossing screenplay, and ten\n praiseworthy performances. The film runs a fast 105 minutes. Don't miss a\n minute of it.\n"},
{"review": "\n\nI have seen this movie many times and yet it still astonishes me every time\nI watch it.  Even though I know the ending I still feel myself being caught\nup in the plot.  It is possibly one of the greatest scripts of all time.  I\ncan't remember another movie in which I was completely astonished at the\nfinale.  The cast gives a tremendous performance.  Kevin Spacey gives one of\nhis two best performances (the other being as John Doe in Se7en) in my\nopinion.  That is probably why he was awarded Best Actor for this role.  It\nwas truly deserved.  Gabriel Byrne also gives a great performance.  It may\nbe the best character Stephen Baldwin has ever played.  In all, this is a\nmust for any movie collector or enthusiast.\n"},
{"review": "\nUsual Suspects is one of the Best Mystery Thrillers in the world. It\ncontains one of the greatest endings ever seen in any film. When i\nfirst saw this film, i understood 85% of the film. I had to watch it\nagain, to recap on what happened earlier. After the second time i\nwatched it, i realised this is a Superb movie with a fabulous twist. I\nhave now seen this film about 20 times and seems to get better every\ntime i watch it. Kevin Spacey delivers the greatest performance in his\ncareer. Gabriel is great, Benecio delivers a great performance with\nhumour. Stephen is quite good in his best film. Pollak was impressive,\nChazz Palminteri is a Superb underrated actor. Chazz looks ultimately\nsmart and supposingly is a intelligent investigator. But Spacey turns\nout to be 10 steps ahead. Superb, brilliant and any other great ways to\ndescribe this film.\n"},
{"review": "\n\nThe Usual Suspects, is, in my mind, one of the most fantastic pieces of\nfilm-making ever to grace our screens. That a group of people can come up\nwith a piece of fiction that is so excellent in every way, from start to\nfinish, is frightening. Who knows, maybe this film has no\nsuperior.<br><br>A lot is made of the film's ending. Not for a moment am I going to let slip\nwhat exactly that is. I would never deny another film lover the sheer sense\nof amazement that ran through my body when the film reached its climax.\nWhile not the film's only strong point; this is a masterpiece ALL the way\nthrough, the ending will blow you away.<br><br>The cast is, in a word, flawless. Kevin Spacey has, as far as I am\nconcerned, never been better. He turns in a performance that is so moving\nand outstanding that he should have got three Oscars. But he is not alone.\nByrne is fantastic, Del Toro adds continental flair, and Postlethwaite is\ndisturbingly dark, yet calculated.<br><br>By all means watch this film, and observe its strong points, from Bryan\nSinger's masterful direction to the equally pleasing musical score. Prepare\nyourself for a rollercoaster ride and the best ending EVER in a film made\nanywhere in the world. I mean that.<br><br>Oh, and when you have finished; by all means, watch it\nagain!<br><br>9.7/10<br><br>Nothing in life is 100% perfect now is it?\n"},
{"review": "\nOut of the mind of Christorpher McQurrie comes this incredible story of\na man in search of the devil. The film is called \" The Usual Suspects\"\nand what could be more appropriate than an unusual movie about five\nsuspects who are anything but usual. The story originates with the only\nsurvivor of what the police conclude was a murderous and explosive drug\ndeal gone bad. His name is Roger Kint (Kevin Spacey is perfect) also\nknown as 'Verbal.' From the mouth of this innocent storytelling,\ncon-artist comes the fantastic tale of how he and his fellow criminals,\nStephen Baldwin, is Michael McManus, Benicio Del Toro is Fred Fenster\nand Kevin Pollak as Todd Hockney were originally assembled and then\nset-up. Beginning with a mix-up by law enforcement to put several\nguilty men together in the same line up, the tale proceeds cross\ncountry and culminates with a powerful, but mysterious kingpin by the\nname of Keyser Soze. It's through his attorney, Kobayashi (Pete\nPostlethwaite), the men learn they are marked for death unless they\nundertake a dangerous assignment. The center piece of the Unusual group\nis their leader, a remarkable individual named Dean Keaton (Gabriel\nByrne, incredible performance). What transpires in this movie from\nmoment to moment is a lesson in sleigh of hand. What we and the police\nDave Kujan, (Chazz Palminteri) are told is not what we see. Conversely,\nwhat we see is not what we have been told. In the end, this film with\nit's haunting theme by John Ottman, is nothing short of incredible. A\nsuperb classic in both mystery and action entertainment, by Bryan\nSinger. A great film indeed. ****\n"},
{"review": "\nI don't know what the problem is. I had heard that this is an\nincomprehensible film. That when it ends we don't know what exactly\nhappened. I thought that throughout the film we were in the loop, and\neven if we have an unreliable narrator, I suspected that from the\nstart. Anyway, it's been a long time since I've been taken for such a\njoyride with such interesting characters, even if they are murderers\nand felons. The plot is woven so delicately and the threat is so\ninteresting, that I was involved from the first minute. I always\nwondered how Kevin Spacey, a rather ordinary looking guy with a\nreceding hairline, got to be so well known. Obviously, this is the\nreason. His performance is right on and he dominates the screen, even\nthough he is a \"gimp.\" There are so many layers in this film, but I\ndon't think the screenwriter ever plays unfairly with it and it is\nquite satisfying.\n"},
{"review": "\n\nI wanted to like this movie but...<br><br>**SPOILER**<br><br>The movie lies to you.  In %99.99 percent of all movies, what you see on\nthe\nscreen is supposed to be what happened to the characters.  The only\ndifference are things like point of view or missing details, for example\nyou\nmight know what happened from 3:00 to 4:00 and from 5:00 to 6:00 but not\nfrom 4:00 to 5:00.  Or you might know that Mr. A was there killing Mr.B but\nit's not until later you find that Mr.C was also there.<br><br>In this movie though, several of the scenes are deliberate lies.  That\nbreaks one of the cardinal rules of movie making.  Not that there are any\nrules but if the camera lies then there's basically no point in\nwatching.<br><br>It would have been a good movie for me, even with the twist, if all the\nscenes had been about reality and the twist brought all your missing\nknowledge together.  Instead, the twist just invalidated everything before\nit.  You end up not knowing if any scene in the entire movie has anything\nto\ndo with reality whatsoever.<br><br>Given that I honestly don't understand why people like this movie.  Try\nMemento, it doesn't lie.  Try Fight Club,  Try 6th Sense.  All much better\nmovies because they are not full of camera lies.<br><br>**END SPOILER**\n\n"},
{"review": "\nI was deeply disappointed by this movie. The alleged and hyped twist\nending could not have been more predictable. As soon as the mystery\ncharacter was introduced, I suspected who it would be. As the story\nunfolded, it was clearer and clearer that it could be only one person.\nIn a bit of Sherlock Holmes logic, all the other options were\neliminated and the final remaining choice had to be the correct choice.<br><br>We know from early on that the narrating character survives the opening\nsequence unscathed. That alone was a huge signal which spoils any\nchance of a surprise. The narrating character is revealed to be an\nexcellent story teller, to be manipulative, cunning, and incapable of\nbeing truly frightened. Those are exactly the characteristics of the\nmystery character. Again, this made the ending obvious.<br><br>That the story is filled with 90% false information is disappointing.\nIt's a fundamental violation of the compact between the storyteller and\nthe audience. Perhaps if the twist were not so clearly communicated\nfrom the beginning, perhaps if there really was some thought required\nin getting to the ending, then perhaps it might have some shred of\njustification. Only perhaps, though -- In the end, almost certainly\nnot.\n"},
{"review": "\n[**Major spoilers**] This movie began on a sour note in the opening\nscene with a man on an upper floor pissing down onto a ribbon of\nflaming gasoline on a lower floor to put it out. Right off we know that\nthere is going to have to be some major suspension of disbelief. <br><br>The story line is not nearly as complicated as it is made out to be.\nWithin the context of this movie, maybe that was a goal. I never did\nfigure out what the deal was with the image of the rope heading into a\nrat's nest of junk that was shown several times.<br><br>A real problem for me was that the two main thugs in this were not at\nall threatening. The final plot twist only furthered this dissonance -\nit was kind of like finding out that behind the mask of Darth Vader we\nfind Pee-wee Herman. And I felt manipulated by the final twist (that\nwas in fact somewhat anticipated, after all Verbal was smoking his\ncigarette in the Turkish style). Are we to believe that Verbal boarded\nthe boat and changed into a fedora and black overcoat to perform the\ncrucial murder? What was the point of that besides trying to fool the\naudience? <br><br>And so many times in the exchanges between Verbal and Kujan, I felt I\nwas watching actors rather than characters.<br><br>The bottom line on this movie is that it is no more than a tricked out\nepisode of \"Law and Order\" without offering anything substantial to\nthink about after it's over.\n"},
{"review": "\n\nThis review contains mild spoilers so don't read it if you haven't seen\nthe\nflick.<br><br>I hate these movies that just go and tack on this ending that no one\ncould\nhave predicted and it's supposed to be witty.  It's stuff like Urban\nLegends\nand Scream where the killer is the last person you'd suspect because the\nreason behind it is retarded and mostly based on information that you\ndon't\nhave.  Worse than that is stuff like Clue where there are a bunch of\npossible different endings to the movie that all work so that there's\nreally\nno way to predict the ending.<br><br>This movie was even more idiotic than those because not only is there no\ncertain way to come to the logical conclusion given the clues but the\nwhole\nstory we're presented with is a string of lies.  Oh wow shocker!  Well of\ncourse it's a shocker!  It's like you hear the story of little red riding\nhood and then at the end your grandmother who's telling it to you says\n\"You\nknow what?  I was that little girl and there was no wolf after all.  I\ndrugged my granny and stole all her cash then blamed it on the wolf.\"\nHoly\ncrap!  I could never have predicted that!<br><br>So this movie is worse than the farces that are Urban Legends, Scream,\nClue\nand a majority of all the other movies that have ever been\nmade.<br><br>How this guy also did the brilliant movie that is X-Men is a mystery to\nme.<br><br>1/10 and that's only because the scale doesn't have a zero\n"},
{"review": "\nI gave this movie a 1. Ignore the plot, there is none. The only spoiler\nis: The whole move is the invention of Verbal/Keyser who is trying to\nconfuse the cop he is telling the story to...and us the audience. It\nappears that the movie was intended to have a twist ending, but at\nabout 1/3rd of the way through the movie the director gave up trying to\nbe coherent and just went with confusing. The ending that 'ties it all\ntogether' is that...well, none of it was true.<br><br>Anyway, if you think that finding out at the end of the movie that\npretty much everything you were shown was a lie makes for a good twist,\nyou may like this movie. You will not understand it, because there is\nnothing to understand. At the end, all of the plot points were a\nmade-up story, so what was the point? It is like watching 90 minutes of\none movie and then watching the last 10 minutes of another movie. <br><br>In short, this is really a waste of time.\n"},
{"review": "\n\n*** CONTAINS SPOILERS ***<br><br>Many movies have twists in their plot. Some of these movies leave you\nbewildered, the others just leave a bitter taste in your\nmouth.<br><br>80% of this movie is based on Kint's narrative, and because of that, the\nnarrative BECOMES the whole movie experience. I do not think it is clever\nor\nfair to end the movie by saying, \"haha, just kidding. the whole movie is\njust a lie.\"<br><br>Some people think that Kint's narrative was true, he just obfuscated the\nnames. IMHO, I don't think that would redeem the movie. If it's a good\nmind-twister, which it's supposed to be, the audience would say, \"so he is\nKaiser Soze, yes, thinking back, it was obvious.\" But no, any of those five\nsuspects could have been Kaiser Soze, the hints were not obvious nor\nsubtle.\nI felt that the screen wright randomly chose one of the suspects to be\nKaiser Soze at the end.<br><br>Don't take me wrong, I think both the direction and acting are decent in\nthis movie, but I cannot agree that the plot is anything special. In fact,\nexcept the big twist in the end, there is nothing exciting about it. To\nexaggerate it a little, the plot can be described as a glorified version of\n\"Scream.\"\n\n"},
{"review": "\nLets see. There's a kaiser who is considered a real bad ass because he\ngunned down his wife and little kids. Real macho, yes? He doesn't\nexist, but he does? He can't be killed (like we haven't seen this\nbefore). His imagination and creativity are so bad he can't even come\nup with names or stories, but has to take them off of coffee cups and\nposters. Add to this, the entire story. He orders a police line up, but\nthe police don't know who ordered the line up. Now, we all know most\npolice departments are incompetent, but this belongs on the NAKED GUN\nseries. Then there are the characters. According to the narrator, they\ncan't be broken, because they are hoodlums. Talk about your street myth\nthat people in power would love to have you believe! But it doesn't\nwash. It isn't even remotely credible. And no one cares. I happen to be\nwatching it while working on something else, and was in a public place\nwhere they showed it twice. I naturally assumed it was some sort of\n\"Worst films\" festival, which it might have been. I was stunned to see\nit ranked so high on any critic's list. Had they made this an all out\ncomedy, it would work, but it just falls on its face. Easily one of the\nworst films ever made. Can you give a movie a negative number rating?\n"},
{"review": "\n\n*SPOILERS*  ONLY FOR THOSE WHO HAVE SEEN THE MOVIE\n*SPOILERS*  ONLY FOR THOSE WHO HAVE SEEN THE MOVIE\n*SPOILERS*  ONLY FOR THOSE WHO HAVE SEEN THE MOVIE<br><br>The movie script hangs on one completely implausible premise...  That\nKeyser\nSoze would throw away $91 million which was left on the dock in order to\nachieve his true goal.<br><br>Also, no plausible explanation as to why Verbal Kint was in police custody\nin the first place. If he really is who we are led to think he is,\nwouldn't\nhe be clever enough to not get caught? Is it some sort of game he plays\nwith\nthe police?<br><br>Too many holes in the script, a very sloppy story... but great fun and\nwell\nacted.  Just don't think about it too much.\n"},
{"review": "\nI couldn't help but set rather high expectations for 'The Usual\nSuspects' as I went into watching this. I knew this was no action movie\nor any of the crap we get nowadays. This was true cinema! I was excited\n'The Usual Suspects' is a mystery film about what cargo was on board\nthe ship when it was destroyed and the events leading up to it as we\nare told from the only known survivor of that accident.<br><br>Around 45-50 minutes into the movie, I was starting to find myself a\nbit tired and thought the movie may perhaps have dragged along just a\nbit. I was becoming rather disappointed. Then the film truly began to\nchange in such a way that I find it rather hard to explain. The\ncharacters began to get a little more entertaining, the pacing\ncertainly began to pick up, the dialogue was getting more interesting\nand overall, I was more excited.<br><br>Then comes the amazing final twenty minutes with the plot twist and the\nstory finally closing in perfectly, making the story more\nunderstandable. However, the final 5 minutes of the movie are some of\nthe best moments of movie ever made and that is the ultimate plot twist\nwhich surprised the hell out of me! It was a cheering end to what ended\nas a great movie and a movie I would be more than happy to check out\nagain and again! A-\n"},
{"review": "\nI'm not much for writing reviews. But then again, there's not a lot of\nfilms where I go against popular opinion. The Usual Suspects is an\nexception.<br><br>***SPOILER WARNING***<br><br>The Usual Suspects is an exception because it lies. It lies because it\npresents itself as a clever mystery; as a riddle. Except riddles are\nsolvable. Trying to solve The Usual Suspects is like trying to solve a\njigsaw with lego pieces.<br><br>Not counting final few moments, the film is actually good. It takes you\ninto the final scenes with great anticipation. 'Finally', you say, 'the\ntwist will be revealed, which will put everything into perspective.'\nThe film doesn't do that. Instead, the twist leaves you with endless\nquestions. It leaves you thinking, 'Why did any of that just happen?'\nWhy does Verbal design an intricate plan to recruit four nobodies when\nhe could just pay people? Why does he tell Kujan his story using\nphrases from the bulletin board, when he can easily be discovered?<br><br>And to top it off, the final scene is almost as bad as the twist\nitself. Verbal gets away, but all too late. He's been found out. Two\nhours of lies for nothing.<br><br>The Usual Suspects tries combine mystery and a clever twist and fails.\nFails hard. The 'mystery' is nothing but lies, and the 'clever twist'\nis anything but clever.<br><br>3/10\n"},
{"review": "\n\nI get it and yet, I don't -- and wonder how many people REALLY do\nunderstand\nthe finale -- or are they just caught up in the flash and sizzle of a\nfantastic ride with a surprise destination?  Sure - it's an awesome\nadventure, but does it REALLY take you anywhere?<br><br>Yes, yes, yes...  It goes unsaid that first and foremost, an outstanding\nensemble cast, superb dialog &amp; script, and truly a piece that keeps one\nriveted...BUT<br><br>(SPOILER) - If Verbal's explanation of what happened, detailing all the\nnames, events, locations - If these were all made up, created based on the\nbulletin board postings and items in the office where he was\ninterrogated...then did any of these events really happen?  Was there a\nKobyashi, a Redfoot, etc., or was it all just an elaborate story?  Based\non\nthe ending - Verbal's story was a just a great improv.  BUT - if these\nevents were all fictitious, then how did we really involve our crew in\neverything that occurred, up to and including the ship heist and\nexplosion?\nIf there is no real substance to Verbal's explanation, how can we have a\nreal outcome??<br><br>Is it me -- or is this just a cutting edge Wizard of Oz, with us first\nquestioning who the Wizard is - And then, trying to solve -- was any of\nthis\nreal or just fantasy - a dream?  I love this flick, primarily because of\nthe\nsuperior cast performance -- but I can honestly say I don't really\nunderstand it -- or is this the way I'm supposed to feel?  It truly makes\nmy\nhead hurt!\n"},
{"review": "\nWhat a waste! Even if this is a \"well-crafted\" movie, none of the\ncharacters are likable, no one but the evil Satanic figure survives,\nand nothing good comes out of any of their lives. So maybe it's well\nmade, well acted and well directed. So was the Third Reich! Usual\nSuspects was recommended to me (I should have more carefully considered\nthe source) and my wife and daughter watched it with me. They both\nagreed there were no redeeming qualities in this film. It's dark,\nconvoluted, and full of loopholes. The most outragious loophole is the\nfact that Kaiser Soze takes painstaking measures to eliminate the one\nperson who can identify him, all the while appearing in public so much\nthat by the end when he is revealed, everyone in the world will know\nwhat he looks like! DUH! I would recommend this to anyone who enjoys\nhearing the F word in nearly every conversation and who derives\npleasure seeing scores of people murdered mindlessly. This is the movie\nfor you!\n"},
{"review": "\nFrom a directing perspective, The Usual Suspects is a flawless\nmasterpiece with immaculate script writing and a rare show of top notch\nensemble cast acting. Benecio Del Toro makes genius choices, Kevin\nSpacey was brilliant and I believe was handed the greatest of\nopportunities with such a will scripted role. <br><br>This movie really put Kevin Spacey on the map, but everyone in the\nensemble cast is outstanding. Stephen Baldwin, Gabriel Byrne, Benicio,\nSpacey....the list of appearances goes on and on and only sets the bar\nhigher far any movie with a comparable storyline and cast.<br><br>Christopher McQuarrie's inspirationally written script, is one of the\nfinest of the the cinema era. The Oscar was well deserved for this\npiece of work, unlike many politically nominated and won Oscars. This\nwas acknowledged because the work lived up to the praise.\n"},
{"review": "\nI have read many, many enthusiastic reviews. The movie is so complex.\nTo understand the plot you have to see it at least three times.\nEtcetera, etcetera. Alas, already after 45 minutes I exactly knew how\nthe movie would end and who Kayser Soze was. Probably I have read too\nmany mystery crimes. You see, the very first one to use this idea was\nAgatha Christie back in 1926. Her novel \"Who killed Roger Ackroyd\"\ncaused a scandal in England. Her readers felt betrayed. The second one\nwas a crime novel (forgotten the title and author) woven around the\ncharacters of Punch and Judy. Well, I did not feel betrayed while\nwatching The usual suspects. I only felt a deja vu. So the tension\ncompletely fell away. Not much was left: decent, but not extraordinary\nacting, flat characters and artificial twists and turns. As the script\nremains ingenious of course and the direction skillful, 7 out of 10.\n"},
{"review": "\nFeaturing a convoluted plot that wanders all over the place, I have to\nadmit that in spite of its high rating here, \"The Usual Suspects\" just\ndidn't take hold of me. As a matter of fact, within about the first 10\nminutes I was already finding my mind wandering. I don't mind\ncomplicated plot lines when they add to a coherent story, but this\nstory simply wasn't that coherent. Five shady characters meet one night\nin a police lineup and concoct some sort of criminal scheme. There are\nthen so many twists and turns and so many different angles introduced\nthat I found I simply didn't have the energy to keep up with it all.<br><br>Now, most of the cast (most importantly Kevin Spacey as Kint and\nGabriel Byrne as Keaton) did a decent enough job on this. They took it\nseriously; they were believable in their roles. I just honestly felt\nthat those who came up with the story were trying too hard to keep the\nviewers off balance, with no idea what was coming next, and to do that\nthey came up with a plot that really just didn't flow all that well.<br><br>As far as I could see, the greatest strength of the movie came in the\nlast 10 minutes, when the ongoing mystery about the truth about Keyser\nSoze was finally revealed. (Yes - it does get revealed eventually.) I\nwas glad of this, because it was the one point of an overly-complicated\nplot that kept me interested. Was this guy real, or was he in fact a\npiece of fiction? I was glad to see that resolved - and, no, I didn't\nsee the ultimate resolution coming. So, credit for that ending, but the\nmovie as a whole just didn't strike home with me. (4/10)\n"},
{"review": "\nlanguage a bit confusing during boat attack, where were cops? hard to\nlike anyone in film<br><br>\"The Usual Suspects\" is a well-made film from start to finish and I do\nrecommend you see it...maybe. Let me explain. While the film is\nexcellent it also is unpleasant, violent, filled with expletives\n(particularly the old f-bomb) and has nothing but unlikable characters.\nFor me, films like this, \"Good Fellas\" and \"The Fight Club\" are just\npretty nasty films--but still, they are quality films--unpleasant\nquality films. <br><br>The film is a very confusing story about a gang of five guys who meet\nin the oddest way--at a police lineup! The five decide to get together\nfor an illegal job and soon end up being extorted to do a job for\n'Keyser Soze'-- man who no one seems to know but who inspires fear in\nthose who hear his name (sort of like Valdemort). I'd say more, but\nfrankly I don't want to ruin the film. Suffice to say, it's a film with\na BIG twist--like \"The Fight Club\" or \"The Crying Game\" and so I'll\nstop with that.<br><br>The bottom line is if you like violent films with very graphic violence\nand language, then \"The Usual Suspects\" is for you. The acting, writing\nand directing are great. If you would rather see films a bit more\nuplifting or family-friendly, do NOT see this film! Seriously.\n"},
{"review": "\n1995's beautifully structured \"The Usual Suspects\" is really a very\nsimple story. One of only two survivors of a ship explosion (Kevin\nSpacey) tells a story to the police detective (Chazz Palminteri) in\ncharge of the case about how five career criminals - the \"usual\nsuspects\" - met in a lineup and wound up working for the man whose very\nname strikes terror into the hearts of men - Keyser Soze.<br><br>As a result, two names were on everybody's lips for some months to\ncome: Kevin Spacey and Keyser Soze.<br><br>With a crackerjack script by Christopher Quarrie, great direction by\nBryan Singer and terrific performances, The Usual Suspects couldn't\nmiss. And it doesn't. Thirteen years later, I remember it as vividly as\nthe day I saw it. I just saw it again, and it's as good as ever.<br><br>Its other stars are the handsome Gabriel Byrne as Keaton, a bad cop who\nat one point faked his death to avoid criminal charges; and Stephen\nBaldwin, Benicio del Toro, still a distance from stardom, Kevin Pollak,\nand Giancarlo Esposito as Kobayashi, Keyser Soze's persuasive\nassistant.<br><br>As a scared, not very bright gimpy man, Kevin Spacey is a knockout and\nwell-deserving of his Oscar, his Golden Globe, his SAG Award, his New\nYork Film Critics Award and all his other honors. The writer,\nChristopher McQuarrie, justly won the Oscar and several other awards.\nThe film and director Singer probably deserved more awards than they\nreceived, but it doesn't matter. The Usual Suspects is a modern\nclassic.<br><br>The greatest trick the devil ever played was convincing the world he\ndidn't exist...and then he's gone.\n"},
{"review": "\nNo really, I have no words. I watched this for the first time a couple\nof weeks ago and I stayed glue until the last second...which by the way\nis crucial in this movie. Even writing this now I don't even know where\nto begin about how much I loved it. It was just such a good story with,\nas far as my standards go, the best plot twist I have seen so far in\nfilm. I don't think anyone could have played Verbal better than Kevin\nSpacey, he just dominates this film to the point that at the end I\nactually clapped for him...and I was watching this home alone at 2am.\nThere was no performance left half-assed, everything just fell into\nplace. Watch it...just please watch it.\n"},
{"review": "\nSubtlety is a very important thing in any good thriller. Not only does\nsubtlety reduce the ridiculous amount of \"in-your-face-quality\" that\ntoday's thrillers seem to love, which effectively makes then just plain\nold action movies, subtlety shows that a film has respect for its\naudience. It doesn't feel like it has to explain everything at every\nstep of the way since it knows that an interested audience will be on\nthe lookout for hints as to what is going on. That's what makes films\nlike this enjoyable. In fact, that what makes any film enjoyable. It\nisn't just a barrage of images, but rather an engaging sequence of\nthem. This sequence can be unchronologically organized or in any number\nof ways obscured to create suspense, but as long as it is engaging, the\naudience will be happy.<br><br>\"The Usual Suspects\" is such a thriller. It can be enjoyed with the\neyes as much as the brain. There are numerous hints as to what is\nreally going on and the final climatic twist is really a great one.\nEven then, upon seeing the whole film, the second viewing only gets\nbetter as that is when a keen viewer will pick up on all those\nsubtleties that hint at the result which they are now familiar with.\nThese subtleties are not just obscurely placed props but are woven into\nthe film's montage with clever camera angles along with certain key\nobjects seen on screen. It is a thriller worthy of Hitchcock or the\nbest of DePalma. Nothing is in needless excess and even the profanity\nis well written and there are no pointless macho wisecracks. Simply\nput, everything works in this movie. And it works very well. Even upon\nmultiple viewings the film captivates with its clever composition and\nthat can only be a good sign. --- 10/10<br><br>Rated R for violence and profanity. Ages 13+\n"},
{"review": "\nOne of the best crime/thrillers out there,The Usual Suspects has one of\nthe best plot twist endings ever for a movie.Five criminals are lined\nup and really have nothing in common.The film is told using flashback\nand narration as it tells the story of Roger \"Verbal\" Kint (two time\nAcademy Award winner Kevin Spacey who won his first Oscar for this\nfilm-Best Supporting Actor)who is a small time con-man being\ninterrogated by U.S Customs Agent Dave Kujan(Academy Award nominee\nChazz Palminteri) over an incident that takes place near a shipping\nyard in Los Angeles.The film has a great ensemble cast to it with the\nlikes of ,Stephen Baldwin,future Academy Award winner Benicio Del\nToro,Kevin Pollak,Gabriel Byrne and Academy Award nominee Pete\nPostlethwaite.It also won the Best Original Screenplay(Christopher\nMcQuarrie) and was directed by Bryan Singer(X-Men)Bravo to all those\ninvolved in a spectacular crime classic like The Usual Suspects!\n"},
{"review": "\nThe film \"the usual suspects\" is brilliant by means of many different\nfacets of film making; and brought together perfectly to comprise one\nof the most historic and critically acclaimed films of all time. To\nstart, the plot alone is intelligent and baffling, so much that the\ngeneral public is challenged to piece together a seemingly surrealistic\naccount of mystery and murder. However, there's more to this movie than\njust the mere genius behind the plot. For starters, the cinematography,\nediting, and acting are captured perfectly to not only portray a story,\nbut involve the audience as though they were to experience the story\nthemselves. Additionally, the actors are brilliant and capture each\ncharacter as precise as necessary to accurately forshadow the climactic\npoint of the movie that leaves audiences breathless.<br><br>However, behind the brilliance of the film, the editing, the acting,\nthe storyline, the script, and the cinematography; are the ingenious\nfacts hidden within the movie's composition. The antagonist himself was\nbased off of a real-life serial murderer, whose actions are depicted in\nthe film under alternative pretenses.<br><br>In all, this movie portrays the perfection of cinematography and should\nbe the precedent that movie-makers strive to achieve.\n"},
{"review": "\n\nWarning: Spoilers ahead<br><br>Nicely filmed, with good atmosphere, but a pretty lame plot.  I had the\nsurprise plot twist at the end figured out in the first half-hour:\nstandard\nthing about mysteries is that at least one person is always lying.  When\nyou\nonly have one person telling a story, it's pretty easy to figure out whom\nthat would be.<br><br>But an enjoyable film to watch in any case.  Worth renting, not worth\nbuying.  Definitely not worth its place in the top 250\nfilms.\n"},
{"review": "\nCould anyone please tell me what is so GOOD about this movie???What\nmakes this one of the best in history???<br><br>Really,I wasn't impressed by the acting..only kevin spacey a little,but\nhe doesn't deserve the Oscar!!!.Then,what so COOL about the story?it\nwas obvious!I just can not figure out how a film like this beats so\nmany other magnificent movies that are rated much lower???<br><br>So,the acting wasn't fascinating.The plot was only ordinary,if not\nworse.The directing doesn't bring anything special...it's obvious why\nthis wasn't even nominated fot best picture!!If it was as good as\neveryone thinks,it would had been much more appreciated by the\nprofessionists...<br><br>This is only one of the many movies that tell one of those\nstories(which are all alike)but that got lucky and got some good votes.<br><br>If you enjoy ordinary,not so good movies,watch this USUAL movie\n"},
{"review": "\n...if I didn't have a \"twist\" ending?  \n(SPOILERS, of course.  Read no further if you've not seen the\nfilm).\n  Perhaps I have a short attention span, but I did have some trouble\nfollowing the plot at first. My biggest complaint is that a lot of the\ncharacters were underdeveloped. Most of the people generally did not have\nany traits to distinguish themselves from each other.  I was rather bored.\nWhen I saw this movie I had already heard there was a big \"twist\". So when\npeople were discussing the identity of this Keyser Soze, I couldn't help but\nthink to myself \"hmm... wouldn't it be wild if the cop giving the\ninterrogation was Keyser, or maybe Verbal Kint, or maybe....\".  You just\nfind yourself going through the ropes imagining wild possibilities, and so\nwhen Verbal's leg straightens out and we see his sketched face coming out of\nthe fax machine, it failed to have any impact with me. I'm sure that if I\nhad been unaware that there was some kind of twist in the film, this ending\nwould have hit me a little harder- but I'm skeptical that would have made me\nadmire the preceding 100 minutes much more.  \n   I'm sure if I saw this again, I might find other things to appreciate. No\ndoubt, throughout the movie there must have been clever clues to Keyser's\nidentity that I did not pick up on the first time around.  But would that\nmake it worth it for me to sit through this again? I'll never know, as I am\nnot willing to spend a couple more hours of my life on this movie.  I give\nit a 5 out of 10.\n"},
{"review": "\nThe Usual Suspect is one of those films which tell you that seeing is\nbelieving. Don't get me wrong it was a very good film and I am glad I\nfinally got the chance to see it but with critics going on and on about\nit, they kind of kill the magic of the movie. However that really did\nnot hinder my enjoyment as I decided to treat this just like any other\nmovie. Basic concept of 5 cons on various heist missions until one goes\nterribly wrong and then the authorities try to establish what went\nwrong hearing this from the account of one of the crippled crooks\n(Kevin Spacey). Gabreil Bryne was a excellent in his role as the lead\ncrook and Benico Del Toro was also a stand out performance but we all\nknow that Kevin Spacey was the man who took joy in playing the audience\nlike a piano. A film can start of slow but the ending is the most\nimportant thing in the whole thing and I am glad to say that this\nending was nothing short of a slap in the face.<br><br>THE USUAL SUSPECTS - 8.1 OUT 10 <br><br>THE GREATEST TRICK THAT THE DEVIL EVER PULLED WAS CONVINCING THE WORLD\nTHAT HE DOESN'T EXHIST AND JUST LIKE THAT..... HE'S GONE !\n"},
{"review": "\n\nA fine example of a movie trying really hard to be a Rubik's Cube.  When a\nmovie starts tripping over itself just for the sake of complicating the\nplot--that's when I throw up my hands and say, \"Enough already!\"  It stops\nbeing entertaining and enjoyable and begins to be nothing but a chore.  I\ntried to like this movie, but after being introduced to about 300\ncharacters\nwho all look and act alike (their names even rhyme, for God's sake!), and\nwhen the plot demands that we memorize all sorts of details about each one\nof them to follow the story, that when it stops being fun.  I felt like I\nwas working overtime just to keep up with this mess.<br><br>When the ending is finally sprung, and I thought about it in the context\nof\nthe rest of the movie, it should have all made sense, justifying the\nover-complicated story, but it didn't.  Holes opened up large enough for\nhouses to fall through.  It seemed as if the writer just threw in the most\nunlikely possibility to astonish the audience.  After the maze he leads us\nthrough, it's easy to forget why this doesn't make sense.  It's a real\ncheap\nshot.<br><br>\n"},
{"review": "\nA sole survivor tells of the twisty events leading up to a horrific gun\nbattle on a boat, which begin when five criminals meet at a seemingly\nrandom police lineup. Following a truck hijack in New York, five conmen\nare arrested and brought together for questioning. As none of them is\nguilty, they plan a revenge operation against the police. The operation\ngoes well, but then the influence of a legendary mastermind criminal\ncalled Keyser Söze is felt. It becomes clear that each one of them has\nwronged Söze at some point and must pay back now. The payback job\nleaves 27 men dead in a boat explosion, but the real question arises\nnow: Who actually is Keyser Söze? Roger Ebert wrote: \"To the degree\nthat you will want to see this movie, it will be because of the\nsurprise, and so I will say no more, except to say that the \"solution,\"\nwhen it comes, solves little - unless there is really little to solve,\nwhich is also a possibility.\" The Usual Suspects has the quintessential\n\"twist\" ending and will go down in film history as one of the most\nintelligent films ever made.\n"},
{"review": "\nKevin Spacey is Roger Mint, a con artist who is interrogated by the\npolice following a crime resulting in a fire and several deaths. Told\nby Spacey with a series of flashbacks, the audience must pay close\nattention to the complicated storyline.<br><br>Spacey is at the top of his game as Roger and he is joined by Stephen\nBaldwin, Gabriel Byrne, Benicio del Toronto, and Chazz Palminteri as\nassorted criminals, all with colorful histories of their own.<br><br>The Usual Suspects is impossible to describe in a review without giving\ntoo much away. The only advice I can give to fully enjoy this wonderful\nand sophisticated crime drama is to turn off the phone, put the lights\nout and sit back and concentrate and the payoff is well worth it.\n"},
{"review": "\nThis might be one of those films where all your buddies talking it up\nturns what would've been a solid experience into something of a\nlet-down. A good enough crime saga with some great one- liners and\nseveral sharp twists and turns, it's not something I'd revere alongside\nthe all-timers. I felt like there was too much reliance on name\ndropping and intentional complications, which I guess fits in with the\nbig twist at the very end, but that doesn't suddenly make it excusable.\nTough to follow at many times, with some interesting storytelling\nexperiments along the way; it's a good-to-very good story that often\ngets too caught up in itself.\n"},
{"review": "\nI really cannot believe that this movie has its fair share of bad\nreviews and people who do not know what actually happened and what\nparts were true and what parts were lies.<br><br>The truth, Verbal did recruit the others for the hit on the boat, he\ndid manipulate, trap, and deceive them into thinking they were going to\nhit a big drug deal. What he lied about was the names of people and\nmotives. During his interrogation he tried to tell as little as\npossible and make himself out to be just a pawn in the game. But Dave\nKuyan was figuring things out, and as such Verbal would have to reveal\nmore or feign ignorance. Eg, Verbal said it was about drugs, Kuyan\nfigured out it was to hit an informant. So all the actions from the\nlineup to the boat were real, and the fact that the lawyer picks\nVerbal/Souze up at the end shows this.<br><br>As for the twist, its a good twist, and not one that just comes out of\nthe Blue. There are many hints throughout the movie that Verbal is more\nthan he seems, but these are only apparent second time round. Hints\ninclude, The way Verbal shot the guy in the car despite supposedly\nbeing disabled and not being able to flick a lighter properly. The\nabsolute first scene that shows Keaton about to die, that shows that\nKeaton knew who was about to kill him, the sigh and the way he says\nKaizer implies he realised he got played, should of know better, and\nnow he knows who that person really is. Other hints, Verbal emotion\nwhen he told the story he believed about Kaizer. and also when they\nwere watching the boat he knew specifically that they were speaking\nHungarian.<br><br>So all in all this is a good film, the genius being that everything\nmakes sense and there are hints throughout about Verbal.\n"},
{"review": "\nSince I enjoy praising a great film considerably more than slamming one\nthat I didn't like then I'll try to make it as short as possible.<br><br>When I seen this the first time I was already aware of a central\ncharacter named Kaiser Sose so the question was \"who\"?<br><br>Kevin Spacey enters a police station and the story begins to unfold. In\nthe first 15 minutes or so I, without concentrating hardly at all, said\nsomething out loud.....\"I'll bet Kevin is Kaiser\". Of course I turned\nout to be right. The reason I said it so quickly was.....1.Kevin\nSpacey's performance as a handicap was truthfully completely\nunconvincing. 2.Nobody would ever carry on about things like Barber\nShop Quartets, big time fat people etc., etc. in a police questioning.<br><br>These two ridiculously obvious issues automatically makes the finger\npoint directly at Kevin Spacey.<br><br>This entire film reminded me of (and this is not a put down because it\nwas legitimately brilliant) a scene in The Sixth Sense that was\nperfectly executed comedy relief.....when Bruce Willis does the magic\nshake scene with a Penney to Haley Joel Osment. Later Haley passes on\nthe routine to another kid and that kid responds respectively with\n\"That's stupid, I want my Penney back\".<br><br>This whole movie was one long and dragged out bad joke that was\nseemingly supposed to be serious. That's dumb, I wanted my money back.\nEvery Penney.<br><br>A truly genius handicap performance was John Hurt in The Elephant Man.\nJohn should have received an Oscar but didn't. Kevin received one for\nthis?!<br><br>Not to mention, would anyone really be terrified of Kevin Spacey? No,\nthey simply would not. Even if you didn't figure out that he was Sose\nuntil the poorly constructed \"twist\" ending, I ask again.....\"Would you\nhonestly be terrified of Kevin Spacey?\"<br><br>Tell the truth?\n"},
{"review": "\nI don't get it!!! Why there isn't anyone who jumped out and said it is\na bore? OK, then I shall do it...IT IS A BORE! Of course it is easier\nto admit that the plot is carefully designed, and the performances are\nquite good. Great artists assembled and showed their talents without a\ndoubt. Yet, why isn't someone who could admit that it is quite quite\neasy to identify Keyser Soze was Kevin Spacey? The role he played was\nso outstanding, so different from the rest, so weak and so humble.\nMaybe it is the culture thing...To us Chinese, when this type of guy\nstands within a group of desperate, cool and ambitious people, he\nusually is the culprit, the devil, and the real hero. Evil people don't\ntell they are evil by their face...Why is it so difficult for Americans\nto know it...That's really funny.\n"},
{"review": "\nThis movie is a very, very stylish crime drama, with great acting and\nwonderful dialogue. Dialogue in the David Mamet class, really. And the\nacting, wow, just look at this great cast, and everyone is at the top\nof his game. <br><br>But the weakness is that all this great stuff is subordinated to a very\ntricky surprise ending. The first time you see this movie, the ending\nseems wonderful and delightful, if a bit jarring and confusing. But\nwhen you watch the second time, trying to put all the pieces together\nin the light of the ending, well, it just doesn't work.<br><br>I just wonder why, among all the critics and lovers of this movie, no\none ever points out that the revelation at the end makes no sense. Are\nwe supposed to believe that Verbal Kint made up that long, complex\nstory on the spot, incorporating words visible in the agent's office?\nThat he looked at the bottom of the coffee cup and just chose the name\nKobayashi on the spot? That the whole, elaborate story was an extended\nad lib?<br><br>Absurd. And who killed Edie, and why? The ending is less satisfying\nevery time I see it, but the dialogue, acting, and bravura filming are\nall still terrific. But they are diminished by diminished by the\nending's gross illogic.\n"},
{"review": "\nThe movie was simplistic and I'd already determined who I thought was\nthe real bad guy. However the director and writers thought it would be\nokay to manipulate the story by basically lying to us. The fact is,\nwithout the theatric lies, the story is VERY predictable. And you will\nmost likely have guessed the perpetrator the same as I did, but be left\nquestioning your reasoning until the end when you realize that your\nreasoning was sound but that they showed us false scenes that weren't\npossibly real. <br><br>It's like a kids ploy. He shows you a picture of a tree and says,\n\"Look, it's a tree.\" Then he comes back an hour later and shows you a\npicture of a truck and claims it was the same picture as the tree.<br><br>The plot holes in the movie stem from the ending itself. Without giving\naway the story line, we are told one thing and shown it as a flashback\nto be real. But then the rug is pulled out from under us only to\ndiscover that the flashbacks weren't real at all.<br><br>To me that sucks and ruins the movie. There's a trust that is\nestablished between an audience and the stage, and I feel this movie\nbetrays that trust. How it got so high a rating while insulting the\naudience astounds and bewilders me.<br><br>I cry foul and refuse to give more than a 5 rating for it's overall\nmovie appeal.\n"},
{"review": "\n\nI finally saw The Usual Suspects, one of the staple movies of the current\ngeneration, and I have to say I was disappointed.  It's a good thriller, a\ncut above average, but several major flaws prevent it from being a classic. \nWarning: minor spoilers<br><br>The trick ending, which has been widely praised, is in fact too much a\ngimmick for its own good.  I won't give it away, but I will say that the fun\nthing about twists is that, on repeat viewings, the trick seems obvious. \nHow could you not have realized it?  (6th sense and Dead Again are perfect\nexamples.)  In the case of Suspects, however, there is absolutely no way you\ncould see it coming.  The script was so perfectly engineered to deceive you,\nit's no fun the second time around.<br><br>More problems: too many characters.  I'm not talking about the\ncriminals--they're all great, but the cops.  There are three officers of the\nlaw in the movie--two of which do nothing.  Scenes with them are a waste of\ntime.<br><br>I will give it this: Spacey is great, and certain scenes are very\nintruiging.  But when you find out that none of those scenes mattered, the\nmovie is no fun.\n"},
{"review": "\n\nJust about everyone agrees that the surprise ending to \"The Usual\nSuspects\" is very satisfying, as is Kevin Spacey's performance as the\npathetic yet strangely-likeable Verbal Kint. Unfortunately, I found that\nthere is little else to be enjoyed.<br><br>All in all, the cast's performances were not all that superb. Spacey is an\nexception, but that's nothing new. The story itself is well written, but not\nvery interesting. It's conceivable that the cast would be seen as fulfilling\nthe characters well precisely because the characters themselves are so\nvague. The screenwriter makes sure to lay the idiosyncrasies on thick\nwithout allowing us to know the characters and better understand their\nquirks. Naturally, there's only a given amount of depth that can be\naccomplished in an hour and a half, but \"The Usual Suspects\" still barely\nreaches that.<br><br>So while I would recommend this film for Spacey and the ending, I don't\nthink its worth waiting around for 80+ minutes of ho-hum \"gritty crime\ndrama\" to get to all the scenes where he really shines and where the script\nisn't so dull.\n"},
{"review": "\nFive hoodlums are hauled into a police station in a dragnet roundup of\nThe Usual Suspects that are brought in for questioning when something\nbig breaks. Good chance any one or all could have been involved. If you\nremember in the film The Brink's Job, there is a scene where within a\nday a lot of Boston's known hoodlums are brought in for questioning.\nThe dragnet brought in Stephen Baldwin, Bernicio DelToro, Kevin Spacey,\nGabriel Byrne, and Kevin Pollak. From this motley crew a gang is born.<br><br>Flash forward to several years later when there is a horrific fire on\nboard a freighter where there has been a gun battle with many deaths.\nKevin Spacey managed to survive along with two others of the freighter\ncrew and is being questioned in the police station by US Customs Agent\nChazz Palmenteri and LA cop Dan Hedaya.<br><br>After a couple of other jobs, this crew winds up working for a criminal\nmastermind from the Balkans who is known as Keyser Sose who is known to\nbe so ruthless that the criminal population itself is scared to death.\nThis guy is spoken of like he was Satan himself and of course the\npolice want him big time also.<br><br>I can't say much more because the plotting of The Usual Suspects is so\nintricate and filled with unexpected twists that to spoil this film\nwould be a crime itself. Some here like Stephen Baldwin give their best\nperformances on screen. Kevin Spacey won his first Oscar, this one in\nthe Best Supporting Actor category. The category has me stumped because\nit's his character that's the key to the whole film. The other Oscar\nThe Usual Suspects won was for Christopher McQuarrie for one highly\noriginal Screenplay.<br><br>The Usual Suspects has enough action for those who crave that,\nespecially when we do see the final battle on that freighter and it's\nalso some highly literate dialog for those who appreciate that. It's\nbest compared to that granddaddy of all caper films The Asphalt Jungle,\nit's that good.\n"},
{"review": "\n\nThe more one thinks about this film, the more outlandish it becomes.  To me,\nthis film falls into the thriller/mystery trap.  Create a bunch of cool\ncharacters, throw in a lot of swearing (I guess it makes them seem tougher)\nand then create a story that keeps boxing itself into the corner and then at\nthe end throw in a twist so audacious that the audience in amazement at the\nfilmmaker's arrogance will capitulate.  Well, not me.  I can't believe one\nbit of it.  Bryan Singer gets a good performance from his cast, the\nexception being Kevin Pollak who comes across a someone desperately trying\nto show how tough he is even though he isn't.  The film looks slick and\nstylish but sadly the ending is just too unbelievable to let me recommend\nit.\n"},
{"review": "\n\nLemme start out with what I liked about this movie. Spacey deserved his Best\nActor Oscar, and there were many other good performances as well. The movie\nalso had a remarkable score. As for the plot, well, I enjoyed it at first,\nbut as I thought more about it, I liked it less and less.<br><br>Having seen this movie, I am not surprised that it is #16 on the #250 list -\nnot that I think it deserves this position, but I've begun to recognize the\nvoters' trends. Call me a cynic, but I think that many people vote 10's for\nmovies with plots like this, that are fairly hard to understand, because it\nmakes them feel more intellectual. \"Other people can't follow this plot?\nWell, I can, and I'll give it a perfect 10!\"<br><br>I don't think it's too much of a spoiler to say that this movie has a big\nsurprise ending. But, without the ending, this movie is nothing. It'd have a\n7.5 rating, tops. The movie is a decent crime / thriller without the ending,\nbut there's no way it'd be #16 by votes.<br><br>SPOILERS:\nI guess we weren't really meant to understand the plot, since the ending\nnegates it all. So the only part of this movie worth watching is the last\nfive minutes? I didn't mind the negation ending, but I wish the movie\ncould've taken some time to explain just what was true and what\nwasn't.\nEND SPOILERS<br><br>In any case, it's probably worth your while to experience this movie. But,\ndon't vote it a 10. It doesn't need a higher rating.\n"},
{"review": "\n\nThis is a movie that is too smart for its own good.  Everything in this film\njust seems so cocky self indulged.  The plot is too confusing, and it has\ntoo many characters.  The only part that took my breath away was that final\nline from Kevin Spacey.  I dont believe this is like #10 on the top 250,\nthat is way, way to high. I give it a 5.\n"},
{"review": "\n\nPeople find so much in good in this film. How? I've seen it several times\ntrying to find something that pleases me but I haven't! I have seen\nmasterpieces of cinema that I thought were brilliant and here, The Usual\nSuspects is on the top 20 of the best films for IMDb! What am I missing? The\nscript was nothing spectacular! It was slightly above average as was the\nacting. Granted, Spacey's performance was good, but the supporting\ncharacters were nothing special at all. How did this film win two Oscars?\nPeople who found this to be a masterpiece should watch more films. If you\nhaven't seen it and are wondering what all the fuss is about, it's nothing\nat all. This film is ridiculously overrated, most overrated film of the\n90's, I'd dare say.\n"},
{"review": "\n\nI don't like this movie. I think it's extremely boring. The first time I\nsaw\nit I just kept on thinking \"When is something actually going to happen?\"\nMost of the movie they just talk and talk. The ending is fine, but the rest\nof the movie cannot at all stand up to it. I guess the director and\nscriptwriters had a very bad day when they decided to make this movie. That\nday they made a mistake - the movie should never have been\nmade.\nMy recommendation: don't see Usual Suspects, it's a complete waste of\ntime.\n"},
{"review": "\n\nPeople find so much in good in this film. How? I've seen it several times\ntrying to find something that pleases me but I haven't! I have seen\nmasterpieces of cinema that I thought were brilliant and here, The Usual\nSuspects is on the top 20 of the best films for IMDb! What am I missing? The\nscript was nothing spectacular! It was slightly above average as was the\nacting. Granted, Spacey's performance was good, but the supporting\ncharacters were nothing special at all. How did this film win two Oscars?\nPeople who found this to be a masterpiece should watch more films. If you\nhaven't seen it and are wondering what all the fuss is about, it's nothing\nat all. This film is ridiculously overrated, most overrated film of the\n90's, I'd dare say.<br><br>**1/2<br><br>    \n"},
{"review": "\nI am going to guess that this is another film people either really\nliked a lot or were very disappointed in. With a surprise ending, it's\none you have to see more than once, and even then your opinion might\nnot change, even when you know \"whodunnit.\"<br><br>This is yet another story told almost entirely in flashback. The best\npart of the movie was the acting. Gabriel Byrne, Kevin Spacey, Chazz\nPalminteri and Stephen Baldwin make up a good foursome for this story\nand are interesting to watch play their parts.<br><br>This is more of what I would call an \"intriging\" rather than a\n\"satisfying\" movie. It's decent but c'mon, let's face: it doesn't live\nup to its \"hype.\" To call it a \"masterpiece,\" etc., is a bit of an\noverstatement.\n"},
{"review": "\n\nYeah, the film has a very neat ending, real neat. However, in the scheme\nof\nthings, what else does this film have? Not much. This was one of those\npretty good films that gets tagged with the \"Great\" label, all because it\nis\na little different from the mainstream crap being turned out at Studio\nCity.\nThis is not an epic film, I am sorry. Spacey was good Byrne was good and\nthe\nending was clever, but if you take a long hard look at the whole film, you\nwill see average movie making. I just don't see the greatness in the\noverall\nfilm. Now \"Frailty\", there is a movie that improves on what this film\nwanted\nto be.\n"},
{"review": "\n\nThe Usual Suspects is one of those movies that you expect to be good because\nall your fiends say it's good.  People are afraid to say how lousy this is,\nbecause their friends will get on them.  But I will say it.  #1, Stephen\nBaldwin is in it...so how good can it be?  #2 Kevin Spacey is a criminal. \nHe lies to the police and makes up a story to cover his own butt.  The cops\nhave busted him, and instead of confessing, he makes up a lie about the\nKaiser.  This movie is considered original? A criminal lies to the police?? \nTHAT is so original?  It happens every single day, people!!!  I can't\nbelieve so many people like this movie.  It's about a crook who lies to the\ncops...like there's something original or shocking about that.  Think about\nit.  Do you really like this movie because of Stephen Baldwin and a man\ntelling a lie, or do you like it because you know you're supposed to like\nit...\n"},
{"review": "\nThe Usual Suspects is one of the best movies ever made, but you won't\nknow that until the final credits roll. While there are many good films\nthat possess the potential to be great but whose ending diminishes\ntheir story and film quality (Chinatown, for example, in this genre),\nthe Usual Suspects is one of those rare ones whose quality and film\nscore actually both elevate due to its ending. All in all, you have a\nfresh, original, and incredibly unique film that still twenty years\nlater separates itself from all others in its genre.<br><br>Everybody likes a mystery, and The Usual Suspects easily has one of the\nbest endings of any movie ever. The first time I watched it, I thought\nit was pretty good but nothing too special, but the ending was so fresh\nand original that it immediately became one of my favorite movies ever.\nRewatching it, you appreciate the story and acting even more, and the\nending never fails or disappoints due to the amazing editing and\nmeticulous unveiling of the mystery. For me, this is an easy 10/10\nbecause it's a well made movie that is totally different, original, and\nnothing was truly made quite like it before it or since.\n"},
{"review": "\nKevin Spacey's storytelling defines the wits to his clever character as\nit slowly develops his elaborate statement. Verbal is interrogated as\none out of two witnesses to a ship dock massacre. His labyrinthine tale\ndescries the mysterious Keyser Soze as eliminating close to 30 people\nin this horrific event. As time tells and as evidence builds the killer\nstarts to show as tip after tip are uncovering the layers of deceit\nbrought into account...Near the end of The Usual Suspects, Spacey, in\nhis Oscar-winning performance as crippled con man Roger \"Verbal\" Kint,\nsays, \"The greatest trick the Devil ever pulled was convincing the\nworld he didn't exist.\" This may be the key line in this story; the\nfarther along the movie goes, the more one realizes that not everything\nis quite what it seems, and what began as a conventional whodunit turns\ninto something quite different.\n"},
{"review": "\nSometimes the sum is greater than the parts. The parts are good, but\nwhen it all comes together, and fits, just right, there's something\nmore. The Usual Suspects might be the perfect example of this. Nothing\non its own stands out. But together, all the pieces fit.<br><br>Told in flashback by Kevin Spacey, the audience follows the events\nleading up to a shoot-out and massacre on a boat. Following a group of\n5 criminals (alternating lead between Stephen Baldwin and Gabriel\nByrne) from job to job, the plot is told straightforward but lays down\nlayers of dense intricacy and relationships. The story becomes\nincreasingly revolved around the mysterious legend, Keyser Soze.<br><br>At its heart The Usual Suspects is merely a mystery told incredibly\nwell. No scene is wasted- the film is tightly paced at just over an\nhour and a half- and the characterisation comes through immediately.\nKevin Spacey's purposefully monotone voice-over is often merely\nexposition, but the framing device and the dialogue make it work\nwithout ever seeming dull.<br><br>One should take a moment to bring up the dialogue, which is actually a\nlot better than many give it credit for. While the screenplay is better\nknown for how it comes together at the end, the whole script is full of\nwit and slick lines. McQuarrie is well deserving of his Oscar.<br><br>Yet one cannot really do a review of The Usual Suspects without\nreference to the ending. It's a film that relies on its ending to\nenhance the rest of it. Previous scenes have more meaning, and its\ncleverness becomes apparent. The main criticism one can see is if the\nending is spoiled (which given its infamy is increasingly likely), it\ncan neuter the impact.<br><br>Aside from that, The Usual Suspects does no wrong. A giant puzzle with\nsatisfying parts, which when complete reveals a jigsaw masterpiece.\n"},
{"review": "\nI don't see the killer joys of this mystery and genre destroying film\nmasterpiece, to quote a few rave reviews here. Verbal was obviously\nlying and he was obviously the killer early on. I have no problem with\ncamera lies, as one person put it. Because something is filmed is no\nguarantee that it is the truth. This is fiction, anyway. I love David\nLynch and he certainly likes to lie with his camera. No, I don't mind\nthat Verbal was lying. It was obvious that he was the main mover, but\nthere was no motive for his killing of the other 4 and the crew. I\nsuppose they must have done him wrong somehow. But since Verbal is\ntelling his tale to someone obsessed with another character, we\ncouldn't know his reasons without breaking the narrative. The acting\nwas obvious, too. I mean, it seemed acted, not natural, esp Spacey. I\nsaw him in one good TV movie, but since I have been amazed at his\nStreep-like obvious acting. All the ticks and verbal hiccups learned in\nconservatory, kinda reminds me of Day Lewis, another actor whose charms\nelude me. Put that Method away, boys! The others are passable, but\njust. I can see why this film is popular, why some people love it; what\nI can't see is why this film is considered the 23rd best film made. I\nthink some people need to see some more films. Well, Inception is\nfairly high up there too, so the only twisted conclusion I can make it\nthat lots of people need to see lots more films before they start\ngiving out 10 stars here. Maybe we should make it like figure skating:\nonce you give a 10, you can't give it again.\n"},
{"review": "\nDeath and mayhem comes to the docks. The police picks up Verbal Kint\n(Kevin Spacey). In the interview, he recounts the events leading to the\nhavoc at the docks. The crew meets at a sketchy line up after a truck\nrobbery. They start working together until they are contacted by the\nmysterious Keyser Söze.<br><br>This is densely packed crime drama. For most of this, the audience is\nworking hard to keep up with the characters and the story. It all makes\nsense but every once in a while, something sounds suspicious. When I\nfirst saw it in the theater, more than once it left me scratching my\nhead. Then the twist comes, blows my mind, and explains all the\nsuspicions I had.<br><br>The five men crew is played expertly by Kevin Spacey, Gabriel Byrne,\nKevin Pollak, Benicio Del Toro, and Stephen Baldwin. They are all\nacting at the top of their games. They needed to be great to sell this\nnoir crime drama. This is one of the best.\n"},
{"review": "\nLike most people who have recently watched the movie, I expected a big\ntwist at the ending. I was feeling somewhat disappointed at how obvious\nthe initial twist was however when the final twist occurred, revealing\nCostner as the villain, it made me totally reassess the movie into\nbeing one of my all time favourites.<br><br>There were so many classic scenes in the movie that it would be\nimpossible for it not to be in anybody top 25. The way the officer\nrealised what Soze had done to him was classic. As an audience, we\nrelived the movie in a few shots as we pieced together Soze's fake\nstory and it all came together so brilliantly. Fantastic\n"},
{"review": "\nBryan Singer directed this twist-laden story about Verbal Kint, a\nsuspect(Kevin Spacy, excellent) found at a massive boat explosion being\ninterrogated by a detective(Chazz Palminteri) about his involvement. He\nclaims to be innocent, and the real mastermind named Keyser Soze was\nbehind it, a man he is deathly afraid of. He then tells the story of\nhow this began, when he was in the police lockup with other con\nmen(played by Gabriel Byrne, Kevin Pollock, Stephen Baldwin, and\nBenicio Del Toro) who become involved in a revenge scheme that goes\nwrong...<br><br>Quite original and unpredictable film is well acted and written,\nleading to a supremely well crafted finale...only negative is that,\nwhen all is said and done, you're not quite sure what to believe, and\nthere is hardly anyone to care about. Still, an engrossing film noir\nexperience.\n"},
{"review": "\nYes I said it and can careless if you disagree. It's called an opinion\nand reflects my beliefs and not yours. <br><br>The film has a bunch of interesting characters who do a good job in\nfilling the role they were assigned to but still not enough to call the\nfilm a masterpiece. Or maybe it was the \"twist\" ending that made the\nmasses officially fall in love with the film. Reading various reviews\nfrom different websites only further confirmed why people loved the\nfilm. <br><br>The film involves a man named Verbal Kint telling a story to an\ninterrogator about events that led him and four other men to a Los\nAngeles port where a massive fire and deaths had taken place. As well\nas the mysterious man Keyser Soza who is the man who commissioned their\nwork. <br><br>Maybe the ending did not catch me off guard or changed the way I felt\nabout the movie which is why I can't call it a masterpiece or the\ngreatest movie ever made. The film is a 7/10\n"},
{"review": "\nThis is a great movie, lots of twists and turns. Kept you guessing till\nthe end. I saw this movie years after it came out and was surprised\nthat the ending was never leaked out I was very surprised to find out\nat the end of the movie Verbal's true identity. A lot of well known\nactors were in this movie. Kevin Spacey did a wonderful performance.\nKevin Pollack had a few one liners that were funny- his stand up act is\nvery good. I thought it was hilarious when Pollack called Spacey peg\nleg. I really enjoyed the interaction between Stephen and Benico. They\nhave good chemistry with one another. Chazz did a great job as the\ndetective.\n"},
{"review": "\nOne month ago, I was at work finishing some boring reports. After\nfinishing them, I surfed the web in order to find really good movies I\nhaven't watched yet; more precisely on IMDb, when I checked the IMDb\nTop 250 list out . I knew most of the movies, at least I've watched the\nplot, nevertheless this didn't happen with Usual Suspects, I have never\nwatched a trailer or read some synopsis\u0085Nothing. Therefore I rented the\nmovie which from my point of view started kind of slowly. Afterwards, I\nhonestly felt confused about the combination of scenes in different\ntimeline; you need to pay close attention to the unexpected and subtle\nmovements on the storyline. Suspense, tension and psychological terror\nmight be the exact words to describe this masterpiece, tangled story\nwith several important characters whom cannot be ignored, with the\nmasterly performance of Kevin Spacey who totally deserved the Oscar for\nbest actor. You must stay hooked up to the screen because this film has\nin my opinion the best movie ending of all time. Only thing that sucks\nabout this movie is that you can only watch it for the first time once.\n"},
{"review": "\nThe Usual Suspects your typical let's twist the tale around to keep you\nfrom guessing who's doing what. You get criminals who catch criminals\nin a bind to get them to do a coup for them. Nothing new.<br><br>The story is interesting and keeps you attentive. The action is nice,\nbut tame by today's standard. The plot is not too complicated, if\nconfusing at first.<br><br>However, the lines the characters feed us are a little too slick, and\nsome of the acting is a bit over done, especially on the part of Chazz\nPalminteri and Stephen Baldwin. Benicio Del Toro is unfortunately not\nat his best, while Kevin Spacey presents the top performance of the\nlot, and the rest of the cast gives only an acceptable one, but not\nmuch better.<br><br>If you like criminal intrigue, you probably will like it.\n"},
{"review": "\ni read about this film here-downloaded it n watched last night..<br><br>first few minutes i felt its boring...!! but movie picked up well after\nsome scenes n i hooked to it... when we see-hear-read something\nsentence called suspense we hope to see it really its suspenseful??<br><br>here too it happened n i really enjoyed a movie which is in real term\nsuspenseful..very gripping..entertaining...n i must confess best movie\ni watched in recent times...<br><br>the climax is really interesting and am sure u'll laugh..y? because its\nnot he-who v thinking he might be....!! best climax....!!<br><br>its the story writer who should take the credibility of suspense\nfilm...<br><br>the same guy(Christopher McQuarrie) behind new release jack\nreacher-2013 tom cruise in lead-another best suspense film...<br><br>i felt after watching some Hollywood movies i should watch them in our\nnative language-so i downloaded it in Hindi dubbed n enjoyed it...<br><br>its really good movie,n if u watch it sure u wont regret... then why to\nwait? go n watch it now...<br><br>happy watchingaaaaaaaaaaa..<br><br>i give it 10/10\n"},
{"review": "\nThe Usual Suspects is a movie which works first and foremost on an\nintellectual level and it is a riddle to be deciphered. This film is\ndirected by Bryan Singer and the main characters such as Stephen\nBaldwin (Michael McManus), Gabriel Byrne (Dean Keaton), Benicio Del\nToro (Fred Fenster), Kevin Pollak (Todd Hockney), Kevin Spacey (Roger\n\"Verbal\" Kint), Chazz Palminteri (Agent Dave Kujan) and Pete\nPostlethwaite (Kobayashi the henchman). The film begins on a ship were\nan unidentified character seems to have shot Keaton (Byrne) and then\nsets the ship on fire. The police arrive on the scene to investigate;\nthe police officer reveals there are only two witnesses, a cripple and\na hospitalized Hungarian. As cripple survivor Kint (Spacey) is waiting\nto post bail agent Kujan (Palminteri) wants to hear the story from the\nbeginning. Flash back to six weeks earlier, in a police line-up of five\ncriminals who are hauled in and put together into a holding cell\nbecause they are the usual suspects. While in the holding cell they all\ndecide to do one last job together to get some kind of sweet revenge.\nThe heist is only a stepping stone to another job which soon turns into\na lot of twist and turns, only to find out they are working for a\nlawyer name Kobayashi (Postlethwaite). The five criminals are roped in\nbecause at one time or another they betrayed the mysterious Keyser Soze\nand does he get his revenge on them. The main theme is trying to reveal\nwho is Keyser Soze, do we the audience unravel the puzzle of who this\nmysterious Keyser Soze really is and do the police unmasked him. I feel\nas if the director matched the perfect actors to there characters. If\nyou like mystery, puzzles, twist and turn, this is a movie for you.\n"},
{"review": "\nExcellent movie, one of my favorites. The funny thing is to see the guy\nwho directed this jewel, today is on mediocre superhero movies, but\nhere we have a beautifully presented complex history (awesome script\nwrote by McQuarrie), the whole film seems somewhat predictable, which\nmakes the conclusion (one of the best I've seen) more surprising,\ntaking two switches quickly, pretty confusing. I must say I hated the\nway is filmed, I think it was an interesting attempt but extremely\ntedious, very similar to the 80s detective series. Of course is\nimpossible not to love the work of Kevin Spacey, he knows perfectly how\nto perform his character, it appears to be written to fit for him: the\nstupid unknown racketeer whose personality for some reason remembers me\nSheldon Cooper (at the beginning, at least) and well ... then we all\nknow what happens. Finally, it leaves a memorable quote, one of the\nbest of the 90s movies: \"The greatest trick the devil ever pulled was\nto convince the world he didn't exist.\"\n"},
{"review": "\nTo be honest I thought this film was good up until the last ten\nminutes, thats when it became a great film. The preleptic techniques\nused was amazing so that by the end you are just as fooled as the\ncharacters in the story.<br><br>Spacey's performance was excellent you really don't see the ending\ncoming as a viewer it really comes right out of the blue, this film by\nthe end is something so complex and really makes you think, without\ncompletely exhausting your mind it creates a paradox that I don't think\nanyone could figure out by the end. <br><br>Yes, you are left with a few questions at the end, but thats the beauty\nof this film, as the case just ends in the film, the police are left\nand so are you as a viewer, however they don't leave annoying small\nlinks it instead ties up the main storyline well. It is truly an ending\nthat is mind numbing and something that other films should definitely\ntry to replicate.<br><br>The story is so intricately written and portrayed that it is amazing to\nwatch, and I noticed that the complexity of shots improves as the film\nprogresses and the team venture into larger operations, yet even still\nIm left with the feeling that I could watch it again, and not see the\nending coming again.<br><br>Only negatives were for me the police investigation which proved to be\ncompletely irrelevant to the storyline, and so can be seen as a\nhindrance, but the rest of the film makes up for this.<br><br>Intricate Storyline, complex but is made amazing by its ending.\n"},
{"review": "\nNumber 28 on the list of the top 250 to watch, from the 90's, a superb\ncast - of course I had to watch it.<br><br>I was so enthusiastic about the movie and then for about an hour it\nfollows such a slow pattern, nothing is being added on to but a top\nnoch performance of the cast so I click on its reviews and see some\nreally bad ones which is weird as this is not one of love or hate me\ntype of movie work!A classic can't ever get overrated. <br><br>It has a blowing mind final not to be expected and pushes up it's score\nup to the limit.<br><br>I am a girl born in 86 and loved the movie- love the city in the 90's,\nlove Spacey's performance, love del toro performance which seems quite\nirrelevant as an over all role but it's perfectly executed.<br><br>I believe the movie was played to be though of \"ok another ordinary\ninside job movie\" although is clearly an very intelligent classic.\n"},
{"review": "\nThe Usual Suspects is not only incredibly well written, filmed and\ndirected but is incredibly exciting, it builds up slowly to the ending\nthat will go down in history for one of the greatest twist endings ever\npulled off in such fine fashion. Then we get on to Kevin Spacey, now\nthis acting is superb, it's real, funny, just so fine, No wonder Spacey\nwon an Oscar for his role as 'Verbal' one of the five usual suspects,\ncaught up in a crime ridden life.<br><br>This truly is the best of the best. The ending is done with such class\nthat nobody can deny or fight. Left me shocked as the end credits\nrolled up the screen. An instant classic.<br><br>CERTIFICATE OPINION: 14+<br><br>9.7/10<br><br>VERDICT: A masterpiece, Spacey is brilliant. Prepare to have a new\nfavourite film.\n"},
{"review": "\nRarely does a film of any genre rise to the level of perfection\nachieved in The Usual Suspects. The ultimate goal of any whodunit is to\nkeep the audience guessing right up until the very end, perhaps even\nnever quite answering the question with absolute certainty. This movie\nhits the proverbial bullseye with mind boggling precision. Someone\njacks a truck loaded with guns in New York City but police have no\nleads. So they bring in five of the Big Apple's best known thieves to\nshake the underworld's tree. But unbeknownst to the police, or our\n\"suspects,\" there are greater forces at play. When it's all said and\ndone, LAPD, NYPD, and the feds are left sifting through an abandoned\ncargo ship in an L.A. harbor with lots of bodies but not much else. All\nthey have to go on is the shaky story of a talkative small-time crook\nnamed Verbal Kint (Kevin Spacey, who won an Oscar for best supporting\nactor for the role), and a dying victim of the shootout who claims to\nhave seen the devil incarnate on the ship, a legendary criminal kingpin\nwhose name sends shivers up the spines of police and lawbreakers alike.\nIt may not sound like much, but every aspect of this film comes off so\nastoundingly well, from the morose cinematography and foreboding score,\nto the impeccable performances by its stars (Spacey, Gabriel Byrne,\nStephen Baldwin, Kevin Pollak, and Benicio Del Toro as the \"suspects\"\nand Chazz Palminteri as the federal agent trying to piece their story\ntogether), The Usual Suspects concludes with a classic stunner that\nonly adds to its reputation as one of the greatest crime dramas ever\nfilmed, if not the best ever.\n"},
{"review": "\nFrom the witty title to the execution of the plot, I am amazed and\ntruly bewildered by this story's beautiful bait. After watching this,\nyou will realize the value of thinking out-of-the box.<br><br>I love each character, they all gave justice to their roles as\n'felons'; Each surprised me with their wits and their weaknesses, too.<br><br>If you want a beautiful bait, a forward-thinking suspense and thriller,\ncount this movie in. The plot is brilliant so as the script, I had to\nre-watch it and see where did I miss. It is fast, it is witty and it\nwill need a nanosecond speed-of-light mind to solve this puzzle. You\nwill never get bored with this one I swear.\n"},
{"review": "\nI remember when I saw the movie for the first time. I was about 13 or\n14 years old. My brother and I watched free TV it was Saturday evening.\nWe were zapping around till we came on the channel were \"The Usual\nSuspects\" were running. At this time i liked Thrillers and now i love\nit. So we watched it and enjoyed it from the beginning -- Till the\nending came and we were astonished. From them I checked always the the\nTV Channels if the movie comes again. But i just saw it once on Free TV\nabout 4 years later. After it i bought it on DVD and till today i\nwatched it over 50 times.<br><br>For normal viewers it is just a normal thriller with gangster nothing\nspecial so the most of my friends never seen this movie so far. I told\nthem a few times to watch it but never did. I don't care.<br><br>It also was when the first SCARY MOVIE came to the cinema and they\nimitated the ending from the Usual Suspects. You can believe me. The\nCinema was stacked. But I was the only one who comprehend the ending.\nThat was really awkward. <br><br>Just to say. Everyone who saw this movie, loves it. He knows the name\nKeyser Soze. The movie is cult, it is legendary and for me the best\nmovie ever.\n"},
{"review": "\nThere are so many things about this movie that were just amazing. To\nstart off were the performances. Every actor played their roles amazing\nand were flawless with their acting (especially Spacey and Del Toro).\nThis could be Kevin Spacey's best performance and very much deserved to\nwin best supporting actor. The ending is possibly one of the most mind\nblowing, unsuspecting, and by far the greatest thing in all of movies.\nYou get told all the information but then all of a sudden the writers\nthrow a right-hand and knocks you right off track. My jaw dropped and I\nwas speechless after watching this. If there was something that could\never top this movie it deserves to win every award that has ever been\nmade. There was too much that was thrilling, suspenseful and jaw\ndropping that is worth every minute of your life. Now it's\nunderstandable why I could watch this movie 15 times and never get\ntired of it!\n"},
{"review": "\nCan this movie go better?I don't think so!Perfect plot, there are no\nsuch words i can describe this movie!I am 36 years old, and i have\nwatch at least 3 movies every day for the last 20 year!The best\nperformance EVER!Kevin Spacey is amazing, well deserve movie award!How\ncan someone be so perfect?Watch this movie and you will see!The\ngreatest trick the devil ever pulled was convincing the world he did\nnot exist. And like that... he is gone.I don't understanding how can\nsomeone rate this movie with only one star???You people need to stop\nwatch movies!If you don't like someone, please turn your head on the\nother side, but don't disrespect the greatest performance ever!Well\ndeserved 2 movie award ever!Perfect plot and far more perfect\nsupporting role award EVER!\n"},
{"review": "\nThe Usual Suspects. The name didn't interest me and so did the cast.\nBut I wanted to give it a try as it was a crime movie. Generally, I\nnever watch a movie more than five times even though if its perfectly\nmade and this movie is an exception. I have watched it completely for\n23 times and I still long for more.<br><br>Firstly, all the actors put up a brilliant performance. I have never\nheard of Kevin Spacey before in my life and after watching this movie I\nhave become a revered worshiper of his. Ah!, how he acts through the\nmovie. It's pleasing to see him act and when the Final twist is\nrevealed one will definitely applaud for his wonderful, stunning\nperformance.<br><br>In fact this little movie houses the best Climax EVER in history.\nStrictly speaking this movie can only be enjoyed after repeated\nviewing.<br><br>Pete Postlethwaite is brilliant as Kobayashi, Keyser Soze's aide.\nGabriel Byrne, Chazz Paliminteri and Stephen Baldwin put up a memorable\nshow.<br><br>The revelation of the story is simply super. The way the story unfolds\nfrom a normal crime thriller to a great master-piece should simply be\nseen. In fact, this is one movie where the power of the villain is felt\nwithout actually filming or portraying the villain in action. A great\nmovie to be watched and in my opinion its the best movie ever made!!<br><br>Hail!, The Usual Suspects!! A perfect ten on ten!!\n"},
{"review": "\nA fun and violent puzzler set in the criminal underworld.<br><br>Gabriel Byrne, Stephen Baldwin, Kevin Spacey, Pete Postlethwaite and\nChazz Palmentieri make up the cast of this twisty-turny thriller that\nkeeps one foot in the world of Martin Scorsese and the other planted\nsquarely in film noir. It's the kind of movie that garners a cult\nfollowing (which it has) and that's better enjoyed if you know nothing\nabout it. There's a big surprise ending (one of the most famous in film\nhistory) that will spoil the film if you know it beforehand. In fact, I\nwonder if the film would hold up as well to a second viewing once you\nknow what's coming.<br><br>Received Academy Awards for its screenplay and for the performance of\nKevin Spacey, before anyone realized that Spacey would just deliver the\nsame sardonic performance in every movie he'd make from that point\nforward.<br><br>Grade: A\n"},
{"review": "\nAlthough Bryan Singer has directed some pretty good movies (X-Men, X2,\nValkyrie, Apt Pupil), nothing comes close to this masterpiece. The\nintricate storyline follows a cop (Chazz Palminteri) trying to solve\nthe mystery of the identity of a mysterious and very feared Keyser\nSöze. The suspects include a strong cast consisting of Stephen Baldwin,\nGabriel Byrne, Benicio Del Toro, Kevin Pollack, and Kevin Spacey. The\nfilm is strong in every area: soundtrack, sound effects, visual\neffects, etc., but its legend comes from its superb writing, both in\ndialogue and plot. This is a very fun flick to watch time and time\nagain and is probably necessary to watch more than once in order to\npiece together the complicated mystery.\n"},
{"review": "\nAll credit to Bryan Singer!! Without doubt his best film so far..\nWaiting on Valkyrie by Bryan due for release may be in 2009.. Hope that\nwill be a blast too.<br><br>On watching \"The Usual Suspects\", you should take note of each scene\nthat goes by.. Else you ll have to go through the second time to make\nsome sense of the end. Singer stands out with the best on this...<br><br>Kevin spacey is the standout performer in this movie... Even though\neveryone else chips in and plays their roles flawlessly.... This should\nhave been Spacey's best performance except for \" The life of David\nBale\" which i was privileged to watch most recently...<br><br>This movie is certainly one of the best in the 90's.\n"},
{"review": "\na very great film . contains so much twists and turns u wont believe.\nThe only main thing is who is the devil, Kyzer soze. He is keeping his\nidentity secret and playing his games right in heart of the underworld.\nHe himself using 5 brave but misguided and frustrated young men by\nexploiting their weaknesses and compulsions. In the whole movie you\nwill keep on wondering who is kyzer soze in reality and when u know in\nthe end u will be taken aback and shocked , on the other hand u ll also\npraise his genius of deception and elusiveness. This film contains\nsuspense with action in a far better way the stereo type action movies\ncontain. The most inspiring actors are here Kevin spacey and Gabriel\nByrne. Highly recommended , if u like movies , must see it. i believe\nevery one can enjoy the film , it makes one totally absorb in the story\n, u ll always like to know the complexity of the characters in the\nfilm.\n"},
{"review": "\nAfter hearing people rave about this movie I finally managed to watch\nthis movie a couple of months ago. I have to admit it the first time I\ndisliked it, I probably wasn't concentrating. The second time I\nabsolutely loved it. The usual suspect is fantastic twisty thriller\nbacked up by wonderful performances from all the main leads.It seems\nhard to imagine thatthe writer of The Usual Suspects was only twenty\nfour when he wrote it.Kevin Spacey in my opinion completely stole the\nshow. Even though I knew whatthe final twist was it did hinder me from\nappreciating it. What is so amazing is how the writer managed to\nskillfully put in clues that could lead us to a conclusion but the\nreferences are so slight we might not notice it. It seems to have\ninspired other movies with twists at the end that leave your head\nspinning, for instance The Sixth Sense. The Usual Suspects in my\nopinion is the best thriller of the 90's.\n"},
{"review": "\nI saw this film when I was in my last year at sixth form college. My\nbrother had recommended it to me the night before and as I was supposed\nto be revising for my exams, I decided to watch the film. Before\nwatching this film, I had never really sat at the edge of my seat all\nthe way through a movie: I did with this one. I was hooked from start\nto finish. <br><br>The film doesn't just have one of the best endings of all time, but the\nactual body of the film is virtually flawless. I have watched this film\nover 20 times and I'm still finding new things in the movie that I\ndidn't pick up before!! Everything about this film was of a very high\nstandard, especially the cast- Gabriel Byrne, Kevin Spacey and Pete\nPostlethwaite to name but a few. <br><br>To highlight what a great film this is, it's been mentioned in many\nscreen writing books as a study case. It has so many twists turns, not\nonly in the storyline but in the relationships between the characters.<br><br>This is a must see film for anyone who loves films, as it really shows\nhow a film should be made.\n"},
{"review": "\nMost movies are like taking the highway from point A to Point B.\nOK...sometimes you do get off the beaten path and take an exit you\ndidn't expect, But it's still point A to point B.<br><br>This movie, however, takes all the back roads, some of them unpaved and\nvery bumpy, some of them narrow and curvy, and some of them downright\nscary! I am not going to give away ANYTHING in this movie, because I\nbelieve it would be a disservice to anyone who hasn't seen the movie\nbefore. I will only say that it's one of the best whodunits I have ever\nseen! Kevin Spacey is spectacular with his understated performance. He\nand the rest of the cast work magic with this wonderful script.<br><br>The cinematography, while not being sweeping vistas, move the story\nalong nicely, and the score is foreboding, without obviously leading\nyou.<br><br>The only reason I didn't give it a 10 is because I figured a key point\nout before it was revealed.<br><br>What that key point is, I'm not going to say!\n"},
{"review": "\nI saw this movie only recently and began thinking absolutely nothing of\nit, it was boring and I had absolutely no idea of what was going on. It\nwas when you found out about Kaiser Sozar that I began to become exited\nwith this movie. From then on to the very end of the movie I realized\nwhy this movie is supposed to be a cult classic. The acting was great\nfrom Kevin Spacey and the movie was interesting and suspenseful. I also\nenjoyed Stephen Baldwins cool character. I also enjoyed they end of the\nstory when they were on the boat with the Hungarian Mafia and all of\nthe mysterious deaths. After that the very ending was just the cherry\non the cake it was overall a great movie and a noticeable cult classic.\n"},
{"review": "\nIt's so pleasing to know that great films are still being made, if even\non an far too infrequent basis. The Usual Suspects please on so many\nlevels its hard to put into words. Bryan Singer comes out of nowhere to\ndirect only his SECOND feature film and hits a home run. While he's now\nquite famous from his work on the X-Men films, what he did with the\nUsual Suspects is far beyond any expectations that could have been\nplaced on him. Christopher McQuarrie (who also worked with Singer on\nhis first film) also comes out of nowhere to write a script so well\nthought out and put together its sad to think he's only turned out an\nindie and Way of the Gun since. And lastly, the cast are terrific. Top\nto bottom (even Baldwin) are great. Benicio Del Toro steals every scene\nhe is in with his awkward, mumbling way of talking. And this really\nmarked the start of Kevin Spacey's ascent into A list stardom in\nHollywood. In addition to his standout performance in this film, he\nquickly followed it with parts in Seven, A Time to Kill and LA\nConfidential. If you're looking for one of the great films of the 90s,\nyou've found it.\n"},
{"review": "\nIt has been one of my \"How on Earth did I miss that?\" movies. Everyone\nhas been telling me about the movie and now after all that fuss I've\nseen it with my own eyes.<br><br>The acting is exceptional. In all sense, it captures the attention and\npulls you right into the action. You feel the whole movie developing\naround you and you understand everything. However in this movie we see\nthat what we do not see is true.<br><br>The scenario is also well built. The notion of power has been widely\ndepressed on us as well as on the characters. There is a story inside a\nstory and it is all about power. And the better thing is, as long as\nyou believe, the power is where your beliefs are.<br><br>This is surely a must-see movie regarding the movie. It is a\nmust-must-see regarding the acting. It is a\nshame-not-to-have-ever-watched-it movie regarding your friends.\n"},
{"review": "\nThis is in my opinion, the greatest movie ever. I have been able to\npredict the end of most movies; my friends have accused me of seeing\nthe movies previously and then trying to show off in front of them by\nguessing the end. But when the end of this movie came around; I was\npacing the floor in front of my TV in total disbelief. I had to replay\nthe ending again, it was that amazing. Everything was there, all of the\nevidence, but it was hidden very well. If there were more movies like\nthis the film industry would not be in as much trouble as it claims to\nbe. If there is any movie you see ever it should be the Usual Suspects.\nAbsolutely great movie, don't rent it...buy it.\n"},
{"review": "\n\n\"The Usual Suspects\" is a thrilling crime drama, filled with suspense. \nKevin Spacey plays Verbal Kint, the narrator of a twisted tale that begins\nwith a police lineup in New York, and ends with a dockside massacre in\nCalifornia.  Behind it all is the mysterious and dangerous Keyser Soze. \nBryan Singer's criminal saga is haunting and clever, and well cast.  Kevin\nSpacey turns in a great performance as Verbal, setting an oddball tone.  The\nrest of the crew is headed by Gabriel Byrne's Dean Keaton, with thugs Kevin\nPollack, Benicio Del Toro and Stephen Baldwin along for the ride.  This crew\nof five shows great clashing chemistry.  In the end, you'll be shocked. \n\"The Usual Suspects\" has become a new crime cult classic.\n"},
{"review": "\n\nWhen I first saw this movie, I was simply amazed. The second time, even\nmore amazed. And subsequently each time I watch it, I find something\nnew and undiscovered. The joy of watching it with friends who haven't\nseen it only makes it that much more pleasurable. Stories like this\npull you in and make you wonder. They make you think. They make you\nentertained. And that is what we, as a movie audience want--the payoff.\nAll of the wonderful ingredients of a film--the plot, casting,\nlighting, and cinematography make such a gem like this come together\ncohesively. This is the type of film that made me want to be involved\nin the film making process. An excellent film from an excellent\ndirector...\n\n"},
{"review": "\nA group of criminals are brought in for questioning about a crime, but\nfrom the manner in which they are thrown together it is clear - even to\nthe criminals themselves - that something is a-foot.<br><br>A classic example of how different the world of film is to the world of\nliterature. If this was a book the publisher would ask \"how drunk were\nyou when you wrote this?\" Thankfully film has music, acting (the best\nthing here) and special effects to distract the viewer. And this film\ndoes a fair-to-middling job. <br><br>Here we have a film that doesn't so much contain holes, but is more one\ngiant hole. However in this big hole we have various smaller holes! At\nan early stage one of the characters smells-a-rat, but carries on\nregardless! Excuse me, but if you want to present someone as a \"master\ncriminal\" this hardly helps your case!<br><br>Credit other reviewers for going through the nonsense and holes on a\nblow-by-blow basis (although technically a spoiler); but achieving what\nis intended here, through the method employed, is as silly as anything\nI have seen in a serious film. <br><br>Even if you think this film is great - and plenty do - you have to\nagree that it somewhat lacks real-world credibility. It may have a\ntwist ending, but when you have confused the living daylights out of\nany sensible and logical person (and yes I do know flashbacks are not\nalways the truth!) then a song and dance finale wouldn't have made any\nless sense.\n"},
{"review": "\n\nI have to agree with Roger Ebert who gave this film 1,5 stars. It really\ndoesn't do anything except explain to you its complicated and uninteresting\nplot. The much-praised ending isn't clever either, just a nice sample of\nsolid directing. I've seen it twice and the second watch was even more of a\ndisappointment. A few stylish characters are probably enough for some people\nto enjoy this. Not for me.\n"},
{"review": "\nPlot and acting I thought were great, but I feel the accent by the\nfirst suspect that died was a bit exaggerated and difficult to\nunderstand.<br><br>While I did know about the existence of a twist, I was caught off guard\nby the double twist, so I was a bit happy about the surprise.<br><br>Despite this, I feel the premise of the movie was a bit off and merely\nused as a setup to the climax of the film. What kind of person would\nwork so hard to make a convoluted plan to use convicts to help him kill\na boat full of people just so people wouldn't know who he was. And then\nin the end he is so careless as to let one live and also end up making\nit so his identity is revealed to even more people.<br><br>Despite this, the devil line quote was memorable and also the dialogue\nin the rest of the movie. Overall a good movie.\n"},
{"review": "\nSay what you will about this low-budget Oscar winning hit-but if you\nwere lucky enough to catch it initially on the big-screen then you know\nwhat I mean. It opens up with the tail end of a massacre on boat just\nbefore being lit up to flames. We then end up in interrogation room\nwith Verbal Kint (played by Kevin Spacey) telling the cops how he ended\nup on the boat. At this point the movie seems to pick up the events\n(mostly) in the order they happened until those crucial moments on the\nhorrific ship. As Verbal goes into detail how him and four other\nex-cons were wrongfully detained for questioning 6 weeks earlier and\nended up working together 'taking jobs.' There's Keeton (Gabriel Byrne)\nwho is looking for way out and go straight, Finster (Benicio Del Toro\nwho really started his career here literally) whose horrible accent\nbrings a lot of laughs but basically pals around his convict hot headed\nbuddy McMannis(Stephen Baldwin). Then there's Hockney(Kevin\nPollock)whose comedic input serves the tone well especially since he\nreally plays the angry smart ass of the gang. I really don't want to\ntype too much else cause either A most of you know the story even if\nyou haven't seen it or B you've seen it. What I really wanted to say\nabout this movie is that people who don't like it are people who never\nreally got it or people who have not seen the whole thing from the\nbeginning. Yes I said I love this movie and I'll always defend it.\nHowever, the movie holds up the best way in an initial viewing or maybe\n4 or 5 times after that.\n"},
{"review": "\nThere's no way you can have more fun at a movie than The Usual\nSuspects. Sure, some films might come to mind that you have as much fun\nat, but this is as fun as it gets.<br><br>From the first frame to the last, the audience is engrossed in a smart,\nedgy, and exciting crime thriller that oozes with style and brilliance.\nThe performances are perfect, from Spacey to Bryne to Del Toro to\nPollock and even Steven Baldwin, the characters were both engaging,\nfun, and mysterious.<br><br>Simply put, films don't get much more original than this. It is\nentertaining without losing any artistic or visceral edge, a direct\nresult of McQuarrie's genius screenplay.<br><br>Extremely enjoyable, fun, but also smart, artistic and well thought\nout, The Usual Suspects is the most fun you will have without the 100\nmillion dollar budget.<br><br>This is what movies are all about.\n"},
{"review": "\nWhy many people think so highly of The Usual Suspetcs is a mystery.\nI'll give it 6 out of 10 because of some fine performances, most\nnotably Kevin Spacey's, but as a whole the thing is a violence-filled\nmess. The ending simply does not follow from the film and seems to have\nbeen dragged in to resolve a problem that is not all that interesting\nto begin with. The editing is also confusing; without seeing it at\nleast a second time it is hard to make sense of what has happened when.\nThroughout the film we are led to believe that the character played by\nGabriel Byrne is central to the plot, only to discover at the end that\nhe is not. To put it succinctly: this film cheats the viewer. Don't\ntrust the judgment of anybody who tells you that this is a great or\neven a good film.\n"},
{"review": "\nForget M. Night Shyamalan with his plot holes and fall-apart final\nacts, this film has, unarguably, the most well-executed finale of this\nsort, at least of the 90s! Great writing, shuffling time frame to keep\nyou on your feet, details and full scenes that see completely different\nthe second time you see it, and brilliantly played from top to bottom,\nthis is Film Noir at its best! The fact Bryan Singer was a young\nfirst-time director makes the whole thing all the more incredible to\nwatch; you simply can't believe this is the product of a crew healmed\nby somebody so supposedly inexperienced. In his own words, perhaps if\nhe tried to make this now, he wouldn't be able to......so I say, thanks\ngoodness it came to him when it did! To say anything else would be to\nspoil the experience....just see it!\n"},
{"review": "\nthis is not a great movie as the ratings suggest.for one thing u can\npredict the culprit from the beginning itself.secondly the movie is\nfull of lies nothing never happens here or does it.The enjoyable things\nin the movie are benicio del toro and never ever seen performance from\nStephan Baldwin.The build up given for the devil himself Kaiser Sousa\nis huge and greatly makes him scary.The movie never bores or irritates\nu.... the only problem is that i knew what happens in the end.it has a\ntwist in the end which i think made it to the IMDb top 250.Kaiser Sousa\nthe man who has great will......... will stay with u for long but never\nreally understanding who he was.the movie is much over rated, if it\nwasn't for the rating and hype this would have been a better\nwatch.Neglect the rating and watch the movie.\n"}
]