[
{"review": "\nPeter Jackson truly outdid himself when creating the Lord of the Rings:\nThe Fellowship of the Ring and he fails to disappoint us in the 2nd\npart of the Trilogy. The Two Towers shows us that he is not a one-hit\nwonder, like so many directors are. I actually think that The Two\nTowers reaches the same level as the Fellowship of the Ring, and\nsometimes even surpasses it.<br><br>This film is the biggest film in the trilogy. What do I mean by that?\nWell this film has so many things going like the amazing Battle of\nHelms Deep. Frodo and Sam journey to Mount Doom, to destroy the Ring.\nBut the one who's leading them through the way is Gollum, he looks so\ncreepy and realistic, that he doesn't feel disconnected from us. A\npowerful performance by Andy Serkis as Gollum, he should of been\nnominated for an Oscar for Best Supporting Actor.<br><br>The Best part of the film, is quite easily and everyone knows it the\nending. The ending of the battle of Helm's Deep is quite breathtaking,\nand as Gandalf the White comes in the distance with another army to\ndefeat the Orcs. When Treebeard and his army of Entz tear down\nIsengard, the destruction and the battle is so immense in size, that\nyou truly have to see to believe.<br><br>In size and scale, Peter Jackson has truly redefined the word \"epic\"\nand he also pays attention to the small things that truly elevate this\nmovie from great to amazing. I definitely recommend this film to\neveryone, but you really should watch the first movie to truly\nunderstand what's going on.<br><br>10/10\n"},
{"review": "\n\nSeriously, I never thought a movie could get better than the Fellowship of\nthe Ring, but it did. This movie should be #1 on the IMDb top 250. This\nmovie, as long as it was, captivated me from start to finish, and those who\nare not entertained by this movie can not be entertained period.<br><br>Yes, I have read the book. Any chapters cut out at the end of books III and\nIV will probably themselves in the next installment. If you haven't noticed,\nthe beginning of the Two Towers was actually closed the Fellowship of the\nRing on the big screen.<br><br>Gollum was a CG masterpiece. He added some light to this incredibly dark\nmovie. At the same time, there are areas where you feel sorry for the poor\nguy, or just want to kill him. Smeagol was probably the most diverse\ncharacter I've ever seen.<br><br>Elijah Wood put on a better performance than he did in the first movie, as\ndid Sean Astin. Ian McKellen, who captivated us in the last movie,\ncaptivated us even more in this one. Viggo Mortensen, John Rhys-Davies, and\nOrlando Bloom made a great trio. They laughed together, cried together,\nprospered together, and suffered together. This trio gave life to Aragorn,\nGimli, and Legolas. Eowyn expressed her emotions clearly through Miranda\nOtto. <br><br>The music need not be discussed. Its greatness speaks for\nitself.<br><br>Favorite Scene: The Battle of Helms Deep. Possibly the greatest scene in the\nbook, 50% of the trailer, and action packed climax to this beautiful movie.<br><br>The movie, like its predecessor, fails to bring us closure, but that's ok.\nClosure will come next year. I look forward to the Return of the\nKing.<br><br>The Two Towers is now my favorite movie of all time.<br><br>The scale is broken. 10 is not a capacity sufficient enough to hold this\nmovie... my movie... my... precious...\n\n"},
{"review": "\n\nReally, I should probably let this film soak in a bit; I am, after all,\non\nsomething of a \"post-viewing\" high right now. However, at this moment, my\nfeeling remains the same from the first installment - this is the movie\nexperience I've been waiting my whole life for. In case you haven't\ngathered, this movie is visually stunning, literally breathtaking. I mean\nthat, some of the scenes in this film simply stopped my lungs in their\ntracks, shocked at the pure, enveloping beauty of the shot. Peter Jackson\nhas a profound grasp of visual manipulation like few directors have ever\nhad.<br><br>The acting is, as always, superb. Kudos for hiring \"actors\" not \"stars\";\n\"Oscar-worthy\" over-acting could have threatened the realistic touch the\nfilm's remarkable cast supply. Specific mention goes to both John\nRhys-Davies in his well enjoyed comic turn, and very largely to Andy\nSerkis,\nwho was a major role in creating the most realistic and brilliantly\nwell-performed CGI character I've ever seen (Gollum).<br><br>For the most part, and as a fan of the books, I take no offense to the\nslight plot modifications. My understanding is that Tolkien himself\nrealized\nthat visual adaptation of LotR would require a somewhat different take on\nhis work, and was apparently open to such minute changes. There are also\na\nfew tiny bits and pieces I was disappointed to see not make the final\ncut,\nhowever, I'm sure a future inevitable extended DVD will take care of\nthose.<br><br>In short, if you found the continual enjoyment I did with the first movie\nof\nLotR, this movie will in no way let you down. Not even for a\nminute.<br><br>Highly recommended, 10/10.\n\n"},
{"review": "\n\nYes, it's true. Return of the King may have won more of the Oscars as the\nculmination of Peter Jackson's magnificent cinematic achievement, but\nhistory will in fact adjudge \"The Two Towers\" as the greatest of the three\nRings. If Fellowship was a road movie and ROTK was a friendship film, then\nTwo Towers is an unadulterated war movie of heroic proportions. Peter\nJackson said he based it on \"Zulu\"- and we can see why. It has a dramatic\nintensity and flow which none of the other films quite share. Good against\nevil are so sharply contrasted that you could cut your fingers on them. TTT\nalso has the best score Howard Shore has produced. And it has the best\ndialogue.<br><br>The screenplay explains (with barely disguised contemporary resonance) what\nwe are protecting in Western civilisation when we defend ourselves against\nthose who would wish to destroy it. When Sam tells Frodo that there are\n\"some things worth fighting for\", when Merry tells Pippin that there \"won't\nbe a Shire\" unless they do something about it, when King Theoden laments\nthat \"the sun has gone down in the West\" this film could be entitled not the\n\"Two Towers\" but \"the Twin Towers\". It is Miltonic in its scope. It is\ncinema as art.<br><br>Yes, one may quibble about certain Entish details, and I know that the Elves\nweren't supposed to be at Helm's Deem, and that Faramir is a little\nundeveloped, but does this matter? Not at all. The Extended version is\nbetter than the original, but does not need to make such a quantum leap as\nFellowship managed with its EE. However it will be a film that is seen as a\nlandmark in cinema. A trilogy which may never be bettered. And a reminder of\nwhat we are all here for\n\n"},
{"review": "\n\nEvery great adventure story worth telling has a solid hero - someone who\nputs others before themselves and uses their talents to do their best at\nkeeping the forces of evil at bay even if it means the loss of life and\nlimb. At its core, this movie has eight such heroes and each one lives up to\nthe call. From Pippin and Merry, the lost hobbits who aid the Ents in\nbattle, to Gandalf, Aragorn, Gimli and Legolas who held back the hordes at\nHelms Deep to Frodo and Samwise who continue to make their dangerous and\narduous trek to Mount Doom. All of these characters are heroes and they're\nplayed with love, respect and meaning.<br><br>Though the acting in this film was top notch throughout, I found myself\namazed by Gollum's (motion captured body and voice by Andy Serkis) overall\nperformance. Though obviously CGI, there was so much emotion in this\ncharacter that I couldn't help believe he was real! Though \"Final Fantasy\"\nwas the only movie that created the most realistic CGI characters that\ndominated an entire film, Gollum is lightyears ahead with the simple fact\nthat this deformed li'l hobbit seemed human. He had the spark of life behind\nthose eyes that the FF \"cast\" lacked.<br><br>As a film, this movie has it all - action, drama, comedy - but none of it\nwould've worked without characters we cared about, villains we despised and\nheroes we cheered for. With the obvious success of the first two\ninstallments, the release of the final film next December may prove this to\nbe THE BEST trilogy ever made!\n\n"},
{"review": "\nFrom the beginning to the very end, the Lord of the Rings trilogy is\ninteresting and enjoyable. The books and the movies alike grasp one's\nattention as if they were real. You, the reader or viewer, can sense\nthe pain of the characters, their emotions. The trilogy is truly\npowerful on screen. The second movie, however, I believe has something\nthe first and third are missing; it feels like a bridge connecting two\ngreat islands. There is something unique about it that cannot easily be\ndescribed. Metaphorically, the first movie is, say, a soldier. The\nthird movie is the path home from war. And the second movie is the act\nof coming home because it contains the obstacles that must be passed\nthrough before achieving the goal. Although not 100% loyal to the\nwritten trilogy, the movies are done in such a way that the mainstream\naudience and LOTR fans from before the movies came out can say they\nwere enjoyable and well made.\n"},
{"review": "\n\nI considered The Fellowship of the Ring to be one of the greatest movies\never. This one is better!<br><br>The scenery is marvelous, the animations great, and the story superb. This\nepisode strays further from the books when it comes to the unfolding of\nevents, but I feel that it stays closer in atmosphere and realism; the\nnazgûls are now the fear-inspiring creatures they should be. Gollum,\nexcellently implemented, even becomes more realistic then I remember him\nfrom the books, not to mention other attempts to portray him. His\nschizophrenic monologues are among the highlights of the\nmovie.<br><br>The major drawback is once again the apparent incapability of the dark-side\ncreatures. Aragorn with fellows can ride back and forth among them unhurt,\nwhile the Uruk-Hai fall in large numbers just for being nearby. Though I\nenjoy many of the jokes made at Gimli's expense, this still is another thing\nI partly dislike. Gimli sure is no clown in the books.<br><br>I rate the movie 9/10 (my highest so far).\n\n"},
{"review": "\nFor this movie, Peter Jackson was faced with a challenge: how to make a\ngreat stand-alone film when the beginning and ending are in separate\nmovies? He did a magnificent job. Like the first one, this movie starts\nwith a slam-bang battle; however, where the first film had armies, this\nfilm has a clash between two titans.<br><br>From there, the movie builds to the enormous set-piece siege. And,\nalong the way, we meet one of the most interesting characters of this,\nor any movie: Gollum, the complex, torn, schitzophrenic slave to the\nwill of the One Ring.<br><br>And, even more than the first film, the Ring is also a character: the\nviewer can see it wearing down Frodo, pushing him to the limit,\ntempting those around him. The encounter at Osgiliath, while not in the\nbook, is a fascinating visual realization of more subtle themes in the\nbook. I know that, when I walked out of the theatre, I knew that there\nwas only one movie I was looking forward to during the next year, and\nthat was Return of the King.\n"},
{"review": "\nI didn't really appreciate this second installment of the LOTR trilogy\nuntil I watched this for the second time. The key was how I looked at\nthe key character of this film: \"Gollum\" (Andy Serkis.). Once I began\nto appreciate and marvel at this weasel-like character, my opinion of\nthe film went from bad to good. That doesn't mean I like that slimy\ncreature: I don't, but I am more fascinated by him rather than totally\nannoyed as I was with the first viewing. A big reason was that I put on\nthe English subtitles, so I was able to understand everything he said.\nI recommend doing that you has a similar problem deciphering his\ndialog. Now I more fully understood what a tortured soul that pathetic\ncreature was.<br><br>Anyway, this second installment, as in the first, offers a lot of\nfascinating sights and sounds and a nice varied platter of action\nscenes and wild characters. For younger kids, I am to happy to say\nthere is absolutely nothing, language-wise, that would offend anyone\nbut the violence is heavy and brutal at times.<br><br>This is a solid, highly-recommended second installment in the trilogy.\nIt's epic film-making. No, it may not be equal to the first - The\nFellowship Of The Ring - but what adventure story is?\n"},
{"review": "\n<br><br>I have to say this film starting with the fellowship was incredibly well\nmade. I know Titanic received 11 awards but I think this whole trilogy\nshould receive 15. This intro to the trilogy was extremely in depth and even\nhad the best prologue ever. I enjoy being introduced to the characters and\nthier origins and learning about the history of the one ring and how it does\nevil upon middle earth even after Sauron's death. Be patient with the action\nas is picks up as the trilogy's story unfolds. It all depends on what you\nsee movies for. But this whole trilogy has quite a bit of everything. That\nalone surpasses all movies.<br><br>10/10 (actually more than that)\n"},
{"review": "\n\nReally, The Two Towers is the weakest of the three novels, and it is only\nnatural that the middle volume would be a bit of a let down.  Jackson does a\nnice job of trying to lift the story - the battle sequence is fantastic -\nbut to my mind the 10 I might have given for this movie went over the cliff\nwith Aragorn.  I have nothing against Jackson deviating from the books - I\nwas not troubled by the changes in the Faramir character, for instance, and\nadding the Warg riders themselves was a nice touch.  But what was the\npurpose of sending Aragorn over the cliff?  Creating false tension that\nprobably fooled less than 1% of the audience?  Screen time for Liv Tyler? \nAll it did for me was make the movie feel false for about ten minutes.  This\ncrucial mistake is compunded now that we have the Extended Edition and see\nsome of the scenes that were left out of the theatrical release.  the movie\nwould have been stronger without Aragorn's fall, and with, for instance, the\nscene between Boromir and Faramir, or the march of the trees to the Battle\nof Helms Deep.<br><br>Well, so be it.  One or two major missteps in a ten hour movie is not\nunexpected.  On its merits, apart from that, this movie, like the whole\ntrilogy, is a magnificent achievement.<br><br>One question: every time I look, Legolas is shooting dozens of arrows.  And\nevery time I look, his quiver is full.  Where are the arrows coming from? \nElf magic?\n"},
{"review": "\nYou'd think you can't improve on a 10/10 movie, but this one does, with\ngreat action and characters. There isn't much else to say about the\nspecial effects that I didn't already in my first review, they're still\nfantastic. Peter Jackson doesn't treat this like a sequel, it's just\nthe continuing story of heroes battling the forces of evil.<br><br>Frodo, now alone except for his buddy Sam (Sean Astin), is on his epic\njourney to Mount Mordor to destroy The One Ring. He'll encounter\nGollum, a wretched creature who's definitely up to something.<br><br>And meanwhile Aragorn and friends are trying to protect the little\ncountry of Rohan from imminent destruction from the newly-bred\nUruk-Hai, vicious monsters crossed with man and elf.<br><br>4/4. Wish I'd seen it in theaters.\n"},
{"review": "\n\nWhat a great movie. Through the first movie, we already had the whole\nstory set-up, so in The Two Towers in really pick's up.<br><br>There is not one thing about this movie that I would change. Maybe one\nor two of the extra scenes could have been cut out, but they only are\nthere to lead into the sequel.<br><br>This movie really shows the wonders of CGI in full effect. And isn't\nafraid to use them. The battle of Helm's Deep is a blend of live action\nand CGI(computer generated imagery), which works so perfectly and just\ncomes across as astounding. <br><br>The scene's with Aragorn being lost, were not too bad. The lead up into\nthe scene's were great. The scene's show the connection between Aragorn\nand his horse who finds him near the river. <br><br>The further downfall of Frodo as the ring slowly takes hold of him is\nvery well done. Along with this, we also get to see the first more of\nthe attempts of Sam to help, and protect Frodo. <br><br>The breaking into different stories was a cool idea. Showing the\nprogression of the characters from the first film to the second.\nOrlando Bloom's character is givin a larger part. And he proves to have\nmuch to do with the plot this time. <br><br>All in all, this is a fantastic movie. Rivaled only by The Return of\nthe King.\n\n"},
{"review": "\n\nLong before it came out, I knew The Two Towers would be the toughest of the\nthree Lord of the Rings books to put on film. Not only is it the middle\nchild, but the very structure of the book makes it hard to craft a linear\nstory with all the plot lines in tact and interesting.<br><br>But I think Peter Jackson and company did a very good job. It's not as\nstrong as Fellowship, but is still outstanding.<br><br>All the elements of the LOTR films are here: the beautiful photography, set\ndesigns, costumes, scenery, special effects. All amazing, all brilliant, all\nOscar-worthy.<br><br>The performances are terrific, too. Bernard Hill, Viggo Mortensen, Elijah\nWood, Miranda Otto, all did great jobs. The supporting actors,\ntoo.<br><br>It is sad that Ian McKellan's role is relegated to almost cameo status, but\nthat's the nature of the book. The biggest shame is Christopher Lee. He has\nso little screen time in this film, I think he only says two or three lines\non camera, the rest is \"brooding\". Such a waste, he is one of the great\nactors of our time, a real joy to watch (and a scene stealer to\nboot).<br><br>But the stars of the piece have to be Gollum and Treebeard and the Uruk\narmy. The sequence with the Ents seeing the destruction Saruman wrought upon\nthe trees brought tears to my eyes, and their revenge brought cheers to my\nvoice. The battle of Helm's Deep was probably too long, but impressive\nnonetheless (and will probably be the model for \"epic battle sequences\" for\nyears to come). And Gollum. What can be said about Gollum that hasn't\nalready been said. We have entered into a new age of CGI, and, like all\ngreat works of art, it has a human soul.<br><br>A great film. 9 out of 10, the only items keeping it from getting a 10 are\nthe short-shrifting of Christopher Lee and that some parts don't quite flow\ntoo well (a problem rooted in JRR Tolkien's novel, not the fault of the\nfilmmakers).\n\n"},
{"review": "\nThis film is one of the best films ever made. This film is almost as\nbreathtaking as the first film but in the end the minor flaws it has\nmakes it worse than the first film. What I consider to be the biggest\nflaw of this film is the character of Gimli. John-Rhys Davies is a\nwonderful actor and I do not blame him for the way the character turned\nout. I blame it on the directing (shame on you Jackson). Being that\nMerry and Pippin are not as much in the second films they were in the\nfirst they could not act as comic relief. Thus the choice was made to\nmake Gimli the comic relief. While the things he says are both funny\nand well timed it becomes to much by the end. A second flaw that pulls\nthe film down a bit is the fact that they deviated too much from the\noriginal book. The Theoden character is very different in the book as\nis Faramir. These flaws were probably necessary to make the film but\nthe hard core Tolkien fans such as myself were disappointed to see\nFaramir drag poor Frodo and Sam to Osgilliath which is only mentioned\nin the book but never seen. This far I have only focused on the bad\nthings in the film but there are very great film historic moments as\nwell. E.g. the battle for Helms Deep is aside from the battle on\nPelleanor Fields the greatest film battle ever conceived on screen. The\nacting in the film is generally on a very high level. Especially Ian\nMcKellen and Viggo Mortensen do very well in the film but also\nJohn-Rhys Davies and Elijah Wood are very good. Aside from the fact\nthat their roles were not as well written as they could have been\nBernard Hill and David Wenham do very well. The effects in the film are\nflawless and on a higher scale than in the first film and the attention\nto detail is overwhelming. All in all a worthy sequel but ultimately\nthe worst out of the three.\n"},
{"review": "\n\n         The Two Towers is another masterpiece of returning after Fellowship\nof the Ring. This had excellent and brilliant action. Like the Helm's Deep\nbattle which made the 100 best battles of all-time. There wasn't much of a\nstory but who cares, it's Lord of the Rings!!! I loved the sword-fighting\nand the orcs too. This movie gave me chills down my back from the fighting\nand the unforgettable lines. Gollum was so cool and funny. Andy Serkis did\nso well in doing Gollum's voice and the CGI was amazing! The landscape once\nagain was superb. This is another one of my favorite movies. It's not better\nthan the fellowship and Return of the King but was very close and is still a\nsmoking brilliant film. Go LORD OF THE RINGS, BABY!!!!!!!!!<br><br>10/10!!! Highly Recommend!!! You better go see this movie!!\n"},
{"review": "\nIf you are reading this review (or indeed any other) trying to assess\nwhether or not you should watch this film then please read no further\nand just go and slip in the DVD and let the sights and sounds of Middle\nEarth wash over you. Nothing I, or indeed anyone else, can say should\nhelp you to form an opinion prior to watching. I guess the audience for\nthe three films fall into two categories; those who have read the books\nand those who have not. Those who have not, in my experience, tend to\nbe overwhelmed by the absolute majesty of the vision but a little\nnon-plussed by the actual story - seeing it as just some rather dopey\nfantasy; a Star Wars trilogy set in past times for the modern audience\nif you like. Then there is the \"yes, I have read the books\" class who\nin general seem to have a kind of smug arrogance grounded in comments\nsuch as \"they left out too much\", \"its not what I imagined\" or \"Of\ncourse its all an allegory for the rise of the third Reich\". Tolkein\nbemoaned the lack of an heroic mythology for the English people and he\nsought to create one in his Rings trilogy of books. My opinion is too\nhumble to count - but if you want it, I believe he succeeded. The epic\nbackdrop, the heroes and villains, the rich history, the races and the\nlanguages are all utterly plausible as a long cherished story handed\ndown over many generations. Peter Jackson and his team must be\ncongratulated not only for their wonderful realisation of Middle Eath\nand its inhabitants; but for crafting a series a movies that captured\nthe very essence of what Tolkein was trying to achieve. Well done also\nfor leaving out Tom Bombadil.\n"},
{"review": "\nThe battle scenes were awesome but the plot was a little shorter than\nexpected and it is more choppier than the 1st and 3rd Lord of the Rings\n(LOTR). I loved it when Legolas, Orlando Bloom, went on that shield\nlike a skateboard. It was cool. Does any of you recognize Elrond from\nanother movie? Let me give you a hint. \"Mr. Anderson!\" Do you know now?\nFor those who do not know, it is Agent Smith, Hugo Weaving from the\nMatrix trilogy. Other famous LOTR actors are Sauroman, Christopher Lee,\nin the Star Wars Episode 2, and Gandalf, Ian McKellan, plays in X-Men\nas Magneto. Besides Christopher Lee, you notice that some of the good\nguys play bad guys in other movies. Weird huh? There are others but it\nis too many to list.<br><br>The extended version of the Two Towers is way better than the\ntheatrical. It explains why Eomer gets kicked out in more detail. Also\nit explains more about Faramir, Bormir's brother, and their father.\nGandalf explain more about his rank and what is going to happen next\nwhen he returned to Aragorn, Legolas, and Gimili. I thought that the\nGollum singer was little jazzy for LOTR. I liked Enya better because\nshe has such a beautiful voice.<br><br>In the book, LOTR creatures, such as the eagles, shadow fax, the\nspider, and so on talked in the story. I guess Jackson want to make the\nmovie more realistic than book. They did a great job on Gollum. The\nactor had some special juice he drink for that voice. He explains in\nthe special features. I really like the fact that Tolkien made his own\nlanguage out of a bunch other languages and name it elvish.<br><br>I think if you really watch and maybe read the trilogy, you might learn\nsomething out of it. I'm not saying you should but I would recommend\nit. If you like computer games, I would recommend Age of Wonders\nbecause it is a strategy game which has characters similar to the LOTR.\nBut be careful, it can be addictive and you might find yourself playing\nfor several hours.\n"},
{"review": "\nPeople often worship this part of the trilogy but it was effectively\nruined by the grossly unrealistic portrayal of the battles. A bit of\nrudimentary research could have prevented that up but Peter Jackson,\nwho otherwise has a great eye for detail, clearly didn't respect his\nmaterial or his audience enough to do his work properly, or, he was\nbadly advised.<br><br>spoilers follow<br><br>For example; One does not launch mass cavalry charges down steep\nslopes. Anyone who has ever rode on a horse would know this.\nHistorically, people have not been so crazy as it inevitably would lead\nto a mass pile up at the bottom and a complete disaster. One also does\nnot charge cavalry directly into a well formed pike formation even on\nflat terrain, let alone down a slope. It is suicidal and skilled,\nexperienced soldiers would avoid such tactics as a matter of routine.<br><br>There were other very badly handled scenes but I won't start listing\nthem all but they are there for anyone to see. <br><br>It is really disappointing to create such wonderful costumes, bring in\nlots of motivated extras and state of the art SGI effects and then\nneglect to do even the most rudimentary research on the simple physics\nof battles (let alone intelligent tactics). It is also disappointing\nthat the viewing public accepts such incompetence as justifiable\n\"artistic license\".<br><br>As an analogy, think of an otherwise well produced WW2 movie that\nportrayed soldiers and equipment doing things that were physically\nimpossible or downright crazy. Wouldn't that hurt any film that set\nitself up to be an epic?\n"},
{"review": "\n\nAlmost two years ago, after I saw the first of the trilogy, I wrote in\nsummary...<br><br>\"As a film of a historic work of fiction, and especially this DVD release,\nit is almost perfect. However, as a fictional work the story is a bit of a\nlet-down, in my opinion. It is best appreciated by all the \"Ringheads\" out\nthere who have bonded over the years with the ring trilogy and Tolkien. For\nmy own enjoyment there are more interesting fictional works. Maybe I'll have\na different opinion in two years, after I've seen all three of the\ninstallments. \"<br><br>I've not seen the last installment yet, but my opinion has not changed any.\nFirst off the movie is entirely too long. Not that length itself is bad, but\nin an apparent attempt to follow the books faithfully, much of the story\ndrags badly. Wise producers and directors realize that movies made from\nbooks must exclude much material, to keep the story interesting and the\nrunning time reasonable. People who read novels often do so over weeks.\nMovies are normally watched at one sitting. So, while this long movie may be\njust what the \"Ringheads\" want, for the rest of us it is simply too much of\nthe same, and too long. Still, it has remarkable production values and is a\njoy to watch.  Just too long and boring in spots.\n"},
{"review": "\nSome of us may know the back story of how Tolkien himself never wanted\nhis books to be made into a film and I have to say that I agree with\nhim, much of the magic of his books were in the finer details and these\ncould never be conveyed well in a film. Here we have a film that's well\ndone in some ways yet in the grand scheme of things it was never\nneeded, the books stand alone and this trilogy of movies are a perhaps\nselfish project? -that are essentially a compromised vision of the\nbooks, this big budget 'action' movie would serve those looking for a\nfeast of CGI effects and action sequences, thankfully there is some\nsubtlety and the interplay between characters is the films saving grace\nand I appreciate the tasteful selection of dialog used for the most\npart. One of my big beefs with The Two Towers and the other 2 movies is\njust how nonthreatening Sauron is in these films, I think this aspect\nweakens the movies a great deal, even the ring wraiths come across as\nimpotent compared to creatures such as the Urak Hai. Another is the\nabrupt transitions between scenes, and the movies lose much of the\n'glue' that the books had tying everything together. Finally 'some' of\nthe CGI effects don't do justice to the imagination - Sauron's eye, and\nthe faces in the dead marsh seem to suffer like Gladrieal did in the\nprevious movie - a little bit too overly dramatic and washed out - I am\nonly mentioning this as a comparison to the majority of effects in this\nmovies which are actually very well done. Also the costumes are\nexcellent, I especially thought the depictions of the orcs were\nexcellent. Overall I can only give this 5 stars.\n"},
{"review": "\n\nAlthough I enjoyed this movie I have a few gripes. Why did they decide to\nstray from a good thing. I have noticed alot of the \"excellent\" &amp; \"best\nmovie ever\" comments are from people who have not read the books.<br><br>As far as I recall Frodo and Sam did not go to Gondor. EVER. Please\ncorrect\nme if I am wrong.<br><br>Also what is going on with Aragorn's storyline? It also seems to have been\ncreatively altered from the original storyline.<br><br>And when did Faramir turn evil. He was not like his brother. He didn't\nwant\nto use the Ring as they portray in the movie.<br><br>I realize that the fight scenes were important to the creators of the\nmovie.\nHowever did they need to be quite so long? With just a few minutes of\ncutting and leaving out the \"never actually happened\" Gondor trip. I\nbelieve\nthey could have actually fit in the entire book. I now wonder how long the\nthird movie will be. Not only do they have to fit in the entire third\nbook,\nbut also the end of the second book.<br><br>For those of you who thought this was the best movie ever I just suggest\nyou\nread the book. I too liked the movie, but it is not the best ever. It\nwould\nhave been in contention if they had stuck to the original plot as it was\nwritten. Like they did in the first movie. However they didn't and that is\nthat. I just hope they stay truer to the storyline in The Return of the\nKing. We shall soon see.\n"},
{"review": "\nThe Fellowship of the Ring was a monumentally entertaining film, the\nReturn of the King was an amazing wrap-up to the epic of our times, but\nthe most dramatic moment for me came at the end of the Two Towers.\nAfter 3 hours of sweeping vistas, excellent Shakespearean acting, and\notherworldly sights and sounds, we are treated to a scene that still\nsends chills down my back and rouses me like nothing since the final\nscene in Rocky. A lone rider (we all know who), set against the top of\na hill, massing legions of horsemen behind him. He appears just as the\nheroes are losing all hope. Once he begins his descent down the hill\nwith his army behind him, the camera begins a slow pan over the top and\ndown with them, showing the size and scale of their forces. The evil\narmy below looks up with surprise, a bright light fills the screen, the\ncamera focuses on the lead rider (again, we all know who) who lets out\na wrenching battle cry, the music swells to unbelievable heights, and I\nam swept away like I've never been before.<br><br>This is cinema at its very best.\n"},
{"review": "\n\nI really really wanted to love this movie.  I loved Fellowship, I found it\nnearly flawless.  I give a 10/10 for the acting and the special effects.  If\nI have never read the books, I would have been absolutely flawed by this\nmovie.  Some of the changes detracted from this movie, but not terribly. <br><br>But the fundemental changed made to Faramire (compare him in the book to the\nmovie - not merely changed but the opposite) seriously undermined the whole\nplot of the trilogy.<br><br>Still, I have this an 8/10.  On its own merits, it is excellent.  But\nchanges were made that weakened the story for no good reason...\n"},
{"review": "\nThe people who vote against this movie or didn't see it, or just hate\nit for hatred. This is the movie that changed the movie industry and\nset foot for the digital actors (3D Animation). This movie is a living\nlegend, a god, and will rule for a century in my opinion.<br><br>Seriously, if you have not seen this trilogy, go and see it as soon as\npossible, as it is not just a movie about medieval times, it has\neverything a real movie should: Beautiful people (not a single ugly\nface), amazing art, incredible places (looks like heaven with skies of\nmany colors, water and so much more). The acting is superb, the best in\nthe world, they really hired the BEST out there, and as far as I can\nsee, the movie was awesome because they did not allowed the motion\npicture to be corrupted with \"political\" reasons, so, all the actors,\nPost-production, sound, effects and everything else was really the\nBEST, no corrupted piece!!!!<br><br>The story is immortal, will get you in tears no matter what you are\nmade of. The characters... so well done!!!<br><br>Do you know why this movie is so good? I will tell my opinion on it: I\nthink it is THAT good, because Peter Jackson worked on it for more than\n10 years (was forced to wait 10 years because no one wanted to give him\nthe green light to shoot), that is why, it is a good way to ensure a\ngood quality.\n"},
{"review": "\n\nThough many would say that The Two Towers was excellent and some would\nsay\nbrilliant, I have different opinions.  I have seen this movie four times,\nand each time, my opinon changes.  The first time I saw it, I had no idea\nwhat was happening, so I basically slept for three hours.  However, the\nsecond time I went, I went with a Lord of the Rings fan who was explaining\nthe story to me nonstop.  It was better that time, but still not that\ngood.\nThe third time I understood it completely, but the fourth time I got bored\nof it.  I think it would have been a better movie if it was a little\neasier\nto understand.  Most people enjoy these movies because they have read the\nbooks, but the producers have to realize that some of us\ndon't.\n"},
{"review": "\n\nI am a LOTR fan, but I nearly walked out of this movie. The acting was\ngood\nand the scenes were well choreographed, but the plot failed to flow. This\nmove ignored the book it was supposed to be about. The timelines in the\nbook\nwere ignored; the character development for new characters (such as\nFaramir)\nwas bastardised and ruined for 'dramatic purposes'; scenes were added\nthat\ndid not exist in the book. I can [barely] accept the whole 'Arwen as\nFrodo's\nsaviour' from The Fellowship Of The Ring, but what Jackson has done this\ntime made me feel nauseous - I actually felt the desire to vomit while\nwatching this movie. The movie started and seemed to rush forward without\nany sense of coherency or sense of timing, and then they started on the\naction to blind the audience to the significant gaps in the plot. The\naction\nwas good, but the gaps in the plot made it hard to follow. This WAS 3\nhours\nof my life I will never be able to get back.\n"},
{"review": "\nAfter falling asleep watching The Fellowship I decided to give the two\ntowers a chance.<br><br>It sadly is more of the same unimaginative black and white world\ndepiction like the Fellowship. There are only 2 kinds of people, the\ngood guys and the bad guys in the Lord of the rings movies.<br><br>The good guys look nice, fresh, heroic and smart. The bad guys have\nhideous faces, wear old clothes, are conniving and not too bright. In\nthe two towers Frodo continues his way to Mordor to destroy the ring.\nThis time accompanied and guided by Gollum, some CGI created creature.\nAgain they walk an awful lot and encounter some danger which they\nnarrowly manage to avoid. At the end of the movie though, they still\nhaven't managed to make it so well need a 3rd movie to find out if\nFrodo will succeed. I have a strange feeling that he just might.<br><br>The 2 captured Hobbits escape and seek refuge in a walking tree. I've\nbeen told they spend 58 hours per frame to make it look real. To me it\nlooked straight out of Sesamestreet and i had trouble not to laugh.<br><br>Suddenly Gandalf appears out of nowhere and wasn't killed after all in\nhis demon battling in film number 1. Ahh, what a shame. You really cant\nbelieve anything in this movie. After some bickering in the land of\nhorsemen we see a huge battle between the (300) good guys and the\n(10000) bad guys. Off course, the good guys win. How surprising. By\nthen I finally dozed off into a deep sleep whilst knowing this is a\nperfect film for children aged 3 to 10. It wasn't as bad as The\nFellowship but it was still waaaaaaaaaaaaay too predictable and\nsimplistic. I didn't give it a 1 but a 3 because I did like the\ncinematography and the locations where nicely chosen.\n"},
{"review": "\nThis is an extremely intriguing film, the battle scenes, especially\nHelm's Deep were amazingly well done!!!! I can't believe Peter did so\nwell! Some say that the film was too long, I say it wasn't long enough,\nnot even the super awesome extended version! There are very few\ndirector's that revolutionize Hollywood, but I say Peter is one of the\nbest!!! He portrayed everything with amazing visual effects, the huge\narmies and epic battles! Treebeard is sweet! He is so treelike and was\nwell done, like the picture in my head! This movie has no flaws, and is\none of the best! Definitely this trilogy is the greatest epic of all\ntime! Stories like these will always live on in the hearts of fanatics\nlike me!\n"},
{"review": "\nFollowing on from The Fellowship Of The Ring, JRR Tolkien's The Lord Of\nThe Rings saga continues as hobbits Frodo and Sam, in the company of\nthe devious Gollum, continue their quest to destroy the One Ring,\nAragorn and his friends fight to protect the people of Rohan from the\nevil Saruman's vast army of orcs and kidnapees Merry and Pippin escape\nfrom their captors and befriend the Ents of Fangorn Forest.<br><br>This beautiful and breathtaking fantasy film's only flaw is that being\nthe middle book of a trilogy it doesn't have a beginning or an end.\nThat aside, it maintains the stunning high quality of the previous film\nin every aspect of production and keeps the epic story sweeping along\nat a magnificent pace. The performances are uniformly excellent but\nthree actors new for this movie in particular distinguish themselves.\nHill as the proud but miserably oppressed King Theoden. Dourif as the\nslimy Grima Wormtongue. There's a wonderful moment where he says to\nLee, \"But we'd need an enormous army for that !!\", to which Lee strides\nto a balcony and looks down at a colossal orc army amassed outside. And\nin particular Serkis, who never appears on screen (Gollum is\ncomputer-generated) but performed on set, motion-captured the\ncharacter's moves and provided his incredible voice. For me, Gollum is\nthe key character in the movie and he is brilliantly realised, bursting\nwith pathos, rancorous bile and schizophrenic nuttiness (\"We hates\nBagginses !! We hates them forever !!\"). Howard Shore's excellent score\nand the outstanding effects work by Richard Taylor, Jim Rygiel and\nRandy Cook (the battle for Helm's Deep setpiece especially is a\nstunning composite of live-action and effects) serve to make this film\neven more spectacular than its predecessor. This is a movie with too\nmany great scenes to mention, and tells a classic story with incredible\nvisual splendour.\n"},
{"review": "\nPeter Jacksons' first major task was to make Lord of the Rings into one\nfilm. \"Impossible\", Peter Jackson said, there was no way he could fit\nall the information into one film. But one of the producers in New Line\nCinema said why not make three films because there is three books. It\nwas exactly what the crew making the film wanted to hear. So then the\nscripts were re-writ to fit three films. After the theatrical release,\ndirector Peter Jackson wanted to create an extended version for each\nfilm. This was because Peter Jackson wanted to capture it for\nposterity.<br><br>The Lord of the Rings was a cinematic masterpiece, the greatest book of\nthe 20th Century was made into the greatest film trilogy of the 21st\nCentury.<br><br>\"The Lord of the Rings: The Two Towers was probably the hardest to\nadapt,\" admitted director Peter Jackson. It was also the longest and\nmost frustrating experience of Peter Jacksons directing career. But the\ntwo Towers is not a failure but it does not match up to the quality of\nthe Fellowship of the Ring.The Two Towers continues the adventures of\nthe fellowship as they separate and take their own routes; Frodo makes\nhis way to Mordor with Sam, and his guide Gollum, Aragorn, Legolas and\nGimli head to find Merry and Pippin and to defend Helms Deep from\nIsengard. The film struggles to make an impact, although the film is\ngood enough to keep your interest high for the concluding part in the\ntrilogy, the Return of the King.\n"},
{"review": "\nAfter the first movie i was looking forward to this one, not having\nread the books, i didn't know what was coming next.<br><br>All the characters were there again, even Gandalf, who i thought was\ndead (ahh, but this time he's Gandalf the white) the visuals were as\ngood as expected and some of the cinematography blew my mind.<br><br>For me though, Golem stole the show, a very compelling computer\ngenerated character like nothing I've seen before. Well done to the\nspecial effects crew. The story developed with some interesting\nrevelations along the way and all in all I was satisfied with another\nchapter of the trilogy.<br><br>8/10\n"},
{"review": "\nTo me, I personally think that this movie is inspirational. It shows\nhow far someone can/has to go to achieve there goals. It shows that you\nhave to fight for what you believe in, and make a commitment. Also,\nfriendship is a big factor in this movie. Sam is willing to risk his\nlife to help Frodo, and expects nothing in return. For me, that was\nvery devoting. LOTR shows that once you start, you can't just give up.\nYou have to work to get what you want, and you have to embrace your\nfuture. And to me that is very inspiring. It also teaches you to be\nhappy with what you have....don't be selfish. This movie has changed my\noutlook on life, and I think it had changed me as a person.<br><br>Not to mention that pretty much everone in the movie is a total stud!\nThat helps a little.\n"},
{"review": "\nIn the Lord of the Rings trilogy, The Two Towers was my favorite, but\nit is as good as the prequel. Peter Jackson won his major triumph\nagain! The thing about the Two Towers is that, it makes everyone\nwondered what was going to happen, the fellowship was broken and the\ndark lord is winning over middle-earth.<br><br>The Two Towers explained the path of the hobbits and the king. The film\nfollows its prequel as did the book as Frodo and Sam make their way\ntowards Mount Doom to destroy the ring of evil. They encounter a new\ncreature called Gollum that is bound to the ring, and claims he knows\nthe route into Mordor. Is he a friend or foe?<br><br>it then shifts to Merry and Pippin who are held captive by a band of\nUruk-hai. the Uruk-hair get destroyed in a battle against humans, and\nMerry and Pippin flee into the forest of fangorn. There they meet the\nmost beloved character in The lord of the Rings books, treebeard, a\ncreature that is a walking, talking tree that must gather the other\ntrees for an inevitable battle against Saruman. <br><br>And lastly, there's Aragorn, and his two friends Gimili, a dwarf, and\nLegolas, an elf. They follow the Uruk-hai, till the damned creatures\nmeet their miserable fate. The trio encounter a band of human riders\nfrom a country called Rohan, which tell them the direction of the uruk\nslaughter, which leads the trio into Fnagorn forest, where they meet an\nunexpected friend, and learn that the folk of Rohan are being attacked\nby Saruman, and must make a stand against an army of 10,000! Can these\nthree gatherers change the fate of middle-earth in the little time they\nhave? <br><br>Peter Jackson has proved himself of filming great battle sequences,\nunique special effects, a great storyline of an unforgettable tale, and\nmoral lessons all people must learn. 5/5\n"},
{"review": "\n\nTook me a LONG time to see this film. Anything that EVERYONE liked, I was\nsure I wouldn't. But, when I finally got around to watching it I was\nshocked. It was a lovely film and was much more moving than I expected. The\neffects were great but never distracting as many films are. And the story\nwas faithful. The stars were all perfectly cast and it wsa beautifully\nadapted. If MGM and the old studios were still making great costume epics\ntoday they would have been proud to have made this one!\n"},
{"review": "\n\nWhen I first saw The Fellowship of the Ring, I got really disappointed.\nBut, The two Towers is completely different. The plot of the movie is\ninteresting and their characters are really complex. Besides, the special\neffects of the movie are unbelievable, specially in the battles. In my\nopinion, the best actor of the movie was Sir Ian McKellen, who played\nGandalf the Wizard. The soundtrack of the film was also great, especially\nthe one that is used in the Kingdom of Rohan. In conclusion, this movie\nreally made me change my opinion about The Lord of the Rings Trilogy and\nmade me a fan.\n"},
{"review": "\n\nThis movie was really spectacular, it is really apparant how hard the cast\nand crew worked on this film.  Edoras, for example, instead of using a\nset,\nthey actually built the whole city on top of a huge hill in the middle of\nnowhere basically.  And also the acting was fantastic and the battle of\nHelm's deep was breathtaking!!!  2 thumbs up!!\n"},
{"review": "\n\nOf all three movies in this illustrious trilogy this might be my personal\nfavorite.  This is an incredible film.  IMHO the opening and closing\nsequences (Gandalf Vs. Balroc &amp; Helm's Deep) are unmatched in their\ngreatness.  The middle isn't too shabby either with a few great action\nsequences, some interesting character development and some of the most\nbreathtaking settings ever put on film.\n"},
{"review": "\n\n I have loved Tolkien's masterpiece since I was 10 years old. I bought the\ncalendars by Brothers Hildebrandt all through college, and I have eagerly\nawaited the movies since they were announced some four years ago. I just saw\nthe Extended \"Two Towers\" last night at the Seattle Cinerama, and I was\nabsolutely stunned by how improved it is over the earlier edit (which I saw\nthree times in theatres). As good as \"Fellowship\" is, I feel that the\nrestored \"Two Towers\" blows it away. <br><br> ****** SPOILERS ******<br><br> So many things that felt half-finished in \"TTT\" now contribute to the\nrichness of detail that makes this such an epic. The stable scene with\nBrego, Aragorn, and Eowyn is pivotal in setting up several later scenes. The\nmigration of the trees of Fangorn to Helm's Deep, the flashback to Boromir\nin Osgiliath, and Theodred's funeral all serve to bring the story much more\nin line with Tolkien's vision. Even the raiding of the stores by Merry and\nPippin is wonderful, injecting some of the lightheartedness of \"Fellowship\"\ninto what is a much darker story.<br><br> ****** END SPOILERS ******<br><br> This trilogy will stand as a singular achievement in cinema history. In an\nera when many big-budget films are mindless, sadistic two-hour pageants of\nexplosions and gunplay, it is remarkable that these films were made at all,\nlet alone with such faithfulness to very complex source material. Bravo to\nNew Line, Peter Jackson, Howard Shore, the entire crew, and of course the\nmagnificent cast, especially Ian McKellen. \n"},
{"review": "\n\nQuite simply, this is one of the most incredible pieces of cinema ever\ncommitted to film.  From the very first moment the direction and action\ngrab\nyou by the throat and refuse to let go until long after you've left the\ncinema.  The film's epic proportions and feel as well as it's intense\nemotion are perfectly controlled by one of the greatest director's that\ncinema has ever seen.  As an adaptation it's not without it's flaws,\nleaving\nmany of us -who've read Tolkien's novel- with questions still unanswered,\neven having watched the special extended edition.  Yet, over all, the\nchanges made and omissions from the book are used to good effect in the\nexciting retelling of this chapter of the classic tale.<br><br>Superlative acting from a perfectly cast body of actors adds to the magic\nof\nthis already classic film.  A score to die for and Jackson's sweeping\ndirection create a world that is utterly involving and even believable.\n'The Two Towers' is unparalleled in cinema history -except, of course, by\nit's predecessor 'The Fellowship Of The Ring'- and sets new standards in\nfilm effects and story telling.  The film is a cinematic journey of rich\nemotion and spectacular action which can not be praised highly enough.  Of\ncourse, it does have it's faults in storytelling and even the odd CGI\nshot,\nbut these pale in comparison to the depth and magnitude of the overall\npicture.<br><br>Unlike some recent film successes, 'The Two Towers' rightly deserves it's\nplace among any list or collection of cinema's greatest films.   Only the\nmost threatened critic or hardened cynic could fail to be moved by this\nstunning movie creation.  Sheer brilliance.\n\n"},
{"review": "\n\nAs a fan of LOTR before it came out in paperback and of the first film, I\nwas \ndisappointed in the sequel. Tolkien gets lost in all the mugging for the\ncamera, uglified \nfolks, and computer-battle scenes. It is sort of the antithesis of Tolkien,\nwho presented \nhobbits as admirable for their simplicity and courage. The wrong aspects of\nseventeen-\nyear-old boys are being appealed to here.\n"},
{"review": "\n\nI want to really thank Peter Jacksson and all the actors for sharing\ntheir\ntalents so heartfully. Peter Jacksson has really put aside all qlichees\nand\neasy going fooly and created a movie true to the books and the author him\nself. I think Mr. Tolkien is smiling to see what they have created\ntogether.\nActually I also want to thank the sponsors for not making a commercial\nstunt\nof the movies, like e g the first Bat Man movie. There is also no feeling\nof\nintefearing with the movie or even the casting of the characters. No\nplaying\nit safe, just tying to make the books come alive.\nI have seen first two movies and so far top-notch, I hope to see the\nextended version of the Two Towers soon  :-)\n"},
{"review": "\n\nFirst off, The Two Towers is an amazing achievement.  As with the Fellowship\nof the Ring, the Two Towers is one of the best films ever.  However, the\nonly problem I find with this film is that it is too short.  Yea, you heard\nme right! The new characters needed to be fleshed out a little more. The\nFellowship of the Ring IMO is superior because of the interaction between\nthe core players.  We were there when they made their journey, we were not\nhopping back and forth between their individual adventures.  Yes I know that\nis the way the book is written, but I just prefer the Fellowship's  more\nintimate look at the characters.  This withstanding the Two Towers is an\namazing achievement.  WETA Digital truly deserves all of the kudos that have\nbeen bestowed upon them.  They have supplanted Industrial Light and Magic as\nthe preeminent digital effects company.<br><br>Bottom Line:<br><br>10/10!!!<br><br>\n"},
{"review": "\n...not as good as Fellowship. Loved Smeagol - more expressive\nthan most of\nthe human actors in the film. But I was reminded of watching the Baski\nanimated version - this section of the saga suffers from cutting between\ngripping stuff and tedious stuff, especially Merry and Pippin on bloody\nboring Treebeard. Loved the addition of the warg attack but it did have\nthe\neffect of making Middle Earth seem tiny and, if Saruman's forces could\nreach\nRohan so quickly then why didn't he head straight for Helm's Deep and stop\nthem getting in? Eh?<br><br>Also, the battle left me cold. Compared to Boromir's last stand, all these\ncomputer-generated t**ts running about were just unconvincing. And why is\nGimli nothing but clumsy comic relief? All that 'toss me' stuff -\nterrible.<br><br>But, by far the worst crime here is Legolas skateboarding down the steps.\nI\nexpected Huey Lewis and the News to kick in.<br><br>That aside, I will watch the DVD over and over but I'm hoping the extended\nversion, as with Fellowship of the Ring, will iron out the pacing problems\nand give us more character study to balance the action.\n"},
{"review": "\n\n9 out of 10  (Like its predecesor, LOTRTT gets a little windy in\nplaces)<br><br>Discounting the StarWars trilogy (forever tarnished by the crap that Lucas\nis\nmaking now), this film is the BEST 2nd installment of a trilogy I have\never seen.\nIt really makes me believe that filming all 3 at once was indeed the only\nway to\ndo this trilogy.<br><br>Jackson takes some liberties, but all in all the film is a success on\nseveral levels.\nCharacters are maintained and strengthened, The plotting does well not to\nbe\ntoo dreadful without inserting lightheartedness or breathtaking action,\nand\nthe\nspecial effects absolutely blew me out of the water.<br><br>To all the Star Wars fans out there, take a look at Gollum, and see Yoda\ncould\nonly hope to be.  Gollum is so life like and well portrayed.<br><br>All in all a great movie, albiet with some minor flaws,...  very\nminor.\n"},
{"review": "\n\nim not one to like fantasy...i liked the first LOTR movie, but i wasnt\ncrazy\nabout it. i thought it was an ok fantasy film. then comes \"The LORD of the\nRINGS: The Two Towers\". it such a great improvement over the first and\nprobably the best sequel ever thats better and more fulfilling then the\noriginal. \"TTT\" got robbed at the oscars: peter jackson deserved best\ndirector and this movie deserved BEST PICTURE OF THE YEAR!. hopefully next\nyear, both peter jackson and return of the king will finally win the\noscars\nthey rightfully deserved. as claudia puig from usa today said...\"THE LORD\nOF\nTHE RINGS: THE TWO TOWERS' is among the most breathtaking achievements in\nrecent cinematic history\" i agree. \"ttt\" stands above every movie in 2002\nand is certainly THE VERY BEST PICTURE OF THE YEAR AND THE BEST FANTASY\nFILM\nTO EVER MAKE IT TO THE BIG SCREEN!\n"},
{"review": "\n\nThank You Peter Jackson.  These films are absolutely magical.  The Two\nTowers has flaws, but is still a great experience of a movie.  I looked at\nsome of those who post to slam this film.  One said that when he buys the\nmovie he would use scene selection to skip over the parts he didn't like.  I\nsuppose the irony was lost on that one.  I also saw a lengthy slam where the\nposter stated that on the two viewings he had of the film people were\nlaughing at golem.  I love this film, but I have only seen it\nonce.<br><br>So do you see...  this is a great movie.  Even those who hate it can't look\naway.  Even though it betrays their personal take on the books, there is\nmagic on the screen that keeps them coming.<br><br>I will buy the DVD promptly Aug 26th.\n\n"},
{"review": "\n\ncomparing to the fellowship, ttt is just trash. there are no characters,\nno\nreal emotion, and it goes from one thing to the next without a logical\norder\nor meaning. i really hope the third part will be more like the first. i\nreally really hope the end will be the same as in the book, and not a\npossible kiss between aragorn and his elf-lover... ugh...\n"},
{"review": "\n\nI thoroughly enjoyed 'The Fellowship' and was eagerly awaiting the release\nof 'two towers'. I have never read the books but was informed that the 'Two\nTowers' would be even better than it's predecessor as the plot thickens and\naction really gets going. However, on leaving the cinema after watching this\nfilm I was left somewhat disappointed.<br><br>I have read review after review saying this is peoples favourite film. I\nmean come on, be serious. It takes an age to get going and if it was not for\nthe climactic battle of Helm's Deep would have been the worst excuse for a 3\nhour long film since the first two hours of Titanic. Even in this ground\nbreaking climax it is constantly interrupted by Treebeard, the character\nthat personifies the slowness of the rest of the film. Also the attempted\nromance between Viggo Mortenson and Liv Tyler's characters seems just to be\nin this film because Liv complained of lack of screen time because there\ncertainly doesn't seem any need for her character in this instalment apart\nfrom this pointless sub-plot.<br><br>The creation of Gollum was simply brilliant and deserved the Oscar but I was\npleased to see this film ignored in the other categories. One thing is for\nsure, I will not look forward to the next sequel as much as I did this one,\nfollowing this film's disappointment.\n"},
{"review": "\n\nI was brimful of excitement and expectation prior to the release of The Two\nTowers. After thoroughly enjoying Fellowship I was told this installment\nwould be even better as there is more action in this book than the first (I\nhave never read the books). However I left the cinema after this film\nimmensely disappointed.<br><br> I have read review after review of Two Towers with people saying this is\nthe best film ever. Come on, I mean seriously! Two Towers is incredibly slow\nand if it wasn't for the climactic Helms Deep battle would be the worst\nexcuse for a 3 hour long film since the first 2 hours of Titanic. Even\nduring this epic battle it is interrupted by the character which personifies\nthe slowness of the rest of the film, Treebeard.\n \nThe romance, or attempted romance, between Viggo Mortenson and Liv Tyler is\nso erksome and pointless I wonder if it is included because Liv complained\nabout lack of screen time. There certainly wasn't any need for her character\nin this film because their romance is distinctly uncaptivating.<br><br>Golum is created brilliantly and deserved the Oscar for effects but I was\nglad to see fhis film ignored in the other categories. I won't look forward\nto Return Of the King as much as this now. Disappointing\n"},
{"review": "\n\nI went to see this with great expectations. It was like going to see\nPhantom\nMenace; I really, really wanted it to be great.<br><br>But, no, sorry, it really, really wasn't. At the start it goes straight\ninto\nthe action, no preamble, no 'setting the scene', I dont even remember\nthere\nbeing any credits. Then it was very episodic. No acting, no\ncharacterisation\nto speak of. The scenes were short, not much interaction between the\ncharacters. Just loads and loads of orcs every where.<br><br>The best thing in it is Sam Gamgee.\n"},
{"review": "\nNote: If you're looking for someone to complain about this film, go\nelsewhere. I LOVE this film. It's the second instalment in the Lord of\nthe Rings franchise, and I truly enjoyed The Fellowship of The Ring, so\nlet's see what I thought.<br><br>Now Right from the first scene, this film had me. It's extremely\nentertaining. And from there; the rest of the film did not disappoint.\nIt has spectacular camera work and a quest-like vibe, two traits from\nThe Fellowship of The Ring I loved, and that fits perfectly into the\nfilm's atmosphere. But the thing that captivates you the most; is the\nmusic. The score is just great.<br><br>Another thing that they stepped up is the humor. Far more humor, that\n(magically) doesn't feel forced, something very important in the second\n(and some-what darker) film. The characters are also touched on far\nmore. We see more of characters that weren't specifically looked into\npreviously, like Gimli and Pippin. <br><br>All and all, this film is well and truly a worthy sequel to, all be it\nnot better than Fellowship. The battle sequences are extremely\nentertaining, the characters are highly enjoyable, and you still get\neverything you love about Lord of The Rings. This is one of my favorite\nfilms of all time, and I highly recommend it.\n"},
{"review": "\nIn every way, even after reading all 6 books, i love this adaptation\nand the way it was brought to life. Peter Jackson deserves all\nadoration and praise for the way he made all, but especially this\nmovie. There is a lot that is missing, but I can Understand how it\nwould be hard to adapt to film. Even though i would not complain on bit\nif they made a 32 hour movie of all of the events that happened in all\nof the movies. This movie deserves all 10 stars and much respect. LOTR\nforever!!! Thank you, Peter Jackson, for all you have done and all you\nwill do. Except for the last 20 min of the latest Hobbit Movie...\nGarbage.\n"},
{"review": "\nIn a trilogy, the second part is always the most difficult to create\nbecause it loses the charm of the discovery and lacks the thrill of the\nconclusion. The goal is to develop the characters and conclude with a\nsolid cliffhanger that will be resolved in the last part. Thus, it's\nnot just passing by.<br><br>Unfortunately, this movie is this kind. It fails to reach classics as\n\"Star Wars V\" or \"BTTF 2\" and it's as dull as \"Star Trek 3\". Nothing\nreally fundamental happens here: it's just another steps in the\njourney. Moreover, the fluidity of the first movie is lost because the\ncharacters are now split into three groups. I dozed two times watching\nit: in the Rohan country and during the Helm's Deep battle.<br><br>But the responsibility goes to Tolkien because LOTR aren't really three\nstories but a huge, colossal single story divided in three parts by the\neditor. And a night rainy battle will be always more exciting on a\npaper than on screen.<br><br>To leave on a happier note, i must say that the extra are interesting\nand really help to understand all the passion that people have put in\nthis trilogy. That's why the chain-maker is so funny: With his\ndesperate and weary voice, he explains that armors needs thousands of\nrings, that rings come in three models and that in a day of work, he\ncan chains as much as a big scarf!\n"},
{"review": "\nPeter Jackson has done it again, with the second movie in the Lord of\nthe Rings trilogy, \"The Two Towers\". An excellent film, but it is my\nleast favourite in the trilogy.<br><br>Sam and Frodo continue their journey towards Mordor to rid Middle Earth\nof the One Ring, while Aragon, Gimli and Legolas prepare to do battle\nwith the armies of the dark. Also, we get to see Gollum for the first\ntime in this film, in all of his CG glory! Pure screen magic. Amazing\nspecial effects, a great storyline continuing the tale, this is a film\nthat should definitely not be missed! The end battle is pure CG magic!\nPeter Jackson has done it once again! I recommend the extended edition,\nwhich shows us more in this wonderful tale.<br><br>I say that this is my least favourite in the trilogy for the simple\nreason that it jumps from Sam and Frodo, to Aragon and Legolas, to\nMerry and Pippen, and back and forth. It can get somewhat confusing and\nhard to follow if you have not read the books.<br><br>Despite this one minor flaw, the film is eye-poppingly beautiful, from\nthe beautiful scenes, to the amazing special effects. Definitely not a\nfilm to be missed!\n"},
{"review": "\nIn this trilogy there is a beginning that sets up the audience for the\ncharacters and the plot, then there is a sequel where the characters\ncontinue on from where the first leaves off, certain things happen\nthroughout the second one that prepare everyone for the third, and in\nthe third everything comes to an awesome and amazing ending.<br><br>The Two Towers picks up from where The Fellowship Of The Ring left off.\n(Spoilers ahead) In the end of the fellowship: Gandalf fell off a ledge\nafter defeating the balrog, Boromir was shot by orc arrows, Merry and\nPippin were captured by orcs, Frodo and Sam left and continued on their\nquest to Mordor, Aragorn, Legolas, and Gimli decided to follow the orcs\nand rescue Merry and Pippin. The two towers basically follows their\nadventures and shows how Gandalf, Aragorn, Legolas, and Gimli are all\nreunited, Merry and Pippin are rescued by the ents after their captors\nare attacked, and Frodo and Sam encounter the creature Gollum and ask\nhim for help in getting to Mordor.<br><br>The Two Towers is a much more complicated story, as there is a subplot\ninvolving a falling kingdom and their struggle to survive as orcs are\ntrying to destroy them all. The Two towers is another feast to the eyes\nand imagination just like The Fellowship of the ring. There is a great\nbattle scene in this at the climax of the story, but the battles in\nReturn Of The King make the battle in this movie seem like a brief\nsprawl.\n"},
{"review": "\n\nI don't know Peter Jackson, and I've never been to New Zealand, but after\nthe experience of this film, I don't need to.<br><br>THE LORD OF THE RINGS: THE TWO TOWERS is one of the greatest, perhaps the\ngreatest, movies ever made.<br><br>Jackson wisely does not attempt to duplicate the books--that would be\nartistic suicide because Tolkien's trilogy is unfilmable.  Jackson captures\nthe essence and the excitement of the film with unbelievable integrity. <br><br>The Lord of The Rings is a story of good and evil, of dark forces battling\nthe light, of heaven and hell.  J.R.R. Tolkien had a profound Christian\nvision.  Every character is a prototype.  <br><br>Frodo is the hero on a great quest.  Samwise Gangee represents everyman,\nessentially good and an unsung hero.  Gandalf, a Christlike figure, dying\nand returning again to serve Middle Earth.  Gollum is a tormented soul,\nevil, but an object of pity just the same.  Aragorn, Gimli the Dwarf, and\nLegolas the Woodland elf, all have their place in this tale.  The Orcs are\nthe human/elf form corrupted beyond recognition.<br><br>The battle scenes in The Two Towers are exciting and some of the best every\nfilmed.  Computer animation works wonderfully with the Ents and\nGollum.<br><br>I am thrilled that Two Towers had been so popular and has made\nmoney.<br><br>Bring on The Return of The King.<br><br>\n"},
{"review": "\n\nThis movie is a first rate epic.  From start to finish, it delivers the\nessence of Tolkien and his world.  From Gollum to Helm's Deep, the special\neffects are innocent fun and spectular.  I think Helm's Deep is\nunbelievable\nthough.  Peter Jackson knows what he's doing.  He has a vision of Middle\nEarth, that none of us could've imagined.<br><br>On one hand this is a fantasy, and it's totally not real.  That's why I\nthink it's unbeliveable.  How could this happen?  I don't know. But all I\ncare is that at least it's good.<br><br>The movie will utterly be remembered years from now.\n"},
{"review": "\nThis film starts off where \"The Fellowship of the Ring\" leaves off;\nFrodo and Sam are on their own and heading to Mordor with the sinister\nSméagol who has promised to guide them through the mountains, Merry and\nPippin are in the hands of Saruman's Orcs as they return to Isengard\nand Aragorn, Legolas and Gimli are in pursuit until they are diverted\ninto helping King Theoden of Rohan.<br><br>The film switches between the three groups so we never get chance to\nforget what the characters are doing. I think this is the only film\nthat I've seen where the narrative follows different groups who never\nmeet each other. The action is even more spectacular then the previous\nfilm, the storming of Helm's Deep is one of the most spectacular scenes\nthat I've ever seen, also amazing are the realism of Sméagol, the CGI\ncreature based on the movements of Andy Serkis and the Ents, huge\ncreatures that look like walking trees.<br><br>The actors did a great job, especially Elijah Wood as Frodo as he\napproached Mordor you could almost feel the increasing weight of the\nring hanging from his neck. The cast of characters here is quite a lot\nlarger than the previous film giving us some great new characters, the\nmost obvious is Sméagol who was only glimpsed before but there is also\nthe wonderfully vile Grima Wormtongue and Eowyn, King Theoden's niece\nwho is smitten with Aragorn.<br><br>If you haven't seen any of the Lord of the Rings films I strongly\nrecommend this but only after watching The Fellowship of the Ring, if\nyou don't watch that it will be hard to understand what happens here.\n"},
{"review": "\n\nA decent movie, worse than the first in the trilogy and equally not\ndeserving of the hype it has gotten. Visually alright the effects are not\na\ngood reason for a Lord of the Rings fan to attempt to draw in non-fans or\nundecideds as I was. All of the matrix movies still dwarf this if you are\ngoing to talk Computer animation.\n"},
{"review": "\n\nI'll keep my comments short and sweet:<br><br>1) Terrible dialouge. I lost count of how many times I cringed as lines\nwere\nspewed forth. See the King of Rohan and the burial mound\nscene.<br><br>2) One dimensional characters. See Gimli's painful and never ending\n\"jokes.\"\nJar Jar Binks was given better material and more dignity.<br><br>3) Schizo order of the scenes. The best example of this mistake takes\nplace\nduring the final battle at Helms Deep. Highly intense moments of fighting\nwould suddenly shift away to Merry and Pippin. Disconcerting and as it was\ndone throughout the film, the pacing was tarnished.<br><br>4) Plot holes. One glaringly obvious one was when Frodo almost gives up\nthe\nring to a Nazgrul and THEN Faramir, who up till then had had the hobbits\nin\nchains, lets them go. That and the many others lead one to wonder where\nthe\nscript supervisor was.<br><br>5) While a bit harder to point out, this film didn't seem to have any\n\"magic.\" It seemed flat,coarse and underwhelming. For example one thing I\nrememember while watching \"Fellowship\" was not wanting the film to end as\nit\nwas so enthralling. In TT I couldn't wait for the film to\nFINISH!<br><br>To sum up, if you're still in Jr. High I'm sure this film will fit your\nview\nas being \"the best movie of all time\" as previous comments have indicated.\nFor the rest of us however this film was pretty wretched. Note - I'm quite\na\nbig fan of JR.R. Tolkein's works so my distaste for TT was not due to\nignorance. At the same time let me remark that I had no problem with the\nforeknowledge that a film of the LOTR would necessitate some changes from\nthe books. My criticisms are focused on how shoddily done the film itself\nwas.\n"},
{"review": "\n\nI was very disappointed. The movie was so boring I started to \ncheck my watch while watching. Even the new StarWars movies\noffer more suspense then this bad second part of the Ring-trilogy.\nJust boring! What's boring about part 2? Simply everything! The\nfirst Ring-Movie was exciting and it made me curious about part\ntwo. But after watching part two I decided not to watch part\n3!\n"},
{"review": "\nThe Riders of Rohan recover the body of the king's dead son and we\nspend fifteen minutes watching characters we don't care about bemoan\nthe death of a character whose death we never witnessed. Then we watch\nSam and Frodo have the same conversation over and over and over again:\n'Oh, Sam, I can't go on.' 'It's the ring, Mr Frodo, I know!' Oh, and\nnow they have this creepy character called Gollum that follows them\naround and is supposed to be entertaining, but comes across as\nirritating. For some reason Sam still calls Frodo 'Mr'. Oh, then some\nboring talking trees show up and bore to death even the characters\nthemselves. What chance does the audience stand? Finally we get to the\nclimax and the grand battle. Except Jackson doesn't know how to direct\nit. The tone wavers. It goes between terror (women and children\nexpecting to be slaughtered) to comedy with Gimli and Legolas. And then\nhe keeps interrupting the battle in order to cut to those boring bits\nwith the talking trees. He even adds slow motion in the battle scenes\nfor no good reason. The end result is that there is no rhythm to the\nbattle and the emotion is dissipated. There you have it. Lots of noise\nand CGI, and no emotion - apart from boredom.\n"},
{"review": "\n\nThe epic saga of Middle Earth continues in this very good sequel to\nFellowship. In fact, I think it's the best of the trilogy. I enjoyed it even\nmore because I knew a bit more about the characters and the story. I must\nadmit that I haven't read the books. <br><br>The special effects are once again great and the battle scenes are\nspectacular. I wouldn't say this is one of the 10 best movies ever made, but\nit's still very entertaining. And I think it really has to be seen on a big\nscreen to be fully appreciated. I also liked the humor brought by characters\nlike Gimli. But Gollum was a bit too present in the movie. My favorite\ncharacters: Arwen (Liv Tyler), Aragorn (Viggo Mortensen), Galadriel (Cate\nBlanchett), King Theoden of Rohan (Bernard Hill) and Legolas (Orlando\nBloom). Too bad that the Arwen and Galadriel characters are not more\nimportant.<br><br>Out of 100, I gave it 88. That's good for ***½ out of ****.<br><br>Seen in Toronto, at the Famous Players Paramount Cinemas, on January 19th,\n2003.  \n"},
{"review": "\nLord of the Rings: The Two Towers (2002): Dir: Peter Jackson / Cast:\nElijah Wood, Ian McKellen, Viggo Mortensen, Sean Astin, Andy Serkis:\nThe Two Towers is suppose to represent good and evil but the subplots\ndo not interlink very well due to spacing. It opens where Fellowship of\nthe Ring left off within a battle. Frodo and Sam are joined in their\nquest by a scheming Gollum, which they captured then they continue\ntheir quest to destroy the ring. There are tree creatures that are the\nfilm's biggest treasure. Then we are given another useless cliffhanger\nwithin a huge battle. Director Peter Jackson tenses the action with\nimpressive visual wonders. Ian McKellen as the wizard Gandalf returns\nafter having apparently died in his battle concluding the first film.\nViggo Mortensen as Aragorn is involved in much combat until nearly\nmeeting his death after a horrendous fall. Elijah Wood as Frodo and\nSean Astin as Sam struggle as keepers of the ring and the deceit as the\nGollum attempts to sabotage their friendship. Andy Serkis is the Gollum\nand his performance is all the better because of what viewers do and\ndon't see with his performance. The special effects are overwhelming\nand top notch with detailed structure but the film cannot stand alone.\nFans of the books may enjoy it, otherwise it is an overrated spectacle\nwith the two towers being the previous film and the next one to which\nviewing this relies. Score: 6 / 10\n"},
{"review": "\nI was VERY disappointed by this movie when it came out. True, Jackson\ndoes a great job in bringing Tolkien's world to life, and the shots are\nepic. However, as a Tolkien fan, I find the film tantamount to\nblasphemy.<br><br>I understand that you have to remove parts of the book to keep the film\nat reasonable length, and I understand that you need to make\nadaptations of the story for the screen. What I don't understand is why\nyou take a literal masterpiece and remove most of it just to include a\nlove story that adds nothing, and isn't very romantic even. Apart from\nthe battle of Helm's Deep, almost none of the events are taken from the\nbook, and those that are have been changed beyond recognition.<br><br>I (re-)read each book prior to watching the movies - bad mistake! If I\ndidn't have the book in such fresh memory when I saw the movie, I might\nhave appreciated it more.<br><br>Don't watch this movie with the expectation that it's an adaption of\nThe Two Towers. It isn't. The story is rather based on the\nAragorn/Arwen story in appendix A to The Return of the King, with \"a\nlittle\" imagination from Jackson. They should have included much more\nfrom the book and made this story a movie on its own.<br><br>A love story staring Viggo Mortensen and Liv Tyler could have been a\nhit. It would have given the scriptwriter an opportunity to really\nfocus on the love between Arwen and Aragorn, and Arwen's decision to\nbecome mortal, thereby forsaking her chance to ever see her family\nagain. That's some powerful love right there! \"The Two Lovers\", as this\nmovie should really have been called, fails in capturing that love.\nNeither does it capture the sorrow Elrond must feel, knowing that he\nwill live an eternity without his precious daughter.<br><br>If you liked the movie, do yourself a favor and read the book for the\nREAL story.\n"},
{"review": "\nI love this movie! It's even better than the first one. I actually saw\nthis for th first time just weeks after I saw the first movie for the\nfirst time.<br><br>This has so many graphics and special effects, it's hard to know where\nto begin.<br><br>**Minor spoiler ahead.** <br><br>I like the part when you see a flashback, to when before Boromir was\nkilled. You see that Boromir and Faramir were the best of friends, and\ntheir father, who wasn't very nice to Faramir, seemed to only love\nBoromir. After Boromir is killed, Dethomir blames Faramir. But Faramir\nonly does what he feels is right. (Except for the time where he took\nFrodo and Sam to Gondor.) Not only is this a terrific movie, but it\ncould not have been better. It may be too long for some people, but it\nit not too long to me.<br><br>I think it is amazing that the two actors who played Boromir and\nFaramir have a certain resemblance.<br><br>It is only 3 hours and 43 minutes long, and there's at least a half\nhour alone on the credits.<br><br>If you like the first movie, you won't be disappointed in this movie.<br><br>My Score: 10/10.\n"},
{"review": "\nWell Lord of the Rings Trilogy is the best movies ever. Lord of the\nRings the Two Towers is amazing, with the Ents and the battle of the\nEnts. The flooding of Isengard. It's amazing stuff to see, honestly.\nSpecial affects are so well done. The extended one is obviously better.\nFangorn Forest is real beautiful place,so old n mysterious looking, I\nmean it. The braking of the Fellowshiphas happened, separated in three\nparts; Frodo and Sam on the road to Mordor, Merry and Pippin captured\nby the Orcs and Urak-Kais,Aragorn, Legolas, and Gimli on the pursuit to\nget Merry and Pippin back. A good thing that Gandalf is back, he's a\nreal help to the Fellowship. Also the kingdom of Rohan is so beautiful,\nvery viking looking.Honestly Fangorn Forest is the best part of the\nmovie. It's just so funny and emotional. Treebeard is so amazing, he\njust so slow moving, and he takes his time to do everything. It's quite\nawesome. The parts are also very well played(the hobbits are the best).\nIt's amazing, anybody who has not seen it should watch it. PETER\nJACKSON IS THE BEST DIRECTOR EVER!!!!!\n"},
{"review": "\nAlthough the expedition was in parts, the march was not over. Kind\nFrodo accepted bad Gollum without hearing the opinion of Sam. In fact\nwithout Sam, the task could not be finished. From the ending part of\nthe first film, we could see Sam was realizing his promise.<br><br>The ring began torturing Frodo. His flesh and soul suffered double\nstrike. But he still persisted in it. That was the hardest moment for\nFrodo in the journey. Insisting is just the victory. So does it in\nreality.<br><br>Although Saruman and Sauron were defeated, the dark lord Sauron still\nhad the ability to reorganize the dark army and attack the mankind\nagain. The peace for Middle-earth had not come yet.<br><br>The hardship in the journey deepened the friendship between Frodo and\nSam, Merry and Pippin. They endured the test, though the victory had\nnot come yet. A friend in need is a friend indeed.<br><br>As the second film of TLOTR trilogy, it is necessary and satisfying.\n9/10\n"},
{"review": "\nAs mentioned, Frodo and his buddies continue on their journey to\ndestroy that pesky ring. The first film left us with the Fellowship\nbroken and looking destined for failure, with Frodo and Sam continuing\non as a scared yet determined duo, and Aragorn, Gimli and Legolas\nmoving on to fight other battles elsewhere as the evil surrounding\nMiddle Earth continues to rise.<br><br>While the first film was all about setting up the story of the ring and\nthe Fellowship's epic journey across Tolkien's globe, The Two Towers\nthrows up a whole series of curve-balls which really gets the action\ngoing; Frodo and Sam must recruit Gollum to show them the way to Mount\nDoom, Saruman builds the strongest army of loyal (and ugly) soldiers in\nhistory and we get a visit from an old friend who returns bigger and\nstronger than ever.<br><br>What The Lord of the Rings series comes down to is a masterfully epic\nstory about a hobbit. While these movies could have been overwhelmed by\nspecial effects and CGI, Jackson understands the soul of the books were\nnot in the creatures and the battles, but in the characters that have\nto do things that go against their very nature in order to bring\nharmony back into their world. The Two Towers is a perfect middle\nsection to this trilogy and, like The Fellowship of the Ring, leaves us\nwith a cliff-hanger and a good reason to go see the next film. When all\nis said and done, these three films will forever be discussed as part\nof film history.\n"},
{"review": "\nAs the penultimate film representation of J.R.R. Tolkien's book series\n\"The Lord of the Rings,\" \"The Two Towers\" was a blockbuster hit in\ntheaters worldwide. Besides the fact that it was the film that would\ntie \"The Fellowship of the Ring\" to \"The Return of the King, \"The Two\nTowers\" closely and effectively portrayed the text of Tolkien's book\n\"The Two Towers\" which helped to rake in a large audience -\nparticularly those who knew Tolkien and his story of the Ring from his\nbooks. In terms of the film, Peter Jackson's excellent directing as\nwell as the award-winning performances delivered by the star-studded\ncast allowed for the attraction of millions of viewers. Also, \"The Two\nTowers'\" epic battle scenes and constant sequences of action\ncontributed to the film's overall attractiveness. Perhaps one very\nimportant characteristic of the film to note, however, is its special\neffects. Through the use of special effects, Jackson generated a film\nthat stimulated the imagination of the audience, especially those who\nhad read the book series, and brought them into a place where they\ncould easily imagine themselves in Middle Earth, watching Frodo's quest\nomnisciently. The quality of the film combined with its accurate\nrepresentation of Tolkien's book series both contribute to the epic\nnature of \"The Two Towers\" and also leave fans with an incredible story\nto remember.\n"},
{"review": "\nI enjoyed The Two Towers almost as much as Fellowship. I liked the\nHelm's Deep battle and still think it is better than any of the battles\nin Return of the King. However as with most epic movies I find the\nlittle moments are the ones that define it as great. A tree with it's\nleaves on fire rushing towards an oncoming torrent of water to put it\nout. The obvious happiness of Smeagol as he finally rids himself of\nGollum. Even Frodo's gradual slide into darkness as he spits venom\nevery now and then at Sam. These are what make up a great story and\nthat's what made Fellowship so great. The Two Towers are full of these\nas is the whole trilogy. The only disappointment in this film is the\nWarg attack. Very shoddy effects in an otherwise flawless movie. <br><br>Very well done on all accounts.( Apart from the Warg attack.)\n"},
{"review": "\nIn my view the two towers will go down as my second favourite film of\nall time behind (obviously) LOTR: Return of the King. The film proved\nto be a much better film than the fellowship of the ring mainly because\nof two things. Helm's Deep and Gollum.<br><br>Helm's Deep proved to be the most exciting siege film since The Alamo.\n10,000 urik-hai against a small guard of farmers, old men and stable\nboys proved to be like David against three Goliaths. At the end of the\nbattle mass audiences were stunned to witness a battle sequence as\nstunning as Braveheart in the part where Gandalf rides down the steep\nmountain with the Rohirrum as they attack the Urik-Hai to win the\nbattle.<br><br>This film had a bit of funny moments such as Gimli telling Legolas that\nhe could have picked a better spot to see the mass army. Plus the same\ntwo characters counting how many Urik-Hai they were killing during the\nepic battle scene.<br><br>New characters in The Two Towers included Miranda Otto (from War of the\nWorlds) playing Aragorn's secret love interest, Bernard Hill (Titanic)\nplaying King Theardon and David Wenham (Van Helsing) playing Boromir's\nbrother Faramir.<br><br>But the new character who led well was the CGI character Gollum who\njoined Frodo and Sam on their quest to destroy the one ring. His\nmutters of 'my precious' had giving cinema a new movie line to join\nothers.<br><br>Also impressive where the tree ents who helped hobbits Merry and Pippin\nto destroy Isengaard with an exciting action sequence.<br><br>Overall I preferred this film to Fellowship of the Ring and would say\nthat it is my favourite 'second film' to a trilogy! Awesome!\n"},
{"review": "\nThe epic saga continues, picking up right where the first left off,\ncomplete with hand sewn banners hung throughout the Golden Hall of\nRohan, hand-fashioned armor and elves!<br><br>These works are perhaps the best I have ever seen. In the genre of\nfantasy, this series is seriously in danger of having replaced Star\nWars as my all-time favorite movies.<br><br>The direction was of the very best quality. The sets, designs, props\nand backdrops were realistic and without flaw.<br><br>I highly recommend the extended edition, released in November 2003.<br><br>The scenes fully restored to their original glory before having some of\nthe detail and story line left on the cutting room floor, this\nproduction is as \"epic\" as they come; far larger than life. A task this\nformidable requires dedication, staying focused - both on the task at\nhand and in the creativity department.<br><br>Neither were lacking here. I honestly found not one moment of wasted\nfilm, not one single element which should have been edited out or\nomitted, not one performance which was lacking in any way.<br><br>While there WERE adaptations made to Tolkien's original literary work,\nI stand behind the creative decisions made, allowing that there were\ncontractual obligations to be met, and fully and thoroughly enjoyed\nthis darkling fantasy-filled adventure.<br><br>This work, with its story set at the edge of the fall of Man, was dark\nand twisted, yet leaving us with hope for Mankind's future. I thought\nJackson's work to be frightfully clever and wholly engrossing.<br><br>This movie (especially the extended version) is absolutely wonderful; a\ntrue credit to the whole industry. Too bad for us that Hollywood is not\nas bold.<br><br>As did the Fellowship of the Ring, the Two Towers rates a full 10/10\nfrom...<br><br>the Fiend :.\n"},
{"review": "\n\nI enjoyed The Two Towers when I first saw it in the theater.  I even went\nback to see it 3 or 4 more times.  Still, I didn't think it measured up to\nFellowship of the Ring.  There seemed to be too much emphasis on action, and\nnot enough on characterization and story development.  The film also felt a\nlittle rushed in places.<br><br>With Peter Jackson's \"extended version\" re-release of The Two Towers, it has\ngone from a very solid film to a truly great one.  At times I felt as though\nI was watching an entirely new film.  Critical story and character details\nhave been enhanced, the timing improved, and a couple of important scenes\nwere added.  I now rate The Two Towers slightly above Fellowship of the\nRing, which I still consider one of the greatest films of all\ntime.<br><br>There is no question in my mind that Lord of the Rings, treated as a single\nepic film, *is* the greatest film ever made.  There are no weak points now\nthat The Two Towers has been raised to the pinnacle.  Here, at the end of\nall things, I am glad the DVD is with me.\n"},
{"review": "\n\nIf you want to watch a film with great action, great effects, a great\ncast,\nand just basically great everything, but you're sitting on a couch in your\nliving room wasting away, get your sorry butt off that couch and go to\nyour\ntheater to go se this film because it's just OH MY\nGOODNESS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!<br><br>The action scenes are great, ranging from the 3-5 minute Warg attack\nsequence to the around half-hour Helm's Deep battle.<br><br>The Warg attack is just great of the pure drama from slo-mo close up of\nLegolas firing an arrow to a wide shot where he fires another arrow with\nall\nthe Rohirrim riders coming up behind him, then to him leaping onto his\nhorse.<br><br>Then the climax of Helm's Deep is great, beacause you have about 300\ndefenders at Helm's Deep, about 9-8000 Uruk-hai, attacking, then you have\n2000 Rohirrim led by Eomer and Gandalf charging down; it's like a biblical\nclimax.<br><br>The film also has a great film score (music.) Like the Lothlorien thematic\nthread played in battle mode when the Elven archers start the battle, to\nthe\nIsengard theme. Another great piece of music is when Aragorn is washed\nashore after he falls in the Warg attack, and the music for the Last March\nof the Ents.\n"},
{"review": "\n\nThe second of three masterpieces!!\nIt's a wonderful movie and you can't get enough of it, I've seen it 13\ntimes. The extended edition is even better (of course).<br><br>You got to see this (and the first) before you see the return of the\nking.\n// Madde\n"},
{"review": "\n\nThis is a review of the extended DVD version.<br><br>I will keep this short because there are so many reviews.<br><br>The extended DVD release of The Two Towers is a real improvement over the\noriginal theatrical release.  Note, that this version has more than just new\nscenes.  Almost all of the scenes have been re-edited in some way.  The\noverall effect is that the story moves much better and the story is easier\nto follow.  Even though the movie is longer, the pacing is quicker and\ndoesn't seem to drag as much as the original.  Likewise, the additional\nfootage both improves the characterization of the newly introduced\ncharacters and restores some plot threads so that other existing scenes now\nmake more sense (like the horse finding Aragorn).  It's also easier to tell\nwho is who because many of the newer characters names are now spoken more\noften.<br><br>So, just like with the \"Fellowship\" DVD, the extended version is really the\nonly version worth owning.  I already plan on only getting the extended\nversion of \"King\" next year.\n"},
{"review": "\n\nThe second Lord of the Rings film though it may not be as great in my\noppinion as Fellowship of the Ring is one of my favorite movies of all\ntime\nand one I can watch over and over again. The acting is phenominal and\nscore\nfor the film beautiful. I  would say that the only parts of the film that\npeople could have downfeelings about are the changes from the book. I\npersonally don't find them all that bad and rather quite enjoyable.\nAnyways,\nThanks Peter Jackson for bringing me something to wait for each December\nor\nat least for one more December!\n"},
{"review": "\n\nAbsolutely fabulous. I really don't understand the spotlighted review's\ngrudges against this movie.<br><br>Some points I thought I'd like to rebuke:<br><br>- He noted that he went to the theater thoroughly excited at the prospect\nof\nwatching a JRR Tolkien film of Lord of the Rings, when in fact the\ndirector's name is Peter Jackson. If he wanted the \"true\" Tolkien\nexperience\non celluloid, I hear there's going to be a projection of the unabridged\ntext\nonto a classroom screen somewhere in Oregon.<br><br>- He also noted that Return of the King is the longest of the trilogy. The\nFellowship of the Ring is the longest - RotK is helped along by the hefty\nappendices, which we can't expect to see in the movies. Thus, Jackson's\nmoving of Shelob to RotK is understandable when you realize that tTT\nactually has a ridiculous amount of stuff going on.<br><br>- As for his misspelling of Arwen, it looked more like Eowyn. In which\ncase,\nwhat movie did you see?<br><br>- A \"real\" Tolkien fan would have questioned the inclusion of the elves at\nHelm's Deep, or Faramir's sudden detour to Osgiliath. Anyway, why bother\nwhen we've been presented with this wonderful gift?<br><br>And that about sums up my take on this movie. I've just recently seen the\nextended version of the Two Towers, and I absolutely applaud the editing\nthat went into making this movie. While the deleted scenes are wonderful\nfor\nbackground and such, the finished and final movie that hit theaters is the\nstronger for the editing. It takes a director and crew with vision and\nquite\na bit of brass to make those decisions.<br><br>I will also note that one of the most compelling war scenes EVER is\nAragorn\nand Theoden leading the charge down the ramp and into a see of enemies.\nIn-cre-di-ble.<br><br>Here's to December 17th!\n"},
{"review": "\n\nThis movie is so good. It gives me that feeling I used to get when I was a\nkid and a new Star Wars flick was coming down the pipe. All of the modern\ntechnological advances in moviemaking find raison d'etre in this saga\nwithout smothering the story in large production 'pomp and\ncircumstance'.<br><br>Yeah yeah, we can all get p***y about how the story wasn't followed to the\nletter and how license was granted in the embellishment of certain\ncharacters but we have to see this work for what it is, a MOVIE. MOVIES\nare\nnot BOOKS. Anyone who uses this argument to downplay their opinion of\nJackson's (et al.) attempt needs to revisit my previous statement. You\ncannot compare the two works as if they were the same variety of fruit and\none is lacking in bouquet or has artificial color or flavoring. This\nreasoning is inherently flawed. Let's all give credit where it is due.\nTolkien is the master of his world. Jackson is obviously a maestro in his\nown arena. I am so stoked that he has accomplished this with such aplomb.\nIf\nwe want to get upset at modern movie adaptations of excellent stories, why\nnot pick on the Grinch or Interview With The Vampire or the impending\nAlexander The Great movie(s) (I may be jumping the gun on this last one,\nbut\nwhy anyone would highlight the sexual practices of the greatest, most\naccomplished leader of ALL time as if it meant something is moronic\nespecially considering the common practices of the day (I urge Baz and\nOliver to read some J.F.C. Fuller on Alexander, please!). I would venture\nto\nsay that, in the distant future if movie-like entertainment exists, no one\nwould make a big deal out of how our modern leaders conducted themselves\noutside of the diplomatic/political/militaristic arena.)<br><br>Hollywood misses the mark in so many ways. Why we would get so wrapped up\nin\nthis silliness is beyond me. Three cheers for Jackson and\nCompany!\n"},
{"review": "\n\nOh man, where's a thesaurus when you need one!<br><br>If you hadn't noticed, I absolutely LOVED this movie! Violence, greed,\npower, lust, corruption, betrayal ... it has all the makings of a biography\nof a congressional lobbyist, but without the glitter.<br><br>The first movie was a bit \"too busy\" for my taste. I prefer to inhale every\nnow and then. This movie seemed better balanced and even during the enormous\nfight scenes, there was enough pause to blink. <br><br>The bad guys seemed somehow more real in this version also. Maybe because\nyou got to hear some of them talk now and then. Seeing the monsters\nbickering about not having enough fresh food to eat and whining about doing\na five day forced march also made them (dare I say) .. more\nhuman.<br><br>Anyway, I can't wait for the final chapter.  I don't think I could survive\nthe 9-hour marathon viewing of all three chapters (my friends are all ready\nfor it), but I certainly will be in line for the first opening in my area\nfor the final chapter. If it's half as good as Two Towers, I won't be\ndisappointed.<br><br>Gee ... I guess I should go read the books now!\n"},
{"review": "\n\nWell, we just watched the new DVD extended version, and There are no words\nto say how good it is!<br><br>All the added sequences are a real pleasure, and the whole movie is so\nenjoyable now. It was before, but it is so much better!<br><br>Again, THANK YOU Peter Jackson and your team! I can't wait to see The\nReturn\nof the King... see you December the 17th :)))   \n"},
{"review": "\n\nI enjoyed the theatrical Two Towers even more than the first - it was\ndarker, more suspenseful, more action-filled, and introduced some of my\nfavorite characters. The extended edition gives viewers even more of the\nsame - more heart, more comedy, more action, more character development,\nmore sorrow, and more of a conclusion. My favorite scene in the extended\nedition is Faramir's flashback to a time spent with his brother and father.\nIt really shows more insight into this character, making him seem less like\nBoromir-lite. It also shows more insight into Boromir himself, before he\nleft for Rivendell, and introduced viewers to their father, Denethor, who is\nimportant to the third part of the tale. There's a lot more Merry &amp; Pippin,\nTreebeard, and Gollum. The DVD extras are fantastic, as we've come to\nexpect. Watch \"Cameras in Middle Earth,\" \"Tolkien: Origins of Middle-Earth,\"\n\"From book to Script\" and the entire special on Gollum and music and sound\nin The Two Towers. (With 4 hours of extras, these are what I found to be the\nbest) Really fascinating stuff here. The downside? The wait for \"The Return\nof the king\" seems even more unbearable now! \n"},
{"review": "\n\nWhat an excellent film.\nAgain, I will point out that I was not a fan of the \"Lord of the Rings\"\nbooks.<br><br>I saw the first movie and was blown away. It got my interest. Then I saw\nthis second installment, and I was even more blown away. And yes, everything\nyou heard about Gollum is true. He steals the show here.<br><br>But Gollum has alot of competition. I was so captivated by the battle\nscenes, they were real. If anyone really wants to see how a war is waged and\nhow it is fought (anything goes!), this is a place to start.<br><br>I am saddened that this installment did not get named Oscar Best Picture for\nout of all of the Nominees, I would have chosen this over the MUCH overrated\n'Chicago' any day. To do sequels in Hollywood is a mainstay these days.. but\nto Produce a sequel that is better than the first is rare (See the Godfather\nII for details) and this film is right up there with that kind of\nbrilliance.<br><br>A must not miss!\n"},
{"review": "\n\nIn order to make a watchable movie that is under 35 hours\nlong,\ntie it together thematically, and remain faithful to the overall\nplot,\nis no easy task. Many American and some European film-goers\nbelieve\nJackson should have done a word for word movie, but then again it's hard\nto\nhave some studio fund one movie that would require cots.\nMany American film-goers (mainly American teens), are angry there\nwere\nno heavy rock bands or rap in the movie, no Tarrantino type\nmindless\ngore and violence and no explicit sex. Many are angry that\nthis,\nGod Forbid, was a movie with European characters and that Will\nSmith\ndidn't play Frodo, and it was not a movie about an invalid or a\nconcentration camp (which seem to make up all of the Academy\nAward\nmovie winners for the last ten years). In short, in modern\nAmerica,\nwe want the kind of garbage you can see\nin still-born crap like the newest matrix - guns blasting every\nfive\nseconds, multi-cultural raves, mystical mumbo-jumbo and a\nmovie\nfilmed in a variety of shades of green.\nIf, on the other hand, you read the Lord of the Rings, loved it and\nunderstand a one-to-one translation to the screen is impossible,\nyou will love the Two Towers. I guess that is what is making alot of\nreviewers really angry - the Two Towers has gotten a very high\nscore\non IMDB. There's a great reason -the movie is excellent.\n"},
{"review": "\n\nI am in the \"purist\" camp and find Jackson's work to be almost\nunwatchable.\nI have read the entire Lord Of The Rings sequence at least 20 or 30 times\nthrough my late childhood to adulthood, and for all it's flaws it is still\na\nmasterpiece.<br><br>It is unfilmable, in Jackson's own words, so he has set himself up for\nfailure.  For all his technical prowess, and the amazing achievements by\nhis\ncreative team, this work lacks the depth of Tolkein's vision, and instead\nof\nrequiring of us some imagination, it blinds us with special\neffects.<br><br>Omissions are to be expected in a work of this scale - you can't take such\na\nlarge tome and condense it, even into three movies, without losing some of\nthe plot.  But why make up plots that aren't there?<br><br>In Jackson's middle earth, men are weak, prone to corruption, that is why\nIsildur takes the ring for himself and that is a theme that Jackson seems\nto\ncatch onto and run with.  Why?  There are other themes of Tolkein's which\nwere valid and valuable and would still speak to a modern\naudience.<br><br>I appreciate that Tolkein's work lacked strong female voices, and have no\nproblem with Arwen's character being built upon and extrapolated to a\ndegree\n- her \"rescue\" of Frodo in Fellowship is quite thrilling I suppose, but\nthis\nwhole dream sequence in TTT with a whinging Elf princess and her\noverbearing\nfather - characters I don't recognise whatsoever from Tolkein's work - add\nnothing to the story.<br><br>The sacking of Isengard by the Ents brought a tear of joy to my eye, but\notherwise I found this middle movie dull, unimaginative, and very much a\nvictim of \"hollywood spin\".<br><br>Let's hope the Return Of The King offers some satisfaction.\n"},
{"review": "\n\nTTT, like FOTR is one of the most phenomenal films to come out in the past\nten years.  Indeed, I would hardly be suprised if, in the future, the\nentire\ntrilogy is considered one of the greatest works of cinema ever.  Both are\n(and Im confident the third will be as well) beautifully scripted, layered\nin meaning, with outstanding effects and set design, all rolled into a (so\nfar) 6+ hour epic that seems all too short,\n"},
{"review": "\n\nUnbelievable, even better than the first one. J.R.R Tolkien have created a\nuniverse that takes your breath away. This is one of the best films\nthrough\nall times. I am dying to see the last and third film. Hopefully it will\nfollow up the two previous one's.\n\n"},
{"review": "\n\nPeter Jackson has one-upped even the stellar Fellowship of the Rings with\nthis cinematic masterpiece. This second installment in the trilogy makes\nup\nfor FOTR's arguably slow moving sequences through use of massive battle\nscenes, and a lot more character development.<br><br>There really aren't many downers in the movie, save for the length of the\nmovie - I can almost guarantee butt cramps and extreme tiredness. Drink\nsome\ncoffee before hand, and guzzle pop during.<br><br>All in all, this movie is a remarkable affair, and leaves one drooling in\nanticipation for the final movie.\n"},
{"review": "\n\nThis movie was even better then The Fellowship Of The Ring! When I saw it\nfor the first time I was completely filled with enthusiasm! Those 2 hours\nand\na half went by in just a second. Of course I had to see it again and\nagain.\nI can't wait to see the Return Of The King. Although I already know how it\nends, because I've read the book I am still looking forward to see it. So\nas\nfar as I'm concerned this is the best movie ever!  \n"},
{"review": "\n\nThis movie is great, I loved the first one as well. This one comes so\nclose\nto passing the first one but just narrowly misses. I thought the first one\nshould've won best picture as well. The best part about these movies is\nhow\nthe first one explained everything to the viewer, and the second one was\nfull of action. These movies should go down as one of the best trilogies\nin\nfilm history, second to only the Godfather. The lengths of the movies\ndon't\nbother me at all and actually are a joy to watch. Each character is so\nwell\nrounded that you feel for them all. What great movies, oh I can't go on\nforever. Please watch this movie, of course after you see the first one.\nIf\nyou enjoy good movies you won't be surprised to find out how great The\nLord\nof The Rings are, just a joy to watch. If the last one doesn't win Best\nPicture I think we should all boycott the Oscars.\ndon't's vote: 9/10\n"},
{"review": "\n\nThe movie is incredible.  The acting is incredible.  The scenery,\nincredible.  The romance and battle scenes are wonderful, and the\ngollum/smeagol character is brought more to light in this one.  The last\nscenes between Sam Gamgee and Frodo moved me to tears.<br><br>My only regret was that the movie is over 3 hours long.  When it was in\ntheaters I kept trying to find time to see it, but it was on at such weird\nhours, either requiring me to see it as a matinee or late late late, neither\nof which I was able to at the time.<br><br>Go out and get the DVD, you will not regret it.  It's a movie I want to\nwatch over and over again.<br><br>Like I said in my review for FOTR, this series has inspired me to read the\nbook, and both are very special for their own reasons.\n"},
{"review": "\n\n     I give TTT a 10, not because its perfect, but because its strengths so\nfar outweigh its weaknesses.  Like others it was disappointing to see the\ndivergence from the Book, particularly regarding Faramir and the Frodo/Sam's\ntrip to Gondor.  It didn't make Faramir more real to me, as the screen\nwriter argues, only less like Tolkien saw him (its sad that some people\ncan't believe that there are those who resist temptation).<br><br>     Otherwise the film is such a pleasure to watch and become immersed in. \nYou really get to see the world of Middle-Earth and experience the magic\nthat originates from Tolkien's Masterpiece.  Peter Jackson should receive\nevery award available for his beautiful depiction of TTT.  I was left only\nwanting more and would have been willing to sit through another 3 hours to\nsee ROTK immediately after, as I hear they are doing in some theaters the\nday before ROTK comes out in December.<br><br>     Golem was the best supporting actor ever in any film.  Yes he was CGI,\nbut he was a compilation of many hours of human effort and expression --\nbrilliantly done.  His character truly earned our sympathy and admiration\noften in the same scene.<br><br>     I laughed, I cried, I'm going to watch TTT over and over\nagain.\n\n"},
{"review": "\nPerhaps it's the lessened necessity for basic exposition, perhaps it's\nJackson's greater willingness to depart from the precise events\ndepicted by Tolkien, but for whatever reason, THE TWO TOWERS mostly\n(but not entirely) overcomes the superficiality and rushed feeling that\nmarred its predecessor.<br><br>That's not to say there isn't a misstep here and there: in particular,\nAragorn's fall and recovery is utterly pointless, and the Ents lose\nmuch in the translation to film. And TTT inevitably fails to capture\nthe depth and richness of the world Tolkien created, simply because no\nfilm possibly could. But as a movie, this one succeeds very well.<br><br>I may actually go see ROTK in the theater now.<br><br>8/10<br><br>(Addendum: Full series only 6/10. See\nhttp://us.imdb.com/title/tt0167260/usercomments-2224 for my\n{disappointed} comments on the last film and the series as a whole.)\n"},
{"review": "\n\nI have to admit, I'm completely won over by the masterful work director\nPeter Jackson has done with Tolkien's \"Lord of the Rings\" trilogy.  I'm not\nparticularly a fan of George Lucas' \"Star Wars\" movies and thought the \"Star\nTrek\" films to be inconsistent, so fantasy isn't exactly my thing.  But\nafter watching \"Fellowship of the Ring\" and \"The Two Towers\" back to back\nthe past few nights, I'm absolutely stunned by the magnitude of the\nachievement here.<br><br>This film picks up right where the first installment left off, with the\nfellowship having dissolved.  Frodo leaves with Sam as company so that he\nmay take the ring to Mordor and destroy it in the fire from which it was\ncreated.  The others leave to fight the battle for Middle Earth as Saruman\nhas unleashed his army from Isengard.<br><br>The battle scenes between the men of Rohan and their elf allies against the\nurik-hai, the half men, half orc creatures bred by Saruman, are amazing. \nDigital technology plays a major part in these scenes, but as mentioned in a\nprevious review, it is so seamless with the real cinematography that the\nresult is just stunning.<br><br>Gollum, a digitally created image, plays a major part in this installment. \nHe's one of the classic characters in Tolkien's work, and I wondered how\nthey could possibly portray him as I imagined, but the result is perfect. \nThe digital artists struck just the right balance between a prowling little\ncreature attempting to regain the ring and a pitiful figure twisted by its\npower.<br><br>Like the first movie in the trilogy, this one is long (three hours plus),\nbut it's such an epic film and full of so many characters and so much\ndetail, that you're sucked in anyways.  At times, you're reminded of\nShakespeare, and at other times one of those Disney cartoons from before the\nwar, like \"Snow White.\"  <br><br>These films are a wonderful creation and I hope everyone enjoys them as much\nas I have.  \"The Return of the King\" should be awesome.<br><br>\n"},
{"review": "\n\nTwo towers is even better then the first LOTR movie. The battle of Helm's\nDeep is great and i can't wait for the final movie. I would have liked to\nsee Shelob but it works out good for the movies. I can't wait and see how\nthe work it all in with the 3rd movies.\n"},
{"review": "\n\nMan, director Peter Jackson is 2 for 2 for Lord of the Rings.  Lord of the\nRings: The Two Towers is the second part in what many are already saying\nis\nthe greatest trilogy in film.  LOTR: TTT  is just as good as Fellowship if\nnot better in some aspects.<br><br>New characters are introduced and they are just as interesting as the\ngreat\ncast of the first film.  Bernard Hill is noticeably good as King Theoden\nwho\nhas a powerful scene at the grave of his son. I also liked Faramir.  Yes,\nhe\nis different from the book but I thought David Wenham's performance was\nheartfelt and real.  Miranda Otto(Eowyn), Karl Urban(Eomer), and Brad\nDourif(Grima Wormtongue) round out the great new cast.<br><br>The special effects  are more frequent and extremely impressive.  Gollum\nis\na great acheivement in computer effects and definitely the most believable\ncomputer generated character.  Treebeard and the ents also look fantastic.\nAnd the computer generated warriors at Helm's Deep are a sight to\nbehold.<br><br>This film is filled with so many great moments that it's hard to pinpoint\njust one.  Gollum/Smeagol's duality, Ents storming on Isengard, The Battle\nof Helm's Deep, Frodo offering the Ring, Gandalf's ride to victory, and\nSam's final speech are all fantastic.  See this film.  Great performances,\nincredible special effects and intense action make Lord of the Rings: The\nTwo Towers the best film of 2002.  Bring on The Return of the\nKing!\n"},
{"review": "\n\nI've read the books a Million times and watched FOTR a thousand times.\nThen\nI went to the cinema to watch TTT. When I came out, I felt awful. I just\nhad\nthe greatest disappointment of my life! I just think, how bad ROTK must\nbe,\nwhen they try to squeeze all the things they missed in TTT into it!<br><br>SPOILERS AHEAD!!<br><br>Since when can you ride down a mountain with almost 90 degrees angle? And\nsince when can you ride into an army with long spears without being\nkilled?\nAnd didn't this white stick of Gandalf just look like plastic? And what\nabout these unnecessary changes in the film? When they would have left\nout\nthese, they could have put the scene with Saruman and Gandalf and also\nShelob's Layer in the film! I just hope that they don't leave out the\nscenes\nin ROTK where they go back to the shire and kill Saruman and also the\nscene\nat the grey havens. That would be really bad..\nBut I'll buy the Extended Edition of TTT and I will also watch ROTK more\nthan once in the cinema. I just hope that I don't get bored until\nthen...\n"},
{"review": "\n\nWithout a doubt \"The Two Towers\" is a magnificent epic motion picture even\nthat will go down into the list of Classic Movies. It's bound to pop up on\nseveral top-100 movies list and will probably end up in my DVD\ncollection.<br><br>(!! SPOILERS SPOILERS SPOILERS !!)<br><br>There's only one problem. THIS IS NOT THE STORY TOLKIEN WROTE! The story was\nchanged too much. What's with Aragorn falling from a cliff into a river and\ngetting saved by Trigger, the world's smartest horse? Pah! Pooh! Ack! What\nabout the Uruk-Hai Orc yelling \"Looks like meat's back on the menu, boys?\"\nUgh! Eeek! Pooh! And let's not forget that when they made Faramir mean they\nmade him BORING! And why wouldn't Treebeard want to fight while in the book\nhe clearly wanted to? <br><br>Because Peter Jackson either does not understand the intricacies of the book\nor he just ignored it.<br><br>Not too mention some of the changes brought into the book ONE MASSIVE\ninconsistancy. When Faramir takes Frodo and Sam to the besieged city (which\nwas obviously inspired by \"Saving Private Ryan\") one of the Ring Wraiths\nattempt to seize Frodo. The inconsistancy lies in the fact that he has been\nspotted. So this is how it works; if the Black-Riders Ring Wraiths know, the\nSauron Knows. If Sauron knew the Ring was so close then he would have send\nall his forces to that spot to capture Frodo and the Ring. Since, in the\nmovie, this didn't happen, we now have something that does not make sense.\nThe Dark Lord would have guessed what they were up to and would have tried\nto stop them.<br><br>Another major problem is the fact that Jackson threw out all of Tolkiens\nsubtleties and blew everything out of proportion. (Although the part where\nthe Ents rampage through Isengard is still a great view! Ha!).<br><br>Sigh. \"Fellowship of the Ring\" had it's forgivable faults. \"The Two Towers\"\nis almost unforgivable.\n"},
{"review": "\n\nThis movie was so great!!! I mean everything of it was excellent: the\nstory,\nthe actors, the special effects, the music...every single thing of it was\nperfect. And I can't believe so many people are saying that it wasn't\nthat\ngood just because some chapters of the book weren't in it and it's crazy\nto\nnot like it for that reason because it's impossible to make a 9 hour\nfilm...so I'm sorry to say this but those people are blind and don't know\nwhat a wonderful movie is...\nAnyways, every moment of TTT was incredible that I hardly blinked! Thank\nGod\nPeter Jackson made this amazing movie for all of us!!!<br><br>If you like fantasy movies, I promise you'll not get bored or anything\nlike\nit!!!\nI'm definitely going to buy the DVD of this incredible\nmasterpiece...\nAll the things I've said make THE LORD OF THE RINGS: THE TWO TOWERS one\nof\nmy favorite movies!!!(of course my other favorite movies are FELLOWSHIP\nOF\nTHE RING and RETURN OF THE KING even if it hasn't come out, I'm sure I'll\nlove it!)...\nI give this movie 10/10 and if I could, I'll give it more than 10!<br><br>I loved it!...MY FAVORITE MOVIE!!!!!!!!<br><br>~*!!!PEACE!!!*~<br><br>\n"}
]