[
{"review": "\nMost on this site pick the Godfather, or the Shawshank Redemption, but\nthis is it, this is the best film ever made. People will complain, will\nargue that I am wrong, but I will say it again...Braveheart is as close\nto perfection as a movie can be. The acting is superb, the man who\nplayed Lonshanks, the actor who portrayed Robert the Bruce, both should\nhave been nominated for Oscars due to their powerful rendering of evil\nand a man who is saved from losing his humanity (from becoming evil) by\nmeeting William Wallace. And let us not forget the direction, the\ncinematography. Braveheart is glorious, beautiful to look at. The slow\nmotion pictures of horses preparing to charge armed combatants, the\nentire landscape of Scotland that Mel Gibson captures with the camera.\nBraveheart is artwork, it is as good as any picture. That the film is\nnumber 93 on the list of the top 250 movies ever is a shame. Yes there\nis violence in this film but that violence does serve a point...that\nfreedom isn't free and sometimes it takes death, gruesome and horrible,\nto let ones people taste what it is like to be free. Braveheart is a\ngreat movie and it deserves to at least be in the top ten of IMDb's\nlist of greatest films.\n"},
{"review": "\nI remember seeing this movie for the first time in late 2003, and I was\nimpressed. I saw it again last night, and I was even more impressed.\nThe acting is amazing, and the ending was brilliant. For me, all my\nguesses were incorrect. Everything that happens in this movie in\nunpredicted. The last half hour itself was highly unpredictable, and it\nhad a powerful message. When a scene was meant to be dramatic, they did\na great job at it. I don't know about everybody else, but the ending\ndid make me cry. The message the movie sent kept me thinking for a\nwhile. The amount of courage and bravery was inconceivable, there was\nbarely any faults or anything wrong with the movie. For a movie of\n1995, they did a great job.<br><br>I absolutely guarantee this movie to anybody who enjoys action and war\nwith a bit of drama mixed in. One of the best, or maybe even the best\nmovie of the 20th century.\n"},
{"review": "\n\nOn my list of the greatest movies of all time, BraveHeart ranks as number\n3.\nIt is by far one of the most epic stories ever told.  Mel Gibson deserved\nall the credit he recieved and more. His portrayal of William Wallace, one\nof Scotlands most mightiest warriors, was spot on.  The only part that\nlacked was the romantic affair of Princess Isabella and Wallace.  It\nhistorically never happened.  This movie also has other historical errors\nbut WHO CARES!<br><br>The Battle of Stirling has to be the second most graphic piece of footage\never shot next to Omaha Beach in Saving Private Ryan. I love the part where\nthe English Commander gives the order to charge and Wallace sees this and\nraises his broadsword into the air and starts yelling.  He charges the\nfield\nwith the Scots and I'll let you see the movie to see what happens\nnext.<br><br>Wallace's emotional speech at the battle of Stirling still is inspirational\nand I think that the REAL William Wallace would be proud of the way Mel\nGibson portrayed him.<br><br>My hat goes off to Mel Gibson.  I hope he makes a few more movies like this\none.<br><br>Out of ten............10/10!\n\n"},
{"review": "\nUnfortunately, I wasn't able to watch Braveheart till 2003 when it was\non TV. However, the lack of theatrical effects never stopped me from\nbeing mesmerized by this epic for one moment. So mesmerized, I\nliterally sat motionlessly on the couch for two minutes after the\nmovie. Any normal audience would likely to cast his/her sense of\nreality away and be captivated by this distant Celtic saga. <br><br>Beside proving himself as a brilliant director, Mel Gibson more\nimportantly gave life to a historical hero whose superb gallantry,\nvivid character and magnificent spirit shall never be history. Along\nwith the unforgettable 'Alba gu bragh!' and the unprecedentedly\nheart-stopping 'Freeeeedom', Braveheart unquestionably is one of the\ngreatest movies ever made.\n"},
{"review": "\nThis is simply the best movie ever made, containing all the elements a\nperfect movie should, even considering that every person has a right to\nhis/her opinion. The soundtrack is amazing, the scenes are ingenious\nand the story is simply excellent! This is a story about a Scotsman\nnamed William Wallace (Mel Gibson) and his fight for the freedom of the\nScottish people, from the oppression of the English ruler-ship. After\nseeing the death of his wife at the hands of an English nobleman,\nWilliam Wallace (Mel Gibson) sets out on a quest for vengeance that\nquickly turns into a crusade for freedom for the entire \"country\". The\nextreme violence as well as the human compassion in this movie are\noverwhelming in its brilliancy.\n"},
{"review": "\nI saw this film for the first time on cable, and, fortunately, it was\nan \"uncut\" version. I was greatly impacted, but, as bad luck would have\nit, I would not see it again for two years.<br><br>Mel Gibson is an accomplished actor, with films like \"Mad Max\" and\n\"Lethal Weapon\" under his belt. \"Ransom\" showed he was more than just a\nquirky role actor, but it was \"Braveheart\" that proved to everyone that\nhe was a great actor... and director.<br><br>What he has envisioned and ensnared on camera is one of the great\ncinematic achievements of all time, and at an awkward time, too.\nLooking back at previous years at the Oscars, and you have \"Schindler's\nList,\" \"Dances with Wolves,\" and \"Unforgiven.\" Looking ahead, you have\n\"Titanic,\" \"Shakespeare in Love,\" and \"Gladiator.\" These are all period\npieces. Right smack dab in the middle is \"Braveheart.\" It is the most\nsimple of the films above, yet it is arguably the best. None will argue\nits impact is greater than \"Schindler's List\" nor its power greater\nthan \"Unforgiven,\" but what it has, more than any of those other films,\nis heart. Much like his \"Passion of the Christ,\" Mel Gibson brings a\npassion to this film, and that is what sustains it.<br><br>Mel Gibson plays William Wallace, a well-educated Scottish peasant who\nis determined to lead a peaceful life. Well, if you've seen the poster\nfor this film, you probably already know that he doesn't succeed. When\na law is put into place that says English noblemen have first right to\nlay with Scottish brides, Wallace marries in secret. But, when it is\nfound out, a local noble attempts to take Murron, Wallace's wife, she\nresists, leading to a gruesome execution. With little choice, Wallace\nopts for vengeance, and thus begins the journey of Scotland's greatest\nwarrior.<br><br>This is a wonderfully acted, directed, photographed, and designed film\nwith great performances, particularly from a breathtakingly beautiful\nSophie Marceau, and I recommend it wholeheartedly.\n"},
{"review": "\nThis has to be one of the best movies I have ever seen. I recently\npurchased it and have watched it at least five times since then, and\neach time i pick up on things I did not see the other times. The fight\nscenes are great, the plot is both interesting and thought provoking,\nthere is romance and comedy. This is a movie that any person can\nappreciate at some level. <br><br>True, the historical content may have been distorted, but even though,\nthis movie is meant for entertainment. It is not a history lesson\ncaught on video.<br><br>The acting is absolutely superb, this movie is guaranteed to have you\non the edge of your seat for the entire three hours.\n"},
{"review": "\nUnfortunately, I have yet to find a film of quite this caliber again.\nBraveheart contains elements of Romance (several heart- wrenching and\nwarming instances), Epic/Action (spectacular scenes), Mystery (can take\na few viewings to put it all together), History (albeit romanticised)\nand of course Drama (perfectly unravelled). This level of uncompromised\nmulti-tasking allows the film to move you to laugh and cry, love and\nhate or even to think and be taught. I'm trying to avoid the clichés of\nglowing reviews (almost as bad as entirely negative ones) - but this is\none of the few movies that I feel deserves one.<br><br>The witty banter between friends/foes/lovers/relatives is, in my\nopinion, flawless and aids the film's claim as a true classic. The\nsoundtrack is similarly top-notch and encapsulates and refracts the\npatriotic theme during several key moments. The political sub-plot and\ngorgeous scenery also serve as refreshers during otherwise heavy areas\nof the story. Perhaps Braveheart's only flaw (but if you share my\nsentiments it's actually a bonus) is its length so you'll want to\nprepare a comfy seat and maybe even two pots of tea (complete with\ncosies!).<br><br>I suppose it's also relevant to touch on the historic inaccuracies as I\nexpect this is what people might dislike most about this film. However,\n\"History is written by those who have hanged heroes\"; also, the overall\nsketchiness of such periods coupled with the right of artistic license\nare enough for me to personally dismiss such thoughts. On that note, I\nhope you also enjoy what, to me, is the greatest film created (so far).\n"},
{"review": "\nThis enthralling movie Braveheart takes a viewer's breath away. The\ninvigorating battle scenes, the incredible acting, and the fierce power\nof love all captivated me when I first saw this movie. James Horner's\nmusic is a masterpiece--it adds elegance and dimension to the\nmagnificent film. Mel Gibson's zealous passion as his character William\nWallace is truly an inspiration. Scots are very dignified, highly\nrevered people, and this movie really presented Scotland's pride.<br><br>Everything in this film was done tastefully. Even the ending, which by\nthe way is heart-wrenching, was done artistically, as Wallace sees his\nwife during such a traumatizing event. Of course, nothing was better\nthan the rich satisfaction of watching Wallace scream for freedom,\nfreedom and not mercy. This epic film must be watched again and again.\n"},
{"review": "\nThe Best film I have ever seen. And the most successful one which has\nstayed in Turkish cinemas 2 years in a row. Having watched this movie\nmore than 200 times, I am declaring it as my whole life's movie.\nSpecial side characters, as Steven, Hemich and most of the rest remind\nme of a huge history \"wirtten by those who have hung heroes\".<br><br>When dying in your beds, many years from now; Would you be willing to\ntrade, all the days -from this day to that-, for one chance -just one\nchance- to watch this film and tell everybody we know, that they can\nwatch lots of movies but they will never watch any Braveheart quality\nmovie again..\n"},
{"review": "\nThis is an emotional, involving and ultimately draining film. By the\ntime you are done, you are spent. <br><br>What makes this movie so intense is the passion of the main character:\nScottish rebel leader William Wallace, played by Mel Gibson, who put\nhis heart and soul into this performance. Add to that a powerful story,\ngreat cinematography, excellent action scenes and even some\nhumor....and you have a classic film.<br><br>Patrick McGoohan shines as the evil English king and Sophie Marceau,\nAgnus McFadyen and Catherine McCormack all contribute. I'm sorry the\nlatter had such a short role as her beauty captivated me very much. All\nthe characters in Wallace's \"army\" are fun to watch, too.<br><br>For those a bit queasy with bloody violence, this is not a movie for\nyou. There are lots of gory action scenes that includes limbs being\nhacked off. This is not a film for the feint of heart. The only\nobjection I have to the violence is the ending. Seeing a man tortured\nis not my idea of entertainment. I now fast-forward through that part\nbut otherwise thoroughly enjoy the rest of the three-hour film, an\n\"epic\" adventure, if there ever was one.<br><br>The most memorable scene in the film, for me, was not any of the action\nscenes but just the absolutely stunned look on Gibson's face when he\ndiscovers his trusted ally was anything but that. To discover that the\nkey people in the country that you are fighting for are not backing you\nmust have been indescribably crushing to, although since this is the\nmovies I don't know how accurate this was to the real story. Whatever\nthe accuracy, it's a great film and belongs in anyone's collection of\nepic-adventure masterpieces.<br><br>The Blu-Ray transfer, by the way, is spectacular.\n"},
{"review": "\n\nIf you are a Mel Gibson fan of any sorts this movie is a must see. A\nwonderful directing job, supported by a wonderful cast. Men will appreciate\nthe attitude depicted by Mel Gibson towards his love and his country along\nwith the added violence. Women will swoon and pine for the hopeless\nromantic\nthey will find in Mel as he avenges the death of his wife and fights for\nthe\nfreedom of his fellow countrymen. This movie gave me a whole new respect\nfor\nMel as a director and actor. In my opinion it is the best movie Mel has\nmade\nto date.\n"},
{"review": "\nThe biggest heap of dog dung ever to be unleashed on the cinema going\npublic. Absolutely no redeeming features other than the soundtrack.\nCrap story which bears no relationship to historical fact, acting and\ndirection woefully poor and the accents are a joke (save for James\nCosmos-a genuine Scot, so he should have been expected to get it right)\nBattle scenes are straight out of Monty Python. With legs getting\nchopped off and the victim toppling over, you half expect one of them\nto get back up and say \"Come back and fight you coward\" like the Black\nKnight in \"Monty Pythons Holy Grail\" A totally one sided perverted,\ntwisted version of history. Presumably made to pander to the sort of\nScottish football fan yobbo who hates everything English and blames all\nthe worlds ills on those south of Hadrians Wall. One thing I would\nagree, at the end when \"wee Jimmy Cranky\" (Gibson) screams \"Freedom\" I\nfelt the same way, at last it had finished and I could get out. This\nshould have been a great film given the true facts of events at the\ntime. Suggestion to Mel Gibson, next time don't let your prejudices\nrule your head and read a history book!!\n"},
{"review": "\nAnother Mel Gibson film that ignores history and decides to make it up,\nthe Irish never joined the Scottish. Wallace wasn't a highlander, he\nfought for himself, not his country. Also princess Isabelle was 6 at\nthe time and in France. They portray the Scottish as farmers with\nsticks in this, in reality they had the same equipment as the English,\nLongshanks son was not gay either. I could go on but i don't think this\nmovie deserves it. I suppose this is a good film for anybody that\nthinks they are a Scottish patriot and choose to ignore history, this\nfilm is so stupid i cant believe people actually believe this stuff\nhappened.\n"},
{"review": "\nMel Gibson really does seem to have a downer on the English doesn't he?\nBut my dislike of this film is certainly not based on some misplaced\njingoistic pride.<br><br>I'm quite a history fan and I don't mind at all when the sins of the\nfather are hung out to dry. But I do insist on credible - don't insult\nmy intelligence with a pantomime villain and romanticised plot\ndevelopments. William Wallace was the father of Edward III? Give me a\nbreak, Edward II having other um, 'interests' doesn't mean he couldn't\nfather a child, or that his wife is likely to sleep with Scottish\noutlaws.<br><br>As for Edward, the ruthless, brilliant strategist and general; getting\nhis archers to fire on his own forces in a mêlée - yes that must be how\nhe was so successful a military commander. Confidence and\nloyalty-inspiring stuff.<br><br>The only difference between this and the Alan Ladd Knight of Olde\nfifties Hollywood crap is that you saw people's arms being chopped off.\nYes, the violence is more realistic. That's it.<br><br>I prefer my corn on the cob, not the screen.\n"},
{"review": "\nBraveheart has to rank as one of the most overrated movies in the\nhistory of cinema. Yes it is visually stunning and the battle sequences\nare extremely well done, but it is historically inaccurate and portrays\nthe English in such a bad light that the film has been used by the\nScottish National Party to whip up support. This distortion of history\nis, sadly, all too common in Hollywood film making. <br><br>If and when the United Kingdom breaks up then Mel Gibson can smugly\nboast to have played a part in its downfall. The fact Braveheart won 5\nOscars awards also shows how politicised the ceremony is. <br><br>Rated 1 / 10\n"},
{"review": "\n\nAs an adventure yarn Braveheart works, as an historical retelling of the\nscots rebellion it is just nonsense. It has as much in common with\nthirteenth century Scotland as hobbits and rings have. Mel Gibsons'\nWallace\nshould not be confused with the William Wallace whose monument and statue\nstand just outside Stirling overlooking the battlefields of the river\nForth.<br><br>As a Scot, I am saddened that Mad Max ( or should that be Mad Mac?) has\nsupplanted the identity of the real Wallace. Ahh the power of\ncinema...\nand its irresponsible use!\n"},
{"review": "\n\nThis movie can lay claim to the most refreshing interpretation of Scottish\nhistory (ie, ignore the facts, concentrate on the story).  It may well have\nthe best Scottish accent ever in a major movie picture by an American-born\nAustralian actor.  Or perhaps the best movie recreation of a Renaissance\nFair recreation of a generic medieval battle (with added blood).  But its\nchief claim to fame is without doubt in the category of best historical joke\nin a major motion picture  - the suggestion that William Wallace (died 1305)\nfathered the future Edward III of England (born 1312).<br><br>William Wallace deserved a better movie.  So did I.\n\n"},
{"review": "\nThis is not all bad, but it's definitely not all good either... and I\nam simply amazed that this tripe won an Oscar.<br><br>It's overlong, over-sentimental and (I gather) historically inaccurate.\nI'm not sure that this matters although it's a fine line with these\nhistorical dramas - I'd like to think that they are based on the facts\nand I can learn a bit about the world...<br><br>The battle scenes are certainly impressive, but gory and indulgent. The\nlove interest with the princess is just laughable, and Mel's acting\njust didn't work for me - with his piercing blue eyes and haughty\ncarriage, I felt at times (especially when he rides on horseback with\nhis arms spread in a show of submission) as if he was imagining himself\nas a messianic figure - but with a false humility, a fake messiah.<br><br>I did come away wanting to know the real history, but I also came away\nfeeling unfulfilled, that I had been fed a load of er manure, shall we\nsay.\n"},
{"review": "\nWhere shall I start? How about the French princess? She was only 12\nyears old at the time. And it is ludicrous that William Wallace was the\nfather of Edward III. The Irish could not have changed sides at the\nBattle of Falkirk for the simple reason that they were not there.\nEdward I did not order his archers to shoot his own men in the back.\nThey had already discharged their arrows before battle was joined. And\nthat final wild charge by the Scots at the Battle of Bannockburn, when\neverybody knows that the Scots fought defensively arranged in\nschiltrons armed with long spears.<br><br>And the English armour? Some of it looks more like birdman costumes.\nThe archers have better helmets (basinets) than the infantry, while\ntheir bows are just branches with the bark stripped off and a piece of\ntwine attached. Looks like the film makers reached the bottom of their\npurse with the archers, because they couldn't kit out the English\narmy's Gascon crossbowmen, who are conspicuous by their absence on\nFalkirk field.<br><br>The English may have been guilty of some atrocities, but prima nocte\nwas not one of them.<br><br>I could go on, but I won't.<br><br>But I suppose Shakespeare took liberties with history too. And they\ncall him a genius!<br><br>Having said that, Mel Gibson makes a believable Scotsman, and James\nCosmo is terrific as Campbell, and I liked the princess's oversexed\nmaidservant. Also brilliant is Patrick McGoohan. His scene where he\nthrows that guy out the window is the best bit of the film.<br><br>I know this film stirred up a bit of Scottish nationalism. I don't have\nany problem with that, but if you are going to get worked up, get\nworked up over the facts.<br><br>I should know: it's MY country. It belongs to ME.\n"},
{"review": "\nThis is the first time I have felt the need to review a movie. As an\nEnglishman who has recently re-watched Braveheart I can't keep quiet.<br><br>Had i wrote the review back in 95, I would have gave it 9/10. Because\nas a movie I really enjoyed it. However, that was back in 95 when I was\nfairly ignorant and just wanted to be entertained. Now, a little older\nand wiser the main issue I have with this movie is; it is a work of\nfiction masquerading as fact. You can't search William Wallace on the\ninternet without it making reference to Mel Gibson's character. The\nmovie is littered with blatant one sided inaccuracies; However I'm not\ngoing to list them here; many of the reviews have, so read some of them\nbecause I don't want to add spoilers. I realize a lot will be thinking\nI need to lighten up a little and just enjoy it as a movie... but\nHollywood, it's not your history to be re-writing. How would an\nAmerican audience feel if the British made a movie about Vietnam, or\nthe American Civil war, or the Indian Wars, and then depict all the\nAmerican inaccurately as lying, murdering, rapists cowards. There\nwasn't a single honourable Englishman amongst them. As far as I'm\nconcerned this was a missed opportunity to tell the story of William\nWallace accurately while still making a great movie. William Wallace is\na national hero to Scotland so to retell his story inaccurately is an\ninsult to both sides.<br><br>Having just re-watched this and having vivid memories of The Patriot\n(same movie, only the accents differ) I have vowed never to watch\nanother Mel Gibson movie, in the vague hope that he'll stop making\nthem. Because of everything I have said and read about this movie I\ngive it a protest vote of 1/10, only because it didn't give me the\noption of 0/10.\n"},
{"review": "\nI'm an American but with a Scottish heritage so I suppose it would be\neasy for me to overlook blinding disregard for history in the case of\nthis movie. However, I just can't. There's no excuse for this. If you\nwant to make a hack/slash film, either make the characters fictional or\nmake them at least kind of historically accurate, not neither. William\nWallace and the princess didn't even exist in the same time period, let\nalone fall in love. What the h*ll is going on here? The film itself\nreally isn't bad. The cinematography is outstanding, but I just can't\nsuspend disbelief enough to enjoy it. This ranks up there with the\nawful movie \"Pearl Harbor\" in terms of historical accuracy, if \"Pearl\nHarbor\" had included a scene where the Japanese dropped a hydrogen bomb\non Hawaii.\n"},
{"review": "\nThis movie is almost two decades old now and as is often the case with\nblockbuster films, I'm just now getting around to seeing it for the\nfirst time. My timing is kind of serendipitous too because Scotland\nwill be voting on leaving the UK next week on September 18th, 2014 as I\nwrite this. It's pretty much a toss-up on how it goes, though whatever\nthe outcome, the geopolitical consequences will be felt for a long\ntime.<br><br>Mel Gibson and Kevin Costner are a couple of names who frequently find\nthemselves involved in controversy for their projects. In recent years,\nGibson has been at the center of some embarrassing personal exploits,\nbut there's no denying he's had a major impact on film making with\nmovies like \"Braveheart\" and \"The Passion of the Christ\". Both films\noffer an epic sweep and are cinematically dynamic. The battle scenes in\n\"Braveheart\" are among the most expansive and realistic as you'll see\nanywhere.<br><br>But as with most historical films, and I've learned this all too well\nby now, what you see is not necessarily what the world got at the time.\nI don't think such departures from accuracy are always meant to be made\nfor the sake of revisionism, nevertheless they detract from a film's\neducational value. So one's approach to \"Braveheart\" probably ought to\nbe made from the standpoint of an epic period drama with it's attendant\npersonal stories thrown in as human interest. That's what you have here\nwith this Best Picture winner and the award is well deserved on that\nscore. Personally, I have my doubts whether the Scots ever mooned the\nBritish at the Battle of Stirling.\n"},
{"review": "\nFighting for freedom an't always go the peaceful Gandhi way. In order\nfor true freedom in brutal times to come as peaceful as possible,\nrevenge was essential. During the 13th century a war hero from Scotland\nnamed William Wallace experienced the cruelty and corruption the\nEnglish enforced on the Scottish. Violence, corruption, rape, and rule\nwere all used to take complete advantage over the Scottish until\nWallace started a powerful rebellion to become a war hero and lead the\nScottish to fight against the English in order to restore freedom and\npeace. William Wallce's incredible story is shown through the eyes of\ndirector Mel Gibson. Gibson envisioned the history of the tension\nbetween the two United Kingdom provinces beautifully, as he captures\ngroundbreaking film-making to portray a biography and historical film\nlike no other film has ever gone. Every shot is so intriguing and\nrelevant to the story. The film-making aspects such as cinematography,\nsetting, costumes, and editing are superbly made to make the history\ncome to life. The filming of the Scottish highlands is magnificent and\nbeautiful and really gets a feel of what warfare in the 12th century\nlooked like. Historical films can often be dragged out and too\nbiographical to tell a story as if it came from a history book. Writer\nRandall Wallace gives great background that is timed perfectly and\ndeveloped the struggles and inspirations for William Wallace that\nleaves Mel Gibson to direct and portray William Wallace beautifully. He\nnails the Scottish accent! As for themes, freedom is a virtue that is a\ngift! Freedom is something that is a privileged to have and should be\nfought for if needed. Gibson and Wallace also get the message of\nfighting for anything. Not violently like William Wallace had to, but\nfighting in any way in order for good outcomes to be released. This is\na classic film that is one of the best of the 90's, and is the greatest\nhistorical biography film ever directed.\n"},
{"review": "\nOK, so it was not 100% accurate in content or historical detail but\nthat aside, it was one of the greatest films that has yet to be truly\nmatched. The cast performed very well as this well written tale was\ntold. Even though it is over 10 years old now, it still holds a place\nin my heart as one of the best. The accuracy of the battle scenes are\nonly eclipsed by the expressions of the actors faces as they share this\nstory. Stephen the Irishman steals the show with his plucky comic\nrelief. Hamish the sidekick does a great job playing against the over\nthe top performance of Mel Gibson. The predominantly European cast does\na great job of not needing to fake accents and mannerisms. I have\nwatched this film several times and every time I see something more\nspecial.\n"},
{"review": "\nDid Mel Gibson actually read any books on William Wallace? A brigand\nthat ransacked and raped his way across the borders is turned into a\nmatinée idol that fathers the future King of England. His lack of\nhistorical fact turns what could have been a dark and gruesome tale\ninto a over dramatised love story. Character development is poor; you\nmeet card board cut outs of people but you never seem to connect with\nany of them. He has all the Celtic nations represented with the\nthickest accents they are able to muster splattered in woad and draped\nin fur but little is mentioned about their motivation they meekly\nfollow offering nothing. The battle scenes while well done, don't leave\nyou routing for them, they just wash away in to the back of the battle\nscene. Although Gibson seems to take particular pride at portraying any\nEnglish man as either twisted and evil or weak and effeminate, what\nhappened did the Queen forget to send him a Christmas card? The real\nshame is he had the actors, the money and the potential of a real story\nand all he did was botch it.\n"},
{"review": "\nI just watched this, although it took me days to finally finish\nwatching this 3 hour bloated boring movie in its entirety. I would\nwatch one hour and then had to take breaks because of how bad it was,\nbut I was determined to watch it to the end. Its the kind of movie that\nis so bad, so amazingly goofy, that its funny.<br><br>I don't know anything about the history of Scotland and don't care, my\nreview is on the movie itself. Mel Gibson, I liked him in the Mad Max\nmovies. But in this movie, he is nutty and just totally ridiculous. He\nwears weird blue makeup in a battle scene, and then after killing all\nthe enemy he stands there covered in blood and gore, and looks at his\nmen, and screams \"YAAAAAAAAAAAAAARRRRRRRRRRRGGGGGGGGGGGGGG\" It is so\nridiculous and laughable! <br><br>Then it gets worse! At the end of the movie he is brought in on a\nfreakin' CROSS, like he is Jesus Christ! I have to say I lost it at\nthat point. What in the world were they thinking? I was blown away by\nhow loony and silly this scene was, with Mel looking at all the people\nthrowing things at him, and he is pretending to be holy like a Jesus or\nsomethin'. When he screamed \"FREEDOM\" at the end, I wanted to scream\ntoo - in agony! I can't believe this movie won awards, except for if it\nhad won a raspberry award for worst picture!\n"},
{"review": "\nMel Gibson's Braveheart is a powerful historical epic that tells the\nstory of a man named William Wallace and how he fought for the freedom\nof Scotland. The movie stars Mel Gibson as Wallace a man who was\ndevoted to his country's natural rights. Director and star Mel Gibson\nreally knows the history behind how Scotland got their independence\nfrom England, this movie has a similar story to Gandhi by Richard\nAttenborough in which both of those films had only one thing in common\nboth Scotland and India wanted independence from England but in\ndifferent centuries. What Mel Gibson tries to teach us from this film\nis how much of a hero that William Wallace was in real life at the time\nhe was alive. Also the musical score by James Horner was just plain\nperfect for the movie itself. Also the movie compares to epic\nhistorical masterpieces like Schindler's List, Lincoln,Gandhi,Saving\nPrivate Ryan, The Great Escape, and many more.<br><br>A Definite A+\n"},
{"review": "\n\nSomeone really missed out on a good story here. The William Wallace story\nis\nexceptional so why do Hollywood have to \"improve\" it and turn it into a\nsecond-rate, overlong mess of a film? How can you have the Battle of\nStirling Bridge _without_ the bridge? Producers have claimed that the\nbridge\n\"got in the way\". Funny, the English army discovered that too. And why\ndemean the hero by having him up against such a pantomime villain - sure\nEdward was a twisted b*****d, but the filmmakers might as well have given\nhim a sidekick called Igor and have him cackle at choice moments\nthroughout\nthe film, he was that unsubtle.\nMost importantly, however, it seems a real shame that it should be this\nfilm\nthat should have captured the hearts of the Scottish nation, they deserve\nso\nmuch better. Would you believe there is now a hideous statue of Mel Gibson\nat the foot of the Wallace Memorial in Stirling? Would you believe people\nare leaving flowers beneath it?\nThis film is a travesty of both a good story and history itself. Scotland\ndeserves so much better.\n"},
{"review": "\nwords cannot explain how in love i am with this movie, i had chills\nthroughout the whole 177mins including the credits- there was just\nsomething about the way those names rolled down-. movies are no longer\nmade like this unfortunately this movie had a message and a purpose to\nit beyond just entertainment. its a true story following the life of a\nman named Williams Wallace and how he goes about fighting for Scottish\nfreedom from king Edward also known as longshanks who had invaded and\nconquered Scotland. i have watched this movie at least 5 times and one\nof the perks is you learn a bit of history and that the freedom we have\ntoday didn't always exist and its thanks to people like Williams\nWallace who were willing to fight and die for the cause that we have\nsuch freedoms in this day and age. my favourite part of the movie would\ndefinitely be the part where Mel Gibson screams freeeedom! that was\nboth orgasmic and chilling i don't know why so don't bother asking.\ncoming in as a close second was one of the speeches he gave to the\nscotts men before going to battle where he didn't try to sugar coat the\nsituation, number wise they were screwed. anyways if i this review has\nnot convinced you on why you should watch this movie then....i dunno i\njust don't like you now.\n"},
{"review": "\nMy first thought would be,i experienced almost all emotions,watching\nthis movie. I laughed,got angry,i even cried at some scenes,that to me\nis the sign of a great movie.When it can make you feel all those\nemotions in one sitting. Mel Gibson did a great job as a director and\nas the leading man in the movie 'BRAVEHEART' he carried that movie!<br><br>And i cant forget the excellent supporting cast :<br><br>Loved the father-son relationship between 'brendan gleeson' and 'james\ncosmo',Patrick McGoohan as longshanks(He played the character so evil i\nloved it),Catherine McCormack as murron,Angus Mcfadyan as robert the\nbruce,even the cameo from brian cox was excellent.Not one bad\nperformance in this movie! 10 out of 10 !<br><br>Awesome movie !!!\n"},
{"review": "\nBraveheart (1995): Dir: Mel Gibson / Cast: Mel Gibson, Sophie Marceau,\nPatrick McGoohan, Catherine McCormack, Angus Macfadyen: Here is a\nsalute to freedom and the price paid. It regards William Wallace whose\nfather and brother were slain when he was a boy. Taken in by his uncle,\nhe grows to lead a rebellion against England after his wife is publicly\nexecuted. Mel Gibson presents impressive battle sequences as Wallace\naligns with other villages in an attempt to form an army to overthrow\nKing Edward 1 of England. Gibson portrays Wallace as a man bent on\nfreedom to the point of death, and he is faced with many victories as\nwell as betrayals. When he yells out the word, \"freedom\", he does so\nduring his darkest moment. Sophie Marceau plays the Princess to the\nKing's young feeble Prince. She is sent as a form of information and\ndecoy but she becomes enamored with Wallace and warns him of danger.\nPatrick McGoohan as King Edward 1 is a thunderous villain ruler bent on\nconquering opposition until he lay on his death bed with words\nwhispered into his conscience that embed worse than his greatest\ndefeat. Catherine McCormack plays Wallace's wife who falls victim to\nthe King's rule that enables his bids on newly brides. Angus Macfadyen\nis featured as someone whom Wallace seeks assistance from. Well crafted\nexcellence about freedom and its very nature. Score: 10 / 10\n"},
{"review": "\nI watched the movie again the other day, and I had to write a review.\nThis movie is as close as it gets to perfection. It's a combination of\nso many genres and so beautifully combined. You have history movie,\nspectacle, drama, action, love story...(i'll probably forget some)\ngoing on at the same time. The acting is perfect, the directing is\namazing, the scenes of Scotland are beautiful, even the fight scenes\nthat are full of blood (like you can direct violence without blood?!)\nare spectacular. Mel Gibson really did an amazing job here and every\ntime I see some good movie I use Braveheart as a reference point - that\nexplains how high this movie is on my list! People can argue and it's\ngood that they do but for me this is the best movie ever made and I can\ngive countless of reasons to back up my statement!\n"},
{"review": "\nThis is the best of all Mel Gibson's movies. And will always be\nremembered as one of the best/a landmark in the US cinema.<br><br>A single word Freedom holds all.<br><br>It is not just a story of a freedom fighter but an adrenaline pumping\njourney that inspires and invokes rage against the system-could be\ncontemporary. Story of a normal guy who stood against the system after\nthe loss of his family and of a friendship that betrays then repent and\nthen take charge. Ophhh- hell of a story. Will see highs and lows of\nrelations that too in the era of kings-politics. Rebel dies and his\nlast word- Freedom, that's enough to stand against the wrong. Believe\nme a long speech before war- we have seen it all. But just a single\nword with a passionate outcry overshadows all of those famous dialogues\nof all in the history of cinema. <br><br>The movie has all. Story, direction, acting- everything and believe me,\nit will cast a spell. And you will remember this outcry for all of your\nlife. <br><br>Not denying the fact that Mel is one of my favorite and this is one of\nthe best of my life. It really sets the standard for cinema and is\ntotally/completely a different level.\n"},
{"review": "\nMel Gibson portrays the Scottish rebel William Wallace.<br><br>Wallace is a man who has experienced tragic deaths throughout his\nentire life. But he doesn't want to fight against the oppressive\nEnglish until an English nobleman kills his newly wedded wife. Wallace\nseeks revenge and leads his fellow Scottish to many victories. In the\nfilm Wallace knows how to fight with his head and knows when it is time\nto man up and fight for what is right.<br><br>The film contains numerous action scenes that might not be too pleasant\nfor horse lovers. History buffs will most likely nit pick the\nhistorical inaccuracies. <br><br>The film overall is a modern day \"Spartacus\".\n"},
{"review": "\n\nThank God that there is art in this world. I have never seen a film like\nthis before and I am sure I will never ever see one like it again. Everyone\nmust watch and take care the beautiful and meaningful values that exist in\nthis world. Life is meaningful when you have a reason to fight for... The\ncast, scenery, everything is beautiful in this film and I am very proud of\nbeing a person who has had a chance to live in this century and seen the\nfilm. So adorable, so amazing... I cannot express...\n"},
{"review": "\nDear dear me........this was nearly as bad as the film \"Titanic\" were\nthe English are portrayed as locking Irish passengers below decks to\ndrown as it was against the rules to allow them on the upper decks even\nas the ship was sinking!! to say that Brave heart comes across as\nracist and insulting is to put it mildly. All that has been said\nregarding historical inaccuracies has already been said in previous\nreviews. Mel certainly seems to have an Axe to grind or in this case a\nbroadsword with the English and much like the patriot it portrays a\nnation that spawned the biggest empire the world has seen as inept\nduplicitous cowards(way to go Mel) have give this load of tripe a (1)\nas I cannot give it a zero.....I think there are a few Englishmen who\nwould like to bump into this jumped up little dwarf and give him a\nhistory lesson.......\n"},
{"review": "\nThere are times when a movie can be watched for its pure entertainment\nvalue, but it's usually when we're talking about epic scale\nfantasy-land type stories. With historical adaptations, it would be a\nrefreshing change if movie studios, writers and directors could\nactually stick to facts for once in a while.<br><br>Too often, we get served a mishmash of explosions and/or overly\ndramatic performances trying to make up for the lack of any real acting\ntalent. Braveheart is one of those ilk and as a Scotsman and student of\nhistory, I can't get past the blatant revision of important events in a\nvain attempt to make up for a terrible script, distinctly average\ndirection and an accent that would get you killed if you used it in any\nbar in Scotland.<br><br>This film is rescued by some great cinematography, but there is really\nno need to redo the story of William Wallace, as the truth is every bit\nas dramatic as this pandering to an American audience's need for the\nhero to be a glorious warrior for justice and almost without sin. It\nseems to be that 'Hollywood' can't seem to realise that anti-heroes, as\nthe real Wallace was, can be every bit as entertaining, if not more\nengrossing for their character flaws, than these sanitised, lily-white\nwarped reflections could ever be.\n"},
{"review": "\nHaving seen this film umpteen times and seeing the very POLARIZED\nopinions it generates, here are the facts as I see them.It IS an\nentertaining film, whilst Gibson is as wooden as usual other members of\nthe cast are good, particularly the under rated Mcgoohan.The battle\nsequences whilst inaccurate are carried off well and visually it all\nlooks great. <br><br>So it is a pity that an otherwise good film is spoilt by it's sadly one\nsided view of history. Firstly Edward I behaved no differently to any\nother monarch of the time in protecting his interests. He was arguably\nthe most effective ruler during a turbulent period of civil war in\nEngland itself. His son, the unfortunate Edward II was lucky to have\noutived his father at all, the crown had to be protected at all costs.\nThe Scots as well as the English perpetrated some terrible deeds, but\nthis was typical of the time and practices such as 'breaking on the\nwheel' continued in France into the 18th Century.<br><br>As in most conflicts no party had a moral high ground. It was\ninevitable that Scotland would become a vassal of England, in the same\nway that France was eventually enlarged. At the time Wallace may have\nrepresented an ideal of Clan freedom and independence but the Nation\nState was already becoming the currency of power within Europe. <br><br>A more balanced and investigative approach would have yielded more\nsatisfying results and left a less bitter aftertaste for viewers of an\nEnglish disposition. <br><br>I\n"},
{"review": "\n\nFor sure it's my favorite movie. The picture and music are perfect. I saw\nthe movie twice at the theater, I've rented it\nand I've bought it. I saw the movie 20 times and I'm still enjoying it. The\nbattles are greats. My only deception is that\nI can't jump into the movie to help Wallace kick some english's butts. This\nmovie is marvellous.\n"},
{"review": "\nWithout any doubt, one of the greatest motion pictures ever.<br><br>It is impossible to describe what an effect this movie has on me...\nevery time I watch it... I can stay for hours, just blinking,...\noverwhelmed by emotions and thoughts,... unable to do anything at\nall...<br><br>Thinking of the good and true things, that are so few in this cruel\nworld.<br><br>Knowing that there are still innocent victims and peoples under\noppression.<br><br>I remember when I saw Braveheart the first time, back in 1995,...<br><br>It was a unique experience not only because of the movie, but also\nbecause of the effect it had on the audience. Such situations are very\nrare.<br><br>Everyone in the theater, down to the last man, cried at the end...\nEVERYONE. It was a big theater and a big crowd too.<br><br>When Murron walked from behind the crowd at the moment of Wallace's\nbeheading, I felt something like a cold blade of happy sorrow, going\nthrough my throat.<br><br>You can't help it.<br><br>It was even funny to watch some of my friends feeling uncomfortable\nbecause they had cried, while they're trying to play the\n\"macho-down-to-earth\" role in life. :) It was very funny :))).<br><br>The entire audience was like hit with a sledgehammer, people slowly and\nquietly going out of the cinema, discussing the movie.<br><br>Then it started raining :).<br><br>Good old Bulgarian rain\u0085 falling straight down\u0085 <br><br>If we should analyze the movie, I think there would hardly be any flaw\nto find: <br><br>FLAWLESS script, master directing, great cinematography, supreme\nperformances by the actors (the Scottish accent of Gibson!), \u0085a\ndevastating score,.. pushing the cold blade even further\u0085 <br><br>In short:<br><br>If you haven't watched Braveheart, you haven't watched anything\u0085 <br><br>A true Work Of Art and a touch of the Divine.<br><br>God bless you, Mr. Gibson.\n"},
{"review": "\nfavouritist film ever in the whole world ever! There is blatant\ndisregard for historical accuracy here, which would normally wind me\nup, but the sheer scale of the film makes up for it.<br><br>It is gorgeously written, beautifully directed, and magnificently\nacted. So there. I'm not entirely sure there's much else I can say!\nOnly there's something for everyone; action, romance, drama, even some\nhumour. I've never met anyone who isn't a fan of the film! <br><br>One last thing, James Horner's music is stunning. I've got the CD, and\nit's an excellent investment, even if you don't like the film\n(something I highly doubt!!)\n"},
{"review": "\nFactless,typically anti-English garbage. I am mystified why people from\nthe same planet as me actually vote this crap as the best movie ever.\nIf it was in paper form I wouldn't even hang it in an outside toilet.\nIt's that bad that I would rather watch a blank screen for three hours\nrather than watch this again. I only sat through it because my other\nhalf wanted to see it. As usual Gibson comes across as the self serving\n\"look at me everyone\" jerk that he is. If you are fortunate enough to\nhave never seen this bilge then do yourself and your braincells a favor\nand don't waste your time. I am getting fed up with hollywoods attempts\nto re-write history for dramatic effect. People will grow up believing\nthis to be the truth. Heaven help us all.<br><br>David Cairns writing for \"The Week\" says \"Braveheart doesn't mention\nthat Wallace was a member of the ruling elite, a privileged landowner.\nIt creates a love affair between Gibson's hero and Queen Isabella, who\nwas in fact two at the time. It has been accused of racism and\nhomophobia by some critics, and even the kilts the characters wear were\ninvented 300 years after Wallace's death\"<br><br>Gibson himself now admits that the film is \"bogus\" but the morons on\nhere continue to spout unbelievably puerile reviews calling it the best\nfilm ever. They really should be locked up for their own safety.<br><br>If It was possible I would have given this a minus score.\n"},
{"review": "\nHonestly, all factors were indicating a favourable outcome here. Even\nthough many of us inevitably feel that most products and stars churned\nout by the Hollywood movie system are most kindly described as\nformulaic.<br><br>Personally, I have a fairly neutral opinion of Mel Gibson as a brand.\nDespite this, my expectations for Braveheart were in line with so much\nhype. As I have a fervour for history and cinema, the combination is\noftentimes one I find especially interesting. Braveheart had a\nheadstart.<br><br>Well, it was a very pretty little 'historical' tale. Otherwise, this is\na seriously overrated and predictable flick.\n"},
{"review": "\n''Braveheart'' is one of the greatest movies I already watched in my\nlife. Really, it will be hard to find the exact words to write a review\nabout it, but I will try. It's the story of the Scottish hero William\nWallace,and Mel Gibson, even being older then the expected for the\nrole, is great as director and actor, and I think this movie totally\ndeserved to have won Best Cinematography,Best Picture and Best\nDirector.<br><br>The movie itself has many MANY inaccuracies. Things like kilts were not\nworn by the Scottish and British soldiers had no uniform during that\ntime,the fact that the Princess Isabella never met William Wallace and\nwas 8 years old when Wallace dies, prima noctis never happened, Wallace\ndied before Edward I and the blue body paint for battles had stopped\nbeing used 800 years before the events of the film are some examples.\nBut I think we cannot be very angry with this, since William Wallace's\nrecords almost doesn't exist, and many of the facts were taken largely\nfrom an epic poem by a man called \"Blind Harry'', who possible wrote\nmany things that never really happened.<br><br>I think this movie is a masterpiece, even that the real connection with\nScotland from about 1280 to 1305 is not right. We should watch this\nmovie thinking that it is just a movie, and not a history lesson. I am\nglad the movie is in top 250 from IMDb.<br><br>aka \"Coração Valente\" - Brazil\n"},
{"review": "\nThis movie was utterly awful.<br><br>It was historically inaccurate and portrayed the English as the\nVillains where as both countries in that time committed terrible acts.<br><br>One of the events which occurred was when the Scots raided an English\ntown, murdering everyone including woman and children and making purses\nout of their flesh comes to mind, one of the events that caused the\nhostilities between the two countries.<br><br>Either the movie makers did not do their homework as to what went on in\nthat period or they decided to purposely ignore and warp some of the\nevents in order to make the English out as the Villains and the Scots\nas heroes.<br><br>It was due to this movie that I decided not to go and see the Patriot\nalso by Mel Gibson as I knew they would do the same.\n"},
{"review": "\nVery silly ego trip by a forty-something star(Mel Gibson) past his\nprime, playing a twenty-something year old Scottish patriot with blue\npaint on his face, courting a leading lady who could be his\ngranddaughter. Boring and dumb film without any single redeeming\nelement.<br><br>I thought that \"Titanic\" was the most over-rated film ever made, and\nthen I saw this. Now I know that \"Braveheart\" is the most over-rated\nfilm ever made, and it is pretty bad as all the other movies of Mel\nGibson, which it is not only a terrible actor, but a terrible director\nas well. I know, I have seen his other movies like \"The Passion of the\nChrist\" and \"Apocalypto\". Both were awful. Overrated, overlong and\nboring. This movie it's a complete waste of time.\n"},
{"review": "\nHistorically inept, amazingly biased and overall terribly ignorant. I\nhave come to expect nothing less from Hollywood's less than amazing\nhistorical epics.<br><br>Poor acting doesn't usually help but in this case, at least it gives\nthe film some humour. The exaggerations of English EVIL and Scottish\npride sickens so much that I am beyond retching. The film goes nowhere\ntowards motioning that the Scottish invaded England constantly in their\nspare time, this is the reason for England invading and taking over.<br><br>I'm surprised the king of England didn't have a hump. The next step on\nfrom this is to show hoards of Englishmen burning babies for a living\nthen going home smacking their wives having a cup of tea and going to\nbed in a bowler hat.<br><br>Thank the sweet lord that Hollywood has better films than this.\n"},
{"review": "\n\nHonestly, it's not that good. It's too long, too trite, too formulaic and\ntoo revisionist.<br><br>Wallace WAS seven feet tall (more or less), but as far as I can tell he\nwas\na racist thug - the film conveniently skips over the fact that he had an\nargument with an Englishman who he murdered, along with five or six\nothers,\nand then ran away. So much for 'Freedom'. More like \"I can't control my\ntemper and the English are after me,so I'd better get some help\". He was\nabout as popular with the Scots nobles as he was with the English. Oh, and\nhe wasn't a peasant either.<br><br>Anyone saying \"it's only a movie\"-well read how many comments are praising\nthis film for its historical accuracy. I can take historical fantasy, most\n\"Robin Hood\" films for instance, but not when they're touted as\n'accurate'.\n"},
{"review": "\nThe scenery is nice,costumes are good, acting not bad,but that is about\nit.What is it with Mel Gibson and his anti English feelings.I find him\ndangerous in modern day film making,he takes a story and twists it\naround with out knowing anything about our history and comes up with\nthese very offensive anti English films,almost like Hitler and his anti\nsemitic propaganda.According to him English men are either\ngay,rapists,murderers,torturers,we are yet to see how he wants to\nportray English women,ma by he thinks their lesbian prostitutes who go\naround murdering small boys, please don't give him ideas.The worst\nthing of all is that the film is set many centuries ago when every one\nwas barbaric to one another,he makes it look like it was last week.I'm\nan Englisman who has Scots and Irish friends,and all actor /directors,\nif you can call him that do is just stir up trouble.He knows nothing\nabout our history so he should stay out of it,leave it to the\nprofessionals,like Richard Attenborough.\n"},
{"review": "\nNo really, I don't. Because it was not only incredibly stupid, half of\nthe time it didn't make any sense at all. I don't mind violence at all,\nas long as it is done for a valid and proper reason. That Wallace\nkilled off half of England screaming FREEDOM! all the time because some\njackass killed his wife. Pure nonsense, I'm telling you.<br><br>Secondly, all the action scenes were filmed with this horrible shaky\nhandy-cam view to give you the feeling you are 'in the battle'. This is\nthe point were I really lose all my interest. Why would you make\nblurred shots, that shake all the time, if it does not truly enhance\nthe visual style of the movie in any way at all? Of course you're not\nin the battle! And even if you were, you wouldn't shake like that all\nthe time! Honestly, get a clue.<br><br>Then the acting. Good god, all the drama and nonsense. I really hate\nthe overacting they sometimes put in movies. It was okay in Lord of the\nRings, but here it was dramatic. Bland expressions and faces, people\ngetting angry for no proper reason, no person in the movie tried to say\nsomething a bit realistic like: let's try to think out a normal\nsolution instead of fighting in terrible greyly coloured landscapes.\nNo,everyone was screaming, and/or looking as stupid as possible.<br><br>This movie lacked so many things, was so gray and boring, overlong and\nwith a lot of irrational actions, I really disliked it. A lot. Possibly\nthe most overrated movie I have ever seen.\n"},
{"review": "\nHow this film won so many Oscars is beyond me.To start with its totally\ninaccurate,it looks like a typical excuse for Mel Gibson to try and\nlook macho and at the same time practice his racial hatred on us\nEnglish.I don't know about anyone else,but i saw this film about ten\nyears ago and the thing i remember most about it apart from his silly\nhairdo,was the sheer offensiveness of it,I've never watched it since.He\nimplies that the kings son was homosexual,which there's no evidence\nof,and then implies that homosexuals are evil people,how bad is that in\nthe 20th century.Films have been banned for implying a lot less.But on\nthe whole why cant he just leave our history alone and do something\nuseful like make a film about the Aborigines or the American Red\nIndians,which is more his neck of the woods,not tear British history\napart with how he wants to see it.I'm worried that he may try and make\na version of the Battle of Britain,could you imagine it,he would\nprobably portray the English as sitting around drinking tea saying,go\non taffy and jock old boy go and kill some Hun for us ha ha tally ho.It\nwould be that bad.\n"},
{"review": "\n\nThe fact that Mel Gibson is in it might be enough to dissuade anyone from\nwatching, but if you continue to watch, you're in for a nasty fright.\nAlthough against the best recommendations of British historians, millions\nof\nAmericans still view this movie as accurate history.  Thanks Mel - you've\nrewritten in 3 hours a nation's history that took thousands of years to\nform.  Some strange facts about this fiction were that the English king\nactually spoke English, as did his soldiers, who themselves identified as\nEnglish, when historically you're looking at a would-be further Norman\nconquest further into Britain.  Also, it appears that many Americans, and\nnow many other nationalities (thanks Mel) seem to think that Scotland and\nBritain are separate entities.  If ever there is a Braveheart II, which\nportrays Scottish raids and invasions into pre-Norman Northumbria,\nCumbria,\nYorkshire, which shows how the Scots conquered the English city of\nEdinburgh\nand made it their capital, which awakens in 50 million Irish Americans a\nsense of their English heritage (hahaha), I'd watch it.  Trouble is,\nHollywood doesn't make those sorts of reality films as they're just too\nreal.  The English as victims?  Perish the thought!\n"},
{"review": "\n\"Braveheart\" is one of the most well directed and well shot movies of\nall time. What Mel Gibson does here is astounding. There's plenty of\nexciting battle scenes and legit emotional instances. The\ncinematography is terrific. You really feel like you're in Scotland,\nadmiring its beautiful and brutal world. A lot of endearing\nauthenticity is also thanks to great acting and costume designs as\nwell. It's hard to find a war film that's so focused and emotionally\ndriven as this one. The only flaw I have is that there's a love\nscenario that develops towards the end of the movie that's totally\nunnecessary and even takes away from some other emotional tendencies\nthat occur earlier in the film. But it's hard not to get swept up in\nthe grand spectacle that's known as a masterpiece. This is one that\nshouldn't be missed.\n"},
{"review": "\nThis was a mid evil soap opera that kept me on the edge of my seat. It\nhad all the things a good story needs. There was action, gory battles,\nalso a little romance. We all know the best fights come from a broken\nheart lover/mate. The acts of bravery and love displayed by Sir William\nWallace were extraordinary. The fierce determination and loyalty and\nfriendships you see in the movie are something to be desired and envied\nby all. The whole movie was a strong fight from people who wanted what\nwe all want for ourselves, Freedom. So i think we can all relate to\nthat struggle of life in some type of way.So if you really think about\nit we all have a little William Wallace in us or can respect what he\nfought and died for, love and freedom\n"},
{"review": "\nOne of the early \"historical epics\" to set off a still-current wave of\nancient adventures, this is epic, grand stuff spoiled only slightly by\na twinge of Hollywoodian uneasiness and a little overloading of\nsentimentality. It isn't as bad as in something like, say, ROBIN HOOD:\nPRINCE OF THIEVES but it isn't mastered to the extent it was in\nGLADIATOR either. Although history is sometimes rewritten and\ndistinctions are blurred, this is a moving masterpiece with a sweeping\nscore and splendid visuals to boot.<br><br>War is hell here, literally; bloody and violent, with limbs flying and\nbodies torn asunder. Yet for a film chock full of gruesome violence and\nobscene torture, it's remarkably good-natured, focusing on the\ncharacters foremost and being successful with it. Gibson is fine in the\nleading role \u0096 if a little too old \u0096 and the supporting cast are great.\nThe plot is complex and wide-reaching and the characterisations and\nscript are both spot on. A perfect blend of heroic escapism and\nback-stabbing politics, this is a modern classic of the genre and it\nproves Gibson's worth not as a star but as a director because his\ndirection is exemplary.\n"},
{"review": "\none of my English teacher once told in class- \"If you haven't seen\nbraveheart ,you don't know what movies are actually\"...It's a pretty\ngood compliment for a movie.But i wasn't that much motivated by his\ncomment....after 6 month I watched that movie....and oh my lord...I was\njust sitting in from of my PC for 3 hours and was being amazed over and\nover again..this is a movie which is worth praising.The acting of Mel\nGibson was so brilliant that I finally become the lifetime fan of him\nthough It is the only movie of him that I saw.Most extraordinary thing\nof this movie is its story..some stories are so beautiful that you\ncannot think the movie/story is over after you finished it...the story\njust make its place in your mind...Braveheart is exactly that kind of\nstory....the speeches of William Wallace is truly inspiring.every words\nof his speech is still whispering in my ears....this is the greatest\nhistorical war film I've ever watched\n"},
{"review": "\n.....finally I watched Braveheart for the first time. <br><br>Is it true that the Scots watch this each year on the day Scottish\nparliament opens? I bet it's effective in getting them baying for\nEnglish blood. Gibson has a gift for directing bloody action. But why\nmake a historical film that is so inaccurate? <br><br>I'm no historian, but I do recall a little history from school books.\nEnough to know that Wallace didn't live in a thatched hut. That Edward\nII was manly and not a limp-wristed girl; his favourite hobby -- apart\nfrom hanging out with Piers -- was rowing.....and swimming and shoeing\nhorses. And Wallace did not father Queen Isabella's child, the future\nking of England, because he did not ever meet her. (Isabella was in\nFrance, about 13 when Wallace died, and Edward II only married her 2-3\nyears after Wallace's death, and after Edward I's death.) Sorry for the\nspoiler. <br><br>Do these 'errors' in historical films matter? Some will say they don't,\nthat film is just for entertainment and legend. But many people who\nwatch films never voluntarily read a book. These films replace history\nbooks. They become the common, accepted knowledge. Isn't this\ndangerous?<br><br>I know a non-reader who is obsessed about popular history (i.e. he\nmainly likes the bits where some guy is slaughtering some other guy).\nAll his knowledge is taken from films and he believes he speaks with\nultimate authority, even when he announces that Wallace was very likely\nfather to England's royalty.. I've seen him a few times locking horns\nwith someone who knows his stuff, and it's just embarrassing. And sad.\nFor why should he suspect that Mel is fiddling with the facts to this\nextent?\n"},
{"review": "\n\nDespite taking certain liberties with historical accuracy, Mel Gibson, that\ncheeky Australian chappy has created a wonderfully powerful film, full of\nthunder and passion.  The haunting score by James Horner is a knock out.\nWell done all\n"},
{"review": "\nBraveheart was quite simply Mel Gibsons best movie of his career, it\nalso goes on the list of one of the greatest films of all time. The\nsoundtrack was absolutely fantastic as well as the acting. Showing the\ntraditions of the Scottish and the brutality of England back in\nMedieval Times. Mel Gibson delivered a patriotic, stellar film for the\nages showing the determination and love of one man that changed an\nentire nation and gave it the strength to gather together and stand\nagainst tyranny. Love for country, love for family, and love for the\nonly one that he ever wanted. The sets used were perfect depicting the\nenvironment in which they lived. Braveheart leaves an impression that\ncan't be beat!\n"},
{"review": "\nBraveheart is an absolute fantastic movie with a really well developed\nstoryline that contains both a lot of action and a lot of heart,with\nvery strong,powerful and inspired performances.Even for people who\naren't from Scotland,this movie gives you great pride from the country\nyou came from,it is all beautifully made and William Wallace is without\na doubt Mel Gibson's finest performance,and his most impressive movie\nas a director.I also loved Brendan Gleeson in this movie,he isn't a\nvery important character,but he is such a good actor and gave me so\nmuch pride for the country I come from,Ireland.Braveheart is a highly\nrecommend movie for all moviegoers,those five Academy Awards don't lie.<br><br>After his wife is sentenced to death by an English soldier,William\nWallace leads a group of Scottish warriors to battle against the\nEnglish for their countries freedom.\n"},
{"review": "\nFor me this movie have to be on top 10. Advise all lovers of movies\nfrom the middle ages to see this movie. One of the most successful\naspects of this film is composed of scenes of extraordinarily well\nsynchronized and arranged battle involving thousands of participants.\nFilmed in impressive fashion, with a touching story and wonderful\nperformances by the entire cast, this masterpiece of Gibson became a\ncolossal epic winner of numerous awards (Oscar included). \"Braveheart\"\nis even better and more epic succeeded in living memory in the history\nof cinema. Anyway, in my opinion \"Braveheart\" is the most complete epic\nfilm in living memory and those who have not seen it, do not know what\nyou're missing!\n"},
{"review": "\nAs a Scotsman i should probably point out that this film is horribly,\nas history would point out, inaccurate!!!! However the important part\nof our history was remembered as far as the battles were concerned. The\nfilm is the only one, i am sure, that will be the only one i see that\nreceived a standing ovation at the end(at least in this country).\nWillam Wallace is an important part of our history and he will always\nbe remembered as one of the men who always reclaimed our land from the\nEnglish. (I have nothing against our neighbours by the way!) The film\nitself boiled a passion in me that could never be re-ignited by any\nother! Despite the fact that many of my friends are English!!! If by\nsome small chance you've never seen this classic please, please, give\nit a go..... You'll feel some patriotic soul, even if you're not a\nScot!!!! By the way... I'm in the film ... I was unemployed and\ndesperate!!! Mel gave me a part!!! I'm third buttock from the left!!!\nThat's what i get for being a tall muscular highlander!!!!\n"},
{"review": "\n\nI love this movie. Mel did the best job acting and directing this movie. I\nloved it and I watch this movie all the time. If you don't have the CD's get\nthose too because James Horner did a wonderful job on the CDs they are\ngreat. \n"},
{"review": "\n\nI love this movie. It had everything. Gore, Love, Sex, and loads of action.\nThen it all ended with a very dramatic and powerful ending. This is a great\nmovie\n"},
{"review": "\n\nThere isn't a whole lot to actually say about this movie.  It truly is a\nmasterpiece.  A true work of art.  There isn't a film out there that\naffected me the way this one did.  The acting, the plot, and the costumes\nwere sensational.  I just wish I could personally thank Mel Gibson for\nmaking one of the best films ever.\n"},
{"review": "\nTo be fair, viewed as a cinematic project, this was good with very\nrealistic battle scenes and overall landscape. However, from a\nhistorical point of view, it is utter tripe. On 25 January 1308, Edward\nII married Isabella of France, yet the movie purports to have Wallace\nimpregnate the princess of Wales at some point before he died while she\nis married to Edward II. Yet the 'fact' is, Wallace was executed three\nyears before the Princess was even married. Given that the princess\ndidn't give birth until 1312, that must have been one heck of a\ngestation period, 7 years to be exact. Also, at the battle of Stirling,\nor more accurately 'The Battle of Stirling Bridge', Wallace did not\ndefeat heavy chivalry using lines of disciplined troops carrying long\nstave's. He defeated the English because the English were forced to\ncross a narrow bridge, and once penned in, they were easier to kill.\nThis was compounded by the rout into the cavalry and the collapse of\nthe bridge leading to many troops drowning. Wallace was a guerrilla\nfighter, not a strategist. This might have been a great movie if Mel\nGibson had kept to the truth, as it is, it is a seriously marred piece\nof sensationalist anti-English hokum that would be more at home as a\nwork of fiction that one supposedly based on fact.\n"},
{"review": "\nThis movie will always feature in my Top Ten of All Time. The film is\nextremely well made, with out-standing Direction, a very strong script\n(if inaccurate in regards to the subject matter), the acting is top\nnotch as is the score (in fact its exceptional) and all these elements\nmake this an amazingly passionate and emotionally charged epic. As a\nScot I find myself being slightly bias about the film of course. The\nhistoric inaccuracy's are rather large and the film-makers do make the\nEnglish out to be rather like cartoon bad guy's at times. The final\nscenes are very powerful and the battles are fierce and believable.<br><br>I have watched the film many times, and every time I find it as\nemotional as the first time. So credit to all of the people involved in\nthis one, it will turn out to be an timeless classic I'm pretty sure.<br><br>10/10, Oozes Quality from all departments..............\n"},
{"review": "\nthis is one of the most amazing films i have ever seen. it captures\nemotion on a new level. Gibson portrays feeling through intense stares\nand slow motion. this film makes it impossible to be patriotic about\nengland. i do not like excess gore but i hated the English (i am\nEnglish) so much in this film that i felt it was well justified.\nGibson's power and conviction combined with the script draws you into a\nwonderful story of passion, honour and love. it is a long film (approx\n3 hours) but i could barely remember where i was by the end. if you\nwatch only one film in your life let this be it, don't bother renting\nit just buy it its a safe risk, I've never heard a bad review and this\nis definitely one you'll want to keep!\n"},
{"review": "\n\nI was very surprised when this won the Oscars for best picture and\ndirector.\nIt's a fairly standard action movie.  The battle scenes are gory but not\nvery realistic -- somehow, long, drawn out affairs are over in about 15\nminutes, the good guys are super killing machines, etc.<br><br>Gibson is a good at playing cool, restrained characters like Mad Max, but\nnot good at playing a romantic lead or inspiring leader -- he was trying\nto\nbe Kirk Douglas in Spartacus, but ended more like Graham Chapman in Life\nof\nBrian.<br><br>The entire portrayal of the agonized Robert Bruce was very\ndopey.<br><br>The direction is flabby, and uncertain, the pacing off, and the costumes\naren't even terribly interesting or authentic.<br><br>Historical dramas tend to work best when they don't try to turn their\nstories toward universal truths, but focus on the characters and\nsituations\nat hand.  Gibson tried to turn Braveheart into a rousing statement about\nhonor! truth! passion! freedom! but ended up just parroting the standard\nHollywood line.\n"},
{"review": "\n\nA well, acted and well paced movie, such that you don't notice its near 3\nhour length.  The real strength, though, is its visual imagery.  The blood\nand gore of the battlefield, the glorious Scottish highlands, the medievel\ncastles and villages.<br><br>Gibson thoroughly desrved the Oscar for best director, the imagery and\ncamera work is stunning.  While the direction itself is not innovative it is\nfar more than merely effective.  The battles are well depicted, using\nthousands of extras.  A personal highlight is the depiction of the battle of\nStirling as for the first time in living memory cavalry is defeated by\ninfantry.<br><br>The dialogue feels great to listen to, and the plot is cohesive and flows\nwell.  While the movie could quite easily down without the Princess sub-plot\n- it does add to the feel of the movie.<br><br>Mel Gibson takes the lead role with a fire that was absent in some of his\nother historical work, for me the pick of the acting is Angus McFadyen as\nRobert the Bruce, the young would be king torn between yearning to follow\nWilliam Wallace into the teeth of hell, and the brutul common sense of his\nailing father.  A young man yearning to be a warrior while being forced to\nbecome a politician.  Also veteran British actor Patrick McGoohan is a joy\nto watch as King Edward the Longshanks.  A character to love to\nhate.<br><br>While filmed as an epic not all epics live up to the tag.  This movie is an\nepic in every way.\n"},
{"review": "\nThe film may have a memorable quote. It may have a well known actor.\nBut that in my mind does not redeem this film. Here Mel Gibson pushes\nforth quite extreme prejudices, showing Anglophobic and Homophobic\nideas. The Film has a very black and white morality and the villains\nare quite one- dimensional. It badly alters history, exaggerating what\nthe British did. The myth of Primae Noctis was established by this\nfilm. The chronology is quite poor, Isabella was nine when Wallace died\nand Edward III was born seven years later. William Wallace committed\nsome atrocities in his fight for 'Freedom' and raided England. You\ncould make a good film out of this by showing the moral dubiousness of\nhis actions, but instead a quite one-sided portrayal is given. Not only\ndoes it install bad ideas but it increases a quite negative stereotype\nof the British. Not all Americans think like this, but such films\nreinforce the stereotype of them thinking in such basic terms. I feel\nthat this film has often been overrated, even as a film it can be quite\npoor. The only joy the film give me is venting out my rage at those who\ntarnish history.\n"},
{"review": "\nThis is surely one of the best i have ever seen if not the best.\nflawless is the word for the movie.Mel Gibson has given it a tremendous\ndirection along with his supreme acting skills. I got to say i have\nseen many but the impact that this film generates is simply amazing.<br><br>The story is based on William Wallace, a commoner, whom unites the 13th\nCentury Scots in their battle to overthrow English rule.<br><br>It's definitely a must watch for every movie lover as well for those\nalso whom do not watch movies that much. I must admit that this is\nperhaps the greatest action/drama movie ever made. It is hard to\nbelieve that it was made in the year 1995.<br><br>So folks if u have'nt seen this movie u are surely missing a great\nmovie. Go and see it because this is the BEST.\n"},
{"review": "\n\nI was extremely surprised to find out that this was supposed to be such a\ngood movie. I saw it on TV yesterday, and I hated it. It was soooo boring,\nand Mel Gibson was not at all convincing as William Wallace. He was looking\nlike a 40 year old man that was still desperately trying to be young. He\nwas\nsupposed to be just a little bit older than the beautiful girl (whose name\nI\nforgot), but it was obvious he was much older.<br><br>The story was boring, and some parts of the movie were well acted, but I\nwas\nso irritated by Gibson and the story line, that that did not make up\nmuch.\n"},
{"review": "\n\nBraveheart is an excellent blend of wonderful acting, breath-taking\nlandscapes, incredible action, and a touching story. All the elements in\nthis movie complement each other oh so very well. While watching the movie\nyou become enthralled in the story of William Wallace. You actually want to\nbe out there fighting for his cause of FREEEEEDDDDOOOOMMMMMM. Some movies\nyou just don't know why you love them, and then there are others that are\njust so technically perfect and you can't help but love them...Braveheart is\nof the latter. It was a brilliant piece of film making. I haven't met a\nsingle person who, upon watching it, didn't add Braveheart to their top 20\nlist.\n"},
{"review": "\n\nI will never forget the look on Gibson's face after the first losing\nbattle.  This movie can reach out and touch someone.  I don't know if I've\nseen any movie as many times as this one.  If you never see any other movie,\nsee this one.  It is one of the greatest of all time.\n\n"},
{"review": "\nI was excited to see this movie. It won 5 Oscars, it has supposedly\ngreat acting, and is apparently very exciting and inspiring to many of\nthe people who have seen it.<br><br>However, I tried to watch this movie and was so repelled by Mel\nGibson's flat, bland, pathetic performance and the pretentious and\nsimplistic plot that I could not finish it. Mel Gibson is absolutely\nterrible in this film. His character is completely one-dimensional and\nhis romance is absolutely unbelievable. He looks completely ridiculous\nwith 3 foot long hair and he is very conspicuously miscast. The camera\nlingers on his epic feats and heroic poses and I wondered sometimes if\nthe movie was more a Mel Gibson montage or a biopic (which it really\nisn't anyway).<br><br>From what I have heard, this movie completely butchered history. It is\nknown to be one of the most inaccurate biopics ever created. And if\nthis is true, then how on earth can it be \"inspiring,\" \"breathtaking,\"\neven good?!<br><br>This is truly an insult to cinema and history. 1/10\n"},
{"review": "\n\nThis True Story of William Wallace has inspired millions\nof\npeople around the world. This movie has everything on the surface for people\nwho just want to see a great flick, your\nromance, your violence, humor, you name it. But for others\nwith a deep sense of reality with a more open mindedness, this movie\ncaptures them. It grabs hold and doesn't let go. I've\npersonally seen it over 45 times (and it's a 3 hour movie).\nIt\ninspired us to go to Scotland and visit the places where it\nall\nreally happened. Ignoring the lack of money, fear of flight, no support from\nparents, we had to go! Braveheart is THAT powerful.\n"},
{"review": "\nPersonally, this is my favorite movie of all time. I'm not going to\nramble on and on about this movie...I'll just lay it on the line for\nyou. It's great. Most importantly, it has a little bit of everything.<br><br>In my mind, it's the ultimate movie, it has all aspects of humans.\nViolence, courage, betrayal, love, death, comedy, it has it all. It's\nmore action based than anything, but there is a love plot and\nfriendship plots and everything. All in all, it's a very deep and\ntouching movie with large amounts of killing.<br><br>If you like action movies or just great movies in general, then\ndefinitely check this out, it shouldn't disappoint.\n"},
{"review": "\nit would have been even better if it was historically accurate. wallace\ncame from elderslie near paisley in the lowlands,so why they had to\nportray him as a highlander beats me,what would have been wrong with\nhim in chain mail like in real life. wallace mentions england has\ncommitted theft rape and murder for the last 100 years in Scotland,wrong\nwar began in 1296 and Scotland and england had been at peace with\neach other for the previous 100years. there are irish at the battle of\nfalkirk,wrong they were weeks late for the battle,therefore with the\nfighting over they looted saint andrews,scotlands ecclisiastical\ncapital and headed home with as much loot as they could carry. in my\nview though the worst liberty the film took was its portrayal at the\nend of bannockburn, in reality both sides had come to annihilate the\nother, the bruce coming to pay homage is sheer and utter nonsense. and\nthe battle was fought over 2 days,not one headlong rush like the film.\nstill an amazing film.\n"},
{"review": "\ni think this is best movie ever made in the world... everything is so\nperfect...this is wonderful story telling... i went back to see the\nfilm again. the battle scene simply brilliant and fantastic looks\nreal.. i just loved the character of hamish... visual effect were\namazing and direction is awesome..the battles of this movie is looks\nreal and too great.the ending of this movie is satisfying .\nIntentionally and unintentionally it was simply emotional in the ending\nwhen he say freedom and see his wife after his death its to touching.. <br><br>i.e it is magnificent, visually emotional and so touching i will always\nremember this name WILLIAM WALLACE::\n"},
{"review": "\nI think Braveheart Is the best movie ever made. It has a unique story\ncast and crew.But what made it so good and emotional was the beautiful\nmusic to describe the feelings and energy that went on in each time. I\nthink that the music in Braveheart is the best i have ever heard in\ntheater. I have seen many films in my time and this one has not only\ngiven me entertainment but inspiration to do things. Mel Gibson will\nalways be William Wallace to me. He is a brilliant actor as well as a\ndirector and i think that in Braveheart he did the best anyone could\never do. It keeps you exited as well as overwhelmed with grief over the\nthings that William went through and the legend he grew into. It's a\nmovie of honor and a story about a man who stood for the things he\nbelieved in and never went down. Although the justice was not served\nfreedom was.\n"},
{"review": "\nThis film is a tragedy.<br><br>This is unacceptable as a film.. so off the mark..<br><br>Yes i am English, as in i was born in england. The English did massive\ninjustices however this film does not hi-light facts about the who\nScottish raped and burnt English villages! well i should come over to\nAmerica and re direct last of the Mohican's and put it in total favour\nof the US!<br><br>so i think that we should all bear in mind of historic bio's!<br><br>Please watch this film though.. so you can have a good laugh.<br><br>Good night and good luck!\n"},
{"review": "\n\nI think that to even things up Hollywood should finance a motion picture in\nwhich Sean Connery, playing an Aborigine, leads his people in an uprising\nagainst their white Australian oppressors!\nIf nothing else it would give Mel\"Patriot\" Gibson an overdue taste of his\nown medicine.\nNow if you will kindly excuse me, being English, I have some evil to go and\ndo.<br><br>\n"},
{"review": "\nI can't imagine how anybody can take this farrago seriously.<br><br>I can see that if you didn't give a toot for Scotland or its history,\nbut you liked vigorous hack-and-bash action with one-dimensional\nvillains and heroes, cartoon acting (Gibson was clearly channelling\nFred Flintstone), simple-minded penis-size jokes and a dash of good\nold-fashioned homophobia, all set in beautiful (and totally\ninappropriate) landscapes, you could really enjoy this film. But it\nbeats me how anybody can stumble out after watching it babbling\n\"inspirational\", \"enthralling\", \"heroic\", \"romantic\" and all the rest\nof it. It's a joke movie to rent for a raucous evening at home over\nsome cans of beer. (Provided there's nobody in the house who cares\nabout the history of Scotland \u0096 they will certainly come out in a\nrash.)\n"},
{"review": "\nAs a dramatic fairy-tale - for those of us who like action movies and\nrooting for the underdog - Braveheart Is watchable and entertaining.\nBut there It ends. Where a budget of £75M went(compare to the\nrelatively tiny £3M budget of the Infinitely better \"Rob Roy\")one can\nonly surmise but It certainly wasn't spent on Historical study. The\nfact that Mel Gibson takes the part of William Wallace(who was a \"real\"\nperson) gives the clear and Intentional Implication that this Is a true\nstory - It Is not, and If the main character had been \"Just some brave\nScot\" I could stomach It - but real people and real events have been\nInterwoven with a fantasy with some of the grossest anti-English\nsentiment I have ever witnessed In a film. The production team couldn't\neven get the man-skirts correct(The Kilt was Invented four centuries\nlater by Englishman Thomas Rawlinson In Lancashire In 1720)and the\n\"head-In-a-basket\", the \"princes-boyfriend-thrown-to-his-death\" and\nmultiple other scenes are pure fantasy as Is the age of the homosexual\nprince's French bride (she was aged 9 when married - not that the\nmarriage would ever have been consummated whatever her age!). The clear\nIndication that all Englishmen were cowardly scumbags while all Scots\nwere thoroughly decent heroes pervades the whole movie and on a\npersonal note I find this offensive and racist as do many of my\nmovie-loving peers. However, I'm happy for those who will no doubt\nenjoy It - as long as they realise that the only true fact this movie\ncontains Is the names of some of the people.\n"},
{"review": "\n\nIn fact it´s one of the most romantic films I´ve seen in this century near\nto end. I also agree it´s almost 3 hours are not noticed.<br><br>The best scene for me is when Eduard is coming uspstairs the tower. The\nmagnificence of this scene lies in he is not seen at any moment, but just\nthe sound of his steps coming up, and the face of his son when hearing his\napproaching.\nBattle scenes are also greatly succeeded.\nSophie Marceau &amp; Patrick McGoohan also make a great interpretation.\n\n"},
{"review": "\nWell, if you're planning to watch a movie that won't disappear from\nyour mind in weeks, that's it. <br><br>This is clearly the best movie i have ever seen, every bit of this was\njust astonishing. I can say some stuff about scenery and actors but\nit's not necessary so i will move on to the main point - plot. I\nhaven't seen such a beautiful movie about love which transformed into a\nfight for the others. Main character played by Mel Gibson is a great\nexample of person who lost his love and sacrificed himself fighting for\nother people's freedom. I've heard some bad stuff about historical\ncorrectness but in my opinion it doesn't matter - Mel Gibson has\ncreated an excellent movie, not a document.\n"},
{"review": "\nThis movie is very overrated. It is in no way historically accurate. It\nis incredibly one-sided, with the Scots being portrayed as innocent\nheroes while the English are pure evil who rape women and kill\nchildren. The large amount of fighting and gore was unnecessary and\nquickly became boring to watch. The romance was laughable. Wallace's\nwife only served as a plot device. She was killed after attacking a\nsoldier who tried to rape her. Wallace was so enraged by this that he\nkills half the Englishmen. Except then he completely forgets about her\nwhen he has an affair with the French princess, which by the way was\ncompletely ridiculous. The movie is also homophobic, portraying the\nvery stereo-typically gay prince as weak and incapable of pretty much\nanything. Lastly the movie is way too long.\n"},
{"review": "\nMy point is which group of villains rule over a country could not\ninterest me in the least. Where on earth do you imagine all this\niniquity flows from? Human Nature, good luck improving it. The\nglorification of the Scots and the concomitant delineation of the\nEnglish as Satan's imps, forgive me, speaks more to Mel being an\nAustralian than to historical veracity. There is this unrelenting\ndemonetizing of the English right out of a comic book. The Lords Of The\nCongregation who ruled over Scotland, for a time, were not renowned for\ntheir heavenly saintliness towards papists. This is the other problem\nthe movie's deep sense of historical unreality about it. You feel right\naway that you are getting a parallax view, a very biased one sided\npicture.\n"},
{"review": "\nOne of my all time favorite films.<br><br>Constantly quoting this film.<br><br>I'm especially a fan of the male bonding in this film, the way the\nwarriors have the ability to be lighthearted and clever while being\nsuggestive in situations in the midst of serious conflict.<br><br>The movie has an amazing ability to be a period piece and also remain\nrelevant and contemporary feeling twenty years after release.<br><br>It is amazing to look at Mel Gibson during this time period, and what\nan iconic and prolific actor he was.<br><br>Here's hoping for more films like this to come out two decades later.\n"},
{"review": "\nThis movie will never forget. There will always be a special place for\nme. Sense of freedom has a special significance for me every time.\nEspecially a person who does everything you need for your ideals. And\nthe sense that I do not want anyone to feeling of betrayal. I would say\nthe best treatment of the film cause and effect. Similar filmed many\nmovies, but that is special for me. Love, freedom, war, justice, in\nshort it has got everything.<br><br>And it tells something so much better for me. Victory is not to\nsurvive, it is reach the purpose even if you died. As a result, an\nexcellent movie.\n"},
{"review": "\nfirst thing i wanna say is about music is great most heartbreaking\nmusic i have ever heard in any film.performance specially by Mel.Gibson\nis great his dialog's and his luck make me sad and yes the character\nhas power to make anyone.sad the scene when he left his home.on\nchildhood and the funeral.scene of flower will.blow.your mind.i\ndon't.write reviews for.every film but some movies make.me.helpless\nto.unfold.my experience.the portrait they made for war.is very\nrealistic the main power of film is its story music and.dialog's which\nshows.their.feelings one of.the.best films.i.recommend.the brother bw\nthem.is the only key of.their.success and at the end what a miserable\nscene of murder you cant hold your years inside and will.start thinking\nabout that times. history is very interesting whether its\nof.your.country or others\n"},
{"review": "\nOne of the best movies I have ever seen. Pace was just right, and the\nstory was so captivating that I didn't care about the length. I\nactually wish that more movies were longer so they could show character\ndevelopment as well as this. It was a beautiful portrayal of patriotism\nand love, and revenge. I'm glad I didn't see this when I was younger\nbecause I wouldn't have understood it. I would've just thought \"oh,\ncool war movie.\" I also don't care about it being historically\ninaccurate. Why do all movies representing a historical figure have to\nbe completely accurate? Casting was great, Mel Gibson did a wonderful\njob, and am glad he did it. I don't want to know what it would have\nbeen like if he wasn't forced to play that role. Definitely would watch\nagain if I ever need some feels.\n"},
{"review": "\nBraveheart. The Oscar winning war drama acted and directed by Mel\nGibson. It is the heroic tale of how a Scottish commoner rebelled\nagainst an English tyrant. With a grand canvas, absolute stunning\ncinematography, a water tight screenplay, very well acted and above all\ndirected with such a passion and courage that you want this tale not to\nend at all even after the three hours of running time. After an\nemotional twist in the tale, the movie goes to a very high level of\nfilm making in unforgettable last hour of it. It's Mel Gibson's show\nfrom start to finish as he acts and directs with full love and\nunderstanding of cinema. The war scenes are detailed, uncluttered and\nmesmerizing. Sophie Marceau as English queen looks beautiful and acts\nsmartly. The camaraderie among Scottish rebels is charming and provides\nthe comic relief. Just like Gladiator, Braveheart is the heroic tale\nworth revisiting again and again and again.\n"},
{"review": "\nI love this film, this is very patriotic film which makes you fell\nwonderful and how the people fought for their freedom. I watched this\nmovie many times i never got fed up every time i watched i enjoy it and\ni find something new. The way people used live and how strong they were\nmentally and physical. the nature, the greenery the field and the\nScotland mountain pictured so beautifully. from other hand the betrayed\nby your friend and own people-how painful that could be and still not\ngive up.finally the day execution day to accept the king they well let\nhim go but he never give up. he die with a dignity and proud. The true\nlove can make do anything even if you are with her or not.\n"},
{"review": "\nWilliam Wallace (Mel Gibson) is the son of a minor landowner who was\nkilled by Longshanks' treachery. He would start a revolt after his\nsecret wife was executed unjustly. The revolt would grow to an all out\nwar against the tyrannical king of England.<br><br>Director Mel Gibson is pulling all the stops to create this epic\nhistorical melodrama. It is rip roaring fun. The action is blood\nsplattering joy. The scale of the battles are actually quite impressive\nwith real people. It's the kind of sword swinging that every boy dreams\nof playing. The story is full of melodrama starting with avenging his\ngreat love, to a romance with a princess. Historical accuracy is\nunnecessary when it's so much fun. It taps into all of the archetypes\nof heroes and villains putting them into a compelling historical drama.\n"},
{"review": "\nMel Gibson has come so far in the movie business and he not only stars\nbut directed Braveheart. He did a terrific job and deserves a lot of\ncredit for this remarkable film. Despite it not being totally accurate\nwith history, anyone can enjoy \"Braveheart\". Based on the life story of\nWilliam Wallace, a town peasant who just wants to live in peace and\nharmony with a wife and children. But when the British king of England,\nLongshanks, is sick of Scotland \"being full of Scots\", he comes up with\na way of bringing them more into a British land by \"breeding them out\".\nPromising any British soldier to a Scotish bride on her wedding night\nbefore her husband can have her. Wallace won't hear of it and marries\nhis love in secret. When a British soldier notices his wife and\nattempts to rape her, Wallace comes in and saves her causing a riot in\ntheir village and he thinks he's got her safe when he sends her away\nfrom the soldiers, but they catch her and kill her right in front of\nher family.\n"},
{"review": "\n\n\tA remarkable film in which I can watch several times without faltering.  I\nam as much a lover of history as I am of film and literature, so I must\nacknowledge that this film is loosely based on the life of Wallace and does\nfall short in numerous instances to historical verity.  That said it remains\na stunning achievement in film work liberally reconstructions actual events\nin order to present a gripping modern epic.<br><br>\tThe entire movie is engaging but two scenes stand out: The `gift of the\nthistle' moment when the beautiful young Murron presents the young Wallace\nwith a wildflower at his father's funeral.  Few tableaus in film history can\nmatch the power here as the music swells in harmony with touching scene. \nThe tremendous Stirling battle scene (though vastly historically inaccurate)\nis also a piece de resistance, from Wallace's rousing speech to his contempt\nfor the English commander, from the comic relief of the mooning and flashing\nof the recalcitrant Scots and finally the riveting battle itself (that may\nonly possibly be rivaled by Saving Private Ryan's D-Day landing sequence for\nsheer power in a battle scene).  It's also notable that the script and\nGibson's direction provide for a juxtaposition of this violence with the\nsoothing powers of femininity; the bride who eases her husband's wrath sotto\nvoce and gently pushes the adversaries blade from his throat, the lure of a\nlife with Murron in which Wallace initially attempts to stay clear of war\nand the obvious benevolence of the princess.<br><br>\tThis movie is a great one and without a doubt in my top\nten.<br><br>\n"},
{"review": "\n\nWhat can I say about this movie. This is one of the best movie out there. I\nliked everything about it. The scenery was beautiful. The battle scenes were\nreally well done, bloody, but well done. the music is really good. This\nmovie gave me goose bumps. I recommend this movie to anyone who likes a good\nbattle movie, or a good drama. \n"},
{"review": "\n\nI can't even express how much this film means to me. My husband and I even\nused parts in our wedding. Never has a film moved me this much. No, it's\nnot\nhistorically accurate, so little was known of the real William Wallace. It\nwas\nperhaps over the top in parts. It had brutal war scenes. No one can\ndispute\nthat this film is an epic, sweeping wonderful story. Also, James Horner\nwrote a stunning score. Truly a classic, energising, and beautiful\nstory.\n"},
{"review": "\nIt is simply wrong to pervert history in the way this film does.\nReading the reviews, the many American reviewers seem to believe it as\nan accurate representation. It isn't. It takes more liberties that a\nWalter Scott novel The acting is also very mixed. The Irish accent of\nthe actor playing the father of Wallace shines through for instance,\nand Gibson's attempt as a Scottish accent is almost on a par with Dick\nvan Dyke in Mary Poppins. Beautifully filmed with some fine\nperformances (eg Brian Cox) it also has a haunting score, and it has\nentered movie history with so many of its effects and sayings entering\npopular culture, like Scots sports fans painting their faces blue. But\nit is tosh. Hardly any of it happened, the time line is way out and\nGibson is far to short to play Wallace who was a giant of a man. For\nme, the reaction of Americans who constantly seek imaginary roots only\ngoes to prove that as a nation they are on the dimmer side of average.\nEnjoy the film as a fairy tale but just remember it is a fairy tale.\n"},
{"review": "\nThis film by Gibson is very imaginative, but should never be\ninterpreted as being historically accurate. Personally, I disliked the\ngraphic violence, the awful details of guts being ripped out, etc., but\nthis degree of violence seems to be the norm for Gibson - he seems to\nthink it adds realism or impact. When he has the Scottish rebel\nseducing the English queen - well, I'm an Aussie Republican, too, but\ndo we have to resort to this level of dishonesty to make an impression?\nI think it was a great pity the account did not stay closer to the\nfacts; that would have been sufficient because the ancient truths of\nthe era were impressive enough.\n"},
{"review": "\nThis film is special, a work of art full of emotion! The music, the\nscenes, the dialogues, a masterpiece!<br><br>William Wallace is a Scottish rebel who leads an uprising against the\ncruel English ruler Edward the Longshanks, who wishes to inherit the\ncrown of Scotland for himself. When he was a young boy, William\nWallace's father and brother, along with many others, lost their lives\ntrying to free Scotland. Once he loses another of his loved ones,\nWilliam Wallace begins his long quest to make Scotland free once and\nfor all, along with the assistance of Robert the Bruce.<br><br>When his secret bride is executed for assaulting an English soldier who\ntried to rape her, a commoner begins a revolt and leads Scottish\nwarriors against the cruel English tyrant who rules Scotland with an\niron fist.\n"},
{"review": "\n...hands down. I don't understand why this movie does not have a higher\nranking of Greatest Movies of All Time. It should be Number 1. Everyone\nI know whom I respect as a human being LOVES this movie because of its\nthemes of courage, honor, love, faith, and sacrifice. <br><br>The cinematography, acting, script, music, themes were all absolutely\nbrilliant. I registered for an IMDb account just to make this review\nand in honor of James Horner (RIP). I have seen this movie about 50\ntimes (not kidding) and heard the soundtrack 100x+ (again, not\nkidding). <br><br>Mel Gibson created a timeless masterpiece. And James Horner composed\nit.\n"},
{"review": "\nThis is one of the best History movie. This about a war between\nScotland and the Birth empire. Mel Gibson did a great job. This movie\nhas a great story line. It also had great acting. It also has get\nspecial effects. It very fast pass. It has a lot of action. This is a\ngreat movie. See it. People who say it is historically inaccurate do\nnot know what they are taking about. They probably just have some hate\non for Mel Gibson. You like history see this movie. This one of the\nbest history movies ever. It is not a family friendly movie. Which is\ngood thing because I hate family friendly movie. I think they suck. I\nhave not seen a lot of history movie I just got into them. This is one\nthe best one I have seen so far.\n"},
{"review": "\nBRAVEHEART is one of the greatest inspiration I've had as a filmmaker.\nIt inspires excellence in the film craft, both in terms of its\nexcellent production quality from the crew and the beautiful\nperformance by the cast of the movie. The fact that the movie is based\non true events inspires me even more. For me, Brave Heart is the\ngreatest patriotic movies of all times. I never get tired of watching\nit, and every time I watch it I'm doubly inspired; first it makes me\nreaffirm my decision to live my life a dedicated patriot of my country,\nand secondly to dedicate myself as a filmmaker to producing movies that\nwill impact positively on humanity. I love the great plot of the story,\nthe amazing epic setting, and my most thrilling of all; the perfectly\nchoreographed BATTLE OF STERLIN BRIDGE. It has also inspired a couple\nof my works as a filmmaker. It's a must watch for every filmmaker!\n"}
]