[
{"review": "\nI really don't understand all the hate this movie gets. Yeah, I get it,\nit's a reboot of a perfectly good 80s movie that nobody really wanted,\nbut it's a really good one! I expected a mindless Micheal Bayian action\nmovie and what I got was a really smart, interesting and entertaining\nlook at trans-humanism, the freedom of choice, politics and\nrecklessness in corporate leaders.<br><br>This movie really dives into the question of how a person could live\nhis day to day live with almost all of his body amputated and stuck\ninside of a machine. So when people complain about the uncomfortable\nscenes between Murphy and his wife, I can only imagine they mean what\nhappened after his transformation, and that felt exactly the way it was\nsupposed to!<br><br>So yes, the original is way more graphic and still holds up to this day\nas a gruesome action flick, but this one is smart and interesting and\nreally is a good movie in it's own right.<br><br>And by no means is it as bad as people say it is!\n"},
{"review": "\nI love Paul Verhoeven's RoboCop from 1987 (which remains iconic) and I\nusually don't like reboots. But watching the new one I never got rid of\nthe feeling, that the remake is worth it. It is a whole new\ninterpretation, that sets the focus on the topics of our time: robots,\ndrones, the human aspect behind the technology, media critics, war\npropaganda. I felt, the movie has a mission to enlighten people and I\nliked that. It became even more obvious how much the RoboCop story\nexists within the topos of Frankenstein which is the story about the\nhuman devilment and the lack of respect of life. That's why Padilha\ngives Murphy more of a face, a life and feelings.<br><br>Beside that the pictures, the sound, the music is pretty contemporary.\nYou probably have to make some compromises today to get the millions to\nget the flick done. It won't become iconic, but it's the right time for\nthe right message in the right movie.\n"},
{"review": "\nBy 7, it really means a 7.5/10. Not sure what's with the negative\nreviews, but I enjoyed the movie very much. It's well-executed and the\ndirection was clear and crisp. There's no distinct feel-good actions\nscenes because the pacing is kept constant throughout and I don't see\nwhy there's an issue with the pacing being that way. It's hardly flat,\nit's just a very honest, straight- flushed story-telling, and it fits\nthe themes that are underscored by the movie. Alex Murphy is a\nreluctant hero and he's ultimately a father and a husband whose\npersonal agenda serves as his existential core. I like how these themes\nare teased out and zoomed in upon throughout the movie. Also, there are\nsome absolutely delicious production details and CGIs that are just\nabsolutely feasts to the eye. Not to mention the superb cast and the\nwonderful performances. I think this is a honest and loyal reboot that\nwill appeal to fans of Robocop who fell in love with the story\nprecisely for the moralistic themes it explores.\n"},
{"review": "\nI just don't see, why any other recent science fiction movie deserves\nmore respect than this one. The story is fluent, the characters are\nwell built, everyone has its own motive. Yes film is more of a personal\nstruggle journey of the main character and that is what I like. For the\nfans of action it is also good, why when (quite often) there is, it is\ngood one. The effects are quality mastership. The most memorable scene\nis when Murphy sees what he has become.For my regards it has some\nphilosophical connotation to, because it also concerns the influence of\ntechnology to the society. It clearly shows bads and goods. I recommend\nwatching this movie for\n"},
{"review": "\nOK, this movie probably isn't a 1 out of 10, but when you remake a\nmovie as memorable as the original Robocop, you'd better do something\ninteresting. They didn't.<br><br>No, I didn't watch the original first, I watched it afterwards and that\nis the problem. You watch Robocop 2014 and think \"Meh, pretty\nentertaining\" and then you watch the original and get taken on a roller\ncoaster ride.<br><br>I'm not going to re-hash the original movie here, it would be a waste\nof effort. Just do yourself a favour and don't waste your time on Robo\n2014, search out the original Robocop. You won't be disappointed. The\nflick isn't nearly as dated as you would expect aside from the clothes\nand the vehicles. The humour is dark, dirty and noir at its best.\nDetroit looks nasty - the way anyone who has never been to 2014 Detroit\nwould expect it to look. The criminals are drugged out wackos - the\ntype of criminals you expect to see in 2014. The cops are cannon fodder\n- unlike the cops of 2014, who are far more trigger happy and eager to\nsave their own skins. Clearly Paul Verhoeven didn't understand the\nmagnitude of the police state that America would become - google the\nnumber of American's in prison if you doubt me.<br><br>Really simple here, folks - watch Robocop 1987, not this generic crap.<br><br>Hollywood, you would have made more money re-releasing the original.\n"},
{"review": "\nBefore I went to go see it, I already knew it couldn't compete with the\noriginal. But this actually was worse than I expected. What was great\nabout the original just like Terminator is that it was grimy, dark and\nalthough robot cops offcourse aren't that realistic they we're not\nbeyond belief.<br><br>This pushes everything, RoboCop has to weigh at least a couple of\nhundred kilo's but it runs like Usain Bolt. The way it jumps could\neasily make him a star NBA player. If you are a fan and actually wanted\nto believe this could be real, this alone ruins it completely.<br><br>Then there are the \"let's-make-him-modern-and-cool\" errors. Why paint\nhim black, he's not Batman. Why does his visor light up red, he's not\nCyclops and he has thermal vision so, he doesn't need a light. Why does\nhe have to recharge at least 10 times during the movie, did Apple make\nhim?<br><br>The Human Hand Pffff, Why GOD why? <br><br>Taser The original Robocop had part off his awesomeness because of the\nautomatic Desert Eagle. Everyone wanted that gun. This one has a taser.\nA taser,... really?\n"},
{"review": "\nOK, so the trailers for this movie had made me very badly predisposed\ntowards it, being a really big fan of the originals (yes, Robocop 2 and\n3 included). But I won an invitation for the first screening in my\ncountry so I thought why not.<br><br>Well, it is much better than I expected and than what the trailers\nshow. I won't go into spoilers, but my biggest issue with the trailer\nwas the fact that Murphy knows from the beginning what they did to him,\nno memory erase and all. Well, I have to say that they are actually\nhandling this very well in the film and it's not that simple. It\nactually sets the tone for the impressive second half of the movie.<br><br>During the first half of the movie I was like \"OK, it's a nice film but\nnot near what the first film accomplished\". Well, it's like they heard\nme, because the second half feels pretty much like the old ones!<br><br>The script uses actually some of the best concepts of the first two\nfilms. Joel Kinnaman does a pretty good job as both Alex Murphy and\nRobocop. He doesn't manage to steal the impression that Peter Weller\nmade of course, but he truly does a good job. I hope we see more of him\nin the future. <br><br>All in all, to all those who, like me, had low expectations from this\nfilm: give it a chance. It's much better than what the abysmal trailers\nlet you think. By the way, what is it with awful trailers to good films\nlately? First Pacific Rim and now this...<br><br>Oh, and there are sequel hooks for a movie that will be even closer to\nthe originals. Here's hoping...\n"},
{"review": "\nI have watched the original RoboCop movies. This remake does not come\nclose to any of them! Many reviewers here comment to not compare it\nwith the original RoboCop movies. What kind of nonsense it that!!! This\nis not a new and original story. It is a REMAKE!!!! Would you not\ncompare the next Titanic movie or the next Batman, Superman movies with\nthe previous versions?!!! Of course you will. You can't just copy\nsomething and say it is not the same as original!! If it is supposed to\nbe similar to the original at least they could make this a better\nmovie. But they did not. The whole movie was just about how RoboCop\nbecomes RoboCop and gets his revenge. So much for the storyline. That\nwas just the first 5 minutes of the original RoboCop. Bad acting, bad\nspecial effect. What a waste! A disgrace for RoboCop. It is a shame to\nmake a mockery of a classic movie!!!!\n"},
{"review": "\nAlex Murphy, damaged in an explosion to the point of death, is the\nideal candidate for a new initiative to join human sensibilities to\ncomputerised and robotic peace-keeping hardware. But Murphy has his own\nmind, which leads to conflict with those responsible for the attempt on\nhis life (plus others), which may stretch beyond the criminal\nfraternity.<br><br>The 2014 remake of Paul Verhoeven's classic 1987 sci-fi satire includes\nmost of the story beats from the original, but has quite a different\nheart. This makes it into a different film, and one which I enjoyed as\nmuch as the original.<br><br>Despite being full of action, it is a much gentler film. The violence\nis not as sadistic, there is no profanity (imagine that!), the\nrelationship between Alex and his family is much more important, and\nGary Oldman's conflicted Dr Frankenstein - sorry, Dr Norton - is a fine\ncharacter: he is the actual heart of the movie.<br><br>If you loved the 1987 version with a passion then you may hate this. If\nyou merely liked it, you may like this version too.\n"},
{"review": "\nTo start, I'm a Robo fan since I was 3. Have seen the 1987 movie like\n30+ times. Have lots of merchandise and even a tattoo. Stop reading\nreviews, go to a cinema and watch it. If you can get there alone\nbetter, girlfriends don't like this movies in valentines weekend, and\nold Peter Weller fans will talk dirt about it even without watching it.<br><br>The movie is Perfect. Different than the original but it is not better\nand it is not worse. I'm not a Marvel super heroes fan but the Avengers\nmovie/IronMan3 are the top 10/10 in the scale to compare with Robocop.\nAnd Robo gets a 9/10. Forget it is a remake. Forget it is a PG13.\nForget the human hand. Forget it is not Peter Weller. Watch it and you\nwill rate it 8+/10 for sure.\n"},
{"review": "\ni think this is a totally bad reboot like \"totall recall\" ! and it was\na huge Insult to Persian people , it show Persian like taliban or some\nother crazy terrorists which is not right !!! that creepy city wasn't\neven similar to Tehran !!! i hope this movie get more bad ratings...\n!!! i mean they didn't even take a time to know what or where is\nIran!!! its right that Iran has the wrong people as The Leader or\npresident or a lots of those politicians that doesn't worth that post\nbut people are not like that and there is no terrorists in Iran , at\nleast we wont kill each other in cinema or school...!!! lets look at\nthe movie , if we just see it as an action movie it will be a OK movie\nwith a lot of problems but as a reboot of RoboCop it was totally awful\n!!!\n"},
{"review": "\nShort version - One ticket to Mars please to get away from these crappy\nmovies.<br><br>Long version - If Hollywood really cannot think of any more movie ideas\nthen they need to think more then taking old movies and remaking them.\nSeeing as oh I dunno majority of them suck ass. Red Dawn/Total Recall\nand now Robocop? F*CK YOU. I would like to see different movies with\ntwists in them not the same childhood/game/remakes over and over. If\nyou cannot think of anything I am pretty sure it is time to stop making\nmovies for a while and make something else. I seriously doubt anyone is\ngoing to miss movies seeing as how much they suck.\n"},
{"review": "\nHow the heck did this film get past funding? Seriously even the spin\noff TV show from 1994 was better, the animated series had more graphic\nviolence and more in common with the original than this joke.<br><br>It is only because of the original movie that i am putting the effort\nin to write this review<br><br>Every single scene from the original was far superior in every single\nway to this garbage, everything from the dark humour to the cinematic\nimpact on the viewer is completely absent from this vacuous new\noffering, acting was limp, a real antagonist was non existent, no\nClarence Boddicker, no Dick Jones (2 of the finest yuppy villains to\ngrace our screens in the 80's), no cool bad guy gang, no class or style\nexcept from Gary Oldman who was sadly not enough to make this movie\nanymore enjoyable or worth more than 1 rating, i'd give zero if it was\nan option.<br><br>When i first heard they were remaking Robocop i knew they could not\never match the original but i thought it would at least have more\ncredibility than the animated series.<br><br>The core of the problem is the cgi, it just leaves you devoid of any\nemotion toward the action, ED-209 is a zero impact character in this\nmovie, as you know in the original ED-209 was legendary and cemented\nitself into your mind even as it got blown to bits from the Cobra\nAssault Cannon (state of the art bang bang) with nothing but a pair of\nlegs left and gyroscope element twitching like a dead nerve impulse in\na once living creature, original Ed-209 was a beast, new ed-209 didn't\neven raise a single goosebump, alive or dead. Same goes for every\naspect of Robocop himself, by the end i was willing the real Robo to\nmake an appearance spin out his gun and blow this sh!te away off my\nscreen, deliver a classic one liner and walk off, <br><br>\"Thank you for your cooperation, good night\"\n"},
{"review": "\nThe trailers &amp; teasers DO NOT do RoboCop 2014 any justice! I grew up\nwith the original RoboCop films and I went into the remake thinking\nthat it would be lousy like previous remakes (Total Recall, A Nightmare\non Elm Street, Conan the Barbarian, The Karate Kid, &amp; etc.). But for a\nPG- 13 movie the new RoboCop is packed with a lot of action!! The\nshoot-outs are intense. The drama and story were also very well done.\nYOU the viewer will actually CARE about Murphy and his family. You will\nwant to see the villains get what they deserve. <br><br>The Special Effects/CGI were AMAZING!! Fantastic job well done. I was\nnot feeling the black suit, but RoboCop does wear the classic armor/\nsuit in the beginning and at the very end. <br><br>There's a few references to the 1987 RoboCop film. For example: the ED-\n209 robot machines, when Jackie Earle Haley said \"I wouldn't buy that\nfor a dollar\", the classic RoboCop armor suit, \"Dead or Alive - You're\nComing With Me\", \"Thank You For Your Cooperation\" &amp; etc. The movie does\nhave its differences and tries to stand on its own.<br><br>I would recommend RoboCop 2014 to new fans and fans of the original\n1987 RoboCop. The ACTION scenes are HARD HITTING and FAST PACED. The\nbullets fly then RoboCop's targets die!!! Can't Stop RoboCop!!!! <br><br>The only thing that I did not like was RoboCop riding on a motorcycle\ninstead of in his traditional Police Car. RoboCop on the motorcycle\nmade me think of Terminator 2: Judgement Day. Other than that small\nblemish, I'd give RoboCop 2014 an 8 out of 10.\n"},
{"review": "\nThis is a disgrace to the original, at the time it was a groundbreaking\nand very shocking film, with great actors very original and well done\nideas and such an original style to it, well this crap is exactly the\nopposite, terrible story line, very slow to start I would go as far as\nsaying boring, and for the actors in it got to give it to the director\nthe whole film is just all terrible acting, the overall very bad crime\nfeel in Detroit doesn't come across, where are the crazy adverts, where\nis the infamous bad guy, and the setup to murphys story? All missing,\nwhy mess with the story line from the original which was excellent\nanyway, this is nothing short of an epic fail, it just manages to scrap\n1 star rating as robos HUD view is quite cool but that is literally the\nonly good thing I have to say, I can't remember the last time I was so\ndisappointed with a film, please director don't do any more films, a\ncomplete waste of what could of been a brilliant opportunity\n"},
{"review": "\nThe 2014 version of Robocop was a pleasant surprise for me as it turned\nout to be a much better film that I expected it to be. Expected it to\nbe a standard remake but it's actually a very decent reboot which is\nunique in its own way. <br><br>It seemed to me like this had more of a story and we got to know the\nmain character more before he even became Robocop. The CGI in this film\nwas impressive and I thought Robocop looked bad-ass in black. <br><br>The films builds up nicely and the action sequences towards the end are\npretty breathtaking. I think a lot of people are hating on this movie\nbecause they wanted to hate it as it was announced. I say give it a\nchance. <br><br>8/10.\n"},
{"review": "\nI am the original Robocop Fan (NOT the 3rd movie though), and I think\nthe new Robocop is really a not bad movie. It's has a complex character\ndevelopment that I didn't expect, and the story has many twists and\nturns that you are feeling concern and worry for the main character.\nThe problem is, there are many people enjoy/used to Michael Bay and\nmany money crapping Hollywood director's Bull S**T that when they are\npresented with a good movie with good plots, good messages, and talk\nabout real issue in our society, they complain that \"the movie has too\nlittle action\", or \"the story is too complicated that it hurts my\nbrain\" this kind of s**t talk. And too many people compare this to the\noriginal movie, with biased and prejudice that make them cannot look\npast the differences in the interpretation and presentation of Robocop.\nPlease give this movie a chance!!!\n"},
{"review": "\nSo I'm a bit late to the party; I'm still glad I came. This is a very\nhigh quality remake of a movie that never should have been more than a\nB movie when it came out. Nothing against the original I saw it 6 times\nthe week it came out, it is still the only movie I have ever seen that\nmany times in the theater. This remake however is really clean, and all\nof the tech is tight, and realistic in it's seamless melding with the\nnear future, with such a perfect cast making sure not to miss any of\nthe Iconic lines, though not being afraid to be a new, and different\nmovie. I don't need to tell you who is in it, I don't need to tell you\nwhat it is about, though the back story in this version of the story is\nfar more fleshed out, and there is less emphasis on the partnership,\nand more on family, but it is stronger this way for sure. I really\nEnjoyed this movie once I was able to get past that little head on the\nbig ru-but (and the American General saying oot for out) as well there\nare some flaws in the story that are allowed in order to get through\nthem. MGM's answer to Ironman, and Captain America. I recommend this\none to anyone who was a fan of the original, you just have to give in,\nand accept that this is a new Robocop, and it works, of course if you\nhave never seen a Robocop movie, or TV show (there were a couple) then\nyou most likely will take to this right away. Personally though I am\nstill hoping for the Robocop vs Terminator movie, I would accept\nanimation.\n"},
{"review": "\nI really am shocked at how rubbish this was. I had high hopes from the\naverage score here. I was pleased when I heard the original theme tune\nat the beginning, leading me to expect other loyalties to the original.\nThen, nothing, no loyalties to the original, or the comics. However, I\nam good at getting over such things, I can treat new remakes as\nIndividual films. I have to say though that they just didn't do very\nwell here at all. Most of the film was contained to the subject of his\ndevelopment, more so his combat mode, where by his cyborg side killed\nso many targets in so many seconds. It seemed to me that they made this\nfilm to make video games as that is all the story line seemed to\nrevolve around. I am sorry as I really thought it might have been a\ngood one.\n"},
{"review": "\nHi, this movie is a joke, at half of the movie i left the cinema. It is\na shame to call the movie Robocop. The original movie have more love in\ndetail then this kind of waste. The $100.000.000 would better spend to\npeople who needs more money. Making movie should filed with love not\nwith the only mind how much money i can earn with this. This is the\nresult of it.<br><br>bad work Mr producer of this movie thanks that i wasted my time to\nwatch this bullshit.<br><br>sorry 1 star is to much i reduce it to -2<br><br>greets\n"},
{"review": "\nI don't usually write reviews, but I have to stop and write one for\nthis film.<br><br>On a whim of nostalgia awhile ago just before the 2014 version was\nabout to premiere, I ordered the blu-ray for the original one. I also\npicked up an almost free ticket to see the new one ($7.50 off any\nshowing).<br><br>I kind of regret going tonight to see the new one.<br><br>It simply doesn't hold a candle to the original. It's bland and empty.<br><br>It's not that the acting isn't any good. The performances from Abbie\nCornish, Gary Oldman, and Michael Keaton were fine. The actor playing\nRobocop himself was...really bland. <br><br>There's too many problems with this film. First, it lacks the charm and\ngrittiness of the original film. There's no sense here that this\nversion of Detroit is an urban warzone out of control. The new version\ntries to pay homage to it by using some of its catchphrases, but they\nmake no sense out of context. Also, the plot structure from the\noriginal is almost entirely gutted and an inferior one put in its\nplace. It is cringe-worthy. Moreover, the film also lacks conflicts\nthat are needed for a story to even exist. Kurtwood Smith did an\namazing portrayal of a central villain in the original. This one\nhas...Samuel L. Jackson? He's not even the villain, just an annoying\nhost of a show, he's supposed to portray conservative media forces or\nwhatnot. Lastly, Alex, the central character himself...where is his\nconflict? The original film had him trying to come to grips with who he\nwas, and how he could get back home. Here, in 2014, Alex has none of\nthat to drive the film forward. The new film actually manages to make\nthe hero of the film repulsive.<br><br>I could go on and on. But the bottom line is that this film is\nskippable, unless you want to see it for the special affects and PG-13\nexplosions and gunfire. Otherwise, save your time and watch the old\none. In that one, at least the tin man has a heart.\n"},
{"review": "\nit was a very bad remake. when i walked into the theater i was\nexpecting it to be bad, but thought deep down it would surprise me, it\nfailed to. this movie only got a 2 because of sam jackson, with out him\nit would be a 0 (or 1 because IMDb does not have a 0 selection) if you\nlike bad remakes of classic movies like prom night or evil dead then\nthis movie is for you. a classic was butchered here. the original had\nso much more going for it, it was funny, action packed, thrilling, and\nyes violent. this movie had none of that, it was predictable, drawn\nout, and don't even get me started on that stupid human hand and\nridiculous retractable visor. the original was made to make a point on\nthe way the 80s were, this movie was made to make money and be generic\nas possible. if you want to spend the money on this movie i would\nrecommend take the 10 bucks go to the store and by the DVD. <br><br>the makers of this movie should have kept the b story of the original,\nwere robocop's memory was wiped and he did not know he was murphy until\nhis partner ann lewis (a character which was replace in this movie and\nwas completely unessential in the remake) told him. it made for a\nbetter movie when murphy's family thought he was dead. DO NOT SEE THIS\nMOVIe\n"},
{"review": "\nJust got from seeing RemakeCop and i think it sucked! <br><br>Spoilers ahead! <br><br>Im a fan of the original Robocop and i think Paul Verhoeven did a great\nparody/satire/Action/Bloodfest of the first Robotic police officer. It\nhad balls! <br><br>This one not so much. it is poorly written and goes straight by every\nchance it has to provoke you, entertain you or surprise you. When you\nhave two great actors like Keaton and Oldman discussing the ethics of\nwhat they do, they just pass on relevant information that you can\neasily muster up by yourself and move on to the next scene. The\naudience is not challenged in any shape form or fashion. <br><br>Sure its a movie called Robocop and its about a dude being amputated\nleft to right and turned into a robot, but still. Everything that made\nthe first Robocop great is missing from this one. Hollywood needs to\ngrow some balls if they are gonna keep this remake shenanigans up! <br><br>Come to think of it, Writer and director of God Bless America, Bobcat\nGoldthwait would have been the ideal director for the remake of\nRobocop! <br><br>one other thing i got annoyed with is the complete lack of technology\nthat the unnamed middle eastern country has in this movie. It's like\nthey are forever stuck in the seventies with giant robots harassing\nthem. And as if that is'nt bad enough the good old Omnicorp has a giant\nfactory in China of all places with a rice paddy field five feet from\ntheir walls. The Chinese of course don't have any robots or tech to\npick rice for them so they do it the old fashioned way with straw hats\nand everything. To follow up this travesty of how the future world\noutside of the u.s of a is, the whole movie ends with Sam Jakcson\nsaying the words: U.S.A have and always will be the greatest nation on\nthe face of the planet! American flag in the background and all :) <br><br>This movie insulted my intelligence and if you are a Verhoeven fan it\nwill insult yours too! <br><br>Thanks for reading<br><br>Erik F\n"},
{"review": "\nI would like to say wow to the studio executives on this film. I\nbelieve José Padilha was portraying himself as Dr. Norton in this film\njust wanting to make a good emotional film but studio executives\nportrayed as Raymond Sellars kept shooting him down saying no we need a\nmovie everyone can watch so we can gross more money. As Norton made\nRobocop emotionless with dopamine to please Sellers Padilha did the\nsame to the film with boring CGI scenes to please executives, only\ndifference being Sellers dying in the end for the attempted murder of\nAlex Murphy, were as the executives got away with the attempted murder\nof this movie.<br><br>Also did anyone else just think bet 365 every time Samuel L Jackson was\ndoing his scenes?\n"},
{"review": "\nI put the original classic 1987 Robocop out of my mind when I went to\nsee this. It makes sense to me to judge it on it's own merits.<br><br>Robocop manages to fail on just about every level.<br><br>The story, which follows Alex Murphy being transformed into a Cyborg\nafter near fatal injuries from a car bomb, is very slow to get going.<br><br>At no point was I invested in his journey and his wife's character only\nseemed to be there to where tops that emphasised her breasts.<br><br>There are unnecessary, boring exposition dumps that explain why he's\nmore like an emotionless robot in this one and his quest to expose\ncorruption and bring down a ruthless corporate executive is played far\ntoo lightly.<br><br>Every action scene felt like a tired Playstation video game.<br><br>It often had the feel of a Wednesday afternoon TV movie and I would not\nwaste your money on this one.\n"},
{"review": "\nOK.. So me n my friends had nothing to do on a boring Thursday night .\nGenerally we would have gotten drunk out of our mind and watched\nfootball and play a Lil snooker and Foosball in our favorite bar but we\nhave this tradition of watching at least 1-2 movies a week so that our\nnon drunkard friends don't feel left out and frankly I like to stay\nsober couple of nights a week. We had 3 or 4 options. Winters tale ,\nLone survivor , Robocop and something else I cant remember.\nUnfortunately we decided to go watch ROBOCOP. We did all the research (\nexcept watch the trailer - should have watched that as it would have\nconvinced us to go to back to the bar and do our regular Thang. Please\nmind my slang ) on IMDb METARCRITIC and ROTTEN TOMATOES ( all of which\ngave it horrible<br><br>reviews ) but against all odds ( and because we already were really\nclose to the theater ) we decided to watch the movie . And oh that was\nprobably the worst decision I made this week. The movie was budgeted at\na 100 mil!!! and yet it looked like a highly under budgeted film and I\ndon't think even a 100 more mil could have saved it. They just got\neverything wrong. The cast was so bad. ( Im a huge fan of Gary Oldman\nbut he screwed up big time ) and I really don't understand what the\npurpose of Samuel Jackson was in the film. There was only one scene\nthat I liked and thats it . There were a lot of dumb things in the\nmovie which any normal human being is going to notice and I really\nadvice anyone who goes through the trouble of reading all this nonsense\nto not watch the film. I didn't even sit through to the very end. I\njust couldn't. I felt like I would have dropped a couple of IQ points\nif I had. So the moral of the story is if u had 2 options and one of\nthem was watching Robocop blindly choose the other one cos I bet it\nwont be as bad as this one.\n"},
{"review": "\nThe sensational feeling I am left with after watching this movie needs\nto be put into words before I can rest. But before I get into this, let\nme start by saying that I am a huge sci-fi fan and the original RoboCop\n(from 1987) was one of my favorite in the genre. I recently watched it\nagain and I was still amazed that as an adult I could still appreciate\nthis movie.<br><br>Unlike the original, the new RoboCop (remember it is PG-13) had\nabsolutely nothing to offer and it was definitely the worst remake I\nhave ever seen. For the first time ever at a movie theater I found\nmyself wanting to leave in the middle of the movie. It is not that this\nfilm tries to be something it is not, it is simply not even trying to\nbe anything. yes, it is just that bad and I am not exaggerating.<br><br>The story is such garbage that makes you wondering if the director Jose\nPadilha even understood the original story line and when will these\ndirectors understand that such shaky camera work and Call Of Duty FPS\nview is NOT appreciated?<br><br>The only thing I can come up with which was not a total failure was the\nacting of Joel Kinnaman but unfortunately his part in the movie was too\nbrief. Samuel L. Jacksons acting on the other hand, as pathetic as his\nrole in \"snake in a plane\". Usually in such movies you want to see a\nvillain that is memorable that get you on your toes but none of the\nvillains in this movie had such characteristics.<br><br>I wish someone takes Jose Padilhas ELITE SQUAD and makes a pink panther\nlike remake of it.<br><br>To sum up: do not spend any money/time for this flick.\n"},
{"review": "\nLet me start by saying I was apprehensive of a reboot, remake whatever\nsince the original is still amazing today. However, the trailer looked\ngood and I liked that they had maintained the look of the original.\nSoooooo<br><br>That is where the similarities stop. This new Robocop starts out\npromising, building up who is who and though I think they spent WAY to\nlong on that part, I didn't mind until\u0085\u0085.. The way Murphy get hurt..\nHUH! How boring, lame, and unrealized. Not violent, not even exciting.\nStupid comes to mind. We spent 20 minutes building up the characters, a\nbit long but knowing the action will come I am still alright, then\nMurphy goes down in the weakest, most pathetic way. OK, its over, move\non, make Robocop and then let him kick arse. Now, we spend the next\nhour and 15 minutes in a political drama about robots in our community\nand training Robocop. Nothing of note happens here. NOTHING. So now, we\nhave watched one hour and 35 minutes and still NO ACTION. Just a couple\nof bad guys get caught very boring like. <br><br>Then, Robocop goes after the guy that put him down originally. The most\nANTICLIMACTIC SCENE in the history of revenge scenes. WAIT FOR IT..\nWere not done. Robocop learns that some cops are bad, which of course\nwe knew from the opening scene of the movie. So he goes after them,\ncaptures them without a fight. <br><br>WAIT FOR IT - we learn there is a higher cop calling some shots\u0085 Again,\nno fight, captured..<br><br>WAIT FOR IT - now, the company wants to terminate Robocop cause he has\nhuman within him.. So he goes after the heads of the company, again, NO\nACTION\u0085 Its over.. <br><br>This film was only good looking visually, but there is barely ANY\nACTION.. Its a SNOOZE FEST\u0085 Bring your girl and make out in the back\nduring this film.. That is all it is good for.\n"},
{"review": "\nRobocop (2014) was a hell of a lot more cerebral than anyone expected,\nputting more thought into its script than did the gimmicky (but still\nquite classic) ultra-violent 1987 original. The new film is high-\nconcept science fiction instead of over-the-top satire, touching on\neverything from drone deployment overseas to free will to domestic\nsurveillance. The movie even gives a nod to the question of the\nexistence of the soul.<br><br>It's good, but it will never achieve the cult classic status of the\noriginal. As much as I liked it, I could have used a few more action\nscenes. This was a well made movie, but the kid in me wanted just a\nlittle more screen time for the ED-209's, more bot-on-bot slugfests, or\neven a reappearance from one of the original franchise's garish, comic\nbook villains.<br><br>Still \u0085 this was well done. It was sure better than anyone in the fan\ncommunity thought it would be. I'd recommend it. And, really \u0085 can any\nmovie come CLOSE to matching one that casts Red Foreman, the Dad from\n\"That 70's Show,\" as the Big Bad?<br><br>http://ericrobertnolan.wordpress.com/\n"},
{"review": "\nI am a Robocop fan and this is just an insult.<br><br>As a standalone movie, even if it was called \"Cyborg Detective 2014\"\nand had nothing to do with the Robocop universe, it's still a waste of\ntime. <br><br>Besides the dull, stupid, anticlimactic, boring and predictable script,\nthe visual effects and artistic style are lame and look like they were\ndone for a low budget TV series. <br><br>The original 1987 version of Robocop is superior in every possible way\neven with the outdated stopmotion animation.<br><br>I really don't understand why is this happening, Hollywood is just\ngetting worse and worse these days, remaking everything and calling it\nthe same as the original like it's meant to replace it and it's\nautomatically better. This movie was just a waste of time and money and\na big stain on the Robocop franchise, right up there with Robocop 3. <br><br>If this is the future of Hollywood, I feel bad for every movie buff out\nthere. <br><br>Stay away from this garbage!\n"},
{"review": "\nTaking Robocop as a work of science fiction means that it should be\ninterpreted not only as a warning sign of things to come, but as an an\nallegory of what is happening right now. In this reading, the figure of\nAlex Murphy as an individual collects together our fears of what we've\nbecome collectively: dependent of and controlled by the intricacies of\nthe systems we've created. To this end, the setting up of the movie\nworks well and picks up themes not present in the original. It is\nchilling to see Murphy in his condition, and think \"that's us\". <br><br>However, from here on the directions taken are less than satisfactory.\nRobocop does not seem to say anything really new or insightful about\nthis human condition. The message is that we can go far, but should not\ngo \"too far\": a science-fiction cliché. Most of the opportunities for\ntrue commentary are missed. The irreverent humour of the original is\nmissing, replaced with a tired critique of USA as the world police\nsomething-something. Surely an acceptable target by now. Any real\nreligious, philosophical and societal issues that might emerge are\ninstead tactfully ignored or merely hinted at.<br><br>I did find Robocop to be an enjoyable ride on the whole, but it could\nhave been more. It is hardly the turkey some reviewers have made it\nseem, though.\n"},
{"review": "\nWhile I went in to the theater with visions of the 1998 Godzilla fiasco\nlodged in my brain, I left cheering and refreshed.<br><br>Let me just make one thing perfectly clear, no, this isn't an exact\nremake of the original Robocop that I fell in love with as a child, but\nit certainly proves to me that just because something is PG-13, doesn't\nmean that it can't be gory and gritty in its own right.<br><br>To be honest, when they stripped away all of the robotic suit and\nshowed Murphy what remained of him, I a bit shocked and kind of\ndisgusted. However, it was not in the whiny protesting way, but rather\nthe \"oh gods, I just saw an animal get hit by a bus\" shocked. That\nimage of pulsating guts and organs was rather grisly.<br><br>The action scenes were a bit too fast for my taste, and I thought that\nsome of the Samuel L. Jackson scenes were hit or miss, but overall, I\nfound this movie to be as entertaining and action-packed as the\noriginal and certainly worthy of the name \"Robocop\".\n"},
{"review": "\nInteresting remake.<br><br>Not as cartoonish as the original, and the satire is more bitter. They\nchanged the hero's dilemma, in that his humanity was present from the\nbeginning of his robotishness. Also they got in the issue of illusion\nof free will - hot topic for everyone.<br><br>The action scenes were good - particularly driving a bend on the\nmotorcycle while Robocop steers with one hand and shoots with the\nother.<br><br>The CEO was an excellent parody of marketing-as-product (Steve Jobs\n**cough**), but the TV talking head was not convincing - although that\nkind of nutty ranting is a good target.<br><br>Anyone who thinks this was unnecessary, just think - the original was a\nsatire on the corporate take over of political power in the US, but it\ndidn't make a blind bit of difference.<br><br>This one isn't perfect, but it matches the original at a time when the\nneed to break corporate power is even more urgent.\n"},
{"review": "\nThis film was not anticipated by many people because they love the\noriginal Robocop and they were worried about there franchise but I must\nsay that this is indeed a good film but it does have it's problems.\nThis film sees a good cop Murphy critically injured by a car bomb and a\ncorporation decides to combine him with robotics to create Robocop. Now\nthe guy they got to play Murphy was not a decent actor and it really\nshows when we try to sympathise with the character of Murphy, but he\ndoes a pretty good when being the emotionless Robocop and he does a\ngood job with the action scenes that is necessary in a film like this.\nThe supporting cast is also pretty good with Gary Oldman being\nfantastic in the film as the scientist who puts Robocop together and he\nseems to be the one who is doing the best with his acting ability.\nMichele Keaton is in this film as the head of the corporation and he\ndoes a really good job in this film as he really plays a few different\ntypes of character in this film and he does a great job in it. The head\ninstructor is also good in the film and he looks like he is having fun\nin his role, the only negative is the woman who plays Murphy's wife\nisn't that great and she doesn't seem to have the acting chops for the\nrole. The story is alright with the corporate background scenes being\ncool and a realistic addition to the film that provided a nice backdrop\nand Murphy's story comes to a good conclusion. However, I thought his\nstory was pretty lacklustre and it didn't show enough Robocop action.\nThe script is alright with Oldman and Keaton's dialogue being good and\nJay Baruchel providing some funny moments but Murphy's lines are so\nbasic and stoic it hurts the film. The style is cool in the film with\nthe futuristic warfare backdrop being cool and also the look of Robocop\nwas really good and helped the character. Overall this film is not as\nterrible as you have heard and it is good.\n"},
{"review": "\nI liked the remake very much and the original.<br><br>The technical point of a human being only a remnant of biological\nmaterial mechanically augmented and the brain itself subject to a\nmechanical survival control that would give the person the conviction\nof believing decisions were made by the human brain and not the weapons\nsystems was a point worthy of the original's unique quality in 1987.\nThe special effects delivery of the self discovery scene is a work of\nsci-fi art to my mind.<br><br>The corporate corruption theme was as socially relevant in the 1980's\nas the use of drones is for human conflict today. We may be faced with\nchoices about human augmentation. So far we have the Oscar Pistorius\n\"blade runner\" trial. His carbon fiber legs are the most globally\nrecognized human augmentation in existence and the legal charges allege\nhis murder of a woman in his home. Not so good.<br><br>The entire point of robotics is human augmentation. The 2014 Robocop is\nan excellent telling in a socially relevant setting of that timeless\nstory of the choice and outcome of the use of force. In Robocop 2014,\nvery much as in The Day the Earth Stood Still 1951, the choice is for\njustice.<br><br>It's faithful to the original and still unique for today. I like it a\nlot.\n"},
{"review": "\nAs a remake or a stand-alone film, RoboCop has the potential to be a\ngreat movie, but unfortunately, it just didn't quite take off for me.\nWhere's all the fun and excitement? The action scenes are pleasant\nenough, but the story, or the characters, are not quite on the same\nlevel. The characters, are two-dimensional at best, and the story is\njust filler. There's not much reason to care about anything that's\ngoing on, or anyone, because these people don't exhibit any\npersonality. Just think what this movie could have been had it gone\ninto \"Terminator\", or even \"Death Wish\" territory. Or maybe if the film\nhad pushed the envelope, at least. Strange to see Jackie Earle Haley\nhere, cause he doesn't look like an actor who is suited for action\nroles.<br><br>** out of ****\n"},
{"review": "\nThis movie gets a 1 for neat fx.<br><br>Subtracted for:<br><br>No character development, with a long boring training to be Robocop.<br><br>No dark humor like the original.<br><br>A lead actor who is white but acts like he is black. I guess it works\nin The Killing. Not as a brain and cardiovascular.<br><br>No bad guy.<br><br>Pg13... it takes itself too seriously. What teenager would enjoy this\ngarbage? I am enjoy more worried that people rated this movie so high\nwith no good reasons.<br><br>The story is horrible. Why would they bother letting him think he is\nstill Alex when they clearly don't want that. Then they take that away\nand for some reason emotions ruin robotics?? What retard wrote this?? <br><br>No neat Robocop voice. No believable emotionless Peter Weller. Did the\nsame guy who wrote the new awful Star Trek movies write the character\ntoo? Spock has emotions, Robocop has emotions... wayyy too much. In\nfact he's a complete whiner.<br><br>They kept his hand? Why? So he could use Michael Jackson's style in\n2028?? <br><br>Nothing ever happens that's really exciting. Its a whole lot of walking\nand riding a motorcycle and being propped up on medical equipment. A\nlot of whining and you never care.<br><br>After awhile of watching the dialogue no longer matters and all you\nwanna see is the action. I personally muted it and added my own.<br><br>The most annoying use of Samuel L Jackson. What a waste!! <br><br>Everyone in the movie complains in almost every scene.<br><br>There is nothing else good about this movie except the fx. That's why\nit bombed and I hope forgotten quickly.\n"},
{"review": "\nTERRIBLE messages in this film.<br><br>For all the ham fisted and very mild mocking of the bias of media-\ncartoony like all TV media has become in real life. Its there only as a\ncopy of the original, not to actually wake anyone up with how\nunsustainable things have become- corrupt politicians selling every\nAmerican out as hard as they possibly can.<br><br>The United States government is working towards Robots on the ground\n(ground drones if you want). And they want them exactly why the movie\nsays- no way to say no to illegal orders. \"Safe and security\" -give up\nall your rights! And killing children is no problem for robots with\ngovernment orders (look at ATF's history- people who just like to\nkill).<br><br>So we are supposed to be comforted that Robocop is able to rewrite his\nown orders (He was a human changed to act like a robot to please\nvoters). And what does Robocop do? He rewrites his own orders, then he\ntortures people, and shoots people who have given up. Clearly the movie\nis saying the humans are the problem, even when you mess with their\nbrains. Sneaky Hollywood- GOOD GUYS don't torture.<br><br>Even the action is crap. Robocop drives straight into 20 guys with the\nright kind of bullets to actually harm him. How do they all miss? He\nhas a minor cut on his shoulder afterwards....whoop dee do.<br><br>This movie is just to get people thinking good thoughts about Robots\nuntil the US government can finally make it happen. Some bomb will go\noff, terrorists will be blamed, and the government will push it all in\nagainst the fat cowardly Americans. Just look, Police robots are making\nit into every futuristic movie. But don't worry, either they are the\ngood guys (Robocop), or they are really weak (like the Matt Damon movie\nrecently, or I, Robot).\n"},
{"review": "\nThis is a completely different film. I have seen it at the cinema. They\ncould have called it 'coprobo' for all I care. However, I went in with\nan open mind even-though the original was one of my fav films as a kid\nand I felt this film did not need a remake. .Its a pointless piece of\nfilth remake and should be flushed with the other loggage.<br><br>The first 15 mins are great and I really thought this was going to be a\nreally good film. I was wrong.<br><br>1. Stop rebooting movies 2. If you're to slack to do that make them\naction packed and, yes, gory and action packed. Leave the whole safe\nfor families Christian coalition crap back home.\n"},
{"review": "\nWhat a cast! Leave it up to Oldman, Haley and Keaton to drive the\nstory, while letting Robocop do his thing. Joel Kinnaman was simply\nbrilliant in The Killing and after watching this movie, I cannot\nimagine any actor more suitable for this role.<br><br>The action sequences are believable and the suit is fantastic. The bike\nis definitely one above what Judge Dredd had to settle for, and while\nDredd was more violent, Robocop is more efficient.<br><br>The story builds on the present-day concerns over the use of drones in\nwarfare and draws the viewer into the possibility of controlled armed\nrobot soldiers being used to prevent loss of human lives. Though\nefficient, these machines would be prone to problems such as shooting\njuveniles.<br><br>The novel method to counter this issue is arrived at by a defense giant\nOmnicorp-Put a man inside the suit. From here the movie is predictable,\nbut the sequences and the acting, gave me every bit of that\nentertainment I could not derive from I Frankenstein.<br><br>It is a great movie. Definitely worth watching on the big screen.\n"},
{"review": "\nI had to add my 2 cents to the mix, this movie sucks. It is so boring I\nstarted playing with my phone within 10 minutes. Why does Hollywood\nkeep putting out this crap. This movie has no suspense, like many\nothers have said, there is no villain, Elmer fudd made a better\nvillain. The plot holes are ridiculous. Why take the better parts of\nthe movie and trash them and replace with boring, no nonsense story\nline. The original had a way better plot and story, this movie is just\nsilly. Part of the story that helped you came about the character was\nhe didn't remember his family, they thought he was dead. Part of the\nplot was Murphy gaining control through out the movie, it moved the\nplot along. The evil corporation is not evil, it's boring. Where is the\ngritty, dirty city that was over run with corruption? Pg13 rating,\nreally, what was the point.\n"},
{"review": "\nDepiction of Iranians in this movie is almost a bias! I just wonder why\ndirectors in the states do the same blunders again and again! Is there\nany conspiracy behind all of these boners to belittle Iranians?! OK,\nyour politicians have problems with ours, why you insult our people in\nyour movies and more than that, why you insult your audiences by\nfooling them to watch these images?! I lived around 30 years in Iran\nand I witnessed that majority of tourists vising Iran just get baffled\nhow Iran and Iranians are totally different than what was in their\nimaginations! What's the role of media in aberration of innocent minds\nwith these amusements? I'm recalling Einstein desperately saying:\nTechnological progress is like an axe in the hands of a pathological\ncriminal. Maniacs in both sides are ruining people's life. Don't make\nit worse than that please!\n"},
{"review": "\nMany already had critics about all the reasons this movie is OK at best\nso I wont ad anything on that part.<br><br>What I'd like to point out is a good example of western arrogance and\ndeep racism. This movie start with a scene where the USA seems to\noccupy Iran... Filming crew are having fun watching machines blow up\nIranian kids... Can you imagine if a country like Iran would make a\nmovie where they occupy the USA and blow up American children's ? <br><br>Then they try to sell the idea that these robots should be used on\nAmericans but they don't want to cause you know they wont let machines\ndecide if its OK to kill children's, its immoral. Yet they sure didn't\nbother about that for Iranian kids...<br><br>I can at least give them a good point for making corporations,\npropaganda medias and those favourable to the use of drones the bad\nguys.\n"},
{"review": "\nHow about to study first and then make a movie. In Iran people don't\ndress like Arabs, Iranian people are Iranian, they are not Arabs, not\nthat there is anything wrong with them but Iranian are different, their\nlives, culture, food and everything is just different. There are no\nsuicide bombers in Iran. We never had one and I hope we never will.How\ncan you make a movie and show a nation like that to people who pay\nmoney to watch your stupid film. I am really sorry! How dare! So many\npeople have the wrong idea about Iran because of film like this.\nStreets of Tehran are nothing like you have shown. It's just\nridiculous. Not watching this trash ever again! You should be ashamed\nof yourself!\n"},
{"review": "\nThere is just no story in there. It's so awful beyond believe. We\nwatched it with a group of friends and most of them left the cinema\nafter one hour. There is just no soul in this movie. It does not grab\nyou like the first one. It's even worse than the remake of The Thing.\nFor some reason all new movies are all about special effects and\nterrible acting. The stolen oneliners from the first Robocop do not\neven make sense. How in the world could this be released? How long will\nthis go on...all remakes are terrible just terrible. But this movie is\nby far the worst I have ever seen in my life. Even my kid thought it\nwas utterly boring!!!!! I'm off .... I hope I can forget this extremely\ndull movie. It like a cheap episode of some kind of low budget series\non TV. Terrible really really really terrible\n"},
{"review": "\nFirstly, the film has a great cast and good performances. Not a\nterrible film in technical or performance terms, but certainly another\npointless remake/reboot/re-imagining of a classic franchise. What is\nthe point of doing this? I know it's for money and just in hopes that\npeople recognize the name, but this movie may as well have NOT been\nabout the Robocop we know.<br><br>But even without comparing it to the original...WHERE IS THE HEART or\nSUBSTANCE in this movie? Name it. It's nothing different than the other\n100 drama/action/comedy films that have some basic evil vs. bad story.\nNothing original.<br><br>Anyways: It is The same old by-the-numbers cliché garbage. Laughable\nscript and unoriginal but worst of all: Just boring.<br><br>How many times are we going to see the same plot devices and laughable\ncliché characters in a movie? And even preaching to us, how about\ngiving us something to actually think about or discuss. <br><br>Hollywood has only one move these days: Making 1-dimensional characters\n(innocent good guy, evil for no reason bad guy)-- Wash, rinse, repeat.\n"},
{"review": "\nAs an Iranian, I watched the opening part of the movie over and over,\nI'm really confused here. If the movie tries to criticize the\nmisleading role of the media, then why does it contribute to creation\nof the false media- forged impression of Iranian people, being\nextremely religious, uncivilized, poor and so on... Do they really not\nknow my people? Or, do they intentionally want to show them like that?\nDon't they really know that Iranian people don't wear Arabic clothes\nand hats like what we see in this movie? Don't they know Iranian people\nhave never committed a single suicide bombing in the world's history?\nI'm wondering what the point is in degenerating my culture and how most\nof the movies benefit from this?\n"},
{"review": "\nOne wonders why Hollywood thinks bland will sell. The Verhoeven version\nwas far far better. You might as well have had Uwe Boll direct this\nmovie as soon as you decided to cripple it with a PG rating and other\nterrible compromises. There were some reasonable action sequences but\non the whole it just didn't flow. It wasn't edgy and therefore will be\nforgettable. There are a million great unused ideas out there, yet\nHollywood seems to be fascinated with trotting out the violated corpses\nof achievements past because they are just to frightened these days to\nhave an original thought. Strangely, despite \"playing it safe\" the\nnumber of movies that flop seems to be on the rise.\n"},
{"review": "\nTo me, heck it's my review and my piece of #### anyway... kinda\nsucks... since I am from the old school Robocop, watched and loves them\nsince I'm a kid... Watching this reboot is like \"WTH? are they just run\noutta ideas? Why couldn't they just do Robocop 5?\" With all those tech\nlevel upgraded, I can't why it isn't better to do so. A reboot, with\nthe same lousy story almost 3 decades ago (yeap, i call it lousy coz\nit's nothing new) doesn't add any interesting factor except for Murphy\ngoes transformer...<br><br>The movie itself, is good. But if u have watched robocop original, you\nwill feel this is a waste... just like TMNT...\n"},
{"review": "\nDamn good movie cant understand how viewers give 1 star and beat it up?\nDon't listen to them I watched Robo 10+ times and the remake follows\ntrue to the original story. A remake isn't supposed to be a exact\nREMAKE where is the fun in that! In some ways its better than original.\nI feel this version is more dark and mysterious than its predecessor.\nActing and effects are great Joel Kinnaman plays the part so good. His\nversion of Murphy is smarter and more emotional than original Murphy.\nAlso, how can you go wrong with cast including Gary Oldman, Michael\nKeaton and Samuel Jackson. I've seen new version couple times and plan\non watching many more. Give it a chance your next Sci-Fi Saturday night\nmovie.\n"},
{"review": "\nSaw the film in theaters and absolutely loved it great cast Michael\nKeaton, Gary Oldman, Samuel Jackson. And a new story and not a boring\npiece by piece Reboot this new version of Robocop shows a more human\nside on the character and a great performance by Joel Kinnaman the only\nthing that i didn't like was the PG-13 rating and some of the\ncharacters were too comical (Jay Baruchel). At the end guys Robocop\n(2014) is an amazing reboot that focuses more on Murphy trying to find\nhis humanity back instead of killing guys and blowing them up i really\nhope they make a sequel to this film with the same cast. A 10 out of 10\nan amazing film!!\n"},
{"review": "\nFirst, let me explain that I loved the original version which was\nadvanced and ahead of its time. I can't watch this recent movie without\ncomparing it to the original. The original movie is a Cult classic and\nshould have been left alone in my humble opinion. In this Robocop\nUniverse I got the feeling that Robocop wasn't needed as it was for\ninstance in the original movies. In the original version the cops are\nout maned, out gunned and overburdened with bureaucracy and legal tape\nto fight crime. In this I agree the special effects are awesome but the\nplot in lacking something substantial in the script. The were so many\nwasted opportunities in this movie and the right actors were playing\nthe wrong parts. I think they concentrated too much on the special\neffects that they forgot about telling us a good story .\n"},
{"review": "\nI know some people say don't compare to the original but this is a\nREMAKE so you have to compare to the Original. The original was tongue\nin cheek, violent, funny, a parody on politics. The new movie just\nfailed on all those things. Cliché'd and characters didn't generate\nanything. Why movie makers agree to these poor remakes is beyond me.\nWatch this if you want to but suggest you do so before the original.\nOriginal is a far superior movie. Like Total Recall remake, again\ntotally missed the tongue in cheek humour that made these such great\nfilms in the first place. And apparently I have to add another line to\nmeet requirements for review !\n"},
{"review": "\nWhen I first heard RED's cover version of \"Ordinary World\" or Seether's\ncover version of \"Careless Whispers\", I was convinced it actually is\npossible to take someone's piece of artwork and make it better than the\noriginal. Nevertheless, I had absolutely no intentions to see the\nremakes of Godzilla or RoboCop. I personally thought the originals were\njust fine. But I guess therein, my friend, lies the problem.<br><br>\"Just fine\" isn't good enough. Still haven't seen the new Godzilla\nthough, but what did I think of the new RoboCop? Can't fault it. Not at\nall - I'd be lying. The whole team was really on top of things: from\nthe set designs, story lines, cinematography, direction, everything!\nEvery bit of it was well thought out and beautifully executed. This is\ndefinitely one I'll be seeing more times than one should see any given\nmovie, and I'll definitely be studying it very closely.<br><br>But even with that being said, I really hope there isn't a sequel\nwaiting to peer over the horizon. I could be wrong but I think MGM and\nColumbia Pictures would be shooting themselves in the foot. This one\nneeds no sequel, no box set, no trilogy.<br><br>Sigh... Boy, was that a beautiful movie!\n"},
{"review": "\nWhen it came out in 1987, RoboCop was quite an event... I watched the\noriginal series and liked it a lot, except for the fact that it\ncontained unnecessary graphic violence, and it was somehow dark... Then\ncame the new remake of RoboCop (2014), and I didn't watch it in the\nmovies because it originally had somehow low reviews... But then I got\nit on Blu-ray and watched it... Amazingly, this movie was so good I\nwondered whether in our days a movie has to be R-rated for violence to\ntake high ratings... as far as I'm concerned, this film was able to\nconvey the whole idea and action without much blood-splattering and\nlimb-cutting... I was comfortable and yet thrilled while watching it...\nI was even able to relate to the present Alex Murphy turned\nhalf-machine than the past one... The story line is quite good also,\nand I'm not discussing any details here. I just wanted to relate my\nexperience in watching the new RoboCop, and I hope we're going to see a\nsequel related to this series. Yes, this film was quite underrated as\nfar as I'm concerned.\n"},
{"review": "\nThis Robocop stands out on it's own with a great story that differs\nfrom the original, great action and very strong performances from the\ncast made this film very enjoyable. Not to mention the technological\nadvancements that made this version a much better visual treat. It's\nnot just a shoot em up action flick but also an emotional film that\nshows much more of Robocop's family than we ever knew before. Gary\nOldman was fantastic and Joel Kinnaman held his own as the half man\nhalf machine Robocop. While it may seem to start off a little slow the\nsecond half of the movie rocks and the last 20 minutes is an adrenaline\nrush with terrific action. Overall I was pleasantly surprised and look\nforward to another installment of this version of Robocop.\n"},
{"review": "\nAlright. No one wanted a remake of the 1987 original, but you know\nwhat? It happened and it wasn't a total disaster. In my opinion, it\nmade some improvement over the original. Gory , R-Rating? Non- existent\nin the 2014 remake. The Verhoeven signature violence isn't what always\nmakes a good movie.<br><br>I liked the 1987 Robocop. But after watching it a couple of times. It's\nreally just an action movie with little bits of political/social satire\nas well as some character development of Alex Murphy. In the 2014\nremake, the screenwriter clearly wanted to explore the idea of putting\na man in a machine. If you paid attention to the dialogue between the\nscientists and executives of OmniCorp, they were talking about some\nimportant stuff about human consciousness and the difference between a\nhuman and a robot. There's also satire in the movie as well. We get a\nfew scenes of Samuel L. Jackson playing the host of a talk show called\nThe Novak Element which seems to have a Pro-Robot bias, favoring the\nOmniCorp CEO than the anti-machine politicians. The political satire\nvexed into the script made me think about now. How Americans are\nagainst the use of drones and surveillance technology in our home but\nare okay when used abroad to look for terrorist. It does raise\nquestions on using advanced technology to stop crime. The remake\ndefinitely made Robocop a little more relevant today.<br><br>Robocop 2014 is not a perfect film though. There are a couple of\ndownsides. I felt that there were not a lot of scenes of the bad guy\nthat almost killed Murphy. We don't know too much about him but he was\npart of a conspiracy. I also thought they should have developed the\ncharacter of Alex Murphy a little more.<br><br>So let me get this straight. We don't want remakes of old films that\nwere considered good. But hey, this one did it's best. Robocop 2014 is\nmuch better than the Total Recall 2012 remake.\n"},
{"review": "\nFirst up, I have to admit, although this is a Remake of a very well\nknown 80s movie (one I like very much), I was still somewhat excited to\nwatch this. And it all came down to the director. If you haven't seen\nhis \"Tropa de Elite\" movies (both of them, in the right order, because\nthey do build up), then please do so.<br><br>Now after watching it, I wasn't too sure. I was hoping to see something\ndifferent I think. But the more I thought about the movie and even\nthough he had to make it a PG-13 movie (still hoping there will be an\nextended cut), the themes are there. It's not a Jesus analogy anymore,\nbut the movie does acknowledge the Paul Verhoeven classic. We still get\nmore than a few new notions. Samuell L. Jacksons \"news\" reporter being\none of them. The biggest propaganda since ... well another \"news\"\nchannel in America that tells us it is fair and balanced (even if\nwasn't meant as a direct assault on that station, it's easy to make\nthat comparison, because it's true).<br><br>You also get Michael Keaton in superb form, having as much fun as he\ncan. Gary Oldman gives his best too, though I guess some will have some\nissues with the main actor. It would be unfair to do so, but you could\nsee their point. Whatever the case, this is not a waste of time, even\nif you know the original. Though I doubt you will find it better if you\ndo know it\n"},
{"review": "\nI watched \"JFK\", \"A Christmas Carol\", \"Air Force One\", \"Quest for\nCamelot\", and \"Planet 51\" on the movies. It was brilliant. He's the\ngood man. I told Cameron Diaz to get Macaulay Culkin with it. In fact,\nI can help him to become the voice actor. Don't worry, everything's\ngoing to be just fine. I have the Disney character for Gary Oldman.\nIt's a story for the Disney movie. It's a story about the dog named\nPluto, Mickey Mouse's faithful dog. I hope it will be ready for some of\nthose scripts to be writing for some years. Gary Oldman is the\nbrilliant actor. I hope he'll be ready for Pluto movie. Just imagine,\nwhenever he worked in the Disney studios. I guess I have work to do.\nJust a simple things. I've got to go now. See you real soon.\n"},
{"review": "\nNow I've never seen the first original Robocop but by golly was it on\nmy 'to watch' list. The raving about the original made me watch this\nrevamp when it came out on Netflix in the same year of release.<br><br>I found this film to be a high budget movie with a script that doesn't\nreally have as much depth as I'm sure the original has. As a newbie, I\nwas somewhat confused why the doctor acted by Gary Oldman was so\nsympathetic, why they had to choose a 'disabled person' to enter the\nrobot and the reasoning behind the anger portrayed toward the end of\nthe film for Robocop. Yes, I understand there was some sort of dark\nbehind the books work by the cops to get the character to be Robocop,\nbut this storyline just falls a bit flat for me. <br><br>Overall, I was left somewhat confused by this film. The storyline was\ntoo much on a whim and didn't offer the depth I'd expect from such a\nbig name. Entertaining none the less, the big budget Robocop gets a 7\nfrom me.\n"},
{"review": "\nRobocop?!?! What the hell did that have to do with the original?\nRobocop is my favourite film in my top ten of all time. The remake had\nnothing to do with it at all, it was sleek aimed at kids like the\ndisgraceful Robocop3. The first was a brilliant take on the ferocious\ngreed of the 80s satirical shocking and brutally honest. Violent to the\npoint of making me sick and I was shocked at the way they killed Alex\nMurphy taking off his hand and enjoying it, and laughing. That's the\nbit that stuck with me. The new one is a polished repackaged don't open\nthe packet toy, compared to the battered millennium falcon you played\nwith as a child. (Yeah some of us girls liked star wars too). Favourite\nis NOT a spelling mistake it's the English way of spelling it.\n"},
{"review": "\nThis is one of the best movies that I have seen in years... This is\nabout a cop who is almost killed when someone plants a bomb on his\ncar.. His wife is forced (My opinion) to put him into a operation that\nturns him into a robot that can stop crime... The only problem is that\nthe human emotion get in the way of creators plans...<br><br>All roles are top notch and effects are outstanding.... The story\nitself could have been ripped from the headlines... The new look for\nRobocop is really cool as it looks futuristic.. This film has a lot of\naction and outstanding scenes where he opens fire at will to those that\ndo harm... You do not need to be funny to make a great movie...<br><br>It was good to see Michael Keaton back in the screen again... Same\nthing cam be said for Jackie Haley.. Most people know Michael from Mr\nMom and Jackie from Bad News Bears In Breaking Training... it is good\nseeing these 2 really showing what they can do outside of their known\nclassics..<br><br>Samuel L Jackson is perfect for the role as the host of that news\nshow.. He puts it all on the line in every role he takes on... I hope\nthat another Robocop movie is in the works soon... Iron Man was sent to\nthe pee wee leagues as far as I am concerned.. This film pulls no\npunches when it comes to tragedy, greed, and family...\n"},
{"review": "\nOK giving it a 10 is pushing it, but i cant understand why people are\nhating this movie just because it is not similar to the 1987 RoboCop.<br><br>it wasn't violent enough, it was a lot of CGI, his suit is lighter and\nBLACK, the lack of a proper villain, ED-209 being a useless piece of\nequipment etc etc. well i do agree with the last point but other than\nthat there is nothing wrong with the movie. The lack of a proper\nvillain is blurs the line between good and evil and it adds to the\nalready confused persona of RoboCop, CGI was decent and didn't look\nextremely far fetched which is again not a bad thing. As for the movie\nnot being violent enough, i guess i was expecting more from a Jose\nPadilha but it isn't as bad.<br><br>its a decent action flick deserving a 6.5 - 7 My 10 rating is just a\nresult of all unreasonable 1's and 2's in the reviews\n"},
{"review": "\nMost people who trash this movie hate it for the following reasons <br><br>1. Franchise fan boys Very Upset things are not done their way.<br><br>2. Not enough blood spilled. Angry children crying in protest.<br><br>3. How dare Weller criticizes Unmanned War Machines. Might makes right.\nSuck it up.<br><br>4. Joel Kinnaman is simply too hot to handle. Beta boys cannot take it.<br><br>But most people I know enjoyed this movie because <br><br>1. We are not fan boys or girls. We just want to watch a good movie.<br><br>2. No angry-vampire-feeding with excessive blood spilling. Just pure\nadrenaline-pumping action and rush.<br><br>3. Sane people understand the urgency of facing up to the Unmanned War\nMachines Situation we've been trained to avoid.<br><br>4. Joel Kinnaman is hot alright, but also one emotionally DEEP actor.<br><br>10 out of 10 for entertainment value, and public education value.\n"},
{"review": "\nThis is by far the best of the franchise by a long shot. Joel Kinnaman\nis an amazing actor and brings such emotion to the role of this film.\nThis should really be the beginning of this franchise. the first movie\nwas a cult classic and had all the humor, and great action for the time\nit was released , but there is no comparison to what the new release\nbrings to the table. Robocop the original set a bar for being the most\nviolent and shocking movie of that time. this new start is so much\nmore. There is real human emotion involved and the action is still\nthere in spades. No need for the shock value of the first. this one has\nit all. This guy is perfect for the role and i hope they continue the\nfranchise from here with some good writing. I will buy every one.\nHaters gonna hate,but they are WRONG on this one. Simon\n"},
{"review": "\nI just watched the first scenes of the movie which took place in Tehran\nand realized how careless the director was about Tehran streets,\nIranians Persian speaking and appearance and etc. At least he could do\nsome research or ask an expert about these things to make it more real.\nI realized that they just made something to sell out ticket. And when\nthe movie ended I became sure that it was not worth watching. Did not\nlike it at all! Just liked the special effects ,the colors and lights.\nAnd also I liked Garry Oldman, but this movie, phew, pity! I hope I\ncould see better movies of him. Personally I prefer the old version of\nthis movie.\n"},
{"review": "\nI was sceptical about going to see this film. There are far too many\nremakes and majority of the time they are dreadful (Total Recall for\none). Actually I was quite impressed with this film. OK it is a bit\nslow at the beginning but after about 30 minutes it takes off and\ndoesn't stop. Their is plenty of decent action and the story isn't too\nbad neither.<br><br>Samuel L Jackson is fantastic. Although he doesn't have much screen\ntime, he certainly steals the show. Gary Oldman is also brilliant and\nMichael Keaton is pretty good. Joel Kinnerman who plays Murphy/ Robocop\nisn't nothing special (anybody could have played that part. (Weller was\nthe best at playing Robocop end off!(<br><br>OK so it's not as good as the original. However if this wasn't a remake\nit would be a very good film.\n"},
{"review": "\nI was part of the generation who remembers those 80s movies that are\nbecoming re-made, re-fashioned, and re-booted. There was no need to\nremake Evil Dead, Nightmare on Elm Street, or Friday The !3th. So, I\nwas skeptical and had my mind made up to skip this movie because the\noriginal is already a good movie. I'm glad I didn't skip this one\nbecause it does something rare you don't really see in movies, it\nactually entertains and keeps your attention. The story is the same, a\ncop is shot and left for dead, then rebuilt into a cyborg law man. I\nfound this to actually stand on it's own two feet with some clever\nspecial effects and action. Joe Kinnaman makes Robocop human and his\nperformance is compatible to Peter Weller. In my opinion, had there not\nbeen an original film made in 1987, this movie would be okay on it's\nown. There are some pokes at today's politicians, American credit, and\nconsumerism too. This was a fun ride of a movie and before you judge a\nbook by it's cover, you might be surprised at your self for liking this\none.\n"},
{"review": "\nNot going to lie, when I saw the first teaser I wanted to hate this\nmovie. The original is just such a classic. One of the few movies from\nthe 80's I can still watch and genuinely enjoy without relying on\nnostalgia.That said, I really enjoyed this remake. While I love\neverything about the first one; the effects, the one liners, the\nviolence,and the campiness, I didn't find myself comparing the new one\nto the old one when I watched it. <br><br>In my opinion, the new additions to the story really help make it more\nof a complete story, one based closer to our current reality than the\noriginal movie was. Nothing felt forced and there was a much better\nexplanation for why everything was happening and certain key players\nmotivations.<br><br>It's definitely not the fun campy movie it once was, but it throws out\na few fun nods to the classic. I found this movie to have more heart,\nand for a man to truly control his robot side I think still having a\nsoul defines his humanity.<br><br>The action was top notch. Most of the CGI looked very natural, and the\nfight scenes were intense. I really liked what they did with his suit\nthis time around. I know on these boards a lot of people have said they\nmissed how Robocop moved in the original, saying it seemed more\nrobotic, I would say they have very outdated ideas of how robots\nfunction these days. I personally work for an engineering company that\nspecializes in motion control systems, and have taken Uni level\nrobotics courses. In my opinion they did a fantastic job with making\nRobocop walk and function like a modern day robot/machine. There was a\ncertain mechanical fluidity that just looked right.<br><br>I wouldn't go in expecting the old Robocop, but I found this new\nRobocop to be one the most enjoyable action movies I've seen in a\nwhile. I look forward to a possible sequel.\n"},
{"review": "\n1)In the 1987 flick, only Clarence the bad guy knew the first thing\nabout Detroit (he never missed a Tigers' game). In the new and improved\nROBOCOP, title character Alex Murphy and his son David are fervent Red\nWings fans (like most \"Hockey Town\" residents). 2)The remake has many\nexteriors shot in Detroit, USA. The original Dutch director shot 99.9%\nof his flick in foreign lands. To paraphrase Psalms, \"a minute in\nMichigan is worth two hours in Canada.\" 3)Murphy's chick partner from\n1987 \"didn't know Jack\" about saving Alex, the way his current partner\nJack has his back now. 4)Murphy's wife \"moves on\" to new guys ASAP in\ndirector Paul Verhoeven's outing; she's loyal no matter what may come\nin director Jose Padilha's improved offering. 5)This ROBOCOP has a\nnifty ROBOBIKE. 6)This ROBOCOP can FLY when he needs to. 7)This ROBOCOP\nhas more outfits. 8)Samuel L. Jackson goes from SNAKES ON A PLANE to\nsnakes in his brain here, which is very entertaining to watch. 9)Though\nMichigan's current governor, famous for being \"Omni Corp.'s Nerd in\nLansing,\" pushed Padilha to Toronto's bigger tax break, Padilha\nplasters the 2014 film with Red Wing decals and Michigan state flags.\n10)The new ROBOCOP has far more heroes, particularly feisty scientist\nDennett Norton (Gary Oldman).\n"},
{"review": "\nI loved the original and I also loved this one too. The visuals are\ncompletely stunning and I think it is an excellent re-imagining of the\nstory. It brings loads of new ideas and gives a welcome fresh lease of\nlife adding new dimensions to an already brilliant character... Michael\nKeaton, Abbie Cornish, Gary Oldman, Michael K. Williams and Jackie\nEarle Hayley are all fantastic in this movie.. Nice to see Michael\nKeaton again! The cinematography is truly beautiful and some of the new\nscenes of Robo travelling are are so brilliantly shot they are so\npleasing to watch. A massive well done and big congratulations to all\nthat were involved in the production of this movie! Peter Weller's Robo\nis and will always be superb but Joel Kinnaman did an amazing job too!\nI really hope it does well enough so that there can be some sequels : )\n"},
{"review": "\nThe film is much better than the trailer makes you expect. The story\nreally is well made and realistic. The film shows the problem that\ncompanies (like now Google)can become very powerful and develop a\ndanger to the democratic system. The reason is the financial interest\nof such companies: They have no human/emotional interest. Thats why\npeople should always remember not to believe everything which is\nadvertised and shouldn't give them to much power/control. On the other\nside I like the fact, that robots aren't the leaders in this movie.\nPeople in America still prioritize real humans for important jobs\n(police,...). Of course its kinda boring that this movie is a typical\nAmerican movie. Why wasn't it made in Russia or Europe?<br><br>At first the film seems to be a very basic and simple super hero thing,\nbut then you realize its content ;)\n"},
{"review": "\nRobocop original was a satire against the dangers of private\nenterprise. It was not an attack against the use of drones or\nautomation. Rather, it was an attack on the misuse of private\nenterprise in place of government services.<br><br>This movie does a great injustice to the original in its message. In\naddition, this version is devoid of humor and satire which made the\noriginal much more fun.<br><br>The only improvement over the original was the special effects and some\nof the fight scenes. Did I go into Robocop expecting a different\nresult? No, but I thought at least it would have had more humor.\n"},
{"review": "\nHaving not seen the original 80's version, I can't say the 2014 remake\nis better or worse than it's predecessor. However I will say that the\nnew film brings an interesting and emotional take on a concept, that in\nthe 80's would have been pure science fiction. Yet in 2014, is\ncertainly a possibility with advancements in prosthesis and the ever\nincreasing impact from drones in today's military. At the very least I\nfound myself questioning whether or not I would feel more safe or\nthreatened by a RoboCop patrolling the streets. <br><br>As for the film Itself I found it very slow for the first 45 minutes\nwith very little action aside from training simulations. The film did\ncertainly pick up the pace in the second half of the film, with RoboCop\nquickly racking up arrests. Yet still I was left wanting more\nexcitement with a adversary who could challenge RoboCop. Spoilers, My\nhopes were then answered in the final half hour of the film during the\ninfiltration of OmniCorp in which our protagonist goes toe to toes with\nmultiple militarised drones and seemed to be in genuine danger as he\nfought his way to the rooftop. <br><br>All in all I felt despite the slow start and lack of worthy opponents,\nRoboCop was a well balances film, not only between man and machine but\nalso with the tone of the film. With well timed comedic scenes from\nSamuel L. Jackson and a genuinely moving performance by Gary Oldman.\nThis film also managed to leave me thinking and discussing about the\nconcept for over an hour after seeing it, which is not a common\noccurrence.If only for this reason, I would certainly recommend people\nto this film.\n"},
{"review": "\nI am always wary of remakes of classic films but at the same time try\nand keep a clear mind in that just one day they might get it right.<br><br>I question if this is actually remake of Robocop or a new film with\nRobocop as our lead. Are there comparisons, well there is Murphy\n(Robocop) , Lewis (now male) and the bad guy. The role of the owner of\nthe business is much different to that of the original.<br><br>The storyline is excellent and the transformation of Murphy to Robocop\nis explored much more deeply than in the original, however (and this is\nnot a spoiler) you can guess which bit will be included in the\nconclusion. The emotional transformations are excellent as Robocop\nevolves . The scenes where the action kick in have kept the violence\nlevels down compared to the original , which still has one of the best\nscenes ever with our melting man, but I still think this film has been\nlucky to achieve a 12a . <br><br>A good watch , is it better than the original said my 12 year old ?\nGenuinely I don't know , the original is great as it set the benchmark,\nthis new version has more modern special effects and the telling of the\nstory is better. <br><br>Whatever watch this.\n"},
{"review": "\nDisappointed. The same feeling that made ​​me feel Great Gatsby , and\nEnder's game , produced me Robocop . It's amazing, to see how producers\nflushed down the toilet millions. There are hundreds of young\nfilmmakers who would like to obtain a fraction of the budgets of these\nmovies for a chance to make a film work and not get support.<br><br>While the film remained at the level of the police that Murphy was\nmissing an eye , part of an arm and a leg after the explosion , the\nfilm maintained an acceptable level of tolerance. But then, they jumped\nto a scene where Murphy presented where what little remains of his face\nand a hand, miraculously preserved without the body. Since then the\nscript seemed to be written by someone else.<br><br>Robocop is the kind of movie that can wait patiently until it comes out\non DVD and rent it if there is nothing better in the Red Box .\nExcepting for a few action scenes the movie does not return the money\nto the viewer. I do not recommend spending money to see it in film,\nwait for it on a rental. I gave 4 stars out of 10, because some of the\neffects.\n"},
{"review": "\nAs a kid of the 80's I grew up with the awesome movie that was Robocop.\nPart man, part machine and all police officer. I still remember that\nharrowing scene where Alex Murphy gets decimated by criminals leading\nup to him becoming Robocop. That movie was grittier with a bleak look\ninto out future.<br><br>Cue Robocop 2014 and as every minute of the movie ticked by I wished it\nwould get better or just end. Make no mistake, there was no expense\nspared on its A-list cast and huge budget for CGI and action shots\nhowever, the heart of the story was totally out of whack<br><br>For the first bit of the movie you get a sense they were trying to\nrelay a message to the audience about violence which I didn't get. Then\nthey spend an eternity trying to make you bond emotionally with Alex\nMurphy and his family but it takes too long and you loose interest.<br><br>Whether is a remake or a reboot it falls way short of what it should\nhave been. Throughout the entire movie I was constantly saying to\nmyself \"That's wrong\", \"Why they do it like that\", \"That doesn't make\nsense\".<br><br>I left the cinema wishing I hadn't seen this movie. But then that's\njust my opinion\n"},
{"review": "\nI really wanted to like RoboCop (2014), but maybe I was unfairly\ncomparing it to the original which was entertaining, prescient and\ninsightful. I know this reboot wanted to do things differently, and\nfair enough, but for instance RoboCop still keeping in contact with his\nwife and son (unlike the original) somehow took away the poignancy of\nMurphy.<br><br>Maybe the reboot will appeal to people who haven't seen the original,\nand that's fine, that's okay. But the reboot seemed to be by the\nnumbers, and it would have been better off as a TV mini-series or\nsomething like that.\n"},
{"review": "\nYou see a lot of people telling you \"don't compare this with the\noriginal\" There's a reason for that. Robocop 2014 is not the same\nmovie. The specifically effects are better, there is a little more\naction, and RoboCop has an upgrade.<br><br>But then in exchange for those attributes, they stripped away the\nsatire...Hollywood is convinced that \"Millennials don't understand\nsatire,\" and they are right. Seriously, give them a copy of The Onion,\nthey just don't understand it...<br><br>So the satire that made it so popular is gone.<br><br>And with the satire went all social commentary. Everything insightful\nis gone. RoboCop 2014 really is not void of, well, anything.<br><br>And mind you, this was made in 2014, in the era where the Libertarians,\nthe TEA Party, and even your run-of-the-mill Republicans are screaming\nthat everything needs to be privatized. The door is wide-open given the\nplot of the original...and 2014 to have really nothing to say about\nthat.<br><br>this is also in an era where we have self-driving cars, where we have\nrobots working fast-food, where we are seriously looking at a future\nwith self-driving semi-trucks. We are technologically advancing\nmillions of people out of their jobs, we are handing entire careers\nover to robots and computers...and again, despite the abundantly clear\nlink 2014 has weigh in one that...near silence.<br><br>It seems they sat down and made a movie that had as little to say as\nhumanly possible to the point where they even ignored even what the\nsource material had to say.<br><br>Have you ever cracked open a peanut shell only to find there was\nnothing inside it but air? That's RoboCop 2014\n"},
{"review": "\nJesse film é mute lox, Os antis er-am Malory's , Jesse lox nun ca diva\nTe Sid cried peal humanized aliening Trieste aquatic DA Finland e\nKnuckes malts carbides Queen ten ham cried Jesse film,Nam Sui pique\ncompered,Os antis Robocop DOA DE 1000/1000 Jesse film lox do Brillo,\ncom TNT rival hue vol Vera um Speer sayings fazed Kamehameha's no sue\nRoku pique emu sou spaceman's fazed a gecko dame VA VA concentrated VA\npique emu vol collocate pickle em voice SE voice Lea ate AK é pique\nvoice nap Sabre ques SE voice Sabre ques voice SE NASA pixie em emu\npiecing dead pool é Dora vegan com meta Algeria Na USA com mat adores\nhit-man do Sue la-do TV's Dora pg Essie text é mute concentrate em\nMedea Tessie film ques me Dix mute com Reva Na Estrada do Superman as 8\ncom o film do Pele e do Jo so ares USA piranha\n"},
{"review": "\nOne of my all time favorites. It showcases a future technology that may\nbe possible. A perfect blend of AI and humans; help through medical\nscience. And that will result in better security than present day. Life\nwill be much better for security personals. It also, showcases how a\nhuman brain supersedes AI, if case be.<br><br>Robocop solving his own case will be a turning point. Enjoyed the scene\nwhere he recreates his own accident. And yes he solves his own case\nsystematically, unveiling the defects in the system. <br><br>There should a sequel showcasing his current capabilities and additions\nshall be must.<br><br>Graphics is good. Enjoy the movie. :)\n"},
{"review": "\nI've never seen any of the previous movies or TV series and known the\nbare essentials about the character, but I did enjoy this movie.<br><br>I've seen Joel Kinnaman in The Killing and his character annoyed the\nabsolute crap out of me, so much that it was part of the reason I\nstopped watching the show, but I thought he was really good for the\nrole both with and without his face covered. <br><br>I really liked the futuristic look of 2028 mainly because it's a future\nthat you could see happening rather than the writers trying to over-do\nit by shoving the fact that it's the future in your face in every\nscene.<br><br>It has an amazing cast, awesome fx and a really good story. <br><br>Worth a watch, maybe even more than once and would probably be\nsomething I would buy on day one.\n"},
{"review": "\nI had low expectations for this reboot, however I was pleasantly\nsurprised. It has a strong cast full of talent. Michael Keaton, Gary\nOldman, Jackie Earle Haley and Michael Kenneth Williams all have good\nto great moments in the film. The action is entertaining and the plot\nis easy to follow. The major hole in this movie is Robocop's back\nstory. The movie is about a man that is being stripped of his emotion,\nyet the director does little to establish why he is connected to his\nfamily. Overall it is a good rainy day watch. I would watch a sequel if\nit came out. I do not agree with the harsh reviews I read on this site.\nTrue it does not have the grit and noir feel of the original, however\nit is no worse than Robocop's III.\n"},
{"review": "\nI had low expectations for this reboot, however I was pleasantly\nsurprised. It has a strong cast full of talent. Michael Keaton, Gary\nOldman, Jackie Earle Haley and Michael Kenneth Williams all have good\nto great moments in the film. The action is entertaining and the plot\nis easy to follow. The major hole in this movie is Robocop's back\nstory. The movie is about a man that is being stripped of his emotion,\nyet the director does little to establish why he is connected to his\nfamily. Overall it is a good rainy day watch. I would watch a sequel if\nit came out. I do not agree with the harsh reviews I read on this site.\nTrue it does not have the grit and noir feel of the original, however\nit is no worse than Robocop's III.\n"},
{"review": "\nI really enjoyed this movie. The plot had some holes, but overall\nexperience was realistic, intense and full of action. You can feel the\nemotion, and also compassion with RoboCop.<br><br>Unlike other RoboCop movies, this movie has great performances. Keaton\nportrayed the heart of a crook politician that is ready to deceive and\nbury you just to achieve his goals.<br><br>Oldman is great as a scientist, and \"Pat\" is totally crazy and scary if\nyou go deeper with the analysis what he is trying to say.<br><br>There is no bullshit with kids using guns and rifles, no girls hacking\nrobots, no cheesy dialog lines - this is the most realistic RoboCop\nmovie. It's like you can imagine that this scenario may really happen\nin the future.<br><br>This is really refreshing for me, and I enjoyed this movie a lot, every\nsingle second of it.<br><br>Way to go! 10/10 from me! Thank you for this gem!\n"},
{"review": "\nThe trailers for this movie made it look like a generic reboot to a\nbeloved action movie. So I avoided RoboCop 2014 for a long time,\nmissing it's theatrical release. I finally got to see it on Netflix and\nI gotta say, not only did I prefer it to the original, but it's one of\nthe most pleasant surprises Hollywood's given me in years.<br><br>This movie isn't a pointless remake as I was lead to believe. It's an\nupdate done right. Instead of focusing on redoing the story of the\noriginal with updated special effects the new RoboCop goes deeper into\nthe psyche of a man who's essentially had most of his body replaced by\nmachinery. It makes you question what makes a man human. Is there a\nsoul in the machine? <br><br>POTENTIAL SPOILERS<br><br>And the answer comes in the form of Murphy's family, whether he can\nbreak free of his corporately controlled body and use his human mind to\nsave those dear to him. <br><br>It also brings up important political issues concerning robots in the\nmiddle east (a metaphor for the U.S. drone striking that part of the\nworld), and your usual anti-corporate slant that's so prevalent in the\ncyberpunk sub genre of science fiction.<br><br>The amount of action feels just right. The cgi isn't overdone. Overall\nit isn't a full on action movie like the original, it's a true science\nfiction movie that explores themes relevant to our times. It goes above\nand beyond the common blockbuster. And for that it deserves some\nattention for what it's accomplished. I'd like to see more science\nfiction in modern cinema since the future is looking more and more like\nscience fiction with each passing day but for now this is a good start.\n"},
{"review": "\nYesterday,I watched RoboCop.RoboCop is an action film directed by José\nPadilha.The film stars Joel Kinnaman(Charles Joel Nordström) in the\ntitle role ,with Gary Oldman ,Michael Keaton ,Abbie Cornish ,Samuel L.\nJackson ,Jackie Haley ,Patrick Garrow ,Michael K. Williams and John\nRuttan in supporting roles.<br><br>The story is about future of America.Raymon Sellars(Michael Keaton) is\nAmerican entrepreneur,he is owner of the robot company.Led by CEO\nRaymond Sellars, the company moves to market , but the passage of the\nDreyfus Act, forbidding deployment of drones on U.S. soil, prevents\nthis.Sellars asks Dr. Dennett Norton(Gary Oldman) and his research team\nto create an alternative.They decided to make a RoboCop(man-robot).A\nDetroit police detective, Alex Murphy, is chosen for the job after he\nis critically injured in a car bomb explosion arranged by crime boss\nAntoine Vallon.<br><br>The character of James Murphy(RoboCop) is really interesting because we\nhave different types of him.At the start we have him as policeman with\nfamily and they were living happy life and then he became a\nrobot(because of explosion) ,that was shocking for his family,but his\nwife and son accepted him as robot(that was only way to keep him\nalive).<br><br>In my opinion the film is gripping and moving in some parts.The special\neffects are spectacular,but the best thing about film is story.The\nacting is good, but not as good as story.I reckon the film is\nsuccessful.I recommend the film for all lovers of action films.\n"},
{"review": "\nIs the reviewer writing the review the IMDb member is reading -- or is\nthe member reading the review he was looking for, regardless of the\ntext actually used? I ask because clearly that sort of thinking, that\nsort of dialog, was near and dear to the writer of this oddball film,\nyet, paradoxically, it is this very strangeness that gives the film\nhistorical worth, and the chance (however slim) that it may be\nremembered fondly by viewers of the the far future.<br><br>We will skip the metaphysical question as to why a remake was done of a\nperfectly serviceable and timeless classic? What the original may have\nhave lacked in CGI, it made up for in heart, and in its almost unique\nsatirical POV on modern corporation communications (which led to a\nseries spin off on Canadian TV, BTW) But Hollywood likes reimagining\nstuff. Even Vincent Price as THE FLY was reborn as the forever\nself-aware Jeff Goldbloom, and we sense this was what was intended here\ntoo.<br><br>Reviewers notes: 1. Strange casting. A-List supporting cast (including\nthe under-used Jackie Earle Haley) yet the lead himself seems\nuncomfortable in the role.<br><br>2. The references to Wizard of Oz are doubly ironic since the movie\nitself suffers as much of an identity crisis as the main character.\nSince this is clearly no longer an action film with embedded satire\n(the \"origins\" go for a full hour!) then what is it? Sci-fi? Horror?\nFantasy? The viewer is left to decide.<br><br>Bottom line: not entertainment as we know it. More of a film school\nessay topic, along the lines of what was intended ... and why was this\ngreenlighted?\n"},
{"review": "\nI had high hopes for this film but was left under nourished and simply\nfelt a bit \"meh\" after watching it. As expected the special FX/cgi were\nimpressive and generally a viewable reboot of Robocop but without the\ngenius of Paul Verhoeven at the helm all the humour, social digs and\ngeneral \"this is friggin cool\" was totally lacking and it ended up\nbeing just another sci-fi film that will fade into the \"oh yeah I saw\nthat...once\" category. I loved the first two movies (3 sucked) and, as\nI said earlier, had high hopes.<br><br>I can only say watch it if you have never seen the original - but if\nyou have you may not want to taint your mind with this reboot in the\nattempt to relive past glories of the Robocop ethos.\n"},
{"review": "\nThis movie is the quintessential shoot 'em up of the modern age with a\nhefty dose of stealthy reverse-moralizing. Strong right-wing 'news'\nstyle pathos and false intellectualism is interspersed with patriotic\nfervor in the news segments given by Novak (Samuel L. Jackson). This is\nthat reverse-moralizing I was talking about - a carefully crafted anti-\ndrone movie. This movie is the \"logical\" extension of the use of\nwarfare drones abroad making it onto the streets of America. The case\nmade against corporate corruption and graft, interwoven with\nineffectual or pocket politicians, is strong here. But if you're just\nlooking for a shoot 'em up - this should work well for you. And if that\nisn't enough, at the very end we get to watch Samuel L. Jackson\nscreaming bleeped out obscenities at the camera. All in all, the\nperfect end to a movie like this. :)\n"},
{"review": "\nAs a remake, and given modern CG's, I thought this film was going to be\nan extravaganza of the programmers skills, IE, Avengers, X-men etc. No,\nthis film is a let down in that department. There are great moments of\ngraphic wizardry, but not enough to make this film as good as it could\nhave been. <br><br>The actors do there best with a mediocre script, and the premise is a\nrehash, (though slightly reworked) of the 80's blockbuster. In the 80's\nthe idea was new, and made great viewing, but this 'copy' is a let\ndown. The lead is played by a relative unknown, who doesn't really act\nwell, or inspire me to either; check out his previous films, or look\nforward to the future ones. I enjoyed watching Samuel L Jackson and\nGary Goldman, as they lifted this film, but their great acting wasn't\nenough to make this film anything more than a poor remake.\n"},
{"review": "\nI remember very vividly going to see the 1987 original starring Peter\nWeller, directed by Paul Verhoeven. Like Verhoeven's other films, such\nas \"Basic Instinct\" and \"Total Recall\", the orig. \"RoboCop\" had a very\nmenacing feel to it- but in the best possible way!- just sorta hits you\nover the head and says - LOOK AT THIS AWESOME STUFF!! LOL<br><br>With this 2014 remake, I'll actually have to say I think this version\nis even a little better than the original- goes into more the\nscientific end of things, as well as the corporate involvement in an\nenterprise such as this- incorporating drones, human choice, etc... I\nreally liked this movie, especially for the performances by Gary Oldman\nand recent Oscar nominee Michael Keaton (damn!- I really wished he had\nwon for \"Birdman\"! :( ). <br><br>Okay, my only one drawback with the remake is it's lead actor, a\nrelatively unknown Swede named Joel Kinnaman (\"The Killing\" &amp; the just\nreleased Liam Neeson thriller \"Run All Night\"). He's not a bad actor by\nany means- adequate in the role. My issue isn't with his casting, but\nthe mere casting of an unknown. I honestly think with a role like\nRoboCop you need a somewhat known presence, like Peter Weller was in\nthe first film- not a household name by any means when that film came\nout, but had been a rising star in films like \"Firstborn\" by then. You\nneed someone who has a personality that can transcend the suit- look at\nRobert Downey Jr. in \"Iron Man\"--perfect example.<br><br>But other than that, I'll definitely give this remake a recommend,\nwhether you've seen the '87 original or not--overall a slick, well-made\nsci-fi action/thriller.\n"},
{"review": "\nWell, the overall graphics was very awesome but there were a lot of\nflaws. First, it would have been good if the robocop has some\ncatchphrases or a good sense of humour. Secondly,the robocop was not\nseen taking down bad guys and showing how awesome he really is.\nThirdly, there was no actual bad guy that could match him, no real\nvillain. Fourthly, by the time, the robocop had hit the streets, more\nthen half the movie was already gone and the robocop just had a dull\nenvironment surrounding him. The makers could have done better but\nhowever the movie still gets a six because there was some cool action.\nThe robocop movie is still a good ones but don't keep your hopes up.\ncompared to some other summer movies, they are still above them.\n"},
{"review": "\nLet's get this out of the way: I expect to be thoroughly entertained,\nin one way or another, by every film I see. Unless it directly states\nan ulterior motive at the onset, I want to be moved on my way out of\nthe theater or after ejecting the DVD in a way I wasn't before I\nwatched the film.<br><br>Now, in regards to RoboCop, I expected to at least be as happy with the\nresults as I was with the first two, Peter Weller installations. The\ntrailers for this film made this look unlikely, but I wasn't going to\nbe deterred. I'm glad I wasn't.<br><br>This film is far from bad. But it is disappointing. With a strong cast\n(and one of Gary Oldman's best roles in recent memory), more might have\nbeen done. That would have necessitated some fleshing out of the\nscript, more intensive relationships between Murphy and those close to\nhim, etc. As it ended up, I enjoyed myself, but was left wanting\nsomething else. A weird combination, but an all too common one with\nmajor Hollywood productions.<br><br>Those who saw and enjoyed the WellerCop films, you'll enjoy this. You\nmight end up wanting more, as I did, but enjoy it you will. You already\nknow the bar wasn't set terribly high to begin with. Those who are\nvirgins to the franchise, start from the beginning and then compare and\ncontrast the old and the new. You don't want to start here. You almost\nneed the plot of the originals to understand how today's technology\ncould lead to that of this film. That, and to understand some of the\nclever homages to the originals, little treats that definitely made for\nenjoyable moments.\n"},
{"review": "\nNot only is this movie sexist and extremely racist. It goes out of its\nway to establish the idea that United States is the best country the\nworld will ever see. The absurdity of the claims and complete ignorance\nhow history not matching with their fantasy of their history putting\naside, the movie subtly depicts eastern Europeans as terrorists, Asians\nas intelligent working slaves of US and Black people as all criminals.\nThe protagonist is of course a white heterosexual slim American who has\na gorgeous wife that he can have sex with anytime he wants because his\nwife his head over heels for him, a young son who sees his father as a\nsuperhero, a money crazy antagonist CEO and a side kick black coworker\nwho gets shot in the end. All in all, Robocop introduces absolutely\nNOTHING NEW on the table and even has the audacity to praise America's\nchaotic justice on earth to be the \"future\" The only thing that's\nworthwhile seeing in this movie is the spectacular performance of Abbie\nCornish.\n"},
{"review": "\nNo, please don't ask me where I would cut it. A first-class production\nthat makes Paul Verhoeven's 1987 version and all the sequels look like\ncheap claptrap. Far better special effects, better photography, more\nstyle, but a bit too long. Well, there's not much left of poor Alex\nMurphy, after he gets blown apart. Just a face, brain and a really big\npair of lungs. Kind of like an \"Iron Man\" feel to it! Again, The\nRobocop steals the show, showing far more humanity than his demented\nboss (Michael Keaton) and his \"red-team trainer\". Samuel L. Jackson\ndoes a great \"Al Sharpton\" impression-quite Republican in nature!\n\"Robo\" acts almost like Batman-and-his-Batcycle at times. Great use of\nbluescreen process. The \"Tin Man\" costume is entirely \"matted in\"! This\nversion has a morality to it: You can't take the humanity out of the\nman, as hard as you try. Nature will find a way. Garry Oldman plays\nbrilliant scientist Dennett Norton, and as usual, he's terrific. The\nsupporting cast (relatively unknown Canadians) is quite competent. The\nspecial effects start out great, but the mechanical \"Robocops\" look\nlike men in rubber suits at the climax, which I suspect they are. (Way\nover budget?) Detroit, of course, looks just like Toronto and\nVancouver! A stellar remake!\n"},
{"review": "\nEvery remake or reboot that comes out get some bad press, well is it\nthat hard to grasp that living up to a classic is hard, especially for\nthe fans. This is a different interpretation of the story and even if\nit can't completely live up to the original it certainly is a very good\ntry.<br><br>This film has a good story, really keeping up the futuristic and cool\nsci-fi appearance. I would have liked a bit more humor, but other then\nthat the hard strict tone and the characteristics of the actors really\nfit.<br><br>I was entertained, even though I like the original better, this is\nreally a good remake, but it is kind of like Dredd, you can only do so\nmuch to make a good classic as good in the remake, at least they don't\nruin the childhood memories :)\n"},
{"review": "\nI love the original Robocop. So therefore I automatically hate this!!\nRant rant rant! Nah, just kidding.<br><br>I do love the original Robocop, it is a classic. But I am not one of\nthose who hate remakes. I think remakes are good. They are, no matter\nwhat people say, more of what we love. (If we love the movie being\nremade) And if a remake is bad, just. don't. watch. it!<br><br>But this is a pretty darn good remake. Reboot, whatever. They change\nsome stuff, but hey, that's allowed. It is pg13, this could have been a\ncatastrophe, but it isn't. You don't really think much about that.<br><br>Joel Kinnaman delivers a great performance. Michael Keaton is good.\n(always) The action is very entertaining. I don't even mind the new\nsuit. Yes, the old one is überawesome, but the new one is pretty\nalright too.<br><br>I went into this with pretty low, or neutral expectations, and I was\nvery entertained. There are even a scene or two that is kind of\nunpleasant, and quite sad. That's pretty good.<br><br>So don't believe the naysayers about this, it is a real good\naction/sci- fi flick. It could so very easily have been a dud, but it's\nnot. Hooray.\n"},
{"review": "\nRoboCop is a 2014 American cyberpunk action film directed by José\nPadilha. It is a remake of the 1987 film of the same name and reboot of\nthe RoboCop franchise. The film stars Joel Kinnaman in the title role,\nwith Gary Oldman, Michael Keaton, Samuel L. Jackson, Abbie Cornish and\nJackie Earle Haley in supporting roles.<br><br>In 2028, OmniCorp is at the center of robot technology. While its\ndrones have long been used by the military overseas, their use is\nforbidden in American law enforcement. However, OmniCorp gets a golden\nopportunity to crack that market when Detroit cop Alex Murphy (Joel\nKinnaman) is critically injured in the line of duty. By transforming\nMurphy into a cyborg, OmniCorp executives hope to rake in billions for\ntheir shareholders, but they forget one thing: There's still a man\ninside the machine.\n"},
{"review": "\nI was pleasantly surprised with this film. After having heard the\ncriticisms, I expected this movie to be bad. Know why I expected it to\nbe bad?? Because I saw the original and the original was bad! I mean,\ncome on folks! OG Robocop was a revolutionary film, but it wasn't a\ngreat movie. And it's sequels were even worse. The over-saturated\nviolence and profanity. The unbelievable villains. It was a poor film.\nAnd don't tell me you feel the graphics in that film hold up today! No\nway. <br><br>This movie, however, completely rebooted the story, sticking true to\nits essence, but telling it in a new way. As honestly a reboot should!\nDifferent man, different tragedy, different suit, different\nexperiences, updated to reflect our modern day technological advances.\nThe movie is a GOOD movie! Sheesh!<br><br>And let me say, I thought the actor Finnaman gave an awesome\nperformance. His most dramatic scene, I thought, was just\nbone-chilling. I could completely empathize. Gary Oldman wins\nalways...liked the wife-didn't have any issues with the casting.<br><br>My reasons for a 7-star rating was because I did feel that the climax,\nor finale, if you will, was just a tad lackluster. Just a tad though! I\nthink I would have preferred the villain to be a little more villainous\nthroughout the film than in just those last few minutes. Villain was\nmore of a d-bag than anything, so it just didn't flow for me all that\nwell.<br><br>But overall, good cast, fun action, great graphics, loved the new\nsuit-it was good! Let the original die! Lol...Or don't. No film reboot\nshould be too similar to the original anyway!\n"},
{"review": "\nRemake of the 1987 favorite, about a critically injured police officer,\nwhose only chance of survival is to become a part-man/part-robot being\nthat is used to uphold the law. It's easy to nip at the movie for being\nfor more tame in terms of violence (considering the original's\nR-rating), but it wasn't for a lack of trying by director Padilha and\nstar Kinnaman\u0097and the remake actually seems far more action-packed\ndespite the lack of bloodshed. Another plus are themes of\nconsciousness/mind and free will, which is worked in very fittingly.\nKeaton and Oldman are excellent, and the film is even further\nheightened by many homages to the original, especially with snippets of\nBasil Poledouris' 1987 score. While Jackson is also a pleasure as\nNovak, a television host and supporter of RoboCop, the film's major\ndownfall is the out-of-place humor in the first and last scenes of the\nfilm\u0097the latter of which is followed by The Clash's \"I Fought the Law\",\nwhich is just too distractingly strange to let it go unmentioned.<br><br>*** (out of four)\n"},
{"review": "\nRobocop tells the story of an injured man then declared that would be\nneed to go through a series of surgeries to recover from his critical\ncondition. RoboCop proves itself sharper than many studio reboot,\nremake, or sequel in recent memory. Setting in 2028 and society has\nbecome so advanced, even though mechanized peacekeepers have proved\neffective in the Middle East. Robotics manufacturer Omnicorp stands to\nmake billions in the homeland security market if CEO Raymond Sellers\n(an oily Michael Keaton) can sell the government and the American\npeople on the idea of a non-human police force. Captivating throughout,\nthe film definitely brings a sense of urgency and imagination\nthroughout. Although the idea is great, the film could have been better\nthan its final product.\n"}
]