[
{"review": "\nIf your idea of funny is excessive unnecessary profanity (it seems\nalmost every line in the film contains it) inserted instead of actual\nhumor, uninspired sex jokes, gross images with no pay off, and lame\nsatire, then you may enjoy Sausage Party.<br><br>Allegedly, the inspiration for making this movie was the creators'\ndesire to make the first \"adult\" 3D animated film. The interpretation\nof \"adult\" here seems to be the same as when it's used to describe\nporn--in other words, \"adult\" in the sense that you wouldn't want\nchildren to watch it but not in the sense that it shows much\nsophistication.<br><br>I have nothing against gross or low humor. But that's just it. There\naren't really any jokes in this movie. Punchlines here are usually\nsomeone dropping an f-bomb. If you are not 11 years old, you may want\nsomething more. Visual gags are sometimes interesting, but do not\ninduce laughter. The animation is well done and there are many\ncelebrity voices involved, all of whom act well, but to what end?<br><br>Anyone familiar with the sort of movies Seth Rogen ends up in (toilet,\nsex, and drug humor) then you will have a fair idea of how this pans\nout. There are characters taking drugs and talking about \"getting\nbaked.\" HA! HA! Items from the grocery store make crude remarks and\nsimulate sex acts. HA! HA! Many of the characterizations simply involve\npeople yelling a lot. HA! HA! There's brutal violence. HA! HA!<br><br>News emerging since the opening suggests that the artists working on\nthis project were treated cruelly and unfairly. That's how I felt as an\naudience member.\n"},
{"review": "\nIf could give it a 0/10 I would.<br><br>I'm not going to cry p.c. nonsense about the crude humour, I like crude\nhumour, but in spades, this film was just a continuous attempt at badly\nexecuted shock value (food orgy) with absolutely no real story wrapped\naround it, they find out the world is \"evil\", kill the store staff, but\nnever question the giant plot holes involved, such as:<br><br>If it is a film about talking food, how come a toilet roll and a douche\ncan talk, but no other inanimate objects can't talk? Among other logic\ndefying questions.<br><br>It reached a point where at the end they ran out of ideas and decided\nto build a StarGate to find the actors who voice them in real life for\nsome reason or another, at that point I had checked out completely.<br><br>To conclude, it's too adult for kids, yet too stupid for adults.<br><br>Avoid.\n"},
{"review": "\nOkay, to start this off: this movie is definitely NOT for kids. It\ndefinitely deserves its R-rating. Sausage Party is one of those movies\nthat will make you say: what the hell am I watching?<br><br>To be frank(see what I did there?), this movie fulfilled every bit of\nexpectation I had, no more and no less in its \"well, I think I've seen\nenough\" factor. What I mean by that, is that this is the most vulgar\nand xenophobic animated movie I've ever seen but in a good way. As\nobnoxious as this movie is, I can't help but giggle half the time when\nI'm watching it, even though how disgusting and indecent some of the\nscenes are, especially at the end. And mostly because of that, I will\nnever see food the same way ever again(the animation is pretty good\nthough).<br><br>Maybe my only true complaint about this movie was the ending, since it\nseems it was just tacked in there \"just because\" but to be fair, the\nmovie was already weird as it is. So yeah, the ending for me felt kinda\nrandom and I feel that it should've ended in that particular scene\nbefore it but overall, I don't think it won't affect what most people\nthought about this film. Though I expect that this movie will offend a\nlot of people but to hell with that! let your immature side take over\nfor a while and enjoy this film about food getting it on and on and\non..... and on.<br><br>If you like humor that is both weird and outrageously crass but still\nremotely funny, then look no further since Sausage Party is the movie\nfor you.\n"},
{"review": "\nStraight up communist propaganda movie; Don't believe me? well lets go\nover it<br><br>1. Proletariat rising against the bourgeoisie ✓ <br><br>2. Free love and the abandonment of any sense of morals ✓ <br><br>3. Destruction of all religion and \"oppressive\" forces ✓ <br><br>4. No borders and free movement of people ✓<br><br>I am sure there are more but I am not going to waste time watching this\nagain just to find them.<br><br>Besides being propaganda this movie failed to land a punchline and\nbeyond I think one pun it failed to get even a giggle out of me. Every\njoke ended in the word \"f*ck\" (oops spoiler) or implied sex. The story\nwas badly paced and probably the highlight of this \"comedy\" movie(the\nwhole story could have been told in a 2 minute short).<br><br>My final problem would be that last scene was the most pathetic attempt\nat humor I have ever seen and would make even the most sexually\n\"liberated\" people squirm in their seat. Its an atrocity that this was\nfunded, produced and screened yet not one person stopped to question\nit.<br><br>On the positive side the animation was quite good and I would love to\nsee a proper adult animation come around in the next few years that\ndoesn't have the entire tension in the plot hinge on whether a sausage\nis going to f*ck a bun. I would honestly rate this a 5/10 just because\nI enjoy the animation but I am voting lower because so many people have\ngiven this max stars.\n"},
{"review": "\nSo this is the animated movie that came out of nowhere and got a bunch\nof people of talking all because of it's trailer. Let me tell you right\nnow, the red-band trailer for this movie is funnier than the movie\nitself. And the whole reason the trailer made me laugh was because at\nfirst it looks like a regular animated movie, then the swearing and sex\njokes happen. Speaking of which, this movie is nothing but swearing and\nsex jokes, oh and stereotypes. Because writing personalities for\nanimated characters is so difficult, almost every character is just a\nwalking stereotype. The bagel's Jewish, the lavash is Muslim, the\nsauerkraut is a Nazi, are you laughing yet?!? That is the extent of\nthis movies \"humor\", it is literally just that. So if you think\nswearing and sex jokes is the pinnacle of comedy, then this'll be the\nfunniest movie you've ever seen. However, if you're above the age of\n14, then this movie will just exist, exist and not be funny in the\nslightest. This movie only made me chuckle twice, I laughed more during\n\"The Theory of Everything\", and I'm pretty sure that movie wasn't a\nfreakin' comedy!!! This is without a doubt the worst animated movie\nI've seen, and it's a shame that actors like Edward Norton had to be in\nit. I can't wait for the eventual sequel where all the food comes to\nthe real world and interacts with their voice actors, won't that be\nhilarious?! Does anybody else think that the makers of this movie paid\noff top critics to give this positive reviews? Because I honestly can't\nunderstand why anyone who's old enough to see an R-rated movie would\nfind this funny at all.\n"},
{"review": "\nWhen I saw the trailer, I thought it would be fun. But when I watched\nthe full movie, I was totally embarrassed. Its not a matter of\nreligion, nor a matter of anything - but this animation started with a\ngreat starting but it failed miserably at the end. Characters were\nfunny, story was great at the beginning, But food sex ? Seriously ? You\ncould Mark the Film as a 18+ Animation. Sorry, but watching this\nanimation was a great waste of my time . I couldn't even watch it with\nthe kids.Boring story line made it even worse. Try to make a better\nfilm next time. I can't say more. I wish, I could give it a Zero. But,\nsorry, I can't.\n"},
{"review": "\nLet me start by saying that i read reviews from others all the time and\ni was at the beginning sceptical about this seeing some negative\nfeedback....what a shocker this was. Hands down the best animation that\ni watched in a long time. And NO don't take your children to watch this\nas it's full of sexual connotations, dark humour, a lot of swearing and\nwith the script being one of the most elaborate, epic and a big eye\nopener for the things that are happening around us. Well done Seth\nRogen and Jonah Hill it seems there is much more to this guys than\nmeets the eye. With this being said go for it, relax, enjoy the ride\nand mayhem that's about to unfold.\n"},
{"review": "\nWhat I loved about it was it's concept that can be only described as\nToy Story meets Foodfight, where various food products and items live\nin a cartoonish world of gods, destiny, foul language and adultery.\nThis is indeed a possible contender for Golden Globe nominations and if\npossible Academy Award nominations, especially for Best Animated Film\n(that's if Pixar can stand aside).<br><br>So much comedic moments from racial stabs, sexual innuendo, crude\nhumour and one liners that will be a quote in your own life. There's so\nmuch on offer that it doesn't go tame or repetitive, especially towards\nthe end that really goes 'over the top' and takes animation to a bold\nand confronting place where it should (I'll keep my lips sealed on this\nparticular scene but let's just say it's a show stealer). The cast of\ncomedic talents suck as Rogen, Franco, Hill, Wiig, Cera, Robertson,\nRudd and others make the characters seem so likable, hilarious and\nentertaining, and the animation is both stylish and very cartoonish for\nan adult film.<br><br>Overall, Sausage Party is a party that you don't want to miss and no\nbrains are required to get this, and no children should see this until\nthey are over 18 at least, so make a date or go with your bro's for a\nfun time of hilarity. I'll definitely be seeing this again, highly\nrecommended by myself and Jay.The Autistic Reviewers 5/5 stars. Check\nout our facebook page!\n"},
{"review": "\nIt's vulgar. Over the top. And completely hilarious. It even has a\nserious message about religion and why we are here. Anyone that says\nthis movie is not funny does not have a sense of humor. I never write\nreviews but this movie was just to funny to see people on here claiming\nit's not. They just broke new ground for a genre with adult animation.\nWhy not? I'm tired of all animation being just kid movies. Easily best\ncomedy of the year. I hope they make a sequel because I think it will\nbe even better knowing they did something outstanding. Every character\nhas its funny moment. I loved nick roll as the douche and Danny\nmcbrides honey mustard. I'd like to see mcbrides with a bigger part in\nthe next one because he is just too funny. Krumholtz as lavish was\nawesome. I believe it will be even funnier a second viewing. And the\nfinal 20 minutes there is a scene so bizarre and hilarious the fact\nit's animation is just awesome\n"},
{"review": "\nHonestly, I knew this movie was going to be one of those naughty\ncartoons like \"Ronal The Barbarian\", but this is WAY out of my league.\nI'm not saying It's a bad movie, I personally enjoyed and would watch\nagain.<br><br>(SPOILERS INCOMING) (SPOILERS INCOMING)<br><br>In the rape part, and the \"honky honky\" part almost in the end of the\nmovie, I think whoever wrote this was a bit too far in the\n\"unconfortable scale\", like, I was legitimately afraid someone just\nwalked into my room and saw me watching food porn... literally. Besides\nfrom that, I think the unappropriated language between characters shows\nthe viewer that they are comfortable speaking with each other, which\nkinda \"breaks the ice\" in the viewer-character connection.<br><br>I recommend this movie for anyone who is open to \"dirty\" jokes and\nother kinds of not so nice humour... like me.<br><br>BUT however I enjoyed the break of the 4º wall, showing the actors who\nmade the character's voice-overs.<br><br>(sorry for bad English) 8/10\n"},
{"review": "\nWhen I saw the trailer for this movie, I thought, this looks so twisted\nI'm not sure if I want to watch it. But by the end, I thought, this\nlooks so twisted I'm going to have to watch it.<br><br>The movie is styled after typical animated kid's movies like Toy Story,\nwith anthropomorphized foodstuffs in a grocery store chatting and\nsinging. Their song describes the joy of the moment when the \"gods\"\nwill take them to the \"great beyond,\" and the movie is mainly concerned\nwith the horrific truth that the great beyond is where food goes to be\nsliced, boiled, and eaten.<br><br>Deaths are both clever and horrific, as when a jar of jelly lies on the\nfloor, its life-jelly oozing out, while a jar of peanut butter weeps. I\nmean, the people who made this movie are really sick.<br><br>There's also a lot of jokes about sex. It's possible that sex jokes\nmake up 50% of this film.<br><br>Surprisingly, even though the movie is full of sick humor and cheap sex\njokes, this is a surprisingly smart movie. The story is well designed,\nthe characters are relatable, and the movie has interesting takes on\nreligious belief and approaches Mid-East tensions . It's well animated\nand voiced and often really, really funny. This really is the movie\nPixar would make if they decided to make a really tasteless movie about\nsex between hot dogs and buns. Seriously.<br><br>I would expect a lot of people to hate this movie. It's basically a\nmovie of foul-mouthed food telling sex jokes and dying horribly. But\nfor a certain sort of twisted individual, this movie is a blast.\n"},
{"review": "\nOverall: I was pleasantly surprised with this movie. It was funny,\ninteresting and overall just really well done. Colour me impressed.<br><br>Good: It is quite funny all the way through and contains a pretty\ndecent, well wrote story. The animation is very well done even if I\nfeel sorry for those poor animators. Their sanity will be missed. The\nvoice acting is pretty good even if some voices felt weird over their\nrespective characters. It was interesting to see how lip syncing worked\nwith food. Each and every single character is fun and unique and while\nthey fall into stereotypes they still do great job making you laugh and\ndriving the story. I love the contrast between what humans see and what\nthe food sees. It showed the bland tastelessness of reality and the\nbright colourful world the food believes it to be. The villains is\namazing. I love the satirical outlook on out world and religion,\npolitics and cultural conflicts.<br><br>Bad: Obviously, it is a comedy so many will not like it especially if\nvery vulgar dialogue and actions are not your favourite thing ever. I\nwasn't a huge fan of the music and it just felt like a punchline rather\nthan a soundtrack. Despite this, I can not deny the awesomeness that is\nMeatloaf. I also hated the ending and though it was sequel baiting. It\nmay have been a joke but I still hate the prospect of any movie sequel\nbaiting. You NEED to shut your brain of because if you even think for a\nsecond about the movement, the plot and some moments you would turn it\noff instantly. The plot wasn't bad perse however it made no sense in\nthe terms of the movie. The main humour in the movie is hearing food\ncurse. While it is entertaining at first, it does get repetitive and\nboring.<br><br>Best Part: The fight versus the douche in the end was unexpected yet\nhysterically funny.<br><br>MVP: Seth Rogen as Frank<br><br>7/10\n"},
{"review": "\n\"Sausage Party\" is a raunchy, hilarious (except to those who are very\nsensitive) animated movie about the secret life of food in a big,\ngrocery store. Seth Rogen plays a hot dog whose main goal in life is to\nbe united with a hot dog bun played by Kristen Wiig. They, along with\nthousands of other foods, live a happy and carefree life in the store,\nbelieving that one day, a human will pick them up and take them to food\nheaven where they will be set free and all will be well. But when a few\nfood products who managed to escape the carnage that awaits food in the\nhands of humans comes back to the store and tells of the horrors they\nexperienced, panic quickly spreads, forcing the foods to either deny\nwhat their true fate is, or fight the humans in an all out war for\nsurvival.<br><br>My most memorable, movie moment of \"Sausage Party\" is the scene when\nthe food products that have been bought by a shopper get a shocking and\nbrutal reality check of what the purpose of food is.<br><br>As with most Seth Rogen movies, this is not just about gross-out, crude\njokes. \"Sausage Party\" does have a heart, too; and makes some\ncommentaries on prejudice and tolerance and acceptance\u0085it just does it\nin mostly disgusting, but funny, ways. Bottom line: Seth Rogen fans\nshould not miss this one; non-Rogen fans may want to move on and watch\nanother re-make of another Jane Austin movie.<br><br>mannysmemorablemoviemoments\n"},
{"review": "\nFinally we get an animated film strictly for adults I always wondered\nwhen they would make one and now my dream came true but I didn't have\nhigh expectations for this after I saw the trailer but now after\nwatching it I can honestly say I enjoyed it more than I thought of it\nanyone who has seen this will know the premise the film is set in a\nsupermarket and centers on Frank the sausage,Brenda the bun and all\ntheir...let's call them friends they basically dream of going to the\ngreat beyond to be chosen by the \"gods\" which are actually the humans\nbut then Frank finds out that it's a lie and that what really happens\nis they get eaten that the \"gods\" kill them and eat them well in their\neyes as least. I'm just gonna go ahead and get my one problem with the\nfilm out of the way which is the douche who ended up with a bent\nnozzle,raped a juice box which was really over the line and went after\nFrank for revenge. I loved the animation it was so well done,I found\nthe jokes hilarious I was just cracking up laughing pretty much the\nwhole way through,Frank and Brenda were lovable as a couple and so were\nall the other characters I loved them all,Seth Rogen was great at\nvoicing Frank I just think this is one of his best yet and it's now one\nof my favorites of 2016 I would highly recommend it I give it a 9\nbecause that's what it deserves.\n"},
{"review": "\nIn my opinion, this movie was simply born because Seth was way too high\nand thought of a plot. He was like: \"hey, I got money- why not?\".I love\ndarker, dirty humor, but this movie was kind of underwhelming. The\nrated-R part was is simply that they use at least 3 swears in every\nsentence.<br><br>I think it has the same effect as \"Mack &amp; Devin Go To High School\"\nwhere it is pointless to watch sober. I recommend waiting until you can\nget the movie available to watch at home, gather your friends, buy an\nounce and have a movie night.<br><br>TL;DR-<br><br>don't watch this sober.\n"},
{"review": "\nInteresting concept - the entirety of the interesting part can be seen\nin the trailers. Save yourself both the money and an hour and a half of\nyour life.<br><br>Once you get past the shock novelty of food talking and being\nridiculously raunchy the movie becomes pathetic, repetitive and dull.<br><br>Bottom line- Should have been a 5 minute cartoon. Beyond that it is\nreally just a raunchy, garbage philosophy, amorality play - A vehicle\nfor the usual nihilistic liberal memes involving sexuality, romanticism\nof hard drugs and atheism. I could forgive the vacuous leftist part if\nthe movie were genuinely creative and funny. It isn't. It is an Utterly\nstupid, vacuous waste of time.\n"},
{"review": "\nFirst off anyone giving this piece of crap a 10 needs a psychiatrist.\nI'm not some prude person and I love comedy. American pie series is my\nfavorite and even Freddy for fingered was funny in parts. This is a\ncomplete flop. We all know these idiots on here giving it a 10 are just\ntrying to get you to pay to see it or buy the DVD. Do not buy it. I sat\nthrough this waiting for it to end. A stoned person would not find this\nfunny. Talking food that swears? If there was no swearing in this movie\nthere wouldn't be a movie. 100% horrible flick. Not 1 single funny part\nin it. I went to the bar inside the theater and had a drink and asked\nwhat did I miss. I was told nothing. No one laughed once. I saw it in a\ndiscount theater because it already left the main ones. I really hope\nthis lost money. I promise there won't be a part 2. I laughed when it\nended because I was so happy to leave.\n"},
{"review": "\nFirst thing is first: this movie seems to cater towards people who use\ndrugs, since you would be high watching this, then it doesn't need to\nbe funny. The \"plot\" is obvious. The movie is very vulgar and attempts\nto use that to try and make the movie seem better than it is. This is\none movie that should be thrown out to never be seen again, such a\nwaste for the people who took the time to voice the movie, and create\n3D models and scenes. Nothing about this movie is good, I feel bad for\nanyone who wasted their money to see it. Just another crippling blow to\nthe movie industry. Please don't watch this movie, such a waste of\ntime..\n"},
{"review": "\nI spend more time plotting how to gracefully exit the theater than\nabout the actual movie (yes I did make it to the end. This profanity\nridden movie will make anyone with a slight moral conscience cringe\nwithin the first 5 minutes, and it doesn't get any better. Don't get me\nwrong, there are many extremely offensive movies that I have enjoyed,\nbut Sausage Party has little humor despite how much I really wanted to\nfind it funny. It's like watching a middle school nerdy kid trying to\nlewdly entertain the cool seniors in a high school; yes it's that\nuncomfortable.<br><br>I saw the trailer and thought it would be another hilarious Seth movie,\nbut I was painfully wrong. I highly discourage; you don't know this but\nyou're life will be better not knowing what lies in this failed attempt\nto entertain.\n"},
{"review": "\nHere's the entire script<br><br>Food 1: F**k Food 2: F**k S**t innuendo Food 1: Motherf**k S**t C**t\n(Repeat for all scenes)<br><br>A great story idea which could've got people thinking completely ruined\nby a script with no real jokes. Being British, it's in my nature to\nswear unnecessarily every other word, but when will Seth Rogan and his\nmates realise that swearing constantly is no longer funny and people\nare just bored of it. This film could've been something so special that\nwould sit forever in that group of amazing did-it-firsts that everyone\ntries to copy but fails at. But someone will do it better. This was\njust F**king S**t\n"},
{"review": "\nI love animated kids movies because they're fun and creative, and this\nhas awesome funny adult stuff all over it. Even better!<br><br>I'm pretty hit or miss with Seth Rogen as I've never really found \"the\njoke is that he's smoking weed!\" or \"dicks!\" as almost every punchline\nhilarious in his films. They almost get Adam Sandler-y in that if\nyou've seen a couple, you've seen all of them.<br><br>But this was funny! Very creative, awesome puns, great jokes and the\nconcepts and realization of the ideas are terrific.<br><br>I can fully admit I see how this isn't right up everyone's alley. But\nfor me, it was worth the price of admission.<br><br>Full review: http://wp.me/p3Ww9J-ly :)\n"},
{"review": "\nThe majority of people offended by this show are going to be highly\nreligious people or people who take religion very seriously. The\nvulgarity of it is on par with other similar rated R or TV-MA material\nIMO. <br><br>Contrary to the impression that its just going to be a sex jokes movie,\nthe general theme involves poking fun at religious beliefs on the basis\nof blind faith. If you are someone who brings a critical eye to\nreligion or doesn't take religion too seriously and you don't mind sex\njokes (that poke fun on all kinds of relationships), this movie will be\na fast favorite. We haven't laughed so hard in a long time. Sam Harris\nwould be proud.\n"},
{"review": "\nI really couldn't wait to watch this movie, heck anytime I think I may\nbe able to hopefully get a laugh out a movie or TV show I will give it\na chance usually. I have always liked Seth Rogan's stuff and this was\nfunny as hell but I do agree, the amount of swearing seemed a tad on\nthe excess. I almost expected a little swear jar counter to pop up in\nthe lower right hand corner and bids starting to be taken place in the\naisle with the stationary equipment. <br><br>I really avoided trying to take into consideration the God / Atheist\nissue because I didn't go into the movie, seeing or reading anything\nabout that until, I saw some of the comments here. <br><br>Watching the unrated version at home definitely blew my mind when it\ngot to the \"ending\"..and I am a 42 yr old mother of 2 grown girls but\nunfortunately a widow since 7/10/14. My hubby and I are true soulmates\nand I could hear and \"see\" in my mind my baby laughing at me like\nalways while I was making that WTF face. His smile I miss so.<br><br>That made me smile even more, for that Thank You Seth. Keep on rolling.<br><br>Al would have turned 44 on April 30th, he had a heart attack and died\nin my arms at home.\n"},
{"review": "\n\"Everything we've been led to believe is a lie.\" Frank (Rogen) and the\nrest of the food in the supermarket dream of one day being chosen and\ntaken away. They dream of a utopia and think its the best thing that\ncan happen. After a jar of honey mustard comes back from the outside\nthe things he says challenges everything they know. Now Frank, Branda\n(Wiig) and the rest of the food must look for the real answer before\nits too late. This is a movie that is not for everyone, at all. If you\nget offended, by anything, then do not watch this. That being said I\nthought this was hilarious and I was laughing a lot through out at not\njust the jokes but the actions. That being said this is really my kind\nof humor. Little offensive, cheap puns, and stupid with glimpses of\ngenius ideas. On one hand this is an R-rated adult version of Toy\nStory, and on the other, more serious side, this is really an\nindictment on hard core religious followers. When combined the movie is\nextremely over the top and super offensive but cracked me up and I\nreally enjoyed this. Overall, a movie full of cheap jokes and stupid\nhumor that I cracked up at. If you even think you may be offended don't\nwatch...it goes out of its way to make people uncomfortable. Which adds\nto the humor. I give this a B+.\n"},
{"review": "\nHumor is obviously subjective. And yes, this movie has a lot of\nobnoxious and inappropriate humor. However, it does have two points to\nget across that don't often get mentioned. Beneath all the swearing,\nsex, and other jokes you get from a Seth Rogen movie, there's a good\nmessage. Some say the movie is racist because of its portrayal of Jews,\nMexicans, and middle eastern people. It's actually using these\nstereotypes to show how ridiculous they are, and that once we look past\nthose stereotypes, we're all just human. The biggest, and most\ncontroversial message, is that religion is baloney. I can pretty much\nguarantee that if you're religious you'll hate this movie. As someone\nwho was just switching from Christianity to Atheism, I enjoyed the\nblatant jabs it took at religion throughout the whole movie. The film\nmay be dirty and immature, but it does make a statement on our society.\nIf you like that kind of humor, you'll enjoy this movie.\n"},
{"review": "\nIn a world in which food had mouths, eyes, ears, hands and legs, and is\ndesperate to be chosen by a \"god\", thus being taken to \"The Great\nBeyond\", a sausage and a bun find themselves out of their package,\nrunning away from an evil douche, searching for answers regarding their\nexistence and purpose. Sounds stupid? Well it is, but this makes this\nanimation, which is nothing else than a filthy mouthed and erotic\nparody, an enjoyable watch for almost any adult. Be aware though, this\nmovie should never be seen by any child as is content is way beyond\nwhat he or she would be allowed to see until they're 18+. Although it\nuses the F word as it was trying to break a record, it has a stupid\nplot and some idiotic characters and almost every scene features\nsomething erotic, it manages to be enjoyable until the end. It is also\nvery funny due to its stupidity, grabbing very often a laugh from your\namazed figure. You have two options when it comes to this movie. Either\nyou have some expectations from it, you'll be very disappointed and you\nwill hate it no matter what, either you'll treat it as a laugh like I\ndid, and enjoy it overall. I cannot recommend it to anyone unless we're\ntalking about an adult who doesn't get easily offended by swears, who\nis able to take a dirty joke and find something funny about it. In case\nyou're this type of person, you'll find it quite enjoyable\u0085something\nlike a guilty pleasure!\n"},
{"review": "\nI went into the movie cold, with no idea what to expect and... wow.\nSausage party is offensive, it's lewd and... it's also very very funny.<br><br>Most people expect a certain level of decorum when watching a cartoon\nand this movie just goes completely against that. It's shocking more in\nwhat the movie chooses to show rather than what it says and it is\nshocking because, yeah, it's a cartoon.<br><br>It's a rare thing to laugh so much. You will need to switch on your\nteenager stoner sense of humor but, it is funny. Honestly, it just is!\nIt is incredibly immature and yes it is somewhat offensive and hardcore\nbut it's funny. When was the last time a movie made you laugh and go\n\"WOW I can't believe they went that far\" straight for 90mn?<br><br>Super star cast, Salma Hayek as the lesbian taco is the best - just\nkeep the kids away.\n"},
{"review": "\nSausage party is a tale of animated grocery items, where they believe\nthat being bought is a great thing and call it, \"The Great Beyond\". It\ndoesn't take long for Frank The Sausage (Seth Rogan) to realize the\nhorrible plans humans have for food once they are bought. After\ndiscovering this Frank and the other foods in the grocery store create\na plan to take down the evil humans.Although this movie seems kind've\nridiculous, with extremely vulgar food items, I guarantee you will\nlaugh the entire time. Seth Rogan is great as usual and his fellow co-\nstars only increase the comedy. I highly recommend this movie to anyone\nwho enjoys a good laugh.\n"},
{"review": "\nI had great expectations for this movie, since I watched the very first\ntrailer. It seemed to be something fresh and clever! Not another\nanimation with talking animals. Then the reviews came. A major success.\nThat frightened me. Like a lot. Major success does not mean a good\nfilm. Frozen was terrible.<br><br>So, I gathered all of my friends and went to watch it together. Each\none has different taste but we all like a good animation. And it was a\nTRIUMPH.<br><br>This movie is an awesome comedy of epic proportions, for 15+ people!\nEveryone that is complaining for vulgar content belongs to the\nbraindead who went with their kids to watch Deadpool. THEY ARE RATED\nFOR A REASON, PEOPLE!<br><br>The main theme of this movie, is not a food story, but more than this.\nIt's an animated, Aristophanic comedy, of the modern global society, in\nalmost every level. A sharp and clever criticism to the mindless mass.\nA challenge to read under every surface. And all these, from a\nseemingly harmless animation with food starring!<br><br>Just enjoy it! A rare diamond of animated films!\n"},
{"review": "\nIf your idea of funny is excessive unnecessary profanity (it seems\nalmost every line in the film contains it) inserted instead of actual\nhumor, uninspired sex jokes, gross images with no pay off, and lame\nsatire, then you may enjoy Sausage Party. good tip, don't watch with\nyour sister and father like den Toni... it makes for awkwardest\nsituation (like that one where the bagel covers his eyes ;) )\nAllegedly, the inspiration for making this movie was the creators'\ndesire to make the first \"adult\" 3D animated film. The interpretation\nof \"adult\" here seems to be the same as when it's used to describe\nporn--in other words, \"adult\" in the sense that you wouldn't want\nchildren to watch it but not in the sense that it shows much\nsophistication. holy buckets! salaam Hank is the this! she makes all\nother lesbians look like garbage. 10/10 would \"flap\" again.\n"},
{"review": "\nAfter seeing previews of this film, my 12 year old daughter said she\nwanted to see it because it looked funny. So as with all films I\npreviewed it before permission was given. I was simply amazed at the\nnumber of F' words used in this film among many other disturbing\nthings. This brings up an issue of advertising. I really believe there\nshould be a specific and separate warning for \"cartoon\" films that say\n\"not suitable for children\", kinda like Camel Joe for the tobacco\nindustry. The R rating just isn't enough. No one pays attention to\nthose anymore because there is not always a definition to the warning.\nSo which is more harmful, violence, nudity, drug use or perverted\nbehavior, etc. I believe my daughter would have been traumatized by\nwatching and \"listening\" to this movie. Fortunately my daughter is very\ngood about accepting my guidance as to what is appropriate and would\nnot watch this without my permission. But I worry about other kids that\nmight be drawn to and get access to this film, and you can't always\ndump it off on the individual parent. It takes a village. This type of\nfilm has no business being advertised like any other animated cartoon\nmovie. Its a crappy movie and the humor is only funny if your a\ndeviant. Of all the talent that was used, I am disappointed that of all\ntopics that could have been made into a film, so many participated in\nthis piece of trash.\n"},
{"review": "\nIt is not so much a comedy as a sharp message or moral. washed minds do\nnot understand.<br><br>It is a direct criticism and a blow to the system. But above all, this\nplane and consumerist human who can not see beyond the goods it\nconsumes.<br><br>Humor is an excuse to give a terse message and moral teaching. That\neven idiots can not understand, I think they will sink into the\nsubconscious. <br><br>A round of applause for a different, bold and funny movie. My greetings\nto the creators.<br><br>Filling: bla bla bla saw online, I would have liked to see in the\nmovies and that surprised me.\n"},
{"review": "\nYou will like Sausage Party if you are the kind of person who : 1)\nthinks a Muslim pita having anal sex with a Jewish bagel is\nentertaining, or 2) gets a hot dog at the ball park and then proceeds\nto emulate the dog having sex with the bun,or 3) just likes hearing the\nword F^*K and other 4 letter words said every minute by a variety of\ngrocery store food items impersonating humans. The level of profanity\nand scatological humor simply over powers any positive aspects that\nthis film may have. Do not be fooled that this is a Minions, Trolls, or\nother silly little animated comedy that you or your children may like.\nIt should be rated X, not R, for Xtreme filth and would have been had\nthe characters been humans instead of groceries.\n"},
{"review": "\nFirst off to all the folks saying, \"it was so vulgar\", and \"it had too\nmany sex jokes\", please go back to watching the Big Bang Theory because\nI can guarantee that's your type of comedy. Everyone I know talks with\nthose \"dreaded\" curse words all the time. Stop being so offended by\nthem please. And those perfect people complaining about all the \"drug\nuse\" need to stop as well. Four characters in the film smoke a bowl of\npot using a kazoo! Oh no run for the hills! Stop it, pot is not a big\ndeal at all. And the one idiot human character that shoots up bath\nsalts ends up getting it good. So there's that.. Bottom line there is a\nhuge market for this type of humor as seen by the box office and DVD\nsales. So for all those giving it 0 out of 10, please go enjoy your PG-\n13 \"safe\" comedies like the new Ghostbusters remake, and leave these\nrare real comedy films for the true adults. PS if you really got\naffected deeply by the douche raping the juice box scene you may very\nwell be a crazy person. Thank you.\n"},
{"review": "\n'Life is a supermarket, we are the items within'. You get this notion\nimmediately from the opening scenes. The whole film is based on that\npremise. I'll leave the rest for the movie to tell. <br><br>First off, I have to admit I would have loved this film if I had\nwatched it at 15 (am 30)...the humour is juvenile and explicitly vulgar\nand caters best to a teenage audience. However, I can appreciate that\nhumour even though I am way past it. Some vulgarity was hilarious, but\nsome moments were overdone and stretched out too long. That was my only\n(personal) gripe about the film. <br><br>That being said, I appreciate that the movie tried to address numerous\nissues (sex and sexuality, patriarchy, religion &amp; religious conflict,\nthe afterlife, politics) and some moments were incredibly smart and\nfunny. And I do like the writers' outlook on life.<br><br>I'm sure many will use the movie's vulgarity to bash it but I thought\nthe writers did a good job, and to be fair we knew they were making a\nvulgar film (the name alone says it all). I'd probably see it again in\ntime. I'd recommend you see this if you're looking for a fun film to\nwatch with the guys, in a sausage party of your own.\n"},
{"review": "\nThis film is a breath of fresh air. If you are tired of the same recipe\nmovies, that we see all year around, this is something else.<br><br>Yes it's vulgar, but not much, yes it's funny but not that much. The\nhumor is best served at home and not in the theater, as there are a lot\nof jokes which you will get with some delay and laugh out loud.<br><br>Now, what I found annoying, is the moral compass and liberal humor we\nsee throughout the movie. For example jokes on religion,drugs,Arabs and\nwhites it's OK. No jokes on homosexuality, other nationalities and so\non.<br><br>It you make a comedy, you should make it so people laugh and not to\neducate them. That's my feeling.<br><br>But good movie, you should see it, it's something different and we\nreally need something different in this industry.\n"},
{"review": "\nIt is a very entertaining movie for adults, but not that funny. There's\nabout a total of 15 minutes of comedy spread out during the entire\nmovie, unless you like vulgar and obscene comedy, which I don't. It's\nnot funny like Family Guy or American Dad, and that was what I was\nexpecting. It's more like The Simpson's or Seinfeld funny, and I don't\nthink either of those sitcoms is that funny. The plot is as good as it\ngets for an animated movie about talking food. I would give it a 7 out\nof 10. Please do not take your kids, or even a person under the age of\n21. There are some very insensitive and offensive things and acts done\nall through the movie.I could have waited for this movie to go to the\n$1.00 movie theater.\n"},
{"review": "\nWhen the first trailer for Sausage Party came out I was shocked by both\nthe name and the trailer. The concept sounded so amazing that I knew I\nhad to check it out and so I did and while I enjoyed it a lot I also\nfound myself not laughing a whole lot. Which was strange to me. The\ncursing and the violence started to blend into the rest of the film and\nin the end just left me more intrigued by what the movie was trying to\nsay than what the jokes were. <br><br>Sausage Party is a idea that was came up by Seth Rogen and Evan\nGoldberg. This idea however came along while they were doing a little\nAMC show called \"Preacher.\" Coincidence? I think not. Preacher is a TV\nshow based on a comic about a man named Jesse Custer who gains the\npower to basically make anyone do what he wants them to do. This comic\nbook is highly renowned for its commentary on the state of Religion at\nthat time. It talks a lot on the idea of God and him being more of a\ndictator than anything else. <br><br>Sausage Party does the same thing in this film. It makes a religious\nallusion that \"God\" is the humans and the food is us in our world\ntoday. We see God as the amazing figure and don't ever question why he\nwas put there in the first place, and I love that about the film. <br><br>Its social commentary was so good and fun that I had to give this movie\na 6/10.<br><br>Now if only we could get more jokes that hit\n"},
{"review": "\nA friend of mine showed the trailer months ago of this weird cartoon.\nBeing a full feature I didn't know if it would work out fine, face it.\nFood at a grocery store hoping to be bought to go to the great beyond,\nwhich means, leaving the supermarket. <br><br>In fact the believe in the great beyond is what for humans is the\nbelieve in heaven and hell and God. We do follow a sausage and a bun,\ndo I need to say more? yes, it's not for your toddlers to watch because\nit's all about sex and swearing all the time. There's even some horror\nonce food is at the kitchen, they all think that they are eternal and\nare going to, well, just watch it once a potato is being washed and\nthen skinned alive. <br><br>It's all there, some fascism, racism, laughing with food that doesn't\nfit in, sure, it's all about humans. But it's all shown in a funny way,\nthe names they have. Have a look at the disabled gum, anybody...Stephen\nHawking...No Disney this time with the gangbang at the end, but 90\nminutes of a no-brainer, and it's great. So pick up your delicatessen\nand have a sausage party. <br><br>Gore 1/5 Nudity 0/5 Effects 0/5 Story 4/5 Comedy 2/5\n"},
{"review": "\nI had eagerly waited to see this movie after having seen the trailer\nbut WTF? So what was this all about? From the outset it slaps you in\nthe face, punches you in the gut and finally goes below the belt for\nthe final blows!! Every second word was a profanity, I'm no choir boy\nwhen it comes to swearing but WTF! The underlying plot of the movie was\nsimple, predictable and centered around the \"love\" of a hot dog for a\nbun BUT there were definitely twists and turns in the story with the\nfinal twist ending the movie in an unexpected way. There were some\nreally good characters in it, Edward Norton's voice as Bagel -\nexcellent, and reminded me of a young Woody Allen. Did the film make me\nlaugh? absolutely despite being the crudest, rudest, smuttiest film\nI've seen in a long time - Would I recommend that you watch it? yes as\nlong as you have a tough skin!\n"},
{"review": "\nSausage Party is a watchable, no-holds-barred comedy that is\nessentially a food-porn done in CGI. There are references and homages\nto films ranging from Taxi Driver to Ratatouille. There are so many\npop-cultural references you'd be surprised to know Family Guy creator\nSeth MacFarlane DIDN'T write any part of the story at all.<br><br>While it is more enjoyable than other 2016 duds like Ghostbusters and\nThrough the Looking Glass, Sausage Party is a default improvement\nthanks to its familiar story and surprising ensemble cast for such an\nimmature movie. Seth Rogen got talents like Edward Norton, James Franco\nand Jonah Hill. There's quite a few really good actors attached to this\nfilm. I guess they appreciated the film's sub-textual criticism of\nreligion.<br><br>Enjoyable, but not a multi-viewer of a film. Stick to Japanese cartoons\nfor better adult-animated-viewing, that or South Park.\n"},
{"review": "\nI searched for several minutes to find my IMDb login for the sole\npurpose of bashing this movie. <br><br>While I do like me some adult comedies and certainly have no problem\nwith swearing, gore or the likes, there needs to be some payoff in the\nform of humor. This is simply not the case here; as others have\nmentioned, there is NOT A SINGLE joke in this movie. Instead of humor\nwe have a gazillion crude allusions to sex (haha wieners in a bun\nhaha). And this topic doesn't even bother me, I'm sure there are plenty\nof fine wiener-bun jokes to be had, but this is just done too stupidly!\nEvery attempt at humor is outright explained and stuffed in your face.\nRemember good ole subliminal - liminal - superliminal? This movie is\nnothing but superliminal. Our friend who chose this abomination is not\nallowed to decide on evening entertainment anymore...\n"},
{"review": "\nImagine a 16 year old boy who has just learned how to swear, give him\nsome drugs and say 'Hey Timmy, lets write a script'<br><br>I found the beginning of the film hard not to laugh at but I don't\nthink I was laughing at the jokes, more so the shock factor. After 20\nminutes of what was going to be a spiral of bold language and no\nsubstance, I forced myself to stay and watch the remainder of the film.<br><br>The film went from scene to scene making really juvenile jokes and\nreally poor puns and references comparing the food stuff to real life\npeople (cheap and easy dumb humour). <br><br>I feel this film was for men under the age of 25. My female partner was\ndisgusted at the last scene which showed a mass orgy of condiments (I\ncannot believe I had to say this in my life). <br><br>The one thing I did enjoy about this film was the visual effects, the\nteam behind them should be really proud of themselves, especially the\nscene involving the 'shopping cart crash', it was done beautifully.<br><br>Conclusion: Cheap, dumb and poor humour designed for young men by adult\nmen who cannot grow up.\n"},
{"review": "\nI'm not sure how I'm going to write a review for this. It seems natural\njust to describe its main points and personal opinion on those points\nbut that's more an extension of the movie summary, isn't it? So I'll\ntry to review it in film terms.<br><br>Well the plot is quite simple and the humour is basic distaste sort of\nhumour. The message is very clearly anti-religious and yet the\nalternatives presented are either negative or questionable. I'd go so\nfar as to say it is aimed at viewers of the anti-religion, anti-\nmorality persuasion... If you are not such a viewer you may struggle to\nenjoy the movie, unless you are the thinking kind, in which case you\nmay well find it challenging.<br><br>The idea of food being alive (unlike toys) is actually incredibly\ndisturbing from an eating point of view and could put you off eating\never again if you are 5 and watching this. It is a 15 in Britain so\nthat's unlikely, and R-rated elsewhere. For some of the end content I'd\nonly recommend it to adults really.<br><br>I'm still not sure what to say. It was OK but a lot of the stereotypes\nwere typical. I don't want to spoil a lot either but it has its trippy\nmoments. The horror movie factor seen in the trailer was quite minimal\nand more sexually explicit part was brisk, probably all for\nrating/release issues. Certainly had its funny points and definite;y\nhits the smut-meter.\n"},
{"review": "\nThe element of surprise is the cornerstone of comedy, and Rogen's crew\nhas proved more than capable of catching us off guard with their brand\nof childish-adult humor (ie Knocked Up, This Is The End). Their latest\nventure, a bawdy animated-food comedy, finds them in an undeniably\noriginal medium. While much of the surprise in the individual jokes is\ngone in favor of broader concepts, Sausage Party still works, thanks to\nits comedic thoughts on faith and prejudice. It's a mixture of foody\nand racist puns that, while far from consistent, provide plenty of easy\nlaughs. Sausage Party is the story of a gang of grocery items who go on\nan adventure of self-discovery and terrifying revelations. Its\nsurprising main ingredient is its interest in social pigeonholing;\nthink Zootopia without the cute animals and family-friendliness.\nThoughtless religion and selfish bigotry are on abundant display,\nincluding a hilarious opening song (akin to the worst of modern\nevangelical music) and a straight-up explanation of our tendency to\ncompartmentalize people with religion and race. Even with that\nself-awareness, its stereotypes are pretty tired (the bagel is a scared\nJew, the taco is a sex-crazed Latino). Its racial typecasting isn't the\nonly thing that pushes the envelope in this hard R. Cartoon parodies of\nviolent horror and war films, drug-trip scenes, and a finale so\nhilariously / offensively vulgar I'm not sure I can even mention it;\nit's like these guys knew they could get away with more in an animated\nworld. So while Sausage Party's inventive ideas never quite cook the\njokes to their full transcendence, it's still pretty dang funny.\n"},
{"review": "\nBefore I watched the movie, I was thinking about what will happen in\nthe movie. Weed, drunk, party, and swearing. However, this one is way\nhigher than my expectation. It's like the movie Zootopia.(not exactly)\nthey create the world with different types of food which represent the\ndifferent types one people on earth. The animation is good, but still\nneed to improve on some of the detail. The thing I don't like is the\nstill dialogue. Yes, it is a rated movie, but swearing in the movie is\nreally not that funny anymore. And it does show the strong\nrelationships between each other. That is why I give it a 6. But,\nstill, I hope they make the second movie.I have seen lots of crazy Seth\nRogen movies. Like he kills the leader of North Korean or He and his\nbest friends try to survive the apocalypse. This movie is the craziest\none they ever made.\n"},
{"review": "\nWhat would happen if we could put every nationality, every religion,\nevery race and every political disagreement inside the minds of beers,\ntomato cans and detergents? Or bagels, tacos and hot sauce? Well, Seth\nRogen gave it a try. With the help of the folks who had already brought\nus Neighbours, and a luxurious voice- over cast, he delivers one of the\nfunniest and most effective comedies of the year. It's too damn much at\ntimes, but it feels so good. It's genius the way the writers create\nevery single food personality either based on their shape - take the\nsausage for instants, it behaves exactly the way you think it does - or\ntheir country of origin, and that's the way I liked it best. The bagel\nthat can't stand the lavash, the German beers that oppress the juice\n(GOT IT?), or the sexy taco who's just too hot to handle (brilliantly\nvoiced by an equally hot Salma Hayek), it's a perfect depiction of the\npast and current problems of the world, told in a way too harsh and\nexplicit for a live action movie. But what's up with them? Basically,\nthey think that being picked up from the shelf and brought home by the\nso-called Gods (humans, they mean) is the best thing that can happen to\nthem, leading to another political critique - unproven and\nirresponsible adoration. It's all false, and Rogen seems to get a\nlittle personal on this one, with his character desperately trying to\nprove that you can't just believe in it because you've heard about it\nyour entire life. The main lesson? Don't let yourself be led to the\npromised land by unknown gods. Sometimes it's right there for you to\nreach it. What a gloriously extravagant experience. What a wonderful\nsurprise.\n"},
{"review": "\nI enjoyed this movie, it doesn't purports to be something it's not, a\nvery direct \"straight to your face\" movie which is not afraid to slay\ncertain cultures and criticize them at the same time, as an a Jew and\nan Israeli I find Seth Rogan's humor towards Jews very funny, loved\nwhen the so called \"Nazi\" Mayonnaise sang about killing the \"juice\"\n(Jews) for example and I can testify that the entire crowd in the movie\ntheatre shared the same reply of laughter after this joke.<br><br>I loved the way they reprimanded about the Israeli- Palestinian issue,\nthe Israeli is represented by a begal and the Palestinian is\nrepresented by a láfa (taboon food), the Israeli was described as a\nvulnerable pacifist while the Arab was described as an aggressive and\narrogant food.<br><br>The Mexican tacos and tequilas were expressing their willing to start a\nnew life in another aisle. But most of the criticism were obviously\npointed to the American culture of nowadays where the sausage and the\nbun just can't wait to finally have an intercourse, the bun is very\njudgmental of her shape and body and always wonder if she is not as\npure as she was when she was in the packing.<br><br>In summary, I love racial and cultural jokes and that's what I was\nlaughing about in the vast majority of the movie and I can't say that\none of the last scenes where the foods, alcoholic beverages and the\nhygiene products had sexual intercourse didn't leave me traumatized, it\ntook my innocence away.<br><br>I enjoyed the movie as it gives you a decent break from reality and\nlife and just let focus on the struggle of the living supermarket\nproducts to exist.\n"},
{"review": "\nThe movie gives a clear message of how we make our world so challenging\nto live with taboos that are created by religions. It teaches us, how\nactually hard it is for us to show our unity and respect everyone with\ntheir life decisions. Of course there are many parts in the movie that\nyou can find amusing and just laugh, yet the overall point is to make\nyou realize that most people are scared of an unknown source of power\nthat is going to punish them unless they 'act' in a way that this\nhidden power commands.<br><br>It certainly worth to watch it and just ignore these religious people,\nwho give it a low rating on purpose. Actually ignore those people in\nreal life as well, they just don't like the idea of absolute freedom,\nwhich we currently need so much.<br><br>I gave it 8 because the story needs a bit of improvement.\n"},
{"review": "\nThis film is the first movie in a very long time that has renewed my\nbelief that you can challenge social boundaries head-on.<br><br>Some of the characters are hilarious, some of the dialog, while not\nclever, is great because it's willing to confront social taboos.<br><br>WARNING! No matter how open minded you are, this movie is not for\nchildren. This is totally an adults only movie. There is some violent\nand gruesome imagery, many explicit references to sex and\nhomosexuality. If you heed that warning, you will be spending a lot of\ntime explaining adult references.<br><br>The stand-out performances were from Seth Rogen and Kristin Wiig as a\nhot-dog and bun. Kristin is so true to herself and her comedy helped\nthe movie shine.<br><br>The animation is mediocre. It's definitely not bad. It reminds me of\nToy Story 1 in its simplicity.<br><br>If the movie has faults, it has profanity for the sake of profanity and\nit is about 10 minutes too long. The movie became tedious toward the\nend and I was a little too eager to see it finished.<br><br>If you're looking for a movie that challenges social norms and will\ncertainly offend anyone Politically Correct, this is your movie.\nHowever, it's not quite the clever movie it could have been. If you had\nthe likes of Mel Brooks on the writing credits, he would have provided\nthe secret sauce to take the film from funny/profane to comic\ngold/social commentary.\n"},
{"review": "\nThis film was genuinely funny. What's the problem? That the film\nquestions religious beliefs? Or that it makes references to previous\nand modern-day conflicts? Or was it the profanity? I like to think that\nwell-placed swear words only add substance and make us feel alive. I\nabhor films that use \"gosh darn it\" or \"friggin'\" or some other\navoidables. Say it like you mean it. I was thoroughly impressed by how\nthe film managed to assign a backstory to each product, in line with\ntheir country/region of origin. There are so many details I am sure I\noverlooked that I will definitely have see it at least a couple of more\ntimes.<br><br>Good job, guys.\n"},
{"review": "\nThis movie could of been way better of a movie. I seriously think Seth\nRogan and Jonah Hill needs to lay off the pot for awhile. the animation\nis mediocre. the story line is just boring a guy named \"Frank\" (voiced\nby Seth) I wasn't laughing because. it was funny. I was laughing how\nstupid this film is. the entire plot is food that wants to see the\n\"great beyond\" and \"the gods giving new life\" comes to find out. they\nget devastated by the consumption of humans. the end is probably the\ndumbest part. an orgy? seriously? all the fruit and vegetables having\nsex? just because, you get countless big name actors. DOES NOT MAKE IT\nA GREAT FILM! the reason Disney Pixar movies are so great is story\ntelling,music orchestration etc.. Seth is now the new Adam Sandler just\nmore pot head Jews making god awful movies. I wouldn't see it again.\nalso, why did they all break away from the store and go on a rampage on\nhumans? why stay there and attack people in the store? it was so stupid\nand pointless. get your money back.\n"},
{"review": "\nSausage Party is more than just Seth Rogan and friends in animated form\nmaking obscene and offensive jokes, Sausage Party brings up many valid\nquestions about our society, religion, and how we view ourselves.<br><br>In some ways, Sausage Party is exactly what you think it is. A silly\nanimation movie full of raunchy jokes and laughs. If you take this\nmovie for face value, it will still be very goofy and funny. There were\ntimes were I could not stop laughing. The pun game is out of control.\nSome of them will probably go over your head if you are not paying\nclose attention.<br><br>The thing that put this movie over the top for me though, is that it is\nalmost like a Pixar film for adult themes. The most common and blatant\none is God. The movie makes a lot of comparisons to modern religion\nraising the question, \"Does God exist?\" They even through in a lot of\nreferences to how the Bible came about, and how many people believe the\nBible has been changed throughout the years. <br><br>The also bring up many cultural problems with race. The different foods\ndon't always play nice with one another and it makes for some intrigued\ninsight on modern society. <br><br>Finally, they make a strong point about how women are punished and\njudged much more harshly in society. The main point is that women\nshould not be judged harsher for being sexual when men are the same\nway.<br><br>Ultimately, I think the point of the movie was to not hold back and\nenjoy life not worrying about consequences that may or may not exist.\nWe can't all just wait for happiness in the great beyond. Nothing is\nguaranteed in life. You have to live in the present.\n"},
{"review": "\nHere's the thing about propaganda films. If they are bad when\nChristians do it (God's Not Dead 1&amp;2, Kirk Cameron Saves Christmas)\nthey are not going to be better when atheists do it. That's what it\nfelt like watching this movie. Sausage Party is the God's Not Dead of\nan atheist propaganda movie. You are preached at for the entire run\ntime on why it's bad to believe in a religion, while having to sit\nthrough painfully obvious jokes that don't land. (Oh the douche is a\ndouche. Hahaha creative) Now before I'm accused of being some whack job\nfundamentalist let me say that I hate the other propaganda films. If I\nwant to watch propaganda I'll go to the source and watch it. Sausage\nparty is even worse because the trailer doesn't show how preachy it\nactually is.<br><br>It's sad too because the cast is super talented too. (Kroll, Whig,\nCera, Rogan, Hayak) which means that the fault lies solely on the\nwriting which comes off more as a summer camp sketch than a movie. It\nrelies way too heavily on recycled racist tropes that were done better\nin a 50s Looney Tunes cartoon. That mixed with just yawn worthy sexual\ninnuendo makes the film unbearable and leaves you praying that the film\nends soon. Which is ironic because that's the opposite of what the film\nwants you to do.\n"},
{"review": "\nI knew what to expect going in to this, coming from the insane minds of\nSeth Rogen and Evan Goldberg. I saw the trailer, and thought to myself\nthis is gonna be one insane ride. When I came out of The Secret Life of\nPets with my mom and my nephew, saw the poster to Sausage Party, I told\nmy mom \"Don't be fooled by the poster, that is not a kids movie\".<br><br>The story speaks the insanity for itself, about food in a grocery\nstore, and that is all I'm gonna tell ya. The animation is top notch,\nspoofing those Pixar films. The actors really do voice there characters\nwell. Seth Rogen really brings his humor well to his role has a hot\ndog. If your not a fan of vulgar humor, and gross out gags, then you\nshould probably avoid this like the plague, cause this pulls no\npunches, it goes straight for the throat. It was very funny, there is\nperfect timing to all of the gags. It's not a masterpiece, but just a\nfun time for fans of this type of humor. Expect nothing or less.\n"},
{"review": "\nYes, this movie is very raunchy and filled with sexual innuendo, yes,\nit uses many stereotypes (racial or otherwise), but it's not stupid.\nOK, it is stupid, but it's stupid in a smart way.<br><br>\"Sausage Party\" starts with a raunchy song condemning religion, and\nbasically continues on that note. The film argues that if there is a\nGod, he is indifferent to our well being. It states that our vision of\nGod and the afterlife was simply invented to rid us of our constant\nfear of death. It does contain many stereotypes of all kinds, and it\neven has a rape scene (yes, a rape scene), but it's a film that\nactually condemns hate, and all of the pointless rules religion gives\nus that prevent us from doing what we enjoy, or even inspire hatred.\nThe film says that since death and hatred and racism and violence are\nrampant among the human race, we should stop hating others for their\ndifferences and rather unite as one human race, and just have one big\norgy. Okay, that last part is only partially true, but that's basically\nthe point. We focus so much on our separate beliefs and versions of the\nafterlife and how to get there, that maybe we forget to just enjoy our\nlife on earth.<br><br>Aside from that message, it also has some seriously detailed animation,\nand some clever visual humor, which is something we don't get enough\nthese days, and one of the strongest arguments for the fact that\nanything can be funny in certain context. To top it all off, it's an\nincredibly original idea, and probably one that can never be replicated\nagain, and in the sea of reboots, remakes, and sequels that are thrown\nat us, this stands out, in all of its absurd, raunch- filled, excessive\nglory. And, yes, it genuinely made me laugh. Hard.\n"},
{"review": "\nI expected a funny movie, it turned out to be a boring sequence of\nunjustified F-words. <br><br>I think a 12 years old would enjoy this movie very much, but a 12 years\nold is not allowed to watch it.<br><br>I heard funnier sex jokes in 5th grade. <br><br>Since they want to stress out that is a movie for adults, they keep\nsaying unnecessary profanities (I never heard an adult speaking like an\n8-year-old boy that just discovered the F-word). <br><br>The result is a complete loss of humor (that was present in the\ntrailers). <br><br>The plot is OK, I guess, it is just difficult to see it behind all that\nswearing.<br><br>I can't believe how bad it is.\n"},
{"review": "\nSaw the preview for this movie and had to see it. Saw it on opening\nweekend and the movie was more over the top than what I was expecting.\nThe humor was dumbed down, from sex jokes to religion/race jokes, and\nfinally about drugs. The end result was the most that I've laughed in a\nmovie theatre in well over a decade, and the majority of the full\ntheatre was also laughing hysterically. This movie will get a lot of\ncomplaints from prior who will want something deeper and meaningful,\nout the whole animation fiasco that's going on. At the end of it all\nthis movie gets a 9 from myself as it is a solid and entertaining movie\nin my book.\n"},
{"review": "\nEvery time Seth Rogan comes out with a new movie I've doubted it. Then\nwhen I watch his films (aside from The Interview) I always find them\nhilarious. So I brought my wife and we loved it. It was much better in\ntheaters because all of the people laughing around us made it all the\nmore enjoyable. (especially a scene at the end)<br><br>Without spoiling anything, the animation was great, the voice acting,\ncharacters, story, and above all writing. Seth Rogan, Evan Goldberg,\nand Jonah Hill hit it out of the park. I really enjoyed this film.\nAgain, everyone should consider going in theaters. I never see comedy\nin theaters but it made it better. <br><br>This is definitely one of Seth Rogan and Evan Goldberg's best.\nAbsolutely worth it.\n"},
{"review": "\nnot made for kids, old people or those with taste. I don't mind the\nanti god, or crude language, just hate poor jokes not matter how far\nthey go.I guess if you are an adult with a low IQ you might like this\ntype of thing, but I can't understand how. I think this movie was put\ntogether without much thought or imagination. I don't write books or\nmovies, but this motivates me to do something, can't believe someone\nwas on so many drugs that they thought funding this project was a good\nidea. If you do have a movie, send it to these producers, obviously\nthese guys need some good scripts. To get this movie into major\ntheaters was a major accomplishment and whoever did that deserves an\naward.\n"},
{"review": "\nThere is a message for people who condemn others for their beliefs.\nUnfortunately, those people would never watch this movie. And that's\ntoo bad. Just because you believe a certain way doesn't make others\nwrong. And it doesn't make those folks beliefs the right and only way.<br><br>That out of the way, I could not stop laughing at the action and\nanimations. The art work was awesome. The action was well-paced. The\ndialogue was outrageous. There were a few lulls for me, but when the\naction picks up, its like a roller-coaster. <br><br>I hope there is a part 2. Or another full-length cartoon for adults.<br><br>It great adult fun. Glad I saw it.\n"},
{"review": "\nSausage Party is a R-rated animated comedy written by and starring Seth\nRogan as Frank, a hot dog who learns the truth about what really\nhappens to food when it's purchased by \"the gods\" (humans). Frank has\nto tell everybody else in the food market before it's too late. Other\nfeatured voice talent includes Kristin Wiig, Michael Cera, Jonah Hill,\nand Edward Norton.<br><br>This movie is HILARIOUS! I haven't laughed so hard at a movie this year\nad much as I did during the opening scene of this movie. The jokes\nrange from over-the-top (how do you like them apples, etc.), and the\nmessage might speak to some. I also really liked the animation style,\nespecially in the food characters.<br><br>My only complaint with this movie is how raunchy it was. I'm not\nagainst foul language or crude humor, but there still needs to be some\ncontext with it. When a f-bomb is used every other sentence, it really\nwaters down the effect when language like that could, as Spongebob\nwould say, act as a \"sentence enhancer.\" I was desensitized to the\nlanguage after 10 minutes of film, so it never effected me when it\nshould have.<br><br>Overall, if you can handle some really heavy profanity and humor more\noffensive than Deadpool, you'll love this movie. If you've ever been\noffended by language, sexual humor, or racial stereotypes, this movie\nis not for you.<br><br>Source: http://www.huludb.com/movies/222408-sausage-party\n"},
{"review": "\nSausage Party is a party that I want to go to. Seth Rogan has done it\nagain with his R rated animated classic. This movie will have you\nlaughing from the second it starts to the beginning of the credits. I\nhave seen a lot of great movies this year, but this has been the best\nmovie so far of the year. The animation was breathtaking like\neverything else was about this movie. <br><br>Parents this movie is not let me repeat not for kids. This is a R rated\nmovie that looks like a kid movie, but is not. <br><br>This movie had an all star cast from Bill Hader all the way up to the\nking of comedy himself Seth Rogan. You will love every second of the\nvery unique film it was fantastic I hope you enjoy. <br><br>My score 10/10\n"},
{"review": "\nNot your typical animation, Sausage Party is a look into one of the\nmodern world's obsession-food. It delves into the grocery aisles and\ntells the story from their perspective. Where the love interest of a\nparticular hot dog and bun yearning for each other so intense that they\ndelve into tip play. Raunchy at times, this adolescent humor is funny\nat times and as long as you enter with that in mind, the movie is\npretty good. No stereotype is left behind as you discover a talking\ntaco and whole cast of misfits. The hot dog through his odyssey\ndiscovers foods fate and uses it as a cause to warn others. The danger\nof the human gods and how food nourishes their cravings. There are\ntender moments where the foods come together for a united front. These\nhorny treats leave nothing behind as the audience is left with there is\nnot better to satisfy a craving that indulge in a little food play. I\nliked the movie and enjoyed a hearty laugh even when I knew I should\nnot have.\n"},
{"review": "\nSurprisingly clever adult animated film. It is offensive, racist,\ncrude, sexist, and low brow in the extreme - which is were its charm\nlays. Being a fan of animated Grindhouse films like Fritz The Cat,\nHeavy Traffic, Shame Of The Jungle and Hey Good Looking to name a few,\nit feels great to have something like this in theaters in this day and\nage. It gives a much needed middle finger to our atmosphere of enforced\n\"politically correctness\". It tries very hard to offend everyone\nequally in a manner that allows the audience to laugh at their own\nshort comings and beliefs. On top of the low brow humor there is some\nvery clever plot twists and gimmicks - which I'll leave you to\ndiscover. Solid animation, story, voice acting, and soundtrack - what\nmore could one want in a movie that is just for an adult audience with\nan open mind and a broad sense of humor. Thanks to Seth Rogen perhaps\nthere is hope for more adult animated fare, a Heavy Metal 3 or a\nSausage Party 2.\n"},
{"review": "\ni went into this movie expecting to at least enjoy something? i wanted\nto like it. but more than anything it was just underwhelming and\nmediocre. it was extremely boring, i laughed at maybe 5 jokes (none of\nwhich were memorable). wouldn't recommend personally but if you like\nmovies with a script that was obviously written by 4 high rich dudes\ncompletely out of touch with society, forced unfunny jokes reminiscent\nof a 12 year old lets player on youtube, and uninspired visuals that\nlook like they went with the first draft, then this might be a good\nmovie for you.<br><br>wouldn't recommend to anyone who enjoys good movies, would recommend to\nanyone who is easily amused n thinks its funny when dudes are high and\nkids cartoons say f)ck a lot\n"},
{"review": "\nSausage Party was hilarious, original, and a great story. One of those\nmovies you'll catch something new with each viewing.<br><br>Although its probably like tofu (love it or hate it). I thought of it\nas a rare treat ...like a banana split! Big overflowing scoops of\nindulgent hilarity, enhanced by healthy dollops of creativity,\nperfectly garnished with a huge variety of offensive sprinkles!<br><br>I'll be 60 this year (if you can't hide it, paint it red.) I say this\nfor a couple reason. 1) to lessen the sting and 2) You don't have to be\na 12 year-old boy to love a funny, creative, raunchy comedy that makes\nyou think.\n"},
{"review": "\nI'll start by saying the story and plot of the movie was good. Or gave\nit the purpose to make an actually movie about talking food. Otherwise\nthe movie itself, and I like to put it this way, is one long sex joke!\nSeriously. Besides a couple of morbid deaths of the food and other\nthings that I was expecting more of, you get a lot of sex jokes. And\nmost of the jokes bored me. It gave me a few chuckles but otherwise I\nwas just not finding it funny. Believe they could have done better but\nI suppose with it starring Seth Rogen, I should have expected it to be\na hit or miss and it was a miss. <br><br>Close to the end of the movie, not the actually ending, but close\nenough a scene comes on in which I basically knew was coming. And when\nit happened, it was the most annoying and least bit of funny to watch.\nWon't go into detail but its a build up and you will either laugh or\njust wonder when it'll be over. I can't really find much good on the\nfilm. <br><br>Animation was decent. If I had laughed more or didn't see that one\ncoming moments I believe I would have rated the movie higher. But\nbecause I can't really think of much good from the film and how bored I\nwas throughout it I truly believe the movie deserves a 4/10.<br><br>Think this movie falls into the stoner movies and that could also\nexplain why I didn't find it as funny either. It did however make me\nhungry thinking of food but the movie itself didn't make me feel guilty\nabout going into the grocery store and \"killing\" the food by eating it. <br><br>All in all I recommend finding another movie, I prefer This Is The End\nalso starring Seth Rogen and a few others. That movie was way better\nthan this.\n"},
{"review": "\nWhen I first saw this film advertised I really looked forward to it.\nWithin minutes of it starting I thought, \"Yeah, oh well... let's give\nit a chance\". Pretty much everything from that moment is lost time I\nwill never re-coup.<br><br>Maybe if the plot was good I could give it more stars, maybe if the\njokes were funny I could give it more stars, maybe if the scenes were\nengaging, maybe, maybe maybe. But none of that was to be. The only\nreason I gave it 2 was that the animation was pretty good, but that's\nhardly a redeeming quality to overcome the the vacuous and childish\npremise of the whole film.<br><br>I like swearing just as much as the next red blooded Australian. But\nonly 10 year old's would find the way it was used in this film more\nthan slightly amusing. Along with that and the infantile sex jokes, the\nwhole thing took me right back to primary school... except we weren't\nsubject to such crass stupidity from adults then. We were kids and made\nit up for ourselves. It was a very short lived phase of childhood. I\nfind it hard to believe there's people out there that didn't mature\npast that point.<br><br>Gladly I can say that I didn't watch the whole thing, neither will I\nwaste my time writing much more about it. You can save yourself further\ndisappointment now, too. It's not too late.<br><br>Avoid.\n"},
{"review": "\nFrank is a sausage who has always wanted to be purchased and \"go home,\"\nbut he does not yet know the truth. What he does not know is that his\nkind is used as a snack and he strives to find the truth of his\nexistence in this cruel food-eating world.<br><br>From the trailer, I figured this was going to be 90 minutes of\nprofanity. And for the most part, that is accurate. The cursing is\nexcessive, far beyond what should ever be in a movie. (I'm not opposed\nto profanity, but at a certain point it goes beyond the way any real\nperson would talk.) What saves this film from just being curse words\nand mediocre animation is its social commentary. Maybe it does not say\nanything original, but it says the unoriginal in an original way. And,\nmore importantly, it explains that beating your point of view over\nsomeone's head -- even if you're right -- is never the wise move.<br><br>Great movie? Hardly. But there is something of a silver lining to this\nridiculously juvenile film.\n"},
{"review": "\nI will say while the movie itself is rather unconventional but I will\nsay that it is rather entertaining to watch, the movie itself deals\nwith the concept of the great beyond in which the food products think\nseems to be a heaven of sorts. Little do they know, such a place does\nnot exist and it is in actuality they are taken home to be eaten, the\ncharacters deal with the characters frank a hot dog and Brenda a bun\nwho are in love. It also has great characters such as the taco, the\nbagel, the flap and other food groups. I will say while the movie might\nbe offensive to some, but I think it has plenty of laughs for its 89\nminute running time.\n"},
{"review": "\n9.6 of 10. Being a mix of Aqua Teen Hunger Force and Betty Boop, while\nthe animation doesn't do anything technically new or amazing, the\ncharacter drawing and subtleties combined with the voices and story\nmake for a grand experience as a whole. Easily the best cartoon of the\npast 3 years.<br><br>Sure, it's not for kids, but a lot is beyond their ability to\ncomprehend anyway. It's far more intellectual than you'd expect in a\ncartoon. Teens and up should be viewing this, not that requiring it\nwill be necessary. The combination of comedy, sexual innuendo, music,\nand action will draw viewers to it and keep interest rising. If not\nthat, the desire to experience what it's like to see the world through\nStephen Hawking's brain when really f'k'n' high.<br><br>What's wrong with it? Hmmm, I would have preferred a more lasting,\ngraphic display of the sausages getting up into the buns. It's the\nleast they could do for their puppet masters.\n"},
{"review": "\nWhile it may seem like a comedy, deep down, Sausage Party is a horror\nmovie, seen through the eyes of various food items...all in computer\nanimated beauty. Take away all the vulgar humor, foul language, and\nobscenities altogether, and Sausage Party is ( not surprisingly) a very\ndumb movie. The first ten minutes of this had me, I mean, really had\nme...I laughed a few times, and thought I was in for a winner. After\nthe first ten minutes, it was already tiresome...the \"f\" bomb dropped\nmore times then I care to count. We get it, it's an R rated computer\nanimated movie, not intended for children. Does it really find the need\nto abuse the offensive material? In the case of Sausage Party, it does.\nIt just seems like an endless montage to say and do whatever possible\nto shock us, but after the first 20 minutes, you are actually immune to\nit, if you make it that far. The story actually makes you feel bad for\nconsuming food, something essential for life, and the idea that food\nhas real feelings and is alive is just pure silly, but for the films\npurposes, we play along, and therefore it turns out to be an\nentertaining piece to watch. If you don't think food that can talk and\nlike to cuss is funny, you're in a lot of trouble with this movie. Most\nof the jokes are misses, but the ones that are hits, they are worth\nremembering. So when food finds out it is being purchased to be eaten,\nthey decide to fight back. I thought the movie was quite violent, a\nhuman head is actually decapitated ( by accident) and after an hour of\nwatching this, there are finally several \"oh my god!\" moments...you may\nbe caught a little off guard by the turn it takes, and trust me, you\nwill know what I'm talking about...quite a bit of gore at the end. So\nall in all, this is a story about food vs people. Who will win? The\nquestion really is, who will care? And how many will laugh at it?\n"},
{"review": "\nA sausage strives to discover the truth about his existence. Sausage\nParty is a film that i was very worried about i skipped the trailers\nand i didn't know how a movie about food that talks could work\nespecially with an R-Rating but it did work although i still haven't\nseen a film starring Seth Rogen that was amazing his movies are only a\none or even two times watch nothing more and Edward Norton who also\nstars in this film seems to me that he has completely lost his talent\nand edge. I laughed a lot tho and the characters were written rally\nwell for example Frank, Teresa, Sammy, Brenda all of them really good\ncharacters although i actually died laughing mostly with Honey Mustard\nand the humor worked with all those 'F' words throwing in our faces but\nremember it doesn't always work it's a 50/50 chance for me. What bugged\nme the most was the rape scenes and even the big orgy food sex scenes\nin the end they went a bit over the top with those but it's still a\nnice and funny film for the grown ups only because when the R hits it\nhits hard i mean there's sex, people get blown up or get their heads\nchopped that's the kind of things that happen in Sausage Party although\nthere's some pretty cool references to other films too such as\nTerminator 2 and Good Will Hunting and the whole plot kinda reminds me\na bit of Toy Story but instead of toys we have food and it's more\nimmature instead of sweet. Anyways to wrap this review i'm going to\ntell you to watch this only if you can handle this kind of comedy if\nnot go watch Zootopia which was a lot better than this but it's still a\ngood film but don't expect something more i don't know if the trailers\nmade the film look like a masterpiece but it's not it's a good fun film\nnothing more than that and that's why i'm going to give it an 8/10\n"},
{"review": "\nWhen I knew that an animation\u0096comedy movie have the writing\ncontribution and the voice of Seth Rogen, I was directly drowned to it.\nFor me Rogen is one of the big masters of comedy that we have today,\nand that was enough for me to view this piece. Above that fact we have\nthe well-respected Eduard Norton voice on the cast, plus the irreverent\nJonah Hill, Salma Hayek and James Franco, all great and talented names\nin the business. However, in my opinion this doesn't make this work an\nenjoyable movie, because although we just expect a lot of bad words,\nthis was too much! And we watch a constant list of low level sentences\nthroughout the film for no reason. It aren't funny nor is needed to the\ndevelopment of the story. On the other hand, the concept of bring the\nfood to life, and also the inherent feelings, dreams, goals and\nperspectives are a brilliant idea, but the dialog/ scrip and\nspecifically the last scene ruined it for me.\n"},
{"review": "\nYeah, this is probably the first American CGI animated rated R movie\nthat hit theaters that I have seen. But I just found this flick to be\nmundane despite the over the top immaturity. The cast of \"This is the\nEnd\" got baked started having philosophical discussions while goofing\noff with foods and appliances while watching \"Attack of the Killer\nTomatoes!\" and \"The Brave Little Toaster\". That is probably how the\nscript of this movie came about. The journey is quite straightforward\nand predictable. With tons of food puns that beat out \"Cloudy with a\nChance of Meatballs 2\" except it leans more into sexual metaphors.\nMaybe if I was 12 I might have been amused with this, but now it just\nfelt bored sitting through this. I just didn't get a kick out of the\nover the top and crude humor with this one. I can however see how some\nteens will have a lot of laughs while watching this.<br><br>5/10\n"},
{"review": "\nSausage Party is unlike any animated movie I've ever seen. Having seen\nthe trailer before I had a hunch of what was to be expected and yet I\nwasn't prepared. Being familiar with Seth Rogen's work the humor wasn't\ntoo vulgar for me. <br><br>The idea of talking food is brilliant and the setting for the story to\nevolve is a good one. What makes this movie special is not the story\nitself, but the satire and twisted humor that follows. Had it been told\namong humans instead I don't believe it would have been as special.<br><br>This is definitely not suited for kids! From an adults point of view\nit's a hilarious film that rather makes you question yourself why you\nwatched it in the first place. The last twenty minutes was anything but\nleaving you in a state of shock. <br><br>I'm not going to recommend everyone to watch this movie, since it's\nhumor won't definitely suit all. But, if you're keen on satire, twisted\nplot and a killing spree among food you should have a look!<br><br>I like it, but not sure if it's worth a 7/10 rating.\n"},
{"review": "\nIt feels like this movie was designed as a test for the purpose of\nfinding out more about the people you know. Make them watch this movie\nand then ask them about it afterwards. If someone starts talking about\nhow it's too offensive or doesn't find it at least somewhat funny.\nWell, that's how you know who you want to hang out with. It is funny to\nsee how the reviews for this movie fluctuate so much, and it's a sign.<br><br>The plot feels loose. Seems like it was never very important. The\nmakers had a few scenes or jokes they wanted to make and they loosely\nwrapped them together with a single premise: what if food products\ndidn't know what happens to them once a human takes them. Mostly, this\nmovie is a vulgar racist d*ck joke, which is great on its own, but what\nsells the said d*ck joke is the creative animation and good delivery.<br><br>The humour is hit and miss, that much is true. Mostly it's blunt. The\nlargest part of the entertainment value is in the degree of the\nvulgarity and bluntness. If you do not think that this extreme on its\nown can be funny to you then this is movie is probably not for you (and\nI'm sorry, but we can't be pals).<br><br>Is this movie worth watching more than once. No. Is it funny? This\ntime, it really depends on you.<br><br>On a personal note, I don't understand how The Interview got the same\nscore as this movie. Both are Seth Rogan joints, but this is actually\nfunny and timeless, while that other movie was an irrelevant unfunny\nmess.\n"},
{"review": "\nCan you imagine this and Food Fight as a double feature? You'd get two\ntimes the laughs even though only Sausage Party's were intentional.<br><br>While not perfect, sometimes clichéd and relied heavily on swearing to\nfill in aimless writing zones, this was a hoot and worth the whole\ntrip. Speaking of which, in three days we Phoenicians will find out if\nwe can, in fact, watch this while tripping\u0085legally, anyways.<br><br>I digress\u0085The movie was clever for the most part and got progressively\nfunnier until the climax\u0085climax. Sausage Party basically is an atheist\nstory and yet still promotes personal beliefs. That's mostly hard to\ndo, so well done, guys.<br><br>The film's grocery store is filled with fourth dimensional living\nbeings we gods, er humans, refer to as products. They believe once\nthey're selected, and not expired, they'll go to the great beyond and\nlive happily. Well, no. But, they don't know that\u0085they can't possibly\nstart to doubt their religions\u0085<br><br>There's much more to the plot as I gave the briefest of synopsizes.\nFill in the gaps with multiple subplots, cussing, sexual innuendos,\nhope and even bun-curious behavior. It's cute, NOT for kids and while\nit doesn't add much to your life, it's a freaking fun ride that\nsometimes barely lets up. Totally worth it.<br><br>***<br><br>Final thoughts: I wish I had seen this in theatres. I would probably\nlaugh just as hard seeing the parents leaving abruptly with their\nchildren five minutes in as the movie itself. I mean, really\u0085not all\ncartoons are for kids. Much like not all adults should bear children.\n"},
{"review": "\nAstonishingly this R rated vulgar CGI adult cartoon is a lot better\nthan my initial low expectations I had of it.<br><br>In fact it really is some kind of rude, crude version of Toy Story with\nan anti-religious subtext as food products in the supermarket come\nalive, waiting to be selected by humans but not realising that a worse\nfate awaits them. They will be cooked and eaten.<br><br>The film starts with a Disney lite song (written by Alan Menken) and is\nabout a hot dog who falls in love with the attractive hot dog bun, just\nthe right fit for him and once he discovers the truth he needs to get\nback to the supermarket and warn the others of what life outside the\nsupermarket really is like. There is another product whose nozzle was\ndamaged that goes after the hot dog as he blames him for his deformity.<br><br>The makers play with stereotypes such as the Jewish Bagel, all calm and\npacifist and the Arab Lavash being arrogant and rather old fashioned\nbut honourable underneath. You have the German beers who are horrible\nto the juice.<br><br>There is a sexy taco who also has the hots for the hot dog bun but that\nmeans a same sex relationship which is taboo. However the film ends\nwith a literal food orgy, straight, bi, gay.\n"},
{"review": "\nHow many R rated animated films have you seen? This is not a hentai,\nbut the Hollywood's rare animated-adult-comedy. Most of the big names\nare here, especially the young generation. The film took me by a\nsurprise. I did not know when it was made and what its genre, but the\nposters made me very curious the with double meaning punchlines. It was\na silly story, something like a parody of Pixar's 'Toy Story', but a\nvery enjoyable film as it is a rare product.<br><br>If you check the last two decade's records, the animation films tore\napart the live-action films in the box office clash. It is shocking,\nbut the fact that animations make good revenue. This film is a trend\nsetter in animation genre that targets the adult audience. Like\nHollywood found its counterpart from the Japanese hentai. It just cost\nonly $20 million to make and the production quality was not very\nstandard, but acceptable. Hope there will be more like this in the\nfuture, but I would seek a sequel for this.<br><br>Seth Rogen was the main man behind this film. The rest of the cast too\nwas good. Nothing but theirs voice lending made all the difference,\nespecially you would know who were who, while a watch, that kind of\nfamiliar it was. The story of supermarket products from all the\ncategories who fight for their freedom.<br><br>I really enjoyed, it was short too, as well as a fast narration with\nsome good adult jokes. There are a couple of negatives about it, like\nthe first one was there's no innovation in it, like it is very\nfamiliar, but a different kind of comedy. And the next one was all the\ncharacters, I mean the supermarket products are American. So if you are\na non-American, nearly 90 per cent you won't get what those items are.\nThe adults should watch this, because I don't know when you will get\nanother one like this in the future. So I definitely favour it.<br><br>7/10\n"},
{"review": "\nThis is the worst animated movie ever! I am huge fan of animated movies\nand i believe animated movies always comes with a message and if not\nthen at least they make you feel good. But this one is nothing but a\nhomemade video of a husband and wife abusing each other every minute.\nThe plot is not impressive at all. The movie revolves around how a\nsausage tries to get back his love - a bun with a fat ass and telling\nthe living food items in the supermarket that gods (humans) kill them\nand not cherish them or play with them.<br><br>Altogether not even a single watch movie. Avoid it! Caution : DO NOT\nWATCH WITH KIDS!\n"},
{"review": "\nSausage Party is one of those \"comedies\" which extend their only trick\nto 90 minutes, which are approximately 80 more than the ones its rancid\npremise would justify: the articles we buy at the supermarket can\nspeak, aspire to be sexually active and speak mostly saying rudeness.\nUnfortunately, I never laughed while I was watching Sausage Party,\nwhose only ambition is challenging the spectator with sadism, sexual\nallusions and political incorrection. The problems is that, if we\nextract the vulgarity, the only thing we have is a horrible copy of Toy\nStory (Food has secret lives!) with an awful production design and poor\nanimation. One of the very few positive things I can say about this\npiece of junk is Kristen Wiig's voice work; despite her horrible\ndialogues and null characterization, she managed to bring some\npersonality to her character. In conclusion, I didn't hate Sausage\nParty because of its constant vulgarity. I hated it because I found it\nunfunny and irritating. If you want to watch good animated comedies\n\"for adults\", I recommend you Team America: World Police or South Park:\nBigger, Longer and Uncut.\n"},
{"review": "\nNot funny.<br><br>Those are the two words that I would sum up Sausage Party with. No\nmatter what your sense of humor is, there is no WAY that anybody could\nfind this stuff funny, and yet, it has an 83% on Rotten Tomatoes. <br><br>Wow.<br><br>I thought every would hop off the it's-funny-because-I'm-baked-Seth\nRogen-train after the profoundly stupid and unfunny The Interview. <br><br>But no, and were probably gonna get another one of these half-baked (ha\nha) \"smart\" stoner comedies.<br><br>So, right off the bat, Sausage Party is annoying, with a screechy,\nfaux-intelligent take on the extravagant musical numbers prevalent in\nmost other (better) animated movies.<br><br>The commentary on religion is so ham-fisted, unintelligent and\nREPETITIVE, that the movie begins to feel like a propaganda piece for\natheism. <br><br>Oh, yea and Seth, just a thought, swearing is fine and can sometimes\nwork to elevate the humor in other (better) comedies, but the joke\ncan't just be the swearing itself. You know that right?...Seth?<br><br>The only time I actually began to genuinely chuckle was the food-orgy\nscene, but still, it was a cheap-laughs scene. If what would be a minor\nsight gag in other (better) comedies is the highlight of your movie,\nthen your kind of screwed.<br><br>It's kind of sad actually, to see Seth Rogen sacrifice his talent on\ndumpster-fires like \"The Interview\" and now this. I thought his\nmeta-comedy \"This Is the End\" was pretty funny, and I thought 2009's\n\"Observe and Report\" was unusually dark, brutal and depressing in an\noriginal way (but then again, it's coming from the co-creater of\n\"Eastbound &amp; Down\"). <br><br>Final thoughts: It's awful and unbearable, unless, of course, your\nhate-watching it. Then you'll relish every moment.\n"},
{"review": "\n(Sorry for my bad English) For the real..<br><br>HOW IS POSSIBLE TO ALLOW SUCK MOVIES TO GO OUT ?? The only thing that\nmovie want to show except the propaganda things about god e.t.c.. is\nthat the purpose of people are only the sex... nothing else matter..\nthere is no family.. there is no ethos.. there is no nothing..<br><br>The message want to pass to our childless is that the drugs is not\nbad.. u can use them.. and that there is not other thing in your life\nexcept sex.. not just sex... orgy's e.t.c...<br><br>ITS UNBELIEVABLE that there is suck people who think that way... PLEASE\nREMOVE THAT GARBAGE MOVIE FROM THE IMDb!!\n"},
{"review": "\nHow can this even be allowed? sick and twisted.. The end sequence is\nhorribly pornographic.. Without giving too much of details, I would\ndefinitely ask you not to watch this sick movie.. Watch out for your\nkids.. A sausage shaped like a penis and a bun shaped like a @%#$ with\nthe end of it turning into an orgy????? What kind of distasteful\ngarbage is this? the twisted ideas are too psychotic to show to\nanyone.. This should be banned!! Basically this shows you how to be\nchaotic, disrespect everyone's beliefs, live a pointless life, follow\nSatanist rituals of having orgies and not caring for anything... But\nagain this kind of film will further degrade the societies..\n"},
{"review": "\nIs a great movie but it can go beyond limits for some people. You\nreally need to be a smart, easy going person, to enjoy this movie. BUT\nif you are the kind of person that hates free economy, free border\nworld, free way of think, gay relationships, god not exist idea, porn,\netc. Then Please do not see this movie, you will feel offended. <br><br>Adult well done movie, with many good jokes. The movie trap me off\nguard and I was amazingly shocked when I start to see all the sex\ncontent, the idea of paradise, god, etc. Please see this movie if you\nhave an open mind, if you enjoy sexual content, if you are open to\nthink different, if you think humankind is divided by stupid racist,\nreligions, old fashion ideas.<br><br>Good Movie.\n"},
{"review": "\nWithin the first few minutes of the film, I cannot describe how bored\nto death I was of this film. It's unfunny sex jokes, racial\nstereotyping, religion bashing, homophobia, racism, is all what makes\nthis movies an utterly pointless and sad excuse of a film to watch...\nWell, unless your a 16 year old that smokes weed a lot and says the \"F\nword\" a lot. Now, don't get me wrong, I'm a big fan of all Seth Roger's\nmovies, but this is just garbage. I even read somewhere online that\nSeth Rogen is even considering making a Sausage Party 2. And if Seth is\nreading this, don't do it, man. This movie is going to bring your\ncareer downhill into a pile of mud and horse crap. You will become the\nAdam Sandler of comedy and that's a sad thing to say considering the\nfact that you've had many great movies. Don't let this happen, Seth.\nYour better than this!\n"},
{"review": "\nWhen I first saw the trailer, I thought \"Finally! They're bringing back\nadult animation to the mainstream! Just like Ralph Bakshi did in the\n70s!\"<br><br>The scene that got everyone sold in the trailer, when the potato gets\nshaved and boiled and the baby carrots get eaten in the film,\nunfortunately, doesn't come until later. Before that, there's a whole\nlot of stuff that may put several people off.<br><br>The film uses too many f bombs, explicit jabs at political satire and\nold jokes that will probably make you groan rather than laugh. Though\nthis is a film clearly for adults, it feels juvenile. <br><br>There were, however quite a few laugh out loud moments, but not many.\nThe orgy scene at the end was hilarious, scathingly crude and insane.\nI've heard people complain about the racist and sexist jokes in the\nfilm, and yes, they are there, but the people who will be offended the\nmost are the religious ones.<br><br>It's anti-Pixar, anti religious, anti-PC, pro-stoner, pro-sex and more.\nBut unfortunately it doesn't really carry out a powerful enough message\nas the Bakshi films, Meet The Feebles or South Park. For a project of\nthis caliber, I think it could have left a few things out, and a bit\nmore satirical depth.\n"},
{"review": "\nWish I had read the reviews or something before I tried to watch this\nabomination of a movie. I usually like Seth Rogen but as a victim of\nsexual assault for years and having been trying to treat my Post\ntraumatic stress disorder for my entire child and adult life, this\nmovie was an insult, I don't understand how sexual assault is funny or\nhow people can reenact it for entertainment. I understand that it is\njust cartoons but that doesn't change the meaning of the action. I was\nexcited, at first, to watch Seth Rogan's new movie because he has had\nsome funny ones but this one was very cruel and seemed to glorify some\nless than reputable actions. Had to turn off the movie and I'm pretty\nsure I'm not the only one. Please no rude comments, it took a lot for\nme to post this.\n"},
{"review": "\nThis is a really bad movie you should avoid. The animation is good,\nwhich got me interested in the movie in the first place but the jokes\nand gags are really flat and non creative in any way. Im not sure how\nmuch weed they smoked to write the script but seems more than a human\nis capable to handle. I expected the typical Seth Rogen style which\nfrom time to time make you laugh with some gag, but this movie just\nanother level of stupidity. <br><br>NOT SUITABLE FOR KIDS!!!!! ... and not suitable for smart people\neither.<br><br>AVOID AVOID AVOID!<br><br>Im surprised by the high score on IMDb. Must be just fake people who\ngot paid to promote it. Don't fall for it!\n"},
{"review": "\nIf you're in to crude disgusting sexual jokes and innuendos with every\nsecond word being an f-bomb followed by any other curse word, this\nmovie is perfect for you. The jokes remind me of when a young child is\nlearning how to make jokes for the first time, with an awkward sexual\ninnuendo they didn't yet know the meaning of. I'm sure the actors had\nfun in-studio and shared a ton of laughs while making this film, but it\nwas poorly reflected to the audience. I had a feeling that this movie\nwas going to be bad from the previews, but I had no idea it would be\nthis rough. I couldn't get through the first few minutes of this movie\n- I was more interested in counting the number of swear words!<br><br>This is my first review here on IMDb, but I just couldn't let this one\npass me by. <br><br>Volitile piece of crap movie. Avoid at all cost.\n"},
{"review": "\nI truly regret we wasted our time and money on this vulgar, pointless\nhour and a half of idiocy. If this had been cast with real humans, it\nwould have been rated X. Even though it was animated, the blatant\nsexual acts should have required a different rating than R. It is so\ndisappointing that movies like this don't come with a warning label\nthat those with any degree of intellect should refrain from viewing. It\nwas obviously strained to push an agenda. This review will never be\nable to describe what could have been a funny movie; it was nothing but\na series of expletiives and filthy innuendos. Are there Hollywood\nJackass Awards? There should be and this would be the clear winner.\n"},
{"review": "\nI can't believe someone would spend all that money to produce this\nmovie. I can't believe anyone would accept the script for this movie. I\ncan't believe no one is stopping them for making this movie. &amp; I can't\nbelieve myself for actually being interested to this movie (thank you\nmovie trailer, which is the ONLY best part of this movie).<br><br>I stopped watching after the first 20 minutes, me &amp; my boyfriend were\nflipping our heads \"what is this..?? what movie is this..??!?\" Then 2\ndays later, I thought I can still find \"hope\" by trying (very hard) to\nwatch it again until the end, alone (yeah, I was soooo embarrassed that\nI ever suggested this movie). OH HOW I REGRET IT.<br><br>CAN SOMEBODY PLEASE STOP SETH ROGEN WHEN HE TRIES TO MAKE ANY OTHER\nMOVIES?!? just tell him, \"Stop trying to make that happen. It's NOT\ngoing to happen!\"<br><br>I want my 110 minutes back! (yeah, 20+90 minutes, dear God please cure\nme) **Don't watch this with kids!!!! they'll need the Satan himself to\ncleanse their memories if they ever watched this.\n"},
{"review": "\nThis movie is based on an interesting and imaginative idea. The story\nis not for adults. It is a simple children's story. Yet, you cannot\nshow this movie to children because there is too much profanity within\ntime spans of thirty seconds throughout the whole movie. I did not\nwatch until the end. It was a waste of time to feed myself with such\ndecadent garbage. I understand why America is quickly falling. This is\nthe kind of movie that people want to see. Sadly it reflects the\nsociety. Would you take your grandma to see this??? What about your\nlittle children??? Why not show it in Church??? That is why people are\nmiserable. This was a sad movie in my opinion.\n"},
{"review": "\nAlmost all the reviews I read that were bad claim that the film was\n\"totally stupid\". Yes there is some profanity in the movie, but what I\nloved most about the movie were it's hilarious references to religion\nand human life in general. I feel like half the audience didn't get\nthose comparisons... Of course the most hilarious part is at the end of\nthe movie. You will know which part I mean, when you watch it. This\nscene will go down in movie history as one of the most memorable scenes\never! (And it also helps if you had some experiences with drugs or a\nlot of knowledge about drugs. That way you can relate much better to\nthe drug scenes.)\n"},
{"review": "\nNot funny. Not clever. Yes, I think it's politics are heinous. It's\nreason for existence is to promote atheism and hedonism. But if I can't\ntake it seriously on a surface level because it is so not funny, I\ncertainly can't take it seriously as a \"message movie.\" It is sloppy,\ndim, obvious, contrived, juvenile, stupid and...NOT FUNNY. OH...dude\nsmokes weed. Hahaha. OH...weenies say \"f@ck\" and \"c@nt\" how\nprovocative! Spare me. It's an insessant barrage of cursing. With not a\nsingle clever delivery. The South Park movie was clever. They found new\nways to curse. It was hysterical. Just slinging the F Bomb incessantly\nis NOT funny. It gets old really quickly. The douche should, in theory,\nbe funny. It's not. It's all just waaaay to obvious. OHHH I'm gonna get\nup in there! Really? That's the best joke you can crack (crack! Haha!!)\nSave your money. Watch Sharknado.\n"},
{"review": "\nThe concept of giving supermarket produce personalities sounded good,\nmakes you think of 'Toy Story' but this film is pitched to an adult\naudience.<br><br>The trailer is also funny but these are the only bits worth watching,\nat least the bits that could be shown without offending the majority of\nanother audience.<br><br>We booked with relatively high expectations of humour with (perhaps) a\ncouple of moral messages, again Toy Story comes to mind (how wrong was\nI) If your idea of funny is unnecessary swearing then (unfortunately)\nthis film is definitely for you. It seemed like every other word\ncontained the 'F' word, after a while this wears thin and then you\nbegin to realize it was being used instead of clever humour. I think I\nprobably smiled 2-3 times.<br><br>For me there was so much swearing it spoilt any developing 'plot' I\nwouldn't recommend to anyone, whether 15 years old or older\n"},
{"review": "\nHonestly this movie was so sick. I watched the trailer, I knew there\nwould be cussing and perversion-- but there was TOO much of it. I kid\nyou not, 99% of every sentence in this film had an overuse of cuss\nwords. The perversion was completely overdone and out of hand. It\nwasn't funny, just flat out disgusting. Save your money and don't watch\nit in theaters or on Netflix, just watch it online for free when it's\nout if you really want to see it... but I and there other 6 friends I\nwent to see it with highly recommend you don't. The stuff they promote\nis sick. So corrupt. The first few minutes of the film you're fine, but\nget a little startled at the amount of cussing you hear. People who\nnormally cuss don't even cuss that much, so it wasn't realistic. 20\nminutes in and you're in utter shock by what you see. As the movie\ncontinues to progress, you'll find yourself horrified and struck by\ndisbelief. It's awkward and so WRONG-- all of it! I mean you see rape\nhere! Murder! Threesomes! Drug abuse! And let's not even get started\nabout the blasphemy and complete disregard of faith in God. I walked\nout. I couldn't finish watching and nor did I want to. I deeply regret\nsupporting this film by paying for it. It's offensive and dehumanizing.\n"},
{"review": "\nUnless watching animated characters talk over the top raunchy makes you\nlaugh. Personally, I found it repulsing! My $10 admission would have\nbeen better spent on smoking crack! I went to see this movie with five\nother people. Three of them demanded their money back. I wish I would\nhave done the same! There is supposed to be ten lines in this review\nbut this movie is not worthy of ten lines. abhorrent, abominable,\nappalling, awful, offensive, disgusting, distasteful, dreadful, evil,\nfoul, fulsome, gross, hideous, horrendous, horrible, horrid, loathsome,\nnasty, nauseating, nauseous, noisome, noxious, obnoxious, obscene,\nodious, rancid, repellent, repugnant, repulsive, revolting, scandalous,\nshocking, sickening, ugly, demoralizing, horrible, dreadful,\nhorrendous, appalling, deplorable, disgusting. Need I say more?\n"},
{"review": "\nIm going to keep this review simple. <br><br>If you think a half assed pixar rip off with swearing every 3 seconds,\npenis and vagina jokes, and the occasional anti-Muslim slur is ground\nbreaking adult comedy, then you will love this immature moronic bro-\nflick. <br><br>For anyone else with half a brain, you will do what i did, and turn it\noff after 30 minutes. <br><br>Im only giving this a 2 because the Saving Private Ryan homage was\npretty clever. Pity that only made up 1 minute of its runtime.<br><br>This film feels like it was written by 12 year olds trying to sound\ncool.\n"},
{"review": "\nI knew going into this movie that was an animated film specifically for\nadults. That being said I knew the language would be questionable. But\nthis movie was over the top with profanity. If the foul language was\nnot enough the humor was very offensive. I walked out of the theater\nfeeling as if every race and religion should be offended. I mean it\nliterally referenced the Holocaust in the first 40 seconds... The jokes\nwere the types of jokes middle school aged children make and they were\nreally not that funny. The last scene of the film was not needed as\nwell. In fact it was quite awkward for everyone in the theater. Nothing\nlike a group of adults watching an orgy of our favorite foods. All in\nall, I do not recommend this movie to any one. Do something better with\nyour time. See a different movie.\n"}
]