[
{"review": "\n\nThank Goodness I didn't read the reviews posted before I saw the\nfilm!!\nMost reviews (including ones on this site) will tell you waaayyyy too much\nabout the movie, and that's just plain frustrating.  But, as an avid\ncinephile, I promise not to do the same.<br><br>Memento is one of those pictures that will have you sitting in the theater\nafter the lights come up so you can talk to everyone else about what they\nthought of the movie.  This is a highly intelligent and original brain\nteaser that will have you guessing from beginning to end, and even\nafterwards.  The story and the direction are the best I've seen so far this\nyear, and it deserves all the kudos it gets.<br><br>Plainly put, the film tells the story of Leonard Shelby:  a man who lost his\nshort term memory in an assault where his wife was raped and murdered;  now\nhe's looking for the killer, despite his handicap.  Simple as that.  You\ndon't need to know anymore.<br><br>The film is constructed and told in such a way that you are\nconstantly\nput into the shoes of Leonard Shelby, beautifully played by Guy\nPierce.\nCarrie-Ann Moss gives an equally mysterious and complex performance.  This\nfilm is well-made all the way around--from the direction, to the editing,\nand especially the unique story that is rarely found in Hollywood these\ndays.  Four Stars!<br><br>This review may have been a little dry on the details, but go see the\nmovie--you'll be thanking me later.<br><br>PS: Only go to the official website AFTER you've seen the movie.  It too\nwill give too much away.  Afterwards, though, go and look at it--it's pretty\nimpressive.<br><br>\n"},
{"review": "\n\nSo the \"innovative\" concept of filming out of sequence has been cliche for\nat least a few years now, but here's a film that makes it work far better\nthan its been shown in a while.<br><br>Having read the reviews and talked to others who saw it, I thought that I'd\ngo into the movie figuring everything out right away and declaring the\nconcept unworkable.  I couldn't be further from the truth.  This movie does\nthings to your head that are illegal in some countries.  Portrayed (for all\nintents and purposes) backwards, it forces you to think in the same way that\nour lead character, Leonard Shelby (Guy Pearce being more brilliant than\nusual) does.  Suffering from a condition that renders him unable to remember\nanything for more than a few minutes, he is searching for the man who raped\nand killed his wife.  Since each seen lasts no more than 15 minutes before\njumping back to the what happened before that, our perceptions are shattered\nin the same way.<br><br>Carrie-Anne Moss and Joe Pantoliano (both of The Matrix) put in great\nperformances that leave you guessing; simultaneously endearing and\nrevolting.<br><br>Overall I left the film trying to figure out what was what, and I'm still\nnot sure.  This film noir concept shouldn't work, but it does so\nwonderfully.\n"},
{"review": "\n\nA man with no short term memory tries to solve a murder.  The scenes in the\nmovie are played in reverse.  Sounds like yet another run of the mill comedy\nbut in reality is one of the best suspense/dramas I've seen in\nyears.<br><br>While some may claim showing the scenes in reverse is just an annoying trick\nto make a simple plot confusing and add a plethora of twists, I\nwholeheartedly disagree.  Any good story teller knows it's not what you say,\nbut how you say it.<br><br>By playing the scenes in reverse you experience the confusion Lenny\nundergoes throughout the film.  Showing some of the scenes in chronological\norder (BTW, the use of B&amp;W instead of color to make the time distinction was\ningenious) creates suspense which builds as the two timelines converge.  The\nsomewhat rushed pace (compared to a written format) doesn't give you enough\ntime to adequately analyze the events during the movie.  This has two\nadvantages: firstly you're going to talk about it after you leave the\ntheater adding to experience immensely,   and secondly  you don't have time\nto think about what has happened (will happen) so you're experience better\nfollows that of Lenny.<br><br>While many might find the movie rather confusing, it flows wonderfully for\nanyone familiar with writing styles that constantly jump around a timeline\n(e.g. Catch 22).\n"},
{"review": "\n\nYes, it's true.  The entire movie is based on a gimmick.  However, I\nhonestly feel that this does not cheapen the picture in the slightest bit.\nI loved every scene; discovering information as our lead character\ndiscovered it. It demands a second and third viewing, as there are many\nsubtleties and quick flashes that may not be picked up on the first time\naround.  Its one of the most original films ever made, and for people who\nscoff at the concept of not having a short-term memory, it actually is a\nreal condition. Watch this movie. And, please pay attention. The\nperformances are wonderful, and its structured magnificently.\n\n"},
{"review": "\n\nIf you hate reality-based film-making this is awful. If you hate Film Noir,\nthis is ugly. But for me, Nolan has convinced me he is one of the most\nimportant directors out there. I was even thinking, \"It must be easy to edit\na movie so that it's all backwards.\" But it's not, it's not any easier - and\nhe leaves you straining and watching from scene to scene, searching for the\ntruth. Even the final revelation will affect each viewer and leaves them\nsearching for their own \"ultimate truth\" according to their own experience.<br><br>Most people comment about manipulation in connection with this movie, but\nafter watching the last scene, I'm convinced that manipulation is not the\nmain theme at all.\nI don't want to spoil it for you, but the basis of unfolding backwards in\ntime is that you are enlisted to scrutinize the film trying to discover some\nset of motivations behind each character's actions later in time that makes\nsense. If you think you would enjoy this sort of puzzle, I think you will\nenjoy this excellently crafted film.\n"},
{"review": "\n\nIncredible, riveting and powerful.  What else could I say?  This movie has\nall of the qualities of classic film noir as well as the magnitude of an\noriginal, unique concept that has been tried and tired before but works\nhere.  <br><br>Guy Pearce has been underrated for years (just think back now to Priscilla\nand can you believe this is the same guy) and finally might get the\nrecognition here that was at least well-deserved of him back for LA\nConfidential.  Powerful perfomances, well developed story with suspensful\nbuildup of what our main character pieces together little by little makes\nthis a must see.<br><br>Easily in my top 100 of all time.\n"},
{"review": "\n\nI saw \"Memento\" in the early afternoon, a fact for which I am thankful. \nWhy?  Because it then proceeded to dominate the majority of my thoughts for\nthe rest of the day.  That night I lay in bed, tossing and turning, my mind\ntrying to wrap itself around the story, and I absolutely could not GO TO\nSLEEP!  <br><br>I finally just gave up on sleep, got up around midnight, and watched\n\"Election\" to cleanse my palate.  Then I went back to bed and starting\ncontemplating \"Memento\" AGAIN.  Finally, out of sheer exhaustion, I went to\nsleep.<br><br>This is a movie that gets in your head and will not get out until you figure\nit all out.  And that can only be done with extensive internet research. \nReading \"Memento Mori\", the short story upon which the movie is \"based\"\nhelped, too.<br><br>\"Memento\" is nothing short of a phenomenon.  And a brilliant one at\nthat.\n"},
{"review": "\nIf the director of this independent film tried to make us feel really\nconfused, like the main character, he did it wonderfully. There are\nonly a few movies like this one, the kind of movies that makes you pay\nattention to every minute of it. Obviously that doesn't work all the\ntime, but this case is the exception. Really well directed with a\nwonderful photography and excellent cast. The main actors' performances\nare great. We really root for the guy as we hate the ones who try to\ntake advantage of him.<br><br>Original films like this one always stand out. Perhaps it didn't caught\nmuch attention at first but now it is in an important position at the\nIMDb top 250 and that means that most the people recognize great movies\nwhen they see them.<br><br>As I said before, this movie is a little confusing because it runs\nbackwards while the black and white scenes run in chronological order.\nBut that wasn't a cheap trick to make the movie more \"intelectual\", it\nwas its strength. A rare film that shouldn't be missed.\n"},
{"review": "\nBefore I rant on the absurdity of Memento being currently ranked #14 on\nthe Top 250 list, I'll say what I liked about it. Yes, it was an\nextremely entertaining, original and well-done all around film. The\nacting was first rate, the story decent, and the film makers did a\ngreat job putting it all together.<br><br>However, I may be crazy, and I'm sure the \"film snobs\" will grit their\nteeth at this, but at the end of the day, isn't Memento just a gimmick?\nA water cooler novelty? I mean, basically they took a slightly above\naverage plot and did something new, and granted inventive, by editing\nthe film structure in reverse. For the most part, the movie is pretty\nmuch shown from end to beginning. Yes, they did enough to make things\nmake sense in between, but essentially it was an exercise in \"hey,\nlet's make a movie, and then edit it so everyone will talk about that\nreverse movie\".<br><br>I don't care what anyone says. That's the bottom line, period. I've\ntalked with plenty of fellow movie buffs who I consider to be\nreasonably intelligent, and some are even the snob-types mentioned\nabove. And none of us can figure out what all the fuss is about. Maybe\nwe ain't that smart.<br><br>I hate to get into comparisons, because it's difficult to compare\ndifferent types of movies. But be honest, if you can tell me with a\nstraight face that Memento is an overall better film than \"Apocalypse\nNow\", \"A Clockwork Orange\", \"Pulp Fiction\", \"Goodfellas\", \"Fight Club\",\n\"Jaws\", \"Chinatown\", \"Raiders of The Lost Ark\", \"American Beauty\",\n\"Silence of the Lambs\" and a large chunk of the other 230 films ranked\nbelow it, than you just need to sit back, take a deep breath, reel in\nthat massive \"I'm a nonconformist art-house movie aficionado\" thing and\nget a reality check. It was a good movie, but it wasn't that good.\n"},
{"review": "\nI was totally blown away by this movie. I think this is a total\nmasterpiece. I wish I could have thought of something as ingenious as\nthis. I recommend it to anyone that enjoys a good mystery, acting,\nediting, directing, plot. I can and have watched it over and over\nagain. This should have won for best picture the year it came out. Go\nout and rent it. Go and watch it. Go out and buy it. you will not be\ndisappointed. This movie is about a guy who loses his short term memory\nand tries to hunt down his wife's rapist and killer. I won't say\nanything else. It is a masterpiece, thought not perfect it probably\nshould be about a 9.8 on the IMDb but I'll give it a 10 out of 10.\n"},
{"review": "\n\nAnother cleverly done example of backwards story telling, from the Pulp\nFiction school..  Unlike Pulp Fiction, the backwards element got annoying\nand tiresome fast in this film.  It certainly was a creepy film, maybe even\naffecting (time will tell, since I just watched it), but I didn't find it\nall that enjoyable.  The ending was unsatisfying for me, after sitting\nthrough the previous hour and fifty minutes (yes, I found myself watching\nthe clock to count down when it would wrap up).  I suppose I could get a bit\nmore out of it with repeated watchings, but I don't really care enough to\nbother with that.  I would give this one a 5/10, although few of you will\nprobably agree with me so let the flames begin!\n"},
{"review": "\nI saw this movie around five years ago so you'll have to forgive me if\nyou're a fan. The truth is I was not blown away by this 'diabolical\nthriller'. Sure it leaves you scratching your head but is that\nnecessarily a good thing? It may be a 'super intelligent' movie but\nthat does not necessarily make it good art. I remember the acting as\nbeing semi-wooden, the production values low, and the dialog sparse. Is\nit a confusing movie? Absolutely. Will it makexsense if you watch it a\ndozen times? Probably. But I still would not count this as one of the\ntop 250 movies of all time. That said, my hat off to a truly original\nscript\n"},
{"review": "\nI just don't understand what it is that makes this movie so popular,\nespecially with male viewers, I mean 8.6? Come on, what is that?! ...<br><br>Leonard suffers from short-term memory loss and tracks back using notes\nand body parts to find the man who killed his wife. On his journey he\nencounters a number of people who he has to be able to assess at first\nsight because of his deficiency.<br><br>The acting by Guy Pearce is very convincing and even appealing but the\nstory however is most of the time way too irritating because you\nconstantly have to backtrack yourself in order to completely understand\nwhat's going on. I like flashbacks in movies but a film that turns out\nto be one big flashback by itself may be a little too demanding for me.\nI guess this is just not my kind of entertainment ...\n"},
{"review": "\n\nJust a deception package! In NO WAY this picture is only half as\nintelligent\nas it pretends to be. A quite good idea in deed, but after a promising\nstart\nit gets  a heavy-handed, mechanical and  predictable bore and a pure\nletdown, especially because it stays beyond the means. And sorry folks: It\nreally is no achievement to UNDERSTAND this movie -but it sure is to to\nkeep\nup till the end. \n"},
{"review": "\nIt eludes me how this movie has gotten such high ratings and even two\nOscar nominations.<br><br>This movie is for the most part mind-boggling boring, with endless\nrepetitive sequences of how our main character writes notes, tries to\nremember certain events or persons. This goes on for about 80% of the\nmovie in an desperate attempt to create \"suspense\"...but it gets\ntiresome. The end admittedly had a moderate surprising twist...however,\nfrom a certain point of view, the end was also predictable and,\nsomehow, disappointing. The only positive thing about the movie is a\ngood performance by Carrie Ann Moss, however the main character did not\nconvince me, neither did the plot. (If there was one, besides of a\nrepetitive line-up of the character's confusion and attempts by him to\npuzzle together memories.) This movie is breathtakingly boring and the\nending *extremely* underwhelming. One of the movies which is praised\nabout all over, you watch it - and it turns out a huge disappointment.\n"},
{"review": "\n\nThere are holes in the plot of this movie that should prevent it from\nreceiving\nthe ranking it has in this database (1 of the top 10 all time best movies).\nIn the\nend, the characters are not sympathetic or interesting enough to warrant\nthe\ntreatment they get in the film. I do not think this is a must see movie for\nanyone.\n"},
{"review": "\n\nVery little substance in this movie, with the gimmick (very well done) of\ntelling the story in non-continuous sequences and almost in reverse\norder.\nBut it is a frustrating and non-rewarding movie that cheats the audience at\nevery step:  a fictitious illness, characters that do things more to startle\nthe audience rather than for a realistic reason, and an ending that is way\ntoo predictable and really silly at the same time.\nBasically, if you told the movie in a normal fashion, it would show more\nholes than a certain cheese I am fond of.\n"},
{"review": "\n\nWhat I generally look for in a good movie is character development.  If\nnothing changes in the characters' personalities, I have trouble enjoying\nthe film, as it loses a certain sense of realism.  One method of character\ndevelopment that I particularly enjoy is that of the \"revealing\" method,\nfinding out more about a person's personality by being shown information. \nMany people mention The Usual Suspects when reviewing Memento and I can't\nhelp using it as well.  This method of character development is used very\nwell in that movie also, in the twist at the end.  I felt that Leonard's\ncharacter developed extremely well in that we were shown bits of his\npersonality at a time and it was not until the end that we found out what he\nwas truly all about.  *Spoiler comment at end*<br><br>This film, with its memory-troubled main character, reminded me of a\nsub-plot in the Kurt Vonnegut novel, The Sirens of Titan, in which the main\nCharacter, Malachi Constant, must endure repetitive memory wipes, only\nknowing what is going on by re-reading a series of notes that he writes to\nhimself.<br><br>I was going to mention something else about Memento, but I forgot it.  Maybe\nI should have written myself a note.<br><br>***<br><br>***<br><br>***<br><br>***Spoiler comment below***<br><br>***<br><br>I really enjoyed the sequence of shots in which Leonard realizes that he's\ncrazy and consciously decides to prolong his fictitious search by leaving\nhimself a note that is, in effect, a lie.  The idea of lying to oneself\nbrings up entirely new issues of paranoia that I thoroughly\ndig.<br><br>Will have to count next time i see it, the number of times that Teddy tries\nto get the keys to Leonard's car.  I think it may be as many as\nsix.<br><br>small plot hole, the Jaguar's car alarm goes off when the window is shot,\nbut the alarm had not been armed.<br><br>***<br><br>***<br><br>***End Spoiler***<br><br>***<br><br>***\n"},
{"review": "\nI write this after having to write a bad review of Nolan's \"batman\nBegins.\" \"Memento\". after more than seven years, remains the most\nimportant English language film of the 21st century. Into it, Nolan\npours all the fundamental problems of film, and the fundamental\nproblems of memory that gave rise to film in the first place.<br><br>It takes about four viewings to get any grip on this film - yet none of\nthese viewings feel wasted in any way, as though the director has\nplayed tricks on us - on the contrary, it is the film's bald-face\nhonesty which leaves us in despair of ever getting just the right\nhandle on all the details and the characters.<br><br>Its hard to understand how Nolan could have betrayed himself and his\nvision after this film, by selling out to Hollywood's highest bidders -\nhopefully, he'll recover and give us the Christopher Nolan film we\nshould expect after seeing this one.<br><br>But in any event, this remains one of the most important films ever\nmade - brilliantly written, filmed, acted, edited - a necessary\ncompanion piece to Welles' \"Citizen Kane\" or Eisenstein's \"Potemkin\" -\nhopefully, Christopher Nolan will actually direct another film some\nday....\n"},
{"review": "\nMemento sees Guy Pearce play Leonard Shelby, a man with no short term\nmemory, on a search for his wife's killer in a film which is\nintelligent, engaging, well thought out, and sometimes, even funny. <br><br>Memento demands your full concentration, and its backwards development\nis a stroke of genius, placing you in the same situation as Leonard;\nyou see what he sees, and aside from small clues, very little else.\nThis way of engaging its audience is what makes Memento special, as it\ndraws you into the plot and Leonard's complex situation without leaving\nyou lost amidst the chronology or bogged down in little clues. This is\nalso helped by Guy Pearce's performance; he remains likable for most of\nthe film, his little jokes and his honesty helping you side with him,\nbut he also shows evidence of a darker side, especially towards the end\n(the beginning?), as Teddy (Pantoliano) plants the seed of doubt in his\nmind.<br><br>Basically, Memento is a very good film, an intelligent, engaging\nstoryline that keeps you interested even after it ends.\n"},
{"review": "\nThe novelty of this movie is supposed to be the shuffled time-line and\nslowly revealed plot elements. But, neither improve the mildly\nlackluster story. Rather, they make it an agonizing waste of time.<br><br>Movies are meant to entertain, or at the very least, to educate. This\nsnoozer does neither. It seems to me merely an exercise in\nhipper-than-thou pretentiousness. And, so many of the high-ratings\ncoupled with reviews raving over how artistic and original the approach\nabsolutely confirm this by presuming that anyone who doesn't like\nMomento is somehow incapable of understanding the complexity. Rubbish\n(both the movie and the smug reviews). If anything, it is they who are\nincapable of seeing through the hype to know when they've been duped.<br><br>Yes, I hung in there for the entire movie... only to wish I'd ditched\nafter the first 10 or 15 minutes when I was first inclined to give up\non it. And, yes, I do know the difference between art and pretense.<br><br>Take my advice. If you reach the same impasse shortly into your\nviewing, BAIL! I give you my permission. You won't be missing a thing.\n"},
{"review": "\n\nMemento is far from an original concept and the plot closely resembles\nSwiss-cheese. It quite simply does not warrant the praise given it, which\nI\nsuspect is heavily weighted by the 15-21 male demographic (see Bottle\nRocket). The blatant contradictions presented by the sub-standard writing\nare conveniently covered with mind-numbing violence (as opposed to that\nwhich is stimulating, thereby justifying the waste of 90 minutes of my\nlife). Ooh! I have no memory; it must be a \"condition\"!<br><br>If you don't get it because it is so \"mind-blowing\", wait until you grow\nup\nand understand that being confused by the story doesn't indicate clever\nwriting. I can't stress enough, SAVE YOUR VOTE UNTIL PUBERTY IS OVER! At\nthe\nvery least, commit to a second viewing before casting! It is simply\nembarrassing to indicate that this movie is rated as #9 by US voting\nstandards (what are the French going to think?). It is going to lower the\nstandards of movies being produced worldwide!<br><br>Resist the temptation to fall into the pit of hype! Watch Groundhog Day\ninstead.\n\n"},
{"review": "\n\nRecipe for success in filmaking in the 00's. Write a dyslexic 20 minute\nshort story about a good looking tattoed idiot in a motel room. Shuffle\npages, go to Kinkos, make 300 copies, shuffle again, call Tarantino. Rake in\nthe dough.<br><br>I give this film credit for trying to be different, but the only thing it\nsucceeds in doing is being a monotonous bore. The votes for this dog are\nproof positive of the near complete dumbing down of this country...either\nthat or just another example of the \"Bandwagon\" Syndrome. Do any of you\npeople really know how to think for yourself anymore? Pitiful.\n"},
{"review": "\n\nThis movie has a nice idea that it stretches out too long. It's not a bad\nmovie, but knowing the ending and story takes all of the suspense and\nquestions of the movie. A counterexample would be Fight Club, where the\nending adds a real twist to the whole movie but dosen't spoil it for the\nnext time you view it, you just view it with different eyes, as Fight Club\nhas more to offer than the ending.<br><br>Some SPOILERS are ahead due to the nature of the movie. I don't think they\nwill spoil the movie totally for you, but they might lower your\nexpectations\ntowards this movie, and you might even decide not to spend money or\nprecious\ntime on it :<br><br>The movie is told backwards, so the viewer has no memory of what happened\n\"before\", like the protagonist. The plot has (in retrospect) some holes\nthat\ndon't get filled, mostly regarding Dodd, a seemingly key figure, who in\nthe\nend is completely insubstantial.<br><br>I expected a murder mystery movie bordering towards a film noir, but\nexcept\nfor the explanation at the films end (and thus, at the beginning of the\nstory), the story is completely banal. The story is climatic towards the\nend\nof the movie, but the end dosen't live up to the suspense that was built\nup\nduring the movie.<br><br>As Leonard has conditioned himself to operate on a few promises, he reacts\nto every situation in the same manner, which makes many scenes repetitive.\nPartly, this is necessary to demonstrate how he ticks, partly this is\nentertaining as the viewer already knows how Leonard will react in a\nscene,\nbut the whole concept is stretched too long like a running gag repeated\nsome\ntimes too often. The film would be better entertainment if it wasn't 2\nhours\nlong.\n"},
{"review": "\n\nA very manipulative movie that constantly tries to fool the audience.  It\nruns in reverse, but only halfway up the story line where everything that\nwent before is called into question.  The director is a David Lynch\nwannabe,\nbut the expostion is SLOW and BORING.\n"},
{"review": "\n\nFirst of all, this is not a horrible movie.  It does keep you mildly\ninterested.  But it has several, fatal flaws. <br><br>One reviewer mentioned that the film was too clever by half.  I totally\nconcur.  The film went out of its way to create something unique, and in the\nprocess lost the entire narrative structure.  So when it ends, you barely\neven know if it happened.  In fact, you don't know that it happened.  If\nLeonard was delusional about Sammy, then perhaps he was delusional about all\nthe characters in the movie.  The fact is, you will never\nknow.<br><br>The problem is, this doesn't make for a good film.  Good films are those\nwhere the narrative art is enhanced by the photography.  By this measure,\nthe movie fails, as the photography does almost nothing to tell the story,\nand Guy Pearce is as milquetoast a leading man as there is.  The fact is,\nthe film is about trying to put you in his shoes, to show you what Leonard\nmust have felt like living with no memory, but you end up feeling nothing at\nall because he is such a bland character actor.  <br><br>I would compare this film in some ways to Se7en--except that Se7en does a\nmuch better job telling the story (even if the ending wasn't at all\nsurprising).  The major difference is that you care about what happens to\nthe characters in Se7en.  There is no empathy with Leonard, partly because\nthe film never gives you the chance because it's too busy being\nclever.<br><br>Perhaps people will rate it highly, but it is definitely not a Citizen Kane\nor Casablanca, a movie where you can take it out and watch it over and over\nagain.  It's far too dismal for that.  It's more a movie like Resevoir Dogs,\nwhere you like the idea (and perhaps the execution), but the way the story\nis put together keeps it from being a classic.<br><br>3/10\n"},
{"review": "\n\nWhy didn't this idiot keep an organized journal instead of always shuffling\nfor small pieces of paper and pictures in misc. unorganized places, not to\nmention different rooms, when he knew he wouldn't remember anything come\ntomorrow? There was no way he should have been/could have been on the street\ndriving [not knowing where he came from or probably why he was going to\npoint B] let alone seriously be carrying a gun trying to fulfil a vengeance\ncorrectly. I'm lucky he didn't point the gun at me. A boring story told in\nforward so it had to be told sloppily and in reverse as a last ditch effort\nto be \"intellectually\" interesting. Save your time on this one. And ya, ya,\ndon't bother to tell me about the nuances of it being told in reverse it was\njust lackluster film.\n\n"},
{"review": "\nI heard many people say that 'Memento' is an exceptionally brilliant\nmovie which gave inspiration to our own local directors who took the\nbasic concept from it and made a very successful movie here. Now when I\nsee it, I am just wondering how come that it has occupied place in top\n250 IMDb rating. May be that I like movies with straight forward story\nthat is gripping and its narration flowing smoothly. It is all as\nconfusing and vague as the mind of the character played by Guy Pierce.\nIt is simply hard to find what he(the lead) did first and what he did\nlater. Whether he commits murder and drives away in car or first drives\nin and then murders or whether he commits the murder at all. It is\ntaxing on the mind of the viewer to watch the narration going back and\nforth and it is really tough to keep track of the story line. Many of\nmovies of this director demand certain level of IQ from the viewers to\nget to his style of narrative. I am very sorry to say that ,but for me,\nit does not seem worth the time I spent watching this movie.\n"},
{"review": "\nMemento is one of the most original, and stunning movies I have ever\nseen. Memento is close to an epic masterpiece. They take a simple plot,\nand mix it up with all these different chronologically strategies.\n(This time using several chronologically mixed scenes). One man wanting\nrevenge for those who killed and raped his wife, his memory the only\nthing stopping him. But Memento takes you through a journey of\nstrategy, notes, pictures, black-mail and surprises. It certainly lives\nup to the hype, and remains as Nolan's best movie. A guarantee I can\nalmost give to all viewers is that: they'll be things that seem a\nlittle mixed up after your first viewing, that's normal. I have watched\nMemento two times, closely and yet, still they're a few unanswered\nquestions. Memento delivers in all aspects, a intriguingly thriller\nwith an opinionated ending.\n"},
{"review": "\n\nif you are interested to explore another film about the<br><br>subjectiveness of 'memory'', check out this brilliant film from<br><br>China, Yangguang Canlan de Rizi (aka In the Heat of the Sun). <br><br>i tried to rewind the film and see how it would be like to watch a<br><br>film from the end to the beginning, i saw repetition, jumping editing<br><br>and this covers the incomplete storyline underneath.  it left with me<br><br>a terrible headache.  it is a hollow story, with shallow characters<br><br>which come from nowhere.   <br><br>i do not have a clue why it can be ranked #12 of the list.\n\n"},
{"review": "\n...and his brain. For example: Why on earth isn´t he using a dictaphone? You\nknow some sort of recording device!?<br><br>Spoilers: He can remember after all always to bring that camera and the\npictures. Why not record your impressions on tape like \"I parked a blue\nChevy outside the Seven Eleven\". Would be so much easier. Oh, my mistake.\nBut some kind of wonder he can recall his car and where he parked. But he\ncan not remember that Carrie-Ann is double-crossing him.<br><br>So if you don´t care for any logic in a movie and you are willingly fo fall\nfor a gimmick namely telling something backwards this is the right movie for\nyou. <br><br>Macaulay J. Connor still 1/10\n"},
{"review": "\n\nhaving been given recommendations from friends to watch this film, i duly\nbooked a night in to watch it. what a mistake. i believe this is the most\nover-rated film in history. ok, the film was original yes. but\nentertaining?\nno, not in the slightest. even after watching it on another 2 occasions,\nmy\nviews haven't changed.!\n"},
{"review": "\nFirst time I saw this movie, I got a little confused, but, at the same\ntime, I was amazed by the director Chris Nolan's work. The history is\nso fantastic and the format of the movie is so audacious that i became\na real fan, bought the movie and watched it every day for like two\nweeks.<br><br>Nolan talks to us in the movie through the little details. The space in\nLenny's chest is one that becomes interesting in, at least, three\ndifferent moments: when he shows it to Natalie at her place, when he\nsees himself pointing at it in a Polaroid picture and in the end, when\nhe remembers his wife while going to the tattoo shop. In this last\nscene, the space appears filled with the message \"I've done it\". I\nbelieve this blank space summarizes his pointless odyssey, I mean: it\nwill always be blank, although he knows, deep inside, that it should be\nfilled with that message. It is a proof that he won't stop.<br><br>The way Lenny feels his hand aching as he speaks to Natalie (after\nbeating her), the way all people use him to their own purposes, the\nlittle details that prove that Sammy Jankins' history is his own (the\nscene with a needle that flashes his mind as he lays on Natalie's sofa\nand the talking with Teddy in the end/beginning), his deepest\nreflections about his condition (\"How am I supposed to heal if I can't\nfeel time?\" or \"I can't remember to forget you\"), all those elements\nare the ingredients for this real masterpiece. A movie that proves to\nus in a weird, yet ingenious, way how we lie to ourselves to live, how\nfar can we go to give our lives a meaning and face the awful truth.\n"},
{"review": "\n\"Memento\" is a sleaze-ball suspense movie with a twist. As if you don't\nknow it yet, the scenes are played all jumbled and out of order.<br><br>What could have turned into just a nasty trick on the viewer is\nactually very well-done here. You see things from the perspective of\nour main character who suffers from a bizarre memory loss condition.\nRather than explain the plot, I will just say that if you plan on\nwatching this movie just once, get ready to change your plans. You will\nneed to watch it twice to fully GET it. It moves too fast for the\nviewer and by the time it's over you will tell yourself that you GET\nit, but you don't.<br><br>To those who say there are no holes in this film I scoff at you. Why\ndoes Leonard have no memory loss in the murder sequence? He remembers\nlong enough to drive all the way to that abandoned building and then\nwait for the murderer. In other scenes, he forgets what he is doing\nafter two minutes. Maybe he is just psychotic and made the whole\ncondition up in his mind to excuse a rampage? The hypotheses are\nendless. Personally, I'd rather watch a movie that just makes sense on\nit's own and no matter what you say, this one doesn't. \"Memento\" tries\nto do what \"Pulp Fiction\" did but takes itself way too seriously. The\nviewers are treated to a narrative from the character Teddy at the end\nwhen he has to explain the situation to Leonard thus explaining the\nmovie to us. Kind of cheap, Nolan.<br><br>One thing is for sure: Guy Pearce is one of the best actors alive.<br><br>7 out of 10, kids.\n"},
{"review": "\n\nWhen I saw Memento in theatres I left feeling numb. The film did absolutely\nnothing for me---in fact, I found it intensely awful. Hearing so many\npositive things about the film and taken by the possibility that it\nmight've\nbeen my mood, I decided to revisit it when it appeared on my movie cable\nchannel. I found myself appreciating Mr. Nolan's directing more at home,\nand\nMr. Pearce's performance stood out the second time around. What remained\nthe\nsame, however, was the complete lack of interest I had in the story. It\nseems Mr. Nolan was so pleased with the gimmick he had that there was\nlittle\natttention paid to generating suspense and creating involving and/or\ncompelling characters. There were moments at home when I was entertained by\nthe film, but I was never fully interested in it. If I really want to watch\na reverse chronology film I'll take \"The Betrayal\" over this any day. My\nrating: 2/5<br><br>Sidenote: I look forward to Insomnia, however, if only because I know that\none will have an interesting story.\n"},
{"review": "\nYou know, this movie has everything to be an awesome movie. The main\nactors, Guy Pearce and Carrie-Anne Moss deserve an Oscar for such a\nprofessional acting. The originality of \"Memento\" is also pleasant, I\nmyself had never seen a similar story in a movie. But something in this\nplot didn't satisfy me. The story was very confusing, there are\nflashbacks all the time, and it becomes boring once we get lost in the\nmystery.<br><br>I have to admit I didn't make it to the end... as stated before, once I\ngot lost in the story it became very boring. And it's not my fault as a\nviewer to don't get things straight: they (the writers) are supposed to\nmake me want to follow their thoughts, otherwise movies wouldn't be\nclassified as entertainment.\n"},
{"review": "\nImagine you're in a bathroom and you see a bottle of whiskey. And you\nhave to question whether that means you're drunk.<br><br>Imagine a woman gets you so angry you hit her in the face and bloody\nher lip. She walks out of the room, but returns in a few minutes. You\nask her who hit her and she tells you some other guy's name. You vow to\npunish that guy.<br><br>Imagine you're running down the street. Some other guy is running too.\nAt first you think you are chasing him. Then, he fires a gun at you and\nyou realize you are the one being chased.<br><br>This is Leonard's problem. He's out to find and kill the man who killed\nhis wife. But he can't remember what happened five minutes ago. He uses\nnotes, tattoos and Polaroids to keep track of information he has\nlearned. But some of this information is wrong.<br><br>And get this \u0097 Leonard's mission of revenge is told in scenes that are\nbackwards-sequenced.<br><br>Ingenious. That's the only word to describe this outstanding puzzle\nmovie. Anyone unwilling to devote very close attention to a film should\navoid this one. Those willing will find it immensely rewarding.<br><br>I like highly contrived movies. Ironically, I'm not a big science\nfiction fan because I like the contrivances to be within the realm of\npresent-day plausibility, if that makes any sense. If you share that\nsensibility, check out \"Memento.\"\n"},
{"review": "\n\nThe majority of people on this comments board attribute this film's\nsuccess\nto its very original editing style. The film is built upon this style,\nshowing you a present-time snippet of the main character which leaves you\nwondering about why he got there and what he's doing. The film then\ncontinues showing you a snippet of the immediate preceding past of the\nmain\ncharacter, and so on backwards in time helping you understand the\nbeginning\nof the film.\nThat's where the movie's originality stops. The plot itself is filled with\nhuge holes. While the premise is interesting, it is hardly plausible that\nsomeone with no short-term memory would not be 'assisted' by society in\nany\nway, nor that he could not have a notebook handcuffed to him or something\nrather than all the tattoos.\nI found the movie rather predictable and did not really care about the\nmovie\nafter about halfway through.<br><br>Still, an interesting and innovative movie-making style with a neat, if\nunplausible, situation for the main character. This coupled with sometimes\nvery unconvincing acting by the main actor (although it is a hard role, he\nnever really pulls it off) and a wholly boring plot earns this movie a 7\nin\nmy book.<br><br>If you want to see a real whodunnit type movie that will haunt you for a\nlong time to come, try Thesis by Spanish director Almenabar which I saw\nlast\nnight and save Memento for a day you want to study film rather than enjoy\nit.\n\n"},
{"review": "\nLet me put this straight: This movie is simply boring. It is different\nfrom other movies and it does have a plot twist but it failed to hold\nmy attention so when the plot twist was revealed, I didn't even bother\nto care anymore. The storyline is stupid, I don't understand why many\npeople here say it's clever and entertaining, to me it's so so so\nboring, repetitive and pretentious to the point that I kept wondering:\n\"what is the point of all this when we all know the protagonist's final\naction already?\" Oh and talking about the protagonist. He is an\nincredibly unbelievable character, at the beginning I thought he was\nsupposed to be funny but after that when I realized he was pretty\nserious about his \"condition\" and all the vengeance thing I lost\ninterest and couldn't care less. The movie is only 1 and a half hour\nlong yet the number of times I yawned while watching it was countless.\n"},
{"review": "\nI didn't have too much trouble following this film after the first ten\nminutes - maybe because I'm a touch dyslexic, and I'd seen the backward\nSeinfeld wedding-in-India episode several times. It was ingenious that\nwhile the central character had his puzzle to figure out, we as an\naudience were given one that paralleled his.<br><br>But the further Memento progressed, the more I felt that I neither\nliked nor related to any of the characters, who become more\none-dimensional the further back in time we encounter them, and that\nthen becomes who they really are. It's not a film I would have cared to\nsee had it been chronological.<br><br>Take Groundhog Day, make it the others in the film who know what's\ngoing on, then change it from a comedy to a moody thriller with a bunch\nof sleazeballs, and you have Memento. It gives the impression not only\nthat nothing is as it seems, but that no one can be trusted, and\neveryone is parasitic when given the opportunity. It's sad that so many\npeople have praised it, given it's jaundiced view of humanity.<br><br>Yes, it's a milestone, a new Third Man for the new century. I recommend\nit only as a study in film-making and storytelling. You may smile at\nthe tricks in the unfolding of the magic. But if you have the simple\ndesire to see real, complex characters -- with both good sides and\nhuman failings -- they won't turn up in Memento.<br><br>By the end - or beginning, as it were -- the completion of the puzzle\nonly creates an ugly, slimy picture. It's like watching the magician\npull a dead rabbit from his hat. At a different time in my life, I'd\nhave been a lot more impressed.\n"},
{"review": "\n\nGranted this movie is out of the ordinary. But since this movie is #9(?)\noverall here on imdb, my expectations was high. So I was very disappointed\nwhen I had seen the movie through. The film lacks attention to detail, and\nthus has lots of problems where you, as audience, begin wondering why the\ndirector/writer ( unknowingly? ) has made so many errors with regards to\nconditions of the mind and realistic human behaviour. Id say that if you\nare\nfan of well worked and really intriguing storytelling, go watch a David\nLynch movie. His movies doesn't pretend to be something they are not.<br><br>Sorry to all the people who feel this is a really brilliant movie, but it\nis\nnot up there to me. It is a sad story told backwards, with an\nuninteresting\nphilosophical twist about what people will believe when they cant\ndistinguish between truth and lie.\n"},
{"review": "\n\nGood plot but the scenes are out of sequence making it hard to follow.\nOther\nout of sequence films include Pulp Fiction and Reservoir Dogs (both\ndirected\nby Quentin Tarantino. I thought this was a Tarantino movie until I\nchecked).\nAbrupt and unsatisfying ending.<br><br>\n"},
{"review": "\n\nSurprise endings don't excuse complicated, explanatory meanderings.  The\nstory is much more shrewd than the film makes it out to be -- things are\nstill falling into place long after the credits have stopped\nrolling.<br><br>Kind of slow, forcing you to give it a chance, since we presume to know the\nrest.  Through all the billowing sequences and finally settling for some\nlucid crime/detective/drug theme, at the end the surprises pop out and BOOM\ncredits roll, but only after a very cocky, humorous Guy Pearce says with the\nutmost pretension \"Now, where was I?\"  You can almost hear the filmmakers\nsneering into your ear \"Aren't we just so goddamn clever?\"<br><br>Yeah, you were clever...but not much else.<br><br>5 Fight Club insinuations out of 10.\n"},
{"review": "\n\nChristopher Nolan and company must be having a good laugh over the effort we\npoor fools have been expending in trying to understand \"Memento.\"  I watched\nthis on DVD once from the beginning to the end and then back again, and I\nhave come to the conclusion that trying to put together a coherent linear\nnarrative with a beginning, middle and end from the jumbled fragments we are\ngiven to work with here would be an exercise in futility.  The truth is that\nby the time each revelation has finished contradicting the one that comes\nafter it (or before it?), you are ultimately left with nothing but thin air.\n Some have said that \"Memento\" tells its story in reverse order from the end\nto the beginning, but this is one thing that it does not do.  If that were\nthe case, then the final scene at the tattoo parlor would be the beginning\nof the story, which, of course, it is not.  In fact, trying to pinpoint just\nwhen the story begins is impossible.  I think the filmakers have made us all\nthe victims of a fiendish prank, but I for one do not think \"Memento\" is\nnearly as clever as it thinks it is.  Oh, and Guy Pearce's rapid-fire\nmonotone almost put me to sleep!\n"},
{"review": "\n\nThis interesting movie is about a man who can only remember stuff that\nhappens within a minute due to an accident he had when some rapists were\nmolesting his wife.\nThe story shows us a man on a quest to revenge the death of his wife, but\nwith a twist!  The movie moves backwards in time although the sequential\nseries of events that progress in clusters are in a normal timeframe moving\nforwards in time.  This way of telling a story opens up the narration in\nsuch a way that new perspectives and surprises revels themselves at the\nbeginning of each new cluster, thus creating a deeper understanding of the\nprevious cluster / action.\nThere seems to be a metatheme in this movie.  The main character was a\ndetective for an insurance company before his accident.  Now the whole\nmovie\nseems to follow the path such a detective would go by when investigating.\nNamely, starting out with the crime itself and working backwards untill the\nperson who did it and the motive is found.\nThis movie might also allude to the current state of our historical\nscience,\nshowing that memory, and especially history can be tampered with and\nchanged\n(especially in the hands of less morally founded individuals).  Thus one\nmight even say it is a profound criticism of the all objectivity.\nBasically though, this is a thriller about manipulation in its different\nshapes and forms, and how people use each others weaknesses to outwit each\nother and sometimes even themselves....<br><br>\n"},
{"review": "\nThis is my 1st review on the site and I have chosen this masterpiece of\na movie to review.<br><br>I have seen movies in my life with an innovation factor whether its the\ncharacters, the plot, the directing or even the soundtrack, but this\nmovie deserves to be a great, clear contender in the innovation land.<br><br>Since the 80s, we are tired as viewers of clichés regarding\nprotagonists or antagonists and this movie serves the cause of\nsurprising the viewer not necessarily plot-wise, but character-wise. I\nmean all of the characters in this movie have their ups and downs\nwithin the build up.<br><br>Guy Pearce is certainly one of my favorite actors of all time, so it\nisn't new to me that I got owned by his acting and for Carrie-Anne\nMoss, she is an actress of natural, God-given ability. So, where did\nthe pleasant surprise came from?... It came from Joe Pantoliano who\nadded THE flavor to the movie.<br><br>If you still haven't watched this movie and I doubt it, then go and see\nit today for it is a masterpiece not necessarily in its epic, rich,\nnovely aspect, but for its innovation.\n"},
{"review": "\nAt the end of the movie Shelby explains everything about what really\nhappened to the person Leonard was looking for. my question is where is\nthat \"I've done it\" tattoo through out the movie. A scene shows\nLeonard's wife rubbing his \"I've done it\" tattoo but where is it when\nNatalie and Leonard look at the mirror when they are reading Leonard's\nbackwards tattoo. Its a good movie but it fell apart for me when i\nfigured out the hole. Because if Leonard would of saw his \"I've done\nit\" tattoo at the start of the movie, he would need no reason to find\nthat burglar because he would seen on his chest that he has killed him!\nStill a good movie though.<br><br>I'm just guessing here but maybe this is why the academy awards didn't\nnominate memento for best picture because they probably figured out the\nhole too.\n"},
{"review": "\n\nI cannot tell you how many recent movies I have seen that start with the\ncharacter in a screwed up situation, then backtell how he got there. I\nhate\nit! It's like a spoiler for the whole film! It takes away all the mystery,\nit's like someone telling you when you are going to die. Why go on living?\nWhy go on watching such a film? Just Married and Salton Sea are two recent\ncopy cat examples. I guess it is the latest style. And what about all\nthese\nabsurd movies trying to be like Fargo or a Tarantino flick, example Orange\nCounty.<br><br>This film is like all those, rolled into one. This film is very clever\nwith\nthe main character having no short term memory but that is where it ends.\nIt\nis NOT top 250 material. I think that the ranking system is screwed up or\nsomething. It is better than 238 of the best films of all time?\nHelloooooooooo?<br><br>It is a crappy overused story, told in an unusual way with ok acting. Wife\nis killed, person seeking the murderer etc etc.\n\n"},
{"review": "\n\nI saw this movie with neutral expectations, and I don't see what all the\nfuss is about.  It is TERRIBLE.  Difficult to keep eyes open through the\nentire thing.  What happened to you people when you saw it?  Did your\ntickets come with free popcorn or something?  How is the movie so\nappealing?\nThe plot is semi-original, the acting puke-inducing.  I say it loud for\nall\nto hear: LAME-O.\n"},
{"review": "\n\nAfter seeing how many people loved this flick, I am surprised.  I guess\nyou\nshould be wide awake and completely alert to watch it.  I was tired and I\ncould not wait for this movie to end.  It left too many questions\nunanswered\nat the end.  I will admit that it was an interesting way to film a\nthriller.\n"},
{"review": "\n\nFrom reading the pretentious reviews here, you'd think that this is going to\nbe a great movie.<br><br>You'd be wrong.<br><br>The words \"strange\" and \"weird\" come to mind, but if you want me to say\nsomething really nice, all I can think of is that I borrowed the DVD from\nthe library, so it was free.<br><br>Making this one of the top movies on IMDB is an insult to all the other\ntruly good movies that are on the list.  I gave it a 3. \n\n"},
{"review": "\n\nOK, granted this movie has a unique premise. This movie is quite\nentertaining and will keep ya watching. But this movie is not the amazing\nwork of art many would have you believe. It is a decent thriller with a\ntwist in that it works backwards and puts the watcher into the same\nmindset\nof our main character who has reoccuring amnesia. Decent movie that\nchanges\nthe viewers opinion throughout the flick as our character slowly works his\nway through time in reverse. We see things happen and then we slowly find\nout how those things came to be as we move farther back.<br><br>***********Spoiler****************<br><br>One major fault in the movie. The scene where our main character is\nmanipulated by the lady to deal with her boyfriend is completely screwy.\nThey tried to make it out that she totally planned it and covered all the\nbases but if one watches that scene one can see that one million things\ncould have gone wrong and even should have when she plays her game and\ngets\nhit. Hiding of the pens, the seriously fast relapse of the main character\n(and her not knowing at that point how fast a lapse takes), and other\nproblems just bugged me with that one scene. It was the most far fetched\npart of the entire movie and should have been done differently.\n"},
{"review": "\n\nFragmented, disjointed, unsequential story and screenplay, is innovative and\ncertainly attention-getting, but ultimately mutes the emotional impact of\nfilm.  Too few moments when the viewers here could connect, possibly because\nyou have to work so hard continuously to figure out what is going on.  An\nintricate cerebral puzzle but without passion.\n"},
{"review": "\n\nMemento started out well, I was enthralled for the first twenty minutes.\nThe next twenty minutes I found ok, the twenty minutes after that I\nstarted\nto get bored and after that I just wanted the film to end.  No I did not\nget\nthe ending before the end reel but by that time I didn't care, it had\nturned\ninto a matter of wills, which would break first my will to watch the film\nor\nmy will to say to a friend that this was the most boring piece of s*** I\nhave seen in ages and could he please turn it off.  The former won, but I\nfelt tha I had wasted two hours of my life which I cannot now get back.\nIf\nyou want a film with a good plot twist watch The Usual Suspects, if you\nwant\nto watch a film and then be able to say well I'm a real fan watch Memento.\nWatching Memento and saying it is wonderful isn't a case of watching\ninterlectual film its a case of thinking you are watching a interlectual\nfilm, whilst in fact you are watching second rate tat which isn't smart or\nclever. \n"},
{"review": "\n\nPerhaps because this movie was rated SO HIGHLY, my viewing was tainted by\nunrealistically bolstered expectations. Maybe...<br><br>There was a strange twist of irony at work here: the more I watched this\nfilm the less I liked it. What began as a wonderfully, refreshing look at\n(reverse) story-telling, became less entertaining and more tedious with\neach\npassing (and re-passing) flash-back (or is that flash-forward?)<br><br>Part of this film played like an old Twilight Zone episode I recall seeing\nmany years ago. And that's not a bad thing. I enjoyed piecing together the\n\"why\" of the plot, since we already knew the \"what.\" However, generally\nuninteresting and unappealing characters mar the performances, and while\nour\nhero may be unaware of time, as a viewer I was painfully aware of how his\nfilm seemed to drag, lacking a good sense of timing. As for the ending, it\ntoo could have been given the same delicious touches as the beginning\nsequence, but alas, it does nothing to reward the viewer for having endured\nthe bulk of the film.<br><br>One reviewer commented how well this HIGHLY RATED film will hold up in\nanother few years when compared to the classics. Others have asked how on\nearth it could have rated so high to begin with. The former will be\nanswered\non its own, and I believe time will not be too kind. The answer to the\nlatter is akin to the McDonald's Syndrome: Those who grew up eating Big\nMacs\non a regular basis erroneously come to believe it's actually good food.\nPerhaps compared to what Hollywood is offering these days, Memento is\nindeed\ngourmet fare. To me, it's still just a hamburger. (6 out of\n10).<br><br>\n"},
{"review": "\n\nGood? I believe this story is good but how can a film maker get the idea of\nmaking the story backwards? It simple ridiculous. The plot follow through\nthe story well but this movie will only suitable for expert users, someone\nwho hold at least a bachelor degree to understand this movie well,\notherwise, people might think it is a magic or fantasy \nmovie.<br><br>Also, the ending... what happened next? the screen just turn black and end\ntitle rolling. So... at least a last intro should be written. Anyway,\nenjoyable movie.\n"},
{"review": "\nThis movie started off pretty well. There was a guy who had short term\nmemory loss and he was after \"Teddy\" who killed his wife. The movie\nwent backwards and then back to the present. It built a story from\nbeing backwards and that was great. The only problem that I had with it\nwas that it was too much. Every time the movie went back to the\npresent, I had to recreate what was going on it my mind just to make\nthe movie work. Then I just didn't understand it because I couldn't\nremember the whole movie because it was playing backwards and I was\ntrying to piece the story out forwards. Ugh. This movie should have\nbeen just done from the start but played out differently. I don't know\nhow but I hope that I forget this movie.\n"},
{"review": "\n\nYou see the ending, and then have to wade through the rest of the movie, as\nit is told in scenes that are presented in reverse order, to see if the\nending was a good thing, or a bad thing.  I had that figured out as the\nopening credits were rolling.  I didn't find the story at all interesting, I\nknew how it ended, it was just a matter of seeing how we got there... it\ndidn't work for me.<br><br>Also, I found the guys affliction very odd.  I've never heard of such an\nextreme memory problem.  I also kept asking myself if a person with this\nproblem could function well enough to leave himself notes, and to tatoo\nhimself with notes, and go on this quest, would he be going around with no\none to help him a little... he knows that eventually he will be lost again,\nexcept for his notes.  I didn't buy it.  Too odd... too\nsilly.\n"},
{"review": "\n\nBut not as clever as others have made out. The first hour is confusing, its\nsupposed to be. The whole point of this film is to keep you guessing until\nthe final scene where the whole thing comes together. I just thought that\nthe final revelation wasn't that mind-blowing and a bit disappointing. One\nother point that I didn't think was too realistic was how quickly everybody\naround the main character accepted and adapted to his condition in order to\nexploit him.<br><br>All in all its a good film with excellent performances from Pearce and Moss\nand is different to anything else I've ever seen - 7/10.\n"},
{"review": "\n\nI think that the people who gave this a decent vote must have been\nwatching\nthe wrong film. May I suggest you go back and have another look. If they\ntold this story fowards it would have received about 3.0 and although it\nmay\nbe \"clever\" to tell the story in this backwards forwards whatever format I\nthink the film would have benefitted greatly from being set in space or\npossibly under the sea.\n"},
{"review": "\n\nDon't believe the hype -- people seem to go out of their way to tell you how\ngreat this film is.  The truth is that, when it comes to the crunch, it's\nactually not really anything that special.<br><br>Pearce, as the man who has no short term memory after he sustains a brain\ninjury when his wife is raped and murdered, is competent enough, but this\nfilm does get really annoying in the way that it loops within the plot in\norder to get you back to the same point you were at 2 minutes ago -- and\nthen moves onto the next scene.<br><br>That was really annoying.<br><br>A lot of this only makes sense in the last scene -- when the Sammy story\nfinally comes to a point -- but by then it's taken an effort to sit through\na lot of the rest of the film.<br><br>Make no mistake, it's not bad, but it's not anything sensational\neither.\n"},
{"review": "\n\nMy friends had raved so about this one, I was expecting depth, intricacy,\nand brilliance.  Instead, this played like a contrived derivation of an old\nAlfred Hitchcock episode that starred John Forsythe with a dash of Mr.\nBuddwing and a pinch of Wait Until Dark thrown in for good measure.  # 14\nmovie of all time !?! -- someone is playing a joke -- right?\n"},
{"review": "\nMany people seem to consider this to be a brilliant film. Not me. It\nwas a confusing barrage of flash backs, flash forwards, flash\nwhatevers... There were few times when I thought I was beginning to get\nthe drift of what was going on, but that's not how I felt by the end of\nthe film. I believe that the intention of this film is just to mess\nwith your mind, and that was not the sort entertainment that I was\nlooking for when I watched it. Perhaps, at the end of the movie, they\nhoped I could have empathy with what it must be like to suffer from the\nmemory condition that this guy has, so they tried to create an\nenvironment where my brain is turning itself inside out while trying to\nunderstand what's going on. Perhaps they succeeded, but I didn't like\nit and don't recommend it.\n"},
{"review": "\nThis is nothing special and I find it hard to accept the high voting\nfor this film. The ending is so unspectacular and a huge anti-climax.\nWith the excessive amount of time-shifting with scenes not shown in\nchronological order - it just overly confuses and irritates. Pulp\nFiction for example did a much better job of this, but here scenes were\nall over the place and made the film difficult to follow. I stuck with\nit thinking that the ending will make sense of it all and will be worth\nthe wait- but that turned out be very disappointing. Yes it has some\nclever moments in it but one viewing was enough for me-the film just\ndoesn't interest to justify watching it again.\n"},
{"review": "\n\nThis movie is waaaaaayyyy too confusing to even be considered one of\nthe best of all time. Guy Pearce is super in it and the acting is\nwonderful. I like the idea and the concept of telling the story is\npretty original. But wow!!! What a bummer ending. It works up all this\nsuspense and intrigue and you find out, the story we saw was for\nnothing???? I don't mind not knowing everything, but not knowing\nanything???? Not acceptable. I didn't like it and call me stupid, but\nafter being intrigued and following along the whole time, the ending is\njust too stupid. At one point, I was just ready to get the movie over\nwith. Not something a movie should want me to do. There is some\nentertainment value, but at some point, it becomes too complicated to\neven really care. That's how I felt. This movie is pretty overrated for\nwhere it is in the standings. It's half-way decent, and DEFINITELY NOT\nONE OF THE 20 BEST FILMS EVER MADE!!!! Go see the Usual Suspects\ninstead.\n\n"},
{"review": "\nI cannot believe when I see the other bad reviews of this movie. Once\nagain, I think that the plot goes over peoples' heads and they do not\nrealize what is going on. If you have a good head on your shoulders,\nthere is no way you could fail to be drawn into the mystery of this\nfilm. Guy Pearce is unbelievable and this was the first time I saw what\nan incredible actor he is. Also, Carrie Anne Moss is ubelievabley\ngorgeous and Joe Pantoliano (also another favorite) is hilarioius and\ninscrutable. I can watch this movie time and again and never get tired\nof it. I love it when a story takes a twist on classic Noir. The other\nplus is that the soundtrack/score is really edgy and complements the b\nleak tone perfectly.\n"},
{"review": "\n\n* Spoilers *\nI've seen many positive comments about this movie from people who were happy\nthey \"got it\". \nFor me the film didn't tell anything new. Basically we live in the world we\nwant to live in. Welcome to life.\nI didn't have any sympathy for the guy from the start. Anyone who thinks\nrevenge, and especially murder solves anything deserve what they\nget.\nAnd Nolan made it obvious that Lenny made mistakes - not being consistent,\nnot writing down stuff - this told me he wasn't a hero searching for the\ntruth but someone running from it.<br><br>The interesting part is how captivating the description of this guy's\ncondition is. Nolan could really make it believable and had me scribbling\nstuff on paper just for fun after the film.<br><br>So apart from some starting boring moments, an entertaining film, but it\ndoesn't deserve 14000 10 votes from people who have just discovered that\nthere are movies other than the action flick of the week.<br><br>6/10\n\n"},
{"review": "\nAs for the story: throw in the usual wrongfully deceased wife/daughter.\nAdd a formula, like memory loss, also a proved recipe. Now throw in a\nlittle gimmick, lets write it backwards in time, or half of it forward\nand printed backwards so you need to read it using a mirror.. Something\nlike that. Great idea! Really, after I managed to recompose the story\nfrom its fragments, all I had was an incredibly thin story. With\nentirely one- dimensional characters, all equally unlikeable. This one\nI can spoil in a single line. Guy suffers from memory loss from a head\ninjury, and tries to get revenge, but is used time after time because\nof his memory loss. Give or take a handful of unimportant and\nuninteresting details. Top ten movie? Apparently people can be bought\ncheaply, and they take chaos for complexity when given the chance.\n"},
{"review": "\nI really hate to discredit art when credit is due. But in the case of\nmemento if you like to watch a barrage of continuously replayed and\nominously boring clips and a truly not so thrilling movie with a has\nbeen leading actor who would sadly do better on a lifetime movie rather\nthan this. This is sad to see what is becoming of America or rather the\nworld when this kind of a movie gets such a good rating. This movie was\na blundering piece of reverse psychology that a 6 month old child could\nhave guessed from the beginning. However if you feel like watching an\nalmost 2 hour movie with only 45 minutes of film love going from color\nto black and white with no intentional purpose and like to feel like\nyour mind is stuck in an ipod shuffle with bad 80s music for what feels\nlike hours be my guest and watch this boring pile of garbage just\nremember i told you so.\n"},
{"review": "\nAn empty theatrical experience. A dull movie with no emotional core.\nClever editing substitutes for lack of substance and dramatic appeal.\nChristopher Nolan's failed attempted to invent an original narrative\nstructure.<br><br>The only intriguing aspect of this glossy Hollywood film disguised as\ndaring indie is the fact it has received accolades from movie critics\nas well as average movie fans. 'Memento' is so smartly put together\nthat both groups lack the courage to say that the movie is a failure\nand a bore for fear of not coming out ignorant and unsophisticated.<br><br>Long ago it was observed by Pauline Keal that art house audience\naccepts lack of clarity as complexity, accepts clumsiness and confusion\nas 'ambiguity' and as style. If you thought 'Limey' was pretentious,\nwait 'til you see this. Or, better yet, don't! <br><br>Just forget about it!\n"},
{"review": "\n\nRated 10th best overall by IMDB? There was nothing above average in this\nmovie. A weak plot that unfolds backwards is worse, not fresh, creative,\nor\nground-breaking. If you ranked this movie in your top 10  you probably\nenjoyed such classics as Lost Highway and Drowning Mona.<br><br>If you can appreciate an art display consisting of a cage of live\nchickens\nrunning around, this movie is for you. Otherwise, this movie was a sharp\nstick in the eye. Avoid at all costs.<br><br>\n"},
{"review": "\n\nI had heard all the raves. A reviewer said \"you'll want to watch this movie\nseveral times because it's so complex\". I really wanted to see it... Then I\ndid. My wife gave up after less than half of it. I forced myself to see it\nthrough, because I hoped there was something to redeem it. Well, there\nwasn't. Complex? Nothing worthwile is revealed after the first half,\nactually, the thing is pretty much clear after the first scene - never mind\nthe sordid detail revealed later, doen't add anything for me. An\nuninteresting, unbelievable, unappealing story acted out by characters one\ncannot get oneself to care for. So it's told backwards, big deal. I've seen\nsimilar things before, done much better. No short term memory? Try \"Winter\nSleepers\", that idea is used there much better. Acting? The characters had\nto look bewildered and smarmy, in turns. Not a great range, in my opinion.\nMy conclusions: don't bother with this one!\n"},
{"review": "\nI've been trying to watch this movie for ever and finally got a chance\nto do it. This movie is like a puzzle for you to figure out. Guy Pearce\nis Leonard, a man who suffers from short-term memory...the last thing\nhe remembers is his wife dying.Now he seeks for revenge and in order to\ndo so, he creates a system, he takes pictures of everyone, he writes\ndown important facts and it gets tattooed with reminders.That's how he\ncopes with his condition. I don't want to give too much away but the\nway this film is told is pretty unique to say the least and has\ninfluenced other movies like The Machinist.That said, Memento is a\nreally good movie and the concept is amazing,the only thing less\npositive is that it gets a little boring sometimes.I can see why this\nis on the top250 but it doesn't deserve to be in such high position.\n7/10\n"},
{"review": "\n\nThis is that one really popular indie film that comes out every once in a\nwhile, that has a plot that's familiar enough for the masses to attach\nthemselves to, go see, and pretend to be film intellectuals. It's not\nentertainment, it's a composite of ideas from a lot of other thrillers with\na boring, no name, lifeless cast.<br><br>Go see what you like, that's what the entertainment medium of film is all\nabout. Keeping you interested. This can't possibly be interesting to\nanybody\nwith the way attention spans are today.<br><br>I kept drudging through the repetitive nonsense figuring there would be a\npoint, after an hour i turned it off for a while because it seemed like\nthere wasn't, i wish I didn't finish it.<br><br>To quote Hans Moleman \"You've wasted 5 minutes of my life, and I want them\nback...oh who am I kidding, I'd probably waste them anyway\"<br><br>Don't waste 2 hours of your life, steer clear and rent \"Rear\nWindow\"\n"},
{"review": "\n\nIt's a pretty cool idea. The last thing Leonard (Guy Pearce) remembers is\nsomeone killing his wife - since then he's had a head injury and has not\nbeen able to form new memories (a little like the start to Dark City). He\ntakes pictures, makes notes, tattoos himself to try to order his life -\nbut\nultimately he does not know what he's doing. All that drives him is the\ndesperate desire to track down the elusive 'John G.', who raped and\nmurdered\nhis wife. The film starts at the end of the story and works backwards (yes\nRaquel - backwards).  The only problem is, the scriptwriters seem to have\nsuffered the same defect as their protagonist and forgot to wrap up all\nthe\nquestions actually posed at the start of their script.<br><br>Just when you're thinking \"This is a really clever piece of film!   I have\nno idea what the real answer is.\" the screen goes blank and the credits\nstart to roll. The story doesn't go back to who actually killed his wife,\nand dodges with some philosophy about 'who are we if we don't have our\nmemories' - which is nice, but not strong or original enough to justify\nthe\nweak script. Plus, this philosophical point is not exactly proven by the\nsudden ending - it would have been just as strong with some answers to the\nplot.<br><br>Like: Who is Teddy? Why is he really involved? Was Leonard actually caught\nup with the other characters before his wife died? Why does he have two,\napparently contradictory, sets of memories? Just a couple of big holes\nthat\nlower the quality of what had the potential to be a really brilliant film.\nStill kudos to the acting, directing, and the 2/3rds of the script that\nthey\ncall a movie.\n"},
{"review": "\n\n\"Memento\" is told in reverse, which makes it hard to follow at times.  In\nnormal chronological order this would be a normal run of the mill murder\nmystery.  It has the definite mood of film-noir.  I just do not understand\nwhy it is so highly regarded.  By telling a tale in reverse, does that make\nit a better film??\n"},
{"review": "\n\nI have always in mind that most of the films shown at The Sundance Film\nFestival in a way or in another are interesting, this is one of\nthose.<br><br>A despaired man has lost his \"immediate memory\" due to the murder and rape\nof his wife. His thirst of revenge but do not keep anything in his memory so\nhe is obliged to tattoo and take notes of important events, names, places,\netc..\nThe film is shot in a sort of flashback which you start to understand it\nafter at least 30 minutes.<br><br>It is an original film which has slightly reminded me the Italian film  \"The\nMnemonist\", this one plays more with the spectator to get a sort of\nthrilling effect.<br><br>Rating: 6/10 \n"},
{"review": "\n\nElegantly acted, and interesting put together, but so messy, and with so\nmany plot holes, that it became distracting. Friends and I who had seen\nthe\nmovie discussed it afterwards, and while we were intrigued and interested\nin\nthe devices used in the film, ultimately, it simply didn't hold up. Were\nit\n10% less jerked-around, I think it could have held much more tension. The\nconcept was nevertheless fascinating, and I recommend that you see it once\nto see what experimental film is all about. True, I believe: there are no\n(or few) new stories; only different ways of telling them. This was about\nas\noriginal as it gets, though.\n"},
{"review": "\n\nTells the story of a man that cannot form any new memories after the rape of\nhis wife, and hence wakes up every morning not remembering anything that he\nhas not written down in his hunt for the perpetrator.<br><br>The movie goes in backwards chunks of time as it unfolds, while each\nindividual chunk goes forward; it is not always clear if time is going\nforward or backward, which is somewhat headache-inducing. The plot has great\ntwists, especially towards the end.<br><br>This movie is not a comedy, and does not have a happy ending; overall, while\nthe movie is a great piece of art, I did not enjoy watching\nit.\n\n"},
{"review": "\n\nThere are spoilers in this review.<br><br>This is your chance to see Guy Pearce as a bleached-blonde SoCal Calvin\nKlein model.  Not only that, but he is also half-naked during the entire\nfilm as the camera pans up and down his body.  Guy in the shower, Guy on the\nbed, Guy getting dressed.  Like it or not, you're going to see Guy Pearce's\nbody, dammit.<br><br>This film is strongly reminiscent of the Seinfeld episode where everything\ngoes backward, the one where Sue Ellen Mischke gets married in India.  I\nwonder if the screenwriter was inspired by that show.<br><br>Anyway, Pearce plays a man who has no short-term memory, so he has to write\ndown everything.  This is a thinking person's film, which cleverly\nchallenges your own short-term memory as you try to remember how each\nvignette ties into the previous one.  It works, but after awhile it becomes\nformulaic.  <br><br>Joe Pantoliano's character is utterly unconvincing as a police officer.  He\nis such a simpering milquetoast, and his friendship with Guy is so weak,\nthat you wonder about his motivation for helping Guy.  It is never clearly\ndemonstrated.<br><br>Major spoiler alert in this paragraph.  The problem I have with the ending\nis that it is so unsatisfying.  It does not clearly demonstrate Guy's\nmotivation for `finding new challenges'.  His writing down of Teddy's\nlicense plate is so contrived and unlikely, and largely unexplained, that\nthe whole film falls apart.  It is as though Leonard is inventing challenges\njust to keep himself busy; it is such an empty, unsatisfying conclusion that\none wonders if there are a group of screenwriters somewhere whose job it is\nto create silly movie endings, such as those in `The Ring' and `Donnie\nDarko'.  A lot of sound and fury signifying nothing.<br><br>On IMDB's scale, this movie deserves a five.\n\n"},
{"review": "\n\nI have read so many positive reviews about Memento being great and\nsurprising. First 60 minutes didn´t lure me into the story,I thought it was\nboring. After the 60 minutes, the plot became slighty interesting, but it\nwas too late. The climax isn´t interesting, actually I wasn´t even\ninterested how the movie would end. <br><br>The cast is excellent and it was one of the reasons, that kept me awake\nthrough this boring movie. I give MEMENTO 4 points out of 10 (** out of\n*****).\n"},
{"review": "\n\nI saw this movie and I think it is good. The way it is played out is very\nunique, if not a little confusing at times. Still it was a good movie.\nThe\nactors did a very good job, especially the lead characters. But to have\nthis\nmovie ranked number ten, on the list of 250 best, is a\ntravesty.\n"},
{"review": "\n\nThe movie wasn't bad.  It kept me entertained for the duration.  I didn't\ndoze off.  But it was far too trendy in the way that it tried too hard to be\nartsy fartsy.  And I can't believe how many people are in awe of the who\nbackwards thing...it's not like it was unique to this movie.  Hell,\n\"Seinfeld\" even did it before them.  It began to get tedious to watch after\na while and towards the end I was glancing at my watch every two minutes. \nWhile I'm glad I watched it, I probably won't watch it again.  And let us\nhope some people come to their senses and give a bunch of tens to the likes\nof \"Annie Hall\" and \"North By Northwest\" to push this movie down on the top\n250.  Puh-leeze?\n"},
{"review": "\n\nAlbeit, this film did contain some excellent material.  The editing was\nabsolutely phenomenal and the ideas presented are at ther very least\nintriguing. This film does not have the coherance and overall excellence\nTHROUGHOUT all aspects to achieve such a rating nor reccomendation.  This\nfilm has mediocre acting, mediocre character development, mediocre to poor\nsound... all it really has going is editing and story/plot.  This film\ndoes\nnot deserve to be in the top 10, 50, or even 100.  I would place it in the\ntop 200 range only because of the uniqueness of the films construction.\n7/10\n"},
{"review": "\n\nWhen my sister and I were out to rent a video, she suggested\nMemento.\nI refused saying: \"Nee, niks aan\", which could be translated as: No, it\nsounds boring. And now I regret my words. When she bought it(I looked it\nanyway because it wouldn't be a waste of MY money), the first scene alone\nwas enough to catch my attention, as soon as I watched it too. I watched\nthe\nentire film with open eyes, even though it was very late. I loved the\nfilm.\nIn fact, it's my favorite movie ever! So I asked my sister every day if I\ncould see it again and now, I bought it from her. I watch it at least one\ntime every week and it never gets boring. The story is great, the acting\nis\nsuperb and the whole backwards-thing really gives you the idea that you\nhave\nshort-term memory-loss yourself. I recommend it to everyone. NEVER DOUBT A\nMOVIE, like I did.......<br><br>\n"},
{"review": "\n\nI was surprised to see the Amazon rating of this movie in the top 60,\nhaving\nan overall rating 8.8/10 as I am writing this. Was it really that good? I\ndidn't think so. The film left me exhausted trying to follow it. While I\ndo\nrealize that is somewhat the purpose of the film, it certainly doesn't\nmake\nit a top 100 film based simply on being different. The story itself wasn't\nin my mind \"Top 200\" worthy. By breaking nearly every story-telling\nconvention in terms of the time-line, and to this extreme, the only person\nassociated with this film deserving of accolade is the editor for having\nthe\npatience to piece this thing together. If you want a good break from\ntypical\nnarrative structure see \"Groundhog Day\" instead. I don't particularly care\nfor it either, but it's closer to a \"Top 200\" film than otnemem, hmm I\nmean\n\"Memento\" is.\n"},
{"review": "\n\nDon't get me wrong, the idea for how the story was told was a great one.\nAll the characters did a great job, and all the actual filmmaking was\ngreat.<br><br>There was one problem: THE WHOLE MOVIE WAS A LIE!<br><br>Most murder mysteries involve a twisty plot, wherein there is an\nuncovering\nof the truth that the viewer didn't yet put together - but COULD have!\nMemento didn't have that.  At the end, where you usually get the answer to\nhow this all works, you find out that the main character has been lied to\nhimself all along.  Given his condition, there was no way to determine\nthat,\nor sleuth it out from the details given previously.<br><br>In effect, the makers of this film seemed to put 100% of their energy into\na\nreally great concept, and put zero effort into actually making this into a\nmurder mystery.  They effectively pulled the alibi, and the final plot out\nof thin air!<br><br>Watch the film, it's really not that bad, and it's entertaining until the\nend, but at the end, don't say I didn't warn you!\n"},
{"review": "\n\nMaybe this film is, as others have stated,  trying to give us the experience\nof being Leonard rather than just observing him, so we end up being just as\nconfused and frustrated as he is, for that I can give it allot of credit, I\nknow of no other film that attempts to give you the experience of the main\ncharacter in such a literal way, but this of itself does not make a great\nmovie. Solving an involved math equation might be a better time. There has\nto be some character development, these characters never become interesting\nand the motivation of the main character for revenge seems shallow and\nbecomes boring quickly. Everything seems to ride on weather Teddy is telling\nthe truth or not. This is never reveled and so everything is open to\nspeculation. Probably one of the best films ever concocted for the purpose\nof  discussing endlessly afterward and for multiple viewing.  A plot that\nyou care about would help allot here. I could appreciate the cleverness of\nit all if the story was more of a hook.  Leonard thinks revenge will give\nhim peace? Even though he'll never remember it? All he remembers is his life\nup to \"the event\" but is able to remember he has short term memory loss? It\nseems this film is trying too hard to be something \"original\" and \"creative\"\nand comes of more like an exam puzzle and is seriously lacking a soul.  \n\n"},
{"review": "\n\nWhen I went to see this film in London it was purely by chance.  I'd heard\nit was good but I had no idea it would be anyway near as good as it was.\nIt\ntruly blew me away completely and utterly.  It is without doubt the\ncleverest most intelligent film you'll ever clap your little beadies on.\nThe whole thing runs backwards to go in sink with leonard's inability to\nstore memories and it all slowly fits into place as we watch leonard\nstumble\naround in a desperate attempt to pinpoint who offed his wife.  There are\ntwists and turns and those less blessed in the intelligence stakes may\nnever\ntruly understand what they have watched.  But trust me, This is a belter,\nwell worthy of all the acclaim and to say that Guy Pearce is brilliant as\nLeonard is to state the obvious.  This is up there with the greats and if\nyou haven't seen it, do one of two things, but preferably make sure you\nsort\nit out man......\n"},
{"review": "\n\nOK, so the movie ended and I began to try to put the pieces together and\nsolve the puzzle... but no, I just couldn't. Who where those people, how did\nLeonard meet them, how are they involved in the murder? I didn't understand\nthat. Perhaps I would need to watch it again, but I don't know if I could\nbear it.\n"},
{"review": "\n\nthis  is an excellent mind boggling movie that realy needs someone with a\nbrain to understand.\nthe plot is new , The acting is excellent and the screenplay is just\namazing.\nthis is a must see flick.\n"},
{"review": "\n\nHighly recommended (IMDB's #10) and Oscar-nominated, I found Memento a\ndisappointment.  Unique \"flashback in installments\" structure became\nannoying after a while.  Characters, including Pierce, had no real\nredeeming\nfeatures.  I felt sorry for Pierce and his \"condition,\" but his ultimate\nlack of nobility or any nice-guy appeal made it hard to really care.\n(Compare to his and Russell Crowe's characters in \"L.A. Confidential.\")\nLeft me wishing for more substance and less style.  5/10\n"},
{"review": "\n\nI thought Memento was a wonderful, thought-provoking movie.  The\nend-to-beginning storytelling style was very interesting, though it was a\nchallenge to get used to it.  After the first half hour it starts to make\nsense though.  Still, it is not a movie you can just passively watch; it\ndoes take some effort on the part of the viewer to understand what is\nhappening.<br><br>Some have criticized this film as having glaring plot holes.  I disagree. \nLeonard's problem is not what it seems and the answers to many of these\n\"plot holes\" are right there in the film.  Watching this film once is not\nenough.  Much like \"Sixth Sense\", the true enjoyment is in watching it again\nand seeing how all the pieces fall into place.<br><br>Well worth a viewing 8/10.\n"},
{"review": "\n\nBoring.\nThe central device to this film - playing the film 'backwards' is intrusive\nto the story telling. I didn't care about the central character(s), so I\nhave stopped watching the film, about half way through, I guess. I may\nwatch\nthe rest tomorrow, but I doubt it.\n"},
{"review": "\n\nThe premise of this movie is based on someones' lost memory.  And from\nthat,\nthe viewer must find intrigue.  Well this viewer didn't.  A fine idea mind\nyou.  But the path in which it takes to give the answers( which the viewer\ndoesn't even get an answer to in the end ), is somewhat vacant, and leaving\nthe person watching in a state of emptiness, as if not completely\nsatisfied.\nNow I've had this before with other movies, and I'm not that naive not to\nknow the difference.  This pic' just didn't carry the punch.  The\ncharacters\nwere fine, Pearce, especially.  But the plot out line just didn't have all\nthat it needs, to come out leaving you with a real feeling about this.\n\n"},
{"review": "\n\nQuite simply this is one of the best films I've seen with actors and\nactresses of whom I've barely seen. This is NOT a cult film which is popular\nby some weird twist of fate. This IS a solid film; well acted, directed and\ndefinitely well written. Although I have seen this basic plot twice before,\nI haven't seen it in a movie or so well done. The combination of Leonard's\nbrain damage and the reverse chronologic filming allow one of the most\nbizarre plot twists I've seen.\nThespian for Thespian, one of the best-done films to come out of\nHollywood.\n"},
{"review": "\n\nIt seems like users of this great site rank Memento up there along with true\nclassics, and some reviews explain why. <br><br>Personally I can't understand the enthusiasm for the movie. Although it's\nmore than a year since I saw, I remember the disappointment I felt when I\nleft the theatre (many of my friends had recommended it).<br><br>It's ok I'd say, at certain times even good, but definitely not fantastic. I\nlike the atmosphere and the cinematography, but the story is really not that\ngreat. It may not be true, but I like the idea that the Nolans had a story,\nwith no curve or central conflict, so their solution to this problem, was\nreverse the story. In my opinion a rather cheap call. It works only because\nthe audience is not used to a work with a text this way, starting with the\nend.<br><br>Personally I had a much better experience with Sabu's Monday (1999).<br><br>I warmly recommend it even if you liked Memento, and you probably did.  <br><br>\n"},
{"review": "\n\nHi All...<br><br>Seen lots of positive comments for this film, and to be fair , it is a\nvery\nwell made, well thought out film.\nGuy Pearce is very good, and Joe Pantoliano in my opinion is very\nunderrated\n(anyone who's seen Bound knows just how good he is in the right\nfilm).<br><br>But all that aside..<br><br>This is a film that you really have to be in the mood to\nsee.<br><br>It's a very difficult film to watch, and is not I feel aimed at your\naverage\nJoe who usually would like to switch off and be entertained (thank heaven\nfor Dogma and From Dusk 'til Dawn)..<br><br>So ...all in all..not a bad film, but definitely not in my top\nten.\n(probably not top 100)\n"},
{"review": "\n\nokay, I finally rented this movie. I didn't know anything about this movie\nexcept for a few friendly reviews from some armchair critics. so I'm going\nto put in my opinion now. <br><br>it didn't do it for me. I gave this movie a 6/10 because although the acting\nwas really well done - you could see exactly where this movie was going - in\nthat the movie essentially starts at the end and goes virtually\nnowhere.<br><br>I guess I'm just not in to the jumping time lines that take you back and\nforth in order to further the plot and understand why he wrote the stuff on\nthe back of the photos.<br><br>It was mediocre after hearing everybody saying \"oh yeah, this was an awesome\nflick!\"...just don't seem to understand what all the hubbub was\nabout.\n"},
{"review": "\n\nStrange movie with some twists - ala Hitchcock.  But it was a bit  wierd. \nStory would go forwards and backwards.  The \"mementos\" were just not that\nrealistic to be believed.  It seemed the guy lost his short term memory for\nmost things but not where he put his little memos.  He always managed to\nfind those - even the new ones.  An amazing feat for someone with zero short\nterm memory.  And throughout the film he would constantly make notes and\nread the notes - but he never seemed to be bothered with the thousands of\ntatoos he had.  He belonged in a lunatic asylum.  I never would have guessed\na film about some chowderhead writing and reading sticky notes would've been\nso popular.  Should've been called the sticky note boy. \n6/10\n"},
{"review": "\n<br><br>Well, I fell for the hype after noticing that Memento had been voted\ninto\nthe All Time Top Ten and rented the DVD. What a waste of time.  Not since\nOliver Stone's \"Natural Born Killers\" have I've seen such an example of\ntechnique masquerading as a movie.<br><br>Ooh. The movie starts from the end, how cool and original.  I suspect\nfew\nmovie devotees would have been nearly as interested if the film has been\nin\nnormal linear mode.  After straining to notice each hidden clue, I was\ndumbfounded when this \"classic\" ended.  The star - Guy Pierce - gave a\nwooden \"Keanu\" performance, although in all fairness, he was given little\nto\nwork with.  I couldn't give a damn about any of the characters.  The\nconstant cut backs became mind numbingly annoying.  No, I did NOT enjoy\nthis\nmovie.<br><br>News flash.  The emperor had no clothes and this movie stunk!<br><br>\n"},
{"review": "\n\nVery clever.  I think the idea of running the film back to front was a\npretty good one, and the effort was respectable.  Although this film was\nfun\nto watch and try to keep up with, it was far from the greatest film ever\nmade.  Perhaps in the 50 to 100 best ever range.\n"},
{"review": "\n\nCome on, folks. As I write this, MEMENTO is listed as the 9th BEST FILM OF\nALL TIME? Yeah, right.\nI'm not going to come down too hard on this, but this is one of those films\nwhich is so concerned with how cleverly it tricks the audience (6TH SENSE,\nUSUAL SUSPECTS) that it inevitably will be a let down when all the plot\nmechanics are revealed as a giant ruse. Not to say that clever plotting is\nbad, but the final results have to be a revelation - or carry a deeper\nresonance (i.e. THE CONVERSATION, Godard's LA CHINOISE or Bunuel's\nmasterpiece BELLE DE JOUR) not just a cheap cinematic trick.\nCheck out Nolan's FOLLOWING for a better, less cynical, treatment of a\nsimilar theme.\n"},
{"review": "\n\nMemento is a highly ambitious, engrossing film, where the story is told\nbackwards.  However, it never comes together -- when you reorder the\npieces\nthere are too many glaring plot holes.  So, though it's very entertaining\nwhile your watching it, it leaves a vague sense of irritation at the\nend --\nit's a cheat.  It's keeps promising that it will eventually make sense,\nbut\nit never does.  \n"},
{"review": "\n\nThis movie is so wonderful conceptually that I almost feel bad about writing\na bad revue of it.  The backwards timeline to reveal memories is a very\ninteresting idea, and throughout most of the movie it is handled\nbeautifully.  Also the plot twists are all sharp and interesting, save the\nend twist which destroys any chance for catharsis on the audience's part. <br><br>But more than the ending of this movie bothered me.  Guy Pearce is a horrid\nhorrid actor.  He is able to look brooding and that's about it.  Perhaps\nwith a more skilled actor (Edward Norton would have been perfect) this movie\nmight have actually achieved some emotional power.  But Pearce is only\ncapable of looking brooding and cold.  He brings no emotional depth, which\nis why the ending didn't work because ultimately the audience doesn't care\nabout his character.  Also the writing takes a turn for the worse around the\nmiddle of the movie.  The prime example of this is Guy Pearce's incredibly\ntrite \"the bed is cold\" speech which begins with boring sensory detail and\ndelves into painfully bad rhetorical questions.  <br><br>Ultimately, this movie fails to bring a payoff to the audience.  It starts\noff as a beautiful film noir that melts into your mouth like a piece of dark\nchocolate.  but the bitter aftertaste will get you.\n"},
{"review": "\n\nMemento is an original idea in filmmaking, but it doesn't provide a\nsatisfying end.  The story builds up to a point where the audience is\nexpecting a major climax, but it never happens.  That lack of a finale makes\nthe journey much less rewarding in hindsight.  5 out of 10\nstars.\n\n"}
]