[
{"review": "\nHorrible; in my opinion.<br><br>I love all of these actors, and I love all the movies they play\nin...Hell I even went to the movie stoned thinking it would make it\neven funnier. Nope.<br><br>I honestly think I laughed MAYBE 5 times...Emma Watson was my favorite\npart of the whole movie...Well and Channing Tatum, that was kinda\nhilarious.<br><br>But really, so disappointed by this movie. 2 friends fell asleep, and\nanother friend and myself kept giving each other this look like \"Wtf\nare we watching..Is it over yet??\" Go see it if you dare, no one can\ntell you what to like and what not to like...But just know, you may be\nextremely disappointed like my friends &amp; I were.\n"},
{"review": "\nI feel like I saw a different movie than everyone else. It's simply not\nfunny, I think I laughed once. We really don't need to see a erect,\ngiant, detailed, graphic phallus in every movie, it's not funny. Then\nto have to sit through an extended portion of Satan walking around with\nhis junk out is not funny and not needed. I'm not prudish but this\nmovie adds male genitals just to do it, it was a lame movie. Write\nsomething creative like 40-year old virgin. This movie was lamer than\nPineapple Express and Your Highness. If you expect the wit of Knocked\nUp, you'll be as disappointed as me. Save your money. <br><br>None of the characters in the film are likable in the least, and they\nare supposed to be playing themselves. I do not know why people are\ntreating Seth Rogen like he is incapable of mailing it in because This\nIs The End is lazy and feels like it was mailed in to fulfill an\nobligation to the movie studio. I also feel cheated by the excellent\nreviews this movie received from the paid critics. How did anyone find\nthis trash funny?\n"},
{"review": "\nI thoroughly enjoyed the film, though in retrospect, I am not sure if\nit is really a great film--there's not much to compare it to. One\nthing's for certain: this film is not \"just like\" any other film you\ncould name. It is one of the funniest films I have seen in quite a\nwhile. And I am probably going to miss the Rapture as a result of my\nenjoyment.<br><br>The film has graphic sex talk and graphic violence. The dialog could\nhardly be any nastier. And of course, hardly more sacrilegious.\nHowever, despite all of that, the film is surprisingly good-natured.<br><br>This is not a film for children or for family viewing. Anyone who is\nsqueamish or easily offended should stay away.<br><br>And don't automatically assume that anyone over 40 would not like this\nfilm. I'm over 60; I had a great time. So I saw it a second time, and\nloved it even more.\n"},
{"review": "\nIf you've seen Superbad, Pineapple Express, etc., then you know the\ntype of humor this movie will have. I, for one, could watch James\nFranco, Seth Rogan, and Danny McBride leisurely eat a sandwich and\nmanage to laugh my butt off. Thankfully this movie is much more\nexciting than that. It's brilliant that they all just play themselves\nand manage to poke fun at their own lifestyles. Expect weed and drug\nhumor of course. The plot sets itself up for hilarity, as they all take\nrefuge in James Franco's fortress of a mansion while the world outside\nthem goes up in flames. Cabin fever mixed with dwindling supplies\nresults in hilarious situations and good one liners. <br><br>The movie made me laugh extremely hard and had all my favorite people\nin one film. I only wouldn't recommend this film if you're uptight and\nreligious.\n"},
{"review": "\nThis review contains spoilers.<br><br>This was absolutely the worst move I have ever seen. I chuckled two\ntimes in the entire movie and my girlfriend giggled MAYBE once. I\nlaughed my arse off at East Bound and Down seasons 1 &amp; 2. This movie is\non par/slightly higher on profanity and vulgarity but FAR lower on\ncomedy. This pile of sacrilegious garbage almost had my girlfriend and\nme leave (a first and we've seen some horrible films). In fact, if it\nweren't for the other people in the row we would have left. And on that\nsame thought, of all 12 people in the theater 2 other people DID walk\nout.<br><br>This movie can be summed up as horrible CGI, a bunch of drugs, a bunch\nof penises, and no humor. I wish I didn't waste 2 hours and $20 on this\ngarbage. I pity the human race if people seriously think this movie is\nan 8 (the rating at the time of this review).<br><br>1/10 is generous.\n"},
{"review": "\nWell, I am not an average American teenager who giggles and laughs when\nI see giant monsters with a tree size dick dangling around their body.<br><br>I lost 2 hours of my life that I can never get back and I feel very\nstupid about it.<br><br>I chose the movie after I saw the list of actors, many of them I really\nlike, but I can't believe they actually worked in this total piece of\ncrap.<br><br>Rapture seems to be the \"thing\" in Hollywood these days, the nonsense\nfrom fanatic religious crazies is coming to our home like a blessing\nwhile it tells us that we can be saved if we are truly \"good\".<br><br>And for gods sake, who wants to be in a heaven where people dance with\nthe used-to-be-cool back street boys!\n"},
{"review": "\nThis was without a doubt one of the most disappointing movies I went to\nin 2013 and I go to a lot of movies. I saw the previews and like the\nfact that Seth and his buddies were going to play themselves. All I can\nsay is the movie had a handful of funny scenes but had way too little\ncomedy overall for what I was expecting. It was also a movie with a lot\nof blood and some of the writing just looked like they were smoking pot\nwhen putting this together. ( for all I know that might be what Seth\nand company had in mind).<br><br>I like most of the actors in this movie for their previous work so I\nthought together this would turn out funny. Unfortunately This movie\njust wasn't funny. wait for it to be for sale for 5.00 at wal mart in\nabout a year or rent it at red box if you insist on seeing it but don't\nsee it for 10.00 or more!\n"},
{"review": "\nAlthough 'This is the end' does not have the greatest storyline in the\nhistory of film, it is a very inventive movie in its own way. The fact\nthat every actor and actress plays him or herself makes the movie quite\noriginal and refreshing. Besides that, there is also the fact that the\nmakers took an overused theme, the end of the world, and made it\ncompletely their own.<br><br>'This is the end' hasn't failed a second to make me laugh. It is a very\nclever and entertaining comedy, with hilarious and dirty dialogues. I\ndo have to admit, however, that the storyline can feel a little bit too\nridiculous from time to time, even for this kind of movie. The acting\nin the movie was not that spectacular, but the actors involved were all\nborn for this kind of movie.<br><br>For anyone who can truly appreciate a hilarious movie which is made\nspecifically to humor and entertain people, and has no other hidden\nagenda whatsoever, this is definitely a must watch.\n"},
{"review": "\nIt's amazing how deceptive a trailer can be. <br><br>What I thought would be a fun romp with a cast of well known actors\n(playing themselves), turned into a pile of steaming donkey barf - in a\nhurry. I made 30 minutes into this crap, before I decided that this is\nthe end of the road and I walked out. <br><br>I can only speculate as to what motivated the other 'actors' to\nparticipate in rubbish like this - some of whom have made some decent\nstuff on their own. <br><br>James Franco and Seth Rogen go together like sleeping pills and\nlaxatives.\n"},
{"review": "\nThe trailers are misleading and I believe that people who said that the\njokes were creative and of high quality are nuts. I went to see this\nwith my parents last night...now, I am in my 30, my parents are in\ntheir 50's, and we all loved Your Highness and other movies that some\nof these actors are in separately. Franco and McBride can be hilarious,\nbut this was far from their finest moment. Seriously, we collectively\nlaughed 4 times. I kept count. The only reason that I am giving this a\n2 and not a 1 is that there was a scene where some large 4 legged demon\ncame launching into the scene and my mother jumped and dumped half her\ncandy.<br><br>How do I get my money back for this complete waste? I feel completely\nand utterly duped. The reviews said it was great overall, I wonder what\nhas happened to society when an entire scene dedicated to an argument\nabout masturbating on a magazine is funny. There have been some funny\njokes about masturbation in other movies, this sure as hell isn't one\nof them.<br><br>I seriously want my money back.\n"},
{"review": "\nAvoid this movie at all cost, it is the biggest waste of 1.45mins\nCelebrity cameos will draw a lot of people in, but most of the real\nfamous people are killed in the first ten mins of the film starting.\nThe rest of the 90min film is downwards from there, It's not funny, not\ninteresting and is just plain awful. Has moments that will remind you\nof Little Nicky, which itself is awful too, but even if you found that\nmovie entertaining in any way, its still a million times more awful.\nSometimes films are so bad it's funny, and this probably was the\npurpose of the film, but it couldn't even do that properly, it was just\nplain awful. This film was only made to get the stars on screen and try\nto make it big at the box office, while celeb cameos and an OK trailer\nwill draw you in, don't be fooled, it truly is one of the most awful\nfilms ever made. <br><br>AWFUL!!!!!!!!\n"},
{"review": "\nHere's a date movie if you never want to see that date again.<br><br>Does indoor soccer with a severed head strike you funny? Screaming\nabout a soiled porn magazine when there is no food or water?<br><br>Nobody works too hard playing themselves and their perceived on screen\nimage, except Jonah Hill when he's doing Linda Blair. That's about when\nthe movie elevates from foul talking humor to more effective use of the\nmovie format.<br><br>Parts of the movie look like it was shot on a cell phone. The monsters\nseemed borrowed from \"Ghostbusters\", a far better movie. The script\nlike Franco's pop-up television seemed like it had been sitting around\nand was not fresh or current.<br><br>There are laughs, but at times it looked like even the cast was\nembarrassed by some of what was happening. The movie will be enjoyed\nmost by those on mind dulling drugs.\n"},
{"review": "\nThis is seriously one of the worst movies ever made and I feel\ncompelled to tell all who is just thinking on spending a dime on this\nuseless movie if you can even call it that - don't do it!. Only good\nthing about the movie was Michael Cera who had approx. 2 mins all in\nall. (Funny stuff by him), but as a movie it sucked in every category\nimaginable; script, acting, special effects....the list is long, too\nlong for me to even have the energy to continue this review. But I will\nsay one last thing and that is 'how the hell is it possible to get the\nrating of 7.1'? IMDb should really soon create some sort of\nghost-review detection, because no way in hell would this movie get\nabove 3 avg. If someone had not boosted it with multiple tens. Cant\nbelieve it - create a shitty movie with well known actors and get away\nwith it by tricking the audience on IMDb. Robbery in broad daylight if\nyou ask me.\n"},
{"review": "\nAbout the end of the world, but without the wit, charm, or\nintelligence.<br><br>Let's face it, Hope and Crosby could sing, dance, and tell witty if\noccasionally suggestive jokes. The closest thing to wit in this film\nwere the many ways they made \"d!ck\" jokes, along with the variations on\ndiscussing that subject that any moderately facile seventh grader could\nhave come up with.<br><br>This is like a really bad home movie, put together by a bunch of self-\nindulgent, overly-compensated actor friends when they were really\nwasted. So, naturally, they go for every coarse joke, every humiliating\nsituation, all of it with an admirable lack of self-awareness.<br><br>Complete waste of time. It's as funny as listening to a drunk try to\ntell a shaggy dog joke and he keeps losing his place. There's a tiny\nbit of fun watching him flail, but sticking around for the entire hour\nand forty minutes is sadistic to him and masochistic to you.\n"},
{"review": "\nBesides the weak gay plot there's nothing at all to it... childish and\nlame. And to be able to rate it I Must write 10 10! Lines of text about\nit! This is only line 7 and as much as I would love to write something\nuseful about it, There's nothing I can add. A waste of time. This is of\ncourse just my opinion...oh no wait...there's no skipping with\nparagraphs...this is now line 7, so I actually have to keep going about\na movie that added nothing to the 7th art...and I was wrong, this is\nnow line 8 so the previous was line 7. By now I think it may be clear\nhow much I disliked the movie, I actually (like always) watched it to\nthe end and as rarely as it does the movie was bad to a level that I'm\nhere hoping to save someone else from watching it. I think this is 10\nnow. How can this movie have a rating of 7.0!?!?\n"},
{"review": "\nThis will be my first review in IMDb, because this was the first movie\nthat made me laugh so hard.<br><br>First of all, you might think this movie sucks or it's worthless, but\nthis movie didn't bore me at all and it made me laugh, I don't usually\nlaugh a lot in movies, but this one got me.<br><br>The story starts with Jay Baruchel reuniting with Seth Rogen, Seth,\nthen invites Jay to come with him to James Franco's new house. After\nthat, all things get screwed up and they discover that it is the\nApocalypse. They decide to stay in James Franco's house until the\nApocalypse ends.<br><br>I love the way that they play as their selves and create a story all\nthrough out the movie. If you think this movie has no potential, that\nis where you are wrong. This movie will make your day and (IMO) and\nmake you smile.\n"},
{"review": "\nI was excited to see this movie when it came out. I'm a fan of 90% of\nthe actors in the film and I figured there was no way this movie\nwouldn't be hilarious. Oh boy was I wrong. It's important to note that\nI don't like \"stoner\" flicks to begin with and this certainly is a\nstoner flick, which I didn't expect from the previews. I think drugs\nwere either shown or mentioned at least every two minutes, there was a\ngood five minute back and fourth about male ejaculation, which was just\nannoying to me and not funny at all. I suppose I like more clever forms\nof humor.<br><br>Overall I just think it was a waste of having so many talented and\nhilarious actors in one film and probably the only thing that saves it\nfrom being the worst movie ever made is the fact that it's supposed to\nbe a comedy, so the horrible acting and storyline can hide behind its\ngenre because if you laugh at all, it'll just be over how stupid and\nasinine the whole thing is.\n"},
{"review": "\nOne of the WORST movies I have ever wasted my money on. Seth Rogen is\nthe same in every movie, this is no different. Jonah Hill was awful in\nthis movie, what happened?? Franco, nobody else is going to hire you if\nyou keep churning out this kinda crap (except Rogen, who hopefully\nnobody will ever sponsor for another movie). What do you do when you\ncan't write a full length movie? You make one like this. Film like you\nare filming your buddies at a party, and then include clips from other\nmovies you've made. The only reason I gave it two stars instead of one\nis there were a couple of spots in the movie that scared me enough to\njump in my seat. Other than that this movie was pure amateur hour crap.\nI want my money back!!!\n"},
{"review": "\nI honestly expected this movie to be funny, not\nwow-amazing-jokes-funny, but you know, a bit silly, a bit funny. It was\nquite sad how bad it was. I can't really believe the actors agreed into\ndoing this movie. I watched because Seth Rogen has been in some quite\ngood movies and I was hoping for some laughs. I guess putting a lot of\nfamous Hollywood actors is no certain ingredient for success. It was\nworse than the movie \"New years' eve\". The only part I liked was in the\nlast 25 minutes when it really got silly with all the demons and stuff.\nIt went to another level much more ridiculous but since it was too much\nit worked...I honestly don't know if you're supposed to be a bit stupid\nor high to actually enjoy the movie...sorry!!!!\n"},
{"review": "\nIf this is what passes for comedy these days, count me out. There are a\nlot of words that describe this twisted film--moronic, juvenile,\nmisogynistic, insipid and insulting are just a few. I knew I didn't\nlike it about five minutes in, and why I kept watching I'll never know.\nI guess I was hoping it would get better, but instead it just got worse\nand worse. The script must have been pretty easy to write, as every\nother word started with \"f,\" usually delivered as a scream. It got to\nthe point where I was rooting for the invading monsters. Oh, and if\nthis is the type of people I'll have to deal with in heaven, I think\nI'll opt to spend eternity somewhere else.\n"},
{"review": "\nOkay, we all have seen a lot of comedy movies but they were not good as\nwe expected. Or we always had to wait for a scene to laugh and t only\nmade us to smile a little bit! This is the End is a great movie!\nSurprisingly good. They are a lot of scenes that you get surprised and\nthat makes you laugh hard. The plot of the story is based on true\ncharacter names and that makes you wonder are they really the same\nperson in the real life? It was confusing because some part of the\nmovie was exactly about the real characteristics of the actors and\nthat's what I like about the movie! I think this comedy is far one of\nthe best comedies I've ever seen. Highly RECOMMENDED!!! 10/10\n"},
{"review": "\nThis whole movie is just a big big ad, period. I want your milky way.\nHere is our supplies, ad, ad ,ad, fruit, etc. The jokes were a joke. No\noriginality. The harry potter jokes were predictable, over the top and\nplain stupid. Emma Watson here? They needed a female hot girl for these\nbunch of idiots and they ruined it by their dumb macho predictable\nstaple cliché rape joke crap. I knew she wouldn't last long with these\nbunch of idiots.<br><br>Backstreet boy dance in the end? wow, what a good advertisement,\nreally, new album or new meeting anniversary? The CGI was laughable, an\n8 old with paint in windows95 can make better effects.<br><br>I knew this movie would suck, the good cast of actors couldn't save\nthis time agony. Movies are sucking really hard these days.\n"},
{"review": "\nAs a fan of spoof movies, I couldn't wait to get into this film, but\nthe first 10 minutes almost bored me to death. If it wasn't for Michael\nCera and Craig Robinson, I think the opening would have done me in.\nThen Cera was killed, along with many other potentially hilarious\nactors. And where did Paul Rudd go?! He crushed a girl's skull and then\nvanished, and I would have loved to have seen him in the movie.<br><br>The only bits that created a bit of a giggle from me included Robinson\nand possessed Jonah Hill. My boyfriend loved it, but then again he's a\nchild at heart. Penis, weed and sex jokes are aplenty. Too many, in\nfact. I was actually angry I paid for this movie, and was so happy that\nit had ended that I sang 'Everybody' with the Backstreet Boys. Do not\nwatch this film if you have two brain cells to rub together.\n"},
{"review": "\nThis movie had to have been conceived at a time when these guys were\nstoned. Just awful. A few laughs but the longer it goes on the worse it\ngets. The actors play themselves. It's like one big inside joke.\nExcessive in some of its violence and its lack of respect for its\naudience.<br><br>The monsters that appear as the world ends are borrowed from\nGhostbusters and The Fellowship of the Ring. Its one of those bad\nmovies that sticks with you the next day as you wish hadn't wasted your\ntime and could flush it out. But its one of things that doesn't go down\nwith the first flush.<br><br>Dedicated fans of these actors may tolerate it better than I did.\n"},
{"review": "\nIf this was the end, I couldn't imagine how torturous the beginning and\nmiddle were. When I first saw the movie, I though that \"it was the end\"\nof all of those actors and actresses' careers. The movie consisted of a\nlot of poor attempts at humor and the writing was centered around those\nfeeble attempts. <br><br>\"Hermione stole our ----.\" Really that's supposed to be funny? I don't\nunderstand how one can take so many talented actors and actresses, that\nhad literally the easiest task in the world of just playing themselves,\nand manage to screw that up. Well, that is exactly what the writers and\ndirectors did. I gave it a 1, not because it was truly that awful, but\nbecause it was that awful when it is compared to what it was hyped up\nto have been and when it is compared to what it potentially could have\nbeen, given all of the talent that was available to have been worked\nwith.\n"},
{"review": "\nThis movie is by far the worst piece of trash I've seen in a good 5\nyears. It's a shame because I was looking forward to seeing this after\nhearing they were going to bring all the cast in to do a comedy. Comedy\nit was not. Long story short, don't waste your time. You can pretty\nmuch get every comedic highlight by watching the trailer. The rest of\nthe film is slow, not funny and just plain stupid. My wife and I\nwatched it together. We're both in our mid-30's and enjoy slap stick\ncomedy or even improv at times. But this one was a complete insult to\nhuman beings and Christianity. Is Seth's trademark to add the male's\nmember to every flick he makes? I think the guy has a serious problem.\nAnyways, don't waste precious hours of your life to see this piece of\ntrash. And by the way, I'm appalled Emma Watson signed on to this crap.\n"},
{"review": "\nI was looking forward to seeing this movie.... I cannot express how\ndisappointed I am. With such an all star cast, you would think they\nwould be able to come up with more than dick jokes every 30 seconds. I\nam amazed this movie grossed $100 million+. I found the drug use found\nthroughout the movie to be very inappropriate and very stereo-typing of\nHollywood! It was aimed at being funny, but in the end it was very\nlame. There are all kinds of opportunities for the cast to be VERY\nFUNNY... but the script being so poorly written robs both the actors\nand the audience of any. I realize this was made quickly trying to\ncapitalize on the success of the Worlds End... but as they say... the\ncopy is usually poor quality and never as good as the original. If\ngiven the choice, skip this movie... it is a waste.\n"},
{"review": "\nIm justing voting 2 because I liked the Rihana part when she gets\nslammed in the butt. The rest was totally nonsensically stupid. Smoking\nweed in heaven was definitely stupid!! This director really likes to\nspend money for nothing, because this movie the one of the worst\nAmerican garbages I've ever seen. The apocalyptic theme was not\ncreative. It could have been more satirical like clever Monthy Python\nstyle. The end of the film is surely the worst of all. I just cant\nbelieve I wasted my time watching this trash. If I knew this movie was\nthat bad would would have watched porn instead and jerked off. Just\ndon't waste your precious time with it.\n"},
{"review": "\nseriously, i don't think that this movie deserve 7 stars. Really i have\nwatched it twice and i didn't laugh , it s not funny that's at all .<br><br>Also the trailer of the movie is what pushed to watch it, and the title\nis much better then movie it self, because when i read it i have\nThought that it gonna be a good movie with a good sins of humor but\nnone was in it.<br><br>The story line is boring,predictable. and i skipped some scenes because\nthey some HOMOSEXUAL content. <br><br>so as conclusion the is quit bad the actors aren't acting at all,the\nstory is horrible, its a stupid movie and SORRY\n"},
{"review": "\nI wish I wouldn't have watched it but its my fault for having any\nexpectations. It made me think less of the actors. There were parts of\nthe movie that were just gross. After watching ( and I did make it\nthrough the whole thing) I felt yucky. It is garbage because it's\ntrashy due to it's sexual content. How about all you actors choose to\nput yourselves in some better rolls without such violence and raw shock\nvalue sexual content?<br><br>Spoiler alert about cameo appearances: <br><br>On the up side there were a lot of appearances from celebrities that\nwere mildly entertaining. I was disappointed in Channing Tatum. I'm\nnever going to get that burned out of my mind. Made you go down on the\nhotness scale permanently if you registrar at all now.\n"},
{"review": "\nI don't know what all the bad reviews are about. I loved the idea of\nusing the actors' real names but creating alternate personalities. The\nhumour is great, and special effects are rather realistic! Also, I\nparticularly loved Michael Cera and Paul Rudd's appearances! Great job\nto the writers, directors and actors. For me, this was the perfect\ncombination of comedy, horror and sci-fi. There was a sense of doom\nthroughout, especially with the wide shots of LA, which made me feel\nquite uncomfortable, but then there was plenty of comic relief. <br><br>I don't often laugh at movies, but if you're looking for a relaxed,\nlight comedy, I would recommend this film.\n"},
{"review": "\nI was surprised I didn't like this movie. Really enjoyed Pineapple\nExpress and many of the other movies these actors have been in. I\nthought it started out well, but it was almost like they only had the\nfirst few scenes written and then they tried to fake the rest. I think\nI laughed about 4 or 5 times but that was it. My wife said it might\njust be the worst movie she's ever seen. Way too much with the sexual\njokes and references, it even lost its shock value at some point\nbecause they went on and on about it so much. Glad we only rented this\nand didn't see it in the theater, ended up wasting more time than\nmoney. Was really hoping for the end about 1/2 way through.\n"},
{"review": "\nThere is no reason for this film to exist. It's a foul, odious,\ncretinous waste of time. No talent was wasted in making it because\nthere is no talent evinced in its performances. There is no reason for\nSeth Rogen to exist in the entertainment industry. Hollywood already\nhas a curly haired idiot in Will Ferrell. There is no need for an\nunshaven, pot-addled version. If the phrase, \"F--k, man\" were struck\nfrom Rogen's vocabulary he would be rendered mute. James Franco should\nbe given a show selling knives and baseball cards and forgotten for\neternity. I watched 20 minutes of this movie on cable, turned it off\nand threw myself against my apartment walls for 90 minutes. It was a\nsmarter use of my time than this movie.\n"},
{"review": "\nMany of Hollywood's biggest comedy stars united for This is the End for\none of two comedies about the end of the week. Whilst Edgar Wright's\nThe World's End is the superior film that is consistently funny and\naction packed flick, This is the End does offer many laugh out loud\nmoments, using more crass and crude humour, having jokes ranging from\nmasturbation, stoner jokes and violent slapstick. Some of the best\nmoments include a trailer for 'Pineapple Express 2', Emma Watson's\ncameo and discussion between James Franco and Danny McBride over a porn\nmag. Other jokes are more miss or crude for the such as the demon's man\nparts. The main stars have excellent chemistry together and had a\nstrong dramatic with Seth Rogan balancing his old friendship with Jay\nBaruchel who hates LA and his newer friends in the city.<br><br>If all else fails at least Kevin Hart dies a nasty death.<br><br>If you enjoy this film then Zombieland and Dogma are worth checking\nout.<br><br>7.5/10\n"},
{"review": "\nThis is one of the worst movies I have ever had to sit through. I\nthought the movie was going to hilarious since I love all the movies\nthe actors were in previously but that was not the case. Drug and sex\njokes the whole movie, which I do not mind either in a movie but I hate\nwhen the whole movie is based around those two things. The only reason\nI watched the whole thing is because everyone I talked to told me how\ngreat the end was. The ending is the only reason I gave the movie a 2\nstar rating instead of of a 1 star rating. Having the Backstreet Boys\nsing one of their classics at the end was the best thing ever! The\nBackstreet Boys saved this movie from a 1 star rating in my opinion.\n"},
{"review": "\nIt is very easy for many writers and directors to think that humor and\ncomedy are an easy subject to work with. They believe in themselves so\nmuch, that they interpret this as a natural talent from birth. So they\nmake a movie that we supposed to laugh, or better say \"laugh out loud\"\nwith their sense of humor. <br><br>Well I have news for them. Their sense of humor lacks of humor. Even if\nsomeone becomes more moderate in judging them will say that their sense\nof humor is made for youngsters that do not exceed the age of ten.\nImaturity, stupidity, dominate this parody of reality shows and\nwhatever else is out there only made for brain cell damage. The length\nof the movie was sweltering and tormenting. As for the end? It came as\na salvation.\n"},
{"review": "\nWhen I was to watch this film involving Jonah Hill, Seth Rogen, Craig\nRobinson, Michael Cera or some of the rest from the cast I was not with\nexpectations for an Oscar-winner. While preparing my popcorn I thought\nI would enjoy a comedy that at least will not make me grumpier of what\nI was. Well, they proved me wrong. Not even that I could not eat my\npopcorn but I thought I would not finish the movie. The only reason\nthat made me see the credits is that I wanted to see how far the\nstupidity of the whole crew ( I am angry not solely with the cast but\nthe writers, one of them mentioned twice, the producers etc.);anyone\nwho was responsible for launching that feature throughout the theatres.\nI do not how they even managed to win anything. Respect to the game of\nacting but these young actors represented the opposite of that. Flat\nscenario, even flatter acting in this film.\n"},
{"review": "\nObviously this was meant to be some kind of spoof on disaster movies.<br><br>What they thought was funny was mostly, actually, crude and crass.\nThere was for example way to many direct drug scenes and references.\nApparently, the makers of this movie where in a drug induced haze for\nthe most of it's creation.<br><br>A lot of weird, supposedly straight, sexual innuendos and overt scenes\nthat don't come off right since it's mostly dudes interacting\n(specifically, missing the female element to make sense). Revolting,\nand nausea inducing. Does everything really need to be so explicit to\nthe last detail? Maybe for some people, but it's just not that funny,\nnor entertaining.<br><br>All of the baloney, lack of any real writing, and almost no story to\nspeak off, doesn't add up to any kind of movie you'ed want to watch. <br><br>In the end the plan seems to be that you have to be majorly stoned to\nlike this movie..\n"},
{"review": "\nStory was, well... interesting. Pretty much a ridiculous take on the\napocalypse. Human nature points in the story were a tad much to watch.\nExpect Seth Rogan and James Franco comedy, and you won't be\ndisappointed. If you expect Steve Martin/Dan Akroyd brilliance, you\nwill be disappointed. Take it for what it is- what with cheap jokes as\nfillers between really good ones- and you'll have a good time. It's\nkind of a dude movie (in case the trailer didn't look like one?), and\ndude movies are almost their own genre (please see the term \"chick\nflick\"). Anyway, a lot of the jokes were actually very original and\nthoughtful in spite of some of the delivery. It was a silly movie, and\nI was fairly satisfied.\n"},
{"review": "\nI do not often give reviews. However in this case i will, the current\nratings in IMDb 7.3 is just about right, the movie is an original and\nwill become a classic in time.<br><br>There is not much to not like about this film, Seth rogan and his clan\n(you will instantly be familiar with from other films) play themselves\nwhich i found exciting. Its not usual that you will see an actors play\nthemselves this in itself was refreshing.<br><br>What starts off as a light comedy turns into a full on movie on what\nArmageddon would be like through the eyes of Seth rogan. The best i can\ndescribe this movie is similar effect to From Dusk Till Dawn....<br><br>The special effects were surprisingly great, almost felt like Diablo\n(the game) in real life....<br><br>I really did enjoy this film to the point im going to watch it again,\nif your looking for a fresh comedy / horror / sci-fi then give this a\ngo.<br><br>8/10\n"},
{"review": "\nWell, it's the worst movie ever... probably.<br><br>Ugly faces, stupid plot, boring acting.. Well, it only shows the\nstupidity of the \"next generation\" young actors who can't say NO to a\nidiotic project like this..<br><br>But the worst thing is - NOTHING FUNNY AT ALL FOR HALF HOUR OR MORE. <br><br>And of course, a little bit of MILKY WAY advertising... Why do people\nwaste their life on such a stupid piece of s***t? Is Hollyweird movie\nindustry really on this low level of parody!? Does anyone remember what\na real comedy looks like anymore!?<br><br>AVOID. Your life is to short!\n"},
{"review": "\nThis is a great movie!! It is what you would expect from Seth and his\nfriends. ITS HILARIOUS! ! The morons who gives this a bad review needs\nto read a self help book of how to stop being such uptight as####$..How\ncan you review a movie from the perspective of a 9 grade English\nteacher with a paddle in his desk for a just in case scenario. Just\nwatch with a sense of humor..I know the BAD reviewers most likely\napplaud at the end of every foreign art film in black and white with a\nanxious grin with worried thought of not making it to the 5 o'clock\nwine tasting...The point is be your own judge..If you love any of Seth,\nJames or Jonas ' s movie's this would be worth making an effort to\nsee.. Love the movie hate the haters..\n"},
{"review": "\nI thought this was the end was just an excuse to give all the actors a\npaycheck instead of making a good film and I was wrong.<br><br>This movie was a great teaser and play on apocalypse films by mixing\nbiblical rapture with natural disaster.<br><br>Even with a huge caste this film still relievers screen time to each\nactor and allows them to shine. I never laughed so hard and the jokes\nwere spot on.<br><br>It does contain the usual trademarks of language, violence and\nsuggestive scenes. But it really works as a strength instead of a lazy\nattempt at writing a script that other new comers try out.<br><br>The special effects look real on a small budget and it helps set you\ninside the movie universe. <br><br>Don't be turned off by the trailer and give it a shot. Seth won't do\nyou wrong. Its another winner from the guys who brought you super bad\nand pineapple express.\n"},
{"review": "\nThis is the end (2013) was honestly one of the worst films I think I've\never seen! It wasn't funny at all, I mean AT ALL! I didn't even laugh\nor chuckle one time throughout the whole thing. Seth Rogen was soooo\nirritating here, I already hated Seth based on his previous roles in\nfilms, but this just made me hate him even more! And the rest of the\ncast was not quite as irritating, but still. The dialogue sucked, so\ndid the acting as a matter of fact. Also, the loaded up WAYY too much\non the non stop crude/sexual humor, it got to where it was just over\nblown, stupid, and annoying. Channing Tatum's cameo was the only part I\nactually enjoyed, and that's kinda sad. This movies was just dumb all\nthe way around, except for the 10 seconds of Channing Tatum, that just\nabout sums it up. 2/10\n"},
{"review": "\nI loved Superbad and for Superbad lovers, stay away from this. It has\nnothing to do about it! it's a piece of crap. These guys smoked some\njoints and came up with this crappy screenplay. Hate it! Gave 2 for\ncharity because actual vote would be 1. I can't figure out how this got\n6.7! I can just think that because some people rate it high because of\nthe actors and they actually didn't see the movie. I love these guys\ntoo, especially Jonah Hill, Seth and Michael Cera but this movie... I\ncan't find the exact words, but it sucks big time! I hope we get to see\nmore great movies from this crew in the future but rating this high\nisn't helping them distinguish crap from good work. I hope they come up\nwith a superbad II and clean their image, maybe I'm able to forget this\nhorrible movie one day.\n"},
{"review": "\nBefore I saw this film I was pretty excited for the unique approach and\npossibilities that it brought upon itself. The idea of actors playing\nthemselves in an Apocalyptic setup already had me laughing. But what I\ngot was so much more then what I thought I was going to. This is The\nEnd offers a mixture of comedy, action, disaster, and horror film all\nwrapped into one unique and flavorful film. Furthermore, I hope they\nmake more films like this where the actors play an exaggeration of\nthemselves because it makes for some really great opportunities for\nsome great comedy gold. Or at least really bright silver. However there\nare some issues thought. No movie is without flaws, but aside from that\nit is a good time to watch with friends or just by yourself. Either\nway, this film is worth buying at full price and a movie fit for a\ngrand movie collection. Check it out, you won't be disappointed. Here\nare my grades for the film: Comedy: A Uniqueness: A+ Acting: A-\nVisual/Special Effects: B- Music: B Directing: A- Overall: A\n"},
{"review": "\nFor the first 20 minutes, this movie was actually funny, an end of <br><br>the world comedy with some nice special effects.<br><br>But then Danny McBride showed up--This guy is a NOTHING, a no-talent\ncretin--Everybody else in this film is actually funny at one point or\nanother but not Danny--he absolutely ruined the film, or should I say,\nhe just made a bad film much worse.<br><br>The film had a good idea with a funny cast but it just got worse and\nworse....and worse<br><br>How this film grossed over $100 mil is stupefying to say the least.\nmore f-bombs than you can count, especially from that ugly nobody Danny\nMcbride\n"},
{"review": "\nI only made it about halfway through the movie...I kept watching and\nwaiting for it to get funny, but it never did. Maybe I'd have found it\nfunny if I'd been shrooming and had just watched Pineapple Express, but\nthis movie just plain sucks.<br><br>Most of the actors in this movie are generally funny, although Jay\nBaruchel is an absolutely terminal actor. Other than playing the role\nof a dork, he simply has no talent but, somehow he got mildly famous.<br><br>I guess this movie was a commercial success and some people liked it.\nMaybe there are just more people high on dope these days, which might\nexplain the popularity of the movie.\n"},
{"review": "\nexpected a story of sorts and some comedy with 'end of the world' but\nall I got was my intelegence insulted, poor acting silly story and even\nworse it wasn't even entertaining, where are these people going, iam of\nthe understand=ding that cinema was aplace of entertainment over the\nlast 2 years its decended into a pit of utter degradation and excessive\nswearing,unnecessary completely, if ifs not funny they start fffing and\nfart jokes, is this the quality of American writers, no have look at\nlots of TV, its seems to be so called younger Hollywood 'stars' stars\nthats a laugh, we as society supposedly look up to these 'stars' if\nthis is the case, god help the world as seen by others the USA is like\nthis. all this leads to more anti USA feelings around the world.\n"},
{"review": "\nWas looking forward to this but apart from a few funny moments it came\nacross as a Aaron Seltzer, Jason Friedberg Movie. Just your average\ninfantile high school, college humour, was expecting something a bit\nmore sophisticated from this mob but alas no. Can see why most of the\ncast died early this was lucky on their part. Yet another group that\nthink that if they appear in movies together then success is ensured,\nwell this is evidence that it doesn't. The special effects where not\nbad too, which I feel where wasted in this movie. I know it was a\nparody of sorts but I felt towards the end there didn't seem to be any\ndifferential in reality and fiction with the characters and I ended up\ndisliking them more. Only for lovers of puerile, toilet humour.\n"},
{"review": "\nYou know it is an awful comedy when it doesn't make you laugh at all. I\nthink the best bit was James Franco's \"ascension\", and even that only\nmade me crack a smile. Emma Watson's role in it is so minor, surprised\nshe was actually credited (probably only credited to say \"we have Emma\nWatson in this movie\". Similarly with Channing Tatum. I didn't even\nknow Rihanna was in it until I checked on here. If they had used\nChanning Tatum for more than 5 seconds this film may have actually been\nfunny. Massive let down, with all those big names. Wasted 2 hours of my\nlife, don't make the same mistake. Avoid this film, and if you do watch\nit be prepared to be disappointed\n"},
{"review": "\nI joined IMDb so I could share how idiotic this movie is. If I was in a\ntheater I would have walked out - something I've never done before.\nLuckily I was at home with three other people who shared my same\nsentiments. After giving it a full 40 very painful minutes we switched\nto something that required more than an 8th graders level of humor. I\ndidn't expect this to be crazy funny but the lack of intelligence was\ninsulting. I wish I could give something positive because I usually can\nfind a redeeming quality in (almost) every movie. I guess I could say\nthat it has some funny actors, just not funny in this movie. I'm truly\nsurprised that this movie had any positive reviews. Hopefully Seth\nRogan can improve as a film director.\n"},
{"review": "\n1. No writer. I retired and started writing novels. This story should\nhave hired a real writer. 2. No screenplay. The story wanders because\nsomeone turned on a camera at one of their parties and they decided to\nmake a movie. 3. Some fun special effects. I'll give them that. But\nthat wasn't the actors or director who did that. They knew a special\neffects team who could accomplish a number of cool effects. 4. Actors\nplaying themselves: does not a movie make. I adore Emma Watson and I'm\nfrankly embarrassed for her. 5. Watch the last fifteen minutes: that\npart is pretty good and fun. <br><br>No doubt this movie was planned over a weekend with too many beers\ninvolved. They must have said, \"Oh! We know how to make movies!\" Wrong.\nSee this if you want to see actors embarrassing themselves.\n"},
{"review": "\nI wish I could give it a rating lower than 1! If you are looking for\nsomething intelligent or a good storyline, don't watch this. This is\nsupposed to be a comedy, I may have blown some air out my nose in\namusement near the beginning, that was the extent of what I found funny\nin the movie.<br><br>I like the actors in this film and when I started watching it, I\nthought it would be good fun. Not even half way into the movie I was\njust wishing it would end! If you are a Christian, it is not a good\nidea to watch this, it's so full of blasphemy, I found it unbearable. I\nalways finish a movie, no matter how boring or stupid, this is the\nclosest I've come to stopping the movie.\n"},
{"review": "\nI went in watching this thinking I was getting light hearted humour\nonly to be faced with multiple freak deaths that were upsetting.\nRecycled, dark humour that is just off key and uncomfortable. Great to\nknow kids these days will be watching these degenerate pot heads\nthinking it's how to live. I'm tired of drugs being glorified in modern\nmovies. To quote the paparazzi in the movie, Why can't Seth Rogen play\nanother type of character? The deaths were gory and uncomfortable. And\nof course, black woman get's killed off first and pretty sure I saw two\nblack people die subsequently after that. Speaks volumes of our society\ntoday that gore is found to be funny and that death is something to be\nmade fun of. 'This is the end' of high minded society as we know it.\n"},
{"review": "\nDid not have 'high' hopes going to watch this movie, and unfortunately\nI was proved right. The whole basis of the comedy of this film was\nfounded upon the actors previous movie roles. Although this style did\npull it off in some sections (Michael Cera), mostly the comedy was just\ntrashy and lazy, substituting drugs and swearing for actual script.<br><br>Best part of movie: Michael Cera's 5 minutes on screen. Worst part:\nEmma Watson rape scene; ugly and unfunny.<br><br>All in all do not see this movie with any expectations that it will be\nalike Tropic Thunder, Pineapple Express or Superbad. <br><br>5/10, poor and cheap\n"},
{"review": "\nThis is hands down the worst movie I have ever seen. It started out\nmildly funny, then degenerated into something completely stupid, then\ncompletely disgusting and unfunny (and I love crazy, quirky movies in\ngeneral), and I found myself actually getting angry at these so called\nactors for not only making me waste my money (thank gawd I bought this\non PPV, if I paid to see this in the theater I would have been livid),\nbut wasting my time as well watching this drivel. It just seemed like\nan extremely lame attempt by a bunch of stoners to film their stream on\nconsciousness, most crude thoughts while extremely high. Maybe funny to\nthem, and perhaps a few other really stoned people, but otherwise a\ncomplete waste of time. Toss this one into the garbage.\n"},
{"review": "\nOverall this movie was pretty good, and super funny. I don't recall\nanother time when I actually laughed out loud numerous times throughout\na movie. The only reason this movie was so funny is the cast, if you\nput a whole different cast in the exact same story line with the exact\nsame lines it would be a horrible movie. There was a couple things I\ndidn't like though. Like Jonah Hills personality in the movie was so\nannoying, this was probably my least favorite roll he has played. <br><br>SPOILER The Funniest part by far was when James Franco was arguing with\nDanny Mcbride about cumming in his magazine. I was Rofling in the\ntheatre. I really hope they do some kind of sequel but I don't know how\nthey would considering what happened to everybody.\n"},
{"review": "\nThis Is The End is what most would call a parody of celebrity life; in\nthe film all the actors and actresses actually play their real\nidentities; Seth Rogen is himself, as is James Franco and other comedic\nstars. This in itself adds a new dimension to Rogen's films in respect\nof him writing the script and directing it. Whilst the end-of-days\nhappens around them, the comedic stars act like anyone would during a\nPost-Apocalypse film; turning on each other and deciding on matters\nrelated to surviving. <br><br>This film however also mixes comedy into the dark material, it's clear\nthere are a lot of pokes at religions, identities and even personal\nbias and prejudice. This mixed in with trying to find drinkable water,\nand edible food gives us some hilarious moments between the stars of\nthe film. This Is The End was well worth the price of entry, and I\nwould recommend it to fans of Rogen's earlier works for the sheer\ncomedy in it. Well worth the price of admission and snacks.\n"},
{"review": "\nI saw this movie opening weekend but did not review it right away\nbecause I was not sure of what I thought of it. It was not really what\nI was expecting. I was expecting a raunchy but light hearted comedy\nthat took light of a bad situation but instead the apocalypse in this\nmovie is taken very seriously. I was not so sure I liked that. But I've\nhad over a week to think on it and I have decided that Overall I really\nenjoyed watching This is the End.<br><br>I love the cast I think everyone in this movie is talented and really\nfunny. They all have such great chemistry together but also all have\nsomething of their own to offer. The funniest part of the movie for me\nand my friends I think was a several minute long back and forth between\nDanny Mcbride and James Franco but I would watch the movie again for\nthat scene alone So overall This is the End is a really fun over the\ntop movie. <br><br>I give This is the End an 8/10\n"},
{"review": "\n... by showing how diluted and self serving he really is. His writing\nis stilted and his films are basically advertisements for drug abuse.\nThis one is no different. In fact, it's even better. It glorifies the\nfollowing two potentially deadly situations: \"Oh wow, you just blew\ncocaine in someone's face who didn't want to get high. That's\nhilarious.\" \"Oh haha, you just put ecstasy in someone's drink when they\nsaid they didn't feel like doing drugs. You big joker!\" On top of that,\nthe movie is not good. It's a meandering mess. The opening is far too\nlong, the plot is obvious and boring, and the humor is geared\ntowards... spoiler alert... people who are too baked out of their minds\nto care.<br><br>I am so glad I didn't have to pay actual money to see it.\n"},
{"review": "\nYes, it is matter of taste, but I really cannot understand how someone\ncan like this movie, or even more I cannot understand how someone is\npaying serious money movie like this to be filmed. <br><br>Do not waste your time with this, terrible acting, terrible\nstory...just like every movie with this actors.<br><br>There was not a single funny scene.<br><br>Wanna be funny actors.<br><br>I think i just cannot enough bad words to describe what i have watched\nin this hour.<br><br>I even cannot watch until the end.<br><br>Maybe if was marijuana consumer, I would have some laugh, but even then\nI seriously doubt that\n"},
{"review": "\nWell I did not feel this movie was a very funny black comedy at all.\nAll of the actors(as themselves)received very nice ego massages. Are we\nsupposed to believe that 6 male USA actors most 30 years of age act at\nall times like crazy teenagers? The dialogue was the same mostly\npeppered with obscenities , weird homosexual acts,insults) all the way\nthrough..it got boring... The basic idea is brilliant but not put to\nany good use here .. Pity the British did not make this movie using\nPerhaps Hugh Grant . it would have been great. I also felt a lot of the\nlines were ad libs..am I wrong? The movie purported to cost $32\nmillion...what...it was basically filmed in a set.Combined of course\nwith C.G.I.shots.\n"},
{"review": "\nI understand that this is a directoral debut for Mr.Rogen but he could\nat least tried! The rule in football (for US citizen I mean soccer)\nthat not every player makes a good manager applies in this case - not\nevery actor makes a good director. Actually the \"horror\" part was the\nscript, there was no comedy so I can't critise that and there were only\nthree good parts in the movie - Rianna's death, Emma Watson wielding an\naxe and the fact that the movie ended. In my eyes this movie was a bad\ncombination of Meet the Spartans, Fat Pizza, Harold and Kumar and Scary\nMovie. What makes it worse than the other four movies is that they are\nunique in their stupidity and this one was dumb when it was written and\nthen took different stupid elements from Meet the Spartans, Fat Pizza,\nHarold and Kumar and Scary Movie!<br><br>P.S. - Mr. Rogen stick to acting. You are not that good of an actor but\nyou are far worse in directing. Save the world from the pain and DO NOT\nDIRECT ANYMORE!\n"},
{"review": "\nThis movie kept me and my girlfriend laughing so much throughout that\nour throats were hurting in the end.. It was inappropriate in many\nparts, but somehow even the parts that were grotesque were still funny.\nI found the film very fresh, very real, even though it was over the\ntop, and the religious themes were very cool and accurate, even though\npresented tongue in cheek.. Basically, just a really funny movie, at\nthe same time over the top and realistic, presenting truth in a way\nthat is disguised and not obvious, while awakening the kid inside.. I\nwasn't high when I watched it but still laughed non stop. It's 85%\nfunny and then has some unexpected serious scenes\n"},
{"review": "\nVery entertaining! This is one of the best comedies of all time with an\nepic plot! Think Harold &amp; Kumar meets Zombieland It has all the major\nplayers of comedy movies within the last few years and they all play a\ncrucial role turning this movie into comedy gold! The plot couldn't be\nmore interesting, the actors play as themselves in an epic house party\nturned apocalyptic.<br><br>It starts off entertaining enough with a more main stream approach to\nthe comedy, then turns into a more silly Harold &amp; Kumar meets\nZombieland comedy which probably isn't for everyone because it's so\nover the top. However, comedy knows no boundaries!<br><br>This movie pulls out all the stops, the comedic value of all the actors\nplaying as themselves while making fun of each other couldn't be\nfunnier and the clichés take it over the top, all that was missing was\na cameo from Woody Harrelson eating some twinkies!\n"},
{"review": "\nSimply amazing, fantastically written. Need more comedies like this.\nThe idea that they portrayed themselves gave this a unique type of\ncomedy that I think hasn't been done before, at least not to this\nlevel. The next best thing would be for this cast to take this idea but\nturn it into either some sort or \"trip\" movie or some other adventure\nand not the world ending which did give it a serious edge. If you see\nthis and think it is as amazing as i do-go ahead and find yourself\nwatching James Franco's roast it can almost make this movie even\nsweeter to see the real life crazy friendship they have and to almost\nsee that perhaps the James/Seth obsession that they portrayed in the\nmovie could almost be real. Enjoy the watch!\n"},
{"review": "\nThis is not a movie which would have appealed to me. In fact, I think\nthe primary demographic must be people who get stoned before every\nactivity. But, the STARZ cable guide gave it four stars so I thought it\nmust be at least decent, I mean, they don't give four stars to just any\nmovie. <br><br>While I get what they were going for, they just didn't pull it off. I\ncan handle crude movies, if they are funny, but this was just stupid\nand crude. I kept watching thinking it would improve, never happened. <br><br>I think the recent bad reviews are typical of people like me,\nfrustrated about being duped into seeing a terrible movie by a bad\nrating system.\n"},
{"review": "\nThe movie has so many talented people starring in it but was so\ndisappointing. After the first 30 minutes which had a few laughs, I\nbegan to just wait for the end of the movie.<br><br>Everyone has their opinions, some may like it, mine is that this movie\nstunk. Not the worst film I have seen but it is in the top ten of the\nworst considering the star power and budget it used.<br><br>I'm not a hater, don't hardly ever write movie reviews but this one\nmerited the time I spent to post a negative review.<br><br>Note to Hollywood: Most mainstream Americans do not like the over the\ntop vulgarity that this movie has. You can be funny and entertaining\nwithout trying shock people with it. Grow up.\n"},
{"review": "\n*** This review may contain spoilers ***<br><br>The fact that this stupid film has a score of 6.9 is unthinkable. It\nmakes you wonder what is wrong with the people that liked it. There is\nnothing of any sort of movie value in this piece of garbage.<br><br>It dragged on interminably, scenes with little comedic value got\ndragged out for far too long and where too far apart.<br><br>The two wasted hours of my life are something no one can ever give\nback. I wish I could give this movie zero out of ten stars.<br><br>I'll be avoiding Seth's movies like the plague in the future, and also\nI will question every score on IMDb from now on.\n"},
{"review": "\nDon't trust all the rave reviews and the movie critics that rated this\nfilm - it's all a paid sham, I kid you not.<br><br>This was the worst 107 minutes that I'll never get back. I would not\neven recommend this for at home viewing.<br><br>This is the End is a colossal waste of good talent. There's so much of\ngood talent in this film but don't let the glitter fool you. Like I\nsaid, Seth did a good job in ensuring awesome reviews and it's surely\nbeen cleverly marketed but that's all it really is.<br><br>Apart from the ratings, I enjoyed watching both Superbad and Pineapple\nExpress which is why I decided on watching this as well. I enjoy the\ncrude humor that's present in all of Seth's films but not this one.\nAfter painfully watching the entire film giving the story some benefit\nof doubt, I realized, I've just gotten shortchanged.<br><br>This story was absolute rubbish. Save your money and most importantly,\nyour precious time. You've been warned.\n"},
{"review": "\nI really do not understand how this movie has gotten so many bad\nreviews on here. I mean it is not an Oscar worthy film and I think some\nof these morons writing these reviews were actually expecting something\nlike that. I honestly don't think I ever went more than two minutes\nwithout seriously laughing hard. As an intelligent adult I expected a\nmovie where the actors were playing themselves for the actors to act\nlike themselves. So if you think these dudes are funny in real life you\nwon't be disappointed. Danny Mcbride was non stop cracking me up and\nthe back and forth between him and Franco was hilarious. I just wish\nthat Cera lasted a little longer and Paul Rudd too lol\n"},
{"review": "\nThis was the worst movie I have ever seen. These guys dropped in my\neyes. All the movie was about was getting high. It appeared that all of\nthem were doing a last ditch attempt in Hollywood. I only watched half\nthe movie. Not even worth the $1.60 I spent at red box. If only I could\nget my money back. If I can give any advice, do not rent the movie. I\nthink I got stupider by watching this. It was worse than the spoof\nmovies. I thought it was their way of making fun of the spoof movies.\nBut it wasn't. It's been years since Hollywood has come out with a good\nmovie. This movie was a complete waste of time. I don't think they\nreally made any money from the movie.\n"},
{"review": "\nHorror films and Comedies are so scrutinized and harshly judged more\nthan any other film genre out there. You'd think people would stop\ntaking things so seriously. <br><br>These are so many 1 star reviews on here for the crude and raunchy\ncontent. Did any of you see Superbad or know that Seth Rogen was a part\nof this? You have to know what kind of humor you are getting yourself\ninto. Those of you who complain and say how has the movie industry come\nto this...open your eyes and look around. This has been out there...\nsomeone has finally just been bold enough to go there on screen. <br><br>This film is basically Superbad and Pineapple Express's baby --- but a\nraunchy one that'd you would never take home to mom. <br><br>I laughed in every scene and consider it one of the best comedies I've\nseen in a long time. If you don't get offended - then you have no\nreason to not see this.\n"},
{"review": "\nOMG. <br><br>This movie was singularly the worst movie I have ever seen. Ever. There\nwas zero plot, zero real action, and the actors were portraying\nthemselves in a \"biblical apocalypse\". <br><br>Honestly, I was hoping to die laughing watching this movie just because\nof the cast, but it only made me want to take a shower after watching\nit. Not only was the humor disgusting and juvenile it made me want to\nthrow up more than once. <br><br>I am 100% positive that this movie was made to do one thing: take money\nout of people's pockets. It literally had zero redeeming qualities.\nThere wasn't a single scene other than the one where Emma Watson steals\nall of their drinks, that was good. Good for you Ms. Watson for getting\nthe hell out of their rapey house. <br><br>Seriously though, don't watch this movie. You would be better off\npainting your toe nails, changing the oil in your car, or playing in\ntraffic. All of which I wish I had done rather than watch this\nridiculous movie.\n"},
{"review": "\nMy husband chose this movie to watch at home. Although it got high\nreviews on this site, it wasn't exactly my first pick, but I was\nwilling to give it a try. I have heard of Seth, Jonah, James, Kevin,\nEmma, Rihanna and who doesn't know Channing, so I wasn't quite so\noblivious.<br><br>I waited...10, 20, OK, 30 minutes for it to catch my attention, but I\nwas bored to death! I am guessing the crass jokes and crude humor were\nto draw in the younger crowd. I am no \"dinosaur\", but I didn't\nappreciate the dialog.<br><br>It was a low budget film with a high dollar return, so obviously I am\nin the minority.<br><br>I think the high reviews of this movie were from the 16-21 year old\ncrowd. Honestly, it was a waste of my time.\n"},
{"review": "\nusually we ask how awful can it be? well it is the worst movie i have\nwatched in terms of comedy so far. did not laugh till the end. and at\nthe end you start laughing cause you have waited so long so a laugh. i\nthink the ones who are laughing are people like Seth rogen and Jonah\nhill. i know weed is good and all that, but i wouldn't make a movie out\nof a weed nightmare. stamp it with all the good names. and sell it to\nthe public to make some money. shame on all the actors like James\nFranco Michael cera Emma Watson. all the sh...ty memories of this movie\nwill haunt you in your future works. and it should cause you made us\nsuffer.\n"},
{"review": "\nThis movie was exactly what I expected and more. Filling it with dirty\njokes, weed, cameos, the apocalypse, religion, demonic possession, and\nmuch more. The idea and plot of actors playing themselves is unique and\nfresh. During a party at James Franco's house, the world begins to\ncrumble. Seth Rogen, Craig Robinson, Danny McBride, Jonah Hill, Jay\nBaruchel, and James Franco all try to survive the apocalypse, and most\nimportantly, try to survive from each other. From making a home-made\nsequel to 'The Pineapple Express' to getting high and listening to that\nridiculous Gangnam Style song, this movie has a little bit of\neverything. I highly recommend THIS IS THE END!!!\n"},
{"review": "\nThe idea seemed like a good one.A group of current Hollywood A listers\nplaying fictionalized versions of themselves in a fictionalized idea of\nhow the world will end.The basic idea is funny.What is presented to us\non film is not.What we have here is a\nvile,tasteless,vulgar,sacrilegious piece of garbage of a movie.The\nlanguage in this atrocity alone made me sick to my stomach.That seldom\nhappens to me.You blew it,guys.You took what was a hysterical idea that\ncould have potentially been labeled a classic sometime in the\nfuture,and turned into something I wouldn't contaminate my garbage\nwith.I went in wanting to like it,and came out wishing I hadn't wasted\nthe rental.\n"},
{"review": "\nAnyone notice how mediocre, creative-less movies ALWAYS have the dance\nscenes at the end (usually with an old pop song that used to be\npopular)? <br><br>My theory is they throw in the dance ending to try to have you leave\nthe movie with a good feeling, because they couldn't do it with the\nmovie itself. <br><br>As for this movie, how it is rated so high is beyond me. There were\nfunny moments, but mostly felt mundane. Then the dance at the end just\nconfirmed my gut feeling through out the movie. This movie reminds me\nof: Scary Movie series, Not Another Teen Movie, Meet the Spartans.\nMovies with jokes desperately trying to get at least a chuckle out of\nyou.\n"},
{"review": "\nI watched this movie last night, primarily because\nreaders/viewers/users rated it 7.2 here on IMDb.<br><br>Well, that was the dumbest two hours of my life I've ever spent.<br><br>Who rates these movies on IMDb, ten year olds? How on Earth this movie\never received a 7.2 rating is beyond me. It does confirm one thing,\nthough - people are more asinine (look it up in Google, 10 year olds)\nthan ever. I cannot believe the level of stupidity to which we have\ndescended as a species.<br><br>I rated this movie a 2 only because there are worse movies out there -\nany Adam Sandler movie, for instance. But make no mistake, Seth Rogen\nis making a run for Sandler's undisputed title of World's Worst movie\nwriter/producer/actor. I'm sure the Razzies will bear me out.\n"},
{"review": "\nI read a few positive results for this movie, and decided to give it a\nchance, especially because it was rated as comedy. I must say the only\nsmile I managed to produce was when the film was over. I guess the\nrelatively high score of this film is because it gets reviewed by\npeople who like this kind of humor. <br><br>For me it was total boredom. It is a mix of adolescent-type movie with\nwarm friendship feelings, reunions, whatever. It starts silly and\nevolves into total nonsense. In summary you spend most of the time with\nthe main characters yelling around because something is burning,\nfalling down, or chasing them. <br><br>Even Eurotrip was more fun than this crap. Avoid it at all costs.\n"},
{"review": "\nI've enjoyed a slew of films Seth Rogan co-wrote or acted in, only to\nfeel mislead, betrayed, and lied to by the critics who praised this\ntasteless and largely humorless (except to teenagers and those with\nteenage tastes)film so vociferously (yes, I'm addressing you Michael\nPhillips and you Richard Roeper -- you lied). While I found about 10\ngags to be genuinely hilarious, most of it was repetitive, vulgar\nsolely for the shock value of being vulgar, and largely incoherent.\nWith the exception of Emma Watson's tongue-in-cheek (on the face, not\non the butt where most of the jokes landed) performance, the acting was\nsub-par for a Seth Rogan flick. I can see how teens could like it, but\ndon't call this a \"good\" film in any way. Adults of any age, beware.\n"},
{"review": "\nAs you can see from my 9/10, I loved it! I love the dry humour they\ncome up with. Seth Rogen, James Franco, Danny McBride, Jonah Hill, Jay\nBaruchel and Craig Robinson are so funny I actually clapped during the\nmovie! Twice! And that hardly ever happens! More like, it never\nhappens.<br><br>I've laughed for most of the movie. They came up with all this\nridiculous stuff that was basically so stupid it was funny!<br><br>If you like Pineapple Express, Knocked Up, Superbad, etc, you will\nabsolutely love this movie! Go and see it for yourself. If you don't\nlike the above mentioned movies and don't have a sense of humour then\nplease don't bother...<br><br>This movie is filled with graphic sex scenes and graphic violence,\ndefinitely not a movie for a Sunday with the family. Especially if you\nwanted to take the kids...\n"},
{"review": "\nAwful... Awful.... Awfulll........ How the hell this movie got 62 meta\nscore......... Now I'm seriously doubting on IMDb credit score........\nNot even a single good laugh in this whole movie...... Watch a\ndocumentary instead of this movie, you'll get something out of it, I'm\nsure of that...... No doubt, Seth Roger produced this movie . No other\nperson in his right mind will produce this movie... None of the\ncharacters in the film are likable in the least, and they are supposed\nto be playing themselves. I do not know why people are treating Seth\nRogen like he is incapable of mailing it in because This Is The End is\nlazy and feels like it was mailed in to fulfill an obligation to the\nmovie studio. I also feel cheated by the excellent reviews this movie\nreceived from the paid critics. How did anyone find this trash funny?\nJust don't watch it ! Waste of time....\n"},
{"review": "\nThis is one of the worst movies i have ever seen. The acting is good in\nsome cases, awful in others. The story... what story? someone wrote\nsome things on a paper while high on drugs. Complete non sense. The\nbeginning does not promises much but you can stand it, but as soon as\nthe aliens or whatever was that happens it's the worst piece of crap\nHollywood spit out on a long time. This movie lives from the names of\nthe actors, and nothing else. It's not funny, rather dumb and it's dumb\non a all new level of dumbness. The dialogues go for what seems like\nforever with no objective in sight. The movie is called \"This is the\nend\" and i really wanted the end to come fast, but it last for what\nseem like a millennium, so i just went way. What a waste of time.\n"},
{"review": "\nThis movie is not funny at all, the jokes are not even jokes but just\npathetic swearing using gay references in the sentences. If you have\nseen the movie 'My name is Bruce' which was a crap then be ready to see\nworst. I wanted to stop the movie at the middle when watching it, I was\nhopping some change or something coming out after but unfortunately\nnothing came out. I was just feeling my brain going out at every\nminutes. I think that people should stop to go to see movies like this\nso producers would produce proper movies like in the past (E.g: Madame\nDoubtfire). After finishing the movie, I was wondering If the world\nstarted to be like in the movie Idiocracy which was not good as well by\nthe way. I fear for the future of the cinema when I see the kind of\nprofitable trash which can be produced.\n"},
{"review": "\nWent to see this film today, expecting to see an enjoyable comedy - boy\nwas I wrong on both counts! <br><br>Acting (what there was of it) was wooden &amp; terrible. Every sentence\nthat was uttered contained the \"F\" word. Not sure how drug references\nthey squeezed in but they managed! <br><br>Surprised Emma Watson agreed to do this movie, sure she's regretting to\nnow!<br><br>Unfortunately I decided to persevere through it. Two hours of my life\nI'll never see again.<br><br>Avoid at all costs!\n"},
{"review": "\nSeriously... what were they thinking? This starts like it might have\nsome real humor, but it flops real quick... no character nor story\ndevelopment... just a bunch of idiots being scared and doing stupid\nthings... Its in fact as if they did smoke a lot and wrote a silly\nmovie and thought the day after, \"hell I bet we can make this and\npeople would watch it just because we are in it\". I stopped half way\nthrough and thats very very very rare that i do that. Yeah its as if a\nproducer lost a poker game or something... I feel; and i'm not often\nthis way; bitter. That these kind of ideas can be made into a film... I\nmean there is an guest appearance by Emma Watson AND Rihanna!\nSeriously... Does a name or two really open doors to hell?<br><br>So, hope you make the right choice for you... Peace. L.\n"},
{"review": "\nI don't know what it is with American comedies these days but the\nmajority are beyond awful and this ranks near the very top. They joke\nin the film about each other's careers (as each 'celebrity' plays\nthemselves) but the joke is on us; the viewing public.<br><br>The fact is most of these guys haven't released a decent film between\nthem. Seth Rogan plays himself which is more less the same character he\nplays in every other film and it's not funny. The rest of the cast are\nequally as bad. These are supposed to be the 'new breed' of American\ncomedy actors but if this is the best they have to offer, I'll look\nelsewhere for my laughs.<br><br>The only time I did find myself laughing was literally because it was\nso bad it was funny. I'm sure some of the \"smart\" fans will be quick to\ntell me that was the point of the film but I fail to accept that as\nexcuse for making such a terrible movie. If you're going to buy this or\nrent it I'd seriously recommend you save your money.<br><br>Craig Robinson is about the only plus that comes from this film. AVOID.\n"},
{"review": "\nI cannot believe the high rating nor the critic reviews. This film was\noverly long and NOT funny! I like all the actors in this film and have\nenjoyed them in other films. I figured putting them all together in one\nfilm, co-written by Seth Rogen, would be a winning combination. I was\nshocked that the film dragged and hardly had any funny moments. This\nwas a major disappointment and I feel that I was mislead by the high\nrating and mostly positive critical response. You do wonder if they saw\nthe same film you saw because I'd like them to explain to me what was\nso funny about this mess and why did it have to be so long? I think our\nexpectations have become so low because there are so many bad,\nunprofessional films being made. If this qualifies as exceptional\ncomedic material, then it's time for me to stop watching comedies. So,\nwatch at your own risk and good luck!\n"},
{"review": "\nI started watching this film purely because of the decent score it had\nreceived. I should have known better. Yet again Seth Rogen and pals\nstar in a \"comedy\", that would only make the simplest of teenage boys\nlaugh.<br><br>The story itself is fairly interesting and I hold nothing against gore,\nbut the dialog and the attempted humor are on a level that a monkey\ncould achieve, and to be honest, this style of comedy hasn't been fun\nfor over a decade (Beavis and Butthead was good at the time, not now).\nI understand in some ways that humor is subjective and thus not anyone\ncan like every kind of comedy, but this brain damaging rubbish just\nmakes me sad at the decadence of this society.\n"},
{"review": "\nI was fortunate enough to watch a screening today in Miami and let me\njust point out, this movie is exactly what you would expect from Seth\nRogen in terms of comedy. Its non stop laughing from the opening scene\nto closing. Everything about this movie is great, the story, the\nactors, and the comedy. Having such funny actors like James Franco,\nSeth Rogen, Jonah Hill, Jay Baruchel, Danny McBride, and Craig Robinson\nplaying themselves all in one movie just makes it that more\nentertaining. If you liked the comedy in Superbad and Pineapple\nExpress, you will love This Is the End. I recommend this movie to\neveryone who has a sense of humor. Like everyone that stood in line\nwith me to watch it almost two months early, you wont regret it. 10/10\n"},
{"review": "\nWas lucky enough to see a preview of this tonight, and can recommend it\nto anyone looking for a funny, modern and silly yet at times shocking\ncomedy. Not sure how it can have a score of only 6.4 at the moment, the\nfilm is easily the best comedy of the year so far and deserving of an 8\nor my case a nine as i was so pleasantly surprised by the quality of\nthe jokes and the story.<br><br>The cast is perfect and the cameos aren't there to fill out the movie\nand take up time, they are excellent especially Emma Watson and Michael\nCera. There are a few scary jumps on the way but the humour will carry\nyou through it, as i said the story so well written you'll go with the\nflow.<br><br>Go watch it you won't be disappointed!\n"},
{"review": "\nThis movie is absolutely ridiculous and hilarious for it. Im not\nshocked at the bad reviews because this movie is definitely for a\ncertain type of crowd. If you're truly a fan of each cast member,\nyou'll love them. If you loved Jonah Hill in Superbad, you'll love this\nmovie. If you like ridiculous shows like Eric Andre, you'll get the\nover the top sarcastic humor. If you enjoy cussing, insulting your\nfriends, making masturbation jokes, you'll get the humor in this movie.\nI've seen this movie dozens of times, and will always laugh at the same\nparts, and i always catch little parts that I didn't before. Its my\ngo-to laugh, get me out of a bad mood movie. Don't take it so\nseriously!<br><br>And most importantly, if you grew up in the 90s and are nostalgic for\nBackstreet Boys, you will obviously love this movie!<br><br>Forever one of my favorites.\n"},
{"review": "\nThey sure have a crowd that can and should entertain, and they do, but\nthis comedy was not how I pictured it, it was however very good in the\nform it was. This is very enjoyable and the fact that all the\ncharacters play them self is just a great thing, they are strange,\nfunny, corny, cruel and much more, but it makes it all hilarious and\nvery down to earth.<br><br>There are a lot of smaller stories going on and the characters really\ntake a toll on each other with their different behaviors and strange\nattitudes and the Bromance is really hitting a high through out all of\nthe movie.\n"},
{"review": "\nComing from school of Pineapple Express school of comedy, this is\nanother stoner comedy on a bigger canvas. Directed by Evan Goldberg and\nSeth Rogen, and starring Seth Rogen, Jay Baruchel, James Franco, Jonah\nHill, Craig Robinson and a host of other actors playing themselves,\nthis is a stoner comedy wrapped in the cloak of disaster and\napocalypse. The above mentioned actors try to survive an apocalyptic\nevent by holing out in Franco's new house. While trying to survive,\ntheir interpersonal relationships come into focus and makes them\nintrospect. There's little significance of actors playing themselves in\nthe movie, apart from adding to the quirkiness of it. The comedy gets\nstale after sometime. The plot and the pace of the movie are its saving\ngraces and keep you hooked to the story, somewhat. Watch it if you are\na fan of Pineapple Express kind of comedy. It is an anti thesis of the\nbig budget, big drama, big action disaster movies Hollywood has on\noffer.\n"},
{"review": "\nThe cast of the movie is epic and they know each other, which can be a\nvital part in the production. <br><br>The plot is simple the world is ending and two best friends are stuck\nat Francos house. <br><br>The acting is good, but a little relaxed and calm. The film has it low\nand high points, but is usually very exiting. Every actor plays as\nthemselves, and i think thats just awesome, it brings the character\nmore together. <br><br>The writing is just casual but no comedy movie is a 10 out of 10. <br><br>Sound effects are both really good or just awful. I feel like Emma W\ndidn't do her part good enough, and she was just having fun. of course\ni believe the cast itself planned all long to have make it kinda joke.\n"},
{"review": "\nMy opinion might be a little bit biased just because I like any movie\nwith Seth Rogan in it. I liked the choice of actors in it. And I also\nliked how they made the actors in this movie play themselves, it's\npretty original, and not a bad choice. The plot had a few turns, but it\ndid get back on the subject, there was also a good amount of a\nsupporting cast as well. The movie kept me laughing and entertained\nthroughout the whole movie The only issue I have is this film has a\nlittle religious propaganda, I personally have no problem with that,\nbut I believe it's just not necessary. But all in all, I enjoyed the\nending as well. So if you're a fan of the actors in this film, then you\nshould definitely watch this movie, I guarantee you won't be\ndisappointed, and I really would consider watching it twice.\n"},
{"review": "\nWhile attending a party at James Franco's house, Seth Rogen, Jay\nBaruchel and many other celebrities are faced with the apocalypse.<br><br>If you like seeing celebrities playing caricatures of themselves, this\nis the film for you. Many of the guys involved in \"Superbad\", \"Freaks\nand Geeks\" and \"Pineapple Express\" have come together to make a film\nwhere their friendship is tested by the end -- and it is pretty\nhumorous.<br><br>Not everything is great. There are dull parts, and the humor relies on\nthe characters being recognizable (for all I know, these guys will be\nforgotten in ten years). But some of the lesser roles -- Michael Cera\nand Emma Watson especially -- are well worth checking out.\n"},
{"review": "\nI was keen to watch this movie as it starred Seth Rogan and Jonah Hill.\nThe movie starts well and seems promising. However, the story never\nreally starts at any point. It just drifts aimlessly. <br><br>With so many comedy stars one expects hearty laughs throughout the\nmovie. Though there are few funny moments, i never hots the spot. Also,\nthere is lot of references to previous movies which would go flat if\npeople haven't seen them.<br><br>I felt they could given Emma Watson a stronger character. Also they\ncould have used the devil to add more scare and action. But it looks so\nfake and meaningless. The director seemed to be struggling to end it\nsome how and had no clue about it. I just kept waiting for it to end.\n"},
{"review": "\nI usually hate stupid comedies and have never even seen most of the\nfilms made by the guys in This is the End but I actually enjoyed this\nfilm far more than I expected. I didn't get the references to their\nother films but that didn't matter. There was plenty to appreciate in\nan obvious goofball way. <br><br>I like end of the world films and there are so many of them that it is\ndifficult to be original but there was something so off the wall about\nthis one that I laughed out loud quite a bit. It was so absurd,\nridiculous, and taken to extremes but in a way that was sweet at the\nsame time it was gross. It's the way that guys are and the way they are\nwith their best friends when anything goes, particularly if it's the\nend of the world and you're all scared and all using drugs and all out\nof control.... <br><br>I guess you have to have a certain kind of twisted sense of humor to\nappreciate this film. It was what they call over the top but I like the\nfact that they pushed the envelope to the extent they did...\n"}
]