[
{"review": "\n\nAlthough I had expectations ( from watching the trailers ) that this\nmight be a good movie, I was still surprised that it's as good as it\nis. The story is actually more complex than I had expected, involving\ncursed pirates and their quest to rid themselves of the curse. I won't\nsay more than that so as not to spoil it if you haven't seen it.<br><br>There aren't as many action scenes as I had thought there would be in a\npirate movie, but the ones that are in the movie were very fun and\nenjoyable. After seeing it, I think it had the right balance of action\nand drama. There are also, of course, a lot of funny bits interspersed\nbetween the action and drama. Some really good special effects also add\nto the enjoyment of this movie.<br><br>I wasn't much of a fan of Johnny Depp until I saw this movie. I think\nhe deserved to win the Academy Award for best actor. It's largely\nbecause of his performance, IMO, that the movie was so good. Most of\nthe supporting cast did well, mind you, just that Johnny Depp stood\nhigh above the rest. I did find Orlando Bloom's performance a bit\nwooden, but other than that the acting was good.<br><br>Basically, it's a really fun movie and I'd give it about 8 out of 10\n\n"},
{"review": "\nDisney seemed to be going down the tubes lately, with Atlantis and Home\non the Range, but this movie is a masterpiece. If it wasn't for this\nmovie, Johnny Depp wouldn't be as famous as he is today. Every scene\nwith him or Geoffery Rush is brilliant. The movie is very crisp and the\nshots of the islands are breathtaking. Definitely a movie worth picking\nup at Blockbuster or even better, buying ( I don't buy DVDs often but\nthis was one of them). The characters are thought out very well and\nplot is excellent. The script is one of the main stars of the film\nitself, every line that seems to come out of Sparrow or Barbossa's\nmouth or any of the other cast is original. If you like action films\nyou'll love this, if you like comedy you'll love this, actually, this\nmovie is great for everyone (except small kids, who may get frightened\nby the skeleton scenes). 10/10\n"},
{"review": "\nYou will always remember this as the movie that made Johnny Depp a\nsuperstar and almost got him an Oscar.The fact that he didn't win isn't\na problem,since thanks to him this is the best pirate film ever made.<br><br>The opening concept is a clichè:a beautiful woman(Keira Knightley)is\nkidnapped by a bunch of filthy pirates(led by Geoffrey Rush's\nBarbossa)and the man(Orlando Bloom)who's desperately in love with her\ndecides to track them down.From now on,things get unexpected,as he asks\nanother pirate for help.And it's no ordinary pirate:it's Captain Jack\nSparrow(Johnny Depp),a lying,cheating,but charismatic scumbag,the\nhardest man on Earth to predict,not to mention quite unlucky and\nclumsy(\"You are,with no doubt,the worst pirate I've ever heard of\" \"But\nyou HAVE heard of me!\").<br><br>It's got all the elements of a classic pirate movie,elements that would\ngive this flick a 9/10.<br><br>So,why am I giving it a 10/10? The answer is simple:Captain Jack.From\nthe moment he makes his entrance,justly included in the Empire Top 10\nEntrances of all time,we know he's the reason people will keep watching\nthe movie.He 's Depp's best non-Tim Burton-character ever,and I can't\nwait 'til he returns.<br><br>See you next summer,Captain!\n"},
{"review": "\nThis is a fantastic movie full action, adventure, humor and a hell of a\nlot more! The film is 2 hours and 40 minutes long, but that time flies\nby as you are transported into an awesome world of swashbuckling and\nsword fights.<br><br>Johnny Depp's performance is one of his best ever as the slightly camp\nCaptain Jack Sparrow. Even under his tangle of hair and blackened eyes,\nhe will make you swoon and laugh both at the same time with his tonnes\nof witty lines and mannerisms. Orlando Bloom plays the love struck son\nof a pirate, Will Turner and play him he does! This roll highlights the\ndiversity and skill shown by some of the greats. We will definitely see\nbig things from him in years to come. In her second roll in big time\nflick, Kira Knightley plays kidnapped Govener's daughter, Elizabeth\nSwan. She is also another young, up and coming star with a bright\nfuture ahead of her.<br><br>The film may not be the most historically accurate pirate film of all\ntimes but all that is forgotten as you enjoy the brilliance of this\nmarvelous movie. Did I also catch a subtle omage to the 1953\nswashbuckler 'The Crimson Pirate' when Will and Jack walk underwater in\nan upturned rowing boat? Sneaky!<br><br>The only negative thing I have to say, and believe me I don't want to\nsay it, is that fact we are never told the reason why the curse of the\nblack pearl could only be broken by the blood of William Turner\n(Senior) and in turn by his son. Despite this plot flaw however,\nPirates of the Caribbean is a magical journey that will drop the jaws\nof parents, children and grandparents alike. I'm definitely buying it\nwhen it come out on DVD!\n"},
{"review": "\nWhen the daughter of the governor of a Caribbean island, Elizabeth\nSwann (Keira Knightley), is proposed by Commodore Norrington (Jack\nDavenport), she faints, fells into the sea and is rescued and saved by\nthe pirate Captain Jack Sparrow (Johnny Depp) but he is arrested and\nsentenced to death for piracy. Meanwhile, the town is attacked by the\nship Black Pearl, commanded by the former first mate Barbossa (Geoffrey\nRush), who leaded a mutiny against Captain Jack Sparrow years ago.\nBarbossa kidnaps Elizabeth, and the blacksmith Will Turner (Orlando\nBloom), who loves her, releases Jack Sparrow and they steal the fastest\nvessel of the navy to follow the Black Pearl, Will trying to save\nElizabeth, and Jack trying to retrieve his ship. Along their journey,\nmany secrets are disclosed about the course of the Black Pearl and her\ncrew.<br><br>The supernatural adventures of Captain Jack Sparrow, Elizabeth Swann,\nWill Turner and Barbossa are so spectacular that really deserves to be\nincluded among the best movies (Top 250) in IMDb. This film has action,\nhumor, romance, mystery, special effects and is so delightful that the\nviewer does not feel the running time of 143 minutes. I saw this movie\nfor the first time on 24 April 2004, and I have just watched again\ntoday (10 Feb 2007) enjoying the same way as in the first time. My vote\nis ten.<br><br>Title (Brazil): \"Piratas do Caribe \u0096 A Maldição do Pérola Negra\"\n(\"Pirates of the Caribbean: The Curse of the Black Pearl\")\n"},
{"review": "\n\nThis is a movie to sit back and enjoy. Funny, fast-paced and with sterling\nperformances from all of the cast, it's not to be missed for good,\nold-fashioned entertainment. I'm not a huge fan of Depp, but here he\nexcels.\nKnightly and Bloom make an engaging couple and I enjoyed the fact that the\ncharacters of Governor Swann and Norrington were taken in a different\ndirection from that which might be expected by Hollywood. The former could\nhave easily become the stereotypical \"You'll marry who I say you'll marry,\ngirl!\", while Norrington could have been the standard English navy bully\nand\nnasty piece of work. Instead, both were engaging good guys and\nNorrington's\ngraceful dealings with Will and Elizabeth brought a core of humanity to\nthe\nmovie.<br><br>And to the previous reviewer who thought they'd spotted a plot\nhole:<br><br>S<br><br>P<br><br>O<br><br>I<br><br>L<br><br>E<br><br>R<br><br>[quote]while there`s a serious plot hole at the end where it`s revealed\nthat\nJack Sparrow has been suffering from the curse all along so how did he\nmanage to stay out of the moonlight without anyone noticing his skeletal\nstate ? And how did he manage to get drunk on rum ?[/quote]<br><br>Actually, you just weren't watching the movie properly. Jack wasn't in a\nskeletal state all along. Shortly before the swordfight in the caves with\nBarbossa and being shown to be skeletal, Jack stole one of the cursed\ncoins\nfrom the chest. When he was stabbed by Barbossa, he became skeletal\nbecause\nhe was cursed from that moment on. This was made clear at the time when\nJack's response to finding out he was suddenly skeletal was to declare,\n\"That's interesting!\", flip the stolen coin between his fingers and tell\nBarbossa, \"I couldn't resist.\" Indicating that he was aware that it was\nhis\nstealing the coin that had turned him skeletal once he was stabbed.<br><br>\n"},
{"review": "\nWhat lifts this film above typical Disney fluff is Johnny Depp's\nhumorous performance as pirate Jack Sparrow, the eccentric,\nindividualistic anti-hero, who confronts other pirates, and outwits a\nhumorless, incompetent bureaucratic establishment. Sparrow looks more\nlike Cher than Johnny Depp, and talks more like William F. Buckley than\na pirate. Geoffrey Rush is a worthy foil as the main rival pirate,\nBarbossa, a character who vaguely resembles Margaret Hamilton in \"The\nWizard Of Oz\".<br><br>Most of the plot is silly. There's lots of fighting, shouting, and\ngeneral mayhem, all accompanied by a frantic score. It's a cinematic\nslight of hand that conveys an illusion of substance. Still, it's an\nentertaining popcorn flick. <br><br>I'm glad I watched it. Depp's deft performance gives us a memorable\ncharacter, one that is perhaps unique in cinema history.\n"},
{"review": "\nCaptain Jack Sparrow (Johnny Depp) is not y/our typical Errol Flynn\ntype of machismo, swashbuckling pirate; nor does he play another Disney\nCaptain Hook. He's more like Fagan in \"Oliver.\" Capt. Sparrow's ever so\nfey. That's his charm.<br><br>Though the pirates on the \"Black Pearl\" ship are dead &amp; sometimes in\ntheir skeleton form they aren't scary enough for kids since this is a\ncomedy.<br><br>The story line goes as follows: A governor's daughter is in charge of a\nyoung boy her own age who has been pulled out of the sea by her\nfather's bourgeoisie crew. She notices his necklace is a pirate's &amp;\ntakes it from him to protect him from being hung to death.<br><br>But, the golden medallion is the last 1 of a pirate's treasure that has\ncursed the \"Black Pearl\" ship's crew. Without its return, with the\nblood of the boy on it, the skeletal crew remains dead, unable to feel\nany life in themselves; they are also not killable since they are\nalready dead.<br><br>Capt. Sparrow (Depp), though a bumbling comical pirate who's bent upon\nowning the \"Black Pearl,\" the ship the cursed crew stole from him,\nplays a marvelously lovable &amp; lucky pirate who is the super glue that\nholds together the loose ends of the movie. Depp gives his cutest\nperformance I've seen; he's now my favorite pirate! The script is\nclever; cinematography is fine; special effects are spot-on.\n"},
{"review": "\nIn 2011, i tried opus 4 with Penelope and it was so slow, so dark that\nI felt asleep in my seat ! Now it's the second (!) time i try to watch\nthis DVD because of Keira and it happens again ! even if the production\nis baroque and visually stunning, the pace of the movie is terribly\ndull and its attraction wagon moves faster and is more exciting ! Sure\nthere is efforts to have a dense story and there are strong characters\nand funny back roles as well, but the way it's told and filmed isn't\ndynamic : so it's a pure Disney movie as every age can follow what\nhappens on screen, old or young ! The action sequences are quite boring\nand repetitive, Deep gets irritating with his pantomimes, Pryce with\nhis usual dandy manner (he is not John Cleese !) and getting aboard and\nout of ships isn't really exciting at the end ! With this dragging\nambiance, i felt again asleep when Keira was abducted ! At least she\nwas here because she is really the revelation of this movie as well as\nthe fighting skeletons by moonlight ! Withtout them, i couldn't have\nsustain such a long movie for which i have the big feeling to have seen\nit already before !\n"},
{"review": "\nWhen I first saw the film, I thought it was awesome- the graphics were\ngreat and no doubt, Jack Sparrow (Depp) and Will Turner (Bloom) were\nhot in their own ways. I was surprised that Disney would have scary\nskeletons in a movie, but it was a very good film indeed.<br><br>This movie starts off with a song about pirates, which, I think, is\ngenius. Not subtle, not direct, just genius. The whole plot revolves\naround rescuing... and rescuing... and rescuing, again.<br><br>The second time I saw this film, I thought it was disgusting. What the\nheck, I thought to myself. It's so... so... unrealistic (which is\nreally unlike me, because I adore fantasy- just not too far-fetched in\nthe fantasy world, like Mary-sue or people popping out of no where to\nhelp others). Until I saw it for the third time. I loved it then. (And\nyes, to watch a film for 3 times and have 3 different opinions each\ntime makes the following statement true- 'there is obviously something\nwrong with me.') The thing that made me love this movie SOOOO very much\nwas- 'Freedom'. As Sparrow had said, being a pirate is like having\nfreedom. I had a knot in my stomach when I heard this- I mean, oh my\ngod, I hated being trapped in a boring routine everyday. Being a pirate\nmeant adventures, risks, excitement. And that really attached me to the\nmovie. Whenever I read books or watch TV shows or movies about high\nadventures or fantasy, I almost cry because I'm not the main character-\nit's not me who's having all the fun, and reading these books or shows\nor movies might be the closest thing I will ever be to having the\nadventure of a lifetime.<br><br>Watch this movie. It will give you a knot in the stomach if you will\njust pay close attention and hope to feel like you are one in it.\n"},
{"review": "\nThis movie is a must fo anyone's collection. It's clean, exciting and\nfun to watch. It gave me a whole new view on piracy. I mean every\npirate in movies and plays before this either had a parrot, a peg-leg\nor an eye-patch. Pirates of the Caribbean doesn't have any of those\nstereotypes. Depp plays his role brilliantly, there is not a dull\nmoment when he's on screen and Bloom portrayed the love-sick blacksmith\nperfectly as well. Knightley's role was a bit modern(strong,\ntake-charge feminist), but that also added to the movie, she was great.\nI could go on about the actors, but there wouldn't be any more room,\nthey were marvelous! This movie is mysterious, every single time I\nwatch it, I can barely pull myself away from the screen! THis is\nwithout a doubt, the best movie I've seen yet.(A)\n"},
{"review": "\n\nHaving always been interested in pirates, curses, and adventures (when\nit comes to movie entertainment) this movie appealed to me the first\ntime I saw a preview for it. I've watched this movie at least a dozen\ntimes and I still can't get over how amazingly well Johnny Depp fits\nthe part of Captain Sparrow. His gestures, facial expressions, and his\nscript make this movie not far from a masterpiece. Honestly it took me\n2 or 3 times to completely understand the plot and all the dimensions\nof the curse. However, watching all the extra scenes and info on the\nDVD made me realize how much fun the director had making the movie\n(when was the last time you saw a pirate movie that cool??) Again, I\ngreatly applaud Johnny Depp's performance and I can't wait to see\nPirates of the Caribbean 2!\n\n"},
{"review": "\nOne of the drawbacks to seeing a big movie, an immensely popular film\nfrom a few years back is that you enter into it with such preconceived\nnotions that the flick will be . . . good? I saw Pirates of the\nCaribbean over the weekend and it was just so much fuss and feathers, a\ngory, tedious mess. Since you already know the story, I'll tell you why\nPOTC stunk (stank? stinked?). I don't think this movie knew exactly\nwhat it wanted to be. It could have been a jolly, smartassed romp or an\nexciting and suspenseful thriller or a story of love and devotion.\nSince it tried for all three, it missed.<br><br>The female lead (something Knightley?) was bland, the Orlando Bloom\ncharacter was also a nothing, the baddies weren't even there unless the\nmoon was out, and Johnny Depp left me totally confused. His simpering,\neffeminate Jack Sparrow spent the movie lurching and reeling as if Depp\nwanted to impress you with his Foster Brook's impression.<br><br>I wasn't.<br><br>Needless to say, if anyone reads this review, I'll be earning my one\nzillionth \"unhelpful\" vote on IMDb. I don't write that I don't like\nmovies to get people to react negatively but to get them to ponder\nwhether or not what they liked was actually good or just popular.<br><br>Pirates was staggeringly popular . . .<br><br>and awful!\n"},
{"review": "\n\nI did not originally see the movie in the theater but rented it when it\ncame out on video and loved it. I have eventually bought it and have\nwatched it so many times I have lost count. I thought Johnny Depp's\nperformance was really good and you couldn't help but love him. I also\nliked that the movie didn't have a lot of gore and sex in it but still\nkept the viewer captivated. As for T. Robertson's comment on Captain\nSparrow having been under the curse too the whole time-he was not. Jack\nonly came under the curse after having slipped a coin out of the chest\nafter Will had been captured (You have to watch closely). That in\nitself was rather clever on Sparrow's part since you can't do battle\nwith an immortal pirate and win if you are mortal. :-)This one\ndefinitely ranks in my top ten favorite movies. I hope they make\nanother one.\n\n"},
{"review": "\n\nPirates of the caribbean is not only an action, but funny and a bit of\nhorror too, EVERYONE who i have asked if they like it have said yes,\nits a film that almost everybody likes, no matter what age or genre\nthey like.<br><br>It stars Johnny Depp is the fearless pirate Jack Sparrow, Orlando Bloom\nis the young Blacksmith and Keria Knightly is the governors daughter.\nThis is one of Johnny Depps best films, and he really makes the film\nwhat it is!!<br><br>The graphics were above average and the story line is not boring what\nso ever, everyone is entertained.<br><br>I have to say i cant wait for the next one to come out.\n\n"},
{"review": "\n\nIt really does steal the screen!<br><br>This is, without doubt, my favourite movie of all time. It was brilliantly\nwritten, performed, filmed, and put together. I cannot work out the\nmystery\nof why critics gave it such bad reviews. The special effects were\nexcellent,\nas well.<br><br>I was very choked that it did not get a single Oscar award. I especially\ncouldn't believe that Return of the King got best Makeup over it. I saw NO\nmakeup in that (the Orcs were people wearing masks), and then in Pirates,\nin\ncome Jack Sparrow (Johnny Depp) and Barbossa (Geoffrey Rush) in\nspectacular\nmakeup. I certainly think that Johnny should have gotten \"Best Actor\" for\nJack Sparrow rather than Sean Penn.<br><br>A great movie for all pirate lovers out there, and well - any movie lover\nout there.\n"},
{"review": "\n\nOK, so everything that I could say has all been said in the other reviews\nalready, but I can't stress just how enjoyable this film is. It's a wild\nride that keeps you laughing and thrilled from beginning to end. Johnny\nDepp\nis incredibly funny and incredibly sexy, and since potc I have become a JD\naddict, which is costing me a fortune on Ebay. The special effects are\nperfect - the pirates are very funny and not overdone at all. It is fun\nfor\nall the family, and I can't think of anybody who isn't a complete kill\njoy,\nwho wouldn't enjoy this film. It's always worth a watch when you need\ncheering up. I have seen it around 9 or 10 times and there will be more.\nCan't wait for the sequel, and praying that they can secure Johnny for\npart\n3 too. \n"},
{"review": "\n\nPirates of the Caribbean is a well-written, well-made, and well-acted film. \nDo not expect a simple action film; it is humourous and creepy, fascinating\nand thrilling.  Like most films, there are a couple of holes here and there\nin the fabric of the story; but this film wasn't made for the Oscars, it's\nmeant to entertain and it succeeds in full at that.  It's a jolly good time\nwith some good actors (and great Academy Award Winner Geoffrey Rush) and\nhigh adventure on the high seas.  Not to be missed!\n"},
{"review": "\nThis movie tops them all with AMAZING direction, AMAZING moods, AMAZING\nmusic and mostly AMAZING OF ALL AMAZINGS... acting! I have the biggest\npassion for Johnny Depp and thought this was the most hilarious role to\nhave him play. He did it flawlessly! and he's so hot! Just an added\nbonus. Orlando Bloom was probably at his best in this movie as well,\nand because i don't really like him at all, that is definitely a huge\ncompliment to say the least. And if all i told you about this movie is\nthat it was produced by Jerry Bruckhiemer, then you would automatically\nknow it is something worth watching. From The Amazing Race, to CSI,\nJerry Bruckhiemer produces everything worth watching. And don't get me\nstarted on the flawlessly beautifully talented Keira Knightly. She is\nbeautiful, has the cutest accent and is extremely talented! Honestly,\nif you didn't like this movie you have got to have something seriously\nwrong with you - it's a classic to be remembered for the rest of time!\n"},
{"review": "\nThis film is absolutely mind-blowing!I watched it the first time and\nwas very impressed with Johnny Depps performance as Captain Jack\nSparrow.He really put his effort into this film and suited the part\nvery well.I was also impressed with Keira Knightleys performance as\nElizebeth Swann she too suited the part very well.I am very glad that\nPirates of the Caribbean 2 is coming out next year!!!!I think that the\nbeginning was fantastic and introduced the characters well.The\nstoryline as a whole was very impressive.This film is fun of\nlaughter,romance,action and a lot of drama!This is a film you have got\nto watch!!!\n"},
{"review": "\nThis movie works so well on a variety of levels. Despite being so\noutlandish, Depp's pirate is clever, creative and believable ... except\nthat he doesn't seem like he'd ever be able to back down a crew of\npirates; to wit, his crew abandoned him on a desert island. That he\ncould come back over and and over would create respect in many and,\nsometimes, those who seem craziest are most feared, so perhaps he could\ndo it.<br><br>Verbinski knows what he's doing but I wish so much of the movie hadn't\nrested on Depp's shoulders. That being said, it still works beautifully\nand Depp's acting is spot on. I guess it comes down to this: When\nyou're watching the movie it can be totally absorbing and any\ncriticisms spring to mind only when the lights are up and I've moved on\nto other things. I've seen the movie several times and get sucked in\nevery time. If I were to judge a movie only by my thoughts after it's\nover, that wouldn't be fair. I believe you have to judge a movie mostly\nby what's on your mind during it and give much less criticism after\nwards. The movie IS the moment, not the trip home.\n"},
{"review": "\nI thought that this movie was the best!!! I thought it was the best\nmovie because it has Johnny Depp in it!!! :p Boy is he\nhot!!:D:D:D:P:P:P I think that anyone who sees this movie has got to\nagree that it is one of the best movies ever!! I hope they make another\nmove!!! I wonder if there will be as much suspense in the next two\nmovies as in the first movie?? I hope to watch this movie again and\nagain because it is the best movie in the world!! I just have to watch\nany movie with Johnny Depp in it cause he's the best actor in the\nworld!! Why don't you go out and get it and see for yourself that is is\nan awesome movie!!\n"},
{"review": "\nI think that this is one of the best movies that i have ever seen. I\nown it on DVD and watch it every time that i get the chance. I can not\nwait for the next one. Hopefully it is as good as the first, but i have\nno doubts. Johnny Depp is a great actor and he plays the part of Jack\nSparrow well. Orlando Bloom is great too. I think that all the actors\nplayed a big part in making the movie and they put it all together and\nmade it come to life. Thanks to everyone involved!! The next one sounds\nreally good and as soon as it comes out i am going to gather up all of\nmy friends and we are going to go see it in theater. It is going to be\nreally fun and i hope that it comes out soon because i can't wait.\n"},
{"review": "\nI'm not a fan of reality TV. When I watch TV, read a book, or go to a\nmovie, I want to escape from the real world for a while. POTC is just\nsuch a movie. I was never a Johnny Depp fan, but seeing him in this\nshow made me one. He is the coolest pirate ever. He was funny, cool,\narrogant, daring, dashing, brave, cunning, and many other things\nthroughout. There was plenty of action - never a dull moment. I liked\nit so much that I have the DVD and have watched it many, many times and\ndon't get bored with it. Now I am trying to see anything I can with\nJohnny Depp in it. The other actors all did a great job, from Captain\nBarbarosa to Elizabeth and William to all the other pirates. I loved\nthis movie!! I just have one question - \"But why is the rum gone?\"!!!\n"},
{"review": "\n\nMagnificent! I will start off with the one problem so that I can end by\nthrashing it with compliments: Too long. If they had just cut out all\nthe crap in the scenes which made this movie so long it would've gotten\na perfect 10 from me (I gave it a 9). But anyway, no movie is perfect.\nTo the compliments, Jack Sparrows (Johnny Depp) was out of this world.\nHis performance was just outstanding. No one in my opinion could have\ndone the role better and I could probably find a better person for the\nrole of just about every main role in a movie except this one. The way\nhe says things are the kind of jokes that make you laugh in your head\nand think about what and outstanding movie it is without laughing out\nloud. It's like when you go a movie with someone and you don't hear\nthem laugh once but when they come out they say it was the funniest\nmovie they've ever seen it's because the jokes are the kind that if you\nlaugh out loud you're going to sound crazy. That's what all comedies\nlook for and this one got it right with Johnny Depp.\n\n"},
{"review": "\n\nWhen the \"Pirates of the Caribbean\" was released, I was really looking\nforward to watching this movie. However, I finally managed to watch it\nmany months later and I LOVED it!<br><br>It's a breath-taking movie, with an interesting plot and great\nperformances from the actors. Although the movie is a little bit long,\nnobody can get bored while watching it. What I liked most -and I think\nmost people liked- is Johnny Depp's performance. He was GREAT, he\nperfectly played the role of Jack Sparrow and whenever he appeared, he\nwas \"breaking\" the \"gravity\" that prevailed in the movie and turned\neverything more pleasant and funny, by reminding us that he's a really\ngreat actor, something he has already proved many times so far.<br><br>Orlando Bloom and Keira Knightley were also very good and proved that\nthey are two talented actors. However, they are still quite young and I\npersonally think that their performances seemed rather indifferent,\ncomparing to Geoffrey Rush's and Johnny Depp's.<br><br>To sum up: I found this a great movie and anyone who hasn't watched it\nyet, he should definitely buy the DVD!<br><br>Finally: Many people say it's a good movie, while others disagree.\nHowever, there is one point that nobody can doubt: Even if you are not\na fan of such movies, it's worth watching just for Johnny Depp!\n\n"},
{"review": "\n\nA movie that was suppose to have Orlando as lead, is taken by my\nbeloved Johnny Depp. I have been a fan of his since I can't even\nremember how far back. I not only drool over him, his talent is true\nand original. How many sexy males do you know that would or could pull\noff a very believable rendition of a punk-rock pirate named Jack\nSparrow. The plot is almost perfectly mending to all genre's and pulls\nanyone in by its diverse levels of movie goers. If you like action,\ncomedy, and anything with Johnny Depp, this is the one to see. I\nrecommend other Johnny Depp movies, and that you keep watch on Keira\nKnightly, and Orlando Bloom for other upcoming movies to see that they\nare savvy actors and actresses.\n\n"},
{"review": "\n\nWow. Originally I thought this movie wouldn't be so great, but after I\nsaw it, I realized how stupid I had been. This movie is fantastic. It's\nRomantic, funny, a little scary, historical, and, of course, action\npacked. Is there any genre this movie ISN'T? The plot and characters\nare well-developed, and It's the kind of movie that you just want to\nsee over and over again. And, it seems to get better every time I see\nit (approximately 10 times)! The only flaw is the fact that if\nbootstrap bill had in fact taken a piece of gold (which we know he did;\nhe sent it to Will) then he would have been affected by the curse.\nAnd..If he was affected by the curse, he would be immortal. So...How\ndid launching him off a cannon into the ocean kill him? I guess that's\nwhy there's a \"Pirates of the Caribbean 2\"... I can't wait. As Captain\nJack Sparrow might say, \"Go see this movie. Savvy?\"\n\n"},
{"review": "\n\nWhat can i say?, its a brilliant movie. Casting is just right,\nespecially with the fantastic Mr.Depp, he outshone everyone, and also\ngave the movie its humour, The story line was very original, and an\nended most people wouldn't of expected. The special effects were very\nwell done, especially the pirates turning into Skeletons, and looked\nvery scary at parts.<br><br>Jeffery Rush, also acted brilliantly with his part as the evil captain\nBarbossa, and orlando bloom as the young man, falling n love and what\nhe would do for love. All i can say is i cant wait for the next movie\nand i bet it will be even better then the first.\n\n"},
{"review": "\n\nI have probably seen this movie 15 times. I love movies and I am\nterribly critical of them. When I read the goofs page on this movie, I\nwas shocked to see how many there were. IT is not good that the editors\nlet so many slide. But, as a whole, this is a great mindless movie. I\nread a review by another user that said a good movie is one that raises\nimportant issues and questions; I agree. But, there can be other kinds\nof good movies. This is one! Watch it with an empty mind needing\nentertainment and the willingness to pass off goofs by saying \"it is a\nmovie\" and you will find great satisfaction in Pirates. All in all, I\nwould call this a new classic because it appeals to the masses who\ngenerally care nothing for \"great art films\".\n\n"},
{"review": "\n\nJohnny Depp, in my humble opinion, has been ignored far too long by\nTinseltown. His acting in this film was truly gifted and inspired. If you\nhave not seen this movie, please do so.\nMr. Depp is able to completely submerge in whatever character he plays and\nhe does so amazingly in his portrayal of Captain Jack Sparrow. A pirate with\na heart of gold!\nOh, the movie is great, too! Orlando Bloom is fantastic and the special\neffects are quite phenomenal.\nI cannot believe that the Disney Studies actually produces this film so\nperhaps there is still hope for them after Eisner.\n\n"},
{"review": "\n\nMovie was awesome!!Johnny Depp can play any character he's a well\nrounded actor, one of the best in the business (I feel). He's not to\nbad on the eyes either:). I'm so excited he's going to be in the 2nd\nmovie, I feel that if they had chosen some one else to play Cpt. Jack\nSparrow, Will Turner or Elizabeth Swan, it really would have not made\nsense. I saw the movie 6 times mainly for the actors and the plot it\nwas very interesting and well thought out. Many people said it was too\nlong, I believe it was perfect it kept getting interesting just as you\nthought Jack was going to be hung Will's to the rescue and then you\nthink Jack and Will are caught and will go to jail Elizabeth is there.\nBest movie Gore is going to have trouble making the second look good as\nthe first, hopefully it will come close. Music for the movie was great\ntoo.\n\n"},
{"review": "\n\nWell, to sum it all up this is my FAVORITE movie of all time.<br><br>It appeals to a wide range of people from kids to adults it has\nsomething for everyone. It never speaks down to its audience and the\nscript is pure genius. The characters are so well developed that you\nfeel that you have known them all your life.<br><br>Johnny Depp however, is the pride of this film. He shines through as\nthe mischievous, and mysterious, Captain Jack Sparrow. His acting\nskills are amazing as he creates a character that is surely the most\nmemorable pirate to ever sail the Spanish Main.<br><br>It is BRILLIANT, the movie never slows, never bores its audience. I am\nsure you can now see why this is my favorite movie.\n\n"},
{"review": "\n\nThis is a definite Two Thumbs Up! for Disney! A great movie filled with\nswashbuckling adventure, beautiful scenery, and the best of the best --\nJohnny Depp and Orlando Bloom! The chemistry between the two of them\nwas a beautiful thing to see! I bought it on DVD and have almost worn\nthe disc out, enjoying every second over and over again. I am\ndefinitely looking forward to their second one and hope it will be out\nsoon! Even the female, Kiera, was good, though we all could have done\nwithout the Will/Elizabeth romance at the end! About the only bad\nthings in the story were the bad pirates and the lack of Will sailing\naway into the sunset with Sparrow on their ship! These two fine actors\ndeserve a pat on the back and more like about a thousand stars for\nmaking their characters likable, enduring, and leaving a taste on your\ntongue for wanting more! I highly recommend it for all family members!\nOnce seen, this movie will stay with a fond place in your heart\nforever!\n\n"},
{"review": "\n\nI saw this movie and I thought it was excellent. Admittedly, I\noriginally was only going to see it for Orlando Bloom, but I ended up\nloving the film as a whole. The actors are excellent in their\nindividual roles and all worked very well together. Johnny Depp was\nhilarious and portrayed a unique and lovable pirate. Geoffrey Rush\nplayed an excellent adversary who was both sinister and entertaining.\nOrlando Bloom played his part of a devoted lover wonderfully despite\nmany people's opinions that he was weak and too lovey-dovey. The plot\nwas interesting and captivating, and although I found a loophole, I\nthink it was purposeful as they are making a sequel. Wonderful special\neffects and sets helped to make this movie excellent. Wonderful\ndirection from Gore Verbinski held this movie together and an awesome\nscore by Klaus Badelt accompanied the entire movie very well. Overall,\nI thought it was an excellently made movie that was fun for all ages.\n\n"},
{"review": "\n\nThis is one of the best pirate movies you will see in a long while.\nThat is until they make the sequel. Pirates of the Caribbean, is an\naction adventure film with a great cast and a wonderful story line. It\nstarts in Port Royal, Jamaica. Where Elizabeth Swann, the governor's\ndaughter gets kidnapped by a crew of cursed pirates. Right before the\nkidnapping a pirate by the name of Jack Sparrow comes into town looking\nto commandeer a ship. Sparrow agrees to team up with Elizabeth's\nchildhood friend Will Turner in search of Elizabeth. But what Will does\nnot know is that Jack is linked to the kidnapping and the cursed\npirates in more ways than one. To find out the rest, see the movie! A\nmust see for all adventure lovers and Johnny Depp fans of course! Take\nmy word, a great movie. My rating is an A!.\n\n"},
{"review": "\n\nThe film was filled with extreme comedy and great action scenes.  Much of\nDepp's acting was reminiscent of his work in Fear and Loathing, but it was\nhillarious and well worth the nine dollars.  The action scenes were packed\nwith entertainment, and were very frequent.  \nAll ages can enjoy this movie, and most likely will.  If you have the\nability to get to a theatre, go to one, and see this movie.\n"},
{"review": "\n\nThis was the best movie of the summer!!!!  It had me laughing a lot and\nOrlando Bloom looks really good!!!  Johnny Depp uniquely portrays Captain\nJack Sparrow and it's so much fun for everyone!!! Don't wait another\nsecond\ngo and see it right now!!!!!!!!!!!!!!!!!!\n"},
{"review": "\nGore Verbinski follows up The Ring with this incredible family film.\nJohnny Depp turns in another incredible performance that should get a\nlaugh out of everyone. This is the type of incredible family\nadventure/comedy that should be a favorite of the youth in this\ngeneration as The Princess Bride was for those before it. Both movies\ngive you that good feeling and have that quality where you never get\nsick of watching it and hearing the lines over and over. This is a film\nthat everyone should see a couple of times, just to enjoy the pure fun\nit has to offer. The great film was a surprise to me, since I knew it\nwas based off of a Disney ride and I thought it was going to be a film\nfor kids, but it is definitely something that can be enjoyed by people\nof all ages. Captain Jack Sparrow is the pathetic yet savvy and smooth\npirate that you can't help rooting for. Orlando Bloom is the one actor\nI don't particularly care for in any movie, but he doesn't bother me in\nthis one. Geoffry Rush is cast perfectly and the special effects are\nnice. If you haven't seen this great film yet, go out and rent it or\nbuy the DVD which is loaded with extras that will keep you happy.\n"},
{"review": "\nBefore this film i had never heard of Johnny Depp, Keira Knightly or\nGeoffery Rush but i had heard of Orlando Bloom. I had never even seen\nthe trailer to 'Pirates of the Caribbean'! My sister first saw the film\nand told me so much about it and told me that I really should go and\nsee it with her... I kept on saying no because it just didn't appeal to\nme. I then spoke to other people about it who said it was great so i\nfinally decided to go and see it. From start to finish i was taken on a\nswashbuckling adventure! It had everything that a movie should have...\nlove, comedy, adventure, a kidnapping and cursed pirates after\ntreasure. The film was mainly carried by the fantastic Johnny Depp...\nplaying the slightly drunk Captain Jack Sparrow who's main mission in\nthe film is to get back his ship 'the Black Pearl'. However, he ends up\ntaking on board Will Turner (Orlando Bloom) a blacksmith who is in love\nwith the Governers daughter Elizabeth Swann (Keira Knightly). Elizabeth\nis kidnapped by Pirates and it is up to Jack and Will to save her.\nHowever the Pirates are cursed and are neither living nor dead...they\nmust repay their blood otherwise they will be cursed forever. So as you\ncan see there is a lot to go by on the film. Can Jack Sparrow be\ntrusted? Will they reach Elizabeth before it is too late? Will the\npirates ever be rid of the dreaded curse? Watch this film as it is\nperfect for anyone! This film is one of the best epics every made!\nWatch it...you will not be disappointed!\n"},
{"review": "\nI was a huge fan of The Pirates of the Caribbean long before the movie,\nso I was very nervous--would the movie do justice to the attraction? Or\nwould it be another stinky pirate movie? The first time I saw it,\nthough, I knew it would be a hit. The casting was perfect, the music\nspectacular, the special effects astounding, the story intriguing--this\nwas as close to a perfect movie as I have seen in a long time. It's\ngreat fun, making you laugh, gasp, hold your breath, cheer, and sigh,\nand it appeals to all ages--I even heard grandmothers commenting on how\nadorable Johnny Depp was! It's not surprising that we've seen more of\nKeira Knightly, who gave quite a twist to the \"damsel in distress\"\nrole. Orlando Bloom was a pleasure to look at, but his character was\nthe only \"cardboard\" one of the lot. He did OK, and at times was great,\nbut overall he was just overshadowed by Captain Jack, whereas the other\ncharacters seemed to hold their own. Maybe he was tired from fighting\ntrolls (Lord of the Rings)? I've seen the movie a good two dozen times\nnow, and it just never gets old, mostly thanks to Depp, who so deserved\nthe Oscar for his performance. Maybe he'll manage it with one of the\ntwo sequels. Even if he doesn't, though, this will be one of his best\nroles ever, and it's truly a movie that everyone involved can be proud\nof.\n"},
{"review": "\nPirates of the Caribbean are without a doubt one of the best movie\nseries of all time, but as it happens, The Curse of the Black Pearl is\nthe worst one of these movie series.<br><br>The jokes are lame, Jack's mimicry not even funny. Elizabeth and Will\nmake a boring couple and there is no chemistry between Keira and\nOrlando.<br><br>The story is boring, confusing, twisting into such incomprehensible\nstoryline and dumb scenes, that if you won't sleep yourself to death,\nthen thumb up.<br><br>But why did I bother to watch the sequels, when this one I didn't like?\nBecause I happened to watch the sequels first and loved the story of\nThe Dead Man's Chest and the sequel of its storyline in the third movie\nAt World'd End. I completely got into the story without even watching\nthe first one, so it seems.<br><br>Meant as introduction this Curse of the Black Pearl is, but there is no\nintroduction at all. You can well meet the characters in the sequels\nand don't need to be sorry for skipping this one.<br><br>Barbossa as the main villain is lame, old, boring and inexpressive,\nnothing compared what is to come next. He doesn't even have his own\nsoundtrack song, and well, speaking of the OST, there isn't much to say\neither. <br><br>I promise, watching the sequels will make you laugh at sophisticated\njokes and hold your breath when the REAL enemy comes.<br><br>This Curse of the Black Pearl is nothing more than a fairytale for\n10-year-old boys. <br><br>The only reason why I've given it 5 stars are for the respect I keep\nfor its two younger brothers.\n"},
{"review": "\nI am a HUGE fan of both Depp and the original Pirates. Naturally I went\ninto this movie with a bit of skepticism as I do with ANY sequel. My\ndaughter (15) had seen it twice and raved about it. So my 13 year old\nson and I went today. As we walked out, he said EXACTLY what was going\nthru my head: \"I was kind of bored\". Me, too.<br><br>Special effects do not a movie make any more. We've come to expect\nthat. Something that NEVER changes, though, is the critical element of\na strong plot, something that \"Dead Man's Chest\" lacks. As near as my\nson and I could figure, the whole plot line was that everyone wanted\nDavy Jones' heart to control the seas. Yawn. The rest was a showcase\nfor some admittedly fantastic special effects.<br><br>Another gripe I had with this movie, as I do with many nowdays, is that\nthe trend towards such utterly authentic dialogue almost makes much of\nthe dialogue incomprehensible. Okay, maybe it's because I'm \"old\" (51)\nand my hearing sucks. But the dialects used by Naomi Harris (Tia Dalma)\nas well as the usual cast of ragamuffin sailors, was often impossible\nto understand. I love the realism; I hate the fact that I missed so\nmuch of the dialogue.<br><br>It's hard - almost impossible - for a sequel to live up to the\nexpectations of an original. Only a very few (\"Aliens\" for example) can\ncome close or achieve it. In my opinion, and my son's, \"Dead Man's\nChest\" fell a bit short. Am I glad I saw it? Absolutely. I was\nmoderately entertained. Would I see it again or buy it on DVD?\nAbsolutely not.\n"},
{"review": "\nBasically this film has completely copied the famous 1990 computer game\nmonkey island. In which the governors daughter is kidnapped by an\nundead pirate ghost and you have to rescue her. It even copies ideas\nlike being stranded on an island and going crazy (like how herman\ntoothrot was stranded on monkey island for so long and went mad). The\nidea of finding a ship and a crew. And it copies other things like not\nonly it being set in the caribbean and having a voodoo lady, but the\nactual set and having to row through a swamp to get to the voodoo\nlady's shack, pirate towns made of broken ships and so many things just\ncompletely lifted from the game and lazily put into the film. The main\nvillain of Pirates of the Caribbean also looks identical to the villain\nin Monkey Island. If you search for this on google, youtube, or\nanything, you can see how pirates of the caribbean just completely\nripped off this game and is a really uninspired unoriginal film. The\nthing I did like about the film is probably Johnny Depp who seemed to\nplay an alright quirky, silly pirate.\n"},
{"review": "\nI enjoyed the first \"Pirates of the Caribbean\" movie. I consider it to\nbe a very well done pop-corn flick which was very well directed,\nmanaged to combine in a clever way the comedy, the adventure, the\naction and the fantasy (And this even adds some little hints of horror)\nwithout insulting the intelligence of the viewers.<br><br>It is something that whole family could enjoy, and it certainly has\nmany virtues that deserve appreciation: The production values are\nwonderful, the soundtrack composed by Hans Zimmer is excellent, and the\nperformances of the entire cast were more than appropriate. Even when\nthe story of the movie isn't very deep or complex, the result is pretty\nsatisfying.<br><br>What I don't understand is the absurd comparisons between this movie\nand superior films such as \"The Lord of the Rings\" from Peter Jackson\nor the original Indiana Jones trilogy. Those movies are in a completely\ndifferent league, and (for me, at least) were life-changing\nexperiences, with many memorable scenes, while this didn't have\nanything remotely comparable to that. <br><br>\"Pirates of the Caribbean\" it's a decent adventure flick, but it's way\ntoo overrated. Well, at least this movie was worth-watching and\nentertaining, unlike the sequels.\n"},
{"review": "\nI was watching Gladiator the other day and I noticed that in the first\nbattle in the colliseum the music playing sounded really familiar. And\nthen I realized that is in Pirates just changed slightly. It pisses me\noff that you have to go and steal music from another movie especially\nsince its one of the best movies ever made. Gladiator = KICK ASS\nPirates = Music Stealer/not as good as Gladiator So if you think\nPirates is good well watch Gladiator instead cause it kicks Pirates ass\nany day of the week!!!! I mean Johnny Depp was good and all but people\nmake him out to be God in this movie. I'm sick of all the hype and\npeople having orgasisms over these movies. I mean OK they are good we\nget it already!! Now if you want to see some good acting watch\nGLADIATOR!!!\n"},
{"review": "\nA bunch of pirates have been cursed and need the blood of a certain\nindividual to break the curse. They end up chasing two englishpersons,\nElizabeth played by Keira Knightley, and Will played by Orland Bloom.\nHelping them out is the good guy pirate Captain Jack Sparrow played by\nDepp.<br><br>Depp gives an energetic performance to be sure but this movie goes way\nover the top with outrageous scenes and dialogue that would never\nhappen in real life. I love action-adventure movies and I wish the\nproducers had taken this show seriously and left out all the slapstick.\nThere's even a running gag about a pirate with a glass eye.\n"},
{"review": "\nYes, Johnny Depp is one of today's greatest actors and it's amazing\nthat he'd dedicate so much time and effort to a character in a\nflavour-of-the-month fad movie like this one. But really, that's all\nthere is to this film. If another actor entirely had played Jack\nSparrow, this movie would get a 5 from me, tops. It is simply an\nextremely forgettable film. In 20 years, who will even remember who\nplayed Will Turner or Elizabeth Swann? Knightly and Bloom are good to\nlook at, but they'll soon be past their expiration date and, let's face\nit, no one watches their movies for their acting.<br><br>The entire movie consists mainly of CGI skeletons, CGI ships and tired\nchildren's' humour derived from would-be funny characters (the\ntransvestite ghosts, whatever their names were, are the most\nforgettable sidekicks this side of Tantor). The plot is as\nuninteresting as they come. The only reason to see this film is Depp,\nand although his performance is positively amazing, it's not enough to\nboost this flick to \"great movie\" status. His great job and the\ngorgeous Caribbean scenery is enough to make this movie an above\naverage kids' flick, but no more, no less.<br><br>There's not much else to say on the subject, so I'll leave you eunuchs\nto re-watch the film and consider that maybe everything about \"Pirates\"\nreally isn't as amazing as you first thought it was. (r#44)\n"},
{"review": "\nLame joke, but I can't think of a good summary. Pirates of the\nCaribbean is a pretty decent summer blockbuster that received much\nacclaim thanks to massive marketing. It's not terribly original, it's\nnot terribly funny(lots of the lines meant to be funny really doesn't\nwork very well) and in the end, it's not terribly satisfying either.<br><br>As movies come, it's solid and well-made and there's nothing to\ncomplain about in directing or the score, which both are good. The\nacting is one of the disappointments. Orlando Bloom is totally wooden\nas usual, Kiera Knightley doesn't exactly leave an impression, and\nJohnny Depp, although he is a god of acting, doesn't take his cool role\nnearly as far as he could have(with a script like PoTC's, there's no\nroom for anything outside the frames of well-tried movie/money-making\nguides).<br><br>The plot is the standard damsel-in-distress scenario and some Incan\ncurse thrown in for good measure. Add a bit of Dawn of the Dead or the\nwork of Ray Harrihausen in \"Jason and the Argonauts\" and you have the\nstoryline.<br><br>I've watched PoTC two times and it has failed to impress me both times.\nIt's a bit too violent to be appropriate to the audience I think would\nhave appreciated it best, and a bit to childish to appeal to the rest\nof the movie-goers. Not something you have to see.\n"},
{"review": "\nThis is one of the most overrated movies of the last decade, just\nunbelievable that it reached the top 250.. Johnny Depp is good to watch\n(as always) but the rest of acting was terrible, especially Orlando\nBloom. Many people talks about fun, but what is fun? In this movie I\nfound so much hackneyed entertainment just disguised in a new form:\ntake away the skeleton pirates, put in it criminals, terrorists, cops\nor whatever and you get the same result. With a less banal script and a\nbit of drama, ah and yes with a *bit* of characters development this\ncould have been better, but hey, it's Disney.... This is just the usual\n\"turn-off-brain\" movie, nothing less, nothing more.\n"},
{"review": "\nThank god there are other people in the world whom don't 'love' this\nfilm. Pirates of the Caribbean is so overrated, if it wasn't for johnny\ndepp, then it would be a washout completely, which says a great deal\nabout it. If I am honest I fell asleep about three quarters of the way\nthrough the film, out of sheer boredom, i think Knightley's famous line\n'try wearing a corset' set me down for the night. I saw this film last\nyear, and had expected a masterpiece since many people had such high\npraises for it. The storyline is mediocre, the acting of two of the key\nactors, Knightly and Bloom (sorry I don't know their characters names,\nthere is a simple reason for this!) is very average. I can remember\nvery little from the film, as it has mere substance. Unfortunately, I\nhave to now deal with people having panic attacks over the release of\nthe sequel..oh well.\n"},
{"review": "\ni loved this movie although i don't think it is the best out of all the\npirates of the Caribbean movies. it starts out with jack sparrow\n(johnny Depp) a notorious pirate who has just been over thrown by the\nruthless Barbossa (geoffrey rush) who now owns the black pearl (a\npirate ship). while he is on a British colonized Caribbean island he\nmeets the beautiful Elizabeth swan (keira Knightley). Elizabeth swan\nhas a connection with the black pearl that she does not know until\npirates from the black pearl attack the island that she is on and\nkidnaps her. when she gets on the ship they ask her what is her name\nshe Elizabeth turner, but little did she know turner was the name\nanother pirate that used to be part of the black pearls crew. jack\nsparrow knowing this while in prison. when a young blacksmith named\nwill turner (bloom) who secretly has a thing for Elizabeth turns to\njack to get her back.<br><br>so over all this was an excellent film no doubt\n"},
{"review": "\nI didn't see this movie till it came out on DVD back 2 years ago.<br><br>I regretted not seeing it in theaters, because I kept thinking it'll\nsuck, because it didn't look like it be anything similar to the ride at\nDisneyland.<br><br>But I was surprised to see that it's a very well done action movie. And\nsurprised that it's even done by Disney. Cause it's not the common\nFamily Friendly movie you'd find from Disney.<br><br>The movie of course takes place in the Caribbean and during the 16th or\n17th Century era. Which is when pirates ruled the 7 seas. A ship was\nsailing across the Atlantic which came across a wreckage of another\nship. With only one passenger who is a young boy named Will Turner. Who\nhad a gold medallion in his position. A girl named Elizabeth noticed\nthe medallion to be pirate related so she took it and hid it from the\nship's crew so that way they wouldn't think that Will is a pirate.<br><br>8 years later Elizabeth is more grown up and Will is a blacksmith who\nmakes and repairs swords for the army of the seaport town of Cape\nRoyal. Life was very calm and peaceful till Jack Sparrow came ashore of\nCape Royal. He is not your average pirate and he's very well known\nthroughout the Caribbean. And there's a lot more to his back story than\nthere seem to be.<br><br>The medallion that Elizabeth holds is the key to breaking the curse of\nthe pirates of the black pearl.<br><br>I gotta admit i did like it quite a bit. I just wish I knew it was\ngoing to be a must see movie. It had action, great special effects,\nplenty of humor in some parts, and great characters to know while\nwatching the movie.<br><br>It's also unlike the common pirate movies you'd see anywhere else.\nWhich is because it's a modern day made pirate movie. Those who are\nobsess with the ride might enjoy this movie a lot.\n"},
{"review": "\nPOTC: TCOTHBP was occasionally interesting. What can one expect, the\nmovie is based on a ride? Keira Knightley fills well the lovely young\nwoman role. Johnny Depp is occasionally hilarious and interesting.<br><br>What largely lacks for POTC is the story (hey, I understand, the ride\nwas supported by effects and posing too, but it is only a few minutes\nlong) and... well... the male second. While one can certainly\nunderstand Orlando Bloom's Will Turner's interest in Keira Knightley's\nElizabeth, one can't, however, understand the reciprocation. I\nunderstand actors' withering beside Johnny Depp's irresistible,\non-screen energy and force of personality, but poor Orlando Bloom\nnearly puddles beneath the glare. For LOTR all he had to do is stretch\nhis neck and furrow his brow and that, beneath his lovely, light locks\nis what we needed from him there. Unfortunately for us, it seems that\nproducers haven't yet realized that is all he can do.<br><br>Geoffrey Rush ranged from over-the-top (which worked) to occasional\nattempts at being a sympathetic character (which didn't).<br><br>There are some decent moments of entertainment including some\nlaugh-out-loud funny lines involving Captain Jack Black. But this is\nnot a keeper -- at most, a renter, preferably a borrower.\n"},
{"review": "\nAmong all of my friends who saw this movie, both pirate/Depp fanatics\nand neutral, told me that it was such an amazing movie, and that they\nare excited about the sequel that's coming soon, and how I HAVE to see\nthis movie. So, I did.<br><br>I got pretty much what I expected, except less. I found the jokes\nunamusing, action sequence unexciting, the music just droning\non-and-on-and-on... Really, I mean, what was so spectacular about this\nmovie? I'm surprised that I managed to stay wake for the ordeal.<br><br>The acting was good, I guess. I wasn't too impressed with any of the\ncharacters. Jack Sparrow was kind of amusing, but his antics got really\nold very fast. Orlando Bloom and Knightly's characters were plain\nboring. But the character I was most disappointed in was Captain\nBarbossa -- such an uninteresting villain, absolutely no noteworthy\ncharacter.<br><br>I'm giving this movie a 3 out of 10, and I feel like I'm being\ngenerous. I know I'm not going to spend my hard earned dollars on the\nsequel.\n"},
{"review": "\n'Pirates of the Caribbean' is an old-fashioned adventure pirate film,\ncombining new animation techniques with humor, romance, and pirate\nbattles. The film is not a great film by any means; it is simply fun.\nThe film moved a little slow in some places, and I was not impressed by\nJohnny Depp's performance at all. The film really had little to offer\nin terms of an original story, but if you are looking for a film that\nis fun and something to liven up a dull evening, this film is okay.\nChildren and adults can both enjoy this. It's not great, but it can\nprobably be enjoyed by a wide audience. I give this a 4/10 because I\ndid not think it was anything special.\n"},
{"review": "\nMy movie review for this particular film is only based on the first two\nhours of the movie. The reason being for this is that after I saw that\nit had been over two hours and the movie was still going on, I just got\nup and left.<br><br>I'm not sure whether or not you'll enjoy this movie. To be honest, I\ndidn't really like it much. However, every other person that I have\ntalked to who has seen this film has said that it was cool. I just\ndidn't feel that way personally.<br><br>I found it to be just another boring, typical pirate movie with\npredictable plot movements and unfunny comic relief. There was way too\nmuch dialogue and not enough action. And, well, I realized that I had\nbeen sitting in the theater for an hour, but I thought that I was only\njust FEELING like I was in there for so long just because it was so\ntedious and I was just waiting for it to end. However, it never ended.<br><br>Although I didn't like it personally, everybody else did. So, I don't\nknow what to say. I guess if you're into those kinds of movies about\npirates and such, then you may enjoy it. I just found it to be\npredictable and lame.\n"},
{"review": "\nI must say when I first watched this movie, I loved it, I loved the\nplot, music, characters, and the actors. The actors are so good in this\nmovie that I surprised that they were even acting, and pretending to be\nlike the people in the movie. Johnny Depp really did his best in this\none, and I was not even the smallest surprised that he did an amazing\njob in this movie. Seriously, if they picked anyone else for the role\nof Captain Jack Sparrow, then I would not like this movie, and no one\nelse would like it. Everyone I know believes so, and no one yet has\nstepped up and said something about changing the actor for Captain Jack\nSparrow.<br><br>The writers did an amazing job with the script, but obviously Johnny\nDepp did a little improv while acting this role. Very good improv at\nthat. All the other actors where good too, Orlando Bloom, Keira\nKnightly, and Geoffory Rush, which happened to also be one of my\nfavorite characters in the movie also. Oh yes, the role of Barbossa\nreally knocked me in the head. His acting was almost as good as Johnny\nDepp's. The way he looked and talked just freaked the hell out of me\nand I just wanted to scream my lungs out.<br><br>The special effects in this movie also got me too, the way the\nSkeletons look when the moon rises really got me. The special effects\npeople did an amazing job at that, as well as the Make-Up people.\nPutting Make-Up on Johnny must of been tiring for both him and the\npeople, as his role had a lot to do with that. I for one would not like\nit at all, I can't even handle 2 days of it.<br><br>10/10, most people would agree that this movie is very stunning, and\nwell done. The actors play their roles as if they themselves are that\nperson, and all the other people who made this film possible, I bow\ndown to your success pf getting into half of the worlds hearts.\n"},
{"review": "\nThis one of those movies which you want a GOOD second part of the\nhistory, buy you find that the money destroys the movie, this part of\nthe movie shows a great pirate Jak Sparrow, the way that Deep acts in\nthis movie is very natural and makes a great acting, everyone fits on\nits character and the plot of Barbosa seeking for that Cortez's gold is\nvery original.<br><br>I haven't seen the third part because ¡the second one was so awful!, in\nmy opinion the acting gets loosed (just look the difference between\nJack Sparrow on the 1st movie and the 2nd one) and its one of the most\nboring movies i've ever seen.<br><br>Remember, thats the second part, but i totally recommend this movie,\nits very fun and it got too much nominations, but finally it deserves\nthem\n"},
{"review": "\nwhat do you get when you have a movie that is over-hyped it can't live\nup to the expectation?you get pirates of the caribbean.my hopes were\nthrough the roof for this one based on all the ads and great\nreviews.man,what a letdown.this isn't necessarily a bad movie,but it is\nnowhere near as great as i was led to believe.the acting was okay,and\nthere was some humour,but i think it tried to be funnier than it\nactually was.there are many films made with very small\nbudgets,including marketing, and many turn out to be fine and sometimes\nsuccessful films.i guess hollyweird just doesn't get it.then again, i\nguess i don't get it either since i believed all the hype and went to\nsee this movie.i give it 5* out of 10 based mostly on the acting and\nsome humour\n"},
{"review": "\n\"Me? I'm dishonest and a dishonest man you can trust to be dishonest\nhonestly. It's the honest ones you have to watch out for... You can\nnever predict when they're going to do something incredibly...\n*STUPID*\" \"You need to find yourself a girl mate... Or perhaps the\nreason you practice three hours a day is because you have found a girl\nand are otherwise incapable of wooing said strumpet... You aren't a\neunuch are you?\" \"As long as you are just hanging there pay attention\nthe only rules that matter are these: What a man can do and what a man\ncan't do. For example you can except that your father was a pirate and\na good man or you can't but, pirate is in your blood boy and you will\nhave to square with that someday. Me? I can let you drown but I can't\nsail into Tortuga all by me onesis Savvy? Now can you sail under the\ncommand of a Pirate or can you not?\" These are just three of some of\nthe most memorable quotes that Captain Jack will let you listen to if\nyou watch this movie. Trust me you will love this movie it has been...\nis... and will always be loved by people of all ages and generations.\nYou can still be cought up in it even though it takes place years from\nnow.\n"},
{"review": "\nWow was this movie good! I don't think I've ever seen a movie like this\nbefore! I went to go see it when it first came out in 2003 at a huge\ntheater and it was almost completely full, but luckily I got in. I\nwanted to go see it because people kept on bragging on about it so I\njust wanted to check how it really was, and to tell you the truth, I\ndon't regret any of it.<br><br>This is also probably one of Johnny Depp's best movies. He was a\nperfect and sometimes even funny character in the movie. He met the\nexact pirate voice, which is kind of weird because I haven't heard him\ntalking like that before. Also, Orlando Bloom and Keira Knightley did a\ngood job. It was just a really good movie with an awesome storyline.<br><br>The reason I'm giving it a 10 is because of the plot, the cast, the\nacting and so forth.. And I feel that it was delivered in this amazing\npirate movie! So if you're bored one night, and decide that you wanna\nrent a movie that you haven't seen before, I suggest picking up Pirates\nof the Caribbean, as you won't be disappointed.\n"},
{"review": "\ni saw it a long long time and i liked it no i loved it. it was\nexcellent i am going to watch the new movie Johnny Depp was great. and\nso does Keira Knigthley i am going to watch it another time if you\ndidn't watch it you need to watch it. you will love it it has action\nand adventure and zombies but who are afraid of zombies? its not\nsuitable for kids but some kids that have 13 years old and more can\nwatch it. great movie i can't wait to watch the 2 or even if its a long\nlong trilogy i will watch it.<br><br>10/10<br><br>or even 1000/1000\n"},
{"review": "\nJohnny Depp is truly an acting legend of recent years. This film is\nproof of it. He is always very considerate of what roles he takes on\nand is usually a totally different character in each of them.<br><br>Jack Sparrow is no exception. He is absolutely hilarious, as is his\naccent which does ring true; plus his friendship with Orlando Bloom's\ncharacter Will Turner also rings true. There is chemistry between Depp\nand whomever he shares dialogue with because he is central to the whole\nmovie - thankfully. Depp is my all-time favourite actor, I think he is\nso much more talented than he gives himself credit for. Bloom and Keira\nKnightley form the romance, which expected in all modern movies so I\ncan't complain because the acting is great all round. Another talented\nactor who proves himself in this movie is Geoffrey Rush. Like Depp he\nbrings charisma and comedy to the role, as well as threat. Barbosa is a\ncharacter you love to hate (because of how he treats Sparrow as you\nwill see for yourself and what we learn from their history).<br><br>Jack Sparrow's drunkenness will have you splitting your sides with\nlaughter, believe me. If not then you can't possibly be viewing the\nsame movie. 'Yo ho a pirate's life for me' was sang by Depp and\nKnightley who are rightfully paired by a campfire in one scene. There\nis a spark but the romance is firmly between Will and Elizabeth\n(Knightley). A great movie I would definitely recommend for anyone over\nthe age of 12 who loves a good action movie mixed with comedy, romance\nand the talent of Johnny Depp! I give it full marks\n"},
{"review": "\nDespite the obvious gift of total hotties in this movie (Ahem: Johnny\nand Orlando) the plot, for the most part, is very original. Sure, it's\nabout Will Turner going off to save the woman he loves, but the plot is\nso intricate and delightful that the first time you watch it, you don't\neven concentrate on how gorgeous these men are, but more so on the\nplot.<br><br>The actors were well-placed as their characters, but most importantly\nthe characters were believable, due firstly to the writers. The CGI\neffects were truly amazing, as they were able to characterize the\nskeletons to the characters, which made it easy to keep track of them.<br><br>Pirates, well put together, is not just a family-fun movie or a\nchick-flick, but rather something that just about anyone can enjoy:\naction for men, romance for women, and humor all around.<br><br>Shorlty: humorous and captivating, this is a must-see. One can only\nhope that the second and third movies are as well-written.\n"},
{"review": "\nOh and what a movie this is. There is something for everyone in the\nfamily with this movie, romance, action, drama, horror, adventure and\nfantasy. A quality of acting rivaling no other movie in recent times,\nexcept for the Rings trilogy, but that's another thing altogether. I\nhave watched this movies so many times that I can't even keep track.\nThis movie never gets boring. Johnny Depp is at the top of this career\nwith this film!! A must see, many times over. A true classic! The\ncursed tale of a pirate ship's captain, marooned by his mutineering\nmates and left for dead on a desert isle. He returns with another ship,\nthis time stolen from the Royal Navy, in order to reclaim his rightful\ncommand of the infamous Black Pearl, a ship so evil that hell itself\nspat back her dead. He is joined by the son of a murdered pirate ship's\nmate, a swordsman who's skill and craft are equal to that of Robin Hood\nhimself. The boy is motivated by love for a woman, herself of royal\nblood and captured by those mutineering pirates of ill repute in order\nto release a curse cast upon them from the captured gold of the famous\nSpanish explorer and conquistador, Hernando Cortez. With the Royal Navy\nin hot pursuit of their stolen ship, the captain and the boy, along\nwith another crew of pirates, make haste for the Black Pearl, execute a\ncunning plan, and live happily ever after. Well, not exactly like that\nbut almost. This film is destined a classic because of the dry, witty\ncomments, superb acting of the entire cast, outstanding writing and\nspecial effects, and it's about time someone put this swashbuckling\nstory to film. Rated PG-13, which is the number of times you should see\nthis movie.\n"},
{"review": "\nThis was one of the best movie that I have ever seen! I didn't see this\nfilm at the cinema, but I really wish I had because it has instantly\nbecome one of my favorite movies of all time. I bought the DVD because\nI'd heard good things about the movie, and I've been to both Disneyland\nParis, and Disneyland Florida and loved the Pirates ride at both of\nthem. Having been on the ride, it's quite easy to spot many things in\nthe movie that pay tribute to the ride, especially in the town scenes.\nI wasn't sure what to expect when I bought the movie, but I definitely\ndidn't expect to laugh so much! This movie has such a wonderful\ncombination of excellent acting, astounding special effects, and dry\nhumor. Johnny Depp steals practically every scene he occupies, and\nGeoffrey Rush is excellent and sinister in his villainous turn. It's\nabout as high-quality fun as one might demand in a summer blockbuster,\nand will have you singing \"Yo ho, ho ho\" for days and days to come. A\n\"pirate's life\" is plenty the life in \"Pirates of the Caribbean\", an\nworthy, intelligent sea-faring adventure guaranteed to leave you, at\nthe very least, plenty satisfied.\n"},
{"review": "\nThis movie is a very funny romanticization of those Pirates of the\nCaribbean during the early 1700s, yet touches a deep &amp; wonderful sense\nof adventure in us even now.<br><br>The sea \"pirate\" that is Captain Jack Sparrow is that childlike spirit\nthat lives in all of us - \"despite all the evidence to the contrary\" -\nand has its source beyond and without any definition of worldly\nauthorization. J.R.R.Tolkien had a saying - \"not all who wander are\nlost\".<br><br>And another truly great thing about this movie - it is not in the least\npretentious or heavy handed nor does it wallow in personal issues like\nso many self-important films today.<br><br>'Pirates of the Caribbean - The Curse of the Black Pearl' is just one\nvery cool, well made and fun movie!! <br><br>p.s. <br><br>if you liked this Pirate flick - another kind of 'pirate' in our more\ncontemporary times (1992) that you might enjoy and might want to check\nout is 'Captain Ron' (as in the movie with Kurt Russell). Two very\ndifferent movies but the spirit of Captain Jack Sparrow could be a\nmatch with 'Captain Ron' in another time and place .\n"},
{"review": "\nThis is a perfect movie if (A) you are a twelve year old boy, (B) you\nlike to see stunt men ejected from explosions over and over and over\nagain (C) you will watch anything with Johnny Depp, regardless. <br><br>For more discriminating adults, the two and a half hours of noise and\nchaos unrelieved by any semblance of careful plotting becomes tedious.\nDepp is certainly fun for the first half hour, sending up the pirate\nimage by coating his eyes with kohl and sending up the Disney image by\nacting a little less than wholesome, but after a while, one longs for\nmore than people screaming with swords in their hands backed up with a\nbombastic music score that underscores the emptiness of the enterprise.<br><br>One longs for the sense of heroic purpose and genuine derring-do\nexemplified by Errol Flynn/ Douglas Fairbanks, Jr, or Burt Lancaster in\nsuch grand adventures as The Sea Hawk, Captain Blood, Sinbad The Sailor\nor The Crimson Pirate, all recently released on vivid, family-oriented\nDVDs; Pirates From The Carribbean is cynical corporate entertainment,\nthe humor ironic or tongue-in-cheek, and, though marketed as such, is\nreally not for children unless they are so desensitized to blood and\nsavagery from video games that nightmarish visions do not bother them.\n"},
{"review": "\nI guess I am a bit of a nut when it comes to pirates, but there simply\naren't enough films that depict this brilliantly caricatured era.<br><br>Pirates of the Carribbean adds to the mix a tad of supernatural\nelements and makes a very standard plot into a fun adventure by adding\nseveral memorable characters. The special-effects add to the feeling of\nthe film, but at no point does the film become too big. There's no plot\nto conquer the world. Everything in the film is very down to earth and\npersonal.<br><br>Johnny Depp naturally adds to the film with his brilliant performance\nas Jack Sparrow, possibly one of the most original characters I've seen\nin a long while. He's become one of my favorites alongside such figures\nas Darth Vader, Bond and Riddick.<br><br>A very nicely done adventure. Brilliant movie!\n"},
{"review": "\n\nTo tell you the truth I can't remember much about the plot--and I just saw\nit last night!  Something about a cursed pirate ship and its crew and how\nthey all turn to skeletons when moonlight hits them and how they need some\ncoins or something to release the curse...I was so bored during this film my\nmind kept wandering.  Maybe I just don't like pirate films but I think\nthere's more to it than that.<br><br>This film has some major problems--it's way too long (half an hour could\nhave been cut out easily); the story is (needlessly) convoluted and very\nbadly done (I'm blaming the screenwriters and director, NOT the actors);\ndespite all the explosions and fights the action scenes are surprisingly\ndull; there's loads of casual violence; leading lady Knightley is constantly\nbeing hit in the face and the admittedly great special effects just didn't\ngrab me.  There is a spectacular sword fight at the end with the men going\nin and out of moonlight and going from skeleton to man and back again--but\nit's too little too late.  The direction is WAY off too--he seems unsure of\nhow to frame scenes and it makes things very confusing.<br><br>I can't fault the actors--Orlando Bloom (very handsome with beautiful black\neyes) is very good in a badly written role. Keira Knightly's role is even\nworse--she's just \"the girl\" in the movie and no one could be good in it. \nGeoffrey Rush is OK as the pirate chief.  Johnny Depp is the one reason to\nwatch this movie.  His performance is so off-beat and funny he keeps the\nfilm afloat.  Just his mannerisms and facial expressions give an unexpected\nkick to lines.<br><br>So...this handsome production sinks because of bad direction, ridiculous\nlength and many many boring stretches.  Unless you're a huge fan of pirate\nmovies you can skip this one.\n\n"},
{"review": "\n\nWhen I sat down to watch this movie, I was expecting to see a movie that was\ndecent at best. I was very surprised to find how unbelievably bad it was.\nThe plot is non-sensical jibberish. The characters are all one-dimensional,\neither good-to-the-heart, or bad-to-the-bone, with absolutely no variations.\nThe acting is horrendous, Johnny Depp is like a washed-up rock-star, heavily\ndrugged and very drunk, the entire time. Orlando Bloom is nothing but a\nsimple rehash of the knight in shining armor, if only a bit more easily\ntolerated. Keira Knightley is just a damsel in distress, pure and simple,\nnothing else. Something I found ridiculous, was that every other character,\neven minor characters, mastered sword fighting. The humor is unbelievably\nchildish, at several times it was on the level of the newer Simpsons\nepisodes, which made me cringe more than I believed was possible. All of the\nCGI effects were very bland, most looked like they could easily have been\nmade at the same mediocre quality several years ago. Why so many people\nclaim this is a great film eludes me. If you ever even consider to sit down\nand watch this, make sure you keep your expectations very low. Very\noverrated. I wouldn't recommend this to anyone, as it is simply too long,\ntoo boring, too bland and too cringe-worthy to be the least bit enjoyable.\n3/10\n"},
{"review": "\nIf this is among the best from Hollywood, I don't think I'm going to\nanother for a long time.<br><br>I know I'm in the minority, but I just don't see the point of this\nmovie. Its plot was totally predictable, filled with all the usual\nsilly impossible heroics. The protagonists, by all rights, should have\nbeen killed many times over.<br><br>The movie also had a rash of other implausibilities, e.g., no one on\nthe protagonists' crew died despite sustained mortal combat against a\nsuperior foe, who by virtue of a curse, could not die. The ending was\nespecially nonsensical: several times throughout the movie, Orlando\nBloom had been condemned to death (of course, he implausibly escapes\neach time) after having saved the life of the beloved fiancée of the\ncommander (and daughter of the governor). Then at the end, they simply\nlets him and his accomplice go?!?! Even the Johnny Depp character,\nwhich admittedly had some charm and craftiness, didn't make sense: why\nwas he seemingly quasi-drunk all the time, slurring his syllables? And\nwhy all the eye-makeup? In the end, I wonder about all the money spent\non this movie, and about a society in which a silly, pointless fantasy\ncan be lauded as among the finest cultural outputs in years.\n"},
{"review": "\nThis movie is a must fo anyone's collection. It's clean, exciting and\nfun to watch. It gave me a whole new view on piracy. I mean every\npirate in movies and plays before this either had a parrot, a peg-leg\nor an eye-patch. Pirates of the Caribbean doesn't have any of those\nstereotypes. Depp plays his role brilliantly, there is not a dull\nmoment when he's on screen and Bloom portrayed the love-sick blacksmith\nperfectly as well. Knightley's role was a bit modern(strong, take-\ncharge feminist), but that also added to the movie, she was great. I\ncould go on about the actors, but there wouldn't be any more room, they\nwere marvelous! This movie is mysterious, every single time I watch it,\nI can barely pull myself away from the screen! THis is without a doubt,\nthe best movie I've seen yet.(A)\n"},
{"review": "\nAs you can probably tell from the title, this film never gets old!\n\"Pirates Of The Caribbean: The Curse Of The Black Pearl\" is a\nswash-buckling pirate adventure/action film released in the summer of\n2003. The entire crew working on this film were certain it would flop\nmajorly in every sense of the word, as earlier attempts at kicking off\na Pirate movie saga was met with little to no attention, and failed at\ngaining a trusty audience. But with the help of star Johnny Depp, as\nwell as other notable actors, the movie grossed well beyond any other\nproduction in the box office at the time, amazing and surprising its\ncreators. The movie is pure fun, from the way the characters are\nintroduced for the first time to the action of the saga's original\ntale, scored beautifully by Hans Zimmer (One Of The Best Alongside John\nWilliams). The music has that pirate feel to it, the awesome intensity\nof the action taking place and the confused but comical little tune\nthat plays as Jack Sparrow stumbles around in the mystery. Johnny Depp\ngives a majorly entertaining and unique performance of Jack Sparrow, a\ndwindling hero with his own goals and aspirations. The character is\nimmediately welcome alongside the likes of such action heroes as:\nIndiana Jones, Luke Skywalker, The Terminator and more..! The other\ncharacters receive the same amount of dedication, Will Turner (Orlando\nBloom), Elizabeth Swan (Keira Knightly) alongside many more all have\ninteresting and well written arcs. The movie also looks great, the\nvisuals in some shots are stunning, though some of the CGI looks just a\nbit unfinished. As stated before, the original Pirates of the Caribbean\nfilm is pure fun and a great couple of hours to spend. It is... without\na doubt, the best one out of the current four. SAVVY?\n"},
{"review": "\nI teach English I in Dimmitt Texas and use this movie in the Media\nFocus portion of my curriculum. It contains excellent examples of many\nof the film elements on which I concentrate in this unit. I have been\nshowing the VHS because I did not have the DVD. I recently purchased\nthe DVD and found that the \"making of the movie\" selection will be of\ngreat benefit to my students during the Media Focus unit. For many of\nmy students, movies are a luxury they seldom afford, so they enjoy\nwatching in class. These students are very fascinated with the \"how'd\nthey do that\" component of movies. My focus on media is that almost all\nmedia is trying to sell you something. Some of my students can relate\nscenes from various movies that contain \"plugs\" for various products.\nThese students are pleasantly surprised to find none of these overt\nefforts to promote particular products in this movie. I seldom watch a\nmovie a second time until it has been five or more years since the\nfirst time I saw it. I watch this movie in class every year and at\nleast once during the summer each year. Each time I see the movie, I\nfind something to inspire new interest. I love it.\n"},
{"review": "\n\n\"Pirates of the Caribbean: The Curse of the Black Pearl\" is just the\nkind of jovial, buccaneering blockbuster that demands a sequel in the\nfuture. It is worthy sea-faring entertainment indeed, featuring\nglorious and realistic set design, spooky and impeccable visual\neffects, some fine, indelible acting by Johnny Depp (in his most\nwhimsical performance yet), and some classy, comical dialogue between\nthe British sea captains and the vicious, blood-thirsty pirates. A film\nthat provides basically everything you might expect in this kind of\nfun-filled adventure, albeit somewhat overstaying its merry welcome and\ndeviating enormously from its Disneyland theme park ride inspiration,\nhardly ever does this amusing, entertaining extravaganza of a movie go\nwrong. From the gorgeous costume designs to the murky, gloomy, and\nshanky sets of the Caribbean, pirates' ships, and lands ahoy, to the\neye-popping, deceiving visual effects (I was chilled to the bone at the\ntransformation of the \"pirates in the light\" sequence), aside from\nbeing sheerly entertaining and festive, this is one amazing technical\npiece of cinema. Johnny Depp steals practically every scene he\noccupies, and Geoffrey Rush is excellent and sinister in his villainous\nturn. It's about as high-quality fun as one might demand in a summer\nblockbuster, and will have you singing \"Yo ho, ho ho\" for days and days\nto come. A \"pirate's life\" is plenty the life in \"Pirates of the\nCaribbean\", an worthy, intelligent sea-faring adventure guaranteed to\nleave you, at the very least, plenty satisfied. ***1/2 out of ****\n\n"},
{"review": "\n\nWhat an escape to visit Port Royal and the Caribbean! It's pure fun.\nAnd I must say that Commodore Norrington is the man! His dry sense of\nhumor and strength of character make him one of my favorite characters\nin the movie. (I know that Orlando and Johnny Depp are favorites of\nyounger women, but Norrington has a lot more going on, underneath that\ncool exterior.)<br><br>Norrington has some of the best lines, but the character Mr. Gibbs is\nalso a favorite of mine, with his (Irish?) sailor character. One of his\nbest lines (about Jack Sparrow):<br><br>Will Turner: \"Is that the reason for ...?(he gestures like Johnny\nDepp)\" Gibbs: \"Reason's got nothing to do with it!\"<br><br>Great Barbossa line: \"You're off the map. There be monsters here!\"<br><br>So everybody have a happy \"Talk like a Pirate Day\"!\n\n"},
{"review": "\n\nNot once have I seen a movie with such glory as Pirates of the\nCaribbean: Curse of the Black Pearl. Not once have I seen a movie in\nwhich anyone of any age or gender or whatnot can enjoy. I didn't think\nthat the movie was going to be too good, but I went to see it because\nmy mom wanted to, and left with a huge smile. The element that the\nmovie contained was that of superiority above movies. While it contains\nsuch bathroom humor and immaturity, it also contains a sense of\nseriousness. The fact that the crew decided to use a navy ship for the\nBlack Pearl and decided to build the Interceptor shows the amount of\neffort (effort musn't be disregarded) put into Gore Venbrowski's film.\nThe action packed sea battles and sword fights had the whole audience\nwowed. Speaking of the audience, I also noticed that there were old\nfolks, little toddlers, teenagers, and middle aged people all around.\nJohnny Depp puts up a killer performance, as does Orlando Bloom. Many\nnew actors were casted as well, and put on a shocking performance.\nY'all really should see this movie! Nothing beats it! 10/10 on my\nscale.\n\n"},
{"review": "\n\nBefore I actually saw the movie, I thought it looked stupid. It looked\nlike another Disney movie that I would hate. Then my dad brought the\nmovie home and my friend begged me to watch it with her. And after I\nwatched it, I fell in love with it! This movie is so great!<br><br>This is the kind of movie that would be fun to watch over and over\nagain, if you didn't have other things to do. It's funny and\nadventurous.<br><br>Johnny Depp plays a great pirate. I couldn't imagine the movie being as\ngreat without him playing Jack Sparrow. His face expressions, I think,\nmade his character so funny.<br><br>The whole cast completely fit their parts. I think this movie was\ndefinitely<br><br>well-casted, and I hope everyone will be in it again in the sequel.<br><br>I would definitely recommend this movie.\n\n"},
{"review": "\n\nYo Ho, Yo Ho, a pirates life for me! The film, The Pirates of the\nCaribbean has a theme that is evident. The Pirates of the Caribbean\nshows that the central insight is the fact that not all pirates are\ncold hearted. They can show compassion and camaraderie. It was under\nthe brilliant direction of Gore Verbinski (The Ring, The Mexican) that\nthis film's theme could be so easily seen. The Pirates of the Caribbean\nis a visually pleasing display of a true pirate adventure. Captain Jack\nSparrow (Johnny Depp, Edward Scissorhands) steals the show by revealing\nthat not all pirates are cold hearted. The story begins with a gold\nmedallion found on a boy which is taken from him to protect his\nidentity from the British Navy that he is a pirate. The evil pirate\nBarbosa (Geoffrey Rush, House on Haunted Hill) and his crew are drawn\nto the medallion and will stop at nothing to get it back to break their\ncurse. Johnny Depp's character has little concern about the medallion,\nbut does want to get his ship, the Black Perl, back. Will Turner\n(Orlando Bloom, Lord of the Rings) teams up with Jack Sparrow to fight\nthe pirates to regain the kidnapped governor's daughter (Keira\nKnightley, Love Actually) regain the Black Perl and defeat the evil\npirates. The lighting in this film says a lot to describe the contrast\nof good and evil. When the camera is on Barbosa and his crew it is very\nlow lighting to give the audience a sense of darkness. When the camera\nis on Jack Sparrow and his crew the lighting changes, it is bright and\ngives a feeling of camaraderie. This brings us back to the theme of the\nfilm, not all pirates are cold hearted.\n\n"},
{"review": "\n\nI have seen this movie at least two dozen times, and I love it.  It is my\nfavorite movie ever!  Johhny Depp does an amazing job acting the part of\nCaptain Jack Sparrow, and the rest of the cast is great\ntoo.<br><br>Pirate movies have never been that popular, but this movie was AWESOME!  I\nbecame obsessed with pirates after seeing this movie, and I even bought a\nhuge poster of Johhny Depp to hang on my bedroom door.<br><br>This movie was everything.  It was a hilarious action/romance with great\ncostumes and actors and visual effects, and though the storyline was a\nlittle confusing at first, after seeing it a couple of times, I fell in love\nwith this movie.  I bought it on DVD right after it came out, and I watch it\nall the time.<br><br>A wonderful, awesome, amazing, great, fantastic, fabulous, MUST-SEE!\n\n"},
{"review": "\n\nI dragged my heels on seeing this movie, and I was sorry that I did.\nJohnny Depp is hysterically funny as Captain Jack Sparrow, a shipless\npirate who dodges capture deftly, if not haphazardly. Supported by\nOrlando Bloom as a reluctant son of a pirate, the two embark upon a\nquest to rescue a lovely lady, and capture a ship who's crew is under\nan interesting curse. The action was very well executed, and the plot\nkept you going through the over two hour movie. A testament to it's\ncharacter is that you really do not notice the time passing. Johnny\nDepp shows us again why he is an acting force to be reckoned with,\nchoosing obscure and lucrative roles for our imaginations. This\nparticular character is like none other than he has ever played. New\nviewers (or even returning viewers) should pay close attention to\nDepp's facial expressions, particularly in scenes where the focus is\nnot on his character. Special effects usage was eye opening, and\nOrlando Bloom is moving right on up the ladder of his career with solid\nsteps upon the rungs.\n\n"},
{"review": "\n\nIt is unusual in this day and age to find a fun movie the whole family\ncan enjoy. The violence is what I would expect in a pirate flick, the\nlanguage was extremely tame ( damn, hell) Geoffrey Rush was\noutstanding. I've a place in my heart for a good old fashioned bad boy.\nSome of his comments are hysterical you can actually BELIEVE he is\npirate. The mannerisms, the faces, the chases, the ARRRRR he has it\ndown pat. I rewatch it for his performance. Johnny Depp is delightful\nand warm and quite lovable for a pirate. He's eye candy anyway (from\nway back in the 21 Jumpstreet days). Some of the swashbuckling scenes\nwere a little lengthy for me but the musical score is powerful and\nproud and carried me through. I love Geoffrey Rush\n\n"},
{"review": "\n\nThis movie was great! Right on target for even the adult audiences. The\nactors did a marvelous job. Depp was super convincing. His walk, the\nway he talked, excellent drunkard. The movie was hilarious and the\ncurse added the adventure and action I am constantly craving for. Never\nhad my interests in pirates been so large. The fact that Bill \"Boots\"\nTurner's child was indeed Will Turner rather than the elegant Elizabeth\nSwann and had been terribly mistaken was fabulous! Elizabeth had gotten\nher self into a riled up ship of angry damned men. All in all, the\nmovie was great! Righto! I've watched this movie millions of times and\nnever once has it not surprised me. I am in love with Jack Sparrow and\nWill Turner.\n\n"},
{"review": "\n\nthis has to be one of the best movies i have ever seen! i can watch it\nover and over and never get tired of it...the cast choice was\nPREFECT...and for whoever it was that said in august 2003 that they did\nnot understand why it was only will turner's blood they needed...in\ncase u haven't figured it out yet...they needed blood from everyone who\ntook gold from the chest...barbosa said in his speech when they were\nfirst gonna take blood from elizabeth that each of them has returned\ntheir piece and paid their blood...but hers had yet to be paid...and\nit's why jack cut his hand before he threw his piece of gold to\nwill...that comment was from, like, a year ago...but in case u didn't\nunderstand yet...anywho...the entire cast was awesome in this\nmovie...they couldn't have done better...and the effects and everything\nwere incredible...i hope that the second one is just as good...\n\n"},
{"review": "\n\nPirates of the Carribean was quite astonishing in many ways. Although it may\nbe overrated because of the high quality actors such as Johnny Depp and\nOrlando Bloom, it is still worth a try.\n   The scenery is amzing mainly becuase its real and not fake. the music\nhelps capture the momment and the script was pretty well wrote with the\nexception of a few draggy moments. The fight scenes are very good and\nrealistic as well as the over all affect.\n   The casting was actually very good and the characters were protrayed very\nwell. overall---disney lucked out on this movie...9/10\nstars.\n"},
{"review": "\n\nOK. First of all I would like to say that whoever wrote the comment\n\"Great Poster, bad movie\", i respect your opinion, but I completely\ndisagree. Maybe since you kept falling asleep, you didn't get the humor\nand storyline of this movie like you should have. This movie was great.\nI had no problem remembering the plot. Orlando Bloom, Johnny Depp, AND\nKiera Knightley were fantastic. Orlando Bloom has shown his versatility\nin acting by going from completely different characters and playing\nthem excellently. Johnny Depp deserved that best actor award every bit,\nand I was very sad to learn that he did not receive it. He played a\nconstantly drunken pirate, who had gone a little bit mad, and he did it\nvery well. Kiera Knightley, whose performance in \"Bend it Like Beckham\"\nwas also great, plays a young girl, a little too modern for her time.\nShe stands up for herself, and is also very clever. I would also like\nto mention that Jack Davenport and John Rys-Davies were also very good\nin this movie, and they get too little recognition. Captain Barbosa,\nplayed by Geoffrey Rush, was an awesome bad guy. I absolutely loved\nthis movie.\n\n"},
{"review": "\n\nI thought this was one of the greatest movies I have ever seen and\nthought that Johnny Depp and Orlando Bloom played their roles to the\nbest of their ability. Kiera Knightly was great as Elizabeth Swan and I\ncan't wait to see the next two movies. I would recommend this film to\neveryone. If you get the chance to see this movie you should. The\nspecial fx were brilliant as were the cast.Everyone I know who have\nseen this movie have loved it. It has action, adventure, romance,\nhorror, excitement and had many funny bits/quotes. Everything a movie\nfan would want. The only bad thing in this movie were some of the\nmistakes they have made; historical, continuity, etc... It was still\nbrilliant though.\n\n"},
{"review": "\n\nPirates of the Caribbean has lots of different effects and this is what\nmakes it a good film. The key event is when the governor's daughter is\nkidnapped by a crew of dreaded pirates. Watch for Captain Jack Sparrow\nturning into a skeleton when he walks through the moonlight.<br><br>Unsurprisingly, the film actually has pirates in it. The director Chris\nColumbus has done a good job. It was an Oscar-winning film and now they\nare working on a sequel. <br><br>The film is rather long and some viewers might get bored, particularly\nif they like serious films. Some of the interior scenes on the video\nversion are rather dark and difficult to see clearly. However, Pirates\nof the Caribbean is exciting and full of suspense, and great if you\nlike pirates. <br><br>The key actors in this marvellous film are Johnny Depp, Orlando Bloom\nand Kiera Knightly. Johnny Depp was at his best, and really was Jack\nSparrow. I would advise you to buy this film.\n\n"},
{"review": "\n\n\"Pirates of the Caribbean\" is one of the best films I have ever seen.\nIt is an adventure film which is very funny and it has some romantic\ntouches. The veteran actor Jonhy Depp is excellent in his part as the\nold salt \"Jack Sparrow\", Geoffrey Rush is the best choice for the part\nof the bad character and the attractive Orlando Bloom promises to turn\ninto one of the most important young actors in Hollywood just like\nKeira Knightley. The exotic landscapes and all the setting are some of\nthe best aspects of \"Pirates of the Caribbean\", but I would only\ncriticize one thing: you would know the skeletons of \"Captain Barbosa\"\nscrew were made by computers, but it is great. I think I will never see\na better pirates film. In fact I have never been interested in this\nkind of films till I have seen this one.\n\n"},
{"review": "\n\nTo me this is Johnny Depp's best role, and Geoffrey Rush proved there are\nfew artists like him in the worldwide movie. \nIn general you're sorry for Depp both times he is to be hung. This kind of\nmovie hadn't been shot for a long time, and it's good to continue Walt\nDisney's traditions. `The pirates of the Caribbean' is a fairy tale for\neverybody. I can't imagine anybody who won't enjoy it.<br><br>In the last years it's one of the best projects which must be purchased on\nDVD. \nFor me Jerry Bruckheimer's name is the guarantee of fresh, cheerful, dynamic\nand justice movie, and Gore Verbinski is great. I'll wait for him to direct\nanother one. \nIt was clear Orlando Bloom will a brilliant career, and about Keira Knightly\n\u0096 I'm sure everybody fall in love with her. In one word all the good that\ncan be, you'll find here. \nI recommend everybody who has missed the chance of watching it in the\ncinema, correct the mistake. This film will bring good mood and positive\nemotions. \nAnd now excuse me, I'd rather watch it once again. Thank you for your time.<br><br>\n"},
{"review": "\n\n*Please excuse my horrible pirate language in the summary.*<br><br>Pirates of the Caribbean is probably the best Johnny Depp movie ever made!\nIf I were to make a list about the Pros and Cons of this movie, you would\nfind no Cons! Right now I would just like to mention some of the things I\nenjoyed about this movie.<br><br>*Johnny Depp.* Oh my gosh, I am dangerously in love with Johnny Depp. He\nis\nprobably the first reason I went to see this movie. At first when I heard\nabout the movie just coming out, I didn't think it would be too good. Now\nafter I've watched it, I am constantly thinking up new pirate languages\nand\nslang words. &lt;shrugs&gt; A weird old banana, I am.<br><br>*The Pirates.* I LOVE THE PIRATES!!! They are not only very\ncOoOoOol-looking, but they give you a good scare when you first see them!\nI\nliked the part where all the pirates are walking underwater. It shows you\ntheir skeletons while they are walking under the moonlight, but when they\ngo\nunder the shade from the moonlight, they return to normal. Then, out from\nunder the shade they walk, and they transform back into skeletons. Can you\nsay, \"Awesome?\"<br><br>*The Special Effects.* Special effects were awesome in this movie! Very\nsimilar to Haunted Mansion, this movie has probably the best special\neffects\nin any other movie.<br><br>There are many other things I loved about this movie, but it would take me\nabout 300 years to point them out. ;)\n"},
{"review": "\n\nI missed out on seeing Pirates of the Caribbean on the big screen, and\nnow\nI wish I hadn't. I first saw it at my friend's place on DVD and I loved it\nimmediately and really wanted to see it again.\nThe characters are all perfect for their parts, Orlando Bloom plays an\nexcellent Will Turner, Kiera Knightly is great as the pretty governor's\ndaughter, Geoffry Rush is a superb villain, and Johnny Depp's funny antics\nbring the movie together to make a masterpiece on film.<br><br>I had no idea what I was about to witness as I sat on the couch, not\nhaving seen any of these actors (Except Orlando, LOTR) in a movie before.\nBy\nthe time it finished, I was laughing so hard I could hardly breath. I\nloved\nJohnny in the boat at the start, Orlando's heroism throughout the movie,\nand\nthe kiss at the end. Everything was so perfect that I wished it would\nnever\nstop, and now it's one of my fave movies of all time!\nThere's only one thing I don't get though. Why did Jack Sparrow cut his\nhand at the end just before he passed the medallion to Will? I would love\nto\nget an answer to that.    \n"},
{"review": "\n\nEveryone loved Johnny Depp in this movie and no doubt, he deserved that\nOscar nomination\nbut if it didn't have him,\nit'll be some swashbuckler with Orlando Bloom which wouldn't attract much\nexcept girls.<br><br>I'm not saying Captain Jack Sparrow is the only good thing. The special\neffects, costumes and performances from others such as Geoffrey Rush and\nMacKenzie Crook (Gareth from the Office in a Hollywood movie, yeah!) also\nto\nthe arrival of Keira Knightley.\nBut do watch it as it is a great fantasy adventure film.\n"},
{"review": "\n\nI am the type of person who hates action movies so for me to tell you that\nthis movie rocked is a big deal. It might help that I'm the biggest Johnny\nDepp fan though.\nDon't be fooled by the Disney name...it's not the same old sugary crap you\nexpect from Disney (even though that's what's to be expected as Disney is\nusually geared towards children). It's got a great story and the acting is\nbrilliant. I'm not a big Kiera Knightly fan but I think she did a good job\nin the film. There is alot of action so if you're into that kind of stuff\nthen you'll love this film.\nI think what I liked best about this film, though, (aside from Johnny\nDepp)\nis that there's a romance story laced inside of the crude world of piracy.\nOrlando and Kiera's characters are in a sort of forbidden relationship and\nthey fight for eachother through the whole movie.\nJohnny Depp makes you laugh, Geoffrey Rush disgusts you (good actor, gross\ncharacter), and Orlando and Kiera make you sigh in jealousy. Great movie\nfor\ndates because you've got the love story and the action flick all in\none.\nI'm not gonna tell you the story, just see the movie, you won't be\ndisappointed.\n"},
{"review": "\n\nI saw this movie the day It went into theaters. It was an Exilent movie\nActually it is my favorite movie. Johnny Depp makes the movie funny,\nOrlando\nBloom makes it romantic. To me Orlando  Bloom is the hottest guy out\nthere.\nAll of the cast makes this movie great!! I can't wait for the next one!!!\nLove ya Orlando!!!!  Jeffory also gives this movie spice! Along with\nOrlando\nKierra makes this movie an exciting romance. All I can say is that I wish\nit\nwas me being kissed at the end of the movie instead of Kierra!! Anyway I\nlove Orlando and Johnny, but mostly Orlando!! I can't wait till the next\nfilm they are  in together. Love ya Orlando!  Does anybody out their know\nwhat the second movie is going to be called????\n"},
{"review": "\n\nPOSSIBLE SPOILERS<br><br>I saw this in the theaters last summer and man, this is classic,\nedge-of-your seat fun!  Sexy Orlando Bloom's presence in the film is worth\nthe $6.50 admission alone!<br><br>As a fan of the classic Disneyland ride, I decided to see the film and\nwhile\nI'm familiar with the book-to-movie genre of film, I'm not exactly\nknowledgable of the theme-park-ride-to-film genre.  Still, this movie\nkicks\nbutt.  Big time.<br><br>Orlando Bloom and Johnny Depp are both eye-candy for the female viewing\naudience (being a female, I found them to be quite eye-candyish).\nGeoffrey\nRush steals the show as the power hungry pirate out for revenge.<br><br>9/10...YO HO, YO HO, a pirate's life for meeeeee......\n\n"},
{"review": "\n\nI have to be one of the biggest fans of this movie.  I loved every minute of\nit.  One word of caution though, it is rated PG and I think is produced by\nDisney, so even though there's raggedy pirates and sword fights, there is no\ncursing, nudity or bloody scenes.  That certainly didn't take away from it\nas far as I was concerned.<br><br>Johnny Depp stole the show and played his part very well.  Geoffrey Rush\n(Barbossa) also did a fine job as did the rest of the cast.  I wasn't overly\nimpressed with Orlando bloom, Keira Knightley, or Jack Davenport but they\ndidn't do a poor job and certainly didn't take away from the film.  I guess\nyou could say I liked all the pirates the best, the rest of the cast were\ndecent fillers.<br><br>I loved the humor flow of this movie, when I saw it in the theaters, I must\nhave been the only person who had ever been on the Pirates of the Caribbean\nride at Disneyland, as I completely busted up in the first jail scene, as\nwell as a few other scenes, whereas no one else did.  I didn't find the\nmovie the least bit scary, but I wouldn't show it to a very young kid either\nas it would probably scare the pants off them.  All in all this movie had\ngreat acting, mainly by the two characters I already mentioned, a decent\nstory, great effects and battle / fight scenes, and a good overall flow.  I\nown this movie and have probably seen it more than 10 times.  By far the\nbest movie I've seen this year, with Kill Bill and ROTK being a semi close\nsecond/third.<br><br>I certainly hope they make a part II, and If they do, definitely keep Depp\nin, without him, it wouldn't have been the 10 /10 that I rated\nit.\n\n"},
{"review": "\n\nI loved the movie!  Johnny Depp was hilarious in this film.  I have never\nseen him take a role like this and this one he took and did well!  Love ya\nJohnny Depp!<br><br>Orlando Bloom I thought was also amazing.  Although it totally floored me\nwhen I found out he was the blonde in Lord of the Rings.  I thought it was\ntwo different people.  Don't ya love it when actors or actresses can\nchange\ntheir looks and make you do a double take?  Orlando, you have my\nheart!<br><br>My kids love the movie and we think it's great!  Anybody that wants to\ncheck\nit out, feel free, it's a good choice!  One thing we loved about it the\nmost\nit not only does it twist and turn leading you blindly into the story and\nkeeping you entertained for hours but it's one of those movies you can\nwatch\n1,000 times and still enjoy it and never get tired of.<br><br>\n"}
]