[
{"review": "\nI LOVED the first installment of this series (more than the second) and\nmost beautiful part about the two parts is the love story. It was a\nSHOCK that they had to kill the character of Gwen Stacy specially when\nit is Emma Stone playing it. It left me in a sad sad feeling. <br><br>Another thing I could not digest was how EASILY Peter Parker moved on\nfrom her after her death (I Know the inspiration came from her own\nspeech, but if it were myself, I could never move on). I was expecting\nto be shown as the spiderman officially retired, for the next\ninstallment to have even more vicious villain forcing him to return.\n(Kinda like The Dark Knight Rises)<br><br>I mean leaving all this aside, I LOVED it!\n"},
{"review": "\nThis could be the movie of the year for me definitely this movie is so\namazing and so good I think a stupid rating 7.4 is so low it should\nhave been beyond 8 but I rate it high mostly because of visual\neffects,Andrew Garfield+Emma Stone,Dane DeHaan's amazing play and the\nsadness in the end.<br><br>This movie is funny is sad is amazing in every aspect. A.Garfield\ntopped this movie no doubt the best Spider-Man movie ever and until now\none of the best movies of this year it just couldn't be better. From\nwhat I watched this year this movie is far better than any one else\nexcept I am waiting to see Dawn of the Planes of the Apes to see if is\nany better but until now this one is the best one yet,\n"},
{"review": "\nin my opinion Electro is one of the coolest spider-man villains, his\ndesigned looked epic and so were his powers and Jamie Foxx was very\ngood playing him. Also his soundtrack was very good and added to the\nwhole powerful feel of electro. The acting in this film was very good\nand believable and so was the romance between Gwen Stacy (Emma Stone)\nand Peter Parker (Andrew Garfield). The storyline was very interesting\nand there was the right number of villains in the film, however i do\nbelieve that the goblin was shoved in at the end just to kill Gwen, and\nthe Rhino just to set up other films. So therefore i think Harry Osborn\nshould have had more screen time as the goblin. Furthermore, it would\nhave been better if the whole thing with spider-man quitting after\nGwen's death should have continued until the end of the film and the\nnext film should have started with spider-man returning and fighting\nthe rhino. More reasons why i was disappointed are that Norman Osborn\ngot about 4 minutes screen time and a lot of the movie was wasted on a\nstupid, boring sub story about Peter trying to find out about his dad\nwhich lead to one moment that was relevant to the plot ; the bit about\nthe spider venom. However as i have previously mentioned, these\ndisappointing and frustrating things were partly made up for by\nelectro. I enjoyed every elector scene and they were all exhilarating.\nSo overall a very good film with a few flaws here and it set up future\nfilms very well, which I'm am very much looking forward to.\n"},
{"review": "\nI loved the original spider-mans but I really do prefer Andrew Garfield\nas the main man, he plays the character a lot better than Tobey\nMaguire. First things first this film was great, plenty of action,\nromance and drama. The CGI was fantastic and what they did to Jamie\nFoxx's character Electro was amazing it was like he was a complete\ndifferent person! You learn a little more on peters parents and were\nintroduced to Harry Osbourne Aka Peters best friend (well in the\noriginals he was) this was a great marvel film made and I will always\nwatch the new spider man films until they stop making them because\nthey're brilliant.<br><br>SPOILER ALERT! The only thing I was disappointed with in this film was\nthat Gwen Stacey dies *sobs* I heard that she was going to be killed\noff but I wasn't sure that it would be in this movie. I did actually\ncry a little because I loved her character and the chemistry between\nher and Peter (The real life couple) was spot on. I really wished they\nhadn't of killed her off because Emma stone played that character so\ngood now we have to see peter fall in love all over again with Mary\nJane (that's if they bring that character into the third movie) but all\nin all this film was a 10/10\n"},
{"review": "\nOK years after the not really amazing Spider-Man this new series of\nspidey movies has not been successful with adults and some teens. But\nnow the 2nd movie was 1 year ago and it's been a very good film indeed.\nBut I don't really like the fact that there is going to be 2 MORE\nMOVIES!! So there is amazing Spider-Man 3 coming 2016 and amazing\nSpider- Man 4 in 2018. But let us talk about amazing Spider-Man 2 and\nthe Spider-Man 2 in 2004 so we can compare it to each other. First of\ncourse amazing Spider-Man 2 so it has got over the top action lots of\nswinging moments of course and 3 villains which are the green goblin\nelectro and the 2 minute rhino!! Over to Spider-Man 2 it has got some\nrubbery moments and only 1 villain doc ock and also boring stuff so\namazing Spider-Man two Is a big improvement from amazing Spider-Man\n2012 and although it's sometimes silly it's really entertaining for\npeople everywhere but of course amazing Spider-Man 2012 is so silly and\nunneeded(SOZ mark Webb) so yeah\n"},
{"review": "\nNot too bad &amp; not too good ,that's what can I say for this movie. This\nmovie has a nice story line,and I think I just like the visual effect.\nI don't like Sad Ending, actually it's not Sad Ending it just not Happy\nEnding. I think people like this movie because this is a sequel, so the\npeople like this movie because they like the previously movie. And\nmaybe the people or \"The Watchers\" like this movie because they curious\nabout the new character. And what I want to know is, where is The\nElectro? well he just defeated from the battle with Spider Man and\nafter that he's gone. So... yeah this film is Not too Bad and Not too\nGood.\n"},
{"review": "\nThe first time I saw this movie (opening night) I was really\nunderwhelmed. Nothing in the movie seemed to make sense, because there\nwas so much in it. I went to a second viewing for the film and found\nmyself pleasantly surprised by how much I loved it. It is a really well\ndirected, written, and acted film. Many people hate on it because they\ncant follow it and find small things to complain about, but if you\nactually pay attention to the film, you see they explain things. a\ncommon complaint was \"why did Harry know to crawl to the goblin suit\nand know it would heal him\" wwell if you paid attention you will have\nseen he observed the suit in a earlier scene that explained everything\nabout it. So stop trying to find things to hate. This movie is\nfantastic and I believe it is the best Spider-Man film to date. And the\nbest incarnation of Spider-Man on film. The cast is really spectacular\nespecially Andrew Garfield and Dane DeHaan. So do yourselves a favor\nand ignore the critics. you'll have a blast. I love this movie.\n"},
{"review": "\nI had high expectations for this picture due to two main reasons.\nFirst: I really loved the first Webb's vision on Spider-Man. Second:\nMany people told me good about it-- albeit some others said the\ncontrary. Anyways, I feel very sincere to say that it almost\ncorresponded to my hopes. The first hour of this film is extremely\nentertaining, containing lots of action, drama and even humor, each one\nin its own way. The scene in which our hero takes the pants off of a\ncriminal is really unexpected, reason why I instantly laughed. The\nrelationship between Peter Parker and Harry Osborn is just as great as\nI could've expected. They play that classic game in which initially\nthey seem to like each other, but, in some other times, they feel like\nenemies. Acting from Emma Stone is GREAT, like in the previous\ninstallment. Director has so much faith in her that basically all the\nemotive sentences come from her character-- which in fact touched me,\nmainly if considering I'm about to graduate. Besides, I feel very\nsatisfied that a Spider-Man movie FINALLY decided to explain the issue\ninvolving Peter's parents; I mean, for those-- like me-- who have never\nread the cartoons, their situation was an absolute abyss. Also, I\nenjoyed the joke involving \"Jaws\" and I had a spontaneous laugh in that\nscene. Photography directing and special effects are beautifully\nAWESOME. Other than that, I kind of agree with those who complained\nabout the plot, since it felt rushed for some moments, but it doesn't\nthe spoil the movie's overall qualities. \"The Amazing Spider-Man 2\",\neven if not as great as the previous version, obviously, is a movie\nthat I respect and recommend to anyone who enjoys this superhero.\nThumbs up!\n"},
{"review": "\nAlthough i thought the film was great, i did feel the ending let it\ndown slightly. the death of Gwen ruined it for me. it made the fact of\nher going to oxford in england irrelevant. they gave you false hope of\nspider-man going to england and maybe continuing his adventure there.\nthe death of Gwen was a little to full on for my liking. following the\ndeath of Gwen makes the next spider-man film less exciting for me.<br><br>their relationship is a huge part to the spider-man films and now thats\ngone the films will never be the same. <br><br>apart from that i thought the acting was brilliant and spider-man/peter\nparker is played amazingly.\n"},
{"review": "\nThe movie presented the adventurous life of Peter Parker better known\nto us as Spiderman.Swinging between buildings, taking down criminals\nand saving the day, he is the hero every kid aspires to be. Though his\nlife seems so awesome, he faces his dilemma in his relationship with\nGwen Stacy. But his life takes a dark turn when his old friend Harry\nOsborn the sole heir of the Oscorp Industries returns back. Facing an\nincurable disease Harry requires the blood of the Spiderman, who could\nmutate the spider serum to cure Harry.Spiderman also faces Electro a\nnormal electrician who transforms after being bitten by mutated\nelectric eels having an inner grudge against Spiderman .Apart from his\npersonal relationship problems with Gwen and his guilt of not being\nable to help his best friend, Peter parker faces his past demons in\nunderstanding why his parents left him so suddenly without any\nexplanation.<br><br>The film has good CGI work with amazing 3D visuals.The storyline is\ngripping and fast paced keeping the audiences on the edge of their\nseats.Andrew Garfield brings life to the character of Peter Parker by\nportraying his eternal dilemmas and his difficulties living a double\nlife.Emma Stone is amazing as always in the role of Gwen Stacy,\nParker's love interest.The viewers though looking for action were also\nabsorbed in Peter's quest to find answers to his personal problems.The\nadrenaline filled, epic final fight sequences of Spiderman vs Electro\nand Green Goblin is one of the finest application of CGI and 3D effects\nmaking it a must go for all comic book and movie lovers. The fast paced\ncinematography and special effects made this one of the best movie of\nthe year winning a number of awards. Making its own mark in the\nsuperhero genre The Amazing Spiderman series may just give a strong\ncompetition to The Avengers series.\n"},
{"review": "\nThis movie is amazing! Acting is very fabulous and character were well\nportrayed by all the actors. And I must say that the ending is awesome.\nThe Amazing Spider-Man 2 is an enjoyable film for Spiderman's fan, or\njust someone who wants to see a fun and action movie. You will laugh,\nyou will get emotional, it has it all and at the right moment. The\nromance exceeds the action in the movie and it is a great blend of\naction and romance with comedy. The movie tells the story of\nSpiderman(Andrew Garfield) and Max(Jamie Foxx). Max is a person with\nfriends and nobody cares about him. He works at Oscorp(which is an\nelectricity generating company) as electrical engineer, which is also\nwhere Peter Parker's (Spiderman's) girlfriend Gwen Stacy(Emma Stone)\nworks. The CEO of Oscorp dies and Peter's old friend Harry Osborn(Dane\nDeHaan) who later on turn into Green Goblin becomes CEO of the Oscorp.\nHe finds out he has a disease which can only be cured by Spiderman's\nblood. Peter worries that using his blood may kill him. At the same\ntime, Max is involved in an accident, and turns him into Electro which\nis negative character in the movie. Max(Electro) wanted to be good\nperson and help the city but misunderstood himself due to his\nappearance. The first fight between Spiderman and Electro, which is a\nmemorable scene of the movie. To get the blood of Spiderman, Harry\nconvinced the Electro to come with him which is also turning part of\nthe movie. The design of Electro was not so good but green goblin was\nwell made. I recommend this film to anyone else looking for an action,\ncomedy and romantic film. To sum up, I think it is an overall excellent\nmovie and I give The Amazing Spiderman 2,Eight out of Ten.\n"},
{"review": "\nAs the title says, I thought this was a generally good movie, not Oscar\nquality, but entertaining. I walked out of this movie satisfied with\nall aspects of this movie except for one. <br><br>Throughout the movie max/electro is portrayed as a sympathetic villain\nthat you're supposed to feel bad for. We see his ideas stolen, his\naccident covered up, and then after the accident he is held and\nexperimented on. After all this, I felt genuinely bad for the\ncharacter, and was hoping for a Spider-Man 3-like ending in which the\nsympathetic villain is given redemption in the end (just to be clear I\nrecognize how terrible and ridiculous Spider-Man 3 was.) <br><br>However, in the end of this movie electro is killed without redemption,\nwhich, in my opinion made the whole \"sympathetic villain\" aspect of\nthis movie kinda redundant.<br><br>All that being said however, I did thoroughly enjoy this movie, and am\nlooking forward to future sequels. 9/10\n"},
{"review": "\nStrong movie, strong plot, excellent action, Andrew Garfield is an\namazing Peter Parker and a more amazing Spider-man with his jokes.\nStill, the villains' development is too much fast, with no persuasive\nreasons to take down the Spidey. Furthermore, my favorite scene it's\nthe one Peter fights Green Goblin on the tower, then try to saves Gwen\nby throwing the web, which in slow motion and forming a hand's shape\nwas completely amazing. Her death was sad, but epic, very well\ndeveloped and adequate. Also, the Rhino appearance in the end wasn't so\namazing, leaving curiosity for the next movie, and this is a fact that\nI don't like: the understanding that will have a next movie, even we\nknowing that will have.\n"},
{"review": "\nwell here it is the amazing spider man 2 sure I think they are too much\nspider man movies at least they are good and not bad and the actors\nwere good in this the best was harry Osbourne as he goes insane after\nhe discovers a family disease that killed his father and is after him\nand how could I forget Jamie Fox as the villain of the movie who spider\nman saves and names him then he becomes obsessed with spider man the\ngets in to an accident at work and becomes power after a fight that\nspider man wins he becomes depressed and abandoned and gets revenge on\nOscar meanwhile peter parker and Gwen Stacey and ends in tragedy all in\nall good\n"},
{"review": "\nI just came home from the cinemas right now and I just want to break it\nto you all, The Amazing Spider Man 2 is one of THE BEST movies!\ndirectors like Matt Webb and Neil Burger? Oh man you guys are great!!!\nI'm the worst movie critique so accept the fact that I love this movie!\nI was so disappointed with the first one and at first, I didn't want to\nwatch the second movie either. But after watching this movie, my, I'm\nbreathless...Consider my mind blown away! First of all, I love Andrew\nGarfield. I could feel him in his scenes... His words, his actions, his\nfeelings. They were so intense! I love Emma Stone! Aside from being the\nperfect girl for Andrew, I have to say, you're a great actress, Emma!\nThis film is quite different from other action-adventure movies...I\nhate movies with a bad guy, sometimes supernatural, and then the good\nguy comes out, whooping saves the day. THE END (just like the first\namazing spider man movie) But the second movie? Wow. Took me off guard,\nactually. It's centered on a normal guy turned extraordinary. It's\ncentered on THE GUY! and his life, his family, his decisions. I love\nthat. I never knew that could be applied to adventure movies. Overall,\nit's a big thumbs up for me. I love how Spider man is so cool and chill\nall the time! And the bits of comedy, suspense? love it! Though I don't\nquite agree with Gwen dying in the end, because she's actually what\nkeeps Peter alive, I accept the fact that things don't always go your\nway in reality. It's just so tragic that Gwen died. I feel so sorry for\nPeter. They were both perfect. Okay so that's it! I love Andrew, Emma\nand the others! Matt Webb! Feel great guys, I appreciate you talented\npeople! You should never change, feel good but keep humility. Must\nwatch! Great film!\n"},
{"review": "\nI thought this movie would be like a normal Spidey movie. But\nsurprisingly ,a unique movie.The movie has a great story never told\nbefore.Some people complain that the story doesn't make sense.But look\nthrough it carefully.It makes complete sense.Like the fact that the\nspider which bit Parker was made of his father's DNA ,gives us a\nscientific explanation of why did the spider bite work on him.<br><br>Talking about VFX ,the movie's effects are great,especially the Times\nSquare scene with Electro. And in the clock tower scene ,Green Goblin\nlooked very real,and Gwen falling to her death was another example of\nrealistic animation.<br><br>Overall, a great movie with a unique story.Hats off for Marc Webb and\nSony!\n"},
{"review": "\n\" . . . and washed this spider up.\" One pretty much expects Bond Girls\nto die. Every time Agent 007 gets hitched, his bride catches a bullet\nalmost before the wedding bouquet is tossed. But when a movie's heroes\nare perky high school kids, movie goers expect more longevity than that\nenjoyed by Bond Gals. It's depressing enough when teens turn out to\nhave their whole lives BEHIND them on Graduation Day in real life. Film\nescapism demands that trailers or previews must provide at least a\nkernel of truth-in-advertising. You expect teens to die in CARRIE,\nbecause the previews explicitly show that it's a horror flick. (Even\nHarry Potter's hapless \"Cedric Diggory\" character is a pretty minor\nplot sacrifice, thus no exception to this rule.) Teens are the number\none demographic for movie multiplexes, so responsible exhibitors should\nrefrain from biting the hand that feeds them. High schoolers also are\nthe most easily influenced film fans. Ever since the rash of suicides\nand suicides-by-cop inspired by the 1950s film REBEL WITHOUT A CAUSE,\nHollywood studios have made an implicit pact with parents NOT to\nblindside them with another wolf in sheep's clothing like REBEL.\nHowever, AMAZING SPIDERMAN 2 is in clear violation of this\nunderstanding. Therefore, it can be rated \"8\" for college kids, but\ndeserves a cautionary 4-out-of-10 for your impressionable high\nschoolers.\n"},
{"review": "\nThe Amazing Spider Man 2 continues the story of the franchise, as Peter\nParker (Andrew Garfield) continues to be the iconic marvel hero.\nAlthough promising to tear his relationship apart with Gwen Stacy (Emma\nStone) to her father, Peter and her continues to see each other, as\nSpider Man keeps being the hero of New York City. Meanwhile, a new\nvillain appears, Electro (Jamie Foxx) an ex-employee of Oscorp Corp.\naccidentally turned into a blue skinned person with electric powers,\nthat seeks revenge from Spider Man. At the same time another super\nvillain assembles, Green Goblin (Dane DeHaan), previously Harry Osborn,\nthe owner of Oscop Corp., that turned himself to overcome a\ndegenerative disease and also for defeating the protagonist.\nDifferently from the previous movie, The Amazing Spider Man 2 had more\nspecial effects, more complex action scenes and more differentiated\nsoundtrack, as Electro's electric powers requires this developments to\nbe better represented compared to Lizard's powers. Even being an\noutstanding movie, in a technical way, what contributed to this movie\nnot being as good as the first one in a general way was the fact of\nhaving two villains. In the limited time of two and a half hours was\nnot possible to both of these very differently characters have the\nnecessary development to the public understand or create some\nconnection with them. Most of the time some more detailed explanations\nwould be necessary, as for instance detailing more how the power of the\nvillain works, or how the studies of Richard Parker, Peter's deceased\nfather, were developed and connected to Spider-Man's fate or\nintroducing some flash backs of how Peter and Harry met and became\nfriends. Furthermore, Amazing Spider Man 2, even though not being\nanother master piece of Marvel productions, is an spectacular action\nand visual movie, enjoyable to the hole public, but just only if\ncharacter development or the plot quality is not your priority.\n"},
{"review": "\nHaving multiple villains was a good idea. And linking in with the\noriginal spider man films due to the special projects area. Such as\nprofessor Octopuses arms. <br><br>Most of the film focuses on Elector or Sparky according to spider man.\nThen near the end there is the green goblin(Harry Osborn)then at the\nend the guy in the rhino robot. Not seeing the end of the fight was a\ngood touch. <br><br>I expect that the next film will probably have like a documentary\nplaying on the TV showing spider mans previous saves. And maybe someone\ngetting close to spider mans identity. Since Gwen shouted \"Peter\" when\nshe was webbed to the police car.\n"},
{"review": "\nI went into this movie not knowing what to expect, only assuming the\ncommercials had been far to revealing. Anyways...safe to say that\nassumption wasn't very far off. Anyways, now to speak of this in a more\nrevealing light.<br><br>Fascinating visuals, wonderful eye opening colors. It felt almost like\na comic book jumping onto the page. The portrayal of Peter Parker and\nGwen Stacy were amazing. Needless to say there's a connection felt\nbetween them. However rocky it forms most of the movie though. this\nisn't much of a qualm, but it was one of the more enjoyable elements.\nNow, onto something a little distasteful. The villains as they were\ndeveloping had me hooked. Drawn into them (At least the ones shown\nmostly,only spoiler here). One character in this is shown to be around\nmore in the commercials, it was more an illusion. You hope for more and\nit comes up short. The villains when they fully descended failed to\nkeep what was making them enjoyable before the transition. <br><br>Anyways, I hope you find this insightful. Through less of a bias side\n(Love Spider-man). I'd give this movie around more of a 7, or 6.7, give\nor take between them. Go see it and see what you think, it's worth the\nticket.\n"},
{"review": "\nExcellent addition to the Spiderman lore. Great to see the additional\ndetails of being Peter Parker, and Spiderman. Loved hearing the\nsmartass Spidey as in the comics.<br><br>The continuation of the mayhem from Ozcorp looks amazing.<br><br>Well worth watching.<br><br>really.<br><br>Peace :) Oh, not new, now but weird add on at end.<br><br>What more can I say ...need 10 lines of text... It's Spidey so you\nalready know, and will nod as story flows along. Would like the film\ncompanies add cameos of all the other heroes that live in NYNY as\nSpidey works in city, regardless of contracts and film company\ncopyrights. We all know Spidey knows all the teams and solo heroes in\narea. So to one day seeing the Torch and Spidey talking on a roof, or\nDD knowing by his heartbeat as Pete shoots pictures.. be a true\nbeliever!\n"},
{"review": "\nThis movie was better than those with Toby Maguire, I mean, The Amazing\nSpiderman attach more to the original story of the comic book like\nGwen's death, it happens like that in the original comic book. But\nthere are things that I didn't like. If I made the movie I will make it\nthe most similar to the comic, even in those tiny things like the suit,\nor how the cast would look. But comparing this saga with the first one,\nthis is the best version. I really like the effects of the battle with\nElectro and the make up of the Green Goblin. When Gwen dies is very\nsad, It's very sad because you are able to get in the skin of Peter in\nthat moment, more if you have a girlfriend or you're in love or\nsomething. I recommend this to everyone, but kids with 4 years old\nshould not see it because it has violence that should have saw kids\nwith 6 years old or more. I hope that the part 3 will get better.\n"},
{"review": "\nI really don't understand the hatred this movie gets. Let me start out\nby saying that I'm not really a Spiderman fan. My experience of Spidey\ncame from the awesome PS1 Spiderman games, the 1994 Spiderman animated\nseries and the Raimi movies. With that being said, Rise of Electro is\none of the best superhero movies I've ever seen. I'd put it up there\nwith Winter Soldier, the First Avenger, Blade and even the Raimi\nSpider-Man films.<br><br>Andrew Garfield does a pretty good performance as Spidey, balancing\nemotion with excellent comedic timing. Emma Stone is wonderful as Gwen\nStacy. Jamie Foxx is an excellent and quite sympathetic villain, even\nif he is pushed to the sidelines a little by Harry Osborn. The movie\nactually makes you care for all the characters, even Harry Osborn. And\nI'd be lying if I said Gwen's death didn't knock me on my ass, because\nof how shockingly gruesome it is for a PG-13 movie and because I\nwould've thought they'd let her live.<br><br>I really liked what they did with the source material, updating\nconcepts like The Rhino and Electro without taking out too much. Plus,\nI genuinely feel that this movie pulls off the 'hero rises from the\nashes' storyline much better than Dark Knight Rises.<br><br>Is it perfect? No. But is it a good superhero movie? Hell yeah, it is.\n"},
{"review": "\nAn extremely good film. You don't have to be someone who is a die hard\ncomic book fan to like this. I wasn't expecting what I got in this\nfilm. It was spectacular. I wasn't expecting it to be this good. Great\nand emotional plot, excellent soundtrack ( The Neighborhood song,\n\"Honest\" was epic!), exceptional acting ( Dane DeHaan, one of which to\npoint out) and awesome directing (Marc Webb *thumbs up*).<br><br>Way better than the first one. The movie seems more modern than Sam\nRaimi's versions. Some points in time, my heart was beating extremely\nfast due to the actors' dialogues. The Visual Effects editors, thumbs\nup to you all as well. Not much of a fan of 3-D but it was great. The\nfirst movie didn't really get me excited for this one. I went with my\nyounger brothers to watch it.I don't regret watching it. People of all\nages would enjoy this movie.<br><br>Jaime Foxx's portrayal of Electro is also one to point out. It made me\nfeel sad and pitiful towards his character. Andrew Garfield, to me,\nseems like he was born for his role. !SPOILER! He acting was top of the\nline when he was acting depressed towards Gwen Stacey's death.<br><br>I would recommend watching this film anytime you want. I would honestly\nbuy another ticket to watch the movie again. It was that good.<br><br>I rate this movie 8.4 in my book, because at certain points (very few),\nI felt a little bored but other than that, The movie is amazing. I can\nsee why they call it The AMAZING Spiderman. *Ba dumb tss*\n"},
{"review": "\nI really like spiderman as a series, and I think Andrew Garfield does\ntake on this more gloomy and dark version of spidey/peter parker, it\nworks quite well and I hope that they make many more in the series.<br><br>Very nice action packed movie, if you haven't seen it or know what is\ncoming in it, maybe you should not read on **spoiler alert**.<br><br>I am not a big fan of these villains or heroes for that matter that\ngets weird powers that is not at all plausible, spiderman well yes\nmaybe a mutated spider could bit and transfer powers, that is okay for\nme, but Electro come on, he should have died in that fish tank and not\nbecome this electrical super freak evil bad guy. Give me the two other\nevil enemies at the end, Dane DeHaan really fits his part both as Harry\nOsborne, but also as the Goblin it is really good. The Rhino that we\nbriefly see in the end is really fitting in my universe of spiderman\nand the evil fiends he has to battle, so for my sake those are the one\nthey should go for.<br><br>Really good and action packed, maybe a bit to long, but it keeps you\nentertained all the way.\n"},
{"review": "\nLet me start off by saying I'm a huge Marvel/Graphic Novels/DC both\ncomics and films. The thing is, many of the films falls short for real\nfans of heroes, be it because the actor was poorly chosen (the blatant\ncase of Tobey Maguire as Peter Parker). AWFUL! Hugh Jackman is a GOOD\nWolverine for instance and Brandon Routh was a pretty Good as C.K.,\nhaving big shoes to fill! Andrew Garfield looked a little strange in\nthese two films he starred, but only for the first five minutes, which\nare usually filled with «woo- hoos» and an action scene to\n«re-introduce us» to Spidey (as if we need to be reminded of who he is,\nlol). So OK, we get a «happy-go-lucky Speder-Man and a somewhat\nair-headed Parker. But this is just for these five minutes, until one\ngets used to the character. Passed that, he is a pretty convincing\nP.P., throughout the movie, and adds a certain depth that was\nneeded.Good work there! The villain (main) is a fairly good choice, and\nthere's a vast choice within Spider's foes in the comics to make pretty\ngood movies. This is by far the best Spider-Man of all so far, and I'm\nnot even a fan! And to conclude, I think that as far as a Superhero\nmovie goes, it's very well directed, not «crazy-cams» like in\nTransformers, where you don't even keep up with who's fighting who! All\nin all, 8/10.\n"},
{"review": "\nAs a fan of Marvel, Spider-Man is one of their best in my opinion. The\ncomics are great, the film adaptations, however, I'm not that fond of.\nSpider-Man was just OK, Spider-Man 2 was flawless, Spider-Man 3 was\nreally bad, and The Amazing Spider-Man was good, but not memorable. I\nwalked in the theater with semi-high expectations, because I read some\nreviews and was skeptical about it. However, it was actually fantastic,\nand is definitely going in the best Marvel movies ever made. I was\nsurprised by the performances of Dane DeHaan(Green Goblin), and Andrew\nGarfield(Spider-Man), both fitting their roles very well.The special\neffects are spectacular and imaginative, particularly the web-slinging\nscenes and Electro's skin. I have an issue with Paul Giamatti's\nperformance as Aleskei Systevech/Rhino and the Sony marketing, but TAS2\nis still very awesome and underrated. Even my mom enjoyed it, who\ndoesn't like Spider-Man! Surprisingly, there was applause at the end,\nso the audience must have liked it.\n"},
{"review": "\nThe Amazing Spider-Man 2 is more of the emotional side of Spider-\nMan/Peter Parker as he is trying to figure what he wants with Gwen,\nwhat to do with Harry, etc. We also see a lot of things we haven't seen\nin previous Spider-Man films(although very small) like him repairing\nhis web shooters or him washing his suit. Although they are very small\nthings it gives us the feel of what we love so much about Spidey, he is\njust an ordinary person ,who deals with financial struggles and\nheartache,not just a superhero. <br><br>However what let this movie down is what the other character\ndevelopment. We learn more about what makes Harry Osborne/Green Goblin\nangry and hating Spider-Man than we do Electro,who is the main villain\nof the movie. Every actor portrayed their characters perfectly but was\nlet down by a script that wasn't to thought out.\n"},
{"review": "\nI don't know what's wrong with all these people. This was the best\nmovie in the franchise. How can you claim that the swinging scenes were\nnot breathtaking? How can you claim that the costume was not perfect?\nThe most important, how can you deny that it was a spectacular film?\nWith especially its Times Square battle and Peter Parker, I think this\nmovie was nearly flawless. <br><br>If we talk about Rhino problem, I believe it was the best ending that\ncould have ever been made. Guys, don't be afraid, Rhino is not over\nyet. I think the next movie will start with Spiderman fighting with\nRhino. <br><br>And I also think Sony should keep on making swinging scenes like these,\nin the future. They were awesome.\n"},
{"review": "\n17 April 2014 Film of Choice at The Plaza, Dorchester Tonight - The\nAmazing Spider-Man 2 (3D) - Marvellous Marvel does it again. If nothing\nelse a Marvel film is entertaining, but this film was definitely better\nthan just entertaining. A mix of superhero, ordinary folk, internal\nstruggles and battles against the bad guys, this film also had quite a\nfew laugh out loud moments too. One of the most telling story lines yet\nthis episode deals with the internal struggles that Peter Parker goes\nthrough to balance his everyday life, with family, love of his girl and\nhis obligation to save the general population. I know as the audience\nwe are privy to all the secrets on the good side and the bad side, but\nit never ceases to amaze me that the person closest to him, his Aunt\nMay, has never discovered the spider suit which is just sitting in a\nheap in his closet, open your eyes lady, the guy you raised from a\nsmall boy is one of the coolest super heroes around. I quite like\nAndrew Garfield as Spider Man, he balances his fun side with the angst\nneeded to capture this story line to perfection. 3D gets better and\nbetter by the way!!!!\n"},
{"review": "\nI watched a lot of superhero movies and this one is in my top 3 along\nwith The Dark Knight and The Dark Knight Rises. I see all the bad\nreviews saying bad things about spidey, about Andrew Garfield and\ncomparing this to Twillight. I really do not get those people. Let me\ntell you why.<br><br>Firstly because Andrew Garfield fits perfectly for the role of Peter\nParker and also does Emma Stone for Gwen Stacy. A real, honest love\nbetween these two characters. It is so powerful that I felt it when\nthey look at each other, talk to each other and in every other romantic\nscene. I know you expect a great superhero movie with a lot of action,\nwith a good villain but this movie is something more than just a\nsuperhero movie. This is a really great romance that in the end it\nalmost made me cry. <br><br>Another thing about this movie is that I really like the villain and\nJamie Foxx was really good at being Electro. Not much action and\nbattles between spiderman and Electro but that is what makes this\nsuperhero movie so special.<br><br>And the last thing may contain a little spoiler(do not read it if you\nwant to watch the movie for the 1st time). It has an really amazing\ntwist at the very end when Gwen dies and like I said it almost made me\ncry. So I can not wait for the 3rd movie of this trilogy.\n"},
{"review": "\nWhen I saw this movie I had very high expectations due to enjoying its\npredessesor. It surpassed them when I saw this on opening night. The\ntwo main villain arcs are very well done as are all the characters.\nThey are engaging and are what the directors clearly wanted to drive\nthis movie. That and the tense action sequences impressed me greatly.\nPeople say this is has too many subplots and here is the thing, the\nspiderman comic books are all driven by subplots with one huge plot\nhiding in the shadows and this film makes me excited for the sequels\ndue to its pitch perfect storytelling and perfect performances. I saw\nspiderman from the comics not people dressing up for halloween.\n"},
{"review": "\nThe original trilogy seemed incomplete but now, that incompleteness is\ncompleted by this new one. I love the background story of Spiderman\nshown in this movie, at least it has got one unlike the original. The\nstory of how Peter Parker ended up with his Uncle and Aunt, the story\nof why \"Peter Parker\" is the only one who could be Spiderman and no-one\nelse. It all feels complete now. A satisfactory plot for a superhero\nmovie.<br><br>Talking about the performances, I like the new Peter Parker, humorous\nand entertainer. I've started to feel the original 'Peter Parker' was\nactually boring. Really good job by the actors here. And with that\nSuperVillian : 'Electro', the movie becomes one of the best SuperHero\nmovies. Visual effects are quite good and the movie is perfectly\nentertaining. For me, this is the best version of Spiderman movie till\nnow. I don't care what the critics have to say, this movie is a good\none.\n"},
{"review": "\nBased on the first movie, i thought this was going to be just another\npoor Marvel movie, seeking younger audiences.<br><br>But i was surprised! I really enjoyed the movie, the characters are\nwell crafted, it has good action scenes, and some unexpected moments\nthat makes the movie worth watching. <br><br>I enjoyed a few laughs, and I think the protagonists are better than\nthe prequel.<br><br>I really like electro, Jamie Foxx can always do a good part, and this\nfilm is no exception. I'm glad since I can't imagine anyone else doing\nit so well.<br><br>Hope the next one will be even better than this,<br><br>Go see it, and enjoy!\n"},
{"review": "\nFor starters, let me say that this is not a perfect movie. The first\nact is rushed, and the plot loosens as the movie progresses. But this\nis what comic book movies should be like. Fun, action-packed, and\nbelievable performances are what make this movie good. It is not trying\nto be The Dark Knight, which I enjoyed. There are a few darker moments,\nbut the overall feel of the movie is light and fun. That tone is\nperfect for Spidey movies, and that is where I think Sam Raimi went\nwrong with his Spider-Man trilogy. He wanted to make a good film, not a\ngood Spider-Man film. Mark Webb is making good Spider-Man films, so\ncritics are not liking it because they view it the same as they would\nShawshank Redemption. And fans aren't on board because they want all\nsuperhero movies to be \"darker\". Ask Man Of Steel how that worked out.\nSo just sit back and enjoy a fun ride with beautiful visuals and\noutstanding acting.\n"},
{"review": "\nI was not excited about this movie at all. The trailers looked bloated\nwith CGI action and it reminded me of spider-man 3,with the overuse of\nvillains,and Dane DeHaan as the green goblin? That looked ridiculous. I\nthink its safe to say that this movie was one of the most surprising\nmovies I've seen in a while. It started out a bit cartoonish,but in a\ngood way,it felt like spider-man. They balanced out the 3 villains\nreally well and you believed Jamie,Dane and Paul as the villains they\nportray. Andrew Garfield absolutely owns the roll of spider-man,as we\ncould already tell back in 2012 with the first movie. Emma stone is\nstill killing it as Gwen Stacey and you really end up caring for their\nrelationship. This movie takes a lot from the Amazing Spider-man issues\n#120 and #121,so if you've read those devastating comic books you know\nabout the chilling end one of the main characters will face. In\nconclusion,the only people who wont enjoy this movie are either\nAnti-superhero tight-asses or people who generally hate fun. Enjoy.\n"},
{"review": "\nSo soon after Tobey Maguire's Spiderman Trilogy, the decision to reboot\nthe franchise may have been seen as bizarre to some. However, the first\nin this new series, Amazing Spider-Man, was thoroughly entertaining,\nand this second instalment has similarly impressed. In the film,\nSpider-Man has to deal with new enemies including Electro and the Green\nGoblin, as well as Rhino. The action scenes were refreshingly good and,\nalthough there were too many romantic scenes for my liking, which in\nturn made the movie slightly too long, they were humorous at times -\nthroughout the movie, there were scenes which triggered a few laughs\nfrom the audience which lightened up the production. Having said that,\nI don't think that it was as dark as the first instalment. All in all,\na film worth seeing.\n"},
{"review": "\nWhen I watched the trailer my expectations is much higher but after I\nwatch the movie it didn't satisfy my all expectations. Of course it\ncan't satisfy everybody's all expectations at the same time. <br><br>The film is generally very good. In the way of Electro's creation is\nvery good, Green Goblin could be better. Harry did very less research\nabout secret projects it didn't mention there it can heal the body.\nAlso spider venom effect Harry very fast. It start to effect Peter in a\nday or less but effect Harry like 10 seconds. Also slow motions are\nperfect and it happened the time it should be. Fight with Electro and\nspecial effects were very good. It is good to see what happened to\nPeter's family. Gwen's death was shocked me. I don't understand how she\ndie. Is her back broken or is she hit the ground before Peter catch\nher. Anyway ın my opinion she shouldn't be dead in this movie maybe she\ncan die in next movie or in the next movie she can go somewhere else\nand leave Peter. If it is go like that next movie Aunt May is going to\ndie. Comedy is good somewhere but somewhere it is unnecessary. Rhino's\ntype is little different maybe because I saw it only in Spider-Man\ncartoon. End credit scene could be about next Spider-Man movie.It was\nunnecessary to add a scene about X-men. <br><br>There are minuses but the pluses is more than that I suggest anyone to\nsee that film and it is far better than first movie.\n"},
{"review": "\nI was really surprised after watching this movie! Not only was the VFX\nextremely good, but the plot was also awesome and detailed. They show\nyou that; spiderman is a human, he can't save everyone, without making\nenemies. Everyone was good in this movie, even police officers were\ngood in this movie. I feel that Marc Webb (the director) has learned\nfrom his mistakes, no more wannabe spidey, no more trying to funny! And\nfinally, finally, we learn more about his parents. The story is\nrealistic, if you think about it in a superhero movie perspective. They\nshow you the sad part of spiderman's story, they show you the phycology\nof spidey and almost all the enemies. The vfx are really impressing\ntoo, I even think there could might be a Oscar nomination for it.<br><br>The ending was too fast though, they had the chance to stop it at the\nright time. But instead they overworked it. There were some parts of\nthe movie, where they tried to be funny, even though it wasn't.... But\nall and all, the movie was awesome and epic. AWESOME MOVIE, AWESOME\nDAY. Strong 8/10\n"},
{"review": "\nFirst off, I'd like to say that I really did not like the first Amazing\nSpider-Man, so my expectations were really low coming in to part 2. I\nwas pleasantly surprised by it though. This movie has action, comedy\nand drama in a perfect balance. I was worried that there would be too\nmany bad guys in this movie, but they did it just right. If I had one\ncomplaint, it would be that Harry Osborne's transition to the Green\nGoblin could have been done differently, it felt a bit rushed to me,\nbut the rest of the movie makes up for it. Another highlight for me was\nthe soundtrack and score of the movie. The music when Electro is in\nTimes Square is amazingly well done.<br><br>Overall I liked this movie a lot because it really felt like the\nSpider-Man I knew from the comics. <br><br>There was a mid credits scene of the X-Men: Days of Future Past movie,\nbut I really didn't like that scene.\n"},
{"review": "\nI personally thought this was an excellent film. It had a good amount\nof comedy, truly deep emotions, and brilliant action. A great, cohesive\nfilm to lead on from the first one.<br><br>The relationship between the two main characters are brilliant, and you\ncan really understand what's going on between them as both actors\nportray their characters very well.<br><br>Also, what I like from these movies are that they are more relative to\nthe Spider-man comic books, compared to the Spider-man Trilogy (and\nlet's be honest, they were terrible.) If you have read the comic books,\nthen you'll understand where I'm coming from when you see this movie.<br><br>The only downside/s I feel this movie has is that Jamie Foxx, in my\nopinion, doesn't really fit his character and I felt that he didn't\nreally have a massive say in the whole film, it was more about the\nother villain - but what I did like is that having two villains didn't\nmake it feel like there was too much going on; it was very\nunderstandable and a pleasurable viewing experience, so the director\nreceives points in my book for his story telling.<br><br>This review is really brief as I don't want to sway your opinion on the\nfilm before you've watched it, but rather to change your opinion on\nwhether you should watch it, and I believe that you definitely should.\n"},
{"review": "\nBeing not a fan of the spiderman movies - for me aimed at at kids and\nteenagers of which i am not - I found this movie to be a bit of an\nunexpected treat.<br><br>Viewed it last night at a 3d preview in edinburgh and what i worried\nmight be a bum numbing 2 and a half hours actually flew by.<br><br>Don't want to give any spoilers or ruin any story but the whole pace of\nthis film is much tighter than previous efforts and the tone can be\nquite dark at times. There is of course love interest but this added to\nthe story and I actually bought into it and found myself caring for the\ncharacters, no mean feat for a cynic like me. Thankfully it didn't come\nacross all teen/twilighty which seems to be the norm these days.<br><br>The villains are very good, Dane DeHaan in particular is exceptional\n(is it me or does he remind you of a young Leo di Caprio?) and gives a\nfantastically unnerving performance - big things beckon for him no\nmistake.<br><br>If you liked the previous Spiderman movies you'll still love this, If\nyou didn't put any misgivings aside and give it a whirl (as i did).\nEither way definitely go and see this film, words I never thought I'd\nutter about a Spiderman movie. You Won't be disappointed.<br><br>As I said - no plot details and no spoilers, just an honest opinion of\nmy film experience.\n"},
{"review": "\nOnce again a good example about movie that critics don't like, but I\nenjoy to watch. Of course this isn't greatest movie of history, but as\na comic book filming it is very entertaining. Spider-Man's leaps\nbetween skyscrapers are beautiful to watch especially in 3D experience\nis like sitting on a roller coaster. Andrew Garfield is great as a\nSpider-Man, Emma Stone succeed well as Spider-Man's girl friend despite\nthe tragical end. Sally Field is always great actress. Only Jamie Foxx\ndon't convince in his role as a nerd. Luckily he act nerd only half of\nthe film and the rest of the movie he is digitally enhanced Electro.\nStory is entertaining and pretentious comic book adaption and that is\nthe way it should been watch. Albeit the dialogue is quite childish at\ntime to time it doesn't bother too much. Lots of popcorn and enough of\nsoda is all you need to enjoy this movie. If you want to say something\nbad about the movie you could say it has been inflate to so big that it\nwill be a hard to surpass on next movie. Movies massive budget (200\nmillion dollars) is hard to cross over. On the other hand if movie\nmakes enough profit as theatrical release couple of more millions\nshould not be any infeasible to approve.<br><br>http://tinovalkki.blogaaja.fi/\n"},
{"review": "\nOne of the harshest critics of this movie said that \"nearly everything\nexists only to advance the plot.\" I found myself wondering what he\nthinks should have filled that time instead. The movie did cover a lot\nof territory, so it was necessary to spend less time on some things\nthan others in order not to be overly long.<br><br>I found this movie immensely entertaining and often truly humorous,\nespecially Peter Parker's dialog which was in my opinion very well\nwritten and well acted.<br><br>I feel that only the most jaded and demanding of critics would be hard\non this movie, and only because virtually nothing would be good enough\nfor their personal standards of perfection. For everyone else, this is\na very good movie, my favorite so far of the Spider-Man movies.\n"},
{"review": "\nI don't know why there are so much hate out there for this movie and\nwhy critics are not appreciating this movie as much the other spiderman\nmovies. I personally and most of my friends think, this is by far the\nbest Spiderman movie out there in the whole spiderman universe. The\nCharacter of Peter Parker is spot on. He's smart, witty and funny all\nat the same time. The romance between Peter and Gwen was spot on too. I\nloved all the action sequences in the movie. It is a fun ride. Its not\na cry baby spiderman movie like the ones we have with the Toby McGuire\nseries. I watched this movie twice the very same day and I felt the\nnostalgia of being a kid again watching a very uplifting superhero. All\nin all this movie deserves a far better rating and the industry should\nhold on from introducing another remake here. Let me and the audiences\nsink in with this one before we talk about the next.\n"},
{"review": "\nA very entertaining and gripping mix between \"funny comic book\nsuperhero\" portrayal and heartwarming, serious emotions. This is by far\nthe best Spiderman movie of the five. <br><br>Right from the start you begin to realize how in this movie the action\nscenes are not executed in a dead-serious end of the world manner like\nthe previous spider-man movies, which made me feel more connected to\nthis movie than the others. This is how spider-man should have always\nbeen portrayed, unlike superman or batman. Andrew Garfield delivers the\nrole in a very balanced and well done manner yet again. He had the\nchance to dive deeper into the role in this movie compared to the\nprevious one. The chemistry between him and Emma stone on screen is one\nof the best aspects of this movie.<br><br>Another thing I enjoyed about this movie were the villains, which\nsurprisingly everyone seemed to dislike. The characters in the movie\nweren't too much in any way, certainly not as much as in the previous\nSpiderman 3.<br><br>Even tho the movie didn't feel like it was something completely new,\nand doesn't seem to pull off something unexpected or revolutionary (In\nregards to film making, not Spiderman story-wise) I still felt like it\nwas one of the most engaging and entertaining movies I have seen in a\nlong time\n"},
{"review": "\nSpider-man comics and movies aren't just about the hero, but they are\nabout the daily struggles that Peter Parker must confront and balance.\nIn the 2nd Amazing Spider-Man film, Andrew Garfield is back at his game\nat being that Spider-man who is cocky, ignorant, and full of humor, but\nyet I am pleased to say that he still has that brilliance to make you\nfall into the shoes of Peter Parker and make you feel like you are\nstill keeping things together as the world is falling apart around you.<br><br>When watching this film you will experience an emotional roller coaster\nthat will have you hoping for the best to come out! Kudos to Marc Webb\nfor balancing the villains and supplying the audience with just enough\nbackground story to understand their history AND for keeping that rich\nlove story between Peter &amp; Gwen.\n"},
{"review": "\nall of you are being way to critical of a super hero movie. I have been\na Spiderman fan all my life and this reboot is like watching my\nimagination as a child come to life. try to imagine this from the eyes\nof a kid. to them its not a story that is obvious they haven't seen\neverything before its a comic book come to life with a great portrayal\nof a child hood hero.<br><br>I think Andrew Garfield and Emma Stone both played their roles\nexcellently. It had all of the great Spiderman wit and humor. Its\neverything you could want in a Spiderman movie. through the power of\ncomputers we can now see our imaginations become reality. embrace these\nmovies for what they are quit looking at them through such jaded lenses\n"},
{"review": "\nThis film is getting too much hate by some people and too much love by\nothers (including me), and it seems to be only based on the mental\nimage each group has of spider-man and movie scripts in general.<br><br>Those who love the soup opera aspects of Peter Park, hated, they missed\nthe character grow, the motives of the villains (arguable) and\ncomplained for having too many story lines. On the other hand those who\nlove comic spidey, loved, for all the stupid puns, the charisma and the\nof course the action. But the main complain is about the script, but\nunderstanding as a comic adaptation, it makes sense, the several\nsub-plots going on between each fight,the preface and Peter\nParker/Spider-Man parallels objectives, it makes just like a regular\ncomic (weekly or monthly) and less like a regular movie.<br><br>But What can I say, I was expecting to see the real (mental image,\nagain) Spider-Man on screen, the costume is really (a lot of emphasis\nhere) beautiful, Andrew Garfield really is in the character, Emma Stone\nmakes an active love interest, Dane DeHaan makes a 'realistic' Green\nGoblin and Paul Giamatti goes a over-the-top, more related to an usual\nSpider-Man Villain. The only big flaw is Jamie Foxx getting the\nspotlight just because Django, the character is lost in the movie,\nhalf-way between fun villain and real threat, shame because he is the\nmain villain.<br><br>Marc Webb got me, I'm gonna be the first in line for: The Amazing\nSpider-Man 3, Venom-Carnage, Sinister Six, maybe Spider-Woman (not\nconfirmed yet), or any other release of a fun comic adaptation.\n"},
{"review": "\nForget the actual story, almost everything about it, then you might\nlike this. This film doesn't use just some humor to amuse watchers, its\ndamn lot more.<br><br>I don't surely like this thing changing the original story with all\nMarvel things but hey, its great entertaining very well made movie?\nLittle cheesy at times but I didn't got bothered. Nice directing and\ncgi, actors weren't bad at all, all it was that little thing that I\nwould like to call something like \"do not push every stuff in one\nmovie\". Anyway it somehow worked well. First I rated this 6/10 after\nseeing some low-level version, it probably had missing parts and all.\nWhen I now watched c001 bluray-version it was totally different.<br><br>Even if you don't bare these mainstream films much like I don't, it was\nexcellent movie.<br><br>Ending was little weird and all but so they are all :) 8/10 Terrific\njob!\n"},
{"review": "\nI was a guy who like the first film and i was thinking the same with\nthis one, and this one is far better than the first one. It's actually\ncome out a pretty good movie. Please don't listen the critics otherwise\nyou will miss why Spider-man is Amazing. If you are going into this\nexpecting a Dark Knight or an Avengers or any other movie, this isn't\nfor you. Spider-Man is a fun character and this movie is like a comic\nbook come to life. Certainly I am not saying that this movie is 100%\nperfect. There are some things about this movie which can be questioned\nbut after watching i can say i really want to believe in superheroes. A\ngreat mix of action, humor, love and pure fun. From the story about\nPeter's father, over to aunt May and the love to Stacy - everything\nfitted so well together. End is little sad I was heart broken It killed\nme inside. If you're a fan of any characters in spider man, I suggest\nyou prepare yourself mentally before watching this film, because you\nreally should watch this film.\n"},
{"review": "\nGreetings from Lithuania.<br><br>\"The Amazing Spider-Man 2\" (2014) in my opinion is the best Spider Man\nmovie yet, and i enjoyed it much more than any of the Marvel studios\ncreated movies yet (though i haven't see \"Guardians of the Galaxy 2014\"\nyet) - you can already start throwing rocks at me. <br><br>Why is it so good?<br><br>At 2:20 h. running time i was captivated from first till last second.\nYe, it was a bit cheesy at the end in the street fight with the kid\nstepping in, but overall, it's a hell of a entertainment. Great special\neffects sequences, absolutely marvelous chemistry between two leads\nAndrew Garfield and Emma Stone, and very captivating plot - it's all\nworks. Althrough the sequence in which J.Foxx becomes a villain (no\nspoilers here) was kinda lame, he was a cool villain. And what an\nending! <br><br>Bottom line. As i see here at IMDb that there are many who disliked the\nfilm, here is the last nail in my review - i will wait for 3rd\ninstallment of this franchise much more that i will wait for a sequel\nto any Marvel movie that i have seen yet - it is superb entertainment.\n"},
{"review": "\nIt's OK, and awesome special effects by the way, i just thought that\nthis spidey movie can be added so much more thrilling stories and can\nalmost attract anyone to see it but the continuous scenes are just same\nold same old.<br><br>Although the one i really liked is the story between peter parker &amp;\ngwen stacy's relationship, it gives the film more dramatic every time\nthey meet and i think this really pushed the movie to a love\nstory...Andrew Garfield is as good as Tobey Maguire, above all the\nacting is great.<br><br>I give this film an 8.1! :)\n"},
{"review": "\nReview of the much anticipated The Amazing Spider-Man 2 , this movie\nliterally puts \"Amazing\" in the franchise tittle, best use of 3d tech.\nand to my surprise a great quality of VFX &amp; CGI effects in the movie,\nfinally!!! And the camera work was par excellence it's brilliant, the\nelements of the movie are perfectly timed be it comedy, action, drama\nwhatever it was like spot on. Yeah I agree the movie goes a little slow\nat some point in the 2nd half but its still worth watching, definitely!\nThe background music is pretty dope, brilliant characterization &amp;\nperformances by Emmastone &amp; Andrewgarfield, what an actor he is, his\nperformance is awesome especially in the climax scenes. You know what I\nlove most about Spider-Man? Everything. God I'm unbelievably hyped for\nthis movie....\n"},
{"review": "\nThe movie was one of the best Spider-man movies that I have every seen.\nThe special/visual effects were amazing. The chemistry between the main\ncast was very good. Particularly the relationship with Gwen and Peter.\nThe movie sometimes would have moments in which you knew Sony\nexecutives put there noses into like the plane scene. Also there was a\nlot of set up for the Sinister Six movie. Andrew Garfield is the best\nas Peter Parker. Sony should not change him. Mark Webb should have\nadded more first person scenes as seen in the The Amazing Spider-man\nTrailer and movie. Anybody who is a Spider-Man fan or loves to watch\naction, adventure or comedy films should check this out. 5/5\n"},
{"review": "\nI liked very much the movie.One of the best of Spider. The action was\nvery good and the comedy were so well placed. I knew this movie will be\na 10 stars movie , from the others.. But this had something more. The\neffect are so brilliant, and the movie was kind of complicated\nsometimes(the story of Peter's dad). However the ending was sad and I\ncan't understand how that could happened... I was so disappointed. I\ncouldn't believe it. In the end I want to say that the drama was very\nhigh. Good job , and I am waiting for the next Spider-Man. P.S. I\nreally liked the relationship between Gwen and Peter, I hope that \"the\nnew Spider-Man\" will be as romantic as this one.\n"},
{"review": "\nSuperheroes are heroic because they feel a moral obligation to help the\naverage Joe. Not this Spider-Man. All the characters struggle against\nthe system that has perpetuated falsehoods. The main characteristic of\nthe film is the gloomy atmosphere, emphasizing the desolate\nhopelessness. The cinematography is stark and bare, with only the\nsoundtrack adding some effect. The acting is very effective. From an\nartistic standpoint, there were some plot elements and character\ndevelopments I didn't think were totally needed. They do however drive\nthe story, which seemed to be their purpose, so I can accept them. But\nit's a two-hour pile of destructive self-obsession.\n"},
{"review": "\nAs a huge fan of the original Spiderman trilogy with Tobey Maguire I\nremember watching the reboot with Andrew Garfield and being far from\nimpressed. I wished they never rebooted and just continued with Maguire\nunder the suit.<br><br>But TASM:2 opens up with a universe far more dense than the reboot let\non in the first movie. The second attempt gets finally seems to get\nthings right with Spiderman's style and attitude - true to the comic.\nAnother thing worth noting is that his suit is now more believable\nconsidering you can see it ripple in the wind as he swings along the\ncity; a vast improvement from the obvious CGI with Tobey Maquire.\nGarfield also seems to have beefed up this time around (definitely\nneeded to enable him to portray someone capable of throwing a punch!).<br><br>The movie runs quite long and they cram a lot into it - this has been\ncriticised by a few but is something I rather enjoyed. If you ever\nwatched the cartoon series you will enjoy this movie.\n"},
{"review": "\nWhether you have watched previous Spider-Man movies or not, there are\ntons of potential and spectacular elements where you won't be able to\nsee in Marvel counterparts in this film.<br><br>What easily makes me say such a bias statement? The director and the\nteam know how to deliver fantastic and thrilling camera angles to\nshowcase flexible, fast-paced, and detailed web techniques that Spider-\nMan used when going through oodles of hazardous obstacles to protect\ncitizens in New York while naturally executing chores and roles as an\nordinary guy. If that does not live up to your expectations, get ready\nto giggle at some of the jokes along with mischievous antics.<br><br>The super-villain, the blue-neon bodied nerd, Electro, is an\nelectrifying and unique character to be seen. Jamie Foxx does his part\nas an actor and villain for the first time. The one-on-one battle that\ninvolves elemental moves and scientific tactics is the highlight of the\nmovie. Although the plot get vaguely wrapped around between Electro and\nthe Oscorp, it is still interesting to watch the character development. <br><br>So what takes 2 stars away from me? It would be the complicated bonds\nbetween a young couple, Peter and Gwen, who just can't make up their\nmind by being hesitant, especially in the middle of the movie. I mean,\nit is normal for any couples to experience erratic emotions, but the\nwhole romance definitely can be succinct to intensify other aspects.<br><br>Despite a number of downsides, I would still strongly recommend this to\nanyone who is itching to watch a different type of feisty film. Because\nno movies can offer such a sticky, nifty, and vigorous action like \"The\nAmazing Spider-Man 2.\" Yes, it is as good as the first one, or like\nothers say, it is better.\n"},
{"review": "\nWith much speculation about the success of this film, it surprisingly,\nyet thankfully, lived up to the billing! With expectation high despite\nthe seemingly mediocre Amazing Spiderman it seemed impractical and\nimplausible to believe this film would be any different. Yet with\npromises of a better script and storyline, it seemed as if the series\nwas about to live up to its initially thought potential. This was\nalready hyped up more so by the pretext of a more intricate storyline\nwhich was implied by the previous film's ending. So it proved. The\nstoryline was better, and the bonus of empathy with villains really did\nnot hurt its compelling case. All in all, a film that delivered what it\npromised...\n"},
{"review": "\nI've heard a lot of bad things about this movie and I'm not sure why. I\njust watched the movie last night, and i must say, it was great! I mean\nsure, Spiderman jokes more than enough this time around and the drama\nseems to take up most of the movie, but that's a lot how the comic book\nwas as well. I think the story was very progressive this time and there\nwere moments where I honestly felt like hugging the person sitting next\nto me while watching Peter and Gwen go through their love life. The\nspecial effects and camera angles were very neatly put together and I\nthought the action was pretty amazing too... no pun intended. Overall,\nit was a fun film to watch, it had its laughs, possibly a few tears,\nand an interesting storyline. If you have a love for superheroes, don't\nwait any longer to watch this film. I honestly enjoyed it very much.\n"},
{"review": "\nWatched The Amazing Spider-Man 2 with Andrew Garfield(The Social\nNetwork) as Peter Parker/Spider-man, The Lovely Emma Stone(Easy A) as\nGwen Stacy ,Martin Sheen(The Departed) as Ben Parker,Sally Field\n(Lincoln) as Aunt May ,Dane Dehaan(Chronicle) as Harry Osborn, Denis\nLeary(Ice Age) as George Stacy ,Felicitiy Jones (Slumdog Millionaire)\nas Felicia Hardy, and Oscar Winning Actor Jaimie Foxx(Ray) as Max\nDillion. I Really Enjoyed The Film Also This how Spider- Man is\nsupposed to be also enjoyed that he cracked Jokes also enjoyed the\ncomplexity of his character glad again also they glad they gave peter\nand gwen and dynamic though i think the film could've done without\nRhino and Goblin what made the first film it had one villain also\nJaimie Foxx's portrayal of Electro was a little cartoony , .Great Music\nBy Hans Zimmer(Inception), Cinematography By Dan Mindel(Star Trek Into\nDarkness) , Costume Design By Deborah Lynn Scott(Sleepy Hollow) and\nDirection By Marc Webb(500 Days Of Summer) A Decent Sequel could've\nbeen better 7/10\n"},
{"review": "\nA script this bad can only be written by a lobotomised amoeba. <br><br>There is actually no saving grace in this movie, none at all. It's\nsimply not worth watching. Unless you want to sue the producer for\nreducing your life span.<br><br>I gave it one star because Emma Stone is hot. And the fact that I can't\nget it less than one stars. But mostly because Emma Stone is hot!<br><br>The cast is dreadful, except Emma of course, and the script we've\ndiscussed already, so no need to repeat myself.<br><br>But I might do it just to remind you how awful this movie really is. Do\nnot waste your life on this!!!!<br><br>It is a pitiful attempt to milk some money out of unsuspecting fans of\nMarvel and Spider Man, or any other geek who might fall into the trap.\nAnd it's bad. Really really bad. Like Kim Yong Un bad. Or Matt Damon\nbad!<br><br>But Emma Stone is still hot!\n"},
{"review": "\n.... and, to be fair, this was not my idea but the writer's, since the\nlast few minutes of the film reveal that this was a topic very much on\nhis mind when he penned (what passes for) this script.<br><br>OK OK, I get that the transition from comic book to feature film is not\neasy, but art never is, really. And it has been done successfully. Look\nat Superman 2 with Chris Reeves. Look at Spiderman 2 with Toby MaGuire.\nMore recently look at Superman Returns (flawed but still brilliant in\nparts) and even more recently than that, Captain America 2. What do all\nthese films have in common? Humanity. Hope. Decency. That difficult\nblending of superpowers with those same quirks and oddities which make\nus human. What they lack -- every film above-named lacks -- is\nbrutality for its own sake, gratuitous violence directed against the\nstar (and, by analogy, the viewing audience) just to make them feel the\npain. Yet, astonishingly, this trend is becoming the \"new normal\" in\nsuperhero films and no one seems to care, the fans just keep lapping it\nup. MAN OF STEEL was an abomination, as if the intent was to see how\nmany office buildings you can bang to bits with Superman's head. Ditto\nThor 2, ditto The Wolverine (borders on torture porn, that one); and\nfinally, this \"re-imagining\" of Spidey where everything that can\npossibly go wrong in his day ... does go wrong. Is this entertainment?\nSeriously. C'mon folks, wake up and smell the stupid before all\nsuperhero films end up like this.\n"},
{"review": "\nReturn of the Spider-Bully.<br><br>They just couldn't capture Spider Man's personality in these films. Or\nrather they captured it for the Millennial attitude rather than how\nSpider-Man has ever been written.<br><br>In both Amazing Spider-Man movies, he mocks and openly ridiculous and\nbelittles the people he's fighting. He bullies them from low rent\nthieves to the Big Bads.<br><br>That isn't how Spider-Man has ever acted save for when he was possessed\nby Venom in the comics.<br><br>True, he has always had a mouth on him, he's always been comical and\nrun off at the mouth, but it's never been to belittle his opponent.\nSpider-Man has never been a bully.<br><br>The depiction in these two reboots tend to take the sense of humor of\nthe guy in high school that shoved nerds into lockers.<br><br>There is a marked difference in the attitude and humor portrayed in\nGarfield's Spidey and the more true to form Spider-Mans of both Tobey\nand Holland.<br><br>There is a maliciousness here, in the Amazing Spider-Man movies that I\njust can not get behind as a fan of the character. He gloats when he\ntakes down people weaker than him.<br><br>It leaves a bad taste in the mouth and should for any loyal fan of the\nWeb-Slinger both in the movies and in the comic books.\n"},
{"review": "\nThis movie features excellent action and chase scenes and special\neffects. If you are a Spider Man fan, this is the movie for you! If you\nknow anything about the comic book story, you will recognize what\nhappens towards the end. I think Andrew Garfield and Emma Stone work\nwell together as Peter/Spidey and Gwen Stacey. Jamie Foxx was also good\nas Electro, and the guy playing Harry Osborne/Green Goblin was good\ntoo. This was as good as sequels go, and fantastic as far as superhero\nflicks go. You will definitely feel for Peter's character throughout,\nand Harry Osborne's villain was good. One other thing-a coherent story!<br><br>*** out of ****\n"},
{"review": "\nI wasn't to excited for this movie as the first amazing spider-man\nwasn't all that bad, it was a decent and enjoyable flick. Firstly let's\nmake something clear this isn't a superhero movie seriously it isn't I\nknow it's called the amazing spider-man 2 but it's more of a romantic\nmovie between spider-man (Peter Parker) and Gwen Stacey. It barely has\nany fight scenes at all. Electro was a complete waste in this movie as\nhis CGI body is horrible. Harry Osborn has changed so much since the\nlast movie and his the goblin character is never seen until the last\nact of the movie. I don't know what they were trying to do with Gwen's\ndeath, trying to make it emotional or boring whatever they were trying\nto do it was dull. There is only one word to describe this movie and\nthat is terrible.\n"},
{"review": "\nThis was the worst super hero movie I've ever seen. The main character\nshould have been someone else, Garfield's acting is superficial, his\nvoice induces feelings of nausea, and he is not believable as Peter\nParker. It seems they attempted to TRY and prove him as being Peter by\nmaking most of the movie have him being Peter rather than Spider-man.\nThe CGI doesn't look believable also; and the scenes are boring and\nuninteresting in most cases. Gwen and Peters scenes make me want to\nfall asleep, they don't have a bond between them at all. The plot was\nalso not to my interest. It was very cliché. The first movie was OK,\nand even watchable. This movie however fell completely flat, neither\none can even stand by the original Spider-man movies.\n"},
{"review": "\nThis Movie Gets a lot of hate and frankly i don\"t think it deserves it.\nThere are some problems with it though. The Character of Electro was\nvery poorly written and his motivations were very weak. He didn't\nreally feel like a character and felt more like someone for Spider man\nto fight. Some of the Special Effects were not very convincing. The\nshots of Spider Man Swinging looked like they were pulled out of a\nvideo game. And there was just too many subplots and too many\ncharacters in the movie. However the action Scenes were quite exciting,\nthe emotional scenes were touching and some of the characters were very\ncompelling. Harry Osborn is a very strong character and you really feel\nHis pain throughout the movie. The relationship Between Peter Parker\nand Gwen Stacy was very well done. And this is an entertaining movie.\nMost of the Characters are likable and the pacing is good. Its not a\nmasterpiece but its a fun ride. I'd say check it out. Just Don't expect\nit to be as good as something like The Dark Knight.\n"},
{"review": "\nMarc Webb directs and critics pan this sequel; but fans have various\nopinions. I find this feature at times a little disjointed and some\nscenes tend to be pointless. But, THE AMAZING SPIDER-MAN 2 is a very\ngood escape. A refill of popcorn was due this time. Peter Parker\n(Andrew Garfield) is having problems dealing with his conscience trying\nto keep his promise to leave his main squeeze Gwen Stacey (Emma Stone)\nout of his dangerous life. New York City is rapidly falling deeper into\nthe grip of Oscorp. Spider-Man will have to defend the city against the\npowerful villain Electro (Jamie Foxx), and that battle will constitute\nall of the viewers attention. Great F/X. If this is not enough, an old\nfriend Harry Osborn (Dane DeHann), adds to problems relating to Oscorp.\nPeter and Gwen will compromise their inner-most feelings and our hero\nwill uncover more clues to his past.<br><br>I did find myself getting a bit irritated with Spider-Man's sporadic\ngrins to the camera and his attempts at humor. But no doubt about it,\nMr. Garfield is many times better than watching Toby Maguire. I wish\nthat Peter and Gwen could have shared the same spark and sizzle in the\nrelationship from the last movie. Believe me, Miss Stone could make any\nhero's toes curl!<br><br>Others in the cast: Paul Giamatti, Campbell Scott, Felicity Jones, Colm\nFeore, Embeth Davidtz, B.J. Novak and Sally Field.\n"},
{"review": "\nThis film has action, comedy and drama in a perfect balance. I am\nworried that there would be too many bad guys in this film, but they\ndid it just right.<br><br>One of the highlight is the soundtrack and score of the film. The music\nwhen Elecyro is in Times Square is amazingly well done. I like this\nfilm a lot because it really feel like Spider-Man I know from the\ncomics.<br><br>The action is fun, fast and so Spider-Man if that means anything. The\nway they use his spider sense is very cool.<br><br>However, the ending is sad and I cannot understand how that could\nhappened. I am so disappointed. n the end, Iwant to say that the drama\nis very high.\n"},
{"review": "\nIf you've watched \"Spiderman 3\" then you know what a bad film's like\nand this film is not it. I wish it gets more recognition in the future. <br><br>Surely there is a thing or two i would change , especially regarding\nElectro's origins , but this film has all. Action,funny Spiderman- ish\none-liners,drama...it's all there and i could safely say it's put well\ntogether. Gwen's a far better and more likable girlfriend than Mary\nJane was,Garfield's playing is more versatile and cool than in the\nfirst movie,the twist with Gwen in the end is at least interesting\nsince you don't get to see a lot of similar scenes in superhero films\nand the last scene is really promising and sets hype for a good\ntrilogy-closing film. Too bad Spiderman is getting rebooted once again\nand he's debuting in \"Captain America : Civil War\". I really hoped we\nwould finally get to see Carnage as the main villain in the third film.<br><br>Watching this film didn't bore me and i think that's mostly the point\nof such movies. It's a decent action-flick with one of the most famous\nsuperheroes ever starring in it and a couple of scenes where some\npeople might actually tear up. Thumbs up!\n"},
{"review": "\nThis story is about a superhero saving people, He got his superpower\nfrom a spider that bite him since part 1. He's a good guy used to save\npeople whenever they're in trouble. The most amazing character is\nSpiderman(Peter). This part there are so many villains, such as Electro\nman, Harry his old friend and many more. It is too interesting to\nwatch. My favorite part is when he fight with the Electro man. It is\ngreat it included sad scene, action scene,... Well, this story could\nmake some people cry but mostly for girls, and yes it also have comedy\nscene,there are plenty of parts that can make you laugh. This story is\ngood, yo got no need to skip any part or any scene of it, or you will\nmiss some important detail in the story. There are some parts in the\nstory that you may not like about it, in the story, Spiderman's lover\ndie, and Spiderman starts to feel empty and the city also lost the most\nimportant hero, but it didn't last long, Spiderman was back to save the\nday again, he just needed to recover first. I suggest this story could\nbe watched by old guys, kids, teens, or well we can say anyone may like\nit. I gave this story an 8/10 for these reasons\n"},
{"review": "\nThis movie was freaking fantastic! Andrew Garfield is a perfect actor\nto play the Spiderman role and they were wrong to replace him for Tom\nHolland. Andrew could really bring out the true colors and emotions\nthat Peter Parker had and it was an amazing job! The movie is too\nharshly criticized and there should be an Amazing Spiderman 3 with\nAndrew Garfield. Though the plots lines are a bit twisted and unique\nfor what would have been the next two movies, the edge that was put\ninto these versions of Spiderman from the three previously played by\nToney Maguire. I would much rather watch Andrew Garfield play the\nwall-crawler than Toney Maguire and Tom Holland combined. I desperately\nwant the movie producers to worry more about the quality of the actor\nand movie than how much money they're getting. Aren't you rich enough\nalready?! I want Emma Stone and Andrew Garfield to play their original\nroles of Gwen Stacey and Peter Parker. The duo made the movie that much\nbetter. If you were so worried about the actor, why give him the role?\nDon't change out Andrew Garfield just because Amazing Spiderman 2 made\n$4 000 000 instead of $10 000 000. Those aren't the exact numbers, but\ndon't fire an amazing actor who plays the role of an iconic superhero\nperfectly.\n"},
{"review": "\nI know that this movie was released before some time, but i finally saw\nit after i saw the first of the series. I am very happy to see a so\ngood movie. Actors were great, expressing feelings nicely in a way it\ncan make a person without lots of emotions(during movies) to a point\nbeing very emotional. The main actors spiderman(peter) and gwen were\nfantastic. They were much better in expressing emotions than in the\nother series. Gwen is a very beautiful lady that just steals your heart\nthus making it a very nice bond between the two. Finally i didn't like\nthe ending where she dies, its very sad but generally its a great and\nvery teaching movie. Its excellent for me.\n"},
{"review": "\nIn the summer of 2012, the reboot of the Spider-Man franchise, The\nAmazing Spider-Man, was released. It was heavily criticized for\nretelling an origin story that didn't need to be retold, idiotic\ncharacter motivations, and constantly shifting into different plot\nlines instead of developing them naturally. but the 2nd movie did the\nsame thing. sometimes the plot would focus on electro and then it would\nfocus on harry , the movie was okay .<br><br>this movie could have been better . Rhino was so dumb , i couldn't\nstand that guy , i thought he would be better. <br><br>and this whole thing you see on the posters you see about the 3\nvillains uniting is bull crap\n"},
{"review": "\n*WARNING CONTAINS HEAVY SPOILERS* I was one of the rare few who found\nthe first Amazing Spider-man movie to be really good, so I was\ndefinitely looking forward to asm 2. I wasn't disappointed. This did\nwhat a good 2 movie should do, it gave us a really good villain.\nElectro was a great villain, who was very menacing. Harry Osborn was\nanother great villain, and he had a clearly explored back story and\nmotivation. Combine the two and you get the perfect villain. Andrew\nGarfield and Emma Stone are still in-arguably great as the leads, and\ntheir chemistry together is top-notch. The effects are even better this\ntime around (which is really saying something), and these are possibly\nthe best effects I've ever seen. This movie keeps a great tone, in that\nit has some funny moments, but it knows when to be serious, and that's\nthe tone I want from a Spider-man movie. I'm still not 100 percent sure\nhow I feel about Gwen's death. It made a nice conclusion to the series,\nbut if they had wanted to make more, they would've needed Gwen alive.\nThere are a few too many plot-lines, and that's why I rate this a bit\nunder the first movie, but I still give the story a thumbs-up. In\nconclusion, I think this movie was really good, with great characters,\nperfect visual effects, a good story, that occasionally got too\nmuddled, and a good tone. I was really sad to hear that this great\nseries was getting thrown out to make way for another bland MCU movie\nwith forced humor and no tension. This could've been one of my top five\nfavorite trilogies of all time, now it'll be my favorite\ndouble-feature. This was a great send off to a great series.\n"},
{"review": "\nThe Amazing Spider-Man 2 (released with the subtitle Rise of Electro in\nsome markets)[6] is a 2014 American superhero film featuring the Marvel\nComics character Spider-Man, directed by Marc Webb and released by\nColumbia Pictures. It is the fifth theatrical Spider-Man film produced\nby Columbia Pictures and Marvel Entertainment, and serves as a sequel\nto The Amazing Spider-Man (2012).<br><br>Confident in his powers as Spider-Man, Peter Parker (Andrew Garfield)\nembraces his new role as a hero and spends time with Gwen Stacy (Emma\nStone) in between protecting New York from criminals. However, his\ngreatest battle yet is about to begin. With the emergence of Electro\n(Jamie Foxx), Peter must confront an enemy far more powerful than he\nis. And when his old friend Harry Osborn (Dane DeHaan) returns, Peter\ncomes to realize that all his enemies have one thing in common: Oscorp.\n"},
{"review": "\nI really like this spider man, he is much better than the goofy toby\nmcdonalds. He feels real somehow and i really like Gwen in it, she is\nfull of sparks and a girl any man would fight for.<br><br>The antagonists on the other are trash. They lack deep, and when u look\nat them all you can think of are lost kids stuck in puberty with no\nstrong character whatsoever. You want a supervillain to be strong\nminded with purpose and real hate pulsing through their veins, not\nthis. They are simpleminded and all you do is pity them.<br><br>Real hate doesn't just pop up one day all of a sudden. There is no\nsense of evil around, just deluded fools with no psyciatrist to help\nthem walk with both legs.<br><br>I still liked the movie despite the the trash antagonists. Peter parker\nmeeting up in his past was awsomely done. Also his affection to Gwen\nand the struggle in his heart due to the past felt real.<br><br>the only thing bad was the supervillains..they are on same level as jar\njar binks. clowns to get younger people be able buy a cinema ticket.\n"},
{"review": "\nI gave it a 9 out of 10 because I'm pretty much a marvel fanboy who\ndoesn't know any better. Plus I saw it in 3D which made it SO much\nbetter! My review won't be biased in that sense however.<br><br>Spiderman is a story/universe that has SO much going on in it...\napparently Sony and Marvel know that but don't know how to deal with\nit. They couldn't make up their minds on what to include in the movie.\nLove story between Gwen and Spiderman? Sorrowful absent father story\nbetween Peter and his dad? Beginning intro for the sinister six story\nline? An \"I feel bad for you\" story between the Osbornes? ANOTHER \"I\nfeel bad for you\" story with Aunt May and Peter?? It even ended in a\nway that had the studios probably telling the director to cut it\nbecause it could've easily gone on infinitely...<br><br>It did have its good points... just the visuals were amazing. I got\nchills seeing Electro do his thing and hearing the menacing dubstep\nmusic every time he appeared. But again, there was just too much... SO\nMANY things could have been left out of the movie.<br><br>Also, I'm not a fan of Andrew Garfield. He's a good actor but just\ndoesn't do it for me as a Peter Parker/Spiderman.<br><br>I'll still leave a 9 stars for my own grading but for anyone else that\nreads this, for an overall movie grade, I give this more of a 6 or 7.\n"},
{"review": "\nThis is the best Spiderman movie ever made. It has all the action you\ncould want but what sets it apart from the others is the emotional feel\nyou have for these characters. Great storyline between all the\ncharacters and Harry Osborne was a pleasant surprise. You truly see\nPeter Parker and Harry Osborne for the men they are. I thought Jamie\nFoxx cast as Electro was a bad choice before I saw it but he played it\nperfectly. Emma Stone was much more appealing as Gwen Stacy than the\nboring Kristin Dunst. it is a long movie but well worth every minute of\nit. Great story, great action and much more in depth characters make\nthis Spiderman simply amazing.\n"},
{"review": "\nWhat can I say except Wow. This film had me sitting on the edge the\nwhole way through. I don't usually write these but I thought I just had\nto get across what an amazing film this is. I was a bit sceptical at\nfirst because of how perfectly Toby Maguire executed his role as\nSpider-Man. At first it seemed to put me off how cocky spider-man was\nbut it seemed to grow on me. I feel that Jamie foxx an unlikely actor\nto be a villain in spider-man absolutely stormed it. He played his role\nabsolutely effortlessly. The special effects with his character electro\nhad got to be the best to date I really think it made the film\nsomething special. I am rather quite saddened that I didn't pay much\nattention to this film and didn't get to watch it until now and in the\ncinema because I think that would have been absolutely incredible. I\nnever got to watch the amazing spider-man 1 but if it is anything like\nthis one it has to be incredible . I can't wait for number 3 to come\nout I will surely be the first to go and get my ticket. This is a film\nyou have to watch.\n"},
{"review": "\nI still have split feelings over the new Spiderman reboots. I loved the\noriginal trilogy, but I did like the first reboot even though it was\nthe same origin story all over again. If I wanted a sequel, it would\nhave been Spider-Man 4, but instead we get the Amazing Spider-Man 2. I\nwon't lie when I say that I expected a complete disaster. I\nactually....liked this film even more so than the first one. It has\nplenty of strong action and I actually liked the romance between Peter\nParker and Gwen Stacy this time around. The biggest fault I found with\nthe movie is the overuse of villains. Sure, the Rhino is a good\ncharacter, but save him for the next film! <br><br>Marc Webb's returns Spider-Man/Peter Parker to the big screen as he and\nStacy are graduating from high school. Peace in the city isn't to last\nas Oscorp plans on taking over the city. Peter has to face such\nvillains as Electro and Rhino as well as balance the delicate duties of\nSpider-Man and Peter Parker.<br><br>I think Andrew Garfield makes for a very good Spider-Man. He is more\ncocky than Maguire's take on Spider-Man, but I find his character more\nlikable. Speaking of likable, Emma Stone makes for a fine Gwen Stacy\nand she has great chemistry with Garfield. Jamie Foxx does well as\nElectro, although his role bears strong resemblance to his role in the\nSoloist. Paul Giamatti has a good few scenes as the Rhino and likewise\nDane DeHaan as Harry Osborne.<br><br>Overall, the Amazing Spider-Man 2 is actually an entertaining superhero\nmovie. It's not perfect of course since there are some flaws within the\nstory, but I found the film to be just a tad better than the first\nreboot film. The action is there, the romance is there, and Spidey\nbeing a hero is of course there. The film also has a little bit of an\nsurprising emotional charge. A good film to watch and better than I was\nled to believe.<br><br>My Grade: B+\n"},
{"review": "\nI really did enjoyed this movie seen it a couple of times and still\nlove it. Yes everyone is entitled to their opinions just as much as I\ndo and here's mine. \"The Amazing Spider- Man 2\" was really entertaining\nand good but honestly my complaints is that there was an overload of\ncharacters and it felt too soon to add the rise and fall of the green\ngoblin and death of Gwen Stacey which left me upset by the way but hey\nGwen was infamous in the comic book world because of her death and\nmostly because of that and oh being Peter's first love. I also felt\nlike the beginning of the movie of The Parkers was unnecessary it\nshould've been shown in the last film and serve as a mystery throughout\nthe movie and have Peter look for answers like he did and continue on\nin the sequel which he did but it just left me confused of what's\nalready known but it wanted to be shown in this movie but felt it was\nunnecessary and had more questions than answers and Electro was a miss\nfor me, Jamie Foxx was okay with what he can do but for Max Dillon it\nwas hard for me to like him and feel bad for him because the character\ncame off as a cliché for villains. Andrew Garfield and Emma Stone were\njust adorable are two stars had charm and wit along with emotion and\nyes the dialogue was either cringe worthy or sweet. The Rhino was a\ngood laugh to some but I was annoyed with the stereotype : angry\nRussian thug. Sally Field as Aunt May was a highlight as well from a\nstruggling woman making ends meet yet finding the time to care for her\nboy and Felicity Jones was just a miss and Felicia was also another\nunnecessary adjustment in the movie. Dane DeHaan was at his best giving\nall he as to show a rich boy dying and becoming evil but felt the whole\ngreen goblin was too soon and was alright with what he can do with the\nscript. For the next Spider-Man movie listen to the criticism and don't\nrepeat mistakes and stop with the overabundance. Overall it was a good\nmovie and I love this movie very much.\n"},
{"review": "\nThe Amazing Spider-Man 2 was one of the movies I was looking forward to\nthe most in the beginning of summer 2014. When I saw it in theaters, I\nwas blown away. Now that I own it and have had a chance to study it,\nI've come across some issues.<br><br>Andrew Garfield's Peter Parker is weak in this movie compared to the\nfirst Amazing Spider-Man movie, where Garfield's Peter was excellent\nand Spidey not so much.<br><br>Truth be told, I want to like Andrew Garfield's portrayal because you\ncan tell he genuinely loves Spider-Man and I'm happy that he gets to be\nSpider-Man, but this was weak. Hopefully future movies will allow him\nto fully express the Spidey persona.<br><br>Now, as for Emma Stone's Gwen Stacy, I couldn't care less for her.\nSure, she helps Spider-Man here and there but eh. I could do without\nher.<br><br>The one character that redeemed this movie (in my opinion) was Dane\nDeHaan's Harry Osborn. I CANNOT get enough of him and I'm looking\nforward to seeing more of him as Green Goblin. His portrayal is spot-on\nmaniacal and dangerous, even though he wasn't in the movie for that\nlong.<br><br>Another redeeming factor is the easter eggs and references here and\nthere, like the notorious Daily Bugle editor...<br><br>This movie feels like a set-up rather than an actual movie. It's like a\n2 hour-long preview of what's next to come and I honestly have no\nproblem with that, except when it gets exhausting.<br><br>The plot is flawed, so are the motives of some characters and despite\nits great soundtrack by Hans Zimmer, even I got tired of literally\nevery scene having too much music in the background. Can't recall a\nquiet scene other than the closet one.<br><br>In the end, it's not as bad as people make it seem but it definitely\nhas its issues.\n"},
{"review": "\nI still haven't recovered from how bad this movie was, and it's been 18\nmonths. If somebody tries to show you even a small snippet of this\ntrain wreck, immediately leave the room or physically stop them, if\nneeded. Everything about this movie is lazy, this review probably took\nmore time to make than the script. The main villain's motivation for\nbecoming evil is because Spider Man didn't remember his name, are you\nserious? The romance in this movie fits in so awkwardly with the other\nscenes. They should've made a fun adventure Spider Man movie and a\nsappy romance, instead of horribly combining the two. The product\nplacement®(Sony) would be glaring for anyone not accustomed to it\ngetting shoved down their throat at every movie, like we all are. Mary\nJane or whatever her name is, dies near the end of the movie in a\nhorrible cliché scene that made me burst out laughing. After that,\nRhino makes a brief appearance and then the movie ends exactly the same\nas the trailer did. The whole point of a trailer is to provide\nanticipation for things that will get resolved in the movie that they\nwant to sell to you, but they just cheap'd out and decided to not even\nfilm that scene. But don't worry, it'll all be in the next movie!\n"},
{"review": "\nThe Amazing Spider-man is a total failure before.. So this part 2 still\nfail quite bad.. I'm really sick of the whole plot.. There are no basic\nresponsible of a super hero.. He is trying to show off that he is\nspider- man every chance he had.. In part 1 he is taking off his mask\nvery often showing his face and showing off his new skills to people..\nNow wooing Gwen like a spoiled kid in his spidey suit trying to make\nher stay when she is leaving? And spinning a huge web saying I Love You\ntelling the whole world.. W T F? If he is wooing Gwen as Peter Parker,\nthat is still acceptable.. Wooing Gwen in spider-man suit makes him\nlook like a skirt chasing whim who tries to impress girls with his\nspider-man identity.. Totally spoils the image of spider-man.. Just\nwatch the Spider Man 1-3 by Tobey Maguire.. At least he brings out the\nspider-man with discipline and of some sense.. And not behaving like\nsome brat trying to show off and chase after some girl he had a crush\non with his spider-man suit.\n"},
{"review": "\nBased on the fact that I did not enjoy the first movie, I lowered my\nexpectations yet still tried to judge this film on its own merit. Even\nso, I have to classify this effort as an absolute film travesty. It is\nall kinds of awful.<br><br>I seriously am searching for something to like and I do absolutely love\nthe character. Spidey looks great and I really do like the cast. It's\ntoo bad they gave them such a dumb story and such a bad script to\nshoot. There are so many things wrong with this effort that it's tough\nto sum up my utter contempt for what I saw unfold on screen. What\nstruck me about an hour and a half in to the run time was the fact that\nnothing major was happening yet they managed to develop NOT one single\ncharacter. Everything feels shallow and most nothing connects. They\nbook end the film with cheesy Rhino moments that really deserve all the\n\"Batman &amp; Robin\" comparisons that I've read. (Spider-Man messing around\nin the opening truck chase should have gotten dozens of people killed\nfor no reason) Seeing New Yorkers standing behind instant barricades\nwatching gun battles and explosions happening less than 100 yards away\nas if it was some sort of Spider-Man sports contest actually made me\ncringe. That happens three times during the film. Electro was\nridiculous and again, the parallels to the worst films the genre has\never produced are real and tangible. Harry Osborn is yet another wasted\nand unbelievable cheesy character.<br><br>I do award a few salvation points for actually giving Aunt May a few\nscenes to shine (unlike the first film.) The action is completely\nforgettable except for the final Goblin showdown. That was well done\n(more salvation points). The slo-mo vibe is terrible and the soundtrack\nseverely detracts from everything. The dialogue is as bad as it gets as\nis EVERYONE'S motivation.<br><br>Overall, I'm a Marvel fan that is actually offended by how bad this\nturned out.\n"},
{"review": "\nThe Amazing Spider-Man 2 was Just Awesome! good villains in the Movie\nLike Electro. played by Jamie Foxx who did very good playing as him and\nGreen Goblin &amp; Rhino at the end of the film. the film was good as the\nAmazing Spider-Man which had The Lizard in it.<br><br>and pretty all i have to say about this movie it's fun entertaining to\nwatch especially it's awesome fight scenes with electro and spider-\nman. and Andrew Garfield &amp; Emma Stone did great in the sequel too. Marc\nWebb's spider-man film series seems so much better than What you would\nExpect for a Better Spider-Man movie series. &amp; i know Sam Raimi's\ndidn't end not a good conclusion with spider-man 3 since it was not\nthat great of a movie. But Sill Like i said I Would Definitely\nRecommend this to anyone who is Spider-Man Fan. so the Movie gets a\nthumbs up and still good movie and i liked it when i First got to see\nit. just good! something i didn't expect for any Spider-Man Movie\nstill. But overall thumbs up for this movie.\n"},
{"review": "\nThis movie is really amazing whatever what critics or other said this\nmovie is really good, it may not be the best super-hero movie but it\nstill enjoyable to watch well i love this movie because the actors\nremind me the characters of the comics. Spider-man suits was like the\ncomics.<br><br>I think Andrew Garfield is the best Spider-man he pulled the spider-\nman from the comics perfectly with the perfect humour,Emma Stone as\nGwen Stacy was portrayed perfectly, Dane D. as Harry O. was really\namazing, he is the perfect Harry O. and a great Green Goblin i like the\npsychology in the scene were he appeared as Green Goblin and Peter was:\n''Why did you do that???'', he was more darker than James Franco (but\nhe was good either), Jamie F. as the electric blue villain was okay but\nthe special effects was really awesome.<br><br>the battle scenes were great and I really love the Spider-man(his\nfather use to work with Os-corp till he discovered that they were doing\nsomething illegal he is the good one) vs the Green Goblin(the son of\nthe director of Os-corp witch he's the bad one) both best friend\nfighting. <br><br>The ending with the Rhino was great to me (if it wasn't spoiled on the\ntrailer or even on the poster because the epic battle with the Rhino\nwas not in the movie) I also like the little kid scene it was very\ntouching, they had a cut scene/alternate ending in the DVD Blu Ray\nshowing that Peter's father was actually alive this was really more\ntouching I even cried for it it was so good.<br><br>This movie had great actors on it I just can't stand the Toby fan's who\nthink that Spider-man 3 is a lot better I mean never Spider-man 3 is\none of the worst super-hero movie I have ever seen in my entire life.\n"},
{"review": "\nThis is a little late for a review i watched this back in 2014 in\ntheatre with high expectations. Now lets talk about the film, it's the\nworst marvel film ever made. Wrong Portrayal of Peter parker By Andrew\nGarfield. In this Duology, Peter is a cool guy which he was not in the\nprevious films. Girls didn't talk to him, ignored him Just as in\nSpiderman 1,2,3 Same as in the Comics, in this film he is not Serious\nAt all. Taking everything Lightly and got gwen killed. Getting Back to\nthe film, a failure that cant be forgotten. They had many stories to\ntake from The comics but what the f**k is this S**t ? Terrible Acting\nfrom Jamie Foxx. I think he was Over-acting portraying Electro. The\nRemember the game was released back in 2012 during the first film but\nthe game was in fact the sequel of the film released the same year.\nThey could've followed the same story in which the cross-species virus\nspreads and the lizard returns.\n"},
{"review": "\nJeez, big spider-man fan here but boy this is the worst Spidey movie of\nthe lot. I know Sony had only one superhero blockbuster and were trying\nto milk this movie as much as possible by setting up future spin-offs\nthat thankfully didn't come into fruition. Starting with Andrew\nGarfield himself, his chemistry with Emma stone was kinda good and\npeople say he was a better spider-man than Tobey i just wasn't sold on\nhis performance. Then the elephant in the room, JAMIE FOXX AS\nELECTRO,this was one of the silliest villains ever put to film just\nbehind whiplash from iron man 2. His motivations were so lazy and they\nkept making up his powers as they went. Whats there to say, people that\nwatched this at the cinemas probably wanted their money back cause this\nmovies full of it\n"},
{"review": "\nStunning Spidey SFX and an impressive Production all around highlight\nthis Sequel that comes off, overall, better than the first one. But the\nenormous amount of Romantic Angst, combined with the Parker Family's\nsuffering from loss, is a bit much for a Super-Hero Movie and the\nMelodramatics and Emotional tugging bring this one down. There's just\ntoo much internal turmoil for this type of thing.<br><br>The Story outside the Personal Stuff is OK and there are layers upon\nlayers of interesting happenings. Jamie Foxx's \"Electro\" is flashy and\nfantastic at times. The CGI is bright, glaring, and gaudy, but works\nnonetheless. There are many other Characters in an around Osborn Corp.\nHarry (Dane DeHaan) shows up. So does His Dad briefly. <br><br>Oscorp is shown to be an Evil breeding ground for present and future\nSuper-Villains like Rhino, who makes a Cameo and there are hints of\nothers. Overall, an acceptable entertainment, but these Comic-Book\nMovies have become such a huge part of the Cinematic Lexicon that\nexpectations are high every time out and Fanboys are always pushing for\nperfection.<br><br>This one was considered a Flop, both commercially and critically, and\n#3 is a no go. Where is Spider-Man (Andrew Garfield) headed? Search the\n\"Web\".\n"},
{"review": "\nThe Amazing Spider-Man 2 has technical merits. However, these merits\nare impossible to enjoy in a film drowned from beginning to end in the\nsickening narcissism of both its purported hero and supposedly tragic\nvillains.I give you The Amazing Spider-Man: a hero with no principles\nand no goals.by sometimes he only cares about his girlfriend and\nsometimes wants to know what happened to his parents, but day-to-day he\nreally only cares about doing what he wants to do-- which happens to be\nhelping people, it seems, because it gives them hope.Electro could have\nbeen a tragic Frankenstein villain. Instead, because a group of random\npeople roots for Spider-Man over him in his first public appearance, he\ndecides everyone should die. Yup--that's his motivation.I really like\nspiderman as a series, and I think Andrew Garfield does take on this\nmore gloomy and dark version of spidey/peter parker, it works quite\nwell and I hope that they make many more in the series.but Electro come\non, he should have died in that fish tank and not become this\nelectrical super freak evil bad guy. Give me the two other evil enemies\nat the end, Dane DeHaan really fits his part both as Harry Osborne, but\nalso as the Goblin it is really good. The Rhino that we briefly see in\nthe end is really fitting in my universe of spiderman and the evil\nfiends he has to battle, so for my sake those are the one they should\ngo for.\n"},
{"review": "\nThe latest Amazing Spider-Man 2014 + 2012 are Not a patch on the\noriginal Spider-Man 2002, 2004 + 2007 Not having a Web Gland just\nspoils the movies. This one however really did take the biscuit <br><br>Boeings cannot bank as fast as they were supposed to near the end. If\nthe Boeings were having power troubles, how is that possible, MAX was\nNOT able to pull electricity out of the air, let alone at altitude.\nBoeings have there own generator linked to the turbines as well as\nbatteries, there is no way they would be experiencing power problems.<br><br>Power in the city was stolen from everywhere but power does not come\nfrom one source. <br><br>the tube system uses a completely separate grid to main power so the\ntrains would NOT have stopped working.<br><br>air traffic control and hospitals both have there own generators in\ncase of power cuts.<br><br>Max stole all of the energy from the power grid, so hitting him with\nall the power from the grid would not have blown his batteries! This is\ndisregarding the fact that he used his power to fight spider-man<br><br>And finality when they did hit Max with the power grid, they also\nresupplied power to the entire city.<br><br>even if you don't know about power, you know that if everyone gets up\nin an ad break to turn on the kettle, the power grid has to bring more\npower online or they get a brown out, there is no way they could have\ncooked Max, when he was capable of taking that power in the first place\nand simultaneously resupply power to the entire city. at the very least\nthey would have recharged Max and the city would have struggled to get\nany power at all, just a few flickering lights, since electricity will\nalways take the shortest and easiest route.<br><br>in all, the person that scripted this movie had NO CLUE about what\nelectricity is, how humans use it and what would happen in the scenes\nscripted.\n"},
{"review": "\nWhereas the era of Toby Maguire's Spiderman was marked by a Peter\nParker wound up tighter than a coiled spring and on the verge of tears\non several occasions, Garfield's Spiderman is more at ease with\nhimself, and certainly more street-wise. He is tougher in some\nrespects, but also more likable as a character, which shines through\nquite a lot for me in this film.<br><br>The almost-forced love story between Parker and Mary-Jane in the first\nthree Spiderman films is replaced by a more natural, gentle portrayal,\nand the on-screen chemistry between Andrew Garfield and Emma is better\nthan that between Maquire and Kirsten Dunst. <br><br>The primary villain of the piece, Electro, is well-performed by Jamie\nFoxx but the character is a little clichéd and to be honest, doesn't\nget enough screen time either. I rather liked the new spin on Harry\nOsborn, who, like Parker, is less of an emotional wreck and, despite\nsome acts of petulance, is more likable than James Franco's\ninterpretation. His transition into the Goblin is motivated more out of\ndesperation than anything else, so he garners more sympathy than\nbefore.<br><br>The action sequences are well staged and manage to convey a strong\nsense of excitement and tension. All in all, I would rate this film\nquite highly!\n"},
{"review": "\nLet's hear how you feel. So, what did y'all think about this movie?\nPlease do not be ashamed to tell me how you feel about this The Amazing\nSpiderman movie. Your views will not be judged. Please feel free to\ntell us how you feel about this movie. Let us know how you feel. We all\nare awaiting your opinion in written form. I'll repeat myself. Let's\nhear how you feel. So, what did y'all think about this movie? Please do\nnot be ashamed to tell me how you feel about this The Amazing Spiderman\nmovie. Your views will not be judged. Please feel free to tell us how\nyou feel about this movie. Let us know how you feel. We all are\nawaiting your opinion in written form.\n"},
{"review": "\nFelt this was much better than first movie. Lot of stories in this one.\nMany parts are rather boring though. And watching the same spiderman in\noriginal storyline and after few years from Sam Raimi's version with\ntwisted storyline is pretty lame to watch. If this was a series\nreleased after a decade or so, then it would have better. And story in\nSam Raimi's version, though twisted and not close to original comic\nbook storyline, was very much likable. <br><br>Personally did not like acting skills of Garfield. Don't think he has\ndone well in scenes he as to engage with Emma Stone. Other scene were\nquite OK. <br><br>Wonder who is gonna be Mary Jane Watson would be in next installment?\nOnline rumours hint on \"Shailene Woodley\" who was protagonist in the\nDivergent.\n"},
{"review": "\nI enjoyed The Amazing Spider-Man 2 for the most part. Andrew Garfield\nonce again proves to be a great Peter Parker/Spider-man and the\nwondrous Emma Stone returns as Gwen Stacy. These two are my saving\ngrace for the film, the chemistry between the two was superb, snapping\nbetween fun chit-chat to romantic interests was easily the biggest\nstrength of the movie. <br><br>With that being said, Spider-Man is about the VILLAINS, with such a\nwide universe of material and villains to choose from Sony opted to go\nwith Max Dillon a.k.a Electro, with Jamie Foxx leading the role. Foxx\nis chilling as Max, he is twisted, disturbed and straight up weird,\nunfortunately his performance as Electro isn't quite as impressive ...\nThere are some great scenes involving Spider-man and Electro\nspecifically the Times Square sequence, but his character is let down\nby some awfully cheesy dialogue, \"It's my birthday, time to light the\ncandle\" *cringe* <br><br>But aside from this scene there isn't much more of them both. This\nleads on to the films biggest weakness, it's convoluted plot. Director\nMarc Webb tries to set up an entire Spider-Man universe by creating\nplot points which will be resolved in future films in one film. This\nmakes the movie seem as just a prelude of what is to come, Harry\nOsborne and Peter barely get any development as friends and instead\nbecome sworn enemies by the end.<br><br>The Amazing Spider-Man 2 isn't a 'bad' film like some people say ... It\ndefinitely isn't Spider-Man 3! In fact it's far from it, a couple of\nkey issues revolving plot and villain let the film down, but it is\nstill a fun experience.\n"},
{"review": "\nThe first Amazing Spider-man was decent but not outstanding. I wasn't\nreally expecting much from this film until I went to go see it, and it\nblew my mind. The acting was great. The music is way better than the\nfirst one, because Hans Zimmer took over. And the effects are pretty\ngood. The love story is great and actually makes you care about these\ntwo characters. The only reason why I didn't give this movie a perfect\n10/10 is because of the overload of unnecessary villains and the\noverall character development with Harry. The movie contains some\nhumour that doesn't ruin epic scenes like MCU sometimes does. Overall\nthis movie is worth watching.\n"}
]