[
{"review": "\nI left feeling that I had wasted two hours of my life, and I'm not the\ntype who watches pop features like Rocky XVII. I enjoy the art house\ngenre that this clearly belongs to. I don't know if this is a spoiler\nalert or not, but if you're waiting for the moment when the loose ends\nare all tied together in any coherent manner, you will be waiting in\nvain. That said, Michael Keaton and the cast give wonderful if\nsometimes overacted performances. You can see why critics like it -\nit's not the pap that they are forced to view day in and day out\nbecause it's their job to watch it. Professional critics, for their own\nsanity, grasp at any opportunity to promote something different or\nunusual. But just because it's good for them doesn't make it good for\nus, the casual movie goer. Since this is a play within a movie that is\nset in a theater, I got the feeling that there are inside jokes that\nthose in or familiar with the business (such as critics) will get but\nwhich is over the heads the audience.\n"},
{"review": "\nA bunch of very good actors, all wasted in an indulgent pretentious\nscript, and even more indulgent and pretentious directing. the pseudo\narts use of a drum soundtrack, the long boring hand held tracking shot,\noh look i am doing all this in one take. the absolutely stupid plot,\nthat takes ages to go nowhere, a film where the film maker is saying\nvery loudly and in a very boring way, look how clever i am, why this\nhas been praised by critics is beyond me. Actually to be honest i have\nnow long given up on what critics say and write about a film. Virtually\ncritic on both sides of the Atlantic seem to have lost any sense of\nwhat is good or bad. The amount of critically endorsed films that i\nhave thought to be not bad but very bad seems to be growing each year.\ni have been a serious movie goer for some time now. i also have noticed\nthat after a year or so these lauded films seem to get reconsidered ,\nwhere the original praise is vastly reduced.\n"},
{"review": "\nI have to say I am shocked and how many bad reviews I have seen on this\nsite for this movie. It seems to me that the majority of moviegoers who\nhave chosen to review here are only capable of viewing a movie at face\nvalue.<br><br>This movie is clearly a satirical look at Hollywood and the constant\nneed to remain relevant in the entertainment industry.<br><br>I will admit that the film does appear unnecessarily \"artsy\" in places,\nbut some Hollywood actors love being unnecessarily artsy as they think\nit gives them depth.<br><br>That was the entire point of this film, for Hollywood to turn the\ncamera on itself and expose all of it's own crap.<br><br>What I took from this film is what I have always felt about Hollywood,\nwhich is also what I love about it. Actors are inherently insecure,\nwhich is why they choose to be in an industry where there is a need for\nconstant approval. The actors who are worth their salt risk everything\nto entertain...us. For that they will forever have my respect.<br><br>Definitely worth watching and worthy of it's Best Picture Oscar.\n"},
{"review": "\nWhilst viewing 'Birdman', I spent the first hour of the film trying to\ndecipher my emotions and opinions towards it, what I was watching was a\nweird, yet wonderful work of art. Truly though, 'Birdman' is a\ntechnical masterpiece. Michael Keaton has generally been undermined as\nan actor (despite a few notable roles as Batman or Beetlejuice) and has\ninstead faced Hollywood picking more acclaimed and popular actors,\n'Birdman' however might just be his ticket to an Oscar nomination, and\npossibly even a win, his performance is mesmerising. Alejandro González\nIñárritu has created a truly spectacular character study that arguably\nfeatures this year's strongest acting performances, alongside a well-\nexecuted script, booming soundtrack and a monumental achievement with\ncinematography from Emmanuel Lubezki in which he attempts a\nHitchcockian approach, reminiscent of 'Rope', and displays the story\nthrough a seemingly single and unbroken sweeping shot. This is the true\ndefinition of a masterpiece.\n"},
{"review": "\nYes, I know - it's \"arty-farty\" and if you don't appreciate the\nridiculously long takes then you are a Philistine.<br><br>I'm proud to be a Philistine.<br><br>I kept waiting for something to happen. It didn't.<br><br>I kept wondering: \"how did they get the camera that was on the roof\nlooking up at the building at night, to then see it in daytime and then\nslowly go down to the street and backwards through a metal grill and\nthrough a window and then...\" <br><br>Sorry, where was I? Oh, yes, what was the plot again? Forget the plot.\njust look at all the long takes and the arty-farty \"actoring\" going on.<br><br>Sometimes I just wish I could sue these people for wasting 2 hours of\nmy life.\n"},
{"review": "\nComing in to this movie, I had heard bad things from people who had \r\nseen it but great things from critics. After leaving, the only good \r\nthing about it was the acting. This movie definitely was different and \r\nunique, but there's a difference from being different and making art \r\nand being different and making a piece of crap. The fact that this \r\nmovie was nominated for best picture above a piece of art, such as \r\nInterstellar, is appalling. I do applaud the director for taking a risk \r\nand trying to make an unconventional movie, but he needed to first \r\ndevelop a plot in order to make a good movie. I strongly discourage \r\nanyone from wasting their time and money seeing this. If you want to \r\nwatch a movie that is different and considered art, watch any \r\nChristopher Nolan, Stanley Kubrick, or Quentin Tarantino movie, not \r\nthis pathetic excuse for entertainment. And to critics, please learn \r\nthe difference between unconventional artistic movies and this bloody \r\nrubbish.\n"},
{"review": "\nIt took me two nights of sheer will power to get through this piece.\nMasterpiece? I don't think so. I had a lot of hope for this movie,\ngiven the stars. And I don't need a lot of action or special effects...\nbut a good storyline will win me over every time. Sad to say this\nlacked in all categories, even the acting was not believable. Even the\nso called super hero Birdman is laughable. I guess judging by the\nreviews, you are either going to love this or hate this. My advice to\nyou, if you like the first 15 minutes, then keep watching, you might\neven consider this a masterpiece. However, if after 5 minutes, you\nthink it's going to get better? You best turn it off and don't waste\nyour time.\n"},
{"review": "\nGreat opening at the Venice Film Festival with this must-see movie. The\nstory of an actor persecuted by the role that made him popular,\n\"Birdman\", and pressured by the willing of proving himself on stage\nwith his new play.<br><br>The characters in the story are all struggling with something: Sam\n(Emma Stone) with her drug addiction, Mike (Edward Norton) with his\nsexual problems, Lesley (Naomi Watts) with her self- realization and\nMichael Keaton with love. What kind of love is he lacking? Is it\nadmiration for his work? The same admiration that chained him to\nBridman, who is probably the only one capable of saving him.<br><br>The cinematography reminds of that used in Hitchcock's \"Rope\": it seems\nto be filmed consequently. The originality of the cinematography,\nthough, may have sacrificed the storyline.<br><br>\"Birdman\" certainly needs to be seen more than one, but likewise\ncertainly it's going to be one of the greatest movies of the year\n"},
{"review": "\nSelf absorbed, self obsessed, pretentious luvvie sh*t. \"Look at us, we\nare actOrs and you're not. We shall shoot this one take. We, are,\ngoing, to, show you, just how clever we are.\" I could have stayed at\nhome and gazed at my own navel. <br><br>I really can't see why we have to write a minimum of ten lines. Surely\nshort, succinct reviews are easier to read, but I'll continue in an\neffort to save other people from wasting their hard earned on such\nluvvie drivel. If you are pretentious, then please go and see this\nfilm. If you aren't........then don't. Spoiler alert! If only Lindsay\nDuncan's character could have reviewed the film instead of the play,\nshe could have saved us all a lot of trouble. Ten lines, I'm done.\n"},
{"review": "\nIt is the most boring film ever. I wonder why so many people love it.\nEvery time I started to get interested, they would play that annoying\njazz drumming. My friend said it was better than \"The Judge\", not even\nclose. From start to finish, that moving is an interesting story. From\nstart to finish, I didn't care about any of the characters in this\nfilm. It won't get wide release because it won't appeal to most people.\nI have a theory that it will appeal to people that like jazz. It'll win\nawards because it appeals to critics. Oh, a spoiler, the plot is\nboring. I will say the actors did a really good job. I didn't have a\nheadache when I went in but by the end of the film I did.\n"},
{"review": "\nNominated for 9 Oscars??? I am not a professional critic but for me\nthis movie was nothing but BORING. I saw this movie with an high\nexpectation but it disappointed me. The stars are only for excellent\nand talented actors, the movie gets 0 out of 10! I kept waiting for\nsomething to happen but it did not. And that annoying jazz drumming,I\nhave got a<br><br>headache from that!And the repeated tracking shots down the empty hall?\nIn short, nothing much happened in the story and this movie was just a\nhuge disappointment!Please do yourself a favor and skip this waste of\ntime. Well I hope it is already 10 lines.\n"},
{"review": "\nWhy is it asking too much too much for Hollywood to produce a coherent\nmovie, one that develops its characters and advances a plot seamlessly?\nWas the Zach Galifianakis character supposed to be funny? For that\nmatter, was the movie supposed to be funny? Ultra serious? Dark? One\nstar for Michael Keaton, who really put a lot of effort into this one,\nonly to be completely undone by the writers' and director's inability\nto develop and utilize characters with a plot that advances the movie.\nAlso, one more close up of Keaton's aging face and I'll jump off a\nbuilding, without a Birdman suit. And since I need 10 lines. . .this\nmovie also contains a pointless lesbian scene.\n"},
{"review": "\nI was expecting something pretty special after reading the critiques.\nBut Could there be two films called \"Birdman\" and I went to the wrong\ncinema? How could so many critics be so wrong. Pathetic story, in fact\nno story. No resolution to the many silly tangents the film took. Is it\nHollywood trying to be a European film? If so, it failed miserably. And\nI am very annoyed I wasted my precious time and money. The only\nredeeming feature was the acting which was basically very good but that\nis not enough reason to see this film. The interesting point about this\nfilm is there really isn't a 'spoiler'. Nothing could be said to reveal\nany plot, as there really isn't any plot. Two women decide to kiss,\nwhich led nowhere - one addled druggie, been through rehab due to her\nfather telling her she was special as a child, huh? And a ridiculous\nbird hanging around as a superego. Crap!\n"},
{"review": "\nI would like to give it a negative rating, but it is not possible, so\nthere you go. It was by far the most useless, meaningless, depressing\nmovie I've ever seen. It was actually a piece of sh.t. I wasted two\nhours of my time on a 'story' of a schizophrenic character, where the\nstory didn't unfold in any way. In the end he flew out of the window,\nor at least that's what his daughter saw, who - I suppose became also\nschizophrenic or the movie turned into a fantasy movie. The camera\nmovements were very annoying, the whole movie seemed to be shot by a\nsteady-cam, this made you feel claustrophobic. I should have spent this\ntime kissing with my date instead.\n"},
{"review": "\nThis is the first review I am writing, because I could not miss to warn\nothers not to watch this movie. Screening the fact that it is rated\nvery high (no idea why) I have waited long time. It started promising,\nbut after a few minutes it became clear that this movie will not be\ninteresting at all. I give 1 star only because of the performance and\neffort of Keaton and Norton. The rest of the cast was not very\nimpressive. Also irritating was that the whole time the movie is dark,\nmost of the action takes place in the corridors of a very old theatre.\nThey have tried to film the whole thing and have the effect of 1 take\n(1 shot). Complete failure. Horrible movie, avoid and don't waste your\ntime.\n"},
{"review": "\nRegarding the plot: Points at which the movie could have ended still\nhave had some kind of minimal impact:<br><br>1. When he jumped off a building. Man soars/body on ground. Ties up\nloose ends, means something.<br><br>2. Where he shot himself in the head. I would have expected a guy to\ndie here. Also, would have meant something.<br><br>Points at which the movie should not have ended:<br><br>1. When he jumped off a building (again), but his daughters reaction\nsuggested he lived. Cheap, stupid trick. Keeps people guessing, but for\nno good reason.<br><br>Regarding the soundtrack: I don't like constantly adjusting the audio\nto hear whispered dialogue and then not wake everyone up because of\npointless drumming.<br><br>Redeeming qualities: We made caramelized pecans before sitting down to\nwatch this, and they were pretty tasty.\n"},
{"review": "\ni saw this in London, the cinema was 80 percent full at the start of\nthe film, but a short time later it had emptied to about 30%. The film\nhas a very misleading trailer. The only redeeming feature is Emma\nstone's performance. Her rant to her dad in the film is exceptional and\nfull of emotion. Birdman soundtrack is awful at times and off putting.\nSounds like a 3 year old was recorded playing a drum kit throughout all\nthe important dialog. In my opinion this film is too long. Well done\nHollywood for making a trailer look like this could be a good film,\ngreat way to get people into the cinema. This is not a superhero film.\nIt is good to see Michael Keaton on the big screen once more.\n"},
{"review": "\nNot sure what all the fuss was about. Okay The acting is very good, but\nas far as the storyline goes, truly weak. Quite possibly one of the\nworst movies I've ever seen, how can a film so depressing be classed as\na comedy? The most annoying part is the constant drumming throughout.\nEnough to drive the viewer to madness. I was expecting big things from\nthis production, but it has failed in all areas that a good film should\nsucceed in. The funniest part was certainly Edward Norton's boner!\nOther than that my partner and myself found it hard to keep watching\nwithout wishing it Was over. This film seemed almost desperate and\nawkward at the same time.\n"},
{"review": "\nTake a film about actors and then ask the acting fraternity to judge\nit. Of course they loved it as the various characters and their\nvolatile natures are likely to have a part the judges can identify\nwith. For the rest of us it is boring illogical rubbish with only a few\nmoments of relief. Other posts refer to past events in which case\nthis.movie has fallen into the same trap as other currently unfolding\nsagas. Looking at reviews of say Hunger Games the up-ticks and\nfavorable reviews are by people who have read the books. I suppose they\nalso form a genre, that of a ready made fan club. Unfortunately fan\nclubs like to support their own and so the voting is slewed. I am\nbecoming very disillusioned with the voting process. Anyway back to\nbirdman: Edward Norton started very strongly but quickly started to\nwane. Oh dear, was I thinking of Bruce Wayne when I composed that\nsentence? Would that Birdman had something we could connect with. I\nliked the joy on daughters face as presumably she spotted father\nsailing about outside. What else was there? Nothing.\n"},
{"review": "\nHow this two hour drivel won an Oscar is beyond me or in fact any\nnormal person. Birdman is just two hours of pretentious rubbish held\ntogether by strong actors. The plot....there doesn't seem to be one.\nThe point of the film, the interesting bit, again there isn't one.\nWatch this film at your peril, it is 2 hours of your life you won't get\nback. It makes me so mad that films like this even get made, it\nshouldn't have ever got that far, if students in college came up with\nmovies like this they wouldn't pass. The best part of this film is the\nending, after the final credits you won't have to watch anymore of this\ndrivel and that is the best feeling of all!\n"},
{"review": "\n....director seems to be confused ..........it seems that they wanted\nto make a superhero movie but due to lack of money ... they end up\nmaking a bullshit movie........Acting wise OK ..but I would say waste\nof talent.. I had wasted two hours of my life, and . I enjoy the art\nhouse genre that this clearly belongs to...but this one is an\nexception.A bunch of very good actors, all wasted in an indulgent\npretentious script, and even more indulgent and pretentious directing.\nabsolutely stupid plot, that takes ages to go nowhere, a film where the\nfilm maker is saying very loudly and in a very boring way, look how\nclever i am, why this has been praised by critics is beyond me.\nActually to be honest i think they were paid for it.\n"},
{"review": "\nThis was the only one of the contenders for Best Picture I hadn't seen.\nI avoided it because I didn't think I'd like it. But it won and now I\nhave watched it.<br><br>If you think the above is boring, it's no more boring than the movie. I\nhave a confession: I didn't get it. A day in the life of some Broadway\nactors who over-act all the time. Besides being boring, there was a\ndrums only sound track that was was more than boring: It was annoying.\nFinally I want to know how much the tobacco industry paid to have so\nmany cigarettes consumed? This movie was a cigarette commercial in\ndisguise.\n"},
{"review": "\nI gave the picture a 2 out of 10 because it's possible something\ninteresting happened after we left. As a person who has suffered\nthrough some real stinkers, I must admit we couldn't take it and had to\nleave before the end of Birdman just to get some fresh air. The movie\nwas awful - boring indulged people with boring lives. I suppose you\ncould say this was meant to be artsy satire, but there wasn't anything\nto hold this audience. If it indeed was meant to be satirical, I would\nrecommend the writer and director watch Strangelove. Not one character\nhad any depth or interest and the entire story was irrelevant. Norton's\ncharacter spoke and acted like numerous actors from the 1930s -\nexaggerated, artificial and not believable. Why Naomi Watt's agent let\nher \"act\" in this picture is a puzzle to me - it will probably be\ndamaging to her career. I must punish myself for being so stupid as to\nhave been in the audience - perhaps I'll watch some reruns of the\nAcademy Awards.\n"},
{"review": "\nI have long since abandoned any hope that reviews from professional\ncritics will have any relevance to my enjoyment of a film and this is a\ncase in point. <br><br>Forget all the pretentious positive comments, this film is just dull. <br><br>OK, so maybe it was technically clever (I don't know, much less care)\nand maybe the acting was good; but did it accomplish it's whole raison\nd'être, that is: was it entertaining? Certainly not for me It has very\nlittle plot, no humor that I could discern and really very little in\nthe way of entertainment value.<br><br>Pass it by, nothing of interest lies within\n"},
{"review": "\nThis is a movie that tries very hard to be special and unique - which\nit admittedly is, just not in any good way. The increasingly annoying\nnever-ending drum-soundtrack, the lack of any meaningful plot and\nconfusing story, the chalkboard-ish inner voice dialogue of the\nprotagonist, and the just plain bad, nauseatingly egocentric people\ncry-complaining about their ego-\"problems\" that I couldn't care less\nabout. <br><br>About two-thirds into the movie, it had become so excruciatingly\npainful to watch that I was simply forced to leave the cinema,\nsomething I've never done before, or ever thought I'd have to - never\nbefore has the cold fresh winter air felt so good to breathe, like I\nhad just managed to break free from captivity under mentally torturous\nconditions. I'd wish I was exaggerating here, but I'm not.<br><br>The main reason I considered watching this movie was the universal\ncritical appraisal and awards it had won, which I'll never give due\nweight again. Only the somewhat original cinematography prevents me\nfrom giving it a rock bottom 1.\n"},
{"review": "\nwow, i did not see that coming. unfortunately , it's rare to see this\namount of dedication and talent in contemporary mainstream American\ncinema these days. i was expecting a dull drama with good actors and an\nOK script, and i got this: pure , unfiltered , proper effort , applied\nin modern American commercial standards. Alejandro González Iñárritu's\nbrilliant direction creates a mesmerizing blend of genres , it's\ncaptivating from first shot,bittersweet and painfully realistic. made\nwith high technical complexity and deep character study - and with so\nmuch to say about love , art and the the human soul, \"birdman\" is still\ncoherent and crystal clear. great performances by all actors ,Michael\nKeaton is pushing the limits here (in a good way), Emma Stone and Naomi\nWatts are sharp and enigmatic , and Norton is kicking like it's 1999.\nwith an outstanding script to support their performances ,and original\nand intriguing soundtrack. no wonder it's the real deal.a new favorite\nfor me.\n"},
{"review": "\nIs art the only thing one needs to survive. Can someone live on art\nalone. No, not even the best of artists can. Even they need food,\ncasual sex, alcohol and other intoxicants. The story of recovery from a\ndeteriorating career was something which I could personally relate to.\nAnd when at the end of the movie when one feels inspired to recover\nfrom ones own downfalls seeing the amazing recovery of the protagonist,\none can only cry, because it only makes me realize that its just a\nmovie. There is no chance of any recovery in real life for losers who\nhas nothing else to do other than watching cheap porn and pirated\nmovies from the internet. This was an amazing movie. Amazing\npresentation of the imaginary domain, the dreamy world of the artist.\nHis inner conflicts and his constant struggle with the outer world that\nrelies totally on logic and news and money making. The paranoia and\npsychological phenomenon that goes on within the mind of an artist is\npresented beautifully. Enjoyed it.\n"},
{"review": "\nWell this is my first review -since this movie was so bad and still\nrated eight. I simply somehow need to lower the rating. <br><br>Two wasted hours of trash.Do not waste your time on this. May be my\nbrain just isn't capable of getting what the plot was? What a tragedy.\nThe movie is about stupid people getting on with their lives just like\nanybody else. Cant believe all those great actors.My rating was only\nfor the single camera shot.<br><br>This doesn't deserve an Oscar / Oscars has lost the appeal for me. Best\npicture? - disappointing. We don't need anymore of this kind of movies\nplease...\n"},
{"review": "\nI gave the film 1 star as Keaton was actually very good, he played the\ntroubled, failing actor very convincingly. <br><br>The rest of the film lacks any redeemable qualities; you watch the film\nin the hope that you might become attached to any of the characters, so\nthat you care about how the rest of the film turns out (it never\nhappens). None of the characters are nice, good, or relate-able in any\nsense, which sort makes the whole film watching experience an exercise\nin futility. <br><br>If there were any means of claiming time back from a film-\nmaker/production company/director/writer/editor, I would. If you\nhaven't seen this film yet, I congratulate you in not having wasted\nyour time and given money to reward such a horrendously dull story.\n"},
{"review": "\nAnother hallucinating movie with Edward Norton, This Movie is not going\nanywhere, i think a big BELLY FLOP, its like those movies which end\nlike its a big dream (pathetic). The single continuous shooting is\ngreat work, but made me dizzy watching. Maybe a classic in 100 years to\nbe scrutinized for a few good moments. Not worth watching in the cinema\nwait for the DVD rental and by that time there will be a lot of better\nmovies to watch.What else can i write i need 10 lines , some people\nmight give this movie the bird or they might even call it the big bird\nfrom Sesame Street which i think is a much better watch. I think it\nlacked more characters maybe a doctor taking everyone in to psycho ward\nafter all everyone is crazy in the entertainment industry.\n"},
{"review": "\nCinematography was interesting. The long uncut scenes were impressive,\nand probably what held the film together, but the story needed a lot of\nwork. The trailer was misleading and simply was not what I was\nexpecting. I wouldn't waste my time on it if I were you. But this is\nall opinion\u0085check it out yourself if you so dare. Basically its a story\nabout a depressed ex movie star gone theatre who's desperately trying\nto do something with his life but is held back by some serious\npsychological issues. His daughter has daddy issues and his ex wife is\nsomewhere in-between wanting him back and hating him. You can literally\nsit around for a couple hours waiting for this thing to take off\u0085and by\nthe end of the movie\u0085well, I won't spoil that part (hint: it never\ntakes off).\n"},
{"review": "\nThis film can only be described at best as bizarre and at worst as a\nwaste of a watch. Frenetically vacuous and disjointed, I waited\npatiently for a hook, something to develop into a story that had\nmeaning. Ed Norton and Michael Keaton are good actors and I am sure the\n\"lovies\" will tell us we missed the point of the story; \"over the hill\nactor trying to reinvent or justify himself against a barrage of self\ndoubt and delusion...\" but, there are better ways to deliver and this\nvehicle just did not do that. I am sorry but, BAFTA and Oscar\nnominations are not justified. Possibly the least watchable film I have\nseen for many years...\n"},
{"review": "\nThe basis of this movie is a washed up has been who is producing a\nBroadway play. He lives in a delusion filled world of his Keaton own\nmaking where he sees himself with super power of a comic book character\nhe played in his heyday. You find yourself not knowing where the\ndelusion ends and reality if any begins. There is no redeeming\ncharacters in the show. From his daughter a drug addict with a chip on\nher shoulder to Ed Norton stripping and showing us his Auschwitz like\nbody. Ug, an image I wish I could get out of my head. The ending is as\ndumb as an ending could be. So are we to believe he really is soaring\nwith the eagles? LMFAO It was a total waste of time and this movie is\none of those where your not one of the cool liberals if you also don't\nlove it. Its a case of the kings new cloths, its not a good storyline\nand not particularly well done. Norton did well if his aim was to be\nannoying to watch. When you find yourself wishing that there was a\nsniper on the opposite building shooting the characters its a bad\nmovie.\n"},
{"review": "\nKeaton (apart from the wig) is the same over animated twitchy character\nas Bruce Wayne in Batman (1989) Ed Norton as a washed up actor looks\nlike he lives in a gym. The whole thing is overplayed and utterly\nunconvincing.<br><br>The whole thing goes on and on on and on on and on on and on on and on\non and on on and on and on on and on on and on and on on and on on and\nand on and on on and on on and on and on on and on on and frankly gets\nnowhere. <br><br>It's well photographed which is the best I can say for it. <br><br>A waste of two hours of my life.\n"},
{"review": "\nWatched this because HBO had it on as their Saturday night feature. Did\nnot get 15mins into this before i checked out, completely. <br><br>There's a teething 7month old visiting us for the evening, so maybe not\nthe ideal time to put this on. But, honestly, the baby's babbling had\nmore coherence, and was far more entertaining. <br><br>I'm a huge fan of 4 actors in this movie: Michael Keaton, Edward\nNorton, Emma Stone and Naomi Watts, none of that mattered. Surely this\nis not what the director had in mind? Aside from some simplistic\nexplanations about upending Hollywood conventions, what did the\ndirector have in mind for this?\n"},
{"review": "\nGrraraaarrghh watching this piece of feces was like spending the time\nin a lift with a greasy guy with severe halitosis and no concept of\npersonal space who insists on telling you about his mother's ovary\noperation. Oh, and over really loud jazz as elevator music. I have no\nidea why any of the actors agreed to feature in it. I have no idea why\nit won an Oscar - it has \"pretentious sycophantic try-hard\" written on\nit in letters that rival the size of the famous Hollywood sign. The\nwhole project felt like a giant testicle massage to the director and I\nam really, really sorry that we helped deliver it with the money we\npaid for the DVD. Seeing the 7,9 it got here, my faith in humanity\nwavers.\n"},
{"review": "\n1. What was the purpose of this movie ?<br><br>2. No storyline.<br><br>3. Instead of making such horrendous movies, the money involved to make\nsuch movies should use in building homes for homeless, provide food and\nuse in public service.<br><br>4. \"BIRDMAN\" really ? and whats wrong with Oscars ? this stupid movie\ngets an nomination ? for what ? who are the idiots sitting on Oscar\nREVIEW PANEL these days ?<br><br>5. Complete waste of actors, waste of my time, waste of electricity\nwhich was used to show this movie.<br><br>6. And what was that end all about ? <br><br>I just have to warn people out there, please do not watch this stupid\nmovie, actors like ed Norton are wasted can you believe that ? Ed my\ndear why did you do this movie ?<br><br>Michael Keaton i can understand you doing this movie, you are really\nwashed up like the story of this movie.<br><br>Naomi Watts ?? seriously you too ?<br><br>I am having a headache, today on this IMDb Review board I take a oath\nthat i will never watch such waste movies.\n"},
{"review": "\nSo, it was my 78th birthday, my son had come up for the occasion, and\nsuggested we see a movie, specifically, \"Birdman\". In my youth I had a\ndeep passion for comic books. Like the cars of the 40's and 50's, the\ncomic book characters were individual, idiosynchratic and highly\nenjoyable...so what went wrong with \"Birdman\"? Everything!.<br><br>A talented writer creates recognizable characters, people for whom we\nfeel sympathy or empathy. In this film, if you close your eyes, you\ncan't tell who's speaking, and like Rhett Butler, frankly you don't\ngive a damn.The writers seemed to believe that constant, mindless\nprofanity would create viewer interest. Instead,all that puerile use of\ncopulative, sodomistic language numbs the brain.<br><br>I had a dental appointment the next day, and the dentist asked what I\nthought of the movie. My reply...\"I think i just wasted two plus hours\nof my life.\" And at my age it's a helluva loss. In summary, it puzzles\nme that the Academy could find any redeeming qualities in this avian\nmisadventure.\n"},
{"review": "\nHow did this piece of s hit end up getting such a great score is beyond\nme. I did understand the movie but it is a complete mess. It is boring\nand unpleasant to watch. I tried hard to enjoy it but it was impossible\ndue to the fact that the story was oh so very idiotic. This is a\nperfect example of what friends in show business can do for other\nfriends. This movie does not deserve a 2. It is an overrated, most of\nall boring story that does not deserve any praise. Complete waste of\ntime I highly advise you stay away from this movie. As much as I like\nthe actors that played in it - Birdman is a complete letdown and did\nnot meet any of my expectations.\n"},
{"review": "\nA product of a schizophrenic, decaying mind with short sequences of\nexcellent acting... Well, this was all what I had to say but according\nto the IMDb rules, now I will have to write 10+ lanes, so here it goes.\nI was sorry for the great actors who had to participate in this\n\"artistic\" craziness. All characters are just wondering around along\nwith the camera during the movie, seemingly not knowing at all what\nthey should do or say. So most of the time they just say something\nrandomly and act according to that. I was really surprised that it got\nso good reviews. Nevertheless, short sequences are played great e.g.\nEmma Stone with Edward Norton on the balcony. That short sequence alone\nmade me learn Emma Stone's name - she is truly fantastic. Well I hope\nit is already 10 lanes. Why do I have to write 10 lanes minimum anyway?\nThat is as crazy as this movie.\n"},
{"review": "\nHorrible, horrible film, a total POS - how anyone can enjoy this film\nis beyond me. <br><br>A self centered man with psychological problems wants to be a real\nactor and needs to reconnect with his daughter. Another actor steals\nthe limelight. How very original. <br><br>Oh, and they managed to get some twitter and youtube in there to, to\nshow how 'current' they are. Going viral is everything, right?<br><br>People giving this flick high ratings are hipsters that think they 'get\nit' and who are afraid their peers won't like them anymore unless they\nlove this film written and directed by an 'exotic' new voice. Save your\ntime and money and don't see this film! You will regret it if you do.\n"},
{"review": "\nIf you could rate this with a minus I would give it a minus ten. This\nis living proof they should drug test everyone involved in the movie.\nIf they even mention it at the Oscars I'm shutting my TV off. My wife\nwon't even give me the remote for the TV back after making her sit\nthrough that. Where would anybody rate this a comedy. If I missed a\njoke somewhere please let me know. I haven't seen Michael Keaton in\nanything in a long time and now I know why. He's moved right in there\nwith Bruce Willis. A has been.my son says I owe him two hours of his\nlife back.i don't think I have ever seen this many reviews on a single\nmovie. You can see people are a little upset. For this who rated it\ngood your world must be different than mine.\n"},
{"review": "\na movie from Hollywood, for Hollywood itself. never seen such a bad\nmovie at all. getting 5 academy awards just shows how senseless the\nawards are nowadays...<br><br>all the last user reviews on IMDb are like 1 or 2 stars, and still this\nmovie has a 8.1 on IMDb? how the hell is that possible? <br><br>fifty shades of grey was hyped as hell in the media worldwide and has a\n4.1 which may still be too much, but this movie ain't better.<br><br>i don't get why interstellar wasn't nominated for one of the big\nOscars, and the worst thing about the 85. academy awards was that\ninterstellar (hans zimmer) didn't get the best music awards. <br><br>the academy just died in 2015 :/\n"},
{"review": "\nOne of the worst movies i have seen. I thought based on the rating on\nIMDb that this could be a masterpiece, but in the end it turned out to\nbe a disaster. The whole time i was waiting that something will happen,\nbut nothing, it's just bad. The story is just weird and as much as i\nwas trying to force myself to watch this it's just got more and more\nbad. The acting is OK, but the story is just bad. I think many movies\nhave a great score and rating until there are aired, after that all\nfalls apart and everyone get's to know the real rating of a movie.\nMaybe we have not seen the same movie, if other people gave better\nratings then me.\n"},
{"review": "\nAfter reading all the great reviews, I was really looking forward to\nseeing Birdman but I was sorely disappointed. The story doesn't develop\ninto anything particularly interesting and I didn't care what happened\nto any of the vacuous, one-dimensional characters. The lesbian scene is\nthrown in there for no reason at all, Norton's character doesn't\ndevelop enough and we never really find out the background of the\nrelationship between Keaton's character and his wife and daughter (I\ncan't remember any of the character's names, that's how much I cared\nabout them).<br><br>As far as I can see, the reason for the rave reviews must be down to\nthe unique filming technique with all the long takes which is different\nto anything I've seen before, (even though there is more than one\noccasion where somebody fluffs their lines but it was left in the final\ncut anyway), and the acting which, to be fair, is very good. All in\nall, Birdman left me feeling empty. It's self- indulgent, pretentious\nnonsense that doesn't deserve the 5 star reviews it's been getting. Not\nby a long shot.\n"},
{"review": "\nThis movie is essentially Hollywood giving itself one big pat on the\nback. Too bad they had to make viewers sit through two hours of\nclichéd, boring, predictable drudgery to make their point. This is\nbasically the story of a Hollywood actor who is perceived to be the\n\"shallow celebrity\" type proving himself to be a true stage artiste by\ngiving up everything and fully committing himself to his \"craft.\" The\nmovie's filled with self- referential, unfunny inside jokes about the\nfilm industry. The one redeeming aspect was Edward Norton, who was, as\nusual, excellent. The fact that this won \"Best Picture\" only shows how\npathetically desperate for validation the Hollywood elites are.\nCompletely forgettable.\n"},
{"review": "\nMy god, what a piece of junk Hollywood foisted on the general public\nwith this movie. After watching the first 25 minutes of it I realized\nthat I had wasted 30 minutes of my life.<br><br>The movie should have been titled \"The Bird\" because it was so awful.\nOveracting, poor script, and unrealistic dialogue all fitted into the\nformula for this flick. It was Hollywood's overindulgence to itself.<br><br>I am glad Michael Keaton got a chance to star in a movie but his acting\nwas so over the top. And the same applied to Edward Norton, who is a\nnormally a very fine actor.<br><br>I am sure a better movie could have be written about an actor who\nwanted to transition from Comicbook Hero to a dramatic actor. But this\nmovie falls so flat on its face it needs nose surgery.\n"},
{"review": "\nThat it does not come up that ambition. First of all the main character\nis rather uncongenial, a truculent and arrogant man who hostilizes\nalmost everybody often without reason. The story is an acceptable one\nbut not particularly moving or dramatic: an actor who was famous for\nhis role of a comic book character and that now ends his career by\ntrying to put a play on a Broadway theatre stage. In doing this he\nmeets a few obstacles such as a bad relationship with another actor and\nsome unfavourable newspaper critiques. And personally he has got a\nconflict with his daughter. All this is rather ordinary in human terms.\nBesides that he seems to confuse himself with Birdman his former\ncharacter that has made him famous, hearing and listening to his voice.\nThis is a bit inadequate. The movie is nevertheless rather good in\ntechnical cinematographic terms.\n"},
{"review": "\nI'll cut to the chase here. <br><br>The Good <br><br>The acting from some of the players was really quite good. The concept\nand some of the execution was actually quite novel.<br><br>The Bad <br><br>So far up itself that it doesn't realise how pretentious it is.\nMarketed as a film for those who like to think and explore a theme.....\nWrong wrong wrong<br><br>The Ugly <br><br>Slapped the face of anyone who remembers and loves Michael Keaton as\nBatman, Beetlejuice etc. One particular scene towards the end of the\nfilm had me feeling as though I had been slapped in the face. <br><br>The writers had a chance to join the theatre crowds (of which I have\nbeen apart of in my younger days) and the movie crowds, but instead\nthey drove a spiteful stake through the two. Theatre people aren't all\npretentious knobs and movie lovers aren't all ignorant fools. What a\nshame.\n"},
{"review": "\nI don't go to the movies often and on my birthday November 2014 saw\nthis load of crap with my boyfriend. I didn't see any trailers\nbeforehand and only based my decision on the reviews. I now realize\nthat critics have no idea what they are talking about, at least when it\ncomes to knowing what the masses would like. Everything annoyed me: the\ndrum track, lack of action or plot, the fact that good actors were in\nit yet it was still so terrible...i could go on but you guys get it. I\nmean, even the humor of it i didn't get.Clearly it is a nod to the film\nindustry but because i am not part of that circle i had no idea what\nthe heck was giubgoing on. I would rather watch a 2 hour loop of 2\ngirls 1 cup and w all know how bad that was.\n"},
{"review": "\nI give a 2 because the actors did a good job. But the story was\nhorrible. The directing was like someone trying to be super Hollywood\ncool. If your not one of them you will hate this movie. The great\nreviews remind me of people laughing and clapping at their own home\nvacation movies and then wondering why their company isn't entertained.\nI don't review movies, but with so many of the fake raves here with\nthem patting themselves on the back, I felt I had to add another to the\ntruth of have mediocre this movies really is. The acting is fine and\nreally good in some of it, but good acting isn't enough to make this\nmovie work.\n"},
{"review": "\nFor the first 20 minutes i was just bored, half-way through the film I\nwas already wondering if something good would finally happen and how\ncould this get an Oscar, i don't mind if this film is art, or a satire\nof the status quo of movies or whatever. This is boring. It's the first\nreview I ever made on this site, just to warn you to not waste 2 hours\non this. Critics are all mad, never trust them. I don't even need 10\nlines to explain it, but as IMDb forces me, I'll just write some more.\nIf you want some good Oscar candidates try Hotel Budapest or Imitation\nGame, I'm not a movie expert but they seemed like a hundred times more\nworthy of my time.\n"},
{"review": "\nThe music alone (some drums from beginning to end) is the the most\nirritating and quasi in film history. The movie isn't actually a movie\nit's more like a boring theater piece. By the way the movie is almost\nin one location the whole movie, and that is almost always a bad thing.\nSo what is the movie a about? It's about a washed up movie-star who\ntries to make it in the theater. And he is \"haunted\" by his superhero\npast. He has not been a good father and he has money problems. Boring\nconcept and a boring movie. This movie is only for political correct\nOscar critics. Stay away, this is only for people who like quasi\noveracting theater\n"},
{"review": "\nThis movie sucked!!!<br><br>How this got an Academy Award i have no idea, maybe it was keaton's\nturn or something.<br><br>Took me 4 times to see the movie the whole way through and even then, i\nregretted it. Lame humor and over acting. I do get satire, but this was\njust a poor attempt at it.<br><br>Great actors, wrong film for them. Really a B grade movie with a great\ncast. Even with the cast, they couldn't save the movie.<br><br>There are better forms of torture then having to watch this drivel\nagain.<br><br>Wouldn't recommend it to anyone\n"},
{"review": "\nWhat were the Academy's guys thinking? I need to admit that I've been\nfrustrated with the nominations from the last year. \"It couldn't be\nmore ridiculous\" - I thought. Until: Birdman, the Best Motion Picture\nof the Year.<br><br>The story is nice. The main idea, at least. It turns around a decadent\nex-superhero from an oldie 90's movie. He just wants the fame and the\nglory back. But now (present day) he's working on another trade of\nperforming arts: a dramatical play based on a classic Raymond Carver's\nbook. The actors are great. With the highlights pointed on Michael\nKeaton, he has gathered all of his best and put on this movie. You can\nsee a great acting from Edward Norton, Emma Stone and Naomi Watts too.\nActually, it's what really saves the movie from trash. The story,\nunfortunately, has some evident holes and, of course, no one in their\nright mind would give a Best Motion Picture's Oscar to this movie. That\nwould be, at least, insane. Is a shame that the story has been\ndeveloped so badly. It could be better.\n"},
{"review": "\nA once-famous movie star is trying to regain recognition by adapting,\ndirecting and acting in a theater play.<br><br>The entire movie is made up of very long continuous scenes, stitched\ntogether seamlessly.<br><br>I think Alejandro Gonzalez Inarritu is overrated. I saw 4 of his\nprevious movies and they were OK (I rated them between 5/10 and 7/10),\nbut not nearly as amazing as people make them. Still, I had very high\nhopes from this movie, after all the reviews and award nominations.<br><br>Well, I'm disappointed. I felt very disconnected from the characters,\nfelt nothing much is happening in the movie and wasn't too impressed by\nthe acting.\n"},
{"review": "\nI guess if this was the best movie of 2014, then there were a lot of\nreally rotten movies that year. It's not funny, it's not clever, it's\nfull of characters that I wouldn't want to be in the same room with. If\nI could give a zero, I would.<br><br>Other reviews say that this was supposed to show the hollowness of\nHollywood, or some comment on fame but just about everybody in the\nmovie is a jerk. I guess Hollywood insiders maybe really do see their\nfellow workers and competitors this way so that makes them more likely\nto vote this lousy movie up. Other reviews say it's satire. The\nwriter(s) sure are no Jonathon Swift. Save yourself the two hours.\nWatch something else.\n"},
{"review": "\nThis film is a load of rubbish. I lost interest in the first five\nminutes and only stuck with it because it won Best Picture Oscar. I\nhoped that it would improve but it actually got worse the longer it\nwent on. This is the type of film that makes one think \"what was the\npoint, why did anybody think that this was worth making\". None of the\ncharacters were worth getting to know and I didn't care what happened\nto any of them. I've watched a lot of Oscar winning films, some where\nexcellent and definitely deserved the Oscars but others, like this one,\nmakes one wonder who is on the voting panel and what agenda are they\nfollowing in voting for this type of rubbish. I think that this is\npossibly the worst Oscar winning film that I have ever seen.\n"},
{"review": "\nWhere do I even begin. The whole movie tries to be artsy and\nintellectual and push the envelope but it fails miserably. I was\nsurprised by the number of A list actors in this but that's about all I\nwas surprised with. The movie is about a washed up actor who tries to\nreignite his career by putting on a Broadway play. I think he hears\nvoices because his old movie posters are talking to him and for some\nreason thinks he has super powers. During the process of putting on the\nplay, he fights with everyone on set. The play ends up being a big hit,\nand the movie ends with him flying around the city like a superhero.\nWhat?! Just what!? The ending makes no sense. So he is a super hero\nlike he played in his movies? Or just a crazy washed up actor? And is\nevery actor really as ostentatious as they appear to be in this movie?\n"},
{"review": "\nSome morbid curiosity made me watch this film to the end. In summary, I\nhated this film. I understand that it's considered a triumph in film\nart plus I'm a fan of the actors however the story is bland, depressing\nand sadly stupid. To me it was a mismatch of great actors acting out\nbad lines in a contrived environment. Don't waste your time people, the\nmovie will leave you depressed. I wanted to stop watching so many\ntimes. The final gun shot to the head scene was totally amateur and I\nwould have preferred him to succeed. The tone of the movie was mean and\nharsh and reflected the worst side of American culture with its\nrelentless pressure to be the best. I don't understand why such\npolished actors would want to be associated with this crap.\n"},
{"review": "\nI love Michael Keaton and the acting was good but....UGH. To me a movie\nis supposed to be a short escape from reality; not an act of torture.\nThe movie was so sluggish it just wears you down, you keep waiting for\nsomething to happen but it never does. The cinematography was good, but\nthere should be more to a movie than that, and a characters self\nobsession. If it is going to be about a characters self obsession at\nleast make it something interesting. I can't say that I'm sorry I\nwatched it, because I love movies and wanted to see what all the hubbub\nwas about. Why does it always seem though that whenever a movie gets\nlots of critical praise that you should turn and run the other way.\n"},
{"review": "\nI have no clue, if it is just me or what! but this movie is extremely\noverrated! The story is just as bad as the play, they are trying to\nact. The major theme of repetition is plain boring! like okay we got\nthat the man is mentally disturbed, having seen him do it every scene\nis frustrating! Casting was also a major failure Emma Stone is a great\nactress and should have never been in this role! Edward Norton, as\nalways amazing, bringing the best of this side character. In my\nopinion, this can be summarized into a short movie of less than an hour\nand it still wouldn't matter.. So plain and without a story, also\ndefinitely does not leave you off thinking about anything.\n"},
{"review": "\nSo boring, i couldn't grow to care even a little for the characters and\nI didn't care what happened to them at the end.<br><br>Best movie of the year? More like worst movie of the year.<br><br>I actually couldn't even force myself to watch the end.<br><br>I had to come back another day to watch the end and it was still\nrubbish. <br><br>So disappointed when movies are meant to be amazing and turn out like\nthis.<br><br>None of the performances were Oscar worthy. <br><br>Don't waste your time watching it, it's hours you will never get\nback...\n"},
{"review": "\nIt is not the actors in this film, it is the story line. The plot is\nvague leaving the viewer to try to figure out who holds what function\nin the film. It seems clear that the viewers in the theater are just as\nperplexed as they observe unchecked anger and frustration, and foul\nlanguage and behavior on stage. I did not watch the entire film. It is\nnot worth my time - sad for I like the actors that played in it; and\nsadder still that the characters did not honor an industry. That the\nindustry sometimes includes arrogant and disappointed, yet sensitive\nand talented individuals whose hormones are out of control, whose\nemotions are out of check and whose language belongs to the gutter does\nnot justify such a poorly written plot. It is an insult against those\nwho are professional about their work and who would not lower\nthemselves to such a poorly written film script.\n"},
{"review": "\nall though the idea of a whole movie in one shot is a nice concept, it\npersonally made me sick to my stomach. my family was only able to stand\n30 min of it, i watched the whole thing hoping the movie might redeem\nit's self with a good ending. unfortunately it was crap. a great cast\nwasted their efforts on a terrible film. <br><br>the other movies of 2014 that were nominated were far better. DO NOT\nWASTE YOUR TIME OR MONEY!<br><br>i created a profile on here just to say how terrible this movie was.\nGrand Budapest was hilarious and great American sniper was a great\nstory that Clint Eastwood really put his soul into. politically i do\nnot see what people have a problem with. it brought to light the\neffects of war on a man. imitation game was much better as was unbroken\ni hope this is ten lines of text and i hope i prevents people from\nwatching it garbage\n"},
{"review": "\nwell, after seeing the movie winning all those awards you have to watch\nit, but somehow i realized i was in front of one of the worst movies\ni've ever seen. Birdman was a hero and he is now struggling to get a\nwarm place in Broadway, who give a single f*** about Birdman? well some\nmight say losers fight their way to success, but in this movie the main\ncharacter was even a big loser in the end of the movie so what 's the\npoint of the movie ? someone who was nobody and he is still nobody?<br><br>Edward Norton is one of the greatest movies actor, still his presence\nin this movie didn't change anything, Emma Stone also, its like they\nwasn't there.<br><br>I've read some of the positive reviews to understand the movie, still i\ndon't see what the point of this movie, to be honest Hollywood f****ed\nup big time in this movie, i miss those days when all Oscar's nominees\nwas worth wining the award, back when Gladiator won several awards and\nwon our hearts too, back when American gangster didn't won a single\nOscar but became one of the greatest movies of all time\n"},
{"review": "\nThere was nothing interesting and nothing funny. Its a bad movie about\na bad actors life. Its like watching a movie about a McDonalds fry cook\ntrying to move up to running a cash register. And how he misses his\ndays at Burger King. No sex. No comedy. No killing. No car chases.\nNOTHING. A complete waste of time. What idiots voted this movie for an\nacademy award? Other actors of course. Who cares.<br><br>Aren't movies supposed to be interesting?<br><br>Anything on the Discovery Channel, History Channel, or Golf, or\nWrestling is way more interesting. Watching my dog sleep is more\ninteresting that this waste of time. I watched the whole thing and I\ndon't understand what happened at the end. Nothing ironic, nothing\nsurprising. I waited the whole movie for something interesting to\nhappen, the best part was the advertisements before the movie.\n"},
{"review": "\nThis movie is a total disappointment! Really! I think it is meant to be\na \"poetic irony\" but no, not for the audience. Only Hollywood people\ncould get it or care it. Me, an audience no, to me this so-called irony\nis a perfectly kept secret. Hollywood criticizes Hollywood, so what? I\nreally don't care. Because it makes it for themselves, it doesn't\ninvolve me!! Sorry not sorry for you!! Please next time, don't call it\n\"a movie\", just call it \"a documentary\" and only the interested people\nwill watch it. Not me, someone who expects to watch a good,\nentertaining and meaningful \"movie\". And that cinematography tricks,\nyes you are sooo clever sir, yeah!! But also boring, OK? My the one and\nthe only point is for the good acting.\n"},
{"review": "\nThis has to be one of the worst films I have ever laid my eyes on, I\ndon't understand how it can get a 7.9/10 when films I've loved have got\n6/10. From what I can see, most people found this film to be a 1/10.\nThe acting was great but that doesn't make up for how unbelievably\nboring this film is. I was going to write a well though out review but\nthis film makes me want to cry at how boring it is. There's no other\nword but boring to describe this film.(I do understand the plot and\nmeaning but what's the point in writing about it. It's just too boring\nto write about.) If you want to watch a 2hr film watch Predestination.\n12 Years a Slave, Whiplash, Blow. I don't care as long as it's not this\nfilm.\n"},
{"review": "\nTypical of recent years, here's another film up it's own arse. Annoying\nself-analysing characters who think the world revolves around them (ala\nsilver lining playbore), pretentious jazz - this a movie that only\nAmericans would think was good. Utter self absorbed mince. IMDb is in\nneed of a filter on ratings now to eliminate nonsense bias. A 'whats\nthe rating of this film amongst educated non Americans' would be\ninteresting to see. As would a 'whats the rating of say, Maze Runner if\nwe filter out anyone under the age of 20'. But lately there's been a\nreal problem with Hollywood thinking they are more than mind numbing\nblockbusters - you are not guys. sorry. leave real film making to other\ncountries and concentrate on REAL super hero movies.\n"},
{"review": "\nI hated this movie so much it inspired me to write my first IMDb\nreview. If you have not yet watched this movie, do yourself a favor and\ndon't watch it. <br><br>The pretentiousness of the film is offensive. There was some quality in\nthe acting and the score was innovative but got old quickly. Any of the\nthings that were potentially good about the film were utterly wasted on\na pathetic story and characters I couldn't care less about. I kept\nwaiting for something to happen and redeem the film but when it was all\nover I just felt like I had been covertly forced to read People\nmagazine for two hours after avoiding it my entire life.<br><br>Best picture? I feel bad for the previous best picture winners\n(excluding 2002 winner Chicago) to be placed in the same category with\nthis rubbish.\n"},
{"review": "\nI watched Birdman last evening, and I thought it was terrible after\nhaving watched it. To be fair, though, I then rented the movie and\nwatched it again today. It is still a poor excuse of a move, in my\nopinion.<br><br>Sorry, but it's still terrible. I don't know what the Academy was\nthinking. It is genuinely an awful movie. Bad story-line,\nless-than-stellar performances from the actors. <br><br>All-in-all, this is an awful movie. Period.<br><br>Frankly, it's just not worthy of any awards given to the movie by the\nAcademy.<br><br>===================<br><br>EDIT: Apparently I'm not allowed to be brief and succinct. IMDb\nrequires me to post more commentary before they will accept my post.\n"},
{"review": "\nI would actually rate this disappointing Oscar winner 3 (out of 19),\nbut to counteract its over-popularity, I would rather rate it 1.<br><br>I was, once again, fooled by Oscar Academy to trust its Winner of the\nYear! I had a hard time pulling myself out of the shame I gained after\nI took my wife to the movies for this awful film. These days' scar\njudges seem to have become well self-absorbed by granting this film\nawards. There is whole world to make good films, yet Oscar prefers to\nlook at its own reflection in the mirror.<br><br>I did not enjoy the acting, the lighting, or the music. Some visual\neffects were not as bad, though.\n"},
{"review": "\nBoring, awful. <br><br>My wife and I are moviegoers since 1950s and fans of many classic\nactors and movies. We also love the theater and have seen Yul Brynner,\nLauren Bacall, and many others in live performances at Pantages Theater\nin Los Angeles. We have been to London and seen Shakespeare's As You\nLike It at the Globe theater. <br><br>We are old. We know quality. <br><br>Birdman, sadly, is possibly the worst movie we have ever seen. <br><br>We loved Michael Keaton in Beetlejuice but who cares about him or any\nof the other characters in this slow, shallow, Flop. We were almost\nhalfway through the movie and pulled the plug. Major disappointment of\nour evening. Good thing we watched on our streaming TV at home and not\nat the theater. <br><br>Dare I say it??? Worse than \"The Happening!\" <br><br>Many Academy Award Movies are worthy. This one is garbage. It spoiled\nour evening.\n"},
{"review": "\nRight, i went to watch this film because IMDb gave it a rating of 8.2.<br><br>Seriously!! Halfway through the film, once i had come to the conclusion\nthat this was a piece of pretentious, self-indulgent tripe i had a\nproper look at the IMDb user reviews. The vast majority of these were 3\nor under. How has this film got an 8.2?? I can't do maths but i know\nenough to figure out this ain't an 8.2!! Just because a film tries to\nbe different doesn't mean it's good. The camera-work - one long take -\nwhatever, it makes you feel seasick half the time. The music - wow!! A\ndrum!! - Just amazing, so minimalist man. Pretensious nonsense, no\npurpose to it at all. The acting, so/so but mostly ugh! Im annoyed that\nthis has been judged as an 8.2 on IMDb or maybe that rating has as much\na grip on reality as this film\n"},
{"review": "\nWhat a waste of money and time this movie is ,why would some one in\nright mind want to waste 1.59 hours of human history for this pile of\nutter rubbish I could not find answer for it . Movie start form one\nnecked person sitting on thin air and end at he looking at thin air out\nside the window . Concern father telling off his daughter that cannabis\nis bad for you blahhh blaahh than start smoking left over from his\ndaughter . Gay making out with birdman's daughter and he is on stage\nperforming as well same time ? From today on words all people who were\ninvolve making this movie ever appear in any movie I know what to do\nnext .\n"},
{"review": "\nI am not going to lie, this movie is really weird, but not a bad type\nof weird, nor a strange one, it is a weird masterpiece. <br><br>This movie has nothing to do with anything I had seen before, the way\nit was recorded, the post-production, and the reason why this is in my\ntop 5 movies: It was recorded in the same building.<br><br>I love photography and paintings, this masterpiece offers a point of\nview that I had never seen before.<br><br>If you like to see something different, go on, and hit the play button.<br><br>One final thing, everyone knows about the lack of inspiration and\noriginality that Hollywood suffers from, that is why Iñarritu, offer\nsomething unique and stunning.<br><br>I would love to see how this director does in future years, but\nremember this, we will hear great things from him.<br><br>Thanks for reading my opinion, and remember, the weird might be the new\nblack.<br><br>Carlos Pinedo Texidor. Madrid, Spain 2016\n"},
{"review": "\nThis movie is a twisted emulation of \"nouvelle vague\" films, created by\na wannabe director whose pretentious tones made this movie even more\nridiculous than its premise which is basically to criticize the modern\nentertainment film industry, which we know is fairly well known by its\nexcesses.<br><br>The director aimed to emulate one shooting type of film perhaps to make\na homage to Goddard's mannerisms( or should I say inflated ego ?) and\npreference for unsteady cameras. The dialog between characters are\nutterly boring and lack cohesion and make abusive use of improvisation,\nafter all, a film is a project of real life.<br><br>For those that enjoy the uttermost boring and insipid type of story\ntelling, a.k.a modern pseudo-artsy which is promoted by independent\nfilm producers this is a rattling must see film which is only saved by\ngood actors- all of them - and the percussive soundtrack which succeeds\nas a art product to be applauded at least.\n"},
{"review": "\nPeople are easily impressionable. All you need to do sometimes is come\nup with lots of flash, even if the substance doesn't follow. The cast\nis good, and seeing Keaton again, a quite particular actor, playing a\nlead role in a major production is very endearing. Emma Stone plays\nvery well, surprisingly. The cast is globally strong, with Norton and\nWatts, two very good actors, as mere seconds here. Technically, the\ncinematography is very detailed and constantly sought after, and\nunfortunately that's where all the people fall into the obvious trap.\nThe film has substance, but not a whole lot, not anything that hasn't\nbeen done a bunch of times before, and although it makes for a good\nviewing, the absence of a strong morality or even conclusion at all\nsinks this one. It's a fine, eventful movie, but it's not even close to\nmasterpiece territory like lots are implying or outright saying. And\nthe ending tries hard to be poetically abstract but really doesn't mean\nmuch (AND is taken from another film).\n"},
{"review": "\nI wanted to see what all of the hype was about. So I finally sat down\nto watch it last night. I made it thru an entire (20 minutes) before\nturning it off. I am a big fan of both Michael Keaton and Edward\nNorton. I have seen a lot of movies that were considered (out of the\nbox, not mainstream, artsy). <br><br>In fact I own quite a few. But this movie just seemed weird, the plot\n(was there even a plot? lol ) felt disconnected and It was dry and\nboring. At least most of the movies that have been Oscar winners had a\ngreat story, characters, or something to keep you interested.<br><br>This movie had nothing to justify me wasting 2 hours of my life. So I\nbailed after 20 minutes in. Cant even believe this is the same guy who\ndid \"Revenant\". He must have been smoking crack when he made this!\nCompared to this Birdpoop of a movie the Revenant is a masterpiece!\n"},
{"review": "\nBirdman is a powerhouse of cinema. Throwing away the commentary on\ncritics and the movie industry and artistic integrity; it's still a\nlive, thriving beast that has so much unpredictability in every scene.\nIt has raw, powerful, career-defining performances, ridiculously\nimpressive camera-work, surrealistic cinematography and an always\ninvolving story that gives the film ground even with it's surrealistic\nmoments (something the Tree of Life lacked a bit). You can just feel\nthe energy, the tension, and the off-beat score drum score is\nimpeccable. Anyway that's all I have to say about Birdman. It's my 2nd\nfavourite film of all time (after Synecdoche, New York) and the only\nproblem with this film is that it's too big, too alive to watch on a\nnormal television screen. Honestly, it's not Gravity, Avatar or even\nIntestellar. This is the definitive cinema experience. 10/10\n"},
{"review": "\nHow did this movie get made? Why did this movie get made? And by\nBahamut's Blazing Ball-sack, how did it win an Oscar? (OK, I know that\none: industry politics.) Well, after all the hype, I can honestly say\n\"What the Hell was that\"? Whatever it was, it was not in any way good.\nIt felt like a sophomoric attempt to be meta, which the actors giving\ntheir lines like they're trying to project in a play, but it didn't\nwork. Honestly, I think I'd have preferred to watch the Birdman TV show\nor movies or whatever, because frankly, even the worst, cheesiest\nsuper-hero show is better than this pseudo-intellectual poser crap.\nTwitter and Facebook are somehow important or relevant? Puh-lease!\nWaste of time and talented actors. Can't imagine what the target\naudience for this was. In fact, I'm not sure the director or writer\nbothered to come up with a target audience at all, aside from\nthemselves. Basically, if you like watching actors bitch and snipe at\neach other, it might be interesting. I don't, so it wasn't.\n"},
{"review": "\nBirdman is a one of a kind film which has received amounts of hype last\nyear regarding it's Oscar wins and nominations. It's a film littered\nwith passably amusing industry in-jokes designed to appeal only to\nmiddle-aged failures \u0096 which may explain why critics are so in love\nwith it. Birdman stars Michael Keaton, who once starred as Batman, is\npretty much playing himself, as is Norton who's known as a notoriously\ndifficult actor to work with. There are also some amusing, or glib,\nremarks about social media, the cluelessness of critics and our\nobsession with superhero movies. Meanwhile, the director shows off by\nmaking the entire film look as if it was shot in one enormous take.\n"},
{"review": "\nAlejandro González Iñárritu, the director, who happens to be a Mexican,\nshows too much of his racial complex in the opening scenes of the\nmovie. <br><br>I mean, one of the female characters in the opening scenes exclaims \"it\nsmells like Kimchee\" on how some flower smells..... of all places at a\nflower shop owned/operated by a Korean (Everybody these days knows\nKinchee is the name for the Korean-style national dish cabbage pickle)!\nSo Gonzalez's 'Mexican Greaseball' complex ends up compensated in such\na dastardly way...'deflection of his own racial complex to some other\nethnicity\".....eh? It's simply unbelievable. <br><br>I am telling you, grease is much more unhealthy for your health than\npickled cabbage.\n"},
{"review": "\nAfter seeing that Birdman won the Academy Award for Best Picture, I was\nlooking forward to watching it. About halfway through watching the\nmovie, I turned it off. My wife and I were both very disappointed in\nthe movie. It was filled with offensive language and was very confusing\nand hard to follow. I later watched the remainder of the movie and\nnothing changed. I just did not like or enjoy that movie. I can see\nwhere someone associated with acting, the theater or plays would enjoy\nthe movie. But to everyone else, it is not an enjoyable movie to watch.\nI will agree the acting was good and is the only reason why I gave it a\nrating of 4. From an enjoyment standpoint, my rating would have been\nmuch lower.\n"},
{"review": "\nThis kind of self absorbed tripe is so typical of Hollywood. \"What We\nTalk About When We Talk About Love\" was used in the most pathetic\nsense. Yes, Raymond Carver was a drunk. Yes, Raymond Carver had hurtful\nrelationships. To try to use Raymond Carver's pain and self loathing to\ntell a story of a half baked actor? An actor that played to a 6 year\nold's idea of a super hero back in the day and then the actor wants to\nget serious? Wow! Really? Since when does American Literature deserve\nto be treated this way? Is this someones moronic idea of what was going\non in the mind of Raymond Carver when he wrote the story? And this won\nacademy awards? Why do the pretentious, overpaid morons in LA wonder\nwhy anyone other than the 14 to 25 age set of males in this country pay\nto see the crap they put out like this? Oh, that's right, they don't\nwonder. They pander to it.\n"},
{"review": "\nI have never written a review of any kind before, but after wasting 119\nminutes of my life on this garbage, I feel I owe it to people to warn\nthem about this film. This is one of the worst movies I have ever seen\nin my life. This is right up there with Catwoman, only I was lucky\nenough to fall asleep during that.<br><br>I rented it and I feel like I would have been better off giving my\n$2.00 to the Westboro Baptist church so they could come picket at my\nwedding. I feel bad for all those actors who worked hard at trying to\nmake this watchable. You could tell they gave as good as they could but\neven this star filled cast could not save this movie from being a bomb. <br><br>How this trash won the Best Picture? Did the Academy even see the film?\nor just took one look at the cast and figured it just could not be such\na perplexedly mediocre film, and gave it to them?<br><br>Save your money. This movie is awful.\n"},
{"review": "\nThe script for the movie was boring though the plot and setting were\npromising. Ed Norton and Brittany Murphy have had more challenging\nroles. Zach is always meddlesome and less verbose. If there was a set\nof scenes cut together from someone's GoPro backstage in Broadway, then\nthe result may have been just as boring and more real. The internal\ninsanity of the main character could have had more emotion. Flirting\nbetween Ed Norton and Brittany Murphy's character started dull.\nInternal narratives during the drama gave the audience insight into the\ncharacters' thoughts. This kind of intimacy brought out a whole\ndimension which reduced the nearly documentary feel and abstraction.\nKnowing the thoughts in some of the other characters during certain\nstages of the movie would have been engaging.\n"},
{"review": "\nI did not understand it, that's the truth. I did not understand the\nstory, the dialogs the plot, nor the purpose of the characters that\ninteract ERRATICALLY without consistency in this film. <br><br>May be very artistic and surely each scene can have a profound and\ninterpretive background rich in literary elements of which only\nunderstand the critics who gave it an Academy award. <br><br>Maybe I am part of a bunch of people who may have not the intellectual\nlevel to really enjoy of a film like that, but on the other hand, can\nbe a smug and pseudointellectual work done to be glorified and be\npraised by the \"experts\". <br><br>Anyway, I would not recommend it and I think it is overrated.\n"},
{"review": "\nI really wanted to like this film but I personally found it incredibly\nannoying and pretentious. None of the characters were particularly\nrelatable or likable in my opinion and the dialogue just felt forced\nthroughout and not up to par for such a superb ensemble cast. The\nrelentless jazz drum soundtrack was simply off-putting and distracting\nin my opinion, and while the camera work is impressive the narrative\ndidn't have the same momentum. I walked out near the end as I couldn't\ntake it anymore. I'd love to see what other people see in this, but I\nfeel mislead by the reviews and don't agree at all with critics\npraising this film ad-nauseam. Great cast and interesting visuals\nwasted on overwritten dialogue, unrealistic characters and a dull\nnarrative, and I know my opinion isn't the popular one but I wish I\nhadn't wasted my time watching this.\n"},
{"review": "\nI did not understand what this movie was about. But I guess that is how\nart films are supposed to be. Knowing that, I switch off my analytical\nbrain while watching art movies, and try to just enjoy whatever I see\nand hear. In this movie there are a bunch of characters doing strange\nthings for reasons known only to them. The eccentricity of Ed Norton\nwas funny, it was entertaining. Other than that, I did not like any\ncharacter. The scene with Keaton running around in underwear was funny.\nMore people should have been running around naked to make the movie\nmore entertaining. Other that that, there was nothing much funny about\nthe movie. Towards the end keaton tries to commit suicide. I got\nexcited about that, but was disappointed soon to find out that he was\nstill alive. I would have liked more people to die miserable deaths in\nthe movie, that would have made a better art movie. But anyway, thanks\nfor the inane effort.\n"},
{"review": "\nCreated this account just to save others from the fate of being lured\nin by some good acting to expect some depth of art or story or meaning.\nThis film is just an endless bit of angst. Sat through it expecting it\nto go somewhere. Definitely one of the worst films I've seen. 'Into the\nwoods' was worse but its a close thing. This is not art but it kind of\nlooks like art. Really annoys me that I wasted a couple of hours on\nthis. You actually have to write 10 lines of text to submit a review\nbut its difficult to say more on this as it was just really very\ndisappointing. In summary: Angst, inner self talk, more angst, some\nnakedness. Acting was good.\n"},
{"review": "\nMuch of the low reviews already hit on most of the painful points of\nthis movie, but I will summarize it as such:<br><br>Michael Keaton in a midlife crisis, playing himself whom is a\nschizophrenic actor playing himself in a midlife crisis. This takes a\nwhole new low to Hollywood narcissistic egotism and was disgusting to\nwatch. The entire plot could easily be guessed within the first 5\nminutes.<br><br>In case it wasn't enough to entirely feed off the system of Hollywood\negotism, the director leaves a \"surprise ending\" which is supposed to\nleave you hanging. It is a pathetic cheap trick playing off the idea\nportrayed against the common media's reflection of Hollywood hogwash\nthat is commonly prodded throughout the movie. What I can't comprehend,\nhowever, is how the critics are so acceptable of this continual\nprodding as an acceptable movie plot. It it is obvious that they are\ntrying to capitalize on the same shallow efforts Michael Keaton was\nattempting in this film. Unfortunately, it doesn't appear that they are\nsure whether they are the cat or the mouse...\n"},
{"review": "\nThis film truly was awful. I was keen to see it, but within 30 minutes,\nI debated whether I should turn it off or keep going. I chose the\nlatter and it will be a decision I regret for some time.<br><br>Michael Keaton was fairly good, as was Ed Norton. But their characters\nwere neither likable nor multi-faceted. Somehow this film feels like it\nwould find favour amongst US actors who have been on the Broadway\ncircuit and foolishly believe that there is such thing as a \"New York\nstate of mind.\" It tries to deal with some interesting themes -\n'feelings of irrelevance as we age' being the main one. However it\ndoesn't flesh it out enough and keeps interrupting itself with these\nstupid injections of his superhero character from yesteryear.<br><br>The only advice I have is this: if you feel like turning it off 30 mins\nin, go ahead and do so. It doesn't hit any great heights and is\nmore-or-less the same style and feel the whole way through.\n"},
{"review": "\nWhy is there not a score for lower than 1. This movie does not deserve\n1/10. It deserves 0. I've watched more exciting test cards than this\nawful garbage. How can you write 10 lines about this rubbish? Boring\nCould be made to last 5 minutes Torture It doesn't get better. Awful\nthe best part of the movie was the closing credits. Why is there not a\nscore for lower than 1. This movie does not deserve 1/10. It deserves\n0. I've watched more exciting test cards than this awful garbage. How\ncan you write 10 lines about this rubbish? Boring Could be made to last\n5 minutes Torture It doesn't get better. Awful the best part of the\nmovie was the closing credits.\n"},
{"review": "\nFirst came Interstellar. I waited for that movie more than a year and a\nhalf. Outcome was disturbing.<br><br>After that I convinced my wife that Birdman would be a perfect movie to\nsee. Unlikely, it was really a waste of our precious time as a couple\nwith a newborn.<br><br>The plot looks interesting at first. I gave a point for that. Having\nMr. Norton in the list is another point for the film.<br><br>But the way it explains itself is somehow jaded. Script has no depth\ncompared to expectations. Switches between real life and fantasy looks\ncompletely bad.\n"},
{"review": "\nI just opened this account in solidarity with another reviewer who did\nthe same. This movie is so truly awful and depressing. Its not that the\nsubject matter makes you feel depressed but rather having wasted a part\nof your life giving credit to the film. In the movie actors rant\nagainst critics. This movie uses the characters to tell you how\nartistic and important the movie itself is. And by doing that dares\ncritics to criticize it. I think that's why it got so many positive\nprofessional reviews. Like loving a hideous handbag with a designer\nname. None of the characters are likable. The movie has no real plot or\npoint. Its not smart. And when you finally get to the end and are ready\nfor it to just be over there is one final huge eye roll.If this is all\nthe redbox has to offer just wait until next week.\n"},
{"review": "\nBirdman...what an incredibly action title. The fist time i saw the\ntrailer i imagined iron birds crawling and swarming the city of NY\nwhile soldiers in black hawk try hunting them down alongside the main\ncharacter dressed in a Birdman costume. I can understand the fact that\nthe movie needed publicity thats why it displayed the trailer to be an\naction genre meanwhile 99% of the movie is drama. I least expected such\nfrom an artistic company. I could relate with the movie on the theater\nangle because i am a lover of stage play. Although i kept wondering did\nthe director playback the movie before hitting the marketers? The\nsoundtrack didn't go well with the movie at some point...like the drums\nover shadowing their speech. I believe if they really wanted to achieve\nthat image they desired, they should have changed the title or rather\nadd some proper action.\n"},
{"review": "\nWhat a horrible movie, BUT the title fits best 'The Unexpected Virtue\nof Ignorance', because that is what the viewer received.<br><br>The Story shows that Woody Allen Movies still seem to have a comeback,\neven the acting reminds me of a good Woody Allen Movie, which means,\nits beyond bad.<br><br>Even trying to get into the mood and into the Characters, I struggled\nwith a simple question: What is the point?<br><br>So I finished the movie, yet the Story turns, if you call it a turn,\ninto Hello Gabriel, hell even the Movie Michael had a cinematic power\nline, yet, no.<br><br>I still have to say, that I loved the sorry attempt to create a Moment\nof, lets see, a smile, when I saw the poster of Birdman in the Movie,\nin the Beginning, and it looked like Keaton in BATMAN. Love that part.\n"},
{"review": "\nI basically only watched this movie because it won the 2015 Oscar for\nBest Picture. I'm still in shock on why it was even nominated for best\npicture! This movie was all over the place! I understand that the\ndirector wanted to take a different approach to this movie. It looked\nlike it only took about 1 or 2 takes to film the whole movie! <br><br>The plot just wasn't very good to me! Michael Keaton plays a washed up\nactor you used to play a character named Birdman. He tries to get back\nin the acting game by being in a play. His Birdman character is stuck\ninside him and follows him wherever he goes.<br><br>I do have to admit that the acting was pretty good. Michael Keaton did\ndeserve his Best Actor nomination. I do wish that they had closure on\nEdward Norton's character. He makes out with Emma Stone towards the\nmiddle of the movie and is never seen again. Like what happened to him?<br><br>Anyways, if you are a fan of artsy movies then you might like it. But I\nfor sure did not! I hope that a better movie wins best picture in 2016!\n"},
{"review": "\nEndless pontifications, crummy editing, presumptuous acting and lousy\nplot. Put them all together and you have the worst time waster. How\nthis piece of crap ended up with any Oscars is beyond any reasonable\nperson. This film does not deserve ten lines of opinion but since the\nsite requires it I will add that the three people sitting next to me\nshared this opinion and in fact chimed in with other negative comments\nmost of which are not fit to print. Piece of advise - avoid this film\nlike the plague, the measles or the flu. I held an Oscar party and\neveryone who saw the film voted zero on the ballot I prepared. You\nshould have heard the moans and curses when Birdman kept winning. What\ndo Oscar voters think?\n"},
{"review": "\nWatched this because the trailer looked great, thats just it. The\ntrailer got two stars.<br><br>The whole movie was a build up to nothing like what i was expecting\nfrom the trailer.<br><br>*Spoiler* If you expecting actual super hero stuff, avoid like Ebola.\nThe movie was more art and theater, literally that anything i was\nexpecting, big letdown.<br><br>But the acting was good, please read a good synopsis before viewing,\nelse you will regret it.<br><br>Birdman was more like Pigeonman\n"}
]