[
{"review": "\nWhat a wonderful accomplishment of a film by James Marsh (Man on Wire)\nwho brings such depth and beauty to the life/love story of Stephen and\nJane Hawking. The film is adapted from her novel on their life and\nbrings forth much of the love and tenacity necessary to care for and\nlove someone going through great physical struggles over time. Eddie\nRedmayne and Felicity Jones give fantastic and intimate portrayals of\nStephen and Jane during their courtship and lives together. My vote for\nbest film at this year's Toronto International Film Festival. In Q&amp;A\nafter film James Marsh told a great story about Stephen Hawking's\nreaction to the film where he gave the response that it was in \"largely\ngenuine\"... and Eddie Redmayne said that Stephen Hawking after viewing\nthe film allowed them to use his actual \"voice\" instead of their\napproximation for the film that they had produced. The most touching\nwas that Hawking had tears to be wiped away after viewing which will\ngive to you a sense of how genuine this film is.\n"},
{"review": "\nWe are all familiar with the story and with Steven Hawking. His\ngroundbreaking work 'A brief History of Time' and devastating\ndisabilities propelled him irrevocably into the public consciousness\nand immortal fame.<br><br>But few of us could understand the complexities of his personal life\nand the shocking divorce in 1990 from his long sacrificing wife of more\nthan 25 years. Indeed that episode served to darken his reputation in\nthe minds of many, including myself, who felt ill at ease with anyone\nwho could leave a partner who had done so much for him just at the long\nawaited moment when international fame and recognition finally arrived.<br><br>This wonderful production, so well scripted and paced throughout,\nserves to explain that vital anomaly in Hawking's life. And it is made\nall the more poignant as it is based upon the account written by his\nwife who has borne so much.<br><br>But it is the breathtaking performance of Eddie Redmayne as Hawking\nthat simply blasted this film into an extraordinary level. It is\ndifficult enough to mimic so famous a person as Hawking and it is even\nmore difficult to portray so accurately the debilitating and gradually\nincreasing effects of Motor Neuron Disease. But to transmit so clearly\nthe profound emotions and inner suffering that Hawking must have\nexperienced in his agonizing journey was a performance that left me\nquite speechless and at times in uncontrollable tears.<br><br>It would be a travesty of the industry if Eddie Redmayne is not\nnominated for an Oscar after this performance. And to my mind it was a\nwork of art that simply cannot be equaled let alone beaten.<br><br>Have a good handkerchief ready to hand.\n"},
{"review": "\nBut it does tell an inspiring story about Stephen Hawking's personal\nstruggle with his illness that's very uplifting.<br><br>The story of Stephen Hawking and his then wife Jane, apparently based\non a book she wrote about it, which probability explains why there was\nnot much science in the movie, not that I'm complaining, as it was a\nwell played film about a difficult relationship.<br><br>I didn't known Stephen and his wife actually met around the same time\nas he began to suffer from Lou Gehrig's Disease. Makes the whole\nconcept that Hawking has three kids with this woman more interesting\n(something was working). Felicity Jones did a great job playing such a\nstrong, patient, and compassionate woman, all well narrated in this\nmovie. The difficulty Jane Hawking had being with a man getting trapped\nin his own body, played by Eddie Redmayne.I have herd of Hawking's\nsurprisingly positive personality, not because of his condition, but\nbecause I expected his condition would make it hard to express any\nemotion. Redmayne did his research to express the struggle of Hawking\non camera nicely (I keep forgetting The Hawking is a Brit).<br><br>This movie turned out to be a great one about the time span of a\nrelationship. Done more romantically than borderline soft-core flicks\nlike Blue is the warmest color and 9 songs, and it was not as\ndepressing as Blue Valentine. it was just a true take on a complex\nrelationship taking it's toll, well performed by some brilliant actors.<br><br>If your looking to watch this movie to hear some science talk, that's\nnot what the movie is really about, unless ironically convincing the\nworld of his theories on time was really as easy as the movie makes it\nout for Hawking. Overall very enjoyable.\n"},
{"review": "\nA biopic of Stephen Hawking, mostly focused on his relationship with\nhis first wife, Jane (the film is based on her own autobiography). It\nhas little interest in what Stephen Hawking is about, except for very\ncursorily. I guess that's not a huge problem, but, frankly, I don't\nknow that much about Hawking and wished I had gotten to learn more from\nthis movie. It does deal a lot with his disease and health struggles,\nwhich I suppose many are more interested in. The film will surely be\nmost notable for its two lead performances. Eddie Redmayne certainly\nnails the physical side of Hawking and projects a very clear character.\nFelicity Jones, though, does better work as the woman who has to work\nvery hard to make their lives work. No one else really registers much\n(though David Thewlis and Emma Watson, among many others, are\nfeatured), but that doesn't really matter. The filmmaking is competent\nbut not notable. James Marsh, best known for his documentaries Man on\nWire and Project Nim, has done good work in feature filmmaking before\nwith the underrated The King. Here he doesn't get much to register. My\nfavorite thing besides the lead performances was the very pleasant\nscore, by Johan Johansson. Probably worth seeing on video, but don't go\nout of your way.\n"},
{"review": "\nThis movie completely misses the mark. The world is interested in\nStephen Hawking for his scientific contributions to the world. The fact\nhe has a horrible illness is incidental. This movie drags the viewer\nthrough the weeds of Hawking's pain and suffering and never let's up\nuntil the final minutes of the movie. It was exhausting to watch and\nleaves the viewer with no real answers to the questions they came to\nbetter understand, explore and enjoy. <br><br>For example, questions like these never get addressed what exactly are\nHawking's contributions? How have they shaped thinking and helped\ndevelop a better understanding of the universe? Why was Hawking's PhD\nthought to be so magnificent and why did Hawking later seek to disprove\nhis original theory? Did he disprove the original theory? How has\nHawking been able to live so long despite a two year prognosis given in\n1963? What lead Hawking to consider the existence of god?<br><br>Hawking is played by Eddie Redmayne who does a fabulous job making you\nfeel as though you are watching Hawking himself.<br><br>This movie is about a man with a horrible illness who happens to be a\nmagnificent scientist. The story should have been told the other way\naround.\n"},
{"review": "\nI've read scientists are turned off by this film for its omissions,\nsimplifications, falsities, and other failures to explain Prof.\nHawking's theories. I can understand that, being a law specialist who\ncan't watch law dramas. But if you're not a cosmologist or a physicist\nyou should not be discouraged by the film's failure to give you enough\ndetail for a two credit course. It's a good drama of people, a bit\nschmaltzy as befits the facts, and in that regard I understand it's\npretty accurate, and is definitely well acted and directed. Also a nice\nglimpse of what Oxbridge life was like in the 1950s. As they say, the\nmale lead is Oscar bait.\n"},
{"review": "\nThis type of movie must be factually correct above everything else.\nInstead it is a hodgepodge of 50% theatrics, 49% personal life drama\nand 1% science and even that of questionable accuracy. <br><br>For example, it seems to imply that the theory of singularity was\ndeveloped by Hawking and it was immediately hailed by the scientific\nworld which is totally at odds with the account given by Hawking\nhimself in his own book. <br><br>The theory of stellar collapse was developed by Subrahmanyam\nChandrasekhar on board a ship on his way to England for higher studies\nat Cambridge. It was based on his flash of insight that while Pauli\nExclusion Principle is limited by Relativity, Gravity is not and\ntherefore when a star above a certain mass (later named Chandrasekhar\nLimit) begins to collapse, it completely disappears into a mathematical\nabstraction called singularity. This shockingly alien concept was hotly\ncontested by the scientific orthodoxy and ferociously attacked by his\nsupervisor Sir Arthur Eddington and opposed by Einstein himself even\nthough the mathematics was irrefutable (\"A Brief History of Time\", P.\n83-85). <br><br>In fact, Eddington's hostility was so vicious that Chandrasekhar had to\nswitch his field of study although it later formed the foundation of\nthe theory of Black Holes which was built upon by others like\nOppenheimer. Arthur I. Miller's \"Empire of the Stars\" gives a detailed\naccount of Chandrasekhar's scientific career and his rivalry with\nEddington.<br><br>Hawking is unquestionably one of the most brilliant minds of our time\nbut to credit him with the achievement of another brilliant mind and to\ntotally distort history does grave injustice to both of them and\nmisguides the viewers.\n"},
{"review": "\nI was hugely disappointed by this film after all the hype.<br><br>First niggle was seeing Jane Hawking played by a model actress. That\nmade her attraction to the awkward and frankly not very charming young\nversion of Stephen Hawking difficult to believe.<br><br>A major problem throughout was over use of soft focus, it made the\nwhole thing feel very unreal.<br><br>It hardly touched on Stephen's work at all. All it seemed to say was he\ngot praise for one idea and then got praise for another idea that\ncontradicted his first. Hardly portraying the work of a genius, which\nStephen undoubtedly is.<br><br>So OK it's supposed to be a love story then. What love story? I felt no\nreal chemistry between the two leads at all.<br><br>Then there is the chocolate box representation of middle England and\nthe stereotypical characters in it, again all in soft blinking focus.<br><br>As for Eddie Redmayne's performance it was OK but I did not find it at\nall engaging. It was a good physical impression of Stephen Hawking but\nwhere was the passion, where was the angst? Sadly missing for me.<br><br>One final niggle, there is a scene towards the end where Stephen is\nsupposed to be conversing with Jane and it is absolutely clear that\nthere is no way he could be creating the text on his computer in the\nspeed required to produce the conversation we see.<br><br>I watched it with my wife on Valentine's day eve and she was equally\nunimpressed. <br><br>How this film can be considered for any Oscars is a total mystery to\nme. Whiplash is so so so so much better.\n"},
{"review": "\nOur subject, Stephen Hawking, was on the verge of discovering THE\nTHEORY OF EVERYTHING, but the director obviously didn't realize before\na montage sequence shows two people getting married, and then their\nbabies growing into toddlers before our very eyes, we should know the\ncharacters just a bit.<br><br>The romantic setup at Cambridge University, bathed in an opulent\nnostalgic glow of academia, does look wonderful. And yet the meeting of\nStephen and his first wife Jean is so quick and easy, it's not one bit\ninteresting.<br><br>As an actor and probably the next Oscar winner, Eddie Redmayne\ntransforms from a quirky, ambitious student into the tortured,\nwheelchair-bound genius, but the performance shouldn't be compared to\nDaniel Day Lewis in MY LEFT FOOT since this particular vehicle seems\nmore like an actor's workshop than a fleshed-out biopic with a genuine\ncharacter arc.<br><br>It's as if the scriptwriter wanted Hawking's controversial philosophies\non Atheism, through the prism of discovering a powerful Black Hole, to\nhave a cinematic soundboard \u0096 with an intellectual date movie buried\nwithin the stardust. Yet after tedious bouts of soap opera diatribes we\nnever really know the man behind the suffering and brilliance, and how\nhe managed to bridge his personal life with his breakthrough in\nscience, and beyond.<br><br>Like an actual Black Hole, this particular THEORY has an intriguing\ndesign with absolutely nothing inside.\n"},
{"review": "\nIt was sad to see a film take such a wonderful subject as the life and\nambitions of Mr. Hawkins and attempt,dismally, to create it for nothing\nmore than a contender in the awards 'game'. This is the kind of tripe\nwhich is accepted all too readily as biopic material and offers little\nor nothing of the person or their skills other than to show off as a\nproffered mating ritual. Mr. Redmaynes painstaking efforts are the only\nreason I gave it any rating at all. With all the facts and wonder we\nhave have at our disposal about the man, why is it that there is little\nor nothing involving his deep, driving demand for 'the answer' and all\nthat is entailed in his studies. Rather we are given still another\nsexist portrayal of two people battling impossible odds to finally give\nin to their bases needs, with others. Not only old fare but out of\nplace and cheapening to the real story line. I could only try to\ndissuade others from subjecting themselves to this demeaning film.\n"},
{"review": "\nDay Two of Cinemark's Oscar Movie Week brought us the illustrious life\nstory of quantum theorist Stephen Hawking. His degeneration is\nunraveled with precision, but there's really not much else to make this\na memorable film.<br><br>Hawking is portrayed by Eddie Redmayne, an actor who's deserved his\nchance to shine for a long time now. His performance is nothing short\nof beauty, especially considering the movie was filmed out of sequence.\nHis ability to show the many stages of Hawking's illness is remarkably\nimpressive. Felicity Jones' performance as Hawking's wife Jane is\nequally impressive as we watch her struggle to maintain her husband's\ncondition.<br><br>Unfortunately, the rest of the film is not so adept. The film plays out\nlike the very mathematical equations in which its subject envelopes\nhimself. It almost feels like a TV movie in its formulaic sympathy.\nThat's not to say it isn't a tragic story, but its telling did little\nfor me.<br><br>For the first two-thirds or so, the film doesn't seem to know what it\nwants to be: A touching story of a seemingly doomed affair, or a bold\nstatement on Hawking's theories. Ultimately it succeeds at neither,\namounting to a light, safe, almost entirely forgettable romantic drama.\nEven the score, which has been winning countless awards this season, I\nfound indistinguishable from any number of films of the same ilk.<br><br>I really hate the term \"Oscar Bait,\" but if a movie were to define it,\nthis would be the one. Its only salvation is the performances of its\nleads, who seem to be the only ones giving the film any heart.\n"},
{"review": "\nI found this movie to be very thin.This is a quite boring and\ntraditionally made biopic of Steven Hawking.I was hoping it would be\nshowing us more of an insight into the brilliant mind of Steven.It does\nnot.It's subject is more or less: how to cope &amp; go on living with a\nvery disabled person as a spouse.I'v understood that the base of the\nfilm was the book by Jane hawking Stevens wife.Although one might say\nthat the main character gives us good acting....it brings us\nnothing.IMO.it's just a sentimental 13 in a dozen biopic and never\noriginal. a missed opportunity!It would be far more interesting if we\ngot more offered why Steven Hawking is such an immensely important\nscientist.\n"},
{"review": "\nHere are my reasons, in summary: <br><br>1) The film goes way too fast, we jump from one scene to another and\nthe events develop very quickly, not giving us time to assimilate what\nhappened. Examples: Stephen's and Jane's Romance, Stephen's theories\nabout time, children that appear out of nowhere and finally Stephen and\nJane's separation. <br><br>2)You're never sure what this film is really about. Is it about love?\nAbout the universe? About life in general? It's probably about all that\ntogether, but there is no balance with these topics for sure. <br><br>3)The last scene, where Hawking answers questions from the audience,\nseems way too forced. I believe the filmmakers wanted this too become a\nmemorable scene, but it doesn't really feel that way. There is no sense\nof a climax here, since SH only gets asked comfortable questions, so\nthere is no conflict. He is already world famous and very successful, I\nget that, but that just makes the audience not care too much about him,\nsince he has nothing to lose. <br><br>4) It's never explained how SH managed to live more than the expected\ntwo years. I'm sure there is an explanation for that, but it is never\ngiven in the film. <br><br>5) Finally, I have the feeling this movie never really takes off. It\njust seems to be at the same emotional level during the two hours,\nwhich makes it rather flat. This is very connected with #1, I felt like\nthe entire film was a giant trailer for a bigger film. Dunno how to\nexplain it better. <br><br>Those are my general impressions of the movie, maybe you agree with me,\nmaybe not. I agree that Redmayne's acting was great, but I wouldn't\ngive this movie more than 5 points out of then. Definitely not compare\nit to \"A Beautiful Mind\"\n"},
{"review": "\nOne of the most brilliant scientists or our time, one that has spent\nhis life thinking about general relativity, special relativity and\nquantum mechanics. And what do they do? They focus on his family live.\nI'm sorry but if I go and see a film about Senna I want to see a film\nabout Senna the racing driver. If I go and see a film about Edmund\nHillary I want see a film about Edmund Hillary the explorer, if I go\nand see a film about Pele I wand to see a film about Pele the football\nplayer. What I don't want to do is see some generic family drama where\nprotagonist X deals with obstacle Y and receives bittersweet ending Z.<br><br>This is Hollywood at its worst, instead of trying to step up to Stephen\nHawking's level and actually make an inspiring film about physics and\nthe universe (in the spirit of Carl Sagan), they have taken him down to\ntheir level so that he makes sense to the average man on the street.\nYou may not realize it but this movie spits on Stephen Hawking's\naccomplishment as a theoretical physicist.\n"},
{"review": "\nI was compelled to watch this movie after hearing how Eddie Redmayne\ngave the performance of a life time, thus becoming the hands-down\nfavorite to win the Oscar for Best Actor. I was disappointed.<br><br>The story lacked direction and purpose. It had potential to be a great\ncharacter piece like Raging Bull, but that was lost in the parts of the\nmovie that focused on science and Stephen Hawking's ailment. It also\nfailed to be a truly good scientific movie because it almost glazed\nover Hawking's work. I couldn't tell if the relationships, the\ndiscoveries, the fame, or the declining physical health were supposed\nto be the driving force of the movie. <br><br>Now, I must admit the performances by the supporting cast were\nheartfelt and sympathetic yet not really like real people. Eddie\nRedmayne seemed intent on merely making Hawking seem nice and innocent\nand consequently one-dimensional. I was disappointed too in that his\ntransformation into an Als patient was so revered. Yes, he looked like\nStephen Hawking, but there was no depth behind it. No substance. No\ndeeper motivation. All in all, Redmayne disappointed me.\n"},
{"review": "\nWatched #TheTheoryOfEverything....<br><br>The movie is a biography about the life of Steven Hawkins. The movie\ndoes tell a lot unknown stuff about Steven....<br><br>The Steven here performs his role very well. The expressions, body\nlanguage, ways of talking does remind us of the real Steven Hawkins.\nThe screenplay is really good and so is the story telling. His personal\nlife comes into illumination and very few of us have knowledge of his\nlife. His struggle, overcoming the struggle and the emotional tug of\nwar has been expressed beautifully....<br><br>On the other hand, the chief disappointment is that we don't get much\ntaste of Hawkins's genius. There ain't much over the head scientific\ntalks or Steven's confusions confusing us. Whatever idea he talks about\nis quite easy to understand....<br><br>Well, we don't have much knowledge the life of this genius and this\nmotion picture helps pretty good in this direction.... #mustWatch....\n"},
{"review": "\nBecause I expect a film based on a true story,( especially one where\nthe main characters are still alive) to be factually accurate, I was\nsomewhat disappointed with this film.<br><br>Eddie Redmayne and Felicity Jones are superb. Eddie Redmayne could\nactually be Stephen Hawking and when Felicity Jones playing Hawking's\nwife hears from her husband about a forthcoming trip, the acting in her\nface is masterly. The location scenes are excellent and the attention\nto details, hairstyles, clothes etc is perfect.<br><br>But it was a rather unbalanced account and makes no mention of Stephen\nHawking's \"role\" in the end of his marriage, which seems a little\nunfair to the story.\n"},
{"review": "\nI'm a huge fan of Stephen Hawking's work, so my expectations were very\nhigh for this movie. Specially because Stephen was thrilled about it,\nand he made it very clear on the social networks. But i was highly\ndisappointed. Eddie Redmaine is absolutely flawless, he really deserved\nthat Oscar, so was Felicity Jones. I rated it with a five only for them\nand the soundtrack (i love The Cinematic Orchestra, which Arrival of\nthe Birds and Transformation was PERFECT for that final scene that\nbrought lots of tears to my eyes)...but that's about it.<br><br>The movie focuses way too much on the romantic life of Hawking, his\nwife, his children (who suddenly disappear when it's convenient). I\nwanted to see more of Hawking's academic life, how his brilliance was\nacknowledge (you get only two fast paced scenes on this). I wanted to\nsee how his theories changed the way we view ourselves, the universe,\nand our place in the universe. I wanted to see how he contributed so\nmuch to science in general and cosmology. Of course i wasn't expecting\na documentary or i would see one, but i was expecting a film about\nHawking and not about how ELA destroys a person's ability to move and\nto be 100% dependent on others. I definitely wasn't expecting to see a\nmovie developing at the speed of light, where you can't really measure\nhis brilliance (i mean, that shot of Hawking's on a cover of a magazine\nto give us a glimpse of how famous he was becoming is atrocious). If\nyou don't know a thing about Hawking, you definitely won't learn\nanything with this movie, unless you are very, very, VERY curious and\nstart your research (he deserves it). I hope, at least, that the movie\nwill spark your curiosity for one of the most brilliant minds of the\n20th and 21st centuries.\n"},
{"review": "\nWithin the first 5 minutes of THE THEORY OF EVERYTHING, I realized that\nI was thoroughly charmed by the two lead characters. With that\nknowledge firmly in mind, I sat back to enjoy the love story that was\nset to unfold.<br><br>And unfold it did...very well, indeed.<br><br>TOE tells the story of the relationship between famed Physicist Stephen\nHawking and his wife, Jane. As portrayed by Eddie Redmayne and Felicity\nJones (both Oscar nominated) these two people are charming, loving,\nselfish, angry, happy, sad. In other words, they are HUMANS.<br><br>Redmayne, in particular, does a remarkable job of creating a real\nperson despite the handicap of not being able to use much physicality\nin his role. What Redmayne is able to convey with his eyes is\nastonishing and I would be just fine with him winning the Oscar this\nyear. The movie is, in essence, a \"two-hander\" and Jones more than\nholds her own as Hawking's wife Jane, and it was gratifying to watch\ntwo strong performances on the screen together.<br><br>The story is told strongly by Director James Marsh while the\ncinematography brings strong, interesting visuals to a picture that\ncould have been bland. It was a welcome addition to a good story.<br><br>I cannot leave this review without mention of Professor Lupin himself,\nDavid Thewlis as Hawking's mentor, Dennis Sciama. It is always welcome\nto see Thewlis on the screen but I was distracted at the first moments\nof seeing him in his Professor's robes at an old London University. I\nhad Harry Potter flashbacks.<br><br>But I digress...<br><br>If you're looking for a bang, bang action flick - check out one of the\nmyriad of Liam Neeson flicks, if you want to watch good acting, good\ndirection and a strong love story about two charming people, check out\nTHE THEORY OF EVERYTHING.<br><br>8 (out of 10) stars and you can take that to the Bank (of Marquis)\n"},
{"review": "\nI have watched a couple of documentaries on Dr. Stephen Hawking which\nmade me a bit skeptical about The Theory of Everything as Hollywood\ntends to change historical facts for dramatic impact, while The theory\nof everything is guilty of this cardinal sin as well it's still a\ndecent experience if you approach it as a film about two young persons\nin love and a disease which threatens it. The theory of everything is a\nromantic film and not a biographical and a scientific one which luckily\nworks out in it's favour, there is less focus on the works of Dr.\nHawking and more focus towards the relationship he shared with his wife\nJane Wilde Hawking. <br><br>The film does get predictable often but the films pulls through due to\nthe earnest performance by the two leads and hits some satisfying\nemotional highs. Eddie Redmayne has never played a lead in any film but\nwhen he gets a chance in this, he hits a homerun, the amount of\nresearch and effort he has put into this role net him an Oscar\nnomination and who knows maybe even a win. Felicity Jones is incredible\nherself as Jane, she is the backbone for the Hawking family, she takes\ncare of the house, the children, helps Stephen with his books and\nresearch. However this is the second time I have seen Felicity Jones\naging on screen improperly, while every character ages normally\nFelicity Jones doesn't look that old compared to her co-stars, her make\nup isn't up to the mark and she always looks young, this was prevalent\nin another film of hers- The Invisible Woman. Lastly, if you take out\nthe good acting out of the film you aren't left with much but it's\nstill a decent watch because it provides some very strong emotional\nhighs.\n"},
{"review": "\nA look at the relationship between the famous physicist Stephen Hawking\n(Eddie Redmayne) and his wife (Felicity Jones).<br><br>Upon the first glance, you might think this would be a terrible film. A\nlove story between an incapacitated scientist and his wife? Sounds\nboring, or at the very least overly sentimental. But it ends up being\nneither.<br><br>Redmayne sells the film. As of now (January 2015) he won the Golden\nGlobe and has been nominated for an Oscar. He ought to win it. Hawking\nhimself has said that Redmayne had an uncanny impersonation going on,\nand he is right. Whether or not this story is strictly true does not\nmatter... this is the sort of performance that makes a film worth\nwatching.\n"},
{"review": "\nI will first say that I did not find The Theory of Everything very\nengaging and that this could very well at it's core be because of my\nlack of experience in the field of romance.<br><br>Nonetheless The Theory of Everything is a well written and very well\ndirected film that also features terrific acting from the two leads.<br><br>Eddie Redmayne really managed to portray both the physical limitations\nof his character and the emotions buried inside of him. And Felicity\nJones portrayed a great sensitivity and the emotional toll her\ncharacter had to endure.<br><br>The Theory of Everything was a pleasant surprise because it manages to\nbe a strong dramatic biopic without falling into the pitfalls of the\ngenre.\n"},
{"review": "\nThis is a very good film about Stephen Hawking played by Eddie Redmayne\nat Oxford University. He meets his first wife played by Felicity Jones\nand they fall in love. He then is afflicted by the ALS disease. It\nreally shows the hardships that the couple have to go through with the\ndisease. It also shows the true love they had for each other to\novercome the problems they had. Stephen Hawking achieved some great\nthings in science. But this film is more about the love Stephen and his\nfirst wife had. Eddie Redmayne was great as Stephen. He did very well\nat portraying him and will deserve an Oscar nomination. Felicity Jones\njust as good as his wife she was really good. Portraying a woman who\nwouldn't give up on Stephen and really loved him. She will for sure get\nnominated. This is a very interesting film about a great love story. I\ndo recommend this film.\n"},
{"review": "\nThe Theory of Everything tells the story of one of the most respected\nliving scientists, Stephen Hawking, from his days as a young, brilliant\nphysics student to his struggle with Lou Gehrig's Disease, and becoming\nthe man we know today, with the mechanical voice.<br><br>As a person who admires but doesn't fully understand science, or the\nreal-life Hawking's contribution to it, I liked that this film\nattempted to explore his work a little, in lay man's terms. The film\nbrings up God's role in the universe a lot, effectively dramatizing the\nscience- Hawking is into the big questions. But The Theory of\nEverything is mostly a personal story, his trying to cope with being a\nbrilliant scientist losing all voluntary physical movement and speech.\nIt's frustrating to see him trying to explain his theories, but\ngratifying when the Soviet scientist announces the little man has done\nit. It mainly follows his family life and the difficult situation he\nand his wife Jane are in, and essentially makes Jane out to be a saint.<br><br>Eddie Redmayne, who plays Hawking, deserves real credit for being able\nto portray a character from a young, able-bodied (but still shaky) man,\nto a man struggling to speak, to wheelchair-bound and speechless. His\ntriumph- or Hawking's- is inspirational.\n"},
{"review": "\nThis movie is half a film. It goes into the relationships and simple\npicture of Dr. Hawking's amazing life. It does not go into the\ninspiration behind how bright the man was. <br><br>Hawkings life is in many ways a miracle. That is pictured in this\nscript. When I got done watching it, the film reminded me of many\nHollywood dramas. It drew a picture of how Dr. Hawking related to the\npeople in his life. It left out what inspired him. That makes the film\nsadly lacking.<br><br>The cast does a fine job of acting and makes it a decent drama but I\nfeel that somehow, the personal relationships spelled out in this film\nare like the relationships done in 1950's movies. They are deep\nemotionally but surrounded by real life card board. I would call for a\nremake that actually tells the story of what inspired the theory of\neverything. That is not present in this film.\n"},
{"review": "\nThis is pretty much a remake of the 1993 biopic on Stephen Hawking\n(\"Eine kurze Geschichte der Zeit\")...well, no surprise there, since\nit's an autobiographical work. However, the 2014 movie stops at pretty\nmuch the same point as the 1993 film does. The 20 years in the interim\naren't included at all with the exception of two sentences on screen\nafter the film ends.<br><br>What disappointed me most was that the works of Stephen Hawking are not\ntouched on in any way except that words \"Time\", \"Hawking Radiation\",\nand \"Black Hole\" are mentioned. But that's pretty much it. No context -\nnothing. <br><br>This could have been a movie to inspire people to go into science or\nachieve great things. But the movie sadly boils down to \"Sick guy who\nis famous for unexplained reasons has troubles in his relationship\".\nThat isn't even good enough for TV.<br><br>3 stars because the actors (especially Felicity Jones) did their job\nadequately well.\n"},
{"review": "\nThis is the best film I've watched in a long time. Safe to say I was\nhooked from beginning to end - not even seconds of slight distraction.\nI don't find physics uninteresting, but I don't know enough about it to\nbe a great judge of that part - but given that this movie focuses on\nthe relationship between Jane and Stephen it shouldn't be a problem\n(it's pretty much a movie for everyone). I don't get how some people (a\nminority, of course) can low-rate this. Even if you're disappointed\nthat it's not mainly about Hawking's scientific work, this doesn't make\nit a bad movie. And the fact that it's based on Jane's book SHOULD be\nwarning enough. <br><br>I've watched Hawking's series 'Into the Universe' a while ago. It's\nmostly animations with a voice-over, but you do get to see him in the\nopening (and as far as I remember also the closing) sequence. I've also\ncome by him in interviews and articles and stuff a few times. Each time\nhe strikes me as a lovely man. You just know that he's funny and\nsympathetic, and that's quite amazing to me due to the fact that he has\nno facial mimics or body language to make use of. That in particular I\nthink is captured really well in this movie. Eddie Redmayne does an\namazing(!!!) job and the Oscar was fully deserved.<br><br>Another thing worth mentioning is how authentic it seems - of course\nbecause it's based on the biography by his former wife, Jane Wilde\nHawking - but it's not at all slushy at any time. Jonathan (played by\nCharlie Cox) would probably have been the antagonist had this been a\ntypical Hollywood production, but that's not how you feel. The\nantagonist is solely the disease and its after-effects. To witness the\nmisery it brings through this movie was simply heartbreaking and I was\nsobbing half the movie more or less. <br><br>I will undoubtedly recommend this movie. It is a must-watch.\n"},
{"review": "\nIf you cannot imagine how a film about Stephen Hawking could be utterly\nastounding and heartfelt and touching, don't imagine\u0085and see \"Theory of\nEverything.\" In short, the incredibly touching back story of Hawking is\npresented here\u0085less science, more humanity\u0085and it is absolutely\nbeautiful.<br><br>However, Redmayne completely steals the show as Mr. Hawking in an\nutterly pitch-perfect, transformative performance that will most likely\nnab him his first Oscar nomination\u0085with a win looking pretty darn good\nas well as he goes from upright man to wheelchair-bound.<br><br>Redmayne is mesmerizing.<br><br>As is this whole incredibly beautiful film.\n"},
{"review": "\nThe theory of everything is probably one of the best movies I've seen\nso far this year. Everything about and around it has its own right\nspace. The story is more about Jane (Felicity Jones) rather than\nprofessor Hawking - in fact it's an adaptation of the book \"Traveling\nto Infinity: my life with Stephen\" by Jane Hawking. It's her fight for\nher love for Stephen first, and then against his disease. She is the\nstrongest character, even though the public easily sympathizes with\neveryone. They are people who have encountered difficulties in their\nlives and they feel extremely pure. The script is well written: the\nfact that it is focused more on the personal life of Stephen Hawking\nmakes it easier to follow, although dealing a little more with his\nprofessional research would have made it deeper and maybe more\nphilosophical. The cast simply does a great job and Eddie Redmayne's\nperformance is superb and outstanding - hopefully it will bring him a\nBest Leading Actor Oscar.\n"},
{"review": "\n.. arguably a very good one.<br><br>A small hat is presented to the audience. The magician turns it inside\nout and shows there is nothing there.<br><br>He lays it down. Waves his hand over it. Reaches in and pulls out a\nlarge rabbit.<br><br>Works every time.<br><br>This movie is like that.<br><br>It would be a good solid movie if the viewer was unaware of who Hawking\nis.<br><br>Knowing in advance what is to come -- that a rabbit is due, if you like\n-- makes it that much more special.<br><br>Marsh directs with a sure hand. This is the sort of film that Ron\nHoward usually makes, but nonetheless the audience is in capable hands.<br><br>Redmayne is superb, the illusion is greater because he LOOKS like\nHawking. Astonishing.<br><br>Jones is centre of the film. Every film needs a centre and you could do\nworse than than beautiful and magical Felicity Jones.<br><br>Her astonishing beauty (a perfectly symmetrical face and oversize eyes)\ndepends for impact on getting just the right camera angle. This allows\nthe director, by picking the angles, to use her beauty like a weapon\nwith which to harpoon the viewer in key scenes. Works.<br><br>She plays \"younger\" in the early scenes and \"older\" in the later\nscenes. And is never less than brilliant.<br><br>Excellent.\n"},
{"review": "\nGoing into the movie I was expecting to look at a great piece of cinema\nas well as learn about the life of Stephen Hawking and his scientific\nideas. I was quite disappointed in the lack of information presented.\nWhen there was scientific theories presented or the ideas of Hawking\nhimself they were briefly covered and not in depth at all. I learned\nvery little (and this is coming from someone who has about average\neducation in the field) and was rather disappointed in this aspect. The\nacting in this movie was phenomenal. It was very, very good, and I was\ntruly impressed. Personally, the cinematic quality is not nearly as\nimportant as the overall content, which I felt was lacking. I am not\ninto a lot of romance movies and I can very easily see how someone\nwould have a different opinion, but I wish that it had more scientific\nideas attached to it.\n"},
{"review": "\nDespite the relatively low valuation that we put to this headline\nwriting about this film is worthwhile. At the moment when the cliché of\nthe young scientist with comprehensive bizarre but brilliant intellect\nwas broken by explaining the personality of the protagonist (like who\nhe was in fact), the film makes sense, albeit seriously reminds us of a\nprevious title on the same topic.<br><br>It is important to note the film because of the history it represents.\nBecause of the strength of the protagonist to live with the hope that\nit will deal with every obstacle which he will face. Because of the\nlove that is able to give such power and to multiply the good. Truly\nunderstanding that life is a struggle and that the more you fight, the\nmore you distance yourself from the bad and the possibilities of\nfailure is a state of mind typical of big and powerful people. Although\nthey might not look exactly like this. The constant effort to reach the\nwave in the end leads you in the dock of a lake placid waters of\nhappiness. And there is where all your previous existence gets its\nmeaning.<br><br>Therefore, we will counteract the physical forces and not let ourselves\nbe sucked in by a black hole. We will strive to expand the universe and\nwe hope that you will follow us in your personal example.<br><br>http://vihrenmitevmovies.blogspot.fr/\n"},
{"review": "\nI like everyone else got swept along with the buzz for this film upon\nits release and while I don't think it was worth all the hype it still\nremains a good film.<br><br>The two central performances re fantastic and we see the decline in\nHawking's condition and the couples marriage from both sides in a way\nthat means we never take sides.<br><br>There are some slow moments though and that ultimately is what reduces\nmy rating for this film. I wasn't expecting big bangs or anything, but\nsome of the scenes felt like they were recapping what we as an audience\ncould put together in our own heads.<br><br>A warning also for those of you of a squeamish disposition, in some\ncases we do see what goes on in a operation and it could be quite\nupsetting for some.<br><br>Overall though a good film that tracks what Jane Hawking had written in\nher earlier book.\n"},
{"review": "\nA melodrama about the life of Stephen Hawking. It's exactly what you\ncan expect from a movie like that, but it's pretty well done. the movie\nfocuses on the disease and the family relationships, while touching the\nscience aspect once in a while, explaining it to the layman.<br><br>Eddie Redmayne is very good in his role, convincingly playing Hawking\nand making the performance very believable. His looks is very to\nHawking himself, so that helps too. Felicity Jones is OK in her role.<br><br>Good low-key score by Johann Johannsson.<br><br>I haven't checked how accurate the movie is, but it's based on a book\nwritten by his wife and according to IMDb's trivia, Stephen Hawking\nliked it.\n"},
{"review": "\nTwo British students at Cambridge University in 1962 fall in love: he's\nstudying astrophysics and develops the controversial theory that a\nblack hole created the universe; she hopes to get a degree in Medieval\nSpanish poetry, is charmed by him and desires to be his wife, despite\nhis recent diagnosis with motor neuron disease. The life of \"A Brief\nHistory in Time\" author Stephen Hawking, with a screenplay adapted from\nJane Hawking's book \"Travelling to Infinity: My Life with Stephen,\" is\nglossy and professionally-assembled, right down to the romantic blue\nlight that bathes the young lovers at the dance where they first meet.\nAs Stephen Hawking, Oscar winner Eddie Redmayne is puckish and\ncharming; it's a masterful performance that must carry the movie\nemotionally for quite a stretch, yet Redmayne is equal to the\nchallenge. Playing his seemingly tireless spouse (who bore three of\nStephen's children even while his muscles were rapidly failing),\nFelicity Jones has to play a saint, a daunting task. Jones is not\nrequired to show joy or splendor because, apparently, Jane Hawking was\ntoo busy being a nursemaid/wife/mother to be truly happy; the one\nsequence where Jones is allowed to brighten a bit is when Stephen, an\natheist, first references God in his manuscript and shares the moment\nwith her. The film isn't full of pomp and prestige--it's entertaining\nand moving--but the notion that Stephen is just a delightful, wily\ngenius in a wheelchair is rather tough to swallow. \"The Theory of\nEverything\" isn't a puff piece on the physicist and author, but neither\nis it a probing investigation of the man behind those theories. **1/2\nfrom ****\n"},
{"review": "\nEddie Redmayne Arguably Deserved the Oscar for Portraying Stephen\nHawking in the Film, but That is Where the Applauding Stops. This is\nOne of the Most Disappointing Films of Recent Years. The Movie of the\nWeek Story, is so Familiar because it Has Been Done So Many Times it is\na Staple of the Inspirational, Highly Emotional, and Touching Stories\nof a Handicapped Person that Overcomes All the Odds and Survives\nDespite Overwhelming Obstacles.<br><br>But the Twist Here is that This Person is a Genius and One of the Best\nMinds of Our Time. But His Particular Gift is in Physics and Cosmology\nand We Get Very Little Exploration of the Brilliance that Made Hawking\nthe Talk of the Scientific Community. It's Like a Tarzan Movie that\nFocuses on Jane and Tells of Her Trials of Being in Love with an\nAnomaly. OK, but it Ignores the Elephant in the Room.<br><br>So Ignoring the Elephant, the Film is a Somewhat Interesting Love\nStory, but the Movie Decides it is the Only Story to be Told About this\nBrilliant Man and the Wife that Stood by His Wheelchair Until She\nDidn't. The Movie is a Deceit and Never Tries to Get Into Stephen's\nHead, and that's Where the Gold is. <br><br>So We Don't Discover Much About His Treasured Intellect or His Work and\nits Effect on His Peers and Scientific Community in General, or Why He\nis so Revered as an Innovator of Thought. His Breakthroughs are so\nGlossed Over that the Filmmakers Must Have Thought it was Beyond the\nComprehension of Us Average Humans. <br><br>How are We Seekers Going to Learn About Complex Things if They are\nWithheld Like Some Sort of Sacred Fruit Fit Only for the Gods. The\nAudience is Given a Glimpse of the Apple but are Never Allowed Close\nEnough to Take a Bite.<br><br>Overall, it s Basically a Bio-Pic-Chick-Flick and a Family Friendly\nForay that is a Weeper, Withdrawn, and Frustrating the Way it Hints at\nOne Thing and Shows Us Another. For a Movie About a Deep Thinker, This\nOne Turns Out to be a Shallow Stinker.\n"},
{"review": "\n\"The Theory of Everything\" is the kind of standard-issue biopic that\nbreezes through the life of whoever is its subject (in this case\nStephen Hawking), hitting all the highlights while glossing tidily over\nall of the complexities that would actually exist and surely did in\nreal life.<br><br>At least this one isn't afraid of addressing the less flattering\nelements of its protagonist, namely the fact that Hawking dumped his\ndevoted wife for his nurse after his wife had spent years caring for\nhis every need. Eddie Redmayne gives an impressive physical performance\nas Hawking (it's no wonder he won the Oscar -- the Academy loves\nperformances like these), while Felicity Jones suffers nobly, as wives\nalways do in biopics like this. She is really the more interesting\ncharacter, or would be if the film allowed her to be, instead of\ntreating her as an assemblage of personality traits it can use to move\nthe plot forward. All of the dramatic conflicts in the film are treated\nequally, and none of them seem to carry much significance. Hawking's\nannouncement that he's leaving his wife, for example, is handled by the\nactors as if he's told her he just spotted a mouse in the basement.<br><br>The film does a good job of recreating its time period, which is\nsomething another Oscar-bait period piece from the same year, \"The\nImitation Game,\" didn't do. Still, the film manages to look like a\nmagazine ad, everything bathed in a glossy glow.<br><br>The story of Stephen Hawking is so interesting and the movie is\ncompetently enough made that it ends up by default as being interesting\nitself. But is it too much to ask that a biopic once in a while do\nsomething, anything, surprising or daring?<br><br>Grade: B+\n"},
{"review": "\nFirst thing, the lead performances are alone worth a watch. As\neverybody else says, Eddie Redmayne has nailed the character. The thing\nI liked the most is the way the characters will make you empathize with\nthem. My only complaint is the that film is only as much about Stephen\nHawking as it is about a person with Motor Neuron disease. <br><br>That being said, the movie have a lot of potential if only we could get\nto see a little more of Stephen Hawking as a scientist than a family\nman. The narrative could get a little predictable and boring, not that\nI expect any suspense, but I think a little more science could have\nbenefited the movie.<br><br>The background score is pretty good. The technical aspects of the film\nare also good. <br><br>Final words, worth a watch.<br><br>P.S. Excuse my poor English, it is not my mother tongue.\n"},
{"review": "\nWhat a beautiful, and emotional ride! I really like Universe stuff, and\nI felt that this movie has it all: love, hope, science, human touch.\nIncredible performances of Eddie Redmayne and Felicity Jones. Such a\npleasure to watch them. I felt the chemistry between them. Eddie's\nperformance is so well executed that you forget the actor, you are\nwatching Stephen Hawking.<br><br>For several moments in the movie, I was going to cry. My eyes became\nwet... it's so powerful, so moving. Do yourself a favor and watch this\nmovie, one of the best in 2014.<br><br>\"There should be no boundaries to human endeavor. We are all different.\nHowever bad life may seem, there is always something you can do, and\nsucceed at. While there's life, there is hope.\"\n"},
{"review": "\nI went to see the theory of everything not thinking it was going to my\ncup of tea but I actually ended up loving it. This is the life story of\nprofessor Stephen hawking and his relationship with his wife and his\ndebilitating disease. Now one of the biggest compliments I believe you\ncan give an actor in a film like this is when you forget who is acting\nand you see the person in front of you and Eddie Redmanyne did this\nsuperbly. His performance was fantastic as he not only had to play this\niconic person but because of the disease his performance had to be\nadapted and change throughout and that was so enthralling to watch and\nhe is definitely worth his Oscar win. Felicity Jones plays his wife\nJane and she is also fantastic, their chemistry is really what carries\nthe film and make it easy to watch and without that this film wouldn't\nbe worth it at all. She deserves her Oscar nomination for her role that\nhas launched her career. Credit to Charlie Cox as well who even though\nhis role is small he does a great job with it. To be honest this is a\nsimple love story but it mixes with hawkings disability to make it an\nemotional roller-coaster. However, I really wanted to know more about\nhawkings work and his relationship with his studies but you get hardly\nany of that in favour of the romance aspect. These script was a massive\nsurprise because of just how much comedy and humour there was that\nreally helped the film flow. The style of the film was a bit of a mixed\nbag as the film is shot beautifully but there was some stylistic\nchoices that I thought were a little too much and took me out of the\nfilm. Overall I really enjoyed this film and I would advise you to see\nit.\n"},
{"review": "\nIf you love Stephen hawking purely because of his contribute to\nscience, this film is not for you. As it says in the synopsis, this is\npurely a look at him and his wife .and that is it. Don't get me wrong,\nit is moving in so many ways, and anyone reading this knows how\nincredible he is, but as a huge fan of him, his work, and the universe,\nit is probably not what you would expect. However, the story behind him\nand his wife and information we never would have known is incredibly\nmoving. Just to look at what his life was like before any of us even\nknew of his existence is mind blowing in itself. This man is a true\nhero, and I'm sure many people reading this would agree. Anyone who is\na fan of him, or his beliefs, should definitely give it a watch.\n"},
{"review": "\nThe Theory of Everything is a misleading title. However, that's not the\nmost misleading thing about this film. The cinematography and score\ngive the impression you are about to watch a heart-felt, inspirational\ntale where love conquers all. If we didn't already know we were about\nto watch a film based on the life of Stephen Hawking, we might think we\nwere watching a romantic comedy set in a fantasy world.<br><br>When it's revealed the main character has motor neurone disease, also\nknown as amyotrophic lateral sclerosis (ALS), the look and tone of the\nfilm stay bright and uplifting, despite the dark and depressing things\nwe are watching unfold on-screen. Scenes shift between painfully\nheart-wrenching to light, fluffy melodrama better suited for a daytime\nsoap. The Oscar bait clichés are at an all-time high here, you start to\nwonder if during the credits they will resort to bloopers. At this\npoint, the whole idea of the film seems in bad taste.<br><br>While The Theory of Everything has some great performances, the look\nand execution are more suited for an A&amp;E movie of the week. It's more\ninterested in romanticizing a failed marriage rather than celebrating\nthe work of a man with a brilliant mind. The result is an inconsistent,\nuninspired, painful bore.\n"},
{"review": "\nThe Theory of Everything<br><br>The reason women dig guys in wheelchairs is because they get to board\nthe plane first.<br><br>Mind you, it could be the intellect of the mobilized virtuoso in this\ndrama that attracts the opposite sex.<br><br>Shortly after meeting Jane Wilde (Felicity Jones) at Cambridge,\nastrophysics student Stephen Hawking (Eddie Redmayne) succumbs to ALS,\nand slowly begins losing control of his muscles.<br><br>Despite a bleak prognosis, Jane stays with Stephen, and the two defy\nhis two-month life expectancy indefinitely.<br><br>Years on, their marriage, their children and Stephan's bestseller begin\nto drive a wedge between the pair \u0096 as does his weakening health and\nhis wandering eye.<br><br>A mesmerizing romance complemented by elegant cinematography and two\nformidable performances, The Theory of Everything is a poignant\nadaptation of Jane's own book about her marriage to the famed\ntheoretical physicist.<br><br>Incidentally, how does GPS have so many voice options but Stephen\nHawking still only have one? <br><br>Green Light<br><br>vidiotreviews.blogspot.ca\n"},
{"review": "\nThis vibrant portrait of Stephen Hawking is not a lecture on\nastrophysics (we do not learn much about the Cosmos) but a lesson of\nlife.<br><br>A brilliant and promising student is diagnosed with Charcot disease\nwhile he has not defended his thesis yet. This neurological disease is\ngoing to attack everything : his motricity, his elocution... but will\nnot undermine his motivation. His determination and his humor (derision\nspirit) remain intact. His family experiences periods of doubt but his\nbrave, strong, devoted wife, Jane, is an example of courage. <br><br>Through his life, by his shaken experience, by his scientific work,\nHawking understands the concept of time. This movie shows that time is\nrunning out, life is a chance and love is our great resource. This film\nis food for thoughts. As Hawking says \"Where there is life, there is\nhope.\" or, I would say, where there is life, there is love.<br><br>I would like to salute the great performance of young actor Eddie\nRedmayne. Right and moving acting.\n"},
{"review": "\nIt wasn't until the end that I realised the movie was based on the\nmemoirs of Hawking's wife. It all fell into place and I decided that\nwhat I'd just seen wasn't such a bad movie after all.<br><br>Redmayne's Hawking was brilliant, as he slowly descends into the\nclutches of his motor neuron disease hell. Jones' Jane Hawking also\nvery good as she struggled with her increasing burden of family and\ncaring for Hawking.<br><br>At the end of the movie, I was left wondering how his life may have\npanned out, had he not found a partner. Was it Einstein who always wore\nthe same style of clothes so he didn't have to waste time considering\nwhat he'd wear each morning? Sorry, can't quite remember.<br><br>Anyway, the movie is worth a look. Just don't expect too much\nscience...\n"},
{"review": "\nIt seems certain that Eddie Redmayne will be collecting the acting gong\nat the Oscars in a couple of weeks, but is it deserved?<br><br>Redmayne plays Stephen Hawking who is obviously very much still alive\nand well against the odds. It is the type of role that the production\ncompany was probably canvassing for an Oscar before filming even\nstarted! There is also the difficulty of whether it's acting or\nimitation. Judging from interviews with Redmayne he appears very suited\nfor the role as he comes across as a very idiosyncratic character.<br><br>The film is based on the first marriage of Hawking to Jane(Felicity\nJones) who has to come to terms with the onset of Hawking's motor\nneurone disease. It is thoroughly engaging and the two leads are quite\nbrilliant throughout. Having said that I still can't help thinking it's\nmore imitation than acting, but just maybe that's why it is such\nbrilliant acting!\n"},
{"review": "\nWe doubted Steven Seagal. We all did. We thought he'd never again reach\nthe magisterial heights of 'Belly of the Beast'. Well put your sausages\nback on display because in The Theory of Everything Seagal storms back\nto his violent best.<br><br>Synopsis: Seagal plays Steven Hawking, a hitherto unknown maths\njourneyman who meets some woman, gets a debilitating illness and writes\na book that nobody would ever read because it is full of made up words.\nThe combination of these events makes Seagal furious. What follows is a\nterrifying martial arts tournament on an Island in which Seagal beats\nthe living hell out of every single mathematician walking the planet\n(and believe me, there are more than you think. There are 11 of them).\nSeagal's delicate portrayal of Hawking culminates in him succumbing to\nhis illness and being turned into a transformer, before killing his\narch nemesis (some douche box called Jonathan) with a judo pinch.\nSeagal struggles with the maths bits but excels at running like a\nconstipated emu. 5 stars.\n"},
{"review": "\nEddie Redmayne portrayed Stephen Hawking well, must have been a hard\nthing to do without being insulting. Acting impeccable as well as a\ngreat story line with important messages throughout. Definitely a must\nsee, any awards given to this film are well deserved. This film is\nsurely going to win an Oscar and if not, It will be very disappointing.\nBy far one of the best films I've seen in a while. Go and see this\nfilm! it's a must see, you're missing out if you don't. I've never\nreally read about or been intrigued by Stephen Hawking until after\nwatching this film, it's made me consider buying Stephen Hawking's\nbook, great theories and something that should definitely interest\nanyone with a curious mind.\n"},
{"review": "\nIn \"the theory of everything\" Eddie Redmayne brilliantly plays the\nmarvelous Stephen Hawking. The movie shows us parts of his life after\nthe discovery of his disease. Although the premise of a man becoming\nmore and more care-dependent seems to be sad this is a truly beautiful\nand positive work. Redmayne is so believable in his role as Hawking and\npoints out the enormous humor, which he is rumored to have. I laughed a\nlot about the jokes he made. Besides Redmyne Felicity Jones plays his\nlovely, caring wife, who is fighting with doubts, but keeps on doing\neverything for her husband.<br><br>The screenplay is well written and shows the significant breakpoints of\nHawkings life, without judging the characters for their decisions and\nmoves.<br><br>In summary we get a perfectly played (Redmayne deserved the globe),\nvery well written life adaption with a gentle score, that leads us\nthrough a exceptional life.<br><br>In my opinion the only thing the movie lacked was a bit more of\nHawkings scientific work. How he delved, how he did his maths and a bit\nmore about his theories. I would have liked that.\n"},
{"review": "\nThe Theory of Everything is a biopic about Stephen Hawking(Eddie\nRedmayne) &amp; the love story between him &amp; his wife, Jane\nHawking(Felicity Jones). Stephen Hawking is diagnosed with a life\nthreatening disease. The film chronicles the relationship between\nStephen &amp; Jane Hawking over the years. It also shows us how Hawking\nmade significant breakthroughs in science, despite his physical\ndeterioration due to the disease. <br><br>The Theory of Everything is an outstanding film. I loved the fact that\nHawking never gave up in spite of all the difficulties he faced in his\nlife. Jane's resolve to stay with Stephen despite his illness, moved\nme. The relationship between Stephen &amp; Jane Hawking is one of the\nhighlights of the film. Their relationship exudes positiveness,\nstrength &amp; undying love &amp; dedication to each other. The main highlight\nof the movie are the performances. Eddie Redmayne has given the best\nperformance of his career as Stephen Hawking. Redmayne completely\nembodies the character. The way Redmayne has portrayed Hawking's\nphysical &amp; speech deterioration is jaw-dropping &amp; flawless. No wonder\nhe's the front-runner to win the Oscar for Best Actor &amp; won the Golden\nGlobe for Best Actor. Redmayne truly deserves all the praise &amp; awards\nthat come his way. Felicity Jones is spectacular as Jane Hawking. Jones\nhas also given her career's best performance. Harry Lloyd is great as\nBrian. David Thewlis is brilliant as Dennis Sciama. Charlie Cox is\nincredible as Jonathan Hellyer Jones. The supporting characters are\nimpressive too. The music by Johann Johannsson is captivating. If I had\nto pick one flaw in the film, I'd say that the second half is a tad bit\nslow. Still, this movie deserves all the Academy Award nominations it\nhas received. A must watch.\n"},
{"review": "\nThe Theory of Everything is an emotional biopic on the life of Stephen\nHawking that shows a lot of the struggles that he had to overcome in\nhis tough life. Now initially upon hearing this you may think that it\nis going to be a much more serious film strictly documenting the key\nevents in life of Stephen Hawking. Now although it does include these\nevents, the film has a large focus on the relationship between himself\nand Jane and therefore does play out as more of a romantic film like a\nlove story. This is what made the film a lot more engaging and\ninteresting as it really captures the joy in Stephen's life at a time\nthat many people would think was full of pain. <br><br>The performance of Eddie Redmayne is one of the best of 2014 if not the\nbest as he captures the looks, personality and attributes of Stephen\nHawking which has to be one of the toughest roles to portray. He does\nall this so well that he stands out above the rest and really puts him\nin the race for Best Actor. The film at times did feel like it was\ngetting a little predictable but that is kind of expected when dealing\nwith a story that is very real and people may be somewhat familiar\nwith. In summary this film was not the greatest film of the year and is\ncertainly not for everyone, but if you enjoy romantic dramas or want to\nlearn more about the life of Stephen Hawking; this may be a film you\nwill enjoy - 7.9\n"},
{"review": "\nWhat is amazing about this movie is the spectacular performances of\nEddie Redmayne and Felicity Jones. The movie does not make the clichéd\nportrayal of a relationship that makes it seem flawlessly perfect, it\nshows the harsh reality of Stephen and Jane Hawking's relationship\ndeteriorating as they grow up, which makes the movie realistic and\ndramatic. Yet, the movie doesn't feel like it is about Stephen Hawking,\nbut rather the point of view of Jane Hawking about their relationship.\nThe movie makes a good effort to portray the struggle of Stephen's\ndisease, but you always have to remind yourself of Stephen's\nachievements that the movie does not make shine, or you'll feel like\nyou're watching the biopic of a very normal person, not one of the\ngreat minds of the century. Other than that, the directing,\ncinematography and dialogue are satisfyingly good.\n"},
{"review": "\nThis film seems to be a simple adaptation of Jane Wilde Hawking's\nmemoir of her 25 years of marriage to Hawking. So it starts with their\nmeeting and ends with their separation.<br><br>The film centres itself almost exclusively on the minutiae of their\nmarried life and coping with Stephen's disability. As such it is a real\ntear jerker and at times their lives together seem to be an unremitting\ntragedy.<br><br>I found the acting impeccable from the stars and supporting characters\nand the film evokes life in and around Cambridge university during the\nSixties and Seventies well, quite nostalgically.<br><br>Jane's religious faith compared to Stephen's atheism is a thread\nthroughout which I felt added nothing to the plot, yet what is really\nuplifting in the film is the story of the simple heroism required in\ndealing with such an awful disability, whether you are one of the human\nrace's greatest minds or not.<br><br>There is little in the story to help us understand why Hawking is such\na shining star in the world of science and I felt this was the movie's\nweak point. It is simply a given that we already know and accept he is\none of the greats and for that reason we will be content to view the\nemotional details of his domestic life. That said the film often feels\nwarm and intimate, that you have been invited in, like a talk through\ntwo decades of a family's photo albums given by them in their sitting\nroom.<br><br>Jane and Stephen come across as absolute heroes and it is their example\nand the feeling of being invited into a life which made the film\nworthwhile for me.\n"},
{"review": "\nIt's not a film full with science, massive actions and stunning visual\neffects, it's just a simple story narrating the life of a noble\nscientist. Not knowing of how true is the screenwriters adapting\nStephen Hawking's life to the big screen, but the moderate pacing does\nnot upset the audiences as it fills with a lot of interesting theoretic\ndialogues which some might be funny and the special yet specific\ncinematography has successfully crafted a beautiful life full of love.\nA big applause for Eddie Redmayne who has worked hard to portray a\ncharacter with motor neuron disease that looks extremely real, nature\nyet pitiful; while Felicity Jones is doing great to support by building\nup a charming and emotional chemistry. With amazing and calm scores\nfrom Jóhann Jóhannsson to enhance the overall tone of the film, the\nbiopic inspires us that when there is life, there will be hope and so,\nto be courageous, to be strong in overcoming challenges, it will still\nbe successful in achieving dreams. It also ends impressively and\naudiences would have stunt for a moment thinking on what we have made\nso far in our life.\n"},
{"review": "\nI went into this film with quite a good knowledge of Hawking's life and\nworks from the book 'a brief history of time' and various\ndocumentaries. So I didn't think I'd learn anything new. But I was\nsurprised when I found out about the effect the disease had on Jane and\nthe rest of their family.This was due to the superb acting from Eddie\nRedmayne and Felicity Jones.<br><br>Jane (Jones) is a determined woman who wouldn't stop at anything to see\nStephen through the difficult times he endures; without Jane Stephen\nmay not be with us today (today being his 73rd birthday) and so we may\nhave been missing out on the expansion of knowledge in the Physics\nworld that he still offers.<br><br>I was also surprised that Jane had another love interest during her\nrelationship with Stephen. This was sad to see from all of the support\nshe had given him but I guess she thought it was time.<br><br>The only negative things about this inspiring film is the pacing and\nlack of science. I know it's the story of Stephen and Jane but surely\nthey could of added more. Anyway I did enjoy this uplifting story so I\ngive it a 7.8/10 recommended especially if your a fan of love stories\nand the brilliant professor!\n"},
{"review": "\nwow people got to see this film in other to understand the real Stephen\nHawkins and how one by one he coped with the loss of his body trapped\ninside his own mind until computers came along coping with a marvelous\nmind in this film you believe the real person is on screen that how\nmuch Eddie redmayne character is so well developed and so engrossed in\nthis film that you forget that he has got motor neurone disease he\ntotally deserves his best actor award it was truly magnificent the way\nhuman endeavor can overcome all obstacles love the universe children\nlife itself the rest of the cast our wonderful his college mates are\ngreat and funny moments in this film lighten the movie moments but its\na true de force movie this film is 9/10 of ten 2hrs of truly but at the\nheart of this moving story is love and inspiring others to do things\nwhatever their ailment felicity Jones character gives a really good\nOscar performance for putting up with him for 25 years she has b---l's\nand is his pillar she is strong and puts up with his tantrums we can\nlearn from even though the specific scenario for them in life we all\nways have limitations and things put on us and how we overcome them is\nwhat defines us this film deserves Oscars's\n"},
{"review": "\nLet me state the good things about \"The Theory Of Everything\". First,\nEddie Redmayne does an excellent job of conveying the progressive\ndegeneration of Stephen Hawking's condition. Felicity Jones is good, if\na touch too saintly, as Jane Hawking. Secondly, the storyline of the\nfilm is formulaic but competent. This makes \"The Theory Of Everything\"\npleasant, occasionally funny and occasionally emotionally involving.<br><br>It is neither Redmayne's nor Jones' fault that that their parts bear\nonly a passing similarity to the people they are depicting. However, it\nis wholly the writers' fault that the story departs grossly from Jane\nHawking's book, upon which the film is said to be based, in several\nplaces. Characters are invented, scenes that never took place are\ninterpolated into the story and some real events are shifted in time\nfor purely dramatic effect in a way for which not even Stephen Hawking\ncould provide a proof! In short, \"The Theory Of Everything\" has to be\ntaken as mostly a fictional representation of the lives of the\nHawkings.<br><br>If you go to see this film simply to be entertained and don't mind\nwhether or not what you see is accurate, then you will be entertained.\nHowever, if like me you dislike wondering whether or not one scene is\nreasonably true to the facts but the next one is an invention - or vice\nversa, or that both are true, or that both are fictional - you may be\nirritated.<br><br>I find it troubling that so many films purporting to depict the lives\nof real people or historical events distort the truth with a total\ndisregard for the consequences of spreading what, in effect, are lies.\n\"The Theory Of Everything\" falls squarely into this unedifying\ncategory.\n"},
{"review": "\nUnabashedly sweet and gentle, \"The Theory of Everything\" casts a warm\nglow on the personal life of physicist Stephen Hawking.<br><br>From what I've read about Stephen and his marriage to Jane Wilde, some\nof what actually occurred may be softened quite a bit here. Still, the\nmovie glows with passion and sympathy for its characters, and it has a\nphenomenal performance by Eddie Redmayne (\"Les Misérables\"). The\nscreenplay is based on Jane's book \"Travelling to Infinity: My Life\nwith Stephen.\" <br><br>\"The Theory of Everything\" is a great parallel between Stephen\nHawking's declining health, his success as an author, lecturer, and\nscientist,and his marriage to Jane Wilde. <br><br>Eddie Redmayne, who has recently won an Oscar for his brilliance in\n\"The Theory of Everything\", from the beginning exhibits the early on\ncomings of ALS long before he is diagnosed formally. His ability to\nmimic and imitate these on comings enable Redmayne to display his\nincredible ability to portray such a brilliant mind such as Hawking. <br><br>\"The Theory of Everything\" has such a great parallelism, heart, and\nemotion as both Eddie Redmayne and Felicity Jones portray the brilliant\nmind of Stephen Hawking and his wife and caretaker, Jane Wilde.\n"},
{"review": "\nOne might think that this movie would be about esoteric theories that\nare beyond the capacity for most people.<br><br>You would be so wrong!<br><br>This was probably the best love story I have ever seen. I was on the\nedge of my seat watching Jane Hawking (Felicity Jones) as she did more\nand more amazing acts of love for Stephan Hawking (Eddie Redmayne). I\ncannot imagine anyone that fits the definition of love more than she\ndid.<br><br>Redmayne was brilliant as Hawking.<br><br>Anthony McCarten took Jane Hawing's book and wrote a screenplay that\nwas a thrill to watch.\n"},
{"review": "\nThe Theory of Everything is about the life of Stephen Hawking who is\narguably the greatest mind alive today. He came up with a black hole at\nthe center of the universe. This movie is the story of his life. From\nwhen he was in school to when he came up with his theory to when he\ngets Lou Gehrig's disease.It's also a pretty easy movie to follow when\nit comes to the science. The most impressive thing in this movie is\nEddie Redmayne's performance. Every phase of the disease was like a new\nperformance by Eddie Redmayne. He had to adapt to the circumstances and\nact a certain way for where he was at in the phases of the disease.\nWhether it be in appearance, movement, speech etc. The man gave it his\nall and definitely deserves his Oscar nomination. But Let's give credit\nwhere credit is due everyone's performances in this movie are out of\ncontrol This really in not a movie about his theories. It is more of\nhim as a person and his relationships, schooling, his disease. This is\na movie about his life and journey. Really my only gripe is it is a\nvery by the numbers biographical movie of a person. In all honestly\nthat doesn't really matter. In the end Theory of Everything is\ninteresting, engaging, your interested in the romance, your interested\nabout whats going on in his life. I definitely recommend you to go see\nthis.\n"},
{"review": "\nA biopic of Stephen Hawking, in my opinion, was always bound to be of\ngood quality due to his amazing achievements in the evolution of\nscience. This film, from it's inception, just pulled me in. The way in\nwhich the characters were professionally played, its touching on 1963\nCambridge, and its overall style was a real pleasure to witness. What\nfirmly sat my bottom to the seat though was how the film makers made\nthe film believable in almost all aspects of the movie; its characters,\ntheme, language, education, success and portrayal of Stephen's\nfailures, It felt as if each stage of the film was its own mini-series\ngradually developing into one complete element of great film making.\nWell Done!\n"},
{"review": "\nRedmayne first delivers, then destroys and finally murders the role by\ncompletely enveloping himself in the character of Stephen Hawking.<br><br>The violence was subdued, but the tension palpable throughout\nespecially culminating in one final touching scene that I shalleth not\ngiveth away.<br><br>I was watching it with my Mom, with whom I incidentally watched My Left\nFoot, and we don't watch movies too often for all you insecure kids out\nthere, but she kept saying it reminded her of that flick.<br><br>While Daniel Day Lewis's character will remain a classic, but I think\nwith this movie, Redmayne might have just not only have climbed\nacting's Everest being one of my all time Greats as favorite actors,\nbut just have pulled out the heist of the century.<br><br>Question is not why he deserves an Oscar but why not. Did you for\ninstance know that to capture the nuances Redmayne took dance lessons\nand Stephen Hawking felt he was staring at a mirror? While\nCumberbatch's role was dynamic and original, this one was\nhyperrealistic to a different level.<br><br>The name says it all.<br><br>Edward John David Redmayne, ladies and gentlemen, is a cold blooded\nmurderer.\n"},
{"review": "\nThis film displays many aspects of superb acting, But that most of\nEddie Redmayne who for the entire film had me convinced he was actually\nStephen Hawking. The physical acting in this picture was amazing. The\nclosest comparison is that of Jordan Belfort (Leonardo DiCaprio) in\nWolf of Wall Street whilst on drugs. <br><br>Eddie Redmayne truly entered a submissive body with no control in this\nfilm and the emotion is purely through facial expressions in the second\nhalf of the film. The slightest eyebrow lift can change the entire\nsetting of a scene and it is done perfectly.<br><br>Recommend this film to all.\n"},
{"review": "\nI really enjoyed the wonderful acting in this film. Both leads and a\ncouple of the supporting cast are top notch. What occurred to me after\nseeing it and reveling in the characterization is that while it's a\nnice love story, it could have been about almost any talented person\nwho hooks up with an amazing, loyal woman. What I am saying is it is\nmore a story of triumph than a story about Stephen Hawking and what he\ntruly is. We see his day to day existence and his conquest of strife,\nbut we know little of the professional man other than the rewards he\nreceives and the controversy he engenders. Of course, he is the\nrepresentation of modern physics and cosmology, but that is left for us\nto read for ourselves. There are documentaries exploring his life as a\nphysicist and some are superior to this. Nevertheless, the love story\nwhere one gives all one has for another is hard to dismiss. I found out\nthat Eddie Redmayne spent time with the great genius in order to\ncapture his essence. He spoke of Hawking's great sense of humor and\nwhat an incredible labor it is to be him. This will probably be\nnominated for some Oscars, but beyond the acting categories I don't see\nmuch else.\n"},
{"review": "\nIt took me a little while before I wanted to see this movie - a movie\nabout the genius Stephen Hawking suffering from ALS, but boy am I glad\nI did. We all know how this movie ends, after all, Hawking is still\nalive today. His journey, however, holds many surprising twists and\nturns which give one an even greater appreciation for this great man\nand his incredulous story. Eddie Redmayne (Hawking) will surely get an\nOscar nomination, and if he wins, it would be well-deserved. He was\nmagnificent; you never felt as though he was acting which made his\nperformance utterly heartbreaking. Felicity Jones, as his wife, Jane\nWilde, was also superb. If the actual Jane was anything like the one\nJones portrayed, then Ms. Wilde deserves the title \"Saint.\" This film\ncertainly gives a wikipedia type summary of Hawking's life, and there\nare some moments of slowness in the film (hence an 8 out of 10), but\nthe message of this film is 10+. What resonates the most is the theme\nof the movie, which for me, is that living a life filled with hope and\npositivity takes courage, sometimes to heroic heights. Perhaps\nHawking's genius goes even beyond his aptitude in science, but rather\nlies in his attitude toward life. The manner in which he's lived and\ncontinues to live sums up the Theory of absolutely Everything.\n"},
{"review": "\nThis movie is based on the book written by Hawking's first wife Jane\nWilde. It covers the period from 1963 to 1997. If you are interested to\nhear about Stephen Hawking's theories in great detail you better watch\nThe 2013 BBC documentary/movie \"Hawking\" currently on Netflix. This\nmovie does take into account Hawking's theories but the focus is on his\npersonal and family life. <br><br>And it does a very good job at portraying his first marriage and the\nlove and devotion of his devout wife through the course of Hawking ALS\ndisease. Some have slighted this movie for not covering Hawking's\ntheories in too much detail, but there is already a good BBC film on\nthe scientific discoveries of Hawking, so a rehash of the same\nterritory would have been a waste of time and effort.<br><br>The movie focuses on Hawking's first marriage. It covers how he and\nJane Wilde fell in love and married despite Hawking ALS diagnosis and a\nprognosis of death within 2 years. It is presented with humor and grace\nand tenderness. It traces Hawking's gradual deterioration from walking\nwith difficulty with canes, to crawling up the stairs, to getting\nwheelchair bound, to losing his voice and yet surviving and not\nsuccumbing to the disease in 2 years as was the prognosis. The movie\nshows the toll the disease took on Hawking's wife that led finally to\nthe separation and finally divorce.<br><br>The acting in this movie is very good, played with understatement and\nsincerity. The humor is endearing. It is not the definitive film on\nHawking, but restores a balance that was missing in the BBC\ndocumentary/movie. So in that respect it is a different take on\nHawking's life and work.\n"},
{"review": "\nI watch a lot of films, but for some reason they don't make me cry.\nI've sat through Schindler's list, The Pianist, Forrest Gump, One flew\nover the cuckoos nest, Green Mile etc. and never shed a tear. <br><br>The Theory of Everything had me welling up in about three places, and I\ncame out an emotional wreck. I'm not quite sure why, but something\nabout the mix between horrendous tragedy and incredible inspiration\nwhich go hand in hand in this movie, and in Stephen Hawking's life, is\njust incredibly moving. It captures the essence of being human; the\nconstant tension between calamity and euphoria which touches all our\nlives in one way or another. The two lead actors (playing Stephen and\nJane Hawking) were simply phenomenal. An amazing emotional\nroller-coaster through the highs and lows of human experience.\n"},
{"review": "\nThe Theory of Everything is an enjoyable flick that simply ticks off\nkey occurrences in Hawkings's life, embedding them in decently paced\nand storyboarded exposition.<br><br>And I know that sounds like damning with faint praise. As I watched\n\"Everything\", I simply couldn't stop wondering whether it would measure\nup to the Errol Morris work, \"A Brief History of Time\".<br><br>I think, in the end, that Morris's work sort of obviates this new\ntreatment, which felt like a recasting of \"Brief\" as straight-up film\nstorytelling.<br><br>Wow. I realize that I need to cut to the chase, here: I'm torn because\n\"Everything\" is obviously a labor of love, and a paean to a\ncontemporary secular saint. Ergo, I would be a stick-in-the-mud not to\nrespect and enjoy it. But this doesn't change the fact that the\ntreatment just rubbed me the wrong way. Something about the whole idea\nof minting a standard, groomed/greenlit feature film about Hawking bugs\nme.<br><br>But it's a nice flick, as I said quite enjoyable, and my stylistic\nremonstrance only knocked my rating down a couple of notches.\n"},
{"review": "\nFew years back I was mesmerized by the story of John Nash beautifully\nplayed by Russel Crowe and well-supported by Jennifer Connelly who\nplays his wife. Come 2014, The Theory Of Everything belongs to similar\ngenre diving deep into the relationship of a well-known personality\nwith his better half.<br><br>As we look into personal life of the famous Physicist, Stephen Hawking,\nwe are also shown about his work while fighting against the rare\ndisease which keeps him on wheel chair for the entire life.<br><br>Famous for making documentary \" Man On Wire\", James Marsh adapts the\nbook of same name based on the life of legendary Stephen Hawkings and\nwritten by Jane Hawking. The reason I brought A beautiful Mind\ncomparison as it dealt with mysterious life of well-known educated\nprofessor. The movie begins with evolution of a scientist and how he\nmeets Jane. A small incident changes his life but he does not lose\nhope. Jane is his pillar of support and helps him keep motivated. The\nscreenplay falters little bit but bounces back with nice climax. The\nbackground score with gorgeous cinematography adds on extra charm to\nthe film. Full marks should be given to Eddie Redmayne for fitting the\nrole of Stephen Hawking. Hats off to Felicity Jones for the playing the\nrole of Jane Hawkings.<br><br>Overall, a wonderful movie in every sense. Watch it to know the actual\nstory of Stephen Hawking. Excellent 4/5<br><br>https://www.facebook.com/FilmyChowk\n"},
{"review": "\nAn amazing movie - Eddie Redmayne's performance is so real that you\nforget he is an actor - he is Stephan Hawking. The preparation he must\nhave done for this part has to have been gruesome - the changes in his\nfacial features, the things the disease did to his body - so well\nportrayed. I forgot he was an actor - he is Hawking. The story is\nimportant for many reasons. The focus on the disease and its\nprogression, the affects of it on their marriage, and the genius of his\nmind was not affected. Felicity Jones is just as good as his wife -\nnever knowing the course the marriage would have to go through - she\nwas devoted to him through it all - even though she was loosing the\nsense of herself. In reality, you wonder how she was able to raise\nthree kids and take care of Stephan and always be there for him. Her\nperformance is worthy of awards too.The movie is well casted, well\nwritten and I hope there are many awards coming its way.\n"},
{"review": "\nThe Theory of Everything well everyone thought the main scope is about\nhow Sir Stephen Hawking develop the Space time Singularities and the\nHawking Radiation, but is not entirely, The main inspirational source\nis from Sir Hawking Ex-Wife Jane Wilde memoir, Travelling to Infinity:\nMy Life with Stephen. This story told us that Love will inspire, it is\nlove that makes people keep moving, and it is Love that giving us\nsomething to move on. Jane's love and sacrifice her passion made Sir\nHawking move on and developed the most beautiful formula with a single\ntheorem that explain the whole Universe. Without love, how worthless\nthis world will be. Redmayne and Jones is tremendous in the plot, I\nlove every part for Jones her expression is one of the best and I can\nfeel the love she had given in the film. You will feel sad for the\ndisease Sir Hawking that has, you will feel sorry for Jane, but you\nwill discover the beauty of the story. I really love this film, I\nreally sorry that this review is sort of personal but it is something I\nReally want to express. I lucky that I had the chance to watch this\nmovie in the time of my life.\n"},
{"review": "\n\"The Theory of Everything\" tells the story of physicist Stephen\nHawking, played by Eddie Redmayne. The movie covers the love story of\nHawking and literature student Jane Wilde, played by Felicity Jones,\ncoinciding with Hawking rise to prominence, for his scientific theories\nto the world's birth. The movie portrays Hawking's changing of views on\nthe subject, coinciding with his diagnosis of motor neuron disease\nrelated to Amyotrophic lateral sclerosis lateral sclerosis (ALS), a\ncondition that has progressed over the years, and it effects on his\nmarriage to Wilde. Redmayne gives a great performance, as does Wilde \u0096\nOscar nominations are likely to come. Overall, the movie does keep you\nvery engaged. It's not a perfect 10 \u0096 Perhaps at the start, you could\nget a little bit more incite into how Hawking came to be interested in\nhis field of study. The protagonists romance is charming at the start,\nandthe movie is effective in keeping you engaged as the story\nprogresses. 3 ¼ out of 4 Stars.\n"},
{"review": "\nInspired by the memoir Travelling to Infinity: My Life with Stephen by\nJane Wilde Hawking, 'The Theory of Everything' is an inspiring biopic\nabout the Einstein of our time &amp; his long-suffering wife. It narrates a\ntrue-story with sincerity &amp; maturity. <br><br>'The Theory of Everything' is a look at the relationship between the\nfamous physicist Stephen Hawking and his wife, and the greatness that\nfollowed. <br><br>'The Theory of Everything' is essentially a love-story about two\npeople, who don't give up on each-other for decades. Its an emotional\nfilm, that also has moments of subtle humor. Anthony McCarten's Adapted\nScreenplay is sensitive, yet inspiring. James Marsh's Direction is\nsolidly crafted. He has handled the film, perfectly. Cinematography is\npicture-perfect. Editing is nicely done. <br><br>Eddie Redmayne as THE Great Stephen Hawking &amp; Felicity Jones as Jane\nWilde Hawking, are like never before. Redmayne's turn as the legend in\nphysics, offers charm &amp; warmth. While Jones, is beautifully restrained.\nThe on-screen chemistry between the two, re-defines purity in romance.<br><br>On the whole, 'The Theory of Everything' works wonders. Recommended!\n"},
{"review": "\nThroughout this movie I sat on the verge of tears, feeling the utmost\nempathy for Mr. and Mrs. Hawking, as they struggled with the evolution\nof his disease and its toll on their day to day life. I watched\nmisty-eyed as their lives progressed, feeling gut-wrenching emotion,\nwaiting for my companions to do the same, only to find outstanding, yet\nsensitive, comic-relief throughout the two hours of film. The movie\nplayed with almost every emotion I have except anger. The beautiful\nnature in which the seriousness of his disease was dealt with through\nlove, loyalty, respect and compassion extinguished all thoughts or\nfeelings of anger. I really don't care that his brilliance in science\nwasn't expanded upon; this movie was about overcoming the impossible,\nand the toll it takes on the human spirit. The Hawking family fought\nfor survival and excellent in love, life and intellect with class,\ndignity and decorum. Bravo!\n"},
{"review": "\nWhile I don't think I'll be seeing this movie again, it was really,\nreally good. I remember watching the 2015 Oscars and being totally\nsurprised the Redmayne won Best Actor, because I had put all my faith\nin Cumberbatch taking the gold. In fact, this movie reminds me of a mix\nbetween \"The Imitation Game\" and \"A Beautiful Mind\". Doing a biopic\nabout one of the smartest minds in the world was obvious, but what\nsurprised me the most was how dedicated Redmayne was to his\nperformance. His performance is so good, it's like Denzel as Malcolm X,\nor Anthony Hopkins as Hannibal Lecter, you can't imagine anyone else\nplaying the role. Redmayne's performance is also what makes the movie\nhard to watch at times. Watching someone's body slowly deteriorate to\nthe point where they can't walk, or move their arms, or talk was really\ndifficult for me to watch. And that's the main reason I don't think\nI'll be watchin' this again, because it was that hard to watch at\ntimes. Aside from that personal gripe though, the movie is\ninspirational, heart-warming, and heart-breaking, definitely worth a\nwatch.\n"},
{"review": "\nThe first credit in the film goes to Eddie Redmayne ..!!! Acting was\ndone to perfection !!! The amount of work he had to put was huge !!!\nThe story of one of world's most brilliant master minds !!! The ups and\ndowns in his life !!! The problems he had to encounter !!! Felicity\nJones who did the role of Stephen's wife did a great job throughout the\nfilm !!! Overall , The Theory of Everything was satisfying and worth\nthe watch !!!Please do watch it !! I have now started finding better\nmovies through www.flickstree.com . It not only suggests great movies\nto watch , it also tells where you can watch the movie online.. Highly\nrecommended.\n"},
{"review": "\nFor many of us, Stephen Hawking is that old guy in the wheelchair, and\nhas always been that old guy in a wheelchair, but it turns out he was\nonce a young guy on a bicycle who fell in love and got married. And\nhe's British, which one never realizes from his computer voice. <br><br>Theory of Everything shows Hawking's brutal physical deterioration in\nthe context of his marriage. Eddie Redmayne is impressive in expressing\nthat deterioration while still showing the man trapped in an\nincreasingly uncooperative body. Eventually he has little to work with\nas an actor besides his eyes and lips, but he does a lot with those.<br><br>It's the sort of performance that always wins Oscars (Hollywood loves a\ngood disability acting job) but honestly I was more impressed by\nFelicity Jones, who expressed a steely, quiet determination and, as the\nmovie progressed, increasing frustration. Often she isn't given much\nmore to work with than Redmayne, being asked to tell the story with her\neyes, and she does so marvelously. Even though the movie is ostensibly\nabout Hawking, it feels like it's at least as much her story as his\n(not surprising, since much of it is based on her book).<br><br>While the story is often touching and absorbing, the writers ultimately\ncouldn't figure out how to end it. The movie has two scenes that feel\nlike endings, one at a Q&amp;A and the actual ending, but both feel like\nthey're struggling to create a profound moment out of fairly ordinary\nmoments. For me the lackluster ending lessens the overall impact of the\nmovie; a good ending would have made this an 8 instead of a 7. <br><br>After watching the movie I read an interesting article on Slate on how\naccurate this was. Overall reasonably accurate, although it sounds like\nthe real Hawkings was a bit more of a pain than the fluffy fictional\none.\n"},
{"review": "\nWhat makes this film truly great is the honest and sincere way it\ndepicts the life of Stephen Hawking and his family, and the enormous\nchallenges this great man succeeded to overcome. The movie also\ndemonstrates very nicely that love conquers all \u0096 even the most\nimpossible obstacles.<br><br>The film has also plenty of lighter, funny moments \u0096 like when Stephen\nHawking outs himself as a fan of penthouse magazine. (By the way,\nthanks for the tip, Dr. Hawkins :) Interesting magazine - did not see\ntoo many mathematical equations in it, though. But I could definitely\nspot a connection to the black hole theory :)\n"},
{"review": "\nBeautiful film of a beautiful and sad story. The cinematography and the\nsoundtrack creates a nostalgic and timeless mood for the film.<br><br>For me, this is a movie about Jane Hawking and not Stephen Hawking.\nEddie Redmayne and Felicity Jones's versions of Stephen and Jane\ntouched me. They portrayed their struggles with many layers of\nemotions. Amazing actors! I didn't know anything about the Hawkings\nprior and was expecting a documentary of Hawking's life with loving\nwife. So I was surprised to see how their relationship evolved and the\nstruggles they encountered. Contrary to popular belief, their\nrelationship is not one one would aspire to. I honestly believe, when\nthey were getting married, Jane was happy to be with Stephen thinking\nshe could make his last few years happy. Yet, she didn't realize she'd\ndevote her entire life to taking care of him.\n"},
{"review": "\nAs a man who's favorite movie genre is biopics, I have to confess there\nwas never a time when I wasn't looking forward to this movie. The tale\nof the greatest living mind and his personal life Is something I've\nalways wanted to know more about and as a film It's done best. The\nTheory of Everything is an emotionally moving and beautiful movie in\nmore ways than one. Eddie Redmayne is perfect in the role of the\nacclaimed scientist and Felicity Jones is equally great as Jane\nHawking. With a fantastic supporting cast, a superb script and a\nmesmerizing soundtrack, The Theory of Everything is an excellent biopic\nthat manages to maintain the reputation of Stephen Hawking which Is so\nrare to see in a decade where we've had biopics like Jobs and Diana but\nI think The Theory of Everything belongs with the ranks of Lincoln and\n12 Years a Slave. A perfect movie that will never be forgotten.\n"},
{"review": "\nThe Theory of Everything is the story of Stephen Hawking, the famous\nphysicist. I love biographies myself, and this movie was no exception. <br><br>The plot of this movie is pretty well done. It feels long, but it's\nnever boring. I'm pretty sure I remember hearing that some of the\ninformation was inaccurate, but it's presented in such a way where it\nfeels like it probably is real. <br><br>The characters are the driving force of this movie, and they are pretty\ngreat. They aren't all idiots, and they make the movie feel more\nrealistic. Again, they're presented in such a way where despite being\ninaccurate feel like they are still real. They end up being pretty\nlikable too, which is a nice plus. The actors all help sell their\ncharacters really well, especially Eddie Redmayne. His role was much\nmore physical, and he pulls it off perfectly. The Oscar he won was\ndefinitely very well-earned. <br><br>Overall The Theory of Everything was great. It's realistic and well-\npaced, and there isn't a whole lot that I can say against it (other\nthan inaccuracies in information, which don't really bother me at all).\nIn the end I'd certainly recommend this movie to pretty much anyone.\n"},
{"review": "\nI was always surprised to that as people with big problems with the\nhealth do something. Цhen I have watched the film about Stephen William\nHawking, I have understood why they do it. Life all this. Love all\nthis. The person surpasses all expectations. There are people who after\neach failure cease to do something and go towards the aim. But such\npeople as Stephen Hawking on the contrary keep optimism also aspire to\nthe purpose, overcome all difficulties of their life. I am ready to be\nproud of such people. When I look at them to me there is a wish to\nlive. I think that Eddie has played a leading role in the film\nperfectly, he has given to the audience all emotions, all feelings,\neverything that occurred on the screen. It deserves separate\nadmiration. I am the person who doesn't understand physics and\nastronomy, but when viewing I could understand many things so it is\nvery good when actors speak available language. Stephen's relation to\nthe family and to the friends is shown very brightly. We can understand\nas strongly he loves them and for the sake of what he lives .\n"},
{"review": "\nThe film \"The Theory of Everything \" is a biography one of the most\nfamous scientists Stephen Hawking. Greate acting especially the main\ncharacter Eddie Redmayne. Director pleasantly surprised with his skill.\nAll the fine details of the disease and appearance were observed. The\nfilm inspires and motivates.<br><br>Stephen Hawking fell seriously ill in twenty years. Despite the doctor\npronounced the sentence of death. Stephen was able to start life back\nto the drawing board. He lives without fear, he continues to make\nscientific discoveries , write books , and give lectures. Stephen has\nfull family and loyal friends. He develops against all adds. Stephen\nHawking is a person who is worthy of respect. The unique personality of\nStephen, from the first minutes of the film I began to feel sympathy\nfor him. Throughout the film he struggles with the problems that stand\nin his way. I admire not only the main character but all characters of\nthis fascinating story. Jane Wilde is a loving and faithful wife. She\nstrikes with the power of character. So, the director managed to show\nthe strong personality and human soul.<br><br>After watching the film I was under the impression which not remained\nfrom each film. \"The Theory of everything\" touches the soul. The film\nmakes us think about serious things and teach to appreciate the life.\n"},
{"review": "\nThe Theory of Everything, is an interesting film with some truly\nbrilliant acting especially on the part of Eddie Redmane who deserved\nhis Oscar for an amazing transformation, at times you think it is the\nreal Stephn Hawking. As it was with Jamie Foxx' portrayal of Ray\nCharles this is acting at it's very best. <br><br>Felicity Jones was also brilliant as Jane Hawking and all the\nsupporting cast were all very believable.<br><br>The film itself concentrates on the relationship between Hawking and\nhis wife and touches on the arrival of the Nurse Elaine Maso who in\nreal life he eventually married, although the controversy surrounding\nher is not covered in this film. A lot of the film touches on the\nrelationship between Jane and organist Jonathan Hellyer Jones although\nthere is some ambiguity over what actually happens. The conflict\nbetween Jane's religious views and Stephens views are also touched on.\nIt is a shame more was not made of Mr Hawkins brilliance as a Scientist\nbut then that might be hard to put over in a movie where human\nrelationships are easier to portray. Over all though this is a good\nfilm and worth a watch if only to witness the amazing acting of Mr\nRedmane.\n"},
{"review": "\nThe Theory of Everything is a partial biopic of a physicist-cosmologist\nStephen Hawking. It dwells upon the part of his life when he meets his\nwife Jane and gets to suffer from a severe disease. The story begins\nwith his life in Cambrige, when he met his future wife on a party.\nAfter he was diagnosed Amyotrophic lateral sclerosis which further led\nto paralysis, the doctors made a frustrating prognosis that he would\nhave only 2 years to live. But nevertheless Stephen and Jane never gave\nup hope and kept fighting the disease. Stephen develops a theory about\nthe visibility of black holes and becomes a world-renowned physicist.\nWatching this film, I was impressed by Jane's love for Stephen. In my\nopinion many girls would have left the disabled boyfriend. As a wife\nJane was a very responsible housekeeper. Moreover, she consequently had\nthree children with Stephen. That shows great devotion. She loved him\ndespite his disability. The movie earned several awards and nominations\nincluding the Academy Award for Best Actor. The film received four\nGolden Globe Award nominations. It was well received by critics and\nviewers who noted excellent acting of Eddie Redmayne and Felicity\nJones. In conclusion, I'd like to say that this movie shows that while\nyou live you have hope. I liked this movie very much and I would\nrecommend all my friends to watch it.\n"},
{"review": "\nIn 2014 a new film \"The theory of everything\" came out. It was directed\nby James Marsh and if only I didn't watch this film, maybe I haven't\never hear about him. The main roles were played by Eddie Redmayne as\nStephen Hawking and Felicity Jones as his wife Jane. This film is based\non the Jane's novel \"Traveling to Infinity:My life with Stephen\". You\nknow, Jane refused for three years to screen her book. In this film we\ncan see first Jane's and Stephen's meeting and evolution of their love.\nIn my opinion this film is full of feelings. Some people like to\ncompare this film and another with Benedict Cumberbutch, but I think it\nis silly, because \"Hawking\" (2004) is about science. I think, the main\npoint in this film is Stephen's discovery about black holes, little\ntime is allotted for Jane. And another situation in this film is that\nJane is the main character, after Stephen of course. James Marsh's\nmovie allows us to look at family life. Eddie Redmayen is a good actor.\nHis reincarnation into the famous physicist is worthy to see: his\nmimics, his actions. You must see this. The camera-work was sometimes\nfantastic, but another moment are not so good. In some scenes you can\nfeel the whole tragedy or importance of actions. Some moment were funny\nand some - sad. Also there are some minuses in this film. For example:\nthe camera-work or actors works, in some moments. In conclusion I want\nto say, that I like this film and I will watch it again. <br><br>P. S. Costumes are great! Time rules are complied.\n"},
{"review": "\nThis is one of those movies that you can;t help but simply marvel at\nevery single frame. The cinematography is simply breathtaking, every\nshot a piece of art and I am very surprised that Benoît Delhomme was\nnot nominated for an Oscar.<br><br>Eddie Redmayne truly deserves his award though, his performance is\nbrilliant. He captures Stephen Hawking;s humor, charm and emotion\nbeautifully, it is very easy to make such a character dark and\ndepressing, and he did not do that at all. Felicity Jones also play her\ncharacter superbly, a woman caught between duty to her husband and his\nhorrendous illness. Both actor adding subtle nuances to their\ncharacters that has so much meaning... you can watch the movie again\nand get something totally different from it next time.<br><br>The movie's soundtrack is just as good as the movie, I think it is my\nfavorite soundtrack in a long time. Will definitely obtain it to listen\nover and over again! In short, this is a movie I will add to my\ncollection. It will become a classic.\n"},
{"review": "\nI don't like the fast events without clarifying some important things.\nthe Movement between the years was very fast so wasted things had to be\nshow , It had to be addressed to the human side larger and his\nrelationship with his children and how he live with them , I think it\nhad to be more focus on the scientific aspect in the life of the\nworld's Stephen Hawking, not just the emotional side the film is based\nonly on two revolve around them all events , The good thing from my\npoint is the performance of Eddie Redmayne t made me really feel like\nit's suffering from this disease , I did not like the movie\ndramatically, my view its a bad clone of the movie A Beautiful mind.\n"},
{"review": "\nTheory of everything<br><br>In this review I am going to talk about one of the most exciting\nCharacters in Cambridge City, its talking about one of the most\ninteresting people who made an effect in this world, it was about\nStephen Hawking, he is the former Lucasian Professor of Mathematics at\nthe University of Cambridge and author of A Brief History of Time which\nwas an international bestseller.<br><br>Stephen Hawking was born on 8 January 1942, and he lived his life\nwithout moving, he couldn't enjoy his like we do, but he didn't give\nup, he continued his life.In 1963, Hawking contracted motor neurone\ndisease and was given two years to live. From 1979 to 2009 he held the\npost of Lucasian Professor at Cambridge.<br><br>In my opinion he is someone who really deserves to have a movie made\nabout him , how he lived , and what difficulties he had in his life ,\nhe passed everything because he was so patient .There are some people\nwho really wish that they have his patience , his intelligence , his\nwisdom.<br><br>Finally, after reading Stephen Hawking history , I advise everyone to\nwork harder , and didn't give up because he was sick or any other silly\nreason , because Stephen Hawking is the right man who can be shown as\nan example of this world's heroes .\n"},
{"review": "\nWhen you make a biopic of someone who is still alive, it is extra\nchallenging to keep the balance what is true, and what is glorified.\nAnd when you make a movie that cover a number of years, you're going to\nhave to make some shortcuts.<br><br>The scenes in this movie that were done for exposition or explaining\ndifficult concepts worked quite well, and while you know it's one of\nthose aforementioned shortcuts, they do not break the flow of the movie\nat all, or take you out of the realism.<br><br>The story is a great one, and one that needed to be told. Because of\nhis illness and his genius, it is difficult to understand Stephen\nHawking as \"just another guy\" - but this movie shows us how he\nstruggles with the same emotions as the rest of us. And he shows a\ndifficult relationship in a way that respects both parties.<br><br>That said, I do wish they could have explained Hawking's importance in\nthe world of physics a bit more, as the movie shows that he is\ntalented, but does not really delve into his talent.<br><br>The main attraction in this movie is the acting. Redmayne's performance\nseems to be spot on. You realize from the moment he moves that he is\nthe perfect choice. Felicity Jones did a great job too, balancing the\nemotions of the character. The rest of the cast had good performances\ntoo, but maybe less to work with.<br><br>One thing that was a bit odd was the colors. I'm not into the lingo of\nthis, but it was almost like the whole movie had been run through an\ninstagram filter, which was a bit jarring at times.\n"},
{"review": "\nTHE THEORY OF EVERYTHING has everything you'd expect from the typical\nHollywood biopic, and as such is rather predictable. Not only that, but\nits subject is still alive (and very famous) which robs it of a lot of\ndramatic tension. Still, Eddie Redmayne gives an extraordinary,\ntransformative performance as Stephen Hawking, as does Felicity Jones\nas his long-suffering first wife Jane. The story starts with Hawking's\nyears at Cambridge and up through the publication of \"A Brief History\nof Time.\" Instead of focusing on the accomplishments, the film is\nreally about the relationship between him and his first wife, as the\nbook is based on her memoir. The romance kind of comes out of nowhere,\nbut after spending two hours with them you really begin to feel for\nthem, especially Jane, who ended up having to put in overtime as her\nhusband's caregiver (until help was brought in). The scenes which show\nthe gradual progress of Hawking's condition (Motor Neuron Disease/ALS)\nwere quite moving as well, but only in the most general sense. It also\n\"helped\" that the score hinted at just the right moments when you were\nsupposed to be emotionally affected. So, while the film is sure to stir\nup emotion and possibly provoke tears at certain points, nothing the\nfilm does with those moments is that special in and of itself. What\nreally makes this film worth seeing is for Eddie Redmayne's\nperformance, which deservedly won him the Best Actor Oscar this year.\nOf course, the rest of the cast, which includes Emily Watson, Charlie\nCox and David Thewlis, does outstanding work as well. Overall, it's not\nparticularly groundbreaking in terms of the biopic and romance formula,\nor in its execution, but Eddie Redmayne takes it to another level with\nhis portrayal of one of the world's greatest living minds.\n"},
{"review": "\nI think Director James Marsh is successful in creating a drama out of\npure internalization. Not a scene is this film that emotions are so\nvisible. We do not see, but feel so much. This is why a film without so\nmuch plot can get away to become an art piece. What is best in this\nfilm is the sense of restraint, owing, I believe, to Mr. Marsh. He must\nhave directed Eddy Redmayne and the rest of the cast to feel first and\nact later. Probably an act is not necessary, if you feel so accurately.\nI am always marveled by the English school of acting. Big or small\nscreens. They do wonders with the mundane of lives in particular. While\nAmericans look for something extraordinary, English instead eye for the\nnormality, which always turns out to be not so normal. Professor\nHawking, as well as his beloved Jane, come alive in this film. They are\nactually alive, and this film will ensure that they are, even after\nthey no longer are. A scene of their breakup is amazing. Loving,\npainful, understanding, and heartbreaking. How can four feelings be\nincorporated into one scene, I still wonder? That's life, isn't it?\nBittersweet at best, and always conflictual at extremes. If there is a\ncaution for Eddy Redmayne, it is by way of being tied to the same or\nsimilar character. Felicity Jones, on the other hand, will continue to\nbe versatile and multi-purposed. The Oscar-winning brand can also be a\ncurse, one of which I wish all the best for our dear Mr. Redmayne.\n"},
{"review": "\nI will always have to wonder how this movie is viewed and received by\nnon-Scientific viewers. I am a Scientist, of Hawking's vintage. My main\nareas are Math, Chemistry and Physics. So I went into viewing this\nmovie already pretty familiar with Hawking and his works. <br><br>Eddie Redmayne of course won the best actor Oscar for his performance\nas Hawking and it is fully deserved. Felicity Jones is fine as his\ngirlfriend who stands by him when his illness is diagnosed and becomes\nMrs Jane Hawking. <br><br>The story here starts in 1963 when Hawking is a new graduate student in\nPhysics and is having difficulty declaring a field of study for his\nPhD. But he finally gets inspired and writes a thesis on the origin of\nspace and time as a singularity that became the Big Bang. Of course\nlater in life he said his new theory goes against that earlier one.<br><br>The thing about this type of Physics, there is no good experimental\nevidence for most of them, making it difficult to know how valuable\ntheir contributions might be, aside from his best-selling book \"A Brief\nHistory of Time.\" <br><br>As the movie unfolds we don't get a good feel for the time but in the\nend there are Hawking children in their late teens so it must have been\nup to about 1990 or so. We see Hawking's physical health degrade, his\nbeing fitted with various devices that allows him to communicate.<br><br>Good movie.\n"},
{"review": "\nI have longed for years that a good movie on Stephen Hawking come\nalong.And boy they did their best in this work. Eddie Redmayne did a\nbrilliant job playing hawking character which is perhaps most difficult\nto portray as he has motor neuron disease. Eddie was at his best to\nportray hawking with the depiction of struggle with disease. His facial\nexpressions simply made you feel wow...thats acting. Felicity Jones was\nequally awesome. After a long time I have seen superb acting by such a\nbeautiful female artist. The movie plot have not stressed on much\ntechnical details of hawking works but it kind of present the big\nhighlights of hawking career. Must watch for audience.\n"},
{"review": "\nI have read reviews about this movie being a total cliché. Well, think\nabout life of any ordinary human being these days. You're born, luckily\nsomeone will take care of and love you -- parents -- and you're likely\nto go through pre-school, elementary, mid-school, high school, college\nand find a job, get married, have kids or a career. What is different\nin all of that? It is YOU!! You think, therefore you are able to make\nyour existence worth. Some will make it, some will not. Some will get\nnowhere although they totally were born equipped and some will do so\nmuch better against all the odds. Life. We all look for the same thing:\nhappiness! Find a point to support our existence, find our passion. and\nmaybe, finding nothing at all, just live one day at a time and enjoying\nthe show as it is. Some good days and bad days, but yes, as long as\nthere is life, there is hope. It is a total cliché, and it is total\ntrue! Find your joy, find your passion, it might be just before your\neyes! Life is a show, I don't want my money back, not yet, not now!\n"},
{"review": "\nThe Theory of Everything is based on the book by Jane Hawking, the wife\nof Stephen Hawking. Director James Marsh caption gives you a very\nbeautiful and dramatic interesting insight to the life and career of\nJane and her husband Stephen Hawking. How one women falls in love,\nstands by and helps create his future and educates the world while his\ndiagnosis of ALS worsens. Featuring Eddie Redmayne as the celebrated\nphysicist Stephen Hawking who won Best Actor at the Oscars 2015 for his\nsuperb performance. With the amazing Felicity Jones as the brilliant\nand strong Jane Hawking, who was nominated for Best Actress in a\nLeading Role for the Oscars 2015.\n"},
{"review": "\nThere are two kind of movies I normally never watch and those are\nmusicals and romances. Musicals I will for sure never watch them,\nromances every now and then if the story looks good. Well with \"The\nTheory Of Everything\" I have to say that it was an amazingly beautiful\nmovie. It's been ages that I dropped a tear for a movie. Since you know\nit's a biographical movie about the life of Stephen Hawking and his\nwife Jane you are of course living the story differently then if it was\nfictional. I have the greatest respect for people that dedicate their\nlife for their loved one with a physical handicap. It's not easy for\nthe handicapped but it's also not easy at all for their family. They\nhave to see how their loved one struggles in life and have to stay\nstrong and positive. It all makes you think what an easy life we have\ncompared to people with such problems and that we should enjoy every\nmoment of it. Eddie Redmayne (as professor Stephen Hawking) gave us an\nOscar winning performance. I was blown away by his performance. His\nwife Jane played beautifully by Felicity Jones made me cry with her\nrole. I tried to hold it as long as possible but I couldn't anymore at\nthe end. What a beautiful story this was. This is what true love is\nsupposed to be. You're never too old to learn a lesson and today I\nlearned one...\n"},
{"review": "\nHow Birdman won over this movie, I will never understand. This movie is\nsuch a wonderful movie. It has a lot of sadness, but a lot of strength,\ncourage and determination.<br><br>The acting is wonderful and the lead actor plays the part so well, that\nyou would think it's Stephen Hawking. It has its own humor as well so\nit's not all sadness.<br><br>Even Stephen Hawkings voice was used for the speech parts.<br><br>A must watch. It made me cry and probably only 5 other movies have done\nthat, and I've watched thousands over 30 years<br><br>10/10\n"},
{"review": "\nThe intense, heartstrong, tragic saga of Professor Stephen Hawking, who\nsucceeds professionally despite the personal and physical tolls of an\nearly-onset ALS diagnosis. It handles the subject remarkably well,\nplacing us in the wheelchair right beside him throughout his physical\ndescent. When he aches, struggling with staircases, obligations and\nwords alike, we hurt along with him. We fall head over heels for\nHawking's relationship with his young love, Jane Wilde, only to watch\ntheir spark slowly flicker amidst the trials of his condition and\nincreasing social status. It's a bittersweet combination of enduring\nhope and crushing loss. Beautifully shot and superbly acted,\nparticularly in the two lead roles, this is a wonderful encapsulation\nof the vibrancy of a life well-lived. Well worth watching, it's sure to\nmove you in many different ways, and maybe even make you think twice\nabout what you've unsuspectingly put your own loved ones through.\n"},
{"review": "\nThe movie lacks a little historical accuracy and shows Hawking's\nscientific accomplishes in a very romantic way. However, it's precision\non the family drama of fighting ALS is remarkable. As a witness to the\ndevastation that condition can cause in people's lives, the chronology\nof the symptoms, the eye and face muscles expression, it's all there.\nit's astonishing how the lead character catches the essence of the\nillness and represents it as it truly is. The plot also lacks a little\npassion and some scenes are to forced away, but it's a good movie, a\ngood representation of Hawking's struggle and a surprisingly great\ndescription of the ALS reality.\n"},
{"review": "\nEddie Redmayne's transformation is certainly amazing, Felicity Jones is\nperfect as the beleaguered Mrs. H, and the geeky Cambridge courtship\nscenes are charming, but it's harder to dramatize the breakdown of a\nmarriage or the birth of a scientific theory. Director James Marsh has\nto resort to cinematic shorthand\u0097Jane tries to concentrate on her\nthesis while Hawking zooms around in his wheelchair, surrounded by\nshrieking kids\u0097and unconvincing biopic bushwa\u0097Hawking stares at a\nsputtering log in the fireplace, and the theory of Hawking radiation\n(emitted by black holes) is born. <br><br>The script's based on Jane Hawking's memoir, and the film briefly comes\nalive for her platonic romance with the widowed choir director (Charlie\nCox) who became her second husband when Hawking took up with a\nvivacious nurse (Maxine Peake!). The heart wants what it wants, but\nthat makes for an inconclusive ending for this watchable but\nuninvolving film.\n"},
{"review": "\n\"The Theory of Everything\", the movie about Stephen Hawking, is truly\ninspiring, well- written &amp; acted, will most likely make you cry (you\ndon't stand a chance if you cried during the notebook lol), but a MUST\nSEE! For a Hollywood screenplay, the film authentically portrays (with\nminimal discrepancies) the actual lives of Stephen Hawking and his\nfamily, verified by his former wife Jane (of 30 years) and Stephen\nHawking himself. It is important to see this film even though it might\nbe difficult to watch at some points. Hopefully afterwards you might\nsee things/life in a different perspective? Jane is the absolute\nepitome of devotion and fortitude as well as Stephen with his ambition\nto effectuate boundless achievements despite his circumstances. As\nStephen Hawking says, ...\"while there's life, there is hope\" also known\nas \"where there is life, there is hope\" in a related speech<br><br>Do not listen to negative reviews people seize to amaze me on how\nignorant they are to an extremely rare and precious film. The main\ncharacter, Edward Redmayne (so talented and adorable), won countless\nawards for his performance. Just outstanding...\n"},
{"review": "\nWell, it is easy to see why Eddy Redmayne won the best actor for this -\nhe absolutely was Steven Hawking. The film really is first class and\ntells a story of Hawking's life (I say \"a story\" not \"the story\")\nextremely well. As a piece of story-telling it is an example to hold up\nto other film-makers. It is of course a crowd-pleaser and a\ntear-jerker, but what is wrong with that - it is what we expected after\nall. It keeps well clear of the \"science\" of course - again, to be\nexpected. <br><br>The main focus is on his terrible disease and the impact on his\nmarriage. Hawking's attitude to his wife however is shameful and I\nsuspect that the film and indeed her book glosses over some things -\nafter all, who could be critical of a man who has suffered so much? <br><br>I watched this film in an excellent VUE cinema with a 4K Sony\nprojector, and the images shot by Benoît Delhomme on the Alexa were\nbeautiful and very subtle. A few close-up shots suffered from poor\nfocus and others from clumsy focus-pulling but in an average cinema I\ndoubt anyone would notice. His colour palette and the colour grading\nwas very clever - quite a bright sunny almost Kodachrome look which\ncontrasted with Steven's terrible disease but fitted with his amazing\nsmile. This is a very good film indeed.\n"},
{"review": "\nI approached this film knowing something of Stephen Hawking's life and\nwork but with no real interest in watching a full-length movie about\nit. But I'm glad I did see this wonderful film. For his deeply-moving\nstory is a revelation, exquisitely realised by Eddie Redmayne, as\nHawking, and Felicity Jones, as his wife, Jane, under the direction of\nJames Marsh.<br><br>Here is this amazingly bright young man on the verge of a brilliant\nacademic career as a cosmologist. He falls in love with a beautiful,\nintelligent girl and she with him. Their life is set on course for a\nglittering future when he is struck down by a tragedy of Beethoven-like\nproportions - a man who may well be about to produce the 'theory of\neverything', the holy grail of physics, is diagnosed with an incurable\nterminal disease and is given but a short time to live.<br><br>And yet somehow, against all predictions, he does not die. Not only\nthat, he manages to fulfil and exceed all expectations, both\nprofessionally and personally. He writes books, he wins prizes and\naccolades, he fathers a family. With the loving support of his wife,\nJane, he becomes truly The Man Who Refused to Die. But even then there\nis still a heavy price to pay ...<br><br>It is no surprise to see that Redmayne won an Oscar for his performance\nhere. His portrayal of Stephen Hawking's gradual faltering collapse is\ntotally convincing, as is Felicity Jones's depiction of Jane Hawking as\nthe exuberance, optimism and energy of youth are eroded away as the\nyears pass and the sheer strain of keeping her husband and family\nfunctioning leaves its mark. How cruel life can be!<br><br>But there is nothing mawkish about this film. It looks unflinchingly at\nthe sadness and the joys, the successes and the failures, the\nbeginnings and the endings. Highly recommended.<br><br>(Vieweed at the Warrington Odeon, UK, 11th January 2015)\n"},
{"review": "\nUnfortunately, I'm not sure what The Theory of Everything is about. It\nventures many places but arrives nowhere. Everything seems to be in\nplace. The acting is some of the best I've ever seen and the musical\nscore is fitting. Nothing comes across to me as sappy in the entire\nrunning time of the film. Still, I am left empty.<br><br>Maybe the blandness of the film is derived from the fact that Hawking\nis not yet dead. Maybe, if he was it would be easier to pinpoint\nexactly what his life was about. Instead, we are left with a film about\ntheories and scientific discoveries but are also left absolutely\nclueless as to what they are about. Personally, I do not know much\nabout Hawking, but this film did not succeed in making me any more\ninterested in researching him.<br><br>Don't get me wrong. This is a very good film. It takes the viewer on a\nreal journey and gently presses you to feel. Can we live with\nourselves? If we had to carefully select our words, as Hawking does,\nwould we have anything to say? I believe each of us would live much\ndifferently if we were truly grateful for what we have. I don't think\nanyone realizes this as much as Dr. Hawking.<br><br>Overall, a well-deserved Oscar for Redmayne.\n"},
{"review": "\nEddie Redmayne's acting in this movie was absolutely astonishing. One\ncan only imagine how challenging it would be to play the character of a\nman with such a serious disability. Stephen Hawking is such a unique\nman, and Redmayne could not have done a better job at portraying every\naspect of a brilliant man with a life threatening disease. The way that\nhis actions changed and progressed as the disease got worse really gave\nviewers an idea of the emotional and physical struggle of motor neuron\ndisease. The only thing I would have liked to be different is the\nromantic aspect. I really wish that Stephen and Jane stayed together\nuntil the end because their love for each other was something I really\nenjoyed about the movie. Overall, this film was wonderful and showed a\nfantastic depiction of those who struggle with disabilities.\n"},
{"review": "\n\"There should be no boundaries to human endeavor. We are all different.\nHowever bad life may seem, there is always something you can do, and\nsucceed at. While there's life, there is hope.\"<br><br>The story of the life of Jane and Stephen Hawking. This emotional\ndriving movie is a remarkable achievement in telling a life story that\nstays true from beginning till' end to the incredible, Stephen Hawking.\nBut what was the Beginning?<br><br>Because of the movie, those who didn't knew much about the scientist,\nnow know more.<br><br>The extraordinary movie impressed it audiences with an unique touch to\nthe story of Hawking. A well written story line that is astoundingly\npresented by the great acting performances. Both Eddie Redmayne (as\nStephen Hawking) and Felicity Jones (as Jane Hawking) did a phenomenal\njob playing those persons. Yes, Eddie Redmayne really deserved the\nOscar for Best Actor in an Leading Role.<br><br>Also, I found it beautiful to see the whole movie rewind in the ending.\nIt was very unique to see the end till' the beginning, because this was\na special way to end the beginning. While there is love at first side,\nthere's love till' the end. And that's what I had with this movie.<br><br>- The Theory of Everything is the best romance movie based on a true\nstory of 2014.\n"}
]