[
{"review": "\nDark and twisted, David Fincher's stylish new mystery thriller was\nderived from Gillian Flynn's intriguingly slick tale from her complex\nand suspenseful novel. By far one of the best acting performances to\nhave come from Ben Affleck, 'Gone Girl' boasts some strong yet\ndisturbing portrayals from Rosamund Pike, Neil Patrick Harris, Tyler\nPerry and Affleck. Fincher has garnered fame and recognition as a\nmainstream director, that is not only able to engulf the audience\nwithin the picture, but actually make them part of the scenario.\nFincher exercises upon his trademarks with the swift and stunning\ncinematography, the chilling score and tight editing, all of which\nmakes 'Gone Girl' a movie full of great visual storytelling.\n"},
{"review": "\nPlease do not waste your time or money on this nonsense. Oh boy where\ndo I start. OK for me the worst thing is when she gets back and tells\neveryone that Neil Patrick Harris \"kidnapped\" her (Rosamund). He did\nthis by bludgeoning her and she lost a large amount of blood which he\ncleaned up. Then he takes her diary to her husbands fathers house to\nburn!!!!! (how does he even know of this location)?????? But he makes\nsuch a p!$$ poor attempt to burn it which would take 5 min to do\nproperly as opposed to the 30+ to clean the blood. and no one questions\nthis even once!!!!!!!!!!!!!!!!!!!! No one even looks for any wounds or\nasks about her wellbeing and she is not treated for any wounds. Oh and\nthe hospital sends her home covered I mean a copious amount blood. No\nflipping way, the hospital would clean her looking for wounds\nespecially with this much blood.I could go on and on but just read the\nother truthful reviews they will point out most of the other glaring\nmistakes and downright intelligence insulting nonsense. I really wish\nIMDb would have a 0 or negative review number as this does not even\nrank a 1. I give this -5 for utter bull$h1*.\n"},
{"review": "\nJust seen the film Gone Girl. <br><br>I really struggled with the book and found it incredulous so never\nfinished it but the film was getting good reviews so I thought I'd give\nit a go.<br><br>What a pile of crap!<br><br>Two and a half hours of my life wasted. The story is just unbelievable.\nNeither character makes you like them or hate them. They are just bland\nand, well, unbelievable. <br><br>By the end I just wanted someone to firebomb the house and kill the\npair of them. I would have stood up and cheered. As it happened it has\na really lame ending.<br><br>A waste of my life. Utter tripe!\n"},
{"review": "\ni got pulled in at the start it turned out like any other mystery,\naction movie all the clues and other attributes etc...<br><br>but there was so many thing that just are so IDIOTIC that it pisses me\noff. <br><br>I have had so much tension on this from the book thinking it will be\namazing but it all went away half way through the movie.<br><br>Spoilers: The part when she actually tries to make up the part of rape\nand when she puts wine on her skirt and whatever was so STUPID, WHAT\nABOUT THE BLOODY CAMERAS YOU IDIOTS. And if you're going to say she\ndisabled them, the what about the actual fake rape scene. she sucked\nhis dick and was wearing lingerie for gods sake who wears lingerie\nrandomly. if they looked at the cameras to watch the rape then what\nabout the dick sucking and shirt tearing and pulling him in on you,\nthen pulling a knife out from under the pillow. <br><br>But what finished it for me was the ending. WHAT MAN LIKE HIM IN THEIR\nOWN MIND WOULD STAY WITH A MURDERING BITCH LIKE THAT AND STILL LOVE\nHER. <br><br>This was my opinion you don't have to agree but i just found it so\nstupid.\n"},
{"review": "\nActually a good well acted movie till the end. Ben Affleck was\nexcellent and Rosamund Pike had me 100% convinced she was evil\nincarnate. Carrie Coon as Ben's twin sister and Kim Dickens as the lead\ndetective also gave excellent performances. As for the story, I can\ndeal with sad endings where the hero dies like Braveheart, Cool Hand\nLuke, and endless others. When the credits came up on Gone Girl, I\ncould only regret spending over 2 hrs to watch a movie that left me\nthat angry. I would have preferred she had just killed Ben Affleck and\ngotten away with it. Assuming the book had the same ending I would have\nthrown it across the room upon finishing it. I enjoyed the movie up\ntill the end but that completely ruined it for me.\n"},
{"review": "\nThought this would be a good thriller, but ultimately it was draining\nand depressing. Would think any man who sees this film would never want\nto have sex again......it portrayed woman/women as being monstrous and\nmen as passive, sex-crazed zombies. The story had so many loose ends\nand unbelievable scenes, such as where she returns home covered in\nblood.....then she's at the hospital - there had to be an exam, then\ngiving an interview to detectives, then comes home still covered in\nblood....how much time elapsed during these scenes, and who would allow\nher to drive around, carry on, covered in blood for all that time? With\ngreat emphasis on crass words for women, violent sex scenes, and a\nscore that sounded like a synthesizer importing screeches from an\nairport runway, this was one depressing film. The only place it was\nbelievable was in its depiction of the media and how they revel in\ntragedy and perversion. If this becomes our prime form of entertainment\nwe are in big trouble. Need to watch a pre-1960 film or musical now.\n"},
{"review": "\nNever again will I trust the Metascore. Big fan of David Fincher, but\nlet me tell you this movie was spectacularly bad. The score was ham\nhanded and clashed with the film itself and I was embarrassed for the\nactors at some points that they had to say the ridiculous lines in the\nterrible script. I felt every single minute of this 149 minute movie.\nAt one point my husband turned to me and whispered \"this is really bad\"\nand we started laughing. Then we started rewriting the story and\nrecasting. For example, Ben Affleck could have played his own twin\nsister and it wouldn't have made the movie any more ridiculous. You\nmight love it. I really, really did not.\n"},
{"review": "\nThe first act of the movie is the run-of-the-mill wife gone missing,\nthe husband accused of killing her plot. This is clearly established in\nthe theatrical trailer and may have thrown off some potential viewers.\nTo the people who are familiar with David Fincher's work, this is not\nthe case with Gone Girl.<br><br>Yes, the first act is very ordinary, but the second act uproots\nwhatever ever considered dull about the movie as it takes a rapid turn\ninto thriller stardom, resembling something taken out of a Hitchcock\nmovie. Only a handful directors can completely enhance the movie's\nnarrative through editing, and Fincher is one of them. I know there is\na lot of praise around Rosamund Pike's performance, which makes it easy\nto overlook Ben Affleck. He plays the tired, oblivious and boyish\nreally well. This may be the very reason why he is completely\noverlooked.<br><br>And in a time of sequels, prequels, remakes and biopics, finally a\ncontemporary piece of work! Stellar!\n"},
{"review": "\nTwo movies for the price of one. <br><br>That's a fairly glib start to a review of a movie that I really liked,\nbut it is true. The first half of Gone Girl is a fairly standard \"did\nhe or didn't he\" mystery thriller. Then, about an hour in, the\nperspective shifts entirely and suddenly you realise that you're\nwatching \u0096 perhaps \u0096 the most pitch-black comedy that you've ever seen. <br><br>Despite the abrupt shift, I still think that Gone Girl holds together\nextremely well as one whole movie. Ben Affleck's Nick manages to\ninspire sympathy without ever being truly likable while Rosamund Pike's\nAmy (the star of the show in my opinion) is brilliant, terrifying,\nhilarious and despicable in various combinations and occasionally all\nat the same time.<br><br>David Fincher's direction is both classy and clever (as usual) and\nseveral scenes are particularly outstanding due at least as much to his\nbrilliance as that of the actors involved in them. My one complaint\nwould be over the length \u0096 it really didn't need to be two and a\nquarter hours long. There were certainly a few moments, particularly in\nthe first half, when I wished that the movie would hurry up and get to\nthe point just a little more quickly.<br><br>Gone Girl is a movie unlike any that I've ever seen before and as such\nlargely defies further description. I would recommend this movie to all\n(with a warning that the adult rating is well earned) but especially\nthose with a dark sense of humour. The darker the better.\n"},
{"review": "\nGone Girl is directed by the mastermind of David Fincher. Amazingly\nwritten by Gillian Flynn whom wrote the novel the film is based on.\nStarring Ben Affleck as Nick Dunne and Rosamund Pike as Amy Elliot\nDunne. On the day of their 5th wedding anniversary Nick's wife, Amy\ndisappears out of nowhere, and this crazy, intense and haunting journey\nbegins. David Fincher and Gillian Flynn's intelligent storytelling\ntrough out this fantastic journey will keep at the edge of your seat\nfrom start to end. The soundtrack and score is also very intense and\nhaunting, and has huge impact on the film. The performances from all\nthe actors, especially Rosamund Pike are top notch which really helps\nthe element of the realism stand out in this film. <br><br>Gone Girl is easily the best film I have seen this year so far, and I\nhave to give it a 10/10. It is also one of the best films from David\nFincher in my opinion. I strongly advice everyone to go and see Gone\nGirl, it is one thrilling ride.\n"},
{"review": "\nAfter watching over the first hour of this movie I just couldn't stay\ninterested in any of the characters or even in the plot for that\nmatter. In fact I was kind of hoping that his wife was dead and not\njust missing. I really hoped he killed her because I didn't like her\ncharacter and I really hoped Affleck would die too in a shoot out with\ncops; and I kind of hoped he would get lucky and kill them also. Well\nmaybe not the sidekick, he was cool. I just couldn't relate to all of\nthe pretentiousness of the wife's family or even Affleck himself. I\nmean, I even hoped her parents would die because they were jerks too.\nAbout the only person in that movie I found interesting was Affleck's\nsister, I think her name was Margo. The movie just failed to hook me in\nan hour and fifteen minutes. No plot twist can recover the amount of\nboredom I had at the one hour mark. Plus there were some very graphic\nscenes that didn't really add to the movie (not all, some very well\nexpressed how disturbed individuals were). I don't need to see Affleck\ngoing down on a chick on his first date to kind of figure out they\nbumped uglies. Graphic scenes have their purpose but when you over-do\nit, you lose value.\n"},
{"review": "\nI wish I could rate this movie with a 0 Maybe the first part, is OK,\nbefore anything happens. When the action starts, you see that the\nacting, the plot, everything starts to go down the drain. I must say\nthat in general the acting is very bad, and there are very stupid\nmoments. Like when the wife returns after killing her ex-boyfriend, she\nis interviewed at the hospital were she arrived covered in blood,\ntelling the story that she was raped. Well nobody cleans all the blood\nof her in the hospital, and she is in a room with at least 10 FBI\nagents that look goofy, a lot of local police, plus husband, lawyer etc\netc. Then she leaves with her husband that was accused of murder and\nthey go home together. Then I walk out, maybe 10-15 minutes before what\nI understand was a awful ending.<br><br>How can IMDb give such a high rating?????\n"},
{"review": "\nHaving read the book, it was not an easy feat who will be able to bring\nto life the leading character of the book, which is Amy Dunne. Her\ncharacter is so complex, that Rosamund Pike deserves all awards that\nwill be coming to her. She was able to give Amy the mysterious vibe but\nlikable aura of a socialite New Yorker.<br><br>The score of the film is perfect, as it builds up suspense and the tone\nof the story. Great supporting performance by Ben Affleck, and the\nactress who plays her sister. Great ensemble cast who works together to\ndelivery the dark humor lines in the film.<br><br>This movie will definitely be an instant classic and I cant wait to\nwatch it again!\n"},
{"review": "\nAs I read through the reviews and view the scores given to this movie\nby my fellow members I wonder if there is something deeply wrong with\nmy perception. Or if others are drawn in by the ultra hype some movies\nare given before release and with that expectation start off viewing\nwith rose coloured glasses.<br><br>i.e. I saw almost everyone who acted in this movie on almost every talk\nshow before its release. There were rave reviews in news articles both\non and offline, on social media sites etc.<br><br>I enjoyed parts of the movie even if I felt some of the characters did\nnot have a good fit with others and most scenarios were not plausible.\nThe story was interesting enough and fast enough paced to keep the\nviewer wanting more, but wanting is the key word here. The full air of\nmystery did not exist. Many areas did not leave much to the imagination\nand one was able to draw conclusion long before it played out on\nscreen.<br><br>Finally the ending failed miserably. Almost as if the writer reached a\npeak, ran out of thoughts and threw something together for a quick\nfinish. I was very disappointed. I would have given a higher score if\nnot for the movie's lack of a fulfilling end and the many unexplainable\nloopholes. Bottom line I was surprised after all the hype this movie\nturned out to be so very, very bad.\n"},
{"review": "\nI have always been a huge admirer of David Fincher. He is undoubtedly\none of the most consistent and masterful storytellers in modern cinema.\nI also think when it comes to dark, disturbing thrillers, there is very\nfew who can match the directorial skills of Fincher. <br><br>Like many of his previous films, Gone Girl is a very long film, but in\na true Fincher-esque fashion, it is as engaging as possible without any\nscope for the viewer to feel bored. The pacing is perfect. The scenes\nhave a dreamy style to it, which brings the dilemma of \"whether this is\na true account of things or has this been made up by the narrator.\" <br><br>The theme of the film is the fact that humans at the basic level are\nall actors and pretenders. Very seldom do we decide to be our real\nselves. Generally all of us put on a mask to make ourselves look good\nin front of the general public and also to pretend to be the person\nthat our nearest and dearest want us to be. Gillian Flynn's screenplay\nbased on her own novel is brilliant and it is also a damning indictment\nof how media can shape and mould mass perception and it is also a\ncynical account of the institution of marriage.<br><br>Ben Affleck is good, Tyler Perry is good, but this movie from an acting\nperspective belongs to Rosamund Pike. She owns every scene that she is\nin and delivers an Oscar-worthy performance.<br><br>Fincher has once again has made a fantastic film. The last 30 minutes\nmight not be completely logical, but it is still symbolic. If you are\nabout to get married,stay away from Gone Girl.\n"},
{"review": "\nGone Girl had the potential for a great plot and movie, the plot was\ngiven away very early on as you knew he didn't do it because of the bar\nscene with his sister, then I sat there bored with a couple of moments\nof interest. Seemed to have some resemblance to the Lacy Peterson case,\nin other words lost some otherwise originality. So you know what is\ngoing to happen what you didn't know was all the details of why, which\nfound dull, I like more of a traditional mystery/drama. Personally\ndidn't see any academy award acting. The ending was way to far fetched,\njust absolutely unbelievable that 3 law enforcement agency would just\ntake a position of \"Oh Well\", the group grope to interview her was\ntotally unrealistic, I really was wondering if this was such a low\nbudget film they just didn't have enough funds to complete the movie\nand they had to jam multiple plots in a single scene. I think the hype\nthis is getting is why people believe our entire world is contrived, we\ncan't all be crazy. The movie was a loser.\n"},
{"review": "\nThe ratings were so high for this movie.I was sure it would be a great\nfilm. What rubbish it was. For the first hour I kept looking at my\nwatch,it was so slow moving. Ben Affleck was average in his\nperformance. The acting of Rosamund Pike was way over the top,even\nthough she played a psychopath. There was so much sex,oral\nsex,suggestive sex in this film for pure shock value or maybe to make a\nboring movie more interesting. But nothing could help this moronic\nfilm.At the beginning I couldn't even hear the dialogue between them.It\nwas so garbled.The plot was silly in my opinion. There are more\nfascinating plots in real life. And the men portrayed in this film are\nspineless weaklings while the women are tough and crazy.For example,the\ncrime stories of killers Jodi Arias,Casey Anthony,and all the other\ncrime plots on 48 hours or Dateline are mysteries which are\nfascinating,as well as being true.Thankfully,I had a gift card to this\nmess of a film,so paid very little. Why it is considered the best new\nmovie out this week doesn't say much for the calibre of movies made\ntoday. Do not waste your money on this very bad crime mystery.Better to\nwatch 20/20,or 48 hours at home. I like David Fincher as a director but\nnevertheless was extremely disappointed.The lesson here is don't\nbelieve the critics, audience and/or ratings all the time. Do some\nresearch.This film is a waste of your time and money.\n"},
{"review": "\n2014 has had it's good share of movies and good movies for that matter,\nwe've had the Nolan's Mind boggling interstellar to start with and then\nthe grand Budapest hotel which got much of the appreciation by all and\nsundry. We had our good share of sequels and prequels ranging from The\nPlanet of Apes series to spider-man, X-men, Hobbit, how to train your\ndragon, 300, Hunger games, 22 jump street, horrible bosses two, dumb\nand dumber two, transformers, expendables and.... *Sigh* it doesn't\nstop here there's more to them a lot more but it isn't about all of\nthese.<br><br>The movie starts as a normal murder mystery and somewhere 15-20 minutes\nin the movie you'd be like what makes it deserve all that appreciation?\nBut wait, it hasn't even started yet. It isn't all what it seems like\nand one surely can't judge the book by its cover in this case. The\nmovie is fully of surprises and at the end of it you'd be all smiles\nthat's all i can say!<br><br>I'm not here to give away spoilers but if you haven't watched this\nmasterpiece yet just rush back home and order it on Netflix or buy the\nDVD.\n"},
{"review": "\nDavid Fincher has done what i thought was the impossible, by making a\nmovie from a book, and it actually being good, i'm even going to say\nbetter than the book, and i don't give that out lightly.<br><br>First off, the use of sound within the film, both diegetic and\nnondiegetic really sell this film to me, it does a great job in\nunnerving us as an audience and its just a little off, if i looked at\nthe score of the film, i wouldn't be surprised if it comprised of\ntritones (For those who don't know, tritones make music sound just that\ntad off), and the synth sorta sound reminds me a lot of Alex Forrest's\nsignature tune from \"Fatal Attraction (1987), Adrian Lyon\"<br><br>The Story is fantastic it really shows the disconnect between people in\nthe modern day, and how the media influences everything so strongly.<br><br>In Summary this movie is a great watch, and if you enjoy the genre, or\njust trying to put together pieces of a metaphorical puzzle you will\nenjoy this movie.\n"},
{"review": "\nAnd I don't think it's me. If you want to know specifically what's\nwrong with this flick look at some of the other 1* reviews. It's been\nspelled out in detail. What I want to talk about is how this dumb movie\nhas an 8* rating with over 200k people rating it.<br><br>The first thing that comes to mind is what I read about another new\nrelease, \"The Interview\" which had a high rating and lots of positive\nreviews within 24 hours of it's release. Someone pointed out the\nstatistical aberrations of those numbers suggesting IMDb was getting\nbombarded by false accounts with an addenda to deceive.<br><br>For this movie I don't think that's the case so I'm wondering how so\nmany people can be so uncritical in their thinking. Well, about half\nthe voters in the USA voted to re-elect George W Bush, so that explains\na lot.<br><br>For those of you who gave this movie high marks and didn't vote for\nBush's second term, please consider this for the future:<br><br>There are movies where we are presented with a made-up reality from the\nstart. Like time travel for example. Or unreal mental states like in\nTron or The Matrix. With those you say, OK, it's bs, now entertain me.<br><br>But when a movie takes place in the world we know and live in, there is\na higher standard. As the story progresses, it must be logical. It\ncan't defy gravity. It can't do things that are not gunna happen in\nreal life. Those are the 'holes' in the story. In GONE GIRL there are\nso many holes and those holes are so ridiculous, you gotta ask\nyourself, \"Do they think I'm stupid?\" I guess the answer is yes. I\nguess they are correct. I guess I'm now a minority. The dumbing of\nAmerica is happening.\n"},
{"review": "\nSpoiler Alert -- In a time when we are supposed to be more aware of\nmental illness, along comes this highly-crafted movie with high\nproduction values and a big budget whose whole story is based on the\nmachinations and manipulations of a psychopath. Really, what would\nHollywood do without psychopaths? They might have to come up with an\noriginal story that actually had something to say about life, the state\nof the world, etc. This movie is purely a fiction to waste a few hours,\nit won't make you ponder or reflect on anything, save the bizarre\nending and the inevitable question: why did Nick stay? It doesn't\nmatter. This story has nothing to do with real life.\n"},
{"review": "\nLuckily I watched this soulless piece of crap as part of awards season\nscreenings, which means I didn't pay for it. I cannot believe this is\nthe shooting script they signed off - the amount of plot holes and\ncontinuity gaffes is staggering. I cannot believe that all these highly\ntalented people agreed to be in this hollow piece that uses all of its\n148 minutes to say absolutely nothing. David Fincher is clearly a\ntalented director, in full technical control of the medium, but after\nwatching this, and having watched most of his previous films, I have to\nconclude that his films very often have nothing relevant to say.\nTechnical prowess counts for nothing if the film has no soul, which is\nwhat I think of Gone Girl. I gave it a 4 for the acting, it is the only\naspect worth noting here. The end is absolutely appalling, character\ndevelopment is shallow, and that graphic extended murder scene was\npretty gratuitous, horrid and unnecessary. But what else could I expect\nfrom a director who chose to remake an already perfect film (Girl With\nThe Dragon Tattoo)?\n"},
{"review": "\nTwisted is all I can say without giving anything away, great movie one\nof my favourites of 2014 ,Big fan of Ben Affleck (Good Will Hunting,The\nTown and Boiler Room)Rosamund Pike only seen her in (Jack Reacher.)And\nis crazy in this one.<br><br>One to watch twice for sure , OK so the ending might make you mad, but\nthe movie will throw you curve ball after curve ball till you get tired\nof presuming who it may be. <br><br>This film is full of thrills chills and suspense, which you wont forget\nafter its of over, it will make your heart beat , it made my wife's for\nsure lol,its not what your think, so get ready for a roller-coaster of\na movie you will like this one.\n"},
{"review": "\nVERY MINOR SPOILERS BELOW<br><br>The first half of the film is pretty nice: it builds tension, mystery\nand manages to grab the viewer's attention. However the second half\nquickly undoes everything that's been shown earlier.<br><br>What's worse, the second part becomes incredibly implausible, very\ntedious, and lacking any interest because it ventures into so unlikely\nsituations and reactions, you cannot help but wonder why people act\nlike they act. For instance the police, who are very captious in the\nfirst half of the film, later believe everything they're told without\ndoubting. Other people similarly and drastically change their mind and\nwe are not given any reasonable explanation.<br><br>To give the film due credit, it's impeccably played, it has, like many\nother Fincher's films, its very likable palette.<br><br>Probably this film is about all sorts of psychos, at least its lead\ncharacters are. However the film doesn't give a chance to root for any\nof them due to their faults.\n"},
{"review": "\nSo here's the thing. The setup for the movie is very engaging. It's a\nfascinating story told with an interesting plot sequence.<br><br>I've seen reviews here, and they seem to run the gamut from amazingly\ngood to amazingly bad. It is the latter, and yet I say two stars\nbecause the story of how their lives got to the point of the\ndisappearance is fascinating, but even while watching the movie,\nquestions entered my mind that I just couldn't answer, even after\nknowing the ending.<br><br>Why did Neil Patrick Harris' character show up so early in the story?\nOnce he showed up, why did he appear to actually work against our\nprotagonist? How could the feds be so mind numbingly stupid? You've got\na police officer in your midst with valid questions: why would she be\nignored? And the worst offense: that ending. Not since \"Solitary Man\"\nhave I seen the credits appear, and I felt the need to complain out\nloud in a movie theater about the ending. Boy, was that a stupid\nending! I've already noted that this review could include spoilers, but\nI feel the need to not spoil too much (if you're a sucker for\npunishment, by all means, spend the money: it's tripe, but it's pretty\ntripe), but oh, how I wish I had someone else to talk to about how\nstupid this movie was in more detail.\n"},
{"review": "\nI really like David Fincher as a Director and some of his previous\nmovies are my favorite (e.g. Seven). Gone girl is a dull movie with\ntotally no surprise or tension. Everything in this movie is so\npredictable. Actually from the very first minutes of the movie you know\nthat the wife is responsible for all what is happening and that she\nfaked it all herself to make the husband look bad - as a revenge for\ntheir unsuccessful marriage. On top of that we have really, really bad,\nfake acting (especially Ben Affleck). The story isn't realistic and\nsometimes behavior of the characters or their actions seem simply\nstupid. The idea for the movie is actually quite interesting and could\nturn into a really great movie. But well... it is what it is\n"},
{"review": "\nThere's really very little to like about this movie unless you are new\nto movies and haven't seen directors work a camera before... Like all\nof David Fincher's movies there is a decided like of real substance. He\ntells stories with visual and auditory gadgetry. Some people are\nprobably wowed when the director calls attention to himself with an\nendless array of moving shots, weird angles, and quick cuts, that end\nup basically turning a movie into a long commercial spot. While it\ndoesn't quite go on forever, it does seem long when sitting in the\ntheater, and that is because honestly, not a whole lot happens in this\nmovie. They get a horse to run (OMG she's a crazy b*** of a wife!!) and\nthen they kick it and beat it to death... <br><br>So... Fincher starts off the movie by constantly swinging the camera\naround, and of course, while keeping everything perfectly framed, he IS\na master at this you know! (And don't you ever forget it!)<br><br>Yeah, yeah David, congrats, you've mastered film school 101. Good for\nyou.<br><br>The whole movie is predictable, absurd, and comes across as some sort\nof listless metaphorical commentary on marriage. <br><br>Oh, that IS literally what it is. The idea that in marrying someone you\nare destroying yourself. And that you have to go through a variety of\nspiritual convulsions before you finally understand what it is you want\nin life. I GET THAT! Why that needs to be told amongst scenes of wine\nbottle self rape, or ejaculation while throat slitting, or any of the\nother absurdities presented to the viewers in Gone Girl is a mystery\nthat only lasts as long as it takes to tally up the $$$.<br><br>Here's a metaphor from the movie: <br><br>WOOD STOVE = HOT VAGINA. She puts her DIARY in her WOOD STOVE and BURNS\nIT. But NOT completely, just singes the edges. AND everything in the\ndiary is a lie. <br><br>GET IT?!?!!?<br><br>Anyway, have fun watching David Fincher's latest self-commercial!\n"},
{"review": "\nAll my stars go to the actresses and actors. Acting was not\nexceptional, but to the standards. The script, however, is all over the\nplace.<br><br>The film starts out as a suspense movie, only to become a metaphorical\nliterature about marriage later on. However, the transition is abrupt\nand awkward. It fails as a suspense movie, and the discussion on\nmarriage is very little developed, if at all.<br><br>It fails as a suspense movie because half way through suddenly the\naudience becomes aware that the wife is alive in a way that undoes all\nthe previous efforts of building up the suspense. After that audience\nwould expect a plot twist that at least connects and completes a good\nstory. That is not delivered either. In fact, the twist is so\nimplausible that the film becomes comic and almost laughable towards\nthe end. <br><br>The lawyer, the police investigation and all that becomes complete\nredundancies under this plot structure. Too much time and attention are\ndevoted to building up the intensity that later is destroyed. The real\nimportant characters are left underdeveloped.<br><br>In the end the movie seems desperate, trying to cover up the failed\nstoryline by shifting the attention onto a topic that many can relate-\nmarriage. However, we do not know what exactly the movie wants to talk\nabout, since most of the time the focus is not devoted on the\nmarriage/relationship. The audience learn about the interactions of the\ncouple mainly through the description, or rather, opinions of the wife\nor the husband on events, and that clearly is not enough.<br><br>Not a good film. I do not recommend it.\n"},
{"review": "\nWow, actually a thriller that's pretty good. Yes, it's fair to say that\n'Gone Girl' is a really engrossing film. As with almost every film,\nit's based on a book. And, as with most films based on a book, I\nhaven't read the book, so I haven't got a clue how well the film\nrelates to the source material. But then I don't care. I just enjoyed\nthe ride.<br><br>'Gone Girl' is one of those films where you don't want to say too much\nabout for fear of giving things away and spoiling it for people who\nhaven't seen it. Ben Affleck plays a (reasonably) decent husband whose\nwell-to-do wife disappears. The media circus that follows then starts\nto reveal that the truth is far more complicated that it first seems\n(not to mention the obligatory police investigation). It's fair to say\nthat what follows is a film that twists and turns, so you only really\nget one chance to watch it and not know what's coming.<br><br>Many people don't really like Affleck when it comes to acting (even\nless now he's due to don the Batsuit!), but I think most people will\nrelate to him as he gets pursued and hounded (unfairly? You'll have to\nwait and see!) by the media. Rosamund Pike plays his (gone!) wife with\na flawless American accent. Again, you'll have to see whether she's\nfound alive or dead. The story bounces around back and forth in time,\nmaking sure you're just confused enough never to put too much together\nbefore the film's ready to reveal what's happening.<br><br>If I had one complaint it's that the film is a little too long. Perhaps\nten to fifteen minutes could have been edited out at around the three\nquarters mark, just to speed it up. But that's a minor gripe.\nBasically, if you like your thrillers twisty and turny (and have a\ncouple of hours to spare on a film that you really have to concentrate\non) give this one a go.\n"},
{"review": "\nRosamund Pike gives one heck of a chilling performance here as Amy\nElliott Dunne, a psychopathic and disturbed woman, whose real life\npersona is directly the opposite of that which is projected in her\nseries of \"Amazing Amy\" popular children's books. Carrie Coon is also\nsuperb as Margo Dunne, the loyal twin sister of Amy's husband Nick (Ben\nAffleck), and Kim Dickens is outstanding as the hard-nosed lead\nDetective Rhonda Boney, assigned to investigate Amy's mysterious\ndisappearance. Also, Tyler Perry is certainly believable as the hot\nshot and high priced attorney Tanner Bolt.<br><br>The movie appeared to me as a scathing indictment of the sensationalism\nof our star obsessed, media, social media, and reality TV society,\nwhere perception and appearance is everything and there's no time for\nboring things like facts and the truth.<br><br>The film is filled with a number of explicit sex scenes, lots of\nshocking and raw language, and one scene that you may have heard about\nwhich is literally brutally bloody and horrific.<br><br>The acclaimed filmmaker David Fincher (The Social Network, The Curious\nCase of Benjamin Button) handles the direction here, and Gillian Flynn\nwrote the no-holds-barred screenplay, based on her novel.<br><br>Overall, after an inauspicious start, the movie took some turns that\nreally captured my interest, and by the time it was over I was totally\n\"locked in\" and fascinated.\n"},
{"review": "\nQuite honestly, this was one of the best movies I've ever had the\nprivilege of seeing. Not sure why there are so many negative reviews..\nIt seems to me that most of the negative reviewers are trying not to\n\"follow the crowd,\" and seem unique in their unrealistic absolute\nhatred of this film. Everyone is entitled to their opinion.... But\njeez, even if this film isn't your cup of tea, it is incredibly\nentertaining. And this is coming from someone who usually is one of\nthose \"don't follow the crowd\" people. I reluctantly took my girlfriend\nto see it a week after release since she had been begging me since we\nsaw the previews. The theater was entirely sold out, even having been\nout a week at that point, and the entire theater was on the edge of\ntheir seats and gave quite the standing \"O\" at the end. I'm just\nsaying, in my humble opinion, even if you don't like the movie, you\ncertainly won't feel as if you've wasted your time.\n"},
{"review": "\nBen Affleck stars in this twisted thriller, based off the best selling\nnovel by Gillian Flynn and boy was it perfectly adapted to the screen.\nNow Ben Affleck I thought was gonna shine over everyone, but Rosamund\nPike's twisted, dark performance improves this film to a near\nmasterpiece mystery. I thought Ben Affleck was just great, but he\ndidn't get the Oscar nom, well there was just way more competition. The\nDavid Fincher direction is very noticeable in the film and he has\nperfectly made another dark mystery, making it more effective with\nevery twist. Rosamund Pike, she very well gives the best performance of\nthe year for a female, also just acting in general. This woman knocks\nit out of the park and she embodies the twisted, insane darkness of Amy\nfrom the book. Tyler Perry was a huge surprise of all and he didn't\nruin the film and actually improved it. Neil Patrick Harris was OK, but\nhe just wasn't the right guy for this role. This film was snubbed by\nthe Oscars in the Best Picture, Best Adapted Screenplay and Best\nOriginal Score categories. Let's just hope they reward the only thing\nnominated; Ms. Amy Elliot Dunne.\n"},
{"review": "\nI hate loose ends in a movie. The lawyer tells Affleck's character that\nhe is putting two ex-Secret Service agents on the case to track down\nhis wife. We never hear what they did or didn't find. It's amazing that\nthey apparently found nothing considering that the lawyer was aware of\nex-boyfriend #2 who had a possible motive. If they had set a stakeout\non him they would have found her.<br><br>And the two low-lifes that stole her money? The Secret Service guys\ncouldn't find them either? And what happened to them?<br><br>The first ex-boyfriend, who had much the same experience with the wife\nas Affleck's character tells his story and is written off. We must\nassume that his life remains forever in the toilet<br><br>And that is part of what makes for a lousy ending. Not one, but at\nleast three people are condemned to lead lives of living hell because\nthe writer could not find away to end the story with any kind of\njustice. Some may say, \"Yeah, but that's reality.\" No it's not, it's a\nmovie, it's entertainment, and I paid good money to see it.<br><br>It's a scary sign of the times when a movie like this gets good\nratings. The acting, filming, directing, and editing were all great,\nit's just the message that was bad.\n"},
{"review": "\nSPOILER!!!<br><br>I read the book, I watched the movie, let me tell you something: This\nis the dumbest s***storm they ever tried to sell me as good.<br><br>Just one thing, and it will say it all: Is this good??? NO! I read the\nbook and I thought it was the most unrealistic s**t I ever saw in my\nlife (especially the Amy and the FBI part where they believed\neverything although the whole story was screaming I'M A F****ING LIAR!)\nthe movie was the same... it's a huge disappointment both the book and\nthe movie<br><br>this whole thing is dumb. the girl is clearly a psychopath, they try to\nsell her as mastermind who thinks about EVERYTHING. They try to show\nthe police as stupid bastards who will believe every coincidence just\nbecause the woman was raped\n"},
{"review": "\nPlease don't waste your time or money on this hyped-up piece of\ngarbage. I don't think I've ever been as disappointed in an ending (not\nthat the beginning and middle were all that great) as I was with this\nstupid, illogical movie. The only spoiler I have is one of the biggest\nplot fails ever... she's escaped her captor by slitting his thread,\nshe's virtually covered with blood, and the hospital simply allows her\nto go home, where she coyly showers it off. Totally amazing that this\nmovie has gotten the positive press and reviews it has received - if\nthis doesn't make you realize how incredible Hollywood hype/marketing\nsystem is at distorting reality, nothing will. I only wish I could give\nit a zero.\n"},
{"review": "\nAvoid this couple at all costs - they are very toxic. Gone Girl is a\nmisleading title since Amy is not a girl. She used to be a childhood\nstorybook celebrity named Amy but there is nothing girlish like about\nher in this movie. In fact she calls herself the C-word. David Fincher\nhas made some of my favorite movies (Fight Club, Zodiac, etc.) but this\nis not one of my favorites. This movie is all the things I dislike in a\nmovie - tedious, depressing, unlikeable characters, dark photography,\nmoody music, strange casting, smug dialogue. This might work with The\nGirl with the Dragon Tattoo but come to think of it - that was no girl\neither.\n"},
{"review": "\nGood suspense thriller and well worth watching. An ex Irish football\nlegend mentioned this wasn't great so I had low expectations. I think\nhe was wrong now after seeing it.<br><br>It is actually a very smart film, it is good in suspense, story line,\ndoes not go down predictable lines, has the stupidity and smartness of\npeople crafted into it, and as a thriller I thought this was good fare\nwith a superbly manipulative character in it.<br><br>It touches very well on relationships, domestic bliss, different\ndemands, infidelity, secrets and does not paint a picture of all is\neasy in love.<br><br>Good characters, good acting, good build up and thoroughly enjoyable\nfilm.\n"},
{"review": "\nDavid Fincher has outdone himself with his cinematic adaptation of\nGillian Flynn's bestselling novel. With a screenplay by the author\nherself, Fincher leads the viewer down a rabbit-hole of a marriage gone\nway south. Ben Affleck and Rosamund Pike portray Nick and Amy Dunne, a\nseemingly happy couple living in rural Missouri. However when Amy\nvanishes without a trace to her whereabouts, police and residents\ndeduce that Nick has done away with Amy, but the truth is far stranger\nthan elaborate fiction. <br><br>Affleck is in top form as Nick, a man who had it all: a beautiful home,\na bar run by his smart mouth sister (Carrie Coon) and the ultimate\ntrophy wife, but when evidence points to him having possibly murdered\nAmy the viewer begins to despise him as his dirty little secrets begin\nto surface. <br><br>As the manipulative and scheming Amy, Rosamund Pike gives a bravado\nperformance that has netted her an Oscar nod for Best Actress. She is\nthe seemingly perfect wife, but as her web unravels we learn there is\nmore to Amy than a wealthy woman with a gorgeous facade. <br><br>Under the direction of Fincher, the atmosphere is dark and brooding,\nfull of foreboding as we step into the mess of Amy and Nick's five year\nmarriage. With a sparse melancholy score, the mood stays dark and\nmysterious as Amy's demeanor. Flynn's screenplay is full of surprising\ntwists and turns, keeping the viewer on the edge of his or her seat.\n"},
{"review": "\nI cannot believe how disappointed I was watching this film. Form all of\nthe reviews I thought I was about to see a modern classic. In instead I\nwatched a movie so lacking in common sense that the last hour was\nalmost unwatchable. The plot is very obvious (even the ending). Without\ngiving away any plot lines, it seems that in this film, common sense\nand the trail of evidence does not exist once the real story is\nrevealed. As the last hour of the movie dragged on and on, I was hoping\nfor some redeeming scene that would make everything right or at least\nmake sense. Unfortunately this did not happen. Maybe one of the worst\n\"good\" movies I've ever scene. If this is what people think is good\nplot twists, then the IQ of movie watchers has gone down into the\nsingle digits.\n"},
{"review": "\nOK. 2 votes, only for the beautiful lead pair and strong performances..\nstrong performances in an absolutely trashy, ridiculous heap of a\nmovie. 149 minutes of sheer nonsense! Given a score of 8.3 on IMDb, I\nreally expected a gem of a movie; I couldn't have been more wrong!\nThroughout the movie I kept expecting a breakthrough moment, a moment,\na frame that changes the course, shocks me, delights me...anything..but\nno. All this movie got out of me was confusion that never went away\neven after the credits started rolling. The only normal character was\nthe woman who plays detective Boney (why that name?).<br><br>In so many parts, the movie is just so lame, I cannot begin to imagine\nwhy the creators must've made those parts. For instance, Desi's lake\nhouse, the fake rape claims and the funniest part being the FBI blindly\nbelieving or blind FBI members conducting the investigation. Either\nway, it was stupid. And what's with the tag line? 'You don't know what\nyou're missing'..The man bloody wanted her gone! And would've been\nhappier had she stayed gone.<br><br>I'm glad I haven't read the book, because that would take me longer\nthan watching the movie and that would've been worse. In conclusion,\nI'd like to congratulate all the people who disliked this movie. You\nrock!\n"},
{"review": "\nWhat a massive pile of crap! This is literally one of the worst movies\nI have ever seen. The story makes no sense at all and I couldn't care\nless about any of the characters. The acting was good but the\ncharacters were just empty,lacking empathy Fincher could have killed\nthem all at the same time, would make no difference. <br><br>And my god those police officers where incompetent, a five year old\nchild would be able to see that there was something wrong straight\naway.<br><br>She was supposedly assaulted and kidnapped, people notice an open door\nbut no one saw her leaving or someone getting inside the house, even\nbetter drag a person outside put the person in the car in plain day\nlight.<br><br>The amount of blood that she extracted from her body in such a short\nperiod would lead her to faint, but no she had the energy to clean the\nplace and drive for hours!!<br><br>She claimed that she was pregnant and she had analysis to prove from\nsomeone else urine.<br><br>Even is she had suffered an abortion a few medical investigations would\nshow the reality.<br><br>She claimed she was raped once, used the exactly same method a second\ntime and no one thought , wait this is a little bizarre!!<br><br>Left her place looking exactly the same and no one saw her, even with\nher face all over the news!!<br><br>I have no words just horrible\n"},
{"review": "\nThe most satisfying thing about this movie is writing this review.\nWhilst I'm a firm believer in the adage, \"to each his own,\" and I\ncertainly mean no disrespect to others' opinions, I do worry over\nconsumers' standards that movie-goers are able to say anything\nredeeming about this film. Many other reviewers have nailed the\nstupidity of the plot and the absurdity of most aspects of the\nstoryline so I'll leave that alone. Suffice to say that at the end, I\nfelt as violated as Amy Dunne claimed she was. I can't believe that\nsuch a large group of professionals watched the rushes and felt\nsatisfied with what they'd created. Oh and about the foul language -\nhow did Bogart, Wayne, Heston, Lancaster, Kirk Douglas, Davis and\nCrawford ever make an impact without the filthy language? Oh yeah -\nthey call it acting. I rate myself as reasonably intelligent and I'm no\nprude but I like a bit of subtlety which I believe any true art form\nallows for. This was rank nonsense and I gave myself an uppercut for\nwatching it but am slightly redeemed now.\n"},
{"review": "\nI had a pleasant surprise over the last weekend; free HBO Cinamax time!\nSo I caught up on some films I had heard about but haven't seen. This\nwas one of them. I wish I had read other member reviews....I wouldn't\nhave wasted my time. It wasn't the acting. It was the completely\nconvoluted/implausible/mistake-ridden/crappy plot that stunk. REALLY\nbad. It annoys me that supposed \"art\" and \"film\" professionals are so\nwound up in their own little worlds they can't see the terrible stuff\nthey produce. Just read most of the other reviews. Don't they use\n\"focus\" groups or something to get feedback before the release?? If so,\nthe groups must be drinking the same water as the production staff (can\nyou say So Cal??) Glad it was free and the only waste was the 2:27 of\nmy time. Don't bother seeing this.\n"},
{"review": "\nIt has been two days since I saw Gone Girl, and I am still seething\ninside. Not because of the poor casting, the worse acting,the stilted\nand pretentious dialogue, the ludicrous plot contrivances throughout,\nthe laughably idiotic ending, the illogic, the unnecessarily long\nrunning time, the boredom, the inanity, the vile atmosphere, the lousy\nscore, or any of the other details that made this the most\nexcruciatingly painful cinematic disaster that I have ever experienced.\nNope, and I don't plan on expounding on any of this stuff here, either.\nThat's already been done more than adequately, and would just be piling\non to the exceedingly obvious. <br><br>So why did I register here to write my very first review EVER on such a\nforum? I guess it's mainly because such a huge percentage of the\nviewing audience enjoyed this rancid bucket full of wriggling fish\nguts, and I seriously need to vent. Look, we all have our guilty\npleasures when it comes to film, and I'll be the first to admit that I\nprobably like my fair share of stinkers for one reason or another. But\nGone Girl goes beyond the pale of what should be minimally acceptable\nin terms of base artistic competence. What the hell is wrong with you,\nmovie-goers? Were you not paying attention at all? This movie is\nridiculously bad, bad, BAD, and at every turn! How can the public, not\nto mention the lion's share of professional critics, for godsake, lap\nup this excrement? Was there a big sale on lobotomies somewhere?<br><br>Anyway, I guess that's my rant. I DID want to extend my sincere thanks\nto all the reviewers here who seem to more or less agree with my take.\nTo tell the truth, I was so riled up by the end of this picture that I\nliterally felt physically ill for some time afterwards, and it was such\na refreshing balm to come here and discover it wasn't just me. To those\nwho agree with me, I'd just like to say thanks, and that I feel your\npain. :)\n"},
{"review": "\nI have seldom watched a movie where the script writer took as many\nrandom shortcuts as those taken in \"Gone Girl.\" I've seen this before\nwhen a writer -- either because of laziness, lack of talent, or time\npressure -- simply has the character do something which advances the\nstory, but without any foundation or rationale for that action. In\n\"Gone Girl,\" each scene failed to supply sufficient information or\nmotivation for what each character did next. At the beginning of the\nmovie, this was merely annoying, and I thought perhaps it was being\ndone deliberately in order to provide a simple sketch of the\ncharacters' backgrounds and then quickly get into the meat of the\nmovie.<br><br>Unfortunately, those \"sketches\" turned out to be essential to the rest\nof the movie, and because these scenes were not completely fleshed out,\nmuch of what followed rang hollow.<br><br>It is a complete mystery to me how Gillian Flynn, the screenplay\nauthor, could have been nominated for any awards for this mess, and yet\nshe was. This makes me very suspicious of the awards process.<br><br>The script is so bad that, as the movie progressed, I kept thinking\nperhaps they had filmed the \"treatment\" (the script outline used to\nsell the movie idea) rather than an actual, finished script.<br><br>By the time the movie stumbled and lurched to the final, totally\nunsatisfactory conclusion, I found myself almost angry at all the holes\nin logic and motivation, and the completely inexplicable things each of\nthe two main characters said and did.<br><br>I don't mind endings that are unexpected or unusual, but I do mind\nendings that feel as though the writer copped out because she lacked\nthe creativity to come up with a much more interesting, clever, and\nlogically consistent ending.<br><br>This ending was none of those things.<br><br>The only reason I gave the film two stars instead of one is that the\nbasic production values are quite good\n"},
{"review": "\n'Gone Girl' begins with a married man, Nick, returning to his suburban\nhome to find an open door, broken furniture, blood spatters and his\nwife Amy missing. Within a couple of days, Nick's account of an idyllic\nmarriage starts falling apart, and the local police begin to suspect\nhe's a wife-killer. Ominous clues are discovered, while a tabloid\ntalk-show host ramps up public hysteria with gossipy revelations\nsupplied by one of Amy's neighborhood pals. Director Fincher encourages\nhis audience to join this vilification of Nick as flashbacks portray\nthe couple's life together from entries in Amy's diary.<br><br>Although the film possesses a few innovative ideas, it ends up a banal\nmelodrama drowned by a deluge of plot-holes. None of its narrative\ndevices are the slightest bit subtle, and only the terminally naive\nwill fall for the script's clumsy red herrings. The credibility issues\nare numerous and gigantic, and the characters remain resolutely shallow\nas the tale descends into farce. The big revelation arrives far too\nearly, whereupon any residual tension immediately evaporates. The last\nthird of 'Gone Girl' becomes increasingly far-fetched - and by the time\nit reaches its conclusion, it has become irretrievably lost in the\nrealm of the ridiculous.\n"},
{"review": "\nInsipid. Tepid. Vacuous. The first 30 minutes are the most pretentious\nscript ever written in the history of film making. Please, somebody,\nburn every copy of this film ever distributed.... To try to sit through\nthis film to its uninspired and tired (read: \"lame\") ending challenges\nthe endurance. Okay, let's start with the actors: Ben Affleck has not\nmade a good movie-- i.e. a movie a viewer might be able to sit\nthrough-- since Jay &amp; Silent Bob Strike Back. Who forced/corralled\nRosamund Pike into making this?!? Who willingly makes movies with\nAffleck besides Jennifer Lopez?!?! Really? I was sitting on the couch\nwith my wife for the first 30 minutes of this movie and was forced to\nhit the pause button an physically leave the room for minutes at a time\nduring the first thirty minutes. God help America, Hollywood, acting,\nand movie-making.\n"},
{"review": "\nIn one scene the word \"fucking\" was used over and over and I wonder\nwhere American movies are going to go next, some of the language was\ndisgusting. I had to engage subtitles to understand much of the mumbled\ndialogue, Rosemund Pike has a lovely natural speaking voice what a\nshame to see her speaking like she does in this movie How on earth does\nthis get a good rating? As for the story it is so improbable in parts\nas to be laughable, we used to have some great movies from America but\nthings are gradually getting worse. It seems only money matters in\nHollywood now, thankfully the odd one still pleases but not much to\nlook forward too, I prefer to watch a top British series on TV\n"},
{"review": "\nReasonable plot development that builds in intensity throughout, with\nstrange and interesting elements added and developed as the movie\nprogresses.....culminating in a crap ending. I don't care about book\ncomparisons because a film should stand on it's own merit. Neil Patrick\nHarris is a bright spot in this whole effort and it surprised me that\nhe was so good. As an actor, unless he's portraying a cigar store\nIndian, Ben Affleck should stick to directing....which he's pretty good\nat. Rosamund Pike was good but it is not an Oscar winning performance.\nOthers in \"cameo\" supporting roles were just OK. It gets pretty intense\nand somewhat gory as the plot unfolds and I found the film to be overly\nlong, unnecessarily.\n"},
{"review": "\nThis does contain a spoiler, one that if I would have known I wouldn't\nhave wasted my time or money. I don't like to even watch trailers on\nmovies because I want no preconception of how a movie is going to be.\nThis movie has single handily changed 30+ years of thinking.<br><br>I thought the story was very well written and acted, despite almost\nalways knowing what the twists were going to be until... The pace was\nso slow and could have been compressed into a normal 75-85 minute\nmovie. My guess is that the reason there was no ending was because they\nran out of time for dragging it on like they did.<br><br>When the credits hit the entire audience I was with pretty much let out\na stream of obscenities and we all felt like the\nproducers/directors/studio all just gave us two middle fingers. I could\nhave dealt with the slow pace if they would have just wrapped up the\nmovie.\n"},
{"review": "\nLike many others, I was shocked by how bad this movie was, and the many\nplot holes. It's hard to know where to start--Amy being sent home from\nthe hospital still covered in blood was one low point.<br><br>I also agree with the earlier reviewer who says the movie is\nanti-female empowerment. It makes the commentators on TV talking about\ndomestic violence seem like the enemy-because you \"know\" at that point\nthe husband is wrongly accused, so you see the women talking about\nhusbands murdering wives, on the pseudo-Nancy Grace talk show, as false\naccusers and man haters. Very disturbing.<br><br>However, I wrote this review to point out one plot hole, one very big\nplot hole, nobody else seemed to notice. Again, spoiler here: Amy is a\npsychopath, supposedly. The whole story turns on the idea that she is\nsociopathic and abusive and has been for years (witness her framing of\nthe ex-boyfriend 8 years earlier). Why, then, does she give/lend her\nparents almost her entire trust fund, simply because they ask? It is\nalready established that they care more for fictional Amazing Amy than\nfor her. Her reason: At the end of the day, the trust fund is \"really\ntheir money.\" Huh? That's how a psychopath/ sociopath thinks, about\nparents she doesn't like? Or was it part of her \"evil plan\" all along\nto end up broke in Missouri, so she could start to hate her husband and\ntry to frame him? (sarcasm) It's just dumb.<br><br>How did this movie (and book) get such great buzz? I left the movie\nwondering sadly, is this what people like now? BTW, I watched this with\na largely college age audience who laughed several times, especially\nwhen Amy flips her (non-bloodsoaked) blond hair at the end of the\nbloody murder scene. At then laughed again when the credits were\nrolling.\n"},
{"review": "\nThis movie reminded me why I seldom attend movies anymore!<br><br>I was excited with anticipation to see this film and I must say I was\nleft feeling extremely disappointed. The acting was sub-par, the\ncharacters weren't believable and the story was far to drawn out and\nbecame almost laughably ridiculous as it evolved. I won't spoil the\nplot but I will say that if you watch this movie and haven't figured it\nout shortly after \"Amy\" goes missing than you should stick to watching\nSponge Bob. Isn't Hollywood capable of producing a captivating film\nanymore? The story was also unbelievable. No way in real life would the\nsuspect not be arrested much sooner giving his highly suspicious\nactivity and behavior. <br><br>Gone Girl = 2 wasted hours gone!\n"},
{"review": "\nWhat a mess! If the concept of the \"faked murder\" appeals to you, skip\nthis train-wreck and go watch Ashley Judd, Bruce Greenwood and Tommy\nLee Jones do it somewhat well. It's not happening here. The hidden\nbaseline is a parody of what TV \"reality news\" does to shape public\nopinion, most of which is consumed as the truth by the ignorant masses.\nThat I can agree with. Heck, it describes all of politics today. But\nthe story itself is such junk - especially how the cops are complete\nidiots - and this woman's crazy schemes are consumed as truth. My\nfavorite is when the investigators who question her toward the end\n\"hush up\" the cop pointing out the huge holes in her nonsense story,\nbecause of all she's \"been through\". C'mon guys, you can't write better\nthan that?? If you want something suspenseful that will exercise your\nbrain this will completely disappoint you. If it wasn't for some decent\nacting of this garbage script I'd award it zero stars. IMHO.\n"},
{"review": "\nI am surprised that this movie gets more than 5 stars on average and am\nsimply amazed that it gets over 8 stars total. It is a stupid movie\nwith merely competent acting, silly direction, and abominable writing\nthat includes a routine plot and truly obnoxious dialog.<br><br>I won't bother going into all the details about why the plot is so bad.\nOther reviewers already have done that very well. I will just summarize\nthe main points. Worthless, unappealing guy meets overbearing,\nunappealing bitch at party. They get married. Because of who they are,\nthe marriage fails. He cheats, she schemes. Somewhere around the middle\nalmost all doubt about what is going on has already become obvious, but\njust in case you didn't figure it out on your own, the movie spills the\nbeans. It's all old stuff, seen many times in low-budget TV shows over\nthe decades. The rest of the movie is an exercise in coming up with a\nslightly different ending. The chosen ending is simply idiotic. To get\nthere, the plot cannot avoid a large number of holes big enough to\ndrive a truck through. The ending is the most preposterous part of the\nwhole story. After one faked homicide is followed by a real homicide\ncommitted by the person who faked the first one, the cops just drop the\nwhole thing, and Mr. &amp; Mrs. Wrong are reunited to live unhappily ever\nafter.<br><br>And the dialog! No wonder Mr. and Mrs. Wrong don't get along. They are\ntoo busy engaging in preposterously clever and cool dialog with each\nother to ever have a real conversation.<br><br>The characters are all cardboard cutouts with no life and no depth.\nNone of them is anyone I would care to know or would care about.<br><br>Terrible movie. The only reason to see it is to marvel at the bad taste\nof so many reviewers.\n"},
{"review": "\nwell well well thanks a lot for spoiling 150 minutes of my life, i\nstill don't understand why this film is so highly rated. i guess i\nshould not believe in ratings of IMDb anymore , please don't watch this\ntrash its such a waste of time, a girl , to avenge the betrayal gets\nhold of her husband by planting a successful crime scene (that can\nhappen only in movies) and that girl ends up patching up with him\nagain, if this all had to happen then what was the fun of making that\ndirt of 150 mints, so awful ending. those who rated it 10 must be\nbanned for further rating, the most disgusting movie i have seen in my\nlife, and yes what happened to police in the end , they knew she was\ncriminal but they couldn't do anything, wow u think we are buffoons ,\nget a life Mr director and please don't breed, regards!\n"},
{"review": "\nSome of the worst dialog I've ever seen in a movie. Bad story, flat\nacting. The critics who gave this good reviews should find other work.<br><br>I read the book, so I know what the story was supposed to be. This\ndisjointed telling does no credit to the book.<br><br>I can't imagine how the director managed to get such terrible\nperformances out of experienced actors. It's a real credit to bad\ndirecting. The only character who really clicks is the sister. Affleck\nlooks like they already paid him, and he's ready to go home.<br><br>This movie had absolute no emotional impact. The characters were too\nflat and the dialog too unrealistic to have any effect. The storyline\nwas poorly conceived.<br><br>The mostly positive reviews for this movie demonstrate, once again, how\nmost people are not very observant or discerning about what they watch.\n"},
{"review": "\nI'll keep this sweet and simple. Just read any of the other 1/10\ncomments for the synopsis. <br><br>You would be better off spending two and a half hours staring at a wall\nrather than watching this Swiss cheese of a movie. I didn't read the\nbook but if it was as riddled with plot holes as this crap was, I would\nrecommend it only to my mortal enemy.<br><br>What truly made me write this review is the horrible human beings that\nexcept money to write 10/10 comments for garbage like this. And just\nfor your information scabs , if I was the marketing execs paying for\nthose comments, I would expect some stuff a little bit more human and\nas little less Siskel and Ebert.\n"},
{"review": "\nIf they shortened it down to maybe 1 hour and 45min.It would be worth\ntwo stars.But they didn't! As most Hollywood movies with overpaid\npeople who can't act,they stretch it way beyond way beyond what they\ngot storyline <br><br>I haven't read the book,and after watching the movie I don't want to\neither.<br><br>Rosamund pike does a fairly good job of being a manipulative cunning\nbitch.Bt could just as easy be replaced. And affleck does whatever it's\nhe does.Look stupid I call it,but others referred to it as acting<br><br>There's so many plot holes that I wouldn't know where to begin. Start\nwith all the stuff he supposedly bought,most stores have security cam\nthese days, should be fairly easy too see if he was the one purchasing\nthe items or not\n"},
{"review": "\nI watched this film today and when I came onto IMDb to write a review,\nI was assaulted by many reviews of one star. I changed the order to\nprolific authors and found that they really liked it. I'm a prolific\nauthor and so did I.<br><br>A woman (Rosamund Pike) frames her husband (Ben Affleck) for her own\nmurder, even though she's simply disappeared.<br><br>The first part of the film is the investigation and finding out what\nreally happened from the wife, Amy, herself; the rest of the film\ncovers what happens as a result.<br><br>Most people hated the ending, which felt ambiguous to some. I thought\nit was okay.<br><br>The cast is excellent, with Ben Affleck doing a good job in the lead.\nTalk about turning your career around. Rosamund Pike is excellent as\nthe treacherous Amy, and Carrie Coon, as Affleck's twin, does a\nwonderful job. On hand is also Tyler Perry as an attorney, Neil Patrick\nHarris as Amy's ex-beau Desi, Kim Dickens and Patrick Fugit as the\npolice investigating the case, and Sela Ward as Sharon Scheiber.<br><br>This is another winner for David Fincher, who proves again that his\ncasting is as skillful as his directing.<br><br>I'm not familiar with the book. I found the story intriguing. As far as\nplot holes, more often than not, there are plot holes. For a movie like\nthis, I usually just let everything go and get into it so I can enjoy\nthe film. I watch movies for entertainment, not to rip them apart. When\nthey are badly done, I happily trash them. But with a well-done film,\nI'm pretty forgiving.\n"},
{"review": "\nThis is a terrible film. There are many, many things wrong with it -\npreposterous plot, miscast lead actress, excessive running time,\nexcruciating soundtrack, etc. - but overall the key flaw, present from\nthe first scene, is that it never manages to cross the line between\nfeeling like we're watching some actors (not to mention a director)\nworking, and being immersed in a story. It just doesn't work.<br><br>We're clearly supposed to view this as a big zeitgeist capturing\nmovie,what with all the 'trial by media' shenanigans; but this is\nneither new nor innovatively handled: in the end it amounts to nothing\nmore than sensationalist TV hosts and vans on the lawn. <br><br>As a thriller, it doesn't work either. We don't care about the\ncharacters, and the plot is so ridiculous it overwhelms everything\nelse. OK, we don't expect total plausibility - look at Hitchcock - but\nthere has to be a limit. <br><br>Finally, the ending is, if anything, even worse than the book, which,\nby the way, has been inexplicably well reviewed: it is trash\nliterature.<br><br>The two star, rather than one star rating, is for Kim Dickens, the only\ngood thing in the film.<br><br>Avoid this junk at all costs.\n"},
{"review": "\nAn 8.4? Are you high? I always thought that there would be a good\nreason for a movie to last 2 and a half hours. I don't see why so many\ngirls my age (16) were so into it. After watching Gone Girl, I felt as\nif I had wasted so much time in which I could've accomplished something\nand made myself more useful. <br><br>This movie was a waste of time. It was boring, long and totally\nridiculous. <br><br>I don't see what is \"feminine\" about it since there are some totally\ndisgusting scenes that I think some men couldn't bare to watch, which\nof course had nothing to do with the plot. <br><br>Fake rape. Was there really a need for it? Was there a need in using\nseduction to kill your ex? Couldn't you just kill him in his sleep? But\nNO! I had to be done in a sexual way to make to movie stand out more.\nThe sex scenes were totally outrageous, disturbing and completely\nunrealistic. And next time you make a movie, try and reduce the amount\nof oral sex. No one wants to see someone implying that are having oral\nsex.<br><br>I don't know what else to say but this movie is just really bad. And it\nannoyed me because I was spending so much time desperate to see it\nbecause of the high rating, and when I did I felt like I wasted so much\ntime obsessing over nothing. They could've chosen better actors and\nactresses too. I hope I never come across a movie that was this bad\nevery again.<br><br>Sorry, but this movie was an epic fail.\n"},
{"review": "\nThis movie is the most upsetting piece of **** i have ever seen.<br><br>First of all I want tell you that this movie made me want register with\nIMDb. Second of all this movie was a waste of time! More than two hours\nof upsetting nonsense.<br><br>Unbelievable how it got its high ranking (8.3!?!). Just think of it,\nthat is the same rating as Scarface with Al Pacino!<br><br>I am happy creating an IMDb account just to down-rate this idiotic\nmovie, because it just does not deserve any rating that is above 5.0!!!<br><br>Everybody who thinks that this lack of storytelling and deserves a\nrating higher than 5.0 is completely out of her/his mind. What is the\nmost unbelievable thing going on with the story? Well, from my point of\nview there are two major topics: 1. In the end Amy gets home from the\nhospital still all bloody after everything that happened?! 2. The whole\nmovie Detective Rhonda Boney is very sceptical and focuses on evidence\ninstead of stories and answers from her main suspect. When Amy is being\nquestioned in the hospital, she just asks one or two questions and that\nis it? Well my friends, for me that is just so far-fetched that this\nblew the whole movie for me... Have fun watching this piece of ****.\n"},
{"review": "\nThe story is just full of contradictions, obscenely loses touch of\nreality. <br><br>What happened to all the misleading evidence and the notes that Amy\nleft? <br><br>Why the diary ended up in the fireplace that had nothing to do with\nDesi?<br><br>The cast and the plays were fantastic, alas this work will not leave a\ngood mark.<br><br>The last 15 minutes was a mix of joke and question marks and killed\nwhatever could be accomplished by the climax.\n"},
{"review": "\nThis is by far the worst movie I have ever seen in my entire life - and\nI'm 62 years old and have seen A LOT of movies.<br><br>I failed to see any plot and failed to see the point of even making\nthis into a movie.<br><br>I have read that this movie actually is based on a book. I am not sure\nif they missed something from the book or if it was the director's take\non the book - or what.<br><br>I would hope that the book made more sense and that the person using\nthe book just didn't comprehend it well - or if the book was just as\nbad.<br><br>This has got to be the only movie that I have searched online for \"why\"\n- \"why even bother to put this into a movie\"?<br><br>I admit it was unlike any other movie I have seen in my life - maybe\nthat was the point - to be different. Well they got that right - a\nlittle too different if you ask me.<br><br>Don't waste your time as you will be sadly disappointed you just wasted\nover an hour of your life because the movie is gripping.\n"},
{"review": "\nIn Missouri, the unemployed writer Nick Dunne (Ben Affleck) goes to the\nbar The Bar that he owns with his twin sister Margo Dunne (Carrie Coon)\non the day of his fifth wedding anniversary and they talk and play a\nboard game. Then he goes home and finds that his wife Amy Dunne\n(Rosamund Pike) is missing. He calls the police and Detective Rhonda\nBoney (Kim Dickens) is in charge of the investigation with Officer\nJames Gilpin (Patrick Fugit). As long as the investigation proceeds,\nthe evidences show Nick as the prime suspect of murder while the media\nfiercely attacks him. But is Amy really dead?<br><br>Spoilers ahead: \"Gone Girl\" is a movie with great hype, but actually it\nis a too long movie with plot holes and a deceptive conclusion. In\naddition, the lead characters are non-charismatic. The good thing is\nthe criticism to the hypocrite behavior of the media. Amy leaves her\nhouse but no neighbor sees her. The diary in the stove is partially\nburned and the detective does not suspect that something is wrong. Amy\ntravels but she does not change her face, lodges in a low-budget hotel\nand nobody recognizes her. Internet shopping is delivered by courier;\nwouldn't the postman keep a record of who received the expensive\ndelivery? The house by the lake of Neil Harris has surveillance cameras\neverywhere. The police and the FBI do not check the footages along the\nalmost thirty days she claimed to be kidnapped. The police officers do\nnot investigate how she could have a stiletto to kill Neil. She leaves\nthe hospital covered in blood. Last but not the least, who would live\nwith a psychopath and assume someone else's baby? My vote is six.<br><br>Title (Brazil): \"Garota Exemplar\" (\"Exemplar Girl\")\n"},
{"review": "\nWatched Gone Girl last night - absolute pile of garbage! Odd film that\ndoesn't know what it is. Tries to be a parody of the modern world where\nthe media subverts any notion of the truth but the characters are\nnowhere near defined enough and so we never buy in to it (well I\ncertainly didn't). No real development behind the break up of the\ncouples' relationship - one minute they're having sex in a bookshop,\nnext thing he's lost his job and they hate each other. Silly things\nlike the way the Pike character drops her hidden money during the crazy\ngolf scene, the way she eats a lot and dyes her hair but still looks\nlike the absent wife and the jelly baby scene with the lawyer. Very\ncontrived - worst case of plot manipulation since Crash. As for Pike's\ncertain Oscar nomination, it's a really bad version of Glenn Close's\nroutine from Fatal Attraction; blank expression and the odd violent\noutburst does not an Oscar performance make. Best bit in the film was\nthe mistress' breasts which were a major highlight considering the\ndullness of the movie - to quote the Pike character: \"The girl with the\ngiant cum-on-me tits.\" Very astute; shame Fincher wasn't as\nperspicacious.\n"},
{"review": "\nI have never reviewed a movie before but after watching Gone Girl, I\ncouldn't prevent myself. I am a big David Fincher fan but this movie\nliterally made me angry in the end. First to start with the positives.\nIn the reviews, the appreciations were focused more on Rosamund Pike\nthan Ben Affleck. I think Affleck was simply exceptional and perfect\nfor the role. As for beloved Rosamund Pike, I will never watch her the\nsame way I used to. The supporting cast played their parts well,\nespecially Margo(Affleck's twin sister). Moving on to the negatives,\nwhich were many in my opinion. Not spoiling anything for the viewers,\nhow can the authorities be so inept at the end? There were so many\nflaws in the story told by the one of the lead characters. It seems\neveryone was so frenzied by the dumb wit media that they forgot to\ncheck the facts. The kidnap story was complete rubbish; tying marks\nwere not accurate with the story, nobody checked the alibi of the\nperpetrator, nobody focused on the history of the so called victim(It\nhappened before, didn't it??) and nobody saw anyone leave or move.\nFinally, nothing disappointed me more than the the end. How can someone\nlive with that? What was the point of all this? I love David Fincher\nmovies and can watch his dark classics repeatedly. But will I watch\n\"Gone Girl\" again ? Never !!\n"},
{"review": "\nWith all due respect, I have come to the conclusion that I really\ndisliked this movie. When I got home from the theater, people asked me\nand I said, \"It was pretty good\", but the more I thought about the more\nridiculous things kept coming to mind. The stereotypes of the cunning\nwomen was unwelcome. Amy's sudden turn to violence was absurd. Prior to\nslashing Doogie Howser all she'd been guilty of was fraud. How do you\ngo from fraud to cold-blooded (and very bloody) first-degree murder\nwithout batting an eye? Also, all the cops were skinny dudes with\nordinary haircuts. Been up close to a police force any time in the past\n30 years? They're all skinhead bullies nowadays, not clean-cut gee-whiz\ndo-gooders like in this movie. And then Nick wordlessly ends up staying\nwith Amy? Just awful. The only mystery here is why people thought this\nwas any good.\n"},
{"review": "\nNever again will I trust the Metascore. Big fan of David Fincher, but\nlet me tell you this movie was spectacularly bad. The score was ham\nhanded and clashed with the film itself and I was embarrassed for the\nactors at some points that they had to say the ridiculous lines in the\nterrible script. I felt every single minute of this 149 minute movie.\nAt one point my husband turned to me and whispered \"this is really bad\"\nand we started laughing. Then we started rewriting the story and\nrecasting. For example, Ben Affleck could have played his own twin\nsister and it wouldn't have made the movie any more ridiculous. You\nmight love it. I really, really did not.\n"},
{"review": "\nAfter reading the book I wasn't expecting much (the book is awful too)\nbut I absolutely did not enjoy watching this film. The lead actress was\nterrible and her voice overs were simply annoying. She and Ben affleck\nhad no chemistry what so ever. I didn't enjoy the book but this\nfilm....it actually made the book worse (originally I rated the book a\n2, after this, it's a 1). Save your $10 and Don't SEE IT! First words\nout of my friends mouth when it ended? \"Thanks for that, that's 2 1/2\nhrs of my life I can never get back\" to which I wholeheartedly agreed.<br><br>Apparently to submit a review there is a minimum of 10 lines. As I've\nsaid what I needed to say I am now just taking up space.\n"},
{"review": "\nThe book was terrible and the movie is just as bad.<br><br>How such a blatant and amateurish rip from Scott Turow's Presumed\nInnocent and even a dash of Agatha Christie's Endless Night ever found\nan audience, is beyond me. <br><br>Look even if the story is drivel and the plot is a giant gaping hole of\n\"no F****ng way!\" the real problem with this heap is the actors. I\nnever believed for one second Pike and Affleck. Not only do they lack\nany chemistry dramatically, I'm wondering if Fincher ever bothered to\ndo second takes. Every freaking scene in this \"thriller\" plays so flat.\nThe movie looks flat, it is acted flat and even when you're laughing at\nhow plot holes make the Death Star look like Science Fact, you're\nfalling asleep. <br><br>So yes, it's trash. It's a massive rip off of a genuinely good\nmystery/legal boiler novel. But yeah, I just didn't believe any of it.\nFincher was on auto pilot. Pike was annoying and Affleck looks like a\nCGI puppet for two and a half hours. <br><br>Even if you're fascinated by what drives infidelity, this movie has\nnothing real to say on the subject other than women are plotting,\nbloodletting liars and men are philandering victims. There's far better\ntrash out there to eat two hours and some popcorn than this steamer.\nGone girl should stay gone.<br><br>Fincher gave up years ago. After four consecutive duds, I'm not\ntouching anything with his name on it again.\n"},
{"review": "\nThe movie seemed like a mystery thriller where the husband plays\ndetective to find his wife's killer/kidnapper and there will be the\nplot twist. That's how the trailer looked like. Too much ineffective\ncharacter build up that took 90 mins of the film. The plot was like an\neasy murder case from a Dateline episode and I am sure everything wrong\nwith the story has been enumerated on previous reviews. And I cannot\nbelieve how dumb the policemen were portrayed. The plot really sucks.\nWhen the credits started rolling, this movie left me with anger. If the\nstory in the book is the same as the movies, then, I am really glad\nthat I didn't read it.\n"},
{"review": "\ni've said it all in the title. how does an absolute piece of junk like\nthis get an 8.2 rating when something utterly brilliant like Inherent\nVice gets a rating of only 6.9? holes in the plot are like chasm's. the\nacting is forced and totally unbelievable. i thought that Tyler Perry\nseemed to be the only one who seemed to realise how bad this movie was\nwhilst doing his best to fullfil his contract. bet he regretted signing\non for this one. it seems that the high rating is largely due to\npositive critical review. just goes to confirm what i have pretty much\nalways thought about movie critics. they're a large factor in the\ndecline of modern cinema. decided to watch this purely because of the\nIMDb rating. i thought at 8.2, \"well it can't be that bad.\" you guys\nneed to remedy that and quick smart, before other discerning\nmovie-lovers are sucked into losing 2 hours of their life like i was.\ncame here expecting to see a raft of positivity from movie fans, but i\nmust say i was pleasantly surprised most people seemed to have a\nsimilar opinion of it as me. that was indeed the only thing that was\nrefreshing about this movie experience. otherwise...just painful. wtf?\n"},
{"review": "\nA drama in the beginning became a thriller by reasoning. The best muse\nI felt was the setting which provided the inspiration for the switch.\nThe best actor in the movie was Ben Affleck with best face - confused\nstate of mind. The story-line really I felt catered to the\nwell-informed because it changed. It's meant for those that anticipate\nwatching the whole movie not just parts. It requires attention and\nattention to detail; thought provoking. It used a favorite quality of\nmine called \"thinking outside the box\" with a retrospect to the\ninnermost thoughts of a killer. The metaphor and plot formed in the\nfolds of that relationship making this a unique book to movie thriller\n"},
{"review": "\nGone Girl is a 2014 American psychological thriller film directed by\nDavid Fincher and adapted by Gillian Flynn from her 2012 novel of the\nsame name. It stars Ben Affleck and Rosamund Pike. Set in the\nMidwestern United States, the film's story begins as a mystery about a\nman, Nick Dunne (Affleck), whose wife, Amy (Pike), has gone missing,\nand depicts the ensuing events that arise.<br><br>In Carthage, Mo., former New York-based writer Nick Dunne (Ben Affleck)\nand his glamorous wife Amy (Rosamund Pike) present a portrait of a\nblissful marriage to the public. However, when Amy goes missing on the\ncouple's fifth wedding anniversary, Nick becomes the prime suspect in\nher disappearance. The resulting police pressure and media frenzy cause\nthe Dunnes' image of a happy union to crumble, leading to tantalizing\nquestions about who Nick and Amy truly are.\n"},
{"review": "\n'Spoiler alert'- the ending of this movie sucked harder than a Dyson!\nMany of us watch movies for entertainment and some of us in the\naudience also crave escape from reality. If you want to suspend your\nnormal/intelligent life, this movie (notice I did not say film) might\nbe for you. Early on, I caught myself thinking of Ben Afleck as the new\nRichard Gere, a guy who made good in one film and has now gone on to\nstar in B-grade flicks thanks to his looks, but that is a slam to Ben,\nwho likely just needs a better agent or help managing his cash. The\nacting from Ben and Carrie Coon (plays his sis in movie) is good and\nthe staging of a tired (TV drama) plot is decent enough. Sadly, as the\naction escalates towards a climax, it becomes far too obvious that the\nintended audience is the somewhat brain addled bunch who enjoys daytime\nTV 'talk' shows and hyped-up news shows which hype up crime stories. If\nyou can suspend reality and forget that cops (especially detectives\nfollowing up on a possible murder/kidnapping and rape) check for\nfingerprints, dig through computer/cellular records, and follow up on\neven small leads, you might yet give this 'roll of celluloid' a five or\nmore of ten. But that ain't me: I give it a 3!\n"},
{"review": "\nHate to burst the bubble (IMDb top 250, average mark over 8), but I\njust didn't get this David Fincher thriller at all. With its\ncombination of unsavoury lead characters, jaundiced view of television\nreporting and fantastical plotting, I found it unengaging, unbelievable\nand I'm sure many more \"un's\" I could think of if I put my mind to it.<br><br>I'm guessing the main theme here could be the unravelling of a modern\nmarriage in the face of the recession but no, on consideration it just\nseems like another study by director Fincher of a psychopath. Just what\nthe movies need today. <br><br>Nothing is credible here, the relationship between brother and sister,\nthe husband's casual attitude towards his wife's unexplained\ndisappearance, his revealed-out-of-nowhere fling with one of his class\nstudents, the wife's misadventure with trailer-park trash, her jilted\nhigh-school lover-become-Howard Hughes who gets a poor reward for his\nadmittedly somewhat possessive assistance to her at time of need (seems\nto me she should have gone after the two who rolled her at the caravan\npark rather than her ill-fated worshipper). If you're wondering how\nthese random sounding events link together, then, even after watching\nthe movie, so am I. It takes forever to reach a conclusive act of\nbloody violence which even then isn't worth the wait.<br><br>As for the acting, it was no big deal. Ben Affleck looks and acts like\na slobbish Hugh Grant and to be honest does so with about as much depth\nas the Englishman. Rosamund Pike wants us to think she's a latter-day\nHitchcock mystery-blonde but she can keep wanting. Almost the only\nthings I liked about the film were Trent Raznor's atmospheric\nsoundscapes in the background and the fluid camera-work throughout.<br><br>Otherwise, for me this was a major disappointment and demonstrated no\nreal progress in the genre by this \"name\" director going back to\n\"Se7en\". The emperor's new clothes methinks.\n"},
{"review": "\nThis starts off like a Lifetime thriller - Drew or Scott Peterson come\nto mind. But it's got a more A list cast and is slickly filmed with\nslightly too attractive household interiors and a black comedy vibe\nthat gives it a big screen style.<br><br>Ben Affleck looks quite weighed down as the unhappy husband. Rosamund\nPike's with her blank rather cold expression finally finds a role\nsuited to her as Amazing Amy.<br><br>The different perspectives and plot twists keep one interested and\nentertained for over 2 hours but the murder is just too much, more\nshocking than plausible. Something less brutal but more clever would\nhave made a better story.<br><br>Overall entertaining for its style but the story doesn't come together\nin a believable way.\n"},
{"review": "\nSo my wife, inspired by favorable critical as well as popular fanfare,\nhaving bought and finished reading the book exclaimed, \" now we have to\nwatch the movie. \" Upon the film's conclusion she looked at me and said\n\" Yeah, the book was no good either. \" We agreed that this flick is\nfodder for middle-of-the-night Lifetime channel viewing and that's not\na knock against Lifetime because we both enjoy the sordid salaciousness\nof many of their films, however most of the programming would never be\nconfused with brilliant filmmaking, which is what apparently happened\nwith the GG franchise. I see a lot of user ratings at \"1\" and while I\nunderstand that score, both Affleck and Pike are skilled actors not low\non the charisma scale. I can only believe that they didn't realize the\nstory would play out like an episode of \" The Edge of Night \" penned by\nTristan Tzara. I will say that I anticipate the MST3K version with\ngreat relish.\n"},
{"review": "\nThis is what movie's all about...twists? <br><br>The plot and the script (which are at the service of the \"twists\") are\nnot credible, so the movie provides the same features as the typical\nafter-lunch entertainment TV movie.<br><br>It is a shame that a director such David Fincher could have plumbed\nsuch depths. Furthermore, it seems logical to satisfy both adapting to\nthe times and practical needs. Even so, Fincher still remains one of my\nfavorite live directors. But it's fairly common that early movies (in\nmost cases), are the best. To maintain quality over time it's beyond\nthe reach of most. Only directors as Peter Weir, Andrei Tarkovsky,\nKrzysztof Kieslowski, Joseph Losey...to name just a few, are able to\nkeep with that level of excellence.<br><br>4/10\n"},
{"review": "\nA truly terrible movie. Didn't care what happened to any of the\ncharacters. How could I, because I never knew them? There is absolutely\nno motivation given for the female lead's pathological ways. I thought\nwe might lead back to some trauma she had as a child, but no, that's\nnever fleshed out, she's a generic monster. Her parents just kind of\ndisappear. The male lead's no better.<br><br>The plot has many, many holes, enough to drive a semi-truck through.\nLike many modern movies, it's bloated up to 2 1/2 hours what could have\nbeen told in 1:45. Because of the positive reviews, I was waiting for\nsomething clever to happen, some twist, but it was predictable from the\nbeginning.<br><br>A black hole and waste of time. The fact it's gotten such great reviews\nfrom professional journalists may be an indication of how terrible US\nmovies have become. Compared to the latest superhero movie maybe it\nlooks great. I will be more wary about choosing movies if this is what\npeople like today.\n"},
{"review": "\nDavid Fincher is without doubt one of my favorite directors working\ntoday. Fight Club and Seven are two of my favorite movies. The Facebook\nmovie was very good as well. Gone Girl is a complete waste of his\ntalents. Other than a great score by NIN Trent Reznor and some well\ndirected sequences, the movie falls completely flat. This story has\nmore holes in it than a slice of swiss cheese and makes absolutely no\nsense. The ending will tick you off and the unbelievable motives and\nactions from the characters will not ring true to life. After doing\nsome research on the book which I have yet to read, I found out the\nauthor of the book and also screenwriter for the film is a writer for\nEntertainment Weekly. Makes perfect sense as to why the screenplay\nmakes absolutely zero sense. EW is garbage magazine writing at its\nfinest. EW is made for the same type of people that have no jobs and\nwatch Maury Povich all day. You could probably hire a group of chimps\nto write a better story than this monstrosity. There are to many plot\nholes to mention. I could write a thesis on the plot holes in this\nmovie. The story has an interesting premise but the execution is flawed\nto the core. This is the type of film that Stanley Kubrick would have\nadapted himself during his prime and reworked the plot holes and flawed\nstoryline into something more fluid and believable.\n"},
{"review": "\nAfter 30 minutes you are still not interested. The 30 minute time frame\nis the cutoff for interest. The lines in the movie are so idiotic that\na three year old could have written them. I think people that wrote\ngood reviews actually were getting paid to do it. My wife likes chic\nflic's but this one is so stupid and the dialogue is so stupid that\nonly an idiot could like it. The scenes are ridiculous, the police in\nthe story are stupid and do not act like police. The main character\nwhich happens to be Ben Aflec of should i say Aflac, is searching for\nclues that his wife left after she disappeared and how can I say how\nbad the script is. It is for an emotional response from women. Men do\nyourself a favor and DO NOT WATCH.\n"},
{"review": "\nJust watched this film tonight on DVD. I was looking forward to it as I\nheard so much about it and being up for awards. What are they so\nexcited about? I found it a horrible movie. Falling asleep in first\nhalf of it and then could not believe it when she was found alive. From\nthen on I couldn't stand any one in the film save Neil Patrick Harris\nand female detective.<br><br>The female lead was awful and so was her acting. I was hoping she'd get\nput away where she belonged. Ben Affleck did okay but not his type of\nfilm. I felt he wasn't given a decent script and spent most of the film\nin a sort of trance. His character was so weak when you thought he'd\ndrop the dame fast. But she controls him and I hated that. No one in\nthis film has any redeeming quality at all. But maybe Harris. Big\nmistake for Ben to do this. No one else in film any good. Sorry. It\nreally made me sick.\n"},
{"review": "\nThis movie went through the paces.<br><br>Started out predictable and so so, rather blasé.<br><br>Then headed to a change about an hour in and that made it absolutely\nexcellent. Just really interesting, fun to watch, engaging, had me\ninvested in wondering what was going to happen next.<br><br>Then the end just went Wonka.<br><br>Like ludicrous and stupid. I ended up thinking that if that's what Nick\nwas stupid enough to settle for then that's what he deserved. Beyond\ndumb dumb dumb.<br><br>So disappointing! With a different ending this could have been a\nfantastic movie.\n"},
{"review": "\nThis started of as an intense absorbing thriller. It really is an\nabsorbing plot, we see the steady deterioration in their marriage and\nthen the love affair that ruined it. At times we're with him, at others\nwith her. The plot has numerous weaknesses but generally carries itself\nquite well. I watched it and considered any number of ways the story\nwould end. Was he really the bad guy and she a poor mentally abused\nwife? Was she a crazed psychopath who would kill him in the dying\nembers of the film? And in the words of Docking, having prepared for\neverything I was not prepared for nothing! This film has the worst\n\"We've really run out of ideas\" ending in cinematic history. What a\nhuge 2hr and 30min let down!!!\n"},
{"review": "\nI finally got around to watching 'Gone Girl'. With all the hype, I\nfigured it might be worth watching. It wasn't. My opinion is that this\nmovie fails due to poor directing, awful acting, lousy continuity, lack\nof plausibility, zero suspense. The biggest issue was Ben Affleck. Come\non people, he can't act. He doesn't act. I believe he could be replaced\nwith a cardboard cutout. Rosamund Pike was little better, but that may\nhave been a direction issue. Kim Dickens and Carrie Coon were the only\ntwo that brought game. Spoiler Alert, in my opinion, watching this move\nwill spoil your day. The rest of this is just filler. It seems that\nIMDb thinks reviews have to be long and boring. \" Your review does not\ncontain enough lines - the minimum length for reviews is 10 lines of\ntext. Please see the guidelines. Attempts to pad the comment with junk\nwords can result in your account being blocked from future\nsubmissions.\"\n"},
{"review": "\nI'm surprised at the viewer reviews of this movie. Every review I've\nseen for pages has been either a rating of 1 or a rating of 10 and I'm\namazed that what I considered a pretty mundane film is evoking such\nimpassioned opinions. The storyline of a wife framing her husband for\nher murder is a tale that has been told many times before (and often\ntold much better, imo). The plot was far-fetched with plenty of holes,\nas many reviewers have pointed out however, although I wasn't \"on the\nedge of my seat\", I was reasonably entertained. The antagonist was\ndefinitely despicable and I was rooting for Ben Affleck's flawed, yet\ngood, guy and his twin sister. All-in-all, I would sum it up as\nunremarkable - worth watching on video on a rainy night when you just\nwant to enjoy it for what it is without thinking too hard. If this\nmovie deserves a rating of 1 out of 10 (or for that matter 10 out of\n10) what do we have left for the truly awful (or truly masterful)\nmovies?\n"},
{"review": "\nThe more time passes since finishing \"Gone Girl\", the more the\naftertaste worsens. It did its job in keeping me guessing until the\nfinal credits, but with that bloated running time and those levels of\nhype, that can't be all it set out to do, right? Affleck and Pike are\nplaying such bland characters that I didn't care what happened to\neither of the Dunne party. I cared far more for Carrie Coon and Kim\nDickens, who were unquestionably side players. Neil Patrick Harris was\njust a plot device to get -SPOILER- Amy to return home and reveal that\nshe was alive.<br><br>Sure, Amy Dunne is a sociopath for the ages, but she's a terribly draw\ncharacter. This is all very hollow, like some big-budget Lifetime\nmovie.<br><br>No, thank you.<br><br>5/10\n"},
{"review": "\nThe acting and the script is so bad in this movie it almost seems like\nsome surreal dream, with so many twists and turns in such a drawn out\nmovie it just does too much and too little at the same time, however\nthat is possible I have no idea but it manages that, there's a lot of\nscenes this movie could do without and if you've seen it you'll\nprobably know which ones and not to mention the message that it puts\nacross. seems to be that there are very little good movies around these\ndays and we cannot even rely on established directors and producers for\na good film anymore. steer clear of this movie, it is Ben Afflek's\nworst performance to date and that is saying something!\n"},
{"review": "\nLacked drama and suspense. Why did she disappear? I asked myself \"what\nwas the whole point?\". At first I thought it was going to be similar to\nthe Lacy Peterson story and I watched it to find out what the hype was\nall about. No hype here. Watch something better. This movie was too\nlong, boring and annoying. I am so disappointed. Everyone recommended\nit and I can't see why... The only thing I can say is that Ben Affleck\nplayed a good role as a clueless and dumb husband. The character Amy\nhad nothing better to do. She was miserable and clearly insane. I\nstarted this review a little before the movie ended, it made me that\nbored. BORED! I wouldn't recommend this movie to anyone, sorry.\n"},
{"review": "\nA long way into the movie I was thrilled, and couldn't wait to see what\nit would end with. The acting was decent and i enjoyed Affleck as\nmysterious, couldn't spin my head around if he was bad or good. But\nalso have to say his character is a bit of a cliché. Rosamund Pike's\ncharacter i found very interesting, but it sounded like she was\nwhispering the entire movie really annoyed me.<br><br>As the movie came to towards the end, i just didn't get it. The plot\nhad been interesting for so long, and then ended crap. I would have\nloved to see some more twist to make me think more, instead if leaving\nme with the thought that I just wasted me time.<br><br>In real life, I really hope that the police wouldn't be so stupid. Why\nthe heck would anybody go to Nick Dunne (Ben Affleck) fathers house to\nburn the diary? Which would take no time to burn, yet fails. But do\nhave the time to clean up the huge blood pool, that supposedly happened\nwhen Amy was kidnapped. And to assume Desi Collings (Neil Patrick)\nkidnapped her, how did he know about Nick Dunne's fathers house?!\nAnother thing that really annoyed me, was that Amy was sent home from\nthe hospital COVERED in blood. Really...?<br><br>This had potential to be good, but failed. Not worth your time....\n"},
{"review": "\nThis film wasn't as bad as some people say it was. It was actually\ngood. It was a pretty nice psycho thriller. It had me guessing at times\nand there really weren't any dull moments. This film was well done with\njust enough suspense to keep me interested. The acting in this film was\ngreat as well. Now, I'm not a big fan of Tyler Perry's films but his\nacting is good. He had a wonderful performance in this film playing\nTannor Bolt, Nick Dunne's (Ben Affleck) lawyer. He was really perfect\nfor the part. For me it was kind of weird seeing Neil Patrick Harris\nplaying a serious roll as the crazy ex boy friend of Nick Dunne's (Ben\nAffleck) wife, Amy Dunne (Rosamund Pike). Rosamund Pike and the parts\nshe were in were well done! I mean she pulled that roll off! Amy Dunne\n(Rosamund Pike) was allegedly killed by her husband Nick Dunne (Ben\nAffleck). From the beginning Nick Dunne (Ben Affleck) is the suspect\nand the craziness starts from there. If you like mysteries/thrillers\nyou won't be disappointed with this one.\n"},
{"review": "\nthe story has revenge , meticulous planning , cruel manipulation and\nlies everywhere . the lost lady looks very charming in first meeting .\ni would blame husband for disappearance of his wife . the news hungry\nmedia tears apart husband under investigation . the message is - it is\nhuman nature to take advantage and nobody is a saint . also laws are in\nwomen's favour who can frame their husband or lover if they don't obey\n. example - consensual sex can be reported as abuse and alleged\noffender has nowhere to go . there are some marriage lessons here -\nfirst, don't take your partner for granted . second , stay faithful .\nparents should give little freedom to children lest they feel burdened\nunder ideal behaviour expectations .\n"},
{"review": "\nI was actually excited to see this movie because it was rated over 8.0.\nIf there were not so many huge holes in the story line and if they\ndidn't wreck the plot halfway through the movie, it could have been\nalright. They started by making you think that the husband had\nsomething to do with the wife's disappearance, then it was revealed\nthat the wife framed her husband. They should have just finished the\nstory by having him get revenge on her, but instead, they get some ex-\nlover involved to take the blame for everything and get killed too. The\nhusband and wife live happily ever after at the end of the movie! How\ncould he even live in the same house with such an evil manipulative\npsychotic murdering bitch?? How stupid are the police and detectives in\nthis movie? I could go on and on, but you can read the other bad\nreviews to see how ridiculous the plot and entire movie actually is. So\nmany things made no sense at all. We were very disappointed...why did\nsome of you give it such a high rating???\n"},
{"review": "\nSo implausible. There is really nowhere to begin. The acting was\nadequate but the plot was so full of holes it was just sad. This movie\naveraged 8.2 on IMDb based on the input of over 300,000 viewers. Very\ntroubling. I guess the biggest problem I had was once her plan became\nobvious to nick and, (correct me if I'm wrong but did she not leave a\nnote with the Punch and Judy dolls admitting to the whole thing ????)\nnick doesn't go right to the police and say here I solved the case for\nyou the whole thing from then on was ruined. OK even if there wasn't a\nnote confessing to all the crimes and ending the mystery and the movie,\nstill, when they found all that stuff in (HIS SISTERS SHED!!!) why\nwould they not go to the police then, no normal human being let alone\ntwo would think that the police wouldn't find it or try to hide it for\na minute. It's crazy. How do the actors not say hey wait a minute this\ncould never happen. I'm so mad I stayed up to watch this hunk o junk\nthat I felt compelled to write my first review ever. So bad.\n"},
{"review": "\nI'm not sure how this movie could have such a high rating. I suppose it\nhad its moments, but surely there has to be some, however thin,\nconnection that allows the audience to suspend belief enough to go with\nthe movie. That connection in Gone Girl is stretched beyond breaking\npoint pretty early on and never recovers.<br><br>The performances are good - I'm not saying it is a total stinker, but\nit just doesn't stand up to even the most casual reality check. If you\nwant to know some of the particular points that I refer to you can look\nat some of the recent reviews which outline them in great detail. But\nthen of course there are many spoilers to deal with - so here is a non\nspoiler warning - This Movie Is Just Too Far Fetched to suck you in so\nwhy not give it a miss?\n"},
{"review": "\nWell that's two and a half hours of my life I won't get back. Settled\ndown to watch this film with high expectations. I love a good, clever\nthriller which has you guessing all the way through. This one is not.\nIts dreadful. Half an hour in, you realise it is meant to come across\nas an arty, intelligent piece all about control rather than the 'edge\nof the seat' thriller it is billed to be. We persevered, still thinking\nit may improve and half way through it picked up a little and left us\nthinking if the ending is good it will have been worth it. It wasn't.\nLoose ends all over the place, poor plot and merely acceptable acting\nwill leave you scratching your head and still asking questions, even at\nthe end. Mainly along the lines of 'Why did I bother?'\n"},
{"review": "\nReviewed by: Dare Devil Kid (DDK)<br><br>Rating: 3.9/5 stars<br><br>Suspense, social commentary, a breakout performance from its leading\nlady, and a seriously twisted outlook - \"Gone Girl\" is one killer\nmovie. It's also a pitch-black satire of modern marriage, and one of\nthe most unsettling films of the year: The premise is flat-out creepy.\nMake sure you're game for that before you see it.<br><br>Directed by David Fincher and based upon the global bestseller by\nGillian Flynn, \"Gone Girl\" unearths the secrets at the heart of a\nmodern marriage: On the occasion of his fifth wedding anniversary, Nick\nDunne (Ben Affleck) reports that his beautiful wife, Amy (Rosamund\nPike), has gone missing. Under pressure from the police and growing\nmedia frenzy, Nick's portrait of a blissful union begins to crumble.\nSoon his lies, deceits, and strange behavior have everyone asking the\nsame dark question: Did Nick Dunne kill his wife? But there's more to\nthis darkly twisted scenario than meets the eye.<br><br>Fincher and Flynn (adapting the screenplay from her own eponymous book)\nhave fun playing with both our expectations and our sympathies. As they\npeel away layers of their story, a feeling of dread grows; it's like\npulling moldy leaves from an artichoke that is rotting from the inside\nout. With the close-knit psychological ambiance, the film paints\nAmerican middle class as a blood-curdling, emotional danger zone. It's\na testament to David Fincher's skill as a filmmaker that he makes\nsomething as complex as \"Gone Girl\" feel so effortless yet riddled with\npalpable suspense and spellbinding twists.<br><br>Couching its commentary in a propulsive pulp tale, \"Gone Girl\" is a\ngenre triumph - at once scary and deceptively sly. Dark, clever,\ntwisted, and stylish, this riveting thriller plays to director David\nFincher's sick strengths while bringing the best out of its female\nlead, Rosamund Pike.\n"},
{"review": "\nThe movie starts off very well with the murder of the hero's wife ,\nplayed by Rosamund pike , and builds up the story until halfway through\nwhen we find out she isn't dead.. But is just a wife , who wants to\npunish her husband for cheating on her , by giving him a death sentence\n(by framing him for his death)... First of all , the steps she takes\nfor doing it , defies logic.... And the logic behind those , are not so\ngood either...Some of the reviewers have already said a lot about\nthis... And in the second half , she just uses the Neil Patrick\nHarris's character after she gets robbed and kills him for going back\nto live husband??? Seriously?? What sort of c**p is this??And the\npolice believe this s**t?? And also , the ending was not\nsatisfactory... Expected something better after so much buildup ...But\nwell , it was very plain.. And over all... it was quite c**p.. And the\nmovie is seriously , Very , Veryyy Over Rated.. You are bound to be\ndisappointed if you watch this flick with a properly working\nbrain...Would have given it a better rating if ending was better.. And\nto say about acting , Affleck is fine , Rosamund Pike acts like a crazy\ngirl... But at some places , its pretty bad.. And the Lawyer and the\ntwin acted pretty well.. Overall doesn't deserve the overall rating it\nhas got ...\n"},
{"review": "\nAlthough the film contains several gimmicks which have apparently\nattracted the attention of the easily entertained, the plot and story\nare deeply flawed.<br><br>The plot contains numerous gaps in logic which are so obvious that\nthere are already several threads about this.<br><br>Basically, the story involves a recently married couple. The husband is\nclearly not as enthralled with his wife as he was when he proposed. The\nwife, who is aware of this, has become a psychopath and will do\nanything to damage her husband.<br><br>The biggest and most ridiculous flaw in the film is that the wife,\namong other things, has decided to kill herself so that her husband\nwill be accused of murder and, she hopes, get the death penalty. This\nis much like the joke of the robber who tells a victim: \"Give me your\nmoney or I'll shoot myself.\"\n"},
{"review": "\nThis is just an example of awesome filmmaking! Everything worked for\nthis movie! The acting was impeccable, every actor did their job\nbeautifully, and each character was so complex in the film. Everyone\nhad two sides to them, or at Least you come to find out. Rosamund Pike\nwas amazing as our lead actor, very well deserved Oscar nomination and\nGolden Globe nomination. And let's not forget Ben Affleck our other\nstar. He did a great job of playing the somewhat disturbed and confused\nhusband. This mystery thriller had soo many twists and turns throughout\nthe whole thing! That is what I love, surprises!! I was very shocked to\nsee tyler perry involved in this, but he did very well with his\nmaterial, and so did Neil Patrick Harris! Warning: if you get unsettled\nat rough violence or sex, this probably is not the one for you, the\nwhole story is very eery and somewhat dark. Oh, and the ending is mind\nbending!! Very exciting ending!\n"},
{"review": "\nNick Dunne(Ben Affleck) returns home from \"The Bar\", a local pub owned\nby him and his sister, to find his wife Amy Elliot Dunne(Rossamund\nPike) missing. As police investigation looks further into the case,\nAmy's disappearance becomes a country-wide issue when disturbing\nevidence begins to point towards her husband Nick. As more evidence\nrises against him, this once \"perfect\" man is now being seen as a\ndisturbed sociopath as everyone asks him the ultimate question: Did you\nkill your wife?<br><br>In probably one of the most disturbing movies of tbe year, Gone Girl\nexplores the definition of \"marriage\" and what leads to a corrupted\none. Nick and Amy are seen as the perfect couple, picture-perfect and\nrich. However, this quickly changes. In the matter of 5 years, Nick and\nAmy become incompetent of maintaining this marriage as we see Nick\nunravel as an evil, lecherous man through Amy's eyes and thought. <br><br>Most people seem to judge the performances in this film, especially Ben\nAffleck's as Nick, but in my opinion, he did an amazing job of\npicturing Nick. His evasiveness towards Amy's disappearance, his\nnaivety towards everything and most of all his arrogance/ignorance\ntowards Amy. While I don't want to completely spoil Amy's character, I\nwill say this: She is one of the most well crafted, and deceiving\nsociopaths ever created in film or literature. Her horrifying\ninterpretation of revenge and marriage is disturbing yet fascinating at\nthe same time. <br><br>While Gone Girl is most definitely not for everyone, it is truly an\namazing film. It is dark, incredibly well acted, a faithful adaptation,\nand most of all, it try does deliver. Lifetime movie? I think not.<br><br>9/10\n"},
{"review": "\nHow well you will like or love this movie depends on your experience in\nlife; or you have a passion for the intricacies of human relationships.<br><br>The pace of the story/plot is subtle. The twists and turns are totally\nunexpected. The timing and cadence of this movie is precise. It never\nfelt like a screen play written on a software program telling these\nartist when and where to make shifts/changes.<br><br>There is no area in the movie (acting/directing/settings) that stands\nout to break your attention (speed bumps); so you are totally immersed\nin the movie. At the end I literally was on the edge of my seat wanting\nto see more.<br><br>The story isn't one dimensional; the husband did things that I didn't\nfeel was right, no matter what the circumstances. Moreover, for\nexample, women bad men good or vice versa.<br><br>Based on my experience in life; this was a great movie with the element\nof truth that makes it phenomenal. For example, people in a\nrelationship do get to know and anticipate what to do or say to get the\nother person to reveal a little of what they are thinking (their\nagenda).<br><br>For men who have gone through a traumatizing relationship; this movie\ncan be therapeutic, and women can substitute the man being the wife. I\nidentified completely with the husband at the end that until she's done\nwith me; I had better take my chances with her in the same house than\nto have her out their plotting against me. Also, there is no telling\nhow many land mines she has laid out for me or for how long. Once she\nleaves I could be dealing with situations that blow up in my face for\nyears after she's gone. It is the ultimate no win scenario where you\nhave to go with the lesser of two evils and suffer.<br><br>I have no conflict of interest and I will be watching this movie\nseveral times over this year (2015).\n"},
{"review": "\nNow I know that the average film viewer isn't the brightest person,\nwhich is why making a movie can be successful (Jesus Christ it's in top\n250).<br><br>Now I have watched my fair share of movies and I have never seen a\nmovie with SO MANY RETARDED Plot holes. I have gathered a favourite top\n3.<br><br>3: Who would leave a book that you really want to burn, so UNBURNED..?\nI like that the police actually try to cover up this plot hole in the\nmovie (I guess the writers already knew it was absolutely retarded)<br><br>2: How come the police take no interest in watching the footage of Neil\nPatrick Harris house (oh boy is he miscasted, maybe just me)? Wouldn't\nit be a little odd that he and her disappears out of frames, only to\nenter them brief moments later (when he's not even in the house)\ncovered in blood?<br><br>1: The last one isn't really important to the movie, but who on EARTH\nwould send a woman home SOAKING in the blood from a man she murdered?\nOh right - so they could have that conversation in the shower.<br><br>The list is long with things that make no sense and with things that\nwere add quite comically to make the plot continue, for instance the\nscene with the selfie and the \"smile\".<br><br>If the movie would just have ended with them either of them killing\neach other or a zombie-like Neil Patrick Harris avenging his murder\n(that's a good idea actually) I might have given it a little higher\nrating. Instead we're left with this ridiculous psychological crap\nending and the first thing I did after finishing this movie was throw\nup. Now I need a new computer.<br><br>Gave it 3/10 for seeing that hot brunette's tits. I liked her.\n"},
{"review": "\nThe amazing performance by Cate Blanchett in the movie Blue Jasmine was\nexplained for the mass audience. Plus, the women dominated movie was\nnarrated from a male perspective, so everything in the world could be\nnormal again. It was fairly predictable, and most of it has been seen\nin so many movies before. Only the last quarter there was a glimpse of\ngreat acting from the woman lead role, yet nonetheless it was not\nenough to convey a message or unleash an emotion. It was a typical Ben\nAffleck movie with a meaningless ending and no message whatsoever. Dull\nand unfinished. It is something that has been seen so many times\nbefore, that has lost all of its meaning.\n"}
]